{"Reviews": [{"Title": "Long overdue!", "Author": "English teacher", "ReviewID": "R17IETJS08TAAQ", "Overall": "5.0", "Content": "English teachers who work with native speakers of other languages will be thrilled with these flash cards. They are handsomely printed on durable stock with a protective coating for years of shuffling. I've been making my own for over twenty years, but the result has never approached the artful and clear design of these sturdy and compact cards. Students of linguistics should also find these cards useful for developing fluency in IPA transcription.The transcription of the example words for English is a nice compromise between overly broad and unnecessarily narrow. Diacritics, for example, are largely limited to markers of length and syllabicity. A General American accent is the model; primary and secondary stress are marked, as are syllable boundaries. For most ESOL/EFL teachers (at least in the US), the 43 cards covering all the sounds of American English will get the most use, and they are conveniently color-coded (Deck 2) to distinguish them from the rest. Linguistics students will likely spend more time with the other two decks, one with the symbol on one side and its phonetic description on the reverse, and the other giving the names for the individual symbols. The decision to separate into decks and package all three decks together was both generous and wise: for a slightly higher price, you have the capability to accurately describe the languages of any of your students, even if they hail from South Sudan!One might complain that a tool for teaching the sounds of a language should actually make those sounds audibly. (Perhaps the folks at Minokidowinan already have an app for the iPhone in the works!) But really, the task to which these flashcards are best suited is improving the fluency of phonetic transcription, which is, after all, necessarily a written exercise.", "Date": "July 19, 2011"}, {"Title": "Very interesting and accessible!", "Author": "ghost house", "ReviewID": "R1XOQ8ACO588RC", "Overall": "5.0", "Content": "While I have a pretty limited knowledge of phonetics/linguistics as a formal discipline, I entered a drawing to win a set of  these cards, because although I have rudimentary knowledge about the IPA, I have always been very interested in it.  These cards make learning and understanding the international phonetic alphabet accessible, and not intimidating.  The three different decks break down each symbol into three components- the phonetic description, transcriptions, and the symbol name.  This breakdown allows you to focus on studying one component without being inundated with too much information, which is helpful if you've just been introduced to the IPA/ phonetics study, and allows you advance your study at your own rate.  The cards are clear and concise, and laid out nicely!  I've really been enjoying using and learning these cards!", "Date": "April 2, 2011"}, {"Title": "Pretty Nice Cards", "Author": "Eleece", "ReviewID": "R1JCHAC2ZCNNS", "Overall": "4.0", "Content": "I'm starting my Masters in Teaching English as a Second Language so I wanted something to help me with studying the phonetic alphabet.  These cards are ok, but I wish for the price they would have a little more information.  They give you the mere basics you would expect from flash cards and do not give much more explanation.  That would be fine if I wasn't paying almost 60$ for them. There are many complex terms on the cards that they do not explain at all.  SO not a bad set, but I would have liked them to be a bit more in depth than they are.  Other than that they are made well and have a good organization system.", "Date": "May 11, 2013"}, {"Title": "great practical tool, very well-done!", "Author": "meghanstrick", "ReviewID": "R148VZUJZQNQD6", "Overall": "5.0", "Content": "As one with a Bachelor's in Linguistics and much exposure to the world's languages, I have to say these flash cards are excellent.  They are broken down into 3 different flash card types, each one helpful in its own way to mastering the phonetics of the world's languages.  My only disclaimer would be that these cards do require some base-level prerequisite linguistic knowledge.  For example, one set of the cards provides the IPA symbol on one side and the description of the sound on the other.  If you are not familiar with basic phrases used in phonetics like \"central, back, closed, rounded,\" etc... you may have to do some research before using the cards, because there is not an in-depth explanation on the cards.  It is this simplicity and organization of the cards that I actually greatly appreciate.  Lastly, these cards may seem a little pricey... I will say that I think it is worth it.  These cards are made to last and they are a great tool for learning, teaching, using with non-native speakers of a language, using for students learning other languages, etc.  I would recommend these cards to anyone interested in linguistics, learning a new language, or teaching.", "Date": "January 15, 2014"}, {"Title": "International Phonetic Flashcards", "Author": "Julie A. Thompson", "ReviewID": "R3JU1UZ4J0UBV1", "Overall": "5.0", "Content": "I purchased these flash cards to get a head start on my Speech and hearing class in International Phonetic Alphabet study.  These flash cards are perfect and I will get a lot of use out of them.", "Date": "July 18, 2012"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "0615421881"}}