{"Reviews": [{"Title": "This book's a lifesaver", "Author": "C. Juszak", "ReviewID": "R2MCX553KZI0WY", "Overall": "5.0", "Content": "While the T3 is a pretty easy camera to use, there are a lot of hidden features and tricks I would probably never have discovered without this book. Chapter 3 starts out with...\"One thing that surprises new owners of the Canon EOS Rebel T3 is that the camera has a total of 496 buttons, dials, switches, levers, latches, and knobs bristling from it's surface. Okay, I lied. Actually, the real number is closer to two dozen controls and adjustments, but that's still a lot of components to master, especially when you consider that many of these controls serve double-duty to give you access to multiple functions.\"This quote serves two purposes here; to illustrate that this is not just a dry reference manual and to point out that there are in fact quite a few bells and whistles that the camera has to offer. I've actually found this book to be an enjoyable read; however I also spend a lot of my time studying military standards which can make just about anything else seem interesting! While it may seem time consuming to read a book geared to just one camera, it's actually a time saver if you really want to know how to get the most out of your T3.", "Date": "November 26, 2011"}, {"Title": "Covers everything you must know -- and more.", "Author": "Western Photo Reviews", "ReviewID": "R1H8TA2T3JEB0G", "Overall": "5.0", "Content": "This is the latest of Busch's best-of-breed guidebooks, offering a comprehensive manual for the Canon EOS Rebel T3 entry-level digital SLR. The T3 is a basic 12-megapixel model that lacks some features and the high price tag of more luxe beginner cameras like the T3i, but its affordability will attract beginners who want a camera with room to grow into.  Busch's book has the information you need to learn and grow, supplying easy explanations of using the T3's basic features accompanied by simple introductions to the kind of more advanced capabilities that will help even the rawest neophyte take the best pictures of their lives. Although very accessible, this book goes much deeper than the run-of-the-mill camera guides to offer advice on how to use every control, select every menu option.. The author's friendly style leads you through the camera's features and tells you not only what each capability does, but gives examples of when you'll get the most benefit from using it. Busch explains all the new features for the D5100 in a way that's easy to understand. His novel approach is to condense all the essential information about each and every control on the camera into a multi-page \"roadmap\" that explains their functions without the need to leap around from page to page, as is the case with the Canon manual. He devotes several full chapters to outlining every menu option, and actually provides much more detail than you'll find in most of the other \"expanded\" guides for the T3.Although this book is comprehensive, it's easy reading, and if you want a condensed version to carry around with you, Busch offers that too. His David Busch's Compact Field Guide for the Canon EOS Rebel T3/1100D is a worthy replacement for those laminated cheat sheets that fold out into six index card sized tabs with one-sentence summaries of most of the menu settings, too. While the portable version duplicates some of the information found in this book, the two make a great pair for home and field. You'll want to buy them both to have the information you need on the go and for study at home.", "Date": "July 28, 2011"}, {"Title": "Love this book!", "Author": "Amazon Customer", "ReviewID": "RDELFZI16ORQJ", "Overall": "5.0", "Content": "I am new to the Digital SLR world.  This is my first camera I had bought, so the next best thing was to invest in the book to see how my camera works... Well I'm learning so much stuff, it's crazy!!  This book is well written and easy to understand. There is a field book also, that I did not purchase at first, and I should have!!  That will be my next purchase, that way if I forget something I have read, I can pull out my field book and have it handy!!!", "Date": "September 24, 2011"}, {"Title": "Absolutely informative and helpful", "Author": "Amanda", "ReviewID": "R2OI53BGIMPVPQ", "Overall": "5.0", "Content": "I had never used or even purchased a dSLR before and was debating on buying the T3/1100D. I was looking at various guides and this one really stood out. I breezed through others but it was David Busch's guide I bought. I actually bought his guide to field work which is rally helpful too.This book was the deciding factor on whether I wanted the t3 or not. I did all of my research read through all of the reviews on the T3 however I did not know how comfortable I would feel with this camera. I could play with it all day at the store but if I couldn't understand from the guide and from my own level compentency it just wouldn't be the purchase for me.David Busch really did a great job. This book is for everyone no matter how skilled you are with the dSLR already. I felt immediately comfortable and truly felt like I was understanding and grasping his directions. He did not assume anything on the readers part nor did he speak down to the reader.I have since added several other books of his to my wish list. I have this one on my kindle but I think I will be buying it in paperback as well just to have a backup incase I want to flip or highlight anything on actual paper. I have since followed him on his blog and become a very big fan of his writing. I may not know everything heck or even 1% about photography but I do feel that it is something I can learn and am not thinking it is an impossible task anymore thanks to Busch's books", "Date": "December 31, 2011"}, {"Title": "Perfect companion.", "Author": "Image Print Reviews", "ReviewID": "RLPWH1O9Q2M1U", "Overall": "5.0", "Content": "Although this book is similar in layout and much content to the author's T3i guide, owners of the entry-level T3 model need this version, because the features of the two cameras don't completely overlap.  This one is written specifically for the T3, and is easily the best available guide for this camera. A quick glance through this innovative book shows that Busch is the world's best-selling camera guide author for a reason. His books are a cut above the other books, which all repeat what you see in the book packaged with the camera, without going into any depth on how to use them. This one, although compact and portable,  is different, with Busch's trademark friendly introduction to the Canon EOS Rebel T3, accessible to anyone -- novice to veteran -- who wants to learn how to use the camera quickly. In that respect, it's great for beginners. But the author is especially skilled at taking you beyond the basics to explain exactly how to apply the features of the T3 to improve your photographic skills.Individual chapters of the book explore the finer points of exposure, including the use of histograms, understanding the T3's autofocus options, HD movie-making, and creative ways to use lenses and light. There are thirteen chapters in all, each of them dealing with a different aspect of using the EOS T3. Even the general material on topics like f/stops and exposure all relate directly to his camera.This book is especially good for those who feel they are \"visually oriented.\" These folks tend to gravitate to DVD instruction, not realizing that such productions are basically audio programs with images, and aren't really visually oriented at all. With a DVD, you're basically using your ears to listen to a talking head explain the camera, and what you hear may not sink in immediately. Busch's guide takes the right visual approach, using large full-color illustrations accompanied by the text you need to quickly understand what the author is explaining. We've reviewed several of Busch's guides, and, after reading this one, still wonder why all camera guides aren't this good.", "Date": "July 28, 2011"}, {"Title": "\"Sit down with me and let me show you how...\"", "Author": "sford122", "ReviewID": "R1UAXXVFTSDKVA", "Overall": "5.0", "Content": "I purchased my Rebel T3 about a month ago and am in love with this camera.  It is my first dSLR and I have a lot to learn as a newbie.  I've identified a wonderful photography forum at Ugly Hedgehog.com and enjoy seeing photos and reading how photographers caught their shots.  Many links are provided to hundreds of websites for further information.  This has been fun but overwhelming in trying to learn the ins and outs of dSLR and specifically my T3, just because of the massive amount of information that is available and so much of it that is not applicable to my T3.  However, what I gained most was one user stating that \"anyone who owns a Rebel T3 needs to get David Busch's Canon EOS Rebel T3/1100D Guide to Digital SLR Photography\".  My search led me to Amazon and after reading the first chapter free, I was hooked.  I purchased the Kindle version so I have it to take with me as needed.  It is easy to read and the picture quality is good, even though it is in black and white only.  Having it on my computer Kindle library is like getting 2 books for the price of one.  The large computer colored screen view with fantastic quality pictures is a real plus.  As to the quality of the information the author provides, I find it exceptionally easy to understand.  He really does make me feel like he is sitting down with me and showing me how to use my new camera and all of its features.  I just made my purchase today and am so pleased with it.  This is one book that I know I will read cover to cover and will have as a much used reference book in the future.  I agree... anyone who owns a Rebel T3 needs to have this book.", "Date": "November 10, 2011"}, {"Title": "Great Book", "Author": "Holly B", "ReviewID": "R1RO4H3X08OAZM", "Overall": "5.0", "Content": "This book is amazing.  I've learned so much about my camera, things I didn't even know my camera did.  It even has information on which lenses to use and other accessories.", "Date": "July 24, 2012"}, {"Title": "Pleased with book purchase", "Author": "Peter Borza", "ReviewID": "R1MFA6KY2HV9ER", "Overall": "5.0", "Content": "I have read most of David Busch's \"Canon EOS Rebel T3/100D Guide To Digital Photography\"  and would recommed it for anyone owning a Canon Rebel T3 DSLR camera.  The author explains many features more detailed than the brief owner's manual and this book is worth buying.", "Date": "February 24, 2012"}, {"Title": "Must have", "Author": "Mamatobe2012", "ReviewID": "RFT5M1DP53C7A", "Overall": "5.0", "Content": "I bought and read this book after buying my first DSLR.  It was essential in understanding how my camera worked and to understand how to apply techniques from Brian Peterson's field guide (my other favorite photography book).  I still find myself going back and referencing this book if I get a new add on for the camera or don't quite understand how to achieve a certain technique.  It's great and I always recommend it to people getting their first DSLR camera.", "Date": "January 5, 2012"}, {"Title": "You Need This Book", "Author": "Mary Buchanan \"Mary B\"", "ReviewID": "R3H5FY5EFOK29L", "Overall": "5.0", "Content": "I got the Canon T3 and the manual is on a DVD.  That isn't real convenient.  I don't want to run to the computer every time I have a question.  The big plus is that this book is written specifically for this camera, which is just what I needed and wanted.  The camera is pretty simple to use but if I want to get a little more advanced this book walks me right through it.  I can take the book along with me and don't have to go boot up the computer to TRY to find an answer on the DVD.", "Date": "October 24, 2011"}, {"Title": "Great book!", "Author": "Masha", "ReviewID": "R3KM5O62ALGIU7", "Overall": "5.0", "Content": "My camera sat unused, in the box, for over a year because I was intimidated by all of the functions. After reading the first few chapters, I was navigating the camera with no problem! I would recommend this to anyone new to DSLR photography.", "Date": "August 25, 2013"}, {"Title": "Be a rebel expert!", "Author": "emerson", "ReviewID": "R14MU9BS7JEJHF", "Overall": "5.0", "Content": "This complete book goes into every detail of this camera in \"plain english\" for the non-professional. I bought both the field guide and this complete version.  Although I  love the field guide, this \"complete\" book gives the most in depth details you could ever want or need to use this camera. The author doesnt use \"technical\" mumbo jumbo so be assured if your a beginner you will feel comfortable learning all the ins& outs of this great camera.", "Date": "March 8, 2013"}, {"Title": "GOOD INFORMATION", "Author": "Paul S. Fisher \"gonfishn2011\"", "ReviewID": "R30R34ZA3Z8K2X", "Overall": "5.0", "Content": "This is a great book.  Almost like a course study.  It covers the basics and gets you ready for the advanced stuff.", "Date": "January 25, 2013"}, {"Title": "Good guide for beginners", "Author": "Lisa R.", "ReviewID": "R1IVMPPFKN63HY", "Overall": "3.0", "Content": "I'm a first time DSLR camera owner.  I bought this book to show me all the ins and outs of my camera.  It goes through set up and all the features.  That part is great.  I just wish it was written for someone that had never used this type of camera.  Some of the terms were a little over my head.  Still it is a must have but I'm still going to do more research.", "Date": "January 25, 2013"}, {"Title": "Perfect book", "Author": "Glenis Boulanger", "ReviewID": "R3R1ED0EMHIR74", "Overall": "5.0", "Content": "I am very pleased that I decided to buy this book. The font size is nice and big for my tired old eyes and there are plenty of nice big pictures to show different aspects of the camera.This is so much more than a book to show me how to use my new 1100 D, it's a book that will teach me a lot about photography as well.", "Date": "January 21, 2013"}, {"Title": "David Busch's Canon EOS Rebel T3/1100D Guide to Digital SLR", "Author": "Pearl E. Newman", "ReviewID": "R2T4159MT7GKNP", "Overall": "5.0", "Content": "Good reference. Easy to understand A course in it self on how to learn how to operate your camera and take great pictures", "Date": "January 8, 2013"}, {"Title": "David Busch's Canon EOS Rebel T3/1100D Guide", "Author": "Doris E. Williams", "ReviewID": "R3N7RAAQ7FYHSG", "Overall": "5.0", "Content": "Good Book of Canon instructions....(and it is hard for me to understandwhat I read...but certainly no trouble with this.)  A book well written.", "Date": "November 28, 2012"}, {"Title": "Great Additional Purchase", "Author": "L. Romero", "ReviewID": "R2RFO5XPI3BOPN", "Overall": "5.0", "Content": "This book is an excellent additional purchase for anyone just starting out with a DSLR or someone who just wants to know more. This book along with all of David Busch's books have information for the beginning to advanced user. It contains excellent clear instructions that pertain to your camera model. That are accompanied by pictures and examples. If you spend the money on a camera like this it is worth it to spend a little extra on this book to make sure that you get the most out of your camera.", "Date": "October 16, 2012"}, {"Title": "satisifed reader in ga", "Author": "readerinGa", "ReviewID": "R2I3LSU42C4RNH", "Overall": "5.0", "Content": "Excellant Book... describes the camera in great detail. gives some great hints.. well worth the money.  This book should be included in the camara box!", "Date": "August 12, 2012"}, {"Title": "Canon eos book", "Author": "John Calland", "ReviewID": "R3NLRRYZXEOY7X", "Overall": "5.0", "Content": "A very good book covering all the intricacies of the Canon camera.  This was very useful since I have not used a digital SLR.", "Date": "August 10, 2012"}, {"Title": "Nice", "Author": "Guillermo", "ReviewID": "R303M8CGIT0MJI", "Overall": "5.0", "Content": "This is a great book for all photo starters, I would definitely recommend it to my friends. Good shipping time and nice quality paper.", "Date": "January 18, 2012"}, {"Title": "A Must Have", "Author": "Barb", "ReviewID": "R2D3XVTIE8QCK1", "Overall": "5.0", "Content": "This book helped so much in learning how to use my new camera. Step by Step instructions.  The Book is a Must have item. You won't be disappointed.", "Date": "January 9, 2012"}, {"Title": "Great reference", "Author": "NanaMac", "ReviewID": "RE3VUBSUTSKTN", "Overall": "5.0", "Content": "This book contains just about everything you will need to understand your camera. It is  much better than many other books I have gotten. This is written specifically for the Canon T3 which makes understanding the instructions  much easier. There are pictures of the camera to help explain the text. I got this because I was taking a class that required I use my owner's manual that came with the camera. After the first week I knew I was in trouble because the manual that was included did not have the information I needed. Purchasing this book made all the difference!", "Date": "May 13, 2014"}, {"Title": "Everything you need to know and Canon failed to tell you.", "Author": "Howard Streitfeld", "ReviewID": "RV93QCGB4CWL6", "Overall": "5.0", "Content": "David gives much better instruction about the Canon T3 than anything I've gotten from Canon.  It is laid out wonderfully and explains many concepts that were difficult to understand without his help.", "Date": "April 8, 2014"}, {"Title": "Guide to Digital SLR Photography", "Author": "B. Cline", "ReviewID": "RIUY5HP5XKPAF", "Overall": "4.0", "Content": "I thought I was buying the book on the T3i instead of the T3. I should read more carefully, It was my fault.Still a lot of very useful info that covers most of my camera and photography in general.If I feel I need the guide for the T3i after reading this, I know where I can find it.", "Date": "April 4, 2014"}, {"Title": "In depth guide to teach you everything you want to know about your T3", "Author": "B. Bogert", "ReviewID": "R33VQGU0QUK7OI", "Overall": "5.0", "Content": "If you're a complete beginner to the world of SLR photography, you should probably pick up a different book first to get a better understanding of aperture, ISO, focal length, etc. However, if you have a basic knowledge of photography, own a T3 and want to get the most out of it, this book is a must have. This book covers nearly every feature of the camera in great detail and offers good examples of when to use certain features, along with explanations and suggestions for making necessary compromises to achieve the results you want from any type of shot you're trying to capture.", "Date": "March 23, 2014"}, {"Title": "concise, highly detailed", "Author": "Justin R", "ReviewID": "RL2IWOZ63CWLJ", "Overall": "5.0", "Content": "Highly detail led guide not only on the camera but how to shoot digital photography with it. I read this after I had hee camera for a year and I still learned a lot, definitely worth a read.", "Date": "February 4, 2014"}, {"Title": "Big help.", "Author": "Jim Bulin \"Histeacher\"", "ReviewID": "RCU8TXNR73RJ8", "Overall": "4.0", "Content": "I bought a T3 for my wife for Christmas.  It is her first slr/dslr and she has really gotten good results with it.  This book has helped although the camera itself is fairly user friendly.  She has never entered a photo contest before but she submitted 2 photos to a contest in a state park and one of them won first place.  The book got her up and running sooner than she could have without it and she is excited about experimenting with some of the other tips in the book.", "Date": "January 26, 2014"}, {"Title": "For someone else", "Author": "E Trexler \"Elaine\"", "ReviewID": "R1ZG2I7DL3J0S3", "Overall": "5.0", "Content": "This is a very nice book.  I bought it for my 15 year old grand daughter (to go with the Rebel T3 we got her for Christmas.)  I believe it is written on a level that everyone can understand.  Just glancing through the book I discovered the  Wi-Fi SD memory card; I had no idea such a thing even existed!  I cannot give a \"real\" review of the book since I am not going to be using it, but just scanning it, I had no regrets about buying it.", "Date": "December 19, 2013"}, {"Title": "great book", "Author": "Heather", "ReviewID": "R36R8EG11FIOCV", "Overall": "4.0", "Content": "Very easy to read and informative!  I recommend this book..it was better than the book that came with the camera!", "Date": "November 3, 2013"}, {"Title": "Another Must Have", "Author": "Thombar", "ReviewID": "R2IUNAAZTGZO5R", "Overall": "5.0", "Content": "When I bought my Canon EOS Rebel T3 I was overwhelmed with all the bells and whistles.  I started in reading the manual and was really worried I wasn't getting clear enough information to use everything the camera offers.  Then I bought David Busch's book and my worries were put to rest.  Everything is explained in a clear way with lots of pictures to show you exactly what to do.  This is a must have book if you own this camera and are just learning photography with DSLR cameras. It even has a companion book with the same name but in a spiral bound field guide.  Buy it too and take it with you when you are away from your big book and need quick answers.", "Date": "October 15, 2013"}, {"Title": "Thank you.", "Author": "Sonya", "ReviewID": "R3JA9VJL9LQTLV", "Overall": "5.0", "Content": "I haven't had a whole lot of time to dig into the book yet because of my work schedule, but just flipping through it, I know that this book will answer any questions that I may have.  Thank you!", "Date": "October 15, 2013"}, {"Title": "Exactly what I was looking for", "Author": "Taylor Dericco", "ReviewID": "R29O6OOKCT6KBU", "Overall": "5.0", "Content": "Book was exactly what I needed to get a better understanding of my camera. I love it, and am glad I made this purchase!", "Date": "October 4, 2013"}, {"Title": "Understandable camera users guide.", "Author": "Selwyn F.", "ReviewID": "RNVOCRVO8O2MU", "Overall": "4.0", "Content": "It has helped me understand the operations of my camera in very simple to follow instructions. I would recommend this book for not just the beginner but the advace camera enthusiast.", "Date": "July 20, 2013"}, {"Title": "good guide", "Author": "gw42 \"Gail W\"", "ReviewID": "RZ5IEHGEM63B9", "Overall": "4.0", "Content": "This book is easy to follow and it explains camera features well.  I have not yet read the whole book as it is a lot to digest so I am taking it a step at a time.  It has a good index.", "Date": "July 16, 2013"}, {"Title": "OK", "Author": "Alan E. Neutzel", "ReviewID": "R35XPFRG0YGD4B", "Overall": "3.0", "Content": "I have been reading this book and it assumes you already have some knowledge of this camera. I did not! Before I bought my Canon T3, I used a Sony point-and-shoot camera. I have decided to read the CDs that were part of the camera package. They are easier to understand.", "Date": "May 5, 2013"}, {"Title": "Great Book for Novice SLR User", "Author": "Susan Greenberg", "ReviewID": "R17LWO0M9IN3TG", "Overall": "5.0", "Content": "I bought this camera and then realized if I wanted to get all the benefits out of it, I would have to do more than set it on auto.  This book is a great guide for learning.  I read it once to just get an overview of some things I should know and then went back and spent some time digesting all that he was explaining.  I will be referring to this book for some time as I practice my photography skills.", "Date": "May 4, 2013"}, {"Title": "Cannon Rebel T3/1100D", "Author": "Judy Larson", "ReviewID": "RJEP9QY0UW7B1", "Overall": "5.0", "Content": "It has been a great book for learning my Canon Rebell and all if has to offer.  Thanks Mr. Busch for putting this together for us.", "Date": "April 13, 2013"}, {"Title": "Better than your camera's manual", "Author": "Sports Nut \"sports nut\"", "ReviewID": "R2CQ7E2J29Y7TF", "Overall": "5.0", "Content": "I am only in the beginning stages of using this book and I downloaded the Kindle version.  The photographs and user information are very helpful.  I bought this book because the T3 is my first DSLR camera.", "Date": "April 8, 2013"}, {"Title": "perfect", "Author": "John M Freligh", "ReviewID": "R1M22N83B6BT73", "Overall": "5.0", "Content": "well written and easy to read. must own for learning your new (or old) camera. filler word filler filler filler", "Date": "April 8, 2013"}, {"Title": "Great book", "Author": "Cobra79", "ReviewID": "ROR3G9N6I4DEV", "Overall": "5.0", "Content": "Have not had a chance to read the whole book yet, but from what I have read so far, it has been very helpful.  There are a lot of features, buttons, etc. on the Canon Rebel T3, and this will help me understand how to get the most out of my camera.", "Date": "March 1, 2013"}, {"Title": "Great help", "Author": "RG", "ReviewID": "R32X09JN1KLHFH", "Overall": "5.0", "Content": "This book is a great help and easy to use.  There are so many things to learn about this camera that are now easier to figure out with the aid of the book.", "Date": "February 28, 2013"}, {"Title": "A Great Guide for a Great Camera", "Author": "Ted Detjen", "ReviewID": "R2NEKF7OLY4IRA", "Overall": "5.0", "Content": "David Busch's guides are written in plain, easy to understand language.  This guide supplements the guide on CD and short paper book guide that came with the camera.  It has useful tips, and clear diagrams, and helps you navigate through all the menus.", "Date": "February 23, 2013"}, {"Title": "EOS Rebel T3i Book", "Author": "Bruno J. Bischoff", "ReviewID": "R13B5A4AX5YD4G", "Overall": "5.0", "Content": "Great book, an easy read with many illustrations and suggestions on how to use the many features of the camera.", "Date": "February 5, 2013"}, {"Title": "Guide to the Canon EOS Rebel T3", "Author": "Prettylilpet \"~plp\"", "ReviewID": "R1JEMQ0QJR4YUO", "Overall": "5.0", "Content": "It's a great guide to figuring out the ins and outs of my camera. I've already improved how I take pictures and I use the book to find out the \"how\" behind making great photos with my new camera.", "Date": "January 28, 2013"}, {"Title": "Excellent Book", "Author": "shopper", "ReviewID": "R3RGTUR1Y0809Z", "Overall": "5.0", "Content": "Very good book, informative and easy to follow.  I  recommend this book to everyone for the EOS rebel T3.  This was my first digital camera and this book was excellent.", "Date": "January 27, 2013"}, {"Title": "Good Book", "Author": "Melissa C Henderson", "ReviewID": "R3QTCQNH2UD2CO", "Overall": "5.0", "Content": "My husband just got the camera and it a more specialize camera than what he has ever had.  He has found the book to be very informative and can't wait for the weather to warm up to start really getting into his new hobby", "Date": "December 23, 2012"}, {"Title": "good book", "Author": "dan steele", "ReviewID": "R31BEV8AEIYETY", "Overall": "4.0", "Content": "My son read the book and use the camera for collage course and had no problems with understanding any of the imfo", "Date": "December 4, 2012"}, {"Title": "Somewhat disappointed", "Author": "Elfin Reviews", "ReviewID": "RYDCA91IVFTIL", "Overall": "4.0", "Content": "I recently purchased a Canon T3 - an upgrade to my original Digital Rebel.Bought this title based on the 5-star reviews here.I was a bit skeptical when I read in the first paragraph of Powering Up/Setting Date and Time:Rotate the On/Off switch on top of the camera to the On position. \"Automatic sensor cleaning takes place (unless you specifically disable this action) as the T3 powers up.\"As the Canon salesman pointed out to me - the T3 does NOT have any automatic sensor cleaning!Back in Chapter 13 he posts the correct info:\"The EOS T3 lacks one of the most common features found in all Canon cameras other than a stray entry-level model or two like this one: automatic sensor cleaning.\"I'm thinking this was a copy/paste of the T3i or T2i with editing done.  I wonder what else I will find amiss.He also fails to mention that to get to a lot of the camera settings via the menu, the mode must be set to M.But, all in all, I suppose I will actually learn how to use my DSLR on other than the creative or auto modes.", "Date": "January 12, 2012"}, {"Title": "Great Instructions on Canon T3 1100", "Author": "h2army", "ReviewID": "R2ERA0AV8OF4L8", "Overall": "5.0", "Content": "The book is easy to understand and put together well for an amateur getting into Photography.  I like how the basic information is given first and the details are in later chapters.  It is comprehensive and gives instruction on how to reprogram your camera to meet your personal needs and desires.  I will keep this book as a reference for my camera.", "Date": "August 4, 2012"}], "ProductInfo": {"Price": "$29.99", "Features": "NULL", "Name": "David Busch's Canon EOS Rebel T3/1100D Guide to Digital SLR Photography [Paperback]", "ImgURL": "NULL", "ProductID": "143546026X"}}