{"Reviews": [{"Title": "A \"Must Read\" for this camera", "Author": "JesseJ", "ReviewID": "ROGLLTHRDY2TD", "Overall": "5.0", "Content": "I recently purchased the Nikon D5100 and read the owners manual as diligently as I could, trying to figure out how to fully use all of the possible options this camera has to offer.  It becomes quite apparent that the Owners Manual simply isn't enough.I ordered this book and it arrived a couple of weeks ago, and it really opened my eyes as to what this camera is capable of.  Everything is set out in sensible chapters, shows and explains every mode available, and gives you a sense of empowerment over the camera, instead of bewilderment.If you are upgrading from a basic DSLR or taking a huge jump to this camera as a first DSLR, then this book is a must.  Without it, or something like it, then realizing the full potential of this camera could take a very long time, and be very frustrating.With my camera body I bought a very good lens.  I'm delighted I also bought this very good book.", "Date": "September 18, 2011"}, {"Title": "Most complete and easily-understood D5100 Guidebook", "Author": "Western Photo Reviews", "ReviewID": "R1S3YJBOS1UGM3", "Overall": "5.0", "Content": "This is the latest Busch's industry-best guidebooks, offering a comprehensive manual for the Nikon D5100 mid-level digital SLR. This one is a companion for Nikon's ground-breaking upgrade from the entry-level D3100.  The D5100 features a swiveling LCD, full HDTV movie making, 16.2 megapixel resolution, and other features not usually found in a low-cost D-SLR.  Busch gives them all a workout in this book, going much deeper than the run-of-the-mill camera guide to offer advice on how to use every control, select every menu option, and take the best pictures of your life.  The author's friendly style leads you through the camera's features and tells you not only what each capability does, but gives examples of when you'll get the most benefit from using it.  Busch explains all the new features for the D5100 in a way that's easy to understand. His novel approach is to condense all the essential information about each and every control on the camera into a multi-page \"roadmap\" that explains their functions without the need to leap around from page to page, as is the case with the Nikon manual. He devotes several full chapters to outlining every menu option, and actually provides much more detail than you'll find in most of the other \"expanded\" guides for the D5100.Although this book is a weighty tome, it's easy reading, and if you want a condensed version to carry around with you, Busch offers that too.  His David Busch's Compact Field Guide for the Nikon D5100 is a worthy replacement for those laminated cheat sheets that fold out into six index card sized tabs with one-sentence summaries of most of the menu settings, too. While the portable version duplicates some of the information found in this book, the two make a great pair for home and field. You'll want to buy them both to have the information you need on the go and for study at home.", "Date": "July 28, 2011"}, {"Title": "Worth the Investment", "Author": "Derek Fray", "ReviewID": "R1UY5QHW1GR4B7", "Overall": "5.0", "Content": "David Busche hits a home run with this book.  The information is written in such a way that even the most beginning camera buff can understand the concepts and the step-by-step approach makes learning how to use a very complex camera simple.  The color photos are clear, the instructions and menu descriptions are accurate and easy to follow.  I was looking for an informative manual since the user's manual that comes with the camera explains what everything is and or does, but it falls short on telling the user \"WHY\" to use certain settings or features for certain results.  David Busche is a fantastic teacher and no-nonsense expert in photography and the use of Nikon Cameras.  I cannot recommend this book highly enough.. If you have recently purchased the Nikon D5100 or any Nikon product, this book is a MUST HAVE companion and an absolute bargain for the price.", "Date": "April 16, 2012"}, {"Title": "Manual with larger and colour photos", "Author": "Peter Theobald", "ReviewID": "R396YQ9TJDAK2N", "Overall": "1.0", "Content": "I purchased this book based on the author's reputation and on other positive reviews but am sorry to report that I was disappointed. I went through it once, it is only a glorified manual, with larger photos in colour instead of small line drawings the manual has.  It tells you what each control or button does, but how exactly to use it, when to use it and why to use it -- is often not covered. At times it tells you what it does (exactly as the manual does) without further elucidation, which is why people buy the book in the first place.I think it might be a cut-and-paste from some earlier book the author has written about another Nikon camera, because on one page (Page 134) it refers to a \"focus selector lock lever\" which is non-existent on this camera model (d5100). Not expected from an author with one million books in printOn the positive side, it contains some useful info about lenses, accessories, software, but not worth the price of the book.I am unlikely to open it up again. I also bought \"From Snapshots to Great Shots on the D5100 - I think that is a better buy", "Date": "June 14, 2012"}, {"Title": "Very helpful guide to the Nikon D5100 DSLR camera", "Author": "Paul C. Gaertner III \"Model builder\"", "ReviewID": "R14E3EY0SCJX0A", "Overall": "5.0", "Content": "I bought this book, after having seen the D5100 in a camera store, to help me decide if I wanted to spend the money (about $1,000.00 for the camera body and two lenses) to buy the camera. After skimming through the parts of the book that covered the kind of close-up studio photography of miniatures that I hoped to do, I was convinced I should buy the camera. After I had bought the camera, the book was indispensible for using the camera effectively, being much more comprehensive than the Owner's Manual that came with the camera. When I had questions about how to improve my photography, the book's well organized Table of Contents and Index led me to great solutions. If you are thinking about buying the Nikon D5100, I think this book is essential.", "Date": "June 22, 2012"}, {"Title": "Excellent for photographers \"getting back into it\"", "Author": "vanbyssum", "ReviewID": "RVARDT1BAIW9S", "Overall": "5.0", "Content": "You'll need to have a working knowledge on F/stop, shutter speed, and ISO. But this book is excellent and very helpful. It's very comprehensive and explains every little function of the camera. You learn to realize that you can set the camera maybe 3 different ways and still come up with the same outcome... and that's comforting as a photographer when you have to think-quick and your subjects are moving all over the place. (it's good to know you have options to get a good photo!).Excellent book. Worth the $ and if you spend the time reading every page (sometimes twice), you'll have as much knowledge as a seasoned photographer.", "Date": "June 5, 2012"}, {"Title": "Busch's Guides", "Author": "Ron Nolder", "ReviewID": "R2OSC3UGNYNTC", "Overall": "5.0", "Content": "Would highly suggest this to any buyer of a Nikon D5100. Had purchased a camera prior to this and used the Busch Book for start and learning digital cameras.", "Date": "June 19, 2013"}, {"Title": "Well Written; Easy to Understand", "Author": "Jennifer Sahrle", "ReviewID": "R3LLP88DAIGTVP", "Overall": "4.0", "Content": "Well written for both beginners and more advanced. Its really quite interesting. Now, if the pictures would just take themselves, i would be all set! I highly recommend this book if you're going to spend the money on an expensive camera.", "Date": "May 28, 2013"}, {"Title": "I've already learned so much.", "Author": "Adra Elkins", "ReviewID": "RIVJ2ZISZ9J1X", "Overall": "5.0", "Content": "I've had this book for about two weeks now, and I've gotten about halfway through it, and I've already learned so much that I didn't know about my camera, and with what little bit I've read, my photos have become obviously much, much better!If you bought the Nikon D5100 within the past year, this is a must read!", "Date": "May 3, 2013"}, {"Title": "Great Guide for the D5100", "Author": "James Hood", "ReviewID": "R1JULY729G5VH2", "Overall": "5.0", "Content": "What I loved about this book was that Busch presents everything you need to know about the Nikon D5100 is easy to digest chunks.  He starts with several quick start chapters that help you hit the ground running, saving the in depth information for later chapters when you really need it.  For example, he first shows you how to set the various autofocus options so you'll get sharp focus just about every time.  After you've shot a bunch, you'll be ready for the clear explanations of exactly how autofocus works in Chapter 5, so you can vary your settings according to Busch's recommendations to give you sharp focus in problematic situations.  There are separate chapters on shooting movies, working with electronic flash (both built in and external flash), and descriptions of all your lens options.  The Nikon D5100 is an intermediate camera, suitable for both beginners and more enthusiastic photographers and Busch does an excellent job of helping both groups discover the possibilities of their camera.  Recommended.", "Date": "August 17, 2011"}, {"Title": "Instructive and Informative", "Author": "Pat", "ReviewID": "R2HA9L1S9B10T8", "Overall": "5.0", "Content": "I am very happy I chose this book over others. I can't wait to start using some of what I've learned.", "Date": "August 25, 2013"}, {"Title": "Great Book for the camera", "Author": "Cp", "ReviewID": "R2RWBWZ9Z6HPIF", "Overall": "4.0", "Content": "I refer the book often so that I can stay current with my camera. There are new things I learn everytime I open it", "Date": "August 22, 2013"}, {"Title": "very comprehensive", "Author": "David Wade Smith \"laughingdragon\"", "ReviewID": "R3PI3H1R8RUM30", "Overall": "5.0", "Content": "This book beats hell out of the skimpy manual that comes with the camera. If there's ever anything I need to know, it'll be in here, and well explained.", "Date": "April 13, 2013"}, {"Title": "Very good", "Author": "Teddy Chan", "ReviewID": "R1ENKRNZHQLXMK", "Overall": "5.0", "Content": "Excellent Manual I have not seen a manual as complete as this, with every detail explained the operation of the Nikon D5100.", "Date": "March 4, 2013"}, {"Title": "Really helpful", "Author": "Megan", "ReviewID": "R3S3W4P5XJAQZN", "Overall": "5.0", "Content": "I am new to dslr photography and was looking for a book that would walk me through all of the functions on my new camera; not only how to use them, but when and why I want to. I started reading \"Understanding \"Exposure\" to learn some of the basics about photography and then turned to this book to show me how to apply those techniques to my own camera. This book is great, really easy to follow and very thorough. I really appreciate how the author structured the walk through from basic to advanced techniques, and the extra info about lenses and software.  This is a great guide to help you get familiar with the d5100, don't be intimidated by the size! Highly recommend.", "Date": "February 25, 2013"}, {"Title": "Great for a DSLR newbie", "Author": "G. Roper \"wgroper\"", "ReviewID": "R3N89R4IRNOV7W", "Overall": "5.0", "Content": "Very good explanations of not only the D5100, but basic photography concepts as well.  I debated spending $18 on a book when there is so much information available for free on the internet.  I'm really glad I bought the book.  David Busch's style makes it an easy and even entertaining read.", "Date": "January 30, 2013"}, {"Title": "Excellent Resource", "Author": "Coachjohnson58", "ReviewID": "R5GB9832XUGP7", "Overall": "5.0", "Content": "A great resource for someone returning to photography.  I have used the book to supplement photography classes I am taking.  I find myself constantly going back to the book to better understand once I have completed my classes.  Looking at other books by the author.", "Date": "January 5, 2013"}, {"Title": "Great companion book", "Author": "R. Guieb \"Rosiebud320\"", "ReviewID": "R34OYCBN4CBGHT", "Overall": "5.0", "Content": "This book is another of my must have's for learning my D5100 Camera.  I have a few books and this is one of my favorites.  Its helping me to become a better photographer.", "Date": "December 13, 2012"}, {"Title": "DAVID BUSCH AGAIN HITS THE MARK!", "Author": "marc518", "ReviewID": "R3H12LSR3KEI75", "Overall": "5.0", "Content": "Busch writes lots of books on DSLR's and Advanced Point and Shoots. His book on the Nikon P7100 is magnificent.This book exceeds that and is incredible.  Very useful, it is not a rehash of the Nikon Manual and is aimed from the beginnerto the professional and tells you about the features:  what they are, why you should use them, or not:There is a high level of personal excitement excuded in this Book.", "Date": "December 8, 2012"}, {"Title": "Worth every nickel", "Author": "Friendly Computer Guy", "ReviewID": "R1JATE5IU4IJM1", "Overall": "5.0", "Content": "After purchasing my D5100, I was looking for some detailed \"how to\" instructions specific to my camera.  This book was just what I was looking for.  I quickly picked up on the settings I wanted to use and was firing away in no time.", "Date": "November 13, 2012"}, {"Title": "Upgrade", "Author": "edbran", "ReviewID": "ROKQ3BQ66HBLM", "Overall": "5.0", "Content": "My son and I both purchased David Busch's Nikon D5100 Guide to Digital SLR Photography as we had upgraded our cameras and both found the book excellent and covered everything you needed to know about all the buttons and menus. We always use Amazon for our cameras and lens and accessories for the wonderful service over the years.", "Date": "August 21, 2012"}, {"Title": "Excellent Easy Read Book", "Author": "King James", "ReviewID": "R3VS7ZDIO0NNTI", "Overall": "5.0", "Content": "This is a very explanatory book, written in layman's terms, so that even I can understand it. Mr. Busch goes into detail, and explains things in easy to understand terms.", "Date": "July 28, 2012"}, {"Title": "Excellent Information", "Author": "CatmClyde", "ReviewID": "R2I2WN51SY2OD6", "Overall": "5.0", "Content": "This is the book you need to really understand how to operate your Nikon D5100!  David makes the book both informative and actually interesting to read.If you really want to learn how to do something besides use the \"auto\" button, you will need to read this.  Highly recommended!!", "Date": "July 18, 2012"}, {"Title": "Nikon D5100", "Author": "Eduard", "ReviewID": "R2HFVS8H2MSBST", "Overall": "4.0", "Content": "A great book to explore your Nikon D5100 so forget about the original Nikon manual. David Busch's Nikon D5100 Guide to Digital SLR Photography is easy to read and helps a lot to get to know your camera! Also very useful is the section on lenses. Therefor most of us will not be limited to a 18-55 kit lens;)", "Date": "September 11, 2011"}, {"Title": "A good combination of tech information and personal recommendation", "Author": "JackOfMostTrades \"Jack\"", "ReviewID": "R1N5B9JWBR2S6N", "Overall": "4.0", "Content": "For a general all-around guide to the D5100, I don't think you'll find a better book. However, be forewarned that the first section of the book explores Nikon technology that allows for this camera's ability to grab images in low light, capture color, use 3D Matrix focusing, more accurately record the light spectrum. This is interesting stuff, but it won't necessarily teach you how to use the camera optimally.  The rest contains great advice and is clearly written, and he author is able to complement the technical information with recommendations based on personal experience.  The Nikon D 5100 has a number of bells and whistles that I don't think most photographers will hvae much use for In the latter case, i.e.,the author spends a lot of time describing features you may not ever use. The only other non-Nikon consumer guidebook I've had was a \"PIP\" publication, and if the comparison between this manual and the \"PIP\" manual can be generalizable to both series, I'd say there's no contest. This one is far, far better.", "Date": "April 27, 2012"}, {"Title": "Almost what the manual should be", "Author": "Patrick Holt \"txdragon\"", "ReviewID": "R3398D27XLPC7V", "Overall": "4.0", "Content": "I am a big fan of reading the manual.  But the manual that came with my D5100 was rather lackluster.  This book (on the kindle) is really a great guide to your camera.  Its is very in depth covering all the features of the camera and how to use them.  The author also shares what settings or configurations he recommends based on his experience.  The book covers everything starting with broad aspects of the camera and then drilling down more in depth for each feature or aspect of the camera, such as the auto focusing system or the light metering system.", "Date": "February 22, 2012"}, {"Title": "Great book, Great value", "Author": "C G \"C G\"", "ReviewID": "R1ARI39O1XCOX8", "Overall": "5.0", "Content": "this book is AWESOME!  a friend of mine at work bought his new d5100 camera a couple of months before me, but i found this book before he did.  he liked what i showed him on amazon so much that he had to get his own.  this book is all encompassing.  it is very detailed and easy to read and understand for the beginner photographer.  it has a ton of pictures and covers everything you possibly could need to know about the d5100 and other photography in general.", "Date": "December 27, 2011"}, {"Title": "David Busch's Nikon D5100 Guide to Digital SLR Photography, 1st Edition", "Author": "EMR", "ReviewID": "R33665UKHJTQR8", "Overall": "3.0", "Content": "I have had my camera for about 2 years now and still havent finished this book. For me its just so hard to read. i have learned a few things in the pages that I have read, but I can't say that I would recomend this to a friend/family member I 'd tell them to look at different books first.", "Date": "March 27, 2013"}, {"Title": "Good book, would like something a bit more 'hands on.\"", "Author": "J.M", "ReviewID": "R71HDVRO9G0IE", "Overall": "4.0", "Content": "I hate to bash on any book, and this is no exception. The author is very good at detailing every aspect of the camera, its settings and more. What I would like to have seen was a good step-by-step to taking picture styles. For example, a page on the proper settings for taking lightning shots, or a page for taking photos of outdoor plants. Granted, this author does some of this. I was hoping for a 'cheat sheet' of sorts so I could practice with just one item at a time.", "Date": "September 20, 2012"}, {"Title": "very nice. Will use it a lot.", "Author": "Albert G. Last", "ReviewID": "R3OKTRLR9PRP0Y", "Overall": "5.0", "Content": "Book is very detailed and not too large so easily carried in my camera bag.Book looks to be new and not used. Thanks for the great book and fast shipping too.", "Date": "May 10, 2014"}, {"Title": "Great Book:", "Author": "George Mattie", "ReviewID": "R27XJOIT7PS04L", "Overall": "5.0", "Content": "Unlike other manuals including Nikons manual, this book tells you everything there is to know about the D5100.Now I can really use this tool to produce the images I want. Thank You David.", "Date": "May 3, 2014"}, {"Title": "Love this book!", "Author": "siouxzie lee \"sioux\"", "ReviewID": "R1AHT58NSR236J", "Overall": "5.0", "Content": "Very helpful reference book!  I have several ebooks but sometimes the real book is handier. Great to bring with me when I'm on the move for quick searches.", "Date": "February 21, 2014"}, {"Title": "David Busch's Nikon D5100 Guide to Digital SLR Photography, 1st Edition", "Author": "Robert W. Bremner", "ReviewID": "REL1FU72H96TP", "Overall": "5.0", "Content": "Lots of information for you to use in learning photography and using the new camera. Very helpful with setting you want and questions you may have. A great book.", "Date": "February 12, 2014"}, {"Title": "great for beginners", "Author": "Brian Wright", "ReviewID": "R21TCR5HHUFMXO", "Overall": "5.0", "Content": "this book is well written, has clear explanations, and is worth the moneyhaving just bought my first dslr, it will be a while before i need to buy more books", "Date": "January 31, 2014"}, {"Title": "Easy to read and Easy to Understand!", "Author": "Mary R. Whittington", "ReviewID": "R274ZIYDUBE2KT", "Overall": "5.0", "Content": "I am a digital camera newbie.  I've had my camera for about a year (shame on me), and have only used it for point and shoot.  I finally decided I should learn to use it, so I purchased this book.  It is very easy to follow for beginners like me, but he makes recommendations for you more advanced users to move on to the next page in order to skip the basics that would probably bore you. In the short time I've had this book, I've learned so much!  His writing style is engaging and easy to read.  He doesn't get caught up in a lot of technical jargon, but explains things very clearly.  I had bought another book to help me and had to toss it.  This book has been very beneficial since it is specifically about my 5100 and not going back and forth about the Canon and the Nikon like so many others. I am excited to play with my camera again in fun new ways.  This book has been a major help!", "Date": "January 17, 2014"}, {"Title": "Perfect book for my Nikon 5100", "Author": "Mary P. Redrick \"johnny bill\"", "ReviewID": "R2Z9OJN729F92B", "Overall": "4.0", "Content": "I haven't had a chance to get into the book really good but have enjoyed and learned a lot from what time I have had to read it and experiment with my camera.", "Date": "November 20, 2013"}, {"Title": "For my daughters D5100", "Author": "James Milligan", "ReviewID": "R2KNC0MVXW2HF0", "Overall": "5.0", "Content": "Awesome book and it was a perfect companion for the camera I bought for my daughters 30th birthday.  She loved the book because it explained the camera perfectly", "Date": "November 2, 2013"}, {"Title": "Well written, in English. Recommendable", "Author": "Don K", "ReviewID": "R17OVOOYU8HQVY", "Overall": "4.0", "Content": "Still reading/looking up stuff in it, but so far have no cmplaints, answered most of my questions. Point by point explanations.  Very usefu, recommendable.", "Date": "April 9, 2013"}, {"Title": "David B Nih\\kon D 5100 Guide", "Author": "Dr Dorivam Celso Nogueira", "ReviewID": "R33HA2T4I74LG8", "Overall": "5.0", "Content": "It's a nice book, a very very  very useful bookI recommend it to everybody,begginers e\\and non begginersIt's very clear", "Date": "March 20, 2013"}, {"Title": "great book", "Author": "Ioana", "ReviewID": "R3W34EAMQKWLWE", "Overall": "5.0", "Content": "very usefull book if u want to learn to use your camera, however will not teach u how to take artistic photos and stuff", "Date": "March 10, 2013"}, {"Title": "Photography Book", "Author": "Darryl Meeks", "ReviewID": "R32P96O99XN48I", "Overall": "5.0", "Content": "Just love the book. It has really helped me figure out my camera and its settings. Would recommend to anyone that has just purchased a nikon d5100 camera. Great shipping.", "Date": "December 7, 2012"}, {"Title": "A must get for D5100!", "Author": "J. Neary", "ReviewID": "R2R8L4PVD6JOKF", "Overall": "5.0", "Content": "I just bought the D5100 and this book is the perfect companion. Easy to follow. Great pictures and diagrams. As a newbie to this camera, this book helps a ton!", "Date": "January 16, 2012"}, {"Title": "A good book for the novice or experienced", "Author": "AZ Shooter", "ReviewID": "R2EB5IM596G9K7", "Overall": "4.0", "Content": "I received the Nikon D5100 camera as an early Christmas gift and was appalled at the skimpy manual that came with it.  I immediately ordered this book and have learned and discovered so much about this great product.  Hey Nikon, you should make this book part of the package!", "Date": "January 6, 2012"}, {"Title": "Not for a beginner", "Author": "Donald R. Dunn \"Get it on Don\"", "ReviewID": "R1L3EXJN1GJ4Z9", "Overall": "2.0", "Content": "I tried to set the release mode following this book. I started at the beginning of the book and then chased the instructions from chapter to chapter and page to page having to look up where the different buttons are on the camera. You only get a little snippet of the instructions in each area of the book. I never found out how to perform this after looking for at least 15 minutes. Instead of having it all in one location with easy to read instructions. I then challenged my wife to try and figure it out using the book. She is still trying to follow this with no results. If this is this guys idea of easy instructions for a beginner then don't bother with any of his other books either. I also purchased the Field Guide and  tried using the pictures in it to help.  I also tried the instructions in the Field Guide and they were also not complete. Following this book I could not get most of his instructions to work at all. If I could return this book I would but now I am stuck with both of them. I was hoping for a book that is easy to read and has all the instruction for a function in one location, with maybe a picture of where the button are you need to use for that particular function. This book is only good for a person that knows all the terms and is very familiar with this camera. My wife is still trying and she finally gave up on the book and is just poking around and having much better luck. So far the things that do work are nothing like the book says. If you do  figure out how to use a function I suggest you write it down because it will take you another hour to figure it out again. I think this camera is pretty confusing to start with and having some one that is a camera nut can not write instructions that are easy to read.Save your money and look some where else for help.", "Date": "September 16, 2012"}, {"Title": "wow a lot of info", "Author": "mountain man", "ReviewID": "R3BENZSLJHX3Q9", "Overall": "4.0", "Content": "this book is packed with everything you need to know about the D5100.I would suggest purchasing sticky tabs like i did to mark the important pages of the book that you want to get to quickly.If you want to learn how to use everything this camera has to offer then i would buy this book", "Date": "November 10, 2011"}, {"Title": "The manual", "Author": "GWade \"Wade\"", "ReviewID": "R26NO14Y46NIKN", "Overall": "5.0", "Content": "I not only bought the full version, I also bought the field version so I can keep it handy while I learn the nuances of the camera controls. This is my first DSLR and it has been over 10 years since I had a similar film camera system. I am looking forward to testing and regaining my camera skills. The point and shoots I have been trying to use during the interum have just not given me the same satisfaction...", "Date": "December 15, 2011"}, {"Title": "great product", "Author": "Nathan S. Retzlaff", "ReviewID": "RNEOLG4LYYR81", "Overall": "5.0", "Content": "Great book if you want to learn about the new Nikon camera.  Easier to read than the manual and more interesting, thank you to the author.", "Date": "October 1, 2011"}, {"Title": "Good Book", "Author": "Eric Bercovich", "ReviewID": "R2VDKJC47EPDIA", "Overall": "5.0", "Content": "Very Simple, and it does what it is supposed to do. For sure will recommend to anyone that likes it", "Date": "February 25, 2013"}, {"Title": "Excellent guide book", "Author": "William B. Webber", "ReviewID": "R15EMD6GDUQ6Y8", "Overall": "5.0", "Content": "I read this book cover to cover right after I bought my Nikon D5100 and liked it so much that I gave this copy to my son-in-law as a Christmas present to help him use his new Nikon D5100.", "Date": "January 8, 2013"}, {"Title": "David Busch's Nikon D5100 Review", "Author": "Valley Dude \"Blues Junkie\"", "ReviewID": "R2FGV7TYX6G92L", "Overall": "5.0", "Content": "I highly recommend this book to those who own the Nikon D5100.  It is necessary for those who rely on detailed instruction to learn about new technologies.  I am thankful to the author.", "Date": "December 7, 2012"}, {"Title": "Just okay", "Author": "T. R. Brown", "ReviewID": "R137SHTPS4UI0K", "Overall": "3.0", "Content": "Okay, but too many references to chapters further into the book. Poorly written but informative if you have the patience of Job.", "Date": "August 26, 2013"}, {"Title": "David Busch's Nikon D5100 Guide to Digital SLR Photography, 1st Edition (Purchased on February 20, 2012)", "Author": "starle", "ReviewID": "R33LFJOOD1R9X8", "Overall": "5.0", "Content": "This is a very informative book.  More in depth than the field guide.  Goes into greater detail and is very well written.", "Date": "April 16, 2012"}, {"Title": "D5100 book review by David Busch", "Author": "Joe Radcliffe \"Grandfather\"", "ReviewID": "R1DDN1X5BPI6PT", "Overall": "4.0", "Content": "The camera is very complex with a lot of settings that help get a good photo. The books helps navigate around all these settings. I use it almost every day as I use the camera especially in my adventure into HDR.", "Date": "February 5, 2012"}, {"Title": "Great User's Guide", "Author": "dlv \"Debbie\"", "ReviewID": "R1RTG4AL3S49QF", "Overall": "5.0", "Content": "I purchased David Busch's Nikon D90 Guide a couple years ago and was quite impressed.  He explains the camera functions in terms that are easy to follow.  When I recently purchased the Nikon D5100 - I knew that I just had to get this book too.  His guides are excellent, and I would recommend any of them.", "Date": "February 1, 2012"}, {"Title": "A must have", "Author": "Vier \"Vier\"", "ReviewID": "RK2O8OS65LETO", "Overall": "5.0", "Content": "I bought this book before buying a Nikon 5100 based on reviews. I can now only confirm that this book is an excellent resource that will make it possible to make the most out of the camera. Organization is excellent as well as are the illustrations.", "Date": "December 15, 2011"}, {"Title": "Nikon D5100", "Author": "Mike", "ReviewID": "R3544NDBBXQE18", "Overall": "3.0", "Content": "I have marked this book down a bit as some of the information is generic and not specific to the d5100 it mentions features which do not exist on this camera, however overall it is a good manual with lots of information on the nikon d5100.", "Date": "October 11, 2011"}, {"Title": "Same info as in the manual", "Author": "Peter", "ReviewID": "R24XNYQG4FEL5G", "Overall": "1.0", "Content": "This book does not contain any additional information over the user's manual that comes with the camera. Moreover, there is incorrect information and missing points that the manual does explain. I've read a lot of text on this camera and information about the camera I would have expected to find in a book intended to supplement the manual.  I suggest finding another book on the D5100.", "Date": "June 2, 2012"}, {"Title": "Very Helpful", "Author": "Blaine E. Moyer \"JarheadBlaine\"", "ReviewID": "R3JO5UCZAWYMZQ", "Overall": "5.0", "Content": "While I am a very experienced photographer who has a Master's Degree in Fine Arts Photography and has owned Nikon cameras since 1969, I needed something beyond the Nikon supplied Owner's Manual for this camera. I looked at David Busch's larger guide to this camera and felt it was overkill for my needs. That being said, this book is just right. I bought the camera as a supplement to my D200 because I was intrigued with it's versatile, movable LCD screen.  I wanted to find out quickly how to use all the whizz bang features. This book does all I wanted and more.Because the D5100 is an entry level camera it contains some information that is much more fundamental than I need. The book is still a great resource. I recommend it to anyone who purchases this fascinating new camera from Nikon.", "Date": "January 30, 2012"}, {"Title": "Great manual for a new SLR User", "Author": "Georgio55", "ReviewID": "R2LTJ210DQ1EJ4", "Overall": "5.0", "Content": "Great Book.  Very complete but also well balanced in terms of specific tips and useful technique.  Also bought the smaller user guide to carry with the Camera..The author who has other titles for other cameras is very skilled.  If you buy the 5100, buy this book.", "Date": "January 17, 2012"}, {"Title": "Nikon 5100 Guide", "Author": "Jimmy", "ReviewID": "R633O3E1N9UKU", "Overall": "5.0", "Content": "This book has been very informative in assisting me learn the digital way of photography.  The Nikon D5100 is my 1stDSLR", "Date": "November 22, 2011"}, {"Title": "This book is IT", "Author": "eric", "ReviewID": "R1K7ZTIV247IMD", "Overall": "5.0", "Content": "This book is the one to buy if you are wanting to know all of the functions and controls of the Nikon D5100.  I have gone back to this back more often than all of my others combined.  Great price for such a big book.", "Date": "September 10, 2011"}, {"Title": "Awsome", "Author": "marine2000 \"robert ashmead 2\"", "ReviewID": "R2KMO9KDHROA0Q", "Overall": "5.0", "Content": "I love this guide and the other 2 nikon guides i have bought from david busch all 3 the D5100 D3100 and D3000 are all well writen easy to read and understand and followif you have a camera and want to be able to use it like a pro check to see if busch has written a guide if so its the only one you will ever need", "Date": "August 28, 2011"}, {"Title": "Why not for Kindle???", "Author": "Obi-Wan-Kenobi \"Kenobi\"", "ReviewID": "R2PLNIB7Y2V9LQ", "Overall": "2.0", "Content": "I'm buying a Nikon D5100 and I have read great things about this book... but why to carry it on hand...??? A almost 400 pages book, you don't want to waste your time searching page by page or going back to the index for searching a topic, when this can be done with an easy search word from a tablet... it can be easily taken with a Kindle, simpler, easier to carry, and mainly it's GREEN! no paper waste!!!Come on Amazon!!! Get it for Kindle!!! It's better for tablets!!!", "Date": "June 1, 2013"}, {"Title": "Great Paper Copy - Soft Copy Available Anywhere", "Author": "hidden", "ReviewID": "R3RRS0AVWBJBD4", "Overall": "2.0", "Content": "This is a great purchase if you want to have a paper copy available at your fingertips. However, this publication goes no further than that which has already been posted in soft copy.", "Date": "May 16, 2013"}], "ProductInfo": {"Price": "$29.99", "Features": "NULL", "Name": "David Busch's Nikon D5100 Guide to Digital SLR Photography [Paperback]", "ImgURL": "NULL", "ProductID": "1435460855"}}