{"Reviews": [{"Title": "Better than the park map, but do not trust it for kayaking", "Author": "Nicole M", "ReviewID": "R2JCHODG7WMHTA", "Overall": "3.0", "Content": "It is better than the NPS park map but when it comes to navigating a place like Nine Mile Pond, trust your GPS and carry a compass. It has the numbers totally inaccurate and that could cause some serious problems. They claim it is up to date, but it is not! The thing that annoys me about the folks who publish this map and field guides is they get it vetted by some knuckle head who poses as an authority but is clueless. It never occurs to them to try to use their product or watch their target market use them. So, the product is mediocre and they could care less. At one time National Geographic stood for some level of integrity but that seems to be a thing of the past.", "Date": "December 29, 2013"}, {"Title": "Good for planning, not for navigating", "Author": "Micheal Gaige", "ReviewID": "R3QCFJGF199SJG", "Overall": "2.0", "Content": "This map is useful for planning while sitting in the comfort of your home, or perhaps navigating the road system from your car, but is not, repeat not, a backcountry paddling map. We brought this map on a week-long kayak trip. The detail is insufficient to navigate the everglades. Entire islands are missing from the map, some of which are substantial in size (10s of acres) and other island are misshapen. If your compass skills are  solid you can get by usually if sticking to the outer islands, but one should certainly buy the nautical chart for Everglades. No where on the map does it say \"not intended for navigational use.\" It should say this in big red letters on the front. This is the first time a trails illustrated map has failed us.", "Date": "March 30, 2014"}, {"Title": "Save money and get NOAA/USGS maps", "Author": "Andrew", "ReviewID": "R1VJCFSLEA2Z1E", "Overall": "2.0", "Content": "After taking this map on a trip to the everglades I will warn all: do not rely on this map for navigation.  It is not up to date and it is very basic.  It is fine for the basic layout of things.  But do not use on the water trails for canoeing/kayaking.  Get a NOAA map.  We took both and if all we had to rely on was this map we'd still be there.", "Date": "March 18, 2014"}, {"Title": "Great Map", "Author": "Michele Hollenbach", "ReviewID": "R1GB0FTIK89TZO", "Overall": "4.0", "Content": "It did a great job of detailing the trails, etc in the park.  It was also printed on dorable thinker, almost laminate paper.  Since the NP and the Perserve are intertined, I wish it would have included Big Cypress National Preserve.", "Date": "January 31, 2013"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "1566954096"}}