{"Reviews": [{"Title": "Mt. Baker area Map", "Author": "jrc1419", "ReviewID": "R2JW6IWE0CPTT4", "Overall": "5.0", "Content": "Nice, very detailed map.  Exceeded expectations.  I sent this map to a friend who's into Orienteering and he loves it.", "Date": "March 10, 2014"}, {"Title": "Great Map", "Author": "Dallas Webber", "ReviewID": "R7XW7REHKQCLJ", "Overall": "5.0", "Content": "Not much to say.  It's a map, it's good map.  Very detailed, well made, perfect for the backpack.  No complaints.", "Date": "October 19, 2013"}], "ProductInfo": {"Price": "Unavailable", "Features": " • Waterproof • Tear-Resistant • Topographic MapMount Baker-Snoqualmie National Forest • Washington, USAOne of five new Trails Illustrated maps for the Washington Cascades region offering the most detailed and up-to-date map for the forest, carefully researched and developed in co-operation with local land managers and agencies. Each map contains easy to read trails, numbered forest service roads, campsites, access points, scenic points-of-interests, and important facilities.Three narrow spires--North, Middle, and South Peaks--known collectively as Three Fingers anchor the center of Boulder River Wilderness. Boulder River, the primary drainage, runs northwesterly from a north-south ridge that rises to a high point of 6,850 feet on South Peak.Mountain climbers flood onto Mount Baker Wilderness Area in spring and summer before fall opens numerous large crevasses. Hundreds of climbers may be seen on the mountain in a single day. The Heliotrope Ridge Trail winds 2.7 miles to the Coleman Glacier, the most popular climbing route on the mountain. A well-developed and very busy trail system provides access to the lower country.Like all Trails Illustrated maps our new Washington Cascades titles are both highly durable and environmentally friendly. Each map is printed in the United States, at a certified green printer, using low V.O.C. inks on waterproof, tear-resistant material. Proceeds from the sale of Trails Illustrated Maps go to support the National Geographic Society's nonprofit mission to increase global understanding and promote conservation of our planet through exploration, research, and education.Coverage includes:Noisy Diobsud Wilderness Area, Mount Baker National Recreation Area, Skagit Wild and Scenic River, Mount Baker, Mountain Loop and North Cascades Scenic Byways Wilderness Coverage: Mount Baker, Boulder River, Noisy DiobsudOther Attractions: Mount Pilchuck and Wallace Falls State Parks, Baker and Spada Lakes, Lake Shannon, Hiking Trails, Mountain Biking, Scenic Back Roads, Boat Ramps, Mountain Climbing, Sno-Parks, Ski Areas, Fishing, Snowmobile Trails, Cross-Country Skiing, Waterfalls, Day Use Areas, Dispersed Camping Areas, Picnic Areas, CampgroundsFolded Size = 4.25 x 9.25Sheet Size = 25.5 x 37.75Scale = 1:75,000", "Name": "Mount Baker and Boulder River Wilderness Areas [Mt. Baker-Snoqualmie National Forest] (National Geographic: Trails Illustrated Map #826) (National Geographic Maps: Trails Illustrated)", "ImgURL": "http://ecx.images-amazon.com/images/I/51X6zzZAHQL._SY344_BO1,204,203,200_.jpg", "ProductID": "1566955084"}}