{"Reviews": [{"Title": "Exceptional Guide in Small Package", "Author": "Clyde R. Horn \"DrHorn\"", "ReviewID": "R3M40H8NNS0MLA", "Overall": "5.0", "Content": "Love this guide! It comes in a laminated fold-out and carries easily in camera bag or even jean pocket. It gives all the basics of the camera and is a nice reference when in the field for all the controls and functions of the Nikon D90. It's saved m  when considering white balance, lighting options or timer issues. Very nice and I highly recommend it.", "Date": "May 31, 2009"}, {"Title": "Nikon D90 Reference Card", "Author": "Sean P. Sheeley \"metal maestro\"", "ReviewID": "R3D00BI15WOLER", "Overall": "5.0", "Content": "While this reference card doesn't contain all info essential to the camera, it has the basics covered very well.  The card is high quality, laminated and is very handy for those shoots on the go.  The card stows away very nicely.  I would recommend this card to any D90 owner, especially for novice to intermediate photographers.  I'm an experienced shutterbug, but new to digital photography and this card has come in handy several times.  Many tidbits of info are stored on this card and the layout is simple to understand.  A very brilliant idea for the architect of this product.  Sure beats carrying around a book or manual when traveling light!", "Date": "January 25, 2010"}, {"Title": "As advertised", "Author": "GeezingInVA", "ReviewID": "R1AUIWEVJJSGZS", "Overall": "4.0", "Content": "A good field cheat sheet. Fits in my camera bag for quick reference while I learn my new DSLR.", "Date": "October 17, 2009"}, {"Title": "Worth every penny...", "Author": "Thomas O'Neill", "ReviewID": "R9TC2ZWS5V4DZ", "Overall": "5.0", "Content": "Although a bit pricy, I would recommend this for all new D90 owners. You can leave your manual at home as this will answer most questions you will have in the field about your D90 features.", "Date": "June 23, 2010"}, {"Title": "D90 reference card", "Author": "boyg", "ReviewID": "R2WPF5OXWTMDOB", "Overall": "4.0", "Content": "its practical & useful since the d90 has so many controls & buttons to push. i always browse over it to remind me of the various functions of the d90 since i seldom  use the camera except on trips & family occassions. because of the shipping charges it cost me about $23 so its quite expensive however wihout the freight cost its quite reasonable. for amateurs who seldom use their d90, this reference card is the best.", "Date": "June 20, 2011"}, {"Title": "Very Handy", "Author": "F. P. Bishop", "ReviewID": "RDJ8U449VQLK4", "Overall": "5.0", "Content": "This is just what I needed - it's perfect to stuff in the back pocket of my camera bag.  Now I can easily review camera functions anywhere.", "Date": "January 10, 2011"}, {"Title": "Excellant To Carry In Your Photo Bag", "Author": "Bill A. Belt", "ReviewID": "RR21XDWGZ2PEZ", "Overall": "5.0", "Content": "If you are a professional photographer or a well seasoned amateur, then you more than likely will not need this card. I am neither and I find it comes in handy quite often, ISince it is plastic laminated I can carry in my camera bag and get it out in any kind of weather. I already had the D-80 camera and \"cheat sheet\" thus when I got my D-90 I just naturally purchased the same sheet.There are actually 12 sections that covers very briefly the operation of the D-90. This includes a Custom Setting section, Flash photography,white balance,exposure,metering, bracketing,Control panel and Playback. Even if you only seldom use this guide you will find the cost to be minimal for the information listed. By the way, all of the info on the card is also contained in your user manual, however why carry that manual with you everywhere you go? This is well worth the small price paid.", "Date": "July 30, 2012"}, {"Title": "For photographes on the fly", "Author": "\"RJ\"", "ReviewID": "R3D7CX89ZFU1DW", "Overall": "4.0", "Content": "The Nikon D90 inBrief Laminated Reference Card is an excellent tool for amatuers and professional to use on the fly.  The manual and how-to books take up too much room in your bag.  This is the tool for you!", "Date": "March 27, 2011"}, {"Title": "Fabulous quick review card", "Author": "Geri Lopker \"continuous learner\"", "ReviewID": "R2G9XKY80TXMGX", "Overall": "5.0", "Content": "As a newer user of a DSLR camera, the D90, this quick review card is sure to help me remember how to use some of the features. It arrived as promised and is very handy!", "Date": "February 3, 2011"}, {"Title": "Good for beginners or recent owners of a Nikon D90", "Author": "Alexander Galvis Quintero \"Aleks\"", "ReviewID": "R3LACSFUJ874TV", "Overall": "4.0", "Content": "It's a very nice and useful quick reference for basic use of Nikon D90 DSLR Camera. Its size allows carry in any backpack. If you are a new owner of a Nikon D90 it is a very good reference, although the camera comes with a Quick Guide that is deeper than this. If you've already been using a Nikon D90 for a while (possibly another Nikon DSLR too) does not need this quick guide because you know what's there.", "Date": "October 4, 2010"}, {"Title": "Great guide for Nikon D90 quick reference", "Author": "Donald L. Barker", "ReviewID": "R1JZWR59UP5WDO", "Overall": "5.0", "Content": "This is going to be extremely handy over the years, even after I'm more familiar with a lot of the features.  There are so many features/adjustments on the D90 that remembering all of them is not likely.  The card is an essential reminder, and very well categorized and itemized.", "Date": "July 11, 2010"}, {"Title": "Nice, but probably not necessary", "Author": "Andy G.", "ReviewID": "R1P1FJMCPQ3JMV", "Overall": "3.0", "Content": "I bought this at the same time as my Nikon D90.  This actually arrived before the camera itself.  I read the PDF version of the manual (from Nikon) before the camera arrived and I was pretty well prepared.  I only needed a few days with the camera to get to know a lot of the functions that I will use.  I also read the D90 guide from Ken Rockwell for some tips based on his actual usage.  In my first two weeks with the camera, I haven't used this reference card more than once or twice, but I'll probably pack it into my camera bag anyway.As far as a reference card goes, it's clear, colorful, and well laid out.  The lamination will keep it protected.  It's a good reference but not a must-have.", "Date": "July 8, 2010"}, {"Title": "Good to have", "Author": "Tim Lundstrom", "ReviewID": "R1FS2LOL4ZQ98N", "Overall": "4.0", "Content": "This is a good guide for quick reference and does not take up to much room in the camera bag.", "Date": "January 5, 2014"}, {"Title": "Very Helpful", "Author": "sdiego", "ReviewID": "R29IRF0HEGE13R", "Overall": "5.0", "Content": "This is what I needed. Very handy and I don't have to call friends to find out about the camera's features on the spot.", "Date": "December 21, 2013"}, {"Title": "neat!", "Author": "Vicki Indig Smith", "ReviewID": "R1YG9T40LNT3OR", "Overall": "5.0", "Content": "just what I need to keep all the little camera bits & controls remembered when I need them. great folding helper.", "Date": "September 5, 2013"}, {"Title": "very detailed", "Author": "Harvey", "ReviewID": "RE63GU9FTFAHO", "Overall": "5.0", "Content": "highly detailed with lots of good info, glad I made this purchase, I am very satisfied with the D90 guide", "Date": "August 1, 2013"}, {"Title": "Nikon D90 inBrief laminated reference card", "Author": "Charles P. Smith", "ReviewID": "R2L9MM00VFV92Y", "Overall": "5.0", "Content": "Product as ordered and described - seems to be pretty handy - would shop again service was fast and ontime", "Date": "April 26, 2012"}, {"Title": "Good info", "Author": "JB \"Purchaser\"", "ReviewID": "R1T6QP4K6K3E0C", "Overall": "4.0", "Content": "The card seems okay. I have not used it that much up to date and I have had it for several weeks. The information is good if you need a quick reference.", "Date": "June 24, 2010"}, {"Title": "Perfect", "Author": "Nathaniel D. Logan \"Bballshots\"", "ReviewID": "R3KDYQM8CYW5CX", "Overall": "5.0", "Content": "This little reference tool. Got me up to speed on the camera in about 30 minutes.", "Date": "June 17, 2010"}, {"Title": "nice to have in your camera bag", "Author": "mike", "ReviewID": "R37J0AVIKGPEE9", "Overall": "3.0", "Content": "It is very nice to have in your camera bag.  It saves having the camara instruction book take up space in your bag.", "Date": "March 11, 2012"}, {"Title": "Handy Reference Reminder", "Author": "Robert Warren", "ReviewID": "R2TQXEA69Q7HJK", "Overall": "5.0", "Content": "Handy Reference Reminder that can be easily stored in your camera bag.When you don't use your camera on a regular basis like I do, this is a great review reminder.", "Date": "October 31, 2010"}, {"Title": "Nice fold out quick guide", "Author": "GQ", "ReviewID": "R1M1081X1424VE", "Overall": "4.0", "Content": "Nice fold out quick guide, must have for new Nikon D90 owners!! Saves going thru manual out in the field", "Date": "October 31, 2011"}, {"Title": "Great, handy", "Author": "TribecaChick", "ReviewID": "R1DP655G2DR67V", "Overall": "5.0", "Content": "I bought this for my dad for father's day and he loved it. Great to keep in your camera bag as a quick reference.", "Date": "June 29, 2009"}, {"Title": "Ref. card", "Author": "Chris M. Higgins", "ReviewID": "R1OL9SAJZOQOQ3", "Overall": "5.0", "Content": "love my D90 ref card! folds up and easily tucks away into my camera bag... and its laminated =)", "Date": "May 16, 2010"}, {"Title": "Nikon D90 pocket size instructions", "Author": "Elizabeth C. Foster", "ReviewID": "RT3ECPPBS0ZMN", "Overall": "2.0", "Content": "too much info crammed together.  one large page folded up into a small size.  a booklet design would be much better. If u remember where to find the info u need, u can remember the information to begin with...", "Date": "October 10, 2010"}, {"Title": "excellence at a good price", "Author": "Juan B. Mansfield", "ReviewID": "R2LKVZZJYFCLRQ", "Overall": "5.0", "Content": "I had two Nikormat in the 80s and since then I have been a Nikkon customer. With this D-90 I found excellence at a very good price. Photos come out with unsurpassed quality. I recommend this machine to anyone.", "Date": "February 10, 2010"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "1934148644"}}