{"Reviews": [{"Title": "Not a bad effort, but could be better", "Author": "D. Hendrick", "ReviewID": "R2X2CSZ1ZJRNJV", "Overall": "3.0", "Content": "I love \"cheat sheets\" and knew that I would need something like this to get facile with my new D200.  It is not a bad effort, but could be better, especially in helping decide settings for different photo situations. As it is, this card is more like a color-coded index of the different items in the menus.  Useful, yes.  But nothing that will help you master the camera settings.  I have read two different manuals on the D200 and bought a video and have ended up making my own \"cheat sheet\" after all.", "Date": "February 18, 2007"}, {"Title": "handy", "Author": "Drew L. Skinner", "ReviewID": "RFMGGMGSHPHWN", "Overall": "5.0", "Content": "I used this right away..it takes up no real space in my bag and is very useful if you don't have a great memory...I don't...I like it.", "Date": "February 6, 2007"}, {"Title": "NIKON D200 LAMINATED REFERENCE CARD", "Author": "Kenneth C. Rogers", "ReviewID": "R5VYU6OG6NBG7", "Overall": "3.0", "Content": "The card tries to include too much information in a very tiny format. A more selective choice of topics and print in much larger sizes would make the card much more useful for field work.I don't carry it with me in the field because it is so hard to read and so cluttered.I wouldn't have purchased it if I had had a chance to examine it first.", "Date": "May 6, 2007"}, {"Title": "Very useful guide", "Author": "Stuart J. Keir \"Stuart Keir\"", "ReviewID": "R2TVH5O8RAPKAS", "Overall": "4.0", "Content": "Great handy guide to a fantastic camera. Not too detailed with just enough information at hand on 1 single fold up laminted sheet.", "Date": "September 13, 2007"}, {"Title": "There when you need them most", "Author": "Ausborn", "ReviewID": "R1BA5VSMBNISP6", "Overall": "5.0", "Content": "If you are not an academic photographer who reads the manual studiously,and then obediently practises what you have read to reinforce what you have learnt, then these cards are the way to go, because it's when you are out there actually taking photos that you need prompts. These cards are light and portable, so they don't contribute more bulk and weight to your camera bag. I used them with my D70s and will continue to do so with any new SLR I acquire. There is a similar product which is not as convenient to carry but which is also helpful so I use both. After spending thousands of dollars on equipment, the cost of these is small change.", "Date": "November 9, 2009"}, {"Title": "Nikon D-200 CheatSheet", "Author": "M. Thomas \"archerdean\"", "ReviewID": "R3LGI8OVD86UF6", "Overall": "2.0", "Content": "Pros:It is laminated and has a lot of quick informationCons:The print is small but I understand that, with all the information on it. My problem with it is that it is 11.5 X 8.5 inches that is folded into thirds which makes it 3.75 X 8.5. A little big for the pocket. If it folded in half to make it 3.75 X 4.25 it would fit better in the pocket.I woul recommend the \"Blue Crane\" \"inBrief\" reference guide.", "Date": "January 18, 2009"}, {"Title": "D200 Reference Card", "Author": "Dennis Nowlin", "ReviewID": "RIN6N1MI9W81Q", "Overall": "4.0", "Content": "Pro level digital cameras have extensive menus and controls. Functions and controls not frequently used can be difficult to remember how to access. This Reference Card is easy to carry and provides enough information to find a menu or button without the user's manual. The card's quality, design, and graphics warrant four stars but I have not used it enough to give it a five star rating.", "Date": "April 20, 2008"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "1934148032"}}