{"Reviews": [{"Title": "Not bad if you need such a reference", "Author": "Redneck", "ReviewID": "R3JN0DIXTUXUFL", "Overall": "3.0", "Content": "This little fold out is not a bad item to have in your camera case for new D300 camera owners.  I can't say I've ever used mine on a shoot, but it's there just in case.  Good quality construction, color-coded subject organization, it should last fairly well through normal lite usage.  If you need to refer to this all the time, you should really take the time to learn your camera.  I highly recommend David Busch's Nikon D300 Guide to Digital SLR Photography for that purpose.;-{>", "Date": "August 20, 2008"}, {"Title": "Great Cheat Sheet", "Author": "Barak Berkowitz \"Barak\"", "ReviewID": "RR2GPOF2W0ZQO", "Overall": "4.0", "Content": "This card (actually multi-paged) is a great cheet sheet that covers deep menu items that you always forget where they are.  Not a Newbe summary but a guide to all menues.  I take it everywhere. Faster than paging through the menus.", "Date": "April 26, 2008"}, {"Title": "Part of the camera bag", "Author": "K. Izzi", "ReviewID": "R1FGXLAHABS4G6", "Overall": "5.0", "Content": "The best twelve-Dollar investment in D300 accessories, stows nicely in the camera bag. The laminated folding cards are very sturdy and will hold together for years on end. If they put spiral binding it may scratch the expensive contents of the camera bag. This is a lovely, color coded guide or cheat sheet that will keep you alive when you are in the field, away from the 450+ pages manual that is not very portable, yet indispensable for such a vastly complex camera. I'm so happy with this quick reference. Maybe a tad larger font would have been in order, but I won't chuck it away just because of that.", "Date": "June 10, 2008"}, {"Title": "Very useful Guide", "Author": "M. Carpenter", "ReviewID": "RDXAOFIVZXPW5", "Overall": "4.0", "Content": "This is a very handy tool, just a bit stiff and large.  I have used it over and over though and it has become one of my most used tools as I learn the D300.", "Date": "June 13, 2008"}, {"Title": "A necessity", "Author": "Klipspringer", "ReviewID": "R1ENTCJ68RS2Q", "Overall": "5.0", "Content": "Unless you have a photographic memory (no pun intended) and can remember every option and setting on the complicated D300, a small \"cheat sheet\" is an absolute necessity when traveling. It has saved me from some stupid mistakes (wrong focus or metering settings), and most of all it provides a quick reference when you want to utilize one of the more esoteric functions of the camera.  If you can remember all the options more power to you; for me, the small price (and small size) of this reference guide is invaluable. It beats ending up with lousy photos.", "Date": "May 28, 2009"}, {"Title": "Good Quick Reference", "Author": "Sue Mac", "ReviewID": "R3ALP3TYQG06GM", "Overall": "5.0", "Content": "Having these laminated cards handy helps me to remember all the complex settings of this camera.  Worth having around.", "Date": "August 30, 2008"}, {"Title": "Lots of Info", "Author": "Robert Patterson \"stanley59\"", "ReviewID": "R1P8T281SY097Y", "Overall": "5.0", "Content": "Works good for someone already familiar with the D300....not a product to pick up and try to understand how the camera works.", "Date": "August 29, 2008"}, {"Title": "Cheat Sheet Card", "Author": "Horace Alyn Bixby \"Bixmeister\"", "ReviewID": "R1NKNEKQ2H0OCW", "Overall": "4.0", "Content": "Nice looking fairly complete short synopsis of the Nikon D300 operation.  Covers the buttons and features pretty well.", "Date": "June 23, 2008"}, {"Title": "Own a Nikon D300? Better have this also!", "Author": "Larry House", "ReviewID": "R3SBLFT22D8TG8", "Overall": "5.0", "Content": "I have been into photography for many years and just recently got myself theNikon D300. Lots of settings and adjustments on it to fool around with. Believeme, this is one handy reference card to have with you whenever you are on aphotoshoot!", "Date": "September 5, 2009"}, {"Title": "Handy Chart, expensive, poorly implemented", "Author": "A. S. Donnelly", "ReviewID": "RG9E8XDG3J9DZ", "Overall": "3.0", "Content": "This is a handy \"cheat sheet\" chart, but as others have mentioned it could have been better implemented. Mine began to separate at the seams. It is pricey for what it is. Nothing in the materials, construction or \"workmanship\" warrants the price charged. I have since come to much prefer the Thom Hogan e-Books, which include a which include a \"To Go\" book and a smaller laminated card of my own construction.", "Date": "June 4, 2009"}, {"Title": "This Works", "Author": "Sunshine Joe", "ReviewID": "R2Q5CDXS1XBCBJ", "Overall": "5.0", "Content": "YOU WANT THIS.After you've read the Nikon book (if you can actually get through it), and after you've read whatever manual or Field Guide you purchase in addition -- Magic Lantern, Thomas, whoever, you'll want to have this with you.It fits in your pocket, it fits in your camera bag, it fits in your vest.  It lets you know where every function is on the menus and on the camera.  YOU CAN'T REMEMBER ALL THIS and you can't carry the Field Guides out in the field.Come on People, its not that pricey.  You spent thousands on your camera and lenses -- this thing helps.", "Date": "November 9, 2008"}, {"Title": "EXCELLENT REFERENCE MATERIAL", "Author": "OILMAN \"OWEN\"", "ReviewID": "R3E7SNXC2V8U9S", "Overall": "4.0", "Content": "THIS GUIDE WILL SERVE ME WELL ON POINTERS ON MY BRAND NEW NIKON D300 WHEN I GO ON MY CRUISE VACATION..........THE FEATURES OF THE D300 ARE SO NUMEROUS.........THAT THIS IS A WONDERFUL ITEM TO HAVE AS A QUICK REFERENCE POINT.........WHEN I WILL BE OUT AND ABOUT SHOOTING....THE GUIDE IS COLORFUL....AND PRINTED TO BE READ EASELY..I RECCOMMEND THIS ITEM TO ALL NEW AND CURRENT NIKON D300 OWNERS....", "Date": "October 3, 2008"}, {"Title": "Why no spiral binding???", "Author": "Mensa \"mensa1000\"", "ReviewID": "R303ZWEQDM880B", "Overall": "2.0", "Content": "This is a real handy cheat sheet.  But it is configured in a stupid, fold out & out & out to poster size format.  In no time the \"hinged\" plastic seams will separate and this will be a collection of loose sheets. A simple spiral binding would have made this such a functional, pleasing-to-use, and lasting adjunct to the photographer's kit bag. Also, the typeface/font could be larger for us 'visually challenged'.  The color coding 'works' and is helpful", "Date": "May 21, 2008"}, {"Title": "D300 plastic reference card", "Author": "Mark A. Mathews \"Architect, husband, father, ...", "ReviewID": "R2WZOP5FPRN7EF", "Overall": "4.0", "Content": "Excellent product. A bit pricy, but well designed and useful to keep with my camera equipment.", "Date": "April 10, 2008"}, {"Title": "Nikon D300", "Author": "Floyd Thorpe", "ReviewID": "R2PD218URVSS5M", "Overall": "5.0", "Content": "Very happy with reference card. I purchased the Nikon D80 card a few years ago and carry both in my bag as a quick reference.", "Date": "May 15, 2014"}, {"Title": "I like it", "Author": "HEH", "ReviewID": "R27SAO8CWC21FR", "Overall": "4.0", "Content": "pleased", "Date": "May 2, 2014"}, {"Title": "It's what a need to keep up with my new camera", "Author": "tom", "ReviewID": "R2KS2LQFV4KRMK", "Overall": "5.0", "Content": "I purchased a used D300 several months ago and while I have always been a Nikon shooter I'm still learning about some of the new features of the camera. The card is a great reference when I'm shooting an forget now to set the camera, since it's very different from my old D70.", "Date": "February 3, 2014"}, {"Title": "Incomplete", "Author": "TW", "ReviewID": "R103XSZN152INN", "Overall": "2.0", "Content": "Info not specific / quality of product itself fair at best / Enlarge card size slightly and us bigger print.", "Date": "January 7, 2014"}, {"Title": "A good reference.", "Author": "James Lee", "ReviewID": "R2R7JVM0L9AZYT", "Overall": "5.0", "Content": "Concise reference for carrying in the camera bag. Easily read with good color coding. A durable laminated plastic. Yeah Yeah.", "Date": "January 2, 2014"}, {"Title": "Good price. Recommended for all my friends. This site is easy to used. I like it. Thank you so much.", "Author": "Peter", "ReviewID": "R23RODB34YPG26", "Overall": "5.0", "Content": "Good price. Recommended for all my friends.This site is easy to used. I like it. Thank you so much.", "Date": "November 15, 2013"}, {"Title": "too small", "Author": "Stuart Vaughan-Williams", "ReviewID": "R19LR756WSILWY", "Overall": "3.0", "Content": "The detail is  but it is about half the size I expected. I Have to put on my reading glasses to refer to it. I don't wear them using my camera.", "Date": "October 31, 2013"}, {"Title": "Great tool to have handy", "Author": "Verena A. Stoll", "ReviewID": "R1ILKPCLB7F4WU", "Overall": "5.0", "Content": "Owning a complex camera makes it necessary to review settings in a hurry. This reference card is the ideal helper.", "Date": "September 13, 2013"}, {"Title": "Great Quick Reference", "Author": "Another Customer", "ReviewID": "R3UTTZURTZTI8B", "Overall": "4.0", "Content": "Bought this to have a quick reference guide to my camera, there is so many settings, it can be easy to get lost sometimes.", "Date": "May 15, 2013"}, {"Title": "Great little reference!", "Author": "Duane R. Price", "ReviewID": "R38KO12WDUXSTY", "Overall": "5.0", "Content": "I needed a non-bulky reference guide to carry with me. This takes the mystery out of the D300 and has given me a broader perspective on the capabilities of this camera.", "Date": "April 5, 2013"}, {"Title": "lots of info in a small space", "Author": "mr lucky", "ReviewID": "R1M6F4QLJXRVZJ", "Overall": "5.0", "Content": "Lots of info in a small space. Color coding makes specific details easy to find, very intuitive. You dont want to carry a manual around but this probably has the answers to 99% of you questions espically if you are just a casual user.", "Date": "July 15, 2012"}, {"Title": "Excellent aid", "Author": "Amazon Customer \"compuhense\"", "ReviewID": "R1Z181L9FDK6W0", "Overall": "5.0", "Content": "Very pleased with service and product. This item was just what I was looking for.", "Date": "August 1, 2009"}, {"Title": "D300 Reference Card", "Author": "Robert A. Clemons", "ReviewID": "R21NS5Y499LD4M", "Overall": "5.0", "Content": "I felt the reference card was needed as a Brief way to understand the Camera better. Also a faster way to find basic and specific things about the cameras operation.", "Date": "April 26, 2009"}, {"Title": "D300 laminated reference card", "Author": "Christy G. Adams", "ReviewID": "R2NGQYLDQR2Z2K", "Overall": "5.0", "Content": "the d300 reference card is indispensible for someone who is a first time user of the Nikon D300. I take it with me every where I go. Highly recommened this to all users of D300 because there is so much to remember.", "Date": "March 2, 2009"}, {"Title": "Valuable Carry Along", "Author": "L Cherie", "ReviewID": "R3S3UZ1ARJ6ZPK", "Overall": "5.0", "Content": "With all the bells and whistles of the D200 to remember this pocket guide is a great, fast, on the fly reference for buttons and settings. Quick visual reminder of what all the hieroglyphic symbols mean. Color coded reference sections for focus and shooting modes, flash settings, exposure, metering, and bracketing. And much more all in a laminated fold open, element resistant card. Would purchase one of these cards for whatever digital camera they are printed for.", "Date": "January 7, 2009"}, {"Title": "D300 laminated info sheet", "Author": "Donald S. Lavin", "ReviewID": "R23G0W5BZ4ZIGH", "Overall": "5.0", "Content": "Nice item.  Great to carry in the field when you are out shooting and you are not familiar with all of the cameras features.", "Date": "October 14, 2008"}, {"Title": "poor choice", "Author": "Dennis The Photographer", "ReviewID": "R3PMHNLEOAN087", "Overall": "2.0", "Content": "An overpriced flow chart.Best use the money towards a complete book describing the D300 and its features. The book supplied by Nikon with the D300 is excellent and there are other books that are also very informative.", "Date": "August 18, 2008"}, {"Title": "Handy field reference for Nikon D300", "Author": "B. M. Saskor", "ReviewID": "R1U6BSBVREX3SU", "Overall": "5.0", "Content": "This is a handy field reference for the Nikon D300 which has soooo many functions and settings.", "Date": "July 21, 2008"}], "ProductInfo": {"Price": "Unavailable", "Features": " The Nikon D300 comes with many controls and settings that allow you to capture the perfect exposure. Remembering where they are and exactly how they work together is a difficult, if not impossible task.    You can carry the user manual in your bag, but it s over one hundred pages long. Finding the answer to your question can be a frustrating experience.     The inBrief camera reference card is a laminated, foldable guide that answers most camera operation questions quickly and easily. The information is arranged logically so you can find the answer to you question in the shortest time possible.     Each inBrief card shows an annotated line drawing of the camera and an index to the information on the other panels. If you have a question about white balance, simply look at the purple panel. Answers to custom settings are always on the green panel.     The inBrief card has laminated hinges so the card lies flat. When folded, the dimensions are 5.5 inches by 4.25 inches. It fits neatly in the outside pocket of your camera bag for instant access.     Each card is subdivided into eight subjects across twelve color-coded panels. An overview of the information on each panel is listed below.   Teal: Annotated line drawing and general index Blue: Viewfinder, Control panel, and Monitor displays Red: Camera functions by exposure mode and flash information Lime: Focus, Drive Modes, and Self-Timer Yellow: Exposure, Metering, Bracketing Purple: White Balance, ISO, Image Size / Quality Orange: Displaying Images, Resetting the camera,   Live View Green: Custom Settings     Each card is professionally printed on 10 point card stock and laminated on each side for long wear and protection from the elements. Once you have an inBrief, you can leave your manual at home.", "Name": "Nikon D300 inBrief Laminated Reference Card", "ImgURL": "http://ecx.images-amazon.com/images/I/51QJ2fmoRUL._SX258_BO1,204,203,200_.jpg", "ProductID": "1934148423"}}