{"Reviews": [], "ProductInfo": {"Price": "Unavailable", "Features": "24 Channel H.264 DVR, 720FPS CIF Realtime Recording, 1280*1024 VGA Output, 16 CH Playback, CMS, 2xSATA HDD, Mobile Phone Surveillance, IR Extender (IR Extender cable not included)\nOCD2324SE adopts high performance video processing chips and embedded Linux. It utilizes the most advanced technologies, such as standard H.264 with low bit rate, SATA interface, VGA, mouse control, full remote control via IE browser, mobile surveillance (by cell phones), etc.. It has all the powerful functions and is of high stability. OCD2324SE supports mobile phone surveillance on iPhone (iPad/ iPad2), Blackberry, Google Phone\nStandard H.264 format; CIF Realtime display, realtime recording Multiplex mode: recording, playback, setup, backup, network and mobile phone surveillance simultanously Sophisticated Network Functions: remote surveillance, remote playback, remote recording, remote control DVR, remote menu setup, remote recording backup Various recording mode: timer, motion detection, alarm, and watermark Recording picture quality, resolution & recording frame rate configurable\nCIF Realtime recording Flexible Display mode : Auto Switch, Full Screen, Quad/9/16, etc. Multi-method searching: Time, Event(Alarm, Motion Detection), Recording List Easy Backup: download recorded files via IE browser through network, or to external USB2.0 device Support IE browser, remote menu setup Support dual stream: recording and network bit rates are adjustable to fit user's bandwidth without affecting recording picture quality and frame rate.\nSupport 16 CH playback Support PTZ control with preset and auto-cruise Support full mouse control via USB mouse Support VGA output, display resolution adjustable up to 1280*1024. Long hour recording (1 month real time non-stop recording with 250G HDD, 1 channel) Supports mobile phone surveillance on iPhone, Google Phone", "Name": "Orange Sources OCD2324ME-A 1TB HD Standalone Recorder 24CH Video Surveillance Security Camera DVR", "ImgURL": "http://ecx.images-amazon.com/images/I/31DZoKIMWyL._SY300_.jpg", "ProductID": "2324124009"}}