{"Reviews": [{"Title": "Comprehensive Book on Leica and the Company History", "Author": "George Furst", "ReviewID": "R3FV00L7U15F7O", "Overall": "5.0", "Content": "I have read many books on the leica cameras and the company based for most of its history in Wetzlar, Germany but none are as comprehensive as this tome. It contanse a wealth of diagrams and pictures I have never seen in other publications so it is not a warmed over introduction to the camera, the family and the long history of this lens manufacturing company. I highly recommend this book as the most definitive gathering of information I have ever seen on one camera. It contains information on each model of Leica, including cross setions, but its real strength is the discussion of optics and the design and manufacturing of the lens. It has a comprehensive section with MTF diagrams of all the Leica lens up to the most recent including the 50mm/.95 Noctilux lens.I have had this book for six months now and cannot get out of it as there is so much information. There are a few errors in the labeling of diagrams and mixed up pictures but they do not distract from the enormity of infromation provided. If I had one book on this company and its cameras and lens this would be it. The book must have been a labor of love as I cannot imagine compiling this much information without a real love and admiration for this venerated company. I highly recommend the book", "Date": "February 7, 2012"}, {"Title": "Outstanding!", "Author": "JSalcedo", "ReviewID": "R27WWOXWPARW3B", "Overall": "5.0", "Content": "An absolutely outstanding and unrivaled book about Leica, it's cameras and lenses, from the most knowledgeable person in the world - who also designed, wrote, edited and published this masterpiece book. I could not recommend it higher!", "Date": "December 18, 2013"}, {"Title": "Leica Compendium - The Company - The Cameras - The Lenses by Erwin Puts", "Author": "Mo Gujarati", "ReviewID": "R3366W2UHWQN45", "Overall": "5.0", "Content": "Thank you great book recevied  few days ago great book I love it I would recommend it to everyone who loves LEICA  lots of info and pictures  very very nice book  Mo", "Date": "June 18, 2013"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "9491089021"}}