{"Reviews": [{"Title": "Love this camera so much, I bought a second one", "Author": "Otilia", "ReviewID": "R230BQL367BY0L", "Overall": "5.0", "Content": "This is an awesome camera.  It first debuted in 1999 and is a true SLR digital camera.  The pictures I have taken with this camera a absolutely beautiful!  I love this camera so much I purchased a second camera, mostly for parts, however my daughter has claimed it now and is learning all about photography.", "Date": "June 18, 2012"}, {"Title": "Get spare memory card(s) limited to 128 megabytes", "Author": "Patrick Moran \"p0m\"", "ReviewID": "R1G7XUV034OYAS", "Overall": "5.0", "Content": "I really like my C2500L. The one problem I have noted is that one dealer selling used ones says he will send it with a 32 gigabyte smart media card. In my experience, that large a card will not work. This camera was designed to address up to a maximum of 128 megabytes of memory. Anything larger than this and the camera treats the card as defective. So get a couple 128 mb Sandisk cards, one for immediate use and one just in case your original card dies. (I got a 128 card shortly after I got my new camera, and that card is still working just fine.)Nothing else I have tried is as good for getting macro photos. You can focus down to about 1 inch from the camera lens. The only limitation with this camera is the lower pixel density. The photos cannot be blown up as large as a comparable image from today's $600 Nikon.", "Date": "March 1, 2013"}, {"Title": "Amazing Image Quality and versatility.", "Author": "EmperorWatcher", "ReviewID": "R1O4MBCV1PWKQV", "Overall": "5.0", "Content": "The terrific quality of pictures from this early digital SLR will surprise you. It is only 2.5MP.. Your smartphone probably has more! The difference is the excellent Olympus lens.You won't be able to enlarge much past 8x10, without losing some quality, but the color balance and sharpness are really better than many newer cameras.There are several useful features on this camera that aren't typically found elsewhere. For example: The camera uses both SM (smart media) and CF (compact flash memory cards). If you install both, fill one and then switch to the other. The camera can shoot and store RAW images, if you like to manipulate them, and it uses good old AA batteries, for easy replacement and low cost. I use rechargeables. There are some add on lenses to give a bit more telephoto or wide angle pictures. The Olympus branded ones are excellent.These cameras were Very Expensive when they first appeared. Now they're available for MUCH less and worth more than you'll spend.", "Date": "December 18, 2013"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B000B6QO44"}}