{"Reviews": [{"Title": "Good personal-use camera", "Author": "B. Nagel", "ReviewID": "R2SUOU15M49TOI", "Overall": "4.0", "Content": "The M417 is a good digital camera for typical personal use.  The onboard memory won't hold very many pictures taken at 5mp, but with the price of SD cards constantly falling, it is not too difficult to expand the storage.  Another user wrote a review claiming that this model uses up batteries at a fast rate (after 20-25 pictures or so).  I put in 2 Energizer AA batteries and have gotten well over 100 pictures and the batteries are still going strong.  Maybe it's just a fluke, but it is worth noting.  Yet another reviewer claimed to have trouble using the LCD screen to take pictures and suggested using the viewfinder instead.  On my model I've found that lining objects up in the viewfinder creates an off-center picture that's shifted to the right.  If I use the LCD, the pictures line up fine.The picture quality at 5mp is very crisp and clear, even when printed onto 8x10 photo paper.  I cannot give an opinion on the included software, as I have an SD card reader and use that to transfer pictures.  The camera is lightweight, easy to hold, and the LCD is large enough and bright enough to clearly browse through pictures.  The built-in red eye correction is OK, but you're better off using 3rd-party software to make this correction on a PC.Though I've pointed out a few shortcomings, the M417 is a very nice 5mp camera whose few faults are easily dealt with and not insurmountable.  For the price, it is one of the better 5mp buys currently on the market.NOTE:  If you choose to buy this camera bundled with the M-series camera dock, know that the rechargable batteries included with the dock drain very quickly and take a dispreportionally long amount of time to recharge.", "Date": "December 12, 2005"}, {"Title": "Fairly good Camera, good for normal photos", "Author": "Roy Burstiner \"evan23\"", "ReviewID": "R31C6SN1ESOK69", "Overall": "3.0", "Content": "I got this expecting a really great camera but I think it's okay for a simple point & shoot camera. It does take some fairly good 4 x 6 photos, but the detail is still not as sharp as a good 35mm camera (my Minolta 400 Maxxum SLR still takes sharper pictures especially with far away distance detail). This camera is best for normal photos (people shots about 4 to 20 feet away it's very good) However there are some good things & bad things about this camera.Pros: Great selection of modes, settings, exposure settings, different lighting situations etc. The software that comes with the camera is excellent & it's very is to download the photos from the camera to your computer. The manual is excellent also.Modes: Closeup, Fast Shot, Action, Landscape, Portrait & Auto. It's easy to juggle thru these settings via a button on the camera as well as thru the menu system. Nice feature of being able to turn on the camera to the last setting mode is convenient.3x optical zoom, also digital zoom. As with any digital camera you should use just the optical zoom, digital zoom always reduces the resolution & you will never get any good photos from it. Optical zoom is okay but also with any digital camera, when you use the zoom your hands better be very steady or use a tripod otherwise you will get blurry shots.Has a self timer which takes 1 or 2 shots automacially. Also has a Burst shot mode which takes 4 pictures in a row as long as you hold down the shutter.Can take photos in 5 different resolution setttings 1-5 megapixals but I always tell everyone to always shoot in the highest resolution to get the sharpest photos (I run a photo lab & have seen a lot of pixelated photos because people shoot in low resolution to get more photos on their memory cards)I have a 128 mb SD card in my camera & get 49 photos at a time at the highest setting.Cons: Alot of times I get slightly blurry shots if I use the LCD screen to take my photos. The camera is so small that like other digital cameras it's hard to hold the camera stedy while pressing the shutter. Your best bet is to use the viewfinder & hold the camera close to you to brace it for the best results. But I also use the burst shot mode to take a lot of my photos (when you do that your chances are that 1 out of the 4 shots will come out really good)LCD screen is very hard to see in bright daylight (but I have yet to see a digital camera that you could see well outdoors well)In low light situations if you don't use the flash I'ts very hard to get a really good sharp photo. The camera is so small that it's alway hard not to avoid camera shake when depressing the shutter. indoor shots come out okay, outdoor day shots are always much sharper & clearer.I wont go into the video mode or the audio recording option on the camera, basically most still digital cameras do this but they are not that great. You buying these cameras to take still pictures anyway.summery: It's an okay camera for taking normal good photos, compact enough to put in your pocket, but not better than a good 35 mm camera. It's a good carrying around camera, that's better than a disposable & good for most situations.", "Date": "June 14, 2005"}, {"Title": "Good camera takes nice pictures, very easy to use!", "Author": "Cora Morgan \"coraspartan\"", "ReviewID": "R22CW3EOH115VS", "Overall": "4.0", "Content": "We received this camera as a gift.  At first I was a little nervous about whether the quality of the camera would be inferior (I have an HP printer that I have had problems with).  However, after using it, I can say that I am very happy with it.  Other reviewers are right--if you use regular AA batteries, they are drained after taking only about 20 photos.  Invest in rechargeable batteries, they will save you a ton of money!  The software that came with this camera is great! It is super easy to use; I didn't even have to consult the owner's manual once to try to figure out how to save, print, name, or maneuver my pictures.  This is my first digital camera, so I think that tells you how user-friendly this software is.Sometimes this camera takes slightly blurry pictures, but I think that's more user error (me moving slightly) than the camera's fault.  I have taken some amazing photos of my flowers that turned out fantastic!  All in all, this is a good camera that I would recommend, especially for a first time digital camera user.", "Date": "July 14, 2006"}, {"Title": "Excellent Camera, Excellent Price!", "Author": "E. Peace", "ReviewID": "R3AFD8XSXCOIRH", "Overall": "5.0", "Content": "I love this camera! It is light and easy to carry, low in cost and takes GREAT pictures. Though I have heard others say it is a battery eater, I have been able to take over 100 pictures without needed to recharge. The picture quality is awesome, even when printed as 8x10's. Especially at such a low price I was very very impressed. I would most deffinetly recommend this camera for those looking for a great everydaa use camera, at a great price!", "Date": "August 15, 2006"}, {"Title": "Great camera, great price!!!!!!!!!! HP rules!!!!!", "Author": "Mirela Kataoka Mancini \"dlmbrasil\"", "ReviewID": "R36Z0VQDZAL9Q2", "Overall": "5.0", "Content": "The HP Photosmart M417 5MP is an excellent camera for it's price! The only thing I recommend is to buy a couple of rechargeable batteries because as any other digital cameras... you will need them!", "Date": "August 10, 2006"}, {"Title": "HP Digital Great Customer Service", "Author": "Reasonable Guy", "ReviewID": "R1DRIA3N080AIR", "Overall": "5.0", "Content": "I have this camera since Christmas. TAkes great pictures super easy to use. I had a slight malfunction with it HP sent me a new one in ONE business day. WOW. They sent me the new camera first and then I sent them the old one. They paid shipping both ways. Super excellent customer service.", "Date": "March 31, 2006"}, {"Title": "Great camera and printer combo!", "Author": "K. Peterson", "ReviewID": "R1R3N9N3BG3S05", "Overall": "4.0", "Content": "We bought this combo after checking out some of the other combonation's out there and this one is great. The setup and install were easy and had no problems at all. The camera works great, although it can only take a few pictures when set at the highest resolution. However, for us, that's not a big deal.The printer is very compact and has a handle for easy carrying. The camera connects on top easily and works flawlessly.The only thing I was disappointed about was that it said it came with a Photo Index card kit, cards to print the pictures on, but it wasn't in the box. We used normal note cards to try it out before buying cards. Not too big a deal, but still.", "Date": "December 4, 2005"}, {"Title": "camera has many flaws", "Author": "R. Perez \"texas1968\"", "ReviewID": "R3CFGJOL9OHHZO", "Overall": "1.0", "Content": "I purchased this camera 1 year ago, and I was so disappointed in the performance.  The battery life is terrible, I took it to our town's Christmas Parade, and all the pictures are grainy and really poor quality.  I posted some so you can see, also when you take a picture you can not take a picture for another good ten seconds. I had a two foot away shot of the rapper Nelly, and the camera didn't take the shot, and I only caught a shot of his tattoo on his arm! Save your money and get a better camera, like the Canon A630 the same price and much better quality, the battery life is fantastic and the night shots are great too.  The shutter speed is much better too.  I now have my HP in the closet because when I tried to use it on Thanksgiving the zoom would no longer zoom, and the lense does not retract. The only way I can turn off the power is too take out the batteries!  I never dropped it or mistreated my camera, it is just not a good quality camera.", "Date": "May 6, 2007"}, {"Title": "One of the better cameras", "Author": "John J. Meszaros \"senorctenaphore\"", "ReviewID": "R1KYUUF252X6K8", "Overall": "5.0", "Content": "I've used several digital cameras in the past and this one is my favorite.  It has the fewest number of confusing buttons (especially no awkward, symbol-laden dial around the on/off button) and most of the menus are pretty self explanatory.  Its highly compact and very durable-- I took mine on a cross-country trip through the middle of the desert.  And, of course, it has the best picture quality of all the cameras I've used.  Admittedly, it is hard to get pictures in low light (the shutter has to remain open for a while to capture enough photons, resulting in a blurry picture if you hold it in your hands), but this camera does have a hole in the bottom for a screw-in tripod for stabilization.  Plus, its one of the cheaper brands out there.  Best bet for my money.", "Date": "January 3, 2007"}, {"Title": "Simple Camera with All the Functions Needed....Great Starter", "Author": "M. Wu", "ReviewID": "R177OT87LYWHBY", "Overall": "4.0", "Content": "This camera was my second digital camera. It is very nice as far as price and picture goes. The pictures come out very clear but you would need to get an SD card because the internal memory will not hold more than 10 pictures. The functions are simple and ready to use. There is a single-button video function that takes long videos with audio. You can also add audio to still photos. The downside to this camera is that it uses a lot of battery. Do not use store-bought regular alkaline batteries as it will drain within 25-30 shots w/ flash. Please use at least a 2200 mah rechargeable battery. When using rechargeable batteries, you will find that you can get at least 150 to 200 shots, no problem. Still, the camera is a battery drainer. Also, the camera only tells you about low battery when it is low on battery. There is no battery scale on the LCD screen so you do not know when you would need new batteries. The LCD is enough for regular use to view pictures but I find it somewhat fuzzy in quality compared to transferring photos and viewing on the computer. The flash recycle time is longer than others and may not be able to take multiple shots within about 10 seconds.", "Date": "October 2, 2006"}, {"Title": "Great camera, great price", "Author": "M. J. Zielinski", "ReviewID": "R2K3NI88BRQIZ6", "Overall": "4.0", "Content": "I have had the M417 for nearly a year now and have nothing but the best to say.  First digital camera I have ever had and found it so easy to take photos, transfer photos, and print them.  I have found friends and families cameras too complex to be bothered with, but the M417 is simple to operate and the quality is excellent.  If you can't be bothered to take a photography course and still want great photos, buy the M417!", "Date": "August 7, 2006"}, {"Title": "so-so camera", "Author": "Dan L", "ReviewID": "R1UT366KFLFK60", "Overall": "2.0", "Content": "This camera i have had for a while, and i personally think it stinks. It is somewhat heavy for this range. The mega pixels are only 5, zoom is only 3x, and it takes AA batteries. It's battery life is not very good, it is heavy, and overall i would not suggest it.", "Date": "February 23, 2008"}, {"Title": "Not a very good camera", "Author": null, "ReviewID": "R3HXMV6J6I3PFQ", "Overall": "1.0", "Content": "I have had this camera since December of 2005.But i got i with the printer too.The printer is very good.But more can be said for the camera.For a few reasons The battery life is very poor.Like it can probley last you 30 mins at the most.And some times if you take a lot of pictures you can use them from the camera.And it will say photo can not be found.And sometimes whene you turn the camera on the screen will be off.And the screen is kind of bleek and dark and blurry too.And the video quality is horrible.And when you are taking a video with the camer the videos are very blurry and poor.And when you take a video you can look at the video on the camera but you CAN NOT HEAR THE SOUND.You have to have a computer to here the sound.And my grandpa has a canon and you can watch the video and hear the sound on the camera too!!!!!And in my opinon HP makes better computers then cameras.  Thanks.", "Date": "June 2, 2007"}, {"Title": "For My Mother", "Author": "Roxanne Wolfe-Beagley \"Roxie\"", "ReviewID": "R280QNLNM125R4", "Overall": "5.0", "Content": "This was purchased for my Mother. She wanted a printer you don't have to hook up to a computer. She doesn't have a computer, she doesn't want a computer and won't have one. This was great for her..she just wanted to print pictures.", "Date": "March 27, 2014"}, {"Title": "It's been too long ago", "Author": "Jeffrey Schaefer", "ReviewID": "R1WXJF6YO9B6XI", "Overall": "3.0", "Content": "don't remember purchasing this item, must have been very long ago. Now you want nine more words? I think I said it all.", "Date": "May 22, 2013"}, {"Title": "Another choice may have been better", "Author": "RHONDA MOORE", "ReviewID": "RDRDWXSQQUXY9", "Overall": "2.0", "Content": "May have been a refurbished product.It's worked pretty good until the last year.Looking for a better camera now.", "Date": "April 16, 2013"}, {"Title": "Was upset but now greatly pleased", "Author": "klem", "ReviewID": "RJMK7BLQO827M", "Overall": "5.0", "Content": "I was upset at Blue House in their response to an issue.  They finally responded and the final outcome was way beyond what I expected and the recipient of the product was overwhelmed.  What Blue House or some of the other sellers might incorporate is an automated system that responds to the sender a caned response that notifies them that their e-mail was received and they will respond within 24 or 48 hours so the requester is not waiting and getting angry and sending a second e-mail when they are diligently working on getting an answer to the problem.  But after their response I was very well pleased with their answer.  Will definitely do buisness with them again.", "Date": "February 21, 2011"}, {"Title": "Dated technology, but good images", "Author": "W. Wire", "ReviewID": "RB9O86UGXWHBU", "Overall": "3.0", "Content": "The thing to remember with this camera is that it was \"new\" back in 2005.  These days, the 5 megapixels isn't much to write home about and the electricity usage is higher than on some of the newer cameras which implement better power management so battery life can be an issue.  Additionally, the largest SD card it will accept is an extremely modest 1 GB.All that being said, the price for this camera is nice for the quality of images it takes.  It has OPTICAL zoom which is better than digital if you are wondering.  It takes excellent pictures in all the lighting conditions I've tried it in with true colors.  It also has a nice burst-shot feature to capture several frames with one shutter press.  It out-performs the \"modern\" 12 megapixel camera I returned (due to extreme poor quality images even in good light) by a landslide.  This camera is a good \"starter\" camera for my son.", "Date": "January 31, 2011"}, {"Title": "camera review", "Author": "ellenras", "ReviewID": "RO5FIC7Q9FMNK", "Overall": "3.0", "Content": "Camera seems to do different things at different times, no pattern to problems.  Quite frequently will display \"error in storing\", also lens will stay out and camera will turn off.  Ralph", "Date": "June 25, 2010"}, {"Title": "COMPLETE JUNK!", "Author": "S. Shane Dayton", "ReviewID": "R1IIN68M00Z2NN", "Overall": "1.0", "Content": "This is the most over priced and poorest quality cameras on the market. I have returned mine twice for repairs and now the auto focus is going out. The camera's MACRO function is a joke and if your looking for a camera that can take pictures in low light then this ain't it because it won't. DO NOT BUY THIS CAMERA!", "Date": "October 26, 2007"}, {"Title": "good camera", "Author": "Nikki", "ReviewID": "R1V34JDP94FXGE", "Overall": "4.0", "Content": "I've had this camera for well over a year, and I love it. It does take a while to recharge its flash and that has frustrated me at times. This can be helped, but not totally avoided, by always having freshly recharged batteries.It does eat batteries quickly, but I find that as long as I recharge them enough, it's fine. It only takes two AA batteries and most rechargeable batteries come in sets of at least four, so I always have an extra two with me and switch them out if need be. Of course, if you're the kind of person who always forgets to/never charges their batteries, this is a bad choice for you.It takes wonderful pictures. I've used it in pretty much any setting you can think of and it's been great. If you leave it someplace cold it'll take a bit to turn back on, but I imagine any other camera would have a similar problem.Some other reviewers have said this isn't a hardy piece of machinery. Maybe I've just been lucky, but I've dropped the thing a number of times and it's still good as new. A little scratched, of course, but it works just as well as it did when it was new.I pretty much recommend this to anyone, unless you have a problem with being patient about things. Yes, the flash can take a bit to recharge, so just anticipate that. Make sure your batteries are charged. That's all. =)", "Date": "September 19, 2007"}, {"Title": "good photos but not durable and EATS batteries", "Author": "R. Carr", "ReviewID": "R2LE495B96I5T5", "Overall": "1.0", "Content": "i got to get it off my chest.  this camera takes great photos and they print out wonderful.  BUT, the camera has several down sides:  1. as all have said, it eats batteries big time.  this is a pain.  2. it recharges slow between flash and between non flash.  forget about catching a great spontaneous moment.  3. not durable.  i dropped mine out of the case from below waist hight and it does nto work at ALL.  i am sure by the time i send it in and pay for shipping and repair i can buy a new one that is cheaper and more reliable.  any suggestions????", "Date": "October 30, 2006"}, {"Title": "Great photos, but poor performance.", "Author": "Dave CP \"D.\"", "ReviewID": "R125IWPZBZSB8W", "Overall": "3.0", "Content": "I purchased this for general family use and soon discovered that it drained batteries quickly (even specialty batteries) so I had to keep an extra set of batteries in the case. However, in fairness to HP the photos are superb and of photo lab quality. The biggest disappointment is the shutter speed. There's a one-second delay between the time you press the button and when the camera actually captures the image.Result: You'll always have misaligned or partial photos of people walking and moving objects etc. I'm not talking about difficult photos taken from or of moving vehicles, but just simple photos. For example: I took several photos at a wedding of a bride walking slowly to the altar. Result: Several close-up's of her face but few of her standing full height showing her dress.Forget about candid photos because your subject will see you by the time the flash activates, defeating the purpose. This is especially menacing.Given the choice again, I would look for another brand that doesn't have the irritating delay.", "Date": "September 11, 2006"}, {"Title": "Poor Battery Life, but Good Pics", "Author": "Amesy", "ReviewID": "R11U7BUACLU5U5", "Overall": "3.0", "Content": "On the bright side--With the 5MP resolution, this camera takes nice, quality photos that turn out impressively well when printed with a photo printer.  Also, the HP Photosmart sells for much less than most comprable digi-cams I priced (the major reason I bought it).On the dark side--This camera is a battery guzzler; granted, digi-cams are notorious battery eaters, but I could go no more than 20-25 pics without replacing the 2 AA batteries.  Also, with a 512MB memory card installed, pictures didn't import very well from the camera to my (well-equipped) Windows XP computer....Often either the camera or the computer froze-up in the process and pictures were lost (major bummer).  This issue didn't occur when the memory card was not in, but, without the memory card, the camera only holds ~15 of the highest quality photos.  With these issues in mind, I exchanged my HP for a 5MP Fuji FinePix digi-cam...I've been MUCH happier with that (no camera-PC connection issues, and a much improved battery life).I do recommend rechargeable batteries with any digi-cam; it makes taking lots of pictures much less painful to the pocketbook!", "Date": "August 21, 2005"}, {"Title": "Not for extensive outdoor use", "Author": "T. Russ", "ReviewID": "R1H51FQU1I282L", "Overall": "3.0", "Content": "I purchased two of these cameras for use in an outdoor setting.  Within a week, both apparently got dust or sand in the mechanics of the lens, and neither camera would function.  I had to take the cameras apart, clean the parts, and reassemble for the camera to operate.  This problem reoccurred almost weekly.  Two months later, one camera has completely ceased functioning, and the other has to be \"coaxed\" to turn on.  Granted, I have taken over 1,000 photos on each camera, but I have to warn potential buyers that these cameras are not rugged AT ALL.  The photo quality is good, and the settings are easy to adjust, but the housing is not as rugged as an all-purpose camera should be.  I also own a more expensive Canon Elph, and have had no problems operating it in similar conditions.", "Date": "April 24, 2006"}, {"Title": "Warning -- \"New\" does not mean usable!!!!", "Author": "W. Lynn JohnsonI \"Aging Reader\"", "ReviewID": "R3EW3CUH3797GE", "Overall": "1.0", "Content": "How can I give negative stars for a complete waste of money.I bought the HP M417 from a secondary seller -- not direct from Amazon-- and itwas $100 down the drain. The camera was advertised as \"new\" with perhaps someclaim, not with original box, no batteries.  (The ad's no longer there but thesame vendor is similarly describing a similar camera with a HIGHER price.)  Acamera shell arrived, poorly packed in bubble rack, and that was it.  No instructions, no cable or software to connect to a computer, and no capsule tohold the batteries to insert into the camera for power.  And because this is now an obsolete camera, even the best camera supply stores on the web don't carry anyparts for it.  So the camera is completely useless.  I complained to the vendorand got a \"Sorry sucker, you didn't read the ad carefully\" reply.  As I said in the heading, \"new\" does not mean \"usable.\"  New trash is still new and unfortunately there are unscrupulous people more than ready to take your money for it. BEWARE.", "Date": "June 13, 2012"}, {"Title": "The camera with a glass chin!", "Author": "Bryan Johnson \"SwedeLad\"", "ReviewID": "R2I0B4NQ5B9Y67", "Overall": "2.0", "Content": "While I agree with others that this camera takes some pretty nice pictures and is easy to use, I've had the same problems as many have noted here. For starters, the thing eats through batteries like there's no tomorrow. I was lucky to get 20 pictures before the batteries crapped out. My biggest problem, however came when my son was handing the camera over to me at the dinner table and it slipped out of his hand. The camera literally fell only 10-12 inches to the table, but that was enough to render this camera permanently inoperable. Be warned: if you are a little bit clumsy or have butter-fingers, think twice before buying this camera! Red-eye reduction is also a bit of a joke with this one.", "Date": "November 29, 2006"}, {"Title": "Sloooooow flash recharge", "Author": "Francisco Lagrutta \"Lagrutor\"", "ReviewID": "RUFOE9N81R8IW", "Overall": "3.0", "Content": "Like everyone else has said, this camera takes great pictures, but it can take a very long time for it to recharge its flash. It is very inconvenient when you are trying to take a cadid shot. If you have a large group posing for a picture and you don't like the first one, they all have to wait about 10 seconds for the flash to recharge before you can take another.", "Date": "November 24, 2006"}, {"Title": "Excelent camera", "Author": "Wiver \"JCO\"", "ReviewID": "R2SGNYR3X9AXNZ", "Overall": "4.0", "Content": "I was a little doubtful about purchasing this camera, because I read a lot of bad reviews, but honestl I think it's a wonderful and awesome camera, nice features, easy to use, nice pictures. The only drawback are the batteries, but that is common on digital cameras.", "Date": "May 9, 2006"}, {"Title": "My first digital camera", "Author": "Christine \"SDChristine\"", "ReviewID": "R1QDJROWX2S2G6", "Overall": "4.0", "Content": "I've waited until prices came down to finally invest in a decent digital camera - and the hp PhotoSmart M417 is my first purchase. [...]It seems to have all the features you'd need for basic photo taking. The pictures come out clear and nice.", "Date": "May 8, 2005"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B000A5KXY8"}}