{"Reviews": [{"Title": "Excellent Balance of Size, Price and Performance", "Author": "G. Hirsch", "ReviewID": "R3EVW3L3T2F4ZK", "Overall": "4.0", "Content": "The SP-350 provides sharp images and user control in a light, compact body. You can go with a wide choice of automatic modes or control the aperture, shutter, ISO, etc. settings yourself. It may not be a camera for professional photographers, but for  amatuers who wants more than a \"point a shoot\", this camera is great. Like many compact cameras, the SP-350's built in flash has a limited range, but unlike many others, the SP-350 has a \"hot shoe\" (which the 7.1 megapixel SP-310 lacks) so you can add a more powerful flash. Olympus makes a very compact flash unit, the FL-20, as well as more powerful units, labelled FL-36 and FL-50. Telephoto (1.7x) and wide angle (.7x) conversion lenses are also available. The ability to use regular AA batteries is a real plus for travel. I considered many cameras, including the Canon Powershot SD-550, the Casio Elixim Ex-Z750 , and the Nikon Coolpix L1. I wanted quality images, some manual control, and a camera that is comfortable to hold. The SP-350 feels natural in one average sized hand. My pictures shot with the SP-350 have been excellent.  Finally, for what you get, the price is quite reasonable.  There are many good digital cameras, my advice is to get the one which you are comfortable with.", "Date": "November 11, 2005"}, {"Title": "A great little camera!!", "Author": "Peter Gaffney", "ReviewID": "R1X1XPS710U83T", "Overall": "5.0", "Content": "I bought this camera after finding that my EOS 20D was too cumbersome for hiking in the Sierras.  After shooting about 40 images of both friends and scenery, i can only say that the results are spectacular.  Images are wonderfully sharp, colors are very true and vivid and the exposure meter does a first rate job under a variety of lighting conditions.  The camera is easy to use, (although the power button could stand to be two-sizes bigger,) and it nests very comfortably on the strap inside a jacket, out of the way and weighing practically nothing, yet readily accessible for those sudden shots.I've used several generations of Canon Powershot cameras in the past, as well as the very excellent 20D and I was sceptical about this camera after reading a previous negative review.  I have to say that I'm completely sold - a great hiking camera that is also perfect for everyday use.", "Date": "November 25, 2005"}, {"Title": "An advanced amateur camera at a point and shoot price.", "Author": "Carl M. Flarity", "ReviewID": "R2I9YJDIMIOOUP", "Overall": "5.0", "Content": "I bought this camera for myself as a Christmas present four months ago. The longer I've owned and used it, the more I appreciate it. As noted in the other reviews, it takes sharp, brilliant pictures that make great 81/2 X 11 prints (or larger I suppose).The first thing that caught my attention on this camera is the hot shoe. Very unusual in this size and price range. I've purchased the FL-36 flash unit so I can do bounce flash. This avoids the \"deer in the headlights\" look you usually get with an on-camera flash. The bounce flash pictures I've taken look as if no flash was used at all - great! I'm considering getting the hot shoe extension cable to give me even more flexibility in the use of the flash. If you hold a direct flash more than a couple feet away from the camera you don't get red-eye.As an advanced amateur photographer, I appreciate the ability to manually control the shutter speed, aperture and even manually focus the lens as needed. Of course, you can set it to full Auto and let the camera do all the thinking if you want. If you press the shutter release half way it will focus and set the exposure. Then press the shutter the rest of the way to avoid delay in actually taking the picture.I've also been taking quite a few (spectacular) macro photographs with this camera. It focuses very closely in normal mode. It gets even closer in macro mode. As in most other cameras, you lose zoom capability in macro mode. I'm a little disappointed that the smallest aperture is F8 rather than F16 (or better still F22 or F32). A smaller aperture would give more depth of field for macro photography. But I get by okay with F8.When I first got the camera I tried using alkaline AA batteries instead of the disposable CRV-3 lithium battery. This did not work well at all. I only got about ten shots before the batteries were declared dead by the camera. They were actually NOT dead. It's just that the camera needs a higher Voltage than alkalines can deliver when only slightly used. So I bought a rechargeable lithium battery, which works extremely well in this camera even though it's not listed in the specifications given by Olympus. Unfortunately, although it fits in the flash unit, the rechargeable lithium does not work in the FL-36. Its Voltage is actually too high (higher than the disposable lithium) and the flash unit shuts itself down after two seconds.  The AA alkalines work fine in the flash unit but the disposable lithium CRV-3 gives faster recycling times.I also purchased the 1.7x Tele Conversion Lens as well as the Wide angle lens. You also need to purchase an adapter tube to use either accessory lens. (They are over-priced.) The Tele Conversion lens blocks a corner of the optical view finder. The wide angle lens blocks most of the view finder. This can be a problem when you use the camera out of doors where the LCD is not usable because of the bright light. The front end of the adapter tube is 37mm but uses a non-standard thread so you can't put filters or other accessory lenses on it. I have since discovered that there is an adapter tube made by another company with a standard 37mm thread on the front. I can now install a polarizing (or other) filter on my SP-350. There are a large number of (non-Olympus) 37mm accessory lenses that will work with the SP-350 using this adapter tube. I'm having a lot of fun with the wide-angle fisheye lens I bought. Do a Google search for this stuff.I noticed they have recently introduced a faster version of the xD memory card. If I didn't already own the slower version I would pay extra for the faster one. I recommend buying either the 512 Meg or one Gigabyte card.", "Date": "April 17, 2006"}, {"Title": "Great, but Just a Little Shy", "Author": "ChrisBrogan", "ReviewID": "R335EG9J28FTCZ", "Overall": "4.0", "Content": "I'm a big fan of Olympus cameras. I had the Camedia C5050 before giving it up for the SP-350. I love MANY things about this camera: the shape, the styling, the new button layout, the extra features like the SCENE options.I am annoyed by how slow it is without a flash. I can never seem to pull enough ambient light into a scene not to make it blurry as hell. That's a bummer to me, as I loathe flash, and tend to shoot 99% of what I do with whatever light is available to me.I's a compact and useful camera, and I find myself appreciating the movie feature more than I imagined.", "Date": "April 30, 2006"}, {"Title": "Fantastic camera", "Author": "Jeffrey M. Duffield \"jeffmd2\"", "ReviewID": "R217WRY8MO6K8Z", "Overall": "5.0", "Content": "I have owned two other Olympus camera's, this was my main reason for purchasing the new SP-350. I was most impressed with it's size, shape, hand grip, and outrageously large LCD screen (2.5) for viewing the shot. A nice feature is the \"My Mode\" settings. You can preset your favorite settings in 5 different mode memory slots. Also has a vast aray of preset \"Scene\" settings for different conditions. Easy to navigate menu. It has a built in speaker for sounds. The picture quality is outstanding, sharp vivid colors. I have had some of my shots printed, and they are beautiful. As with any digital camera, you have to focus before you shoot. It has a sweet spot for focusing on your subject, just be patient and let it focus before you shoot. Mine powers up real fast and with the self covering lens there is no need for a lens cap to keep track of or loose. I love this camera, it is by far the best one I have owned. I give it 5 stars and would recommend it to anyone who wants a top notch digital camera.", "Date": "December 2, 2005"}, {"Title": "8MP's in my pocket", "Author": "Amazon Customer", "ReviewID": "RI2KQZR4TAPMT", "Overall": "5.0", "Content": "What can I say?  This is the third Olympus camera I have owned.  I don't think I will ever buy another brand.  The SP-350 packs a whopping 8 megapixels into a tiny case that fits easily in pants pockets.  The large LCD display produces sharp previews that can be zoomed and panned.  I can't say enough about the image quality of the photos.  There are plenty of settings for tweaking to get the right results almost every time.The only thing the camera lacks is battery life.  I suggest 2300Ma batteries or better and the H style memory card to speed the write speeds up (2-3X faster vs. the M cards).", "Date": "September 22, 2006"}, {"Title": "I love my Olympus SP-350 \"now\"!", "Author": "George D. Andrew \"Geodandrew\"", "ReviewID": "RXJIFGQS284WM", "Overall": "5.0", "Content": "I bought this camera after a good amount or research. I have the Olympus C-4000, which is a 4 megapixel camera. I took a lot of pictures with it. I wanted an 8 megapixel camera next. I looked at the C-8080 wide angle but never bought it. When the SP-350 came out I thought this might be the one.I was going on a trip to Eastern Europe and decided to pull the trigger. I bought the camera and the two lenses that go with it. The first thing I noticed was the size, IT'S HALF AS BIG AS THE C-4000. And the wide-angle lens is ¼ the size of the C-4000 wide-angle lens.The camera takes unbelievable pictures; it even takes pictures in RAW format. So I'm thinking great camera right, well.When I get to Europe the camera works fine with the batteries that come with the camera. I couldn't believe how long the \"stock\" ones lasted. But as everyone knows you need to have rechargeable batteries with any digital camera. So I brought along 4 sets of 2300milamp AA.Well I was in Eastern Europe between Christmas and New Years. And as you would think it's cold, to say the least. The batteries kept dieing really fast, like take 5 pictures and the camera battery indicator light comes on. I can't tell you how frustrating this was.  So I chalked it up to the cold, and pressed on.Well it's not the cold; it's the firmware in the camera. After I called Olympus they told me there might be a problem with my cameras firmware, and I would need to upgrade it. After I upgraded the firmware, it's working just fine now.I'm still giving the camera 5 stars because it's got a lot of shooting functions, it's easy to use, even though it's more complicated, it's small and compact, and as I found out you can upgrade the firmware. It's a more complicated camera then the C-4000 but if you're the type that likes more functions then this it the one for you to.", "Date": "March 7, 2006"}, {"Title": "An easy to use camera with a lot of creative control", "Author": "Joe D \"RealGuns.Com\"", "ReviewID": "R2ME5P4VG58N13", "Overall": "4.0", "Content": "This is my second Olympus in this price and feature range and it has been great to use for informal snap shots, as well as for formal shooting with external flash and photo floods. Battery life even with internal flash is exceptionally long, close up modes and zoom functions are excellent and the spot metering feature makes high contrast and backlit shots a snap. Yes, I have high end SLR products, film and digital that are used for more specialized applications, but a single camera to tuck in a pocket for a trip or day out or a quick web site shoot or family party coverage; it's a great little camera and well worth the price.The only areas where a good deal of improvement could be made are availability of accessories like filter adapters, chargers, and auxilary lenses and a price reduction on typical accessories like flash units and PC hot shoe adapters.", "Date": "April 28, 2006"}, {"Title": "Power and Performance in a little black box.", "Author": "South Central Library Emporium \"Library Emporium\"", "ReviewID": "R2K2N7W7CUQIE4", "Overall": "5.0", "Content": "Huge LCD and DC power make this a great camera for professional use. As an Ebay seller my photos are my lifeblood, and this camera treats me very well. Good price and great pictures.", "Date": "July 21, 2006"}, {"Title": "Good, but not great...bring some extra batteries", "Author": "Derrick \"Derrick\"", "ReviewID": "R3KT676FBER6X7", "Overall": "4.0", "Content": "I bought this camera last year for $300 and I would say it's worth the money, especially now since it's $130 cheaper. Pictures are amazing, even at high resolutions, colors are very accurate and the macro shots are unbelievable! The scene shooting mode also gives you around 15 different scenarios to choose from which makes taking great pictures very easy. Oh yeah, the 2.5\" display is crytal clear in any lighting situation, allowing you to view your pictures immediately. Not to mention the video mode lets you shoot at 640 x 480 at 30fps. The menus are very easy to navigate through as well. My only gripe with this camera is the way it eats up batteries. If you plan to shoot all day, you might want to bring at least 4 extra AAs. Or you can spend the money and purchase a lithium ion, which might last a little bit longer. I would rate this product at 5 stars if it were not for the fact that you will spend quite a bit of money on extra batteries. Check out my pics of the Christmas ornament and the cat.", "Date": "January 8, 2007"}, {"Title": "Good or bad, you decide.", "Author": "Edward A. Eckel", "ReviewID": "R2BR9SLL1P0K1W", "Overall": "4.0", "Content": "When I received this camera, a 3 volt battery was provided. This battery lasted a long time but was not rechargable. After this battery went dead, things turned bad in the battery department. The tech info said Alkalines or NIMH rechargables will work. Unfortunately, they only worked for about 4 or 5 pictures before the camera shut down. The Alkalines were worst, lasting two or three shots before shutting down. The rechargables were new 6 months ago and work just fine in my other Olympus cameras (C3200 & C4000). I discovered there is a firmware upgrade so I did it. The batteries run longer but the low battery indicator still comes on after a few shots which is annoying. It doesn't seem to stop the camera now but the indicator being on all the time means you don't know when the batteries are REALLY low. I bought new rechargables and these do keep the indicator off so I must believe it is simply set too sensitive to battery voltage and the firmware was to simply make it work regardless of the indication. It did nothing to reset the indicator turn on point. My guess is that in six months, the new rechargables will give the same false indicator as my other ones do now.The camera only comes with some small amopunt of internal RAM but not enough to be useful since high quality 8 MP files are large. I see no point in buying a camera such as this and using it in the lowest resolution, therefore, I had to purchase a memory card for it immediately.The camera does take fine pictures and has some nice features. The monitor is bright enough and the size for such a full featured camera is perfect for stowing in a pants pocket. Olympus maintained the bump where the batteries go and that makes for a more solid hand grip. Larger hands need something to grab onto and this provides that. Too many cameras, in an effort to be ultra compact, forget the need to actually hold the device steady while taking a photo. Having 8 MP of blurry image does no good for anyone.I have printed frames on a large format plotter and have some beautiful three foot by five foot prints from it (yes, that is FEET). People cannot believe the prints are from a digital camera unless they examine the print VERY closely so prints in a typical album size are as crisp as the printer is capable of printing them.Overall, it is a good camera but Olympus could have done MUCH better regarding the batteries and how well the low indicator performs. My older cameras did not have these problems and they still don't have any problems and I've shot many thousands of frames with each without incident.", "Date": "January 3, 2007"}, {"Title": "A great little point and shooter for day trips - only the small zoom and very slow capture disappoints a little", "Author": "Keith Joseph", "ReviewID": "R38MUN0NG1UNJF", "Overall": "4.0", "Content": "This is a very comfortable, lightweight and small 8MP camera that produces very good photos in varied conditions (even flash). I use cheap hi-power 2700 mH AA rechargeable batteries (2) and battery life is fine considering it's just two batteries. Others have reported poor battery life, but it's normally the battery indicator is lying and you need a firmware upgrade to correct the bug (easy, if a little risky, with the Olympus supplied software). Mind you even with the firmware upgrade, batteries don't last long at all, so pack 6 spares (and only use hi-power rechargables or expensive lithium packs). So you need a camera case that can pack more batteries, and a charger. Focus is quite good and fairly fast to lock if the menu is set to central focus and lock, rather than continuous hunting mode. Image quality is very good (for the price) and images are generally well exposed (rarely if ever overexposed) with a vivid attractive colour balance, and ASA goes up to 400 if needed - although at higher ASAs image noise (speckles & fuzz) is very noticable when magnified. There is a very good set of menu options enabling you to remove chirping camera sounds and annoying flash assisted focus, plus more pro options like focus modes & lock, ASA, many `scene' modes etc.. You can use an external flash (but it'll probably cost more than the camera) and a fun waterproof housing (twice the cost of the camera). We have a selection of xD cards but even a 512Mb one only holds 250 pictures in 3,264 x 2,176 HQ jpg mode. A 1Gb H (highspeed) Olympus Xd card works OK. Transfer to PC seems quite fast compared to my E500 SLR (as it's USB2). There's no LCD viewfinder (it's there but optical only). Fortunately the very large rear 6.4cm [2.5\"] LCD panel is great (and I can easily read the menus without glasses). It also has VGA movie with sound.The only thing I miss with this good little camera is a large zoom. The 3x just isn't as flexible as the image stabilised 12x zoom on the likes of a Canon S3IS and Panasonic DMZ. In the SP350's favour you get far less finger marks on the smaller lens, it's a great deal cheaper, a lot smaller and the wife/kids aren't fussed anyway. Also the recycle time is very very slow (5s or more) with flash - you think the camera or batteries have died - perhaps try increasing the ASA instead (although image noise may then become annoying). This slow capture time has turned my wife against the camera, as she keeps missing shots waiting for the camera. Plus you must pay to upgrade the supplied software to the excellent Olympus Master `Pro' - reasonable for once as this camera is so cheap . But overall this is a great pocket-sized point and shoot camera, with a very comprehensive set of menu options should you wish to be more adventurous - a real improvement on the last generation sub $250 cameras. There simply aren't many cameras that offer shutter speed and aperture priority in this price band. It is also well worth considering as a 'cheap' second camera for places where a digital SLR (or prosumer 12x camera) is just too large and obtrusive.", "Date": "December 23, 2006"}, {"Title": "Another Great Olympus Advancement", "Author": "Peter La Barbera \"plabjazz\"", "ReviewID": "R35ICXZ6VFEZAW", "Overall": "5.0", "Content": "This makes my fourth digital camera from Olympus. With each new camera the quality gets better and the price, lower. This camera has many wonderful features and is a joy to handle. The picture quality is excellent. Like most new technology items, Apple products aside, learning the menus and such may be a bit intimidating for the newbies.", "Date": "August 25, 2006"}, {"Title": "Decent Camera", "Author": "Fox Mulder \"the X files\"", "ReviewID": "R3VISADPF6I57S", "Overall": "4.0", "Content": "I purchased this Camera while vacationing in FL at a Best Buy down there.I had a cheap 3mp camera but as I was about to go on a day trip to Kennedy Space Center, I can say i am so glad I purhcased this when i did, my pictures turned out excellent. I was well impressed. I also went camping in KY and went canoeing, I had my camera in a zip lock bag just in case. Anyway I ended up tipping to canoe and the camera went into the water, the ziplock broke open and camera plunged into the the dirty green water. I freaked out thinking it must be broken. To my suprise the only damage was a fogged LCD screen, i took all the screws out and put the camera under a hand dryer in the bathroom, needless to say i was able to carry on with my vacation in KY and took some great shots of Mamoth Caves.The only downside I find, maybe I have just not read the manual properly, but i like to change the AF Mode to Spot, but for some reason even if i save it in My settings it always goes back to iESP. It's a pain because i have to change it for every shot. I did notice on iESP that if i am trying to focus on say some plants then the focus shifts, which is why i change it to spot so i can focus it where i want it to.Other than that, it is a great Camera.", "Date": "November 22, 2006"}, {"Title": "One of the best ever--even with its limitations", "Author": "L. Wechsler", "ReviewID": "R1PFYJ36OHPYQ0", "Overall": "5.0", "Content": "I have had this camera for years and love it, even though it has limitations that can frustrate. I will start with the flaws. Saving files to the card is very slow, especially if you shoot in RAW (most won't, so no big deal). It is slow (especially by today's standards) to review pictures after taking them. And it eats alkaline batteries for breakfast lunch and dinner. Other than those things this camera is exceptionally well thought out. The size and feel in one's hand is seriously good. It's the best grip ever for such a small camera (in my humble opinion). It has a hot shoe for attaching an external flash. It has full manual control of shooting if you want it. The picture quality within reasonable ISO range is stunning.  It is also capable of stunning macro shots.I have an Olympus DSLR and and E-P1 (essentially a DSLR), but I still shoot with my SP-350 sometimes because it is so small yet can do so much.As for the problem with alkaline batteries, the solution is simple: use the new low-discharge rechargeable NiMH, or rechargeable lithiums. With those battery life is just fine. (I can not stress how much you should not even waste your time with alkaline batteries.)I also use this camera in an underwater case when I scuba dive, and it performs very well.", "Date": "November 30, 2009"}, {"Title": "Awesome Camera at an amazing price", "Author": "Lonnie Hernandez \"Studio 329\"", "ReviewID": "REJD9F59I0UN0", "Overall": "5.0", "Content": "Had this camera for over a month and it has not been dissapointing.  The quality is excellent and the size is nearly perfect.  I love the hot shoe on this and use it often.  If you are looking for an 8mp that won't dissapoint look no further.  I grab this when I don't want to lug around my DSLR.", "Date": "February 6, 2007"}, {"Title": "Perfect for the non-pro needing a GOOD camera", "Author": "Shonna Gariepy \"Shonna\"", "ReviewID": "R3J8SVC7AI3YDR", "Overall": "5.0", "Content": "I'm not a professional photographer by *any* stretch, my husband's closer to that range than I am....I got this for Xmas and have to say, it's had a LOT of use - the pictures have turned out great and the only two complaints I'd have is that it can take a while to get the camera to \"click\" and take the pic in the first place - gotta prepare the camera a bit first to get that to happen.......have missed a few really great shots of the kids because of this - and the batteries DO run out fast - though my suggestion is what my husband's said to me that seems to be working:  Take pics from the small window, don't use the 2\" display screen in back - it eats batteries for lunch.  I've had it for less than a month and have replaced the batteries once already.Still, it gets a LOT of use and will likely continue to - it's a GREAT little camera for a mom like me who's not terribly technical & just wants a GOOD camera that will fit into a small purse maybe or the diaper bag or......it's light, compact and takes great pictures - what more could you ask for?!That said, holy *$%()$#@#$% is that really the price?!  Yow....thanks to my father-in-law for this....WOW......", "Date": "January 14, 2007"}, {"Title": "GREAT camera!", "Author": "susan rose", "ReviewID": "R36PIB8YZG5IVT", "Overall": "4.0", "Content": "I bought my camera about 2 years ago and LOVE it! the pictures are great, and macro pics are outstanding! If you can clearly see pollen on a bees legs you KNOW this camera is the real deal.  I have taken it to the mountains, desert and sea shore and it is not a baby...it has taken some rough handling and just keeps on ticking. I would recommend this camera to anyone! hands down a winner.if there are any drawbacks, I knew them when In purchased the camera. 1. no or little anti shake so I use a tripod. 2. I wish the iso would go a bit lower, but that is not a big deal. 3. a lag time of a few seconds between shots, which I don't take a lot of speed shots. 4. I have to use lithium 8x batteries. I bought the camera knowing of these drawbacks because the picture quality was so outstanding and it has not let me down yet.I love the clarity and the lens. I have shot night, sunset, sunrise, high noon, shade and wish there was a fan club for this camera. Unfortunately Olympus with higher megapixel cameras, in my opinion,is going to have a tough time improving on this one.hope this helps.", "Date": "October 25, 2010"}, {"Title": "good bargain", "Author": "April T.", "ReviewID": "RL5XUC25BLDMP", "Overall": "4.0", "Content": "i've always liked olympus cameras, and this one did not disappoint.  this model has since been discontinued, but there are still a few available if you look.  the price is right, the performance is typical Olympus.  point and shoot ease, but enuf bells and whistles to keep your interest.", "Date": "May 21, 2007"}, {"Title": "Best bargain out there!", "Author": "Caver", "ReviewID": "R2R6BXGL7OR6HR", "Overall": "5.0", "Content": "If you buy this camera, the first thing you do is go online and upgrade the firmware from the Olympus site.  Then you won't have the pseudo-battery problems.  The battery life is actually very good.Next, read the manual.Name me another 8 mp digital camera in this class that has all the features this one has - light-weight, 8 mp, a hot shoe (!!!), FULL manual controls, slave flash settings, etc.  If you look around you can get it for under $200 (you should even consider a refurb which is cheaper).I am a cave photographer and I purposely went after this camera because of the above features and price (especially a hot shoe, manual controls, and slave flash capable - all required for the photography I do).  I am NOT disappointed.  In fact, I own two SP-350 cameras in addition to SLRs.  It has worked like a charm under some very adverse cave conditions (when I'm wet and covered in mud).Recommendation:  Don't buy this camera.  That way there will be more of them available for me and my fellow cavers.  <GRIN>", "Date": "April 3, 2007"}, {"Title": "Love this camera", "Author": "Michele Kemper \"lizardgal\"", "ReviewID": "RZ65GIPQO6G0C", "Overall": "4.0", "Content": "I love this small, yet almost DSLR camera.  It allows me to be creative or just point and shoot.  Lenses help expand this camera's capiblity.  I've taken a wide varity of photos with this camera from macro shots to full wide angle.  It's also nice that you can upload the newest verison of filmware from Olympus to keep this camera current.", "Date": "March 9, 2007"}, {"Title": "wonderful little camera", "Author": "camera buff \"camera buff\"", "ReviewID": "R3TR2R9UAO4P9X", "Overall": "5.0", "Content": "I looked at this camera for over a year before actually purchasing it for Christmas.  I am a \"film\" geek and have 2 35 MM cameras with several lenses, plus several point and shoot cameras.  I decided to delve into the digital world as I am getting married and wanted something to take quick pics with while wedding planning.  I also foster dogs, so I needed something with instantaneous results taht I could send the Humane Society.  Here's what I think.1. it is a good size camera, easy to hold and stabilize with a lot of MP for the money.2. I use the CRV battery, and have used the same one all along at this point, and still have lots of battery power left.  I haven't tried either AA or rechargeables to check this out. One of the reasons I bought this camera however, was because I like the option of whereever I go, I can get a quick battery if I run out and don't need to wait for the battery to charge.3.  while the picture quality is not up to film quality, I am very happy with the pictures that I have taken.  At 8MP I was able to blow up some pictures on my computer screen with very little loss of resolution.  I have had some printed in 4X6 size and they are great4.  I use the current scene settings and pictures are good in both low light with the flash and outdoors in the snow.  I took pictures of me in wedding gowns when I was trying them on and all turned out good.5. Speed is a bit slow, but it is with all digital cameras as compared to a film camera.  I made some changes in the settings and that has helped a bit.  I also plan to get a high speed XD card and that should also help. I don't plan to take pictures of fast moving objects with this camera, except for puppies, so that doesn't bother me too much.6.  I like being able to zoom in on the camera screen itself.  It lets me see if I actually got the picture that I wanted.  I also like an actual view finder for those bright days, although I took some while sledding and had no problem seeing the large screen on the back.7.  I love the fact that I can get the underwater housing (which I plan on getting and again a major reason for my purchasing of this camera).8.  I like the idea of a hot shoe.  Any point and shoot camera flash is not going to carry well and usually leaves a lot to be desired in the color and lighting of the picture.9.  I like the idea of being able to get both a wide angle and a doubler for the lense.  While the zoom on this camera isn't great, you can adapt by having the doubler.  Again, I don't plan on using this as I do my 35MM so the camera zoom wasn't the most important thing to me.10.  There are many settings on this camera that I haven't even tried yet.  I don't have much patience to sit and read a manual, so I am just using what I can figure out as I go along.  The basics are very easy to use.In general this is a relatively advanced camera at a point and shoot price.  It has some interesting options for a camera of this price level including the underwater option.", "Date": "February 5, 2007"}, {"Title": "Will be used for underwater photography", "Author": "Doug1", "ReviewID": "R1KUM36HPR5LYM", "Overall": "4.0", "Content": "This little camera is highly recommended for underwater photography (when mounted in an underwater housing) because of its ability to record photos in RAW format.  It looks like it will be a great camera for general photo use, as well.One criticism:  This camera comes with no memory card and you must use the onboard memory till you get a card.  This means you are limited to about 15 HQ pictures.  So be ready to spend another several bucks for a memory card.  I got the 1G card for about $46 and can now shoot about 500 HQ photos.", "Date": "January 26, 2007"}, {"Title": "Slow shutter is frustrating; batteries drain really fast", "Author": "Analisa Nazareno \"Analisa N\"", "ReviewID": "R2UO2E1FEI193", "Overall": "2.0", "Content": "We bought this camera for the 8 mega pixels and the low price (comparatively at the time), realizing there would be drawbacks in other areas. The drawbacks have been many.Daily I am frustrated with my camera, as I've lost many good shots. The camera in auto mode takes so long \"thinking\" that my subjects have moved on or gotten bored and impatient by the time it shoots. Sometimes I will use the shoot and select mode so I can get multiple shots and hopefully one will come out fine. But quality of lighting or focus is often sacrificed. It takes a long time thinking in general, but takes longest in auto mode.The battery drains quickly if you're using the viewer. You get more shooting time if the viewer is off. But if you turn off your camera (I turn it off often to protect the lens), it doesn't remember that you've turned off the viewer, as some other cameras do. So, you have to turn off the viewer each time (if you want to preserve battery life), which can cause you to lose a good shot.Additionally, in one year and two months, the CCD sensor gave out and we had to get it repaired. Fortunately, I had the 4-year extended service plan through Best Buy and I didn't have to pay for the costly repair or have to buy a new camera. I've learned that the type of battery that this camera uses can damage the CCD sensor if left in the camera all day long (who remembers to take out the battery every day?).If you've managed to take a picture despite the slow shutter speed, it can take some nice shots. Sometimes the color isn't so vibrant, but there is clarity and there is sharpness under the right conditions. The \"scene\" modes are nice if you're a novice like me.Bottom line, though, you're better off spending an extra couple hundred dollars for a camera with better shutter speed and longer battery life (Canon PowerShot will be my next purchase).", "Date": "March 31, 2007"}, {"Title": "I would buy it again", "Author": "A.Right \"Nothing is what I seems. So check tw...", "ReviewID": "RN4F35AQKSCFI", "Overall": "4.0", "Content": "This camera was first released in 2005 when it cost probably $250. I would buy it again, but not at the prices I am seeing it. Probably sold at these prices now because it is unavailable, like a classic camera?  I shot outstanding photos with this little jewel which gives incredible color depth to the photos, had closeup capabilities worth the money it cost at the time it was manufactured new. Now.... Well, I would pay  around $40-50 dollars for it. Do not be misled, this is an old camera.  I remember it was slow to acquire focus on low light. Given enough time or light it would provide the most wonderful, deep, colorful pictures.  Small enough to be handld with one hand to take a photo. The \"dating\" of the camera can be detected by the 3X zoom, which is rarely seen in updated cameras unless it is the cheap P&S;, but this was not a cheap P&S; at the time. Four Stars is because it is an old camera. At her date I would have given it a 5 stars grading.", "Date": "March 3, 2013"}, {"Title": "Slowest camera EVER, but takes AMAZING macro photos!!!", "Author": "Ellebell222", "ReviewID": "RPSHNNWIT0MJ2", "Overall": "4.0", "Content": "This camera finally died on me after about 4 years of use, and I really did love it, despite the fact that it was the SLOWEST CAMERA EVER... but it took such nice macro photos I couldn't help but love it. The still shots were pretty decent too. I bought it at Costco for $200. I carried this camera EVERYWHERE, and it took quite a beating from me so the fact that it lasted 4 years is pretty amazing. I took thousands of photos with it. First, the flash gave out in maybe the 3rd year... it first started to look too bright and everything was washed out. Finally it just didn't work at all. Then in the 4th year it started taking pics that looked photoshopped / grainy. Still, I kept using it. Finally, the poor camera just wouldn't turn on. But I would still recommend this camera (even despite the slow factor) because overall the pics were very good.For the longest time I didn't realize you had to change the adjustment settings so the volume would actually record, when you ran the video camera, and I finally figured it out (I thought it only did \"silent videos.\") So now I have a whole collection of charlie chaplin-esque clips. It would have made more sense for Olympus to make the sound a part of the default, but I guess they have their reasons.I will miss this camera! Am actually considering getting it fixed and having it as a backup or possibly donating it to my nephew. I liked it that much. I'm going to upload some of my favorite macro photos so you can see the quality. One will be of a bug, one will be a daisy.", "Date": "November 7, 2011"}, {"Title": "WOW", "Author": "Jade", "ReviewID": "R3K12INXZQSO41", "Overall": "5.0", "Content": "What can I say about this camera wow the pics are fantastic the color it is as good as my Sony with a 1080i in it this camera has things in it a $900 camera would have I have also purchased the LENMAR DL-CRV3 Rechargeable and the  Lenmar KITCRV3 Charger for CRV3 Battery works great bought this camera in Jan of 2007 and its still going strong love it.", "Date": "May 7, 2010"}, {"Title": "I loved this camera up until its death...", "Author": "Dr. Girlfriend", "ReviewID": "R1CQEYLKK78VZS", "Overall": "4.0", "Content": "I'd owned a few digital cameras before settling on this one, and I never regretted my purchase until now.  I say this because the camera is dead, and Olympus estimates the repair at $174.  That's just plain crazy.Turns out my problem is a fairly common one, so if you get this camera my advice would be to get the protection plan.  My camera lasted about two years.Contrary to the negative reviews on here, I think it got excellent battery life.  Try a Nikon CoolPix if you want to see crappy battery life.  Even with plain old AA's this camera would power up for a good while... but I would typically get those super-duper lithium batteries.  You pay more but they last far longer.As for the slow shutter speed, I agree it is a problem at time.  But I started using the sports setting for my action shots.  This helped.This is a good little camera, and it took great pictures. Just be aware of the fact that it's most likely mechanical failure will cost you the price of a new camera.  I'm not a fan of protection plans, but I would definitely suggest it here.", "Date": "November 1, 2008"}, {"Title": "Camera is really durable!", "Author": "K. S. Sulzer", "ReviewID": "REO92KTGMSB3G", "Overall": "4.0", "Content": "I have had this camera for over a year now. A few months after I got it, I had an issue where the lense wouldn't extend. There was a jam, so I sent it back to Olympus and it was repaired. It took them 5 days to inspect it and repair it, since then I have had NO problems with this camera. My husband actually dropped it the other week from a height of about 5ft 4inches (he is 6ft 4 and was getting ready to take a picture) and the camera still works GREAT! My only complaint is how fast it does go through batteries. We have 8 sets of Energizer  2500 mAH rechargeables, and we need every one of them.", "Date": "July 24, 2007"}, {"Title": "Wonderful Camera", "Author": "Joey", "ReviewID": "R3VS439AK6WUW0", "Overall": "5.0", "Content": "I bought this camera last summer and brought it on an 18-day camping trip. The camera survived and captured some amazing pictures. While at first all of its functions may intimidate some people, it is very easy to use. It takes great pictures, is a nice shape and size, and takes pictures quickly (when the battery is full) I was a little weary about only having 3x zoom, but if you really want to take a picture of something far away, you can switch to Super High-Quality and just zoom into that pic once its on your computer. The macro is AMAZING on this camera, I was able to get some wonderful close-up shots of spiders and plants and other things. My only complaint is tht it tends to eat up AA batteries. The CRV that it came with lasted for like 2 weeks of heavy use so I would recomend using those with this camera. Like I said, that was my only complaint.", "Date": "April 9, 2007"}, {"Title": "SP350 Review", "Author": "Summers Best \"KSW\"", "ReviewID": "R1TLUUI9WX2B03", "Overall": "5.0", "Content": "Great smaller camera. Take a lot of animal pictures and the response time is much better than the camera I was using (I took a lot of pictures showing only the tails or less as they had departed before the shutter clicked). This does not happen with the Olympus SP350. Have printed some 8x10s and print/photo quality is exceptional. Also like the fact that it has an optical viewfinder as well as a large monitor. Another nice feature is that you don't have to memorize the instruction book to effectively use the camera!  Good value for the price and excellent service from the vendor.", "Date": "March 9, 2007"}, {"Title": "My first digital camera", "Author": "K. Green \"Newbie to the digital world\"", "ReviewID": "RX728J351BD36", "Overall": "5.0", "Content": "I was worried from some of the reviews, but I must say, this camera is completely awesome! I have taken at least 50 pictures so far and the battery is still going strong. I didn't think it would happen, but it's probably going to replace my professional 35mm that I always use. My daughter took it to her middle school dance, and it's so easy to work, she had wonderful pictures of the night. Actually, every picture that has been taken on it, has been wonderful quality. They are crisp and clear. You get a great camera for the price! I'm completely satisfied with my purchase.", "Date": "March 8, 2007"}, {"Title": "GREAT CAMERA!", "Author": "P. RIVERA", "ReviewID": "RCZI5MPVIQGMW", "Overall": "4.0", "Content": "I LOVE THE CAMERA, SOMETIMES I WISH IT HAD A BIGGER OPTICAL ZOOM. THE CAMERA TAKES BEAUTIFUL PICTURES. I LOVE THE DESIGN OF THE CAMERA. WOULD HIGHLY RECOMMEND IT.", "Date": "January 31, 2007"}, {"Title": "Sweet little camera", "Author": "Artsy", "ReviewID": "R106VLFXW1YM8P", "Overall": "5.0", "Content": "I've owned the Olympus Stylus Zoom 105 (film) camera since 1997 and have been waiting patiently for a digital to replace it. I bought the Olympus D-360L 1.3 megapixel digital when it first came out several years ago, but of course it didn't do the job of my Stylus with 800 Kodak Max film which I use for travel photos. During the past couple of years I have looked at just about every available digital camera in this price range but was never happy. A few weeks ago I decided the SP-350 was about as good as it was going to get so I took the plunge. When I earned money as a photographer I owned an SLR so I liked the idea of being able to have manual control over the camera if I wanted to. So far I haven't had to use it as the auto settings seem to do the trick. I've used it in many situations, low light, indoors, night time, bright sun, shade, all variations of zooms and macro. Now, this is definitely not an $800 camera but I post the photos on my website and look at them on CDs, rarely print them out, but if you are happy with excellent point and shoot quality (I am at this stage in my life), this is the perfect camera. I bought an Olympus Memory Adapter for about $17 so I can chug the images directly into Photoshop. The colors are true and the focus sharp (yes, it does take a second to focus but I'm not shooting horse races). As I have arthritis, I love the grip on the camera even though it is smaller than any camera I have owned previously. I also like the black casing, just like my film camera (what is with silver, anyway?). And I like the large, bright, viewing screen and the self-closing lens cover. It is well-designed, comfortable, and except for needing an engineering degree to figure out how to put the carry-strap on, it is intuitive to use. I highly recommend this camera.", "Date": "December 30, 2005"}, {"Title": "Olympus SP 350", "Author": "A. Cohen", "ReviewID": "R271SYRP9ROQJC", "Overall": "5.0", "Content": "I found this item to be as good as it was rated in PC World. Easy to use, good quality photos, 8mp and at a reasonable price.", "Date": "January 15, 2007"}, {"Title": "Great for ebay", "Author": "Janice C. \"Kindle Addict\"", "ReviewID": "R23I93OG3Y2OL7", "Overall": "5.0", "Content": "I needed a new camera for pictures on ebay.  This was the perfect choice.", "Date": "December 11, 2006"}, {"Title": "Poor optical quality", "Author": "Joseph L. Kashi", "ReviewID": "R2S4A75B6U7N4C", "Overall": "2.0", "Content": "Over the past 45 years, I have used many cameras from 11x14 and 4x5 view cameras through small point and shoot digital cameras.When I bought an SP-350 in 1986, I had high hopes for the SP-350 as a small RAW-capable compact camera.  After comparing the SP-350 side by side with several other compact cameras, including a 5MP Kodak z730 and a very sharp 6MP Kodak z760, I immediately gave the SP-350 away even though it was then my only RAW-capable camera.  I was VERY disappointed in the optical quality.  I could not make a sharp 13x19 print, something that both consumer-oriented Kodak cameras could do with ease.  (Actually, the 6MP Kodak z760 is capable of a decent 18x24\" print.)Do yourself a favor:  Spend less money and get a more modern and effective S90 or G11 series Canon.  The G11 Canon lens is much sharper and the sensor is better.  The SP-350 is seriously out of date (it doesn't even have anti-shake stabilization) and it was not among the better  cameras even when newly introduced.", "Date": "December 29, 2009"}, {"Title": "Dissapointed", "Author": "Diana Calle", "ReviewID": "RF9RMUBQUWKBB", "Overall": "2.0", "Content": "After owning a few digital cameras, I decided to go with the Olympus SP350 mainly because of all the great reviews it's gotten. I have two small children and the most important feature that I look for in a digital camera is the shutter speed as I like to take lots of candid photos of my kids. I could not do that with the Olympus. Every time I got ready to take a photo the time for the shutter to go off was extremely slow thereby losing the chance to take a great picture. The battery life is quite limited. It would drain after taking several pictures. In summary, although the camera took nice photos it was just not the one for me and if you have young kids and like to take consecutive candid photos of them, I suggest that you spend a few hundred dollars and buy a digital SLR camera. I bought the EOS Canon RebelXT and I have not been happier. The shutter speed is excellent and the battery last for days.", "Date": "June 28, 2008"}, {"Title": "Do Yourself a Favor", "Author": "David L. Stevens", "ReviewID": "R2KF4ZSW2D0S94", "Overall": "1.0", "Content": "I bought this camera at COSTCO about 2 years ago for about $[...] which was about $90 more than it is worth. It has many great features that attracted me and could have made it a great camera but the shutter lag and memory write speed make this camera almost useless. Battery life is also an issue. Even if it didn't have these flaws it would be a $[...] camera at best.Do yourself a favor and don't get ripped off. Spend your money on a good camera.", "Date": "April 11, 2009"}, {"Title": "its hard to make a review over a product you dont have.", "Author": "MELISSA J. RITCHIE \"RITCHIE\"", "ReviewID": "R1HJTYIEIFSBTU", "Overall": "1.0", "Content": "i ordered a camera 2 monthes ago and i have yet to recieve it. not only that, it said on my product tracking that it was delivered to the back door. i am on a military army base in iraq so thats impossible. when i tried to contact the company to find out what is going on (over 5 emails to be exact) i recieved not one response. so, after they took out the money from my bank account, i recieved no product and no response. im in a combat zone so its hard for me to get to a computer/phone. so this has been one frustrating experiance. i will NEVER do bussiness with this company and its pretty obvious to me that they dont care.", "Date": "October 15, 2008"}, {"Title": "8 Reasons not to go here...", "Author": "Sinister Minister", "ReviewID": "R1GCRU51NZXVPR", "Overall": "2.0", "Content": "Greetings folks sinmin here with a friendly warning stay away from this camera! I am an Olympus lover by nature, so when I tested this camera I was shocked that olympus even released this lemon in the first place. Since I couldn't get the camera to operate long enough to really test it I'll just give you a list...1. focus. this camera has no idea what it is or how to aquire it! Out of the 15 test shots I took, not 1 was in focus!! Thats the first time this ever happened.2. Speed. Not here or even close it took the camera almost 4.5 seconds to start up and a nearly 2 second lad between shots! (No kidding)3.On board flash is horrible, it washed out every shot I took with it.4.3X optical zoom on a 8MP camera is a stupid idea, especially on one that can't focus! At least if you could get in focus you would have some cropping options!reasons 5, 6, 7, & 8 are lousy pictures, I have never seen a camera that didn't take one decent shot during a test until this one!And the biggest reason NOT to go here is these test results were the same over 5 out of the box cameras tested!!! I gave it 2 stars because it eventually did start up, the memory card worked fine, and its black. Other than that its pure crap! Olympus should be ashamed...Oh well they can't all be winners can they! Happy Shooting!", "Date": "November 3, 2005"}], "ProductInfo": {"Price": "Unavailable", "Features": "8.0-megapixel CCD captures enough detail for photo-quality 16 x 22-inch prints\n3x optical zoom; 2.5-inch LCD display\nAdd optional conversion lenses to the camera's threaded barrels (not included); hot shoe attachment accepts external flashes\n30 selectable shooting modes, including 27 creative scene options\nPowered by CRV3 battery (included) or two AA-size batteries; stores images on xD-Picture Cards", "Name": "Olympus SP-350 8MP Digital Camera with 3x Optical Zoom (Black)", "ImgURL": "http://ecx.images-amazon.com/images/I/515CP2W77GL._SY300_.jpg", "ProductID": "B000A7B9YY"}}