{"Reviews": [{"Title": "Sports nuts rejoice!", "Author": "Cosmo_dog", "ReviewID": "RNHPQJ65J7RKN", "Overall": "5.0", "Content": "I bought this Olympus after my Canon S400 died (yet another victim of the \"memory card error\" problem).  In addition to its compact size, I started to really enjoy its continuous shooting mode to take action shots of my kids in their various sports events like swimming and running.  The old Canon used to be able to shoot about 6 or 7 shots in burst mode before it would pause for several seconds while it stored the pictures on the memory card.  When I went looking for a replacement (I ruled out all Canons), I found this Olympus.  In terms of size, it closely matched the S400, but I was mostly interested in its continuous shooting function.The Olympus web site claimed the Stylus 600 could shoot continuously until the memory card filled up.  I was skeptical, but I ordered it along with an xD memory card.  When I got it, I put the camera in continous shooting mode, and held the shutter down to see how many shots I could get before the camera paused.  It kept going and after collecting 50 shots, I quit.  The Olympus demonstrated to me that it can shoot several seconds' worth of action shots without having to pause.  AMAZING!  I can't wait to start shooting my kids' next sporting events!I have had wonderful experiences with previous Olympus Stylus film cameras and I'm hoping this digital camera will hold up as well as the film cameras.  So far, I'm loving this one!", "Date": "December 2, 2005"}, {"Title": "Olympus, I'm extremely disappointed!", "Author": "UU Booklady", "ReviewID": "R8W72NOUN5PXZ", "Overall": "3.0", "Content": "I was excited when I first bought this, my third Olympus digital. I upgraded from the D-540 because I wanted more megapixels, was intrigued by all the extras (which I agree are cool), and wanted to pass on my old camera to my son so I'd get better pics of the grandkids in Australia.  Okay, I should have read the specs more carefully. The camera comes without a memory card. No problem, I had a couple of 128 xd cards from my old camera. Didn't realize they'd only hold about 40 high resolution pics with 6MPs. Bought a 1G card for $80. No problem. The price I paid for a 6MP camera was unbelievable. With the 1G card, I can take about an hour of video. Wish it had sound, but hadn't really considered it as a selling point anyway. I can also store about 400 SHQ still photos. Super!Loved the huge LCD screen, didn't think it would be a problem not to have a viewfinder, as I rarely use one. BIG MISTAKE! When I tried taking pictures in bright outdoor light, I discovered it was impossible to see what I was shooting. So my whold Australia trip is documented by photos I took blind. Some are good, but only by chance. I had to shoot multiple shots of everything outdoors, hoping I'd get at least one decent photo.And yes, I tried all the settings, including beach and snow, landscape, landscape portrait, etc.I've scoured the internet for reviews of this camera that mention this problem, and can only consider that others haven't used it in bright summer light, as it came out in September in the northern hemisphere, and most buyers haven't taken summer outdoor photos. Or maybe my camera is defective. Hope to read more here in coming months.I've loved my previous two Olympus digital cameras. I can't tell you how disappointed I am with this otherwise exceptional camera. And it appears that most manufacturers of cameras in this price range are leaving off the viewfinder. Comments from other users will be gratefully appreciated.UPDATE: This is the response I received from Olympus NOT SATISFACTORY! \"Unfortunately, the camera does not have a viewfinder, and as any LCD screen the monitor of this camera may not be visible when exposed to bright sunlight.\"", "Date": "January 29, 2006"}, {"Title": "loved the camera but returned it - NO SOUND CAPABILITY", "Author": "V. Cusumano", "ReviewID": "RSOTGYGXHTDFV", "Overall": "4.0", "Content": "I was not as careful as I thought when I researched this purchase. The camera is awesome, but I really wanted to be able to take short movies (with sound!) and voice annotate photos for later reference. The model below and above this one (the 500 and the 800) both have sound. This one does not. I guess something had to be left out to get it as small as it is. I am returning it for a Stylus 800. A little bigger (bad) and 8 megapixel (unnecessary), but it will do the job for only a little more money.", "Date": "December 6, 2005"}, {"Title": "Fragile LCD", "Author": "Daniel J. Bumbarger", "ReviewID": "R16UFAJAARH40X", "Overall": "2.0", "Content": "The good: Takes decent pictures for a camera in its price range. It is small. It is weatherproof, which is a very nice feature. Looks nice too. The large LCD is nice for taking pictures.The bad:  Very poorly designed LCD in that it uses a very thin piece of plastic to protect it. It is VERY easily broken and takes very little pressure to bend the plastic covering. If you buy this camera, do NOT carry it in you pocket. My screen broke durign very normal and non-abusive use, carrying it in my pocket. Due to the fragile nature and poor engineering of the LCD, I would not recommend purchasing this camera.", "Date": "February 4, 2006"}, {"Title": "Superb pocket-size camera", "Author": "Brian Dobben \"engineering manager\"", "ReviewID": "R3HS3A5A5QIK2S", "Overall": "5.0", "Content": "I still have my first digital - a 2Mp Olympus.  I always liked the shooting modes that Olympus seemed to excel with in these small digitals, especially the night mode, as it would produce nicely balanced good color shots for indoor photos.The 600 goes way beyond that, with a small size, LARGE screen (2.5\" is big anyway, but looks huge on this camera), and TWENTY-FOUR scene shooting modes.I'm thinking the auto-slide lens cover should be more durable than the hand-sliding cover on my older Olympus, which broke and has required personal babying (no loaning) ever since.Back to the shooting modes: no full-auto mode is EVER going to be perfect because there are too many considerations, but these shooting modes are great help for those of us who are a bit challenged in selecting optimal settings in manual cameras.  Users who are having issues with specific types of shooting conditions need to try these out, because they appear to work great when used as titled.  They include well-executed standards such as \"Indoor\", and special goodies such as \"Candle\", \"Cuisine\", \"Behind glass\", \"Fireworks\", \"Beach/Snow\", \"Reducing Blurr\", and 3 different underwater modes including a macro.  If you're uncertain about a scene mode from its' title, just wait about 5 seconds and it will describe on-screen what the mode is intended for. \"Auction\" example: \"Captures 3 pictures sequentially at different exposures in the appropriate size for e-auction.\"  Sweet!Another surprise is the Super Close-Up mode, signified only by the \"S\" next to the flower.  Select it and prepare to be amazed: you normally have to spend twice this much money to have this level of close-up capability in a digital.  In fact, it takes close-ups that approach the older full-size 5mb Nikon Coolpix I use at work.A big plus on this Stylus 600 camera is speed: fast start-up, fast sequential pictures. (Still has the typical 3/4 sec delay in single-shot pics if you haven't done the half-shutter pre-focus step.)This is a Superb always-have-it-with-you camera, as long as you don't need what it DOESN'T do.  No, the video doesn't have sound.  If you need that, bump up or down to another model.  I chose to use a video camera when I need video with sound, because all compact still-cameras in this price range are going to compromise video resolution and frame-rate enough that I prefer the real thing.  No, it doesn't have the manual settings that professional fotogs can't live without.  No, there is no viewfinder, so yes, it would be a pain to take a lot of high-quality pics in bright sun: if you need to do it, either be frustrated or rig a sun-shield to help you see the screen.  This was a design trade-off due to small real-estate on the camera's back: losing the viewfinder to get the huge 2.5\" screen.  For me it was worth it, because I can see enough in the daylight to aim the camera and snap several shots.  I can sort through and crop/delete later, and the big screen makes it easy to zoom in and check out the details.Brian at UltimateSyntheticOil.com", "Date": "May 22, 2006"}, {"Title": "Good and bad, but mostly bad", "Author": "Juz Man \"Juz\"", "ReviewID": "R2ANZEXW7XWWU", "Overall": "2.0", "Content": "I've had my Olympus camera for 4 months now and have taken over 1000 photos. I must say that while I'm thrilled with its superfast startup time, compact size and ease of use, I'm very unsatisfied with the photo quality.Outdoor photos are quite good - when good light is available. Indoor photos are a very poor though. The flash makes close images very bright and background images very dark. It can't seem to blend the two together. I've tried every setting on the camera with little success.One other let down is when taking a close up of someones face with the flash, you can notice the moisture on someones face - even when you can't with the naked eye. It stands out like bright spots, ruining a perfectly good shot.My camera before this was a 4 year old 2.1MP Kodak and quality wise (forgetting megapixels) is was a better camera.I bought this camera camera because of its size and durability. Had I known the picture quality was so bad, I'd have picked a different model.If I had my time again., I would not buy this camera.", "Date": "June 26, 2006"}, {"Title": "Good... Just good.", "Author": "MJ", "ReviewID": "R1IGJ8M7D6V5K6", "Overall": "3.0", "Content": "This is my fourth digital camera... and my 2nd Olympus digital camera...Pros: Light and small, huge view screen on the back, good clear pictures on screen, but I didnt love the way they came out on paper (even when I took it to a photo center). Super zoom, all 26 settings ensure that you get the right shot... you just have to know which one to use on the spot =0)Cons: I got this camera for Xmas and after my recent trip to Hawaii it no longer wants to zoom. It hasn't even been 6 months! It takes pics with the normal zoom just fine but when I try to zoom in the lens automatically turns in and the camera turns off. I'm not sure why, I kept it in a case the whole time didn't take it near the water/sand, and have not had any accidents. Other than my recent experience it has been great.So far I find myself favoring the Canon models and the Sony models (if you don't mind a slightly larger camera).", "Date": "June 7, 2006"}, {"Title": "Disappointed!", "Author": "Gary A. Webb \"Gary Webb\"", "ReviewID": "RFP3JDYW6PCAQ", "Overall": "2.0", "Content": "This is my second digital camera. I started with an HP 318 - a  nice starter camera. When I decided to step up I did not research well enough. I get some very good shots with the 600, but the lack of a viewfinder on a sunny day is an insurmountable problem. It is worse than shooting blind because all you see in the viewfinder is your own reflection. As a side note, Olympus tech support was totally unsympathetic and suggested I try to find a 3rd party clip on shading device for the unit. I could not find one.  I am also frustrated with the color quality. Photos looked washed out and lacking in vibrance. Many require color adjustment after I download them. I have read the manual from cover to cover, tried numerous techniques, but I feel this camera is lacking in basics. I have gotten some great shots, but on the whole, I would not recommend this camera. For the same price, or a little more, you can do much better.", "Date": "August 25, 2006"}, {"Title": "Fantastic Camera!", "Author": "js3 \"js3\"", "ReviewID": "R1EUEE4RO1KKZH", "Overall": "5.0", "Content": "I love this little camera.  I have just come back from a trip across four continents, and I can tell you that I could not have wished for a better camera.  Now, I don't want to mislead you, the photos will turn out blurry at first.  If you use the anti-shake feature, you are limited in HOW the photos come out (resolution, megapixels, color).  My advice to fix that problem (if they are blurry, then it is the PHOTOGRAPHER'S problem, not the camera) is to follow the camera's suggestion on how to hold it.  It really does make a difference.I only put the camera in my pocket a few times, and never had any problems, though I do know that cracks are a possibility with this camera.  Most of the time, I put it in a camera carrying case, which with the camera, a spare full battery, and an extra memory card, it was all able to fit in the palm of my hand.  I don't remember what the brand of the case was, but it's probably nylon and I bought it at Target.The screen is pretty amazing.  It's 2.5 inches, which is really great and easy to use.  You are not squinting like you would with other cameras.  In fact, the resolution on the screen is less thant that of the camera's abilities.  Yeah, it's that great!  Just about everybody on my trip this summer wanted my camera -- they spent their money on Kodaks and Sonys, but my photos came out the best, and my camera was ALWAYS ready to be used.  Yes, it is hard to see in the daylight (most of the time in the desert it was hard to see), but that has got to be expected in the bright sunshine.  Especially if your back is to the sun.The camera is All-Weather (I think all Olympus brand cameras are).  In my travels this summer, I was able to use it flawlessly in the pouring freezing rain, in the snow, and in the desert.  It has it's temperature limits, but chances are you'll be within them.  They are wide.As can be expected because it is a longer exposure time, the night mode can be difficult to use, especially without a tripod.For batteries: buy ONLY the Olympus and Maxell brand batteries.  I got an average of 500 photos on each (though Olympus lasted a little longer), and that was with looking through the photos several times.  People will say that with these being rechargeable batteries, you shouldn't buy, however, they last SIGNIFICANTLY longer, and will be cheaper in the long run.  Especially since this is a camera without an optical viewfinder, using alkaline batteries would be absolutely foolish, and lithium would be good but the same performance would not be gained.If you buy it, only buy the Type M XD memory cards.  It comes both Fuji and Olympus, but the catch is that if you want to use the panoramic function, you have to have an Olympus.  Looking on [...], I was able to get my Olympus 1 GB cards for [...] each, they are normally twice as much.So far, I have taken about 5500 photos and it's working just as great as it was when I took it out of the box.I work in a photo lab, and I would recommend the Stylus 600 to all my customers.  I actually have several friends that plan on buying it, and my apartment is decorated in photos I took with this camera and an older, 35mm model (Stylus 150).  I took down my posters because my photos are that great.", "Date": "August 4, 2006"}, {"Title": "Not Sure What All The Negative Reviews are For", "Author": "Brandon L. Katz", "ReviewID": "R3PGGQHEY7Z620", "Overall": "4.0", "Content": "We recently purchased this Camera to replace a Sony Water Proof Model.  I was impressed with the Large Display and the many Different functions available.  Also Purchased the underwater housing for Diving shots and have been impressed with the picture quality both above and bellow the surface.  Not quite sure what all the negative reviews are about perhaps it is not the camera but the person taking the pictures that has the problem.", "Date": "May 19, 2006"}, {"Title": "Great Camera - not for professional photographers", "Author": "Christine Zumpano", "ReviewID": "R23ABR9K0VV1R4", "Overall": "5.0", "Content": "This is the kind of camera you take on vacation - not to a wedding to photograph people dancing. The picture quality is phenomenal and they print great.  My camera did have to be reset out of the box which was just a 10 minute call to Olympus - all the pictures were blurry. Yes, there is no viewfinder, which if you are used to a 35mm camera can be annoying. Most people with digital cameras don't use the viewfinder anyway b/c they are just taking \"fun\" shots. I won't use this camera for an assignment, I will use my film camera where I can change the shutter speed and the aperture.", "Date": "May 1, 2006"}, {"Title": "Great Camera!", "Author": "K. Price", "ReviewID": "R2R5K6CKIW6QWN", "Overall": "5.0", "Content": "So I read A LOT of reviews of many different cameras before I settled of this one (I also looked at: epson, sony, kodak) and I settled on this camera for many reasons:1. size- its big enough to hold securley but small enough to easily carry in my bag, or in a pocket2. for everything it offered it's affordable... other cameras with these features such as picture style and photo album come in cameras in the $400 range3. The camera turns off and on very quickly, just turn on and shoot your pictures right away4. I was looking for good picture quality but didnt want to spend so much money like you do on sony cameras... the picture qualities are great, you can choose your setting depending on what your shooting, outside, inside, under-water, shooting something infront of glass, action shoots5. The LCD screen is great, even in highlight6.(and the most selling point of this camera) its water proof! I plan to take this camera with me on vacations and I didnt want to have to worry about sand and water, with this camera you dont!I was concerned with how the camera was going to do with pictures in the dark because I had heard bad reviews.... SOO wrong the camera in just as amazing in the dark and in the light.To sum it up this is a perfect camera for anyone who is looking to take good pictures without much fuss.... great buy!!!", "Date": "January 28, 2006"}, {"Title": "Nice camera!", "Author": "Lee C. Hee", "ReviewID": "R5C14VJ5IXE01", "Overall": "4.0", "Content": "I just bought this and this is a really nice camera. big screen to see what your getting and its really light! Picture quality is great and getting a 6MP camera for 300 dollars is a nice deal.I gave this a four because it uses the xD picture card, which is pretty hard to find and overpriced than SD cards usually. Also had a few difficult times with the free memory card deal and the 10 dollar drop right after I bought it!Great customer service and great prices. I love amazon!", "Date": "October 5, 2005"}, {"Title": "Olympus Stylus 600 Really Can Show You Some Style!!!", "Author": "Roy Chan", "ReviewID": "R31FM1025HOIZH", "Overall": "5.0", "Content": "Pros: Price, Image Quality, Compact, Sturdy, Weather-proof, Large LCD, Easy to use, Fast, Features, User friendly, Fast Shutter, Clear pictures, No frills, 5\" LCD, Good Flash at nights, Captures nice outdoor images, and Rechargeable Battery.....what more can you ask???Cons: No Viewfinder,  No sound with movies, Uses expensive xD cards, fixed aperture, blurry cornersSummary: I purchased this about a month ago from Costco and it came with a 64 mb reader card. This is only my second digital camera and I don't know much about them but for someone who is use to a traditional point and shoot 35 mm camera this seems to be a great way to go.I was very impressed with the shutter speed, the fact that the photos are so clear and bright and ease of use. I like that there is NOT a view finder (only the nice large screen) which is really all you need with digital in my opinion. Also the screen is very clear in any lighting condition. Unlike my old HP camera where it was a struggle to even see what you were shooting on the screen in the sunlight. It has Bright Capture Technology which means it takes great photos in the dark and it is true. It has great shooting modes that are easy to figure out thanks to the user friendly on screen notes & icons. For example, there is one for documents which works great. Before this camera I never even knew there was such a thing. There is also one for sports/action photos.I am still trying to learn what I can do with the fun software. Its very easy to load on the computer and retrieve your pictures, but I have a lot to learn and not much free time. There is always the option of just taking the xd card in to a store and printing from it as well (which I haven't done yet just to show you what a novice I am). As far as the cards being pricey I am not sure why that would be an issue since you can copy your pics from it and start fresh with the same card over and over. The battery seems to last a VERY long time and is fully rechargeable which is a huge plus since my last camera did not use rechargeable batteries and burned them up extremely fast. It got to the point where I stopped using my old HP digital camera because the batteries cost so much and it was cheaper to buy a disposable camera and order a disc with it.Like I said, I am only a novice when it comes to digital cameras but so far this seems to be an excellent buy for someone like myself. Also, Costco told me when I bought it that if I tried it and didn't like it I could return it for a full refund. How could you go wrong with an offer like that? Go for it! And Enjoy!", "Date": "December 21, 2005"}, {"Title": "Silver Casing Defective", "Author": "TDPM", "ReviewID": "R1R1X7AVMXDUO3", "Overall": "1.0", "Content": "There is a manufactoring defect with the casing on this camera... the silver material is very breakable. After a couple months of owning this item the battery comparement latch broke off so now I have to hold it closed. The same exact thing happened to me with a similarly designed earlier model (Stylus 300). The design structure of this series is very poor.I have written a letter to the company but they have not acknowledged the problem. I am very disappointed with this camera and do not plan to buy Olympus again.", "Date": "October 14, 2006"}, {"Title": "Excellent Camera for the Casual Outdoor Photographer", "Author": "Marilyn B. Heidelman", "ReviewID": "R2NH09MC5M8U37", "Overall": "5.0", "Content": "I purchased this camera almost specifically for its \"All-Weather Design.\"  I later took it on a week-long canoe trip in the Canadian wilderness.  No matter how well I packed it, the camera still got wet.  Thankfully, it still works perfectly.  I was able to snap well over a hundred beautiful and stunning shots of outdoor scenery with it.  I took all of those pics WITHOUT HAVING TO CHANGE/CHARGE THE BATTERY!  The Lithium-Ion battery it comes with is simply amazing.  A lot of people seem to complain about the lack of a viewfinder, lack of sound for movies, and constantly blurry pictures.  Those are all valid arguments, but anyone should be able to overcome these \"problems\" with common sense.  Blurry pictures?  Try keeping the flash on to automatically increase shutter speed.  It worked every time for me.  With excellent image quality, excellent durability, and tons of bonuses (Macros Mode for Close-Up Shots, Weather-Resistant Design), the Stylus 600 is the perfect camera for anyone who wants to snap a few photos here and there, slip it in their pocket and not worry about the rain destroying it.", "Date": "July 25, 2006"}, {"Title": "Very disappointed", "Author": "William", "ReviewID": "R3F0XZGZIUD6QR", "Overall": "2.0", "Content": "My previous digital camera had a view finder which is important on bright sunny days.  I thought I could handle the transition to this new Olympus 6MP (despite its lack of viewfinder) because of the large LCD screen it offered.  However, you really do need a view finder as this camera does not take sharp photos.  Any slight movement from your hand and the photo is stuffed. Whereas, a view finder allows you to steady the camera against your face.As another reviewer pointed out, the photos often look washed-out or dark at the same time.  I have not taken one single photo yet with this Olympus that I am truly proud of. And don't get me started on the nightime shots (urgh!).Admittingly, the camera has some strong selling points such as the full metal body, weatherproof feature, large LCD screen and free battery charger.  But at the end of the day, these features are not what is important. What is important is a camera which takes good snaphots and has the one basic feature that every camera should have: a view finder.Interesting to note that Olympus seem to be returning to including view finders on their upcoming models.  Perhaps they have read the bad reviews on Amazon?", "Date": "April 7, 2006"}, {"Title": "Great digital camera", "Author": "KC", "ReviewID": "R39EED9BTFQ7TI", "Overall": "5.0", "Content": "I'm still learning how to use all the features and am new to digital but this camera takes outstanding photos that get raves from family/friends.  Can do very arty shots, freeze action, sequence action, the works.  Large view screen to review photos and set up shots. Very satisfied and highly recommend it.", "Date": "March 26, 2006"}, {"Title": "This is a terrible camera", "Author": "Aopisa \"A Professional Photographer\"", "ReviewID": "R31UCVPSLRPAWX", "Overall": "1.0", "Content": "What a disappointmet! This camera takes awful pictures. Even on the highest image setting the pictures are grainy. My wife has a 4 megapixel Pentax and it the pictures are far superior to the 6 megapixel that Olympus claims for this camera. I like to shoot without the flash in available light. The slightest movement by your subject creates blur. Even if your subject doesn't move there is invariable movement of the camera when your finger presses the shutter. And since ther is no viewfinder (another big drawack) you can't steady the camera against your face. I'm tired of telling my kid's. \"don't move, don't breathe!\" This is a digital camera, but I feel like I'm taking a photo with an old civil war era tin-type camera and getting worse results in the process. There are about 5 or 6 other things that I don't like about htis camera, but I'll just stop with the fact that the picture quality is not good and that's why we buy these things in the first place.", "Date": "December 29, 2005"}, {"Title": "Great product", "Author": "Socrates \"Only those who think are alive, but...", "ReviewID": "R1UGG54430LDLM", "Overall": "5.0", "Content": "We bought this camera to replace our older olympus camedia 3.2 MP.  It is a great little camera with a big view screen.  It is wonderful for people who take snapshots and have neither experience nor time to deal with a lot of functions and controls.  That notwithstanding, the camera has a lot of useful scene modes to choose from once you get comfortable with it.Some people have complained about the lack of a viewfinder, especially in low light conditions.  Although there is some merit to that complaint, a viewfinder is of little help with auto-focus point-and-shoot cameras under those conditions.  I have found that if it is dark I can get the camera to focus correctly by setting the flash to red-eye control.  The first flash allows the camera to focus on something and take a sharp picture (most of the time).The only thing I don't like too much is the software that comes with the camera. The old Camedia Master was far more intuitive and less cumbersome to use.  This is a minor problem considering how many quality shareware and freeware programs are available for photo editing.", "Date": "March 22, 2006"}, {"Title": "Great Camera", "Author": "Lady M. \"Book Fan/Computer User/Gamer\"", "ReviewID": "RBPK9IILBB18R", "Overall": "5.0", "Content": "I bought this as a gift for my sister and she loves it. I was surprised by the LCD viewer as it is very clear. She has been snapping pictures left and right with it and they come out looking great. If you want a great all around camera for taking photo's where ever and when ever this camera is wonderful. The help menu is very easy as is hooking up the camera to your computer and loading up the pictures to your existing software. It is easy and is not time consuming.", "Date": "January 31, 2006"}, {"Title": "Complete disappointment", "Author": "Mel Irizarry", "ReviewID": "R4V9AS2O8N47H", "Overall": "2.0", "Content": "After having tremendous results with the Olympus D400 Zoom and C-3030 digital cameras I figured it was a no brainer to move up to the Olympus Stylus 600.  What a mistake.  The pictures were extremely grainey, even in outdoor shots.  When I used photo editing software and compared these shots with those from the C-3030 at 100% size I knew something was wrong with the Stylus 600.  The best pictures were taken in macro mode and they were sharp, but normal shots looked like they were taken on iso 1600 film.  Returned it for the Fuji F-10 which uses the same XD media.  Now that is a nice camera.", "Date": "December 29, 2005"}, {"Title": "Good little camera", "Author": "Concerned One \"Thrashfan\"", "ReviewID": "RTO1DRU2FFX6P", "Overall": "5.0", "Content": "Compact so it fits in you pocket, high tech enough to dance with it's bigger counterparts. This little camera does it all. I comparison shopped for several weeks comparing and contrasting multiple cameras from cannon, kodak, hp, sony, panasonic, and olympus, and none had features like this, a small size, and in this price range. The only disadvantage below the stylus 710 and 810 is the megapixel count and no image stabilization.6 megapixels,  2.5 inch lcd viewing screen, and a low price for what you get. OH, DID I MENTION EXCELLENT PICTURES. I have played with this before for several days editing the photos, playing with the on-board and the computer imaging package, and I see nothing wrong with this camera for an everyday average user like me. And with it's weather resistence, nice for a clumsy average user like me. Also the battery life is very adequate, about 120 photos or more, with slide shows, editing ect... This is well worth the investment, saving your families memories in a fit and proper manner.So if you feel you don't need more megapixels, go ahead and get this camera for the less money, but the major difference from a 710 or an 810 is the digital image stabilization. Check out the new 740's 750's and 760's also.Also, the Olympus Mastersoftware is very easy to use, And with panoramic feature, 3d, and Extra ART Features unlocked by Olympus Brand-Olympus Stamped Type H HD, this camera becomes even more of a pleasure to own. you can edit photos on the computer, or right in the palm of your hand. Both ways, this camera will make you feel like a pro in no time.", "Date": "February 10, 2007"}, {"Title": "It is GREAT.", "Author": "A. Stoyanov", "ReviewID": "R2KUBWCTCB2D2B", "Overall": "5.0", "Content": "I have purchased that refurbished camera and I have found it is a Great deal. It works perfect and it is exactly I was looking for. Thanks!!!!!!!!!!", "Date": "January 4, 2007"}, {"Title": "Great camera, large screen,rechargeable battery", "Author": "D. Minerd", "ReviewID": "R37ONFRU8GA0C3", "Overall": "5.0", "Content": "I liked the size and features of this camera. I especially liked the fact that the battery is rechargeable, as we have had other cameras that quickly go through AA batteries. This camera has a large screen, is user friendly, and fairly sturdy.  A cover conceals and protects the cable ports.", "Date": "September 3, 2006"}, {"Title": "great camera", "Author": "Soumitra Roy", "ReviewID": "R1ZFH3CQKY2E3D", "Overall": "5.0", "Content": "my first digital camera. i wanted something more than 4mp and clear pictures at night. My friends Sony was awful at night pictures so i definitely did not want a sony.  So far the camera is easy to handle and the pictures are excellent.Good enough for me. You definitely need the 512k card.  The transfer s/w to pc is easy to use.Would recommend this camera to anyone.", "Date": "January 28, 2006"}, {"Title": "Great Pics!  Small, easy, bright.", "Author": "Richard Kinder \"Ricky Rocket\"", "ReviewID": "R29C3KH950OGOZ", "Overall": "5.0", "Content": "I bought this camera for my wife.  It's perfect.  Big display, easy to use but, you can get fancy if you want.  I don't know about previous grainy problems. Must have been a fluke.  Don't think they set it wrong, camera is too easy to use.  Mine is sharp as I need.  I Print using the Epson Picturemate, awesome! Way better than local 1 hour.  The Camera can touch up and print direct to the printer or the picture mate can treat the camera like a disk drive without installing software!!  Wife loves the simplicity.  She is sharp, just not into fancy electronics. She just want pictures without reading the manual every time.  This camera was the perfect choice.", "Date": "January 19, 2006"}, {"Title": "Worst camera ever", "Author": "Maggie \"Maggie\"", "ReviewID": "RJVR5OJZ76IFC", "Overall": "1.0", "Content": "I've had this camera for awhile and I hate it. I paid way to much for it. It's so frustrating having to set the settings for every scene and none work, indoor, outdoor, sun through window, sun outside, night is the worst. Younspent most of the time trying to set the right option that you miss the shot. Definitely not a point and shoot.  Most pictures turn out like crap.Very disappointing. Don't buy this garbage.", "Date": "June 22, 2013"}, {"Title": "A great basic camera", "Author": "N. Smith \"verified vino votary\"", "ReviewID": "R1ZT4K1CG2XDSO", "Overall": "5.0", "Content": "While I'm not particularly knowledgeable about cameras, this Stylus 600 has worked very well for me for a number of years now and provides all the resolution and image quality I've ever required of a camera.  One area where it performs particularly well is in battery life; the battery has yet to die on me.  One small niggle is the lack of sound when recording video.", "Date": "August 23, 2012"}, {"Title": "Great little camera", "Author": "Kiera Kittie", "ReviewID": "R1XL0B1MJXCZ2C", "Overall": "4.0", "Content": "I have had this camera for about 3 or 4 years now, it has outlasted many Geocaching adventures, being dropped and rain. It still works perfectly to this day. I am only replacing it due to the many new features the new Olympus Tough's have. Overall if you are seeking a decent little camera and nothing fancy I would highly recommend it.", "Date": "May 16, 2012"}, {"Title": "olympus stylus 600", "Author": "ratherbekomping \"ratherbekomping\"", "ReviewID": "RLUOE37QIY6WP", "Overall": "4.0", "Content": "Good camera, but Olympus doesn't make it anymore.  Bought this camera to replace my other Stylus 600 because I had all the accessories for it.", "Date": "May 27, 2008"}, {"Title": "Great buy.", "Author": "G. Griffin", "ReviewID": "RXP7LAX56W56I", "Overall": "4.0", "Content": "I purchased two of these for my kids, one is a snowboard instructor in Tahoe and the other married and playing on the east coast. My son puts this thing to the test and it shines, they both love their cameras. I wanted a somewhat weather resistant camera because of their lifestyles and the large screen and the feel of the camera sold me. The price was a plus. The only downside is no sound. Oh well I usually purchase & shop hard and purchase with a plan and I got more than I expected. Right product for my needs. Oh and you should see fresh powder from 11000 ft!!!!", "Date": "July 28, 2007"}, {"Title": "cat", "Author": "Mary J. Gardner", "ReviewID": "R11EJ0P33XL4NY", "Overall": "5.0", "Content": "I am very happy with my first new camera. I am glad I choose Olympus camera is whit I picked. Thank you Mary", "Date": "March 14, 2006"}, {"Title": "Worst camera ever", "Author": "R. Hirst \"2rummageAmazon\"", "ReviewID": "R2HGUQF2RNSHFL", "Overall": "1.0", "Content": "After owning a Olympus 2020 2Mpixel for 4 years I expected a slightly better Olympus with the Stylus 600. Use my digital cameras for auctions, many personal indoor/outdoor portrait photos and many landscape and scenic photos. Maybe there is something wrong with my 600 but I've tried for 3 months to get good photos and only a few are good. The 2020 took great photos, perfect color and light, great balance throughout and minimal red eye. Almost every 600 photo has big problems - whether blurriness or major red-eye or wierd lighting balance or lack of saturation, etc. I give up and will call Olympus tomorw to return this awful camera. I've tried almost all the 25 modes to get a few that work for me and it's very difficult. NOT a good point and shoot and NOT a good camera even after selecting the supposedly ideal mode.", "Date": "May 14, 2006"}, {"Title": "The Olympus stylus 600, and its screen", "Author": "Kirk C. Pestlin", "ReviewID": "RATZHOV1U18I7", "Overall": "5.0", "Content": "The screen on this camera is amazing.  It displays the photos with extreme clarity, and in bright colors.  I really recommend it!", "Date": "March 2, 2006"}, {"Title": "How to kill the joy of taking pictures", "Author": "Lauragais \"circle-h\"", "ReviewID": "R3V3IZ4QOIJIRO", "Overall": "1.0", "Content": "I've been taking pictures ever since I was 8 years old and that is exactly 62 years ago. The worst camera I ever possessed is the Olympus 600 which was given to me as a gift. I find the camera difficult to use because it has no view finder. One might say that this is my fault, I should have chosen one with a view finder, but the problem is that the camera cannot be steadied and the even most minute movement (such as pressing the button to take the picture) will result in very blurred pictures. This was never the case when I make photographs with my earliest cameras when the concept of digital had not even appeared at the horizon.I find the menus cumbersome, not user-friendly, resisting intuitive use, based on decades of experience and good work with other cameras, digital (Olympus 300!) or before digital, such as several Canon and Leica cameras. Even if set on automatic the pictures are blurred (and do not yet have shaky hands)and the colors are atrocious. I don't ever want to have another camera without a view finder and a clearly structured menu.", "Date": "June 24, 2011"}, {"Title": "Wonderful", "Author": "B", "ReviewID": "R1ILXJI1GDHQQI", "Overall": "5.0", "Content": "I bought this camera awhile back, and have soon realized that this camera is great. It is in perfect condition of when I first bought it! It has never let me down.", "Date": "April 6, 2007"}, {"Title": "one \"but\"", "Author": "Daria \"Daria\"", "ReviewID": "R2DEF0B4LGKTG0", "Overall": "3.0", "Content": "I bought Olympus Stylus 600 not so long ago... i was really amazed by the huge screen!!! BUT I was really dissapointed by recording a movie... I doesn't have sound.... :(", "Date": "October 28, 2005"}, {"Title": "Big Disappointment", "Author": "Sheila Oliver \"netshopper\"", "ReviewID": "R1W8J263Q18YX5", "Overall": "3.0", "Content": "This camera was a gift from my husband and since this was our first digital purchase we researched for the complete camera, we missed one thing, movie with sound.  With kids, I wanted to capture movies with sound, what a big disappointment - I will sell it and purchase the Stylus 800 (it's big, but it will give me sound for movies).", "Date": "December 29, 2005"}, {"Title": "cases?", "Author": null, "ReviewID": "RL9NC1UKHBC9R", "Overall": "4.0", "Content": "I bought this camera and i was wondering if there were any cases. anyways, the camera is great but the underwater settings are useless unless you get the underwater case.", "Date": "October 23, 2005"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B000A7B9XK"}}