{"Reviews": [{"Title": "Nice, easy to use camera!", "Author": "Becca", "ReviewID": "R1QF69NK9CHT0C", "Overall": "5.0", "Content": "I previously owned a Canon Powershot A100, and I am so much happier with the HP Photosmart M517! This camera is ideal for novice photographers and experts alike! The user's manual is very easy to follow and understand, and the camera functions are extremely simple to use. I am very pleased with the picture quality, and had gorgeous pictures even on the very lowest image quality settings! This camera is worth every penny I paid for it, and I'd highly recommend it! It's definitely a superb quality camera!", "Date": "September 22, 2005"}, {"Title": "Great, clear  photos and print me some NOW !", "Author": "Deanna Freehauf \"lovethelake\"", "ReviewID": "R3HYSE9ZNLMZE9", "Overall": "5.0", "Content": "I am a Grandma and not very adept at figuring out new fangled cameras expecially with printers.  The printer is VERY easy to use and it's been nice when grandkids and friends come to our vacation house-we take many pictures and can send relatives and friends home with as many photos as they want.  No going to the store to get them developed! A wonderful advantage to this camera/printer set! The printer has an included electric cord, or you can purchase a battery to run the printer without electricity.  This camera takes several different quality photos depending what you set the \"MPs\" at.  Even I learned how to set the MPs! The greater the \"MPs,\" the clearer resolution of your photo.  This model M517 goes from 3MPs to 5.2MPs, but I found that the lower MPs take VERY acceptable quality pictures.  The higher the MPs, the less pictures your camera memory will hold before you'll need to delete some if you want to take more photos.  So I purchased a 1GB memory card that can store several HUNDRED photos even on the clearest resolution.  This is wonderful for vacations, weddings, etc.!  It is very easy to delete \"red eyes\" in your photos before printing them and you can also \"crop\" the photos if you want a closer-up photo.  The only \"con\" I have is that the rechargeable batteries do not last long-a few days depending on how often you have the camera on.  The camera batteries are recharged when you \"dock\" (set the)the camera on the printer.  I purchased a 4 pack of NiMH rechargeable batteries so I could always have spares on hand.  The recharger charges the camera batteries in ONE HOUR.  Charging batteries when the camera is docked on the printer takes several hours to do.  The whole package has what you need to start taking pictures immediately-even ink and photo paper.  Cables to connect to a computer and to a TV to view photos are all included. All in all, this Grandma is VERY satisfied with my new Photo Studio!", "Date": "November 9, 2006"}, {"Title": "A great camera", "Author": "Andre R. Cavalcanti \"A.R.C.\"", "ReviewID": "R1JR1ZITMKCDOC", "Overall": "5.0", "Content": "I got this camera a few days ago and I must say that I am very, very satisfied. The price is great for a 5 megapixel, it is easy to use, very user-friendly. Its size is perfect: very small. The 2\" screen is wonderful and the pictures this camera takes are surprisingly good. It comes with an internal 32 Mb memory, but I got a 1 Gb SD memory card. This memory card can store 618 pictures(5 megapixel) and more than 300 pictures at 5 megapixel best mode. It also comes with a rechargeable NiMH battery and an AC adapter to recharge it. I think HP should also include in the whole package a case for the camera, once there is none in the box. Finally, I am not sorry at all for having bought it...", "Date": "December 14, 2005"}, {"Title": "My first digital camera - very pleased.", "Author": "Bill", "ReviewID": "RUW6PYS3VBIQF", "Overall": "4.0", "Content": "Easy to use and takes great pictures.  You can edit on the printer or use a PC and the included HP Image Zone software for more advanced editing.  Camera has all the features a casual user would need plus a few I'll probably never use.  Printer produces excellent quality 4 x 6 prints.  Printer is small enough to take on trips so you can have prints immediately.  Can also show pictures and videos on a TV.Wrist strap was missing from the box but HP had one delivered 3 days after I called Customer Support.  I'd give this 5 stars were it not for battery problems.  The rechargeable NiMH 'AA' batteries included will not hold a charge.  They're rated for 150 shots but discharge within a day.  I'm going to replace them with non-rechargeable lithium batteries, which are rated for 300 shots.Overall an excellent camera and printer.  I recommended it for anyone wanting a digital \"point & shoot\" camera.", "Date": "July 20, 2006"}, {"Title": "Quite a solid performer!", "Author": "Lalita L. Amos \"Helping You Grow Like Nobody'...", "ReviewID": "R1LTHLDX8Y2IY0", "Overall": "4.0", "Content": "I purchased this camera-printer set for my husband about a year ago. It's performed very nicely over the last 8 months. The only thing is that taking close-ups can be a little bit tricky and the battery life seems very short between charges. Otherwise, I would buy it again.", "Date": "September 3, 2006"}, {"Title": "Real Camera for Real People", "Author": "Amazoner", "ReviewID": "RN6D8WYQRLJP2", "Overall": "5.0", "Content": "This camera is best among its class. The LCD displace is so brigh and high resolution. All buttons are very well organized so easy to use. Special flash recycle so fast and strong makes the shooting indoor and dark area an experience. The software menu is so easy to reach. I got SLR Pentax Digital Camera before, but can't tell the difference in picture quality.", "Date": "September 8, 2006"}, {"Title": "Totally impressed", "Author": "Darkmax", "ReviewID": "RGP64ZLWXSN16", "Overall": "5.0", "Content": "I bought this digital camera as my first one for my birthday and I'm sastisfied. The camera's price was 179$ CDN (~ 159$ USD) at The Source by Circuit City. The box included Ni-Mh batteries so, I didn't have to buy them for now. What I didn't like, it's that the camera can't start with my Pure Energy Alkaline Batteries...I bought a 256Mb SD card (19.99$ CDN at the upper shop. ^^) and you can take ~ 155 photos at normal 5 mpx and ~99 while on optimal 5 mpx.I shot, zoomed filmed, etc. around 40 photos and the batteries lost a bit of their energy. (At first, the pointer was on the 1st \"O\" of GOOD and then it went between \"G\" and \"O\")Pros:- Good pictures- Love doing macro pictures :)Cons:- Bad video quality (well, duh! It's not a camera recorder.)- Doesn't take normal alkalines batteriesI never got a digital camera before, but it gives the features I needed.", "Date": "January 22, 2006"}, {"Title": "good for the price", "Author": "M. Merrill \"mel n harley\"", "ReviewID": "R1J4NL9MHR005A", "Overall": "4.0", "Content": "This camera hasn't given me any problems.  Some have complained of low battery life, but that is due to using regular batteries.  I use the rechargeable camera batteries for days at a time without recharging. I am still playing around with the printer, but my first test print was good.", "Date": "November 9, 2006"}, {"Title": "What a disappointment!", "Author": "mia", "ReviewID": "R2R9D1MMZLXPEJ", "Overall": "1.0", "Content": "We got this camera for Christmas, took one shot, and then the camera shut off completely with the lens out.  HP Customer Service was not helpful.  It's an internal problem with the circuitry.  We pay freight for a repair or replacement on a BRAND NEW CAMERA.  And NO PICTURES of Christmas!  We purchased this camera after reading multiple positive reviews.", "Date": "January 3, 2007"}, {"Title": "Wonderful \"bang for the buck\" camera and printer!!", "Author": "SavvyShopperMom", "ReviewID": "R3S8IF1L1Q81RD", "Overall": "5.0", "Content": "I purchased this camera printer combo for my daughter's 16th birthday. The price was unbeatable. The camera has a ton of features, and the pictures are beautiful, and crystal clear. The printer is tiny and portable, great for a teenager, and it hooks up easily to the TV to view/edit/print the photos. She was able to print pictures of her party for her friends to take home with them.Great camera and printer for the price! And Amazon customer service is first rate! Shipping was super, super fast and when I needed help with a rebate for this item, customer service was very efficient and polite. A+!", "Date": "October 11, 2006"}, {"Title": "Nice everyday camera", "Author": "Claude W. Moore \"claude903\"", "ReviewID": "R30H4K2E0Q4ZVC", "Overall": "4.0", "Content": "Only one problem at installation and it was solved quickly with there online messenger service.A very good everyday camera that is compact and quick and easy to use. Features you use a lot like action, red eye flash etc are easy and quick to use. Software for transfering to computer works very well. Can carry it in a shirt pocket and I like the automatic lens cover.", "Date": "November 9, 2006"}, {"Title": "Don't BUY IT!", "Author": "M. Smith", "ReviewID": "RJV1TZ4J1MOUU", "Overall": "1.0", "Content": "I have had so many problems with this camera..and I didn't just own one, after the first one croaked, I bought a second. BAD MISTAKEPlain and simple:  It is too slow,  Doesn't take pictures fast enough (I Often missed my  subject..waiting for it to turn on and take the picture),  Sucks through batteries like nothing I've seenIt's a waist of money and time. Spend a few extra bucks and upgrade to something better..", "Date": "December 26, 2006"}, {"Title": "Love mine", "Author": "Christopher W. Chidester \"Niners Freak\"", "ReviewID": "R3LOS4ZLSKV31R", "Overall": "5.0", "Content": "I have own mine for a few months now and it has been a great investment.  I have noticed a difference in the print quality based on the type of paper I used.  Do not skip on the photo paper, get the high gloss paper for pictures you want to keep, but the anytime paper is still solid for giving away to others.  So far I have been able to print 40 or so pictures on the orginial cartridge HP provided in the kit.  Either way love my camera, love the printer, love the convienence.", "Date": "December 12, 2006"}, {"Title": "good when it actually works", "Author": "Leslie \"Leslie\"", "ReviewID": "R3G4JEULUE7GJL", "Overall": "2.0", "Content": "I've only had this camera 3 months and already I've experienced a million problems with it.  some days the camera won't even turn on, other days it functions beautifully.  I just can't figure it out.  the software is also unreliable.  one moment the camera allows me to upload photos and the next moment it won't.  I don't know if I got a defective one or what, but if you are looking for something more reliable I wouldn't go with this because its performance varies like the weather.", "Date": "December 10, 2006"}, {"Title": "Capture Speed is a little slow.", "Author": "EBVT Buyer", "ReviewID": "RLA146QIABLHE", "Overall": "3.0", "Content": "I purchased this camera for my daughter.  She was looking for a digital that was in the price range of $100.  She has reported that the capture speed is a little slow and is not a good choice to catch an active toddler.  Also the view finder displays are dark and grainy if you do not have a lot of light.  She reports that once the picture is saved the quality is very good but it is difficult to see what she is shooting.  She has also had some problems with the camera 'freezing' which required removing the batteries and reinserting them.  This may be a defect and she is checking with the manufacturer to see if this is something they can fix.  Pictures taken outside are the best quality shots.  On a whole, she is okay with the camera for the price range, she was not expecting it to be a top of the line camera.", "Date": "January 10, 2007"}, {"Title": "Raves for HP", "Author": "Lisa Higgins \"bearloverb4u\"", "ReviewID": "R2CE9N2Y0TSI2Y", "Overall": "4.0", "Content": "I bought this for my mother...she loves it! Its easy for her to use and the screen is large enough for her to view.  The print quality is excellent.  I got more (merchandise and quality) with this HP brand than I would had with any other brand.  The price was excellent too.  Good job Hewlett Packard for making me a \"smart\" person!", "Date": "January 9, 2007"}, {"Title": "Quality Made Simple", "Author": "Ziggy Tzavorite \"DCB\"", "ReviewID": "R16K0Y63BV1PAI", "Overall": "5.0", "Content": "It's exactly what I was looking for.  Easy to use digital camera and printer.  Delivery took longer than I expected, but well worth the wait.", "Date": "November 12, 2006"}, {"Title": "good first level camera", "Author": "Kaustav Mukherjee \"Poketmaar\"", "ReviewID": "R10SDLASXTE09E", "Overall": "3.0", "Content": "Pros: easy to use, nice features, size,powerful flashCons: soft lensgood camera for those amateur ones.very powerful flash makes shooting in the dark (at close ranges)a nice experience. but the lens is a soft one and does not provide the contrast that a canon or a nikon might give, consequently the colors are not up to the mark. good for entry level photographers. overall features are quite nice; user should try to operate manually rather than depending on the auto features---gives better performance that way. but then again, the lens makes you sad and makes you realize that HP after all does not specialize in camera lenses. even the Carl Zweiss of Sony's gives a better contrast.", "Date": "August 3, 2006"}, {"Title": "Batteries NOT included, very slow! *UPDATED 8/14/12)", "Author": "AislinnK", "ReviewID": "RG3R6VAOBTADU", "Overall": "4.0", "Content": "My husband bought this camera for me for Xmas, and it was straight from my Amazon wish list. However, when I got it, it did NOT include rechargable NiMH batteries OR AC adapter. It did have a USB cable to connect to the PC, and I'll see if that will actually charge the batteries we put in it (rechargables w/ a full charge, but told me the batteries were low.) Took several seconds to take the first shot and it had the \"flash charging\" light flashing the whole time. We'll see if it gets better over time, but if not, it's going back.I've had this camera for several months now, and I really love it! It's gotten much faster at taking pictures, and even takes great video. I do still have a problem with the fact it didn't come with any batteries (though I have noticed the description has changed to say \"recharchable NiMH batteries or disposable batteries\") and that the USB cable that goes from the camera to the computer doesn't seen to recharge regular rechargable batteries, but I will say even normal (alkaline) batteries do tend to last a good long while. So I've increased my rating to 4 star to reflect my happiness with this item, but I will NOT give it 5 stars because of the inaccurate product description.", "Date": "December 24, 2011"}, {"Title": "Great Camera", "Author": "R. Schultz", "ReviewID": "R1XMPETB8I3E12", "Overall": "5.0", "Content": "I bought this camera for my wife for Christmas and after I bought it she was talking and said she did not like HP products. Well she opened it on Christmas and said it looked nice. After she took about 40 pictures with it I could not pry it out of her hand with a crowbar.. It takes great pictures and is very easy to work. She even let me take a couple of pictures with it. So it shows you don't have to spend a lot of money to get a great camera. Keep up the great work HP...", "Date": "January 11, 2007"}, {"Title": "Excellent Choice", "Author": "Abel Viteri Mosquera", "ReviewID": "RKE6TJP5OFS9K", "Overall": "4.0", "Content": "An excellent camera.  Easy to use, great quality photos, and very resistent.  If you are going to take it to a trip this is the perfect camera. It only has 2 little problems, 1.-it is a little bigger than the others, 2.- the rechargeable batteries included don't last very long.", "Date": "January 30, 2006"}, {"Title": "Disappointed", "Author": "P. Torres", "ReviewID": "R7POPTBX6ATIP", "Overall": "2.0", "Content": "We have had our camera and printer for one year now. We loved having the sole printer for the camera, but I haven't been too happy with the quality of the pictures from the camera. Also, the printer now no longer works.", "Date": "January 6, 2007"}, {"Title": "Great Point and Shot Camera!", "Author": "Roger Whirley", "ReviewID": "RC4QY25XHDBT5", "Overall": "5.0", "Content": "I've owned one of these before. It's so easy to use with a high quality photo. It may be outdated but I'll purchase another if this one gets damaged like the last one. Roger W. in TN.", "Date": "November 14, 2013"}, {"Title": "had one", "Author": "Cappy", "ReviewID": "R3B3FHS02EBHKB", "Overall": "4.0", "Content": "Not sure about the battery life as yet, had one just like it and couldn't get three pictures without the battery going dead, hopefully this is a little better, but it takes great pictures.", "Date": "September 27, 2013"}, {"Title": "Used and in bad shape", "Author": "ACastro", "ReviewID": "R2W63VTI3I2XYJ", "Overall": "2.0", "Content": "I don't remember reading this item was used.  It was probably written and I didn't see it.  Its my fault if that's the case but even then I'm not satisfied because this camera was not in good shape at all.  Not only it had scratches but some metallic parts were rusty.", "Date": "February 3, 2013"}, {"Title": "Nice camera", "Author": "Rhonda Howell", "ReviewID": "R3VEFQY9ZHJORB", "Overall": "5.0", "Content": "I bought this for my mother and she has been very happy with. The pictures print up with good quality and it is very easy to use.", "Date": "December 28, 2012"}, {"Title": "Awesome Deal!", "Author": "John", "ReviewID": "R2LO8V5KXQQHPJ", "Overall": "5.0", "Content": "This HP Camera is very Nice at an incredible price.I would recommend it to anyone. I received it early, and it works like a charm! Enjoy!", "Date": "September 4, 2012"}, {"Title": "Camera broke only 3 uses!!", "Author": "CKS", "ReviewID": "R10QJ9QI5246GV", "Overall": "1.0", "Content": "Purchased this camera Nov 2006 but never took it out of the box to use until Aug 2007. Used it 3 times and the camera BROKE! HP wants $70 for customer support to talk to me since it has been over a year. What kind of camera breaks after 3 uses?? HP has very poor quality products.", "Date": "December 26, 2007"}, {"Title": "research before you buy", "Author": "T. Wanda", "ReviewID": "RV0CX3ZQ6OHP3", "Overall": "3.0", "Content": "I have this camera and the shutter speed is way too slow for me.  The flash takes forever to charge, especially between shots.  It also eats the AA batteries, especially rechargables.  My next camera will definately be better than this!", "Date": "November 12, 2007"}, {"Title": "Very good for the money", "Author": "T. Kaiserski \"Choral Lover\"", "ReviewID": "R2JLSD6TJMKDMR", "Overall": "4.0", "Content": "I've had the camera for over a year, and taken several thousand pictures with it. It's pretty darn good overall. I've been pleased with the image quality, especially for scenery shots. It does fall somewhat short with portraits of people in many cases, though. Easy to use. Minor durability problems.", "Date": "March 15, 2007"}, {"Title": "Easy to use", "Author": "MommyTo2", "ReviewID": "R1R6WBJ887M9D5", "Overall": "5.0", "Content": "Gave this to the in-laws for Cristmas and they were taking pictures the next time we went to visit. Definitely buy additional memory, the internal memory is really more of a back-up.", "Date": "February 12, 2007"}, {"Title": "A good deal, a fair camera", "Author": "Joecompute", "ReviewID": "R15E6LROYJ230N", "Overall": "3.0", "Content": "I had to have the camera replaced by HP because it never really would stay \"on\" for more than a few shots.  The process was so bad, I'll never by another HP camera.  The printer is the older series, using #95 cortridges, so they are not waterproof.  But it prints just fine.", "Date": "February 12, 2007"}, {"Title": "Nice package", "Author": "C-Man \"John\"", "ReviewID": "R2TQ67OBI948OK", "Overall": "4.0", "Content": "Good camera and photo printer, easy to use. Only thing missing is a multi-card reader. Easy transfer to computer and printing pictures from computer. Good software for most photo editing.", "Date": "February 12, 2007"}, {"Title": "A nice, handy camera", "Author": "Patrick Mcdonough \"P McDonough\"", "ReviewID": "R3AWM11ASDC827", "Overall": "4.0", "Content": "This camera works great.  And the batteries last quite awhile too.  Good quality pictures.  A good deal for the price.", "Date": "February 11, 2007"}, {"Title": "Great Camera", "Author": "Jeff Butts", "ReviewID": "R2AS1BUTHVZ9MQ", "Overall": "4.0", "Content": "I received one as a gift from a friend and really like the camera.  I have used it only a few times and then I bought an SLR Digital Camera.The photos I took with this camera turned out great.", "Date": "January 3, 2007"}, {"Title": "best for close shots", "Author": "Navdeep Dheri", "ReviewID": "R15HSQDN56BHXY", "Overall": "5.0", "Content": "i bought this camera along with photo printer for only 99 dollars after rebate. it delivers great quality and very easy to use. it takes secure digital cards which are very cheap. i recommend this camera to everyone, especially the new users.", "Date": "November 9, 2006"}, {"Title": "Very good entry point for digital novices", "Author": "Roselli Marcello", "ReviewID": "R14LKXDJCZ7O6A", "Overall": "5.0", "Content": "As an amateur photographer taking pictures for more than 25 years with a reflex Minolta XG2 I was looking for a camera `to make a leap in the digital'.I started browsing around and, as I got acquainted with the features of these small new devices, I started being attracted by the M517 because of:· the high resolution (5.2MP is not still an entry level for such a device)· the wide (2 inches) LCD display for setting the camera and managing the pictures· an optical zoom (a fair 3x)· an internal memory (32MB)· support for download and management of pictures and videos (the camera comes with a USB 2 cable that connects camera and computer and with a very well crafted software (HP Image Zone) to download, edit, organize, print and share images and videos (15 320x240 fps))· the recent availableness (May 2005, at least in Europe)· last but not the least, the bargain I could make from a big retail chain in my country (euro 199 for the camera, a Dikom 256MB SD 60x Memory Card, a SimpleTech Bonzai USB 2.0 Flash Drive Memory Adapter, a HAMA Track Pack Compact 2).Coming from a heavy camera it took me some time to become accustomed to the light weight of the M517 first of all not to move it while shooting.The only disadvantage I've found yet are the 2 AA-size NiMH batteries included that are just enough for a not-intensive-two-day use and then you have to recharge them. Sometimes I switch the display off to spare energy and use the optical viewfinder that, not being a reflex, doesn't show you the picture you'll eventually get. In the next future I'll buy at least another couple of rechargeable or lithium batteries.People using old reflex cameras have to become accustomed to the shutter delay (default 0.85 sec) that captures not exactly what you wanted when you shot.My next camera, in the years to come, will be definitely a digital reflex but for the time being I enjoy my M517. It's a very good camera so let it a chance.", "Date": "July 20, 2005"}, {"Title": "A lightweight piece of JUNK", "Author": "Sonya Mcelreath Ball \"sonyamcb\"", "ReviewID": "R1J4B79L5FTA8V", "Overall": "1.0", "Content": "I could not believe the glowing reviews that I found about this camera.  I am not a professional photographer but have been an avid photographer as a hobby since I was a kid.  I own another digital camera and received this one as a gift.  Thank GOODNESS I did not waste my own money on this piece of junk.Here are my main issues with the HP:1. The LCD screen sometimes goes black after taking a picture.  Nothing will bring it back without powering it down and bringing it back up.2. The pictures are NOT crystal clear.  They are clear enough, but they lack that sharp, focused look of my other digital camera.3. There is a TREMENDOUS lag time between when you \"take\" the picture and when the camera actually flashes and takes the picture.  I suppose if you're photographing a lot of adults or still objects, this is not a big issue.  I, however, spend most of my time these days photographing my kids.  I have missed MANY great shots because the picture you take and the picture the camera catches is NOT the same picture!  I know that some will argue that this is true of all digital cameras, and let me assure you that it is NOT.  My other camera has some lag, but I get reasonably close to the picture I wanted...if not the exact one.  This is my biggest complaint with this camera.4. My camera drains the batteries so quickly!  Friends of mine have this camera also (they also complain about #3), and theirs don't seem to do this.  I have tried various batteries without different results.  I can sometimes only take 6 or so pics before needing new batteries.  And this IS with the Ni rechargeables.I called HP to see what could be done about the tech issues, and ~SURPRISE~ my warranty expired a couple of weeks ago.  I will not spend my money on an HP camera EVER and would highly recommend that you put your own money into another camera, too.  There are more reliable cameras of better quality (and some for less money!) out there.  BUY SOMETHING ELSE!", "Date": "May 28, 2007"}, {"Title": "Adequate Camera", "Author": "LuckyGrrl \"LuckyGrrl\"", "ReviewID": "R1PAA9MKQQHXL4", "Overall": "3.0", "Content": "I like the camera and the ease of use; however, when I registered the camera on HP's website, a bunch of garbage got downloaded into my computer and I've been dealing with the aftermath for quite sometime.  I never had problems with my computer until I used this camera.  Nice camera, but beware of problems migrating to your computer.", "Date": "February 24, 2006"}, {"Title": "a gift", "Author": "Amazon Customer \"Avid Reader\"", "ReviewID": "R3LASYY51K3P7Q", "Overall": "4.0", "Content": "My husband got this for me as a present and I love it.  Easy to use.", "Date": "January 11, 2007"}, {"Title": "HP Photosmart M517 5MP Digital Camera with 3x Optical Zoom", "Author": "Maritza E. Molina Lima", "ReviewID": "RZE63JQLVMUVN", "Overall": "5.0", "Content": "This camera takes photos with much clearness.  I am very satisfied with it to have bought", "Date": "February 20, 2006"}, {"Title": "Too big", "Author": "T. Harris", "ReviewID": "R1SNRIDJTLPP6P", "Overall": "3.0", "Content": "I bought 2 of this type of camera for my uncle and mother. It was huge when I first opened the box. I would have rathered one a little more sleek. As far as the other options I have no idea for Ive never used it, but the size I can definitely comment on, its not a pocket or purse camera.", "Date": "January 11, 2007"}, {"Title": "I cancelled this order!!", "Author": "Birdman", "ReviewID": "R2NEJJFBCMB93X", "Overall": "4.0", "Content": "I canceled this order because shipment wasn't going to arrive in time for christmas.", "Date": "January 11, 2007"}], "ProductInfo": {"Price": "Unavailable", "Features": "5.2-megapixel digital camera captures enough detail for photo-quality 13 x 17-inch prints\nPhotosmart 420 photo printer makes borderless prints up to 4 x 6 inches\nDigital camera features 2.0-inch LCD display; edit photos in camera--no PC needed\nCamera powered by two AA-size batteries; printer charges batteries when camera is docked\n32 MB internal memory in camera; stores images on SD cards", "Name": "HP Photosmart 428 GoGo Photo Studio (M517 5MP Digital Camera with 3x Optical Zoom & Photosmart 420 4x6 Photo Printer)", "ImgURL": "http://ecx.images-amazon.com/images/I/51EBJA2TV3L._SX300_.jpg", "ProductID": "B000A5L4YG"}}