{"Reviews": [{"Title": "An unfair comparison (my other camera is a Hasselblad 501c)", "Author": "Donal B. Botkin \"View[ + ]Finder\"", "ReviewID": "R1NJ1J4M2NS2GY", "Overall": "5.0", "Content": "Many other users and serious reviewers have provided sufficient background on Sony's \"top of the line\" digital DSC-R1, so I'll steer clear of needless repetition and get right to my point: this is not just a great digital camera, it's a great camera by any standard.  {credibility break, sorry} My background? 2,500 pictures in the R1, about the same in a Minolta A1 and another 3,000 or so in an older Sony (I forgot the model--it had a rotating lens) that spent 5 years on a boat with me in the South Pacific.  Before that, over 40 years of serious photography with everything from pinhole cameras to the Hassey.Here's the bottom line: the R1 is about the size of the 501c but less than half the weight with just the 'standard' lens.  If I include all the extra lenses (I use a wide-angle and a moderate tele) plus the spare backs and film, the bag tips the scales at over 25lbs.  Are the pictures as good?  (trick question) Technically, no; there will be no razor sharp poster-sized prints from the R1.  The truth is that many of the really great shots with the Hassey are still in my head: too much fussing with lenses, changing film, worrying about exposure and poof! The shot is gone.  Of the thousands of digital images I've captured, there are many that would match the best from the medium format in terms of qualities that matter to me.What's the best feature of the R1?  Coming from the 501c, I really like the top-mounted LCD!  It is much easier to use than even a tilting, back-mounted LCD (like the Minolta A1), particularly for candid shots.  Plus when it's vertical, it's like a \"sports\" finder in that you can easily see both what's in the picture and what's not.  Second best is the lens: I checked the Carl Zeiss site for info on their lens designs to compare to the 501c, but they haven't posted the specifics of the Vario-Sonnar in the R1.  There are a few very good testing-oriented site on the `net that have uniformly lauded the lens design.  As might be imagined, (or maybe not, judging from some uninformed whining about \"features\" elsewhere) designing and building lenses is not easy. To get a zoom lens that goes from 24mm to 120mm with a flat field and good color performance is nearly impossible, hence the almost unnoticeable barrel distortion at the wide end.My third favorite feature is the CMOS sensor: it truly makes a difference in the quality of the mega-pixels not just the fact that there are over 10 million of them.What's not to like?  Well, several users have commented on the lack of interchangeable lenses, true, but to what end?  To get a higher quality lens?  Not likely.  A larger aperture? Yes, you can, but not in a zoom.  To get a really long telephoto or mirror lens?  The only valid complaint, IMHO.  So, there is the option of the 1.7 tele-extender that get's you something between 200mm and 400mm depending on how aggressively you manage the digital smart zoom feature.  (Don't even think of complaining about the \"extra\" lens!  This is about the lack of replacement lenses, remember.)  I have one on order, so I'll save my comments for later.There has been a lot of carping about the \"noise\" at high ISO (1600 and above) and it is true: if you try to hand-hold when you should use a tripod and fudge the ISO to overcome the shake, you will get noise.  Mount your R1 on a tripod and shoot at 160 and the problem goes away because the built-in noise reduction kicks in.  Even is you must shoot at higher speeds, using a tripod and setting exposure to take advantage of the noise-reduction program will make a big difference, from my informal testing.  Photography is all about working with limitations, so consider it an advantage to own such an imperfect camera!The only thing that I've found less than desirable is a compression of dynamic range when shooting Adobe RGB.  It shows up as a right-skewed histogram, but post-processing in Aperture fixes it.  The image is \"muddy\" but clears when the white slider is moved to the left in setting luminance.  This could be due to several factors, so I'll do some testing and report back.My summary is that this camera will not make you a better photographer, but taking lots of pictures and not showing the bad ones will help, and believe me, you will be able to take them with greater ease and enjoyment with the Sony DSC-R1 than with anything else on the market for the same price.  If your excuse for not taking pictures is that there is either too much equipment or not enough, this one my dear Goldilocks, is \"just right\".", "Date": "January 24, 2006"}, {"Title": "First Glance from an Early Adopter", "Author": "Chris Rutkowski", "ReviewID": "R2T75P8TVOW19O", "Overall": "5.0", "Content": "Got my Sony R1 just yesterday - ordered from Ritz on Tuesday and had it 48 hours later. Spent 6 hours \"playing\" with it and making a few test shots. Overall: love It - hence 5 stars.The downside: oh how I wish the EVF provided about 5 times the resolution so that critical focusing (manual) was possible. And I could live without its herky-jerky display. But that pretty well wraps up what I don't like!The few natural light indoor test pictures I made were beautiful; at ASA 400 (which I used used for this limited micro-test) resolution and color rendition were superb. Think I'm going to love this sharp, fast lens. That extra few mm at the wide angle end of the range means a lot too; \"big sky\", \"indoor\" and \"close groups\" will be a LOT easier to manage - and the 10MP image will take advantage of it by holding detail (those who say \"MP doesn't matter\" haven't thought it all the way through - as the angles grow wider it means a LOT).Camera handling is great. Feels like a good SLR. This is certainly no heavier or bulky than my old Canon F1 - lighter in fact. The R1 exudes quality. Just plain feels good in the hand.The controls and settings were mostly simple to figure out. What took me longest to discover was how to access playback mode - the button is unlabeled - actually had to look on the little \"read me first\" cheatsheet included in the box : -) Otherwise, I found myself able to \"sync\" with the designer's logic quite easily - everything I need for creative control is right there. I'm quite sure that with just a little practice, things like manual bracketing, selecting ISO, shutter speed etc. will be very fast in the field - I don't forsee much fumbling. Big plus!I especially like the external LCD viewfinder. With the screen lying flat on top the camera becomes reminiscent of a medium format camera like a Yashica 2-1/4 or a mini RB67. I LIKE those machines and the R1 fills that part of my \"does it all\" wish list better than I expected. The R1 is even quite usable when held straight overhead by the simple expedient of holding it upside down. Not as easy to manipulate setting controls in this position of course, but that's both understandable and quite acceptable.Shooting response speed was fine. Apparrently it's not able to take extended bursts of shots at several frames per second - bang, bang, bang, bang.... but I couldn't care less. I don't do that kind of photography. Guess it would be an issue if I were into sports photography (or weddings, which are a sport of a different kind) - anywhere one wants to shoot a huge number of shots and sift through them later for the perfect shot. But that's not my cup of tea.Bottom line: the ability to feel like both a good SLR OR a medium format camera makes this, for me, a smash hit. I look forward to wringing the most out of technical capability - at least until a 20MB version with a hi-res viewfinder comes out a few years down the road.", "Date": "November 18, 2005"}, {"Title": "Spectacular camera", "Author": "Craig Siegman", "ReviewID": "R2VLM46EC84DMN", "Overall": "5.0", "Content": "Got my Sony DSC-R1 on Saturday, Nov. 19.  I expected to order it from Amazon, but I was in the mall shopping and found that a local retailer had it for $948.88, so I bought it immediately.  It took a couple of hours of play to figure out the controls.  As mentioned in the review below, the toughest control to find was for playback (hint: it's the button with the blue arrow to the right of the viewfinder perfectly blended into the viewfinder's facia so it's hard to see).  The value of the electronic view finder becomes evident when trying to compose a picture in tough lighting conditions.  Seeing the image change in the viewfinder to reflect what will be captured as you select different points on the frame for the exposure level is immensely helpful in determining how the picture is going to look.  I don't think you can do that with a DSLR.  Having heavily cropped pictures and then printed them at 8x10, I could not see any pixelation.  The amount of detail is astonishing.  There doesn't appear to be any noise (albeit shooting at a low ISO setting), and there don't seem to be any artifacts typical of digital cameras.  The printed colors, without any software manipulation, are spectacular.  Overall, after two days of use I think this is a great camera.  The only downside I've found is the flash seems underpowered, and the AF assist lamp is pretty lame.  Sony should have stuck with their laser system.  In response to Chris below, the image on the LCD can be zoomed for manual focus simply by pressing the zoom button (it looks like a magnifying glass).", "Date": "November 21, 2005"}, {"Title": "The Sony R1 is a niche camera", "Author": "Gadfly", "ReviewID": "R2GDQKVCQ7A76N", "Overall": "3.0", "Content": "I have owned my R1 for about a month now, have taken over 1000 photos and am delighted with the camera.Let's get the bad news out of the way first and why I only gave it a 3 star rating.The R1 is:Very expensive - on the par with entry level DSLRs with lens kits but can't compete with their speed nor their versatility.It's a large and heavy camera.Uses proprietary batteryDoes not have image stabilization!Does not do videos.This is a horrible mistake on the part of Sony, they price this camera with the DSLRs and then fall short on delivery.In short, the R1 is marketed on the same plane as DSLRs but can't compete with them.Pros:This camera with it's swiveling LCD viewer is super for portrait work. It's ultra sharp lens will best all SLRs as far as portrait photography is concerned.With the swiveling LCD you can go eyeball to eyeball with a toy poodle playing in the grass.You simply can't do that with any DSLR!The R1 is also excellent for candid photography because you can shoot at waist level instead of being conspicuous by holding the camera up to your eyes. In fact, there are many, many times when the R1 performed when other cameras stopped.Exposure, focus and color are excellent and on the par with any DSLR.The controls are easy to find after just taking a few pictures.Battery life is excellent and you should not have to buy a second battery.The 10Mpixels make cropping a breeze!You can toss 50% of a photo and still have enough to print a 11 X 14.The camera looks better than most DSLRs but can't outperform them except in the areas mentioned.If you have longed for a camera that shoots from waist level like the famous 2 1/4 film cameras of days gone by then the R1 is for you.If you photograph a lot of toddlers or pets then this camera is for you.If you shoot a lot of fast-action sports then this camera is not for you.If you are a birder then this camera is absolutely not for you.If you do people shots for groups or clubs then you will love the R1.", "Date": "July 12, 2006"}, {"Title": "Best Digital Still Camera Currently Available", "Author": "John Kwok", "ReviewID": "RSGSZXGEFAWM", "Overall": "5.0", "Content": "Both Sony and Carl Zeiss deserve ample praise for producing the best high-end digital still camera currently available. Indeed, the Sony Cyber-shot DSC-R1 is the subject of a superb test report in the January/February 2006 issue of American Photo, in which the headline reads, \"...combines the convenience of an electronic viewfinder camera with the image quality of a D-SLR\". The magazine compared its performance with a Canon Rebel XT and two EF-S Canon zoom lenses at various ISO settings; judging from the pictures I saw, the Cyber-shot yielded images with better contrast than the Canon's (However, the American Photo article observed that the Cyber-shot images were slightly grainier at an ISO range of 160 to 400, more noticeable at 800, and especially so at 1600 and above; at 3200 the images were unusable in stark contrast to those from the Canon Rebel.). The Sony Cyber-shot DSC-R1 has an ultra-wide Carl Zeiss Vario-Sonnar T* zoom lens (24mm to 120mm), whose optical performance I truly believe is second to none, and which American Photo recognizes as an \"image-quality breakthrough\".The camera itself is quite handy and ergonomically superb, weighing less than a similar D-SLR with a corresponding zoom lens. It probably resembles more a 6 x 4.5cm medium format SLR than a 35mm D-SLR in its overall appearance. The Zeiss zoom lens has T* multicoating to reduce flare and enhance contrast of images, but perhaps more important for the user, has an easily grippable zoom ring and another for fast manual focusing. If there is indeed a major weakness in this Sony Cyber-shot, then it does not come with an optical image stabilizer, and yet, I think that photographic situations regarding such usage would be quite rare, even with this camera for the typical user. Furthermore, I suspect that those most interested in this camera will want highest image quality for most photographic situations - and would not mind the absence of this feature - and here the Sony Cyber-shot DSC-R1 truly excels. So I agree with the American Photo reviewer that this camera truly represents a major advance in image quality for compact digital still cameras.", "Date": "December 22, 2005"}, {"Title": "The Best Keeps Getting Better", "Author": "Mad Dog \"maddog6969\"", "ReviewID": "R3BYH90HA1GGVN", "Overall": "5.0", "Content": "I'll admit up front that I'm an optics snob.  Having worked with the best optics ever made in my work has helped to refine my biases.  So far, I've owned three of the DSC-series Sony cameras that used Carl Zeiss optics.  First up was the DSC-F707, a 5 MP camera that we still have and use.  It has taken over 11,000 images and is still going strong.  I also had a DSC-F714 that met an untimely demise by bouncing down a cliff in the back country.  I still get upset remembering that loss.  Next up was the DSC-F828, an 8 MP camera that got loads of bad press over purple fringes.  We still have our 828 and it has taken over 6,000 excellent images.I haven't actually bought the new 10MP DSCR1, but it's on the short list.  I have a friend in the business and he was kind enough to loan me his demo for the last 3 weeks and I've given it a good enough workout to know I want one bad.  Why?  It is a step up compared to the 828 and I like having more pixels for cropping after the fact and getting maximum detail.  I'm not going to regurgitate the specs and features since those are covered well by the Amazon spec sheet.  What I will do is tell you what I see when comparing images taken by the 707, 828 and DSCR1 of the same subject under controlled conditions.First off, more pixels are better.  You can find plenty of professional opinion that disagrees and they will talk about optical considerations, CCD size, etc.  All I can do is look at the images for myself.  The 10MP images from the DSCR1 do provide more useful detail and also provide more usable image contrast.  These differences are subtle if all you do is display the entire image on your home computer monitor.  I see more detail in the shadows at full image size.  The surface of backlit water looks wetter in the DSCR1 images than in the 828.  But it's when you enlarge the images that the increased pixel density shows its advantage.  Copy stand resolution tests lead me to believe that Sony has made improvements other than just increasing pixel density because images with high color saturation and sharp edge detail look better than I would have expected by just increasing the image size by 25%.  Maybe Zeiss has made some lens improvements?I'd say that the user interface is slightly improved by the new viewer.  The DSCR1 sits in the hand a bit better than the 828 and especially better than the F707.  I also spent a fair bit of time comparing \"film speed\" between the 828 and the DSCR1.  At ASA400, I see a less noisy image from the DSCR1 than from the F828.  At higher speeds, both cameras yield images noisier than I'd like to tolerate, but in low light, you get what you get.  I'm still not ready to make comparisons on the autofocus capabilities of the DSCR1 vs. the F828.  Initially, I thought the DSCR1 had problems, but after fiddling with it a while, I got decent results in most situations.  Unfortunately, most consumer digital cameras have a ways to go in the action photography arena.As an aside, I mentioned that my old F707 is still alive and ticking.  A good friend that is a serious photographer bought the first Digital Rebel made by Canon.  He retired it a year ago after having the CCD cleaned 3 times.  The cleanings didn't work.  He bought one of the new models that's not supposed to need to be cleaned.  It's due for its first cleaning now.  This will remain a problem for SLR digital cameras.  I love the flexibility of being able to use a specific lens, but only do so in my film cameras.  The CCD of a digital camera is so sensitive to dust, I'm just not willing to deal with it.  Everyone I know that has used an interchangable lens digital camera has had dust problems.  Until this problem is eliminated, I'll stick with cameras like the DSCR1.", "Date": "November 29, 2005"}, {"Title": "I switched from a DSLR and have switched back again - But The Sony R1 rocks!!", "Author": "Denis J. EVANS", "ReviewID": "RLILMOU9I4IAI", "Overall": "5.0", "Content": "I am an avid amateur photographer. This is my 5th digital camera. I currently own a Canon Pro1 and this Sony R1.  I purchased the R1 after selling my dust prone Canon EOS 300D with FD 24-85mm USM lens.  Yes after many years using SLRs (digital and film) I am finally fed up with dust problems on the (digital) light sensor and manufacturers who in the main (Olympus is the exception), try to pretend the problem doesn't exist. Has Canon or Nikon ever tried to clean a sensor on a desert field trip?  They don't even sell cleaning kits!  These have to be purchased from third parties.OK so how does the R1 compare? Obviously more megapixels than the EOS 300D. Much better price performance from the Zeiss lens.  The lens is simply superb and would cost a $1000 if you bought the equivalent SLR lens(es) from Canon or Nikon.  The wide angle performance (24mm equiv) is amazing! For backpacking trips the R1 is big and weighs 1kg so I wont be selling my Pro 1 any time soon. Apart from the lens the other main advantage of the R1 over every other camera I have ever owned or used, is the live histogram. Effectively you Photoshop the levels BEFORE you take the photo rather than afterwards at home - when you then discover your out of dynamic range!My only quibbles with the R1 are:there's no movie mode and, as is well documented,it has a small frame buffer and so burst mode is not up to par - it does match the (discontinued) Canon 300D however.ISO noise is not quite as good as the Canon DSLRs but it is quite similar to, or better than, the Olympus DSLRs.But hey! The worst noise is blobs of dust in what is supposed to be a clear blue sky!  I will not buy another DSLR until the manufacturer has a fix for dusty skies.___________After 6 more months of use.  Still the best digital  field camera. The wide wide angle is superb.  The live histogram saves lots of time with photoshop - and it reduces Photoshop induced noise on badly composed photos.  The small frame buffer is of no concern to me. No regrets at all.___Guess what?  This camera is sooo good I have seen it for sale for twice the original manufacturers price!  There is no competition. It is unique.  And I am not selling mine for $2000(US) even though I own a Canon 40 D plus L series lenses.  The R1 lens is as good as Canon L.  It's that simple.  And its that much cheaper.____Now in mid 2008 this camera still sells for double it's original price.  That's how good this camera is.  I am happy with my Canon 40 D and 3xL series lenses.  But at wide angle the R1 still bests the Canon L 17-40mm F4.  The R1 is a seriously good landscape camera in bright conditions.  Sensor noise is not up to Canon or Nikon's current standards.  But for a camera to take into the dusty bush, the R1 cannot be bettered.  Which is why it has appreciated in value by 100%!!", "Date": "May 20, 2006"}, {"Title": "Incredible Camera and Lens", "Author": "Photoman", "ReviewID": "R1JYSGSZLNTWYA", "Overall": "5.0", "Content": "I bought this camera based on the reviews and on the superb Zeiss T star lens that is 24mm-120mm (35 mm equivalent)-the range I normally shoot in. The camera has all the bells and whistles and more to satisfy the advanced amateur and pro. (A friend of mine wants one to shoot weddings.) I shot photos at 3mp and the prints were like postcards! It is a little bulky, but still light enough to carry. Some reviewers didn't care for the screen display being at the top of the camera, but that was not a problem for me. The camera functions are well thought out and are numerous. Being able to use a compact flash card or memory stick is a plus. The camera even tells you how many minutes are available on the rechargeable battery.The only quibbles I had were that you cannot delete all the pics at once that you want to get rid of; you must do them one-by-one. I ordered the HVL 32X flash unit and I don't care for the location of the hot shoe off to the side on the grip, but I plan to solve that by using it on an overhead flash bracket.The camera arrived with Russian language characters in it and it took awhile to figure out how to change the language to English. The instruction book pretty well outlines all the functions, but it can be confusing in parts. My suggestion is that if you are going to get this camera and pay the price for it, get the training DVDs that are available so you can learn all the nifty functions.It is a superb camera, well worth the price just for the incredible lens.", "Date": "April 5, 2006"}, {"Title": "SONY keeps working out the kinks...", "Author": "Astrida Valigorsky", "ReviewID": "RJTVKNJVD6L8R", "Overall": "5.0", "Content": "Initial reviews of this camera inspired me to believe that the new R1 camera would be less ergonomic than my old SONY F828, but I'm pleased to say that's not the case.  The new R1 is better balanced, and very comfortable in the hand.  The ability to use the camera with the viewing screen in a number of positions is an advantage. Buttons are positioned in more intuitive spots on this camera-- it takes less time to figure out where everything is. I was able to pick up this camera and figure out most of what I wanted to do with it within a half an hour of opening the box.  Save speed to a 2GB memory stick pro was very pleasant-- with it taking just slightly over a second to write 20MB worth of raw image to disk.And the photos, well now... those were nice. My father will inherit my F828 this XMAS (since it will be his first digital camera)... I will miss the movie feature on that camera a little-- but not nearly as much as I will enjoy the image quality this camera can deliver.", "Date": "December 23, 2005"}, {"Title": "Shock and Awe", "Author": "Divinewind55 \"divinewind55\"", "ReviewID": "R3NFWV575GEJB6", "Overall": "5.0", "Content": "Have been into top end photography at a Home User level over thirty years, from the Cannon A-1/F-1 to the big boomer Nikon film and digital cameras.  The Nikon digital cameras did a good job but had severe limitations and inside photgraphy was a night mare, if you had time to \"fiddle\" with it it did a good job.Sony came out with this beauty and thought- Sony good stereos and impossible crack codes on DVD's that I can't break.  But a camera?  Well after I read the manual (important), and preped eveything from the first photo to the last one of my Pit Bull puppy getting beaten up by a Parrot #500+ there have been nothing but GREAT photos, if there were blown shots it was my doing.  The resolution, the ease, of everything really makes this a fun camera to use.The only recommendations I can make, is to get the Sony Flash, and make sure you get a L O T of memory when you get your memory stick or cards.  A spare battery pack or two wouldn't hurt.I can think of no other camera out there that will give you the product that the DSCR1 gives you for the amount of money you pay for it.  It was the best money I have spent on a camera since the Cannon A-1.  I strongly recommend this camera, if you are on the fence with the others and have this on the table, the Sony is the best choice.  Above all else have fun with whatever unit you all decide on!!!", "Date": "January 24, 2006"}, {"Title": "Best Sony I've owned (so far)", "Author": "James Hatsis \"AHR\"", "ReviewID": "R2U0848TE1ODSJ", "Overall": "5.0", "Content": "I have owned the 717, the 828 and now this. I know it's not a Digital SLR so I don't expect it to be. It takes unbelieveable photos! The controls are different than the DSC-F828 but they are easialy learned. The lens is fantastic and low light performance is great. When using a high speed Memory-Stick pro or High speed compact flash card the time between shots is fantastic... just keep pushing that shutter button. The top mounted LCD is great for candid shots with the camera at waist level. The viewfinder is really great for those of us with eyeglasses.The battery life is incredible! I can't find the words to describe battery life, I get three times as many shots per battery than I get with the Sony DSC-F828.  Sony claims it is the low power requirements of the new CMOS sensor. I don't know what it is but I like it.The colors are great, the reds are more red, the blues and yellows are bright and no washout.James hatsis  (Sony Fan)James1@OconeeAirService.com", "Date": "January 20, 2006"}, {"Title": "A truly astounding, ground breaking camera!! The Future is here!", "Author": "Sinister Minister", "ReviewID": "R2HYDBMBVLAUNF", "Overall": "5.0", "Content": "Before I begin let me say that I have owned this camera a total of 1 1/2 weeks at this point, so this is just a chance for me to share with you my first impressions. I will update this review at a later time once I've feild tested the camera further.Let me say that I have owned and used a Sony F-828 in my business and personal life since the camera came out 3 years ago.I still think that it is probably one of the finest cameras ever made to this day, is the R1 a fitting successor? No, I don't think so because the R1 is a step in a completely different direction in terms of design than the 828. Anyone who follows and stays current with technology could have told you that the 828 was to be the last in the Sony \"F\" series cameras when Sony announced it over a year ago, even then they said thier pro line was going to go under radical changes. The R1 is the result, it is intended as a direct AFFORDABLE alternative to digital SLR cameras (Nikon D200 10.3MP $2,400 body Only, Canon 5D, 12.3 MP $3600 body only need I say more?)Yet at the same time we are given a chance to see where photography is headed. The R1 erases alot of the lines of seperation between SLRs and fixed lens cameras. 1. live preview capability with a CMOS sensor. 2. Same versitility with exposure controls.3.Improved high ISO performance. and finally lens configurations that quite literally save you thousands and thousands of dollars! Examples? the R1 24-120mm, the Samsung pro815 28-420mm!!Digital SLR speed, Resolution and performance with a fixed versitile fast lens. That is the future of photography, that my friends is the the R1 and a bag of chips.The first thing you notice about the camera is the wieght (it is heavy) I bought the camera mainly to do portrait work, but if you take it into the feild be prepared for a work out! All of my trials are done out in the feild and I can tell you this will be spending alot of time on a tripod, Unless I start lifting weights!The next thing I love about the camera is the LCD screen wich is quite practical and useful. But beware the \"Auto\" mode on the LCD/EVF selector. A sensor in the LCD senses your body when you get too close (like waist level shooting) and shuts off the the screen! The controls in general are spead out over the camera and once you get used to thier placement are really quite comfortable to use.(It took me about a day)The one thing I was glad to find missing was that infernal \"MOVIE MODE\" This is a still camera folks remember!? If my kids wanna make movies I can get them a cheap camcorder that would do a better job anyway, so to those of you who are moaning about it, get over it, buy a camcorder!The one thing that I have heard about the R1 and read in all the reviews I've checked out is the amazing pictures it takes, I concur this camera takes breathtaking images wich made up 4 of the 5 stars Igave it.Of course there always seems to be one bozo who can't focus or use the camera right and ends up with bad pictures and then says everyone else is blind. Folks, Thats just crazy- I have been more than happy so far with exposure & focus in this camera, and operation of the lens is smooth as silk, If there is to be a R2 however, I would like to see the same camera with a 12X or 14X capability (That would make this camera as near perfect as any I've ever used) That and expand the burst capability. This camera is lightning fast but only at 3 shots per sec then the buffer fills.It is these two things that kept me from rating the camera perfect. Alas like my beloved 828 I fear the R1 is destined to take a verbal pounding from skeptics and SLR owners who resent the ever closing gap between SLR and fixed lens cameras. But like the 828 the R1 is destined to outlive its opposition and sit at the forefront of advanced camera design.I mean you can buy a 20D anywhere, but last time I checked theres a four week waiting list for the R1, and since Sony has stopped production on the 828 they are nearly impossible to find. Sony once again has shown us that its not fair that the pros get all the good stuff! I love Sony for that.(this coming from a pro!)Is the R1 the future of digital photography? Yes, I beleive it is, and it is long, long over due.ISO Noise has been claimed to be a problem on this and every other fixed lens camera worthy of note, and you wanna know what I think? I think people need to stop using places where we exchange information (Like here at AMAZON) to stop venting thier anger when someone comes along who does it just as fast or as good for less money. Bottom line is this, If you are clueless as to how to use your camera chances are you can get some pretty horrible images. Most ISO test are done using either a completely black or grey surface, hey man, if you want to take pictures like that there are a bunch of camera's that go for about $800 less than this one.With the ISO set at 3200 on the R1, I did in fact notice some noise within the image, but with just about any photo editing program even a novice would have no problem fixing the shot to make a fine print, that is If you even noticed. Of course if you take pictures that are all black or grey well I just don't know what to tell you! The burst mode in the camera is the single downer with the R1 (and the SLR boys are jumping on this one) The R1 is fast as lightning but the buffer fills in just 3 shots.After doing a little digging I was told that this is because of overheating in the CMOS sensor and because of power consumption. If you don't mind paying $700 to $3000 more for a comprable, faster SLR (Nikon D200 or D2X, Canon 20D, 5D) Then go for it. Don't forget to buy your lenses while your at it and find a good service center to keep it all clean. Cha Ching Cha Ching!!In closing having addressed the few negatives that the  \"whos who ever\" have been able to come up with let me leave you with this, The R1 is a genuine innovation in technology. It states in big beautiful affordable color that the days of overpriced,  heavy big camera bag carrying sell your kids into slavery cameras are over. The R1 and the F828 are similar in this one respect- they broke down the walls and let us all know what it feels like to have the good stuff, let us know that you don't have to spend a mint to get great pictures. Sony started that mind set, now Panasonic, Olympus, Samsung, and others are coming around. Even Nikon to some extent is(D50 is great example). Canon? Well lets not hope for a miracle here! Just remember more expensive does not mean better, it just means you paid more.I beat out expensive camera users for work everyday, its you that makes the pictures not the camera.Get on the waiting list...Buy this camera. SLR's are on the way out, this my friends is the future of photography and from here it looks very very bright!Thanks for your time and as always Happy Shooting!(Check out the images I've posted for more info)- SiNMiN", "Date": "December 4, 2005"}, {"Title": "The Zen answer", "Author": "T. Haller \"The Vicar of Fordham\"", "ReviewID": "R3FT7PKDK41CY0", "Overall": "5.0", "Content": "I have previously been unsatisfied with digital cameras primarily due to the shutter lag phenomenon. I really like capturing the \"moment\" and in my years as a film photographer (mostly portraits and theater) was happy to say I wasted very little film.Well, I found most digital cameras, by introducing a long delay between the moment the shutter is pressed and the image captured, were a source of great irritation... until... the DSC-R1 came along. I did my first \"shoot\" this weekend, and not only did I not waste time (and miss shots) but almost every picture turned out to be what I wanted it to be. On top of that, the superb resolution, the preservation of details in shadow, the wide angle at one end and the one button \"zoom boost\" (which some folks might ignore, but which effectively increases the zoom -- and without a noticeable loss in image quality)... all of this adds up to one great camera.Sure, I wish it were a little lighter, less expensive, and so on.  But this is the digital camera I've been waiting for!", "Date": "July 25, 2006"}, {"Title": "The Second \"Flawed Jewel\" in a Series?", "Author": "Ray \"A Reader\"", "ReviewID": "R3XVC27AK8WFC", "Overall": "4.0", "Content": "When Sony put out the DSC-F828 back in 2004, the camera was immediately tagged \"the flawed jewel\" by many reviewers. The reasons were obvious: with the new four-color HAD sensor, incredible ergonomics, and multiple control features often paralleling a DSLR, Sony positioned the device to become the camera of choice for pros and semi-pros who wished to have a second camera to escape from carrying around a DSLR and a set of lenses on every trip. Unfortunately, the camera, though taking wonderful photographs for the most part, suffered from strong purple fringing (\"chromatic aberration,\" as it is called), and it was one of those love-hate relationships. Most people loved their F828, but just were aggravated that Sony had chosen to release such a gorgeous unit with such an obvious flaw.Fortunately, we don't have to say the same for the DSC-R1, and it is worthwhile to report that most all the issues surrounding the F828 have been corrected in the R1. In fact, the DSC-R1 outpaces all current non-DSLR's by a significant amount in the ostensibly most critical area: image quality. The camera is capable of producing some of the most beautiful images one will ever take with a non-DSLR rig. In fact, SO good, that one will begin to seriously question whether a DSLR is even necessary for most people who are non-pros. The camera does most everything that a DSLR will do, and to boot, has a built-in lens that, if purchased as an equivalent combination of lenses for a DSLR, would easily cost twice as much (some say even more). And those pictures are just gorgeous. Striking detail, rich color, surprising sharpness, and few missed shots. To boot, battery life is superb, the best I've seen in a camera thus far. And the lens, while only providing a 5x optical zoom, also provides a very wide 24mm landscape shot, and so there is actually a tremendous range between its widest and most zoomed settings.Now, the inevitable caveats. There are indeed some factors which do not make this camera a \"no brainer\" for every user. And, without fanfare, let me list some of them for consideration before you make the plunge to purchase one.First, the camera has an unusual physical design which lends itself more to waist-level shooting, with the user looking DOWN onto the top of the camera, where the LCD can be seen. It is true that the LCD pops up and can be positioned upright so that one can shoot straight-ahead, but at 2.2 pounds, let me know how far you go until you decide arm fatigue forces you to rethink that decision. Although I actually prefer the waist-level shooting of the R1, I have to admit that the configuration is somewhat unconventional, and not everyone will get used to it. Some downright hate this physical configuration.Next, there is one area where image quality does take a small hit, and that is in the level of distortion when shooting at the camera's widest \"(i.e., 24mm) setting. Particularly when shooting architecture, but in reality for most any setting, the wide-angle setting will produce significant inward bending (\"vertical perspective distortion\") of the image, requiring you to use an image editing program, such as Adobe Photoshop, to correct the image. (If you are not familiar with this phenomenon, a photograph of a building with this type of distortion will make the sides of the building not appear to be straight, as though the building's walls, appearing tilted inward, would eventually meet each other if extended long enough.) This is not an insurmountable obstacle, as one can correct this relatively easily with image editors, but it is one of the few areas in which the camera underperforms. However, when looking at the overall image quality of shots the R1 takes (clarity, detail, and color), it's pretty easy to forgive this one issue.Finally, there are a few specification issues one should taken note of before purchase. The optical zoom of the camera tops out at 5x, which is not all that bad, but many people may wish for a greater zoom amount. (A Sony add-on lens boosts zoom by 1.7x, but this conversion lens is expensive, heavy, and bulky.) Macro focus performance is also not nearly as good as the old F828: one must be a good number of inches away from any object to achieve a focus, even when the \"macro\" mode is selected. Also, should you choose to shoot in RAW mode, the resultant images, while of superb quality, take up a whopping 20Mb per shot, quickly overwhelming both your storage and your patience as you try to copy, open, and transfer files. And because the R1 was released before the specifications for the new Memory Stick Pro Duo were released, the camera can only accept up to 4Gb Memory Sticks, and the camera is also just old enough not have included anti-shake technology, so these limitations are unfortunately present in the R1. Mitigating these shortcomings is the fact that the R1 does possess a second slot for Compact Flash cards for capacities up to 4Gb (making total potential memory capacity equal to 8Gb), and the fact that a three-inch mini-tripod can easily be used for difficult shots (which often yields better results than anti-shake technology).Having said all of this, the final judgment comes after using the camera over time, viewing the images it produces, and comparing it to other fine cameras on the market. You'll find few people who own a R1 who will say anything other than the images it takes are superb. And the reason why is because the photos ARE superb. If you find that the minor issues described above are of little concern to you and that the physical design of the unit is one to which you can adjust (or even, as me, can even prefer), then this could be a great find for a semi-professional, non-DSLR camera. It may be somewhat of a \"flawed jewel\" like its predecessor the F828, but with fewer outstanding issues and greatly improved picture quality over the F828.Update: Summer, 2011Four years after writing the above, I've returned to this review to post a short update. It's more poignant than anything, but I must say that, four years and about half a dozen cameras later, I'm still remarkably impressed with the Sony DSC-R1. My latest purchase was a Nikon D7000 with a Nikor 18-250mm lens, and, although that, too, is a great camera, the photos taken with the R1 still grab and impress me. It's probably partly due to the superb Zeiss lens: my Sony a33, which I used this past winter in Amsterdam and Paris, was also paired with a Zeiss lens (Sony SAL-1680Z 16-80mm f/3.5-4.5 Carl Zeiss Vario-Sonnar T DT Zoom Lens for Sony Alpha Digital SLR Camera, and I saw much of the trademark \"Zeiss\" look to those shots, too. Rich, saturated color which just begs at repeated viewing and which also can really \"punch\" with dramatic impact on shots when they are framed well. But the R1 did this WITHOUT an interchangeable lens, and with a first-in class APS sensor, and with a remarkably useful flip screen for composing shots. Yes, it gets noisy at about 800 ISO, and yes, the Nikon D7000 can run circles around the R1 in that regard (in fact, a number of factors), but when I review the shots I've taken with the R1 over the years, they are incredibly impressive even measured against today's DSLR standards.I don't know that I'll take the R1 to Europe with me again, particularly with the impending release of some very sophisticated alpha mount Sony cameras which will also have the Zeiss lenses as an option, but I'd still consider it. The images are just that good. The DSC-R1 shows us what Sony was--and probably, still is--capable of doing when it really puts its mind to it. It probably could earn a prominent spot in a technology museum, but, then again, just looking at it could never convey just what this little \"flawed jewel\" could do.", "Date": "April 3, 2007"}, {"Title": "The best camera in the market for the price (as of Jan 2006)", "Author": "Nicolas Pujol", "ReviewID": "R3ESS9QL7DXIL8", "Overall": "5.0", "Content": "OVERALL IMPRESSIONS: The best camera+lens package you can get for $999. I originally bought a Canon Rebel XT as it had great reviews and was supposedly compatible with my film Rebel lenses, it turned out they weren't and the camera was less than impressive. I returned the Rebel XT and bought the R1. Sony did an outstanding job with this camera by incorporating so many features and a fantastic lens for under $1000. Prospective buyers, never understimate that SLRs need a good pricy lens in order to perform as well as the Sony R1. The resolution is excellent. I was a bit concerned at reviewers who found the camera slow. It is true that it's not the fastest, but for most purposes it does just what I want. I think 3 shots per second is fast enough for me. Sure, 5 / sec is better but frankly, 3 / sec is VERY fast. Some complain that you can't shoot fast in RAW but I personally only use RAW for landscapes and staged pictures, not rushed shooting. My point is that Sony made the right technology trade-offs and used good sense. After much research I settled for the R1 now I'm using it, I confirm it's the best camera in the market today at this price point.COMMENTS: These are not problems but things to be aware of:- the camera is pretty big and heavy compared to models today. No issue for me, but some may care.- there is a bit of learning curve to master the camera. You buy a race car, be ready to spend more time learning the commands than getting an automatic sedan car. Same for the R1, the manual is long, there are many options, which is what I wanted. Again, some may care and in that case I'd advise a point & shoot with many scene modes pre-programmed.- that's it. Well done Sony.", "Date": "January 27, 2006"}, {"Title": "The Best", "Author": "TLHoss", "ReviewID": "R2R13FSMPMVTVE", "Overall": "5.0", "Content": "This has to be one of the BEST digital cameras.  I received it Friday, and immediately removed it from the shipping material and began snapping shots.  One of the Easiest cameras I have ever used, I've owned approximately 7 other digital cameras, from the NIKON 8700 down.  This is the best of the lot.  The only fault I can find to complain about, I need someway to attach the lens cap to the carrying strap/camera.  I've been know to lose many lens covers.  Now the good parts,  EXCELLENT manual, EXCELLENT location for each button.  You will need to read the manual to find out how each of the buttons work.  Love the quick start up, the quickness you can snap photos.  The software that comes with it, is GOOD but I use other software, which I am more use to.  The focus ring is quick and easy to use, the AUTO FOCUS is also excellent. The detail of the photos I've taken is EXCELLENT, the various shutter speeds, what more could a person want.If I could rate this camera higher I would.", "Date": "February 13, 2006"}, {"Title": "Best Prosumer Camera Under $1000", "Author": "J. Groma \"secolo\"", "ReviewID": "R3TOYEN2C2NFG5", "Overall": "5.0", "Content": "A great travel camera. I leave my Canon D20 kit at home. In fact, I find myself using this thing all the time--it's very easy to use, love the ergonomics. The only caveats--high ISO ratings are way too noisy, not nearly as good as the Canon. Also, the excellent lens is too short at the telephoto end. Otherwise, one of the best lenses out there. Battery performance is excellent. Bulky, but light. Buy a high quality protective filter, like a B+W or Hoya. Use it and enjoy!", "Date": "November 4, 2006"}, {"Title": "Best camera I have ever owned!", "Author": "A huge fan", "ReviewID": "R340U8KT58NPRT", "Overall": "5.0", "Content": "I have owned numerous digital cameras, but have never found the \"perfect\" one, until now. You will simply not believe the incredible photos this camera will produce. It's not small, but it fits great in the hand. I have simply not been able to take a bad picture with it yet. The photos aren't just a little better than other cameras, they're absolutely superb. You will not regret buying this camera.", "Date": "November 3, 2006"}, {"Title": "Very Unique Digital Camera!", "Author": "R. Mok", "ReviewID": "R1DJFA1POE04FG", "Overall": "5.0", "Content": "I had my eye set on this camera when it first came out in 2005. It was quite expensive at that time. But I've just bought a used one recent at a famous auction site in 1/3 of it's original price. I am so happy with it even though it was introduced in 2005. As far as image quality, this camera still live up to today's standard.What made this camera unique is the excellent Carl Zeiss zoom lens (24-120mm) matched with a large 10.3MP APS size image sensor. That make this camera shines. Also the built quality is of high standard. Besides the image quality, I like the LCD placed on top of the camera and that you can turn it freely. I used it like a waist level camera all the time and took  lots of nice candid photos of my kids.It is a one of a kind because it has the convenience of a fixed zoom lens camera with a DSLR image quality sensor that none of the other fixed zoom lens cameras can compare!Does this camera has it's drawbacks? Yes, certainly. What I missed most is a video capture function. I can't believe Sony missed this completely. What a shame! Also I like to see a better on screen menu, a faster AF sensor.All in all, this is a wonderful camera to have if you want to travel light  and don't want to carry a bunch of lenses and still want the same image quality as your DSLR. This is the way to go. Get it if you can find a nice used one. You won't regret. For today's used price you cannot even buy a decent zoom lens alone!", "Date": "July 13, 2009"}, {"Title": "Two years with the D1", "Author": "L. Ekker \"Guiding Directors through the Visua...", "ReviewID": "R3RXBQR9WKECTJ", "Overall": "5.0", "Content": "I have had mine for over 2 years and I LOVE this thing.  In my opinion it is a classic digital camera.  I have taken so many stunning shots with it, and when I hand it to others, less skilled than I, they take them too.  It's true, that a camera can't make you a better photographer, unless it has a superb noise reduction algorhythm, a spectacular lens, a big CMOS chip and a fast response time.  It turns on so quickly that I can leave it off and turn it on for a grab-shot, and extend the spectacularly long (530 minutes plus!) battery time indefinitely.  The only down side is that I end up keeping so many shots, well over 5000 now, that my poor drive is full!  I really love this thing.  It's been all over the world with me, contributed to high-end visual effects jobs, created truly memorable shots and therefore gifts, web content, commemorations, art pieces etc. that I will never part with it.  Find it for sub-$500 and you will never look back.  I also recommend the instructional DVD they sell here.  Moderate production value, but high instructional value.  This camera is not a simple snap-shooter if you want to make art, so the DVD is the fastest way to learn the features and refresh memory.  VERY helpful indeed.  The added feature that it uses two different memory media if nice too.  I am currently carrying 12 gigs of memory!!! That translates to something over 2,700 10mp JPEG pictures!  I will never max out.  Impressive, huh?  Well, I think so!Enjoy it!  I love mine so much.Lekfx", "Date": "October 24, 2007"}, {"Title": "Detail AMAZING!", "Author": "LAGE", "ReviewID": "RDGY2OCIROVPO", "Overall": "5.0", "Content": "I have had this camera for a while now...and I Love it! I bought this camera primarily to photograph landscapings, animals, the ocean and small insects for my art (I am a painter). I needed a camera that would capture the finest of detail on a butterfly, and I found it! This camera is heavy, like previously mentioned on other reviews, but it is truly an amazing camera. The clarity and color on my photos, is worth the added workout:) I too am surprised on the lifespan of the Battery....I recently photographed a 50th Wedding anniversy and I have yet to recharge my battery. In concluson...I am  Very Pleased with my camera!!!", "Date": "June 18, 2009"}, {"Title": "Fabulous camera", "Author": "Dr. Ted", "ReviewID": "R3N94VMG8PJJTP", "Overall": "5.0", "Content": "I have had this camera since July 2006 and have grown to love it. To see what kind of photos it can take, take a look at Eric Pouhier's work on pbase.I took it on a three week tour of Europe with my 14 year old son in August. I took along two memory cards (1 and 2 gb) and also took along an 80 gigabyte portable Wolverine drive which worked flawlessly (I only used up about 6 gb). The Wolverine's charger had no trouble working on overseas voltages (nor did the Sony's). If you're used to travelling with an slr, the sony will pleasantly surprise you. If you're used to travelling with a compact point and shoot, the Sony will seem huge.I also have a Canon 20D SLR which is also great. I mainly use the Canon for bird photography with a 300mm image stabilized lens. The Sony is basically useless for bird photography (unless you have an extremely cooperative- or dead- bird). For most other purposes, the sony is better than an slr. It takes great portraits and landscapes. It's fabulous in cities and for photographing buildings (great wide angle). It is also fun for candid shots using the lcd view finder.", "Date": "October 25, 2006"}, {"Title": "2013 - A great Camera!!", "Author": "Reinold F.", "ReviewID": "R28A2NTQDUHITG", "Overall": "5.0", "Content": "Search in internet: Digital camera with zoom lens and big sensor. There exists just one answer and it is this camera. There is no more, there is no other option in the world.-Why Sony R1 is unique.I bought this camera used here in Amazon. I was tempted for sigma dp1, but I really want an evf and not to be limited by a lens with just one focal length. I could get a mirrorless, but I don't want to buy lenses nor to take care of the sensor, and find a lens equivalent to this Carl Zeiss could be very, but very, expensive (I could use my father's Canon FD lenses with a mount but actually the pictures I saw with several cameras like nex or nx hadn't soul to my eyes) I could bought a DSLR, buy again I don't want worry about sensors and lenses, and I actually find very uncomfortable that noisy shutter that I think is suitable to studios but not to shot in the nature or in the city where it seems a gun to shot doves and people, and when someone is not a professional photographer the best is to be discrete. I like the superzooms because its form. Is safer to hold and carry IMHO.-Why this is a great camera even in 2013I am not a professional photographer, so my point of view is from my experience with small digital cameras and great film cameras, my review is for people who just love to take photographs not with the best image quality but with a better artistic meaning.**Today we have great storage in hard disks and better raw converters. The raw archive is 20mb of data and in night shots to my inexperience it's better to easily correct the white balance and reduce the noise without destroy the detail.**I tried DxO, Capture One and Lightroom: DxO doesn't support SR2, so the correction is lens distortion but to try to fix night shots is impossible, and to my taste the lens is so good that it doesn't needs correction, but for correct day shots it could be enough if someone wants to correct; Capture One was a bit hard because I don't understand it very well; Lightroom is very good, my night shots are perfect with that program, I process first in Lightroom to clean the noise and adjust the colors and in dxo i fix the horizon or the angle, or convert with a preset like film. These programs are free to try for a month and two in the case of capture one.**There is accessories, and because it's an old model they are very cheap.**This has an electronic viewfinder, these days the cameras just have a screen that and the evf are sold apart.**Current mirrorless cameras say that the distance between sensor and lens is 20mm more or less. In Sony R1 the distance is 2.1mm, so I think if the add of a 2012 camera says it's a plus a shorter distance then this camera could be better performance.**This has a great screen. Yes, it's small and slow, but if you are like me and you are trying to take better images and not to hunt with autofocus running children then it is a great screen. It thing is so useful!**I use my cameras always in manual. I don't use auto. So I could hand the well thoughts bottoms of the camera without problem. In minutes I knew what button to press in the dark. Although the dial has a strange place.**A great sensor with more than enough 10 megapixels. I barely print my photographs. I do it just to show the best to my older relatives, my grandfather, grandmother and parents. And with the raw conversion i'm sure I could print bigger sizes.**The Carl Zeiss Lens is a beauty in crystal. With real manual zoom and a focus ring that is fake but works. I know, I know, it is surely rebranded but the quality is there. Years ago i had a HP, a 4 megapixels camera, with carl zeiss lens and the sun in the sunsets always was perfectly rendered.**An actual compact camera means 450 dollars or more. With smaller sensors and mostly advances in features. I see a great dynamic range in Sony R1. And with 12 gigas of internal storage, great lens and a great range of pros I think almost is a robbery to pay near to 300 bucks for this great camera.**The shutter is Ninja Level!! It is so quiet.-Cons that you have to have in mind:**There is no video option. I don't take much videos, and when I do them is with a cell phone.**The custom white balance in night is inaccurate. Or perhaps I am doing something wrong because I cannot set the white balance as I used to do with my Olympus SP bridge.**The options to adjust the jpeg from the camera are almost childish. In day there is no problem but the night can be harder cause the limited controls. Every adjustment has just three levels where others in those times has even 10 adjustment levels.**The lack of image stabilization could be a problem, although to me not because I get a tripod or shoot with higher isos and clean the raw.**There is no much accessories or are expensive. The best is buy generic from another cameras like marumi filters to close up.**Just three minutes in bulb mode.-Last words.This camera possibly is a hidden classic, an electronic jewel with the original sin to have the cybershot name in its cover (if it would say leica surely other would be the history). Actually I don't understand why a camera with premium glass, big sensor and so beautiful colors is so forgotten. What I know is with Sony R1 I am thinking more in improve the quality and composition of my photographs than in worrying about the image quality of the camera. It is a new world to me as an aficionado to the photography. I don't think I am going to need another camera in a long time.", "Date": "March 23, 2013"}, {"Title": "long time user", "Author": "Alice M Folk", "ReviewID": "R1R74MLP7RM57R", "Overall": "5.0", "Content": "I have been using this camera for 5 years now, with over 7,600 shots taken. The only complaint I have is that the flash is just a little too bright, but the output is easily adjusted. When paired with Sony's close-up lens(VCL-M3367), it takes beautiful macro shots. The color & clarity of the shots are outstanding. And, the battery life is exceptional. I often forget that it's not a DSLR! If you want more than a point & shoot, but you're unsure if a DSLR is right for you, you should buy this camera. Since this model has been discontinued, I recommend that you look for the telephoto & close-up lenses before buying, if you think you'll have a need for them. I can honestly say that this camera was worth the investment!Sony VCL-DEH08R 0.8x Wide End Conversion Lens for DSC-R1 Digital Camera Sony VCL-DEH17R 1.7x Tele End Conversion Lens for DSC-R1 Digital Camera Sony RMVD1 Remote for DCR-HC, DCR-DVD, DCRVX2100 & HDRFX1 Camcorders", "Date": "December 28, 2011"}, {"Title": "Great - proof Sony acquisition of Minolta was a tragedy", "Author": "Robert W. Johnson", "ReviewID": "R3DSAFTGX8CMMN", "Overall": "5.0", "Content": "The Dsc-r1 is a very good to great camera and a fantastic value.  This was the last camera produced by Sony before they acquired Minolta (I think) and if this camera was an indication of product development direction photo enthusiasts missed out on who knows what innovations.  Sony cameras seem fine now but they look and perform pretty much like the rest of the pack.  The R1 and some of its predecessors were unique and fine cameras.This camera is excellent for portraits and landscapes.  The lens is wonderful and makes the camera.  Like all pop-up flashes, the one on this camera isn't great.  But it does have a hot shoe.  As pointed out by other reviewers the buffer doesn't support serious action shooting. APS C size sensor.  That lens!  And silent shooting.Image file size isn't up to present standards but hardly anyone makes use of a fraction of the potential of present giant files.  10.3 megapixels is plenty.  And the lens!Camera looks unique and aggressive with the large lens dominating its appearance.  Fits well in the hand.Lastly, Sony provides BOTH a CF slot and a memory stick slot.  Very nice.  Allows you to have plenty of memory on board at a reasonable price.I feel guilty keeping this camera in my truck as a grab camera!If you can pick one up at a reasonable price you won't be disappointed.", "Date": "September 13, 2011"}, {"Title": "Top Notch", "Author": "RPB-ATL \"RPB\"", "ReviewID": "R33MF61A9VABI5", "Overall": "5.0", "Content": "Waist level finders have always appealed to me whether using an SLR or a medium format camera.  So when the R1 combined a waist level capable finder with a giant CMOS imager and a wide zeiss lens, I had to give it a try.  I am not disappointed.While it is not the fastest focusing camera out there,it is great for anything short of quick moving subjects.  Images are sharp, sharp, sharp.  Image stabilzation would be nice, as well as faster focus.  But with even these shortcomings..the R1 is worth every bit of its price.Am now hoping for an R2 upgrade of the R1---will be on it like white on rice.", "Date": "November 3, 2006"}, {"Title": "What A Camera!!!", "Author": "C. Matthews", "ReviewID": "R29O45HA1PBX4X", "Overall": "5.0", "Content": "I did my research before I bought this camera. I have a Canon 20D camera and the R1 is better as far as image and color. It's feels solid. I also use it in the studio and it's amazing how the detail of the pics are.  So if anyone looking for a camera with high detail images and don't need interchangable lens and shoot sports.  It's a great choice!", "Date": "February 4, 2006"}, {"Title": "Excellent quality, poor performance", "Author": "Harry M. Shin", "ReviewID": "RE77ZKFCXVE0M", "Overall": "3.0", "Content": "1.  I've had the R1 essentially since it came out (2yrs?).2.  As has been documented in many reviews--> this is a camera that can produce excellent results, IF you shoot in RAW.3.  With the above being said, this camera will or will not work for you mainly depending on the type of photography you normally do.  a.  Poor macro:  the in camera macro ability is a joke--> if macro is important, you'll need to get the screw on close up filter.  b.  Obviously fixed lens 24-120mm.  I think that 24mm is going to be wide enough for most folks (including me... most of the time).  However, I would think that most folks may want to shoot more than 120mm episodically.  There is a wide angle convertor lens (which is good) and a tele convertor lens which is terrible (read my review on that).  c.  Burst rate:  terrible--> only 3 shots in JPEG.  Thus, if you're into sport, shooting action shots, taking shots of the kids--> forget it.  And by the way--> fast focusing is not a strong suit with the R1 either.  d.  RAW write times:  slow and subpar for this caliber of camera.  And as noted above, if you want to get the highest quality image, you really need to shoot in RAW.4.  Translation:  if you're mainly into landscape photography--> this might be a very good camera for you.  However, like me--> you'll find that the lack of the ability to shoot beyond 120mm, the lack of true macro capabilities, the slow RAW write times (when you really want to capture a fleeting scene)... can all be very frustrating--> which then brings the realization upon oneself of \"perhaps this is why most  (all) professionals use DSLRs.\"  It's a great camera which is capable of excellent images, but the poor performance is a significant limiting factor which becomes more and more apparent over time and in different shooting situations.", "Date": "August 24, 2007"}, {"Title": "Awesome Camera", "Author": "The Bullfighter", "ReviewID": "R1Q218204Q19Q2", "Overall": "5.0", "Content": "I just had my R1 for a week now and I love it. In summary, it's an awesome camera. Takes great quality pictures with true colors and great details. I got it for $650 and at that price, I'd say it's a bargain. If you're in the market for a full size professional digital camera, R1 is the camera you've been looking for. In addition to the awesome quality pictures it takes, 5X zoom, long battery life, CF and memorystick options, swifel LCD screen, etc.. makes this camera even more competitive.", "Date": "November 13, 2006"}, {"Title": "The best camera for the best price", "Author": "Hector D. Silva Lemarroy \"davidsle\"", "ReviewID": "RLL0V7IEC8FLJ", "Overall": "5.0", "Content": "I just came back from my holidays. I wanted to buy a camera good enough for the next three years and you know what? I found it. This camera has a great picture depth (10.3) and it has amazing features such as the Auto Focus. The AF in this camera is just amazing, just with simple clicks the camera will always find the target you're looking for; it doesn't matter if its day, night, rainy, snowing, crowdy, whatever it is the camera will find it and focus it perfectly. The mixture of the lenses and the out-of-the-box zoom is awesome, all the detail you're looking for is going to be there when you download your pictures to a storage device. If you want to get PRO just buy any of the other accessories available to this camera and become one. I love this camera, it has a great price, great features, it will be with you for a long time not only because of its features but because you can add more accesories to it to make you feel a PRO", "Date": "July 3, 2006"}, {"Title": "Nice\"heavy\" camera", "Author": "Yvonne Graf \"ybo\"", "ReviewID": "R2TE2DMAYVCNE3", "Overall": "4.0", "Content": "I had wanted this camera since I read about it a few years ago.  Just seemed to fit my needs, with its high ISO and the LED screen that swivels around.  I take pictures of a friend's rock band and need a camera that is fast.  From what I read about this one is that it is.  I've only had it a couple of months, but have taken well over 500 pictures with it.  I've had to play a lot with the aperture and other settings in manual mode since that is where I can get the best pictures without having to use the flash.  Depending on the venue (some places have better lighting then others) I've had some really nice pictures with it, but it's taken a lot of tweaking.  I first had the ISO at 3200 which was just not working since it had so much grain on the pictures even with good light.  I put it to 1600 and have much better luck.  I leave the F-stop at 2.8 for the really low light pictures, and up to 4 or 5 for most other pictures.  The problem seems the focusing is slow and off.  I've owned the Sony 717 (which I loved!) and the F828 which had its issues, but was a good camera.  The 717 to me took better pictures faster than this does.  Even in the\" green camera\" mode (basically point and shoot) it seems slow.  I've played with all the focus settings trying to get it faster but when it's faster the pictures end up out of focus.  The setting that seems to work is the continuous.  Still it's slow but I'm learning to adapt to that.  Like many reviewers here I don't know why Sony got rid of the laser focusing it had on the 717 and the F828.  This seems a downgrade for me, especially for a camera that new went for $1800.  It seemed to help when I used the expand on the focus, something that I found accidently since the book and \"read this first\" really didn't talk much about it, but it helps!!Pros: The weight, which for me works and may not for others.  I love heavy cameras and this one feels good, but if you don't like a heavy camera you'll hate this one. This one weighs in at over 2 pounds!  And it's all the lens.The higher ISO.  Although 3200 won't work for most stuff unless you don't mind the \"noise\".The lens... I wish it were a higher zoom, but it's nice!!Long battery life.Cons: too much noise in the higher ISOSlow to focusNo video, although I don't care that much about that but seems a high priced camera not to have it.", "Date": "December 28, 2009"}, {"Title": "R1 possible the best APCS sized sensor camera ever made", "Author": "Malcolm Lyons \"Outside the box\"", "ReviewID": "R3AHFJ9L4GHSQG", "Overall": "5.0", "Content": "I have owned the R1 for 3 years. Its the best camera I have ever owned or likely to own.I also own a sony alpha A700 which is an excellent camera rated alingside the Nikon D300.But I have taken most of my best pitures with the R1. I decided to test the R1 against My alpha 700 using the stunning  Sigma 50mm f2 macro lens which is of prime sharpnes.I was astonished to see that the R1 far outshone the A700 with the 50mm fixed lens in resolution, colour and dynanic range. The R1 is a truly amazing camera that is certainly one of photography's hidden secrets.If you see one get one(or two) and look after it.", "Date": "July 29, 2009"}, {"Title": "my review on sony r1", "Author": "Jeffery B. Vu \"kool100vr4\"", "ReviewID": "R2TQ7G8PI3TN1A", "Overall": "4.0", "Content": "well, i finally bought the sony r1, after along wait for the price to drop, and read all reviews on it..i got it for 565$.what i like about r1:build quality, good zeiss lens, 24mm wide angle, iso change on cam just a botton..great colors balance, low noise and high iso, big cmos sensor, use both pro stick and cf card, long battery life , displays batt life in mins, useable high iso at 400, top view and swivel lcd, manual tele zoomring, good raw files.what i dont like:battery charges in camera is a big draw back, while you charge the batt, you cant use the camera to shoot, bad feature, hope sony improves it on next camera. the camera design is so weird, the grip is over size, off balance on hand, view finder housing is over size, to use external flash you have to go to menu and change it everytime, and change back to use pop up flash, cant use both flashes, missing OIS(opical image stabilizer), its heavy and big, tele at 120mm is at f4.8, AF is not that fast, its kinda slow, especially in dark, sony should learn from this cam and improves it on next camera, im sure they will.the price is abit too high for a point and shoot, no video mode, macro is too far from subject, about 15 niches.other than that i love to use it, its my main camera to walk around with, i love the image result quality, thats why i bought it, i know no camera is perfect yet.for the price i paid im not complainning. its a dslr wanna be, very close to dslr results.i strongly suggest to any one who wants a back up to dslr..", "Date": "December 30, 2006"}, {"Title": "Best Basic Still", "Author": "donp", "ReviewID": "R2PEIND2P1FI73", "Overall": "5.0", "Content": "With an array of DSLR's, Point & Shoots, and camcorders all in frequent use, I must say that the Sony R1 produces the best still image of the lot The camera takes a superb photo with remarkable depth and resolution in any lighting conditions, producing true colors and tones. OK, this gizmo lacks the cute stuff and all the bells and whistles of, say, my D Series Nikon, or my Canon EOS Rebel, but it takes one heck of a great still picture -- distant, mid-range or macro. It made me a believer in the Zeiss lens.", "Date": "August 26, 2011"}, {"Title": "AMAZING PHOTO CAMERA!!!", "Author": "Georgi Angelov Todorov \"Georgi Todorov\"", "ReviewID": "R170QJTMAW94UL", "Overall": "5.0", "Content": "I am so happy with my R1 even now there are not a lot of cameras that can compare to R1 since it's not SLR. Clear photos. Over 23000 photos so far and no problems at all. Have this camera for 5 years and it is great for everything I need. I consider my self mid-heavy photographer and just happy and nice moments with this camera. I would buy it again, no doubt!", "Date": "April 7, 2011"}, {"Title": "Marvelous Piece of Photographic Equipment", "Author": "Adam S. Laroche", "ReviewID": "RX43E423G16LA", "Overall": "5.0", "Content": "I have owned my R1 for nearly a year now and I must say that I am confident that I made a wise decision. I debated going the dslr route and decided against it after exploring the R1 option. I found this camera loaded with the features that I wanted and I didn't feel hampered by the fixed lens. The picture quality is outstanding! The lens is sharp and wonderfully bright! There is no fringing or wide angle distorting. The digital crop is very impressive and the live preview (one of the reasons I went with the camera) is a wonderful feature.The bang for the buck that is available with the R1 is quite impressive. I am a very satisfied customer.", "Date": "September 8, 2007"}, {"Title": "Great camera for the money, but is it better than an SLR?", "Author": "D. Schwind", "ReviewID": "R10IBSKO76GPLC", "Overall": "5.0", "Content": "I recently bought this camera as an upgrade from my Sony 8.0 MP 828. This is my third Sony SLR-like camera, with my first one being the 5 MP 717. I upgraded to this one in order to get photos that were as clear and as sharp as possible from the miniature items that I buy and sell.As I found with the 828 when upgrading from the 717, there was a significant learning curve over previous cameras. However, now with my third Sony camera, I've discovered that the learning curve lasts for about a month - then one can start taking photos with good results.The learning curve with the R1 was as predicted. Out of the box, the camera is impressive, if only just in size! It is probably double the weight (or at least close) to a 717, and is probably 25% larger than the 828. The lens is a whopping 67mm - a full increment larger than the 828. The next thing you notice on the camera is the lack of an LCD viewfinder, which Sony took off the camera and placed on an adjustable screen on top of the camera. Quite novel.A quick walk around the camera shows that Sony learned from the cumbersomeness of the 828 with regard to adjustments on the camera and made the R1 very \"user friendly.\" The camera is easy to hold (though heavy) with one hand, and the photographer is able to make the adjustments with his other - definitely making it two-handed operation. It seems that just about everything has a button on the back or side of the camera, and once you learn where everything is, it is easy to change the exposure, etc., with just a quick adjustment.For what I do (and if you're planning to use it for photographing small objects, this is something to keep in mind) the major initial drawback was the focus length of the camera. Unlike the 828, where you could be within inches of the object and shoot beautiful closeups, this camera requires at least a foot, if not more, in order to focus. Once you get it to the right focal length (and after the purchase of a macro filter - a must have) the shots are glorious. HOWEVER, what does a long focal length with detailed photos mean? You MUST have the camera stabilized (tripod, etc.) in order to get good shots. Hand-held detail shots are a no-go with this camera. Also, if you like to take .mpg movies through your camera, you'll be disappointed. This camera does not have that capability.As far as plusses, the camera is super high quality, and is relatively easy to use. The lens is fantastic, and the rest of the camera seems to be as equal in quality. I've gotten used to the LCD viewfinder, and have been able to use it for some great shots that I might not of otherwise been able to view with the fixed viewfinder.I will also add that my wife has gotten quite savvy with this camera, which is a first for her.  She has been able to get some phenomenal photographs, particularly portraits, thus far.  She loves this camera!Would I buy another? I'm not sure. I'm a fan of getting new toys, so I had to have it. However, I think my 828 may take better (or at least easier) close up shots. I must admit that I haven't taken this camera on a road trip just yet to take outdoor photos, and I can only imagine that with the lens and processor that it will be terrific. My word of advice would be: if you HAVE to have the highest-end quasi-SLR, then this camera is for you. Overall, I'm happy with this camera, but I just don't know if it might just be worthwhile moving over to the quality SLRs that don't cost much more than this, such as the Canon 20D. Though I'll happily use this camera for now and am giving it five stars as there are no significant detractors that I have found with it, I believe that my next upgrade will be to a quality SLR.", "Date": "December 3, 2006"}, {"Title": "Excellent DSLR Alternative", "Author": "David J. Leinweber \"Pioneering financial tech...", "ReviewID": "R1567IMWIBQXGY", "Overall": "5.0", "Content": "I've had this about 2 weeks, and agree with the previous entusiastic comments. I'd add that the results with flash on this camera are extreordinarily goodThe lens is excellent, in image quality, aperture and zoom range. I bought the camera after pricing an equivalent set of lenses for Canon DSLRs.The Hasselblad/TLR style waist level viewing option is excellent.The F828 has some functions not found on the R-1, e.g. Infrared capability (nightshot), ultraclose macro (almost touching the lens)  and movies.EVFs are still not up to the level of optical viewfinders in following action in dim light. On the plus side for the EVF, you do get to see white balance and histograms, with a \"zebra\" overlay on the areas of the image that will be overexposed, a fine feature.", "Date": "January 13, 2006"}, {"Title": "Nice camera, great optics, reliable", "Author": "Alex Vox", "ReviewID": "R14LZJ0YN9J1BW", "Overall": "5.0", "Content": "It is difficult to provide an unbiased review on this camera first and foremost because I love it and let me tell you why. As many cameras which are misjudged and mispriced, this camera often get to the wrong hands. And despite R1 came after 828, it would be a classical logic fallacy to say \"after that thereby because of that\".R1 is not amateur's camera, or if it would be defined as one, it is camera for very discriminating, pro level amateur that can do money with photography but simply decided not to. R1 features not nice but exceptional optics. This lens is a story of optical glory of its own rights and it is why you will see it produced as an attachable for new Alpha series. Some time ago, not too long back, if lens of such quality had become available it sparked clubs of funs and endless love confessions.I use DSLRs as much as use to be I used SRLs however to be honest I don't like them. I used as I'm forced, but in general, one produces MUCH better photography with EVFs. There are many people around who will be argue that optical viewfinder provides better view and yes it does, but I'm talking about photography, not about your comfort. You may be shocked and asking why? It is because monitors allow you taking controlled pictures from whole panoply of angles and SDLR or SLR is limited to the eye level. To take picture from ground level with EVF it only takes put a camera on or near ground and look into monitor, you don't have to lie on the ground to see the picture!It is pretty much the same approach as with medium format waist level viewfinders which allow control the picture and arrange composition at right angle to the axis of shooting. Moreover, I think this camera was inspired by Hasselblad: it is substantial, with beefy grip and top notch optics. The top location of monitor, no doubt was stimulated by medium format workflow.I'm not sure how one reviewer managed to compare this R1 to MF camera and find it to be less capable. While comparison of MF cameras to digital is the whole big subjects on its own, let me remind, that digital image is even and mechanics free. It means no scratches, no surface issues, and no granularity and so on. If one wants printing on huge sizes, today's resizing technologies from the kind of quality R1 camera provides will allow printing of any size imaginable and technologically possible.The comparison of \"sharp image wall sized\" is sounding totally irrelevant to me. Ansel, who wasn't a bad photographer after all, printed mostly 8x10. I think we should more strive for a great composition rather than great sizes.As I mentioned, the lens is exceptional and rest of the camera is build around this lens. As new, large (let say relatively large) sensor is used, it increases the focal capabilities and implies bigger, heavier lens which is less capable for macro photography. It is not because Sony had decided so, but because Sony can't break laws of nature. Nevertheless, Sony offers some very capable additional glass that fulfills the requests.This R1 is terrific quality universal camera which will produce nice results on whatever endeavor; someone's knowledgeable hands will turn it. It is definitely camera for photographer, for wedding and portrait professional. Sony emphasized this message by removing video capability from it but the message often wasn't heard. Sony created this camera so great; it had to withdraw it from the market only six month later because it blocked its new Alfa DSLR, as for some $800 you were able to have the same setup as today for some $1300. If you have flare for photography and you need a camera to fulfill any need in general photography it is your camera. Grab it fast, if you can find one.", "Date": "December 12, 2005"}, {"Title": "After a year and a half, still good...", "Author": "Don T \"iMage\"", "ReviewID": "R104E6GS3IYC1X", "Overall": "4.0", "Content": "I pre-ordered this camera from Sony way back in November of 2005. It was shipped to me before Christmas that year. Ever since, I have used the camera as a stock photographer and a family photographer.  The personal photos have been excellent and print very sharp to at least 8.5x11 (though in Photoshop the linear dimensions are poster size).Unfortunately, the main failing has been in the color noise and artifacting for stock photography. Because I do not use a tripod for on-the-fly outdoor shots, I have gotten used to either spending hours with Photoshop fixing the \"purple fringes\" (also cyan and red shifts) or just submitting the full-sun shots and hope the inspector will tolerate a bit of color noise for the shadier areas.The lack of any image stabilizing process (as the newer Sony/Minolta cameras have) is the major problem. Because my acceptance rate is less than 50%, and the most common reason given for rejection is color noise and artifacting, I'm waiting for the release of Canon's new DSLR (the 40D?), which might or might not have the same MP resolution as the Sony DSC R1, but it's a true SLR with image stabilization. For prosumer use, therefore, the R1 is not adequate because of its lack of in-camera image stabilization.Nonetheless, the built-in flash is bright enough for most medium- and close-range use (especially since it's positioned right above the lens, minimizing the outline shadows where the flash is offset), the focal range goes from wide angle to medium telephoto, the Sony tripod with remote control works fine with this camera (if you can tolerate using a tripod), the memory cards in 2 formats (MS and CF) allow for great utility (e.g., in-camera backup), the interfaces are handy (I back up in the field on an iPod 80GB), iPhoto runs fine with the R1 connected, and the camera's fake shutter sound can be turned off for absolutely silent candid photos (especially since people don't realize that you're focusing using the top-mounted LCD viewfinder). The diopter adjustment of the optical viewfinder can be set precisely.Not so nice is the placement of the hot shoe for the external flash to the right, above the grip/battery compartment. The shadows cast are dense and distracting, although the Sony smart flash works extremely well. Also, I have lost 2 Memory Sticks and 1 Compact Flash card--all 2 GB--until I read on the web the recommendation that memory cards should be formatted by the camera rather than by a computer. I did that with one card which I eventually filled with pictures of our first grandchild (a couple of hundred photos), when the camera suddenly showed \"Format Error.\" I couldn't get a professional recovery company to rescue anything, even when I said they could open up the card to get inside, voiding the money-back guarantee. So...I've been deleting pictures one by one, using the camera itself (very tedious), rather than having the R1 or my iMac do the re-formatting. (A couple of e-mails to Sony resulted in polite replies, but no action.)Another limitation of the R1 is that it is hard to protect it. The Sony hard-leather case is so strangely shaped that putting the cover on and taking it off take too much time for field use. So I use the camera without  the rather costly leather case I bought from Sony.The LCD viewfinder, being on top of the camera, puts off subjects who are in groups waiting for their souvenir photo because they think you're adjusting the camera instead of composing the picture. So I find I use the optical viewfinder most of the time, especially with the superimposed grid to help me align vertical and horizontal planes. I do wish that Sony had provided some kind of bellows hood for the optical viewfinder. In bright sunlight, the LCD viewfinder is hard to see, and the bright reflections in the optical viewfinder requires me to wear a baseball cap or use my hand to shade it.The self-timer (with camera on a tripod) is excellent--people can be warned that the amber light will flash slowly when the self-timer is on, and will flash rapidly just before the shutter trips. Still, if I have forgotten to turn on the audio shutter sound, people stand there for a few seconds, not realizing the photo has been taken.After a year and a half of using this camera, I am very glad I had it as my starter camera for semi-pro photography. And I still have another year and a half to go on the service/repair extended warranty I bought and have not needed. But I'm saving money to take a step up, perhaps to a true SLR from Canon or Nikon.", "Date": "August 19, 2007"}, {"Title": "Awesome", "Author": "M. Collins", "ReviewID": "R30NZM0V3QEWL9", "Overall": "5.0", "Content": "I have owned the 505 and 707, both excellent cameras.  The only shortcoming in comparison is the macro ability, but you can buy a Sony macro lens to fix that.  The viewer is excellent, the memory stick is fast.  Flash regeneration is incredible and battery life is superb. It may be heavier than the 707, but it doesn't feel like it.  I do miss the moveable lens as I used it to shift the balance when I wore it strapped on my neck.", "Date": "December 12, 2005"}, {"Title": "Sony Digital Camera DSCR1 10.3MP", "Author": "D. A. Read Jr.", "ReviewID": "R7WNRJWHI4HJK", "Overall": "5.0", "Content": "Excelent Photo Qualities, great detail on large prints.  High quality lense, from wideangle to telephoto shots as simple as point and shoot. Manually ajust F-Stop and Shutter Speed for Field of Depth or Stop Action Shots.  Everything from Metering to a grid viewfinder to make profesional photography simple.  A major name brand body alone would cost three times as much for the 10.3MP format.  A great camera.", "Date": "July 27, 2006"}, {"Title": "I would Love to own.... but", "Author": "S. Prince \"photofreak\"", "ReviewID": "R1H15QNN4LAD4Z", "Overall": "5.0", "Content": "This a great cam. No doubt. I would buy one today, but there is no support for this cam in the area of camera raw opening software. I use photoshop, but ps won't open the raw files of this cam. I use Raw Shooter Premium '06, but no support for this Sony cam. Bummmer. If support arrives I will buy instantly. No support at the above companies, and no reasons why there is no support. If you can live with the Sony software included you will be very happy with this cam. Else..... wait.", "Date": "February 9, 2006"}, {"Title": "Another legend from SONY", "Author": "Rocky \"rakish\"", "ReviewID": "RCRA2SOK85HXB", "Overall": "5.0", "Content": "After I owned and satisfied using Sony's F717, I decided to buy DSC-R1. It is absolutely a legend. It's all function users friendly and easy to care. (little bit heavy particularly while using with ext. flash and ext. lanes)  The shot taken by DSC-R1 look you as professional photographer even you are new born. You don't have to be pro to use this camera, just need to afford one grand.This is truly a great camera in the range. Only thing, you feel stretch when you need to buy its accessory like ext. flash which I recommended must. The wide conversion lanes and filters also the great choice to attach with this monster.", "Date": "February 15, 2006"}, {"Title": "Just a Mom who wants to take good photo's..", "Author": "Deborah R. Saraceno", "ReviewID": "R1AGVIQ2C2D16D", "Overall": "5.0", "Content": "This camera is the best thing i've ever invested in..Crystal clear photo's easy to operate and fun to shoot..I even bought an extra battery and fast action soccer photo's are fantastic..buy it..you will love this camera..video's are awsome too..oh yea the disk that organizes you film is supurb..enjoy..", "Date": "September 22, 2008"}, {"Title": "Never Buy Sony Product.", "Author": "Spinning", "ReviewID": "R1EBR2IC4A1ELM", "Overall": "1.0", "Content": "DSC Series camera all have a CCD imager defect that will leave screen blank after you use the camera for 2 or 3 years. (Do a google search. You will find out what happened.) Sony knew this problem years ago. But refuse to fix it. They will wait until the camera fail and then charge you $300 to fix it. That's what happens to my DSC-F717. Ever wondering why Dell, HP etc all recall Sony battery for laptop, but Sony did not recall their own laptop battery? Sony will never fix their own problem. We the customer have to pay for their mistake.", "Date": "November 3, 2006"}, {"Title": "ok camera", "Author": "Tracy Gullion \"iluvcheez\"", "ReviewID": "R1F112ZU3P2DKD", "Overall": "3.0", "Content": "a little disappointed with this camera. It is an ok camera, but for this price it was a let down.it takes a while to get used to all the features. You change one little thing and it drastically changes the shot, and you cant figure how to get back. when you place it back in same position, you meter still isnt right. white balance.... cant figure out how to customize it. ahh wellI really got it for the night shot featured on other sony cameras, but silly me, i mustta overlooked the fact, that they discontinued that on this model, HUGE let down. .looking to trade it up already for a f828 or a Nikon.", "Date": "February 4, 2006"}, {"Title": "High quality for a semi pro", "Author": "G. Salinas \"GS\"", "ReviewID": "R2ESW5T2BQN78A", "Overall": "5.0", "Content": "This is a great product for anyone. However it lacks certain features that will be demanded by pro's such as a better multi shot feature.", "Date": "February 27, 2006"}], "ProductInfo": {"Price": "Unavailable", "Features": "10.3-megapixel CCD captures enough detail for photo-quality 18 x 24-inch prints\n5x optical zoom; 2.0-inch vari-angle LCD display\nLive preview using Sony's Complementary Metal Oxide Semiconductor (CMOS) technology\nThree color modes and RAW capture\nRecords images on Memory Stick PRO and Compact Flash Type 1/II media; powered by one NP-FM50 InfoLithium battery", "Name": "Sony Cybershot DSCR1 10.3MP Digital Camera with 5x Optical Zoom", "ImgURL": "http://ecx.images-amazon.com/images/I/51SCBZKW2YL._SX300_.jpg", "ProductID": "B000B68I2K"}}