{"Reviews": [{"Title": "Best compact camera", "Author": "John Smith", "ReviewID": "R1T6NQNLUX62KY", "Overall": "5.0", "Content": "I bought this to replace SD400. I thought SD400 is perfect, and the perfect just got better. Here are the highlights of my opnionPro (Common with the predecessor SD400)* Superb image quality (this is also agreed by dpreview.com). Image quality is not just mega pixel, but also the clarity and sharpness. Canon cameras produce less \"noise\" than other brand. In case you don't know what noise in photography means, it looks like random sand grain on a low-light photo* FAST! Much faster than Sony (turn on, shoot, and zoom)* Despite its small size, it has many shooting modes (e.g. portrait, night), including manual* It can stand on a flat platform for a timed self portrait (some super compact camera can't)Improvement from SD400* 2.5\" screen as opposed to 2\"* Timezone feature. Now it is easier to set the time when you travel. No need to wait until the 0th second of the next minute to press OK.* Guide line option. When enabled, you can see the screen divided into 9 equal rectangles. It is particularly useful when shooting geometric object (e.g. a painting at a museum)* It tells you the shutter speed when you half-press the shutter if longer than 1/60 seconds. This is useful information under low light.Cons* Movie files are not compressed enough", "Date": "October 6, 2005"}, {"Title": "A FEW SMALL ANNOYANCES", "Author": "Liam H Dooley", "ReviewID": "R2YXDZASOKJHC6", "Overall": "4.0", "Content": "I recently bought this camera as a replacement for my worn-out Pentax Optio S50.  Overall, I have been pleased with the Canon though it has a few little problems.Pros:-Very rapid turn-on and shoot time (about 1 second)-Short time between shots.  There is a feature that you can select where you can hold down the picture-taking button, and it takes one photo about every .5 seconds until you release the button.-Good control of manual features; you can take photos while using the function menu.  The menu is displayed on the side and bottom of the screen.-Optical viewfinder.  One of the biggest reasons why I bought this camera was because it had an optical viewfinder.  Most very portable cameras do not.  Optical viewfinders are not for everyone; they are basically only good if you take a lot of photos and you worry about the battery.  Obviously, buying an expensive spare battery negates this issue.-Nice movie features.  Even though it is not MP4 so the compression isnt great, the movie works great.  On the issue of compression, storage capacity is getting so cheap anyway it doesnt matter; i dont think anyone needs to be filming 1hr documentaries or something.  Anyway, there are two movie settings: the 30 fps is fine, and you can zoom while filming.  There is an even better (though more space-using) 60 fps for faster subjects.  One nice thing about the video is that you can still do different light settings; and in fact the camera adjusts light settings automatically.-Small. As small as any other compact camera, though the lens extends unlike some other ones.-Buttons work well.  They seem to be in the right place, press well, and just feel very good.  Some cameras have very annoying buttons.Cons:-Battery level unknown; I havent figured out how to know how much more battery life I have left.-Night settings TERRIBLE.  This is probably my biggest problem.  If you use either the autocamera settings or the night photo settings, they simply do not work.  You need to manually adjust the ISO and Exposure level.-Manual settings a pain.  When you change a manual setting they stay that way; there is no reset.  so you have to go through all of your manual settings to figure out what you have.-Zoom a pain.  The zoom function is clunky and inexact.  You spend a lot of time trying to get the zoom level you want.I can't say this is the best camera out there; obviously, there is no perfect camera, it's just a matter of picking what strengths you want and accepting whatever faults you can.", "Date": "November 6, 2005"}, {"Title": "amazing!", "Author": "Alex Liston \"Music Lover\"", "ReviewID": "R1BRN7FKZCPU30", "Overall": "5.0", "Content": "This camera is amazing! I would recomend it to anyone that wants a great camera for a great price. Overall, the cameras pros highly outweigh its few cons.Pros-Easy to operate-Small, compact size and it looks great!-Big LCD screen at 2.5\" It seems so much larger than the SD400's 2\" screen. 1/2 inch really makes a difference!\"-Takes photos quickly, sharply and accurately-Great photo quality at ISO's under 200 (400 max ISO)-Many different scene/shooting modes that are usuful for all kinds of moments-Videos look greatCons-Grainer images at ISO 400, although it's not bad-Flash can be overpowering at times-Video files are very largeObviously this camera's ability to funtion and take great shots is very high, and as you can see, this camera has few things that are dislikable. I would recomend this camera for any person, regardless of age or experience. It's a great camera, and wheter you want to take artistic shots or take pics of family and friends, I would recomend this camera over any other.Also, check out my customer images to see this great camera in action!", "Date": "November 11, 2005"}, {"Title": "Perfect Fit for the Amateur Photographer!", "Author": "Elton Pinto \"Eptiger\"", "ReviewID": "RR3U1TAVRMIC6", "Overall": "4.0", "Content": "I wanted a digital camera for years, but kept myself restrained to a budget until I saw this on sale and decided to order it. I've had it for over a month now and I love it. Know how you buy a new toy and you're really excited about it until it finally comes in and then you kind of forget about it? I'm still really stoked about having it because it's just that fun to use. Owning it actually inspired me to learn a lot about how to take pictures properly.Pros-Small and stylish will be sure to turn heads-Strong metal body so that it won't break should you hit it against a wall or drop it-EASILY fits into your pocket-The 2.5\" screen is gorgeous and the size is just right (it can get super bright should you need it to)-Software couldn't be easier to use (it'll even rotate your pictures that are vertical automatically in the browser, and you can set it to save these rotations)-The gimmicky extra modes are super cool (color accent to make everything b&w; except for one color, color swap, positive film, etc)-Surprisingly little noise at ISO 100 and ISO 200 (at least in the instances where I've used them)-Very simplistic navigation on the camera with very few buttons to confuse you and nice little pictures on them-The panoramic picture mode makes taking wide shots really easy-It can go pretty fast, which means that you won't miss the moment you really want to capture (especially if you hold down the shutter button halfway to focus it ahead of time)-It comes with an A/V cable right in the box, which is better than what most cameras tend to provide, and the slideshows that are built-in for you to show family and friends is real nifty-Pretty much perfect for the point-and-shoot photographer who wants something ultra portable-When you rotate the camera in playback, it'll rotate your picture view as well!-Flash is too obvious on the picture if the object is too close to you-Unbelievably sharp photos with very little fringing, particularly in natural light and outdoor environmentsCons-Could use some more manual controls (I wish I could control the shutterspeed)-There is no battery life indicator until you only have a few exposures left on the battery, though it's supposed to last 150 exposures (I haven't counted, but that sounds about right)-Red eye, which is a problem and each and every ultracompact digital camera out there-Movie mode sometimes a little grainyFalse Cons (where I disagree with others)-It's really not that bad for night shots if you know what you're doing as I've taken several good ones at a night concert I went to; you may not want to use the night snapshot mode, but if you go into manual and fiddle with the exposure value and up the ISO you can get pretty decent brightness out of it-Manual settings are pretty easy to use and discern since they all  appear right on the screen without having to scroll around-Movie files actually do compress rather well-It's pretty good for moving photos if you just hold the shutter button halfway since then it'll go faster and it'll tell you if you're shaking (you can also hold it closer to your body to reduce that, or just get a portable tripod)-That guy who complained it's too slow just didn't read the manual because obviously he didn't hold down the shutter all the way, I've almost always had extremely fast capturesI would recommend getting at least 512 MB memory card. I delete pictures off of mine when I don't care much for them later on and just keep the stuff I'm willing to show other people, and I still haven't reached the limit of my 512 MB memory card's memory. You should definitely get a case for it, I got the PSC-90 and I think it's great (only protects the camera though, no extra storage, but very stylish). DEFINITELY buy a screen protector for the LCD, and don't cheap out on it because the screen is pretty sensitive and a scratch on it would likely pain you to see. You may want to invest in an extra battery pack as well, though I haven't.In sum: not perfect, but after doing some research, I stick by this being the best ultracompact on the market, and perfect for point-and-shoot amateur photographers like myself. I'd give it 5 stars, but I have a few cons that I'd feel guilty to let go of and give it 5 stars. I'd prefer 4.5 stars, but oh well.", "Date": "April 27, 2006"}, {"Title": "Canon Powershot SD 450", "Author": "Digital Photographer \"Used to Like Nikon,s\"", "ReviewID": "R3NIT0A3PRDUWG", "Overall": "5.0", "Content": "This is a beautiful little camera, images are great, easy to use, a sheer joy.I looked at the 550, but thought it was bigger than I wanted and 5 MP is fine ,sooo, it was the 450Am using a SanDisk 512 MP II card, the camera is lightening, images are wonderful, the instruction book is fairly good, I just got it last night, took over 100 pictures today, we had a really nasty fog here in NYC, the 450 captured it beautifully.I have seen some remarks about short battery life, I used the lcd for half of the pictures and shut it off for the other half, battery still hot.Alot of these cameras with large lcd displays do not have an optical viewfinder, if you shoot with the sun in back of you, the screen is impossible to see, not with the Canon, use the optical viewfinder, a few others have done this, but Canon has the best one, I wear glasses and have no problem seeing thru it.ok, the pluses, allnegatives, none", "Date": "November 15, 2005"}, {"Title": "Great pocketable camera", "Author": "Richard J. Wagner", "ReviewID": "R2PXIOFI9HOR9M", "Overall": "5.0", "Content": "I got the Powershot SD450 as an easily pocketable replacement for my 3-year old Kodak camera.  I also considered the SD550, but the SD450 is noticeably slimmer and lighter.  The 2.5\" LCD is impressive and mine is still scratch-free after a week in my pocket without a case (just keep it separate from keys and coins).  I like the quick startup and the battery has been fine in my use -- a few dozen pictures per day plus some review.  The camera has a nice feel in the hand and unlike some other small cameras the buttons are reasonably sized.  Just a couple of minor complaints: the autofocus beep cannot be turned off without silencing all of the camera sounds, and I wish the flash could be disabled by default rather than needing to be changed each time the camera is turned on.", "Date": "November 8, 2005"}, {"Title": "Survived two-months of abuse while backpacking through Europe...", "Author": "Dane Gardner", "ReviewID": "R1COEUJKJJ7YCX", "Overall": "5.0", "Content": "First I should qualify myself.  I've taken three years of photography in High School and College... I've got a 14\"x14\"x20\" box full of just negative film, and a 250GB hard drive nearly filled with 3.2mp and 5mp pictures.  I've done photography for friends (or friends of friends) weddings, birthdays, etc.  I'm by no means a professional... but I do know what I'm doing.Three days before I left on a two month trip to Europe I impulse bought this camera [Canon's SD450] because it was much faster than my JVC Everio MC500.  While the JVC takes great 5mp pictures as well as DVD quality video... and is absolutely tiny... this camera did far better with focusing, night-shots and above all... speed.  My JVC takes 13 seconds to start up for both photos and video... whereas the Canon SD450 takes less than two seconds to go from pressing the power button to being able to take the first picture.Half way through my trip I ended up sending my JVC home; I just never used it... but I took over 2800 photos (all of which are on my website if you want samples) using the Canon... and some of them are wall-hanging quality.  The biggest reason why I love the SD450 is that I can pull it out of my pocket, turn it on, adjust settings, and take a picture within 5 seconds.  Some of the best candid shots I've EVER taken were with this camera.And once I figured out how to do long exposures (didn't bring my manual) for my night-shots... it opened up a whole new world.  It takes AMAZING night shots with a lot of color depth.  I'm used to using film at night... but this camera has convinced me that CCD technology has finally progressed enough to allow for lower light levels!  I think I'll ditch the JVC, and my next purchase is going to be the Canon Rebel XT.  Canon rocks.", "Date": "January 18, 2006"}, {"Title": "Great little camera!", "Author": "Maximum", "ReviewID": "RQ4Y727CD16KX", "Overall": "5.0", "Content": "I got this as an upgrade to our SD300, which is also very good. The main features I like are:-Large LCD: this is great for the kids as they like to watch themselves right after filming.-Movie mode: seems quite good, especially for such a small camera.-Form factor: very small and portable. Fits in any pocket. Well, maybe not that little pocket within a jeans pocket. Any normal pocket though.-Solid build: seems a little better than the SD300.-Picture quality: I take mostly snapshots at 5x7. Sometimes 8x10. For these sizes it does a nice job. Even the macros seem ok. If you want higher quality you probably have to get a bigger camera.-Included software is also very good.", "Date": "September 28, 2005"}, {"Title": "Best Camera in the 'compact' segment!", "Author": "H. K. Shah \"Harry Shah\"", "ReviewID": "RECC6UR6E884U", "Overall": "5.0", "Content": "I have always been a big fan of Canon cameras for their awesome picture quality. This camera did not turn me down either.Firstly, I was looking for an ultracompact/compact camera, and I was almost going to buy the Sony DSC T-9. I read several reviews online and a lot of them were very encouraging. That camera is smaller than this, however I opted for Canon because of the following reasons.Sony DSC T-9 does not perform equally well in night-light as the Canon SD450. Also, it does not have a viewfinder which is definitely useful as one of these days you are definitely going to remain with low battery and some precious pictures to take. Also, to me, buying the Sony camera would mean not just high initial cost but also high lifetime costs. It's got its own proprietary (data + audio-video) cable, which if I lose it will be a problem replacing it. Plus, the memory stick pro duo media is expensive--I would end up spending lot of money for these cards.Canon on the other hand was cheaper by 100 bucks, SD cards are cheap and the data cable used by Canon cameras is one of the most data cable in the market. Now, let me evaluate the Canon camera after taking about 200 pictures with it.Let me tell you I am just an amateur point and shoot camera enthusiast. I wanted a compact camera so that I do not find it embarassing carrying a big camera all the time, and (my girlfriend says I am very hyperactive about taking pictures) I should have a camera in my pocket which I can take out in a second and capture those precious moments. Compact cameras will always have the 'shaking' problem and a not-so-strong flash. Yes, this is what I get with my Canon too, but given my ultracompact requirements, I would say this is the best camera for the price and features in the market. (Plus, Canon picture quality always rocks!)The cool features I enjoyed were: The Burst Mode: I was able to take about 12 pictures in 7-8 seconds in the burst mode (using a Transcent 80X SD Card). I like taking pictures of me and my girlfriend (holding the camera towards us on my own), and the burst mode proved quite useful.The One Color mode: This is a fantastic feature. You can swap colors, or you can pick a color, and the camera will only highlight that color and leave the rest of the picture black and white. This is a very cool feature and you will enjoy playing with it.Plus, there are several other modes, and I used the Beach mode while I was in Virginia Beach and the pictures came out totally fantastic.On the negative side, the buttons on the camera are very small, because the LDC is 2.5\" (which is great!), and it is a small camera. Anybody with even slighly big fingers will have problems in navigating through the menus using the small buttons. Also, since it is a small camera, for certain modes the 'shaking' problem will exist--and the camera gives you a red blinking icon on the screen when the camera is shaking or the settings are not good for the picture. So, you do know before taking the picture itself that it's not gonna turn out to be good. Other than that, thhe camera is cool.Overall, this is a great buy and trust me, I researched all over the internet to buy a good camera, and I am happy with my choice (considering I wanted to go with a small size camera only). If you are fine with a bigger size, consider Canon S80--it will not disappoint you. And beware, there are several online stores which will offer you the camera at a cheaper price but when you look at seller reviews from independent websites you will get to know the real picture and sad stories about how people ran into problems with their purchases.Also, buy a high speed SD card. Using the Canon software and my 80X SD card, the pic transfer from my camera to the computer was extremely extremely fast.", "Date": "April 17, 2006"}, {"Title": "Luvin' it..", "Author": "RiseY3K", "ReviewID": "R3A4THK5JTJGCA", "Overall": "5.0", "Content": "I bought this camera for normal day to day events, like going out camping, skiing, to the ocean, vacations, casinos, concerts, graduations, sports, parties, etc in mind. The things that sold me to the camera was the fact that it:- Tiny (fits in my pocket)- Big LCD (see what I am shooting)- Great resolution (need that, easily print superb 8x10 pictures)- Rechargeable battery (will save me money in long run, battery life depends a lot on how much you use your LCD, flash, etc... Alkaline AA battery runs out juice fast.  The battery the camera comes with can take up to 150 shots, even though I've never used it to a point where it's fully dead)- Instant on (can take a picture under 2 sec)- Video recorder (even tough I don't plan on using it as a video camera, its good to know its there)- Easy to use and navigate, self timer- Continuous multiple shots (take continuous multiple shots within a fraction of a second. I found this to be really useful, when taking a group picture, in a game, or a moving object)- Uses SD Memory Card (due to its heavy acceptance in many electronics, SD Card can have multiple uses, and are cheaper and easier to find)I did look at many other camera's including sony cybershot's, casio exilim, HP's M series, etc... wasn't sold to it, either they weren't priced right or didn't have one or the other feature.Overall, I think its well worth the price (I paid $349 for it, but now with a $50 price break to $299 it's a steal). So if you are like me, don't really know a lot about digital cameras, besides the basics, and just looking for something that is sleek, compact, easy to use, and takes a great pictures, I would recommend the Canon SD450.", "Date": "March 10, 2006"}, {"Title": "Small and sexy but big on performance!", "Author": "AmazonDiva \"Keep Calm and Carry On.\"", "ReviewID": "RUN2OGL9XSYA5", "Overall": "5.0", "Content": "I love the SD450 but I must admit I am partial to Canon as I have been using Canon cameras (both film and digital) for the longest time. This is my 7th digital camera from Canon. I have another camera which I use currently - the S2 IS which I bought to try my hand at some creative (hopefully!) photography. But the S2 wonderful as it is, has not been used as much as my earlier powershots  given its size and its inability to fit into my little purse. So after having lost some great photo ops at parties, evenings out and impromptu get togethers I finally wanted a camera that was tiny enough for my evening bag but still allowed me to get creative.This camera took me the longest time to buy as I mulled between a Sony for the first time, and a Canon SD 550 and the SD450. I read dpreview (greatest site if you're looking up digital camera reviews), Steve's digicams, Cnet and all of those sites looking for the perfect tiny camera. I was leaning toward the SD550's 7 mega pixels till I took a couple of trips to the electronics stores and held the cameras in my hands. What a difference it made. The SD550 was thicker and chunkier and the curved edge made it slippery and everyone seemed to have them in the yucky gold color. So despite the megapixels the SD450 felt just right. I even considered the SD400 as I wasn't too partial towards the bigger screen of the SD450, but the added software enhancements in the SD450 were nice and the price difference between the 400 and 450 was very small at the time I bought it.PROS:Size- really small, a little bigger than a visiting card and great looks, steel look cover for the A/V digital out (not your usual canon rubber flap), feels great in hand. Sexy, sexy!For such a small camera the pros are that the SD450 has an optical view finder and an optical zoom (as well as a digital zoom). It has an intelligent focusing system AiAF which can give some pretty good results on auto mode.In addition to the auto mode it has the manual mode, potrait mode, night mode, macro mode (which is great!), scenery mode and the scene mode which goes into the different scene modes. You can also get to the panoramic mode thru the menu to shoot city scapes or rolling mountains in a series of shots. It's really easy as you can view your older shot in this mode while you take the new one overlapping the older one. The provided software will 'stitch' your shots into one when you upload them.It has the usual Canon powershot options of different scene modes  -Kids and pets, foliage, fireworks, snow, underwater, beach, indoor so that you don't need to think about settings. Very convenient in a point and shoot! The newer My colors option allows you to choose a color you want to highlight or darken and lighten skin tones. It also allows you to capture only a particular color in a shot while the rest of the picture is black and white. So you can do a black and white potrait of your child with a red ribbon or red ball. Or you can swap out one color with the other, it allows for some creativity in your pictures.You can also take videos with this camera in .avi format and edit them on the camera. And you can create a slide show of all the images you took on the camera itself with fancy transition effects of your choice. The zoom button shows one or many images at a time in the replay mode and you can zoom into each individual image to see parts of it closely.In the manual mode you have the option to set white balance and your color tones to black and white, sepia, vivid, neutral. You can also change the metering (spot, center weighted, evaluative) and get the long shutter mode through the menu.There is self timer function as well as continuous shot function for rapid shooting.The coolest thing about the LCD is that as you rotate the camera the potrait pictures will automatically rotate to fill the screen. It's like magic!Battery charger is separate so you can charge a battery while you're using one. And it works from 120V-240V in case you make any foreign trips.Cons:Flash can be too strong for close-ups (in auto mode, in manual mode you can adjust flash or change metering options) and bleaches out color.Large screen is great but drains the battery quicker and more prone to damage. Buy the protective stick on sheets, it's a good investment.You cannot see battery power remaining at any time. So it's a bit of guesswork to figure out if you need to recharge.Overall this camera beats others given its size, features and performance at it's sub three hundred price tag!", "Date": "March 14, 2006"}, {"Title": "Great Little Camera and Mini Movie Studio", "Author": "J. Vierra \"Joe\"", "ReviewID": "R3K90YDXLMLIF7", "Overall": "5.0", "Content": "I bought the Canon SD450 mainly because of the 60 frame per second movie mode.  I've been shocked at how good this little camera is in all respects.  The compact size of the camera makes it easy to carry all the time.  I carry it with me when I go to the driving range or out on the course playing golf.  The high speed 60 fps 320x200 movie feature is really great.  The size and quality of the LCD screen is amazing given the size of the camera, and the built in movie clip viewer/editor is astonishingly functional and fun to use.  You can play your golf swing back with variable slow motion speed and even single frame forward and backward.  Very useful if you want to improve your game or just have some laughs.  The experience of examining a video frame by frame is much easier on the camera than it is on a PC.  Also, the quality of the 640x480 30 fps movie mode is amazingly good.  I used to wonder, 'should I bring the digital camera or the miniDV camcorder, or both' -- with quality of the videos you can shoot with this tiny camera, who needs a camcorder - just bring the SD450!  A $55 2 gigabyte SD card will hold 16 minutes of high quality video, more than enough for most casual uses.  The still picture capability is also surprisingly good - it's difficult to tell the difference in photo quality from my 4 times larger Canon S45.  Overall, it's an amazing package of functionality bundled in a small package for a very reasonable price!", "Date": "April 29, 2006"}, {"Title": "Wonderful Camera!", "Author": "All-Smiles \"Elizabeth\"", "ReviewID": "R278XFTVS4QYH", "Overall": "4.0", "Content": "This is definatly NOT just a point and shoot camera. So if you are considering this camera for your 1st it might not be the best choice. For those who are a little more advanced or just have used a DC before then GO FOR IT! It has tons of features and the autofocus is awesome. From the, oh, 16 or so, instruction booklets you get it may seem complicated but all you REALLY need to do it try it. It's mostly self expainitory and I only use the manuals for questions about certain features or tasks.Pros:- 2.5\" LCD Screen- 14 scene modes!- Optional all-weather case turns the camera into Underwater Camera, which is too cool. >:D- Software to print and edit photos and make movies onto DVDs which is awesome for sharing and having fun w/ your photos and movies.- .5 a second Shutter speed. Totally fast and catches those action moments.- Timed Portrait Option- the night mode is fantastic! all of my photos came out like I had taken them during the day.- The battery lasts FOREVER!- It's so small it can fit ANYWHERE!Cons:- No battery indicator so if it does run out it surprises you.- Video Files are very large so if your comp can't hold much they clog it up.- Flash can be over-powering at times but its fixable-The Memory chip hold 9 photos. 9! So I URGE you to invest in a larger chip.Other than that I am in love with it. If you have the chunk to spend I think it is completely worth it. Though you may want to look into getting these accessories:- The waterproof case, it is a little expensive though- Memory Cards- A carry case3 nessecary, well sort of, things.Hope I helped!", "Date": "February 5, 2006"}, {"Title": "Good Pictures, But Fragile", "Author": "R. Bidwell", "ReviewID": "R1K679VOZOXXAC", "Overall": "3.0", "Content": "Bought SD450 through Amazon.  Good price, but even in the Canon case (sold separately), I managed to break the LCD window in the back within two weeks.  I am an advanced amateur photographer, and even having been aware (through other reviews) that the LCD was a weak point in the camera, I thought with the stiff leather carry case it would be okay.  I was wrong, and the camera is now in repair. I don't know yet if Canon will honor the warrantee, or if the weakness of the LED window (fragile) is ubiquitous, but I do know that Canon has gotten many of these cameras back for the same reason.Bottom line:  If you get one, make very sure you protect the window from any impact, including in purse, fanny pack, or in the leather case.  I further was disappointed that given the fragility of the camera, Canon does not include the carry case with the item.  Would I buy Canon again?  Probably.  I have a PowerShot A70 that has done good service.  I was looking for a more compact and more advanced camera. The SD450 is all of this, but the vulnerability of the window to minor impact breakage is a definite downer.", "Date": "June 9, 2006"}, {"Title": "2.5\" LCD Screen + Small Size = Great Travel Camera", "Author": "Todd Taylor", "ReviewID": "RQ6SS7V4LJ8IY", "Overall": "5.0", "Content": "I do a lot of traveling in cities as well as backpacking and mountaineering out in the middle of nowhere.  The great 2.5\" LCD Screen makes it easy for me to frame the photo, particularly if its quick shot where time is of the essence.  The shooting modes and manual modes allow me to photograph any situation from snow, water, indoor, mountain scenes, macro all the way to fast movement of an air show.  Size is great if you just want to keep it in your front pocket or warmed up in your Mountain Parka.Highly recommend this camera to anyone that wants great quality without the size.", "Date": "November 1, 2005"}, {"Title": "Going digital", "Author": "Mita \"Mita\"", "ReviewID": "R1V5WGZ0UZLG23", "Overall": "5.0", "Content": "I never liked any digital cameras I saw in the under $400 price range until I saw someone with the SD 450. I loved my Pentax point and shoot and rather scanned my pictures then to mess with the tiny bad screens and complicated menus. When I saw this little camera with the big screen I was suddenly interested and after reading a lot of reviews I bought it. The menu is easy to use (even for a first time digital camera user)- a great mix between manual and auto options, and the big screen makes it easy to see in any light.I immediately bought a 512MB memory card, a plastic film to protect the 2.5 inch screen and an extra battery. All three things make it just plain fun to use my great little camera. I can recommend it to anyone who wants to take their camera every where, and who is not really interested in making poster sized pictures.", "Date": "December 3, 2005"}, {"Title": "Compact .....plus a surprise!", "Author": "Canalien \"John\"", "ReviewID": "R1DEAIMI7A625", "Overall": "5.0", "Content": "I waited a while before deciding to purchase a digital camera and although this was my first serious purchase it turned out to be well worth it.  The main thing I was looking for was portability.  I wanted a camera I could easily carry in my front pants pocket but didn't want to sacrifice quality.  This camera did that and more.  It is very sleek and heavy for its size but feels solid and expensive.  I dropped it onto concrete the first time out of the box (while sitting) but amazingly there was no damage and everything worked fine.  I would recommend attatching the included strap to the side of the camera if for nothing more than to have something to grasp if it should happen to slip from your hands.  The manuals were very informative however, I am impatient and didn't want to read a book so I chose to read the precautions and getting started sections and give it a try.  The camera is very user friendly but it helps to have more than just a basic knowledge of photography.  It has a perfect blend of manual and auto adjustments enough so that I don't have to worry about things like f-stops and aperture settings; not with a pocket camera.  Sure, it has a learning curve but what decent camera doesn't.  Instead of being a pain it is actually fun to discover its' abilities.  While I was impressed with the clarity of the photos (even at night or in macro mode) I was shocked to see the quality of the movie mode.  Personally, I would never even consider the movie mode of a digital still camera since for a couple hundred more you can purchase a decent movie camera but this camera has a very impressive, albeit short,  motion capture quality.  Good enough to do some minor editing and then viewing on your television.  I have a 512 MB card and I can get about 5 minutes of video at 30fps with zooming capabillity.  I will be looking to purchase larger capacity cards now.  What a pleasant surprise.  Besides all that, the charger is even smaller than the camera and although the battery doesn't last very long if you leave the LCD on all the time, it doesn't take long to re-charge..under an hour I think.  My only gripe is that I wish there were some kind of protective cover for the LCD as it is prone to scuffs and will easily scratch if there is ANYTHING else in your pocket along side it.  I keep mine in a thin suede pouch which doesn't add the bulk that some others do.  The only type of people I would not recommend this camera to are people with large hands, as the controls are quite small, and those who demand more control over manual settings, in which case the digital SLR's are the natural choice but are geared more towards prosumers willing to pay 2x - 4x more or higher.  Other than that, I would recommend this camera to everyone else.  I love it and take it with me everywhere and if it wasn't so small I wouldn't forget that it's in my pocket sometimes..its just amazing.", "Date": "December 19, 2005"}, {"Title": "excellent besides lcd", "Author": "S. Kajpust \"magicalstephie\"", "ReviewID": "R1DHM4PSIPGKP", "Overall": "4.0", "Content": "This camera is awesome!  The features are great, especially the \"My Color.\"  I love messing around with it.  If you want to read the pros, read the other reviews.Here is the one con that I have found:I have had this camera for TWO days and the lcd screen is already damaged.  I had read the reviews warning about that, so I made sure to have nothing touching the screen.  This is not enough, because I managed to damage the screen just by grabbing the camera and carrying it with someone else in my hand.  It's not a huge spot so it's still usable, but I really recommend a case and being SUPER careful because it can get damaged even just by carrying the camera.  Canon would be smart to recede the screen some and make a glass cover for it so you can't damage it.Besides that, I love the camera.", "Date": "March 6, 2006"}, {"Title": "Awesome Camera", "Author": "KB123", "ReviewID": "RUC3XJZ0XUODJ", "Overall": "5.0", "Content": "While searching for a camera to buy, Canon was highly recommended.  After doing some research on a few cameras, Canon seemed to be one of the best.  I went to best buy to compare a few and the Powershot SD450 was by far the best in its price range.  I have owned it for about a year now and am very happy with it. The main reason I purchased a camera in the first place was to send pictures to my brother who recently moved to Germany.  The software that came with the camera made this quick and easy.  In the matter of a few minutes I was able to download the pictures and send them away.  I was also surprised as to how user friendly the software is.  I am not familiar using programs like that.  But in about twenty minutes, I was cropping pictures, resizing them, reducing red-eye, etc. This camera also takes amazing pictures.  The colors are exactly as they are in real life.  If you compare pictures from a canon to almost any other camera, you will see a difference.  The DIGIC II Processor built in the camera is amazing.  Having a 2.5-inch LCD is also a big help.  It makes it very easy to know if the picture taken is good or not.  Also, the 5.0 megapixels makes it possible to have great looking pictures printed out in sizes up too 13x17 inches. Another great feature of this camera is the video recording.  It makes great short videos. With three different shooting modes of 15, 30, or 60 frames per second, it's easy to get the speed needed.  Getting to these different modes is quite simple.  All of the options in the camera are rather simple to access.  There is no need to read the whole manual to figure out how to use the options; it's pretty much self-explanatory.  If you are looking for a good point and shoot camera, this is definitely a camera to consider.  I have passed it along to family and friends and they have all had positive things to say about it.", "Date": "April 20, 2006"}, {"Title": "Tiny camera w/ a huge display!", "Author": "J. Vandrick", "ReviewID": "RN65KG18M4SDN", "Overall": "5.0", "Content": "This camera is tiny. I knew it was going to be small when I ordered it, but when it came in the mail I was quite surprised.... and the display is almost as big as the camera!!So if you lose things easily, you might want something a bit bulkier. But for everyone else, this pocket-size camera is great! It takes wonderful pictures, very clear video (with sound!) the shutter is quick, the options are eay to use, and it comes with a battery charger so you won't have to spend a lot of money on batteries that will be dead after 50 pictures.I've used a lot of digital cameras, and I am most impressed with this little canon. It was definately a good purchase. If you dont really know a lot about digital cameras and you are just looking for something that is portable, easy-to-use, and takes a great pictures, I would definately recommend the SD450. Besides, you can't beat the price!", "Date": "November 30, 2005"}, {"Title": "Great little camera with a few minor flaws", "Author": "Kody J. Krause", "ReviewID": "R2609SDV0WAKZK", "Overall": "4.0", "Content": "I bought this camara online to replace my old 3 MP Olympus Camedia. I was looking for 2 major things in my next camera; small size and higher resolution. The first thing that I was impressed with was how small this camera really is. I had only seen commercials about it and researched it on the internet, and I didn't fully appreciate how small it is until I held it in my hand. It literally fits in the palm of my hand. This was one of the big selling points for me, as my three-year-old Olympus digital camera was the same size as a regular point-and-shoot film camera. I wanted something ultra-portable, and this camera fits in about any pocket I have, except that tiny one on my Levi's. The LCD screen on this camera is amazing, you really have to see it to believe it. It's very large and bright, and you can really see your pictures that you've taken. It's also very simple to zoom in on pictures, which I like because I'm able to see if they're in focus, and I can sort through and delete the ones I don't like. It's very simple to learn to use this camera, and I was impressed with the user's manual. It comes with a beginner and advanced manual, which I thought was helpful. Overall, the camera's build is solid, and it has significant weight for its size, which I like because it doesn't feel cheap. As for the flaws that I've observed, I don't like the flap that opens to access the USB port. It's made of this shiny silver plastic, and I honestly thought I was going to break it the first time I opened it. It's awkward to insert the USB cable, but I've found this same problem with all of my digital camera equipment I've owned. The nice thing is that it uses an SD memory card, so if your desktop or laptop has an SD card reader (mine do) then you can just use the card to transfer pictures and not bother with the cable. This leads into the only other thing that I don't like about the camera's build, and that's the door to access the battery and memory card. It's plastic, and it feels kind of cheap. I think if you were to fumble with the camera or drop it with this door open it would break off. As for the battery life, it seems to be very good, considering the large LCD and zoom lens that moves each time you turn the camera off or on. I bought a second battery (just a generic online, the Canon is about $40 retail) and it's saved me a couple times already. The charger that comes with the camera plugs directly into the wall, and you have to put the battery into the charger, which is kind of annoying, but I think you can buy a corded charger, or even an AC charger for the camera itself. It certainly beats the 4 AA batteries my old camera would eat up every third time I used it. The picture quality of this camera has been my major area of complaint. It seems really hit and miss. One thing that I find annoying is the AiAF feature, which automatically evaluates where the camera will focus on each shot. A little green box will show up over the area that will be in focus. It seems that half the time it focuses on something behind what I'm trying to shoot, especially indoors with the flash on. This feature can be turned off so that you can have a center focus, but you can't turn it off in the automatic shooting mode. On the pictures that turn out in focus, the color is excellent, as well as the clarity. Outdoor pictures turn out much better than indoor ones, which is usually the norm for small cameras like this. The flash is pretty good, but it washes out faces if you're too close. I am still learning how to get the most out of this camera, and there are many interesting features that I've yet to use. Hopefully with a little more practice I can get better results. Overall, I think this is a great camera for the price. It's really small and portable, it's fairly easy to use, the controls are good, the LCD is beautiful, and the pictures that turn out good are pretty high quality. I would recommend it, but if you have chance to check out others before buying this one, I would do it, just to see what else is out there.", "Date": "December 16, 2005"}, {"Title": "Great camera and digital camcorder combo", "Author": "J. Ward", "ReviewID": "R8TGU2GHGT4YE", "Overall": "4.0", "Content": "I was looking for a 5 MP Camera for under $250 that can serve the purpose of a digital camera and camcorder to capture images of my newborn baby.  I bought the Canon SD450 and the Kodak Easy Share V550 on a credit card so I could send one of them back that I did not like.  The Canon took better pictures and the video was even better than my Sony Hi 8 Camcorder after converting it to DVD.  The only catch about the Canon is the video.  The video looks good enough to use exclusively as a camcorder, but the size of the video clips are very large.  1 GB = 8 min 640x480 30 fps (close to Digital quality) and 43 min 320x240 15fps, and 114 min 160x90 15fps (1 MB per minute).  The video is sent to the computer as an AVI file using the Canon 450 and Mov file using the Kodak V550.  The Kodak is more user friendly and would make for a better starter camera if you didn't know what you're doing or entering into the digital camera world.  However, if you can read an instruction booklet, the Canon SD450 is superior to the Kodak in almost every area.Canon Pros:Great Digital photosDigital Quality Videos (video quality can replace your camcorder)Lithium Battery, 90 mins. to fully recharge. Can take over 150 photos single chargeSmall yet big enough to hold easilyWater proof accessories availableCanon ConsCan not charge the battery in the camera (separate charger that comes with it)Video files are larger 1 min clips are sometimes 150 MBLittle blur when the flash is turned off (expected with most digital Cameras)", "Date": "June 3, 2006"}, {"Title": "An amazing compact camera!", "Author": "Joe", "ReviewID": "R3OKTVU75JOO8K", "Overall": "5.0", "Content": "Considering the compact size and portability of this camera, the picture quality is truly amazing and so is the video. I got mine with a 1GB memory card, and I can fit hundreds of pictures on it at maximum resolution. It's small enough to take anywhere and everywhere, so you can get all those pictures that you previously missed since you didn't have a camera with you. The camera is simple to use, you just point and shoot, and the pictures look good. No rocket science here. One thing though, (and I think I read other reviews that mention this), the LCD viewer is very easy to damage. The slightest pressure (like from being carried around in your pocket) can damage it. So be careful of that. It's mainly a cosmetic thing though; as it only damages what you see on the LCD screen, not what comes out in the picture or video. All in all, I highly recommend this camera to anyone who is looking for a high quality, very compact portable camera.", "Date": "February 25, 2006"}, {"Title": "Easy to use!", "Author": "R Swenton", "ReviewID": "R1VAUNROKCMRJT", "Overall": "5.0", "Content": "This is a great camera.  The directions stated I did not have to install any software to download photos to my pc, which is a feature I wanted.  (I used to have a Kodak camera which required using Kodak software, which made a mess of my computer.)  Also, I discovered my laptop has a media card slot, just take the card out of the camera and pop in it my laptop.  Windows XP automatically finds the pics and asks what you want to do with them.  Awesome!  This camera also has a battery charger unit that is very compact and plugs directly into a wall outlet.  Just pop the battery out and plug in into the outlet.  Also very easy, no cords required!  Picture quality and LCD quality is also very good.  You will have to buy a media card though, it only comes with a 16mb card, which is worthless.", "Date": "March 9, 2006"}, {"Title": "Awesome Camera", "Author": "that kid \"Joe\"", "ReviewID": "R17XW93TWRI83Q", "Overall": "5.0", "Content": "I recently purchased this cmaera (superbowl sunday) as an update from my Canon A60. This camera is not only half the size but packed with more and better features.I haven;t used all my features yet but have tried out a few.Macro mode is excellent for close ups I was walking around my aunts house taking pictures of everything(food, flowers brushstrokes on a painting) on my 1 GB memory card which holds 600 PICTURES on the 2nd largest resolution.The resolution on this cmaera is out of this world. You could print poster perfectly with the largest setting.Crystal clear 8x10and nice 4x6's which is what I usually print for my photo album.The battery charges extremely fast. If its a full charge it takes 90 minutes. If you are just toping off your battery it takes less time. My canon AA rechargeble batteries for my A60 took almost 3 hours.The size of this camera is amazingly small for a camera with such alarge screen and so many features.Make sure you buy a case for this camera with a screen of this size you don;t want to ruin it.I am completely satisfied with this camera and I recomend it to everyone.No offense to Amazon but i recommend buying this camera from bestbuy. They are the same price, but bestbuy has a great 2 year warranty program and it only cost $20. If you ever have a problem you can bring it in and they will give you the store credit to get the same camera or a different model with a higher or lower price. I've used the warranty on my cell phone and when my cell phones program crashed i brought my phone in and they gave me my $85 credit and told me to go pick out a new phone.", "Date": "February 20, 2006"}, {"Title": "great little camera", "Author": "Johnny99", "ReviewID": "R6EI3999CC972", "Overall": "4.0", "Content": "This is a great little camera for the price.  Since Canon recently released the new and similar SD600, dealers are closing out the SD450 for around $250.  The SD450 takes great pictures (sharp and colorful) in bright sunlight.  In low light conditions, you need to use the manual mode and ISO-50, since the auto mode can get pretty grainy.", "Date": "March 30, 2006"}, {"Title": "Super", "Author": "C. Huang", "ReviewID": "R3S67MYNDFZ30Q", "Overall": "5.0", "Content": "This is my second digital camera. It does much better job than the first one I had which is SONY DSC-P1.PROS: large LCD screen, power up very quick, picture quality is great.CONS: no battery indicator, lots of red-eye pictures in low-light", "Date": "January 21, 2006"}, {"Title": "Decent, small, medium picture quality", "Author": "Marc Gelfo", "ReviewID": "RA6LRCEJHZO30", "Overall": "3.0", "Content": "I was very, very excited to receive my Powershot SD450, \"upgrading\" from a Powershot A510 which had broken.  I've always liked Canon's cameras the best, both in terms of the OS/interface and the picture quality.That said, everything I expected of the camera was true and even better than before (particularly the very sweet interface), EXCEPT the picture quality!  Now, this guy is 5 megapixels strong, and I feel like all my powershots of past (down to the 2MP friend) took better pictures, particularly indoors.Outdoors the pictures are quite good, but in lower light it's really frustrating and grainy -- more like the picture quality of an Olympus digi which I tried for a week and returned.  I understand that how an automatic camera works in weaker light is really the defining feature (any cam can take good bright-light pics).  That was always something I loved about the old powershots, since I hate the way flash photography looks.Other than picture quality, I love the Sd450.  The screen is beautiful, and I put a screen protector on the first day and feel secure about it.  It feels solid and well-built.  It's a gorgeous finish.  The interface is superb, the boot-up time is fast, and I love using the thing.Other people have talked about the USB port cover feeling flimsy -- I second that motion.  I am very worried that after I open and close it 50 times the thing will break off.", "Date": "June 8, 2006"}, {"Title": "I love my canon", "Author": "Dork", "ReviewID": "R2I4MG3RWF9MJC", "Overall": "5.0", "Content": "It has everything you can ask for in a digital camara.  The only thing that I am not 100% satisfied about is that there is no \"battery bar\" to tell you how much battery you have left. Once the \"battery low\" signal is on, you have exactly two minutes before the camara shuts off on you.  Since you never know when the battery is running out, you should always carry a spare battery if you don't want to charge your battery everyday.  Look around online.  I got my spare for less than $10.", "Date": "January 17, 2006"}, {"Title": "Screen Damage from very little use", "Author": "Dale Denham \"Dale\"", "ReviewID": "R2NKY7DPDSKB19", "Overall": "1.0", "Content": "Great camera, really great quality and all features.  Until you have it in your pocket, bag or anything that allows a slight pressure on the LCD screen.  Now the camera is essentially worthless and I'm out over $300.  Took it to a retailer who said this is common due to how close the LCD is to the edges, which is of course where the damage is.  The glass didn't break, only the internals.  Cannon won't fix it.", "Date": "May 27, 2006"}, {"Title": "SD 400 and 450 are the Best", "Author": "F. Daniel Endy \"Truth Seeker\"", "ReviewID": "R2QFNG5GD0L9Q3", "Overall": "5.0", "Content": "First, know that I'm very picky and tough to please.(Note that this review is of the SD400 but also applies to the new SD450 which mainly has a larger screen.)I had a Canon SD110 (2MP) camera for 3.5 years and I loved it.  I took a while and did a lot of research to find it.  I had been waiting for the right new camera and I finally found it, the SD400.  I've had it for over 6 months and I've been meaning to write up this review.I had taken over 9,000 photos with my SD110 in 3.5 years.  With the SD400 in only 6 months, I've already taken over 1000 shots.Back when I got the SD110 Canon was not as well known.  Now people recognize that Canon is a top-tier digital camera brand.My wishes for improvement over the SD110 were:- longer movie clips (only 15 seconds) - now unlimited- zoom in movie mode - YES- limited close-up range - new Digital Macro mode- higher resolution - YES- better zoom - YESThe SD400 has all of this.  The one thing it doesn't have enough of for my taste is zoom, but what can you expect from a camera .75 inches thick?  I wanted zoom, but I didn't want to sacrifice portability.  (I hate having a lens sitcking out of the camera.) In any case, it has a 3 x optical zoom which is pretty good.The best feature of the SD110 was it's compact size.  The SD400 delivers more in less space.  I take it with me everywhere I go.  If I see a shot, I can take it.  If I see a moment, I can capture it in a movie.  And no hassle with carrying a separate case.  It fits in my front pocket, even my tight jeans. (Just be careful not to put anything else in there or you might scratch the screen or even crack it.)One of the best features of the SD110 was the movie mode.  It took great little clips of super high quality with sound too!  Way better than any other camera.  The only problem was they were limited to about 15 seconds in length.  With the SD400, they are unlimited.  You can trim them in the camera to save space too.  It also can take 60 FPS for a high-speed camera effect.  When you play it back at 30 FPS you get slow motion.  The only issue is that you need to brace yourself to minimize camera shake.  These movies are better than standard video recorder quality.  They're close to HD TV quality if you use the 640 mode.  There is no jumpiness period.The other big advancement is the Macro mode.  This thing is practically a microscope.  It can take shots at under 1 inch from the subject assuming you have good lighting that close.  Add to that the digital macro zoom and you can photograph a mosquito so close that you can count the hairs on its legs!I love taking photos of flowers and always wanted to get closer.  Now I can get as close as I want.Lots of people will say you need more than 5 MP to go over 8x10.  It's not true.  I did decent 8x10 prints (with the bundled Canon software) using my old 2 MP SD110.  With the SD 400's 5 MP I have done enlargements to 12x18 that are excellent.The range of new settings on the SD400 are great.  I would like more but they options are good.  The best one is the ability to set the ISO speed.  There's a focus lock and an exposure lock feature.  I wouldn't know it if I didn't read the manual.  Nice extras for sure.  They're very useful if you're into photography.The least satisfying thing is the auto-focus.  It's odd, but I've gotten used to it.Now, to be sure it's not perfect, but it is really good.  I think it's better than 99% of the cameras out there.I chose it over the SD500 because the 500 was thicker and I didn't feel I needed the extra resolution of a 7 MP camera.  It was the right choice.Note the following:- battery life is excellent, and the charger is tiny, but if you don't want to be caught short on vacation or when you're out on a long hike, get a spare battery and charge them both.  I did this for the SD110 and I never ran out of juice.  The battery is so slim, you can carry it easily.- do get a big memory card.  I recommend the SanDisk Ultra II 1 GB.  I have two of them.CRITICAL - get something to cover the screen.  It's large and easy to scratch in your pocket.  Also in your pocket be careful to put the screen against your body to prevent it from getting poked and cracked.  I would not put it in a back pocket either.The biggest problem is holding still in low-light.  I don't like flash and I like taking low-light shots.  You will want a tripod or a mini-tripod if you do much of that.HIGHLY RECOMMENDED!", "Date": "March 5, 2006"}, {"Title": "Tiny, Tiny, Tiny!", "Author": "Sarah Sharp", "ReviewID": "R1AOPUHYXR5SAS", "Overall": "5.0", "Content": "No photos of our first New Years Eve together.  No photos of our honeymoon hike down the Lake Michigan shore.  No photos of so many birthday parties, picnics, and downtown adventures.  Why?  Because the only cameras we owned were HUGE.  Who wants to carry around a heavy camera body and long (and fragile) lenses all day?So I searched for a solution - something small enough to tuck into a pocket or purse that wouldn't make me say \"yuck\" when I saw the resulting images.  And I found it in the SD450. I love the size of it; it looks especially cute in the red leather case that I purchased to protect it.  The nice array of functions make it easy to work with and fun to use (I especially like the different color modes).  It's 5mp give me plenty of room to crop and edit and still print a good 8x10.  We're even using it as a video camera!I was looking for a small camera that was easily pocketable and would produce consistent quality images.  I got all that and much more, and would highly recommend this camera.", "Date": "January 26, 2006"}, {"Title": "Overall, great camera", "Author": "ericatdallas \"ericatdallas\"", "ReviewID": "RJECVG2OFTFV8", "Overall": "4.0", "Content": "This is my second digital camera. I bought my first one 3 years ago and wanted something faster and smaller that could fit into my pocket.LCD: Poor quality and grainy. Not very important just to preview pictures but I would have preferred a smaller LCD (decreasing vulnerability of camera).Size: AWESOME. Smaller than my cell phone or wallet.Speed: It powers on very quickly but still not very quick on the picture taking.Video: Very good considering its primary function is a digital still camera.Picture quality: my 3MP Olympus camera (the one beng replaced) has the same quality as this camera (at maximum setting). Indoor quality isn't very good and it likes to use the flash a lot even when it's not necessary. Sometimes received better result by forcing flash off indoors.Ease of use: I figured out most of the functions without picking up the manual. Learned some more tricks with the well written documentation (they provide a basic and advance manual in english and espanol).I don't regret buying this camera and it has lot of features.FYI: The memory speed didn't make much difference when using this camera. I bought a regular SD card and a 150x SD card (both 1gig). I notice absolutely no difference in pictures or video so I would recommend you save your money.", "Date": "January 12, 2006"}, {"Title": "High Quality Images", "Author": "Ricardo Mendillo", "ReviewID": "R1OB837AU5X2HC", "Overall": "5.0", "Content": "Because of its small size, you will be holding the SD450 with your finger tips rather than your hand. Controls are well-placed for ease of use while not being subject to accidental activation. The body is attractive and durable, but the flexible plastic battery/memory door should be handled very carefully.As all the ultra compact cameras the flash is an issue to consider if you will use it under low light conditions.Tha image quality is excellent, very fast focus, very good video quality but consumes 2 megabytes per second it means that with 1 Gb SD card you will record just 8 minutes of video.", "Date": "May 7, 2006"}, {"Title": "good quality if you're willing to push a lot of buttons", "Author": "in overalls", "ReviewID": "R2I8NT60J8XNGO", "Overall": "4.0", "Content": "first off, let me say that i went into this purchase pretty anti-digi. for years (in college) i used only a large format \"dinosaur\" of a camera (4x5 toyo AX) that produced incredibly clear, color-saturated prints (well, negatives anyway). i have been very impressed with this camera in several ways, but also find it to be incredibly lacking in several ways.thumbs up:1: clear and sharp images, even when the screen tells me the exposure is kind of slow (1/15 of a second)2: nice and small (especially compared to a 5 pound lunchbox of a camera and a tripod) but doesn't feel like it's too light, like about to fall apart at any point because it's so cheaply made3: quick shutter, especially if you get into the habit of pressing the shutter halfway down as you compose the photo4: big screen is awesome. i've had a lot of people comment upon it while showing them photos.5: macro focus is great, as are presets for tungsten/fluorescent/high fluorescent lightingbummer:1: no idea how much battery is left. ran out on one of my first \"on-vacation-with-a-digicam-days\". that was aggravating.2: small cover/flap that goes over the data ports (for uploading photos) is about the flimsiest thing i've ever seen on a $300 item.3: exposure in variable lighting conditions leaves something to be desired. if there is anything other than flat light, i tend to put it into 'spot metering mode' and then just judge by what i see in the screen (reacts quickly as you move the 'spot' around by moving the camera slightly). this seems to produce pretty nice exposures; 'center-weighted average' overexposes, in my experience. however, what i find to be really annoying is that the camera seems to (allow me to admit here that i haven't really read the manual, though i have spent a lot of time fiddling with all of the settings on the camera and definitely have a good knowledge of how to manipulate the settings) randomly preserve the settings from use to use (when the camera is turned off and then back on). so, it will remember that i have it set in 'manual' mode, and that i set it to 'tungsten (indoor) lighting', but not that i want it to be on spot-meter mode. so, i end up setting it to spot mode every time i turn the camera on. this is not a huge deal, but it is annoying in the end.3b. though spot-meter gives better exposure, some of the images, especially those taken outside on a sunny day in winter (with snow), had super-saturated color that looked a little too green to me, both on the screen and my computer.that's about it. overall i am quite happy but there are a few things that really bother me me and i just wanted to put them out there. you'll probably love it, sure, get it. have fun!", "Date": "January 12, 2006"}, {"Title": "Accessories", "Author": "D. Boelio", "ReviewID": "R1OMSLTWQYVIHU", "Overall": "5.0", "Content": "A great camera and a great value. Don't make the mistake I did, however, and buy the battery recharger listed under \"Accessories\" for this product. A recharger comes with the camera. Amazon helpfully notes that fact under \"What's in the box\" at the very end of the product description.", "Date": "March 25, 2006"}, {"Title": "Perfect small camera for non-pro", "Author": "Chris C. Brown", "ReviewID": "R3LX1SML8KYX3", "Overall": "5.0", "Content": "Was looking for a smaller digital than the one we had purchased in late '99 that felt like it weighed about 19 pounds in $200-$300 price range. Began looking at Canon (most preferred by every photog I know) Poweshot 510 but the SD450 won out because of it's size and the screen and features. I love the camera, it first felt a ittle small in my large hands, but once I figured out where everyhting was, it felt much more natural. The screen is awsome, perfect for sharing pics and with the 1Gig mem card, on the low setting I get like 9000 pictures, about 1000 on highest. I like that you can adjust the ISO, B/W, Sepia and other standard tones. Teh video's are nice and crisp, the \"stitch\" function for panoramas is nice. Very glad I bought this camera and I am happy I went with the smaller one over the 510, easily fits in shirt pocket. Oh and another I really like is it's fast on and off. You can literallly take a picture in 2 seconds from being completely off and closed down. My last digital took about 1 minute.", "Date": "May 22, 2006"}, {"Title": "Awesome", "Author": "elstephens", "ReviewID": "R38U1TOT73ZNKI", "Overall": "5.0", "Content": "This camera was bought for art classes in graphic design and just for snaps here and there on trips and whatnot. I wanted something small and easy to carry around as well as having enough pixel to play with in photoshop. This camera fits those specs. What I really love is it still has a view-finder even for its little size. Something most cameras this size are steering away from. Plus, the LCD screen is plenty big to get a good view of your shot. The controls are easy for me, but others with larger hands/fingers may find them difficult to press. The function options are great, the zoom is great, the pic quiality is great. Everything is great. A+*EDIT*One tiny annoyance. The shutter speed can't be changed. However, you can you the multiple shots seetings which give me cool results. But this could be a problem for some.", "Date": "April 24, 2006"}, {"Title": "I love this little camera!", "Author": "Cherie Barstow \"CheriePie(dot)com\"", "ReviewID": "R1MXWLD159LH2V", "Overall": "5.0", "Content": "I bought this camera to replace my G5.  Due to the size of that camera, neither my husband or I ever wanted to carry it around so we didn't get pictures a lot of places we went.  I decided to get a small camera to alleviate that.  From what I can tell so far, the pictures from this camera look just as good as those from my G5.  Plus it's easier to operate since there's a lot less extra features to confuse. :)", "Date": "September 28, 2005"}, {"Title": "Wonders never cease", "Author": "bensmomma \"bensmomma\"", "ReviewID": "R21T9TSA1PCA97", "Overall": "5.0", "Content": "This is the camera I have, although I bought it in the UK, where it is called a sd500 5MP \"Digital Ixus.\" The Canon is more powerful, more compact, easier to operate, takes better pictures, has more flexible storage, doesn't cost any more than the older weaker cameras I have owned.The things that impressed me most were a) the giant bright and vivid screen, nice enough to show the photos to your friends without any other electronic device, b) the quick response time (no irritating delay), c) the quality of the digital movies you can take with this (they are short but full-speed). I've dispensed with my camcorder altogether in favor of the Canon's fully satisfactory performance.I have owned digital cameras for almost a decade, but this one is so far advanced over my previous ones in convenience and quality that it leaves me feeling like some old fellow who grew up riding horses getting a ride in his first horseless carriage. It's really a pleasure to own.", "Date": "May 19, 2006"}, {"Title": "Fantastic little camera", "Author": "John", "ReviewID": "R1DFCN5B1FOT5Q", "Overall": "5.0", "Content": "We've had a few different digital cameras over the past decade, and this is by far the best.  A few days before we took a trip to Disney this summer, I found out our JVC camcorder wouldn't get anything in focus and the picture was always near black.  So I took it in and found out I wouldn't get it back for a few weeks.  We had just recently gotten this camera, and hadn't really put it through its paces yet, but I decided to grab a 1GB SD card for it and hope that it took good videos as well as great pictures.  And it certainly does.  On the lowest quality settings (320x240 w/ 15 frames per second), you can record a good 45 minutes of video w/ audio on a 1GB SD card, which goes for about $30 now.  It'll record video at up to 640x480 w/ 30 fps.  It's loaded with features and responds very quickly.  You can turn the power on and snap a picture in about 2 seconds.  It's really a delight to work with, and the battery lasts a really long time.  If you're zooming in a lot, it's kind of easy to end up with a blurry picture if it's not held steady, but that's a user thing, and not a problem with the camera.  It's tiny, but it feels incredibly solid, and I highly recommend it.", "Date": "August 18, 2006"}, {"Title": "Where've you been all my life...", "Author": "Marc Flanagan \"Reading Through Lunch\"", "ReviewID": "R2MZASIISTQ6O5", "Overall": "5.0", "Content": "I took the plunge and purchased a digital camera for the first time in 2001, I think it was a Minolta, since then I have purchased a digi every year. Not that I'm so accqusitive, but for bascially the same price you could upgrade your camera by 25 or 30%. In the last year I have upgraded my Sony DSC and my Minolta, but I have to admit the Canon SD450 is the best in my collection. It's images are sharp and noise free, compact enough to forget you have it in your pocket, the zoom is a little clumsy. but if I want to enlarge I do that on my computer (it has 5 megapixels). Now here's a feature that I really appreciate it's easy to charge the battery (the Sony has a docking station with two inputs-annoying). Love my Elph, thanks Canon.", "Date": "March 23, 2006"}, {"Title": "A fantastic compact camera.", "Author": "Jeffery Van Raden \"jvr248\"", "ReviewID": "R3GYYIAWEEKS1C", "Overall": "5.0", "Content": "I admit I did some research before I purchased but I was really surprised at how much I enjoy using the camera at both ends. It is simple to use and small enough that it's always available. The camera takes very satisfying images.  True color reproduction and image quality that rivals my eos 20d.We toke our new elph and our 20d to Kona this Christmas for three weeks and took three times the amount of images with the elph.The thing I most love about this camera is its underwater capabilities. The camera has an underwater setting and the underwater case (good to ten feet not much but enough) available for about $ 130.00 makes this camera a great value.The first day of diving and I feel I got my monies worth.But when we played the built-in slide show the camera revealed yet another great set of features for play back. An now that I am home and downloading the images on to my Vaio I am again surprised at the clever and quick method the Canon Engineers have developed.And you should have seen the faces when I showed my family and friends the underwater movie of an octopus in action. I almost made them ink. WOW!!!", "Date": "January 12, 2006"}, {"Title": "What else do you really need?", "Author": "Nick Kaleba", "ReviewID": "R1H7AHKBFEAF0N", "Overall": "5.0", "Content": "I was looking for a good quality, compact digital camera that I could carry around with me.  This camera obviously has the same limitations of all compact digitals, but is easy to use, takes fantastic shots and slips easily into a shirt or pants pocket.  If I wanted a digital camera to do more, I would by a more expensive SLR camera.  For everyday use, this camera is great quality and great value.I would recommend this camera to anyone.", "Date": "February 24, 2006"}, {"Title": "Really Great Camera for a really great girl...", "Author": "E. Harris \"WxGurl\"", "ReviewID": "R5BQX2IC2GJNQ", "Overall": "5.0", "Content": "So, since this was my first digital camera I decided to welcome myself to the 21st century (I'm a late bloomer) in style and get this camera even though it was a little more than I wanted to pay.  I love it! I was able to easily use it for point and shoot pictures.  Yes, it probably has too many features for one person to possibly ever use, but of those features there's a lot of cool stuff. I love the color setting that lets you pick out which colors should show up! The instruction manual says there's a low battery indicator even though everyone commenting here on Amazon says there is not. I dunno. So far so good and no dead battery.  Picture quality is swell, although not impressed with indoor or night shots.  It's small, compact, easy to use and looks stylish enough for me (and I'm a stylish girl). Plus it's small enough to fit in the little pocket of my little jean skirt. I got the Canon red leather case for it (also sold on Amazon for like $14) and it's kept it very clean.  No damage or scratching yet to the screen, but I've been pretty careful. Okay, all in all, It's great and I love it and would recommend to my friends, who are already planning on getting it anyway.", "Date": "April 4, 2006"}, {"Title": "Protect the LCD Screen!", "Author": "D. Kellan", "ReviewID": "RMS2SI117CY1M", "Overall": "5.0", "Content": "I bought the Canon SD450 Digital Elph to take with me to this Army school I had to attend out in the desert (White Sands). I knew that the LCD would be fragile, but I didn't plan on it actually breaking. I was careful with it, and somehow it really did \"just break.\" That meant that I couldn't change the settings on the camera since the menu is displayed digitally on the screen, even to change the flash settings. I just continued to take pictures using the viewfinder, and they ended up coming out just fine. All of the pictures I took looked great, once I returned home and could see them on my computer. Besides the fragile LCD screen the Elph is perfect. It's small enough to tuck into a shirt pocket (or the side sleeve pocket on the Army ACU blouse), and made of metal so the body won't crack no matter what. In Canon's defense, I did email them on their technical site and asked about repairing the LCD, fearing the worst, and to my surprise, Canon actually offered to fix it FOR FREE, even though it wasn't covered under the warranty! I mean it- they actually said that it wasn't covered under the warranty but they fixed it AS A COURTESY. I'm a die-hard Canon fan now. I mailed it to their service center with the repair code attached, and less than 10 days later I had my camera back, working perfectly again. I bought the \"da Protector\" LCD cover immediately (found here on Amazon)and now I feel secure knowing that my LCD is safe forever. The Elph is easy to use, almost intuitive, and versatile. You can use the automatic setting where the camera does all of the \"thinking\" for you, or you can choose from various manual settings to control the ISO (100, 200 or 400), flash settings, aperture ranges- you name it. It even has a decent video recording feature, and I use it to record short videos at work and such. Using a 1 gb card, I can put pretty much countless photos on it, OR about 8 minutes of video. The video has choices too, where you can record in various color options or black and white, or sepia. I chose the 5 mega pixel model because I read online that unless you are planning to enlarge your prints up to the 11x17 size, you can't really tell if the picture was taken using 5 megapixel or 6 megapixel or higher. I can tell you that the pictures this camera takes are top notch, but at 400 ISO combined with low light and no flash, they do tend to get a bit \"noisy\" but that's really taxing the capabilities of ANY camera, not just this one. I highly recommend this camera, and I also highly recommend that you protect that LCD screen at all costs.", "Date": "November 21, 2006"}, {"Title": "AWESOME", "Author": "Kriden", "ReviewID": "R3L2R8YSZM5KV2", "Overall": "4.0", "Content": "My wife and I just got back from a trip to Venice.  In an effort to reduce travel bulk, I left my SLR film camera and lenses at home and only took along my fairly new SD450.My only complaints the entire trip were that I would've liked a longer zoom at times, I wished I had brought a tripod for night shots, and I could've used a third battery or travel adapter for my charger.  (Two batteries took about 500-600 hi-res pictures and a minute of video over the course of 15 days using the lcd screen but very little flash.  The second battery died in the airport on the way home.)Besides that, the little 450 performed beautifully.  I was able to use the various manual features and exposure control to get very similar shots to what I would've been able to acheived with my SLR.  And, because film wasn't an issue (two 1 GB SD cards) I was much more liberal with the shots I was taking and ended up with some real nice surprises.As for the delicacy of the camera, I tend to baby my equipment, but I am also a clutz.  The second day in Italy I was taking off my belt in the hotel room and had forgotten that the camera was still in it's case strapped onto the belt.  The camera fell from waist height (in the case) onto a marble floor.  No damage at all.  LCD is still clear and beautiful.  So, it's not quite as fragile as people make it seem.  Though, I'm positive that without the case, I would've had a $300 paperweight on my hands.UPDATE:A minor CON that might affect people.  In playing with the images from my Italy trip, I noticed that they were all at 180 dpi.  I would have expected a camera like this to record at 300 dpi in the highest setting.  Not a huge deal, but a minor inconvenience when dealing with quick high quality printing.It's not enough to lower my rating--I still love this camera--but something to consider.", "Date": "June 20, 2006"}, {"Title": "Lots to like - but...", "Author": "Graybear \"Graybear\"", "ReviewID": "R1WQZT7DAXF0QY", "Overall": "4.0", "Content": "First reaction - WOW!  Small package, big viewfinder, great pics and videos.  But I like dates on my pictures.  Weird I guess.  I can only put dates on using 'postcard' mode (1600X1200).  So if I want dates on my 5 MP shots, too bad.  Guess I'll have to learn to live without.Great little camera though - feels good in the hand, easy to use, metal case.  The doors are a little flimsy though.  Worried about that.  The 16M chip that comes with the camera is about useless - why bother.Invested in a nice case, a 1G chip, and am getting an extra battery for travel.  Comes with a nice battery charger - charges the battery in 90 minutes.  Another drawback - no battery readout.  Don't know when it's low.  Nice to have feature that was missed.  Hence the extra battery.  Probably good idea anyway.Only had the camera a week, so no comment on longevity or reliability.  Just recharging the battery for the first time since the initial charging, and have had the big screen on all the time - lots of fooling around with the camera - taking and erasing pictures with the provided microchip.  Just got the 1G chip - now to really put it to the test.", "Date": "December 31, 2005"}, {"Title": "DO NOT BUY THIS PRODUCT", "Author": "SSNOW \"ELZ\"", "ReviewID": "RQL5GBHH45BDU", "Overall": "1.0", "Content": "I purchased this camera and was initially impressed with the product.  However in less than five days and twenty pictures the viewing screen failed. I attempted to return the camera and was told by Canon that they are not going to fix the defect. They are trying to say that I damaged this camera.  This will be the last Canon product that I purchase and I would encourage others to shop other cameras before purchasing this camera. It is very discouraging that a reputable company like Canon would not stand by thier product.", "Date": "May 22, 2006"}, {"Title": "Great PhD camera but lacks 2 basic features", "Author": "Gerald Khoo", "ReviewID": "R18OIW788XUB5G", "Overall": "3.0", "Content": "This camera is also known as the IXUS 55 in some parts of the world.  This is a good buy for a PhD (Press here Dummy) camera, and has interesting features for editing and picture stitching.  For a compact camera that packs so much inside it, I find that it lacks 2 basic features - (1) the ability to manually adjust the shutter speed, and (2) the ability to set the aperture size.  To add on, you can only set the camera to a maximum of ISO400.Though the auto mode was good, but I found that it could not take shots with movement as well as still picture.  This camera does great with stills, and there are many presets for it, but it lacks a range of presets for moving shots.  It took me awhile to find it in \"Kids and Pets\" settings, but the quality degrades if we choose to turn off the flash in taking moving shots.", "Date": "April 26, 2006"}, {"Title": "Beautiful Camera", "Author": "James Keefe", "ReviewID": "R3QSFN0SV9O71G", "Overall": "5.0", "Content": "Outstandingly clear view screen. Easy to use, most settings are user friendly and clear. The stitch function is particularly useful for travel photos. It is slippery though, you should always keep the cord looped around your wrist.", "Date": "March 19, 2006"}, {"Title": "Awesome Camera", "Author": "Kimo", "ReviewID": "R2IBBNHZO6UPBW", "Overall": "5.0", "Content": "This is the thrid digital camera that I have owned and it is by far the best and the price is great.  Received the camera from Amazon.com much faster than I had anticipated.PROS:Picture qualityMovie feature is one of the best I've seen on a still camera.PriceSize (easily fits in a pocket)LCD screen sizeNumerous features, easy to use interfaceCONS:LCD screen does not have a protective cover/coating.Would be nice if the optical zoom was a little more powerful (5x vice 3x)I liked this camera so much that I bought another one for a Xmas gift and with Amazon's rapid (free super saver) shipping, it got here in plenty of time for Christmas.", "Date": "January 13, 2006"}, {"Title": "Do not buy this camera (from a long time Canon customer)", "Author": "S. Tryphonas", "ReviewID": "R2JF72XZNI69X", "Overall": "1.0", "Content": "I have bought and used Canon products for years and own and SD450. Unfortunately I have encountered the now famous Canon-related E18 error (the lens gets stuck). I discovered that a lot of other owners have the same problem and have taken very good care of their cameras. Please don't purchase this camera and spend your $$$ on a more durable camera. Just want to spare others from experiencing my same fate.", "Date": "July 5, 2006"}, {"Title": "Canon SD450 great little camera for the money", "Author": "Carol Goodman \"splendidenvy\"", "ReviewID": "R2MUAJJ6X383XW", "Overall": "5.0", "Content": "I bought this camera to use primarily for images of vintage instruments, especially brass and woodwinds. Even with some of the correct equipment to diffuse light properly and other techniques to achieve affective lighting, the inexpensive cameras in the house just couldn't cut it. This camera takes great pics with the clarity and color I need. My only very slight complaint is the focus on the digital zoom. I have to be able to shoot images that get very close up to shiny objects with font that is as small as 8, sometimes and etched into the metal.It really may be that I am still experimenting with technique and a professional would know how to use this camera so that it would shoot great pictures every time.But sometimes its hard to get that kind of clarity and it takes a lot of attempts. However, what do you want for $250?! If I paid $1000 for a Pro model, I'm sure I might get a better result. I have had kodaks, Sonys, HPs and none hold a candle to this Canon. It's amazing, the response is super quick, the battery pack lasts a long time, its sturdy, and it takes great family pics inside and out, nice depth of field and the various auto focus settings are well devised. I highly recommend this camera above almost any other that I've owned or tried for under $300. Totally worth the money, you won't regret it.", "Date": "August 5, 2006"}, {"Title": "Great Camera", "Author": "Mr. Tyler L. Quest", "ReviewID": "RGZANFRB85JYA", "Overall": "5.0", "Content": "I looked for a camera for a loong time, shopped around, almost purchased a Canon Digital Rebel, but this item I found best for me. Amazing screen, great pictures, and I can take it anywhere which is most important for caputuring those pictures at inopporitune times. Definatly Recommend!", "Date": "January 31, 2006"}, {"Title": "very sweet little camera", "Author": "A. Nelson", "ReviewID": "R2OILO3G27HFAT", "Overall": "5.0", "Content": "I bought this in March and have used it a lot since. It is so tiny and light that it comes with me everywhere. The battery lasts a long time and with a 1 GB card it holds tons of pictures. The automatic settings do  an excellent job metering and focusing, and the pictures are sharp. I also love the response time which is much quicker than my previous digital camera. I have  actually used the movie feature a fair amount to record kid's skits and a surfing lesson. It is great fun to be able to take these little movies in such a lightweight package. The huge screen and the automatic tilt option are really nice. The controls are very intuitive and there are lots of useful features like red eye reduction, macro focus, different metering options for action, night, snow, water, portrait, self timer, as well as silly things like the options to alter the colors.  In short, I love this camera!", "Date": "September 2, 2006"}, {"Title": "Love this camera, but additional accessories are a must", "Author": "Cynthia B", "ReviewID": "R1A0J1QKCO8YSA", "Overall": "4.0", "Content": "I bought this camera because I was so very tired of lugging around my giant digital SLR everywhere to get pictures of my toddler.  It takes terrific pictures, even indoors, and has has enough controls to allow for adjustment to most conditions.  My only complaint is that the measly memory card that's shipped with it is so inadequately sized as to be pracitically useless, so you'll have to spend another 30 to 50 bucks on a bigger card.  Since one of the biggest benefits of digital photography is that you can take several shots of everything and then save just the best, I do see this as a significant shortfall.  You may also want to invest in an extra battery, as you'll get very little warning when it's about to fail.  All in all, a great little camera for snapshots.", "Date": "July 26, 2006"}, {"Title": "Excellent start for me", "Author": "ID Doc", "ReviewID": "R8SXV8JEGH1KC", "Overall": "5.0", "Content": "This is the first digital camera I've owned, and I am very pleased.  Having been engaged in 35 mm photography for decades, I was dubious that such a small item could be other than a toy.  It is not.  The menus provide enough flexibility and control for most situations, the instructions are clear, and the results are already quite good.  I am getting used to the concept that carrying a tiny camera in one's pocket and snapping pictures with abandon can dramatically change one's attitude toward photography.  Masterpieces? No.  Interesting shots? Yes. I'm becoming converted.", "Date": "July 10, 2006"}, {"Title": "size/imaging/price optimized", "Author": "Adam Abate", "ReviewID": "RP92WUQ04DLUI", "Overall": "5.0", "Content": "the only knock i'd give it is that without the flash things can come out blurry, and occasionally even with the flash.  but maybe that's because i tend to take pitures hanging out of my car window on the highway. for the price it is optimized.  my girlfriend has the an A-series powershot -- about the same price as this one but presumably trades compactness and portability for better optics.  anyway, the A-series certainly is bigger and it eats batteries like kobayashi eats cow-brains, but i haven't noticed a difference in image quality compared to this little guy.the rechargeable battery is extremely convenient and recharges like a champ in about an hour and lasts me about a week with sporadic use. the user interface is simple and intuitive.the software that comes with it is crap from what i can tell, but to be honest i haven't really given it much of a chance (i use the free imageJ for picture editing).  i do know that it took nearly twenty minutes to install the five distinct packaged apps that came with it, and every time i try and open one my computer churns with indigestion.  whatever you decide, 5megapixels ensures that you will need to do something, because even at the MEDIUM setting the images are 1500x2000pix and consume about 2mb of disk.  resolution shrunk by 50% with interpolation will reduce disk usage by 10times (i.e., they end up 200kb).anyway, it's great.  it's tiny, it's cute, it's extremely well endowed (the LCD literally takes up 80% of its anterior surface) and with the right protection will live long and strong.  so far i really love this thing.", "Date": "February 5, 2006"}, {"Title": "Satisfied!", "Author": "Kathy Wright \"Kate\"", "ReviewID": "R3Q30LEU2790AJ", "Overall": "5.0", "Content": "Pros:a. Large LCD Screenb. Very Compactc. Awesome FeaturesCons:a. No Plastic Over LCDb. Sometimes Blurryc. Flash could be considered a blinding weapon", "Date": "August 9, 2006"}, {"Title": "Great Camera Small Size...", "Author": "J. C. Orthoefer", "ReviewID": "R3SFZ0FN1YKF1O", "Overall": "5.0", "Content": "I love this camera.  It replaced an old Oympus D450Zoom.  It has a number of great features, Size (it's small), LCD (It's large), the menu interface is pretty much the same as the Rebel XT.  I keep this guy in my pack for daily use.  And for use as a backup when I've got my Rebel in use.The two issues I have with it, is I wish it used a standard battery size.  Being able to replace the battery/ies on the fly with off the shelf ones would have been great.  The other issue is a personal one.  I need  two types of flash cards, I would have loved for it to use CF flash like my Rebel.  As it is I have to keep two types of flash around (CF and SD.)  Not a big issue if you only have one camera.", "Date": "March 23, 2006"}, {"Title": "Watch out for E18 error! - Kills your camera", "Author": "Kathleen \"Kathleen\"", "ReviewID": "R2I1MRFE6B7CM6", "Overall": "1.0", "Content": "Before you buy this camera, take two seconds and google Canon and E18. E18 is an error than occurs on this camera that completely kills it - and it doesn't take much for it to happen.  I accidentally tried to power off the camera while the lens was opening and triggered the error.  Luckily the camera is still covered by the warranty, but I am not comforted, because I read that if it happens once, it is likely to happen again, and when not covered under the warrenty it costs about $250 to fix - currently the price of the camera on Amazon.  LOOK FOR SOMETHING ELSE!", "Date": "August 15, 2006"}, {"Title": "Canon SD450", "Author": "Kerri Weisenberger", "ReviewID": "RNHBNRNXTB5NC", "Overall": "5.0", "Content": "I first received this camera December 2005 and it has been used constantly since then.  It recently died, and as I began shopping for a new one, I found I was comparing every camera to what I had.  A friend suggested looking for a gently used one - I couldn't be happier!  No having to learn a new system, already had a spare battery, and my camera is my constant companion once again.  My only regret is that I lost two months shopping - why didn't I do this first???", "Date": "December 21, 2009"}, {"Title": "Great Pictures - Very fragile", "Author": "F. Greene \"FL ARCH\"", "ReviewID": "R2CO2FJ1MTVLRQ", "Overall": "2.0", "Content": "At first I loved thes camera. It takes excellent photos, the auto settings work well and I like the manual flexibility. I thought my only complaint would be the clunky zoom controls.BUT, in less than a year, I've broken the screen on my SD 450 twice.  I had never broken a camera, phone or any other piece of electronic gear before. The screen on this model is extremely fragile. The first time it broke (inside a waist pack), Canon repaired the camera under the warranty.  The second time (inside the case Canon makes for this model, inside a briefcase) it's costing $113.44 to repair.I can't recommend this camera & I'm angered by Canon's refusal to recognize that they have a problem with the screen.", "Date": "February 16, 2007"}, {"Title": "Great features - fragile screen!!!!", "Author": "GIS Guy \"GIS Guy\"", "ReviewID": "R1ATVJO988ULAU", "Overall": "3.0", "Content": "Our unit at work purchased several of these cameras for documenting field work.  Even though we have all taken great care with them, we have 2 broken LCD screens which means the camera is pretty much junk.Up until the screens cracked though, this is one of the better point and shoot cameras I have used.  Fast reaction to button push, fast flash recovery, etc.  Much better than my personal camera, but I only paid $130 for my personal camera which I abuse terribly and it still works after 2 years.  This Canon is useless after 6 months.", "Date": "September 18, 2006"}, {"Title": "Great camera!", "Author": "R. Rowe", "ReviewID": "R2CNX5NBA87WBX", "Overall": "5.0", "Content": "I can't find anything wrong with it (besides the usual flash lag time that plagues ALL digital cameras).  Easy to use, takes great pix.  I love it.", "Date": "August 5, 2006"}, {"Title": "This is THE best!!", "Author": "Mets Crazed \"KT\"", "ReviewID": "R3RJQCZS9W2BD8", "Overall": "5.0", "Content": "I got this camera about a week ago. I have already taken about 100 pictures ( I'm a fanatic with pictures.) This camera is very light-weight and compact. It has easy to understand instructions and in about 5 mins I learned the basics for this easy-to-use camera. My parents purchased an Olympus camera for about $400 a couple years ago. For a little more than half the price of the Olympus this camera makes you want to use it. I has great feaures such as night shots, video, and  red-eye reduction. The memory card included only holds about 8 shots (I learned the hard way) so take my advice and purchase a good memory card upon purchasing this product. I also suggest buying a case for my parents camera has a very annoying little scratch on it ( cases cost aroun $10) this is a great investment for beginners and experts, I love it!", "Date": "April 14, 2006"}, {"Title": "the dreaded Canon E18 error got us!", "Author": "Crystal", "ReviewID": "RVEL1TU09W1WA", "Overall": "1.0", "Content": "I bought this camera for my daughter.  It's 4 months old. With careful use, it has 3 pin white dots on the screen and now sports an E18 error and the lens is stuck open.  We were told that the lens was jarred so it's not covered under warranty. We now own a $300. paper weight!  Before buying google \"Canon E18\", there's a class action suit in the works.", "Date": "July 3, 2006"}, {"Title": "4 Stars because there is no such thing as perfect", "Author": "Gadget Fanatic", "ReviewID": "R1UW4ICXJT0M5O", "Overall": "4.0", "Content": "Photography for me is one of my most favorite hobbies, and a couple years ago I invested in a Nikon D100, which is a fantastic DSLR, and if you take lots of pictures then you will find that the speed of a DSLR is a lifesaver, plus all the great manual functions.However when it comes to casual photography, I sometimes found the bulk of a DSLR too cumbersome and found myself not bringing my Nikon to many events that should be documented like birthday parties and the like so I decided to get myself a compact camera that I could just grab and go for times when a DSLR isn't necessary.After some researching on features and the like I finally decided that Canon had the small form factor, high quality, and big feature specs that I needed in a compact digital camera. I thought the price was just right and made the plunge.I am very satisfied with this camera.  It has a quick start-up time and takes pics rather fast when the shutter button is pressed.  There is a noticeable lag when using flash but I was very pleased in how fast the flash recharged.  The giant screen is sharp and vibrant.  The zoom is plenty for casual photos, and its got some great scene and special effect modes.  And so far I have no complaints about the battery life.  The manual options are few and far between. Basically in manaual mode it just lets u pick the ISO and thats about it.Overall I totally recommend this camera.  I'm not an expert or anything, but I take tons of pics and have been very satisfied with the Canon's performance.  I give it a 4 because I don't believe in perfect ratings.  I have yet to see a truly perfect product (and I include the iPod in that, lol).", "Date": "February 24, 2006"}, {"Title": "Screen Will Break - Don't Take Chance", "Author": "Matthew A. Mckean \"Mamckean\"", "ReviewID": "R2M3YWBGYUB8VS", "Overall": "1.0", "Content": "I have owned two Elphs and loved them for their size and picture quality. I read all the reviews for this camera and decided I would buy it even though a handful of people had issues with the screen on this camera. My screen cracked in the upper right corner within 3 months of owning it even though I took extra care to treat the camera very gently (much more gently than my previous Elph which lasted 3 years with no problems). I have no idea how I cracked the screen, but the $300 camera is now a basic point and shoot with no features accessbile since the screen is destroyed. I took the time to write this review to suggest that the screen breaking is something you should pay attention to and something that will likely happen if you buy this camera. Everything else about camera was great; hope they can fix the screen issue!", "Date": "June 28, 2006"}, {"Title": "Great / Compat Digital Camera for Family Use", "Author": "Todd A. Ebert", "ReviewID": "R1DH7RNI9EKEYG", "Overall": "5.0", "Content": "Got the SD450 at Christmas 2005 after reviewing lots of other brands.  Bottom line was that nearly all the camera-shop staff that I talked to (at least a dozen people) recommended Canon over other brands.  The camera is a great combo of size and performance.  It easily fits in your pocket (not too heavy) and takes great shots.  The 2.5 inch display is great for reviewing pics right after you take them....the only problem being that my daughters now want to look at every picture I take immediately afterwards ;)  I've had the camera a year now and it is still performing great.  The battery life is decent but I recommend that you get an extra so that you never have any downtime while the other is charging.  Also, buy a minimum 1 gig memory card as it fills up quickly when you take video.", "Date": "December 22, 2006"}, {"Title": "Great Point and Shoot Camera; Tested Under Rough Conditions", "Author": "Michael Ip", "ReviewID": "RWET0OZQSVRLR", "Overall": "4.0", "Content": "This camera is one of the nicest compact point and shoot cameras I have owned.  Being that it is a compact point and shoot camera, don't expect it to have all the features of a larger point and shoot camera, let alone an SLR.  If you want a camera to have on you at all times to take some great pictures, this is the one you want to use.  If you want some candid pictures for your MySpace or family pictures, this camera is also very good good.Pros:-I'm currently in Iraq right now, and it's very dusty here.  This camera manages to keep the dust out.  A few cameras from some of my peers and subordinates have had issues getting dust inside their cameras and rendering the zooms ineffective.-I have dropped this camera a few times, and it has remained faithful to me.  It has gotten dented up, but the camera is very sturdily built.-I really like the continuous burst shooting mode.  I think the specs list it as 3 shots a second.-The long shutter feature is very nice to have.  I have taken some nice night time pictures with it.-Fast startup time.-Some fun shooting modes available.  Although some aren't especially useful.-Very small and compact.  I often keep this camera in my cargo pocket, just about wherever I go.-Batteries last a while.  I can't recall how many pictures I can take on one battery, but it's never run out of me taking a large amount of pictures.-Very well priced.Cons-3X optical zoom.  Don't know if that's really a con for the size of this camera.-Using Long Shutter can result in pictures with A LOT of noise.-No aperature control, but I am unaware of any small cameras that do have this feature.-Priced competively with the higher models.  Might want to consider the 7 MP model.  Although to be honest, you'll never need to shoot 7 MP.", "Date": "December 18, 2006"}, {"Title": "Fast repair", "Author": "Nagort", "ReviewID": "RY9E0KDKFYKQI", "Overall": "4.0", "Content": "I asked for this camera for my birthday based on the favorable Amazon reviews.  I received it in April and have been very happy with the photos it has taken.  Unfortunately in August it stopped working.  However, I sent it in with my receipt and they fixed it with no questions and I had it back in my hands in about two weeks or less.  I think this is a great little camera for daily point-and-shoot and I would buy from Canon again based on their excellent customer service.", "Date": "September 25, 2006"}, {"Title": "Great Little Camera So Far", "Author": "N. Baron \"Out of Time\"", "ReviewID": "R1JJ0PK93DK7OG", "Overall": "5.0", "Content": "I've only had the Powershot for a month, but am extremely happy thus far. It's taking really great pictures. It's easy to use. And, because it's so small, I use it more than my old digital camera. No problems with the screen so far. I just hope I don't drop it!", "Date": "August 1, 2006"}, {"Title": "Fantastic Little Camera", "Author": "Jen", "ReviewID": "R1OFDISCZBQEPW", "Overall": "5.0", "Content": "I purchased this camera (my first foray into digital cameras) and have been very happy with my choice.  My main criteria was that I wanted something very small - and this camera fit the bill.  It fits perfectly into any purse or pocket, but the screen on the back is HUGE and very easy to see.  My only complaint so far is that you have no warning when the battery is running low.  Picture quality has been great - it is very easy to use.", "Date": "July 20, 2006"}, {"Title": "Great camera!!!", "Author": "Melinda Bunker \"Melinda Bunker Photography\"", "ReviewID": "R23MCTSEMHCH9I", "Overall": "5.0", "Content": "Compact, great picture quality, easy to use, LOVE the battery pack- rechargable so never have to buy batteries!!! This camera is perfect for me and I take lots of photos and it really does well inside and out and for close ups and crisp & clear pictures. NOT a lot of zoom so this is NOT the camera for you if your site seeing or wanting pictures of far away objects but PERFECT for children, things, and I give it 5 stars! Solid, easy to use and excellent photos!", "Date": "July 17, 2006"}, {"Title": "Excellent camera, would highly recommend.", "Author": "David G", "ReviewID": "R1UVYPTL7812AV", "Overall": "5.0", "Content": "I am absolutely thrilled with this camera.  I can't say that I've used it too much but it's definitely snapped a few photos.  The battery lasts forever, I didn't have to charge it for a week and a half and was using it (however briefly) every day.  It's ready to use instantly, the screen is clear when reviewing your photos and it even looks good.I'm no expert when it comes to photography so I can't go in to any detail about pixelization when using the digital zoom but if, like me, you are wanting a camera to take photos with of the family; on holiday; on a night out; at a wedding then I can't see why you'd need any other camera than this.I'll be using this for a long time to come.", "Date": "June 30, 2006"}, {"Title": "Beautiful camera!", "Author": "Christopher J. Peikert", "ReviewID": "R3U9EQJMW4XMYP", "Overall": "5.0", "Content": "In short, I love it: takes beautiful pictures, menus are reasonably intuitive, has a great \"weight\" and feel with a tiny profile, long battery life, and huge, bright screen.  I have big fingers but still don't have any trouble with the controls (which are as small as possible, to fit that huge screen on the back side).  And the video feature is a surprising treat -- the videos are clear and crisp, and even easily editable on the camera itself (which is nice for saving storage).My only critique is that I can't tell how much juice is left in the battery until it's almost dead.  The battery lasts a long time, though, so this has only been a problem once.", "Date": "June 29, 2006"}, {"Title": "great camera", "Author": "Jacob Shallman", "ReviewID": "R3RMERIDRMGICO", "Overall": "4.0", "Content": "pros:The camera menu is accessable- this is helpful to change each camera mode easily and quickly.it has a fast response rateno bulking wires for the ac adaptor - small battery chargerlight weightcons;  a little small in the hands -overall- a great camera - highly recommend it!", "Date": "June 26, 2006"}, {"Title": "I love this camera!", "Author": "M. L. Hayes", "ReviewID": "R1QCHZ96907X9R", "Overall": "5.0", "Content": "I bought this camera a few weeks ago and I have been able to incorporate it into my lifestyle pretty nicely.  I always have a camera on hand.  I am a novice photographer and I love taking pictures and need to take them at a moments' notice.  It doesn't take up a lot of space in my purse and can fit into even my smallest purse.  Start up time is very minimal, good for taking quick shots.  Also the time right after you take a pic is short too.  I haven't printed any pics out yet, but the quality looks incredible on my computer.  I will say to buy a case for it as soon as you buy it!  After only 5 days of being in my purse without one, I have an annoying scratch on the lens.  The smallest, sturdiest one I was able to find was at  Wal-Mart.", "Date": "April 10, 2006"}, {"Title": "WOW What a camera", "Author": "Tito Joseph \"...Shadow of Death...\"", "ReviewID": "R3GKN0M6BEQ0EU", "Overall": "5.0", "Content": "This is one of the best camera that you can get for the money.  If you are not a professional photographer this is the best camera for you.  I love the little simple futures that make this camera absolutely phenomenal.  You should definitely get the canon case that is made for this camera (case is capable of taking a pretty good beating that the camera shouldn't take).", "Date": "March 17, 2006"}, {"Title": "Wonderful, compact and overall excellent camera", "Author": "Crazeeflower \"CrazeeD!\"", "ReviewID": "R3HC79XL9COL8L", "Overall": "5.0", "Content": "Love it! It's small, stylish and has tons of features! takes amazing photos and is fun and easy to use my 6 year old can use it! The screen is huge, perfect for all to see! Great camera in every single aspect!", "Date": "March 17, 2006"}, {"Title": "Photos aren't sharp of by today's standards.", "Author": "Brian plays Tennis", "ReviewID": "R1FR94XUX7W6KG", "Overall": "3.0", "Content": "The Canon SD450 is very small and light for travel but it's photo quality isn't quite up to 2010 standards.  Colors are very good but it lacks image stabilization so I had a hard time getting sharp, in-focus photos.  It only has 3x zoom.  The zoom lever and mode switch were a bit hard for me to operate but maybe that's because the used camera was 5 yrs old when I bought it.  There are newer small, compact camera models with IS and much more zoom.  I prefer those.", "Date": "May 24, 2010"}, {"Title": "Canon PowerShot ROCKS!", "Author": "Marjorie M. Barry \"M Barry\"", "ReviewID": "RNQV6E61L40MF", "Overall": "5.0", "Content": "I bought the Canon SD 450 when it first hit the market and I have not been disappointed! Its an amazing camera for the value. I've encourage friends to buy newer models as they  have come available and it has only gotten better.PROS- very little delay when taking photo, easy to use, takes great pictures of moving objects, continuous picture mode has allowed me to capture amazing wildlife photos, super small, sturdy (it has fallen a few times), good battery life with quick rechargeCONS- nighttime photos aren't so good. improve with tripod. improves on Manual mode if you understand how to use these features (my husband does, i don't)OVERALL- excellent buy! Probably would go with a newer model as they are loaded with the latest and greatest features. However 5MP  and 3X optical zoom is more than adequate for the average, frequent, moderately knowledgeable picture-taker.", "Date": "February 29, 2008"}, {"Title": "One of the better compact digital cameras", "Author": "Long Lu \"Dub\"", "ReviewID": "R2P4O1X2K46OF", "Overall": "5.0", "Content": "The SD450 is one of the best digital camera I ever had. The casing seem to be build very solid with metal. The pictures are very nice and sharp. The only bad I have seen so far is there is not battery meter, but the battery last pretty long for my usage.", "Date": "October 10, 2007"}, {"Title": "I love this camera!", "Author": "Jeremy Vaught \"[A] King of New Media\"", "ReviewID": "R35RG8FGMHGG8H", "Overall": "5.0", "Content": "I have owned this camera for over a year now.  I have over 2000 pictures I have posted on Flickr with it, and many more on my computer.  I bought it originally to take on vacation and take pictures of the kids, and it has been in my pocket nearly every day since.  It is so small, and so fast, I have no reason to leave it at home.This is my second digital camera I have owned, but have used many, and using other people's camera, even just to take a few shots for them, reminds me of why I love mine so much.", "Date": "August 30, 2007"}, {"Title": "AWESOME CAMERA", "Author": "Norman Walker", "ReviewID": "R3I4SN4KASFHVS", "Overall": "5.0", "Content": "I am kind of a camera buying junkie I have owned 5 differant digital cameras from Fuji, Sony and Canon.  This little Canon has been by far the best camera I have ever owned.My wife and I love the small size and how durable it is.  It fits easily in a pocket or purse.  We like to take it out with us when we are going out to eat or to have drinks with friends.  The only complaint I can come up with is the flash is not as good as past Elph cameras.March 21 2010 Edited to add:We are still using this camera.  It has had a rough life and shows a lot use but it still takes pictures just like the day we bought it.  We also bought a Waterproof enclosure so we could use it in the water.", "Date": "December 27, 2006"}, {"Title": "GKL's review of Canon SD450", "Author": "Gabby Vera", "ReviewID": "R35SG83BYHUYS8", "Overall": "5.0", "Content": "Excellent product! I had a canon sd400 and was very pleased with it. I am a canon customer for life! After I lost that one, I purchased the 450, and i love it. I thought the 2.5 inch LCD screen would be too big, but it is not. It is the perfect size to view the pictures. It's very clear and crisp. I also dropped the camera from at least 5 feet, and granted it didn't land on the LCD screen, the camera still survived. This camera is great quality.", "Date": "November 10, 2006"}, {"Title": "Great camera", "Author": "S. Gomes", "ReviewID": "R2PHJSX53VB2Q3", "Overall": "5.0", "Content": "I am an amateur and wanted something that was easy to and small to carry around. I wanted something that would give quality pics of my 1st born and this has met my demands.", "Date": "November 6, 2006"}, {"Title": "Canon Powershot SD450 Digital Camera", "Author": "Don E. Sgamba", "ReviewID": "R30B6UW95AY63V", "Overall": "5.0", "Content": "Great little camera.  Very easy to carry and use.  I couldn't be more pleased!", "Date": "November 3, 2006"}, {"Title": "A fantastic point-and-shoot camera!", "Author": "R. PETERSON", "ReviewID": "R2N69QIK31V872", "Overall": "4.0", "Content": "I bought this camera 3 months ago to replace my horrifically slow Samsung digital camera.  The SD450 takes fantastic pictures, with a quick shutter speed.  You don't need to be a genius to operate it, either.  The videos taken are quite nice, too.  I only wish the high speed video mode (60 fps) would last longer than one minute.  A great, moderately priced compact digital camera.", "Date": "October 24, 2006"}, {"Title": "Great compact camera!", "Author": "BJ Ford. \"Max\"", "ReviewID": "RWEGVUBS2QOUQ", "Overall": "5.0", "Content": "Love this camera. I've owned The SD300, and SD400 and finally this one. Really like using it. The burst is awesome and takes pics rally fast during daytime. Nightime shooting is a little slower, but expected from a digital camera this size.", "Date": "October 13, 2006"}, {"Title": "Great Camera", "Author": "M. Osi", "ReviewID": "R3F8TNHB3RRQNV", "Overall": "5.0", "Content": "This camera is awesome! Very user friendly which was a big deal for me-also the size and screen at the back are perfect! I would definitely recommend to everyone.", "Date": "July 31, 2006"}, {"Title": "Great digitable camera!!!!", "Author": "Kate Garrison \"Shayden\"", "ReviewID": "R1MW9XCRIMI3JT", "Overall": "5.0", "Content": "This is a really great camera and takes really wonderful and professional looking photos! I have two babies and I am using my new camera daily! If you buy this camera you should also buy the upgraded memory card because the 16 MB is not enough. I also really love the software that comes with the camera as well. Its very easy to use. I highly recommend this camera!", "Date": "July 30, 2006"}, {"Title": "passed the techno son test", "Author": "G. Lehman", "ReviewID": "R252L6LJWG3PKG", "Overall": "5.0", "Content": "Got one for my son the techno wiz and when it passed with flying colors I got the second one for my daughter who's just as pleased.", "Date": "July 25, 2006"}, {"Title": "The BEST", "Author": "K. Gorman \"M's Mommy\"", "ReviewID": "R2JE0056YT0D47", "Overall": "5.0", "Content": "This camera is great and easy to use.  The large screen on the back makes it easy to review pictures and much more.  I would recommend this camera to everyone!", "Date": "July 3, 2006"}, {"Title": "Excellent value", "Author": "LoveyourBMW", "ReviewID": "R9925PWF9ZH4E", "Overall": "4.0", "Content": "I bought this as a gift for my dad.  He loves it and its quite easy to use for the non technical person.  Great quality images!", "Date": "June 28, 2006"}, {"Title": "good camera until the screen randomly blanked out", "Author": "JMV", "ReviewID": "R1UZ2QDL9PTVRJ", "Overall": "4.0", "Content": "i bought this camera in December 2004 and it has been fantastic, except for the horrible night settings - it does not take outdoor night settings well...or at least i can't seem to figure out a good setting to put it on.we were just using this camera this July 4th weekend, and suddenly the LCD screen went totally blank when i tured it on. i could take photos, i just couldnt see what i was taking...and i couldn't delete anything. SO FRUSTRATING. so now i need to buy a new camera ASAP in time for a wedding i have in a week.", "Date": "July 6, 2006"}, {"Title": "The Perfect Camera!!!", "Author": "Leandro \"Leandro\"", "ReviewID": "R20OB7YRIAU7SV", "Overall": "5.0", "Content": "Amazing... This camera I can carry with me all the time. Fit's in any pocket. It's a small camera with a high quality pictures.", "Date": "March 23, 2006"}, {"Title": "Love my camera", "Author": "Susan Rivera \"twinmom\"", "ReviewID": "R1JUV2B2SIS9DK", "Overall": "5.0", "Content": "This is the third Canon camera I have owned, previous were Elph's.  This is a great camera, compact fast and easy to use.", "Date": "March 19, 2006"}, {"Title": "Perfect little camera", "Author": "Rebekah \"RLK\"", "ReviewID": "R2P9ILTQWHCKL7", "Overall": "5.0", "Content": "I wanted a small digital, 5mp camera that had a 2 inch or larger screen AND an optical viewfinder.  Most newer models from Nikon, Konica Minolta, Sony, etc no longer include this. When using outside and it is hard to see the LCD screen, I find this very useful.  The battery lasts a long time and charges quickly in its own charger - not through the camera.  Another important thing to consider since you can't use the camera and charge the battery at the same time when the camera IS the charger (even if you have a second battery).  I am very pleased with my purchase and use it all of the time.", "Date": "February 1, 2006"}, {"Title": "Very good", "Author": "C. T. Thompson", "ReviewID": "R21LZQ9HUACE8H", "Overall": "4.0", "Content": "This is my second digital. Love the compact size and optics. The zoom control is a little cumbersome but that's the only negative I can think of. The value is hard to beat.", "Date": "March 24, 2006"}, {"Title": "Powering Terribly Slow", "Author": "G. LI \"gli\"", "ReviewID": "R12476R44KOIMO", "Overall": "1.0", "Content": "Unbelievable so many people are praising SD450! Are there people paid to do this? I got this camera two weeks ago just because I read so many 5-star comments. But I am regretting I was cheated by them. This camera simply needs 5 seconds to flash from you start to press the shutter button!!! We went to a Zoo last weekend and tried to take a picture of a Lion when it was walking towards us, so I quickly pressed the Camera button, hold it and waiting for the flash (or some sound indicating finish)... I held it so long, it finally flashed, but what I saw on the LCD was the lion's heap --- it had already turned around.I had this kind of experience almost everytime I shoot. This camera just responds so slowly! It is only good for talking pictures of static objects. Even that, I am getting wholly white pictures from time to time. It is just so disappointing with so many praises from others ....", "Date": "April 14, 2006"}, {"Title": "Great camera but hard to hold", "Author": "C. Cole", "ReviewID": "R27EG7FVBCMXYV", "Overall": "5.0", "Content": "This camera takes great pictures. I have average size hands for a man and it is difficult for me to hold this small camera in a secure way. The only other drawback is the lack of a battery charge meter. Best camera I found for under $300.", "Date": "April 27, 2006"}, {"Title": "Fun little camera at a great price!", "Author": "J. Kowalsky", "ReviewID": "R17HV7QIZ7R9QG", "Overall": "5.0", "Content": "Quick to take it to the Chicago Flower Show and had awesome time playing with our new Canon! The large viewing screen was the best part, easy to frame and snap! Highly recommend !", "Date": "March 22, 2006"}, {"Title": "Canon SD450", "Author": "Macy", "ReviewID": "R2RFLCADU2GL4P", "Overall": "5.0", "Content": "Love this cameraIt takes great pictures.Battery Life: DecentThe only problem is that if you want to take pics with date imprinted on the picture, you can only choose postcard mode. Also, there's no battery indicator.", "Date": "January 12, 2006"}, {"Title": "Good, better, but not perfect yet", "Author": "K. M Merrill \"justine\"", "ReviewID": "R3IE6D2O0AKJ9U", "Overall": "4.0", "Content": "I have had a powershot a40 , a60, A85. I travel a lot and have coveted a SD for the smaller size.  My last camera was a A 85, which was a sturdy, tough, travel hardy , but heavy camera. I gambled and bought this before my trip in August, back to Turkey.Its light,fits in a sunglass case in my purse, has a great international battery charger, and takes great macro photos.  ( now have stunning art cards)I love the close shots, am worried it does not have the distance range of the A 85, or the light control, the A85 did a fantastic job of low light, no flash shooting.Its a switch from  the A  cameras, maybe not for the better.Love the size, have misgivngs about shots over 15 feet. And the low light, no flash shots, where the A 85 excelled.[...]", "Date": "July 11, 2006"}, {"Title": "Another Great Canon Camera", "Author": "JL", "ReviewID": "RYBB8Z8MHLPX3", "Overall": "5.0", "Content": "I bought the Canon SD300 for my daughter last year and thought I would get my wife the SD450. It is great camera...very small and fits easily in my wifes purse. I also bought the Canon case for the camera and it works very well if you don't need a lot of protection for the camera.", "Date": "March 23, 2006"}, {"Title": "Overall this camera camera is just great.", "Author": "David Simons", "ReviewID": "ROGGR6URZ5SGW", "Overall": "5.0", "Content": "I finally got a really small camera! I was surprised by tha large size of the display/screen is almost as big as the camera itself.Overall this camera camera is just great. It takes clear video and very nice pictures. It's also very easy to use, and it comes with a convenient battery charger.I am very impressed with this little camera. If you dont really know a lot about digital cameras and you are looking for something that is very easy to use, takes a great pictures and video, and it is very portable, I would definately recommend the SD450.", "Date": "February 21, 2006"}, {"Title": "Love it!", "Author": "June Martin \"June Bug\"", "ReviewID": "R2U0CMT5KCRVAE", "Overall": "5.0", "Content": "Love the ease and the feel of this camera. I think for the price, it's a great little camera. Very happy with this purchase.", "Date": "July 21, 2006"}, {"Title": "Great for me", "Author": "Stephanie", "ReviewID": "R2VLNI9DO7G6VQ", "Overall": "5.0", "Content": "My old one broke and I love this model! Viewfinder is great! I was happy with the old one I dropped so glad to find another!", "Date": "January 9, 2014"}, {"Title": "Powershot SD450 at very reasonable price.", "Author": "Mary A. Kubler", "ReviewID": "R4SWLW7NAMKF8", "Overall": "3.0", "Content": "To be fair the price was so reasonable that there were bond to be some drawbacks. Battery contacts were bad, but with new battery and cleaning OK now. Camera had clearly seen a lot of use.  Seller sent wrong charger but courteously apologized and I already had a correct on.So yes, I am satisfied.", "Date": "September 1, 2013"}, {"Title": "Canon Powershot (my old favorite, not made any more)", "Author": "H. Robinson \"Enjoying being a grandma\"", "ReviewID": "R115GM3BEWGAID", "Overall": "5.0", "Content": "I was so bummed when my favorite camera started to fall apart.  Duct Tape helped for a while, then it was done.  SOB!  Thinking I'll have to buy a new camera and spend days learning how to use it...  BUT, so happy to find my dear old favorite on Amazon!  This baby is \"bran-new\", and I love it!  YEAH!", "Date": "July 24, 2013"}, {"Title": "I Love this Camera!", "Author": "Kathryn6586", "ReviewID": "R1HQCI191459GK", "Overall": "5.0", "Content": "I got this camera as a gift almost 8 years ago...at that time it was priced at over $400. It's crazy how much the prices of digital cameras have come down since then. This camera has lasted so long and just recently stopped working after my friend dropped it while on vacation. I am planning to order a new one. This thing worked great and was very durable...lasted such a long time and I was so sad that it broke!", "Date": "May 20, 2013"}, {"Title": "Love this camera!", "Author": "Jotaluke", "ReviewID": "R2YX935VF69OLM", "Overall": "5.0", "Content": "This little jewel has the best pictures.  Small but powerful.  For use at our office to carry to various technical jobs to photograph before and after work.  I like this camera much better than the newer ones of this style.", "Date": "January 22, 2013"}, {"Title": "Camera with a little fault", "Author": "Stefan J. Anderko", "ReviewID": "R28YVMKHXCRA0D", "Overall": "2.0", "Content": "The camera is good,  just as promised.  The only fault I found with it is that the cover for USB connection is broken and falls off every time USB is used.  This does not influence the quality of pics of course,  but it's an incovenience  because the part is small and could be easily misplaced.  On the other hand,  the camera was bought as used,  sserves its primary function so I would say I got a good product for the price.  Nevertheless,  had I known about the faulty cover I would not have bought it.", "Date": "July 15, 2009"}, {"Title": "Great Camera", "Author": "LuLu \"Lulu\"", "ReviewID": "R26M7RZ20U25UC", "Overall": "4.0", "Content": "I love this camera.  These days there seems to be smaller/slimmer cameras available and that is the only reason I did not give it 5 stars.Large viewing screen, several great options, easy to transfer to my computer and simple rechargable battery.", "Date": "October 3, 2008"}, {"Title": "canon for cameras", "Author": "Aruba", "ReviewID": "RRYW47DSUUHAN", "Overall": "4.0", "Content": "takes great pics, compact and nice design.  some of the features that you need to use are less than intuitive as indicated by the thick owners manual.  simplifying use of the cameras features would great enhance this product.", "Date": "July 18, 2008"}, {"Title": "Great camera", "Author": "Winter Wonderland", "ReviewID": "R14091TZOGENP0", "Overall": "4.0", "Content": "I love this camera!  It takes great pics.  There are only a few things I would improve with this camera. I wish it had a better zoom.  I also wish it had a battery indicator that was on or at least optional. This one comes on just before it goes dead.  It fits nicely in your pocket.  Has lots of cool features. I would highly recommend!", "Date": "April 21, 2008"}, {"Title": "Good", "Author": "Adarsh Reddy \"Ace Reddy\"", "ReviewID": "R21BG2A8J6H70A", "Overall": "4.0", "Content": "Love this camera!!! It days outside picures amazingly well (with good lighting).. It does give a lot of red-eye though on inside pictures but nothing photshop can't handle.", "Date": "March 27, 2008"}, {"Title": "it is ok", "Author": "an engineer", "ReviewID": "R25EIRIJH9AROM", "Overall": "3.0", "Content": "This one is good for my trip home. The one reason I am not very happy is that the responding time is a little bit long for me. Maybe I am little picky. But it is okay for beginner.", "Date": "October 1, 2007"}, {"Title": "Love this camera!!", "Author": "Deette D. Schmitt", "ReviewID": "RDOHXISRMRR7I", "Overall": "5.0", "Content": "I have really been impressed with this product.  The camera has a huge screen that people are always jealous of.  It works great and can really zoom in.", "Date": "July 25, 2007"}, {"Title": "Good Digital Camera", "Author": "Guanghong Yang", "ReviewID": "R5L29KK0U0KVZ", "Overall": "5.0", "Content": "I bought Sd 450 Mar, 2006, I think I did right thing, SD450 is very good digital camera.", "Date": "July 9, 2007"}, {"Title": "Our first digital--easy to use & takes good pictures", "Author": "a viewer", "ReviewID": "R287FKWBCSGP02", "Overall": "5.0", "Content": "We've had this camera for over a year and enjoy using it.I am not an expert, and the camera has features we've never used, but we are very satisfied with it.  It is so easy to use and takes good pictures.  It is also very small and easy to carry.  We bought the Canon leather case for this model, which protects it and is no trouble to use.  We also bought a 2-gig SD card, and it holds tons of pictures.  We have no complaints!", "Date": "June 22, 2007"}, {"Title": "Buy!", "Author": "S. M. Stucky \"Brazilian Piranha\"", "ReviewID": "R5G48GQMXZWH9", "Overall": "5.0", "Content": "This camera is awesome. It's like an Ipod, instructions are not needed. Every time I use it I get complements on my camera wishing they had one. Takes great pictures, good battery life, vivid pictures. Video quality is very good. Also it is durable. I would recommend Canon SD450 to anyone.", "Date": "June 15, 2007"}, {"Title": "Served me well.", "Author": "A. Yerxa", "ReviewID": "R380CNC7G2W7WI", "Overall": "4.0", "Content": "This camera has served me very well for the past year, my only complaints are a few months after use, there are dead pixels on the LCD viewfinder and there is a huge chunk of dust stuck in the lens, I have no idea how it got there. It doesn't get in the way of pictures for the most part but it is annoying. Although it is easily Photoshopped.It's nice and sturdy, I even dropped it in a cup of beer once and it lived to tell it's tale. Nice and compact, I keep it in my purse for random cute photographs of my daughter.I previously owned a Kodak  EasyShare and while it was only 4 MP, it took better photos (white balance and vividness). The Canon needs a little tweaking to get the desired look you want.", "Date": "May 2, 2007"}, {"Title": "run down after a year", "Author": "Kelly", "ReviewID": "R1NCXBO4Z71R11", "Overall": "3.0", "Content": "it worked wonderfully for more than a year. there's not much zoom, but it's super compact, so that's what is expected. the quality of photos was great. but then, the pixels started going. the worst part was when the zoom started sticking and now i can only take photos with no zoom or all zoom. and then what used to be a great feature, the photos in view mode would rotate so they filled up the whole page, started sticking, too. so instead of just the photos taken vertically showing up vertically on the lcd, now the horizontally aligned ones did, too. which basically means that most of the photos can only be viewed at half of the physical size of the lcd screen. this is why i should have gotten an extended warranty. live and learn, i guess.", "Date": "April 25, 2007"}, {"Title": "Another great Canon Camera", "Author": "R. Carandang \"optimus25\"", "ReviewID": "R3OB3L0PN05U51", "Overall": "5.0", "Content": "I bought this camera for my mother in-law before the left on their trip to Australia.  The controls and features are very intuitive.  Set up was a breeze.  For a point and shoot, pictures came out vivid; and with great color.  Its a great camera.", "Date": "March 28, 2007"}, {"Title": "Overall -  a great little camera", "Author": "JMAC \"majunbon\"", "ReviewID": "R3HF9B80L5BM2O", "Overall": "4.0", "Content": "I've had this camera for a year now and it is a perfect little camera for travel. We have another Canon camera and a camcorder, so we are big fans of Canons. The reason it only gets 4 stars instead of 5 was because of the battery. I would charge it fully, and then I'd only be able to take a few shots before the battery died again. The night settings are also poor- don't try to zoom while using night setting- very blurry shots. I believe that canon does not make the actual battery, so that might be why my battery was on the fritz. For outdoor shots, and close-ups, this camera is great.", "Date": "March 19, 2007"}, {"Title": "Perfect for my wife", "Author": "Troy Brown", "ReviewID": "R2TWAC02LLAYA5", "Overall": "5.0", "Content": "I use a digital SLR myself, and my wife hates its size.  So I bought this on for her, and she has taken a lot of pictures that we would have never gotten if she had to use my camera.  The colors are very good and it is very easy to use.", "Date": "March 8, 2007"}, {"Title": "canon SD450", "Author": "Marcel Schmid \"z'marsi\"", "ReviewID": "R2Q7XVLL7G4YTD", "Overall": "5.0", "Content": "it's a great little camera small and sturdy and the battery holds very long and is very fast recharged", "Date": "January 9, 2007"}, {"Title": "Fantastic", "Author": "Austen Fan \"Austen Fan\"", "ReviewID": "R2QXR6NM1RAGHL", "Overall": "5.0", "Content": "I took this camera to India for three months and took thousands of pictures.  I bought an extra battery which I needed.  The only negative is that the camera doesn't let you know how much battery power is left.  Perfect for any occasion.  My roommate loved it so much she bought one for herself.", "Date": "January 8, 2007"}, {"Title": "Great camera for an amateur", "Author": "Lillan \"Lillan\"", "ReviewID": "R2Y7YH67R0K4JP", "Overall": "5.0", "Content": "Easy to handle and take photos and also easy to upload to the computer.  I am very satisfied.", "Date": "January 3, 2007"}, {"Title": "LCD Screen!!!", "Author": "casigrl \"casigrl\"", "ReviewID": "RC8Q891G6QIQ2", "Overall": "3.0", "Content": "Had my SD450 for 6 months of pampered care and the LCD screen is all scratched up. I've had 4 previous digital cameras and never had a scratch on those. Seems to scratch all by itself. It's incredible. Thanks to Costco's 100% satisfaction guarantee I took it back today. No questions asked!! Can't beat Costco!!!! Other than that, the camera took nice pictures and was very quick.", "Date": "November 14, 2006"}, {"Title": "Great camera.", "Author": "Regis T. Atwater", "ReviewID": "RPO7GYZ0S5JD1", "Overall": "5.0", "Content": "I have owned 2 canon digital cameras over the past 5-6 years. My first one was great and lasted 5 years until it was stolen in S. America, so I was \"forced\" to upgrade. The SD450 and SD600 are pretty much identical except for the megapexils. I tried both and couldn't find any difference. The price was the same so I opted for the SD600 and gave the SD450 to a friend. He loves it as well. The battery life is great and the big LCD is fantastic. I'm going to try to keep this one for a good 5 years.", "Date": "November 9, 2006"}, {"Title": "Canon powershot cannot be beat-literally", "Author": "Samuel D. Beam", "ReviewID": "R3O0ZCLK1J3DP3", "Overall": "5.0", "Content": "I love this camera. I bought it to replace a 5 year old Canon Elph. The Sd450 is light good looking, easy to handle and tough as a James Bond 007 camera can be. Picture quality is more than enough for the novice and suprisingly ample for a Pro. This could be your first camera that will last or this could be a backup in a pro's gearbag.", "Date": "November 9, 2006"}, {"Title": "Canon Powershot SD450 5MP Digital Elph Camera", "Author": "Steven Wang", "ReviewID": "R3QJA15KAB0019", "Overall": "4.0", "Content": "After reading other reviews on the camera i was scared of the error code that some customers got with their new cameras. So far ive used my camera for 3 months with no issues. I can only suggest to becareful with your camera and you will not get that display problem that everyones talking about. As for the quality of the camera, its excellent, nice pictures for the value of the camera. This is the second Canon elph i owned, and the other one i had for 1 1/2 years and loved it, but i got a new one because i dropped it, that was the only issue, its not drop proof. :)", "Date": "November 6, 2006"}, {"Title": "Great camera", "Author": "Ana Petrova \"bananaknits\"", "ReviewID": "R140OPHM7ZMAD", "Overall": "5.0", "Content": "I loved my previous digital Elph and I love this one even better. It's smaller, and the screen is larger. Great to take pictures with excellent Macro function.The zoom is not great but everything else is great. I especially like the \"grid\" feature.", "Date": "August 3, 2006"}, {"Title": "GREAT BUY", "Author": "C. Austin", "ReviewID": "R15FY2HB30F7B9", "Overall": "5.0", "Content": "I did alot of research before buying this camera and I read the reviews and looked at how many stars and it worked out to my favor.  I love this camera!  The best feature is the rechargable battery!  It's easy to use and takes awesome pictures!", "Date": "July 17, 2006"}, {"Title": "Back from the dead", "Author": "R. Turman", "ReviewID": "R13ITUQY0O20QS", "Overall": "5.0", "Content": "I love this Camera!  When my 4 year old fell in a lake I had to jump in and get him.  After we got out of the lake and he was okay I realized that my sd450 was in my pocket and was totally destroyed.  It had been submerged for about 2 minutes.  I let it dry out and tried it the next day and it did not work.  I figured it was a gonner.  Every couple of days I would try to see if it would come back on.  Almost a month later my wife was going to throw it in the garbage when I said lets check it one more time.  It worked.  Almost a month after going swimming the camera worked again and it takes great pics just like before. This is probably a rare incident but it is true.", "Date": "July 15, 2006"}, {"Title": "Love, love, LOVE this camera...", "Author": "M. M. Sanchez", "ReviewID": "R12X2N4D4JUPO3", "Overall": "5.0", "Content": "Everytime I ask someone to take a picture with my camera, they always comment on what a great camera it is.  In fact, that is why I bought it... a girlfriend asked me to take a picture and handed me this fabulous lil digital camera... and I fell in love with it.  It has a ton of features, takes AWESOME pictures, and fits in the palm of my hand.  LOVE IT!", "Date": "July 3, 2006"}, {"Title": "Love it!", "Author": "M. Jacobs", "ReviewID": "RG37G2IE2GIWQ", "Overall": "5.0", "Content": "If your looking for a compact easy to use camera, than this is the one you want. If your looking to grow with you camera play with ISO settings and effects the SD450 can do that too! I wanted a camera that I could tweek @ times yet was simple enough for anyone to point and shoot. Has a nice big display yet a compact body the 12x electronic zoom worked great even without a tripod.", "Date": "July 2, 2006"}, {"Title": "Good camera", "Author": "Kara Fox", "ReviewID": "R1XA0CSPBZPGYN", "Overall": "4.0", "Content": "I'm still getting used to this camera. It was recommended to me by many people and I like it. There are just so many programs on it that it has taken a bit to figure out. However, the quality is fantastic and it is small that you can put it anywhere - even your pocket!", "Date": "July 2, 2006"}, {"Title": "Enjoying the SD450", "Author": "george", "ReviewID": "R3NTHIUTWRKTY2", "Overall": "5.0", "Content": "Have had the SD450 for just over a month and recently took it on vacation. It turns on quickly and is easy to use - pictures are clear. Only complaint is that the memory card does not show up on the desktop when plugged into the computer (Mac OSX) - apparently this is the rule with Canon cameras.", "Date": "July 2, 2006"}, {"Title": "Great Camera", "Author": "Foyen", "ReviewID": "R2RQ4ZAQMBDGMK", "Overall": "5.0", "Content": "Why can't everything in life be this easy to use.  No effort, perfect pictures and idiot proof.  When will cars and computer software work like this!!", "Date": "June 28, 2006"}, {"Title": "Great pics & easy to use!", "Author": "SuperJenn", "ReviewID": "R12PRBPQ3DJZUG", "Overall": "5.0", "Content": "I received the Canon Powershot Elph for my birthday last year and I love this thing. I'm not the most computer-savvy person in the world, but this camera was so easy to use. I felt like there was no way to screw it up. Takes excellent pictures, is very light-weight and even fits in my little purse with ease. Easy to load them onto the computer too. If you're looking for a good digital camera or your friends & family need good gift ideas for your next birthday or the holidays, this is the one to pick!", "Date": "May 25, 2006"}, {"Title": "Great Camera, Great Price", "Author": "Colorado,Springs", "ReviewID": "R3GOZW79LG41IO", "Overall": "5.0", "Content": "I just came back from a trip and took close to 400 pictures with my new SD450.  All I can say is this camera is wonderful.  My pictures came out great. The camera is small with a huge LCD screen, it's pretty easy to use and you can just click away, as it turns on and snaps pictures very quickly.  I've read some reviews about poor battery life.  I did not have this problem at all, and I always have my LCD screen on.  Each night I'd just recharge the battery and it would last through the whole afternoon of picture taking.  The camera also takes videos which is very nice as well.  I'm just a novice at this stuff, but the camera worked well for me.  I believe that the few who wrote about the  poor picture quality have probably worked with more advanced equipment, so this camera may not be a good choice for them.  But anyone who just wants a great little camera to take around and snap some nice pictures, should be very pleased with this one.  I researched for quite a while before settling on a Canon, and I'm very happy that I did.  When researching cameras I did notice that there were tons of complaints about the LCD cracking or scratching easily. I solved this problem by ordering an acrylic LCD shield online (not those disposable ones, but a hard plastic shield).  It fits beautifully over the LCD screen, and looks like it was part of the original camera.  It's scratch proof and there is no way the LCD is going to crack with this thing on it.  It cost me $8 including shipping.  Overall, if you are considering a Canon, try this one.  I think you'll be very pleased.", "Date": "April 28, 2006"}, {"Title": "Amazing little toy", "Author": "J. Hoerdeman", "ReviewID": "R109W83LSYMBMM", "Overall": "5.0", "Content": "I got this camera to replace my clunky Kodak Z740 (basically a point-and-click trapped in a DSLR body). I was afraid it wouldn't be very flexible, but it is crammed full of options I just didn't expect from a compact. There is plenty of adjustability with ISO speeds, shutter speed, color, lighting and so on. The macro mode, by the way, is phenomenal. Then there's all of the cool non-essentials like time, noises, and display themes. It even has a histogram function in the review mode, which is exactly as nifty as it is useless. Plus it feels and looks solidly built- the only thing is that the big screen is a target for scratches and other damage. A little silicon or see-thru gel can protect that just fine. Start-up and picture-to-picture speeds are very good. Even at the highest image quality settings, a little memory goes a long way (about 100 pics on a 256 meg card).", "Date": "March 10, 2006"}, {"Title": "Simple compact camera great for point and shoot", "Author": "JG", "ReviewID": "R139C5M79HXKPT", "Overall": "5.0", "Content": "I owned the SD200 first and now this one.  Love them both, but I don't think I realized how much I like the SD200 until I got this one.  The increased megapixels are not noticeable on the 4x6 prints of the snapshots that I take of the kids.  Quality is great for that either way.  The big screen is a blessing and a hindrance.  The controls on the SD200 were larger and easier to navigate.  Now, I don't need bi-focals, yet that is, but the controls on the back of the SD450 were so tiny I no longer felt that they were as easy to navigate even though they are essentially identical to the SD200.  The bigger screen is nice, but not really necessary and I'm noticing more frequent battery recharges are needed.  Used to be able to fill and empy the 512MB card in the SD200 and I can't get this one to go as long yet.  Plus that bigger screen has made the controls tinier.  One good control innovation was changing the mode selector to vertical instead of horizontal.  That has eliminated the accidental switching modes when pulling in and out of the case.  The video mode is even smoother than the old one, but still not at the level of a dedicated video camera.  All cameras have limitations, but this camera is very portable, quick, accurate and easy to use.", "Date": "February 5, 2006"}, {"Title": "canon makes good cameras!", "Author": "Nw Wade \"Nw Wade Esq\"", "ReviewID": "R134W1E3CXZE00", "Overall": "5.0", "Content": "Yeah, i went to that same website to get this camera for free and it's far better than the first digital camera i got (samsung digimax-1.3 megapixels) which the battery latch didn't even last 3 months on it (I had to use tape on it so the batteries would power the camera).  It's small for a digital camera, i like how heavy it feels compared to some of the other digital cameras in the market.  I also like the screen on this camera which is larger than most digital cameras too.  The battery is awesome because I never have to buy special \"AA\" batteries for a good battery life and the fact that it's rechargeable!  I never had a zoom camera, so this is my first experience with this type of camera.  The pictures are amazing too!  I shot a picture in a dark hallway and it looked great!  Canon even thought of everything too!  (well i guess they would if you paid $300 for the camera) A 16mb memory card was included with the camera which was awesome that I didn't have to run to the store and purchase a memory card right away.  In conclusion, this is like one of the greatest cameras and i'll buy Canon cameras for now on.", "Date": "January 13, 2006"}, {"Title": "Very nice camera!!!!", "Author": "G. D. Cameron", "ReviewID": "R2Q30RLMUZ0EVQ", "Overall": "5.0", "Content": "I had an SD300 which was stolen.  We decided to upgrade to the SD450 and I'm glad we did.  Very nice screen (2.5\").  And it seems that everytime I see a newer Canon camera they've improved the interface, i.e. button location/function and features!!!  It would be nice if they had a battery level indicator, I've bought an extra battery so we never get caught without juice.Highly recommended camera!", "Date": "February 23, 2006"}, {"Title": "Cute Little Camera", "Author": "Ramireddy", "ReviewID": "RM7VJ5WOI33L7", "Overall": "5.0", "Content": "I Purchased first time Digital camera and went for this model. I am really happy about the performance and size. Its giving real good quality pics. Morever i am happy about LCD display, Its real fantastic.But only thing is there is no measure for battery usage.", "Date": "July 25, 2006"}, {"Title": "canon sd450", "Author": "Howard E. Yeomans", "ReviewID": "R2PVNSSF6UPRT9", "Overall": "5.0", "Content": "Far superior to previous cameras I have ownedBest features are small size, excellant battery life, no long period between pushing shutter release and taking the picture.", "Date": "July 10, 2006"}, {"Title": "Photos aren't clear", "Author": "Matt", "ReviewID": "R2I690BJB2DIRU", "Overall": "3.0", "Content": "I bought a SD450 and took it back because it would not focus.  The replacement focuses better but the shots just aren't clear.  I have a 3.2 mp Olympus which doesn't flash properly anymore so I wanted to replace it and upgrade.  That camera's picture are WAY clearer than the Canon's.  Am I jinxed?  Could I have received two defective cameras?  Others who have this camera don't seem to have my problems.", "Date": "December 11, 2005"}, {"Title": "Not for Diving!", "Author": "Real Name", "ReviewID": "RME76CGEYROZ7", "Overall": "1.0", "Content": "Do not buy this camera if you want to use it for diving ... the only Canon underwater case made for it is only rated to 10 feet. The better rated cases do not fit.", "Date": "April 23, 2007"}, {"Title": "I think I'm going to return it...", "Author": "Girl on a hill", "ReviewID": "R29R9K7V2SRBQ2", "Overall": "2.0", "Content": "Well, I bought this for the size and because it's recommended by Consumer Reports.  HOWEVER, I have several major complaints:1) the pictures just are not that great (focus-wise)2) the flash completely overpowers pictures so that subjects look all white3) the red-eye reduction does not work at all... I was unable to get indoor shots of my children without glowing red eyes4) the zoom is not very strong... I would rather be able to zoom in more5) As others have noted, there is no battery indicator.Oh well, I guess this is going back.  I guess I'll start researching cameras, again!!", "Date": "February 23, 2006"}, {"Title": "the best compact camera", "Author": "J. Boscan", "ReviewID": "R2YSLMW5J6OBCR", "Overall": "5.0", "Content": "Excellent compact camera. Very small so you can carry it in any pocket. Very fast so you can take several pictures very fast. It does not have all the settings capabylities as a bigger or SLR camera but my main concern was to have an easy to carry camera. Good zoom (optical+digital), easy to use and easy to set. Far better than a Sony. Would recommend any SD from canon.", "Date": "January 4, 2007"}, {"Title": "perfect!!", "Author": "keLLy \"paLm tRee\"", "ReviewID": "R2AI21TBCSNP29", "Overall": "5.0", "Content": "What can I say? Its the best camera I\"VE experienced! That doesn't mean its the best camera out there but to me it's PERFECT! The zoom quality: excellent! The picture quality: super! The resolution: wonderful! I absolutely love the video feature: it takes average videos when you just want to capture something quick. The ONLY problem i have, which doesn't bother me much is that i can never tell when the battery is running out until theres like 1 minute till it automatically shuts off. I think it could be improved by using reagular alkaline batteries instead of special camera ones. Anyhow I am still in love with this great camera. I would definately reccomend this to anyone looking for THE perfect camera!", "Date": "June 23, 2006"}, {"Title": "Great small camera", "Author": "M. McCullough", "ReviewID": "R1VXPY6P1G44H", "Overall": "5.0", "Content": "I was looking for a small pocket sized digital camera for a friend that was going to Africa.  This camera is great because it's small, sturdy, and takes great pictures in both night and day.I know my friend really likes this camera a lot.  It's got some really great advanced features but it's easy enough to just turn it on and use it out of the box without having to read the manual.The overall image quality is great and the flash is very powerfull.", "Date": "November 17, 2006"}, {"Title": "Best Camera (compact)", "Author": "Liscelle Aurora Carrillo", "ReviewID": "R3FSHD6CRR01VH", "Overall": "5.0", "Content": "This camera has proved itself. I bought in May and received it in time for my cousin's wedding. Boy did it come in handy. I took snaps, takes great pictures, even with the zoom, it works very well. I was also able to record short video clips with great ease, the mic works well u can hear and see clearly. You can change settings for what ever type of pictures and environment you want to snap shots in. U can set it on automatic and just let it do it all for you. I am quite happy with this camera. The lcd display screen is great, its clear, its nice to use and with great care I am sure this camera will me a long time!!! I am glad I made the purchase.", "Date": "July 5, 2006"}, {"Title": "Just What I Wanted", "Author": "Karen H", "ReviewID": "R2K4RPA7LNXMQA", "Overall": "5.0", "Content": "I really love the compact size of the camera and its large viewing screen.  I'm an amateur and don't use all the features yet but the basic features aren't hard to learn and use.  My kids love it too and manage to get some very nice pictures.  It's just what I wanted.", "Date": "July 3, 2006"}, {"Title": "Nice Camera", "Author": "A. V. Test \"Ash\"", "ReviewID": "R2PMEQK9SPV6PY", "Overall": "4.0", "Content": "I trust Canon camera's like anything and SD450 didn't let me down.It has all the good features that I am looking for.", "Date": "June 27, 2006"}, {"Title": "Awesome Camera", "Author": "M. Liu", "ReviewID": "R2FWNTGER5QUIV", "Overall": "5.0", "Content": "I love the camera - my only complaint is that I don't know when the battery is low... but I can pretty much gauge when I need to charge the battery.I LOVE THE BIG 2.5\" SCREEN.All my friends are jealous.", "Date": "March 7, 2006"}, {"Title": "Easy to use", "Author": "Nicole Lepek \"slvrchr45\"", "ReviewID": "R1OE1KXMG7X36Z", "Overall": "5.0", "Content": "This camera is a good point and shoot digital camera. It is easy to work and the pictures come out great.", "Date": "March 25, 2006"}, {"Title": "Known issues", "Author": "M. Kutrieb", "ReviewID": "R1JNK2I8NUNRH2", "Overall": "1.0", "Content": "This camera (as all of the Elph line) has a major design issue.  Before purchasing this camera please do a web search for \"Canon E18\".  It is an error code that has spawned a class action suit against Canon as well as a lot of disappointed customers.  I have to say I loved the functionality and size of my Canon Elph until I got the E18 error message- the camera is now in the garbage(two years old) and I am once again spending $ on a new camera (with Amazon but not on a Canon)", "Date": "April 24, 2006"}, {"Title": "broken already", "Author": "B. Nelson \"camera fin\"", "ReviewID": "R3GHB9WJ9D508K", "Overall": "3.0", "Content": "i had this camera for 8 months and now its frozen and doesnt work. other wise worked great!", "Date": "July 10, 2006"}, {"Title": "super fast shipping, very big LCD display and good photo quality", "Author": "Lillian", "ReviewID": "RXXR7JUT4CXXH", "Overall": "5.0", "Content": "I ordered it on Firday afternoon and received it next Monday morning. And it is FREE shipping! Just cannot believe how efficient amazon is. The camera is really small, but the LCD is very big, as bit as the camera itself, and even bigger than my canon rebel 350, which is huge compare to it. The picture quality is comparable to rebel 350.", "Date": "May 26, 2006"}, {"Title": "Excellent - Excellent Converted My Wife to Digital Pictures", "Author": "Andrew Donnell \"A. Donnell\"", "ReviewID": "R2RG1M7ZJOU3", "Overall": "5.0", "Content": "First off let me tell you my brother has a 3.2meg, my mom has 4.0, and I have a 5.0 (well my wife now has it) she also has a 35mm she doesn't use anymore. We ALL love these cameras.It is hard to believe such a small camera can take such Excellent pictures. If I was going to buy a prosumer quality camera this is what I would buy or spend $1,000+ for a slr or medium format.It is excellent and we have 3 cameras.", "Date": "December 29, 2005"}, {"Title": "caron sd-450 5mp digital camera", "Author": "Dick \"The Dickster\"", "ReviewID": "R1TJP5YTCIAYII", "Overall": "5.0", "Content": "Lokks like it will be great...haven't used much yet. Love the larger 2.5\" screen. Too many features for the novice. Suggest novice buy a less complicated cheaper camera.", "Date": "January 15, 2006"}, {"Title": "Great product, nice pictures", "Author": "Francisco Javier Cachu Can", "ReviewID": "R9B0FXG62OHBB", "Overall": "5.0", "Content": "This is a great and not expensive camera, it takes wonderful pictures, I am loving it, I recommend it.", "Date": "January 30, 2006"}, {"Title": "Wise investment", "Author": "Freddy Graham", "ReviewID": "RNT6GW0Y7R513", "Overall": "5.0", "Content": "A wise investment that will provide many years of quality pictures and memories for you and your entire family.", "Date": "May 18, 2006"}, {"Title": "Wonderful Camera with a lot of great features", "Author": "Nicole", "ReviewID": "RA7ZKKQK8CSJT", "Overall": "5.0", "Content": "I absolutely love this camera.  The pictures come out so good.  I cannot tell you how many times people have told me, what kind of camera do you have - though sometimes you can have a really cheap camera, like a disposable one and they can come out just as good...sometimes it is just the photographer.There are many things I like about this camera and many reviewers have already statement them so I won't repeat.", "Date": "May 11, 2006"}, {"Title": "the pros of this camra", "Author": null, "ReviewID": "R3FS6SFL40L5FY", "Overall": "4.0", "Content": "even though i only hve this camra for one day i know its the best camra almost my whole grade has it and they all love it the best thing about the camra is the zoom while videoing and its small take my advice we dont ned anything better its great!", "Date": "January 30, 2006"}, {"Title": "Compact but picture quality not worth the money!", "Author": "Pradeep Philip", "ReviewID": "RVSYJQB4VZ2J2", "Overall": "2.0", "Content": "Cons:Flash is BAD. Really bad photos in a dark room or on a gloomy day. Photos in broad daylight are good.Video Capture is average but audio is BAD.Pros:Size - SD450 is compact and it will easily fit into your shirt pocket.Weight - LightResponse time - GoodEasy to handle", "Date": "April 5, 2006"}, {"Title": "Beware the dreaded e18 error that renders your camera useless", "Author": "sfchris", "ReviewID": "R15LXK9R5W57R8", "Overall": "1.0", "Content": "Google \"Canon\" and \"e18\" before you buy this camera! They have a major flaw in the lens mechanism of all their cameras.", "Date": "July 17, 2006"}, {"Title": "Awesome service, fast shipping!", "Author": "Mary \"DU Student\"", "ReviewID": "R1V5J484PBOF88", "Overall": "5.0", "Content": "Everything with the order went smoothly and I love my camera!  Thanks so much...", "Date": "March 23, 2006"}, {"Title": "Best camera!!", "Author": "L. Hooshmand \"savvyp\"", "ReviewID": "R3A7U3A34OOP4J", "Overall": "5.0", "Content": "I love this camera!! It's so easy to use and takes great pictures, plus the screen is huge! I like it better than many much more expensive cameras other people I know have.", "Date": "March 14, 2006"}, {"Title": "a \"real horror story\"", "Author": "Ellis Miles", "ReviewID": "R3T3J08AZOXE6Y", "Overall": "2.0", "Content": "I ordered this camera and was told it would get to me in 5 days.  The 5 days turned into 3 weeks and it still was not here.  It finally wss reshipped to my secondary address and got to me.  It was very frustrating to be waiting for a camera that you already have an extra battery.  I really wasn't going to use amazon again.  I relented and have not had any trouble since then.", "Date": "November 3, 2006"}, {"Title": "Canon SD450 camera", "Author": "Gy \"Gy\"", "ReviewID": "R3Q9W8HI2M9ZS5", "Overall": "5.0", "Content": "My wife and I made the purchase together and are very pleased with the ordering process as well as the camera.  My only criticism is that your on-line confirmation said it was going to take longer than we expected.  Fortunately the camera came very quickly (closer to our original expectations) and we are very happy.", "Date": "February 23, 2006"}, {"Title": "Great Camera", "Author": "James M. Ballard", "ReviewID": "R31H9ZJIYYUFO2", "Overall": "5.0", "Content": "I bought this to upgrade my Canon Powershot s110 and what a difference. It is worth every penny.", "Date": "December 17, 2005"}, {"Title": "dead pixels", "Author": null, "ReviewID": "R1T0WRWO5WBLZE", "Overall": "1.0", "Content": "Within a month, I tried two kodaks, two canons(sd450).  All 4 cameras have some sort of dead/hot/stuck pixels on LCD/senor.  This is really ashame.  Sure, you can argue that they are tiny and difficult to see.  But clearly, it's a defect.  Why am I paying good money and waste my time with all these defective products?  I don't mind if a camera develop minor pixel issue after a year or so but NOT when is brand new.  I suspect the increasing amount of pixel issue is because these camera companies try to cut corner by using low quality sensors.  Or maybe these sensors manufacturing process is so tough that pixel issues are a must.  Somehow, i doubt that.  I am very disappointed.  I am still happy with my 5 year old 3mp camera.  (...)", "Date": "November 23, 2005"}], "ProductInfo": {"Price": "Unavailable", "Features": "5-megapixel CCD captures enough detail for photo-quality 13 x 17-inch prints\n2.5-inch LCD display; optical viewfinder; 3x optical zoom\nShoot high-quality movies at up to 60 frames per second with Fast Frame Rate Movie Mode\nDIG!C II Image Processor for faster processing, vibrant colors, and excellent image quality\n12 shooting modes including My Color settings for customization while shooting", "Name": "Canon Powershot SD450 5MP Digital Elph Camera with 3x Optical Zoom", "ImgURL": "http://ecx.images-amazon.com/images/I/41SW6F91RFL._SY300_.jpg", "ProductID": "B000AYGDIO"}}