{"Reviews": [{"Title": "Very good Camera, Excellent Price", "Author": "L. Wilson", "ReviewID": "R7GZ13K4I4T73", "Overall": "4.0", "Content": "This camera is a really good camera.  Granted it isn't one of the higher quality ones you can get out there, but for the price and the features you cant beat it.  The picture quality is very good in my opinion.  I have used it both indoor and outdoor, day and night and was pleased with the outcome.  The movie mode does have sound as long as you do the playback on a computer.  The movie quality isn't too bad....once again for the price.  The camera is very simple to use and also has a simple mode.  This also triples as a pc cam, so all in all you are getting 3 cams in one.  With that said if you are looking to take good pics, decent movie clips, and have a pc cam then this is the way to go whether you are on a budget or not.", "Date": "October 24, 2005"}, {"Title": "Poor Pentax Optio 60", "Author": "LesStar", "ReviewID": "RU095SXIEXUK", "Overall": "2.0", "Content": "I have had this camera for 10 days and am very disappointed with the quality of photos it will take. Trouble with indoor pics being over exposed. Outdoors poor detail. Color quality not there. Had bought because it was small and price A waste of money!! Will be sending camera back tomorrow. I have 2 Olympus digital cameras Better indoor, better outdoor With Lots more detail They must have better lenses! Don't Buy!!", "Date": "October 20, 2005"}, {"Title": "Pentax Optimo 60", "Author": "John D. Williamson", "ReviewID": "R9W24BU1QW9JB", "Overall": "2.0", "Content": "I purchased a Pentax Optimo 60 one month ago, and being my first digital camera purchase, I am greatly dissappointed with the Auto focus. Quite frankly, the camera will not focus properly when using the zoom mode. Pictures are blurred. A friend of mine felt bad recommending this camera since he is experiencing the same problem.", "Date": "December 5, 2005"}, {"Title": "Cheap but not cheerful", "Author": "simon tyrrell \"simty\"", "ReviewID": "R2JUF4U6ELNGPM", "Overall": "2.0", "Content": "I bought a Pentax Optio 60 largely on the reviews that the other Pentax models received in the camera press.  Almost the entire Pentax range gets a full 5 star rating.  The Pentax Optio 60 does have many good features, unfortunetly the auto-focus in normal indoor light conditions is NOT one of them.  I just had a baby son and wanted to buy a camera that could take some good pictures of him.  After a whole month I have just a handful of useable pictutes and many of those are not quite in focus.  To make the camera focus I made a contrast sheet the the camera found easier to focus on, that was then placed by my son,  I then auto focused the camera and had someone remove the contrast sheet.  It worked but didn't make for spontaneous pictures.  (...)", "Date": "January 30, 2006"}, {"Title": "SWEET!", "Author": "Ferguson nah that aint my real name lol", "ReviewID": "R3IEYMDY6IZAJI", "Overall": "5.0", "Content": "Ok.... I have had a few cameras and this by far is the best. The pictures are soo clear. Because it is a 6 mp, when you put Pictures on your computer they are clear. Also when you blow a picture up it stays clear with up to a 20 x 13 picture!! The price is better at WAL * MART though. If you like to shoot video it is cool too. While you are shooting it you can zoom in. It records sound but I do wish that it could play the sound back on the camera--you can hear it when you put the video on the computer though. I highly reccomend this camera. Penatx is awsome!!", "Date": "October 4, 2005"}, {"Title": "Mediocre at best -- a HUGE disappointment", "Author": "Uinta Hiker", "ReviewID": "R1XTVADKVI327Y", "Overall": "2.0", "Content": "Picture Quality: Without crisp, clear photographs, you do not get much benefit from a camera. Despite the allure of the promised 6 MP photo quality, the Optio 60 delivered poor quality images -- particularly at closer range and indoors in subdued lighting. Friends' Kodak, Minolta, and Canon cameras that I used over the Christmas holiday did a lot better -- even some 4 MP's seemed crisper.Batteries: I bought the NiMH rechargeables so this was not a big concern, but it does consume charges fairly rapidly. If you plan to use the Alkalines be ready to go through a couple quickly.Egonomics: the camera is too small, doesn't fit the hand nicely. I bet a lot of these cameras will get dropped.Overall: I will suggest that any friends of mine select other models. I was really excited to receive this camera as a gift, because on paper it looks amazing, but my enthusiasm quckly turned to annoyance when this camera consistently let me down on all fronts! This camera is going back to the store and I will use the credit to buy a Canon or Kodak product.", "Date": "December 31, 2005"}, {"Title": "A Great Affordable & Compact Camera!!!", "Author": "F. Calloway", "ReviewID": "R1DIZW92OVOJEC", "Overall": "5.0", "Content": "I had read many (and I mean many) reviews regarding this camera. About half were reviews saying this camera was worthless, but the other half gave great solutions to some of the problems users were having.  I am not a novice but not an expert either when it comes to cameras. I needed a camera that is simple to use with some extra features that was also affordable. This camera is the one! If you don't know some of the little quirks about the camera, you may think it is a piece of junk. For example, in order for your pictures to come out clear, it is best to have the focus set on infinity (always); otherwise the pictures may come out blurred. When taking pictures at night or in dim lighting, you will need to adjust the setting for nighttime. Also, the white balance needs to be adjusted with each different set of pictures taken. Without rechargeable batteries, it will cost you a fortune to keep batteries for the camera.  When using regular batteries, you may be able to take about 7-10 pictures before the batteries die.  I have found in the high speed continuous mode that pictures taken outside or in bright lighting works best.  All in all this is a hot camera takes greats pictures, and it has a lot of wonderful features that you will not find in a lower priced camera.  If you invest in 2500 rechargeable batteries and a memory card and you will love what this camera can do!", "Date": "July 10, 2006"}, {"Title": "Crappy Camera", "Author": "John Guthrie", "ReviewID": "RQYNPQRVLECWU", "Overall": "2.0", "Content": "Poor focusing, long delay between clicking pictures, washed out images.  I returned it and Amazon deducted $40 from the refund + freight each way.  Bad experience.", "Date": "January 21, 2006"}, {"Title": "Excellent picture quality if...", "Author": "Obin C. Robinson \"Obin Robinson\"", "ReviewID": "R3H5J6LGC6SRN6", "Overall": "3.0", "Content": "We pre-ordered this camera years ago before it even hit stores. The camera has its ups and downs. Here's the short of it:Pros: If it's a bright and sunny day outside this camera is capable of some excellent photos. We've taken some bright, sharp, and beautiful photos of plants and landscapes with the Optio 60. I have taken some incredible close-up shots of flowers and other plants with the Optio 60.Cons: If you're indoors, in low light, or taking photos of fast moving objects this camera leaves much to be desired. The battery life is terrible! We suggest you use only rechargeables with this camera as otherwise you'll be wasting your money. Not even lithiums will last long in this camera. It turns out that many of the Optio 60s had a short in the circuit board. The cost of repairing this short is more expensive than the value of the camera. This camera would be perfect connected to an AC power source and mounted on a tripod.In the end get the Optio 60 if you can find it for $65 or less. Get it if you want something to use for photos of slow moving objects in bright light. We replaced this camera with the Optio M20. The Optio M20 is honestly 100 times better in every way shape and form.", "Date": "May 4, 2008"}, {"Title": "Good Camera", "Author": "J. LaVelle \"LUV2SHOP\"", "ReviewID": "R3TIR61RSA78JH", "Overall": "4.0", "Content": "This camera worked great for me.  However, the price of $414.00 is two hundred dollars over the price I paid for it two years ago.  It took great pictures and it was easy to use.  The only reason I upgraded is because I wanted the option of close cropping pictures and printing them.  I only found out after I needed to print wedding photos of my step daughter that it wasn't capable of this.  I love the portability and the slim stylish shape.  However keep it in a camera bag so you don't scratch the viewer.", "Date": "September 2, 2007"}, {"Title": "Kind of like it, but could be better", "Author": "W. Mentz", "ReviewID": "R2VNKEW3IBVTSB", "Overall": "3.0", "Content": "I actually like this camera most of the time..  but there are a few flaws.  One is the flash.. almost all of the pictures are over flashed.. not good.  I have tried to hold my finger over the flash, but that does not work well...The other problem is the focus...  if you are a point and click person, you will be disappointed as it takes a bit of time to focus.  I have lost some good shots because of snapping the picture before it is focused..But, the quality of the pictures are mostly good..", "Date": "April 5, 2007"}, {"Title": "DON'T WASTE YOUR TIME AND MONEY ON THIS ONE!!!!", "Author": "Dennis C. Desimone", "ReviewID": "R2JHGMI9CSMORI", "Overall": "1.0", "Content": "We've sent the camera back to Pentax 3 times in the 4 months that we've owned it. Only half of that time has the camera seen any use at all!!! We ran through alot of alkaline batteries then bought the Nickel batteries that they recommend and couldn't keep them charged to take more than 10-15 pictures MAX!!! We are incredibly disappointed! The focus is not that great either. Buy another camera - don't waste your time or money on this one!!", "Date": "May 2, 2006"}, {"Title": "Good-but not the best", "Author": "C. Hickey", "ReviewID": "RMK0JJ0O7NETN", "Overall": "3.0", "Content": "I was instantly attracted by this camera: nice size, look and what the heck 160 dollars for a 6 million pixel camera!  Like most I read reviews on it and realised that most weren't happy with it at all, but I bought it anyways.  And guess what? I have very few regrets about my choice.  There are a lot a different ''tools'': turn of flash, change the quality of the picture, video... only problem: the pace ! You can't be in a hurry to take a picture or get your ''kodak moment'' because you're gonna have to wait about 10 seconds after you turn it on to be able to use it and 5 seconds between each shot.Bottom line: good for small events or parties but don't take this to a wedding: you're gonna miss every opportunity to take a picture because you'll be waiting for the darn thing to turn on", "Date": "July 19, 2006"}, {"Title": "This is terrible", "Author": "H. Schmauch", "ReviewID": "R3Q5K5OXCNJSMG", "Overall": "1.0", "Content": "Let me start off by saying that this is my bosses camera, not mine.  What I am about to tell you is what I learned in the 30 minutes I used it.Battery Life:  DOA.  The batteries are completely drained after the 30 minutes.Ease of Use:  It took me about 20 minutes to find out how to change the options on the camera because the \"Menu\" button on the back has only 3 options (I tried to list the options; however, I don't know them & the camera is dead).  To get the many different options, you have to turn the knob at the top of the camera to the screwdriver & wrench picture, which I assume stand for \"Settings\".Picture Quality:  Horrendous.  A lot of the pictures I took were not clear at all.  When I looked at the previous pictures she took of a work event, 5 out of the 6 pictures were so fuzzy you couldn't see faces.Portability:  It's portable.If my boss doesn't get a new camera soon, I will be getting her a new camera for Christmas.", "Date": "October 6, 2010"}, {"Title": "WORST CAMERA OUT THERE!!!!!", "Author": "Wesley P. Bailey", "ReviewID": "RXXDYOVIVU14H", "Overall": "1.0", "Content": "Do not buy this camera. It is the worst camera I have ever had. It EATS batteries. It EATS re-chargeable batteries. We bought our daughter a $25 junk camera because we figured she would break it. That $25 camera is a much better camera than this thing. I sent it back to Pentax once. They sent it back and there wasn't any difference. I sent it back the second time and in a note I told them not to even bother sending it back. I wouldnt even GIVE this camera to a friend. Do yourself a favor and buy ANYTHING but a Pentax. I will never buy another product this company makes.", "Date": "June 3, 2006"}], "ProductInfo": {"Price": "Unavailable", "Features": "6.0-megapixel CCD captures enough detail for photo-quality 14 x 19-inch prints\n3x optical zoom; 2.0-inch LCD display\nManual exposure settings plus aperture and shutter priority modes\nOptical and actual-image zoom viewfinder with automatic diopter adjustment\nStores images on SD cards (includes 12 MB of internal memory); powered by AA-size batteries", "Name": "Pentax Optio 60 6MP Digital Camera with 3x Optical Zoom", "ImgURL": "http://ecx.images-amazon.com/images/I/519fi7GQAyL._SX300_.jpg", "ProductID": "B000AOBBDQ"}}