{"Reviews": [{"Title": "Extraordinary DSLR Camera For Wannabe Pros (or real ones)", "Author": "Jonathan W.", "ReviewID": "RWQ3JPX7CAXRG", "Overall": "5.0", "Content": "This DSLR is as good as it gets in the \"Pro-sumer\" (advanced amateur...wannabe pro) category.  The Konica Minolta Maxxum 5D  is as good (or better) than all the others in its class (e.g, Nikon and Canon) but comes with the anti-shake feature. It is also among the least expensive in its class.  Get it while you still can.This camera is for experienced digital photography enthusiasts, or technological savvy folks who are sure that's where they are headed.  You can set it to \"auto\" and point-and-shoot the Maxxum 5D (also know as Dynax 5D internationally) and you'll get  perfect shots nearly all the time.  But if that's all you want to do, this camera is not for you.By the way, it would be foolish to buy this (or any other DSLR) camera as a starter camera (even if you have the money). This camera is best for those with some experience who want to be creative and view digital photography as a serious hobby or maybe even a part-time source of income.  Even though you can by-pass the hundreds of alternative settings on the 5D, it would be a shame to have them an not use them at least some time.If you have any Minolta (aka Konica -Minolta)lens or other accessories from your old film-based SLR, then this camera is a no brainer, as they will all work in this camera too.  By the way, there is no reason to buy the higher end Konica Minolta 7-D, unless you are a pro with lots of extra money. Its bigger, more expensive and has only one or two more features than this one.The big negative issue that you'll note elswhere in these reviews is that the Konica-Minolta corporation will no longer be making cameras over the coming year...though the multi-billion dollar conglomerate will be around for many years to come to honor its warranties.I recently bought this camera and a [...] rebate was in place.  You might expect to see more of this as Konica Minolta gets out of the camera business.  But even now, given this camera's fine reputation, they are getting harder to find.It is likeley that Sony (who purchased rights to Konica-Minolta's camera technology) will make this camera the basis of their new Sony namplate DSLR model line in coming months since it is a winner.  But even if they do not, many third parties make lens that fit this camera and you can purchase extra warranties from third parties as well.If you buy this or any other DSLR, be sure to buy several 512MB or 1-2 GB compact flash cards to take advantage of the larger JPEG or \"raw\" image size it outputs (sometimes 5 shots at at a time, since like the pros, you can click once to get multiple action shots.)  Tigerdirect always seems to have the best deals and rebates on flash cards. You will also need a flash card reader.  Don't mess with connecting this or any camera directly to your PC.Speaking of Mega-Pixels, anything over 6MP is overkill, unless you are going to make nothing but room size posters.If you'e never owned an SLR or DSLR before, they are not pocket cameras (you should get one of those first by the way); So you will need to be comfortable lugging the DSLR camera and at least one extra lens (you will likely want a telephoto zoom - I recommend a 200 or 300mm zoom) around.The most innovative DSLR case on the market is Lowepro's new slingshot 200 backpack.  A must if you have more than one lens, or if you have any other paraphernalia. The slingshot recenly won several well-deserved ergonmic design awards.  (I got a good deal on one via the Amazon marketplace).I hope all this input helps, whether or not you buy the Konica-Minolta Maxxum 5D.  Happy shooting!!", "Date": "March 19, 2006"}, {"Title": "Just got mine and I already love it!", "Author": "MestaySS", "ReviewID": "R3IKQYPLBS8VCV", "Overall": "5.0", "Content": "Well, for those of you interested in a DSLR, look no further!  Not only does this camera have many of the features that the 7D (an outstanding camera) has (like the anti-shake, which works wonders in low light), but it is also much more affordable, and perfect for the photographer who wants to capture family photos, stunning vacation photos, or beautiful RAW format images to be blown up to over 11X14.  I have been playing around with this camera for the past few weeks.  I have a SanDisk Compact Flash Ultra II 1 gb card with it, and it will hold around 50 RAW format images or 160 FINE format images, which are perfect for capturing photos that you don't plan to blow up past 8X10.Every single photograph I have taken so far has come out crisp and beautiful.  The colors are exact and the warmth of the tones is perfect.  The viewfinder on the camer could be a little more clear than it is, but that doesn't bother me.This camera is the perfect size.  It is neither too big nor too small.  One thing that you should know before purchasing this camera is that when you are taking pictures, you do not look at the viewfinder screen, you must look through the viewfinder itself.  The screen is only used for viewing pictures or changing settings.  I am used to looking through an actual viewfinder with my other cameras, so this does not bother me, but may bother some.This camera is a great purchase.  And Amazon has a great deal for this camera and also a memory with purchase deal right now.  For those of you trying to make a decision, get this one.  You will be so excited to use this camera for basically any kind of photography that you can think of!", "Date": "October 6, 2005"}, {"Title": "An excellent DSLR", "Author": "J. McNamara", "ReviewID": "R1G0I1W2BOJ8F9", "Overall": "5.0", "Content": "I've been using my Maxxum 5D for about a month now and could not be more impressed.  It has excellent ergonomics, great features (like antishake), and of course, produces high quality images.  I moved up from a Canon point and shoot and I really appreciate these features: 1) no shutter lag, 2) long battery life, 3) great low-light performance, 4) interchangeable lenses, 5) RAW format support.  I am shooting only RAW these days and using Photoshop Elements 3.0 to do the conversion to JPEG.  While it is true the camera will usually do a good job, with RAW you have a good chance to fix that important picture where the exposure and white balance is just wrong.On the lens front I'm using: 1) 18-70mm kit lens (wide but inexpensive), 2) Minolta AF 50mm f/1.7 lens - great for portaits and low-light 3) Tamron 28-200mm XR - a good all-around and compact lens.I look forward to many years of usage from this camera.  I certainly hope Sony picks up support for the Minolta system.", "Date": "March 26, 2006"}, {"Title": "Easy-to-use SLR with fast, beautiful results", "Author": "Janet Vautard \"techno geek\"", "ReviewID": "R16S1H6VL4EU74", "Overall": "5.0", "Content": "I received the Konica Minolta Maxxum 5D camera for Christmas from my husband.  I'm a long-time owner of Minolta SLR film cameras, and I was delighted to see that the digital Maxxum 5 uses my autofocus lenses from my film-version Maxxum camera!  So, if I want to switch back and forth between digital and film pictures, I can utilize my complete collection of lenses.  The autofocus function captures a sharp, clear picture even in low-light situations.Unlike many digital cameras, the Maxxum 5D powers up and is ready to use quickly.  Even in extra fine mode, the wait time between pictures is negligible.  It recycles very quickly, enabling you to capture more of the action.  Also unlike most digital cameras, the rechargable lithium-ion battery lasts a long time.  My husband and daughter both have digital cameras, and they are constantly switching batteries in and out in a single photo session.  My camera's battery, on the other hand, provides power for much, much longer!  I took loads of pictures on Christmas day and still had sufficient battery power to take pictures on two subsequent occasions.The picture quality is excellent, also.  We take pictures for a local animal rescue organization for their website, and cats are not known for being cooperative subjects.  The anti-shake technology in the camera combined with the rapid recycle speed between pictures allows me to capture an excellent photo more quickly and before the cat loses patience with the process.  For whatever reason, we have to do less adjusting for red-eye (or gold-eye with cats) when using my camera, also.I couldn't be happier with my camera or the pictures it captures for me!", "Date": "February 22, 2006"}, {"Title": "Awesome Pictures", "Author": "fotofan", "ReviewID": "R2AQCLP1FB9YGM", "Overall": "5.0", "Content": "I purchased this camera when it first came out, about 5 months ago. I was an amateur SLR film photographer for years, and this is my first digital. Using this camera, I have significantly improved my photography skills - using the manual settings to explore many different aspects of a picture - combined with good optics and picture quality.  If you're an amateur ready to move to a digital SLR, this is a good choice.Pros:  The antishake technology is fantastic - I am a hand-held user, and I have gotten wonderfully crisp photos in situations where flash cannot be used. The write speed to the picture card is also excellent - even with large photos, I don't get a long wait that is typical with many point and shoot digital cameras.  The menus allow all the flexibility in settings that I need -the two that I use most are setting the autofocus parameters from a wide range to center of the photo to a spot, and automatic bracketting of the exposure range.Cons:  The extensive menus allow flexibility, but can be difficult for a new user to remember how to navigate to a specific feature.  I wish there was a better way to be able to preset 3 or 4 modes that I typically like to shoot in, rather than go through the extensive menu.  With some of the preset modes, if you have a busy picture, it is easy for the autofocus to pick the wrong focus area.  Finally, I often have to use manual mode in low light, handheld operation - the automatic features tend to prioritize aperture more than speed, and I have blurry pictures that would have been better with less depth of field and a faster shutter speed.  This can be overcome by the changing the settings in the menus.", "Date": "February 7, 2006"}, {"Title": "I am glad I went for the KM 5D over Nikon and Canon", "Author": "allodds", "ReviewID": "R4WRCO61CM8IQ", "Overall": "5.0", "Content": "After months of research, I was convinced that the 5D is the best investment for a first-time DSLR aspirant like me. Needless to say, the Anti-Shake mechanism built into the body was the decisive selling point. With AS, every Minolta or third party AF lens becomes a VR lens with the 5D, whereas, with the other brands, one needs to invest in their super expensive VR lenses to achieve the same result.I hurried up and bought mine with the kit lens one day after the announcement that KM is winding down their business; I was lucky to get it at a great price, because now, the 5D is either out of stock everywhere, or $100 pricier. I also bought the KM Maxxumizer DSLR kit that comes with the 2-year extended warranty for the camera, a gorgeous KM 75-300 D zoom lens, a great KM gear bag - backpack style, a lens cleaning kit, a photography guidebook and 30 glossy 4x6 photo paper. All this for under $150. Finally, I also bought 1GB Sandisk Extreme III CF card to exploit the RAW capabilities of this great camera.I have it now for 3 days, and it is an absolute treat...The results are, to put it mildly, incredible. I am able to shoot awesome hand-held, low-light, indoor shots at 1600 ISO and not have to post-process for noise removal. Finally, I have something that is fast enough to \"capture\" my fidgety kids in action. My friend who owns a Canon Rebel XT DSLR cannot take similar shots without some blurring. That's what the Anti-shake is all about.If you are starting out new and are not already vested in a SLR len system, see if you can grab a 5D while it is still out there. If you can't find it, wait for Sony to announce their version of the same camera - with Anti-Shake.", "Date": "January 27, 2006"}, {"Title": "Incredible Photos!", "Author": "John L \"miltonthetoaster\"", "ReviewID": "R1F776XPIUNOZN", "Overall": "5.0", "Content": "I decided on the Konica Minolta Maxxum 5D kit mainly because all my dim-light photos (birthday parties, etc) came out blurred and/or with poor color balance and/or were taken with such a delay that I missed the shot. Most of my experience has been with point and shoot digicams. I started with a Nikon 950 (which cost more than this one as a kit) and then switched to a Pentax Optio 555. Both were very good at the time.I haven't been disappointed. The biggest surprise so far has been that with little starting knowledge I've been able to grab some fantastic shots that would have been impossible or extremely unlikely with a lesser camera. Since getting the 5D I've loved using it from day one and had a chance to study and practice with it on a recent trip to Hawaii.One little known advantage of an SLR seems to be that if you take it with you when you go out to dinner, waiters assume it's an event for you like an anniversary, birthday or something so they work harder for you. But I digress.I took this baby into the office to show my coworkers how nice it was and they were blown away. Not only could (or my friend) fire off decent shots VERY quickly, but they were in-focus and didn't have to use the flash. This is in an office building with fluorescent lights. Try that with a compact digicam!", "Date": "December 7, 2005"}, {"Title": "Love my minolta!", "Author": "pfs", "ReviewID": "R2VQ71YMGDIWP9", "Overall": "5.0", "Content": "I have a Dimage G400 that I carry around every day since it is so compact.  It has consistently given me fabulous results and out-performed my canon SD 500 in quality.  Because of this, I gave the Canon away.I wanted to upgrade to a digital slr.  I also looked at the canon and nikon.  I decided on the Maxxum 5D for several reasons:  the price, the awesome Minolta quality that has never let me down, the antishake feature, and the fact that I have a Minolta 35mm SLR.  I can use those lenses on the digital SLR.I've had the maxxum 5D for about 2 months and haven't really had the time to go through all of the instructions and features.  I constantly take pictures but am by no means an expert.  Despite this, my Minoltas deliver such high quality pictures with superb color and clarity.  This is especially obvious when I compare pictures taken by other cameras at the same event - no comparison!  A common drawback of digitals is the need for a bright room for nice pics.  However, the flash is really powerful so I haven't found it to be a problem yet.  So many people give me compliments, even on pictures that were casually shot at the spur of the moment.  The shutter speed is so fast that I can really capture the moments.This camera is really impressive.  It attracts a lot of attention even before people see the prints!", "Date": "May 26, 2006"}, {"Title": "Can't put it down!!!", "Author": "Eric Raskin", "ReviewID": "RVL07VU4QM0KQ", "Overall": "5.0", "Content": "I purchased my 5D about 3 weeks ago and I am having a great time with it.  I had it up in running in no time and it is quite easy to use with very intuitve buttons/switches.  The 2.5 inch screen is a big plus and is pretty vivid and clear even in the daylight.  I was fortunate in that all of my old Maxxum (35mm)compatible lenses (Sigma)work just fine.  If you have old Maxxum compatible lenses I suggest that you contact the lens manufacturer to see if they will work with the 5D but if they will not, don't let that stop you from buying this camera. Nonetheless, I did buy the Konica Minolta 28-75 F2.8 lens with the 5D body which, in my opinion, is good all around lens for the camera.  While the battery has a very long life, I would recommend getting a second one so that you never run out of juice.  I would also recommend a minimum of a 1 GB compact flash card if you are planning to shoot at 6 mega-pixels.  I highly recommed this camera as the pictures will speak for themselves.", "Date": "December 22, 2005"}, {"Title": "Excellent Camera", "Author": "Carle C. Henson", "ReviewID": "R1AM20JJJ2RECO", "Overall": "5.0", "Content": "I bought this body because I already had some Lenses for the MAXXUM family and I really wanted a digital with anti-shake. My wife has a couple of the very small Sony Digitals and we found that they were useless in low light because of shake and the flash's very short range.The 5D is in a whole other class so you would expect it to be better but it takes incredible pictures. The anti-shake works well (unless my hands have suddenly developed a tripod like stability). I haven't used many of the features yet but so far I am very pleased.The only sour note is that my non-Minolta MAXXUM lenses that worked with my old MAXXUM, did not work with the 5D. The true MAXXUM lenses did. No markdown here because I knew about the limitation before I bought.", "Date": "December 18, 2005"}, {"Title": "Love it!", "Author": "Bart Willems", "ReviewID": "R3MNJ3AVLZNUOP", "Overall": "5.0", "Content": "I just got my Maxxum 5D and I absolutely love it. It feels solid, not plastic-like at all. All the buttons are in the right places, and it's very easy to take pictures any way you want. Image stabilization gives you about one extra stop of light - great to take pictures without flash that would need flash otherwise.It seems quite hard to get lenses, if you don't have any, ordering the kit is a good idea in case the lens you ordered is on backorder.Absolutely recommended.", "Date": "January 16, 2006"}, {"Title": "Inexpensive and good entry level DSLR", "Author": "C. Dsa", "ReviewID": "ROLEPRIKKAV88", "Overall": "4.0", "Content": "The KM 5D is an inexpensive and very good entry level DSLR, with anti-shake if you're interested in that feature. Like the big brother the Maxxum 7D- the 5D has an anti-shake system, making the 5D and 7D the only DSLRs with image stabilization built into the camera body. Both cameras are full manual -6.1 MP, with large LCD displays. The 5D LCD is 2.5\" but lower resolution than the 7D.Cons: Slow USB why not high speed 2.0 USB Konica??Slower than the 7D is shot to shot speedAs of Jan 2006, Sony got all the left over parts from konica minlota, so it appears that Sony's new DSLR are gonna have mounts compatible with konica minolta's lenses, so lens wise one should not any problems,The downside will come for warranty support, firmware and other support.", "Date": "January 24, 2006"}, {"Title": "Last major breakthrough for KM before Sony acquisition", "Author": "D. Hoyne", "ReviewID": "R2G43A0E271GHR", "Overall": "5.0", "Content": "Konica Minolta was on steady development of applying their Anti-Shake technology towards EVERY camera on the lineup. KM joined in on the dSLR party as well (shortly after A200 release) - so in turn, most digital camera producers had at least 1 true dSLR (interchanging lens) + 1 dSLR (fixed lens / bridge). KM applying the Anti-Shake into their debut dSLR (Maxxum 7D). The 7D was more expensive than some of competition due to materials used in production (esp. its Magnesium Frame). The 5D was produced shortly after as the more budget friendly equiv - extensive use of plastic (+ resulting in weight reduction), smaller viewfinder %, a lower resolution display and a Pentamirror (vs Pentaprism).Regardless which of the two KM dSLRs you go for - the main similarities are the 6.1MP CCD Sensor/AntiShake Assembly and sensor is of APS-C sizing. Since the sensor is APS-C sizing, the lenses used actually have a inherint multiplier factor of 1.5x the lens focal length / zoom-range (Note: Modern Lens denoted with DT are APS-C supported and meet listed length off 5D/7D - prominently Zoom lens). As an example - If you have an Maxxum AF Prime of 18mm focal length, the focal length actually off the 5D/7D is of 18*1.5=18+9=27mm. So you have an ~27mm Prime in your hands.Update: I am gonna be a proud owner of a 7D alongside my 5D. While the 7D will hold a greater money value and have a more professional/malleability feel, I would be more eager jumping on to the 5D (esp being around it for a few mths longer).I purchased this preowned build in December and came to me in rather good condition. This is one of the more user friendly layouts you could have encountered against competitors + substantial gripping for big hands (while not being cumbersome). The camera jumps into action on startup (~sec i feels like). The battery life has been ridicuously good - I haven't test all shooting + 0 preview yet, but shooting + some reviewing has gotten me a hair over 400 RAW Shots (very surreal as I'm used to cameras typically needing juice after 200 shots and no preview). It has been very accepting of all Maxxum lenses I mounted on (which I own).As my Minolta lens collection progressively grows, but surely, for this camera is a BIG TIME Favourite (esp. for SLR experience) and looking to apply on many condition/circumstances.Current Lenses:Kit DT 18-70mm (indifferent to it; it came with camera)Minolta Maxxum 28mm f=2.8 (Newly received)Minolta Maxxum 50mm f=1.7 (aee MUST GET)Minolta Maxxum 70-210mm f=4 BeerCan (aee MUST GET)Minolta Maxxum 75-300mm f=4.5-5.6 Gen2 (NON-recommend)Future Additions:Minolta Maxxum 135 f=2.8Minolta Maxxum 50mm Macro f=2.8", "Date": "February 2, 2013"}, {"Title": "A really great camera", "Author": "Hiker \"Gray Goat\"", "ReviewID": "R1ITVSMGCM8X0M", "Overall": "5.0", "Content": "It was one of the saddest days of my life when Minolta went out the camera business. This is one really great camera. I hope Sony is able to continue the Minolta tradition.", "Date": "June 26, 2007"}, {"Title": "Great Camera - Love the Anti-Shake", "Author": "Bekster \"bekster\"", "ReviewID": "RVK0HUMFK4GP5", "Overall": "4.0", "Content": "I have had this camera for about 6 weeks now and love it.  I have taken handheld Macro pictures with no shake!!!!  Great controls - I haven't even come close to figuring them all out, but even on the pre-programmed modes it's awesome.  I've learned more about photography and settings in the past 6 weeks than I ever did from a book.Gotta go take more pictures now", "Date": "December 23, 2005"}, {"Title": "Best Digital SLR Camera I Have Owned.", "Author": "Shannon L. Crook", "ReviewID": "R5AMA9VGY0NO2", "Overall": "5.0", "Content": "It is very simple to use the Konica Minolta 5D camera.  I have had other SLR digital cameras that were big clumsy and hard to use.  Right out of the box I was able to use the 5D without any problem.  There are manual settings if you are brave enough to try to use them.  As time goes on I plan to figure them out but for now I just use the automatic mode.  If your a novice photographer that is just starting out the 5D is the way to go.", "Date": "January 9, 2007"}, {"Title": "Love it", "Author": "AL", "ReviewID": "R2LSC7ST8FV1UC", "Overall": "5.0", "Content": "This is good toy to have for a price. Plus I could you it for my existing Maxxum toy that I collected over years", "Date": "January 28, 2014"}, {"Title": "Great camera!", "Author": "Mike M", "ReviewID": "R2O1VLCTT5RWUL", "Overall": "5.0", "Content": "I'm not sure what more I can say about the camera that hasn't already been said.  I'm a novice photographer who was looking to move up to a DSLR and get a camera that would allow me to do everything I wanted, but not go overboard on things I didn't need.  I'm continually impressed by the crisp, clear, and color matched photos I get from the camera.  The anti-shake is great and the camera has all the features I could need while providing the ease of use needed for an amateur like myself.", "Date": "December 5, 2008"}, {"Title": "Sony WILL be supporting KM dslr users!", "Author": "Optics Planet Wripped Me Off \"Mastro\"", "ReviewID": "R10GCGB92R9AD8", "Overall": "5.0", "Content": "The 5D is a great camera packed with a ton of features. Reviews have all been very good to excellent. Nobody else offers an in camera Anti Shake solution (image stabilization). The CCD is a Sony CCD and the same one as in the Nikon D50.Konica Minolta has sold assets associated with dslr technology AND production to Sony. Sony bought, not just the technology and patents that go into KM's dslr's, but also the production facilities and lens mount. Konica Minolta's employees will be producing Sony lenses and dslr's. Sony has COMMITTED to support and service existing KM dslr owners. They also COMMITTED to produce lenses to fit the existing lens mount. There are over 14 million lenses in circulation for the lens mount Sony just paid good money for. Sony would not have purchased the lens mount unless they intended to use it. The story is bad for Konica Minolta's film slr's, not for dslr's. Do yourself a favor and research this topic on the KM slr forum on dpreview.I received my 5D this week after the news. Many 5D owners see the sale to Sony as a huge positive. More professional prospective users of the KM 7D are concerned because they are looking at investing thousands of dollars into their business. But for the amateur, the 5D is still a good choice....if you can get a hold of one! Most places are quickly selling out.", "Date": "January 26, 2006"}, {"Title": "Love the camera", "Author": "F. Doepke", "ReviewID": "RTSXUCA91SRLL", "Overall": "5.0", "Content": "The camera is just great. Nice small and light body. The software is very intuitive with perfect access to all settings. Picture quality is great especially due to the anti shake feature that helps the coffee drinker hands :)", "Date": "January 5, 2006"}, {"Title": "Very slow auto focus very poor high ISO performance", "Author": "Grant Brummett", "ReviewID": "R11XAXP7UJERL0", "Overall": "1.0", "Content": "I bought this camera because I have owned several Minolta Maxxum film cameras over the years including the origional Minolta Maxxum 7000 from the early 80s.  Since I already had several lenses I thought it was a no brainer purchase.Until I went with a friend and shot photos at the Arizona Reinsanance festival.  He was there with his Canon 20D.We both shot photos of the bird show and I compared photos later with what he had taken and what I got.Then he let me borrow his camera and take some shots.Let me tell you!!!The auto focus on a Canon camera IS LIGHT YEARS AHEAD OF ANYTHING MINOLTA HAS!!!  His Canon with a 70 - 200 F4 L USM lens can focus from minium distance to infinity and take dozens of photos while I'm still trying to get my Minolta 5D to focus with any lens at any distance.  Since then I have tested a new Canon 30D with a Canon 400mm USM L 5.6 against my Minolta Maxxum 75 - 300 Lens.  The Canon lens can focus in micro seconds even faster then my 50mm Minolta Lens!!!!  You don't even want to hear how slow the 75 - 300 lens is not only can you not track birds in flight with the Minolta lens you are lucky to get the shot at all.Then when comparing the shots taken in darker areas with higher ISO his shots at ISO 1600 looked better then mine at 400!!!I ended up buying a Canon 400D Rebel XTi and what a shock.I have tested my Minolta 5D and several of the new Sony Maxxum lens mount cameras back to back against my Canon and it's no contest.Bottom line, if you want a camera that can focus on and track a bird IN FLIGHT! then get a Canon DSLR with USM focusing and forget the Minolta non-sense with their body driven focusing motor in the camera body.My daughter had been using my Minotla 5D for awhile we were shooting some birds her with the Minotla and me with the Canon.  I handed her my Canon with a 70 - 200 2.8 L Lens and she aimed the camera out and focused and took her first shot.  She looked at me in disbelief!!  She said what the heck, how can it focus so FAST!!!  THIS IS AMAZING!!!!If I had never compared I would have never know how much better a camera can be.Go to any store and try a new Canon XTi Rebel or Canon 30D or 40D and see for your self!!I have since put up my Minolta cameras and lens for sale.Good luck Sony, you will need it.", "Date": "September 8, 2007"}, {"Title": "Great Camera", "Author": "Cristian Jitianu", "ReviewID": "R7MKAXCX2CME0", "Overall": "5.0", "Content": "I got this camera as a gift and I am very happry with it.", "Date": "January 16, 2006"}], "ProductInfo": {"Price": "Unavailable", "Features": "6.1-megapixel CCD captures enough detail for photo-quality 14 x 19-inch prints\n2.5-inch LCD; body-integral CCD-shift\nComprehensive image adjustment and control for creative applications\nComprehensive image adjustment and control, including zone matching, for creative imaging\nStores images on CF or SD cards (with optional adapter) or microdrive; powered by one NP-400 lithium-ion battery", "Name": "Konica Minolta Maxxum 5D 6.1MP Digital SLR Camera with Anti Shake (Body Only)", "ImgURL": "http://ecx.images-amazon.com/images/I/41XT3RGVCXL._SY300_.jpg", "ProductID": "B000A7JKMW"}}