{"Reviews": [{"Title": "A nifty little device", "Author": "E. Fader", "ReviewID": "R16O9KO5XN4WEB", "Overall": "4.0", "Content": "Pros: -Very good outdoor shots (or indoor with natural light)  -Incredibly small (I keep it in my wallet like a credit card)Cons: -Indoor shots had some off-color results on occasion  -Low capacity, no card slotOverall: I do not regret getting this camera, but I would recommend buying the next model up. The next model solves the problems of this one by having an sd/mmc card slot and a detachable flash (and of course a higher resolution).", "Date": "May 29, 2005"}, {"Title": "GREAT CAMERA & GREAT PHOTOS !!! (best Outdoors)", "Author": "Reva \"Reva in NYC\"", "ReviewID": "R373ILEW9Q1JSD", "Overall": "5.0", "Content": "This is a great little camera, and I've attempted to upload 10 colorful photos so you can see the wonderful job it does.The ideal shooting situation for this camera is OUTDOORS, SUNNY DAY.You also must get used to having a steady hand. That means when you depress the shutter, you need to really concentrate on keeping your hand still--it's easy to inadvertantly move the camera at that precise moment, so just try and be aware of that. And practice makes perfect--don't be discouraged. Have fun with this camera.  It is capable of taking some lovely photos.  Please don't be so quick to blame the camera.Any movement, either in your shot, or from you, will most likely produce a \"blurry photo\".Altho, in my sample photos which I hope will show up here tomorrow, or when approved, you can see a NYC yellow taxi in-motion, yet the photo is still fine....maybe not absolutely perfect, but I'd call it fine.Here's who this camera is meant for: The person who wants to be able to email a photo; & to always have a camera with them that is not bulky or a pain to take along, for that unexpected \"camera moment\", like the squirrel standing on the rim of a garbage pail, eating a green pepper--got it! I carry this little camera with me just about always. It's tucked in my purse.Regarding INDOORS, I know I won't expect great shots, but I have gotten some that were fine simply because I was able to turn on some indoor lights.One of the reviewers \"A Kid's Review\" mentioned the camera not working after about a year.  VERY INTERESTING, because, I had that problem with THE FIRST ONE I BOUGHT!  But, it broke a few days AFTER THE WARRANTY HAD EXPIRED  Bah-Humbug!!!  And I paid $100 for that camera when it first came out in 2003!!!  Oprah had it on her show \"Gifts to give Groomsmen\".  And that's when I bought it....a while ago.But, I bought the camera again, because I LOVED IT SO MUCH. And the second time the camera was selling for only $30 or so!!Well, I think this camera may only last about a year, because I just sent the 2nd one back, since it started to freeze up.  But, it had never held the full battery charge properly.  So, luckily, the camera starting konking out about 2 weeks before the warranty was due to expire. The Oregon Scientifc guy was nice on the phone, and I should be seeing my third!!! camera in the near future.  A free replacement since it's under warranty.MY ADVICE:  Great camera.  Good for emailing photos. Best photos are taken under OUTDOOR, SUNNY DAY CONDITIONS.But, keep a close watch on it as the warranty nears the one year mark...and if it's acting a bit weird, like freezing up, not holding battery charge fully, or anything else, call Oregon Scientifc and arrange to send it back per your warranty. They'll give you a # for sending back the camera---you must get that #.  And do it BEFORE THE WARRANTY EXPIRES!!If you are wondering if this is a camera for \"all-around usage\", I'd say no.  If I was going to an important event, say a wedding, indoors, I'd want a camera that could handle indoor shots, without my wondering about it.But, for my everyday, outdoor & \"surprise moments\" it's just GREAT!!!  Oh, and it's easy to download the photos onto your computer via the included software & USB cable.Until I'm able to spend the $400+ for the 7.2MP camera I'd like to get, I am THRILLED WITH THIS CAMERA, truly, I am.  And I know that whenever I do have that \"all-around\" camera, I will still be using this little camera--it's so easy to always have with me. I LOVE THIS CAMERA!", "Date": "November 23, 2005"}, {"Title": "Great Kids Cam", "Author": "Gob", "ReviewID": "R2J52OUPGR7923", "Overall": "4.0", "Content": "I bought this camera because the price was right. Obviously you're not getting a quality camera, but what you will get is a great camera for kids to begin learning about photography.Some of the pros:*Size*You never have to replace the battery...just plug it into the USB port and it recharges.Cons:*Size of pics are small (great for emailing, but horrible for printing)*It doesn't fit enough hi-res pictures on the camera", "Date": "December 13, 2005"}, {"Title": "Get what you pay for and more!", "Author": "Steve", "ReviewID": "RD37D23VEFNAQ", "Overall": "4.0", "Content": "I bought this camera for my 12 year old sister. I figured it would be a cool camera for her because of its size. When it arrived, I played around with it to make sure it worked and found that it took surprisingly great (for the price and megapixels) outdoor pictures. Indoor pictures, I found, were almost worthless because of the awful and grainy quality. Overall, for the $13 I paid for this camera, it was well worth it. It is ideal for every-day travel because you don't realize it is even in your pocket. I would reccomend this camera to anyone who took the time to read through the specs and customer reviews. You never known when you might find an \"Outdoor Oregon Scientific\" moment.", "Date": "July 18, 2005"}, {"Title": "It's okay...", "Author": null, "ReviewID": "R25GDY7VMTX02Y", "Overall": "4.0", "Content": "I got this camera from one of my dad's Malboro catalogs, and after about a year of use, it didn't want to work. I sent it back to Oregon Scientific, they told me it was defective, so they sent me another one. The one I have now works pretty good, but since it's so small, it can't have a screen in the back to show the pictures, and it can't have flash.My pictures aren't 2x3 inches...they're much bigger. The good thing is that it's so small that it fits in your pocket, or purse, and it is light. It's okay if you just HAVE to take pictures for a few months, but I do recommend buying a better camera.", "Date": "July 20, 2004"}, {"Title": "They should stick to making therometers...", "Author": "B. Son", "ReviewID": "R3SLA3NQE6VS7K", "Overall": "1.0", "Content": "My mom got this camera... wow a digital camera right? Wrong, not just any digital camera, but one the size of a credit card, and with the thickness of about 5 credit cards. To simply put: that is bloody small.But as in all things, when something is too good to be true, it often is. Though it is very conveniently small and portable, you will notice that there are no other cameras this small on the market. Why? The camera can only take pictures up to 640x468 pixels. If you know anything about printing and digital cameras, that is absolutely horrible. You can print 2x3 inch pictures... but what good are those? Anything bigger than that and you can enjoy crappy-quality photos with a lot of noise and off-the-walls lighting problems.The camera boasts an Auto-Brite system, which personally, doesn't seem to do much. Other than that, it also boasts being able to hold up to 26 640x468 images, and more with smaller-sized images. That is totally bad, but considering the size of the camera, it's amazing it can hold anything.The biggest problem with this camera is no LCD display... which is understandable with this size. Creating something this small, makes great conventionality, but sacrifices the most important things about a camera, being able to take a lot of images, quality images, being able to see the images so you can keep taking more or taking a picture again. With this camera, it's just hopelessly aim and click, or make sure you got the perfect set-up, and if it's bad, you will never know until you upload it to your computer.The camera itself is bad at picture-taking. Lighting is horrible, and colors are all over the place. Worst of all, half the pictures even with the steadiest hand, come out horribly blurry. I also noticed after using this camera for a while, the quality seems to go down a little with time. Not a good thing. Also, the lens can get crooked, resulting in things becoming very off-center.Simply put, even for 50 bucks this isn't worth it. It's not worth even selling... Any person who wants a quality digital camera needs to be willing to spend at least 300 bucks, not 50 bucks. You're better off buying a one-time use camera... you can at least get at least 81 quality shots with those for this kind of money...", "Date": "July 4, 2004"}, {"Title": "Not Worth the Price", "Author": "Angela Mohle", "ReviewID": "R2EA2R2ZHDAZER", "Overall": "2.0", "Content": "I had a similar problem as a previous reviewer: my rechargeable battery petered out a few DAYS after the warranty ran out. Luckily, after a ridiculous dance with customer service, they sent me another one. Within a year, the new one would not hold a charge either.The pictures are really not very good - they're actually worse than my camera phone! The camera on its own holds very few pictures (like, 28 or something), and the flash is a cartridge-type thing that snaps on the camera. Only the camera fits in the case, so you have to find something to do with the flash.Unlike the previous reviewer, my camera did NOT cost $30 - it was more when I purchased it - but even at $30, it is not a good buy. If your kid wants a camera, buy them a kiddie digicam. If you're looking for something inexpensive, surely there are better choices out there!", "Date": "June 18, 2007"}, {"Title": "tiny but low quality", "Author": "E. Thoman", "ReviewID": "R1AUYGBMKRE1K6", "Overall": "2.0", "Content": "It really is very small.  But the pictures are poor and the framing is very difficult.  The software is good.", "Date": "August 19, 2005"}], "ProductInfo": {"Price": "Unavailable", "Features": "Resolution 640x480\nInternal Memory 8MB\nExpansion Memory\nBattery Internal Lithium\nArcsoft Photoimpress", "Name": "OSI DS6618 Digital Camera", "ImgURL": "http://ecx.images-amazon.com/images/I/31G5BV5B0YL._SX300_.jpg", "ProductID": "B0000AMDX8"}}