{"Reviews": [{"Title": "Great Choice in an Ultra Compact - Don't Overlook this One!", "Author": "Amazon Customer", "ReviewID": "R278POUOJVL4SW", "Overall": "5.0", "Content": "In my opionion, the Panasonic DMC-FX8 and FX9 are the best choices in the ultra compact camera category. I have owned a couple of the Canon SD cameras (SD200 and SD300) and the pictures produced by the FX7/8/9 are vastly superior, esp. with Indoor Shots. The Image Stabilization really helps in Indoor, Low-Light Settings which if you are like me, is where you take the majority of your snapshots.  The Canon SD500/550 are arguably better cameras due to their bigger sensor, 7 MPs, and stronger flash BUT they are not small enough to toss into my front pocket (a pre-requisite). As for the cracked LCD screens, google \"Canon and Cracked LCD Screen\". It is not an isolated problem! The best precaution you can take is two-fold. Buy a LCD screen protector as well as a hard camera case (I review one of each btw).Finally, the FX8/FX9 have corrected the two major complaints people had with the very popular and well-regarded DMC-FX7. They now boast a faster AF, a longer-lasting battery and 640x480 Movie Mode. If they had manual controls, they would have created the elusive \"perfect ultra compact\" camera!", "Date": "February 8, 2006"}, {"Title": "A Nice Surprise", "Author": "K. Wallace", "ReviewID": "R3Q1RHW1GHKACM", "Overall": "5.0", "Content": "I have to admit Panasonic did not come to mind when replacing my \"work\" camera (a Ricoh RDC5300) but it survived the weeding out process during my reviews.  I am more than pleased, I am amazed at how much capability can be packed into such a small package, and the results are excellent even for casual shooting.  I do a lot of work related macro shots and thought 5 cm was a bit long but the higher resolution more than makes up for it.  And the optical stabilization allows me to skip the tripod for many shots.  Battery life is so much better than the RDC5300 it's not even funny and the larger screen (w/ mag) allows me to easily check focus.  My experience with digital cameras is limited but I couldn't be happier with this puppy!  Construction quality is also top notch.  Don't overlook Panasonic.", "Date": "March 18, 2006"}, {"Title": "Watch out for the screen!!!!", "Author": "david rogers \"Dave\"", "ReviewID": "R2F4BOHUCJ0FRK", "Overall": "1.0", "Content": "The camera it self is very nice, i loved it while it lasted.... which is where the problem is.  I had this camera for one month before the screen in the back cracked.  There are many other people who have also had this problems and it is expensive to fix.  For some reason the protection of the screen is very weak and needs to be upgraded for this camera to really be worth the risk.", "Date": "February 7, 2006"}, {"Title": "Not predictable", "Author": "C. Jackson \"Chrisie\"", "ReviewID": "R1Q0QLHBVGSFBN", "Overall": "2.0", "Content": "I have this camera and am taking it back tomorrow.  It can take good pictures but it also takes terrible pictures.  I never know which it's going to be.  Tonight I used the same settings for all the pics in the same lighting conditions and half the pictures where good and the other half were very grainy.  I've been trying to figure out if I am not setting something correctly and have given up.  I didn't buy a little camera to pull out of my pocket and spend forever adjusting settings so I can take a picture.  I am very disappointed with this little camera.", "Date": "March 3, 2006"}, {"Title": "Great Compact Camera!", "Author": "TF \"TF\"", "ReviewID": "R2CRZ5F0YFDYSG", "Overall": "4.0", "Content": "First - I am done with Sony. I have owned two CyberShots - the first (2003) was extremely compact and was excellent. My 2nd CyberShot (2006) died in less than 1 year, cost more than the Panasonic, and had less features. I don't know what happened over at Sony but they have fallen behind.Now with Panasonic - they made the commitment that all of their cameras have image stabilzation at least a year ago. That was the #1 reason I looked at this model. The stabilization works really well - I have many more pictures that comoe out clear vs. a non-image stabilized camera. As stated in other reviews, image stabilization helps with a jittery hand - it won't compensate for large movements - but I will only buy cameras with this feature now.Speed - Without the flash, this camera is very responsive and fast between pictures. There is also a setting to take a series of pictures by keeping your finger on the button. Very nice feature for capturing action sequences. With the flash, the camera is still pretty responsive, you just have to wait for the flash to recharge (performance is better than the Sony CyberShot).Battery - The camera ships with a lithium battery and I have been getting 100-200 pictures (mix of flash) on it. Overall, I rate battery life high. Also, the battery recharges fairly fast - but I still purchased a spare.Enginnering - The camera is compact but has a large LCD screen (I'm fine that it doesn't have a viewfinder) and it has a solild feel to it. I purchased the Lumix case for extra protection.Picture Quality - With outside lighting, the quality is excellent. Inside, the quality is pretty high with good lighting or the flash. In lower lighting scenarios, you start to see some quality issues - but nothing out of the ordinary for a digital camera in this price range.Overall, Panasonic has impressed me and in my opinion, has surpassed Sony - at least in the compact digital camera form factor.", "Date": "August 2, 2006"}, {"Title": "I like it, takes better pictures than my old sony cyber p43", "Author": "Angel Fountains", "ReviewID": "R2PW7T94Z1ANJ9", "Overall": "5.0", "Content": "I like this camera because its so compact, it looks very modern and is very light. It is also very easy to use, no software necessary to obtain pictures from the camera.I have no problem with it. I dont expect a miracle in a digital camera.A bit grainy on the white balance when maximum zoom level is used, aside from that I have no complaints.I would like to watch Final Destination 3 again and try to ride a ferris wheel or something then use this camera. :)", "Date": "July 15, 2006"}, {"Title": "eazy and pretty", "Author": "Arthur Magana", "ReviewID": "R1H1SS0J9PWB44", "Overall": "5.0", "Content": "All I have too say is that the picture quality is really good, I was gonna get sony dscw70 but I didnt need the extra megapixels so I got this cheaper camera and it blew me away it's easy too use and takes clear pictures with good color. If u are getting this camera make sure u read the manual too know all the options for instance if u take picture using portrait mode it smooths out the skin tone so that u hardly see all the detail in the face like all ur moms wrinkles, yet still looks really crisp and ready too print out anyways I recommend this camera. oh yeah I work at circuitcity and they all recommended this camera because of its stabalizer if u got shaky hands this camera has a good stabalizer and oh yeah I got it for 139.99 at circuitcity with employee discount swweeeeettttt. battery life is pretty good 2.", "Date": "August 17, 2006"}, {"Title": "replaced older broken( accidentally smashed) lumix of same model", "Author": "thomas clifton cochran", "ReviewID": "R36IK79I8MUWG2", "Overall": "5.0", "Content": "Took a chance on this used but like new product at greatly reduced price and it exceeds all expectations so far.", "Date": "August 15, 2013"}, {"Title": "panasonic camera", "Author": "Sam", "ReviewID": "RN3K9MKKCTGQ8", "Overall": "3.0", "Content": "NOT SURE I received ALL pieces of my order due to a VERY Vague receipt...everything I did receive seems to work fine...", "Date": "February 3, 2013"}, {"Title": "Great camera and lense.  Look for update models in this line.", "Author": "J. T. Hicks", "ReviewID": "R1QFNXQSQEDC4T", "Overall": "5.0", "Content": "Great camera and lens.  Look for update models in this line with somewhat high resolution.  But don't get hung up on getting the highest resolution camera; 8 to 9 MP produce beautiful 8X10s with good sharpness and color saturation.  When you go with a higher resolution on the same size chip you may sacrifice color accuracy and saturation.", "Date": "December 10, 2009"}, {"Title": "Performs well; $$$ to repair", "Author": "J. Servideo", "ReviewID": "R1U7GIM0QBZRVM", "Overall": "3.0", "Content": "I bought the camera for vacation pix in Alaska.  Worked great; then developed a grey/black smudge in every shot.  Not a dirty lens!  The screen scratches easily (hubby's pocket with keys!) and is difficult to see in bright sunshine.  End up pointing and shooting then reviewing in a darker spot.  Hubby also managed to get some water into the screen which promptly turned black; camera was not working at all but after allowing to dry the screen returned but it still took a while for full recovery!  Just bought a Lumix FS3 at Big Lots for only $88.  Camera body has more plastic; made in China vs. Japan.  Still alleges a Leica lens.  We'll give it a try.", "Date": "November 28, 2008"}, {"Title": "Good Camera", "Author": "Jose Pequeno \"Peq\"", "ReviewID": "R30YXF7PBCU3MS", "Overall": "5.0", "Content": "This camera was a replace for a broken camera of a friend. He said that is an excelent camera, and he buy again after he drop his previous camera.", "Date": "January 27, 2008"}, {"Title": "Good Camera", "Author": "William Fan", "ReviewID": "R1COJJHH9E3YTY", "Overall": "4.0", "Content": "The pictures are decent, but not like Cannon S500 or Sony T-90/W-50. The stabilizer is great, and it comes with plenty of features. LCD is big and unfortunately it is fragile. Other than that, it looks great.", "Date": "July 5, 2006"}, {"Title": "Small nice cammera with huge LCD", "Author": "Julian Tascon Munoz", "ReviewID": "RUIO67V5CQY46", "Overall": "4.0", "Content": "Nice cammera, the image stabilizator works great, could have a little bit more zoom.", "Date": "November 17, 2006"}, {"Title": "The one used in Final Destination 3", "Author": "A. Ares \"chaca88\"", "ReviewID": "R2KPSBVI0C597", "Overall": "5.0", "Content": "I don't have this camera but is interesting to know that this camera is the one used in the movie \"Final Destination 3\".I'am not going to buy it because is too expensive for me, being other cameras at lower prices but for people who want to say \"you know what, this camera is the one used in a movie\" that's cool.  By what is seen in the movie it has a really big display and nice LCD quality being at night that the characters used it. You can see that is the same one, when the main character is in a apple computer and is downloading the pictures to the computer it says \"Panasonic DMC-FX8\"I think is good to give you this info if you want to buy an excellent camera that is used by hollywood stars.", "Date": "July 12, 2006"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B000A7Y18A"}}