{"Reviews": [{"Title": "Coolpix S4: initital thoughts...", "Author": "R. Thompson \"sixseven\"", "ReviewID": "R33S70O9MMDFYN", "Overall": "4.0", "Content": "I had this camera backordered through Amazon and received one of the first ones.  I have used Nikon SLR cameras for roughly 25 years and have high standards and expectations for their products.My initial reaction to the camera is that the lens is fantastic, but the overall design is lacking.  It's as though it was rushed to market.First the size.  It's not small enough to be truly pocketable.  I use my Contax U4R for that.  The layout is also not as good as with the Contax, nor is it as intuitive.  I find myself always putting my fingers on the wrong places, esepecially on the LCD screen.  This is not a camera where everything feels naturally placed; then again, there's not a lot of room to work with here.  I guess my preference would have been for Nikon to make the camera slightly larger and easier to handle, with a viewfinder and VR to boot.  It wouldn't surprise me to see this same lens in exactly that type of product within three months time.Besides those issues I do like the camera.  The biggest limitation of \"pocketable\" cameras tends to be the limited zoom range.  I was recently on a sailboat and a cruise ship, wanted to get photos of things I saw on shore, but didn't have the zoom range (with my Contax) to get close enough to the subject.  The Coolpix S4 certainly solves this issue.I find the images the camera produces to be quite sharp, without excessive edge enhancement.  The camera also seems to focus without difficulty (for me), including situations in low light.  I've been surprised at the quality of images from situations with relatively low light where I've switched off the flash.The speed of operation with the camera is quite good; it starts quickly, is very responsive, and doesn't lag between shots.Two caveats: first, I dislike the zooming system on the camera.  Specifically, I would like the ability to defeat the digital zoom in the menu system.  This camera doesn't allow that, so when you reach the limits of the optical zoom there is a \"grey zone\" where it's difficult to tell whether or not you're in optical or digital zoom mode.  Though there is an indicator in the viewfinder the transition is a tricky one.  Second, use AA lithiums with this camera.  This is not really a \"caveat\" or limitation of the camera, but you will be amazed at the battery life you get using these batteries.Why four out of five stars given the issues I've described?  The Coolpix S4 is the only camera in this size range with a 10X zoom lens.  Though it has its' limitations that lens truly distinguishes this camera, and sets it apart from the pack.", "Date": "October 5, 2005"}, {"Title": "Lens and flexibility are great; viewing & focusing are unusable", "Author": "Yacht shooter", "ReviewID": "RNEWWQ6TKYI5A", "Overall": "2.0", "Content": "I took delivery of my S4 yesterday afternoon and put it through its paces. The quality of the camera and the lens are absolutely terrific.  However, when shooting indoors: it won't focus or yield a non-blurred image when shooting indoors in available light.  If you're willing to use a flash all the time, it's fine, except for the fact that you can't turn off the \"in camera red-eye correction\" which sometimes leaves people and animals with a white hole where the pupil should be.  In other words, the camera takes out the red, but it doesn't always insert the black pupil!  If you shut off the red eye correction, then you get the glowing red eyes people hate to see.  Hey Nikon, make the in-camera red eye correction a \"feature\" that can be turned on or off, independent of the multiple flash red eye correction.  Right now you either have to take both or neither.  NOTE:  This is also the case with the Nikon 7900 that I bought for my wife but returned a day later because she couldn't use it to do indoor snapshots of her beloved animals. As she said, \"With white pupils, the animals looked like they has lost their souls.\" What a shame because it too is a wonderful design.Outdoors there's an even more severe problem with the S4:  I have more than a thousand pictures of yacht races and boats on a commercial website; all taken with a Nikon 8800 that I'm crazy about.  Today I tried shooting boats with the S4 and it was a complete bust.  It was a classic cloudy bright day with terrific glare off the water and sky; and it was nearly impossible to use the S4's LCD finder to compose my pictures.  No matter what angle I tried, the glare on the screen was almost impossible to penetrate.  What good is a 10x zoom if you can't aim the camera???  And before you ask, I did adjust the screen brightness from dim to very bright, and no matter which setting I used I ran into the same problem.  On the other hand, when standing in some shade, I did a terrific telephoto shot of a parrot's head from about 10' away that when blown up to 11x14\" showed every head feather clearly.I returned the S4 to my long suffering camera store and bought a Canon SD550.  I've already satisfied myself that it does fine indoors where focusing and available light shots don't seem to be a problem (although it too produces red eye, but not nearly as bad as the S4's); and the optical finder makes taking my yacht pictures a snap (no pun intended).  An 11x14\" enlargement of a dock shot was crystal clear, with bright realistic colors.  Following the advice of some of the Canon 500 owners, I keep the resolution Extra Fine, and the color adjustment to Vivid, and in these modes it seems to be the equal of any film camera I've ever used.Please Nikon, realize that doing away with the optical finder to make the screen 1/4\" higher is a DUMB thing to do; unless you want to deliver the entire serious amateur and professional market for compact cameras to Canon.  Please give us a revised S4 that has an optical finder, available light capabiilties equal to the Canon SD550, and either 2 separate redeye controls, or only the customary flashing light.And while you're at it, why did you add your terrific Vibration Reduction mechanism (fabulous on the Nikon 8800), only to the movie mode of the S4?  DOUBLE DUMB.  The vibration reduction feature is really needed whenever you're using a 10X lens; please give it to the S4's successor for still pictures also.Please understand, I've been using Nikons for more than 40 years and I love them.  I love my 8800.  But to cause me to return both an S4 and a 7900 in the same week means that you're now doing some things terribly wrong.  Please get back on track as soon as you can!!!", "Date": "October 1, 2005"}, {"Title": "You gotta remember what this camera was designed for.", "Author": "Yoda117", "ReviewID": "RG9AN92B6S24I", "Overall": "4.0", "Content": "I'm hearing a lot of FUD with this camera, and I can't understand why.  The camera was designed as a simple digital point and click with a good optical zoom.  Additionally, Nikon wanted to resurrect the swivel design that fans have been asking for ever since the last model was on the market.  To this extent Nikon has delivered, albeit with some short comings.  The device has a quick start up time, much quicker than I expected based on the interface.  There is an automatic mode and a scene mode to accomidate the ease of use features (remember, easy camera... not a lot of manual control).  Optical zoom is awesome, and as usual, Nikon delivered on the optics and photo quality.  I've taken photos at night, in low-light, rain, etc. and I've had no problems that I don't normally have with non-SLR digitals.  If you go through and take a little time, you'll find that the multiple scenes can be quite an advantage at times.  Yes, I would prefer the option for manual controls, but again... I understand what this camera was designed for.  I don't understand what people are saying with power conumption.  With the batteries supplied, I got about 60 pictures (mostly indoors).  With disposable lithiums, I got about 430 pictures before I had any issues... most of those using the flash.So now let's talk about the tradeoffs.  First off, there's no viewfinder.  That's a minor annoyance, but not a show stopper (the LCD on the S4 is very nice).  Next up we have the flash which can really wash out a picture.  Okay, either use it judiciously or switch to a scene mode that takes care of that problem.  Same with the speed of the shutter (if I remember to do so, I'll toss up some action pics from a professional baseball game... you can see the ball with no distortion).  Now here is the biggie...  shudder.  Especially in low-light this can be an issue.  What boggles my mind is that Nikon offers image-stabalization for this camera in movie mode, but not in image mode.  Does that makes sense?  I didn't think so either.  And even Nikon has agreed that it was a stupid move.  To their benefit, Nikon has acknowledged that they are going to fix the issue in the next firmware update (though when that will be is a mystery).Stuff like that keeps me from giving it 5 stars.The end result.  People who want a simple camera with good resolution and a strong zoom will enjoy this camera.  People who don't want a camera that is almost 100% automatic won't like this camera.YMMV", "Date": "July 20, 2006"}, {"Title": "Love it so far", "Author": "M. Samuelson \"Cyberferret\"", "ReviewID": "RI7C1SGURQOMI", "Overall": "5.0", "Content": "Well, I've had my Nikon Coolpix s4 for a couple of weeks now, and have taken pictures from stills to sporting events to boating to trying to get close-ups of quick moving pets (ferrets) and haven't been disappointed in the least.  The picture quality is excellent, particularly compared to my old Canon.  The 10X optical zoom is without doubt, wonderful.  You can't find that kind of zoom in any camera this size.  And you can't find anything that will fit in your pocket with this kind of zoom.  I just use the case that I bought for it.It takes high-quality pictures, good for 16X20 prints without showing any pixelation, and accurately shows color as it was when I took the picture.  The LCD works fine, in my opinion.  No problems from dark, poorly lit rooms to bright Texas sunshine.  Plus, I love the ability to swivel the lens.  It makes it VERY easy, in my opinion to take pictures from alot of different angles while keeping the camera level, or putting the LCD where you can see it easily.  Five stars, no doubt.  I'd recommend to anyone.", "Date": "October 17, 2005"}, {"Title": "Awesome Zoom, Great Little Camera", "Author": "M. L. Harper", "ReviewID": "R1Q0ALDEPMQR98", "Overall": "5.0", "Content": "The S4 is my second Nikon digital camera.  Someone ganked my first one, a Coolpix 3100.  I took that one to Costa Rica, Panama, back through Costa Rica and up into Nicaragua, taking somewhere around 3000 pictures along the way.  I dropped it (in its case) into the ocean one time and thought it was surely done for, but it came back and served me faithfully for more than a year after getting back to the states before it went missing.So I just got the S4 despite the lame reviews people have given it.  I took it to the zoo today and filled my entire 1 gig card.  After reviewing the pictures, I am pleased to say that I am quite happy with its performance.  It functions almost exactly like my 3100 did, except it has the awesome addition of a 10x optical zoom and a few extra megapixels.  The pictures seem at least as good of quality as my 3100, I think I'm being very critical though.  The image sharpness is excellent and the focusing works quite well once you figure out which modes it needs to be set to for that particular subject.The real advantage lies in the swivel lens though.  Just being able to turn it however you need it makes lining up your shots so much easier.  And being able to zoom as far as it does comes in handy more often than I had imagined.  For example, the animals at the zoo are never really close enough to get the shot I wanted.  The ability to zoom so far gets your picture right up in the animals face.  And if you want to use the digital zoom, you can get a full frame of an animals eye or nostril, or whatever.  It rocks!I'm telling you, the other reviewers were way too critical and I imagine they just dont know how to use the cameras settings well enough to get good pictures.  If you know how to operate a Nikon or you have the sense and intelligence to learn how, you are not going to find a more convenient little camera that can do all the things this one can.  Super zoom, awesome macro mode, video with sound(nearly an hour w/ 1 gig), all in a tiny pocket sized package.", "Date": "October 14, 2005"}, {"Title": "A bit disappointed...", "Author": "COOL WORLD \"travel bug\"", "ReviewID": "R2JH1NF2OY3MLP", "Overall": "3.0", "Content": "I bought the Nikon Coolpix S4 mainly because of the 10x Optical Zoom. I needed a new camera because my Olympus D-40's 3x zooming capabilities were no longer working. So, got my Nikon S4 a week before my vacation to Spain and bought a 1 GB SD card. Since I'm not to familiar with my new digital camera, I took along my Olympus D-40.ADVANTAGES: ZOOM, ZOOM, ZOOM...the action shots were great, took pictures of Real Madrid Soccer Players from high up the bleachers and the pictures came up really close...outdoor shots were clear...the lcd screen was useful when framing a shot at times...the movie mode worked great...DISADVANTAGES: its not as compact as it seems... the lcd screen was hard to see outdoors when its sunny, can't see where my subject was...took nightshots and there were white specks on the pictures, seems like floating circular specks as if there's watermarks on my lens (the manual mentioned it as dust particles in the air, i never had these problems using my Olympus D-40 at night)...also, when you turn the lens towards you to take your picture with a background view(the lens in line with the lcd), your face will be reverse on the shot (aaaaarrrgghhh, soo annoying) couldn't even compose your own picture... the biggest disappointment for me were taking pictures indoors, my museum pictures keep coming up blurry...there's an annoying red blurry signal because of low light that i can't get rid of...the action shots indoors was a total opposite shots outdoors...i tried to take a picture of someone popping champagne and it keeps coming up blurry ( i never had these problem with my Olympus D-40)...for me, my indoor shots i.e. inside museums and inside the house were all useless...even when i used the museum scene feature or party scene feature, didn't give me a great shot indoor...and i know my hands are not shaking as much because i was able to take awesome action shots at the Real Madrid Soccer match and the subjects were running...I'm sooo glad I brought my Olympus D-40. Once I found out my Nikon Coolpix S4 doesn't work well indoors, I would use my Olympus D-40. I was able to take museum pictures and indoor shots with my Olympus D-40, problem solved. The only hassle was I was carrying 2 digital cameras when I'm suppose to be traveling light.I wish there was a feature to turn off the shaking blurry signal. Nikon should have included anti-shake technology, built a better LCD screen that you can see when its bright outdoors and made the camera not too sensitive to low light. I would like to return it but I really like the 10x optical zoom feature in a small package.", "Date": "November 5, 2005"}, {"Title": "So far so good...", "Author": "B. Novida \"bruintoo\"", "ReviewID": "R2MEKFL3GGEY5M", "Overall": "4.0", "Content": "I was attracted to the S4 due to the swivel design and the 10x zoom. THis will be my 3rd Nikon and will be an additional camera to the household. We already have a Sony and Canon. The 10x zoom gives clear and bright pictures if you can stabilize yourself while taking pictures. It's too bad that vibration reduction option is only for capturing movies. I don't have a problem with the LCD in bright sun, unlike the other reviewers here. I find that pictures have a wee bit more noise than my Canon A80, but about on par with my Sony S60. The templates included in the scene modes are really helpful. The face priority in portrait scene setting really does work!", "Date": "October 21, 2005"}, {"Title": "slow shutter lag, no image stabilization and poor moving photos", "Author": "Brian B. Whitman \"amazonspokanereviewer\"", "ReviewID": "R1N8YISNO1HWI", "Overall": "3.0", "Content": "I was very excited about the S4 and had it for about a week. Unfortunately, I ended up returning it due to the fact that that it really didn't take better pictures than my old 2.1 megapixel Olympus. I really wanted a compact camera with good optical zoom, but as you'll find in previous posts, the zoom hindered by the lack of image stabilization. I don't think I have shakey hands, but I kept getting blurred images. Also, because there is no optical viewfinder, I had severe difficulties taking photos of my dog in the yard on a bright day.....Then there's the shutter lag to deal with. This is the part that drove me the most batty! I tried several times to take a picture of my dog inside - which is fairly difficult as he doesn't like to sit still very often - and either missed the dog altogether or got a streaky image that didn't resemble anything.All in all, I was disapointed with this camera. I am now looking at the canon powershot sd550 and the casio exilim ex-z750 which appears to have solved the issues that I have with the S4.", "Date": "November 2, 2005"}, {"Title": "NIKON COOLPIX S4 MP DIGITAL CAMERA", "Author": "MICROBIOBOB \"BOB PETERS\"", "ReviewID": "RJXL3GWU3KYEH", "Overall": "4.0", "Content": "This camera has excellent features, including rapid start and the ability to magnify small parts of pictures with excellent resolution.  The tilt lens makes it easy to handle and store.  The most problematic issue is the inability to see the view screen in bright sunlight.  There is no optical viewer, only the view screen.  A shading mechanism would be helpful.", "Date": "March 19, 2006"}, {"Title": "Great Zoom says it all", "Author": "Sami Paskin", "ReviewID": "R179MWNW5R4GP7", "Overall": "4.0", "Content": "Zoom was the main reason for me to upgrade my camera to this one. Being a Nikon was the second reason.It's the MOST POWERFULLL ZOOM in the market and this is very, VERY usefull to any picture you want to take. I mean REAL zoom, not that digital one that you can do on your computer and that you should NOT do with your camera, because it sacrifices quality of the original, which is a nonsense.It's a very high quality and beautifull lenses.I just criticize the way Nikon still uses the pre-defined (scene) options. They indicate the scene options as basic black icons, while other brands already shows a PICTURE of the expected result, so you REALLY have an idea on what each scene server for.If that's not important to you (if you are a beginner, it IS, believe me), this camera is a MUST.Sami Paskin", "Date": "March 5, 2006"}, {"Title": "Good but not great.", "Author": "Kindle Customer", "ReviewID": "R3ARH9BVF0NF2Y", "Overall": "3.0", "Content": "I bought the S4 to replace a 5 MP 5x optical pentax that died. I had the S4 for about 8 weeks and took a few hundred pictures with it. Overall, I think its a good camera, but not a great one. I obviously bought it because I was intrigued with the 10x optical. There's no doubt that the optical zoom is terrific. However, its use, in my opinion, was limited due to the flash not being able to light the subjects sufficiently. The quality of the pictures also did not measure up to my expectations. The pictures I took (landscape and pictures of my children for the most part) just did not appear to be as vivid as I would have liked. Also, its hard to quantify this, but the shape of the camera lacked a certain something that made it somewhat...awkward to hold and use? You end up holding it by griping the LCD screen on the back which then is constantly smudged.  When taking videos, I found it strange that you couldn't zoom in or out in the middle of the video but whatever level you started on you had to continue on. Also, the S4 is slightly bigger than I would have liked (obviously much smaller than a SLR, but still....) and much bigger than the SD550 I recently got. On the plus side, the zoom is great, it has some cool features.  I recently bought the Canon SD550 to replace this Nikon S4. The SD550 was the camera I was considering originally when I bought the S4 based on the 10x optical. Obviously with the SD550 I'm giving up a lot of zoom (it only has 3x) but I decided that the quality of the pictures was more important than the ability to zoom to that degree. The SD550 is really small which is important because I'm always taking pictures on the go with my kids (skiing, soccer, hikes, etc). I wish there was one camera that had it all (7+ MP, 5x Optical, small, great quality pictures, good features...). So far it appears that the SD550 may be closest to meeting those requirements.", "Date": "January 3, 2006"}, {"Title": "Nice but not perfect", "Author": "Marco from Brazil", "ReviewID": "R1OMQEA2HM0N8", "Overall": "4.0", "Content": "I just received this camera from Amazon and traveled with it in a cruise and disney parks. Well this is a nice camera I took my pics in a 3 m Format which gave me files of 500k. The camera looks goos is not that smal neither is too big. Is easy to cary all day long.The zoom is very very good but it lacks some sort of stabilization so it is difficult to have nice pics in its full range.My nighthots were just so so i had to try differents type of pics and in the night portrait or backlight they were better but not fantastic.The day shoots were very good with nice colors most part of them.The screen is nice and big altought sometimes very difficult to see in daylight conditions. The lens are nice and the ability to change the angle is a nice feature if the camera, it can improve your screen vision with different angles of the lens. It is a nice camera in my opinion with good pics quality specially in day shots.The batery I used was alkaline type and I took about 150 pics with a set of 2 batteries so if you are like me will need at least 2 pairs per day.Maybe with lition or recharble batteries the battery life is improved.The camera is not heavy at all and has a nice handling.", "Date": "November 3, 2005"}, {"Title": "Battery problems, focusing problems", "Author": "Ashwin Kulothungun \"Chs\"", "ReviewID": "R36VT6HXQ407KT", "Overall": "4.0", "Content": "The camera's great otherwise - excellent zoom, resolution, and overall good clarity and color in the images produced. The two things that detract from it though, are the battery and the focusing mechanism.My batteries lasted for barely 40 shots before I had to replace them - this happened thrice before I finally replaced them with li-ion rechargeables. These were almost worse to begin with, but I knew you had to wear them in, and after the third recharge, they started improving - but not by much - it still gets only about 50 shots before it dies ( or sometimes it doesn't die, but it gives you an out of juice error and comes back to life when you restart it).My focus apparently had a problem too - it barely ever worked. Often, I'd have to wait up to 20 seconds just trying to get it to autofocus properly.I also wish it had image stabilization.", "Date": "March 3, 2006"}, {"Title": "Great for what it is", "Author": "Kindle Customer", "ReviewID": "R1NBT40FVS2GVZ", "Overall": "5.0", "Content": "I purchased this camera about two months ago prior to a vacation.  We had a Canon Powershot G1 which my husband purchased and got a lot of use out of.  However, I found that too technical for me (average picture taking abilities).  So we set out to find a smaller, pocketable \"point and shoot\" type camera.  After looking at all the tiny cameras, I found the Nikon Coolpix S4.  I tried out the zoom and was sold immediately!  I also thought the swivel lens was \"gimmicky\" and thought the different scene modes were okay but not worthy of a selling point.  I was wrong on both accounts!The S4 doesn't have a swivel view screen as our prior camera so the swivel lens is AWESOME!  You can point the lens up or in any direction and still be able to look at the screen without trying to contort into position to see the screen while you take the shot.  Also, after using my S4, I hate using other people's digital cameras... the screen on others is SO TINY compared to the S4's seemingly huge screen.As for the preset scene modes I use them all the time as they take great shots and it is so nice to have it set to a landscape mode and then be able to switch back to normal camera mode for a non-landscape mode then back to scenery mode so the camera is ready to go again.  Saves a lot of playing around trying to get the right settings.I could go on and on about this camera but the sum of it is that it is a bulkier than pocket sized cameras but if you want more bang for your buck as far as zoom goes, get this camera!Enjoy!", "Date": "July 14, 2006"}, {"Title": "Great photos but slow and cumbersome", "Author": "black*mamba", "ReviewID": "R1DA98VK3STMV9", "Overall": "3.0", "Content": "I bought a 4 megapixel Sony DSC S90 last Christmas, and it worked fine, but I thought I could do better. Taking pictures of flats like books and magazines all day long, I thought a camera with a swivel lens design was exactly what I needed. That way I could point the lens down while keeping the LCD at eye range and not have to bend over all day. The Nikon Coolpix S4 is the only one currently on the market with that swivel body many people understandably love (I thought about getting an old Nikon Coolpix 4500 with a puny 1.5 inch LCD off ebay, but that's taking a big gamble). I hate to say it because it sounds so innovative, but this swivel design may not be for me. I just find the S4 cumbersome, a lot harder to handle than the Sony. It takes longer to set up than the Sony. Also, 90% of the time I was getting that blur warning - well, it's hard to keep the camera steady when you have to press hard down on the shutter to get it to go (pressing it halfway sets the camera's exposure but why not be able to set it some other way??). You just have to tap the shutter on the Sony - I took for granted how nice and easy it was. I thought the blur warning on the S4 would be terrific because I would upload pictures from the Sony into my PC and then see that some (not many) were a bit blurry, and I'd have to debate going back and setting up shots again. But the 2.5 inch Sony LCD is nice and clear, so usually you can tell if the picture is going to be blurry. The Nikon 2.5 inch LCD is NOT nice and clear so you DO need that blur warning set to ON. I'll try it for a couple of more days, taking pictures with the blur warning off, and see how sharp they look on my computer. But I believe I'm headed back to the Circuit City returns department to pay that bloody 15% restocking fee.", "Date": "August 15, 2006"}, {"Title": "basicly, it's a good 10x optical zoom DC", "Author": "Chih Chang", "ReviewID": "R1GQX7BWM4TC5M", "Overall": "3.0", "Content": "I like the old coolpix turnable lense desigen. And the 10x optical zoom is useful, too.  But the battery life is sort and the LCD is too big to leave space for your hold finger and the hand will touch it all the time in eye level shot.", "Date": "February 23, 2006"}, {"Title": "Very good camera", "Author": "F. C. Marin", "ReviewID": "R35XX57NT26GAD", "Overall": "4.0", "Content": "This is a very easy camera, the automatic mode gives you enough control for taking excellent pictures, and the scene modes are very useful (except the interior mode, that doesn't convince me)Zoom is incredible, 10x optical and a macro that really gives sharp pictures at even 2 inches of distance.Swivel lens gives you freedom for creativity and is very comfortable.The quality of the pictures are great and the video is average, just 15fps, only for fun and not for professional video.My advice is that you buy a small tripod (pocket size) for nightshots, so you can get memorable instead of blurry pictures.And get rechargeable 2500mah AA batteries, they are worth it.", "Date": "January 1, 2006"}, {"Title": "Great Camera", "Author": "R. Stearns", "ReviewID": "R2Q7R8L3SSZ3HB", "Overall": "5.0", "Content": "This is my fourth Coolpix camera starting with the original 950 in 1999. They are great cameras packed with lots of features. The swivel is a great feature, allowing for stealth photos and different angles while composing the shot. Picture quality is good and S4 has a much better flash, and indoor capabilities than previous models. I have taken over 10,000 images with the Nikon Coolpix family and, obviously very happy with the cameras.", "Date": "February 18, 2006"}, {"Title": "Zoom Zoom", "Author": "T. Nasseri \"Collin\"", "ReviewID": "RZTDO2KT3VCJK", "Overall": "4.0", "Content": "I definitely agree with some of the comments that the 10x Zoom is excellent and the indoor shots aren't great.  The main reason I scooped up this camera for my secondment here in Melbourne, Australia is the 10x Zoom.  I got fed up of 3x Zoom cameras that don't take great landscape shots, especially since I travel a lot outside the US.  The sales lady also recommended this camera to me for the indoor shots as it shoots flashes to several areas in Indoor Mode; however, when I took several indoor shots, they're always blurry.  That really bites and can't figure out how to fix that problem.  Also, night shots aren't the greatest and I'm working on that part too.Other than that, this camera definitely brings attention to others.  In daylight, it's awesome.  Lots of features and shooting modes.  You can zoom in for objects and other items super far away, which is very attractive.  I was out and about Melbourne the other day and shot all their sports complexes and light reflecting off the water.  The best part about it is that it has the panorama mode and you stich them together on the software provided.  It's awesome.  I stiched about 12 pics. together and it comprises about 4 stadiums here in Melbourne, AU.  It's awesome.The con is that it doesn't have the Image Stabilizer but the new S10 has it.  I'd definitely go with the S10 but it's too late for me since they just released it.  The button is not the softest on the way down, so it causes shots to be blurred in indoor and night mode.  During the day, no problems!  Strange.  Anyway, I recommend a Tripod and setting the timer on to take those pics. and they should be fine.But if you want zoom, go for this S4 or the newer S10 model.  If you want a 3x Zoom, point'n'shoot camera, go with the Canon S630 or S700.  Those two Canon ones are awesome and you can shake the camera and still take great pics. in low light conditions and they come out excellent.  I tested a bunch of cameras before buying this Nikon S4 because I wanted more landscape and ability to take shots from far away.  Put it this way, I'm not a pro at all and just an average joe when it comes to cameras.  I told my friend about the Canon S630 for her wedding trip and we went to the store and she bought it right then.  We took it to the Galleria Mall in Houston, TX that same day and tested it.  Perfect pics.My understanding is that Canon is the best, followed by Nikon and then Sony.  Don't waste your money on the Koday V610 as it doesn't perform well in low-light conditions even though it has 800 ISO.Well, I hope the above makes sense.  Get the S10 over the S4 due to the Image Stabilizer and if you want a Point 'n' Shoot, go with the Canon S630 or S700.  Cheers mates!Collin", "Date": "October 10, 2006"}, {"Title": "Quite unlike its predecessor", "Author": "David Kennedy", "ReviewID": "RCK4NALPCP52S", "Overall": "2.0", "Content": "I purchased this item with hopes that it would aspire to the former incarnation I had wished to update: the Nikon CoolPix 950. I bought the 950 in 2000, and it consistently provided quality shots and unfettered flexibility throughout its tenure despite its somewhat antiquated technology... at least until that fateful day the airline destroyed it along with my baggage.I was delighted to see that an alternative \"Swivel-Lens\" model had been released by Nikon. What could be better? The Swivel-Lens versatility I'd come to know and love, coupled with updated technological prowess.It took roughly three pictures to determine that this was one of the weakest digital cameras I'd ever had the displeasure of using. The flash is pretty much REQUIRED - unless you're directly in the path of the sun with its radiant heat beaming down upon you with an intensity great enough to sizzle the very skin off your bones, the flash will automatically engage (unless, of course, you manually turn it off - in which case you're in for a real treat: the \"blur sensor\", while obviously intended as some sort of warning mechanism, never goes away... even if you set the camera down on a stationary device and gingerly press the button with the gentlest of taps). The problem with this is that flash-enhanced photos on this camera appear synthetic and overly-red, even after the settings have been adjusted. Expect to use PhotoShop or some other third-party photo editing software to make these pictures viewable.I thought perhaps my novice expertise in the field of photography might have been to blame, so I contacted Nikon. I explained that this camera was difficult to operate in comparison to the earlier 950 model. They proceeded to chastise me for having purchased an inferior model of camera (keep in mind that they are referring to THEIR OWN PRODUCT, and that the \"superior\" model is a camera over 7 years old) and offered no suggestions whatsoever as to photograph improvement.This was a severe disappointment. While I thought the first Nikon camera had made me a customer for life, this perception was quickly undone by my second purchase.", "Date": "April 27, 2007"}, {"Title": "bulky and hard to manage", "Author": "A. Garza \"dorky scientist\"", "ReviewID": "R1FNI4GWGPQ5LF", "Overall": "2.0", "Content": "I had originally purchased a panasonic but when I opened up my package I saw this camera inside. I decided to give it a try and I was not pleased. I don't claim to be a camera savy person, but I didn't like that the indoor pictures always end up blurry, even in the macro mode. It takes forever for the picture to be taken. Its not well suited for children that move constantly or pets. You press the button, count to 5 and then it takes the picture. The button is really hard to push. And the ok button, don't even get me started on that. I tried it for a day and my thumb still hurts from trying to control that button. It eats up batteries like crazy. It came with two energizer batteries and I was only able to take 20 pictures before it started giving me the battery depleated signal. All in all, I'm very glad I didn't purchase this camera, even though it is in the same price range as the camera I had originally orderd.The zoom is very nice and clear. So is the panoramic view. but if you want to go with a wide angle lense may I suggest the Panasonic DMC-FX01S 6MP Compact Digital Camera with 3.6x Optical Image Stabilized Zoom.", "Date": "November 21, 2006"}, {"Title": "Trust me: it is \"cool.\"", "Author": "T. Smith", "ReviewID": "R3IUG056K8KRMI", "Overall": "5.0", "Content": "I bought this camera a couple of weeks before I left to tour Greece and Turkey last month. I ended up taking over 600 pics with it. Most of the pics were taken before I had really figured out how to fine-tune the camera to take the type of specific type of picture I needed to take at any particular time.Nevertheless, I made some awesome pics. Yes, part of the reason I was so successful was my great abilities as a camera man (ahem), but seriously the great pics had to do more with the camera than it had to do with me. I am very satisfied with it so far. Also, it is very portable. Whether you spring for the belt case like I did or simply wear it around your neck, you hardly know it's there--that is, until you need it.\"Coolpix\" is aptly named.", "Date": "December 12, 2005"}, {"Title": "Great zoom terrible low light.", "Author": "Rhys Morgan", "ReviewID": "R31GH9PZTB8YEO", "Overall": "3.0", "Content": "This camera has the most wonderful design and form but it is really bad in low light. The flash is very harsh, and the higher ISO makes the images very grainy. I really like this camera but I wish Nikon could do a better job with flashes on these folding body designs. One review I read said the problem was that the flash was too close to the lens resulting in the glare and reflection issues.Size is great so much better than my 990.", "Date": "April 11, 2007"}, {"Title": "Terribly disappointed in this camera", "Author": "J. Loukonen", "ReviewID": "R2ZHR90SI2VGGF", "Overall": "1.0", "Content": "The camera is good for outdoor zoom and macros.Daytime only. However, I was attempting to shoot some night shots at the county livestock show. It was night in a huge tent with bright lights. The appropriate scene setting was bright enough but all photos were totally blurred.  I then tried changing the shutter exposures, etc. manually. Better but not very good at all. Clear but dark and grainy.  Tried movie mode  at the fair at night..the rides.  Grainy and not clear.Terrible red eye problems with the Coolpix.  Not just red but bright white dots in eyes at night also. White dots even with the redeye reduction.In contrast, we also bought at the same time a Pentax Optio W20..the water proof 7 pixel one.  Using the Pentax simple scene setting in the nighttime tent..photos were bright , clear outstanding.  In contrast, the majority of the scene settings with the Nikon Coolpix require a tripod..not too practical . Wit the Pentax Optio W20 Movie shooting the rides, etc. at night..movies were as good as a video camera..clear, crisp, and beautiful color.  Both  cameras can be bought for the same price of $249.  Both also have an excellent macro. For ease of use and best quality...do not buy the Coolpix. THis was very disappointing asmy daughter bought a Coolpix years ago and at that time they made a wonderful camera.  Not so now.", "Date": "February 11, 2007"}, {"Title": "Knew within minutes of opening that I had made a mistake...", "Author": "Richard Yacuk", "ReviewID": "R5B7X3IL9H3EJ", "Overall": "2.0", "Content": "We had a Canon digital Elph which we loved dearly. It was easy to use, incredibly well made, quick to power on/off, quick to snap pictures. The Canon was either left on the beach or stolen from us.After being without a digital camera for over 3 mos., we got desperate to buy another one. With funds being tight, I cashed in a ton of Marriott miles to buy the Nikon S4. There weren't many reviews on the camera, some were so-so others were good. The early customer comments here and at Circuit City were not too great.Within minutes of installing batteries and memory and trying to snap first pix, I could tell I had made a bad purchase. The camera took forever to start up. It had a VERY tough time taking indoor pictures. The flash completely overwhelmed indoor subject matter. There were huge pauses between pix. I would try to capture a funny moment with my daughters and the camera would just sit there as I mashed the shutter button, and the camera would completely miss the moment. I can't tell you how many pix I missed because of this camera, not to mention basic indoor shots that came out blurry and brown.On the plus side, I can say it was well made, the LCD was gorgeous, and the zoom was great. But the lack of an optical viewfinder, poor speed, inability to handle indoor pics, and poor on/off times really killed the deal.We love our Nikon 35mm film SLR. That thing is great.But the s4 was unloaded on Ebay for a Canon A700.Sorry Nikon.", "Date": "June 15, 2006"}, {"Title": "Great camera", "Author": "A. Blandford \"Michelle\"", "ReviewID": "RIIOMOYM2N0K0", "Overall": "5.0", "Content": "The design is awesome!I bought this camera for a relative for Christmas but I did familiarize with the camera before wrapping it. The camera is awesome. I love the swivel lens. It seems to be very sturdy. The pictures come out very clear on the lcd screen.The shutter speed on the camera seems to be adequate.Since I was buying this camera for a man I wanted to make sure that the camera wasn't 'dainty'. This camera is a nice size, not too big and not to small.The video mode is spectacular. I love that it has audio.The camera is very easy to operate. I was able to use the features without using the manuel!The zoom is lacking a smidge. I would not say that it is good for 10x opti but I would definately say it is a great 8x opti.I think the camera is well worth the money. I looked at several other cameras for 5 months and decided on this one and I definately feel like I got the best deal.Highly recommended to everyone who wants a great digitial camera with a unique design.", "Date": "November 8, 2005"}, {"Title": "Good for the price", "Author": "IMHO \"IMHO\"", "ReviewID": "R1JJ2Q5GSD4KYN", "Overall": "3.0", "Content": "I like it, nice zoom, no image stablizing software built in (zooms are very bouncy), the internal menu is a little non- intuitive, 10x optical zoom rocks - overall, I'm glad I purchased it.", "Date": "January 12, 2007"}, {"Title": "Cool Camera", "Author": "Jihad Ali Allan \"Jihad Allan\"", "ReviewID": "R20U0W4H4PA5YM", "Overall": "4.0", "Content": "Hello, I have my Coolpix 4S for over 5 years. My first Nikon Coolpix 2S dropped and broke.  I ordered another one.  I love the lenses swivel and the 10x optical zoom.  I wish that Nikon keep making it and update it.  It does not do well at night.  It needs light.  I took thousands of pictures with this camera around the world.  It is wonderful.  I love it.  The new cameras are great but I can't find one with the same lens feature and 10X optical zoom at the same time.  Hope this helps", "Date": "December 14, 2010"}, {"Title": "Prize winning camera", "Author": "bl@ke", "ReviewID": "RH2QOHUTO0RO2", "Overall": "5.0", "Content": "I've had this camera now for over a year. I remember when I bought it, I paid over $400, but it has been WELL worth the buy! I have made several prize winning shots and i've been published in 2 different magzines now with my pictures. All that and I'm just an amateur. Having a 10x Optical Zoom on a camera is a nice commodity in itself. You just don't get that much with digital cameras.I would recommend this for digital camera beginners and halfway serious amateurs, because it's far from pro.If you want to take amazing shots (given the right lighting conditions of course) but don't understand Aperature Value, Shutter Speed, and ISO value, then this is the perfect investment for you!Have fun and remember this: if a picture is worth 1,000 words, then that must mean that a really great picture is worth 10,000 so shoot away!!!...like i read in a book recently, it's better to take 1 creative exposure than it is to take 6 standard ones...happy trails!", "Date": "September 8, 2007"}, {"Title": "I love the Zoom", "Author": "Anne Smith", "ReviewID": "R1AVLRLCYQJ48H", "Overall": "4.0", "Content": "This has been a great camera for our uses.  From family photos to vacation pictures.  My son also used it for his photography class.  There was a problem with the lens after we had it for about two months. Nikon fixed it and it has work great since, about 16 months.", "Date": "March 12, 2007"}, {"Title": "Junk", "Author": "Herbert L. Mann", "ReviewID": "R3AFLPKAGF5DZV", "Overall": "1.0", "Content": "I am an experienced photogapher who owns an Olympus digital camera with 2.1 megapixels. I wanted to upgrade to a higher resolution and the 10X Zoom. So, I got the Nikon S4. But, the photos are grainy with a lot of noise. I find the scene choices virtually meaningless. I am selling my S4 on eBay so keep an eye out for a real bargain. I'm going back to my trusty Olympus. And, another tip, never, ever buy a camera with an LCD display only. They are impossible to see in bright sun.", "Date": "January 3, 2007"}, {"Title": "Wonderful Camera", "Author": "M. Lifsh \"Rita\"", "ReviewID": "R21F9YD6JQ1O2R", "Overall": "5.0", "Content": "What I was looking for in a camera is a small size and a large zoom.  I found it in this camera.  I absolutely love it.  It takes wonderful pictures and is very easy to use.", "Date": "November 3, 2006"}, {"Title": "SUNBLOCK!", "Author": "Lindsay S. Yeazell \"liny\"", "ReviewID": "R1STY16JFDCKSO", "Overall": "1.0", "Content": "This is a good camera with a nice large lcd. However, you cannot use it with the sun behind you (and thus the light on your subject) because all you can see is your own reflection. Great for putting on lipstick?", "Date": "July 5, 2007"}, {"Title": "I love it!", "Author": "A. K. C. Araneta", "ReviewID": "R2ELWF8O4F1MDI", "Overall": "4.0", "Content": "It's a bit big, but I have never found a small enough camera with a 10x optical zoom. And since the zoom is my priority, I'm really happy with this purchase.", "Date": "January 10, 2006"}, {"Title": "Stay away from Nikon, lack of customer appreciation", "Author": "J. Mavankal", "ReviewID": "R1DI8LV3IBK2WF", "Overall": "1.0", "Content": "Bought this camera from Amazon in January 2006.  Paid almost $400 for it.  Took a few pictures and the quality of the pictures were good.  However my usage was very sporadic last year since there weren't too many picture taking moments popping up.  Must have taken at the most 200 pictures with this camera.This year my wife got pregnant and had twins.  Tons of picture taking opportunities!  However, the camera gave up just before our twins arrived in July 07!  The camera would turn on but the screen would just be blank!  Called Nikon to find out if I had accidentally changed some settings.  They just told me to reset the camera and check if it works.  I did so and it didn't fix the problem.  When I called Nikon back they told me to just send the camera in for repairs (for which I would be charged).  I decided to get on to the web and research this issue a bit since I knew my camera didn't get enough usage for normal wear and tear to spoil it. Not surprisingly, I found that this is not a problem unique to my particular camera.  It is a general problem with the Coolpix.  People have tried to get this issue addressed by Nikon but without any success. So, they try all kinds of tricks like banging the camera lens at particular angles with a certain amount of force to shake the lens butnot break it!  I called Nikon back and registered this issue at their website giving them links to the discussion forums where people were seeing this issue (in case they were unaware!!)  I wanted them toacknowledge that this is a problem at their end and that I shouldn't have to pay for a fix.But they \"politely\" refused after repeated email requests.I decided not to waste any more time with Nikon.  I am staying away from the Coolpix and from Nikon in general for their reluctance to own up to their mistakes and take care of their customers.  I will also be spreading the word so that the next person doesn't get into the same trouble.  I just wish now that I had spent that kind of money only after the Coolpix was tried and tested and the customer reviews were out on it.I am going and buying a Canon camera based on a recent experience my brother had.  His Canon Powershot (bought in 2004) gave some problems recently which he researched and found to be a general problem with Powershots also.  However, the difference was that when he called Canon customer service, they asked him to send his camera in and they fixed it for him free of cost!  Talk about customer appreciation!  All I got from Nikon was a \"lemon\" and time wasted conversing with them!", "Date": "November 27, 2007"}, {"Title": "looks good on paper", "Author": "M. carasso \"Mayush\"", "ReviewID": "R2Y6O33UDRX11C", "Overall": "1.0", "Content": "not worth the money. takes fuzzy pictures. eats batteries real quick. quite a disappointment", "Date": "September 5, 2006"}, {"Title": "Lens fell off inside camera", "Author": "tellsbadjokes", "ReviewID": "R1EXUB9EONECRY", "Overall": "2.0", "Content": "I bought this camera because of the swivel feature and have been satisfied with that feature.  The lens fell off inside the camera one day without sustaining any damage beforehand.", "Date": "March 28, 2012"}, {"Title": "Do not buy this camera", "Author": "A. Taeb \"MedDoctor\"", "ReviewID": "RZS8SU4VMRB80", "Overall": "2.0", "Content": "Battery life, 10x zoom is great but does not stay focused. Other than that it is great looking camera that it still get awe wows but ain't worth it.", "Date": "October 6, 2011"}, {"Title": "the lesser of two siblings", "Author": "John A. Lucier", "ReviewID": "R2XI7G3VR3MT8S", "Overall": "3.0", "Content": "I've been \"harvesting\" used digi-cams for several years now and two of them are the Nikon S4 and S10. Bought the S4 first and while the form factor was great and the use of AA batteries was welcome, performance was lacking. Can't see a damn thing with the screen in bright daylight. Focus hunting. It wasn't horrible but bad enough I quickly tossed it aside and went back to my dimage Z10 as my main go to. By chance I stumbled across its newer brother, the S10, and I can't say if it's just these two examples, but on them alone I will say the S10 got it all right where the S4 is all wrong. I guess this would belong in the S10 product reviews but for some reason there isn't one listed, so I will just say that the S10 is the most amazing performer out of nearly 10 cameras of its era (more or or less) I own, ALWAYS nails a razor sharp shot and doesn't disappoint. Pass on the S4 and get its brother.If you've already bought an S4 well here is a consolation prize: Pelican's smallest waterproof hard case (1010) will fit it if you remove the strap and lens cover and shave a bit of rubber off it. (the case interior) Don't go by measurements, it fits. I think we're all looking for a case you can toss off a cliff into a river that isn't any bigger than the camera's exact dimensions, and it does fit! (and if you look hard you can find some Nikon labelled ones cheap)", "Date": "April 8, 2011"}, {"Title": "Great Camera", "Author": "John D. Brumbaugh", "ReviewID": "R35Y3QGBXD0OLT", "Overall": "5.0", "Content": "I bought this camera in May 2007 on clearance at Circuit City for $139, and man, did I get a deal!  I've taken this camera on every trip I've been on.  It has survived five music festivals, dozens of concerts and even countless mosh pits strapped to my side in a camera case, not to mention it's been dropped a couple times, and it's STILL ticking!  Takes great pictures, and with a 10x optical zoom, 6MP, and a swivel lens that allows me to hold it over my head and still see what I'm aiming at, it is perfect for concerts and other similar crowded events.  My only regret is that it's not the best in low-light settings unless you're relatively close to the object you're shooting (max flash range of about 10-15 feet).  Despite this one flaw, I'm more than happy with this camera, and for what I need and use it for, I couldn't have picked a better one.", "Date": "December 10, 2009"}, {"Title": "This Camera ROCKS!", "Author": "J. Teti", "ReviewID": "R1WSM872ZVIJJ3", "Overall": "5.0", "Content": "I love taking pictures. This is the best Camera I have ever owned. It is a little expensive....but worth every penny.", "Date": "March 21, 2007"}, {"Title": "Nikon Coolpix", "Author": "Suzy M.", "ReviewID": "R1J2YFJIF9Q406", "Overall": "5.0", "Content": "I love the way you can move the lens around for the perfect angle, shoot in color, sepia, or black & white, take video clips, and more.  This camera takes wonderful photos, too.  I used to have an Olympus.....but I'm thoroughly satisfied with my Nikon now!  Worth every penny!", "Date": "January 10, 2007"}, {"Title": "Broken camera", "Author": "James Hall \"Jim\"", "ReviewID": "R10E7LJYZENYOV", "Overall": "5.0", "Content": "The camera was a Christmas present and did not work properly when opened. Contacted Wall Street Photo and new one sent quickly. Over all happy with how things turned out.Jim", "Date": "January 9, 2007"}, {"Title": "love the swivel", "Author": "A. Deo \"A D\"", "ReviewID": "R3FV9SA5I8R2ER", "Overall": "5.0", "Content": "got this camera for the swivel and the 10x zoom--and am happy. it's given me very good pictures so far.", "Date": "January 4, 2007"}, {"Title": "Nice pictures and flexible.  Lousy video", "Author": "Paul G. Ackerman \"Slacker\"", "ReviewID": "RK34JYXRX8ZHC", "Overall": "3.0", "Content": "First the good points.  This is a great camera for quick outdoor shots.  The 10x zoom and sport mode allow rapid shooting.  Even inside close-up pics come out well without the flash if the target isn't moving too fast.  The swivel lens feature has allowed me to get several close-up shots of my kids without them knowing they were being photographed.  The zoom has allowed me to do the same thing from across the yard.The time delay feature, shoot every 30 seconds, was great Christmas morning. I set the camera on a tripod and then joined my family.  100 photos were taken by the time I turned off the camera.Last, but not least, the swivel lens makes the camera easy to put in a pocket.Now the bad news.  The video ability is below that of my Canon A75 from several years ago.  Still, it's good enough for most family videos.", "Date": "January 3, 2007"}, {"Title": "Good digicam, but not for a Pro", "Author": "D. Jaisingh \"Deepak Jaisingh\"", "ReviewID": "R1C2JXBYXIXXJF", "Overall": "4.0", "Content": "I bought this camera 6 months back and I am very happy with it. In daylight the image quality is unbeatable. I was very impressed with daylight photos and that too without flash. In Nightshot it is OK and most of the times the image comes blury, even after keeping the camera stable. To get the best picture one has to play around the PointNShoot and Scene Modes and decide what suits them best.In Movie mode movies come out fine, after all it is not a Camcoder.4 stars to this one. I love it.", "Date": "November 14, 2006"}, {"Title": "Nice camere, tiny with 10x zoom", "Author": "Vince \"orbhot\"", "ReviewID": "R15UY6TR51QIYO", "Overall": "4.0", "Content": "I bought this camera for 1 reason: It is the smallest 10x zoom camera currently on the market. It has some decent features and produces good, but certainly not professional quality images. I have found a couple of problems though: Occasionally, with the flash in red-eye reduction mode, the camera's automatic in-camera red-eye repair feature turns other red colored things grey, such as people's lips. This is a pretty annoying problem and the only way to solve it is to not use the red-eye reduction flash mode. I have contacted Nikon and there is currently no solution to the problem. I also found the camera to have quite a high amount of purple fringing/chromatic aberration in high contrast areas, especially when at full zoom. It also has trouble focusing in low light, even with the focus assist lamp. Other than those problems, it is a good compact point-and-shoot camera.", "Date": "January 9, 2006"}, {"Title": "This camera will make you a real photographer.", "Author": "R. Davis \"A Professional Photographer\"", "ReviewID": "R149Z6YX5CK63P", "Overall": "5.0", "Content": "A Fantastic Camera! What a joy to compose and setup a photograph with both eyes open looking at a large bright 2.5 inch monitor. You can see the whole image at a comfortable viewing distance and get the design elements just right. With the sharp 10x zoom, and the Swivel Lens its like a pocket size view camera.Nothing can compare with it in film or digital cameras. With the zoom lens I can crop to the subject, and the swivel lens lets me get the perfect angle that I want. Focus up to 2\" from that hamburger and make it look great. The built-in \"D\" software increase your latitude and fills in dark shadows that gives your photos a real pro quality.With some flood lights I earn a good living with this camera using it for commercial and product photography.I make Menus for Restaurants with this camera and you can see some of the photos at promenus-dot-com.I ordered a 256 memory card, and a Pop-Up Shade Stick-On for 2.5\" LCD Screens from Buy-dot-com.If your serious about your photography this is a must have camera, it can take photos that will make you a real photographer.", "Date": "December 18, 2005"}, {"Title": "Nikon, Detroit and Dinosaurs", "Author": "Cecil Fox", "ReviewID": "R1NNDG9QMWVAE5", "Overall": "2.0", "Content": "Nikon is like the almost defunct Detroit auto industry. They don't give you what you want but rather what they want you to have. Their marketeers have taken the Coolpix 900 series and removed most of the desirable features and added what they think is appropriate for dummies. Gone is the view finder. No place to put an accessory finder a la Leica viewer. Instead, you have the option of trying to guess at the picture, not an easy task for the near sighted in bright light. THEY will tell you by an ikon when your picture is in THEIR idea of focus. There doesn't seem to be a manual setting, but instead you are presented with a baffling display of what Nikon thinks will improve your pictures to Nikon's (not your) satisfaction called the \"Scene Mode\". In other words you have abdicated any and all control of the pictures. The battery situation is back to rechargable AAs.  In addition, Nikon was having trouble with people using Coolpix for other things, like microscopes. Well no more, the accessory threads no longer exist so you are out of luck. The flash options are ridiculous and it is impossible to use an accessory flash. Clearly this was an interrim solution for the Nikon Nazis who want to force you into their high end like the D200. I could find only two reasons to own this camera, the bump in the chip to a putative 6 megs and the tiltable lens. Its impending demise is certain, and the price is already dropping.", "Date": "March 1, 2006"}, {"Title": "not worth the price", "Author": "Sam", "ReviewID": "R7FLUHF0V5U1N", "Overall": "2.0", "Content": "i was really excited about this camera.  i dabble in photography, but wanted a camera i'd have a little more control over, and would be able to experiment with while taking professional quality shots.  this little guy, however, just doesn't cut it.  the flash tends to wash everything out, and you have to use it even when there's adequate lighting.  also not great for action shots.  i've yet to be 100% happy with a shot i've taken with this camera without using some sort of photo editing software.  i work mainly in b&w;, and the colors are never as crisp as i'd like.  if had it to do over again, i'd go with something else.", "Date": "December 12, 2007"}, {"Title": "I hate this camera", "Author": "L. Burrell \"Ohio Mother of 3\"", "ReviewID": "R23LAU2OPBA5JG", "Overall": "1.0", "Content": "Peace of crap.  I am so mad I spent so much money on this camera.  Pictures are blurry no matter what setting it's on.  When in poorly lit places (at night, school plays) the pictures turn out so dark you can't even see them. It's not easy to change setting. I have not one nice thing to say about this camera.  I have had it for 2 years and I hate it.  I am very happy that I dropped it and the lens broke! This gives my husband reason to buy a new one!!", "Date": "July 16, 2009"}, {"Title": "Awful Camera Awful Service", "Author": "Sean G", "ReviewID": "R1EMKC6OB1VCHO", "Overall": "1.0", "Content": "I purchased this camera less than two years ago for nearly $350. It recently would blur when trying to focus. I'd manually focus the camera, but the autofocus would override it and blur the picture. The camera tries to be too user friendly, and you can't configure any photo settings manually.The camera would not focus anymore, I sent it away to Nikon to get it repaired, and they wanted $115 to repair the camera.So I paid almost $200 a year to have a sub-par crappy camera with bad software.Don't make the same mistake I did. Never buy a Nikon. Ever.", "Date": "January 23, 2008"}, {"Title": "Works great", "Author": "Eric", "ReviewID": "RRKBT6AOJRWM4", "Overall": "4.0", "Content": "The swivel camera works great. The video recording part of the camera is not very clear, but picture taking is fine. All in all, I am satisfied with this product and its price.", "Date": "August 12, 2006"}, {"Title": "Don't Do It", "Author": "AZReader", "ReviewID": "RFQUCZQLPROJ5", "Overall": "1.0", "Content": "I am very unhappy with this camera. I had an Agfa with a swivel lens and when the pixels started missing after 7 or 8 years, I decided to replace it. I searched for another swivel lens and found this one. The images I take with it are almost always burry, no matter which setting I use. I had to return it to Nikon for repair when it stopped functioning (the shutter problem another reviewer described), fortunately (or unfortunately) it was within the year warranty. It is very much a disappointment and for the price, I feel cheated. I wish I could give less than 1 star. Anybody up for a class action lawsuit?", "Date": "October 22, 2008"}, {"Title": "Avoid like the plague, good when working , broke after 2 holidays", "Author": "Matt", "ReviewID": "R6F2KB588K008", "Overall": "1.0", "Content": "At first i really liked this camera, it took some really good outdoor pictures on my holiday this year and last, However after very little use and no damage/drops etc. it no longer works.The camera has a design flaw in which the internal shutter fails to open and therefore photos cant be taken (well a black screen comes out, but that is all) everything else about this camera was ace.Looking on the internet for a fix, it would appear this is a massive flaw and nikon are failing to recognise the problem. 1000's of broken camera's all with the same problem, some only a few weeks old, some have been repaired for the fault to return a few days later.Do not buy this camera, it is a problem waiting to happen. I personally will not buy another nikon product as my holiday was spoilt due to this.", "Date": "June 30, 2008"}, {"Title": "the item was used", "Author": "Alfredo Zamudio", "ReviewID": "R2SA5R41BDACGW", "Overall": "3.0", "Content": "The item was used, did n't work, scratched, but the money back was as smooth as could be", "Date": "January 9, 2007"}, {"Title": "Nikon Coolpix S4 6MP Outstanding", "Author": "Suzanne Seely", "ReviewID": "R3RD4ZLYLK3SS3", "Overall": "5.0", "Content": "I am amazed at all the things this camera can do.  It has complex operation and is small and easy to handle.  This is more of a professional camera. Adjusts for lighting automatically or manually, has 2 different zoom settings, one will go 40 times.  Lots to learn on this camera and there are schools to teach photography with this camera.  It is a cool pix!", "Date": "March 19, 2006"}, {"Title": "bulky camera in the age of mini digi cams", "Author": "Arjun Singh \"trojanking\"", "ReviewID": "R1VPST20PQ0BZZ", "Overall": "4.0", "Content": "Well,it is decent,prints are excellent but the only problem is it's size.It is reeeeaaaall bulky.Other than that i really dont think the swivel lense is an asset-it's just a gimmick to lure customers into buying a differentiated product in an imperfectly competitive market.", "Date": "July 8, 2006"}, {"Title": "good one....but not best", "Author": "shri reviews \"shri\"", "ReviewID": "R1Z07NC4KHNABI", "Overall": "3.0", "Content": "Camera is pretty good and jazzy.I like the flip-flop lens but sometime it is pain.Also picture quality is not great.", "Date": "January 31, 2006"}, {"Title": "Great deal", "Author": "Sreepathi Ananth", "ReviewID": "R1PA6ACSPLPVCM", "Overall": "4.0", "Content": "This was a great deal.the items reached me in good shape and there wer no problems in the delivery and payment method", "Date": "August 9, 2006"}, {"Title": "Nikon Coolpix s4 - Lenta y lente", "Author": "Bruno Alberto Mejia Cifuentes", "ReviewID": "RIBPE4DXMBK7W", "Overall": "3.0", "Content": "El lente se convierte en alguna desventaja cuando de brillos externos se trata, sigue haciendo alguna falta el visor de siempre. En cuanto a la velocidad de obturacion me parece que deberia ser mas rapida", "Date": "March 21, 2006"}], "ProductInfo": {"Price": "$595.00", "Features": "6.0-megapixel CCD captures enough detail for photo-quality 14 x 19-inch prints\n10x optical zoom; 2.5-inch LCD display\nFace Priority Autofocus and In-Camera Red-Eye Fix, plus On-Screen Help menu and D-Lighting\n16 scene modes; macro setting focuses as close as 2.5 inches from subject\nPowered by 2 AA-size batteries; stores images on SD cards", "Name": "Nikon Coolpix S4 6MP Digital Camera with 10x Optical Zoom", "ImgURL": "http://ecx.images-amazon.com/images/I/41G7AQNWXEL._SX300_.jpg", "ProductID": "B000AXMEDI"}}