{"Reviews": [{"Title": "VERY pleasing pictures, if given enough light", "Author": "David Arnstein", "ReviewID": "R2LRIKFZIMGWPN", "Overall": "5.0", "Content": "I have used a few other digital cameras, and so I will compareperformance when I can.Specific Observations---------------------I programmed the camera to use its lowest ISO setting (50), spotmetering, spot auto-focus, largest image file size, and highest imagecompression quality.  The rest of this post assumes these settings.1.  The camera is quite fast, faster than my old Canon SD10.  Both  shutter button response time, and shot-to-shot delay have been  improved significantly.  Nice going Canon!2.  With \"spot\" autofocus selected, the camera seems to do very well.  With my old SD10, I would regularly obtain photos that were  grossly out of focus. It does not seem to happen with the new  SD30.  Thank you Canon!3.  The \"deluxe\" kit features a very nice soft case. It fits perfectly  and looks good. I consider this to be a \"must\" for a tiny,  carry-it-everywhere gadget. All of the stores I checked stocked  the \"deluxe\" kit, perhaps there is no other kit for sale. But I  suggest that you confirm that you are getting the Canon SD30 soft  case with your purchase.4.  The flash intensity cannot be adjusted, as far as I can tell. It  is therefore difficult to photograph certain shiny objects, such as  circuit boards and small machinery.  This is giving me fits.  The  available flash power is not much either. This is no shame for Canon  really, since the size of the tube must be small in a midget camera  like this. By comparison, the Casio Exilim EX-S500 can produce  significantly more light.5.  After some practice, I am very pleased with the image quality that  I am getting from this camera, at least when there is adequate  lighting. The SD30 produces what I have come to regard as the \"Canon  look.\" I'm not sure if the photos are especially true to life, but  they are extremely pleasing. I see highly saturated colors, sharp  focus, low noise, and pleasant \"warm\" skin tones. I also detect this  \"Canon Look\" in photos coming out of the Sony Cybershot DSCP200. I  suspect that Sony and Canon use the same image sensors.  I compared  photos of the same objects taken with the Canon SD10 and a Casio  Exilim EX-S500. The pictures coming out of the Casio are fuzzy by  comparison.  The side-by-side comparison also makes the Casio pictures  look a bit washed out.  The Casio pictures have much more chroma  noise too.6.  The macro capability is excellent.  The camera has a feature which  puzzled me at first. Now I understand that it is pure genius: the  best macro performance occurs when the lens is zoomed to its maximum  (2.4x). With the zoom at maximum tele, I can reliably fill the image  frame with an object that is 5 cm across (left to right) or smaller.  Where does the genius come in? Most other cameras are engineered so  that the most extreme macro performance is achieved when the lens  is at its full wide angle setting. If the SD30 was designed this  way, then the camera would have to be positioned very close to its  subject matter. When this occurs, shadows from the camera and the  photographer's hands would interfere with the photogaraph. The  performance of the flash unit would also suffer. Good job Canon! I  have taken some really amazing macro shots of ears, for example. It  sounds disgusting, but I was able to discern incredible detail in  the subject matter and learn how to use the camera's macro mode.  It was almost like working with a microscope.  My macro photos  were all \"hand held,\" no tripod used. Nevertheless, most of them  turned out well. Many looked \"razor sharp.\"7.  The camera feels solidly durable. The various buttons and other  controls are especially firm. I also like the Casio Exilim EX-S500  in this regard, but the Canon controls are more solid, with no  side-to-side play.8.  The SD30 is not as amazingly small as the old SD10.  I would not  want to carry it in the breast pocket of a man's dress shirt, for  example.9.  You must use the (included) cradle to charge the camera's battery.  Although the cradle is reasonably small, it still sucks for  travelling light. There is probably an accessory you can purchase  that travels better than the cradle and power cable that is  included in the \"deluxe\" kit. I haven't shopped for such  accessories yet.10. The camera retains a feature of the SD10 that I absolutely HATE:  it resets its metering mode to \"evaluative\" after every power cycle.  Like all other digital cameras, the only metering mode that works  worth a damn is \"spot.\" At power-up, it takes me 8 button pushes to  get the camera to \"spot\" meter. The main value of a tiny camera is  that you can carry it everywhere, and capture unplanned events.  Those 8 extra button pushes really detract from the value of this  type of machine.  (Sorry for venting).11. When connected to a computer, the camera will NOT emulate a disk  drive, the way many other cameras do. It is still an easy matter  to transfer pictures to the PC, but I prefer the increased  flexibility of disk drive emulation.12. The quality of the motion video in the SD30 is pretty bad. There  is a 320x240/20fps mode and a 640x480x15fps mode. The 320x mode  has bad spatial resolution. I don't like looking at the \"movies\"  produced in this mode. The 640x mode looks jerky, because of its  15fps rate. By comparison, the Casio Exilim EX-S500 does a bit  better.Conclusion----------The Canon SD30 is one of the smallest digital cameras available today.This type of camera, by its nature, must have compromises. I find itinteresting to compare the different approaches to design evident inthe Canon SD30 and the Casio Exilim EX-S500. I believe that these twoare the best of the tiny cameras, though in different ways.Both cameras are fast (shutter lag and shot-to-shot delay). Both arehandsome and appear to be constructed nicely.  Both cameras use SD cardsfor storage, which I prefer. This card format is physicallly small, andit is not controlled by a single vendor, like Sony and its Memory Sticks.Canon offers excellent image quality. Like the old Canon SD10, thephotographs have a certain \"Canon look\" that is very appealing. I suspectthat this \"look\" is the result of high color saturation, sharp contrast,and low noise.  White balance is nicely done too.The user interface of the Canon is spare. There are not a lot of featuresfor the user to play with. The simplicity will be a godsend for someusers. Personally, I would have preferred to have more control.I believe that it is useful to compare the Canon SD30 to the Casio ExilimEX-S500. The Casio offers a TON of features! It has more \"scene\" modes.It can function as a sound (only) recorder. It can photograph documentsand force them to look rectangular (remove keystone effect). Best ofall, the Casio can be programmed to remember some of its settings, andreset others, when it is powered off. The customer gets to choose whichsettings are remembered.  Too bad about the chroma noise and soft focusthough.Before I obtained the Canon, I already had an EX-S500. I had planned tokeep one of these cameras and give away the other.  But frankly, I don'tlike the thought of parting with either of them.  Comparing these twocameras has made me appreciate both of them.  A few monthes ago, I wrotea review of the EX-S500 that was fairly negative, due to image qualityissues.  Oddly enough, I respect Casio more now. This, in spite of thefact that the Canon SD30 does produce superior photographs, as I expected.Both cameras are engineering marvels! The Canon produces beautifulphotographs and stunning macro images. The Casio is a \"Swiss Army Knife\"of useful features that can be customized to match the tastes of theowner. Also, the Casio has a superior shape for carrying everywhere.Looking Forward---------------In the next few monthes, at least two new cameras will appear that arein the same size class as the Canon SD30.Sony will soon deliver its Cybershot T9. The reviews that I have seenindicate that the previous \"T\" cameras had pretty bad image quality.This includes the T7, which is probably the tiniest camera available.The T9 will be somewhat larger. Perhaps Sony will do a better job withit.Casio will replace the 5 megapixel Exilim EX-S500 with a 6 megapixelEX-S600.  The feature set won't change much, but it is already superb,as I have claimed above. Perhaps the new camera will offer better imagequality? Increasing the pixel count is not likely to solve any noiseproblems.  But until the camera is delivered, who knows?In my opinion, it is reasonable to buy now, rather than wait for thesenew cameras to arrive. Both the Canon SD30 and the Casio Exilim EX-S500are great.", "Date": "November 23, 2005"}, {"Title": "Excellent upgrade to an older Elph", "Author": "C. Hatfield \"SoccerMom\"", "ReviewID": "R27DC2BCZXRY8N", "Overall": "5.0", "Content": "I received this camera as a gift to replace my older s200 Elph. My camera is the Vivacious Violet, which in spite of Amazons statement, is actually available for sale almost everwhere but here. (10/26/05)The SD30 has been my constant companion for over a week now. I have used it to take all the shots the s200 could handle, and have tested it with all the shots the s200 just couldn't quite get. The SD30 has exceeded the performance of the s200 on ALL counts. Indoor shots no longer have that yellowish tint. The flash no longer over brightens the picture. I can take pictures of my quick moving 9 month old and no longer get crystal clear backgrounds and a blurred child. These are all made possible with the preset picture settings, something my s200 was lacking. I have not had to alter or correct even one image taken with this camera, beyond cropping or cutting.This is a true point and shoot camera.Positives- Remembers your last settings so you don't have to reset for the same conditions if the camera shuts itself off.- Takes SD or MMCard memory. I have the 1gig card in and at the highest settings it will store up to 370 pictures. Lowest settings 2000+. My peferred settings, 700+- Has cables to allow you to browse the pictures stored in your camera, on the television with the remote control via the docking station. You can delete with the remote control as well.- Controls seem more intuitive than the older ELPH's, but this is a personal preference.Negatives- You must use the docking station (which must be plugged in) or a memory card reader to transfer pictures to your computer. The cord is about 3 feet to short for me to reach my computer from my chosen docking station location. I would have preferred an optional non-power required method of transfer. If you keep the docking station within 4 feet of your USB connector, you should have no problem.Extras- I truly enjoy the sound schemes. My 9 month old loves that my camera barks when I take a picture, and the older boys find it amusing as well.- My camera was the deluxe edition and came with a matching leather case.- This camera is SMALL. It's about the size of 2 packs of Trident held together.If you are a parent that needs a reliable and good looking camera to take to soccer games and just to document your children's lives without needing to carry a manual around to ensure quality photo's, this is the camera for you.", "Date": "October 26, 2005"}, {"Title": "One of the best compact digitals out there today", "Author": "Al", "ReviewID": "R2L1C3WYHB1LLO", "Overall": "5.0", "Content": "Many reviewers have noted the quality of the pictures obtained with the SD-30, and I fully concur.  This is a fast, quiet, and well designed digital camera.  For someone with little previous experience in digital photography, I was able to get up and running with just a scan of the quick start guide.  A high speed SD card like the Sandisk Ultra II is highly recommended- a quicker write speed improved the quality of my video captures.My first outing to the ski slopes captured great pictures, even with fast moving targets.  I tried to tinker with the various shooting modes, but still ended up on AUTO.  Until I muster up enough interest to experiment with all the settings, I would recommend the AUTO setting to all beginners.  My second session was indoors, and while the pictures came out clear, I found the flash inadequate beyond 10 feet.I disagree with a previous reviewer about uploading to the PC.  Once the software installed, I did not have to plug in the Dock's power adapter to upload my pictures.  Just turned on the camera while it was in the Dock, with the switch in review position, and the software automatically launched.The carrying case is very well designed as its edges are wider than the center.  This means if you drop the camera case, the sides cushion the impact rather than the corner that lands first.  I found that I preferred the built in belt loop rather than belt clip that comes with other camera cases.  There's zero danger of the case sliding off your belt.Highly recommended.  If you hunger for more technical details, check out the SD30 review at dcresource dotcom", "Date": "November 27, 2005"}, {"Title": "Fundoo Camera", "Author": "N. Shrivastava \"Camera Expert\"", "ReviewID": "R8HUL69GZZG1A", "Overall": "5.0", "Content": "I've already been the happy owner of a sd40 \"big\" camera for over a year, and still consider it perfect for my serious photographic needs.However, precisely _because_ it is so big, it can be very inconvenient to bring along, and also very intimidating to potential picture subjects. I didn't realize just how _much_ smaller, or more precisely, how much thinner it is than all other digital cameras until I saw it in person. It not only fits in a shirt pocket, it fits in a shirt pocket _along_with_ a Treo or an iPod. Because its 3x zoom lens is folded, it does not protrude at all when taking pictures, meaning most subjects won't even realize a camera is pointed at them, let alone that it is zoomed in and high resolution. This greatly easy getting natural expressions in informal photos.Next, the specifications of the sd series is better than those of other similar Sony cameras such as the T1 and T33 in ways I care about, such as doubling the number of pixels in the 2.5\" LCD screen, including an auto-focus assist lamp, and USB 2.0 support without needing driver software when used with Windows XP.One of my pet peeves about digital cameras is that they are not protected from the elements. it helps this in two ways. First, its on/off switch is a solid lens cover. Second, the camera fits easily in the smallest size zip-loc sandwich bag, and can easily be operated while in the bag, providing serious dust and splash protection.One further protection is needed, but easily handled. The LCD needs protection, which I provided by covering it with a sheet of screen protector plastic left over from an old PDA.As you might expect from such a thin device, battery life is somewhat limited (about an hour of continuous use, set up for maximum brightness, continuous focus adjustment, and automatic flash. For that reason, I bought a spare battery, and since the charger is bigger than the camera, suggest other buyers do the same.I bought this for my point and shoot wife to take on a week-long trip, and thereafter to have it with us whenever a shot might present itself, but not surely enough to carry the large camera, or in situations where keeping the large camera clean and dry might be an issue.If you too are a serious hobbyist, do be aware of unavoidable limitations: 1) 5MP is good, but not as good as the 7MP of a few also (barely) pocketable cameras. I decided smaller size outweighed higher resolution, but you may feel differently. 2) F4 is 2 full stops dimmer than the F2 of my other camera, which matters quite a bit when the light is low, as does 3) the ASA maximum of 400, rather than 800. There's also 4) no place to attach a filter. For a second camera, these are all perfectly acceptable compromises, in my opinion.Highly recommended as a second camera for hobbyists, or as a first camera for folks who want a very convenient and very high quality point and shoot camera.", "Date": "February 3, 2006"}, {"Title": "Sleek, but has limitations", "Author": "E. Jou \"Cornell worshipper\"", "ReviewID": "R2L3B409WPBBV4", "Overall": "4.0", "Content": "Admittedly, this is one cool camera and everytime I use it, I get tons of \"ooooohhhh's\" and \"aaaaahhhhh's\".  People are continually amazed by how small and sleek this camera is and the compact size has made it convenient to carry around with me in my purse everyday and everywhere I go.  Like a previous reviewer, however, I have found that the auto-focus sometimes is lacking and I have to retake the same picture several times to get a focused picture, in ideal lighting situations and with a perfectly still subject!  Additionally, the flash covers a fairly limited distance and, if there is not enough lighting, even in night mode, the picture will come out dark.  Of course, these are all primarily due to the fact that a lot of the features of the camera are compromised due to the size.  All complaints aside, this camera is easy to use and is perfect for point and shoot and casual picture-taking.  In fact, this is the only camera that my little dog is not afraid of when I'm taking pictures of him, I think due to the unintimidating size and quiet operation.  Hope this helps!", "Date": "March 24, 2006"}, {"Title": "Poor auto-focus", "Author": "Boatssummer", "ReviewID": "R2P6T415GAKZ9M", "Overall": "3.0", "Content": "The camera size, style, and docking station are excellent. However, the auto-focus is very poor. I have used this camera for two months and almost 30% of the pictures that I have taken are out-of-focus. I finally got to the point of taking at least 3 to 5 pictures of the same subject hoping to end up with one good quality image. It seems to me that the compact size has sacrified the camera's focusing system. In addition, the built in flash is very weak.", "Date": "March 14, 2006"}, {"Title": "I love this camera!!", "Author": "Victoria Pharis", "ReviewID": "R275H7LAUDGYQG", "Overall": "5.0", "Content": "I bought this camera to replace an older Canon that my husband dropped while in Afghanistan.  The thing I hated most about our old camera was it's battery life (it took AA's).  So to be honest, when I was first looking for a camera, I wanted something budget-friendly, with long battery life, and a sturdy shell that my husband's giant hands couldn't break.  I was also hoping to get something over 5MP.I looked at the Panasonic Lumix, the Kodak Easyshare, Canon SD450... But just looking at their 2.0\"+ LCD screens, I could see my husband (or myself, for that matter) cracking the screen.  Both the LCD's on the Lumix and the SD450 stick out from the camera, it seems it would be easy to chip them.  (Which I found true when I read their reviews.)Anyway, after going back and forth to the store and looking at a dozen review sites online, testing out this camera, and a few others, I decided to buy it.  I bought it online from a company other than Amazon, with a SD card, and an extra battery, and I only spent $293.After using this camera for a few weeks, I'm still in love!  The battery hasn't even flashed low, yet, and I'm constantly looking through the pictures.  I have small hands, so the ELPH fits just perfect.  My husband's hands can work it, too, though.  I get compliments everywhere, people asking where I got it.  Right now I have the camera set to make the smallest filesizes for snapshots, but I couldn't believe the detail of my first pictures (set at the highest resolution).  I haven't missed a shot yet.  I love that it's small, the automatic settings are easy to set, the loading time in the beginning and after the shutter release is pressed is incredibly fast.  And of course, it's size is a definite plus... I would never carry my regular Nikon around by the neckstrap, just too bulky, too heavy.  The case that came with this camera is sturdy enough that I feel comfortable tossing this little camera into my purse, now I always have it with me.I have nothing but good things to say about this camera!", "Date": "July 10, 2006"}, {"Title": "I love my Canon SD30", "Author": "D. Vo", "ReviewID": "R38TA3JK3RXFC3", "Overall": "5.0", "Content": "I bought and got this camera from Amazon, about 2-3weeks now. And I have to admit it I LOVE my Canon. Its light and not too small and not too huge. Everyone has been complimenting on what a beautiful camera it is. It comes with a nice leather case that even my friends have envied. They all say 'wow' its like the size of my phone. I use a 512 MB SD card, and i take so many pictures. This is a great camera for someone's first digital camera. I dont consider to be a professional camera, this is more for family and friends taking pictures camera. So yea i love it. Canon you rock.", "Date": "March 6, 2006"}, {"Title": "GREAT CAMERA FOR LOW PRICE", "Author": "Francisco Sanchez J. B \"FRANCISCO\"", "ReviewID": "R1EC9P85AVGT5P", "Overall": "5.0", "Content": "This is the best camera I have ever had, it has an excelent digital and optical zoom wich the old sd20 did not have, its the biggest improvement, also its very small, you can have it in your shirt packet, (just dont lose it) fast downloading pictures to the cpu same with videos, it looks very stylish and has different types of options.if you are thinking in getting a 400 dls camera, this is your best option.cheers", "Date": "October 5, 2005"}, {"Title": "Amazing camera", "Author": "Tigerlily \"mote8\"", "ReviewID": "RACRJ2HQJ6KDT", "Overall": "5.0", "Content": "All I have to say is this is a great digital camera, and I've had a few of them.  I just took it on vacation to AZ with me - my first use of the camera and I came home with fantastic images and videos.  I had no problems with the camera at all, and never even had to charge the battery or go to the extra, charged battery I brought along with me.  I purchased the little battery charger so that I wouldn't have to take along the camera cradle and I advise anyone to buy it.  It's very tiny and works great.  You cannot go wrong with this camera.  It's great at auto so you can just point-and-shoot and enjoy, or very manual if you feel like futzing with it.  Also, it's just a very cool looking camera and very sturdy.  Even though it's so tiny, I didn't feel like I was going to break it, bull-in-a-china-shop that I am.  It was a bit odd getting used to having no veiw-finder to look through, and keep putting the camera up to my eye a few times!", "Date": "September 1, 2006"}, {"Title": "Canon Accessory Support", "Author": "Jeffrey H. Schroeder \"Jeff\"", "ReviewID": "R3RU0M6M18TKNG", "Overall": "1.0", "Content": "Camera itself is okay but be very careful buying this camera as the power cord adaptor for this product is discontinued and no longer supported by CANON.", "Date": "March 5, 2009"}, {"Title": "Stunning Little Package!", "Author": "Dorey E. Evans", "ReviewID": "R3FJOC89UDMVZG", "Overall": "5.0", "Content": "The Elph is my fifth digital - finally a camera that fits in my pocket and takes great shots like my Canon G2 and G6.  Canon has created a lovely little package that has all the bells and whistles you will need.  Definite five stars.", "Date": "February 21, 2006"}, {"Title": "Canon PowerShot SD30 - The Little Can-Do Camera", "Author": "J Ilacqua", "ReviewID": "R1JJ1RNSTTU3BU", "Overall": "5.0", "Content": "I purchased a new one of these to replace the one that I got as a gift in 2004, which just finally wore out. The first one made such excellent quality photos and videos that I decided to buy another one. Plus, I already had all the accessories for the first camera and would have to buy all new ones if I got a different camera. But, the main reason for buying another Canon PowerShot SD30 was the ease of use and beautifully clear, crisp, vibrant color pictures it made. It also held up well with a lost of hard use. I have friends who have much more expensive cameras who said that my PowerShot SD30 made much better quality pictures than their cameras. I use a lot of my pictures in creating custom PowerPoint presentations and graphic displays, and the quality of photos I get with this little workhorse camera really helps me create some amazingly vibrant, first class quality projects.", "Date": "October 6, 2011"}, {"Title": "CANON Powershot SD30", "Author": "A. Arrua", "ReviewID": "R20EEFN3UE1E0D", "Overall": "5.0", "Content": "This camera works great for me, it takes great pictures! The design is excellent, the camera is very light weight and small so you can carry it with you everywhere.", "Date": "May 12, 2007"}, {"Title": "Great GIRL POWER camera!  ..... at least the purple one.", "Author": null, "ReviewID": "R2FPJ3HJ64FGS", "Overall": "5.0", "Content": "I was 13 decades ago - just didn't want to use my name.I bought this camera for my daughter last Christmas. She loves it! And I can understand why. It takes amazing, beautiful shots, especially outdoors. She works as a camp counselor and took this camera to work with her every day this past summer. It held up admirably through sticky fingerprints, rough handling, and 4 to 6 year old photographers.The movies are gorgeous and better quality than my camcorder.You have to accept a small limitation when you buy a little camera (any brand) like this; indoor or low light pictures are quite iffy.  If careful attention is paid to the camera settings, good results can be achieved, but will not compare with the gorgeous color and detail of outdoor pictures.", "Date": "September 12, 2006"}, {"Title": "Decent, Overpriced Camera, AWFUL Software", "Author": "Cap'n Stoob \"Stoob\"", "ReviewID": "RIZ4MHSTV7O99", "Overall": "2.0", "Content": "I got this camera for a good price and it came with a free case so I thought I got a good deal until I tried to install the software.  After crashing my up-to-date, always backed-up, clean installed Win XP machine several times, it managed to get through what seemed like 10 minutes of installing about 9 different programs and drivers.  It suggested a restart and I complied.  When the computer came back on, it had corrupted ALL of my USB drivers so my mouse, USB keyboard, external hard drive and Bluetooth adapter could not function!  It also managed to remap my laptop keyboard so that all I could type was gibberish.  It took about an hour of fiddling with the touchpad until I did a system restore and uninstalled and reinstalled all USB drivers.THANKS FOR THE CRAPWARE, CANON.  MAYBE NEXT TIME YOU CAN PRE-FORMAT MY HARD DRIVE FOR ME?The camera itself is great.  It's small, takes nice photos and has an elegant form factor and the MyColor feature is nice.  However, it can ONLY be charged through the dock (it has an AC adapter for this) and I can't get the USB dock to communicate with my computer.  Another big negative is the choppiness of the movie modes.  The max resolution 640x480 movies are only 10fps!  The MyColor mode is 20fps at 320x240...that isn't good for anything.  Compare this to Sony cameras, most of which can take 640x480 movies with sound at 24 or 30fps and this video can be edited in a program like Ulead and then burned to DVD and seen perfectly on a TV screen.There are MUCH cheaper cameras out there than this.  You're basically paying a premium for style.  The camera IS nice, but I was expecting more from the software than corrupting drivers and forcing me to spend time to fix problems it made.  I'm returning this for something else.", "Date": "December 29, 2006"}, {"Title": "A long-time friend", "Author": "Alicia L. De Tina", "ReviewID": "R1RZ9610AISVZ6", "Overall": "3.0", "Content": "I have had the PowerShot SD30 for over 3 years now and it has served me well. It is still up and running with a few minor problems. Sometimes the shutter won't completely open or close. I just give it a nudge and it goes into place, but it is still inconvenient. The buttons on the back are sticking and it's difficult to scan through pictures without accidentally pressing another button (and I have tiny fingers). But after three long years of being dragged around everywhere in my purse, this little guy has stood up very well.The picture quality isn't as great as I wish it could have been. Indoor pictures in dim lighting are terrible, and sometimes you have to hold down the button for a very long time before the flash will even go off. When you want to catch something in the moment, you probably won't, and it's pretty hard to hold a not-so-fake smile for that amount of time.This camera is durable and lasting in structure, but not so much in picture quality.", "Date": "February 9, 2009"}, {"Title": "Great camera; none like it today", "Author": "DSE", "ReviewID": "RXF6DMM66BEQ5", "Overall": "5.0", "Content": "I got this camera 3 years ago as a surprise for my wife, and she has loved it.  It is very small so she can always take it with her in her purse.  It has come in handy in the many situations in life where you want to take a photo and you thankfully have this camera handy.  Today, I suppose people use their cell phones these purposes, but as you know, the image quality on cell phone cameras is horrendous.  My wife can take a real photo and circulate to her family and friends who want something worth keeping.  After 3 years of use the LCD flickers, and it will need to be repaired. I first checked to see if Canon makes anything as small, and they don't, so we will spend the money to keepo using this camera.  It is not a prosumer or DSLR replacement, but it is a camera we can and do take everywhere, and so it has captured some great shots we'd have otherwise missed.", "Date": "December 22, 2008"}, {"Title": "Canon Powershot SD30--Not that great", "Author": "K. Williams \"geek at heart\"", "ReviewID": "R2H892SKN0UJVX", "Overall": "3.0", "Content": "I have to say I was not impressed that much with this camera. For one, night shots are horrible. there is so much grain, with no flash, with flash, with lots of light, it just doesn't seem to matter.Also it has a warped lens. It seems on the edges of pictures it warps. Like if you take a picture of a building, the edges with be wavy. It's a little quirky.It does take great day pictures though. It has great color with pictures with sunlight and it's super compact. But as a whole I would look for another canon product for my next digital camera.", "Date": "February 23, 2008"}, {"Title": "digital camera", "Author": "Mississippi Boy", "ReviewID": "R1H99WFUMDFNA3", "Overall": "4.0", "Content": "Works fine, appreciate the small size. A plethora of shooting options can make it seem too complex, but you can set it up where it just becomes a point and shoot camera. I purchased this for my wife for Christmas so that she could have a small item that fits in her purse without taking up a lot of room. I fills the bill.", "Date": "February 8, 2008"}, {"Title": "The BEST camera ever", "Author": "Diana M. De Rios", "ReviewID": "RCF4XJHY3XQ22", "Overall": "5.0", "Content": "Works so well, takes great pictures. So glad to have gotten it for a GREAT price!", "Date": "January 27, 2008"}, {"Title": "Excellent...too much...", "Author": "Edwin Medina Taveras \"quinsito\"", "ReviewID": "R1NMV0LGA4N6Z9", "Overall": "5.0", "Content": "I don't have words for this item...it's very very...I'm taking the best pictures that i never imagine", "Date": "March 12, 2007"}, {"Title": "Perfect little camera for traveling light", "Author": "Emm Pea \"Maggi\"", "ReviewID": "R35Y4CTCAE6ESU", "Overall": "5.0", "Content": "I just upgraded my old Canon Powershot S45 with this little beauty. It's small size makes it ideal for travel. I recently went on vacation to Belgium and it was raining the entire time. This little camera is so compact, I just wrapped the wrist strap around my wrist good and tight and tucked the camera up the sleeve of my raincoat. It was right in reach whenever I needed it and it stayed safe and dry.I felt bad for my friend who was lugging around her DSLR. She would have to get someone to hold all her stuff, because her camera required two hands to operate and she had to keep it in the camera bag to keep it dry. She didn't get many pictures because she didn't want to go through the hassle.After the trip, we compared pictures and the SD30 shots were just as good as her $1K camera's shots.The camera has several shooting modes, such as indoors, under water, fireworks, night-time portrait, landscape, portrait, kids and pets, beach, snow and manual. You can also choose to enhance one particular color over all others, say green in a forest or red in a garden or you can simply choose 'vivid' mode and all your colors will pop. There is also sepia, black and white, muted color and normal.There is a skin tone adjustment, white balance adjustment, self timer, and many, many more bells and whistles.The one drawback I found was that the little flash doesn't go very far, so it might be a good idea to purchase the external flash for this camera.", "Date": "December 18, 2006"}, {"Title": "Good Camera -- But Be Careful With It!", "Author": "Big Ike", "ReviewID": "RQZMDEGR0EAZ", "Overall": "4.0", "Content": "I love the camera. It's easy to carry around and loaded with fun features. The camera slipped out of my hands and hit a tile floor during a family gathering. Now the viewing screen no longer works and the lens is forever stuck in the open/on position. I like the camera enough to replace it with another SD30 -- this time with a carrying case!", "Date": "November 27, 2006"}, {"Title": "A Great Camera", "Author": "Kayla Guyette", "ReviewID": "R3AX3AWWQ3KJ4T", "Overall": "5.0", "Content": "I was using an old family digital camera. A friend of mine told me about this camera and I checked it out. This camera is amazing. I've taken so many great pictures with it. It is alot of fun to color swap pictures. Modes for taking pictures of kids and pets along with fireworks is a great idea. I love how videos can be compact or perfect quility.This is a great buy for people who attend concerts [you can digital zoom up to 10x to get band memebers in shoots].", "Date": "July 26, 2006"}, {"Title": ":-( It didn't work", "Author": "Born2shop", "ReviewID": "RPW4PLSK4RLVC", "Overall": "1.0", "Content": "It would have been nice, but I had to return it because it had an error code that I learned is common with these cameras.", "Date": "November 11, 2013"}, {"Title": "not work", "Author": "Gilberto Flores", "ReviewID": "RS2ZSWJZ7Y07B", "Overall": "1.0", "Content": "unfortunately, does not work when I tried it emits sound and error 18, is the lens out and unresponsive.that bad product.", "Date": "December 4, 2012"}, {"Title": "great camara", "Author": "C. kerr", "ReviewID": "R15K20RYDO08HF", "Overall": "5.0", "Content": "This is the best camara I have ever owned. The only one thing I can say i wish was better is the red eye, but its an easy fix to make.. The size of it is awesome, so easy to take everywhere I go, many people think its a cell phone its so small...I wish they still made it in this size...I actually own 3 of them....", "Date": "March 29, 2010"}, {"Title": "Love that Little Canon", "Author": "Jan Blum \"Loving the Canon\"", "ReviewID": "R1B8WYMPZ61Z6A", "Overall": "5.0", "Content": "I originally received the Canon Powershot SD30 5mp Digital Elph 3 years ago.  On a recent cruise it was stolen, so the search to find another just like it began.  Because it is so small, I have it will me all the time.  It takes wonderful pictures.  Everytime I take it out, someone comments on what a small camera it is, and then they can't believe the wonderful results.Wish they still made this camera.  I searched and found nothing comparable.", "Date": "October 24, 2008"}, {"Title": "cannon powershot", "Author": "Angela J. Joyce", "ReviewID": "R329EJ21POGNT5", "Overall": "5.0", "Content": "great camera.  We use it alot and has great pictures.  Can be used for videos as well", "Date": "January 14, 2008"}, {"Title": "Canon Powershot", "Author": "James L. Jones III", "ReviewID": "RO18BCWG4SNXS", "Overall": "5.0", "Content": "Great little camera. Takes good pictures. I bought the 5MP but wonder whether I should have bought the 7MP for around the same price. You definitely will want to buy the custom leather case and extra memory for this camera.", "Date": "December 30, 2007"}, {"Title": "Amazing!", "Author": "J. Patton \"liteoffantasy\"", "ReviewID": "R14K6HP02QT8WM", "Overall": "5.0", "Content": "I do love this camera. I bought it back in February from a store, and it's totally worth getting. It's easy to carry around, and it looks sleek. I took it to a big formal dinner and it just looked great with me. I love how small the camera is, but the quality of the pictures are amazing. I absolutely love the quality. It takes AMAZING in-action photos. I highly recommend it to anyone who loves taking digital pictures.", "Date": "August 12, 2007"}, {"Title": "Great Looking and Function", "Author": "Wen Shen", "ReviewID": "RXKKYDX5J8WGS", "Overall": "5.0", "Content": "I got it for my girlfriend because she loved the color. Didn't expect much from a cute little camera, but it amazed me. Great job Canon. Good quality pictures in low light condition.", "Date": "February 17, 2007"}, {"Title": "THE BEST!!", "Author": "Lesley Hays \"eragon\"", "ReviewID": "R2SSZBQUKUYHYR", "Overall": "5.0", "Content": "i love this camera!! i looked and a billion cameras i wanted on affodabl and small. and this was exactly it!! i love it so much its the best. it takes good day and night pictures. its even good for kids.i recomend this camera for every age and size!!", "Date": "January 30, 2007"}, {"Title": "Christmas present", "Author": "J. Price", "ReviewID": "RDX3Z2763LIYD", "Overall": "5.0", "Content": "Was a christmas gift for my girlfriend. She loves it. Small enough to always carry around. I'm actually kinda jealous...maybe i'll buy another for myself!", "Date": "January 19, 2007"}, {"Title": "One snazzy little cam!", "Author": "Meredith Brown", "ReviewID": "RGGKRCQN7TEYA", "Overall": "5.0", "Content": "I received the Canon PowerShot SD30 as a Christmas present and have loved it ever since. It's my first digital camera and it's so user-friendly that I was able to use it right out of the box. The picture quality is great too.PS ~ The purple is even more fabulous is person. =)", "Date": "January 16, 2007"}, {"Title": "OK camera - not good if you travel a lot though", "Author": "BOSS", "ReviewID": "R2DQFRTF8YZW4Z", "Overall": "3.0", "Content": "First the positives:Great size, and the screen is very good quality. Picture quality is fantastic, and the menus' and options are intuitive and easy to set. The camera also looks great and is a great \"take it everywhere\" camera. The docking station it comes with is very convenient for charging and transfering photos to your computer. Camera also looks really good.Now the negatives:Biggest problem, the battery! Battery life is a joke! It seems the camera draines the battery even when it's off, if you take the camera out of the charging cradle and leave it off for like 3 days, the battery dies. That is ridiculous! If you take the battery out it last much much longer, so I'm wondering why they have the camera draining the battery even when it's off. There is also no battery meter, which combined with the short battery life, it forces you to take the charger everywhere which is really bad if you take a lot of short trips where normally you wouldn't need to bring a charger.Overall, Good camera with some glaring usability flaws.", "Date": "January 14, 2007"}, {"Title": "the best", "Author": "marsglow \"marsglow\"", "ReviewID": "R2YWDKCFOXZUVU", "Overall": "5.0", "Content": "This camera is excellent, and the seller packed it very carefully.  It was a gift, and it was perfect.", "Date": "January 11, 2007"}, {"Title": "Picture Perfect", "Author": "Ashley Richardson", "ReviewID": "R2ANZ72PCWI4KS", "Overall": "5.0", "Content": "I love this camera! It takes great pictures whether I'm inside or outside. It allows me to use different picture modes to take good pictures for memories or to be artistic. It is also little and I can put it in my pocket for easy access.", "Date": "January 9, 2007"}, {"Title": "hot mini camera", "Author": "chewy \"nerd doc\"", "ReviewID": "R1WVCV17IOPZX", "Overall": "5.0", "Content": "great camera.  small, quick to boot up.  fast cycle time, even with flash.if you need a camera to carry with you all the time, this is a great one.btw, I personally like the canon digital camera algorithm.  I have used olympus, nikon, sony and canon, and I like the colors of the canons the best.price is super right now, too, since the 7MB just came out.", "Date": "January 3, 2007"}, {"Title": "Sleek Easy To Use Camera", "Author": "Army Finance \"A. Hackett\"", "ReviewID": "R3EWI7EGG3TIDX", "Overall": "5.0", "Content": "I bought this camera after two years of a Canon PowerShot A300 3.2 MP and have always been in the Canon family. It doesn't take long to learn what you can do with this small digital camera. The controls are very easy and straight forward to use. I love the color which makes it simple to spot among other items when you are in a hurry to snap a picture. The resolution is good even when taking moving shots. The fact I love the most about it is the charging dock which makes it simple and convieniet to recharge the camera. Instead of using a set of batteries everytime you take ten pictures, this camera holds a charge for a very long time. I am very pleased with this camera and will always stay in the canon family so long as they continue to produce great quality digital cameras for the average person.", "Date": "December 27, 2006"}, {"Title": "Simple daily use camera", "Author": "Ej", "ReviewID": "RA5BRSD139APM", "Overall": "5.0", "Content": "We liked this camera enough to buy one as a gift for someone else.  It's very small and portable.  With a faster RAM SD card it has quick image capability and this is handy for taking \"multiples\".  IE  taking 3 or 4 shots as you enjoy the image knowing you can throw some out later.  It's a nice camera for those times when you want photos as reminders of good time and places, not memories of spending a lot of time fiddling with the camera.", "Date": "October 24, 2006"}, {"Title": "not sure about this one", "Author": "S. Shepherd", "ReviewID": "R13GKIGQ2SCYUB", "Overall": "3.0", "Content": "I had a 2 MP Elph camera for many years, which I loved mainly for its compact size.  I purchased this one as a gift hoping that the recipient would also love the compact features.I have recently borrowed the camera and I was impressed with the easy to use menu, which is the same as my old elph camera.  One thing that did not impress me was that if your hand is not perfectly still, your picture comes out blurry.  This happened to me frequently and I can say that I never noticed this with the old 2MP elph.", "Date": "July 3, 2006"}, {"Title": "smaller than a Video Ipod (5G)", "Author": "Dwight", "ReviewID": "RUW498HB5KK5G", "Overall": "4.0", "Content": "The Sd40 is now out for $350.I paid $270 with free shipping, no sales tax.  Obviously, one should shop around and find the best current deal.  I worry about scratching the lcd screen but this Canon camera comes with a leather case so I don't have to scour the internet looking for the case that is just right for my camera.  The instructions are easy to read and understand.  It's tiny and I am so pleased because it's lightness and size encourages carrying this camera so it is perfect for trips.  I bought a 2gb memory card that had a promotional offer from Amazon.  This has been an easy shopping experience.  The camera comes with lots of cables so I don't have to shop before using the camera (unlike a canon printer I just returned that did not have a cable to connect to the computer.)I hope this camera is durable since it's not my nature to swoon and run out to purchase whenever a new model of anything comes out.  I just want a better than decent camera and I don't mind paying for it but I don't want to enter a consumer pattern of buying a new one every year - that's not owning, that's leasing.", "Date": "August 20, 2006"}, {"Title": "Cool Package, Crisp Pictures", "Author": "Curtis E. Moore", "ReviewID": "REVX6SIQXTZ2E", "Overall": "4.0", "Content": "Love the camera though still trying to work on the details of using color and various settings. The ease of basic use is wonderful. The pictures are excellent but what I like best is the compact and stylist package. Having paid only $180 at Circuit City made the investment bearable.", "Date": "April 2, 2007"}, {"Title": "It's awesome!!", "Author": "Haley", "ReviewID": "R3U1FXN07P1XBR", "Overall": "5.0", "Content": "This camera has a beautiful exterior design and is full of different features. It's such a fun toy to play with. It's fully equiped for people like me, who is not a professional photographer but enjoy taking pictures.", "Date": "February 23, 2006"}, {"Title": "Love Love Love!!!", "Author": "Purple_Butterfly_78 \"Sommer S.\"", "ReviewID": "R2SBOJE2FC87XB", "Overall": "5.0", "Content": "I recieved this camera as a requested gift on my 28th b-day back in September and I absolutely love it! I have a 20 mo. old baby girl and this camera is perfect for documenting her everyday cuteness. I love the quality of the pictures and the videos as well. Her grandparents live in Oklahoma and we are in Seattle, so it's great for sending picture and video e-mail. The camera is very easy to use, and once I really got into the users manual I learned some really cool things about the cameras features. Purple is my favorite color, so the vivacious violet was an obvious choice. The color is only the begining... This is an amazing camera for someone who wants quality pictures and videos of everyday life. I would give it 10 stars if I could! My only complaint is the flash is a little weak at night, but from what I understand, there is an extra attachment that can be purchased for a stronger flash, so no big deal really.", "Date": "October 28, 2006"}, {"Title": "before buying", "Author": "Prick \"anomality_person\"", "ReviewID": "RJ6QMQZYX36ET", "Overall": "1.0", "Content": "If you like to take pictures with macro lense, it sucks. I've had many canon cameras and this one takes the the prize for worst quality. If you get closer than five inches, the pictures messes up.I've had no other problem with the hardware, though I hate carrying around that dock and it's odd shaped charger. No other charger cable in the world is going to fit! So loose it and you're screwed.oh, and night photos also suck. BIG TIME, even with the flash on.", "Date": "January 16, 2007"}, {"Title": "Love it", "Author": "Leah Jackson", "ReviewID": "RWW5BICUMP9FA", "Overall": "5.0", "Content": "I really love this camera. Not only is it super cute, but it has many great functions and it takes great pictures.  The compactness of the camera is a major plus as well.  Great for traveling or carrying it everyday!", "Date": "December 8, 2005"}, {"Title": "Great camera if you don't like taking pictures!", "Author": "Brewster \"Necromonger\"", "ReviewID": "R1JOBNPP7BC3GN", "Overall": "2.0", "Content": "Sure my Canon sd-30 is super cute and I get lots of compliments on how small and sexy it is, but heaven forbid you want to take pictures with it!!This camera cannot take pictures in low light AT ALL!  Every picture I've taken at parties has been out of focus, which adds up to a lot of hazy photos of great memories.  I took it back to the camera shop and the guy said I had the setting right but \"yeah, they don't work well in low light.\"  Well if I needed a bright sunny day for every shot I could make a pinhole camera out of a cardboard box!The pictures it takes in daylight are nice.  But anyone who wants a tiny little camera like this is planning on putting it in their pocket and taking it to parties!I got the Sony Cybershot 10.1 and it takes GREAT pictures in low light.  Later, Canon.", "Date": "March 5, 2007"}, {"Title": "Jameson Thottam review of Canon PowerShot SD30", "Author": "Jameson Thottam \"Jameson Thottam\"", "ReviewID": "RH6K4I5J5XX1X", "Overall": "5.0", "Content": "Jameson Thottam review of Canon PowerShot SD30I immediately got the new 5-Megapixel super-compact Canon PowerShot SD30 Digital Elph . The camera is smaller than the SD400 or SD450, yet has the same 5-Megapixel resolution. And unlike the earlier SD20, it has optical zoom lens.Jameson Thottam: What Is Canon PowerShot SD30?Available in several color (Rockstar Red, Tuxedo Black, Glamour Gold, Vivacious Violet), the Canon PowerShot SD30 is a super-compact 5-Megapixel stylish digital camera with metal case, a 2.4x optical zoom (38-90 mm equivalent), a 1.8-inch LCD screen, acclaimed fast Canon DiG!C II (DIGIC 2) Image Processor, 9-area smart AiAF auto focus, powered by a small rechargeable battery.The camera stores pictures on SD (Secure Digital) or MultiMedia memory cards (16 MB SD supplied) and features fast USB 2.0 Hi-Speed connection to PC and Mac computers. It also supports direct printing (without computer) with PictBridge compatible printers. The camera comes with a camera dock that charges the battery and simplifies the USB image transfer and A/V connectivity.Jameson Luke Thottam: In the BoxThe camera comes with the rechargeable Li-Ion battery, camera dock, power adaptor, 16 MB memory card, wireless remote control with the battery, wrist strap, soft case of the same color as camera, USB cable, A/V cable, software and manuals.Jameson Thottam and thoughts on the Camera itselfThe SD30 looks cool and is very compact. It is very miniature, looks cool, feels sturdy and heavy in your hand with its metal case. It looks and feels durable as well, but be careful not to scratch its matte finish. The camera is smaller than the SD400 or SD450.It has a retractable lens that extends and has a lens cover that opens when the camera is powered on. When the camera is powered off, the lens retracts and the lens cover closes.The camera has an on/off button on the top deck as well as a large shutter release button. The bottom of the camera has a metal threaded tripod mount and a dock connector.The side has a battery and SD card compartment lid. The rear houses a bright 1.8-inch LCD monitor, control buttons and a menu control disk, which also serves as a zoom control (just like on the Canon A410). The camera has no viewfinder. The rear also has a sliding switch between review, movie and still picture taking modes.Jameson Luke Thottam and the Camera's UsageThe camera is very easy to use, aside from adjusting to use the menu control disk as a zoom control. I have not read the manual (I have not even opened it), but was able to use the camera and all its features in no time. The camera can be used by any member of the family and by photographers of all levels of expertise from novices to advanced ones (it will not give you much control over the shutter speed or aperture).The camera comes pre-set to Auto mode. You do not have to do anything other than point and shoot - the camera takes care of the rest. The camera uses 9-area intelligent autofocus. You press the shutter release button halfway to make camera focus and the camera shows you (on the LCD screen) where it focused by displaying one or more green rectangles. Then you take the picture by pressing the shutter release button all the way.If you want more control, you can select Manual mode, which is not a real manual mode where you would be able to select the shutter speed and aperture, but rather a mode in which you get access to selection of several parameters. In Manual mode, you can set the ISO (50-400), white balance (several presets and custom), use exposure compensation to make pictures darker or brighter, use picture effects, color replacement effects, and more.The camera gives you instant access to the timer and flash mode selection (flash off, red-eye reduction, night portrait, auto flash) at a push of a button. The other controls are easy to use as well.Jameson L Thottam with More on Features and ControlsThe PowerShot SD30 is a replacement for the miniature 5-Megapixel Canon PowerShot SD20. The SD20 had no optical zoom and relied on its digital zoom instead. The SD30 has optical zoom, yet keeps the small dimensions.The camera features selectable Evaluative, Center-Weighted and Spot metering modes. The aperture range is f/3.2-5.4 at wide angle/telephoto. The shutter speed range is 15-1/1,600 sec.You can use the exposure compensation in the manual mode and it comes in handy in the sunset hours as the camera overexposes the picture trying to preserve the shadow detail. There are a bunch of scene modes as well, which help the camera tweak the focusing and exposure settings according to the type of scene.James Thottam and the LCDThe camera has a 1.8-inch LCD screen that has good resolution and good visibility in sunlight. In dimly-lit environments, the LCD increases its brightness (gains-up) and still stays fluid enough. The camera has no viewfinder.Jameson L Thottam with Points on the BatteryThe camera uses a compact rechargeable Li-Ion battery. According to Canon, the camera can take about 160 pictures on one charge of its miniature battery (400 with LCD off). I have not validated this claim, but I took more than 60 pictures and the low battery warning has not appeared yet. The battery can be charged in-camera while the camera is in its supplied camera dock.Jameson Thottam on PerformanceThe SD30 uses the latest version of Canon DiG!C processor - DIGIC II. It is the same processor used in larger Canon digital SLR cameras and it gives this Digital Elph amazing speed. The camera takes less than a second to power itself on in review mode and only about a second to power on and extend its lens in shooting mode.The camera can capture images at about one per second in burst mode (I used Kingston Elite Pro SD memory card). In single-frame mode, the camera could snap pictures at about once every 1.5-2 seconds without flash. The flash recycle time is about 6-7 seconds.The focusing takes less than a second and the shutter lag, when pre-focused, is almost non-existent.Jameson Luke Thottam and the Flash of the CameraThe camera has a small flash that is quite weak. It is sufficient at up to 4-7 feet away. It has a recycle time of about 6-7 seconds.Jameson Thottam and the Image Quality SettingsThe camera lets you select between Super Fine, Fine and Normal compression levels (regardless of resolution). You can detect occasional JPEG artifacts in the mode of highest compression and some fine detail may be lost. But the two lower-compression modes (Fine and Superfine) are rather good. The available resolution modes are 5MP, 3MP, 2MP and VGA (640x480).Jameson Thottam and the White BalanceThe camera's automatic white balance is usually quite accurate with the exception of the incandescent lighting, where you are better off either selecting Incandescent white balance setting or using the available manual white balance.Jameson Thottam and the Menu SystemI have not read the manual, yet was able to use the camera in all modes. Usually, I am not a big fan of Canon menus but this Digital Elph is very easy to use. Not only I find the menus intuitive, they also appear very fast (instantaneously), unlike the menus on Canon A520 and A510, which take about a second to appear.The zooming is a bit cumbersome as there is no dedicated zoom control, but you have to use the menu control disk (push the upper or lower portion of it). It works, but is not as convenient as having a dedicated zoom control.Jameson Thottam and the Computer ConnectivityThe camera uses USB 2.0 Hi-Speed connection to transfer pictures to a computer. You can also remove the SD memory card and use a memory card reader (if you have one), but I used the camera with the docking station supplied. The file transfer is very fast at about 2,000 KB/s.Jameson Thottam and the HistogramThe camera can display a histogram in the review mode to show you if you have overexposed the highlights or underexposed the shadows. I useful feature when you don't trust the LCD. You can also rotate pictures in the review mode.Jameson Luke Thottam and the Picture QualityThe SD30 produces well-exposed, sharp, contrasty and richly-colored images. The photos taken with the SD400 are sharp from corner to corner with only the very edges of the frame being slightly softer than the center at telephoto end. This will not be noticeable in printed pictures however since corners normally don't make it to the print due to the aspect ratio difference and other factors.The lens exhibits slight chromatic aberration (purple fringing) in the areas of high contrast, but the amounts of it are acceptable.The camera produces contrasty photos that have a pleasing \"Canon\" color with slight over-saturation and nice blue skies - the kind of color consumers like.The image noise is absent at ISO 50 and cannot be found even in the shadows. It appears (slightly) at the ISO 100 and the detail level slightly decreases as the noise suppression in the camera tries to get rid of it. The noise gets more pronounced at ISO 200 and gets worse at ISO 400. Still, if you are printing 6x4 or 5x7 pictures, the noise should not be visible at all and will only be slightly visible at ISO 400 with larger prints. With 5-megapixel shots the SD30 produces, you can print your photos at up to 11x14 inches with good detail (ISO 50-100). The ISO 200 shots can be printed at up to 8x10.Jameson L Thottam and final ConcernsThe camera is compact, cool and capable, but I have some concerns. The camera has a rather weak flash. It also uses a proprietary dock connection and docking station, which some people like and some do not. It is also quite pricey: I paid $320 for my camera.Jameson Luke Thottam", "Date": "November 21, 2005"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B000AZ519K"}}