{"Reviews": [{"Title": "A perfect choice for an entry level digital camear.", "Author": "R R", "ReviewID": "RYP2AR4TN6MUN", "Overall": "5.0", "Content": "Sample pictures at (snipurl com jfki) replace the spaces with a dot and a forwardslash. bandwidth maybe refreshes every hour.Pros:mostly over the a510:·The video mode although choppy is still a few fps(frames per second) better than the a510.·Auto white balancing occurs during video recording which the a510 doesn't have and it also allows you to zoom 2x while recording.·Very fast menu navigation and picture viewing. A lot faster than the a510.·Better shot to shot times(without flash) than the a510.·Although it is still at USB 1.1 speed, this time Canon got it right with making the plug and play hardware standards compliant with Windows. Basically meaing when you plug the camera in your USB port, windows will show it as a drive letter allowing you to copy the pictures over to your computer without any additional software unlike the a510 which requires you to use Canon's own propietary software.·Very slick rectangular design, curved edges, and a dark silver color, with all the buttons perfectly in the right place(if your right handed).·Seems to conserve a lot less battery power than the a510 especially when recording videos witch the a510 would drain at.·Battery life seems to just go on forever if you don't use the flash.·Very sufficient manual controls for an entry level cameraCons:·I found the a510 , although slower, to be slighty better in picture quality because of more manual control available and less purple fringing than the a410.·The LCD is smaller, but because of the faster digic II processor you can quickly zoom-in and pan the pictures very very fast.ONE OF THE BEST FEATURES:Canon included a feature not found in many entry level cameras. It is a feature I use very often in different indoor to outdoor environments. It is the EVALUATE WHITE BALANCE. Just place the small rectangle in the LCD view on what is supposed to be white and hit set and the a410 automatically adjusts the picture respectively. This drastically improves pictures taken in indoor lowlight environments so much that you don't even have to use the flash in less than adequatly lit rooms. It also keeps the your white walls looking white and not yellow. This improves indoors and night shots but you should still consider putting the camera on a solid surface and set the timer to 3 secs in order to avoid any potential blurring from trembling hands. This feature also doesn't show 'natural' whites but it is still very much pleasant.I purchased this camera new after discounts for $100 + tax + shipping and for the price difference, smooth operation, high performance, and convenience in hookup/operation compared to the a510 it outweighs the minimal picture quality difference.By far the best entry level digital camera currently on the market.Please take few seconds to view the sample images or rate my review if it was helpful. Thanks.", "Date": "November 2, 2005"}, {"Title": "I'd gladly pay more for this, but won't complain!", "Author": "Cooper", "ReviewID": "RHTJDDKYZUBMR", "Overall": "5.0", "Content": "This is a superb camera at an unbelievable price.  The camera body is very  attractive, it's light and portable, and the controls are very easy and intuitive to use.  3.2MP is more than enough for very high quality prints, though I did add a 512k card.  Don't get all caught up with worrying about 3mp vs 5mp vs 7mp unless you plan to print lots of poster size images.  Now I can take and store 400 pictures on one battery charge with the LCD on.  Simply amazing technology.I compared all kinds of cameras under $500, and this one not only does everything I need, but it's very affordable.  This will keep me happy for many years to come.  Now what to do with all the $$$ I saved...Update: June 2008  I still love this camera and continue to use it frequently.Update: May 2010  I still love this camera and see no reason to upgrade, it rocks!  This baby has now been around the world and taken amazing shots everywhere, day and night.Thank you Cannon!  We need more companies like you instead of the usual cyclical consumption greedy bastard, engineered failure garbage that we usually get at WalMart.I'm a Cannon fan for life because of this amazing camera.", "Date": "September 29, 2005"}, {"Title": "Good for some, be sure it's for you", "Author": "Snap, Crackle and Pop", "ReviewID": "R1PVRTKFMBIYAO", "Overall": "4.0", "Content": "This relatively new (August 2005) camera is a very interesting offering from Canon, one of the top makers of digicams.  As you can see from the other comments here, there are lots of positive things to say about it, given its very reasonable price.So it will be a great camera for lots of people, especially those new to digital photography.  But it has some key features that you might not notice, so be sure to consider these points: - At 4.1 x 2 x 1.6 in, this is not a tiny camera, though not large by any means. - The wide angle only goes to the equivalent of 41mm - lots of other cameras go to 35mm.  You will likely notice, some of the time, that you have a hard time getting everything into the shot. - Even with the great Canon lenses and electronics, the picture quality won't equal that of other cameras, as this uses a very tiny sensor chip to pick up the images. - This won't be a great camera in low light.  The \"fastest\" ISO setting is 200. - Not a huge point, but it doesn't have an especially high quality video mode.  (The silver lining, you probably won't need a high speed memory card!) - The LCD is a little small by current standards, at 1.5\" - The camera uses standard size batteries.  Some prefer that to buying proprietary battery packs, but it does mean you'll have to buy some NiMH (not NiCad) rechargeable batteries, and a charger, and carry them when you travel.Being able to get a new Canon at this price is a great option, just be sure it's right for you.  If you're still using a film camera, and paying for film developing and prints you don't want, it will probably pay for itself!", "Date": "December 9, 2005"}, {"Title": "A great little camera that exceeded my expectations.", "Author": "Jon G. Purkey \"jpurkey\"", "ReviewID": "R7779AV4F0HSB", "Overall": "5.0", "Content": "I picked out and received the Canon PowerShot A410 as a Christmas gift. I wanted a low to mid priced digital camera with optical zoom and the Canon PowerShot had the features I wanted at the right price. It is my first real digital camera and considering the price it has definitely exceeded my expectations.Setup was easy and without hassle. There is a basic and an advanced manual and the basic one is all you should need to look at to get started taking pictures, even if you are not familiar with digital cameras. You can read the advanced manual later when you are ready to try other features of the camera.The display is small, but still easy to read (and I am legally blind with 20/200 vision.) In playback mode you can zoom to 10x to check the quality and clarity of your pictures. Menu and setting text is sharp and easy to read. Some of the icons are a bit small, but when you change a non-text setting, like the flash, the icon is briefly shown larger before shrinking and moving to the corner of the screen.There are 4 resolutions and with each you can choose either Super Fine, Fine or Normal. The Super Fine setting is the best quality and Normal allows you to take more pictures. The resolution sizes and the average number of pictures you can take with the included 16MB card are: (2048x1536 SF=9, F=16, N=33), (1600x1200 SF=14, F=26, N=50), (1024x768 SF=25, F=45, N=80) and (640x480 SF=56, F=88, N=138.) There is also a 1600x1200 postcard mode which includes the ability to embed a time/date stamp on the picture.In addition to the 3.2 optical zoom, there is a 3.2(approximate) digital zoom. Digital zoom is off by default so you have to turn it on. When its on you can zoom to 10x. The first 3.2x of the zoom is optical, then the zoom pauses for a second and the rest up to 10x is digital. The 3.2x digital zoom is also available in the macro mode which doesn't have optical zoom.There are several pre-defined modes for taking pictures in daylight, night, etc. And there are also some interesting effects available. One that I like is color swap which lets you substitute one color with another. It can for example let you change the color of your carpeting while leaving everything else (of different colors) the same. It works pretty well, though sometimes shades of colors like brown and red are treated the same.There are 3 video modes to choose from. None have audio. The modes are: 640 x 480 x 10 fps, 320 x 240 x 20 fps and 160 x 120 x 15 fps. In the 640 x 480 mode you can zoom digitally to 2x while recording. Approximate recording times with the 16MB card are 640x480: 23 seconds, 320x240: 33 seconds and 160x120: 1 minute  47 seconds. With a larger memory card you can record videos up to 3 minutes in length.For the most part, the default settings were right for the photos I take. I have found that changing the ISO setting from the default of 50 to \"Auto\" takes pictures which have more accurate lighting. I also use the White Balance Evaluation for some pictures. See the example (with the Furby) that I posted to see comparison pictures taken with and without white balance. Usually White Balance is not needed, but for some photos it makes a big difference.Some cautions and cons:You should put the camera in playback mode when it is turned off. If not and you accidently turn it on the lens will try to extend, even if in the packaging. I saw no mention of this in the manual, but discovered it myself the first time I was putting the camera away. There did not appear to be any permanent harm, however the camera did beep when it couldn't fully extend the lens.As others have mentioned, the highest ISO speed setting is 200, which makes it difficult to take pictures in low light conditions without the flash and without a tripod (or very steady hands!)Battery usage does seem a bit fast, especially when the camera is connected to the computer. The manual suggests getting the AC adapter for when connecting the camera to the computer which I may do. The first time I get the low battery warning on a set of batteries has always been just after having the camera connected to the computer.The included 16MB memory card is probably too small for most people, especially if you want to take videos. But memory cards are relatively cheap, so get a 128 or 256 MB card and you can take plenty of pictures and videos.", "Date": "December 29, 2005"}, {"Title": "Nice Little Camera for the Price", "Author": "Donga \"ten miles out to sea\"", "ReviewID": "R245OQGPVLNO4Y", "Overall": "5.0", "Content": "Canon produces reliable cameras that don't eat batteries like some of the other brands, and the A410 is simple for beginners but has enough options to grow with, including a fair zoom (x3) and a macro setting for super close ups. Its small though only fairly slim, a tad thicker than a pack of cigarettes, so it won't slide in your front pants pocket but it will fit. Avoid the expensive kit you'll get offered, instead get a less expensive AA battery charger and buy the case by itself if you want one. An extra Memory card is a nice option if you are away from your computer on vacation and want to store a lot of photos but the included card is fine for around home. If you have a Mac the Canon will load photos right away into iPhoto without having to load the included software.", "Date": "March 31, 2006"}, {"Title": "Great camera - until you get E18 error", "Author": "Rusty76", "ReviewID": "R3EXFHD25FUZG5", "Overall": "2.0", "Content": "I've had a few Canon cameras over the years, all from the A series (A10, A75, A410), and have been very happy with them.  My old Canon A10 and A75 cameras took great pictures and were bombproof - they survived being dropped numerous times, bouncing around in backpacks, etc.Unfortunately, the Canon A410 I purchased just a couple of weeks ago never even got a chance to stand up to this abuse.  It died  after just a couple weekends of taking family photos (E18 error, see details below).  No drops, no scratches, nothing - it was in my pocket the whole time.It turns out that this Canon E18 error is well known and plagues many Canon compact cameras produced in the last year.  The E18 error occurs when the lens extension mechanism becomes misaligned (or the camera thinks that the lens is misaligned).  The camera then refuses to extend the lens, making it impossible to take any pictures.  In my case, it appears that the camera is just crying wolf (ie, the camera thinks the lens mechanism is broken when in fact there is no real problem), but I still can't take any pictures.Don't believe me?  Do a web search for \"Canon E18\".  It sounds like a bunch of other people have had this problem as well.I'm bummed that Canon camera aren't as reliable as they used to be - now I'm going to have to find some other manufacturer (Olympus, maybe?)", "Date": "December 5, 2005"}, {"Title": "Excellent Entry-Level Digital Camera", "Author": "R. E. Trout", "ReviewID": "R2ZS7SPNDE7FNX", "Overall": "5.0", "Content": "The handsome A410 replaces the A400 in Canon's lineup, updated with a more powerful zoom and the DIGIC II image processor. It has a few features that are kind of rare for an entry-level camera, such as an AF assist lamp and manual white balance. It also has an optical viewfinder, a feature that has become increasingly rare on point-and-shoot cameras, but which I consider essential. It lacks the interchangeable lens of the A510, but it does support the HF-DC1 external flash!As with all Canon's A-series cameras, it uses AA batteries.  I prefer cameras that use AA batteries over cameras that use proprietary lithium ion batteries because AAs are cheap and available and in a pinch you can drop in some alkalines. Not surprisingly, the A410 ate the alkalines included in the package pretty quickly, but it gets excellent life from rechargeable NiMH batteries. A set of these with a charger is a necessary purchase. I use the Monster Cable MB 4-DCRC.The 16MB card included with the camera is just OK for a 3-megapixel camera. You'll want to get a larger capacity card. Fortunately, you can get a pretty good deal on SD cards, which are available as large as a GB! Since at the default setting file sizes are about 1 MB, you may find a 128 MB card to be more than adequate.Canon's file numbering system is IMG_xxxx.JPG. It maintains the file numbering even if you replace or format memory cards. I don't know what happens if you take more than 9999 pictures, but I may find out -- my sister is up to 5700+ on her A95! A small watch battery in the bottom of the camera saves the time, date and other settings even when the AA batteries are taken out.Its start-up time is very quick. Photo quality is excellent, as one would expect of a Canon camera, with accurate color, low noise, and good sharpness. In Macro mode it focuses as close as 5 cm at wide-angle and 25 cm at telephoto. In Super Macro mode it can focus as close as 1.5 cm. It has several preset shooting modes including Portrait, Night Snapshot, Kids and Pets, Indoor, Foliage, Beach, Snow, and Fireworks.As with most point-and-shoot cameras there is a bit of red-eye to deal with, but the software included in the package deals with it fairly well. The A410's controls are logical and generally well-placed. Using the zoom located in the 4-way controller seemed a little bit awkward at first, but I got used to it in fairly short order. It seems to have been placed to favor using the LCD for composing photos.I bought this for my Mom as an uncomplicated first digital camera, and its size and ease of use has made it a winner. In all, the A410 is an excellent entry-level camera, especially for its price.", "Date": "January 3, 2006"}, {"Title": "Great buy! Not a single blurry picture!!!", "Author": "VP", "ReviewID": "R2G4CANFULW009", "Overall": "5.0", "Content": "I bought Canon S2IS for myself and A410 for our niece. To my great surprise A410 took A WHOLE LOT BETTER pics than S2IS. (In fact I sadly returned my S2IS and continued using my old faithful Canon PRO 90IS digital camera.) We took several pictures with it, not a single came out bad! All were vivid and crisp. I just loved this camera's output. Only one thing I didn't like is the zoom controls are on the back on the same dial as forward backward controls. I like zoom controls on top of the camera.", "Date": "April 26, 2006"}, {"Title": "The Best Bet", "Author": "Samuel Chell", "ReviewID": "R1VPUKIDD14QCF", "Overall": "5.0", "Content": "This would make a fine entry-level camera to digital photography, except for me it's replacing an early-model Sony Cybershot U with a 1.3 mp lens.  The Sony was producing satisfactory images, but whenever I'd send out for prints, I'd receive lots of those orange triangles warning me that the resolution wasn't sharp enough to guarantee good results.The Canon Powershot A410 is a user-friendly camera (I shot my first pictures, loaded them into my computer, and printed them without opening the manual), and it's only slightly larger than either my tiny Cybershot or my wife's Canon Elph SD110.  It easily fits in a pants, or even shirt, pocket and is so light as to make weight a negligible factor.  I considered the Canon A430 with a 4 megapixel lens until I noticed that it's a bulkier, slightly heavier camera.  With the A410 you're getting a precision instrument that's practically Elph-sized.  I also looked at the Canon A520, which is essentially a miniaturized version of the 400 series.  The problem is that the A520 is appreciably thicker than the A410 (translating into bulging pockets).  Also, the shrinking of the camera body in other areas apparently required sacrificing the newer, more efficient Digic II processor that's a feature of the A410.  Contrary to the testimonials of others, loading pictures into iPhoto (with the most recent OSX) required installation of Canon's included software.As for megapixels, the 3.2 lens is just as sharp as the 4 lens.  Compare 8X10 photos shot by the two lenses and there is no difference.  The 4 megapixel lens becomes a factor only if you decide to go for enlargements much beyond 8X10 or to blow up selected portions of a photo.", "Date": "March 26, 2006"}, {"Title": "Canon PowerShot A410: A Perfect Camera for Teens or Young Adults!!!", "Author": "Roy Chan", "ReviewID": "RXK5ZUP3ZULQ1", "Overall": "4.0", "Content": "Pros: Low price, compact, uses 2 AA batteries, good performance, image quality, build quality, it's a CANON, digital zoom is really sharp better then some 5.1 megCons: Only 3.2 MP resolution, no ISO 400, no dedicated zoom control, no wide angle, battery lifeSummary: Ok guys, that Canon Powershot A410 isn't a bad camera nor a good camera. There are of course better choices. But to make it short, this camera is a very good quality product that has many many good technology like the high priced one. It can record 180sec of digital movies at 640 x 480 (VGA)when you forgot to bring that digital movie camcorders on that special events.My recommendation of this product: Please get that re-chargeable battery for 2600mAH MiMH for longer usage and upgrade to 1G Compact flash memory. It's really worth spending an extra money for this nice Canon camera.", "Date": "December 7, 2005"}, {"Title": "Awesome camera - great price", "Author": "MrsMoe", "ReviewID": "ROQTU30GEDXQS", "Overall": "5.0", "Content": "We just purchased this camera today, so we still have a lot to learn about the bells and whistles.So easy to use... just point and click. We were also told it eats batteries (and purchased a pricey battery recharging kit) but I've been fooling around with it for hours and it's still running off of the genereic batteries it came with (only 2 AAA's.)Very detailed, crisp pics, vivid color, and amazing indoor quality, even without the flash.I wasn't expecting it to be this good!!!", "Date": "October 9, 2005"}, {"Title": "CANON POWERSHOT", "Author": "K. J. Roberts \"purrrrrrrrrfect comfort\"", "ReviewID": "RZMQTYK4RF7T1", "Overall": "4.0", "Content": "I think that this item is a terrific camera for the price, it takes great pics and since I use it for my ebay business, I like that it takes really good close up shots. The card that comes with it is small (only takes 15-16 shots) but for what I use it for it works - I also purchased a larger card to use for more exposures when I'm out and about - My previous camera was over 6 years old and still took good pics but couldn't get replacement parts. It cost 3 times what I paid for this one and the pic quality of this one is superior to that one. I would recommend this camera for ease of use, pic quality, and size - would suggest purchasing larger capacity cards for more exposures between uploads.", "Date": "February 23, 2006"}, {"Title": "Impressed after 3 minutes of having it", "Author": "Dylan", "ReviewID": "RDCGI4VCKX4Y8", "Overall": "5.0", "Content": "All I have to say is first this camera looked to be well, cheapish due to the size. After 3 minutes though it had me impressed! Takes the pictures quite readily, no waiting for it to stabalize for a minute, and you barely get any blurry pictures. I was actually given this camera after my cousin broke my other one, they felt so bad they gave me their canon, and now i'm kinda glad that happened!For me personally the two biggest things I use this for are; taking pictures of lakes, trees, plants, etc. and taking pictures of fish and inverts. I'm a huge fish enthusiast and finding a camera that'll take good shots of fast moving fish through a glass box is hard. I was also limited with what I could photograph, as all subjects under three inches usually came out blurry, but heck, the macro mode solves all my problems on that one!Bottom line, this little camera is the best i've come across! You know it's good when it has Canon in it's name!", "Date": "July 12, 2006"}, {"Title": "easy and it works", "Author": "Susan Gregg \"author Dance of Power\"", "ReviewID": "R24SEMEIHWETWL", "Overall": "5.0", "Content": "I got this camera as a gift and just love it - I also love the fact that I can use the memory card from my Palm Pilot. The pictures are great, it is easy to use and the price is right.", "Date": "April 11, 2006"}, {"Title": "Amazing", "Author": null, "ReviewID": "R9FB0ITKOEBHJ", "Overall": "5.0", "Content": "This is my second digital camera. This is a 3.2 meg camera but it shoots like a seven. picture quality amazing. DO NOT DOWNLOAD SOFTWARE, just pulg into the USB and select scanner and camera wizard. very easy to use. battery life long. get this camera!", "Date": "July 25, 2006"}, {"Title": "First time and loving it...", "Author": "T. Simpson", "ReviewID": "R1TN0F2RMADKB6", "Overall": "5.0", "Content": "This is my first digital camera as well as my first time buying something online. I carefully read through all the reviews in my price range and this seemed to be the one for me. I don't know all the technical stuff that comes along with camera's, but let me tell you.. I love this camera. It is so easy to use! I just popped the batteries in and after about ten minutes of reading the quick start guide I was taking tons of pictures and emailing them to friends and family. Of course there are also tons of nifty settings to experiment with once you have time to really read the manual. One thing I was worried about was the battery life, since most reviews recommended that you get rechargeables. For a normal family photographer like me, I haven't had any need to replace the batteries once I got a name brand in there, and I've had it for two months. (The generic batteries it comes with lasted a whole half hour) I would definitely recommend this to anyone looking for a nice family camera to take the family photos with and save on film. I'm sure it's good for more than that, but like I said.. I don't know much about digital photography to rate it on that front.", "Date": "February 7, 2006"}, {"Title": "Great camera for the price", "Author": "L. Keener", "ReviewID": "R1Q70ZK1GLFYUH", "Overall": "4.0", "Content": "I bought this camera for my 10 year old daughter.  She is thrilled to have her own camera and has taken may vacation pics for the family.  I would reccommend for all beginning photographers.  Great price range with all the options.  Plus easy to use.", "Date": "August 20, 2006"}, {"Title": "I didn't know I was such a  good photographer!", "Author": "M. Lord", "ReviewID": "R76HTSLUOY9AI", "Overall": "5.0", "Content": "I have no idea what I am doing but this camera makes a pro out of a novice like me.  I have just been \"playing\" with pictures and sending them off to my friend, a professional who owned her own studio at one time and did it all!  She said the photos are pretty much technically perfect.  And I was using difficult subjects during the worst shooting times for the light.The camera has great manuals that are either simple for quick use and reference or go into more depth depending on your requirements.  You can either go with the camera settings or play with custom shots...also simple to learn and fun too.I had no problem hooking it up for downloading photos to the computer and playing.  I even made a scrapbook from the software to print out of my kitten...my first test subject.Its small and light and easy to use...I am getting lots of time from store bought batteries and haven't even loaded in my rechargeables since it hasn't been a financial burden at all.  Although the ones that come with the camera don't last long.Can I go on about how I love this little camera that floats on my shoulder in my bag along with my purse wherever I go?  I read all the reviews and I didn't have ANY problems that were listed by other users.  It's a gem!!!", "Date": "June 22, 2006"}, {"Title": "Exceptional Camera!!! Buy This!", "Author": null, "ReviewID": "R50SQM08LF5HJ", "Overall": "5.0", "Content": "I am an 11 year old boy who was looking for a camera to take pictures with, a good price and one that was nice. It turns out I get this camera and I took it to the beach and took it into the forest and the pictures turned out excellent! The only reason why I did not give it five stars was because sometimes it would beep and not activate no matter what I did. This is most likely because it is refurbished- this rarely happens. If I were you I would not worry about it and not by the camera because of it.Whenever you make prints at a photo store, the prints look great but my parents for some reason think that the colors are not as intense. I always get the 4x6 print outs and they turn out great.If you are going to take lots and lots of pictures I reccommend that you get the 1GB SD memory card, but if you just take pictures when it is important, your good with just a 256MB or 512MB SD or MMC card. The video mode is nice except that there is no sound.Overall it is a nice camera and anybody who is low-key and just wants a picture that is 4x6 or 5x7, even 8x10- this is the camera for you. If you are a person who wants poster size images, this is not the camera for you. The main reason I bought it was I wanted pictures of my dogs, my family, maybe scenery. You know that old-fashioned 35mm film? Well, I did not want to spend all my money on film and I just wanted a camera that will work. Trust me, unless you are a professional photographer- GET THIS CAMERA!!!", "Date": "October 13, 2006"}, {"Title": "Great digital camera, awesome price!!", "Author": "star18_2025 \"star\"", "ReviewID": "R1Y5N23N1GYNUO", "Overall": "4.0", "Content": "I have wanted a digital camera for some time now but I didn't want to pay out the you-know-what for a good one. So I spent a lot of time researching and comparing prices. I chose this one because it was recomended above all the others for my particular photographing needs. And it was in my budget. Mostly I use it for family pictures, nothing fancy. I like the ease of use for basic point ans shoot and also for more technical photographing. Although to really get all the different uses out of this one you'll have to read through all the many books that acompany it. I don't use the included software, I prefer my own I have installed on my pc. The one that comes with the camera is too complicated. All around I feel like this is a great camera and if it holds up to wear and tear I probably won't be replacing it any time soon.", "Date": "March 13, 2006"}, {"Title": "Great digital camera, awesome price!!", "Author": "star18_2025 \"star\"", "ReviewID": "R1Y5N23N1GYNUO", "Overall": "4.0", "Content": "I have wanted a digital camera for some time now but I didn't want to pay out the you-know-what for a good one. So I spent a lot of time researching and comparing prices. I chose this one because it was recomended above all the others for my particular photographing needs. And it was in my budget. Mostly I use it for family pictures, nothing fancy. I like the ease of use for basic point ans shoot and also for more technical photographing. Although to really get all the different uses out of this one you'll have to read through all the many books that acompany it. I don't use the included software, I prefer my own I have installed on my pc. The one that comes with the camera is too complicated. All around I feel like this is a great camera and if it holds up to wear and tear I probably won't be replacing it any time soon.", "Date": "March 13, 2006"}, {"Title": "Great price, great camera", "Author": "Valarie Weinhaus \"Val\"", "ReviewID": "R2FG25LXXOBEE7", "Overall": "5.0", "Content": "I bought this camera to replace an old HP, and don't have one regret.  This camera takes great pics, and takes sepia and black and white as well.  I took the snowflake pics with this camera.  LOVE it!  I highly recommend this camera, and if I ever buy another digital, you bet your bottom dollar it will be another Canon.", "Date": "February 19, 2006"}, {"Title": "The camera itself was fine...", "Author": "K. Wittman", "ReviewID": "R3V6XSRC4I4WNB", "Overall": "4.0", "Content": "But we couldn't get it hooked up to the computer! We installed the software properly andt tried on 2 desktops and a laptop yet the camera was never recognized. After sending it back we found one that we liked better anyway.As far as the camera itself, it's very easy to use and takes decent pictures, but the movies are kind of pointless because there's no sound recorder.", "Date": "March 18, 2006"}, {"Title": "Great until it malfunctioned, then Canon did not honor warranty", "Author": "DJ Primate", "ReviewID": "R3TH2LGYYE183W", "Overall": "1.0", "Content": "This camera worked very well until the lens got jammed in its extended position.  I sent the camera for warranty service (I had it less than 7 months), and they refused to honor the warranty because it was a bit scuffed and a little decorative ring on the end of the lens that had been attached with 2-sided tape had come off. They claimed this happened due to physical damage, but this occurred during normal use: I was just changing modes and the lens didn't retract. Don't bother trying to get warranty service unless the unit looks brand new.  Even then, don't be surprised if they renege on the warranty.I had another A410 that did the very same thing (lens got jammed), but was stolen in a break-in before I sent it out for service (so I suppose it was no loss after all).  Obviously there is a design flaw that causes the lens to extend too far and come off track inside.In short, this camera is not suitable for frequent use in the field. If you buy it, and plan to use it a lot, expect to be buying another camera or paying for a repair that should be covered under warranty (which I'm not doing) soon.", "Date": "November 9, 2006"}, {"Title": "A very satisfied customer.", "Author": "Catherine E. Kuespert", "ReviewID": "R38JPTOSPST624", "Overall": "5.0", "Content": "I love this camera!  I did a lot of reading-up and price-checking before I bought this item, and I'm delighted with the quality of product and value for money.This was my first 'own camera' and I've had almost zero camera experience, so to find myself taking the most amazing photos and being able to edit/add text/e-mail them - well - WOW!  I've been stunned by the results this camera has given, all within about a month of purchase.The basic handbook had me taking quality 'normal' photo's within 24 hours and, using this handbook I've progressed into some fantastic close-up stuff, and some fun stuff too - get your spouse to dress up for the sepia shots and have a good laugh!!I've had enormous fun learning with this camera - and I've got loads more to learn and I feel that some good camera work is now within my grasp.  This has required a modicom of concentration and diligence, but it's paid off, and is precisely what I had hoped for.I found the batteries that came with the camera were almost useless, but that your quality name-brand batteries give excellent life - also, if you plan on taking more than about 15 pics at a time, you will want a memory card.Oh Yeah! I'm an 'old bird' of 53 years, so if I can do this, ANYONE can :o)", "Date": "November 4, 2006"}, {"Title": "Just Right", "Author": "Express Lizard", "ReviewID": "RLWKK6NWQ9FXO", "Overall": "5.0", "Content": "I got this camera in 2005 and it is now 2008 and it has been everywhere with me!  We've gone skiing, went to Niagara falls (this camera survived maid of the mist boat ride), several zoos, conventions, graduations, microbiology laboratory ect.  This thing has stayed working in all sorts of weather after much tumbling around in my handbag.  I take it to school and work every day.  I've never had any problems with it - ever.  The menus and functions are user-friendly.  The flash is just right (not harsh) and never makes my face look shiny like so many other cameras do.  The zoom is awesome and the self-timer can be custom set in many ways!Tip: use rechargeable batteries rather than regular.  This camera went through my AAs very quickly during long events (half day and full day events called for at least one battery change).  Now, with the $20 rechargeable 2500mAh batteries, I only run out of power every few months no matter how many or long my photo-ops last!  It's been great!One question, though.  Why is there a video feature if the camera cannot record audio (sound)???  I never use the video feature because of this.This camera takes great pictures, is durable, and is my best friend.  Thank you Canon!2010 Update: An orange juice spill is what finally did this camera in.  Everything was so sticky in impossible to clean places that it became too difficult to use.", "Date": "December 25, 2008"}, {"Title": "Canon A410", "Author": "Barb S", "ReviewID": "R2GQZOVC0PG28N", "Overall": "5.0", "Content": "My first Canon A410 was a great little camera.  I took pictures all the time:  of grandchildren, flowers, birds, turtles, etc.  when it no longer took the best pictures, I told my husband I wanted a new A410 so I looked on Amazon.  There it was.  It is every bit as good as my first one.  I can download the pictures from the SD card to my computer and then burn them to a CD.  It is a great little camera to keep in your purse like I do.", "Date": "March 26, 2012"}, {"Title": "Great camera for years", "Author": "A. Ferreira \"64-year old baby boomer\"", "ReviewID": "R114XVDO131N1K", "Overall": "5.0", "Content": "I've considered buying one of those \"big megapixel\" cameras but frankly, I just don't see a need. This little Canon has been so good to take great pictures. It's intuitive to use, uses SD memory cards, and does good indoors or out, sun or no sun, distance or close up.I'm also uploading picture I took, a closeup of a tiny frog nestled in a daylily bloom. I could not ask for more than this little camera has given me.", "Date": "November 24, 2011"}, {"Title": "3 Year Old Camera; Review", "Author": "irukandji", "ReviewID": "R3UFTQO99FEYKK", "Overall": "5.0", "Content": "I've had this camera for 3 years now. I use AA Ni-MH Rechargeable Batteries. Never a problem with the camera or the batteries (I got the Sony brand that comes with the charger). You'll probably need to buy batteries, a larger memory card, and perhaps a case. This camera will not take SD cards that are \"HC\" (high capacity). Those cards are usually 4GB and higher.Picture resolutions this camera can capture:2048 x 15361600 x 12001024 x  768640 x 480There are 3 Modes you can enable, 1) Superfine, 2) Fine, and 3) Normal. These settings change the JPEG compression. Superfine has little to no compression. And Normal will have the most compression. If you lower the setting to \"Normal\", you can decrease the file sizes and fit more pictures on your SD card and take more pictures.This camera will show you the amount of pictures you can take at a particular setting. For example, with a 512MB SD card, at the highest resolution of 2048x1536 and set at \"Superfine\", it will take 302 pictures. At 2048x1536, and set at \"Normal\" it will take 1066 pictures. If you have used up half your card disk space, it will account for that and display the amount of pictures you can take.It can capture movies/videos. They will not have sound though. Below are the dimensions:640 x 480 at 10 FPS320 x 240 at 20 FPSFPS = Frames Per SecondThe 320x240 videos look good and run a lot smoother because of the higher frames per second.Also has common features like Macro, Supermacro, indoor/outdoor settings, etc.I'll never buy another digital camera till this one breaks down. I use to think the megapixels of the camera meant it would take better pictures. However, that is incorrect. That only means it will take higher resolution pictures, which doesn't necessarily mean better pictures. If you do a lot of printing or print larger than 8.5 x 11, then megapixels would matter. I stopped caring about that since I rather have a camera just take quality pictures. If I were printing posters or something, I'd care.It is fairly simply to use.", "Date": "January 28, 2009"}, {"Title": "Excellent toy camera", "Author": "K. Seso \"Kev Seso\"", "ReviewID": "R1VKHOCI5KEANL", "Overall": "4.0", "Content": "Update:  This is a toy camera but an excellent one at that.  Good quality pictures.The deal breakers: Uses AA batteries.  That means you take three pictures for every two AA batteries.", "Date": "September 19, 2008"}, {"Title": "Awesome for the price! Excellent camera for a first-timer, maybe even 2nd timer", "Author": "Consumer Adphawkit \"Adphawkit Andrew\"", "ReviewID": "R1PJLP4SZ0Y78P", "Overall": "4.0", "Content": "This camera has great features and functionality, is a breeze to use in terms of learning it (as my wife can attest to... although it may take some time), and it's so simple to transfer files/print to a canon printer. I purchased this with the Pixma ip4200 printer, and it was well worth it!The only downside I'd point out, which was a real bummer for my wife and I and is the reason I only gave 4 stars is that the flash is very slow to bounce back (so-to-speak). I recently got her a new 7.x MP Canon Powershot SD1000, which is similarly a snap-and-go camera, and the flash is a bit quicker at rejuvenating. However for the money, this drawback is truly minor, unless you're planning to really take tons of quick photos... and even then, I believe with these cameras you can set 3 shots at a time (although you should double check).", "Date": "December 25, 2007"}, {"Title": "Great Beginner's Camera!", "Author": "Miranda \"ruby girl\"", "ReviewID": "RSCH2L0C79NMU", "Overall": "5.0", "Content": "Okay, I admit that I'm a complete beginner when it comes to digital cameras, but this camera is really very easy to use, and the picture quality is very good.  I received it for a birthday gift and couldn't be more pleased.", "Date": "July 25, 2006"}, {"Title": "Good Simple Digital Camera", "Author": "Julian Herbert", "ReviewID": "R8B4GO4BHWBKL", "Overall": "4.0", "Content": "It is a great product, I enjoy the different modes.  Its a good camera for a first time digital camera buyer.  It is not to complicated to understand everything, battery time could be longer but other than that I believe it is a great buy", "Date": "March 20, 2006"}, {"Title": "an excellent small camera", "Author": "Elaine B. Williamson \"Fearless Reader\"", "ReviewID": "R1OKH8ANNTITM0", "Overall": "5.0", "Content": "I've used a number of digital cameras in the past, including the D60 (DSLR) and several Olympus point-and-shoots.  I'm partial to Canon and Olympus.  I purchased this camera for my niece as a birthday gift, and she used it while she was visiting me.  She loved it!  I loved it!  It takes excellent pictures, is pretty easy to understand, and seems quite sturdy.  She was taking shots outside in the extreme cold (10 above) and it performed very well.  I read reviews and looked at other cameras, and for her needs this fit the bill.  So far, it's been a great choice.", "Date": "January 31, 2006"}, {"Title": "Canon A 410", "Author": "William C.", "ReviewID": "RQKC4C123BGKZ", "Overall": "5.0", "Content": "Great camera for the price. For my 18 year old daughter. Nice and simple and quality of a Canon. Does everything 99.9% of us need a camera for. Great pictures, Highly recommended.", "Date": "January 15, 2006"}, {"Title": "Canon Powershot Digital Camera", "Author": "Fem Rab", "ReviewID": "RXQ801KQOHD1A", "Overall": "5.0", "Content": "The camera was well packaged and the delivery was prompt; exactly the day it was promised.", "Date": "June 29, 2006"}, {"Title": "Terrific point-and-shoot camera for the price", "Author": "Gordon M. Wagner", "ReviewID": "R1KYCOVQCVTIHD", "Overall": "5.0", "Content": "I bought one of these as a Christmas gift for my seven-year old. It's ideal! She's thrilled to have a \"real\" camera and it wasn't terribly expensive. We need to get a Secure Digital Memory card with a greater capacity, but otherwise everything we needed was in the box and it works great with our Mac without installing any drivers.I'm fascinated to see what photos she takes -- and how clever of her to ask for a camera as a gift.", "Date": "December 26, 2005"}, {"Title": "Camera Review", "Author": "Leslie", "ReviewID": "R6M25G3FYQULO", "Overall": "3.0", "Content": "This camera takes good pictures but the only problem with it is that it goes through batteries very quickly.  I got some rechargable ones and they last a little longer, but it's a bit of a hassle always changing batteries.", "Date": "January 3, 2007"}, {"Title": "Dependable, durable camera", "Author": "Horse Mom", "ReviewID": "R1VSFP13E703CB", "Overall": "5.0", "Content": "I bought this camera as a gift for my 16 yr old daughter who takes lots of fun pictures of her friends.Her photos are great quality.  This is a dependable camera, and takes the abuse a teenager gives it.  I love it for all those reasons besides the great pics!", "Date": "October 27, 2006"}, {"Title": "review", "Author": "Cecil W., Cherry", "ReviewID": "R3OKEUZ2HDUYVQ", "Overall": "5.0", "Content": "This was a excellent buy and the camera did just what I wanted to.  It does very good close up work.", "Date": "January 5, 2012"}, {"Title": "Very nice used camera", "Author": "blsmtfm1955", "ReviewID": "R2NMHOVCHHSMJV", "Overall": "5.0", "Content": "It's always a gamble purchasing a used item, but this item came in very good condition, in it's original box with all books, installation disc, memory card, usb cord, and even batteries installed. Camera takes nice clear pictures. Fairly easy to learn to use which is nice as it is my first digital camera. I haven't used it enough yet to wear out the batteries once so I have no true idea how long they last. Works well with my Windows 7 system.", "Date": "September 25, 2011"}, {"Title": "didn't work, but now it's GREAT!!", "Author": "gardenia", "ReviewID": "R29BC87QVHK521", "Overall": "4.0", "Content": "I can't really review, because it doesn't work. It was guaranteed to work, but when I put in the memory card, it reads 'memory card error'. I've had the card tested, and there's nothing wrong with it, and even put another card in. I can't get the camera to even take a picture because of this. By the time I rc'd everything (camera, mem card and batts) it was past the time I could return. So, with a camera that doesn't work . . what do I do now???????  Please advise, I don't have money to spend on this. It took me a few months just to save up $50 to buy all this. HELP!! EDITED as of 9/19/11: I now give this camera 4*'s. I bought it used, put in new mem card, etc. & it wouldn't work. Was told it was a faulty camera, but later found out the card was bad. I've now fixed it, and love the camera. Also had nothing to do with Amazon to begin with, so apologies to them. I thought this was going on the site of the shop that sold me the used camera.  Sorry.", "Date": "May 31, 2011"}, {"Title": "The little camera that could", "Author": "Sharon T. Young", "ReviewID": "RAVA2OD40SHWO", "Overall": "5.0", "Content": "I've had this little Powershot A410 for years. It fits well in my purse or pocket, so it is with me ALWAYS. I also have a Canon Powershot S3IS that is a \"more advanced\" point and shoot.Lately I have been getting the bug to upgrade to a DSLR and most likely will in the next month. I have also been looking at small point & shoots to replace the A410.I have just realized that would be a waste of money. This little camera produces images that are just as good (and sometimes better) than the other Canon or other shots I see taken with expensive cameras.Twice now this camera has gotten completely soaking wet....and it's fine! Just the other day, I dropped it on some rocks ...hard .... and it's just fine!There is nothing negative about this great little oldie but goodie!", "Date": "July 18, 2009"}, {"Title": "good camera", "Author": "John C. Chandler \"indy champ\"", "ReviewID": "R1JIHS7U20NX8Z", "Overall": "4.0", "Content": "i haven't used the camera a lot...but when i have it has worked out just fine. my \"old\" digital camera is just that...old.  i have had it for over 10 years.  although it is much larger than my \"new\" camera - i have to admit i am more comfortable using it.  the old camera doesn't have all the bells and whistles of the new one --- that is something that is hard for me to get used to.  but the canon a410 is a really good camera for a fairly low price.  i am happy with my purchase.", "Date": "May 29, 2009"}, {"Title": "Canon Powershot A410 3.2MP", "Author": "W. Shafer", "ReviewID": "R2K5VM09YWUF3M", "Overall": "1.0", "Content": "I purchased this for my daughter for Christmas 2006. She has taken very good care of it and never loaned it to anyone. After about 6 months it started acting funny. I told her not to worry as I've been using cameras for over 30 years and have owned many digital's and it was probably just needed fresh batterys. UPDATE- she was right.... camera goes dead after 2 pictures either taken or viewed with new batterys. Camera now lives in the bottom of my safe...waiting for the Camera Gods to fix it. My $250.should have been spent on something else..sorry.", "Date": "January 19, 2008"}, {"Title": "I still miss this little gem.", "Author": "Kate Stokes", "ReviewID": "R3UCJMRKX8P16F", "Overall": "5.0", "Content": "This used to be mine a few years ago, but I gave it to my mom for Christmas after upgrading to something else. This is a great little camera. The best digital camera under 4MP if you ask me. It has a glass lens (most of these little cameras have plastic lenses) and it will focus at any length no matter how close or far your subject and no matter how close you hold the camera to the subject. Extremely easy to use. You should be able to find this on the used market in great shape for between $30-$75.", "Date": "January 9, 2008"}, {"Title": "Great little camera!", "Author": "L. Twigg", "ReviewID": "R3GJD1VCJDY7L6", "Overall": "5.0", "Content": "I purchased this camera for my 8 year old daughter for Christmas after reviewing all the \"kids\" cameras.  I own a digital SLR Canon that I am pleased with so wanted to stick with Canon.  After checking around, I found an excellent price on Amazon. This camera is easy to use and takes excellent pictures.  The color is great and I have found myself using it instead of my SLR.  You can turn off the back display which saves batteries and take pictures through the eyepiece.  Two AA batteries keep it running for a long time. The only complaint at all is that the battery compartment is a little awkward to open. My daughter has learned to use this camera quickly and has surprised us with the great pictures she's taken.", "Date": "January 3, 2008"}, {"Title": "Canon A410", "Author": "S. Williams \"katsr6\"", "ReviewID": "R1LS402FEZZR44", "Overall": "5.0", "Content": "I gave this camera to my son and he has taken so many fantastic photos.  It is just so great and easy to use. It takes sharp, up close and long range shots. I am going to recomend it to others.", "Date": "January 9, 2007"}, {"Title": "Canon A410", "Author": "Richie E. \"Richard E.\"", "ReviewID": "R159EFU414ZC8C", "Overall": "4.0", "Content": "Best camera I've ever owned.It has features found on larger SLR's such as shutter speed & red-eye reduction.The several shoot modes such as portrait allows for close ups as well as a scenery mode which allows for sharp vivid photos of foilage as well as sunsets.A marvelous little camera and the size being slightly bigger than a pack of cigarettes allows you to take this anywhere without the bulk of some of the SLR's and their required lens.Too many features to list here.Try one for yourself you'll be amazed.", "Date": "November 5, 2006"}, {"Title": "Best point and shoot for sure!", "Author": "Mama2J&O; \"Mama\"", "ReviewID": "R124E6EU2LKFCJ", "Overall": "5.0", "Content": "This camera has more than exceeded my expectations. It takes fabulous pictures even in the pitch dark. You can zoom, and zoom and the pictures are still clear. There are tons of features, including the option to take your photos in black and white or sepia. It's easy to use, but do read the manuals so you can take full advantage of all the camera has to offer. I would definitely recommend this camera to anyone. The only small downer was that the memory card that the camera comes with doesn't hold many photos. But other than that it's perfect! Go buy one! It's the best deal for your money, hands down!", "Date": "April 23, 2006"}, {"Title": "NOT entry level!", "Author": "A reader", "ReviewID": "R13FVUMSXQBSPM", "Overall": "1.0", "Content": "How incredibly frustrating.  This camera arrived with several POUNDS of instruction manuals.  These were poorly translated (from Japanese I guess) and often referred to stuff that was in the illustration, but not on my camera.  I wanted to rip my hair out.  After reading and reading and studying and studying, I still could not operate any more than the automatic mode, and never did figure out how to switch between menus.  I bought this based on the reviews here that it is a good entry level digital camera...for WHO??  An engineer?  An experienced photographer?  Let me be the first to say I am not technologically inclined, but HELLO, I thought entry level meant entry level--just entering the realm of digital.  I am still so lost.  And frustrated.  I have signed up for classes to learn to use the thing.  A complete exercise in frustration.  Never again.", "Date": "January 25, 2006"}, {"Title": "Great Camera", "Author": "M. Marcy", "ReviewID": "R3F57Q5WY7KULE", "Overall": "5.0", "Content": "This is a great camera for the beginner. 3.2MP is plenty for the type of pictures I take. What little set up is quick and easy. Someday I'm going to read the manuel. Buy a bigger chip. I picked up a ScanDisk Ultra II. 1GB. It holds over 1700 post card shots and I can plug it directly into the USB port on my Mac. It also acts as a backup for my hard drive.", "Date": "March 10, 2006"}, {"Title": "Disappointed", "Author": "Macrend", "ReviewID": "R1MEGYKH5C9CL5", "Overall": "2.0", "Content": "I bought this camera because of the Canon brand name. But I was totally disappointed.The camera has good image, but some unforgivable problems:- You need to install tons of software components just for tranfering the pictures from the camera to the PC.- The ZoomBrowser EX software does whatever it wants, except what I want to do. Opens picture folders that I don't want. And keeps spreading the pictures all over my HD.- I need to unplug my other 3 USB devices everytime I want to transfer pictures from the camera to my PC. Because it won't work if other devices are connected. This is even stated in the camera's manual.(...)", "Date": "March 9, 2006"}, {"Title": "Didn't work", "Author": "LovePinkRule", "ReviewID": "R2V7Z5VTZ97XKH", "Overall": "1.0", "Content": "I need the camera for work. The camera didn't work and I lost clients due to the fax I could not take picture. The camera had to be format. I thought you put the disk in and just use it.", "Date": "January 28, 2012"}, {"Title": "Wow!", "Author": "Daniel Attila \"Daniel Attila\"", "ReviewID": "R2CUJTK5YDBZI5", "Overall": "5.0", "Content": "I just finished the first set of pics with this machine and was surprised at the amazing sharpness and the accuracy of the autofocus, not to mention the deapth of field when compared to our older Canon digital camera.Don't be fooled by the low price, however. The 16MB card is a joke, and the batteries are not rechargable. It is best to get a 1GB memory card along with a battery charger pack right away. The price is still very reasonable for such a high quality machine.", "Date": "October 13, 2006"}, {"Title": "Great little camera for the price", "Author": "IlikeSocialJustice", "ReviewID": "R1FEZ774RWJOU", "Overall": "5.0", "Content": "Great little camera for the price. Does everything I ask and was well priced. Easy to learn how to use. Very good quality pics.", "Date": "March 16, 2006"}, {"Title": "good inexpensive camera", "Author": "Phillip Christensen", "ReviewID": "R1EYOIRP1FU739", "Overall": "5.0", "Content": "good inexpensive cameraexactly what i was looking forworks greatintuitive controls", "Date": "February 26, 2006"}, {"Title": "Canon Digital Camera A410", "Author": "R. Hollander \"SAHD\"", "ReviewID": "RYCUSBKNVTODM", "Overall": "4.0", "Content": "This is a great entry level camera.  It does everything our family needs tremendously.  Printing, editing and downloading are simple.", "Date": "January 14, 2006"}, {"Title": "Canon Powershot Review", "Author": "Ralpek Pheg", "ReviewID": "R3T5WKLNLON0G", "Overall": "5.0", "Content": "I bought this camera for my daughter, a freshman in college.  I did so after reading several reviews of competitive products on the web.  She is thrilled with the camera and its ease of use.", "Date": "January 16, 2006"}, {"Title": "Ok, not great", "Author": "Ballet Boy \"Isis14\"", "ReviewID": "R3VN7CCQY7JENU", "Overall": "3.0", "Content": "Pictures are dark and you have to replace the battery often. They should all come with rechargables!  Not bad for a kid or someone starting out.", "Date": "March 9, 2006"}, {"Title": "canon powershot a410 3.2mp digital camera", "Author": "A. Kenniff \"annek1982\"", "ReviewID": "R3T4Q576SC8YIT", "Overall": "4.0", "Content": "i love it! it works great!!", "Date": "January 15, 2006"}, {"Title": "Complicated", "Author": "John Harris", "ReviewID": "R1GHQLI0SBF1EV", "Overall": "2.0", "Content": "Took it on a trip, couldn't figure out how to work it, bought a disposable that worked just fine.", "Date": "February 14, 2007"}, {"Title": "Very Disappointed", "Author": "Nan Deveroux", "ReviewID": "R2ENU8HYMEOV8K", "Overall": "1.0", "Content": "This was such a nice little camera & easy to learn. But requires downloading more stupid software to a Mac that has  an OSX operating system.  I have 9.2 & no plans to update in the near future.  All I need is to plug into the OSB port & have the folder pop up on my desktop with JPGs inside.  I don't even know if this camera creates JPGs or raw data???  The manual doesn't say.When will the tech people get the message that we're tired of all this updating & problems with incompatability...", "Date": "November 25, 2005"}, {"Title": "small memory card", "Author": "J. E. Correa \"popsicle-badoosh\"", "ReviewID": "R2AC76SUS1BP0N", "Overall": "3.0", "Content": "This is an awesome camera and the cheapest I've ever seen.  BUT (1 problem) the memory card it comes with is SOOOOOOO SMALLL!!!! I hate it. I hate it! I HATE IT !!!! I HATE ITI HATE ITI HATE ITI HATE ITI HATE ITI HATE ITI HATE ITI HATE IT!!!!!!!!!!!!  Its 16mb , thats about 20 pictures at a time!!! ohmygosh fortunately this can be replaced.", "Date": "December 29, 2005"}], "ProductInfo": {"Price": "$224.95", "Features": "3.2-megapixel CCD captures enough detail for photo-quality 10 x 14-inch prints\n3.2x optical zoom; lightweight, compact body\nFast autofocus and 14 shooting modes, including Special Scene Mode\nDIG!C II Image Processor for faster processing, vibrant colors, and excellent image quality\nPowered by 2 AA-size batteries; stores images on SD memory cards (256 MB card included)", "Name": "Canon Powershot A410 3.2MP Digital Camera with 3.2x Optical Zoom", "ImgURL": "http://ecx.images-amazon.com/images/I/513KNZFPDEL._SY300_.jpg", "ProductID": "B000AYGDWU"}}