{"Reviews": [{"Title": "Great little camera", "Author": "Chikara Ishiguro \"Chikara Ishiguro\"", "ReviewID": "R1OC11B40QFW1Z", "Overall": "5.0", "Content": "We (my wife and I) have also the Nikon D70 dSLR camera, but since I don't like to carry anything that can't fit into my pocket, I merely use it on daily basis. My new ultra-compact i5 camera solve this issue beautifully.To select among the ultra-compact cameras, I read web reviews and looked closely at a few other cameras from Casio, Sony, and Panasonic/Lumix in the shop. No camera seemed to be perfect, but the Samsung i5 seems to be the best price/performance for my daily needs. So far I'm pretty exiting with this great little camera, and I'm happy that I made this choice.The most important factor to me is image quality. Some of the snapshot I did with the new Safety Flash mode convinced me that this is the camera for me. At this mode the flash is not active. Instead a long exposure is operated with a digital hand-motion stabilizer. The results are sharp and clear photos even at low illuminating rooms such as our living room in the afternoon (sorry did not find way to add images here).Video clip capture is another aspect that this camera is excel with. it takes great videos, at 30fps, VGA size.Unlike many other cameras at this level, it allows to zoom in and out while videoing.I'm using the camera for several weeks now, mainly in family and social events, and I'm happy with the picture quality and absolutely love the small compact size of the camera, allowing me to have it with me at all time (I also have a camera phone, but it not satisfactory as a camera).  The large (2.5\") LCD screen is fantastic: bright and sharp.This is my first non-Japanese camera... and I must admit I'm impressed with this Samsung (Korean) product and highly recommend the i5 to anyone who wish to have good camera with him in his pocket.", "Date": "September 22, 2005"}, {"Title": "Great Camera Great Price", "Author": "Jake Jake \"JMR\"", "ReviewID": "R3SG1UU47JFKVB", "Overall": "5.0", "Content": "Right off the bat you know you've got a good deal when you open to box to find:1. A nice carrying case that fits the camera perfectly.2. A cradle that can be used optionally, the USB and Power cable can each independently be attached to the camera! Great for traveling around, leave the cradle behind.3. A WHOPPING 50 MB of internal storage, W O W!!!!!!!!!! When your memory card runs out you still get a decent amount of pictures before having to put in a new card.4. Software that acts as a OCR scanner to transfer text pictures into text documents, great for research, students, or when you just want to email someone a newpaper/magazine article.My last camera was the Canon SD300 and I decided to upgrade to this camera for it's higher mega pixel, bigger LCD, better video recording, and internal zooming lens.Design:Easier to use and more intuitive than the Canon interface.  Why? Well there is a round menu pad that your thumb rests on in the back to control various functions like flash, timer, etc.  But there is another column of buttons to the immediate left that controls 1. Playback 2. Switching between video/camera mode 3. Deleting a picture.  It's very fast and easy to go into playback mode or switch betwen video and camera mode.  Just press the button with your thumb without even looking at the camera!My old Canon you had to move a slider switch which took the camera out of shooting mode.  And to switch to video mode it was the center position of the slide switch so you had to always look and double check the slider was in the middle.  The older Canons had a rotating switch which was even worse, because they had like 8 different functions on them and you really make to make sure you put it in the right mode.  In my opinion that's terrible, this is a point and shoot camera, the design of the user interface should allow the user to quickly snap pictures, put the camera in different modes without having to double check all the time.  With the Samsung i5, you can switch modes review pictures in a completely dark room since you know where all the buttons are, AWESOME, A++ for DESIGN.  Oh, and the delete picture gets it's own button, no confusion or error when deleting a picture.  My old canon had it on the round menu pad, sometimes I didn't press it correctly and I invoked another function by mistake.  Glad I don't have to deal with that anymore.Picture quality:First I think the Canon SD300 may have a slight edge.  In low light settings the colors seem a bit more natural. But I think the Canons in general have the best image quality. If they are a 10 then this would be a 9. So, I would rate this Samsung as very good.  Both Samsung and Canon seem to put the default settings of their cameras to have the images soft.  Nikon seems to go the other route and sets their defaults to sharp.  I prefer sharp so I set my camera to sharp and it's great.  I love it and I have no problems with the image quality of this camera. The safety flash is a good idea but the images look a little grainy, I still prefer the old way to hold the camera real still and take pictures without flash indoors.Real Life Performance:This is where theory meets reality.  And this is where this camera shines.1. Ok, internal zooming lens, so what?  I'll tell you.  The idea behind point and shoot cameras are that you take them everywhere, in your pocket.  You have it so you can quickly snap a picture of events that unfold in your life like the fish that got away, your child taking his/her first steps, or even an alien abduction in progress.  Since the lens is internal you can keep the camera on and ready to snap pictures and still put it away in your pocket.  You can't do that with most other camers since they have that darn lens sticking out!2. 50 MB internal memory.  Chances are if the moment that you're taking pictures of is really critical that's when you'll run out of memory space on your card.  So instead of fumbling around like a fool with other cameras you can keep taking pictures with this one knowing you've got 50MB of storage in reserve.3. Again, design and layout of the camera is great for fast switching of modes and reviewing pictures on the go.  I like that I can concentrate on taking the picture instead of being preoccupied with looking down at my camera wondering what mode it's in etc.Overall impressions:I'm very happy with my purchase, I use the video recording function all the time.  You definetly have to buy a spare battery because you will take video. I bought 2 off brand batteries, they were dirt cheap, but not as good as the OEMS, but did I mention they were dirt cheap!  The spare battery fits perfectly in the belt loop of the provided case.  Good luck with your camera purchase!", "Date": "November 10, 2005"}, {"Title": "Great piece of kit - Full marks for Samsung", "Author": "MF", "ReviewID": "R2KLVPO6E7OFBZ", "Overall": "5.0", "Content": "I chose this camera over the Canon Ixus range, the Sony cybershots, the Nikon S1 and S3, the Fuji Z1 and the Olympus range.Reason - Saw most of the cameras in various shops (all great pieces of electronics) however the samsung was well priced and had one or two slightly better features in the price range and above.Size  - Perfect (small)Build  - Solid, robustPicture quality - Very goodVideo  - 30fps. Awesome, I thought I wouldn't use it but it is very handy. Quality looks great.Useability  - Very good, I have fat fingers from sports yet still find the buttons and keypad easy to navigate.LCD  - Large, about 230,000 pixels. Twice the resolution of the other cameras (see for yourself). The screen looks great and the refresh rate is fast so the sceen appears smooth when you move it. Compared to the fuji Z1, though very nice and well price, there is a noticable lag in the Fuji's screen.conclusionThe camera feels sturdy in your hand, and starts up very quickly for quick shots. It's given me great shots so far at parties, social events and everyday life and has a large selection of modes and features if you ever wanted to use them. Personally auto works well for me since all I want to do is take great pictures easily and quickly...but isn't that the point of compact cameras!? I feel 'average' people are getting too technical and moving away from the primary purpose of a camera!In one sentence:A great camera in all aspects, will not disappoint.", "Date": "December 27, 2005"}, {"Title": "Little Gem", "Author": "Mob Barley \"B4MDS\"", "ReviewID": "R3R5H4AQOUZ6WU", "Overall": "5.0", "Content": "Purchase requirements were a small, easy to use, 5mp camera with limited moving parts.  Person using the camera is not tech savvy.  The camera is the size of a credit card and about as thick as the diameter of a dime.  Very large lcd viewer for both framing the subject and reviewing pictures.  I recommend adding a fast write capable SD card, so shop carefully.  Overall stellar performer and in my opinion the best product for the requirements sought.", "Date": "December 30, 2005"}, {"Title": "I'm on camera #3 now because of shutter problems....", "Author": "Yvonne Chavez \"moo\"", "ReviewID": "R1AO8LM43L2L12", "Overall": "1.0", "Content": "I bought this camera in January 2006.  Used it for about 2 weeks and the shutter started sticking, opening occasionally, then not at all. Exchanged it hoping it was just that camera.  Now I'm taking the second camera back 4 months later, it started in with shutter problems, not opening again.  I thought maybe it was related to battery life...so today I went on an event, the camera was on the charger all night, battery shows full, took one photo and when I turn the camera off, it doesn't close or sticks half closed.  Now I'm back to the store where I purchased it, don't know if I can get another brand camera or if I'll be on #3.  I love the camera other than that aspect of it.  Don't know if I'd recommend it to anyone else, I am VERY disappointed with it.", "Date": "May 13, 2006"}, {"Title": "Excellent Camera", "Author": "John M. Patakas \"jpatakas2k\"", "ReviewID": "R3DUUIQ5IGYKZY", "Overall": "5.0", "Content": "I bought this camera in hopes to replace my aging Minolta 4.0MP DiMage S414--it worked great, but I was carrying more weight in extra batteries than the actual camera.Things I like...The camera is smaller than my iPod.  It takes beautiful pictures, has lots of functionality, and has good battery life.  I think what really won me over besides the style is the simplicity of taking pictures with it.  I think whoever at Samsung designed this camera really did their homework on how to make a digital camera easy to use, or at least, easier.The picture quality is pretty good and has a lot to offer as a 5.0MP camera.  I was surprised to find it came with a carrying case AND a dock--both would have easily been an extra $20-$50 a pop if I had bought a different brand.  I never thought I'd use a dock but it's really easy to keep your camera charged, and it looks a lot cleaner than having a bare wire hanging on your desk.Things I didn't like...Nothing so far...I've been pretty happy w/ how it performs.Things I loved...Internal lense (no more lens covers to break/lose), good battery life, size, comes with everything...a steal for the price.", "Date": "January 17, 2006"}, {"Title": "Bad quality", "Author": "M. LIN \"enervix\"", "ReviewID": "RFAB5PKRREUT5", "Overall": "1.0", "Content": "I had it repaired within 1st month bought it.  The image was distorted, and there are many dark horizontal lines through.  The service center was prompted though, they told me something wrong with the lens barrel, and had it fixed on the same day.  But then 1 month after the repair, similar problem came back.  There are many dark horizontal lines, and image is over-exposed.  I'm gonna send in for another repair soon.  Although the features are good, I don't think the quality is good, especially there are a lot of image noise when taking pictures in the dark.  Also, it's quite noisy when you zoom in and out.  The image is quite blur at night.", "Date": "March 26, 2006"}, {"Title": "samsung 5i", "Author": "Kathie L. Patrico", "ReviewID": "R10EXI7JEI8B42", "Overall": "5.0", "Content": "I had just reciently purchased the sumsung 5i it is an excellent camera it does every thing I need it to plus more. The only down fall about the camera is the chip that comes with it, it is to small if you want to shoot in 5 mega pixles. Other than that I am pleased with my purchase 100%.", "Date": "February 17, 2006"}, {"Title": "Wonderful camera under USA censorship", "Author": "Peter Sobczak \"Peter Sobczak\"", "ReviewID": "R2ZYIKTLSIAE8X", "Overall": "4.0", "Content": "I did not see any info for i5 camera and would never know about its existence - do USA magazines censor this camera?  I needed a camera to take quick shots of small objects at work. After extensive search, I found i5 sold only in 2 places. Strange? This is free market? Anyway, as i5 is mentioned and praised in US \"news\" like much worse cameras are mentioned and praised, I feared i5 might be something bad, not worth attention, \"lemon\" product. Well, I purchased i5 as badly needed for work. Once I started doing pictures, I realized it is perfect camera for me and my co-workers and friends. I regularly share i5 with people around me. i5 takes very good pictures and has amazing macro capability - you can take pictures from as close as 1cm. I took a picturte of menu in restaurant and was shocked to see such fine detail like dots on menu that make specific colors. YES, I can see each dot individually, its shape and color - on printed menu in restaurant! i5 takes pictures without showing big barrel lens that tells everybody you are making zoom in. This camera is ALWAYS very thin. I use pro camera otherwise, that is very heavy and big - and takes near perfect pictures. Still, I love i5 and am very happy with it and take it almost everywhere I go.  Peter", "Date": "August 12, 2006"}, {"Title": "The best digital camera for grandmothers", "Author": "Maria Hartoularos \"Mablanca\"", "ReviewID": "RFR0FJHG66HHM", "Overall": "5.0", "Content": "This is a wonderful little camera, the first one I own that it's easy to operate.  I congratulate myself for this purchase!", "Date": "February 24, 2006"}, {"Title": "Excellent Digital Camera", "Author": "Norma Gonzalez", "ReviewID": "R2F9BDDONQ14CS", "Overall": "5.0", "Content": "I am very happy with my camera. Is so beautiful and tiny. Also takes very nice pictures even though is so tiny.", "Date": "March 13, 2006"}], "ProductInfo": {"Price": "Unavailable", "Features": "5.0-megapixel sensor captures enough detail for photo-quality 13 x 17-inch prints\n3x optical zoom, 5x digital zoom; safety flash for enhanced image clarity and color\n2.5-inch LCD screen and high quality MPEG4 movie recording\nStore images on 50 MB of available internal flash memory or with SD/MMC memory card slot\nTransfers photos via USB; compatible with Windows and Mac operating systems; rechargeable Li-ion battery", "Name": "Samsung Digimax i5 5MP Digital Camera with 3x Optical Zoom (Silver)", "ImgURL": "http://ecx.images-amazon.com/images/I/417H31D6NPL._SY300_.jpg", "ProductID": "B000B898PO"}}