{"Reviews": [{"Title": "It can take photos that others likely won't", "Author": "Carlgo", "ReviewID": "RIFJW595J4EJE", "Overall": "5.0", "Content": "This is a tiny camera that fits pockets, purses and center consoles easily. As such, you are more likely to have this with you than, say, your digital Hasselblad and ten lenses. If aliens land on the street in front of you, you will get the shot on your S3,  not on the big camera that is at home.A small camera is also discreet. People tend to react when you point a big impressive looking camera at them, but hardly notice the small S3 rectangle. It does not attract too much attention to itself or me and that is a good thing.There are two ways to use this camera:One is to simply keep it on automatic, shoot lots of shots of well-lit scenes and delete the bad ones. This is a very effective technique used even by many professionals. The automation is hard to beat.Or, one can actually read and understand the manual and practice all the functions again and again until it all becomes second nature. There are lots of modes like portrait and landscape, and even exotic ones for fireworks and such. Each mode has specific automatic settings that optimize the results.Full automatic is just fine for most subjects, but if you want something special, a shot that could really be something, then it is worth the time to get into the proper mode. That is how I have been using the S3 and the results have been fine.Some reviewers complain about blurry shots. No modern camera blurs anything that is still and well-lit. Blur results from slow shutter speeds relative to camera shake or subject movement. The S3's little lens requires a slower shutter speed to compensate, to allow all the light that is needed by the sensors to capture an image. Handheld shots with slow shutter speeds are blurry with any camera.We are used to seeing big serious cameras on tripods and little carefree cameras being used handheld. Actually, it is more likely that the little camera should be the one on the tripod. In addition to their small lenses, their light weight and small size make them harder to hold still. Note, too, that flash freezes movement and eliminates blur. However, tiny cameras have small flashes that do not have much range and so do not work to prevent blur at longer ranges.My first twilight photos with the S3 were attempted with me holding it against trees, pressed to car roofs, etc. The only good results came when I used a tripod and fired it off using the self timer so that human hands were not at all involved.The usual daylight shots of people, scenes and things are not a problemMost of my prints are 4X6 and are really very sharp and well exposed in either the automatic or manual modes. I avoid shots that are not well lit or too far away for flash. The prints are generally much better than what I used to get from 35mm. It is reasonably fast with little lag time or waiting for images to be loaded. The camera itself is metal and  very solid and precise.The S3 comes with a little dock with an ac plug to charge it and a usb cable for downloads to your computer. Some people do not like the idea that you have to take the dock with you to recharge and download on the road. To me this is not a problem in that the dock is very small anyway and it is better to have all those connections on the dock rather than on a tiny camera.I have had perfect luck so far with Nikon photographic products and tend to trust that brand, so I bought the S3 over some other very compelling models. Nikon also does a very good job with programming exposure, focus, white balance, etc. I thought about maybe 4 stars because a little light camera can use vibration reduction in all modes, but a really effective and full time VR would likely cost more and I have not missed it anyway.If you need what this camera lacks, then you have to step up to a bigger and much more expensive DSLR. You can spend more, carry more and get more. It works that way with film and it does with digital as well. I would like a DSLR also, but the S3 is an excellent camera with a lot of options to make great photos and it would get a lot of use, even if I had that elusive digital Hasselblad, just because it would always be with me.", "Date": "March 3, 2006"}, {"Title": "pretty good so far", "Author": "Ronnie Anderson", "ReviewID": "R55KNPG4WHSOK", "Overall": "4.0", "Content": "Just got this camera a few days ago. I've taken several types of pictures so far and don't have any complaints (closeup, scenes, and portraits).I gave the camera to my wife to take a few pictures and like the other reviewer, she too had a problem with blurry shots. The problem was that the camera didn't reset itself from macro lens mode after turning it off and back on (I just assumed it did). I changed that and haven't had any more problems.", "Date": "December 5, 2005"}, {"Title": "For a point and shoot - near perfect", "Author": "Heisennburg", "ReviewID": "R22SVVU2PVOT90", "Overall": "5.0", "Content": "My main camera is a Canon 20D, and the Nikon S3's pictures aren't quite up to that standard.  But they are better than any point-and-shoot that I've seen. Far better than the Sony 7.2 MP P150 that I sold to get the Nikon.  Focus is always dead on, and resolution is excellent given the small lens. Battery life is very good, the small size is most convenient, and the docking station makes life much, much easier.  The only negative that I've noticed is that the black surfaces show fingerprints; but the camera is available in silver, white and red.  The professional reviews are indeed correct; Nikon has a winner here.", "Date": "January 16, 2006"}, {"Title": "I LOVE IT!!", "Author": "J. McCall", "ReviewID": "R360A6M5YT96EV", "Overall": "4.0", "Content": "I absolutely love this camera. I did my research before purchacing and what I found has held to be true. The flash is the only issue. It is not strong enough to take far away shots. This camera is exactly what I wanted though, a small lightweight camera that takes excellent pictures and I can carry it almost anywhere!", "Date": "April 1, 2006"}, {"Title": "A near-perfect grab & go camera.", "Author": "J. Olin \"Joe On the Go\"", "ReviewID": "R1H3Q9RXONRRN2", "Overall": "5.0", "Content": "All digital camera's force you to make trade-offs...it's the hard cruel fact of personal photography. The Coolpix S3, has been a near perfect grab and go camera for the four photographers in our family. Picture quality, to our eyes, is great! When compared to our Rebel XT or D70 cameras, the S3's shots loose a bit of information but only through comparison to much more expensive equipment. This camera is VERY easy to use for those new to digital photography. The pre-programmed scenarios are easy to access and provide great shots. The camera has proven sturdy, and survived a couple bumps and bruises without drama. We always keep it in the ballistic nylon case, though, to protect the screen.  I'm convinced that many of the problems people cite about the S3 (or S1)are the result of unfamiliarity with using the camera's features more-so than a defect in the camera (save the white-spot issues which we have not observed to date). Red-eye reduction is semi effective but no more than in any of the dozen newer cameras that are in our hobby room. The free online photo editors cure red-eye much better than any of the in-camera solutions. If you're looking for a digital camera that can always be at-hand and deliver a great photo, the S3 should be on your list to check-out!", "Date": "February 25, 2006"}, {"Title": "Beauty is only skin deep", "Author": "B. Smith", "ReviewID": "R2EHB22SRW9OC1", "Overall": "2.0", "Content": "I wanted to love this camera, I bought it to take pictures hanging out with friends and the occasional road trip. The outdoor pictures were great! But once you take that camera inside and the light is low forget about image quality. I tried all the scene modes, this camera just can't compare to other compact cams on the market. The pictures come out blurry, colors blend into each other. Interior lighting causes all kinds of interior blur streaks to appear in the images.I get rave reviews on the looks, but I just can't stand having to tinker endlessly to get a nonblurry inside picture. And for the money, I had a 2 Megapixel Canon that was more capable inside.", "Date": "February 6, 2006"}, {"Title": "Pleased", "Author": "J. Cole \"Hobbist\"", "ReviewID": "R1Z514DUGSKPW2", "Overall": "5.0", "Content": "I have really enjoyed my Nikon S3.  I have a D70 and several 35 mm cameras, but this little fellow fits into my pocket and makes great pictures too.  The pictures are generally very sharp and the color balance is good.  Of course its real value is the ease with which you can take the camera along with you, but I have been pleasantly surprised with the results that it obtains.  You have to be careful with the auto focus, but if you follow the directions from the manual, you pictures will be very good.", "Date": "December 22, 2005"}, {"Title": "Easy and small", "Author": "T. Shields", "ReviewID": "R1P9BUKSONF3H6", "Overall": "5.0", "Content": "This camera really delivers. I appraise real estate and take from 40 - 100 pix a week.  I want a SLR for serious work, but this camera is great for appraisal work because it is so handy. I have a clipboard in one hand and a laser measuring device in the other with the camera in my shirt pocket. I can switch LMD and camera as needed.I was afraid it would be easy to lose but so far so good and I haven't dropped it nearly as often as my Coolpix 4300 which I gave to my assistant.The one annoying feature is the on/off switch. It is difficult to depress and must be held down momentarily to operate. A far better system is a lens cover which slides back from the lens to turn on and close to turn off.  That is the only improvement I would recommend", "Date": "July 30, 2006"}, {"Title": "Cool pics", "Author": "A. Gillett", "ReviewID": "R3FPD0Q82VE7KR", "Overall": "5.0", "Content": "This little thing is perfect for anyone who is looking for a sleek, compact digital camera that will take amazing photos. I took it to Europe and was amazed at the shots it took - portraits, close-ups, landscapes, action, indoor, outdoor. No complaints.", "Date": "May 22, 2006"}, {"Title": "A good buy", "Author": "Alex Balk", "ReviewID": "RV9S5EW40T9J8", "Overall": "5.0", "Content": "The Nikon S3 has proven to be a good buy.  It is affordable yet takes a quality photo.  In addition this camera is easy to use and fits conveniently in a pocket.  This camera has the ranging ability to take both a simple aim and shoot photo, and at the same time complex skill shots that is complemented by computer editing and redeye reduction.  My only complaint is as a result of the user.  If the camera does not have time to focus, then the picture quality suffers immensely. This camera has only been in use for about two months but has not let me down yet!My rating: 9/10", "Date": "March 2, 2006"}, {"Title": "Not perfect", "Author": "Dan", "ReviewID": "R2ZMYXLEAPBSQX", "Overall": "3.0", "Content": "I bought this camera for its size and to take snap shots.  It serves these purposes but has some flaws.  Photos with flash in low light tend to be grainy and dark and the camera is exteremly slow.  I have owned and used several digital cameras includng other Nikons and this is by far the slowest especially when the flash is required.", "Date": "January 3, 2006"}, {"Title": "These cameras are defective within 1-2 years", "Author": "John Gallagher", "ReviewID": "R1PIRALRY824VB", "Overall": "1.0", "Content": "I had the Nikon Coolpix S3 for about 14 months (of course the warranty ended after 12), and the screen went black all of a sudden.  You can still view old pictures, but all new pictures come out completely black.  This is apparently a VERY common problem with Nikons, particularly this model. They have a service advisory for several other Coolpix models to fix this same problem, but not for the S3-S6 models - and Nikon will charge you a significant amount of money to fix it. DO NOT get suckered into buying this camera, or any Nikon for that matter - I was extrememly disappointed with the camera, but especially with their service.", "Date": "May 18, 2007"}, {"Title": "Very good product", "Author": "Esteban Castillo", "ReviewID": "RAB60SDW3R99A", "Overall": "4.0", "Content": "I'm very satisfied with this product. Picture's quality could be a little better, but its features are excellent. Its dimensions are perfect for taking everywhere, and it's very easy to use.", "Date": "March 24, 2006"}, {"Title": "it can happen to you", "Author": "flying-penguin \"flying-penguin\"", "ReviewID": "R3N39HXHH33PTS", "Overall": "1.0", "Content": "Before buying this camera I read all the reviews posted. Most people were satisfied with this product, but a few complained that after a period of time the screen went black and the camera was unable to take photos. I thought that this would never happen to me and bought it anyway. Sure enough durring a fishing trip when I wanted to take photos of the lunkers I was catching the screen went black. I almost threw it in the river. Now I'm careful with my things, especialy sesitive camera equipment, so this was of no fault of my own. Spare yourself the frustration and buy a different camera.", "Date": "September 19, 2007"}, {"Title": "Nice", "Author": "Daniel M. Coppage \"JaJa\"", "ReviewID": "RILON203ESYD9", "Overall": "4.0", "Content": "I love the camera, but you may want to know that Nikon has dicontinued this item. It's been really hard to find replacement parts.", "Date": "February 6, 2007"}, {"Title": "liked other Nikons better.", "Author": "s.m.b", "ReviewID": "R14Q39QK09OE0P", "Overall": "3.0", "Content": "This camera was bought for me as a birthday present in 2006, I told my parents I like the way it looked and I took one previous picture with it in the store. Of course, in the store there are tons of lights on ... almost like you're outside. This camera takes great outdoor pictures but when it comes in indoor, it's not so great. I took this camera with me on vacation to Dominican Republic and I was very unhappy with it. They have a nice light display outside the resort when the sun goes down, so I thought it would make a pretty picture and I attempted to take one. I tried EVERY setting and none of the pics turned out nice. When the camera's flash is off the pics. become blurry, when the flash is on ... the lights seemed as if they weren't even on. Since my trip, I have not cared for this camera and only use it for outdoor pics. when it's light out. Over-all it's made well, and very sharp looking ( mine is white ) and other than the settings not being worth crap, it is a good camera. Very small and compact .. you can take it anywhere fits easily in a pants pocket, purse, jacket pocket. Just recently my two year old has a thing for taking pictures. I left him \"use\" my camera because I was curious to see what was so important that he needed to take pictures of (mostly his toys) and he has a habbit of holding his thumb over the lens cover. After about the 5th time of letting him use it, I now have a lens cover error and sometimes I have to force the lens to open. I know that's it's my fault because I left him \"use\" it, but I did not expect it to happen. Again, over all .. this is a good camera but I would never buy the same product again. I've owned two Nikons before this one and they are good cameras. I'm into photography and take more than 200/month so I'm thinking about switching brands. I asked \"Santa\" for a Canon PowerShot SD1200IS this year so maybe I will have better luck wit it. I read all the reviews and it seems to be a good camera. The reviews are even better then this camera. Wish me luck.", "Date": "December 10, 2009"}, {"Title": "Aggravating!", "Author": "A. Hunt", "ReviewID": "R5R2YQODXWQK0", "Overall": "2.0", "Content": "I initially loved this camera. I don't use my camera that much, but when I do, I expect it to work. I charged the battery the night before I left for a vacation. The next day I took a few pictures and then realized that the battery was almost dead. I hadn't even used the camera but for a total of about five minutes since I last charged it! It was not exposed to any extreme temperatures that would mess up the battery, either. Also, when I try to review my pictures, about 80% of the time, the camera says that it cannot read the card. I have to take out the memory card and put it back in. (even then it doesn't read it sometimes.) If this camera won't even work half of the time, what's the point in bothering to carry it with me?", "Date": "October 18, 2007"}, {"Title": "Too Small", "Author": "Lucky44", "ReviewID": "R2AXM8BTA58KWI", "Overall": "2.0", "Content": "Quality and features are fine, but camera is probably too small for you if you have large hands.  If I use two hands I am fighting to keep my fingers out of my shots.  Because of the shape and weight distrubution I find it difficult to shoot with one hand.  I have a much larger camera (Canon S1 IS) that I often use one-handed with no issues.To be fair, this criticism certainly applies to lots of super small digital cams.  The S3 seems even worse than many others to me though.  Be sure to at least handle one before you buy.", "Date": "May 29, 2007"}, {"Title": "Not good", "Author": "Andrew Marcantonio \"aj1marcan\"", "ReviewID": "R2QVTSKNY0VF9I", "Overall": "2.0", "Content": "It looks cool and it's easy to carry, but that is about it.  Camera is slow and pictures are often blurry.  Sorry I wasted my money on this one.  Get one of the new ones with VR so you don't have that issue.", "Date": "May 17, 2006"}, {"Title": "Excelente, Gran calidad", "Author": "Amilcar Apolonio Hernandez Cruz \"Amilcar Hern...", "ReviewID": "R34V85ZI685BVV", "Overall": "5.0", "Content": "Me gusta mucho esta camara, trae excelentes funciones automaticas y toma fotos y videos de gran calidad", "Date": "September 16, 2007"}, {"Title": "Beware of this camera", "Author": "Stuart Henry Meyler \"S Meyler\"", "ReviewID": "R122T754C6V6X2", "Overall": "1.0", "Content": "I purchased this camera thinking that the reviews I had read and Nikon's reputation for quality were a good indicator that I was getting a multi-faceted ultra compact digital camera. Big mistake.This is one of the worst digital cameras I have ever used. Pictures turn out extremely dark, blurry, or both. I have fiddled with every available setting, and still picture quality is inferior to my 4 year old Olympus 3 mega-pixel that I was replacing!The delay in the picture taking process is painful. If you are tryinig to shoot anything other than a landscape shot, be prepared to have your subjects sit absolutely still or risk blurry pictures. Forget about handing it off to someone unfamiliar with the camera -- they won't be able to get a 1/2 way decent shot off.I have a Treo 650 with a a built in camera that takes better pictures than this sham of a camera.Beware - don't buy it. Look elsewhere.", "Date": "December 1, 2005"}, {"Title": "not what i expected", "Author": "Jan Soleimani \"jason\"", "ReviewID": "R37OF1KEUQTK3O", "Overall": "1.0", "Content": "the nikon camera s3 is a good camera but the camera takes to long to take a picture i dont like it because when i am at a party i want to take a fast picture. it sucks and i wish i never bought it dont make the same error i did and waist my money on the piece of junk.", "Date": "February 23, 2006"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B000B8Y08E"}}