{"Reviews": [{"Title": "Who's There?", "Author": "S. Brady", "ReviewID": "R1QIKSWHX3DHYL", "Overall": "2.0", "Content": "Tired of running to the front door only to find a religious fanatic or cable company salesperson ready to pounce?  I was seeking a device that could screen out these disturbances at an affordable price.  Seaching, I found this Q-See audio/video doorbell priced at only $90.00.Setup was a breeze although I eliminated the 6\" hood which stuck out to far. The AA batteries included were weak so I replaced them.  The battery compartment is confusing; markings hard to read and the normal battery layout with the spring at the negative end was not followed.  Incidently the instuctions were to say the least, vague.  Mounted camera/intercom on front door ( steel clad ) and receiving unit in entertainment room about 60' distance.  Video was clear with a bit of static in audio.  The doorbell button is small and gray with the picture of a bell, very hard to spot so I applied labels over and under button to highlight location.  When someone presses button a \"ding-dong\" is susposed to sound and the monitor to activate.  The \"ding-dong\" only lasted a couple of tries but the monitor does automatically activate.  You can hear your visitor and talk by pressing the talk button on the monitor.  Note: monitor is really light weight and needs rubber feet otherwise it slips when using controls.  Speaking with your visitor, the monitor/speaker shuts off after about 20 seconds whether your speaking or not.  However, you can easily turn it back on.  System is not well made as you might expect being from China.  No warantee information or company address is supplied other than the web address listed only on the box.  However, this said, I can't tell you how pleasing it was yesterday telling a door to door salesperson I was not interested without getting out of my chair watching TV.  I should state that I am disabled and getting to the front door from the back of the house takes me awhile.CONS: 1.Doorbell/activator is hard to notice. 2.\"Ding-dong\" gone. 3.Shuts off to fast even though talking. 4.Lack of written warantee or company address. 5.Monitor slips when trying to press controls.PROS: 1. Reasonable cost. 2. Clear video and audio reception. 3. NO WIRES TO HOOK-UP. 4.Eliminates hurrying to front door to find someone I didn't want to see and lets friends know that I am on my way to the front door.  5. Able to view front area by turning on monitor/camera manually. 6. Security, sees in the dark.This item is just what I wanted, just wish it were better quality.", "Date": "October 20, 2006"}, {"Title": "Could never get this to work", "Author": "Ira A. Thompson", "ReviewID": "R15278JM0FR19M", "Overall": "1.0", "Content": "I couldn't get the camera to work on the first one, which I sent back for a replacement.  The camera didn't work on the second one either.  Save your time and money.  I'm see looking for a wireless system that works.", "Date": "August 24, 2008"}, {"Title": "Item is Horrible - Expected much more for that kind of money", "Author": "J. Sexton", "ReviewID": "R2935R7FB7SFW0", "Overall": "1.0", "Content": "When I got this item I was very disappointed. DO NOT BUY unless you like a cheap electronic imposter.", "Date": "January 9, 2007"}, {"Title": "My experience", "Author": "Poohbah of the Piedmont \"Stumpjumper\"", "ReviewID": "R38NQ72WRRLAHN", "Overall": "1.0", "Content": "Unit looked well designed and should have served it's purpose, however I set it up to test before installing and the battery's were dead (no big deal), I installed new battery's (according to the pole positions indicated on the battery compartment - the unit (camera) did not work. I double checked and went through the drill again with the same results. So, I repacked the unit and returned it for refund (which I received).Note: The pole labels in the battery compartment do dot match up with the embossed pole positions (Hmm!).In any event, the unit does have desirable features and installation would be a no-brainer, however, in my opinion, there needs further engineering to ensure proper operation.Thanks for your time:Andy", "Date": "November 14, 2009"}, {"Title": "Q-See Wireless Door Intercom and Video", "Author": "Essie Gillard \"Essie Gillard\"", "ReviewID": "R3049L3317CHKC", "Overall": "1.0", "Content": "I have received two of this item and neither one of them worked.  The directions are contradictory with labeling. As an example:  instructions state to insert 6 AAA batteries when only AA batteries will fit.  The plus and minus labels in the battery department are oppisite the stamped area in the compartment.Bottom line - I have not received a working unit, therefore, I can not testify as to the quality of one that works.", "Date": "July 31, 2008"}], "ProductInfo": {"Price": "$129.99", "Features": "When visitor rings the doorbell, the image of the visitor appears on the monitor. Two-way conversation between visitor and attendant\nAble to monitor activity outside any time\nAutomatic shut off features\nBuilt-in night vision in camera\nTransmits over 300 feet in the line of sight", "Name": "Q-See QSWSSB 2.4GHz Wireless Video Doorphone System", "ImgURL": "http://ecx.images-amazon.com/images/I/41L5K1sYtHL._SX300_.jpg", "ProductID": "B000B6JQA8"}}