{"Reviews": [{"Title": "Faster and Finer", "Author": "LobstahLovah", "ReviewID": "R2DMUL5B2EUXNB", "Overall": "5.0", "Content": "I owned the predecessor to this camera, the DSC-T1, for 1 year but dropped it in water last week and killed it.  I tried drying it out for a few days but when I plugged it into the charger it just got overheated.  I liked my DSC-1 and had paid $500 for it so when I was shopping and comparing cameras I was happy to see that Sony upgraded to the DSC-T5 with many improvements in the last year.  I got this almost as soon as it hit the stores and paid $345 - more technology for a cheaper price.  Here are several reasons I chose this camera again over higher MP rivals and brands:1 - I love the slim, sleek design and the large 2.5\" viewing screen which is larger than most cameras, large or small, provide.2 - The Carl Zeiss lens takes a very crisp, clear picture with 5.1 MP but you must make minimal adjustments to the built-in configuration with the camera once you take it out of the box.  Otherwise, you will see darkened and blurred photos if you use the factory settings.3 - This camera practically fits in the palm of my hand and it does fit into a  shirt pocket or a back seat jeans pocket to go anywhere, and it does go everywhere with me.  I do not recommend the back seat pocket though. You can also use the supplied wrist strap for portability (and safety) and you should definitely buy a small, padded protective case.4- There is no pop out lens, you just flip down the small plate on the face and you have instant power, ready to snap a pic in 2 seconds.5  - The movie length is only limited to the size of your memory card, unlike most camera that have more MP but are limited to 3 minute movies.  Good for when I want to film speeches or mini-movies such as: my 2 nieces having a watermelon eating contest.  A 1 GB stick = 12 minute movie.  I paid $75 for a 1 GB stick and there is a 2 GB available so far (SanDisk makes a compatible version of the Sony stick and SanDisk is almost half the $)6 - Even though I killed my DSC-T1, the battery, memory, adapters etc are compatible so I can use them all with the DSC-T5 EXCEPT the docking station from the T1 does not fit the T5.7 - The DSC-T5 has a faster shutter speed - THANK GOD - because the only think I disliked about the T1 is that, by the time I hit the button to take the picture, there was a 3-4 second delay between the flash and the actual picture being taken.  Most people lost their smile thinking that the flash meant the picture had been taken.  Sony fixed that problem with the T58 - I seriously considered buying a camera with 8, 10, or 12 MP and pretty much decided on the Canon EOS Digital Rebel because a friend who is a professional photographer has it and he loves it, even better than his Nikon.  The Canon shutter speed is much faster and I will probably buy it later when I am ready for a professional camera.  However, the Canon is bulky and this Sony is so small and sleek it goes everywhere with me, is very light and I love the compact design.  I have a small leather pouch that I had with my T1 and the T5 fits fine.  It clips on my belt or I throw it in my purse and I am out the door. You can not do that with the Canon Digital Rebel. Make sure to get a camera bag for this camera, it is very delicate. My leather one was $25, it clips on my belt and it holds the camera, extra memory sticks and an extra battery.9 - The T5 is lighter than my T1 was but the ONLY things I would change are . . .  had to be something right- the camera body on the new T5 is very shiny and glares like a mirror in sunlight.  The old T1 had a flat silver surface and no glare.  Another thing I wish for is - you can not use zoom while in movie mode, but it has a great zoom while in picture mode.  The movie screen size can be adjusted and yes, the movie is a little grainy but you see and hear people from 15 feet away with no problem.  I would also like to plug the camera into my laptop and store movies directly to my hard drive rather than transferring them later via the supplied cable.  However, transfer time from camera to PC is very fast with the supplied USB cable and software and the cable will also plug into your TV for a slide show.10 - If you have patience, the next generation of this camera is due to hit the shelves in Jan 06 and should have a 6 MP with a flat black body option- much like the RAZR.  Should be other improvements that Sony is just releasing and you can get the latest on that from the Digital Camera Review website where I get valuable info (I swear - this is an independent review - I do own this camera and I do not write for anybody)  [...]Overall, I like this camera for its convenience and 5.1 MP delivers a very nice photo quality picture.  Great convenience.", "Date": "October 27, 2005"}, {"Title": "Who says bigger is better?", "Author": "J. Wunner", "ReviewID": "R1CG1A9F2E28X0", "Overall": "5.0", "Content": "Inside this tiny little camera is a digital photgraphy powerhouse.  My ONLY complaint is you cannot zoom while taking movies.  Otherwise, the camera takes beautiful pictures (using one of many settings) and you can even take pictures in a widescreed HD format!  The 2.5\" LCD screen on the back is so large, you can see every detail of your pictures as you take them.  And the biggest plus, your length of movies is limited only by the size of memory stick.  If your memory stick is 1GB, you can take one continuous movie using the entire memory (About 14 minutes, depending on subject movement, lighting etc.)If you use a digital camera for auction purposes, the magnifying glass setting will capture the smallest of detail for super close up photography.An excellent camera for the price.  Don't hesitate, you will be very pleased.", "Date": "November 22, 2005"}, {"Title": "Great Camera", "Author": "Average Joe", "ReviewID": "R2CAPSSDWI97P4", "Overall": "5.0", "Content": "This camera really takes good pictures. It is so small and light that it goes just about anywhere. Sony really did a nice job with the Lithium battery. It's one of the few that actually tells you the time you have left to take pictures.The only thing I could find wrong with this camera is the movie feature. While the sound is good the image is grainy.", "Date": "September 27, 2005"}, {"Title": "Love the camera-- media it takes in tech description above is wrong", "Author": "George Rabatin", "ReviewID": "RJTEGFBDR6VJG", "Overall": "5.0", "Content": "In the technical specifications above, it says that this camera will take \"Memory Stick PRO Media\". It will not. It will only take \"Memory Stick Duo\" and \"Memory Stick Pro Duo\" memory (the 1/2 size little Sony memory sticks) -- such as this part number: SDMSPD-1024-A10Love the camera.", "Date": "October 11, 2005"}, {"Title": "slim and sexy", "Author": "nagase", "ReviewID": "RZEQSAV57M2CB", "Overall": "4.0", "Content": "the online pictures do not do this camera justice... the black color makes it quite elegant, and the combination with silver and the svelte body is downright sexy.  Sony has always been known for their design edge, and the T5 does not disappoint.  the 2.5\" LCD is large and bright, updates instantaneously with movement, and shows lots of detail; the matte coating helps the viewing under bright lighting.  the operation of the camera is simple, because Sony has put very few buttons on the camera itself (most of the options will be via the internal menu).  by the way, changing shooting options are updated live via the screen, so it's nice to get a glimpse of how that photo will look at EV+7 vs EV-7.with any camera, the most important part obviously is the actual quality of the photo.  with the T5, you're getting 5mp of very nice, clear photos.  however, cameras with the internal zoom design tend to produce softer looking results, and T5 is not excluded; this means that at 100% viewing, the details are simply not as sharp as some of the cameras that use an external zoom design.  (keep in mind that the tradeoff is very fast start-up times, slim and small body, and less \"conspicuousness\" -- nothing screams \"tourist\" more than when those zoom lens start popping out.)  but 70% and below, the pictures become very sharp and clean, and realistically, no one is buying this camera and expecting to use the photos without resizing, so the lens design can't really be considered a flaw.  that said, 8x11 prints are very do-able with this camera.  the colors are very natural, though perhaps comparatively cool if you look at Nikon or Canon (it's a matter of preference); if you'd like warmer photos, you can boost the saturation inside the camera menu.  under less than optimal conditions (ie, indoors), camera shake becomes a problem, especially with today's diminutive models.  T5 doesn't have a image stabilizer, so getting sharp photos indoors can be tricky, and the softness problem (from lens design) gets worse at the same time.  i've figured out 2 ways around it.  one, you can depress the shutter button completely at once (not the half press focus, then full press shoot); the camera will quickly focus and take the photo, and since you're using 1 motion, you decrease the chance of hand movements.  the other is to use Burst mode: take 3-4 photos at once, then choose the best.  using this latter method, usually 60-70% of the results i get are quite sharp and suitable for printing.camera buying today is tricky business; you can't go by just the brand, since even famous makers produce flops (eg, Nikon's S series take pictures that are notorious for their blurry corners despite the reputation of the maker).  the Sony T5 does not disappoint overall, because it doesn't have that many flaws; except for the lack of an image stabilizer, it has all the features a point-n-shooter (and even more advanced photographers needing a 2nd camera) will want and handles almost all lighting situations well, producing clean, pleasing results.  at the end of the day, a camera is only as good as you learn to operate it; learn the weaknesses of a particular model, figure out how to bypass it, and you'll get great results everytime.  with that said, in terms of pricing, design, and photo quality, it doesn't get much better than the T5; you'll not only get good photos, but look good taking them too.", "Date": "May 15, 2006"}, {"Title": "Perfect!!", "Author": "Ryan Urban Olsen", "ReviewID": "R1C32DF5VF3STP", "Overall": "5.0", "Content": "I couldn't ask for a better camera!-It's just about the same size as my phone, so it fits in my pocket to go anywhere-Takes INCREDIBLE pictures!-The features are handy and easy to use-The video capture is easy to use and playback on the camera includes sound", "Date": "March 26, 2006"}, {"Title": "THIS LITTLE CAMERA IS AWESOME!", "Author": "PJ", "ReviewID": "R30PUJLLIMCUPU", "Overall": "5.0", "Content": "I LOVE this little camera.  It takes great pictures, is user friendly, & compact.  The pictures are very clear.  I took it to Vegas the first week i got it and took pictures at the National Finals Rodeo and they turned out perfect. It was dark, and the zoom and the flash worked perfect for perfect pictures.  I rate this camera a perfect 5!", "Date": "January 8, 2006"}, {"Title": "Great camera for someone on the go.", "Author": "Vasken Choubaralian \"Kinavo\"", "ReviewID": "R1AEWCVI90X04F", "Overall": "5.0", "Content": "This camera has all the features for someone who is on the go, likes to take pictures sporatically and spontaniously.  It can fit comfortably in your back pocket and with a flick of the front cover, your are ready snap! You can enjoy your pictures with others with this huge screen.  Great pic quality, a lot of useful options, good battery life and an abundance of internal memory.I highly recommend this camera, even for a little more serious photographers. It has almost all of the same options as \"professional\" cameras.The only negative: Cannot charge battery without removing from the camera.  Would be nice if it can be charged from the available USB cord using the computer.", "Date": "July 31, 2006"}, {"Title": "Red eye!  Poor dim-light photography!!", "Author": "__Alessandro__", "ReviewID": "R4E85UV7TXZ94", "Overall": "2.0", "Content": "I own many Sony products, including a Sony Cybershot DSC-F717, which I love. However, I am very disappointed by this camera, the Sony Cybershot DSC-T5.I bought the T5 for my mother and father as a present. It is small, lightweight, portable; easy to use; and stylish. It does take nice photos in brightly lit environments, especially outside.However, after several months of use, a few problems have become consistently evident:(1) There is HORRIBLE red-eye (and white-eye) artifact in MANY pictures. The so-called \"red-eye reduction\" setting does nothing.(2) Dim-light photography is very grainy, with lots of noise. Night-time photography is impossible.These problems are not unique to our camera... You will find many corroborating reviews above.Overall, I am VERY disappointed in this camera, and wish I could exchange it for something else.Do not buy this camera. Other reviewers suggest the T7 or T9 take much better pictures (and they are still small pocket-size cameras).", "Date": "December 30, 2006"}, {"Title": "Red eyes and blurry pics", "Author": "D.Mac", "ReviewID": "R1Q9V10QZRVJ1F", "Overall": "1.0", "Content": "I owned the T5 for approximately 10 days (at the time it was still $350).  I absolutely loved the styling, features and size of this camera,it really is a beauty.  Unfortunately I was unhappy with the pictures.  These super compact cameras are hard to hold very steady and about 25% of the pictures I took would be blurry to some degree.  Indoor pictures tended to be grainy unless the room was brightly lit.  Night time pictures were almost impossible to shoot clearly.  Red-eye was a huge problem in all settings.  Outdoor pictures looked great--This camera does have some nice qualities, but for the price I felt like the camera should have performed a little bit better.I purchased the T9 instead and have been very pleased.  It is everything I wanted this camera to be.  Clear pictures, good indoor quality, good low-light and no flash capability.  Also beautifully styled and about the same size as the T5.  It is 6MP to boot.I realize the T9 is more expensive, but I believe the improvements were well worth it.  I'd either spend the extra to get a camera that really performs, or go with a different camera in this price range.  You pay a lot for the Sony brand (for good reason - Sony is great!), but this one didn't really deliver in the experience I had.", "Date": "August 2, 2006"}, {"Title": "Great Camera!", "Author": "Patrick Yen", "ReviewID": "RREHVD9L1KBBH", "Overall": "5.0", "Content": "I love this camera. Overall, this camera takes very crisp and clear photos, even for fast moving objects and macro shots. Some pictures were a little on the soft and blurry side but this was quite rare.  The video quality is also superb.  It has many nice features, effective red-eye removal (I havent seen any red eyes in my pictures yet) easy-to-navigate menus, big bright LCD, long battery life, and it's made in Japan, so the build quality is excellent.  Not to mention it looks really sleek.", "Date": "July 15, 2006"}, {"Title": "Good camera for the purpose that it serves", "Author": "S. Kasper", "ReviewID": "R35ZOF2RKBVBZJ", "Overall": "5.0", "Content": "I have had this camera for a little over 3 months and have not had a problem with it so far, mechanically.  I bought this camera to use for quick snapshots for emails, and the camera is perfect for this purpose.  I do agree with previous reviews that pictures turn out blurry at times, but I've only seen this on the low light settings.  To prevent blurring, I just leave the setting at automatic and the shutter speed is more than sufficient to produce clean pictures, and the pictures turn our just fine. I have used the low light settings with the camera on a tripod, and the pictures have turned out great.I would recommend this camera if someone is in the market for a ultra compact, easy to use camera, since the quality and the pictures are good.  There's one additional bonus about this camera - since it's so small, I find myself bringing it to more places, and using it quite a bit more than I would have with a larger camera.", "Date": "July 10, 2006"}, {"Title": "Excellent clarity on pictures...HORRIBLE RED EYE!", "Author": "L. Peerenboom \"awkwardchair\"", "ReviewID": "R5M8F199UW0TT", "Overall": "3.0", "Content": "I'm really enjoying this camera, as I have a brand new baby and love taking pictures of him. I love the large viewing screen, the compact size, and the sleek look. And all of the pictures I've developed from the camera have excellent clarity. However, the red eye is absolutely HORRIBLE on this camera. The so called \"red eye reduction\" feature does NOTHING. I thought perhaps this was an issue only when photographing my son because his newborn eyes weren't fully developed and that maybe the pre-flash that's supposed to eliminate the red eye wasn't effective on his eyes. But I soon found out that no matter who I photographed, 95% of the time they looked like little devils in their photographs. This also has no bearing on the lighting, whether you shoot during the day or night, indoors or out. Unfortunately I purchased this camera from butterflyphoto.com (at a great price, around $218) but their return policy is a whopping 14 days and EVERYTHING has to be packaged originally if you return it (the plastic, everything). So I can't even exchange it. That's just me being whiny though and not wanting to admint that I didn't read the return policy before purchasing :). BUT, the point here is that this is a great little camera, I love it, with the exception of the horrible horrible red eye issue.", "Date": "July 5, 2006"}, {"Title": "Sony Cybershot", "Author": null, "ReviewID": "R1KGK6OKSSP06E", "Overall": "4.0", "Content": "This is a good camera, that takes good pictures.  I wish it had a photo lens in addition to the digital screen.I would recommend this camera to anyone.", "Date": "August 11, 2006"}, {"Title": "I love my camera", "Author": "P. Joyce", "ReviewID": "R2SS8MBUM5KZ09", "Overall": "5.0", "Content": "I love this camera! It is easy to use and takes great pictures. I love the large screen on the back and the zoom is so clear. Also this camera is so tiny! It is the same exact size as the Razor (cell phone) when they are close. I can fit it in my pocket so it is great to bring out.", "Date": "June 27, 2006"}, {"Title": "Great Camera", "Author": "Melissa Jones \"Melissa Jones\"", "ReviewID": "R23GJHJJBAN7LI", "Overall": "4.0", "Content": "This camera is cute and trendy. It's light and compact and has a nice 2.5 lcd screen. I have one complaint about it though...You have to be careful not to press a certain button, it makes all of your pictures blurry! But as soon as you press it again, the pics go back to being bright. It took my husband and I a good 15 minutes to figure out why this was happening. So if you do purchase this camera, be careful and dont give up on it if your pictures are blurry...play around with it first! All and all i love this camera! I would suggest buying the sony dsc-t5 case that fits the camera perfectly so that if you carry it in your purse it doesn't turn on! ALso you need to buy a memory stick pro duo with this camera because with the internal memory i was able to take only 15 pictures, which is normal for most cameras.", "Date": "August 29, 2006"}, {"Title": "Fabulous!", "Author": "Stephanie Packard \"Photo Ready\"", "ReviewID": "R25QITHLF76581", "Overall": "5.0", "Content": "It's better than I thought.  Small, compact, easy to use, well-made, not plastic, great big screen, great pictures.  Love it!", "Date": "August 1, 2006"}, {"Title": "not bad for point and shoot purposes", "Author": "Qasim Mohammad \"AQMAISNIAME\"", "ReviewID": "R1WFFH2EZKSHHW", "Overall": "3.0", "Content": "Although this camera is easy to use and result is pretty good but I found it a little hard to handle. Sometimes finger will come infront of the flash without you even noticing and causing a poor picture. If you tend to avoid that then be very careful as it may slip out of your hand.I found the flash is not very strong compared to my previous camera canon SD400. The camera doesnt have a zoom function when making video which I thought I wont need it but then later regretted it a bit.", "Date": "July 26, 2006"}, {"Title": "Very Nice Camera", "Author": "Digital Photographer \"Used to Like Nikon,s\"", "ReviewID": "R3TTUXVT566P5V", "Overall": "5.0", "Content": "I originally bought the 9, great camera, but for some reason I find using the 5 very comfortable, it focuses much faster then the 9 , yields great shots, see no difference in the photos that are produced between the 5 and the 9, both excellent machines, sharp lens, great color and yields excellent movies, even of fireworks at night, I think the only significant difference between the 2 is that the 9 has image stabilization and the 5 does not, guess whatever suits your purpose is best, I noticed one reviewer criticized the 5 because the image stabilization did not work well, to this reviewer, the 5 has no image stabilization.This is a neat camera, tired of lugging around SLR,s.Sony doing a great job.", "Date": "July 24, 2006"}, {"Title": "Excellent, if light weight is your highest priority", "Author": "S. Su", "ReviewID": "RKS7ROYKDZR05", "Overall": "4.0", "Content": "Reference Price:2005/11 2602006/05 2502006/06 2302006/07 200I have had a Sony T5 for almost one year.  Following are my opinions.Pros:1. Small Size, Light Weight: T5 is a very handy camera.  You can put it in your pocket easily without any feeling.2. Long Battery Life: The battery can last for more than 100 shots under auto mode.3. Decent 4X6 Printed Picture Quality.4. Good Residual Value: T5 is still hot in auction.5. Easy to Upload the Pictures to PC:  There is a USB cable in the box.6. 32MB Installed Memory: You can have 30 more pictures under 3 MB picture quality.  It is quite enough for a one or two day trip.7. Eye-catching gift.8. Easy to UseCons:1. Picture quality is just ok.2. No stabilizer; need some practice to take clear pictures.  (T9 & T30 have stabilizer.)", "Date": "July 20, 2006"}, {"Title": "Indoor pictures are bad", "Author": "P. Kumar", "ReviewID": "R5FAPRWTLCSL0", "Overall": "2.0", "Content": "The good thing about this camera is that it has got the cool looks. I was buying it for my parents and the first impression was very good. But when we used it, the day time pictures were just okay and night time pics were very bad. Red eye is horrible even after enabling the feature.The screen is big and useful but again, for indoors, the display is very grainy.Going to return it today. Suggestions - Do not buy unless return policy is good.", "Date": "July 14, 2006"}, {"Title": "Excellent Camera", "Author": "gogglezp", "ReviewID": "R3UFPNF6HTS0SI", "Overall": "5.0", "Content": "This camera is great, I love its compact size, its high quality pictures and its 2.5 inch screen. When using flash almost 95% of your pictures come out clear, however sometimes when not using flash, some pictures come out blurry unless you're really steady. However, it might be just me not using the proper settings. You might be better off getting the DSC T9 for its image stabilization feature, however if you want to save some money, this model is still an excellent choice!", "Date": "June 26, 2006"}, {"Title": "Perfect camera", "Author": "Jennifer A. Koren \"Jen K\"", "ReviewID": "R3GERG0EMBKP4T", "Overall": "5.0", "Content": "This camera is fast and easy to use.  I love that it fits in my purse so I can keep it with me just in case a photo op presents itself!  If you buy the memory card, it has a HUGE amount of memory, and the battery lasts a long time too.  Love the big screen on the back.  Takes incredibly clear pictures.  My boyfriend bought it for me for Christmas last year, and I think I'll be buying one for him and for each of my parents this year!", "Date": "June 15, 2006"}, {"Title": "I like the product but the supplier cheated me.", "Author": "Richard Koomjian \"love to read\"", "ReviewID": "RQNRTO75VL7HO", "Overall": "2.0", "Content": "I like the camera, but I bought it used.  The camera was advertised as used but in good condition.  When I got the camera I found that 40% of the display screen is black when the camera is cold.  It was too much trouble to return, so I'm living with this defect.Also, the special USB cable needed to upload pictures to a PC was NOT included with the camera (even though it is supplied with the camera when sold new).  Big omission that I had to correct by buying the cable separately.", "Date": "October 16, 2013"}, {"Title": "my  beautiful song camera", "Author": "Sarah .M", "ReviewID": "R29DCBT1EODAKK", "Overall": "5.0", "Content": "i loved  it it came  before  it  is time  in a  great  condition just  as  was  described every things  included  i can not  ask for  more  i highly recommended for  any person want  something nice and  not expensive.thank you so much  i will definately  order fro them  again", "Date": "December 26, 2012"}, {"Title": "Sony Cybershot", "Author": "Glaric \"Glaric\"", "ReviewID": "R38CXI8AD91QRH", "Overall": "5.0", "Content": "I had an excellent experience with this seller.  My merchandise came sooner than scheduled and in excellent condition.  I would definitely transact business with this seller again.", "Date": "November 18, 2010"}, {"Title": "This camera was worth replacing", "Author": "Marcia S. Anglarill \"worldshopper\"", "ReviewID": "R2XRE1U1L8H79O", "Overall": "4.0", "Content": "I lost this camera on a recent trip after having it for about 5 years.  It's served me well and produced lots of great shots.  So when I lost it I immediately sought to replace it rather than go for a new model.  Glad I was able to find an exact replacement at a reasonable cost.  The only thing missing now is the leather case that came with my original one. I highly recommend this Sony cybershot.", "Date": "April 1, 2010"}, {"Title": "Beloved Camera Missed", "Author": "A. Liu", "ReviewID": "R19ED4LKS24V7E", "Overall": "5.0", "Content": "I have owned this camera and loved it until it was stolen from me. I love it so much, I am going to buy it again, even though there are advanced models available with higher MPs and zoom. The new model (DSC-T300 which is touch screen) is not anywhere near as lovely as the T5. It was much sleeker and slimmer- beautifully designed. I was disappointed in Sony for not replicating the design because to me, it was perfection. I have gotten so many compliments for the T5 and it had always worked well- no complaints on the quality despite being only 5MP. This camera is the love of my life.", "Date": "May 22, 2009"}, {"Title": "older dsc-t5 5mp for $85", "Author": "Alexi Agramonte", "ReviewID": "R1NHDH9I8MG3O6", "Overall": "3.0", "Content": "only reason I purchased this was because mine broke and I had already purchased a water proof case for it at for $75. otherwise I would have purchased a newer model for a few bucks more. good camera but newer models do better things for just  little more $$", "Date": "March 11, 2009"}, {"Title": "my digital camera/ sony cyber shot", "Author": "B. Zamora \"boss ladii\"", "ReviewID": "R3B0OE3QQ8UQ33", "Overall": "4.0", "Content": "The camera was in incredibe condition. Despite my doubts of shopping online, Amazon.com proved me wrong. The shipping was most expedient as well and i will be  shopping here again.", "Date": "August 8, 2008"}, {"Title": "It's cute - but that's it", "Author": "Leo12", "ReviewID": "R40N5ZCL4SH57", "Overall": "2.0", "Content": "LCD screen became blur after 3 months of use. Can never take a good picture in door. Red eye reduction function is just for fun.I don't give it 1 star because it's still usable outdoor.", "Date": "April 14, 2008"}, {"Title": "DOES NOT WORK IN NIGTH", "Author": "Kunal", "ReviewID": "R4UFPCH5H46EZ", "Overall": "1.0", "Content": "Guys,This model does not work in the night. If you will try to take snaps in the night, you will get just a dark background only. Even if the object/human has full light in the night,dscT5 is not able to take snap.(Look at CNET for its reviews and comparision )Very poor battery life, last only for 1.5 to 2 hrs.Moreover in auto mode its take good picture, but if you customize your mode to night/beach or other mode it gives you shaky image.Works perfect fine in day light/specially in sunlight.Final work don't take this, rather go for some other model.", "Date": "April 14, 2008"}, {"Title": "Digital camera", "Author": "T. Hunt", "ReviewID": "R33A9QVCH4BRU1", "Overall": "5.0", "Content": "I really enjoy this digital camera.  Its perfect handheld size makes it easy to use and it takes wonderful highdefinition pictures.", "Date": "February 8, 2008"}, {"Title": "Just Okay.", "Author": "Kesha Richardson", "ReviewID": "R2BQ3OZIQXYWSG", "Overall": "2.0", "Content": "I own this camera also and paid around $400.00 for it.  To me, that's a good deal of money as I am not a professional photographer but still desire to have great family photos!  I agree with most of the previous reveiewers.  This camera takes okay pictures.  In fact, the daytime pictures are great.  It's impossible to get a good night time shot though, especially photos of fireworks, etc.  That was really dissapointing.  The shutter speed is also too slow.  My kids are already moving to the next thing before the camera flashes!  For the money, this product is not impressive.  I expected much more out of Sony.", "Date": "October 29, 2007"}, {"Title": "I wanted to like this camera!", "Author": "carol in austin", "ReviewID": "RX1O3XJAUYNY9", "Overall": "2.0", "Content": "I fell in love with the size and the sleek look of this camera but success with it has been extremely unpredictable.  I never know when I'm going to get good photos.  The delay is very long.  There is obviously no stablization feature with this camera.  If the lighting isn't just right and you do not hold perfectly still and your subject isn't completely inanimate - there is a  high risk of a blurry photo.  Oftentimes I check it in the viewer and it will seem okay - load onto computer and it will be just blurry enough to be unacceptable.  Red-eye is a problem - I don't know why there is even a feature which is supposed to address this.  I'm either going to go back to my SLR or purchase a new Canon with image stablizer.", "Date": "October 24, 2007"}, {"Title": "Super Cute but that is about it.....", "Author": "shammock", "ReviewID": "R1R0EI0GYB0EWY", "Overall": "3.0", "Content": "I purchased this camera about a year ago at Best Buy. I am not much into taking pictures but I have two little ones and everyone was nagging me to take more so I got this camera after very little research.  It is very stylish and super small and I do take it everywhere.  I found that my finger gets in the way when I take a picture and the front piece slides up and shuts the camera off.  The camera does take good quality pictures when I can get a picture.  Not sure if it is just my camera or all but the shutter delay from the time I depress the button is 15 SECONDS!!! Anyone with small children knows that you will miss many cute smiles with that long of a delay. For the price it is now, it is a good camera, I paid 350.00 and I am wishing that I waited and purchased the Nikon D40 which is what I am going to get soon.", "Date": "August 4, 2007"}, {"Title": "Perfect!", "Author": "MD", "ReviewID": "R17MURT41XN3DM", "Overall": "4.0", "Content": "I've had this digital camera for almost a year. It's the fourth camera I've owned. I spent quite some time searching for a compact camera that I could carry everywhere. Being an amateur photographer (and mostly taking pictures for myself and not others), I didn't want to lug around an extra bag just for my camera. It fits discreetly in your pocket or a small purse (for formal nights out). The size and weight of this camera is its best feature, and this carries through to the newer generations of this camera, too.This has been the perfect camera for everything from selling items on-line to landscape scenery. My pictures have always turned out beautifully, with wonderful color and crispness. I have discovered that the \"automatic\" lighting feature is not always the most ideal, but you can re-program just about anything on this camera.It's really quite a good camera, and given its price these days with the newer generations out there, it's a steal.", "Date": "April 13, 2007"}, {"Title": "A steal at today's prices!", "Author": "Vanessa M. Smith \"snowtoes\"", "ReviewID": "R5Q9OEC4QJS14", "Overall": "5.0", "Content": "I simply love this camera.  I have been using for over 1 year now with no issues or problems.  However, you must learn to use the functions properly for optimum photo quality. Auto setting are great. Many of my photos look like professional portraits.  Everywhere I go people want to check it out.  Wouldn't trade for another. And I paid a high price when it first came out.  So at today's prices it is WELL WORTH the money!", "Date": "December 1, 2006"}, {"Title": "Great small camera--accessories add cost though", "Author": "Nocturnal", "ReviewID": "RPUIUI512SUP5", "Overall": "4.0", "Content": "I had a Nikon Coolpix which was small but too big to shove into my pocket so I bought the Sony.  I love that it's small, had to get used to making sure my fingers were not within the lense view.  Extra battery and memory sticks will run up the cost (but that goes for any digital camera).  It's easy to use since I'm not much of one for reading the instruction books yet have been able to figure things out fairly easily.  I don't do movies so can't comment on that but straight photos turn out really well (which surprises me since I've always been a really lousy photographer).  I like that I can carry it with me all the time, which I do.  I do wrap the whole camera in a small cloth envelope so the LCD doesn't get scratched up.  And I added a neck lanyard usually used for a computer flash key so I can wear the camera around my neck or wrap the strap around my hands just in case it slips out of my fingers--camera is so lightweight.  The only complaint I have is that the shutter door, which slides effortlessly to turn on the camera, slides effortlessly even when you don't want it to.  I've used up the battery many times while the camera was sitting in my pocket (so I always carry an extra battery with me).  And extra plus is loading the pics onto the computer is a breeze (no extra software needed, just the cable that comes with the camera).  There is still a slight delay between depressing the button to take a picture and when the camera actually takes the picture but it's not as bad as the Nikon.  I assume the newer versions of this camera have only gotten better.  Well worth the money (I just wish I could lock the shutter cover).", "Date": "November 28, 2006"}, {"Title": "Good camera", "Author": "Charles Ptacek", "ReviewID": "R26IT9QXWH9QAZ", "Overall": "5.0", "Content": "It's everything i expected, works great and Amazon's partner service was very good", "Date": "November 9, 2006"}, {"Title": "Little. Cute. Decent Photos.", "Author": "Kelsy Yeargain \"Kelsy Yeargain\"", "ReviewID": "R2Z3KTTECY1X3D", "Overall": "4.0", "Content": "If you are looking for a good small camera, and have no intentions of being ansel adams, this is a good camera choice. I travel alot, and this camera is perfect because it can fit in my pockets or a small purse. It also takes pretty good pictures.", "Date": "November 3, 2006"}, {"Title": "stellar.", "Author": "C. Osbahr \"design student\"", "ReviewID": "R14CW7XA4GO8AT", "Overall": "5.0", "Content": "After springing for the Cybershot in August so I could have a compact camera I would actually TAKE places, I've been very, very pleased.The last camera I had was an older Sony DSC that was quite bulky, ran on batteries, and had shutter problems--but it took great quality pictures and the interface and features were perfect, so I thought I would go for the DSCT5, since it avoids ALL of those problems. Only a tiny battery to charge, no sticky shutter... and it's sexy as hell. The screen is huge and very bright.I hate taking pictures with flash in general, and I find that the flash makes nasty redeye more often than not with this camera. (And the camera gives you the impression you cant change shutter speed or anything) However! You can easily change this by going into the over/under exposure options and under exposing your photos when you are in dark environments. They come out surprisingly well and blur-free.", "Date": "November 3, 2006"}, {"Title": "Great! Awsome!", "Author": null, "ReviewID": "R1LD2U5VEHONAF", "Overall": "5.0", "Content": "My Grandparents have one and love it. Its very easy to work. Takes great pics. Its also easy to share your pics on the TV.They love it I love it.", "Date": "September 5, 2006"}, {"Title": "Great! Awsome!", "Author": null, "ReviewID": "R1EH18K2FCUHP7", "Overall": "5.0", "Content": "My Grandparents have one and love it. I have to help them out with it. But its easy to work. Takes great pics. Its also easy to share your pics on the TV. Love it.", "Date": "September 5, 2006"}, {"Title": "looks good but the keys stopped functioning", "Author": "Rajiv Shrestha", "ReviewID": "R16JHWV0CVRY8M", "Overall": "3.0", "Content": "I like this camera as it looks good and pictures are not that bad except for red eyes and night pictures. However, after 6 months of use of this camera, the keys stopped functioning like back/next keys. I can still take pictures and download but can not preview as I cant use any screen buttons. So, I sent it for repair and now it is working fine.", "Date": "September 5, 2006"}, {"Title": "Sony Cybershot DSCT5 5.1MP", "Author": "Shailendra Kumar Sinha \"Shailendra Sinha\"", "ReviewID": "R2WNA4GLBGMOMR", "Overall": "4.0", "Content": "Except for the poor night vision the camera is perfect, resonable price. It's real slim, you can keep in pocket, clarity is cool, good battary (upto 110 min). I am happy. But again you won't get good picture in night, red eye is big prob. I give 4.5 rating.", "Date": "September 5, 2006"}, {"Title": "Great Pictures but broke down soon", "Author": "R. Mittal", "ReviewID": "RKJPYCO3KRUBZ", "Overall": "3.0", "Content": "I bought this camera five months ago.. and the results were amazing.. The shots taken at 3 Mp were outstanding in day light and quite good in dark.. but after 5 months i started getting error message \"Lens closed\" even after opening it.. and i had to send it to service center.. one of my friend also bought the same camera and his camera started giving same error only after 2 months.. Even though it is a great camera.. you may have to go through the pain of service.", "Date": "June 15, 2006"}, {"Title": "Anybody wanna buy a digital camera cheap?", "Author": "F. Lamaestra", "ReviewID": "R1QQUNR9NAUI83", "Overall": "2.0", "Content": "Folks,This camera only has to do one thing mainly well and that is to take crisp/clean photos at least 95% of the time.Serves me right for buying something because it was pretty and shiny, I should have gotten something with a folding-retractable lens and a long optical zoom. Anybody wanna buy a digital camera cheap?Pros:--Pretty Camera.--Shiny Camera.--Cute on/off slider.--Fast start up.--Zoom resets itself fast by just restarting the camera.Cons:--Blurry photos everywhere. I have to take 3 shots of everything to make sure I get a good shot. Even at high ISOs. It's just a bad camera.--I have actually taken many shots and then taken out the Mem-stick to find that non of the shots are on the Mem-stick or on camera internal memory. WTF?--Buttons are too small for anyone over 5 years old. I got the Sony underwater case and now the buttons are more useful. The camera by itself is just too small for most adults.--Zoom buttons are too hard to push and should be softer so I can easily zoom on-the-fly before taking a shot. Zooming is a hassle.--There is not enough camera surface area to hold the thing securely. Just shake and bake yourself to another blurry photo.--Night shots are terrible and useless. Feels like a cheap camera phone. Did I just pay $300 for this?--I recently got a cheap Casio 5.1mp Exlim and, even without image stabilization, I can't get a blurry shot from the Casio even when I wave it around and take shots randomly. This Sony unit is just bad.", "Date": "September 7, 2008"}, {"Title": "Sony Cybershot DSCT5 5.1MP Digital Camera with 3x Optical Zoom (Silver)", "Author": "JOSE ANDRES CALDERON", "ReviewID": "R2OO10VMO8U046", "Overall": "5.0", "Content": "NO WORDS FOR THIS ITEM, THIS IS THE BEST CAMERA I EVER BOUGHT, THE PROGRAMS TO DOWNLOW THE PICTURES ITS FENOMENAL, IF YOU HAVE THE OPORTUNITIES GO FOR IT, BUYIT", "Date": "November 2, 2006"}, {"Title": "Terrible Image Stabilization", "Author": "M. Kuruoglu", "ReviewID": "R1TEQUJKYP24EX", "Overall": "1.0", "Content": "The shape and style of the camera is awesome. However I got quite dissappointed when I saw the picture quality. I am a big fan of Sony and prefer Sony whenever possible but it seems they could not make it on this one. Most of the pictures come out blur and you have to try real hard to hold it extremely stable so that the picture will come out clear. On a car or for a moving shot do not even waste your time to try to take pictures.At least try your chance on an advanced Sony camera but not this one.", "Date": "July 3, 2006"}, {"Title": "THIS CAMERA IS WORTH THE PRICE!!!!", "Author": "Jerry N. Strickland", "ReviewID": "R3PQKT03VDBH74", "Overall": "5.0", "Content": "I ABSOLUTELY ADORE THIS THING!!!!!!!!! I AM GOING TO SHARE MY PICTURES SOON.ITS BETTER THAN ANY 7 MP CAMERA I HAVE EVER HAD.IF U NEED A CAMERA,THIS IS THE ONE 4 YOU!!!!", "Date": "June 11, 2006"}, {"Title": "Don't waste your money, lousy camera....", "Author": "Red Howard \"redhoward\"", "ReviewID": "R234AP916VWN61", "Overall": "1.0", "Content": "Low quality pictures, lots of red eye and....the worst problem a digital camera can have....a LOOOOONG delay when you depress the shoot button.", "Date": "July 14, 2006"}, {"Title": "Outstanding!", "Author": "Asli V. Wright", "ReviewID": "R1L4PKQW3IOGHD", "Overall": "5.0", "Content": "I bought it yesterday and took almost 100 pictures today. It is amazing. I love it , love it!", "Date": "June 18, 2006"}, {"Title": "Sony Cybershot  DSCT5", "Author": "Irwin Alcantara \"Dj Irwin\"", "ReviewID": "R27PMJN2MPZOEW", "Overall": "5.0", "Content": "Fast service. Am happy w/ the product. Exactly what i was looking for. Great customer service.", "Date": "March 15, 2006"}], "ProductInfo": {"Price": "Unavailable", "Features": "5.1-megapixel CCD captures enough detail for photo-quality 13 x 17-inch prints\n3x optical zoom; extra-large 2.5-inch Clear Photo LCD display\nUltra-compact camera body is 15.3 millimeters thin at narrowest point\n9-shot burst mode; 16-shot multi-burst mode; MPEG movie mode\nPowered by rechargeable InfoLithium battery; stores images on Memory Stick Duo media", "Name": "Sony Cybershot DSCT5 5.1MP Digital Camera with 3x Optical Zoom (Silver)", "ImgURL": "http://ecx.images-amazon.com/images/I/413EREAW4NL._SX300_.jpg", "ProductID": "B000AANUCK"}}