{"Reviews": [{"Title": "Lasted less than 6 months ...", "Author": "Mrs. Platt", "ReviewID": "R3GDEYTT7FHEAT", "Overall": "1.0", "Content": "This camera is fine--at first.  I got a few months' use from it after paying nearly full MSRP.  The zoom feature stopped working, and within a few days, the zoom lens would no longer retract.  It's also a battery eater.  If I could have another one for free, I'd pass.", "Date": "July 17, 2006"}, {"Title": "2 flaws too many", "Author": "Chemisgreat", "ReviewID": "R3HG7SE69V6H95", "Overall": "2.0", "Content": "The good news:  Pictures are excellent.  The bad news:  to reiterate what others say, it eats batteries - and getting rechargeables does not solve the problem.  I went on vacation with 2 10-packs of batteries, and used 10-12 batteries (vacation was 10 days, took 300 pictures - the 512MB card holds over 400).  The second flaw is the lack of a viewfinder - in bright sun, you just can't see the LCD screen.  Also, a note for the bifocal crowd - I have to take off my glasses to be able to see the screen well.  I got the  comparably-priced Canon Powershot A430 (1 less megapixel) for one of my children, and it seems like a better choice.", "Date": "August 7, 2006"}, {"Title": "Buy another...", "Author": "C. Nield \"Buy another...\"", "ReviewID": "R3JBEEFU3DY8Q", "Overall": "2.0", "Content": "The fact that this camera \"eats\" batteries shouldn't be underestimated.  For example, if you plan on taking several photo's while on vacation, plan on burning through AT LEAST 2 batteries per day, and that assumes that you turn off the camera between shots.  The picture quality is OK, but within 1 year (11 months to be exact), the \"low battery\" light kept coming on no matter how many times we changed them out.  Customer service suggested that we should put new batteries in ... again.  After I explained that this is the 4th set of batteries and the low battery light is still on, they would not be deterred.  It's my fault, not the cameras.  Gee, thanks Olympus.  Won't buy another (this is my 2nd) and you can definitely get your money's worth with other brands (see other reviews on this page).  Very disappointing.", "Date": "December 23, 2006"}, {"Title": "Slow shot-to-shot, eats batteries", "Author": "Stanford P. Hudson", "ReviewID": "R2WE3NDFO332GN", "Overall": "3.0", "Content": "Slow shot-to-shot and seems to eat batteries.  However, the image quality is great.  I recommend purchasing a 1GB XD card, which will allow you to capture and store 1000+ 5MP images.  To eliminate the battery problem, I purchased cheap 2600mAh 1.25v NiMH rechargeable batteries from Fryes and the camera can now remain 'on' for hours.", "Date": "July 19, 2006"}, {"Title": "Great camera, hear me out", "Author": "shopaholicsanon", "ReviewID": "RU8DHWT12TH0K", "Overall": "5.0", "Content": "I have owned this camera for several years now. It has always been a fantastic little camera for me. The 5 megapixels didn't make any difference to me: it still took pictures as good as my mom's more expensive 10 mp camera. I see a lot of people don't like how quickly it goes through batteries. I found the solution - lithium batteries. They may be a bit more expensive, but TRUST ME, they are so worth it. I used my camera frequently on one set of lithium batteries and didn't change the batteries for a few months. Another trick is to take the batteries out when you aren't using the camera. Cameras actually are still using a bit of the battery power even when they are off. And as far as durability, this camera totally takes a beating and keeps going. I was taking a picture at a theme park and this lady comes out of nowhere and runs into me with her stroller (I know, right?). The camera goes flying, hits the pavement. The ring around the lens is dented and I'm worried. It turns on perfectly. That happened a few years ago and still never had a problem. I would recommend this camera.", "Date": "January 23, 2013"}, {"Title": "Solid camera", "Author": "J. Eis", "ReviewID": "R3NPY8XZVC3TMS", "Overall": "5.0", "Content": "I had this camera for several years and it has worked great! It's only a 5MP camera, but for most jobs that is plenty (so why spend $$$ on a camera in my opinion). The only catch is that it works best with lithium batteries. Solid camera!", "Date": "December 17, 2008"}, {"Title": "takes great pictures", "Author": "Michael T. Weeder", "ReviewID": "R1N1FQW0YN0V2X", "Overall": "4.0", "Content": "i bought this camera a few months back and love it.takes great photos nd ease of use is wonderful.only bad thing is it does eat regular batterys fast.but with my NI-Mh last for very long time", "Date": "September 10, 2007"}, {"Title": "Pretty good for the price", "Author": "E. Crenshaw \"The Lord's Servant\"", "ReviewID": "RMMJ6LCZPI5DH", "Overall": "3.0", "Content": "there is a bit of a lag between when you push down the button and when the shutter actually goes off.  even if you pre-setup the photo by pushing down the button half way, there is still maybe a 1/4 to 1/2 second delay.I bought this camera for my brother and have used my in-laws and I guess you could get used to it.  I own an olymput c770 and it does not have this issue.but for the price, it works fine.", "Date": "April 5, 2007"}, {"Title": "Great Bargain", "Author": "W. Williams \"Bill Williams\"", "ReviewID": "R1Q1LFVYF9IBDY", "Overall": "5.0", "Content": "This camera is a great bargain for the price. Quality pictures and easy to operate and download pictures into your computer.", "Date": "January 9, 2007"}, {"Title": "Usable but flawed...", "Author": "CMOS", "ReviewID": "R3G0382LJM3L22", "Overall": "3.0", "Content": "While the picture quality for this level of camera is OK, the build quality and durability leave much to be desired. Very much a \"flimsy plastic construction\" scenario. Also, the menu system and options very limited, even at this price point. You'd be better spending an extra $50 or $60 and getting a more capable model. Canon owns the market in this price range and for good reason: they make capable, dependable cameras. Bottom line: Look elsewhere.", "Date": "March 9, 2006"}, {"Title": "Not happy!", "Author": "D.Will", "ReviewID": "RNC13I8BG1LO9", "Overall": "2.0", "Content": "Received camera for a gift. Dropped camera two months later. Camera was damage so easy. The lens was stuck and would not retract. Cost to repair $$$, was not worth having it repaired. I think I will try a Cannon this time.", "Date": "November 10, 2006"}, {"Title": "An okay camera", "Author": "K. Ainsworth", "ReviewID": "R1EK5HTWW48LL7", "Overall": "3.0", "Content": "This camera is very handy.  I am impressed with the different settings and it is much easier to record action than my previous digital.  The software included is not nearly as handy as the Camedia software I've used in the past.  And although I haven't had any photos commercially printed, the color and the quality of the prints I have done at home is not what I expected.  The pictures tend to be pretty grainy and I have had to do a lot of editing.  Overall, it is very easy to use.  I hope that with continued use the problems I'm having will be resovled.", "Date": "August 24, 2006"}], "ProductInfo": {"Price": "$249.99", "Features": "5.0-megapixel CCD captures enough detail for photo-quality 13 x 17-inch prints\n2.8x optical zoom; 6 shooting modes\nBuilt-in Help Guide provides brief in-camera descriptions and tips help you choose the best camera setting\nOlympus Master software offers red-eye fix once images are downloaded to a computer\nPowered by two AA-size batteries (included); stores images on xD-Picture Cards (16 MB card included)", "Name": "Olympus FE-110 5MP Digital Camera with 2.8x Optical Zoom", "ImgURL": "http://ecx.images-amazon.com/images/I/411KEHFJKTL._SX300_.jpg", "ProductID": "B000A7B9Y4"}}