{"Reviews": [{"Title": "Good quality photos, poor Wi-Fi implementation", "Author": "L. Abate", "ReviewID": "R2KC6BDSIL4E4H", "Overall": "3.0", "Content": "Camera is too large to be considered a true \"elph.\" Doesn't look that attractive with the odd antenna off to the left side. Wi-Fi doesn't even work with Mac OSX so any Mac users out there may want to pass on this one. If you don't mind the slightly larger size, have a computer running Windows OS, and really want a Wi-Fi enabled digicam the sd430 may not be a bad choice (for the under $200.00 price tag)To me, however, the novelty of being able to transfer photos via an old standard (802.11 b) wireless protocol does not justify the larger size and awkwardness of this camera.***Update***While I did return this camera, a reviewer noted that with a firmware update, the camera will now work with the Mac. About time, Canon!", "Date": "August 6, 2007"}, {"Title": "Wifi features actually works well", "Author": "A. Stevens", "ReviewID": "R30V2JLODW2UYM", "Overall": "5.0", "Content": "Well, canon photo quality is a good start. I bought this camera to upgrade from 3MP SD200.  Both take excellent pictures and movies, although it is limited to 1GB file size or roughly 8 minutes.Now the WIFI feature is the one that stands out from this camera. It works really well, and it is easy enough to get connected. If you want to connect to existing home network with router, just follow the instructions, input SSID and password.  Just make sure you enabled ICMPv.4 in your firewall settings or else you get disconnected all the time.  For ad hoc connections, I use my laptop's network settings to just pick up ad hoc signals, and you can use it wherever you go just bring your laptop. No problems with wifi connection to printers whatsoever, in fact you don't need to set up anything, it is pre-set to use with pict bridge compatible printers.Remote capture is also a neat feature, I want to use it for baby monitor so no need to buy an fancy, expensive one.", "Date": "July 25, 2007"}, {"Title": "SD430 Wi-Fi", "Author": "David A. Silber \"DAS\"", "ReviewID": "R319TBGKXIS66Q", "Overall": "5.0", "Content": "Good camera as it is - fully featured point and shoot (have to like Canon) - low noise at lover ISO - excellent prints for 5MP - body is plasticly (part of Wi-Fi design as per Canon rep.) - Wi-Fi is actually a very nice feature of this camera and it works like a charm. Good camera with a wireless bonus - if you do not care about Wi-Fi, look at other cameras in this price range with features like IS or bigger/wider zoom.Anyhow this is another Canon well done - 5 star camera - 4.5 for Wi-Fi (had to download a plug for it to work), but it works and it works very well.Recommended!", "Date": "August 31, 2007"}, {"Title": "recommended", "Author": "Amira \"Via\"", "ReviewID": "R1IXAW7J7KZIQN", "Overall": "4.0", "Content": "If you are having second thoughts about purchasing this item, then im here to say its worth it. I bought it on may 6 from amazon. And it was totally worth it. It has great battery life. And the pictures on the computyer are very clear. The manual is easy to use and very clear. I am not good with cameras but this one was easy to operate. I highly recommend it. GREAT CAMERA...CANON is the best!", "Date": "May 16, 2009"}, {"Title": "great little camera - workable wi-fi", "Author": "Peter Anderson \"onebigswede\"", "ReviewID": "R3CWA3RFJATV2H", "Overall": "5.0", "Content": "I bought this camera a month or so ago after my old Canon S400 was stolen.  I needed an affordable camera quick since we were going on a 2 week trip to europe.  When I found this camera for about $100, I jumped on it.The camera takes great pictures, although dark light can be tough (like most cameras).  The movie mode works well. The size is small enough to fit in your pocket.The wi-fi features of the camera work well. It's nice to be able to just come home, turn the camera on, connect to the network and send the photos to the computer downstairs - without having to actually go down there.  If you're transferring larger numbers of photos this may not work as well, i usually connect via USB to do that.The only negative I've found with the camera so far is that it doesn't feel as sturday as my old tank of a camera, the s400.  it feels a little plasticky.", "Date": "September 24, 2008"}, {"Title": "Excellent camera", "Author": "piman", "ReviewID": "RSBQMFOR4J48U", "Overall": "5.0", "Content": "Good pictures in low light. I compared the pictures taken with this camera with my friend's Olympus in low light. While the pictures taken with Olympus came out grainy, the Canon one were still sharp. Also, very few pictures got blurred because of camera shake.Quite happy with this camera.", "Date": "August 21, 2007"}, {"Title": "Great Features", "Author": "JTM", "ReviewID": "R2M7ZBTJJ3N7JG", "Overall": "5.0", "Content": "I love this camera, it's an older model (only 5MP) but picture quality is great. Love tha fact that you can connect to your network with Wifi to print your pictures with no cables but the main feature why I bought this camera is the ability to control the camera and take pictures using the PC (great for taking remote pictures) and this feature I havent seen in any other camera maybe  the general public did not use??? well anyway I love the camera and I'll upgrade to a newer model if they ever bring back this feature....", "Date": "January 9, 2009"}, {"Title": "What a great little camera!", "Author": "Jane C. Heniford \"sharkseek\"", "ReviewID": "R3RLGIMYD9MB63", "Overall": "4.0", "Content": "I love the ease of photo shooting, the size, and the resulting picture from this camera!  Here's what i don't care for:  the picture transfer isn't as easy as my kodak easy share.  4 stars for a nice camera, good pics, and easy to point and shoot!", "Date": "October 31, 2007"}, {"Title": "Nice small camera", "Author": "Mahesh \"geek\"", "ReviewID": "R2NALKBGV401EK", "Overall": "4.0", "Content": "Its a nice camera with good features. The small zoom (3x) is the only downside. Using wireless downloads of photos is great. So far, battery life seems to be fine, but I think i am going to need a spare battery for when I use it for any trips.", "Date": "August 5, 2007"}, {"Title": "perfect", "Author": "retired nurse \"Carole\"", "ReviewID": "RN4VPPTVUVBNF", "Overall": "5.0", "Content": "I bought this for a replacement of a broken camera.  It fits in my purse and is always available.  I like the fact it takes standard chips.  It does have it's own battery but I have not used up the charge yet.  Granted, I recharge it after use, but it's not been a problem.  The pictures have turned out well.  I'm very happy with my purchase.", "Date": "October 21, 2007"}, {"Title": "Wi-Fi with photo printer", "Author": "nancy boy", "ReviewID": "R2JE0QSITQRF14", "Overall": "5.0", "Content": "bought this camera week ago at Amazon's lighting deal add a 2GB memory card. purchased a Canon Selphy 740 Photo Printer (ofcause from Amazon )WOW, I don't believed my eyes, Photo comes out great.I don't have any trouble taking pictures nor printing it.I would said both are user friendly.", "Date": "September 26, 2007"}, {"Title": "Canon Fodder", "Author": "J. Jones \"Stid Hillbilly\"", "ReviewID": "R30SE0BBNE6SSA", "Overall": "4.0", "Content": "For what it does, this is an amazing little shirt-pocket camera.  Canon probably still makes the best lenses - even for cheapo cameras.  The only Canon I've ever been disappointed in is the Rebel XTi, which I tried and sent back last year. Disappointingly cheap plasticy body and images that weren't even as good as the Powershot G3 (great pix but pain-in-the-rear shutter relay) I had hoped to replace with it.  In the \"entry-level\" dslr category, I've been much happier with the Pentax I'm using now.... But I'm off the subject.  This little unit did a great job for backup snaps on Safari in Africa - and even held up to a bonking on the metal deck of a ferry boat when I had to jump onto the boat to get across the Nile....", "Date": "July 27, 2008"}, {"Title": "don't bother", "Author": "Larry R. Kaye", "ReviewID": "R2NYIV4IA5EVI", "Overall": "2.0", "Content": "I bought this camera for the 'wireless' feature. Found out after it ONLY works (theoretically) with XP, 32 bit, SP2 nad if you have anything else forget it. So I tried to install it in my home computer which happens to have exactly the above parameters, nothing doing, not even with the help of my geekiest friend.  Excluding the wireless feature the camera is very pedestrian, my Sony is 10x better and I imagine there are dozens of others as well.", "Date": "February 7, 2009"}], "ProductInfo": {"Price": "$499.99", "Features": "Wi-Fi (IEEE 802.11b) compatibility for wireless image transfer and control of camera functions from a PC\nFeatures 5.0-megapixel CCD sensor, compact 3x optical zoom, and ultra-high refractive index aspherical (UA) lens\nProcesses prints up to A3 size\nIncludes a software suite featuring Canon's ZoomBrowser EX 5.5 (Windows) and ImageBrowser 5.5 (Mac); PhotoRecord 2.2, PhotoStitch, and PhotoStudio\nDesigned with a sleek silver finish and stylish blue LED", "Name": "Canon Powershot SD430 5MP Digital Camera with 3x Optical Zoom (Wi-Fi Capable)", "ImgURL": "http://ecx.images-amazon.com/images/I/41N3%2BXE45rL._SX300_.jpg", "ProductID": "B000B8UOV6"}}