{"Reviews": [{"Title": "Nice printer and camera", "Author": "John I. Watkins", "ReviewID": "R1QECDCTC0WRGZ", "Overall": "5.0", "Content": "I bought this for my daughter (8 yrs old) and she loves it.  Great printer and camera for the money.  Takes good pictures and is easy to use.  Printer is fairly quick too.  Be sure to buy some rechargeable batteries because the camera will use up regular batteries pretty quick.  I bought the duracell 15 minute charger with four 2400mpa batteries and they are great!", "Date": "January 12, 2007"}, {"Title": "Photosmart Review", "Author": "Zoe V.", "ReviewID": "R1KP7AU9G2TORG", "Overall": "2.0", "Content": "This item did not work correctly. The photo docking station was supposed to charge the camera, but did not. It took fine pictures in the 5 minutes that it would hold a charge. It had to be returned and was more trouble than it was worth.", "Date": "January 12, 2007"}, {"Title": "Great Point and Shoot Camera", "Author": "BullHauler", "ReviewID": "R11HREBKU4S0MF", "Overall": "5.0", "Content": "Although we don't have the printer, we have had the HP M415 camera for ten years or so and we are well pleased. We get very long use time with Energizer Ultimate Lithium batteries. I barely know anything about SD cards and such, but I believe the load time would be greatly improved by replacing the 1GB SD card that came with our camera with one of quicker capabilities and more GB capacity to hold more photos. I can't remember the exact figures from ten or so years ago, but I seem to remember paying much more at Walmart for the camera alone, a bit over $100 as best I can remember. New technology sure cheapens quickly.", "Date": "December 24, 2013"}, {"Title": "HPphotosmart 422 GoGo photo studioM415 5MP digitalcamera", "Author": "Rossana Rhodes", "ReviewID": "R1O8S6PJYJN3MW", "Overall": "4.0", "Content": "The owner of this company is very helpfull with his costumers.", "Date": "January 5, 2007"}, {"Title": "camera and printer", "Author": "Richard D. Du Chemin", "ReviewID": "RRWG8DO53TTTT", "Overall": "5.0", "Content": "it was a gift to my daughter,from what i've been told it was a great gift and very ;much appreciated.  thank you  richard du chemin", "Date": "January 11, 2007"}], "ProductInfo": {"Price": "Unavailable", "Features": "5.2-megapixel digital camera captures enough detail for photo-quality 13 x 17-inch prints\nPhotosmart 420 photo printer makes borderless prints up to 4 x 6 inches\nDigital camera features 1.5-inch LCD display; edit photos in camera--no PC needed\nCamera powered by two AA-size batteries; printer charges batteries when camera is docked\n16 MB internal memory in camera; stores images on SD cards", "Name": "HP Photosmart 422 GoGo Photo Studio (M415 5MP Digital Camera with 3x Optical Zoom & Photosmart 420 4x6 Photo Printer)", "ImgURL": "http://ecx.images-amazon.com/images/I/411A4XT5TRL._SX300_.jpg", "ProductID": "B000A5L9UA"}}