{"Reviews": [{"Title": "SONY's DSC-N1 has delivered another unique great performer", "Author": "James L. Wilson \"wilson99\"", "ReviewID": "R27EW0676TYIU0", "Overall": "5.0", "Content": "Sony has once again delivered another unique pocket camera. It delivers great high resolution images with good detail and saturation. When I set up the camera, in the menu system, I set the saturation and sharpness up one tick; I also set the, what appears to be a huge 3\" LCD touch-screen monitor up to brighter level. What a incredible difference going from 2\" to 3\" monitopr size. One can really share the shot captured with family and friends... With this done, the camera produces great images from the pocket. The flash seems significantly brighter than the \"T\" series cameras. I purchased a spare battery and SONY's high speed 1GB data card, which will hold over 250 images at the my recommended highest resolution setting. Also set the video to \"Hi Resolution Fine\" 640x480 mode. The videos are stunning, vivid, and compete with typical tape video camera performance, for the casual viewer. May be over-spoken, but, the video quality is so good comming from this little footprint, the results are shockingly positive.There are a number of sites including SONY's site, and [...] which describes the camera in exhaustive detail, so I will not repeat these facts here. I am an adjunct faculty member of Florida Altantic University, FAU, teaching \"Principles of Digital Photography and Post Image Processing,\" Pearson Education, 2004. To help our students with their study of this topic I attempt to keep up with the latest releases of digital camera equipment. Go to the site address a part of [...] site, to see images from this exciting new camera. FYI, I purchased this camera for my personal use and am delightd with its performance. I also have professional Canon digital SLRS, however I cannot put them in my pocket. There are trade-offs with a pocket camera, but this little masterpiece has what it takes to capture those pictures, when carrying a SLR is not convenient. Jim Wilson, quesitons email directly to FAU@bellsouth.net for further Q&A.;(...)", "Date": "December 11, 2005"}, {"Title": "DSC - NICE ONE", "Author": "Pierre Exantus", "ReviewID": "R18BU9QEI1UNRT", "Overall": "5.0", "Content": "I was looking all around for an ultracompact camera.  I was on the fence between the Canons (SD400, 450, 500 and 550), Nikon S1 and the Sony DSCT1.  While the SD500 and SD550 were top of the line (fantastic image quality), all of them have their shortcomings.  There is no such thing as a perfect point and shoot digital camera.  Just before I made my purchase though, I was lucky enough to come across the Sony DSC-N1 on [...]  My first digital camera was a Sony (DSCP1).  I did love it, but poor battery performance and expensive proprietary accessories led me to jump the Sony ship.  Within the following 5 years, I acquired the Canon EOS D60, the Canon S60, and the Canon S410.  So let me just say, I am a Canon guy.  I gave the S410 away as a gift and decided to get a new ultracompact.  Enter the Sony DSCN1.The camera sports the largest LCD (3 inches), which at the same time is a touchscreen.  There are hardly any physical buttons on the camera itself.  For an ultracompact, there is an unusual amount of manual control (Aperture, Shutter Speed, White Balance, ISO speed, Color Saturation, Contrast, Flash Levels, Sharpness, etc.).  The shutter speed can be set from 30 seconds to 1/1000 of a second.  Aperture ranges from f2.8 to f16.  You can even compose your picture, and then touch the screen to select which object you want to be in focus.Like many other ultracompacts, there is no viewfinder on the N1.  All your shots are composed on the LCD.  Some think this is a \"con\", but I honestly don't know why one would really need the viewfinder.  Perhaps the bright LCD may be problematic in a dark theater where you are bootlegging the latest Sony Pictures release...  Picture quality is excellent.  Focusing is very quick and COMPLETELY silent.  Macro performance was impressive. The camera itself powers on quickly so it's honestly only about 2 seconds before you get your first shot.The camera comes with 26MB of onboard storage for pictures and supports the Memory Stick Duo storage cards (Why so proprietary Senor Sony?).  It is an ultracompact, but it is on the larger side of the ultracompacts.  It will drop into your shirt pocket but there will be a noticeable bulge...  It's about the size (slightly thicker) of a deck of cards.  The N1 sports 3x optical zoom, but an oddly diminutive 2x digital zoom.  You would think it would be harder to incorporate optical zoom than digital but whatever.  That should not keep you from this camera.  You can easily zoom in and crop after you put your photo on your computer.  8.1 megapixels affords you great license in that arena.  There is only one thing that seems pretty inconvenient.  It takes hours to charge the tiny little battery.  It took me about 4 hours to finish my initial charge and the manual suggests that you leave it in an additional hour after the light goes off to get it to maximum charge.This is clearly an awesome camera.  I saw a rating of 6.6 on Cnet.com and am still scratching my head over that one.  Meanwhile their readers rated it 8.5 on average.  Like I said, there is no such thing as a perfect point and shoot digital camera, but the Sony DSC-N1 packs quite a punch.  I'm going to date this review by saying I paid $450 for mine (I'm going to be pissed in a year's time when it's going for a hundred dollars less).  It retails for $499.  While the price can be considered high, the value is definitely just as high.  I highly recommend this amazing little gadget.Pros:8.1 MegapixelsAwesome Touchscreen ControlsGood Battery Life (well over 200 shots)Photo Album/Slideshow ReviewManual Focus TargetingISO - 64, 100, 200, 400, 800Carl Zeiss Vario-Tessar LensGood flash rangeCons:- It takes 4-5 hours to charge the battery- Bulky Ultracompact- LCD gets fingerprints- Pricy (mine was $450)- 2x Digital Zoom", "Date": "January 11, 2006"}, {"Title": "not for beginners ?", "Author": "David C. Peck \"davidcpeck\"", "ReviewID": "R7FRALJZZO9VB", "Overall": "5.0", "Content": "N-1. i have migrated continuously from the p5 to p10 to p100, and p150 and lastly the p200 as they were released. this n-1 is pretty different from them, but yet familiar. they returned the on-camera trimming and movie editing, which i like(d). they also made this new one very light, and quick. sadly, it requires yet another docking station, since both the p100/150 and the p200 don't fit the N-1. also missing is a charging slot on the camera, so the station is more important here. but they include a wall plugin converter for the battery. the battery is also yet another new size and shape.TOUCH SCREEN. the coolest new feature is the touch screen, which replaces all of the buttons except the zoom.  the screen is large and adult fingers can navigate easily. but they give you a small plastic stylus which clips onto the leash. this operates all electronic controls except the zoom. the screen is so large that you can really review your work without downloading to a pc, and sharing with others is easier. this 3 inch screen has 9 times more real estate than the p100, which cost the same when it was new. which also means it has 4 times more real estate than the flagship f-828, also an 8 megapixel.PAINT, or a small version of it, is in the camera, so you can edit an image on camera, then write or scribble with lines, curves and colors. there is also a stencil function with hearts, snowflakes, etc. also with colors. and the eraser, of course. saving an edited image creates a new file, preserving the original image.BUILT IN MEMORY/ALBUM. new to sony is the built in memory which keeps a rolling 500 thumb image library for every shot, in an album. it also stores the pictures taken when the film chip is not inserted. finding my images across these two locations was confusing at first, but you can copy from/to each to the other.DUO. unfortunately, a reguler memory stick doesn't fit the n-1. the smaller duo is not included. i bought a 2 gig sandisk for $170. from dell, and they come with a converter for a memory stick slot, so you don't need to buy that for $ 10. from sony. a 4 gig sandisk memory stick is only $ 260. at dell, and these are both the currently largest available for their respective size.", "Date": "November 17, 2005"}, {"Title": "Great camera but here are the gotchas", "Author": "N31L", "ReviewID": "R3A4LYH6X9WQGI", "Overall": "5.0", "Content": "Having got rid of my Elph a year ago and waiting for the rightcamera to come out, I discovered the right camera with the SonyCybershot DCS-N1.I bought the camera in November and I can rave about how greatthe LCD, touchscreen, slideshow, video are.. or I can point outwhat little things I noticed that are little gotchas with thecamera.  You can guess the way I decided to go.SIZE: Overall, my expectation when I bought this was that thecamera wuld be somewhat smaller in thickness, but it is prettythick compared to other cybershots.  It still fits in yourpocket and still is the talk of the town when you show it topeople.  But it's the size of a deck of cards when most newercameras are the are half the width.  Not a big deal, really, butjust settling your expectation and You will hear this over andover again.DESKTOP SOFTWARE:  I have yet to truly play with the desktopsoftware, but it appears that most of the desktop software isgeared to the video aspect of the camera.  I did like thetransfer software that came with my Elph, but this camerainteraction with the host computer seems limited to creating anadditional drive that you must grab your photos from and kindalame video software.DESIGN BUGS: One thing Sony has to fix.. and I'm not sure ifthis is common with all their cameras or cameras in general.When the battery dies and you're in the middle of a shot, thecamera does not retract the lense back into the case with afinal gasp of power.  The battery died on me during X-mas, and Iwas stuck with an extended Carl-Zeiss lens for the rest of theweek.  This is kinda a problem if you don't carry the chargerwith you on extended trips.INTERNAL SOFTWARE COMPLAINT:  The camera stores its photos intwo separate areas when you take a photo.  The Actual higher resphotos go in sequenced folders (named 1xxMSDCF [xx being ansequential number for each new file]).  Smaller low resduplicates go in \"albums\".  You can slideshow \"albums\" by dateand the high-res originals by folder.  Most likely, you willdelete the high res when you transfer to your computer.  My onlythree complaints are if you rename the high-res folder outsideof the above naming convention(i.e. \"X-mas_Day_2005\"), thecamera fails to recognize the folder even exists anymore untilyou name it back to the accepted naming convention. Also, if youdelete the high-res image, it doesn't give you the option todelete the low-res album images as well in the same step.  Youhave to do this manually yourself as additional steps.  Finalfeature complaint is once you take the photo, the software doesnot allow you to control how long the preview stays on the LCDscreen.  It's either ON or OFF. That's it.(I think the paint feature is rather stupid.. but heck it's agimmick I don't have to use).PHOTO CAPTURE:  This thing gives you the functionality andflexibility of a more professional camera all wrapped up in theeasy to use touch screen. I had to play around with it a bit toget my shots more in the range I liked, but \"Auto\" is the bestmethod by far when you don't have the time... but this featurescan still generate the occasional blurry image if the camera isnot steady enough...  The other Photo capture complaint is indark rooms where I've seen other cameras create an enhanced sortof lighting upon the picture subject within the LCD beforetaking the photo. Here, you have to settle for a weak red lighton your subject to guess if your subject is in the photo in adark room.(Also, 8.1 MP is rather over the top for a camera.  I readjustedmy camera back to the space saving 5 MP)Overall, even if someone can't point out solutions to my abovecritique, this camera is worth every penny.  I just have tomention things you won't hear folks mention since they're soenamored with the product. I have yet to use the videofeature...but I do hope Sony provides better software for thephoto aspect of the camera, I do recommend downloading Google'sPicasa software to manage your photos on your desktop.Other than that this camera is innovative.  I had 5 peoplesay \"I gotta get me one of those\" in the last 2 weeks.  I'm alsowaiting for my cradle accessory via Amazon to come in the mailto use as a desk photo display.  So may be able to extend myreview a bit when that arrives.", "Date": "January 3, 2006"}, {"Title": "Very Worth the Money", "Author": "EK \"EK\"", "ReviewID": "R43W8130F0L3J", "Overall": "5.0", "Content": "To make a long story short, This camera rocks my socks.  I am beyond impressed by its usability, durability, looks, and excellent picture quality.  The touch screen feature is going to usher in a new wave of copycats, because it is so much easier to use than having a million buttons all over the camera.  The camera contains very advanced noise reduction technology and the detail clarity and color quality of the pictures will blow you away.  I actually do find myself using the album feature quite a lot because I already downloaded 4 of my favorite songs onto the camera for playback.  The paint feature isn't quite as useful after the novelty wears off, but it's still fine to have.  The battery lasts through 250+ shots and with at least a 1GB Sony Memory Stick Pro Duo from Amazon(they have a pretty good price actually) you'll have an amazing camera to enjoy for years to come.", "Date": "December 2, 2005"}, {"Title": "Makes me want to switch back to Sony", "Author": "Gadgester \"No Time, No Money\"", "ReviewID": "R3NP9LNT4DIHDB", "Overall": "5.0", "Content": "I haven't owned a Sony digital camera in years.  Not that Sony cameras are not good; it's just that I always ended up getting a Canon, a Casio, a Fujifilm, a Minolta, a Kodak, or a Pentax.  At the moment I use my Nikon D70 for photos that I want to keep or submit for contests, and my Fujifilm F10 for everyday snapshots.  But recently I had a chance to play with a Sony DSC-N1 and I was really impressed.  I think I'll buy a Sony next time, now that I've accumulated quite a number of Memory Stick PRO Duo cards (for my Sony PSP and Sony camcorders).OK, everyboby knows the N1 has 8.1MP resolution, and the price point is sweet for an ultra-slim, stylish digital camera.  The 3x optical zoom is a bit disappointing; I really wish Sony had done something outside the box and gone beyond 3x zoom.  (Panasonic has a compact camera that sports a whopping 10x optical zoom coupled with optical image stabilization!)  3x is adequate for most situations, though, so maybe it's no big deal for most casual shooters.But more than the 8.1MP resolution, which makes great enlarged prints, the N1 has excellent image quality.  I always say that image quality is much more than resolution; it's more about color reproduction (is red really red and is blue really blue?) and white balance (is white really white?) as well as technical factors like saturation and contrast.  Older Sony digital cameras tended to give crisp but dreadful looking pictures.  Not the N1.  Both indoor and outdoor pictures look terrific, and as long as you have adequate lighting (or use the flash), you'll get pictures that you'll be proud to share with friends.  Digital noise does kick in quite a bit at ISO 400, meaning that in dim light situations you'll notice digital specks when you enlarge the picture.  But for 4x6\", or even 5x7\", prints as well as viewing on a PC monitor or HDTV monitor, the N1's image quality comes across as quite satisfactory.  What really impressed me was the flash quality, which seemed better than most other compact digital cameras (except Canon ones).So if you want a digital camera with excellent image quality, the N1 should be on your shopping list.  Overall I still slightly prefer Canon's image quality, but not by much, just by a little bit.  It's probably because my idea of \"perfect\" image quality matches the calibration parameters chosen by Canon's engineers.  However, I know many other people who prefer Sony's crispier looks or Fuji's \"scenic, natural\" looks, so you may want to compare the N1 with a Canon or something else to see which camera produces the results you personally like the most.  Bottomline: the N1's image quality ranks very high among compact digital cameras.Of course, the N1 has many other things going for it, too, like the enormous 3\" LCD in the back.  The LCD just looks huge because 1) it is, and 2) it takes up most of the real estate of the camera's back.  Its resolution is a little over 230k, twice that of most other digital camera's LCDs.  This gives a sharp-looking image on the LCD.  Ourdoor visibility is good as the LCD is bright.  Like Sony's camcorders, this LCD is touch-sensitive, which means you can control camera functions on the LCD itself.  I myself am neutral on this.  Some people don't like Sony's menu-driven interface and would have preferred a few more buttons.  For most casual photographers, this is probably not going to be a big deal.The N1 is beautiful looking, and it has good shooting performance.  I'm talking shutter lag here.  It's quite fast.  Not as fast as a digital SLR like my Nikon D70 or a Canon Digital Rebel XT, but the N1 felt slightly faster than my Fuji F10.  This is a camera that performs, period.Battery life is decent; I think the official rating is 300 according to the Japanese CIPA standard.  My Fuji F10 is rated at 450 and I swear I've taken close to 1,000 photos (about 40% with flash) and I still have 50% left.  I don't know if the N1's battery has the same stamina as my F10.  But even at 300 shots per charge, that's pretty good.I want to make two recommendations to any perspective N1 owner:1) Be sure to get a spare battery.  Even though the N1's battery life is good, the battery might fail (e.g., in extreme temperatures) or you might forget to recharge it before a new day starts.  Always carry a spare if you can afford it.2) The N1 uses Memory Stick Duo, and you'll most likely buy the \"PRO\" version.  (The \"PRO\" designation simply means the Memory Stick Duo card is over 256MB.  Sony's marketing people are nothing short of absolutely stupid and perverted.)  You don't have to buy the \"high-speed\" (red) version of Memory Stick Duo PRO; but as a fellow Amazonian recently told me, the high-speed and regular versions cost the same, so you might as well get the high-speed one.  Now comes my tip: buy two or more memory cards instead of a single gigantic-capacity one.  Say you want 2GB in total.  Get two 1GB Memory Stick PRO Duo cards instead of a single 2GB one.  Why?  It's the old adage that \"don't put all your eggs in one basket.\"  As with the battery, always carry a spare.  Trust me, if you don't have a spare battery or memory card, Murphy's Law will get you, sooner than you think, too.In summary, the N1 is a terrific ultra-slim camera.  It takes great pictures, is stylish, has a huge touch-sensitive LCD, has good battery life, is reasonably easy to use, and did I mention it takes great pictures?  It's good enough for this camera aficionado that my next compact camera will probably be a Sony.", "Date": "April 29, 2006"}, {"Title": "WOW WOW WOW!! JUST INCREDIBLE!!", "Author": "Claudia Miranda Monroy \"Tatiette\"", "ReviewID": "R3DBF75IZIBWN2", "Overall": "5.0", "Content": "I got this camera for christmas and it was the best gift ever!!I used to have a 5.0 MP sony cybershot and I was very happy with it except when I was shooting in the night, it was frustrating that all the night pics were dark, I tried all kind of stuff to make this work but this 5.0 Mp camera worked great only in daylight, so then the DSCN1 8.1 MP digital camera came along and I was impressed in how incredibly good was it, I took it for our holiday vacation and I hoped that finally I could take pics at night, I tried it at a night parade and with fireworks and I could not believe my eyes of how great pics it took!!! after that I loved it, what can I say about daylight pictures, WOW!!! with this camera I do not worry anymore about if it is day, night, fireworks, the beach etc... .Let me tell a little about the features, I will start with the thing I think is the greatest idea: The touch screen, it is so practical, and easy to use and if you are familiarized with sony cameras you will not have a problem,if you are not used to sony cameras don't worry it is really easy, also the thing that it it touch screen leaves more space for the screen where you watch your pics.Other feature is the slideshow mode to view your pictures and not only you have this but you can add music!! yes your own music!! isn't that amazing!! you just plug this camera to the TV and there you go a proffessional slideshow in less than 1 minute.What more can I tell you please don't hesitate about which camera to buy this is the best choice, a little camera of 8.1 MP!! and I tell for my experience good shots at day and at night.The only thing you have to buy along with this is a memory stick duo it is not included, (this camera has it's own memory but not too much) so I reccomend to buy the 1GB memory stick.BUY THIS!", "Date": "January 24, 2006"}, {"Title": "Love it so far...", "Author": "Eugene A. Grinstead", "ReviewID": "R2AEALIFZQJJ4L", "Overall": "5.0", "Content": "Camera works great for us so far... we had a 3 year old digital camera so this was an upgrade to better technology... takes much better pictures than our old one... the video is great (except in very low light)... we've taken a lot of short video clips of our kids for grandma (etc)... nobody in our family wants to watch more than about 5 minutes of any one home video anyway... so this camera saves us from having to buy a camcorder... (although with our 1GB card we could take 45 minutes or so of continuous video at the medium setting)... the touch screen is great and simple... the camera has quick response time and the indoor and action pictures are again great for pictures of our kids running around or birthday parties... I took about 92 minutes of video and 55 pictures (plus sharing images and videos with others) before the battery ran out for the first time (a couple of weeks of shooting in our family).  I guess everyone has their own needs when picking a digital camera, but this one works great for ours.", "Date": "August 21, 2006"}, {"Title": "Disappointing night pictures- the screen is pitch-black !", "Author": "R. Gertler", "ReviewID": "R2WG1HR2L4KJRI", "Overall": "3.0", "Content": "Loved the touch screen feature when I read about it the first time. Ergo- I bought it. Had a good chance to test it at a wedding I went to. It was easy to use (my level of expertise- point and shooter, I basically need an \"on\" button and zoom and expect the camera to do everything else) and the pictures turned out great. Until the after party started and I wanted to take some pictures at a bar. I couldn't see anything on the LCD screen- it was pitch-black ! Even my 4 year old Olympus camera was able to give me a hint of what I was shooting at in the dark. Anyway, using the AF lamp I was able to take some pictures, but then I gave the camera to somebody else it was pretty annoying- the pictures had to be taken over and over again...bottomline: I sent the camera back the next week after comparing it with other cameras. I ended up buying the Canon PS700- yes, it only has 6 MP, but what a handling and picture quality. And honestly I have not seen a difference to the 8 MP pictures.Sorry Sony, but for the price and without an optical viewfinder I would at least expect a display I can work with. Otherwise the camera deserves 5 stars.", "Date": "July 15, 2006"}, {"Title": "Great camera", "Author": "Demanding User \"A demanding user\"", "ReviewID": "RAHBYWLTO6ZJL", "Overall": "5.0", "Content": "Photos were excellent. But photo print quality depends very much on the print shop. For the same photo file, it can look like a 4M photo when taken to a below quality printer shop. Photos taken indoor with marginal lighting (no flash used) turned out to be yellowish. Battery life is very long despite its large 3\" LCD. Battery charging time is over 3 hours - too long. Photos files viewed on computer looks just great. 8'x10' prints are great but have not tried larger prints. Touch screeen control is a delight and very easy to choose and set. Date on photo is red (would be better if it is black). And the location of the date is not at the far right hand corner.", "Date": "August 26, 2006"}, {"Title": "Almost perfect...", "Author": "Gadget Geek", "ReviewID": "R3K8HPFTREGVMX", "Overall": "4.0", "Content": "I've had the N1 for about a month now and have been pleased with the performance and quality of the N1.  I had a SLR-like camera that was rather heavy and inconvenient to bring around.  With this N1, I can bring it with me anywhere I go!Pros:- lightweight and compact 8 megapixels!- 3 inch screen!- touchscreen with easy navigation through the menus- high quality mpeg videos.  Unlike some other cameras that limit videos to one minute clips, the Sony N1 allows you to record as long as you have capacity.- crisp and vibrant photos- battery lasts a fairly long time.  Lasted over 400 shots (with and without flash).  Actual length will vary depending on usage.- built in album/memory- can take photos in burst mode- has many pre-set modes to choose fromCons:- When recording in video mode, the N1 cannot zoom.  You can only zoom before you begin recording.- Didn't come with any cheap camera sleeve- Didn't come with even a small memory stick (perhaps I've been spoiled by other camera manufacturers that give at least a 16MB or 32MB card).- When shutting off the camera, the lens cover sometimes does not  close completely (could just be isolated incidents).- might have been nice to also have the old manual viewfinder when you want to save your batteries- Taking videos drains the battery pretty quickly- No image stabilization feature (knew that it didn't have this before I purchased. it would have been nice to have it though as many of the new high end compacts have the feature)- uses the Memory Stick Duo (the smaller one).  Many laptops come with built-in card readers nowadays, including compatibility with Memory Stick Pros.  However, none that I know of have a slot built in for the Memory Stick Duos; therefore, I always have to bring along the adapter, or the included USB cable.- LCD can get dirty with fingerprints- Shutter lag for higher quality shots (5MP-8MP)Recommendation:With the prices for flash media dropping, I would recommend getting at least a 1GB card memory stick.I've uploaded a chart showing the estimated capacity of various sizes of memory sticks.Overall I'm happy with this, and would recommend it to anyone who can afford to spend a bit more for a point and shoot camera.-------------------(Edit 2/27/07):  I noticed some places are still selling this camera.  If you're still in the market, I would advise you to look at the Sony DSCN2, which is the updated version of this camera.  This N1 has since been discontinued.  The new one is 10.1MP and I believe also has image stabilization.", "Date": "June 12, 2006"}, {"Title": "Sony DSC-N1 great vacation and diving camera", "Author": "JFJones \"Jim\"", "ReviewID": "R1QY15XTZIIFZO", "Overall": "5.0", "Content": "I purchased a Sony DSC-N1 in early December. As it is a new camera, spare battery had to be ordered from Sony.  The camera did great at Christmas as it has an F 2.8 zoom lens, has a 3 inch Touch Screen / LCD and is very compact.  I decided to leave the big Nikons and Canon SLRs at home for our January Cruise to Cozumel.  The Sony was excellent.  My wife was shocked when I put the Sony in it's waterproof Dive enclosure when I went Scuba Diving off Key West.  The camera worked flawlessly at 47 ft depth.  Following the dives, I took photos on surface and in town with the waterproof housing still attached.  All came out fine.  In total, we took 963 photos on vacation. It was useful to have a portable computer along. I dumped the accessory 1 Gig memory stick daily.  BE SURE TO Follow instructions when transferring images from camera to Computer.  I failed to turn the camera off before connecting to USB port and lost my photos for that day.  Returning home, my wife had a knee replacement, and the trusty Sony has been there pre-op, post-op in recovery, etc, recording her daily progress including photos of her xrays, and macro shots of her sutures.  In summation an excellent carry camera, with great flexibility, and well designed controls.", "Date": "February 1, 2006"}, {"Title": "Tremendous", "Author": "Donald Signorino \"Don\"", "ReviewID": "ROK30KBLO9ZEM", "Overall": "5.0", "Content": "I've had the DSC-N1 for about a week now, and I love it.  It is the best camera I've had so far, and my first Sony.  I went form the Kodak DX 7440 to the Casio EX-750 to the DSC-N1.  The 3\" screen is tremendous, there is no other way to describe it.  Not only large but clear from all angles, in almost all lighting conditions, and a very fast refresh rate and GREAT resolution and color depth.  I know, it sounds over-the-top, but you have to see just how good this screen is.  The touch-screen is somewhat unique.  It takes a bit to get used to, and at first I wasn't sure if I liked it.  Having spent a week using it now, I love it.  It is pretty intuitive (although some menu placements are not).  I think this may be a love-it-or-hate-it type of feature, but I love it.The camera is very responsive, the menus are fast, and the focus has been dead-on accurate.  The flash works well, and seems to evenly light the subject area.The detail is great so far on screen and after printing.  I have no complaints at all.  The large screen is great for playing back your pictures (with many slideshow options with sound) and sharing with others.  I have the docking station also which works great and has a remote control...To summarize:- AMAZING 3\" large screen- Reliable focus- Good flash- very good detail and even lighting in photos- Quick response to shooting and menus- Unique touch screen", "Date": "December 8, 2005"}, {"Title": "The best camera I have ever had.", "Author": "Shaunspad", "ReviewID": "RM0E7U7PBXMMX", "Overall": "5.0", "Content": "Ok so I bought a Canon powershot about 6 years ago that was 2 mega pixels and I sold it within a few months.  Bad battery life, slow to view pics etc.  Then I didn't get another camera until this Sony DSCN1.  I received this camera about a month ago and have taken hundreds of photos with it.  I'm not a big picture taker since I remember back in the day with the film and flash that it always seemed that half of my photos did not have the correct lighting.  This camera takes care of all the worries for me.  I just set it on auto and it does auto everything.  They should call it automatically take every picture the very best you can.The pictures that come out this little camera are freeking amazing.  They are so clear and crisp.  I absolutely love this camera.  The battery life is phenomenal I took well over 200 photos and did the slide show a few dozen times and the thing still had 1/4 battery life.So here is my list of things I like.1. Touch screen which is very cool, fast big, and easy to use.2. Picture playback, fast it moves through the pictures on the camera in no time at all.  Not like the Canons that sit there, thinking, thinking, thinking oh here is the photo.3. Compact size and feel.  Very sturdy light weight and packed with features.4. Slideshow feature is so freekin cool.  Everyone that has seen it loves it.Ok here are the things I don't like.1. that big nice touch screen ya well it can scratch and there are not any pre cut screen covers for the camera.  I took a film for a PDA and cut it to size to solve the issue but It would be nice to have a pre cut one that could be bought.2. The photo cd making software that comes with the camera didn't detect my cd burner so I had to save it as an image file and image files can only be burnt to a disk using Toast for the Mac. Didn't like that feature too much.That's it everything else I love about this camera.  I would recommend this camera to anyone who is looking for a nice camera that does it all and makes it easy for those of us whom are not photographers.  Great batter life, small size, amazing pictures, and a good quality brand make this camera a 5 for me.", "Date": "April 6, 2006"}, {"Title": "not worth the price", "Author": "tjh1498", "ReviewID": "R98WIHIQD75YR", "Overall": "3.0", "Content": "I bought the Sony DSCN1 and tried it out for about a week, but ended up taking it back.  I wanted this camera to replace my 2 yr old Nikon Coolpix 3100, which is a great camera.  I was really hoping for something that would take good action shots.  The DSCN1 takes great pictures but they're not any better than my 3MP Nikon.  I even made an 8x10 from each of the cameras and the Sony pics aren't any better than what I get from my Nikon.The DSCN1 is a fun camera with the slideshow, music, etc. but if you're looking for a high quality picture from your camera, the price of the Sony just isn't worth it.  There are too many other cameras out there that will give you as good of a picture as you will get with this Sony at a much less expensive price.If you decide to buy a camera I do recommend that you purchase it from Amazon based on their return policy.  I bought this camera at Circuit City for $475 and was charged $71 to return it.  I do not recommend purchasing a camera from Circuit City due to their return policy unless you know without a doubt that you will keep it.", "Date": "March 6, 2006"}, {"Title": "Solutions to video noise and the lack of a viewfinder", "Author": "Alan W. Young \"analytical geek\"", "ReviewID": "RSRAXJTE9DH2H", "Overall": "5.0", "Content": "First, and foremost, this is the best digital camera I have ever owned. It is very important to always have the camera mode set to \"Program\". After reading reviews for weeks, prior to buying the camera (Used for 3 days), two complaints stand out. The video noise, while using the playback, and the lack of a viewfinder.  The noise is eliminated in the video recording mode by setting the \"Focus\" menu to infinity or either a lower setting (7.0m, 3.0m, etc.). I may add, the results are always better when you do not use the zoom while video recording. Since this is a 3X optical zoom, moving closer to the subject is better. When you watch professional movies, you will see less zooming because most cameras create a sound, which can be annoying. It is a must to use the pro duo memory stick, using the 640(Fine) setting. Second, the viewfinder is not an issue, when you 1.)Turn on the AF Illuminator, 2.) Set the camera mode to \"Program\", 3.) Increase the EV to \"+2\", 4.) Set the Flash Level(see the menu under the infinity setting) to \"+\", and set the Focus to either \"Center AF\" or \"Spot AF\". These seem like a number of steps, but believe me, it will come second-nature, when you practice, practice, practice. This camera is an unique individual. You paid for it, so, use it and it will prove it's worth. I have no complaints, that this camera's built in features cannot be remedy. This camera has unlimited possibilities.", "Date": "January 6, 2006"}, {"Title": "Great quality and the touch screen is easy to use!", "Author": "Jack Rip", "ReviewID": "R22V150ESW8R1Y", "Overall": "5.0", "Content": "This is the second digital I have owned and I have tried a couple of others. My first digital was a Kyocera 5MP S5. I was looking for a camera the focused faster and had good low light capabilities.The DSC-N1 has a very fast autofocus and this makes getting moving objects easy. In fact it makes getting all shots a lot easier.  The autofocus is the best I have used. The low light assist lamp makes getting night shots easy and works well inside or near the subject.  The DSC-N1 focuses quickly in low light.The screen is really is easy to see in bright sun and fairly good in low light.  I was sceptical about not having a viewfinder but the screen works great. The touch screen works impressively. It was easy to figure out the menu system and the touch screen works great with just a finger.  I believe that a lot cameras will be going to the touch screen in the future.  The touch screen makes changing settings quick and easy.  The best part is that the DSC-N1 works perfectly in the auto setting.The movie mode is easy to use and good quality.  The ability to take long movies really makes this feature much more usable.  I am impressed with the stability of the the photos during the movie mode.  The movies play back smoothly on the 3 inch screen.The flash is really impressive for a point and shoot camera. It will easily reach 15 feet or more.  The flash gives full coverage over large groups of people.  The battery life is a good as the spec's say. I have used the camera all day several times and have not came close to using up the battery.  The battery stands up well to heavy flash use and the battery recovers quickly between flash shots.The photo album is a fun feature for showing friends pictures. The 3 inch screen also helps because several people can view the screen at one time.  The drawing capability is a waste of time for me but a few people may use it.The only low point(maybe) is the thickness when you compare it to the ultra compact camera's on the market. No ultra compact can offer the pictue quality, features and 8.1 MP of the DSC-N1 at this time. The DSC-N1 fits easily in a pocket and can be carried around without catching any swithes on your clothing.I plan on purchasing the marine pack and using this camera for scuba diving. This camera has the highest megapixals count for a compact camera with a underwater scuba case.Sony should really have a HIT with this camera.", "Date": "December 13, 2005"}, {"Title": "Sony has another hit!", "Author": "wetSANDBAG", "ReviewID": "R19WZ43OVVU9FK", "Overall": "5.0", "Content": "As stated by many other customers. This camera is full of features. The touch screen is large and the pictures are easy to review/edit. The digital zoom function works great. Take a picture, zoom in a section and make new picture that still has great resolution for 4\" X 6\" prints. I have tried this and the pictures look great. I have not tried larger sizes yet. The paint function allows you to doodle on the pictures and save another picture without disrupting the original. The power 'on' delay is short, so you are ready to shoot in a couple of seconds. The bad part is that the docking station and memory stick duo pro is not included. This would have been a good thing to have in the package. So, plan accordingly when purchasing this camera. You can take a few pictures without a memory card and they will be stored on the internal 26MB storage. Did I mention the pictures look very good? Many preset options for shooting in different conditions as well as the manual mode. The touch screen makes this camera a snap to set and use. I was able to navigate through the menus quickly. Even a novice will have fun with this camera right out of the box. Try it. I think you'll love it. The lack of included hardware (docking station, memory stick duo pro) is not a deal breaker.", "Date": "August 9, 2006"}, {"Title": "Great Image Quality", "Author": "Ricardo Mendillo", "ReviewID": "R1W9K0FVL4DSA1", "Overall": "5.0", "Content": "I own the DSC-N1 since November 2005.This is the first ultra-compact model that offers a massive 3.0-inch touchscreen LCD. The battery lasts for hundreds of pictures, anyway you will need an extra battery pack.The shooting performance is very impressive. In Normal record mode, the shot to shot delay with and without the use of the flash is incredibly fast. (less than 2 seconds).It offers various image adjustments for sharpness, contrast and saturation, which will allow you to \"dial in\" that certain look. The Carl Zeiss 3x optical zoom lens helped produce sharp images throughout its 38-114mm (35mm equivalent) range, which are virtually free from any signs of chromatic aberrationMovie mode produce very good results. Overall the 640x480 Fine mode captures high-quality movies, with very little compression noise.Sony DSC-N1 is a very convenient digital package that offers great image quality, speedy performance, and a very cool touchscreen LCD.Its 8M Fine images have more than enough resolution to create stunning 13x19-inch borderless prints. Very light and small to carry in your pocket, almost the size of a deck of cards. Taking pictures is a snap when using either of its fully automatic modes", "Date": "May 6, 2006"}, {"Title": "Impressive Features in a Compact Camera", "Author": "Jayant Jain \"jonty\"", "ReviewID": "R9I3FO3XWCTX8", "Overall": "5.0", "Content": "I have been using this Sony DSC N1 for almost 4 weeks now.And here is summary on this camera:Pro:1. Compact (Though not ultra compact)2. Very short recycle time3. Lot of modes and settings to play and adjust your photo4. Cool Slide show on internally stored upto 500 photos5. Excellent Battery life6. Beautiful video in mpeg formatCon:1. Expensive (unless you get a great deal, it may not be worth the value)2. Some photos look warm on LCD screen in low light condition ( but look OK when you see on the computer)3. Need to purchase expensive memory stick pro duo4. Touch screen looks fragile (I am looking for a protector for it)In all this is very good camera and the 8.1 megapixle resolution is almost like 5x optical zoom on 5MP camera.", "Date": "May 18, 2006"}, {"Title": "The small wonder", "Author": "Elaine G. Howe", "ReviewID": "R2WTXRP7XCDWKU", "Overall": "5.0", "Content": "The camera is a superb, light-weight wonder.  The controls are logical and the large display area is amazing.  I love it.", "Date": "August 15, 2006"}, {"Title": "The Best Cybershot Camera on the Market", "Author": "M. E. Spierling", "ReviewID": "R35PWVKA7PURMO", "Overall": "5.0", "Content": "I have the Sony 7.2MP and just bought the 8.1Mp.  The pics are great and overall improvement from the 7.2.I use a digital camera primarily for adventure travel and wildlife photos so this is perfect especially if you are someone like me who takes a lot of photos while kayaking or horseback riding or hiking.  You can even buy a magnet attached telephoto and/or wide angle lens (thru another website) which really makes you appreciate the quality of this little camera.The only complaint is that the battery does not last long so it is vital to have a 2nd battery unless you plan to recharge it every other day.  The large touch screen is a great improvement and a real advantage for vision-impaired people like me who need reading glasses for upclose vision.", "Date": "June 16, 2006"}, {"Title": "In love...", "Author": "Rachel", "ReviewID": "R3QRQITNNURFFK", "Overall": "5.0", "Content": "After at least 6 months of intensive research to replace my old 2MP Fuji, it came down to the Canon SD550 - until I saw the Sony DSC-N1.  I bought the Canon SD550, which was very good and had a sleek design, but I returned it because I could not get the image of the DSC-N1 out of my mind!  It was like love at first sight, and I HAD to get it! So my Canon and I parted and the feeling's been great ever since I got the Sony.  It's been about 3 months now, and I am addicted to this thing!  So here's my review:Likes:Compact3\" LCDTouch screenPicture qualityResize - Can easily resize pics. If you're running out of space, you change the size to VGA then later resize.  A 1 GB card can take over 250 pics at max resolution 8 MP; change to VGA and you can take over 6,000 pics.Album - The album organizes pics by date and has an index feature to easily find the pics.  Also, pics deleted from the memory card will still be stored in the album, unless you go in the album and delete it too.  This is the only function I love/hate - to delete you have to do it twice.  The album is cool because you can always go back to your pics for viewing after you transferred to the PC and deleted from the disk.  Plus, it uses minimal storage because the pics are stored as VGA.Slideshow - Very neat transitions and you can download your own slideshow music too.Camera modes -Auto mode works best in light. For low-light, Program and Soft Snap modes work great.What could be improved:Video quality is poor in low-light settings.  Looks good only in bright light.Body not sleek and smooth like Canon SD550.Optical zoomPaint function--just blah!Viewfinder would be niceOverall, need I say? This is camera is GREAT!!!", "Date": "February 25, 2006"}, {"Title": "Best compact 8MP camera available.", "Author": "BlackBanana \"Go, Banana!\"", "ReviewID": "R2NNTPMIGHAV1Y", "Overall": "4.0", "Content": "Went ahead and pre-ordered this camera back in September of last year, because it looked so darned good.  It was supposed to be a replacement camera for my old 3MP Canon Elph (awesome camera btw), but instead it's been so much more.  Now that I've had it for a while I can tell you what sets it apart from most of the cameras in its price point.For one, it takes incredible movies (in fine mode).  While a lot of cameras feature movie capture, this one really is like having a full blown DV-camera in your pocket.Secondly, macro.  I'm sorry, but this feature should be standard on a lot of comparably priced cameras out there now.It also takes some of the most accurate photos colorwise.  In my experience, Nikons made skintones look sorta ashen and the Canons were a little over saturated in the reds.  This one is spot on across the board.It also does every other positive thing the previous 50 reviews mentioned.However, at the 5MP and 8MP settings this camera is slow in the shutter speed department.  The Canon Elphs are great for taking fast, from-the-hip candid photos while this one is best suited for stationary set ups.  And even in \"Monitor\" mode some of the pics come out soft if you try taking them while moving.Another thing I've noticed is that is has trouble with backlit subjects when in Auto-Flash mode.  You end up getting a lot of silohuetted subjects unless you reset to Forced-Flash.  I don't know, but my Canon never had trouble distinguishing a low lit foreground object and applying the flash accordingly.Something to think about.", "Date": "June 22, 2006"}, {"Title": "Sony Cybershot DSC N1", "Author": "L. M. Kasik", "ReviewID": "R1PRPB474ILWWV", "Overall": "5.0", "Content": "Quick, compact, light and brilliant pictures but lacking veiw finder and \"anti-shake\" system", "Date": "August 27, 2006"}, {"Title": "Not for use in dim light", "Author": "H. Morgan", "ReviewID": "R1IUVP2KXOWMKP", "Overall": "3.0", "Content": "For the most part this is a wonderful camera.  The touchscreen makes it incredibly easy to use.  My only issue is that in dim light it is impossible to see your subject in the LCD screen.  This issue becomes worse when you are zoomed in.  The issue is significant enough for me that I am returning the camera.  I have used other cameras where the LCD brightness was increased as you zoomed in.  Cameras with a viewfinder of course do not have this issue to the same extent.", "Date": "January 4, 2006"}, {"Title": "excellent cam", "Author": "Carlos Di Ponio \"cd\"", "ReviewID": "RDNYKX14RMUYY", "Overall": "5.0", "Content": "This camera is fantastic. I didn't know to pick it or a canon, but any camera in this class is going to be great. The picture quality is amazing, the screen is great. Drawback is that the optical zoom is only 3x. Still, great camera, excellent purchase. Very light despite other cameras being more compact. I highly recommend", "Date": "August 10, 2006"}, {"Title": "Excellent Digital Camera", "Author": "Charles S.", "ReviewID": "R190X7KPNN3UVV", "Overall": "5.0", "Content": "My wife wanted a small digital camera to keep in her purse, so I got her the DSCN1 for Christmas. We have taken at least 300 pictures so far and most are quite good. The camera is sturdy and well made and the screen is beautiful - it's really fun to show people pictures on this amazing screen.We really like the slideshow feature where the camera creates a slideshow using your photos, adds some cheesy transitions and some music. Our friends and family really like this feature, and it's great to pass around the slideshow at a party.It takes some time to get used to the touch screen, and it would have been great to have real buttons for a few of the most common features, such as turning on the flash, but overall I like the touch screen. Battery life is good, and the camera has almost no shutter lag.The camera is missing is an anti-shake mechanism, but this is not a major issue. Overall this is a great camera.", "Date": "January 21, 2006"}, {"Title": "First and Greatest", "Author": "Mark Losasso", "ReviewID": "RSE1CQ5JJMGN5", "Overall": "5.0", "Content": "I am in the technology field, yet never could bring myself to go digital when it comes to picture taking. I love this camera. The display and touchscreen are great. The video, which I thought I would never use, has been unbelievable. There is nothing I found that I do not like!", "Date": "December 9, 2005"}, {"Title": "Oh, the Disapppointment", "Author": "CyberLouis", "ReviewID": "R3W4L49NWIV9", "Overall": "3.0", "Content": "This camera has all the features I wanted.  I was upgrading from an older Kodak EasyShare CX 6330.  My main reasons for changing were the need for a bigger screen and for faster focus.  I also wanted a smaller camera.  Well, I got two out of three:  bigger screen and smaller camera.  However, the focus is not significantly faster.  With the Kodak, my out of focus pictures were about 1 in 10.  I would say my ratio has gone up to 2 out of 10.  Don't get me wrong, these cameras do focus, but you have to wait for them to do so.  When you are on Broadway waiting for Hugh Jackman or Ralph Fiennes to come out of the stage door, you do not have time to be focusing.  One second too many and you will miss the picture.  While the Sony is a little faster, you have to wait or it will really be out of focus.  Also, I have noticed some graininess in some of the pictures, especially a few taken at night.  I never noticed this with my old Kodak.  The other shock was the date stamp.  Am I the only one that uses this?  The EasyShare Timestamp was yellow, very clear and professional looking.  The Sony time stamp feature is HORRIBLE!!!.  The numbers are sometimes not clear, sometimes they blend into the background and never look professional.  Unbelievable. Also, be prepared to buy additinal memory.  The memory provided with the card is not sufficient to hold all that much.  Finally, sometimes linear objects have a slight zig zag effect (not good and a step down from my Kodak). Still, there are positive qualities to this camera.  The menu is somewhat easier to use, I love the touch screen, and when it is in focus, the pictures looks good.  The screen is large enough to show people pictures on it without having to download.  I also like the videos which look ok (of course, you MUST purchase additional memory to hold any significant amout of video).  Finally, I love the size of the camera--it fits in a pocket of a shirt or better yet, a cargo pant. Overall, it's ok, but at this price should be  better.", "Date": "July 4, 2006"}, {"Title": "love the southwest", "Author": "lumpy's mom", "ReviewID": "RA8HXH258NVPW", "Overall": "5.0", "Content": "I am from the east coast; last year I discovered the southwest. I have a coolpix 4600 which takes good pix but I didn't like the dials or onscreen indicators. I went searching. I read the online reviews. They are true. The wonderful 3 inch LCD screen IS difficult to see in the bright glare of the Great Basin Desert - but so what! As a reviewer said, this camera is FREAKIN' AWESOME!!-the answer to a prayer. It is simple, yet it offers many choices, - logical - small -beautifully made. If I never leave AUTO MODE-so what  again!!!  With the movie capability it is a good back up for my sony mini dvd. Did I mention the \"over the top\" slide show with choice of music and special effects?  I bought it from amazon to avoid pressure sales and for no-fuss return policy [won't need that!]. Buy the extra battery, and the memory stick pro due 2G [60 bucks!] at the same time. That is really all you need.", "Date": "May 31, 2006"}, {"Title": "Sony DSC-N1 digital camera", "Author": "J. Kelly", "ReviewID": "RFBVJ8YYHAQ6C", "Overall": "5.0", "Content": "This is my first digital camera, so unfortunately I don't have much else with which to compare it.  I purchased it inHong Kong mid-November 2005. I guess it was fairly expensive, but it seemed way ahead of anything else available at the time.The camera boasts 8.1 megapixels and produces an extremely detailed image.  It also has a huge 3 inch LCD touch screen.  It takes still images as well as movies.I find navigating the menu on the touch screen very easy and the large screen is an advantage when viewing the images.You will get fingerprints on the LCD, but that's to be expected.  There's a little stylus that comes with the camera, which you can use to add special effects to images.The slideshow facility is excellent.  You can vary how the slideshow looks - less effects, pictures remain on the screen longer, different music, etc - and, to me, it's a main feature of the camera.  I don't think any movies taken will be included in the slideshows.Software interaction with my computer is okay, but I still haven't managed to download any of my own music to the camera for slideshows - only tried once, though.I won't go into the specs here, but images are stored on the  internal memory as well as the on-board Duo Pro memory stick.I find the camera a pleasure to use and can't really find any fault with it at this point.", "Date": "November 25, 2005"}, {"Title": "Better than I expected !", "Author": "Mc.Chong \"Mc.Chong\"", "ReviewID": "R1I0FM1H8NT7W9", "Overall": "4.0", "Content": "This is my second camera, my first is Konica KD220Z (2mp)it gave me awful pics so I was looking for a new one, I'd seen this N1 in an online shop but never interested it because I focus on CASIO 850 and wanna buy 850 for sure ,sadly everytime I went to shops 850 still not available to sell so I got back to my computer and seached some more while I was waiting my 850 and I got sample clips captured by 850 it quite awful VDO, my need is a compact digital camera which has LESS cons (can shot photo and VDO well both), so I headed up to SONY N1 (I'd tried it once at Sony's local shop) , the truth about my foolishness is I was about to return it since I'd seen T30's advertisement, I used to think N1 was an entertained piece but I went wrong ! It can do anything as great camera (I've compared pictures from N1 and T30 and others), Sony has just focus and advertised you on its Slide&paint; function more than its real abilities, N1 gives me great pictures !!,(In my opinion)if you wanna buy Sony , do not fool yourself buying fashion T-cam, buy N1 and you'll love it. I've compared EVERYTHING !Pros-3\" touch screen ,give you quickly responses !-Sharp & clear pictures-Slides&paint; function(but these're not important to me)-Many functions to let you fit it for your photo stylesCons-N1 is the most expensive camera in its class !!! (this time)-Not suitable for taking pic in low light (The same problem for non-SLR camera I think )-Bigger than any compact camera-Because of it's touch screen type, it is filmsy you need to buy LCD protecter film to protect your LCD !", "Date": "May 17, 2006"}, {"Title": "This camera is awesome!", "Author": "Jason Frost \"RubiconReader\"", "ReviewID": "RYCAR1ZLW7M37", "Overall": "5.0", "Content": "My first digital camera was a Sony Mavica, remember that one?  You had to use a floppy disc to store the pictures?  Not a bad camera for it's time but THIS camera (Cybershot DSCN1) is nothing short of amazing!I can't believe how clear the picture is, nor can I believe the ease of use! I find myself taking pictures of all kinds of stupid stuff just so that I can use it!  I haven't tried all of the different programs on it but I'm curious about the \"fireworks\" feature and wondering if it works on Christmas tree lights.We love to go looking at Christmas lights and I wonder if I can capture some of them this year.  If you are thinking of getting a camera then I highly recommend this one!  The only \"problem\" I had was trying to find this camera in stores.  I went to Best Buy, Circuit City, Ritz Camera, and Sam's Club and no one had it.They all told me that it was too new and to wait a little while... NOT! If a camera is new then that is all the more reason to get it out.  Anyway, I ended up ordering it from faitful ole Amazon and got it here in two days... right before Thanksgiving!  :-)A bit expensive but worth every penny and I have yet to try everything on the camera yet.  Have a Merry Christmas yall!", "Date": "November 27, 2005"}, {"Title": "Better than before.", "Author": "ANDREA LOPES", "ReviewID": "RWMGECRCV2G22", "Overall": "5.0", "Content": "My first digital camera was a Sony P9 about five years ago. Then I had a P150 and now the N1.I can say that the picture quality was improoved, specially in therms of noise reduction. Another thing that I think it's better now is the flashlight. Indoor pictures wasn't so good with my other cameras, but with the N1 I can get great indoor pictures! No more complains!This camera is very light and thin. You can put in your pocket.The 3\" touch screen is amazing too and I don't want to exchange it with any other feature of any other digital camera on the market.You can also watch your pics as a slideshow with different effects and music. It's very cool to show the pictures on the camera without getting people bored. They just love it!I did like all my other Sony cameras, but i can say that with the N1 I had a different feeling... I just don't want to change it even a bit...Just buy it! You are going to love it as I do.", "Date": "May 17, 2006"}, {"Title": "Not worth the price.  Would recommend DSC-P200 instead of this", "Author": "Ganesh Kumar Eswaran \"Ganesh Kumar Eswaran\"", "ReviewID": "R395JUQM555295", "Overall": "3.0", "Content": "DSC-P200 is half the price of N1 and has almost similar features to N1.  I would recommend that instead of N1.  Below I have listed the features that differ between N1 and P200 and I have added my comments whether the extra features of N1 are worth the price:Max resolution7 MP of P200 is more than enough for home photosSlide Show featureAd for N1 says it can create dyamic slide shows with transitions.  Nice way of marketing.  Who will want to view the slide show in camera or by connecting to TV.  Its always easier to download to computer and create any type of shows you want.  You can connect both N1 and P200 to TV and watch slide shows.  But P200 it does not have transitions between photos.  No point in paying extra money for N1 for such a useless featureISON1 has higher ISO.  This is important if you want to shoot professional photos.  N1 is better in this aspect.BatteryN1 does not come with charger and cradle.  You have to buy this extra.  Be careful.  P200 is better in this aspect as you can easily charge the camera with included wall chargerFlashN1 is better in flash rangeWeightN1 is only slightly lesser weight.  Not worth paying extra amount for the slight weight reductionDimensionsN1 is only slightly smaler.  Not worth paying higher price just for that.  Remember, if the camera is too light it will cause you to shake it more and get bad picturesViewfinderP200 has view-finder.  This very important especially when you are running short of batteries or when there is too much sunlight and you are not able to see through LCD properly.  N1 does not have this very important featuresWhite balanceP200 is better as it offers auto and manual control too.  N1 offers auto control only.Movie:P200 can shoot 5 frames per second wherease N1 can shoot only 4 fps.  P200 is better in this aspect.LCDSmaller LCD is better as it will consume less battery.  Bigger LCD looks good but consumes too much battery and gets scratched more easily.  N1 has large LCD that consumes more battery.Touch Screen Menu in N1Touch screen is a pain to use in such a small screen as the menus will be too small to touch accurately.  Sony provides a stylus.  That makes it an extra pain to carry the stylus without losing it.  Touch screen is good only if the LCD is large and the buttons are big.  Also when you are viewing through the LCD and want to adjust some settings, its a pain to keep touching the LCD for menu selection.  Its much easier to select through regular buttonsPaint function in N1Useless feature.  Its such a pain to draw on that small LCD.  3\" LCD is big for a camera but definitely smaller than computer monitor.  Its easier to download and edit photos on the computer.  Computer definitely gives more options and an option to save the original intact.  If you modify the picture on the camera you lose the original.  If you make a mistake in editing, the original is gone.", "Date": "May 2, 2006"}, {"Title": "Sony Cybershot", "Author": "D. W. Ferguson", "ReviewID": "R3AQJ8LNRWX1O4", "Overall": "4.0", "Content": "I have been using my Sony Cybershot DSCN1 8.1MP for about a month now. It's so easy to use.  And, I love how you can easily delete picture via the touch screen.  The only issue I have with it, is that I can't use the Memory Pro Stick with my Sony photo printer (a 5 year old model), because the stick is not compatible.ps: don't forget to buy a memory stick pro if you purchase this camera. you're gonna need it.", "Date": "August 13, 2006"}, {"Title": "Great small camera that I recommend", "Author": "Wallace E. Olson", "ReviewID": "R3H3JS4VCN3AZN", "Overall": "5.0", "Content": "We really love our Sony Cybershot. It was purchased for the purpose of taking lots of family shots at family outings. The reasons we purchased the sony were: the small size, very easy to use, the 3 inch viewing screen, the carl zeiss lens, and of course the 8.1 mega pizels, plus the overall high quality. What I did not like was the PC software, it's not the easist to use, and on the Mac, I just use iPhoto, which works great. When we purchased the camera, we also bought the 2 GB memory stick, which I have not come close to filling, and the cybershot case, whichreally protects our camera. I would highly recommend this camera.", "Date": "July 25, 2006"}, {"Title": "Nice camera!", "Author": "D. S. Gustafson", "ReviewID": "R2TL2D1GIQF4CL", "Overall": "5.0", "Content": "I am not the most experienced photographer, but this camera takes terrific pictures, in my opinion.  Nice big LCD screen and the touch screen is a great feature.", "Date": "September 6, 2006"}, {"Title": "INCREDIBLE!!! Little Tiny, Great Battery Life", "Author": "G. Pendergrass \"TOOL LOG\"", "ReviewID": "R3LNS7XV3X3GKH", "Overall": "5.0", "Content": "This one does it all, vivid resolution with long battery life.  Fully auto or fully manual,  Many picture taking options to adjust focus, lighting, flash levels, aperture width, shutter speeds of 1/2000, even simulated film speed.  A beautiful piece of machanics stylish brushed aluminum, with a bright, hi resulution rear touchscreen LCD.  Internal memory can store about 150 picture at 3mp. I'm very pleased, just amazed every time I view my photos.  THANKYOU SONY.  I LIKE IT. I LIKE IT ALOT.", "Date": "January 22, 2006"}, {"Title": "Fabulous Digital Camera", "Author": "Kyle A. Locascio \"gurlfriday\"", "ReviewID": "R3EWISPZ1Q87UC", "Overall": "5.0", "Content": "This is not only a very good camera, it is also easy to use.  I am not very good at learning new technology (although I do manage to do it) but this was a snap.  The photos that I have taken with it are awesome, even when I just print them on plain paper in my copier.  Get one, you won't regret it!", "Date": "July 14, 2006"}, {"Title": "Great Camera!", "Author": "L Guiot \":O)\"", "ReviewID": "R38UG80VMEF0SN", "Overall": "4.0", "Content": "This is a very good camera with many nice features! The only con i found is that the menu is very big and it kind of hinder the pictures when trying to take a look of them!", "Date": "July 12, 2006"}, {"Title": "Nice camera", "Author": "K. Khakhriya \"Kishor\"", "ReviewID": "R16HHQXFE5X8W7", "Overall": "5.0", "Content": "This is wonderful camera. Very easy to use and can carry in pocket. Though I am not a professional photographer, I can say this camera has substance and value. I took couple of pictures in bright sunlight and dark (night). I find bit difficult to focus an object in dark as there is no optical view finder. This could be because of some other settings required. I am fully satisfied with this little camera.", "Date": "December 5, 2005"}, {"Title": "Simply the best Pocket Size Digital", "Author": "SJH AZ", "ReviewID": "R2NK3U6X4MNSW8", "Overall": "5.0", "Content": "This is by far the nicest pocket sized digital I have used or owned.  The screen size and touch screen give that Total WOW!! factor to anyone you show it to, myself included:)  Takes GREAT pics and video, controles are easy to use and understand.  Hard to believe you can fit so much quality and features in a package so small.  Be sure to buy a small soft camera case \"same day\" as you will want to protect your beautiful/huge touch screen right away!11/06 update - Stolen on a Cruise so I bought the new DSC-N2, SCORE!!!", "Date": "April 5, 2006"}, {"Title": "Love it...Love it....Love it", "Author": "R. Myron \"tizme\"", "ReviewID": "R2RGTYPL731GPQ", "Overall": "5.0", "Content": "I owned 2 Kodak digital cameras and they both broke after a year or two....Was looking into another camera and after much research decided on this camera.I love it!!!!-The pictures come out great-Love the touch screen, although sometimes get a little lost trying to get to where I want-everyone I show is really impressed with the slideshows.-I am able to keep the pictures I really want to show on the camera without taking up room on my card.-Haven't used the paint feature much, but can see several uses for it.Overall it is the best camera I have owned!", "Date": "May 5, 2006"}, {"Title": "EASY USE AND GREAT RESULTS", "Author": "Joshua R. Sulak \"Surfinjosh\"", "ReviewID": "R2WCIZZ696N8IU", "Overall": "5.0", "Content": "I am a technology guru and this camera is simple to use and has great results. The touch screen is awesome!!! Battery life is so much better than other cameras i have owned. I think this one will outlast and perform any of them. BUY IT NOW if you want a quality camera that will make you happy!!!", "Date": "October 6, 2006"}, {"Title": "Impressive", "Author": "Steve Saunders \"bacchuss\"", "ReviewID": "R3IUNT5T5D77HM", "Overall": "4.0", "Content": "At first I was a bit worried as whether or not I choose the right camera. However as I learned the various features I have come to like it more and more. Two problems though minor they are. When taking photos it blanks out leaving you to wonder momentarily if you had the right shot. The second is taking photos in doors. The quality can be a lot better. Other than that its a camera I will recommend. The 30\" LCD touch screen is awesome.", "Date": "March 10, 2006"}, {"Title": "The digital camera of the future has arrived!", "Author": "Art", "ReviewID": "R3RQUZCMCBGWF8", "Overall": "5.0", "Content": "I just received this camera today, and I have to say, WOW! Its a very small 8.1 megapixel point and shoot camera that incorporates an incredibly bright 3\" display that is also touch-sensitive, a first in this class.  The touch-sensitive screen is more than a novelty though, allowing you to navigate virtually all camera functions more easily via menus, as opposed to twirling dials and manipulating crytpic buttons on any other conventional digital cam.  The slideshow feature is stunning, and also allows for background music to play during the presentation.  I'm just getting started exploring this small digital marvel from Sony, but so far, no regrets on choosing the DSC-N1.", "Date": "December 29, 2005"}, {"Title": "Simply outstanding. Hats off to Sony engineers.", "Author": "Text \"John\"", "ReviewID": "R1JMCV77IHQD7M", "Overall": "5.0", "Content": "I spent the last 3 months researching what I should buy. I knew I wanted an ultra compact model with the best quality money could buy. It came down to Canon SD550, Canon A620, or Canon S80. The day I was to buy one of them, I learned about this Sony. The more I researched the more I came to appreciate what Sony engineers had accomplished. Sure, Canon makes great digital cameras that may even edge Sony out when it comes to picture quality, but there are so many other factors to consider. I admire Sony for bringing this product to the market.", "Date": "December 17, 2005"}, {"Title": "Returned it the next day.", "Author": "M. Cernuda", "ReviewID": "R25OD40GR5S4DE", "Overall": "3.0", "Content": "When I saw this camera I knew I had to have it. It was my first Sony still camera (I love their camcorders). I've owned Nikon and Canon point & shoots before, but the slickness factor of this Sony was too cool to pass up.After playing with the camera for just 30 minutes I had to return it. While I love the simplicity of the design and the touch screen interface, it was just too slow. Compared to my Canon S70 this was a dog. I kept missing pictures because it took too long to save them. I must admit, I was using the camera's internal memory (nice feature), and not a memory stick. I don't know if that made a difference.If speed is not an issue, this is a great camera to have, otherwise, I say pass.", "Date": "August 6, 2006"}, {"Title": "Exceptional Quality", "Author": "Kare", "ReviewID": "R3C6F77DDR8ZJN", "Overall": "5.0", "Content": "First, let me say I have had this camera for 5 years.  I have never had an issue with the battery life or the touch screen.  The picture quality is not quite what it used to be, but it's still great and I'm not ready to trade it in just yet (I'm also not fully convinced that it's not my photo printer).  The touch screen could not make this an easier camera to learn and use.  There are no little buttons with pictures, the 'buttons' appear on the screen with words rather than pictures, which is what attracted me to this camera.  There is even a primitive photo editor in the camera and a slide show function with music.I can honestly say this was my first Sony product and the quality blew me away.  I now have several Sony products (I am typing this review on my Vaio currently) and this is definitely an excellent one!", "Date": "March 8, 2011"}, {"Title": "A Fun Camera To Use", "Author": "Unknown \"UK\"", "ReviewID": "R24SZ0NXCDYXIG", "Overall": "5.0", "Content": "This camera was a good buy for me.  The first digital camera I owned only had 1.3 megapixels so as far as I was concerned this one was a big upgrade for me.  I very much wanted to purchase a newer camera but was not impressed with a lot of digitals on the shelves.  So many seem small, the screens hard to view and the buttons are microscopic.  I began reading about the first Cybershots released by Sony after a co-worker showed me hers.  I then spent a lot of time looking to purchase a Cybershot.  I noticed that the N1 and N2 models were still quite popular.  I missed out on a couple of N2 models just because I just wasn't convinced I was going to get a good camera.  In the end I gambled and bought an N1 offered by a seller at the Amazon store.  It's one of the best purchases I've made.  For serious camera users this camera may seem too easy to use.  \"Advanced photographers\" will find something to complain about with this type of camera I'm sure.  But I find this to be a good camera for anyone who doesn't want the headache of something complex.  When I\"m at functions (such as weddings) and want to take photographs I don't want to be bothered with anything complicated.  For me this camera makes taking pictures fun.  I love the simplicity of it and the 3.0 inch monitor makes viewing fun.  Within 10 seconds I can have it connected to my TV to watch slideshows or video I've recorded.  Like any camera you have to be aware of things such as proper lighting/distance to get certain shots. But my non-digital camera days are over thanks to this Cybershot. The only way I'll get rid of this camera is if it breaks and if this happens I hope to find another like it.", "Date": "February 22, 2010"}, {"Title": "The best", "Author": "raven star", "ReviewID": "R2PE0MDUTMJND5", "Overall": "5.0", "Content": "I have this and i love it i have droped it so many times and it still takes grate photos i have droped it in coke and let it dry for a day and  it still works i have had this for 3 or 4 years and i love it the video is so good to the best ever i am still useing the fist battery that it came with i can not say enough about this camera!", "Date": "July 27, 2009"}, {"Title": "Nice Point and Shoot Camera", "Author": "www.scottishwallet.com", "ReviewID": "R1YU11EVXT6Z5R", "Overall": "3.0", "Content": "This is a pretty decent 7 megapixel point and shoot camera. The only downside is that you do need to be pretty still in order to get a clear picture. It has a normal amount of shutter lag like most non-DSLR cameras.", "Date": "March 10, 2007"}, {"Title": "4 STARS - Fantastic camera as long as it works!", "Author": "Tattoo", "ReviewID": "RHPF90YGE3EIM", "Overall": "3.0", "Content": "I have had Sony cameras for many years now and I wanted to stay with them.  I was upgrading from a P10 which is a 5MP point and shoot.  After alot of research we bought the N1.  Overall a fantastic camera.  Unfortunatly after almost 30 days and 750 pictures, I have discovered the camera we had was slightly faulty and was giving consistantly poor focus. This mainly affected us inside a house or building. Also I discovered that inside pics tend to have a lot of shading in the background using the standard flash. If you change it to slow-synchro flash, the pictures often tend to be VERY blurry (due to the slower shutter speed). I found out this is caused by the low ISO setting the N1 defaults to which is 64. ISO 64 looks GREAT in the daylight but causes that dark background inside a room (I suspect Sony realized this which is why the DSC-N2s lowest setting is back to ISO 100). Because of that I increased my rating to 4 STARS from my edited post.  Because of the faulty focus, however, I will probably get the W100 or the N2.  I'll make sure to post a review based on whichever I buy.", "Date": "October 29, 2006"}, {"Title": "Beautiful Pictures Problems with Video", "Author": "Cortina \"LC\"", "ReviewID": "RJD7DX7LNPXIP", "Overall": "3.0", "Content": "I love the quality of this camera's photos but Ive had a problem with the video mode recording the moter sound inside of the camera. I sent it to sony repair but they sent it back without fixing the problem. I can hear fluttering sounds when playing back the video both on the camera and on the computer. They say nothing is wrong, but, this didnt happen when I first bought it. I have owned it 9 months now. Wish me luck.", "Date": "October 23, 2006"}, {"Title": "Best compact camera on today's market!", "Author": "A. Kabli", "ReviewID": "R30XCTX0U4IFGK", "Overall": "5.0", "Content": "The Sony DSC-N1 is weel worth its price and will amaze you with every shot. It packs a lot of action for a tiny compact cam -- stunning 8 MP resolution, high quality video, the biggest LCD screen on any camera, and an intuitive touch-screen menu system. I compared over a dozen models before buying this one, although it was the most expensive of the pack. I was especially amazed by the quality of low-light photos which puts other cameras to shame! You can take pictures indoors with candlelight, by the sea at twilight time or dawn, or beautiful lit skyscrapers at night, and you'll get every detail and color like your eyes see it. You can even edit and \"paint\" on photos while on the camera, by using the plastic pen on the touch screen! If you're looking for a top-of-the-line camera with all the bells and whistles then definately go for this one.", "Date": "March 4, 2006"}, {"Title": "Not good at night", "Author": "Edgar S. Henriques MD \"Edgar Henriques\"", "ReviewID": "R3I4IERX0YL4KN", "Overall": "3.0", "Content": "This is great camera during daytime.At night the lcd picture is hardly visible specially when tele is used .Iwish there was a viewfinder .", "Date": "December 19, 2005"}, {"Title": "great for personal use..", "Author": "M. Übeyt DEVRÝM \"engineer\"", "ReviewID": "R2OFM8952OYV7I", "Overall": "5.0", "Content": "I have been using it since last month, and I can say that I enjoy using it. It's has many abilities, but very simplified that everbody can use perfectly.", "Date": "February 19, 2006"}, {"Title": "Seventh Heaven", "Author": "Dorothy D. Burns \"Dottie\"", "ReviewID": "R1YZTD19ZN03D8", "Overall": "5.0", "Content": "I love photography and I really love this camera.  Takes fantastic pictures, easy to use, compact and has lot of other things you can do with it.", "Date": "July 8, 2006"}, {"Title": "The only review I've ever written on Amazon", "Author": "Jaime", "ReviewID": "R2480K9XV12JAF", "Overall": "5.0", "Content": "I have never written a review because I've never felt so strongly about a product as I do about this camera.  My husband and I traveled around the world 2 years ago, and this is the camera we bought for the trip.  Not only did it hold up EXTREMELY well through our journey, it took gorgeous photos, had a dynamite battery life, and is still going strong today!  Wanna see shots (and read stories) from our trip?  Visit [...]", "Date": "March 2, 2011"}, {"Title": "Best Camera Ever!", "Author": "S. Oconnell \"Photo Girl\"", "ReviewID": "R1ZBON5Q8A2XNB", "Overall": "5.0", "Content": "I loved it so much that when I finally wore my other one out (it was the exact same one) after 8 years....I BOUGHT ANOTHER ONE!! Great camera. All my friends are always jealous of my pix because they are so great. The flash is nice and bright, the screen is big, its easy to use..", "Date": "February 17, 2010"}, {"Title": "Very satisfied customer!", "Author": "KissMart", "ReviewID": "R5V18GKDNRBZD", "Overall": "5.0", "Content": "This is a great camera.  Good size screen for viewing pictures taken.  Battery lasts a long time and easily recharged.  I already had used one and bought this because of the quality of pictures and good flash.", "Date": "December 28, 2009"}, {"Title": "Good Capabilities, Nice Touch-Screen, Weak Flash, Yellow Shots In Low Light", "Author": "P. Colin McGraw \"AV, Computer & EnviroTech Nut\"", "ReviewID": "R20VJ3DWSLVCJI", "Overall": "4.0", "Content": "This is one of the first great all touch-screen cameras to hit the market, and had an impressive 8.1 MP resolution.Navigating through and showing off pictures is a dream with the large, 3-inch touch-screen. Interestingly, all of the picture settings are handled not through buttons, switches and dials but on a menu system in the touch-screen itself, which is good or bad depending on if you like the quick control of physical buttons or the tidy simple buttonless backing that accommodates the larger screen.The picture quality and even camera and sound quality are pretty good for the most part! I actually used this camera to shoot the number one mini golf video on the internet (for what it's worth)! Search YouTube for \"Coolest Mini Golf Hole Ever!\" if you want to see an example.My only complaint is of sketchy performance in low light. The flash isn't very powerful, and it is sometimes out-of-sync with the shutter or fires too dim or two bright on my unit. I usually just turn the flash off and try to be still for low-light photos, which tends to work okay, but it can result in grainy and sometimes yellowish hues to the shots.Overall, I'd recommend this camera! It's a good, compact, solid performer.", "Date": "January 30, 2009"}, {"Title": "When a 7.1 megapixel camera is better, there's something wrong!", "Author": "ambYtious \"Love is all we need :)\"", "ReviewID": "R3DEN9GUSVJ59J", "Overall": "3.0", "Content": "I've had this camera since 2006, don't get me wrong it has lasted a long time (going on 3 years in March 2009) but the picture quality seems to be degrading.  I don't know what the life of a camera is supposed to be but the pictures are very dark now and when you change to different shots like night time or snow, etc. the picture just turns to blur.  I didn't notice it until my dad who is a photographer said \"why are your pictures so dark?\" And when I went on vacation this Summer I was trying to take photos of ships docked at night so I changed the setting to nighttime and it just turned to blur.  (if possible I will post pictures) then I looked back at pictures I had shot a year ago and the pictures were much brighter.  I never changed any settings so there was no reason for anything to change.  My mom has had her nikon 7.1 megapixel S500 camera for the same length of time and her camera has always taken sharp (even sharper than mine when I thought my camera was working great) crisp, bright pictures.  Bottom line, this camera has worked a long time.  This was my first digital camera so I have loved it but I think it's time to retire it.  Sony makes long lasting products but I think some brands like Nikon and Canon are made for cameras.", "Date": "October 1, 2008"}, {"Title": "Great Camera, except for when its in the mail.", "Author": "Jordan M. Bellus \"Jordbell1\"", "ReviewID": "R30UFOE4QSQB3H", "Overall": "3.0", "Content": "I've had this camera for about 2 years. paid $450 for it new at best buy. Cool features, touch screen, ability to draw funny faces....It also takes great pics. I've had a few cameras and cant help but update every year or so. Normally i won't hesitate to give and old camera away but luckily i kept my last one. My DSCN1 has gone home to Sony twice. And is now broke for the third time. Not broke from misuse just broke, The first 2 times it was under warranty, but now they want $200 to fix it? I think I'll move on. The EN V line from samsung looks good.", "Date": "March 25, 2008"}, {"Title": "Textbook Perfect", "Author": "MQu", "ReviewID": "R3NCPOPLCBEBJA", "Overall": "5.0", "Content": "Owned for just over a year. It simply is a Sony and there isn't much more to say. Outstanding in options, screen size, touch features, slide show, quality and basically in every way. Still a league ahead of all competition.", "Date": "November 25, 2007"}, {"Title": "LCD screen", "Author": "mg", "ReviewID": "R36RGPASQ71034", "Overall": "3.0", "Content": "great touch screen features. makes life easyyyyy. problem: at night you can't see what you are aiming for and indoors at night, no clue what you are seeing or shooting. too much orange in the pictures indoors too and not good colors.", "Date": "September 3, 2007"}, {"Title": "Like New", "Author": "G. Sierra \"Glo\"", "ReviewID": "R2YQSA6MDEUZF1", "Overall": "5.0", "Content": "It's like new, is in excellent conditions. can't complaint excellent price for an excellent product!", "Date": "August 9, 2007"}, {"Title": "I love it", "Author": "Rosaria Thompson", "ReviewID": "R1453NIASVW8KK", "Overall": "5.0", "Content": "I love this camera.  The sound can be shut off (one reviewer said you can't), I've done it and it's fairly easy to use.  Also, if the battery dies and the shutter is open, it will close on its own (one reviewer said it won't, mine does).", "Date": "July 25, 2007"}, {"Title": "Great Gadget....not so good pictures", "Author": "Janell", "ReviewID": "R168FH8MJXR3RQ", "Overall": "3.0", "Content": "I bought this camera after quit a bit of research.  What sold me was the touch screen and since this was for a tech savy person, this was great.  I must say, the touch screen is awesome and it really gets people's attention and becomes a good conversation piece.However, I have a 5MP Canon SD500 Elph.  Taking the same picture with the Sony and then comparing, I find that I like the picture quality of the Canon better.  The Sony seems to have quite a bit of noise in the picture and has brightness issues. Also, the 3x optical zoom is certainly not enough.  Most cameras of this magnitude have some sort of digital zoom in the camera...this one does not.Another con is the lack of viewfinder on the Sony.  With the Sony not having a view finder, you are really having to just 'shoot and pray' that the picture will come out--especially outside because the screen isn't bright enough to really tell.  The screen also has some graininess and noise so its very difficult to take landscape pictures and see what was in focus and what wasn't.However, to end it on a good note, this camera does take great potrait shots and the indifinite depth of view is great.I would recommend spending the same money on an Elph if you want to take better pictures...if you want to impress your friends, get this one.", "Date": "February 16, 2007"}, {"Title": "newest cypershot", "Author": "Lisa F. Kroening", "ReviewID": "R12921MSKREK92", "Overall": "5.0", "Content": "WOW!!!  This is my 4th Sony, I keep trading up and I am so impressed.  There is no delay on the shutter speed,  great pictures and enough special effects to be fun, but not enough that you need a PHD to operate.", "Date": "August 21, 2006"}, {"Title": "fun", "Author": "T. Hood \"hoodmobil\"", "ReviewID": "R15247851VHEQS", "Overall": "5.0", "Content": "Love at first site.  While looking for a less expensive camera, my daughter and I picked up the n1 and started playing with it. The 3 inch touch screen sold the deal.  I've had the camera about 5 months).Thiscamera is fun to use and I enjoy taking it most every place I go. I've never enjoyed a camer before.  It works as advertised with no problems. Buy it.  I have no regrets.", "Date": "July 9, 2006"}, {"Title": "Fantastic Camera!", "Author": "Jake Lipsett", "ReviewID": "R13QOA91E03OZI", "Overall": "5.0", "Content": "I have owned this camera for four months and it is a great camera. When I bought it I was expecting just another camera, but instead I got a camera chock full of interesting and useful features. I love the paint feature, a place where using the stylus or my finger, can draw on pictures that I have taken. Also, once saved, a copy of the original still exists. I also love the slide show feature. With this, I can present my pictures in an interesting way with music. Also, I can load music onto the camera to be played while showing slide shows. There are four preset ways to show slide shows with music that matches the style. My favorite feature however is the touch screen. With the stylus or your finger, you can navigate using the screen. Since it is touch screen, it maximizes the size of the screen. Due to this innovation, this screen is the largest on the market; 3 inches.Another great thing that I like about this camera is that the controls are easy to use and simple. Even my elderly parents used this camera with ease.There are also many different settings in which you can take pictures; Auto, Manual, Program, Twilight, Twilight Portrait, Candle, Soft Snap, Landscape, Beach, Snow, and Fireworks. Another pro of this camera is that it has 8.1 megapixels! That means that each photograph contains 8,100,000 pixels! Also, if you do not wish to photograph such large pictures there are many different sizes, and every picture comes out clear! I have not had one problem with this camera. It is a great buy. ALthough somewhat expensive, it is definitely worth it!", "Date": "July 4, 2006"}, {"Title": "Top marks Great camera", "Author": "R. Till \"Richard Till\"", "ReviewID": "R14W8FB3PFJ96K", "Overall": "5.0", "Content": "so far this camera has beaten all my expections for staters3\" touch screen,8.1 Mega picels,video and stills then theres the quality of pictures that it produces i have only had it for a week but this camera has best seller writen all over it small and high quality top marks to sony !!!! 5*", "Date": "December 28, 2005"}, {"Title": "Touchscreen broke after one week!", "Author": "T. James", "ReviewID": "R1OGMHRNA9QM9K", "Overall": "1.0", "Content": "I don't know how many times I have to get burned by Sony's poor quality control before I give up on the brand.  I really liked the design of the N1 and the first batch of pictures met my expectations, but the touchscreen died on me during the second day of our vacation!  It turned into a bunch of colored bars like your TV does during emergencly broadcast tests.  Given there is no optical viewfinder, this meant I was out of luck.  Additionally, most controls are accessed via the touchscreen (many inelegantly) so when it goes, the camera goes.", "Date": "March 1, 2006"}, {"Title": "Great Camera!", "Author": "Janellemp \"Janellemp\"", "ReviewID": "R2RKJTQYQBUGXR", "Overall": "5.0", "Content": "This camera is great! The large touch screen is great. That was the main selling point for me. The pictures come out really good and look very good on a large screen tv. I recommend this camera to everyone!", "Date": "January 9, 2007"}, {"Title": "Awesome Camera", "Author": "Amazon Customer \"KJ\"", "ReviewID": "RRLS7TAXJ1USH", "Overall": "4.0", "Content": "This camera has it all, great pics, small, fast response, rechargeable battery - great camera", "Date": "January 9, 2007"}, {"Title": "awsome", "Author": "Abhishek Goyal", "ReviewID": "R31HLSDKX4AXJN", "Overall": "5.0", "Content": "abiout this camera i can say that this is great ....amazing picture clarity, i am a student and all my friends, inspite of there camera ask for mine because of the clarity.cons : memory, but thats fine if u plan to buy a card ....i dont mind buying that, as anyways u have to buy one.", "Date": "January 8, 2007"}, {"Title": "Love it", "Author": "eaie \"e\"", "ReviewID": "R1ADZI9TKP293A", "Overall": "5.0", "Content": "Still my favorite out of all cameras out there , the slide show , the music (u can download ur own),pix and flix quality 100% even in the dark . Touch screen too ...u gotta love it. Wish you good luck :)", "Date": "May 6, 2006"}, {"Title": "Quality issues", "Author": "B. Pollock", "ReviewID": "RN2BZ4IE8MA5Z", "Overall": "1.0", "Content": "I'm in the process of getting my second one of these gizmos repaired/replaced. The lense will not retract after being shut off. This should not be happening. It goes off to Sony next week for warranty repair. Not even 60 days old. Not good.", "Date": "May 12, 2006"}, {"Title": "great small camera with expensive accessories", "Author": "ld \"soundman\"", "ReviewID": "RD1A3T314ATWO", "Overall": "4.0", "Content": "wonderful point and shoot with huge lcd and basic memory. pretty good video as well. memory stick duos, docking station and case-expensive, but cool. really customized interconnects, as usual from sony.", "Date": "January 31, 2006"}, {"Title": "very disappointed", "Author": "Angie", "ReviewID": "R32XZ1GP48VEB9", "Overall": "1.0", "Content": "This is my first digital camera. I bought it  becasue of the name, and was attracted by the big 3\" LCD screen which I hoped would be easier for older users' eyes. I first used it in my brother's retirement party. All 300 pictures came out with red line across them. My brother and I are bothdisappointed. I thought maybe something wrong with my photo software, ormy be set up the features wrong, because later some pictures turned outto be OK. Now a year after my warranty expires, not only the lines are showing on all my pictures, but all came with red color backgroud.My friend had problem with his Sony lense (different model). He feltlucky because he bought 2 years' extended warrenty, so it can be fixed with no charge. To me, I don't believe a good name should have such a defective item.I had a BAD experience, I will never buy Sony camera.Also, I bought 2 Panasonic HD flat screen TV, (one put in my living room,the other in bedroom), the picture is much better than Sony.I my opion, Sony is not top of the line any more.", "Date": "October 8, 2007"}, {"Title": "Awsome¡¡¡", "Author": "Karla Marioly Castillo Oliva \"Karla C\"", "ReviewID": "R3N593IROOUS5M", "Overall": "5.0", "Content": "I like it very much this camera ... The photos are greats and the videos too. I love it¡¡¡", "Date": "January 31, 2006"}, {"Title": "What a dissapointment....1st major let down from Sony!!", "Author": "Daddy B Me", "ReviewID": "R15GHS8NBS7O7U", "Overall": "1.0", "Content": "This camera takes terrible photos.  On auto mode you have to take 3-5 photos in a row to get one good one that is not over exposed, underexposed or just a blank black photo with no image at all.  DO NOT GET THIS CAMERA unless you want to be stuck with a lemon.", "Date": "January 4, 2007"}, {"Title": "BEST CAMERA!!", "Author": "L. P. Carvajal", "ReviewID": "R1QCYKLLIQDCHT", "Overall": "5.0", "Content": "I had my share of digitial cameras and received this as a gift this year (2005).  It's the best digitial camera I've owned.  It's light weight works great in the dark and because it's not big, my daughter doesn't think I have a camera one me.  That's the best!  Sony did a great job with this camera.", "Date": "December 28, 2005"}, {"Title": "Great Camera Deal", "Author": "Robert H. Benson", "ReviewID": "R3HCE5F4FLL5IE", "Overall": "5.0", "Content": "The seller called me to say that the item I ordered was sold out.  However, he offered to sell me the next higher level Sony Cybershot camera with 25% more picture resolution for the same price.  I accepted and the camera arrived as promised in a few days.  I was very pleased with the camera, the price and the service.  Bob Benson", "Date": "January 9, 2007"}, {"Title": "Very Unsatisfied", "Author": "Todd Hryckowian \"Unsatisfied\"", "ReviewID": "R2FVYGP96WQD0S", "Overall": "1.0", "Content": "I had a Sony camera and no problems for the first six months.  At that point, the LCD screen on the back went white, not allowing me to review pictures, access the menu, or take pictures through it.  I've sent the camera to Sony repair centers twice, with no results.  The camera has spent three of the past four months either in transit, in repair, or simply not working.  The Sony repair centers keep sending it back to me in the same state that I sent it in.  If you're going to spend any kind of money on a digital camera, do yourself a favor and don't buy a Sony.", "Date": "March 17, 2006"}, {"Title": "Great Features For a Great Price!", "Author": "The J.K. Rowling of Amazon", "ReviewID": "RBW200746BPHA", "Overall": "5.0", "Content": "The Sony Cyber-shot DSCN1 opens a new world of shooting and sharing, with 8.1 megapixel performance and internal memory that holds up to 500 VGA images for pocket album viewing anywhere, anytime.A huge 3.0\" LCD Monitor with Clear Photo LCD Plus technology provides touch-screen convenience for controlling camera functions and searching thumbnail images -- and Free Spot AF lets you focus on a subject by just touching it on screen.The DSCN1 also features Slide Show with Music capability, Carl Zeiss Lens, 3X Optical Zoom, 64 MB internal memory and high-stamina Lithium Ion rechargeable battery.Specifications: CCD Type and Size: Super HAD CCD1/1.8\" (Approx 8.3MP) Effective Pixels: 8.1 MP Colour Filter: Primary Colour (RGB) Scan System: Interlace Scan System Lens Type: Carl Zeiss Vario-Tessar Focal Lengthf =(35mm conversion): f: 7.9-23.7mm (38 - 114mm) F Number: F: 2.8 - 5.4 Optical Zoom: 3x Precision Digital Zoom: 6x Smart Zoom: 5MP (3.8x), 3MP (4.8x), 1M (7.7x), VGA (15x), 16:9 (5.1x) Aperture Range: Auto (F2.8-F16) / Program auto (F2.8-F16) / Manual (F2.8-F16) Shutter Speed: Auto (1/8-1/2000) / Program auto (1\"-1/2000) / Manual (30\"-1/1000) ISO Sensitivity: Menu, Auto, 64, 100, 200, 400, 800 Light Metering: Multi Pattern, Centre Weighted, Spot Exposure Compensation: +/- 2.0EV, 1/3EV Step Live Histogram Indicator: Yes Sharpness/Contrast/Saturation: Menu, +/-1 Step White Balance: Auto, Daylight, Cloudy, Fluorescent, Incandescent, Flash NR Slow Shutter: Twilight, Twilight Portrait, Fireworks, Candle, M Mode, NR 1/6-30\" Other: Self Timer, Hand Shake Alert, Red Eye Reduction, Multi Language LCD: 3.0\" (230,400 pixel) Touch Screen, Hybrid Clear Photo LCD Plus STILL IMAGE RECORDING Recording Modes: Normal, Burst, Multi Burst, Bracketing Recording Formats: JPEG (Standard / Fine) Image Playback: Rotate, Zoom (Up to 5x Precision Digital), Resize, Slide Show (5 Modes, 4 Transistion Effects, Up to 4 x 3 min Music Clips), Photo Album Burst Mode: 8M (fine) 4 shots / Approx 1.1s sec MOVING IMAGE RECORDING MPEG Movie VX Fine: 640 x 480, 30fps MPEG Movie VX Standard: 640 x 480, 16.6fps Video Mail: 160 x 112, 8.3fps Dimensions (WxHxD): 96.7mm x 61.1mm x 22.7mm Weight (without accessories): 151g Body Material: Metal (Aluminium) Internal Memory: 64MB (32MB for Pocket Album, 6MB for Slide Show Music, 26MB for Photo Storage) Media: Memory Stick Duo, Memory Stick PRO Duo and Memory Stick PRO Duo (High Speed) COMPATIBILITY Image Software: Windows 98, 98SE, 2000 Pro, ME, XP Home and XP Pro. Mac OS X (v10.1.5 or later) USB Driver Software: Windows 98, 98SE, 2000, ME ,XP Home, XP Pro, Mac OS 9.1, 9.2, X (v10.0 - v10.4)A quick recap:8.1 Effective Mega Pixels3X Optical ZoomCarl Zeiss Vario-Tessar Lens3.0\" Touch Screen (stylus supplied)Clear Photo LCD PlusMPEG Movie VX FinePocket AlbumSlide Show with Effects and MusicPaintStamina: 300 shots / 150 mins", "Date": "March 4, 2006"}, {"Title": "no llena las espectativas", "Author": "Venancio Hugo Gomez", "ReviewID": "R2TYB1OV8C0J9W", "Overall": "3.0", "Content": "utilizo una camara kodad de 3 megapixel y les juro que la definicion y el color es mejor, mas real, esperaba mas de esta camara, el software es muy malo y no tiene soporte (Kodak Easy share es muchisimo mejor). Estoy arrepentido de pagar muy caro por un producto que no llena las espectativas.", "Date": "July 25, 2006"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B000B8UOTS"}}