{"Reviews": [{"Title": "Tim Robertson MyMac.com Review", "Author": "Tim E Robertson \"Publisher MyMac\"", "ReviewID": "R3AJKGDEARTITA", "Overall": "2.0", "Content": "I love doing product reviews. I like to think, while writing one, that I am actually talking to someone, telling them about the product in question. And as a reviewer, there are some companies whose products I love to review. Hewlett-Packard (HP) is one such company. I have had a long and happy relationship with every HP product I have used and reviewed over the last decade. So it saddens me when, after testing the HP Photosmart 435 digital camera, it came time to write this review.The Photosmart 435 is a 3.34MP digital camera that you can also use to take small Quick-Time movies with. While not a large camera, the Photosmart 435 is by no means tiny. It fits easily in a purse, but not in the pocket of your pants. (Unless you are wearing cargo pants.)The camera is not stylish, but rather plain and boxy. This works for me, as I don't always want to call attention to my camera. It does not look expensive, and at $149 (US) it is not. If anything, the design reminds me of a 110 Film camera I owned in my teenage years. It has that feel in my hands, very familiar.Operation is simple. Slide the lens cover, which doubles as the on/off switch, and take a picture. There are a variety of options, from picture quality, shutter speed, flash, red-eye flash, zoom, and most of the other features every digital camera sports. So far so good.The Photosmart 435 has 3.34MP resolution at its highest quality setting. As I already own a 3.1MP camera (The Kodak DX3900) I had an idea what to expect in image quality. In fact, I was expecting somewhat better looking photos with the Photosmart 435, being a higher resolution camera. I was sorely mistaken. The image quality, most times, is decent to good. However, the quality of the pictures is not at all consistent. I found that out of ten pictures taken indoors under normal lighting conditions, eight of the ten photos would be of decent quality, while the other two would be very poor. I don't know why the image quality is so unpredictable with this camera, but after extensive testing, I would personally not use this camera.Also like most digital cameras, the Photosmart 435 has an image display viewfinder. The 1.5-inch LCD is used to set options, review pictures or movies, and can be used instead of the optical viewfinder. For those who hate looking through the tiny optical viewfinder when taking pictures, the image display viewfinder is a much better choice.The problem here is the quality of the Photosmart 435's 1.5-inch LCD display. It is far and away the worse I have ever used. In live mode, the display is a green and blurry mess, all but unusable. In picture review mode, it is somewhat better, but still far and away sub-par to any other digital camera I have used in the past.One of the biggest disadvantages is the zoom. There is no optical zoom on the Photosmart 435, but rather digital. A digital zoom is always sub-par than a optical zoom, and that is true here as well. The 5X Digital zoom works as advertised, but any picture zoomed became pixilated and not at all sharp. After playing with the various settings, I found that if I had to zoom up on an object with the Photosmart 435, it simply was not worth taking the picture.Taking photos of objects in motion, even a slow walking cat, really showed the Photosmart 435's shortfall. After taking pictures of a cat in both normal and action shutter speed mode, the pictures were blurry and unusable.The big test, however, came when I gave the camera to our eight-year-old daughter, Brittaney, and told her to take pictures around the yard of anything she wanted to. The conditions were very cold, around thirty degrees and frosty, but the sun was very bright and the fall colors look beautiful. Brittaney took a total of 17 pictures. One of the first problems I noticed was that every other picture had a nice close-up of a finger. Because the lens on the Photosmart 435 is receded, it is very easy to block the lens with your hand while taking a picture. Camera's that have a lens housing that sticks out some, extends from the camera body itself, usually prevents this. The pictures she took, about ten, that was unobstructed by a finger, came out blurry or the camera had too much light. Different setting made no difference.The Photosmart 435 does come with 16MB of internal memory, so you will not have to run out and buy extra storage. However, today, 16MB will quickly prove too small. It is nice, though, that the 16MB is internal, not a card that you will toss out when you upgrade to a 256MB memory card. This is great if, by chance, you fill your memory card up and still need to take a few pictures. I wish more digital camera's would have internal, built-in memory. Unfortunately, you can use one storage device at a time. If you have a memory card installed, the internal storage will not work. The Photosmart 435 takes the smaller SD / MMC Memory cards, not Compact Flash.The Photosmart 435 ships with its own software solution, HP Director, which you can use to store and transfer pictures. While the software does work fine, I preferred using iPhoto. The Photosmart 435 works perfectly well with iPhoto, as expected. But if you use the Photosmart 435 to take video with, you will need to use the HP Director software to capture that file from the camera, as iPhoto will not work. Also, the HP software does not find the Photosmart 435 when running Mac OS X 10.3 (Panther) but does under 10.2. If you do buy this camera, look for an update to their software if you are running 10.3. As I type of this review, there is no update for the HP software. In fact, I have not seen anything on the HP website that indicated you can download updates. The only option I have found is to order a CD-ROM.The video capture feature is more gimmick than anything. The clips are small, grainy, and not worth using to record your important memories with. But it is fun! My kids liked the ability to capture video and audio using the Photosmart 435. I have less worry letting them practice being the next Spielberg with this camera than I do turning over my Canon Camcorder to them. All the video recorded can be used in iMovie, so this is a neat and fun way to let kids learn the basics of shooting video and editing in iMovie.Unfortunately, the Photosmart 435 is a sub-par digital camera. The price, at US $149, makes it inexpensive. Simply reading the specifications in its documentation would sounds like a great deal: 3.34MP, internal 16MB of memory, able to capture video and audio, a 1.5-inch LCD, the ability to use an optional dock, and an optional AC adapter, and more. The reality is that the Photosmart 435 has horrible power consumption (I used three sets of batteries in one week of testing, a total of around 100 pictures!) sub-par picture quality, and a near-useless LCD display.I am disappointed with the Photosmart 435. I expect much better from HP. I am hoping that the next HP camera we review will better meet my expectations of quality HP products. The Photosmart 435 does not feel or operate at the expected quality of an HP product.MyMac Rating: 2 out of 5Tim Robertson", "Date": "November 29, 2003"}, {"Title": "In this case, you get what you pay for...", "Author": "J. Benningfield", "ReviewID": "R2R8C230FUG6P2", "Overall": "3.0", "Content": "If you're looking for a camera with lots of creature features and super clear pics, look elsewhere.  This is a basic camera, with the right amount of features for the price.  It's a good starter camera, but do not expect to use alkaline batteries with this one.  You WILL NEED 2100mah or better AA NiMH rechargeables.  It does have decent battery life with a set of those, but for all day shooting, I'd recommend carrying at least an extra pair of these batteries.  The software that comes with the camera has good features for a beginner.  If you're looking to do professional pix with this camera...FORGET IT.  If you want something that will take acceptable pictures for digital storage or email, then this camera will fill the bill.  It does decent 640x480 video with audio, with a 256MB SD card, it will give you about 20 minutes (provided your batteries do not run out first).", "Date": "November 1, 2003"}, {"Title": "Good Auxiliary Camera", "Author": "Arthem \"arthem\"", "ReviewID": "R2EFETUX08ZHRB", "Overall": "3.0", "Content": "I agree with other reviewers who found this to be a well-priced, but underperforming camera.  I received this camera as a gift, and decided to keep it to supplement at Kodak DX6490.  Of course, there's no comparison in terms of quality and performance (or price), but the standout features of the HP are worth mentioning.First of all, this is a nice pocket camera, except that the sliding lens cover (& power switch) is altogether too easy to open.  On a couple of occasions, I've downloaded pictures of the inside of my jacket pocket.  Other than that, the size is right.The camera runs through batteries like a Suburban runs through gasoline - if you buy this camera, get it with a recharger & several spares.  The battery indicator on my camera is also a little fickle - I don't know that I've every seen it showing a full charge.  Of course, the LCD display can be turned off to conserve battery life, etc., but it really is quite quick to consume juice.The picture quality is excellent for the size and price.  I really have no complaints with the digital zoom's quality, but its performance leaves a lot to be desired.  The digital zoom is slow, and the control is unwieldy.One other irritating feature is the USB port on the side, which is covered by a fairly rigid piece of rubber.  This makes connecting the camera a two-handed operation - and it can be a little bit frustrating to try to connect it in a hurry.  I imagine that the Photosmart dock would be preferable, but my DX6490 came with a dock and I'm not in a hurry to buy another.I haven't used the software yet, since the Kodak software works so well, and iPhoto on my Mac works beautifully with both the Kodak & HP, but the rest of the HP imaging suite (image editor, scanner & print software) works pretty well when it isn't leaking memory (HP has a fix for this, but the download is huge & I can't be bothered ordering the CD).Overall, this is a nice camera to keep in the car, in a pocket, or in a briefcase - but it's not the camera I would choose for challenging or critical photography.", "Date": "February 3, 2004"}, {"Title": "nice camera", "Author": "d. n.", "ReviewID": "RU2N5UEQHPTMB", "Overall": "4.0", "Content": "this is a really sexy little camera.  hp's nicest looking attempt at digital photography, this lil guy looks far more expensive than he really is.  however, the HP name is not synonymous with image quality. when compared with canon's 3.2mp a300, the hp 435 may look like its competition, but it won't act like it.  on best mode, there's really no comparison in quality - the canon wins hands down.  however, for the price, and ease of use, this HP wins.  Pros:-one sexy camera-lightweight-looks like it cost $500-fast shutter speed-long movie clips w/ sound-2 second bootup time-USB storage device mode-battery life is decent-white balance/ev compensation-software is a no brainer-inexpensiveCons:-3-4 second image processing time on best mode-digital zoom is useless-image quality could use improvementif you're considering the hp 320, spend a lil more and get this camera instead.  if you're considering the more expensive canon a300, then get that because the quality is there.  the hp 435 is your basic point and shoot camera with decent quality dressed up in a sexy outfit.  it gets 4 stars because its sexy! but image quality is a 3.  so in reality, this camera is a 3.5.", "Date": "October 8, 2003"}, {"Title": "Something's Missing?", "Author": null, "ReviewID": "R2EJTTFP59K2PK", "Overall": "2.0", "Content": "Advantages:Price- For the price, I guess that this could be considered a decent camera. But this camera is definitely a case of getting what you pay for.Size- This camera easily fits into a purse or a coat pocket, which is typically important to the point and shoot consumer.Disadvantages:Photo clarity-it seems that HPs target market is the beginning digital user, however, I am guessing that they also assumed that for the price, this beginning user 1. should not expect much and 2. would not know enough about digital technology to know the difference. The quality of the photos that this camera produces is not nearly as good as the 2.1 megapixel camera that my parents use for taking photos of the grandkids.Zoom: again, given the price, I have to qualify with the fact that one shouldn't exactly expect a state of the art experience. However, HP should have just left the zoom feature out altogether. You may be able to get a relatively decent photo at 1X (even relative to the subpar quality of the photos with no zoom) anything higher than that and you will have to pull out grandma's bifocals to get rid of the fuzz.HP Product Presentation - If HP had just come clean and called the camera what it really is, something for your pre-teen to use to take photos of kids with braces at the movies, then I would not have been as disappointed. The fact that this is advertised as a 3.3MP camera and a camera that will take great pictures could be considered false advertising.This one will definitely be heading back east to the 13 year old niece to use with her friends, where it belongs.", "Date": "October 3, 2003"}, {"Title": "come on, it cost $122 folks!", "Author": null, "ReviewID": "R3M8OXFK2TXW17", "Overall": "4.0", "Content": "I think the key here is to evaluate your expectations, and this camera meets my expectations and then some.  Seems like some of the reviewers on here are scolding hp for creating a camera targeted at the \"snapshot\" crowd.  If you bought a $25 Forman grill and expected it to do a pig roast you'd be disapointed too.  Look back at the pictures your parents took of you when you were a baby, its likely that the hp435 is a big step up.  I like the ease of use, and the superior printing to the digital camera I bought 5 years ago, and the battery drainage is drastically overdraumatized,  I got aquainted with the new camera on the included batteries and in future plan to use the rechargables i bought with the camera, because again, I EXPECTED IT TO DO THAT.  if you want a magazine cover outcome, keep shopping, but if you want a fun little camera that is surprisingly flexable and has a lot of bang for the buck, you're here.", "Date": "June 26, 2004"}, {"Title": "Go get one!", "Author": null, "ReviewID": "R1U2N21TB55ON", "Overall": "5.0", "Content": "HP PhotoSmart 433/435 (same camera, two different model numbers) is a superb 3MP digital camera.Pro's,0. Fits easily in any pocket.1. Feels great in hand, solidly built and looks sexy.2. Picture quality in day light is awesome, average in low light.3. Prints from 3MP come sharp even at 8\"x10\" size.4. Sliding lens cover protects the lens against damage.5. Uses standard SD card media and has internal memory to store more pictures.6. Has TV-out & USB ports.7. 5x zoom to get you closer to your subject.8. Uses standard AA battery cells and takes about 300 pictures on a single charge!9. Stong flash and almost no redeye.10. Extremely fast to startup and very little shutter lag.11. Very easy to use menus and user friendly design.12. Playback mode is fast and menus are very reposive.Con's,0. It doesn't come with rechargeable batteries, so buy 2 pairs at any local store.1. No free prints offer from hp.In short if you are looking for a small, easy to use and reliable digital camera then HP 433/435 is perfect. Its one of the best digital camera's of 2003. Thanks hp!", "Date": "November 24, 2003"}, {"Title": "more for less", "Author": "dreesman", "ReviewID": "R3EM5BY7QQLL6G", "Overall": "5.0", "Content": "i have tested a few low budget digital cams (kodak cx6200 (awful), HP 620 (bad pictures), canon a300 (also a great cam) and the fujifilm a205 (too much price for what you get) and i don't understand the problems with the quality of the pictures. the hp 435 can make very beautiful and clear pictures, very sharp and colourfull (30bit!). you must have 2100 mah nimh batteries, then you can take a lot of pictures (about 450!!!) with TFT screen turned on.-??????????LCD viewfinder shows everything in yellow and moves in slow motion, so you really don't have an idea of exactly what you are taking a picture of??????????- i think it's a joke or something, my viewfinder is good, good colours and no slow motion.in my opinion the hp 435 is a great cam with great futures and beautiful and very sharp pictures. fast picture taken and video with sounds (it's just for fun).with the 3.14 CCD the 5x zoom is good to use. software is very friendly to use.and the price..........(sorry for my english, I know it's not very good)", "Date": "October 23, 2003"}, {"Title": "Nice second digital camera", "Author": "\"ozukira\"", "ReviewID": "R3OS4LEOEZAH7O", "Overall": "3.0", "Content": "The Photosmart 435 is one of the lowest priced 3 megapixel cameras in the market. It combines ease of use, high-quality materials, and diminuitive size with all the features you would come to expect in this price range. One of the nicest features is video recording capability with sound limited only by camera memory.This is an ideal second or spare camera. With the low cost of ownership, you can feel free taking the Photosmart 435 along on those trips where you would think twice taking your $500+ camera. This camera would make a great gift for teenagers and students. Forgo any HP accessories, and just pick up some decent rechargeable batteries and a case.HP created the 435 by omitting the most costly features. What you won't find here are an optical zoom lens and the normal bundled accessories (such as rechargeable batteries, memory cards, cases, AC/DC charging adapters, etc). The Photosmart 435 also sacrifices high-quality imaging in favor of lower cost, so don't expect archival digital images. If you consider the cost of the camera, then the images are more than adequate and well suited for email and web pages.", "Date": "October 11, 2003"}, {"Title": "nice camera", "Author": "d. n.", "ReviewID": "R3IHT4OTKZEFY3", "Overall": "4.0", "Content": "this is a really sexy little camera.  hp's nicest looking attempt at digital photography, this lil guy looks far more expensive than he really is.  however, the HP name is not synonymous with image quality. when compared with canon's 3.2mp a300, the hp 435 may look like its competition, but it won't act like it.  on best mode, there's really no comparison in quality - the canon wins hands down.  however, for the price, and ease of use, this HP wins.  Pros:-one sexy camera-lightweight-looks like it cost $500-image quality is pretty good-fast shutter speed-long movie clips w/ sound-2 second bootup time-USB storage device mode-battery life is decent-white balance/ev compensation-software is a no brainer-inexpensiveCons:-3-4 second image processing time on best mode-digital zoom is useless-image quality could use improvementif you're considering the hp 320, spend a lil more and get this camera instead.  if you're considering the more expensive canon a300, then get that because the quality is there.  the hp 435 is your basic point and shoot camera with decent quality dressed up in a sexy outfit.  it gets 4 stars because its sexy! but image quality is a 3.  so in reality, this camera is a 3.5.", "Date": "October 8, 2003"}, {"Title": "3 megapixel piece of junk", "Author": "A. Farukhi \"nsp\"", "ReviewID": "RVWS4P9E57CQW", "Overall": "2.0", "Content": "I was suspicious of this camera when I read some initial reviews of it online. Now having tried it in person, it confirms all the bad things I've heard.The biggest disappointment was that a 3 megapixel camera could take such poor pictures. Consistency is the key here. This camera cannot take consistently good pictures. You have to constantly change the settings to get a half decent picture. If I wanted the hassle with the guess and check, I would have bought a [$$] digital camera. What this basically means is, wait until this camera drops to the sub [$$$] price range.The pictures always come out over exposed or underexposed, and they're usually grainy and blurry. It's a nightmare trying to figure out what settings will allow you to take good indoor pictures.With other cameras, especially the ones canon and fuji make, if you have lighting problems, you turn your flash off, hold the camera still and hope that the available light will make a good photo. With those cameras, it usually does. This camera has something wrong with the processor or software, and instead of taking the picture, it tries to compensate by delaying the exposure time to 2-4 seconds, which washes out the picture completely. I know it's inanimate, but I still call it stupid.Outdoors, however, this camera is fine. In fact, you should use this camera strictly outdoors and always with flash. It's a daytime camera and does well to have diffused lighting. That's why I gave it 2 stars instead of 1. If you somehow end up with this camera, use it outdoors.It is pretty small, but not small enough that I'd want to carry it around. Load time is not quick enough for a snapshot and quality will be bad 2 times out of three. If I want a camera to carry around, I'd get a disposable. It does have a video feature with sound, but the quality is worse than motion captures on similar products. It records in .mpg format, if that's a plus for you, well, good for you.Again, a disappointment if you pay more than [$$$] for this camera.", "Date": "November 7, 2003"}, {"Title": "UGH!!!", "Author": "Johnathan Flanders", "ReviewID": "REEZY61FO6QV1", "Overall": "1.0", "Content": "This camera drinks battery juice like an alcholic drinks beer. Piece of junk that takes horrible, low-quality photos. Not even worth $50 new. One of the worst digital cameras I have ever used.", "Date": "May 19, 2006"}, {"Title": "not bad, just don't drop it", "Author": "B. Venanzio", "ReviewID": "R3LIGKC1OAUL8E", "Overall": "3.0", "Content": "I've had this camera for over a year now, and I only have a couple complaints about it. First of all, the screen is very small and the quality is not very good. You can't really see the pictures very well, and they look nothing like they do on your computer screen or when they're printed out. Also, the body is not very sturdy. I recently dropped this camera and it completely shattered and is now useless. However, if you use it properly, it's a nice little camera. The pictures always turn out well enough for me.", "Date": "January 23, 2006"}, {"Title": "The HP Photosmart 433 really isn't that bad.....", "Author": "Sharone", "ReviewID": "R1PILRWJ5P8Q6H", "Overall": "4.0", "Content": "Ok, so I'm no camera expert, but I assume the experts wouldn't be looking at this camera anyway.  This is a cheap camera, that allows you to do a lot with it, considering.  Digital photography is not my field, however I did study photography and understand the importance of image quality.  This camera isn't meant for your professional shots, but it's really small, and easy to use, and the pictures come out just fine.  I use the camera mostly to take pictures of my family and friends, and for trips, and have yet to be disappointed.  I haven't missed out on any really important pictures, and I actually managed to catch some really great serial pictures with the speed of the recharge of the flash, while my friends Nikon Coolpix 5400 which is about five times more expensive, took like three seconds longer per shot.  Some pictures do come out blurry, and wierdly tinted, but it's just a gadget and I've seen that happen with the best of 35 mm cameras, and better and more expensive digital cameras.  How many times have you had pictures developed to find that some of your favorite shots didn't come out??  It happens to the best of us.  At least with a digital camera you can see when the pictures don't come out right, and try again.  No gadget is perfect, and without any glitches.  I also caught some really sweet videos of my niece, with decent image quality, and the sound was great. The zoom could stand to be a bit less pixelated, but I haven't missed out on any pictures yet for lack of zoom, which is the alternative for a camera this price. The alkaline battery life is ridiculously short, even with Duracell and Energizer super-duper batteries.  But, you can manage just fine with two sets of rechargeable batteries, or Photo Lithium batteries, which have a nice battery life.Overall, I take this camera with me everywhere, it's just that small and light.  Captured some really fun shots of friends, and family, and even some great videos (assuming there is good enough external lighting).  And have even managed a whole day with rechargeable batteries, and longer with photolithium.  A cheap, user-friendly camera perfect for travelling, and everyday use.  Nothing too spectacular, but a good priced camera for everday people.If you're looking for optical zoom, and amazing image quality invest the extra money.", "Date": "January 30, 2004"}, {"Title": "it WAS okay.... until...", "Author": null, "ReviewID": "R3IQVA463911SJ", "Overall": "1.0", "Content": "(okay so im really 14... now 14 & under)I really liked this camera. The pictures were actually quite fine. It went through batteries like... well there is no comparison to that. It like ate them like a fat kid eats cake?? Well that was really a pain. I also know that sliding lens covers protect the lens, but it turns on the camera. If i were to stick it in my pocket, I'd have just wasted a set of batteries.The absolute worst and random thing about this camera was that it RANDOMLY deleted RANDOM pictures!! I'd take a great picture and then... it made it all fuzzy!! So it was no good!! That really got me mad. If I wanted to make sure I'd actually get a picture of something, I'd had to take it twice, or maybe even three times if I was really concerned. And this just happend RANDOMLY!! DO NOT BUY THIS. >.<A very important thing about this camera is to NOT DROP IT. I dropped mine one too many times... and er, it doesn't really work well now!! It is useless. Yeah, you can take pictures, if you want it to look like it does when you don't get a TV channel (only its rainbow and you can see a faint outline of the object). So be careful... but if you don't drop cameras, and you don't mind random pictures getting deleted, this is a nice camera. :]", "Date": "May 8, 2006"}, {"Title": "Don't Waste Your Money", "Author": "Denise B.", "ReviewID": "R2CAPH6Q5CVBQZ", "Overall": "2.0", "Content": "I just went through TWO of these cameras--so many problems with the first one, HP finally sent me another.  Also, problems with the memory cards (I've gone through three of those; again, HP sent me 1).  Anyway, once, with a card full of photos, that I'm ready to print at Wal-Mart, the camera says \" Unsupported card\", another time the photo center machine says \"No images found\", and for awhile, no pictures taken with a flash would work.  HP Customer Service said that was \"not a problem\", because I could still take pictures.  MANY EMAILS LATER, (from me), I received a new camera (\"refurbished replacement\"), and after several more emails, a new memory card.  Now it happens again, as I am printing photos of my children to send with Christmas cards, including photos of my daughter's 2nd birthday.  Next time, I will buy a Kodak camera.  VERY, Very dissapointed with HP, although I did get one helpful person in customer service.", "Date": "December 20, 2005"}, {"Title": "It's horrible camera", "Author": "fancychow \"fancychow\"", "ReviewID": "RX2BRLRGDE3LQ", "Overall": "1.0", "Content": "Hp is not the company for camera maker.I had to shut off and on the battery cover so many times to just turn camera on. I missed all the important moments. Simply, You cannot turn it on and off on time. Camera dock that came with it also not keep up the promise either. It won't charge battery as they promised. I bought a separate battery charger. $149 is very expensive for something that even cannot turn on. it is simply not responding. Don't waste your money on HP camera. Now I don't know what to with this piece of junk.", "Date": "November 19, 2005"}, {"Title": "Feels cheap but gives good quality pictures", "Author": "B. Lim", "ReviewID": "R2EH9L2XQWUN66", "Overall": "3.0", "Content": "When i use the camera, it feels really cheap and boxxy. The button feel like toys and the reaction time on the lcd is quiete slow. But when you transfer the pictures onto the comp, it comes out out pretty good. It just he style and feeling of the camera that makes crappy. But overall it will be ok for the average user.", "Date": "December 6, 2004"}, {"Title": "Excellent Camera", "Author": "Ted9 \"Bostonsportsfan\"", "ReviewID": "R2UMMJQZ4EGJRB", "Overall": "5.0", "Content": "This is a user-friendly camera, quick as a wink to figure out.Quality pictures. No complicated directions to read. I likethe feature of the slide bar over the lens.  I would strongly recommend getting a battery charger kit though, if you plan on using it alot. Worth it.", "Date": "November 26, 2004"}, {"Title": "Terrible camera.", "Author": "Hermione Granger", "ReviewID": "R2GO32L58MXCB1", "Overall": "1.0", "Content": "I was given this camera as a gift and it was possibly the worst camera I've ever had. My biggest issue with it was that if it's not bright and sunny out, the pictures come out horrible, despite whatever settings you're using. They either come out barely visible or have an ugly blue-ish hue to them. The camera eats up batteries like no tomorrow, the pictures are grainy, red-eye is a BIG problem, the camera itself is ugly and mildly bulky which makes it a pain to carry around, it has a very slow shutter speed[don't even bother trying to take pictures of anything that moves] and is all-around a terrible camera.This camera is cheaply-priced for a reason.", "Date": "March 18, 2006"}, {"Title": "Excellent for its Price!", "Author": null, "ReviewID": "R2EEQYE2AF1MMV", "Overall": "4.0", "Content": "The 435 is an excellent camera for its small price. For a 100-dollar-camera, its tools are very useful, and even surprising. It's so easy that even a small child can use it, with no problems. All buttons are well-identified, and all options inside the camera are well-explained. The joystick is well-placed, specially to the right-handed people. Its design's very attractive, too.But the absence of an optical zoom, and the fast spent of batteries, even when it's not being really used, are two camera's problems.If you photograph as a hobby, and don't want to spend a big craze of money in a camera, you can buy it confidently.", "Date": "April 16, 2005"}, {"Title": "I'm happy with it", "Author": "M. Pedersen", "ReviewID": "R2BRXCYD9WYYIZ", "Overall": "4.0", "Content": "Being as this is my first camera, this review goes out mainly to my fellow teens.  Until I bought this thing, I only used disposables, so my thoughts on uqality can be somewhat subjective.  I personally love this camera, it works really well.  The price is great for teens and well in our reach.  The picture quality can be a bit on the bad side sometimes, but you get what you pay for.  I really enjoy this camera and reccomend it to whoever is just gettting started into photography.", "Date": "February 1, 2005"}, {"Title": "Great Camera for the price", "Author": "SRM \"Mom of 3\"", "ReviewID": "R1NVUNQZWO6ZSF", "Overall": "5.0", "Content": "This is a great camera.  We got it for our daughter for Christmas (she is 12) and she has thoroughly enjoyed it!  You do need rechargeable batteries, which I thought was no big deal.  We got a charger and 4 batteries for $28 (15 min. charger at that)She enjoys taking video with it.  And you can also add audio clips to each picture which you can listen to on the computer.  She has had a ball doing that.  (She is a budding director)  Picture quality is great for home use.I would recommend this camera to anyone who loves to take pictures.", "Date": "January 1, 2005"}, {"Title": "256 SD didn't work", "Author": "Latin \"PhotoMan\"", "ReviewID": "R1R8386XQ83L82", "Overall": "4.0", "Content": "I have this camera and i just bought a SD 256 SanDisk Card and it didn't work on it, every time i turn on the camera, it has to format the camera and i loose all my photos. In te manual they specify that they didn't test any 256 card....but i did, and dont works.", "Date": "September 2, 2004"}, {"Title": "Fine considering price", "Author": null, "ReviewID": "RORT9YARD0NBP", "Overall": "5.0", "Content": "I may be the only person who isn't horribly offended by this camera. Personally, I don't see what's wrong with it. Yes, it hogs batteries. You use rechargeables, carry an extra pair, everything's fine. Don't use alkalines; it even says in the manual that alkalines WILL run out faster. I haven't had trouble with the picture quality - indoors or outdoors. In some cases, pictures may have to be touched up on the computer after they're taken. I can accept that - it's a cheap camera. True, the video quality sucks. But who uses a digital camera to take serious video anyway? I've never seen a digital camera take videos that actually look good. I don't see what's wrong with the screen, either. If it moves slowly, it's becuase the picture is constantly being adjusted for exposure time and white balance. When centered on a constant space, it doesn't have this problem. Personally, I think looking through an optical viewfinder will always give you a better idea of what you're taking a picture of than a screen.", "Date": "January 25, 2004"}, {"Title": "Shame on HP!", "Author": "A. rollins", "ReviewID": "R3QII6875IXF7Y", "Overall": "1.0", "Content": "I bought this camera for a friend of mine about to have a baby.  Well I opened it for them this weekend to show them how to use it etc..  I was HORRIBLY dissapointed.  The screen is the worst!  It appears to have about 4 pixels and has got the lowest refresh rate I've ever seen.  It's quite hard to see what you're taking a picture of, and you must stabilize and sit still for a moment before you can use it at all.  The picture quality... Well I only have my own camera to compare it to.  The Elph SD100.. which has the same resolution as this camera.. so I expected the picture quality to be similar.  Not so!  The pictures just seem so lifeless compared to my other camera.  It also seems like it doesn't compensate for lighting as well.  Construction seems cheap.. it weighs about as much as a plastic disposable camera.  I can not believe I wasted about $230 on this junk.  I bought it before it was released thinking it was the latest and greatest from HP.  Little did I know.. this camera was intended to break price barriers... NOT performance barriers.  One thing I will say.  It is easy to use.  Very very simple design and interface.  (too simple.. no good toys for the serious picture taker)  If someone writes up a good review for this camera, it has to be that they've never used a quality digital camera before.  Period.  This thing is a dog!  If you're looking for a cheap camera for a VERY simple point & click type person who doesn't mind buying stock in Duracell.. and none too computer savey.. this camera will do.  But I seriously wouldn't pay more than $100 for it.", "Date": "October 27, 2003"}, {"Title": "Nice camera but has some flaws", "Author": "S. Tweedie", "ReviewID": "R31NWFF7EDGPB6", "Overall": "2.0", "Content": "If all you want to do is take some quick snapshots, then this camera is sufficient.  If you have it set to take the \"best\" quality pictures, even though you get fewer, the quality is satisfactory.  \"Better\" quality pictures are also decent and gives you several more pictures per SD card than \"best.\"  The digital zoom is rather lacking, however.  I don't use it that often as I've found the pictures are usually blurry and grainy.  Same with the screen on the back.  When the screen is activated, the image is green and very blurry and sluggish.  I rather look through the little hole view finder than look at a sluggish screen.  Plus, the screen is a major drain on batteries.As for the video,...the quality is very lacking.  All the video I have taken has been grainy, blurry, and the sound quality is very poor.  You more often hear yourself breathing than whatever noise your subject is making and if you speak...your voice is distorted and much louder than your subject.I've attempted to use the camera during low light situations and I found that it didn't function that well.  Concert pictures were often blurred even if I stayed really still.  Shots of the moon didn't even come out, even with the zoom all the way out.I now have a 1 year old son who is constantly on the move and that makes it a little harder to have pictures that are not blurry.  The \"action\" setting does seem to help, but not that much.  Forget using the screen on the back...he's out of frame faster than lightning.Also, I've found that rechargable batteries are best and last much longer than standard alkaline batteries.  One complaint I have is that the sliding bar over the lens can be easily opened and can quickly drain your batteries leaving you without a camera.On a good note, it is very easy to upload your pictures to the computer through a USB cable (which it comes with).  You aren't required to have a photo printer or a dock.For a free camera (I won it in a contest), I have to say that it has served its purpose of taking pictures.  I have been happy with the camera, but now that I have a 1 year old, I want something of higher quality.  I have taken well over 2000 pictures on it since receiving it in April 2004.  I recommend purchasing a higher quality camera even if you only want simple pictures.", "Date": "March 16, 2006"}, {"Title": "Ok for your most BASIC photography", "Author": "B. Taylor \"Aidan's Mommy\"", "ReviewID": "R18J5S59ZHWEHX", "Overall": "3.0", "Content": "I got this digital camera after having my son last year and it has done well for just getting the BASIC 4x6 photos, though if you dont want a flash, thats too bad cause youll never be able to hold still enough to get a non-blurry (ie:good) picture. The red eye was pretty bad too in alot of photos, though the editing software that comes with is OK at taking the redeye out, though sometimes didnt work there either. Ive also had a few problems w/ the software stopping working and having to \"re-load\" it. I am upgrading this year to  a different brand and more MP.", "Date": "August 31, 2005"}, {"Title": "Excellent value", "Author": "Plop", "ReviewID": "R1HIXFPFAMS7HP", "Overall": "5.0", "Content": "Dollar for dollar some of the best features I have seen. So far I have had it 2 months and LOVE it, really. Great features found on more expensive models like audio, video capture and a digital zoom (versus the old style flick the switch zoom)  For the money I rate it a very good buy.", "Date": "December 4, 2004"}, {"Title": "Cool Camera", "Author": null, "ReviewID": "R1UVQLHATZ76MK", "Overall": "3.0", "Content": "This camera is a very sleek camera and works great for the price. Pro's: Inexpensive Easy to use Looks Nice sized screen Con's: SUCKS up the Batteries The Front slider(which is the On & Off button) This camera is overall a nice camera for the family or the Real Estate Agent but should'nt be used for enlarging.", "Date": "August 28, 2004"}, {"Title": "Decent Camera but  Disadvantages", "Author": "Trevor \"Tjash\"", "ReviewID": "R3H2ZSMRD0C1DV", "Overall": "2.0", "Content": "I bought this camera, It would turn off by itself sometimes. I could deal with this but after 4 months I decided to get a new one. I like the image quality was good so that was a advantage. Also the easy to use software was an advantage. It was so so simple to use so i bought the same one the. Big Mistake. I bought it 7 days ago. This one was even worse. the LCD would go white after about 2 minutes of being on. The pictures came out so dark and the Night Mode made pictures that were not even close to the original. I am getting a Sony camera which it suppose to be really good camera.", "Date": "July 11, 2004"}, {"Title": "great camera", "Author": "CHERYL", "ReviewID": "RC4TVCYMOC53L", "Overall": "4.0", "Content": "I bought the hp 435 as my first digital camera.  It is everything I expected and more.  the picture quality is fine.  I used it on my vacation and the pictures were great. I took over 200 pic on my vacation and have no complaints. It uses batteries fast, but I expected that with a digital camera.  I bought two sets of rechargable batteries so I always have a set charged.  The camera is very easy to use as is the software.  I would recommend it to anyone.", "Date": "July 6, 2004"}, {"Title": "Great Quality Inside and Out", "Author": null, "ReviewID": "R1HUUMA42O44TN", "Overall": "5.0", "Content": "This printer surpassed all of my expectations.  I had read both biased and unbiased reviews--and some of them left me worried.  However, once we took a few pictures and printed them on the HP PHOTOSMART 145 printer that come with it---we were blown away with the quality.  It definitely meets up to the quality of your local photo processing store.  I would advise anyone thinking about purchasing the HP 435 CAMERA to go through with it.  The features are great, as it allows you to take black and white pictures also.  The 5X zoom is great because it seems to lose no quality.", "Date": "May 9, 2004"}, {"Title": "We're impressed", "Author": "Sarah", "ReviewID": "R2VQNBN5NPP0TO", "Overall": "4.0", "Content": "After receiving this camera as a Christmas present, me and my husband quickly learned how to use it. (Which is not always easy for my husband to do!) Yes, it is true that the battery life of the camera somewhat stinks, but as long as you buy the rechargeable batteries and the AC adapter- you should be fine. If you are a photo fanatic, with hopes of becoming the next Olan Mills, this camera is not for you. But if you are the average, everyday photogropher, who enjoys taking simple pics of family and friends at a low cost- this camera is definatly for you. Not a bad price for a dependable, little camera, that is also very portable.", "Date": "December 29, 2003"}, {"Title": "Not bad...for a beginner", "Author": "Robert I Cruickshank", "ReviewID": "R1DZKCWMZ5G6P1", "Overall": "3.0", "Content": "I received an HP Photosmart 435 as a Christmas gift this year, totally unexpectedly. I've been wary of getting into the digital camera thing, due to the cost of a decent camera. After a few days of playing around with it, I've come to some conclusions about the 435 that you all might find useful.My photo quality is fairly good, better than what some other reviewers have experienced. It does appear to take better pictures outdoors, but I've had good results indoors, and with the flash. The digital zoom is useless, it results in terrible photos.Some have complained about the LCD screen quality. I haven't experienced any problems. It's a little small, but isn't blurred or otherwise flawed.The 435 is indeed a battery hog, and frankly, that reduces the value of the camera - your $100 or so savings will be going into the corporate pockets of Duracell or Energizer quickly enough.I have a 35mm camera that I adore and plan to keep as my main camera, but it's becoming more and more useful to have a digicam of some kind in this day and age. Given its low cost, the HP 435 is a decent camera, with decent photos. It gets the job done - no more, no less. But if you are looking to buy a camera for yourself and plan to make digital photography your main picture-taking tool, save up a little more money.", "Date": "December 26, 2003"}, {"Title": "GREAT CAMERA FOR EVERYDAY USE", "Author": "B. howe \"lil\"", "ReviewID": "RLVJXXZNXR61Q", "Overall": "5.0", "Content": "This camera is great for those nonprofessionals out there.  It takes great pictures and the movie mode is awesome.  It's very lightweight and easy to use.  For the money and quality you can't beat this HP camera.", "Date": "December 9, 2003"}, {"Title": "Perfect digital camera!", "Author": null, "ReviewID": "R3HGPREG3MTB2X", "Overall": "5.0", "Content": "This is a cool looking camera with small size and affordable price. The image quality is amazing and the prints look very professional.Its a perfect camera for most people, don't waste your money or more expensive ones. Get an hp and you won't be disappointed!", "Date": "November 24, 2003"}, {"Title": "Beginner's Camera", "Author": "A. Carvalho \"lawyer lady\"", "ReviewID": "R3VPQ35HZMKZZW", "Overall": "3.0", "Content": "This camera works very well for people who are just learning how to use digital media.  It has a 5x digital zoom, but no optical zoom.  This means that there is no lens to give a clear picture when the zoom is in effect.  In other words, the pictures come out looking far away without zoom, and with zoom, they look blurry and pixely.  However, I have gotten some excellent pictures from this camera since I got it in December.  It's just difficult to take more advanced photos.  I would definitely recommend this camera to a beginner, but for serious picture takers, get something else", "Date": "August 24, 2005"}, {"Title": "Mediocre, at best", "Author": "J. C. Jones \"vampdvine\"", "ReviewID": "R3SS5QBA119SMR", "Overall": "1.0", "Content": "I won't pretend to be an electronics guru, but in comparison to the results I've seen from other digital cameras, the pictures I've gotten from this model are sub-par.  Actually, it is quite a disappointment since I purchased this camera on the day my nephew was born so I could get some shots.  Had I researched it more, I probably wouldn't have wasted my money.Fortunately, I dropped the camera, broke the housing unit and now I get to buy another, better camera!", "Date": "July 12, 2005"}, {"Title": "Not a good camera for those interested in photography.", "Author": "Dawn Preissler \"photo geek\"", "ReviewID": "RHDK63VZU5V34", "Overall": "2.0", "Content": "I found it hard to believe that the quality of the photos I took with this camera was very poor. It was impossible to get a clear shot of anything. A lot of pictures taken in loer than normal light had a lot of noise. Overall, this camera is very poor quality for the price. I couldn't believe that it didn't have a macro mode. I found that the Fuji FinePix A205 was a MUCH better camera when it came to the price.", "Date": "February 20, 2005"}, {"Title": "Great Value!", "Author": "Erik M Mozolik", "ReviewID": "R3F75L7RROJM16", "Overall": "4.0", "Content": "Bought this bundles with the 2175 printer/scanner/copier. So far, I am very satisfied with the purchase for the price i paid. So far, i think the camera is a great value. Only two things i dont like, which are fairly minor: The batteries, like every digitial camera, go real quick and also, i dont like that the shutter is the on/off switch. Otherwise, the HP is a great first digital camera.", "Date": "December 29, 2004"}, {"Title": "compact  affordable  with  many features", "Author": "joel", "ReviewID": "RQDVSU7J9DLIO", "Overall": "4.0", "Content": "This camera has all the features of the big boys at a fraction of the cost and size. Takes great snopshots Video/audio is so-so but still fun to play with Well constructed and has many features Can be played back on TV which is a plus I'm really enjoying this camera and have as much fun with it as my brother is with his $800 camera.", "Date": "August 19, 2004"}, {"Title": "Don't Drop the Camera", "Author": null, "ReviewID": "R5V8HRZBZAK2N", "Overall": "2.0", "Content": "Whatever you do, do not let this carmera hit the ground!! Dropped it once after only a few weeks of use and I am now the proud owner of a high-tech paperweight -- out-of-warranty repair $85. :( It is also a battery-gobbler! Photo quality is adequate for snapshots.", "Date": "May 28, 2004"}, {"Title": "Value its price", "Author": null, "ReviewID": "R18OEOC2ISTP31", "Overall": "3.0", "Content": "Great for outdoor pictures and travel: fast, light and reliable. Pictures taken with flash at night are not great, and tend to a blue tint, but they are pretty decent, you can fix them with Photoshop. This is not a big deal, since practically all the pictures I take with a canon Powershot G2 always need a fix in Photoshop too.It is quite obvious you can't do professional photography with this camera, but if you have to travel, and don't want to risk an expensive digital equipment, this is a great choice. Buy from the start a couple pair of recharchable batteries, because the life of an alkaline in this camera is a joke.", "Date": "February 4, 2004"}, {"Title": "Disappointed", "Author": "Iron Chef \"Iron Chef\"", "ReviewID": "RIO3NWCEZBPRT", "Overall": "2.0", "Content": "I bought this from a leading store. The pictures were good and the camera looks beautiful, but it guzzled batteries like there's no tomorrow. I used NiMH rechargables, but within 5 shots, the battery level indicator was at its lowest, and with 8 shots, it had died out! Of course, the software was another issue. It installed all kinds of icons on my desktop. I hate a cluttered desktop, so when I removed the icons, many features of the program just went dead! I returned and got myself a Kodak.", "Date": "July 25, 2004"}, {"Title": "Great camera, and great features", "Author": "Jeffrey D. Hill", "ReviewID": "RBBVPX7JBFN6U", "Overall": "5.0", "Content": "The HP Photosmart 435 is a fantastic camera.  It has alot of features (5x digital zoom, video cam mode, 3.1MP) and is a great little camera for the price.  First off the 5x digital zoom is a sweet touch, and while using the maximum zoom is not recommended, it still works great up to 3.1x zoom.  Second the video cam mode is awesome nice clarity, and perfect audio qualtity round off a smart addition to the camera.  As far as the picture quality the 3.1MP is EXACTLY as advertised.  I use advanced photo editing software, and speaking from over 4 years of photography experience the photo quality is quite close to 35mm. I can enlarge the pictures to 8x10 with no visable loss resolution.  So, while not the best digital camera on the market today it is the best digital camera out right now for the price.  Oh, and don't forget to buy the docking station.  Directly connected via USB is great, but the with the docking station you can transfer images and video in an instant.", "Date": "November 24, 2003"}, {"Title": "buy a 1.3 MP instead", "Author": "I used to like HP", "ReviewID": "R1VTXKC7VBL3L5", "Overall": "1.0", "Content": "In short, I vote this as the worst product of 2004. Can I give zero or negative stars? I give it negative 5This thing is made by Energizer and Duracell to sell batteries! I take pictures with LCD off to conserve power. With my 2100 mAh NiMH, I took 30 pictures before I had to recharge them. With alkalines, I took 12 pictures before I had to replace the batteries. This is with flash and LCD off, lowest power setting. For comparison, same NiMH lasts over 200 pictures.  (...)The movie and zoom do not work. Since they must have the LCD on, and LCD eats batteries even faster, you have maybe 20 seconds before you have to replace the batteries! I bought 256MB SD and thought I could make some movies, but the most I got was about 15 MB movie before the battery ran out. I don't know why they put SD slot since one cannot fill 16 MB internal memory before one has to replace the batteries. I think they did this on purpose since the movie quality would make the enemies of whoever is in the movie. Yes, it is that bad; my 20 dollar webcam makes way way way better movies.I could not even change the ISO settings after first 5 shots with NiMH since LCD must be on to change the settings. ISO is always on auto when you power up; it forgets the setting each time it's powered down. And one must always change the ISO since auto ISO makes unbelievably bad picture.  (...)At 3 MP setting, pictures are just awful. Colors are not even, and it looks like it was interpolated from 640x480. At 640x480, pictures look about average, slightly worse than my 8 year old digital camera. HP's colors are noticeably noisier, even against a heavily used 8 year old camera.For the problems and features, this camera is not worth the price. If this costs LESS THAN typical webcam, and if it's bundled with AC adapter, it might be worth it. Otherwise, save your money and time. I'm much happier with my 1.3 MP.", "Date": "April 10, 2004"}, {"Title": "My first digital camera!!! :D :D :D", "Author": "Ms. Terrie \"pic's freak! :D\"", "ReviewID": "R3AGBHWF76UMA", "Overall": "5.0", "Content": "This was my first digital camera. In fact, I still keep it around. In think is a pretty good and decent camera. It is easy to use and it is not heavy. Is perfect for vacations, party's, and other activities.Ok, so the flash it is not so great. And it really uses up batteries rather fast.Anyway, I would buy it again if i could :D :D!!", "Date": "March 24, 2007"}, {"Title": "So dissapointed!", "Author": null, "ReviewID": "R1F3J5TWGAAB31", "Overall": "1.0", "Content": "Please don't waste your time on this camera. I bought this camera for Christmas and for 2 weeks I took pictures and without a single shot that I liked. Every picture is blurred to some point, some more than others, but all blurred. I'm just so dissapointed.I have returned the camera. It is NOT worth the money! It should be discontinued or recalled it is so bad.I have nothing good to say about it. Worthless.", "Date": "December 30, 2003"}, {"Title": "Best Little Camera Ever", "Author": "lifesabeach", "ReviewID": "R2JQR56MBRBRU9", "Overall": "5.0", "Content": "i have had this same camera for about 8 years, dropped it on concrete floors twice and it still works! it's easy to use and takes nice pix and has a really good zoom.  If you are finding the batteries are wearing out quick you need to get the Energizer advanced lithium, they last with a lot of camera use for about 6-8 months.  i'm buying another one before i can't find one. all the new products break in a year.", "Date": "December 5, 2010"}, {"Title": "Got is used for $1 and I love it very much!", "Author": "Douglas A. Shepherd \"Scooby Doo\"", "ReviewID": "R2SJSM3VSODDAJ", "Overall": "4.0", "Content": "I like it because it has a timer and takes video and good pictures.  The battery does wear out quickly so turn off the flash.  But other than that it's great!", "Date": "December 6, 2009"}, {"Title": "Do not waste your time and money on this product.", "Author": "B. Tran \"Beginning Photographer\"", "ReviewID": "RPHMP81SMZ98Z", "Overall": "1.0", "Content": "This camera was a gift. After using it for three months, the LCD screen became unreadable and the pictures stored in the memory disk were pixelated to the point of abstract art. I do not recommend buying this camera for personal use or anyone else for that matter. Another alternative would be Nikon or Canon brand point and shoot digital cameras. (Not endorsing other products but HP are not known for digital photography, though a admirable attempt at it).", "Date": "November 27, 2008"}, {"Title": "I've had better.", "Author": "Julaaay \"julidoesitbetter\"", "ReviewID": "R3J3Z4CGGMSJXJ", "Overall": "2.0", "Content": "The pros about this cam is that the pictures.. were decent. And the software was pretty cool.But the cons? You could not keep enough batteries around to keep it goin.. and the flash is way too bright.. it even actually effected the pictures.", "Date": "August 23, 2007"}, {"Title": "Okay for a cheap older camera", "Author": "Twisterjester", "ReviewID": "RY6D62PFVIGHK", "Overall": "3.0", "Content": "Good for quick and easy shots at parties and such.  It's not a tiny little camera and obviously not pro material, but the quality is reasonable considering the cost and age.  At 3MP, it is a good choice for someone who wants snapshots to post online or wants only smaller-size prints.  I'm the world's worst about fuzzy pictures and this camera is fast enough to offset my shaky hands.The only real drawback - and it's significant - is that the lens cover slides open too easily.  Mine opens inside the camera case.  Considering that opening the cover also turns on the camera, that means battery drain as a side effect.  Presumably everyone uses rechargeable batteries these days.  Even so, I'd recommend keeping the batteries out of the camera until you're ready to use it, or you'll find that you don't have enough power to snap anything.", "Date": "July 11, 2007"}, {"Title": "HP PhotoSmart 435: Inexpensive, Easy-to-Pocket Snap-Shooter", "Author": "R. E. Trout", "ReviewID": "RRIUZF41S0RGO", "Overall": "4.0", "Content": "This was my first digital camera. I bought it because I've had good luck with other HP products, notably printers and a scanner. I will admit price was a major factor in my decision to buy it: $80 after the rebate. So far I haven't been disappointed.The PhotoSmart 435 is gloriously uncomplicated and, I think, rather handsome. It avoids some of the stylistic excesses that clutter up some of its competitors. And it has a few surprising features for a $100 digital camera.At 3.1 MP, the PhotoSmart 435 has a maximum resolution of 2048 x 1536, which is enough to create photo-quality 8 x 10 prints. It has a minimum resolution setting of 640 x 480, but I've never used it.The LCD is on a par with other slightly more expensive cameras, and is just large enough to compose pictures and easily navigate menus. In Live View, the LCD records through the lens, rather than the viewfinder. To conserve power, it goes to sleep in a short time.It also has 16M of built-in memory, which allows for up to 13 high resolution photos. You'll probably want to buy a larger memory card. It can take 32M, 64M, or 128M Secure Digital (SD) or Multi Media Card (MMC) cards. The built-in memory is disabled as long as a card is in it. But when you're out somewhere and have filled up your memory card, you can remove it and have 16M of memory again.Since it has no optical zoom (digital zoom is pretty useless), it is limited to snapshots. It does best with outdoor shots anywhere from a few feet to infinity. In fact, it produces surprisingly good pictures under those conditions. It does less well with indoor shots, especially without the flash. It doesn't do close-ups.The accompanying CD includes some useful software - HP's Photo and Imaging software, Memories Disk Creator (Windows and Mac capable), and Hemera's Greeting Card Creator (for Windows only). I didn't install it because it duplicates software already on my iBook.Downloading pictures to the Mac is simplicity itself. Just plug the camera into the USB port, turn it on, and iPhoto opens automatically. There's even an option to erase the pictures from the camera when the download is finished. Turn the camera off and unplug it. Some digital cameras show up in the finder as a drive which has to be ejected before unplugging the camera, but not this one. The camera comes with a dock insert, but I haven't found it necessary to use that either.Power consumption is predictably heavy. It went through the supplied alkaline AAs before I'd taken a dozen pictures. With rechargeable NiMH batteries, it did much better. I use the Monster Cable MB 4-DCRC, sold by Amazon.The PhotoSmart 435 is designed with the amateur photographer in mind, and because of its simplicity, it succeeds. If you accept its limitations and are looking for an easy-to-pocket snap-shooter, you can't go wrong with the PhotoSmart 435.", "Date": "June 7, 2005"}, {"Title": "why pay 300? get it for FREE", "Author": "mariamauricio", "ReviewID": "RCUK12C148QY8", "Overall": "5.0", "Content": "nice camera that you can get here [...] thanks for read", "Date": "April 25, 2005"}, {"Title": "Pretty shabby", "Author": "Jaclyn", "ReviewID": "R1742100R5FOSD", "Overall": "2.0", "Content": "This camera is alright if it's your first one since it's so easy to use but, after a while you notice what a waste of money it is. Like some other people, I got this camera for Christmas and thought it was great! So, after a month when I dropped it and it shattered, I bought the same one. Bad idea. Sometimes the pictures just show up as static or with a green or blueish tone. The flash barely works and it really does eat up the batteries. I never ever used the LCD screen because the batteries would die in about 2 minutes. Also, you can't access the main menu without the LCD and the LCD doesn't work when the batteries are low. I would still use this camera because I really would rather not spend money on a 3rd one in 2 years however, the USB cable broke and I haven't been able to find one I can buy seperately.Tip: For young kids, it's an alright buy because they probably won't know the difference. My 12 year old cousin loves his.", "Date": "April 25, 2005"}, {"Title": "Snazzy", "Author": "Allison \"Allie\"", "ReviewID": "R24AVVCSDSONBP", "Overall": "4.0", "Content": "Takes great pictures, but however it is a little bit expensive and it could use some more memory. 4 stars for PhotoSmart.", "Date": "April 17, 2005"}, {"Title": "This is an awesome camera!", "Author": "olivia", "ReviewID": "R2PFC3Y9HP1YOH", "Overall": "4.0", "Content": "I saw my friend had had this camera so i had to get one for myself! The looks of it are so cute and the pictures are great for the price you pay...Just don't let anyone else mess around with it and drop it...it will shatter! I liked it so much that I took it back and just got another one... I think this camera is worth buying...", "Date": "December 28, 2004"}, {"Title": "Very Good For a Cheap Camera", "Author": "Kathryn C. Bastura \"LittleAnthroMonkey\"", "ReviewID": "R1159F356QRUSX", "Overall": "5.0", "Content": "( Written 11/26/04) OK...this is not the camera to buy if you're trying to win a pulitzer prize...but if you are in need of a cheap camera that does a decent enough job...this one will work...if you get this camera you need to get rechargeable batteries since they will last longer and be cheaper than constantly buying reg. batteries...and always have a spare set of batteries on you...the best thing (other than the price) about this camera is that you don't need to get additional memory...with the lowest quality setting..you will get 171 pictures...granted these are low quality...but if you're like me and only want to send the pics online...then this works fine...the menus are really simple to use and the USB cable works great with my Mac...i've never had a problem transferring pictures to my computer (knock on wood)...i can't rate the included software cause i don't need it with my mac....bottom line...if you find this camera for under $100...then your golden...but it's not worth more than that...i can say that i'm happy with it...it works great for me...Hello again...it's 4/21/06...about 2 years since I bought this camera. And I can tell you it's still working! Granted I would love to get a better camera, but I'm a poor college student so I work with what I've got. I've even dropped it before and it hasn't shattered! In fact I just loaned it to my parents for thier 25th wedding anniversary trip, and they got some great pictures for some wonderful memories! The only down side that really bothers me about the camera, is that when you zoom in, you lose picture quality. Other than that, I have no issues with it! This camera has survived treking around Greece, Poland, college and is still going strong! Like I said before, if you need a CHEAP camera, this one will work for you. Hope this helps! :-)", "Date": "November 26, 2004"}, {"Title": "I LoVe It!!", "Author": null, "ReviewID": "R2ILBHO6LSS6BD", "Overall": "5.0", "Content": "This camera is great!! I don't see why it gets bad reviews!! You people just must have really, really high-quality taste, like expect it to be god!! This camera has everything!! From black and white pictures, to color recording!! I have printed off several different pics; and they all have came out EXCILLENT!! So, YES!! I would recommend this camera to anyone who has a brain!! This is a great camera, where do you get &quot;-5 stars from??&quot; That is really underexagerating!! You are probably just stuck up!! So, believe me!! This camera is wonderful, and I could, I would give it 10 stars!!", "Date": "June 2, 2004"}, {"Title": "Great Camera", "Author": null, "ReviewID": "R31B8M2383VVF0", "Overall": "4.0", "Content": "I think this is a REALLLY GREAT CAMERA!! It has everything you need!! Great for everyone!! Perfect for indoors or outdoors! Once it was pitch black at night, and when I went to take a picture, it turned out to look like it was sunny outside! The only problem with this camera, is the fact that the batteries die out fast, but over the years that I have seen other cameras, those ones are no different!! But, yea, this camera is really fun and exciting!!", "Date": "June 2, 2004"}, {"Title": "Great, Easy to Use Digital Camera", "Author": "Jim Jr", "ReviewID": "R10HM29WEX8KR", "Overall": "5.0", "Content": "This is an excellent camera especially for the price. I have gotten pictures at least comparable to my 2 35mm SLRs. It is very compact and easy to use BUT YOU HAVE TO READ THE MANUAL and not simply start taking pictures without knowing what HP recommends.I have sent a number of pictures via email that are as sharp as can be and that is with the lowest of the three quality settings available. Sending the pictures to an email is extremely easy with the excellent software provided with the camera. The Photo Editor feature included in the software works better and easier than an editing program I downloaded from a leading manufacturerI have taken close up pictures in the house that are excellent in detail and color. The outdoor photos are also excellent. When using the zoom feature, I adjusted the \"quality setting\" to the hightest level and got a nice clear picture. It was only on the lower levels that I got the pixilated shots.It is small, fitting easily in my hand or a pocket. I do recommend that you also get an AC power pack as it will recharge batteries in the camera and can be used while transfering images to the computer thus saving battery life. Rechargable batteries are also recommended.Another plus for this camera is that it comes with excellent software. The Photo Editor feature works better and easier than an editing program I downloaded from a leading manufacturer.Perhaps the negative reviews are from photo geeks who have outrageous expectations, but for a normal user, this is a really good digital camera.", "Date": "April 10, 2004"}, {"Title": "Terrible Pictures.....", "Author": null, "ReviewID": "R1R1ZYJ2Y1WV7Z", "Overall": "1.0", "Content": "I was extremely disappointed when I took picture's with this camera.  The picture's did not come out clear, they were very pixilated, dark, too bright- yellowish, etc.  On top of horrible pics, I had this camera for 3 days and went thru 3 sets of AA batteries...it's a battery hog!  Do more research before you buy, I wish I did before I waisted my time and $, although I returned it for a wonderful Canon S230...highly recommend!!!", "Date": "December 5, 2003"}, {"Title": "Its Great!!", "Author": "Laura", "ReviewID": "RGGV37AY87Z94", "Overall": "5.0", "Content": "This camera is awesome. All of the pictures I take come out crystal clear and It doesn't eat up my batteries. And for that women who got a bad one, oh well you should've traded it in for a correctly working one. Mine is great all of the moments I want to catch with my friends come out awesome. I am very smart and I know for the price this camera is selling for on the internet and in stores, it is better than more expensive camera's dollar cameras. My dad uses mine now. That's all.", "Date": "April 24, 2005"}, {"Title": "Nice Camera", "Author": "Dan \"Echoes of Autumn\"", "ReviewID": "R3DFAFDYLBCERX", "Overall": "4.0", "Content": "this has to be the best(low budget)camera i have ever put my hands on. light wieght, good quality pics, and a nice price.it's such a good camera that sombody stole mine. i got it forb-day and had it 4 days when it was stolen. well if you can hold on to things better then me then this would be a good camera to buy......", "Date": "March 10, 2005"}, {"Title": "Worst Camera For Batteries", "Author": "Herb", "ReviewID": "R2G4K5IPF29PR4", "Overall": "1.0", "Content": "BAD!!! Bad for batteries... I cannot keep enough batteries on hand to take pic's.  Battery life is drained from the minute I turn the camera on... I am returning my camera tomorrow (05/23/2004)...", "Date": "May 23, 2004"}, {"Title": "HP should be ashamed", "Author": "Nick \"Nick Mazzaglia\"", "ReviewID": "R2GAT0L6D1PY5X", "Overall": "2.0", "Content": "I got this little nice camera for a very low price. I was supposed to be happy and eager to used but there is only one word to describe this product: Dissapointment. I started using it and I noticed that you can only get good pictures when you're outside and there's bright sunlight. When you take pictures inside the quality is just awful, and the flash it's not the best in the market. Don't use the Zoom! or your quality will drop to not even 1MP. I don't know really how can this camera be 3.1 MP, it doesn't even get close to that. I have a 1.3 MP Olympus and the picture quality can't be compared. So I would recommend this camera to those only living in desert areas where there's always sunshine and to people who do not take pictures inside, if you match this criteria you'll have a good camera for low price, but if not don't even think about it.", "Date": "March 10, 2004"}, {"Title": "It went back to the store!", "Author": "D. Tovar \"Debbie\"", "ReviewID": "R18UMIYS6CB3YM", "Overall": "1.0", "Content": "I purchased this camera after having a cheap Fuji digital for a few years.  I wanted to upgrade.  Took pictures in all kinds of light, and all the pictures were of poorer quality than my old Fuji camera.  I took it back, and got a Kodak digital for a few dollars more, and it has beautiful pictures!  Also, you Have to use rechargable digital batteries.  Regular batteries last for a few pictures only.  The lens in the camera is stationary, so I think it will never focus as nice as a movable one.", "Date": "March 3, 2004"}, {"Title": "So so...", "Author": "eric", "ReviewID": "RGIV2W8YU5UNZ", "Overall": "2.0", "Content": "I bought the camera because it was 'cheap'. I could have got the 635 for the same price, but thought that a 3Megapixel camera w/5times digital zoom must be better than a 2Megapixel with a 3times optical.Less than a week after I bought it I returned it to 'upgrade' to the lesser HP 635.3x optical, 4x digital with more features. Odd. I take better photos with less 'megapixel' than with the higher. Oh well. Live and learn.Batteries are gone in like 20minutes, the screen is slow and choppy, indoor photos are a waste of time.Spend the same money and get the HP 635. You'll be happier. But as an entry level, it's pretty good. You WILL get tired of it fast, took me a whole week.", "Date": "December 28, 2003"}, {"Title": "HP PhotoSmart 435 sucks", "Author": "Charlie Q \"CQ\"", "ReviewID": "RA0L8KQ85BA9L", "Overall": "1.0", "Content": "This camera takes really lousy pictures - one can see granulations even at the highest quality setting when taking any sort of pictures indoors with the flash turned off. The pictures were often outof focus even in strong light. Things are better with the flash turned on but only for closeup shots. Still the colors leave much to be desired. Do not buy this camera if you want to take any pictures indoors. It also ate up the battery that came with it very quickly.Featurewise it looks good - but picture quality sucks royally.This is at best a 1MP camera masquerading as a 3.3MP one ; I agree with the reviewer who said that HP stands accused of deceptive advertising. Had expected better.", "Date": "October 17, 2003"}, {"Title": "HP doesn't have a product with this one.", "Author": "\"astronomyislookingup\"", "ReviewID": "R17CH8UEE2ME74", "Overall": "1.0", "Content": "I join the throngs of the dissappointed on this one; HP does't even have a marketable product here.  I'ts all true- terrible white-scale aberations in low light, fixed focus and it looks like it.  One set of batteries (2xAA) exceeds the worth of the camera, and will only take a few pictures for them to be exausted.  I was the unlucky recipient of one as a gift, I'm giving it to my Beagle as a chew toy.By comparison, I picked up a Vivitar 3610 on a blister-pack for twenty dollars (software, cables, NTSC and Pal movie output [with cable]) and, whilst it's 2MP as oposed to the HP's 3.2MP, it takes remarkable pictures, the Vivitar has it all over the HP. So, stop counting megapixels and look at the pictures.  Now, if I could only get my puppy to take an interest in digital photography....", "Date": "June 9, 2004"}, {"Title": "ok, but expected better", "Author": null, "ReviewID": "RTQ6DEUV595NW", "Overall": "1.0", "Content": "when i bought this camera i was told it was pretty good...what a joke.  it drains the batteries after taking only a few pictures, there is no optical zoom and the digital zoom does nothing for your pictures...they look very pixelated.  low quality pictures at night, you cant tell what you're taking pictures of if your not looking through the viewfinder where then you can't use the zoom.  it looks like you are looking through night vision goggles.  ok pictures during the day, but some color distortion.  its an ok camera for someone who doesnt really care about the quality of the pictures and doesnt want to spend too much money.  on the upside, it is very easy to use, is very lightweight, and is very stylish, however mine is going right back to the store!", "Date": "March 8, 2004"}, {"Title": "Decent quality", "Author": "Mariano Zamudio Zertuche \"Chamoy\"", "ReviewID": "RS8FNLNLMPFEW", "Overall": "3.0", "Content": "You get nice pictures at the daytime, though the digital zoom doesn't help much, When you get used to the light adjusting features at night, you can take decent quality pictures. i had problem when using it on cold temperatures because the camera didn't turn on but after several attempts. This could be the major drawback of the camera, but in summary I recommend it for those who don't need an excellent quality on their pictures. The price tells us that.", "Date": "February 24, 2004"}, {"Title": "I wouldn't recommend it.", "Author": "\"meghanin\"", "ReviewID": "R3OJ09Y6RQRTGV", "Overall": "2.0", "Content": "When I saw the camera, I thought it was too good to be true, and I was right. I thought it was awesome to have a 3.3 MP camera for only around $150. When I got it the first think I noticed was the the LCD screen was choppy. It kind of disappointed me, but I thought maybe it was normal and I continued using it for awhile. The pictures seemed fine on the camera and on the computer, but when I got them developed they came out awful. A lot of them were dark and blurry, only a few came out good. The zoom feature made the pictures blurry too. Overall, I wouldn't recommend this camera.", "Date": "January 13, 2004"}, {"Title": "Great way to invest your money w/o return!!!", "Author": "\"dfamstone\"", "ReviewID": "RXX2X5PSQ0PZM", "Overall": "3.0", "Content": "I am a lover of Hewlett Packard products! However this is the absolutely most frustrating product I have ever purchased!! It runs through batteries like water! I have spent over $30 in rechargeable batteries in addition to the 2 batteries that comes with the Hp Dock 8886. I purchased a didgital camera to be able to use the LCD view screen but this screen is very blurry!!! Overall for the price it's what's you get. I'd recommend this camera only to some one who is interested in investing in the battery market ...with no return.", "Date": "January 3, 2004"}, {"Title": "HP 433/435 good outside and durable. Bad inside with flash.", "Author": "Ave Joe \"Ave Joe\"", "ReviewID": "RUX3QC5SVR5J", "Overall": "1.0", "Content": "I bought the HP 433, 128MB memory card, and rechargeable batteries for my 11 year old daughter to take on a trip over the holidays; she openned it early and we returned the HP 433 the next day. Outside, the camera works well in daylight and the pictures are sharp. Inside with flash, the color intensity is poor with a light blue tint - skip the movie mode inside, it's very very poor. The battery life seems the same as other cameras; I took 50+ picutes at the highest quality all inside with flash with one set of 1800 mA batteries before I got tired of taking pictures and stopped taking pictures. HP deserves praise for the durability of this product; my daughter slammed the camera on a wood floor when she lost her balance taking a picture and she fell backwards. The battery cover came off; when I put it back on the camera, the HP 433 functioned like a champ - no harm done and I stongly considered keeping the camera because of its durability. I like the fixed focal length for my daughter; fewer moving parts and every shoot appeared in focus and no blur for moving objects. The display on the back of the camera is very poor compared to a Kodak CX6200 and my old Kodak DC5000. We returned the camera, bought a Kodak CX6200, and were are please with the purchase of the Kodak CX6200. The HP 433/435 is easy to use and the perfect size for \"on the go mode.\" I will conside a HP camera similar to the HP 433/435, if HP fixes the picture quality of inside shots with flash, improves/fixes the inside movies (currenty not worth using inside - outside movies works well and good sound quality), and improves the LCD display on the back of the camera. If HP can fix the above problems, this HP will have a home run on their hands - instead of the current strike out; also, weather resistant with infrared remote would be nice and I'd pay a little more for this.", "Date": "December 24, 2003"}, {"Title": "Terrible Camera for Memories!", "Author": "K. Moll", "ReviewID": "R2XHI6TL45ZOA9", "Overall": "1.0", "Content": "If you care about the memories of your pictures, don't buy this one. The quality of the pictures that we took on our New York City trip at Xmas is absolutely awful. You never knew if you should turn flash off or on to get a decent picture of sights. If you zoom on a person, the pictures is terrible quality, very pixely. DO NOT BUY THIS! You can do better with another $50 elsewhere.", "Date": "January 2, 2005"}, {"Title": "Horrible Product", "Author": null, "ReviewID": "R1EA41AGRX4RCC", "Overall": "1.0", "Content": "This camera should be taken off the market. I understand at this price-level you can't expect the quality of a $500 camera but even at $20 this camera would be overpriced. The image quality is very pixalated. I have seen 1 Megapixel cameras that take better pictures than this one. The battery life indicator is always showing batteries that are half drained; even with new batteries. The viewer looks really bad and cannot keep up with any movement. I brought this camera back the next day. I purchased a Kodak 6330 for a few dollars more and am very impressed with it.", "Date": "February 7, 2004"}, {"Title": "Battery Life Worst for this Camera", "Author": "R DAYAL", "ReviewID": "R2B5K133YWAQK2", "Overall": "1.0", "Content": "I bought this Camera thinking HP Quality will be good, but I am totally dissappointed. The pictures taken are not what you see as it takes them after some delay. The Worst part is the Battery will die within 2 minutes. I kept changingg batteries rather and kept missing taking the good shots during my visit to Sea World.My configuration is that I have added 256 Meg SANDISK SD Memory Card to it.", "Date": "December 15, 2003"}, {"Title": "Very bad", "Author": null, "ReviewID": "R3J2CMU3C3GE5G", "Overall": "1.0", "Content": "I didn't get what I wanted. Pictures are not clear. Digital zoom is nothing.", "Date": "September 20, 2003"}, {"Title": "best camera ever", "Author": null, "ReviewID": "R3KCY7DC8TULDR", "Overall": "5.0", "Content": "this is a great camera that has a lot of pixels and comes at a low price. it is the best digital camera i have ever owned. i have had 5. this is also cool looking", "Date": "November 29, 2003"}, {"Title": "Superb digital camera!", "Author": "superman2k3 \"superman2k3\"", "ReviewID": "R149Y8XUNJW9IY", "Overall": "5.0", "Content": "hp has finally begun to make some cool cameras. hp 435 is an entry level digital camera perfect for those who are new to digital photography.At 3MP its a great and the camera looks veyr (nice). Its small, pocketable and works fast. The image quality is excellent and the shutter lag is minimal. You can even make your movies using it!Once again to summarize the hp 435 is an excellent bang-for-buck camera. Thanks hp!!!", "Date": "November 1, 2003"}, {"Title": "Awful! Awful! Awful!", "Author": "\"akchunsa\"", "ReviewID": "R3QENHLE98ID9K", "Overall": "1.0", "Content": "I regret not harassing the customer service guy at Circuit City to get me new batteries and really investigating this camera before I bought it. It didn't even take me 5 minutes to determine that I would be returning this junk that they sell as a camera.3.2 MP as listed has to be a lie.  I've been much much better quality images from a 1 MP camera. The zoom pixelation is awful, the only clear pictures came when zoom wasn't used.LCD viewfinder shows everything in yellow and moves in slow motion, so you really don't have an idea of exactly what you are taking a picture of.Battery life of this camera is at best 30 mins. Within 5 mins, I was not able to use the LCD viewfinder and could only view the optical view due to lack of battery, then about 10 after that, the battery was completely drained.The only positive to this camera is that the software is easy to use PERIOD.This was going to be a gift for a child who is 14 yrs old. This camera doesn't even suffice for that purpose. No doubt, this camera was returned immediately.Take my advice a quality camera for $149 IS indeed too good to be true...don't waste you time with this camera.", "Date": "October 21, 2003"}, {"Title": "review of reviews", "Author": null, "ReviewID": "R1I33KNT0EOI71", "Overall": "1.0", "Content": "The specs on this camera are fantastic for the price. I was set to buy one for my daughter and another for myself. Then I read the reviews on amazon and couldn't believe the camera could be so bad. No rush. I waited a few weeks and checked elsewhere. When I came back to amazon and the majority of customer reviews confirmed the earlier ones. Despite the pretty glowing \"editorial review\" I am too scared to buy mail order this camera based on the \"customer reviews\". THANX.", "Date": "November 15, 2003"}], "ProductInfo": {"Price": "Unavailable", "Features": "3.1 megapixel sensor captures enough detail to create photo-quality 8 x 10 prints and medium-quality prints up to 11 x 14\n5x continuous digital zoom\nSnap a photo and select your preferred destination--e-mail addresses, printers, and more\n16 MB internal memory; compatible with Secure Digital and MMC memory cards\nPowered by 2 AA batteries (alkalines included, rechargeables recommended); connects to PCs and Macs via USB 1.1", "Name": "HP PhotoSmart 435 3.1MP Digital Camera", "ImgURL": "http://ecx.images-amazon.com/images/I/4111MAZ6XEL._SX300_.jpg", "ProductID": "B0000A602S"}}