{"Reviews": [{"Title": "Excellent camera", "Author": "Glenn H. Reynolds \"Instapundit\"", "ReviewID": "RFA5Y6NRZFS4R", "Overall": "5.0", "Content": "I've had this camera for several months and I've found it excellent.  The image quality is first-rate, and the movie mode is surprisingly good -- even the audio from the built-in microphone is better than I expected, though the camera will accept an external microphone.  I've found the images extremely sharp except occasionally in dim light (there's no focus-assist lamp).  My only complaint is that the flash is located directly over the lens, which tends to produce a flatter look in flash pictures.", "Date": "February 22, 2004"}, {"Title": "Big Disappointment", "Author": "Daniel D. Simon, Sr. \"ddssr\"", "ReviewID": "R26GNTA68KX8X6", "Overall": "1.0", "Content": "I wanted a digital camera with a 10x optical zoom and bought this online without checking it out in a store first. BIG mistake. Had nothing but trouble with auto focus, even on close items. Quality of photos was poor as well (very grainy) even on maximium pixelization. Had to cut my losses on shipping and send it back. I have since checked out the Minolta Z1 in a store and immediately saw a world of difference. I am also going to look at the Olympus 740UZ since I had great performance from my first Olympus (just not enough zoom). I guess Toshiba should stick with what they do well, because cameras is not their forte.", "Date": "November 23, 2003"}, {"Title": "Not that bad", "Author": null, "ReviewID": "RN08XCEGE9LSU", "Overall": "4.0", "Content": "I bought this camera right after it came on the market in order to get better shots of my kids playing baseball and soccer.  That is why I wanted the 10X zoom.  I immediately realized that a tripod or monopod are required in order to capture zoomed shots that are not blurry.  I have managed to capture a lot of very good shots at full zoom using a monopod. Image stabilization would be great, but that adds a lot of cost and bulk to digital cameras.  This camera has a lot of manual features that should be explored to get the best out of your pics.  It does have crappy flash quality (grainy) most of the time, but that is not why I wanted it.  Good camera with lots of high-end features for the price IMHO.", "Date": "January 16, 2004"}, {"Title": "The pros and cons of this camera", "Author": "Dj Magic Mike", "ReviewID": "R1Q80D9WE6GHH1", "Overall": "4.0", "Content": "I have owned the PDR-M70 and after several years when that camera broke, I went ahead and purchased its successor:  the PDR-M700.  I've enjoyed Toshiba cameras because of their ease of use, you can adjust the camera settings manually and take a lot of very clean shots.The issues with the camera have always been focus related, but I think this applies to just about every camera out there.  STEADY HAND, this is needed, especially when taking night shots -- isnt this common sense?  If you cant keep a steady hand, then get a tripod.My biggest complaint with this model, is, indeed, it has problems with focusing in low light situations.  I've gotten so fustrated that I've banged on the camera a few times trying to get it to focus, its very sporadic.. it wants to focus whenever it wants to focus.  Sometimes adjusting the zoom will help it focus better, but its just retarded.  Thank god there is a manual setting, but the screen isnt so clear and getting a GOOD focus is still rather difficult.  Not impossible, just difficult.  You really have to send the files back and fourth to your PC to verify that the picture was taken properly, if you're publishing stuff on the web or taking professional photos.Anyway, besides that just pickup a set of high miliamp recharcheable batteries and a big storage card, this camera will do you well.The other problem that i had with this camera, which I've read some people have as well -- is that it no longer turns on.  Yes, I admit.. I did have this problem after maybe 1 year of use.  Being a techy, I went ahead and took apart the camera figuring I had nothing to lose.. might as take a look inside.  Well, the one wire that connects to the \"ON/OFF\" slider switch, the ribbon connector had disconnected from the circuit board.  I just reconnected it and added a bit of glue to make sure that doesnt happen again.  Yeah, it hasnt happened since.. (6 months now).I guess that sounds kinda discourageable, but like all electronic gadgetry -- they're all bound to have problems.  The good thing is, this camera is fairly easy to use.  ANd if you need it to take it apart, its not impossible should you want to try to clean it or repair it.Best of luck", "Date": "September 2, 2005"}, {"Title": "Versatile super zoom", "Author": null, "ReviewID": "R1JFIEJEF7S2N1", "Overall": "4.0", "Content": "Most striking feature of this camera is of course its lens - a Canon 10x zoom. Even at 10x, its aperture is f/3.1, faster than most such lenses. It has a couple of other nifty features: a remote control which takes the place of a cable release for long telephoto shots, and an auto-bracketing shutter which can be set to take a few shots over and under the nominal settings, to make sure you get exactly the best exposure. Apart from the lens, it is a versatile general purpose, high-end digital camera.Weak points are the measly 16mb SD card supplied, and its tendency to gobble alkaline batteries. You will probably want to buy a larger memory card and rechargeable batteries and charger if you plan on taking many pictures.", "Date": "April 19, 2004"}, {"Title": "I enjoy every shot I make with this camera", "Author": "Gagik Yeghiazarian", "ReviewID": "R2YE1WUE1CV0V7", "Overall": "5.0", "Content": "If you want a good camera and excellent functionality, bright colors and energy efficiency - this is the camera to own.  I have a Fuji (3.2), and Minolta Dimage 4 MP cameras (I am actually selling the latter as I bought this one) - and both can not compete with this one - it takes excellent shots, and the zoom capacity is something you will appreciate and not find in other cameras.  I recommend buying a simple tripod to use with this camera for important shots - the remote control makes it easy to take shots using a tripod.", "Date": "February 2, 2004"}, {"Title": "Don't buy it!!!!", "Author": null, "ReviewID": "R1T6HGGHC6FKST", "Overall": "1.0", "Content": "We too thought this sounded too good to be true.  After looking around we decided on this camera for our trip to Disneyland in November.  What a disappointment.  Like the other reviews state, the auto-focus and 10x zoom don't work properly; the pictures all come back blurry.  So much so that we jumped through all the hoops to get a replacement from the company.  The replacement just arrived and guess what?  The new one is still blurry and out of focus.  My husband uses digital cameras for work so I know it's not \"user error\".  And don't get me started on the low-light condition photos.  I really think Toshiba messed up somewhere in the design of this camera and created a \"lemon\".  We're regretting our purchase and we're now out a lot of money with nothing to show for it.  I will admit that it took beautiful close-up, outdoor photos.", "Date": "January 13, 2004"}, {"Title": "Great for some frustrating for others", "Author": "Andy Young", "ReviewID": "R3O89UJFDRFU0P", "Overall": "3.0", "Content": "I have owned a PDR-M700 for two years.  I have had some problems with it in high temperature, high humidity situations (think Cancun or Cuba, mmmmm).  This is a fine camera for the \"advanced amateur\" but you must work around some of its oddities.You need to keep this camera steady.  It has some stabilization built in, but you will get grainy pictures.  I have taken some amazingly clear shots at 10X zoom inside with existing light but using a tripod.It cannot focus in low light conditions.  The 1M preset focus is actually 18\" to 37\" depending on how much zoom you use.  The 3M focus has similar variability.  I have a string with marks to help me focus.  Now that I use it with the 1M focus, I get crystal clear pictures.The flash is weak and pictures tend to be out of focus.  This is likely because it cannot focus in low light.  I'll be using my 3M string for most of my flash pictures.Through dealing with the oddities of the PDR-M700, I am learning more about photography than if I had bought a simple point and shoot camera.  It is not for everyone, but I will not need to upgrade to a DSLR for a long time.", "Date": "November 16, 2005"}, {"Title": "What a Nightmare!!!", "Author": "\"jmb5886\"", "ReviewID": "RDJGELGQD6JTE", "Overall": "1.0", "Content": "When my husband and I saw this camera we were amazed at the features this camera had compared to the cost.  Well, I guess you get what you pay for.  We were very disappointed in the zoom on this camera.  Whenever we would try to zoom it would just be fuzzy and not clear.  I did order this camera in November so that I would have it for my baby's first Christmas.  Well, on December 23, it broke - it just wouldn't come on anymore.  We tried 4 different sets of batteries, a different memory card, we tried everything and it just wouldn't come on.  Needless to say, we sent this terrible camera back and we are now going to purchase the Fuji S5000.  If I could give this camera 0 stars I would.", "Date": "December 29, 2003"}, {"Title": "Don't buy if you have a Mac", "Author": "\"purplepen68\"", "ReviewID": "R13JFB3919YRTB", "Overall": "1.0", "Content": "We bought this camera about six months ago, attracted by the 10x zoom and the impressive range of features.Sadly, we have been rather disappointed by it.  Although the zoom is impressive, the focus problems mentioned by other reviewers are apparent in ours as well- the camera just seems to focus on whatever it wants -usually the background rather than the middle of the picture.Also, despite following the manufacturer's information about setting it up to work with Mac computers, we have so far been unable to make the camera and the computer talk to each other.We were fobbed off with a series of poor customer service responses and were on the verge of returning it to the store when something terrrible happened to it.  The verdict from the Toshiba, after they had had it in their possession for over a month, was that it had sustained a severe trauma.  We are not disputing that: since we have three children, we think it possible that one of them may have accidentally knocked it to the ground and not told us.  What we are annoyed about is the poor response from Toshiba to our earlier problems, which might have had us take the camera back to the store long before it was so badly damaged. As it is, we are faced with a 246$CAN bill to make usable a camera that has so far proved itself incompatible with our computer- ie not much use. I would not advise anyone to buy this camera unless they have a direct line to Toshiba.  There is a far better Canon out, for very little more money.", "Date": "May 25, 2004"}, {"Title": "A Good Camera", "Author": null, "ReviewID": "RTT5HUSU902HZ", "Overall": "3.0", "Content": "PROS: Canon 10x optical lens, big 2.5\" LCD, remote shutter release, and 52mm adapter ring for filters. Overall, the Toshiba PDR M700 takes good photos with accurate color. It produces even better results when shooting subjects up close.CONS: No image stablization, but a tripod is an easy solution to this problem. No hot-shoe for an external flash. No AF Illuminator.  Images tend to get somewhat noisy in low light situations. Conclusion: The Toshiba PDR M700 is a good camera whose pros outweigh it's cons. I'd give it an overall review of 3.5 stars. Not bad, not great, but good.", "Date": "March 9, 2004"}, {"Title": "great camera", "Author": null, "ReviewID": "R11S0ESS56H6HD", "Overall": "5.0", "Content": "my neighbor bought one.When I saw it and the things you could do with it I just had to have one too. I also saw her pics before I purchased mine. They were great and were on her website. For the price (with the 10x ) it is the best!", "Date": "November 29, 2003"}, {"Title": "Fair outdoor camera", "Author": "Steve Livingston \"nlfrchief\"", "ReviewID": "R184LPN5WJRAJ1", "Overall": "2.0", "Content": "Pros -- Nice lens easy setupCons -- Low light focusThis camera takes pretty good pictures in good light.  It won't focus in low light.  By low light I mean normal night-time in your house lighting.  With outdoor lighting, I haven't had a problem.  There is a work-around for focusing indoors, that works pretty good.  You can fix the focus for 1 or 3 meters, or there is a manual focus setting.  The manual focus setting is cumbersome, in that you have to set the zoom then switch to manual focusing.  So it is pretty slow.I wouldn't buy this camera again knowing what I know, but I can get some pretty good pictures with it working around its quirks.", "Date": "April 23, 2004"}, {"Title": "Not a bad camera, but there are better ones", "Author": null, "ReviewID": "R1IINWPJYB2KJ6", "Overall": "3.0", "Content": "This a good camera.  I had it for a while until it stopped working and I had to take it back.I upgraded to the Minolta DiMage Z1 but I still very muched like this camera.Cons:", "Date": "March 25, 2004"}], "ProductInfo": {"Price": "Unavailable", "Features": "3-megapixel sensor captures enough detail to create 2,048 x 1,536 images for medium-quality prints up to 11 x 14\n10x optical zoom and 4x digital zoom for 40 x total\nContinuous shooting mode at 4 frames per second; 2.5-inch LCD; full array of manual controls\nCompatible with SD and MMC memory cards\nIncludes 4 AA alkaline batteries (rechargeables recommended); connects with PCs and Macs compatible with USB 1.1", "Name": "Toshiba PDR-M700 3MP Digital Camera with 10x Optical Zoom", "ImgURL": "http://ecx.images-amazon.com/images/I/41K05XA5GGL._SX300_.jpg", "ProductID": "B0000AAASU"}}