{"Reviews": [{"Title": "My massive review!", "Author": "L. Wilmot \"FireFighter\"", "ReviewID": "R1B7IAV96FKI1R", "Overall": "5.0", "Content": "When I was looking at which camera to buy I  found an extreme shortage of reviews on the Canon Powershot S80.  So I hope that my addition to the growing number of reviews helps.The following format for my review will start with the Pros, then the Cons, and finally a small summary blurb about the camera...PROS:-Appearance  ~The Powershot S80 is surprisingly small for the power it packs, which helps make it a suitable pick for anyone who travels.  ~Style... I wouldn't be surprised if famous personalities started wearing this camera on their neck chains as \"Bling\".  It is very sharp looking, though one can determine what they think of it by looking at pictures I suppose.-Operation  ~You can find out most of the information regarding this camera's operation and statistics on various websites, but I have a few things to mention that I was not able to find online, or didn't think of looking for.  ~After using this camera it is easy to see that a significant amount of effort went into gearing it for point and shoot photographers.  Have no fear though, it does offer advanced settings that I have not actually been able to play with yet on my S80.  ~8.0 effective mega pixels (8,000,000 pixels) worth of resolution means for example, if you turn on the Macro setting (at least 4 CM or 1.6 inches from the subject) and take a picture of your index finger, then, upload it to your computer and zoom in on your fingerprint you will actually be able to see the tiny particles or dirt stuck between the many crevices that make up your fingerprint.  It is really amazing.  The resolution has been incredible for every photograph and video that I have taken thus far.  ~The video recording capability of the S80 is unmatched for any other camera in its size or price range for that matter.  One of the important factors that I was looking for when shopping for my camera was that the video format was basically anything but \".mov\".  The S80 uses .avi which means that you can use windows media player to watch the video that you record and more video editing tools to manipulate footage that you record.  The video resolution of the S80 goes up to 1024 x 768 at 15 until you consume up to 1 Gigabyte of memory.  I recorded a video last night and watched it (with the cables provided in the box) on my 32'' television.  I am still amazed at how clear the image was.  I will even go so far as to say that this camera will second as a camcorder for certain purposes, which would then imply that I think that it is a good 2 for 1 buy.  Which it is ;-).  You can also record in lower video resolution up to 1 Gigabyte too.  If you are planning on using the highest quality picture and video settings, buy a SD memory card with lots of memory, I bought a 2 Gigabyte card myself.  Ah, and I took a 48 second video on the highest resolution and the file was 87.8 Megabytes, which will give you some rough idea of how much footage you will be able to shoot on the memory card of your choosing.  ~The battery and charger that come with the camera are great, the prongs on the charger can fold inwards when it's not plugged in (obviously).  Which is good for travel.  I have had my camera for 2 days now and I have not needed to recharge the battery yet, which is nice that I have been using it constantly to play with the settings and have taken almost 100 pictures or videos.  Another reason that you might want a camera like the S80 is that it does not use AA batteries, or any disposable batteries for that matter.  My old camera was A Kodak Easyshare 3.1 Mega pixel camera.  I got about 8,000 pictures out of it before it died in a very irritating manner.  It gradually got less and less use time out of new batteries until it would literally take 2 pictures and then turn itself off.  Now it totally refuses to function.  Also, my friend had his camera die due to a simple mistake in battery purchase, he put Lithium AA batteries in his camera (I forget the make and model, it was a 3.2 MP though) instead of the Alkaline batteries he was supposed to be using and it totally broke.  I was amazed that such a simple mix up could kill a 200$ purchase.  When I helped him bury his camera (in the trash) I swore to myself that I would only go with rechargeable in the future.  ~For its size the S80 offers just a little more than the norm with a 3.6x optical zoom.  Which is really cool.  Don't even turn on the digital zoom. It's worthless and probably one of the worst ideas ever conceived.  You might as well take a magnifying glass and hold it up to the picture, the quality suffers when you zoom in with the digital.  ~The LCD screen is massive (2.5 inches) which is good for video playback and reviewing your photos before downloading them to your computer.  It also appears to be very strong, which is a definite plus.-Price  ~Let me just put it this way, for what you are getting this camera is a bargain buy compared to most of the other cameras in its price range on the market right now.-Accessories  ~I bought the waterproof case for the Powershot S80, though I have yet to actually take it underwater I can say that It offers almost 100% use over the cameras controls.  There is a way to rotate the dial (which is one of the controls on the back of the camera) by pressing the \"share\" button apparently, but I have yet to figure that out.  The only thing that you cant do, well as far as I know, is turn off the camera wile underwater, though you can turn off the LCD screen which will save your battery life for ages.  Oh, and something that I was concerned about because I couldn't find information about it online was whether or not I would be able to use the optical zoom and flash easily underwater.  Well, you can, the case leaves room for the lens to extend as far as it can and the waterproof case comes with a flash diffuser that snaps onto the case in front of the camera for good underwater lighting.  The case also comes with a... Well, I don't know what to call it but I guess I could say that its an \"open ended chamber\" (there is a real word for it but I guess that its just not in my vocabulary today) that snaps onto the exterior of the case for easy viewing of the LCD screen underwater, though it doesn't really seem necessary.  There is also a nice underwater neck strap and wrist strap included in the package.  The waterproof case comes totally assembled, and it's pretty easy to open and close.  There are no good pictures of the case online that I could find at the moment unfortunately (well, ones that show the back where all of the controls are).  But its very well put together and looks far more high-tech than I thought it would.  As they say, engineers are the underappreciated (except monetarily) inventors of today's society.  To summarize about the case; It supposedly goes up to 40 meters or 130 Feet underwater and remains watertight.  Take care though, not all people are rated for that depth ;-).  Oh and be sure to use the silicone lubricant for the rubber seal that is provided before you use the camera underwater.  Just to be same make sure that you test your case underwater as a reasonable depth FIRST without the camera in it.  Juuuuuust incase.  I'm not sure if the Waterproof case is made for use in salt water, but I'm assuming that it is, I mean, who dives for and takes pictures of Trout that isn't either making a television documentary, or documenting their ventures in illegal freshwater harpoon fishing, hehe.  ~The accessory kit for the Powershot S80 is a good buy if you are looking for a spare battery (which I recommend for trips without wall sockets (which of course, are the best kind of trips).  It also includes a large, rugged, steel chain neck strap (which is much more convenient than the wrist strap that comes in the box with the S80.  The steel neck strap is coated in plastic to prevent possible scratching on parts of the camera.  You get a nice little carrying case that the camera will barely fit in, the carrying case has a strong belt loop on the back if you want to wear your camera on your hip with a belt.CONS:(The cons will need less explaining)-I would have liked the Macro setting to be a little closer than 4 CM.-The camera offers digital zoom (which virtually all digital cameras offer unfortunately).-The lens is surprisingly noisy on camera startup and when you change the zoom.  This isn't really as much as a problem as it's just that I take lots of wildlife photos and it might someday ruin a great photo opportunity if I have a close encounter with a frantic creature.That's about it, I took a good long amount of time to try and think of more negatives but couldn't.  I could probably add more pros but I think that this review is long enough.  I have only seen 2 negative reviews for this camera and they were on different websites, one was because the person who bought the camera disliked the fact that the Powershot S80 changed to SD memory cards.  That was the only reason in that review that I could find.  And the other negative review was because the S80 does not give you the ability to shoot in the \"RAW\" format.  Which could be a drawback for some of the more advanced photographers, but it didn't bother me that much.  Anyways, that was my lengthy review.  I tried to keep it from being dry which is tough when you're writing a review on something so technical, hah.Oh, and if you were thinking about buying this camera, the only reason that you shouldn't is if you absolutely need the RAW format or higher optical zoom.***RANDOM TIP:  Remember to always BACK UP YOUR DIGITAL PHOTOS and other information.  I was vacationing in New Zealand about 9 months ago and had my laptop stolen with every single digital photo that I had ever taken on it, none of which were backed up anywhere.  The laptop was probably worth 500$, but all of my pictures of the vacation of a lifetime and everything before that(about 8,000 pictures or so) were priceless in the most literal sense.  Just so I dont make New Zealand sound bad; It does have one of the lowest \"violent\" crime rates in the world and I have decided to move there for a year, It's actually the reason that I purchased my Powershot S80.  Steal my pictures and I will just go back and take more, heh.Thanks for reading,Matt", "Date": "October 27, 2005"}, {"Title": "A Compact That Tries To Be a DSLR (and Almost Succeeds)", "Author": "J. Wong", "ReviewID": "R2ZFYZGRVC40X8", "Overall": "5.0", "Content": "I bought my S80 on the recommendation of those fine people at dpreview, who describe this camera as suitable for a serious photographer wanting DSLR capability in a compact.  After a week of fiddling and testing in various conditions, I'm really impressed with both the camera and the accuracy of the dpreview.No, this tiny little box will not replace your DSLR. It's small sensor and lens handicap it in medium and low light.  Faint noise begins appearing in shadows at ISO 100, noise is visible at ISO 200, and very visible at ISO 400.  You probably won't go beyond 4X6 size at ISO 200 with \"good\" results.  Zoom is restricted, and there are some corner problems when the lens is wide.  I've found it tricky not shaking this tiny, light machine when I press the trigger without support.  Autofocus is reliable and efficient, but not \"fast\" by DSLR standards.But at ISO 50 (and sometimes 100), this camera can shoot smooth, clean pictures with rich, accurate colors and resolution good enough for 8X10 prints (maybe even larger) that could be suitable for framing.  For a compact, I think this camera's dynamic range is terrific---it can capture small tonal and color differences in both the light and dark areas of a picture almost as well as my Canon DSLR, and that's saying a lot.  Even at ISO 200 and 400, when noise begins to mar the picture, you still get an admirable amount of detail and color.And, wow, who ever heard of a compact non-DSLR that can fill an entire 1 gig card with continuous full size fine jpegs?  In shutter priority mode, my S80 has shot 17 frames in ten seconds (7 frames in ten seconds in aperture priority) without having to come up for air!  I used both SanDisk Extreme and Ultra II SD cards, and the little guy just didn't stop clicking.There is no raw mode, but if you enjoy fiddling with your pics in Photoshop, take the sage advice from the dpreview people and turn down the constrast, saturation, and sharpness.  You will get a raw-er jpeg image out of the camera, that can be custom tweaked in post-processing.  I've been amazed at some of the results.If you're accustomed to DSLR performance, you'll be giving up a lot when you put the S80 in your pocket and leave your camera bag at home.  But I've been having a blast just exploring the limits of this camera, and am convinced it will capture some great impromptu pictures over the next year.  The flaws I've noted tempted me to rate this camera a 4, but that just wouldn't be fair.  The S80 is made to go in your pocket, and you just can't expect a cigarette box sized camera to perform like a two pound DSLR with an L lens.  There are 8X10's I've shot with my S80 that look like they were shot with a DSLR, and that's why I'm impressed (again) with those guys at Canon.  My S80 is going a lot of places with me.  It is the best compact I've ever owned.", "Date": "December 3, 2005"}, {"Title": "This camera is simply amazing, packed with features, and perfect for the serious amatuer", "Author": "Phoenix Rising", "ReviewID": "R1J5DJM9HVIK65", "Overall": "5.0", "Content": "I had been extremely reluctant to forgo my beloved 35mm cameras and go digital.  I own a Canon 7E SLR and an Olympus 28mm-80mm point-and-shoot.  When I finally decided to go digital, I planned to replace both 35mm cameras, starting with the Olympus point-and-shoot.  After much research, I decided to go with the Canon S80.I have just returned from a 3 week trip to India.  The S80 blew me away!  I am so impressed with the camera's features that I have decided not to buy the Canon 20D digital SLR!  For starters, the S80 packs a mind boggling amount of features.  Just like Canon's SLRs, the S80 goes from fully automatic to fully manual.  I have never before owned a point-and-shoot that allowed me to fully control the shutter speed and aperture.  Sure, the S80 does have limitations vis-à-vis Canon's $1,000+ digital SLRs (for example, the shutter will only stay open for 15 seconds max).  However, for the serious amateur (or a photo novice who seeks to improve his/her photo taking skills), I think this camera is perfect.  It is surprisingly easy to use with intuitive features, especially if you are used to Canon's mode settings.  I was pleasantly surprised with its flash.  I can increase and decrease the megapixels of my pictures with the push of a button.  The S80 is a bit thicker, and heavier than other 8 megapixel cameras.  But the slightly increased size and weight is well worth the added features packed into the S80.  I bought a CaseLogic pouch and carried the camera around my belt for three weeks, no problem at all.  Finally, the zoom is \"noisy.\"  But seriously, who cares.Oh, one more thing...be sure to buy a 1 gigabyte SD card that has at least 133X speed.  The 32MB card that comes with the S80 is woefully inadequate considering that (a) you can only fit about 8 pictures at the 8 megapixel setting and (b) the card is extremely slow as compared to 133X speed cards.", "Date": "January 19, 2006"}, {"Title": "Couldn't be Much Better - Amazing", "Author": "J. Griffin", "ReviewID": "R3NF28VGTSLODF", "Overall": "5.0", "Content": "I have owed many digital cameras over the past 8 years (at least 6), plus fancy Nikon SLRs before digital. I concider myself an amateur photographer. My last camera was a Canon SD500 (i  carelessly dropped it hard and it died, it took other drops and was fine) I used it very often for about a year. I loved it!!! But it did not have the manual features I really like, but overall it did do most artistic type shots that I wanted. I personnaly prefer a quality small camera over any larger camera. I have also compared other brands use and prints, and nothing beats a Canon, IMHO. Canon's just seem to print out what you original saw on camera without having to make any changes on the computer.The s80 is amazing! You just can't go wrong!  It Canon's latest evolution as of Spring 2006. Its everything the SD500/550 is plus a lot more, although it is a bit heaver and larger, but not too much so.  It is so easy to use and has a scroll wheel that is really effective.  It has so many features and options, but the s80 still manages to keeps them fairly usable.Please ignore other reviewers argument over RAW. Snobby purists insist on RAW. RAW takes hours of work for marginal improvements. JPEG is better for almost all applications.Pros: - Does everything possible short of being an SLR! - Nice intuitive controls - Great picures with superb resolution and lighting - Really, it has everything! - Could be used as a web cam (with additional software) - Does higher res movies with audio (works great) - Does time lapse; braketing (three shots in one); flash offsetCons: - Besides personal opinions of style, comfort, and  minors issues of SD vs. CF cards - NO major Cons. I much  prefer SD cards (smaller, cheaper, more standard) - It has a slightly noisy zoom (not too bad) - If you have big fingers, it would be harder to use.OVERALL, if you really just want point a shot camera, the s80 can do that, but is really more than you need, get the SD550 or A95 instead. Just about any 5-6mp camera will do most family snapshots.If the 5-6mp camera can print 8x10s, why would anyone need a >6mp camera? A: Cropping, cropping lets a novice take about any picture that has way too much space over people's heads and frame it more professionally (according to books). Cropping can create better eye flow and more detail.  Even cropped you can print great pics. Also, if you really want to print good poster size prints then 8mp will do the trick.--------------------*** Digital SLR vs. Digital Compact/Snapshot Cameras:I have had many types of cameras and lenses. Overall each has its purpose and target user. But, I feal that a compact like the s80 has as many or more features and abilities as larger good SLRs.I think that SLRs main current strength is that they have:  1) Easily changable lenses  2) Perhaps better f-stop ranges (greater depth of field)  3) Longer battery time  4) More shots per secondThese SLR advantages do not outweight the large bulky form factor and high cost when compared to a good compact. The s80 is the first really good compact that meets or exceeds a good SLR in terms of features and resolution. The s80 meets 98% of my needs.  I value being able to pull it out of my pocket for a quick candid type shot over having an obvious bulhy camera that it all too often stuffed in a camera bag. And when I need full manual setup with tripod and lighting and remote triggering the s80 is full cabable and its printed photos are as good or better that other SLRs I've used.  Plus, it is much easier/cheaper to use underwater with special case (I dive - it works great). Woefully, a compact camera just doesn't look very professional, but that is psychcological.", "Date": "February 23, 2006"}, {"Title": "Best point and shoot --- with precautions...", "Author": "Wesley Anderson \"World Cruiser\"", "ReviewID": "R3VM159X3YBOCW", "Overall": "4.0", "Content": "Everyone has already written about the features of this product. I agree with them completely. This is the best point and shoot you could ask for. I just want to warn those of you looking to purchase...I love this camera. I do not regret buying it. I travel all over the world as I currently work on a cruise ship. My old point and shoot was compact and convenient but took horrible low light pictures (low light meaning anything that was not outside). It was stolen so I needed to buy a new one.I am a bit of a tech head and love gadgets. If I had my choice I would have bought the Canon 20D as I have been drooling over it for some time. But, the 20D is not always convenient for going to the beach, etc... So I bought the best point and shoot I could find. This camera is awesome.That being said it also broken now. I only got about a month of use out of it. The problem starts with its size. Sure it fits in your pocket but is definately bulky. Basically what happened is that while it was in my pocket the slide cover slipped up and the telezoom lens tried to go out (this happens everytime you turn it on). It being in my pocket kept it from doing so and now the motor is broken and I have to send it for repair.This was completely my fault as I was a bit careless.I just want to warn those of you who want to be able to put this point in shoot in their pocket... DON'T DO IT!!!! Buy a case!Otherwise, by all means, buy this camera. I love it and can't wait to get it fixed.", "Date": "May 5, 2006"}, {"Title": "Canon S-80 is Amazing", "Author": "P. Falle", "ReviewID": "R5EBQK2S86CMU", "Overall": "5.0", "Content": "I have had several different digital Camera's since 1998. I have generally stuck to the Sony Brand because I love the Carl Zeiss Lenses, but I have also had Casio and used Nikon quite a bit.  as far as smaller non SLR camera's go this one is awesome!  It does take a little getting used to because there are a lot of options to choose from but once you get the hang of it, its really an impressive camera.  The picture quality is very good, I also own the Canon i9900 printer and both the color and B&W; prints are excellent with this.  I used to get a bluish tint with my Sony when I tried to print black and whites.The fact that you can store multiple profiles on the camera is awesome.  all you have to do is turn the wheel and choose which profile you would like to use, once its set up its easy.  The manual option is great, but does take a bit of getting used to, although you cant beat it for portrait shots, the depth of field can be manually adjusted.  the movies are great quality, I have a 42 inch plasma TV and the movies it produces are as sharp as from my camcorder (to be fair the camcorder is 5 years old, but still impressive video for such a small camera.Another cool feature is the color swap.  You can do the same thing after the fact in Adobe, but nothing beats looking at the new colors live right after you take a picture.The only thing I will ding the camera on is that it has no battery indicator on the screen, you kind of have to guess how much you have left, it's not enough for me to give it less than 5 stars.  The picture quality is excellent and on the highest settings you can crop a picture a lot and still get an excellent 8 x 10 or 13 x 19.", "Date": "May 22, 2006"}, {"Title": "Yeah .. Its good but I expected more", "Author": "Rajeev Bector", "ReviewID": "R47W0UEFGA145", "Overall": "3.0", "Content": "I got this one to replace my S110 and also to take to places where I cant take my D70. Overall, the camera takes good pictures. I will focus on the cons. For this much price, I would like to see following improvements:1) Thinner and slightly smaller than what it is so that I can fit it into my pocket (its not a big deal but a wish list)2) The LCD resolution is _BAD_ for a camera in this price range. I seriously seriously wish that Canon fixes it. Some people may not mind, but for me, reviewing the picture is important and low resolution LCD just doesnt cut it for me3) The dial wheel on the right should have a mechanism to \"lock it\". Whenever I take my S80 out of its case, the wheel has turned to another mode. I always have to remember to reset it. Bad mechanical design. The least they could have done is \"provide a way to lock it\"4) Ditto for lens cover. Sometimes, the lens cover moves too easily (while sliding the camera into its case). I could buy a bigger case but that loses the point of buying a small camera !5) The flash shouldnt have been a pop-up flash to reduce red-eye.", "Date": "December 12, 2005"}, {"Title": "picture perfect", "Author": "Dr. Moebius", "ReviewID": "RS0S1FYP29XMS", "Overall": "5.0", "Content": "I would not recommend it for your aging parents or in-laws, unless they happen to be professional photographers The Powershot S80's advanced features are more likely to appeal to folks with more photographic experience.Cons:1. Slightly larger than the Canon Elph series, although it still fits in my pocket.2. Shutter can stay open only 15 seconds maximum (I would of liked at least 30 seconds for nighttime exporsures).3. The provided 32Mb SD memory card is only big enough for about 9 images at full resolution, so you'll want to add a 1 Gig SD memory.4. You can buy one for less than four hundred dollars (check out some NYC camera stores).5. The camera does not come with a leather camera case. However, you can purchase the Canon S80 kit to get an extra Li-ion battery, a nice leather camera case, and neckstrap for about US$60.Pros:1. Controls are very intuitive.2. Large LCD makes reading the menus easier, even without my reading glasses.3. Advanced user manual is straightforward.4. The ease of reading the large (2.5 inch) LCD makes learning dozens of powerful features much easier than the labryinthinan Fuji FinePix point control system.5. Downloads via the Canon suite of Ulead Zoombrowser tools is much easier than the earlier versions of Zoombrowser I had used with my other Canon Photoshot digital cameras6. Althogh I have not purchased a water-tight case for underwater photography yet, Canon makes one and it is reasonably priced (about US$150).7. The movie mode (640 x 480, 30 frames per second) is handy, especially with a Gig of memory to store long movie clips.8. The software includes Photostitch 3.1, one of the better tools for creating panoramas.", "Date": "January 16, 2006"}, {"Title": "Canon s80 vs 20D & Underwater photography", "Author": "Steven G.", "ReviewID": "R1YE118W87PO9K", "Overall": "5.0", "Content": "A week before out trip to Australia I bought the S80, so I did not have much time experimenting with the camera.Having already a Canon 20D, I bought this camera for two specific reasons:1) Underwater Photography2) City & familie pictures (the 20D is just too large to take inconspicious with you).First off, the pictures taken with the 20D are better then the S80 but not by much in bright light. Part of the reason could be that we just were more used to the 20D, tried mostly the auto mode with the S80 and the build in flash is just not powerfull enough.Before buying this camera I complained to Canon thet they switched to SD type memory for this camera, but during my trip my dedicated CF reader broke because one of the pins bend. Hense, I wish now that Canon would move everything over to SD flash cards.One of the fun features of the S80 is the different modes and Video you can shoot with it. The different modes like beach, night etc are a bit troublesome since the S80 has similar features as the 20D so it can change the shutter speed to less then 1/60 and it does not let the user know (as far as I can tell that is what is happening). This gave me some major shake (blurry pictures) when shooting in dark complex settings like a forest or at night, but then what do you expect with automatic mode.Using the TV/AC/M/P mode prevent this shake since you are more in control of shutter speed.The manual settings on the S80 are extremely good, it is litterly an SLR in a very small body. You can change almost every aspect of taking pictures.The video mode surprised me in a positive way. It is VERY clear and sometimes the S80 takes better video then our dedicated Digitial Sony Camcorder. There is some noise when it is quiet around you from the camera, but then I overlay my sound most of the time anyway so this is not an issue. In 640x480 mode the camera can take around 7 minutes non stop which is often more then enough for insidental video moments.One of the greatest features for all people interested in underwater photography is the underwater mode. The S80 compensates very well for the reduction in red light.We took 100s of pictures and they are comparable to those made by professionals as long as the pictures are taken above ~10m (30 feet) in good light conditions. Below that point the build in flash just does not perform well enough and everything turns a bit more gray. A dedicated strobe light would take care of that problem.One feature I just loved underwater is that this camera can also take video in underwater mode with sound. It sounds a bit like Darth Vader breathing from your second stage, but the video is very crisp and allows you to bring back one of the greatest souveneirs possible. How often can you actually show people how it feels to Scuba dive, show coral waving in the current and see a turtle swimming up for air?I compared the pictures and video against those made by a Sony and Olympus compact camera and there is no comparison. The S80 outperforms these head over heel.Overall, the S80 is one of the best compact cameras you can buy on the market at this time. The pictures are great, the flexibility because of the manual mode settings is increadable and you get a full video/picture system to dive with up to 130 feet for less then $1000 (camera, 2x1GB SD cards, underwater case, underwater weights, 2 year extra warranty).Four changes I would recomend:1) Dedicated battery power indicator, now it is hard to figure this out2) Display the shutter speed for ALL modes so shake can be prevented.3) Underwater case should have a means to rotate the dial (not possible with current case restricting manual mode underwater, but you can pre-program the camera)4) When changing the flash or Macro setting in the SCN mode, the user needs to reset them each time the camera is turned on.", "Date": "November 24, 2005"}, {"Title": "Nice little pocketable", "Author": "Tezza \"Tezza\"", "ReviewID": "R34U58LE20NTPN", "Overall": "4.0", "Content": "I currently own a Canon 20D so I was looking for a high quality pocketable camera as a compliment to my \"big rig\".The S80 is a nice size, although maybe a little heavier than expected, but still pocketable.The manual itself is not up to the usual Canon standards, in my opinion.  I found it difficult to understand the manual, which is kind of strange, since I was able to easily follow the manual for the 20D which is theoretcially a much more complicated camera.The S80 powers up quickly, and has a very nice rear LCD screen.  The viewfinder is sort of rangefinder like.  The viewfinder follows the zoom, making objects appear larger and smaller as the lens is zoomed in and out.Image quality is very good, however not truly stupendous as compared to images you might see on some professional review websites.  I think the professionals find all the best light/photo situations to portray the camera in the best possible light.A slight disappointment is the max ISO400 sensitivity.  Already at ISO400 the image is somewhat noisy, which I would have expected more from Canon.The controls and overall usability, however, is a class act from Canon, which is known for class acts.All told it's a very good cam, but not truly an excellent one, in my opinion, so I only gave it four stars.To be a top cam, it would need to give 800 or 1600 max ISO, even better image quality and a better manual.Being able to shoot in RAW format would have been nice too.I think Canon hit a nice level with the S80, but maybe didn't reach enough to call this a professional's second cam.-- Terry", "Date": "December 10, 2005"}, {"Title": "A Fantastic Camera!", "Author": "D. McIntosh", "ReviewID": "R2HGU3NZEIRUKG", "Overall": "5.0", "Content": "Pros: Fast response, amazing 8mp pictures, variety of controls including full manual, easy to use and the list goes on...Cons: Size is a little thicker and longer than most compact digital cameras, but it it's loaded with so many features and power that it makes easy to overlook the size thing.Full user opinion:I must say that this camera is not only a great product, but it's a lot of fun too. With all of the options it has to offer (aperature priority, shutter priority, program mode, manual mode, scenes mode, auto & video) there is so much experimenting you can do.The pictures come out gorgeous, with accurate color and clean detail.Macro mode is really good, although the flash can be a bit harsh when in macro mode.The video is another great plus with this camera; quick, easy, good sound pick-up.LCD screen is not only a huge vivid screen, but displays accurate colors and detail of the image being taken.I also love the rotating image feature depending on how the camera is held during playback.Battery life is pretty good.Another fun feature is the my colors function. I spent a whole day testing out that feature; I really got a lot of interesting shots that way.The price may seem steep, but with it's sturdy construction, great performance, number of modes & features, and wonderful image quality, it is so worth the money!", "Date": "December 5, 2005"}, {"Title": "Despite the lack of RAW it's great!", "Author": "P. White", "ReviewID": "R2DPNVJHTU6P1F", "Overall": "5.0", "Content": "To J.Griffin whose review is below:'Snobby purists insist on RAW.'No, people who understand bit depth and post-processing insist on RAW. If you insist on calling people who are educated and skillful snobby then that's your (sad) business.'RAW takes hours of work for marginal improvements.'It does not. It takes seconds or at worst minutes.'JPEG is better for almost all applications.'JPG is 'adequate' for almost all applications but it is certainly not better (unless by better you mean more convenient). RAw images are 16 bit and JPGs only 12 bit so again, learn!Now to my review: the S80 takes marvellous still images. I've used an S70 for over a year (mostly in RAW mode Mr Griffin) including a trip to Japan and it's generally (although not consistently) the equal of my Canon 20D DSLR. The S80 is better than the S70 because of the slightly higher resolution, the digic II processing (faster response) and very importantly the video mode. The S70 has a poor video mode (640 x 480 @ 10fps and only 30 second files) but the S80 blows it away with 640 x 480 @ 30fps or 1024 x 768 @ 15fps! Both the modes are constant up to 1GB or card fill. Now think about this: put a couple of strips of masking tape over the top and bottom of the lcd monitor to give a 16:9 aspect, shoot in the XGA mode and then use Premiere (or whatever) to crop the 4:3 output of the S80 into 16:9. What we have here people is a pocket widescreen camcorder at near broadcast quality(ish... & mono sound... but that's picky).Unreservedly recommended.", "Date": "March 20, 2006"}, {"Title": "Canon never fails to exceed expectations!", "Author": "Stephen Thoemmes \"All sins are just efforts t...", "ReviewID": "R1IR99U5VLOG40", "Overall": "5.0", "Content": "For the past 20 years I've used Canon SLR's (F-1's) and many of their \"L Series\" lenses. No complaints, only pleasure.Not too long ago I purchased a Kodak high end digital camera. It was just OK. I used it mostly on emergency response calls for it was smaller than an SLR and a might more rugged.Now I chucked the Kodak, I trimmed my Canon collection down to 1 SLR and 2 lenses, and purchased the S80. I'm running a 120X 2 Gig and a 150X 1 gig SD card.The pros:The display took my breath away. Large, bright, and clear. The physical size is perfect. It may be just me but I enjoy the programmable sounds. The controls are pretty easy to use (gotta read that manual). Battery life is great. And finally, the image quality is beyond words. Also there are so many built-in ways to manipulate the image. The added bonus of shooting practical video at various resolutions is great (need that large SD card though). Sure, it's not an SLR with many available lenses. And it is 'point & shoot'. But now I'm using it almost exclusively versus my SLR.The cons:Wish the package came with more than it did. A neckstrap should have been included. The wrist strap just invites damage and disaster. One very flimsy part is the 'A/V out' door. I just cannot see it remaining attached to the camera beyond a couple of months. The documentation is daunting. The simplified manual is 26 pages. The 'advanced' manual runs 160 pages. I became pretty frustrated with the adavnced manual and its tiny size.All in all you really get what you pay for. I don't regret it at all. Save your money and bite the bullet and buy this camera. It goes so far beyond many preconceptions of digital point & shoot cameras.", "Date": "February 8, 2006"}, {"Title": "Another Really good Canon S Series Camera", "Author": "Ajay Mungara \"Mungara\"", "ReviewID": "R2M0GKWKTM1SUC", "Overall": "5.0", "Content": "I was looking at replacing my S30 digital camera. S30 really worked well for me for many years, but it started to give me some problems. I was really debating between the SD 550 or SD 600 and the S80 canon models. I thought 8 Megapixels with S80 was good, but I was not really sure if I needed it. I really liked the compact nature of the SD series , the startup time and the shooting speed. But, I wanted something better than the point and shoot camera. I was really worried about the flash capability of compact cameras. With S80 I could reuse my battery back. Even though I could not use my Compact flash memory, but I think SD memory is really nice with S80. And I really liked the shooting modes the S series provided and decided to buy S80. I have been using this camera for over 3 months and really love it (I am so glad that I leaned towards S80).", "Date": "May 18, 2006"}, {"Title": "E18 error", "Author": "Kurt L.", "ReviewID": "R3TMKPKP63PDSS", "Overall": "3.0", "Content": "I'm not a pro on digital cameras, so I don't know how else to describe the pictures other than great-looking. I bought this two months ago and I've been very satisfied, until last week I opened the front cover and the lens got stuck between the fully retracted and fully extended position. After 5 seconds of clicking, squeaky noise the screen prints \"E18\". I did not drop or cause any impact to the camera. I thought I broke the camera but after some research online I found out that this has been a notorious problem for many Canon digital camera models and lots of people had experienced this. I tried a couple simpler tips & tricks offered by online users including power up with brand new batteries, shake it, knock it... no help. I am going to send it back for repair, fortunately mine is still in warranty. Some people experienced this error the first time they use the camera, and some experience it after hundreds of shots and the warranty had expired. I hope my experience will provide some info and precaution to future S80 and other Canon point-and-shoot camera buyers. Maybe I just have bad luck, but IT HAPPENS and there isn't much you can do to prevent it.", "Date": "June 15, 2006"}, {"Title": "E18 ERROR MESSAGE! SERIOUS PROBLEM CANON IGNORES! YOU ARE WARNED!", "Author": "S. Paci \"Shutterbug\"", "ReviewID": "R1X49HV3E3QBLA", "Overall": "3.0", "Content": "I am changing my original review, unfortunately I can't reduce the number of stars accordingly. After owning this camera for seven months (admittedly it takes great pictures) with no warning the lens no longer extended and I got an \"E18\" error message. I did not drop the camera or otherwise abuse it. It turns out this is a serious problem that has affected thousands of Canon users on dozens of models over the last few years. There is even a class action lawsuit. I am sending the camera in for warranty servicing but based on other consumer's experiences my hopes are not high as Canon tends to blame the consumer rather than admit they have a serious problem.  So do yourself a favor and Google \"Canon E18\" before buying this or any other Canon digital camera.", "Date": "April 28, 2006"}, {"Title": "Great camera, worth the money", "Author": "A. S. Johnson \"seeking change\"", "ReviewID": "R2O9RV8J39J2W0", "Overall": "4.0", "Content": "We bought this camera for Christmas, and have been using it pretty steadily since then, mostly for indoor shots and short videos. So far, we are very happy with the quality of the pictures, and the videos are excellent because this camera can give you such high resolution. Overall, I think this is a great camera, and I definitely recommend it.The battery seems to last quite a while as well, which was a big concern for us, since some of the older digital cameras were really hard on batteries.Another thing I REALLY like about this camera is the size of the viewing screen. It's larger than older cameras, and it really makes a difference. You can set the level of light in it, or turn it off completely, which is really convenient sometimes.There are a few fun features. For instance, our camera barks when we take a picture. Useless overall, but cute.Here are the few problems I have:There are so many features it takes time to figure out what you want. This is compounded by a user-unfriendly manual.We have a 1-gigabyte memory card in it, which is great if you're using it for many videos. It does seem to affect the response time after a photo is taken though.I have a hard time not getting red-eye. I've tried many indoor settings, but still seem to get it on some photos.", "Date": "February 14, 2006"}, {"Title": "Underwater photos", "Author": "Richard L. Zade \"Rich Z\"", "ReviewID": "R264GEK0UM0DLO", "Overall": "5.0", "Content": "I purchased this as a replacement for my Canon Powershot A90 which was stolen.I am completly blowen away by the quality and detail in my underwater macro work with this camera. My only complaints are the underwater housing does not allow you to use the manual focas feature and the canon underwater setting is totally useless in the Pacicic Northwest due to the water being green not blue. However with a good light and the proper settings this is not a problem.I would highly recommend this camera for underwater use with the Canon housing. On land it is equally impressive. Short of a full blowen SLR you won't find another digital that takes better shots", "Date": "May 19, 2006"}, {"Title": "Canon answers the call!", "Author": "Jon L. Roberts", "ReviewID": "R3NZ03PNH9SFT1", "Overall": "5.0", "Content": "I've owned nothing but Canon digital cameras in my life - the G1, G2, S70 and now the S80. My biggest gripe with prior cams was the lousy video quality.  The S70 was improved (640x480 10 fps), but still not suitable as a video cam replacement.  Now, Canon finally answers the call with the S80. It's awesome to be able to carry a camera in your pocket that takes perfect still pictures AND can double as a respectable video cam.  In addition to the lower rez/frame rate problems in past cams, zooming or adjusting for light changes while capturing video wasn't possible. This cam does both. Bravo!  Of course, you need plenty of SD memory, but I can live with that. (2 gigs gets you ~16-17 mins at 640x480).Is it worth upgrading from an S70 to an S80?  If you care at all about video, then absolutely!  The S80 interface is also much improved and the large LCD is wonderful.  If the video hadn't been drastically improved, I would've stuck with the S70 and waited for the S90 or considered the competition. The downside is the switch to SD memory from CF but that's the price of progress. Hopefully SD is as durable as CF.I really wanted the underwater housing option for my S70, but since I wasn't 100% happy with that cam, I held off.  I just ordered it for my S80 from Amazon.The biggest complaint people have about this cam is the lack of a RAW mode.  Seeings how I never used it on the S70, I probably won't miss it on the S80.", "Date": "December 14, 2005"}, {"Title": "superb", "Author": "Tweedle Dee", "ReviewID": "R2R05IZKF1R1AM", "Overall": "5.0", "Content": "after reading many amazon reviews i went for this camera. fantastic shots, many manual settings and EVERY BUTTON IS WHERE IT FEELS IT SHOULD BE; this camera is incredibly easy to use. Not one annoying feature. beautiful colour levels too.It lacks a 'steadyshot' feature if anything, but my low light pics have turned out well, and if you need a flash this has an adjustable one (3 brightness levels i think.)one further note: do NOT buy this camera from oneclickdigital.com if you are tempted to shop around. they undercut any price but are scam artists, and will only honour the purchase if you buy other 'bargain' (expensive) accessories.", "Date": "July 8, 2006"}, {"Title": "superb", "Author": "Tweedle Dee", "ReviewID": "R2R05IZKF1R1AM", "Overall": "5.0", "Content": "after reading many amazon reviews i went for this camera. fantastic shots, many manual settings and EVERY BUTTON IS WHERE IT FEELS IT SHOULD BE; this camera is incredibly easy to use. Not one annoying feature. beautiful colour levels too.It lacks a 'steadyshot' feature if anything, but my low light pics have turned out well, and if you need a flash this has an adjustable one (3 brightness levels i think.)one further note: do NOT buy this camera from oneclickdigital.com if you are tempted to shop around. they undercut any price but are scam artists, and will only honour the purchase if you buy other 'bargain' (expensive) accessories.", "Date": "July 8, 2006"}, {"Title": "Almost there!", "Author": "A. Girdhar", "ReviewID": "R2VZROQVIHGVEF", "Overall": "4.0", "Content": "I bought S80 and Canon iP6600D printer bundle, and am overall pleased (though not very pleased) with it.I fell in love with the camera just by reading the reviews and features. The 28mm zoom feature is great which lets you get so much more in your picture. No more crouching into corners to avoid missing people in indoor pics. Once I got it .. I'm happy but not super excited. Some things do not match the high price tag of the camera eg. the low resolution grainy LCD. Also, atleast the 4x6 prints are not too much better compared to my old 2.1MP sony. That might be probably I've yet to read the manual and learn how to take professional snaps .. or might just be the camera! The video mode is great - 1024 x 768 @ 15fps ... but a looks a little choppy. I've heard that the next model coming soon will have 1024 x 768 @ 30fps .. thus completely eliminating the need of a camcorder. (Yeah, I'm having a little buyer's remorse .. could have waited). As somebody else pointed out, the red-eye problem is horrible. To bypass it, I sometimes take 3-4 pictures of the same shot and then keep the one which has the least red eye.FYI: The S80 comes with a 32MB SD card (useless for all practical purposes), and of course 1 rechargeable battery + usb cable.Edit after 8 months of use: Today, I just got my camera back from repair. Similar to what many other reviewers pointed out, my lens cover jammed in on position. The canon service was prompt, but I kind of have lost faith in this product which malfunctioned after 8 months (what if it were 12 months ... and I was out of warranty?). I'm pretty sure the flimsy cover will screw up again in the next 12 months making me go back to a Nikon or a Sony.", "Date": "April 3, 2006"}, {"Title": "A Note About Video Sound Quality", "Author": "C. David Gammel", "ReviewID": "R21CFPDDXPY84E", "Overall": "5.0", "Content": "Others have commented on all the great features of this camera, so I will just focus on one flaw I noted in recording videos.There is often a slight whine in the sound recorded with videos on this camera. If there is a lot of background noise it isn't too noticable but in quiet settings it can be a bit distracting. The noise is not apparent when playing back on the camera but is noticable when you play the donwloaded video on a computer.Other than that, it is a wonderful camera that I would highly recommend.", "Date": "March 6, 2006"}, {"Title": "S-80 Looks good but has serious drawbacks", "Author": "Lawrence A Team \"A team member\"", "ReviewID": "RAGG4Y0SIGRXN", "Overall": "3.0", "Content": "I have had my S-80 for over 6 months and have used it extensively. The photo quality is very acceptable and the package is certainly compact. The view screen is large and very easily seen. Having a dedicated optical viewer is a plus. Battery life is above average but Canon charges a fortune for a spare battery.However, as an experienced user, I would like to pass these caveats on to potential buyers.The S80 has an ultra compact control array. When using the camera, you will frequently (accidentally) press buttons and change settings while attempting to take photos. Canon has placed the tele switch and the camera/view switch exactly where your thumb always goes. This is unforgiveable ergonomic/design error. Additionally, the on off button is so very easily depressed while the camera is in its optional case. I advise to turn on the sound so that the user has some chance to be alerted to another accidental activation so the battery does not get wasted. Other controls are similarly too close together. Also, the bottom battery/flash card door opens if you merely graze it with a glancing touch. This turns the camera off instantly. Canon needs a safety interlock for this access door.The specs call for very little shutter lag but I assure you that it can become infuriating. Frequently, the camera is as slow to fire as much earlier generation digitals. Not good at all. The S80 has a plethora of features with a soundly designed menu system. However, you will have to read, read read the manual  since many controls are not at all intuitive and require specific instructions. All in all, the camera returns good pictures but I will move on to the next generation the second they become available and quickly forget this S80 with it's quirks and frustrations.", "Date": "September 10, 2006"}, {"Title": "So Far, So Good", "Author": "PBM \"Science Is Art\"", "ReviewID": "R1C5QWGWUNWB76", "Overall": "4.0", "Content": "I purchased the S80 about a month ago (in early June 2006) for a trip to the American Southwest.  I did a fair amount of web-based research and opinion gathering before making the purchase.  I'm submitting this review from Albuquerque, NM, mid-trip.  So far, I'm very pleased with the S80 and would highly recommend it!  The resolution is fantastic!  Colors seem true to life.  2.8 mm wide angle very useful out here, as you might imagine.  Very sturdy with possible exception of USB port cover.  The camera does have some \"weight\" to it, which I prefer since the camera feels more stable when shooting.  I've taken several hundred images so far--most of them are great!  I still haven't mastered all of S80's available bells and whistles, but am looking forward to experimenting with these.  I expect to have this camera a long time.  Given that one can purchase telephoto and wide angle lenses for this camera, the next best thing beyond the S80 would be to upgrade to a digital SLR camera.  Note to potential buyers:  Do yourself a favor and get a 1 or 2 megabyte memory card up front.  You'll probably want to shoot with high resolution so as to exercise the option to crop images later on.  Also, get a second battery.  The battery life for this camera is very satisfactory, but it's always best to have backup.  I find I am switching to the second battery towards the end of each long day of sightseeing and photo taking.", "Date": "July 3, 2006"}, {"Title": "too bad", "Author": "mad hatter", "ReviewID": "R1H2JLRIR57K2H", "Overall": "2.0", "Content": "It's unfortunate that with a name like Canon, you expect a quality camera.  That's why you shell out the money for an item that you think Canon will stand behind.  Unfortunately, this is not the case.I bought this camera to use in graduate school (industrial design).  I needed it to do research for my thesis.  I figured between that, all the product photographs, and the need good portfolio pieces, spending the 500.00 on an 8mp camera would be well worth the investment.  I was wrong.About a month after I bought the camera, it started to malfunction.  The lens got stuck and would not come out.  Neither would it go all the way back in, so the lens cover would not close (not only putting the lens in danger, but draining the battery as well.)  It was still under warranty, so I sent it to the Canon Service Center in Elk Grove Village, Illinois.  It was received, and I was informed that my camera would be returned in 7-10 business days.  That was almost a month and a half ago.I have put my thesis research on hold because I do not have the proper camera for it.  Every time I call the service center, I am told that the \"parts are on back order\".  Evidently they don't know when these shipments are due in their center, so they don't know when I will have my camera back.  The best part is, when I called two weeks ago, they offered me a \"brand new\" S215.  The told me it was a great deal and that I should accept the offer because \"they NEVER do THAT\" (meaning they never offer a new camera for one in repair.)  I pointed out that the S215 was only 5mp, had a smaller screen, and cost nearly 300.00 less than MY camera.  I also reminded her that MY camera was brand new when it broke and I had to send it in.Today I was told that there was no information on my camera, the backordered parts, or when they could send my camera back.  The woman on the phone asked me why I didn't accept the S215 that was offered, and when I explained and asked for a camera the same model as mine, she said they were not authorized to do that.  I told her that I was going to spend the time originally set aside for my thesis research to write letters to both the service center and Canon Corporate Headquarters, and she suddenly had a technician she could consult, and my camera would be back to me by the end of the week.  I won't hold my breath, but a copy of this review will be sent to Canon.", "Date": "October 24, 2006"}, {"Title": "S80 Canon", "Author": "M. Ray Pickens", "ReviewID": "R2GRH2VS2Q4AX1", "Overall": "5.0", "Content": "well designed and easy to use advanced point and shoot camera. I am very happy with the product but I am a long time photo buff. May be a bit much for those just begaining in the hobby or those that just want something to carry in their purse in case they see a rock star.", "Date": "July 8, 2006"}, {"Title": "Excelent Camera.", "Author": "R. Piazza \"technoreid\"", "ReviewID": "R2ILO257X9BBVE", "Overall": "5.0", "Content": "I love this camera. Takes great pitures. Nice LCD. Lots of features which I have not even gotten into yet. Bought the 1GB sandisk ULTRA II card which has plenty of room for tons of photos. Pretty easy for point and shoot. Put in in auto and start clicking away. The little wheel button takes some getting used to. Great camera. Wish they had a really good camera bag for it.", "Date": "March 20, 2006"}, {"Title": "I love this camera!!!", "Author": "Andrea Fanter", "ReviewID": "R2GOIPEOA0QD2R", "Overall": "5.0", "Content": "This camera is everything that I wanted. I am actually a film lover, so digital cameras tend to disappoint me with the quality of there pictures. Usually, you need a REALLY expensive SLR digital camera to take good pics. However, this camera takes great pictures and was not nearly as pricey. The reason I wanted this particular camera is because I previously had the Canon A300. It was an ok camera, but at 3.2 megapixels, the pictures came out bad. However, it was very easy to use. Also, I wanted a camera where I could adjust things manually like I do with my film camera, with the option of auto. The S80 was the answer to my prayers. It is very easy to use, takes great pictures, and is still small enough to carry everywhere, including underwater. I took this camera on its first underwater adventure in Cabo and was surprised by how well it does underwater. It even has a special mode for underwater that adjusts the color balance so your pics don't come out all blue. I could go on forever about all the great things I can do with this camera!!! However, as with any camera, there are drawbacks. The biggest one for me is this spinning wheel that allows you to quickly scroll through pics. I always bump it and scroll too far on accident. Overall, I give it an A+!!!", "Date": "June 29, 2006"}, {"Title": "DISCONTINUED - FOR GOOD REASON", "Author": "Carol J. Dickson \"CJ\"", "ReviewID": "R3KVIC3P194GHT", "Overall": "3.0", "Content": "BEWARE - NOT WORTH THE MONEY SELLERS ARE ASKING.  D O  N O T  B U Y!I purchased this camera for $500 May 2006, one year later it's scrap. It was treated like a newborn baby and was completely scratch/trauma free. Then the lens stuck and the LCD displayed the (apparently common)ERROR... E18. Canon doesn't take responsibility for this on their cameras. (FORGET IT - SOMEONE ALREADY TRIED CLASS ACTION! Search: keyword \"e18 error\" - read all about it).  A seemingly solid investment in a camera to use primarily for work turned out rather expensive.  I'm so annoyed, it took fantastic pictures, although the dials/controls are way too sensitive.  The Canon S80 had a short run... released Aug 2005, DISCONTINUED BY EARLY 2007... no replacement model, no support for the shoddy workmanship. bu-bye money!", "Date": "May 31, 2007"}, {"Title": "BUYER BEWARE.", "Author": "Carol J. Dickson \"CJ\"", "ReviewID": "R3JTAOH0QV946N", "Overall": "3.0", "Content": "NOT WORTH THE MONEY SELLERS ARE ASKING. D O  N O T  B U Y!I purchased this camera for $500 May 2006, one year later it's scrap. It was treated like a newborn baby and was completely scratch/trauma free. Then the lens stuck and the LCD displayed the (apparently common)ERROR... E18. Canon doesn't take responsibility for this on their cameras. (FORGET IT - SOMEONE ALREADY TRIED CLASS ACTION! Search: keyword \"e18 error\" - read all about it). A seemingly solid investment in a camera to use primarily for work turned out rather expensive. I'm so annoyed, it took fantastic pictures, although the dials/controls are way too sensitive. The Canon S80 had a short run... released Aug 2005, DISCONTINUED BY EARLY 2007... no replacement model, no support for the shoddy workmanship. bu-bye money!", "Date": "June 2, 2007"}, {"Title": "So far so good", "Author": "Angela", "ReviewID": "R101AF7M6BCRTO", "Overall": "4.0", "Content": "I purchased this camera about 6 months ago. So far so good. This is my 4th digital camera in about 5 years (I take about 20-200 photos a week). I started with a Canon Digital Elph 2MP. Right before my year warranty was up, the door for the compact flash card broke off and the zoom was sticking at times - but they couldn't duplicate the stick so they just fixed the door. 6 months later the zoom wore out. I did drop it several times, someone bumped into me with a beer and it got a little wet. Besides the sticky zoom, the camera still works but I need more megapixels. Then I bought the 4 MP elph and it lasted 2 1/2 years before the button broke (to switch between viewing photos and taking photos). Then a friend talked me into a Casio because of the longer battery life, big screen and he showed me the great photos he took with his. So I switched from Casio - BIG MISTAKE. I enjoyed the long batter life and big screen but the flash was week and a lot of the photos I took in dark dance clubs were horrid. The Casio lasted 6 months before the zoom got stuck when I bumped it - not covered by the warranty. I switched back to Canon but I wanted something with more control, more manual functions. So the Canon S80 seemed like the best match. It is a little bigger than what I'm use to but the quality of the photos makes up for it. The video is amazing - it's great you can take small videos, easy enough to email - or high quality video - better than any camcorder I've owned.Definetly get a 1 Gig card, especially if you want to use the high quality video. So far the camera is pretty solid - no problems as all and I think the bigger size is easier to hold onto.My only complaint is that the dial to switch between modes moves too easily. If I have the camera on the setting I need for the night, I'll have the camera on, waiting for right moment to take a photo. While I'm holding the camera, I accidently touch the wheel with my thumb and change my setting without knowing it. Then when I go to take the photo, I miss the perfect moment because the setting is wrong. That's my only complaint - if it wasn't for that I'd give this camera 5 stars.", "Date": "August 28, 2006"}, {"Title": "Exceeds expectations!", "Author": "C. Villafana", "ReviewID": "R3K62X7CRJ3CO3", "Overall": "5.0", "Content": "I bought this just before Christmas for my husband and just one day later we are in a position to give the camera rave reviews.1)  the camera is extraordinarily easy to operate - it took the two of us about 5 minutes to cover all its basic functions - a nice thing when it's Christmas morning and one wants to get pictures of the nephews before they start getting too wild!2)  picture quality is amazing.  I transferred the first dozen photos to my Mac's iPhoto application and the resolution, color integrity, balance, and focus were all stunning.3)  transfer takes about 10 seconds with the USB cable included in the kit.4)  we even tried a movie (of my mother demonstrating her hula hoop technique).  Excellent quality and sound.  I  didn't get this for its movie functions, but it's nice to know the capability exists so we can capture those, well, rare moments of mom with a hula hoop.5)  the camera has a great feel - solid, heavy, and substantial in size - these might be cons to some, but since the last camera apparatus I lugged around regularly was a manual Nikon, portable tripod, telephoto lense, and various filters, anything less than 7 pounds is pretty darn small to me.We haven't started playing with all the advanced features this camera offers, but have read about them online and are looking forward to many happy experiments.Happy shooting!", "Date": "December 26, 2005"}, {"Title": "The Canon E18 error", "Author": "rmtexas", "ReviewID": "R3JOJGTX5H79GS", "Overall": "2.0", "Content": "I bought the canon S80 a year back. During the new years party yesterday i got the E18 error. The lens won't retract or extend after this. After researching this error, i am pretty annoyed about it. In nutshell, the camera is as good as trash now. Listen to the other reviewers and at least search for \"canon E18 error\" before you buy any canon camera. On the positive side, this camera took good pictures till it worked.", "Date": "January 1, 2008"}, {"Title": "Takes  very good pictures!", "Author": "P. Breakfield IV \"Tom Steele\"", "ReviewID": "R3E56JKENM9D8B", "Overall": "4.0", "Content": "This camera was almost a five star camera.  Disabling the RAW capability (that was available in the previous model) and some clunky controls and operation keep it at four stars for me.For many of you, RAW makes no difference.  And that is great.  But for those folks who own Digital SLR cameras, and want this camera as a powerful, easy-to-carry utility camera - lack of RAW support cripples this camera.Next, as other reviewers have noted, the side mounted mode-knob is easily jostled and can result in the camera being in a mode that you did not plan for it to be in when you are shooting.  It is EASY to accidentally move this knob.The lens cover and using it as the power button is a poor design as well.Finally, since I seem to be listing the problems first, like most point and shoots the noise level at anything over 50 ISO is very high and makes the camera almost unusable in settings where you would like to set the ISO higher.  Basically, very low light settings are compromised by this inablity to set the ISO at 400 and be confident that the pictures will have a low enough noise level to be usable.On to the good.  As a point and shoot camera, this offers a huge amount of control over the shot.  You can shoot in aperture and shutter priorities and you can - in theory - do almost anything that you could do with a DSLR.  Your biggest limitations are the lens (unchangable) and the sensor (small, high-noise at high ISO).In 90% of the typical point and shoot settings, this camera will outperform your current camera.  It takes beautiful pictures.The wide angle lens gives you the ability to get more in the shot when you need to do so - making it a great \"vacation\" camera.The zoom is decent, but not outstanding.Colors are outstanding, and this is a typical Canon strength.Reading through other reviews here, I also note that several people have complained that the camera did not fare well after being dropped - with a particular emphasis on the large LCD cracking if you drop it.  I'm not sure how to respond to that... I guess that I would just say that I would have expected that to happen.  I tend to treat $500 (when I bought it anyway) cameras carefully.  I purchased an inexpensive camera case which I use always (and find easy to use, since it attaches to my belt) and I use the camera strap when I use the camera.  I haven't dropped the camera yet in the year I have owned it.  If I did, I'd be pleasantly surprised if it survived - not upset with Canon if it didn't.  There are many different types of people with many different expectations in this world, and product reviews are a great place to see these many different attitudes!Overall, a very good - almost great - point and shoot camera.", "Date": "December 26, 2006"}, {"Title": "Great for under water, too", "Author": "J. Jefferson", "ReviewID": "R28L3TF5FUKBWP", "Overall": "5.0", "Content": "Bought the camera early summer 2006.Reasons:-  Wide angle lens.  Not many point and shoots have this.-  It has the CANON Digic II processor.  The same as the high-end CANON SLRs.  Great processing.  Not another company has a better one, not even NIKON.-  Extensive advanced controls.  This has just about every setting you could hope for.  I use all except the built in scene settings.  I prefer to set my own exposures, aperture, shutterspeed, ISO, etc... This would also be good for a newbie.-  Compact.  A lot of capability in a little space.-  Underwater housing available. I bought the underwater housing.  I vacationed in Hawaii and fully tested it scuba diving.  It perfomed flawlessly.  The underwater pictures (I took about 700) turned out great.  I used it as deep as 80 feet, great pix. It is great for snorkling, too.  I recommend buying the weight for the housing.  I have it.  It attaches to the tripod mount on the bottom of the housing.  It gives the rig a neutral buoyancy.The camera is a work horse.I took over 2000 pictures in 14 days in Hawaii.  Since then, I have taken about 6000 pictures with it in Miami, Seattle, Alaska (Juneau, Sitka, Anchorage) to name some highlights.  It does seem a little fragile compared to my film camera, a CANON A-1 that has seen much abuse and much of he world and is still producing great photos.  What I mean is that you have to take care to not beat it about.  I had long ago read about the lense door opening in a pocket, so I am careful not to let that happen.  My experiance with the S80, using the heck out of it, is it hasn't broken, even dropping it a few frightening times.Cons:- No stability assist or anti-shake.  This may cause new photographers some heartache.- The mode selector on the side can easily be turned and cause a screwed up shot (just be aware).- The battery door opens by sliding.  There is no locking device on it that would prevent it from accidentally opening.  I have occationally, accidentally, opened the battery door right after a shot.  I thought it may mess up the writing of the picture from the buffer to the storage card, but it never did.- No RAW mode.  If you need it, don't buy this one.Overall, this is an outstanding camera for the price.  It takes outstanding pictures and has stood up to my extensive use so far.  It is good for advanced photographers that want a point and shoot as well as for beginners.Highly recommend it.", "Date": "June 24, 2007"}, {"Title": "A SUPERB MACHINE", "Author": "Andrew", "ReviewID": "R3MYYMWD89OEIF", "Overall": "5.0", "Content": "This is my third Powershot and they just get better. The video quality is a great improvement and the mute really works. Extraordinary value for money!", "Date": "September 17, 2006"}, {"Title": "The Perfect Point and Shoot", "Author": "RonAnnArbor", "ReviewID": "R1E93VMQWTF7OR", "Overall": "5.0", "Content": "I love this camera - it is the perfect point and shoot - wide angle photography with terrific zoom. The feature set is loaded with hand-changeable settings that you normally see only on digital SLR's - and the features work flawlessly. The ability to use canon's terrific color-setting options is a bonus. I use a dSLR for much of my shooting, but when I want to guarantee beautiful photographs with a camera I can throw into my pocket, this is it. I upgraded from the Canon s50 to this model, and it is just super. One note, there is no RAW mode -- which doesn't bother me as I shoot exclusively JPEG, even with my dSLR, but might disappoint some users. In summary - sharp, crisp, color-saturated photos that will not disappoint - point and shoot simplicity for beginners - great feature set for more discriminating users. Highly highly recommended.April 2007 Addendum: -- After winning virtually every award there was to win last year, Canon discontinued this camera within only a few months of its release -- they have gone to a top-of-the-line compact G7 model and otherwise are encouraging dSLR purchase. Not sure if a S90 will ever be released, as much as people wish for one. My only recommendation at this point is the Canon G7 if you want one of the best image quality point and shoots available. If you come across a stray S80 at a mom-and-pop shop in the US, or a reasonably priced one on eBay, my all means get it...just note that the very few unopened package s80's are currently selling on eBay for about 800.00", "Date": "August 10, 2006"}, {"Title": "THE BEST CAMERA next to a DSLR", "Author": "JoTan", "ReviewID": "R50ZCQ3GWQTIN", "Overall": "5.0", "Content": "i have this camera since January of 2006 and it still amazes me how much Canon s80 can do!!!even my friends who are into photography and have a number of DSLRs are quite amazed on Canon s80's capabilities!this is really the best!!!you will be amazed at how much manual settings this has.I was supposed to buy a dslr but i wanted a camera that can capture videos..so I opted to find the next best thing... CANON S80!!!i never regretted buying this.I am sooo happy because instead of a decrease in market price, i am so surprised to see how much it is now.i remember buying my camera for 300 something, almost 400 USD but now, it seems that it's around 500. wow!", "Date": "August 11, 2007"}, {"Title": "Get a used S80 while you can", "Author": "Jerold D. Kowalsky", "ReviewID": "R16OAMNRUT231Q", "Overall": "5.0", "Content": "I have had a Canon S40 for several years and it always worked flawlessly yielding great pictures.However, I did want to upgrade it to a more modern camera. Unfortunately, the S80 has been discontinued apparently without any replacemnet e.g. S90 in the works. I then purchased a used S80. It is a great camera and is markedly improved over my old S40. The large LCD screen, wider zoom range, smaller size, improved movie mode are major changes.I always keep it in a case when not in use, and like a prior reviewer would be pleasantly surprised if it was not damaged by dropping.", "Date": "February 17, 2007"}, {"Title": "One Amazing Camera", "Author": "Amazon Reviewer", "ReviewID": "R17IMWRH0E2M6J", "Overall": "5.0", "Content": "With all of its features, the Canon Powershot S80, is amazing. I'm surprised its is not huge or at least bigger than its previous version, the Canon Powershot S70. But in Fact is is 8% smaller. And, with its sleek design and low cost everyone should own one. Also, the accessories for this camera are great!!! I especially love the underwater camera case. Yes, the S80 is an underwater camera. Also with 8.0 mega pixels (8 million pixels)and 21 different shooting modes this camera is not to be missed!! Oh yeah, I forgot it takes amazing video. Some more things I love about this camera are the 2.5 inch LCD screen and its easy to use dial.", "Date": "November 29, 2005"}, {"Title": "Fantastic Camera!  Awesome Amazon Service!", "Author": "t_pach \"//tim\"", "ReviewID": "R2C2A3LY6UHA5N", "Overall": "5.0", "Content": "Ordered this camera just a few days before xmas and recieved it a day ahead of time w/ Amazon Prime.The S80 construction is top quality; picture quality is great (note, however, that I'm more of a point-n-shoot, casual photographer); and operation is pretty intuitive.It is a bit \"pricey\" but it was worth the investment for me.", "Date": "December 26, 2005"}, {"Title": "Hig End Digital Users - ONLY", "Author": "Ian Lynch", "ReviewID": "R19OHD7PN7157G", "Overall": "5.0", "Content": "Like other persons I did intensive reviews on all available forums, websites even speking with professional and 80 to 90% recommended the S80. The major cons suggested is the lack of a RAW format,but that is made up by the fact of the superfine JPEG format, my recomendation is to just spend the money and buy at least a 1GB SD card. Some suggested that it is too noisy at ISO400, but thats ok for me because proper camera management you can take excellent pictures at that ISO level.If you are planning on taking it off auto-mode try buying some books that can assist you, but be patient it takes time to master, and play around like hell, that how you would learn to use the camera. I also recommend purchasing a tripod, so if you are not planning on going manual, I recommend the Canon's SD and A series.", "Date": "June 25, 2006"}, {"Title": "Need repair again (second time)", "Author": "A. YEATON \"Tiggylu\"", "ReviewID": "R2DR3FE1SIRA9I", "Overall": "2.0", "Content": "I had a S45 and after loving that camera and quite frankly beating the heck out of it taking photos of two kids and needed a new one.  I am now needing repair for the second time.  After buying the canon camera bag, I managed to drop it after having it for all of three weeks and the lense cracked.  Now 13 months later I can't get the lense cover to close.  Very frustrating.", "Date": "August 23, 2007"}, {"Title": "There are two entries for this item on Amazon - use the other one!", "Author": "P. Breakfield IV \"Tom Steele\"", "ReviewID": "R39DL65W626C2T", "Overall": "5.0", "Content": "Don't know why, but there are two separate entries for this camera on Amazon.  The other one is the \"main\" entry with the most reviews.  Do a search for S80 and you will find both, choose the one with the most reviews.", "Date": "December 26, 2006"}, {"Title": "This is the third one I've bought", "Author": "J. Goldsmit \"jgoldsmit\"", "ReviewID": "R2BO289W46WP17", "Overall": "4.0", "Content": "I've had accidents with my previous ones, not an issue with the manufacturing, but I prefer buying the same model over and over because it's so reliable and the price keeps dropping. I originally paid $500 for a new one in 2006, almost half as much two years ago and abut $100 in 2013. My favorite thing about this camera is how versatile the Manual Mode is.", "Date": "March 21, 2013"}, {"Title": "Its ok", "Author": "A. Wineland", "ReviewID": "RMAIQ0UR2C56V", "Overall": "3.0", "Content": "This camera compromises on a lot to fit it all in. Thus it does not do any one thing super well. But it does do many things.The image quality I would prefer to have a slightly oversaturated color. I almost always have to tweak outdoor pictures.Does not take good indoor(low light) photo's compared to other smaller cameras, flash overfill.Is rather fragile.The lens distortion is huge when trying to capture vertical items.Video is adequate.Probably the best camera out there with all the features and still fits in your pocket. But a lot of compromises.If you want better outdoor and event photos, and don't need to fit in your pocket, definately look else where, something with a bigger lense.For indoor photos or basic outdoor photos, one of the smaller pockets would do.", "Date": "February 25, 2009"}, {"Title": "Great Camera!", "Author": "MC", "ReviewID": "R36FG11Q8FC4M9", "Overall": "5.0", "Content": "I bought this camera in part because it had the widest angle (28) in a still compact camera size.  I only use the automatic functions, not being a true camera buff.  That given, I love it!  It takes great pictures, has lots of functions, and everyone who sees it says Nice camera and Nice pictures!", "Date": "December 21, 2008"}, {"Title": "Another FANTASTIC Canon S Series Camera", "Author": "MikeRadio \"mikeradio\"", "ReviewID": "R15K4W0OHKU7YH", "Overall": "5.0", "Content": "I have used all the Canon S Series cameras since the S20.  I have to say that they really have made some great changes on this S80, and it is definitely worth the investment!Yes, the RAW mode is gone (although the software stillc omes with a RAW tool), however I never used it anyway.  If you do, get the S70.Some of the great things about this camera is that Canon replaced the cumbersome button selector (and the flimsy 5 way selector before that) witha great pressable turn knob.  You can EASILY change modes within modes... and the mode and information is displayed in a large animateed display on the screen!  No more guessing about every symbol or putzing aroung to change modes.  This makes it easy.The picture quality is amazing.  The zoom is silent.. You can even zoom in movie mode (you couldn't on erarlier versions).The movie mode is fantastic also.  A 1 GB card is reccmmended for good large Hi Def movies.They totally remade the camera, in a new box which is MUCH sturdier feeling and more professional.And the display is larger and brighter than ever.  You probably will not need the brightness at more than half.  It is so clear also.. TONS clearer than in the Past.  The camera itself is actually smaller and lighter than the S70..This is a wonderful camera.  With the SD550 out there, I was concerned Canon would do away with the S series, but alas.. the S 80 is here.....I hope you enjoy it as much as me...", "Date": "October 19, 2005"}, {"Title": "Not impressed", "Author": "Tamara Cooper \"Photo Lover\"", "ReviewID": "R2EBJY7L70GRH2", "Overall": "4.0", "Content": "I brought this camera, looking for something I could take out with me to gatherings and social events, without having to lug my Canon DSLR. I got this camera online without first testing it out in the store. Everyone gave rave reviews on it so when I found a good price I brought it. (360 on ebay). I like the camera, but for me, it's too uncomfortable to hold. There's nothing to help grip or hold the camera besides the black grip string that attached to it on the side. I'm a woman, but I felt my hands were too big to hold this square and slippery camera.I took images at all levele from small to large and still noticed a lot of grainy areas and they didn't come out really sharp.Wasn't too impressed with the camera so I resold it on ebay for $390 and will look for something else.", "Date": "April 25, 2006"}, {"Title": "Good, compact but not durable", "Author": "Aditya Pandit \"adi\"", "ReviewID": "R2797YBJ2NE7H5", "Overall": "2.0", "Content": "I have owned this camera for 4 years now.Pros - Beautiful landscapes.  Amazing outdoor shots and colors  Easy to carry. Good response time. Good video too.I have made a few trips, shot photos/videos at a couple of marriages and the comments on my landscape shots have generally been 'which camera do you have? Wooh that's costly for a non-SLR camera but the landscape shots are surely good.'Cons- Indoor shots suck big time, flash power is too weak. I used a extra flash which had multiple levels but the light level indoors would either come too bright or weak and it would be just right only a few times.I had bought it for around 600+ dollars(including the cost of accessories) when it had come out and was impressed by its build quality. It really looks cool and compact. But it turns out the prices of compactness is paid in the life of the camera. Since the lens retracts back and out it has a good chance of getting damaged. It looks like some sensors(battery/door/lens sensors) have got damaged.That moving part stopped working a few weeks back. It does not start up and the repair cost will be at least half the cost of a good new camera. I have film cameras bought buy my dad's uncle at a yard sale in the 1950s that still work fine. I was expecting this camera to last me for at least 10 years. I am very disappointed that it has become unusable in 4 years.I would have loved to give this camera at least 4 stars but wanted to give it only 1 for not being durable. Finally I am giving it 2 for at least good 4 years of service. They don't make them like they used to anymore. Will be trying a Nikon next.", "Date": "August 28, 2009"}, {"Title": "great start, bad ending", "Author": "J.", "ReviewID": "RF4HTSYNVJ1H3", "Overall": "3.0", "Content": "I bought this ~18 months ago to replace an earlier Powershot which was stolen.Pros:- lots of features- small enough to fit in your pocket- decent zoom- decent videoCons:- bad low-light performance- too slow for action shots (sports, etc.)- e18 / lens error- frequently gives image stabilization warnings, especially in low lightI'm currently in the market for a new camera - my lens just decided to jam itself open for no apparent reason.  Reading reviews for Canon Powershot cameras apparently this is endemic to the entire product line.  Called Canon and their flat rate service fee is $139 for a camera I could buy refurbished on ebay for $200 so not exactly a bargain.  They did offer a \"loyalty\" program which looks like they give you about a 50% discount off a refurbished SD850, G9 or Rebel XT if you trade in your old S80.Now I'm trying to decide if I should go for the refurbished SD850 and risk another lens error, or switch to Nikon.Just wanted to post this review to warn people yet again about problems with the lens in Canon Powershot cameras.", "Date": "October 16, 2008"}, {"Title": "BREAKS EASILY --  NO SERVICE TOTAL RIP OFF", "Author": "Jeffrey Schaefer", "ReviewID": "R25BQBEVKDUF01", "Overall": "1.0", "Content": "this camera BROKE after 4 months of light use, I used it for business and kept in my brief case.I was visiting a store I have in Wisconsin and the lens no longer functioned.  No big deal send it in for service.  I send it in 10 days later I get an acknowledgemnt saying It will be returned FIXED in seven days.  14 days later (with no communication)  I call and ask what the hey?  They inform me that they are not going to fix it due to water damage!  I explain that the camera has been no where near water.  They say it could be HUMIDITY!  What !!!!!!  I was speachless.  I said I live in Florida and only use it for business in fact it stays in me briefcase!  All I do is take pictures of retail displays and stores.  Perhaps it should not be marketed in Florida or Georgia or frankly anywhere! if humidity is an issue.I'm Pissed!!! Camera performed well until it broke.  I assure you It was not dropped or any  where near water except for Humidity!!!!  That I am guilty of, living in Florida.A completly BAD Experience with their quality and service.", "Date": "July 21, 2006"}, {"Title": "Discontinued!", "Author": "John Boland \"John  Boland\"", "ReviewID": "R2K07DJPMB2ZFW", "Overall": "1.0", "Content": "This S80 used to be the only WIDE ANGLE compact point and shoot digital camera on the market. It has now been discontinued I'm told. But, we're in luck! There are THREE other digital point and shoot cameras with a real 28mm WIDE ANGLE lens! These are: 1) The Panasonic DMC-FX01 for $250, and the 2) Canon Powershot SD800 IS for $400. and, 3) The Kodak EasyShare V570 for about $350.So, you ask, \"who needs a 28mm lens?\" You do! Most people concern themselves with how LONG is their telephoto lens. But, most people who \"know\" know that it is the WIDE ANGLE lens that is most important---most of the \"best shots\" are made with a WIDE ANGLE lens. For example, you're in Europe and you are trying to \"get a shot\" of that Cathedral of Notre Dame over there. You NEED a WIDE ANGLE lens. You are in the California Poppy Fields and you want to get the expanse of the golden-yellow poppy flowers with the huge blue sky filled with white clouds above---you need a WIDE ANGLE lens. You are sitting at thanksgiving dinner and you want to take a photo from the foot of the table with everyone sitting on the left and right---you NEED a WIDE ANGLE lens. You are in the garden of the California Mission and you want to take a photo of the ENTIRE garden surrounded by the mission walls---you NEED a WIDE ANGLE lens. It's Christmas day and you want a photo of the ENTIRE GROUP of visitors in front of the Christmas Tree---you NEED a WIDE ANGLE lens. This is where the 28mm lens on THIS camera comes in! So, you NEED THIS CAMERA! Otherwise you'll be cutting off heads and leaving Aunt Sylvia out of the \"Christmas Group Photo\" this year---and she'll disinherit you and as a result of not having a wide angle lens you'll live a life of poverty and misery everafter! :o) If you agree or disagree or know of ANY other digital point and shoot camera that has a WIDE ANGLE lens please write, Email:boland7214@aol.Here's one more wide angle candidate: Kodak EasyShare V705 7.1MP Digital Camera with 5x Ultra-Wide-Angle Dual-Lens Optical Zoom", "Date": "September 29, 2006"}, {"Title": "Great pictures.... Costly repair prices!!!", "Author": "J. Burkgren \"Jen\"", "ReviewID": "RAD7SOVW57AY3", "Overall": "3.0", "Content": "I actually loved my S80.  The pictures I took of my children were beautiful and the camera is very easy to use.  It operates extremely well in low light situations, is easy to take anywhere, and easy to download pics to computer.I am heartbroken that after only 3 years of ownership, it is broken beyond repair. I did initially have problems with the lens cover not closing as other reviewers did, but usually if I took the battery out and charged it and then returned it the cover would close.  Recently I accidentally leaned on it in my backpack.  It was in a protective camera case, but the pressure of my back against my backpack broke the display screen.  I took it to a repair shop and was told that to repair it would cost about $20 less than buying a new camera on Amazon.  I am very dissapointed that it seems that these cameras are so throw away. Why can't canon control parts costs so that repairs can be made and cameras salvaged.  Anyways, I am going to add to the landfill situation and toss my camera and buy a new one.  I want a canon, but with the parts situation and lack of repair facilities I may have to look at another brand.  Too bad.", "Date": "April 25, 2009"}, {"Title": "Great camera - but fragile", "Author": "Morgan Akens \"Morgan\"", "ReviewID": "R32XAE79JXDGY0", "Overall": "3.0", "Content": "I loved this camera. I really did. It took beautiful pictures and its the closest compact camera I've ever had to a DSLR. But drop it once - and say goodbye. I've had lots of cameras over the years (mostly sonys) and they can usually take a few bumps and bruises. I dropped this thing one time - and not even on a particularly hard surface, and no more camera.", "Date": "November 29, 2008"}, {"Title": "Jameson Thottam shifting sides back to Canon", "Author": "Jameson Thottam \"Jameson Thottam\"", "ReviewID": "RPG4EAAOB63BX", "Overall": "5.0", "Content": "Jameson Thottam shifting sides back to CanonI have to admit I am not the biggest fan of Canon. I received a Canon Powershot S20 for a gift and bad is an understatement.So I was reluctant to try the Canon Powershot S80. It has a hefty price tag of $500-600. So it needs to provide some bang for its buck.Superficial Inspection __ Jameson Thottam __At first glance the Canon S80 is bulky and heftier than most point and shot cameras. You will not be sliding this camera discretely into a shirt pocket. It is definitely needs a camera bag, or a purse to carry this.The camera is a little slow. Meaning if you are trying to take a picture of your 3 year old, you will probably miss the shot or get them turning away. Even though it has different shutter speeds you tend to miss most of those perfect moments.Still the same old problems __ Jameson Thottam __Also I have yet to test a camera with excellent red eye. This camera is no exception. In order to avoid red eye, Canon recommends having your subjects look straight into the flash. That is all good, but when I am trying to take a picture of my 3-year-old twins, looking into the flash is not an option. So most of my pictures appear to have those devil eyes.Enough said__ Jameson Thottam __With all that said, when you do get the shot the picture quality is fabulous. True colors bright and bold. (Something Canon has seriously improved on since the S20.) I cannot express enough how great the pictures look.For a point and shoot camera it is fairly easy to operate as well. Once you get the battery charged you are good to go for quite awhile.Battery life __ Jameson Thottam __Which brings me to another plus, the camera had a fabulous battery life. I was able to use this camera for several days, medium to heavy use, without recharging the battery.Summation__ Jameson Thottam __If you have the money to spend on a point and shoot then this is the camera for you. You cannot beat the picture quality. If you are looking for a cheaper camera with a decent picture you will probably want the Canon SD450.Jameson Thottam", "Date": "January 9, 2006"}, {"Title": "As Good as the Canon 550", "Author": "D. Fernandez \"FL, USA\"", "ReviewID": "RCJRRCBFWKK72", "Overall": "4.0", "Content": "I have had a good experience with Canon -for me they outperforme similar Sonys and Nikons-  I received this the S80 as a X-Mass present last Dec'05.  The features of the Camera are good but mostly the same as the Canon Model 550 which is cheaper and that we also have.  The only cons of the S80 is the size and weight, it's bigger and more expensive than the 550. The S80 is more techy but if you are not a pro like me, the 8 Mega Pixels are not worsted if you are not going to do major crops or large-prints.  You could save some money by going with the Canon 550 which I also consider faster than the S80.", "Date": "August 7, 2006"}, {"Title": "Outstanding picture sharpness and ease of use.", "Author": "megapixel", "ReviewID": "R2CSGGQBAFBHIW", "Overall": "5.0", "Content": "The Canon PowerShot S80 is an outstanding camera that fits in a shirt pocket.  A take anywhere camera with photographic results that rival a digital SLR.  The 28mm to 90mm zoom handles most situations and the 8 megapixel resolution is outstanding.  The large (2\")LCD is a pleasure to use.  There are really no negatives with the S80.  The key to photography is to have thecamera with you and the compact design of this serious camera let you take it anywhere.", "Date": "November 24, 2005"}, {"Title": "good camera", "Author": "Shakti Shukla \"Food, drink, dogs and friends ...", "ReviewID": "RMQRS2BE4UY0S", "Overall": "4.0", "Content": "easy to learn to use, great pics, good looking camera. recommended to me by three \"photo\" friends. go for it.", "Date": "July 14, 2006"}, {"Title": "Great camera at crappy price", "Author": "Nina \"Nina\"", "ReviewID": "R1BG9BX7Q7WCXN", "Overall": "5.0", "Content": "Why is this going for $899???? It's listed at $400 at Walmart online.", "Date": "August 14, 2006"}, {"Title": "Dings void the warranty (jammed lense)", "Author": "C. Labbe", "ReviewID": "R3JQ7WVFFVECO3", "Overall": "4.0", "Content": "Another lense jam problem. The lense cover accidentally slide open in my pocket, and the lense extended and jammed. This happened frequently with my old Powershot S30 but never caused a problem.Canon said the warranty is void because there's a tiny dent on the front and back. They said ANY physical damage voids the warranty. I complained that the camera has an all metal body which dings easily. They gave me 20% off the repair.", "Date": "December 8, 2006"}, {"Title": "S80 Discontinued....Now look at the much better Canon PowerShot G7", "Author": "Lawrence A Team \"A team member\"", "ReviewID": "R3JD1KD3A8J8U7", "Overall": "3.0", "Content": "As a suggestion...take a look at the newly released Canon G7. More features, faster operation, better optic lattitude and sells for about $520.", "Date": "November 12, 2006"}, {"Title": "Best of S line", "Author": "K. Buranawuti", "ReviewID": "R1SUHK7TWJYHEP", "Overall": "5.0", "Content": "I'm so happy to get it. Just have time to go over all the manual and then everythig is so easy. I agree with all pros above. I don't see any cons for noisy shutter or zooming power. It's perfect for point and shoot people. You can adjust volumn or change style of camara sound as u wish. Modes of shooting are enouhg for all scenearios. The vedio mode is so easy and just hook to TV and have fun to see it with clear sound and sharp photo. Yu need at least 256 MB SD to be happy with pictures and short videoss. Loading to window XP is so fast, just hook it and do as software tell u. The price is so cost-effective with all these great features. (454$) Better buy it before it is up!", "Date": "November 26, 2005"}, {"Title": "Not worth the price", "Author": "Bob Lund", "ReviewID": "R2AFU56KOI4GTD", "Overall": "2.0", "Content": "I bought this camera based on glowing reviews by other owners.  I don't agree.  This camera is cute.  It has a really nice screen and controls.  The fact that it has a wide-angle lens was a big plus for me as a realtor.  However, the picture quality stinks.  I have to spend forever with Photoshop to try to get the photos to be acceptable.  In the end, my little cheap Minolta Dimage X that I've had for years, takes MUCH better pictures.  Sadly, I found out too late.", "Date": "April 16, 2006"}, {"Title": "Old and in the way", "Author": "Amazon Customer \"dreamstwice\"", "ReviewID": "R2A5E5FBH4T3WR", "Overall": "1.0", "Content": "Why clog up the site with obsolete equipment from years ago? This might have been a good buy in its day, but it's way past it prime now. Unlike classic film cameras, there's little point in old digital stuff.", "Date": "August 4, 2011"}, {"Title": "One Question For Other Reviewers", "Author": "C. Barker \"Saddle Bear\"", "ReviewID": "RN5N9HQ3CUX15", "Overall": "5.0", "Content": "I really love this camera however I have one question for other reviewers:  The terminal cover seems to be made out of hard plastic; however the integrated hinge seems forced to \"flex\" when I open the cover.  I'm concerned the hinge will break.  Perhaps the hinge is made out of a different material that is made to flex?  Has anyone else experienced this?This is not a negative review at all, just a question.  I am 110% satisfied with this camera.", "Date": "December 24, 2005"}, {"Title": "Digital zoom in video mode - any experience?", "Author": "Karel Exner \"F. Houska\"", "ReviewID": "R1Q4UXRMMW9SRL", "Overall": "5.0", "Content": "Hi lucky owners. I am about to purchase Canon S80 but I need to know one (for me) key paremeter: How are you satisfied with digital zoom in video mode? This is the feature for I want to buy this camera but in Steve's preview is writen:\"One note of caution; the S80 has separate menu options for digital zoom in still and movie recording modes; be sure to disable digital zoom in movie mode to avoid degrading moving image quality.\"Is it realy so bad? Can anyone send me some zoomed video. Thx.fhouska@volny.cz", "Date": "November 29, 2005"}, {"Title": "I never received the camera!", "Author": "Mindy M. Schifberg", "ReviewID": "R1CCXZO9921NWP", "Overall": "1.0", "Content": "I would love to review the S80 Canon Powershot digital camera but I never received it!", "Date": "July 29, 2006"}, {"Title": "Dead on arrival", "Author": "P. Larson", "ReviewID": "R2FOH0JHKKDL9B", "Overall": "1.0", "Content": "After seeing the fabulous reviews here on Amazon, I ordered this camera. It arrived with an \"E18\" error. Never even got to take a single shot! Caveat Emptor.", "Date": "February 17, 2006"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B000AYGD8E"}}