{"Reviews": [{"Title": "Great little camera for outdoor enthusiasts", "Author": "Jason Turgeon", "ReviewID": "RFO9FW2WXGJPY", "Overall": "5.0", "Content": "I picked this camera up about a month ago at samys.com (much better price than Amazon) and took it on a week-long trip to the Bahamas.  Since I forgot to bring a decent memory card, I was limited to a 256 mb card that I had in the camera, so I took all of my pix at 4mp under the medium quality setting.  I found the image quality to be perfectly acceptable and got about 300 pictures and a few very short videos on the card.Many other people have left great reviews of the camera, so I'll concentrate on the waterproof aspects.  I had the camera in the water for an hour or more on each snorkel, typically twice a day, and never had any problems with water getting inside.  This is about twice the recommended length of 30 minutes in the water.  I don't dive, so never had the camera below 5 feet.  I attached a floating key ring (available at any marine store for a couple of dollars) to the strap so that I wouldn't have to worry about letting the camera go and having it sink to the bottom.  The camera is light enough that the key ring would actually keep it at the surface--I'd expected that it would simply slow it down on the trip to the bottom.  This was a nice bonus, since I could just leave the camera floating while I dove to the bottom to get shells.  I'd recommend a closed-cell foam float instead of the hollow plastic kind, as the plastic will eventually fill up with water and lose buoyancy.In the water, I found the camera quite easy to use, although the buttons could have been a little bigger.  The camera seemed to struggle to focus in areas where I was shooting fish from a distance or fish that blended in with the water (like a barracuda), but the pictures came out pretty well at the end.  Snorkelers will note that it takes some practice to get a picture of a fish as the camera moves around with the smallest waves and there is just enough shutter delay to make things difficult.  I found that by prefocusing (press shutter halfway and hold, with a green box indicating the focused area) and then waiting for the right moment, I got much better results.  I couldn't tell a difference in photo quality between the camera's underwater setting and the normal setting.  I used the macro setting for some close ups on land and was quite impressed with that.If you'd like to see some underwater pictures for yourself, here is a link: [...]  Remember that I used the 4 Mpixel setting and 2 star quality setting to save space.I rinsed the camera off at the end of each day but did not soak it as recommended and I haven't had any trouble or seen any signs of salt in the battery compartment.  Speaking of the battery, I was a little disappointed here.  I didn't like that I had to bring a bulky battery charger on my vacation--would much prefer that the camera ran on AAA batteries.  I found battery life to be so-so.  I could go about one full day, taking lots of pictures, then editing out all the bad ones, shooting videos, and keeping the camera on for hours at a time.  But if I didn't charge it that night, it would quickly die on the second day.  The battery level indicator is useless--it goes from full to half to dead in a matter of minutes, so keep the battery charged and if you're going to use it a lot, buy a spare.  One other note about the battery--since you have to charge it every night (out of the camera), you can't use the camera's alarm clock feature.  This was an issue for me, since I don't wear a watch, wasn't able to use my cell phone in the Bahamas, and had planned on using the alarm.  The alarm isn't really loud enough to wake a heavy sleeper, by the way.All in all, this camera does what it sets out to excellently.  This is a camera for active people who want to take good quality snapshots while snorkeling, playing in the rain, kayaking, etc.  It's not a camera for professional photographers or divers, but it doesn't claim to be.", "Date": "March 24, 2006"}, {"Title": "great for outdoor adventures but not critical imaging", "Author": "W. S. Chen \"messenger33\"", "ReviewID": "RIHJSRY2SAV7Y", "Overall": "4.0", "Content": "I've been waiting for a solid weatherproof/waterproof digital camera for quite some time now and finally decided the resolution might be good enough. I'd been sticking with my trusty Yashica T4 Super (non-zoom) which I've shot quite a bit in thunderstorms and other precipitation-heavy conditions and I didn't want to give up that ability just to go digital.To be upfront with it, the image quality is not the best. It's 6 megapixels, but there's a lot more to quality than having the most pixels. From a pure image quality standpoint, I'd rather have one of Canon's many offerings. Compared side-by-side with a Canon S550 (granted a more expensive camera with more pixels), the Pentax showed noise where the Canon showed weave pattern in a subject's sweater. Also, I'm used to shooting pro-level dSLRs so the difference in image quality was a bit of a surprise. Compared to the T4 film option I'm used to, I think I'm still bringing my film camera for those more difficult situations because there's just more info on the film and the lens is still better on that camera. Also, it lacks an AF-assist light which would really help in dim situations.However, and this is important, I realize that most of the images I take with this camera are only going to be viewed online or will not be printed larger than 4x6. I have not yet printed images from this camera, but I think for that print size it will probably be fine. For web purposes, it's more than good. The many options in image size is very handy when you know you're going to web with an image. The sunset shots I took out the airplane window, while noisy, still have good gradation from black to white.Getting back to the reason I bought this camera in the first place, I'm very pleased with its ability to function in wet conditions. I haven't taken it underwater yet, but I did shoot video with it while snowboarding and found out my skills definitely go down while trying to shoot video. But the camera kept going after being dunked in snow repeatedly. It was also snowing/raining so there was more than dry powder to deal with. The buttons, while small, are spaced far enough apart that I could activate them with gloves on. The screen was plenty big and  legible from oblique angles while heading downhill with goggles on. Be aware, however, that the battery is physically not very big and therefore low temps have a noticable affect on battery life.One of the best features is the green button- it can be changed to access up to four different options/settings. I use mine for 1.exposure compensation; 2. white balance; 3. ISO setting; and 4. green (dummy) mode. So easy to set up and very useful if you still want some manual overrides (since there's no actual manual or priority modes, just different program modes). Without the green button, using the exposure compensation requires going into the menus and changing it but not seeing results until it's set- with the green button, it operates like every other camera, ie allowing you to see the changes as you make them.Basically, foul weather functionality was the priority and I was pleasantly surprised by the easy and customizable interface (you can change the order of the program modes and the camera remembers certain custom settings, too). I was not impressed with the image quality and it's not replacing my film p+s or dSLRs anytime soon, but it's good for what I need it to do which is largely surviving being on the outside of my backpack or in my pocket in the rain, snow and dirt and still be ready to take a decent image when I turn it on.", "Date": "December 27, 2005"}, {"Title": "Absolutely Incredible", "Author": "Eric Henninger", "ReviewID": "RDQDCTK1PZGPY", "Overall": "5.0", "Content": "This is one of the best purchases I've ever made.  I absolutely love this camera.  It is nice and small, super easy to use, and waterproof!  Unlike other reviews that I've read here, I have taken it underwater.  My whole life is water, so in only a few days of owning it it's been under plenty of times.  It holds up like a champ!I also really like the features it has.  It has a good zoom, lots of programmed settings, movie mode, high speed shutter, and the green button which allows you to be using one mode and hit one button to be in another pre-set mode.  I think that the quality and features are comparable with a lot of cameras that cost as much or more, and it's waterproof.", "Date": "December 30, 2005"}, {"Title": "Perfect for the Caribbean vacation", "Author": "Someone", "ReviewID": "R3HEKOCW1SGN", "Overall": "5.0", "Content": "Beginning with images shot through the window of the puddle jumper aircraft while flying, and extending to the underwater shots of fish and a sea turtle that I've placed in the gallery, I've been impressed with the Pentax OptioWPi.  The underwater capability is GREAT for casual snorkelers like myself. (I snorkel once or twice a year on trips and have no desire to mess with a larger camera in a waterproof case.)  Care was easy - mine lives in a sunglasses case.  I rinsed with bottled water after each dip in the sea, and soaked the 10 minutes suggested by the instruction manual when I charged the battery.  I took about 400 images on a week long trip and did a lot of editing and reviewing, and the battery needed to be charged twice.  A second battery to rotate would be nice, but is not entirely necessary.Yes, the viewfinder can be difficult to see especially when you're sitting in direct sun.  I found that I could pull my hat down on my forehead, and then shade the viewfinder with another hat for best results.  And finally, the ACDSee software that comes with the camera is terrific at enhancing images; better, in fact, in a side by side test than the photo kiosk at a local chain pharmacy.  A sliding locking mechanism on the wrist strap would also be nice, since the camera doesn't float.  If you're paranoid, you can probably rig something up with duct tape before snorkeling.If you don't need the waterproof feature, you can probably find a better deal in a different camera.  But if you fish, snorkel, beach bum, boat, etc. you'll appreciate this camera.", "Date": "March 14, 2006"}, {"Title": "Great Camera", "Author": "Jesse Wilks \"noumenon\"", "ReviewID": "RBXS4YX6ZSBFH", "Overall": "5.0", "Content": "I get great pictures with this camera and am wondering if reviewers below have failed to set their cameras to the highest picture quality setting. The camera does not come from the factory set at highest quality probably so you can take more pictures without SD card. I do agree about having problems seeing screen when very sunny out and have order folding screen shade to solve this problem. Another reviewer complained about low light level picture results well I have to say you should have read your instruction manual because it has a low light setting that works great with the aid of a tripod.  Besides I have yet to own a pocket digital that rivals all the features and picture quality of this camera and can take the abuse of water and sand. If you like outdoor activities that may reek havok on a normal pocket shooter that this camera is for you. I do hope that PENTAX adds a viewfinder window to their next version though.", "Date": "March 9, 2006"}, {"Title": "A  Disappointing Camera", "Author": "J. Spiegel", "ReviewID": "RH6OCE79ZSUAO", "Overall": "3.0", "Content": "Read the specs and this seems like the perfect camera for any outdoor sports enthusiast. Unfortunately, this is not the case.The biggest problem is that the LCD is useless in many outdoor situations. Since there is no optical viewfinder, this is a huge problem. Skiing in bright light - forget it. Skiing in flat light - forget that too. Whitewater - also guess and shoot. Trying to shoot mountain biking friends in the woods - good luck. I can't count the number of shots I lost this year because I had to guess where to shoot since the LCD was no use at all. And the shutter lag that seemed to crop up \"in the field\" did not help. Many, many frames with half a person or no person visible. At least I was not paying for film!Image quality is disappointing for a 6 megapixel camera. Color and resolution are fine under ideal conditions, but get outdoors in a less then perfect situation and things fall apart. Shots get blurry and color is poor. Using the digital zoom just multiplies your problems.The only reason I rated the camera as highly as I did is that it is compact and waterproof. You really can just shove it in a ski jacket pocket or life jacket pouch and not worry about it. Just grab it and shoot. No worries about water, cold, etc. There is some real value to this. Just don't be surprised when your pictures look like they were taken with a \"point and shoot\" style camera.If you can live without a waterproof camera, and want want good photgraphic results, look at other cameras.", "Date": "July 12, 2006"}, {"Title": "Good Construction, Good Function, Good Pictures", "Author": "Rob M \"Rob\"", "ReviewID": "R2J5HVKZ62PTPG", "Overall": "5.0", "Content": "I've had this camera for about 5 months now and it works great.  Can be a true point-and-shoot camera if you want it to be with simple functions, but has a host of other functions with a bit more menu navigation.  Short power up time (about 2 sec) but lags a bit on picture capture (again about 2 sec from button press). The 2\" LCD screen is clear with sufficient brightness.  Movie quality is fair as is movie sound (for a camera anyway).  Have taken it snorkelling to 7 ft breifly as well as 1-3 ft for 20 minutes in salt water as well as having beer repeatedly spilled on it and so far is cleaning up well.  I never purposely test the durability of any $200+ item, but so far it is holding up well to normal use, including underwater as above.  Many of the pictures turned out as good or better than those taken on film, and pictures thought lost to poor white balance or that were too dark were all cleaned up nicely with a digital photo editor to produce very nice 4x6s.  Haven't tried larger but with that size (shot in best quality quality at 6 megapixels) I can't detect the slightest hint that it was from a digital like I could my 3.1 megapixel.  Will hold 41 pictures per 128MB at that quality.  Drop down to highest compression at 3 megapixels and get 223 per 128MB.  Has its own rechargable battery, lasts about 30 minutes.  I bought another one, not wanting to get stuck without power, but it powers up and down so well, I rarely run it down.Don't bother with the silicon sleeve for extra-protection.  I think it was in theory a good accessory, especially for people like me who will likely take it into some rough places, fishing, rafting, snorkelling, etc,  but I have missed quite a few good shots when the cover didn't match up with the buttons or left one depressed and I was left trying to figure out why the zoom isn;t working or the shutter won't depress.TAKE NOTE PENTAX--- I would much rather see a waterproof case that would allow you to take to deeper depth.  I would feel much safer with a water proof camera in a water proof case as reviews for other water proof cases suggested leaking ruined their $400 non-waterproof camera.  I couldn't see a little leak as an issue with this camera and Pentax wouldn't be bad-mouthed like Cannon is for ruining hundred dollar cameras when they produce finecky waterproof housing.", "Date": "May 14, 2006"}, {"Title": "This is a great camera!", "Author": "Boomer", "ReviewID": "R2T9H6X74ZZ4ZG", "Overall": "5.0", "Content": "I bought this camera to take on vacation in Costa Rica.  I was going to be white water rafting and sea kayaking and wanted to be able to take pictures.  This camera worked great!  I used it in the dry parts of the trip also.  It's small and easy to use.  I would highly recommend this camera for any active traveler.", "Date": "March 10, 2006"}, {"Title": "A Great Waterproof Camera Difficult to Use by Water", "Author": "M. Varon \"marty\"", "ReviewID": "RH2PGDUX75OLB", "Overall": "3.0", "Content": "So far the WPi has taken great photos, even under water, starting with coffee mugs in my kitchen sink and with the last underwater photo taken off Union Island in the Caribean.  It works. It takes wonderfully well-saturated photos.  I don't have to worry about it getting wet.  So far it deserves 5 stars.Now for the minus two stars.  It doesn't have an eyepiece viewfinder and the viewing screen is nearly impossible to see in bright sunlight... you know, like the light near water.  Taking photos in bright light is pure guesswork.Maybe I shouldn't be giving the camera such low marks.  The low marks should go to anyone who tells you that the screen is bright enough to be viewable outdoors in bright sunlight.  It just ain't so.The trend that so many point-and-shoot are following of not including an eyepiece viewfinder on a camera is just dumb.If you don't need the waterproof feature of the camera, I would look at Canons, or Casio, because they still include eyepiece viewfinders.  If you have your heart set on a waterproof camera (good for only 5 feet for 30 minutes, mind you), then I recommend the Pentax WPi.  It takes very nice photos, even out of the water, and sometimes you can even see what you're taking pictures of, when it isn't too bright out.I'm considering purchasing one of the Delkin folding screen shades to see if that helps.  My concern there is that it won't be so water/weather proof and will rust.  Wish me luck.Update:  I did purchase the screen shade, but it didn't help much.  I still hate taking pictures with it outside on a sunlit day, but I love it as a small camera I can use indoors or \"darker\" days.  It is small and fits comfortably in a pocket.  I still wish the camera companies would discontinue the trend of leaving off the eyepiece viewer.", "Date": "February 26, 2006"}, {"Title": "WPi 6MP Pentax Camera", "Author": "David G. Christensen", "ReviewID": "R2JWD1H3EXV18D", "Overall": "4.0", "Content": "A great little camera.  6x gives it pretty good resolution for a small camera.  The battery life is good and additional batteries are not expensive.  The one thing lacking is an optical viewfinder.  The LCD screen is very hard to use in bright light.", "Date": "June 1, 2006"}, {"Title": "Excellent camera", "Author": "Chet", "ReviewID": "R27N6F6CU46UDF", "Overall": "5.0", "Content": "I have had this style camera since 2005. I bought it for a trip around south America in '06 and I still use it for all of my travels and road trips to this day. I have used it snorkeling in HA,US/BR Virg islands,FL and all over S/A including the Gal. islands and San Blass islands of Panama. It still works excellent. It is extreamly easy to use and the feature of being able to take stills from a movie and crop pictures as your snorkeling is great. This is one product I wll always stand behind. WWCD:)", "Date": "February 14, 2012"}, {"Title": "Since Dec 2005", "Author": "Jared A. Mcvay \"j-rock\"", "ReviewID": "R3C9Q54FVSM6FY", "Overall": "5.0", "Content": "I have had the WPi since December 2005, and it hasn't quit yet.  It has been through anything you could imagine, and much that you can't.  I have used this camera underwater with fantastic results, I have used it on numerous outings, I have used it on numerous Airborne jumps during my time at Fort Bragg and everywhere in between.  No matter what the situation, you can just rinse it off and keep on going.  I have never known anyone to have a camera this long and have it still be in great working condition.While on a dismounted patrol in Iraq, I was blown through the air by an IED.  The camera still works great.  I cracked the outer screen when I fell on it, but it all still works and takes great pictures.  I am sure that I will be using it for years to come.If you need a good solid, reliable and small camera.  Find this one, somewhere...  You won't be sorry!", "Date": "September 1, 2009"}, {"Title": "4 years and still working well", "Author": "William J", "ReviewID": "R2BWVGP7DM1KBI", "Overall": "5.0", "Content": "Purchased this little camera over 4 years ago from Amazon.  I've taken tons of pictures with it, both indoors and outdoors in all sorts of climates and conditions.  It has performed well enough for me! I'd recommend the Optio waterproof line to anyone looking for a durable all purpose point and shoot digital camera.", "Date": "January 26, 2009"}, {"Title": "Great little camera at a great price", "Author": "Steve K NY", "ReviewID": "R1X9C182CGDGPW", "Overall": "5.0", "Content": "I bought the Pentax Optio WPi 6MP specifically for shooting while kayaking and boating - and I was willing to accept any shortcomings for the piece of mind of knowing that a little water wouldn't hurt it.  So far, however, I've found no shortcomings!  The controls and menus are easy and logical to use - I was able to set up and use the camera without referring to the extensive manual that comes with it.  Shooting, focus, and flash mode selection is intuitive and simple, and I've found the color and clarity quality of the photos I've taken to be good, though a little grainy in low light.  It's definitely a snapshot camera, and will not replace my Canon S2 IS for \"real\" photography, but it's great on the water (Check out this shot on the Hudson River: [...] . I paid $200 (from Pavilion Electronics - unbelievably quick customer service response and delivered 3 days before earliest estimated delivery date) and couldn't be more pleased with the camera.", "Date": "July 24, 2007"}, {"Title": "Nice Camera", "Author": "Duchess Sophia", "ReviewID": "R1JTGRONWO76O0", "Overall": "4.0", "Content": "This is a nice camera. It functions as it is advertised. I just wish it had a view finder. Even with the LCD brightness all the was up, I find it hard to use in bright sunlight.", "Date": "September 3, 2006"}, {"Title": "Care free photography on/in the water", "Author": "john gerhard", "ReviewID": "R1PHQLBJNHWRTI", "Overall": "5.0", "Content": "I spend a lot of time canoeing and kayaking and enjoy taking photos. Now I don't have to carry my camera in a waterproof box and risk missing \"at the moment\" photo opportunities.Further the user friendly characteristics and quality photos of this camera are a great bonus.", "Date": "August 26, 2006"}, {"Title": "A Great All Around Outdoor and Sport Camera", "Author": "CT Yankee \"In Emperor Norton's Court\"", "ReviewID": "R34HTK1Q9SB1IW", "Overall": "4.0", "Content": "I agree with a lot of what has already been said about this camera.  The waterproof feature is very cool.  My six year old nephew loved the picture of his legs underwater and it is nice not to worry in wet weather.Most of the time the pictures are really good indoors and out.  The mode settings are very intuitive but not always the right choice.  I find candlelight often works best indoors both at night and in daylight.Again this is an easy to use durable little camera.  I do recommend an extra battery or that you charge it completely.  The battery doesn't last as long as the one on my Casio for example.", "Date": "April 28, 2006"}, {"Title": "SIZE Matters!!  ... with digital cameras that is.", "Author": "R. A Gibson", "ReviewID": "R2VIBRV56SIH01", "Overall": "3.0", "Content": "I own this little guy's older brother, pentax's first Waterproof Optio.  And while I love that I can take in the lake or pool, the reality is that it will only take average pictures (I've seen some of your frustrations on this site).  Why?  Because size matters!  Sensor Size that is.  The optios use a very small sensor ([1/2.5]).  Consequently, this camera can only record so much info when the shutter opens.  The larger the sensor size, the better image capture you will get (the digital SLRs sensors are 2 to 3 times larger than the point and shoots).  So, bottom line, if you are looking for a general point and shoot, this is not what you want (and yes to the yahoo who posted about shooting at the highest image quality... I do on every camera I own, but again the sensor size in this camera is just too small see dpreview.com for more details).  Go buy one of the Canon Digital Elphs... same small size, but better sensors (read bigger), consequently better pictures.  However, if your goal is to have something to shoot in and around the pool, or to have a camera a bit more 'peanut butter' proof for your little ones to use, this camera will fit that bill nicely.  And remember this.  SIZE MATTERS... when it comes to your digital camera's sensor.", "Date": "March 5, 2006"}, {"Title": "Great all-around waterproof camera for the family!!", "Author": "E. Griffin", "ReviewID": "R2V19IMSN8X773", "Overall": "5.0", "Content": "We purchased the W10 in 2006. So far I have taken over 10,000 photos on it. It has been to Hawaii 4 times and the Bahamas once. I have had it snorkeling in the water up to an hour several times a day. Sometimes I rinse and sometimes I don't. I have also used it here in Oregon to take pix in the rain to get those sports shots of my kids. It has been dropped, banged, scratched and otherwise benignly abused. So far, no leaks and still going!Comments:1) Photo quality: as long as I stay within the optical zoom range, photo quality is terrific. I am not looking for a camera that will take super-high quality shots (like a 10 mega pix), but one that will give me good resolution and color. No small point and shoot is going to be able to give the highest quality...SLR cameras are better for that (still trying to talk my husband into one of those.)I have gotten great shots of fish, kids, scenery and such. I still have not utilized all the menu options!!2) Underwater shooting: be sure to set the program to underwater photos (or video) and turn off the flash. Particles in the water will reflect back and the water will look cloudy. Best shots of fish are to float for a moment and try to pre-focus on the area, then snap the shot.3) Action: as with all point and shoot camera, action shots are not the greatest; however, if you program the camera to take multiple shots on the \"sports\" setting, you have a better chance of catching a good one. Cameras with shutter speed options are best for sports shots.4) Viewfinder: It took me awhile to adjust to not having a viewfinder and using the LCD screen. I still have trouble when I have my sunglasses on (or is it the bifocals?) I initially purchased a little attachment that sticks on around the LCD and pops open. It cut the glare and protected the screen. Unfortunately it did not survive multiple dips in the water. I have now adjusted to the screen and only occasionally miss something.5) Battery life: I have found that, for the most part, the battery life is terrific. I do have to remember to recharge it if I take alot of pix or video. Just noticed that it seems to be running down a tad bit faster. I prefer having the rechargable rather than having to use regular AA or AAA because of the environmental impact. Plus, AA, AAA don't hold a charge as long and you have to replace them often (having had a previous camera that only took AA batteries.)6) Overall operation: Either my kids are secretly devils (which I doubt) or I just can't really figure out how to prevent red-eye. Even using the red-eye reduction doesn't help. Shutter can be slow to respond, especially if the battery juice is running down. I try to snap the shot before the action happens (anticipate the shot.) The kids (ages 7 & 10) can use the camera with ease and I don't worry about them dropping it in the water (like our son did when he was 2...the camera was NOT waterproof, but did work again after 6 months of sitting around in a drawer.)As mentioned above, we have been 100% satisfied with this camera. It fits our needs as an active family who wanted a no-fuss, waterproof, \"tough\" camera!", "Date": "July 10, 2008"}, {"Title": "Nice camera.", "Author": "MaFanYow", "ReviewID": "R3JHUPGVWL1IT6", "Overall": "4.0", "Content": "Nice camera.  The focus is a bit off when used under low light conditions, but is fine when used in bright sunshine.  Another small problem is the clock keeps resetting when I replace the battery.  I used the camera when I went snorkeling or when it was raining and it never missed a beat.", "Date": "December 9, 2013"}, {"Title": "Excellent camera", "Author": "petaloka", "ReviewID": "R3FG90WQCZ6Q50", "Overall": "5.0", "Content": "I got this for my teenage son. It's a sturdy little camera that takes great pics on land or underwater. The best thing is he can take it to the beach and not worry about ruining it.", "Date": "September 11, 2007"}, {"Title": "I love my camera", "Author": "M. Boss \"While I still can....\"", "ReviewID": "R2F4I1PULJZQSY", "Overall": "4.0", "Content": "I bought this just before we went snorkeling with the whale sharks off Holbox island this summer and loved it.  I wish I'd have tried more of the features before we got there so I'd have known more about the underwater videos, etc.  It's very cool, lots of features!  The only complaint is that the screen is impossible to see underwater and very difficult to see in bright sun.  I tried to find a camera case that floats so it wouldn't sink to the bottom of the ocean but failed.  I did buy a skin for it and then cut that to fit it exactly.  That really helped because this is a slippery little camera!", "Date": "August 30, 2007"}, {"Title": "A nice digital upgrade.", "Author": "Fisafire \"Gadgetlover\"", "ReviewID": "R3B6SG0YWC1Y1W", "Overall": "4.0", "Content": "This is my first digital camera. Before that I had a film camera that was also by Pentax. Here is my review of that camera: This is not a sophisticated camera but it is very convenient for vacations or just taking pictures here and there. It is also good for its price. Not too expensive if you want a good camera on a low budget.  The same thing applies to this camera but it is more sophistication with much more capabilites. All of this makes this a great first time digital upgrade for a point and shoot camera.", "Date": "August 9, 2007"}, {"Title": "Finally, a solution to getting great surf shots!", "Author": "M. McGohan", "ReviewID": "R16AV9H1VQ323F", "Overall": "5.0", "Content": "After many years of surfing & trying to get good photos, but failing miserably, this camera is the solution.  We get so many great surf shots every time we take this camera in the water.  I do recommend you get attach a small floating keychain to it, otherwise it will sink if you drop it.  We dropped our first one in the water in Costa Rica, considered it a donation to the surf gods, but came home without a single photo from our great trip.", "Date": "April 19, 2006"}, {"Title": "great for the smart kids", "Author": "P. A. Meyer \"UNI4~`007\"", "ReviewID": "RK0Y229VNZO9P", "Overall": "3.0", "Content": "i had no problem figuring out this camera.  by the end of the day, it was like a video game for me, easy to operate and get around, had the whole thing memorized.  but for my dad....well he spent hours and didnt get anywhere.  so for those people out there that arent very technology literate, i suggest that this isnt the camera for you.  my advice is to get a bigger camera thats easier to hold, and one that has a mode dial.  the mode dial makes it much easier to get to different modes.  like from stills to video to continous shooting.  this camera doesnt have a mode dial so its a little more harder to navigate with.and another thing....the battery life sucks.  itll last about 2 hours straight before being completely drained.  only takes about 1.5 hours to charge though.  i just dont understand...if an ipod battery can last 15 hours, why cant a camera come close to that??", "Date": "December 22, 2005"}, {"Title": "Poor Customer Service/no durability", "Author": "Royalmuhahaha", "ReviewID": "R1MOBRPMGQ3YSK", "Overall": "3.0", "Content": "I bought this compact little camera because of its dustproof ability.I was on my way to the desert, (Iraq) for a year and it seamed like a good defense against the ever damaging sand.92 days into the warranty, the camera which I kept in a secure pocket had banged up against something and I found that the LCD had a cracked image. I assure you it was not from a strenuous impact. This camera does not have a view finder, so although it can still take pictures, without the LCD you do not know what your photographing.I called the store which denied coverage under the 90 day warranty, and then got in contact via mail to PENTAX. A month and half later I called PENTAX to follow up on my repair, and PENTAX denied repairing it because repairing the LCD was not cost efficient. PENTAX also admitted that the LCD is very fragile, So much for durability! They also had already shipped it out to a person under a different last name, and an incomplete address to IRAQ. Not very responsible. I'm still waiting for my unrepaired camera to be returned to me. I have been without one for 2 mos now.Although I did like the quality of the pictures I had shot, I wld not recommend this waterproof fragile camera to accompany you on any adventuress out door trip. Also I never had the opportunity to try the underwater capability.", "Date": "February 12, 2007"}, {"Title": "Another compact digi-disappointment...", "Author": "J. Oaks", "ReviewID": "RCAWNJPCZ67Z4", "Overall": "3.0", "Content": "I will say right off the bat, that the waterproof feature is something that I hope all digital camera manufacturers will adopt, eventually.  After two days of use, I dropped it in the bathtub, from my shirt pocket.  No problems at all!  BUT, I was not impressed with the pixel configuration.  I've seen images from a 3.2 MegaPixel camera, up-res'd that offer a clearer image.  WHen blown up to 200%, the image looks very fuzzy.  It could also be the fault of poor optics, not sure.  Also, very poor focusing ability in low-light conditions.  Although, the Macro function, when it could find a contrast-point to focus on, produced a solid image.  Hope you'll decide for yourself...", "Date": "February 28, 2006"}, {"Title": "Not too shabby...so far", "Author": "Joe Regular", "ReviewID": "R3ITL8HMQ2NRO9", "Overall": "3.0", "Content": "This is my first digital camera, so I'm not gonna act like I'm some professional.  I also have yet to use it a bunch, or print out pictures.  That being said here's what I think.Compared to other cameras I have used, the size, playback screen, and functionality (easy to use if you have just the smallest computer skills such as basic e-mailing), this camera is just fine.  I actually like the fact that you don't have the external mode setting button.  It takes all of about 2 seconds to get in and change the thing from say movie mode to regular picture mode.  And really, how often does a guy change from just basic point and click?  Besides, that external knob on most cameras is just something to bump to the wrong mode on accident, or bust off.I haven't got the thing wet yet, but I trust it works as they say.  I don't ever plan on getting it wet, but I won't be scared to take it out in the rain, or to play in the surf.  I think for the price, it's a good little piece of mind to have the waterproof capacity.I've heard the battery sucks, but they all do.  I'll just get an extra one if I'm ever gonna be out on some long excursion.Here's the only thing I'm concerned about, and it could be huge.  The lens does not telescope.  No biggie, right, because it still has a real nice zoom.  However, that means that there is a piece of glass covering the lens that never gets closed or protected...ever.  So far, every time I've looked at the thing it's got a fingerprint or smuge on it.  Me of course doesn't want to carry a cloth around and check it before every shot so I'm afraid I'll take a picture someday and have it be blurry.  Or use my shirt to wipe it off and have it scratched up after awhile.  Every other camera that I've ever seen has a lens cover that closes when not in use.  Although the lens on this thing is never going to get dirty at all, who cares if the window it's looking through is.  Your'e gonna have a bad pic.  If I would have known this beforehand (one of the dangers of not holding the thing in your hand before purchase) I probably would not have bought it.Like I said, I haven't used it much yet, but I'm crossing my fingers on this lens thing.", "Date": "December 30, 2005"}, {"Title": "Out of stock.", "Author": "Dustin A. Lewis \"Dustin Lewis\"", "ReviewID": "R8V2A4M7N7QYT", "Overall": "5.0", "Content": "Two days after I ordered the camera, the store called me and told me that the camera was out of stock.  They were very embarrassed, but made up for it by sending me a 1GB memory disk.  I reordered the camera through Amazon and received it just in time to use it on a trip.", "Date": "July 14, 2006"}, {"Title": "Nice features, but not great image quality.", "Author": "MtnBkmom", "ReviewID": "R34GT30212BTUY", "Overall": "3.0", "Content": "This camera was really cool. Loved the size. Easily fit into my pocket. It can even zoom in video mode. Just about everything made me want to keep it, but the image quality. It just was not good enough for me.", "Date": "March 2, 2006"}, {"Title": "Great little Camera", "Author": "Frank Ernst", "ReviewID": "R1DIJIWOR5ISLP", "Overall": "1.0", "Content": "Tiny size makes it easy to carry.  Features are much easier to use then other digital cameras I have used.  Printed pictures are of excellent quality", "Date": "February 23, 2006"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B000ARIV7M"}}