{"Reviews": [{"Title": "Stellar camera at a great price!", "Author": "R. Scott Broadway", "ReviewID": "R23N2EHSFQ8NT7", "Overall": "5.0", "Content": "I had been looking forward to this purchase ever since I saw the press release about the A610.  I ordered it from Amazon as soon as it was in stock, they shipped it immediately, one-day shipping got it to me exactly when I expected it.I am not ordinarily one to make such broad, sweeping statements, but I am very, VERY impressed with this camera.  Here are some initial impressions:- Movie mode is great...it makes AVI files in 160, 320, or 640 resolution (4:3) with okay quality mono sound.  It uses very low compression, so you get great quality but large file sizes.  The way I calculate it, you can get a 640x480 30fps AVI encoded at 2MB/s.  You can use the zoom before you hit the shutter, but you cannot zoom while filming.  Bummer.- The autofocus mechanism is spectacular.  It seems to have 9 zones in the AiAF setup, and will make a best guess at where you are focusing and show you those zones before you pull the shutter release.  You can also put it in \"FlexiZone\" which lets you move a single autofocus point around the frame, allowing you to ask the autofocus to aim wherever you'd like.  Macro focus is great...it really does focus accurately at ranges as close as a centimeter from the lens when zoomed all the way out (1x).  It does have a manual focus setting, but I can't yet beat the autofocus.- The \"My Colors\" feature is cool...one of the modes allows you to replace one color for another (you select by aiming the center of the frame at the colors you select).  You can also set it to select one hue, washing all others to grayscale.  For the photoshoppers out there, it's also got a mode where it stores both the original shot and the color-altered shot on the card.  No worries.- The photos I take with auto-exposure and autofocus turn out beautiful, crisp, and with great color balance (the RGB histograms look very even).  I can even get zoom shots of a close subject where the background appears blurred...very pretty.- The camera's user interface is quick enough to learn if you read the booklet.  On-screen menus are very informative without being over-designed.Do yourself a favor and buy this camera or the A620.  You will be investing in a very capable tool at an extraordinarily reasonable price.  Buy a big SD card, too, so you don't have to worry about setting the camera on anything but the highest resolution and lowest compression.", "Date": "October 10, 2005"}, {"Title": "Very pleased!", "Author": "Jerry98", "ReviewID": "R1FFQ2DZ0K8D9S", "Overall": "5.0", "Content": "I am very pleased with the camera, love the full manual settings, great movie mode (u can even zoom) and best of all it takes great pictures! This is the follow up camera to the A95, advantages include a bigger LCD, digic 2 processor (which means faster speed), high-speed 2.0 USB connection, better macro mode (less the half an inch!), 4 optical zoom. I think the biggest thing I noticed was the speed of the zoom lens and ability to focus. Macro shots is simply amazing! Personally I would get the Sandisk Ultra 2 SD memory card to go with this for top speed. Its a simply amazing camera you will love!", "Date": "October 4, 2005"}, {"Title": "Great camera!", "Author": "Nature Nut", "ReviewID": "RQQN6GMYI7H2B", "Overall": "5.0", "Content": "I am a first time buyer for this type of camera.  I spent days on the computer researching and trying to get the best deal for my money. I'm one picky customer and I really hunt for bargains! Consumer Reports rated the A95 as being a best buy, so when I heard that the A610 was a step up, I bought it.  I've also purchased the charger, batteries, and case to go with it.  (It's cheaper to buy them as a kit).  So far I've been thrilled with everything.  It is a great camera for both beginning and advanced users. The menu is not too complicated, like many of the cameras out there.  The quality is good also. It feels very sturdy and comfortable in my hand.  The size is perfect: not too small and not too large. I have larger hands and the buttons and controls are easy to use.  I love the zoom lens.  This camera has 20 different settings for picture-taking which was important for my husband and I because we like to take close-ups of nature.  It has other settings for taking action shots, portraits, snow, and beach pictures.  It even gives you the option of taking multiple shots and later turning them into a panoramic photo!  The screen is larger and swivels around to different positions so that I could even take a self-portrait if I wanted to.  This camera offers many thoughtful details and is easy to use (after you read the directions, of course).  I would not hesitate to recommend this fine camera!  It is a real deal for the money.UPDATE:  I'm still lovin' my camera!  It took a while to learn how to operate all the functions, but it's been fun!  The pictures are clear!  I can't imagine not having a camera that didn't have the swivel screen.  I just purchased a tripod and can now swivel the screen around and set the timer to see exactly where I need to stand to be sure we're all in the shot!  It's so nice that my husband wants one for himself!", "Date": "October 29, 2005"}, {"Title": "Excellent Camera", "Author": "J. Haindel \"Jay\"", "ReviewID": "R1UYJMU4PGAAX6", "Overall": "5.0", "Content": "I have my A610 a week now after having owned two digital cameras.  The last camera was a Canon A10 so this camera is a vast improvement.  I love this camera!  The pictures are wonderfully clear and crisp.  My only negative comment is that it is a little tricky getting a good focus and exposure at macro settings. This thing will focus down to 1 cm! I found it best not to use the flash on close up shots as it tends over expose. The manual tells you this and a good exposure is possible with just a minimal amount of light without the flash.  The menus are straight forward but complex.  Canon has allowed settings for just about everything. I can't imagine a setting that was missed. The camera is slightly on the large size and a little heavy since it has 4 batteries, but it runs forever on that power source.  The extra space needed for the batteries gives the camera  a nice grip since the front protrudes out allowing you to hold the camera very still for low light settings.  I like the finish on the camera contrary to previous complaints.  It is a textured silver finish rather than gloss and, I guess, it all a matter of taste.  I do not think it has a cheap finish. Besides, the fit or the various pieces are almost perfect.  This should not discourage you from buying this camera. Actually, I would have preferred an all black camera anyway, but silver seems to be the rage these days.  It has wonderful low light capabilities which are better than my old 35mm SLR.  I was really surprised about this.  I have noticed no noise problems in really low light.  The mechanical mechanisms are quiet and sound very refined.  My old camera was rough and noisy.  We looked at a lot of cameras an did a great deal of research.  I am very satisfied with this purchase and highly recommend it.", "Date": "December 6, 2005"}, {"Title": "Great Camera, worth every penny", "Author": "TheM", "ReviewID": "R1UJEBCMI5HFLA", "Overall": "5.0", "Content": "The Cannon PowerShot A610 is a wonderful camera.- 4 AA batteries mean that you don't have to charge a proprietary battery pack and you can refill at any store- Long battery life, we use 2000mAh NiMH AAs and they last for weeks of casual shooting. At a friends wedding I took over 200 pictures, most with flash and did not need new batteries.- Fast shutter response, not as fast as an SLR, but close.- Large fold out screen, this opens up a huge range of picture taking that you never thought possible.- Great pictures on the auto setting, just point and shoot for setting free pictures.- Great range of settings, from \"kids and pets\" for fast shots to completely manual.- Buy the fastest 1GB card you can find and you will never have to worry about changing cards again.- Great movie mode, perfect for those moments that look better on film.- Excellent display options for reviewing your photos.- Additional timer function where you can have it take multiple shots after a delay so if people are blinking or being silly you have several to choose from without running back to the camera- The only drawback is its size, if you want a \"pocket\" camera this is not for you, the large size does make it easy to hold and stable for using the timer.", "Date": "January 24, 2006"}, {"Title": "Best camera for twice its cost!", "Author": "Method2Madness \"Alex\"", "ReviewID": "R2F3X703P76TUW", "Overall": "5.0", "Content": "I have owned many brands of Digiams from HP to Sony to Kodak and have found this to be the best of them all(with Sony as a close runner-up). This makes the third generation of Canon DigiCam that I have owned. An a60, and a75 and now this a610! All still function as new! For all those with the e18 errors, heres a solution.....DONT DROP YOUR CAMERA! Treat it gently and for the most part, it will last quite a while. The pictures you get from this are simply stunning. Perfectly saturated colors with VERY little noise(Even on high ISO's). Battery life is very good with nimh's, mainly due to utilizing 4 batteries. I routinely get 200-300 pictures on a set of fully charged NiMh AA's and around 100 pics on your run of the mill Alkaline AA's(NOT reccomended by the way). The interface is FULL of features, yet not too overwhelming. The new \"My Colors\" setting yields an absolutely stunning twist to your photos! For this year they have also increased the zoom to a 4x! Canon really did their homework on the A-series cameras!", "Date": "January 12, 2006"}, {"Title": "Great camera for the price, improvement on A60!", "Author": "John Murtari \"AKidsRight.Org\"", "ReviewID": "R2V20RTPHJM0J0", "Overall": "5.0", "Content": "I had owned the earlier Powershot A60 model and was very happy with that.  The A610 is an improvement in every aspect.*  Video mode is great!  You get full motion videos at 600x480 that look great when played back on  a TV.  I had just bought a digital video camcorder, JVC-GR270, and I'm returning the camcorder because the Canon simply put its videos to shame.  I STRONGLY recommend the1GB SD Card and get an \"ultra fast\" version.* Very useful additional photo features.  It allows you to trya trial flash so that it can correct exposure, before the actualflash shot to avoid wash out.* In review mode you can see a histogram of color levels.* I didn't think I would find a lot of use for the flexible LCDdisplay.  But it comes in very handy in macro mode and also fortaking self portraits.* It has full manual controls and Canon has improved the button controls on the back.* VERY nice that you can use 4 double-A batteries of your choice.  I was able to shoot hundreds of photos with the LCD on all the time on one set.Just a great camera.", "Date": "December 28, 2005"}, {"Title": "Good price, excellent features, easy to use", "Author": "Miles", "ReviewID": "R1S48VTO6YQSRB", "Overall": "4.0", "Content": "I bought this camera for my parents to replace their old Olympus 1.2 megapixel camera.  My Mom was convinced she'd need at least 6 megapixels but I proved to them 5 mp gives you more than enough quality (unless of course you are a professional).  Not to mention with the release of the A620, this camera has become quite the bargain.  You won't see too many 5 megapixel cameras with all the features this has for much cheaper.  The optical zoom is a must in the camera world.  Sure, you think you won't use the zoom much but you'll discover later on you really needed it.This camera is small, but not that small and despite being made of some kind of plastic has a very sturdy, metallic feel to it.  It fits comfortable in even a man's large hands and let's you avoid that problem of shakiness many of the too small digital cameras have.  The interface is easy to use, simple, and effective.  There is a dial for most of the features an amateur photographer would need to use in a split second, and I love the LCD screen on the back.  It's the right size and perfectly movable.  The grip on the side of this camera is one of its best features.  Not only does it let you take secure pictures if you are like me and have shakey hands, but it's also nice when maybe you are leaning out or in a moving vehicle trying to take a picture, you feel like you have a really good grip on your camera.Another feature I like is that the lens is interchangeable and you can buy more advanced lenses to serve your particular needs.  The package came with a USB cable adapter that lets you get all your pictures off the camera without ever having to touch the memory card.All in all I think this is a perfect choice for the average consumer.  It is a little pricey through Amazon, more affordable through some other retailers, but a good buy nonetheless.  Things I'd like to see with it would be maybe a case or easy way to protect it, and it's also not the kind of camera you could easily slip into your pocket or anything.  It's not that advanced in features, but consider what it's aiming for I think it does a good job.", "Date": "February 9, 2006"}, {"Title": "A winner", "Author": "ATL-Carpetbagger", "ReviewID": "R2EBHE0LNWZSVU", "Overall": "5.0", "Content": "Just used this for three weeks in Asia. It took hundreds of gorgeous shots without a hitch. Battery life was good and flexible resolution/detail options allowed me to save memory for the \"big\" shots. I love the detail and color in the pics; really didn't regret leaving my slide film behind. I also brought my 3MP Canon A400 to use as a \"pocket\" camera, but never took it out of the case because this one, though no Elph in size, is handy to carry and has addictive features. I was skeptical about the flip-around screen, but have found it very useful. Aside from the  unobtrusiveness of looking away while shooting a subject, it basically saved me from lugging around a tripod because I could use any surface to stablize the camera in low light and simply move the screen to see the subject. This also helps the camera shake problem. I agree with those who find the \"shake\" icon appears too frequently, but it really does stop you from taking a pic that will only appear out of focus once you blow it up at home. If you're taking a lot of action shots in low light without a flash, you may need to go deeper into the software than I did to see if the settings will adapt to your purposes. The AV door is also flimsy, as others mentioned, not my favorite feature, but at least it's flexible so it doesn't break off. I looked at a lot of camera sites before choosing this model, and have been very happy with its ease of use, quality, and reliability. It was easy (and cheap) to transition to this from the smaller Canon, as the software, SD card, and batteries were the same. There are definitely sleeker models out there (HP ,Sony), but for me this was a great combination of ease of use, functionality, quality, and price.", "Date": "January 31, 2006"}, {"Title": "By far the best deal I found", "Author": "A Customer \"customer12345657\"", "ReviewID": "RR9FEGOHQAO5T", "Overall": "5.0", "Content": "I suffered through a few cheaper cameras, all with disappointing results, before paying for this one. Digital cameras still aren't as cheap as film cameras, so you really just need to pay more if you want a good one. Maybe some cheaper digital cameras are OK for some people, but this one zooms farther, shoots faster, and takes better pictures. Indoor pictures come out pretty good (cheaper cameras take terrible indoor pictures) and outdoors it is just amazing.It has a variety of settings you can adjust, but I just leave it set to automatic mode and it works better than messing around with modes and settings on cheaper cameras. The only things you really need to touch are the macro option for really close pictures (within a few inches) and sometimes you might want to turn the flash off manually, although most of the time it will turn off automatically when not needed. Eventually I will try playing with different settings, but for now I am just thrilled with how well it works on auto.The first one I got was defective, but with Amazon I didn't have to pay anything for return shipping either direction to get it replaced.", "Date": "January 18, 2006"}, {"Title": "Great photos", "Author": "B. Berg", "ReviewID": "R3IJQWEY47GJMY", "Overall": "5.0", "Content": "After reading all of the other reviews, I decided to purchase this camera.  Canon is very well respected and has a loyal following.  I was not disappointed.  The camera is easy to operate, and the picture quality is excellent.  The large LCD display has a very nice feature that allows it to be rotated to different positions for viewing, or closed for protection while in the camera case.The only down side of this camera is the weight.  It is a little bit large and heavy compared to some other models.  Not a bad trade off for the all of the other features, though.Update- July 2007- Still going strong and taking great photos.  Time to upgrade the SD card to 2 GB in orter to take better advantage of the video recorder.  Nice quality, bet eats memory fast!", "Date": "October 31, 2005"}, {"Title": "Great Camera", "Author": "Janet", "ReviewID": "R2RII9VYRR01ZU", "Overall": "5.0", "Content": "I bought this camera and i love it.  the marco mode is amazing, even though you dont need to you can touch the subject and the camera will still focus.  the zoom is very good (4x it would be nice with more but oh well, you can get a lens adapter from canon for about 120 it think).  the shooting modes are easy to use and get to.  my favorite is the color mode which is very fun to play around with.  the style fits my hand very well.  the screen is nice and large and it is nice that it flips closed so you dont scratch it or damage it.  also it starts up very quickly.  for a camera just under $300, this is a great buy.  so far i have been completely satisfied.  i would definatly recomend this to anyone looking for a great camera.", "Date": "December 13, 2005"}, {"Title": "One of the best !!", "Author": "N. Gangahar", "ReviewID": "R2767QNIQGUU3T", "Overall": "5.0", "Content": "After extensive usage, I would like to add that some of the images are soft. They are not as sharply focussed as some of the other cameras on the market (I am comparing a Sony W5 and the Canon A610). But still a great camera with tons of features.Pros :- Great pictures!!- Nice build quality- Easy to use/Menus and functions well layed out- Great battery life- Powerful flash- Awesome macro mode- Comforatable grip- Really fast operation both at the time of starting and while using flashCons:- Small memory card provided- Slightly heavy and big (not pocketable)(Guess it is a tradeoff between 4 x AA batteries and sleek design)- Some red eye problem.I got myself a 512 MB card, 2300mAh rechargeable batteries. Have taken over 200 pictures spread over almost a month now. Batteries still going strong. This is my first digital camera, and I think there is none better for the price !! Great job Canon.", "Date": "December 28, 2005"}, {"Title": "Great improvement to the Canon A-Series", "Author": "mluser", "ReviewID": "R1NOBINIOU54GY", "Overall": "5.0", "Content": "I bought this camera at an electronics store and since then haven't been able to put it down.  It has all the settings that an average user could ever use, and a few novel others.  I am a man with larger hands but I have not had any problems with gripping the camera or punching any of the buttons.  This makes a perfect second camera for those who want a few other features to use to get a little creative.  From what I have noticed, the structure is very solid.  The 4X zoom is also great, and the 5MP resolution shows things in pictures that you never knew were there.  This is the best camera that I have ever purchased.", "Date": "October 13, 2005"}, {"Title": "Excellent Features", "Author": "Nishanth Chandran \"Nishanth\"", "ReviewID": "R2CLZ1A1M2MWCZ", "Overall": "5.0", "Content": "The camera has got some really nice features that are unavailable in similar models.... Some good features are various modes of shooting such as portrait, landscape and special settings for cloudy and sunny days... also, there is a Tungsten setting which allows you to take photographs of bright light sources... it gets really good detail even when taking such shots...All in all a fantastic camera..", "Date": "January 6, 2006"}, {"Title": "Polarized reviews, for good reason", "Author": "R. Goldberg \"Bobbo\"", "ReviewID": "R3T4L439URL0J4", "Overall": "1.0", "Content": "If you look at the ratio of reviews, you'll note that it's the opposite of the bell-shaped curve: many 5 star reviews and many 1's. I don't recall ever seeing this schism before, but it exists for good reason. The camera takes lovely pictures, given enough light, maybe some of the best I've seen from a Point-and-Shoot... when it works. So if a reviewer's cam is still working, 5 stars make sense. But so many report the e18 lens error or, like mine, the dreaded black screen, that Canon needed to step up and handle these better. I sent mine in, and got the usual $107 quote to fix it out of warranty. Having read other reviews, I think I'll just let it slide, since even cameras that have been repaired continue to have problems.For me, it boils down to a company's integrity. With such a proliferation of complaints, Canon needed to own up to the problem. Instead, they're trying to reward their own lack of QC by earning more money on repair of an unreliable camera. They do offer to \"upgrade\" you to an A540, I believe it is, for \"only\"  $100. The A540 lacks the swivel screen of the 610, which was why I bought my 610 in the first place, and has some of the same problems reported.Third strike is that, while most digicams mount on my Mac desktop when plugged in, the Canon requires software to download the pictures. Alas, \"convenient\" integrity, sloppy repairs and interface problems equal three strikes for Canon. I'll be looking elsewhere for a pocketable camera.*** A very pleasant postscript on the issue of integrity. ***I contacted Canon and, upon my polite request, they agreed to repair the camera \"as a goodwill gesture.\" I had mentioned this site and the 25% of reviews indicating problems. They hastened to add that they utilize an internal database to track problems, and that these reviews played no part in their decision. In any case, I am grateful that Canon was willing to do the right thing in my case, and wanted to share that in the context of my previous remarks.", "Date": "January 13, 2008"}, {"Title": "Great digital camera", "Author": "Giselle G.", "ReviewID": "RL4YKBEVHL73Y", "Overall": "5.0", "Content": "I can't say enough wonderful things about this camera.  I did plenty of research before selecting this camera (my first digital one).  This camera has a lot of the great features as more expensive ones, such as Panoramic Photo Stich, 20 scenic modes,etc.  It also has a very handy tilt LCD screen for self-portraits or for when you need to shoot above a crowd (now you don't have to guess that your aiming at the right spot, you can actually see it).  If I would have to list something negative about this camera, it would be that compared to others in the market right now, it is on the bulky side.  But all the beautiful looking pictures I've taken so far compensate for that though.", "Date": "March 12, 2006"}, {"Title": "Canon rocks in Digital Cameras", "Author": "Inderjeet Singh \"Singh\"", "ReviewID": "R14MK5RV5W8O59", "Overall": "5.0", "Content": "If you are willing to ignore aesthetics of this camera then this is THE best camera in the price range. While buying a camera one must look for the CCD size (higher the better) and Optical Zoom (higher the better). Canon gives 1/1.8\" CCD size for this camera and all other 5 Mega Pixel Camera (even Canon's own SD400, S500, SD450) use 1/2.5\" CCD. Infact Canon uses the same size CCD (i.e. 1/1.8\") for its new 7 Mega Pixel Cameras.This is the second Canon digital Camera I bought for my family. The earlier one S500 is working perfectly for last one and half years and I expect this one will set new standards.", "Date": "March 14, 2006"}, {"Title": "Excellent all-purpose camera -- I'd buy it again!", "Author": "C. J. Trayser \"MrL8Nite\"", "ReviewID": "R2H6SHUBEM831I", "Overall": "5.0", "Content": "I bought this before a trip to Hawaii to replace an older film camera of approximately the same size.  Wow!  The photos are sharp, they can be blown up to 5x7 or probably larger without an issue (I haven't tried 8x10 yet).  Several pictures we took are beautiful -- better than any film camera we've owned.The real beauty of this camera is the adjustable viewing screen.  For those of us with bifocals or trifocals, the large screen and the ability to twist the display so I can see it through my bifocals without twisting my head up funny is worth every cent.  I enjoy taking photos again!My only concerns are that the unit is not as sturdy as I would like.  As the other reviewers have mentioned, the covers to the batteries and the cable connections are flimsy, but if you're careful with them, it should be fine.  Also, the dial on the top that sets the scene selection gets \"bumped\" to other settings with little effort.  I was also disappointed that the mounting for the tripod is plastic...one twist too many and it will probably crack, so be careful.We found that to avoid blurry photos, just disable the digital zoom and only use the optical zoom.  We took over 400 pictures with the camera and the only shot that was blurry was with digital zoom.  I even took shots from moving cars and the results were excellent.We were shooting the largest-richest format of photos available on the camera and noticed that after repeated uploading and deleting of photos that the time between shots was taking a little longer.  We used the memory card reformat option on the camera and the speed returned.  Buy yourself a fast, good quality memory card (I use a SanDisk Ultra II 512MB) along with the camera and you shouldn't have any problems.", "Date": "May 25, 2006"}, {"Title": "Excellent camera!", "Author": "B L U E", "ReviewID": "R3QTCE5G7QOD4Z", "Overall": "5.0", "Content": "This camera sets itself apart in the crowded marketplace of cameras, and is a great value at its current price point.  Hurry before they sell out!Pros:- Flip screen is extremely useful, I've gotten into the habit of flipping it out to use, so that the LCD is always protected when camera is closed- 1/1.8\" sensor is same as higher-end Canon prosumers, this is bigger than all SD series, the new A700, A530/540, even the IS2 (which all use 1/2.5\" sensor)!  Bigger sensor = more detail and less noise, especially in low light, although without IS, you'll get noticeable noise shooting at ISO 400 in dimly light areas.- extremely customizable if you're up for it - full manual shutter speed/aperture control, plus flash level, custom white balance (lets you calibrate to gray cards), whew!- excellent, intuitive Canon interface, so changing parameters is a breeze- the macro mode is stunning, esp. with FlexiZone focusing to customize focus point and min. focus distance of 1 cm.  Some DSLRs can't even focus that close- it's fast, fast, fast.  fast startup, fast shooting, fast flash cycling- the best that money can buy for two hundred bucksCons:- no RAW capture (that's stretching it I know)- it's not pocketable and it's quite heavy, but you feel safe throwing it in a jacket pocket because the screen is protected!- less MP than A620, but costs less (they have the same sensor though)- no remote capture (A620 does have it)- lens cover is thin piece of plastic, could be fragile if you're careless- zooming sound is distinguishable in a quiet room, zoom is not smooth (only about 10 steps from wide to tele)- USB cover appears flimsy, but it looks like it's designed to stand repeated abuse and won't break.", "Date": "May 15, 2006"}, {"Title": "This camera rocks", "Author": "Michael P. Pindell", "ReviewID": "R3AP38ZD3GAFG4", "Overall": "5.0", "Content": "I run a internet company which requires professional use of digital photos, etc. In short, this camera surprised me with all the options and all. Don't listen to people saying \"it is too heavy\". the heavier the better. It is solid, and I really love it. I also checked reviews before I bought this camera. It deserves 5 stars, not 4.5. If people did/do complain, it is because they don't know how to take pictures, for that matter..do they even know how to check their email? Anyways, i am impressed.", "Date": "December 15, 2005"}, {"Title": "A Fantastic Disposable Camera!", "Author": "M. Allen Greenbaum", "ReviewID": "R3PEBJ4JZHZYE0", "Overall": "5.0", "Content": "It was great while it lasted.Canon loads more quality optical elements and automatic features in the A610 than you'll find on any other disposable camera.  Outstanding zoom lens, automation that ranges from full (a variety of easy-to-use presets that adjust for scenery), to moderate (e.g., speed priority or aperture priority), to none (manual operation), my Canon gave me excellent pictures for about 19 months. That's right, it was almost two full years before the Canon stopped working--try beating that with your disposable!At 19 months, the camera's viewfinder suddenly malfunctioned. I couldn't see an image through the LCD viewer, neither on picture preview (before you take the picture) nor on picture review. Staff at a professional camera shop said that it was probably the CCD sensor.  Canon told me they'd repair it for $107 since the camera was over its one year warranty.If you Google Canon A610 CCD problem (and you should, I think, if you're considering this or any other Canon), you'll come to a thread on the CNET consumer electronics forum.  Have a loved one or some tranquilizers nearby; this is scary stuff.  IT appears that many people have had the same or a similar problem with their A610.  In fact, Canon admits that several models made between 2002 and 2004 used faulty CCD sensors made by Sony; it issued \"advisories\" on these models (some of which are still sold), and, laudably, they will fix CCD-related problems for free.Even though a professional camera shop told me that my A610 probably had this problem, Canon would not budge because the A610 is not on their \"advisory\" list. If you have some evidence that this is the problem (Google CCD sensor problems and you'll learn some of the symptoms, and their prevalence), you will need to call the Canon Factory Service Center and argue tenaciously why you believe Canon should pay all repair fees. Canon apparently will NOT admit that the A610 has a CCD problem--that would open up the model to costly recalls. When I received mine back (repaired for free after much investment of time and emotion), the repair sheet vaguely noted only a problem with the \"optical assembly.\" How informative--A camera itself is just one complex \"optical assembly!\"  The invoice did not specify the specific problem or what was replaced or repaired--itself an indictment of Canon's (lack of) Candor in dealing with this problem.Depending on how legitimate your claim and your persistence in reaching a supervisor, Canon will offer discounted repair prices (for example, 1/2 off, 3/4 off). Go for 100% off if you believe that Canon is at fault. Go to forums.cnet.com for some consumer accounts of the problem and Canon's response. I believe Canon claims that all CCD problems ended after 2004. You might ask yourself, then, why so many people report such similar problems, often with A610s bought within the same period (towards the end of 2005).If you must buy this camera, or if you already own one, consider an extended repair contract if one is available. In fact, this might be a good idea for ANY Canon product with an \"optical assembly.\"Otherwise, console yourself with the fact that you have bought the greatest disposable camera ever made.", "Date": "November 14, 2007"}, {"Title": "Canon Powershot A610", "Author": "K. Manchester \"kwg1114\"", "ReviewID": "RA8J0S3UB2L6P", "Overall": "5.0", "Content": "Love, love,love my new camera. So far it's been very easy to use, downloading picts. has been simple. It's small, but not too small. Picts. turn out very clear, not grainy. It's a good purchase for those of us who don't know too much about cameras. Picture taking is easy.", "Date": "February 23, 2006"}, {"Title": "Very nice camera and impressive video", "Author": "kd \"Just Me\"", "ReviewID": "R2Q8Y152782NVQ", "Overall": "5.0", "Content": "I bought this camera for my mom and au pair for Christmas.I have been really impressed.  The pictures look very nice, the camera is quite easy to use, and the videos look EXCELLENT!  The camera was smaller than I expected which was nice too.  The flip LCD is very useful - I'm very pleased with that.My only slight complaint is what I have heard others say - the little door covering the A/V inputs is incredibly thin and flimsy.  It doesn't even seem to close properly.  It is quite odd that they didn't do a little better job  Hopefully that won't become a problem. I could see it easily getting ripped off it is *so* small and think.I have a Nikon D70, but am considering getting one of these as a smaller alternative when I don't want to lug my big camera everywhere.For the price, this is a very good option.", "Date": "December 27, 2005"}, {"Title": "Great for its new price.", "Author": "S. Albert", "ReviewID": "R1IESBTVOSOJQG", "Overall": "4.0", "Content": "I work at a public access TV station where we bought five of these for our digital imaging classes. I'm very impressed.4 Quick Pros:Battery life. It uses 4 AA's which last significantly longer than I expected them to.Video mode: Uses a Mac-friendly format and looks greatFull manual mode: A little tricky because you have to hit the same buttons to make different adjustments, but it's there.Full swivel screen: Great for shooting over a crowd or from the hip.Cons:The compartment doors are a little flimsy.Comes with a 16mb card (useless), but most camera companies are kind of stingy in this regard.", "Date": "February 26, 2006"}, {"Title": "Wow - great picture and video quality", "Author": "C. Fazwa", "ReviewID": "RE86C0KRGNRV", "Overall": "5.0", "Content": "I bought this camera to replace an older Canon powershot.  The picture quality is superb and the video quality is as well.  The viewscreen is larger and the camera is very easy to use.  The only drawback is that it is a bit bulky and heavy and uses 4 batteries.", "Date": "May 2, 2006"}, {"Title": "Great pictures, easy to use, multi-featured", "Author": "C. Rosenberg", "ReviewID": "R2NOXUB0B36ZHZ", "Overall": "5.0", "Content": "This camara has all of the features I need.  I can take great pet photos, night and indoor shots.  These three were nearly impossible to capture well with my old camara.  The ease of use auto focus is important to me also.  I highly recommend this camara.", "Date": "March 23, 2006"}, {"Title": "great camera", "Author": "A. Swanson", "ReviewID": "R3OSDT7FPF2AVK", "Overall": "5.0", "Content": "My Dad actually got this camera for me. I have a really nice Canon film camera I love, but I had not yet gotten into digital.Being new to the digital camera world I love this camera.It is very easy to use, and takes great pictures. I have countless pictures of my son. I highly recommend this as a first digital camera before taking the leap to a nicer quality more professional digital like I plan on doing someday.", "Date": "May 11, 2006"}, {"Title": "Recurring theme...", "Author": "Only One Success", "ReviewID": "R1PN9UUQM36CVX", "Overall": "1.0", "Content": "Like so many that have commented, after owning this camera for about 15 months it stopped taking pictures. The monitor still works since I can view the old pictures on memory, but the camera will no longer capture a new picture. Avoid this camera!", "Date": "December 7, 2007"}, {"Title": "Best camera I've ever had.", "Author": "Sarah E. Oliver \"biogirl50\"", "ReviewID": "R2V2NK8MKI0Q2S", "Overall": "5.0", "Content": "I purchased this camera about six months ago after my Kodak Easyshare camera completely died on me. I did a little research and read only good things about this Canon camera so I decided to go with it because it was very reasonably priced (about $200). Not only did the camera live up to my expectations, it surpassed them by leaps and bounds! Here are the things I have loved about this camera:BATTERY - this camera has the best battery of any digital camera I have ever owned or used. At first I was worried since it uses four AA batteries instead of two like my other cameras, but it was advertised to have a good battery life so I was hopeful. Let me tell you that I have had this camera about six months and have not had to change the batteries yet! And I use the camera quite a bit. I used it for church Vacation Bible School all week, youth weekend retreat, family vacation, pictures of friends and pets, all of this and the battery is still going strong! If I had not experienced this, I would not believe it was possible for any digital camera to do so well with batteries (my Kodak sucked the life out of batteries in a matter of just a few hours or less!)EASY TO USE - I was able to sit down with the camera and figure out pretty much all of the functions in a very short period of time and with very little reference to the manual. (And I'm no technology expert).PICTURE QUALITY - all of the pictures I've taken and printed out have been great. The camera is a 5.0MP camera and it does a great job for it's resolution I think. All my pictures have been sharp, clear, and great color.FEATURES - I love the ability to quickly and easily change between outdoor, indoor, different lighting conditions, action vs. still shots, close-up, etc. And it makes a real difference in the quality of the pictures to be able to tell the camera what the conditions are of the picture you are trying to take.LCD SCREEN - I was hoping to get a camera with a very large LCD screen, but quickly discovered that I like the swivel feature on this camera even more than having a huge LCD. Being able to swing the screen out and turn it around gives you that much more versatility in what pictures you can take. It revolutionized the \"self-portrait\" :)SD MEMORY CARD - I was also looking for a camera that used SD memory cards. Mostly because that was what I'd used before and all of my other pictures were on SD Memory. So that was a big plus for me. That may be different for each person though depending on which type of media you are used to using.I cannot stress how highly I recommend this camera. I will never buy another digital camera besides Canon again. And the A610 (as well as the A620 - the 7.0MP version) is the best digital camera I've ever used.", "Date": "September 1, 2006"}, {"Title": "Awesome camera!", "Author": "L. Isac", "ReviewID": "R1Z0Y2U93LS125", "Overall": "5.0", "Content": "This is my first digital camera and I can say that I am very pleased with this camera. Pictures come out looking awesome and although I had to check the Advanced Users guide that came with the camera to check up on some of the features, I found it easy to understand. Ability to zoom in while taking video in VGA at 60 fps. Tons of features for the price.", "Date": "February 7, 2006"}, {"Title": "Died young", "Author": "Tom", "ReviewID": "RCJHFG1PDX700", "Overall": "1.0", "Content": "Bought this camera 12/2005. I was thrilled with this camera. But alas 15 months later the lcd started to go blank. By 18 months dead as a door nail. Contacted Canon. They said they were not aware of any ongoing problem with this model, but ,they would fix it for a starting fee of $99.00. This fee would be half of what I paid for it.", "Date": "October 3, 2007"}, {"Title": "A610 Serious Problems - don't buy this camera", "Author": "JAN \"SavvyShopper\"", "ReviewID": "R2S9CVP5HO36CL", "Overall": "1.0", "Content": "After light and careful usage, my A610 stopped recording images. Just a black screen, and black memory card image.  The image sensor appears to be defective.  Canon knows that it got a bad batch of CCD image sensors from Sony and they are in quite a few products.  They are trying to take care of the problem now, but you'll have to go to their website and look at their service advisory, and the A610 is not yet on the list of camera that they will repair free of charge.", "Date": "April 26, 2007"}, {"Title": "Good pictures, minor gripes", "Author": "J. deLongpre", "ReviewID": "R31JT2FX0F5712", "Overall": "4.0", "Content": "I bought this camera to replace a 2M Powershot A60 before a trip to Hawaii.  I have been very happy with the pictures it takes, and also with the speed of focus, which is MUCH faster than the A60.  I like the preset \"scenes\", like the landscape that turns off the flash, and the \"kids\" setting that forces a quick focus and fast shutter speed.  I got about 100 pictures on a set of NIMH batteries, mostly outdoors but some with flash.My gripes are minor, no battery level indicator, the cover over the usb socket doesn't stay closed very well, and the battery door is flimsy (same as the A60, actually).", "Date": "May 19, 2006"}, {"Title": "Superb", "Author": "Andrew B. Thompson", "ReviewID": "RUT8HFIX8BA4J", "Overall": "5.0", "Content": "I own a 20D and a A85, this is a great walkaround camera and significantly faster than the A85 with its Digic2 chip.If you take the time to check out its features you can do a whole lot with it.Even has continuous shooting mode at about 2.4fps.Focus is very fast.", "Date": "December 15, 2005"}, {"Title": "Great camera - UNTIL IT STOPS WORKING", "Author": "Sheryl Hutchison \"History2\"", "ReviewID": "RDQ7BWIHF0925", "Overall": "5.0", "Content": "DON'T BUY THIS CAMERA.  Disregard my original rating of 5 stars. I liked the A610 camera when I bought it back in February/March 2006. It is now May 2007, the warranty expired 2 months ago. I turned on the camera last week and no LCD display.  The image sensor has died. I have used this camera less than 10 times.  Never dropped it, no bumps or bruises on it. The LCD display is completely black.  I can now take only pure black pictures.  Everything else on the camera works - just no image.  Canon evidently received a batch of faulty image sensors but they are taking no responsibility for their bad parts. I contacted them and they gave me two options: I can pay $100++ to have it repaired at their factory in Illinois, or I can join their loyalty program and pay $125 plus $10 shipping for a refurbished camera.  Some loyalty program.  DON'T BUY THIS CAMERA.  CANON DOESN'T STAND BEHIND THEIR PRODUCTS.", "Date": "March 4, 2006"}, {"Title": "Same dissapointing failure", "Author": "CA Grad Student", "ReviewID": "RIAE56KEVJTR0", "Overall": "1.0", "Content": "I've now owned an A80 and the A610 -- Love the cameras, hate the failures. My A610 has failed exactly like other peoples' cameras -- screen goes black, pictures go black, and now I have no camera! Are Powershots just crappy for longevity?! Honestly, the design of these cameras is brilliant, but I cannot afford to keep replacing my camera so frequently!!", "Date": "October 28, 2007"}, {"Title": "Mine went bad in less than two years", "Author": "Jonathan Birge", "ReviewID": "R3GQ7RL2JZ5SSD", "Overall": "1.0", "Content": "Just wanted to add a voice to the chorus of people whose A610 died. I took excellent care of it, and then one day I turned it on and all it could do was take pictures of darkness. Sad that so little quality goes into products these days. Canon should be smarter than this; it makes it very hard for me to trust them with my money again.", "Date": "October 22, 2007"}, {"Title": "Canon cameras are terrible!!!!!", "Author": "Brent M. Saba", "ReviewID": "ROR8UBWUDJOWH", "Overall": "1.0", "Content": "I bought my Canon camera thinking it would be a good quality camera. It worked fine up until I owned it for just under 15 months. The screen went black, and like so many others with the exact same problem, Canon REFUSES to fix it. Saying it is out of warranty. Bottom line is that Canon produced a line of defective cameras, and I for one will NEVER buy another product that bears the Canon name. Now, all I have is a really expensive paperweight!!! I hate to throw it away! Maybe someday, Canon will come to its senses and offer to fix it. But I won't hold my breath. If you are even remotely considering buying a Canon camera, I would strongly recommend not doing so. Their customer service is absolutely among the worst I have ever seen and experienced!", "Date": "May 2, 2008"}, {"Title": "I love this new camera!!", "Author": "Linda", "ReviewID": "R31AVGIZ8VCKJV", "Overall": "5.0", "Content": "I have enjoyed this camera alot!  It is small enough for my purse and I have taken great pictures of the grandchildren.  I have been very happy so far.", "Date": "February 23, 2006"}, {"Title": "erratic or sticky lens motor and lens cover", "Author": "Kapil Goyal \"Kapil\"", "ReviewID": "RK1Z8DJKNPT43", "Overall": "1.0", "Content": "After one year of babying the camera, it suddenly has malfunctioning lens i.e. both zoom and focus.  Cover would not close properly anymore.  Makes loud buzzing noise when turned on, and lens does not glide smoothly.  Now it drains fully charged high capacity nickle metal hydride batteries very quickly.  The internal gears must be made of absolutely worthless material to go bad so quickly.  The alternatives are not much better either as every manufacturer may well be using poor quality internal gears so they can keep selling a new one to customers every year or so.  Good scheme for generating revenues.  Is there collusion among manufacturers?", "Date": "March 13, 2008"}, {"Title": "Durability Redux", "Author": "John M. Messinger", "ReviewID": "R3F6UQ37KSUCID", "Overall": "1.0", "Content": "Took great pictures for a year and then the power switch got flakey on me.  For a while it took two presses to turn it on.  Then had to press it repeatedly for 10 seconds then 20.  Time got longer to turn it on before I finally sent it in for repair.  Estimate was $180 to repair a $250 camera.  Ummm, naaahh.", "Date": "December 3, 2007"}, {"Title": "Awesome Camera UNTIL it decides to stop working - *UPDATE*", "Author": "L. Sommerville", "ReviewID": "R16ANHJAVUQZMD", "Overall": "1.0", "Content": "UPDATE: After speaking with a supervisor and expressing my anger about this issue Canon agreed to fix my camera for $25. Although I didn't want or think I should have to pay this, I agreed b/c it was much better than the $110 quote or $100 inferior \"upgrade\". I received it just a day after submitting my repair authorization in good working order. I'm not sure what was actually done, repair summary was vague. However, I'm happy to have it back b/c there aren't many cameras in this price range that take awesome photos and have so many manual controls. I would urge anyone with this problem to be persistant with customer service, I could not have replaced this camera for $25 so it was worth it to me. I'm still angered that Canon is just outright denying this issue and am now looking at Nikkon instead of the Rebel for my DSLR purchase.Original post:I bought this camera in Feb of 06 and have LOVED it. It took the best pictures and the video/audio quality was as good, if not better than my $800 Handycam. Just recently it started going through batteries like crazy and would just powerdown, but not even close completely. I bought new, rechargeable batteries, but now it won't even power up. I was very careful to this camera. I did drop it one time on the grass probably a year ago, but just a minor dent and it still worked fine for a many many months. I took it to a camera repair and they opened it and said that nothing was damaged, that it is probably a circuit problem which can be complex and very expensive and that I would be better off just buying a new camera (of course ONE week b/f our family vacation!). I am soooo disappointed as I paid over $300 for a camera that lasted less than a year and a half. I am emailing Canon today, but reading other reviews not expecting them to do much. I will buy a new camera (not Canon) b/c just for the estimate to send it in is $100 and they will let you know if they need to do more, in which I might then be out $100 dollars and still out a camera.SOOOOOO FRUSTRATING!", "Date": "September 10, 2007"}, {"Title": "Died for no reason after only 16 months.", "Author": "Gio \"GIO\"", "ReviewID": "R2XVYEQ4NK2ZKV", "Overall": "1.0", "Content": "The title is self explanatory.Just like others here my camera died no pictures and no screen after few time I used.Never dropped or abused.It is a lemon form Canon.Gio.", "Date": "July 5, 2007"}, {"Title": "Great camera...when it doesn't die suddenly", "Author": "MGoBlue", "ReviewID": "RXS17J6D4NN0J", "Overall": "1.0", "Content": "Awesome camera, quick, and just easy to use. I did tons of research on it when I purchased it in Feb '06. Unfortunately, if you start looking at some of the more recent reviews, you can see that folk that got it around a year ago are having major issues.Mine's no exception, and amazingly, this is first piece of hardware that's actually failed me. Quite an experience and interesting to see that many others are having the same issue as me: a LCD screen that's black and an inability to take pictures.And like a previous poster said, Canon's taking responsibility for a bunch of other models but not this one yet. You can read the notice on their website after navigating through their digital camera support section.So all in all, it was nice...while it lasted. Hope things are better now.", "Date": "May 25, 2007"}, {"Title": "please don't buy", "Author": "Jayachandran Kamaraj \"jckama\"", "ReviewID": "R3IOOV48HSL13A", "Overall": "1.0", "Content": "i bought this camera in december 2005 from amazon. it was good in everything, ease of use, picture quality, and everything. after 10 months, it started to give me problem like \"low battery\". so i changed the batteries, after a couple of shots same issue, still i suspected there is something wrong with the batteries, so i changed the batteries again. after a couple of shots the same warning \"change the batteries\". i couldn't use my camera to take shots during my entire trip(which included my wedding).then i come back to US and sent the camera for repair(as i found online that there is a firmware problem with the camera) so i sent it for repair(it was still under warranty). it came back with the report that it was cleaned for battery drain. the problem is still there. i called those tech support guys and told about the problem, they asked me to send it back. but the canon website won't allow me to create a repair order unless i agree to $107 repair charge, and the tech guys told me that the repair people won't charge, as it is within three months of the repair. but now i got the camera back, again on a trip, the camera still giving the same warning, lost $107 dollars for nothing. i hope i'll get the money back. i hope they will repair the camera, once i get back from my vacation.", "Date": "March 10, 2007"}, {"Title": "The A600 series cameras are all lemons.", "Author": "Jacques Laroque", "ReviewID": "RNML05KDK8EXI", "Overall": "1.0", "Content": "I got my PowerShot A620 in early April of 2006.  I was completely satisfied and happy with all picture-taking features. Just getting into shooting videos by early summer and still very enthused.  So I decided to buy my daughter an early Christmas present  - a PowerShot A610 - in August 2006.Then, on November 17, 2006, I had just inserted a fresh SD memory card and turned on the camera when it issued a loud \"scream\" and the LCD screen displayed \"E18.\" The lens barrel had partly extended and apparently the gears for that function had \"stripped,\" causing the startling noise.  I contacted Canon and the camera was repaired at no charge under warranty. It was back in my hands in about 10 days after I shipped to Canon.  BUT - since then, this camera has exhibited a strange behavior where it will partly extend the lens barrel (the same \"optical assemby\" Canon replaced) spontaneously (all by itself, without use of the power button).  I have searched the web and found that others complain about the \"E18\" failure of the opitical assembly.BUT that's not all: On Christmas Day, as my daughter and I prepared to visit relatives, we were checking our cameras when  my daughter told me her A610 had  suddenly (at that moment) displayed \"Insert Memory Card\" on its LCD screen. Subsequent tests with 3 other identical memory cards for my camera (Kingston  SD, 1 GB)  failed to be detected in her camera.  The memory card in her camera was OK - I was able to rescue images on it by inserting it in my A620 and downloading to my computer.  I'm awaiting word from her on what Canon is doing to correct the problem with her camera.STILL not all: during that same period (November - December 2006) the adult daughter of a close friend had HER Canon A610 go bad. The problem was failure of the LCD screen - it just went blank and stayed that way.Again - Canon was prompt in fixing that problem but the point here is that THREE of the A600 series cameras owned by different people developed three different problems (all warranty covered) in the span of about 6 weeks.Since that time, I've heard more of the same from some people - while others have had no problems with their \"A600s\" and love them.  But I cannot recommend this series because it appears to have a high failure rate.  To have a camera that takes great pictures and videos which \"quits\" disasterously just when you plan on using it for something important makes that camera worse than useless - its a huge disappointment and I wouldn't wish that on anyone.Meanwhile - my \"solution\" to this was to buy a Canon PowerShot S3-1S; an even better camera with more features (image stabilization!  - 12X zoom! -  audio recording! ) and its much more strongly constructed.Since neither the A600s nor the S3 series are \"pocket cameras\" - the added bulk is not that big a factor to me.Canon is a fine brand and has many other models to suit virtually any photographic need.  Just avoid the A600 series and research before you buy.", "Date": "January 19, 2007"}, {"Title": "Another one bites the dust", "Author": "R. Morris", "ReviewID": "R32VT58P4GL76U", "Overall": "1.0", "Content": "Wow, so I'm not alone in my $150 purchase of a camera that lasts 16 months?  Thanks everyone, misery loves company.For my camera, I was taking photos when i put my finger in front of the lens when i zoomed out.  All of a sudden I get error code \"E18\" (obstructed lens) and my camera is DEAD.  I'm out of Canon warranty, I didnt get Bestbuy's warranty, and the local repair shop wants $65 minimum to 'take a look'.....betwen my own lens problem and all of the other published problems on this camera, I dont want to invest more money in a lemon. I am now seriously concerned for the quality of all canon cameras and I dont CARE how popular they are, Once burned, you learn your lesson, I'll go for Sony next time.I really LOVED this camera while it lasted which is the sad part.  I hate Canon and I do hold a grudge.  They lost a customer forever.  An electronic product should not be this shoddy.", "Date": "January 8, 2008"}, {"Title": "Blurry photos and camera shake icon won't go away", "Author": "Stevie P.", "ReviewID": "R3FIKVFUUDBZU8", "Overall": "3.0", "Content": "I am giving this 3 stars for now because I have just ordered a replacement and don't want to slam the camera in case I just happened to get a \"bad\" one.  I previously had the Canon A80 and was always pleased with the results so I opted for the A610 when it was time to get a new camera.  Out of the box, I set the camera to Auto and started shooting a few indoor shots and noticed that all the shots seemed blurry.  Additionally, the camera shake icon comes on when using the optical zoom no matter how still the camera is held.  I even set the camera on a table to ensure that it was completely still but I can't get the camera shake icon to go away (any suggestions?).  Based on my good experiences with the A80 and after reading all the good reviews posted, I have decided that the camera must be defective in some way so I am sending it back to Amazon for a replacement.", "Date": "January 4, 2006"}, {"Title": "My Very 1st Digital Camera", "Author": "G. Marte \"Newbie but a Techie\"", "ReviewID": "RYMAW07ODARW8", "Overall": "5.0", "Content": "I bought this camera so that I can take pictures of my son when I go visit him.  I haven't actually done that just yet but I am practicing taking pictures.I am a beginner in every sense.  I got the bug from my sister.  She's pretty good at this stuff.I'm no aspiring Ansel Adams or any other great photographer but i would like to be able to take great looking shots in every condition that I may be in.  Be it a party or at a museum, whatever ligthing condition etc. etc. etc.  I want to be able to photograph that moment.Well this camera can do that and more.  The auto mode is great for just being lazy and taking a snap shot to the color mode where you can do the color swap/accent etc.  It's also got a good macro mode for close ups.Another great feature is the ability to take fast frame rate video.  It's at a lower resolution but the quality is there.  If you want a video camera, buy a video camera.  This is a digicam that can take video as well.I would definitely recommend this product to anyone who wants a point and shoot camera and have a little bit of control for things like shutter speed, aperture blah blah blah.Definitely get at least a 512 high speed SD card to minimize the time it takes from taking the picture to trying to take the next but that can be remedied by the burst mode.The only thing that I don't like about this camera (and it really isn't a big deal at least for now) is the zoom.  albeit, it't great zoom for a small camera, I would prefer to have at least 10x-12X zoom with image stabilization as well as a live histogram.I might keep this camera for a while till I get my skills improved but the next camera I want is the S2 IS.Bottom line, this will do what you want it to do and if you have time to play around with it a bit, then this is the camera for you.  Keep in midn that this isn't a slim pocket cam but a real camera to take real pictures.", "Date": "December 16, 2005"}, {"Title": "Simply the best for the price you pay", "Author": "Praful S. Gupta", "ReviewID": "R1FOUNANWJOVRL", "Overall": "5.0", "Content": "I bought this digital camera sometime in December and already have placed an order for another one as a gift. Since this is my first digital camera, i bought it from a store and thought shall try it out to see know it feels. The camera is simply amazing. Nice compact design, not as noisy as some others, nice crisp pictures, plenty of zoom, fast response to zoom and snaps. Fully loaded camera with plenty for manual and automatic settings.As with all products, there are some cons with this one as well. First, although it is not as noisy as some others but you still can hear a noise when you zoom in and out. I found some of the Sony and Nikon making less noise. Secondly, the pictures at the far end of the zoom were very shaky and out of focus. Thirdly, it uses 4 AA batteries while others use only 2.But overall, nothing beats a Canon and this ones the best out there.", "Date": "January 29, 2006"}, {"Title": "BEWARE", "Author": "E. Owens \"average joe\"", "ReviewID": "R2MBAIK6ZIUEVS", "Overall": "1.0", "Content": "First off let me tell you that when this camera is working it is great. The pictures are great the ease of use is great, everything about it is great................except! I had this camera for 6 months and then it started going south. The drive to zoom was not functioning right, so I sent it back to cannon who fixed it and fixed it in a very timely manner. Everything was back to normal and the camera was making me very happy again. Then about 8 months later............it stopped working, completely. It would not even turn on. So I contacted cannon and the email I got back shocked me. They told me that there was nothing they could do because it had been a year since I had bought the camera, and they proceeded to tell me that if I sent in my A610 with $120 they would send me a refurbished A520. Are you freakin kidding me, a refurbished A510 and $120, I can buy a BRAND NEW A510 for under $100. So the point of the story is that I had read many reviews like mine and ignored them, do not ignore this one. If you buy I would strongly suggest getting some kind of extended warrenty so you do not waste $300 like I did.", "Date": "September 9, 2007"}, {"Title": "Dead as a doornail", "Author": "Steve Peter", "ReviewID": "R1HVEUJP1DHGKY", "Overall": "1.0", "Content": "I'm travelling for several months, and lo and behold, the camera will not power up. I've had it for a year and a half, which seems to be the end of life for this model.", "Date": "July 21, 2007"}, {"Title": "lovin it", "Author": "LMD", "ReviewID": "R1NGYIQ55PFZFL", "Overall": "5.0", "Content": "i love this camera.  i bring it with me EVERYWHERE.  it takes great pictures and i love the color color options.  i know, it takes four  batteries, but they last a REALLY long time.  especially if you get rechargables.  the flip screen is great too.  i like to get into weird angles or just to flip around so i can take a picture of myself and a friend.  it's great.  i would highly suggest this camera.", "Date": "August 19, 2006"}, {"Title": "Amazing photos", "Author": "Daniel \"God is my judge\" \"Cigar Man\"", "ReviewID": "R21SE3AH91TB7A", "Overall": "5.0", "Content": "After reading reviews from various sources on various digital cameras, I chose the canon 610. I am by no means an expert photographer, but the pictures this camera produces on the auto setting is amazing! I can only imagine what a real photographer could accomplish with it. While it has a myraid of settings, I primarly use auto, so if your not an expert, you can easily use this camera. Coupled with the Kingston 512 mem stick you can take hundreds of pictures! I recommend this camera for everyone who wants great photos at reasonable cost and ease of use. My only complaint is the manual is poor. Good thing this camera is intuitive.", "Date": "July 8, 2006"}, {"Title": "Easy To Use", "Author": "N. Huffman", "ReviewID": "R3146S23YLWQE4", "Overall": "5.0", "Content": "I was able to pick this camera up and start using without even looking at the manual.  There are a lot of extra functions that I need to learn how to use, but just for regular pictures it is easy.  The swivel screen is very useful.  Especially if you want to put the camera on something and time a picture.  You can see what you will be shooting much easier.  The 4 AA batteries have a much longer life than my old 2 AA camera.  I hear the rechargable batteries are even better.  Overall this camera has all I need for everyday use at a great price.", "Date": "July 4, 2006"}, {"Title": "Good Features, Good Warranty Service, Questionable Quality", "Author": "tagger9 \"tagger9\"", "ReviewID": "R2H88RNEJ1E2IU", "Overall": "3.0", "Content": "I needed a camera that can take great pictures, can do good quality videos and can do close-up macros. This was the only camera in this price range that does this, and I've been quite happy with it overall.The pictures are always good quality, and the videos are pretty nice. They are not DVD quality, but they're not bad and are pretty close to what you get with an old VHS recorder. With a 1 GB memory card, I can get about 8 minutes worth of video at 30 frames/sec, 640x480 resolution. My only gripe about the videos is that there is a high-pitched noise on all of them. Its not a real loud noise and it doesn't ruin the videos, but it is noticeable.While the features are good, I do question the quality. Right after I bought it, the automatic lens cover wouldn't shut right. Then, about a month later, the whole lens assembly just froze up and wouldn't retract at all. The camera was useless at this point.  I sent it in for warranty service and it took about three weeks from the time I sent it to the time I got it back. As one reviewer noted, they do keep you pretty well informed of whats going on during the repair period. I have had no major problems with the  repaired camera, though once in a while the on/off button gets stuck.So, overall, was satisifed with the camera features and the Canon warranty service, but I do wonder about the quality of these cameras. There was one major defect and several minor ones. My A610 model was made in China whereas older Canon models were made elsewhere, and I wonder if this recent move by Canon has affected their quality.", "Date": "June 29, 2006"}, {"Title": "Canon Powershot A610 5MP Digital Camera with 4x Optical Zoom", "Author": "Stewart E. Yin", "ReviewID": "R3173KWR1G2UV7", "Overall": "1.0", "Content": "Very unreliable camera, since we bought this camera last December, the camera has been sent back to Canon three times for problems.  The basic issue was that it did not take pictures.  Each time, Canon fixed and sent camera back.  For the third time, we requested a replacement because we believed that the camera was a lemon.  The camera was out of commission for 4+ months out of the 12 month warranty for repair and transit time.", "Date": "January 18, 2007"}, {"Title": "Excellent Camera, Tremendous Value (UPDATED)", "Author": "DB from NC", "ReviewID": "R26IQ4MEFZG4IX", "Overall": "5.0", "Content": "***6/5/08 Changing the rating of this camera to THREE stars. CCD began to fail about 3 months ago...blacking out the LCD for a short time, then snapping back on...then total failure. Looked online, found a huge thread of Powershot A610 users that had the same issue. Canon has replaced some for free, but more often it's generally it's a major effort to receive satisfaction (a free repair). Sending mine in tomorrow, will update on their resolution.Bought this to replace an older 3mp Canon that my wife loved, but the battery  (and subsequent replacements) were awful.  They'd last perhaps 10-20 pictures and then start flashing \"low-battery\".So I started hunting down a camera that used AA-type and settled on the A610.Great camera and features. We rarely print bigger then 5x7, so the 5mp was perfect. If you want the higher resolution A620, they're identical cameras with the 7mp chip.With fully loaded batteries, we get hundreds of shots and only recharge perhaps one every 3-4 weeks...and my wife is taking pics of the kids constantly.", "Date": "September 25, 2006"}, {"Title": "Great Value", "Author": "A. Bunner \"night runner\"", "ReviewID": "R1P04ZZZ6C7V2Y", "Overall": "5.0", "Content": "I've had this camera for 2 weeks now and am very pleased.  Its easy to use, takes great pictures, and has a ton of features for the money.  Great battery life with regular AA's.  Fits good to my hand yet still fits in my pocket.  I had one photo blown up to an 8x10\" and it turned out great..no pixelation.  The swivel LCD is much more useful than I thought it would be.  The best part is there is very little delay in between shots, so I don't miss as many shots as I did with my old Kodak.  I do prefer Kodak's software though..it was easier to e-mail compressed photos from it than it is the Canon software.Update..had to send to Canon for repair (Image Processor needed repair).  They fixed it (under warranty) and had it sent back FEDEX within 5 business days..so i have it back in time for Christmas...KUDOS to Canon for great Service!!!!!Very Satisfied!!!", "Date": "July 6, 2006"}, {"Title": "Moonlighter", "Author": "Harry T. Harding Jr.", "ReviewID": "RK28871GAYQZY", "Overall": "4.0", "Content": "The camera surpasses my wildest dreams. It it a very easy camera to use. It is also easy to downloan. Anybody who orders this camere is in for a very pleasent surprise.", "Date": "July 4, 2006"}, {"Title": "great camera but no remote shooting capability", "Author": "E. Jojola", "ReviewID": "R3FQ6M5B847CY5", "Overall": "4.0", "Content": "While the A610 takes great pictures and has an excellent user interface, for some reason the remote shooting function that comes with the packaged software, and that is commonly available on some cheaper Canon models and on the A620, is not enabled on this camera. This function would have allowed the camera to take pictures from  and save directly to a USB connected computer. Why they decided to exclude this function I don't know, but seems like a glaring omission on what would otherwise be a great software/hardware package.", "Date": "March 3, 2006"}, {"Title": "The best what you can get for this money!", "Author": "Wojciech Sowa \"Wojtek S\"", "ReviewID": "R3CGXY49U33IVG", "Overall": "4.0", "Content": "Excellent product, you can configure everything like in more expensive models. Only memory card is a misunderstanding 16Mb. If you decide to buy this camera order 1Gb memory card.", "Date": "February 1, 2006"}, {"Title": "Great camera, small problem", "Author": "Carroll", "ReviewID": "R2P840TFAMAHRZ", "Overall": "4.0", "Content": "The camera arrived quickly and looked great. However, when trying to actually use it a problem popped up. It appears the camera had been taken apart and when reassembled the navigation button had not been properly seated. This made using the arrow keys, especially going left was next to impossible. The problem has been fixed, the camera works beautifully and I'm very pleased with it. Also the Amazon seller Ztron provided excellent customer service. Thanks for an experience that turned out really good!", "Date": "October 28, 2012"}, {"Title": "Dead Screen", "Author": "Ronald Waltman", "ReviewID": "R1CWPQZR8X7COU", "Overall": "1.0", "Content": "I will admit the camera took great pictures but from the very beginning I had issues.  When it was very cold the shutter would not open completely, sometimes I had to open the battery door and close it to get it to power up.  Then came the dreaded blank screen.  I contacted Cannon and received the typical $110 up front answer.  I will continue to argue with them and try to get a reduced price or free if I can but I'm not holding my breath.  I took excellent care of this camera but is still died after about 28 months of use.  I still have a 25 year old Pentax camera that works like the day I bought it, why can't they make anything that last now days?", "Date": "June 2, 2008"}, {"Title": "Exactly what I needed.", "Author": "Melissa", "ReviewID": "R2SBGISVL4E0DH", "Overall": "5.0", "Content": "I did a good bit of research before buying my camera, and found that, for the price, this was the best one for the job. I'm not a professional photographer, but I wanted something that took good pictures and would be easy to operate.The multi-angle LCD makes it easy to take pictures overhead, down low and of myself.It's also durable. I accidentally left it on top of my car and drove off one morning. I realized my mistake about half a mile from my house and when I found the camera (at the end of my block) it only had some minor scratches on it, and still works perfectly.I took it to Greece in 2006, and came back with some amazing pictures (links below).Would definitely recommend.[...]", "Date": "February 17, 2008"}, {"Title": "Nearly 10,000 pictures later, still going just like Day 1", "Author": "N. Maddix \"moonlightrose44\"", "ReviewID": "RSK4DB9RXBIMZ", "Overall": "5.0", "Content": "I've had this camera since March 2006, I researched on it highly and when it took a price cut, I went for it (the new models were just starting to come out about this time as well, hence the price cut). Not disappointed in the least with this gem of a camera. Battery life is excellent, pictures are crisp and clear, just need a tad sharpening. I've taken well over 10,000 picture with this camera (No lie, I take it with me everywhere...) and it's still going as strong as it was when I first bought it. Of course, I often wonder when the time will come when the imfamous E18 error will come, but that's why I bought an extended warranty. Hopefully, this camera will continue to rock well into the coming years.", "Date": "November 16, 2006"}, {"Title": "Good Camera but has a Known Bug", "Author": "Kristina", "ReviewID": "R1S16IELO8T1HI", "Overall": "3.0", "Content": "This camera is great overall when it works properly. There is a known issue where the lens will not retract (and it's not due to low battery).Otherwise the quality and features are great but in all the research I did, I didn't find that info before I bought the camera.  Of course it happened right after one year (no warranty coverage left).Check the web - I did too late.", "Date": "September 27, 2006"}, {"Title": "Great camera!!", "Author": "J. Lappe", "ReviewID": "R1AYMB9P7GP4K2", "Overall": "4.0", "Content": "I love my new Powershot A610.  The my colors feature was especially fun to experiment with.  This camera has a lot of features and takes great pictures for a great price.  I've noticed however that some of my pictures turn out blurry, because in a darker room the shutter speed is a lot lower", "Date": "July 19, 2006"}, {"Title": "You are rolling the dice if you buy this camera! stay away!", "Author": "K. Kwiatek \"Snooperk\"", "ReviewID": "R24DKEXUEGEO1Z", "Overall": "1.0", "Content": "This camera does take great shots, but the reliability of it stinks. We enjoyed it for a year and then the battery low warning came on even with brand new batteries... others are complaining of the same thing. It is a $200 disposable camera, and canon knows it!", "Date": "October 9, 2005"}, {"Title": "This camera could benefit from higher speed SD cards", "Author": "J. Chien", "ReviewID": "R1ALBC5UBUZEPO", "Overall": "5.0", "Content": "I wondered whether a high-speed Secure Digital card would truly enhance the performance of Canon PowerShot A610. I contacted Canon USA. Canon replied that it had not tested the various SD cards on the market. I went on to look for answers over the Internet, and concluded that Canon PowerShot A610 could benefit from higher speed SD cards capable of writing up to 5 mbps or 33X.In his recent article \"Compact Flash and SD Cards,\" Bob Atkins indicated that the speed at which data is written to the flash memory card depends upon three factors: the maximum write speed of the card, the maximum write speed of the camera, and the efficiency of the interaction between the camera's software and the card's onboard controller. Canon PowerShot A610 employs the DIGIC II Imaging Processor for picture quality and processing speed. In the article, Canon EOS 20D containing the same DIGIC II processor tops out at 5 mbps when writing to a card capable of writing 9 mbps. Canon PowerShot A610 would expect to write in similar speed and thus benefit from a higher speed SD card capable of write speed 5 mbps (I am ignoring the third factor here).The write speed of most SD cards appears to be 1.2 mbps that is 8X (1X = 0.15 mbps). For Canon PowerShot A610, SD cards capable of writing speed between 33X and 50X would be sufficient. Be mindful that the advertised multipliers would often indicate the read speeds only. For example, a 50X SD reads up to 10 mbps, but writes only 1.2 mbps (8X). A 150X SD reads at the promised 22.5 mbps but writes 15.0 mbps (100X). The write speed seems always to lag behind the read speed by a sizable margin.", "Date": "March 12, 2006"}, {"Title": "Two thumbs down", "Author": "Chuck", "ReviewID": "R13JFE39I6SWF2", "Overall": "1.0", "Content": "This camera stopped working after using it three times.  It was not dropped or abused in any way, it just lost the ability to detect that a memory card was in the camera.  This was not a formatting issue and a local specialty shop that I do business with for film processing and other matters, examined the camera and confirmed that it needs to be replaced or repaired by the manufacturer.Worse still when I tried to get some service from Amazon.com I was greeted by an employee in India whose english language skills were not adequate for me to communicate my problem.I tried to get some service from Amazon's vendor/partner (Adorama), but I have been unable to reach them by phone and they have not responded to my emails despite their claim to respond to all email messages within 24 hours.This is the last order I will place with Amazon, the last time I will do business with Adorama, Amazon's vendor/partner, and the last cannon camera that I will purchase.It will be interesting to see if this email is posted.", "Date": "May 1, 2006"}, {"Title": "Read the book", "Author": "J. Brennan", "ReviewID": "R4LNX8GM5WWHZ", "Overall": "4.0", "Content": "We bought this camera to keep my 78 yo dad busy during a family gathering.  His first venture to digital technology, he spent LOTS of time reading the book and trying things out.  The biggest problem in his learning was that the chip that comes with the camera is so small as to hold less than a dozen pictures.  So, when you buy the camera, BUY A BIGGER CHIP AT THE SAME TIME!!!!", "Date": "June 26, 2006"}, {"Title": "Disappointing", "Author": "JEP", "ReviewID": "R2KG9R53SHFV4B", "Overall": "1.0", "Content": "Disappointingly low durability.  OK for a simple point-and-shoot at the time, but within a year the zoom started to fail (can't zoom out, never in focus when you do).  Screen scratched badly, hard to clean.", "Date": "December 7, 2013"}, {"Title": "Great compact camera", "Author": "SB", "ReviewID": "RNNI2YWEWXKEM", "Overall": "5.0", "Content": "An amazing camera. Easy to carry around, with a fast 2.8 lense and many manual options if you need them. The flip-out screen is small but very useful. Very good build quality and reliability (mine has taken countless thousands of shots). It was only stopped when a car knocked me over and the camera hit the floor. It was repaired, and is still in constant use today.", "Date": "August 23, 2013"}, {"Title": "CANON POWERSHOT A610 CAMERA", "Author": "JGM", "ReviewID": "R2L4F8VL8ULGHK", "Overall": "5.0", "Content": "Definitley would recommend this camera! Easy to use, easy to carry and if not accidently left on it has a long battery life. I bought one, loved it, so bought one for my wife. She loves hers as well.", "Date": "January 21, 2013"}, {"Title": "Replacment Camera", "Author": "Bob Walker", "ReviewID": "R3GM16GRP07LJ9", "Overall": "4.0", "Content": "I used a Canon A6120 for underwater photogerphy.  I was very successful and  used this camera frequently. The camera was water damaged, therefore I was looking for a replacment Canon A610.  I purchased one from Amazon.com at a very reasonal price with good delivery.", "Date": "September 1, 2012"}, {"Title": "Good for pictures with the correct lighting or FLASH!", "Author": "PookieThePirate", "ReviewID": "RK2RGLPS3SNON", "Overall": "3.0", "Content": "Well first of all, I bought this camera A LOOOOONG time ago. It was my first camera, and it STILL works. Doesn't have a scratch on it either. But I notice you can get it for 30 bucks now, really?! I swear when I bought this, it was about 100 dollars, I feel robbed haha.Anyway, this camera is only good for one thing in my opinion, and that's photos. If you don't want a kodak disposable camera just get this camera so you can have endless pictures and do what you want with them. You have to have the right lighting for this camera to take great photos.Some photos I have taken, are blurry, even when I am right next to whatever I am taking a picture of. Though with some natural light, I've taken some fantastic photos too. But it's hit or miss with this one.When at parties and with flash, it takes pics too. If you see the trend, it's lighting. THe thing with the flash, it has to be dark, don't have to flash too bright or else the photos are just terrible, and with a huge white circle in the middle.the video is fine WITH GREAT LIGHTING or else you get grainy video and you can't figure out what you're looking at.The features... I don't really use them. One time I did and it looked so ugly.Moral of this story.Lighting = great photos.I don't know what error people are talking about. I've had this camera for 5+ years. My first camera too. Maybe there was an instance where I just took the batteries out and it would reset, or the memory card. I don't remember doing that much though.Again, buy this as a glorified disposable camera, it does save you money in the long run anyway.", "Date": "May 25, 2012"}, {"Title": "Perfect Service!", "Author": "PhotoLady", "ReviewID": "R3B0WD638SKLC6", "Overall": "5.0", "Content": "Your service was perfect! We ordered the Canon Powershot A610 camera because it still has the glass lens. It works perfectly! Thank you and we will order through you again! I loved the first A610 camera, but I dropped it and couldn't find a camera that had a sharp picture. So I ordered this one again and I love it!  Canon should be ashamed of themselves for going cheap and putting in plastic lenses in the new powershots. The pictures are NOT SHARP! And why NO FLIP OUT SCREENS ANYMORE?  They need to go back to glass lenses AND THE FLIP OUT SCREENS!", "Date": "April 25, 2012"}, {"Title": "Canon A610", "Author": "Hamstersadancin", "ReviewID": "R2U7B1W07IMLH8", "Overall": "5.0", "Content": "Bought this product by the time its way past outdated in January 2009 from the seller: lukechilds.For  a camera introduced in 2005 lacking modern features like SDHC/XC compatibility, ISO above 400, HD Video, Image Stability, 10+ MP sized photos the A610 still has its uses. The primary reason I bought the A610 in the first place is the vari-angle LCD and was cheap for $90 at the time. That vari-angle LCD has helped me shoot at odd angles accurately though not out in bright sunlight. Other features like  the Optical Viewfinder, and 58mm bayonet mount for adapters/filters/lenses were also key  for me to getting the A610. Pretty rare for me to find such features altogether especially on modern Pocket Point&Shoot; cameras especially the Canon A-series with Digic IV/V processors.Minor gripe  it's terrible in low-light conditions with or without flash especially with fast subjects typical of  digital cameras with small CCD sensors and outdated processors.In the case of problems with the camera i'm probably lucky never to have gotten the blank black screen or CCD failures since 2009.The only major problem I had with it was the stuck lens shutter which only opens halfway when on. Later remedied by permanently prying off the shutter.As of September 2012 I still use the A610 as my everyday carry Point&Shoot; Camera. Sidenote longsince upgraded to bridge(Canon S5is) and DSLR(Canon 60D).With the discovery that it's capable to use Canon Hack Development Kit's custom firmware it will stay till it no longer functions. Because of CHDK it's capable of shooting in RAW format(.dng.cr2). Can do HDR photography, Infinite Timelapse Photography, etc... things that  higher end P&S; cameras can do.Not recommended for Long Exposure Night Photography due to the small CCD.", "Date": "May 5, 2011"}, {"Title": "From a sort-of-tech mom with kids - AMAZING camera!", "Author": "gadgetmom", "ReviewID": "R2D3W1PYQIL7OK", "Overall": "5.0", "Content": "I have owned this camera for about 5-6 years now, it was bought when our 1st child was born and has lasted into his 7th year now (and the addition of another wee one as well).  I am relatively good with tech-stuff but I am also impatient!  I need gadgets to work, work fast, work right and I don't read the manuals!  Now that I've been upfront.....this camera, while it has a LOT of bells and whistles for an average-everyday-point-and-shoot, it has been tride and true for the past 6-ish years.  So much so that I have been reluctant to replace it!THE PROS:- Swivel LCD screen.  This is awesome when kiddos have events and there is a sea of kids.....I can still film or take pics of mine & see what I'm doing.- 4x Optical zoom is great!  Looking for more zoom with a new one, but 4x was usually sufficient for everyday photos.- AMAZING photos, period.  Lot's of defeatable modes if you want to play with F-stops/Appeture/ExposureTime/etc.  I am not a photographer, so these took a little work to manipulate & use, but I was able to take one of those cool time-delay pics with tail lights streaking by AND get a really nice picture of my kids sleeping in a dark room without using the flash (used a cheap tripod to steady the camera)!  **One of my favorite features on this camera is the half-button focus.....in regular Auto mode, you can half-depress the shutter button and it will focus (green box or boxes for \"OK\" and red for \"try again\") for you.  I was able to get dozens of FANTASTIC action shots of my kids playing soccer.  Other parents thought a pro had taken the shots as they were perfect 'freeze frame' shots of body-defying feats (it took about 100 shots during a game to get a couple good ones - but they are priceless!).- Portable Scanner!  I use this camera to \"scan\" documents, receipts, and other misc. items all the time.  It's better quality than my very nice scanner!  With or without flash, I use it both ways and always get great results.- The casing is SO DURABLE!  I am a total clutz!  I have dropped this poor camera so many times (and on hard surfaces) that I am shocked the lens/LCD/inner guts are still in pristine condition.  The outer casing even has gaps where the drop caused the outer casing to crunch a bit.....it has not stopped taking phenomenal pics!- Battery Life is......A LOT!  The camera is heavy, I won't deny that.  Mostly due to the required 4 x AA batteries to run the thing.  BUT, this usually means I can get weeks of life out of the camera.  On a recent trip to Disney for 3 straight days I brought a back-up set and did not have to replace until mid-3rd day.....and I take lots of photos AND short video clips too.- Great video for a camera.....if you are a screaming soccer mom I recommend toning it down, as the mic picks up the user QUITE clearly (no whispers, or the cam will pick it up!).  It does a nice job of getting the kids saying \"I'm open, pass it!\" from across the field though!  The video becomes very grainy with the zoom past about 2x though.  But awesome for Xmas pics and switching quick to video - and back again.  I feel like I've not missed a moment of those all-important first years!CONS....Hardly anything....!- The little plastic 'door' that covers the digital AVout is kind of a pain, as it's soft rubber, and the 'catch' no longer really catches.  I have to really press it in to get it to stay closed.- the lens cover flaps (these swivel out of the way as the camera turns on, & swivel back into place on power down).....well, these broke when a little-one but placed a finger in the teeth to see if it would 'pop out' so I can hardly blame Canon for this!  They were already sticky a bit on occasion, but would pop into place with a gentle nude or pwr on/off.", "Date": "November 15, 2010"}, {"Title": "Don't buy it", "Author": "J. Bowshier", "ReviewID": "R1W0T9QRPIBT2M", "Overall": "1.0", "Content": "Like so many others, my A610 no longer takes pictures. I can see the icons and  see old pictures. There was no damage to the camera-it happened spontaneously.  As you can read on various sites, Canon has not been responsive to this problem.  It is a shame since I loved the camera before this happened and now will not buy another Canon.", "Date": "July 25, 2010"}, {"Title": "nice", "Author": "Rose Graham", "ReviewID": "R30TVEPU5C9TQT", "Overall": "5.0", "Content": "I am so pleased with this camera, I would recommend it to anyone.  The close ups are unbelievable, I am so happy to have purchased this camera.", "Date": "May 27, 2010"}, {"Title": "I liked it", "Author": "R. Joshi \"R. Joshi\"", "ReviewID": "R1X9ZGK1R8FJ4X", "Overall": "4.0", "Content": "I really like the quality of the picture. Only problem is it takes only two AA battery which dies quickly and also after taking one photo, you have to literally wait to take 2nd photo with flash on.", "Date": "December 15, 2009"}, {"Title": "Canon A610... Great camera, great pictures, fun to use. Love it!", "Author": "Robert Goldman", "ReviewID": "RD14VNZOX28S", "Overall": "5.0", "Content": "I received the Canon Powershot A610 as a special birthday gift from my family almost four years ago. They got it for me after I did much research on what would be a good choice for my first digital camera. What a great choice it has proved to be! Almost four years later, I have a treasure trove of beautiful photos of some really great places and lots of things that mean alot to me. The A610 has come through so well again and again. It is easy to use and has some excellent automatic settings that allow me to focus on composing and framing a good photo without getting lost in technical mastery. I have a talent for creating good photos, but am not a technically oriented person for the most part. The battery life when taking lots of photos over a period of many months is amazing. This camera has accompanied me on numerous day hikes, including a recent overnight backpacking trip where it got quite cold. Like a reliable friend, it performed beautifully once again and I returned home with some great memories and photos, too. I love my Canon A610! My next digital camera will be a Canon, likely the SX20 IS, but I will keep the A610 forever.", "Date": "October 31, 2009"}, {"Title": "One more for the dead camera club", "Author": "Percy Smogg", "ReviewID": "R28TX0NVQ08E64", "Overall": "1.0", "Content": "Took about 250 pictures, then the CCD died. Did a good job while it lasted.", "Date": "August 14, 2009"}, {"Title": "Excellent camera", "Author": "L. Redeye", "ReviewID": "R3FJU7SNR91L2H", "Overall": "5.0", "Content": "I got this camera soon after it was released and I've used it for every occasion since.  Its come with me to 3 different countries and every time it didn't let me down.  It took excellent photographs in ANY condition, even more so than the highly priced and overrated Canon G10.  Its still in excellent working condition almost 4 years later!  Well, at least it was.  My time with this camera ended this weekend after some one stole it.  Even so, the next person will be as pleased with it as I was.", "Date": "March 25, 2009"}, {"Title": "Beware the E18 Error, It's For Real", "Author": "Frustrated Canon Owner", "ReviewID": "R1SJMA5TF8TGCQ", "Overall": "1.0", "Content": "My PowerShot A610 was purchased in March, 2005, and after very minimal use and NO abuse at about 18 months of age developed the dreaded E18 error, which in my case means the lens will not extend when the camera is powered on. Short of completely dismantling the camera I have tried all the posted internet fixes without success. I purchased this camera as an upgrade to the PowerShot A80, which I am still using and am very happy with, even at only 4MP.I am quite sure had the A610 been as reliable as my A80 I would have given it 5 stars. Unfortunately, my most recent experience leaves me with no choice but to give it one star (and I had to give it a one since ZERO STARS wasn't an option); you can't rate what won't work and what the manufacturer refuses to believe is a \"problem\". I would have considered purchasing a PowerShot SX10 now too, but will never buy another Canon product due to this issue.", "Date": "March 1, 2009"}, {"Title": "Great Camera till the Screen Died", "Author": "CaslonC \"CaslonC\"", "ReviewID": "R3ETYD83GAMGXQ", "Overall": "1.0", "Content": "Nothing new to say, just wanted to be counted among the dead camera club. I probably only took 400 shots total, but it died after the warranty was over.", "Date": "February 4, 2009"}, {"Title": "Never had a problem", "Author": "kcbarbie", "ReviewID": "R29JYU7GZ6JQL8", "Overall": "5.0", "Content": "I received this camera for Christmas three years ago and I've never had a problem with it. I love that the screen comes out and can be turned around so that you can see when taking a picture of you and a friend and no one else is a round to take it. It is a little bigger and heavier than newer models, but I can't imagine getting another camera. I take this one with me everywhere I go.", "Date": "December 30, 2008"}, {"Title": "Good while it lasted", "Author": "Tim Wilbur", "ReviewID": "R2G27W1XRPW96C", "Overall": "1.0", "Content": "My trusty A610 has just made the grand transformation from digital camera to paper weight.  I turned it on today for the first time since September to photograph the snowy trees we've got in Seattle and found the LCD blacked out.  At first I thought I had just accidentally turned the LCD itself off and took a few pictures through the optical viewfinder.  However, when I hooked it up to my computer I was able to see that the pictures themselves were black.  Bad CCD, apparently, and not the first of its kind to go bad.Black Screen Of Death.  I expect to be in contact with Canon soon about a repair, and I also expect them to tenaciously hold to their $107 repair fee.  I don't know if I'll be buying any more Canon products - I suppose its up to their service center at this point.", "Date": "December 21, 2008"}, {"Title": "A610 Could have defective CCD chip", "Author": "kncjr \"kncjr\"", "ReviewID": "R2BOPBC8PFDUXJ", "Overall": "1.0", "Content": "This is a great camera as long as you don't get one of the ones with the defective CCD chip.  Canon bought some defective vendor supplied chips and some found their way into this model.  Canon refuses to acknowledge this for this model but you can find many others that bought this camera that have the same exact problem.  Canon fixed some if you get the right person on the phone.  Otherwise you are stuck with a camera that might fail right after the warranty runs out.", "Date": "December 17, 2008"}, {"Title": "Excellent camera", "Author": "S. Daily", "ReviewID": "R2RLH0K3ZHE6FL", "Overall": "5.0", "Content": "This is an excellent camera for the price.  It is the best camera I have used in it's price range (i.e., $150, give or take a few dollars) and the multi angle, flip screen makes taking candid photos much easier since you can hold the camera from positions other than in front of your face (a pretty obvious position if you want to get natural expressions with people rather than nervous poses and cheesy smiles) and opens the door for creative angles, which I personally enjoy.  The macro mode allows very high quality close ups.  The camera is durable.  Plus it's great for children to learn with.  I allow my seven year old daughter to experiment with the camera and she has developed a skill for taking nicely framed photos, many of which could have been taken by an adult who knows cameras.  I can't say enough positive about this camera, though I think that I will move up to the 630 soon as the reviews are very positive there as well and I think the photo quality will improve a bit.  Overall the 610 is a great camera for beginners as well as hobby photographers who might want to experiment with their own creative photographic side.  It is durable.  The flip LCD screen for me is a must (makes self and group portraits easy and fun as well).  A great camera.  No complaints other than the lens cover sticks once in awhile, but tap it and it opens without further problem.", "Date": "December 7, 2008"}, {"Title": "No complaints so far", "Author": "Amazon Customer", "ReviewID": "R3IJSJ5HGJGH2P", "Overall": "4.0", "Content": "I had the camera for the past 3 years. No complaints so far. A little heavy with all the batteries but takes great pictures.", "Date": "October 22, 2008"}, {"Title": "shake...shake..shake", "Author": "Culpitor", "ReviewID": "RF1TUT2ZPGRN3", "Overall": "1.0", "Content": "I want to echo the review by Johnny Damon: \"Features and functionality are very nice, but I cannot get a single sharp image; pictures are all blurry and noisy no matter what setting i use. Like the previous reviewer, I also get the camera shake icon way too often.\" Everything else is great but because this simple defect is inadmissible, I'll give it 1 star only!", "Date": "October 21, 2008"}, {"Title": "Three years and going strong! Great pictures!", "Author": "R. Asphaug", "ReviewID": "R3E01T69IZJCO2", "Overall": "5.0", "Content": "This camera now has some dings on the body from my rough handling, but it's still going strong and taking great pictures and video. I can't say enough about how well it's performed. I have definitely gotten my money's worth.I have blown pictures up as big as 8 x 10 even after cropping, with great results. The color quality is outstanding - I hardly ever have to manipulate the images. (Very occasionally I will punch up the color if I've taken photos in very bright light.)The digital viewing screen that folds out has come in very handy on numerous occasions.When this unit finally dies, based on my experience I'm confident I'll stay with Canon. They seem to know what they're doing.", "Date": "October 3, 2008"}, {"Title": "Not sure what all the complaints are about.", "Author": "Avocado lover", "ReviewID": "R3ADW413K6B4T", "Overall": "5.0", "Content": "I've had this camera for nearly three years now with nary a problem.  It takes the best photos I've ever seen out of a point and shoot, the batteries last forever, and the macro capabilities are incredible.  I've taken 5000 pictures with this camera.  My guess is that if you don't knock it around, it will last a very long time.This camera has a lot of higher-level capabilities and is a great camera for someone that wants a lot of flexibility but doesn't want to shell out for a D-SLR.", "Date": "August 13, 2008"}, {"Title": "Amazing", "Author": "V. Kanamatareddy \"Vijay Reddy\"", "ReviewID": "R2LTENGKKWP8G0", "Overall": "5.0", "Content": "I love this camera. Bought this in April 2006. Picture quality is really good. Though its weigh more than the current sleek models like Canon SDs, I love this camera due to its flexible LCD screen, picture quality. I bought SD1000 recently. But, I feel the picture quality of A610 is better with the same settings.", "Date": "July 31, 2008"}, {"Title": "I LOVED this camera", "Author": "KaiRayne", "ReviewID": "R15F3630GAO233", "Overall": "5.0", "Content": "I bought this camera back in February of 2006 and I took it EVERYWHERE and took litterally thousands of photos and hundreds of videos. I love the quality of the photos and the video. The only thing I did not like about this camera, is the amount of time it took to take multiple photos back to back. I was at a wildlife park and was trying to get some photos of some of the animals and the camera had a delay between photos... it bugged me! But other than that I would buy this camera again, if I didn't already want to buy a different one. I do miss this camera though, I dropped it while at the zoo and it broke. This is a great camera for beginners. :)", "Date": "August 28, 2007"}, {"Title": "Excellent", "Author": "Juan G. Vargas Garcia", "ReviewID": "R2QS8TAHQD8G6D", "Overall": "5.0", "Content": "After more than year or so, i been using this excellent camera! recently y prefered to buy a U/W case for scuba photography instead on buy a new one with more MP.Batteries lasts as manual spec shows, about 300 pics! and uses AA!!", "Date": "August 8, 2007"}, {"Title": "Had it for over 1 year and still love it !", "Author": "Loves2shop", "ReviewID": "R2I4GAOWWBN43T", "Overall": "5.0", "Content": "I bought this camera back in March 2006, specifically for my trip throughout Italy.  It took very clear, vibrant, and sharp images.  I received many compliments on the digital photos.  This was my first Canon camera, as I had always been a Nikon fan, but was not happy with my Nikon Coolpix camera because of the delay it has between shots.  I have had no such problem with my Canon - it is quick and easy to use.  I liked the digital zoom and also the macro function - pictures have come out very clearly for me.I just came back from another long trip and the camera worked as good as it did a year ago!  The photos are beautiful and I took so many photos, that I filled up my 1GB memory card.  I bought some long lasting Energizer Titanium batteries and they lasted throughout my trip - and I had turned the camera on and off quite a bit (everyday for 2 weeks)!I have not had a problem with the little floppy cover for the USB port like everyone else has mentioned - you just need to be careful with it and it snaps back into place every time.The only drawbacks to this camera is outside night shots - they don't come out as well as daytime shots and it is a little bit bulky/heavy (for my tastes, but I am comparing it with my really small Nikon Coolpix 775), especially with the 4 AA batteries it needs.In summary - I love the camera for the $200 pricetag (what I paid for it in 3/06) and would highly recommend it to anyone who wants an easy-to-use camera with lots of functionality, and wants clear and vibrant photos.", "Date": "June 7, 2007"}, {"Title": "Excellent Camera", "Author": "Peter B. Kingman", "ReviewID": "R12YEASB5SY19A", "Overall": "5.0", "Content": "I have owned a Canon Powershot A610 camera for about a year now.  I have  taken literally thousands of still pictures and hundreds of videos.  This device has never failed once.  It is kind of amazing.  Only flaw is the crappy rubber flap that protects the DC IN and A/V Out holes.  This is my third Canon camera.  All three have been great.  I hope that Canon maintains the quality I rely on.  Just don't let American labor unions get a foothold in any of their manufacturing plants and we will be OK.Update: Now about 15 months later the A610 is still cooking but after more than 27,000 shots and 51 GB of AVI video the camera is starting to act a little flakey.  It freezes up on occasion.  I have to pull the batteries and then reinsert to get going again.  I think I got good use out of this thing.  Time for a new Canon camera pretty soon perhaps.", "Date": "March 22, 2007"}, {"Title": "good camera.", "Author": "A. Lauder", "ReviewID": "RL9RLK3NVY9KA", "Overall": "5.0", "Content": "Only complaint is the rubber flap on the side is always coming open", "Date": "February 24, 2007"}, {"Title": "I love this camera!", "Author": "N. Seltzer", "ReviewID": "R1Q3VSS0N7VZ3B", "Overall": "5.0", "Content": "I have owned this camera for over a year and have had no problems. This camera is perfect for all ocasions. The auto feature is great for point and shoot. The camera has a shoot mode for every type of subject. It really does make a difference to choose the best mode for the subject to get the best picture possible. We have taken many 'portraits' of our new baby boy and they look awesome. The camera comes with more than enough stuff to get you up and running. Make sure you buy a memory card 1 gig or larger(the card that comes with the camera only holds a few pictures) if you plan on taking video, which is also another great feature. If you are just getting into photography like me, there is enough manual adjustments to learn and have fun. I would recomend a Canon Power Shot to anyone looking for a digital camera. I will buy a Canon again.", "Date": "February 7, 2007"}, {"Title": "A wonderful digital camera", "Author": "B. Roberts", "ReviewID": "R338OS5G28UOX7", "Overall": "5.0", "Content": "This is a great digital camera. The pictures come out beautifully. I purchased my camera through another site, but what helped me decide was the reviews on amazon. I looked through the pictures that were posted by other customers, pictures that they took with their camera.I've heard so many good things about Canon, and when I found this one for less than $200.oo I thought I'd give one a try. I have not been disappointed, yet. Seems to be a pretty durable camera.The camera we had before this one used up the batteries rather quickly, so, what I decided to do is buy some rechargable batteries and a charger to save on batteries. It does quite well with the batteries I have. I bought the Monster brand of batteries and charger, and they go for a long while on one charge. I would say upward of 300 pictures per charge. I usually have the camera set on the largest size of picture (2592x1944 resolution) I have a Toshiba 512MB SD card that seems to work exceptionally well with my camera.If you haven't yet, take a look at some of the images that are posted here from other customers. It's an amazing little camera that I'm pleased to own. Canon has won over another loyal customer (provided they continue to make quality products at reasonable/fair prices).", "Date": "January 24, 2007"}, {"Title": "A very good buy", "Author": "John Miller", "ReviewID": "R9G5C1IBLR6TU", "Overall": "4.0", "Content": "I was pleasantly surprised to find a very good digital camera for this price. We have no complaints. I had read that this camera was hard on batteries. We took it to Italy and took over 300 pictures before needing to replace them.", "Date": "January 10, 2007"}, {"Title": "Canon Powershot A610 5MP Digital Camera", "Author": "C. Burgin", "ReviewID": "R2MS6WY78Y1NNO", "Overall": "5.0", "Content": "Best Camera ever! Great price, great pics. I couldn't be happier! I am not a great photographer but almost every picture I took with this camera (and we are talking at least 500)was beautiful! Bought it for a once-in-a-lifetime vacation and it captured the scenery perfectly! I will NEVER use a regular film camera again!", "Date": "January 9, 2007"}, {"Title": "I'm happy", "Author": "J. Karasek", "ReviewID": "R39N6W6ZTO0EL7", "Overall": "4.0", "Content": "I'm pleased with this camera.  It takes pretty good pictures.  I think the learning curve is a bit steep though.  I still haven't been able to eliminate the red-eye problem entirely, even though I'm sure I've played with every setting imaginable. If you buy one of these, get a good case for it.  My zoom lever popped off and I had to send it in to Canon.  Canon fixed it, as it was still under warranty.  I'm happy to say that their customer service handled  my issue very well.", "Date": "December 5, 2006"}, {"Title": "Great purchase - Excellent Product", "Author": "Isaac Ramirez \"Isaac Ramirez\"", "ReviewID": "RI3Y3G5XAT919", "Overall": "5.0", "Content": "This camera simply exeeded my expectations.  It has features for standard and professional users as well. Easy to use, great resolution and lots of shooting modes. You'll get great photos with it. I love it.", "Date": "October 28, 2006"}, {"Title": "Good Experience w/A610 and Canon Factory Service", "Author": "lindguini", "ReviewID": "R10INH7CY2IPMX", "Overall": "5.0", "Content": "I purchased my A610 in November 2005 as a replacement for my Canon A60 digital camera.  I've owned two Canon digital cameras (S10 and A60) prior to upgrading to the A610.  My experience with all three cameras has been very good.  For my taste, Canon cameras have achieved a near-perfect balance of features and image quality.  My A60 turned out spectacular photos; the A610 is a decent upgrade in features and still turns out perfect photos one after the other.  My previous Canon cameras were essentially trouble-free; however, the A610 only lasted five months before experiencing an internal failure that required it to be returned for warranty service.  More on that in a bit.First, the A610 provides great features at an unbeatable price.  It includes the full range of auto and manual exposure controls, an excellent movie mode, and a swivel LCD screen that comes in handy more than you'd think.  The Canon Digic II processor is superfast in focusing and exposure lock which helps you snap quick photos with little shutter lag.  My previous Canons were noticeably slower to lock on and take the picture.  The A610 provides you full control over every aspect of picture control (ISO, white balance, flash intensity, just to name a few).  While the AUTO setting is the easiest to use for most people, I prefer the \"P\" setting that allows me to select a few custom settings to tweak the exposures to my preferences.  Plus, this camera goes for a couple months on a single set of rechargeable AA batteries.  All this in a nicely built metal/plastic body that has a good handgrip but that's not too bulky.Now about my A610 failure.  After five months of routine use (and no mishandling or drops of any kind) the camera suddenly stopped taking pictures.  It powered up fine and could playback previous photos on the memory card but it couldn't take new pictures.  When in the \"shooting\" mode, the LCD was blank except for the menu icons.  When I snapped a picture, the camera took only black pictures (no image at all).  I tried all of the troubleshooting steps but to no avail.  At this point I knew that the camera had an internal failure and so I called Canon Factory Service.  They were courteous and after a few questions they recommended I return it for warranty repair which would take 7-10 days turnaround.  When asked if they would repair my exact camera (I asked twice) I was assured that my serial number camera would be repaired and returned to me.  I was suspicious of this since most companies prefer to send you a replacement (or refurbished) unit because it's quicker and cheaper for them to process.  Either way, their website includes a simple Repair Request form that you can fill out and print to send along with your camera.  All Canon digital cameras go to either Chicago or New Jersey for service; mine was sent to Chicago.  I packaged up the camera as instructed (camera only, no memory card, no batteries, no strap) and sent it off.Within five days I received a notification email and a snail mail letter that confirmed receipt of my camera for repair. Pretty good.  In addition, I was able to track my repair status on their website.  Within the following three days, the status said my camera was repaired.  One day later I received an email with the FedEx airbill number that indicated my camera was on its way to me.  Sure enough, the package arrived on time --the whole repair process from my shipment to their return took under two weeks.  Very good, in my opinion.When I opened the box, I found an A610 camera, my original shipping documents, and a repair order that stated that the servicing techinician had recommended a \"replacement\" instead of a repair for my camera.  Sure enough, the A610 sent back to me was a different serial number than my original camera.  Just as I suspected would be the case.  Well, at least they didn't disappoint but I do wish that Canon Service would have told me that up front instead of leading me to believe that my camera would be repaired.  This may not be a problem for most people (since we really just want a working camera) but when it comes time to upgrade, I like to re-sell my old camera along with the original box, manuals, and accessories.  Now with my new replacement camera, the serial number on my old box and the replacement camera don't match and so I'll have to explain this.  To Canon's credit, the replacement camera they sent me was in perfect condition and appeared brand new (even had the stickers on it) and works perfectly.  However, I believe that technically this camera is \"refurbished\" because Canon marks a small dot next to the serial number on the bottom of the camera.  I have seen this before and it flags to Canon Service that this camera is a refurb if it is ever returned in the future (different warranty applies).  Overall, the warranty process is what I expected and for all practical purposes, it is the best one could hope for.Bottom line:  Great camera. Should you need service, it's likely that you won't get your original camera back but you'll be sent a replacement \"refurb\" instead.  This is common practice for consumer electronics and in the end, is probably the only way a company that sells millions of cameras can possibly turnaround warranty service in a reasonable amount of time.  It is simply too expensive to disassemble, troubleshoot, and repair each and every camera that is returned under warranty (especially when the original camera only cost $200!).  That's life in the electronics age where we demand maximum value for the lowest possible price.For me, Canon stood by their product and returned a perfect working replacement.  This makes a great product even better.", "Date": "June 3, 2006"}, {"Title": "OHH ITS GOOOOOOD!", "Author": "sharmri \"Sharmri\"", "ReviewID": "R144LITVB1BKZ3", "Overall": "5.0", "Content": "I have had this camera for about 3 months now. I was ify bout this camera b/c it wasn't slim like i wanted. but i really like it! if u want a small camera dont get this. but if u want a camera w/amazing pic quality. this is for you.Pros:-Amazing pics-Many settings-Choose how many frames/second u want when recodrin(up to 60 f/s)-it can zoom 16x-durable-Screen flips-Can choose color scheme-Sooo many options!Cons:-It is noisy when shutter zooms, opens, closes-BigIf i could go back i would probably get a smaller camera b/c its more practical for me. but this review is about the camera. and this is an amazing camera. ive been through 3 of them, so i have a pretty good idea. The only reason its not 5 stars is b/c the noise the camera makes. When i take fast moving pics it still comes out great b/c it has a setting called \"kids and pets\". it also has a night mode setting which helps out.", "Date": "April 17, 2006"}, {"Title": "GREAT mid-level camera", "Author": "Frank E. Cutrone", "ReviewID": "R11PP3JZOW2V6R", "Overall": "5.0", "Content": "I am totally pleased, and somewhat impressed, with this camera.  It's price makes it a great value.  There are many different shooting modes, which really enables you to have the camera select the appropriate settings for that particular mode.What I really like about it, is that you can shoot on fully auto and fully manual, with a wide range of options in between.It's a great choice for someone looking for a quality, easy to use camera.  And, it's also terrific for someone looking to learn more about digital photography by using the many modes, including manual, to have more control over your snapshots.Although I haven't used the video mode much at this point, it appears to be quite capable of producing good vids.I would suggest getting a 1Gb card right from the start.  Having the storage is well worth it.  Also, an NiMH/NiCd charger/batteries is a good idea.  I actually prefer a cam that takes these \"AA\" batteries.  In so many reviews of cams with rechargeable sticks, etc., people seem to not like their short batt. life. With this cam, even if your recharge. batts die, you can slip in 4 Duracell's and not have to return a different type of battery to it's charger.Hope this helps ya'.", "Date": "March 19, 2006"}, {"Title": "Great Point and Shoot camera with ability to go manual", "Author": "Jmom", "ReviewID": "R113G1FRWHWLIE", "Overall": "4.0", "Content": "Pros:Very fast between shots, allowing you to take your next shot sooner than on a lot of other cameras (Digic 2 processor)Great in auto mode, but has the ability to go manual.Flip out LCD is awesome! It rotates around and lets you take shots you might not get otherwise.Optional grid on LCD screen to help you line things up.Good battery life.Histogram lets you see if shot is too dark, and you can adjust settings to fix easily.Uploading pictures to computer is very fast!Cons:No live histogram.Some low light shots need to be fixed up in software.Tripod mount is plastic (but not a big deal to me).The included software is very basic.This is a very nice camera with lots of cool features. If you like to play with gadgets, you will definitely enjoy the various options:-My Colors- which lets you make everything black and white except for one chosen color-Sepia-Black and white-ability to adjust camera settings manually or just turn dial to a setting for auto, portrait, landscape, foliage, night scene, beach and many more.I have really enjoyed this camera so far, and my only qualm with it is that some of the low light shots are a little dark. But, I imagine this would be the case with any point and shoot camera.", "Date": "November 8, 2005"}, {"Title": "Amazing value for money. Fast, accurate, sharp.", "Author": "Christian Perversi \"argentleman\"", "ReviewID": "R142GKNUV5VKV", "Overall": "5.0", "Content": "I am extremely pleased with pic quality of my new A610 (and I consider myself very picky).Super fast and accurate focus and exposure thanks to new DIGIC II processor.Very handy maual controls and super video mode at 640*480 @ 30fps.Coupled to 4X lens this point and shoot has to be the best 5 MP on maket for under $300.Used it extensively for 3 weeks and only last night I recharged my first set of batteries (4AA * 2500mah); simply amazing.Love this camera!!! I had a Nikon Coolpix 5200 before this and the A610 is head and shoulders above the Nikon.", "Date": "October 24, 2005"}, {"Title": "Pictures are soft and noisy", "Author": "Johnny Damon", "ReviewID": "RSNVRF1V8CIUP", "Overall": "2.0", "Content": "Features and functionality are very nice, but I cannot get a single sharp image; pictures are all blurry and noisy no matter what setting i use.  Like the previous reviewer, I also get the camera shake icon way too often.  I assume from the generally favorable reviews that the camera is a good one and that I simply have a lemon.", "Date": "January 5, 2006"}, {"Title": "Nice Pictures...watch out for the black screen", "Author": "G. Chichester", "ReviewID": "R2F5RSLS86UI7A", "Overall": "1.0", "Content": "There's no better warning to be made other than saying the camera is great, until you get the \"black screen\". Canon choosing not to acknowledge the issue and repair the defective cameras for little to no cost, is unfortunate.", "Date": "August 3, 2008"}, {"Title": "Annoying Problem With Zoom Browser Software", "Author": "Ellen Ginsberg \"ellen\"", "ReviewID": "R1KOMLO4PWZ087", "Overall": "4.0", "Content": "To use the software that comes with the camera, you have to use an older version of QuickTime (Version 6) than the current version (Version 7).  Apple ITUNES requires Version 7 of Quicktime, so you essentiallly have to choose between using your camera software or ITunes because of this software conflict.This only affects the ability to watch movies taken with the A610, but I can't believe Canon has a released a brand new camera that is dependent on an outdated version of QuickTime.  They have no plans to offer a patch to get around the problem.", "Date": "October 4, 2005"}, {"Title": "Superb camera.  The best  Christmas present I ever got.", "Author": "Eugene Fenlon  BA", "ReviewID": "R39WZZIRUG2O8M", "Overall": "5.0", "Content": "Wow.  What a camera.  With so many functions, pictures can be taken anywhere with professional quallity and ease.  A very reliable camera thats perfect for business and hobby use.  10/10.", "Date": "March 21, 2006"}, {"Title": "Great pictures, no problems after 2 years of outdoor use", "Author": "A. Taylor", "ReviewID": "R2LN2REF6K81XT", "Overall": "5.0", "Content": "I purchased my camera about 2 years ago, and I hear nothing but wows when I show off my pictures.  I have read many bad reviews about the reliability and durability of this camera, but I just don't see it.  I DID, however, purchase the underwater case for it, since I took up scuba diving.  The case has hardly come off since I bought it.  It was fairly expensive, but a worthwhile investment.  I take the camera camping with me, and I go fairly frequently.  Hiking, swimming, biking, and other general outdoor use - this camera has been at my side the whole time, and has not had one single problem.  The pictures are great for a point and shoot camera - I am by no stretch of the imagination a great photographer, but I turn out a gem every once in a while simply with the \"auto\" setting.  People have mentioned problems with the flash cards - I got a 1GB Corsair card (I'm a computer geek, and I'm very loyal to Corsair RAM).  It's fast, it holds a good amount of pictures and video, and again, it has NEVER given me a problem.The one negative thing that I can say is that when shooting a video, it gets fairly grainy when you zoom in.All in all, though, the A610 does everything I need it to do, and well.  I recommend it, but I also recommend getting the underwater case if you plan on bringing it along with you frequently during outdoor activities.", "Date": "May 12, 2008"}, {"Title": "Solid Camera", "Author": "Michael R. Hanneman", "ReviewID": "R1KRGXDC9VI9HM", "Overall": "4.0", "Content": "I should have done this review 18 months ago to help other people.This camera is a solid buy. 5 MPs isn't much by today's standards. I have just purchased the Canon A560 - 7.1 MPs.I have used the camera on several vacations. It performed quite well.I spent more on the older Canon but that is technology for you. If you buy the A610 for a decent price, it will be a good buy. Solid camera.", "Date": "January 1, 2008"}, {"Title": "a very good choice when I bought it", "Author": "David A. Jacob \"Dave the Boss\"", "ReviewID": "R2XU25RNP9LAT8", "Overall": "4.0", "Content": "untill it got stollen I was quite pleased it did a very good job for me took over 2 thousand pics the zoom was a little less that I wanted but it is adequate with in 100 ft the movies were ok", "Date": "July 21, 2007"}, {"Title": "Great Camera Canon Powershot A610", "Author": null, "ReviewID": "R3NLICH6SFD9FV", "Overall": "5.0", "Content": "This is a GREAT camera.I use it all the time and bring it everywhere.I take Pictures of anything from Food to My dog Blue.I sometimes have trouble with the flash but its GREAT", "Date": "July 9, 2007"}, {"Title": "Couldn't be happier", "Author": "Jason Tal", "ReviewID": "R20TB543QOQ016", "Overall": "5.0", "Content": "This camera does everything we wanted it to do,It takes great photosIt is easy to useIt is easy to make adjustments for different photo needsIt is easy on the batteriesIt is easy to carryWe are very happy", "Date": "December 25, 2006"}, {"Title": "Canon Powershot A610 5MP Digital Camera with 4x Optical Zoom", "Author": "Tia M. Cook", "ReviewID": "R2SCSK76EZ1LH0", "Overall": "5.0", "Content": "I love this camera.  Best purchase I've made recently and fast delivery!!!", "Date": "August 10, 2006"}, {"Title": "Great first camera for me", "Author": "J. Hamilton", "ReviewID": "R2J2IW2FKILQB7", "Overall": "5.0", "Content": "I have never owned a digital camera. This one is great, and I am so glad I bought it. So many of my friends, some that know their cameras, tell me I got a good one.  This takes great video with sound, and good pictures. The display in the back is handy and I use it often.  All that I could have wanted from a camera it does.", "Date": "January 31, 2006"}, {"Title": "Manual and software are very bad", "Author": "D. E. Voth", "ReviewID": "R1GZ3SPUB12YVP", "Overall": "2.0", "Content": "Thanks to putting a similar model on my wish list at Amazon.com, I received this model for Christmas.  I believe it's a good camera.  Time will tell.  However, you should be warned that the software is very, very bad, does not correspond to what is in the manual, and is likely to screw up your computer.  So, in spite of the repeated warnings that you \"must\" install the software on you computer before connecting to download the pictures--which is pure hokum--you should not use the software at all.  In fact, it might be okay for managing pictures, but it completely screwed up my computer system, and I learned, as I had expected, that you don't need it at all.  The best thing, for all digital cameras, is to get the PCMCIA adapter and use that to copy pictures into your computer from the memory card.  By all means DON'T USE CAMERA COMPANIES' SOFTWARE.  My experience with Kodak and now with Canon, is that it is not only poorly written, it may well damage your system.  In my case installtion of the Canon software resulted in inability to communicate with other computers on my LAN, and reset my power management options.  Furthermore, the install program never finishes, it continues to recycle endlessly until you stop it.", "Date": "December 28, 2005"}, {"Title": "Very Very Disappointing purchase", "Author": "Benny K. Varkey", "ReviewID": "R33ELDUD3MA89N", "Overall": "1.0", "Content": "I am using Canon Powershot A95 since last 3 years, and I am extremely happy with it. And I have always recommented Canon cameras becuase of its good features and good performance.  And hoping that Powershot A610 is an improved one,(so naturally better than A95) I recommented and bought one for my friend. What a pity! The machine noise when I zoom it, is terrible. I am afraid I will wake up people if they are resting with this noise. In quite places like a church or somewhere I am very hesitant to use it. The cover of USB/AV port is worse than paper. It just does not remain close often and be very careful to press it too hard. It may be a plastic stuff, but more flexible and shapelss than a thick paper. And once I attach the hand string, i cannot close it or open it freely! And i found it really terrible.The SPORTS MODE (or the fast shutter mode) for shooting, which I greatly appreciate is just missing from this 'improved' model.I do not simply understand how could people say that this is a great camera with its terrible machine noise and its disappointing cover of the USB connection.", "Date": "June 17, 2006"}, {"Title": "Bad Customer Service", "Author": "Dr. Craig R. Mcclain", "ReviewID": "R33XM3UIZ8RSSV", "Overall": "1.0", "Content": "I bought this camera because I am a dedicated Canon customer.  I have owned several Canon cameras and have no problem.  I purchased this camera in Jan. 2006 and in Feb. 2006 I had to have it serviced.  The camera would drain a battery charge within 15 minutes of usage and eventually would transfer pictures to my pc.  I contacted Canon who advised me to send it in and it would be returned to me within 7 business days.  I sent it Feb. 3rd and it arrived there according to FedEx on Feb. 7th.  On the the 15th I received an email stating that it would be returned to me in 7 business days (14+ days after they received it).  I told the rep. on the phone I needed it for my research by no later than March 21st.  I called and called when it never came back only to be redirected to a new department every time I spoke with someone.  I was always cordial on the phone, only to be treated with apathy or rudeness everytime I called.  I emailed only to get a 1800 number to call.  I have yet to speak to one person who actually helped or listened.  It was finally shipped but unexpedited before the 21st ensuring that it would not arrive for me to use on this date.  Don't buy if you are concerned with customer service.", "Date": "March 21, 2006"}, {"Title": "Good camera", "Author": "J. Sibley", "ReviewID": "RYREY7S3HXLGQ", "Overall": "4.0", "Content": "Good camera.  Haven't used all of the options on it, but its performed fairly well.  There are some features I both like and dislike about the camera.  It does the job.", "Date": "March 5, 2008"}, {"Title": "Great Service and Product", "Author": "Charlene A. Halstead", "ReviewID": "R2QMTCM9MFS6ZD", "Overall": "5.0", "Content": "The shipping of my camera was fast and it was just as I expected.Very satisfied.Thanks.", "Date": "August 10, 2006"}, {"Title": "pretty good", "Author": "Sudhir C. Sanchi \"Sudhir\"", "ReviewID": "R1H9WD25JI32DX", "Overall": "4.0", "Content": "I bought this camera last month & till now it worked just fine. I have only one complaint. When i try to take a picture in night mode, i need to keep  the camera real steady or else u will get a shaky pic.", "Date": "March 1, 2006"}, {"Title": "Great Camera", "Author": "Lisa A. Evans", "ReviewID": "R98PLQ7NYL0FC", "Overall": "5.0", "Content": "This is the best digital camera ever.  I love it.  It takes awesome pictures.  You won't believe the quality.", "Date": "November 3, 2006"}, {"Title": "Not a good deal", "Author": "tierny", "ReviewID": "R1OWMZGY92S94E", "Overall": "1.0", "Content": "There are many features and controls on this. But what is the point of this rich feature set on a camera that basically takes junkier pictures (on automatic) than my old Sony DSC-S30? The AE (autoexposure) frames still manage to expose my pictures wrong. The Sony with no such \"feature\" never got it wrong. The colors on the A610 are muddy and grey, not vivid. I have to take 5 pix to get enough coverage for one of them to be in-focus. pathetic. And the \"camera shake\" icon is the default state of this thing. What is the point of making a camera that uses it's technology to 'helpfully' tell you it can't take your pictures 70 percent of the time?This thing goes through non-rechargeable batteries like nobody's business.Not a good camera. Not a good deal.", "Date": "July 5, 2006"}, {"Title": "Nice camera", "Author": "J. Miller", "ReviewID": "R2B04FGQ9MAWQF", "Overall": "4.0", "Content": "This camera takes incredibly good pitchers. However, be forewarned that you will get redeye on indoor shots...Yes, you can download the pitchers to your computer and take them out, but it's time consuming if you take many shots (if you like the camera as much as we do, you will). Also, you will not be able to correct the eye color of pets.That being said, for the money it's a great camera", "Date": "January 5, 2006"}, {"Title": "horrible software", "Author": "Mete Yilmaz \"mete\"", "ReviewID": "R311TTAJDE2NRS", "Overall": "2.0", "Content": "Camera is nice and take good pics. But never install the software. It doesn't work and screws up your computer...", "Date": "April 23, 2006"}, {"Title": "It was a let down", "Author": "Arun Kumar \"arun\"", "ReviewID": "R8IHW186HMH6G", "Overall": "3.0", "Content": "I was trying to buy one A95 but could not get hold of one as Canon had discontinued it. One or two shady websites had it with excessive price tags so i finally decided on the new PowerShot A610. It is touted to be the successor of A95 but its a let down compared to A95.I am not a very experienced photographer, but it did not take me long to figure out that objects falling in shade appear very dark. Specially pictures which have a mix of sunlight and shade get spoiled because of this. There was no such problem with A95. Also the pictures and movies taken in night are much darker than it appears on the LCD. I have tried different shooting modes and increased exposure, but so far i am unable to get rid of it. I am still exporing the camera so may be i will find out a way to get around this.Another let down was the cheap finishing of the camera, I was in a bit of shock to see that a brand new product from a company like canon can have such a bad finishing.The processing is much faster than A95 and 4x Optical zoom is very helpful. But over all this was a let down.", "Date": "October 16, 2005"}, {"Title": "Buena relación Precio Valor.", "Author": "MIGUEL GONZALEZ \"webtx\"", "ReviewID": "R1WWLKTXACV0XI", "Overall": "4.0", "Content": "De verdad que la experiencia con la nueva camara a sido genial, la fotos son execelentes, los videos de 640x480 a 30 fps son geniales, para sacarle provecho es recomendable una memoria de 1 gb, entre lo que no me gusto fue el software para el PC ya que te abliga a bajar la fotos con este y no detecta la memoria como una unidad de disco, pero si tienes card reader problema resuelto, el otro detalle es la tapita donde esta la entrada de A/V es como fragil pareciera que se fuese a partir debieron hacerla igual a la de la memoria que es excelente.la recomiendo con los ojos cerrados.saludos.", "Date": "February 1, 2006"}, {"Title": "Disappointed", "Author": "pckauther \"pckauther\"", "ReviewID": "R3ONRRZJ9WEB6K", "Overall": "3.0", "Content": "I bought this camera for my digital photography class thinking that it would be a great investment and turned out to be wrong. Dont get me wrong it has many features, but after two months into my semester my camera pooped out on me. It slowed down. It will take forever to take a shot or focus. Also it is way to heavy to take photos without a tripod you will end up with many blurred photos. So now I am looking for a lighter camera with an imagae stablilizer.", "Date": "May 24, 2006"}, {"Title": "had to return it coz it was too difficult to figure out", "Author": "Rosa A.", "ReviewID": "R2BB5LCT8K7WG3", "Overall": "1.0", "Content": "I bought this camera, and unfortunately, I had to return it.  It came with SEVERAL booklets, and one would just refer you to another.  It was just too difficult to figure out.  I'm a novice, and this was my first digital camera.  I wanted something simple.  I'm sure it's a very good camera for someone with digital camera experience, but this is NOT the camera for a first-time user.", "Date": "November 3, 2006"}, {"Title": "Easy to Use; Great for Beginners or Advanced Users", "Author": "Satisfied Customer", "ReviewID": "R1B5WXIWGSZUB4", "Overall": "2.0", "Content": "I chose this camera for its viewfinder (in addition to the digital image finder) and the stability offered by the battery compartment bulge - you can grip your fingers around the battery compartment to stabilize the camera while shooting. I also like that it uses regular batteries rather than more expensive digital batteries. Took it on a two-week vacation recently and got approximately 180 pictures on the first set of batteries - a plus when traveling! I haven't taken it off the \"auto\" setting yet, but it seems like the advanced features would satisfy any user. It's heavier and a bit bulkier than the more streamlined digitals but I like that. Two nits - since it's a bit heavier than a shirt pocket camera, a longer cord that allows it to hang around your neck would be a plus. Also, when turned vertically, the pics have black borders on both the right and left sides (or maybe I'm just not doing it right). All in all, I love both its ease of use and the picture quality. The Amazon ordering & delivery process was quick, easy and met all expectations.", "Date": "July 19, 2006"}, {"Title": "Buyer beware: red-eye consistent in indoor pictures", "Author": "Stern Fan", "ReviewID": "R1OZBGV9UMNU3C", "Overall": "2.0", "Content": "Buyer beware!  red-eye will be present in majority of indoor photos.  Even with the red-eye reduction and indoor modes \"on\"; red-eye is present in pictures. If the flash goes off expect RED-EYE in the picture. For $300 - one should expect better results.  It's inconvenient and time consuming to manually edit many red-eye pictures.  The edited red-eye pictures either still have some red-eye or the eye appears black.  On Amazon - I have read reviews that Kodak models have solved the red-eye issue.  Learn from my $300 buying mistake.", "Date": "November 10, 2005"}, {"Title": "What an awesome camera", "Author": "Joshua L. Konyndyk \"shajoko\"", "ReviewID": "R31TR3R25A70E2", "Overall": "5.0", "Content": "I just recieved this camera a couple of days ago, and wow. . . I am completely speechless. Cannon, thank you for this product.", "Date": "November 3, 2005"}, {"Title": "Great Features; Made in China Looks", "Author": "Ocean Dweller \"oceandweller\"", "ReviewID": "R2WCR5HV6QV33X", "Overall": "3.0", "Content": "I had an A510 that had some shutter problem. I returned it to Costco (which has one of the best customer services) six months after I bought it from them.I decided on the A610 from Amazon since Costco doesn't carry it. I liked the A510 for its simplicity and the ability to use standard AA (which saves me the hassle of tugging a recharger everywhere). This camera clearly has the best features at its price point.With Canon brand name you cannot go wrong - at least that's what I thought.Although the features are better than the previous model that I had, this one has a finish that reminds me of cheap Chinese DVD players (and the recent Chinese made Panasonic portable LS90s). Not the kind of superior finish that we have come to associate with Japanese products. The aluminum body finish clearly looks cheap.The first digital camera that I bought in 1999 from Canon looks far superior in finish by comparison (but that was Made in Japan).I will keep it for the features but this is not something I am going to be flaunting.", "Date": "October 13, 2005"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B000AYKV4G"}}