{"Reviews": [{"Title": "Amazing value, Amazing quality", "Author": "\"clubraf\"", "ReviewID": "R140OHUDTEGBZQ", "Overall": "5.0", "Content": "I was in need of a better digital camera from my old one.  After searching for some time, I decided to get this model because of the optical zoom and easy to use features.Initial setup with this camera is extremely easy, and you'll be taking pictures within minutes when you first open the box.  Image quality is very good at the 2.1 MP this camera is capible of.  The on-screen menu system for the camera is very easy to use and to change settings.  The movie mode for the camera is also fun and easy to use, and movie record time is limited only to the amount of memory in the camera.  The camera automatically adjusts to lighting levels, and you also have the ability to change color controls and can even change to macro focus modes with the camera menu system.The HP software is VERY easy to use, and the camera even has buttons right on it if you want to email a picture of print a picture right to your printer (all of this an more can be setup with the included HP software).  Battery time isn't the greatest, but I've found I can take around around 50-60 images at higher quality, and you can probably take even more if the LCD screen is kept turned off.  I recommend you buy some NiMH rechargebles if you are going to get the camera, as they are the most economical.  I would also recommend getting a SD memory card for the camera, as the built-in 16MB fills up quickly.Overall this camera is a great value, with easy to use features and image quality that is very well.", "Date": "October 8, 2003"}, {"Title": "Nice Camera", "Author": "Todd M. Sullivan", "ReviewID": "RUIHCNG06FD21", "Overall": "5.0", "Content": "I bought this camera 2 weeks ago, and I am very impressed. I was worried that a $180 camera would not take such great pictures, but I decided to give it a try. I was not disappointed. The picture quality it GREAT,I printed some 4X6s of my images at a photo lab, and they looked almost perfect, VERY close to regular 35mm. I also printed an 8X10, and although it was a tiny bit blurry it was more than acceptable. It has plenty of features for the beginner, to advanced user. The 3X Optical zoom is great, but don't use digital zoom it makes the pictures look pixely. All of the settings such as Image Quality, Exposure Mode, White Balance, ISO Speed, Saturation and Sharpness, are easy to set using the intuitive menu system, or you can let the camera automatically select the best settings. It has a 1.6\" LCD screen for reviewing your images. It also has a video mode with sound that works surprisingly well.  I recommend buying a Multimedia, or Secure Digital Card to save your images, since the internal 16MB only holds about 12 Pictures. I have a 128MB card which can store about 112 pictures. The main problem I have with this camera is that it eats batteries fast. Using standard alkalines it lasted about 15-25 pictures, depending on how much you zoom, use the LCD screen etc... I just bought the brand new Rayovac IC-3 15 Min Charger, and would recommend it to anyone considering this camera. So far I am up to 60 Pictures and the battery is still full! Much better than alkaline. Over all this is a GREAT camera for the price, which is now only $150. I would recommend this camera to anyone.", "Date": "November 11, 2003"}, {"Title": "A fantastic camera for a great price!", "Author": "\"couplandesque\"", "ReviewID": "RUGTG385S9KFX", "Overall": "5.0", "Content": "I'll admit it, I basically bought this camera because it was affordable (I got it for $149.99 at Target), and it had all the features I wanted in a digital camera. It's incredibly easy to use! I took it out of the box and started shooting photos about ten minutes later. There are so many nice features, too. It has a built-in flash (which can be modified to a red-eye reduction setting, a night setting, and other settings depending on what lighting you're using), optical and digital zoom, an LCD screen, and much more. I thought 2.1 megapixels wouldn't work well for me, but I've found that they are perfect for me. Most of the photos I take are just for fun, for my website, for selling items on eBay, or just everyday use, so I don't need to print out photos any larger than 8 x 10. I would suggest buying a larger memory card for the camera if you want to take lots of pictures at one time. Mine came with a 32MB card, and that takes about 35 pictures (if you use the highest quality setting -- more if you use a lesser quality setting). Also, purchasing rechargable batteries is a very good idea, seeing as the camera goes through batteries fairly quickly.Basically, if you're looking for a camera that's easy to use, takes fantastic photos and is affordable...this is the camera to buy. It's great for first-time digital camera buyers (like me).", "Date": "November 30, 2003"}, {"Title": "I Luuuv this camera...I love it! I love it! I love it!", "Author": "\"michele-n-nyc\"", "ReviewID": "R1MNEN40PY0AYS", "Overall": "5.0", "Content": "Why do I love it so much? Because in spite of the fast battery consumption, it delivers what it promises:- Optical AND Digital zoom in 1 camera with auto focus- True plug n play (with my WinXP OS/Suite)- Beautiful hi-resolution pics (lower resolutions available)- Extremely easy to use (for those familiar with digicams)- Movie clips w/audio (only camera w/sound in 2.1MP for $150)- a strong feature rich software program that's very easy to use- lots more options than I anticipated and have yet to exploreI'm a heavy (almost everyday) digicam user and I don't have time to fix pics post-download, so I have to get the picture right almost every time. This is my 3rd digital camera, my first camera was one of the first cameras out there (...) When I started to do research (via amazon, cdnet, zdnet, pcmagazine, etc.) I wanted a camera that was good, solid and an exceptional value. This camera came in the top ten of 4 out 6 editor  surveys I reviewed for the 2.1MP digital camera class. I carefully studied all the minuses and pluses of all the 2.1 cameras in my price range ($130 - $150), and for the price, this camera has more features and is a better quality than any other I looked at.After listening to all the warnings, I bought rechargeable batteries and a 128Mb memory card with the camera. It was the best thing I ever did. On a single set of batteries, with the high resolution view finder on and using the optical zoom in lens (which I love), I was able to take over 50 pictures and a 3.5 sec movie clip of a 16 month old and a 4 year old scurrying about, while using only 2/3 of the battery power. Even when I took action photos the pictures came out crisp and clear, no blurryness, what a relief. The only thing, I have to anticipate the action by a quarter of a second in order to capture the shot I want. After taking all those photos, I forgot the camera at my mom's for a few days and wondered if I would have enough power to download the pics onto my PC.  Not only did I still have enough battery power to download I was able to take some more pics, even with the \"Battery Low\" warning coming on the view finder(something my 2 previous cameras didn't feature). 2 weeks and over 250 pictures later (I'm on my 3rd set of batteries) and I'm still very happy with this camera. The picture resolution, combined with my ability to make adjustments post-download in a solid camera that was at a sensible price, make this an unbeatable value (as what was indicated by most of the editorial reviews I read). So, if you know what you want in a camera and you do your homework/research before hand, you'll probably enjoy what you buy. (...)", "Date": "December 29, 2003"}, {"Title": "Nice pictures, useful functions, poor battery", "Author": "Rodrigo Lopez Schenkel", "ReviewID": "R32LSZG7T17WHC", "Overall": "4.0", "Content": "I tried this camera for 1 month and in the over-all I believe it's a great value. Nice pictures (I use medium quality, wich gives me pictures with great quality and the capability of taking 17 pics with the internal 16MB memory). It has a lot of functions that allow you to take pictures with different lighting conditions, or you can allow the camera to adjust the settings automatically. It takes video, although poor, but works for those tiny moments you wish you had a video camera.The two things I didn't like about it are in first place, battery duration... with a regular pair of alkaline batterys, it lasts a week, if you use it daily. So, I recommend using rechargeable batterys and the AC adapter for the camera. Second, I wish it could have more internal memory, but you can solve that with an extra memory card.As I said, in the overall it is a great camera for the price.", "Date": "April 12, 2004"}, {"Title": "An easy choice for a first- time digicam buyer.", "Author": "Ben Rowland", "ReviewID": "R3R24HX9ACCQSR", "Overall": "4.0", "Content": "With the price of digital cameras now within reach for most people, it is tough to decide on which one to go with. I am nothing more than a casual user of cameras, and am not in need of one with loads of bells and whistles, nor can I justify spending an arm and a leg on one. The HP 635 was the camera I decided to go with and am so far very pleased with it, despite a few technical flaws. The biggest selling point of this camera is that fact that it is one of the most user-friendly on the market. The intuitive design and menu system makes operating it right out of the box very easy, and you will be shooting pictures in no time. Everything function is controlled by a series of buttons on the back of the camera. There are four function keys (even one for printing, if you have the camera hooked up to a printer), a flash and video control key, and 4-way navigation keys with an \"OK\" button in the middle, like the ones found on DVD remote controls. The menus appear on the LCD viewfinder and are easy to navigate. Adjusting the picture quality, setting the color scheme, and deleting pictures in the memory are just a few of the functions made easy with the menu system. The camera comes with 16 MB of internal memory, but it can be expanded using the memory card slot. Everything you would expect from a digital camera is here, making the HP 635 a great value.The pictures themselves are excellent quality, even at the lowest image quality setting. The optical zoom (which I recommend over the digital zoom) and auto focus allow you to get the best quality pictures with minimal effort on your part. What pleased me as well was the imaging software that came in the box, which takes no time to set up and is easy to use. The images take no time to be downloaded to your computer, and the imaging software provided helps you re-size and edit your pictures quickly and easily. The USB cable is provided with everything else. In terms of functionality, this camera has been nothing short of stellar so far.Having said all the praise, there are a few flaws that might dissuade people who would use this camera frequently. For starters, the battery life is horrible. Since the camera has a high-resolution viewfinder and moving parts for the optical zoom, the batteries don't last very long. If you are taking pictures a lot, you will probably have to replace the batteries every 1-2 days (I am not kidding). The minimize this, avoid using the LCD viewfinder too often, or playing with the optical zoom too much. The other flaw is that the 16 MB internal memory doesn't hold much, especially if you are taking pictures at the highest quality. It can hold 12 pictures only on the \"Best\" setting, while having it on the lowest (\"good\") will allow you to hold 80, which is better. If you insist on the best quality, you will have to buy an extra memory card.Since I am not a heavy camera user, I had few beefs with the HP 635. The abysmal battery life and small capacity are slight turnoffs, but they hardly make me regret buying this particular camera. If is well made, easy to use, and reliable. For first time buyers, I highly recommend it for both the value and functionality.", "Date": "December 28, 2003"}, {"Title": "You get what you pay for", "Author": "W Coats \"wijoco\"", "ReviewID": "R3H5XXBR09MDNH", "Overall": "3.0", "Content": "This an acceptable digital camera, not much more. It's a solid value if you find it for less than $75 or so, but I personally would pay more for a Kodak or Olympus with similar specs next time around.Pros:-Low price-Reliable 3X zoom-Good outdoor capabilities-Reasonably logical navigation menus-Excellent USB connection and PC photo download/edit softwareCons:-One of the worst battery-eaters I've ever used-Poor color saturation: certains blues and greens are way off and can't be corrected-Dumb firmware programming: Forgets all settings when switched off (even with batteries installed) and occasionally bugs out. There is also an error in the brightness modulation.-Pretty poor for closeup work: misinterprets light levels and more often than not can't capitalize on its 2 MP power.Overall, it's a good value if you pick it up cheap enough, but next time I won't look for an HP camera any more than I would a Kodak printer.", "Date": "January 11, 2005"}, {"Title": "Battery problem a big downer", "Author": "TingTahWan", "ReviewID": "R3DI5J82F6F21N", "Overall": "2.0", "Content": "If you're having a problem with the battery life, judging on other reviews, you aren't the only one.  This camera does work decently when the batteries are working.  It takes video with sound in addition to the pics.  If you have a HP computer and printer like me, the software loading pics/video is even easier.Here's what I have found is a way around the battery problem:Keep 3 sets of rechargable batteries. (I use rayovac IC3 6 total)The moment you put the batteries in the camera, it starts sucking power whether it is on or not!  IF I limit my viewing of pics already taken and take pics without the screen on, the batteries will last about a day (40 pics).Leave the batteries in the camera overnight.  By the next morning, the batteries will be dead or close to it.  Take the old batteries out, and put new charged ones in while the others charge.  The reason why I keep 3 sets is in case I use one up too fast.Hope that works!", "Date": "May 13, 2005"}, {"Title": "Great camera", "Author": null, "ReviewID": "R3T12T7IWDVVMA", "Overall": "5.0", "Content": "This camera takes very good pictures and is very easy to use. It has alot of features that anyone can master in a short time.HP has done a good job with this device and I would recommend it to anyone now getting into the digital photography hobby.As the other reviewers mentioned, it is a must to use rechargeable batteries and get more memory.For the price and features, try it and you will be impressed.", "Date": "January 14, 2004"}, {"Title": "Not too shabby; one complaint though..", "Author": "T. Kwan", "ReviewID": "RVWUFGXMG41HG", "Overall": "3.0", "Content": "I wouldn't call myself a [digital] camera expert. I have a few friends with digicams and this my first one. All the features on this thing are great! Lightweight, practical, and it's not too slow taking pictures or loading them. It's fun to play around with, too. My camera drained AA's like nobody's business; but then I got rechargeable ones. Still, the battery power is a problem-- Enough to make you conscious of how long you leave it on, and how much you use the screen (which drains more power) rather than the oldfashioned viewfinder. Hope this helped, and GOOD LUCK with your search!", "Date": "June 23, 2004"}, {"Title": "Perfect All in 1 Camera", "Author": null, "ReviewID": "R3KR26SERFUI86", "Overall": "5.0", "Content": "The HP 635 is everything you need combined into a sleek, easy to use, bar-none great quality camera.If you use other HP products, even better. Loads and prints in a jiffy.Don't sell yourself short by not using the Movie function. It's a blast to make quick video clips on the fly. I suggest getting more memory if you plan on making alot of videos.Enjoy!", "Date": "November 10, 2003"}, {"Title": "Good for the price/bad warrenty service/eats batteries quick", "Author": null, "ReviewID": "RXN338OO8QC5N", "Overall": "3.0", "Content": "I got this camera about half a year ago, and it worked quite well. However, unless you use full optical zoom, the edges of the photos are bent outwards. This camera also eats batteries much faster than my Kodak DX6340 did. I had a problem with the software that came with my camera so I have to use the Kodak Easyshera software instead. Also, this camera records audio videos, but you can only hear the audio on the computer.Through all this, this camera is still good if you can get a good price.BUT MY MAIN PROBLEM IS THIS: HP doesn't offer good warrenty service. When after I had this camera for about half a year, it stopped working, still in warrenty. I went onto HP LiveChat support online and since the people there are from India, it was hard to communicate with them, even online. After confusion and a long wait (about two weeks), they finally sent me a camera that was broken which they \"fixed into perfect working condition\" after saying that they would send me a new one. This camera was still broken when I got it, and they later told me that they only send refurbished ones. I told them this camera was also broken, but they couldn't send me another replacement until they recieved the first broken camera. Even after that and my continued contacting them, they kept on saying \"I am sorry. You will get the confermation e-mail shortly.\" They never sent it and I waited two months without a working camera. Finally, the camera they sent me started working, even though it still doesn't look as good as new.HP couldn't help but leave me without a working camera for so long even though I was under warrenty.One last complaint: When I first got the camera, it was missing the lens cap.IN CONCLUSION:If you want a decient camera for cheep and don't care if you may not have a working camera for a while, this camera is a good buy (if you don't mind the other things I mentioned above also).", "Date": "March 10, 2005"}, {"Title": "Excellent Camera for Beginners", "Author": "\"web-tail\"", "ReviewID": "R3NMOVLIDSWJEJ", "Overall": "5.0", "Content": "This is a nice package for beginning level digital camera users.  The operation is easy and the imaging software is nice.  Would recommend for someone who want to have an easy start into digital photography.", "Date": "February 29, 2004"}, {"Title": "Great Camera", "Author": "mike", "ReviewID": "RY2OV3VNMBM3D", "Overall": "5.0", "Content": "This is a great camera. I have had it for about 2 weeks and the photo quality is awsome. The LCD is bright and clear, and the Movie mode is extremely fun to mess around with. The ONLY problem this camera has is that it eats up batteries to fast. Don't even attempt normal batteries and go strait to NIMH rechargables. Even then make sure you have 4 of them, two in the camera and two on standby. Well worth the money.", "Date": "December 24, 2003"}, {"Title": "Horrible battery life, good camera otherwise", "Author": "Aaron", "ReviewID": "R2LJ9F7V7Y2BFR", "Overall": "2.0", "Content": "This camera takes awesome pics for the value, but you will make up for it with all the batteries you will need to purchase!  I took this camera to a car show after having it for a couple months and took a 10 pack of batteries with me, I used all 10 batteries up within 2 hours and only took about 80 pictures!  True you could get rechargable batteries, but you would still have to carry all of them around with you.  I would reccomend finding another camera that is better on batteries, one that you could get away with not carring a small energizer plant in your pockets!", "Date": "June 22, 2004"}, {"Title": "Garbage", "Author": "JB", "ReviewID": "RPPA83AHGDBQB", "Overall": "2.0", "Content": "I bought this camera in September and it managed to last a whole 3 months before it broke. I didn't even drop it or anything. The batteries fell out of it while I had it turned on. The lens is stuck out, and now the camera won't turn on or do anything. I've tried numerous different batteries, and tried troubleshooting, nothing works. I contacted HP customer service but they were not much help. Essentially they told me that all they could offer me was to trade it in and pay around $200 for an upgraded camera. No thanks, HP. I think I will try purchasing a camera from a company that doesn't sell junk next time. Also, even when this garbage was working, it zapped battery life like nothing I have ever seen before. Avoid this garbage.", "Date": "December 25, 2009"}, {"Title": "HP 635 Battery Problem", "Author": "Jayaprakash", "ReviewID": "R1D2KPGRF6VTM6", "Overall": "2.0", "Content": "This camera does a lot for what u have paid.  I bought this camera a couple of weeks back and there were some problems with self timer 2 shots.  Later I found that those problems are related to the battery and not to the software.  Yes.  It eats up battery very fast, which you cannot afford.  I have 4 NiMH rechargable batteries with me and I can take only around 40 pictures (half of them with LCD off).  Buy this camera if you are planned to use with AC adapter.  Otherwise step away from this product.", "Date": "December 1, 2003"}, {"Title": "BEGINNERS PERFECT CAMERA", "Author": "Jeannie   Tanny", "ReviewID": "R2N00ZXY2UCNNS", "Overall": "5.0", "Content": "I WOULD RECOMMEND THIS CAMERA FOR &quot;ANYONE&quot; ANY AGE AS A STARTER CAMERA FOR DIGITAL PHOTOGRAPHY. I WAS GIVEN A MUCH MORE EXPENSIVE CAMERA (DIGITAL) FOR A GIFT. MY FIRST DIGITAL CAMERA. IT WAS A DISASTER. I COULDN'T EVEN READ THE INSTRUCTION MANUAL IT WAS SO CONFUSING. I BOUGHT THIS CAMERA AS A TEACHING TOOL FOR MYSELF. IT WAS PEERFECT RIGHT FROM THE BEGINNING. I HARDLY EVER USE THE &quot;OTHER&quot; CAMERA(IT COST $400).THAT ONE IS LEFT TO OTHER FAMILY MEMBERS. SO FAR NO PROBLEMS. BATTERY SEEMS TO GO ON FOR EVER. I PAY ATTENTION TO ALL INSTRUCTIONS ON ENERGY SAVING. WORKS PERFECT WITH OR WITHOUT THE DOCK FOR TRANSFERING THE PICTURES. NO END TO RECHARBLE BATTERIES. THE SAME PAIR HAS LASTED FOREVER. THANK YOU......JT", "Date": "August 18, 2004"}, {"Title": "You can't buy a better camera at a better price", "Author": "Nicholas", "ReviewID": "RGNSTBTM2T6O6", "Overall": "5.0", "Content": "I bought this camera yesterday and i love it!The screen is great- you won't be able to go back to a film camera. I also reccomend buying a photosmart printer. Then you print your pictures wherever you are and you don't need a computer!", "Date": "November 6, 2003"}, {"Title": "Very bad return money", "Author": "N. Syed", "ReviewID": "R5ZVJ3QVAHJY3", "Overall": "3.0", "Content": "I have ordered this item thinking that this is cheapest price I can get.After I waiting 4-6 days I got the package.But I found that this camara is used one not new. Then I returned back But I got only $88. They have included some stocking fees blah  blah....I recomment to buy some good shops like staples or office Max as they dont send used items as amazon.", "Date": "January 27, 2004"}, {"Title": "bad, bad, ugly", "Author": "A Customer", "ReviewID": "R3AUF9FPVTKI5G", "Overall": "1.0", "Content": "HP635:1. \"Red eye\" mode does not work at all.2. Does not save options.Amazon:1. I can not return this item. I hate Amazon.com and HP635", "Date": "November 30, 2003"}, {"Title": "RESPONSE TO HY4989", "Author": "\"web-tail\"", "ReviewID": "RBPIO9SNKMITM", "Overall": "5.0", "Content": "As I told you on the clarification email, I have BOTH THE CAMERA AND THE PRINTER listed.  I can't understand what your intention is by trying to hurt my reputation.  MY LISTINGS ARE BOTH CORRECT AND I FULLY STAND BY THE STATEMENTS I MADE WITH MY PRODUCTS BECAUSE THEY ARE AS REAL AS STATED.  The email you sent me was this morning and I got back to you this afternoon about the clarification.  And that was what you said,\"Too Late\"?  If I'm a crook and I deserve it, I have nothing to say.  But the fact is:\"I'M NOT.\"  I would not allow people like you just to destroy my reputation at will.  HERE'S MY RESPONSE: MY LISTINGS ARE REAL AND THE GOODS ARE AS GOOD AS I STATED.  I STAND BY ALL MY LISTINGS AND THE PRODUCTS THEY DESCRIBE.  ANYTHING WRONG WITH ANY OF MY LISTING PRODUCTS AND I'LL TAKE THEM BACK.  BEGINNER IN AMAZON: YES.  SOMEONE YOU CAN BUMP AROUND: ABSOLUTELY NOT!Regards,Web-Tail", "Date": "February 29, 2004"}], "ProductInfo": {"Price": "Unavailable", "Features": "2 megapixel sensor captures 1636 x 1236 images for prints up to 8 x 10 inches\n3x optical plus 4x  digital zoom lens (for 12x total) with autofocus\n1.6-inch LCD; capture video with sound that's limited only by amount of memory\n16 MB internal memory; compatible with Secure Digital and MMC memory cards\nPowered by 2 AA batteries (alkalines included, rechargeables recommended); connects to PCs and Macs via USB 1.1", "Name": "HP PhotoSmart 635 2.1 MP Digital Camera w/3x Optical", "ImgURL": "http://ecx.images-amazon.com/images/I/419VEE4RKPL._SX300_.jpg", "ProductID": "B0000A602Q"}}