{"Reviews": [{"Title": "Excellent Value and Wonderful Features", "Author": "AJS", "ReviewID": "RA4ZWL5NLIOZ", "Overall": "5.0", "Content": "There has already been a lot said on this camera so far so I'll only add a few things.  I have never owned an SLR type camera so this was a new experience for me - in fact, after owning the camera now for a month, I am finally just figuring out how to use it to its full potential - and its potential is very high.First, let me say that this camera is an excellent value - 8 megapixels and packed with features, including the wonderful super sonic wave filter (which removes dust from the digital sensor).  The Olympus line of Digital Zuiko lenses are fantastic, including one of the kit lenses (40-150).A word to those folks like me (new to the SLR world) to clear up some confusion: a few of the reviewers have mentioned \"bad low light performance.\"  This is not a camera issue, it is more a function of the lens that is attached (or, the speed of the \"film\" (AKA sensor) that you have the camera set too).  Without getting into too much detail, kit lenses included with all of these entry-level DSLR's are not exactly the best in low light situations - they are referred to in the photographic world as \"slow\" lenses - meaning that the aperture values they have at the low end are really only good in sunny conditions - at least without setting the camera to a much faster ISO (or film speed setting).  So, in other words, the guy that said he is returning his Olympus to go get the canon kit is going to be just as unhappy with the performance of that camera in these situations as he was with the Olympus (from what I've read on the professional reviews of the canon, the kit lens is possibly the worst of all the major manufacturers).  Blurry pictures are NOT the camera's fault - they are the user - set the ISO higher to get a higher shutter speed or buy a lens with a \"faster\" aperture.  This is the same with all cameras.So where does this leave one who is interested in purchasing this camera, well there are two options (at least in my opinion):1.  Buy the 14-45 and 40-150 kit.  This really is an excellent value, and while the 14-45 lens isn't bad (it's very good outdoors), the 40-150 lens is fantastic.  Search any major review - especially those folks that are enthusiasts about olympus and they'll tell you the same - this lens is remarkable for the price.  However, if you do buy this kit (like I did), and you're planning on taking a lot of pics indoors or in low light situations, do yourself a favor and upgrade to the 14-54 f/2.8-3.5 Digital zuiko lens.  This is the kit lens for the professional Olympus DSLR - the E-1.  I purchased this recently and the difference is night and day compared to the kit 14-45 f3.5-5.6.  The camera has no issues in low light situations, and the \"speed\" of the lens is fantastic.  (BTW, I bought this off of ebay for $400 - I think amazon has it for about $430 with free shipping - so it's probably a toss up. (this price BTW is much cheaper than upgrading to comparable lenses of competitors like canon and Nikon - remember, you're going to have to do it no matter which camera you buy if you want good indoor/low light performance).2.  If I had to do it over again, I may have just bought the body.  Save yourself $200 and just buy the e-500 body.  Then take that $200 and apply it to the price of the 14-54 f2.8-3.5 lens - this would put the total purchase around $1000 and you'll have a fantastic lens to really learn how the camera works in all situations.  So how do you get the great 40-150 lens? I noticed that there are probably 10 on sale on ebay at any given time (from people that are upgrading to the absolutely wonderful 50-200 digial zuiko zoom) for around $100-125.Whichever option you choose, you really can't go wrong - this is a wonderful camera for a beginner or serious amateur in SLR photography.Good luck and welcome to the olympus family!", "Date": "January 21, 2006"}, {"Title": "Many blame the hardware but its almost ALWAYS the user.  DSLR market just got competitive.", "Author": "Jamshed J. Khan \"Jimmy Khan\"", "ReviewID": "R1IAL6NIUI1NUY", "Overall": "5.0", "Content": "PP= Post Processing (Photoshop and other image apps)PQ= Picture QualityMy older brother, who by no means is a professional but has been an enthusiast since my father gave him his old Canon F series 35mm SLR in the 80s, has been my mentor.He currently uses a 20D with a 420EX flash and some ungodly multi thousand dollar L series lenses.  I recently purchased the E-500 dual lens kit for a fraction of the cost and must say that my brother and I both agree it is by FAR the best bang for the buck.At the level 98% of us are at it is all user error and not camera error when our pictures don't come out as we would like (most professionals even say its mostly user error or lack of knowledge).  I still have a friend who uses a small 2001-Canon S230 and takes pictures that are far better then most of mine.In low light I have noticed that my E500 does not focus as fast as my brothers 20D (but it definitely still focuses) but from reading online with firmware upgrades they remedied this problem in the E300.We both also agreed that it felt better in our hands (grip and general ergonomics) and was quite a bit lighter then the 20D as well.He ,just as myself, LOVED the rear LCD controls for everything from ISO to flash speed and exposure, far more easier and quicker then the 20D for a newbie such as myself.  But he commented saying it would have been nice if it had the small simple LCD up top that the canons do as a supplement to the detailed and informative one of the back.PQ was amazing requiring very little PP, and with the vivid setting we both agreed that the colors did feel better and more vibrant (of course with a small PP Tweak the 20D was right there but for the casual photographer as myself I shy away from PP).Bottom line we were both floored at what a phenomenal deal this kit is for the price.---------- UPDATED 3/29/2006 ------------Everything said above still holds true, and I must say this is one of the few purchases that almost 6 months later Im still VERY happy with and use it frequently.  Through no advertising or sales pitch I have created 3 new customers for Olympus's E500 kit up to date.My brother has over $4000 now invested in his camera and he still finds it amusing that my little old $700 kit gets as much attention from all our friends as it does.  He recently upgraded to the 580EX flash and a new Wide angel L series lens, and I must admit VERY VERY amazing hardware bursting 3 or 4 pictures WITH flash is very cool.But we recently went to India to tour Agra, see the Taj Mahal, Sikhanders tomb, and other such sites on the way.  At the end of the trip without PP during the day my pictures looked better (we both agreed) and thats all I cared about (mainly talking about color saturation and not detail, just over all presentation).  I will admit though in a couple action shots from our speeding bus his camera did perform better, and in the evening some of mine didnt focus properly while his did on the same subject, but Im not a pro, I just enjoy the hobby.One of my better purchases in recent years.His camera IS better, mine is just a better deal, it's all about peace of mind..", "Date": "November 7, 2005"}, {"Title": "A digital camera for the traditional photographer", "Author": "David Bradford", "ReviewID": "R2EG6DRXPZFSMB", "Overall": "5.0", "Content": "I should preface this review by saying I'm a bit of a Luddite:  I hang on to the traditional tools in my primary fields of interest--music (both listening and performing) and photography.  To me the Nikon F2 (well, OK, I'll stretch my endorsement to something as technically advanced as the aperture-priority F3) are the quintessential cameras: rugged, natural in the hand, and immune to the demons that possess electronic devices.Then four years ago, my father gave me my first digital camera, a Minolta.  I was initially skeptical, but I quickly came to enjoy the convenience of the camera.  Then, when I paired with it the right printer (an Epson Photo R-800), I became a confirmed user, if not yet a fan.  Based on that camera-printer combination (with the addition of a scanner for the conversion of my B&W; negatives), I packed up my darkroom and offered it to the local public schools.But even though I was happy with the print quality of the digital setup, I still missed the heft and the old SLRs, and I lamented the loss of control they offered me.Then, based on fairly extensive reading of advance reviews, I decided to buy the Olympus E-500.This camera is a revelation to me.  I can't compare it to its competitors (none of which I've used extensively), but I can say that this camera fully reconciles me  to digital photography.  It gives me that reassuring \"whump\" when I press the shutter (rather than that puny \"snick\"), offers me total control in manual mode, allows the flexibilty of interchangable lenses, and--most importantly--seems to be to have as its paradigm (sorry for the word choice) the ways of a photographer trained on manual film cameras (rather than catering the \"point and shoot\" audience).The menus are easily mastered, the features (including filters in B&W; mode!) are remarkable, the battery lasts for hours of heavy shooting, and the images--even with the equivalent of a 300MM focal length--are stunning.This is a remarkable camera at a very reasonable price.", "Date": "November 5, 2005"}, {"Title": "Olympus E500 the perfect DSLR entry level.", "Author": "D. W. Robinson \"- PhotoNut\"", "ReviewID": "R2D33GFG4K1AH1", "Overall": "5.0", "Content": "I have previously owned several different long zoom compact consumer cameras.  I wanted to upgrade to higher quality images though, and the E500 with the two lens kit came in at the perfect price and weight point for me. I  don't want anything so heavy that it is a burden to haul around, and the two lens kit gives me 35mm equivalent range of 28mm to 300mm.  I immediatly fell in love with this camera, and can hardly put it down.  It is simple enought for a beginner, but has advanced features that will make a pro happy.  (I used to be a pro)-The most important thing when buying a camera is how it \"fits you\", but the E-500 has great ergonomics and speed, is easy to learn and provides outstanding quality.  You can see  some photos that I took on my very first day out with this camera, at[...]If there is any knock at all, it is that the kit zoom lenses perform better at least one F-stop down from wide open.  But that isn't really a knock, as that is true of most lenses, especially the lower prices ones.", "Date": "October 26, 2005"}, {"Title": "Excellent Value", "Author": "GEEBEE", "ReviewID": "R30984XWD7XKCV", "Overall": "4.0", "Content": "First of all, let's get it clear, this camera is not perfect.  But it IS very good, and at the prices Olympus has been selling it for. It is a downright remarkable value.Size/Weight - As I write this, it is the lightest DSLR on the market.  A major selling point IMO, after a couple of hours 3 or 4 extra ounces can feel like a ton.  Size is about average though.Comfort/Ergonomics - OUTSTANDING The best and most comfortable fit of any DSLR I tried.  It FEELS like a quality camera (unlike the Canon DRebelXT/300D-outside North America), and my hand didn't feel cramped like with the Canon. While the Nikon D70 was almost as good in this category, I'd give the Oly E500 a slight edge. Menus and manual controls are well placed and made sense to me. Learning to use the camera was quick and easy.Viewfinder - A weak point for some, but not me. It is a smallish viewfinder compared to the Canon or Nikon.  But as compensation, I felt it worked the best with my eyeglasses.  The exposure and other info is not very bright in the viewfinder and difficult to see, especially in bright light.Image quality with Kit lenses - Very good with lenses stopped down to f/5.6 or f/8 or so.  A little soft with the lenses wide open, but better than the Canon lenses.  Olympus has always had a reputation as one of the best of the Japanese lensmakers and these kit lenses continue to promote that reputation, I think.Image Noise - definitely has noise issues starting at iso 800.  However it is manageable with software like NoiseNinja and such.  Also how many people shoot at iso higher than 400 anyway?  but If you intend to do something where noise is an issue like concert photography or astronomical phototography, this is not the camera for you. for everyone else, 'fugedaboutit!'.Autofocus - about average IMO.  There is no such thing as a GOOD autofocus IMO. Manual focus is pretty good, but the ground glass optical viewscreen really needs a split image for good focus.Exposure seems dead on accurate no complaints whatsoever.  I shoot raw mostly and the only exposure correction I've been doing is for effect only, not to correct any deficiency in exposure.  All the detail is there.Things I wish it had - better remote control or a cable release socket. A bigger viewfinder, the one it has is perfectly acceptable, BUT. . . bigger IS better. Ability to use standard photoflash connectors without a hotshoe connector (for manual and studio flash).  That's pretty much it.  Nothing really major.I'd buy it again.  Especailly at these prices!Update: 2/9/2008  A little guidance for those who wonder if they should still buy the E500 when the E510 is out and the competition has released cameras with 'better' specs.  In my opinion, it is still a viable option for a beginner especially at the close-out prices we are starting to see.The practical difference between 8 and 10 megapixels is pretty small.  And while the E510 has addressed the image noise issue pretty well, many people feel that the E500 still has a slightly better Dynamic Range (the ability to differentiate various shades of gray without being too contrasty or too dull). This can be compensated for by manual adjustements in the E510, but for those who want full auto and are super picky about their photos, that may be more hassle than they want to deal with.The E500 lacks the Image stabilization and live view capabilities of the E510, and while these are nice features to have, I would remind you that people have been taking great photos without them for 200 some odd years. This isn't nearly the handicap that a lack of talent would be!It still takes great photos and it's cheaper than the rest.  It may not be for everyone, but I think it's still worth considering.", "Date": "May 13, 2006"}, {"Title": "What's not to love?", "Author": "R. A Gibson", "ReviewID": "R33UMF2F6CXZCR", "Overall": "5.0", "Content": "Olympus got this camera right.  Great 4/3rds sensor takes crisp, beautiful shots edge to edge.  You have beginner options in the umpteen shooting modes available (check out high key and low key, they're wonderful).  You can save to Compactflash AND/OR XD picture card (you're not going to run out of room on a shoot provided the cards are large enough).  You have advanced options like using the Adobe RGB color space.  Menus are intuitive and smart.  Options you'll reference often either have their own button or are at the top of the menu stack.  Autofocus works very well in all but the poorest lighting conditions.  I've taken portraits, landscapes, sports photos, macros, indoor and outdoor and been satisfied with them all.  Olympus's decision to bundle the body with the two lenses (admittedly Zuiko's lower end stuff... the 14-45mm & the 40-150) gets you a setup you can use for nearly every situation from the get go (Note: an affordable 18-180mm has been released, demand is high and everyone has this lens backordered).  You can shoot at varying qualities, but I've grown accustomed to Camera Raw which this camera supports.  RAW gives you so much more flexibility in correcting your shots after the fact.  Battery life is better than point and shoots because the LCD is NOT used to compose the shot.  You use the viewfinder, as is the case with all dSLRs except for the soon to be released E-330 (April 1, 2006).  Bottom line, I've taken 4000 photos with this camera since late November and I don't have a single complaint.  I use the camera 3-4 times a week and I'll confess if something happened to it now, I'd need therapy.  So if you're sitting on the fence about purchasing this camera, you need not be.  Go ahead, spend the rent money (just a joke Moms, no letters please) and have a blast with a great camera.  After all, what's not to love?", "Date": "February 17, 2006"}, {"Title": "An entry level professional camera", "Author": "George Hooper", "ReviewID": "R2YEEOHMG2ZA11", "Overall": "4.0", "Content": "Greetings,  Welcome to Professional Digital Photography at a reasonable entry level price. The Olympus E-500 combined with the FL-50 flash has all the features that anyone, pro or amateur, would want per a high quality digital SLR.  The only feature missing is a Titanium housing, but at this price, you could buy six E-500s before getting into the Titanium market per Digital SLRs.  Olympus has done their homework and provided fast setups for most picture situations one would come across.  So point and shoot, and the camera will do the rest. It is really hard to take a bad picture with this setup!  But they didn't stop there.  Olympus also allows you to modify the quick setups manually per your creative desires per the moment.  So use the quick setups to get on target, then modify it per your special needs.  The camera comes with the lower end Zuikor 14-45mm and 40-150mm lenses.  Not as good as the high-end Zuikor ED lenses, but much better than any point-n-shoot camera. I keep an Olympus SP-350 in the car,  which comes in handy when you rub fenders with another car!  It is also an 8 MegaPixel camera,  but take the same pic with the SP-350 and the E-500, and the quality is definitely noticeable.  The good news. The E-500 is a quality professional camera at a great price.  The bad news. The accessories cost more than the camera! You can spend $6,000 if you want to goto a 300mm Zuikor ED lens (600mm equivalent per a 35mm film camera).  Even the basics are overpriced per Flash Brackets and Sync Cords.  But if you are looking to find a camera to match your creative talent, it is well worth considering the Olympus E-500.  Who am I? I was a wedding photographer for years using Nikons, Hasselblads, and Mamiyas. I also worked with Rocky Gunn in California, considered at the time to be one of the top ten wedding photographers in the USA. Time and decades have passed, and I've moved on to other more profitable endeavors. Still my heart was in still photography.  And for all my years of experience,  I'm hard pressed  to find a major flaw with the E-500.  So check it out and decide for yourself.Best Regards,George", "Date": "April 7, 2006"}, {"Title": "Very good camera", "Author": "Stephen A. Williams \"Docoptics\"", "ReviewID": "R2FTFAAJRVOE8E", "Overall": "5.0", "Content": "I am new to digital SLR photography, but I have a long experience with 35 mm SLRs (Nikon N80, Nikon 6006 most recently).  I decided to go with the Olympus Evolt 500 about 1 month ago based partly on price (I bought the kit with the additional zoom) and on the EVOLT's extensive feature list (I particularly like the ability to shoot blue/purple/green/sepia) and the unique dust reduction system for the sensor.  I was also impressed at the 8 mega-pixels compared to the 6 for the Nikon D50 and D70s, as well as the compact size and light-weight.  I was also disturbed to hear about certain color problems importing Nikon RAW files into Adobe (giving them a slightly bluish hue) because of Nikon's attempt to force people into their software package.  So far the EVOLT has performed very well (at least comparable to my old film N80).  I love the freedom to shoot limitless pictures without concern for running out of film.  Now I am much more selective about printing (which will save me in the long run).Criticisms:--some difficulty shooting in low-light--takes some manipulation of the sub-menus to select film speeds more than 400--the pop-up flash is a poor performer unless you are very close to the subject--it does do a nice job on red-eye reduction--the packaged software is very limited in function--running in manual is possible, but much more complex than it needs to be (why can't camera makers go back to the old simple match needle system?)--view finder a bit cramped--I think it tends to under-expose by a 1/2 stop for my tasteStrengths:--lots of features very suitable for advanced amatures like myself--fairly fast writing--allows you to shoot multiple frames quickly in JPEG without having a delay to stop to write--intelligent design of small details (for instance, in the two lens kit the lens hoods reverse for storage on the lens itself!  Also, the filter size of the two lenses is identicle, reducing cost on filters that can be otherwise pricey)--lacks top LCD panel (this I think is great as it cuts down the size and weight of the camera--with the large LCD on the back who needs the top LCD anyway)--intelligent layout of the controls--they are also not to small like the Canon digital rebel--superior feel to the Canon digital rebel product which is flimsy by comparison, but not the tank like weight and feel of the Nikon D70s--easy ability to shoot high and low-key shots--this is a very nice little program to add and makes formerly tricky exposures much easier--can remember your designated preferences for program mode (for instance I have my program setting for Sepia/children/film speed 400/fill flash)  This allows me to shoot simply in the Auto setting (for point-shoot simplicity), but if I want to quickly switch to my favorite preference I simply switch to program and away I go shooting Sepia--hand-holds extremely well in low-light situationsCameras to compare to include the Canon Digital Rebel and 20D, Nikon D50 and D70.  I am not familiar with the Pentax and Konica-Minolta offerings to comment.  I think this camera offers superior design and lenses to the Canon Rebel without the excessive cost of the 20D.  It offers more creative control and higher Megapixels (and I think better kit lenses) than the Nikon D50 at comparable cost.  The D70s probably has comparable features but at much higher cost/weight and lacks the self-dusting sensor.  I would buy this camera again, it has put my Nikon N80 on the shelf perhaps for good.", "Date": "December 12, 2005"}, {"Title": "Great initial value...", "Author": "A. Brown", "ReviewID": "R1NB1691OOOKQW", "Overall": "4.0", "Content": "I purchased the EVolt E-500 late August and so far it has been an excellent choice. Below is a summary of likes and dislikes:- 2.5\" LCD, clear, bright (even in sunlight, just got back from Hawaii so I know)- Relatively fast camera for continuous shots.- Built in modes and scenes provide easy setup for the common situations you might run into (sunsets, candlelight, beach, etc)- Anti dust system works flawlessly- Feels like a SLR Film camera (good when you have big hands)- Good weight- Great battery life- Two lens kit with camera is an excellent value!What I don't like:- Auto-focusing during shots of low light landscapes (e.g. sunsets) using the 40-150mm zoom lens can cause the focusing to become confused- Manual mode adjustments could be a little more straight forward- Lack of USB 2.0 support (get a card reader)- Manual focusing just doesn't feel natural- Position of some controls can cause accidental activation while holding the camera during a shot.- For Olympus: Include the Eyecup Magnifier as a standard feature!- Limited lens selection and vendors (can you say \"EXPENSIVE\")I really like this camera and I feel it was a good choice for me at the time.  However, like technology often does, it changes after you made your purchase!Several vendors released 10-Megapixel camera about three weeks after I made my Olympus purchase all with the Anti-dust system and 2.5\" LCD displays.  I probably would have looked more seriously at the Canon Digital Rebel XT or XTi had the camera not felt so small in my hand (both versions have been rated very high).  Sony and Nikon have some very impressive DSLRs that are reasonably priced.Canon, Sony, and Nikon all have a larger selection of lenses and those lenses are more reasonably priced than Olympus.  The Olympus lens selection is very high quality and pure \"digital\" but the lack of third party lens manufacturing is keeping the price \"too high\" for most people (unfortunately that includes me) due to (my personal belief) the \"Four Thirds\" lens technology.Still; a nice DSLR camera, great to hold, easy to use, fast, shooting 250+ pictures a day with little to no affect on the battery, and a great out of the box price with two very nice lens selections.  Hard to beat!", "Date": "November 6, 2006"}, {"Title": "step up from P&S;", "Author": "E. K. Arnold \"amazon hunter\"", "ReviewID": "RQDP00Q9T6Q5Q", "Overall": "4.0", "Content": "First of all, i don't own this camera--i have the nikon d80--but a friend of mine does and i've been able to compare both side to side. no, the E500 isn't a better camera than the d80 (wishful thinking), but it's one of the best values in the entry-level dslr market. if you're thinking about it, consider the following:--do you want something more advanced than a point and shoot, but less than a professional DSLR?--are you a \"prosumer\" who will be happy with kit lenses, and is not likely to outlay thousands of dollars on pro glass, at least initially?--is your budget between $500 and $1000?if the answer is yes, definitely consider this olympus. Compared directly to the d80, the e500 didn't embarrass itself (which is saying something), and outfitted with the 50mm zuiko prime, takes just as sharp flicks as the Nikon. interestingly, oly's color system favors yellows and greens, while nikon is big on reds and blues. thus, the same shot taken with the e500 and the d80 looked different. this comes down to personal preference, although i believe you can tweak these settings a bit in menu if it's a major concern.the plusses to this camera are:-good-to-excellent picture quality.-full manual controls, plus Aperture, Shutter, and Program modes, and various scene options (landscape, night shot, sports)-bulb setting for long exposures.-SLR-like feel and ergonomics; the E500 looks like a \"real\" SLR, not a toy, and has a nice, solid heft without being too heavy.-a wealth of advanced menu options (which might be overwhelming for newbies).-comes with a 2 lens kit covering 28-300mm film equivalent (due to 2x conversion factor).-more megapixels than nikon d40/d50 (8mp is plenty of pixels for large prints); same MPs as rebel XT (although MPs don't necessarily equal image quality, despite the fact that that's what consumers are led to believe)-takes CF and x-D cards.-has a hot shoe for external flash.-dust reduction system (which nikon lacks).-extremely low noise at ISOs up to 400; has auto ISO feature; can shoot at 1600 ISO if necessary, although you can expect more grain than fine detail at that setting.- 2x conversion factor a boon to telephoto enthusiasts and wildlife shooters, since it effectively doubles your range. pair this with a long telezoom and you'll be seeing the whites of bird's eyes.-if you have manual-focus oly film lenses, a digital adapter is available.-the price. it's already $150 less than what my friend paid six months ago, and the price can only drop further. definitely a deal, considering what you'd spend for a similar body/2-lens kit from other manufacturers.the minuses are:-not as user friendly as nikon d-series; complicated menu means steep learning curve for first-time DSLR users and P&S; converts. reading the manual is a must!!!-average burst rate for a DSLR (Oly claims 2.5 fps, faster than most P&S;'s but not as speedy as the nikon D80 or the canon xt's).-at high ISOs--800 and up--superiority of nikon is evident.-only one jog wheel dial (a sure sign of an entry-level dslr).-many functions require fiddling with menu settings (rather than external controls), which can be frustrating when you're trying to get \"the shot.\"-no image stabilization feature (which pentax and sony have, as well as many high-end P&S; digitals).-built-in flash isn't great (strongly recommend external flash, like Oly FL-36).-kit lenses deliver mediocre low-light performance; the 14-45's aperture is a sloth-like 6.3 on the long end, far worse than the 40-150 which is 5.6 maximum fully zoomed out even though it covers a longer range.-2x mag. factor adversely affects wide-angle capabilities. if you want to go wider than 14mm (28mm film equivalent), you're looking at outlaying  the price of the camera or more for a wide prime or zoom.here's the catch: if you want comparable DSLR performance from the oly, you'll have to pay a pretty penny for higher-quality lenses, which really depends on your faith in oly's 4/3rds system, which it shares with panasonic and leica. at first, the 4/3rds selection was sparse, but as of 3/10/2007, olympus has just announced several new zuiko zoom lenses to go with their aftermarket offerings: a 12-60 (24-120 equiv.), 50-200 (100-400 equiv)and 14-35 (28-70 equiv.), all with an ultra-quiet motor oly calls \"SWD\" (basically serves the same function as sigma's USM or nikon's SWM) and a 70-300 (140-600 (!) equiv.). this shows they are serious about playing in the dslr arena and should inspire confidence among entry-level users that oly's commited to its product line. these new lenses aren't cheap, but with wider apertures (as wide as f/2.0) and quick internal motors, they could rival canon and nikon's offerings. there's still no IS/VR equivalent offered, but the pot just got sweeter, especialy for those who don't want to jump on the canikon bandwagon.lens options aside, the E500 is aimed more at the casual user who wants to look like a pro without spending pro dough. More to the point, to really unlock the full potential of this camera, you're going to have to take some time really learning the functions (and maybe researching terms like aperture, shutter speed, and iso). and of course, by the time you figure out the manual, there will probably be a lot more lenses available. for a P&S; user who wants to take exhibition-quality shots right out of the box without having to adjust every setting, this isn't the camera for you (that camera may not exist). For a film shooter converting to DSLR, the E500 will deliver adequate-to-very good performance without breaking the bank.for the majority of users who want a high-quality, if not super high-end, camera, with some flexibility as far as options, at a value price, the E500 deserves a long look. However, if budget is your primary concern, i'd also check out some fixed-lens superzooms, like the Canon S3 IS Pro (6mp/12x zoom), and the Panasonic DMC FZ50 (10mp/12x zoom), which both have image stabilization, deliver near-DSLR performance, and have most (but not all) of the same functionality as the E500 at a lower price -- hundreds less, in fact. But if faster frames per second rates and having options like super wide-angle, long telephoto, and lower aperture numbers appeals to you, then you'll want to go DSLR.if you do get this camera, make sure you get at least a 2GB card with a fast writing speed, which will improve performance and decrease lag time between shots. also, if you have the loot, definitely consider buying the body only, and starting off with one or two of the premium lenses. with the 12-60 and the 70-300, for instance, it's possible to cover a focal range from 24-600 with only two lenses.", "Date": "March 12, 2007"}, {"Title": "Best deal", "Author": "owookiee \"owookiee\"", "ReviewID": "R2YWRL50PV8JPY", "Overall": "5.0", "Content": "I'd been scoping out digital SLRs for a while, reading up extensively on the technical reviews, and finally chose the Olympus E500 over the equivalent Nikon and Canon.  What sold me on it was the relatively identical quality shots produced, the lower price, and the new Four-Thirds system, which I think really sets it apart from the other digital SLRs out there (if you're not familiar with 4/3, PLEASE read up on it).  Battery life has been awesome, even with lots of flash and LCD reviewing.There's two things I would change about it:Autofocus in low light - you can use the annoying strobe flash to aid it, but otherwise it doesn't focus well, which surprises me because my Olympus C-60 has no issue with this.Lack of a \"Supermacro\" - this is understandable as you can get a macro lens for it, but again, the lesser model C-60 has this feature built in, and so if I need to get a super close shot, I revert back to my C-60!", "Date": "February 25, 2006"}, {"Title": "Very happy with my purchase", "Author": "John Klopp", "ReviewID": "R2A86WQGBCJBK7", "Overall": "5.0", "Content": "As an amateur photographer who has used a conventional film SLR (Olympus OM-1) for years and transitioned to digital with a lesser camera before purchasing the EVOLT E500 kit, I think I made the right choice.  The overall package of picture quality, camera construction quality, logic of controls, and general \"feel\" is right where I hoped it would be.A couple of more specific comments:Some reviewers have commented on the relatively small viewfinder.  I was concerned about it before seeing the camera, but as soon as I started taking pictures I realized it was not an issue.  I wear glasses most of the time and it is not a problem.  It can be difficult in brighter lighting to see the information to the right of the image in the viewfinder, though.I find the menu system, particularly the ability to jump quickly into any part of it via the viewing screen, to be well done.  There are several pathways available to changing settings.The kit lenses are only so-so.  Not long after I bought the kit, I upgraded to the 14-54 and 50-200 lenses, which are truly excellent.  Probably should have bought the body only and gone straight to these lenses.The auto white-balance button is easy to press accidentally while taking a hurried action shot.  It just takes a bit of practice to avoid doing it.The USB 1.1 means relatively slow transfer of images off the card, but I consider that a minor annoyance.The LCD screen on back is superb.In theory, at least, the automatic dust reduction system is a great feature.Summary:I have no second thoughts about this purchase.  I am really enjoying photography again, this time in the digital world.", "Date": "July 9, 2006"}, {"Title": "I love it", "Author": "Ross Thompson", "ReviewID": "R2H4HDWRU7OVKO", "Overall": "5.0", "Content": "I bought myself the two-lens kit for Christmas, having previously owned a handful of point-and-shoot digitals from Kodak, HP and Fujifilm, and I felt I was reaching the point where I needed an SLR to keep improving. I decided to go with the E-500 for several reasons, including but not limited to:--Good LCD screen, with a wide viewing angle and YRGB histograms available--Excellent tonal response, with the rich colours that Oly are justly famous--Dust filter that, in six months of heavy shooting has worked flawlessly. I've never seen a speck of dust in a shot, and I laugh at Canon / Nikon users when I see them swabbing off ther sensors--Kit lenses about as good as you can expect kit lenses to be--Good power-on and shot-to-shot times--Excellent menu system that (despite some reviews to the contrary) put every setting you could ever expect to change during a shoot at your fingertips--Very good ergonomics - it won't slip out of your hand, and is comfortable to hold (unlike, say, the Rebel XT), has a good weight, and has all the buttons exactly where your fingers expect them to beOf course, it's not perfect, and for less than $1000 (including two lenses!) you can't expect to get a pro-level camera, but I think it hit the balance of features and cost very nicely. The autofocus can be a little sluggish in low light, especially if you've turned off the AF illuminator (which has a tendency to annoy people). The buffer could be bigger - shooting in RAW, you can take about 4 pictures before you need to release the shutter and start again. Noise gets pretty high above ISO 1000, but not many people use such fast speeds too often, and it's no worse than the grain on a decent ISO 400 film, and it's not so bad that Noise Ninja can't make it go away, so it's not an issue.I think I've taken about 20,000 pictures with this camera, and I've never had a problem with it. Certainly there have been badly-exposed, out-of-focus shots, but they're my fault and not the camera's.", "Date": "June 2, 2006"}, {"Title": "Great camera for serious student of digital photography", "Author": "R. Kreis \"livedeadcat\"", "ReviewID": "R3D72RH1S6N2VW", "Overall": "5.0", "Content": "In my opinion, the Olympus E-500 is perhaps the best camera available this season for the serious student of digital photography. It has a rich feature set that provides a student with the full range of adjustments to address most situations a student is likely to encounter. The price of the two-lens kit brings it within the means of all but the most cash-strapped of starving students.  This camera and the academic version of Photoshop should more than accommodate whatever photo projects a student is likely to undertake, excluding underwater and severe weather situations.The E-500 is a sturdy camera, plastic bodied but with a metal internal frame; it should stand up to some abuse.  Students will appreciate the Control Panel LCD, which provides quick access to almost all camera settings. Playback modes include separate histograms for R-G-B and luminance, and clipping indicators for highlights and shadows. File capture options include several compression levels of JPEG, 8-bit TIFF and 12-bit raw (ORF). The kit lenses are not the world's best, but they are certainly competent, capable of producing results that should pass muster for all but the most critical student eye.For students, I think the main limitations of the E-500 include a small viewfinder that makes manual focus a chore and the lack of a wired remote.  Rumors of noise at high ISO settings and slow multi-exposure performance may be true, but should not be a problem for most students.I think students should be careful not to spend too much money on camera equipment at this point in their careers.  True, more money buys better optics, higher performance and better build quality, but that should be viewed in the light of the rapid obsolescence cycles experienced by today's cameras.  Digital cameras should be regarded as little more than computer peripherals, subject to the same rapid technological advances experienced by all computer gear. Why should a student want to spend extra for a fancy camera that will be superceded next season and be obsolete in three seasons?  The premium a student would pay for a higher-tone camera might better be spent on a digitizing tablet (Wacom Intuos3 6x8) or a good TTL flash unit (Olympus FL-36).  I advise students to wait on the high-end gear until they can take it off their taxes as a business expense.Students who drive Porsches to school may disregard all of the above.", "Date": "July 27, 2006"}, {"Title": "Get the camera. Skip the lenses!", "Author": "T. Haines \"Shutter Bug\"", "ReviewID": "R33CNVY3ZUG60P", "Overall": "5.0", "Content": "I bought this very same kit in April.  It's a great kit!  The camera is great, bla bla bla.  I think everyone's already beaten that horse to death. Plenty of reviews here on how great the camera is, and I agree with them.  But I have to say, compared to the other lenses made for the e500 (and other e-system DLSRs), these kit lenses are pretty bad.  The kit lenses are a great starter.  And they're worlds better than anything you'll get with a point-and-shoot.  But having replaced  both of these lenses with better ones, I regret spending the money on the kit initially.  I feel I should have just bought the body, and a separate lens (the 14-54 NON KIT lens is freakin' amazing!).  That's my advice to you.  Definitely get this camera.  The image quality is on par with similar offerings from Nikon and Canon, and it has the same, or very similar features.  But if I were you I'd get the e500 body ONLY rather than the kit.  Buy the body, buy a good lens separately.  Yeah, you'll pay a little more, but the quality you'll get will be worth it.  Especially if you think you may upgrade your lens later on anyway.  Trust me.  Spend a little more now, and it'll literally save you about $200 later.Buying a DSLR means buying into that maker's lens system. You're not just buying an e500 here, you're also buying into Olympus's lens system.  And that's a very good system to buy into.  Olympus Zuiko lenses are incredible, both in the image quality they give you, as well as their performance.As far as lenses go, I'd suggest you buy--seperately--the 14-54 Zuiko lens (Olympus 14-54mm f/2.8-3.5 Zuiko ED Digital SLR Lens for E1, E300 & E500 Cameras).  Careful not to confuse it with the 14-45 lens that comes with the kit.  It's not the same lens at all, and not at all in the same class.The 18-150mm lens may sound tempting, but don't bother with it.  It's of the same build quality, and has the same image quality and performance as the kit lens.  The 14-54 is built like a tank and the image quality will blow you away.Hope this helps somebody", "Date": "July 2, 2007"}, {"Title": "An excellent camera at an excellent price.", "Author": "R. Chari", "ReviewID": "R1Z9YJYN5PH0LR", "Overall": "5.0", "Content": "I've had this camera for about 3 months now and I am still discovering new ways to take pictures. The camera has a bunch of functions that can test any photographers' creativity.Olympus has a bunch of software updates out for the camera. So check which version you have and get the update. The two lenses supplied in the package are really great for the price. I don't think you can get anything cheaper in terms of price especially for the quality a Zuiko lens provides.Battery life is excellent - color renditions are 9.5/10. This camera competes directly with the Canon Digital Rebel XT (350D) and in my opinion beats it in many ways. The ergonomics are great, the camera sits nicely and is the righ size for a man's hand. The Rebel XT felt kind of small at the store. The supersonic wave filter and the 2 lens are the deal makers. If you are in a dusty environment, you'll like this feature.The manual is average. The trigger, shutter sound are all very satisfying and sound just like an analog camera.", "Date": "August 16, 2006"}, {"Title": "Easy to use, takes great pictures, awesome value altogether!", "Author": "M. Stickel", "ReviewID": "R1A2VX4GAEJ05D", "Overall": "5.0", "Content": "I can't say enough good things about this camera kit. I've never owned a still camera before, and I figured I'd jump right into the game with a higher end digital SLR. I couldn't be more satisfied with this camera. I worried about the low light focusing issues other buyers were having, but I didn't have any issues that couldn't be fixed by reading the manual and manually changing a few settings that drastically improved my pictures. I'm very impressed on how simple it is to use this camera. Most people avoid the DSLRs because they're afraid that they're too complicated and too \"professional\" for someone who doesn't really know much about photography. What better way to learn then by purchasing a DSLR, buying a photography book, and learning hands on? If I had to define this product I'd have to say that it's a professional grade product that even an amatuer (like myself) can get professional results from. It's an extrodinary camera, it takes vivid and clear pictures, and for the body, two lenses, a battery, a charger, two lens hoods, a shoulder strap, and software the $ (after rebate) price tag is an unbelieveable value!(If you want to see some pictures I took check out the customer images section. I went to Rocky Mountain National Park in Colorado and I couldn't believe how great my pictures were coming out...I felt like I could get a job for National Geographic!)", "Date": "May 13, 2006"}, {"Title": "Best $$$/performance ratio", "Author": "M. Lo", "ReviewID": "RY5BVJKKSZXTE", "Overall": "5.0", "Content": "Think no further if you have been looking for a low price dslr, this is the camera for you. You will never get the same quality pictures out of the competition at the same price levels. Its competitors bundle low quality kit lenses that will never match the ones on Olympus kits. The 14-45 is as sharp (some even say sharper) as the pro 14-54 2.8-3.5, and the 40-150 is the best amateur tele lens in any system. With this two lens kit it will be long before you think about upgrading. On other systems, you will have to spend twice as much in order to get the same optical performance.Low price doesn't mean lack of features. 8 megapixels, beginner modes, plus all the advanced options pro dsrls have. It is well built and has sensor cleaning technology. Never worry about dust!!Pictures come out great with no post processing, usual in Olympus. Get it, you will not regret it. No camera gives more bang for your $$$.", "Date": "April 5, 2006"}, {"Title": "An Odd Feature Mix, But a Fine Camera", "Author": "James D. DeWitt \"Alaska Fan\"", "ReviewID": "RO18KXIJD9UAB", "Overall": "5.0", "Content": "I'll start by admitting I am a satisfied Olympus 4/3 customer. I have a 2.5 year old E1, the first of their 4/3rds DSLR cameras. I have Zuiko 50-200mm, 300mm, 18-45mm and several other lenses. I bought the E500 body to get more pixels: the E1 has only 5.5 megapixels and for the kind of work I do, that's just not enough.The E500 has a slightly less \"professional\" feature set than the E1, but adds many features that the older E1 doesn't have, including 25 (!) exposure modes and a digital viewing screen on the back that is bright, crisp and a true joy to use. You will want to download the firmware updates promptly on purchase; they help a lot with auto focus and exposures in low light conditions. But except for the firmware update, this is a fine camera out of the box.Pluses: The Kodak KAF-8300CE CCD sensor does a very nice, even exceptional job with colors and tones, and when you keep it at or below ISO 800 there is very little noise even in poor light conditions. The dust removal system introduced with the E1 works as well or better than ever. As I watch my buddies struggle with dust on the CCD sensor with each lens change, I appreciate even more the Olympus dust removal technology. It really works, and is a tremendous timesaver in the field. Finally, the camera is sturdy, ergonomic and the primary controls are convenient.Minuses: unlike the E1, it doesn't have a \"firewire\" port and the single port it has seems to be USB-1, not USB-2. It takes a long time to download photos shot in RAW/SHQ. The solution is to get a card reader instead. The 25 pre-defined shooting modes are simply too many. I shoot mostly in MF/MEx anyway, but I suspect it would take longer to select a suitable \"mode\" than to manually focus and set your exposure.Overall, though, this is an excellent camera and works well with all of the Zuiko lenses. It's a relative bargain, too. Very highly recommended.", "Date": "September 7, 2006"}, {"Title": "The best ever", "Author": "R. Quast \"rquast\"", "ReviewID": "R1E0W4ZZT8SXJ", "Overall": "5.0", "Content": "I purchased the Evolt E500 Two Months ago and have taken well over 1000 photos with out a problem. The camera has many features for the pro and beginner alike. The dual lens kit can not be beat by price or quality its the best. I also like the dual memory card slots I have a 2gig compact flash and a 1 gig xd card and they both work great. The cameras menus are very user friendly and easy to use. I take alot of flower and landscape photos and just love the features the camera offers me. The usb download to the computer is slow be I feel that the images transfer better if done at a slower rate and less chance of some image loss. Olympus has done a great job overall I have tried out the Canon and Nikon cameras and they just do not feel as good in my hand as the olympus does. The weight and size are just right. I have heard a lot of negative about the slow start up time but I have not had an issue with it myself.", "Date": "August 10, 2006"}, {"Title": "Excellent entry DSLR for budget photographers", "Author": "Morgan The Organ", "ReviewID": "R1PHBY75HJQ63W", "Overall": "5.0", "Content": "Like many people, I debated and debated, read countless reviews, and watched prices for weeks... for me, it pretty much came down between the E500 and the 8MP Rebel. (The 6MP Pentax D100 was in the running, too.) Finally, I pretty much decided that based on the reviews for the E500, it seemed like people who know their way around SLR cameras enjoyed it, whereas the complaints mostly seemed to be lack of ease by those coming from the P&S; camp. That being said, Olympus does make fine cameras. So does Canon. So does Nikon. As I saw it, it's pretty much like the old Ford verus Chevy debate: just as many people can tell you why one is superior to the other. When it comes down to it, all cameras (like all cars) have their stong points and their weak points. And depending on what you're using a camera for, different aspects will weigh more heavily than others.For instance, for me, price was a big concern. This is, hands down, the best deal. I picked up a factory demo refurbished 2-lens kit. I don't think I can list the price in the review, but it was the cheapest among the 8MP cameras. And the two lenses are both made-for-digital. Somewhat limited by Olympus' 4/3 platform, but any camera you buy if you want good glass in front of it, you'll be spending as much as the body. Or more. Top of the line lenses are not cheap... anywhere, from any maker. These Zuiko lenses seem solid though, and I can't complain about them. I do wish there were more AF options versus what basically amounts to a center-focus option only. There are 3, but they're very close to the center. Minor irritation, though; just focus on your subject, hold the shutter down halfway, and then frame your shot. Really no different than lining up those two circles on older 35mm lenses.I like the overall ergonomics of the camera. It's just big enough that it has some heft, but not too heavy to weigh you down. (Granted, I'm a 6'1\" guy with average-sized hands.) However, it does feel a little plasticy, but coming from a Pentax K-1000, I think anything will. And having worked at a photography-based company in the recent past, I got a little spoiled on the Nikon D1 series; however, the D50 (and to a lesser extent the D70) felt more like a toy. But the E500 fits in my hands nicely. I actually really like the way the lens sits almost all the way over to one side, with an ample grip on the opposite. Makes for strong handling on vertical shots, even one-handed.Photos are great. Very sharp, very crisp. Colors have a nice vibrancy. Tones are balanced. I've seen a few complaints about noise in higher ISOs, but I didn't see anything too out of line. Plus, there's noise reduction, which takes it down to pretty much nil. Anything that's left, nothing a basic photo-editing program can't take care of in a second. I think the \"blur\" complaints are from people used to P&S; photography. I've shot down to 1/15 or so with no more blur than expected. It's just a matter of knowing how to hold a camera and maintain a firm stance. As someone who loves black-and-white shooting, the color filters for the momochrome mode are a nice touch. They can really make the images pop. I've been happy with the all the settings; it has lots of scene modes, lots of little ways to tweak the images as you shoot, too (high key/low key, vivid, muted, etc). The flash sits up a little higher than other cameras, too, so there's less of a chance of catching shadow on closer shots. The flash can be a little bright and slightly distracting when in auto-focus focus-finding (pre-flash). Again, though, not a huge deal.Now the menu IS a little convoluted. It could be more user-friendly and intuitive. But it's nothing that a reasonably adept photographer can't figure out after reading the manual and playing around a little bit. A second command wheel would be nice, but hey, you're here for an economical camera, and you're going to have to cut a few corners, I guess. All the commands of a second wheel are there, just back in the menu. Some way to set \"hot buttons\" or something could compensate some, too, but again... think value.My only other \"complaint,\" which is more of just a minor annoyance than anything, is the location of the power swith and the rear dial for adjusting aperture and/or shutter speed. Sometimes when changing settings, I'll trip the power and turn it off. Startup is quick, though, so it's not a biggie. And sometime when repositioning myself and moving the camera around, I'll inadvertently change the aperture or shutter (depending on which mode I'm shooting in). Either moving it more to the top, making it harder to turn, or making some sort of setting \"lock\" would help.Anyway, bottom line: if you're a 35mm SLR user wanting to make the switch to digital, and price is a deciding factor, just go ahead and get this camera. It's a solid camera that takes great pictures, and is likely just as good as any of the other--more expensive--options. If you're impatient and just want a better point-and-shoot, get another point and shoot. And if you're a fancy-schmancy professional, why are you looking at this budget camera? ;)", "Date": "April 20, 2007"}, {"Title": "Olympus E500 Digital Camera", "Author": "Maine Rustic", "ReviewID": "R2LUYB9RX09860", "Overall": "4.0", "Content": "This is my first venture into the world of digital slr cameras and I'm very pleased.  The camera feels and handles like a standard slr camera.  The two lenses in the package that I purchased are very good, although I do wish that one of the lens was a macro.  I think the only dissapointment so far is that there are not many second party lens makers out there for the 4/3 lens system.However, overall the price and the camera package are an extremely good buy.This is the first time that I've purchased a camera that was not a Nikon and once I got over the fact that I was no longer a loyal Nikon user, I was able to really appreciate my purchase.  Nice, very nice SLR system.", "Date": "August 14, 2006"}, {"Title": "fantastic", "Author": "Island Girl", "ReviewID": "R1Z7ILS1ADCN94", "Overall": "5.0", "Content": "I have had many digital cameras but this was my first full SLR.  It is easy to use, excellent quality and has every feature I am looking for.  I would recommend getting the camera body without lens and then buying the next step up in quality in the Olympus Zuiko lens if you can afford it.  Any Zuiko lens is fantastic  including the ones that come with this camera but the next step up handles lower light conditions better.", "Date": "April 11, 2006"}, {"Title": "A great way to enter DSLR photography", "Author": "Robin Britain \"Rob\"", "ReviewID": "R2HDXF5NEZQKX4", "Overall": "5.0", "Content": "The quality of the eight megapixel images are excellent, particularly if you focus manually. Using auto-focus doesn't appear to yield quite such good results. The Olympus E-500 isn't altogether an easy camera to use - on the other hand, a thorough reading of the user manual means it's not exactly difficult to learn either. As you'd expect with an SLR, the viewfinder is really accurate and clear, and the screen very good too. The shutter delay is an impressive 16 hundredths of a second - so you have a good chance of capturing the moment you want. You also get lots of options to control the way your photos look. Although it's still the best part of a kilogram in weight, the E-500 together with the 14-45mm lens is a bit lighter than some of the other digital SLRs I looked at, and slightly more portable as a result. The battery life is superb, and the flash is strong. It also has an anti-dust feature, which is a definite advantage.Overall - this two lens package delivers excellent value for money.", "Date": "February 1, 2007"}, {"Title": "OM E-500/Good Deal", "Author": "Larry Mackinnon", "ReviewID": "RSGG4BGFTOQ74", "Overall": "4.0", "Content": "I purchased the E-500 kit with the 14-45 and the 40-150 zooms.  The price I paid for a two-lens kit was less than the price of competitor's kits offering only one lens.Kit lens quality is very good, better in my opinion than either Canon's or Nikon's offerings in this category.The 40-150(equal to the view offered by 80-300 in 35mm photography) is made in Japan while China makes the 14-45.  But they both feel the same, solid.  The camera body, on the otherhand, feels a bit light and I wonder about its durability.  We'll see, I guess.  With a lens attached the camera has a real good feel and is quite easy to compose and shoot with.  Overall, pretty sharp and warm images.  I like what I'm getting.  At some point I'll put down for one of the higher grade lenses offered by OM but for now I think I'm pretty happy.  I can't comment on noise because, so far, I haven't shot in very much low light.  The LCD is big and bright.  I've read other columns referring to the viewfinder as being a bit small.  It's big enough for me. From what I've also read the E-500 might have been knocked for being a little slow, in start-up and from shot to shot.  Well, it's fast enough for me and from what I understand part of the slow start-up has to do with the automatic sensor cleaner.  Slightly slower is a good tradeoff for a clean sensor.  Besides, we're only talking about a second or so.  This is my first digital SLR and I like it very much.  I think most people would agree it to be one of the sweeter deals out there.", "Date": "January 23, 2007"}, {"Title": "YOU GOT IT THIS TIME OLYMPUS!", "Author": "Izzybee", "ReviewID": "R2C0ZPERCYZN29", "Overall": "5.0", "Content": "I have been a long time Olympus Fan! Back in early March 05 I purchased one of the first EVOLT E300's, WHAT A MISTAKE!!!! I hated that SLR! It replaced my C8080 Widezoom. I then purchased the NEW CANON DIGITAL REBEX XT, AWSOME!!!! What an investment that turned out to be. Purchased many options and after all said and done I invested nearly $3000.00. Don't get me wrong I received a lot of punch for what I purchased, EFs 10-22m Lens, EF-s 17-85mm IS Lens, EF 75-300mm Lens, 580EX Speedlite Flash ECT ECT ECT, Got it with the Kit Lens also,....I love all of it! But now I gave Olympus another try,I purchased the EVOLT E500 and it KICKS THE REBEL XT's BUTT! I can't give enough PRAISE to Olympus for the product they have put out here. The EVOLT E500 gives more than what you deserve for the purchase price of UNDER $900.00 at most places for the kit that includes both lens! You won't be disappointed in this set up AWSOME!!!!!", "Date": "December 2, 2005"}, {"Title": "I Made a Better Choice Than I Thought", "Author": "CARRON L. LAFORCE", "ReviewID": "R2JGIHQM4Q6A5M", "Overall": "5.0", "Content": "I'm getting back into the world of photography after many, many years away.  When I decided to purchase a digital outfit, I didn't want an overpriced point & shoot; I needed something that could go from totally manual to 'no brain cells needed' modes with a flip of a switch.  I narrowed my choice down to 3; the Canon Eos Rebel, the Nikon D50 and the Olympus Evolt 500.  For weeks I'd compare then side by side, see what pricing was, try and get the most bang for my buck.  Then I searched Amazon and found a smokin' hot deal on a 2-lens kit.  That was the deal maker.  I've had the camera for a couple months and I just could not be happier.  The online specs of this thing barely scratch the surface of what this camera can do.  It starts off with being completely comfortable and easy to hold (not all cameras have that good hand-fit, ya know) and then ends up with having so many pre-sets that I don't think I'll ever have to switch over to manual unless I want to do some timed exposure work.  This is truly an amazing camera and knowing what I do now, I gladly would have ponied up the extra money to get it - but thanks to Amazon, I scored in that area, too.  If you're looking for a really elegant, intuitive camera that can handle the needs of a more professional workload, this is the one.  I am beyond glad I ended up putting this one in my shopping cart.", "Date": "March 9, 2007"}, {"Title": "Excellent Value", "Author": "Amazon Customer", "ReviewID": "R20LRCBUKG12V0", "Overall": "5.0", "Content": "The two lense package is an excellent value.  This is a well built camera with a ton of features.  The provided lenses are of good quality unlike the kit lenses with other cameras.  I'm completey satisfied with the camera and creativity it inspires.  Like all dslrs it's very easy to take a bad picture with this camera, but with a little practice the results are far better than point and shoots.The only draw back I would say is the cost of Zuiko lenses.  This is only a factor if you need a longer range telephoto.  There is an affordable teleconversion lense available.Great Value!", "Date": "September 28, 2006"}, {"Title": "Great First Time DSLR Package", "Author": "Robert B. Allton", "ReviewID": "R1NXIQ1ICA93B3", "Overall": "5.0", "Content": "Until now I was one of those people who had never owned an SLR type camera. This being my first SLR I was a little worried about understanding all of the settings that are available. I was pleasantly surprised to see that when using the auto settings it does a very good job at taking pictures equal to or better than my point and shoot. The greatest part about this is that now I can work on learning all of the more advanced features yet still switch back to Auto mode when I need to take a quick picture. So far almost all of the dials and menus are very straight forward. If you are experienced using a point and shoot that was made in the last few years then this camera should be a breeze to pick up and use. I haven't opened the manual yet and I still have managed to play with most of the settings and not render it inoperable. I think this is a very good camera for someone wanting to try their hand at more professional photography. As a side note I noticed this camera got a bad review for not being a Nikon or Canon. I read all the reviews by that person and almost 99% were all 1 or 2 stars so I would take that review with a grain of salt.", "Date": "September 21, 2006"}, {"Title": "Great DSLR value", "Author": "Phil @ Amazon", "ReviewID": "R2X1X2KTE808B5", "Overall": "5.0", "Content": "It's pretty hard to argue against this at the prices we're seeing...In short, for not so much more than the high end of the bridge cameras (Panasonic DMC-FZ50, Fuji S9100) you can have this camera with the 2 kit lenses. I imagine that you'll be very satisfied for paying the difference.8MP with 2 pretty good kit lenses for under $650 as of 4/2007, and an upgrade path to the E-510 for all the lenses and accessories. Once you make that upgrade, what's left to ask for except a faster burst mode and weather sealing. That's 10MP, IS in-body, SSWF and live-view.IMHO, even if you're an \"entry-level\" DSLR user, spend the extra $400+ and get the faster 14-54mm f2.8-3.5 lens and get rid of the the 14-45mm f3.5-5.6 lens. The 40-150mm f3.5-4.5 is a very nice lens, with no real peers in the entry-level DSLR range as a kit lens that I could see without going 3rd party. This lens put Olympus over the edge for me. For that speed of lens over that 35mm equivalent range (28-300mm), I'm not sure what else can compete on price.If you have to have a faster lens for the longer zoom, you could cough up the $800+ for the 50-200mm f2.8-3.5, and even then, that's a very, very good price for that kind of lens and 35mm equivalent range.The camera has full manual controls, as expected from a DSLR, and can drive a newbie like me nuts, but can also keep it simple with it's auto mode and numerous scene settings (which I use a good deal).If you get this camera, IMHO, don't bother with the xD cards. They are very slow in comparison to the less expensive CF cards in this camera.When it comes time to get a flash, go the extra mile and get the Olympus FL-36 over the FL-20. I'm not sure that the FL-50's warranted at this price point. I was lucky to find one cheap, so I didn't have to research 3rd party flashes.I confess to having been a pixel-peeper and compared the high-ISO samples from this camera to the Canons and Nikons of the world. It's definitely not bad in direct comparison, but after you're done resizing and touching up the photos, you'll never notice, IMHO. On the down side, the RAW files (.ORF) don't seem to be compressed, and they're not exactly small at 14MB.All in all, not much to complain about here.", "Date": "April 10, 2007"}, {"Title": "Awesome Value!", "Author": "Rick Alan", "ReviewID": "R211F5UQSSSCRE", "Overall": "5.0", "Content": "There were several reasons I settled on the Olympus E-500, some of which were due to the customer reviews from this site.  I researched and read reviews, visited web sites from Canon, Fuji, Sony and Nikon.  I also read reviews about the various lower-end DSLRs from those respective sites.  For the price and features and quality/bang-for-the-buck - there could be no other choice but the E-500.  I received mine on Jan. 18 of '07.  The very first picture I took (camera on full auto) was my goofy face.  I was stunned to see skin pores and little hairs I never knew existed!  For better or worse, the detail I have seen with the two lenses are amazing.  My other buddies (who also have more money than I) have a Canon, Sony and Pentax. I feel that the crispness and color are much better than the aforementioned DSLRs.  This camera kit rocks!  I received so much more for my $$s spent.  Excellent!", "Date": "January 22, 2007"}, {"Title": "A lot more than I expected", "Author": "gabriela velarde bertran \"cookie\"", "ReviewID": "RISROCH5VXKOS", "Overall": "5.0", "Content": "This camera is absolutely incredible. It has so many features I am still getting to know it. One of the features is a SCENE mode. This is a special section of settings like candlelight for low light settings, high key for a lot of sun, children for taking pictures of active kids, night scene for nightime, landscape and portrait among others. These scenes let you take perfect pictures. The candle scene \"absorbs\" the light making the pictures a lot brighter than they would normally be. I cannot believe the pictures I've taken!I went to Europe with this camera recently, and my friends borrowed my camera all the time, by the third day they left their cameras at the hotel and decided to use mine for all the pictures. I kept getting comments like \"lets use her great camera, its much better than mine.\" A lot of people had Cannon EOS cameras, and there is no comparisson whatsoever, this camera is superior in every way.I got so much more than I payed for!!!!", "Date": "January 11, 2007"}, {"Title": "E-500 Kit", "Author": "Larry P. Clark", "ReviewID": "R1TCHV9ENV267B", "Overall": "5.0", "Content": "After having the camera for over a year, I am still amazed at the quality of the pictures the camera will produce when used correctly.  I will say it was a learning curve to understand some of the features, but well worth the time spent on them.  Camera have worked flawlessly since first out of the box.  I have added a 55-200mm Sigma lens and FL-30 flash with great results on both.  I think the camera never got the same reviews as the Nikon and Canon SLR's have received, though I would match picture for picture with any SLR in it's category range.  Highly recommend the Olympus camera's, I have bought 4 of them since 1999, all still working.", "Date": "November 4, 2006"}, {"Title": "I love this camera - My favorite new 'toy' and first SLR", "Author": "Vic Lovan \"My first SLR\"", "ReviewID": "R1P5BMM77MWCDE", "Overall": "5.0", "Content": "I've now taken a lot of pictures with this camera.  I bought the kit that has both lenses and have been learning as much as I can and taking as many pictures as possible.  This camera will definitely make the beginner better!I would recommend getting a fast flash card, I have the type II and would like to have the 3 or 4 for those fast action shots, but for now the one I have works ok.  That's not a reflection on the camera at all, as it can shoot very quickly but I believe the card slows it down.  I have some nephews that can out run my shooting in a couple of shots because of this even when I'm using the sport mode.I've uploaded a bunch of my shots here on Amazon and there are many others who have done the same and are very good.  You should take a look at as many of them as possible.  The pictures are easy to find right under the picture of the camera and it has a link to \"See # customer images\".  My favorites are the \"Pink Arch\", the \"spider\", and \"The Thunderbirds\".  Hopefully this will still get posted as it almost has a link in it.  I have a picasa web album page if you want to look for picasaweb dot google dot com / unclebic you should be able to find it.  If not, email me at unclebic at gmail and I'll send you a link.  I'm very happy to share and show off my pictures.  There are a lot of pictures there and more than 99% are from this camera.  I think you'll have to agree that the images this camera takes are fantastic.  I use an epson R200 printer and good glossy paper to print, everyone I've shown them to, gets a look of almost disbelief that a digital camera and a home printer could do such a good job.A girl I know recently got married and said that if she'd known how good these came out she would have just got me to do the photos.  I have no experience with such a thing and I would not have done it, but to me that says a lot about how good this camera is.I don't think you can go wrong with this camera kit.  The only real addition to it other than the compact flash card I would recommend, are a good tripod with a metal mounting head (mine is plastic/nylon and warped this summer), and a polarizer filter (makes the clouds really pop out).", "Date": "October 27, 2006"}, {"Title": "EVOLT E500", "Author": "Fred J.", "ReviewID": "R2SKP7HL0F68XU", "Overall": "3.0", "Content": "I owned an Olympus C 5000 Zoom 5 megapixel camera  before I bought the EVOLT 500 . I was very satisfied with that camera .I know that the majority of the reviews for this camera are very good . That is why I was surprised that the results I have had with the EVOLT 500 were somewhat disapointing . The auto white balance was very inconsistent. I took about 30 pictures within 10 minutes at an outdoor Soccer game . They were all taken under the same conditions yet the picture quality varied greatly. Some were yellowish and some were blue and flat . I was able to correct this by using the custom white balance .I set it at 5000K . After that the pictures stayed consistent . I also have a problem with indoor pictures using the flash. The pictures are quite often under exposed . I now set the flash compensation to +.03 or +.07. This seems to correct the problem . I upgraded to this camera because I take a lot of sports photographs and I needed the higher shutter speeds . I also needed a camera that took pictures at a higher ISO without too much noise . The EVOLT 500 does accomplish this very well.Other than that I honestly have to say I was more satisfied with my C5000 Zoom which cost half as much.", "Date": "July 1, 2006"}, {"Title": "Evolt is best value for the money", "Author": "T. Brian Bates \"bbates\"", "ReviewID": "R2APVEM4LQ37MD", "Overall": "5.0", "Content": "I have been a \"professional\" photographer for many years. By \"professional\" I mean people do pay me to take their family photos, wedding photos, etc. on a part time basis.As a traditionalist I use to use 35mm and medium format cameras. However, expense in both equipment, film and processing made me look to digital.I have used small point and shoot digital cameras for personal use and have loved the convenience.I bought the Evolt E500 kit at a local Sam's Club about 9 months ago.I had looked at many other brands and did not want to spend $3,000 on something I would use once or twice a month professionally.I am so glad. I bought the Evolt for about $660 and I love it! You cannot beat the price for a quality camera and two quality lenses.Take the time to read the manual and buy a basic SLR photo book so you can get creative with the manual settings.I cannot tell the difference in my photos with this camera and competitors from $900-$3,000.", "Date": "May 12, 2007"}, {"Title": "PhotoWolf", "Author": "Music Man \"Aficianado\"", "ReviewID": "R5L5A33FDUKWP", "Overall": "5.0", "Content": "I have had this camera for 4 months now and its an outstanding pro-sumer grade digital SLR.  The Amazon price for this camera body and two lens kit is simply the best price to be found anywhere, and is less than most vendors charge for this camera with a single lens.  No longer do I mourn the loss of my Nikon 8008s 35mm Film Camera.Both lenes have outstanding optics and the metering system is superb.  The included lens hoods are very helpful, but make sure you take them off for flash photography.  The lenses operate quietly and quickly.  They have nice grip.The built-in pop up flash is adequate for close-up snap shots, but you'll want one of the two available dedicated flash units the FL-36 or FL-50.  Don't waste your time or money with the FL-20.  I bought the FL-36, which is a full featured dedicated flash with significant manual overrides just as with the camera to meet your creative needs.  I'm likely to further upgrade to the FL-50 which is a more powerful full professional grade flash.For serious photographers, this camera gives you total manual control that provides overrides for every possible setting to ensure you realize your full creative needs (just as with any professional 35mm or digital SLR).The automatic settings for focus and exposure are outstanding as well.  There are several program modes for various types of shooting and a user program mode where you can essentially make your specific manual settings an automatic set-up.The controls are well placed, except for the the one-touch White Balance and the Auto-Focus frame buttons are right where you may normally want to place your right thumb while holding the camera, especially if you're taking vertical shots.  The large LCD display is excellent and easy to read even in bright light, but be advised that its not for composing and lining up your pictures.  The display is for making your camera settings and viewing the pictures you've taken.  You must compose your shots through the viewfinder only.  The viewfinder gives you gives you plenty of camera setting information along with immediate exposure and composition feedback so you can make adjustments without removing your eye from the viewfinder.The camera shoots in every file format that complete amatuers want and serious professional photographers need ranging from various degrees of quality for jpeg all the way up to TIFF and several RAW settings.  The has shutter speeds that go from manual settings up to 1/4000th and an ISO range up to 1600.The camera is built solid, is very well balanced and lightweight.  It looks great and feels great with a nice grip.  The included Olympus LBH-1 battery has extraordinary life.  I had in the camera for the first 3 months without a change or charge.  In that time I took over 600 pictures, and often found that I had left the camera on when I went to pull it out of my bag for the next shoot.  In fact, during my trip to Ireland during this mentioned timeframe. I basically left the camera on night and day for an entire week and had juice to spare when I got home.  Phenominal!As mentioned the included lenses with this kit (wide angel to normal & normal to long telephoto) are very, very good.  I'm so pleased with the overall performance and capabilities of the camera itself, that I'm definitely going to invest heavily in the professional level lens upgrades.  With the exception of the Macro and extreme wide angle, those lenses are essentially the same focal lengths as included with this camera kit.  However the upgrades are \"faster\" lenses allowing for more very low light levels and a greater ability to capture sports activity.Bottomline, this camera is fantastic and has everything that far more expensive professional cameras have.  Olympus has a full range of accessories for serious and professional photographers that amatuers can work their way up to.  This camera has it all at price that no one seems able to beat.", "Date": "April 1, 2007"}, {"Title": "I could have spent over $1000 for a camera with just as many features", "Author": "C. Alcantara", "ReviewID": "RN8L6HD91NT7J", "Overall": "5.0", "Content": "But my wife would have killed me. For the past couple of years I started to get more into photography as a hobby. When a friend, who liked my photographs so much, asked me to photograph their wedding I decided I better invest in something more than just a little point and shoot camera. After doing much research between the Canon Rebel XT and the Olympus E500 I decided to purchase the Olympus and I can honestly say that I have not regretted it. Not only does the Olympus have advanced features that allow me to experiment with the look of my photos, it also has some functions that are familiar to point and shoot users so that someone like my wife can pick up the camera and not feel intimidated by it. The size and weight of the camera is not too big or heavy and the handle grip fits just right. That's more than I can say for the Rebel XT's small and somewhat cheap plastic feel. Yes there are better cameras out there but are well over the $1,000 mark, but it's great to go to a wedding, take pictures, and have people tell me that my photos came out just as good or better than the professional photographer that they hired.", "Date": "October 12, 2006"}, {"Title": "The little camera that could...", "Author": "C. Ferretti \"tech head\"", "ReviewID": "R2I9F311CFOOYL", "Overall": "5.0", "Content": "This is a great, great camera. It is well put together, takes great pictures, most imporantly, it has good balance, and feels great in your hands.  It has that quality well-built feel, not that \"plasticy\" feeling that I got holding the Canon Rebel XT or the Nikon D50, that made me put them down and pick up their bigger \"brothers\" like the D200.The two lens set is the way to go. For not much more than the price of the E500 camera body, you get two very good lenses.  These lenses are as good or better than the kit ones that are sold with the Rebel XT and the Nikon D50. If you do not possess \"legacy\" Nikon or Canon lenses, give this SLR a try.  It is that good.  The reviews for all of these cameras are all over the place, but the better review sites will post comparison pictures, once you look them over, then make up your mind.  The E-500 has a number of custom settings along with adjustable setting for simultaneous RAW and JPEG pictures, features not usually found on entry SLR's, just check out the Pentax *ist DL.Like the little engine that could.  This is the little camera that could....", "Date": "October 9, 2006"}, {"Title": "A great camera and a great buy!", "Author": "Norman Guilbert Jr. \"Rotobuster\"", "ReviewID": "R2DZJQA0WQ1WR2", "Overall": "5.0", "Content": "I was one of the last holdouts.  I stuck with my trusty pentax K1000 and various Nikons over the years because i was a 'film guy.'  I even went out and bought a professional-grade film scanner and developing equipment so that I could stay a 'film guy' well into the future.  That was until I really scrutinized the photos, which, no matter how carefully I developed and scanned, all had a grainy look to them.  I realized that technology had finally caught up with me, and I needed to get with the program and buy a digital camera.  I'm only a hobbyist, not a professional, but I insisted on an SLR to avoid parallax problems.  All my cameras save one were SLR's of 1970's vintage.  The problem was that the fine cameras in the Nikon and Canon lines were way to pricy for my budget and hard to justify for amateur use; I was almost resigned to one of those consumer-grade units with the built-in non-interchangable lenses until I came upon this camera.  The package came with a body, a 14 to 45 mm zoom, a 40-150 mm zoom, a battery charger and battery, and various wires and software.  I took the camera on a day trip and used it mostly in \"Auto\" (easy) mode, and was instantly impressed with the quality of the pictures, especially their sharpness.  And since they've dropped the price, I suppose to make way for the 10 megapixel E-510, this package is a STEAL.  It has all sorts of programed exposure settings, plus aperture and shutter priority, as well as fully manual exposure.  Bottom line: I think this is the PERFECT camera for serious and semi-serious use, or for anyone who doesn't mind a little extra bulk and weight in order to have great pictures (it is not tiny, it's about the size of a standard 35mm SLR).  I wish the lenses were a bit faster; they are both only f/3.5, but that's quibbling.  Extra lenses are available, in three grades from Olympus but some of them are VERY pricy.  Luckily, the two that came with the kit fill my needs wonderfully.  If you have need of a very wide selection of lens availablility, Canon or Nikon may be a better bet, but if the two lenses included in this package is all you need, you're good to go, and in style.", "Date": "May 14, 2007"}, {"Title": "Excellent dSLR that doesn't break the bank!", "Author": "Lori Otto", "ReviewID": "R2ME25R0A3WG81", "Overall": "5.0", "Content": "I researched and researched before I purchased this camera.  This is my fourth Olympus digital camera (I just keep upgrading), and I am completely in love with my E500.  It's everything I wanted and more.  The camera feels nice in my hands-- substantial, but not heavy.  The lenses take crisp, clear photos, and the viewfinder, though a tad on the small size, is pretty true to what I capture.  I'm still getting used to all of the options-- there are a ton-- and I sometimes have to remind myself to revert back to some options after I've been playing around with it.  It does take a little more time to be ready to use when you're used to a point-and-shoot.  :)  I also bought the macro lens and a remote control... both have been very useful.  I love the wide angle of the 14-45mm and the telephoto on the 40-150mm is fantastic!  I'm just amazed at the versatility that these lenses offer.  I would recommend this to anyone.  :)", "Date": "November 4, 2006"}, {"Title": "Olympus does it again!", "Author": "L. S. Reed \"roadrunner\"", "ReviewID": "R3HBUMT476MA4G", "Overall": "5.0", "Content": "I've admired and had good luck with Olympus products since I bought my first OM-1 back in 1975.  They always seem well designed, functional, and durable.I bought the E500 package about 2 months ago and promptly left on a vacation to the western US, where I gave it a real workout.  It performed outstandingly.  Great, clear view through the eyepiece, good metering, and outstanding optical quality.  As with most new cameras I get, it took a little while to master the menus, but once I got them down, they worked fine as well.Really a great product.", "Date": "July 30, 2006"}, {"Title": "best buy in a digital slr", "Author": "Barbara Magana \"barbwire\"", "ReviewID": "R1SXVO4OLFZITD", "Overall": "5.0", "Content": "i had resigned myself to digital but missed the freedom of my cannon slr. i had looked at cannon's digital slr cameras but did not like the way they felt in my hands. the cost for the body and lenses i was used to working with was more than i was willing to spend, then i saw this, the grip is comfortable and the dual lens set is a bargain! the huge lcd is is an added plus. i live near the ocean and have taken some great action shots. The ease of use and the versatility of this camera make it a must no matter what your level of skill with a slr camera. definitely worth the money!!!", "Date": "August 2, 2006"}, {"Title": "It will capture the beauty of the world around you.", "Author": "J. D. Osorio", "ReviewID": "R3QEQUV9C4BNRA", "Overall": "5.0", "Content": "I have photographed from earthly little creatures to amazing bodies of heavenly magnitude (see the ladybug and the moon photograph in the \"share your costumer images\" file, for example) and I can't help the thought that this is what art-photography is all about! I am no pro. I have no photography background. All I have is just a strong desire to capture the beauty of the world around me and my Olympus Evolt E500 does the job perfectly. Try it! You will be delighted.", "Date": "June 25, 2006"}, {"Title": "Dependable digital camera", "Author": "Digital Man", "ReviewID": "RLQAQ82HY38LH", "Overall": "5.0", "Content": "I purchased this Evolt E500 last fall to use in my Photo 2 college class. I was amazed at the high quality pictures you can take with this camera. Pictures come out very sharp and clear with no dust. I love the dust protection technology on this camera. This camera allows you to select from different picture settings to suite your needs. There is a setting for just about any situation you can think of. I also really like the built in pop up flash and the battery life of this camera. I once took pictures for two hours straight on a battery that was not fully charged. The Evolt's battery never died. Another thing I like about the Evolt E500 is its easy to use with your computer. Just plug in the usb cable and your ready to go. Whether you are a professional photographer, amateur, or photo student this camera is right for you. The Evolt E500 is a very dependable digital camera with great memory capacity and quality.", "Date": "August 5, 2007"}, {"Title": "An Exceptional Camera", "Author": "M. Stewart", "ReviewID": "R1LB35SEH968BN", "Overall": "5.0", "Content": "I purchased this kit about a month ago, and had the opportunity to recently photograph an all day wedding.  I took better than 600 images without any problems whatsoever.  99% of the images are great, while the remaining 1% are the product of photographer error.  This is a workhorse of a camera.  At times I was taking images as fast as I could press the shutter, and the auto focus responded wonderfully, allowing for crystal clear pictures in sequence.  I do not consider myself a professional photographer, but I can take good pictures, and this camera made it easy.  My pictures looked professional!!I highly recommend this camera and the accompanying lens.  Sure, you can pay a lot more, but if you want professional quality without going completely broke, this is the one!", "Date": "May 29, 2007"}, {"Title": "Great SLR Camera", "Author": "J. Holland", "ReviewID": "R27X5GVBGSLOAG", "Overall": "5.0", "Content": "This camera is great value, I bought it with the two lens package. The normal lens is good and the zoom lens is huge. I bought a 133X speed 4GB flash card for the pictures and I've taken some amazing shots. The sports mode is great for skiing and captures very fast movement. The focusing is a little more elaborate and so takes a bit of getting used to if you're coming from a compact digital camera. Highly recommended", "Date": "April 12, 2007"}, {"Title": "Wow, great pics for great price. Opposite of buyer's remorse.", "Author": "Ernest M. Arnold", "ReviewID": "R33UQ7FGNT2PWX", "Overall": "5.0", "Content": "Summary for those who want the punchline:  Moved up from 100 dollar point and shoot, don't have a lot of money, first dslr, amazed.  I've been using a 100 dollar point and shoot for about a year and a half, and I found that I liked photography, and I was encouraged by others to pursue it further.  So I got 3 pics published in my university's art journal, and now this summer i decided to go for the DSLR, to see if I could pursuit this hobby more rigourously.  I'm still in school, and so on a tight budget, but I couldn't be happier blowing my summer's first paycheck on this thing.  For 600 dollars, a whole new world of opportunities with photography were opened up.  The dual lenses, lets me try macro shots but also allows me to zoom in for crisp images on those further away items.  The picture quality is great, you can crop an image drastically and still maintain resolution better than a 5 or 6mp point and shoot.  I'm aware that Canon and Nikon are supposed to be the top quality contenders, and I envision that several years from now, with a meatier income purchasing one.  But I won't bother for a while, because this thing is fantastic.  If you are on a tight budget and are looking to bump up to a dslr, this is the ticket: two lenses offer versatility, the camera is a solid platform, and the quality is exceptional.  I was hesitant after I placed the order that it might not be worth the money... but now I couldn't be happier.  This thing has made me serious about photography as a hobby, and maybe more.", "Date": "June 25, 2007"}, {"Title": "E500 - Great digital SLR", "Author": "Gary Roberts", "ReviewID": "R2B8O2GJO5FEB7", "Overall": "5.0", "Content": "I did a lot of research when I was looking for a digital camera because they are not cheap. If you want a digital SLR, there is not a better value out there. This camera comes out of the box with 2 fully digital lenses. It has a ton of features and a pretty large display. I found it very easy to use in point and shoot mode. It took about 5 minutes to look through the quick start guide to get it set up that way and start shooting. For those that are more serious, it has a ton of different options for white balance, exposure settings, etc.. Those will definitely require more time investment to master. The E500 also has multiple image quality modes, so you can easily adjust for picture size and amount of detail you need.It takes excellent photos, and while a professional might be able to spot the differences at higher ISO settings, 1. you probably won't be using it at those extremes, and 2. you also won't notice any degradation. Even at the highest settings, the camera still produces excellent shots suitable for 8 x 10 printed pictures. Any noise you might see in the shots (again, rare) can be pretty easily handled by most graphics software.There might be a better camera out there, like the Canon EOS Digital Rebel XTi, but you will pay a lot more for it and you won't get any lenses. (A decent lens costs more than the camera.) I would also be amazed if you noticed any difference in picture quality, even though it has a higher megapixel rating. The E500 comes with two digital lenses that will handle just about any shots you're going to want to take. Olympus also has a whole family of digital lenses avialable if you are more serious about your photos or if you need something that the included lenses don't cover (extreme close up or miles away).Olympus includes decent photo capture software for PC or Mac, but I'd recommend something like Paint Shop Pro or another package. Other notes: The battery charge lasts a reasonable amount of time and the camera comes with USB and other video cables. One minor knock, the USB is not 2.0, so if you are going to transfer that way, it will take a bit longer. It took a few minutes to transfer 50 pictures at the highest quality setting. A plus is that the camera accepts both xD and CF memory cards.Two recommendations other than buying this great camera: 1. Try this and the other cameras in person, this isn't a casual investment, and 2. check out this web site: [...]", "Date": "March 23, 2007"}, {"Title": "Excellent choice", "Author": "H. Morris", "ReviewID": "R1ODKXG2Y6YA31", "Overall": "4.0", "Content": "I have only had my camera for a couple of weeks at this point. I purchased it for quick pictures for church functions and other volunteer type needs. We used the pictures from this camera to put together a slide show for a week-long camp trip with junior high age kids. Everyone was well-impressed by the pictures this camera takes. The only disappointment I've found, and it isn't important to me, is that you have to use the viewfinder to take your picture, as the image does not appear on the screen on the back of the camera. Be sure to purchase a memory card when you purchase the camera or you won't be able to take any pictures. I missed that somewhere and had to quickly order a memory card before I left on the trip. Great camera!", "Date": "June 29, 2006"}, {"Title": "SLR Digital Masterpiece!", "Author": "R. L. Wizek", "ReviewID": "R2CELKDTYBACEJ", "Overall": "5.0", "Content": "I am a novice to experienced camera user. I have to say that the idea of buying a camera of this magnitude was daunting from the standpoint of all the terminology I would have to learn to better use the unit. The documentation takes care of that and is easy to understand. The on screen menu on the very large LCD is easy to use. The two lenses that came with the camera are the basic package where photographing small and large objects close and far away are concerned. Its really all here except it didn't come with a memory card, which I found not to be a big deal, because the capacity will largely be matter of personal preference. I opted for an 8.0 GB card with is more than adequate for capturing over 3000 images. The 8.1 Megapixel clarity is more than I've ever had in the way of a camera so maybe I'm just a bit dazzled right now, but the first photos I took for some product shots were clear beyond anything I've seen yet. All in all, with the combination of taking a digital photography class to better get most out of the unit, I would have to say this was positive experience. One would have to be a total pro looking for subtle nuances in a camera to not be happy with this camera. It feels good in the hand not small-ish like the Canon EOS, which when the shutter snaps actually jolts the camera causing a recoil-the body is so light.", "Date": "September 17, 2007"}, {"Title": "excellent camera", "Author": "Rakesh Ayilliath", "ReviewID": "R92LEQ10OCB5Y", "Overall": "5.0", "Content": "I just upgraded from a point and shoot Sony DSC P8. Had a few thousand photos on my hard disk and then decided to upgrade to something more \"pro\".After a lot of research finally decided to pickup the Evolt E500 with the dual lens kit.. and I should say I am rather impressed.The sharpness and depth of pictures are amazing. Very crisp, vibrant photos. The camera is much lighter than I expected., probably because of the plastic body. I am a techie myself so the menu and usability took me not more than a week to get used to. The anti-dust feature is cool and helps keep the sensor clean.A couple of (very minor) concerns:AF on the 40-150 is a bit noisy, but I can live with it.The 14-45 lens isnt anywhere close in quality to the 40-150, probably because the latter is a Japanese make.The lack of USB2.0 support was a concern initially, till I picked up a universal card reader, which took care of this problem.Low light images are a bit noisy.If you are a point and shoot photographer and would like to upgrade to a \"pro\" or a 35mm user looking at converting to a DSLR, look no further!", "Date": "May 12, 2007"}, {"Title": "So far I love it!", "Author": "A. White \"creeative1\"", "ReviewID": "R1YIT9LGTZE1JW", "Overall": "5.0", "Content": "Let me start off by saying that I love taking pictures but am by no means a professional.  I am the individual in my family who is always taking pictures and video and I absolutely love it.  I was previously a point and shoot user and have always owned Cannon Digital Cameras.  Canon Powershot A85 and most recently the Cannon Powershot S3.  We have an olympus point and shoot digital camera at work and it takes some good photos.Now what I like about this camera.. I love the large 2.5 display, I never got that with cannon.. althought the did have the rotating display which Iloved.  Actually this camera had been pretty user friendly for the most part.  I highly recommend contacting your local camera shop to see if they offer a class on how to use the camera.  It will be extremely helpful.  I also like the fact that you can do some editing right on the camera.If you are going to purchase this camera, be sure to purchase it with the lense kit.. If you try to purchase the same lenses separate you will end up spending upwards of $400.If you are new to DSLR, here is a few things you should know.  First,  you will not be able to see your photos on your LCD as you would with your other digital cameras.  Second, you can't take video.  Also, go to the Olympus website, they have various manuals written about the camera and how to get the most out of it.. This was very helpful.Overall, I think this is a camera you can grow with whether you are a beginner or a novice photographer..UPDATE 5/2/07I still love the camera; however, as with anything you can find a few flaws.  If you are in a extremely low light situation, the flash on the camera doesnt do well.  Purchasing the FL-36 Flash helped greatly and there are also some free olympus software upgrades that can be done.  Overall, I still feel it was the best value for the money..6/20/2007UPDATEI have enrolled in photography class and I love this camera.  It may not be the top of the line but it is definitely a workhorse.  The battery life for taking pictures is awesome.  Some recommendations1.  When purchasing a memory card, purchase the CF, it is the cheapest and the fasted.  The XD is ok, but you why spend the extra money2.  Get no less than a 1G card the preferrence is 2G3.  Forget hooking your camera up to your PC to download pictures, purchase a memory card reader.. don't drain your battery This camera has taken some great pictures and the two lens kit is awesome I have used the 14mm-145mm for some great macro shots in combination with the macro feature on the camera.Now here is one thing I don't like... the more I get into photgraphy and I learn about shutter speeds etc etc.. it would have been nice if Olympus had put the disply for reading this on top of the camera rather than having to look through the view finder.... but this is so small when you think of the overall vallue of this camera.Enjoy7/1/07 UpdateThis camera is really good.  I must say that I am in a photography class where the majority of the people have Nikon or Cannon and My photographs are just as good if not better.One of the things I have come to absolutely love is the dual memory slots...  One of the things I don't like is that you can't  use a \"cable release\" with this camera, you have to use the remote control which has to be pointed at the front of the camera.  The remote is a must for portrait photgraphy and in situations like photographing the moon or fireworks so you can avoid camera shake.", "Date": "April 30, 2007"}, {"Title": "Incredible buy!", "Author": "Eric M. Anderson \"Axel Gordon\"", "ReviewID": "R2GSCK9C7P6FRA", "Overall": "5.0", "Content": "For anyone wanting to explore the field of photography, this is the camera! I have past experience with Olympus equipment, but this is the first on the digital side. I am impressed! Money was not an issue, but I still purchased a factory refurbished camera. Word on the street says that refurbed products are given a 500% Q.C., therefore a more reliable item. Of course, the factory warranty is only 90 days instead of the usual 1 year, but most reputable dealers will give their sale an additional year (ask!). On that, purchase an extended warranty; you never know. I have 500+ shots so far, and all I can say is WOW! Olympus stood up tall and proud on this camera, and you will too if this is the camera you choose!! And on any accessories you decide on, make them Olympus as well.", "Date": "April 10, 2007"}, {"Title": "Excellent Results and Value for Your Buck!!!", "Author": "Alex G. \"Alex G.\"", "ReviewID": "R2U4NX4DUS0XO6", "Overall": "5.0", "Content": "I have owned this camera for about a year now and can tell you - this is one of the BEST digital SLRs out there. Built like a tank and with superior ergonomics, but most importantly, it delivers LARGE AND CLEAN digital files with an image quality, that your average point and shoot cannot even come close. I love night photography and the results impress me every time. My friend owns anothe big brand SLR (Cxxxn) - we compared the images shot at the same time and of the same subject. Olympus' looked MUCH BETTER!At this price, this camera is a very good deal. Better yet, buy the 2-lens kit and you'll be set! (that is until you start craving better and more expensive lenses, like I did). I added an F2.8 Zuiko lens and a FL-36 Flash. Everything works seamlessly as a system.Good luck and enjoy your camera!!!", "Date": "December 22, 2006"}, {"Title": "Good value for first digital SLR", "Author": "Orlando Ferguson", "ReviewID": "RZSY4C9N5SHNJ", "Overall": "4.0", "Content": "So far I am pleased with this camera, my first digital SLR. I'm especially satisfied with the shutter speed priority, which has enabled me to capture sports shots. This camera is an especially good value since it comes with two lenses.", "Date": "November 4, 2006"}, {"Title": "Very Pleased", "Author": "K. Mataisz \"Kimberly\"", "ReviewID": "RXFZ27NFG2YTB", "Overall": "5.0", "Content": "This is my first Digital SLR, after using a Kodak easy share for years, I found this camera to be wonderfully easy to use and so versatile.  It is wonderful for traveling and takes great shots.  I reviewed various different Digital SLR's and found this one to have the best cost for what I was getting,  I was not disappointed.", "Date": "November 4, 2006"}, {"Title": "Cost effective transition to DSLR", "Author": "David Watson \"Creative Person\"", "ReviewID": "R18VX6FQZMP274", "Overall": "5.0", "Content": "Still not convinced that you need a DSLR? I spent a few years with various point and shoot digital cameras after giving up my old 35mm film cameras in the late 90s. I was using a Panasonic Lumix DMC-FZ5K 5MP Digital Camera with 12x Image Stabilized Optical Zoom (Black) prior to this and while the Lumix's Leica glass is hard to beat, I found the electronics to be a limiting factor in my picture taking.I liked what I had heard about Olympus four thirds system:[...]and I picked up the E-500 in a store and really liked the feel - big and solid, which made my hands feel a tad smaller and the camera easier to use.Anyhow, if you're not compelled yet, have a look here:[...]and browse some of the photos.I found a number of things about this camera with the two lens kit to be to my liking:1) Excellent low light performance2) Usable flash on the camera - more powerful than it appears3) Great ISO controls - the ability to limit ISO range and still use auto ISO mode4) Excellent LCD5) Superlative usability and feel6) Works well with Linux - I use Ubuntu 7.10My shots are here:[...]", "Date": "October 30, 2007"}, {"Title": "Great value...", "Author": "Kimberly", "ReviewID": "R16GZVXX8LCZJM", "Overall": "5.0", "Content": "I was a little skeptical about the low price and the two lens bonus - I just figured that it was too good to be true.  I have had my camera for about a month now, and I haven't stopped taking EXCELLENT pictures.  The ease of the camera is wonderful for even the beginner.  You won't be sorry.", "Date": "July 5, 2007"}, {"Title": "Proprietary software is a bad joke", "Author": "John Contrady \"Not a tekkie.\"", "ReviewID": "R2G3E6B4ERJ32D", "Overall": "4.0", "Content": "After a bit more than two weeks, it is easy to rate the camera and the two lenses a 5.0.  The imaging software which comes with the camera is not a problem; it is a bad joke.  It is slow, ponderous & difficult to use.  The instructions ( if they may be called that )  are totsally lacking in common sense. Give the camera & lenses a 5.0.  Give the software a 0.  Rating = 4.0", "Date": "June 26, 2007"}, {"Title": "PROACTIVE SLR CAMERA", "Author": "P. C. Berveling \"Supadoc19\"", "ReviewID": "R2FK981RES0WNI", "Overall": "4.0", "Content": "The Evolt E500 took a little to get used to but is easy to use, light weight and very user friendly. i can recommend this camera as a very good entry level SLR camera and the bonus is the telephoto lens. Light weight enough to pack as hand baggage and not at all as bulky as I thought it would be. Very happy with this unit.", "Date": "May 13, 2007"}, {"Title": "Great camera-Great Price!", "Author": "William Otto", "ReviewID": "R3O2U3BZKLSYF4", "Overall": "5.0", "Content": "Like many others I was trying to decide between the Olympus and the comparable Canon model. Went to the stores and handled both. The Canon felt toyish, the Oly, just right. I have had this camera for about six weeks and love it! The pictures look great (full auto mode). The lenses are what clinched the deal for me. The two lens kit cant be beat.I have been talking pictures in all the different modes the camera has to offer with no problems.The camera is just the right size (I have big hands) and I don't find the viewfinder to be all that small, as noted in other reviews.The start up time is fine also. The anti-dust feature takes about 1 sec, and is worth it. I also bought a Sandisk Extreme 3 2GB card for this camera. No problems to date. I download directly from the camera. Some reviews complain about transfer speeds, but I dont feel this is a problem.I can downlaod about 100 pics in about 12- 15 mins. The write speeds are great. **NOTE** READ THE MANUAL. This camera is not a toy. If you read the manual cover to cover you shouldn't encounter any problems. If your looking for your first digital SLR, give this one serious consideration. Dont think I'll ever use my Minolta 35mm again! Why by film? and processing? E-Bay here I come", "Date": "April 30, 2007"}, {"Title": "Great amateur kit", "Author": "J. Nelms \"Counselor\"", "ReviewID": "R2AFTVLY4DGLFO", "Overall": "5.0", "Content": "I have been an amateur photographer for 20+ years. In that time I have been a semi-loyal Olympus fan. (I admit I cheated with Canon on a couple of point & shoots).This is a great DSLR for someone looking to carry their photography hobby to the digital world or someone looking to start a new hobby.It is not the easiest camera to use. Meaning you need to read the manual to learn the icons.The picture quality is amazing.The ability to manipulate the picture without entering a full manual mode is also very impressive.The size is perfect. The Cannon DSLR is a little to compact for my hand to provide a stable platform when shooting. The Olympus fits just right. (my hands are not huge.)DOWNSIDE:The accessories are very expensive and limited. The kit included is excellent and will satiate the appetite of most amateur photogs, especially when purchased with the optional starter kit for the camera (extra battery, bag, remote, etc.)But, before you buy this camera, imagine yourself wanting a wide angle lens, or a more powerful telephoto. Now take a look online... not too impressive?This is the area that the Cannon DSLR excels.", "Date": "April 1, 2007"}, {"Title": "Simply the Best DSLR  for the buck", "Author": "Michael A. Walker \"Gadget Guru\"", "ReviewID": "R1VIYRFL253AQY", "Overall": "5.0", "Content": "For the money, and alot more money this is the best camera ever, I have owned them all, Nikon, Minolta, Cannon, Pentax, Kodak, you name it, and this is by far the most bang ever for my buck. Plus I saved over $500 with Amazon, $499 is just to good for what i got with a lens? Wow! with the 510 coming, why spend $1000 for it when you can get this for $500?", "Date": "March 20, 2007"}, {"Title": "Solid camera.", "Author": "Jesus Ernesto Dueñas \"JDuenas\"", "ReviewID": "RVY2EGYCIIJ2J", "Overall": "4.0", "Content": "A nice value purchase , is a solid camera with many functions thats works I was shooting on the beach and my fotos were amazing, naturally I am experiencing all the functions and modes and I am ready to take my photo course soon. I recommend this camera.", "Date": "March 8, 2007"}, {"Title": "Good quality, good grip, good battery", "Author": "A. M. Steiner", "ReviewID": "R2XAOWKRWHOSAV", "Overall": "5.0", "Content": "I like most everything about this camera. There is one caveat to this and that is the noise levels above 400 are really too much. I generally don't shoot that high and I always use raw. I would suspect that the noise filter would work pretty good on the JPG images, but I don't know (as it does on the Canons). The focusing is not as fast as the comparable Canon or Nikon, but the colors and the spot meterings are better and it has the advantage of the self-cleaning sensor. This is really what pushed me over and I have not been disappointed except with stated above. I'm still giving it 5 because I have used the camera and the picture quality and feel is really good.", "Date": "December 20, 2006"}, {"Title": "I love this camera", "Author": "E. Brown", "ReviewID": "R2ATHWKF3Z5G8H", "Overall": "5.0", "Content": "I purchased this camera in late Spring but didn't use it until my vacation in July; it's my first dslr. Since then I've begun to use it more and more.  I am taking unbelievable shots and I've not yet begun to scratch the surface of its abilities. Although I have very small hands, I chose the E500 because I prefer a sturdier look and feel and I've not been disappointed. I've got several Olympus cameras which I love: this one puts the others to shame and that is high praise.", "Date": "November 15, 2006"}, {"Title": "A winner at this price point and better than Canon/Nikon", "Author": "K. Wolff", "ReviewID": "RKUOOBFXOB2ZW", "Overall": "5.0", "Content": "This camera is a backup DSLR to my professional grade Sigma SD14.  While it doesn't match the Sigma when viewed with a fine eye, it is extremely close.  The issue is what comes with the package and what it offers the serious amatuer photographer for the price.  First, the camera is well designed, comfortable and loaded with advanced features.  But the real advantage is in the Zuiko lenses.  The kit lenses that come with the Nikon and Canon varieties are not very good and not designed specifically for digital photography (translate to poor resolution at the pictures edges).  The Zuiko lens are designed specifically for digital photography and to add to that, are made with real metal lens mounts and not cheap plastic crap made in china. (Yes, only the professional Canons and Nikons are made in Japan).  If you upgrade Canon or Nikon to their pro lines, or at least go with their pro lenses, you may out perform the Olympus but not out of the box and you will pay more than twice as much.  And unless you want to make serious investments beyond the initial purchase, the Olympus will win the day every day. As a side note, the Leica lenses (among the best lenses in the world) being made for the DSLR market are 4/3 format lenses and will work with this Olympus but not with Canon or Nikon.  Happy shooting.", "Date": "September 7, 2007"}, {"Title": "Great Camera!", "Author": "Mark Wentworth \"weststreet\"", "ReviewID": "R39H4NPNPBU48M", "Overall": "5.0", "Content": "The  E500 is the 7th Olympus camera I've had the pleasure to own. Yes, I have owned a few other brands of film cameras, but I seem to have settled in with the brand that has given me rock-solid dependability, flexibility of use, and above all, the family of Zuiko lenses that always deliver high quality images. This is the first DSLR (Digital Single Lens Reflex) camera I have owned. The build quality of the body is first rate, and fits nicely in my hand. It harkens to the days of Film SLR's (no surprise) so it was as though I had picked up my old OM-1n body. That's where the similarities end. Where the film cameras need a good deal of photographic theory to set up for each shot, The modern DSLR can be a point-and-shoot. Just set it to AUTO mode and use it as you would any $150 camera. But that's not why an ex SLR guy like myself bought the E-500. I want to be able to adjust the heck out of my shots if I want to. The differences between old and new become a little closer, but the DSLR (any brand) keeps that distance huge. Set up a tripod and take a shot like in the old days. Wait a second, and check it out on the LCD display. Need an adjustment? Make it and shoot away. Need to bracket your shot? Set it and it takes three shots in succession. It is this modern digital instantaneous adjustability that leaves the old days in sepia mode. There are just too many features for me to list with this camera, but I have been using the heck out of it for about 3 months...and lovin' it! Oh, and if you have a collection of old Zuiko lenses from your OM line of bodies, you can purchase an adapter ring for about $100 that will allow you to use them (manual focus) with the entire line of Evolt DSLR's.", "Date": "January 3, 2007"}, {"Title": "A Great 1st time DSLR Camera", "Author": "David S. Murrell", "ReviewID": "R2N7JQJVNDUH6U", "Overall": "5.0", "Content": "This camera is a wonderful way to be introduced to the world of DSLR cameras. The images I've been able to capture so far are fantastic. Read the manual cover to cover several times in order to start to exploit the camera's true potential.", "Date": "July 27, 2007"}, {"Title": "If it only had image stabilization - what, the E510!", "Author": "Stephanie Sullivan", "ReviewID": "R1AFJ8CYRDO036", "Overall": "4.0", "Content": "I got this camera in fall of 2006. I has been great. The lenses are sharp and very good for part of a bundle package. I have an OM4t and many OM manual lenses. With an adapter most of these work well on this camera. I wish the view finder were more friendly to manual focusing. The optional eyecup/magnifier helps some, maybe just enough.I got the adapter for studio flash and it's been a workhose in the studio. The battery lasts and lasts - for me that's a real feature. Having dual storage media is also a major plus though the CF cards are pretty huge these days compared to just a couple of years ago.The on-board flash is OK for snapshots but not impressive for other use. I was amazed how well the camera did in poor light. It had some trouble focusing but was much better than I expected.The one thing I wish it had is image stabilization. Now the E510 is coming out and answering that need. And a good thing to see.In keeping with olympus SLR tradition this camera is relatively compact, strong, and with well thought out controls. The standard 4/3 lens mount is a big point for me. I like an open mount and I'm happy to see Olympus go that direction.Olympus is doing amazing things with their professional line of digital lenses. Check it out and you'll be amazed at the optics.The software that comes with the camera is actually useful. Who would have thunk it! I got the upgrade to the full version of olympus master (about $30 as I recall) and it was worth it. Later I got Olypus Studio for batch processing capabilities and that is what I use most of the time for mass manipulations. Kudos to olympus for being the exception to the norm.I'm very happy with this outfit but may upgrade to the E510 for the image stabilization.", "Date": "June 5, 2007"}, {"Title": "Love this camera!", "Author": "M. Patterson", "ReviewID": "R1EY4Q95T97PYV", "Overall": "5.0", "Content": "I've owned a couple Olympus digital cameras and this is my first SLR.  The features are amazing and I've taken some great photographs with it that I use in my graphic designs.  The customer service was A+ as well.", "Date": "March 13, 2007"}, {"Title": "A Camera For The Rest of Us", "Author": "John A. Van Devender \"Gadfly\"", "ReviewID": "RPXDWFM1Y6NHB", "Overall": "4.0", "Content": "This camera fills a very important niche - that level of photography between professional and competent point-and-shoot amateurs.  It has all the features that a professional camera requires, including the hot-shoe flash and very nice menu driven range of shooting options.The value added to this camera is in the lenses.  You really can't beat the deal in cost/value ratio.  The two furnished in this package are more than adequate for most applications.  They are sharp but not professional quality.  If you are looking to build a quality portfolio of images then these will get you well down the road to it.  Macro photo quality is sufficient for just about all the average guy's needs.  Telephoto shots are crisp throughout the range.The camera misses five stars because I think it needs an option for using the large display to frame the shot rather than only review it after having taken it using the view finder.  Olympus (Zuiko) does have a very nice range of lenses to augment the two that come with the package and that is another excellent reason to purchase the camera.  You can build a very nice camera suite for about 1/2 what you will spend on a Nikon and, let's face it, only a pro will know the difference.It's a good camera and an excellent price.", "Date": "July 20, 2007"}, {"Title": "Perfect Camera for a Little Bit of Everything", "Author": "Lauren E. Olander \"lolander\"", "ReviewID": "R2GPIDR1MH1ARY", "Overall": "5.0", "Content": "I absolutely love this camera-- I'm neither an amateur nor a professional - somewhere in between - and this camera caters to every area in which I'm interested.  I wanted something that's convenient like a digital as well as film-quality and this is definitely it-- I've already gotten compliments on the photos I have taken in low and high light (this camera has settings for both as well as actions shots, macro, landscape, etc.)-- my mom said they looked like professional photos that should be published!  I normally use a Pentax film or the Canon Rebel film but this camera is great to take on trips when you don't have time to mess with changing the film, want to see what you've taken in case you need to take another, etc. I also had a Canon compact digital that worked very well but did not take the quality photos I would've liked.  I highly recommend this camera to amateurs and professionals alike!", "Date": "July 6, 2007"}, {"Title": "A nice, not so little but well sized, SLR system - highly recommended", "Author": "Keith Joseph", "ReviewID": "R2RK1HBMCFFGSW", "Overall": "4.0", "Content": "I chose this SLR camera over the Canon `Digital Rebel' largely as could take the xD cards I have, and I could get the official twin Olympus kit lens for a lot less than the Canon offerings. Plus having lost a `sealed' compact to dust on the sensor the Olympus vibrational dust removal CCD system is great idea. Basically the camera feels like a traditional SLR, holds very well, and is relatively easy to use, although many useful things (and there are a lot of them for your money) are hidden in the various menus (like ASA's above 800 needing an on/off to activate). See the independent site dpreview.com for an excellent review of this camera and it's main digital SLR competitors available on Amazon. Picture quality is very good, although a bit noisy above 400 ASA. Having to swap lenses to get more than 3x zoom is also a bit of a pain (especially on a windy beach). I have got used to a 12x zoom compact, and I tend to leave the telephoto at home as the camera bag is rather weighty with it stashed in. Naturally you need to get a generic second battery (although the supplied battery is good for few days intensive shooting). Like all SLR's the excellent back LCD screen is at very high risk of damage from face contact and scratches so I applied a [PALM branded] screen protector before use.The only downside is the painfully slow USB 1 (not 2) transfer speed (up to twenty minutes for a days shoot), no top notch autofocus (up to three focus areas not five) and the irritation of no distance markings on the manual focus ring. So when you try to use manual focus in the dark you find it virtually impossible to set focus manually, whereas you could easily twist to say 3m or infinity on the lens ring if it was there (or shown in the menu). The focus ring just spins round and round and you don't even know which way the focus is going - this will protect the focus motor though. There's also no focussing light aid other than the short range flash. Having to use the pop-up flash to focus in the dark is also a real pain unless your wish to dazzle the subject - I never use it and switch off the auto pop-up and flash focus aid, the camera focuses far better without it anyway. It also tends to overexpose a little and you often forget to compensate after it returns to default (if you stay on Auto it does remember settings though). The image quality is also rather noisy above 400 ASA, compared to the main opposition - and unfortunately I now find I use 800-1600 ASA quite a bit. Plus you have to pay a small charge to upgrade the basic supplied Olympus Master software to the excellent Pro version. If you can live with the downsides, the camera has a lot to recommend it. I couldn't find any SLR for the price that had everything I wanted, and this SLR offered a good compromise. It has so many features that I'm still discovering some. I also bought the Olympus EX-25 'extension ring' from Amazon for real macro shots. Keep your quality 12x zoom compact though as this is large, intimidating, noisy, obtrusive and heavy beast for some places.", "Date": "December 23, 2006"}, {"Title": "Excellent Value", "Author": "Eric T", "ReviewID": "R17MII7AJH5J4X", "Overall": "5.0", "Content": "I considered both Canons Rebel DSLRs- the XL and XLI and the Nikon D50 and D80 and settled on the E500 as the best buy coming with both of these lenses. The Canon seems too small for my hands and the Nikon D50 has less features and resolution. I am greatly impressed with the quality of the images from the E500.", "Date": "November 29, 2006"}, {"Title": "Great Starter Camera!", "Author": "Wendi R. Smith \"reedzalot\"", "ReviewID": "R2JVF9GHJ13G2", "Overall": "5.0", "Content": "OK, so I'm not a professional photographer (not for lack of desire or talent, mind you!).  I'm actually very much the novice when it comes to camera equipment, but I'm learning.  I've had one form of camera or another since the age of 7, though, and I know what I like.I got my Evolt 500 kit from my husband, Christmas 2007.  This is my first GOOD camera and I'm wondering how I ever got along without it!  I love the image quality I'm getting.  I love the ease of use.  I love the feel of it and, as I saw someone else write, the very satisfying sound of the shutter-click!I realize I still have much to learn about cameras and all of the bells and whistles that go with them, but I would absolutely recommend this camera to other beginning, aspiring photographers.  I'm having a blast with it!  By all means, this baby gets Five-plus stars from me.", "Date": "February 18, 2008"}, {"Title": "The happiness of last year's model", "Author": "Peter Hansen", "ReviewID": "R7SOSEPQQRP2R", "Overall": "4.0", "Content": "At the time I bought this camera, it was at the end of its product life. The E-510 had just come out and was selling for more than a $300 premium over the E-500. Yes, the E-510 has a better pixel count and image stabilization. But I just couldn't pass up the relative bargain of the E-500. It's a very satisfying camera. Very good picture quality, good lenses, decent manual (considering the complexity of digital SLRs, a good manual is a necessity) and light weight.My one complaint is the lack of a usable remote trigger. I have the infrared remote and it's really only useful for taking pictures of yourself as it must be aimed at the lens side of the camera. I like to take shots of birds at my bird feeder using a tripod and this remote is useless for this purpose.", "Date": "January 17, 2008"}, {"Title": "\"Wow\" says it all!", "Author": "Brian R. White \"UH60 Daddy\"", "ReviewID": "RH9KFUA0AG4UL", "Overall": "5.0", "Content": "This is my first DSLR and I can say it will be the last for a long time. I've only had it for two weeks and I haven't even scratched the surface of all that it can do. The picture quality is awesome and the ease of use is even better. I've owned an SLR (Minolta) before but it didn't compare to the quality of this unit. The older Minolta even costed about the same as this unit and it couldn't even come close to the feature for value ratio of the Olympus Evolt E500.This camera is beginner friendly and the manual supplied with it is easy to read and understandable. I can't wait to get aerial shots of Afghanistan. Exceptional clarity in any mode is an understatement. Buy one today and see what I mean. Enjoy!!!", "Date": "May 19, 2007"}, {"Title": "excelent quality", "Author": "Michael T. Greer", "ReviewID": "R2K721WAV30C1C", "Overall": "4.0", "Content": "I love the camera, it has excelent quality. many great fetures, and easy to use. The only thing I dont like is that you cannot view the pictures on the screen while you shoot.", "Date": "March 8, 2007"}, {"Title": "Graduated to SLR", "Author": "stanfish", "ReviewID": "R2H1NGJ4AVTEWA", "Overall": "5.0", "Content": "Have been a fan of Olympus cameras since the film days with my 30 years old clamshell 35mm still operable.  Have been using C-750 and C-8080 (great optics, steep leaning curve).  The E500 optics are almost as good as the 8080,however, much more user friendly.  Controls are handy and intuitive. Outstanding feature.  NO MORE SHUTTER LAG! Overall quality first class.  Only minus is the small viewfinder, hard to see settings off to the side wearing glasses.", "Date": "January 9, 2007"}, {"Title": "Maybe,  but not for a beginner", "Author": "R. VERNON", "ReviewID": "R2JKBVBPGK8OPE", "Overall": "3.0", "Content": "All I know about photography was from a class I took in High school 10 years ago. I bought the Olympus, for its price considering the 2 lenses. The menu was confusing even after I read the manual. I didn't love the lenses that much, there was too much play in the manual focus, and the view finder was pretty hard to see into.I went to a camera store and played around with a Nikon and a Canon, both had better menus, the Nikon had the better manual focus. So I ended up with a Nikon. The manual focus was like black and white, compared to the E-500.The camera itself was a great size, and fit well in my hands. The nikon (D50) feels a bit heavier, but I think it could be the 300mm lens. Maybe if I weren't a beginner I'd feel better about it, but I'd like my husband to be able to play with it too, and the Nikon is a lot easier to use.", "Date": "December 15, 2006"}, {"Title": "excellent camera from a nikon user.", "Author": "James L. \"adeem\"", "ReviewID": "R18BK3NGGL4D5A", "Overall": "5.0", "Content": "My previous slr experience started with nikon, upgraded to dslr to still nikon and currently still use nikon. However, i do have some pentax and minolta slr's that were gathering dust. Rather than tag sale them away, i got this olympus second hand from a local craigslist ad. The lenses from my pentax and minolta does not fit my nikon without the use of an adapter that has some glass on it which degrades the image by a lot. the olympus does and meters well. I use the kit lens and was surprise it held up well against my nikon, i was surprise ba a ton when i started putting on my old takumar and rokkor lenses and how the images swept my feet. the prime lenses easily beat out the kit lens from nikon on the computer screen and after had it develop at my local costco, i was stunned of how the images were sharp and contrasty. i therfore conclude this camera was a steal and will continue to use it. it has currently seen more action than my nikon. i do bring nikon when i need to autofocus quickly and take snapshots. i would rate this 5 stars.", "Date": "September 1, 2010"}, {"Title": "Quality Olympus cameras and accessories", "Author": "Jim A. Madden \"MtnJim\"", "ReviewID": "R3GOK15VUAK9Q7", "Overall": "4.0", "Content": "Having never owned an Olympus camera before I was a little unsure of the quality compared to other high named brands. I found that it was just  the same quality without the expense of paying for the so called \"Name Brands\" which you are paying for the name not the quality of the product. I would recommend to anyone who enjoys the many photographic nececities that you get on those expensive brands, that Olympus has just as many features to produce excellant pictures.", "Date": "October 2, 2007"}, {"Title": "Very easy to use, excellent results. love it", "Author": "Rahul Palaspagar \"Rahul\"", "ReviewID": "R252B2WWPPCL3", "Overall": "5.0", "Content": "Excellent camera at this price. Very easy to use with 15 scene modes and detailed information in the preview helps starters to learn the best settings required. Total manual modes also easy to handle. Light weight compared to other SLRs. Would highly recommend for amateur photographers.", "Date": "September 1, 2007"}, {"Title": "Good basic SLR camera", "Author": "Biswajit Saha \"Biswajit\"", "ReviewID": "R2FF51V5311IGW", "Overall": "5.0", "Content": "Very good SLR for the Beginner. The two lenses found good.. However in out door shooting - I found very tedious to change the lens.Night shot pics also good.. Image stabilization will not work much in night shot. Better have a tripod.Over all - comparing price & feature - it's a very good camera..", "Date": "May 12, 2007"}, {"Title": "Wonderful!", "Author": "Intel", "ReviewID": "R2V64WAWACM5V4", "Overall": "5.0", "Content": "My first digital SLR camera. After using a few Olympus cameras, I decided to get another one, and this time a digital SLR. I don't really know how to use an SLR cameras. So far I have used only the auto mode and some scenes. It is so easy to use! And the pictures came out so perfect.", "Date": "April 20, 2007"}, {"Title": "Very Good Buy", "Author": "Toc \"toccata\"", "ReviewID": "RV1XMA480RRVZ", "Overall": "5.0", "Content": "I get great pics with this Olympus camera. It's the 5th Olympus camera I've owned and I have always been pleased with this brand. I didn't find the camera all that \"obvious\" to operate when I got away from all the presets--but I learned! I get great pictures and excellent resolution. The presets are very good as well. I just wish the individual lenses were not so expensive. I highly recommend this camera to anyone making the jump from automatic to SLR--you won't be disappointed. But do take the time to learn the camera!! The manual is not helpful for really learning the camera but there are quite a few books available to teach the fine points of digital photography.", "Date": "January 7, 2007"}, {"Title": "Wonderful Camera", "Author": "K. Swank", "ReviewID": "R3END7005S07FS", "Overall": "4.0", "Content": "I love the camera. Good weight, good design, comfortable to use even for someone with small hands, like me. Lots of options, pop up flash, easy to use menu configuration, and it comes with two wonderful lenses. Love the solid 'cha-chink' of the shutter release. The photos, even just on AUTO mode, are far, far better than my mother's automatic digital camera (also an Olympus) takes. The HyperCrystal LCD is huge - huge and a perfect preview of the photo to be, rather than a pale imitation. The battery lasts a long time - have only had to recharge twice since I bought it.Has so many settings I haven't had time to try or master them all.The bad?Not even a tiny bit of internal memory for photographs. Make sure you have a card on hand. Or two.And also, while using the camera in AUTO mode, where the light is dim enough that a flash is needed, the flash can be VERY irritating. As the camera adjusts itself for the photo, it often performs several test flashes, meaning that taking an indoor picture on auto can actually take up to ten seconds - and multiple flashes that thoroughly blind your victim before the photo is actually taken. This is irritating.I have not used the included software, so I cannot comment on it. It seems that the only way you can update the camera's firmware is by using this software - this, to me, is a minor pitfall, because I don't use Windows.Overall, I'm VERY impressed with the camera, and would recommend it to anyone looking for a digital SLR.", "Date": "January 4, 2007"}, {"Title": "Camera worth the money !!!!", "Author": "Sanjay Mukhopadhyay \"Sanmukh\"", "ReviewID": "R1LPWN0OSFJGL", "Overall": "5.0", "Content": "For the past one month & half I have been looking into different brands for a suitable Digital SLR with extra lenses. I couldn't find any other with one extra lenses other than the standard 14-45 except Olypus E500. For the past two weeks I have been taking several photos on M XD card. The available options were simply great. Specially the evening shoots.The only drawback is the non-availability of \"Live picture\" through the wide 2.5\" TFT screen. Other than this the rest is worth its money.Finally the price from Amazon is trully one of the best in the market.", "Date": "December 27, 2006"}, {"Title": "Olympus for Christmas", "Author": "Scoop \"Go Gator x2 Champs\"", "ReviewID": "R2FZAWDB32R6DF", "Overall": "5.0", "Content": "So far I am very happy with this camera!It is easy to use & easy to take great pictures.I have used it many times, since getting it!The only thing that would have been nice would have been for it to have had some kind of memory card in the package.Upon opening it on Christmas morning, of coarse you want to use it right away to capture the occasion.Especially since there is no internal memory.Over all Great Camera, Great Package (except missing memory card), Great Price!", "Date": "January 11, 2007"}, {"Title": "Good deal", "Author": "Michael Wiese", "ReviewID": "RR3ISZPU7FJTM", "Overall": "4.0", "Content": "I wanted a digital slr but didn't want to pay the price... this has been a great deal so far.. I have learned a lot about photography and have had a lot of fun... Seems like everyone wants a cannon or nikon but this seems to do just fine...", "Date": "December 16, 2013"}, {"Title": "Still learning to use all the features.  Feels good to get a real SLR again.", "Author": "Carl R. Rich", "ReviewID": "RTAFGRODFVIWL", "Overall": "4.0", "Content": "I am still learning to use all the features, but it has been fine so far.  I like the manual settings, but it works well on the auto ones too, for quick work.  I am disappointed in the clarity of the manual focus.  It has no stops on the closest or infinity ends so one really has to pay attention to the actual image or get lost focusing instead of really seeing the shot.  The auto-focus is real good and maybe I should just learn to trust that.  I was hoping to get, essentially, a digital version of my beloved OM-1 film camera, but now I have to reserve judgement on that until I have learned how to use all the features that make digital so much more versatile than film.  The price for this \"like new\" used unit was very good, and the seller gave \"above and beyond\" service.", "Date": "August 26, 2013"}, {"Title": "Awesome", "Author": "Christen", "ReviewID": "R3KE7I6BUYS66N", "Overall": "5.0", "Content": "Couldn't be happier with this purchase. Easy to use and easy to handle. Quality is awesome. And the duel lenses really are great.", "Date": "May 16, 2013"}, {"Title": "It's Olympus!", "Author": "Gary D. Bryant", "ReviewID": "R30JYNEC2VDMAK", "Overall": "5.0", "Content": "I love this camera! I was one of those hard nose hold outs that was never going to go digital. I have always loved the Olympus brand and have owned several of the 35 mm cameras. This camera made a believer out of me and gave me the push to go digital.", "Date": "April 17, 2013"}, {"Title": "Good intro camera", "Author": "Elizabeth", "ReviewID": "RJS6JYXXBIMIN", "Overall": "3.0", "Content": "Camera is good, and does what its supposed to.The camera itself is okay, without the 2 lenses it wouldn't be worth it.Otherwise I'm fairly pleased.", "Date": "March 31, 2013"}, {"Title": "It is a fantastic value.", "Author": "Peter Braun \"book neophyte\"", "ReviewID": "R3K406J9LCJ5PY", "Overall": "5.0", "Content": "I picked up an old evolt 500 with two lens kit used recently.  It is a fantastic value.  I agree with photo magazines.  It is a steal.The camera is super responsive.  I do not notice any shutter delay.  The menu system is easy to figure out.I use it in Av mode and it works well.I have found the built in flash to work perfectly.  Indoor photos have turned out well.Having access to both xd cards and to Compact Flash works great.  I only buy CF cards because they arecheaper and come in larger sizes.  I picked up a few Kingston and Lexar 4 gb cards, and both are working well.The size of this SLR is perfect.  Feels solid and one with your hands; and not too heavy.So far, I picked up a Sigma 55 - 200 mm zoom to go with this body.  I will save up for the 70 - 300 Olympus zoom for later.That lens is about $400.00.In the meantime, I am disappointed that Tamron or Tokina do not make lenses for the Olympus 4/3 system. Even Sigmaonly seems to have a few affordable choices.  Laslty,  Olympus seems to be totally focused on the Micro 4/3rds systems and seems be abandoning this 4/3 normal system.  When I search for adapters, they are almost all for the Micro cameras.I have found adapters that allow me to work with Olympus OM lenses and NIkon lenses.  This has expanded mylens choices, but with the loss of auto-focus.  The OM lenses are heavy and steel, and seem too heavy for this plasticcamera.To use longer OM lenses,  I may need to look into an old  e-1 or e300, made of metal.Overall,  super happy with the e500.  Olympus makes great cameras.", "Date": "March 3, 2013"}, {"Title": "wife loves it", "Author": "W. Conover", "ReviewID": "R3GUH4O1XM8VTE", "Overall": "5.0", "Content": "This was a Mother's Day gift and turned my wife into a full blown digital scrapbooker. It's hard to take a bad shot, and has enough settings that the amateur artist can experiment easily/quickly with f-stops and shutter speeds...without wasting a ton of film. There is no video capture, and the small screen is okay for reference but nothing fancy. It will capure using the RAW format, but my wife prefers the largest jpeg for file size issues. I can't tell a difference in image settings, but she can. The learning curve is low/easy for normal picture taking, but has a lot of options for someone who knows what they're doing.", "Date": "January 15, 2013"}, {"Title": "Awesome", "Author": "JAMES REED", "ReviewID": "R2W4SIKYQW75YX", "Overall": "5.0", "Content": "I was a little skepitcal when ordering a used camera, but when I received it I was extremely impressed. Except for not having a manual or coming in the original packaging it is flawless.", "Date": "December 21, 2012"}, {"Title": "Photography novist", "Author": "R. Dirks", "ReviewID": "R3VV4MU7SON1UN", "Overall": "4.0", "Content": "good deal for beginning photography class.  Camera is easy to use.  Found manual on-line.  Have recommended this item to others", "Date": "December 5, 2012"}, {"Title": "Value deal given its price ($663 body plus two lenses)", "Author": "Jian Lin", "ReviewID": "R29QD3HETFE2OK", "Overall": "4.0", "Content": "Good price when I bought in year 2007 ($663 body plus two lenses). Quality is fine for an entry level DSLR, howeverm, choice of Olympus DSLR and lenses is limited if you want to upgrade.", "Date": "November 17, 2012"}, {"Title": "novice", "Author": "mike", "ReviewID": "R26GSF2EG1NRKI", "Overall": "4.0", "Content": "The camera seemed o.k. couple little issues with condition, but no manual. I am a novice slr user, and am lost as to how to use this thing. Asked seller to send manual, but still haven't heard. Will have to buy one for $10.00. Oh well. mike", "Date": "September 30, 2012"}, {"Title": "My backup DSLR", "Author": "gk", "ReviewID": "R3HAYHN0UI33F1", "Overall": "5.0", "Content": "I have to say overall I just love Olympus products! This camera is a backup to my other Evolt. I like the way the 4/3 sensors work and take photos. The quality of pictures is solid and consistent. The pictures always come out vibrant. Though I take care of my equipment, this camera was only $180 in almost like new condition. If I dropped it, I might cry some but then that gives me an excuse to get a PEN P3.", "Date": "September 4, 2011"}, {"Title": "My Backup Camera", "Author": "Maryia Sky", "ReviewID": "R10ZJTXTY0F2A2", "Overall": "4.0", "Content": "I've been using this camera as a back up camera when I shoot events, weddings, and portraits. The funny thing is it has actually outlasted my primary camera (a Canon).  This camera has been reliable and the image quality is decent. I would recommend getting a decent flash and spending some money on lenses. Overall I would recommend this camera.", "Date": "January 19, 2011"}, {"Title": "Olympus made it right.", "Author": "L. Zugner", "ReviewID": "RKPVQLSAR8QN0", "Overall": "4.0", "Content": "I had a problem with the wide angle lens after the warranty expired and Olympus made it right.  Good camera but the auto focus in low light is erratic.  I understand that it's the same with all brands of DSLRs.", "Date": "August 19, 2010"}, {"Title": "A Classic from Olympus !", "Author": "Francisco Salazar \"Yogz .\"", "ReviewID": "R1XK1TSMSAJ9A8", "Overall": "5.0", "Content": "This was my first digital SLR, and it's a great camera, olympus gives you a lot of advanced options even in their entry level models, build quality it's a lot better than the equivalent canon or nikon offers, also zuiko lens are among the best on the market, even the kit lens are great, you can't say that about the other camera brands ;), i also have the newer e520 wich it's really cool to use with old manual OM zuiko lens with the liveview feature , but i think the Kodak sensor in the e500 it's far superior at lower isos, better colours and overall dinamyc range .", "Date": "November 19, 2009"}, {"Title": "Got more than expected", "Author": "Robert Smith", "ReviewID": "RAOQ8TPX69NKS", "Overall": "5.0", "Content": "I needed a backup camera body for my existing system because I am going to be a photographer for a group of about 100 people going on a cruise. I placed the order with some concern. Would the pre-owned product operate properly and arrive on time (or at all)? As soon as the body arrived I compared all its functions to my existing camera body. I now have them both organized identically, so that I can switch between camera bodies instantly and not miss a beat. The camera delivers as expected. In addition, there were some extras: The body came with storage media and an OEM battery, something I didn't expect. In addition, it came with an OEM battery charger! That was a pleasant surprise. I would trust this seller for any future purchases.", "Date": "November 1, 2009"}, {"Title": "Very capable E-500", "Author": "Paul Porter", "ReviewID": "R146B6MBK3GPY8", "Overall": "4.0", "Content": "The E-500 has been a great camera for me overall.  It is easy to use and controls are well placed. It is of comfortable size and fairly light in weight even with a zoom lens on. While the camera is light in weight the materials used do not feel cheap and it fits well in your hand(I have big hands) while in use. Auto focus works well in the conditions I have used it. Images are well exposed and color reproduction has been very realistic. 8 MP is fine for my uses and the \"truth be told\" enough for most people. Battery life has been excellent as well.  Cons-doesn't have Live view and the view finder is on the on the smallish side.", "Date": "June 26, 2009"}, {"Title": "Classic 35mm SLR Design In A Digital Camera", "Author": "Andre S. Grindle \"Andre' Grindle\"", "ReviewID": "R12QUVPEE5P0X8", "Overall": "4.0", "Content": "Without a doubt this was a hefty camera to deal with in terms of price.I was looking to replace my first digital camera which was an Aiptek DV4500 4MP MPEG4 Pocket Digital Camcorder,more of a swiss army knife digital camera/camcorder/voice recorder thingy-more of a toy then a functional device.Finally one day,it just fell apart basically.So in some haste I replaced it with....this.I found myself with a large money surplus and decided that if I were to invest a lot of money in a new digital camera,I wanted one that had similar functions to the Pentax K1000,[USED] P30T, 05520, 35mm Cameras  and Ricoh KR-5 manual 35mm SLR's I'd been using along with comperable if not better image quality. When I first took this camera out of the box I found it more then a little intimidating.The instruction manual is the size of a small novel (presented in three languages) and frankly....three years after purchasing the camera I still haven't learned every single little thing about it. Digital SLR's are a very very different animal from what I'd been used to. After you insert your flash memory card your off to the races and all you have to do is....figure out all the complex technicalities of SLR photography. Of course with a few days practice you will get incredible photographs with this,especially if you had a lot of knowledge beforehand about photography as I did.At present there are 12 megapixel cameras out there but,even now the resolution on this 8 megapixel model is absolutely stunning. It's definately a professional camera and has all kinds of sophisticated features.One of my favorites on this is the motor drive.It's a bit tough to use this setting with the built in flash but in proper conditions it is an excellent feature for any kind of action photography.This camera also has a number of amazing lighting and and picture options.You can choose from a number of ISO speeds but,of course keep in mind that as with 35MM the higher an ISO speed you choose,the coarser and grainer the finished product is likely to appear,especially when printed on huge paper. But this camera does offer all the great features of a semi-automatic 35 mm SLR and two excellent lenses.One word of note:you'll probably require a longer range flash attachment for the 80-200 telephoto zoom lens included but in terms of outdoor work it really does bring in far images closer and clearer,with not too bad f-stops too.Other great lighting features are a handful of flash options,even for outdoor \"fill\" flash use and even on the automatic setting the use of exposure compensation to lighten or darken your general image. There is a manual setting which allows you full control but even I admit I rarely use it:the manual shutter/F-stop settings are controlled with tiny buttons that are hard to sync up and,while a built in light meter is included for this situation it's somewhat more time consuming.So recommended setting on this camera for the impatient subject?From my experience that would be the auto close up (or portrait) setting with the motor drive swiched on,with the use of flash indoors or natural light outside for the best effect.So with a little practice with it's complex modes and a little time this camera will delivery the best pictures you can probably imagine.", "Date": "June 16, 2009"}, {"Title": "My-Mode for HDR, and Silver body to keep it cool in the sun!", "Author": "Rolf Bertram \"RolfBertramDotCom\"", "ReviewID": "R2FXC2HWDCF615", "Overall": "5.0", "Content": "The my-mode button helps in HDR by allowing to recall a user defined setting of, for example aperture and exposure time in manual mode. This allows HDR with more than the built-in factor 4.Other notes: The silver housing seems excellent, and it keeps very much cooler in the Florida sun, which reduces sensor noise. Do you know, a black surface in the Florida sun can get so hot, you can't touch it anymore? Silver however does not even get warm! The black housing however seems to have another problem, a very severe surface texture-rub-off problem. I judge this by only seeing  one used black E500, which had 20k shots on it, and the housing surface looked very ugly in places where fingers touch often. I have a E300 with over 20k shots on it, and it still looks like brand new. There seems to be a problem with the black E500 housing surface. But, this is judged only by seeing just one used E500 in black. Anyway, I prefer silver in order to keep it cooler in the sun.", "Date": "June 6, 2009"}, {"Title": "Love it!", "Author": "Derrick Washington", "ReviewID": "R339FOS36KSAYP", "Overall": "4.0", "Content": "Prior to this camera I was shooting with a Olympus 7070 which I still have and use but compared to this camera there is no comparison. I haven't learned all the inter workings of the camera but I have taken it with me to many locations and it takes great pictures.There was not a big learning curve, but I am seeking to get better buy reading there blog which is very informative.", "Date": "June 2, 2009"}, {"Title": "Great Camera and better experience", "Author": "K. Haynes \"Emphatic Lil\"", "ReviewID": "R1ZVYGTWM9HHNT", "Overall": "5.0", "Content": "Even at four years old this camera takes great pictures. Yet it still has all the functions a pro photog needs. I'm really happy with the purchase.", "Date": "June 1, 2009"}, {"Title": "Totally love this camera!", "Author": "Dragonkeeper", "ReviewID": "R2W8ZR86UU1RN6", "Overall": "5.0", "Content": "When I first started using this camera, I did not really know how to use the settings. I thought you either used flash, or you didn't, and what you got was what you got. Period. Then I took a photography class on exposures, and learned how to use this wonderful camera. Despite the fact that this camera is several years old, it is still amazing. The 40-150 mm lens is wonderful, helping me capture images from 5-6 feet away, to around 15-20 feet away, with everything else blurred. The quality is amazing, and the settings are easy to change. The shutter-speed dial is on the top right corner nearest you, is very easy to turn to change the lighting and many other things that make each image unique. Because I have been using it for several months, I am so used to the weight of the lens that I cannot imagine using a smaller lens, though the smaller one it can come with (14-45 mm) is a great lens also. Over all, it is a really good DSLR to start out with and continue to use for years to come. I actually prefer this to the new Canon Digital Rebels coming out.", "Date": "May 26, 2009"}, {"Title": "Big, bright, sharp viewfinder makes this a joy to use...", "Author": "S. Ahern", "ReviewID": "R1WCV10KOWP1VU", "Overall": "5.0", "Content": "Not much to add except that my BF, who got a Nikon at twice the price, is jealous of the results I'm getting with my E-500 -- great sharpness, easy-to-master controls, overall a winner for serious amateurs.", "Date": "April 2, 2009"}, {"Title": "In search of something more then P&S;", "Author": "Kasanwidjojo Romeo \"rom\"", "ReviewID": "R1FOHO613GORXF", "Overall": "5.0", "Content": "While searching for a camera with the best price/performance the film experience with Olympus cameras tipped the scales to Olympus as a next possible purchase for a digital camera. Having gone through all available reviews available at the time a DSLR purchase was considered above a P&S.; This purchase has opened a whole new experience and learning on digital photography and photography with SLR in general. I have not been disappointed with this purchase and recommend this camera highly. The newer models have Live View and IS but that has not diminished the value of this camera for me. The tweener may be my next upgrade. But other then that faster glass would be my next purchase for this camera.", "Date": "October 21, 2008"}, {"Title": "Great camera for the age.", "Author": "D. Vang", "ReviewID": "R2U9MH8PX7WM7X", "Overall": "5.0", "Content": "I picked up this kit at Sam's Club a couple of months ago as a used camera for $200, and I couldn't be happier.  The camera works wonderfully and takes marvelous pictures.  For the everyday walking around camera, this kit completes your needs.", "Date": "April 2, 2008"}, {"Title": "warm, friendly service, great product, excellent price", "Author": "mom \"mom\"", "ReviewID": "R1X1971G4XXGEX", "Overall": "5.0", "Content": "i was entirely pleased with the olympus e 500 i bought my college age daughter for christmas. and more, she was also thrilled. and as a refurbished item, i was able to outfit her with more camera than i otherwise could have afforded.", "Date": "December 25, 2007"}, {"Title": "Awesome!", "Author": "Bobby Reese", "ReviewID": "R1SSJUCBXH1C3X", "Overall": "5.0", "Content": "I did a lot fo reearch before I bought this camera and I'm comletely satisfied with the Olympus E500.  A family member has a Nikon 40 and was showing me all it could do and I think I have a better camera for lessmoney, plus got an extra 40-150mm lens.  I would definetly recomend this camera to anyone looking to step up from the point and shoot type.", "Date": "December 18, 2007"}, {"Title": "Olympus Evolt500", "Author": "Mitchell A. Walton", "ReviewID": "R370CCXU0XN7GY", "Overall": "5.0", "Content": "This is an excellent camera. The features and quality of the product and the pictures it produces are well worth the cost.", "Date": "October 29, 2007"}, {"Title": "Good SLR beginner camera", "Author": "Mario Sebetovsky \"M. Sebetovsky\"", "ReviewID": "R1FBQXOJCTR83Y", "Overall": "5.0", "Content": "As I am,pretty much, new in DSLR family it seemed to me taht purchasing this camera might be the best solution, and I was right. Both lenses are much better than any Canon kit lenses. Canon body is, generally, better but, like I said, Zuiko kit is much, much better. Generally, no complaints. Now, I have to review it in the field.", "Date": "September 26, 2007"}, {"Title": "goo product", "Author": "Edwin Endara", "ReviewID": "R2H5CQ9O4ZCPHU", "Overall": "5.0", "Content": "ii is a good product high definition in the picture, good speed high performance, i'm very satisfied with the product, if you are serching a good camera it is the correct", "Date": "September 14, 2007"}, {"Title": "All it was said to be - excellent", "Author": "S. Sullivan \"AVIAweb\"", "ReviewID": "R1CNKW05T8CV9D", "Overall": "5.0", "Content": "I was very pleased. The one addition I got was the eyecup. I and thinking of upgrading to a E-Volt 510 because of image stabilization.Very good color, very good exposure, very good control, very good with studio flash (using adapter in hotshoe). Does well under available \"darkeness\". I was very impressed by low light performance, but a faster lens would be helpful there.Overall Excellent.", "Date": "September 7, 2007"}, {"Title": "Review of Olympus EVOLT 500 DSLR", "Author": "A. Bhattacharya", "ReviewID": "R12H59MS18RFBX", "Overall": "4.0", "Content": "The Olympus EVOLT 500 is the best representative of a line of amazing DSLRs which have the potential to unseat Nikon and Canon as the premier market leaders. The E500 is simply loaded with features, but let me point out why you need to buy this right now.1. Simple controls. The E500 has a great design philosophy: the standard metaphor for doing anything on this camera is `press a button and rotate the control wheel'. Controls such as ISO, WB, AF and metering are mounted on the 4-way key located on the right of the large 2.5'' screen. I prefer to maintain Single AF, unless, of course, I am photographing something moving really fast, like birds. I keep the screen switched off to conserve battery; every time I activate one of the 4-way keys, like ISO, the screen lights up with only the ISO displayed. Very efficient.2. Fast and efficient AF. People are known to crib about just 3 AF points, but I don't see why. If I am ever photographing under really tricky light conditions, I tend to use spot metering with the central AF point. Sure, the EOS30D has 9 AF points, but it weighs a tonne and costs  as much as a Ferrari. The continuous AF is quite nice, but beware: don't use it when you don't need to. I was once photographing turtles in a marsh, and my AF kept throwing me off, it was only later that I realized that at maximum focal length, continuous AF can be easily fooled by surrounding reeds which are practically invisible to you (at 140 mm).3. Easy metering. You can under/over expose to within 0.3 stops (or EVs). This is easily accomplished by holding down the exposure compensation button and rotating the wheel. You can also change the step size in metering to 0.7 stops or 1 stop.4. The screen is nice and bright, and can spew out much more data than you need. Fortunately, it also has a basic mode, with only essential mode data displayed. My favourite mode for the screen is to keep it off. Saves battery power.5. The menu is much more readable than on, say the Rebel Tx. I sometimes need to switch to monochrome, and this is easily done. I would have liked a hotkey for this, but well..6. Small viewfinder. Apparently Olympus sells an eyecup magnifier. Why can't they include it in the kit? Oh, profits..7. Reasonably fast operations. This is not a professional camera. Don't expect EOS30D or D200 level work, but there is no shutter lag, and as I found out during a dolphin show, the speed factor is going to be your reflexes and not that of the camera.8. Excellent battery. Takes forever to charge, though. Good for 500 pictures, which is about what you can fit into a 2GB CF card. Remember to switch off the screen.9. The onboard flash is awful. But all onboard flashes are awful, so nothing new there. I always shoot in ambient light anyway.10. Kit lenses. The Zuiko lens lineup is truly impressive, and very costly too. I would like the 18-180 mm lens to be a little cheaper. I really hate it when I am shooting people pictures with the 40-150 mm outside in the street, and then I want to take  pictures of buildings and then I have to go to a Starbucks and switch to the 14-45 lens. The 18-180 mm would be the perfect walkabout lens, except that it is rather costly. Oh, it would be soooo nice if the Sigma 70-300 mm lens was available on a 4/3rd  mount. Hey, people at Sigma, Tamron, Tokina.. listen up... we need some decent third party 4/3rd mount lenses... please?11. Ok, bad points. There should be a DC power connection and adapter for transferring pictures, or displaying them on a TV.12. Really bad point. USB 1.1!!!!! What the bleep???? Pictures take FOREVER AND AN HOUR to transfer. I could finish my PhD by the time the contents of a 2 GB card make their way to my computer. Well, not really, otherwise I would have graduated....Summary: this is a great camera with an good pedigree and an ever expanding range of lenses and upgrades available. I recommend it without hesitation. It delivers the best value for money.", "Date": "June 7, 2007"}, {"Title": "Fabulous camera", "Author": "M. Myers", "ReviewID": "R14I1KP0D0M4NE", "Overall": "5.0", "Content": "I had a basic point and shoot digital camera and was missing some great pictures due to the delay.  My kids are competitive swimmers and I wasn't able to get action shots even in the sports mode.  I decided to upgrade to a SLR.  This camera came highly recommended by a local camera shop. It is easy to use. It comes with 2 lenses, the zoom is great.  I am amazed at some of the pictures I have taken already.  This camera has capabilities beyond what I will use, but I the pictures I have already taken are to be treasured.", "Date": "March 14, 2007"}, {"Title": "Good Value, Great Camera", "Author": "William Searfoss", "ReviewID": "R15Q7UVLBDYKJ0", "Overall": "5.0", "Content": "Well I have had the camera for a month. The price I paid in the end for the camera and two lenses is unbeatable. I wrote paid in the end because the price dropped twice after I received it, I called Amazon and they refunded the difference. Thank You AmazonFirst let me say I'm old school; I was using a totally manual camera up until now, but decided to jump on the DSLR wagon when I was using my wife's point and shoot digital camera for some candid shots. I liked being able to immediately download and have my pictures.  I'm not rich and had limited funds to make this jump. None of my old lenses are auto focus so there was nothing to tie me down to a brand name, and am not brand loyal I have owned Nikon, Pentex and if anyone remembers Practica brand names. I looked at the market and looked at cameras. There are many cameras in the price range of the E-500 and many that are way above it. In the end, dollar for dollar the Olympus won out. The automatic sensor cleaning technology is a must, and the kit lenses have been reviewed to be much better quality than other brand camera kit lenses.  And two lenses give me a jump on my new set up. [...].The camera works great, take good pictures. I took pictures of my kids at a band concert, the school did not turn on the spot lights so there was a low light problem to face. I shot the pictures on ISO 1600 and yes there was some noise as expected but it works like it should. My hand shaking was the problem. Olympus just came out with the Evolt E510 which adds ant-shake but also cost two hundred and fifty dollars more. If I were starting the search over  I would consider  the E-510 because of the 10mp and anti-shake.", "Date": "March 8, 2007"}, {"Title": "Falls Short of Expectations", "Author": "J. Marken \"fly tailwheel\"", "ReviewID": "R1VLNV73I6S62", "Overall": "3.0", "Content": "I had high hopes for this one...  I have had an Olympus C-2100UZ for about 5 years and it has been a great camera, but I was ready to upgrade to a true digital SLR.  I have had very good 35mm SLR cameras for a couple decades and been a serious armature photographer.This camera disappointed me.  It sure has an amazing number of features packed into it, but in the end a good camera boils down to photo quality, period, and the photo quality I get from this camera is not as good as I get from my C-2100UZ (a long ago deprecated 2MP model).The E-500 does best outside with bright light, but inside it has serious focus and exposure problems.  The photo quality is more on par with an old 110mm camera, or a Polaroid.  They are just not at all crisp and clear as you would expect from a camera of this caliber.  The photos are either grainy or out of focus.  It uses the flash to create light for the auto-focus in low-light scenarios, which drives human subjects insane, and must just not really work very well.  I tried manual focus too and still it just doesn't take clear pictures inside.Most professional reviews (e.g. PC Magazine) seem to echo the same...that this camera is okay, but just not quire there yet.I returned this one and ordered a Nikon D50.  A lot more 3rd party lens options are available for it because it's built on existing standards.  Maybe the problem with the E-500 is the new \"four thirds\" lens system...and if so maybe they will eventually get that right, but for now, and for this kind of money, I suggest you buy the Nikon, or wait for the next generation Olympus DSLR but then still read the reviews to make sure they got it right.", "Date": "December 29, 2005"}, {"Title": "Better than expected", "Author": "Eduardo Torre", "ReviewID": "R2BCUSXKA7ZPBA", "Overall": "5.0", "Content": "Originally I have my doubts about this camera so I started to look for reviews and compare it with others.  I have very little experience with digital cameras however the Olympus Evolt E500 was easy to manage and took me an easy curve to learn. Same day I read the manual took a few photos.  The \"Scenes\" feature has became my best body and the explanation about the type of photo you want to take its easy to follow.  Basically there is not way you waste a photo.  If this camera is good for starters, and with the zoom lens makes you a winner.  Very good price & 8 megapixels is more than enough.", "Date": "August 23, 2007"}, {"Title": "Absolutly perfect! You will not be disappointed...ever!", "Author": "Heather Nebel", "ReviewID": "R3CEK8KMQGRWCX", "Overall": "5.0", "Content": "I have had this camera for over a month now and shot dozens of scenes. It has yet to fail me and the results are wonderful. The colors are so crisp and bright. There are 15 different scene modes available for the less than average camera operator and they are fabulous. I just shot a fireworks display over the weekend and the results were amazing. I've had several people tell me they thought a professional photographer took the photos. That felt good! It's very easy to use right out of the box but yet there is plenty to learn for those that wish to become more advanced. The price is awesome, you can't touch a competitor camera for this price with two lenses. I can't say enough good things about it. Don't hesitate, you'll love it!!", "Date": "July 2, 2007"}, {"Title": "Olympus Evolt E500", "Author": "J. Ruble", "ReviewID": "R2HOFWAMDZY1GG", "Overall": "5.0", "Content": "I use to have a Minolta 35mm in the past, but this camera and the lenses that come with the camera is by far the best!!  The pictures are clear and very colorful.  I like to take photos of old churches and old towns or buildings and I use the Sepia setting, it makes the photos look old and antique.  The black and white photo setting takes excellent photos as well.  The viewing screen is larger than other cameras, and clear.  I am not an expert photographer its just a hobby.  This camera is great for beginners and up.  It is so easy to set up and start taking pictures. I recommend that you get the 2GB compactflash card.", "Date": "April 2, 2007"}, {"Title": "New Evolt 500 Camera", "Author": "Charles E. Miller Sr. \"Chuck The Fishman\"", "ReviewID": "R2COVM7U6CHC2X", "Overall": "5.0", "Content": "I am more then pleased with my purchase of my Olympus Evolt 500 Digital SLR Camera . It excides all my hopes i had when i bought it. It takes the greatest pictures and is simple to use. I enjoy all of its great features too.  Thank you Olympus For building such a great product.  Charles Miller Sr.", "Date": "January 9, 2007"}, {"Title": "Very good SLR", "Author": "A. Flora", "ReviewID": "R1SR6SHBOZPHCN", "Overall": "4.0", "Content": "For anyone who is interested in amateur photography. Simple and yet very complete", "Date": "February 6, 2007"}, {"Title": "Great Camera", "Author": "Yiannis CHRYSOSTOMIDIS", "ReviewID": "R3NDWNNU3J693F", "Overall": "5.0", "Content": "Great Camera for a great value. Two interchangeable lenses with very good quality for the money. Very nice and clear pictures", "Date": "March 23, 2006"}, {"Title": "Fulfils expectations, but watch out for delivery times ..", "Author": "Resident Skeptic", "ReviewID": "R1YAIBF59O41KQ", "Overall": "4.0", "Content": "The product is satisfactory - you would not expect any less from Olympus. The shipping and the associated wait? That is another story! I chose free shipping (kick, kick!) and thought the the product would reach me in 5 to 9 days. No - it would \"SHIP\" in 5 to 9 days from wherever it is. So, for the next 9 BUSINESS DAYS, I watched my order - the product sat in a warehouse. I was tempted to cancel and get it via overnight shipping a couple times - or try the Prime Shipping as a one-off thing - but that would not be fair, right? Painstakingly, the product moved and came tantalizingly close - about 15 miles from where I live - and sat in a UPS warehouse for 2 more days. The last time UPS was supposed to deliver, it had just noted \"Premises closed\" - when I was at home waiting for the package all through the 8 hour window - and at around 2 PM the day of the delivery, I started getting the feeling that UPS would find a lock dangling at my place. Ultimately, it did not turn out to be the case. Overall, it took more than 12 days to travel 100 miles or so.To rub it in, the battery took HOURS and HOURS to charge - it takes from 8 to 10 hours to charge fully. So, if you are in a hurry, do not order free shipping and add 10 hours to the UPS window to estimate the time you would first use the camera.Results of the camera - excellent. I prefer to use the xD card in order to avoid the bulk and number of pins (that can go out of alignment - see another post in this trail) of a CF card. The xD card, in my experience, has been extremely stable and have used one for 3+ years. Also, if you have RM-1 from an older Oly, you can use that remote here as well!The reason I deducted 1 star .. my patience ran thin with the S&H; process.", "Date": "April 11, 2007"}, {"Title": "olympus e-500", "Author": "djakata strother", "ReviewID": "RHSLO168DT332", "Overall": "5.0", "Content": "i love this camera. this is exactly what i wanted and with a fabulous price.", "Date": "January 12, 2007"}, {"Title": "review of olympus e 500", "Author": "Willem Delooper \"artman\"", "ReviewID": "RSPS71CRVUP3G", "Overall": "4.0", "Content": "a fine camera. the only thing wrong with it is a bad bettery door. this needs to be redisgned. otherwise 5 sTARS.", "Date": "August 9, 2007"}, {"Title": "Simply Amazing!", "Author": "SteKar \"A passionate photographer\"", "ReviewID": "RGSC9NLVCHUO7", "Overall": "3.0", "Content": "The first camera I got had an autofocus problem, thus my bad ratings and concerns. As a result, I've purchased a Nikon D50 instead. However, everything's changed when my friend bought the E-500. Much to my surprise, the camera did focus properly and was a real pleasure to use. However, he has been a Nikon 35mm camera shooter for a long time and he accumulated quite a bit of lenses. He also loved the E-500 but realized that buying yet another set of lenses was not viable.So, we simply exchanged our cameras:)The E-500 is very well built and is packed with tons of features. From dust-reduction technology to incredible colors. Yes, the Nikon D50 focuses faster and performs better in low-light and in high ISO, but once you get used to these shortcomings, you end up with an all-around camera.I love the big LCD and all the tweaks you can do (white balance, RAW+JPG...)", "Date": "November 2, 2005"}, {"Title": "so far so good", "Author": "Rohit", "ReviewID": "R1WPBQFIG46Z88", "Overall": "5.0", "Content": "i've this camera for about a month now and in a month i already have few shots which i can enlarge to the max. perfect digital SLR, its the one i was looking for. all i can say is, its just great so far.", "Date": "June 9, 2007"}, {"Title": "Olympus E500 - Great For Manual Camera Users", "Author": "Porsche", "ReviewID": "RCU88DV33OK2F", "Overall": "5.0", "Content": "This camera takes amazing crisp clear pictures. Much better than my old Olympus D-540.This is an especially wonderful camera if you're a photographer looking for a digital slr for manual use.However, If you can afford it, I recommend buying the Canon EOS instead.", "Date": "May 10, 2007"}, {"Title": "Excellent value for the money", "Author": "Shaji Vayaveetil \"Crazy Walker\"", "ReviewID": "R2BFD2BPIPVDMK", "Overall": "4.0", "Content": "Before buying my first DSLR I researched lot and narrowed it down to Canon XT Rebel and EVOLT-500. Finally I bought EVOLT-500 from Amazon just before the Thanksgiving. So far I explored various settings and took photos indoor and outdoor. The photos came really excellent and I couldn't find any reason to edit the photos as some people mentioned for photos at low light settings.The reason I gave 4 stars is I need to explore the more of it.", "Date": "December 20, 2006"}, {"Title": "Do not buy this camera.  Could not focus.", "Author": "CandyGuy", "ReviewID": "R1XQNBI0MLRYQE", "Overall": "1.0", "Content": "Had this camera for a few years.  Always felt pictures were not very sharp.  I though It might be problem of my naked eyes.  Unitill recently, I happened to take pictures on some prints, and pictures came out so blury it could not be read(I was using a tripod). I switched to a Sony camera, which is not as fancy as this one, and the result was 1000 times better.  Wow, what a disappoint.", "Date": "October 4, 2010"}, {"Title": "There's better out there, and cheaper.", "Author": "J. Hall", "ReviewID": "R3NS5KY0S65V9E", "Overall": "2.0", "Content": "The E-500 is my first DSLR. I have owned it for about two years. Overall, the camera is not too bad for what it is, but you need deep pockets for any upgrades. Also, the kit lenses are soft (fuzzy). Later, you will find out that the \"high grade\" upgrade lens are soft, too. This camera is about the same level as the Canon Xti. If you have ever dreamt about learning professional photography, go with Canon or Nikon and forget about this camera.", "Date": "January 13, 2008"}, {"Title": "Dream Picture", "Author": "Rafiqul I. Talukder", "ReviewID": "RGVWOQXHTTQTK", "Overall": "4.0", "Content": "I used this camera to take basic picture. You can use this camera and become a pro in a day.", "Date": "January 9, 2007"}, {"Title": "Great camera!", "Author": "M. Crawford", "ReviewID": "R1WEZJTS4FK7JO", "Overall": "5.0", "Content": "I'm new to the world of DSLR's.  I considered the Rebel XT, but I felt that this camera was a better value, considering I have no other lenses.  So far, no complaints.  I have a lot to learn!", "Date": "June 2, 2006"}, {"Title": "Dont use a compact flash card with the evolt 500", "Author": "backroadsrider", "ReviewID": "R1U2SO90S7WCPX", "Overall": "1.0", "Content": "I bought this camera two months ago, and had no problems with it until I went to put the  Compact flash card in one day, and I got an error message from the camera stating a card error.  I then went out and bought an xd card and tried to put that in the second slot that this camera has.  same story.  I have sent this camera back to Olympus, who are now telling me that a tiny pin was bent when putting in the compact flash, and they will NOT cover this under warranty, and they want 250.00 to fix it.  They have yet to explain to me why the xd card does not work either.  So the bottom line is beware putting a compact flash in your camera because if it bends one pin, your 800.00 investment is now useless, and OLYMPUS WILL NOT HONOR THIER OWN WARRANTY, or even entertain the fact that they made a defective unit.  I can now no longer use any of my compact flash cards with this unit for fear of a 250.00 hit everytime I dare to put one in.  THANKS A LOT OYLYMPUS>", "Date": "May 16, 2006"}, {"Title": "Worst Camera I have ever used.", "Author": "Nick", "ReviewID": "R2OMDKAAK0WKEI", "Overall": "1.0", "Content": "I'm a film major so ive worked with a few cameras - this is by far the worst one I have been forced to touch. I bought it at a discount brand new and have been disappointed every time I use it. It won't let you do what you want and if you tinker with any settings it automatically lowers the shutter speed making everything incredibly blurry and wont let you change it. If you shut the flash off the pictures arent even visible and if you put it on auto it takes about 3 minutes for the camera to finally stop auto-focusing and by then the picture is usually gone. There is no option for manual focus which makes this camera completely useless for the price. DO NOT BUY.", "Date": "August 13, 2011"}, {"Title": "Don't buy this camera", "Author": "K. Wilson", "ReviewID": "R283P16969MX6", "Overall": "1.0", "Content": "I have been using SLR cameras for 30 years and have had a digital camera since they came out on the market, most will last at least 5 years. This thing began to break a week after I got it. The second time I removed the compact flash card two of the pins came with it which rendered the slot useless, fortunately the XD slot was still functioning. One week after the waranty expired the thing stopped working completely.The pictures were ok but nothing to brag about, my little Casio Exilim takes much better pictures than the Olympus ever took in any mode and it only cost  $ 150 that was $ 500 less than the Olympus.Get a Fuji S700 or a sony DSC H5 they give professional results and require no expensive special batteries or cards. Both offer manual and automatic settings which work great and are simple to use for the beginner or the professional and both are under $ 250.", "Date": "January 15, 2008"}, {"Title": "compact flash pins", "Author": "UDO WAHN \"noworez\"", "ReviewID": "R3BPXUA5R2RSO7", "Overall": "1.0", "Content": "Olympus will not honor their warranty if you bend a pin inside the camera body. Mine bent with normal use within 6  months. That my friends will cost you $ 250!!!!!What a bunch of bull from what I thought was a reputable company. Shame on you Olympus!", "Date": "December 20, 2006"}, {"Title": "camara maravillosa", "Author": "Jose Rodriguez \"JoseLuis33\"", "ReviewID": "R17WIQMYASC02V", "Overall": "5.0", "Content": "Dear Mr. of AmazonYou estan offering the following one I articulate: Olympus Evolt Digital E500 8MP SLR with 14-45mm & 40-150mm + 2GB Accessory Kit now I buy to You the 27/02/2007 to them, camara Olympus Evolt Digital E500 8MP SLR with 14-45mm & 40-150mm, You then did not offer that Kit to me. Now I am seeing that they estan offering that Kit but with camara, Mr. I I have camara You, me you can sell the single Kit, PLEASEJOSE LUIS", "Date": "March 29, 2007"}, {"Title": "This Camera is LOADED", "Author": "Amy Nebraska \"Amy\"", "ReviewID": "R1F33C725YEDFD", "Overall": "1.0", "Content": "After doing my reseach I purchased the Evolt e-500! I was very excited about this purchase. Here is what I liked about it!1) Large LCD Screen2) It came with 2 lense's3) It has so many neat settings4) It felt nice in my hands.5) The construction was very nice!6) I like the 2 card option!Okay now for what I didn't like!1) I am new to Digital slr's and really didn't like the low light focus issues. The camera kept spiting out flash to help aid the focus. This I could work with as I think many digital SLR's do this in low light.2) The LCD screen was really bright and the images were not sharp. I have a friend who is a Pro and had the same problem with the E-500 that he purchased.I returned the camera within 24 hours to the store. I think that I just happened to get one with a bad LCD screen and desided not to get another. Someday I might buy one again but not at this time.I have a few Canon Lenses and film body and desided to go with a Canon D10 body and I am purchaseing an ef 28-135 IS lense.I do think the E-500 will be alot of fun for whoever purchases it but at this time it's not the camera for me.", "Date": "February 9, 2006"}, {"Title": "didnt like it.", "Author": "Bijou_Baby", "ReviewID": "RVEN8PTT6LUSW", "Overall": "2.0", "Content": "didnt inspire me to take pictures. looks dull and eh.the lens kit is a great price but thats all.", "Date": "August 30, 2007"}, {"Title": "Oouch, It's not Canon or Nikon so I can't say much.", "Author": "SavvyShopper \"SavvyShopper\"", "ReviewID": "RQDC6E9HR943", "Overall": "2.0", "Content": "I bought E500 as birthday Gift for my brother , hoping he will love this camera.  I am not sure what features he did not like, but he told me to get him Real DSRL like Canon or Nikon and return this one.He complained about shutter speed, startup time and also lack many many things which he loved in other cameras but I did what he wanted to do and got him Canon Rebel XT , which made him much happier.I am guessing it is still a good camera, but may not be upto real DSLR grade as Canon or Nikon are.", "Date": "August 25, 2006"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B000BK393Y"}}