{"Reviews": [{"Title": "Excellent value", "Author": "Reviewer X", "ReviewID": "R72PYBZYFKZZB", "Overall": "4.0", "Content": "I have had this digital camera/camcorder for about 5 months.  I have taken it everywhere and I love it.  It takes great pictures, is easy to use and upload to your computer.  The view screen is very good and battery life is decent for a digital camera.There are some problems:1) the stabalization in the video mode does not work very well and is too shaky.2) the menu to change the settings is awkward in places and not easily figured out.3) in bright light the LCD screen is not good and very, very hard to see.For under a hundred bucks it is a great camera.  I bought additional memory and the camera is more than serviceable.  It goes without saying that if this camera was 200 dollars it would not be a good camera or a good value, but for a first camera it is excellent.", "Date": "May 14, 2006"}, {"Title": "A good buy for the money", "Author": "B. Lazarus", "ReviewID": "R2DS6MRJMRZLVF", "Overall": "4.0", "Content": "So, I had to replace my 17 year old Panasonic palmcorder. I knew I wasn't going to be continuing with a camera that utilizes a c size cassette. And, seeing as how christmas just came, I didn't want to spend a lot of money, or make a permanent decision on what kind of format to go with. I made my decision after reading many reviews on some of the cheaper models. At $59.50, how could I go wrong. From reading reviews, i knew I was buying a camera that wouldn't be great indoors. But, outdoors, the video it shoots is really quite good. And, even though I wasn't buying it for still shots, I was very impressed with the two shots i took of my daughter. The camera is tiny, and almost feels like a toy. The doors to the memory compartment, and where you hook up the wires are very flimsy, but, so far, so good. It does eat up batteries big time, but, if I decide to use this for a while, I'm going to get rechargeable ones. I've read some reviews on this model where people were complaining that it doesn't have enough memory. I bought a one gig memory stick for under 20 bucks.  At under a hundred bucks you can't go wrong with this camera. Just don't have high expectations of using it indoors. Although, I did use it recently in an indoor situation with a lot of natural light coming in, and it came out much better than i expected. Combined with the price I got it for, I give it an excellent rating, but be very gentle with compartment doors. I am amending this review to 'good' on March 11th 2007  because one of the compartment doors is now in two pieces. And all I did was remove it the only way you can. And it just came off in two pieces. It does still go back on. It's the cover for the spots where the different input wires would plug in. I should also mention that the software with this camera does some pretty good things. I was able to edit out a short clip from a video and email it to a neighbor, and you can also make a jpeg from a video still shot. The zoom on this camera is digital, which I have now learned, is pretty useless. I've now learned the hard way that you need an optical zoom to be able to have any clarity as you zoom in. But, at under 60 bucks, it's still a fun toy. I even have mp3 clips loaded in and it does work well as an mp3 player. You can fill a memory card with music, and have a cheap ipod. But, who knows how long this thing will last?? It's a good way to learn the world of digital recording. And I didn't even get to the voice recorder...it works well.", "Date": "February 5, 2007"}, {"Title": "Horrible. Cheap cheap cheap. Not worth more than $10.", "Author": "Matthew A. Kaspar \"kaspa\"", "ReviewID": "R2N7X6AJ16ON79", "Overall": "1.0", "Content": "Feels cheap, parts don't fit together, won't start with memory card in camera. The screen is smaller than the picture would have you believe - the screen doesn't fit when flipped down - the memory card door doesn't stay put - the over all feel is of really cheap plastic. Batteries last all of 20 minutes..not worth a dime.", "Date": "January 18, 2007"}, {"Title": "3 minute videos", "Author": "Kim M. Proulx", "ReviewID": "R2706J3ANOPG97", "Overall": "1.0", "Content": "I would suggest buying a video camera that holds more memory because this one only allowed us to tape about 15 minutes worth of video and then it was full.  The pictures were also dark.  I would suggest shelling out more money to get a better product cause this just wasn't worth it.", "Date": "January 3, 2007"}, {"Title": "Watch out for products like these...", "Author": "Blue Fire", "ReviewID": "RHWWYADMO0YD6", "Overall": "1.0", "Content": "This was my first digital camera and the quality of the pictures were OK. But everything else about it was a surprise... The batteries burn out extremely fast, just after taking 9 or 10 pictures or playing a song for 3 minutes. The video playback was choppy on the LCD screen and wouldn't even play on my PC. The audio was really hard to hear out of headphones, and so on... In my opinion, this camera is OK just for taking occasional pictures of stuff, but it's a really cheap camcorder and MP3 player. This product was completely unsatifactory to me, so I had to return it. I wouldn't buy it if I were you...", "Date": "November 7, 2006"}, {"Title": "it's all about the battery life", "Author": "G. Espada", "ReviewID": "R3HB0OCSK69TWV", "Overall": "2.0", "Content": "it really sucks them dry quickly.  if you're going to buy a cheap camera and have to spend 3 or four bucks every time you want to use it for more than 5 minutes, well, not so cheap!  The A/V quality is so-so, but that's not such a big deal, it actually makes for an interesting \"artsy\" effect.  But really, I need to find one that has better battery life, or invest in some rechargeables!", "Date": "August 29, 2007"}, {"Title": "Got it in time and it worked", "Author": "robert", "ReviewID": "R33M5AJJ3KAPPQ", "Overall": "4.0", "Content": "so this item needed to work because it was going overseas and I'm never going to see it again.  I have not seen any videos yet but it was recieved well, delievery was just fine.  Excuse me but it seemed refurbished, like a display model got the book and cheat sheet.", "Date": "November 14, 2012"}, {"Title": "Not impressed", "Author": "Ernestine A. Butler \"Ernestine A. Butler\"", "ReviewID": "R1B4MNSNIM6ZWF", "Overall": "1.0", "Content": "I constantly had to replaced the batteries and it did not focus very clearly, no thanks!", "Date": "March 1, 2010"}, {"Title": "worst thing I've bought", "Author": "C. Johnson \"musiclover\"", "ReviewID": "R3DOEUAHY9R81A", "Overall": "1.0", "Content": "I purchased this a christmas present for myself so I could video tape my children opening gifts. I could not get it to load up completely when I pressed the on button. The screen kept sticking. I finally got it to take 3 pictures but could not view them.  It's not that complicated to work but I personally believe it had prior damage possibly from water.  I have tried to contact the seller  to return it and they swear they only used it once and it worked great for them but.. however it does not work properly at all!! I wish I hadn't purchased it.", "Date": "December 30, 2008"}, {"Title": "terrible flash camera", "Author": "Jurandir S. C. Filho \"pandora\"", "ReviewID": "R3FX6CHKXXHFMQ", "Overall": "1.0", "Content": "i bought this camera to record my surfing, it says 8 X zoom , but when you zoom the camera it get all wrong with the focal distance.about the lcd, all i have to say is that you can not see nothing if is too sunny, how you can get anything if you can not see what is going on.and the battery life i think is some kind of joke, i recorder no more than five minutes and is all gone.And the worst part is that i live in brazil and can not return the product.", "Date": "November 11, 2008"}], "ProductInfo": {"Price": "Unavailable", "Features": "1.5\" Swivel LTPS LCD Screen\n640 x 480 Video Resolution\nBuilt in flash\nVideo Stabilization\n8X Digital Zoom", "Name": "MUSTEK DV5300SE 6-In-1 Multifunctional Camera (Silver)", "ImgURL": "http://ecx.images-amazon.com/images/I/514S45MJFSL._SY300_.jpg", "ProductID": "B000AA706C"}}