{"Reviews": [{"Title": "A dandy travel companion", "Author": "Stephen Ege", "ReviewID": "R5BFY1PID5GZF", "Overall": "5.0", "Content": "Michael Reichmann brought this camera to my attention in his excellent photographic website, Luminous Landscape.  He takes the little camera along with his more serious gear in order to capture snapshots and the occasional gallery quality image. Since his original review, he continues to prize the camera, most recently doing duty in a spring, 2006 photo shoot in Africa.Having just returned from a trip, I find this a dandy little camera.  I shot about two hundred photos with it.  The issues with low light sensitivity (high ISO settings) are certainly there.  I would limit use to 80 or 100 ISO.  There is another issue general to all these little cameras.  Because of their light weight, it can be difficult to maintain a steady grip so that images are not blurred.  I also prefer to shoot through a viewfinder, not the back of an LCD screen - but that is the trade off for size.  The LX1 has optical image stabilization to help you, and I found its use essential.  The 16:9 aspect ratio, the same as for high def TV, is very pleasing in many exterior and interior situations. You can also pick two other, narrower aspect ratios through a switch on the lens.  The sensor is a true 16:9 sensor, meaning you get full resolution, up to 8 mp, at all aspect ratios.There are a number of camera friendly aspects to this camera.  For one, it will fit easily into the inside pocket of a light outdoor jacket or the inside pocket of a suit.  The battery recharger is tiny and light with no cord.  Just insert the battery (about the size of a thick postage stamp) and plug the recharger directly in the wall.  So it's easy to pack for a trip.  If you start the camera without removing the lens cover, the camera notifies you to remove the lense.  This has the effect of training you to always replace the lense when the camera is not in use, protecting the excellent Leica optics.  It has several modes for common situations, such as shooting at parties (I found it worked well to capture both the subject and background using flash).It has a very easy to use auto shoot mode that let's you get into the picture.  It is located on a button in the back, so you don't have to hunt through menus to find it.  Because you can use manual focus as close as 5 cm in a wide angle format, you can shoot a picture of a group of people at your table - just place the camera on an overturned glass at the end of the table and wait for it to click.  The auto shoot mode can also be used to deal with low light and less than steady hands.  It has full manual mode capability so you can adjust parameters to you liking.  It has a 2 or 10 second delay.  Using the 2 second delay and bracing the camera on a nearby support or on your chest (hold your breath), you can capture excellent indoor pictures without flash.  I used this several times to capture sharp, well saturated color panoramas of church and monument interiors.  They look like picture postcards.The camera is one of the few, or only, to shoot in RAW mode, allowing complete control of the picture when you download to your computer for printing.If you are a fairly serious amateur, or a professional like Mr. Reichmann, you will find this camera a handy and fun traveling companion to your Canon or Nikon.  Or just take it alone, as I did, when you don't plan on doing any serious shooting.", "Date": "November 15, 2005"}, {"Title": "Exellent Camera provided you use it at lower ISO levels", "Author": "Cobra", "ReviewID": "R3KPLUY9K7O7ZZ", "Overall": "5.0", "Content": "A prior reviewer \"Bruce\" really does Panasonic and this camera an unfair disservice.  Succintly put, half truths and half stories are often worse than no truth at all.  Quoting partially from [...] and their review of this camera does indeed suggest that this would appear to be a bad purchase.  Even the reviewer at dpreview clearly indicated that this camera has incredible resolution and sharpness with a fabulous feature set of adjustments that will more than compensate for any noise issue at lower ISO levels (where most people will be anyway with the camera).That reviewer merely cautioned users that noise is definitely an issue at ISO levels above 100 and he voiced his disappointment in that area for sure.  However, he clearly went on to state that images at 80 and even 100 ISO can indeed be very good!  I think my message to those reviewing these comments is to \"ALWAYS\" fully check facts out for yourself and don't rely on \"selective partial quotes\" that fail to take the whole situation into consideration.  So if you want a camera for use at high ISO levels, this is definitely not the camera you want.  However, if lower ISO levels are fine for you then by all means this is an incredible camera . . . as the dpreview author clearly enumerated.People hear the word \"noise\" in a camera reivew and they panic!  Got news for you folks . . . noise goes up with increased ISO significantly in every single digital camera on the market and this one is no exception except that most cameras don't visibly start to show it until around 200 ISO.  This one begins to show it at 100 ISO.  But even then just a bit of post-processing with many photography programs can easily remove it at these levels.Bottom line . . . this is an incredibly good camera for people genuinely understanding photography.  Even Leica found this camera to be perfectly fine and they have come out with an exact copy of it themselves and they only make superior quality equipment folks.  I purchased this camera several weeks ago via \"grey market\" and the images are incredibly good at 80 and 100 ISO.  Don't take my word for it . . . review the sample images at [...] for this camera, as well as the two gorgeous samples (2 girls) on the leica site for their corresponding version of this camera.  That should end the panic over \"noise\".  Lions and tigers and bears . . . oh my!", "Date": "October 7, 2005"}, {"Title": "a joy to use", "Author": "Rumi \"Ceci\"", "ReviewID": "R1X5ME1W7BLYHI", "Overall": "5.0", "Content": "This is an incredibly good camera.  For it's diminuative size, there's very little \"wrong\" with it.  Sure, it doesn't excel at high ISO shots and due to it's size, the flash is a little weak and there's no optical viewfinder.  But other than those things, I can find no real flaw.  It's very easy to clean up noise in postprocessing by using noise ninja or neat image.  Unlike other pocket cameras, the LX1 doesn't do much NR for you and it even supports RAW for those that really want to take charge of their image processing.  That means you have the control.  If you're the kind of person that enjoys a bit of postprocessing and plans your pictures around a camera's strengths and inherent weaknesses, then the LX1 will be a joy to use.  In my opinion, it may not be the best camera for a pure snapshooter that is new to photography, but it's very rewarding for the advanced amateur or the pro looking for a pocket cam to keep along side his/her dSLR.", "Date": "November 22, 2005"}, {"Title": "Best in class.", "Author": "Quick Smart", "ReviewID": "R2LB8LELMWJH2E", "Overall": "5.0", "Content": "I've worked for many years in the photo/video business as a camera operator for some of the top news shows on television and can honestly say this camera is current technology at its best.It is small, solid and able to take stunning photographs and save as data - raw - for the best in image preservation.  Having raw data is to digital what having the original negative is to film.After using this camera for about a year now I can't report one negative... it is the best point and shoot camera.It does have small chips and all the attentive drawbacks like low dynamic range, noise at higher iso, blooming highlights, etc.. All digital still cameras under $2000 use small chips.Use your photography skills to work around the limits and you'll be rewarded with technically outstanding photos... I know a National Geo photog who regularly uses one on assignment.  Another friend shot Katrina with one for AP.It is a very sturdy camera, highly portable, well designed with intuitive controls, and capable to taking fine art quality photos.  The wide end of the excellent leica lens is comparable to 28mm in the 35mm format and very clean. In the end analysis, it is a very well engineered piece.  In fact, Leica is selling basically the very same camera, but with a titanium body, as the D-lux2... the electronics and glass are the same.... for quite a few more $$$.One of my all time favorite cameras (and I regularly shoot with cameras that approach six figures - Pro HD video and have worked with stills from hasselblad, nikon, mamiya, contax, leica... )", "Date": "September 11, 2006"}, {"Title": "Great point and shoot camera that can do a lot more.", "Author": "Hien Le", "ReviewID": "R28D5B7CUOWO90", "Overall": "5.0", "Content": "I purchased this camera a month ago to replace my \"profoundly antique\" but still fully functional 3.3 megapixel Nikon Coolkpix 990 that I bought years ago when it first come out. My final decision was based on two considerations: its ability to produce great images in most if not all of my picture taking occasions (this ability is due to the camera's 8.4 megapixel count, its great Leica lens with 4x zoom and 28mm wide angle view, its three picture formats 3:2, 4:3, and HDTV 6:19, and last but not least, its reliable image stabilization) and ease of use.I have not been disappointed in my choice. I have made about 500 shots and every picture looks great in terms of sharpness, exposure correstness, and color balance, especially when the high aspect ratio format is used. Having read most reviews of the camera in sites such as DPReviews, CNET, PC Magazine, etc...where dire statements about the \"unacceptable noise level\" of the pictures the camera produces was discoursed at length, I was quite relieved to find that in my picture taking situations (outdoors in daylight with or without clouds in 95% of the cases, balance indoor with flash at parties) the noise level of the pictures when viewed with PhotoShop 7 at high magnification was from minimal to nowhere to be seen. I also discovered that, if you read the user manual and follow its instructions to set the picture adjustment level to high noise reduction, then noise is pretty much eliminated. There is a caution: this high noise reduction setting cannot be obtained when you use the fully automated or \"point and shoot\" mode.Regarding size and usability, the camera is small (fits in my shirt pocket) and very easy to use. The menu system is simple and highly accessible. The camera provides a surprising high degree of manual operation. I can manually focus, set aperture, select aspect ratio, set shutter speed. The camera even has a micro mouse to move around the menu system. The large 2.5\" LCD display (it has no optical viewfinder) is bright, even after I applied a protective polymer film (from Radio Shack, USD6.5 for a pack of 4 3\"x6\" sheets)BTW, I went to Amazon to check out this camera's price and end up buying it new in the box with US warranty elswhere (Butterfly Photo) for USD 420, i.e., at a price significant below Amazon's.(They charge an extra USD10 for the black model, so this is a black mark against them since everybody else including Panasonic sells either model at the same price)Conclusion: I highly recommend this camera if your shooting parameters are like mine (outdoors mostly, some indoors with built-in flash).", "Date": "April 19, 2006"}, {"Title": "Panasonic Lumix LX1", "Author": "Dr. Lothar Riedel", "ReviewID": "R21NGYE0R0FKIW", "Overall": "4.0", "Content": "I love this camera as an alternative to my Nikon D200 whenever weight or space is an issue.  It is one of the few pocket-size cameras on the market that can give you the option to shoot in RAW and offers extensive manual control. The Leica lens is superb and so is the picture quality. Manual control is available for most features I would like to have control over. The controls are easily accessible and intuitive despite the small size of the camera. The 16:9 picture format is great for landscape shots. I use this format most of the time. Image stabilization works very well. Noise is not really an issue if one shots in manual mode with a low ISO. The price is a bit heavy. However, I could not find a comparable camera (RAW format, manual controls, small size etc) at a more competitive price.I wholeheartedly recommend this camera to any photographer who is looking for a pocket-size camera with extensive manual control and the possibility to shoot in RAW.", "Date": "August 10, 2006"}, {"Title": "The latest splendid compact Panasonic Lumix with Leica zoom lens", "Author": "John Kwok", "ReviewID": "R2YQEKWY0NN76D", "Overall": "5.0", "Content": "If you need 8 MP image quality in a compact digital camera, then you won't go wrong with this camera. It has earned superb reviews in several photography and computer magazines for its compact size, ease of use, and superb optical quality. Admittedly, it isn't nearly as quiet as a Leica 35mm rangefinder camera, especially under low light conditions, but nonetheless it will suffice for most types of digital photography. Panasonic has done a fine job in offering a range of digital cameras laden with features such as superb Leica zoom lenses at prices which are comparable to the competition from Canon and Nikon.  This new Lumix is not only yet another fine offering from Panasonic, but judging from its specifications, looks to be among the best in its class.", "Date": "October 7, 2005"}, {"Title": "Exceptional camera...but", "Author": "TEH \"tehschhi\"", "ReviewID": "R1MNL9CU14YCKX", "Overall": "3.0", "Content": "Finally, after waiting nearly 6 months, the DMC-LK1K arrived.  In almost every respect, it meets or exceeds my expectations.  The 16:9 aspect ratio is exceptional; density and color are spectacular for a point and shoot; the bracket mode takes all the guess work out of exposure; and the optics are incredible; just incredible.  However, there are two serious problems.  First, the camera does not ship with a protective cap for the LCD screen.  Thus, one risks scratching the outer glass when simply handling the camera or storing it in your camera bag.  Second, the lack of a viewfinder becomes a real problem when the sun is behind the camera (which it should be for proper lighting!).  The glare on the LCD screen's outer glass is just horrible.  You cannot see a thing without shading the screen with one hand and pointing and shooting with the other.  Panasonic needs...urgently needs....to start providing a protective cap AND some sort of after-market pop-up shade or hood for the LCD screen.  Otherwise, this camera is not going to enjoy the wonderful reputation it deserves in all other respects.", "Date": "November 6, 2005"}, {"Title": "Brilliant piece of art and perfect Leica lens + O.I.S.!", "Author": "Thomas Tompson \"Tommy\"", "ReviewID": "R20UA8Q6XQDOHF", "Overall": "5.0", "Content": "First of all I want to point out to the previous reviewer who has stated that digital photography website claims something about very high noice level of Panasonic lx1.This is totally untruth. There is nowhere in review of lx1 you can find such a statement.Now about LX1 Pros and Cons: Since the moment I got this camera on my birthday I've been impressed with its outstanding screen quality, picture quality and of course the most essential feature that all other brands are missing: Optical Image StabilizationPROS:-Mega O.I.S. works perfectly just like on others recent Panasonic cameras. As a matter of fact, I can claim surely that Panasonic's O.I.S. eliminates bluriness caused by hand shaking 100%. You can easily snap any photo holding the camera with one hand.-Image quality is much better than on my previous Kodak 7530 (even though Kodak 7530 is very Sharp too)-Low light images simply the best I've ever came across to!CONCLUSION: LX1 is a perfect conbination of Panasonic's perfect digital video technology with world's best German Leica lens!", "Date": "October 31, 2005"}, {"Title": "Excellent camera, solid feel, awsome pictures", "Author": "tom \"tom\"", "ReviewID": "R3HIN1DTW7DUDB", "Overall": "5.0", "Content": "I just bought the LX1 and it is an impressive piece of hardware.The fast focus and a wealth of features make it a pleasure to work with. It also works really well in low light situations - yes, with noise, but you still get pictures you would not get with most other compact digitals.It is really built well and very intuitive to use. If you put it in automatic mode, it produces excellent pictures without much thinking. In the manual modes, you can change almost everything, including the focus which offers a lot of creative possibilities.It is larger than you would expect but quite light.", "Date": "October 31, 2005"}, {"Title": "Time to upgrade", "Author": "M. Seither \"The glider\"", "ReviewID": "R2E3BO335KOQYA", "Overall": "4.0", "Content": "Great little camera.  By now though (2009) the LX3 is available and is very much better (if a bit bigger).  If, however, you just want a 16:9 wide angle and don't shoot in low light much and can get a great price (you should by now) it's worth a shot.  I gave it four stars subjectively based on what it meant to me.  My real opinion, however, is to pool your money and get the LX3 (get a silver at great price. It's pictures are no different and you aren't Henri Bresson).  But again, value for the money means getting an LX1 at a really good price and enjoying it versus saving up for the LX3 and waiting a bit longer, which is what I recommend.", "Date": "February 21, 2009"}, {"Title": "Unique camera", "Author": "Ronald Fiesta", "ReviewID": "R33QL0JLBB532X", "Overall": "3.0", "Content": "Not to sound redundant from the other reviews, I'll highlight my pros and cons:Pros:-TRUE 16:9 videos (848x480 pixel MOVs, not the cropped kind.  Product description was wrong stating that it can capture only up to 640x480).-Lengthy 20min video captures if you have a 2GB SD card.-16:9 photos-28mm wideangle focal length-LEICA lens-Excellent outdoor photosCons:-Indoor video/photo is grainy-Video captures have less than stellar audio.-Cap Lens coverOverall:  Despite is downfalls, its uniqueness compensate for it and sets it apart from many cameras.", "Date": "April 5, 2008"}, {"Title": "Top of the line.", "Author": "Robert Stark \"Artist\"", "ReviewID": "R1JX1X697TI1ZM", "Overall": "5.0", "Content": "For those who don't want to spend the price for a compact Leica, here is a Leica lens, new format and great features. Well worth the extra dollars. I'm extremely pleased with how easy it is to use. I've used it now for 4 months and continue to learn how to better use its features. An eight meg size tiff image will give you a spectacular 11 x 14. That's the largest I've tried so far. I'm also using it for black and white photography. So much to learn.", "Date": "September 25, 2005"}, {"Title": "So So! Very bad video! Sorry Panasonic!", "Author": "E. Goldblatt \"Clearsky\"", "ReviewID": "RS6Q7Q8F0N4IL", "Overall": "3.0", "Content": "I have had just about every digital camera you can mention - but this is the first review I've written. I really wanted to like (actually love) this camera - could not wait to get it! Wow - I.S., 8MP, Leica lens - what else could you want! Well - I also bought a Canon SD700 a few weeks ago too (both cameras still within return dates) so I put them to the test. Bottom line - the Canon won hands down! By the way, I also have a Sony P200 - the Canon is still much better. Back to the Panasonic review - pictures were OK - actually not bad, nothing really special - the 16:9 is nice but the pictures appear smaller so you need to zoom in a bit. However the Canon was just as good even at only 6 MP! I use the video option a lot and don't even bother with my old Video Camera anymore. Over the last two week I went to two weddings and produced very nice little videos for the couples only using the Canon SD700 (no shakes to make people sea sick). Clear and sharp video with that little SD700 (you can even zoom in although it gets pixilated a bit). Unfortunately, the Panasonic is pretty very bad at video, no zooming, blurry, and jumpy - and you also must use .mov format to view vs. the more common .avi for the Canon. On the outside - the Panasonic is larger than the Canon and the lens sticks out and use an old fashioned lens cap - now that would be acceptable if the other functions of the camera we good. All in all - I've returned the Panasonic and will keep the Canon - just one man's (I mean person's) opinion!", "Date": "July 19, 2006"}], "ProductInfo": {"Price": "Unavailable", "Features": "8-megapixel CCD captures enough detail for photo-quality 16-by-22-inch enlargements\n4x optical zoom Mega Optical Image Stabilization; 2.5-inch LCD display\nPower LCD function termporarily boosts backlighting by about 40% for ease of use in sunny conditions\nUnlimited Consecutive Shooting allows you to shoot 3 frames per second at full resolution until your memory card is full\nPowered by Lithium-ion battery pack (included); stores images on SD memory cards (16 MB card included)", "Name": "Panasonic Lumix DMC-LX1K 8MP Digital Camera with 4x Image Stabilized Optical Zoom (Black)", "ImgURL": "http://ecx.images-amazon.com/images/I/415HVSJGZBL._SX300_.jpg", "ProductID": "B000A7XZI2"}}