{"Reviews": [{"Title": "Excellent Camera for Average User", "Author": "Amazon Customer \"suthersk\"", "ReviewID": "R1907DFX6GQXLD", "Overall": "5.0", "Content": "This camera works like a dream. Would recommend it for the average person who wants a good camera for family, vacation photos etc. Takes very good indoor flash photos. Colors and resolution are excellent.Has a good feel and easy operation. Lens retracts and lens cover closes when you turn it off.At 4 megapixels you get more than enough resolution for 8 X 10 blowups.Uses \"XD\" format picture (memory) cards. Would recommend you buy the 256 MB card or a 512 MB for a few more bucks. I purchased a Fuji 256 MB card and it works fine. Holds about 260 photos.Can use two ordinary \"AA\" alkaline batteries. However would recommend the NiMh rechargeable batteries. Bought the Energizer 15 minute charger from Amazon which comes with four Energizer \"AA\" NiMh batteries. Long lasting batteries and most pleased. I shot a whole day of photos including many flash ones and did not have to replace them 'till late at night. Great charger and batteries. It's at:http://www.amazon.com/gp/product/B0000DIIAS/103-2880875-1151054?v=glance&n;=172282&n;=507846&s;=electronics&v;=glanceAs with any camera, a case for it is advisable. But buy a case at Circuity City or BestBuy rather than online. That way you can walk with your camera and see how it actually fits into the case and how much stuff you want the case to hold e.g. spare batteries , charger etc.All in all, a good reliable product. Congrats to Olympus.If you buy it, you wont be disappointed.", "Date": "November 26, 2005"}, {"Title": "Good Camera", "Author": "BaPuters", "ReviewID": "RKSBSTOKYJ8H5", "Overall": "4.0", "Content": "[...]Pros:  A good camera for all users.  Good picture quality and easy to transfer to your PC (if you use software other than whats provided).Megapixels.  4.0!Movies!!!  Record movies in quicktime .avi format!  A+  (no sound though)It's a good name brand, with great reviews in computer magazines and on many electronic sites.  A sturdy quality camera worth buying (for the right price).It gets four stars for a couple of reasons...Cons:  The software it comes with isn't really user friendly.  I thought picassa [...] was much easier and had more features.Next, some of the features are spelled out in the user manual.  For extreme up close pictures, like you would do for selling items on online, the up close function isn't spelled out... you have to play with your camera to figure it out.  (If you buy it, there's a circle button with 4 arrows in it, push it to the right for up close pics).Also, the zoom isn't as good as it could be... 2.8X telescopic (good quality), plus another 5X digital (which is poor quality).  But unless you're a professional photographer, this should do for the average joe.Lastly, if you're not carefull, you'll lose battery life quickly.  It's easy to set it down and forget it, and it goes into a standby mode which still uses battery life.  If you forget, it may cost you battery life.Overall:  The con's really are minor compared to the cost to quality benefit you get from this camera...  it has more megapixels than many higher cost competitors, but it sacrifices in the zoom, 2.8X.This is a great camera for anyone to have, great for users of all levels.", "Date": "October 31, 2005"}, {"Title": "Unacceptably slow shutter", "Author": "Brad S. Williams", "ReviewID": "RW9X8H787XE9U", "Overall": "2.0", "Content": "I ordered this based on good reviews here and low price, and because my much older Olympus had been stolen.  But after trying it for less than 5 minutes it was back in the box to be returned, even though I burn thirty bucks on the return.  This camera makes the cardinal sin of having an enormous (2 to 2.5 second) delay between (a) when you press the button and (b) actually taking the picture.  In this respect this camera is slower than my phone camera, and even slower than the 4-year-old 2.1M Olympus I had, amazingly.  If you are taking pictures of people who are moving (i.e. anybody who is not posing), and you are trying to capture the moment, this mis-feature will be frustrating for the life of the camera.  I'm really puzzled why people would like this camera, unless they are mostly taking pictures of scenery or of people posing.", "Date": "January 27, 2006"}, {"Title": "Fantastic Camera!", "Author": "OKBayBay", "ReviewID": "R2HTQMX9KNS3P8", "Overall": "5.0", "Content": "I bought the Olympus FE-100 as a gift for myself.  As a mother of four, I needed a reliable camera, that would take high quality pictures.  I have owned my camera for approximately three months, and love it!  It has many great features, and is very easy to learn, without tons of technical reading.This camera, like most others, does require the use of \"good\" batteries.  If you try to stick the cheap batteries in it, it just will not work.  But it is worth the extra cost, as the pictures turn out beautiful.  I have already captured so many wonderful memories that will last a lifetime.You will need an extra memory card, as the camera has a limited amount of memory, as do most good digital cameras, but you can purchase the extra memory at a low cost, and it doesn't have to be the Olympus brand.  The memory cards are very easy to install, and make a world of difference.  With one decent memory card, you can take over a hundred great pictures, before needing to upload them to your computer, making it perfect for those holidays and special evcnts.I have always had great sucess with Olympus products, and their customer support is another great reason to consider purchasing their products.I read many, many reviews before deciding to purchase this particular model, and I really feel that I made the best possible choice.", "Date": "December 27, 2005"}, {"Title": "Very good value - with picture quality to match.", "Author": "B. Roy \"RoyTech\"", "ReviewID": "R83KW0LNMYI3O", "Overall": "5.0", "Content": "I got this camera for my Mom when Fry's had it on a One Day sale for a ridiculously low price.If you are a point and shoot person - give this model serious consideration and not the ones with more megapixel counts. More megapixels don't equate to a better camera. 4 MP is ample resolution for an 11X17 inch print. Plus the images are not as big (in terms of bytes) so the pictures are easier to manipulate and store, you don't need as big a memory card, and the simple fact that the pixels on the CCD are bigger leads to greater light sensitivity and less noise compared to the same size CCD with a higher pixel count.The five stars that I give it, takes into account certain factors -1) Its low price -2) Small sizeIf the camera was priced twice as high, I would not buy it. But for its current price, it can't be beat.What I like -1) Very easy to figure out the menu's. But my mom might still need help.2) Small size (little like an egg). Easily fits in a purse or pocket.3) Exposure and color balance is better than a Kodak EasyShare C330 that I was able to compare it with.4) Uses two AA batteries and the battery compartment/lid is well designed (attention to detail).5) Has optical zoom with the coverage required in 80% of cases -for additional 10% walk to your subject for 90% coverage.6) 28MB of camera memory is built in - so you can use it in addition to the external one.Some shortcomings -1) I intially had lot of low battery errors which went away after I switched to higher quality NiMH and used the camera for a while (the batteries were broken in before being used on the camera - so this is not a battery issue)2) The lens opens and retracts rather noisily with a grating sound that is unpleasant to hear.3) Uses XD memory card is proprietary to Olympus and Fuji cameras only. XD cost's a bit more - and you should factor that into the price when you purchase something. I hate it when manufacturers adopt proprietary formats.4) The camera did not always figure out white balance correctly under artificial lighting and flash switched off. Not really a factor if you use the camera in the automatic mode only.5) The mode selector dial on the side would move when taking in and out of a case - so it is possible to take pictures in the wrong mode accidentally.4) Colors were a little on the yellow side.Other comments -The lack of viewfinder is not really a problem I think. The built in LCD works quite well and is somewhat visible even in the sun. The LCD is a bit small, but is quite sharp and works well for framing your subject. Hopefully the smaller LCD will be less prone to breaking.Its picture quality is not quite what my Olympus C-4000 is capable of, but it still takes pretty good images that represent the scene well. But then, the C-4000 is much bigger, and even now, an equivalent replacement would cost 2 - 3 times as much. Not quite a fair comparison.For its price the FE-100 is very good value and won't dissapoint you. I think it is the best in its size and price class. Much better pictures than a Kodak C-330 I have compared it with.In my experience, only Canon and Olympus really have what it takes to make digital camera's that take great pictures. But with a Canon, you'll spend almost twice as much.", "Date": "May 1, 2006"}, {"Title": "Pretty Good But...", "Author": "A Customer", "ReviewID": "R1XNKDM4PZP0SK", "Overall": "3.0", "Content": "The Olympus FE-100 works pretty well - fairly easy operation, good construction, the bells and whistles you'd expect at this price. Here's what's not so great...The camera would not transfer pictures to my computer. I had to call their tech support and download the proper program, which should have been in the camera system to begin with.The pictures are \"okay\" but not crisp and snappy as you would expect from a 4 megapic camera.The starter manual and CD master manual are poorly written and neither explains important basic camera operations. Not user friendly at all.The editing of photo tools are truly basic and not explained at all in the manuals. And they don't work so good. Use red-eye reduction only if you want your subjects to look like cartoons.And, yes, at least one in five shots is completely out of focus. I know this wasn't me or an unsteady hand because I put the Olympus on a tripod and shot the same object ten times. Three shots were out of focus.With the Olympus reputation, I expected more.", "Date": "January 22, 2006"}, {"Title": "simple for the beginer", "Author": "Gary L. Price \"GPrice\"", "ReviewID": "R2ZOEZNYE52HG4", "Overall": "5.0", "Content": "one simple use camera, dosen't have all the bells and whistles take great pics does enough for the the person that likes simplicity but Far as zoom  for far away don't expect much over all its a great little camera", "Date": "January 31, 2006"}, {"Title": "Wonderful Camera (continued)", "Author": "Jonathan Stewart \"Jon\"", "ReviewID": "RM45PXNI0OYQL", "Overall": "5.0", "Content": "I have had no problem with 'blurry' pictures. Sounds like the earlier reviewer has a problem with 'camera shake' - i.e. keeping the camera steady when taking the photo. Additionally, the shutter button is two-stage. When you depress it half-way the camera focuses and then the 'green light' comes on & then you press it all the way and the pic is taken.The `nightscene' mode works fine for me. The nightscene mode does not use flash and is a timed exposure where the shutter opens for a few seconds to capture the image `as it is' without flash. The camera has to be on a tripod or placed steady on an object (like a ledge or railing etc.) to get a good shot. If you take the pic holding the camera in your hand it will definitely be blurry. There is a good example of a nightscene mode photo in the `Customer Images' (page 3 of the images) at the top of this page.Or you can simply use the `Autoflash' mode and take your outdoor photos with no problem using the built-in flash.Sounds like somebody did not take the time to read the instruction manual properly!!In the end, this is a great little camera that has provided me and my family with so much fun and captured wonderful memories.It's not for the avid or serious photographer. But if you want a camera for fun and family photos, you can't beat the performance and features at this price.I would recommend it to you.", "Date": "January 21, 2006"}, {"Title": "The best & the worst things I've found", "Author": "Raquel J. Michaelson", "ReviewID": "R6IMMS6MI4WD7", "Overall": "4.0", "Content": "I've had this camera for several years.GOOD:  It takes very clean, sharp photos.  The zoom is very nice for vacation shots and general purpose photography. I was able to enlarge up several of my macro shots to 12\" x 14\" and enter them into a photography show.  Mostly, though, 8x10 is about as big as they blow up clearly.  The SD card holds about 300 some photos, so you won't run out of space.  I use the lithium batteries  which are a little pricey, but they last quite awhile so they are worth it.BAD: If you want to take many shots in quick succession, this is not your best camera choice.  It has an option for a 12 second delay, which really helps to focus the shot, but forget that for any kind of action.  Another thing that is difficult is that the screen is really hard to see.  Most of the time I'm not sure what I'm aiming at.  I have to take the shot & then go back & review it.  Again, for any kind of action shots, this will not be a good choice for you.  I have not had good results with night or very low light photos- even using the night setting.OVERALL:  I have been really pleased with the quality of photos I've gotten from this camera.  If you want an inexpensive camera that is lightweight and easy to use, this would be a good buy.", "Date": "November 13, 2010"}, {"Title": "Super Easy Camera", "Author": "R. Raiz", "ReviewID": "R2E0GLW1X6W8BT", "Overall": "5.0", "Content": "I bought this camera online and didn't know what to expect.  I was pleasantly surprised when it came and I had an opportunity to check it out.It is a bit on the chunky side, but that is good for someone like me who is careful.  The viewing screen is a bit on the small side, but the display is crystal clear, and easy on the eyes.  It couldn't be easier to use, either.  Without looking at the manual I was able to insert a new memory card, new batteries, and both view the pictures already in the internal memory (which is generous, by the way), and take a picture of my son. It must have excellent anti-shake technology  because my hands were not that steady when taking the picture, and it still came out perfect. The menu is easy to navigate, and although there are limited options to choose from for taking pictures, the ones that count are all on the dial.The only negative is that you need to open the battery compartment to insert the memory card. Inserting the card couldn't be easier, and Olympus took the pains to diagram how the card it to be inserted.  But for the fact that it is in the battery compartment, you need to be careful not to have the batteries fall out.  But that is the only negative I can see, and that is a slight one.I have not checked out the video feature, but that is not why I bought the camera.  This is a gift for my daughter, and I was concerned that it be a quality camera with ease of use.  That it is.I have had an opportunity to compare this camera with a Nikon Coolpix 4600 and the Olympus wins hands down.  Pictures are more vivid, even through the Nikon has several color options, including vivid, and the turnaround from taking a flash picture indoors is amazing - the Nikon requires several seconds while it writes to memory, where as the Olympus is almost instant. Amazing camera!", "Date": "October 30, 2010"}, {"Title": "Low Light Disaster", "Author": "A. O'Dowd \"Angie\"", "ReviewID": "R251JI9KPZZ2VT", "Overall": "3.0", "Content": "I received this camera as a gift in late 2005, my 1st digital camera.  It wasn't so bad in the beginning but as time went on it became rickety yet still takes ok photos...as long as you're not taking those photos in low light.  If you're not in direct sunlight & you're trying to take a close up forget it.  Many pics sometimes come out with a yellow hue.  I used to use this camera to take photos for my ebay business & I take quite a lot of close up shots & I will say this camera takes great close ups, shots are clear & sharp but, again, sometimes with a yellow hue if in the slightest of low light.  This camera has macro & super macro & aside from the low light issue its super macro is a great feature that works pretty good.  Controls are very easy to use, this camera is easily portable.  The display on the back is extremely SMALL, not sure of the size but it's sometimes very hard to see the pics you've taken due to its tiny screen.  This camera also has an extremely SLOW shutter speed & slow startup time.  I will admit my Olympus has been beaten up in the yrs I've had it (broken zoom button, broken battery cover, been dropped, gotten wet, etc) & yet it still works with the exception of some of the imperfections that came with the camera when it was new.  I have a rubber band around the camera keeping the battery door closed yet this thing just won't die.  Very heavy camera & made to physically last, very sturdy & takes a beating.  This camera takes regular AA batteries but I don't suggest it, it will eat up basic batteries in a day, ALWAYS use rechargebales they'll last weeks.  This camera isn't slim, it's a chunky little thing but still decent. If you're looking for a camera that's good in low light do NOT go for this one, if you just want good close ups then it's a great camera for you.  This camera also takes video BUT it has no sound (a waste if you ask me), plus on play back the video moves too fast as if it were an old 8mm home movie, never understood why this happens so I never used the video feature.  All in all it's a great backup camera if you need one for super close ups but in low light...yikes!", "Date": "January 5, 2010"}, {"Title": "Very poor battery life", "Author": "No Name Worker \"Follower\"", "ReviewID": "R3MCY6A6LZBUWU", "Overall": "1.0", "Content": "This Olympus FE-100 digital camera has very poor battery life.  Even brand name alkaline batteries can only last for few pictures (<10 for my camera, maybe some lucky ones can shot 20 pictures).  Then I tried the NiMH rechargeable batteries (~2300mAhr capacity), the result is even worse (the camera simply refuse to turn on).  Therefore, I concluded that this model (FE-100) has fundamental design flaw - battery must have both enough voltage and current to work.  The alternative solution is either plug it into wall (AC to DC adapter) or use expensive Lithium battery.  Avoid it!", "Date": "December 2, 2009"}, {"Title": "Wasted reputation", "Author": "MichiganGHM", "ReviewID": "R46ZWUWTD2DYE", "Overall": "1.0", "Content": "I have used an Olympus C-3000Z (expensive) camera since year 2000. It is a wonderful camera that has taken over 50,000 pictures. So I get the significant other an FE-100 knowing it is a low-end camera. It is basically useless! The battery problem mentioned by several reviewers is much worse than they say. With fresh non-rechargable batteries, you may only get a half-dozen pictures before it won't even turn on. Rechargables only work right off the charger, and then not for long. I did the first software upgrade that was supposed to help this problem, but it made little difference. On the rare occasion that you can use the camera, in full daylight it makes quite good pictures. In low light, forget it whether you use flash or not. I don't understand why Olympus would waste a sterling reputation on this Chinese piece of trash. I have been thinking of buying a new good camera, but I probably won't risk getting more such junk from Olympus.", "Date": "May 30, 2008"}, {"Title": "not that bad", "Author": "Kame Sugi \"Kame\"", "ReviewID": "RWU7N19V07MO5", "Overall": "3.0", "Content": "i bought this camera in May 2006(so i've been using it for 1,5 year), and it's still in an excellent working condition except for batteries.they last pretty long for the first moth and then their capacity decreases significantlyAlso, you would use xD memory card for it, and it's tooo slow..But still quality of the images is pretty good", "Date": "October 17, 2007"}, {"Title": "Dissatisfied with the camera & the company....love my new Nikon", "Author": "Lisa", "ReviewID": "R1WBS93OXJW06Q", "Overall": "1.0", "Content": "I bought this camera for $140 which I thought was pretty good, but you really do get what you pay for. I used it maybe once a week, if that and took good care of it to avoid problems. However, I had it only 6 months before it broke.One day, 6 months later I went out and needed the camera just to take some pictures for memories. So I hit the 'on' button, the lens extended out only half way and would not go back in. I had noticed it doing this a couple times before, where the lens would go halfway out and would not turn on, but if you just turned it off and then on it would be fixed. So i figured it was dead batteries. However, when it finally broke the batteries were fully charged, so it was not a matter of that.I took it back to where I got it (best buy) who couldn't tell me anything (yea such a great \"geek squad\" who can't tell you what's wrong). So they told me they'd send it to the company and have it back in 4-6 weeks. So 8 weeks go by and still nothing, and at this point I was just fed up with Olympus because my graduation was coming up in the next week, I didn't have a camera and it was well over the 6 weeks. They didn't even bother to call and update me.Best Buy was worthless because all they told me was it was \"discontinued\" which I found out later it's not, and gave me store credit only towards another one of their \"fine quality\" cameras.I refuse to buy anything else by Olympus because they make inferior products, do not stick to deadlines or update you of the status, and don't tell you what the problem was withthe camera. With my \"gift certificate\" to Best Buy I bought a Nikon CoolPix which was $30 more and I am so much more satisfied. Batteries last longer, much better picture quality, slimmer, more picture taking modes. I'm just sorry I didn't get this one to begin with.", "Date": "July 25, 2006"}, {"Title": "Why an old Olympus old camera over new one", "Author": "D. Gordon \"Shama\"", "ReviewID": "R3M5EXICYNNJMW", "Overall": "5.0", "Content": "Love this camera so much.  This is my second one!I would rather have this one over new modal due to the \"heft\" of itPictures great everytimeThe new ones are too light in the hand and feel cheap!I will continue to buy only Olympus cameras", "Date": "May 22, 2013"}, {"Title": "Piece of Junk w/ False warrantee and horrible customer service", "Author": "Lauren Loren", "ReviewID": "R3S1CGTOFEUYNK", "Overall": "1.0", "Content": "The latches on the battery/ media card door broke within 5 months from normal use and Olympus Service center staff pretended that they lost my reciept to drag out the time (so I get tired of waiting for my camera)and not fulfill my warrantee. After I sent them another copy of the reciept they told me that the repair is not covered because it is \"impact damage\" which is rediculous... if you scroll down through the reviews you will see that I am not the first person to have this problem with the camera or with the warrantee which Olympus does not deliver on. DO NOT BUY THIS unless you want to lose your money and time.", "Date": "October 16, 2006"}, {"Title": "Did not work out for me", "Author": "A. Murphy \"Authority on the World\"", "ReviewID": "R2YUR1A7L5ULSS", "Overall": "2.0", "Content": "I read numerous reviews before I settled on this camera.  I just did not make the right choice.  This is my first digital camera. First of all, about 1/8 of my pictures turn out blurry.  Forget taking pictures at night.  100% of those pictures turn on blurry and streaked in spite of the night-time feature.  I do not even bother with night-time photos anymore.  Also, I cannot always get the picture to take.  I push down on the button and nothing happens.  I hold the button down and keep pressing harder and harder and sometime the picture just will not take.  This always happens during an action moment so the entire shot is missed.Buying extra memory is reasonable and does not have to be Olympus, which is a plus.  I bought a Kodak card that holds 160 pictures for about $15.  You must use lithium batteries.  2 double AA lithium batteries run about $11.  The pictures are easy to transfer to your computer.In conclusion, I wish I had actually tested out some cameras inside a store before I purchased this one online.  The feel is not the best.  The body is clunky and weighs you down on your travels.  Because there is NO WAY to take a nighttime photo I would not recommend this camera at all.  Also, I have the problem with the faulty snap button too.  Try something else.  I thought this was exactly what I wanted.  I was wrong.", "Date": "January 9, 2006"}, {"Title": "DO NOT WASTE YOUR MONEY!", "Author": null, "ReviewID": "R1AY0MH68LUODH", "Overall": "2.0", "Content": "At first I thought that this camera was wonderful BUT it has a lot of things wrong with it...1. It is NOT for fast picture taking, it takes a lot of time for the shutter to close!2. If you don't have an arm made of stone then you will get extremely blurry night shots.3. Goes through battery EXTREMELY quickly4. There is a very slow rebooting time between shots5. Zoom is choppy and hard to use6. Only some of the photos come out when uploaded7. Without the flash the pictures are very, very blurryBut this camera is extremely easy to use just take it out of the box and use it.", "Date": "January 31, 2006"}, {"Title": "My battery door broke too", "Author": "Stephanie Beeson \"Stephanie\"", "ReviewID": "RBSHHR1TH5E17", "Overall": "3.0", "Content": "I've had this camera for about a year I guess, and I do think it's good for every day use.  I've been happy with the picture quality.  I did have the battery door break after a few months though and had to replace that.", "Date": "September 29, 2008"}, {"Title": "Not worth the money", "Author": "Greg Butler \"Greg\"", "ReviewID": "R1G561O12B7AJ2", "Overall": "1.0", "Content": "I bought this camera 5 months ago . I used it only thrice. Took a total of 13 shots. Handled it gentle. The camera lid cover was not holding after 2nd use. The batteries kept dropping. I had to put a tape on the lid to keep the batteries in.I mailed it to Olympus service in Cypress, CA. They tell me that is not covered under warrenty and I have to pay 83 dollars for repir. I told them to discard it as it is not worth even the postage.I lost  all my money.I felt the camera is of poor quality and not worth even a dime.", "Date": "June 29, 2006"}, {"Title": "Wonderful Camera", "Author": "Jonathan Stewart \"Jon\"", "ReviewID": "R2ZX1M95U3STSQ", "Overall": "5.0", "Content": "I have owned this camera for the past four months and found it to be a good performer and an excellent buy. Takes great photos, even close-up shots. Just look at the 'Customer Images' at the top left of this page.It is so easy to use. Great for family and fun photos. The 4 megapixels are perfect for 8 x 10 enlargements.I've taken it skiing, hiking, camping and even dropped it twice - rugged and works like a charm.The lens retracts and the cover closes when you turn it off. Uses two standard AA alkaline batteries but I invested in four 2500mAh rechargeable NiMH 'AA' size batteries ($10.00). Battery consumption is good.Uses XD format picture card and would suggest that you buy a 256 MB or 512 MB card (Fuji cards work great) as the one that comes with the camera hold only about 16 photos. Transferring images from the camera to your PC is a cinch with the included software and USB cable.The only con is that you do get 'redeye' in some (not all) indoor flash shots but the software that comes with the camera allows you to remove redeye from the pics. But then again I have yet to come across a camera that eliminates the redeye issue. Even the expensive $800 cameras have that problem.I have had no problem with 'blurry' pictures. Sounds like the previous reviewer has a problem with 'camera shake' - i.e. keeping the camera steady when taking the photo. Additionally, the shutter button is two-stage. When you depress it half-way the camera focuses and then the 'green light' comes on", "Date": "January 21, 2006"}], "ProductInfo": {"Price": "Unavailable", "Features": "4.0-megapixel CCD captures enough detail for photo-quality 11 x 15-inch prints\n2.8x optical zoom; 6 shooting modes\nBuilt-in Help Guide provides brief in-camera descriptions and tips help you choose the best camera setting\nOlympus Master software offers red-eye fix once images are downloaded to a computer\nPowered by two AA-size batteries (not included); stores images on xD-Picture Cards (not included)", "Name": "Olympus FE-100 4MP Digital Camera with 2.8x Optical Zoom", "ImgURL": "http://ecx.images-amazon.com/images/I/51Z1KWQW7RL._SY300_.jpg", "ProductID": "B000A7B9YE"}}