{"Reviews": [{"Title": "Quality, solidly built camera.  Current mega-zoom king.", "Author": "Matthew Jude Brown", "ReviewID": "R1O884CMI1GQD", "Overall": "5.0", "Content": "The Panasonic Lumix DMC-FZ30 is the replacement for Panasonic's well-liked DMC-FZ20 which came out in late 2004.  The FZ30 improves on that camera in almost every way, especially in build quality and ergonomics.I'll mention the downside first.  Despite an increase in resolution from 5 to 8 megapixels, the image quality has not improved all that much.  Panasonic's new 8 megapixel chip is quite noisy (which equates to \"grainy\" in film cameras) and overall the images won't look much better at a given print size than the old, 5 megapixel camera.  This is not to say the pictures are unacceptable - they are good, in fact, except for pictures taken in low light - but rather that if you have a 5 megapixel camera, you shouldn't rush to buy an 8 megapixel and expect great improvements.  The detail in the shots, however, is very good.With that out of the way, almost everything else about the camera has improved to a quite incredible degree.  It really does feel like Panasonic listened to their customer response and fixed most everything they didn't like.The camera is a little larger than the FZ20, making it quite hefty - bigger than some SLR cameras, in fact, although a SLR with a comparable lens would be much larger.  It's also not light, at about one and a half pounds.  This does mean that it's easy to steady and hold, but it's far from a pocket camera.The lens is totally new, and unlike that in the FZ20, does not retract or move during focussing or zooming - all the movement is internal.  This means that the unit is a lot more sealed and solid-feeling, and contributes to making start-up times commendably fast.  Unlike the previous model, zooming is done with a ring around the lens like a traditional camera, rather than by a motor and rocker switch.  This takes a little getting used to if you've been using most other digital cameras, but soon becomes second nature and much quicker than the motor. In manual focus mode, the lens can be focussed with another lens-mounted ring.  The display shows a zoomed-in area to aid manual focussing, and I found this feature quite usable.The zoom range is 35-420mm (35mm camera equivalent), which is pretty much identical to the previous camera and gives a 12x range.  This gives as much telephoto reach as is practicable to hand-hold and get a sharp picture, even with image stabilization.  Should you desire more, Panasonic sells an add-on lens giving even more reach, but I'd advise a tripod.  You're more likely to desire more wide-angle, in my opinion, and another conversion lens is available for that.Unlike the previous camera, the lens does not have a constant F2.8 aperture, but rather gives F2.8 at the wide end and F3.7 at the long end.  This is still very good; clearly, some compromise had to be made.Overall, the construction feels much more solid and high-quality than the FZ20.  The hand-grip is also improved, being much deeper and easier to hold, and the location of the shutter button is improved.  The FZ20 always felt a little fragile, and this camera does not.The LCD screen is much improved, and now is a flip-down and twist model, meaning it can be folded inward to protect it, or folded down to view from above or (with a twist) below.  This is a very useful feature, making it easy to shoot over crowds or get a more natural view of small children, pets etc.  I think the sideways-flipping style is slightly easier to use than this downward one, but this is still very good, and a solid upgrade.Menus and operation seem little changed from the FZ20, and are good.  The flash seems better than most, and doesn't wash things out with close subjects either.While I don't use movie modes hardly at all, I believe from reading the manual that the movie mode on this one is much improved from the FZ20, and can produce full-speed VGA quality movies of shortish duration.  For more than short clips of your kids, I'd recommend a movie camera instead.In conclusion, this is a high quality camera that right now is the king of the mega-zoom, fixed lens camera market.  The pictures are as good or better than the others in the market, and in ergonomics, usability and 'real camera' solidness, the FZ30 is right now unbeatable.  It works and feels like a very high-quality piece of equipment, and I don't think you can get a better \"all-in-one\" camera for any money at this moment.One must understand, though, that compromises are made to get that huge 12x zoom range in a camera.  If you don't need all that telephoto, you could buy an entry-level dSLR for very little more money; although the kit lens it comes with will be much the inferior of the FZ30's Leica mega-zoom, the dSLR's imaging chip will produce higher-quality images, especially in low light.If you have the FZ20, is it worth the upgrade?  Not if you want to upgrade for image quality; yes, if you want a much more solidly built, ergonomically satisfying camera.  Is that worth the money?  In the end, it's up to you, but I'd advise going to a store and handling one; you may fall in love with it, it's that good.", "Date": "September 20, 2005"}, {"Title": "It's ALMOST There. Take it From a Pro.", "Author": "FrontPage", "ReviewID": "R2B1AEVSSADHYH", "Overall": "4.0", "Content": "I'm a pro, working for a large city daily newspaper for 22 years, and shooting professionaly for 25 years (and counting, with enthusiasm for the job). My previous cameras: Sears 500MX (my first SLR), Nikon EM, F2A, FM2, F3, F4, F5 ( all film)... And then the Kodak DCS, Nikon D1, D1H, D2H, Lumix FZ20 (all digital). I've shot events such as Superbowl XXXV (D1H), 2004 Olympics, 2005 Indonesian tsunami (D2H), and Hurricane Katrina (D2H, Lumix FZ20).But I was issued an FZ30 by request, after using an FZ20 so I could finally zoom while shooting video (for web content). You know why I also like the FZ30? You can shoot Tiger Woods' back swing without him throwing a club at you, which he'd be right to do if you sat on a motor as he started his swing.The FZ30 is much heavier than many of the average cameras on sale. It looks pro and feels heavy enough. The shutter speed range is even greater than the FZ20, capturing pictures at 1/2000th sec to a full 60 seconds (the D2H has only 30 seconds exposure maximum. Other pro shooters have noticed my camera, and ask plenty of questions. It does just about everything, including an option to create animated films with this camera. But it's not the ultimate dream camera because it isn't perfect.I totally shame the digital noise on this unit; enough decent cameras in the same price range don't experience the higher levels of noise, even for ISO 100. But I work for a newspaper.... and there is some decent noise-reduction software to control it that doesn't compromise flirting with over-manipulation ethics questions. I can now shoot some concerts and can shoot golf differently b/c I turned off the shutter and beep noises the camera makes.I wish the camera had a wider wide angle. The zoom and focus controls seem too close. And the rear thumb dial seemed a tiny bit out of position at times. It's quiet as a mouse. People don't even know you're shooting video, which makes people unaware of you, an important thing to have for candid news-gathering. I love the FZ30 as a 3rd camera in my arsenal. I just completed a stint, shooting the crew of Pride of Baltimore II, a tall ship. It worked wonders, save for some errant focusing every now and then.I pack my Lumix and my Powerbook along with my passport when I go on vacation; in a pinch, I can travel worldwide and shoot virtually any assignment, including spot news, with the zoom range that the FZ30 has. That was the selling point for me. Any camera that has a decent image quality with a 12:1 zoom ratio and a lens that gathers more light is worth considering. And I love the true colors it can yield for white balance, one thing that my D2H bodies can sometimes find difficult to achieve.This camera is better suited for daylight (sorry for anyone Alaska in the winter!), but you can get amazing shots if you respect a camera's limits. The better the light, the better the image. That goes for any photography. I can shoot 99 percent of my assignments with this camera.Watch out when you have the LCD screen flipped out; once it breaks off from a hit, I would think you might have to consider replacement. Purchase a really big memory card, which are cheaper. A faster one (SD rated card) for those who want to shoot video, which you can opt between low definition and VGA, which is a good size image (it only shoots in standard TV size. You don't have any option to capture video in any other format, as you can with film.You can also crop your images or even downsize them for web emails in the camera. The FZ30 feels solid enough. And I did drop my lens shade from 50 feet (it was mounted, but the mount is not very secure) and it bounced but didn't crack.Make certain to also purchase at least one extra battery, because if your power drains, you either pop in a fresh one, or stop shooting and wait over an hour for your battery to recharge. The batteries from my FZ20 can fit and run the FZ30, but the reverse can't be done.Please, read the manual. This camera was well-designed, and Panasonic seems to really work on their cameras based on feedback. You have menus in several different camera modes, besides the basic setup menu options. One thing very interesting is that you can set the camera to extend its optical zoom to 19.1, much greater than 12X (the camera actually begins to crop into the frame when you zoom past the full frame 12X maximum zoom, which is good if you want to save a step in image processing.", "Date": "April 29, 2006"}, {"Title": "The King of The 12X Realm.", "Author": "Sinister Minister", "ReviewID": "R32KOPZI3RU24W", "Overall": "5.0", "Content": "Greetings from Sinister Minister friends! Today I want to talk to you about yet another amazing digital device that comes to us from Panasonic of all people!!I mean after all when you think of digital cameras you think Nikon, Canon, Olympus, Sony ect. ect. But Panasonic!? C'mon now they make everything from blenders to stereo systems! But, If your a photographer thats just not cool. Well guys we had better get a whole new set of standards because Panasonic has beat the crap out of two of the Largest camera companies out there in the 12X mega zoom catagory! And not just by a little either, by a very wide margin.Now to be fair Panasonic \"Lumix\" cameras have always been well respected cameras for thier performance, pictures, lenses etc. but then again if a guy shows up to shoot your daughters wedding with a Panasonic camera up until now you would have kicked him out! The FZ-30K at first glance looks like many of its counterparts, with few exceptions. Its size is very close to that of the Nikon 8800, and I'm not sure but I think they weigh about the same. I have my camera here in front of me so lets take a walk around. On the back you have a normal selection of controls, a EVF with a diopter, EVF/LCD control, AE Lock, Display, Menu, And delete buttons, as well as a circular Navagation switch for other controls like exposure adjustment, flash control, etc. The odd thing here is the LCD screen which gives you a fantastic image (as does the EVF) has movement that seems somewhat awkward and a bit restricted, but the EVF on the camera rivals the one on my E-300 SLR so hey who cares!? Around the side we have the SD memory card door that is solid and has a slide lock, Downside here is that the FZ-30 will work with cards up to the max available, (now in SD 2GB), but when they go to 3 or 4 GB (and you know they will) FZ-30 users will be shut out! That's why as a rule for high performance cameras like the FZ-30 I rather see CF Type 1 CF or Type 2 Micro-drives, But hey just making a note. Jumping to the other side we find one of the features I love about this camera, that is a 3 position switch that lets you shift between focus modes on the fly! Outstanding!! For those of you who take your shots on the go you know how infuriating it is to have to navagate thru a menu to chnge the focus options. The FZ-30 gives you three options- AF, AF Macro, and manual, it also has a neat little gimmick of when you are using the manual focus mode the camera enlarges the center portion of your shot, and using the fine focus ring on the lens you can fine tune your shot with zero guess work! WOW! That alone blew me away, I hate it when you take a shot thinking its in focus but... The FZ-30 has all but eliminated this problem! Another thing I love about this camera is the flash does not engage until YOU open it YESSS! I hate auto pop up flashes!Getting to the lens we come to possibly the coolest feature on the whole camera wich is the lens itself. Besides being a Leica lens, its the fact that it zooms, pulls back, etc. etc. all within the lens housing itself! Translation? No matter how much you zoom with the FZ-30 the camera never changes size! No whirring motors or gears, nothing but zoom! The operation of the lens is simple you have 2 focus rings the larger for general zooming and focus, a smaller one for fine focus in manual mode, and a fine focus option buy pressing lightly on the shutter button. The lens is super quiet and smooth in operation, has very minor barrel distortion a wide angle, and produces images with sharp and focused corners. The other main feature here however is the zoom capability of the FZ-30, yes it has a 12X optical zoom but it does not stop there. This camera will let you adjust the aspect ratio of your images and thereby increasing zoom capability! I can't explain exactly how this works (I failed trig in school) but I can give you examples.At 8MP the ratio is 4:3 a standard photo, in the menu you can change that to 16:9 (widescreen) and your resolution lowers to 5.5MP Hello!! thats called true panoramic photography right within the camera with out needeing software to \"Stitch\" your shots together! I think I just heard Olympus and Nikon Squeal!! Keep the same 4:3 Ratio but turn down the image resolution to an even 5MP and your zoom capability jumps to 15.3X turn it down to 3MP and it jumps to 19.1X !!! That is still good enough for 8X10s!! Thats before you even get into add on lenses!! The pop up flash is housed right over the lens and can be adjusted within the camera as far as brightness etc., also here you will find a hot shoe the standard mode wheel as well as buttons to select your drive mode and stabilizer mode. Since I work part time at BestBuy selling cameras I have had the chance to compare the stabilization on the Sony H1, Canon S2IS, and the Kodak 850 I have found the one on the FZ-30 to be the best and most consistant, The FZ-30 also offers you 2 options with the stabilizer, Constant and shutter release the latter operates when you press the shutter button only and is the setting I have found to be the best! The FZ-30 has 14 scene modes, and has two places on the mode dial where you can preset your 2 favorites.The \"Baby\" setting on the camera has been taking a beating by critics as being silly, but since I just had a son recently I found it rather cool! All you do is enter your childs birthday when in the mode, and everytime you take a picture of him/her in the mode the camera shows thier exact age! In addition to some minor image enhancements.Now the main reason we all buy cameras as I have said before is for pictures. Does the FZ-30 take good pictures? No. It takes amazing pictures (See the examples I have posted) Even with  the zoom maxed out I can get clear sharp pictures, partly because that stabilizer is so effective. In all of the tests I have had time to put it thru the camera has performed amazingly well. at higher ISO settings noise on this camera can get to be a problem but only if you crop your pictures out at 200 to 300% and besides there are tons of good noise removal programs out now to solve this. Noise at higher ISO settings is a side effect of digital photography in general not generally one specific camera. Some are worse than others but none are great so either fix it or forget it. If you have a good enough printer you won't notice that much anyway.Well this is getting kind of long winded so let me wrap this up. There are tons of features the FZ-30 has that I can't possibly go thru here so let me give you the BestBuy straight & narrow! I own the Sony DSC-H1 and while it is a great camera it is no comparison to the FZ-30. Why? the FZ-30 is faster, has higher resolution, more image configurations and zoom capabilities, A Hot Shoe, Better lens quality, Possibly one of the finest cameras in reproduction of color that I have ever seen! Sharp focused images (even at extended zoom settings). The Canon s2Is?? It is not even in the same league so I won't even mention it. (In fact I found it to be the worst of all I tested.) Bottom line is the FZ-30 is possibly the finest high end, fixed lens (Prosumer) camera to come out in the last 3 years (Since the F-828) Normally- I tell people to shop around but in this case DON'T! This is definitely the best of the new mega-zoom cameras and is probably one of the top three prosumer cameras available today. I sold my Nikon 8700 to buy this camera and I have more or less decided to give the ax to a few more! This beast made alot of cameras in my stable obsolete! So to Panasonic I say Welcome to the Big Time, and to you I say STOP!! look no further and buy this camera, this is a work of art in photographic technology! This my friends is one hell of a damn camera!Oh yes the downside...it is very hard to find accessories for this camera!! next to impossible!! so Panasonic shold get on the ball!! After all your a for real camera company now! Maybe they always were, Hmmmmm.Thanks for reading and happy shooting!", "Date": "October 14, 2005"}, {"Title": "All the features and quality I need", "Author": "J. Donaldson \"Cal-diver\"", "ReviewID": "R23I0WHCMSA25K", "Overall": "5.0", "Content": "I've had my FZ-30 for about 2 months now and thought it was time to enter my comments.The one negative thing you will no doubt read about the FZ-30, if you are searching out professional reviews, are comments about the \"noise\" or graininess. Yes this camera can exhibit noise under certain circumstances, as do most if not all bridge cameras. I would compare the noise with 400 ASA film or even 1000 ASA film. If you are very picky about your photos and are looking for the highest quality you may not be happy with this camera when you have it set to 400 ASA and take photos in low light. You may be able to find another bridge camera with a bit less noise but if you are that fussy you may have to purchase a DSLR and deal with extra expense and changing lenses. If you are like me, and can stand a little grain in a small number of your photos you will be quite happy with this camera. If you do want to reduce the noise there are a couple of software utilities (noiseninja) that can help.In my case I was upgrading from a 5 year old 3.3 megapixel digital camera that had served me well but did have some shortcomings. The Panasonic FZ-30 has to be one of the best values in photography today. The quality of the Leica lens, along with the rest of the great features, for the current Amazon price of $544 is an outstanding value. The most amazing thing to me is the range of possibilities this camera offers.My wife can pick this camera up, set it to Auto mode, and snap some photos of the kids easily. Two minutes later I can take it out in the back yard and capture the awsome blue bird sitting on the branch at 12X zoom, and the next shot can be of a ladybug on a flower in macro mode. All of this is done with the same lens and the simple spin of the zoom ring. The range of possibilities available with this camera are beyond my current expierence level. And the resulting photos are awsome.I had some particular features in mind when I did an extensive search for a new digital camera; most based on the shortcomings of my older camera. I wanted a longer zoom range, hot shoe for an external flash, and the ability to focus in dark or low light situations. As I did my search I came across other features that were now available in the range of modern digital cameras and added them to my list. A swivel LCD is a handy feature, as is the manual focus ring, 640x480 30fps video mode with sound, high resolution LCD and EVF, very fast shutter response time, fast focus, and higher resolution. The FZ-30 has it all.One of the great things about a higher resolution camera is the ability to crop the photos on the computer and still have enough resolution so the final image doesn't lose its quality. Eight megapixels, along with the 12X zoom, gives me the ability to catch the grandchildren in action, then zoom in for a quality printout later.Don't be tempted to purchase the Sony DSC-H1 or Canon S2 IS just to save $50-$150, the Panasonic is a LOT more camera. If size is a big concern the FZ-30 is certainly larger than the Sony or Canon, but it is quite comfortable in the hand and not as heavy as I thought it was going to be.Proso 12X analog zoom with macroo manual pop up flash with long range, hot shoe for externalo manual zoom ring and focus ringo high resolution swivel 2\" LCDo Leica lenso 640x480 videoo great user interfaceo fast focus and very fast shutter releaseo much, much, more...Conso noise under certain conditionso propriatery battery which works quite well but I prefer AA standard batteries", "Date": "January 2, 2006"}, {"Title": "This is a great camera.", "Author": "Gary Gildemeister", "ReviewID": "RWIO6XGV8G6D0", "Overall": "4.0", "Content": "My Panasonic FZ30 arrived this past Saturday (12/17/05) and I have a 2 week grace period in which I'm allowed to return the camera if dissatisfied to the store where it was purchased.  I have read many reviews.  The underlining theme of the reviews is that the FZ30 is a great camera for the money but it has too much NOISE.  I got together which a friend of mine who owns a Nikon D50 to take several photos and compare them.  All photos were taken in auto mode at the same subject, at the same distance and position, and in the same lighting.  The D50 sizing was set to 6.1 mp and the FZ30 at 7mp and we used the highest quality setting other than TIFF and RAW that the camera allowed.  And except for one photo, all pictures were taken without the flash.  My intent was to take pictures under conditions that were not ideal and most likely to bring out noise.  Most pictures were printed on 4 x 6 glossy photo paper and some on standard computer paper at the 8 x10 size.  From my perspective, I think the FZ30 performed well in comparison.  The sharpness in the pictures was about the same, the detail was slightly better in the D50, and the FZ30 had a clear edge in the color.  I took the photos to work and showed them to another friend of mine who is a photo enthusiast.  I showed them without my friend knowing what picture was taken by what camera.  He only knew that the cameras involved were the D50 and the FZ30. He chose some D50 pictures over the FZ30 and likewise with the FZ30 over the D50.  It was about even in number.  Essentially, he agreed with my summary and perspective.  I'll elaborate more on 4 of the photos.Photo 1:  The picture was taken inside in a sun-room (of sorts) with many windows utilizing natural lighting.  The picture was taken at around 2:30 in the afternoon.  The sky was totally covered with snow clouds - no blue and no sun anywhere.  At 5pm, it is pitch black outside.  The setting was borderline flash needed.  In fact, when taking the picture from the D50, the flash did pop up and become engaged.  My friend then turned off the flash and re-took the picture again.  Our photos taken in auto mode were printed on computer paper at the 8 x 10 size.  Note: the readout on the FZ30 photo said the ISO was 200. My friend thought the D50's photo was better and I agreed just to be nice.  In reality, I thought might was just a hair better.  We both agreed that they were very comparable.  By the way, my friend at work thought the FZ30 produced the better photo.  All three of us detected no noise in the FZ30 photo.Photo 2:  The picture was taken (auto mode) inside utilizing artificial light.  The photos were printed on glossy 4 x 6 photo paper.  Note: the readout on the FZ30 photo reflected an ISO setting of 200.  The D50 photo was a clear winner here. The FZ30 definitely had noise.  We ran the FZ30 through a noise reduction software tool and reprinted the photo. The D50 still won but not my much.  The noise reducer did a great job with no noticeable loss in detail.Photo 3: Again (as always) in auto mode and no flash and same setting as #2, we took a picture of a very colorful tapestry my friend purchased during a trip to Mexico.  Again the readout on the FZ30 photo was ISO 200.  The picture was printed on 4 x 6 glossy photo paper.  The D50 won in one aspect but lost in another.  In the D50, you could clearly see the \"minute\" horizontal and vertical weave lines.  In the FZ30, the horizontal weave line was fairly strong but the vertical line was faded and almost not present.  However, the FZ30 was a clear winner with the color.  It was much more true to form than the D50 and my friend agreed.Photo 4: This was the only flash picture taken.  The readout on the FZ30 reflected an ISO setting of 100.  The picture was printed on 4 x 6 glossy photo paper.  Except for color, it was dead even for sharpness and detail but again the FZ30 had better color.In conclusion, I plan on keeping this camera.  Other reviewers have pointed out the many features this camera has so I won't comment other than to say I \"strongly\" agree.  Plus, it is extremely user friendly.  Most (probably in the 95+ %) of my pictures will \"not\" be taken in low light non-flash situations. And those taken in low light will probably wind up on 4 x 6's after going through a noise reducer.  If you take a lot of low light pictures for bigger than 4 x 6's than you might want to consider a different camera.", "Date": "December 21, 2005"}, {"Title": "Great camera, noise can be solved", "Author": "Floris Van Breugel", "ReviewID": "R3KKQ1TKN4I062", "Overall": "5.0", "Content": "I recently bought this camera as an upgrade from the fz10. Everything I could have wanted changed has changed. To highlight a few: raw format, manual zoom, thumb/finger scroll for exposure/aperture control, much higher quality viewfinder/lcd, more comfortable, 8 mp, and a few others. The camera costs as much as a decent dSLR body, but it comes with a very nice 35-420mm lens...you won't beat that. The only complaint I believe anyone could have (and many do) is the noise.Even at iso 80 you get noticable noise. At 400 it's pretty bad. BUT noise is an issue in every camera. All you have to do is buy the neat image plugin in for photoshop and download a set of camera profiles and kiss your noise goodbye. Seriously, after putting almost any image through that filter (before any other editing) you can make it look like there never was any noise at all. Don't let noise be a reason not to buy this camera. This works especially well if you use raw format (jpeg processing tends to create some irreversible 'jpeg noise'). Panasonic doesn't give you an easy way to deal with the raw images, but who would use it if they did? Photoshop provides an incredibly easy to use package that will take care of the raw formatting for you.There's only two reasons I would not suggest this camera: 1. you have over $1000 you want to spend on lenses + dSLR; or 2. you don't want a large camera. Otherwise you would be very hard-pressed to find a camera this functional and easy to use for the price.", "Date": "December 25, 2005"}, {"Title": "Fantastic value with a couple of problems", "Author": "Jonathan \"reader\"", "ReviewID": "R2D533YE0DB3HB", "Overall": "4.0", "Content": "I've had this camera for three weeks now and love it. It's my second digital. It's an upgrade from a Cannon G3. The camera has a wonderful SLR look and feel. This is almost 35mm quality!! I'm thrilled to feel like I'm back into photography for real now. I really like having such a versatile lens, so that I can shoot in a variety of situations without the need to carry extra bulky lenses.Pros*Fantastic feature set: 8mp, 12x opt zoom, Tiff and Raw, Image stabilizing that works.*Sharp images with great detail and color.*Very fast start up time.*No perceptible shutter lag (a major problem in digital cameras)Cons*NOISE. In low light this camera is extremely noisy. You can cope with this somewhat with either noise ninja or neatimage but they are only a partial solution.*The rear image viewer opens down then rotates. On a tripod I cannot fully flip the LCD down. They really should change this to sideways opening.*Unique USB connecter. For some reason instead of using a standard USB mini they use a non-standard plug on the camera end. (This is a pet peeve)*I would love it if I could charge the battery via USB. Most gadgets that have the mini plug allow you to do this.*The aperture and shutter-speed dials are a little awkward and slow moving.*Once in a while the camera won't focus and you need to shut it off briefly to correct.ConclusionI would highly recommend this camera to anyone who wants a higher end consumer camera.  Panasonic does have some work to do for their next version but they've made an excellent camera.", "Date": "February 23, 2006"}, {"Title": "Great camera and great price", "Author": "E. C. Turner Jr.", "ReviewID": "R4UVLOODZEUED", "Overall": "5.0", "Content": "I work for a camera store and have the capability to use several different cameras every day.  Of the point and shoot digital cameras with a 10x or 12x optical zoom, the FZ30 is by far one of the best I have used.  The closest comparison I would put against it is the Nikon 8800.  One of the best features this camera has, besides the solid construction and light weight, image stabilizar, and Leica Lens, would be how similar it is to an SLR.  This camera zooms just like a zoom lens for an SLR but with no external moving parts.  In addition the camera has a manual focusing ring.  For the price and the features, you are hard pressed to find a camera to beat this.", "Date": "December 27, 2005"}, {"Title": "a great digital camera", "Author": "Bjnsl \"Iamthematrix\"", "ReviewID": "R1X2V9B8TB65CJ", "Overall": "5.0", "Content": "i'm a graphic comunications student w/ a photography minor and my photography professor, who is a professional photographer said this was the digital camera to get  its easy to use and has a 32-420 lens  which is affordable with 8 mega pixels  for under $700.00  it takes really great pics in low light without a flash and is fast and you can set it to be silent  so no one knows your shooting pics so you can get alot of natural shots. oh but you must get another SD card pref. 1G or 512 to hold the more of the bigger pics , 1G SC card hold 400 pics at 5 mega pixels jpegs and  at 8 mega pixels it takes 32mb (the size of SD card that camera comes with)for 1 raw file.you do the math. it feels solid not like the FZ20K (5 mega pixels) and the LCD screen pulls out so it is great because you  can take shots for above and not rely on the viewfinder. you have to get use to the shutter it is different than film slrs. so take your time. the only bad things is you can\"t change out the lens  so you have to be really careful not to scratch it  so get a uv filter!  and  the software that comes with it does not work on an apple  but  Iphoto and photoshop works with this camera so dont worry.i've had mine for three months and i love it", "Date": "December 11, 2005"}, {"Title": "Great Camera", "Author": "G. Aguila", "ReviewID": "RV3XG12XHPJLC", "Overall": "4.0", "Content": "With everything already said (noisy low light pics, great zoom and stabilizer) i just want to add that the RAW IS supported by Photoshop, so it is NOT a useless feature... just make sure u have the most recent plugin update, which you can download for free from the adobe site...", "Date": "November 8, 2005"}, {"Title": "Not Perfect But Close", "Author": "Ronald Breeze \"F8NBThere\"", "ReviewID": "R2SXLO7QP3OZZ3", "Overall": "4.0", "Content": "First off let me say that I'm coming from a DSLR to this camera and it was quite a change, but I did it to get rid of some camera weight when traveling. I was very disappointed with the first images that I shot with this camera as the highlights where blown out, which is typical of the small sensors in point and shoot cameras. I purchased a B+W circular polarizer and the images are now spectacular. What I can't believe is how good the Black and Whites are. There are some really annoying things about this camera, primarily the battery door lock, no dedicated flash shoe and the camera locking up after three shots in sports mode (it should automatically go to smaller file size and motor drive for more than three shots but doesn't). I would also like to see a vertical grip for this camera so one has a little more to hang on to and vertical shutter control. No camera is perfect but I have to say that the Leica lens and IS give this camera and edge over anything else in its class. Shoot in RAW mode for best results and the 16:9 ratio really looks cool on your widescreen. I'm happy enough with this camera to not go back to an SLR and all the associated expense and weight of a system. Good job Panasonic!", "Date": "May 8, 2006"}, {"Title": "Nice 19.1X zoom at lower resolution", "Author": "Babaee Naz \"babaee\"", "ReviewID": "RL4UKT6RFX1E2", "Overall": "5.0", "Content": "The best feature is the zoom. On 2 and 3 Meg Pixel resolutions it exceeds advertized 12X zoom to a fantastic 19.1X. Yes, you will need a tripod to use max zoom, and Anti Shake will not be very effective there. Nice mechanical and camera world geometric design. You will not miss the buttons and wheels. Speaking of wheels you can have manual zoom, arperture, shutter speed, and focus under your control at the same time (2 wheels, and 2 rings) which is a bless. Auto Focusing time is not bad. Much faster than my other brand cameras. It either gives you a focus lock in less than 1 second or under low light, it gives up in 2 seconds followed by 4 beeps. 2\" LCD Display and its angles are practical. View Finder is usable. User Interface is designed very well. Rare optional 16:9 aspect ratio with different resolutions is a plus for people having a Panasonic HDTV (or any other brand with SD card slot)Please do not read the rest of this review because I am going to complain. This is my 7th digital camera and the most noisy one so far. Picture noise above ISO 200 is intolerable. Its weird that even on ISO 80 I see noise as well as purplish corners. It might be my camera being defective but so far the best setting would be ISO 100. The other flaw is the manual. You better read blogs off reliable sites (like dpreview.com) to understand this camera. And the weight is so much, it makes it difficult for one hand operation, assuming you don't want to use the always manual zoom. Also the camera is not balanced while hanging from your shoulder. The lens tilts toward ground like a SLR with a heavy lens.", "Date": "May 24, 2006"}, {"Title": "Great Camera if you get one that works", "Author": "John1938", "ReviewID": "R8FH28MXHGWSS", "Overall": "1.0", "Content": "I purchased FZ30 in early December 2005, in early January it died, wouldn't turn on. I sent it in for warranty repair, they replaced a fuse and returned it, it died again in exactly the same way in early February, they replaced a fuse and returned it again. It has now died in exactly the same way for the third time.  Panasonic customer service refuses to replace the camera and I'm stuck in an endless loop.  Panasonic service is terrible.  If you are unfortunate enough to have warranty problems forget it.", "Date": "February 24, 2006"}, {"Title": "FZ-30 everything I ever wanted...", "Author": "M. Bates", "ReviewID": "R3LGBJJ82VZLUE", "Overall": "5.0", "Content": "I bought the camera before a recent trip to the Carribean. It has every feature I wanted, and took really amazing pictures. The Image stabilazation was critical as much of my shooting was done on a catamaran riding waves in the ocean. Images are crisp and I have no complaints. I did see some noise at highest resolution, but it is minor... and as others mentioned can be cleaned with editing software. But for an amateur the pictures are fantastic.Battery life is really good, never had issues with it, but still recommend anyone who plans on shooting lots of pictures.I did scale down the resolution to the JPEG format and you get 250 photos per 1Gb card compared to the 90 for Raw files.I still need to learn how to use every feature, but this is a camera I can grow into.I compared photos with others on vacation with serious digital cameras. Theirs did take great photos, but they also paid 3x more what I did. Then again I got photos of dolphins jumping in the waves that they missed because they were fiddling with their settings... so who won here?The only thing I need now is the polarized and UV filters. I think the UV might have been the cause of some of the noise in my photos. It was the equator, and it was always bright. That is a must have addition to the camera.", "Date": "May 10, 2006"}, {"Title": "Wow! Wow! Wow!", "Author": "William Oterson", "ReviewID": "R1GFBC97YJJKNO", "Overall": "5.0", "Content": "Yes, I exclaimed Wow! This camera is great. I've had it a week (It's now been months, and this camera still rules) and, frankly, I'm still trying to figure out half of the bells and whistles it comes with (I'm getting them down pat, and love the results). I'm coming off of an Olympus 3.2 mp and I can't get over the fact that this camera comes from Panasonic. The 12x zoom in incomparable. Picture quality is excellent. I recently used it at an indoor affair and it performed perfectly with and w/o the built in flash. Used it for some really close ups of flora while kayaking and still can't believe the quality of the photos (excellent results no matter the subject). I haven't come across anything negative and I've been giving it a workout. Good job Panasonic, thanks. And for the money this camera is a true bargain.", "Date": "May 12, 2006"}, {"Title": "Amazing Camera - Exceptionally Easy to Use", "Author": "Malcolm \"motorsports\"", "ReviewID": "R1344GV004YB3L", "Overall": "5.0", "Content": "This is my third digital camera, and by far the best one I've ever used. I purchased it for my trip to Kenya and it never let me down.The instant on feature is incredible. It turns on about as fast as my SLR did. The 12x optical zoom is beautiful. I found the interface easy to master, though I did accidentally switch it into macro mode once and it took few minutes to figure out what was wrong.After 1,500 photos, I am very happy with it. I bought two extra batteries, though battery life is so good (about 250 outdoor shots) that I never needed more than one. I used a 1GB card and a 512MB card for backup. The 250 high-quality shots that fit on the 1GB card got me through the day.I especially appreciate the exposure adjustments that can be done real-time.The flash is kinda wimpy, but that's not what I wanted it for.Overall, this is a beautiful bundle of technology. Light and agile, it is easy to use to take excellent photos.", "Date": "March 14, 2006"}, {"Title": "DMC-FZ30K versus FZ20 - feel is critical", "Author": "J. Baker", "ReviewID": "RQGT7ALSHM34N", "Overall": "5.0", "Content": "I agree with the all the positive reviews below.  All I would add is that if, like I was, you are tempted to save $100 (or whatever) by getting the FZ20, I would strongly suggest going to a store and actually holding the two of them.  To me that made all the difference.  The FZ30 does not seem much bigger or heavier, but it feels a ton better, at least to me.  It feels very comfortable and solid.  For a camera that you will likely be keeping out and in your hand often(because that very fast start-up time makes you ready to shoot at a moment's notice), a comfortable feel is very important, in my opinion.", "Date": "December 27, 2005"}, {"Title": "Excellent super-zoom camera", "Author": "DJ", "ReviewID": "RBYBRMQM2Z0PG", "Overall": "5.0", "Content": "As you can see from the list of features, this camera is packed with everything you will need.  I've used this camera in a variety of outdoor situations around town and backpacking.  The high points are 1) excellent outdoor photos, 2) great power usage (the included battery is good for 300 photos at least), 3) a wonderful lens with 12x zoom, 4) easy to learn and use controls.  Be sure to get at least a 1 GB card since it fills up quickly with an 8 MP camera; I would also recommend a Secure Digital card reader of some type since the camera only uses USB 1.1, which means it will take 4-6 seconds per photo to load onto your computer.  As other reviewers have commented, noise can be an issue with this camera, but if your photos are primarily outdoors or in good light it isn't a big problem (especially at ISO 80).I highly recommend this camera.", "Date": "November 19, 2005"}, {"Title": "Good, but not THAT good", "Author": "Mr. Michael Scott \"mikes51\"", "ReviewID": "R2QU5ULB8421G6", "Overall": "4.0", "Content": "I have seen the rave reviews, but I have some reservations!!Reviewer: mike scott from Syston, Leicester United KingdomI got one of these a few days after it was released in Japan, and have taken it with me (and a FZ5) on a safari/beach holiday in Kenya. I have found that both cameras (including the FZ30) with one- or three-spot metering tended to produce slightly under-exposed pictures in virtually all lighting conditions and with nearly all subjects. I haven't tested the FZ30 with other metering set-ups, but I was slightly disappointed to find the results were quite dull. Since the Auto mode ought to produce good results, at present, I am not convinced that this is the case.Having said all this, about 5% of the 400 or so photos were just about right, and the camera is easy to handle; the zoom is good; the detail is great; colour balance is neutral; the OIS is excellent; and the autofocus didn't fail me once!! The much-vaunted noise doesn't seem to be an issue.One other thing worth noting is that the 8M pixels are only available for photos at 4:3 ratio (OK for 8 x 6 prints), but if you want the standard 6 x 4 or 5 x 7 you'll have to make do with fewer pixels (only 7M for 3:2 ratio). As things stand, this means (when compared with Nikon and one or two other Digital cameras) the 'usable' number of pixels (in the most common format) is probably being overstated.Ultimately I have found it necessary to spend a lot of time post-processing the images to a) get acceptable images and b) cropping to suit 6 x 4 photo 'cards'.(I am not a camera expert, and maybe I expected too much of the camera in Auto Mode)", "Date": "October 28, 2005"}, {"Title": "Great Photos; Bad Fuse", "Author": "Wine Lawyer", "ReviewID": "REXC83JYLCSUZ", "Overall": "4.0", "Content": "After several months of research, I bought my Panasonic FZ30 from Amazon in November of 2005. I am very pleased with the quality of the photos and the model's features set. I felt confident that I made the right decision, and the camera performed well when compared to an older 10x zoom Olympus that I had upgraded from.But in April of 2006, I took the family to Japan, and while in Kyoto, the Panasonic simply went totally inoperative, even with fresh batteries, while the Olympus (thankfully) chugged along so I could at least get some lower resolution photos of our visit there.Warranty repairs were performed and were done quickly. I disagree with the previous post that Panasonic warranty work is poor - the one vendor that I used was courteous and prompt - then again, I haven't had to send the camera back on repeated occasions, and I'm sure my patience would be somewhat shorter if that had happened to me. Warranty work is like insurance - you like to know you have it, but you don't ever want to have to use it.From a description on the invoice, a fuse was replaced. This appears to be a disturbing common theme for this model, and I hope that Panasonic realizes this and makes some production changes to cure this issue. As with other reviews that I have read here, when something like this happens, it shakes your confidence in the camera and you can't help but remain anxious that it's going to happen again when you're on yet another once-in-a-lifetime trip.", "Date": "April 28, 2006"}, {"Title": "Great for the enthurist wanting type SLR performance without the SLR", "Author": "jacktar \"tackennut\"", "ReviewID": "R1QLYGVEFE4YSO", "Overall": "5.0", "Content": "Mainly take motor racing shots when racing historic race cars.  Without getting to technical (because I can't) I have switched from my Nikon F90 film to the FZ30 and found that I am getting just as good shots as with the Nikon.  Of course the Nikon film is faster and much better for multishot senarios however the FZ30 is great when you have a set shots.  I have used it for the multishot senarios with success and have some great shots from this method.  You don't get the granularity of the Nikon in terms of number of shots however it is more than sufficient.  I would suggest that you invest in a 1Gb memory card as a minimum as 8Megapixels can chew up the memory.  Also invest in a spare battery even though the battery life is good for at least the 1Gb memory shooting in a single day I find that it is much more efficient to get spares.  I have 2 spares which is more than adequate.  The interface is excellent and even though the screen is slightly limited in rotation it still satisfies 95% of situations.  I don't take many shots requiring flash however this few I have taken are very good and comparible to other similar style cameras on the market.  This is where an SLR will definitely have a superiority over this type of camera as shown on many of the digital camera review sites.  Speed as you can imaging taking motor racing shots is good and functions are great with the front and rear wheels to select features in a similar way to the Nikon.  No major issues however the lens hood when in the reverse position prevent you from using the zoom which can be a pain if you don't have anywhere to put it.  About the only bitch I can think of.  Oh yeah,  the image stabilisation works as well as can be expected.  I use a monopod when shooting and with full zoom.", "Date": "March 22, 2006"}, {"Title": "Great camera with a long feature list delivers solid performance", "Author": "W. Taylor", "ReviewID": "RC4AH3QVM5BXW", "Overall": "5.0", "Content": "Few people would not like this camera if given the opportunity to play with it for a few hours. The camera is well weighted and feels good in your hand, a satisfyingly big camera, although I would like more room between the lens barrel and the right hand grip to allow both hands a steady grip, although it is a very minor complaint.The full manual capabilities and zoom and focus rings make it feel just like an SLR. Compared to an SLR, I feel this camera is a very viable alternative. The image quality is good, although noise levels are rather high at high ISOs compared to an SLR, but if you aren't shooting in low-light conditions it will be fine. Even then, Neat Image([...]) delevers great pictures and removes all traces of noise. The images are large(approx 48\"x35\") so printing at large sizies is fine. The price compared to an SLR with a comparable lens is extrememly low. Expect to spend around $2000 on a SLR with a 12x stabilized lens. The LCD monitor on this camera can also be used as a viewfinder, unlike an SLR(the mirror is in the way of the sensor).Menus are easy to navigate. Battery life is okay, I would like to be able to use AAs too, but I can understand the limitations. The lens cap is easy to lose as it isnt attached to the camera. Those are my main gripes. I love my camera and know it will serve me well for several years.", "Date": "October 13, 2005"}, {"Title": "Great Camera, Great Lens.  A bit on the noisy side.", "Author": "Marika E. Buchberger \"Shutter Bug\"", "ReviewID": "RAJNT4P6GA5SI", "Overall": "4.0", "Content": "I've had this camera now for a few weeks. Overall, it takes really nice, SHARP images throughout the zoom range. It's a bit on the heavy side from what I'm used to however, the camera feels well-balanced so that makes up for its weight.The lens is not actually manufactured by Leica in Germany. The lens is designed by Leica but manufacturered in Japan of Japanese glass and components to Leica specifications.Problems:PURPLE FRINGE: This camera exhibits purple fringe in high contrast images. I also found green fringe in some of my images too. But alas, these problems are mostly solved in Photoshop or by using a Hot Mirror filter.NOISE: This camera displays a lot of noise especially in darker images and at ISO settings above 200 or even 100 in some cases. I don't care for any of the current noise reduction programs, they only seem to blur the image in an attempt to reduce noise so I don't use the camera above ISO 100. Sort of pityful that Panasonic would match such a great camera and lens with such a mediocre sensor and processing engine. Maybe a firmware update is hopefully in the works for this camera which might help? Shooting in RAW mode seems to help a bit with the noise, making it look more like old fashioned grainy film.  There's also some clipping that occurs in the RBG color gamut, again in darker images mostly.  The dynamic range of the camera is a bit less than most other cameras which would explain the clipping.Overall, it's a great camera thanks to the lens, but it has limitations.  If you learn to work within the limitations of the camera, the images it will produce are stunning.", "Date": "May 6, 2006"}, {"Title": "A Top Contender in Prosumer Market", "Author": "J. Hoppman \"gunrock\"", "ReviewID": "R1QOWFWHR5OVYT", "Overall": "4.0", "Content": "Obviously, if you are looking at this camera, you are looking for a bit more than a simple \"point & shoot\".  I have been using this camera for 8 months now and have taken thousands of shots. This camera and its controls are very easy to find and very intuitive.  I wish it had a dedicated button for switching film speed, though.  When I first started playing with this camera I was initially disappointed. You really need to familiarize yourself with photography and the camera before you can totally enjoy it.  I have had some bad pictures, but I attribute that to mostly inexperience.As far as portability, this isn't a pocket camera, but I don't find it very cumbersome to carry around either.  A Lowepro Rezo 140 AW fits this camera perfectly.To address those who say this camera is \"noisy\". Yes sometimes pics at 200 ISO or above may have some noise, but that's because Panasonic uses considerably less post processing out of the box; 99% of the time the noise is negligible and the results are sharper pictures.  I will admit 400 can be hit or miss sometimes, not the worse I've seen though.  You can change settings on the camera for more processing, anyway. If you compare it to the Fuji S9000, the Fuji image does have less noise, but the image is a lot softer.  It uses more aggressive processing to \"soften\" the picture which means you loose some detail.  As far as the pixilation at 100%, I get this with most cameras I've played with when you start talking about cameras with higher mega pixels. Familiarize yourself with this camera; search the forums for tips and optimal settings and you have yourself a fine camera.I do wish they would have been able to squeeze a faster film speed out of it, maybe 800 to 1600 like the Fuji does.  This brings me to my next point. With all consumer grade cameras, low light conditions can prove to be a challenge. It's very hard to capture motion without blur when you don't have the higher film speeds; aperture can only take you so far. You need at least 1/250th for shutter speed and even then you will get some blur with situations such as \"well lit\" basketball courts...If you are taking wide angle or still night pictures this camera works fine.Finally, I love this camera and its features, but I grew out of it fast. You need to decide what features are most important to you when choosing between a prosumer and dSLR camera. Search Google for prosumer vs. dSLR or similar and decide for yourself based on your needs.  Of course, if you have the money, buy both and a pocket camera! :-)", "Date": "July 16, 2006"}, {"Title": "The Most Bang 4 Ur Buck", "Author": "Daniel T. Kamin \"Academy Award\"", "ReviewID": "R2SKGXB4RXLJ0U", "Overall": "5.0", "Content": "I have to believe that someone writing a negative review of the FZ 30 must either bea competitors plant or someone who doesn't have a clue about digital cameras andphotography. This camera is a steal. Gorgeous photos. Gorgeous. Not for action shotsthat it true, but landscapes, portraits, those sorts of images it is just perfect. Stoppedusing my Canon 20D once I got the hang of this camera which I purchased fromAmazon as a camera to travel with because of the range of the lens.", "Date": "July 18, 2006"}, {"Title": "Wow, what a camera!", "Author": "Thomas A. McGarity \"Summer (Tom's daughter - ...", "ReviewID": "R3MELMV8TH0F4N", "Overall": "5.0", "Content": "\"Santa\" brought this camera (the silver-colored one, not the black one)to me for Christmas this year (2005).  Previously, I had owned a Canon Rebel 2000 SLR camera with a separate SLR interchangeable lens and also my former digital camera, the Canon PowerShot A70.  Coming from the Canon Powershot A70, this Pansonic Lumix digital camera was a HUGE upgrade!  Problems that I've experienced with the Canon digital camera never occur with my new Panasonic Lumix camera.  Basically, to me, the camera operates just like a digital SLR camera.  The only difference is you don't have to go through the hassle of changing out the lenses, which was the biggest selling factor to me.  I love how you can zoom with the lens attached to the camera, not by some motorized button on the camera.  This is probably my favorite quality of the camera.  It basically operates just as a SLR or digital SLR (DSLR) would in the respect that you zoom and focus in by rotating and focusing with the lens.When I was doing research for buying a new digital camera, I wanted a digital SLR camera, but if you compare the qualifications and price of a digital SLR camera such as a Canon DSLR versus this Pansonic Lumix camera, there is not much difference, other than in the hefty price difference.  Most Digital SLR (DSLR) cameras I had looked at (at a reasonable price, $1000 or under was what I was wanting to spend...and I was looking for the best deal for the money also.) offered the same otions and quality that this Panasonic Lumix does (such as 8 megapixels and so forth).  In fact, some of the DSLRs I looked at didn't have as many megapixels as this Pansonic Lumix camera!  I figured for the money, the Panasonic Lumix was a much better deal also, considering that if you bought a digital SLR camera, you would then have to buy a DSLR interchangeable lens if you wanted to get any further distance (zoom) with your pictures.  That would just add onto the price tag of what you'd be spending.  The other huge thing that grabbed my attention was the fact that this Panasonic Lumix camera was rated # 1 in the Consumer Reports magazines that were put out I think in October or November 2005 (I can't remember exactly which issue it was, but it was an issue that came out before Christmas and had digital cameras on the cover and said it rated the best digital cameras.) and also, the Pansonic Lumix camera was also rated best buy as # 1 again in the other Consumer Reports paperback book that was called something like \"Best Gifts for 2005\".  This was what impressed me the most.  If you are like me, you want to get the most for your money, but at the same time, you want a camera that will be challenging for you, something that you can learn and grow with, something with manual functions as well as automatic so that as you learn photography techniques and so forth, you can apply them with your camera and your camera will be able to do all these things.  That was what I was searching for, and I definitely found it by buying this camera, so I highly recommend it to anyone.The only problem I have experienced so far is that when taking pictures with the Image Stabilizer, the pictures still are blurry.  Using a tripod helps this, definitely, but if you don't have one with you, there's a chance your picture can be blurry.  I don't think the Image Stabilizer is as good as they all rave about it, so beware of that.  If you have a really unsteady hand when taking pictures, invest in a tripod.  If it's a candid shot that is spur-of-the-moment where you don't have the time to go get the tripod out, beware of the Image Stabilizer, if you have shaky hands!  Your picture will turn out quite blurry...but probably it's better than it would turn out with other cameras, I'm guessing.  But, that's the only problem I've experienced with  the camera.  It does get on my nerves, but oh well.  Considering that is the only thing that bothers me compared to everything that I LOVE about the camera, it's totally worth investing in the camera.", "Date": "January 11, 2006"}, {"Title": "Recent purchase of Panasonic Lumix DMC-FZ30K 8MP", "Author": "J. Menendez", "ReviewID": "R2YNARA6JEZNHX", "Overall": "5.0", "Content": "I received my new camera kit only a day before a trip to Egypt and Israel (not much time to learn the use of it).  I am a novice on using digital cameras and only have some experience with cameras in general.  I found the Lumix FZ30K very user friendly with excellent features.  I was able to use only a fraction of the features available during my recent trip due to lack of knowledge on my part.  I took 390 photos and the results were very satisfactory.  The user's manual is very easy to read and well organized.  The camera, even though has the size of a regular SLR, is very easy to carry and handle.  We were on the go every day with a lot of walking and even mountain climbing and I had no problem carrying my camera in its own case inside my small back pack.  It has a very nice zoom lens at 12x and I captured some nice photos at good distances from the objects (1 to 10 miles away).  At reduced resolution (5MP) I was able to take 390 pictures and still had ~40 remaining with a 1Gb SD memory card.  The battery would last me all day except when I used the review feature too often (>50%) and did not charge the battery the night before.  The battery charges in ~2 hours or less.  The only problem I had with the kit was the charger.  The indicating lamp on the charger does not come on and I could not tell if the battery was actually being charged or not.  I reported the trouble when I retuned from my trip.  The camera manufacturer was not a lot of help, they wanted me to return the entire kit even though I insisted that all I needed was a replacement charger.  Amazon was very good about this problem and they are offering a solution.  Amazon handled my order very well and the delivery came exactly as promised.  If it had not been for the battery charger problem this would have been a flawless transaction even though I am not very experienced in shopping over the internet.  I will not hesitate to order other items with Amazon in the future.", "Date": "March 13, 2006"}, {"Title": "Usually A Great Camera , but has some problems, Update from August At End", "Author": "Outdoor Photographer", "ReviewID": "R3CL6LAQ00MDCI", "Overall": "4.0", "Content": "I bought my Lumix DMC-FZ30 in December, 2005.  I had been using a Lumix DMC-FZ10 and loved it but wanted better quality.  I loved my new FZ30 camera and it was living up to all my expectations (many qualities that were much better than the FZ10) when 91 days after I purchased it (not 91 day after I received it)it just stopped working and wouldn't turn on (turns out to be a faulty fuse).  Had to send it in for warranty repairs and that wasn't fun.  Read reviews here and found someone else reporting the same exact problem.  Five weeks later and after sending back in for warranty repairs a second time (someone put a finger smudge on the interior lens) I have it back and it is working very well.  However, I find myself waiting for the camera to just stop working again like it did to the gentleman in the other review (for him it was 3X's).  I am with him.  This is an excellent camera with the ability to take great quality shots but there may be a problem with the fuses in this model.  I went back to using my old FZ10 when I had to send in the FZ30 and it is still working as well as ever.  I hope my FZ30 will continue working for at least a few years and I have no more need to deal with Panasonics Warranty Dept.It is now 4 months later (late August) and there have been no additional problems with the fuse.  It would seem the problem was fixed when it was sent in for repairs.  Love this camera overall.  I do mostly wildlife shots and it does a great job.  A little slow for getting the birds before they fly sometimes, birds in trees against gray skies often have purple around the edges due to extreme contrast, sometimes has trouble focusing in shots with a lot of different levels, but I have gotten many great shots with this camera.  I am really very happy with it now that it is working properly.", "Date": "April 14, 2006"}, {"Title": "Can get lots of help from some \"Forums\".", "Author": "Hotrodder \"HotRodder\"", "ReviewID": "RLK9WKXCZOT83", "Overall": "5.0", "Content": "I'm writing mostly in response to \"projectmgr\" low 2 star rating from November 27-2005 due to his percieved lack of information and support for the camera.I ordered my FZ30 from Amazon last week, and even though I don't have it yet I have been doing a ton of research on all of its accessories. I have spent weeks reading and learning mostly from forums where experienced hobbyists share their photos, discuss hardware and other tips. I'm 100% confident you'll be able to find an answer to all of your questions there. Here are 2 reputable digital camera review sites:[...][...]I have accumulated a list of different retailors for accessories from filters to external flashes to lenses just from scouting the forums there.As for the RAW plug, I read on one of the boards that Photoshop already has a plug to download for RAW images. I have not personally verified that.I will try to update this review once I get my camera should the need arise.", "Date": "November 27, 2005"}, {"Title": "Great Camera - Bridges Gap Between Point-and-Shoot and SLRs", "Author": "Charlie", "ReviewID": "R3AVTEVBC3FER4", "Overall": "5.0", "Content": "\"Santa\" brought us an FZ30K for Christmas.  This was an upgrade from a point-and-shoot 35MM film camera.  I checked out many models before deciding on this one.  It has an excellent blend of features between the lower-priced point-and-shoot and higher-priced SLR digitals.Photo quality in sunlight and with flash is outstanding.  We've had traditional prints made, as well as viewing on computer monitors and high-def TV (in a Christmas \"video\" of still shots that included some close-in pan-and-zoom effects).The picture sharpness far exceeds what our Olympus point-and-shoot 35MM could do.  The Leica-branded lens on the Panasonic is great.I won't repeat the other reviews... but I must mention the autostabilizer.  It's outstanding.  I took a bunch of handheld shots of birds today at full telephoto. No sign of shakiness whatsoever in the photos.", "Date": "January 7, 2006"}, {"Title": "Excellent Camera & The Best Bang, For Your Buck!!!!!!", "Author": "BoricuaTech... \"LouMatic...\"", "ReviewID": "R3CYBKRW3DIE5Z", "Overall": "5.0", "Content": "This is one awesome camera and I am truly happy I bought this camera. I had been researching and debating for a while and after one brief mistake of purchasing a Kodak P850 and returning it back for a refund, I came across this \"Panasonic FZ30\". This camera is Great, it's like a DSLR but with the simplicity operations of your traditional Point-Shoot cameras. The image stabilization works great and the zoom is just phenomenal. It comes with a hot shoe for future flash accessories and the LCD on this thing is just absolutely crystal clear. There is some noise at higher ISO settings/conditions but its nothing to get worked-up about. The video mode is really nice too you can record at 30fps and the quality is surprisingly good. I love this camera and can not seem to stop playing with it's so many features. This is one Excellent Camera & The Best Bang, For Your Buck!!!!!!", "Date": "October 15, 2005"}, {"Title": "Pre-purchase info", "Author": "Amazon Customer", "ReviewID": "R3R6R0EDPLTW0D", "Overall": "4.0", "Content": "As with the previous reviews, a lot of people have done their research.As for the RAW Support, Adobe has release a Camera RAW Plugin 3.2 update (9/26/05) that supports the Panasonic FZ-30 RAW format.[...]This plugin will work with Adobe Photoshop CS2 and Photoshop Elements 3.As I will probably purchase this in the next few weeks, I will update my review.", "Date": "December 3, 2005"}, {"Title": "Still Learning to Use It", "Author": "P. A. Thomas \"pathomas\"", "ReviewID": "R36PAN3CLZ3IRX", "Overall": "4.0", "Content": "I've used the same Pentax K-1000 for about 40 years, and it's been through a lot since I first bought it to record archaeological data and features, and then kept it when I began doing anthropological fieldwork in remote jungle areas. But, after having the film relentlessly zapped at border crossings where you don't argue or cause any disruption by trying to change procedures, missing shots from vehicles not suited for any kind of photographic endeavors, paying out astronomical amounts for the volume of film developed, I decide to try a a \"serious\" digital that was less complicated and expensive than a dSLR. So, I bought the DMC-FZ30. It is very much more complicated than the K-1000, of course. But, it looks and feels like a \"real\" camera. I haven't had it for more than a couple of weeks, and I'm still trying to learn to use it effectively. The manual is confusing, and has gaps that I have trouble filling in. What I've been able to do with the camera, I'm more or less satisfied with. In the past few days, I read the user reviews on Amazon, and learned more from them than I did from the rest of the time spent pouring over the manual. The review by Thomas Seiler (The National Parks, USA) was especially helpful. I learned how to use more functions in an hour and a half following the review with the camera, than I did in two weeks with the manual. Thank you, thank you, thank you.", "Date": "December 30, 2005"}, {"Title": "Best choice for hobbyists", "Author": "Kellie Peterson", "ReviewID": "R3O8GD0WWCNJ48", "Overall": "5.0", "Content": "For a relative beginner to hobby photography this camera could easily overwhelm, but it's surprisingly easy to use. Even more so when you actually read the manual.I owned and loved the Panasonic Lumix DMC-FZ5K for about 8 months when I realized that I wanted something a bit more advanced with zoom and focus controls outside of the digital menus. I thought about taking the plunge and going dSLR but was daunted by the prices and need for additional lenses, etc.While researching the dSLRs I ran across several sites that mentioned the FZ30 and decided to check it out. I haven't regretted it for a moment. This camera is exactly what I needed and I expect it will carry me through for several years before I am really ready to move up to a dSLR.Highly recommended.", "Date": "March 4, 2006"}, {"Title": "Huh, that's pretty cool", "Author": "Jason Bourne", "ReviewID": "R2X8D9MKA7WOJL", "Overall": "5.0", "Content": "That's what I said the first time I started playing around with this camera.  I got it for Christmas and the last month and a half, I have not been able to put it away.  The piture quality is astounding, the zoom is looooong, and the additional features are plentiful if not staggering.  Yes I understand in dark areas with dark shadows and at high iso settings it will have a bit  of noise, but if you are mainly an outdoor photographer, you shouldnt have a problem.  All in all, I absolutely love this camera, though if I had to gripe about anything it would be the fact that the camera, when strapped around your neck, will point down at a 45 degree angle, and the lens cap is not tethered to the camera so you have to find a place to put it when you take it off, honestly I didnt think it was that big of a deal and now I'm about ready to make a tether for it myself.  Other than that though this is the best camera out there for the features, quality and the price.", "Date": "February 10, 2006"}, {"Title": "Lovin' it.", "Author": "S. G. Revak", "ReviewID": "R3EUV2RE6FV8H3", "Overall": "5.0", "Content": "I have been wanting a digital SLR camera for a while.  My aunt, a professional photographer, talked me out of a traditional SLR suggesting the Panasonic Lumix.  Boy am I glad I asked her!  This is a great camera!  The lens has given me all of the flexibility I was looking for in an SLR camera, but I don't have to carry around and change out lenses.  The auto mode makes it easy to take quick pictures while site seeing, and the custom modes allow for more artistic photos when needed.  I'm looking forward to lots of great pictures with this camera!---Side note.  Definitely buy a bigger memory card.  The card that comes standard will quickly fill when taking high resolution pictures.  The 256MB card upgrade I bought allows for 100 pictures in 5 megapixel mode, which is unbelievable!", "Date": "January 30, 2006"}, {"Title": "Movie and burst mode works with standard speed sd card", "Author": "Rodrigo \"Sod'ré\"", "ReviewID": "RRLSYFKSCLRDN", "Overall": "5.0", "Content": "I purchased this camera with a sandisk 2gb standard sd card since the \"ultra II\" model had bad feedback and the \"extreme III\" is limited at 1 gb only. Unlike many reviews says, with the standard speed card I still can shot on infinite burst mode (maybe not at 2.1 shots/sec but not also too far from it) and use the movie mode with highest quality (640x480, 30fps).Overall, I'm very satisfied with this camera. The noise problem, maybe the biggest users complain, does not affect the final quality of the pictures if you properly care about light conditions, exposure and ISO settings.", "Date": "June 6, 2006"}, {"Title": "Great camera and great pictures", "Author": "David Brandenburg", "ReviewID": "R28BHGRGOB26ZE", "Overall": "5.0", "Content": "I have been using the FZ30S for about a month and I am very happy with it's performance and features.  I decided on the FZ30S over a digital SLR because of the lens, the feature set and the quality of the pictures.  The 19X zoom lens is someting you have to experience to believe.  The manual focus is very easy to use and allows me to take shots through a screened porch by setting a low F stop and focus on the subject at a distance.  So far everything I have tryed works well and the picture quality is tops.", "Date": "January 29, 2006"}, {"Title": "Panasonic DMC-FZ30 - The Camera Powerhouse", "Author": "California Shopper \"JenElder\"", "ReviewID": "R1KDM75RXOX8MC", "Overall": "5.0", "Content": "This is the best camera.  The photos that it can capture are just amazing!  I consider myself a vacation photographer, in that the camera is stored until that time. I love taking pictures, but haven't mastered the aperture/shutter setting deal.  But with the Panasonic DMC-FZ30, using the auto setting is all you need.  I am so impressed with this camera - fully equipped with all the bells and whistles.  How did Panasonic get so much in such a light weight camera is beyond me.  One outstanding feature is the zoom - a whopping 420mm.  All this without having to change the lens or any lens movement.  Just a quick turn of the lens dial and you are there.  I tried the manual focus for the first time at my local zoo - and even I was impressed.  Speaking of my trip to the zoo, the camera was able to zoom/focus right on the monkeys in the cage so well, that you cannot see the cage railings at all, as if it was erased.  How did it do that? To prove my point and brag on this camera, I will post some pictures from the zoo.  The camera makes me look like a professional photographer.  I just love it, and so will you.  By the way, Amazon had the best price for this little powerhouse.  So I am a happy camper.  I cannot say enough good things about this camera.  I will be taking it to South Africa in a few weeks and will expect it to continue to perform magnificently.", "Date": "February 23, 2006"}, {"Title": "This is a terrific camera!", "Author": "Marsha Elder", "ReviewID": "RF8GWLDJ2Y0E6", "Overall": "5.0", "Content": "This is my very first digital camera and I'm a beginner photographer.  I say beginner only because there is no lower classification for me to put myself in.  I was one of those \"idiot proof\" camera users who took pictures only on vacations and when I got a good shot, no one was more surprised than me.I bought the Panasonic Lumix DMC-FX30 from Amazon in early Jan. 06 and I can't say enough good things about it.  Even Amazon's price was terrific.  It's a powerful camera with TONS of bells and whistles.  I WOULD recommend it even to a beginner like me.  There's nothing wrong with using the auto mode, you can get some beautiful pictures that way.  I would tell a beginner to get comfortable with it first, then get fancy and use all the features later.PROS: super sharp images, nice zoom capabilities, great hi-res LCD screen, true-to-life color reproduction, you can put the lens about an inch away or even closer to your subject and take a completely clear photo, and the camera just looks coolCONS: night shots can be a little grainy, for anyone who tends to have trouble with tendonitis, be sure to hold it correctly (with both hands) or you can flare up that problem like I didI've posted 10 photos I took just around the house and some others of wild birds, all in total auto default mode, so anyone can see just how great that mode is.  This camera is wonderful because it's one that you can \"grow into\" for years to come.  Five stars!!", "Date": "February 16, 2006"}, {"Title": "Good pics, but wait, there's more", "Author": "LMO", "ReviewID": "R1KB9WS1WFLR4K", "Overall": "4.0", "Content": "I won't go into the plusses and minuses. Read the other reviews for that. It takes good pics, sure. Not great, but good. But I dropped it. I mean a good drop...onto cement. I heard the thunk and a crack and thought \"Time to get a new camera.\"Surprise, surprise. I don't know what the crack sound was, as I can't see anything on the camera, but the bloody thing still works fine and has shown absolutely no effect from the hard fall. And that was a few months ago, and it's still working fine. Okay, yeah, it now broadcasts FM radio rather loudly, but still takes fine pics (just kidding about the FM). Try than with a Canaon or Nikon!", "Date": "December 29, 2006"}, {"Title": "Panasonic does it again with DMC-FZ30", "Author": "James Hamilton", "ReviewID": "R23BT1H49RDJZ", "Overall": "5.0", "Content": "The FZ line of Panasonic cameras has been outstanding, now the best yet has emerged! The DMC-FZ30 has most of the features that were lacking in the DMC-FZ20, a moveable LCD, 8megapixels, and some of the menu features are now accessable via buttons. After using this camera for a month I have found it takes great pictures and the Image Stabilization and High Speed Focusing are super! The only fault I have found is that the noise level above 200 iso is un-acceptable. I'm sure Panasonic will address this problem with their next release. Until then I will continue to enjoy this model.", "Date": "October 21, 2005"}, {"Title": "Increase in resolution, need good exposure ...", "Author": "Howard Liu", "ReviewID": "R1OH07N77RMUO2", "Overall": "4.0", "Content": "As an owner of fz* series of camera, I support Leica Lens.It deliver the best clarity and natural color and its gradematch those expensive Leica lens in SLR world.fz30 is a good travel camera with increas in resolutionand flexibility in manual zoom and faster focus speed compareto fz20. The hotshoe is still needed for stability shots,and the flipped LCD is a plus for studio type of work orin shots shot from higher or lower angle.With around $500 USD for this digital camera, it deliverexcellent sharpness and megazoom to digital photos.Yes, noise does exist, the only way to avoid them is to properexpose the setting with external flash and amble amount ofexternal light source. ISO 200 or above does need a lot ofde-noise procedures due to the fact of the small sensor compareto DSLR.Overall, this camera is still a proconsumer's dream DC whichcan deliver the megazoom and sharpness for your travel needwith full manual control.", "Date": "January 30, 2006"}, {"Title": "PANASONIC  FZ30K CAMERA", "Author": "R. L. Smith \"R L SMITH\"", "ReviewID": "R1YPKBU4MLRHB4", "Overall": "5.0", "Content": "A VERSATILE CAMERA HAVING A GREAT VARIABLE LENS,STABILIZED OPTICS,AND A MOVIE FUNCTION ALL IN ONE CAMERA.I ALSO OWN A CANON REBEL WHICH MEANS CHANGING LENS AND NO MOVIE OR STABILIZATION EFFECT.IF YOU ARE INTERESTED IN HIGHER LEVEL DIGITAL CAMERAS, I WOULD CHECK OUT THE PANASONIC FIRST. IT WILL GET YOU STARTED AT A MUCH LOWER PRICE WITH EXCELLENT PICTURES.THE PANASONIC NEEDS AT LEAST A 1 GB MEMORY CARD WHICH DOES NOTCOME WITH THE CAMERA.", "Date": "February 23, 2006"}, {"Title": "The perfect camera I was looking for", "Author": "Ron Gafni", "ReviewID": "R2RK15L9A0TDGZ", "Overall": "5.0", "Content": "Behaves like a DSLR but provides you PS features like video, flipping LCD, relatively compacticFast startup anf quick AF, powerfulu Zoomno expanding lencesgood ergonomicsmanual focus and zoom rings - nice! featurefriendly signs on the display,quality optics, although some claim to have noise problems...I just enjoy every minute with it! can't stop using it!", "Date": "October 12, 2005"}, {"Title": "Great Camera", "Author": "Marlon C. Guerios", "ReviewID": "R2ANVEURBJGRCJ", "Overall": "5.0", "Content": "Yes, FZ30 really has noise, but it's a minor issue. It's a great camera without a doubt, very fast and very easy to use. The pictures are superb.", "Date": "October 25, 2005"}, {"Title": "Great Camera", "Author": "William Hubschwerlin \"William Hubschwerlin\"", "ReviewID": "R1SXIFW5N519IV", "Overall": "4.0", "Content": "I am just starting to get into this camera. As with most digital Cameras this one has many buttons to learn about, and many modes to choose from.I went to my usual digicam review sites on the internet and read a lot about this camera. I was interested in the amount of noise to expect in a picture, what potential problems the huge zoom may present, etc. Some reviewers, even here, panned this camera. So far, I have not seen ANY of the issues others have seen or have commented on. No purple fuzziness around a pictures outsides and no excessive noise so far in the pictures I have taken. This camera takes beautiful infocus pictures!I was originally looking at a Samsung Pro 8 mega pixel camera, but it did not have stabilization and it was almost twice as much as this camera.Most of my shots have been outdoors, so I can not comment on indoor shots yet, nor can I tell you about any action shots. I primarily bought the camera to take pictures outdoors of the area around where I live because of all the wild animals, the 14'ers, and the birds and flowers, etc.So far this is a great camera and well worth the money I spent.", "Date": "June 29, 2006"}, {"Title": "Pnansonic FZ30 digicam rocks", "Author": "SeeDoubleU", "ReviewID": "R180HEBJ327Z2U", "Overall": "5.0", "Content": "the Panasonic FZ30 is almost as good as a dslr. It is almost but not equal to the dslr because the fixed lens digicam will never compare to the dslr on the shutter response. Other than comparing to the dslr, this camera has the best shutter release than most of the other digicams. The picture quality is good, and the noise problem most people complained can be taking care by softwares.", "Date": "March 20, 2006"}, {"Title": "The best non SLR out there", "Author": "Doug in CA \"Doug in CA\"", "ReviewID": "RWP1B99PW5GWH", "Overall": "5.0", "Content": "It might even compete with the SLR's but I don't have a digital SLR so I can't really make that statement. My FZ-30 served me well for 2 years until it quit working due to getting wet. (Thank you American Airlines)I primarily use my camera for well lit out door shots. I do a lot of sports photography and the telephoto is always on max. I did use it for indoors as well and never saw the noise problem that some people comment about. It has a great balance and feel, focused accurately and took crisp clear pictures with accurate colors.I decided to replace it with a Canon S3 IS (very good reviews)since the FZ-30 was out of production, and the Canon was about $150 less. That was a mistake. There is no comparison, The Panasonic took so much clearer pictures. The Canon is  quite a bit smaller and lighter, it does not have the quality feel of the Panasonic. I am returning the Canon and ordering an FZ-50.", "Date": "June 11, 2007"}, {"Title": "MY REVIEW ON FZ30", "Author": "Jeffery B. Vu \"kool100vr4\"", "ReviewID": "R18XESHK31OQVF", "Overall": "4.0", "Content": "Well, to start out i must mention , i am a happy owner of in order: FZ15, FZ20x2, FZ7 , FZ10 and now FZ30.About FZ30: for the price its a very affective camera to have..its full of features like no other P&S; camera has. It has Leica lens , with my 2 Raynox adapter wide and tele, i can shoot my FZ30 from 26mm to 645mm with f2.8 -f3.8 with OIS, thats a lot of coverage for what i paid. Its a fast camera to shoot, nice color and sharp images, thank to Leica lens, you can buy it on ebay now for less than 400$, but remember its still a point and shoot camera ok?. some people compare it with DSLR, well, thats not really a fair comparison. But it can do some job that DSLR cant, a dslr is better in speed and high ISO, but dslr got dust prob, and too many lenses to keep up with a simple FZ30. they are both good for its reasons..buy both and be happy like me..Fz30 does have noise issue, but nothing to stop from buying it , noise appears on all iso, especially on higher iso, if you zoom up the pics and look at the sky or grey wall, 3/4 tone shadow ereas you will see it..but for a quick look, you love the pics right away, cuz its so sharp, yes it does have noise reduction build in cam, but to increas it, your pics will look less sharp, and the 3/4 shadow will look smeared.That is true for all noise software out there..no ifs, ands , or buts about it.I compare my FZ30 to my Sony R1 : well R1 images are very nice and smoother than my FZ30, less noise due to its big dslr like CMOS sensor, but thats about it..FZ30 out do R1 in other aspects and features..beside R1 is a lot more expensive to buy. I use both cameras, they both good for its range and its affectiveness.i strongly suggested any one to buy FZ30, its a great camera.Also the FZ20 too.my 2 cents.", "Date": "January 1, 2007"}, {"Title": "Lumix DMC-FZ30K Digital Camera", "Author": "W. Norman", "ReviewID": "RXZ4JXPLH8WY3", "Overall": "5.0", "Content": "Excellent viewfinder, large viewing screen, quality construction.  I consider this to be the best price/value and should be considered before paying the big $$$ for a DSLR.", "Date": "August 5, 2006"}, {"Title": "STILL the best superzoom bridge camera out there", "Author": "RLong", "ReviewID": "R1QHGWC12FIC08", "Overall": "5.0", "Content": "Ok, first let me admit that I may be a little biased...I used to work part-time in a camera store back in 2005 when the Lumix FZ-30 came out and used to play with it every moment I had when there were no customers around. Finally purchased one in 2008 when the price dropped and it's been my main \"go to\" camera ever since.Last year, went on a trip to Europe and--traveling light and not wanting to pay a whole lot of bag fees with all my DSLR equipment--took the Lumix (and a Macbook) with me instead. Figured that the single 12X Optical should be all I might need taking pictures of the German countryside. After all, anything that was shot wouldn't be for assignment or commission, these would be for me and the Lumix had been used before for personal portrait shoots and performed admirably. Plus the 12x Leica Optics and the Optical Image Stabilization in an all-in-one package make it perfect in it's portability.Boy, was I glad reached that conclusion...upon my return, I dumped my cards on my main desktop and was in awe of the RAW files (up to this point, I'd only viewed the JPGs). Since then, a few friends have asked for large prints of some of my shots from the Germany trip--and more still have requested them as desktop wallpapers. Mindful of the potential for noise, all or most photography was done at ISOs 80 and 100 with a tripod whenever possible.See, the thing that sets the Lumix FZ-30 (and FZ-50) apart from many of Panasonic's current offerings (at least for me) is that the current FZ line--while quite functional and more than adequate in it's output--no longer has the manual focus option. This is what contributed to it's feeling like a DSLR in my hands. I'm an \"Old School\" shooter (started in the early `80's, had a home darkroom in my parents' basement...the whole nine yards), so--IMHO--a camera in a photographer's hands needs to FEEL like a SLR/DSLR even when it's not. For snapshots, I'll use my cell phone.The only thing about my FZ-30 now that had slowed down it's use is time and the technological curve. The FZ-30 only uses plain 1GB/2GB SD cards (not SDHC or SDXC). With the advent of HD video being recorded on so many devices, plain SD cards of that vintage are not readily available except through online venues. So I'm on the hunt for a Lumix FZ-50, which will use SDHC cards up to 16GB, in great condition. These are exceptional cameras. If you have the opportunity to pick one up in excellent condition...DO IT!", "Date": "April 8, 2012"}, {"Title": "Excellent camera -- love the manual focus ring!", "Author": "Bron \"Bron\"", "ReviewID": "R3RXZ8DYJYMVED", "Overall": "5.0", "Content": "I ran across one of these in good condition and at a very low price and so picked it up.  It is an excellent camera.  The zoom ring and manual focus ring are superb.  Also, the quick \"AF Macro\" switch on the lens is a great feature.  I do a lot of macro shots and this camera is excellent at that.  It's also an excellent 12x zoom everyday camera.  A bit big and heavy by today's standards, but I like that, more stable.  And I use SLR's a lot, so it feels better to me.I also love the EVF, the great controls, and the rich feature set.  I have a fair number of different cameras and this is one of my current favorites.  I love picking up a classic at a bargain price!If you run across one of these, I highly recommend it.  I never even cracked the manual, just picked it up and started shooting.  Everything is pretty intuitive as far as the controls.  I prefer a view finder for composition, so I use the EVF a lot and it's decent.  I can focus manually accurately and with the diopter adjusted can use this without my glasses very well.  It also has a very strong flash unit built in and overall image quality is very good.This would be an excellent \"starter\" camera for someone getting serious about photography as it has all the manual controls, including that excellent manual focus ring, and settings.  Much better in some ways than many of the newer cameras you might consider. A great value if you find one in good shape.  Highly recommended.", "Date": "June 15, 2011"}, {"Title": "Shopped for New - Came Back to My Own!", "Author": "Bonnie J. Kirby", "ReviewID": "RVXRD00TYQM9B", "Overall": "5.0", "Content": "A Retired professional, I have had medium format and numerous pro 35mm's. This is my choice camera. I have prints on my wall up to 24x30 (and larger which I gave as gifts) from this camera. They were printed by non-pro, online order labs and they receive great unsolicited compliments. This camera has top capabilities and came with a leica 35-420 lens! It is easy to operate and the battery long-lived. I was comparing it to newer cameras since I'm used to having to upgrade frequently, and realized there is no need to spend more.  Panasonic Lumix DMC-FZ30K 8MP Digital Camera with 12x Image Stabilized Optical Zoom (Black)", "Date": "January 28, 2008"}, {"Title": "Power-packed high quality camera", "Author": "R. Barry", "ReviewID": "RER1C0QTGRR5", "Overall": "5.0", "Content": "I'm a camera dummy but I get really great pictures with this camera.  One of my friends thought I had an expensive SLR camera when he saw some of my pictures and looked really puzzled over how I got such such great pictures when I told him it was \"just\" a Panasonic, not a Nikon.I've had this camera for around a year and use it almost every day.  It's a workhorse and it's been flawless.  Be sure to get a 1 gig high speed SD memory card to go with it.  Also, get a tripod for those zoom shots.", "Date": "April 25, 2007"}, {"Title": "I love this camera", "Author": "Christopher Miller", "ReviewID": "R1B61NTI12GS8I", "Overall": "5.0", "Content": "I don't know why Panasonic dropped this line of cameras, I have greatly enjoyed using this one.  The optics on the lens are very good, you don't get the purple fringing when the lens is at maximum zoom.  That attests to the design of this lens.  It feels and operates like a light DSLR.  You have the manual zoom control, which is much faster and more precise than the typical motorized zoom controls on other point and shoot cameras.  Having a flash hot shoe allows me to get nice indoor shots with an external flash (like the Sunpak Super 383 Flash).  The remote control socket lets me take long exposures on a tripod without any camera shake.  It does support RAW format, you can the images before the camera has optimized the image for JPEG.There are some drawbacks:* They don't make this camera anymore, you can only get them used.* Anything above ISO 100 will be noisy, it's lowlight performance is awful without a flash* It predates SDHC cards, you are limited to the 2GB SD cards* No HD video support, it's VGA resolution only.", "Date": "August 5, 2010"}, {"Title": "Why go manual when auto is fine", "Author": "SpeedoNJ \"Len\"", "ReviewID": "R377VS13YLMVPM", "Overall": "5.0", "Content": "For my purposes, I do not need a digital SLR and all the work that goes i9nto one- I'll never be that good a photographer.  Really don't need all this has to offer either, but it's fun to play with and see how it can make impossible shots come out.  Earlier this summer I decided to get an upgraded point nad shoot, so I'm comparing this camera to a Nikon Coolpix P80 that I like a lot.  But in some ways this just seems to take better pictures.  The one feature I like most is the ring focus instead of the motorized zoom (don't even know if I'm using the right term for this).  The one thing I like better on the Nikon is the memory card capability- have an 8GB in that, the DMC supposedly only takes a 2GB, so I have to live with 500 pictures.  So, I'm happy taking MUCH better pictures with both and comparing them and getting to know which does what best.  Finally, I'll say once again I don't do specs, leave it on auto most of the time and take the memory cards to Shoprite for instant developing, don 'tu s e the computer, don't leave film in 35mm for a year anymore, so I now have photo albums filled with excellent pictures", "Date": "October 18, 2008"}, {"Title": "Great Camera, bad support", "Author": "R. Overall", "ReviewID": "R2MHLSMS3B7LKQ", "Overall": "4.0", "Content": "I ordered the FZ30 based on the excellence of the FZ20, which I absolutely love.  The zoom is fantastic for portraits and glamour, and the macro flower pictures are marvelous, but only 5 Mp.  I needed more Mp to go with my CS2 program, and attempt to return to semi-pro photography.  I received the camera fine, the price was very good, and though the 30 is a bit heavier than the 20, the same features endear me to it.  And not having the lens physically extend (I bought the lens protector cylinder for the 20) is a plus.  Everything went well until I went onto the Panasonic site and registered.  I looked for a spare battery (anyone who uses digital knows to get a spare!), and the battery number brought no results.  I even looked on Amazon, and no listing for the battery number in the manual.  Though the camera is excellent for advanced journeyman and even entry-level pro, not being able to find a backup battery caused me to give only 4 stars.  Oversight?  Until there's a listing for the required battery (different from the 20), or some kind of a conversion list (if they changed numbers), I can't give it 5 stars.  And the local stores only carry Panasonic batteries for the compact cameras.", "Date": "February 3, 2006"}, {"Title": "looked high and low for this camera", "Author": "Thomas C Carrington", "ReviewID": "R1L4GE1ZY70PB0", "Overall": "5.0", "Content": "had one and wore it out and couldn't find anything else that came close to this combination of performance, weight, and adaptability. The major point if the MANUAL zoom. I don't want a motorized zoom. I also value the full MANUAL capability - zoom, focus, shutter, aperture. Us old time picture snappers like this. Having a really good integrated (non-removable) lens makes it lighter and does not allow the sensor to get dirty. Wish they still made this, even in a larger imager.", "Date": "July 22, 2013"}, {"Title": "Excellent camera", "Author": "ABUJR", "ReviewID": "RZL9NWI8LSQAF", "Overall": "5.0", "Content": "Beautiful pictures, fast download to SD card, long battery life, 12x zoom brings it in close. An excellent choice for an all around camera.", "Date": "July 14, 2013"}, {"Title": "A Classic", "Author": "Michelle M. Ress \"safoocat\"", "ReviewID": "R325HYDQ34TPJL", "Overall": "4.0", "Content": "This is an excellent camera for its time. Two distinguishing features are the zoom ring and manual focus ring which are not found on many other cameras if any.I've had two of them and loved them both however they lack the sharpness of the FZ47 and FZ150. If you can live with thatand want the zoom ring go for it. Otherwise buy one of the newer models mentioned. I've had no trouble with either of mine.", "Date": "July 2, 2013"}, {"Title": "one of the best", "Author": "Mona Lisa \"book lover\"", "ReviewID": "RN8F5WV7DP089", "Overall": "5.0", "Content": "I bought this camera used but I am very satisfied for what this camera does for the money I payed. I will recommend this specific professional camera.", "Date": "September 14, 2012"}, {"Title": "Love IT!", "Author": "Mensa", "ReviewID": "RESKSSSXTOO9V", "Overall": "5.0", "Content": "I have had this camera for about a month and decided to buy it when my Nikon finally started having problems....and I LOVE IT! the pics are so clear and crisp. Great buy!", "Date": "June 18, 2012"}, {"Title": "DMC-FZ30S Lumix", "Author": "Erika H. Simons", "ReviewID": "R7PAUB9V4IKT7", "Overall": "4.0", "Content": "This is a very nice camera for taking on my bike rides.  Though it is not a pocket sized Point and shoot camera, it weight much less than my Nikon D-200.  I love the 12X optical zoom.  I was able to photograph a nest of Sandhill Cranes every day, as I biked the trail next to the nesting pond.  True to the reviews I had read about it, this camera has some noise issues at anything higher than 80 Iso.  At max optical telephoto it also produces softer photos than I would get with the Nikon, but closer range it takes tack sharp photos with great, true color rendition.  The vibration reduction is great.  I have shot some cose-ups in the shade at a 30th of a second and got sharp results.  I found the rotating LCD screen helpful with low angle and some higher angle photos.  The transfer time is a bit slow, but when you use a faster memory card, I have found it satisfactory.  I use a high speed 1 GB SD card and shoot at the raw setting with acceptable results.  I haven't tried all the possibilities with this camera, since I've only had it for a short time, but, even with it's noise shortcomings, I would recommend this camera to friends.", "Date": "April 15, 2008"}, {"Title": "it is good camera, but has many limits", "Author": "david wu \"dchen1968\"", "ReviewID": "R75GK2LXI254J", "Overall": "3.0", "Content": "this camera has good picture qulity and long optical zoom which really attracts a lot of people. however, this camera has a lot of things needed to fix.1. burst mode doesn't work with flash light. if you set up burst mode whatever speed, you have to close flash light in order to make burst mode work. in the manuel it said that it works, but actually it doesn't. I called technical support, they agreed with me. but they have not found the solution yet.2. it dosen't work well with regular external flash light. after you hoke on external flash, a lot of things you can not change. for exemple, if you use Apertue priority, you can not change F. If you change F value, external flash disable. A lot of exteranl flash want you to change F according to where is subject. otherwise eighter subject is overexposure or undr expoure. Many other camera let you change whatever you need.Pansonic is good company, but they never made camera before. they need to work on it.", "Date": "June 21, 2006"}, {"Title": "Remarkable Piece of Machinery", "Author": "Val Lee \"Val Lee (Author of 'Cliques in the C...", "ReviewID": "RO4X3TAXJULZ0", "Overall": "5.0", "Content": "I love my Lumix camera!!  I am just learning how to use it, but it is fantastic.  I am so grateful for my most marvelous husband presenting me with this Christmas bounty. He also just treated me to Kauai, Hawaii for my birthday...yes, I know-I am very blessed!!And I must tell you I acquired the most amazing shots on this tropical paradise oasis.  People just go on and on as to the quality, hues, essence, etc. I have been asked \"What kind of camera do you have!!\"  I can't even begin to tell you how people marvel and I'm still a novice in every sense of the word.I deeply appreciate Matthew Jude Brown's comprehensive review as it assists me in understanding this remarkable piece of machinery even better.", "Date": "February 9, 2006"}, {"Title": "DOESN'T PHOTOGRAPH UFO'S WELL!", "Author": "danstermeister", "ReviewID": "R33P14OLQ9Q8U7", "Overall": "1.0", "Content": "Unfortunately there have been people that have had to rely on this camera to capture images of a UFO, but when published amongst their peers, have been seen possibly as a street light. That's obviously the fault of the camera, and it's no doubt when you consider that Panasonic doesn't want you to know about UFO's in the first place (which everyone knows). Of course they'd embed technology to keep ANYONE from being able to properly photograph a UFO, especially if it's remained perfectly still for the duration of the evening that it was spotted. Panasonic can't hide their intentions forever, and when the UFO's grow in number they will eventually be photographed using other camera manufacturers, and then the gig will be UP.", "Date": "February 17, 2012"}, {"Title": "Amateure", "Author": "R. Yankura \"yanko\"", "ReviewID": "R2QA21NQAJH8M4", "Overall": "5.0", "Content": "I purchase this camera some months ago.  My feeling is, if you are a amateure at this, this camera is not for you.  There are so many setting I found myself setting things together that should not have been.  I have a Cannon 35mm and thought it would be as easy as that was. NOT!! I now have the setting on \"Automatic\" and let the camera decide what it needs. I did have occasion to contact Panasonic.  Real tough getting to speak with someone.  They did however answer my questions thru emails.  I purchase a 1 gig card and it is really nice getting 200 plus photos. Theres times I needed my external flash, but most of the time the one on the camera was fine.  Even though I am an amateur, I love the camera.", "Date": "January 9, 2007"}, {"Title": "the shape of things to come", "Author": "Graeme Eric Molyneux \"gramol\"", "ReviewID": "R14G2UN87AOBE3", "Overall": "5.0", "Content": "take any picture you like,pro or beginer just a brilliant camera to use!noise can be a problem but can be easily fixed check the menu settings.", "Date": "April 23, 2006"}, {"Title": "Simple the best!", "Author": "Joel Casamayor \"jcasam\"", "ReviewID": "R319Q0H762YY55", "Overall": "5.0", "Content": "I just need a camera with SLR functions and videoand this provide both and more.If u are not doing bussiness with pictures this is for you..I trash my video recorder already, this camera do evething I need.br>", "Date": "June 15, 2006"}, {"Title": "A reflective update.", "Author": "projectmgr", "ReviewID": "RD29TVZWF03BZ", "Overall": "2.0", "Content": "There is lot to like about this camera. The build quality is very nice and the optical capability is exceptional. In particular I really liked how it fit in my hand.  The controls are very logically placed as well.  Another thing I have noticed is that in retrospect  the use of this camera and the familiarity with it's control and options layout  gave me an advantage when moving on to an advanced DSLR system.  The many hours spent using this camera gave me a leg up in understanding the features and interface offered in a professional quality system.The camera sure was a lot of fun too!  A lot of zoom range and features packaged in a relatively discrete sized camera. It takes several thousand dollars in lenses to equal the zoom range this camera gave me.My previous review expressed the frusteration I experienced when dealing with Panasonics cutomer service and website.  Seeing as it has been many months since I would give Panasonic the benefit of the doubt and assume that some improvements to service after the sale must have been made.Overall when looking back I think that the FZ20 and FZ30 will be remembered as very significant cameras in regards to the \"digital revolution\".  At least they were for me!Good luck!Previous review.....Excellent camera in many respects!Very comfortable to hold and intuitive to use.The Leica 12x optical lense plus digital zoom allows this to be a versatile  and fun camera.Plenty of  imaging options make it possible to capture almost any situation.The color quality and sharpness are outstanding.This camera has so much going for it.But  where it fails to sustain expectations and  eventually fails to deliver as promised is  when you need information , support , accessories  and most glaringly when implementing RAW capture.Panasonic  offers accesssories for this camera  and it's predecessors that  can't be in fact be ordered and as far as I know after months of looking are nowhere to be found.After  several months of trying I have yet to be able to import and process any images taken in RAW format.Trying to get an answer or for that matter, even ask a question regarding any of these issues has to be the the most frusterating experience I've ever had as a consumer.  Attempting to contact , inquire, assert or find answers to anything other than  buying equipment  almost seems  intentionally set up to discourage the user.Still sitting here, another day of  searching for any information at all with regards to processing their RAW files really detracts from what otherwise would be my vote for top value in a digital camera.None of the well known imaging software that I have nor the software and plugin's that come with my almost four thousand dollars worth ofcutting edge computer  and related products  is able to process it so far.What the answer is I guess Panasonic isn't telling.Wish I would have known  the real capability is in reality , very close toit's predecesser the FZ20.Something to think about before you \"upgrade\"!", "Date": "November 26, 2005"}, {"Title": "Grainy Pictures-disapponting low light performance", "Author": "Kevin Baldwin \"Shutterbug\"", "ReviewID": "R3A9XHRPOR03Y1", "Overall": "1.0", "Content": "This camera is acceptable in bright daylight, but lower light situations result in grainy pictures.  It was really noticeable.  I was disppointed and returned it--other people may like the effect, though.  I am ordering the Kodak P850.  Kodak is known for its vibrant colors and it costs less.  Best of luck to all!", "Date": "October 17, 2005"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B000A7XT1A"}}