{"Reviews": [{"Title": "P-O-O-R Image Quality!!!!!!!", "Author": "R. Towner", "ReviewID": "RNCHV27PCRYVD", "Overall": "1.0", "Content": "I purchased 3 of these cameras to go with a Q-See 4-channel PCI card.  I set up all three on my office desk, under good lighting.  One camera has a decent image, one camera has a poor image, and the image from the third camera is so  washed out that it is practically useless.  The night vision feature allows you to make out shapes from very close range, but not much else.  Even on the \"decent\" camera, the color is poor.  Prior to this purchase, I was looking at some demo systems at Sam's club, and the image quality with these cameras is much, much worse than even the entry-level, bargain cameras that were being demonstrated.  I would recommend that you keep looking for a better camera, as this one has a poor picture quality.", "Date": "July 17, 2007"}, {"Title": "Solid Camera", "Author": "CrimsonOgre", "ReviewID": "R2W1UIU5LS4F5I", "Overall": "4.0", "Content": "I am running 16 of these cameras of which 12 are outside.  The picture is really good considering the cost of the cameras ($50.00-$60.00 each) and the IR functions works well.  I am running a 18 camera transformer to power them, and so far it has been great.Pros:*  Small and easy to mount*  Easy connections for non tech savy individuals (RCA)*  Solid construction*  Picture quality is good for the cost of the camera*  IR function works wellCons:*  Swivel on camera base does not hold the camera in place out of the box.  There is a small phillips head screw that needs to be tightened on the swivel shaft for it to hold in place correctly.*  The holes on the mounting base are small in diameter.  I redrilled the holes so I could use a better style screw to mount the cameras.*  The cameras flicker and flash a little bit in low light or over cast weather when it is stuck between standard running mode and IR.  They also alternate between color and black and white for the same reason in the same conditions.I have used several other cameras and for the money these have been the best.  The picture quality is comparable to the cameras I am running at my office that were much more expensive.  Great entry level camera for either a door camera or camera server setup.", "Date": "January 3, 2007"}, {"Title": "Not recommended, even at this price", "Author": "Wayne \"Omegafiler\"", "ReviewID": "R249DVZ2H0ETOL", "Overall": "2.0", "Content": "I purchased 3 of these cameras at about $50 each along with the Q-See 4 Channel PCI card. It includes a nice long 60ft of cable. The power is run through the same thin cable so you just need the AC adapter connected at the source (ie your PC or DVR). The AV cable is not BNC - it uses your typical RCA Yellow/Red/White cable for video/power/audio (mono), in that order. The resolution is also only a somewhat low 380 lines of resolution - but the price is also a somewhat low $50. :)The idea was to use them for outdoor day/night video surveillance - just to keep on eye on things. The problem is that they have an absolutely horrible picture quality. Even if you want to see what's going on, it is barely acceptable. And if you plan on recording - don't waste your time.2 of the 3 cameras were actually defective. 1 camera had a red tint out of the box. The 2nd camera would never get out of night vision mode. The last camera worked \"as designed.\" It just wasn't designed very well. I even tried using it at close range and indoors, no luck. If you have very good lighting, no glare at the camera, etc - it should work \"OK.\"The problem is that you are going to have various lighting conditions and the camera needs to adapt. Even night vision is useless. Anything beyond 4 or 5 ft and it's just a blur. Night vision is also in B&W; - which is typical of most night vision cameras.Pros:* Inexpensive* Can record audio* Nice long A/V cable* 6mm Lense for a wide viewing angleCons:* Low reliability* Poor picture quality* Limited night vision range* Can't really be used for surveillance or monitoring.While this is a cheap day/night camera, if it doesn't work as advertised, I simply cannot recommend it. Perhaps if you could find it really cheap and use it in a well lit indoor area, it might be worth considering. My suggestion is to simply step up to the higher-end q-see camera that DOES work - it just costs twice as much. :)", "Date": "July 18, 2007"}, {"Title": "Q-see cameras and customer service are terrible.", "Author": "Jack R. Mccollum", "ReviewID": "R3SSBMF2AGCRQP", "Overall": "1.0", "Content": "I just purchased this Q-See nightvision camera as a replacement for a Swann unit that stopped working. I thought I'd try the competition and see how they work. Right out of the box it had a red tint over half of the screen. I thought I could live with that as long as the image was fairly clear but by dusk I noticed something wrong. I could barely see anything compared to my other three Swann cameras that still had a bright, clear image. By nightfall I only had a black screen. I sent my daughter outside to shine a flashlight at the camera to make sure it was still working and sure enough, I could see a small white dot and nothing else. I tried calling Q-See's customer service and their automated customer service disconnected me after three fifteen minute waits. I finally got a human through the switchboard and was told they would put me right through to returns. Then I got a voicemail. I'll just return this camera to the trash can where it belongs and get another Swann.", "Date": "March 6, 2008"}, {"Title": "Works well for the money, but is mostly Black and White", "Author": "Alexander Komarov", "ReviewID": "RR9IUXY4VCCDA", "Overall": "4.0", "Content": "I own 2 of these and use them with a cheap 4 channel PCI capture card on a linux server running 'motion' (software).  Cameras are mounted outside and oversee the front/rear of the house.  I do not consider this system \"security\" but rather a planning aid - I know when my packages get delivered, for instance, or whether to get up to answer the door.Pros: - Solid construction, I didn't even have to tighten anything. - Image is fairly clear in most lighting conditions - Doesn't stand out too much. - Has not exploded, complained or required constant attention. - IR illumination is adequate to make out shapes from 20 feet.Cons: - Automatic Color to Black And White switchover occurs in fairly brightconditions - they are almost never in color mode for me - even on sunny days!  Either that or colors just aren't very bright. - Red glow from the IR LED's - visible when looking directly at the camera at night from about 20 feet away.  I can live with it, but someone may care if they are trying to be subtle. - Extension cable, which is very helpful, is very, very weak.  This is not a con, more of a warning - if pulling it through the attic, be gentle : I ripped off the (unused) audio connector and shorted power in one of them while snaking it.- The screw holes are indeed small, but most regular drywall screws fit or fit with a bit of encouragement.- There is an unused RCA audio connector (RED) on the camera and the cable, adding bulk to wires that need to be hidden.  In retrospect I used that to run power (with some creative soldering) when I destroyed the power wire, so it was helpful.", "Date": "June 19, 2007"}, {"Title": "Not worth the money!", "Author": "Rileys right \"Riley\"", "ReviewID": "R3RNZDOGAT0A15", "Overall": "1.0", "Content": "Purchased the 8 camera set.  By the time I purchased the \"to code\" cable (the 50ft is not class2 and can not be in attic or walls) after installation I'm out $2,000.  The pictures on the dvr are mediocre, very grainy, the camera set up doesn't work as easy as other units and if you think you can get online or telephonic support Lot's of luck!On hold over 30minutes, went online and was told \"currently offline\".  Sent email and got response, call customer service.  Just return it, sure remove 2nd story camera's and eat the installation and new cable cost.................Not a happy consumer!", "Date": "June 24, 2010"}, {"Title": "Awesome inexpensive cctv solution", "Author": "Scott Kessler \"Sussco\"", "ReviewID": "ROKM0WH4W6N3S", "Overall": "5.0", "Content": "As you can see from my photos i uploaded I need not write alot, i only would like to say; If you get a defect then call Q-See they will send out a call tag and send a new product right back. dont knock a good product if you dont contact tech support! See photos here  http://www.amazon.com/gp/customer-media/product-gallery/B000B85AGU/ref=cm_ciu_pdp_images_all", "Date": "October 20, 2009"}, {"Title": "q see  weather proof  cameras", "Author": "megabesomeone", "ReviewID": "RLS7Z8VPJA0EV", "Overall": "4.0", "Content": "there nice havent got to put them up had another q see cam and it worked great .I'm sure i will be happy with these the other one got banged by something it doesnt work any more my fault for mounting it on garage roof", "Date": "June 26, 2013"}, {"Title": "Camera blacks out a lot", "Author": "inka", "ReviewID": "RACSLTB14UV2P", "Overall": "3.0", "Content": "This camera is cheap but it has a good picture quality if you can keep it from going to video loss. It does this quite easily and can be fixed by cupping your hand over the lens but that is a hassle in the middle of the night.I'll be returning the two I bought. Also the packaging is a nightmare. You need 2 small men and a boy to get if out of the package. Why, when it come to my house?Q-See QSOCWC Weatherproof CMOS Camera w/Night Vision (Color)", "Date": "March 25, 2011"}, {"Title": "Awesome camera, night vision better than expected.", "Author": "K. Rodriguez", "ReviewID": "RDGJFOEVBN303", "Overall": "5.0", "Content": "I got this camera to help observe a blind spot in my backyard, particularly for when the nephews come over. Not only does it have a pretty good image but also has audio! And I hadn't planned on using the night vision but I'm capable of seeing the entire area in nearly pitch black. I'm very satisfied with the quality and features of this camera and it's very accessible price. Highly recommend.", "Date": "May 18, 2009"}, {"Title": "Good little camera for the money", "Author": "R. Farish", "ReviewID": "R1SZ6MVJCKIKKP", "Overall": "4.0", "Content": "I installed this outside, to monitor my front door.  Works great so far.  Not really using it for long-range video, just about 12 feet or so.  The night vision works pretty well at that distance.  During the day I get a nice color image with a fast frame rate.  The long cable was nice too.  Don't really use the microphone, so I can't comment on the quality of the mic, but it definately works.  I think this is probably about as good as you're gonna get for color, outdoor camera with night vision and sound for under $50 w/shipping included.  If you don't need the microphone, I would say go with the SVAT CV65SVAT CV65 Outdoor Nightvision Security Camera (Color). I have one of these too, the field of view is just a little bit narrower, but I think the picture is better.", "Date": "February 22, 2008"}, {"Title": "happy", "Author": "M. Castelo", "ReviewID": "R1G0WO6C3NNI3R", "Overall": "5.0", "Content": "I have resived my camera and it is really small then you see in the picture and it is pertty heavy but good video\\picture. the night vision is awesome you can see in complete darkness. the packaging was good.. very happy with this product", "Date": "November 12, 2008"}], "ProductInfo": {"Price": "$69.99", "Features": "380 TV Lines Resolution, 6mm Lens\n11 IR LEDs for Night Vision\nBuilt-in Microphone for Audio\n60 ft. Cable & Power Adapter Included", "Name": "Q-See QSOCWC Weatherproof CMOS Camera w/Night Vision (Color)", "ImgURL": "http://ecx.images-amazon.com/images/I/41iF8%2BxDouL._SX300_.jpg", "ProductID": "B000B85AGU"}}