{"Reviews": [{"Title": "Not bad for the price but a little more money will get you more.", "Author": "Terry Chance", "ReviewID": "R3VM86I6N1HVXQ", "Overall": "3.0", "Content": "I have both the Wildview and the Wildview II. Both have functioned flawlessly.The Wildview is okay for the price that I paid. I have tried different brands of 35mm game/trail cameras with almost no success. They either did not wind correctly or did not rewind as indicated, thereby exposing the film. Then you toss in the cost of film and development just to see a what kind or how many deer are in an area, it gets very expensive. With the digital Wildview I have never had a problem with battery life or function of the camera. I can take hundreds of digital pictures for a couple of dollars in batteries. I would spend hundreds of dollars for the same amount of pictures on a 35mm game cam that may or may not even come out.There are two main problems with the Wildview. First is the resolution. It does not take the best pictures in the world but I use it for a deer cam and it fills the need. I can easily see how big the deer are and count points on a buck. I do not take the pictures to keep and only to scout. For that purpose, the Wildview is okay. If that is what you are looking for it is worth the small price. If you are looking for a high quality camera to have some really nice wild shots of game, don't even bother with this one as you will be very disappointed.The second problem is that it does not have the date and time stamp on it. The Wildview II that I bought later does and also has a much nicer picture quality. As I stated earlier, I deer hunt and the time of day and phase of the moon are important to me. Without the time and date, I have no way of judging when the game is moving in my area.The bottom line:If you just want to see what is coming across a trail or lurking near a feeder with no intent of keeping the pictures, this camera will do for a very small price. I have left mine out for a month with a 256MB SD card and had literally hundreds of pics on it. If you want a high quality game cam or the time and date stamp on it, by all means look elsewhere.", "Date": "August 14, 2006"}, {"Title": "ok, but the next version is better", "Author": "Laura Wilson", "ReviewID": "R1KNIT8B3TPODI", "Overall": "2.0", "Content": "it gets the job done, but 0.3MP isn't good picture quality. The biggest gripe I have is that there is no time/date stamp.", "Date": "July 26, 2007"}, {"Title": "Works very well - would buy again", "Author": "Thomas \"Personalized Signature\"", "ReviewID": "R1X58DTY7A5LU0", "Overall": "4.0", "Content": "I set this camera in our back field near a game trail, and after two days had nothing. So I set out some deer corn as well. 81 photos of deer. I have had the camera three weeks now, since Christmas and have gotten pictures of deer, raccoon and fox. The motion sensor was sensitive enough to be set off by a blue jay. It is a great camera.However, it is not exactly plug and play. There is no viewhole to know what the camera will take, so you should set it up and do a couple of test shots to make sure it is centered right. You don't want to get three days of pictures only to find you had it aimed too low and all you have is deer feet. It has acted oddly when you can ge to a new card and last night (it was 20 degrees out) it got stuck in test mode until I reset it three times. Finally, the photos are .3 megapixel. In today's world that is hard to adjust to. The good news is you will definitely see a deer or raccoon, but you won't get anything like the detail you'd get with your 5 megapixel pocket camera.Focus is fixed, another reason test shots are good. The batteries lasted for several days. This camera is supposed to be used by parks and things to see what uses their trails, or by consumers to see what is raiding their garbage cans, not to win photo awards. Oh, and there is no time stamp which is a shame - you can't use it to see what time your daughter actually drove back from that party. Or to know what time the raccoon knocked over your trash. For these caveats I only give it 4 stars, but I love it and it certainly does everything it is supposed to do.", "Date": "January 11, 2007"}, {"Title": "Not a very good deal", "Author": "Daniel Sprague \"pawfus\"", "ReviewID": "R2KK62132JPAKN", "Overall": "1.0", "Content": "I bought a TGL-1 and TGL-2M on a friends advice.  I can live with the camera being slow when taking pictures.  But having to replace the batteries every 2 weeks after taking at the most 100 pictures on each camera got old very fast.  They are both sitting in the closet.  I'm not interested in spending another $60 to see if their 12 volt battery works any better..", "Date": "October 31, 2007"}, {"Title": "it is not worth buying.", "Author": "tommyboy", "ReviewID": "R1V4G87DOIW4HV", "Overall": "1.0", "Content": "used it last year hunting in tn. for one week. brought it out this year and lcd would not light up; the flash would not work either. replaced batteries and called the company, they advised a hard reboot; did that no help. company says they would sell me a referb. or a new one. felt like i got a hard boot.", "Date": "November 12, 2013"}, {"Title": "Junk", "Author": "Robert Gass \"rob123456\"", "ReviewID": "R2C2KV392YHNJG", "Overall": "1.0", "Content": "I received model MC2-GV as a gift. It broke after one roll of film. Company will not honor warranty because it was a gift and I have no receipt. Stay away.", "Date": "July 24, 2006"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B000AA496Q"}}