{"Reviews": [{"Title": "Improvements over SD500 - read on:", "Author": "T. Tom", "ReviewID": "R22PW5T4OXELJ7", "Overall": "5.0", "Content": "I like this little digital camera. It does everything a point and shoot digital camera should do and more. For me, a point and shoot camera should be small and light so that it can conveniently go with me everywhere. That's the power of any point and shoot camera actually. It goes with you in your daily life and subsequently you get shots that you could not get with other larger cameras either because it would be too conspicous, or too inconvenient to carry with you. This is the snapshot ethic. I'm a professional photographer and I carry this little pocket camera with me everywhere because I can't carry my pro SLR with me all the time and not have it feel like a burden on my shoulder.You might be tempted to instead buy the cheaper and slightly older Canon SD500 since it has the same megapixel rating and looks very similar. There are however some pretty good improvements in the SD550:-a larger LCD screen (very nice)-better movie mode (SD500 put an annoying hissing/whining sound into the movie)-better battery lid latch design-better internal software (the display actually displays words and symbols such as \"continuous mode\" \"single shot\" \"Macro\" and not just the symbols alone.A NOTE ABOUT CASE COLOR:The SD550 comes in both Silver (called Grey on the box) or Champagne Gold. You will need to inquire with the vendor what color they stock or if you have a choice. Some of the vendors may be a bit useless in this respect so watch out-you may end up receiving a case color that you did not want. In my opinion, the Champagne Gold color is very ugly. Silver is much more attractive, even if you have to go to a local store to buy it.This camera is easy and fun to use and I can even shoot a long movie (up to 20 something minutes at the lower resolution with a 1GB card). Some cameras (Casio) only let you shoot a short 8 second movie. The movie mode is quite usable with quality video and audio.Another cool feature is that the automatic orientation sensor works when you are reviewing images. Try reviewing images and rotating the camera around-the image will always stay right side up on the LCD screen!To conclude, I am happy with this camera because it does everything a small point and shoot digital camera should do, yet it is quite small, light, feels sturdy (metal case) and has very pleasant ergonomics both with regard to the layout of the controls as well as to the on screen menu functions. Color, sharpness and resolution are all impressive for a camera this size.", "Date": "September 15, 2005"}, {"Title": "Best ultra-compact I've seen yet.", "Author": "Just Say Yo", "ReviewID": "R36YDN91VFGBT0", "Overall": "5.0", "Content": "I have owned several digital cameras over the past 3 years. Canon is a brand that never disappoints. This camera is no exception. I have a Canon 20D digital SLR I use with an external flash. I use it almost everyday. Stunning quality, but those of you who have kids know that this is a quite a monster to carry around on a day-to-day basis.I needed something that I could pop into a bag and go without feeling like I was sacrificing quallity. The SD550 is the solution.The Digic II processor enables fast focusing and thereby reduces \"shutter lag.\" Fewer lost moments.Easy menu/function navagation.The flash is amazingly adequate despite it's smallish appearance. Adequate illumination up to 15'.Great in-cam screen. Largest in its class (2.5\").Many custom settings for the novice to the the pro.Movie mode is awesome for a camera of this size.Cons are:You will need to spend an additional 60-90 bucks to get a practical memory card. They supply a 32MB card that is good for about a dozen hi-res pics (or fewer).Still no case included. Coach makes a nice one for about 30 bucks.Conclusion:I know I am an early adopter but I am sure this camera will be a best seller. I hope your results are comparable.", "Date": "September 17, 2005"}, {"Title": "I like them small - and pocketable", "Author": "Manish Laxmikant", "ReviewID": "R2LH2J04BOGTNN", "Overall": "5.0", "Content": "Update: I'm not as hot about the durability of this product. Canon service has been nice enough to fix this every time I send it in, but it's been to the shop THREE times during its one year warranty, and has stopped working again. I might have been unfortunate enough to get something with an irreparable defect. I like it WHEN it works, but otherwise I am now a bit afraid to go for these. The S400 I had before this was way more reliable than this frequent flyer to the service center. I'd shoot out a couple of stars if I could, but I can't when updating a review.I love the results that a digital SLR produces, especially in low light. Make no mistake, a digital SLR is way better at 400 ASA than any of these point-and-shoots.BUT how often do you see a photo opportunity, and have your digital SLR ready to capture it? By the time you pull that one out of the carry case, this camera is done with the shot, the moment has passed, the SLR is only now ready, and victory belongs to the one who actually got to take a picture.Points to note:- Size. This fits into my front left pocket with my wallet. I can draw the camera and shoot within seconds at any time. And it's solidly built, even the screen remains clear and scratch free. I wouldn't stick it with coins and keys though.- Fast power up. This camera is ready by the time I'm pointing. I used to hit the power button on my S400 as it came out of my pocket, but this one powers up almost instantaneously so you need no such tricks.- USB 2.0 - with a 2GB card that I don't like to erase often, this is very important.- Gravity-flip. If you have a portrait shot to view, rotate the camera 90 degrees and the picture uses the full screen. To get the right side up, the older generation of cameras would play back portraits in a wide screen, wasting a lot of screen space.- Perfectly placed controls. Don't be fooled by touch-screen controls like the Sony 3\" screen camera has. Sony designs its product controls like people have nothing better to look at than the camera itself. Canon allows you to feel what you need when taking the shot and places nice solid buttons in the right places. Even for my huge clumsy fingers.- I like the 2.5\" screen for playing back photos, particularly for older people who otherwise would need reading glasses. I also use the camera as a digital photo wallet, 2GB SD card gives you plenty of room.- 640x480 video capture is nice. Again, you may not have a camcorder ready in your pocket but this camera will fit nicely. Not for production movies, but hey when you want to capture a spontaneous moment...- Fast ASA switching in Manual mode. I can live with some noise at 400 ASA when the moment is important. I usually like 200 ASA indoors, the quality is reasonable. Sometimes I want to use the 50 ASA high-quality capture, and I don't have to dig deep into the menus to set this. It's one-touch- I hate using the flash, so for me it's important to see the right details (shutter speed, ASA, flash status) Canon has the display planned very intuitively.- I used to be a Nikon fan until the digital elphs came along. Canon has winners here, and I like the SD 550 best of all.- Convenient battery size and life - about a day's worth of good usage, or days of casual usage. I got the Lenmar equivalent as a spare battery, and I'm never out of power. The charger is very quick and I usually have a fully charged battery at all times, often a charged spare as well. Note that Canon increased its battery capacity because the Lenmar offered more mAh when the S400 was in fashion. Battery beats having to deal with AA or AAA cells.- Compatibility. This works perfectly with iPhoto, and I like that. I have never used their built-in software.Do make sure you get the biggest SD capacity you can afford. Trust me.", "Date": "December 26, 2005"}, {"Title": "Terrific Little Camera", "Author": "SplitEdit", "ReviewID": "RP53GLO0JMTFG", "Overall": "5.0", "Content": "I bought one of these for my girlfriend. It is her first digital camera, our second. I have a Nikon Coolpix 5000. I've been taking pictures for 30 years.The 550 is a great little camera, as long as you're willing to trade size and speed and convenience for some important information that any professional photographer would find essential.Impressions:Fun to use, easy to control, very quick. Mostly reasonable exposure accuracy. Decent flash performance. Lots of redeye (so far we've been successful fixing redeye in iPhoto).I didn't think the big screen would be as important as it is, but I found photography with it to be very 'immediate' -- you feel more wired in.We've made some videos. They look great and sound decent. (The SD500 has a problem with buzzing and hissing in sound. I know because I intially bought the 500 and returned it for the 550).The camera is very easy to use in the manual mode. You can leave a group of settings programmed into 'manual' and then turn the knob and go to full auto, and then go back to the same group of settings again. We found the menu system to be quicker and a bit more intuitive than the menu system on the Nikon Coolpix 7900, which we also looked at. (Other advantages for the Canon -- USB 2, bigger screen. But I have two friends have the 7900 and it seems to render color very artfully. Hard to describe but easy to see.)One problem is that you never see a display of shutter speed and aperture. That's just silly. Another is that you can only see a histogram in playback.The camera is super-fast. In all three major ways: to turn on, to focus and to store an image. For the first time with a digital camera, I feel that I'm not missing shots because the camera isn't ready. Combined with the big screen and the small size, this creates a 'come play with me' quality that is really appealing.The metal surface of the camera is very slick and feels sophisticated, like a piece of jewelry. Maybe for that reason is seems feminine to us. Unfortunately the sexy surface is very slippery, and combined with the shape of the camera, it makes you always worry that you might drop it.Bottom Line -- terrific camera that you can throw in a coat pocket. Just don't drop it. Guys might also want to consider the Nikon Coolpix 7900.", "Date": "November 8, 2005"}, {"Title": "Incredible compact digital camera!", "Author": "Beemer903", "ReviewID": "R3UYI8CPHKZIPW", "Overall": "5.0", "Content": "After having owned five Nikon Coolpix cameras in a row (the latest being the Coolpix 7900), I got tired of the Nikon's inability to shoot in low-light conditions, and their incredible lag times in autofocusing and start-up. So I did my research and found very favorable reviews for the Canon SD series, especially in low-light situations. I have two infant daughters, and I've lost many a good photo to blur from poor autofocus with the Nikons. Not any more! The SD550 is an incredible camera. The pictures are razor sharp, the camera is extremely ergonomic, battery life appears impressive, uses industry standard SD memory, and comes with a compact battery charger (not the silly bricks like the Nikon Coolpix chargers). Most of all, it will almost always find focus very quickly in situations that choke the Coolpix. I did a side by side comparison in two situations: a kitchen with 320 watts of light bulbs on, and a living room with a single 60 watt bulb. The Coolpix could NOT find focus in either situation, no matter what I did. It's AF assist light is just too tepid. The SD550, however, locked focus instantly. It also has a very generous LCD size that puts other compacts to shame. My wife also has a Coolpix which she was using for supplemental photography at events, but it really sucked -- almost all her shots were blurry due to poor focus. I am getting rid of her Coolpix and getting her one of these! One last thing: the SD550 has some good scene modes, including one called Pets & Kids. With little ones running around, it's a great preset mode with instant focus and exposure lock, so you don't miss those moments. I only wish I had invested in Canon years ago.Update: I ditched my wife's Coolpix and got her the SD550. Now we own two of them. How's that for a recommendation!", "Date": "December 17, 2005"}, {"Title": "I <3 My Camera", "Author": "HotFuss", "ReviewID": "R29YQQL0YQTKBZ", "Overall": "5.0", "Content": "I ordered the Canon SD550 right before my vacation and I am sooo happy with my purchase! It is my first digital camera, and although I am your avg point and shoot tourist, I wanted the option of being able to take nice pics using special features.At first I tried looking for a silver-colored camera, which you can get on other sites, but learned that these cameras are manufactured overseas and are intended for international sale only. Therefore, the silver ones are not covered under the Canon USA warranty. So I ordered mine from Amazon and yes, its Champagne color, but its nicer than I expected. In fact, you probably won't even notice the color after you realize what a great camera it is so who cares.The 2.5 LCD screen is great! My friend has the SD100, and the LCD looks puny by comparison. Plus the SD100 and SD550 are practically the same size. I love the fact that the LCD is huge. Definitely get an LCD protector, you can order one for $8 (incl. S/H) from Da Protector website. With the protector, I am not worried at all about damage to the LCD screen. Its pretty solid and scratch-resistant (however, not dust-resistant, so when you're putting the protector on, try to do so in a relatively dust-free environment, otherwise there will be some dust in btwn the protector and the screen).I also ordered the Accessory 2 Kit package from Amazon, which comes with a case and an extra battery (good price, b/c the price of just an extra battery alone is the same, so you might as well go for the case too). You will probably need the extra battery if you are going overseas and don't have an adapter. The battery that the camera comes with is said to last over 100 pics at high resolution. While on vacation (for a week), I charged the battery only once (just in case, but it never reached low), and I probably didn't need to at all. My friend's SD100 battery had to be recharged daily. I was able to take about 160 pics on 1GB memory card (mostly all on the highest resolution, however, probably could've taken more if I didn't take some video clips--about 5). The video feature is great. Not sure how long you can record but one of my clips was over 2 minutes and replaying them on the LCD screen was almost like having a mini TV with me. The sound quality is decent too, but its really a digital camera, not a video camera, so don't expect much.I love the features, it took me about a day to get used to them though. The My Colors features allows you to emphasize certain colors, which I liked, especially for scenic pics. The Macro features lets you take great pictures of anything close up. The Night Feature helpd a lot for sunrises and sunsets. The Stitch Feature (for panaromic use) is kinda difficult to use, you will have to match your pics up on the software and I am lazy and didn't use it. There are a ton of other features, but as long as you play around with it a bit, you'll figure it out.The flap for the USB connector seems kinda weak, I was afraid it would break, but perhaps it was designed this way to appear flimsy but its not? You also need to take out the battery to charge, but honestly, its not really a big deal.So, was my money worth spent? I believe so, considering I am hoping this camera will last me the next 5 years.I know people like lists so here's mine:PROS:-Large LCD screen. Once you see it, you can't get anything less.-Easy to use features (after you get used to it)-Can take over 300 pics on 1GB at highest resolution with NO VIDEO CLIPS. I think when I first set my camera up with nothing taken yet, it was at 323 available pics. So just think how many pics you can take at just medium quality, which is just as good!-If you take a picture of something on portrait view (as opposed to the usual landscape view), it will rotate itself to also show portrait view on the camera.-Battery is strong. Its been 4 days since I charged my camera and still haven't seen low battery message yet. And I've used it to take pics, and to view playbacks many, many times.-Takes gorgeous pics! Everyone said I didn't need anything over 5 pix but I love how sharp my pics came out.-Camera starts up very quickly-You can take continuous pics by setting it to this mode and just keeping your finger on the button (maybe a half sec delay in btwn shots?)-Although it was hard for me to switch from a regular camera to digital, I am soooo happy i did because I can preview the pics and delete the ones that I don't really like, rather than waste a lot of film.CONS:-Definitely need to buy LCD protector and a larger memory card-Battery needs to be taken out to charge, but I don't really find it a problem, some others may-The case does scratch easily, although most of the time I had it in the case, there are a few faint marks on the front-USB cover seems weak, but haven't had any problems so far-When you zoom in on video, it looks grainy. I think it may be because the pixels on the LCD are not enough? I think the SD550 and SD500 have the same amount of pixels, but the SD 550 just has a bigger size screen.-For some reason, I was unable to transfer 1 video clip to my computer. I am not sure why. this is the one that was over 2 minutes.", "Date": "October 10, 2005"}, {"Title": "This camera is amazing, very high tech", "Author": "Mazongem", "ReviewID": "R2XLLE7NJOF64G", "Overall": "5.0", "Content": "The camera is great!  It's a pleasure to use because of its high-tech features.Let's start out with the positives.  The screen is amazing, it is huge!  The quality on the pictures is amazing.  It has a nice dark metal color and after you take a picture and go back to it, the picture rotates to the side that you're looking at it from.  It is the coolest feature!  The icon of the setting that you switch to pops up big quickly, and right away becomes small and moves away to the left of the screen so it's not in the way of your view when you're taking a picture.  The shutter speed is extremely fast and so is the camera.Another great thing about this camera is that you can zoom in while recording in a video mode, just as you would do with an actual video camera.  Also, when you're zooming in all the way, beyond it's capability, the picture still comes out crystal clear.  The 7.4 gross-pixels really help out in this case.THE NEGATIVESSince the screen is huge, your fingers tend to be on the screen from time to time.  The camera is slippery, it is easy to drop.  It doesn't have a date imprint option and the slot for the USB cable is very fragile.Hope this was useful, this camera is worth buying.  I suggest you purchase it with a 1GB memory card.", "Date": "September 14, 2005"}, {"Title": "One more imporvement as well", "Author": "Jamshed J. Khan \"Jimmy Khan\"", "ReviewID": "RCFFAPSCNP9UD", "Overall": "5.0", "Content": "I purchased the SD200 for my father almost a year ago and wanted to upgrade him for his birthday 2 weeks ago.  So that is where my comparison is coming from.Mediahound below me really nailed it on the head the SD550 really is a great little camera, but one small thing I think is VERY VERY important to add is that not only is the LCD screen bigger its TOUGHER.  The number 1 complaint about the SD200 SD300 SD400 and SD500 were the breaking screens.I have 4 friends who own the SD line and 1 of them has cracked the LCD and numerous people on dpreview and other forums have as well.  That has actually been the number one complaint I have seen is folks are scared to buy it because it is so fragile.I stumbled on this upgrade when I was using the viewfinder and my rather large nose pushed against the LCD and from the corner of my eye I noticed the colors didnt change and no dimpling.  Then further I used my thumb and applied similiar pressure to both and the SD550 was rock solid unlike the sd200 which showed massive dimpling and lcd reaction.Cheers and enjoy folks!", "Date": "November 7, 2005"}, {"Title": "Exquisite litte gem", "Author": "JanSobieski", "ReviewID": "R3I2JAVKK3QL53", "Overall": "5.0", "Content": "I own a 20D which I absolutely love and was looking for a good digital point and shoot to replace my current S400. My two major candidates were the SD550 and the S70.If you follow the photography boards at all you realize that this is a fairly common dilemma - the SD550 vs the S70. The S70 offers excellent manual controls while the SD550 is significantly smaller with very limited manual controls other than exposure compensation.I just LOVE the look and feel of the SD550 though if anything it could be argued that it is TOO small. If you feel it is and you are looking for a carry everywhere camera it is well worth the effort to get used to the small size because the camera takes wonderful pictures.The SD550 is simply beautiful. I didn't think I'd like the \"curve\" from the pictures, but it does not detract, and in fact actually contributes to the elegance of this form factor. I can live without all the manual controls since I own the 20D and since this camera is primarily for my wife and for me when I don't want to lug the SLR around.The sensor size of the SD500 is the same as that of the S70 (in fact it is the same Sony 7.1 MP sensor) - 1/1.8\". This is an ideal size for a point and shoot IMO. The 1/2.5\" sensor used in the smaller Canon series cameras represents a poor image quality trade off. Stick with the larger sensor which give less noise, chromatic aberration, and better image quality.I purchased the leather Elph case which protects the camera well and only adds insubstantially to the bulk. Some have complained that prior iterations of this camera scratch easily. I've owned them and found that if you keep the camera in a case and exercise modest caution that the camera will remain pristine.Several have pointed out that since this camera is so small it will always be with you whereas the S70 would be less likely to be carried along because of its increased size. I couldn't agree more! The camera is SUBSTANTIALLY smaller than its bigger brother the S70 and in fact is discernibly smaller than my previous S400 which I gave to my daughter. The form and size factors are what finally won me over.The additional 3 MP over my previous S400 was an additional factor in deciding to switch. That extra 3MP gives me plenty of extra MPs for cropping with impunity. This camera is a significant improvement over the previous S400 in image quality, resolution, mega pixels, color rendition, color saturation, and purple fringing.The good news about the extra 3MPs is that they are added WITHOUT adding extra noise. I don't know exactly how Canon accomplished this but this is somewhat akin to getting something for nothing! No significant trade-off was involved. The DIGIC II processor is fantastic in producing great photographs.The LCD screen in the back of the camera is huge thought its resolution is less than ideal.  It is a very nice addition to the camera particularly compared with the SD500 which has a much smaller screen.  One criticism of the camera. Low light focusing is less than ideal. You need to work with the camera to understand its limitations indoors.I am a huge fan of the Canon cameras and I would advise anyone looking for a camera, whether a point and shoot or a DSLR to carefully consider the Canon line since, in my opinion, Canon currently represents the state of the art.  I like the Sony too, but the Canon with its superb form factor won me over.  You will love this camera, but don't forget to buy a case to protect it from scratches and inadvertent drops.", "Date": "March 30, 2006"}, {"Title": "Great, especially for a Camera that fits in your pocket.", "Author": "jerryk \"Jerry\"", "ReviewID": "R2WMVDD4710IOE", "Overall": "5.0", "Content": "I'm an advanced hobbist and my main camera is the Digital Rebel XT.  While the Rebel produces excellent images, it's big, bulky, heavy and not always easy to take with you.I wanted something that would fit in my pocket and that I couldalso take running and hiking.  I wanted the camera to be high quality, because that's what I'm used to with the Rebel XT.I decided on the 550 for two reasons.  7+MP and the 2.5\" LCD screen.The camera arrived yesterday. In the evening I immediately plugged in the battery and set off for a run.  Got some nice sunset pictures, which I usually never get while running, because my Rebel XT is too heavy to carry.For a point and shoot camera, the SD550 is great.  It's small enough to fit in your pocket, yet produces high quality images.I honestly cannot tell the difference between the images off the SD550 and the Rebel XT.To be fair, you do lose some ability to compose the picture.  There is no manual focus, exposure setting is out of your control(at least I think).  But if you are looking for a small high quality camera, that's easy to use, this is a good one.I don't know how easily the LCD scratches, but I immediately put a protective cover on it.I doubt you'll be disappointed with this camera.  I saved $50 off the Best Buy price, by ordering off of Amazon.", "Date": "September 27, 2005"}, {"Title": "Excellent Choice of Camera", "Author": "R. Paradkar \"deal grabber\"", "ReviewID": "R3VJD1IC7RYAYS", "Overall": "5.0", "Content": "I got this one for 350+ after all the rebates and promotions. After carefully looking at all others in the same range, I had shortlisted it down to 2. The Casio Exilim z750 and this one. I was also considering the SD500 or the SD450 but they had either a smaller LCD or no viewfinder. The 550 won over the Exilim for the one reason that you have to carry around the cradle for the Exilim everywhere and for this one you dont. Now below are the Pros and Cons of the SD550:Pros:- Excellent output for the VIDEO & Pictures (REALLY Great pictures in all lightings.)- Powerful flash- Scene modes are very useful/handy- Menus are quite intutive and easy to use with one hand- Extremely good design, size and shape- Big bright screen- Has a Viewfinder (Very handy when low on battery or when precision is required)- Fast shutterspeed- Power Consumption is also low so battery lasts long.- Direct A/V outputs to connect to TV/VCR/DVD-recorder- Excellent design/Very small and sleek.- Very big LCD with excellent display.Cons:- Cannot be charged directly. The battry needs to be removed!! (big disadvantage).- No USB streaming to use it as a web-cam- Software not that great- Date stamp only on postcard size pix (Another BIG Disadvantage. I can't believe Cannon does not provide this simple basic function).- For some scene shots like 'fireworks', camera has to be extremely still, else image is blurred- Cant' be sure if you'll get Gold or Silver color thr Amazon (I wanted silver and got GOLD)- No internal memory but comes with a 32mb card free (which is basically useless)- 7 megapixel is an overkill, but you can always adjust the resolution for regular pictures and save the high resolution capabilities for important occasions where you might need a bigger print.- Sound quality not great for Video recordings and especially playback on the camera (But then again its not a camcorder). Also it records only 1 minute videos max.It is a bit pricey, but still its the best thing around in that size.", "Date": "March 28, 2006"}, {"Title": "Really nice little camera", "Author": "Joe", "ReviewID": "R19SEND9OM22I", "Overall": "5.0", "Content": "I had an Olympus C750UZ (10x zoom) and was looking to get something smaller that took better quality movies and had a better (simpler) menu system - the Olympus can be very complex and caused me to record the first movies after my daughters birth with no sound - argh. After much research I found that you can not find a PERFECT camera but the Canon SD550 was about as close as you could get. I've had non-digital Canon cameras in the past so I trusted the name. After a few weeks of getting to know the camera I can say that I am overall extremely pleased with it. The menus are simple yet the features are complete. You don't have to press a million buttons to get something to work or figure out which mode you are in before you set something you thought you remembered seeing somewhere in there...just a nice simple layout. Getting into macro mode is very simple and even better it focuses right on and works really well. Switching between photo and movie mode is easy enough and the movies are of such better quality than my Oly. The sound is also great when recording movies...I could easily hear the conversation being had when I was filming a family outing at a park from 50+ feet away - gotta remember to remove them from my will. The only thing I do not like about the camera is that it tends to make redeye appear more often than other cameras I have used. Even with the redeye reduction setting on I just can't shake it. This may be user error and I hope to figure that out soon but even so the redeye is easy enough to fix in iPhoto so it doesn't concern me so much. One really cool feature is how the screen tilts the picture automatically for you when you rotate the camera for landscape vs portrait shot - very cool. Overall, Canon did a really great job on this camera...and it is so small yet feels solidly built and has enough weight to it to do the job. Get a second battery so you can swap when needed - I bought the Lenmar Canon equivalent and so far so good. I am very pleased with my purchase.", "Date": "January 17, 2006"}, {"Title": "Great Camera, Great Battery Life", "Author": "E. Raskob", "ReviewID": "R33UGK8QOAAC0F", "Overall": "5.0", "Content": "I bought this camera a few months ago and love it.  I am not a pro photographer, but a pro video editor and digital media consultant, so I know poor quality digital images when I see them.  The battery life lasts me for weeks, not days, even using the large LCD to show pictures to friends.  While the shooting and resolution are both great, compared to what's out there now, it's not a pro-quality camera, but rather a \"lifestyle\" camera that's small enought to carry with you and take shots you would not normally have taken.  I used to take more shots with my phone, now I carry this little fella around and don't have to say \"man, I wish I had a picture of that...\" anymore.The design is what sets this apart - little things like image transition effects when scrolling though pictures, to a very nice interface for changeing settings and controls.  Also, the feature that blows everyone away - if you tile the camera 90 degrees to take a photo, it usually shows up tiled on the screen, right? Or you need to use a menu to rotate the photo.  On this camera, when viewing a photo on the LCD, you can simply rotate the camera itself, and the image also rotates 90 degrees to fill the LCD!Of course, this is top-of-the-line.  If you're looking for a sturdy, everyday, basic camera, I definitely recommend the SD 450.  Same large screen, but smaller (and less resolution).And just to throw in a note of imperfection (because nothing is perfect), I do have some issues that are more with the limitations of technology than this camera itself.  Such as, the flash is great, but can be very overpowering unless people are about 6-10 feet away.  And the ISO 400 setting is very grainy, I try not to use it, even at night with long exposures.  Night shots in general are good, but changing into the night shooting modes can be difficult, so I usually stick to manual mode (but I'm at home with all of the various settings ad what they do, so you may prefer the various, funnily-named modes, such as \"kids and pets\" and 'fireworks\").", "Date": "December 19, 2005"}, {"Title": "A portable and entertaining choice.", "Author": "TCB", "ReviewID": "REKZGMQNDERV6", "Overall": "4.0", "Content": "I purchased this camera a couple of weeks ago because I was curious about the DIGIC II processor. (Translation: Jealous of my friend's camera.) I am a Panasonic Lumix fan but have long been impressed by the color output on the point and shoot Canons. The Lumix is a tremendous camera line. I have the FX-7.  The FX-9 is supposed to be even better and, and FX-01, a comprehensive upgrade is on the way in May 2006. I tell you this because it may provide you with some context regarding my SD550 comments. The Lumix has a Leica lens that provides tac sharp images via the camera's very effective image stabilization system. When you pull the trigger on any Lumix camera, you are going to capture what you see.Sounds good doesn't it? Not so fast. Is that really what you want your camera to do? Do you know why Bose is so successful? Its not because they replicate the concert hall. It's because their processors produce a sound that the average consumer likes. To put it another way....its better than the real music. I am a wine importer. I long ago realized that there is a difference between good wine and wine that people want to drink.  The Canon engineers have produced a processor that satisfies the typical consumer......that would be me!In real life, reds are not so red, and greens are not so green. With a DIGIC II camera, you can remember things the way Canon thinks you want to remember them. (Sounds Orwellian doesn't it.) Its really quite pleasing. I don't believe that the SD550 is the best choice for a post-processor (ie someone that dabbles in Photoshop, or even Apple's iphoto for that matter). It is best for the person that wants to store or print their pictures just the way they took them.Here's some things I especially like about the camera:1) Solid build. My wife already dropped it two feet onto a solid tabletop without effect. Its heavy in a good way.2) Very small camera and very portable with a little belt pouch.3) Battery. I have never run out of battery power during a normal \"tourist day\". However, I do not use the camera's excellent video mode that is sure to hog more juice.4) Color effects are really neat...accent, swap, etc. Once again, this is great for the person that doesn't want to mess with post-processing.5) Macro mode is excellent. Great for those times when you just have to capture some creepy crawly.6) Menus- Very intuitive and fun.7) Advanced playback features are useful when you have 100 or more images stored on your card.8) I finally have a camera with stitch assist! (for panoramas)9) 7.2 mp. Don't let anyone tell you this is not important. If you don't crop your photos, you should learn to. The more MP you have, the crisper your image will remain after cropping.Here are some concerns I have with the SD550:1) This camera needs image stabilization (IS). Some people will tell you its not important on a point and shoot. Wrong. Why?a. No point and shoot works well in low light but those without IS suffer more acutely at slower shutter speeds.b. This camera (and its competitors) has a 3X optical zoom. Its also has a 4X digital zoom. That brings your total zooming power to 12X. Sounds good, right? Well, on an IS enhanced camera like the FX-7 it is. I have taken excellent pictures at 12X. This SD550 is limited to its 3X optical zoom without a tripod. BUT....remember that with 7.2 mp, you can take a 3X shot and crop it to emphasize the object of interest. Its almost as good as a zoom.c. Shooting from a car or train can be very challenging with a non-IS camera. You may be aware that the next generation of SD cameras, scheduled for release any time now, do have IS. The Canon engineers recognized that this was a problem. That being said, I bought my camera two weeks ago and don't regret it. I am working around the IS issue and you know how technology works. There is always something better just around the corner2) If you don't use the included wrist strap, you will drop this camera. Period. The finish is too slippery.3) Colors are more vivid on the SD550 but I miss the tac-sharp resolution of the Lumix's Leica lens.4) I am having some issues taking \"sports\" pictures. With my Lumix I just set it to \"SCN Sports\" and it took over flawlessly. This camera has a \"SCN Kids and Pets\" setting but I'm not sure its giving me a quick enough shutter speed. I don't want to make a big deal about this because with just two weeks of experience, it might be user error.5) Even turned to high, the LCD screen can be difficult to see in bright conditions. Kudos to Canon for including an optical viewfinder to fall back on. My FX-7 doesn't have one.CONCLUSION: I gave this camera 4 stars because I think IS would marginally improve the resolution of the photos. Other than that, the DIGIC II processor does everything as advertised. Portability is very important because the best photo is often, \"the one you take\". Keep this camera with you....purse or belt. This camera is a lot more fun than my Panasonic. The features keep me constantly entertained and as I noted earlier, I haven't even gotten to the video yet!", "Date": "March 12, 2006"}, {"Title": "You can't go wrong with the SD550!", "Author": "Jason Cummings \"The Bald One\"", "ReviewID": "R1UOPMYQ0OM82V", "Overall": "5.0", "Content": "If you're looking for a camera that does everything well this one's for you.  The pictures are stunning, video is exception (for a camera) and the controls are easy to figure out and use.  Because this camera is so small, I can toss it in with my motorcycle gear and not even know it's there!  When your traveling on a bike space is at a premium.  I have two small children and have found that this camera is so fast I rarely miss a picture and downloading them into my computer is a snap.  A memory card of at least 512 mb should suffice.  I bought 1 gig so that I could go away for long weekends and shoot all the pictures I wanted, as well as a handfull of short video clips, without having to worry about running out of room.  I did alot of research before deciding to buy this model and  am 100% satisfied with the product.", "Date": "December 1, 2005"}, {"Title": "Cheap, reliable & all-around good camera,4.5 stars", "Author": "dddddsssss \"gggogogog\"", "ReviewID": "R2A0R6ZDHBO2RS", "Overall": "4.0", "Content": "I purchased this camera a couple of weeks ago because I was curious about the DIGIC II processor. (Translation: Jealous of my friend's camera.) I am a Panasonic Lumix fan but have long been impressed by the color output on the point and shoot Canons. The Lumix is a tremendous camera line. I have the FX-7. The FX-9 is supposed to be even better and, and FX-01, a comprehensive upgrade is on the way in May 2006. I tell you this because it may provide you with some context regarding my SD550 comments. The Lumix has a Leica lens that provides tac sharp images via the camera's very effective image stabilization system. When you pull the trigger on any Lumix camera, you are going to capture what you see.Sounds good doesn't it? Not so fast. Is that really what you want your camera to do? Do you know why Bose is so successful? Its not because they replicate the concert hall. It's because their processors produce a sound that the average consumer likes. To put it another way....its better than the real music. I am a wine importer. I long ago realized that there is a difference between good wine and wine that people want to drink. The Canon engineers have produced a processor that satisfies the typical consumer......that would be me!In real life, reds are not so red, and greens are not so green. With a DIGIC II camera, you can remember things the way Canon thinks you want to remember them. (Sounds Orwellian doesn't it.) Its really quite pleasing. I don't believe that the SD550 is the best choice for a post-processor (ie someone that dabbles in Photoshop, or even Apple's iphoto for that matter). It is best for the person that wants to store or print their pictures just the way they took them.Here's some things I especially like about the camera:1) Solid build. My wife already dropped it two feet onto a solid tabletop without effect. Its heavy in a good way.2) Very small camera and very portable with a little belt pouch.3) Battery. I have never run out of battery power during a normal \"tourist day\". However, I do not use the camera's excellent video mode that is sure to hog more juice.4) Color effects are really neat...accent, swap, etc. Once again, this is great for the person that doesn't want to mess with post-processing.5) Macro mode is excellent. Great for those times when you just have to capture some creepy crawly.6) Menus- Very intuitive and fun.7) Advanced playback features are useful when you have 100 or more images stored on your card.8) I finally have a camera with stitch assist! (for panoramas)9) 7.2 mp. Don't let anyone tell you this is not important. If you don't crop your photos, you should learn to. The more MP you have, the crisper your image will remain after cropping.Here are some concerns I have with the SD550:1) This camera needs image stabilization (IS). Some people will tell you its not important on a point and shoot. Wrong. Why?a. No point and shoot works well in low light but those without IS suffer more acutely at slower shutter speeds.b. This camera (and its competitors) has a 3X optical zoom. Its also has a 4X digital zoom. That brings your total zooming power to 12X. Sounds good, right? Well, on an IS enhanced camera like the FX-7 it is. I have taken excellent pictures at 12X. This SD550 is limited to its 3X optical zoom without a tripod. BUT....remember that with 7.2 mp, you can take a 3X shot and crop it to emphasize the object of interest. Its almost as good as a zoom.c. Shooting from a car or train can be very challenging with a non-IS camera.You may be aware that the next generation of SD cameras, scheduled for release any time now, do have IS. The Canon engineers recognized that this was a problem. That being said, I bought my camera two weeks ago and don't regret it. I am working around the IS issue and you know how technology works. There is always something better just around the corner2) If you don't use the included wrist strap, you will drop this camera. Period. The finish is too slippery.3) Colors are more vivid on the SD550 but I miss the tac-sharp resolution of the Lumix's Leica lens.4) I am having some issues taking \"sports\" pictures. With my Lumix I just set it to \"SCN Sports\" and it took over flawlessly. This camera has a \"SCN Kids and Pets\" setting but I'm not sure its giving me a quick enough shutter speed. I don't want to make a big deal about this because with just two weeks of experience, it might be user error.5) Even turned to high, the LCD screen can be difficult to see in bright conditions. Kudos to Canon for including an optical viewfinder to fall back on. My FX-7 doesn't have one.CONCLUSION: I gave this camera 4 stars because I think IS would marginally improve the resolution of the photos. Other than that, the DIGIC II processor does everything as advertised. Portability is very important because the best photo is often, \"the one you take\". Keep this camera with you....purse or belt. This camera is a lot more fun than my Panasonic. The features keep me constantly entertained and as I noted earlier, I haven't even gotten to the video yet!", "Date": "May 8, 2006"}, {"Title": "Excellent Camera!", "Author": "K. B. Jensen \"Advanced User\"", "ReviewID": "R3NL13GH2PFS5J", "Overall": "5.0", "Content": "I bought this camera shortly before our cruise vacation this year.  I've had it for approximately 3 months and have shot approximately 1200 pictures and 2 hours of video with it.The camera shoots outdoor photos beautifully, for the buck, nothing else is close.  I shot alongside a Casio Exilim EX-S600 and a Fujifilms FinePix E900, and was impressed to see that the SD550 stood up to and most of the time,  surpassed the other cameras.  The only time the FinePix beat it was in the indoor shots.  While the Canon does not shoot as well indoors as I would have hoped, it is by no means a slouch in that area.The first video I shot was from a pitching, yawing Cessna 207 on approach, and the camera accurately portrayed the landing, without a waver.I paired the SD550 with a ProCases SuperSlim genuine leather case which fit the camera like a glove.  I haven't seen a case like it.  I also purchased a rubber-covered chain that is long enough to hang the camera around my neck.I credit my decision to purchase the SD550 to the reviews I perused on Amazon.com, and my thanks goes out to those folks who took the time to write thorough reviews.", "Date": "May 27, 2006"}, {"Title": "It's GREAT!!  compaired to Casio EXZ750", "Author": "Billy Howell", "ReviewID": "R2SB9KUIG8NADE", "Overall": "5.0", "Content": "I originally purchased the Casio EXZ750. The Casio wowed me with it's features, It does everything but it seems quality is lacking. I charged the unit over night and woke up to a lens error. Casio told me the unit was defected and to take it back to the store where I purchased it. Still able to take pictures (just not able to zoom) I experimented and took many pictures. I found the quality of the pics to be acceptable only about 50% of the time. Ohhh and the movies did not play on my Macintosh.I exchanged it for the Canon SD550. The Canon did not have all the features the Casio has but.... You can immediately feel the quality of the Canon in your hands. The Canon does not seem frail as the Casio is. The quality of the pictures are exceptional. I only paid about $40 more for the Canon but it is truly worth the price difference. Crisp clear pictures in every lighting situation. Just love it. And the movie feature works wonderfully with my Macintosh.I loved the features od the Casio but I wanted better quality pics and not to worry if the camera will be broken in a few months. I am so happy I returned the unit and went with the Canon SD550. The Canon is truly a much better camera.Billy - thecloser", "Date": "December 8, 2005"}, {"Title": "Great little performer", "Author": "Russel Miranda \"russthegeek\"", "ReviewID": "R2BCWRL7D0I1K7", "Overall": "5.0", "Content": "I gave this point and shoot to my wife for her birthday, about six months ago (11/2005). We both love taking pictures - of nature, of vacations, of pets, of parties, of everything. She was a die-hard film enthusiast, with her 35mm point and shoot always within reach. I had switched to digital, my 35mm SLR body relegated to back-up status behind the Digital Rebel. When she finally showed an interest in digital, I did a lot of research looking for a camera that would meet her requirements. Small size (so she could still carry it anywhere), fast startup and near-instant shutter lag (to get the shot you want, not the one from a second later), good performance in low light, and manual settings (for when you need more control). I went to the stores, I picked them all up in my hands, aimed them at things far and near, read the tech reviews from the pros, compared the sample photos, and discoved for myself that this camera has it all. Don't get me wrong, I love my DSLR, but I'm tempted to go buy another one of these SD550s for myself, just for the convenience. I'm astonished by how good the pictures come out, in all sorts of lighting conditions. It's the only digital point-and-shoot camera that I've tried that has a shutter lag (the delay between when you push the shutter release and when it actually snaps the picture) short enough to come close to a DSLR. All that, and it fits in your pocket.On the con side, the SD card they ship with this thing is laughable, you should buy a 512MB card when you buy the camera. And although the battery life is good, I wish all of these cameras came with a spare battery. Another battery means never running out - come home (or back to the hotel), and when you download the pics to your PC, you can swap the battery in the camera for the one on the charger - no more forgetting. I was hoping for a camera that took standard size batteries (like NiMH AAs), but I guess they couldn't make them fit in a camera this small. That said, I bought her an extra 3rd party battery, and we have had no problems.Neither of these issues is a serious issue with the camera itself, though. This camera earns all five of its stars in my book. Oh yeah, and my wife loves it, too!", "Date": "May 8, 2006"}, {"Title": "Lives Up to the Hype", "Author": "S. E. Ray", "ReviewID": "RLUUM64M2V67F", "Overall": "5.0", "Content": "I have had some of the better professional digital cameras like the Canon D60 and 20D with many lens and accessories. Therefore, I have high expectations of the features and functions of any camera I would use. Having used point-and-shoot cameras from Kodak, Fuji and Sony, I have only found disappointments in flash functions, picture quality and logical menu navigation. I am happy to say I had no qualms with the marvelous design and functions contained within the Canon SD550 Digital ELPH. It is every bit as good as everyone says, and compared to the competition like the Sony DSC-W5 and W7 which is said to rival it, I would say not. Sorry Sony. The SD550 uses popular SD card, not the expensive and proprietary memory stick, the SD550 uses lithium cells, not 2 AA batteries. What comparison? The only thing I grumble about is the short battery life of the lithium cell. The SD550 2.5 display eats the power quickly. But for now, that is the nature of any camera of this design, not exclusive to the SD550. With that in mind, you must buy at least two NB-3L battery packs. I would of also liked to have found at least 32MB internal storage like the HP M517, but compared to all the extras Canon packed into this little marvel, the extra memory is not critical. Also, the compact Rezo 10 camera pouch with belt clip and carry strap works perfectly, with a stretch pouch for the extra battery. Don't settle for less than a 2 gig 80x SD card, especially if you plan on any video capture. Patriot brand SD rivals the Sandisk and is less expensive. If you buy the Canon SD550, you will never be sorry. If the price tag is too hefty, the Canon SD450 is just as good with only a 5.0 megapixel CCD.", "Date": "December 9, 2005"}, {"Title": "Great little camera!", "Author": "K. Grisham", "ReviewID": "R1852WLU9PIYEI", "Overall": "5.0", "Content": "I am a professional photographer and was looking for a good, but small \"point and shoot\" type digital camerathat I could comfortably keep in my purse... for all those\"oh how I wish I had a camera right now\" moments!I have been extremely pleased with the images that this little camera produces and have even finally \"broken down\" and decided to buy the waterproof case for it!I have read a few threads about the gold color being\"so ugly compared to the silver\"... ridiculous... it is such an extremely light, soft \"champagne gold\" color, it should bea non-issue if you are considering this camera...Granted, the SD550 does not do all that my $4000 pro digital camera can do (hence the difference in price!)... but for whatI want and need it for, I would buy it again in a heartbeat!Best wishes!", "Date": "June 13, 2006"}, {"Title": "Great point and shoot camera", "Author": "K. Robinson \"Corn Cob\"", "ReviewID": "R2CU3OXBB238YQ", "Overall": "5.0", "Content": "Just bought this camera had it for about a week.  Great shipping times from Amazon for a start and got a free 256mb SD card for buying it in January.It's got everything you'd want from a point and shoot camera, and the software that comes with it is really easy to use.  I was kinda bummed it didn't come with a case, so I bought it with the SD550 Upgrade Kit 2, which included an extra battery, case and heavier duty and longer strap.  For an extra 40 bucks its really worth it, the extra battery is really handy and so's the case.Everyone else has outlined the great features this camera has, and it's allo true. For a point and shoot, it doesnt get much better.", "Date": "January 9, 2006"}, {"Title": "Something to consider about the SD550...", "Author": "David Darick", "ReviewID": "R1YE7UM3CKXU6R", "Overall": "4.0", "Content": "I only have one major concern, so I'm going to make this as short and sweet as I can.  First, to give you an idea of my background, I took a couple years of photography classes so I have atleast a little grasp on cameras and shooting in general.  I've had several basic 35mm cameras and a couple digital.Lately, my interest in photography has returned and I decided to purchase a camera that is very capable and yet also easily portable. Since digital cameras are now coming out with \"decent\" movie modes, I thought I'd get one that could both produce great photos and reasonble videos.  I did several hours of research reading reviews on this site and a couple of others, and in the end decided the SD500 had everything I needed.  But, after reading about four reviews of there being a whining or whiring sound on the 500's videos, I checked out the 550.  I found no complaints of noises and read in several areas about how the 550 was superior to the 500 due to Canon's latest developments...  I bought the SD550 and have found that either 550's in general, or atleast the SD550 that I had, produced an amazing amount of background noise in any of the movie modes.  There was actually a combination of noises.  There is both a whining sound like a kettle constantly whistling in the background as well as a whiring sound like waves crashing in a rythmic pattern.  Writing it out sounds kinda beautiful, but it annoyed the heck out of me, so I sent it back. I do have to admit that I have little tolerance for inconsistencies in my electronics such as cameras, stereos, DVD players etc, and may be more sensitive to some background noise than others. So while this was extremely annoying to me, it may not be a large concern to you or others considering this camera. The noises DO NOT make it difficult to hear or understand the person speaking or whatever it that's going on in the background.  But, if you turn your speakers up just a bit, you will notice all of the noises I've mentioned here.  Not to trample on this otherwise great camera, but I have to also mention the fact that the movie mode also creates what sounds like a lisp over the voices of anyone talking.  The voices will sound crisp and clear at first, but when any higher frequencies are spoken, for example any s's, it will simply go flat like a \"shhh\" sound.  I couldn't keep a camera that made me and everyone I know sound like we have lisps!  Like I mentioned before, the camera is a great point and shoot, and I truly mean that. In the right light, the pictures you will turn out with this little Elf are on par with the much more expensive entry level digital SLRs, but I think that's where it stops.  I really didn't want to write a whiny review, I just thought that I would've liked for someone to have written the same for me. So, good luck in your searches!", "Date": "May 11, 2006"}, {"Title": "Don't underestimate your need for high megapixel count", "Author": "Mr. testb4ubuy", "ReviewID": "R1N6KBQ7RV9FYN", "Overall": "5.0", "Content": "The best small digital camera you can buy!!  I spent hours researching and testing.  Won't repeat all the postitives already stated by others.What I want to do is inform you about a misconception regarding megapixels (high vs low).You may decide to buy a less expensive camera when a salespeople at camera/electronic stores says,  \"Do you plan on mostly printing 4x6's, or will you do alot of enlargments\"?  You respond, \"mostly 4x6 prints\".  The sales person then tells you that you won't need to get a 7 megapixel camera and can get along with a much less expensive 3 or 4 megapixel camera.Not true!!  If you plan on cropping your pictures, it is the equivilent of enlarging them and then printing only a portion of the image on a 4x6 print.  Too severe of a crop with a lower megapixel camera and you get a fuzzy image. So, it's not just 8x10's and larger that need the high MP count.  It's all photo's.I crop almost every picture I take.  It allows me to get a much larger share of \"good\" photo's.  For example, I shoot many shots very wide on purpose.  Because the SD550 has 7.1 MP, I can \"frame\" it up later without losing quality.  So, I have not printed anything bigger than a 4x6 but I have not lost quality.  The couple of extra hundred dollars you spend on this camera goes a long way.When the salesman says \"2 or 3 MP fine for 4x6\"..that's true only if you don't crop pictures.  With the Canon, I've made perfect close up portaits (face only) from wide shots which included other people in the original shot.Remember, it's more expensive to buy 2 camera's (the first one, and then the one you really should have gotten) vs. just doing it right the first time.Also, check my other reviews if you want to find the best and most inexpensive way to print your photo's.  It's not on a typical injet printer.  Most consumers think \"inkjet\" is the onlychoice they have.", "Date": "February 7, 2006"}, {"Title": "Very Nice Quality Images", "Author": "Timothy Hargis \"Mestonica\"", "ReviewID": "R2DZV3KRVPYLSX", "Overall": "5.0", "Content": "I believe that you can have a really nice camera and take mediocre photos or have a really mediocre camera and take breathtaking photos. It's all up to the individual behind the lens. Ive had a 5mp camera for years and learned all the ins-n-outs of digital photography. Now that I'm older and wiser and a more informed consumer, I knew that my Sony cybershot wasn't going to cut it anymore. So when I went to upgrade I enlisted a friend (Professional Photographer) and he told me to go with either Canon or Nikon. After looking at the options and showing him my choices for a good P&S; camera he told me this one was the best buy for my money and for my photos... and I couldn't be happier. For people who say that it takes terrible indoor photos, I suggest \"Manual Mode\" rather that auto. Any camera on auto won't take as nice of a photo than you could. This is a great buy and you won't be sorry. P.S. The macro option is excellent in my opinion.", "Date": "February 19, 2006"}, {"Title": "Very Happy in Cheese Head City", "Author": "Roger H. Martin", "ReviewID": "R2HQAO3JN46YPK", "Overall": "5.0", "Content": "After much searching the reviews on different sites I finally settled on the Canon SD 550 as my pocket size camera. I ordered the camera from Amazon.com on a Thursday morning and was very surprised when it was delivered on Friday afternoon.  I had seen the comments on the Champagne color and was not sure of what color to expect but when I opened the camera and found out it was Champagne , I was very surprised as I like the color better than the silver one.  As far as the camera goes , It's a sweet , easy to hold and very simple to operate even without using the manual as of yet and I believe I have used most of the features so far.I saw in one review that a person was looking for a LCD protector and having gone to Best Buy, I purchased the protectors for a Palm Pilot and it works just fine.The only problem I have seen so far is that when I go into digital zoom , the pictures get a little grainy and you can see this clearly when taking movies, but when using just the regular zoom, this camera takes better movies than my older digital movie camera.As said before , This is a sweet little camera and I am very pleased that Canon did such a fine job on this camera.", "Date": "October 9, 2005"}, {"Title": "First Digital Camera and Extremely Pleased", "Author": "JJS", "ReviewID": "RBXULKDXFUQRV", "Overall": "5.0", "Content": "My wife and I had planned a vaction to India and wanted to purchase a digital camera before we went.  Neither of us had ever used a digital camera before and we wanted something that was compact, easy to use, and would take really good pictures.  We got the camera about 4 weeks before our vacation and it was so easy to use that we felt confident bringing it as our only camera for our trip.  The results were spectacular, we took lots of pictures (over 1000) and the colors, the exposure, and the focus were teriffic on nearly all of our pictures.  There were literally only an handful that were not \"keepers.\"  Although we had read up a bit and tried some of the camera's special features, we pretty much left it on automatic and let it decide what to do with our pictures.  Our traveling friends had two older lower MP cameras and on many scenes where we both took photos the Canon provided results with much better exposure and color. Those who have seen our photos all are very impressed with the results.I would recommend this very highly to anyone wanting a simple to use, high quality, compact digital camera.", "Date": "February 4, 2006"}, {"Title": "Pixelation is up, Performance is Down", "Author": "James Abbott \"Geo-guy\"", "ReviewID": "R1KKF8GH8JRE5E", "Overall": "3.0", "Content": "I once owned the Elph S300, a compact flash model with 2.1 megapixels.  While this camera had realtively low pixelation it took excellent photos everywhere.  The flash was great for most low light applications, and there were many different modes of operation.  The only complaint would be that read times were slow on the camera, but that probably had much to do with the cheap flash cards I bought.The SD550 uses the more compact SD memory cards, and has a hefty 7.1 megapixels for a camera of this size.  Unfortunatley this is a camera that cannot be used in many low light conditions.  At night, under forest canopy, whatever, the flash is woefully inadequate for any thing more than 10 feet away.  This has been a big disappointment given my great experience with the earlier model.  After a $600 investment, I need to buy another camera!Why don't I return the SD550?  The body is not nearly as rugged as that for the S300.  After a just a few outings with the sd550, the body was extensivley marred by scrathes.  The camera looked so \"used\" that I'm sure I could not have returned it.  In comparison, my S300 took a beating, looked good and always performed.I love the Elph line and concept, but I think the engineers at Cannon dropped the ball on the SD550.  In the process of cramming more pixels into a slightly smaller unit, they managed to compromise performance and ruggedness.  I hope they get back to the better standards that I expect of this brand.Caveat emptor, test drive the newer Elph models for flash performance and ruggedness.", "Date": "March 18, 2006"}, {"Title": "Love my easy to use SD550!", "Author": "Dennis L. King \"Busy Guy\"", "ReviewID": "R1CRYWTN9N6M3I", "Overall": "5.0", "Content": "Love my new camera. It is so easy to use. I also bought a digital rebel by canon but could never figure out all the options. I never use it ..too big too dificult for me but takes great pics. I am clearly a point and shoot kind of guy. It takes great pictures and good videos as long as you don't zoom too much. I highly recommend this camera. If I didn't like it I wouldn't post it. This is the first post I have ever done so you know I am happy.I did buy a cover for the viewing screen because of problems I have read about on early versions of this camera. Better safe than sorry and it was only a few dollars. I also bought a kit with the extra battery and carrying case from Amazon. The case is small and fits on your belt and protects the camera as well as makes it accessible.", "Date": "October 30, 2005"}, {"Title": "Canon SD550 - pretty much perfect !", "Author": "almach5 \"almach5\"", "ReviewID": "R3A9I4UMHZ1W1D", "Overall": "5.0", "Content": "Okay, for my first review on Amazon, I give the Canon SD550 5 full stars.  After reading about and reviewing various digital cameras for months, I waited for the price of the SD550 to drop below $300 and bought it about 3 months ago.  I realized within a week that the lens is supposed to retract fully into the camera (not stick out 1/8\") and I called Amazon.com.  Their support staff was EXTREMELY responsive and immediately shipped a replacement SD550 AND a postage paid label for me to send the defective Canon back to them.  Thank you Amazon - great deal and great service.On to the camera:  The Canon really does it all.  With 7.1 megapixels, a clear LCD screen, an optical viewfinder (in my opnion, still very imporatant, no matter how large or clear the LCD screen may be - especially in bright sunlight), an optional underwater housing, clear controls (you do need to spend some time learning them), and good video recording options, you can't ask for too much more.  I have had 11\" x 17\" photos printed and they are just great.  The PicBridge compatibility is a bonus, as the USB 2.0 connection transfers the photos/movies out of the camera into my PC at a good rate of speed.  I am using a 2GB SD card for storage, and I would suggest you go with at least a 1GB.  Be sure to use a high speed card so there is no delay in writing to the card, and you can shoot all day long.  The workmanship and appearance is great.  But for those who fret about the color (Beige)?  Bah humbug... The color is fine.  As another reviewer said, Canon truly put together a great package.", "Date": "July 20, 2006"}, {"Title": "Best portable camera out there", "Author": "Gerardo King", "ReviewID": "R30VYUUP21SEOP", "Overall": "5.0", "Content": "This is my second purchase from Canon (also through amazon) and I am very happy once again. I bought this as my second travel camera. I bought a S60 a few years back but it ended up being too bulky for travelling.The SD550 is the best camera you can get for the money. canon offers and outstanding customer service with keeps me encouraged to fix my next buy from them.Pro's- Small, light and sturdy enough not to fall appart in a gymbag.- Big LCD screen gives you great previews- 7.1 MP!!! You can zoom in a zit and browse its population!- Amazing selection of shot modes, menu options and features packed into a little munchkin like pakcage.- Great battery life, although a second battery and travel charger is a must.Con's- Most of the menu options are within the LCD screen, so it can get confusing and it takes a little while to domintate.- No battery life indicator. A red battery light appears when you have like 10 more minutes of camera battery life.- Beige color is not my favorite but I can live with it. The features is worth living with teh color.Overall if you like to travel light and on a fast pace, this is the camera for you.", "Date": "July 13, 2006"}, {"Title": "Cannon sd550 powershot", "Author": "C Kup \"Hot Mom\"", "ReviewID": "R1ULJZSCILBOIA", "Overall": "5.0", "Content": "LOVE IT !!!! LOVE IT !!!! LOVE IT !!!! This is the best camera for busy parents. This camera never leaves my side. Now I can catch all those great times with my kids/family anywhere. Quality prints...top notch..Video componet is great.Only thing that would have made the purchase better is if cannon threw in a protective cover sleeve. Battery/memory card button opens when just left in the purse and leaves screen open to scratches.After all the price we pay for the camera they could toss one in and not miss any profit.", "Date": "November 29, 2005"}, {"Title": "I LOVE this Camera!", "Author": "Jane Chua \"Phish Phood\"", "ReviewID": "R1B72XUCC31D0X", "Overall": "5.0", "Content": "I bought the SD550 immediately after it came out to stores.  This was a big purchase for me as I am a SONY fanatic and buying a Canon... was kind of scary for me.  Needless to say I am absolutely THRILLED about this camera.  I took it to the Carribean with the WP-DC80 (Waterproof Case) and the pictures are AMAZING.  I would recommend the Transcend 2GB 150x SD card (it is SUPER FAST)... you can definitely tell the difference between a faster SD card and a regular 32x--it will truly show you the full capability of \"continuous\" shooting mode--believe me!  This camera is GREAT, excellent pictures, better focus points than what Sony has available with their point and shoot cameras.  IT IS GREAT!", "Date": "December 16, 2005"}, {"Title": "Just the camera I've been looking for", "Author": "J. Plush \"JimInOC\"", "ReviewID": "R2JNUTSO3KNPIG", "Overall": "5.0", "Content": "I purchased a SONY T1 last year and was very dissapointed with the indoor photos, the flash was too weak to use anywhere.I searched for months, read every review I could find for compact cameras and the SD550 seemed to have everything I was looking for.I've had it for 4 months now and am completely satisfied with my choice. Its a GREAT little camera. The flash is powerful indoors and red eye hasn't been much of a problem at all. The tones are nice and its very easy to use. Well done Canon.", "Date": "December 5, 2005"}, {"Title": "OK, but not great", "Author": "Roger Kiel", "ReviewID": "R1L4OK55DL8ZUQ", "Overall": "4.0", "Content": "This new Elph is sold as a camera which can compete with most others within the 7 to 8 megapixel range.  I've done a series of comparisons of identical shots with my 3 year old Canon G3 4 megapixel camera.  In my tests, the G3 is better in several important areas: exposure accuracy, resolution and macro capability.  Without question, the SD550 is a fun little camera to carry and have ready at a moments notice.  However, it does not produce prints which are as good as other (larger) cameras with CCDs having 7 to 8 megapixels, nor, in my case, 4 megapixels.", "Date": "October 22, 2005"}, {"Title": "Great Camera", "Author": "Larry", "ReviewID": "R3CO74P6SKN1EE", "Overall": "5.0", "Content": "I have been using the camera for about 2 months now and I love it.  I also purchased a soft leather case and a 1 gig SD memory card.  The large lcd screen is great.  My only complaint is the wheel that changes the mode the camera is in is too easy to accidently change.  The photo quality is fantastic.", "Date": "March 3, 2006"}, {"Title": "Great Camera comes with warning", "Author": "M. Ledbetter", "ReviewID": "R2O9D96Q37GJVF", "Overall": "3.0", "Content": "My husband and I bought this camera Dec '05-our first digital camera.  Fantastic camera.  We did a lot of comparison pricing before purchasing.  Takes wonderful pictures that are easy to email, great video- no need for seperate video camera for short video.  I couldn't ask for more until 3 days ago.  I went to take pics of the kids and the lens came out and got stuck and on the screen began flashing E18.  The lens would not go back in and the camera wouldn't turn on and off.  After recharging the battery, no change.  We looked through the owner's manual with no luck as to what the E18 means.  Did some research on the internet and come to find out it is a common problem in all of the Cannon camera family.  Because it has been less than a year the camera is still under warranty and we are waiting to hear back from Cannon.  Others I read about weren't so lucky and thier E18 problem didn't begin until 2 or even 4 years down the line.  So far everything we have read says it is an unfixable problem (we'll no more when we hear from Cannon).  I know this doesn't happen to ALL Cannon's out there.  It really is a great camera with just this small problem that you may or may not have.", "Date": "October 8, 2006"}, {"Title": "Ideal for 'wet' surf photography.", "Author": "dutch schultz", "ReviewID": "R2UWZ8X4CAIAGY", "Overall": "5.0", "Content": "I bought this camera specifically to use it with the WP-DC80 underwater housing for surf photography. I am writting this review based on the performance of the camera used with the housing. I am very impressed. Excellent resolution, very little shutter lag, light, small and tons of manual options.The Canon housing for this camera fits perfectly and allows easy use of all of the SD550's manual controls while in the water. The housing is not only designed well, but is also exceptionally strong. I am using it to take close-up photos of my friends surfing. I swim in the \"impact zone\" where, when I remain at the surface to shoot, I am constantly pounded by large set waves and sand-filled shorebreak.Not only has the housing held up to the intense changes in pressure, but it also handles the temperature changes well. I have seen some condensation (underwater being cooler than above the surface), but it has been minimal and disipates quickly.The housing comes with everything I needed - including a strong wrist band, LCD hood and silicon grease.Just a few tips for 'wet' surf photographers:I use the Manual mode and select the 'Continuous Shooting' option. I use 'Infinity' focus option and the lowest ISO that I can without blurring. I shoot all the way wide and position as close to the surfer as possible. The 550's 'Portrait' mode also takes incredible pictures, blurring the background and not the subject, but is only good for one-shot situations and it has a lag-time between continuous focusing and shooting.I recommend a HUGE capacity HIGH-SPEED SD card (at least 1G) for several reasons: because changing the card at the beach is not a good idea so you dont want to run out of memory in the middle of a session. also a high speed card will increase your frames-per-second rate when using 'Continuous Shooting' mode.I use duck feet fins, no floatation devices and I am buying a surf helmet to protect from boards/fins passing within inches of my head.For the entry level surf photog this is the ticket. Light years ahead of a lame waterproof disposable and not as expensive as the pro's gear.The only down side I can find is the battery life. Since you have to use the LCD (the viewfinder is blocked by the housing) the battery only lasts about 1.5 to 2 hours/100 pictures. I put the LCD to sleep after 10 seconds and power off if the sets are more than a few minutes apart.Heads up! One grain of sand closed in the o-ring can compomise the seal! Suggest you only open and close the housing at home or in a clean place. Rinse the housing loads before you open it after a surf because a lot of sand gets into the hinges. I keep color changing dessicant in the housing to detect even the smallest leak a.s.a.p. I add silicon grease each time I prep the housing for a session. Best bet is to take every precaution. Even though they work very well, this camera/housing were not designed to go throught the punishment I put them through, so just keep that in mind...I will load some of the photos I have taken onto the customer images gallery.", "Date": "May 17, 2006"}, {"Title": "lovely camera except that Canon goes cheap on key parts", "Author": "D. W. Bourne", "ReviewID": "R2XQTPXN5V3IWA", "Overall": "3.0", "Content": "The tiny plastic latch for the card/battery compartment broke almost immediately, making the camera useless.  I earlier had a Model S400 Digital Elph: the plastic lid-latch to the card compartment, quite a different part design altogether, broke also. $46.75 to fix it: part $1.75, labor $45. At least I could black-tape THAT lid until it was repaired, not so the SD550.No more Digital Elves for me until Canon gets on top of this design/material flaw.  Too bad.  Otherwise so impressive.", "Date": "November 26, 2006"}, {"Title": "Great camera for the price and features", "Author": "M. G. Pollock", "ReviewID": "R2JYHFIKL6VGZQ", "Overall": "5.0", "Content": "We bought this to replace our Canon PowerShot G2, which basically became useless after the LCD died one day.  This is everything the G2 wasn't.  It is small but sturdy, has a quick auto focus, takes excellent photos quickly, and is so much easier to use.  After having the G2 for three years and never using all the fancy, manual features on it, we decided to get something much easier, and this was a great decision.  Mostly we take photos of our three little kids, so we wanted something that we could take everywhere easily--usually we just put it in one of our pockets; no way to do that with the huge G2.  The \"Kids and Pets\" setting seems to be what works best for us, as well as some of the low light settings.  We've also taken many short videos with it, and the quality is quite satisfactory for a 1 or 2 minute clip.  It works very well with our Mac and iPhoto, and we love to watch the Slideshow once the camera is hooked up to the TV.  The controls are pretty intuitive, especially if you are used to Canons.  The 2.5\" LCD is great, too.  The charger makes the camera so easy to take on trips, because it's just a little plug-in device you slide the battery into--no long cords and big charging unit.  All in all, a really excellent camera for taking literally hundreds of photos.Definitely get the 1 GB SD card.", "Date": "November 22, 2006"}, {"Title": "Couldn't be happier...", "Author": "D. Bish", "ReviewID": "R2YIQZR3DLX6HC", "Overall": "5.0", "Content": "If you're looking for a \"can't miss\" purchase for point-and-shoot digital photography, this is pretty much it.Picture quality, even with flash, is spot on.Ease of use is great as long as you don't get mired down in all of the extra features it has. It has a ton of extras for the feature freaks but if you want simplicity then just ignore all of that and shoot away.The software that comes with it is redundant if you have Adobe Photoshop Elements 4.0, my personal favorite for photohandling and Photoshop Premier Elements 4.0 for movies.The movies it takes are really impressive for such a little package. It's kept me from lugging the video camera on more than one occasion.You'll want to buy another memory card. The one that comes with it won't last you long if you use the high-res setting or shoot any movies. Just make sure you spring for the FAST card, 133x or better, and you won't be sorry. The good news is that the prices of these cards seem to be dropping by the hour.All-in-all, a great camera. Until they replace it with the latest and greatest version that is....", "Date": "August 25, 2006"}, {"Title": "Highly overrated", "Author": "Saltmine", "ReviewID": "RI8SUI3V3CEJW", "Overall": "2.0", "Content": "I bought this camera because my Casio EX-Z55 broke (my fault) - That was an awesome camera, all around. I decided on the Canon because it was the highest customer rated consumer digital camera on amazon.com. Whoops. While sample customer images were of excellent quality, ALL of them were during the day. I don't contend that this camera takes excellent quality pictures with natural light. However, it has serious flash problems. Every image is heavily blown out when the flash is used, and the background is faded and blurry. Yes, I tried changing all of the flash settings. Doing a google on \"Canon SD550 Flash Problem\" reveals people on various forums trying to get help with this. The only solution? Put the camera into Macro mode, which is an improper setting for regular point and shoot shots, and only makes the problem SLIGHTLY better. After only 2 days of futzing with this camera, I returned it to Amazon on that basis, plus the fact that the battery latch wasn't closing properly (either a manufacturing or design problem. Doesn't matter to me). Going back to Casio.", "Date": "March 15, 2006"}, {"Title": "Unbelievable", "Author": "Basharat Alam Shah", "ReviewID": "R232HIZD3IM5IC", "Overall": "5.0", "Content": "I purchased this product from JR music.com from their own website, not from amazon.com . The seller is as awesome as the camera. I purchased Sony cyber shot T7 for my friend one month back from same the dealer it was tempting for me to get the same one for myself too given its looks. However, I when compared the customer pictures uploaded at amazon.com I decided to get Canon Powershot SD550. I cannot expect more from a small digital cam at that price. I am very satisfied with it. But, I would recommend a 1 GB scan disc given it is 7.1-mega pix u might really want to take some high-resolution pictures with it. Zoom is only 3x, but talking about $399 this is the best u may get. The pictures that I have uploaded are taken in the macro mode. In macro mode u can take the best as well as the worst pictures depending upon how stable your hand is. There is no image stabilization in macro mode so if you shake slightest degree u get very bad results even clicking the camera distorts the image to a greater extent. So the best thing to do is to take pictures in auto mode while u hold the cam and hold your breath too. Or if use a stand that is even better. Enjoy the pictures!", "Date": "December 10, 2005"}, {"Title": "I found reviews helpful in deciding my purchase so thought to share my experience", "Author": "Hoot \"HD\"", "ReviewID": "R3FZ58BGMPKG7W", "Overall": "5.0", "Content": "Making a purchase with a $400+ value was difficult for me, so I did a lot of reading and research. Ended up buying this Canon  Powershot SD550 because we knew a couple who had it one model lower and was happy, went to a store and asked the sales person what camera would he buy he said Canon because they have been doing cameras longer than most and the reviews were mainly good.So what do I think after about 5 months of using it. Very happy, very fast in getting it ready to take a picture, we have a newbaby and are very satisfied with pictures we have taken specially  the movies we take are really cool, I haven't used my videocamera since we got this digital camera, well I didn't use itmuch before but taking movies with this camera has not left me desiring to use our video camera, however you will need at list a 1gb memory card for taking video.At 7.1 mp the pictures are very clear. I am also very satisfied with the software to download/upload pictures/movies into computer. If the price of this camera falls into your range I would recommend this camera.In reading all the reviews I can't help but to think certaincameras were not manufactured properly and that can be. Itwould not be my place to dispute claims of unsatisfactionand also this is my first digital camera, so unable tomake comparison with other or previously owned camera.I gave this camera 5star and it's well deserved.", "Date": "April 23, 2006"}, {"Title": "Awesome Pictures from Canon Camera!!!", "Author": "Victoria Pauley", "ReviewID": "R2DVPIYLWOCTA1", "Overall": "5.0", "Content": "I recommend this camera to everyone!  I purchased it right before my vacation to Punta Cana and had no trouble figuring out all of the options. It was the best vacation we have ever been on, but my husband was worried that I was more excited about the camera than the trip!  I also purchased the waterproof case made for this camera and it was wonderful!  I took some pictures underwater at the pool and in the ocean.  Even if you never went underwater with it, it was great protection just using it every day at the beach.  I took many pictures and everyone that viewed them were amazed.  The large clear screen was another great feature.  My nieces and nephews always want to see themselves after I take their picture and now it's much easier to show them.  If you are reading this review, you need to buy this camera!!!", "Date": "November 6, 2006"}, {"Title": "Very good but could be better", "Author": "Traveller", "ReviewID": "RMKOOEUWW9LTE", "Overall": "4.0", "Content": "This is the best point and shoot I have ever owned - and I have had to buy another one for my wife.  It does most things very well, but I miss being able to choose speed and aperture and most shots need moderate sharpening.  And it's easy to drop (small and slippery but very stylish).  Overall - it's so good that I leave my DSLR at home most days.  The battery life seems more than adequate to me.", "Date": "January 1, 2006"}, {"Title": "Easy to use and great photos!", "Author": "Bento's Mom", "ReviewID": "R3HHUS8LI49Z69", "Overall": "5.0", "Content": "I bought my first digital camera the other day. I wasn't sure exactly what I wanted or needed to get, but a friend who is quite the camera-savvy person recommended the Canon Elph 550 7.1MP. I am so glad that I took her advice! This camera is easy to use, the directions are clear, and the photos are excellent! I can't tell you about all of the technical details that make this camera so great, but if you're a first-time digital buyer looking for an easy to use but high-quality camera, I would recommend this one. I have been able to capture clear images of my son racing around the back yard as well as beautiful landscape shots. And yet the camera is small enough to fit in my pocket! I give this camera a big thumbs up!!", "Date": "February 15, 2006"}, {"Title": "Watch Out for the LCD Screen", "Author": "BVD", "ReviewID": "R2T4MDPTJBI75J", "Overall": "3.0", "Content": "First the possitive.  This camera takes a great picture and video quality isn't bad either.  I don't use the sound on the videos so that isn't an issue with me.  The LCD screen is big and makes it easy to take quick photos and video.  However, my screen cracked while in it's case while strapped to my waste.  Wasn't dropped, bumped or anything.  Canon's reply is send it in and we'll decide if its covered by warranty.  Camera is only 7 weeks old.  There was only about 20 minutes time passed between taking a picture, putting in the bag and pulling it out again and finding the screen cracked.  I just think the screen needs to be a little tougher than that.  Perhaps mine was bad to begin with we'll see what Canon does with it.  Battery life seems a little disappointing also.  I had a cheap Nikon that cost half as much took just as good pictures and the batteries lasted longer and it was only a 3.2 mp.", "Date": "May 26, 2006"}, {"Title": "Lack of Image Stabilization Has Me Looking to Replace It", "Author": "A. Bastanza", "ReviewID": "R3SQB8HOF4YJU0", "Overall": "4.0", "Content": "I have owned this camera for about a year.  I love everything about it EXCEPT its lack of image stabilization.  It is fine when I use it.  I know to hold the camera still or brace it.  I have never taken an unusable photo.  But, if I give the camera to someone else, chances are better than half that the photo will be unusable unless I caution them to hold the camera very still.  Sometimes even this doesn't help. I find myself now looking for a newer Canon with Image Stabilization.", "Date": "December 16, 2006"}, {"Title": "Great Camera", "Author": "Tech Lady", "ReviewID": "R3LIG0Q42NGFUP", "Overall": "5.0", "Content": "I originally had the SD500 which was a great camera and I upgraded to the SD550.  This camera is even better than it's predecessor.  Has a larger screen which gives you a bigger view of the picture you are taking and works like a charm.  I would not hesitate to purchase this camera.  As usual, Canon lives up to its name and so does Amazon.  I ordered it and had it in a couple of days, as always.", "Date": "November 29, 2006"}, {"Title": "great little camera!", "Author": "K. Eaton", "ReviewID": "RUHOCW6IK24J4", "Overall": "5.0", "Content": "I love this camera. I've had it for a year. While my LCD did crack, it was because my camera was dropped onto concrete from a height of about five feet, and Canon fixed it at no cost to me at all. (Possibly since they've had other issues with it cracking for no reason?) Their customer service was great, and i had my camera back pretty quickly. And I'm much more careful with my camera now :)", "Date": "October 23, 2006"}, {"Title": "Great little camera", "Author": "Steven Rinck", "ReviewID": "R2DZFOT19BWQO4", "Overall": "5.0", "Content": "The majority of the other reviews have hit it spot on.  This camera is easy to use and takes a great picture under almost every condition.  It's fast, and light and very portable.There some drawbacks though.The fact that the camera doesn't come with any sort of case is a crime.  This camera is made to be portable, but without some sort of protection the LCD screen is easily susceptible to damage.  I bought a case separately (a leather case made by canon for this model) that works great, but something like that should come with the camera.  Especially for the price.There is no battery life indicator.  Like not coming with a case, this is  a simple addition that would have added great value to the camera.  By the time you get the low batery warning you have only about 10 minutes of battery time left.  Less if you take pictures, and probably less than a minute if you're using the flash.The one condition I've had trouble getting a good picture in is night-time in large environments (and outside).  It's tough to get the lighting and focus correct at the same time.  I've gotten in focus pictures with incorrect lighting, and out of focus pictures with perfect lighting, just never both correct at the same time.  Under any other condition though, I've have little to no trouble getting the exact shot I wanted.There is no manual focus (this adds to the above problem as well).  What this usually means is you'll have to have it refocus itself multiple times on occasion when it decides to focus in on something other than your intended object.  It doesn't always focus on what's in the center.  The picture turns out great in the end, but sometimes that extra 5-6 seconds gets annoying.Other than the above mentioned things, this camera works like a dream and does everything you'd expect and want from a small snapshot camera.  I highly recomend it, and I know that my next digital camera will probably be a Canon.", "Date": "September 25, 2006"}, {"Title": "Good camera in a little package", "Author": "Peanut", "ReviewID": "RX5P7DV7JZFJM", "Overall": "4.0", "Content": "I would classify myself as a beginnner with digital cameras. The first digital camera I owned was a \"freebie\" Toshiba PDR5; it was handy, but offered little in terms of features and shooting options. In search of new digital camera and quality photos, I bought the Canon SD550 because it seemed to have a good combination of compactness, cost and features. It did not have as much optical zoom as I would have liked but the 7MP was an added bonus.I have had the Canon since June and I love it. Shooting in \"Auto\" mode produces incredibly detailed and clear images with just one click of a button. My concerns initially that the camera would be difficult to use outside of the \"Auto\" mode dissolved after the first 100 pictures. After a bit of reading (of the manual) and experimentation, I am impressed with the potential and versatility of the SD550. The Colour Effect feature is a cool and fun way to highlight subjects. I was surprised too at the quality of the photo in Nightshot Scene mode.Although I am still experimenting, the Canon SD550 so far has exceeded my expectations.", "Date": "September 12, 2006"}, {"Title": "SD 550 Review", "Author": "Francine A. Tietchen", "ReviewID": "R2YLOSBCTPRQL9", "Overall": "4.0", "Content": "First let me say I got a great deal on Amazon .com on this camera and SanDisk 2g card.Checked on line and a few stores, best deal was here and the free shipping was great. This is my second digtal camera,first one was a Kodak 3 megapixel,nice camera,but this one far exceeds it. I'am not a camera person,but this one is easy to use. In auto it far out perform's the Kodak,even my 35 mm Yashica in some case's.If your looking for a really good point and shoot,this is the one.  Now for the good stuff. I still have to learn all the manual setting's,but you can really do alot with it. Really impressed with the ease of use and to change settings.Canon really came up with a excellant and adfordable point and shoot.  If you read other reviews,some knocked the LCD screen for being easily damaged. Well it's like anything,with proper care and use it should be fine. I agree, the door for downloading is flimsy,they could have made it better. The manual is OK,but it could have been written better,it's not a step by step manual,you have to jump through page after page to see what they are talking about. If you are into camera's you might understand it.  Over all, it's a great camera and I'am very happy with it. With the 2g card in the super fine mode it holds over 600 pictures,more in fine and normal.  Hope this review helps anyone thinking about buying this camera.Happy picture taking.", "Date": "August 27, 2006"}, {"Title": "Great, Clear Photos & Easy to Use", "Author": "J. Rohde", "ReviewID": "RK2UTBH1GJFX", "Overall": "5.0", "Content": "This camera is so easy to use and takes wonderful photos!  We have been very pleased with the quality -- the clarity and color are great. I especially like the large viewing screen.", "Date": "August 19, 2006"}, {"Title": "Cracked LCD screen - Beware!", "Author": "Chris Montague \"Chris\"", "ReviewID": "R1OIBNS2Y7X3JE", "Overall": "2.0", "Content": "I've been a Canon fan ever since the original Elph 300's, but this camera is putting my faith to the test.  The SD550's screen is terribly easy to crack compared to prior Canon's I've owned.  I've had the camera for 9 months with no trouble, and then the screen cracked when I put it in my pocket.  I went and got a new screen off eBay, and it was only a week before it cracked again.  Do not buy this camera if you plan on taking it out of it's box and using it.Good luck!  I'm currently looking at the SD630, as it seems to have a stronger screen, but it doesn't have a viewfinder...  Look for a broken SD550 on ebay soon.", "Date": "October 21, 2006"}, {"Title": "a lemon", "Author": "Gary W. Benson \"swift booker\"", "ReviewID": "R2XDFPG95NUN46", "Overall": "1.0", "Content": "My 550 lasted 12 weeks and then froze up completely. There was no trauma whatsoever. After 5 weeks I found out that it cannot be repaired. The red eye with indoor flash makes the photos useless unless you want to use software to correct each photo. I bought this camera because of the good reviews on Amazon but after researching online, I find that many have had similar problems. While it was working, the outdoor photos were very good.", "Date": "May 27, 2006"}, {"Title": "best choice for techies", "Author": "Diego Iglesias", "ReviewID": "RZ3X0BRWM0WSV", "Overall": "5.0", "Content": "I replaced my previous s500 with this and is really amazing and incredible the diference in every aspect. The Highlight for me is the LCD display.", "Date": "February 23, 2006"}, {"Title": "beware e18", "Author": "gammaray", "ReviewID": "R2MERQNOA7H1P4", "Overall": "1.0", "Content": "I've had this camera for 14 months - 2 months past the warranty.  Got a sudden E18 error and it's dead now.  Google e18 canon error and you'll see I'm not alone - this product can't be trusted - keep shopping!", "Date": "August 15, 2007"}, {"Title": "Mostly great...except for red eye.", "Author": "Mark DeHate", "ReviewID": "R3K89Z9CF02X8Z", "Overall": "3.0", "Content": "Sometimes this camera is wonderful - the size is awesome, and I can fit the camera in my pocket no problem.  And when you're taking pictures of the outdoors, it's great.  The problems come when your taking pictures of people and indoors.  The flash is SO powerful, often your subject will be nothing but a blur of white.  But my main problem with this camera is the red-eye.  With the red-eye reduction feature on, I would say about 75% of my indoor people pictures have red eye.  I actually usually leave red eye reduction off, because it seems to be easier to remove the red eye after the fact that way.My final gripe with this camera is it's lack of manual controls.  Obviously many users really don't care about this, but if you even have an inkling of wanting to have manual controls, this is not the camera for you.Overall, if you're looking to take a majority of your pictures indoors and of people, this is not the camera for you - save yourself a lot of work in Photoshop and get something else!  For any other purpose, this is a high-quality little camera.", "Date": "April 24, 2007"}, {"Title": "Lack of Image Stabilization", "Author": "Siren1791", "ReviewID": "R37ZG7QKTPX1BY", "Overall": "4.0", "Content": "I'm a long time Canon user and love the cameras but the lack of image stabilization on this one has me looking for an upgrade.  I can take decent pictures but if anyone else uses this camera, the pictures are fuzzy.  Take a look at one of the newer Canons with image stabilization and I think you'll be happier.", "Date": "February 18, 2007"}, {"Title": "The most reliable camera I ever owned", "Author": "A consumer in debt \"CES\"", "ReviewID": "R6UYWSO0OEYNP", "Overall": "5.0", "Content": "I purchased this camera for my wife 2 years ago, and it has been in very heavy use since. It is always in her purse, has been with us on many trips and has always performed flawlessly. Battery life is adaquate, the camera itself is small enough to be carried with you anywhere without becoming a burden, and it is amazingly sturdy.When I needed to get a camera as a present for a freind recently, I was delighted that this model is still on the market - and very attractively priced. I think that the cost / performace factor of this camera is the best in the market at this time (Jan. 2007).", "Date": "February 7, 2007"}, {"Title": "Right for my needs.", "Author": "Richard Gordon", "ReviewID": "R1DWK5AHB663W2", "Overall": "5.0", "Content": "I've reluctantly joined the digital world for still shots, but I'm thoroughly pleased with my purchase.  I've just begun to explore its possibilities, but so far it seems user friendly.  The price, convenience and service have been excellent.", "Date": "August 11, 2006"}, {"Title": "recent digital camera user", "Author": "Mona E. McGorvin", "ReviewID": "R3IO4233CJ0D4U", "Overall": "5.0", "Content": "Having used film until I bought this camera, it took some adapting to the medium.  That said, I love this camera!  With its 7.1 mp image, there is much more detail possible than most of my 35mm and 2 1/4 images, and it does not cost anything to see what they look like.  The zoom feature to review images really shows whether the shot is good or not, so it's really cost effective.  I shoot in \"manual\" mode most of the time and have had a great time experimenting with the many diffrent settings.  There is even a \"positive fim\" setting that does look like it is shot on film.  The basic software included is more than sufficient to correct and alter images.This does not have I S, but it is not needed in optimal conditions.  I have however used a tripod in low light, because holding for slow shutter speeds is more difficult with this light-weight camera.Good things- manual and automatic modes; four resolution settings with a max of 3072 x 2304 mp; rechargable battery with reasonable battery life; minimal delay between multiple shots; large LCD; good color balance; easy to use menus.Not so good: LCD is easily damaged (get a protector!); funky rubber cover over A/V output; no IS.The camera had \"smudge\" on the 1st few shots, a faulty CCD.  However, Canon replaced it at no charge, and it has worked fine ever since.  I LIKE the champaigne color too.", "Date": "July 21, 2006"}, {"Title": "It's a Keeper", "Author": "AZ-Bob \"AZ-Bob\"", "ReviewID": "R1NPZN3GO26OD", "Overall": "5.0", "Content": "It's a Keeper, had for several months now, love it, nice easy point and shoot, perfect for less technical users.  has good manual options, good settings, and great photos.  I don't think you will be disappointed.", "Date": "July 5, 2006"}, {"Title": "a mini wonder!", "Author": "Charles E. McManis", "ReviewID": "R33ZP4BEN8Y87A", "Overall": "5.0", "Content": "This Canon mini point and shoot does it all.  With 7.1 megapixels, it has the resolving power.  A 2.5 LCD screen is great but it also has not forgotten to include a viewfinder.  Little things like being able to add a grid overlay to the LCD so that composition is rarely crooked is a great touch.  The optional underwater housing takes you down to 130 feet with no loss of control features.  The video option tops it off.  With so many features found only on the full size digital SLRs, this little wonder can hold its own with many of the big boys.  11X17 inch prints at the high rez settings are knockouts.(Canon i9900 printer)  This is a great package!", "Date": "June 30, 2006"}, {"Title": "killer camara", "Author": "Bryan", "ReviewID": "RQMQRMTMJ6FH1", "Overall": "5.0", "Content": "I just bought this as a replacement for a 3.1mp sony that was lost  when I loaned it out.  I tested it out last night and am very pleased with the ease of use of the menu's the size, quality (so far) and feel of it.  One note, this camera is just a touch to large for the snug case sold for the SD500, SD450,SD300, etc.  So don't buy the case hoping it will fit, even though it comes up as \"recomeneded\" accessory on amazon.  Wal-mart has a bunch of these cases, I would wait and get one from there.", "Date": "March 9, 2006"}, {"Title": "Good camera - could be better though", "Author": "J. C. R. Andrade \"JC-Brazil\"", "ReviewID": "R33IF35YFUDR4P", "Overall": "4.0", "Content": "This is my first digital camera, so take it into account when reading the comments below. I did some comparisons before buying it, and consider it the best in its class. What could be the improvements?a- live histogramb- more control over aperture/ time (or, at least, better description of the scene modes - e.g. would \"portrait\" provide the fastest exposure? does it works with subjects far away?)c- indication of exposure time - not only when time is greater than 1/60sd- an idea of remaining battery time (an additional battery is strongly recommended - the fast processor uses a lot of power and even heats the case of the camera)Interesting features: \"my colors\" mode; stitching software.Very good product... maybe I am searching for perfection... :)", "Date": "December 31, 2005"}, {"Title": "You people are crazy!", "Author": "M. Hendrix", "ReviewID": "R2JZ3KSDEGMW5E", "Overall": "5.0", "Content": "This camera is spectacular.  I can't believe some of the things I'm reading.  Some of you people are blaming the camera for your clumsy ways!  Why would you buy a reasonably expensive camera like this and toss it in your purse or pocket?  I've had this camera for months, I keep it in a case that keeps it protected, and I even bought film to protect the screen from scratches.  The picture quality is remarkable.  Especially the new \"My Colors\" feature.  Amazing.I'll be the first to admit that I'm a college student and I've carried it with me to the pub a few times.  This camera can be handled (even if I've had one or two...). This camera is excellent.  With any camera you should always put the wrist band around your wrist in case it slips.Don't be pushed away by the people who give this camera bad comments.  They are clumsy and blame the camera for their roughness and mistakes.  This camera is perfect for anyone even a beginner and you should take care of it just like any camera and should never toss one around like it's a toy.Cheers!", "Date": "October 26, 2006"}, {"Title": "Amazing Little Camera", "Author": "Charles Charron", "ReviewID": "R3650PODBC3V5Z", "Overall": "5.0", "Content": "I bought this camera in February 2006 and have used it almost religiously since then. It has survived Korea, Iraq, and Afghanistan with me and still functions as it did on day 1. I can't see myself upgrading until it finally gives out and dies.", "Date": "March 6, 2011"}, {"Title": "Problems with Red Eye Reduction", "Author": "Ignacio H. Reyes \"nelly\"", "ReviewID": "R25C7HJEXX8Y8X", "Overall": "4.0", "Content": "The Canon Powershot is a very good camera with the exception that the Red Eye Reduction does not really work. I have read the instructions over and over againg, but the \"red eyes\" persist.", "Date": "February 23, 2007"}, {"Title": "Great Lil' Camera", "Author": "A. White", "ReviewID": "R2STUY2ECHG78J", "Overall": "5.0", "Content": "I bought this camera along with the underwater housing and took it scuba diving in Bonaire and was very pleased with how easy it was to use and with the quality of the pics that I took underwater. It was very light weight and while I'm no expert photographer, it met my needs perfectly. I understand that Ikelite sells a strobe & tray set up for the more serious, but I was happy with not having a big, heavy cumberson camera to lug in & out of the water.", "Date": "November 15, 2006"}, {"Title": "Excellent value for money", "Author": "S. Haldar \"life's meaning\"", "ReviewID": "R2KYPCIP7RGBST", "Overall": "5.0", "Content": "One of the best compact cameras out there.  It's loaded with features, for a camera this small.  7.1 MP, huge LCD, auto and manual modes and a bunch of other photo features.  It's approx. 3\" in length and fits in your pocket easily.  I took it to Europe recently and its unbeatable for traveling.  It's so lightweight that you hardly feel its there when moving.  Canon makes excellent cameras, and this is one of their best.", "Date": "November 9, 2006"}, {"Title": "Great Point and Shoot", "Author": "C. Norman \"Chloe\"", "ReviewID": "RRR96EX25QHX6", "Overall": "5.0", "Content": "This is a great little point and shoot digital camera; my only complaint is with the flash, it's a bit too much. I'm a big fan of Canon, and in my opinion they can't do any bad!", "Date": "October 31, 2006"}, {"Title": "Great Pictures", "Author": "Diane Wheeler", "ReviewID": "RJ51UPK2W7FQ8", "Overall": "4.0", "Content": "This is a great camera.  It is small and takes quality pictures.  It has more options than I wanted, because I like simple, but for someone that likes the options, this is the  perfect camera.  For the money, this is a great deal.", "Date": "August 16, 2006"}, {"Title": "Do not use Adorama or consider this camera", "Author": "J. Vermillion", "ReviewID": "R28CCERLMRY3LX", "Overall": "1.0", "Content": "I have owned three of these cameras and each one has had the same problem.  Bump the lens at all while it is zoomed and the camera quits focusing.  I liked the camera immediately for ease of use, quality of image, speed etc. so bought one for wife and Dad.  Within weeks all three have the same problem...and that unfortunately is where the fun begins...as Adorama ignored my emails, calls and provided no service at all.  Worse yet even though all products were less than 50 days old I was told...no box no service.  Imagine $1200 in cameras all with the same problem all well within warranty and receiving no service or offer to repair.  With one of the three cameras, Adorama kept it for 12 months and put me in touch with multiple managers until they ducked emails, didn't return phone calls and finally sent my camera back a year after they had received it...still broken with no note.  I would be happy to provide emails etc. to support case if anyone at Adorama or Canon does care or reads this.", "Date": "July 3, 2007"}, {"Title": "Beautiful photos, easy to change settings", "Author": "toodles233", "ReviewID": "R1948C17DDYFKR", "Overall": "5.0", "Content": "I like to set my cameras for email settings on the lowest standard setting then be able to change quickly to higher density settings for beautiful clear photos. I have to say this camera does everything well. I worry a little about the large LCD screen and if it will get scratched or damaged because I carry it all the time and I tend to be a little careless. I have to make sure it is in something soft so it won't get scratched. My old Canon Elph 400 had a little LCD screen and was very beaten up & dropped a lot but it lasted 3 years until I dropped it too hard. They are amazing little cameras and take quite a beating. The video is easy to use, review and download. I like it much more then my old camera. It is much quicker and takes infinitely better photos.", "Date": "September 25, 2006"}, {"Title": "my wife loves it", "Author": "usta surf \"cloud 9\"", "ReviewID": "R31BZ5UFLXXX1D", "Overall": "4.0", "Content": "So does my daughter who used it so much we got her one. Brother in law loves his. Ours broke, but Canon fixed it with no hassles. Could do better in low light conditions, but overall very functional.", "Date": "August 27, 2006"}, {"Title": "Canon SD550 Flimsy Battery Door", "Author": "Anastacio Yu III \"Carpe Diem\"", "ReviewID": "R786J3NH6W712", "Overall": "4.0", "Content": "First and foremost, let me say that this camera is simply fantastic at taking daytime pictures. However, Canon is not great at designing the exterior and durability of their cameras. One main concern I have is that the battery door is very flimsy and doesn't really close all the way when secured, leaving a tiny few degrees to stick out, this shouldn't annoy me but when I'm taking pictures and my thumb just touches that point of the camera, it makes me think of the durability of the part, it shouldn't even move when my thumb is touching it!I've called up Canon and they stated that they do not fix minor exterior  problems unless the battery door breaks. Since the battery door still sticks out by a few degrees, this can leave to tiny particles like sand to enter and possibly damage the memory card and battery. Overall though despite its drawbacks, I love this camera and will buy more Canon products in the future.", "Date": "August 19, 2006"}, {"Title": "SD550 okay, not as wonderful as I had expected", "Author": "ISN \"neptune714\"", "ReviewID": "RBSTSV3SKSR11", "Overall": "3.0", "Content": "While I love the compactness of this camera, I have two problems with it: 1) it gets very hot after about 50 consecutive photos have been taken and 2) the flash doesn't work very well in darker places. For instance, I was at a wedding and while the outside pictures were great, the church pictures were absolutely lousy. I also own the Canon G3, which would have filled the light appropriately and would never take such dark pictures in bad lighting. I was really excited about the size of the SD550, since my G3 is so bulky, but I am disappointed at its performance.", "Date": "August 12, 2006"}, {"Title": "Camera review", "Author": "Cynthia Masters", "ReviewID": "R20FTD0TX7VS71", "Overall": "4.0", "Content": "I had a canon before this one, so I found it similar and easy to figure things out.  I am still disappointed with the shutter speed and the delay on digital cameras, but overall it is a quality product that produces great pics!", "Date": "March 21, 2006"}, {"Title": "Best Camera I Have Ever Owned", "Author": "Nicole S.", "ReviewID": "R3Q8HAD76LY905", "Overall": "5.0", "Content": "I came to the states from the Philippines in June 2005, and purchased this camera the same month because I wanted to document everything. It's now April 2011 and I still use the same camera (apart from my SLR) A LOT. For more dramatic shots, I use my SLR, but a lot of times, when it is a closeup/macro shot of just everyday things, I find that using my SD550 on macro works just as well.For casual shots, I use this camera a lot. People always ask me what camera I use because it's so crisp, vivid, and clear. I've bought other powershots for my brothers and my mom, but none of them perform as well or as consistently, and I should have probably figured out by now why, but I haven't. I just know the SD550 is the best point and shoot I know.", "Date": "April 3, 2011"}, {"Title": "Suey", "Author": "Cybee", "ReviewID": "R33UTWRU1BATAJ", "Overall": "4.0", "Content": "I bought the SD550 before my trip to Paris in 2006 and was most pleased with its lightness, ease of use and excellent photo quality! Early on I dropped it onto a concrete sidewalk whilst I was strolling along, but it only received scratches and worked fine thereafter (however, I learned it is best to use the wrist strap to prevent \"droppage\". Whew.)  I have now owned it two years and just lately have more difficulty with fuzzy photos and notice it is not as great in lesser lighting situations. I do agree this camera does not work well for taking distance photos that require light (such a school concert), but over all I have enjoyed it. Next time I would look for one with image stabilizer.", "Date": "March 20, 2008"}, {"Title": "3 years and still great.  Good size and quality for when I can't have my digital SLR with me.", "Author": "Tara", "ReviewID": "R38JZWC42ULDDK", "Overall": "5.0", "Content": "I bought this camera before my senior year of college and have loved it ever since.  The color and clarity of the photos are phenomenal.  I especially love the ability to single-out certain colors so the whole photo is B&W; except for things that are green (for example).  I had an issue with it within the first year where it wouldn't focus.  I think there was sand in it somewhere.  Canon took the camera back (it was still under warranty) and fixed it free of charge.  I took the camera with me to Southeast Asia for 6 months and thought it was a great size and very durable.  Ideally, I would have liked to have brought my digital SLR with me, but given the circumstances, this worked just great.I recommend sticking to the Canon brand battery, by the way.  I bought a no-name-brand battery to supplement the Canon battery (just in case) and the knock-off couldn't hold a charge after two months of use.  I absolutely love this camera.", "Date": "March 4, 2008"}, {"Title": "was great when it was working.", "Author": "JMF \"JMF\"", "ReviewID": "R2HQQ9L0ZJQIH7", "Overall": "2.0", "Content": "this was a NICE camera. it took some mighty fine beautiful pictures. it was loaded with features, and it was nicely compact for easy carriage.until the warranty expired.i got this in may 2006. it stopped working on december 31st, 2007 (no kidding). whenever i tried to turn it on, it gives me the infamous canon \"e18\" error, and the lens refuses to retract or extend.i emailed canon about the problem, and they want me to pay $120 minimum for repairs. COME ON, CANON. THAT'S ALMOST HALF OF WHAT IT COST MY SISTER TO GET IT FOR ME NEW! i'm not the only person to have this problem happen to me. i tried following the \"fix it yourself by twisting the lens\" solution, which worked for many people with the same problem, but to no avail. worse yet, canon REFUSES to take care of the problem because they know it'll bring them some good money to have them repair it for me.all i can say is this: that's the last time i ever buy a camera from canon again. screw you, canon. i hope you're happy with the $300 you leached from my sister. this camera is PROOF that appearances are deceiving - it looks SO NICE, but functions like garbage after accountability is terminated.", "Date": "January 4, 2008"}, {"Title": "Great only when in bright light or using flash", "Author": "Meryl K. Evans \"Content Maven behind meryl.net\"", "ReviewID": "R18XRPL2HAR8PT", "Overall": "3.0", "Content": "I love everything about this camera: Size, weight, that it takes videos, etc. I've owned a few Canons and I like the brand.But there is one serious flaw with this one and it's a problem if you have kids or take action shots... they're blurry unless you use the flash. Well, I am not about to use the flash while my daughter plays in her indoor volleyball game. Every picture turned blurry. I have to try to catch her as still as possible.We had a cousin in from out of town and tried to take pics of him with the kids. Blurry blurry blurry until I used the flash. Of course, flash washes out and gives the photo an unnatural color. Sometimes you can't make indoor lighting bright enough to avoid this problem.Taking action photos outside works great and it's almost always crystal clear. Since there are many excellent reviews here, I won't rehash what they said -- this is a key point that needs to be brought to light.", "Date": "December 14, 2007"}, {"Title": "Canon Powershot SD550 7.1mp", "Author": "Marilou Z. Secoquian", "ReviewID": "R2WVK85OJXGMYG", "Overall": "5.0", "Content": "I have one of my own for a year.  Works excellent. I gave one to my daughter for her graduation this coming Friday Jun 1.", "Date": "May 30, 2007"}, {"Title": "Canon Powershot SD550 7.1MP Review", "Author": "BoomerFSU", "ReviewID": "R33Y90J021ZWPV", "Overall": "4.0", "Content": "For the most part it is a good product.  Taking pics in darker places seems to be a minor challenge due t othe different features.  Also, when zoomed, pictures taken are sometimes not as clear as you would like them to be.", "Date": "March 13, 2007"}, {"Title": "very fragile", "Author": "Kirk J. Guotana", "ReviewID": "R1O96JH51T6XST", "Overall": "4.0", "Content": "I dropped the camera from 2 feet and the metal outer rim of the lens slightly became bent and won't close. After some time spent tring to bend the metal back in place, I finally was able to close the lens.Besides that, it is an awesome camera. I am able to pick out a color (ex. red) and take a picture with that color standing out and everything else black and white. No photoshop needed.", "Date": "January 15, 2007"}, {"Title": "eh...It's ok but my old kodak 5mp takes crisper pics", "Author": "M. Jackson \"fotogu\"", "ReviewID": "R1KW04ZTYGW5HL", "Overall": "3.0", "Content": "I bought this camera and not the 600 or above because of the existing viewfinder.  Many compacts are no longer including this little beauty because of space issues and to of course get the largest LCD screen possible.  Since I like to carry my camera with me everywhere and hate the inconvienience of changing batteries or recharging I like to conserve as much juice as possible.  Using the viewfinder instead of the LCD does just that.  I immediatly noticed the not so great picture quality of the Canon 550.  My old and beat up Kodak dx4530 seems to take much crisper high definition shots than my new camera.  I even did a side-by-side comparison and the Kodak blew the 7.1mp doors off the canon.  What's the use of 7.1 mp if all you can blow up is a grainy photo.", "Date": "January 15, 2007"}, {"Title": "Great Camera", "Author": "M. D. Trejo-soud \"South Florida\"", "ReviewID": "R2Y6Y8GHIY0YAU", "Overall": "5.0", "Content": "I purchased this camera for my 13 y/o daughter which is really into photography and is taken a class.  She loves the camera .. takes great pic's  and is easy to use.  Took some family shots with it and had them printed in 5x7 sizes.. great quality you could even read writing on my bracelet in the 4x6 print.", "Date": "January 12, 2007"}, {"Title": "Really Great Camera!", "Author": "Don Rose", "ReviewID": "ROQN0QO5NRN0O", "Overall": "5.0", "Content": "I bought this camera and went on Vacation, Took hundreds of shots at a medium pixel setting. The results far exceeded my expectations. The controls were generally easy to understand and worked smoothly, and the large viewing screen at the back was perfect. I would strongly reccomend this camera. Exceptional value!", "Date": "January 9, 2007"}, {"Title": "We love this camera", "Author": "J. Wise \"jw\"", "ReviewID": "R2DX441KJW6EH5", "Overall": "5.0", "Content": "We have been very happy with this camera.  It's small and lightweight.  We have been very happy with our Cannon Cameras", "Date": "January 7, 2007"}, {"Title": "Picture Perfect", "Author": "C. Thomas \"Chucky\"", "ReviewID": "R1V5ZBTZ4OBIIK", "Overall": "5.0", "Content": "More then what you paid for. Extremely sharp pictures, and very easy to use.  With a one gig chip you can easily record up to an hour of video.", "Date": "January 5, 2007"}, {"Title": "Phenomenal Camera", "Author": "Mike Jones \"MJ\"", "ReviewID": "R190RLFX75SKUR", "Overall": "5.0", "Content": "Just returned from trip...camera was right size for sightseeing and picture resolution is excellent. I would highly recommend this camera!!", "Date": "March 28, 2006"}, {"Title": "Say Cheese", "Author": "N. Heimler \"Captain Charisma\"", "ReviewID": "R3D001ANQNZEBW", "Overall": "5.0", "Content": "Disclaimer, had this for only a month or so so far.So far, so good.  Takes great pictures on a variety of settings.  Once in a long while you get a strange picture where it is darker than the room lighting, but I've only seen that once or twice.  Also, I've scratched the LCD screen, but that happens with LCD screens.Easy to use, compact, easy to upload pictures to the pc.  That's how this camera rolls.", "Date": "March 24, 2006"}, {"Title": "Great camera!", "Author": "Sunshine \"Schnell\"", "ReviewID": "R3EE55N1S65PJK", "Overall": "5.0", "Content": "I just purchased this camera because my previous digital camera was very old.  I wanted a small, compact camera that I could easily take anywhere, and that had a large LCD screen.  The pictures, of course, would also need to be really good.  I'm only an amateur photographer, so I just needed something easy to use that would make good pictures.  I read the reviews, and decided on this one instead of the SD450 because it did things a little quicker than the SD450.  I was a little turned off by the beige color, and by what others said in reveiws about the color.  HOWEVER, when the camera came in, the color wasn't bad at all.  You can hardly tell it's not silver.  The camera works very well, has very user friendly books that accompany it, and takes GREAT photos!  The camera is also very easy to use. I'm very satisfied with the camera, and the leather case that you can get to go with it is really nice.", "Date": "April 28, 2006"}, {"Title": "Overrated", "Author": "Joe Wills", "ReviewID": "RAJN1KNTGMPZ1", "Overall": "2.0", "Content": "I bought this camera in February on the advice of the salesman at my local camera store. He raved about it.I wish I hadn't been persuaded.The camera does have good points: really good outside shots and panorama mode, pretty good macro.But, there are just too many negatives.The worst fro my point of view is its fragility.Our family owns 3 other digial camera, a Pentax, a Fuji and an Olympus.We've had them al for several years and al lcontinue to take good shots and work fine.The Canon had problems from the get go.The first day I took a picture was at a local ski resort where my son had just learned to ski. I took a shot in the light snow flurries. The shot came out OK, but soon thereafter the camera started to show electronic malfunctions, the zoom started to be erratic and the shutter intermittent.I took the camera back to the store (3 days after buying it). They refused to exchange it, told me Canon would not cover it, but after some persuasion,  they sent it to Canon for warranty repair. Canon at first refused to do the repair under warranty saying it was my fault. After some persuasion they did the repair under warranty. The camera was OK for another month or two when I took it to Italy with me. I was walking briskly with it in its case. When I took it out to take a shot, the LCD screen was \"cracked\", not on the surface, but inside.I suspect this time Canon will not repair it under warranty.From my experience, this is just too fragile a camera for anyone who has an active lifestyle.There are other problems with the camera as well - especially at taking indoor shots. I do not recommend this camera. Our other 3 digitals are still going strong after years whereas the canon couldn't make it thru a few months.", "Date": "June 13, 2006"}, {"Title": "Spectacular", "Author": "Jeremy Robb", "ReviewID": "RSO7WZHLDW9Q7", "Overall": "5.0", "Content": "I purchased the SD550 in June of '06 and took it on vacation with me.  The pictures are beautiful (colors really \"pop\", picture is clear, exposure is excellent).  I use Picasa to crop photos for 4x6 and 8x10 prints developed at a local grocery store.  The results are *way* better than what I got with my old film camera.  I love and highly recommend this camera.", "Date": "October 28, 2006"}, {"Title": "Handy camera", "Author": "Elena Alegria \"aikoalegria\"", "ReviewID": "RB685W27YKY0G", "Overall": "5.0", "Content": "I know we all use our phones but this it's always good to have one of these around, especially if you are going to print the photos afterwards. You can plug it into your tv and see the photos on a big screen too.", "Date": "July 26, 2013"}, {"Title": "I want to get a new camera...a new camera of the same model!", "Author": "myu", "ReviewID": "RCBYCF98609QE", "Overall": "5.0", "Content": "I really love this camera because it proves that the megapixels are not everything. It was very powerful in its day, when 7.1 megapixels was a lot, but now there are cameras that shoot at 14.2 megapixels, but 7.1 megapixels is pretty good, and it's a good quality photo. This, however, does not matter. The camera is good on it's own staying simply in the automatic function. On most occasions, the white balance will adjust just right, and the flash will be okay. You have not fully experienced what this camera has to offer until you fiddle with the manual settings. With the manual settings, I can adjust the resolution of the picture, the size of the picture, the exposure, the ISO settings. Within the manual function, if you push the function set button, you can also change the mode to Digital Macro (which is incredible for close-up shots), and My Colors (with which you can make the image black and white, sepia, vivid, duller, or even highlight certain colors prior to taking the picture). These are what make the photography experience amazing for me. The camera is not simply your average point-and-shoot. It is more like a dimmed-down version of a DSLR, except that it is compact, the aperture and depth of field is harder to control, and it has no interchangeable lenses or flashbulbs. For a point and shoot, that is an amazing feat. For those who would rather not set their settings for each and every picture they take, there are programmed scene functions for capturing night shots, portraits, underwater scenes, and even fireworks.Another thing I really love about this camera is the interface. In newer models, Canon has swapped out the magnificent manual mode in favor of \"Intelligent Auto\" which is just not the same. The dial on the top right of the back of the camera makes it easy to switch between modes with minimal confusion, and the adjustments for flash, no flash, no red eye, lens light sensitivity, macro, and infinity are all at easy access without the need to look through a menu. The zoom options like on the top of the camera and surround the shutter button, which I like because it makes snapping photos faster without the need for excessive fiddling. Lastly, it's really cool how the camera rotates the images automatically for pictures you have taken in a portrait orientation as opposed to a landscape orientation.My camera is banged up due to overuse (to the extent that I don't really carry a case for it anymore), which is why I need a new one. But because this camera has absolutely blown me away, I refuse to get a different or a \"newer\" or \"improved\" model.I am in love with this camera.", "Date": "May 21, 2012"}, {"Title": "The BEST Camera I own is the Canon SD550 from 2005 and here's WHY", "Author": "Luanne Klondyke", "ReviewID": "R3KZC79MBYJHFA", "Overall": "5.0", "Content": "I bought the SD550 in November 2005.  My first serious high res (for that time), 7MP, digital camera.  I still use it today as my primary camera.  I purchased a Canon G10 in 2008 and hoped the 14MP resolution and additional capabilities would lean my away from the SD550.  But the opposite happened.  I've taken both cameras to New Zealand, Italy (twice), Switzerland (twice) and thru the ALPs, Germany, Austria, Aruba and the Southwest.  With both cameras in hand on all trips I would take a lot of the same scene photos hoping to get those few pristine framable shots.  When I compare the G10 with the SD550, the SD550 ALWAYS produces the best picture !  It's just unbelievable.  This little ELPH has given me the best shots from ALL my travels.  I've tried a Casio compact starting last year and its just trash campared to the either Canons. I am now trying to find a Canon Powershot Elph that can live up to the quality, durability and reliability of the SD550.  A little more resolution is what I'm after because I like blow up prints of some of my favorite locations.  The 7MP on the SD550 has limited blow up capability.  That's one of the reasons I bought the disappointing G10.  Frankly, the 14MP takes up too much darn hard drive space for the low quality pictures I get from it.  I'm considering the newer PowerShot 500HS at 12MP.  Can anyone who has a SD550 tell me if the 500HS can compare ? Does Canon make a comparable quality camera as this awesome SD550 ?", "Date": "November 21, 2011"}, {"Title": "reliable & clear shots", "Author": "Cevanne", "ReviewID": "RUP9T6FTJ3FO6", "Overall": "4.0", "Content": "I am surprised to hear so many people stating they have a problem w/this fabulous little camera. I purchased mine mid to late 2005 & have had no issues w/it as far as anything not working or it needing repairs. It still performs like a trouper & many friends of mine have commented on how I tend to get better long range/zoom type shots than their instant digital cameras. The only cons that I have come across is that it's hard to tell if you have a good shot on my little display, which has some scratching on it now & that red eye, on my kitties eyes (in pics), I have not been able to fix/correct & it's harder to get a clear shot if I have to use macro or even reg shots without flash, you have to hold super still or use a tripod. Also hard to get it to take quick enough pictures for action shots, but I have still gotten a few good ones. I notice the new SD cameras cost much less than mine did in 2005, it was $400 or $450 at the time from Best Buy for mine, but I've used it continuously for almost 6 yrs with no problems. I also note that mine was made in Japan & some of the complaints on the newer cameras are saying theirs were made in China & are cheap plastic. I also still have an older Canon ELPH that uses Advantix film that I like & still works great as well.", "Date": "July 8, 2011"}, {"Title": "Fantastic camera", "Author": "Martha A. Wise \"a wisemima\"", "ReviewID": "RFGLI3LX8JWFF", "Overall": "5.0", "Content": "This camera is great!  It has a lot of different featuresbut it is easy to use....just read the directions and trythese features....you'll be amazed at what this camera can do.Also, practice with it....and beautiful pictures willsurely be yours.", "Date": "November 25, 2009"}, {"Title": "Good compact digital camera from 2005, easy to fix as well", "Author": "Michael A. Duvernois", "ReviewID": "R1O8F95R45X2EG", "Overall": "5.0", "Content": "I dropped this on the floor in a building at McMurdo Base in Antarctica and broke the flash assembly. Had been happy with the camera, so found parts online and order the flash. Turned out to be a good number of little screws to remove, but not fundamentally difficult. That repair was a couple of years ago. Last winter I bought much better digital cameras for my daughters at a cost of $110 each with extra batteries and cases. Wouldn't be worth repairing now.", "Date": "October 10, 2009"}, {"Title": "Pretty good but could be better", "Author": "C. Yaged \"CY\"", "ReviewID": "R33YQAN3ST9IXE", "Overall": "4.0", "Content": "I've had this product for a couple years. I used to have an older Olympus digital camera. The Canon SD550 is a good choice for the money, especially since I didn't want to spend hundreds of extra dollars for some more megapixels. Nevertheless, I find that the Olympus camera took MUCH better night/dark pictures than this Canon. The Powershot is good for the \"point and shoot\" feature, and can take very nice pictures, but something about the way they come up doesn't compare to my old Olympus. The colors, contrast, and brightness just don't come out as sharp - you really have to TRY and take a great picture, while with some cameras (e.g., my old Olympus, friends' newer cameras) they just HAPPEN.Overall, this camera has been sturdy and has suited me well. I bought the Canon Powershot case for it, and it fits nicely.The battery life is pretty good, and it's been able to withstand my bouncing it around and dropping it. I'd recommend a warranty if you're like me.Conclusion:  Nice camera for the price (which at the time was around $400 but should be much cheaper now). Could be better, but it's small and sturdy and has suited me well.", "Date": "July 1, 2009"}, {"Title": "gwynings", "Author": "Gwynings", "ReviewID": "R2VZHSJXJL3GAI", "Overall": "4.0", "Content": "I bought this EXACT camera from Wal-Mart 2 years ago for around $200.00.It has been a very nice camera and worth the $200.00. The only thing I wish I could change is the 3x optical zoom.  I would like 5x or 10x but for the money ($200) it is a good camera.  How the vendors at Amazon can ask for $400-$600 is beyond me!  That is a rip-off.", "Date": "February 22, 2009"}, {"Title": "Hi-Quality, Canon Excellene in small form factor", "Author": "A. Santiago Jr.", "ReviewID": "R15ZVWASSMZT0O", "Overall": "5.0", "Content": "We still have this camera in our family and it was an excellent buy, as all of our Canon cameras have been.  Love the small Digital Elph format, which makes it easy to carry in my pocket or wife's purse.  Picture quality is excellent and has great battery life.", "Date": "May 12, 2008"}, {"Title": "No one uses it harder, and it's wonderful", "Author": "Sharon Knopic", "ReviewID": "R1PBQNOBPK1YGY", "Overall": "5.0", "Content": "I absolutely love this camera.  I've had many \"point and shoot digitals\" and you won't find one better.  What the people who have the camera and \"it just stopped working\" did to it, I can only imagine, because mine has been dropped, wet, traveled hard, and used for scrapbook pages that were published.  I love it.  The larger screen in the back is what drew me to it first, the Canon name, a close second. But it's serving it's purpose, and I keep on using it, carrying it with me almost 100% of the time.", "Date": "October 10, 2007"}, {"Title": "Great for travel!", "Author": "In Vegas", "ReviewID": "R1CES1I3H66OP7", "Overall": "5.0", "Content": "I carry this with me every where! What ever you do buy the leather case for it! I have had it for over a year now. At 11 months the zoom feature quit working, I go thru airport security several times a week, I think the x-ray machines were the problem. I returned it to Canon for repair. They turned it around in less than a week with updated firmware, no charge! I saw Wal-Mart selling these on closeout for under $300.00 with a color printer. I wish I had bought it there. I don't know what model replaces this one. I hope it works as well!", "Date": "September 7, 2007"}, {"Title": "Great camera and great pictures", "Author": "DS", "ReviewID": "R260NKDEMIZOC3", "Overall": "5.0", "Content": "My wife and I love this camera.  We bought it to replace a bulky older camera.  This camera takes pictures with the same quality and it is compact which means we take it everywhere we go.  It doesn't have all of the features of the bulkier camera but it gets used more.", "Date": "August 20, 2007"}, {"Title": "One fine little camera", "Author": "Samuel B. Lopez \"voreason\"", "ReviewID": "R2W3JNY5BBXW35", "Overall": "5.0", "Content": "This is a great little camera. I've owned more digital cameras than I want to admit, but this little beauty is small enough to fit in your pocket or purse. Until someone proves me wrong, I believe it's best to stick with camera makers for digital cameras and not an electronic maker. Canon has been around the camera business a long time and has always put out excellent products for both consumers and professionals. From what I've read, 7mp is just about the sweet spot for this size sensor.", "Date": "July 13, 2007"}, {"Title": "Excellent little camera", "Author": "J. Jessop", "ReviewID": "R285VITGZR3K18", "Overall": "5.0", "Content": "This is an excellent camera for daily use.  It has lots of functionality, its easy to use, and it takes outstanding pictures.  Never will you need more than 7.1 mega-pixels for anything you want to do with a little camera like this.", "Date": "April 14, 2007"}, {"Title": "a nice camera", "Author": "Y. Liu", "ReviewID": "R13Z2M806BZ71U", "Overall": "5.0", "Content": "This camera is great. It's got really clear images, and I like the macro feature so much. The LCD screen is very cool.. It's big and clear. The only con is that the size of the camera is a little big compare to some other brands like sony. But overall I like it a lot.", "Date": "March 8, 2007"}, {"Title": "dead in 9 months", "Author": "Chad Magiera", "ReviewID": "R10NGX5MFYP6K8", "Overall": "1.0", "Content": "camera was great for nine months.  Turned it on one day, lens telescoped out, LCD powered up, and camera died...  just sent it in to Canon Service.  But really, if this would have happened three months later I'm out the original prive of the camera ($400.00$ in Jan 2006 best buy).  I've seen a lot of these phantom Canon deaths to this model.", "Date": "November 4, 2006"}, {"Title": "Possibly the best point and shoot Canon yet", "Author": "S. Schmid \"bluelagoon61\"", "ReviewID": "R1537Y40IHIWOW", "Overall": "5.0", "Content": "I have owned several Canon cameras over the past 3-4 years and they've always been somewhere between 4.5 and 5 stars, but never something I could say was pretty much perfect. After much searching, I've finally found a camera that does everything I want it to do without any sacrifices. Just so you know where I'm coming from with the review, I'm not a great photographer by any means, but an enthusiast with a reasonable skill level. I have owned in the past the Canon A40, A75, S50, S1 IS, SD400, and now the SD550. I've also used the S70 quite a bit due to my best friend having one. All of these cameras are exceptional for what they are and did not disappoint, but all of them had one or two flaws that stuck out at me.Back to the SD550. The combination of photo quality, size, features, and cost is balanced almost perfectly. The problem of size I had with all the others except for the SD400 is addressed, and this doesn't scratch nearly as easily as the SD400. The screen is miles ahead of the one on the SD400 or the S70. The motion looks very fluid and realistic when you move the camera, both in photo and movie modes. On previous Canon models there was always a delay on the screen, though it didn't show up on the movie when it was played back. I'm assuming this is due not only to the Digic II processor, but a better refresh rate on the SD550 screen.The picture quality is phenomenal, and at least on par with the S70. The S70 definitely has better manual controls, but personally I think that if you're really looking for advanced manual controls, you're probably going to want a DSLR anyways. The preset shooting modes in the SD550 seem to work quite well for almost every situation I've come up with. I was very impressed by the digital macro mode. I'm very wary of anything that zooms digitally, but my eye can't pick up a difference up to 1.8x zoomed. After that I start to notice it a bit, but usually 1.8x is good enough to get a better macro shot than usual.This camera is by far the quickest I've used from startup to actually taking the shot. I cheaped out and bought the basic SD card, and it's still more than adequate. I can only imagine that if I'd bought the 60x one it'd be even quicker.Honestly, the only bad thing I can say about this camera is that it's a bit of an ugly duckling, but I'm a firm believer in function over form. The gold/bronzeish color isn't flattering, and the SD400 is definitely a nicer camera to look at, but honestly I'm just digging for something bad here so it doesn't sound like a gushing review.I'm also very happy with the fact that Canon managed to keep the camera almost as small as the SD400 while expanding the screen to 2.5\" and still managing to include a viewfinder! Even though I don't use the viewfinder much, I find in my job (at a major retailer that sells many digital cameras), this is a concern for many people, and alot of times swings the sale Canon's way versus the Sony N1, Casio Z750/850, etc.As far as the review from \"Stephen P Chen (Camera Man)\" where he mentions that the photos come out blurry with any hint of camera shake, I've found that a really simple solution to this is to use the kids + pets mode when you're taking pictures without the flash. Usually this bumps up the shutter speed quick enough to get a sharp shot in without any shake. Also, this problem isn't limited to Canon - every camera I've used has similar issues when the shutter speed is slower than, say 1/25, without a tripod. The best solution to this is to manually set the apeture and shutter speed, but sometimes this can be time consuming and you might miss the quick shot.In summary, I've been happy with every Canon camera I've owned, but to me the SD550 is a perfect amalgamation of all the features I've loved from the prior models, without any of the downsides. For $350, I don't think you can ask for anything more out of a camera.", "Date": "April 4, 2006"}, {"Title": "Always going back to Canon", "Author": "J. Luu", "ReviewID": "R14PKUT3C0SKVQ", "Overall": "5.0", "Content": "I've owned 4 cameras over the past 6 years.  Seems like some other manufacturers such as Sony, Casio are coming out with nicer looking cameras every year.  We started with the Canon s110, then 200, then switch to a Casio compact due to the nice compact design.  Speaking only of build quality, there is no other camera in this class that compares to the Canon.  It feels like a solid piece of metal in your hand.  I've dropped our old s110 onto concrete from my pocket...put a dent in the corner...still works fine.  My canon s550 replaces my Casio which died after 18 months.  The picture quality is slightly warm (which is a pleasing characteristic typical of all canons) and very well saturated.  Images are very sharp.  Start up is just about instant, and there is no shot-to-shot delay when using a high speed card.  The LCD is larger and very bright. There was some concern about the LCD screen being easy to break. Before I bought this camera, a friend and I visited the local Circuit City and examined the screen.  We discretely tried to cause it to crack by pressing really hard on the screen (sorry Circuit City).  We were unable to break it.  Those who broke the screen likely severely abused their cameras. Battery life is good for a whole day of shooting.  The menu system and auto modes are best in the business.  If you are in the market for a pocket camera, there is no better investment out there.Update:  I just got back from a family vacation.  The camera works great.  What surprised me is how well the video mode worked.  It's slight choppy compared to a video camera, but more than adequate and the images themselves are fantastic.  With a 4gb card, we were able to fit an entire weeks work of picture and about 10 minutes of video, with room to spare.  Now we only carry one camera for both pictures and video.", "Date": "February 20, 2006"}, {"Title": "underwater use", "Author": "David B. Posner \"diving photo nut\"", "ReviewID": "R1240BY80KCTMJ", "Overall": "5.0", "Content": "I just took this camera to 75 feet.  The underwater mode corrects the colors perfectly.  The flash works well and the underwater case includes a diffuser (underwater photographers know how important this is).  I also accidentally took a 10 sec movie and it came out perfect.  The camera will allow you to edit a movie even before putting it into the computer.  I have had a few underwater cameras and this is easily the best.", "Date": "February 19, 2006"}, {"Title": "BEWARE of memory card selection!!!", "Author": "keith", "ReviewID": "R3MF29TQZ6UHCG", "Overall": "4.0", "Content": "I just received my SD550 an hour ago and proceeded to insert the PQI 2 gig memory card and try it out.  The camera works great but I am suffering from some digital noise in the video clips.  When I use the worthless 32 meg memory card (that comes with the camera) the noise is not present.  I am not sure who is at fault, Canon or PQI.  Beware of what memory card you get with this camera.  Now I have a major hassle on my hands to discover who is at fault, the memory card mfr or Canon.  I am not happy about this.  I thought all SD memory cards were created equal.  Please post here your results with the video record to share what memory cards work and which ones don't.  Maybe I have a defective memory card?  Here comes a bunch of calls to Canon, PQI, and the sellers.  :-(  Not happy.I use my camera mainly to record video.  I have the old Powershot S400 and was very frustrated with it's limit of 300 seconds per clip.  At least the SD550 only has a 1 gig memory limit.  I will need to follow up with another post.I give the camera 4 stars for now, it may be the memory card fault.  I unfortunately got the ugly gold color after the seller promised mine would be silver.  Does it comes in silver?", "Date": "November 17, 2005"}, {"Title": "Fragile", "Author": "leavesinthecity", "ReviewID": "R2MNEK1BCKDNTK", "Overall": "3.0", "Content": "I've broken the screen on this camera twice and I'm not going to bother to fix it again. When it's working it's fantastic for a point-and-shoot, just make sure you encase this in steel if you decide to buy it.", "Date": "November 2, 2008"}, {"Title": "e18 error and camera died", "Author": "C. Lombardi \"Chris L.\"", "ReviewID": "R38HCF6W8DLU5M", "Overall": "1.0", "Content": "Camera died all by itself.  E18 error(well known canon problem) and lens will not work. Do not buy!!!!!!!!!!!!!!!!", "Date": "October 24, 2008"}, {"Title": "NG Camera", "Author": "Norbert \"NAG Camera\"", "ReviewID": "R3V3E4WUBH2LTZ", "Overall": "5.0", "Content": "I think this a great camera.  Easy to use.  This is a second digital camera and the Canon camera is a most better unit.", "Date": "November 5, 2006"}, {"Title": "Nice camera", "Author": "JJP", "ReviewID": "R3SS48HN5YCQAV", "Overall": "4.0", "Content": "It takes great pics and is pretty easy to use!  I recommend it.", "Date": "November 4, 2006"}, {"Title": "BK's", "Author": "BK's", "ReviewID": "R2XP97HFNOI73X", "Overall": "5.0", "Content": "I have found this camera easy to use and the instruction manuel helpful for an old woman who likes to take pictures.  It is easily carried and works well on an acessory strap.I would recomend this camera for those who want great pictures with little knowledge of electronics.  Almost as easy as a \"Brownie.\"", "Date": "July 31, 2006"}, {"Title": "Lens will not close", "Author": "D. Tokhi", "ReviewID": "R2NDT9J5TDE64Z", "Overall": "1.0", "Content": "I loved this camera when I got it.But after three months the lens would not close.  It makes grinding noises,the canon logo pops up on the screen then shuts off again.I am very disappointed in this camera.", "Date": "February 14, 2007"}, {"Title": "Flash works for few days", "Author": "Zia", "ReviewID": "R1YV9ZPIRNKHMH", "Overall": "1.0", "Content": "I bought this camera and flash did not work from the day one. Canon replaced and second camera's flash worked for few day. This camera has problem with flash.", "Date": "September 22, 2010"}, {"Title": "LCD Problems--Beware", "Author": "Amazon Customer", "ReviewID": "R1970V1I7KAHL3", "Overall": "2.0", "Content": "I have a 2 year old Powershot A80.  After 2 years, lines appeared on the LCD and in the pics.  When considering new cameras, the short lifespan of this camera should have steered me away from Canon but after much research, I decided to buy the Canon Powershot SD550.  Was it a good decision?....Powershot SD550--Great picture quality.Consistent Red-Eye when taking Indoor pictures.After 3 weeks, my LCD is cracked.  Wasn't bumped, dropped, or smashed.  Just in its case carried from point A to Point B and it cracked.  I have shipped it off to Canon.  They said they would need to evaluate the camera to determine if the crack was under warranty (translation--most likely not.)  Estimated cost to repair--$100-300.  The camera cost me less than $300.  Ridiculous!Oh, the rep also indicated my problem with the A80 sounded like a sensor problem.  Turns out if I had an A70, they would replace the sensor for free since Canon has determined there are sensor problems with that model.  The A80 is basically an A70 but Canon will not replace the sensor on my model.Summary--I love Canon's picture quality but I will never buy a Canon again.", "Date": "October 3, 2006"}, {"Title": "Great Camera", "Author": "Ross \"Ross\"", "ReviewID": "R3RKFWBXX4F9UG", "Overall": "5.0", "Content": "This is an great camera.  Compact size packed with features and quality.  Professional pictures right out of the box.", "Date": "August 3, 2006"}, {"Title": "Much more than my spectatives", "Author": "Ricardo B. Marx \"Bumerangue.Com\"", "ReviewID": "R3TIBPRCL2K0S5", "Overall": "5.0", "Content": "I'm a happy owner of one S400 model for 2 years. After think in what give me as Christmas gift I decide do one \"upgrade\" at my digital camera.When I receive this gracefull cam I can't believe at the perfect finishment and improvements compared with my old one.My first think is that, if the display are larger than my old one the battery draw faster.... I start with my new camera and this surprise me, almost the doble of the battery time.Everything is fast and the video record is amazing.I love it and recomend,", "Date": "December 22, 2005"}, {"Title": "too heavy, but nice", "Author": "M. G. Leon Moral", "ReviewID": "R1U9DSXFZQBOFO", "Overall": "4.0", "Content": "I previously had the Canon SD450 and it was BEAUTIFULLY SMALL and light. I used to fit my handbag and pocket; it was a pleasure carrying it.  Unfortunately, I lost it.  I wanted to 'improve' buying a 7 mega pixels camera, so I bought the new Canon SD550.  It's design is very nice, LCD display amazing, but it's just too heavy and big compared with my previous camera.  I haven't printed any photos, but I hope the pictures will be far much better than the ones I took with my old 5 Megapixels camera. Otherwise, I will regret having bought this camera.", "Date": "March 17, 2006"}, {"Title": "Canon SD 550", "Author": "Stanley D. Hewitt", "ReviewID": "R37EFN9VIXYPTU", "Overall": "5.0", "Content": "I updated and upgraded from a Canon SD 300 series.  This is a massive improvement on an already top quality product.  We find this to be an excellent machine.", "Date": "January 14, 2006"}, {"Title": "Canon SD550", "Author": "J. Fields", "ReviewID": "R38MYLFANP7NCN", "Overall": "5.0", "Content": "I just purchased this camera. I think it is great. As of today I am still learning to operate it but I have seen no red eye problem, and the color is perfect. This is my third digital camera and it is the best. For a point and shoot small camera I don't think you can beat it. Buy and enjoy", "Date": "November 8, 2005"}, {"Title": "Great camera!!! comes with some annoyances", "Author": "Owen W", "ReviewID": "R1I0XKSPJ6ATA0", "Overall": "4.0", "Content": "This is a GREAT camera. Great manual features, high-res. You can all read about the good things in the specs. I just wanted to tell you the annoying part: the battery doesn't charge in the camera! You have to take it out and put it in the cradle every time you want to charge it. When you travel, you don't just bring a charger like you would with all other digital cameras. You have to bring the whole cradle with it, otherwise you won't be able to charge.Otherwise I love the camera. It's so compact and so great.", "Date": "September 9, 2005"}, {"Title": "Really not what I expected for the price", "Author": "Caitlin Johnson \"Shopaholic\"", "ReviewID": "R18R0Q495KX6FC", "Overall": "3.0", "Content": "I am having the same problems with the PQI Memory card as the review below... so beware. The videos I shot have a lot of static.Other issues I have -You have to not only consider the price but the extras you have to purchase with it.So far I have had to purchase a memory card, case, extra battery, and one of the LCD protectors (I purchased the Da Protector, and it seems like it was a good purchase).The camera doesnt always focus on what you want it to focus on. The pictures sometimes come out blurry. I especially have issues with blurry pictures. I think its maybe because I'm not keeping my hand as still as the camera would like. I wish it had image stabilization. I dont think the My Colors Mode is all that great. It doesnt seem to work all the time. The pictures seem to come out more blurry than in the normal modes. Most the pictures I took at a recent concert came out blurry, noisy, focused on the people in front of me..etc. Not what I expected for my $400.", "Date": "November 17, 2005"}, {"Title": "DON'T BE FOOLED BY ITS COLOR!", "Author": "Miss E.", "ReviewID": "R215CPV32G0620", "Overall": "5.0", "Content": "I have to say that this is by far the best digital camera ever.Also, don't let the other reviewers fool you. The champaign color is very light and almost looks silver. You barely notice that is gold-ish.", "Date": "January 31, 2006"}, {"Title": "Beware the SAND!", "Author": "Bayou Bubba \"A redneck on the bayou.\"", "ReviewID": "R1YB1X7RGB926J", "Overall": "3.0", "Content": "I loved my 550 while it lived, but one tumble in the sand at the beach and it was DOA.  Canon Service sent it back as \"uneconomically repairable\".  I know that sand is bad and after it happened and the camera refused to function (lense would not extend), I put it away until I could ship it off for service.  I did not expect the camera to be totally trashed. My friend's Nikon CoolPix came through a similar mishap with no problems on the same trip.  Now I am off to look for a more robust replacement (read NOT a Canon).", "Date": "July 27, 2006"}, {"Title": "Just Read The Reviews", "Author": "schmecher", "ReviewID": "R2JJKYLFKVKWJL", "Overall": "5.0", "Content": "They're basically all spot on.  Larger LCD screen than the older models.  Slightly larger but just get a PSC-50 case and it'll fit snuggly.  I bought it for my sister and she's been taking millions of pics of her new kid and happy as a clam.", "Date": "May 1, 2006"}, {"Title": "Sloooooow shipping", "Author": "jsternth", "ReviewID": "R423V955I0R8Y", "Overall": "5.0", "Content": "Not sure what robin hood is referring to regarding Dell.  Its listed as $449.  Amazon is still a better price.  As for their shipping, its HORRENDOUS now.  It used to be great.  I ordered this camera on the 6th on dec, said it usually ships within 24 hours, and its just being PREPARED for shipping TODAY (DEC 12th)!!  I guess super saver shipping now means they dont ship it for a week.  I used to get items within 2-3 days.", "Date": "December 12, 2005"}, {"Title": "Great camera!", "Author": "J. D. de Leon \". jd .\"", "ReviewID": "R3LIGQ6755FUIF", "Overall": "5.0", "Content": "Just got this sweet canon SD550, really sweet, great quality picutres, I'm posting some examples, make sure you check them out, I love this camera, it's small, you can carry it anywhere, battery lasts forever (not forever, but you know what I mean...) very easy to use... I simply love it.", "Date": "May 11, 2006"}, {"Title": "I expected more...", "Author": "Adriana/Brasil", "ReviewID": "R33WMS83TTOCI1", "Overall": "3.0", "Content": "3 stars because 1) you can't control the flash light: the camera always decide when to use it, even if you ask for 2) this camera doesn't show you how much battery charge remains: suddenly it's gone 3) That \"shaking\" sign appears even in ISO 400 or automatic mode(??????????). I'm used a manual camera FM2 NIKON and I know it is very different but I still think that this digital camera has a poor software and it is very simple for $300.", "Date": "July 7, 2006"}, {"Title": "I love this camera", "Author": "NicoleM \"NicoleM\"", "ReviewID": "R3OHSAT6DH6U6Z", "Overall": "5.0", "Content": "I love this camera because it fits in my pocket or purse and is easy to use.  I haven't read the entire users manual, but I have figured out how to do a lot with it.  It takes great movies.  The pictures take up a lot of space, so a big memory card is essential.", "Date": "December 6, 2005"}, {"Title": "Canon Powershot is great.", "Author": "Marc Dulude", "ReviewID": "R33QN3BFOUX48W", "Overall": "5.0", "Content": "Its small size allows it to be carried more easily than my other digital cameras so I am using it more.  The pictures have been great and the menus have been very easy to get around so I find myself creating more effects.  Great purchase.", "Date": "March 14, 2006"}, {"Title": "great camera", "Author": "kurund jalmi", "ReviewID": "R2CAWG07TZMVLX", "Overall": "5.0", "Content": "after discussing a lot with my friends finally i purchased this camera. Excellent photo quality. i would definately recommend this camera.", "Date": "July 8, 2006"}, {"Title": "never again", "Author": "jessies \"mom\"", "ReviewID": "R1EWU6LEF0GJIX", "Overall": "2.0", "Content": "bought this camera to keep in my purse for the just in case pictures... what a joke.. first the extended battery  shows as needing to be replaced after being fully charge and just placing it in the camera- so I am forced to use the regular battery that came with it...Next- with the fourth time using the camera (of course at a special event) i try to place the battery in the camera and three pieces fall out from the door- so now i have to pay to send it and insure it to be repaired- turning out to be cheaper to buy a throw away... first and last cannon...", "Date": "October 4, 2006"}, {"Title": "Breaking up is hard to do", "Author": "C. Boyko", "ReviewID": "R3OHL8614OCZSZ", "Overall": "1.0", "Content": "I had the Canon S70 for about 3 years and one day the image sensor broke. The cost to repair it was about $150 or half of the price of the camera when new. I then went with the PowerShot SD550 and after 3 months, the clip that holds the battery compartment shut broke off. Luckily it is still under warranty. Both Canons took great pictures, I took good care of them but they are prone to breaking.", "Date": "March 8, 2006"}, {"Title": "Bad red eye (redeye) problem", "Author": "Avic", "ReviewID": "R3D0OHVCY7MQ7O", "Overall": "2.0", "Content": "This camera has a very bad red-eye problem while taking flash photographs at night.If the subject is NOT looking at the camera, they are guaranteed to get a red-eye even with red-eye reduction turned on.I had to return my camera since the problem was so severe, and its silly to have such a camera and not be able to use it for flash photos. And I dont feel up to the task of doctoring all my photos using Adobe Photoshop...", "Date": "October 10, 2005"}, {"Title": "nice phone", "Author": "RCJ", "ReviewID": "R3RUV6KW276Q8Z", "Overall": "4.0", "Content": "good phone, but not very compact, the other cameras from canon work better and are smaller. the picture quality is ok and it tough taking night mode pictures.", "Date": "January 3, 2007"}, {"Title": "Upgraded from Canon S400 and am very pleased...", "Author": "Nancony \"Nancony\"", "ReviewID": "R1LJ6IN6OB7MOH", "Overall": "4.0", "Content": "Fast, Quality, Bigger Screen.  Excellent.Only wish is that it were smaller, but I realize there is a compromise between size and quality photos......Highly recommend.........", "Date": "January 20, 2006"}, {"Title": "The Powershot", "Author": "Avril K. Ranger", "ReviewID": "R2FVKO7J3EATLM", "Overall": "4.0", "Content": "The Canon Powershot 7.1 mp is a very efficient camera.  The quality of photos is quite good.", "Date": "July 14, 2006"}, {"Title": "Canon SD550", "Author": "Bren V", "ReviewID": "R6O122BX4FW3C", "Overall": "5.0", "Content": "great little camera that you can stash easy in your pocket and go. Lots of different options too.Very Nice!", "Date": "October 31, 2005"}, {"Title": "A bit disappoint at this Canon digicam", "Author": "Steven P. Chen \"Camera Man\"", "ReviewID": "R1SEQPCYZ3C4HR", "Overall": "3.0", "Content": "I bought this camera because I always got good impression and hear good reviews from Canon ever since the SD series came out. I was impressed with the design and the feature of this awesome camera, however, the picture quality was not up to my expectation. A tiny little shake can ruin your picture, I thought Canon fixed the problem in this camera, since this is their latest invention with a huge 2.5\" LCD.But the camera really does pack with tons of features and great functions for one to use. The pic quality was the only thing make me cut 2 stars out.If I'd to buy a camera again, I'd prob. try some other brand.", "Date": "March 31, 2006"}, {"Title": "big dissapointment", "Author": "jessicarabbit", "ReviewID": "R3D0S16UH3UB1I", "Overall": "1.0", "Content": "if you are looking for the good quality picture - do not waste your money on this thing.", "Date": "September 13, 2007"}, {"Title": "Another opinion about color options . . .", "Author": "Marsha L. Mcginnis \"Marsha\"", "ReviewID": "R386P8M91WGNGW", "Overall": "5.0", "Content": "I just ordered mine this afternoon online from Circuit City - right around the corner from our house, and picked it up at the store 15 min. after ordering. ($50 cheaper for online customers). I had read the warning about the dreaded \"Champagne\" color, and low and behold that's what I got. As I gently peeked inside, and removed the white protective sleeve, I was pleasantly surprised. I actually liked it. (My car is the same color :).Although I haven't actually taken any pics yet, I have used and then returned the SD500, which at the time I owned it, was too advanced for my slowly developing photo skills - the pictures were wonderful, but many were overexposed - (my inexperience). And, I was still trying to justify spending that much $$$ for a camera that I didn't understand how to operate, and had no confidence in my future as a (hobist) photographer. So, after three days, back the SD500 went.I am happy to say that I am learning, (and enjoying) the process of discovering new things every day. But, I would like to know where to get the LCD protector??? This is the largest screen that I have seen on a digital camera, and I want to protect mine. Thanks for any info on this subject, even though this may not be the proper place to ask.And, check out this new color, like me - you may be surprised and LIKE it! OR, you may not . . .", "Date": "September 29, 2005"}, {"Title": "Very Pleased with Purchase", "Author": "Amazon Secret Shopper", "ReviewID": "R29WJTHMI3KD6M", "Overall": "5.0", "Content": "I was very satified with the timely delivery and features of the product.", "Date": "February 2, 2006"}, {"Title": "DON`T BUY THIS CAMERA.... problems in 2 weeks", "Author": "Vitor Camino", "ReviewID": "RM9P0ZZHH5EH1", "Overall": "1.0", "Content": "ok.... dont buy this camera... for real... unless you only want to use at home and with the care most of us are not able to give it.... come on, what can you say about a camera wich usb port breaks after 2WEEKS OF USE? and that means downloading pictures 2 or 3 times to the pc... and I`ll tell you what... i`m some thousands of miles away from where i bought it and warranty doesnt cover it. I`ve read what people say about elph line and i agree when talking about picture quality but I`m not gonna buy canon anymore.... NEVER, EVER , EVER, EVER AGAIN.... I was able to use 3 digital elphs.... 1 was my friends sd10 wich colapsed after 3 months of use, the second was my sisters s410 wich gave us problems on accessing the movie mode and manual mode after 6 months of use and finally the sd550 wich didn`t resist 2 WEEKS of use. And I`m not a camera breaker, my nice CASIO EXILIM is with me for 2 years now and i have really few complaints about it even though the image is not as good as canon`s.... when i used to read these reviews i thought the guys complaining were exeptions but its to comon for me the frequency canon give problems so im really not going for it anymore.... really... go for something more reliable even if you compromise a LITTLE on image quality", "Date": "March 16, 2006"}], "ProductInfo": {"Price": "Unavailable", "Features": "7.1-megapixel CCD captures enough detail for photo-quality 15 x 20-inch prints\n2.5-inch LCD display; optical viewfinder; 3x optical zoom\nShoot high-quality movies at up to 60 frames per second with Fast Frame Rate Movie Mode\nDIG!C II Image Processor for faster processing, vibrant colors, and excellent image quality\n16 shooting modes including My Color settings for customization while shooting", "Name": "Canon Powershot SD550 7.1MP Digital Elph Camera with 3x Optical Zoom (Beige)", "ImgURL": "http://ecx.images-amazon.com/images/I/511XH3S5HNL._SY300_.jpg", "ProductID": "B000AYKUUQ"}}