{"Reviews": [{"Title": "A Digital Instamatic", "Author": "John S. Socha", "ReviewID": "RQ5FOM3BB3MVL", "Overall": "3.0", "Content": "If you are reading this after 2011, you are a member of the elite crew, \"CNW\" (cameras nobody wants). \"Members\" recognize that 3, 4, and 5 megapixel used cameras that accept currently available cards are ridiculously inexpensive, as in $1.99 at thrift stores and even online auctions. Many use CompactFlash cards and other SD Cards (NOT HCSD!).This camera is essentially a non-zooming auto exposure and autofocus camera with the equivalent (in 35mm terms) of a 38mm lens. It uses 2 AA cells or the CR3 battery. Rechargeables are recommended, as many older cameras are not as efficient and newer models. (Some older models require 4 cells, which may indicate they are power-hungry.)With the exception of a button to control the flash, there is a refreshing lack of \"scenes,\" \"modes\" and manual overrides.  Exposure compensation is available via an on screen menu, as is a self-timer, date stamp and macro setting. Missing is a color selector, so if you want black and white or sepia, do it with software later.  Again, there is NO optical zoom, so if you want other than slightly wide views, forget it.The lens is a quality all-glass Retinar model, which explains some of the image quality. Many cheaper no-name brands skimp in this area with poorly assembled plastic lenses.  The lens aperture is not marked, but I suspect it is the f/3.5 to f/5.6 range, making available light shots tricky.  There also appears to be no ISO setting.]Image quality can be adjusted, but the \"best\" setting is recommended now that 1 GB are cheap (but getting harder to locate!).The camera is as close to Grandpa's Instamatic as you are going to find in  digital camera, complete with an OPTICAL finder and the ability to turn off the screen when it is not needed for composition.  The perfect camera for the person who does not want to know about digital photo gadgetry and is going to take the SD card in and have prints made.Do note that the camera has a two-step shutter button.  A half press focuses and sets exposure while completing the press takes the shot. I paid a premium price of $7.99 for my camera, as it was in good shape.  Join me on FB by searching for ACPress", "Date": "November 4, 2011"}, {"Title": "Piece of junk", "Author": "Disgusted", "ReviewID": "R3PGU6MDLIAGMC", "Overall": "1.0", "Content": "Camera seemed to be ok on the outside, but when I went to put the batteries in a piece of the camera broke off.", "Date": "December 10, 2011"}], "ProductInfo": {"Price": "Unavailable", "Features": null, "Name": "Kodak EasyShare CX 4310 - digital camera ( CM44809 )", "ImgURL": "http://g-ecx.images-amazon.com/images/G/01/x-site/icons/no-img-sm._V192198896_.gif", "ProductID": "B000BAV4N6"}}