{"Reviews": [{"Title": "How can something this small take such great pictures?!!", "Author": "Dylan Capener", "ReviewID": "R2XRZ934422WFK", "Overall": "4.0", "Content": "Why I got this camera:I have a 1 year old, and the shutter lag of my previous digital camera made it near impossible to capture those fleeting moments.  The 1/2000 of a second shutter speed of the Optio S6 ensures that I get the shot, the tracking AF feature (continually detects both horizontal and vertical movement of the main subject and maintains focus) ensures it is in focus and the extremely small size ensures I actually bring it with me.Pro's:-Extremely small 6 megapixel with 3x optical zoom-Decent button layout on such a small camera-LCD screen with great clarity and color, viewable even in bright sunlight-Produced perfect photos in the following environments:**indoor****stationary object****moving object****Natural lighting****Tungsten/Fluorescent lighting**nighttime**outdoor sun**sand and water w/sun-Spot focus, area focus and tracking focus all produce expected results and function well in a variety of lighting (even has a focus assist light for shooting in darker areas).-Panorama assist function is a great idea and produced a beautifully lined up panoramic shot.-Really good quality true 30fps movie mode with effectiveanti-shake-In camera movie editing features work well-Voice memo function is a \"nice-to-have\" and works well-In camera slide show function is a nice way to share/review your photos when you're on the road.Cons:-You definitely need more than one battery as the included one will only last about 160 photos w/flash (which is only ~3/4 the capacity of a 512MB SD card).-Doesn't come with A/C adapter (battery charger only)-MPEG-4 DivX movie output isn't compatible with Quicktime/Mac's without searching for 3rd party codecs or alternate players (movies import into iMovie HD without sound)-Due to the small size, buttons and camera may not be a good fit for people whose hands are referred to as \"catchers mitts\", or \"sausage fingers\" or other such hurtful (but perhaps accurate) adjectives.Take home message:My wife and I love this camera.  It is small and light, takes GREAT pictures and has all of the features you could want in a digital camera (without any of the bulk).  This is my first foray into the Pentax digital shooters (I've own(ed) Fuji and Canon digital and film camera's prior), and if this is any indication, they've got some great products.  I'm so impressed with this one that I am considering getting an Optio WPi to take out in the water with me.", "Date": "November 1, 2005"}, {"Title": "Pentax Optio S6 Comparatively", "Author": "C. Harper", "ReviewID": "R3RPBKM5ZAC2V2", "Overall": "4.0", "Content": "The Pentax Optio S6 is a great camera for its size.  I own the original Optio S and the little \"nub\" that controls most of the functions finally frustrated me into looking for a new camera.I went into a local retailer thinking I would upgrade to another ultracompact, but not really expecting to buy the latest Pentax.  I compared the Canon PowerShot SD400, Sony CyberShot DSC-T5, Nikon CoolPix S3, Pentax Optio S6, and Casio Exilim EX-Z500.The contrast that struck me the most was screen resolution on the camera displays.  Both the Sony and Pentax had over 230,000 pixels on the 2.5\" screens and they were far superior to the Canon, Nikon, and Casio (with approx. 120,000 pixels each).I tend to leave my pictures on a 1GB card for a long time and show them off from the camera, so screen resolution was  important.  From reading numerous reviews, it seems the Canon and Nikon offer the highest quality pictures overall, but the low screen resolution was very noticeable on these large displays.Otherwise, all the cameras started up very quickly and were easy to use as a point-and-shoot camera should be.  I chose the Pentax over the Sony because it was easier to hold and my finger kept getting in the picture with the Sony.  Also, the Pentax still fits in the altoids tin!I've used the Pentax for a week now and I'm very happy with the picture quality, incredibly small size, and ease of use.  The battery life is average for an ultracompact and the picture modes actually work well.I give it four stars instead of five because it only has 6 stops on the optical zoom.  I definitely recommend the Pentax Optio S6 if you're considering an ultracompact camera.", "Date": "November 4, 2005"}, {"Title": "Nice form factor, but flawed", "Author": "King Of All Gadgets", "ReviewID": "R2NR99SW72A7NE", "Overall": "3.0", "Content": "I bought the S6 to replace the original Optio S, which I accidentally dropped.  I also considered buying the Casio EX-S500, which is said to have faster shutter response, good quality photos and better battery life, but requires a dock for all its connections and has a smaller screen.Since I already had an extra set of accessories (battery, charger, etc), I took the plunge on an S6.  My take so far:Pros:- great form factor- intuitive menus- full screen, unlimited movie mode (can't zoom during it, but only a few photo cameras permit this)- Large screen - 2.5 in- lots of scene options and manual controlsCons:- Poor battery life - not close to the 130 photos promised- Absolutely dumb shutter button design - it's actually hard to take a photo without pressing really hard.  Most presses just result in the auto focus activating, but no photo.- Shutter Lag - assuming you do press the dumb button properly and it does take a picture, there is definitely a lag.  This is similar to my old Optio - they should really have perfected this by now - how embarrasing.- Viewing photos takes forever!!  Apparently, the camera has a very slow processor, so when you want to view your photos, it first shows a semi-blurry image then....finally...the full resolution image.  I wouldn't mind it as much, if you could advance to the next image during all this.  You can't.  You have to wait and wait for the full resolution photo to finally appear.- Only average photo quality.- Autofocus slow in standard mode (wider area).  The instruction manual won't tell you this, but if you reduce the focus area, performance and shutter lag decreases significantly.  Not intuitive.  Also has a quick, but grainy Pan-Focus mode.Conclusion:I can (and plan to) live with the flaws of this neat looking camera; however, I can only imagine the headache when I ask someone else to take a picture with it and I have to explain the dumb shutter button 10 times.  I would strongly recommend checking out all of the cameras you're considering in person before ordering to ensure you can live with the lags, screen delays, etc.  Generally, I would recommend Canons, which take consistently great pictures and don't suffer from these kinds of design flaws - except for one.  Canons have only uncompressed movie modes, which means the memory will fill up within a few minutes.  Once their cameras get MPEG-4 movie compression, I am there.", "Date": "December 3, 2005"}, {"Title": "Very good camera and great price", "Author": "Michael P. Bean \"Hippolyte\"", "ReviewID": "R24M5ZTO0FC7IV", "Overall": "5.0", "Content": "WHAT I LIKE:1. It  fits precisely inside an Altoids tin. Why does this matter? Because I keep my camera in my pocket and I've had problems in the past with pocket zoom cameras accidentally getting switched on in my pocket. When that happens, the zoom lens extends but it can't and then the mechanism breaks and the camera is out of commission. With the camera inside the Altoids box this is unlikely to occur. And the box camouflages the camera, possibly making it less likely to be stolen.2. It has a very large screen on the back, makes it easy to compose shots and works well for viewing results.3. It takes MPEG4 videos. MPEG4 is a great compression algorithm which means that I can store about 40 minutes of video on a single 1 GB SD card. Other MPEG4 cameras cost a lot more than this one. Also it can take 640x480 video, which is better than most small cameras.Another reviewer claims that a DivX logo appears on all videos. This does not happen for me. Probably that reviewer is using a MPEG4 player that has a logo in the corner. This camera is actually a great, low-cost video camera.4. 6 megapixels, for what they're worth. I don't believe that more megapixels == better camera but sometimes more is useful. For example, you can use the extra pixels in brigh daylight as a digital zoom.PROBLEMS:1. You have to take the battery out of the camera to recharge it.2. The battery charge doesn't last super long, but it's long enough for me.CONCLUSION:This camera is an extremely good value. The other MPEG4 cameras that I was comparing this to cost over $400. This one was just a little more than half that price. When I lose or break this camera, I won't feel as badly about replacing it.", "Date": "April 20, 2006"}, {"Title": "SD limitation?", "Author": "Anh", "ReviewID": "R3NLKJX22M2QWU", "Overall": "3.0", "Content": "So I bought this as an X-mas present for myself. I've own an Canon SD100, 450, 600 and Casio EX-Z60 so I'm totally not a newbie to the digital world. I'm not going to repeat with others have stated in this review.I'm really impress by the Optio S6 form factor; it really is compact. The response is quite quick turning on/off, zooming, viewing captured pict/video.After playing with the camera for several hours, I was really disappointed in the following areas:  -  temperature; the camera get warm/very warm (cool, warm, very warm, hot) after 1.5 hrs of continuous use  -  continuous rapid shooting was slow; I was getting 1 pix every ~1.8sec  -  can NOT read 4gb SD; I tried two different 4gb SD card I had laying around (PQI & Ridata) and received an \"memory card error.\" All of my other cameras (even my 3 yr old Canon SD100) was able to use it just fine.  - the usb cable is propriety; why can't Pentax use a normal mini usb?In sum, I like the camera size and its ability to record video in Divx format. The Divx function was the main impetus for purchasing this camera, but the SD limitation negate all the benefits the Optio S6 has to offer. I'm going to see if there's a firmware update (Pentax doesn't list one on their webpage) and report back here.**update** so I received confirmation from Pentax Tech Support affirming my initial conclusion of the sd limitation. Indeed the maximum sd the Optio S6 can only read/write is a 1gb memory.", "Date": "December 21, 2006"}, {"Title": "You'll love the S6", "Author": "Lymphoma Survivor \"11 years :-)\"", "ReviewID": "R3K63DIG0NO5E9", "Overall": "5.0", "Content": "Other reviews give some of the pros and cons - I'll expand on them.I will assume you are looking at this camera because you want a very small but feature laden shooter.  This camera will not disappoint in that respect.  It is actually the only one I found that can be held with one hand - the nubs below the zoom allow this where other small cameras have controls all over the back, disallowing one handed operation.You can overcome some of the cons listed by others by buying a fast (100x to 150x) SD memory card (I got a Corsair 2GB 133x card).  The prices are coming down thank goodness.A unique feature is the ability to use a remote control for zoom and shutter activation.  I liked this in a Pentax film camera I bought 10 years ago.  I thought I'd have to buy a modern version but I retrieved my old remote, set the S6 into remote mode and it worked!  I amazed my friends on a recent trip with this.The rear display also is bright and clear (also impresses others).You'll definitely enjoy this camera.  And it's size and weight will not drag you down - you'll be tempted to take it more often, allowing you to capture those moments when a grainy phonecam can't.", "Date": "December 11, 2005"}, {"Title": "OK basic, point-and-shoot pocket camera - but buy an extra battery", "Author": "Nick Damato", "ReviewID": "R1YL576J9OOHQU", "Overall": "3.0", "Content": "I bought one of these slightly used, because I got a great deal on it and wanted a small camera that would easily fit in a shirt pocket or on a belt without being cumbersome. It was in very good shape, there was not a scratch on it.  The camera takes decent pictures, but I found it lacking in several areas.1. SHUTTER LAG - is bad, close to 2 seconds depending on how you're using the camera. It's, especially 'laggy' if you are using any of the automatic modes and a flash.  I'm constantly missing pictures with it because of this.  In that respect the camera is better for taking planned/posed pictures of fixed objects. Not good for quickly pointing to and picking out quick, sudden action shots where you don't have time to set it up before hand. The lag is a little less in the manual/ semi-manual modes.2. BATTERY LIFE - is limited.  The camera eats batteries like nobody's business. The person I got the camera from had only had it for 3-4 months.  I don't know if it's a bad battery or they charged it too many times or what. For example, when I'm at a gathering and I'm sitting there panning around looking for candid shots, and reviewing shots to delete and save, the batteries run down pretty quickly. I barely got 2 dozen shots in a couple of hours at a family gathering recently. So, I HIGHLY recommend getting a second battery, which I just ordered.  This is a problem with all cameras that have only a video viewfinder and no optical one.  If you have to have the LCD screen on all the time to take picutures, then the manufacturer should include a decent-sized battery!  By comparison, the heftier battery for my Panasonic LUMIX DMC LX2, which is just a little larger camera, lasts 2-3 times as long under the same conditions.3. THE LENS ... is mediocre at best. Unless you need to crop your pictures heavily, There is no reason to bother taking any pictures larger than about 3 MP because this lens cannot resolve them adequately.  I did a side-by-side comparison with my Panasonic Lumix, with a Leica lens taking pictures of lettering on a sign at several distances up to several hundred feet away, and you could clearly see the difference beyond 3 MP. I could not read the letters with this camera (cropped at 4 - 6MP) when I could still easily read them with the Leica lens. Part of the issue could be the noise reduction engine, I'm not sure.  Anyway, I use 3 MP at the highest JPEG setting 98% of the time and find it works OK.4. THE FLASH MODES - are kind of clunky. I kept setting up different automatic modes with various flash settings that worked best in a given lighting, however, when I turned off the camera (to save batteries) my settings were gone when I turned it back on and I had to go through the menus to restore them. Therefore, I recommend that you learn to use the manual, or semi-manual modes for best results.VIDEO - It does do video, but since this is not a really a \"video camera\", I'm not going to complain about the video.THE PROS1. AUTOMATIC MODES - Most of the automatic modes work pretty well under a reasonable range of conditions. I recommend testing them to get used to how they work.  I still prefer to tweak them a little when setting up a shot.2. FLASH MODES - The camera offers several flash modes, including a \"soft flash\" that ia pretty nice for a $200 point-and-shoot pocket camera.3. PICTURE QUALITY - Even though the lens is not the greatest, this camera does take better picures than most other inexpensive cameras in its class that I've seen and used.  The color noise is not too bad either, but as noted above, I think it has some rather agressive internal noise reduction that causes loss of detail, particuarly at mid to low light levels. The automatic white balance settings for different lighting conditions (fluorescent, etc.) are pretty decent.  Don't skimp on \"picture quality\" settings to save memory.  Memory is cheap enough now that you should always use the least amount of compression on your photos.4. SIZE / EASE OF USE - The camera is a very nice compact size, and is relatively easy to use with a short learning curve for most of the features. It easily fits in a shirt pocket and is easily worn on a belt.", "Date": "December 31, 2006"}, {"Title": "S6 - small & beautiful", "Author": "Joost", "ReviewID": "R1L47HNGQKF1V0", "Overall": "4.0", "Content": "I have to admit I bought this camera purely based on various internet reviews. Started experimenting with it and was utterly impressed & amazed. In '98 I obtained a Canon S20 which still works and served me just right. Price back then: about one thousand (!) Euros. But after 8 years had the impression it was a little..ermm..bulky. Time for a new camera, my fellow readers! Technology has made a giant leap forward I must say.Nice feature - this camera fits exactly in a metal Altoids box (Height: 9 mm!). Worth a try using for a camera bag - you'll definitely impress your friends and next of kin.Excellent 2.5\" (big!) display  easy to handle, professional look. No less than 6 megapixels (as compared to the 3.5 of my S20!) The patented \"sliding lense\" technology provides a lense consisting of three parts. Looks & works just fine.Movies are recorded in AVI-format with MPEG-4 compression and can be played back using Divx. More cameras should use this compression algorithm. TV playback of pictures & movies by using a cable.My Toshiba laptop handles the SD memory card without any problem. I would suggest not connecting to the camera by using the USB cable provided, but try a (USB?) memory card reader instead.Conclusion:Thanks Pentax for providing this amazing machine for about one third of the costs I am used to. Comes highly recommended when a small yet easy-to-use camera is needed.", "Date": "August 11, 2006"}, {"Title": "The Optio S4 was MUCH better...", "Author": "A. Barnett \"Jazzy\"", "ReviewID": "R1VB0SOBPW56WS", "Overall": "2.0", "Content": "I have both an Optio S4 & an Optio S6.  I spend most of my time out at night.  Concerts, clubs, raves, etc.  The Optio S4 took AMAZING low light & night setting photos.  The Optio S6 fails miserably at them.  Even in situations where all stage lights are on and the room is well lit, you must repeatedly hit the button to even get it to try and take a picture and half the time the photos come out blurry.I must say, however, in daylight & very well lit scenarios it does take great pictures.  But it does not suit my nightlife purposes.", "Date": "September 2, 2006"}, {"Title": "Great little camera!!", "Author": "Thomas O. Lee \"thomasoboelee\"", "ReviewID": "R2OU3SC8EG7MMD", "Overall": "5.0", "Content": "I bought this camera because I heard that it fits into an Altoid box.  It does.  So, I carry the camera around in the little tin box in my bag.  It never fails to amaze!!!The other reason was the price: $279.94 at Amazon and free shipping.I had a Canon Powershot S50 for a couple of years but it is twice the size of the Pentio S6.  I gave the Canon to my wife.", "Date": "February 24, 2006"}, {"Title": "Best little camera", "Author": "Joan French \"world traveller\"", "ReviewID": "R125N158XDCVSL", "Overall": "5.0", "Content": "This Pentex was my first digital camera.  I used it exclusively througha European trip and was extremely happy with the results of all my photos.I always carry 2 batteries with me, both charged fully, since I take pictures of everything now.  You'd be amazed what you could do with sucha small camera.  Perfect picture clarity.", "Date": "July 1, 2009"}, {"Title": "The smallest, highest quality digital camera I've owned!", "Author": "Miss Jetsetter", "ReviewID": "RKQ2XIHMA40TO", "Overall": "5.0", "Content": "I decided to buy this after comparing all of the other ultra-compact digital cameras, and found this was the smallest one. My boyfriend also had the S5 version, and absolutely loved his-- he has sworn never to buy another brand other than Pentax.Needless to say, I have been SO impressed with this camera! The picture quality is second to none-- I honestly would have guessed the quality of pictures to be taken from a 10 MP camera, not a 7 MP. They are colorful, clear, vibrant-- I feel as though I could reach through the pictures and touch the actual objects.A+++!!! Pentax is the best!", "Date": "January 19, 2008"}, {"Title": "Not Worth It", "Author": "R. Massey", "ReviewID": "R1RBW1CELUM3NW", "Overall": "1.0", "Content": "I had owned the Optio S4, and it was a great camera.  So when the Optio S4 went, I thought I would upgrade to the Optio S6.  What a mistake.  I should have researched more.Quite simply, 2 out of every 3 pictures is out of focus.  It takes forever to take a picture, and forget about taking pictures in low light.I hate this camera.", "Date": "December 15, 2006"}, {"Title": "ok camera-WARNING Pentax is a horrible company", "Author": "xfontx", "ReviewID": "R26IO71FVARQTM", "Overall": "1.0", "Content": "Bought this camera to take pics of my new son. Had the camera a couple of days and the lens stopped retracting. Sent it in (under warranty of course). Pentax told me it wasn't working because it got wet. The camera was never even near water and was always in the case when not used (for about 3 days). I was taking a photo of my sleeping husband and son when it happened. I did some research and found numerous other people who complained that Pentax did the same thing to them. They lie so that it is not covered under warranty and you have to pay the couple of hundred dollars to get your camera back! Very poor way to do business. Would NEVER buy from them again.", "Date": "October 21, 2007"}, {"Title": "Good and Not so Good", "Author": "Joyce N. Burke", "ReviewID": "R2TPQSHYAW3QWF", "Overall": "3.0", "Content": "Many great features.I think some are unneccessary,But they are there.Slow shutter release is very poor,On a small camera it can cause a lot of blured Pictures.Short battery life is not to cool,But after Market Batteries at a good price can cure that.I would get a model with anti-shake feature if I were buying now.All in all a good camera.", "Date": "November 3, 2006"}, {"Title": "Excellent camera, but.......", "Author": "David L. Manske \"aikidokat\"", "ReviewID": "R380AD7KPYQ6NT", "Overall": "4.0", "Content": "I am very pleased with my camera...Its a great travel size, has plenty of resolution and battery life; however, it has some problems focusing in low light situations.", "Date": "February 23, 2006"}, {"Title": "Awful camera", "Author": "L. Nay \"Mommy2Joshua\"", "ReviewID": "R3IVX12YX0YHRM", "Overall": "1.0", "Content": "My husband bought this camera for me for Mother's Day last year.  We just had our first child and wanted something real small to fit in the diaper bag.  Being small is pretty much its only good feature.  My husband and I are so so disappointed in this camera.  I prefer pictures without a flash, but even in a well-lit room this camera can't take a single picture without the flash.  They ALL turn out blurry.  I end up taking 10 of the same shot just to SOMETIMES get one good one!  And it's not user error...we went back to the store where we bought it to ask if we were using it wrong or if there were some settings that needed to be changed.  We had it on the fastest shutter speed and we were told we're using it correctly.  So, the only way I can get a good picture out of this camera is outside where there's PLENTY of daylight (not dusk or dark) and when I use a flash.  I hate the photos taken with the flash though because they're so washed out.  Anyway, this camera is pretty much only good for mid-day pictures.  Other than that, forget about it.p.s.  The battery life REALLY stinks too!", "Date": "January 11, 2008"}, {"Title": "I really wanted to like this camera", "Author": "P. Oh", "ReviewID": "R3GVTZXXWPCEL8", "Overall": "2.0", "Content": "I have a Pentax *ist DS Digital SLR I like and I have fond memories of Pentax so when it came time to replace my Canon S400 I looked at their line of ultracompacts and selected the Optio S6. On the surface things appear good - very small in size, a nice quality brushed aluminum exterior, 6MP of resolution, and a large 2.5\" LCD. However once you look past the exterior things get a little dicier. First and foremost the Camera is slow - not stick your head in the sand - wish you were somewhere else 'slow' but i would not describe the operation of the camera as snappy in any way. It's slow in between taking pictures and particularly slow in reviewing them. Its frustrating tapping buttons and the camera takes its sweet time sorting things out. On a slightly minor note the camera uses a proprietary mini-USB cable (just like the *ist DS) - Why Pentax Why? I have so many mini-USB cables lying around if i lose this one i have to buy your expensive one in addition to the zillions i own and manage J.A.F.C (Just Another Fricken Cable). My Razr phone has a standard mini-USB port and its a lot smaller than the S6 so Pentax could have found a way to incorporate it. To add insult to injury the proprietary usb port was very difficult to insert the cable into. After a few inserts it was beginning to separate from the camera body - bah, this stuff should be second nature by now! However the biggest fault of this camera is that the battery life is terrible. After taking a few dozen shots  and getting moderately familiar with the operation of the camera the battery shut down completely without much warning. Now the value of a camera as small as this is it's always available nature - you want it with you so you can capture that shot you don't want to lug your SLR around for. So while you can slip it in your pocket and take it with you its no good if the battery is dead! So overall I am returning the Pentax and looking at other models which promise good performance and long battery life. If i could mention some bright spots for this camera it would be its very small size, large, clear LCD and simple but comprehensive software but they can't make up for the poor battery life and slowness of the camera in my opinion.", "Date": "July 8, 2006"}, {"Title": "Poor Camera", "Author": "John S. Smtih, Jr. \"Johnny S.\"", "ReviewID": "R2HSE2GJX8LWO3", "Overall": "2.0", "Content": "Very poor quality pictures that look as if the focus doesn't remain constant, with people standing in a group! I have sent them back for a refund. Veryt dissatisfied.Johnny Smith", "Date": "August 25, 2006"}, {"Title": "Movie mode is a distaster", "Author": "Troy T. Gustafson \"Tavis\"", "ReviewID": "R5DFJFMZHLJGA", "Overall": "1.0", "Content": "Don't buy this camera unless you want to see a DIVX logo in the bottom right hand of every video you shoot! Unbelievable!  Everything else about this camera is good except the small buttons and the stupid DIVX bug.", "Date": "February 9, 2006"}], "ProductInfo": {"Price": "$379.95", "Features": "6.0-megapixel CCD captures enough detail for photo-quality 14 x 19-inch prints\n3x optical zoom; 2.5-inch LCD display\nStylish, ultra-compact body with an aluminum alloy exterior measures just 3.3 x 2.2x 0.8 inches\nQuick response with an approximately 0.01-second shutter release lag time\nStores images on SD memory cards; powered by one rechargeable Lithium-ion D-LI8 battery", "Name": "Pentax Optio S6 6MP Digital Camera with 3x Optical Zoom", "ImgURL": "http://ecx.images-amazon.com/images/I/516Z7Q2T0BL._SX300_.jpg", "ProductID": "B000ARG4IK"}}