{"Reviews": [{"Title": "The EasyShare Flagship...", "Author": "S. Reddick \"sredd68\"", "ReviewID": "R37NH3M3G85K10", "Overall": "5.0", "Content": "This is the best of the current line of EasyShare cameras. The 8 megapixels, RAW, Manual Zoom and Focus rings. I've been using this camera for the past two to three months and I have to say it's one heck of a camera. This camera is read to go almost as soon as you turn it on because it's manual zoom there's no need for the camera to run a check on the zoom motor. That check delays the readiness of most zoom cameras. It has multiple scene modes and the PASM manual modes plus three C (custom modes) in which you can save your favorite settings. It also has an improved video mode. This camera even has a \"Bulb\" mode (this is where you can set how long the shutter stays open by holding the shutter button up to 60 secs, helpful when the 16 maximum programmed shutter opening isn't long enough). It has a hotshoe for an external flash gun (P20 Zoom Flash) which gives you more flexibility and power when the ambient light and the onboard flash isn't good enough. Kodak has placed buttons on the back and top of the camera that control the most of the main functions of the camera with out having to bring up the main menu and search for them, they are White Balance, ISO, Metering, Flash, Focus, and Digital Zoom.  This camera has so many options that I could spend the next hour writing about them. I really recommend going to the Kodak website and checking out the specs.Let's get to the most important feature of this machine...the pictures. The quality is very good, the lens captures a lot of detail and is really sharp. My wife and I just had our second child, I brought the camera to the hospital and took some pictures of out newborn, some color and some black & white, they came out so well that we didn't order the usual hospital photos. The results were so good that when visitors come to our home they find it hard to believe that the photos were not professionally done. I've also taken landscapes and macros with this camera and I must say I have not been disappointed yet.Now for the bad news... The auto focus sometimes hunts in low light and low contrast situations which is not really a major problem because you can just turn the manual focus ring and adjust it until you're satisfied. There's a lot of noise over ISO 200 (can be corrected with a good noise reduction program i.e. Noise Ninja) and you only have ISO 800 and 1600 at 0.8 megs setting, which is really only good for the web. Slow write times for RAW and Tiff modes and the camera is pretty much inoperable while the camera writes to the memory card. No burst mode when shooting RAW and Tiff modes.All in all this is one of the best cameras out now. It's really a flexible piece of equipment and a very capable backup for DSLR users that have tired of carrying all the extra equipment that goes with owning a DSLR. It is also a very good camera for those not quite ready to make the jump to a DSLR but find they are ready to spread their photographic wings. I recommend it wholeheartedly. Check out the customer images (most of them are mine), very little or no post processing...judge for yourself!****EDIT**** Kodak has recently released a firmware upgrade for this camera that decreases shutter lag, improves the auto focus and exposure and adds a pixel remapping program to remove any malfunctioning pixels on the sensor. I upgraded mine and I highly recommend anyone that owns this camera to do the same. It makes a world of difference in its operation.", "Date": "February 22, 2006"}, {"Title": "I Am Pleased With This Camera, But...", "Author": "Terri L. Doney", "ReviewID": "R13I1OJJWK7FEW", "Overall": "4.0", "Content": "It takes beautiful pictures, sharp, gorgeous color, etc, but it is darned slow to write the higher the resolution.  Forget writing in Tiff and Raw if you are taking any pictures that need a fast write speed.  Tiff and Raw are only good for portraits and nature.  This is not the camera to chase the little ones around with, but my son is now 9 so not much chasing is going on.  It is a wonderful portrait or landscape camera though and that is what I purchased it for.  It can go all the way down to 1/4000 shutter speed which is excellent, but I am still playing with it in low light situations.  It is nice to have an understanding of how cameras work, and when you do, you can use this to it's advantage.  It is a nice alternative to dSLR's where you spend more for the lens than the body.  I can't justify that at the present time as this meets my needs.  I do also have a very fast Minolta Dimage Z2 which my son now uses in case we need something with speed.  If you are chasing little ones around, you will not want this camera.  If you take mostly portrait, landscape, flowers and such, you will love this camera.", "Date": "February 17, 2006"}, {"Title": "It should get 4.5 stars, but I wasn't given that option...", "Author": "1RunningMama", "ReviewID": "R3GCZMA4FP0094", "Overall": "4.0", "Content": "There are many PROS to this camera:- Kodak quality color (the BEST out there)- 24mm wide-angle lens (great for more creative pics)- 8MP and TIFF and RAW formats- Li-Ion rechargeable battery (no more AAs)- Hot shoe flash attachment (see CON about the flash)- Fully manual options (good if you're a photography enthusiast or student)- Lens has optional adapter to attach additional lenses- The camera even takes video!- DSLR features but much smaller, more convenient size.- I purchased this camera online for only $399 - you can't get all these features for a better price!And now for the CONS:- SERIOUSLY SLOW WRITE SPEED. This was a SERIOUS issue for me. I realized that after I would take a picture, the camera was temporarily inoperable because it was writing the picture to the memory card. A \"in progress\" message would come on the screen and I was forced to wait - sometimes up to 8 seconds - before I could take another picture or review the one I had just taken. I was about to return the camera because of this. But I downloaded the recent firmware release from Kodak - write speed got a tiny bit better. And then I purchased a pro-quality super-fast secure digital memory card: the SanDisk Extreme III. I found it online for $70 and it makes a WORLD of difference. Don't buy this camera without that memory card!!- The pop-up flash isn't positioned high enough. My pics usually have a darkened area at the bottom. Hot shoe flash attachment would solve that issue though.- One last minor con is that the LCD screen could have more pixels. It's size of 2.5 inches is great but a csreen that size should have more pixels. The images on the screen look a bit grainy.All in all, I LOVE this camera. If the cons I mentioned above were fixed, it would be the perfect camera  for me.", "Date": "June 30, 2006"}, {"Title": "Excellent Image quality for price", "Author": "Joseph L. Kashi", "ReviewID": "R3ASU4MWYCD0BO", "Overall": "5.0", "Content": "I have taught photography at the college level, shoot 4x5 view camera work on occasion, and am very demanding about image quality.  I am quite satisfied with the image quality from my Kodak P880, particularly after I installed the newest firmware upgrade available from Kodak.I went through several 7MP to 8 MP cameras before finally getting the Kodak P880.  The P880 has better image quality than some high end Sonys and Olympus 7-8 MP cameras like the DSC-V3 or the SP350.  I tested the P880 against the even higher end 10.3 MP large sensor Sony R1 and the difference in image quality in a 13x19 print between the P880 and the R1 was barely perceptible after minor sharpening and noise reduction, which the P880 images accept particularly well.  The zoom lens has a very useful range and is generally pretty sharp throughout its range.  Balance, manual controls and features feel high end and adequate for most semi-professional needs.  The camera is a little slow processing and storing pictures in RAW format and exposure bracketing modes but that really doesn't bother me because I do mostly landscape and fine art photos.  RAW file format is directly supported by most versions of Adobe Photoshop and Photoshop Elements as well as most other RAW processing programs like Picture Window 4.  Unlike most sub-$500 cameras, the P880 uses regular screw in haze and polarizing filters, a real plus and it has a highly controllable hot shoe.  Manual focus is usable and manual exposure control works well.  The direct mechanical zoom is also nice.Overall, the P880 is a digital camera that can either be a high end point and shoot SLR-styled camera or one that can be used as fully manually as the most classic 35 mm film SLR.Although not small enough to slip in a pocket, the size is still reasonable and light.", "Date": "October 11, 2006"}, {"Title": "Great Camera for the money", "Author": "D. Vaughan", "ReviewID": "R22OKOYEYNE1FO", "Overall": "5.0", "Content": "I bought this camera for my work.  I'm an architect and I was looking for a camera with a wide angle lens for interior photography with a budget that wasn't going to break the bank.  I had looked at the Kodak V570, which had a 23mm fixed lens and I was seriously considering it but was concerned about the durability and reliablilty (it seemed fragile).  Then I stumbled across the Kodak P880 (Kodak should really do a better job of advertising their cameras), which is comparably priced to the V570.  This camera is the next best thing to a digital SLR, and has many of the same features.  My wife has a Canon Rebel XT, which is a really great camera, and the P880 gives it a really good run for the money with regards to features and picture quality at about half the price.  I've had this camera about a week and have been putting it through its paces and so far I have been very happy with the results.  I would recommend this camera to anyone thinking of getting an digital SLR but is hesitant about the SLR price.", "Date": "September 6, 2006"}, {"Title": "Great camera for the price!", "Author": "S. Pick", "ReviewID": "R1QW1SBK6IB3SI", "Overall": "4.0", "Content": "Bought by P880 about a month ago. I am a sem-pro outdoor adventure photographer and I use Nikon 35mm film equipment for the most part. I shoot slide film on my F90s Nikon. I had a 5mp Kodak digital camera but wanted to upgrade to a better digital camera but I could not justify buying a Nikon D50 or D70s as they are only 6mp. And I didn't want to drop 2 grand on a D200. So I looked in the mid-range camera lines. After doing MUCH research, I decided to buy this camera. So far I am happy I did. I have taken it hiking several times, enough that I know its a good camera but of course its a toy compared to pro Nikon film cameras. But I knew that when I bought it. I wanted to have a good camera to take lots of \"documentary\", \"fun\" and \"travel\" shots. For the really powerful stuff I will still shoot slide film. But its too expensive to shoot with extensively!Here's my initial impressions based on the perspective of an outdoor photosgrapher:The Good:1) Fairly easy to hold as its tall and has an actual grip.2) Lightweight (but of course at the expense of impact resistance I'm sure...)3) Great set of manual controls! This is the best part. Autobracket is good as is the interval timer which is great for self-potraits. You can walk far away from the camera and get yourself in the shot (great for solo hikers).4) Large 2.5\" LCD makes it easy to check out your photos5) Image quality seems pretty good (although not comparable to a high-res. scan of a slide).6) The manual zoom is great! Much better than power zooms in almost all other cameras.7) The 24mm focal length is simply amazing! Great for landscapes and outdoor adventure shots.8) The battery life is great. Shot 250 or so pics on a full charge and that included a lot of playing around with the menus, reviewing photos, etc. I just boughta second Kodak battery on Amazon for $16!9) Built in flash is pretty powerful and you can add a shoe mount unit as well.10) 8mp of resolution for the price of a 6mp camera.The not so good:1) Seems to write to the card pretty slowly. Definately not for action shots! Maybe this would improve if I bought a faster SD card.2) The \"toggle\" button on the back for navigating through the menues worries me. Seems like it could break someday. I am gentle with it. Wish they would create a more durable feeling toggle.3) The LCD viewfinder is hard to see on a bright sunny day. This is where a film camera is WAY better. Optical viewfinders cannot be beat.4) The in screen manual focus is no good at all. Better just focus with your eyes.5) Wish they would have made the handgrip a little grippier by adding a rubber stip or the like. Is a little slippery in the hands (always use a neck strap!)In all I highly recommend this camera. If they were to improve upon some of the items for which I have some critisism, I would easily give this camera a perfect review!!Good luck with your purchase", "Date": "September 30, 2006"}, {"Title": "Love the Features", "Author": "The Monk \"Snap Happy\"", "ReviewID": "RJHNH4CT5YHOB", "Overall": "5.0", "Content": "Kodak has decided to move up market with the P880.  The camera has lots of options and will grow with you as a photographer.  It even has a movie mode in case you have forgotten your camcorder.I like the RAW and TIFF options that allow me the option of manipulating the photos on the computer with the supplied software.  The shots I have taken so far come out of the camera ready for printing, so I will play with RAW later.Anyhow, this one I highly recommend, especially at this price.  Kodak is the value leader.8 megapixelsSuper wide angle with 6x zoom.Kodak colors--that is what they are famous for-no other company has Kodak's in-camera image processing software.Reliability (Agfa/Polaroid went out of business-Kodak is here to stay)Kodak is the #1 (Number One!!!) selling digital camera brand in America.Solid construction-this camera is light, but solid.Smaller than a 35mm DSLR, no \"dust on sensor\" worries from changing lenses-the zoom is right for 99% of the shots you will take.Anyhow, I would give it 10 stars if I could!", "Date": "November 2, 2005"}, {"Title": "Best 8 meg camera out there", "Author": "C. Gauthier \"chasgaut2\"", "ReviewID": "R1GV92G78QXN6C", "Overall": "5.0", "Content": "This was the third 8 meg SD camera I tried - it was the only one that without using a tripod indoors gave me sharp, crisp pictures most of the time.  The zoom was smaller that the Fuji or the Panasonic, but the color saturation and sharpness were heads and shoulders above the others.  Excellent camera that shoots jpg, tiff and raw.", "Date": "September 7, 2006"}, {"Title": "compact and easy to use, loaded with features", "Author": "Jacob-An Eye for Art \"Remember Beauty\"", "ReviewID": "RAJTIC9ANFJJQ", "Overall": "5.0", "Content": "I have the P880.  If you decide to get one, I believe you will be getting a camera that is an excellent value.  The Kodak P880 is easy to use, has a fantastic lens that really shoots wide angle and seems to get all the scenery and people in one shot...no need to back up to fit it all in.  And the colors glow in a beautiful way.  AND the Kodak P880 has lots of features and scene modes if you decide to get more experimental.It even can shoot VIDEO!!!!8 megapixels make the pictures full of details and color.A Kodak for wise consumers....", "Date": "May 10, 2006"}, {"Title": "Nearly perfect zoom range.", "Author": "Eugene E. Heacock", "ReviewID": "R3FWI65TW7TT6G", "Overall": "5.0", "Content": "I owned a camera store in Fairope, Alabama in the 70s.  My camera of choice was the Nikon F2.  My favorite lens were the 28mm F3.5 Nikkor for interiors and landscapes and the 105mm F2.5 Nikkor for portraits.  I find the equiv to 35mm camera zoom range of 24mm to 140mm on the Kodak P880 perfect for most photographs I want to take.  I like the \"feel\" of the P880. The more I use the camera, the more comfortable I am the manual adjustments available.  The fully automatic mode works well for most applications...but in low light or other special conditions, the camera can be operated pretty much like a manually controlled cameral. Eight megipixels produce very nice 8 by 10 prints even after cropping. The big two and a half inch led is very nice and the electronic viewfinder is clear and easy to use even with my glasses.  I really like having a hot shoe and pc connector for my old flash units.  I have had the P880 for over a month and I guess I have taken a couple hundred pictures and I couldn't be happier.  I am very glad Kodak offers such a fine camera for less the half the cost of the Nikon and Cannon SLR digitals.  I realize the lens are  not interchangable but that is the only difference I can see and that isn't an issue for me.  If you appreciate a fine camera and can get past the stigma of a Kodak...then the P880 could be the camera for you.", "Date": "December 13, 2006"}, {"Title": "Good Value", "Author": "PamPam \"Rainbow Chaser\"", "ReviewID": "R2KL1V8TGIAD1Q", "Overall": "5.0", "Content": "I am learning about digital photography and have used a point & shoot digital camera for three years.  Anyhow, I wanted something that offered more manual control in case I did not want to use the automatic feature.  After much research, I found that the Kodak P880 has the options I need.The best thing is that it is under $600.I DID NOT want to spend $1000 or more on a camera or a bunch of lenses.  Some people even spend over $2000 or $3000 if they want to get a hi tech digital SLR with good lenses-not plastic lens kit lenses.  Anyhow, that is beyond what I want to spend.((((This is KEY---I want to use a camera that will take high quality pictures and not have to worry with each bump whether it broke and whether it was stolen and I am out $2000.)))The Kodak P880 takes wonderful pictures-it is true that Kodak has the most lifelike colors and skin tones are perfect.  And the price makes the P880 a real value.Best of luck to all the new owners--I am sure we will all be using the Kodak P880 for years to come!", "Date": "November 2, 2005"}, {"Title": "A Home Run for Kodak", "Author": "Ken", "ReviewID": "RV1OGGNZM780P", "Overall": "5.0", "Content": "**update:  dpreview.com just gave the camera a \"recommend\" and a wonderful review.**I finally got my camera and it has been worth the wait.  The 24mm wide angle lens is in a word--awesome!  you can shoot the whole interior of a room.  most other lenses cannot capture the width.  i can think of no better camera for those that shoot either interiors (real estate?) or wide vistas--like landscapes.  the zoom works well and can be controlled manually so there is great opportunity for candid shots of the kids.**best of all are the Kodak colors.  they are really vibrant and rich.", "Date": "November 2, 2005"}, {"Title": "EXCELLENT CAMERA, GREAT WIDE ANGLE", "Author": "Carolina Hernandez Diaz", "ReviewID": "R1UK9BHGLY7IPX", "Overall": "5.0", "Content": "I have to say that is an excellent purchase. I'm a fan of my P880 camera.Wide Angle Len, a feature included, allows to take great panoramic views, with no efforts. The manual optical zoom is great, gives you a control of the picture that i never had with a comercial digital camera.One of my favorites features is the zoom for reviewing the picture, is a 10X zoom and you can check detailed the picture in the LCD screen as in your PC.The 8 Megapixels, allows you to see with great precision minimal details that usually you don't see.Is a great experience, when you take a picture,return home, and the picture is better than your memory.I'm still learning about the other features, but rigth now i think that has a great performance-value relation, and most important, allow my to have photos with a professional touch,.From the South Of the WorldCarolina", "Date": "November 10, 2006"}, {"Title": "Great Pix!", "Author": "N. Gallub", "ReviewID": "R2WH8JH6YOUX0G", "Overall": "5.0", "Content": "Bought this camera after using 2 previous Kodak digitals. I was looking for something with higher quality pix and ability to do wide angle shots. I was floored by the quality of the pix with this camera. Crisp, clear shots, and easy to use. Highly recommend!", "Date": "January 3, 2007"}, {"Title": "Best Camera for the money", "Author": "William R. Finn", "ReviewID": "R3F5IR4ZRN6OQR", "Overall": "5.0", "Content": "The Kodak P880 is a remarkable bargain that produces astonishing photos.  With its 8 megapixels and zoom lens it operates like more expensive SLR's.The quality of the photos, even at the highest zoom, is astounding.  For anyone interested in an easy to operate, high quality camera, this is the one.", "Date": "November 10, 2006"}, {"Title": "Kodak P880 digital camera", "Author": "J. Lee", "ReviewID": "R2PMXBHFH88ES5", "Overall": "4.0", "Content": "I'm very happy with this camera. It does everything as promised. About as good as it gets without going to an expensive slr digital. Great resolution at 8 megapixels, lots of manual features for those that want to be a little more creative, but still a lot of features that someone that just wants a point and shoot camera can enjoy. Just packed with features that all work very well. The only thing that I was disapointed with was the maual focus ring that supposedly helps fine focus photos not shot while on full automatic. I found it pretty much useless, but still that's a small fault compaired to the pluses this camer offers. I love the ability it gives you to use an off the camera flash using a pc cord. It really helps when doing close-up work. For the money I don't think you can beat this camera. I'm totally satisified to this point and would recommend it to anyone that wants some creativity with their camera without breaking the bank to do it.", "Date": "January 9, 2007"}, {"Title": "Learn to use this Camera and the possibilities are endless!!", "Author": "Amy A. \"AA\"", "ReviewID": "RBCAH94HA7BU", "Overall": "5.0", "Content": "I am noticing that some of the negative comments here are probably from people who havent taken the time to get to know their camera.  If you put your camera in the proper setting you can take continuous pictures.  This is not an SLR so it's not that fast, but I get Great Fast Pictures.  The one person who said that they could not upload the pictures to their computer, I am thinking something was wrong with their computer, I have taken thousands of pictures since i got this camera in December and email and share them with everyone i know. I get awesome pictures of flowers, bees, animals, and my children, especially actions shots of my children.  Though, I rarely use Auto, so if you are willing to experiment outside of auto, you will get the best pictures, and you will have endless possibilities!!", "Date": "June 16, 2007"}, {"Title": "Great", "Author": "C. Kramer", "ReviewID": "R2GRA6CSWZ1BUZ", "Overall": "5.0", "Content": "I am really enjoying this camera but probably because i spent a lot of hours researching before I bought and knoew exactly what I was getting. This is definately not a point and shoot but it it is not so complicated that I can't figure it out with limited technical knowledge either. The cross over between the camera doing it for me and having the ability to do everything manually is good and the ability to add lenses when I want but still having the digital capability is also great. I agree with the review I read about low light - it is fussy and takes a while to focus - like a long while - also it definately pays to have the extra flash unit and I have a zoom lens for sports which is useful (by the way my zoom lens fits directly to the camera although it came with an adapter which does not fit which is very bizarre so be careful someone can't measure). I gave it a five becasue I really like it I would change a couple of things like the low light focus and the metal control button feels cheap (but works fine).My specifications were moderately high megapixels, close-up capabilities and zoom capabilities with camera and accessories for under $1,000 - the first two are built in to this camera the last one is pretty good internally and then I can add on.The only real glitch I have had is with software - I am not sure what caused it - suffice to say the Kodak software is no more, this was fairly catastrophic in terms of losing pictures -but I should have seen the writing on the wall when my system crashed the day I installed the silly thing instead ...........oh well.............", "Date": "August 26, 2006"}, {"Title": "Nice camera, but tragic flaw (autofocus failure)", "Author": "B. Engle \"brianengle4\"", "ReviewID": "RXJQ280ZMKVMK", "Overall": "1.0", "Content": "I have an extremely lightly used P880 camera, which is cosmetically flawless, having never been dropped, scuffed or even sneezed at. But it decided to stop focusing. Apparently this is problem with this and maybe other models. Kodak has a well-designed web site for channeling customers down the road THEY want to channel them. BUT, the entire Kodak experience leaves much to be desired. The only option is an open-ended repair bill for a camera that should have been recalled. I packed my Fuji 645 half way around the world and back, through the most rugged terrain imaginable. I got hit by a motorcycle in the streets of Saigon and dented the case...still works like a charm. And, the Pentax K1000 I bought in high school works as it did 30-years ago. Never had a chance to take this Kodak anywhere. Guess I should be thankful it crapped out here rather than on the road. I am beyond disappointed and, you guessed it, will never purchase a Kodak again. But, the brand, like GM and Chrysler, will live on in my memory as a mark whose glory has faded. Rest in peace, Kodak.", "Date": "July 6, 2009"}, {"Title": "Very capable camera, but beware.", "Author": "Myself", "ReviewID": "R2UJGT665UFHK6", "Overall": "4.0", "Content": "From the Kodak people comes this camera packed to the brim with features, resembling a lot a DSLR, though it's not even close to performing like one. The price, of course, is a lot lower than with reflex cameras.+ This cameras' main attraction is, without question, the great lens, with manual zoom and focus rings, and a VERY handy zoom range, starting at no less than 24 mm. That's the widest lens of digital camera kingdom! Only the Sony R1 has something similar, but a lot bulkier.+ This is not a camera for snapshot shooters, it shines in manual mode, where the photogapher can decide diaphragm aperture, shutter speed, ISO sensitivity, and more.+ The 24mm end of the lens is very funny to use, allowing for weird angles and great interior shots.+ The camera (like dslrs and other advanced bridge cameras) has a lot of buttons, allowing you to change settings without having to surf through endless menus (this is really priceless).+ Battery life seems very good, especially using the EVF instead of the LCD.There are some shortcomings though.- The manual focus mode is, simply put, trash. The image displayed onscreen is not detailed enough to judge whether the subject is in focus or not.- The LCD, as well as the Electronic Viewfinder, could use more resolution, as it is sometimes difficult to see whether the pic is sharp or not.- Neither the LCD, nor the EVF, offer real Live Preview. You can only use them to frame the picture, but the displayed image doesn't reflect at all how the exposure settings affect the final pic.- Write times to the memory card are really slow. That means that after taking a pic, you have to wait for 4 to 6 seconds till the camera lets you take another one.- Macro mode is dissapointing, to say the least. You cannot get close enough to the subject, and the camera blocks the light. If you use the flash, the big protruding lens blocks it, and your subject will look very dark.- ISO performance is nowhere near DSLR territory. In good light, ISO 100 pics show some noise, though nothing to be worried about. But in low light situations, the noise sky rockets. ISO 400 looks pretty bad to me. This is a common problem of non dslr cameras, and there are some programs that let you clean the noise from the pics, but this camera has a kind of noise that's really hard to erase.- Bulk: with a lens like this one, it's difficult to keep the camera pocketable, but the thing's big enough to compete with a DSLR, which it only beats in price.... that was a big no no for me.To sum up, the P880 is a very capable camera with some notorious limitations. At this price, it's very difficult to beat it, but if you are not on a budget, I'd get a DSLR instead. if you like taking photographs and want more photographic control and something truly unique, like the wide angle lens, then this cam is for you.", "Date": "December 26, 2006"}, {"Title": "Great Features", "Author": "Ransom \"Lens Lover\"", "ReviewID": "R2E3A37G8G5M2L", "Overall": "5.0", "Content": "The P880 Zoom is the flagship of Kodak's new EASYSHARE P-Series of advanced digital cameras. The Easyshare P880 Zoom is an affordable, high performance camera for serious photographers.  It incorporates a 24-140mm (35mm equiv) wide-angle, Schneider-KREUZNACH VARIOGON zoom lens with a high resolution 8-megapixel imager for very large, professional-quality prints.The 24mm wide angle setting is ideal for landscape photography and interior photography and also offers greater depth of field. Creative photographers can shoot with this wide perspective for unique portraiture, or to capture a greater scenic expanse for later cropping. The same lens optically zooms out to 140mm (5.8X), controlled by a manually-operated ring for precise framing. The autofocus system is highly accurate even in low-light conditions and you can manually focus using another ring on the lens.Exposure control abounds with an array of different shooting modes: automatic, program, aperture and shutter priorities, full manual, AE bracketing, time-lapse and custom as well as pre-programmed scene modes: close-up, super close-up, landscape (standard and night landscape), portrait (standard, night portrait, anti-shake night portrait), sports, sunset, backlight, candlelight, text/document, manner/museum, snow, beach. Image adjustments include color modes (high color, natural color, low color, sepia, black and white), contrast and sharpness.The P880 offers very flexible lighting control with a built-in popup flash that can be supplemented by more powerful flashes via the hot shoe flash connector or the PC sync port for off-camera flash units. The new Kodak P20 Zoom Flash features TTL-controlled exposure, a zoom flash head and bounce-flash capabilities.In addition to high resolution still images you can also captures VGA resolution video at 30 frames per second and use the full optical zoom. Your movies can be trimmed, cut, spliced and merged - in the camera. You can extract individual video frames as JPEGs at 640 x 480 resolution - presenting an ultra-high-speed alternative to the camera's multiple burst modes (first/last/time lapse burst) - which can then be shared and printed up to 4 x 6 inches.For the first time, Kodak has added RAW file support to its EASYSHARE camera line to enable more post-capture flexibility for enthusiasts. These files allow for in-camera JPEG and TIFF extraction, as well as RAW editing within new KODAK EASYSHARE software v5.1. The new Kodak RAW format uniquely embeds a dynamic JPEG within the file, permitting rapid RAW file viewing and organization in the software, without requiring RAW conversion.Additional features include a live histogram with highlight and shadow clipping for immediate on-camera exposure assessment; a 2.5-inch, high-resolution LCD; a 237,000 pixel electronic viewfinder with diopter; a high-capacity lithium ion battery; one-push custom white balance; digital red-eye reduction; and a powerful popup flash.As with all EASYSHARE cameras, the P880 model is compatible with KODAK EASYSHARE printer docks and camera docks, the IMAGELINK print system, and PICTBRIDGE technology for direct photo output without a computer.", "Date": "November 17, 2005"}, {"Title": "Best camera I've ever had", "Author": "Climber Girl \"Della\"", "ReviewID": "R4AOBSHMWW0KA", "Overall": "5.0", "Content": "This camera is SO user friendly and versatile! With the 8 megapixel resolution, the pics are sharp and clear! Honestly the best camera I've ever had!! A GREAT buy for the cost for all of us non-professional users.", "Date": "November 22, 2006"}, {"Title": "Oh My P880", "Author": "Stephanie N. Bowling \"Stephanie B.\"", "ReviewID": "R1RU5K2GQSNU5R", "Overall": "2.0", "Content": "I bought my camera a few months ago, so I have had a chance to figure out most of its features, not all lol, but I consider that a good thing (extra features means more messing around with it ^-^. Well anyways it is an excellent camera, it does all of the things I want it too, and its half the price of a Rebel. The video it takes is amazing and can record till there is no space  on the SD card. For me I have a SanDisk 1g SecureMemory SD Card and I can take about 27 minutes on it which is plenty. And about 38 secounds on the 38mb internal drive. I can take about 329 pictures on the 1g SD and about  10 on the internal. The battery is great on it, I have used it countless hours and havent gotten one bar to go down, so about 2-3 days of use will run it down. So I asume about 8-10 hours. I have never had it die on me, with out me intentually letting it (I guess its better to let the battery run out and then charge it) The focus and zoom feature is fun to play with on the camera and comes in really handy (for the extra zoom there is the zoom button on the top left of the camera, so you really dont need to buy one of those cameras with the 10x) What else? Well the manual features (the biggest reason I got the camera)so play with the ap., iso, and shutter speed they are so fun to mess with, even the hue of the photo which I didnt expect to like, I actually got off really good shots with. The auto features come in handy too, just click and shoot! Macro is a neat feature, get in close its amazing and your shots will be beautiful! Screen is good to, with a crowd around me most can still see the image on the screen (I take video's of my boyfriend and friends sparing)The Mic is on top, it does its job (when its windy you can actually block the wind without even knowing because your hand while on the \"on,off-shoot\" button covers it (good design)Uploads pic quickly on computer and deleting picutres is extremely quick and easy. The af (auto-focus), focus, and ae are easy to get to for quick fixs other then the focus on the front of the camera. And flash does good. Well I hope my long drawn out review was helpful. I hope you enjoy your camera. I will shortly be purchasing a smaller camera for v-logs possible a canon sd630. But YES DO BUY THE KODAK P880 the mega-pix are simply amazing!Update: Broke!", "Date": "November 3, 2006"}, {"Title": "Faster than I expected!", "Author": "Froxfield_Reviewer", "ReviewID": "R263N56QBWEOBJ", "Overall": "5.0", "Content": "I agree about the Sandisk III being fast and the need for a fast card with this camera. I have a Sandisk II and a Sandisk III. Both give the same speed. They both transfer data as fast as the camera can process it. This camera is faster than I expected although still slow on focussing. 5 stars for so many features and 4.5 for image quaility. It is an excellent buy if you can find one. Oh, you can also focus and take another photo even if it is processing the previous - so no major delay.", "Date": "March 5, 2008"}, {"Title": "Kodak P880 Digital Camera", "Author": "Mitchell Rogan", "ReviewID": "R3E3I1AK605YH", "Overall": "5.0", "Content": "I am still playing with the camera. I have taken some pictures.  The Automatic mode works great.  All of my  pictures turned out great, you do not have to worry about the settings.  All the pitctures I took in manual mode of Portrait, and close up of flowers came out great.  I am very pleased with the camera. This is my first Digital Camera. I just a beginer.", "Date": "January 28, 2007"}, {"Title": "Incredibly aggravating!", "Author": "150 F3", "ReviewID": "R16MUH6E9848YL", "Overall": "2.0", "Content": "It's such a shame this camera is so infuriating to use.There's nothing optically wrong with it. The lens is fantastic. The sensor is incredibly good. When the camera is working, it's a pleasure to use and delivers lovely photos. I find program mode works the best. Black and whites are beautiful. ISO 400 works perfectly for action photos in bright daylight. Battery life is fantastic.List of severe problems:Preview histogram is completely useless. Photos are always much brighter than histogram. The photographer has to guess how much underexposure is needed to compensate for the misleading histogram feature. I hate having to correct the camera 2 or 3 times because a histogram with nothing on the right 1/3d still winds up being badly overexposed. Didn't Kodak take their product out into the field to test whether the histogram gave accurate information? It would have taken 5 minutes of parking lot photography to reveal this inexcusable shortcoming.Highlight clipping warning system behaves the same way as the histogram. Seemingly small, well controlled highlights become massive areas of blown out overexposure when the photo is taken. It's awkward and aggravating to have to correct the camera 3 or 4 times thanks to this half baked feature. I want to expose to the right for a strong, bright signal, but can never trust the P880's weird, uncalibrated metering approach.Power switch is completely useless. Camera shuts down right when I'm ready to take the picture. I'm constantly fighting to keep the stupid camera on and missing shot after shot after shot after shot after shot. Power switches should not cause rage and disappointment. They are well known electronic components. Why Kodak decided to use a rotating switch directly in contact with the shutter button and put a \"favorites\" setting I have no use for on the same ring is a mystery. I hate this camera's completely unreliable power switch design. I want it to stay on, not turn off over and over and over when I'm trying to enjoy photography. This is the only consumer electronics device in my life that is incapable of staying on. It's a fatal flaw that makes me feel nothing but regret that I opted for a \"prosumer, high end\" camera that totally fails to work 3 years in. I mistakenly presumed spending more on a camera would mean better quality. Wrong.Time lapse is completely useless at night or in low light. It does not allow exposures longer than 0.5 seconds in MANUAL MODE. I can understand it objecting if I'm trying to do 11 second exposures every 10 seconds, but why can't it give me at least 4 seconds? What is the reason? Kodak needs to let the user have full manual control of all settings and allow full functionality at all times. Even if I wanted a series of 16 second exposures, the camera's firmware should be bright enough to just wait 10 seconds after processing each photo. The 0.5 second limit still applies with a 30 second delay. It's this kind of poor interface that ruins photography and makes me want to give up. Sometimes I want to use f/8, ISO 50, and more than 0.5 seconds, but the camera won't let me.Aperture priority and shutter priority are completely useless, unless the goal is getting bad exposures. I bought this model for those features, but never use them. I can't use them because I have absolutely zero faith they will work at all.Video is completely useless, unless the goal is 640x240 video blown up to 640x480. My Canon point and shoot from 3 years earlier was able to deliver crystal clear 640x480 video using all the pixels. Kodak apparently believes blocky, interpolated video is good enough. Why put in the video feature if it doesn't live up to the product's advertised claims? I bought the camera to ENJOY having video functionality with its nice lens. Now all I feel is cheated and disappointed.Infinity focus is completely useless. The vast majority of infinity focus photos are completely blurry. It's so annoying to have to find something else to prefocus on when the subject you want won't lock in. Seems Kodak didn't bother to test this feature in real life situations. Why does the lens motor try to focus when the camera has been informed to simply focus at infinity? I don't understand why infinity focus is so difficult and elusive. Why put the feature in if it fails to work over and over and over? Terrible engineering! Pathetic. Ridiculous! Why, when infinity focus fails to work, does it default to focusing as close as possible to the camera, then taking the shot? Shouldn't it go the other way?Super macro mode is bad. It offers no white balance choice. I don't mind setting white balance. I wouldn't mind if it defaulted to Auto. But why take away user control for a pretty important aspect of digital photography? There's no exposure compensation option either! All super macros in daylight become bluish, overexposed, and mediocre.The scroll wheel behaves oddly. Moving it one click often activates it 3 clicks in the opposite direction. I have to repeatedly correct the camera's poor interface. The lack of fine, intuitive control is very frustrating.Raw format offers nothing compelling, except revealing how pathetic the camera truly is deep down. It's shocking to see how much noise and blurriness unprocessed files have.By the way, I'm writing this in anger after quitting a seemingly simple photo session I mistakenly thought the P880 could handle. I was wrong. I was wrong to buy this awful product. I wish I never did. I hate it!If Kodak had told me the truth, I would not have chosen to buy this camera. Here's some honest ad copy they should have used:\"Switches itself off at the touch of a feather!\"\"You want Aperture and Shutter priority? You got it! But they don't work. Just try it and you'll understand.\"\"Auto white balance always errs on the side of sickly yellow!\"\"USB 2.0 was standardized in 2001, but we're sticking with USB 1.1!\"\"Miss more shots than ever with the powerlessness of Kodak.\"\"Feel the bitterness.\"\"You'll eventually want to smash it.\"It's hard to believe how many problems this camera has. I bought it specifically because it looked simpler than others. I wanted the manually operated zoom lens to avoid lens mechanism errors plaguing other brands. I wanted aperture priority to set it as desired and simply go out and take nice pictures. The camera failed to live up to my reasonable expectations.I remember my early weeks with the camera, getting mad at how it consistently made wrong photographic choices. Exposures were regularly blown out or massively underexposed. Colors looked wrong. Things I thought were so easy in the world of Canon point and shoot photography were beyond Kodak's abilities. I never use full Auto mode. It is completely useless in all lighting situations.Eventually Program mode solved my problems, but I wasted so much time trying and trying to get the camera to simply make decent exposures of well lit subjects that the bitterness, loathing, frustration, and disappointment linger on 3 years later.The P880 is a tragic product. It's 95% of the way to greatness, but that missing 5% is a constant source of vexation. At least I didn't buy it early at full price.I intend to destroy the camera eventually. I cannot in good conscience sell it or even give it away to others. That would violate the golden rule, something Kodak would do well to reflect upon.", "Date": "March 7, 2010"}, {"Title": "p880 the more you use it - the more you appreciate it", "Author": "Jack Abeyta Jr. \"jack's sansa\"", "ReviewID": "RQW426N7HFSAL", "Overall": "5.0", "Content": "I recommend you use this camera with a tripod to produce quality pictures equal to most DSLR $$$$$ rigs", "Date": "September 20, 2008"}, {"Title": "Great camera, missing part", "Author": "Laure", "ReviewID": "R9EXRR58NOX6Y", "Overall": "4.0", "Content": "The piece that tethers the lens cap to the camera was not in the package, so it's kind of a pain to keep up with the cap.The camera is great - I still haven't figured it all out, but it's very intuitive for most basic uses. I find the Snapfish site far easier to navigate, and more useful than the Easyshare site that this camera automatically leads you to sign up to, though. I have taken beautiful shots of my garden and some really great black and whites of the kids, but it does have the delay that comes with all auto focus digital cameras, so even the 'in motion' setting doesn't get the greatest shots of moving subjects.", "Date": "December 14, 2007"}, {"Title": "Not the simplest camera to use, but takes beautiful photos", "Author": "R. Geroski \"lynxspyder\"", "ReviewID": "R3MV7O2ZFLIRX8", "Overall": "4.0", "Content": "I purchased the Kodak P880 a little more than a year ago when I wanted more than my overly simplified, three-year-old 2-MP could do. I chose the P880 based on the list of features it offered and reviews of its performance. It seemed to be just what I was looking for, and I can't say that I'm at all disappointed with my decision.The P880 is at its best in outdoor lighting situations. If you like to do landscape photography, the P880 will make you happy. The outdoor shots I've taken are sharp, with brilliant colors. I am delighted with the way the sports scene mode is able to freeze action shots for solid images that aren't blurry.The biggest challenge to taking good pictures with the P880 is learning how to use all of its functions. It's taken time and practice for me to know which mode to use when and just how well it's going to do what I want.The video quality is also good enough that I often use it as a camcorder. No, it's not going to make me want to toss my camcorder any time soon, but the video quality is far better than I expected a digital camera to deliver.The only two complaints I have about the P880 are that its low-light performance isn't as good as that of my old Sony and that it's difficult to take extreme close-ups that are focused well. Indoors you have to use the flash unless it's a bright, sunny day and you have lots of windows. With my previous camera, I could take indoor shots without the flash in less-than-ideal lighting and still expect satisfactory results. The P880 needs more light to deliver acceptable results, so I always end up using the flash when I would often prefer not to--especially when doing so results in an overexposed image.I take a lot of nature photos, and that includes extreme close-up shots of insects, tree frogs and other small creatures. This is sometimes very difficult with the P880. Using the manual focus helps, but it often takes too long to get the focus right--and when it comes to nature, you don't have all day to get the focus just right. I have still taken many gorgeous nature images with the camera, including the sharpest and most detailed shot of a split-winged blister beetle I've ever seen, but others have left me a bit disappointed.Overall, I am highly pleased with the P880 and have found over the time that I've used it that most of the issues I've had are a result of my ignorance of how to use the camera rather than a problem with its capabilities. When I look at the photos I've taken with the P880, I realize they are the most beautiful images I've ever created with a digital camera, and that's why I'm perfectly happy with it.", "Date": "December 5, 2007"}, {"Title": "AWSOME !!!!! COULDN'T GET ANY BETTER", "Author": "L. SCALES Jr.", "ReviewID": "R19J19AL89J262", "Overall": "5.0", "Content": "I PURCHASED MY KODAK P880 WHEN I WAS DEPLOYED TO IRAQ AND I WAS SKEPTICAL AT FIRST WITH ALL THE FEATURES BUT ONCE I STARTED EXPERIMENTING I HAD SOME SOME THE MOST LIFE PICTURES I'VE EVER SEEN PLUS I GOT IT AT A AWSOME PRICE OF $499.00 SO I WOULD RECOMMEND THIS CAMERA TO ANYONE WHO ENJOY QUALITY PICTURES.", "Date": "September 27, 2007"}, {"Title": "Camera Grannie", "Author": "M. H. Moore \"mhmoore\"", "ReviewID": "R24RTX6U6W29UM", "Overall": "5.0", "Content": "I bought the p880 to go along with my z650. My z650 I use while driving down the road or interstate (i.e. 65 mph) to shoot out the window. The p880 I use for a lot of close ups and family get togethers. I keep them both loaded and ready where ever I go.I have never had problems with the buttons, where they are placed or how they're used. Battery life is average, but I carry lots of spares. Neither camera will read anything over a 2gb sd card, but that is fine. You can get a lot on 2gb, and I carry spare cards and an image safe, just in case.I don't have the time or inclination at this time of my life to get an \"education\" in photography. Which is what it would take to use some of the newer dslrs. Kodak cameras are easy to use, easy on my purse strings, and I have yet to see anything that rivals their color.The only things I seriously recommend is, no matter what your skill level, your pictures are precious. Get a filter and lens cap(the OEM one sucks, I use a Zeikos pinch cap), and use them all the time. I also use a Belkin lcd shade on all my cameras to protect the lcd, I can always use the EVF or slide the shade off and leave the protector if need be. Due to other reviews of Kodak's software, I have never used it. I set my storage to \"card\" and then either offload the contents onto my netbook or my image safe. I edit and upload to where ever I want from there.I recommend this camera to anyone who wants a little more than a point and shoot. You can manually adjust the zoom and focus and it shoots in raw if you are so inclined. It accepts 55mm filters, and has a 2.5 lcd. The flash does not pop up though, it has a hot shoe for an external flash, so you need to remember that. Sometimes if it doesn't auto focus all I have to do is open the flash.I know this is a very winded review, but I hope I answered some questions for others out there.", "Date": "March 29, 2011"}, {"Title": "Pretty good camera", "Author": "karen", "ReviewID": "R1MIM1FI5ZGO8E", "Overall": "4.0", "Content": "This camera has a very good lense, if you don't want to shoot anything telephoto. It is one of the easiest of use for closeups, although calling what it does \"macro\" is a bit of a stretch. The manual features are great, and the picture quality of the raws make it a very good thing that there are other programs to handle the computer edits. Kodak's easy share software sucks, crashes and screws up Microsoft operating systems, so it was a big relief to find codecs for Microsoft viewer and photoshop. If you have to shoot action, try choosing JPEGS and using the shutter burst. YOu will usually get at least one frame that is good. I don't know why they don't let you do at least a 3 shot burst with raws, because they do allow 3 shots of bracketting. For shooting purple, try the cloudy or open shade WB settings for better color matching. Under exposing when there is a lot of white or yellow in the shot is also a good idea. I would love this camera to death if the zoom were 10 times and went closer than a 50mm equivalent.The batteries both died after two years of use, and for the last year and a half, neither would really hold a charge.The worst feature of this camera, for me, is that the lightest amount of moisture in the air and the on/off/shutter button goes dead, and, over time, it has gotten very twitchy. I have to leave the camera on all the time and take the batteries out or risk not being able to turn it on. In the Kodaks I have had, the one with the sound pickup and on/off button on the side and back was almost water proof, the one with the on/off button on the side would shoot in a light misty rain, and this one freezes if it is too foggy.", "Date": "September 20, 2010"}, {"Title": "P880 avoid", "Author": "William C. Chandler Jr.", "ReviewID": "RATT54PE9CY99", "Overall": "1.0", "Content": "My P880 started resetting after 3-4 months. I thought it was battery needing recharging. When I finally realized it needed repair, it was out of warranty. No its almost unusable.  I'll never buy Kodak again.Kodak Easyshare P880 8MP Digital Camera with 5.8x Wide Angle Optical Zoom", "Date": "December 28, 2008"}, {"Title": "Fantastic images BUT plaged with built quality problems.", "Author": "J. Capobianco", "ReviewID": "R3F65XDC9JVFAF", "Overall": "2.0", "Content": "I haved owned 3 of these over 2 years.Expect it to break after about 2000 shots or 3 2gb cards of use. First the power switch will shut off and onthen video sound will stop working and lastly the autofocus will stop working correctly.This not only happened to me but read the posts from others who owned theirs for more than 1 year and the story is the same. Kodak actually broke my first one's autofocusing after sending it for the first switch repair($160), it took 3 more repair attempts for them to fix their hack job.Its a shame because it takes outstanding photos and has the best range availible.", "Date": "December 9, 2008"}, {"Title": "Constantly Breaking", "Author": "Randi Morse", "ReviewID": "R32EN4KQD2I759", "Overall": "1.0", "Content": "There's a reason that this camera is no longer sold - it's horrible! I don't usually leave a bad review, but this camera has been the burr in my side for a very long time. I had to have Kodak send me a new one, and THEN the new one broke! I will never purchase a Kodak digital camera again.", "Date": "July 28, 2008"}, {"Title": "Professional Type Camera for Decent Price", "Author": "Kathy W", "ReviewID": "R2Y0VWY7FJ1SNR", "Overall": "5.0", "Content": "My cousin uses this camera for professional photography results.  In other words, he sells his photos that he takes with this camera.  I have seen many of his photos and they are outstanding.  I recently used this/his camera in San Diego to take some shots myself.  It was easy to use and takes great photos.  I brought home maybe 200 or so photos with this camera.  They are super clear.  I saw this product was getting some bad reviews.  I am purchasing it for myself because I was very pleased with it and so is my cousin.", "Date": "September 26, 2007"}, {"Title": "more than i expected", "Author": "W. Nastyn", "ReviewID": "R1XN0C9M7ECILC", "Overall": "5.0", "Content": "I don't have much to say, because I was just completely thrilled with this purchase. The price was better than right. The camera is complimented where I bring it, and it handles to my liking. A great  find.", "Date": "July 19, 2006"}, {"Title": "MIXED BAG", "Author": "gracie's mom \"sunnyside44\"", "ReviewID": "R2A4P6VBW9KBMW", "Overall": "3.0", "Content": "I admit that I am used to using other more sophisticated cameras and bought this for the purpose of having features found only on the most expensive pro cameras plus point and shoot availability.The list of promises was to much too ignore.manual focus with ringoff camera flash with sync cord8 mp although still using what is known as a toy senosr because it is so small.even a little video which meant that this camera should have it all..The problem is that from the very beginning it has been more work than it should befor example:two hours to get the software to work1 hour just to download the upgrade for the camera to help with its sluggish and poor focusing and pictue taking qualities.focusing is all but impossible in manual unless you are in broad daylight.Still I perservere and will try the flash function laterThere is also the funky jog dial which is actually a tiny jog dial unlike other cameras where you just push the left/ right top/bottom buttons.Menu is obtuse and written as if to obscure the cameras functions rather than aid in their use. This might just be the fact that this is their first model of this kind or that the majority of reviewers are all comfortable with weird and cluttered thinking.As with the Canon Is camera there are too many damn buttons near where you must hold the camera and this is both uncomfortable and subject to activating the camera unnecessarily.Camera has nice feel and appearance but the bottome line is the photos and so far there is nothing worth crowing about.Put together all the problems with setting up the camera and with the retarded software and this valiant try only gets 3 starsCameras in use by me now are:Pentax ist dl, fuji s5200, canon Is s3, Olympus c740", "Date": "August 22, 2006"}, {"Title": "A gife for a lif time", "Author": "Arthur L. Massey", "ReviewID": "RN2MH27XGURQF", "Overall": "5.0", "Content": "This kodak cam is all that i thought it would be ,this is the first real camera i have had, it takes magical pics, i cant say enough about it.", "Date": "July 31, 2013"}, {"Title": "Great for a beginner", "Author": "Delia VanEman", "ReviewID": "R2M6RYAJJ6524Z", "Overall": "5.0", "Content": "I love my camera, but was more impressed with the Seller.  He was great to deal with and I will purchase from him again.  As for my camera, couldn't be happier with it.", "Date": "April 17, 2013"}, {"Title": "Top notch digital advanced point-and-shoot camera", "Author": "RedMtl \"RedMtl\"", "ReviewID": "R101LQZJKO7A2P", "Overall": "5.0", "Content": "This is one of the best point-and-shoot cameras which ever came out.  I bought it five years ago, and still use it along-side my Nikon DSLR units.  The Kodak can be fully automatic if desired, but really comes into its own when used manually or in programme, aperture or speed mode.  It is as close to using a DSLR as you can get without actually having a changeable-lens camera.  (And, of course, not changing lenses means no dust inside the camera.)The controls are responsive.  The battery life is excellent.  The sensor is incredibly good for such a consumer camera.  The lens is beyond reproach, with excellent zoom, and a good wide-angle end.Furthermore, if it is your bag, this camera shoots excellent infra-red photos.  Get a good IR filter, and a tripod, and go to town!", "Date": "July 1, 2011"}, {"Title": "Excellent camera", "Author": "Audrey", "ReviewID": "R57QJ6SOOCW60", "Overall": "5.0", "Content": "I have owned this camera for 3 years now.  I purchased it refurbished from the Kodak website.  This camera takes incredible pictures in all types of lighting.  I can assure you that this camera is very sturdy.  It has been to the ocean, taken pictures in the rain, bumped around more than once.  Recently this was accidentally dropped it on the floor from a distance of about 4 feet.  It broke the USB cable, but the camera was not affected at all!  Also it is good for taking pictures in cold weather where the battery ran down fast in other cameras I have owned.  The manual settings give you much more control as well.  I'm thinking of getting another Kodak that is lightweight and can be kept in my purse, but doubt it will compare to this!", "Date": "March 11, 2010"}, {"Title": "Almost my dreamed camera", "Author": "B. Zhang", "ReviewID": "R3RCXA539T1QCW", "Overall": "4.0", "Content": "I am shooting with D70 for many years now. Well, we are going to have a family vacation which doesn't allow me to haul my D70 stuff. So I'm keep searching for a smaller and lighter camera with excellent range but cheap as well. All of sudden I saw this one in a private company they buy stuff from bankruptcy companies like CC. He got 3 of them either demo or returned units. I grab the nicest one. After shooting with it I'm very pleased with the pictures and handling. The exposure is accurate. I always have my own settings on D70. Later on I found out that my custom settings doesn't work on Kodak. Kodak exposure system is dam accurate. That's the best I had. It balances the bright area and shadow area very well. The battery life is superb. I use EVF all the time and the battery just keep going without any bar decease. Amazing!Concerns:* A little bit big for my camera bag. I have to squeeze it a little bit for the sake of odd positioned(but very functional) EVF.* Lens not as clean as prime lens, but better than most of the DSLR kit lens.* Wrting time to SD card is kind of slow in seconds. I tried a 20M/s card but not quite satisfied yet.In all, I feel very lucky that I go this camera. I'm thinking of getting rid of my D70 stuff now.", "Date": "May 22, 2009"}, {"Title": "Disappointment", "Author": "Happy Endings \"My Opinion\"", "ReviewID": "R176HG6VIPJLT8", "Overall": "1.0", "Content": "This camera was a huge let down!  Gave as gift to my father, because he has the Kodak 6490 (4 mega pixel) camera and LOVES it!  However, the quality on this, more advanced camera, did not compare.  Weak photo quality. -but maybe that's because he was comparing them to his better Kodak.", "Date": "August 24, 2007"}, {"Title": "What a disappointment!", "Author": "James Golden", "ReviewID": "RTC0RBRHDOOQF", "Overall": "1.0", "Content": "I only wish I could return this camera. Its automatic focus does not work well in photographing landscape scenes and plants (what I do most) and its manual focus is difficult (very difficult) to use. My much cheaper, and lower resolution, old Minolta does a much better job in low light conditions. I find I have to delete half my photographs due to bad focus. In addition, photo files take 5 to 6 seconds to save to my so-called high-speed memory card.Don't buy this camera.", "Date": "November 5, 2006"}, {"Title": "Auto focus is not . . .", "Author": "Mark G. Ahrens", "ReviewID": "RQF4COZ2WS3M4", "Overall": "2.0", "Content": "We got this camera because it was feature rich but still had the point and shoot option.However, the auto mode rarely renders a shot in focus.  It may need to be calibrated but i'll be damned if i can figure out how to do so.  Sent it in for repair, was good for maybe one month, then back to blur.  I can get great shots in the manual modes and other presets.  My main beef is with the auto.Wide angle lens is Great!  I love it.  But without an easy auto for people to pick it up and shoot it.  It fails to get more than 2 stars.Probably a great camera for those who shoot manually or in aperature or shutter priority.", "Date": "February 25, 2008"}, {"Title": "Kodak P880", "Author": "M. Gibson", "ReviewID": "R29H2SG3PFXRXB", "Overall": "5.0", "Content": "Great affordable camera, that takes very nice pictures.", "Date": "November 10, 2006"}, {"Title": "Watch out for downloading problems", "Author": "Dawn Hasapis", "ReviewID": "R3R6U1KXUA528H", "Overall": "1.0", "Content": "I purchased this camera in August 2006 and have sent it out for repair 4 times already for the same problem and it is November 2006. Kodak just keeps telling me to send it to get repaired. Is that right?It takes great pictures but when you try to download them to your computer it works the first time. You try to do it a second time and it freezes and gives you a cannot read device message. I have two kids and the most important thing is to send picture emails to all the relatives across the globe on their updated lives. I now have to go to my local photo place to get a CD and prints made and then download them into my EasyShare software. Oh, shouldn't it be easier after spending that much money on a camera.Also, I had to purchase a dock adapter for my printer dock. When I put the camera on the dock, it doesn't charge the battery or print pictures, the screen just goes grey.This camera has had its main board and firmware repaired and replaced every time that it has come back to me. The cost of shipping, CD's and prints has just added to the headache this camera has given me.Kodak has not been helpful at all and they inform me the only form of communication of through email. What are they afraid of, they need to face the problem and satisfy their customers.Do not purchase this camera, it is a great if you just never want to get them out of the camera.", "Date": "November 9, 2006"}, {"Title": "Great efforts", "Author": null, "ReviewID": "R19VXF0Y2DFSV6", "Overall": "4.0", "Content": "I wonder why all the sudden there are three excellent reviews after a first poor one.  LOL.  Kodak employees, you know who you're.  The guy gave 5 stars to all the Kodak cameras and 1 star to a Canon.  Man. tough business eh?  To be fair, this is a wonderful economical camera with many great features.Since people already pointed out the great stuff I'll be the bad guy here...Let's compare it to a year old Nikon 8400:  Kodak employs a smaller sensor (1/1.8 vs 2/3 (both toy sensors)) 8400 has solid alloy body with great feel and a smooth flip out (tiny) screen.  You can even add a funky fisheye lens to the Nikon if you like.  8400 has panoramic mode...a great idea.BUT then again, the 8400 was retail at $900 (do a search here) I beleive and Kodak is now at $600.  Consider both a bargain.  Naturally, cutting corner is inevitable.  So don't expect it to be perfect.  It is far from it.  However, it's a nice causal yet full feature p&s.;  And remember, professionals pay thousands for their equipments not hundreds.  If you can afford, do spend more to get a true SLR with a *REAL* sensor.", "Date": "November 10, 2005"}, {"Title": "Colors are super vivid", "Author": "Robert Sisks \"Pixelman\"", "ReviewID": "RZOFX5OU3IPQS", "Overall": "5.0", "Content": "The colors in prints from this camera are great.  The wide zoom is super wide and pulls in the whole scene.real quickly, this camera has:8.0 megapixel imager for photo quality prints up to and beyond 13 x 19\"24-140mm wide-angle zoom with manual zoom and focus ringsSelectable JPEG, TIFF and RAW file formatsHigh-speed AF with 25 selectable points and focus-assist LEDHigh-resolution electronic color viewfinder with 237,000 pixels2.5-inch TFT color LCD, indoor/outdoor typeTTL Multi-pattern, center-weighted, center spot meteringISO Auto or 50-400 in PASM, 800-1600 at 0.8MPAdjustable color modes, image contrast and sharpnessWhite balance with compensation, presets, 3 custom settings and one-pushAuto, Program AE, Aperture priority, Shutter priority, Manual, Custom and 15 Scene modesAE Bracketing with 3 or 5 framesISO sensitivity: Auto, 50-400 (400-1600 in 0.8MP mode)1.5fps Burst mode, up to 6 frames in JPEG, 4 frames in RAWShutter speeds from 16 - 1/4000 second, plus BulbFlash hot shoe and external PC flash sync connector640x480 movies w/sound at 30fps up to 80 mins.32MB internal memory, SD/MMC card slotKodak high capacity Li-ion rechargeable battery packUSB connectivity for PC and Mac usersAudio-Video Out (NTSC or PAL selectable)Optional EasyShare Camera Dock and Printer DockEnjoy!", "Date": "November 17, 2005"}, {"Title": "still trying to make it work", "Author": "Mike Pfaff", "ReviewID": "R2F9BHZDH7L6H0", "Overall": "2.0", "Content": "I bought the camera with high hopes that it would take good indoor shots of homes that we're getting ready to sell. I've yet to get one picture that isn't blurry. I'm hoping that I can send it back if I can't get it to work.", "Date": "January 11, 2007"}, {"Title": "Very good except", "Author": null, "ReviewID": "R11LMPU3GB89PT", "Overall": "2.0", "Content": "I finally received my camera and shot a couple pics at night.  Overall, camera produce good result.  I notice that there are couple of stuck green pixels always at the same spot.  I am returning it soon.  I am not paying $500+ for a defective camera.  This is really a big disappointment.  Only if Kodak did a better QA.", "Date": "November 2, 2005"}], "ProductInfo": {"Price": "Unavailable", "Features": "8-megapixel digital camera captures enough detail for photo-quality 16 x 22-inch prints\n5.8x optical zoom; 2.5-inch high-resolution LCD display\nNew RAW file support, with JPEG and TIFF capture; RAW editing with Kodak EasyShare software v5.1 (included)\nIncludes high-resolution electronic viewfinder and hot shoe flash connector and PC flash sync (built-in flash also included)\nPowered by Lithium-ion battery (battery and charger included)", "Name": "Kodak Easyshare P880 8 MP Digital Camera with 5.8x Wide Angle Optical Zoom", "ImgURL": "http://ecx.images-amazon.com/images/I/51R8FR539ZL._SX300_.jpg", "ProductID": "B000A8JYB8"}}