{"Reviews": [{"Title": "Only includes wall bracket...", "Author": "M. Novak", "ReviewID": "R3CD2ZGINL6MH4", "Overall": "4.0", "Content": "For future potential purchasers, please be aware that this only includes the wall bracket and not the mounting hardware itself.  That must be purchased separately.", "Date": "May 4, 2008"}, {"Title": "It is not a complete product, as shown in picture.", "Author": "Rajiv Goel", "ReviewID": "R3ECKOYF9KYV1Z", "Overall": "1.0", "Content": "They must change the picture and product description. It is misleading, as it is not complete product to mount the projector as shown with mounted projector. Wasted time and effort for me, and turned out much more expensive than I thought since I had to order more parts separately to be able to mount it.", "Date": "December 24, 2010"}, {"Title": "Only the Wall Mount...", "Author": "J. M. Hwang", "ReviewID": "R1F2GX6YRRX1XB", "Overall": "3.0", "Content": "As the negative reviews suggest, this doesn't include the hardware to mount to your projector.  But I'll score for what it is, a decent (not great) Wall Mount for your projector and mounting hardware.First off it looks and feels very sturdy.  I mounted this on my back wall opposite my projector screen as my ceiling in the living room is not only slanted but VERY HIGH UP, which would have been a joke to ceiling mount.The installation has 3 screw holes, the one on the middle is hard to reach with a power drill/driver because as you see in the product image it is right smack in the middle and there are some metal plates that block access with a wide drill.  I had to hand drive the middle screw.The top cylindrical horizontal projector holder is hollow and has holes as if you could route the cables through them so you can hide them from view.  Sadly the BACK side where it is close to the wall mount is so tight, I can't make any HDMI/VGA cables come out of it, so my cables are all twisting OUTSIDE the cylinder on top... ugly!The UNIVERSAL mount is a circular screw type mount.  Sadly the projector mount I have didn't match this screw mount and well... I had to MacGyver something to get it to work, but at least I was able to mount my projector after screaming at the Tech gods who created this \"universal\" mount which BOTH of my hardware had but they belonged to different universes.So it mounts and it is sturdy, the Universal Mount you probably need to research more (I'm done for now) but the cabling hole just doesn't work, for anything other than RCA cables.", "Date": "March 22, 2011"}, {"Title": "misleading", "Author": "Ahmed", "ReviewID": "R2S5EFJG1XEJYI", "Overall": "1.0", "Content": "THIS ITEM IS MISLEADING YOU HAVE TO ORDER  ANOTHER  ITEM FOR IT TO WORK IT HAS WALL MOUNT BUT WHEN YOU ORDER IT DOES NOT COME WITH THE PIECE THAT HOLDS THE PROJECTOR .This is a waste of time and money.", "Date": "August 8, 2013"}, {"Title": "Really pleased", "Author": "Lisa", "ReviewID": "R3FMYUY9GF11KI", "Overall": "4.0", "Content": "We purchased this for our home theater as we have a drop ceiling and wanted the projector at the back of our room anyway.  It's very easy to install and is incredibly strong.  We have the Sanyo PRZ2000 and it easily handles it's weight.  There was a problem with the carriage bolt that attaches to the actual mounting extension and the company sent us another bolt very quickly, but it was defective as well. We took the bolt to Home Depot and for $1.49 got a replacement.  We are thrilled with this mounting arm and used it with this.Black Precision Gear Projector Mount (PRG-UNV)", "Date": "September 12, 2009"}, {"Title": "Just what your projector needs!", "Author": "Katrina K. Lawson \"Ben's Mom\"", "ReviewID": "R1ESG2O94Q2WBT", "Overall": "5.0", "Content": "Every good thing you'll read about this product is true.  I love how heavy-duty it is!", "Date": "August 31, 2009"}, {"Title": "doesn't bolt down tightly", "Author": "merzbow", "ReviewID": "RU1SEO5IEUKJU", "Overall": "2.0", "Content": "Avoid. A nut and bolt system with two washers is used to attach the short threaded piece to the end of the wall arm. Well, guess what, there is no way to prevent it from yawing back and forth every time you bump the PJ, no matter how much you tighten the bolt.", "Date": "August 8, 2009"}, {"Title": "Total Ripoff", "Author": "Paul", "ReviewID": "R3P7UVLZMU5U1R", "Overall": "1.0", "Content": "Complete piece of garbage and doesn't include anything you need......take your 40 and light it on fire.....completly disgusted and now I have to buy some other part to make it work.  What a joke Amazon.", "Date": "March 14, 2011"}, {"Title": "Simple with tons of screws, works well.", "Author": "ChillsnThrills \"Real Prof\"", "ReviewID": "R4A588WZF098", "Overall": "5.0", "Content": "Installed like a charm, and is give you tremendous flexibility with respect to vertical,horizontal adjustments.  However, one of the bolts included didn't fasten properly. I had to buy a new one at  Home Depot and then it worked.", "Date": "February 25, 2008"}, {"Title": "Great Wall Arm", "Author": "Matthew L. Mathis \"Home Theater Guy\"", "ReviewID": "R1YMHXWH71PDHN", "Overall": "5.0", "Content": "We have used about 10 of these wall arms and they are the best that we have found. They have supported every type of projector we have hung on them and are very solid.", "Date": "August 17, 2011"}, {"Title": "Awesome", "Author": "Jacob Jenks \"Jenks\"", "ReviewID": "R2N5NAIO6P3T1S", "Overall": "5.0", "Content": "The projector does everything its supposed to, and it looks better than I imagined! I would definately reccomend this!", "Date": "January 27, 2009"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B000AMC5E2"}}