{"Reviews": [{"Title": "Ignore what you've read from other users, PLEASE!", "Author": "K. Hueftle", "ReviewID": "RQJFVQZQ71K7T", "Overall": "5.0", "Content": "I read all these reviews and cannot FOR THE LIFE OF ME understand all the crying and whining about the WiFi mode. I keep hearing how \"complicated\" and \"annoying\" it is, but this is just plain WRONG. I actually set my WiFi up yesterday, and do you want to know how long it took me? About a minute. Pop in the setup CD, click \"wireless setup only\", plug your camera in by the USB cable (you need only do this the first time to set up! The setup CD will give you all the directions, just follow along), install it (takes all of a few seconds), choose your connection mode, name, and icon, and you're DONE. Then unplug the USB cable (you now no longer need it!), rotate the click-wheel at the top of the camera to wifi-mode, click \"ok\" and VOILA (you'll see the WiFi antenna flash blue). Easy as that, and it will download all of the images in your camera at a fast speed without any wires needed. How in God's name are people making this out to be a big deal?Read your manual and you'll be fine. I did my homework for literally months and ended up choosing this model. I know cameras and this is easily the best deal for the money. Do get familiar with the scene modes, they're absolutely phenomenal and there is something for every shot and angle. Each scene mode has a choice of 3 different effects, which is really nice. The variety of shots you will be able to take is second to none. 5 MP is a perfect compromise for image quality, resolution, and price. Nikon as always is top-rate. Photography is something that seems to run in the family and when my grandfather approved this camera, I knew it was truly great.The screen on this thing is AMAZING. 2.5 inches! The loss of the viewfinder is something you won't even notice, the LCD is a far more accurate tool anyway. Erasing pictures is simple, operating the zoom is a piece of cake, and the Zoom Nikkor lense is one of the best on the market, (along with the SchneiderKreuznach lenses on the Kodaks and the Carl Zeiss lenses on the Sonys). Nothing against Canon's Elph line because they're amazing, but the lense on the Nikon is better and I honestly feel that the Canon models are overpriced. Ever picked up an SD400 or 450? They feel far too tiny and almost flimsy. The SD500 and 550 are a bit better, but there's virtually NOTHING to grip. Trust me, when you want to really focus on a subject and get the perfect shot, the LAST thing you want is not to have a firm enough grip on your camera and have it slip. This also increases the likelihood of dropping it, which is never a good thing! Some complain that the red-eye reducer takes too long. The flash will go off three times in red-eye-eliminator mode, so if you're taking a picture of your dog, turn it OFF, (because the subject will have moved by then). For people though, it will be fine. The P2 comes with great software and it will take all of 5 seconds to remove red-eye manually once uploaded if the time before the final flash goes off bothers you too much. I've heard whining about the P2's size...why? Pick one up if you can look at one in person. They're wondefully compact yet still have a heft to them, and a very substantial hand grip that doubles as the battery casing. It's all metal and beautifully designed, the worksmanship speaks for itself. Nikon is a great choice, and I also recommend Olympus and Kodak (Kodaks are the king of easy-to-use cameras).Even full price for this camera is worth it (400 dollars), though you'll see it advertised from between 250-350, which are very fair prices. You're going to love it, it's a very capable little machine that will take you gorgeous pictures. Nothing is off-limits and there is a scene mode for any situation. I have NO regrets. The rechargable battery is good to have and will save you money. I HIGHLYYYY recommend you purchase LCD screen covers to protect your very-large LCD screen. These can be bought on Ebay in packs of 3 for about 10 dollars with shipping.", "Date": "March 16, 2006"}, {"Title": "Why Fi?", "Author": "S. Hizny \"light writer\"", "ReviewID": "R39ALH4TH546G", "Overall": "2.0", "Content": "I bought this camera and returned it before even using it's \"revolutionary\" wi-fi capability. I have used Nikon professionally for many years and was excited to see their latest consumer camera. Within 2 hours of testing it out at home, I decided to return it. The major problem I encountered was focusing. This camera would hunt from as far as 3 feet before it could reliably gain focus.Another problem for Parents, or pet owners is the redeye flash, without the rewdeye flash on, it's in every pic, with the redeye active, the preflash is so invasive and long that the moment is long gone before the image is exposed. Exposure was accurate, but color was a bit on the flat and cool side.For what it's worth I exchanged the P2 for the Canon a620. It was $50 cheaper 7.1 mp and much more reliable and speedy performance. No wi-fi, but your uploaded pics will be in focus and well exposed.", "Date": "October 21, 2005"}, {"Title": "Pretty good, but don't know if it's the best for your money", "Author": "matt b \"matt b\"", "ReviewID": "R1U8GG2ERUMZXX", "Overall": "4.0", "Content": "I got this as a gift, an excellent gift at that, but I had been wanting the SD550. This is a little bigger and bulkier, but the display is amazingly large and looks great. It fits in your hand nicely, although when mounting on a tripod, it feels rather lopsided. The wifi doesn't really have any network functionality, only to move pictures to a computer with the software installed on it... and this is one major issue: it doesn't explain how this software works, how it is running, what kind of security it is using (the camera literally just starts uploading pictures to a directory, not notifying the user on the computer, etc.)... and it only works 2/3rds of the time it seems. The antenna is extremely underpowered, apparently.Beyond being frustrated with the wifi, I really like the p2, and it takes GREAT pictures. It also has some pretty sophisticated features for a small point and shoot, but I never really had a problem using a cable to transfer my photos.", "Date": "October 18, 2005"}, {"Title": "Disappointing", "Author": "R. Turner \"wowser123\"", "ReviewID": "R2QMCFIAJVX1SM", "Overall": "3.0", "Content": "When researching cameras, I was blinded by the glamour of the Coolpix WiFi capability. Upon purchasing the camera, I was sorely disappointed by the camera itself. I found that it does the same things as other, more compact cameras. Why bother with the bigger size? For a small, compact camera, I highly recommend the Canon SD400 or 450. They are much smaller and take even better, sharper pictures than the Coolpix. The cord isn't a hassle so don't make your choice based on whether or not is has WiFi.", "Date": "November 7, 2005"}, {"Title": "Pleased with the camera frustrated with the Wifi", "Author": "techfan", "ReviewID": "R3RLOXJVW0DB5T", "Overall": "3.0", "Content": "Previous to this model, I had the Coolpix S1 and the Coolpix 800. Overall, I do not see much of an improvement over my Coolpix 800 camera. The P2 has some positives with more additional features and flexibility.I am frustrated with the Wifi. I have spent over 3 days working with getting it setup on my network. I am a very knowledgeable computer/network person but, find this frustrating. The Wifi seems to be a waste of money. I have thought about returning it a couple of times and exchanging it for the Kodak Wifi. The Kodak Wifi is supposed to be much easier to work with. With the Nikon you need to hook it up to the computer and upload profiles to the Nikon which is a real hassle.An update to my review. Nikon has an 800 number for tech support regarding wireless. They helped me setup the camera so, that it can work with my network some of the time.", "Date": "January 12, 2006"}, {"Title": "Nice small camera", "Author": "Grejam", "ReviewID": "R3KU5WWCZBWYID", "Overall": "4.0", "Content": "I got this for Christmas, I notice the price has dropped a lot since then!Good points: - Nice small size; easy in a pocket, lightweight - easy to use controls.  I like adjusting ISO/flash/WB - automated red eye removal works nicely, as does auto enhance - new lower price (wish we paid that)Less good: - Not sure the pictures are that stellar without editing - shutter lag slower than I expected, particularly with flash - wifi transfer difficult with XP firewall on.  I've updated  this review.  The Owner's manual under Ports gives 2 settings  to the Windows firewall to allow the camera to use wifi  with the firewall on.  Works great, but may not be for  someone who doesn't understand these issues.  The documentation does not describe this problem, you  apparently have to understand the issues. - Must remove battery to charge, flimsy plastic keeping it in  that I'm afraid is going to break. - Picture organizing software not great.  I want to be able to  delete photos, and only can from \"some\" directory views  of them.  I'd also like to easily lighten/darken and change  color tinting.  I keep going back to Print Shop poster making  software...I was agonzing over this vs the Canon A610.  I didn't likethe Canon's larger size or 4 AA batteries required.  I suspect the pictures may be better however...", "Date": "March 17, 2006"}, {"Title": "great features at a great price", "Author": "J. King", "ReviewID": "R24LNLT5W7V3NZ", "Overall": "5.0", "Content": "I was looking for a snapshot camera to replace a 1.3MP camera function on a Canon video camera.  The Coolpix P2 is compact, and takes capable pictures in most settings.  Auto red eye reduction works as advertised.  Wifi capability helps reduce wire clutter in transferring images.  I set up an adhoc or peer to peer wifi connection.  I Recommend reading the good techical help section on Nikon's website to help you set it up.  It is found at:  [...]  Screen resolution and size is adequate, if a bit difficult to see under bright outdoors.  A helpful feature I found is the built in \"help\" function.  If you can't remember what Effect 1 and Effect 2 accomplish under the Party/Indoor setting, the help button will tell you.  Now you don't need to carry around the camera manual.  Facial tones seem natural, landscapes pleasant, with blue skies.  Great snapshot camera.  Prints came out very good to excellent also.", "Date": "February 26, 2006"}, {"Title": "Great camera at a  great price", "Author": "kwatson", "ReviewID": "R2IL2GO44J1AYB", "Overall": "5.0", "Content": "First of all The wifi IS a very cool feature! The only other camera with wifi that I found was a kodak for several hundred dollars more. Works from about anywhere in the house and outside and I love not having to dig around in the drawer to find the cable and hook it up etc.I was looking at the similar cannon models but they were $100 more with no wifi and a half inch smaller screen. The only cons I can see is that you need quicktime to play the videos and it is a little bigger than the cannon models but still fits in your pocket nicely but isnt so tiny that it is hard to hold. I also like the contoured edge that acts as a handle for a good grip. For $239 you cant go wrong.I gave it 5 stars because of the price and the wifi and the overall features.", "Date": "February 8, 2006"}, {"Title": "Do Not Buy The P2 For Its Wi-Fi Capability", "Author": "CMH \"-cmh\"", "ReviewID": "R238WXH2G2JJXB", "Overall": "3.0", "Content": "The P2's overall quality is quite good as one would expect from a Nikon product  However, the wi-fi capabilty is poorly done for two reasons:1) Wireless support software ONLY runs on XP; this bit of info is not listed anywhere I have found including the product's packaging2) Must upload a profile to the camera from the PC (i.e., one cannot configure the wi-fi in the camera itself)The only reason I did not return the camera is because even without the wi-fi capability, the camera is still a good value.", "Date": "February 11, 2006"}, {"Title": "Awesome camera for the price", "Author": "obiwan103", "ReviewID": "R1Z94TXQ0N4LAH", "Overall": "4.0", "Content": "This was the ultimate bang for the buck.... works great, takes good pictures.  Best camera you'll find for under $100.  The only letdowns: (1)The Wi-Fi turned out to be a proprietary setup that could not be easily configured (if at all) to work with a normal Linksys or D-link home network for file sharing with PC's.  I gave up and used the usb cable instead.  (2)Also uses a proprietary battery that runs out long before your memory card does, and of course it only comes with one battery.  (3)Also uses proprietary cable connectors, so if you lose your cable, you have to $pecial order another one from Nikon (vs. other cameras that use standard mini usb and A/V cables that are interchangeable with other devices)", "Date": "November 26, 2007"}, {"Title": "ok camera", "Author": "Avery Bennett", "ReviewID": "R2COTGWB5DDRO4", "Overall": "4.0", "Content": "i'm in the army and i got this camera as a field camera. i have taken it everywhere with me since then and it has proved to be a very durable camera as well as taking good quality pics and video. I have used it in temps of -30 and 120 and it has worked just fine when other cameras wouldn't. the only reason i'm not giving it five stars is because the wifi feature only works every once in a while. other than that this is a great camera.", "Date": "September 3, 2006"}, {"Title": "Great Camera!", "Author": "Kris", "ReviewID": "ROHJT4O3HFODS", "Overall": "4.0", "Content": "I've had this camera for 6 years and I've loved it! Great quality pictures! The video quality was good for 6 years ago but now that HD is here, it's ok. I'm now looking to purchase a new camera just because this one has gotten great use and it shows with the dings and such. Also, i want HD video to capture great memories of my 2 year old! I definitely recommend this camera!", "Date": "November 25, 2012"}, {"Title": "Nikon Coolpix P2.5", "Author": "aloh", "ReviewID": "R2GHX2YAX2UCFM", "Overall": "5.0", "Content": "Very pleased with the purchase.  Owned the same camera previous.  It broke and the repair cost was more than this purchase.", "Date": "February 7, 2011"}, {"Title": "Fantastic Camera using built in Wi-Fi", "Author": "MotorCitySarge \"MotorCitySarge\"", "ReviewID": "R3I34VABGFCC6Q", "Overall": "5.0", "Content": "This has to be one of the easiest digital cameras for transferring your pictures with the built in Wi-Fi.  Super simple to set up and so much fun during parties being able to update your community web space without even having to use a USB or Fire-wire cable.  Fantastic long battery life.  Makes a great video camera, then transfer to your PC via Wi-Fi and publish.  Simple as that.", "Date": "September 12, 2010"}, {"Title": "Best point and shoot I have had", "Author": "Thomas R. Reno", "ReviewID": "RQN8GK9NSA7JW", "Overall": "5.0", "Content": "I have 2 of these cameras and love the battery life. They are dependable. I think anything over this MP is a waste unless you are making posters? The refurbs are under $100 with the charger and all. Just bought an extra battery and memory card. Well pleased with this little camera packed with features.", "Date": "November 18, 2009"}, {"Title": "Coolpix Camera", "Author": "E. Feest", "ReviewID": "R3V8MJH2OCNDZW", "Overall": "5.0", "Content": "I purchased this camera to replace one (same model) I had lost.  It came with everything my original camera I purchased in the store came with, at a much lower price.  I couldn't be happier with this purchase.", "Date": "December 27, 2007"}, {"Title": "Excellent Digital Camera", "Author": "J. M. Valenzuela \"juan manuel\"", "ReviewID": "R9EC5R6M4ITNS", "Overall": "5.0", "Content": "I had reflex Nikon cameras previously and this is my first digital camera, and im not disappointed.Wonderful quality of the pics, very customizable, lot of options and of course easy to use. Worth the money. 5.1 megapixels are enough and the quality of the photos are superb. The Wi-Fi is a bit more complicated for non-advanced computer users, but works fine if you search through forums and read how to setup.The construction of the camera is solid, very confortable for the hand, but you must have good pulse with your hand or the pics could be distorted, otherwise is an excellent product.", "Date": "November 9, 2006"}, {"Title": "not very good", "Author": "haywood", "ReviewID": "RRE4S4NBKVBKF", "Overall": "1.0", "Content": "the camera stopped working after 3 days I'm still trying to figure out is it the batteries are its cameras self will not charge up", "Date": "January 28, 2013"}, {"Title": "Poor Nikon support makes this one useless", "Author": "R. Klaassen \"musicnmorestore\"", "ReviewID": "RKXTC9ISWX5BM", "Overall": "1.0", "Content": "Bought this because of the wireless connection.Works fine with Power PC Macs, but Nikon has and will not provide software that will work with Intel Macs.Therefore this was the last Nikon product I ever bought.", "Date": "August 27, 2008"}, {"Title": "Its ok.", "Author": "M. Hertzler", "ReviewID": "R2VHB441E58YN0", "Overall": "3.0", "Content": "It has been 3 years since we bought this camera. In that time, we have used it a lot for movies and photos.The pictures were ok but not bad for the price (3 years ago). The movie quality can be increased, so we did that and have been pretty happy. Although if not is bright light, the result is grainy.The Wi-fi is a joke. We set it up on my husband's mac and never got it to work on the PC. I have an SD slot, so we mostly used that.The one thing that puzzles us is that almost all of the tiny screws have disappeared. Strange.", "Date": "August 22, 2008"}, {"Title": "camera", "Author": "T. Joe Larive", "ReviewID": "R1X2IH66KHISNL", "Overall": "5.0", "Content": "This is my second P2 camera.  (I drown my first on at the Great Barrier Reef.  Dive case leak)I like the battery as it lasts 100s of photos on a charge.  The photos come out great.  I can plug it into most any TV and show my photos.I throw it around and leave it in a hot car and it keeps working great.  If I lose this one, I'll get another one just like it if the are available.", "Date": "April 5, 2008"}, {"Title": "Average Camera", "Author": "Mr. K. B. White \"Blue\"", "ReviewID": "R1EDO8FZR7E47T", "Overall": "3.0", "Content": "It's an Ok product, but I find the auto focus isn't near as good as my 4.1 MP Kodak.  In fact most pics come out blurry.  But when it actually captures properly it's crystal clear.  Just have to be patient with it.  But I'm contemplating going back to Kodak or trying Sony.", "Date": "January 9, 2007"}, {"Title": "Excellent camera", "Author": "Unmesh Khope \"Unmesh\"", "ReviewID": "R10J4RZBGN96P9", "Overall": "4.0", "Content": "Initially I decided to by this camera for the sake of brand Name. After buying initially I was not happy with the pics I was getting. Then I tried changing settings and change in the quality of snaps was a miracle.I am happy on my decision to buy this camera. Not exactly value for money but is satisfacory.", "Date": "March 22, 2006"}, {"Title": "Iffy Wi-FI", "Author": "G. A. Vandercook \"gav\"", "ReviewID": "R1Z7N55Z3DNDPL", "Overall": "2.0", "Content": "It's not an item to write home about.  Final picture quality is usually OK but not spectacular.  The wi-fi works some days, mostly not.  If I'd known then what I know now it would still be on the shelf or in the hands of some other poor purchaser.", "Date": "May 5, 2006"}, {"Title": "I have thought of breaking this thing....numerous times.", "Author": "Jerry N. Strickland", "ReviewID": "R1RGOQS9IRM3F6", "Overall": "1.0", "Content": "I have had several people take my pictures.At first,everything is fine.The pictures are ok.THE NEXT DAY,my face looks like a pile of baby vomit.It is soooo blury.Then it got 2 the point where every picture I took was blury.I tried fixing it online(like on the program for the camera)and it would not work.I HATE THIS CAMERA!!! Not to mention the battery sucks.It lasts maybe 3 1/2 hours.This camera should be $99.00.TRUST ME PEOPLE......IF I COULD RATE THIS THING AT A ZERO I WOULD.IT IS NOT WORTH IT.HOWEVER,a camera i absolutely love is the Sony Cybershot DSCT5.An awesome little camera.", "Date": "June 11, 2006"}], "ProductInfo": {"Price": "$199.00", "Features": "5.1-megapixel CCD captures enough detail for photo-quality 13 x 17-inch prints\n3.5x optical zoom; 2.5-inch LCD display\nFace Priority Autofocus and In-Camera Red-Eye Fix; transfer and print images wirelessly with built-in Wi-Fi connectivity\n16 scene modes; macro setting focuses as close as 1.6 inches from subject\nPowered by lithium-ion battery (battery and charger included); stores images on SD cards (16 MB internal memory included)", "Name": "Nikon Coolpix P2 5.1MP Digital Camera with 3.5x Optical Zoom (Wi-Fi Capable)", "ImgURL": "http://ecx.images-amazon.com/images/I/41AR4907BTL._SX300_.jpg", "ProductID": "B000AXQVK0"}}