{"Reviews": [{"Title": "Super Camera!", "Author": "G. Dingle", "ReviewID": "R3CS24LICUTSJU", "Overall": "5.0", "Content": "I've had the Olympus SP-500 for about five days.  I started out taking simple portrait shots and was pleased with the quality.Today was the real test of why I bought the Olympus SP-500 - the ability to zoom in close and catch action shots at my daughter's soccer games.  The result?  I'm very impressed.  No 'action blur' to be seen, the pictures look great, and with the 10x optical zoom there was no need to keep running around the sidelines trying to get up close to the players.I was concerned about comments I've read about other cameras with a high level of zoom needing image stabilization (or otherwise the zoom would be worthless).  Not the case here.  No image stabilization on this camera and the pictures look great.  Just remember to put the scene setting on 'Sport' rather than leaving the setting on 'Auto' when taking action shots.I've played with video mode and liked the result.  The controls are easy to reach and the menu system was easy to understand.  Having a dedicated 'trash' button is a nice touch.  And with manual controls and the ability to add additional lenses, I think I have a camera that can grow with my abilities.I'll post again if I run into any negatives.  For now, I couldn't be happier.", "Date": "October 15, 2005"}, {"Title": "Point and shoot with SLR Speed?", "Author": "Sinister Minister", "ReviewID": "R2H1GTOOVAHWER", "Overall": "4.0", "Content": "Hi All!Sin Min here with another run down for you on a new camera. Now, I don't own this one but I have given it some hands on testing and I was impressed enough, that I thought I'd pass it on. As some of you know (or may not know) I work as a Pro pix taker by day, and sell cameras for BestBuy by night (hey gets me out of the house!) So I basically spend 90% of any given day with a camera in my hand. The SP-500 UZ is one of several new models being offered to the public by Olympus this year. We have recieved three of these so far and this camera is best of the lot.The size of the camera is deceptive, when I first saw pictures of it i thought it would be around the size of the immortal C-8080! But it is about 45% smaller with twice the Zoom!Hmmm-impressive to be sure. However with only a 6MP CCD I lost a tad of enthusiasum (I love to shoot at 7MP or higher).Olympus hasn't changed much as far as menu layout, operation, and basic functions, however looks can be deceving. When the camera arrived at the store I was in the process of setting up the camera for display, when a customer came up and asked me about differences in speed between point and shoot cameras, prosumer cameras, and the SLRs. I proceeded to tell him the usual...how SLR cameras will always be faster than point and shoot, smaller point and shoot cameras are built just for snap shots so If your looking for speed you need more camera, blah, blah. Except for some of the Sony point and shoot cameras which have a fair speed rate.Anyway, so here I am telling this guy, how point and shoot cameras are so slow, I said \"Here take this camera for example.\" holding up the SP-500. \" I'll set the camera to \"Burst\" mode and you'll see how much slower it is.\" So I set it up hit the shutter and all of a sudden...POP!POP!POP!POP!POP!POP! This dinky little point and shoot camera pops off about 15 shots nearly as fast as the D-50 I just showed the guy! I'm standing there looking like someone just smacked me in the face with a 2X4, and he's looking at me like I should be selling CDs or something!! Long story short the guy bought the SP-500!Now I own a C-8080 as well as an E-300 SLR and as near as I can tell from taking pictures within the store the overall picture quality is on par with Olympus higher end cameras, The Pictures are clear and bright, and the sharpness levels are all great. I can't say how the camera would fare in ambient or low light (not much low anything in BestBuy) but I assume the SP-500 would perform in a similar fashion to my cameras.The SP-500 is the latest in a new trend of digital cameras, that I like to call \"Power Point N Shoot\" Higher resolutions 7 and 8MP, more features but still the same crappy 3x optical Zoom.(Except in the case of this camera) One of the new Olympus models is a tiny camera with 8MP and a hot shoe!! The freaking flash would be twice the size of the camera! I Gave the SP-500 only 4 stars because of the cheesy resolution they gave the camera. At the size it is , if they had made it 7 or and 8MP it would have been something to really be excited about. But as I said whatever else this little camera is fast...Very Fast!!Thanks for reading and Happy Shooting!", "Date": "October 16, 2005"}, {"Title": "Power packed, stylish, intermediate camera", "Author": "artknows", "ReviewID": "R3A3MBH9S70AM9", "Overall": "5.0", "Content": "First, let me say that I am always suspect when I see poor reviews of a product, right next to shining reviews. Who is right? And you can't ask any follow up questions like in a forum. In this case I think the positive reviews are right.The Olympus SP 500 UZ is a very nice camera for the beginner to intermediate photographer at an excellent price point. You can spend more and get more.  You can spend less and get less. However, this camera has a host of great features that are designed to give you more control and creativity over your photos.Olympus is a solid brand name and they have made many GREAT cameras in their history. While my experience with the SP 500 has been brief, I like it a lot and hope that it continues to delight.Some of the decision factors that pointed me to the SP 500:AA Batteries: On my two other digicams I use rechargeables. Cheap, easy to find. Can use alkaline if you run out. Other cameras have a proprietary or \"special use\" battery which costs $$ to replace and if you run out of battery power you are forced to recharge.  Me, I just pop in some fresh AAs.Lens:  Olympus has always been known for making a nice lens.  This camera has good optics in my opinion and is reasonably \"fast\" at f2.8.  The wide angle is wide enough for me, and goes to 10x zoom. Very handy.Large LCD Display:  2.5 inches is really nice on my 40 plus year old eyes.Threaded Barrel: Allows for easy addition of filter (prevent scratches to lens) and additional lenses.27 yes 27 shooting modes! I can't wait to try them all.6.0 Mega Pixels.  That's one more than 5!! I can't say I've ever enlarged to more than 8 x 10.  Perhaps with this camera I will.Well that's what sold me.  I'm sure others will disagree.  No camera can take perfect shots every time.  That's where the user comes in to the equation.  If you are getting a lot of bad shots with this camera, maybe it's not the camera (sorry).", "Date": "November 15, 2005"}, {"Title": "Excelent Olympus Camera!!", "Author": "C. Gimpel \"viper\"", "ReviewID": "R3733Y93XGQKVF", "Overall": "5.0", "Content": "I for one am also a buyer who reads a lot of reviews before making the purchase.  Specially when you read reviews of people that have had problems with their purchase.In this case however, I'd like to say I'm very pleased with this camera, it's simply loaded with features.  There's a couple of people which state that the pictures look blurry but I guess the camera isn't set correctly.I'm not an expert on the subject but I've own two other previous Olympus cameras (C4000Z and 750)of which I still have the C4000 and the SP-500 is incredibly fast.At first impression, the camera might seem toyish due to its lightweight and plastic casing, but once you've shot about thirty pics and start to get the hang of the camera, you'll see how simple to use it is, and how fast it records, erases, turns on and off.The zoom is impressive, there are also people saying it should have image stabilization but if you think about it, at 50x zoom you would have to be a sniper not to move the camera too much and probably the image stabilization would have made the camera a little bit more expensive.  The only downside to the zoom is you need good lighting conditions in order to take a good picture but other than that it's pretty great.The integrated flash is also impressive, if your subject is within range, you should get crisp pictures.I love the new Master Software, it simply organizes everything better and in the camera, you are also available to see which photos you shot when, due to its built in calendar and organazing system.To sumarize... this camera is no toy, it comes with an array of features you'll probably need to do some reading to be able to use to their full potential but if you dedicate your time to it, you'll be very pleased with the results you can get from this camera.  If you only want a point and shoot camera, then there might be other options out there, however, this is one great camera and for the price I doubt you'll find anything better out there.I do recomend you purchase a case for the camera, I've got a Tamrac Digital 5693 and it protects the camera nicely plus it's got your basic storage pockets.  Also, you should consider 12 rechargable batteries, not because of the camera (you can actually get 80 shots off before having to change batteries), but because it's necessary to have always a spare group of them, just in case.Now, if you own a Palm, Ipod or another sord of storage device which supports USB normal drive mode.... then you should also consider the Belkin USB Anywhere device, so you can conect a simple USB Flash Memory, or a Palm or other USB Hard Drive to your digital camera and not have to take your laptop or wait till you can reach a PC to download your photos.  This little gadget is very usefull, can be battery operated and can save you from loosing valuable moments for which you wish you had more memory in yor camera available.", "Date": "November 28, 2005"}, {"Title": "Surprised by quality, value.", "Author": "Victor L. Sanders", "ReviewID": "R2OV4Q5MHCXXRS", "Overall": "4.0", "Content": "This camera was a gift, though I really wanted the D70 (still waiting for the price to drop), I am really surprised at how great this camera is. I still love my 35mm. I used the Nikon D70 for about a year, and it was so easy to manually control. I wanted the ease of use and ability to have full control, just like a true 35mm, in my own digital camera. The SP500UZ has given me this, and so much more. I love the ability to manipulate colors- I dont like to use flash when it will wash out my subject, and adjusting lighting conditions in the camera gives me that option to get a great picture, without the washed out look.I have heard a lot of complaints about blurry pictures, and that isn't always the cameras fault. Being aware of every control and there function on your camera will help you get that perfect picture, everytime. The SP500 it seems is built for more advanced users. Anyone could simply buy a point and shoot camera,  and the quality would be about the same as if you put the SP500 on 'Auto'. If you really want to advance your pictures, and your abilities, consider this camera. Ive found it to be a great toy to play around with and get some beautiful pictures out of.I gave it only four stars becuase the Menu functions are sometimes difficult to understand, and could have been designed better. Also, the tones and beeps are very annoying- I like to know via sound when a picture has been composed, but that option isnt available without turning on all beeps within the camera.", "Date": "January 7, 2006"}, {"Title": "Excellent family camera for the price", "Author": "C. Walsh \"Cliff\"", "ReviewID": "R2T650QLXDIVYI", "Overall": "5.0", "Content": "To begin with, I am an amatuer photographer.  I've played with different types of cameras for years and went digital a few years back.I've had an Olympus C3000 for about four years.  It has a 3x zoom with 3.3 mp.  The photos were mixed.  So long as I didn't overuse the zoom, photos came out pretty good.  But it still couldn't beat a 35mm.  The SP-500 UZ takes such better quality photos, that are clearer than most of my 35mm photos.The zoom is incredible.  10x will allow you to pick up objects from very far away that you'd never be able to see with a 3x lense.  The 6 megapixel tightens the grain to near perfect quality.  I just took this new camera on vacation through Yellowstone, Mt. Rushmore and Park City, UT.  The photos I shot are a dream compared to pictures I've taken in the past.A couple of great features this camera has are a quick delete button, which allows you to delete photos while viewing without going through a long menu.  Another feature that helps with busy backgrounds is a targeting viewer that works with you to lock on the specific area to focus.  It doesn't just center in the middle of the viewer, it points to potential areas of focus.The last thing I will say is I took probably over 450 photos on a 512mp Olympus media disk.  I deleted several of the shots I didn't like after comparing several similar photos and still had room after a week's worth of shooting the countryside.  Uploading doesn't take long at all.I checked a lot of websites and was seriously thinking of buying a Minolta this time.  But, after reviewing all the reviews, I found people had the fewest issues with this camera.  Having already used an Olympus made the decision easier.  Four years with the C3000 and no real issues except the Camedia software, which is now much better; no issues getting the software to load correctly.  The final thing I'll say about this camera is that I \"feel\" like a better photographer using this new camera.  See some of my photos from the trip in the gallery.", "Date": "June 15, 2006"}, {"Title": "Excellent for the value", "Author": "Skip \"Evan\"", "ReviewID": "R32IN0OLE8B1QT", "Overall": "5.0", "Content": "I bought this camera for my parents for Christmas and spent plenty of time looking up reviews on different prosumer type cameras. Image quality wise this camera is excellent. For an Olympus, they've done some really nice things such buttons that are for one purpose and bright menus w/ explanations especially in scene modes.  This camera has a lot going for it especially with its 10X optical zoom being on par with others w/ 12X. (S2IS,Z5,) No image stabilizer may turn off some but I found it a non issue when using the viewfinder. Shutter speeds are excellent and prevent blur when in the right scene mode. My only concern w/ the camera is the lack of a diopter for the EVF. People with glasses may be turned off by that omission which I feel is a mistake.Positives:Great image quality (Accurate 6MP)Good color representationQuick shutter speedsNice large 2.5\" Bright LCDExcellent Build (fits hand nicely)Negatives:No Diopter for EVFNo image stabilizer (but not everyone needs it)Plastic Feel (Not enough metal)Macro mode only available through menu (not click wheel)In closing... I know my parents will enjoy this camera especially for their cruise in Hawaii. The picture qualities will be excellent and if someone is looking for a camera w/ the ability for variety of shots and a great price, The Olympus SP-500 UZ is an excellent choice.Recommended Accessories:At least 512 MB XD CardAll Weather CaseNIMH Rechargeable Batteries", "Date": "December 29, 2005"}, {"Title": "Not a good camera if you want to take quick pictures.....", "Author": "S. vaneck", "ReviewID": "RO2LM7MDQKH3U", "Overall": "2.0", "Content": "I bought this camera because I wanted to take good quality point and shoot pictures, and still have the manual type capabilities that I was so fond of with my old Pentax K1000 (manual 35mm SLR).  For me it fails on both fronts.  It isn't a good point and shoot, and the manual capabilities are cumbersome.First, let's talk about its point and shoot functioning.  When I go outside on a good day and take pictures of people in AUTO mode about 75% of the pictures are out of focus.  This is due to a lack of image stabilization and in my opinion a poor auto focus system.  I suppose I can do better if I put the camera in SCENE mode and then select the best of \"21 situation-related modes\", but will the moment still be there when I am done?Additionally, the default file compression on all of the automatic modes (either AUTO or the 21 SCENE modes) is the lower compression HQ.  Anytime you turn the camera off and on or switch to or between automatic modes the camera returns to saving the pictures in HQ.  HQ compresses the files to about 1.3 megs resulting in a lower quality picture.  So if you actually want to get high quality pictures in any of the automatic modes from your 6 MP camera, each time you switch to one of the automatic modes you need to go into the menu system and set it to SHQ.  I have called Olympus, and there is no way to avoid it.  Had I known this alone I probably would not have bought the camera.I've got two small kids.  By the time I am done getting the Camera set properly the moment will probably be gone.  I agree that it is capable of taking high quality pictures, and would probably be good if you were going to an event and had plenty of time to get the settings right, but it isn't a good camera for simply taking a quick picture (capturing a precious moment).It is a very strong camera when it comes to manual capabilities, but the problem is that they aren't real easy to use.  Unless you are repeatedly taking the same types of shots, expect to spend a lot of time fiddling with the menus.  My old manual Pentax K1000 is far far more user friendly in this regard.Additionally, it has one of the worst manuals (perhaps 2) I have ever seen.  The basic manual does little more than explain the very basics while telling the user to figure the camera out for themselves.  While the advanced manual is 190 pages long (enjoy printing that), it lacks critical pieces of information, is poorly organized, and doesn't go into detail about how the camera really operates.  I'll toss out a quick example: on page 50 it tells you how to switch between the different MyMODE scene settings in the menu, and on page 113 it tells you how to set them up.  On neither page does it tell you that you must first set them up before you can switch between them.Finally, there are some good qualities to this camera.  It has a good feel to it and good build quality.  It is capable of taking very good quality pictures.  It has excellent battery life if you simply buy some lithium ion AA batteries (use the batteries that came with it as spares).  Finally, it is probably a very good camera for fixed function work.  If you are going to take one type of picture regularly, you can tweak the settings exactly how you want them so that it will consistently take good pictures.PS Probably a good idea to use the 'pixel mapping' function once after buying the camera.  The manual doesn't explain what it is doing, but it is likely that it cleans up any dead pixels that the camera may have by having it duplicate a nearby pixel.", "Date": "April 18, 2006"}, {"Title": "I recommend this camera", "Author": "Kukkimom", "ReviewID": "R1Z3ZINAK1VJAY", "Overall": "4.0", "Content": "I researched my choices extensively before buying this camera and narrowed it to a Konika, a Pentax Lumix and this one. I am very happy with my choice. I wanted a quality camera without the hassle and expense of bulky, higher-end camera like the Rebel. Although I like the idea that it can change lenses, I don't think I'll ever bother with that feature. I wasn't interested in shooting professional grade images -- I just wanted nice family photos with a camera that had short lag time between click and capture, large lcd screen, ability to use viewfinder or lcd screen, and sepia/b&w; options, and this fit my needs perfectly. The software that comes with it allows you to make edits such as cropping, sharpening, and red eye removal, and I really like that. I think the 6 megapixels and 10x optical zoom are great.  I also have enjoyed the many pre-set shooting modes for landscape, landscape+portrait, sport, indoor, candle light, etc. They make it super easy to use. This one (compared to the Konika) fits in the carrying case that my old film automatic fit in. It's a little large for a purse but will fit in there when necessary too. Sometimes the auto focus goes funky and can't decide where to focus and the whole image ends up blurry, but I think that is common with digitals and is likely something I'm doing wrong, as I'm still trying to get the hang of shooting digital. There is some noise in the details, especially shadow areas if you enlarge drastically but for all intents and purposes, the final output (I get 4x6 size prints) is very crisp and the color fantastic.", "Date": "July 7, 2006"}, {"Title": "This is one FINE camera!", "Author": "Debra Koch", "ReviewID": "R2M0LQOQ2U746C", "Overall": "5.0", "Content": "I have had my SP-500 UZ for about 2 weeks. I am in awe of the amount of features, picture quality, and ease of use for the money. I have tried the macro and super macro mode with unbelievable results. The auto mode with flash up took pictures where I could see the pores of my subjects face with realistic skin tones. Flash settings are adjustable. I've only tried a few of the 21 scene modes but had fine results. Some I have tried are snow, auction, available light portrait, Indoor, sport, and landscape. Inside and outside pics have been high quality. Complete manual mode is available as I learn more about the settings. The only thing I have any concerns about would be the fact that when I get close to max 10X zoom, some pics were blurry unless I propped my arm against something. I suppose a mini tripod would solve that issue. But I know of no other camera with the immense amount of features and quality of pics even close to this price. This camera can be a simple to use point and shoot or a full featured manually controlled device. Super fast with great battery longevity. I did purchase the Ni-Mh rechargeables though. Hope you'll be as happy as I am with this great camera for a great price!", "Date": "December 10, 2005"}, {"Title": "Mostly great camera", "Author": "Laubre Martin", "ReviewID": "R13W5UDCCOHTM3", "Overall": "5.0", "Content": "This camera is great!The large screen, though compact size, really handy functionalities that I still keep discovering, and of cource, great quality of the images make this camera wonderful and loveable. User can choose between image quality settings to compromise between quality and memory occupation while the highest setting - SHQ (super high quality) - really makes superb images. Try that with macro zoom and discover exciting unseen dimensions!Things that are not that great are:Since the focus is fully automatic, it takes at least few seconds for camera to get ready for shot. Therefore one cannot snap pictures to catch any desireable moment. There is a program to take sequence of pictures while only first take must be focused.  That helps a bit.Another thing is that dark images seem bit fuzzy. The darknes itself is never black-dark, but covered with dark-coloured mist.All that with the price make the camera wonderful for most of users in most of situations.", "Date": "May 25, 2006"}, {"Title": "an awesome camera", "Author": "Sarah M. Wu", "ReviewID": "R21ZOXI132X1UH", "Overall": "5.0", "Content": "I love this camera!It takes a little getting used to all the settings, but once you know them it s great.The camera takes great pics, especially when using the personalized settings. I take photos for a high action band in a lot of dark night clubs, and this camera takes the most amazing pictures. I put it on the sport mode and then do the five shots per click setting and I m telling you all the pics rock.This camera can be a little fussy if you do not set it right and it takes practice to get the pics right, but once you know what your doing I m sure you ll love it.", "Date": "February 24, 2006"}, {"Title": "Outstanding Camera", "Author": "James May \"Maybejim\"", "ReviewID": "R1MSHDOP1VJKGK", "Overall": "4.0", "Content": "I've had my SP-500 since just before Christmas and it has performed extremely well.  I just had a 12 x18 and 16 x20 enlargement done and the quality was very good.  Costco recommended against the 16 x 20 but I found the picture to be excellent with no noticeable grain unless you get extremely close.Image stabilization would be a nice addition but by being careful and/or using a monopod I have gotten excellent pictures even at full zoom.I would recommend this camera highly for immediate photographers.", "Date": "February 10, 2006"}, {"Title": "BUY IT!!!! You won't be desapointed", "Author": "Juan", "ReviewID": "R35O2KJMK4TL6Z", "Overall": "5.0", "Content": "I have tried this camera for the last two months and I am so impressed with it that I am thinking on buying another as a gift. The price is so low for the type of performance that it shows, the zoom is excelent. At the begining I tought it was pure advertizing BS, but I was wrong it really has an amazing zoom with an effective 6 megapixels. CLEAR, SHARP and HIGH QUALITY pictures all the time, I can't believe there is people saying they are getting blurry, low quality pictures....BELIEVE ME, this is not a camera issue, it is the user's experience, understanding and handling.Also I don't know if the other users have experienced this too, but i was expeting this camera to be a battery killer, but it was not, I found my self shooting at least more than a 100 pictures (most of them with flash)and I still had enough battery to keep shotting at least 50 more, I foud this great and I haven't seen anybody talking about this in the other reviews so I wanted to see if this only happened with mine or not.PROS: HIGH QUALITY -- EXELENT ZOOM -- EFFECTIVE 6MP --NICE COLORS --ACCEPTABLE BATTERY LIFE--NICE COLOR AND FEEL-- LIGHT WEIGHT AND HANDY--POWERFULL--LOTS OF PRESET OPTIONS FOR THE INEXPERIENCED...ETC.CONS: NONE SO FAR AND BELIEVE ME I'VE TRIED IT FOR SEVERAL HOURS DAILY FOR THE LAST TWO MONTHS.BOTTOM LINE: I Know you have searched a lot and you are thinking about this camera really much, I know you like it, I know you don't want to make the wrong desition, I felt this way too, but Olympus  sp500 didn't desapointed me nor let me down. IT IS YOUR DESITION, BUT FOR THIS PRICE AND FEATURES YOU SHOULD STOP SEARCHING NOW, BECAUSE BELIEVE ME YOU WON'T FIND ANYTHING LIKE IT, BUY IT!!!!!!", "Date": "December 31, 2005"}, {"Title": "Buy this camera!!!!", "Author": "Kazz", "ReviewID": "RVDE6U4VD32OB", "Overall": "4.0", "Content": "First of all, I am not a photographer. I do not dabble in this field, photography is not a hobby of mine, and I am so neanderthal in this arena I couldn't tell you what an SLR, hot shoe, or aperture is. Why did I buy a digital camera? My daughter, who is five, started T-ball and I wanted to capture the memories of a time that may never come again. I have bought many items from Amazon.com and thought I should look there first. I checked out the reviews for this camera and found them very helpful, but I'm skeptical so I checked out other websites and found close to 90 percent positive reviews on the sp 500. I decided to try it out. It....is...amazing! This is my first digital camera and it was worth every penny I paid. I've been told by other friends that the Olympus layout of the buttons are fairly similar, but since I've never checked out an Olympus layout, I took their word for it. I'm still learning my way around the buttons and where everything is on the camera, but I should be given some slack, I only received the camera yesterday (2-22-06)! The quality is fantabulous and if anyone saw the pictures I took, they'd think I'd been doing photography for a while. I have added the pics I took today to the sp 500 gallery so check them out if you are also a skeptic. Believe me, I am entirely new to this, but after trying out this camera, I've decided to expand my horizons and see what other incredible pics I can get out of this camera. The Olympus SP 500 UZ rocks!!!", "Date": "February 23, 2006"}, {"Title": "Fantastic! Updated: You may want to think twice.", "Author": "Shutterbug", "ReviewID": "R2GDQMYG9IDU9J", "Overall": "5.0", "Content": "I've also had this camera for about five days now, and was mostly taking pictures of house plants, and then outside taking pictures of the moon. Today I finally got to try it out, taking a nature hike, and also photographing airplanes taking off. The nature shots came out beautiful, vivid colors, the zoom was fantastic for getting close ups of wild life. The airplane shots turned out great, clear focus, great color, fantastic zoom.Edit to update:I've been using this camera for several months now, in all situations, various settings. The more I use it, the more disappointed I am in my purchase. With outdoor shots on sunny days, I couldn't be happier with it. Many portraits I have taken indoors, of my niece and nephew sitting perfectly still, turned out blurry, no matter how I set the camera, and I have a very steady hand. Zooming in all the way (optical, I don't use digital zoom) on a cloudy day (I live in Ohio, we don't get many sunny days) I was photographing a Falcon hunting, it was in a hard to focus place, so I found something to focus on the same distance away, then went to snap the picture of the falcon, and it still refused to focus clearly. It also had a lot of noise in the picture. I had the camera steady, and set, so it should have worked.Macro pictures turn out less than perfect, even in bright sunlight, where it should focus near perfect on the subject. This disappoints me since Macro pictures have always been my favorite pictures to take.I bought this camera after a great experience with Olympus, and my father's SLR Olympus, and am very sorry I did. I am about to buy my own SLR, and am not going to go with Olympus as I would have several months ago. Perhaps I just ended up with a lemon. But I would strongly suggest passing by this camera.", "Date": "October 15, 2005"}, {"Title": "Olympus SP-500 Ultra Zoom", "Author": "Donald  W", "ReviewID": "RS4HFZIV473I6", "Overall": "4.0", "Content": "The camera is an upgrade from the C-725 3MP 8X Zoom and is a major improvement particularly with a much more convenient menu system and scene mode. The screen is much larger and it is easy to transfer from the screen to the viewfinder. I am not impressed by the manual that does not provide sufficient detail for the various functions. The software provided (Olympus Master) transfers images rapidly but they are difficult to find once downloaded even using the calendar. Panoramic stitching using the software has not produced satisfactory results even when using a Panamatic fitting on a tripod.The camera is well constructed, easy to handle and relatively light weight. For regular use it is much more convenient than my Canon D350 SLR and the quality of the images has mainly been very satisfactory. I am pleased that I purchased the SP-500 UZ.", "Date": "July 9, 2006"}, {"Title": "Olympus SP-500 UZ once you get the feel of it... It's  a nice quality camera!", "Author": "Holly M. Majka", "ReviewID": "R2VBVK1GG7ZR00", "Overall": "4.0", "Content": "I really love this camera.  Initially, I have to admit I was frustrated because alot of my pictures were blurry. I was cursing myself for giving up my Olympus C-50.Once I started to play around with the features and became more comfortable with it I am very pleased with it.  I think using a higher capacity memory card could be a plus.  Shooting in auto mode can almost guarantee a great shot, coupled with allowing the shutter button to lock the picture in place.  Great battery life!  The scenes are really fun to work with.  I also invested in the Olympus wide conversion lens (17-WCON).  I am so happy that I did.  I am able to shoot wide angle group and landscape shots without ommitting something from the picure.There are some minor issues such as the camera is somewhat larger than I am used to.  It is however, lightweight, even if you end up having to \"lug\" it around.  The external flash is well hidden and sometimes is forgotton as a result.  There is no stabilization to this camera, however once you grasp the understanding how the camera operates, you can get passed this.  For the money, you cannot beat the quality pictures, the loaded features as well as the construction of the SP-500-UZ.", "Date": "June 1, 2006"}, {"Title": "Good camera but not without a few problems", "Author": "F. AHMAD", "ReviewID": "R3APHWPYV9D4T4", "Overall": "3.0", "Content": "PROS:1. Good image quality2. Big LCD screen3. Can shoot RAW4. Semi-Auto. modes available (Aperture/Shutter priority)5. Dedicated buttons for commonly used features (e.g., flash, trash, display, print, and quick view...these allow the user to bypass navigating the menu)6. Display/frame-assist shows a real-time histogram and also shows a 9-part grid in the LCD (for the novice new to the rule-of-thirds).CONS:1. No image stabilization.2. Not sturdy...the lens on my SP-500UZ rattles, both, when closed or open.  This problem has existed since I first opened the box (does anyone else have this issue?)P.S.  I wanted to give this camera 3.5 stars but the option was not available...hence, the 3 stars!", "Date": "December 30, 2005"}, {"Title": "Soft Focus but Feels Good", "Author": "Janet Johnson", "ReviewID": "RJ8OEX6X0DAAC", "Overall": "3.0", "Content": "I really wanted to like this camera, but I finally decided to send it back and get a different one.  Main reason: soft focus.  It's very important to me to get extremely clear photos, and I was used to the clarity of the Olympus C740 UZ.  This camera never gave me as clear a picture.  I ended up with a Canon S2 IS, which is reasonably sharp, and takes excellent movies with sound as well.  I also recommend the Olympus C765 as a sharp photo camera.  The best thing about the SP500 UZ is the way it feels in your hand.  But that wasn't enough.  I do miss that part though.  Get this camera if you like soft focus.", "Date": "June 22, 2006"}, {"Title": "I couldn't be happier!", "Author": "Samantha L. Gibbon \"spiritual seeker\"", "ReviewID": "R2ELROIH67FWP", "Overall": "5.0", "Content": "This is my first digital camera, so I don't have alot to compare it to, but I did research cameras intensely before purchasing this model, and it got amazing reviews on more than one reliable website.Now that I own the camera, I must say that I am extremely pleased with it.  The pictures are clear and crisp, and the colors are brilliantly reproduced.  The other night I decided to go out into my pitch black backyard, and try the night scene shooting mode.  Due to the slow shutter speed I did have to set the camera on a stable surface (am planning to purchase a tripod for situations like these), but once I did this, the picture that resulted completely blew me away.  Not only was the picture filled with beautiful dim light, but I could actually make out the color of the leaves on the trees.  Amazing!I think that image stabilization would have been nice in this camera, but I am used to using non-digital cameras, and so was expecting blur to occur at high zoom rates and slow shutter speeds.  Overall, I feel that you get more than you pay for in this little gem, and I would recommend it to anyone!", "Date": "December 19, 2005"}, {"Title": "Long Term Review", "Author": "Globetrotting Cameraphile", "ReviewID": "R29GWGSDPU5PC6", "Overall": "4.0", "Content": "I got this camera for about twice the price 6 months ago. Now that it's about $150 it's definitely worth the price.I am an amateur photographer and I use this camera virtually every day, so I\"ve shot a couple thousand pictures with it. I always keep it in my backpack and I've taken it on trips. It has fallen many times and is still in complete working order! (the end of my last camera was my old roommate dropped it in the snow.)PROS:The optical zoom is AMAZING. Having that powerful of a zoom lets you capture so many things that otherwise would have been missed.The color reproduction is very, very good. And despite the fact that it sometimes has trouble focusing (discussed below), when it does focus properly (which is about 95% of the time) the images are very crisp and I have gotten very professional results.The flash is manual. You have to push a button and it pops up. So, it normally is non-flash mode, unlike most cameras. And this is amazing, because I hate flash. So you don't have that awkard situation when you take a picture in a musuem and ten guards jump on you because the flash accidentaly went off.The shoot options (print, portrait, landscape, indoor, MUSEUM (no flash and silent)) are amazing. I love having them.For what it can do it's pretty small. Because of the lens, it doesn't fit easily into my purse, but it's a good alternative to cameras with the equivalent optical zoom.It can shoot RAW!!!!!! RAW is a file that contains all of the picture information (rather than a JPEG which condenses the info, so you loose some of the data meaning that the color and such are harder to manipulate in programs like Adobe Photoshop). This is amazing for a point and shoot.CONS:The camera sometimes requires you to hold it very steady when taking pictures in low light. I never realized that it would be a problem until I was trying to get someone else to take a picture in a dim room. So, for me  I've never had any problems, but as someone mentioned in another review it is a consideration (but for the price, I really wouldn't worry about it).The camera does have trouble focusing sometimes. Okay, more often then sometimes. I have upped the amount of pictures I take, because often a picture will be out of focus. You just need to be patient with the camera.This camera also has shutter lag. All point and shoots at this price have shutter lag (you press the button and it takes a second or two to take the picture). This can be awkward at times when everyone's smiling and it hasn't taken the picture, but for this level of camera, not unexpected.The menu isn't particularly intiutive, but it's not a problem.Because it's an Olympus and they like to be special you are in trouble if you loose your cord. I went on an extended trip and left my cord at home and despite the fact that I was with people who had every kind of cord imaginable, the cord is not a regular connector. So make sure not to loose your cord!Comment on the previous reviewer on having to reformat his card:I have had a similar experience and I panicked, but for me it turned out that when I had dropped it, the card had slipped out of its slot and all I had to do was take the card out and put it back in. I haven't had any problems (I have a 1GB card).All in all, a great camera and I definitely recommend it. Even though it's not as slim by any means as most point and shoots, the zoom is indespensible. It's a great transition camera between point-and-shoot and a dSLR (which is the next camera I'm getting). It has definitely been through a lot and it has performed very well.", "Date": "January 24, 2007"}, {"Title": "Great camera, but lacks two important abilities", "Author": "David Lozinski \"FireMyst\"", "ReviewID": "RZS8QCU04XUZH", "Overall": "3.0", "Content": "This camera is just as awesome as the previous Olympus Ultra Zoom cameras (C-770, etc) except for the following two issues, which are highly important to me (hence the 3 star rating).1) there is absolutely no way to save the picture settings when in \"scene\" mode. I take photos, and have them printed. I want to have it set at SHQ 3:2 so I can generate 4\"x6\" prints. Unfortunately, the blasted camera resets to HQ non 3:2 mode every time it is powered off. That means every time you power the camera on and want to shoot a specific scene, you have to set the image quality settings, especially if you want SHQ or better.2) No 640x480 movie mode. Period. Best it does is 320x240 Quicktime motion jpeg. I like to take short video clips. 320x240 doesn't cut it when others (ie, Sony, Casio, Cannon) are beginning to offer cameras with the 1024x768 video mode.Everything else about the camera is great. Had I known the above two factors before purchasing the camera, I wouldn't have bought this one.", "Date": "July 24, 2006"}, {"Title": "I love this camera!", "Author": null, "ReviewID": "R28C21EYBDMUVH", "Overall": "5.0", "Content": "I originally purchased the Canon A620 after hearing all of the positive reviews.  I may have gotten a bad camera, but I was extremely disappointed with blurry photos (even in normal lighting conditions).  I exchanged the A620 for the SP 500 and I could not be happier.  The quality of the photos is stunning for a 6MP camera.  I could not be happier.", "Date": "February 20, 2006"}, {"Title": "Olympus does it again! Amazing camera!", "Author": "I. Becker", "ReviewID": "R2K67RX3FHECV8", "Overall": "5.0", "Content": "I love this camera. I love all the features on it and it really takes great pictures. Everything is great with this camera. I did alot of research and found that this had everything I wanted for a great price. I get wonderful pictures and there is a mode where I can take several pictures within a minute's time, which is great with a toddler that never stops! And also an auction mode which is also great for Ebay. Well I hope this helps out.{I had purchased a canon powershot s500 which was the worst camera I ever owned. Unfortunately I didn't return it within 30 days, so obviously I got stuck with it. And then I sent it back and it still didn't work. So don't waste your money on a Canon, trust me!}", "Date": "July 8, 2006"}, {"Title": "Great Camera", "Author": "Edward H. Seagraves \"PROFESSOR\"", "ReviewID": "R21SK0Y3VTDCTB", "Overall": "4.0", "Content": "The camera ( my second Olympus digital ) is a terrific camera that produces superb pictures.The Olympus software, however, is another matter.  They have greatly \"improved\" over the software of 3 or 4 years ago making it very much harder to use.Bottom line  -  great camera but terrible software.", "Date": "January 3, 2007"}, {"Title": "I love this camera.", "Author": "Jean M. Hockers", "ReviewID": "RGFUPPNCU4B0O", "Overall": "5.0", "Content": "I was reviewing many different types and kinds of digital camera.  After many days of research - I decided with the Olympus SP - 500 UZ.  I just love this camera.  It user friendly and takes great pictures.  I love all the extra features.  It's not too big and the price was good.  I wanted a digital camera with high MP and 10x optical zoom.  I love the digital screen size also.  I am a happy customer.", "Date": "November 3, 2006"}, {"Title": "new digital camera user", "Author": "E. Loth", "ReviewID": "R3GBDMTVLESG", "Overall": "3.0", "Content": "I have now used my camera for about 2 months and I am still trying to figure out the various settings. It is much more difficult than the other reviews eluded to. The big disappointment is that I did not receive an Operation manual. Only a basic one with 20 or so pages (english) that wasn't helpful for first time digital camera users.  My brother in the Netherlands who bought the same camera did receive the complete Operation manual.  I eventually had to download over 189 pages. So when I study the manual and can take better pictures I will be happier. At this time I am disappointed with the results.  Also Olympus customer service is not helpful. They just don't return your calls and ignore you. Not very good PR. New digital camera users should insist in a complete manual.", "Date": "February 1, 2007"}, {"Title": "Great clarity and fantastic zoom", "Author": "Rebecca L. Sullivan", "ReviewID": "R1WWHL0MAUMEX7", "Overall": "5.0", "Content": "Wow - what a great camera for a low price.  Not only does it has 10X optical zoom, but its additional on-camera editing is great - the red eye reduction on the camera is far superior to any software I have used on the computer!  Add in framing and split photos and other bonus tools and it is a real winner!!  This is one camera you can really use without a PC and print directly to printer (if you so choose)", "Date": "January 12, 2007"}, {"Title": "Great Camera!!!", "Author": "M.N. \"maddie\"", "ReviewID": "R12F8GPID1LUFF", "Overall": "5.0", "Content": "I have always been an Olympus Fan, my first Olympus camera was a stylus 35mm camera and loved it!! I purchased the SP 500 digital camera and as always have been impressed. It's worth every penny.", "Date": "January 12, 2007"}, {"Title": "Olympus SP-500 UZ", "Author": "Michael S. Kahler", "ReviewID": "RCLSXKT0TS28B", "Overall": "5.0", "Content": "Very pleased with the picture quality and ease of use.  Fits nicely in a jacket pocket.", "Date": "November 3, 2006"}, {"Title": "impulse buy", "Author": "J. Bailey", "ReviewID": "R38OKFTENS7R2C", "Overall": "4.0", "Content": "I bought this camera on impulse one day - it was a display model on sale for a great price.  I own a Nikon D50 with lots of accessories, but I wanted something easier to carry - to have in my truck at all times just in case..So far I really like it.  Feels great in the hand, very good battery life, and has excellent manual controls and adjustments.As with most cameras of this type that I've tried, startup and focusing is slow slow slow compared with my D50, but certainly better than my old Coolpix 5700 ever was.Only really ANNOYING thing I've found - when you shut the camera off, it retains all your settings except the autofocus mode.  I like to use spot autofocus rather than the 'intelligent focus' mode, but the camera defaults back to intelligent focus after every restart.  I have occasionally missed a shot because I forgot this, and the camera decided to focus somewhere else from where I intended....grrrrrrr.", "Date": "October 14, 2006"}, {"Title": "Couldn't get a clear picture in AUTO mode!", "Author": "Corinne Smith \"Mother of boys!\"", "ReviewID": "R1ZUB9JJY0YULE", "Overall": "2.0", "Content": "I purchased this camera after much researching but to my dismay, I couldn't seem to get a clear picture in Auto mode, let alone in Sports mode without blur!?My previous camera was a Sony 3.2 MP and I could take clear pics in auto mode and I could get non-blurry action shots of my kids.... this was very puzzling to me.....I returned the camera immediately and opted for the CANON SD600 which is ABSOLUTELY FANTASTIC! Clear pics and Clear action shots in AUTO mode!", "Date": "April 20, 2006"}, {"Title": "What a waste of money and memories.", "Author": "E. Woodruff \"mystikal bean\"", "ReviewID": "R3P879OAMPYKQ0", "Overall": "1.0", "Content": "My girlfriend (now wife) gave me this camera before I left on an 8 month trip to SE Asia. I was excited... until I started trying to record my memories with it.  The focus feature on this camera is so bad that almost every one of my pictures came out blurry or the focus took so long that the shot was missed.  I ended up having her bring my heavy old Canon S30 with her to Thailand so I could have some decent pics.  Spent a long time with Olympus who were absolutely no help to me.  I still try this camera out now and again and am still disappointed each time.  I absolutely hate this camera and am sorry that my wife wasted her money on it!", "Date": "January 31, 2009"}, {"Title": "Love this Camera", "Author": "Robin L. Hobbs", "ReviewID": "R1E5FSQUULXV63", "Overall": "5.0", "Content": "I bought this camera to shoot pictures and videos of my kid during swim meets.  I am an amateur.  It only took me 15 minutes to figure the camera out using sport mode to film fast pictures and the video mode.  Close-up pictures were stable, lighting great even thought the subjects were moving.  The zoom is fantastic and I could easy video swimming and zoom in at the same time for an amazing close-up.  It automatically adjusted to the various lighting levels of the different swim pools.  I could zoom in on the coach who was on the other side of the pool while I was in the bleachers for a candid close up.  I could even take close-up still photos of kids racing freestyle.", "Date": "October 2, 2007"}, {"Title": "I loved this Camera", "Author": "Landi \"Landi\"", "ReviewID": "R3FSBYV1SFZ3F6", "Overall": "5.0", "Content": "This was a very smart purchase for me.  I loved the camera from day one..until...my neice dropped it and it broke...It was very easy to use and very user-friendly..I did however, purchase another camera, but purchased a SLR this time...but nonetheless, for anyone who is not ready to take that leap to the SLR, i would definitely recommend the Olympus, by the way, that was my second Olympus...", "Date": "July 25, 2007"}, {"Title": "Rather good.  Not perfect.", "Author": "Jeremy D Vosburgh", "ReviewID": "R3TTFOKWQ5QBIG", "Overall": "4.0", "Content": "I had to get a digital camera for my wife (her first).  I thought a 6mp camera would be as good as she would ever need.  The thing that really sold me was the 10X zoom and the small size.First impressions when I got it:(1)  Looks sharp, except for the fact that it is three inches thick to accommodate the zoom and the four batteries.  Was happy that it wasn't too heavy though.(2)  How do I close the battery case without breaking it when I first put in the batteries?  Long story short, there was nothing wrong, but it was more trouble than I expected.(3)  Camera doesn't work!  Loud cracking sound when zoom initially moves around during startup.  What?  \"Zoom error\"  The camera turned off.  Turned on again.  Same drill.  The camera was the only present I got my wife that cost real money.  Of course, she was upset.  She upset:  me upset.  Because of Christmas rush I don't send it back immediately.(4)  2 months later, I send my camera with my amazon receipt, the warranty, and the Olympus service form (get it on the web or request it from their website) to the Olympus service center via UPS.(5)  Received camera back in ONLY 1 and a half weeks.  How did they do that?  Olympus stock rising...(6)  Turn camera back on after fumbling with batteries again.  Same annoyance.(7)  Camera works!  O happy day!(8)  Overall happiness with camera after using it for a couple days:  Very satisfied.  Not a point and click camera.  You must depress shutter halfway and wait for a green light to come on to communicate that focusing is ready.  Large LCD screen is awesome (2.5\").  Zoom awesome.  Picture quality is good.  Very satisfied.  Good for young adult looking to take pictures of \"stuff.\"  Probably not for aspiring professionals.Would I do it all over again?  I don't know.  But assuming you don't get a broken camera, I think its a good camera and does what it advertises.", "Date": "February 20, 2007"}, {"Title": "My first 10X optical zoom camera", "Author": "Peggy G", "ReviewID": "R1A9KYG8PO4HTQ", "Overall": "3.0", "Content": "This camera is the second digital camera I have purchased. My previous camera was a Canon Powershot 70 with 3Xoptical zoom. I purchased the Olympus because I wanted a higher megapixel and a higher optical zoom and a camera with a viewfinder. This camera met all qualifications even though it is considerably larger than the Canon. However, it is very difficult to hold the camera steady enough to get a clear picture at full zoom, so I find myself using it at about 3X or 4X. The biggest drawback of this camera compared to my Canon is the computer software. It is not nearly as user friendly or as flexible as the Canon software. I will continue to use this camera but plan to buy another Canon because of its convenience of size and software.", "Date": "November 10, 2006"}, {"Title": "awsome camera", "Author": "Amanda Buttars", "ReviewID": "R11RIMJLFKSKQJ", "Overall": "5.0", "Content": "When I went shopping for a camera I didn't know much about anything digatal.  I did my reserch and found this product.  I love the camera it is easy to use and has a clear picture.  lots of extras for the advanced as well as easy instructions for the bignner.", "Date": "January 29, 2006"}, {"Title": "Not a Point-and-Shoot Camera -- Ultimately Returned", "Author": "M. Bravard", "ReviewID": "R37CGD6JO6MOQ5", "Overall": "1.0", "Content": "The zoom, mega pixels, and brand attracted me to this camera. And at supposedly half-price, the value was also appealing.The camera and zoom looked impressive at first sight, but as soon as we started taking pictures, we were surprised to find that whenever we tried to capture a person or animal (or if our hand moved the slightest bit), the pictures would come out completely blurry.Even going through the trouble of finding the mode menu and selecting the sport option didn't fix the problem. But even if it had helped, what fun is it to go through all of that trouble every time you just want to take a simple picture?I'm not an expert with cameras, nor am I a novice, but this camera is either made for experts or else it is defective.Other Olympus models advertise \"image stabilization,\" which this model does not have.With 9 out of 10 pictures coming out blurry, we finally had to return it. I really wanted to like this camera, but it just isn't a point-and-shoot model, unfortunately.", "Date": "October 26, 2006"}, {"Title": "Not Impressed - except for zoom", "Author": "carrie", "ReviewID": "R5V51VTXNMFNQ", "Overall": "3.0", "Content": "Before this camera I had an Olympus C-3020, and i have to say that camera took sharper pics than this one does.  I send photos to a stock photography website and they have not accepted any pictures I have taken with this camera due to the sharpness just not being there.  The zoom is awesome though, so I am planning on keeping the camera for concert pics.", "Date": "September 4, 2006"}, {"Title": "Best Amature Camera", "Author": "James Olin \"Picky buyer.\"", "ReviewID": "R2O3GESB9AIJ5D", "Overall": "5.0", "Content": "I love this camera.  The quality of the pics are wonderful.  I've blown up photo's to 30x20 and they are perfect.  This may be the last camera I ever buy.", "Date": "October 26, 2006"}, {"Title": "Amazing little camera for the price!", "Author": "Theodore H Vollmer", "ReviewID": "R2FQHJCHHHRKPC", "Overall": "5.0", "Content": "I purchased this as a replacement for the same model that I accidently dropped onto concrete. (Use a strap every time!)Although it's sporting only 6MPs, the detail this camera captures is amazing. And the ability to go into full manual mode makes it more versatile than your standard point-and-shoot. Four AA batteries mean no special chargers or batteries to deal with, and the memory card access on the side means no fumbling batteries to swap the card out.", "Date": "October 2, 2013"}, {"Title": "Very nice and useful camera!", "Author": "R. Langston \"WebToad\"", "ReviewID": "R1BEQBQATKWBS0", "Overall": "5.0", "Content": "The SP-500UZ is a little dated by 2012 standards where consumers are led to believe that without 14-16 megapixels, image stabilization and 32x zoom lenses it is not possible to capture great images.  A friend once stated that it often isn't the bow that matters, but the skill of the archer.  To some extent I agree.I have used Olympus digitals for some time and still have an old C2040 that performs great.  I got this one to get a little more reach for nature photos.  The lens is pretty good, though it isn't the F1.8 that is found on the 2040.  The 10X zoom is very nice and does what I wanted.  It is nice to have a \"little\" more modern media card.  SmartMedia cards are expensive and have limited capacity.  The SP-500UZ uses xD cards, but skip the modern m+ cards with capacities greater than 1gb.  The current card is a 1Gb xD-H type card and it works fine with a reasonably fast write time.  I really like all of the added electronic features and controls, though it is a great idea to spend some quality time figuring out what everything does.  6MP is decent resolution for most web applications or for presentations.I was able to get this as a factory Refurbished unit for a very reasonable price.  After using it for a month, I would hunt another one down!", "Date": "February 4, 2012"}, {"Title": "A gem!", "Author": "melystu", "ReviewID": "R1VZ6C4U2ZCC1I", "Overall": "5.0", "Content": "This is the third of this model camera I've purchased. . . one for self initially, one for a gift to a friend, one to replace old camera which was misplaced (and later recovered).Although listed as a \"point and shoot\", ie, many automatic features, this camera is considered by many to be a HYBRID between P&S; and a DSLR. No lens replacements here, although a wide angle attachment is available. HOWEVER, it does shoot RAW, if one is so inclined, and has all the manual operation possibilities of a much more expensive camera, plus a number of pre-set shooting condition 'helps'. There are many internal processing features, too, if one wishes to use them. The original manual is still available online.Another key, and increasingly rare and valuable feature is the presence of a VIEWFINDER! Newer, less-expensive cameras seldom have these today, as they are expensive to include.I have used the camera exclusively for five years and have yet to be disappointed or felt the strong desire to \"upgrade\". I post my pictures to Flickr and get great responses; last month one of my photos was selected for publication in an art magazine in Asheville/NC, and my annual photo calendar sold well this past Christmas season (70 units sold locally). So, as this purchase proves, I'd \"buy it again\", and I have.", "Date": "February 2, 2011"}, {"Title": "Great camera", "Author": "K. Wood \"The Pagan Pastor\"", "ReviewID": "RJWUPMTYW0ODL", "Overall": "5.0", "Content": "It is a wonderful camera.It does what it says, it really is an ULTRA zoom, and anyone can take great pictures with it.I recommend it to anyone that wants a quick, easy to operate camera that takes great pictures.", "Date": "December 11, 2009"}, {"Title": "More Versatile than at First Glance", "Author": "Nathan", "ReviewID": "R2H632S3X1YSR4", "Overall": "5.0", "Content": "It has taken me most of a year to really delve into all of the settings and little tweaks at the SP-500UZ user's fingertips.  Most of the automatic settings are great in most situations, so long as you pay attention to what you are doing, but the avid photographer will be pleased with the depth and breadth of the manual settings and the brilliant photos it takes.  This camera is a real trooper that I have taken with me to the tops of mountains, and it has helped me get the best pictures I have ever taken.  My only real complaint is that it is difficult to use the manual focus accurately.", "Date": "May 2, 2007"}, {"Title": "Very good step up camera", "Author": "N. Bailey", "ReviewID": "RR2JJQJETYKX1", "Overall": "4.0", "Content": "This is my third Olympus Digital Camera.  I became a fan in 2000 when I bought my C-3000.  I still use that one quite a bit.  My second Olympus was the D-590 - I bought it because I wanted a compact camera to throw in my purse.  For the money the SP-500 can't be beat.  I got mine for $139.  I haven't had any problems with blurry images or indoor lighting.  My only issue is the battery compartment cover - it is hard to close and I'm concerned it may snap off.  The lack of image stabilization hasn't been an issue.  When you hold the shutter button half way down the camera locks the focus - I've never had an out of focus picture at any zoom level using this method.  I'm very pleased with this camera's performance.", "Date": "February 22, 2007"}, {"Title": "REALLY GOOD CAMERA!", "Author": "Mariela Barrios", "ReviewID": "R2TUR6EVCFECNL", "Overall": "5.0", "Content": "Hi, I am a diver and I can say that camera is wonderful under and over the water! I recomend it with my eyes closed.", "Date": "November 10, 2006"}, {"Title": "Disappointed", "Author": "Mazongem", "ReviewID": "RXAY8R31FQWM8", "Overall": "3.0", "Content": "Here's why I still gave it 3 stars.  The body is built well, comfortable to hold.  When I first received the camera, I right away started running into problems.  When I tried putting in the batteries and closing the compartment, it would not close.  I had to sit there and try to figure out how to close it without breaking it, so I can start taking pictures.  When eventually closed it and started taking pictures, they would all come out blurry and there was a loud sound coming from the lense and something would move inside it after pressing the shutter button.  I continued taking pictures with the zoom and without and they would constantly come out blurry.  The more I zoomed in, the more blurry they would come out.  I called Amazon, and had it exchanged.  When the second camera came, and again I had to sit there trying to close the compartment to be able to power the camera, some pictures were coming out a little clearer, but the blur was still there, especially when zooming in all the way.  Defeats the whole purpose of having the \"fantastic\" 10 time zoom.  The same problem of blurriness existed with this cam, but this time there was no strange sound coming from the lense.  Then, after a couple of hours of using it, the image display button that shows the pictures and allows you to take more of them froze.  It just broke.  I tried pressing it to continue taking pics, but it would not work.  I tried shutting the camera off, and turning it back on to see if the button would then work, and it still did not.  All I was able to do with it is view the pictures I had already taken, but could not take any new ones.  I ended up sending the second one back as well.THIS CAMERA CAN BE IMPROVED BY:Having an image stabilization option to be able to make use of it's high zoom and have clear picturesAn easy to close battery compartmentCould be built better Mechanically - image display button fragile", "Date": "May 7, 2006"}, {"Title": "Easy to Use Camera with Great Photos", "Author": "Love to Travel \"camera buff\"", "ReviewID": "R2FB6J47CEQCW4", "Overall": "5.0", "Content": "I had an Olympus 750 which I loved, but I broke it on a trip. This is a replacement camera for than one. I find the SP-500 UZ just as wonderful as the other, and easier to use in a variety of situations - inside activities, scenery, closeups, etc.", "Date": "February 26, 2006"}, {"Title": "Disappointing", "Author": "Joan M. Defilippo \"jmd\"", "ReviewID": "RAFXDOHQX1K7K", "Overall": "2.0", "Content": "This was my third Olympus digital camera.  I am not new to the digital world by any means.  We purchased this Olympus after reading many reviews.  Luckily, we purchased before the holidays and at a nearby retailer.  (usually we purchase on line).This is very lightweight, and the zoom is incredible.  However, the quality is very poor.  We used it in many situations and took the prints to be developed and were stunned at the poor quality.  The red eye feature did not properly erase red eye.  The prints turned out very blurry and you could see the pixels on the actual photos.  The resolution seemed to be off.  This was difficult to maneuver to the right setting in the sense that you could not always get a clear shot in auto mode.  The stabilizer is not good, if there is actually one at all.  Some of the photos were really clear, crisp, but most were not.  I am not giving up on Olympus, but just this one.  Maybe it was user error, or a defective camera?  we tried it for several days and as stated previously, luckily we tried it before the holidays.  My reliable Olympus c-4000 did the trick!", "Date": "December 26, 2005"}, {"Title": "AWESOME CAMERA", "Author": "Carmen Bonilla \"picture crazy\"", "ReviewID": "R2Q4PVP7WCVVTK", "Overall": "5.0", "Content": "I ORIGINALLY PURCHASED THIS CAMERA, THEN MY APARTMENT WAS BROKEN INTO AND STOLD IT, AND I LOVED IT SO MUCH, THAT MY SISTER BOUGHT ME THE SAME CAMERA FOR MY BIRTHDAY.", "Date": "April 6, 2008"}, {"Title": "Very disappointed", "Author": "JF \"Simcha13\"", "ReviewID": "R2R4I221ROEQ40", "Overall": "2.0", "Content": "I bought this camera based on reviews on this site.  I was buying it to replace a Cannon Powershot camera that my youngest daughter had dropped and broken.I have to say that I am extremely disappointed with this camera.  It is hard to get a clear picture without the flash on and who wants to use flash outside?  It is also slow, eats through batteries and is not user-friendly.I don't know what camera I'm getting next, but after owning this one for only 6 months I DO know that I'm going to put it on an auction site and use the money to put towards a new one!", "Date": "June 23, 2007"}, {"Title": "everything I wanted in a camera", "Author": "Anamaria Abdul Jabar \"AAJ\"", "ReviewID": "R1OJGP6FJS1T9", "Overall": "5.0", "Content": "The camera is everything I wanted, light,easy to carry, compact and easy to use with almost all the frills of a big camera.", "Date": "August 18, 2006"}, {"Title": "Good but seen better", "Author": "T. Heezen", "ReviewID": "R2R31DXTK6E3ZL", "Overall": "3.0", "Content": "I take alot of pic and I used a Cannon and it worked alot better than the one I bought... Better photos", "Date": "November 2, 2006"}, {"Title": "olympus sp-500uz", "Author": "jeffrey \"elcamino39\"", "ReviewID": "R37GFSJT68IP7Q", "Overall": "5.0", "Content": "great camera, this is my first digital camera and seems just fine for my uses. i've used a canon 35mm film camera for years and the convenience of digital is incredible. i've taken several portrait photos and some action shots of my dog. they have turned out fine. i would recomend this camera for any photographer.", "Date": "March 20, 2006"}, {"Title": "OLYMPUS FAN", "Author": "J. THOMAS", "ReviewID": "R1DTYNWEIW2561", "Overall": "5.0", "Content": "For the last 30 years I owned the Olympus OM1.  Now I have the next generation the Olympus SP-500.  Easy to use, light, and quick.  I will always be a dedicated Olympus fan", "Date": "February 24, 2006"}, {"Title": "It sucks -- pics taken were lost for no reason", "Author": "Clifford Cheney", "ReviewID": "R8HSGGXGRDLBY", "Overall": "1.0", "Content": "I had this camera for about 8 months, bought it with an Olympus 512M xD memory card. It worked fine except for (1) poor pic quality in low light environment, even with scene mode justifications (a lot of dark dots); (2) images easily get blurred if you do not have super steady holding hands.The most annoying thing happened today: we lost all the pics taken recently in my wife's graduation celebrations. All the pic-review was fine when the pics were taken, but today when I powered it on again trying to copy the pics to my computer, it stupidly displayed \"power off\" or \"format the card\" message for no reason. I also tried to insert the xD card in my laptop card reader to copy the pics out, but the computer prompted the card needs to be formatted and not readable. In the end, I have to format the card and lost all the pics taken in my wife's graduation celebrations.I have been using digital cameras for 5 years and owned 3 digital cameras before. Nothing like this has ever happened on other cameras. I am pretty sure everything was operated properly. It just sucks, no matter it is the camera problem or the card problem since they are all branded olympus.I do not want this camera anymore. It is just not a reliable one. Since the product return deadline is already over, I might just trash it. It is completely annoying.", "Date": "December 27, 2006"}, {"Title": "too many blurry pictures", "Author": "John S. Sozek \"the soz\"", "ReviewID": "R18JXGAG0C7SEI", "Overall": "3.0", "Content": "i owned this camera for 2 weeks.  i took about 200 pics with it.  while many of them came out fine-great color and sharpness, too many were blurry, especially some i really wanted to keep.  the moment was lost.  whether it was hand-shaking or the lack of IS, i don't know.  i expected more clarity.", "Date": "October 25, 2005"}, {"Title": "Picture quality poor", "Author": "M. Capestro \"mc\"", "ReviewID": "R25U5GU3EV19WB", "Overall": "3.0", "Content": "I bought this camera a week ago and about 80% of the pictures that I've taken have been deleted right away -- blurry or orange. I wanted a picture of my costume and handed the camera to my boyfriend and he was unable to take a clear picture. So if you are like me and occasionally hand your camera to \"the waitress are park employee\" to take a picture of you and your friends this may not be the camera for you. If you adjust all the settings, use SHQ and put your camera on something that doesn't move, this camera takes great pictures, but still not even perfect. I would return this camera if it were not for the 15% restocking, plus shipping fees that Best Buy charges. I've had 2 Olympus cameras before this one and have loved both (ESPECIALLY my C-750 that was stolen and no longer is available except on EBAY, I could go on about that camera), but this camera is a disappointment. Also, one thing to note is that many of my pictures have been taken inside. That could be part of the problem. But, I want a camera that takes pictures anywhere. Also, when you download your picture and look at it at 100% the picture looks bad. If you look at it at about 75% it looks nice. When I printed out 4X6 pictures on my hp photosmart 145(I love this little thing) straight from the memory card the pictures tuned out alright. I would give the pictures a 3 1/2 out of 5. Of course these were pictures that were not deleted for being too blurry or orange. The pictures have a bit of noise.", "Date": "November 4, 2005"}, {"Title": "Camera", "Author": "Charles M. Stewart \"Retiree\"", "ReviewID": "R1QJR4IMRWQTN2", "Overall": "5.0", "Content": "Great buy and I am learning to take some great pictures with it.", "Date": "July 7, 2006"}], "ProductInfo": {"Price": "Unavailable", "Features": "6.0-megapixel CCD captures enough detail for photo-quality 14 x 19-inch prints\n10x optical zoom; 2.5-inch LCD display\n27 selectable shooting modes, plus full manual and automatic control\nThreaded lens barrel allows the addition of Olympus conversion lenses (not included; must be purchased separately)\nPowered by four AA-size batteries (included); stores images on xD-Picture Cards", "Name": "Olympus SP-500 UZ Ultra Zoom 6MP Digital Camera with 10x Optical Zoom", "ImgURL": "http://ecx.images-amazon.com/images/I/51ATMNVF0NL._SY300_.jpg", "ProductID": "B000A7B9Z8"}}