{"Reviews": [{"Title": "Great Camera", "Author": "G. Robb \"gc_robb\"", "ReviewID": "R28URF88SWDVJ8", "Overall": "5.0", "Content": "Let's start with I am NOT in any way a pro with a camera... but that doesn't matter with this one!  Every picture has been crisp and clear with amazing detail. Colors are spot on as well.I replaced an Olympus Stylus 400 with this one and am QUITE impressed with the range of features (I will probably never use half of them, but they are there, hehe)- especially being able to print without attaching to a \"dock\" or computer.  I can hook directly to my printer and print without anything extra!Probably the only drawback (if you call it a drawback) is the size of the pictures.  Since this is a 7.1 megapixel camera if you take pictures at the maximum setting you can quickly fill the memory cards!!  I would recommend at least a 512Mb card if not the 1Gb.", "Date": "December 7, 2005"}, {"Title": "Wonderful", "Author": "Maddy", "ReviewID": "R2ZYXJJCVRFF7", "Overall": "5.0", "Content": "Strengths: Tons of scene modes, Extremely light, Powerful flash, excellent image quality, nice ergonomics, uses standard AA batteries, decent price tagWeaknesses: No antishake, xD picture card!I took a risk by getting this camera given the utter lack of user reviews on the internet (which I heavily rely upon before making such a purchase). But, I couldn't be happier with this purchase.It is extremely light and compact. Wonderful to carry around. A very good feature is that it has a HUGE 2.5\" LCD AND a nice big optical viewfinder, BOTH, which is rare in such compact cameras. Running on standard AA batteries is very nice since this was one of the main concern with the SD300 I got for my mom.It is so light that a shaking hand could have detrimental effect on the captured image. My first use of this camera was in temperature of -10c, which had my hand shaking a lot! But, I am very pleased with the overall picture quality. So many scene modes are great for a person like me who does not want to mess with advanced settings ;).The pictures make it look bulky like the Powershot S2, but believe me, it's extremely compact and is comparable to Canon SD series camera, apart from the bulging right side. But, that bulge gives it a very good grip for one hand operation. And it is difficult to believe, but with battery and memory installed, it is LIGHTER than even the powershot SD cameras. I love it.", "Date": "December 24, 2005"}, {"Title": "Excellent Camera", "Author": "smart shopper \"smart shopper\"", "ReviewID": "RG75SGIQCJ6SV", "Overall": "5.0", "Content": "I have had numerous digital cameras the past several years including some high end models. This camera really impressed me:1. Full manual controls2. Numerous scene select auto modes3. Excellent video4. Long battery life (some review websites state they have short battery life but I was able to obtain over 220 pics with flash on all shots using one set of 2300 NIMH batteries??)5. 2.5\" screen6. AF illuminator light7. 7.1 MPThe only complaints that I have about the camera is that I wish it came with a higher optical zoom. It only has 3x. Another thing I do not like is that it uses XD cards which makes it slow at times when writing to the card if using the higher MP option.Other than my two complaints, I think this is a very good camera that offers a lot of features for the price. I got mine below $250 at Dell which is a great deal for a camera with these features at this price range.", "Date": "January 8, 2006"}, {"Title": "Wow!!  Great Camera!", "Author": "Kim \"Kim\"", "ReviewID": "R2QWHPEH2VB3DX", "Overall": "5.0", "Content": "This is my first digital camera and I did a lot of research before selecting this one.  I LOVE IT!!  The internal memory is great and I have been able to take a lot of pictures on a smaller setting without purchasing a memory card.  The CRV3 battery that came with the camera didn't drain until after 150+ photos, but AA batteries (Duracel Ultra Digital) do not last long at all.  The 2.5\" LCD screen & picture quality are fabulous.  I HIGHLY recommend this camera!  Two thumbs up!", "Date": "March 16, 2006"}, {"Title": "Great Camera @ Great Price", "Author": "S. C. Luke \"scase75 on ebay\"", "ReviewID": "RFZVT9278HXIN", "Overall": "5.0", "Content": "I do a lot of closeup shots selling items on ebay. My old HP was a 3.2mp and moving up to the Olympus SP-310 7.1mp was the best decison I have ever made. I've listed twice the number of items I normally list and my sales have already increased.  Most buyers want closeup shots of any writing on the products you sell. They also expect to recieve the same color item as they bid on and ordered. I found using the SP-310 my pictures are more true to color than ever before. The time spent listing them on ebay has been cut by more than half.  I only need to take one shot and I have it.The software is so easy too use. I'm no expert on the computer, but the easy to follow instructions let you manually adjust your picture or one button auto does all adjustments except cropping. That is the only thing I need to do in the manual adjustment mode. The manual is clear and I have found lots of accessories on-line that are going to enhance my digital camera. I have my camera mounted on a cheap tripod & I'm getting ready to up-grade there also. I have ordered the extra lens available for this model. I also purchased a camera studio with lights (table model) to set my products in to take their pictures. I got this tip from another ebay member who asked if that is the method I used to get the pictures of the books I had listed.  I checked out his site, my pictures look just as good, so I figure using the lights & back drops will even produce better pictures.  Pass this up only if you're buying the SP-350 or upgrading to another Olympus.", "Date": "March 26, 2006"}, {"Title": "Great camera by Olympus", "Author": "Lish", "ReviewID": "R22CGKGG2VU3EK", "Overall": "5.0", "Content": "The pictures are clear and crisp with colors that explode on the LCD monitor and on the printed paper. This is my second Olympus and I don't think I would buy any other brand, it is superb quality. The camera weighs almost nothing and operates with ease, anyone can use this camera and you do not have to have a degree in photography to get it right. It is perfect for anyone to use. Highly recommended and the price was the best out of every store that I researched. Great little powerful camera. It gets a thumbs up!", "Date": "February 17, 2006"}, {"Title": "Great Camera, Lousy Mnemonics, Software", "Author": "Bennett P. Brocka \"Prof Wombat\"", "ReviewID": "R3TXJ8VYTAV0ZW", "Overall": "4.0", "Content": "Takes great pictures of still situations. Has various modes (landscape, sport, portrait), or an auto mode that will figure things out if you're a novice (like me). It even has a cool sepia mode for taking an old-fashioned sort of picture. The extra large view finder is great for this far sighted old guy.A really nice camera, perfect for my use - taking photos to put on websites.The only problem is the really confusing on-camera interface. My other cameras have a much easier to understand interface. The accompanying software is also short in the ability department ( you can't delete pictures from the software, making picture management a hassle). But, it does transfer pictures fine.If you're looking strictly for picture quality, and general usage, I'd give this 5 stars. But for the whole package, four stars.", "Date": "May 5, 2006"}, {"Title": "So far not happy...", "Author": "Al", "ReviewID": "R3YAW7RMM8W26", "Overall": "3.0", "Content": "I bought this Olympus camera to update my older Olympus camera.  I stayed with Olympus becasue my former camera was such a workhorse.  I took tons of picture with it and it took a beating here or there and was dropped a few times.  After much research, I went with the SP-310.  I was happy with all the features and like that fact that you could do some limited manual settings, such as sperture and flash speed...although I am an amateur so I don't know much about these things.  However, one thing I don't like is that in fully automatic mode the camera resets the resolution each time you turn it off and on, which is soemthing the old camera wouldn't do if you turned off the \"All Reset\" feature.  This camera has the same feature, but it doesn't seem like the resolution is part of what is NOT reset???  Maybe I am doing something wrong???But, my real problem with this camera is the short battery life.  No joke, I can take from 10-25 pictures only with new rechargeable NiMH batteries.  I know there is a firmware update for this, which I tried but didn't resolve the issue.  I just received my camera back from Olympus after the second time of sending it to them, so I will see if anyting has been fixed.Perhaps, I have a lemon, but the fact that a firmware exists leads me to believe that there is some type of issue with this camera or perhaps a certain amount they have built.  Olympus customer service has been so-so, although the last person I talked to from corporate \"took care of business.\"", "Date": "October 21, 2006"}, {"Title": "Gorgeous Photos!", "Author": "koloman moser", "ReviewID": "R3EZUETFP1XKP", "Overall": "5.0", "Content": "I recently bought this point & shoot camera as a backup to our larger more complicated digital SLR.  It ended up becoming our main camera while we were on vacation--not only is it light & easy to use but the images it creates are absolutely stunning.  Very light but with a nice firm feel & a joy to use.  Works great with my G4 laptop & iphoto.  It's only the beginning of summer & I've taken over 500 photos.  A great camera for a great price!  Highly recommended!", "Date": "July 7, 2006"}, {"Title": "Spectacular shots!", "Author": "melanie_mac", "ReviewID": "RV489MSAKLIP6", "Overall": "5.0", "Content": "I did a lot of research before I decided to purchase the SP-310. I'm so happy with my choice. I still have a long way to go before I figure out all the menus and options, but trust me, you can get some really fantastic photos when just using the automatic functions. The best feature on this camera is the super macro mode. I spent a few hours at our local public gardens and ended up taking well over 150 photos - most of which were closeups of the inside of blossoms. Even the pollen was clear and in focus. The detail was incredible. Plus, the lithium batteries that came with the camera are still kicking.I took a very basic photography course a few years ago and have dreamt of owning an SLR camera ever since. With the option of automatic or full manual control, plus the amazing super macro feature, who needs SLR? I recommend this camera to any amateur photographer.", "Date": "August 16, 2006"}, {"Title": "Don't buy any other camera!", "Author": "E. Luke", "ReviewID": "R2KBIIIHKQY7S6", "Overall": "5.0", "Content": "I bought this camera while still on a college budget and coudn't have gotten more out of a $500 camera. The functions are easy to use and, you can set the shutter speed yourself, or just use the preset functions that are already set on the camera. I tinker with photography and always end up with clear and beautiful pictures. The 7.1 megapixels allow pictures taken at the highest resolution to be blown up to huge posters. The batteries required for the camera are somewhat expensive, but can last for months. I am a very happy customer!", "Date": "September 27, 2006"}, {"Title": "Poor battery life", "Author": "J. F. Lee III", "ReviewID": "R2GCOGDCA5RZ40", "Overall": "2.0", "Content": "The camera has a complete feature list and good image quality.  Unfortunately, battery life is so bad it's almost useless.  I rarely get more than 25 shots from a set of freshly charged AA rechargables.I sent the camera to Olympus to have the firmware updated, but it didn't make any discernible difference.", "Date": "December 6, 2006"}, {"Title": "Great little camera.", "Author": "Gabrielle J. Rigaud", "ReviewID": "R29FTM9CTKWZZ0", "Overall": "4.0", "Content": "My first digital camera. It was great and too many fantastic pictures on my travels.The one annoying thing though was the AA batteries it too. That's great because you can buy AA anywhere you travel. However, the made the camera heavy and over time the battery door wore out so the battery weight made it hard to remain closed.It lasted me a good 4 years or so. I broke it one day because I was too lazy to haul my luggage downstairs so I tossed my travel pack from the 3rd floor balcony forgetting that the camera was in there. Yeah... the battery door broke completely at that point and I couldn't use it anymore.", "Date": "January 23, 2014"}, {"Title": "Replacement", "Author": "Elaine M. Ackerman \"avid reader\"", "ReviewID": "R3774T2NKNJNB8", "Overall": "4.0", "Content": "This was a replacement for the same model camera that got wet (waterproof case leaked.)  I have used this underwater for a year and have been happy with the results.", "Date": "July 21, 2009"}, {"Title": "What Battery Problem?", "Author": "W. Curtis", "ReviewID": "R1YCIJFA0TX2VQ", "Overall": "3.0", "Content": "I keep seeing reviews complaining about the battery life with this camera.  I always used the lithium AA batteries by Ever Ready.  I get 150+ shots with them.  Otherwise, being 2009, I'd look elswhere at this point.  A nice camera but you can find so much more at this price now.  This is why I only gave 3 stars.", "Date": "February 14, 2009"}, {"Title": "Good camera", "Author": "Jack", "ReviewID": "R1C7170U3XGAD8", "Overall": "4.0", "Content": "The only flaw in this camera is the hook for the battery compartment. It is fairly small and plastic, and it takes very little to make it useless.However, with that said.. the sliding action of the battery compartment cover still keeps the battery in and functioning.I was very pleased with the quality & relative simplicity of this camera, excepting the flaw noted above.", "Date": "June 16, 2007"}, {"Title": "Great Camera", "Author": "Diolallevi", "ReviewID": "R3UGN0K1RYVWZI", "Overall": "5.0", "Content": "Just takes a little getting use to it.I like all the features of my old 35mmSLR which used real film.", "Date": "March 27, 2007"}, {"Title": "Not quite sure", "Author": "Angel", "ReviewID": "R14OP0Q5N240EY", "Overall": "3.0", "Content": "Just got this camera a week ago, so I need more time to fully check it out, and I'll write a later review then.  So far I have been disappointed with the macro ability, seems not as good as my older Olympus.  The main problem I have is trying to use the LCD screen outdoors...it is impossible to see, the glare is awful. The camera is very small, but that is not an important feature for me, I would rather have a larger camera that works better. I have had great success with Olympus cameras, and hope I can write a more positive review later. Well, this is much later and sorry to say this Olympus is nothing to crow about....I have another Olympus coming soon and hope it will be as good as my other prized Olympus cameras. Still think they are great cameras, but I can not recommend this one.", "Date": "February 10, 2006"}, {"Title": "GREAT EXPERIENCE", "Author": "Willie Satterfield", "ReviewID": "R3UG9FHJV0DMO0", "Overall": "4.0", "Content": "THIS SELLER WAS ONE OF THE BEST I HAVE DEALT WITH. I WAITED TILL THE LAST MINUTE TO ORDER A CAMERA FOR CHRISTMAS PICTURES. WHEN THE ORDER WAS COMPLETED I CHECKED DAILY TO SEE IF MY ORDER HAD SHIPPED. THE ESTIMATED ARRIVAL TIME WAS AFTER CHRISTMAS SO I WAS A LITTLE UPSET. 2 DAYS AFTER THE ORDER WAS PLACED THE CAMERA ARRIVED. WAY AHEAD OF SCHEDULE. I GOT GREAT VALUE, GREAT SERVICE, AND GREAT CHRISTMAS PICTURES. THANKS", "Date": "January 12, 2009"}, {"Title": "This camera is junk", "Author": "New Mommy \"S.b\"", "ReviewID": "R3ACC87Z3Y8JDW", "Overall": "2.0", "Content": "Barely after 1 year of ligt use, the lens got stuck (closed) one fine morning after replacing batteries. The lens won't come out. Kept displaying \"Zoom Error\" and auto-shutting-off. I gave it a real good whack and voila.Stick with other brand names... I heard good comments about Olympus. Personally I will never go for anything other than Canon or Nikon in future.", "Date": "April 27, 2007"}], "ProductInfo": {"Price": "Unavailable", "Features": "7.1-megapixel CCD captures enough detail for photo-quality 15 x 20-inch prints\n3x optical zoom; 2.5-inch LCD display\nAdd optional conversion lenses to the camera's threaded barrels (not included)\n30 selectable shooting modes, including 27 creative scene options\nPowered by CRV3 battery (included) or two AA-size batteries; stores images on xD-Picture Cards", "Name": "Olympus SP-310 7.1MP Digital Camera with 3x Optical Zoom (Silver)", "ImgURL": "http://ecx.images-amazon.com/images/I/51A7ZP1B3NL._SY300_.jpg", "ProductID": "B000A7B9YO"}}