{"Reviews": [{"Title": "Top Notch Camera - More features but low light issues!", "Author": "Scott Anderson \"Sharpsburg\"", "ReviewID": "R3AFCM6XI271JK", "Overall": "5.0", "Content": "This camera is loaded with many special features such as an easy to use dial that allows specific selections to a much larger screen that allows you clear viewing of all your pictures even in bright light.It fits nicely in your hand and the toggle switch for telephoto/zoom makes getting that close up shot a breeze!  The camera dock is easy to use and charges the battery as stated within three hours.  I've also purchased a 512 mg card and at the 5 mega pixels setting the DX7590 can store 315 pictures.When you turn on the camera it helps you with each setting, allowing you to pick the right one for the job and even going as far as telling you to turn on the flash or hold the camera steady.The pictures from the camera are bright, colorful and crisp and ready to be printed out.  The camera allows you easy transfer of the pcitures between camera and printer or computer and the colors come alive with the right color printer.  Even on draft mode the pics are decent quality.  The internal settings allow for easy saving and documentation of special events in folders as well as individual pictures.The only minor issue with the camera is that a proper hand hold on the left side might give the users better stability.  The right side offers an easy hand hold with flip up access to the memory card.Over all this camera is one excellent camera and one excellent buy for under $500.00.  The entire package, including zoom, 32 mg internal memory, charging dock and 5mg pixel capabilities make this a great buy!Highly recommended!Additional info 5-31-05  Rated only 3 stars now!Found Some Flaws and Kodak will not help, May 31, 2005After using this camera for more than several months, it's been to the shop to replace a bad zoom lens. Kodak sent out a new camera and the new camera had updated software for the low light situation but it did not fix the problem. The camera takes awesome bright and average light pictures but the low light pictures come out blurry. Here is some of the email sent to me from Kodak.RE: Case# 7405518I'm sorry to hear of your low light focus problem. If you're sure you have upgraded your firmware to 1.01 there is little more we can offer as a solution at this time. However, one \"trick\" that may work is to artificially introduce more white content into the photo environment and then crop it out of the final image as required.I appreciate your patience and ask that you keep an eye on our support web page where we will announce any new updates that may help resolve the situation.Thank you,Tom SullivanConsumer Advocates OfficeEastman Kodak CompanyIn the last email after the one listed above, Kodak told me to sell the camera, \"as is\" to someone else and then use the proceeds to purchase the z7590 with two low light sensors, thus passing on the problem to someone else.Not very customer friendly from a company that really needs the support of every loyal customer.I'd wait to buy until they fix the camera.Scott C. Anderson", "Date": "September 16, 2004"}, {"Title": "Many pluses. Few minuses.", "Author": "Casual Reviewer", "ReviewID": "RWZFCLWLCZSAB", "Overall": "4.0", "Content": "I've taken a lot of pictures with this camera as well as with many other digital cameras. I rank this camera near the top for cameras in this price range.Rather than going through all of the features, I'm going to comment on what I think makes this camera stand out and what I think this camera lacks.Two of the things that make this camera really stand out are:1. It has a huge lens, and2. The lens is made out of glass, not plastic.I believe that these two factors make more of a difference in photo quality than other things, such as a high mega pixel count. You can really see the quality in the photos that this camera takes. The colors are accurate. The images are sharp. And there is no noise when you take a low light, flash photo.Other nice things about this camera:The flash is more than adequate. The 2.2\" LCD is really nice. The movies it takes are decent and you have unlimited movie time. It has a ton of user options and features. And of course, the zoom on this camera is incredible for the size and price. This camera has many, many nice things about it, too numerous to go into here.The down sides are few. One of them is that the camera is big. I really can't consider it a \"pocket\" camera because it simply won't fit in your pocket. But that's the trade off for the big lens and the huge zoom.This camera also has some difficulty focusing in low light. This is the reason I didn't give it 5 stars. Kodak did improve on this from the previous version of this camera (the DX6490) but every camera manufacturer should add that little red light that shines on the subject so that the camera can achieve a proper focus in low light. This is the one feature that I think this, and all cameras that don't have a manual focus, should absolutely have.If you're looking for a pocket camera, this probably won't suit your needs. Just remember that most, if not all pocket cameras in this price range have really small, plastic lenses. Usually this means a very noticeable sacrifice in image quality (the Sony-T1 is an example of this).Before you buy this camera, I would recommend you look into the Fugifilm Finepix S5000 and S5100. These are also excellent cameras, but I prefer the Kodak.", "Date": "November 17, 2004"}, {"Title": "Wonderful camera with some drawbacks", "Author": "Anime Ted \"One\"", "ReviewID": "R2VE3O0EAZ7ZHN", "Overall": "4.0", "Content": "The Kodak DX 7590 at $499.99 is a damn good deal!  Kodak states that you can print 20\"x30\" poster shots, but if you want photo quality you're better off sticking with 16\"x20\" at most.Pros:1. 10x Zoom - Fabulous! Quick responsive zoom, Schneider  Kreuznach lens.2. 5 MP resolution - Can still maintain high quality prints  with some cropping of the photo.3. 2.2 Inch LCD - Easy to view from most angles, sunlight OK,  In Low light it adjusts itself for easier viewing.4. Dock Included - No worries about buying new batteries or  connecting cords from the camera to the computer.Cons -1. Though they added a new jpg compression setting, the images  still seem a bit too compressed...however, for  everyday purposes and prints, the quality is fine.  But for any major editing and/or cropping...2. No manual focus - This would have been really nice for $5003. Slightly small frame for those of us with medium to large  hands.  My wife can use it fine...but she won't.4. Digital Zoom - Just remove this \"feature\" altogether Kodak.Overall - the camera is a good buy. From the pews, I was able to get some amazing shots at a recent wedding.  The potential for this camera to rival the quality of film is there...it's in your hands.", "Date": "September 16, 2004"}, {"Title": "The DX6490 Upgrade. Is it worth it?", "Author": "S. Reddick \"sredd68\"", "ReviewID": "R2OEO1401S7R9T", "Overall": "5.0", "Content": "To me, yes it is. The DX7590 is all the DX6490 should've been in the first place. This camera is packed with features. There are 14 scene modes. Scene modes are pre-programmed settings by Kodak for different situations like \"party\" (for indoor photos of people), \"backlight\" (use when the light is behind the subject of the photo instead of behind the photographer), \"children\" (for photos of kids in bright light),\"self-portrait\", \"manner /museum\", \"flower\", \"fireworks\", \"text, \"beach\", \"snow\", \"night landscape\", \"night portrait\", \"close up\", and \"landscape\". On these modes the camera does all the work, sets aperature, shutter speed, exposure compensation, flash compensation and film speed. If the camera shows that you need the flash, use it with these scene modes. I really don't use those for I am trying to become a better photographer and I have been using the \"PASMC\" modes (more on those later). There are also five more modes to choose from and they are auto, sport, portrait, video and the aforementioned PASMC (manual) modes. For auto you control whether or not to use the flash and the exposure compenstion. For portrait and sport, you control just the flash. The \"PASMC\" modes you control just about every thing. the \"P\" mode you control the flash and exposure compensation and the camera adjust the aperature (how wide the lens opens to let light in the camera) and the shutter speed (how long the shutter stays open to let the light in), the \"A\" mode you control flash and exposure along with the aperature the camera control the shutter speed. The \"S\" mode you control the shutter speed, exposure amd flash, the camera control the aperature. The \"M\" mode is where it gets interesting. You control everything. The aperature, shutter, flash, film speed(iso) and the exposure meter acts as a light meter to tell you if the shot will be underexposed or overexposed but does not prevent you from taking the picture. Finally the \"C\" mode is where you can saved your favorite camera settings and they will remain even after you shut the camera down or switch modes.  The Dx7590 is faster at start-up and resetting between shots. There is what Kodak calls \"Exposure Bracketing\". That is when you take a series of shots (3) at different exp levels when you're not sure if the lighting is right. You have 2 different burst modes, a macro and a landscape mode (to use outside of the scene modes), 10X optical zoom and 3X digital zoom for a total of 30X zoom, a choice between fine and standard file compression, 5 megapixels instead of 4, and so much more.  I'm so getting tired of typing so I'm going to wind this review up. To me the DX7590 is a wonderful upgrade from the DX6490. Well worth the purchase in my opinion. Or, if you're in the market and wondering which one to buy...I'd recommend the DX7590. I have both and I'm gonna keep them.", "Date": "October 28, 2004"}, {"Title": "New Kodak DX7590", "Author": "Michael A. Abbatiello \"Michael A.\"", "ReviewID": "R1Y3IH4BCYAD3U", "Overall": "5.0", "Content": "I purchased this camera about a month ago and I am very pleased with it.  It is very simple to use and takes great pictures.  The picture quality of this camera is on par with a Nikon 5.0 megapixel camera.  I compared photos taken on both and although the Nikon quality was slightly better, this Kodak cost $1,000 less.  If you are in the market for a digital camera and want the capabilty to expand, then this is a good choice.  I especially liked the 10x optical zoom and the fact that the lens will accept filters and wide-angle adapters.  Although the camera has 32 megabytes of internal memory, you will want to buy a memory card, they are very inexpensive and can provide the capability of up to 150 pictures.  Hope this review helps.", "Date": "October 7, 2004"}, {"Title": "Try Kodak...You Probably Won't be Sorry", "Author": "Sn2000py \"Sn2000py\"", "ReviewID": "R2DL4UX4WOSKWE", "Overall": "5.0", "Content": "I'm having to edit this review, since the \"Spotlight Review\" that led me to orignally post it, seems to have disappeared, and Amazon edited my original review. My concern about the reviews of digital cameras is that some reviewers are so obviously trying to scare consumers away from a specific brand, I guess, in hopes they will then go buy another brand. I think this is unfair, and it's particularly bad when such a review ends up a \"Spotlight\" one, even though most of the readers found it to be unhelpful.Here's a few facts about Kodak digital cameras, like this fabulous DX7590: 1) According to J.D. Powers and Associates, Kodak rates highest in customer satisfaction in the $200-$399 & $400-$599 price ranges. 2) Kodak is now just a little behind Sony in digital camera sales. No other digital camera company has gotten so close to Sony! Canon--a favorite of Amazon--is third. 3) Years ago, before Kodak turned all its attention to digital cameras, it's cameras were not the best.  Those days are long gone, but some choose to ignore this.The DX7590 is a combination of two other fabulous Kodak cameras--the DX7630 and the wildly popular DX6490. All three of these cameras are very \"complex\" cameras, as \"point and shoot\" ones go, but yet they are so simple to use. In my opinion, it takes high intelligence to make a complex thing, that is totally foreign to many people, easy to understand and easy to use.  Kodak has done this with its digital cameras. And these cameras make beautiful prints!  The EasyShare software, too, is very simple, and allows you to easily put photos in albums, print at home, or burn your pictures to CDs.  You can even download your album names and e-mail addresses into the camera, and then they will automatically go into albums or be set up for e-mailing, as soon as you put the camera back on the dock.Everyone I know with a Kodak digital camera loves it. But some people will not,of course. No one camera, or one brand of camera, will appeal to everyone. I strongly suspect, however, Kodak cameras have become so popular due to word of mouth. Just don't allow any reviews at Amazon, or any other place, scare you away from getting a Kodak camera, or any other brand of camera, as it's obvious some really want to do. While some reviewers sincerely and seriously don't like the Kodak camera they bought, other reviewers have other agendas. Talk to people you know who have a camera, or brand of camera, that you're thinking of buying, and see how they like it.  Try out the cameras you're thinking of buying, and see how easy or hard they are for you to use.I personally find the Kodak cameras, particularly the more complex ones, to be terrific.", "Date": "December 2, 2004"}, {"Title": "Great Zoom makes this one a winner", "Author": "T. Ziolkowski", "ReviewID": "R3O9S67Z18ERXO", "Overall": "5.0", "Content": "I have long resisted buying a digital camera because all the ones that compared to my trusty film SLR camera were far too expensive. I chose this one because I was impressed with the amount of lens for the price. The 10x optical zoom on this camera has allowed me to take some wonderful pictures. I didn't realize how much I enjoyed using this camera until I got ready to develop some film photos and realized that I only had 5 rolls. (I usually had 15-20 in the same amount of time.) The digital photos I have been printing look every bit as good as the ones taken with my film camera. Most of the people I have shared them with don't believe that they are digital. The video feature also does a surprisingly good job. It won't replace a regular video camera for important events, but it has allowed me to catch some fun times that I would have missed because I don't drag a video camera everywhere I go. The features on the camera are easy to figure out without studying the manual. Transferring the photos to my computer is simple and quick. The photo software isn't the best, but its managable. I love this camera and would recommend it very highly.", "Date": "March 21, 2005"}, {"Title": "Really a great camera, even for beginners", "Author": "U. of O. Alum \"Go Ducks!\"", "ReviewID": "R1T4F59YUZEPO", "Overall": "5.0", "Content": "This is my first modern digital camera.  Years ago, I had one of the early Apple-branded digital cameras that was more of a novelty than a true camera.  I was waiting for both some specific features, a good price for those features, and quality printing at a good price.  I feel like with that camera and with digital printing services at places like Costco and Walgreen's, this was the time.The camera functions great.  I'm a basic user, so I'm still exploring some of the awesome features.  A biggie for me is the optical zoom.  A 10X optical zoom is not very common but really important to get quality prints when you zoom.  This camera won't let you down there.Of course, you'll want to get a memory card for your camera.  The camera has 32MB built-in (great for spill-over), but I bought a 512MB card that lets me store over 150 high-quality pictures.  Well worth the investment, trust me.The battery life so far has been really great.  Kodak says I can leave the camera in the dock (but I hate leaving things on a trickle charger - I'm old school and have wrecked too many batteries by overcharging), so I only charge as needed.  I've gone days (like over the holidays) taking pictures with no need to recharge.The transfer via the dock is pretty slick - just dock the camera, hit the transfer button, and let it go.  I'm using USB 1.1 and it works great.  I did buy a memory card reader too (in case I needed pictures off the camera but the camera wasn't available), but so far it's been easier to just use the dock.The software that comes with the camera is good - but very basic.  It allows for basic corrections - red eye, cropping, rotating, brightness, contrast, that sort of thing.  I highly recommend getting something else to do heavy-duty editing - like a nice Adobe product.  I use Photoshop Elements 3.0 myself.One cool feature in the Kodak software is the ability to easily upload your pictures to Ofoto.com.  I don't use their printing services (Costco & Walgreen's is generally cheaper), but it is a great way to share photos with others (who can then order them if they want) and it's also a great way to archive those photos.  Best of all, it's free.Overall, I've been very pleased with this camera.  I've got plenty to learn, but this camera let me get started with taking great pictures immediately.", "Date": "December 29, 2004"}, {"Title": "CLEARING THE AIR", "Author": "DJ", "ReviewID": "R2CG4IF2G9V2WU", "Overall": "5.0", "Content": "I too am happy with my purchase of this unit. It bridges the gap between lower spec p&s; cameras and SLR cameras nicely. I generally agree with the reviews I've read here and haven't much to add on the merits of the unit. The pics are infinitely print worthy and will satisfy all but the most savvy (or hyper-critical) DC officionados. My sole reason for adding to this post is that I am reading a thread of misinformation here and would like to clear the air. The specs of the DX7590 and the Z7590 are basically identical. The Z7590 was NOT created to address any issues with low light focus and is in fact an update to allow the DX7590 to work with the new series 3 docking station. The Z unit does have an improved low light focus accuracy due to user feedback and this same update is available for the DX through a simple firmware update available at Kodak's website. Amazon does not allow linking but a simple search of the support page for your camera will take you to the download. If compatibility with the series 3 docking station is a requirement for you, then you need to be reading about the Z7590, not the DX7590. If you, like myself, do all of your photo handling with a PC, or if you already have a series 1 or 2 docking station, then your main factor in choosing between the DX or Z should be price. I took adavantage of a recent phenominal price on the DX7590 and feel like I've almost gotten away with a crime here. Something this great can't be this affordable, can it?", "Date": "December 3, 2005"}, {"Title": "great features-sharp lens-priced right", "Author": "LMJKOOL", "ReviewID": "R30I2H5NQN9TQK", "Overall": "5.0", "Content": "This is an easy to use, full featured 5.0 Mpxl digital camera with a super sharp 10X optical zoom lens(plus 3X digital zoom=30X total). It will be difficult to find a larger LCD screen on any other camera.  This screen is 2.2 inches and is huge compared to most cameras. Take my advice and buy a DX7590! I have been a longtime \"high quality\" 35mm SLR film camera user and was reluctant to \"go digital\".  I thought I'd lose the quality and versitility of my 35mm SLR...NOT SO!  The sharpness of this lense and the brillance of the color of the images is certainly equal to (and in most instances better than) anything I got from my 35mm SLR film camera. The \"close up\" mode yeilds some incredibly sharp photos.  This camera has a long list of great features, tricks and neat things it will do for you (like being able to zoom up to 8X when reviewing images on that huge LCD screen). When buying DX7590 with the EasyShare 6000 Docking Bundle, the docking station, which also serves as a battery charger is included in the \"Bundle\" price. This \"Bundle\" is the best value(docking station sells for $60.00-$100.00 if bought seperately). Also, consider buying an extra battery and at least one 128mb (or higher) SD card, both will come in very handy.", "Date": "April 15, 2005"}, {"Title": "This is a great all around camera", "Author": "Screamline", "ReviewID": "R3H2JWKPZ65NP6", "Overall": "5.0", "Content": "If you are a professional of course you are not going to be purchasing a camera in this price range, but if you are a beginner to a amateur you cannot do much better for the price. This camera has so many options it is almost impossible to take a bad picture if used correctly. It does lack a Manual Focus, but the options make up for it, so much that it really doesn't need a manual focus. It does all the work for you if you let it. I do wish it came with a carring case, but that is a minor issue. You will not be disappointed with this purchase unless you are a professional and have over expectations of it.", "Date": "March 25, 2005"}, {"Title": "super easy / low price, and 5 megapixels with 10x zoom", "Author": "Ken", "ReviewID": "R25T52NS5ZRPX", "Overall": "5.0", "Content": "this camera rocks!  it really outdoes most of the competition, and when you include the low price and other features, there are no real competitors.  kodak offers a 10x zoom and has 5 megapixels for super sharpness, even if you decide to enlarge the picture.  also, the camera can grow with you as there are wide angle, telephoto and close-up lenses available through amazon.  for quick prints, there is also a nifty printer that prints a 4x6 picture in under 2 minutes (also available through amazon).  the quality of the print is like a local shop, and the printing method, which uses a protective coating, makes sure the colors last forever (ink-jet printers can run/fade).  as an option, local photo shops can print your pictures from the camera.in sum:--the price is great, especially for 5 megapixels.--kodak is the number one brand for digital cameras.  they will be around to supply the camera/your photographic needs.  kodak is a trusted u.s. company while some others may not be around in ten years.--it's easy to use (no computer necessary).  but if you have a computer, the camera/printing dock can e-mail photos.--the camera has a 10x optical zoom -- super sharp pictures with great color of the kids/nature from far away.some others offer similar features, but nobody has the whole package at this price.  a home run!", "Date": "December 22, 2004"}, {"Title": "Very good camera.", "Author": "M. Tacker \"picky consumer\"", "ReviewID": "R1PXZDVLNZWD8E", "Overall": "4.0", "Content": "I've owned this camera for several months now, and overall, I am quite happy with it.  It is very simple to use.  It has plenty of features and enough options to satisfy just about anyone, but is easy enough for a beginner to master.  The video mode is convenient, as well, and I use it in addition to my iBook to make wonderful DVDs.This camera really shines in outdoor settings, especially in bright sunlight.  The colors are vivid and crisp.  The closeup mode is especially nice, and you will get well-focused images just about every time.  My one complaint is that the camera dos not perform as well as it could in low light settings.  I often photograph bands in venues that are not especially well lit, and I sometimes have trouble getting decent shots without resorting to using the flash.  Other cameras I have used have handled these low light situations more effectively.However, this camera is a very good value and I would recommend it to anyone wanting a high performance, versatile camera without shelling out the cash for a digital SLR.  It will serve you well.", "Date": "April 25, 2005"}, {"Title": "The slight enhacements make it better than the DX6490", "Author": "Navid", "ReviewID": "R442SOP2N4KML", "Overall": "5.0", "Content": "I wanted to wait a couple of years before buying a digital camera where I would get the benefits of price reduction, features, value, and better than average (over 3.2mp) MP quality.So my first digital was the Kodak DX6490.  I found the Kodak DX6490 very easy to use, and packed with features I would use, such as the MPG recording (limited to the size of your external SD card), which allows you to email clips (very cool!!).Then before you know it, less than 6 months later Kodak comes out with the DX7590.The first thing I like about it over the DX6490 is the turn switch.  It's much more smooth and doesn't need to have too much pressure applied to it.  I found myself skipping the setting I wanted on the DX6490 dial because of the amount of pressure I had to apply. It also features nearly a dozen more scene modes!Other things I like about it are the internal memory capacity of 32MB, which has doubled over the DX6490's 16mb internal memory size - and the extra mega pixel move from 4.0 on the DX6490 to 5.0 on the DX7590.I haven't found on any other digital cameras in the 5.1MP range. Good battery life, excellent picture quality outdoors, compact and fun to use, cool design, large 2.2\" LCD display (can't find that on most digital cameras), good software, 10x optical zoom, and as I mentioned before it records video clips.Battery life has been excellent and I would take quite a bit of pictures (75-120 pics at times) between docking the camera again. However, there is no recharger aside the base (docking station) the camera comes with. So, if you plan on going on vacation, you'll need to take it with you (power cord, base, and the USB if you're going to want to transfer your pictures to a computer).Manually controllable \"EasyShare\" is kind of an oxymoron. Generally, its feature set is useful, but it has some annoying gaps.Transferring pictures via the docking station works seamlessly, however there are a few annoyances such as the wait period for the card to be read on the memory card.  Getting the Ultra SD card will solve that problem.Convenient external controls provide quick and easy access to frequently used functions, such as the self-timer and the continuous-shooting mode. When you enter a mode, the camera briefly explains it on the LCD.Overall it is a good 1st time camera, and I give it a 9 out of 10 rating. It could be a 10, but I think that would push it into the $699 price range. You can buy this unit for about $300 at most retailers. Costco wholesale warehouse was selling it for $349.99 with the dock.  Prices continue to drop as the technology improves. This used to cost close to $500![...].Megazoom maniacs will over it because of the super zoom.  Great camera and it takes wonderful pictures.  Not to mention the Schneider Kreuznach lens.For a more thorough description you can look it up on CNET.", "Date": "September 28, 2005"}, {"Title": "Definitely a great buy!", "Author": "Michelle Carey", "ReviewID": "RYD96UEVJINNB", "Overall": "5.0", "Content": "The Kodak EasyShare DX7590 is truly a very nice camera. This is my first digital camera and I was somewhat hesitant about what kind of digital camera to purchase.  However, after a lot of research and reviews, I decided on the DX7590, because for me, it is a middle of the road type of digital camera.  It is has enough pixels (5MP) to take great pictures, as well as a zoom (10x) that will allow me to capture moments from a distance.  Basically, the DX7590 allows me to take quality photos, even when I am not trying.  I purchased the extra memory, the 512 MG card, and I am able to take up to 315 shots.The camera dock is very nice and although I purchased the printer dock plus, I usually leave the camera sitting on the camera dock to charge.  It's small and convenient, that I have it sitting on my dresser corner...it's definitely a space saver.  I would also recommend purchasing the Kodak Printer Dock Plus.  So far, with the pictures I have printed, I have been very satisfied.  No jams, no lines, no bends...just good quality photos.  I wouldn't recommend however if a person has a lot of pictures to print to use the photo printer, it would probably be more beneficial to print them through an online retailer or take it to store as CVS or Target to print them out.  But for a few prints here and there, it's a great in home system.The two together, with me...makes a great team for photography....you can be the same!", "Date": "March 21, 2005"}, {"Title": "My New Camera", "Author": "Sallie Bailey \"printmaker\"", "ReviewID": "R1G7TQR2TOJQ0V", "Overall": "5.0", "Content": "Perhaps I shouldn't even be writing a review yet. I bought the camera in December '04 and we just got around to installing the dock. A new USB hub for my elderly puter - plus a better surge protector to guard all the add-ons had to be attended to first. So. We installed it just 4 days ago and I have been taking comparison shots with my old digital camera and experimental shots to get the feel of it. I am impressed. (I have to take into account the fact that this camera -including dock here at Amazon - cost about $100 more than my old Olympus).One of the things I was most interested in was the more powerful optical zoom - 10X optical zoom vs. the old 3X. It's truly amazing.Another difference I noted is that when shooting through a window screen using the zoom at max - the old camera focussed on the screen - so its texture was the most prominent thing. The Kodak focussed on the distant scene with no suggestion of the screen.The lens is far superior to that of the older camera. There appears to be more depth of field. The images need less sharpening and the colors need less adjusting. The latter - I believe - is not a lens function but I'm discussing image quality.I'm finding the dock - which I was uncertain about - to be a very valuable accessory. It makes downloading much easier and faster. It fits neatly in a corner of the desk and does not take up much room. The camera lives there, happily keeping itself charged.I'm glad I bought this camera and I'm glad Kodak, headquartered in nearby Rochester NY, has come up with a winner in its line of digital cameras.", "Date": "March 2, 2005"}, {"Title": "Great Camera + Great Zoom = Great Photos", "Author": "S. E. Miller \"shutterbug\"", "ReviewID": "R1FVG54L61TAF6", "Overall": "5.0", "Content": "This is my second Kodak digital camera and I still Love taking those Kodak Moments!!  I'm not a professional, I just love capturing those fun moments to share with a photo, email or CD to play on our dvd!!  This camera has so many features, but what I like best is the way it makes my photos look so good!!  The Auto feature is my buddie and we take great photos together.  As I learn more about this camera I will be trying all the features.  I had a 2x zoom before and this 10x zoom is the greatest thing since sliced bread!!  It needs a steady hand and I was impressed at how well the photos were without a tripod!!  I Love this Camera and am very happy with my photos...  I'm not a pro just a very happy shutterbug!!  I've taken two 512mg cards of photos and mini movies and not a problem!!  Great Camera!!", "Date": "March 18, 2005"}, {"Title": "Kodak DX 7590", "Author": "Dick Stauffer \"Dick DeArmond\"", "ReviewID": "R1EZVFWXP1BZ4J", "Overall": "5.0", "Content": "I purchased this camera through Amazon.com and have been using it for about two weeks now. The camera is easy to operate and the pictures are excellent. The 10X zoom is one of the few zooms that remain clear and focused when at 10X. Would recommend for the new as well as the experienced photographer.", "Date": "December 27, 2004"}, {"Title": "AWESOME!!!! Great pictures!!!", "Author": "Tawnya Murphy", "ReviewID": "R1NBR9AYSGMCM3", "Overall": "5.0", "Content": "My husband bought me this camera for Christmas, and I though to myself I will never figure out how to use this!! Was I wrong!! It is SO easy to use! It is lightweight and compact enough to take anywhere. And not to mention, the quality of the pictures is awesome!! It takes much better pictures than my old 35mm camera. I definetly recommend this camera, it is well worth every penny.", "Date": "January 21, 2005"}, {"Title": "Answering 2 questions from reviewers", "Author": "Mombam \"Mombam\"", "ReviewID": "R1DVVAZIDK98TO", "Overall": "5.0", "Content": "Hi...I own the previous model (DX 6490) which I purchased in May 2004. I'm very happy with it..pity I can't replace it now with the latest model..but that's the price of 'obsolescence.' As to the two questions from recent buyers of the 7590 -#1 - I have had no problem with the rubber covers coming off. They are well-secured and I don't see that as an issue. Thus far, I have had no need for any repairs.#2 - on the battery charger set with the various voltages: I bought that kit and took it with me to the UK/Wales last summer. It charged my battery w/o problem. I think it was a worthwhile purchase.", "Date": "November 23, 2004"}, {"Title": "Unbelievable quality for the price", "Author": "Steven Quigley", "ReviewID": "RV0LTGMFX0ZDD", "Overall": "4.0", "Content": "I purchased this camera in October 2004 and have been using it now for 16 months. I have to say that I am thoroughly pleased with this product. I am a professional graphic designer, and I have used it to take photos that wound up being used in printed national magazines. Everything good about this camera has probably already been said in the other reviews (excellent picture quality, long battery life, good software support, etc.).My only complaint would be that there are times when it asks for the flash to be popped up (it's not automatic) in scenerios when I would have thought there was enough light. Also, if you've owned this camera since it's early introduction, make sure you get the downloadable firmware update from Kodak's web site--it fixed some issues I experienced earlier with focusing in indoor photos.UPDATE: In July 2006, I purchased a SanDisk Ultra II card for my Kodak DX7590, because I was hoping that it would be faster than the original SanDisk 512MB. But to my surprise, it timed exactly the same. So I emailed Kodak, and this was their response: \"We appreciate your interest in high speed memory for your digital camera. Our cameras are designed to operate, write and read SD cards at set voltage speeds. Therefore, there is no advantage to using faster memory in Kodak cameras.\"So if you use the Kodak dock to transfer images to your computer, there's no advantage to paying extra for a high-speed SD card. However, if you use a card reader to get images to your computer, then it might be worthwhile to pay a little more for the Ultra II since read and write speeds through the reader will be much faster.", "Date": "January 25, 2006"}, {"Title": "All my needs in one camera.", "Author": "L. S. Wilson \"lwilson\"", "ReviewID": "R2LAR9SB0I85JD", "Overall": "5.0", "Content": "I love taking black and white pictures and this camera does it for me.  I'm still playing with the sepia, practice makes perfect.  The zoom is awesome. I'm outdoors alot and enjoy taking nature pictures.  I enjoy experimenting with different shots with this camera. Recommend buying a large memory card if you're shutterbug and an extra battery.", "Date": "November 10, 2005"}, {"Title": "Useless camera!", "Author": "Steven L. Goldstein", "ReviewID": "R2RE7IWGL6237G", "Overall": "1.0", "Content": "Before I tell you about the problem I had with this camera, let me explain something about myself (this is important because if I was reading the review I'm about to write without knowing about the author, I'd think the author must be some kind of a nut case; this camera has been reviewed so positively that I can't believe what I'm about to tell you myself).First, before getting involved in digital photography, I was a successful amateur photographer with an old Pentax manual SLR camera. I understand what terms like shutter-priority and aperture-priority mean. Also, after the old Pentax, I've been successfully using an Olympus C-3030 digital camera for 4 years now. This is the camera I'm trying to replace because I want a more powerful zoom. So I do have experience with digital cameras. And finally, I work in a technical field, so I'm good with computers and other technical products. OK, enough about myself. Let's discuss the camera.I can't believe how unreliably the DX7590 achieves proper focus! The camera gives me the green bracket indicator letting me know that it thinks it has focused on the subject, but at least 50% of the time, it's wrong! Sometimes it's so far out of focus that I can see it on the display before I take the picture. Sometimes it looks in focus on the display so I'll take the picture, only to discover that the shot is out of focus when I review the picture later.I get the same result regardless of how zoomed in/out I am; what PASM mode I use; what focus mode I use (there are three focus modes, none of which is manual focus); or what shutter speed is used.Believing that I must have received a lemon, I returned the first DX7590 to Amazon for an exchange. After all, a camera that has received such positive reviews CAN'T have a problem with a fundamental function like focus, right?Wrong! The second DX7590 behaved exactly the same way! So now I'm sending the camera back to Amazon for a refund, and am starting my research over again to see what I should buy instead.Good luck to you if you buy the DX7590. No, you don't need new glasses. It's the camera that's out of focus!NOTE on 1/19/2005: I ended up buying a Panasonic Lumix FZ20. This camera rocks! 12X optical zoom, optical image stabilization, hot shoe, and more. AND THIS CAMERA KNOWS HOW TO FOCUS!!! Check it out--much better camera for only a little more money.", "Date": "December 31, 2004"}, {"Title": "I love this camera", "Author": "arcdude", "ReviewID": "R1KPNRUM28HF4G", "Overall": "5.0", "Content": "This is the 3rd digital camera I have purchased, but it is the first one I purchased for myself.  The first digital I bought was a Minolta Dimage 7 for my daughter, which I was very disappointed with.  The picture quality was very poor for a $700 camera.  The only thing I liked about it was the zoom ability of the 7x lens.Well, technology sure has come a long way since then.  The new Kodak is about half the size of the Minolta with 3x more telephoto capacity and more than twice the resolution.  And I love it.  And it was much cheaper.The main reason for choosing this camera was the large lens on a fairly small camera.  And I was not disappointed.  But I am also impressed with Kodak's ease of operation.  When I get a new toy, I sometimes become very impatient when learning how to use it.  I found this camera to be very easy to learn how to do everything it does.  I also got the printer dock, which I think is fabulous.  I originally didn't want the dock, since my younger daughter already has an HP photo printer that can print from the SD card.  But I am glad I did.  It is nice to be able to just set the camera on top of the printer and instantly do anything you need to do with the pictures you take.  It is simple to both print pictures and also to load them onto your computer, all while the battery is charging.  Both the other digital cameras I bought required removal of the batteries to charge them.  What a hassle!I have only had this camera for a couple of weeks, but already have taken hundreds of pictures.  I have only had focus problems on a very few shots, and I chalked that up to inexperience.  The shots that were out of focus were because it focused on something other than the main subject of the picture.  I just need to make sure that I am focusing on what I want to be the subject before taking the picture.  So I was surprised to read about focus problems from other reviewers.  I guess I really haven't taken many low-light pictures, yet.  Actually, the problem I have had is in bright sunlight where it is difficult to see the screen display so you can't see the focus brackets.  I solved that problem by using the viewfinder when in bright sunlight.So I would recommend this camera for the follow reasons:1.  Great telephoto lens2.  Long lasting battery that charges in the camera.3.  Ease of use.4.  Printer dock allows printing, downloading, and battery charging in one package.", "Date": "August 8, 2005"}, {"Title": "Awesome Camera!  If you're a beginner choose Kodak!", "Author": "K. Steele", "ReviewID": "R1HYZSU99KEH0R", "Overall": "5.0", "Content": "We bought this camera November 2004 after reading several reviews. The zoom is awesome! The sales woman at CompUSA tried to tell me that I wouldn't want this much zoom since my children are young and not into sports yet. I'm soooo glad I disregarded her advice. I have used the zoom numerous times. This camera takes excellent pictures, especially outdoors. I have had several compliments on the prints from other photographers. Also the battery is amazing! I have had to recharge the battery 2 times since getting it 6 months ago and I have taken hundreds of pictures. We also love the extra features and the fact that the camera tells you what each button does (so you don't have to memorize the instuction manual). We highly recommend the Kodak brand! I haven't totally figured out the manual settings on it yet. That's the only draw back I've had (no artsie fartsie stuff). But you can pretty much do that kind of stuff with a good Photoshop program anyway. All in all great camera!", "Date": "May 31, 2005"}, {"Title": "Great camera, great value for money!", "Author": "Michelle888", "ReviewID": "R3RKA1L7KNRFE6", "Overall": "5.0", "Content": "While it seemed that everyone we know had digital cameras, my husband and I were still using our \"Jurassic\" manual camera. I guess our main issue was none of the photos produced by our friends' digital cameras seemed good enough once printed on paper. Anyway, one of my colleagues at work bought the DX7590 and took plenty of photos while she was overseas.  Lo and behold, she showed me the printouts and I was impressed! So off I went shopping and after comparing it with three other cameras, I thought the price was very reasonable. It features 5.0 megapixels, 10x optical zoom, and alternative movie-mode with sound - whereas other brands with similar features are a lot more expensive (I've looked at Canon and Konica).I've been fiddling with this for a while now and considering I'm a novice, I find that this is very user-friendly. I still need to learn a few more tricks but here's what I found so far:Pros:* High picture quality. The colors and image are vivid and sharp.* Ultra zoom is great* Lightweight* Controls are easy to use* Really excellent for daylight and outdoor photography* Built-in instruction that briefly tells you what each button is for* Video mode is a bonus; just don't expect it to be of the same quality as a proper digital video cam* Battery life is very goodCons:* The lack of manual focus; I sometimes struggle with the auto focus* Indoor photography and low light might be a bit of a problem* No carry case (at least not here in Australia)All things considered, this novice thinks this is a really great camera that's a real value for money. It might not be suitable if you're after a pocket camera though. Also, make sure you get at least a 256MB SD card, as the internal memory doesn't hold many photos.Highly recommended!", "Date": "June 21, 2005"}, {"Title": "For the Price Im Happy with it!", "Author": "ed \"ed\"", "ReviewID": "R2KVNPNSKU56ZJ", "Overall": "4.0", "Content": "Ok lets face it, this is not a high end pro camera.However for the price it's quality plus features and accessories would be hard to beat!I had an 8x10 print made from a 5mp w/ fine res. setting (CVS Kodak Kiosk) printed, and was very pleasantly surprized at the exellent quality obtained.Untill the megapixels become standard at 25 to 30mp (equiv. to 35mm film on a pro camera lens combo with fine grain film), and the prices are in this price range, I dont plan to upgrade.So for the next couple or few years (should the camera last that long) this model will serve me as a convienient snapshooter.I do reccommend also purchasing the 55mm filter adapter for this camera, it will provide many options as well as protect the lens.This camera I find better suited for outdoor shots than indoor, the  built in flash is not very strong (I use an external flash with flash bracket)and the camera does not have low light assist to aide in autofocus. The settings you use will greatly affect your result as with most digital cameras.Overall - a lot of bang for the buck (well worth the price).", "Date": "October 31, 2005"}, {"Title": "It's a pain to take on vacation!", "Author": "Scott P. Stewart", "ReviewID": "RVZMA070WCRLW", "Overall": "4.0", "Content": "First of all let me say I am very satisfied with the performance of this camera.  Since the other reviews do a very good job of describing the pros/cons of the functionality of the camera I just wanted to add two pieces of information regarding the available accessories:1. There's no car adapter.  Yes, that means, heaven forbid, if you'd like to go on a longer trip without having access to a wall outlet you had better conserve the battery or buy multiple batteries.  Take a road trip?  Go camping for a few days?  Now who would have ever thought people would want to take a bunch of pictures on such occaisions.2. The 'AC adapter' doesn't charge the battery.  There are two options to charging your battery: Use the dock or buy the separate battery charger.  Once again, this makes it difficult to take on trips.What's most annoying is that these accessories should be very cheap to produce and they are so common with other portable electronics I just assumed they would be available.", "Date": "September 20, 2005"}, {"Title": "great great great", "Author": "Mike P. \"MAPRX\"", "ReviewID": "RXVB1SCKRGISQ", "Overall": "4.0", "Content": "only problem, focus is not that great in dark setting, otherwise, a great digital camera", "Date": "June 8, 2005"}, {"Title": "Love my Kodak  DX7590", "Author": "Janice R. Doughty \"Janice Doughty\"", "ReviewID": "R1OS66DSN5B4K9", "Overall": "5.0", "Content": "I put my name on the waiting list and got one of the fist when they started selling them. I have never been disappointed.  I take lots of wildlife and scenery. You can use the different setting for all conditions and the color is  great. The snow setting has given me some great pictures as has the macro for wild flowers. I have had other digital cameras and the Kodak  DX7590 beats them all in its price range.", "Date": "July 24, 2005"}, {"Title": "Great camera!", "Author": "Papa Bear", "ReviewID": "RQXLQZYDCLKH7", "Overall": "5.0", "Content": "Bought my DX7590 to take on a trip to Japan in March 2005. I took hundreds of pics in all conditions. While not all the pictures are keepers I was amazed at how great most of them came out.  The battery lasts forever.  And since I bought a spare I never had to worry about having a dead battery.  I also bought 2 1-gig SD cards. So far I have only needed one.  Since the Japan trip I have taken hundreds of pictures at High School graduations, Birthdays, trips to the lake, Skateboard park, etc. etc. I get tons of complements on the pictures I take.  I am still learning how to use all the different features this camera has but just using the auto setting can get you shooting like a pro right out of the box. Love the size too. Easy to carry along. Not too bulky.", "Date": "July 24, 2005"}, {"Title": "More camera than I know what to do with.", "Author": "The Old Philosopher \"The Old Philosopher\"", "ReviewID": "RJ0BJ6YZ1A4GE", "Overall": "5.0", "Content": "I looked at digital cameras for a few years before selecting the DX7590.  Each year the number of pixels in cameras kept going up while the price stayed about the same.  The first year I was looking a \"good\" consumer camera had about 3 megapixels, then 4, and now I was looking at cameras with 5 megapixels.  What sold me on this camera was the large lens.  Instead of one of those small lenses that most comparable cameras have this one has a real large glass lens manufactured by a real German lens maker.  Yes, it has all the features you might want if you're an amateur and then some.  I probably will never use the manual override features that allows you to set the shutter time and exposure level, etc., instead of allowing the computer to do it for me.  I'm still a little bewildered by the large array of optional settings for different subjects, but I've taken what I think of as superb photos.I've been taking \"snap shots\" since my first Brownie camera 50 years ago.  They were all nice for family albums, but never anything that I would say could compete with professional photos.  But all that has changed.  The picture brilliance, clarity, and overall quality that I'm getting outreaches any of my expectations.  Last week I was on a camping trip and took a photo of the early morning fog across the lake.  Yousers!  It looks to me as good as many I've seen in professional photo exhibitions.One problem I'm having is that the 5 megapixel format is so large that I have to shrink the pictures to put them on a web site.  One reason I wanted a digital camera was to be able to put photos on the Internet.  So I switched to the optional 1.8 megapixels photos, and it's still too large for my web site.  Even at 1.8 megapixel setting the photos are brilliant and clear.  It must be the big lens and quality optics.  I tried taking some pictures of flowers, and some of them came out blurry.  I think I'm having trouble holding it still for the close ups.  I guess I need to put it down somewhere or get a mount.  It does have a setting for minimum focal length that is a lot closer than many comparable cameras.  I got really good close up, and then blurry ones.  Between you and me I suspect it's operator error.I keep forgetting that I can take as many pictures as I want for free and discard any I don't need.  I like viewing them full screen on my PC.  The \"easy share\" base works pretty well.  I have to remember to open the Kodak software and turn on the camera before downloading all the photos to my PC.  I bought some extra memory and that helps.  It says on the screen that I can take 632 pictures at 5 megapixels, or over 1,500 at 1.8 megs.  Maybe it's right. I never take that many.  It's really a lot more camera than I've ever had, or know how to use.  The quality of the pictures is superb.  It's easy to use.", "Date": "June 15, 2005"}, {"Title": "a step down from the DX6490", "Author": "Frank Gualtier", "ReviewID": "R1SXOKKAINEU10", "Overall": "1.0", "Content": "Summary: A nice camera for the price but a frustrating tease in how close it comes to being so much more.Battery: Battery life is this camera's biggest asset. On a single charge I've taken well over a hundred pictures at highest quality (largest file size) and flash, over a period of several hours, and still had juice to spare. I bought a spare battery because of the terrible experiences I've had with previous cameras and over the course of the month I've owned the camera have not had to resort to using it once.Features: Chock full of features. More than most will ever use. Considering some are useless (auto mode does the same or they flat out don't produce desired results) I'd suspect more than anyone would ever want to use. More detail below on some of them.LCD Display: Very nice large LCD display and a miniature version of it when you switch to the mode that lets you use the viewfinder instead. That is to say, the viewfinder is also LCD based. Unfortunately this is definitely NOT a WYSIWYG scenario for either the large display or the viewfinder. Don't believe me? Go take a picture of the full moon at night. You'll have to set the f stop to a large number, the shutter speed to a small number, and make sure the ISO isn't set to high (or you'll get too much light). Zoom in to at least 10x. Next, focus by pressing the shutter button halfway down (use landscape or not - for this test it won't matter). You'll notice the moon appears as a bright white blur. Snap the picture and you'll see a much sharper (disatisfactorily sharp, but sharpER nonetheless) image that looks nothing like the LCD or viewfinder did when you took the shot. Many other ways to test this but this was one I just tried so it's fresh on my mind. So if you're wanting to see what you'll get - this isn't the camera for you.Landscape/Macro modes: The landscape mode is helpful, and in many cases necessary as you can't always focus on semi-distant to distant objects of interest. I wouldn't call it great but without it the camera would be worthless for anything but closeups and objects that are bright enough (or have distinct enough outlines). Macro mode I give a plus and equate it in terms of desirability to my praise of the battery life. You can get within a inches of an object and snap some incredibly sharp images. If you're selling coins on eBay as your living and are currently using a scanner then this camera would not only replace it but it does ten times the job with ten times less cleanup. You'll also end up with images at angles that show off the height and wear features better. It's equally good with flowers and the likes. Many (if not most) such images may require some post adjustments but they're minor and easy and worth the effort.Flash: Again this would be another plus. Works like a charm.Focus: Here's my biggest gripe. In low light (as others have mentioned) and also at times when outlines aren't very distinct (clouds, for example) it can be enough to make you want to pull out your hair trying to get a proper focal lock on the object of interest. Sometimes you'll the focus pass right by the sharp point before the focus locks a hair off from it yielding a less sharp image. Obnoxious as the dickens. The DX6490 I have as well works in a similar fashion yet I have very little trouble locking right on for crystal clear images. Why is this so important? Two reasons: i.) An image that's even slightly out of focus completely destroys the point of the extra megapixal the DX7590 has over the DX6490. ii.) Because the camera won't save in raw mode and even it's finest JPEG compression is still overly lossy you won't have much luck using post processing software to sharpen such things up without a lot of artifacts left behind by the lossy JPEG compression. This is just bad and renders, in my opinion, upgrading from a DX6490 a waste of money.As some have mentioned, this camera (and all like IMO) should come with manual focus in addition to the auto. This would have made a major difference to me. I could list reasons for days but I'll give you one that's stark: You're taking pictures of birds that are all flying overhead at roughly the same height. When zoomed in (one of the highlights of this camera is it's awsome 10x optical zoom don't forget) you can get a fairly decent shot (not perfect - I'll gripe forever about that I suppose). Trouble is, most birds don't fly in a circle above you long enough for you to get a focal lock on them because the camera's auto focus just isn't fast enough. Can't penalize for that in this price range. However, if you were able to manually focus you'd require little or no adjust once you got yourself in the right zone with the birds you're shooting, and consequently you'd get much sharper images of them. Finally, try as you might, sometimes this camera will focus on an object that's within the field of observance but nowhere near the distance as the object of interest. This happens in split to pinpoint focal mode and is another hairpuller. You can trick the camera by getting a lock on an object of similar distance that has nothing obtrusive in the field, keeping your finger on the focal lock (shutter button halfway) then moving back to your object of interest but that's a kludge and shouldn't be necessary. My DX6490 does a FAR better job at discerning things such as this and requires far less trickery.Movie Mode: You're stuck with one option here and that's Apple Quicktime format. This should plainly be MPEG, an open platform, and not a proprietary format. Additionally, you cannot adjust the zoom once you start recording.On/Off Button: Definitely an improvement over the DX6490's rotary on/off mechanism, but not so much so as to justify the price difference.Zoom: Like the DX6490 the 10x optical zoom is impressive. All digital cameras that don't fall into the 'just for party photos' category should do at least a 10x optical zoom. The additional digital zoom is helpful - I have to disagree with those who think otherwise. I'll tell you why: If you use the digital zoom you're doing basically the same thing as you could do with photoshop after the image is taken (blowing up an image via software), however, being able to do so prior to the lossy JPEG compression will get you some very far off shots (I can make out the lettering on airplanes, for example) that are at least useful. If you don't use the digital zoom and then decide to zoom in later with your computer based software you'll be amplifying those nasty JPEG artifacts along with the object of interest.Review Mode: Excellent. No complains here and I especially like the fact that you can do as much as an 8x zoom while in review mode. Very handy.Nothing else about the camera struck me as above or below average so I'll leave it at this. The one star I give this camera is strictly based on the fact that I don't find it a total piece of junk, but it is going back to the store for a refund as my DX6490 (apparently the predecessor to the DX7590) does a better job with one less megapixal.Good luck all.", "Date": "November 25, 2004"}, {"Title": "Highly recommended...", "Author": "Anna McClung \"Crossfire\"", "ReviewID": "R1IZ3BC8BKR9G7", "Overall": "5.0", "Content": "I bought this camera in Sept. of 2004 and it has lived up to my expectations fully. I have not had any problems with it and I have used it a lot. It takes great pictures and is very easy to use. The battery life is super strong. My camera battery has never even come close to going dead on me, and i've been out and about for hours taking lot's of pictures at a time. As well as it being a 10x optical zoom (the real deal)it has a very nice 38-380mm zoom lens and also has two accessory lenses and three filters that can be purchased for it. I cannot think of any cons about this camera, except that it would be about perfect if it had built in image stabilization or a cable release button. But to help counteract that, use a good tripod and make sure that your focus is locked. The more you practice with this camera the better the pictures you'll take. And remember, with any camera you have to take a lot of pics to get the good ones. With digital it is so nice because you can instantly see how your pics are going to look. I am impressed with Kodak and I highly recommend the Kodak EasyShare DX7590 for anyone who wants a really nice digital camera at a very affordable price. Now is a great time to buy it too as the price has come down considerably from when I purchased mine.UPDATE 12-1-08:I now have had this camera for 4 years. It is a great little camera, especially for the price. I've taken hundreds of pictures with it and have had no problems. One thing though is that you have to make sure that your focus is locked in. Partially press the shutter button twice to lock it in. Make sure your lighting is also adequate. I stand by what I said 3 years ago and I highly recommend the DX7590. Kodak cameras are really good little cameras.", "Date": "December 2, 2005"}, {"Title": "A camera with which to grow!", "Author": "James M. Trainor", "ReviewID": "RM4G6M2ADOU5Q", "Overall": "5.0", "Content": "The Kodak DX7590 produces, as reviewed, fine quality auto point and shoot pictures.  However, there are enough bells and whistles to learn from.Indoor color seems a bit off, but even that is not too bad.This is not for a pro, but is a great camera for the rest of us.", "Date": "July 15, 2005"}, {"Title": "Unbelievable Close-Ups!", "Author": "Mammaw Staples", "ReviewID": "R354SOYFTEQ9B9", "Overall": "5.0", "Content": "This camera was an early Christmas present for my husband and myself.  We absolutely love it and cannot wait for our next grandbaby to be born in April because the close-ups are unbelievable!  The convenience of printing our own chosen prints at home is also a great bonus!  We recommend this Kodak camera to everyone!", "Date": "December 28, 2004"}, {"Title": "My First Digital Camera & I Love It !!!", "Author": "Theresa \"Loves Kitchen Gadgets\"", "ReviewID": "REENAV87OJRZK", "Overall": "4.0", "Content": "I bought this camera after months of research. The reviews helped me a lot to make my final decision. Bought this camera in April/2005 & took it on a trip to Monterrey in June. I'm amazed how the pictures taken of the 17-mile-drive scenic spots in Pebble Beach turned out, they looked like they were taken by a professional, & I tell you, I'm as amateur as they come :) The 10X optical zoom worked great, birds perched on huge rocks that looked like small specs with the naked eye came out very clear, considering that I didn't use a tripod and my hands weren't that steady at all. Most of my indoor pictures came out okay, a few were blurry since I may have not focused it correctly. The \"scenery\" mode of the camera is great, the landscape & scenery pictures turned out fantastic. Some shots that didn't turn out clear were those taken indoor where flash photography was not allowed (certain sections of the Monterrey Aquarium). But some of my non-flash pictures turned out okay, it seems to work fine for subjects that had some backgound light. Have yet to learn the other camera features, I mostly used the auto mode to just point & shoot. I'm quite satisfied with my purchase, it's a very good buy !", "Date": "June 18, 2005"}, {"Title": "A Note For An Amateur Photographer", "Author": "Kelly Kel \"In the TARDIS with the Doctor\"", "ReviewID": "R3O7UWAV71Y6B8", "Overall": "5.0", "Content": "Let me begin by saying, I'm not a professional. I take photos for fun and to record events in my life. However, with this camera, I have been able to take some amazing photographs that I'm truly proud to show to friends.The zoom is phenomenal and was the reason that I upgraded from my previous camera that had only a 10x zoom. This zoom has allowed me to take great photos from spectator stands and at shows that would have looked ridiculous with a camera with a smaller zoom capacity.My favorite feature is the close-up feature which has allowed me take some stunning photos of my flowers and of birds roosting on my feeders. I've consistantly found my photos to have vivid coloring and crisp details which is something my other cameras lacked.For the amateur that wants to take fantastic photos that makes your friends say, \"Wow!\" this is a great camera. The only issue I've had with the camera is taking photos of heavily lit situations at night such as Christmas light displays, etc. No matter what setting I used, the photos still came out a bit unfocused.However, everything else is superb. A fantastic buy.", "Date": "April 21, 2006"}, {"Title": "Why stop halfway?", "Author": "J. N. LeDuc", "ReviewID": "R2K8QVCSLUNU0X", "Overall": "3.0", "Content": "Great for a P&S;'er, terrible for anybody else!  Kodak started with great options but left a few important ones out.I was an SLR (single lens reflex; non-digital) user and first purchased a Kodak point and shoot (P&S;) several years ago.  Although, I am not a professional photographer, I do rely heavily on manual settings like the F-stop, shutter speed and manual focus to manipulate my results.After being satisfied with a Kodak P&S; digital I upgraded to the DX7590 which appeared to be great for in its class.  I was satisfied with several options until I began using it and found several missing options that left much to be desired.  I have had this camera since December 2004 and have had plenty of time to get used to the options and settings.If you are an average P&S; user and want a camera to do all the work, this is a great camera for you.  If you want to have control over how your picture is taken using the manual settings, this camera isn't for you.  Granted, f-stop and shutter speed are adjustable, but there is no manual focus.This leads me to the focus issue I've encountered and read about in other reviews.  In low light or closeup situations the camera can never autofocus precisely and the camera has no manual focus.I wrote to Kodak to ask about/suggest a firmware upgrade that could address these issues.  Essentially, they said thanks for the suggestion and they are continually producing quality products.  They didn't offer any suggestion or solution to the issues mentioned above.Based on this, I see no use in keeping the camera as it is useless to me without the features mentioned above.On the bright side, in bright lighting the camera does take some great photos and does manage to focus as long as you don't get too close to your subject!  I have several pictures that came out very well.So I hope Kodak gets it right next time by finishing the camera they started!  The Fuji Finepix S5100, S5200, S9000 appears to have the options I really want and need ranging from about $300-$700 dollars.", "Date": "August 7, 2005"}, {"Title": "Easy to Use", "Author": "Amazon Customer \"shadblu\"", "ReviewID": "R3KV5CKWNOO3Z9", "Overall": "5.0", "Content": "Never having had a digital camera and having even less knowledge about how they work, I was very skeptical.  My son actually picked this camera out for me, taking in the above problems.The camera and docking station are a breeze.  I have learned how to use them much quicker than I would have thought.  I also find new features to master.It is easy to use, compact and even a beginner can master it.", "Date": "September 16, 2005"}, {"Title": "Focus Is Not the Focus of This Camera", "Author": "Gob", "ReviewID": "R2KOVWS0JHOVQ7", "Overall": "4.0", "Content": "This camera is great, wonderful, one of the best on the market...if not for that pesky auto focus feature. I was surprised at how well the video feature works; it's not the same quality you're going to get with a stand alone video camera, but it's not bad either. My may beef with this camera is the auto focus...sometimes it works, and sometimes it doesn't; I noticed that it's usually out of focus in indoor/night shots when optical zoom is being used. For the most part, this can be fixed by putting it on a tripod.", "Date": "February 18, 2005"}, {"Title": "DX 7590", "Author": "J. LoPresti", "ReviewID": "RA8ZLXPIJNCIS", "Overall": "5.0", "Content": "What a great camera. Picture quality is very good and the burst is fun to use. Video feature is fun to use. The zoom is great. You can capture a high quality shot from a long distance. Took some shots at a baseball game in the sport mode and it froze the action. (...) Best price I could fine..............", "Date": "August 28, 2005"}, {"Title": "Great Camera- Easy to use!", "Author": "K. Eskierka", "ReviewID": "RIK4ELAUMXB3R", "Overall": "4.0", "Content": "This is my first digital so I did a lot of research before I purchased. It's extremely easy to use, and easy to share pics via e-mail. I'm not computer savy so this was important for me. The pictures look great, there are lots of features available and they are easy to navigate from the menu. The camera is a little bulky, compared to my 35mm, but I'm adjusting!", "Date": "August 26, 2005"}, {"Title": "OK Camera, Horrible Battery", "Author": "Trevor J. Bihl", "ReviewID": "R3T15X9ZA1KZVZ", "Overall": "1.0", "Content": "The camera takes very good pictures, but the overall size makes it cumbersome to carry around.  In the two years I've owned it, I brought it with me less than I would've for a smaller camera with worse optics.  On hikes it is pretty much impossible to bring along because it's too big to fit in some day packs.And after only having this camera for two years and using it sparingly, it will not work now because the camera electronics will not fully charge the battery.  Purchased replacement batteries, which are specific to this camera, but these will not fully charge either.  For the price of the camera quality control should be significantly higher, buy a Canon, or something that will let you use standard sized (AA, etc.) batteries at least, instead.", "Date": "July 11, 2007"}, {"Title": "Kodak Easyshare DX7590 5 MP Digital Camera with 10xOptical Zoom", "Author": "Anthony J. \"tony\"", "ReviewID": "RJ89DE4434K58", "Overall": "5.0", "Content": "Best point and shoot I have, and I have a few (Nikon,Sony, etc.) A bit clunky but worth the size. Not good for movies, but I use it as  picture camera.Only takes 2 GB Max SD cards, but at 5 mp it's ok. Battery life is outstanding, and speed of shots are adequate 1 every about every 2 sec (with flash). Very clear , sharp images, good color saturation, no complaints. Like ALL cameras an extra flash for poor lighting situations needed for a good night pic.I bought one recently to replace my 8 y/o DX 7590 camera that was submerged in sea water getting of a snorkeling trip on vacation.", "Date": "February 20, 2013"}, {"Title": "Ideal for the occasional casual photograph", "Author": "James White", "ReviewID": "R8FT6VAITYRDT", "Overall": "4.0", "Content": "Not a bad little camera with plenty of enhancement products still available for purchase.  Although not state-of-the-art, this little camera does the job for the casual user, incorporating the basic features most wanted.  It gives the appearance of being a \"better\" semi-professional camera without looking overly complex. Recommended for the beginning photographer who wants the option for something delivering both point-and-shoot technology and manual photography tweaking.", "Date": "October 20, 2012"}, {"Title": "Great camera!", "Author": "Sam", "ReviewID": "R2CISAUS1IWNU2", "Overall": "5.0", "Content": "I have had this camera for years now and it has been the best camera I've owned so far. It has a bunch of settings such as 'distant landscape', 'bright beach scene', 'portraits', 'night scenery', etc. It takes great photos and zooms pretty well for a little camera. I use it mainly to take beach, boat and sunset pictures and I have received countless compliments. The pictures come out best when you use a tripod to hold it steady but that is really my only complaint!", "Date": "July 18, 2011"}, {"Title": "very successful purchase!", "Author": "orthoasst", "ReviewID": "R3JAC08R68JCP0", "Overall": "4.0", "Content": "This camera was in excellent condition when I received it. I have two other cameras identical to it that we use in our other offices and it works just the same. My only complaint is that the toggle button in the center sticks a little, but it's not a big deal.", "Date": "June 25, 2011"}, {"Title": "Kodak EasyShare", "Author": "PickyOne", "ReviewID": "RN72URHWXDCG8", "Overall": "4.0", "Content": "Great price for the product. Seller provided the necessary information before the purchase of the Kodak EasyShare DX7590 Camera and Dock Bundle.  Had a need for existing Kodak printer to work with this camera and dock.  Kodak tech support was not very good in assisting me with this challenge.  This seller was efficient in the product they sold.", "Date": "June 9, 2011"}, {"Title": "LOVE MY CAMERA", "Author": "Corina V. Toscano \"vanessa\"", "ReviewID": "R359EDEBH7LKQS", "Overall": "5.0", "Content": "I LOVE THIS CAMERA AND THE SELLER SEND ME ALOT OF STUFF THAT I DIDNT EXPECT TO GET. THANK YOU. LOVE IT", "Date": "May 7, 2010"}, {"Title": "I like take photo with my new carmer the picture come out relt nice and clear", "Author": "Claudia M. Anthony \"claudiam anthony\"", "ReviewID": "R3VN9UKXA4EWCL", "Overall": "5.0", "Content": "I buy my camera to take picutre for the church i go to sofor the picture come out nice I realy like kodax Easy share", "Date": "March 10, 2009"}, {"Title": "GREAT CAMERA!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!", "Author": "Kelleymdavidson \"guitar-west\"", "ReviewID": "REHHL8G4RQCMV", "Overall": "5.0", "Content": "Hi,I already own a camera just like this one and love it. Bought this one for my son, plan to buy one for my daughter later for her b-day. Only thing missing on this model is the stablization, but can do with out most of the time. It's a great camera and I love using it. I get really great photos and can zoom up on the image alot and still get great quality!!!! I looked at the newer cameras, but I wanted a viewfinder to look through and some of the newer models don't have a viewfinder, which drove me up the wall.Love this camera!!!!!A+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++", "Date": "January 7, 2009"}, {"Title": "Kodak Easyshare DX7590", "Author": "Harold M. Landy \"Old Guy 1\"", "ReviewID": "R1PMFLH259M0ZW", "Overall": "5.0", "Content": "I conducted several tests against Canon and Nikon lenses.  I don't know how or why but the Schneider KREUZNACH Varigon came out on top!  The low pixel count requires working-around, but no big deal.", "Date": "December 26, 2008"}, {"Title": "One of Kodak's best models ever!", "Author": "A. C. Hepworth \"americanamama\"", "ReviewID": "R2JGDRUSZEK1D6", "Overall": "4.0", "Content": "I live in a small town and am kind of the resident camera expert and have bought digital cameras online for about 25 people. I have owned this model of Kodak camera (twice, in fact - have now upgraded to a DSLR) and have bought it for about 5 of my friends. It is a great camera.  It takes very sharp, clear outdoor photos with excruciating detail.  It does a better job than most, indoors with a flash.  Very vibrant colors. It's quite fast and has good flash range and recharge time.  It has 10x optical zoom which isn't stabilized, but I never had any problems with blurring, even at maximum zoom range (granted, I am quite good at holding a camera steady).Kodak has one of the easiest to use menus in the business and this one is no exception. I am also a fan of the joystick design which makes navigating a \"joy\". This camera is practically indestructible.  It seems to be faster and takes better photos than the newer models that Kodak has put out lately (z712, a612).  I even liked this model better than the P850 which is supposed to be their professional model, but it is much heavier and doesn't have anything on the dx7590 in the performance department. I keep recommending this one to people over and over again. I only held back one star because of the grainy lcd (the photos are never grainy - just the screen) and very slight amounts of softness in some images - which is very typical of Kodak. Overall, it's one of the best cameras I've owned - and I've tried almost every brand and model out there.It's interesting to me how a camera company can get some models right and others are not so good. This one was a winner.", "Date": "November 7, 2007"}, {"Title": "Very Pleased", "Author": "P. Garner", "ReviewID": "R136548CUIA74Z", "Overall": "4.0", "Content": "There are a couple of \"minor\" quirks of this camera but let me say first that it's one of the best 5mp \"near-SLR\" DCs on the market.First quirk:  In video mode, the zoom is disabled.  Being able to zoom in and out in movie mode is basic and I'm not sure why this camera doesn't support it.  But, it's a DC not a camcorder.Second quirk:  If you buy the 58mm adapter so that you can put a protective filter over the lens, the built in flash gets cut off by the collar and the pictures  are dark in the lower half.  If this is a problem, keep the stock lens cap on and be a little more careful with the lens.  Flash can be solved with a \"head 'n handle\" flash unit (from $10 on ebay).  External flash connection was a BIG selling point for me.This camera has become my light meter for my film SLRs.  Instead of taking readings, I use the bracketing function +,- EV to find the best looking shot on the large, bright viewfinder/screen.  Click on \"Info\" and see exactly what fstop and shutter will expose that old-fashioned and expensive 35mm film perfectly!", "Date": "November 20, 2006"}, {"Title": "KODAK DIGITAL CAMERA DX7590", "Author": "Irina Vaintrub \"LadyI\"", "ReviewID": "R13PCLTT742KNV", "Overall": "5.0", "Content": "Fantastic![...] perfect way to describe this camera. Easy to use, terrific quality. I would highly recommend the camera.", "Date": "August 31, 2005"}, {"Title": "Kodak Delivers", "Author": "Phat Rat \"The Smiler\"", "ReviewID": "R10PXYHATNR18D", "Overall": "5.0", "Content": "After looking for 2 years, reading countless reviews, I purchased the DX7590 with dock and paired it with the Canon IP4000 printer.  I am a novice in photography and this was my first digital camera. With little more than intuition and occasional referencing of the manual I was shooting great shots within an hour of opening the box.  The 10X zoom is great alowing me to fill the picture with the subject of the shot.  Download from the dock is simply a press of one button and wham the computer receives all the images.  The pictures print out looking like they just came from the photo lab.  Don't forget to get a SD card because the camera won't hold many shots.  I mostly shoot and print 4x6 shots and even when cropping shots there was no loss of picture quality.  I would highly recommend this camera to all beginner and intermediate users.", "Date": "November 4, 2004"}, {"Title": "Excellent!", "Author": "A. Mariano \"Tritro\"", "ReviewID": "RL8G99SW53KKL", "Overall": "5.0", "Content": "You can charge the camera's batteries disconecting the cable from the DOC. It's easy to use, and you can save some \"basic\" videos with sound. As a camera is excellent, the prints are excellent also when you print in large size.", "Date": "September 22, 2005"}, {"Title": "review kodak", "Author": "juan", "ReviewID": "R258MSAXYA5KDH", "Overall": "4.0", "Content": "the camera is great my only complain is that I would like to be a little smaller.", "Date": "August 30, 2005"}, {"Title": "Kodak Easy Share DX7590 camera", "Author": "Donald O. Hagelberg", "ReviewID": "R22XRFD8HBW69Z", "Overall": "2.0", "Content": "I bought this camera for my daughter for her to take pictures of the kids and send them to me. She recently moved 1,000 miles away.I wanted for her to have a reliable camera. The camera came with the wrong battery but she thought that it was the old battery and needed replacement. She wanted to take pictures right away so she searched around the city and found a charger but that battery still did not work.She finally purchased another battery on line for the camera and when it arrived it was a different battery. The camera was sold with the wrong battery.I emailed the seller and we came up with an adjusted price. He was going to make an adjustment in my Amazon account but I am not sure if it has happened yet.My daughter is very happy with the camera. I feel bad that she had to run around so much to mqke a gift work.", "Date": "August 17, 2009"}, {"Title": "Great Pictures, but can't get them off the camera", "Author": "PimpsRUs", "ReviewID": "R2NYWHVYA4SSHW", "Overall": "2.0", "Content": "I love the pictures this thing takes.  Some of them look like they were taken by professionals for national geographic.  But they were just pictures of my cat.But I have a HUGE problem with the PC interface.  You have to use Kodak's software to transfer to a PC.  With my olympus, I just hooked in the USB cable, went to My Computer, found the camera, then dragged and dropped the photos where I wanted them.  No large programs to load, no creating albums, no setting default options, etc.  Just drag and drop using the windows explorer interface.  The so called \"easy\"share software won't allow that.So I find myself using my old olympus, because after all, I'm just taking pictures of my cat.", "Date": "September 5, 2006"}, {"Title": "Questions rather than a review", "Author": "briccasart", "ReviewID": "R3DC9G7X1FK3QY", "Overall": "5.0", "Content": "I'd like to purchase the DX7590.  However, I'll be moving abroad (am writing from the US) to a country that uses 220 volts.  Since I've never owned any Kodak digital cameras, I'd like to know if the EasyShare Dock 6000 will work abroad.  If it's just a matter of plugging it in to a USB port for it to work instead of plugging it in to an electrical outlet, I think I'll be okay purchasing it.I would also like to purchase the Kodak Li-Ion Rapid Battery Charger Kit.  I'm assuming that since it comes with different country adapters, I will be able to recharge the battery wherever country I may be.  Is it supposed to automatically sense whether it's 110 or 220 volts?Thanks in advance for any replies.", "Date": "November 14, 2004"}, {"Title": "Poor Kodak Customer care", "Author": "Charlene Etienne", "ReviewID": "R1J9YTAVCXV4CY", "Overall": "1.0", "Content": "Kodak products are defective and Kodak consumer advocates that Kodak provides for consumers is a joke they are not for the buyer but are for the corporation to appear that they try to help the average consumer. I will not being buying Kodak I am finished. They are awful with customers.", "Date": "March 18, 2006"}], "ProductInfo": {"Price": "Unavailable", "Features": "5-megapixel sensor captures enough detail to create photo-quality 13-by-17-inch enlargements\n10x optical zoom Schneider-Kreuznach Variogon lens\n2.2-inch high-resolution LCD display screen; 0.4 second click-to-capture time; 16 programmed scene modes\nStore images in 32 MB of internal memory or on optional Secure Digital (SD) memory cards\nPowered by Kodak EasyShare Li-Ion rechargeable battery (included with charger)", "Name": "Kodak Easyshare DX7590 5 MP Digital Camera with 10xOptical Zoom", "ImgURL": "http://ecx.images-amazon.com/images/I/31JZBAWVX0L.jpg", "ProductID": "B000A22V6E"}}