{"Reviews": [{"Title": "Amazing zoom", "Author": "Samuel H. Parker", "ReviewID": "RZS2JNMN3K5QD", "Overall": "5.0", "Content": "This camera literally blew me away when I started using its zoom feature.  First of all let me start by saying I am a practicing amatuer astromoner, and quite familiar with quality..This camera posesses an APO lens..Apro chromatic for those who care.  I took a picture of a distant mtn in NM, of a feature called \"turtle back\".I was zoomed 12X and after examining the photo on my laptop, I discovered I had captured a pair of hawks in flight against the mountain.  In the second photo, one of the hawks was framed perfectly aginst the turtle's front foot, and I was able to blow it up on my laptop further where I could actually see feathers on the wingline, and the hawk's beak with little or no pixel distortion..The 6MP really works.  I would recommend this camera to any amatuer photographer", "Date": "October 17, 2005"}, {"Title": "Sorry Canon S2....", "Author": "Ms. Lacey \"ShopAHolic\"", "ReviewID": "RC10PPAKYFNGU", "Overall": "5.0", "Content": "Well, I searched and searched and read every review possible--so I thought--during the summer once I decided to put down my Kodak dx4530 and graduate to something with a little more \"umph\".  I made a decision on the Canon S2.  Due to some confusion my order was cancelled and I had to pick something else quickly.  I did--the Dimage Z6.  This camera does everything imaginable!  I am not going to rehash in detail the previous reviews.  If you have the money and want fantastic pictures--this is a GREAT investment!  The instruction manual is a little jumpy but with patience you will get it.  The features on the Z6 are never-ending.  Buy & Have fun!", "Date": "October 22, 2005"}, {"Title": "An incredible camera worth 3 times the money!", "Author": "Only review if I know", "ReviewID": "R23F4PGR9NXH4H", "Overall": "5.0", "Content": "I have a digital SLR camera in a different and higher class than this camera. We bought the Z5 for my son and I found myself drooling over some of the functions in his camera.  Don't let the term son fool you. Although 10,  I was brought up by a photographer who never cut the corners on photo for him nor the family despite not being well off.  My son has taken fabulous pictures on the Z% and the new six has very few if any changes. It did not need them.  The new Z6, is an absoloutely incredible machine with for me, only one major drawback, which is the manual need to lift your flash. As a semi or part time pro I have my flash attachment on all the time and even though this camera can change,  by a convenient push of a button,  thru several flash modes,  the manual pulling up of the flash would be hard for me but may be due to habit.  You would just have to always have it up and rember to turn off your flash if you ever want to. Fill flash is measured with the ambient light in the Z^ so the heavy shawdows are removed or the shade of darkness of he face by the brim of a baseball cap or the shade of tree branches in some of a person's face is gone. Right there your picur will be much more pro looking.  There is a hot shoe for a flash attachment if desired. The perfect next step up from the pocket cameras and even if boasting 7 or 8 megapixels the optical zoom of this camera and the speed of the compressor chip are far more important.  The zoom is to 420 (yes I said 420 and in old film talk) and an automatic feedback as to whether you just took a picture within the correct ecposure. Also a little camera icon shows when you are zoomed to far out on your subject or to little light, showing you you need a tripod or do not take. The macro and fine macro modes are fabulous allowing you to take that flower or anything from your puppies face close up. No lens filters make it so your  lens is suseptible to scratching but is well incased in the lens covering. The features of this camera including the use of the histogram, the editing features within the camera will probably never be used by some but who cares at this price.  Smaller cameras will never match this in terms of optical zoom and also the portrait, landscape, and sports functions all work while still in automatic focus. This means you can hold your finger on the button and take one shot after another of  your kids stealing first base and be in focus. I took my daughter jumping from a high dive on rapid spots fire and the water splashing back up is just gorgeous and in perfect focus as is she and her varring expressions as when climbing the ladder and coming down. The camera will stop if it does not detect enough motion and will chage back to a more normal state of autofocus which in most cases means you have to keep hitting the button versus holding your finger down on it.. Perfect for the multi use camera shooter. Can zoom in from a distance and can take moving so perfect for sports filming, portrait filming and landscape as well. Only those of very high calibder photography experience or ones activley photographing architecture or landscape may feel they need a wider angle lens and yet if this is a move up for you, this is not and will not be a problem. Most people feel a 28 lens to be wide angle to begin with and it may start at 17 I am not sure. I just dont shoot wide angle.  Don't let Dimage fool you, even I a Cannon loyalist would never buy the Cannon in this league over this camera.  The camera uses print image matching so works great with almost every photo  printer which for those newer to digital means the information on the s-disk talks to the printer when you are printing so your shots are clearer, moe detailed and the colors more accurate to what was taken or seen on the screen. Don't let the featrues scare you. They are there but a very great point and shoot camera as to the quality and the abilty for the camera and a photo printer to do it  for you.  If buying the camera consider the best charger and best recharageable batteries as more expensive but better on batterey life and yet if you aare one to swear away anything but lithiom batteries this camera does extremely well when my husband's dimage of 3 years ago is an energy hog. If picking up in a store, remember you can take pictures through the large two inch LCD screen or the veiv finder. The veiw finder has vision adjustment so if it  does not look good at first please adjust this. The Z6 gives one more megapixel than the z5, basically incresing you cropping ability as you probably wont be printing 24 by 24 posters.  The processor somewhat faster then the z5 as well making what you snap your finger at what you take as no delay of notice.  The z6 is about 1/5 more efficient battery wise which in some cases can save you.  Not much better than the z5 as the z5 was and is a wonderful camera and was acually $100 more.  It did not need changing.  The z6 has a Sleek new disign with the same size but looks gorgeous.  Try not to use as a garbage can as it will use more energy and yes, there is a reson that some disks are cheaper than others. Do not go cheap on you disks. Nice battery feature in which the camera shows no batterey when plenty of juice, then a battery when about at the half way mark and one more with a little juice left. Draws your attention to it as it appears vs. changes.  Stop at the last symbol of closly after that. A digital will never work it's best when low on power nor getting completley full on a card. At the highest shooting level at which all people should be on or buy a two megapixel to begin with a 516 chip has room for around 320 pictures.  No case is made specifically for the camera and yet we found a great promaster for $35 that is cushioned and can be worn as a fanny pack or over the shoulder. MY moms smaller credit card canon fits in the front part of the case as altough this a \"small camera to me\" she feels otherwise and wants to take both on her upcoming cruise so she can slip the other in her evening bag.  I myself would love this camera for a second one of lighter weight and yet under many situations could get the same as my SLR of much higher price,features and therefore quality. Although it hurts me to say it, computer leary people could add to this with the epson picture mate 4 x 6 printer with the lCD could never use  a computer and still get bettter than costco processed disks. The HP and ohers would also work and yet he new epson at $250 but $200 onlin with a rebate has many more ediining functions.  IF a previous camera uses a compact flash and you have to change over adding to the expense so be  it. They are better, the way of the future and will last mush longer.  I can not say enough about this camera and I would  never thought I would  be suggesting anythig over a canon. Anoher nice feature which sounds like a gimic but is not is the anti-shake mechanism. It actually does help to lower the effects of a less than steady hand and so your pictues wiil be more likely to have the just right focus. If planning for an event please buy early and practice however whether you have experience or not. Due to the incredible zoom power you do need to have practice keeping your eye on things as the camera will not beep if a not a  good shot and yet this camera wll tell you why so easy corrections can be made. The beep the camera makes when the camera locks into focus when pressing half way down is quiet and a good guide. It can easlily be shut off say at weedings, plays etc.  Beep, solid white circle, press down, look at LCD for proper exposue OK and a glance at the picture and within a couple of seconds on to the next.  The camera has a playback mode to check pictures with magnigication to check for focus at the molecular level practically but a waste of time as you may be missing the next shot.  Rapid fire is available and 3 consecutive quick shots so getting 3 but each slightly different. As with all cameras and with all kids, dont use the red eye reduction. This means the flash puts out usually 3 small flashes and then takes the pictue wih a bigger flash. You wiil have the kids in the next room and far to long for candid and making people look at you insread of getting that perfect side portrait veiw.  Although a fine camera and a tendency of many of us to tend towards protection plans due to chips and complexity keep in mind the cost. The best of warranty plans and some worse than this do not cover theft and althogh they will tell you for even dropping the camera you must have a significant part of the broken up camera and must have the serial number intact.  If you drop over the edge of the ocean, off the side of a cruise ship or inside indiana jones at disneyland are you actually going to go back and get the camera or jump off the cruise ship?  Using the stap is a much better insurance policy! You will be more upset about the pices than the camera  so consider that when puchasing your s-disks. Better to have all shots on one card in the camera but if you lose the camera all gone or better for a few smaller so that all is not hopefully lost.? Depends on the person.  JUST GET GOOD ONES.  Also take a ton of pictures. This is what digital is about and at the hightest setting. Do not try to get more pictures by setting the camera at a lower resoluton. If you feel conscious of not having enough memory consider buying some thing like an IPOD with the capability of carrying pictures for you whille on a trip.  This way you just have a great time with your camera and then can clean out on computer as should be when you get home. If intimidated get a hired person for $89,00 an hour in California to come, set up your system between your camera or card reader, your computer then to your photo printer. IF you use a printer for regular documents then this is your normal printing and can easily tell the printer to gear up the color and ink for a photo.  Writ it down and do it.  Phot editing Programs can be hard but those in the high hundreds to the 2000 dollar range. For fifty dollars you can be storing, cropping, edtiting and burning to disk fun slide shows and burn them to dvd to watch and store forever.  Remember the kid running bases, set the digitlal photos to a one second show and it will look almost like a movie in your slide show.  Playback on the camera is also in the version of slide show if you wish, so if traveling with friends or at grandmas house and the disk has been cleaned up they can see the ones you took that morning and haven't  had the time to even go home and download to computer. Buy  a good high speed charger, THE BEST BATTERIEs AND TWO SETS and good memory cards, a cushioned case and go for it. IF not there, the ability and faith of digital will grow. Then the passion comes and you would never dream of having anyone but you print your pictures.  Much more fun to have a file and slide show of each Chistmas for a few years, a little of each, with music and typed christmas lists and now if you want can record the annual reading of twas the night before Christmas and  have that play on DVD while your pictures show. Hard. NO.  Need to learn. YES.  For those hesitating come on over to the other side and join the speed and abitlity of the reality and reason for digital, Never again will you pick up the doubles you ordered with only one good shot for $25.00 and for the others with a slower processor, less meagapixel or less optical zoom digital camera you will always be frustrated with the quality of your pictures as your dont have the resolution to crop and get rid of uncle Harry and his eyes shut. This is truly the best camera in it;s class  on the market and I have tried the Canon.  I have reserched this to the extreme, macworld agrees with me as does several of the digital photo  mags that  rate cameras.  Buy and enjoy. Use it as a point and shoot if you want and learn a new feature one at a time. Also , forgot a wondrful feature increasing where you can take pictures. It has the ability to change the exposure of light while still remaining in autofocus so can get great shots in say museums, the monterey aqauriam and other places not allowing or appropriate for flash, IF you are debating this camera over a $300 one becasue of size or money you don't know digital cameras!!!!  Sorrry for any poor spelling. Ill and numb hands makes tuping hard. IF you are questioning the 400 camera, the 35 dollar case, the 100 on two good 256 s-disks and the 50 for the battery charger nd the 15 for the extra batteries you are fogetting all the pictures you have in envelopes blurred and no good as you did not throw our or go look at them. IF you ex whatever wasnt in the picture because you could now crop them out would you like it better? Do you have fair haired kids with bright red dots staring back at you looking like aliens. Do you have a garbage can on the side of perfect shot of the family all together for once and dressed up. Is it slightly out of focus. All of those would be good if digital and all that money spent for all those prints that need thrwoing away would be gone and would you enjoy some occasionally if you had a slide show of that child now older and driving you crazy, would you like to havw on the tv via DVD pictures showing for a while you can walk by and remember whar once was also deinving you crazy and thru time brings out you oooh and ahhhs while they play to your or their favorie child hood memories.  Or how about the trip to Hawaii you are still doing laundry from and yet seems so far away flash by you on your computer at work. Within minutes you can have 50 pictues with the same or different titles or comments on the web with notices to all the family that the baby is here. Young or old, digital is so enjoyable and you can even buy programs to make your bes freinds faces all distorted to play at a party or at a 3oth the person growing up and the growing old to 80, This camera will get you to what ever you want as so easy and so good. You will want to show off your pictures. Have fun.  Start saving money and get those pictures out and going.", "Date": "September 8, 2005"}, {"Title": "Excellent", "Author": "bap2 \"BAP\"", "ReviewID": "R313LE1KVJ56LD", "Overall": "5.0", "Content": "12x Optical Zoom, 6MP, Movie mode, Auto Focus, Rapid Fire Shooting..................what more could you want for this price.  I was looking to replace my 2.1 feature loaded digital with more megapixels and more optical zoom capacity for less than $250.  Wasn't going to happen unless I settled for 4, maybe 5X optical zoom.  I quickly figured out that for another $100 I could have much, much more than what I wanted and would not be looking to replace the Z6 in less than 2 1/2 years as is the case with the 2.1 mp I was using.  No brainer in my book.My soon to be 13 year old son has taken to it like a duck to water and has figured out nearly all of the main features.  He delights in making movies which usually have to deleted the next day but this camera will teach him the craft and serve my purposes very well.  Love the slightly larger size of this unit versus the rectangular box digitals that are myriad.  It allows me to wrap my hands around it oh so securely and easily with the rubberized protrusion on the right side and I do not have to check every 3 seconds to make sure I am not obstructing lenses or pushing buttons that I ought not to be pushing.Oh yes, the picture quality is tremendous and there is not a conceivable lighting situation that this camera can not handle.If you learn the features this camera offers you will use it happily for a long time.I upgraded to the 512mb Sandisk Ultra II flash card and it is very fast.  Another reviewer on another site said that it increased processing speeds noticeably.  Rebates are available until mid-November '05", "Date": "November 16, 2005"}, {"Title": "Having a great time", "Author": "Linda Watkins", "ReviewID": "R3E9IETCOQ21AM", "Overall": "4.0", "Content": "I had shopped and researched for several months before buying this digital camera.  Part of what played in my decision was the fact that I owned a Konica SLR for many years until it was stolen and was so happy with it.  I also owned a Minolta with the same experience minus the theft.  I compared this camera with some of what Nikon had to offer and felt that I made a good decision based on quality and price.  I was so excited when my camera arrived and I pulled it out of the box.  It is such a nice looking camera and I love the fact that it is more substantial with the bigger display operating more like a slr I am used to than a tiny little digital that you have to watch your fingers to keep them out of the shots.  I have taken quite a few pictures in the last week since receiving this camera.  Still shots and close ups of my adorable grandson are awesome right down to the dried milk on his chin.  I am still working on the action shots but those seem to be my lack of skill and not the camera.  I did take a short movie clip of my sons basketball game that came out really well.  All in all I am very pleased with this purchase and now that I have bought a bigger sd card, come on guys a card that will only hold 4 pictures taken on a fine setting or 16 at standard lets get a little cheap here though I did appreciate the included batteries.  That aside now that I am set with a reachargable set of batteries and the bigger card 512 mb takes 300 or so pictures on the fine setting. I am ready to go and having a great time taking pictures.  I had one interesting thing happen which I don't think is the camera as the picture shows perfectly on the lcd screen but when I uploaded it to my computer and I click on the picture it is fragmented this has happened on 2 pictures and I am not sure if that is a memory card malfunction, the software that came with the camera, or my computer? Once I track that down I will feel better.  Anyway I look forward to some long and happy fun taking pictures with this camera and also have already enjoyed the editing software and printing my own pictures.  I intend on spending some time also learning the more advanced aspects of this camera and will come back and rewrite my review after I get a little more digital savvy.", "Date": "October 5, 2005"}, {"Title": "2 Problems Solved", "Author": "Brendan P. Ryan \"BR\"", "ReviewID": "R3IP6AIHRGS2JG", "Overall": "5.0", "Content": "Great camera if you have active little kids that can't sit still (anti shake feature).  Also a good choice for someone with larger hands that dislikes the tiny pocket cameras.  I have next to no photography skills and this camera helps me take better shots.", "Date": "November 2, 2005"}, {"Title": "I Love This Camera", "Author": "Laura Young", "ReviewID": "R3SXBGQ5U5Q1CK", "Overall": "5.0", "Content": "Bought this camera a couple of weeks ago,,,,It is so simple to use, takes great pictures, I still am learning to use the close up features with action, like my lab jumping in the water, but practice makes perfect. Still shots are just awesome!!! Movies are clear and the sound is clear as a bell. It is very well balanced to hold and the instructions are very easy to understand and follow. The only thing that is not so easy is to remember to flip the flash up, but that will come with use of the camera.Over all, I am very glad I made this purchase!!!", "Date": "October 10, 2005"}, {"Title": "Product Failure: Lens Block", "Author": "Patrick Mcguigan \"aspiring photographer\"", "ReviewID": "R3D6QQXZ9E7KKF", "Overall": "1.0", "Content": "I purchased this camera in January intending to use it for an April trip to Hawaii. I've returned the camera twice for warranty repairs for the same problem.  In fact, after three months the camera's has spent more time under repair than with me.The problem appears to be a lens block which won't open rendering the camera useless for taking pictures.  In the latest fix, I received the camera on Friday after the second repair and error appeared the next day as I was trying to take picures at a daughers event.I'm disappoined in both the quality of the camera and the quality of the warranty repair service.", "Date": "March 12, 2006"}, {"Title": "A great digital camera for the money", "Author": "George Provencher", "ReviewID": "R347FSQOLOQHL0", "Overall": "5.0", "Content": "I received this camera for Christmas and have already taken close to 300 photos on the supplied batteries.  By the way, Amazon had the lowest price of all the on-line places I looked and they even shipped it free!  Thus far, I'm very impressed with the color accuracy in this camera.  The feature I needed most was fast shutter speed (fidgety grandkids) and it delivers nicely.  However, the feature that surprised me most was the anti-shake which is excellent when in the telephoto mode.  I was able to take photos of cars in front of us while traveling as a passenger at 75 mph on the interstate in full telephoto mode and could read license plates very clearly in the photos!  I highly recommend buying the lens adapter ring which is very inexpensive and which allows you to add filters, telephoto and wide angle lenses to this camera to make it even more versatile.  I find the controls to be intuitive and user friendly and in the auto mode, my wife can take great pictures.", "Date": "January 2, 2006"}, {"Title": "Satisfied", "Author": "R. Campora \"taxman\"", "ReviewID": "R2G1LKYNN2OXNH", "Overall": "5.0", "Content": "Gave myself a Christmas gift and so far I'm very satisfied. Picture quality is good. Bought the Minolta 2500D flash to mount on the hot shoe. That works great. Just about eliminated red eye. Also bought the wide angle adapter. For memory I bought a Kingston technologies 1gb card that works at 133 whateveers. Also picked up rechargeable 2500nimh batterys. . Before buying I looked at Kodak and the sONY dch1. Didn't like Kodak propietary battery. Kodak and Sony do not zoom while in movie mode. This is my third digital. My first was the Nikon 880 which is still my favorite for picture quality. Last I bought the Dimage x50 and used that on a recent trip to Italy. Results were great and that's why I went to Minolta again.  The pixel number wasn't important. It's the zoom that sold me. Next year I'll go to the Minolta DSLR 5d.", "Date": "January 10, 2006"}, {"Title": "COMPANY IS DONE W/CAMERAS!!!!!!", "Author": "flea \"flea\"", "ReviewID": "R6Y3UEUB8VLX5", "Overall": "5.0", "Content": "FYI!!!! look at the konica minolta's main web page/USA...it states that the company has ceased making cameras (recently). sony has taken over any \"help\" needed w/ them... but no more accessories etc...great camera!!! pics are fantastic...", "Date": "July 8, 2006"}, {"Title": "Great Camera for a Non-SLR", "Author": "William A. Smith", "ReviewID": "R1NQCMIMZOGGZF", "Overall": "5.0", "Content": "I've been wanting to get into the SLR market.  But I wasn't ready to pay those prices.  Then, I discovered the Z6.  This is a fantastic camera that I have had no problems with in the 2 months that I've owned it.I've learned that Konica-Minolta has been bought out by Sony.  So,I called Konica and was told that Sony will be honoring all warranty and repairs.  I called Sony to verify and they told me th same thing.So, the smart thing to do is take advantage of the price drop and get one of the few 12x optical zoom cameras on the market a d good price.", "Date": "May 15, 2006"}, {"Title": "Adorama came through well!", "Author": "N. de Villiers", "ReviewID": "R3CSNB1X85RTO4", "Overall": "5.0", "Content": "I purchased this through Amazon from Adorama. They shipped as promised, and the process worked like a charm! The product is great, as well. We already owned an earlier version the Z2. This item has many improved features, and my wife love's it! It has the anti shake, 12x zoom rather than 10, a much bigger view screen. The shutter responds faster. I has 6 mega pixels rather than 5. It is a great buy for a quality product from a well known company.", "Date": "March 26, 2006"}, {"Title": "Great camera for newcomers to digital photography", "Author": "Ex-CSI", "ReviewID": "RPJXTYW78YO08", "Overall": "5.0", "Content": "I have been a Minolta owner since 1975 and have always been pleased with their product. I can honestly say that Minolta has never let me down. After purchasing the Z6 on-line and taking photographs under different conditions I have to say that I am quite pleased with this camera. If you're starting out and don't want a \" point and shoot \" this is the one to go for.I spent a lot of time checking what others thought of the Z6 on numerous websites. After seeing so many positive reviews and very very few negative I decided this was the camera for me.You can't go wrong with this little guy.", "Date": "February 26, 2006"}, {"Title": "Very pleased with this excellent value", "Author": "hokie_cpa", "ReviewID": "R2YAL4P4UU5LDA", "Overall": "4.0", "Content": "I bought this camera because it had the best zoom in the 6 megapixel range for the price.  The zoom is phenomenal, although it may take a while to get a hang of focusing close objects without using the macro mode.  If you are a basic point-and-shooter like I am, then you will also be very pleased with all of the shooting modes.  The only drawback that I have experienced is the cycle time, but it hasn't caused me to miss too many shots.  This is an excellent camera for an excellent price.", "Date": "January 1, 2006"}, {"Title": "The Konika Minolta Z6 took the best pictures.", "Author": "K. George \"2 cents worth\"", "ReviewID": "RQ9WKV9GIFDAT", "Overall": "5.0", "Content": "To make a long story short, we recently took a family vacation.  7 of us had digital cameras and we took a ton of pictures. When we came back from vacation and compared everyone's pictures, the pictures from the Konika Minolta Dimage Z6 were noticeably clearer and brighter...and the zoom capabilities of the camera were just AMAZING!!!I'm planning to buy this camera as soon as my tax refund comes!", "Date": "March 21, 2006"}, {"Title": "Don't waste your time with this camera.", "Author": "Brian Pacheco", "ReviewID": "RJAQWE32ZTHSA", "Overall": "1.0", "Content": "I usually do plenty of research before I make any purchase, but in this case my old Sony broke and I needed a camera quick. I looked online for about 30 minutes and decided on the Z6. I brought it home that afternoon and took some pictures and they looked great. I then took it to the New Years Eve party and started taking pictures and they all came out terrible.The camera shoots nice pictures with PLENTY of light. If the shot is dimly lit, forget about dark, the camera can not focus correctly. It does not have an AF Illuminator and hence does not take good pictures in low light situations.I then did do research over the next few days and liked the Sony Cybershot DSCH1 and Canon S2 IS. I bought both of them and they are both great cameras. I did decide to keep the Canon for the great features, and pictures. It is also the only camera I have come across that the Digital Zoom actually looks good. Save yourself some time and spend the little bit of extra money on the Sony or the Canon. Either way you will be happier than with the Z6.", "Date": "January 8, 2006"}, {"Title": "Fantastic Camera", "Author": "J. Houston", "ReviewID": "RNL4CVDMVPFFY", "Overall": "5.0", "Content": "I'd put off buying a digital camera for some time and I wanted something more than just a basic point and shoot. I bought this at Costco and paid more--this is a great price for a fantasic camera. Lots of preprogammed settings, good for point and shoot, and plenty of manual controls for the photo enthusiast. I take this camera everywhere and I always get great, high quality photos. I also photo document for the fire department that I a member of and I get great great day and night, indoor and outdoor shots. I recommend this camera to anyone, even a first time digital camera buyer.", "Date": "March 7, 2006"}, {"Title": "Why i was sold.", "Author": "Henry Reacroft \"The Mountaineer\"", "ReviewID": "R3CB85T27CISMG", "Overall": "5.0", "Content": "Some may ask why I would purchase this camera over others. The main reason is the phenomenal zoom. I get clear, sharp photos from distances most regular SLR zooms cannot. That is reason enough make this purchase. Nothing is worth more than quality.", "Date": "December 16, 2005"}, {"Title": "Good camera for the money", "Author": "P. Sjoman", "ReviewID": "R1KKMRN0T5M49A", "Overall": "4.0", "Content": "I bought this camera because the simpler digital camera I had was too limited. Overall I consider it to be an excellent camera for the money. I also purchased the Minolta wide angle attachment. The zoom range is equal or better to most competitors but they are all limited to 28 mm at the wide angle end, so the wide angle attachment is needed in some cases. The user interface is very good and most functions are easy to set. The camera works very well in daylight and focuses with no problem. The manual focus works but it is a little hard to focus because of limited resolution in the view finder even though the picture is automatically enlarged while focussing.It is an advantage that it uses AA cells so you can have a spare set with you. Battery life is fine.I usually use the viewfinder instead of the LCD display but both  work fine.The only negative aspects are, focussing in a dark area and the  flash brightness. You might have to use manual focussing when it is very dark since the camera does not have a focussing light. The flash could be stronger but at least you have the ability to use an external Minolta flash.Another concern is that Minolta recently announced that they will stop making all cameras and transfer all to Sony.", "Date": "February 23, 2006"}, {"Title": "Nice Camera", "Author": "G. Alex Rands \"Father of 5\"", "ReviewID": "R2FSN61DBYWO8Y", "Overall": "3.0", "Content": "A perfect replacement for any one camera this is not.It is more cumbersome than a point and shoot.Its pictures are far less detailed and sharp than a SLR.White ballence and collor saturation are ho hum.good long Zoom and anti shake features make for nice additions to a just ok camera.I bought mine on a great sale at the end of production.I have enjoyed it but there are others which outshine it in almost every area.(albeit they are 4x the price I paid)", "Date": "April 23, 2007"}, {"Title": "Best of 16", "Author": "Anthony D. Perry \"antman\"", "ReviewID": "R3V0HRDDS7NXEA", "Overall": "5.0", "Content": "I just got back from an African safari trip and of the 16 of us, the woman with this camera took by far the best pictures. I was amazed at how well they turned out, so I'm buying one for my trip to Hawaii!", "Date": "March 21, 2006"}, {"Title": "Okay camera", "Author": "James R. Decava", "ReviewID": "RN7S2Q2R42DMP", "Overall": "4.0", "Content": "[...]For starters, I'm in my mid-late teens and have been taking pictures since I was very young.I bought this camera about 6 months ago, looking for a D-SLR, a step up from my point and shoot (a Kodak cx7330, awesome camera, I highly recommend it).To put it quite plainly, it's a good camera for someone that doesn't know too much about how to manually operate a camera, but would like to learn and have something to practice with.Cons:When you first turn it on, it takes a few seconds to actually start up, even with the batteries fully charged. This may not seem like a lot, but when something is happening all of a sudden that you want to capture, it can seem like forever...The flash it pretty bright, so for indoor snapshots of people and such, use a point and shoot.In darker situations (like capturing lightning, for example), it takes FOREVER to focus, and half the time it won't even focus.Manual focos is pretty darn slow.The longest shutter speed is only 4 seconds.Batteries last for an okay amount of time, but it takes about 14 hours to fully charge them, so I have to charge the batteries overnight, every night.Pros:The Super Macro is amazing. Especially when you have the patience to manually focus on something, pictures can turn out great.There's a lot of ways to customize the settings, but you can always put it back to default.Progressive shooting is a great way to capture waves breaking at the beach and hitting rocks.Amazing wide angle zoom lens, especially with a tripod. (But the aperature for some reason gets smaller, instead of wider to let in more light while zooming, even while on manual...)I love using this camera on manual, I never use any of the other settings because full creative control of how the picture will come out is a must for me.The anti-shake makes this an fantastic camera to record, and with a good memory card, you can record for over a hour and take over a thousand pictures.CONCLUSION:Buy this camera if you're looking for something to get started with as far as DSLR's go, but if you've got a true interest in photography, then be prepared to get bored with it after about a half year and crave a 100% fully manual D-SLR.In the end, the photographer takes good pictures, not the camera, so don't rely on your equipment ;][...]", "Date": "October 24, 2006"}, {"Title": "Customer Service . . . Horrible!", "Author": "Gary A. Coffman", "ReviewID": "R2IQONLTMESDAS", "Overall": "1.0", "Content": "I just bought this camera from Amazon two days ago and got the camera today.  I have played around with this camera before and have been impressed by its performance.Excited to start taking pictures of my kids and learning how this camera really works before Christmas, I unpacked and started to get it ready.  Sadly things went down hill quickly . . .The camera kept giving me a warning that it could not use the SD card that was supplied by Minolta with the camera.  I was unable to pull up the menu to format the SD card . . . I basically could not do anything.I read through the entire manual and trouble shooting hints and after working with it for some time called the help line.  When I finally got through, the woman I was talking through hardly wanted to listen and was just rude.  She basically gave me no help other than to say that either the SD card was bad or the camera was . . . which was pretty darn obvious to me anyway.She said that Minolta did not warrant the SD card, which is supplied with the camera.  She told me the turn around time for them to fix the camera was about 4 to 6 weeks; much too long when I was hoping to take some Christmas pics with it.  In other words she was of no real help.I have seen these cameras take great photos, but the service department of Minolta is useless and rude.  I just gave up and sent the defective camera back to amazon . . .", "Date": "December 13, 2005"}, {"Title": "Nice camera", "Author": "P. Farley", "ReviewID": "R1BZ2PIBEU05EM", "Overall": "3.0", "Content": "We purchased this camera a year ago to create memories from our family vacation. We played around with it prior to vacation and got familiar with it and the pictures were nice. However, ALL my indoor vacation pictures came out bad and I missed many, many shots trying to figure out how to get the dumb thing to work right. It took wonderful outdoor pictures, but I couldn't for the life of me get the indoor pictures to show up right. The flash was overpowering, but without flash, it was blurry. This year, we purchased a smaller camera that came with a built-in guide. I love my new camera. My Minolta is not going unused, however, because the guide on our new camera is teaching me how to adjust the settings on the minolta correctly so I get better shots. The bulk of the Minolta, however, prevents me from taking it everywhere I go. I use it basically for planned events. The smaller camera is the one that gets thrown in my purse and taken everywhere.I recommend backup rechargeable batteries for this camera. This thing eats batteries like nobody's business! I am constantly having to replace, replace, replace, and I really don't take very many shots!I wouldn't recommend this camera to someone who doesn't already understand the various adjustments. Forget the user's manual. Half of the information went right over my head. I'm more of a \"see and learn\" type than a \"read and learn\" type. My son took digital imaging and can fuss with the camera a little bit, but still thinks it is complicated for a new user. The pictures, when they're taken correctly, come out awesome. I have one picture that won several photo contests (I got lucky!). It's a monkey behind bars. We also managed to get an awesome shot of an eagle. So this is not a worthless camera at all. It's just really difficult to figure out if you're not already a camera expert, but then again, if you were a camera expert, this may be too elementary for you.", "Date": "June 8, 2007"}, {"Title": "Bad Camera", "Author": "Stephanie", "ReviewID": "R23WXOR4TA2P41", "Overall": "1.0", "Content": "I bought this camera in December of 2005 after reviewing digital cameras for about 3 months.  The reviews on this camera were great.  I got the camera on sale for about $350 with a free epson photo printer, so I thought I was getting a good deal.  I bought the camera from Ritz Camera on line.  It arrived quickly.  I put it together and it didn't work.  The camera would shut off right after I turned it on.  I called customer service and was told it would take almost 6 weeks for me to get a new camera and to see if a Ritz Camera store would exchange it.  So, that's what I did.The camera worked ok for about 2 weeks.  I say okay, in that a lot of the pictures were blurry, and in low light the camera would'nt work at all.  After a month, the zoom wasn't working and then the second camera did the same thing as the first camera and would just turn off.  I checked the batteries and it wasn't the batteries.  I called Ritz on line, they wouldn't exchange it, said I had to use the warrenty and get it fixed.  So, I took it to Ritz.  It took 10 weeks, there were many defects in the camera.  I finally received a working camera in May, almost 5 months after I had ordered the thing.Again,  the camera worked but not great.  When a picture does turn out, it's great, but most of the time they are blurry.  Now, 8 months after getting the camera back, the zoom doesn't work again and the review function doesn't work at all. Of course, repairs aren't covered anymore, because it shows I bought the camera in 12/05, even though I never had a working camera until 5/06.Save your money, get a Cannon.  This thing is not worth it.  Also, Ritz customer service was horrible, so buy somewhere else as well.", "Date": "March 28, 2007"}, {"Title": "Great camera in certain conditions. . .", "Author": "Ram", "ReviewID": "RG0NXP28YEOKR", "Overall": "3.0", "Content": "I've owned mine for 13 mos and have taken about 800 pictures.  My opinion is:If you have good lighting, outdoor shots in the daytime, etc, this camera is awsome!  I love just about everything it offers.  Its fast it focuses far.  Its great. BUTIf you have low light shots, FORGET taking pics.  This camera CANNOT and WILL NOT take low-light shots.  You're lucky if it even locks focus in marginal light.  Its irritating and poor work by Minolta engineers.", "Date": "February 27, 2007"}, {"Title": "Konica Minolta Dimage Z6 Digital Camera", "Author": "mlee", "ReviewID": "R2UDJOTNB3TFB6", "Overall": "3.0", "Content": "I've always been a Minolta fan and I anticipate liking this camera also.  However, after taking 18 pictures, the anti-shake element went out on it.  Since it was under warranty, I sent it into Minolta and have received it back in \"new\" condition.  The repair process went smoothly once I finally was able to reach them by email.  I did not consider their website very user friendly.  Hopefully, the rest of my experience with this camera will be positive.", "Date": "February 23, 2006"}, {"Title": "It's Dead", "Author": "yard wench", "ReviewID": "R24ACEJJK2C0FC", "Overall": "1.0", "Content": "Thouroughly enjoyed this camera and was comfortable using all the features.  The zoom was phenomenal.  I had no real complaints about the camera until on a trip in Europe the camera just stopped working.I did some reading first online to see if others had encountered the same malfunction, but found a multitude of other issues people were trying to solve. Some of these included error messages, blank LCD screens, etc.  My particular problem is that the lens fails to extend, the shutter will not open, the only thing the camera will allow you to do is review previous images saved/stored on the SD memory card.  It cannot take any additional photos, and yes new, fresh batteries were installed twice!I think it's bizzare this camera just died within such a short time despite other cameras of lesser quality and durability continue to  operate.If anyone has some solution to the problem.  Please don't hesitate to contact me through Amazon.Thanks", "Date": "February 13, 2008"}, {"Title": "Leaves fuji in the dust. This is the best camera!", "Author": null, "ReviewID": "R23BIYFW0UL2G", "Overall": "5.0", "Content": "This is an amazing product. I got it for $200 and have had it well over a year and it still works GREAT! i dont have any dints or scratches. And all the other people who said that the batteries die quickly were right and wrong. they right that they will die very quickly if you use video. but otherwise the batteries last about a week for us. and you dont think thats long but we take about 200 to 300 pics a week.(its what happens when you have 6 kids.) The pictures are clear 98% of the time. only if something is moving really fast it will get a little blury. there are several mades such as frame mode, sport mode, night mode, and lots of others. The flash is manual but i actually like it alot better that way. because then you dont have to wory about it not coming back up if something breaks. ive only had to send it in once and that was because it got dropped and wasnt in its case. and it did not cost alot of money. (i dont remember how it it did cost.) DONT RETURN THIS TO THE MANUFATURER! return it to the store and ask them to send it there. also the higher card you buy the faster it will take pictures. example: a 1GB card will take faster pics than a 16MG. the pics are so clear. and the anti-shake is great. i love this camera.This is the best camera weve(I) ever had! i only bought it for [...] at circuit city. fuji cameras stink! that was what we had before and it was soooooo slooooooow it wasnt even funny.I recomend this product to anyone.Tips: always have spair batteries wherever you go. also rechargible batteries will save you alot of money. the camera uses 4 AA bateries. so have 8 rechargible batteries. 4 in the camera and 4 fresh ones.", "Date": "March 27, 2007"}, {"Title": "Great camera", "Author": "A. R. Unruh", "ReviewID": "R2TMORJZD8CXIP", "Overall": "5.0", "Content": "I'm really impressed with this camera.  The pictures that I've taken have turned out to be better than I thought.  So much so that I'll be getting prints made for framing and hanging up in the house.  The zoom is very good (I never use the digital zoom, only the optical), and combining that with the anti-shake makes for some high quality pics.  Very rarely do any of my pictures turn out blurry.  The macro and super macro modes allow for really detailed pictures.The camera fits in my hand nicely and feels very sturdy and secure.  The button layout is easy to reach and everything can be done/changed with one hand.I have a 2 GB memory card with this camera that allows me to take about 650 pictures at the highest resloution, or an hour and a half of video.I do have a couple of complaints about this camera however.  I don't think the flash is bright enough.  And I'd like the shutter speed to be faster.  Really those are the only complaints I can think of.I highly recommend this camera to anyone looking to step up from a smaller pocket sized digital, and not looking to spend the money on a digital SLR, but still want to have the SLR picture quality and feel.", "Date": "August 8, 2006"}, {"Title": "Dissapointed", "Author": "Shirley Mcnary", "ReviewID": "R3E7N3B1Y326OK", "Overall": "2.0", "Content": "I am very unsatisfied with this camera. I had a Z2 and loved it.  I wish I had stayed with it.  I have more trouble getting  clear pictures with this camera even though it is supposed to have an anti shake feature. After I started using it I had to send it in to get it adjusted which seemed to take forever and should not have been necessary.  I will never buy another Konica Minolta camera. I read a lot of great reviews before I bought this one.  I am glad those people liked their cameras, but I am looking at other cameras even though I have had this one only about 6 months.", "Date": "July 3, 2006"}, {"Title": "Konica Minolta dmage", "Author": "Ricardo Yudice", "ReviewID": "R3K6WUPR5Q86G7", "Overall": "4.0", "Content": "I am really enjoying my new digital camera. I have no complains about it, the quality is superb, it takes great pictures, comparing with other choices, and considering the price, I think that this is a great deal.", "Date": "February 24, 2006"}, {"Title": "Ridiculous price for outdated camera", "Author": "K. Hughes", "ReviewID": "R3F5OZBTCKTQJF", "Overall": "3.0", "Content": "I bought this model 3 or 4 years ago for a little over $200.  I recently lost it and was going to buy another since it was a great camera for the price then. However, for these times the Z6 technology is dated and you can get a better camera with the same features, plus more, (e.g., the Nikon CoolPix P100, a 10 MP camera with a 26X optical zoom) for at least $100 less than Amazon is asking for this model.  Asking $400 for this outdated camera is ridiculous!  A reasonable price for this camera would be more in the $100 - $150 range.", "Date": "June 12, 2010"}, {"Title": "A MUST read Review!  The REAL truth about the z6", "Author": "Randy", "ReviewID": "R2PIRZ89Y1FPCP", "Overall": "4.0", "Content": "I was hesitant to purchase this camera after reading some of the BAD reviews. I went with my instinct and purchased anyways. I've had a professional Pentax (film) for 20 years and had been buying point and shoot. I'm not a big point and shoot camera kinda fan, so wanted to get back into taking REAL pictures.  As with ANY digital camera, you have got to know your camera.  This isn't the old \"film\" world we are talking about here people. Digital needs to process. This camera takes GREAT pictures, i added a couple to this site myself that i took with this camera.  I think the bad reviews come from people who have no idea about the inner workings that make a camera really do what YOU want it to do. Those folks should just stick with point and shoot. This is a middle of the road camera and by that i mean, i'd place it between a point and shoot and a professional.  With any digital camera, the second you zoom, you need a tripod or monopod.  I don't care how stable you may think you are.  So therefore, the antishake on any camera is really pointless, which this camera has. About the only downside i have come accross with this camera, the autofocus.  It take a little work to get used to, but then i am a more hands on manual focus in control of what i want in the picture kinda person. Oh, the 2 pictures are, the one with the leaves on the bare tree thru front door and the cup of hot brkfst tea.  Check'um out!", "Date": "January 25, 2008"}, {"Title": "Not worth the money", "Author": "sawbones25", "ReviewID": "R1NP04KTM0Z8CI", "Overall": "2.0", "Content": "*I took 116 pictures today at a good friends wedding and reception. Less than 20 came out nice. If you want reliable quality pictures, this isn't the camera you should buy.*I bought this camera December 2005 as a gift for my wife. She wanted it because it has a nice sized screen on the back for taking and viewing the pictures. After using it a couple times however, she decided to keep using the old Kodak digital camera (that still works perfectly after 6 years). This camera is fine if you are taking a picture of a rock on a clear day with the sun behind you. Otherwise, the pictures become a blur. Even with the shutter speed at it's maximum, capturing a photo of a person at even a slow walk is impossible. 12x digital zoom is worthless unless conditions are absolutely perfect, and they are never perfect. And this thing eats batteries like crazy. And pictures always seem to have a yellow tint.Only reason I gave it two stars is because when it does take a good picture, the quality is nice. But that's rare. Buy something else.", "Date": "May 19, 2007"}, {"Title": "Love it at first!", "Author": "LoveToShop \"LoveToShop\"", "ReviewID": "R19SLE24K5TKOY", "Overall": "1.0", "Content": "After owning this camera just over a year - in the middle of my daughters competition - it went dead - batteries were completely charged, had new back up batteries and still wouldn't work - after calling customer care for service - they want me to ship it to them for repairs at the cost of $195!  Might as well get another camera as we only paid $239 for it!", "Date": "March 26, 2007"}, {"Title": "Konica Minolta Dimage Z6 6MP Digital Camera", "Author": "Stat Man \"Steve\"", "ReviewID": "R17Q1RXCMBL7ER", "Overall": "5.0", "Content": "I just used the camera on an Alaskan vacation for two weeks.  The zoom allowed me to get some amazing shots of eagles and mountain goats at great distances and was quite versatile for everything from indoors to shadow shots.  I highly recommend the camera if you don't want to pay $900 for a cheap SLR camera and another $1,000 on lenses to do what this camera will do without any attachments.", "Date": "July 5, 2006"}, {"Title": "Love It", "Author": "Sassy Sadie", "ReviewID": "R22N4IHY31KR0P", "Overall": "5.0", "Content": "Keeping in mind that I have little experience with digital cameras other than one I bought when they first became popular, I love this camera.  It is easy to use, the menu is fairly easy to follow, and the pictures are beautiful.", "Date": "March 23, 2006"}, {"Title": "Minolta Z6 camera is a notch above the P&S; cameras", "Author": "SeeDoubleU", "ReviewID": "R28PPG7IM514K0", "Overall": "4.0", "Content": "This camera is good if you spent time to learn how to use it.There are couple con's : 1. the CD card door is not secured and your finger may open it from time to time unintensionally. 2. The electronic view finder is coarse. 3. When use outdoot under the bright sunlight, both the LCD and electronic view finder reflected sunlight through the lens especially at the long end of the zoom. A lens hood may minimize this prblem.Operation of the camera is a bit above average of the point and shoot cameras. With the long zoom lens and the anti shake feature. I find I took some photo's that I cannot take them before.", "Date": "March 20, 2006"}, {"Title": "Dont waste your money", "Author": "Robert K. Raleigh", "ReviewID": "R1T4WS2MM3AAY1", "Overall": "1.0", "Content": "I bought this camera thinking it was going to be amazing considering the price and reviews.  It works nice but when you zoom it is blurry 90% of the time.  Also this camera does NOT work at night.  Even with the flash it doesnt pick up anything.  For the price you can get a lot better camera.  My sister got a kodak v550 for 30 dollars less and it was 3 times better.  Dont waste your money on this product", "Date": "December 31, 2005"}, {"Title": "Okay, not great, not terrible", "Author": "Zippy", "ReviewID": "R3QDDDIQI2T5M4", "Overall": "3.0", "Content": "I have owned and used a Konica Minolta Dimage Z6 for about 5 years. It has worked fine this entire time.  I was very happy with it when it was new, but my needs have changed and camera technology has changed. I note that most of the high ratings were posted years ago, and suspect current ratings would generally be much lower.It is unquestionably easy to use for snapshots, and the optical zoom is a good feature.Its autofocus works. However, because all objects tend to be in focus in the images even when near and far objects are combined in a single frame, the autofocus is not challenged. When one would want to focus on an object and deliberately have the background out of focus, you will be out of luck.My greatest complaints relate to the camera's limited ability to cope with shadows or bright backgrounds, and difficulty of getting a good manual exposure.  Admittedly most cameras' automatic exposure functions struggle when lighting goes from shadow to bright in the frame, but my previous experiences (albeit with Nikon products) have shown that it is possible for a built-in light meter to select the light level for a limited and identifiable region of the frame.  This camera fails in that regard.  To get a good automatic exposure the entire frame must be fairly uniformly illuminated.Shortly after producing the Z6 Konica Minolta abandoned the camera business.  I have to say their departure does not cause dismay.The Z6 is a good camera for a vacation trip when you want the zoom capability if you can get one at a very good price and will be satisfied with snapshots. If you are looking for a camera to take good photos, keep looking.", "Date": "November 17, 2010"}, {"Title": "Not the perfect cam even in its category", "Author": "Gkk \"dealhound\"", "ReviewID": "R2Q8QFFSV42CG8", "Overall": "4.0", "Content": "I purchased this on impulse from a ritz after checking out its zoom power. Later read about its being the in-between of point and shoot and professional. It suited me fine as I have always been interested in learning about photography.This camera has served me well in the 3 years I have owned it. People here have complained about its battery life. I solved my problem by having two sets of re-chargeable batteries. Another problem is that the colors dont come out all that lively but a free tool like picassa helped me out on that one. I realized how to work around poor focus in low light conditions - just developing good judgement of when you will be challenging it and try to finish taking your snaps before its too dark.I tried out various manual modes and was excited to see the outcome even when I took pictures in very dark conditions (however it requires pretty still conditions). In my opinion the flash just ruins the photo by its uneven spread of light and I use it only when facing a light sourceI have recently been to the Albany tulips show and I got some really beautiful pictures there. I even got my baby daughter's passport picture done using this even after everyone sternly warned me it might be rejected (they were amazed at its quality later - it had to happen, as I used the continuous shot feature to get just the right shots I needed out of several dozen)However do check out if you can get a better deal for the price. At this time Amazon price is an unbelievable $599. I paid around $300 at the ritz 3 years back.", "Date": "June 16, 2008"}, {"Title": "This camera rocks!!!", "Author": "H. M. Rissetto", "ReviewID": "RZY013G9488OM", "Overall": "5.0", "Content": "The Konica minolta Dimage Z6 is a totally amazing camera. The 12x zoom is incredible. I can't say enough about this camera. I love it!", "Date": "August 10, 2007"}, {"Title": "Terriffic Camera", "Author": "kbuell", "ReviewID": "R1ATQBOTAN0F72", "Overall": "5.0", "Content": "This camera is a real marvel.  So many possible adjustments.  I won't go into it as other reviews have covered it well.  This thing also sips batteries.  My old Olympus killed them in no time flat.  I have used this camera for six months on the same set of batteries and even plug it into my computer without an accessory power pack to upload photos.  Anti-shake not as great as hoped for, but that is my only complaint about this camera.  Honestly, if you're shooting something that requires the 12X zoom, you really should be using a tripod anyway.  Powerful and effective flashCan't beat it for the price and I did a lot of research before buying this camera.  I do not regret the purchase.  I wanted a camera with a high zoom, lots of manual adjustments rather than just a point and shoot, but also capable of point and shoot for my husband to use with ease.  This has become our main use camera for everything.", "Date": "July 28, 2007"}, {"Title": "nice konica minolta!", "Author": null, "ReviewID": "RE9XE0JVASIA7", "Overall": "5.0", "Content": "this is an awesome camera. i had just turned thirteen and i really wanted to do photography so me and my mom went to look for cameras... there was a whole lot of digital cameras(which is what i want) and it was pretty hard to choose but i got this one. its alott faster than our old FUJI camera which was really slow and anoying you'd take a picture and end up with the aftermath wich wasnt great. but this is alot faster and it wasnt eaven that expensive. not to menchin that 6mp is alot.if you want really good cameras these are the brands you should bye from: konica minolta, canon, and nikon.(some companies just arent as good like sony, fuji, and ilympus.) know you might be wondering why isnt kodak in my list well the reason is... because their speciality is FILM! not cameras.now back to this camera its great becouse it has manuel and automatic, you always want to try at automatic first becouse then you can do a little more stuff with it. out of all the pictures ive taken ive only gotten about 5 blury pictures but they were still good.ok if you want to take quicker photos its your lucky and unlucky day. the better your card is(as in gigabites) your camera will take quicker shots. the bad news is they co$t alot of money, like to get a really nice one its about $75 dollers. but thats if you want really really quick shots but other wise its fine.color: they come in different colors but theyre all cool.speed: goodweight: its really light.MP(megapixals): 6.0 thats great!AS(anti shake): it helps the camera not to break from just being shook.cost: it can be found cheaper at other stores.OVERALL: ITS AWESOME!!!!!", "Date": "May 9, 2006"}, {"Title": "GREAT CAMERA FOR THE MONEY!!!!", "Author": "gadget guru", "ReviewID": "R1YM4L3OD7VQON", "Overall": "5.0", "Content": "I got this camera for Christmas and it is FANTASTIC!! Great quality pictures! The only drawback is that you have to manually lift the flash, but still well worth it!!", "Date": "September 3, 2006"}, {"Title": "Konica Z6 Digital Camera", "Author": "Camera Boy", "ReviewID": "R3IMYTXTBBZ68C", "Overall": "4.0", "Content": "I bought this little job as a back up to some copy work that I was doing.  It worked very well in this aspect.  I have also used it for light vacations and the pictures were great.  Good buy.", "Date": "December 18, 2013"}, {"Title": "Konica Minolta Dimage Z6 6MP Digital Camera with 12x Anti-Shake Zoom", "Author": "Carolyn Craig \"CRAIG\"", "ReviewID": "R8RSUFUEAYWGA", "Overall": "5.0", "Content": "All came as described.  Camera works great, replaced this camera for the third time....... I use it all the time", "Date": "November 15, 2013"}, {"Title": "Pretty cool camera", "Author": "Dan", "ReviewID": "R1WRY9K0MXJ2V3", "Overall": "5.0", "Content": "Mine works great. It gives big zoom power in a small package. I can fit it in my pocket with some effort. It is a solid camera. Mine broke under warranty and needed the anti-shake repaired, but the repairs were done quickly and it has not had a problem since (I owned this 8 years since.", "Date": "August 14, 2013"}, {"Title": "Pro quality", "Author": "Virginia Bruce", "ReviewID": "R281K86F8KFNDN", "Overall": "5.0", "Content": "I'm a reporter, and drag my camera all over. I need better quality than a phone can offer, and this camera does it. Batteries run out too fast, but otherwise I love it.", "Date": "August 3, 2013"}, {"Title": "AB Martin", "Author": "AB Martin", "ReviewID": "RP0FSZ0HSCPYS", "Overall": "5.0", "Content": "I was sick when I broke my first camera just like this one.  It took great pictures and I knew how to use all the features.  It wasn't complicated.  Absolutely thrilled when I found another like it here on Amazon.  Extra careful now with this camera.  It's great I love it!", "Date": "October 8, 2011"}, {"Title": "Good solid camera", "Author": "P. Burke", "ReviewID": "R2ACTW6KB6012E", "Overall": "4.0", "Content": "I picked this camera after reading the reviews and looking for a camera that took regular batteries (4 AA's) since I had a Nikon that had poor battery life and required expensive rechargeables.  Solid, feels good in the hand, looks like a camera, and is big enough you won't sit on it or loose it.  This camera has an amazing 12X optical zoom, great macro settings, good flash, real camera settings, as well as a auto mode that takes good photos and pre-set scenes for usual situations.  It has good image stabilization, and the best video sound in any hand held camera I've ever owned.  I'd put it as \"average\" for battery life.  Big downside is that this does not record in HD video, nor does it accept the larger modern SD cards.  Good camera for taking snapshots of the kids.", "Date": "May 30, 2011"}, {"Title": "Superb Little Point & Shoot", "Author": "Purpod \"Be Well & Well Blessed!\"", "ReviewID": "R3BAJY14ZW7SM0", "Overall": "5.0", "Content": "Xllnt macro \"up in your face\" abilities ~ Very easy to use with portability as simple as hanging it around your neck.  Regular rechargable AA batteries are simple & economical.  Konica lens are clear & have no distortion.  It may only have 6 mp, but the images you capture will be sure to please ~Only two downfalls after literally tens of thousands of images shot:#1) Poor capture of movement.#2) Minolta sold out to Sony & so if you break this camera, you cannot get it fixed.If issues noted are not a concern for you, then this is a fantastic little camera ~ images can be found at [...]Enjoy ~", "Date": "December 12, 2010"}, {"Title": "Bought Konica Minolta Dimage Z6 6MP in 2006 -- FANTASTIC Camera", "Author": "Wendy B \"fl_cinnamon_girl\"", "ReviewID": "R16HCSEL3M2YM7", "Overall": "5.0", "Content": "I bought this camera in 2006 at a super sale price through Amazon and have been LOVING it ever since! I'm just a point and shoot photographer, though I do frame relatively well. The photos come out absolutely beautiful, time and time again. I have it set for highest resolution possible. I haven't ever even scratched the surface of the all the features -- this is one of the things I keep pretty simple. I absolutely recommend Konica Minolta.", "Date": "October 10, 2010"}, {"Title": "love it", "Author": "DanaD \"DanaD\"", "ReviewID": "RPTYGRBIW3JBG", "Overall": "5.0", "Content": "do NOT leave this camera out in the heat - it will kill it.I love this camera - it's big but the zoom is awesome and it takes great pics. LOVE IT", "Date": "August 2, 2010"}, {"Title": "Konica Minolta Digital Camera", "Author": "Michelle Walker \"Shellie On The Move\"", "ReviewID": "R3PR14VVOYF1K8", "Overall": "5.0", "Content": "Very pleased with my purchaseReceived in a timely mannerCamera and accessories in excellent conditionPackage in great condition as well", "Date": "September 6, 2009"}, {"Title": "Definately Buy This Camera!", "Author": "SPV", "ReviewID": "R3L2NGSRHCJHCI", "Overall": "5.0", "Content": "I purchased this camera in October 2005, and have not been disappointed in any feature in the 2 1/2 years since.  It takes amazing pictures, and all I do is point and shoot on the auto setting.  I set it to the finest quality and largest file size, and can crop a small section out of a shot and then print out great quality prints in 11 X 14 (probably larger, but that's as large as I have done).  I frequently have to argue with the employees at the photo departments that I am not illegally duplicating professional, copy-righted pictures!  I love this camera, and highly recommed it!", "Date": "July 3, 2008"}, {"Title": "Awesome Purchase !!  I LOVE this camera !", "Author": "BMT \"dbbj912\"", "ReviewID": "R9Q2D2NWCOTJ9", "Overall": "5.0", "Content": "Takes great pictures, easy to use, the different modes make this camera great for any setting. I use this for taking pics of everything, from high speed cars to flowers. Downloading is easy with the included software. Also, just to mention, I use regular AA batteries and they seem to last a long time. I used this camera for a 3 day car show, took hundreds of pics, downloaded and still had battery life left.I Highly Recommend this Camera !!  AA++", "Date": "June 22, 2008"}, {"Title": "Movement probs. are a thing of the past!", "Author": "J. Hopkins", "ReviewID": "R1C98BMW9DUW39", "Overall": "5.0", "Content": "We have had this camera for a year now LOVE IT!!!  We are actually getting ready to purchase a second for personal use due to the first one becomeing used mostly for unexpected business. My wife bought this camera having 2 Konica Minoltas in the past and wanting to upgrade(our friends love the hand me downs) :).  It is perfect for everything, our boys are in every sport imaginable and we have yet to see one that is a problem getting awsome pictures, even when I'm not always in sports mode. We haven't even sat down and learned how to use all of the settings and still very impressed. We also raise a dogs and so taking high quality pictures to advertise is important. Now after people have seen my Wife's pictures we've have sold most of our dogs due to the amount of puppy pictures that she is taking for others in my area. She thought kids were hard, WOW can puppies move! Once again the Z6 delivers A+ pictures everytime!", "Date": "February 25, 2008"}, {"Title": "Nice Price Nice Camera Nice Pictures", "Author": "Romulo Gallegos \"Roger\"", "ReviewID": "RE7ER2U81SMH1", "Overall": "5.0", "Content": "Very nice Camera is better than more people said ,  if you read the manual you will be very happy with this camera just learnd how to use,  for indors and outdors this is one of the best camera that I ever own", "Date": "October 5, 2005"}, {"Title": "Horrible internal battery life and customer service", "Author": "Melanie Gutwein \"Melanie Gutwein\"", "ReviewID": "R16ZYPGBZMVRIB", "Overall": "1.0", "Content": "I researched for months before buying this camera.  While I am not a pro by any means I am pretty well versed in photography.  My best friend owns a photography studio and I've taken numerous photography courses.  I bought this for all the features it offered for a reasonable price.  I charged the batteries exactly as suggested and read the book cover to cover before using. I took 22 pictures at my daughter's soccer game and the battery was dead.  Thinking the batteries it came with were just cheap I went out and bought the best rechargeable batteries Best Buy sold.  I charged them up and off I went to another game.  Same think except I only took 15 pictures and the battery low signal came on and then nothing.  I couldn't even turn the thing on.  I called customer service and they required me to send it in for service.  It was under warranty but I had to pay shipping.  I got it back 6 weeks later with an accompanying phone call stating they could find nothing wrong, try it again.  I charged the batteries again and this time took it to a wedding with an extra set of batteries.  I took 19 pictures and the internal battery light came on and it went dead again.  I called the customer service team and spoke with a manager this time.  I demanded my money back stating that I hated this camera.  He told me that I would have to send it back again before that could happen.  Reluctantly I did and paid the shipping again.  Another 4 weeks later I received it back with a phone call from the same manager.  He said it worked fine for him but he sent me a new one anyway.  This time they sent me their own batteries and charger valued at $100.  Now, if you read the description it clearly states that you do not have to use special batteries and that's one of it's so called claims to fame.  I tried the new batteries and I did get a little better results.  I took 27 pictures and the internal battery went dead again.  POS!!!!  I took it to a local camera store and they couldn't even get it to turn on.  They told me that the internal battery was completely dead and would have to be replaced by the company.  I called the manager again.  The camera repair store even wrote a letter stating the problem which I faxed to the company.  They would not give me another camera or my money back.  All they were willing to do was send me a third one and I would have to pay shipping to send the second one back.  So, I have a completely dead camera which the camera repair folks can't even fix.  I threw it in the trash.  I might as well have crumpled up 4 $100 bills and threw them away.  DO NOT BUY THIS CAMERA.  Finally after a very nasty letter to Minolta I received an apology letter but no offer to do anything different and a phone call from one of their \"techies\".  He even admitted that the short internal battery life was a severe problem and many others had sent their cameras back for the same reason.I now own a Sony Cybershot and it is the BEST camera I have ever owned.  In fact, my friend, the professional photographer just bought one for his everyday use.", "Date": "September 27, 2006"}, {"Title": "Enjoyed it at first...but years later I hate it!", "Author": "cali", "ReviewID": "R6RE9Q8UQ9Y8V", "Overall": "1.0", "Content": "I have had the z6 for about 4 years now. When it was brand new it seemed great, made pretty good pictures.  But after about a year I noticed it does not take pictures fast enough, and by not fast enough I mean s l o w.  I can press the button and nothing happens. This is very frustrating.  The battery life is awful.  I will put in brand new lithium batteries and within minutes the battery icon is flashing and the camera is performing badly.  I don't know why it worked decently when it was new and so quickly changed!  I took proper care of my camera, never ever has it been dropped or anything. I always put it directly back in the camera case as soon as I was finished shooting.  Do not waste your money on this camera!  Spend a little more and go with a DSLR. When I bought mine the DSLR's were too expensive, but now you can get a good one for right under $500!!! I am saving for a Canon Eos Rebel xs.", "Date": "June 26, 2011"}, {"Title": "Camera review", "Author": null, "ReviewID": "R2JHQAOB537GLF", "Overall": "1.0", "Content": "I was very disappointed with the telescopic ability with this camera.  I currently have the Z1 and it seemed to focus on far away objects much better.  I will say it was quite easy to return this product.  The customer service was excellent.  I would use the service again.", "Date": "June 26, 2006"}, {"Title": "Didn't even make it a year!", "Author": "VerNonn", "ReviewID": "R2MOO4T2VO28IQ", "Overall": "1.0", "Content": "I received this camera as a Christmas gift.  I have enjoyed it a lot (up to now), and I take lots of pictures.  Have missed lots of shots of the grandkids because of shutter lag or whatever the delay is called between pressing the shutter release and the photo being taken.  But I've still gotten lots of great shots with it and was dealing with that little problem.That was my only gripe until it quit working this week.  It won't even cycle on to let me take pictures.  I can view images that are stored on my card, but can't even get it to turn on to look through the viewfinder.  Pretty disappointed in that.  It is treated very carefully and kept in its case when not in use. Have read the manual front to back and inside out, and haven't been able to find anything to help me with this issue.  So I guess I have to send it in for warranty work.Don't know yet how long it will take to get fixed or what that will take.  But I do know that my husband spent a fair amount of money and we still don't have a working dependable camera.To top it off Konica Minolta isn't even making cameras any more.  Hopefully Sony will get it taken care of, since they have taken on the warranty issues on these cameras.Now I have to buy another camera to at least get my by until I can get this one working.", "Date": "September 24, 2006"}, {"Title": "Weak camera", "Author": "Roberto Vicente \"bodhiu\"", "ReviewID": "R2GODJPU77LPXE", "Overall": "1.0", "Content": "I always wanted to try the Z6 and so here it.  In general a very poor camera, but good optics, macro ability, and 12 zoom with anti shake that seems to work.  The ergonamics and feel of the camera are outstanding as it feels a natural part of your hand.  However, must shoot in ISO 50, anything more has lots of noise.  The camera is forever wanting to over expose and so pictures must be shot at -1.  Also general image quality is poor.  The auto features are weak and useless.  Battery life is OK as long as you are using rechargable.  Slow to focus AF.  Also no TIFF or RAW ability for higher quality image.  The camera makes you work!I had a Dimage S414 which has excellent optics and photo quality so was hoping for more from the Z6.Check out my photos which make the Z6 seem better than it is.", "Date": "January 24, 2010"}, {"Title": "Konica Minolta Z6", "Author": "Tommy K. Benjamin \"tommykb\"", "ReviewID": "R15DM18OJ5OPHQ", "Overall": "4.0", "Content": "Hastle free purchase.  Was updated of every step of the process until merchandise was received.", "Date": "June 17, 2009"}, {"Title": "Dimage Z6", "Author": "A. McDougall", "ReviewID": "RH8JJSH181WLX", "Overall": "1.0", "Content": "I am a disabled person having the use of only my left hand.  The Z6 camera is relatively easy to operate left handed and the 12x optical zoom and antishake system makes photo taking a simple operation with outstanding results.  My third digital camera and the best I have owned.  I heartily recommend it.", "Date": "March 19, 2006"}, {"Title": "Buyers BEWARE! Don't buy this camera!!", "Author": "G. Smith", "ReviewID": "R2VQ3G2D7TA42B", "Overall": "1.0", "Content": "I recieved the Konica Minolta Z6 as a Christmas gift and started snapping pictures immediately.  The pictures on the little LCD screen looked really good, unfortunately once the pictures get downloaded to the computer the problems begin.  I had read many glowing reviews for this camera and thought I had got a top quality product, I was wrong.  All the pictures were under exposed and grainy, I used the manual features of the camera to compensate for the exposure problem, but the noise in the pictures never went away no matter what the quality level selected was.  Every image was very grainy and the colors were poor.  I have an old Olympus 1.3 megapixel point and shoot camera, that under the same conditions produced flawless pictures and exposure compared to the Z6.  Unfortunately for me, by the time we noticed all the problems with the pictures and the terrible print quality I had used the camera to take hundreds of pictures of my daughter's birth.  I attempted to return the camera to Sears, where it was purchased, but it was beyond their stringent 30 day electronics return policy so I was stuck with this piece of junk.  After several attempts to contact Konica Minolta I finally got through and was told to send the camera in for repair.  After sending the camera in I found out that Konica Minolta's camera division ceased to exist on 3/30/2006 and was bought by Sony.  Its been two months and my camera is still at Sony waiting on parts to repair it.  The worst part is every single picture of my child's birth is ruined.  None of the digital photo software on the market had any success with fixing the pictures.  I did manage to find a digital picture repair service that for $6-$10 per photo managed to salvage the photo's.  To repair all the pictures its nearly $1500, of which Sony refuses to offer any type of compensation for their lousy defective product.  I have uncovered other reviews online with similiar problems so BEWARE and stay away from the Konica Minolta Z6.", "Date": "April 25, 2006"}, {"Title": "worse than 3MP Kodak", "Author": "V. Scobar \"math maven\"", "ReviewID": "RF60VJLWW3S2J", "Overall": "1.0", "Content": "I owned the camera for 2 weeks and then returned it.  Even though it is very convenient in use, after analyzing the pictures I was very disappointed. Images are not as clear as what my old Kodak 3MP makes. Even when I put it on tripod, still object are blurry, indor or outdoor. Antishake doesn't work perfectly. At least, I don't see any improvements in quality of indoor low light photos.  200$ Kodaks better, no reason to pay 400$ for this camera", "Date": "October 1, 2005"}, {"Title": "Konica Minolta POOR", "Author": "A. Hawkes \"aehawkes\"", "ReviewID": "RJMAFLBT34K3F", "Overall": "1.0", "Content": "Assuming that this camera is the same plastic that my Z1 was made of ....I purchased my DiMage Z1 about 3 years ago. I have meticulously cared for it, since it was so expensive. I had to send it in for repairs before it was a year old. I have since had multiple pieces of the cheap plastic break. The battery compartment is CRAP. It was repaired the first time. Now, two more pieces broke off INSIDE the battery compartment, while it was in the camera case. The ZOOM switch broke, while I was zooming. Now I have to replace my camera, since I am not putting any more money into this one. Needless to say, I will not be buying another Minolta product.", "Date": "November 26, 2005"}], "ProductInfo": {"Price": "Unavailable", "Features": "6.0-megapixel digital camera captures enough detail for photo-quality 14 x 19-inch prints\n12x optical zoom; 2.0-inch LCD display\nRapid AF offers great autofocus speed with Predictive Focus Control\nProgressive Capture mode ensures high-speed shooting of fast-moving subjects\nStores images on SD memory cards; powered by 4 AA-size batteries (4 AA-size alkaline batteries included)", "Name": "Konica Minolta Dimage Z6 6MP Digital Camera with 12x Anti-Shake Zoom", "ImgURL": "http://ecx.images-amazon.com/images/I/51DPRM%2BdQUL._SX300_.jpg", "ProductID": "B000AOFVZK"}}