{"Reviews": [{"Title": "Worth the Money at the New Price", "Author": "B. Tesson", "ReviewID": "R1VQ8LIBBTWE86", "Overall": "4.0", "Content": "I picked this camera up at the new lower price ($150 less).  For this price the camera is definately worth the money.  From a picture taking standpoint the camera is great.  8-Megapixel photos that look great, great flexibility for different sceens and a pretty quick shutter release are the highlights.  The camera does have some difficulty focusing in dark situations especially if you have zoomed in and the object is too far away.The only real problem I encountered is setting up the wi-fi feature.  I consider myself pretty computer literate, but this stumped me for some time.  A call to Nikon was pleasant but a waste of time.  The biggest problem you will run into is if you have Firewall-Enabled in XP or XP Pro.  You have to look close but on page 136 of the manual there is a little note about Port settings if you use a firewall (and who doesn't?).  By the way, the Nikon rep was clueless when I told him it worked with firewall off but wouldn't with firewall on.  He basically said, he had no idea and firewalls aren't Nikons specialty.  Anyway, the key is to go to security settings, click on Windows Firewall Settings, click \"Add Port\" and then add UDP port 5353 and click OK.  Add another port only this time select TCP port 15740 and click OK.  This was VERY POORLY explained in the manual and I couldn't find anything on their website.While just taking pictures the battery life was fine.  Using the wi-fi feature really eats up battery life.  I would recommend picking up an extra battery (only $17) as a spare for those longer trips.  That should give you well over 300 photos.PROS- Great pictures outdoors- Good pictures indoors within the limits of the flash- Large variety of shooting modes and camera control- Simple enough to use as a point-and-shoot- Capable enough for some real creative photography- Pretty quick shutter release time- Very thorough manual (with the exception of wi-fi setup)- Wi-fi transfer of pictures is great (once setup)CONS- Wi-fi setup is difficult- Focus in dark areas is sometimes difficult- Battery life could be better", "Date": "February 4, 2006"}, {"Title": "Nikon P1 Could Be Better", "Author": "Readalots", "ReviewID": "R2VDPWMSQO70JW", "Overall": "3.0", "Content": "I am a consummate camera buff having been in photography since the mid 1970s.  I have used many different cameras (Canons, Pentaxes, Olympuses, Kodaks, Polariods, an Agfa, even had a Minolta for a brief time, yuck!) and shot tens of thousands of photos all over the world.  In 2003, I retired my T-50 and EOS 650 and stepped into the digital world with a Canon \"Powershot\" S-50.  (It has been a delight not having to fumble with film while having the capacity to take 1000s of shots on a 1.0GB card!)The S-50 broke in Nov. 05 (with shot number 4000 on Waikiki Beach).  For Christmas my wife gave me the P1 (my first, ever, Nikon).  To date, I've taken about 1500 photos with it.The Nikon P1 \"Coolpix\" is handy.  The 8.0 megapixels and 3.5 zoom are excellent (and the reasons for the P1's purchase).  It fits in a pocket comfortably.  It is light weight and not cumbersome to hold.  The large 4.5 monitor screen is nice (enlarging all subjects).The P1 \"recovery time\" (the moment between the photo taken and its recording to the Sandisk) is much quicker.  The mode choices are numerous and the camera is easy to use.  The recording mic hears all sounds.  If I were a novice camera user I would be well pleased with the P1.Experience has shown, however, that the P1 could be better.  Here are the things I do not like about it (allowing it to earn only 3 stars).1) The digital flash is never bright enough.  All my photos are much darker- less vibrant- with the P1.2) The mode dial atop the Coolpix turns too easily.  Often it twists even as the camera is being handed over.  The dial moves randomly in the pocket, the backpack, the suitcase, and the briefcase.  It's irksome to be continually resetting the photo mode.3)  The 3.7V Lithium ION (730mAh) battery is good for about half the photos expected.  It is smaller than other brands' (Nikon should produce stronger versions for the P1).4)  It is possible, and simple, to misload the \"Coolpix\" battery (a trait solved by other brands).5)  The battery recharger works only with a chord (from the wall outlet to the recharger).  The recharger plugs directly into the chord and not into a wall socket (making more camera stuff to fumble with).  The 3-piece recharging process is not handy (in having to find room for a 3 ft. chord on a shelf or basin).Nikon will probably remedy these problems in the future.  For now, I find myself using the wife's Canon S-550 more and more (leaving the newer P1 in the camera drawer).", "Date": "March 28, 2006"}, {"Title": "Great camera with no wifi issues", "Author": "M M", "ReviewID": "R2MUPWP907UURC", "Overall": "5.0", "Content": "I find the Nikon P1 to be a great point a shoot camera.  I had no problems with it right out of the box.  I have taken many well developed pictures and I'm more then pleased with it.This is a point and shoot camera so you do give up full manual control.  But there is a variety of features to let you play around and be creative to a certain extent.I've gone through most the settings and have had very little to complain about.  The only pictures that have not turned out are ones taken with very little light.  This issue can be attributed to user error not camera error.  For example taking a night picture with a large shutter time by hand caused some blur (imagine that).I have seen a little noise at ISO 400 when my focus is far away and there is very little light but nothing different then any other camera.  You can still get some really nice night pictures if you use a tripod and the correct settings even night shot mood will produce decent results then.As for WiFi I personally love it.  No more having to find the right cable and plug it in.  I used the cable once to see how it compared and I can get just as fast results through wireless.  So after that finding I tossed that cable in a drawer with a lot of other lonely cables and have not brought it out since.  I am a PC user so I'm not sure of any apple issues but I was setup and going with wireless in under five minutes so I was really happy.  I've also played with some of the settings like direct transfer to the computer and that could be useful in some situations.Over all I've really enjoyed using this camera and as always compare them in the store first for your preference.  But I've had no real issues and would definitely suggest taking a look at this camera if you're looking for a good compact Digital camera.", "Date": "October 21, 2005"}, {"Title": "Great Camera", "Author": "Sean Thomas Brady", "ReviewID": "R3I081PVGKP737", "Overall": "4.0", "Content": "I initially had some problems setting up the Wi Fi on this camera.  The instructions for using this with an Apple computer could definitely be more clear (not sure if the same issues exist for PCs).BUT in fact it is easy to set up the wireless (if only they'd explained it better to begin with!) and it works like a charm.  You can set up your computer to display a slideshow of photos, and the ones you snap are automatically added to the slideshow as soon as you take them.  Great for parties.Moreover, the features and photo quality are excellent.  I highly recommend this camera.", "Date": "November 12, 2005"}, {"Title": "Just not fast enough for snap shots", "Author": "Gamer Head", "ReviewID": "R2QY323OPC3PE3", "Overall": "2.0", "Content": "I love it's small size (easy to pocket), decent looks (it's a camera after all), outdoor picture quality (could be better indoors) and of course the wifi feature (easy to use, IF you have WinXP!).If you like to take spur of the moment shots though, this camera is just not up to snuff, especially indoors. It just takes too long to boot up and focus. Between photos there is a good 2 second lag, at least. Not good if you like to take photos of your kids in an \"oh so cute\" action situation. That's exactly what most people use consumer cameras for and this subpar performance is just not acceptable. If that includes you, look elsewhere and consider a lower resolution camera and forget about the wifi for now.If it weren't for that, the camera would get an easy 4, if not 5 stars from me.", "Date": "January 10, 2006"}, {"Title": "Nikon P!, great pictures and features", "Author": "pcaugh \"Pat\"", "ReviewID": "R2Q87HCERDINTR", "Overall": "5.0", "Content": "The Nikon P1 is my first digital camera. I have waited for prices to come down and features to go up.  My 20 year old Nikon F2 was stolen which made the decision pretty easy.  I am amazed at all the features available in this small camera.  The pictures are excellent even in automatic mode.  The camera has 16 scene modes as well and two different levels of semi-manual mode.  I did not have problems setting up the Wi-fi connection on my network and was surprised at all the reviews complaining about the complexity.  I think the transfer rate is excellent and the pictures pop up on your computer immediately after completion.  If you have gotten past the point of getting your wireless network to work in your home, the setup process should be a breeze.  Make sure you read the instructions related to using a firewall and opening specific ports.  The software is very easy to use and the auto enhance feature is a one click process.  The instruction manual could have been a little more intuitive.  I recommend an extra battery and 1GB SD card.  I found a package for the memory and a carrying case which is not included for under $400.", "Date": "April 16, 2006"}, {"Title": "Nice camera, but far too slow to focus to get any action shots", "Author": "Alan-SF \"alansf\"", "ReviewID": "R1FHSJC508A6EI", "Overall": "5.0", "Content": "Gamer head is right.  The boot time is not the issue, in low light, with a moving subject, forget it, you will never get the shot.  The camera is very slow to focus under low light conditions.  Also, you will find most everything indoors or cloudy conditions is low light.  thus, no catching any spontaneous nighttime cuteness or following animals at the zoo on a cloudy day, etc.  Over all a nice still shot camera, but must have very fast memory to use movie mode, and no low light movement or your shot is out of focus.", "Date": "February 21, 2006"}, {"Title": "Great digital camera", "Author": "russkey \"russkey\"", "ReviewID": "R76WPF5CERIKO", "Overall": "5.0", "Content": "Works great right out of the box. Simple, intuitive, easy to use. Takes great pictures with the point and shoot mode. Lots of custom options available for special pictures and creative types. Small compact size, but easy to hold. Not too small. Good battery life.", "Date": "June 14, 2006"}, {"Title": "Not quite up to the promise of Nikon", "Author": "Kenneth M. Nyberg", "ReviewID": "R2BJ7AXT3XWI6L", "Overall": "3.0", "Content": "I've owned a number of film cameras over the years, and always prefered Nikon. The digital world is something different, though. I have owned Kodak, Sony, a couple of Canons, Konica, and a couple others too ghastly to name. I finally picked up the Nikon P1 at Costco after returning one of the ghastly ones. It is better than any of the others with the exception of my Canon 5MP Elph. Picture quality can be very good, but you often have to work for it. Automation levels for focus, flash, exposure etc just aren't anywhere near as good as with the Canon. An earlier review mentioned control issues - knob turns too easily, \"dark flash\" etc, and was very accurate. WiFi works, but is hardly worth the trouble. Again, it looks better on the box as a bullet point feature than the reality, as is the case with so much of this camera.If you want to \"work it\" you can get very acceptable results, although there is more color \"fuzzing\" at the edges of details under heavy magnification than I see with the Canon.If you  want a camera that you can pick up, point, shoot and get routinely get better than expected photos, this isn't the camera for you. I use The P1 a good bit at work, but given a choice for family type events, I pick up the wife's Canon.Consider the Canon Elph SD600 as an alternative to this.", "Date": "December 11, 2006"}, {"Title": "Nikon P1 meets what is says it is", "Author": "J. Amorose", "ReviewID": "R3855AL539H8RS", "Overall": "4.0", "Content": "I was very pleased with my recent purchase of the Nikon P1. I was very excited about the wireless feature but hesitant because of the reviews I have read stating that it was difficult to set up. The reviews were somewhat correct. I did have problems  but only when I had to enter the key code for my wireless router. It would not accept the one I had. Mind you, it contained 63 characters and symbols. I emailed Nikon support but did not get any response, so I called. After about 20 minutes on the phone with a tech I was told I could not use my key code because it contained certain symbols. I was a little upset because I did not want to have to redo my wireless network at home. About a week later I received an email that there was an update to the wirless software for the camera. It made no mention of my problem only enhancements they made to features. However, when I tried to enter the key code it worked. I am now enjoying the benefits of the Wi-Fi feature of the camera and it is just great.", "Date": "March 9, 2006"}, {"Title": "Great travel camera", "Author": "Gary G. Gilbert \"Bass Fisherman GGG\"", "ReviewID": "R2QFA5VQQEZ6MS", "Overall": "5.0", "Content": "I own several Nikon cameras including the D200 and this is a great addition to my photography collection for use on those quick, last minute trips. I throw it in the car or boat for that unexpected shot you usually miss.  This camera has great features, produces good quality photos and you won't be disappointed.", "Date": "February 6, 2007"}, {"Title": "Good Camera for the price", "Author": "V. Raikar \"Infobahn\"", "ReviewID": "RQTOTYUDDDS8T", "Overall": "5.0", "Content": "Have taken many picture in the auto mode, the clarity is really good.The different scenes setting is really cool.Liked overall performance in low light", "Date": "February 11, 2006"}, {"Title": "Wonderful Camera", "Author": "Bill C.", "ReviewID": "R3R7KKM8TGMJ6Q", "Overall": "5.0", "Content": "The camera is a GREAT camera full of features. My wife and I LOVE this digital camera for it's ease of use, ease of reviewing pictures, and the size of the LCD screen.The features are incredible.", "Date": "January 19, 2007"}, {"Title": "Out shoots my mother's", "Author": "Amazon Customer", "ReviewID": "R3NJ80DCSC0A43", "Overall": "4.0", "Content": "My Mom and I both are into photography as I inheirited her film camera and had to save up for the P1.  The 8MP gives great enlargements.  one problem I do have however is I will take a picture in Macromode and go back to it later on the computer and realize it was out of focus.  Even after a year of ownership I still have a hard time finding the proper depth of field.Good camera for night photos.  I still rely on my Pentax K100 for the artistic stuff.", "Date": "January 18, 2007"}, {"Title": "average camera", "Author": "A. Eby", "ReviewID": "R89ZCCXKIM5RG", "Overall": "3.0", "Content": "I can't say that I can tell a difference in photo quality from our 2 pixel camera we replaced.", "Date": "January 9, 2007"}, {"Title": "great camera for the price", "Author": "jamie v", "ReviewID": "R30SX2MZMYRM63", "Overall": "4.0", "Content": "i did a lot of research before i decided to purchase this camera.  its really a terrific camera.  it is very easy to use.  its small but not too small.  takes great quality pictures.  the only complaint is, it has trouble focusing in very low light.  but since i dont often take pictures in very low light, it was the perfect camera for me.", "Date": "December 10, 2006"}, {"Title": "Good little camera", "Author": "Jessica M. Monaghan", "ReviewID": "R3GBSGLZ1E52WS", "Overall": "5.0", "Content": "I really like this camera. The wi-fi feature is fun but I don't know how practical it is. I love the huge image size and the fact that it does have some internal memory which allowed me to start shooting right out of the box. The start up time is a bit on the slow side but it's nothing horrible. I'm used to my big semi-professional camera that is also 8 mega pixels and instead, this is nice to just pop in a bag or purse for on the go. The zoom is satisfactory as well though I wouldn't recommend the digital zoom, on any camera, just take bigger pictures and crop them down later. I wish there was a black/white still mode, I'm not sure why there isn't one when at the same time it has a b/w movie mode, but oh well. Overall though, I really like this camera and recommend it to anyone who's looking for a small, compact but good quality camera.", "Date": "February 23, 2006"}, {"Title": "MINOR ISSUES", "Author": "Edgar A. Poe \"RAVENMAN\"", "ReviewID": "R3E4MVMQS5CK5R", "Overall": "4.0", "Content": "THIS CAMERA HAS A LARGE, BRIGHT VIEWING SCREEN BUT IT DOES NOT HAVE A VIEWFINDER.  I HAVE NEVER USED A CAMERA WITHOUT ONE AND IT IS TAKING ME QUITE SOME TIME TO GET ACCUSTOMED TO COMPOSING A SCENE. ALSO, THE MODE DIAL EASILY ROTATES SO I HAVE TO CHECK ITS SETTING EVERY TIME I TAKE THE CAMERA OUT OF MY POCKET TO SHOOT A PIC.AS A PROFESSIONAL PHOTOGRAPHER, THIS IS MY \"ALWAYS HAVE A CAMERA WITH ME\" CAMERA.THE SIZE IS GREAT AND FEELS GOOD TO HOLD; STURDY WELL-BUILT.SOME IMAGES ARE ON MY SITE, BUT MOST ARE TAKEN WITH MY NIKON D70 AND NIKON D200. [...]update:  I sold this camera to bro in law.  Eventually the lens cap would not fully open when the lens extended.  I now have a Panasonic Lumix DMC-ZS7 for at least 2 years.  Great little camera, Leica lens.", "Date": "March 26, 2006"}, {"Title": "<3LOVE IT", "Author": "Monique Jackson", "ReviewID": "R1RGAZD17LO7TD", "Overall": "5.0", "Content": "Idiot-proof--NOT that I'm an idiot or anything.I'mn just not so handy with electronics Mmkay.Once I got really familiar with it i started using all the extra features and they are quite handy. Nice lightweight reliable camera. I really love it <3", "Date": "October 11, 2011"}, {"Title": "Repeat Customer", "Author": "JaredS", "ReviewID": "R1M2MRLE3X4S7Q", "Overall": "5.0", "Content": "I've been a CoolPix fan since my first 2500 in 2002. Went through a series of updates over the years, then received a P1 as a gift in 2008. Used & abused it, even left it out in a torrential downpour when it was almost new, and it has just now finally given up on me. I was thrilled to find that there are still a few new examples of this (long discontinued) model out there, and jumped on it.This is by far the best price I've found.", "Date": "June 24, 2011"}, {"Title": "bought to my brother", "Author": "mubarak", "ReviewID": "R38IBHNHOH8576", "Overall": "3.0", "Content": "nice camera,bought as a gift for my brotherthe noise was obvious in all shots", "Date": "October 22, 2010"}, {"Title": "Awesome pictures...", "Author": "C. Jeffery", "ReviewID": "R2JUXN84BLIVMJ", "Overall": "4.0", "Content": "I have had this camera for about 2 years and now that I've had a chance to play around with it, it's great! I have taken some amazing pictures, people ask me all the time what kind of camera I use! I haven't ever messed with the Wi-fi stuff, I just take the memory card out and upload it to my laptop, that works best for me. The only time I haven't gotten the best pictures is at night. The best way to get pictures for me has been in sunlight. Overall it's a great point and shoot camera!", "Date": "August 28, 2009"}, {"Title": "Nikon P1 Digital Camera", "Author": "J. Hayter \"Unicorn\"", "ReviewID": "R1YNFU1P35LOPQ", "Overall": "4.0", "Content": "This point and shoot digital camera is fairly easy to use, however the extensive menu takes some work.", "Date": "December 24, 2007"}, {"Title": "cool", "Author": "Juan Domingo Petruzza \"bob marvin\"", "ReviewID": "R36NATR7L8FW6S", "Overall": "5.0", "Content": "this camera is the best, by far.Cheap and does what you want it to do.", "Date": "September 30, 2007"}, {"Title": "Good camera , poor customer service", "Author": "A. Ruggeri", "ReviewID": "RRA8CZP0IJA8M", "Overall": "3.0", "Content": "I had purchase the P1 a year ago.  This will be my second digital Nikon and fourth Nikon camera over the years.The pros include great optics, numerous photographic effects, vibration reduction with movie mode, fast recover time with mediocre SD cardsCons which are all minor include, picture dial moves too easily and is bumped easily. Portrait focus is slow and often does not distinguish faces.  No viewfinder which renders the camera almost useless in the bright sun with LCD(forcing to take blind shots), WiFi is difficult to set-up.Nikon service on the other hand is pathetic.  Yes the camera was dropped and subsequently the shutter button was damaged.  That was the only damage to the camera.  It still worked fine only every once in a while the button fell off.  I sent in the camera in for repair, the estimate was $150.00, half the cost of a camera. This did not even include a new housing.So this is equivalent to purchasing a $20,000 new car and having to pay $10,000 for a new blinker assembly and with depreciation due to better models being worth $12,000.", "Date": "July 3, 2007"}, {"Title": "Brilliance with simplicity", "Author": "Ganesh V", "ReviewID": "R14T2FJPCPGEKM", "Overall": "5.0", "Content": "I've had the Nikon Coolpix P1 digital camera for more than a year now. This was my first digital camera and I'm considerably satisfied with its performance. Being from Florida, I must mention that my P1 has also stood up well in conditions of rain, wind and fog!The Coolpix P1 has 16 different modes (and further advanced sub-modes!!) for speedy image capture. There is also an AUTO mode with intelligent flash and self-timer options for that quick snap (at 14000ft just before going on your skydive, or for capturing Shamu's nighttime antics :) )The coolest features of this camera include the brilliant 2.5inch LCD screen, 8MP stunning clarity, In-camera Red-Eye Fix, D-Lighting, and the video capture ability. These features easily compensate for the comparatively lesser optical zoom (the P1 has 3.5x Zoom-Nikkor lens with 4x digizoom). Note that this 3.5x lens is what makes the P1 so compact and small in size. When I opened the package, I was amazed at size of this camera and the ton of features it encased.The P1 has superior video and sound recording capabilities. I've experimented with the panoramic image mode, sports and night modes, and got excellent results. Photos come out clear and crisp, and there is hardly any blurring when the right mode is used. I've had the Wifi setup go smooth and easy, (must mention that being a CS grad helps) and the transfer speed was great. (However, note that using the Wifi excessively depletes the battery fast.)Nikon has several new variants in the Coolpix-P line now. These boast of improved features, like the eVR (Vibration Reduction capability in P3) and improved image quality. However, the P1 has been a steady performer, giving exemplary performance, unmatched image quality and quick point-n-shoot ease of use. 5-STARS!!!Thank you Nikon!!p.s: I recommend getting an extra set of batteries Nikon EN-EL8 Rechargeable Lithium-ion Battery for P1, P2, S1 & S3 Digital Cameras and two of those 1Gb high-speed SD cards for long travel. Happy Photographing!", "Date": "June 21, 2007"}, {"Title": "Nice camera!", "Author": "J. Reynolds", "ReviewID": "R4BQRIUGQVM7T", "Overall": "5.0", "Content": "I was looking for a small, easy-to-operate camera, that produced a nice large file. The P1 is a great camera. Small, easy to use, has a big bright viewing LCD, and seems relatively sharp. I wish that it had an optical viewfinder, but that's just my personal preference. The battery lasts a very long time (about 300 shots per charge) and the scene modes are handy. Also the video quality is above average, if you want that feature.This camera is NOT being produced any more, but should be available from several vendors.", "Date": "January 11, 2007"}, {"Title": "Great Indoor / Outdoor Camera", "Author": "jssm", "ReviewID": "R165S7F9WVFBVN", "Overall": "4.0", "Content": "I bought this camera a month back. Still taking some snaps every day. It works well for indoor shots too. I tried so many digicams. Most of them delivered very good quality shots outdoor, but indoor shots were grainy. But not this one. It's so compact to carry around. But need to be careful with kids around. Wi-Fi is easy to setup. But i don't see much of use for it. It can't work with any PC OR Network. Real use would be, go to friends place take snaps download wirelessly to friends computer. But it needs a software setup in each computer. Latest laptops have memory card readers, so thats much faster than Wi-Fi transfer and Wi-Fi transfer also drains your battery soon.", "Date": "February 3, 2006"}, {"Title": "NIkon P1 8.0 MP", "Author": "Christian \"Christian Maverick\"", "ReviewID": "RYANOLOPBJIN1", "Overall": "5.0", "Content": "I bought this camera 4 weeks ago, and i must say that i lives up to my every expectation! After buying other cameras such as casio Exilim s500 and Panasonic FX8, i can without a doubt say that the Nikon is the best in the bunch.I have look at allmost every other camera within the same pricerange, and this is the most complete. The autofocus is perfect as well as the Image quality, vivid colors, startup time, night mode etc.The one minus this camera has is the trasfer time, and that the lens \"case\" (the thing that comes out from the camera when turned on) seems a little fragile!Also the Wi-fi option is a little strange, i havent used it myself but i think that plugging the camera to the computer via usb is more simple. And if you have usb 2.0 the trasfer time shouldnt be much faster using WI-FI function.I would suggest this camera to anybody that is not a proffesional fotographer- eventhough the pictures are almost as good as the ones cameras like Canon mk2 pruduces.Las advice, dont for for less then 512 MB memory card, when you see your pictures on a real computer screen, you will begin seeing beauty on every street corner that you just have to capture with your little new nikon sweet heart!Just buy it guys, its better then the rest, i promise.", "Date": "March 17, 2006"}, {"Title": "Nikon Coolpix P1", "Author": "R. Reeder", "ReviewID": "R3HV9KHDPUK32C", "Overall": "4.0", "Content": "The Nikon p1 is very sleek looking with the perfect compact weight & size. The user controls are easy to navigate through with a wonderful selection of manual and auto settings. This camera takes great vibrant colored photographs with the exception all your photos will turn out soft, as though a softening filter were placed on the camera, even on the highest sharpness settings. Batteries seem to drain quickly. I would say over all this is a decent camera.", "Date": "April 11, 2006"}, {"Title": "Mac users left out in the cold", "Author": "Brewing Beer & Ideas \"Spare The Change, Spoil...", "ReviewID": "R18Y8FOV171LUB", "Overall": "2.0", "Content": "Bought this camera when it first came out, and it takes pretty good pics, but I have a Mac and Nikon does not keep up the software, including the wireless transfer, with Mac OS (I now use Lion). My next choice for camera will be a Canon, better pic quality and friendlier to Macs.", "Date": "November 28, 2011"}, {"Title": "Look at the New List price from Nikon.", "Author": "Amazon Junky \"Was Here\"", "ReviewID": "R2810B5Z96KOFP", "Overall": "2.0", "Content": "The old list price will never go back. Amazon says (40%)off the exploded old list price. This camera is getting mixed reviews. A lower price would help the likability of this camera.It's WI-FI feature is not so great..look at the Canon SD430 at what it can do. Video only uses the digital zoom of 2x and makes .MOV files which are Apple software files and very large file size with HQ video. The LCD is cluttered with all the different settings available. Read the manual on Nikons website to see what the camera can do. Worth $260- $290 that's why it gets a 2 star. The camear does have several quick shot modes to take several pitures at a time.", "Date": "January 19, 2006"}], "ProductInfo": {"Price": "Unavailable", "Features": "8.0-megapixel CCD captures enough detail for photo-quality 16 x 22-inch prints\n3.5x optical zoom; 2.5-inch LCD display\nFace Priority Autofocus and In-Camera Red-Eye Fix; transfer and print images wirelessly with built-in Wi-Fi connectivity\n16 scene modes; macro setting focuses as close as 1.6 inches from subject\nPowered by lithium-ion battery (battery and charger included); stores images on SD cards (32 MB internal memory included)", "Name": "Nikon Coolpix P1 8MP Digital Camera with 3.5x Optical Zoom (Wi-Fi Capable)", "ImgURL": "http://ecx.images-amazon.com/images/I/41NGK1MXK4L._SX300_.jpg", "ProductID": "B000AXQXXU"}}