{"Reviews": [{"Title": "LCD of 2.5\" and OIS = One of the Best Ultra-Compact Cameras", "Author": "Hyper \"Hyper\"", "ReviewID": "R1PKK05AFWPPJZ", "Overall": "5.0", "Content": "First, I should qualify this by saying I've been a huge fan of Panasonic digital cameras since I bought the DMC-LC20.  I later upgraded to a DMC-LC33, and now, I've taken the plunge and bought the FX9.The camera I compared this with the most, and nearly bought was the Canon SD400.  And I actually was really close to buying the SD400 over the FX7, but luckily I waited long enough to hear about the FX8 and FX9 being launched in the US.  I could not have made a better choice.Panasonic's carried over some of the best features of some of its previous lines:- Size:  This camera is tiny.  It fits nicely in your pocket.  The black version of this camera also looks really sleek.  Very nice brushed finish to it that doesn't get fingerprints on it too easily.- An absolutely beautiful 2.5\" LCD screen.  Seriously, this screen alone is reason enough to get the FX9 (207k pixels) over the FX8 (114k pixels).  It is simply amazing.  You can tell right on the screen whether the picture you took is in focus, and the colors are just more vibrant.- The Optical Image Stabilizer (OIS) is works wonders for this ultra-compact camera.  Some would argue that well, if you had an optical viewfinder, you wouldn't need the OIS because you could stabilize the camera against your face.  But seriously, who uses a viewfinder with an ultra-compact digital now?  Digital SLR, sure, but an ultra-compact?  Granted, if a viewfinder is important to you, this camera may not be right for you.  But really, with the 2.5\" LCD, you won't miss the viewfinder.  I actually compared shots between the SD400 and FX9, and at full zoom, you can really see that the OIS helps with the image's focus.- Leica lens: Gives amazingly sharp, vibrant pictures.- Burst mode: Allows you to take literally an infinite number of pictures in rapid succession in well-lit (no flash) conditions.  This is an amazing feature for taking action and sports shots.  I loved this feature on my old Panny cameras and I still really enjoy it on this one.- Picture Review: The picture review on this camera is amazing.  First, you can zoom up to 16x to check the clarity of the picture.  Second, you can zoom out and review 25 thumbnails at once.  25!  That's what a 2.5\" LCD can do for you.- Movie mode: Although a HUGE memory hog, the movie mode is vastly improved from the FX7.  In fact, one reason why I almost opted for the SD400 was because the movie mode on the FX7 was pretty much useless.  The FX9 takes great video, and the image stabilizer (detailed below) works to help stabilize the video image.- Powerup lag and time between pictures has been excellent.Some of the cons of this camera:- The on-off switch of this camera could be designed better.  I've accidentally turned the camera on several times while reaching into my pocket and have resorted to turning the mode dial to Review mode whenever I pocket the camera to prevent any damage to the lens motor.- Unfortunately, they've done away with AA batteries, but in a camera of this size, AAs wouldn't even fit.  So I can understand the transition to proprietary batteries.  At $69 a pop for a spare OEM battery though, that sorta hurts.- Once again, Panasonic has seen fit to package the camera with pretty useless software and a practically unusable 16MB SD card.  Come on... 16MB?  That's good for no more than 8 pictures in full-resolution.- I hear the FX9 isn't great in low-light condition and has a weak flash, but I haven't had too many problems with it.Of course, which digital camera you buy depends on what features are most important to you.  I bought this as a camera to bring anywhere I wanted to go.  I realized that the bulk of my old camera was preventing me from bringing it out everywhere, so I decided early on to get an ultra-compact.  So far, I've been exceptionally happy with my purchase.", "Date": "November 22, 2005"}, {"Title": "VERY well made Camera!", "Author": "Radio Man \"yarns13\"", "ReviewID": "R3LHZVN89E7ZXF", "Overall": "4.0", "Content": "I exercise with my dog every morning early am. Ok you want to know about the FX9 not my dog. My point is I live near a pretty park, and very beautiful woods. I always wanted to take some shots of the early morning beauty but I didn't want to carry my huge Canon G4 around. Long story short, I started hunting for one of these pocket sized cameras. I read TONS of reviews and looked at sample pictures. Finally I got taken in by the cuteness of the Casio s500 camera. I had it about 1 week and after the cuteness wore off I had to return it as the pictures OVERALL were pretty bad..and lacking detail etc. Next I had a gift cert to \"another web site\" I decided I'd try the Canon sd450. Well that camera actually is quite good. But I still wasn't THRILLED. So I used 1 more gift cert..to another site..and just had to try this Panasonic FX9 camera. Like a crazy person I kept A-B-eeeing The SD 450 with this FX9. In the end I ended up loving the FX 9 while just liking the Canon. I must say for indoor flesh tones I must give the edge to the SD450. However after much reading I found if you set the white balance manually on the FX9..it looks pretty awesome on people..on everything. Outdoors I just use auto white balance. One major reason I'm SO impressed with this little guy is about the 2nd day I had the FX9 i accidentally dropped in on a VERY hard floor from 5 feet above the floor. It slammed to the ground right on the lcd and slid about 3 feet. I felt sick. But it only had a TINY dust like scratch. Everything still worked...this thing can take abuse ..though that's the last thing I wanted to do to this FX9.In the end..I found that overall this camera is just awesome. The user inteface will just MAKE you like it. It's SUPER easy to use..and feels solid as a rock. In the end...it's about picture quality.I'd say the pic quality is about as good as it gets in this class..and I ought to know having owned 3 cameras in this category and the FX9 to me is the CLEAR winner!", "Date": "December 25, 2005"}, {"Title": "Great Camera (some update)", "Author": "liebesy", "ReviewID": "R2ORH3R9IBKR1T", "Overall": "4.0", "Content": "I was originally planning to buy Dimage X1. However, after some researches, I decided to go to Panasonic. This camera is just what I wanted, compact-sized(size of cigarette pack) and image stabilized.For outside shooting(under daylight), it is not really necessary to change many settings, but automatic shooting is good enough like most cameras. However, this camera shines for indoor shooting with the image stablization.For those who are new to camera, let me say that image stabilizer is not a miracle-maker letting you to get clean and sharp picture in the middle of earthquake. However, it is capable of compensating shake of hand holding camera good enough if used with some physical stabilization, or if there were nowhere to put your arms, with timed shutter. This camera has 2-sec and 10-sec timer, and I mostly use 2-sec without using flash indoors. (Force of pressing shutter may give camera shake that image stabilizer cannot compensate, so timed shutter is very handy.)Result? Good enough, although I could see some noise indoors with automatic ISO setting(it usually sets ISO to 200 for some reason).One thing: most of my indoor shootings are still-life(many times in macro mode). I haven't tested it for portrait yet, but I guess that shooting portrait in some distance may require less concern for hand-shake, unless under low-light condition.Battery duration seems very good, too. However, extra battery will be nice.Complaint: (maybe or maybe not)1. Single file of 6 megapixel picture usually costs between 2 and 2.5 megabytes, but Panasonic only included 16MB memory. Is it a joke?2. It's not really a complaint, but big LCD screen means more chances of getting scratches. I use the protective film (designed for PDA, so I have to cut it to right size) for all of my digital cameras.", "Date": "October 10, 2005"}, {"Title": "lumix dmc-fx9k", "Author": "Valentin Hsu \"Britishb0rnazn\"", "ReviewID": "R1A74RIFWPN0JP", "Overall": "4.0", "Content": "Ok, I haven't had this camera for a long time yet (a week perhaps), so this review is just what i had gathered from it so far. I might update it some time later.I must say that this was an excellent buy for me. When i first took it out of the box, i was stunned by the beauty and small size of it (the black finish looks awesome). It's very small and lightweight, even with the battery and sd card in. So, for looks, this camera definetely scores very high.Some reviews i found when i was deciding whether or not to buy this camera said that the controls were kind of confusing. On the contrary, i found that the controls were relatively easy and only took me about 2 mintues to comprehend. Although i agree that the buttons might be too small for some people with large fingers, I think that it would do for most people (It's great for me).Two of the major selling points for me when shopping for this camera were the Mega OIS and the large 2.5\" LCD. I must say that the OIS works like a charm in low light conditions. It even works in the movie mode. =), i love the movie mode - from just a few samples i have taken, they seem to be great. The 2.5\" LCD also gives me a great view of the pictures i had just taken. I can tell that the power lcd mode does work, although i cannot say how well yet b/c it has been cloudy everyday since i've gotten the camera.I also found some reviews saying how flimsy the cover for the battery and sd card compartment was. I, again, find this not the case for me. the cover has a lock/open switch. when its locked, it seems to stay closed; when it's open, it swings open lightly by a spring in the hinge. I honestly cannot say how long the battery life is, but from numerous other reviews, i think it ranks above average.The performance of the camera is good enough for me. It starts up pretty fast (maybe about 2 seconds?) and has very little shutter lag. The zoom works pretty fast and you can use the extended zoom feature that allows you to extend the optical zoom to 4.1x (compared to the regular 3.0x), but it reduces the number of megapixels as well. The burst shot mode on this camera works fine as far as i can tell. all in all, i think the performance of this p/s ultra-compact is more than adequate.Now, I didn't give this camera a 5/5 b/c it does have its imperfections (minor ones, but imperfections nonetheless). I cannot say that I'm an expert in image quality (this only being my 2nd digicam, the first a canon powershot s45), but i have noticed more purple fringing than my old camera. The images at the higher isos can sometimes be a bit too noisy for my tastes, but i rarely have to use high iso b/c of the OIS. I've also noticed that in low light, sometimes objects (especially skin) may have a yellowish tint to them. I haven't tested out the flash thoroughly yet, but i've heard that it isn't the best (nor the worst) indoors. Again, these imperfections do not bother me so much, as i rarely print very big sizes, but it might be a major issue for some other people.I also have some minor gripes about the bundle the camera comes with. The 16 mb sd card that it comes with can store about 5 pictures at max resolution, I mean come on... The wrist strap that the camera comes with looks and feels as if it would fall off your wrist at any second. I had to use the wrist strap that my old camera came with as it had a little thing that allowed you to tighten it around your wrist. I haven't tested the software out yet, so i can't say anything about that. One of the things i like about the bundle is that the battery charger has a built-in plug, so you can just put the battery inside the charger and plug it into an outlet. However, some people may find this a bad thing as you have to take the battery out of the camera in order to charge it. I personally like this better for travel b/c i dun have to carry around a big bulky dock for my camera.Another thing, when you buy this camera i suggest you also buy some accesories for it, some of which can be:an extra battery - i dun have 1 (and i don't plan on getting one), but i dunno, maybe you don't like charging?a case - it might be hard to find one that fits your needs, but i recently ordered a Lowepro Slider 20 from best buy. It says online that the camera should fit, but i'll have to see for myself in about a week.LCD screen protector - i dunno if it really needs one, but ever since reading those reviews of the fragile Canon SDxxx lcd's i've been a lot more paranoid about them. Plus, it can't hurt to put one on. I mean, hey, a larger lcd does mean a bigger chance that it's gonna get scratched. I'm getting a Brando Workshop Ultra Clear screen protector - might be a tad bit too expensive, but i hear it's pretty good.And last but certainly not least, a SD memory card - a MUST have accesory. the 16mb card supplied is a joke! I got a 1GB SanDisk Ultra II and i'm loving it. A good SD card completes this whole package!I recommend this camera for a person who wants a small, beautifully designed, p/s digital camera, but doesn't need DSLR image quality or to print pictures that big. For any reason whatsoever, whether you want to impress you friends with its good looks, or if you simply want an ultra-compact rather than carry around that bulky SLR, this camera is a good choice. While not without it's imperfections, I think that this camera, bundled with its amazing Mega OIS system, is an excellent buy, but I'll leave the deciding to you.Happy camera hunting!btw, since it's almost Christmas, I'd like to say Happy Holidays to all and Happy New Years!", "Date": "December 23, 2005"}, {"Title": "Best Choice in Ultra Compact Camera Category...", "Author": "Amazon Customer", "ReviewID": "RVSLUPB2OC7K4", "Overall": "5.0", "Content": "In my opionion, the Panasonic DMC-FX8 and FX9 are the best choices in the ultra compact camera category. I have owned a couple of the Canon SD cameras (SD200 and SD300) and the pictures produced by the FX7/8/9 are vastly superior, esp. with Indoor Shots. The Image Stabilization really helps in Indoor, Low-Light Settings which if you are like me, is where you take the majority of your snapshots.  The Canon SD500/550 are arguably better cameras due to their bigger sensor, 7 MPs, and stronger flash BUT they are not small enough to toss into my front pocket (a pre-requisite). As for the cracked LCD screens, google \"Canon and Cracked LCD Screen\". It is not an isolated problem! The best precaution you can take is two-fold. Buy a LCD screen protector as well as a hard camera case (I review one of each btw).Finally, the FX8/FX9 have corrected the two major complaints people had with the very popular and well-regarded DMC-FX7. They now boast a faster AF, a longer-lasting battery and 640x480 Movie Mode. If they had manual controls, they would have created the elusive \"perfect ultra compact\" camera!", "Date": "February 8, 2006"}, {"Title": "Great camera, miss the optical viewfinder.", "Author": "FactChecker \"FactChecker\"", "ReviewID": "R6FXMR84VGMQN", "Overall": "4.0", "Content": "What a great camera!  I am still getting used to all the features.  Recently took it to a concert that forbade flash photos.  Holding the camera over my head, zoomed to the maximum optical zoom, the results were astounding!!  That anti-shake function works great!!!  I do miss having a traditional viewfinder, but I am adapting.  The original camera I had began malfunctioning the first week, every few seconds it would display a message requiring me to turn the camera off and back on.  It was really annoying and it was during Christmas, so I really wanted to use it.  The pictures did turn out fine, and none were lost.  Panasonic wanted me to send it in to be serviced or replaced and said it would take 4-6 weeks, no promises!  Luckily I called Amazon and they sent me a replacement that arrived in 2 days and let me send the bad one back to them after it arrived.  Well done!  The less than stellar response by Panasonic is the only reason I downgraded from 5 stars to 4.  Oh yeah, sometimes the on/off switch is too easy to accidently turn on.  Don't get me wrong, I love this camera and the pictures are great!!", "Date": "February 24, 2006"}, {"Title": "Super Fast,  Sharp pictures+ Screen and Great battery life", "Author": "Lorena", "ReviewID": "R2DQJT6HPA9LYD", "Overall": "5.0", "Content": "This is my second digital camera.The first one was olympus stylus 800 . While the night photos were the best of any other digital camera on the market, the over all photo quality was bad (plus bad auto-focus, which caused the pics to become blurry due to a very minor hand-shake).I decided to got with Panasonic's FX9 after I read professional photo review of it and saw samples at[...]Every PROS that was stated on that website is true!!!PROS:-Excellent (vivid but natural) color!-Excellent battery performance (and the power only 1300 mah!!!)-Camera is very fast in every aspect (the delay between shooting the next pic is only a second!, plus just a second start-up time)-Very sharp imagesTO THE PERSON WHO SAILD THAT O.I.S doesn't work at night:It does work perfectly when flash is onWhen you turn the flash off, during artifical home lighting, O.I.S. will not completely compensate hand-shake, but if you try to hold the camera more still, you will be amazed with results. (So, Image Stabilization on Panasonic's camera at least does 90% of the job perfectly!). If it didn't have stabilization, you wouldn't be able to shoot without flash at all.-", "Date": "February 2, 2006"}, {"Title": "Brilliant photos without Flash! (Panasonic's O.I.S. really works!)", "Author": "Nick", "ReviewID": "R33VGQ58JH8VWQ", "Overall": "5.0", "Content": "For those who are not very familiar with digital photography I must tell that Flash mode very often causes red-eye on small sized cameras (despite the anti-red eye mode is always being turned on) and unnatural skin/object color. In addition, Flash causes dark background when taking photos in night time outside.So solution seems very simple:JUST TURN THE FLASH MODE OFF!BUT HERE IS ONE NO TO IT:If shooting without Flash is occured in home electic light conditions or in outside electril light conditions, the shutter speed of the camera becomes very slow, which causes the pics to become blurry. Well this is not the case with Panasonic's FX9 Model, where Optical Image Stabilization sytem reduces bluriness caused by slow shuter speed!FX9PROS:-O.I.S. Really works! (No bluriness from hand-shake anymore!, with flash or in good day light)-Excellent screen resolution (207.000 pixels! per 2.5 inch screen)-Excellent, natural color!-True 6 megapixel sharpness-Great batterry life (thanks to new low power consuption processor)-When shooting in low light conditions with flash mode turned off, pics don't become blurry (Thanks to O.I.S. again) like on other cameras.(just remeber: O.I.S. cannot eliminate handshake completely yet, if the flash is turned off. So just try to hold the camera more still, and you will be amazed with results)-Easy to use menu systemCONS:I haven't found yet!GREAT JOB-PANASONIC AND LEICA! 5+", "Date": "January 24, 2006"}, {"Title": "Great Camera, may be best in class! You won't be sorry.", "Author": "Andy", "ReviewID": "RESPBF3A2YWE0", "Overall": "5.0", "Content": "After settling on the Nikon 7900 (7MP) I decided to go to the store and do one more run through.  I took my Treo with me (which uses SD and can view the pics) and shot several different scenes - outdoor, indoor, motion.  I could not tell the difference between the Nikon and the Panasonic.  So why did I end up with the FX9?  My wife came over and refused to even try the Nikon because it was \"ugly\".After spending some time with this camera, I can say that the speed of shot to shot and colors are two major reasons to buy this camera.  It is also sexy, and the additional features are great, image stabilization (it really works), and auto-orientation sensor are two I use all the time.This camera has once again turned the heads of my colleages and friends, which is harder to do these days since everyone has a digicam.I will post any updates next week as I give it the \"Thanksgiving trial by fire\"", "Date": "November 21, 2005"}, {"Title": "The best little d-cam on Earth today - 9/26/05", "Author": "Ben Toyoshima", "ReviewID": "RDO8H7UNFNK57", "Overall": "5.0", "Content": "Altoids-sized, rectangular cameras are a very competitive niche. What stands this camera apart is that it has both active focus assist and motion compensation. I have not seen both, in this tiny a camera, from any other manufacturer.There are three other distinctions this camera has: a slightly higher resolution than average; the cachet of the noun, Leica, engraved on the lens ring; and that it is available (in Europe) in red. I paid a little more and took a little larger risk (no US warranty) for the later. But it just looks so darn cool.Fit-and-finish are very good. The User Interface is very nice. And the point of all this all, its picture-quality what I'd always fantasized Elmarit lens would give me. It is incapable of making raw files. Nuts.Interestingly, the serious photography-only camera stores in my area do not carry Panasonics, only the big box discount stores.Things that I don't like. It doesn't fit into the World's best camera case, an empty Altoids tin like my Pentax Optios did.Cameras like this totally abstract fundamentals like f-stops, shutter-speeds, depth-of-field considerations and all those other Ansel Adams master craftsman, operational parameters. But in my dotage, I'm finding that increasingly ok and also reckon that I love the metier of image-capture more than ever. And did I mention that it can do the almost de rigueur 640x480, monaural, 30fps Quicktime video?  With active, real-time motion compensation?  660 sec/gigabyte is dear compared to MPEG-1, but it'll do.It is what it is, compromised and niched in the \"take me along\" bin. I have bigger, more \"serious\" dcams (and solid tripods) for once-in-a-lifetime or extreme photography (one of them, a Canon IS2 has less rez). Altoid-cams are to seduce to you carry as regularly as car-keys, cell phone, iPod and wallet.", "Date": "September 27, 2005"}, {"Title": "It matches my Tux!", "Author": "dkoDesign", "ReviewID": "RNJ5VUJ28GL65", "Overall": "4.0", "Content": "OK, so I won't bore you with all the research I did on choosing this small wonder. I will simply say that it came down to the Lumix DMC-FX9. and its main competition in price, size, and style is the Kodak V550. The V550 is a nice, slick camera in its own right, which uses my required SD cards, but it's 1 megapixel short and comes with the battery life of a wind-up toy (a mere 120 shots). While the V550 does get some great (and well deserved) reviews, for just a few dollars more you can get the Lumix DMC-FX9. (you can read a full review on my blog praxisworks\"dot\"net)The benefits? A cooler name? Sure. Sexy matte-black, all-metal construction? Yup. But mostly, I'm concerned about the equally small size, lower weight, and astonishing battery life (270 shots). Oh yeah, there's also the spectacular Leica lens with true image stabilization*, rapid focus (thanks to the AF assist lamp), and a generous ISO range. All this, and that extra megapixel, will make you say, \"Yum.\" when you take a really gorgeous shot and blow it up for 12×16 printing. Keep a lookout for the soon-to-be released upgrade to this gem, the Panasonic DMC-FX01K.", "Date": "March 24, 2006"}, {"Title": "Great camera...", "Author": "Elmsaafir \"Ryokojin\"", "ReviewID": "RTCUBA7AE21J5", "Overall": "5.0", "Content": "I bought this camera for a couple of reasons.  Many years ago I learned a hard lesson in Somalia by having a camera that took peculiar batteries that once dead, rendered the camera no more than a (poor) paperweight.  I still kick myself for the pictures that I missed.  The lesson learned was, bring more than one camera, and make sure that they use batteries you can get locally.  Since then, I bring at least 2, if not three.  When I was in film, a Canon EOS 1000NF plus a smaller Olympus, and one of those cheapo APS cameras that you buy from the impulse rack at Wal-Mart.Now that I've made the jump fully into digital (Canon 20D, Olympus C-750)I wanted a good, pocket sized backup camera for when I don't feel like or when it isn't appropriate to lug around the \"crew-served\" equpment.  So, the Lumix is something I've been lusting after for a few months.  It certainly fits the bill.Second, I looked at one in the returns department (returned because no strap was included) that was 90 bucks off the regular price.  I almost couldn't NOT buy it!Third, my wife got me a cool Guinness strap that was begging for something to hang off of it.The camera is great for most of the same reasons mentioned in other posts.  My favorite reasons, though are:1.  Size.  I can stick the thing in my pocket and go.2.  Capability:  6 MP means that if I extend it to the full 3x magnification, I can still get a decent long distance shot by cropping the pic later on.3.  Fast startup...no waiting for it to warm up...mush the button over, and you can be taking pictures in less than 5 seconds.4.  Incredible LCD screen.  Excellent viewing in bright sunlight, and fine for playback.5.  Enough options for some creativity.6.  Good adjustable ISO range for different light conditions, and low noise.7.  Movie mode (30 fps) is great...I got a good short video of the Emperor's address here in Japan that is really cool.  There is no zooming available in that mode, but that's not too much of a problem.A couple of things I'm not as pleased with...1.  As mentioned in other posts...included SD card is worthless.  Spend the extra dough and get a 1 GB card, and take pictures until your battery dies.2.  Small size is great, but the body is a bit slick.  i've almost dropped it a couple of times, which is scary.  It would benefit from either a ridge that would give a little more gripping surface, or the inclusion of some small rubber stick-ons that one could optionally place on the front for a bit of grip.  It's small enough to operate it one handed, but you have to be careful.3.  Would be nice to have some manual aperture and shutter speed functions.4.  Proprietary batteries...I would much prefer having the flexibility to use AA or AAAs.  But, oh well...Overall, it's a great camera, and a superb addition to my photographic family.  Each camera has it's place and it's function...the creative options and durability of the Canon, the AA batteries and 10x zoom of the Olympus, and the portability of the Panasonic.", "Date": "January 11, 2006"}, {"Title": "Great little camera", "Author": "M. Clarke", "ReviewID": "RMC03H4P62KYC", "Overall": "4.0", "Content": "I recently purchased this camera to replace an older Sony digital. As this was an emergency purchase, I made an exception and depended on the salesman's recommendation. I have to admit I was swayed by the sleek, no-nonsense black housing and Leica-branded lens.So far I'm impressed with the pictyre quality and overall ease of use. The controls are fairly intuitive although the zoom lever could be more ergonomic. The large LCD is really great compared to the postage-stamp monitor of my old camera. I also like being able to see up to 25 images at once. One big draw-back is that the battery has to be removed for charging. The battery will not charge from the camera even with the optional AC adapter. Still, the camera seems to be fairly power-efficient, so charging is less frequent than before. The memory card is also a little more fiddly than the excellent Sony Memory Stick, but these are minor annoyances.I'm looking forward to discovering all this camera's abilities over the next few weeks.", "Date": "March 4, 2006"}, {"Title": "Almost perfect", "Author": "C. Purdy", "ReviewID": "R1BKCK1YJCVV7J", "Overall": "5.0", "Content": "Small, high quality build, easy-to-follow menus, lots of features.Only problem: The USB cable (connects to PC) does NOT charge the battery. You HAVE to take the battery out to charge it.Other than that, I have absolutely no complaints.", "Date": "December 5, 2005"}, {"Title": "Nice LCD but image is too choppy in dim light", "Author": "I. Saab", "ReviewID": "R1SYH6UBZOYPUL", "Overall": "4.0", "Content": "I bough the FX9 sight unseen since it is not avaiulable in stores in my area. Bacause of this I had to rely heavily on online reviews. I was looking for a large, high resolution LCD and image stabilization. Overall, the camera has lived up to expectations with a couple of notable exceptions. The LCD image is extremely jerky/choppy in dim light. I compared it side by side with my old Canon S230 and the Canon LCD is much more fluid in dim light. This is sufficiently annoying that I may have changed my mind if I had known about it. I don't recall reading this in any of the reviews. Another watchout is the focus assist light - it is bright and piercing, like shining a laser into your subject's eyes. Can be very annoying. Best to turn it off especially if you are shooting babies. A minor concern is the poorly written (translated?) manual but that's more the rule than the exception with most cameras.Apart from these issues, the camera has performed very well. The pictures are sharp and the colors are pleasing, though a bit cool-which I like. I find that cool colors work well for skin tones but the trade-off is that outdoor shots are not as vibrant. The camera is elegant and feels solid. Image sytabilization works better in some cases than others though the results were not as dramatic as I had hoped. I found that it didn't work as well when the camera is pointing straight down, e.g. when doing copy work.In the end, the decision was between the FX9 and the Canon SD450. I am pleased with with the FX9 but I am dsappointed in the LCD performasnce in dim light.", "Date": "December 8, 2005"}, {"Title": "Highly recommended", "Author": null, "ReviewID": "R1LU48ICBU4B1L", "Overall": "4.0", "Content": "After tried 2 canon sd450, I settled with this little camera.  The first sd450 I got had a bad pixel in the LCD and one stuck pixel in the sensor.  The second one I got has good LCD but one very dim stuck pixel in the senor.  Needless to say I returned them both.FX9 is an excellent P&S; camera.  Keep in mind, this is a P&S;, so manual control is limited.  You just wanna to carry it anywhere and forget about messing with the settings.  Point and shoot! BTW, both LCD and sensor are clean without any pixel issue (for now).  Nightshoot is not fantastic but no too bad neither.  I.S. works pretty good but image is a tag soft.  Battery life is great.  You can also put a large 2gb chip in it to get more than 600 pictures.  Flash is a little weak but I preferred it than to the blinding flash from the SD450.  Pananomic mode is missing...only thing I kind of hoping the FX would have.  Great camera.", "Date": "December 12, 2005"}, {"Title": "Great Camera So Far!!", "Author": "Nouthetic Chic", "ReviewID": "ROPPU4SB0RBSX", "Overall": "5.0", "Content": "I just bought this camera because I am going to Disney next week. I have taken alot of pics so far and it has done a GREAT job!! I love the image stabilizer!! It works great! Here's the secret though...Go to Costco to buy it!! They have the best return policy!! If you don't like it for ANY reason EVER you can return it. Keep your receipt and they will give you MONEY back!! So, try it out!! If it's not for you take it back and find one that is!! But this is a great camera as far as I have seen! Also, when you buy it at Costco it comes with a 256 SD card!!!", "Date": "November 17, 2005"}, {"Title": "Great little camera, BUT ...", "Author": "Jass", "ReviewID": "R1OEUS0WZAOUQ0", "Overall": "4.0", "Content": "I used to do photography as a hobby, using a manual SLR, so I know a bit about photography.  For some time now, though, I've been taking disposables with me on vacation, because I was tired of fiddling with controls all the time.  I finally decided it was time for a digital and chose the Lumix DMC-FX9.  I'm pretty happy with it in that it's really small and beautiful, especially in black.BUT, even though I'm good with manuals, I am finding it difficult to memorize all the settings I need to take pictures that are as good as or better than those I could take with disposables.Also, I had to spend more to get a decent memory card, since the card that came with could only hold a few pictures and less video than my cell phone.  And, I think that for the price they should also include a camera case and maybe LCD protection, too.So overall, I'd say, 4 stars for the camera, 1 star for Panasonic for the chintzy packaging.", "Date": "December 14, 2005"}, {"Title": "A fashionable good looking camera, but the low light picture quality is too poor!", "Author": "Jiang Chao \"CHN\"", "ReviewID": "R2BSFSU99C7US8", "Overall": "3.0", "Content": "I got this camera as a gift this christmas to replace my old FUJI camera. Before I ask my friend to purchase it, I did tons of research, because what I concerned most is 1st picture quality; 2nd, appearance; 3rd, overall size. At first, I planned to go for the Canon SD450, however after I read many compliments from magazines, websites and consumers' reviews toward this Panasonic Lumix FX9, I decided to give this Lumix a try.On the day I received it, I first took several people portraits in the bright room, the pictures were nice. Then in the night, I took it out for testing the night shoot. The night shot picture was not that good, too dark and tons of noise, until I used 60sec exposure, the picture turn out to be acceptable.This week I took it to the LA autoshow, which all the picture were indoor shoot. Unfortunately, there was no indoor mode on this camera. I tried to use auto mode with auto flash, the pictures were totally disaster, too much noise with red blurs. After I turned off the flash, it seemed the picture is much improved. However, after I downloaded them into my computer, I find out the picture quality cannot even compare with my old FUJI. Be honest, the objects in the well lighten condition appear wonderful in the picture, e.g. the cars under spot lights, or the people under the sun light. On the other hand, all the pictures took in low light condition, the noise is just too much with tons red blurs.In addition, Lumix claims that it has imagine stabilizer, however, some of my pictures were still shaken and unclear (of course I hold the camera with one hand, but that is exactly the way how stabilizer shall work). And also, this camera is not as small as it looks in advertisment, it is still thicker than SD450 or T7, even bigger than most of today's cellphones.At last, all I can say is although this is a fashionable look  camera, I lost my confidence with Lumix brand, as it does not deliver what it promised in the advertisement, the imagine stabilizer does not work very well at all time, the indoor or low light picture quality is disaster with too much noise and red blur. Now I am planning to get another really slim camera, because if all the small cameras do not perform well in low light condition, then I shall go for a really small one(Sony or Casio) which I can put in my jeans pocket, rather than this Lumix one (nearly twice size as T7).", "Date": "January 16, 2006"}, {"Title": "Amazing tiny camera", "Author": "S. Ilkay \"Perfectionist\"", "ReviewID": "R1LEJT0ZJFKY1E", "Overall": "5.0", "Content": "In my review, I am not going to go into technical specifications in detail and repeat the material which has already been covered by other reviewers on this page. Instead, I shall talk about my experience of using this amazing product.Until I purchased Panasonic Lumix DMC-FX9K 6MP Digital Camera, I have either used Olympus or Nikon cameras and was skeptical of switching to a new brand. But I fell in love with the design the moment I saw the camera and bought it on impulse, something that I rarely do. I usually research a product before I buy. However, I am glad that I did buy it. The size of the camera is so compact that it is the size of a small cell phone and which makes it easy to carry around.Well, I have had the camera for two weeks now and the picture quality is just amazing. Of the 100 shots of friends, architecture and nature that I have taken, so far none came out unsatisfactory. They all came out looking perfect, something I have never experienced before. The lens quality is just awesome. You get a top notch Leica lens for the price of a Panasonic, what more can you ask? I am totally hooked on this camera!My only criticism of this camera is that, the replacement batteries are as expensive as the cell phone batteries, $60 plus, which may force an average user to be more economical with the usage of the camera.", "Date": "April 3, 2006"}, {"Title": "White balance on this camera sucks", "Author": "Ashish Maru \"AM\"", "ReviewID": "RVNEE6UHMYSW0", "Overall": "1.0", "Content": "I bought this camera, the anti shake is good but the auto white balance sucks, i never realized the value of the feature until i got this camera. if you take flash pictures they came out fine but then if you switch to no flash they come out very yellow, and if non flash where good then the flashed photos came out very blue...", "Date": "March 8, 2007"}, {"Title": "Best In Class!", "Author": "80sGuy", "ReviewID": "R1Z33RGV62B34T", "Overall": "4.0", "Content": "This is a very good 6MP camera! Its got a big screen w/ 207k pixel power boost so you can override the sun's reflection while previewing stored shots. The Leica lens is a major selling point and pictures shot in AUTO mode is fast and easy. Pictures taken are very sharp and accurate and the color balance is excellent! A distinct trademark of Leica's with its \"photojournalist\" quality reproduction, a magazine-like type of photos.O.I.S does help w/o using the flash and very useful in MACRO mode, however, NIGHT shots are still handicapped and no support from either level 1 or level 2 image stabilization. It's got an array of \"fixed\" scene modes for different events (14 total) but certain modes lacked ISO, flash on/off option and light source selection. Noise level is good especially when shooting at ISO 80-100. The biggest improvement over previous models are the Venus Engine PLUS design which gave the battery new life by almost 70% more than it was than the DMC-FX7! This is crucial to a 6MP camera requiring much power for storage if you use and want to fill up a massive 1GB cardThe biggest drawback was:O.I.S. DOES NOT work for 'NIGHT SCENERY' mode (only for 'NIGHT PORTRAITS' mode - short distance night shots of people or object) it automatically defaults to much higher ISO ratings in low light conditions which resulted in more 'noise' or 'grainy' picture effect. You get much better picture quality under NIGHT SCENERY mode but there is NOT an option to turn on the flash to stabilize the picture and the default setting for the flash is \"OFF\", this is when the tripod comes to play if you have one handy.This is unfortunate because I have the option of having the Flash ON/OFF feature on my Leica D-LUX camera for night shots.Pros:Leica LensDesignCompactExcellent MACRO modeO.I.S. for day w/o flashBattery LifeCons:16 MB SD Card???O.I.S. not for NIGHT scenesLimited feature adjustments for fixed modes", "Date": "January 25, 2006"}, {"Title": "date stamp", "Author": "Janie Griff", "ReviewID": "R3UJSMD1H1H4GA", "Overall": "5.0", "Content": "I'm enjoying my first digital experience with this sleek little bug.  It has the larger screen, quick start up and shutter response, as well as good battery life.  Does anyone know how to get it to stamp the date on the picture?  I prefer not to use military time and would like the format 5/8/2006.", "Date": "May 8, 2006"}, {"Title": "One of the prettiest compact cameras ever created!!!", "Author": "Audiophile", "ReviewID": "R347PG23MM51QT", "Overall": "5.0", "Content": "I've had this camera for a few years along with many other newer cameras, and it's still one of my favorites.  First and foremost, it's one of the prettiest cameras ever.  Secondly, the pictures come out very clear and detailed.  Thirdly, the build quality is second-to-none; very solid and nice.  Fourthly, it's easy to use with straight-forward layout.  And finally, it's one gorgeous, gorgeous camera!  I have a red one, btw.Since having this camera, I've had countless of other compact and DSLR cameras, most with higher numbers of pixels.  However, I kept moving on with those while keeping this one, and probably will keep it for many years to come.  Some of the higher-pixel cameras I had couldn't compare to this camera in picture quality, and most couldn't compare in build quality and looks.  That's all.", "Date": "July 2, 2009"}, {"Title": "Black Screen Problem", "Author": "P. Miele", "ReviewID": "R3L3I5L81S62F5", "Overall": "3.0", "Content": "I have had this camera since March 2006, and in February 2009 the LCD screen went black, making it unusable. I liked the camera for the most part, but I found that it often produced pictures where the subjects looked unnaturally white. There was also a problem with red eye. I tried to fix these problems by changing the settings, but I didn't really know what I was doing, and the options were not very clear. One good thing was that the battery lasted a long time before needing recharging.", "Date": "May 12, 2009"}, {"Title": "great camera i cant believe it", "Author": "Mar \"Marinera\"", "ReviewID": "R1F8WBS3Y6AILF", "Overall": "5.0", "Content": "cant believe this little camera does such a great job.i have lots and lots of cameras i this is the winner.i got this really cheap on ebay for my kids and im going to buy it for the whole family !its fast ! its very colorful pics and sharp! what else you want !i do recommend this camera.", "Date": "May 26, 2008"}, {"Title": "Great little camera", "Author": "Stuart Floyd", "ReviewID": "R18525PSXNFTQV", "Overall": "4.0", "Content": "I have had this camera for sometime and I have always had good daytime shots, nights shots are inconsistent and with adjustments in many case it is fine. It was one of the first image stablizers and it works the camera is nice and small has a good look and feel and the screen is fine.  As for a protector, all of them should come with one period, however, I am always conscious of the screen and thus have virtually no scrathes even with all the use and travel the camera has had. The 6.0mp is more than enough. Unless you are printing huge photos the 6.0 for online, web, email or 4x6 prints is just fine.", "Date": "April 23, 2008"}, {"Title": "Excellent buy", "Author": "Tony", "ReviewID": "R2JSTKM2KKYTM7", "Overall": "5.0", "Content": "Excellent digital camera for the cost. Just about 2 years now and the only problem I've found is that the dial slighly slips between playback and picture taking mode but apart from that the images are excellent. Easy to use menu and the image stabilization works great ... did a firework shot witout a tripod and it came out perfect.I've paid about the same price as it is now about 2 years ago so obviously Panasonic is doing wonders with staying power.", "Date": "October 8, 2007"}, {"Title": "Lumix FX9K Leica Lens?", "Author": "Gotglasses \"LeicaGuy\"", "ReviewID": "R169T7NLYFYG0Y", "Overall": "4.0", "Content": "As a Leica user I am very commited to the excellence of the film cameras and am skeptical of the digital wannabees. I was impressed by the Leica name on the lens and the feature list on the Panasonic brand - at a price about half the similar Leica branded camera. The size and capability of this camera compares quite favorably to the original Leica concept- a camera much smaller than the competition which yielded excellent photos. There are better cameras, but they are a lot bigger and harder to live with.  So the FX9 fits this bill - the pictures are very good, with lots of ability to experiment with settings and color interpretations.  I wish it had an optical viewfinder, but the LCD is quite usable in bright light, as well as over your head in a crowd. I doubt that the lens quality is as good as a summicron, but it is very sharp and will yield a good 11x14 print.The shutter lag is minimal so long as you pre-focus, start up is OK at around 2 seconds - not as fast as my D70 which is instantaneous and better than any film camera, but fast enough for a point and shoot.  So, as a tiny modern digital camera it is  very satisfactory and includes image stabilization which allows me to shoot handheld at 1/2 second and to have 3 frames a second for action photos, as well as good 30fps video clips. Which I never could dream of with the film camera. The video clips are interesting because they include audio and are quite sharp - much better than any Super-8mm film I ever shot years ago. I give this 4 stars only because it lacks a powerful flash and viewfinder - but then it would be a lot bigger and heavier, so maybe it is a 5 star?", "Date": "April 24, 2006"}, {"Title": "The best camera in its class.", "Author": "Irving Thalburg", "ReviewID": "R129O2KR5XGB09", "Overall": "5.0", "Content": "There are three things (in my opinion) that set this camera apart from others in its class: image stabilization, form factor, and quality of images.The image stabilization feature was one at first that I overlooked, but for me, is really the selling point on this camera.  It assures a sharp image in any low-light situation where a flash is inappropriate.  It completely compensates for any hand-shaking, or slow shutter speed.The form factor is fantastic.  The giant LCD shines in low-light situations, and is more than bright enough to see without problems during the daytime.  The camera is easy to operate with one hand.  The black finish is matte; no annoying fingerprints.  The doors on the camera are solid, not flimsy feeling.  The tripod mount screw on the bottom of the camera is actual metal, no plastic there.  And it's small!  Fits great in a back pocket.  The battery charger is compact, with a built in plug -  no separate cords.  The camera software too, is easy to navigate and straightforward.  One dedicated button to review images when shooting, really easy to delete or keep thereafter.  The life of the battery has exceeded my expectations, it's great.The quality of images are great for a subcompact digital camera on the auto settings.  Doesn't include any considerations to manually adjust f-stops, shutter-speeds, depth-of-field considerations, etc -- but if you're buying this camera, it's because of the size.  There's are means to globally adjust exposure, and plenty of profiles for specific situations.Overall a solid \"in the back pocket\" camera that has good battery life, and consistently takes reliable photos.", "Date": "October 26, 2005"}, {"Title": "Little-talked-about-details of this camera and top competitors", "Author": "Vio \"Lint\"", "ReviewID": "R3HFODRWEJ3ZQU", "Overall": "4.0", "Content": "Konica Minolta came out with a p/s camera, amazingly small, especially for 8 mega p pics.  Note: the lens is internal.  This means that the lens will be heated up by battery use, flash use, battery charging, tranfering pics to computer, and Lcd use.  Though the lens will not melt immediately, it will melt over a couple years or so of constant use.  This is why pictures may appear in lesser quality, especially in the corners of the pictures.  The Lumix by Panasonic contains an actual Leica lens, and I must note that the lens is straight from Leica (I will explain shortly).  The Leica lens extends from the camera when taking pictures, AND when transferring pics to computer.  If you were annoyed by the fact that this camera extends its lens during USB transfer, it is in proper form to do so to preserve the most precious part of the camera - the lens.  Although, Leica lenses are said to not melt even if put into fire.  Impressive.  Also, the battey of the Lumix is charged outside of the camera, again to \"follow the book\" on proper lens and circuitry preservation.  So don't be too annoyed by this if other cameras don't follow suit.  It is to their disadvantage.Let's take the Casio's.  Quite small, sleek and stylish, with much popularity.  But please note: MOST all p/s digicams use refurbished lenses.  That includes these Casio's.  The only two brands that use non-refurbished lenses that I know of are Canon and Panasonic Lumix with Leica lenses.  I fail to mention Carl Zeiss lenses on Sony cameras on purpose.  Yes, they too are non-refurbished lenses, like Canon and Leica.  However, Sony has pumped up Carl Zeiss much...I would say dangerously much.  Indeed, great lenses!...if they are coming from Zeiss directly.  The \"Zeiss\" lenses in the Cybershots (Sony's line of p/s) are simply lenses made by Sony using the Zeiss formula with Carl's permission (hence a Carl's junior?).  Nonetheless, I was not satisfied with the quality of Cybershot images that I would have expected from a real papa-Zeiss lens.  Leica is legendary in optics and optical technology since the last World War.  Journalists heavily rely on Leica for their careers.  Leica also pioneered and conquered in microscope lens technology.Image Stabilization.  Only 3 cameras that I know of have this feature (along with auto focus and other features simultaneously).  The one worth mentioning is the Canon SD###'s which seems better than the rest.  And the OIS on the Lumix seems better than the Canon's.  Unique to the Lumix, the OIS is built in to the lens, not some acrobatic trick of built in software.  On top of that, the Lumix has not just 1, but 2 different types of OIS built-in (one saves battery more than the other).  Excellent stabilty for the imperfect, involuntary muscular motions of the hand.  I.e. for slight movements, not for still nature shots from a roller coaster.Other features I neglected to mention were purposeful, and can be read up on in other reviews (wow, 3 prepositions in a row).The main contender seems to be Canon's SD550, with more mega p's, and equivalent 2.5 LCD.  My reason for giving 4 stars to Lumix is firstly for Canon's great picture quality right out of the box.  Lumix pics can be of the same quality I am looking for AFTER minor adjustments to ISO and such.  Alos, the architecture of the microchip in the Canon is slightly more advanced and efficient than the Lumix chip (oops, I spelled Also wrong).  Lastly, you will notice the pictures of the Lumix appear gritty...grainy.  Perhaps expected of Leica lenses.  An automatic matte finish if you will, but this annoys some still (ah, accidental poetry).  Looks great in black and white, and gives the appearance of photojournalism (maybe that's why them reporters prefer Leica).", "Date": "December 26, 2005"}, {"Title": "Was comparing SD500, FX9K & Fujifilm F11", "Author": "sky1975 \"SKY1976\"", "ReviewID": "R33Q4SZ98DTY8O", "Overall": "5.0", "Content": "SD500 : Great Overall : No image stabalization & more MP...proven camera .FX9K: Lecia lens, extremely sharp & natural looking pics, easy & intuitive menu, Image Stabalization works great. Some manual controls & good pics in both dim & bright light conditionsF11: From the reviews I read this is a great camera, & tons of manual controls, but since my wife will use this camera too, i needed something with above average pics on auto mode. I read reviews about how one has to know to play with this camera to get the right pics.So choose FX9K & love it.", "Date": "January 9, 2006"}, {"Title": "Great For What It Is - But Not For Me", "Author": "R. Johnson", "ReviewID": "R127Q4H9DYLTN9", "Overall": "3.0", "Content": "I received this camera without a battery.  Had to borrow a friend's battery to evaluate the camera.I was shooting RAW using a Konica-Minolta A2.  I loved that camera but it was getting too bulky to carry around.  The DMC-FX9 was supposed to be a very small, lightweight, replacement for the A2, but it just didn't work out.  Getting 8 bit JPGs instead of 16 bit RAW pictures meant I had much less \"headroom\" for editing out mistakes.  In addition, having to use the screen (as good as it is - and it is good) instead of a good EVF increased the possibility of errors, especially in bright sunlight.  As a result, I just wasn't happy with the pictures I was getting so I sent the DMC-FX9 back and am now waiting for a DMC-LX1 which isn't too much bigger and gives me the ability to shoot RAW pictures (unfortunately I also had to upgrade to CS2 to handle the RAW pictures from the LX1).I am sold on image stabilization.  I am now also sold on shooting RAW.  The DMC-FX9 is a great, small, point & shoot camera, but it is not a small replacement for an A2 shooting RAW.", "Date": "November 5, 2005"}], "ProductInfo": {"Price": "Unavailable", "Features": "6-megapixel CCD captures enough detail for photo-quality 14-by-19-inch enlargements\n3x optical zoom with Mega Optical Image Stabilization; 2.5-inch LCD display\n14 scene modes with easy-to-access help screens\nMoving-Image Mode captures VGA-size movies at 30 frames per second\nPowered by Lithium-ion battery pack (included); stores images on SD memory cards (16 MB card included)", "Name": "Panasonic Lumix DMC-FX9K 6MP Digital Camera with 3x Image Stabilized Optical Zoom (Black)", "ImgURL": "http://ecx.images-amazon.com/images/I/41SND17DQWL._SX300_.jpg", "ProductID": "B000A7XT6U"}}