{"Reviews": [{"Title": "Great Camera", "Author": "B. Bhamra", "ReviewID": "R3GCITL97LTO7X", "Overall": "5.0", "Content": "This is my second Kodak camera, my old camera had only 3x Optical Zoom, but I was looking for bigger zoom, therefore, (...)The Kodak DX6490 really surprised me on many fronts, with a 4-megapixel CCD, a high-quality Schneider-Kreuznach 10x optical zoom lens with much lower than average distortion, a capable autofocus system that works down to very low light levels, and an electronic viewfinder system that likewise works very well in dim lighting. Its exposure system spans a range of control from fully automatic to fully manual, and an external flash sync connector permits use with external flash units. According to me with the four-megapixel, 10x-zoom DX6490 though, Kodak takes a large step toward bringing their excellent color technology to the \"enthusiast\" market. Even in light of the large lens this is a compact camera, the DX6490 has an overall body design similar to a number of other long-zoom digicams on the market, with a generous handgrip on the right-hand side, balancing the large lens on the left. It definitely won't fit into your shirt pocket, but the DX6490 is small enough for larger coat pockets, purses, backpacks, etc., and comes with a neck strap and rechargeable batter and dock.Pro's:--Great photo quality and excellent colors10X optical zoom lensLarge, high resolution LCDElectronic viewfinder actually useable in low lightMany manual controlsFlash sync port for external flashHybrid AF system for low light focusingVery easy to useEasyShare system makes it very easy to share and print photosNice playback and movie modes", "Date": "October 17, 2003"}, {"Title": "Great camera with terrific zoom", "Author": "M Willi \"mwilli81\"", "ReviewID": "RUEDNMSO0OV3Q", "Overall": "4.0", "Content": "This is a great camera and my second digital/Kodak camera. I orginally owned the Kodak DC4800 3.1 megapixel with 3x zoom, it was and is still a good camera. But I found I needed something to get those close-up shots I was missing, well I found it. The setup is really easy. Load the software (remember load it first before you do anything else) onto your computer (I still run Windows with ME) just let the camera charge for while and your ready to take pictures. The manual and software guide you through everything. The camera is very intuitive and extremely easy to operate. Everything is conveniently located. The extra megapixels and zoom make taking nature shots a real joy. There are a few cons, such as I agree the picture quality is not quite as sharp as it could be, but it's still great for a 4.23 megapixel (of course the higher the megapixels the sharper the image)ProsFantastic zoom and close-up lensGreat Auto-Focus and shootEasy setup on computerCamera controls very easy to use and intuitiveLight, small size makes it very easy to hold and take picturesConsPicture not quite as sharpinternal memory not enough (that's ok you have to buy memory cards for all digital cameras)I gave the camera 4 stars because of pictures not quite so sharp as maybe it could be. There is always room for improvement but I will be hard press to find fault with this great little camera and I recommend it to anyone", "Date": "October 26, 2003"}, {"Title": "A surprise contender.", "Author": "Plastic Avatar", "ReviewID": "R7WQCSJBOPQMJ", "Overall": "5.0", "Content": "Pluses:Fantastic OS X support (the EasyShare software is very iPhoto like in execution).Huge LCD and a wonderful Electronic Viewfinder (with excellent low-light capabilities for framing shots that would otherwise be impossible with other cameras).The easiest learning curve I've ever seen for a digital camera in this price range.A thorugh and easy to follow instruction manual.A top-notch german lens and 10x optical zoom.Acceptable video recording.Hot shoe for an outboard flash.Minuses:Lack of manual focus control.Lack of TIFF support (camera is JPG only, but this probably won't matter to 99% of the users who buy this product).A little small for my hands (o.k., though I'm a big guy, I might be reaching on this one).Conclusion:I was prepared to buy an Olympus 740/750 Camedia, but, after looking over the DX6490, I was sold on the Kodak's simple design and thoughtful control layout. This model is for the person looking for the easiest digital camera to use in its price range. A great camera for my wife, who doesn't know enough about photography to miss the manual focus, but still a great camera for me- as it offers enough control over shutter speeds and aperture for tough shots.If power + ease of use is the right combination for you, you owe it to yourself to check this camera out. That said, shy away from the Canon A60/A70 series- they are hard to figure out, comparatively, plus their manuals might as well be written in Greek. -Steve(n) Marra", "Date": "November 26, 2003"}, {"Title": "DX6490: Review follow-up.", "Author": "Plastic Avatar", "ReviewID": "R19UN4KVY48OCP", "Overall": "5.0", "Content": "Now that I've had some time to use this camera more, I thought I'd throw out some observations =)I really do love this camera, and I use it often. I've taken a lot of pictures with it (about a 1,000 so far). I've printed beautiful photos taken with it on Ink Jet and Color Laser printers. I've even used it as a preview device while setting up for a lighted indoor photo shoot- thank you hot shoe. My conclusion? Money well spent.I've read some reviews that complain about the Easyshare software and the use of SD memory as the recording media, plus one reviewer says he had to return two of these cameras as defective. I'd like to address these issues based on my experience the past couple of months.I use a Mac. I'm used to a free Apple application called iPhoto. iPhoto is easy to use for both archiving, and the basic manipulation of, digital photographs. I can't speak for the PC implementation of Kodak's Easyshare software, but I've found it as easy to use as iPhoto. That's not too shabby. As to the issue of SD memory for image storage- it's really no big deal. Other manufacturers use this form factor for digital cameras and MP3 players. It's just a consumer grade storage medium. It can be a little pricier than other formats. I've seen around a 25% price difference in favor of other formats where I shop. For me, a $10-$15 price difference on a 128Megabyte chip isn't a big deal compared to a $500 outlay for the device it goes in.On defective items, I can only say it happens to the best of products. I really hate to hear that someone had an experience so opposite to mine. All you can do as a prospecive buyer is to consider the positive and negative reviews, then make a decision based on your own research. Personally, I think the odds are stacked in favor of this camera being a good product.There are always going to be people who like this camera or that camera. You might like the interface on the Kodak, but I might prefer the controls on a Nikon. I might think the blues on an Olympus are muted, and you might swear they're just right. So much lies in personal preference. I know I agonized over which camera my wife and I were going to buy for a week. I haven't had one person out of the 10 or 11 I've let use this camera complain about the interface, ergonomics, or image quality. It's not God's gift to digital photography, and it doesn't pretend to be. It is what it is- easy to use and rewarding to own.-Steve(n) Marra", "Date": "January 27, 2004"}, {"Title": "I'm No Camera Pro, But I know FUN when I see it!", "Author": "Pete Woodhead", "ReviewID": "R25FRU71EGXVBZ", "Overall": "5.0", "Content": "First, for all of you non technical folks this camera is very intuitive.  You will most likely still want to read the manual, but this is one digital camera that won't tax your patience when you take a picture.  I purchased this camera on the 9th of Nov.  It's my 4th digital camera and my 2nd digital Kodak camera.  I really love it.  Having used digital cameras in my work and personal life for about four years I knew it would be best to purchase a large memory card (256 MB) for it.  Using it for movies and pictures I knew I would need it and I was glad I bought it.  The day after purchasing the camera my wife and I went to Arizona for a week.  I had a lot of fun with this camera.  I took short movies and lots of pictures.  We love to hike in the mountains and watch sunsets and sunrises.  We have some great pictures and short movies to look at now as well.  It performs well in low light and the 10X zoom is outstanding.  The movies came out pretty well, but the sound is not real great.  With experience and by reading the manual I believe I'll do some things to improve the sound quality.  If you are more experienced camera buff You will appreciate that you can switch to manual mode and the control it affords you.  In the reviews I read I didn't see anything mentioned about the burst mode which will take up to 6 images in 2 seconds, very cool.  I found the lithion battery to have very substantial life.  Knowing digital cameras can be energy hogs I made sure to use the power saving features and turned the camera off when I wasn't using it.  I set the camera on the docking station at night to recharge and never ran out of power the during the day.  I wasn't sure I would, but I really like the docking station.  The software loaded easily and is easy to use, although very basic.  When I registered it online it also found the most recent update and asked me if I wanted it.  I download it with a click and it completed the upgrade without any problems.  So far this has been a great experience and I feel the DX6490 is a very good value at the price I paid of $499.99.  I rate it 5 stars.", "Date": "November 20, 2003"}, {"Title": "Excellent picture quality, easy to use, good battery life", "Author": "Navid", "ReviewID": "RILJ1GZ82X0O9", "Overall": "4.0", "Content": "I wanted to wait a couple of years before buying a digital camera where I would get the benefits of price reduction, features, value, and better than average (over 3.2mp) MP quality.I found the Kodak DX6490 very easy to use, and packed with features I would use, such as the MPG recording (limited to the size of your external SD card), which allows you to email clips (very cool!!).Things I like about it are the internal memory capacity of 16MB, which I haven't found on any other digital cameras in the 4.1MP range.  Good battery life, excellent picture quality outdoors, compact and fun to use, cool design, large 2.2\" LCD display (can't find that on most digital cameras), good software, 10x optical zoom, and as I mentioned before it records video clips.Battery life has been excellent and I would take quite a bit of pictures (75-120 pics at times) between docking the camera again.  However, there is no recharger aside the base (docking station) the camera comes with.  So, if you plan on going on vacation, you'll need to take it with you (power cord, base, and the USB if you're going to want to transfer your pictures to a computer).Manually controllable \"EasyShare\" is kind of an oxymoron. Generally, its feature set is useful, but it has some annoying gaps. My old PC is running on Win98, and for the most part transferring pictures via the docking station works seamlessly, however there are a few glitches such as the wait period for the card to be read and the freeze-up of your PC while the camera's i-share is being used to read the pictures on the memory card.If you have a 256mb card for instance, and you've packed the card with 300 pictures, each time you want to update the new pictures to your PC, it will read all the pictures on the card, which does take a few minutes.  This is the one thing I don't like about the Kodak DX6490 and the docking station.  I just think it is very annoying to have to wait for all 300 pictures so that you can get the most recent pictures you took to come up and be transferred to your folder.If you have a PC or a card reader then you should be ok, and again you'll be limited to the transfer/read rate of that reader.Convenient external controls provide quick and easy access to frequently used functions, such as the self-timer and the continuous-shooting mode. When you enter a mode, the camera briefly explains it on the LCD.Overall it is a good 1st time camera, and I give it an 8.5 out of 10 rating.  It could be a 10, but I think that would push it into the $699 price range.  You can buy this unit for about $420 at most retailers.  Costco wholesale warehouse sells it for $419.99 now, and 3 months ago it was selling for $469.99.  So, there is hope that the prices will drop as the technology improves.  If you're sick of it after a couple of years and you want to upgrade, you can always get rid of it here on Amazon.com, or eBay.", "Date": "March 15, 2004"}, {"Title": "Excellent Camera!", "Author": "Arthem \"arthem\"", "ReviewID": "R2VHW4XFCMOKCK", "Overall": "5.0", "Content": "Having previously bought a Kodak digital camera several years ago, I was a little reluctant to purchase another Kodak.  But we needed a new camera that was easy to use, high resolution, USB compatible, with large storage capability, and with the ability to take extreme close-ups.  The 6490's 10X optical zoom was a convincing factor, as was the price.  Prepared for disappointment, we charged it up and started taking pictures.In summary, the performance is excellent.  While the camera is a little too big to serve as a \"pocket camera\", this is the only drawback I can find.  The pop-up flash works well, the settings are easy to understand and manipulate, the macro lens selection does a great job bringing objects into focus, and the resolution is truly incredible.The only thing we haven't really tested is the ability to capture moving objects.  But for all of our detail digital imaging needs, this camera has exceeded our expectations.There is no question that when I get around to buying a digital camera for home use, this will be the one.", "Date": "October 19, 2003"}, {"Title": "Exceeded expectations", "Author": "Ed Jay", "ReviewID": "R3U76A4JUROI77", "Overall": "4.0", "Content": "I've had this camera for almost two months, purchasing it the week it was introduced. The two things that really sold me were the 10x optical zoom and the 2.2 inch lcd viewfinder. I took it to Paris in late October and was very impressed with the quality of the pics and the manual controls. It's smaller than you imagine, and the quality of the pics is better than the lcd shows. The flash is strong for a digicam and the battery life is very good. I appreciate the built in 16 mb as I use that as a backup to my 256 mb sd card. The weight of the camera was not an issue, I had it around my neck all week in Paris. Some of my pics are at a public website ... [...]I do find that it does take awhile to focus in low light, probably not any slower than other digicams. Also the lcd and evf are great in low light unlike other digicams where it is utterly useless. This is a very intuitive camera and at the same time with the manual features you will continue to improve your picture taking skills. For those that I want to print out, I take it to Costco and they charge $.19 per copy.If you set the quality at 3.2 mp, it is perfect for 4 x 6 prints with no cropping.Cons? I'd say improve the cycle time b/w pictures. That's all I can think of. There are online reviews of this camera at dcresource.com and imaging-resource.com. It's worth read these reviews, which are extremely thorough and informative.Purchase this camera and you will not regret it.", "Date": "December 6, 2003"}, {"Title": "Only 1 drawback.....", "Author": null, "ReviewID": "RDPLTLSDEGQD3", "Overall": "5.0", "Content": "And that is size.  It is small but goofy shaped.  It will fit in a large pocket but certainly not a shirt pocket....That being said, wow, what a camera.  Outstanding lens combined with a really visible digital viewfinder and display and ohhh man this is worth the $$.  This is what I love :  Integrates with XP no drivers necessary (I don't know what the complaints about driver loading are about) Really nice video mode, better than anticipated quality.  Great lens, not much noise.  Some trouble with bright white / dark backround image bruising (purple edges).  Easy to use, really easy.  TELLS ME THE F/STOP AND SHUTTER SPEED IN THE VIEWFINDER! WHOOHOO!  Lets me know when the digital zoom kicks in....Fast display & review - much faster than others.  Great colors.  Sharp pictures.  ROTATES THE PICTURE IF TAKEN IN PORTRAIT MODE...maybe all dcams have this now but thank God for it.  Fast recycle times between snaps.  Jeez, what more do I want?  Maybe I'll crack the instructions and really get to know it becuase right now I LOVE IT!", "Date": "December 1, 2003"}, {"Title": "Best all-around digital camera to date?", "Author": "Fred \"mrdata22\"", "ReviewID": "R1332RKODSLVGG", "Overall": "5.0", "Content": "PROS:4 megapixel CameraOutstanding Image Quality, thanks to theSchneider-Kreuznach Variogon 10X zoom lensElectronic Viewfinder shows full frame of actual picture (SLR-Type Viewfinder, or \"what you see is what you get\")Viewfinder automatically shifts from color to black & white to enhance ability to see the subject in low lightSecure feel with large grip allowing one handed shotsSurprisingly small, easily fits in one handAllows full left hand support under the lens for steady, clear telephoto shots.User Friendly, Intuitive controlsExcellent Pop-up flash gives outstanding coverage to 16 feetExtra large 2.2 inch LCD (Giant size)LCD is easy to see even in bright sunlight (Indoor/Outdoor LCD Display)Dioptric adjustment for variations in eyesightFull Automatic Program, or choice of Aperture and/or Shutter priority modesFast and precise Auto-focus systemChoice of automatic Portrait, Sports, Night and Video modesMacro mode to 4.7 inches in wide angle16 MB Internal memory storage, plus MMC or SD storage card capacitiesSimply and easily shares photos by email, printing, or archivingBattery good for about 430 photos before recharging.Software compatible with Windows 2000 and later, and MacCONSAverage shutter delay speedProprietary batterySoftware not compatible with Windows 98  As for the CONS, the shutter delay is common to all digital cameras and takes some getting use to.  With time, you can better anticipate shots, so your active 3-year old is still in the frame when the camera writes the photo to the memory.  As for the battery, I would prefer 4-AA batteries as they are easier to find/replace.  I have Windows 98 and simply hooked up a card reader to my PC and gave up trying to use the software that came with the camera.  I understand folks with Macs and Windows XP have no trouble with the software.CONCLUSION:This is my 3rd Digital Camera and the closest yet to my SLR cameras.  This is certainly the best digital camera I have used, with the best overall performance of any of them.  The photo quality makes you look a terrific photographer :) If you are a \"shutterbug\" who prefers to take manually controlled photos, then keep looking for a camera.  This camera is designed for people who are more interested in taking photos than learning all the technical stuff about their camera.  If you shoot a lot in auto mode, this is an excellent camera, that will also allow you to maybe later learn a little about manual adjustment through aperture versus shutter priority settings.", "Date": "March 27, 2004"}, {"Title": "Short review", "Author": "Arthas \"arthurqx641\"", "ReviewID": "R1VCZV5S4NWG1K", "Overall": "5.0", "Content": "I've owned this camera for about half a year and I've taken around 1500 pictures with it. Like many others, I did extensive reviews on digicams before I bought the Kodak DX6490 so there are a few things I expected.-Excellent 10x optical zoomThe lens are amazing in taking up closeups from far away. At around 6x and above, you will need to prop the camera on a surface or use a tripod for sharp images though.-Excellent night shot abilityThe DX6490's night focusing ability is better than most cameras due to it's hybrid focusing system. This enabled me to take very sharp images in dark places. In addition, the EVF worked very well in low-light conditions by turning into black and white and amplifying the light intensity.-Ease in software useI'm running Windows XP and I have no problems with the camera dock, which I find to be convenient as both a charge and transfer dock. The one-touch transfer works with little/no problems and the EasyShare software allows me to organize my pics easily.-Not so good fast action photographyThis camera isn't very good in capturing fast action as there is about a 1 second delay for AutoFocus to lock on. (If it's already AF, delay is around 0.3s). In addition, blurring occurs if you don't use sports mode or PASM.-Misc commentsPurple fringing is very minimal in pictures. The camera is rather big (stable yet bulky) so finding a case is a little hard. The 2.2 inch LCD is very nice(unlike some Fuji digicams I used before). The casing is plastic and the lens is a little loose (it's supposed to be). If you hook up an AC adapter directly to the camera, it won't charge the batteries. There is no full manual mode- only pseudo manual mode where the camera always controls one aspect.-Final commentsWhat I commented above are just some parts of the camera. Overall, it's worth every penny I paid for it ($400). The camera snaps very crisp and vivid photographs and is relatively easy to use.", "Date": "February 4, 2004"}, {"Title": "I am so happy with this camera.", "Author": "rick-cathy \"rick-cathy\"", "ReviewID": "RKM42GHIZOZ6H", "Overall": "5.0", "Content": "I bought a digital camera years ago, before I knew the difference between a good camera and a bad camera.I have been shopping for a GOOD dig camera for a year now. I didn't want to buy a camera, just to find out it didn't have the features I would use and need every day. Yet, I WASN'T sure exactly what those features were. I knew the resolution was important and also the mega pixels, but what about all the other options out there on the market?Then one day, while in Circuit City, my husband went to one part of the store while I went to another. I didn't realize that he was checking out THIS camera upon the reccomendation of one of his co-workers. He (also the salesmen) showed me the camera, the zoom, the screen size, and how easily it finds into the hand. Then, they showed me the SHARE button. I was sold on it! (I have yet to use the SHARE button, but am entirely happy with the camera, none the less).This camera takes pictures that make you re-live the moment. Our family went to a waterpark recently. I took over 100 pics. When I came home and displayed them as a slideshow. It took your breath away, beautiful colors. You could see every droplet of water from my children splashing.A friend of mine is a SONY SNOB. Only buys SONY products. He has a mid-range Sony dig camera (I am not sure of the meg pix or the model # of the camera). We were at the SAME event recently and exchanged pics. His were dull, sometimes fuzzy looking. But the most noticeable thing about his pics were the color. They just didn't have the clarity of the pics from my camera.I ordered the camera from Amazon, as I am a loyal customer. If you really want to know about the camera before you buy it. Do what I did, try it in the store. You won't regret it.", "Date": "July 28, 2004"}, {"Title": "You Don't Need to Use Kodak's Software", "Author": "PSG", "ReviewID": "RJ8VPWSDFDGUU", "Overall": "4.0", "Content": "Just wanted to clear up some errors in prior reviews. First, several people commented on the Kodak Software and some of its limitations.First, you do not need to use the Kodak Software except to load the drivers for the Camera/Dock. (customer from Riverside take note, you may not need to return your camera)Second, with Windows XP, once the camera is in the Easyshare Dock, you only need to push the button and camera connects to the PC as another Storage drive. (You'll see it show up on \"my computer\" as another Hard Disk Drive). Once it is connected you can use Windows XP to copy all the pictures to anywhere on your one of your disks and edit it with any photo program that supports JPEG files.", "Date": "January 3, 2004"}, {"Title": "Excellent Purchase", "Author": "Randall Moulton", "ReviewID": "RYT7YI5PD67TQ", "Overall": "5.0", "Content": "I had been looking for a digital camera for a while, and I have to say Kodak was not one of my brands to look at. However, talking to the salesperson, I was convinced. He literally told me how to do nearly everything in 15 minutes. This is one of the easiest piece of electronics I've ever owned, and it is more flexible than most other digital cameras.You can shoot in automatic mode or have the option to manually adjust the shutter (the aperture is then adjusted auto.) or manually adjust the aperture (the shutter is then adjusted auto.). There's also three settings you can use for action, portrait, or night time and the camera will automatically adjust the shutter, apeture, etc. for you.And the screen to view your photos is huge! It must be the largest one I've seen on a camera.I did take a few mintues at home to read the instructions on how to download the photos onto my computer. Everything was set in about 10 minutes and worked without a problem.I highly recommend this one. Kodak has a winner here.", "Date": "November 25, 2003"}, {"Title": "Have Had the Camera For 6 Months....", "Author": "Sunday", "ReviewID": "R1V6YWVZ6NHN5L", "Overall": "5.0", "Content": "I've had the DX6490 for 6 months now, and have taken a couple thousand shots, with no problems. No picture taking problems, no downloading problems, no printing problems, no CD burning problems, no album or tagging problems. Although Kodak's e-mail system can be slow, so I just use my MSN e-mail instead, which now sends full resolution photos.Consumer Reports rated this the #1 4MP camera of the 13 they tested, in their May 2004 issue. The only shortcoming they found was the battery life.  But I think they are badly mistaken in that part of the testing.  Especially since they stated the Sony Cyber-shot DSC-P72 took 200 more photos on a charge than this Kodak camera.  I have used that Sony camera, with both rechargeable batteries and alkaline ones.  At no time, did the batteries ever last for the entire time I wanted to take pictures.  At no time with this Kodak camera, and it's Li-Ion battery, has the battery ever run out of a charge. And I've spent far longer times shooting with this camera than the Sony.", "Date": "April 10, 2004"}, {"Title": "DX6490 an excellent choice", "Author": null, "ReviewID": "RLU245HZ2H30O", "Overall": "5.0", "Content": "I recently purchased the DX6490 camera with the Easyshare docking station. My purchase criteria was a good lens and high power optical zoom. I shoot landscapes and portraits and use a digital camera before committing to large format film. The lens, color imaging, and ergonomics of the Kodak are great. I can take macro type closeups of flowers and bring faces in with the 10X zoom lens. The camera performs flawlessly and I took many successful photos without using the manual. Downloads are a snap with the docking station. Kodak lets you send your digital files for processing on Kodak paper. The Kodak easyshare software is excellent especially if you are new to digital photography. I find myself using this camera for more and more tasks including ebay sales. I previously owned a Hewlett Packard 2.0 MP camera that was replaced three times under warranty and smashed with a hammer when the warranty ran out. I also have a Fuji 3.0 MP camera that I gave to my kids. I highly recommend the DX6490 for new users and experienced digital photographers. The 10X zoom alone is reason to buy one. I could have bought a package that includes the Kodak photo printer which usually retails for 200.00. The printer has a maximum print size of about 5 X 7 prints which is ok for snapshots but the camera is very capable of larger prints. I opted to buy the Epson Stylus RX-600 photo printer for another $100.00 that gives up to an 8 X 10 print using 6 color technology. So think about the maximum size prints you would make before committing to the Kodak bundle with printer.", "Date": "March 16, 2004"}, {"Title": "Want to shoot nature closeups?  Not with this camera....", "Author": "John A. Oathout \"RebateKing\"", "ReviewID": "R1KTL3W6FPO6HN", "Overall": "3.0", "Content": "I had the camera one day and returned it to the retailer from whence it came. (...)  I didn't take a bunch of pictures with the camera but for the most part general use image quality was excellent - but here's the reasons I gave the camera a three our of five stars. I was very disappointed with the macro capabilities on a camera of this caliber. Both my old floppy based, Sony Mavica FD-73 and my Sony TRV740 Digital8 video camera did a much better job of getting in \"I-can-see-that-honeybee-breathe\" close to the framed subject for still shots. The fact that a video camera whose obvious task is NOT taking still shots out classed a camera whose job is to do just that is inexcuseable in my opinon. Checking the manual of all the cameras confirmed my suspicions. You could get about 4 times closer with the older cameras and get a sharp image according to the self-professed specs. So if your going for detail on small subjects? - this camera isn't for you. If all you're shooting are people pics and vacation shots? For the most part you'll probably be pleased with the picture quality of this camera.  At first the camera's compact form factor was nice too - but I found my hands becoming a little cramped while holding and operating buttons and switches even over the few practice shots I took. Over an extended photo session I suspect this problem would only become worse. I think this average size guy would trade better ergonomics over the small form factor.Another gripe. It seems, at least on my unit, the cradle end of the AC plug was loosee-goosee and didn't want to stay attached.  Don't know if this was a quality control problem or not.  Finally, I found it difficult for the camera to lock-focus on a subject. Shooting the sitting cat with his constantly turning head was an excercise in frustration.  Not a problem with my other cameras at all. The Sony's autofocus system is apparently much more adept at such photographic tasks. My suggestion is to get hands-on experience with the camera if you can just to make sure that it fits both your hands and the needs of the subjects you intend to photograph.", "Date": "May 12, 2004"}, {"Title": "One of the best digital cameras out there!", "Author": "Sn2000py \"Sn2000py\"", "ReviewID": "RM8BY9M8H2BT2", "Overall": "5.0", "Content": "I chose this camera over all others as my first digital camera, and I have no regrets! One of the main reasons I bought it was for the 10X optical zoom.  I like to shoot animal and nature shots, and all other digital cameras in the price range at the time were worthless for that. Just remember to read in the manual how to turn off the digital zoom, or it will wreck all your zoom photos. Digital zooms in all cameras are nothing but worthless parlor tricks.  (And if you think you might not need a 10x zoom for the photos you take, you may want to wait for the DX7630 that is coming out later this year.  It has some outstanding features, but only a 3x optical zoom.)The DX6490 also comes with a dock, which is just very appealing to some of us. It has a Schneider-Kreuznach Variogon lens--and do remember the maxim: \"A camera is only as good as its lens.\" The lens cap is lousy, but that's a small matter to me. It uses the compact SD or MMC memory cards.  My 128MB Kodak card, with a 5 year warranty, will hold 96-280 photos! You just pop it in the camera, forget about it, and never have to buy film again! (What is there to complain about that???) The camera also uses a Li-Ion battery, which has never run out on me, and I don't do anything to save battery power. And it can be recharged at least 300 times.The Kodak EasyShare software has got to be the easiest and most useful photo software on the market. You create folder names and list e-mail addresses on your computer with the software, and then download them into the camera; then, you can mark photos before or after you take them with addresses or folder names, and as soon as you put the camera back on the dock, the photos go into the correct folders, or are ready to be e-mailed to who you want them to go to! E-mailing is simple.  You can also e-mail videos, but no one I know has a ISP who will accept them! Ordering prints of your photos online is also simple, as well as editing the pictures.  You can even do fun things like turn your photos into comic book pages or coloring book pages.Printing photos at home and burning them to CDs has also been no problem at all for me with XP on a Dell.  The Kodak software instantly recognizes my Iomega CD burner and my HP printer, and controls the whole process.  I don't even need to use the Iomega or HP software. I can burn hundreds of photos on a Verbatim DataLifePlus CD is less than 5 minutes. You just choose the photos and choose the burn speed. And printing turned out to be much easier than I thought.  You just pick your photo, pick the size you want, and pick the paper. There are 3 choices of paper--Kodak Ultima, Kodak Premium and Other.  When you choose Other, it tells you you can't use any other paper.  Nonsense! How would the software know what paper you have in your printer? I printed a nice shot last night on HP paper; I just chose Kodak Premium paper as my choice. If you're using thick paper like 10 mil., just choose Kodak Ultima. I am using Kodak Ultima, too--I highly recommend it, but use what paper you want.My prints are beautiful, my photos are beautiful, my CDs look like something that would cost a whole lot more if I had to pay someone to burn them. The Kodak DX6490 has changed my life!  It's added a lot more fun and creativity to it. And anyone who thinks Kodak does not make some outstanding digital cameras is living in the past, and choosing to do so!  Look at this camera! And go to Kodak.com and look at the DX7630!", "Date": "March 12, 2004"}, {"Title": "Best 10X Zoom Camera for Enthusiasts!", "Author": null, "ReviewID": "R1VPNMJ4ZQGSNI", "Overall": "5.0", "Content": "Really enjoying this camera! It's an upgrade to an earlier kodak digital with so many features and excellant picture quality. I did a lot of research before buying a new 4mp camera. I was looking for an advanced camera under $500 that I could still grab to take pictures of my 2 year old with.The most important feature to me is the ease of the menu. Kodak has it hands down for their menu. When going from a simple, fully auto camera or from a 35mm manual to a digital camera that offers manual (PASM), night mode, moving objects mode, movies, etc., I don't want to spend all my time fishing through a complicated menu system, I want to take the picture/video! Kodak makes it as easy as can be. Love the joystick. The movie feature is a fun bonus! The second feature is the 10x zoom! Wow! What fun!The third feature is the dock. My first digital had one and I loved it. Nothing better than charging your camera and downloading from one spot with the press of a button. You can buy a rechargable battery travel kit if you need to. Amazon offers it as do others.Works great on a Mac! Very important to me as not all companies are apple friendly.Love the large display for viewing.Make sure to get a memory card - I'd recommend a 256mb. should be enough to hold as many pictures as the battery will allow you to take at one time. I've yet to have the batter get low. Have only taken 90 pictures at one time though.Good fun! Easy to work, enjoy!", "Date": "June 14, 2004"}, {"Title": "A Perfect Balance Between Technology and Affordability!", "Author": "Travis S. Lowe", "ReviewID": "R1TNUV9KEDOJ76", "Overall": "5.0", "Content": "Although I would not consider $400+ a small amount of money, I would have to say that this camera offers a lot of bang for the buck. You do not have to be a rocket scientist to operate this camera, and even if you are a rocket scientist, it has a PASM mode just for you!!I believe that Kodak has accomplished a very user-friendly interface for the photographer to work with. The instruction booklet offers very useful tips, and using the EasyShare software is a breeze. I shopped everywhere for a camera, and the two things which I focused on were megapixels and optical zoom. With 10x optical zoom and 4 megapixels, it is exactly what you need to be a serious photographer and also a semi-serious photographer. This camera also has many other great features. It is great for traveling and has many modes which are useful in different situations (i.e. closeup, portrait, landscape, night, etc.). The video mode is particularly useful when wanting to take small clips and such. This camera also has burst mode(several frames per second), timer, and flash settings which give you several easy to use options when determining just how you want to take that perfect picture. The option to use saturated color, black and white, and sepia is also a useful aspect which allows for very classical shots. Another feature that I found to be very convenient was the tagging feature, which allows for tagging a picture to be emailed to a friend or family member when you hook the camera up to your computer. The ability to switch between the view finder and the HUGE, \"easily viewed in all lighting situations\" LCD screen was also useful.If you are looking for a seriously cool camera to wield while traveling, attending birthday parties, or even just having some fun with your friends, this is a versatile, state of the art option for a middle range price.", "Date": "April 25, 2004"}, {"Title": "Second review of this product", "Author": null, "ReviewID": "R2YHSUOA158UD3", "Overall": "4.0", "Content": "I am still very pleased with this camera and have to say I am baffled by some other reviews here.I see complaints of picture sharpness, I have photos of my cat that I can count the hairs on so I don't understand this unless you are trying to blow the image up way beyond the information capabilities of a 4 MP camera or you do not have the camera set to capture images at the highest resolution, this is a user adjustable feature.I also see complaints of fringing that in several hundred photos taken I have yet to see. Perhaps they are talking of the red shift that occurs when an object in motion is, for lack of a better explanation \"time exposed\", like in a low light situation and the shutter is slow otherwise I cannot see one image with this problem. I am also curious if this is present when the photos are viewed on a pc screen or when they are printed out. Printed images can be affected by many factors as can images on your monitor and are not always representative of the original picture information (trust me on this one I work on high end Canon CLC color copiers and between paper characteristics, color calibration on monitors and processing units, image translation and formation, what you see is not always what you get) so all I can say for sure on this account is that I have not seen it on any of my pictures.Still the only complaint I do have with this camera is the time it takes for auto focus to lock in. I am used to manual focus on 35MM cameras and this takes a little getting used to but I understand most digital cameras, other than non professional models of which I don't have experience to speak to about, suffer from this to some extent.The camera is easy enough to use pretty much right out of the box and the auto function works well in a good deal of picture taking situations but I think that if you will take the time to get to know your camera and read the manual most if not all of the complaints found in these reviews will disappear and you will very pleased with your purchase.", "Date": "February 14, 2004"}, {"Title": "Fantastic Camera!", "Author": "Elizabeth A. Walker \"speedcat\"", "ReviewID": "RJI7GJGRE9ZXG", "Overall": "5.0", "Content": "I have gushed so much about this camera, that I should hit Kodak up for a cut! Several people have either purchased one or are going to purchase one solely because of my reviews! I am probably not even using everything to it's best, but for the things I've done so far, it has been perfect! It is easy to learn and easy to use! I love the \"flower\" button! I have taken some great super close up shots of my beautiful roses! I've even used the \"sports\" button, the stop action feature. It is great! I've used it on waves and flying birds! You can't tell they are moving! I've been very pleased with the results I've gotten for the pictures I've taken. For my eye, the clarity and detail have been great. I've been impressed with the on-line tips and tutorials that Kodak offers. I've been pleased with the photos I've taken with the zoom lens, the objects were brought very close! Overall my experience has been the best and I love this camera! I highly recommend this camera! I think it is the best value for the price!", "Date": "November 29, 2003"}, {"Title": "The camera I was waiting for!", "Author": null, "ReviewID": "RDD1CI56SB7CI", "Overall": "5.0", "Content": "Simply put, the title above says it all. We have waited and waited for more features for less $$$ and it has paid off. The 10X OPTICAL zoom makes all other 3x's totally obsolete, the camera is extremely easy to use, and takes pictures with quality that shock us. The docking station that recharges the batteries while we are downloading the pics is great. The only drawback we can come up with is that the software is not as awe inspiring as the camera, it is very basic, although very easy to learn and use.", "Date": "November 12, 2003"}, {"Title": "LOVE, LOVE, LOVE this camera!", "Author": "Jenine Lewis \"baxdin\"", "ReviewID": "R1PDQ2X6RIJZWV", "Overall": "5.0", "Content": "I bought this camera shortly after the birth of my first child, which was four months ago. I am SOooooo glad I did! This was our first digital camera, so I wanted to make sure I got one that was easy to use. After reading many reviews, as well as the opinions given in Consumer Reports, I decided on this camera (along with the dock). I couldn't be happier!One of my favorite features on this camera, as compared to other cameras, is the large viewing screen--it is so much easier to tell if you like the pictures you've taken with a larger screen, and also easier to view pictures when you are outdoors.Most importantly, though, I love how simple this camera is to work. My parents have a digital camera that I still can't figure out. However, with the Kodak, I didn't even have to read the instruction manual. Everything is very self-explanatory, and using the buttons to accomplish a change in picture quality, color, etc. is a piece of cake.I didn't think I would use the feature that allows the user to take video clips, but as it turns out, I use it all the time! I have a 256 mb memory, so I can get a fairly long video out of this great camera.I really could not be happier with my purchase. If I had to find a complaint, it would be that, like all other digital cameras, it does not have a large enough memory on its own. It's not that fun to buy a nearly $500 camera, only to have to then spend more money to be able to take a decent amount of pictures. Other than that, though, I'd recommend this camera in a heartbeat!", "Date": "July 5, 2004"}, {"Title": "Excellent all around camea, from snapshot to artist", "Author": "Lee Hanson \"digiprint\"", "ReviewID": "R1CLB96P738H5Y", "Overall": "5.0", "Content": "This camera has an excellent 10x optical zoom and color that it dead on accurate.  As an Easy Share camera it is very simple to use with either a Macintosh or Windows computer.  Though Kodak provides Easy Share Software, iPhoto on Mac has flawless connection.  The quality of the images is excellent.  It does not have panoramic assist, the ability to save as TIFF or RAW, or manual white balance.  It has extraordinary image quality. The camera looks big in a pic but fits in the palm of the hand.  Very low light focusing isn't perfect, but otherwise the focus is quite good.  The 6490 is an excellent camera worth every cent.", "Date": "March 15, 2004"}, {"Title": "Do you need this much camera?", "Author": "Tuff guy", "ReviewID": "R2R4E7RRX2Z2D3", "Overall": "5.0", "Content": "This camera is phenominal. The only question you have to ask yourself is, do I need such high quality? I can take a picture of someone 100 yds away, and when I zoom in from my computer, I can tell you the color of their eyes. I went to the zoo, and took a picture of a couple owls that were far away. When I got home, I could see that they were feeding on mice. The zoom is awesome; as are all the other functions. Unfortunately, the same goes for blemishes. If you have a zit, it WILL show up. Nothing escapes the power of this camera. It photographs things your eye may not see. You think you did a good job washing the floor. Then you snap a picture of your girlfriend in the kitchen, and the camera picks up spots you missed with the mop. It is amazing.  One Downfall: The camera is about the size of a softball. You will not be able to take it anywhere, anytime. I wish I would've got something more compact, because although this camera is great, I do not need this much camera. 3MP and 3x zoom is good enough for day to day operations with friends. If you're a professional landscape or nature photographer, this is for you.", "Date": "March 13, 2004"}, {"Title": "Kodak DX6490 - Buy it Now!", "Author": "Nemo \"im_anonymous\"", "ReviewID": "R3D717RG7A3HOD", "Overall": "5.0", "Content": "This digital camera from Kodak has far exceeded my expectations. I have used Kodak and Sony Digital cameras for three years now and none of them can compare with this new model from Kodak. This camera employs the Kodak Color Science chip which is a marvel itself. I purchased a 256MB SD memory card which claims to allow you store up to 190 images at the highest quality. I took 105 pictures and then went home and docked my camera to download the pictures. Imagine my surprise when I discovered that I had only used 60MB of the available 256MB! For 105 pictures! As if that wasn't reason enough to buy this camera, with the added memory you can take a full 15 minutes of digital video. Gone are the days of the 60 second video clips.To top it off, the battery life of the Li-ion battery is amazing. I wanted to fully discharge the camera's battery before taking to use at a family gathering. In my attempt to deplete the battery, I took six 15 minute videos by placing the camera on the table and just pressing the shutter. After 90 minutes of filming (on an already partially discharged battery, the camera batery still wasn't fully discharged. I then charged the battery and used it to take over a 100 pictures WITH the flash indoors. When I was finished, I still had two of the three green status lights lit. What are you waiting for? This is the camera to buy!", "Date": "March 13, 2004"}, {"Title": "A step up from pocket digital cameras", "Author": "suso903 \"mom of 2\"", "ReviewID": "RL94EVEAPRAF8", "Overall": "4.0", "Content": "What I like very much about this camera is that it is a \"real camera\" for a tight budget. I'm 42 and don't expect my cameras to be tiny. This one is easy to hold and has enough girth to have one helluva focusing mechanism. For the money, this is a wonderful camera. Its 4.0 mp is helped substantially by the big lens; it's clearly superior over cameras with tiny lenses. When the camera focuses properly (and it doesn't always, particularly if one doesn't have time to compose the shot first), the photos are crisp and enlarge easily.Okay, now for the more annoying qualities. The software isn't great, but then again I haven't been crazy about the Powershot software either. I use the dock printer and an HP printer, and the software does work with both printers in a variety of configurations. I wish it wasn't so clunky though.The focusing could be more user friendly. Sometimes I would like to take quick shots, but it isn't easy to do that with this camera, because one has to wait until the image focuses first. This takes longer in low-light conditions. And there is, as with all low-cost digital cameras, a substantial wait time between shots. Plus there is a lag time after pressing the button, which means my young kids easily dart out of view before the click.The large display is great. Note that in bright sun, you might have to shield the display from glare to read it properly. Either that or shift to looking through the view window. This is easy to do.In my experience, all low-cost digital cameras are inferior to film cameras in terms of speed. My problem is having an imagination and tastes more commensurate with a $1,000 camera. This camera is a good value for the $420 I paid for it at Costco. I will not feel bad about giving this to my husband in a few years when I buy my digital Canon EOS.I like the dock/printer dock feature, although don't do what I did and get the camera with the dock included if you plan to get the printer dock. Not sure I should have gotten the printer dock, though. It's convenient but quite expensive to operate. My advice: buy a nice full-size HP color printer and cut the photos out yourself. The HP printers cost the same and are far more versatile!!! I have two kids and keep albums for both of them, so needless to say economy is important.Best and most economically, put the images on a CD and have a lab process them for you. The photos will be hardier and fare better in albums. The home-made prints never look as good or hold up as well. Not yet.Small gripe. Can't find a car adapter for this camera, so bought a universal adapter, which means you either buy the Li-Ion battery recharger or plug the whole camera dock into the adapter. I'm going with the recharger. We go tent camping so getting to electrity isn't always all that easy to do.I'm seriously tempted to get the telephoto lens kit (does it fit this camera?) as this camera does not take the best close-up images. The images are okay if one doesn't have journalistic expectations. Kodak also offers a rather expensive wide angle lens. I'd love to see a review of how these lens attachments work.All in all, an excellent camera for the money. The zoom and large lens are the prime reasons to get this camera. Nice flash, too. I recommend it.", "Date": "June 5, 2004"}, {"Title": "4/5", "Author": "\"alacerva\"", "ReviewID": "ROSH5EE7YB33S", "Overall": "4.0", "Content": "I've previously owned two digital cameras -- most recent being the Fuji FinePix 3800.. great camera. Unfortunately, it broke.. I believe it was due to my own error but I'm not exactly sure. In any case, I'd only had the camera for a couple of months and the store agreed to let me trade it in. They didn't even carry the Fuji brand anymore. I was forced to make a quick decision and this is what I chose.I've had it for about a week, and it is a really great camera. The LCD screen is quite a bit larger than most other camera's LCDs, and it's rather bright, too, which is a great thing. It has excellent low-light performance (something the Fuji lacked. Kodak has no problem with it.. ), when the lights are low it practically goes into night-vision and you can see most things rather clearly. Even with the flash, pictures at night don't come out as clear as pictures taken during the day or in well-lit areas. The camera has a lot of options, so it's very versatile. You can take it out with you at when you're with your friends for quick captures or you can put it is ASM mode to control pretty much everything that you have control over with an SLR. Because you have so much control, there's ALWAYS a way to get the shot that you want.. there's nothing holding you back.The Fuji was a 3.2 megapixel and the DX6490 is a 4 megapixel camera (obviously) and I find that the Fuji had much clearer, sharper, more defined photos. You can record videos with this camera which is a feature that isn't uncommon, but it IS uncommon for there not to be a time limit.. there isn't one on this camera and I think that's great.The software included is really great, it keeps you organized and lets you do simple edits to your photos (cropping, red-eye reduction, fisheye lens effect, desaturating, sepia-toning etc)All in all it's a great camera. I'm satisfied.", "Date": "December 16, 2003"}, {"Title": "Great camera, very good on the Mac", "Author": "Michael P. Oconnor \"Mike in Pittsburgh\"", "ReviewID": "REPH9ML5UF31L", "Overall": "5.0", "Content": "I use my Mac for all my digital images (I really like iPhotos)  When I got the camera I was afraid I would have to use their software to get the pictures off of the camera.  I was very happy to find that it works well with iPhotos (you only loss the use of the share button, if that is important to you, keeping all my pictures in one place was more important to me)  The images are great quality for home use.  I use the burst mode (take up to 6 pictures in less then 3 seconds) to get action shots (start taking just before the picture I want, and keep going though till after and hope for the best)  In Pasm mode you can change the shutter speed and other settings.  The LCD is good for reviewing the pictures you just took and deleting the ones you don't want to keep.  It uses the standard SD card for expanded memory (one reason I would not get a Sony since they don't support SD cards)  The 10x optical zoom is what got me to get the camera, the greatest in all the cameras I looked at that made use of the SD care standard.", "Date": "August 28, 2004"}, {"Title": "Excellent Digital Camera", "Author": "T. Hahn \"Gadget\"", "ReviewID": "R6ZK59ZHFVFG5", "Overall": "4.0", "Content": "I am a first time user of digital cameras but a long time user of 35mm cameras and I am very pleased with the performance of this camera.It produces extremely sharp pictures and although I have read about purple fringing in some other reviews I cannot see this in any photos I have taken. Some photos have blurring if there was movement in an otherwise motionless picture but that comes from using the auto feature in a low light situation and that can be easily resolved with this cameras long list of other features.The only real drawback I see, and it is kind of minor, is the auto focus. It seems to me to be a bit slow and I have several times missed a picture waiting for it to fix on a subject. I am used to a 35 mm and focusing on the subject myself so this is a bit strange for me. I have also noticed that it will sometimes fix on something other than what you are aiming for but again you can change the focus point to some degree too and this may result in better focusing and less lost pictures.Overall I am quite pleased with this camera and the pictures that it produces and also you can use the pictures with any other editing software as long as it supports jpeg images and you can save the images from your camera in the same ppi that they were originally taken, someone wrote here that all pictures were saved at 72 dpi, pictures are saved in ppi ( pixels per inch ) and printed in dpi ( dots per inch ) and you can change the resolution on the camera and your printer so you should check this and you can also check this by looking at the properties for each picture and it will show you the picture size 2304 x 1728 for example.Anyway enough talk this is a good camera and it takes really good pictures but I do suggest you read the manual.", "Date": "January 1, 2004"}, {"Title": "Another Great Kodak", "Author": "Joseph A Henry", "ReviewID": "ROUUU0S73DD9K", "Overall": "5.0", "Content": "This is my second Kodak and I love it as much as I did my old DC290 when I first got it (which was a lot). The Zoom is awesome, as everyone here has already said, and the colors are vivid and vibrant. The camera has a great feel to it and fits my hand nicely. One of the main reasons I wanted a new camera was so that I could take nice macro shots (close-ups). This camera delivers. I also really wanted a camera that could \"process\" shots quicker than my DC290. The camera also delivers in this respect. I've tried to take pictures fast enough to make the camera pause but have been unable to do so.I love this camera. When I decided to start looking at a new camera I read Kodak's press release on this one and decided to wait on a purchase until it came out. Then I read all the reviews I could and compared them to the other camera I was considering, the Fujifilm S5000, and decided I'd stick with Kodak. I'm very happy with my decision. As for drivers, well if you use Mac OS X, you don't have to worry about them. Plug the camera into an available USB port and it \"just works\".", "Date": "December 27, 2003"}, {"Title": "Handy Little Camera, GREAT zoom and Good Pictures, BUT....", "Author": "J. Barbee", "ReviewID": "RN9DA26AH1J4O", "Overall": "4.0", "Content": "After exhaustive research of specs. and reviews (an educational process in itself).  I decided to purchase the DX6490 over the 5-6 MP Olympus and Nikon cameras.  Why?  Because the 10x zoom and highly rated ease of use appealed to me, an intermediate user without professional aspirations.  After I shopped and received it I found the camera easy to use to take pictures.  However, I found that the software provided and the manual (nothing much useful about the software) were not useful in transferring the pictures to either Mac nor PC.  I found the camera dock a silly sort of doo-dad that took up extra space without much utility.  The frustrations I have with the camera are two:1) when the AC-DC power source is plugged into the camera (without the dock) it does NOT charge the Li-Ion battery!??  So the docked camera (turned off) is the only way to charge the battery without the use of a separate batter charger (extra).  A but ridiculous.2) The camera accepts ONLY SD (memory) cards, NGO Microdrives or SmartMedia, etc. .  Again, a little silly.  I get the impression that the camera was designed in two or three different rooms simultaneously, with no communication between or among them.One other nice-to-have on this chunky little camera would be a better ergonomic design in order to handle it:  to hold it in your right hand and take pictures requires that you hold it (primarily) with your thumb and middle finger while you operate the shutter with your index finger.  The problem with that is in case you want to use that great (and it is great) 10x zoom, you have to use either your thumb or index finger (although using the index finger for that is pretty clumsy)  If they had put the zoom control where the jog dial is, it would have been a lot easier.That LCD display and the Electronic View Finder are VERY nice.  The LCD is about the biggest one on any digital camera.  the EVF is great even on really snowy bright days (even I can use it well despite my visual impairments).So I still like the chunky little bugger a LOT, but be prepared to put in some time online for the software mess and buy the additional battery charger and batteries.  Buy a case that will accommodate the camera dock (although I would like to take it apart and reduce it into a simple plug in.  Just in case the dock connection on the bottom of the camera turns out to be a problem (gets dirty and shorts out or gums up), get an extended warranty.", "Date": "January 26, 2004"}, {"Title": "Great for Outdoor Photography, Questionable indoors.", "Author": "Amazon Customer", "ReviewID": "R1GQCPHIY5BHF8", "Overall": "3.0", "Content": "I have owned this camera for nearly 2 years now and I can honestly say that it is a good camera for general use but with a few caveats.If you are taking outdoor photographs it is a fantastic camera. The 10x optical zoom is great until you start to reach the outer fringes then you begin to see a noticeable drop off in sharpness. The digital zoom is useless in my opinion.The real issue with this camera comes when using it in low light or night situations. Even at ISO 800 and manual exposure the pictures come out less than acceptable. If you do not use a tripod, look for substantial blurring of your photographs. Downloading and using Photoshop CS2 did not help.I just returned from 3 weeks in Italy and after missing some shots in low light situations I am now convinced I need to upgrade. The camera just would not take the pictures no matter what I tried. If you are considering this camera for a once in a lifetime vacation or for any situation where low light pictures will be important you may want to consider other options.", "Date": "January 24, 2006"}, {"Title": "I finally have a grownup camera!", "Author": null, "ReviewID": "RCX57T9UZB68V", "Overall": "5.0", "Content": "I lucked out on the deal of the century at my local Office Depot 2 weeks ago.  OD decided to phase out their Kodak digital camera stock, and I found one 6490 WITH dock marked down to $219, with a $50 rebate to boot - unbelievable!  Yes, it was brand new, in a sealed box.  Anyway, I LOVE this camera.  I had a 2.1 MP Fuji which I really liked, but hated the 3x optical zoom - far away shots looked, well, far away!  The 10x zoom on the Kodak is unreal.  The pictures are so crisp and clear that if you are taking pictures in your house, you had better dust first!  It takes a little time to master a steady hand when taking zoom shots, or else they turn out blurry.  The 6490 also takes great video - but you have to remember to turn the autofocus off or else you end up with an annoying clicking noise in your video.  The battery life is great - I've taken innumerable test shots and videos and have yet to run the battery down.  All in all, I'm incredibly pleased with this camera.  Now I just need to take another vacation so I can take some new photos!", "Date": "July 1, 2004"}, {"Title": "BUY IT!!  You won't be sorry...", "Author": "Pat Shaw", "ReviewID": "R1CEA3D56J4JR6", "Overall": "5.0", "Content": "Am a professional photographer and, until now, have used only high-end 35mm and medium-format cameras. Thought I better get into the 'digital age' now or be square. So, after days of researching 'affordable' digitals, I decided to buy the Kodak DX6490. (Will purchase a Canon EOS 10D, Canon EOS-1 Ds, or Nikon D70 when the prices come down. The high-end digitals can cost up to $8000 and more. Good thing the ones I like aren't over $3000. lol) Was amazed with the quality of the lens on the Kodak DX6490 and with the results, of course. Was surprised that the camera's built-in flash could reach 16 feet.  Usually they only reach 10 feet (if  you're lucky).  If you're a major shutterbug as I am, would suggest investing in two 256MB memory cards. Or, if you're not as obsessed, get one 256MB and one 128MB. If you didn't get a battery charger in your package, consider getting one...even if you have the Dock 6000. Doesn't hurt to always be prepared so you don't lose a crucial shot. Without hesitation, I strongly give the Kodak DX6490 two thumbs up. Think it's the best of its kind (pricewise) on the market today. And believe me, I have researched them all!!!! Hope you make a wise decision. Glad I did.", "Date": "June 17, 2004"}, {"Title": "Great Camera", "Author": "KRASSEL", "ReviewID": "R2Y0SMUETT0XFO", "Overall": "5.0", "Content": "My 35mm Fujica is 35 yrs old and our Minolta 35mm isn't much younger. With all the differant camera's on the market now, it's hard to make a decision without a lot of research. The customer reviews on this site and a couple others are excellent tools for the novice. We decided to not limit ourselves to one of the \"simple\" inexpensive models, but to buy a good camera with features we would use. After narrowing the field to 4 differant cameras our decision was based on reviews and going out and handling the differant models. We chose the Kodak DX6490 for a couple of reasons. First the large view screen, it's almost twice the size of most of the screens on other cameras we looked at, and its color and clarity is remarkable. The camera, while it looks a little strange, fits comfortably in the hand and the controls most commonly used are easily accessible without a lot of fumbling around. The 10x optical zoom is of course a big plus, and the 3x digital zoom is just icing on the cake. The flash is very good and we especially like the red-eye feature, it really works. The manual is very good, with lots of pictures and diagrams and arrows pointing at the differant controls, and for us technology challenged individuals that is a big plus.We have had the camera for only a short time, but have taken quite a few pictures, getting familiar with the use of the controls and lcd display. Hard to adjust to a sreen after so many years of looking thru a view finder. Of course you have the option of using the electronic view finder also.One of the features we really appreciate is the \"sport\" feature. It allows you to take stop action pics. We travel a lot on our Harley and take a lot of pictures while going down the road. This feature enables us to do that with this camera. We had been told in the past that digitals were not the best choice for this activity, but this one really does the trick, even close shots of our riding companions come out sharp and clear. The \"burst\" mode also does a great job while moving.As another reviewer commented, we added a 256mb memory card and now have the capacity to take over 200 pics at highest resolution, using it and the internal memory as well. Thats a lot of pic's. We will probably get a spare 256mb for long trips, when we do not have access to our computer.The camera dock that came with the camera is very easy to hook up and use. We really like the one button transfer and I have found that I can even use it with several of my other photo programs, downloading directly to the program I want to use.We had never done video's before, but this little camera does a pretty good job. The sound is a little sub par, but not bad considering how small the microphone is. There is a learning curve on how to smoothly move the camera while \"filming\", so you don't get that choppy motion, but that will come with practice.This camera has too many features to discuss em all in 1000 words or less, so I've tried to touch on the one's that we commonly use and were most impressed with. Just the fact that we can now take excellant digital photo's while moving down the highway is worth the money spent.I have and will reccommend this camera to all my friends and family as a keeper. May have to get another, so I don't have to fight \"whats her name\" for camera time. Buy it, you'll like it.'NUFF SAID.AN UPDATE...We've had the camera over a month now and are still very pleased with it. As several other reviewers have noted you do not need to use the easyshare software. We have it completely installed on one of our computers but only installed drivers on the other. Actually find it easier to use without the easyshare software. I already have several photo programs that are do a better job of manipulating photo's and are actually easier to use. Still a great camera and recommend it to everyone.", "Date": "December 19, 2003"}, {"Title": "Test it, test it, test it.", "Author": null, "ReviewID": "R3O21II1S66G1T", "Overall": "3.0", "Content": "I looked and looked and settled on the Kodak DX 6490.  My first few days of use went fine, but then into the first week I began to have a problem with the shutter release button. After use it sounded like a connection was shorting and it did not function properly.  I returned it to CC and they agreed to replace it.  I had to wait a few weeks until a new shipment came in.I took the replacement home and on the second day of trial I could not review the pictures as I took them and when I tried to turn the camera off it would not turn off.  I had to remove the battery and put it back in to reset. This did not solve the problem so back it went and I received a refund...I was not going to try it again.  My first camera was mfg in Japan and the second was made in China.  With these early problems I was not about to gamble on its long term service so I am once again looking.If you purchase one make sure you give it a complete test while you still have the opportunity to return it.  CC was great and I would not hesitate purchasing from them again....but not a Kodak", "Date": "January 15, 2004"}, {"Title": "Love this camera.", "Author": null, "ReviewID": "R2D7BXA0HLTKS1", "Overall": "5.0", "Content": "This is an excellent camera.It fits well in the hand and is lightweight in my backpack.There are a few things you should know before you start: learn to use the autofocus properly. (look for the green dot) Some folks have posted they can't get it to focus, but I suspect they never bothered to learn HOW to focus. It's not hard, but you gotta look for the green dot.It's a pretty fast camera. I turned off some of the options, like Quickview, which speeds cycling time.I used it intensely for a week on vacation without recharging...did lots of slideshow reviews, too, and never needed the spare battery I picked up. I've had Ofoto print 20\"x30\" posters and they looks crisp and fabulous.", "Date": "April 25, 2004"}, {"Title": "Excellent Camera!!!", "Author": null, "ReviewID": "R3V3RETD0TY04M", "Overall": "5.0", "Content": "I got this camera for Christmas and I have to say this is one of the best gifts I've ever gotten. It has a very sleek design and the picture quality is great. As mentioned before, it's not a pocket sized digital camera, so if that's what you're looking for this won't be for you. But, if you are looking for a full size digital camera with plenty of possible accessories to offer, you can't go wrong with this camera. The Schneider-Kreuznach Variogon optics are very impressive, to say the least. And the software package that comes with the camera is very good as well, but I did have a problem installing it on one of my computer systems. There seems to be a problem with it and the Windows File Protection feature. This has been the only draw back for me so far. There is a fix for it, but it required some work for me to find it. I still give the camera 5 stars and I'm glad I got it...", "Date": "February 4, 2004"}, {"Title": "Good but needs improvement", "Author": null, "ReviewID": "R1XI8BRJKWDWQG", "Overall": "4.0", "Content": "I bought my EasyShare 6490 in Jan. 04 and took it with me overseas to document the humanitarian work we were to do in Iraq.  The camera is handy and easy to use.  But it does have a couple of un-handy aspects: When you use the AC adapter plug directly into the camera, it does NIOT charge the battery.  You have to take the battery out to charge it.  The dock is extra baggage and is not useful.  The button that changes the viewing from digital screen display to viewfinder is not usable with one-hand operation -- it requires using the left hand to push it.  It would be handier if the button were in reach of the right hand that holds  the camera and shoots the picture.  the dial mechanism for turning on the camera and sets the exposure setting is not very handy to use quickly when shooting.The software is a major pain.  It does not store Albms as separate files for easy access and they must be accessed via the EasyShare software.  The software has no utility for converting groups of pictures into email sendable size.  And it is not very intuitive to use.Also, it would be nice in the camera accepted more than one format of memory card (SD).  That prevents use of new microdrives and other memory formats.That having been said, this is a good little camera and it takes good pictures.  I like its chunky shape (about the size and shape of a large fist).  And it is sturdy without being heavy.  You will never put this camera in your back pocket and sit on it!  I like the big display screen and am glad that the screen is fixed and does not swivel or tilt.", "Date": "June 12, 2004"}, {"Title": "EasyShare is #1", "Author": "jeff texada", "ReviewID": "R3ELZA2S33WIXF", "Overall": "5.0", "Content": "After 5 years of owning a Sony Mavicon, I decided to upgrade to the KodakDX6490 EasyShare Camera.  Ironically, the new camera costs the same as what i paid for the Sony 5 years ago.  I have a landscaping company and have used a digital camera almost daily.  I bought the PrinterDock 6000 as an option and have enjoyed it also.  My printer is an HP932C which by no means isphoto quality, but I am truly amazed at the quality of the prints even on that printer.  I am very pleased with the ease of use and the simple fact of just putting the camera on the dock and pressing one button to transfer.  Emailing is also just as simple.  I would suggest the purchase of this camera to anyone and I have.  The camera comes with the standard dock which transfers pictures as well, but I just wanted the 4X6 printerdock 6000 as well.  The camera has 16MB of internal memory which allows approximately 22 pictures, but I purchased the 256K card which allows around 190 pictures....VERY pleasedwith my purchase.", "Date": "December 16, 2003"}, {"Title": "Best for the Money I have seen", "Author": "Rick H. \"hhcomp6\"", "ReviewID": "R2PVC6MWF2SZ9E", "Overall": "5.0", "Content": "I have had 2 other cheap digital cameras before that took pretty good pictures of things I sold on ebay and some outside scenery, but this new Kodak DX 6490 makes the other cameras I had look so bad it is unbelievable. This 6490 is very easy to work and does everything that most people would want in a picture. It does things that I couldn't even think of doing with my other cameras. If I had to say anything bad about it I guess it would be the size of it, but that really doesn't make any difference to me as I was used to carrying around a 35m for quite a long time befoe this new Kodak. The other thing is if you get a memory card for it you can take many many pictures and then just take the card out and run into a Walmart or some other place that has the picture developing equipment for the little memory cards and have your prints made in 15 or so min's. and you can pick the ones you want to print, and they come out looking better than any 35m I have had. Buy one you won't be disappointed.", "Date": "June 28, 2004"}, {"Title": "The essential quality one needs", "Author": "Antonio Nunes", "ReviewID": "R1AGNHB0DP6QMD", "Overall": "5.0", "Content": "In short this camera takes excellent pictures. The professional Kodak printing Kiosks seem to be perfectly suited for the machine and the 10x15 photos print great with excellent definition and colour fidelity.I have used some other high-end cameras and none; none got better-printed pictures to a size up to 15x20 cm.Isn't this great for a few hundred bucks?", "Date": "May 12, 2004"}, {"Title": "I love this camera", "Author": "W. Alsing \"cozaar\"", "ReviewID": "RDORJ0B5470ZP", "Overall": "5.0", "Content": "I am extremely pleased with this camera. It takes excellent pictures, is light and well built and has a host of great features. The 10x optical zoom is very handy for shots you would never get otherwise. The ability to output slide shows to a television has proven to be a great way to review your shots while in a hotel room on trips. After hundreds of photos it has had no problems and I'm still exploring all it's capabilities. My wife liked it so much she bought a second one for herself.", "Date": "April 26, 2004"}, {"Title": "Great camera...excellent for novices", "Author": "Katie Kilmer", "ReviewID": "R1SZZ1HQBASYRT", "Overall": "5.0", "Content": "Ready to purchase my first digital camera...but what to buy?  Fortunately, a friend recommended the Kodak EasyShare DX6490.  The camera takes amazingly high-quality photos, is reasonably priced, beginners or the technologically challenged will find it easy to use, and it's small enough to not be a burden when travelling.  Kodak makes it easy, with an included software package installed on my computer, to order prints of my photos directly from Kodak...and the docking station makes it a breeze to download my photos from camera to computer...and easier still to e-mail them to friends and family.  Couldn't be more delighted...", "Date": "April 21, 2004"}, {"Title": "Great camera", "Author": null, "ReviewID": "R29G97Q7SMM60D", "Overall": "4.0", "Content": "Have had this camera for about 3 months now.  Have taken over 500 photos with it.  I'm very happy with the picture quality.  I have my prints printed thru Ofoto, a Kodak company.  Prints are very clear and crisp. Camera is easy to use.  Software and uploading on the camera dock are all very user friendly.  My favorite things about this camera are the large LCD screen and the 10X zoom.  I'm no pro so I definitely haven't used every feature...most shots I've taken have been in Auto mode or the Sport/Action.  I've taken a few with the Landscape and Portrait modes.  Flash is great - pictures come out fine in low light.I really don't have any complaints about this camera except for maybe the delay in between shots.  I've tried the burst mode and the pictures don't come out as clear.I like the large size of the camera.  I've taken pictures on friend's cameras that are the size of an Altoids tin and b/c it was so light in weight my hand shook each time I snapped a picture causing the shot to be all blurry.  I think a camera needs a little size and weight to it.  Rarely do I get blurry shots with this camera.I definitely recommend this camera - it's worth every penny!", "Date": "March 9, 2004"}, {"Title": "Terrific camera for the price!", "Author": null, "ReviewID": "R32N3JS7OVXQY5", "Overall": "5.0", "Content": "Top notch zoom at 10x optical.  Very easy to use.  Not much to learn from manual, as features are so easy, any novice will find this camera a breeze.  Autofocus struggles to capture intended target, but for the most part, performs very well.  Camera dock makes uploading pics to computer a snap.  All together, good quality product, indicative of Kodak, while offering top features, and easy to use functionality.  Don't wait.  Get this one!", "Date": "December 11, 2003"}, {"Title": "Quality at a reasonable price.", "Author": null, "ReviewID": "R3GOMJYA6AMXDT", "Overall": "5.0", "Content": "This is a simple review. The camera has everything I hoped for. Decent flash for a digitial camera, 4 mega pixels creating great photos, Great optical zoom, and under $ 500. bucks. What else can you ask for at this point of the game ?", "Date": "December 10, 2003"}, {"Title": "A wonderful camera", "Author": "Janie Midgley \"Fabric Artist and Designer\"", "ReviewID": "R2SUOS0PUYU8W4", "Overall": "5.0", "Content": "I am not a photographer by profession, but a Costume Designer and Author.  That said, this camera is absolutely perfect for my work.  I use it for the pictures for my web site and my latest book.  I love the fact that I can take very close close-ups, great for the 'How to' books I write.I'm still learning all that it will do, but I love it already!  This is my second digital camera and my second Kodak digital & I couldn't be happier.", "Date": "June 27, 2004"}, {"Title": "Great Camera for First Time Digital User", "Author": null, "ReviewID": "R1SL9603KBP3HV", "Overall": "5.0", "Content": "This is my first digital camera.  I thought for sure that I would stay away from Kodak and go with the Olympus.  However, after reading other reviews, I thought that the Kodak might be a better fit for the beginner.  Sure enough, it is very easy to master.  Reading the manual won't take long and will get you going even quicker.The EasyShare software is very easy to use for editing.  The only problem I have is that is doesn't recognize my particular CD-RW drive and therefore I can't burn CD's directly from the Kodak software.  I am able to get around this problem by using the HP Photo software installed on my Dell computer.  You can check for compatiblity on the Kodak web site.The Camera dock is a great idea.  You'll always know where your camera is and it will always be charged.Bottom line - if you are looking for more quality optical zoom and want bells and whistles, this is a great camera.", "Date": "January 15, 2004"}, {"Title": "I Like this camera", "Author": "E. Montez \"glass crazy\"", "ReviewID": "R2MQGV5C81R68A", "Overall": "3.0", "Content": "I had a Kodak camera before and really liked the ease of use.  I was looking for something with a better optical zoom and this camera delivers.  I opted for less MP to get a better zoom and it was worth it.  There is a trick to taking a good picture you have to point tap the button wait for it to focus and then snap the picture.  So if you need to take a picture fast it will probably come out a little fuzzy.  I have 128SD card and it holds about 180 high resolution images.", "Date": "May 30, 2004"}, {"Title": "In a word, its great!", "Author": "Carl G", "ReviewID": "R8UZSEBTXL2RN", "Overall": "5.0", "Content": "I've had this camera for almost a month now, and I'm lovin' it. The only problems I've had have been with the EasyShare software that comes with it (cryptic error messages; poor integration with oFoto), but I haven't had any problems whatsoever with the camera itself. I'm convinced that there isn't any picture you can't take successfully with this camera. The viewfinder is awesome, the menu driven UI is extremely intuitive (great for techno-phobes), the manual mode gives you complete freedom to be creative (great for techno-savvy), the built in memory means you can use this right out of the box, and the picture quality is fabulous. One knock against the system is that you need to charge the battery while its in the camera which means you can't use one battery while charging another. Kodak does make a seperate device for charging the battery and its not too expensive; it would have been nice if they included that as part of the system.In short, this camera is great and I would recommend it to anyone. Kodak's got a winner with this one.", "Date": "April 20, 2004"}, {"Title": "Hands-down jewel of a camera.", "Author": "Lee Hanson \"digiprint\"", "ReviewID": "R3UM01PHLN1G6F", "Overall": "5.0", "Content": "The 6490 is a compact jewel of a camera that will be simple enough for the beginner and robust enough for the serious craftsperson. It sports a wonderful 10X optical zoom and multiple focusing options.  There is no manual focus, but the autofocus is quite accurate and quick.  Color rendition is the best I have seen.  It outdoes my Nikon 4500 in color accuracy.  The built-in flash produces beautiful skin tones with none of the frequent blue or cyan casts so often seen in digital cameras. Though 4 megapixels isn't the maximum now, this is the best under $500 camera model I have found. I own a Canon 3 megapixel camera, the Kodak 3400, the Kodak 5000,  and the Nikon 4500 cameras.  The Kodak 6490 has quickly become my camera of choice.  My only quibble is that it uses SD cards and I have gigabytes in Compact Flash cards.  But, even though I have to buy new cards, this was a worthwile purchase.", "Date": "March 8, 2004"}, {"Title": "great camera", "Author": "sam bradley", "ReviewID": "RCJ624YN5JTNU", "Overall": "5.0", "Content": "my review is short and sweet. the dx6490 is my 3rd digtal camera and is by far the best camera for the money. i am 100% satisfied with it. i recomend it to anyone who likes great pictures from a simple to use camera.", "Date": "December 26, 2003"}, {"Title": "Old-time camera guy finds heaven!", "Author": "Greenwich Villager \"Manhattan Montanan\"", "ReviewID": "RQNLBGS4U7896", "Overall": "5.0", "Content": "Over 45 years of picture taking with Nikons, Noritas, Speed Graflex varieties, Mamaiya and other great cameras for their day, this is the sweetest camera yet.  The 10x zoom is razor sharp, and even when the digital multiplier makes it 30x, it is still sharp and hand-holdable -- both of which surprised me.  The layout/design of the camera is so perfect I marvel over it yet, after months of use.  Even the lens cap is engineered!  It has no filter ring, but all that and more can be done on the computer.  One never adjusts the camera to B/W or whatever -- shoot in full color and then \"filter\" or go to sepia or whatever in the digital darkroom of your computer. It takes wonderful photos under all conditions and has all the manual controls I'm not only used to from wet-photography, but which I'm glad to be done with.  \"Auto\" works for almost all circumstances.  The flash is amazing. Beautiful close-ups of small items are best done by sitting back 4 or 5 feet, zooming in, and using the flash.  I couldn't believe how it works! The camera fits into the hand and all controls are perfectly placed.  Again, after using cameras for nearly a half century, this one is the camera perfected in every way.  It lacks a cable release socket for the shutter, but that means nothing--when did any of us last use one? It has everything else, and more.  I think that in the State of Massachussets, I could marry this camera but I'm scared of what our kids would look like.  Anyway, I couldn't recommend it any more highly.", "Date": "December 22, 2003"}, {"Title": "Im very impressed with this camera", "Author": "Jojo S.", "ReviewID": "R1G74FGS08Z7WU", "Overall": "5.0", "Content": "it took me almost a year to research one of the best digital camera available in the market comparing features and user's comments based in different forums and reviews... by far, the kodak dx6490 is the best value for money can buy... dont forget to buy extra memory card and kodak camera bag (i bought medium size)...", "Date": "February 23, 2004"}, {"Title": "Great Digital Camera!", "Author": "\"thedr13\"", "ReviewID": "RADU7BLJPLZZK", "Overall": "5.0", "Content": "This is one digicam that takes pro quality photos. I've used it for four months now and I do not have any complaints.  The camera is easy to use and with the camera dock, that comes with it, download pictures to your computer with one touch of a button.  It is not a battery hog like other digital cameras I've owned. I would highly recommend this digicam.", "Date": "March 26, 2004"}, {"Title": "Great Camera", "Author": "Eric A Alexander", "ReviewID": "R1J1MD7X227WV8", "Overall": "5.0", "Content": "This is by far one of the best camera's that's out there. ALthough one draw back may be that it's price, you do get your money's worth certainly I feel. WIth a 10x optical zoom it's perfect for things that are so far away.It's big in size which is nice because i've seen cameras that are small and they have a tiny tiny lcd screen which is difficult when your trying to view what you shot. I myself enjoy this camera quite well. It has a movie mode that is relativitly decent to use and the quality is quite impressive considering that this is not a video camera (digital). Plenty of storage for taking pictures with the memory card that you can buy. It's a lso great quality Photos did I mention that?. Do a great favor for yoruself and go pick up this camera you won't be sorry.", "Date": "April 1, 2004"}, {"Title": "Naiiccceeee.......", "Author": "rejedejo", "ReviewID": "R2VM0JEKL27I9W", "Overall": "5.0", "Content": "This camera is so easy to use, all these options and I can find em all easily. (I think)  Way to go Kodak.Very good low light capability, with an infrared viewfinder that lights up as it gets darker, so you don't need a real glass one.  I like to take night pictures without flash if possible and it just doesn't work without a regular viewfinder or without this feature.  Real buttons for the main functions, no wading through menus, like preview that picture you just took and then delete it or zoom in on it or pan it.  The flash comes on with a flip-up or the flash or goes off with a click-shut.  The user interface on this camera is A+.  Very intuitive, very good.I just took it out of the box, I'll have to get back with quality details.", "Date": "February 5, 2004"}, {"Title": "Great camera, but a little bulky because of the zoom lens.", "Author": null, "ReviewID": "R35YALEXSTNMHL", "Overall": "4.0", "Content": "Pretty much every thing has been said on this camera in the older reviews. My recommendation is simple:If you want a camera that has great zoom capabilities, a big LCD and want to stay under $500.00, you'll be more than happy with this camera. If you don't care for those features, go with something that's smaller. (The 10x zoom lens is the reason that this camera is bulkier than other cameras with less zoom. I believe that, for the ammount of zoom, it is still incredibly small. But once again, if this isn't important to you, you'd probably be happier with a camera that is smaller and a little more portable.)", "Date": "December 23, 2003"}, {"Title": "Great Camera", "Author": "ajc1", "ReviewID": "R36E9B9PLODAI5", "Overall": "5.0", "Content": "Being photography is a hobby of mine I really enjoy picture taking. After many years I still use my Canon 35mm, which still works great. Doing a lot of camping & hiking I was looking for something where I didn't have to lug around all of my multiple lenses & stuff for the Canon. More of a one camera fits all situation. After much research I decided on the Kodak 6490 camera, which in the end am very happy I did. The problem with digital SLA cameras would put me right back in the same situation with dealing with dealing with multiple lenses & flashes. I've had this camera for over two years. It has worked great since day one. About the only thing I don't like on the camera is the on switch, which is a round button, which you must turn. Sometimes in colder weather it has a tendency to be hard to turn. As for the camera itself the 10x lens is great. For those who didn't know Kodak was one of the first to come out with 10-12x lenses. It allows you to zoom in very well from a distance, I was quite surprised. Very comparable to my 250-500 mm Canon lens. The built in flash is good for about 25 ft. I'm not fond of the Kodak software but then again I use another program for my pictures. At the time when I bough my camera Kodak had a bug in the software. The only real problem is if you wanted to download pics you must allow the software to open at computer start up. I simply turned mine off so it wouldn't start up in the computer start up functions & opened it when needed.  An update is now available which to my knowledge fixed most bugs. All I really use the camera dock for is charging & downloading the pics to my computer. Battery life is very good. If you're smart & conserve battery power I've been able to get well over 200 pics. Speaking of the battery one main reason for buying this camera is because it came with a rechargeable Lith. Battery. I'm done with the alkaline & NIMH batteries which didn't last long for me. Rechargeable Lith. batteries are the only way to go for long battery life & many pics, which if you check many cameras today it is still very hard to find even in high price units rechargeable Lith. Batteries. As to picture quality, no problem, but remember pic. quality only depends on how good the printer can produce or the developing lab. The Kodak printer produces good picture quality, but the paper refills are expensive. I have mine developed at Costco who has the best price & decent quality. With all this being said my son purchased the 7590, which is the next step up from the 6490. It offers push button on & off button & has many more added picture features, so this would be the one I would go for. Still two years later I'm very happy with my 6490 & made the best choice.", "Date": "October 7, 2007"}, {"Title": "Easy Share", "Author": "Nancy J. Gicewicz \"Nancy\"", "ReviewID": "R22OZEXMISDEKR", "Overall": "5.0", "Content": "This product is perfect for anyone who wants to just go out and take great pictures. The camera can be easily operated with little use of the owner's manual. Everthing is simple to find and use. The 10x zoom on the camera is second to none and the 'through the lense' viewing option is wonderful. The battery on this camera is outstanding for how long it will last and recharging is a snap. The only thing that I wished worked better is the flash. To me it needs more power. Other than that, the camera is great.", "Date": "May 12, 2007"}, {"Title": "Back to the Past", "Author": "Hector C. Hernandez", "ReviewID": "R168CHGOH4U393", "Overall": "5.0", "Content": "I just bought the Kodak DX6490. It remided me of my old and faithfull Kodak Retina IIIc. The leather case, the feel of the camera, the Schneider Kreuznach lens. A wonderfull camera. Congatulations to Kodak for going back to a great tradition.", "Date": "October 1, 2004"}, {"Title": "Great camera.  Amazon's price is the best I've seen.", "Author": "\"lousails\"", "ReviewID": "R2TQ834EOLOOWZ", "Overall": "4.0", "Content": "I love this camera.  Just bought it this past weekend.  The photo quality is outstanding and I really like the features which give you the controllability of a standard, manual 35 mm camera.  (It also has a great automoatic mode which provides a lot of functionality.)This past weekend, I got the bug and decided that I wanted to take pictures immediately (after weeks of procrastinating about buying a camera).  So, I shopped around and found the best retail price at Walmart.  The Camera was $399 and the printer dock cost another $147.  Buy the camera here and save a lot of money.  (Wish I did.)", "Date": "June 3, 2004"}, {"Title": "This camera is great", "Author": null, "ReviewID": "R12L2RRAFWN891", "Overall": "5.0", "Content": "I love everything about this camera.  It takes great pictures and is very easy to use.  There are so many things it can do with this camera I am still exploring them.  The only thing I can say is bad is it doesn't have manual focus. I didn't think it would be too big of a deal, but sometimes when I am trying up close shots it has issues.  But other than that it is great. The quality of the shots are wonderful, I get excellent battery life. I definately reccommend this camera to anyone looking for such a good zoom and high resolution.", "Date": "May 8, 2004"}, {"Title": "All around great!", "Author": "Derek", "ReviewID": "R1DO6WPCVZ4YD7", "Overall": "5.0", "Content": "I used to own a sony camera, it was getting pretty old and I was becoming more advanced in my photography.  I needed a new one and found this.  I am so glad bought this!  It has many manual features but a great auto mode.  It has a high quality lens that takes spectacular pictures.  I really like the HUGE LCD.  The one part I did not like was not being able to by adapter lens's.  But luckly Kodak is coming out with adaptar so that you can!  I have no problems with the camera, oh and the battery lasts a really long time.  Just remember if you are going on a vacation, bring the docking station to charge it.", "Date": "May 4, 2004"}, {"Title": "I Love this Camera", "Author": "Gypsy Tejas \"Gypsy T\"", "ReviewID": "R1OUSTEAAWHOHA", "Overall": "5.0", "Content": "I bought this camera to replace my Sony Mavica and have been utterly delighted with it.  The 10x optical zoom is excellent, the controls are easy to see and use and I honestly can't think of anything negative.  I'm older and like the feel of the larger size.  It fits my hand.  I don't need a micro camera that fits in a pocket so this is a good size.  I get amazing quality photos with room lighting, even if dim.  So, I'm thrilled with it.", "Date": "April 27, 2004"}, {"Title": "Great Camera, Easy to Use!", "Author": "R. Watson \"DVD Addict\"", "ReviewID": "R123QSQRZC706D", "Overall": "5.0", "Content": "This Kodak DX 6490 is my 5th Digital camera; my 3rd Kodak. I have had it for over a month now.  I like the sharp pictures, the ease of use, the 10X Schneider-Kreuznach Variogon optical zoom lens and the large 2.2\" display. I did have to look around for a case to fit this size camera, but there are several out there, including a $9.99 Wal-Mart large camera case that I'm using. The camera is small, (about 15 oz) but not exactly pocket size. (It will fit in a large loose pocket though). The large display makes is easy to show off a picture to family and friends. Pictures can be tagged for instant emailing.  Even an email data base can be stored on the camera.  The lens cap is attached, not easy to lose as with some other cameras.  There is one other really cool feature.  The camera has an auto-orientation feature that rotates the pictures if you take a vertical shot. I love this feature; instantly the picture appears correctly oriented on the display!  For a gadget freak like me, that's great to show off.Every menu item has text explaining how to use the setting.  This is great for novices and can be turned off once you know the settings.  The modes are: automatic, sport, portrait, night, landscape, close-up, program (aperture priority, shutter priority) and manual.  The pictures are mostly very clear and the colors are great.  I take a lot of cat pictures and as another reviewer pointed out; you can see individual hairs on your cat!  The zoom is fantastic, the best I've seen in a digital camera. The flash is adequate for close range; most digital cameras don't take great indoor pictures beyond 10 feet unless the room light is bright.  There is an external flash attachment.  Outdoors the pictures are wonderful, even with the zoom.  The dock is good for novices; I would prefer just a cord for recharging.  I use Windows XP and I prefer to remove the memory card and download the pictures with a card reader. Either way there is flexibility with this camera.  There is a slight 2-3 second delay between pictures, but it's not bad.  A burst mode is available that can take 6 sequential pictures.  I don't use the easy share software; again if you use Windows XP it will handle your pictures.  There is some occasional red eye with this camera, but not much.  All digital cameras seem to have it.  I returned my previous Olympus camera because every picture I took seemed to have red eye.  I use Photoshop Elements to fix red eye, crop and fix any contrast and brightness.  Rarely do I have to adjust the contrast with this camera. My only complaints would be the battery and the shape of the camera. Only one time the battery ran out.  Usually it will take hundreds of pictures. I will probably buy a separate battery for emergency; I take a lot of pictures.  Holding the camera does take some getting used; now I now find it easy to hold, it's just the 10X lens protrudes more than a 3X lens. Buy this!", "Date": "March 6, 2004"}, {"Title": "LOVE this camera", "Author": null, "ReviewID": "R1495FSY8D08JW", "Overall": "5.0", "Content": "I love the Kodak Easy Share dx6490.  It is easy to use.  The camera dock for recharging is brilliant.  The battery is outstanding. I've taken an excess of 300 pictures within a time frame and never needed re-charging.  I have yet to run out the battery, and I have certainly worked it hard.  I do recommend getting an extra memory card because the memory is not enough for anyone who loves to take lots of pictures.  I love that it has video with audio.  The zoom lens is fabulous.  I thought I would have to get a stand for it to still and focus but I haven't.  The pictures I have taken with the zoom at maximum aren't as clear but they are better than I expected.  I have had the camera for 3 months and taken hundreds of pictures and I have not had any real complaints.  I was hesitant about the cost myself but now I know it is worth every penny I paid.", "Date": "February 19, 2004"}, {"Title": "Camera great - software awful!", "Author": null, "ReviewID": "R101OD95M7XRPC", "Overall": "2.0", "Content": "I just purchased this camera and was thrilled with the ease of use.  It is definitly a winner.  BUT - be prepared for the software!  A camera dock was included with the camera and I did not want to purchase the printer dock as I am very happy with the results I get with my own printer.  I enjoy being able to manipulate my pictures for collage, calendars, cards, etc.  The Kodak software allows you to connect directly to your computer with a provided USB cable or the dock.  The download was successful and then came the problems.  You cannot copy the pictures to any other program which I wanted to do as their software editing of pictures is limited to redeye, brightness and crop.  If you use the crop feature, when you print it won't make any difference as the sizes are 4x6, 8x10, etc.  The only way I could get a picture I could copy was to burn a CD or print the picture and scan it.  When you print, you have to use Kodak paper or you cannot use their one button feature which is an autofix of your picture.  It seems the salespitch here is to force you into buying their printer and then doing what you want with a scanner or CD to get the results you want.  If you don't, you will be wasting a lot of picture quality paper.If you just want a good camera and are willing to invest in their printer, paper and ink, then you will probably like this camera.  As for me, I am returning it for a refund.", "Date": "December 27, 2003"}, {"Title": "Simple the best", "Author": "Alexandre M. Andrade \"kaniabi\"", "ReviewID": "R1N7T0Q7U4NPOS", "Overall": "5.0", "Content": "I did a extensive research before buying this camera, and I think I did the best buy possible. I have a \"PalmOne Zire 71\" and I wanted to use the SD card I have (256Mb) on both devices. Works perfectly. I can even see the photos in my palm (if I have enough patience. The \"REVIEW\" in the camera is much more fast and simple to use).", "Date": "May 4, 2004"}, {"Title": "Bad Software Comes With It", "Author": null, "ReviewID": "R1TNEWVHKG3LVN", "Overall": "1.0", "Content": "I love the Kodak EasyShare cameras but I'm very unhappy with the software that comes with it.  Kodak forces you into using their software as it's the only way to get the pictures out of the camera unless you use a drive for your SD card.  Once inside the software, you can't rename picture files or save them to another folder.  Neither can you select a group of pictures and copy or drag and drop them to another program.  You can't even see the name of the picture file unless go to properties and then parse it out of an unfriendly name.  The software was made to lock you into using ofoto to share/print your pictures.  This software is extremely basic and suitable only for the beginning digital photo user or someone who only wants to print with the Kodak Camera dock.  If you want to do anything more complex, buy another brand that doesn't lock you into their software.", "Date": "June 2, 2004"}, {"Title": "Questionable image quality", "Author": null, "ReviewID": "R22W9SGG6A85OJ", "Overall": "2.0", "Content": "This camera has a questionable image quality. I had to return this camera. I didn't buy it on Amazon, I bought in the Business Depot.The main problem is a bad image quality when making portrait indoor pictures. Indeed, if you magnify the picture you can see it in almost any image, not only indoor pictures, which you even don't have to magnify. This is not a hardware problem, this is a firmware image processing problem. Details in photos can and do look muddy. The colors are artificial. I read and saw that a lot of people don't see such a problem but as of today (after reviewing more than 300 images from the internet, my friends and myself) I haven't seen a single good portrait image from Kodak DX6490. All of the images taken with Kodak DX6490 that were addressed as good images and shown to me by other people didn't look good at all as well. I cannot address such a problem as one doesn't know how to use the camera, too many images have been reviewed. This made this camera for me useless. This camera is a nice toy, but doesn't stand a very simple image analysis.Take different portrait images from other comeras and put next to Kodak images and see it for yourself.I had a chance to compare this camera (actually I had a chance to compare even with two Kodak DX6490) with Toshiba M700 and HP 945. The Kodak images were really bad compared to two cameras above. HP 945 image quality was so much better that I went with HP and I don't regret it.", "Date": "January 10, 2004"}, {"Title": "DX6490 Movie Mode Poor Quality?", "Author": "burtchael@webdsi.com", "ReviewID": "RLMO0PP11QZBD", "Overall": "2.0", "Content": "HiThe camera takes nice still pictures, but very disappointed in the quality of the movie clips. There's whitespots (that look like white rain running across the picture) distorting the image on playback and some delay in picture playback. Maybe it's an adjustment or something I'm doing wrong and would appreciate any tips. Setting are all factory default at this time. Do you have the hold the camera relatively still while taking movies. All the movie clips were taken outdoors in full sun or indoors with plenty sunlight coming through windows so I don't feel lighting is an issue.With two small children the movie mode is an important feature but with such poor quality, now regret not buying a digital video camera. Use a 800mhz Gateway computer and wonder if that has anything to do with the playback lags, but feel certain the distortion in the picture is from the camera.  Will probably return this camera if it can't take better movie pictures. Will try altering some setting to improve the quality, but at this point think it's in the design and tend to believe the technology has some catching up to do.Steve", "Date": "March 14, 2004"}, {"Title": "Wonderful Digital Camera.", "Author": "Vincent Donndelinger", "ReviewID": "R2AQVFI71CY5DM", "Overall": "5.0", "Content": "This is my third digital camera.  I would rate every one of them with five stars.  The first (Fuji) I lent to my grand-daughter, and she likes it too much to return it to me!!!!  The next was a Sony Mavica which I lost by leaving it in a cab in Boston.  Well, now I am the most pleased with this Kodak6490.  Along with its program, it enables me to enjoy this new-found hobby of digital photography.  Let me advise any reader of this review to buy this camera with confidence.", "Date": "October 24, 2003"}, {"Title": "I'd never buy another Kodak camera!", "Author": null, "ReviewID": "RJZ9FQ9DSBVBN", "Overall": "1.0", "Content": "I bought a Kodak digital camera and it has been fine. However, knowing what I know now I would never buy another Kodak camera. Ever. I dropped the camera, and a little plastic piece broke off which keeps the battery pack in the camera. Not a big deal. But NOONE repairs Kodak cameras. Instead you HAVE to send it into their corporate repair center and they instead sell you on trading it in for a refurbished camera. So, I can send this one in and for $250 get a new refurbished camera. Whooppe! But it only sells for $50 more on amazon.com - and thats a new, non-refurbished one! Its a total crock. Just be forwarned. I'd never buy a camera which I cant get repaired locally.", "Date": "April 14, 2004"}, {"Title": "Kodak has terrible customer service", "Author": null, "ReviewID": "RFUJ9KCGKYP38", "Overall": "1.0", "Content": "I bought a high end Kodak camera a little over a year ago.  The shutter ended up getting stuck and not opening.  I called in to get this resolved and they charged me 1/2 the price of a new camera to get the shutter fixed.  I went as far as to talk to a supervisor who explained that Kodak digital cameras were not designed to last over 5 years.  I was in shock.  She said that there were too many little pieces that could break (the shutter???) and they weren't meant to last like a regular camera.  I would highly recommend stearing away from Kodak.  The shutter not working sounds like a defect.  Highly disappointing for a big name like Kodak.", "Date": "December 13, 2003"}, {"Title": "Getting drivers is a royal pain", "Author": "Thomas L Howe", "ReviewID": "R1X5W1UIHJQQ87", "Overall": "3.0", "Content": "I resolved never to buy another Kodak, after upgrading my home computer.  Getting new drivers for the camera was laborious, painful, and downright insulting.  First, there's no \"drivers\" listed on the Kodak site, just this \"Easyshare\" thing.  When you give up looking and ask for that... wait, you have to \"subscribe\" first.  Then endure ads for their Ofoto service.  Then you can't just download; they'll install directly.  You can't use your computer for anything else while they're at it -- the Kodak download window grabs the focus and won't let you even LOOK at anything else.I'm still pretty happy with the camera, itself, but the way they treat customers is just intolerable.", "Date": "November 19, 2003"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B0000AJMOI"}}