{"Reviews": [{"Title": "UPDATE: HORRIBLE PICTURES - PURE JUNK!!!", "Author": "J. Sebastian", "ReviewID": "RQNT6FLMDXAOS", "Overall": "3.0", "Content": "I've had this camera for about three weeks now so this is not a complete review.  This is a replacement for the Canon S100 Digital Elph which I had for almost five years.  That broke and I got the Konica Minolta here in Asia before it was released in the US.There are several shortcomings with the Konica Minolta:1) Flash is limited to about 6 feet or so.  TERRIBLE!2) Lowlight picture taking is quite poor. The lense has difficulty focusing and there is no manual adjust.  AGAIN, TERRIBLE.3) There is a big lag time between shots due to long processing time.  YOU WILL MISS LOTS OF PICTURES!4) LCD has very large pixels which makes it difficult to see details.5) The camera is pretty large and bulky.6) Shutter speed is limited to 1/250 sec.7) No manual controls.There are good things:1) Battery lasts about 90 minutes of continual use.2) Macro photography is pretty good - UNDER PERFECT CONDITIONS.3) Controls are very intuitive - it is SIMPLE to use.4) The Anti Shake technology is effective.5) The video is good.6) Despite the sheer heft and size it is a sleek design, but only the back of the camera.7) Overall picture quality is ok under PERFECT conditions.I needed a camera quickly.  If you are not in a hurry, it may pay to shop around.UPDATE - I have sent four emails and left three voicemails to KM over a one month period and have yet to hear back from this company.  DO NOT BUY THIS PIECE OF JUNK!!!If I could, I would re-rate this camera as one star since zero is not an option.UPDATE #2-1) You will miss lots of pictures due to the long processing time.  You'll attempt to take a shot but by the time the camera actually records the image from the time you press the button it's SEVERAL seconds later.  I can't tell you how frustrating this is.  I can't believe they put out a camera like this.  It's really unbelievable.2) My old Canon took much better pictures than this.  Pics are extremely \"noisy\" and forget low-light pictures.  Get the 1 GB card, because you'll need to take about 20 shots to make sure you get one that turns out.  Again, unbelievable.DO NOT BUYDO NOT BUYDO NOT BUYDO NOT BUYDO NOT BUYDO NOT BUYDO NOT BUY", "Date": "October 1, 2005"}, {"Title": "This is a Konika Camera, NOT a Minolta!!", "Author": "Frank Segler", "ReviewID": "R2P5AZZFLCNTI8", "Overall": "1.0", "Content": "I have bought several Minolta Dimage X, and Xi cameras over the years.  For myself and for others.  They are a great product, and even at 3 megapixels the Xi gave excellent sharp pictures with great color.The Dimage X1 is NOT a Minolta product.  It is a Konica product.  I have seen the old Konica cameras and I never would have bought one.  I had expected to get a better Xt, instead I got something that was less than the Xt, a different shape, much heavier, bad color, EXTREMELY SLOW!!!If any of you have owned the older Dimage X and Xt, you would know that it had a very fast start up and no shutter lag to speak of.This camera is slower starting up, and there is a noticeable shutter lag.It is very unfortunate that Konica now owns Minolta.  They tried to pull a fast one here.  Whatever you do, do not buy this!  Konica Minolta needs to get back on track and put out a product worthy of the Minolta name.Slapping a Minolta label onto a Konica camera does not improve performance - well, only sales, buy thats very short lived, until everyone figures out what they have done.,Buy a Minolta Xt - its cheaper and better all the way around.Take a look @ the Konica Minolta Dimage E500 5MP to see the sister product that preceded the Konica Minolta Dimage X1.  You see horrible reviews across the board on the stuff made by Konica.Then take a look at the reviews for the models originally made by Minolta, such as the Dimage X and Dimage Xi.Good luck getting your reputation back Konica.  Unfortunatly now I have one of these that I opened the box and used it.  Amazon says they will charge me a 20% to 50% restocking fee!  And all I did was open it and use it for a day before giving up on this P.O.S.  Amazon needs to protect their customers better than that.  Konica pulled a fast one trying to pass off  a Konika digital camera as a quality Minolta Dimage camera.  And us the consumer is getting screwed :(", "Date": "October 16, 2005"}, {"Title": "Great Point 'n' Shoot Camera; Harsh Crticism Not All True", "Author": "Theophilus", "ReviewID": "R2OOTI3XVRITAJ", "Overall": "4.0", "Content": "I just received my Konica Minolta Dimage X1 camera with a 512 MB SD card in the mail. Admittedly, I was somewhat worried that I had made the wrong choice based on what I read here. After playing with and testing the camera extensively, however, I respectfully disagree with much of what has been said here. It is true that the shutter was slow, but after upgrading to v. 1.10 of the firmware, which Minolta released in October 2005, the camera performed more quickly. That should do away with any pre-October 2005 criticism of this camera's speed.As for the remaining issues, such as ISO speeds and professional functionality, it is true that you only get ISO 50-200 and that many advanced features are not present. But guess what? This is a stylish point and shoot that will draw stares and produce brilliant and beautiful photographs for anyone. If you want professional features,  buy a prosumer or SLR camera. ISO 50 + fine quality + anti-shake made all of my images look wonderful in iPhoto when resized to almost any dimensions.This is a solid performer in my opinion. I would recommend it to anyone who wants to take beautiful shots quickly and easily.", "Date": "November 17, 2005"}, {"Title": "Improved with Firmware Update 1.10", "Author": "Jon Hawkins \"jhawk\"", "ReviewID": "R1KDE0VNS2EXZD", "Overall": "4.0", "Content": "The review from Thailand was right on about this camera.  He might have a better experience (still not a perfect experience) after he downloads the Camera's firmware 1.10 version (or later).I have a feeling Minolta released the camera a bit too soon.  I had purchased this camera after my Canon IXUS 500 (in Asia)/PowerShot S500 (in USA) got damaged while I was flying to Singapore.  The sales person in Singapore convinced me that this was the latest technology for digital cameras.  As I took this camera around on my trip, I found many things I didn't like about it.  One thing that this camera has is the \"cool new item\" factor.Out of the box.. I would give this camera.. one star.The shutter speed was almost painful for me.  The egronomics of the camera does not appeal both to the photographer and to the subjects (the people getting their picture taken).#1 I found the multi-flash (3 flashes) resulted in poor shots.  People thought I was done with my shot after the first flash.  The good news is that the Firmware update 1.10 fixed this.#2 The position of the lens in the upper right corner was a bad idea. Many shots resulted in many shots with a \"flesh colored fog cloud\" which was my finger.#3 For the price, Minolta should have provided a bigger SD Card.  The provided 32MB SD Memory Card is a joke.  This will only hold about 8-15 pictures.On my return home, I realized that I didn't have the CD ROM provided by Mintola.  A look on their support website resulted in a message stating that I must buy a new CD from some other site  The sales guy in Singapore told me that Windows XP computers didn't require the drivers.  That wasn't so.  My Windows XP couldn't recognize the USB Cradle and the Camera.  I'm stuck without the CD, but I can still transfer files using the SD Memory.In summary.. The features and the appearance of this camera are first class.  The practical short comings of the physical ergonomics are some what painful. After installing the firmware file, much of the operational shortcomings have improved.  Now I feel like I'm getting the class of camera I bought at that price.", "Date": "October 9, 2005"}, {"Title": "Not worth the price...", "Author": "Camera user", "ReviewID": "R1ZN8LLCGVWDNX", "Overall": "3.0", "Content": "I just bought this camera thinking that because it's the newest release, it'd be the best. Wrong! Though I did not have the time to play with every feature available, I used the standard settings to take regular still pictures. The pics came out grainy no matter how near or far the subject was. The processing time was slow with a black screen. I compared the pics with those taken from my older 5MP minolta, and the 5MP was so much clearer! I might have been able to tweak the settings to make the quality of pics better, but because I needed a new camera right away, I chose to just return this one for another model. The biggest gripe of all: the memory card was next to impossible to remove from the camera!!! I have small fingers, but the battery compartment door does not open all the way down, and the card slot is so near the hinge, that you'd practically need a pair of tweezers to remove it!If these things aren't a problem for you, than by all means this is a good camera, in terms of looks and extras that come with it. Otherwise, look into getting another model/brand and try out the card slots before getting one too. I never thought removing a card would be a problem with new cameras...", "Date": "October 20, 2005"}, {"Title": "Great point and shoot camera!", "Author": "John \"Avid scifi fan since I was a kid.\"", "ReviewID": "RW2NPKLSX081T", "Overall": "5.0", "Content": "OK I read all of the other reviews on the x1 camera and it scared me a little but I went ahead and bought one anyway, since I owned the Xi (3.2MP) version and loved it and we have a Minolta Dimage 7Hi (SLR) at work. I am a graphic designer and a photographer so I know my digital cameras.I wanted a small pocket digital camera that I can carry with me for when I come accross opportunistic shots.The Konica/Minolta DiMage X1 is a great camera. It is not at the level of an SLR but it is not meant to be.It is NOT slow. Those who report it being slow are either using some older version of the software or maybe a slow SD Card. Make sure you buy a fast SD card. It takes longer to save 8MB picture to an SD card than a 3.2MB picture - that is simple logic. But having said that, I find the X1 saves the 8MP photo only slightly slower than the Xi did. Other things that affect save time are how complex and detailed the photo is and what setting you have set for quality. Play with them. AND GET A FAST SD CARD. I recommend the CORSAIR 133x 1GB Secure Digital (SD) Card Model CMFSD133-1GB.As far as low light photos go, yeah the flash is only good to about 6 feet or so. But that is standard with any of this little pocket cameras. You can't cram a huge telephoto flash unit into a package this small. Ain't gonna happen.The weight and size are very close to the Xi model.The LCD is large and clear and easy to view.The Menus are easy to use.If you liked the Xi you will like the X1.Again, the overly negative reviews on this camera are just plain WRONG. Either Minolta fixed the problems they had or they were just mistaken or overly picky to begin with. Plus go look up some professional reviews done by photography sites and magazines. They seem to love it too.I am happy I got this camera.", "Date": "January 11, 2006"}, {"Title": "For the money this camera cannot be beat!", "Author": "happy shooter \"happy shooter\"", "ReviewID": "R1G2G2S8KGJ5JI", "Overall": "4.0", "Content": "I have read the recent Amazon customer reviews on the DiMAGE X1 and I do not understand some of the negative comments. I bought one for a friend last month and have used theirs since and found the results to be great plus the stabilization allowed me to get some sharp low light and close up shots that would not have been possible without a tripod.  True, it's not the fastest camera around, but I purchased the camera because of it's size, 8MP, and anti-shake features.  I use my Maxxum 5D DSLR for that kind of fast shooting.  I think some of these users are expecting a point and shoot type camera to perform like a DSLR that it never was designed for.For an industry point of view, potential buyers may want to check out January's '06 Shutterbug magazine test report which rates this camera so high that the author admits he would recommended the DiMAGE X1 to his friends.RJ", "Date": "December 30, 2005"}, {"Title": "Don't waste your time", "Author": "Stephen714", "ReviewID": "R39YE8JP6FT0ST", "Overall": "1.0", "Content": "I gave this camera 1 star because that is the least available.  It certainly does not deserve even the one star as it is a terrible camera.  I own a Minolta Xt and at 3.2 MP, I get far better results than from this useless camera.  It's hard to believe that a company could make a similar model worse with time.  I have been using a Fuji camera the past year and wanted a second camera.  The Fuji makes it not worth even bothering with the three Minolta cameras I own.  This X1 is slow, focuses slowly and very poorly if at all and renders absolutley terrible pictures.  The LCD on the camera is incredibly grainy so when the pictures came out not much better, it was hard to believe.  My camera came with the newer firmware and I can see no value to this camera.  I can see no effect of the anti-shake feature with this camera producing as many or more blurred pictures as the Minolta Xt.  Color quality on the pictures that are worth saving is generally very poor.  The truly sharp in-focus picture is a rarity with this camera.  Tech support, as usual from Minolta, is non-existant since they do not respond to on-site tech requests.  I can't think of anything worse they could have done when making a camera.  This one is slow and produces blurry and generally low quality pictures.  The worst of it is, besides wasting your money, you end up losing valuable picture taking opportunities that should not be squandered.  The only question for Minolta is Why?", "Date": "November 27, 2005"}, {"Title": "SLOW", "Author": "Jes15", "ReviewID": "R30M1P3G7XSJBO", "Overall": "2.0", "Content": "I used to own a Minolta and it was very fast, so I expected this one to at least have some good qualities as far as performance. The looks and price caught my eye ($349.99), although I actually went to the store looking for a particular camera. I am glad I did not end up buying this camera. I was lucky enough that a worker at the store opened a new box so I could fiddle with it since their display model had no batteries in it. So I played around with it for quite awhile, even walked around with it a little to test its focusing. Though I canoot say how the photo quality is with this camera, I can tell you this.. it is terribly slow. The screen darkens to almost black when it seems to do anything. I noticed it first turning it on, then I noticed it after each quick preview of the pics I had just taken. Maybe it has something to do with the flash charging, but I don't know why the screen has to darken for as long as it does. I would think people would still like to see what's going on on the screen whether or not the camera is ready to take another picture. As another reviewer noted, this is probably the work of Konica and not a true Minolta product.", "Date": "November 10, 2005"}, {"Title": "This camera has been misunderstood and you only need to read the directions to get the pictures to come out clear!", "Author": "Anne M. Sharrow", "ReviewID": "R39QDI1WUM4E3E", "Overall": "5.0", "Content": "I was skeptical to buy this camera after reading all of the reviews on here, but my gut instincts told me to go for it.  I did so, and at first was very disapointed with the pictures I was getting- grainy, grainy, grainy!  But then I read the instruction booklet and tried ALL different kinds of settings and found that the camera MUST be set on an ISO setting of 50 in order to get clear pictures- and BOY are they clear!  Much much clearer than anything I used to get with my 4.0 MP Koday EasyShare that cost $450 when I bought it!  My favorite part about this camera is that I can get as close up as I want and the pictures won't get blurry- for example, I like to zoom in on bugs and flowers, but on my old camera they would always turn out blurry- on this camera I can be only an inch away and still get a great picture!  I think the reviews written here are completely unmerited - this is a GREAT camera for the price and I suggest it to everyone!", "Date": "April 23, 2006"}, {"Title": "This camera was a big mistake.", "Author": "Mad Teach \"mommy of 1\"", "ReviewID": "R3OKETLHGBCDU1", "Overall": "1.0", "Content": "At the time that I bought this camera, there were no reviews because it was so new.  I bought it anyway because I liked the way it looked and because it had over 8 MPs.  I was completely disappointed when I got the camera and realized that I couldn't have made a bigger mistake.  The LCD monitor was dark and blurry.  I felt like I was watching an old video that had been copied over many times.  The picture quality was horrible.  The pictures appeared to have this haze over it and most of them were blurry.This was literally the worst camera that I had ever come across.  Luckily, I was able to return it for a full refund, but I recommend not wasting your time on this camera.", "Date": "October 8, 2005"}, {"Title": "8MP, anti shake, super slim, big display, $300...how can you miss?", "Author": "Eric I. Borsky \"ericb49\"", "ReviewID": "R1LAJMA2KAEUL6", "Overall": "5.0", "Content": "I shopped around to supplant the Sony PSC-100 purchased last year, mainly to use SD media (works in my notebook and ipaq as well) rather than spend more on memory sticks I can't use for anything else.  Also wanted anti-shake and ability to change zoom while shooting (sony - NOT!).  This camera has delivered on all fronts and more.  Vid clips rival quality from a dedicated handy cam, focus is solid (none of the Sony hunt and mis-focus), anti shake means you can shoot anything from the hip or on the move and have sharp pics every time, also reacts quickly and accurately to changes in light.  Big display is great for reviewing shots, but I do wish it had an optical viewfinder - scren can wash out in bright sun.  Also, it's almost TOO small and slim, until you are used to it you will have a lot of pictures of your fingers.If you want a decent point and shoot for $300, regardless of megapixel, this camera is hard to beat.", "Date": "March 3, 2006"}, {"Title": "Recieved two faulty cameras", "Author": "Jimb", "ReviewID": "R3044I20QKOQ88", "Overall": "1.0", "Content": "I got this camera as a christmas present and was initially excited.  Unfortunately after about a week of use the shutter started opening up only half-way.  So i returned it to amazon, and they sent me a new one.  Within two weeks the camera, inside a padded case, split open on the side.  When i tried to set it up for another exchange on amazon i recived this message:\"I am sorry that your replacement shipment was also problematic.As it seems that the problem with this item is more widespread than we originally thought, we are not able to send another replacement.  We will investigate and remedy the situation with the item; however, I cannot guarantee when the error may be fixed.We will gladly refund you in full for the return of this item.  If the item was part of a set, please return the entire set.\"Apparently I am not the only one having problems with this camera, which makes me surprised to see that they are still selling them here.", "Date": "January 23, 2006"}, {"Title": "Good For 3 Years", "Author": "Amit Dhumash \"AmitD\"", "ReviewID": "R2RRM7PQJE168I", "Overall": "4.0", "Content": "I purchased this camera from London in 2005. It still working without issue, but its outdated now..take lot of time to save picture even in small size of pic.It has got GREAT ANIT SHAKE Tech...but night vision is poor.Charging dock is great and still working after 3 years....no issue yet.But I would say, not to buy it as there are plenty of better cameras in market now...", "Date": "January 8, 2009"}, {"Title": "STUNNING quality", "Author": "J. C. Yang", "ReviewID": "R3BE80I2OXQ4ED", "Overall": "4.0", "Content": "Okay, I'd purchased this camera TWO years ago, and I'm still thrown by it's picture quality! Majority of my friends own Sony digital cameras, yet it doesn't come close to Konica Minolta Dimage X1! I constantly get compliments on my photo's, often everyone would ask if it's a professional DSLR camera that I'm using to get such wonderful quality! Though, I honestly have to agree that the shutter speed is one of the main disadvantages, along with some of the features and especially the bulky size & weight. Overall, I've been extremely happy with this product regardless of other's opinion, and I'm actually afraid of replacing it now that I'm so attached!!! Picture quality is stunning after TWO years!", "Date": "August 12, 2008"}, {"Title": "Trendy accessorie but awful camera", "Author": "Mina Anton \"Mina\"", "ReviewID": "R3SK5KEGK92ZEG", "Overall": "1.0", "Content": "The camera was a present for new years! I heard 8mp and loved it! I couldn't wait to show it off to my friends until... i began shooting pictures...The quality is undescribable. All the pictures no matter the conditions, are awful! I've tried everything (more light, removing antishake, adjusting lense, lowering the MPs) nothing worked!My boyfriend's nikon 4,2MP photos are excellent!No matter what I shoot, landscapes or close ups, inside or outside portraits the photos are always distorted when viewed at full size and no matter the quality or the settings used!And while i'm thinking the money my parents paid for it... and i can't take not even one nice shot!!! And how can i tell them that it's useless???As far as night shots are concerned, the camera lacks that red light that other cameras have to help them focus prior to taking the picture... imagine trying to take a picture when the LCD shows almost total darkness... the camera can't focus and even though the flash is powerful the shot is distorted... oh! yeah! There is a solution! i can focus somewhere i can see and then take the picture... try telling a friend to take your picture that way...However it comes in red color and it has a leather boss case... because that's all you need from your camera!!!", "Date": "March 19, 2006"}, {"Title": "Good camera but slow taking pictures", "Author": "Omar", "ReviewID": "RI097KGBPI9IQ", "Overall": "3.0", "Content": "I bought this camera even after reading the reviews which said so many bad things about it because it seemed like it had a lot of good features for the price.  It is a very good camera.  The pictures are good, even though in low light the flash is not very good.  It has a lot of features, you can even copy an e-mail size picture with the camera.  The only thing I don't like is that it has too much shutter lag.  I can't get what I want when I want it most of the time unless I am taking something still specially in low light, sometimes as much as three or four seconds.  I think this is because of the camera trying to focus.  So if you want to take a picture of something moving, you will most likely not get it when you want to.Other thing I would have liked is not using a craddle for downloading the pictures to the computer.  Other than that I like the camera and the picture quality is good.  Actually I give it 4 stars not three but I could not change it.", "Date": "December 30, 2005"}, {"Title": "The price should be about $45-$50", "Author": "ZZM \"garro\"", "ReviewID": "RL28FMFPHWBQZ", "Overall": "2.0", "Content": "This would be a great camera for about $45-$50, based on the quality of the pictures.The lens cant focus about 30% of the time and the pictures come out blurry.Very slow shutter time, the firmware should be updated as soon as receving the camera, it helps with the quality of the LCD display, not much help with the pictures...it bosts an 8MP resolution but it looks more like it was made with a cheap 3-4MP cameraSpend a little more for a Sony DSC T-7 it is well worth it if you need a slim pocketshirt camera.", "Date": "April 15, 2006"}, {"Title": "best camera ever", "Author": "Roz Finkenhoffer", "ReviewID": "R3TZV965YWXS65", "Overall": "5.0", "Content": "Konica Minolta DiMage X1 is the best camera I have ever purchased.  If I'm not mistaken I've had my camera since 2004 or 2005 and never had a moments trouble.  I am still on the same battery and have used the SD card over and over again.  You can also download pictures directly from the camera to your pc. This is an excellant camera that you can put in your shirt pocket or for ladies great for that small purse.....You will never go wrong with this choice.  I love my camera. Roz Finkenhoffer", "Date": "September 26, 2013"}, {"Title": "No longer made and supported", "Author": "Aaron Gleason", "ReviewID": "R3OVE5M33J92E6", "Overall": "4.0", "Content": "IMPORTANT: Konica Minolta officially stopped making digital cameras several years ago. If you purchase this camera, know you are buying an orphan.That being said, this is a great, tiny, easily-pocketable camera that does a very good job at what it does: Take digital pictures in good lighting conditions. Like many small-aperature cameras, it has problems with low light conditions, exasperated by the tiny flash's inability to illuminate anything more than 5 feet away.I had this camera for several years. It was reliable until a single 2 foot drop caused it not to boot up. Even though I blocked the camera's fall with my foot, it still left a visible dent in the metal casing and I had to send the camera in for service. Also, after a short time, the silverish coating on the buttons started to wear off. This didn't affect the image quality, but made the camera look bad.Still, having an optical zoom in such a tiny camera is amazing. The engineering that went into this camera is excellent and the pictures it takes in good lighting conditions are excellent.", "Date": "November 6, 2010"}, {"Title": "Can I rate this Negative 50?", "Author": "Matt Sievers \"leardude\"", "ReviewID": "R1T033AOFJMBR4", "Overall": "1.0", "Content": "This camera is terrible. The camera takes forever to start up. If you see something good and want to capture it on camera quickly....well just forget it. If you do happen to catch the image just a fair warning it will 90% of the time be so blurry you won't see it anyhow. If you like the way it looks when you pull it from your pocket ok just remember that it may look nice, but really really sucks. Buy something, anything but this camera.", "Date": "March 8, 2010"}, {"Title": "Not as good as the Dimage X50, Brand New?", "Author": "R. Macionski \"LifeinStPete\"", "ReviewID": "R1GTG8FQFRDP5K", "Overall": "3.0", "Content": "This camera model does not have the fast action picture taking ability as the Diamge X50 model.  The camera can has a very slow reaction time.I also question whether the camera was brand new????  Amazon claime it would be, but it was missing the bag case and the SD card that the box said it should contain.", "Date": "December 2, 2008"}, {"Title": "good idea, poor implementation", "Author": "I. Katsman \"ikatsman\"", "ReviewID": "R35D0MPO04AS6V", "Overall": "2.0", "Content": "At 1st I was excited about vertical design of lens which gives many benefits and picture- perfect look, but when camera arrived, I started noticing problems immediately:1) operation is slow (start-up, shutter lag, and between-shots). Startup is several seconds comparing to under a second with Casio. Probably anti-shake adds shutter lag, but even with anti s hake off, it's too slow2) rounded edges make holding camera inconvenient-- they should be caved in for fingers instead or just straight.3) picture quality (or jpeg compression) has problem: shots of dark surfaces (i.e. black sweater) display small white inclusions visible at high resolution.4) battery life isn't great5) matte finish makes fingerprints very visible6) body squeaked when held. Must be a bad apple.7) certainly, optical or lcd eye-piece viewfinder would be nice.8) automatic change of portret/landscape orientation (like Kodak's) would be niceHopefully next model would fix at least 3 first problems. Meanwhile, x1 goes back :(", "Date": "December 12, 2005"}, {"Title": "...ya mean ya can't rate this thing 0starzzz or NEGATIVE?!...", "Author": "H@piboi", "ReviewID": "R3QIR2KZA1ODDC", "Overall": "1.0", "Content": "I agree with what Jessica says, Konica Minolta is simply an irresponsible company. If a customer is given a product that is not up to the item description, the company should back it's product and their warranty; not to do so is just outrageous, i will never contemplate buying a konica minolta product after having read the below reviews and those of MANY other online sites. This company should realise that it's the customers that make the business and if they aren't interested in making sure the product they selling is fully functional and satisfactory to the description given to the buyer prior to purchase, they are no good. thx for the review Jessica and the others, i will save myself the hassle and look elsewhere!", "Date": "January 24, 2006"}, {"Title": "Amazing Product", "Author": "NeNe", "ReviewID": "R2T0A7M65VI1OL", "Overall": "5.0", "Content": "I got this camera as a present a year ago, and dropped it in the ocean when I was on vacation...:(  I bought an other camera, but the picture quality didn't live up to the standards set by the Dimage X1. So, I did a lot a research trying to find the Dimage X1 again. This is the most amazing camera ever -- to bad it's not in production any more.  Picture quality is great.  The anti-shake feature help to take the most amazing pictures.  By far THE best digital camera I've owned.", "Date": "May 11, 2007"}, {"Title": "Great camera....awesome photos!!", "Author": "Ash", "ReviewID": "R1D42ELM7TH2FY", "Overall": "5.0", "Content": "I love this camera. I get great pictures in all kinds of light, indoors or outdoors, flash or no flash. The pics are crisp and capture every detail (even stuff you don't know you're shooting!). I've had professional quality results when taking portraits. The LCD screen is a good size and the photo options are alot of fun. Even the video feature is pretty good, with a better than expected mic range. I reccomend this camera every chance I get!", "Date": "July 1, 2006"}, {"Title": "wonder ful", "Author": "Udayan B. Shah \"uDAY\"", "ReviewID": "R2IK1MWP7FS0ZX", "Overall": "4.0", "Content": "Beautiful and Nice camera.I have developed about 300 picture from this. all most all are coming good.very easy to handle.great product", "Date": "December 29, 2005"}, {"Title": "Not perfect, but excellent..", "Author": "Robert Hirsch \"filmalot\"", "ReviewID": "R19SATC78U4MU5", "Overall": "5.0", "Content": "I purchased the Minolta Dimage X-1 for my sister, an individual not particularly adept with any camera. She was immediately pleased with the \"look.\" She followed the quick Start-Up sheet without any input from me. She charged the battery in the enclosed cradle. She waited for the red light to go out, knowing that the camera was now ready to go. We went to the beach (Monarch Beach, CA) and she started snapping away. She got some really great stills of a set of 15' waves. The camera performed flawlessly.I tried a few shots just to get a feel for it. Yes, your finger can find its way near the lens, but unless you are a dolt, you will see it in the large screen before you take the shot!If you are a male with large fingers, The buttons are a bit on the small side, but manageable.Well worth the money, especially right here on Amazon with a great rebate.", "Date": "January 14, 2006"}, {"Title": "HORRIBLE FOR 8MP!! DONT WASTE YOUR MONEY", "Author": "Alyssa", "ReviewID": "R3P6C5D7PE2BEB", "Overall": "1.0", "Content": "This is a disgrace to the Minolta name!! I have always trusted Minolta camera but after their merger with Konica, this is a terrible product!The picture quality is horrible, the video resolution is great until you transfer it to your PC!!I would even go as far as to say even 4MP cameras with half the cost as this garbage works better!!Do not waste your money!!", "Date": "December 12, 2005"}, {"Title": "Forget reviews all over the net, its a wonderful camera!!!!!!", "Author": "Digital Photographer \"Used to Like Nikon,s\"", "ReviewID": "R2RCS2MXMCQJND", "Overall": "5.0", "Content": "After going thru many sites to get some input on the Minolta Dimaage X1, I was shocked, never have I seen such terrible reviews,sounded like it was a piece of junk, Konica has struck again.Well, all the criticisms, like you leave fingerprints on the body, hard to get out the SD card,, a poor lens, one professional reviewer did not even know that it had anti-shake, he seemed to know everything but nothing.So, I thought for $199 I,ll bite, I did, got it today, totally love it, works beautifully, prints are gorgeous, pretty ease to operate. great color, excellent lens, a real fun machine, so many good things built into it, I followed my gut feeling, had never bought a refurbished anything before, this worked out well.Even like the cradle that came with it.A Winner", "Date": "June 15, 2006"}, {"Title": "Great little pocket camera!", "Author": "Randall Conway \"frog\"", "ReviewID": "RPJQ50WNRGHR7", "Overall": "5.0", "Content": "Fits in your shirt or pant's pocket!  Great quality photos!", "Date": "January 31, 2006"}, {"Title": "A Christmas Gift replaced", "Author": "Jacqueline K. Ojeda", "ReviewID": "R3TV3Y86HISE9G", "Overall": "5.0", "Content": "The camera I bought, well it was a Christmas gift for my daughter, her previous camera was stolen, so I replaced it.  Thank you for getting me the gift right away and ready for Christmas.She is very pleased with the camera and so am I.", "Date": "January 9, 2007"}, {"Title": "Missing parts", "Author": "Carol Hill \"CJ Hill\"", "ReviewID": "R31BJ0CM8IONU8", "Overall": "3.0", "Content": "Hi,  when I ordered this Minolta Digital Camera I picked a seller that was offering the best price for the camera I wanted.  What was missing was the information that I was buying a camera without a card.  I would have been happy to purchase a separate memory card, if that information has been stated in the listing.  But, I was surprised to find all the pieces of the camera, cradle, cords, and battery in the box but no card.  When I contacted the seller,  they informed me that the camera was being offered without a memory card.  Somehow I missed that information when I placed my order.Since then I have purchased a camera  2.0 G memory card, on sale at Circuit City for a huge reduction in price.  So it all worked out for the best. I guess what I would like to see Amazon do about these kinds of ads, is make sure that if something is being offered for sale that all of its parts are listed,  or if something is not included,  there should be a note to that effect in the ad.  No one does it better than Amazon.  I have been able to find things on your website when no one else could come up with it.  I love Amazon  you are AMAZING,com", "Date": "January 9, 2007"}, {"Title": "Digital Camera", "Author": "L. Kamara", "ReviewID": "R31S1E4387CRJG", "Overall": "4.0", "Content": "Great camera but the flash is a little bit too bright for me", "Date": "February 16, 2006"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B000A7JKI6"}}