{"Reviews": [{"Title": "Get your pictures the Old fashioned way...", "Author": "Sinister Minister", "ReviewID": "RC39YHKXBOPWP", "Overall": "4.0", "Content": "Yea, with this camera you have to earn them! Hi all. SinMin here with what is probably the one review that most of my friends here at amazon have been waiting for, The Samsung Digimax Pro 815. Before we start let me say this first off if you are easily frustrated and/or do not have at least a basic working knowledge of photography DO NOT buy this camera. When Samsung said \"Pro\" They definitely meant it! I'll get into why later. Samsung? Panasonic? What the heck is up with these blender compainies putting out these monster cameras!I have to say that had panasonic not realeased the FZ-30 this would have been a strong contender for the mega-zoom catagory. So do I place this number 2 to the Z-30? No- more like 3 or 4 but definitelty in the top 5 or 6. This first reason being is that this camera has no image stabilizer, wich is suicide in terms of good low light and ambient light photography. Samsung's trick of speeding up the shutter and boosting the ISO works at best occasionally and when it does the images are in dire need of retouching work! Bottom line the method the camera uses to restrict movement called \"High Speed Shutter Mode\" Does not work. But, remember that thing you hang your baseball hat on, in your closet? That Uh...Tripod! Well if you use that with the 815 in low and ambient light, and the camera works rather nicely! You may also want to fine tune your shots depending on the effect you want using the camera's shutter and apature settings. If you use the camera like we used to before they invented image stabilization you'll be just fine. Makes you wonder if Samsung knew that all along! So you say what the heck!Samsung is buddy buddy with Kodak, why didn't they slap one of thier Stabilizers in there? The answer to that one is easy...Power consumption. See, the 815 has a 3.5 inch rear LCD screen, wich sucks power at an amazing rate, combine that with the two other displays on the camera, the flash, etc. etc. there was no way to use a stabilizer and provide enough power for all those goodies. So Samsung figured if they would break ground they would have an easier time doing it with an 3.5 LCD screen rather than a 15X optical zoom stabilized camera.I think they were right because while that 3.5 LCD is nice it has the same image resolution as a screen that is 1 inch smaller, so what happens? You lose definition. So while the screen is great for reference, and for a aging bozo like me it in fact does not produce that great of an image. In fact I have found that the worse a picture looks on that screen, the better it is on my PC!!Resolution in the viewfinder is not much better, but the best resolution (of course) is in the little waist shooting screen. As long as we're talking design... the 815 is one of the coolest looking cameras out there (I think) It is about the same size as the Canon EOS 20D, and a good bit heavier. Yessss!!The body is solid as are all the buttons and other controls wich are finished in gun metal(Cool). The greatist thing is the Schneider lens with its 3 focus rings. The main ring is your zoom. The second is your fine focus. And the third allows you to fly thru the aperture settings on the fly when you are shooting in manual mode!! The 815 has one of the best feeling and most responsive manual focus modes of any fixed lens camera I've tested. It feels as good and as accurate as my digital Olympus lenses. Above the lens is the hot shoe and the pop up flash. Be careful here, one foopa with the 815 is that the pop up flash is not high enough to prevent shadowing at close range. And I found that the on board flash is way too bright, but thankfully its adjustable. Shot to shot speed is average better provided you turn down or off the review option. With the burst mode set at high quality the camera shoots faster than the Rebel XT, almost as fast as the D70 (no kidding, I was surprised too!)Besides the LCD the next most obvious ground breaker here is that 15X optical zoom! It goes all the way from an incredibly wide 28mm to a whopping 428mm!! All in one lens!All the shots I took (once I got used to the camera) were all well exposed with little or no barrel distortion at the wide angle. Now talking images, I do not like the auto WB setting on this camera it tends to make images appear to have a blue tint. I have gotten much better results setting the WB myself. ISO settings go from 50 to 400, 400 is tolerable if you plan on reworking the image in photoshop, But I got the best results at 50 and 100.For the most part to date all the images I've taken with the 815 have had very good detail, and good saturation of color sometimes its a little too much, But that doesn't bother me, I tend to be artistic about things like that. The 815 also features FX such as Black and white, sephia, and Reverse exposure. It will do video clips in the usual resolutions, and allow you to zoom and record in stereo sound (Kicked Canons Butt on that one!!)It ships with all the standard adjustment controls you would want in a camera of this caliber: Contrast, sharpness, saturation, Color space. It also has a place where you can save three of your favorite shooting configurations and the assign it to a space on the mode dial. The camera ships with a very detailed and easy to use manual,Lens adapter ring, Lens Hood, Video & UsB Cables. I have not used the software yet.The last ground breaking feature of the 815 is its 1900Mwh battery, wich it needs, because of all those LCD Screens! as a result its battery life is about average for a camera this size despite its pumped up power pack.So lets wrap this up shall we?The pro 815 in my opinion is an impressive first showing for Samsung as they move into the upper levels of camera design, There are problems, the camera is a Pain in the butt when using low light, No close range flash capability, Resolution on the 3.5 LCD should have been about 150,000 pixels higher(Again where was Kodak with thier HiDef LCD?), And I found the program mode  to be a trifle inconsistant in shot to shot exposure reading, It tended to leave my shots with a blue tint at times.And the method to stabilize the lens just does not work.The pro's of the pro 815? with a tripod and that zoom lens a whole world of possibilities opens up(you just need a cool head and know how), Great construction, design, and menu system, Fantastic lens quality, Astounding burst capability, If you are an outdoor or nature photographer this camera is the bomb! Great fx, Over all quality of the pictures I've taken so far I would rate on a scale from 1-10, at around 8.5 or 9. Color reproduction is vivid sometimes a little too much depending on the shot (I don't see that as a bad thing)See the shots I've posted and you will see, this camera takes great pictures. Great Video mode (Not that I use it but-) I would not reccomend the Pro 815 as your Main camera. Mostly because of the trying times shooting in low light, and the over exposure from the built in flash. I would however strongly reccomend it to anyone looking for a great second or back up camera, It is a well built, versitile photographic weapon, But be warned... you need to know your shutter and aperture relations and settings to get the most out of it, otherwise you could be in for hours of frustration. When Samsung called it Pro they meant it. This is not a point and shoot camera by any means. Had this camera shipped with a 2.5 inch LCD and Kodak (or any for that matter) Image stabilization system, this camera would have been an absolute DEMON.Maybe next time? Until then I have mine, and have plans for using it alot more. I really wanted to give it 5 stars but the whole lowlight thing really erks me!That and putting such a big beautiful lens on a camera with no stabilizer is just irresponsible!! Be well all, thanks for your time and as always..Happy Shooting!!And as a personal note thanks to all of you for writing to ask for my advice and taking the time to say how you enjoy my reviews.Believe me I enjoy writing them for you! If I can I am always willing to help!", "Date": "November 18, 2005"}, {"Title": "Great, but could have been better.", "Author": "B. Skoczek \"actually im her son\"", "ReviewID": "R2TLXQ09P5IFJS", "Overall": "5.0", "Content": "I, like most people was drawn to this camera for its incredible 28-420mm lens and its 3.5 inch lcd screen. However i didnt like the max aperture of 8. But i gave it a chance anyways. First day i took it outside and took a few snapshots with ISO50, which comes in handy. ISO50-400 was fine for me.Basically this is a great camera but here are some things people can forget or ignore till its too late.-Aperture max is 8. Might be too small for more professional users.-Write time for RAW is 15 seconds and for TIFF 25. (supported by [...] )-TIFF function is not much better than jpeg and it takes 25 seconds to write.-Works worse than most cameras in dimly lighted areas(shutter speeds sink down to 2.0\" and 1/3 etc.). But you can easily avoid this with opening the flash.Overall this camera is wonderful. It has some problems but i find the good outweighs the bad by a landslide. Just remember its a 28-420mm zoom. Think of all the possibilities. O yea and it has a 3cm macro that actually works well.Props to Samsung on a camera well done.", "Date": "January 29, 2006"}, {"Title": "SLR quality without the SLR price....", "Author": "Jeremy Deats", "ReviewID": "R1A3IRTE9HJBVL", "Overall": "5.0", "Content": "First, the (now discontinued) Samsung Pro 815 is an outstanding camera. It looks like an SLR, but with the video mode option and it's incorporation of a fixed telescopic/wide-angle \"combo\" lens, it appears to be impossible to be using an SLR system (although Samsung seems to claim it as such). So what does this mean? It means if you compare the Samsung Pro 815 to an entry level digital SLR like say the Nikon D40, you'll find the D40 produces less noisy pictures at high ISO's (ISO 400 on the D40 seems to have about the same level of noise as ISO 200 on the Pro 815). Also, it will take less effort to get ambient, indoor shots with a true SLR and of course you can change out the lens on all digital SLR's, the Pro 815's lens is fixed/not interchangeable.On the bright side although it's not a true SLR, the Pro 815 is an excellent camera (see sample photos posted by myself and others) and has received rave reviews from professional photographers even when it was selling for $700+ in 2006. I suppose this is because A. it takes outstanding photos and B. It has an incredible Schneider-KREUZACH combo lens that can handle most photo opportunities without the need to change the lens moving from wide-angle to telescopic. C. It's packaged with more  features than the lower end Nikon and Cannon SLR's (e.g. 3.5\" LCD on back, waste-level shooting LCD on top, a ton of auto scene selection modes that actually work quite well).In spite of its mentioned limitations, I love this camera and I doubt I'll outgrow it. Because of its combo lens it will attract pros, but it's price point will attract beginners and intermediates. It's probably the best deal you'll find on a digital camera.", "Date": "May 11, 2007"}, {"Title": "I love this camera!", "Author": "S. C. Burnside", "ReviewID": "R3I2O0XGFB20BR", "Overall": "5.0", "Content": "I've read over all the reviews and I don't agree with them. For starters, I don't think that this camera is that difficult to use. This is my first digital camera ever, and I'm not having problems using it. The pictures are crisp and clear; I'm very impressed with the quality of the pictures and the camera. If I had one complaint it would be that the straps on the handle keep coming undone and I really feel that the quality on that could be better; I've had 2 instances in which my new camera almost crashed to the ground so my advice is not to carry the thing around by the handle!", "Date": "February 27, 2006"}, {"Title": "Amazing Camera", "Author": "Lennon Q. Public", "ReviewID": "R1TX2D647ZBGE", "Overall": "5.0", "Content": "I just bought this camera, and I think it is really great. The LCDs and lens are what sold me, and they're everything I hoped for. Very high quality camera. Feels solid, all the components are well made. Pictures are amazing (see my posted pics). I don't think you need to be a pro to use this camera, but the features are all there for those wanting manual control.", "Date": "November 27, 2005"}, {"Title": "Great, Useful Camera", "Author": "Doolly", "ReviewID": "R3PHK05WPA6WXL", "Overall": "5.0", "Content": "I purchased this camera 2 weeks ago.I love using it.It has lots of function to play with. It is easy to use.I didnt have trouble taking good pictures in zoom mode outdoor.Indoor, I had to use tripod if i use zoom.However, i cant really think of any occasion that i have to use zoom indoor other than my testing last week.Besides, it gives great pictures and I loved the price. I kind of considered DSLR camera but I gave it up becasue lenses were more expensive than camera itself. I considered one wide angle lense and one zoom lense. It would have cost me almost 2000 dollarsSo far, I love this camera.If this helps to anyone considering buying this camera, Id give two thumbs up.", "Date": "June 2, 2006"}, {"Title": "Doesn't anyone review lenses anymore?", "Author": "B. Godfrey", "ReviewID": "R186CNUMZZHHTF", "Overall": "3.0", "Content": "I just went into Fry's with my CF chip and took some test photos, comparing the Samsung Pro 815 with the Olympus E500 and the two lenses that come in its kit.  I had very high expectations of a lens made by Schneider-Kreuznach, but they were dashed by my tests.  The Chinese made lens on the Olympus took a very much superior photo to that of the S-K lens on the Samsung.  The S-K lens was not very sharp and there was further, noticeable loss of sharpness away from the center.  There was also severe pincushioning.  The Olympus lens was not perfect - it did exhibit slight vignetting - but sharpness was very much superior to the S-K lens across the frame, photos of those little yellow merchandise signs were square and sharp, and photos taken across the room were brighter and such gave an overall better subjective impression.I was disappointed, because I was really ready to buy this camera.  Now I will not and must go back to looking.", "Date": "February 21, 2006"}, {"Title": "Nice Camera", "Author": "M. L. Rahman", "ReviewID": "R2FNN9VPEYBODV", "Overall": "4.0", "Content": "I had used Nikkon D70 before I bought this one. The advantage of this camera is I dont have to change the lens again and again.It includes both wide angle and telephoto lens.In addition to the still image, this camera also has video feature.So I can capture the video too.I bought this camera before my niagara vacation.So, I took lots of wonderful picture in niagara and I also did video.So, this works for me much better.", "Date": "August 27, 2006"}, {"Title": "Definitially does it's job!", "Author": "S. WILSON \"Reminiscent Images\"", "ReviewID": "R5ET24Y767UX8", "Overall": "5.0", "Content": "I am a licensed child photographer, so I knew exactly what I was looking for when I bought this camera. This camera is now my favorite to use. I like that I dont have to change lenses, which lets me focus on only one thing - the children. I do have to use a tripod if I dont use the flash, but I expected that. The battery always outlasts my 2.0gb memory card, so I don't have to change the battery mid-photoshoot. One thing to know though - if the battery IS low, the shutter speed is very slow. So keep it charged. I recommend this camera to my friends, my photo specialists, and well, to everybody!", "Date": "September 11, 2007"}, {"Title": "Samsung Pro-815 Digital Camera", "Author": "Frank J. Visconi", "ReviewID": "R237V14UXENMQO", "Overall": "5.0", "Content": "Haven't had the chance to use it alot since purchasing it.  Still learning the MANY features the camera offers.  Although, bulkier than most smaller digital cameras, it is easy to handle but the quality of the pictures and the capabilities of the camera more than make up for the size/weight.  Love it.  Can do most anything with it.", "Date": "January 18, 2007"}, {"Title": "Great Camera", "Author": "Reader", "ReviewID": "R34QCAZ4V6GM0A", "Overall": "5.0", "Content": "I am not a techie, but I got the Samsung as a step up from a regular Kodak digital. Please forgive my lack of \"technical\" discussion.I find it an \"adventure\": I'm learning it as I go along and very day is a new suprise. Fairly easy to use and packed with features. Love the long zoom, love the huge LCD and all the other goodies. Pix are sharp and clear. I haven't seen any other high end digital that is  comparable. Only complaint is shutter lag time.I got it as \"refurbished\" here and saved a bundle. Seems new to me.", "Date": "June 18, 2007"}, {"Title": "Samsung Pro815 - Blows Competition Away!!!", "Author": "John A. Harris \"NekoPhoto.com\"", "ReviewID": "R26J7D61F6DCIJ", "Overall": "5.0", "Content": "First of all, this camera has every feature any beginner - intermediate - professional photographer could ask for.  The macro / zoom capabilities are outstanding, with a little practice and use of tripod or a patient steady hand.  The use of the top lcd (waist level) is the best way to shoot low level shots, otherwise the rear lcd is fine for everything else.  Too many features to list, (read the manual for all the features) but the main one is the shots this camera produces are excellent.  I do suggest using photoshop for editing, as any good photographer will attest to.  Want to see many more photos taken with this camera?  see: [NekoPhoto . com] Big Bang for the Buck is what this camera is all about!", "Date": "March 6, 2007"}, {"Title": "A keeper", "Author": "M. Seither \"The glider\"", "ReviewID": "R1ZZ5B9Q8YT8F3", "Overall": "4.0", "Content": "I've purchased the 815 twice. I sold a copy I had for two years because DSLRs are faster and can produce a better image. So why keep a camera that is slower and in the final analysis has a less robust image (in my case by another)? A couple reasons. By now the 815, which is no longer in production must be purchased used. The used price, in general, is a robust bargain. The camera is a solid build. Better than entry level DSLRs. The lens is a marvel going from 28mm to 420mm. At 28mm it's F2.2. Try to match that with an SLR. The sensor is smaller but actually a bit bigger than most \"super zoom bridge cameras.\" The choice of top, back or viewfinder for virtual viewfinder is un-matched. I can shoot from the hip with this camera because I can see the viewfinder on top. It's small but I can gage what I'm getting from it. The controls are mostly by button. Setting ISO, bracket, white balance, macro, focus, etc doesn't require a menu selection to get to. Any finally, when I reviewed the pictures I took with this camera over the two years I had it, I was pleased. I admit I shoot ISO 50 in broad daylight because high ISO shots are noisy. But 100-200 ISO is also acceptable. Since it's F2.2 I can get away with indoor shots at ISO 200 that are acceptable. The lens is sharp. Somebody reviewed this camera and said the lens isn't very good. I disagree. Compared with kit lenses that come with a consumer dslr, this lens is very good. It's true that you need to know what you're doing to get a good image here. This is an enthusiast's camera. Great battery life. If you can get an example at a great price, try it out. In the field you have a solid metal camera that will never get dust on it's sensor and you are carrying around lenses that cover from wide (28mm) to super tele (420mm)(15X). And since it is sold at bargain prices, I don't think you can go wrong.", "Date": "July 12, 2011"}, {"Title": "Not Perfect", "Author": "The Coyote", "ReviewID": "R1R6ACBF3NTLI4", "Overall": "3.0", "Content": "Like many other reviewers I think there is a lot to like about this camera. The quality of pictures is excellent (within certain ISO limits), the lens is incredible and makes it easy to adapt to any picture taking environment with ease. But there are a few things you should be aware of before buying one of these.First, the menus have no language-based instructions. You have to memorize the various icons. Not a real serious problem as you use the camera. Second, the large screen is wonderful but eats up battery time. And third, and most important, Samsung has abandoned this camera and if you want to get a rare part you're out of luck. This is the voice of bitter experience speaking, so take that into account when you read this. Samsung uses a ring adapter to attach the hood to the camera. My ring adapter broke. I've looked everywhere, tried everything, and there are NO/ZERO ring adapters to be had. As a result I have no camera hood and it's been a nuisance.Extra batteries? Cable Attachments? Copies of the manual? There's plenty of that around, but no ring adapters.If you get a good price this is a great camera, but be aware of the fact that Samsung doesn't support this camera any more, and after market parts aren't always available.", "Date": "January 18, 2011"}, {"Title": "Absolutely LOVE this Camera", "Author": "C. Savage", "ReviewID": "RR7IZU71SKE2Y", "Overall": "5.0", "Content": "I have had this camera for almost 2 years and I have to say that I absolutely love it!  You do not have to be a professional or even advanced to use this camera.  Although, it does have lots of options, you can still put it on \"Auto\" and just point and shoot.  This camera is still going to give you great pictures with vivid color.  You can learn the more advanced options as you get use to the camera.  I would highly highly recommend this camera to anyone who asked me about it.  I wouldn't trade mine for anything!", "Date": "August 21, 2008"}, {"Title": "Great digital camera", "Author": "Andres Cifuentes Cortes \"acifuent\"", "ReviewID": "RQQZR4SL5HSKB", "Overall": "4.0", "Content": "I'll start saying that I'm not a pro photographer, but this digital camera has some features that really impress me, starting by the big LCD screen, the 15 x zoom, fast response and multiple options to configure and adjust. Also it's a great price if you compare with others with similar features.De only draw back that I'm aware so far is that the size doesn't fit in any third party case, I bought a low alpine and it fit uncomfortable, probably best choice is to buy the original samsung case.", "Date": "July 2, 2007"}, {"Title": "GREAT BUY", "Author": "Christina Rivera", "ReviewID": "R28GKI56LIW4XC", "Overall": "5.0", "Content": "I'm no professional camera user myself, but this camera has such a crisp quality of taking picture, and it really teaches you how to focus and time your shots when using the manual zoom. It takes brilliant pictures, has great camera life, and I always have room on the memory card it came with for more picture.The only thing that's a little bit of a nitch is that the top screen is hard to use when your doing manual focus becuase its soo small, and that the eye finder is digital so its not like an SLR but other than that it absolutely rocks and is a GREAT buy!", "Date": "June 8, 2007"}, {"Title": "Great camera at a great price", "Author": "James H. Engel \"Puget Sound Area, Washington\"", "ReviewID": "R1G7J2UOI9STTF", "Overall": "5.0", "Content": "Still learning the ins and outs, but I am very impressed, particularly with the cost-per-feature.", "Date": "May 6, 2007"}], "ProductInfo": {"Price": "Unavailable", "Features": "8.0-megapixel sensor captures enough detail for up to 3,264-by-2,448-pixel photos\nSchneider Kreuznach 15x optical zoom lens; 3.5-inch LCD screen and 1.44-inch top-side LCD\nManual zoom, focus, and exposure; high-speed shot-to-shot transition for continuous high-speed shooting\nStores photos on CompactFlash memory cards; 64 MB card included\nTransfers photos via USB; compatible with Windows and Mac operating systems; rechargeable Li-ion battery", "Name": "Samsung Digimax Pro 815 8MP Digital Camera with 15x Optical Zoom and 3.5-Inch LCD", "ImgURL": "http://ecx.images-amazon.com/images/I/51thSZ0aN4L._SX300_.jpg", "ProductID": "B000BBF2XI"}}