{"Reviews": [{"Title": "Great camera for starters and above", "Author": "j. woods \"akaal11\"", "ReviewID": "R3PR9XLUKNP2KX", "Overall": "5.0", "Content": "I wanted to get a camera that was good enough to keep up with technology for the next couple of years. I then came upon this camera.  It has 5 MP max resolution, but if you want to save space or you have a small card, it can be lowered all the way down to 1.2 megapixels.  The camera comes with 32 MB internal memory, which is very nice, like if you are on a trip and you card gets full, you can easily switch to internal.  I got this on Christmas, and it did not come with a memory card, and no stores were open.  But i was still able to tqake 16 5MP pictures.  The next day i went to target and got a 128 MB card for $60. (Not the best deal but i was anxious and had money to spend).  This camera uses Sd/MMC cards (secure digital/multimedia card).  the Kodak Dock is nice but it is not necessary, especially for its $80 price tag. Just but rechargeable batteries and charger for $20.  I would reccomend the Kodak Easyshare starter pack along with this.  It is $35, but it has bettery pack, charger, and a bag, and some other accesories.This is as of 12/25/03 (This exact product)IncludesUSB Cable (Kodak Easyshare Dock is nice but it is not necessary)Kodak DX4530 5MP Digital CameraVideo Cable ( for slideshows on TV)Product manual ( i suggest you read this)Kodak Easyshare software ( nice software, with a simple, but effective and fun editing program.) 5 sheets of trial photo paper.Other ads and papers reguarding registration.AS i conclude, i have one last thing for those interested in it's 10X zoom.  optical zoom(3X) is the actual lens zooming in.  digital zoom(3.3X) is just the camera enlarging the pixels.  What is done with digital zoom is something that can be easily done on a photo editing software.  So if you're paying over 5-10 dollars for just extra digital zoom, id not.  The optical is what you really want.Overall, i have been EXTREMELY pleased with camera, and i would recommend it for anyone.  The movie mode is very nice, although you can't zoom while it is recording.  But, what more could you ask for, hopefully you aren't buying this to make a movie.  My only complaint is that the movie mode is slightly blocky, but is still fun to play with.  This camera is very user friendly, and i would say it could be used easily by 10 years old and up.  The manual is easy to comprehend and read.  Kodak also has a good support staff, and my camera came in perfect shape.  Thank you for your time, and i would strongley suggest this camera for anyone.", "Date": "January 3, 2004"}, {"Title": "Wonderful Camera!", "Author": "JDV \"Can you play with the big dogs?\"", "ReviewID": "RWM1QABLLRXBY", "Overall": "5.0", "Content": "I got this camera a few months ago, and absolutely love it. The picture quality is outstanding, and it's extremely easy to use. I swore I'd never get a digital camera until I could get a 5.0 MP, and I'm really glad I waited! I've had lots of people tell me the Kodak camera docking station isn't necessary, but let me tell you, it sure is convenient to use, one button, and the pictures download to the computer. The best part is it's always charged and ready to go, no dead batteries!You won't go wrong with this camera no matter what your photo taking experience may be!", "Date": "November 10, 2003"}, {"Title": "One great digital camera", "Author": "D. Couse \"darkman1969\"", "ReviewID": "R1YYMQAVZT69VZ", "Overall": "5.0", "Content": "I have had this camera about 2 weeks now and I can honestly say there is not a single thing I dislike about it.  I took it on a trip to Estes Park, CO and the pictures came out fantastic.  The detail is amazing and the color was spot on.I've also had no problems with the indoor quality of my pictures and what I don't like I can easily correct with my photoshop program.The unit is lightweight and fits nice in the palm of my hand.  It has 5 seperate modes (auto, sport, night, scenery and macro) and it even takes Quicktime Video!  I specifically purchased this unit becuase of the Kodak name and the cameras ability to accept SD cards.  I think that CF (compactflash) is on the way out and I already had a SD card for my PPC.The camera hooked up to my WinXP machine without any trouble and I was transferring photos and video within minutes.Where I think this camera really shines is the Kodak Easy Share software.  It lets you unload your camera, create albums, modify the photo (very basic stuff though), and even order prints online!  I've already taken advantage of the online ordering and the quality is fantastic.  I highly recommend you have a broadband connection though, since the file size on \"best\" setting is rather large.Dont be afraid to try this camera!", "Date": "October 17, 2003"}, {"Title": "Excellent camera for beginners, great for Moderate users", "Author": "Nickels", "ReviewID": "R1FTS0YDO37YWL", "Overall": "5.0", "Content": "If you don't know what an F Stop is, have no idea how shutter speed effects your photograph, or don't know aperture from temperature then this camera is for you. Kodak's Easyshare is your basic \"turn it on, aim and shoot\" type camera. All it takes to operate this camera is the ability to insert a battery. The picture quality is amazing in normal lighting conditions, but does suffer a little in low light without some user knowledge or a tripod. The camera has a few features that you can tweak, such as small exposure adjustments. My favorite feature on this camera is the movie mode. Having mini movies with sound is such a joy when you want to show people something, and a still picture just doesn't cut it (like baby's first steps). I almost find I am making more movies then taking pictures these days.I was initially unhappy at the ease of use, since I am a photography junkie that loves total control of everything. However, as time has gone by I find that I am getting exactly the types of pictures that I want to get, but I don't have to do all of the thinking anymore. If you don't mind letting the camera do most of the work then look no farther. For price, quality, and ease of use I would give this product an A+. Lastly, I would recommend that you purchase rechargeable batteries and a charger, and also at least a 256k memory card.Happy photographing.", "Date": "June 1, 2004"}, {"Title": "wonderful all-around camera", "Author": "M. H Shamp", "ReviewID": "RJ5X0B28VHD0U", "Overall": "5.0", "Content": "I bought the Kodak 5 MP camera as an up grade for my HP 320 2MP camera.  I notice another person here mention that he was displeased with his Kodak because he couldn't tell the difference between his new 5 MP camera as compared to his old 2MP camera, so he returned it.  My experience is the same as his - at first.  If I take a picture of my room with both cameras, I cannot tell the difference at all at casual glance simply because the 2MP camera I have does such a wonderful job of normal picture taking.  I really recommend people who just want normal pictures and don't want to part with a lot of dough to stick with the 2 MP cameras, because it costs half of what a 5 MP camera costs.However, I must stress that there IS a difference between the picture qualities of the 5MP and the 2MP camera.  It is just that the difference isn't that obvious, and you have to look very carefully to see it.  The 5 MP camera is definitely better and if you look at its pictures long enough, you will notice it.  The main reason I bought this camera is so that I can take close-up pictures of dishes I cook so that I can show off my cooking to friends.  Without a doubt, the 5 MP camera takes clearer pictures of close objects, but this is not to say that the 2 MP camera can't do it.  It just doesn't do such a good job, but it does do an acceptable job - a friend said the shot of my lasagna with the 2MP camera made her mouth water.  The 5 MP cameras don't do a perfect job of it either when compared with the professional pictures I see in cook books, but it is better by about 20%.  You have to be picky to see the difference.Overall, the Kodak 5 MP camera has the following major benefits over the HP 2 MP camera:1. It has a lens cap.2. It does short little movies.3. It allows you to delete pictures selectively from within the camera.  This is a very nice feature when you go on trips because then you can get rid of messed up pictures and not take up as much memory space.4. It has a close up option for objects between 2 to 28 inches.5. It has a night option to allow you to take pictures in the semi-dark.6. It has a sport option to allow you to take pictures that are moving.  (The HP camera does a fine job of taking pictures in a moving vehicle, however.)7. The LCD screen is clearer and brighter.8. There is a TV plug-in that allows you to look at the pictures from the camera directly into a TV (I can't imagine why anybody wants to do that, but it is an option)9. It has an easyshare button to send pictures directly to printers, but I find this option pointless because printing pictures costs a lot (ink and photo paper), so why wouldn't anyone look at the pictures on the computer first and choose the best ones before they try to print it or email it?There is one drawback to the Kodak camera package:  the software that comes with it isn't half as powerful as the HP software.  My main complaint is that you can't crop a picture completely at will.  What's worse, when the picture is cropped, it still just as big as the original one in memory, and even if you shrink it, it is still humongous and slow to send.  For example, I have the same picture cropped and shrunk to identical size (about 5 by seven inch) by the two programs.  The resulting pictures look identical, but the HP software's picture is 43 kB whereas the Kodak one is 304 kilobytes!  When you have a dial-up connection and have a lot of pictures to send like me, you will find the Kodak software very irritating.  I can't believe they call themselves \"easyshare\" when it isn't easy to share at all. The conclusion is that if you are stingy and uncomfortable with dishing out a lot of dough, you are better off with a 2 MP camera.  It does an excellent job of point-and-shoot.  If you like to have a camera that does everything and you don't want to be caught with a cheap camera, the Kodak one is the way to go.  Don't be surprised, however, if you can't tell the difference.A word of warning to those who wants the 2 MP camera:  My HP 320 has a very high customer rating at Amazon.com when I bought it six months ago.  Since then, however, I notice that HP came out with a newer version of HP320 that Amazon is selling.  It costs only half of what I paid, and the customer rating isn't as good either.  I cannot speak for that new model, but I can say that my HP 320 takes perfectly clear pictures.", "Date": "November 7, 2003"}, {"Title": "AN EXCEPTIONAL VALUE", "Author": "Tim Janson", "ReviewID": "R3PI40DFEJ6Z7Z", "Overall": "5.0", "Content": "When I decided to buy my first digital camera recently I was quite dazed by the number of choices.  I checked magazines, Consumer Reports, etc...there were so many to choose from and what's more...digital cameras seem almost obsolete as soon as they come out.I was stunned by the number of different models available from such big names as Canon, Fuji, Kodak, HP, etc...I finally decided on the Kodak4530.  My choice was based on Consumer Reports ratings as well as the Kodak name.I'm pretty good with tekkie stuff but this was my first digital camera.  No problem.  This was one easy to use camera and really no different from a standard film camera.On the menu you can select from 4 grades of quality although beware that the higher quality makes the file size quite large if you plan on uploading or e-mailing it.The quality of the pictures is just fantastic.  sharp as glass...took a picture of our two year old playing with a garden hose and you could see the drops of water just frozen in mid air...clear as day!The camera can take short videos as well as pictures and comes with such features as zoom, red eye reduction and more.The 4530 doesn't have some of the bells and whistles of more high end cameras but a 5.0 mega pixel camera at under $300 is a great deal.  I highly recommend it.!", "Date": "October 11, 2004"}, {"Title": "Great quality for the price.", "Author": "\"gleeglue\"", "ReviewID": "R3E6CNII4LKA8E", "Overall": "4.0", "Content": "I purchased this camera before a recent family trip to Disney World.  I bought the camera, loaded the software on my laptop and was up and running in less than 2 mins.  The docking station is a must for quick transfers of pictures.  I am also impressed with the software, as it is super easy to create albums, crop pictures, and order prints (Kodak uses Ofoto- which has been a good service for us).  My only complaint (and it is a big one) is taking pictures at night is a pain in the rear.  The engineers must have been drunk when they designed the camera, as they put the flashing green light next to the viewfinder -making it virtually impossible to see through the viewfinder at night.  It is completely annoying.  That being said, the quality of night pictures are good (if your lucky enough to hit your target through the viewfinder).  Overall, I am pleased with this little camera.", "Date": "November 15, 2003"}, {"Title": "Great camera, lots of features, easy to use", "Author": "Tom Gibson", "ReviewID": "RPTZKX0VYC19F", "Overall": "4.0", "Content": "Let's start with the negative first to get it out of the way. This camera does not take good dim light zoomed shots from a distance (as in from the back of a theatre to the stage). Everything else about this camera is great. It is easy to use, and well-lit or flashed photos are beautiful. The picture settings do help in different situations. The action setting is so good that I was able to take blur-free pictures of my cat jumping in the air after a string. Other settings include night shots, close up, and distance. You can also adjust the flash for red-eye, fill, or turn it off. Due to the delay from the time you press the button to the time the picture is taken, hold the button down slightly prior to taking the picture. When you do press, it will snap instantly.The movie mode is actually nice. I didn't think I'd use it, but it's great to have when you want to capture more than just a picture.As an added bonus, the software that comes with it to retrieve and view your pictures is very easy to use.I highly recommend this camera, but you should also get a memory card so you can take more pictures.", "Date": "June 17, 2004"}, {"Title": "Great Quality for Price, Especially Video!", "Author": null, "ReviewID": "RO4B7XZJ1VHXZ", "Overall": "5.0", "Content": "I must say this is my first purchase of a digital camera, but I am very pleased with my choice.  I was looking for a resonably priced yet high quality digital camera.  I don't think you can find another 5.0 megapixel camera for this price.  Another thing I liked about it was the option to that videos with sound.  That was something I wanted in a camera.  Unfortunately, you have to buy a decent size card in order to get any length at all.  I bought a 256 MB card, and I take 1-3 minute clips.  It works out great for me.  I think with the card, I can take a little over 16 minutes of video, plus a few high quality pictures.  I bought the card from accupc.com which I ran across while looking for a the least expensive card.  I don't have the dock because I order my prints online from clarkcolor.com (can prepay for prints at 19 cents each), which to me is more cost efficient than the price of the docking station and paper, etc.  Plus I have a CD burner on my computer but not a DVD burner.  I found a program called EOVideo for 34.95 which converts the videos (in Quicktime format) to SVCD which can be burned on to a CD and then played on most DVD players.  Pretty good quality video too...about the same as any typical home video.  Bottom line, I LOVE IT!!!", "Date": "June 8, 2004"}, {"Title": "Great camera!", "Author": "qleaper", "ReviewID": "R2KEVVVFRVY0IT", "Overall": "5.0", "Content": "I finally decided to go digital, and got this camera right in time for the Memorial Day weekend. I couldn't be happier. I'm using the second best level, and the pictures are incredible, very, very crisp. I ordered some of the pictures online, and also blew one up to 10x8 using the Kodak machine at the local grocery store. They all came out beautiful!  One thing that worried me, however, was that after a while the camera wouldn't turn on by itself when the cap was on (I had to turn it on and off 2 or 3 times). But that wasn't a big problem, as it worked fine if I took the cap off manually. I have also noticed that you have to be extra careful not to shake while taking pictures inside, as they can get a little blurried. But that didn't happen at all with the pictures taken outside. The other negative for me was the software included. I installed it at first, but noticed it overrode my Windows XP photo viewer -- and the annoying thing is that using the Kodak software, there was no arrow to go back or forward to view another picture on a bigger scale. I removed the software, and am doing fine downloading my pictures using XP's scanner/camera automatic detection, and fixing them with an editing software I have used for a few years.Despite all the little problems listed above, for the price, you can't find a better camera. But shop around -- the day after I found it with a $50 rebate at an office-supply retailer...", "Date": "June 7, 2004"}, {"Title": "Cheap, Good, Easy = Great Value", "Author": null, "ReviewID": "R1KHZGFJS2CL9S", "Overall": "5.0", "Content": "I recently purchased this camera.  I was a bit apprehensive over the picture quality as some other Kodak easyshare camera's have taken some criticism.  However, this 5 MP camera has excellent, sharp photo quality (comparable to 35mm.)  In addition, it is so easy to use.  I never used a digital camera before and I still have no reason to look at the instruction booklet.  The camera is pretty self explanatory with its helpful menu screen.  Editing photo's is a breeze and the software is very user friendly.  The various setting mode's (sport, close-up, night, landscape, and auto) all work well for their applications.I highly recommend this camera to anyone seeking a great value.", "Date": "October 20, 2003"}, {"Title": "Great amateur camera", "Author": "C. France \"cabbottfrance\"", "ReviewID": "R26OPGHRZKAC60", "Overall": "5.0", "Content": "I love to take pictures, but I didn't want to spend a fortune on a camera. I bought a couple of different types and took them both back for a refund. I came on Amazon to see what viewers had to say about particular cameras and this one had high ratings and a good price. I have NOT been disappointed.I took pictures of my son's ball team this past Spring and the actual league photographer offered to buy the picture from me! Several parents thought that the pictures were professional! I also took some pictures in my garden this summer and it took very vivid, very sharp details of my subjects. I even captured a bumble bee hovering above my blue salvia.I tend to have a shaky hand and the pictures still turn out beautifully. My 9 year old used the camera to take pictures for a school project. His pictures turned out so well that the judges questioned if my son had any help taking the shots himself. My Mom and my neighbor are both thinking about buying this camera because they have been impressed with the results.I recommend this camera for any amateur. Pictures even print clearly to an 8 x 10 photo, but 4 x 6 is my favorite. This camera is just large enough that I can get a good hold of it. This helps with my shaky hands. My indoor pictures have been just as great as my outdoor shots. The camera instructions were written clearly and I have truly enjoyed this camera.", "Date": "September 16, 2004"}, {"Title": "Easy is the key", "Author": "J. Comeaux \"AudioBook Fan Extraordinaire\"", "ReviewID": "R1LG3QV72EEG87", "Overall": "5.0", "Content": "Let's face it, most people want a camera that is easy to use. This was my first criterion in looking for a digital camera. But I didn't want to compromise on much else either: megapixels, flash flexibility, close focusing, size and weight. This camera can be used right out of the box, with plainly labeled buttons and knobs. But I tried all the features too, like zoom, no flash, night photography, close-ups, mixed lighting. My results show that this camera has the right mix of technology and ease of use. The software to bring the pictures to my Mac was also simple. The video recording capability was fairly good - not tape quality but lots of fun. Be sure to buy a 256MB memory card to supplement the 32 MB installed. I can take 500 good quality photos with the one chip. My 8x10 prints were super! Let this be your next camera.", "Date": "January 3, 2004"}, {"Title": "I've Finally Got a Product Worthy of Writing My First Review", "Author": "C. Kidd \"cnmkidd\"", "ReviewID": "R1JVH6330SB9VB", "Overall": "5.0", "Content": "My husband and I have never owned a digital before, so over several months Amazon reviews were very important to us when making the choice for our first digital camera.  Thank you Amazon, thank you everyone who takes the time to send in your reviews.  We got our camera, opened the box and learned everything in one night.  Fun, fun, fun. I am very comfortable with this camera and feel pretty confident using it.  The software was helpful and fun too.WE LOVE THIS CAMERA!", "Date": "June 15, 2004"}, {"Title": "Excellent Buy!", "Author": "Rainy Hafermann", "ReviewID": "R2G0FS16YWWDB6", "Overall": "5.0", "Content": "Before buying my digital camera, I did tons of research. I wanted an easy to use camera, easy to use software, without breaking the bank.  My Kodak DX4530 did not disappoint me.  I've had the camera for 3 months now and it's taken great pictures. It's so easy to use, my 12 yr.old uses it all the time.  The one button delete and review is great.  The software does an excellent job enhancing the photos and taking out red eye.  All you do is plug it into your computer and the software quickly downloads all my photos.  It doesn't get any easier than this Kodak!  And with the one touch printing, it produces beautiful, detailed colored photos, using Kodak's Premium photo paper.  If you want a camera that takes great photos, without having to be a technology wizard to operate; this camera's for you!!", "Date": "April 13, 2004"}, {"Title": "Great Camera", "Author": null, "ReviewID": "R1I8DXOCO8LT7M", "Overall": "5.0", "Content": "We just got this camera, having decided to upgrade from a KodakCX4200 that took a swim in a nearby lake (it was submerged completely, but dried out and 4 days later, was working again  just fine). I chose the DX4530 because we already had the docking station and because this camera could take videos. We LOVE the videos! Both audio and visual are good. Someone said the videos were blurry, but ours seem crisp enough and don't look blurry at all. The Kodak is a great camera; good-looking video, excellent photos, well made, a snap to use; it feels good in your hand, not like a kid's toy. I'm looking forward to taking it on our next trip. Get extra memory and a battery charger you can plug into the car's cigarette lighter, and you can't go wrong. I simply can't say enough good things about the Kodak cameras I own. We're so pleased with them, and would never hesitate to get another one. The only thing I would change is to add a neck strap - I'm personally just not comfortable with the wrist strap. Otherwise, this camera is A-1 in my book.", "Date": "November 29, 2003"}, {"Title": "Could not be happier.", "Author": "Christopher Walken", "ReviewID": "RP39G38JOMAEI", "Overall": "5.0", "Content": "I bought this camera on Friday, my wife went into labor on Saturday night with our first child.  After flipping through the instruction manual for about 10 minutes, I was a pro with the camera within 5 minutes of picking it up.  I highly recommend buying the dock for this.  I purchased it at Costco and the dock came with it.  They pictures are incredibly crisp and it takes extremely good pictures on auto mode.  I was also very impressed with the close-up setting for shots within 28 inches.  The editing program that comes with the camera is pretty good but I only found two things I didn't like about it.  The first being the fact that, while it has a good redeye reducer and corrector, it doesn't do much for the other weird color reflections you sometimes can get from photographing animals.  Also, the automatic folder feature it has once you download pics into your computer is nice, but once they are modified, it lacks a feature that allows you to move them to other folders easily.  All of these problems can easily be fixed by working in other programs.  I would buy this camera again if I ever needed to.", "Date": "October 29, 2003"}, {"Title": "dbeasley from Charleston, SC", "Author": "David M. Beasley \"dbeasley1\"", "ReviewID": "R2O60H26XZSN1V", "Overall": "5.0", "Content": "Outstanding camera!  Even took it to Iraq on Day 1 of the northern invasion.  Took pictures with the camera up against the Night Vision Goggles, came out clear.  Don't know what that other guy is talking about who rated it low....poor photographer or got a lemon.  The internal memory is awesome as well, it is aways there so use it as a back-up. You can select which memory source you want to use ie. internal or flashcard.  Rec you get a 256mb memory card, then you don't have to worry.  I don't have the docking station, nor do you really need it.  It has a USB plug that is very easy to hook up to your computer to download photos.  Software they send you is a little awkward, during set-up, when it asks \"do you want it to start up auto\", say no...or it comes up in task manager running all the time.  USE THE LITHIUM BATTERIES, no normal Akal batteries.  Easy to use and nice size.  It's a Kodak, they've been doing this photo stuff for a little while, wouldn't you say?", "Date": "March 7, 2004"}, {"Title": "Best buy for money", "Author": "VS \"betsy171\"", "ReviewID": "RRHV2ISWZUYYN", "Overall": "5.0", "Content": "I absolutely love this camera!  A lot of people have been complaining about the lack of \"features\" and that a serious photographer wouldn't like this camera, well, I disagree.  I am a professional photographer and use mostly Nikon SLR technology, but sometimes carrying around a bulky camera just isn't logical.  If you are looking for a camera that gives great results in a small package, this is for you.  At 5 MP you get the quality that a good photo needs, and the price is more than affordable.  Also, this camera is faster than a lot of others on the market right now.  The click-to-capture delay is minimal, and the size of the camera is great.  A+++", "Date": "December 28, 2003"}, {"Title": "4+++ out of 5", "Author": null, "ReviewID": "R228GDASKEW801", "Overall": "4.0", "Content": "Just bought this camera a few days ago.  It could not be easier to operate. All functions are logical and clear. The menu items are made as easy as possible. The only gripe so far are the lens cap is a bit of a pain. It's supposed to pop off when the camera is turned on, sometimes it doesn't. The other is the camera needs to have some type of grippable surface added to the body. I can't get a firm, comfortable grip and feel like the camera could slip from my hands.Pictures are great.", "Date": "March 23, 2004"}, {"Title": "5 all the way", "Author": null, "ReviewID": "RWIKQUUL414BC", "Overall": "5.0", "Content": "There surely are some things that could have made this camera better, but nothing is perfect.  But when you talk about picture quality, reasonable price, ease of use for occasional photographer, this camera is a great value.I purchased mine with the charging dock and have no regrets.  The rechargeable battery seems to last infinity longer than my previous ricoh digital camera which absolutely ate the aa batteries.  Maybe there's a slight exaggeration but I have found the rechargeable battery seems to have a good life before it must be recharged.Kodak is a name to be trusted.  I've seen cameras come close to this price on ebay, and that's for a REFURBISHED MODEL.  Buy new to ensure your warranty.I'm having a lot of fun with this camera and am well pleased with the accompanying software and the picture quality.", "Date": "June 18, 2004"}, {"Title": "So far, performing great", "Author": "a reader", "ReviewID": "R8DMTKK93P30E", "Overall": "5.0", "Content": "Bought this camera last month to replace my 2 megapixel digital camera, and am very pleased so far.  I take lots of family snapshots, indoors and out, and do some touch-ups and tweaking with photo editing software regularly.When I need to crop my 4530 photos, they still look sharp and in focus (which I couldn't say about my last digital camera).Easy-to-use, lots of features, no complaints other than the short videos this camera takes are blurry.  I'm not too perturbed with that, though, because I didn't buy this for the video feature.  A great camera at a great price.6/6/2006:  I wrote the above almost 3 years ago and still have this camera.  It's still going strong with no problems.  Highly recommended.", "Date": "October 22, 2003"}, {"Title": "A fine camera that does its job very, very well", "Author": "FreddyB \"FreddyB\"", "ReviewID": "R2TAL5A9YF9CPS", "Overall": "5.0", "Content": "I had this camera almost two years and foolishly bought a Canon A95 5 mpx camera.  Sure the Canon has slightly sharper pictures but is terrible in low light.  The Kodak 4530 takes great pics under almost any conditions, simple to operate and I took it out of the drawer and am delighted to return to this terrific camera.  Highly recommended for anyone and at a great price if you can still find one.  My Canon A95 will just rot away in the drawer, I guess.  My next camera will be a kodak, I'm pretty sure.  PS  I shake a lot when I take pics so I always use the \"sport\" mode for a faster shutter speed.  Majority of pics are great and I can see the quality of the shot in the LCD.  My Canon had an artificially enhanced LCD that makes every shot look good, so you have no idea if your shot was good or bad. The Kodak has a true LCD that does not lie.", "Date": "December 7, 2005"}, {"Title": "Great buy, great camera!", "Author": "Laurie W. \"lauword\"", "ReviewID": "R1HXRLFU30KGHL", "Overall": "4.0", "Content": "I got the Kodak DX4530 as a Christmas gift and so far I am impressed.  I see many people have complained of low lighting problems, but all the pics I have taken in low light have turned out fabulous.  I must admit, I am an amatuer photographer and only use it for vacations, special occasions and my 3-year-old nephew but so far my pics have turned out great.This camera is extremely easy to use.  I never even had to open the manual and was taking pictures immediately!  The software is a breeze and I am very pleased with this camera over all.I will say the lens cap is a pain in the butt and Kodak should have made an automatic.  The only other thing negative I have to say is that the green light is right by the viewfinder so its hard to see when taking picutres in the dark.", "Date": "February 9, 2004"}, {"Title": "U can't get any better for the price u paid", "Author": "Fred Ku", "ReviewID": "R3R4AB3DXZ2QGP", "Overall": "5.0", "Content": "When I first got this camera after the price had dropped, it was worth it! The pictures are so clear and not to mention when I record video!.  The only draw back for the video is that you need quicktime to replay which I think many people prefer media player.  The setup is very easy to use and i would recommand anyone who's looking for a 5MP should consider Kodak.  Another reason i chose Kodak over Cannon A70 is because A70 use 4 batteries instead of 2 and i also i heard the A70 is easy to break....", "Date": "January 24, 2004"}, {"Title": "Great camera!", "Author": "K. Miranda \"the fluff\"", "ReviewID": "RPHI4MUW0I5TQ", "Overall": "5.0", "Content": "second digital camera, first was a gift, DX3215. only 1.3 MP though. this is a very good camera if you do not want to deal with shutter speeds, or whatever those things are! very good deal for only $300!!PROS: QUICKSTART 2 seconds!, get to use old dock from camera, good with recharging batteries, battery life is very good, much better than what you usually get, can use AA and not have to buy special batteries,  beautiful images, zoom excellent, also make videos long enough to fill up your space (no 1 minute caps, like others), if you do not have the dock it comes with software and cables to hook it up, very fast loading onto computer, camera looks good too!CONS: lens cap falls off, would have been much better with a shutter, however when you turn it on the cap immediately falls off so no worrying about missing pics (i guess thats how they created it), 35 mb internal memory, holds about 21 at 5mp so should get at least a 128. i am getting a 2 256's ($60 each), 35 mb about 1 1/2 minutes of movie, no zoom on movie (but this is a camera, not a recorder)", "Date": "December 28, 2003"}, {"Title": "Very easy to use", "Author": "J. P. Warrant \"JPW\"", "ReviewID": "R2EHZKBLEKPRKS", "Overall": "4.0", "Content": "I got this camera about a month ago; I am a big photography nut and am very literate with both SLR cameras and digital.  My father bought this camera for me, and although it wasn't as \"high tech\" as the cameras I was originally comparing, I must say that I am fairly pleased with the Kodak.The internal memory is nice because you don't have to buy a memory card unless you take several dozen pictures at a time.  It will hold about 24 pictures taken in the highest quality setting.The controls are simple and easy to understand; many digital cameras overwhelm the user with difficult, confusing, and seemingly endless menus.  Unless you like being able to control the shutter speed, aperature, and other manual settings, you'll enjoy how simple the Kodak makes digital photography.  A big plus is that the camera includes a brief explanation for menu items so that the user isn't confused about what abbreviations stand for.Some people have mentioned the blurring that takes place; blurring takes place with most cameras because the shutter speed is generally slower with digital cameras.  And the shutter delay is VERY good with this camera; several digital cameras that I have tested have had horrible shutter lag.  The Kodak's delay is minimal.The dock is nice for convenient recharging; once you're done taking pictures, just put it on the dock.  It's also nice for transferring pictures.  Put the camera on the dock, push the \"Kodak\" button, and your preferred program automatically opens for downloading.  One downfall I've found is that the software is not compatible with Mac OS X, which I have, so I've had to use iPhoto for downloading pictures.  (Which is fine, since that's where I keep pictures anyway.)  (UPDATE:  The software is now compatible with Mac OSX.)In short:  pros of this camera: ease of use, simple menus, convenient recharging, internal memory (no need for memory card).  Cons:  short battery life when using LCD screen for picture taking; lens cap has a tendency to come off when bumped slightly (bad if you're carrying it in a bag).", "Date": "December 28, 2003"}, {"Title": "Not happy", "Author": null, "ReviewID": "RB9PN3K75W5KG", "Overall": "1.0", "Content": "I purchased the dx4530 after reading review and research. It takes great pictures,if you have good light. In low light and what I would not consider low light the pictures are dark even with the flash. Took pictures at a wedding and all were too dark. You can with the software make them look alitte better but who wants to do that to every picture. It does have a low light setting but you have to hold very still and nothing can move in the picture or it will all be a blurr. I have kids so holding still is not an option for them. Kodak told me to use a tripod and low light setting, but you then have to carry that around. I returned my dx4530 to the store.", "Date": "December 5, 2003"}, {"Title": "Poor indoor results", "Author": null, "ReviewID": "R1L0J2RATXJQOC", "Overall": "2.0", "Content": "I have a 3 year old 2MP DX280 that takes much better photos.  Indoor shots are dark and blurring is a problem with the DX4530.", "Date": "December 20, 2003"}, {"Title": "Excellent photo quality - Cheaply made exterior", "Author": "French Lavender", "ReviewID": "R1UFT36X4M48UF", "Overall": "3.0", "Content": "This 5.0 digital camera takes perfect photos and the ease of use is great.  I also bought the optional camera dock and it  makes it easy to download photos to your computer, but is way overpriced.The only thing I dislike about this camera is the VERY cheaply made plastic exterior.  I would have been willing to pay a bit more for a more substantial casing.  It was made in China though, and I'm finding goods made in China are very cheaply made.Kodak's warranty service is unacceptable to me.  I attempted to get warranty service and found through their RECORDED message that they repair camera's with used parts.  If your camera needs replacing it will be replaced with a re-furbished camera.  If Kodak decides it isn't covered by their warranty, they will let you know the cost of repair.  If you decline having it repaired, you will be charged $45.00.I send my photos online to Ofoto (Kodak) for developing.  I receive the prints by mail very quickly and the look is exceptional.", "Date": "August 10, 2004"}, {"Title": "Easy to use, great  camera for under $200 price tag", "Author": "ArtK", "ReviewID": "R3RWQAPEN82WSQ", "Overall": "5.0", "Content": "I bought this camera few days ago and let me tell you I cannot stop playing with it. Images are excellent quality.You can shot pictures in different modes like Sport - for objects in motion, landscape for distant Senery, Close Up,Night or you can leave it on AUTO which will do just fine.  I had no problems hooking this camera up to my PC or TV(ohh yes, you can do that).  It will record video/audio with good quality if its not too dark.You can watch you recorded video on TV.  If you want record it onto a tape, hook it up to VCR, play and record. Easy!!This camera has 3x optical zoom. Considering the price, that's fine with me. It comes with 32MB internal memory, PC software, Kodak batteries, USB cable and RCA cables for TV connectivity. For long video recording, you will need additional memory card.If you're planning on getting a Printer Dock later on please note that this Camera is NOT compatible with Kodak Printer Dock 6000.  You will have to get a 4000 model which is very hard to find at local computer/electronic stores.  You will most likely have to get it directly from KODAK.Personally I prefer and recommend EPSON PictureMate which is more expensive but you get 100+ pics per $28 cartridge/paper and print quality is even better. BUt thats another story.If you're considering buying this camera, do it. You will not regret. I read many review before I bought mine and believe me I haven't found too many negatives. I read reviews that complained about things like not enough optical zoom, lans-cap falling off when camera powers on, etc. All I have to say to that is please look at the price tag.  You're getting a 5.0mp camera for $200 not $500.Camera is well worth the price and I recommend it to everyone.Good luck and Good day to you all...", "Date": "August 6, 2004"}, {"Title": "Great Picture Quality", "Author": "Eric Snyder", "ReviewID": "R36J23RJDIPYOI", "Overall": "5.0", "Content": "I work at a retail store that sells both the Kodak DX4530 5MP and the Sony CyberShot P-92 5MP.  I only ever buy Sony products, so that's what I was going to buy, but I decided to try them both.  I walked around the store taking the same pictures with both cameras for comparison.  I went inside and out to compare lighting, textures, and zoom.  I was amazed at the difference in quality.  The Kodak, while having less features than the Sony, had far better print quality.  I printed 4x6, 5x7, 8x10, & 10x15 inch prints of several of the photos (We also have a photo lab in the store).  The Kodak camera blew the sony camera out of the water on the 10x15s.  The prints looked better than some film cameras produce.  I showed several people both pictures and all of them commented on how good the Kodak looked.  They couldn't believe that is priced $40 less than the Sony.  Bottom Line: Fantastic Camera that I recommend to all my customers.", "Date": "May 29, 2004"}, {"Title": "We Love this camera", "Author": "James Nicholson", "ReviewID": "RGEZA2MHJJKEO", "Overall": "5.0", "Content": "This was a Christmas present this year and has turned out to be the best present ever! The DX4530 is very user friendly and offers features such as a battery charger in the dock. Simple USB cable connects easily  with the computer, plus a video audio cable that connects to the front of a TV or VCR make this camera fun. I am impressed with the quality pictures and the Kodak software that is very easy and logical to use. I highly recommend this camera.", "Date": "February 28, 2004"}, {"Title": "Awsome Pics!", "Author": null, "ReviewID": "R3HXKED807XBDM", "Overall": "5.0", "Content": "I received this camera for christmas and I just can't put it down!  It is easy to install, use, the directions are understandable to the average Joe, and man is it hard to mess up a shot!  LOVE ITwxmouse", "Date": "January 25, 2004"}, {"Title": "I LOVE this camera!!!", "Author": null, "ReviewID": "R36PTHATTHZFF9", "Overall": "5.0", "Content": "This is my first digital camera. I hate to read instruction books. But this one is so easy to use, I just skimmed instructions, and was out taking pictures. It has 4 very straightforward controls, and also an auto setting. I love the software too, its so easy to transfer my photos & video clips, edit the photos (this is a FABULOUS feature; less-than-perfect shots can be brightened, cropped, freed from red-eye, etc.), and email them! So much easier to use than I feared a digital camera would be! Get the dock at the same time, its well worth it for data transfer & especially recharging the camera. Good camera for people who already know how to use email, but are not super-savvy at computers otherwise.", "Date": "January 23, 2004"}, {"Title": "Excellent camera with charging dock.", "Author": null, "ReviewID": "R2UCI2QEES2OG3", "Overall": "5.0", "Content": "I have had a kodak DC series 2.2 MP for 2 years now and am quite happy with its ease in use.  So I bought this DX 4530 5mp for my husband for Christmas.  Quite pricey but well worth the money.  He uses it for construction before and after pictures and e-mails them or burns them onto a CD right from the kodak software provided.  We bought the dock just because it is so much easier, no messing around with cords and batteries, just put it back on the dock, press the \"transfer\" button on the dock and it transfers your pictures to your pc without even opening the program.  Then you can easily edit them when they go right into the Kodak photo editing program automatically.  A child could do it.  The pictures are clear as they can be, we actually had to read the manual to get full use of all of its functions at first, but I guess we can't get around that, it even takes short videos with sound, so there are alot of features with this camera.  I would highly recommend it if you can afford it.  The dock is on sale (make sure you get the C/D series dock) now at one of the big office stores for 59.00 extra.", "Date": "January 10, 2004"}, {"Title": "bbbllluuuurrrrryyyyy pictures", "Author": "Writer's Block", "ReviewID": "RQVC0T3WG1ES9", "Overall": "3.0", "Content": "I bought this camera because it was one of the lowest priced 5MPs at the time.  The two major complaits I have about the camera is that (1) it takes blurry photos and (2)the lens cap continually comes off.Unless your arm is as still as a table top, many of your photos will be blurry.  I took several photos on a trip to Asia that looked great on the display panel (even when I magnified the image) only to find that they were actually blurry when they were on a computer screen or printed when I arrived back in America.The lense cap can be taken off with the slightest touch.  It continually came off even while it was in my camera case.The other features on the camera are fairly nice.  The menu is very user friendly and the movie making mode is okay (although the camera sometimes rotates the movie 90 degrees, and I haven't found a fix for this yet).  But regardless, the camera takes blurry photos, and I cannot recommend it to anyone.", "Date": "November 2, 2005"}, {"Title": "Can't beat it for the price and quality", "Author": "Troy", "ReviewID": "RD95OCPS5NYDZ", "Overall": "5.0", "Content": "I just recieved my DX4530 this afternoon and I must say I'm impressed. You can't beat getting a 5mp cam for under $300.00.After searching for months, I decided to get this one because it's a 5mp cam that takes good quality photos and uses 2 AA batteries. So far, I have no complaints.", "Date": "June 7, 2004"}, {"Title": "Perfect camera for the amateur photographer.", "Author": "Brad Cooper \"Author of Guilty by Association\"", "ReviewID": "RAZJHMC4K7M9A", "Overall": "5.0", "Content": "Let's see here...5.0 Megapixels3x Optical Zoom Lens3.3x Digital ZoonSecure Digital Card CapabilityKodakAnd this camera is $299? This is the best value you'll find for a camera of this quality, with these specs, for under $300. With the auto mode, you just let it do its thing. No fiddling with settings, no worries other than point and shoot. Perfect for those just getting started with digital photography.The other modes and manual settings really show what this camera can do for the more experienced digital user. With night mode (for capturing the subject and the background), landscape mode (for distant scenery), macro mode (for objects 4-24 inches away), and sport mode (for subjects in motion, perfect for my shots at West Virginia football games), the DX4530 offers a myriad of options and capabilities for every kind of user. The video capability also comes in handy, with the ability to capture video at a resolution of 320x240 WITH sound. The max length varies depending on available memory.In addition to the included features, the DX4530 allows the user to expand the features with add-on lenses available from Kodak, like the Telephoto Zoom lens and the Wide Angle lens. Both of these are moderately priced and of the typical high Kodak quality. Make sure you grab a pack of NiMH rechargable batteries and a charger, because this is like most high powered digital cams...it eats regular alkalines for lunch, and it's very hungry! Also, the 32MB of internal memory is a nice backup for when your memory card is full but not as a main means of storage, so make sure to grab at least a 128MB card to make certain you can have all the pictures and video that you need!Overall, a fantastic value and the same classic Kodak quality that has come to be expected.", "Date": "June 6, 2004"}, {"Title": "very nice camera - and easy to use", "Author": "Vince Curletta \"bigvince007\"", "ReviewID": "R2ES7U4GQWFD53", "Overall": "5.0", "Content": "This camera has been perfect for my wife. I wanted to get her into the digital world, and retire her 35mm camera. She began using this camera right away, with very little trouble (she still has trouble understanding the various flash modes, but I'm confident that she'll grasp the basic idea soon). I like the feature that automatically rotates the image when you shoot in portrait mode (holding the camera sideways) so when you review the images they're all oriented correctly. The buttons and dial are very easy for my wife to operate (one of the things she didn't like about my Sony). The only thing I didn't like was that it came with lithium batteries instead of rechargeables. I bought a travel kit (which included a case, rechargeables, and a travel charger) instead of the recharging dock for now. Also, I wish the battery strength indicator was always visible. Over all, my wife is very, very happy with the camera and the resolution is excellent. My wife also loves taking videos, but I have to keep reminding her that it's for \"short\" video clips - it's not a camcorder!", "Date": "December 26, 2003"}, {"Title": "Best Digital Camera!", "Author": null, "ReviewID": "R1LM05GT37OXXJ", "Overall": "5.0", "Content": "The Kodak DX 4530 is the best digital camera that I've had.  I started with the 2 megapixel Kodak camera a year ago, which I thought was great.  Then I tried a friend's 3 megapixel camera and saw how much clearer the photos were.  I looked at Kodak's line of digital cameras and saw the 5 megapixel camera for $299 and the decision was made.  This camera took some awesome photos of the Yorkshire Dales in England.  Very crisp and clear pictures that had an \"alive\" quality.  I'm now buying this camera for my sister who suffers with a 2 megapixel camera.  This camera is a great value, easy to use, and takes great photos.", "Date": "December 5, 2003"}, {"Title": "Not What I Expected", "Author": "LOUIS PAONE \"drlgp\"", "ReviewID": "R1LKKWXBS74HR6", "Overall": "2.0", "Content": "I had purchased the Kodak DX4330 3.1 mp camera about a year ago and I can't say enough about how good a camera this is.  So when I saw that Kodak came out with a 5mp camera (DX4530)using the same body and docking system that the DX4330 uses, I ordered it in September. I figured that this camera must been sensational with the 5 megapixels.When I got the camera and used it for a few days I noticed no real difference in the picture quality then the DX4330 in fact on indoor shots the pictures came out a lot darker.I spoke to Kodak and they told me that it was possible that I could have a bad sensor, but they weren't sure.  So I emailed them an indoor picture taken with the DX4330 and the same picture taken with the DX4530 so they can compare and find out if something was wrong.They reviewed the two pictures and told me that the picture from the DX4530 was darker than the one taken with the DX4330 but it fell in the acceptable range.  THEIR acceptable range not mine.They also said that some cameras may be built a little different than others.So I sent the camera back for a replacement.  I received the new DX4530 a couple of days ago.  Took some indoor pictures with it and found out it was no different than the one I sent back.So I am sending this one back and getting a refund.To bad, because as I said the DX4330 is a great little camera, what happened to Kodak technology with the DX4530?", "Date": "October 15, 2003"}, {"Title": "Cheaply Made, NO GOOD IN LOW LIGHT", "Author": "Dsgreen \"Dsgreen\"", "ReviewID": "RNO34JI5C482Q", "Overall": "2.0", "Content": "Ok, Yes it is 5mp, but what good is that when it takes bad pictures. In low light the photos are SO dark, and when you use the low light setting or night vision setting, then it is so blurry it is impossible. Same situation when taking pictures indoors. It is a 35mm lens adaptable digital camera, but the problem with that is that when you screw the adapter on then you really have no light!!!!  The adapter blocks all light unless you are facing the light and it is sunny outside, even then..  I have a Telephoto lens and also a wide angle lens and they are not cheap lenses. I also have all the UV filters and so on. Not to mention that the thread on the camera is PLASTIC ALONG WITH THE REST OF THE CAMERA, MEANING THAT ONCE YOU STRIP IT THAT'S IT. the entire camera is made of plastic,  mine has not broke yet but it is just so cheaply made to have to pay so much for it.  This would probably be a good camera for someone who just wanted to have a digital camera that was easy and does not know about lighting and shadows and so on. As far as adding lenses to it to improve, that is out of the question.  Just research and know what you are getting.", "Date": "January 23, 2005"}, {"Title": "Just Got It, But Love It - Buy it at WalMart online for $198", "Author": "K. Mitchell", "ReviewID": "R5VZWWC6AI5DI", "Overall": "5.0", "Content": "I just got this camera, and so far it's great.  Don't buy it here, though.  WalMart has this, PLUS a docking station, PLUS a travel kit for $198.", "Date": "December 2, 2004"}, {"Title": "Easy, great quality, tons of features", "Author": "Luv the imac", "ReviewID": "R2P0ZHV1I0MQQ4", "Overall": "5.0", "Content": "I love this camera, I've had it just over a year. It's the cheapest 5 megapixel I could find with enough features. Perfect for novices but also has a few other tweaks you can handle on your own for more control. The only drawback I can find is that it doesn't have a continous shot mode, that would be nice for catching a baby's many expressions. But otherwise all the other settings are wonderful. The easyshare software is truly easy, upgrades are free and simple online, I recommend at least 256MB SD card for more picture taking, I also recommend rechargeable batteries and not using the LCD screen for taking pictures, just for reviewing them. The batteries last REALLY LONG if not using the LCD screen. I take this camera everywhere and have used it for everything from ebay pics at low resolution to printing 11x14 and higher images with perfect clarity. Ofoto.com with kodak perfect touch processing is the best so far, I've also tried samsclub.com, walmart.com, and snapfish.com with varying results. ofoto is the best but they are more expensive. samsclub is the cheapest but not consistant results so far.", "Date": "November 29, 2004"}, {"Title": "IF COMPUTER WON'T RECOGNIZE THE CAMERA OR DRIVERS, TRY THIS!", "Author": "Wabash52", "ReviewID": "R2W01KFC9JE58D", "Overall": "4.0", "Content": "... a good and inexepensive solution -- don't start pulling your hair out!!  Get an SD/MMC card that fits right in the slot in the side of the camera, and a twenty-dollar USB SD/MMC card reader - you're good to go!!!  Check the owner's manual for instructions on transferring photos from the camera's internal memory to the memory card, then put the card in the card reader and voila!  ADDED BONUS: you will now be able to take more photos at a time - you can fill up both the internal memory and the card's memory.  This is a great little camera by the way, and I would still buy it again.", "Date": "August 27, 2004"}, {"Title": "Great camera for a great price", "Author": "ANDRES TAPIAS", "ReviewID": "ROO26Q9F089BA", "Overall": "5.0", "Content": "I bought this camera on Amazon and I couldn't be any happier. I bought a refurbished one that works flawlessly, so it was a great deal. The quality of pictures is great, the ease of work, everything. A great value and great Amazon service.", "Date": "July 25, 2004"}, {"Title": "Very easy to use", "Author": null, "ReviewID": "R2HLG3BR2MJ70R", "Overall": "4.0", "Content": "I have never owned  digital camera, so I was nervous about how to use it. This camera was easy to use right out of the box without reading the instructions!", "Date": "January 18, 2004"}, {"Title": "Very Pleased", "Author": "S. Metcalf", "ReviewID": "RBI24MV7XKIST", "Overall": "5.0", "Content": "I am a pretty die hard fan of film, so I was very hesitant to buy a digital camera. My opinion was finally swayed when I recently went on a trip to Ireland for a wedding. My sister had the digital camera and I the film. I was so delighted to be able to see her pictures right away that I decided to buy one of my own when we got home.I chose the Kodak brand because 2 of my family members have one and rave about them. I agree. They are easy to use for everyone. This one was $279.99 when I purchased it and I couldn't be happier. It is quick, has great quality and I LOVE the features. I really like the option of being able to choose how many MP you want to use up for each picture. That makes it simple for email and prints. Overall I have no complaints about this camera. Enjoy!", "Date": "June 6, 2004"}, {"Title": "Wonderful camera for a beginner", "Author": null, "ReviewID": "R39T7XDQWO7CCP", "Overall": "5.0", "Content": "I am such a novice, but I didn't want to be restricted when I do learn all the ins and outs of picture taking which is why I ended up with this camera.  So far it looks like this camera has everything.  Great price, great photos (I am using the 3MP setting-which is the 2nd out of 5 levels), ease of use, easy to program, easy to understand.  I do read manuals before I use any new piece of equipment and I do recommend it.  I haven't used it to its full capabilities yet since I bought it just 1 month ago, but so far it has proved its worth.  The lens cover only comes off when you turn the camera on ( this was one of the complaints that I had read..that the lens cover came off too easily) - and you can only put it back on if the camera is off - a simple way to make sure you don't leave your camera on unnecessarily.  It is a lot of camera for a little bit of money - if the adapter is purchased you don't need a dock.  You don't even NEED the adapter but having one saves on the battery.  I can't comment yet on the CRV3 long-life Lithium battery, but reviews were really good. It hooks up really easy to the computer via the USB cable. The software included is simple to install and easy to follow. I have already recommended it to friends.", "Date": "May 5, 2004"}, {"Title": "Poor customer Service", "Author": "C. Sherwood", "ReviewID": "R3N1U7R56WJG3S", "Overall": "1.0", "Content": "The camera worked excellent for a short period of time. I didn't use the camera very often so when it stopped working just after the warranty ran out. I tryed to contact Kodaks tech dept via the web and could never get in. I finaly called thier help line and after being on hold for 45 minutes some one finaly picked up the line I was on. The determined that I would have to send it in for repair and the estimated cost was $125 dollars. If have any concerns over customer service for you product or reliabillity do not purchase from Kodak.", "Date": "May 22, 2005"}, {"Title": "lots of pixels, ease of use, quality big prints, great price", "Author": "FilmPhile", "ReviewID": "RMBPR3R5O6TBI", "Overall": "5.0", "Content": "I did extensive research on 5MP cameras and this one was consistently the highest rated for its class -- especially the price, ease of use and quality combined.Best for: Novice to experienced amateurProduct Uses: Family / Travel / Special EventsDigicam Design: Point and ShootPicture Quality : Very High, 5.0-megapixel CCDPrint Sizes: 8x10 and largerMac and PC/Windows compatible + software.According to imaging-resource.com:  \"Kodak's EasyShare digital cameras excel in user-friendliness,  and offer good image quality in addition to their convenient setup and compact  size. The DX4530 updates the line with a larger, 5.0-megapixel CCD that captures  high-quality images with good detail. Although exposure control is fully automatic, the DX4530 performs surprisingly well in a variety of situations, and offers a few preset scene modes for shooting in low lighting or capturing action shots.  A range of manually-selectable longer exposure times extends the camera's capabilities  as well, without getting too complicated. If you're looking for a lot of pixels  combined with ease of use, all at an attractive price, the DX4530 would be a  good choice.\"Also why it's great for novices to experienced amateurs:  \"Although the DX4530 offers only fully automatic white balance, Kodak's Color Science technology does a superb job of producing  accurate color under almost any light source.\"\"The DX4530 squeezes into larger shirt and coat pockets, and comes with a wrist strap for carrying. The camera's compact design includes a retractable lens, protected by a removable plastic lens cap (a tiny strap tethers it to the camera body so you won't lose it). Though exposure features and overall setup are similar to previous EasyShare models (most notably the DX4330 model), the DX4530 boasts a larger, 5.0-megapixel CCD for capturing high resolution, print quality images, as well as smaller image sizes better suited for distributing via email.\"Another review at Steve's Digicams concludes: \"The DX4530 is an entry-level yet high resolution camera with a quality 3x optical zoom lens. This is a perfect camera for anyone that wants to easily capture sharp and well saturated pictures, indoors or out, with little or no prior experience. And with an average street price of $350 or less you won't need a bank loan to purchase one.\" It shoots \"gorgeous prints\" and \"The bottom line on the DX4530 is that it captures very good images in a variety of sizes suitable for email use to wall-size enlargements. It's easy to use and is priced within the budgets of many consumers that previously would have only been able to buy a lower resolution camera.A world class lens and powerful 5.0 MP combine to give you huge, stunning prints up to 20\"x30\" (50x75cm)KODAK RETINAR Aspheric All-Glass Lens with 3X optical zoomBright indoor/outdoor displayProgrammed scene modes and creative settingsSharing is one-touch simpleVideo and audio captureAnd as Kodak shows on their home page: \"J.D. Power and Associates ranked KODAK EASYSHARE Digital Cameras \"Highest in Customer Satisfaction in the $200-$399 and the $400-$599 price ranges.\"This is one of those cameras that will provide great shots and last for many years to come at a great price.  The kodak site (and many others) retail it for $299, camera only.  Because it's not the newest of the brand new, you can get a great deal on it in comparison to those that are the cutting edge, just-released models. Other 5MP cameras in this price range are nowhere near the quality, design or output.The DX4530  makes for a great holiday gift that's not so hard on the wallet.  This is one sweet camera especially for those who don't want to have to spend a lot of time reading tiny print, learning a million geek-tweaks -- it's easy to take it out and start shooting.  Great for grandparents, newbies and bargain-hunters.", "Date": "December 5, 2004"}, {"Title": "Awesome", "Author": "Lillian White", "ReviewID": "RS313G6XZW2U3", "Overall": "5.0", "Content": "I just got it today, and this is an awesome camera, got it out of the box, installed really easy told you what you needed flat out. I have had it a few hours and i have taken a ton of pictures, videos and emailed them half way across the country successfully. This is an amzingly easy camera to use. Don't believe me? I'm 15 and I could use it right out of the box. And props to kodak on the index in the back of the instruction manual.Update in 2007: I STILL USE THIS CAMERA. I just got a Canon Powershot S3IS because I have artistic endeavors that needed a professional quality. But when I am out with my friends in college, need something for a family reunion fast. Or just taking pictures of my family around the house I still use my Kodak. Takes all my SD cards. Nothing has faltered NOTHING. It's a camera that has lasted through high school and my first year at college.If it can handle an angst ridden teenager. It can handle anything.", "Date": "December 25, 2003"}, {"Title": "Simply an Excellent Camera", "Author": "Ricky Willems \"RDW\"", "ReviewID": "R27CYP7MQ4XCGM", "Overall": "5.0", "Content": "I bought this camera 5 years ago during a Black Friday sale for $140, and its best some of the best money I've ever spent on any piece of electronics. Rarely is a tech product good enough to remain useful nearly 7 years after its debut, but I still use this camera all the time.The camera takes beautiful shots, especially outdoors. The optical zoom is great, and always provides a clear picture when employed. The flash is good, though you do need to be careful about redeye. The facial recognition software is great, and for the time this camera was made, was absolutely fantastic. The image stabilizer is really great as well. It was one of the first camera's Id used that let you focus by holding the shoot button down half way, letting you take instant shots with no delay. (If you dont realize this, your shots will take forever, and will always end up blurry, I think many buyers dont realize this).5MP is more than enough for most people, I end up shrinking down most of my photos anyway. A few people mentioned interior photos are too dark, but if you give the camera a second or two to adjust, or manually change settings, Ive had no problems at all.The camera is exceptionally durable. After my friend crammed a broken SD card in the slot, the sd reader rarely works, but I can't blame that on the camera. It spends most of its time getting crushed under text books while my backpack is being thrown around, and the though the plastic cover for the LCD screen recently cracked (the screen is still 100%) Ive never had any problems whatsoever.The only downsides are only a few downsides. This is a large camera. Though not oversized for the time, modern consumers will find the camera very bulky and a bit heavy. It's comfortable in a pants pocket, but its the only thing you'll be putting in that pants pocket.The other big downside is the battery. While it claims AA batteries are usable, they really aren't. You need to buy http://www.amazon.com/Kodak-MAX-CRV3-Lithium-Battery/dp/B0000632T3 or equivalent. When I first bought the camera, these were expensive, which was a major downside. Now however, they're only about twice the price of 2 double A's for the Duracell brand, and they last a for a long long time. I can count on my fingers how many times Ive changed the battery in 5 years. I dont have any experience with rechargeables on this camera.The only other improvement I can imagine is allowing longer video clips. Each video clip is limited to 60 seconds. This is enough to make it useful, but it would be great to be able to record for hours to an big SD card. You also cant zoom in or out whithout stopping your video shot and starting again.Overall a great camera. If you happen to come across one I'd still recommend it against most new cameras for the price. The camera feels more like a film camera than a digital camera, and this could be nice for not so tech savvy people.Then:-------------------Overall: 10/10Picture: 9/10Durability: 10/10Features: 8.5/10Ease of Use: 10/10Size/Weight: 8/10Now:-------------------Overall: 7.5/10Picture: 8/10Durability: 10/10Features: 7.5/10Ease of Use: 8.5/10Size/Weight: 4/10", "Date": "December 10, 2009"}, {"Title": "LOVE THIS LITTLE CAMERA !!", "Author": "Emma Caroline", "ReviewID": "R1CEA51TLC1ZLY", "Overall": "5.0", "Content": "I bought this before Christmas 2 years ago.  It is simply a great digital camera for the money.  I just returned from a 14 day European trip to Italy, France and Spain, and got some fantastic pictures !!!  I also got some great pictures using the NO FLASH and the landscape mode.  It is so user-friendly!!  I love this camera and will probably purchase Kodak in the future.", "Date": "June 5, 2006"}, {"Title": "Be Careful", "Author": "D. Mamp Higgins \"heaven\"", "ReviewID": "R37QWNDZPLVPAN", "Overall": "2.0", "Content": "Purchased this camera a short time ago. It was the second Kodak DX camera I purchased. Many problems with software, many problems with charging both cameras on the charging dock and the flash on both DX's stopped working. One while in warrenty and the second just out of warrenty. They want $95.00 plus shipping to repair the flash. I don't take a lot of pictures- maybe 50 a year that require flash so I warn others about Kodak cameras especially if you take many pics that require flash.", "Date": "March 10, 2006"}, {"Title": "Impressive", "Author": "Jessica Simpson \"Picture Perfect\"", "ReviewID": "RS4K0EH5Z1PH7", "Overall": "5.0", "Content": "I have pictures inside a night club that came out spectacular, im really blown away with the way it takes pictures in any settings, my only dislike was that it was rather big and a little bulky but the performance was up to par!", "Date": "December 13, 2005"}, {"Title": "lovin' it!", "Author": "Suzanne Wootton", "ReviewID": "RVMCJN6U6BVV9", "Overall": "5.0", "Content": "I have been taking portraits and head shots for a while now with an SLR and just recieved this camera as a gift and am loving every minute of use! If you read all of the directions there is no reason that it should be hard to use, etc. The pics are high quality and the video option is great to have without having to drag along a camcorder. Very very easy to use and the results are terrific! I would definitely suggest this to anyone!", "Date": "February 23, 2004"}, {"Title": "What I have been looking for.", "Author": null, "ReviewID": "R76XTSEFOWOU", "Overall": "5.0", "Content": "Great camera, great price.  I have been looking for an easy to use digital camera.  This one fits the bill.  The pictures come out great.  The price is wonderful.  Terrific all around camera.", "Date": "February 21, 2004"}, {"Title": "Great camera, software needs improvement", "Author": null, "ReviewID": "R24297KQYEI0U9", "Overall": "4.0", "Content": "this camera takes great pictures--amazing details, true bright colors, pictures come out great even in low light settings. My two problems are:-a 2-second delay between when you  push the button and the camera takes the picture (very hard to take a good picture of an active toddler)-software that came with the camera offers very few editing options, you can only: brighten or darken the shot, crop, make it black and white, and take care of red eyes--that's it. This is strange since this camera is not intended for professionals who already own powerful photo-editing software.Other than that, I like it and recommend it!", "Date": "December 15, 2003"}, {"Title": "OK for New Digital Camera Users", "Author": null, "ReviewID": "R2YGX4DUAKY29J", "Overall": "3.0", "Content": "This camera is okay if you don't know much about digital cameras.  It's very very easy to use, but it is also very very cheaply made!  It feels like one of those $10  35mm Cameras.  The LCD display is terrible.  I've never seen a cheaper looking 5 megapixel camera than this.  Don't drop it, EVER!", "Date": "November 30, 2003"}, {"Title": "Takes great pictures but beware!!!!!", "Author": "Pheobs61 \"Camera seeker\"", "ReviewID": "R3S9GU900DT2MG", "Overall": "2.0", "Content": "I loved this camera It took great pictures was easy to use and with the dock a sinch to charge the view screen even worked pretty well when it was sunny....I would have given this camera a 5 before I started having problems with it ...first the view screen stopped working but I could still take pictures..then it would only boot up some times...and now it won't turn on at all...actually I take that back the ready light continously blinks red......I have read many other review that have the same problems with this camera....a word to the wise DON'T BUY THIS CAMERA...you're just asking for it!!", "Date": "May 24, 2006"}, {"Title": "Joe's carama", "Author": "Joseph White", "ReviewID": "R1WNREW2QFTQG7", "Overall": "5.0", "Content": "I bought the Kodak 4530 plus the photo dock. It is the best purchase ever. The pictures come out like the store! We have lots of fun with it!", "Date": "January 28, 2004"}, {"Title": "Not the Camera I thought it would be", "Author": "Carl Riley", "ReviewID": "RC6S8QES37ECI", "Overall": "1.0", "Content": "Takes to many Blurry Pictures. I've use this camera in different venues (ie. Sporting events,indoor party and wedding. I would say over 60% of the pics came out blurry. I read the manual a couple times thinking it was me and still produced many blurry pics. The final straw was a retirement party for a co-worker who wanted the pics for a keep sake and most of them were blurry as well. I sent the Camera back and got a Canon S50. I haven't taken 1 bad picture since. You get what you pay for and for a little bit more I got a much better camera with the Canon.", "Date": "February 26, 2004"}, {"Title": "GREAT CAMERA!!!!!!!!!!!!!!", "Author": "C. Young", "ReviewID": "RFHIQKQZ67K6J", "Overall": "5.0", "Content": "I bought this the day after Thanksgiving with the dock. I have no complaints. I have taken tons of pictures of my newborn son, and almost all of them have come out perfect. A few have come out a little dark, but the software program enhanced them really well.  Also, the ones that came out dark were taken with only lamplight.  My husband (who can't use my olympus 35mm camera very well) had no problem figuring out this camera. It is so user-friendly!!  We love this camera and will probably purchase Kodak in the future when we need another camera.", "Date": "January 18, 2005"}, {"Title": "I do love this camera!", "Author": "Stephanie Denton", "ReviewID": "R2YYF7HP4MPYVN", "Overall": "5.0", "Content": "I was not happy when my first one stopped working after 10 years. So when I found this used one on Amazon, I was very happy. The seller was great. Everything works great, exactly like my old one. Easy to download pics to computer. Love the viewfinder. Works great for taking document photos especially in my genealogy work.", "Date": "September 3, 2013"}, {"Title": "Easy to use", "Author": "Beachcomber \"Beachcomber\"", "ReviewID": "R31NW5YU9HSYES", "Overall": "5.0", "Content": "Bought this 2nd hand (used) for my granddaughter to become familiar with photography.  Easy to use.  MP lens is adequate for outdoors and indoor with flash for still photography.  Basic, digital camera.  No complaints as it serves the purpose I intended it to.", "Date": "July 18, 2013"}, {"Title": "Good Camera for Beginners", "Author": "Peter", "ReviewID": "R3KTHSJDXTU07Q", "Overall": "4.0", "Content": "The Kodak DX4530 was my first point and shoot camera. For the most part the camera is simple to use and the 5.0 megapixels is good enough for anyone who just wants to take quality pictures. The downside that I had with the camera, is when I was on \"Live View\". Being on Live View allowed me to view my subject through the LCD screen instead of using the viewfinder, and the Live View setting drained a lot of battery power, especially when I was in Macro and Video mode. I highly recommend rechargeable batteries. Other than that, the camera is perfect for the beginners.", "Date": "June 3, 2013"}, {"Title": "it stopped working 2 days after i bought it", "Author": "liseth", "ReviewID": "R2G0YGH2T1RE9Z", "Overall": "1.0", "Content": "fail product. i don't even know why i bought it. it broke 2 days after i bought it . poor quality", "Date": "March 21, 2013"}, {"Title": "camera", "Author": "lora ackerman", "ReviewID": "RQZZQM5B5UYKB", "Overall": "1.0", "Content": "needed the cord to plug in to do any thing with it. Will have to get another cord to try to get it wright.", "Date": "February 4, 2013"}, {"Title": "didn't work", "Author": "Ac", "ReviewID": "R154O7JX62TGLY", "Overall": "2.0", "Content": "I bought this for my kid. Unfortunately the memory stick doesn't record any pictures. It was a waste of my money. Can't tell you how the quality is. Would not recommend to buy used cameras.", "Date": "January 12, 2013"}, {"Title": "Kodak Camera", "Author": "Granny Virg", "ReviewID": "RD6HNDYBR67E6", "Overall": "5.0", "Content": "I bought this camera as I replacement for mine that broke while I was on vacation, bummer.  I love it because it takes wonderful pictures of flowers and my animals....it is one of the best.  I wish Easy Share Software was still available and I would be in 7th heaven....thanks for a great product.", "Date": "October 3, 2012"}, {"Title": "Works For Me", "Author": "H", "ReviewID": "R2GFG0BVR400TY", "Overall": "4.0", "Content": "I like this camera.  Had a previous one and used this to replace it after I dropped the old one on a tile floor and broke the lens. It's very basic, but works quite well for simple picture taking.", "Date": "May 3, 2012"}, {"Title": "Best point & shoot camera ever", "Author": "M. Norris", "ReviewID": "R2QITHSH005B8F", "Overall": "5.0", "Content": "I have had one of these cameras for years and will put the picture quality up against my professional digital camera any day. For a point and shoot, I have never found one easier to use or that takes better images.  After years of bumping around in soccer bags, pocket books, etc, mine finally lost the shutter motor.  I have ordered another as a used model from Amazon and can't wait to continue taking quick and easy shots.  If you can find one of these, get it.  They are awesome.", "Date": "September 22, 2011"}, {"Title": "Love this camera", "Author": "Kathleen Moses \"Ganymede\"", "ReviewID": "R15DN7T21SD1I", "Overall": "5.0", "Content": "Ok, all previous reviews for this camera were 2003.  LOL at how far camera technology has come.  When I purchased this camera, 5 megapixels was HUGE in a point and shoot camera.This is a eulogy to a wonderful camera, I purchased the easyshare in November of 2002.  My husband had dunked our 20 year old (hand me down from his parents) Cannon with all the lenses in the Atlantic just weeks before our son was born.  The cheapie 35 mm camera from the drug store wasn't doing it, so we purchased the Easyshare.  What a phenomenal camera!  The software practically loads itself into your computer, I guess I read the instruction manual, but the camera is so easy to use its barely neccessary.  I have taken incredible pictures with this camera in all kinds of situations, babies sleeping in darkened rooms, playing in their pool outside,later running and jumping action shots, this camera captured all of it, with amazing clarity and color.My complaints about the camera are few, I wish it could take a faster photos, its a long time between turning the camera on and the photo.  Like digital cameras of today, it eats batteries.  I liked that the camera had the option of looking through the eyepiece or use the display screen, that saved a few batteries.  At some point I started to feel like the camera was a little too bulky,  I didn't bring it to my 20th class reunion because it was a little to bulky to fit easily in my purse.  The ultra thin models were ubiquitous at that point, I didn't want to appear outdated.Nine years later, we are at an amusement park, it's my daughters birthday, she is surrounded by princesses, storybook characters and a dancing troupe all singing happy birthday to her, and my Kodak chose that moment to die.  I will miss that camera.  I had that camera so long I had to call Kodak and beg for a software update for our new computer, the original was too outdated to load properly.I just spent the entire weekend looking over Amazons hundreds of cameras, reading countless customer reviews.  After much deliberation, I chose the Panasonic DMC-ZS8.  I chose it for the quality of pictures it takes, and the hopes I can get 10 years out of this camera as well.  Panasonic, you have big shoes to fill", "Date": "July 10, 2011"}, {"Title": "I've hated this camera for 4 years ...", "Author": "razberiswrl \"raz\"", "ReviewID": "R3AGWG7FKNCWU4", "Overall": "2.0", "Content": "I just bought a new camera today, and while linking this page to show the old one to some internet friends, I figured I might as well review it ...Man, I am SO glad to be rid of this thing.  I mean, sure, it takes satisfactory pictures, I love the docking station, and it's lasted this long (and is still in decent shape), so I guess my dislikes are just a matter of being picky.  Anyway, I hate the d-pad control on this model.  I thought I hated d-pads in general, but I have realized that it's THIS d-pad that I hate.  It really sucks.  And it's about shot after 4 years of use.  I hate that it has a lens cap instead of the lens that automatically shutters itself.  I hate that it's so bulky.  It has terrible hand-feel, it's difficult not to stick your fingers into the shot.  I hate how long it takes between the time you push the button and the time it actually takes the picture.  I hate that you can't do any editing through the camera (I had a sony previously, and you can crop, take pics in sepia, black and white, etc, you can brighten, etc, etc, right ON THE CAMERA).  And I hate that the editing software sucks so bad (am fully aware I could use something else, and I readily admit that I do not know how). I hate that it takes TERRIBLE close-ups even in close-up mode (I know you love the highly technical terms I use).  I hate that my mother-in-law's cat knocked my sony off the top of her entertainment unit 4 years ago, and THIS is what she replaced it with as my xmas present.I just really hate this camera.It works though.  I guess that's something ...", "Date": "December 18, 2008"}, {"Title": "Good Camera but....... 4gb sd card does not work", "Author": "Yankees Fan", "ReviewID": "RSKT88C6GPAPY", "Overall": "4.0", "Content": "This is my first camera, bought it on Black Friday of 2003 for $299 (included a free 128mb card)I've taken over 6000 pictures with this cam, a majority of them are good. However, nighttime pictures do not come out very well.Since then, I've bought a 256mb card, upgraded to a 1gb.. Yesterday bought a 4gb Transcend card and it did not work :(Checked the Kodak site, found no firmware upgrade available, stuck with firmware v1.000", "Date": "June 14, 2008"}, {"Title": "A great camera", "Author": "Doc", "ReviewID": "RNVE5ISG3Q9U6", "Overall": "5.0", "Content": "Even though this is an older model that is no longer sold new, this is my second one.  It's a great camera with good features.  Best to buy an extra memory card since the internal memory is limited.", "Date": "February 25, 2008"}, {"Title": "Great Camera", "Author": "Jenn", "ReviewID": "R1D9LUEQ00Q9W7", "Overall": "5.0", "Content": "This is a great camera. Had it for 3 years now. Always got great photo's and video. Very easy to use. The colors are very vivid on this camera. We are about to upgrade to a higher MP. I wish I could get the exact same camera only with more MP's. This camera will be passed down to my 5 year old. He can even get great photo's with this camera. Use with a Lithium battery and you'll be golden.", "Date": "December 29, 2007"}, {"Title": "Good Deal!", "Author": "Appraiser \"Appraiser\"", "ReviewID": "R1KKEI21RYQ1VQ", "Overall": "5.0", "Content": "I dropped my camera onto concrete for the third time and panicked becausenow it doesn't work and it's a required tool for my appraisal business.  I ordered this exact duplicate on Thursday and the postman put it inside my front door on Saturday. It looks and works like new.  Thanks.", "Date": "September 22, 2007"}, {"Title": "kodak dx4530", "Author": "S. Phillips", "ReviewID": "R1INGNAT3BLXET", "Overall": "4.0", "Content": "I've had this camera for almost two years and am now in the market for a new one.  It served it's purpose well and I can not complain about the camera.  Although starting about 6 months or so ago, the quality of the pictures started to diminish.  Now everyone time I upload pictures I have to lighten every single picture - which is quite time consuming.  The pictures turn out very dark.  So if you're looking down the road on how the camera will perform after lots of use, this is just what I experienced.", "Date": "March 17, 2007"}, {"Title": "Great Camera", "Author": "Franka Goodson \"lighthouse lover\"", "ReviewID": "R2H7NURMUNMULE", "Overall": "5.0", "Content": "I have had this camera for about 3 years now and I am still very happy with it. I take this little camera every where I go and am constantly taking pictures, my kids automatically turn and smile when I call their names lol. I am still using the original battery that came with the accessory package, I charge it on the cradle when I think about it...lol. I love the fact that the lens cap is attached so that I wont lose it and the fact that the viewing screen can be turned off to provide more battery life. The pictures come out just awesome, I have compared them to pictures taken from a friends 8.0 mp camera and there is no distinguishable differences that either of us can see. I have had several cameras before this one and this is by far been my favorite. The pictures I took of my daughters tee-ball team came out better than the pictures the professional photographer took with his high dollar equipment. My six and ten year olds are able to use this camera and easily take outstanding photos, I would recommend this camera for anyone.", "Date": "December 28, 2006"}, {"Title": "Just Plain Mediocre . . .", "Author": "Joanna \"Jo\"", "ReviewID": "R14QLR0U47CQ7C", "Overall": "3.0", "Content": "Alright, so this camera is not the worst, but it is not the best. I bought this about 2 years ago. This was my first digital camera, and for that purpose it was good because it is pretty much idiot proof. I have used this camera a lot over the years, and here is how I feel about it now that I have become more familiarized with the digital camera world.a.) this camera is a big large & clunkyb.) aside from the different shooting modes (landscape, motion, etc.), it doesn't have any special features, it's a pretty plain point and shoot camerac.) I feel that the color on the pictures from this camera comes out a bit pale/bland and I don't think that they are as clear as pictures that I have seen from similar cameras.d.) the lens cap! I hate the lens cap! I usually just throw my camera into my purse with or without a case, and the lens cap always falls off! It's not a big deal I guess, but it's something small that has really annoyed me with this camera. If you want my opinion, unless you're buying a SLR camera or something like that, stay away from the lens caps! They're just plain annoying.That's about it. Like I said, this camera is mediocre. If anything, I think it might be decent for beginners.", "Date": "May 26, 2005"}, {"Title": "Great camera for the price", "Author": null, "ReviewID": "RH3MTG0FJN17M", "Overall": "5.0", "Content": "Most 5 megapixel cameras are $600 and up.  This is an excellent deal for the money.  Nice 3X optical zoom.  Very pleased with this camera.", "Date": "May 15, 2004"}, {"Title": "Great 5 megapixel refurbished camera!", "Author": "Jose Calderon", "ReviewID": "RMDPTFJ5ZPHPI", "Overall": "5.0", "Content": "Yes I bought a refurbished camera, but to me it looks brand new, with a 1 year factory warranty.  My dad bought this camera before me, and I was impressed with the picture quality.  I paid $228 for it, and I feel i got an unbeatable deal!  I have taken quite a few pictures already, even moving objects, and they all came out great. The printer dock, an optional accessorie also makes outstanding 4 by 6 pictures! I highly recommend this camera to anyone", "Date": "May 9, 2004"}, {"Title": "Great camera for the price", "Author": "\"asbedi\"", "ReviewID": "R14OPU63LIOMV7", "Overall": "4.0", "Content": "I purchaed this camera from one of the Amazon.com partners in December, 2003.  So far I have taken a lot of photographs with it and love it, save one flaw... If there isn't adequate light, the camera doesn't take the best of photographs.  In dim light, at dawn or dusk, the photograph quality isn't all that great.You can check samples of the photographs taken by me at [...] I usually post photographs taken in all times of the day and you can see yourself and decide since the work is unaltered in any way or form by using photoshop or the like.I guess the best way to decide would be to see the result for yourself and make a qualified decision.  The ease of use of this camera is probably unrivalled. The original battery lasted me for about two weeks using the preview LCD screen and about 400 photographs.  The camera is acutally smaller than I thought it would be.  I inserted a 256 MB card in it and with it I have taken video clips that are well over 3-4 minutes in length with good sound.As far as value for money is concerned for the amatuer photographer, this is the camera for you.  I took the one star off for the lack of quality of photoraphs in dim light", "Date": "February 25, 2004"}, {"Title": "Bargain", "Author": "Chad Goddard", "ReviewID": "RLY4NS0C7AAX0", "Overall": "5.0", "Content": "After shopping for the best quality for the dollar, my wife and i finally settled on the kodak 4530. We only had the camera for a week or so when we discovered a small crack in the lcd screen. target replaced the item immediately. works great, extremely easy to use, takes great pics!!! thanks target & kodak!!", "Date": "January 21, 2004"}, {"Title": "LAS VEGAS TRIP...", "Author": "fhfgjhfgjghkjg fhrftrftjrft", "ReviewID": "R1U334E9GJ768N", "Overall": "4.0", "Content": "This is our first digital camera. Well worth the money. I thought we needed another one for Vegas, boy was I wrong. The card gives you 192 pics using the best mode 20\" by 30\" in the good mode it was like 260 or something. All the modes are great. The movie mode is awesome and we still had many pics left. We sat the camera down on the putting green right behind the hole and watch the golf balls go in not to mention the sound was pretty good. Don't by the docking station. We are still using the original battery that it comes with.Hope this helps you out. I was going to buy the Nikon I'm glad I didn't. The Easyshare software is great as well.", "Date": "January 19, 2004"}, {"Title": "EasyShare is for sure", "Author": "judy", "ReviewID": "R18N8ZXF0J7TAC", "Overall": "5.0", "Content": "I knew nothing about digital cameras, just knew I wanted one.  This has to be about the easiest item to operate!!  I followed directions and worked the camera as I went and I am able to use this camera.  I have downloaded the pictures from camera to pc and it is a breeze!...if I can do it anybody can.  The pictures came out crisp even on the computer.  I know the difference between digital zoom and optical...you need to know that there is a difference to get the best use out of this camera. The movie mode is a neat option this camera has,and is very easy to use. You can play back on the screen and it also has sound as it plays.  I can't say enough about this camera.  I highly recommend this camera to anyone.", "Date": "January 14, 2004"}, {"Title": "Love it, love it, love it!", "Author": null, "ReviewID": "R3RH7FP99KEWA5", "Overall": "5.0", "Content": "I just purchased this camera for myself and I LOVE IT.  I am not a camera junkie, but just wanted a nice digital.  This thing is amazing!  It is so easy to use and takes GREAT pix.  However, I lost it New Year's Eve.  I am going this evening to buy another.  I have no complaints except that the lens cover is not too secure.  I also bought the printer dock and am glad I did.  Geezum, a 5MP digital for under $300?  It doesn't get any better.  I also like the EasyShare software & direct link to Ofoto.com (owned by Kodak) to send pix to family & friends.", "Date": "January 2, 2004"}, {"Title": "Poor instructions & Dock doesn't work", "Author": null, "ReviewID": "R3G2MBCBWDY6ME", "Overall": "2.0", "Content": "This camera is very confusing. Instructions are to little to understand. Does not tell anything about the Dock which didn't work. The batteries are $20 a piece.No support. The pictures would not download to computer. Kept saying other program was open. POOR SYSTEM.Steve", "Date": "December 27, 2003"}, {"Title": "Una muy buena inversión", "Author": "Adolfo Schael", "ReviewID": "R1276DRG131EIU", "Overall": "5.0", "Content": "Soy un venezolano que compre esta camara en mi ultimo viaje en noviembre pasado y la verdad es que esto maravillado de lo versatil del producto lo facil de operar. Es una inverción en donde la relación precio - producto es lo optimo.", "Date": "December 8, 2003"}, {"Title": "This is a good buy!", "Author": "Todd Mandel", "ReviewID": "R1UZYM43GCBO6C", "Overall": "4.0", "Content": "We purchased this camera.  Took it out of the box without ever oepning the instructions and used it.  It takes great pictures!  This is the easiest camera to use.  You can figure it out just by looking at the camera.  Very quiet little thing!  Just point and snap is what truely sold us.", "Date": "December 7, 2003"}, {"Title": "I'm happy with it . . .", "Author": "Terry Mathews", "ReviewID": "R2AFO8AXRNI9XQ", "Overall": "4.0", "Content": "Got mine right after Thanksgiving and haven't had a lot of time to experiment with it.I took it to a concert, and the photos in the low light didn't turn out very well, but I'm not sure that I've mastered how to use it in low light.  \"Regular\" photos turn out great.  I don't care for the software, but I think it's because I'm used to the one that came with my WINDOWS package.I got the docking station and love the convenience of uploading without a cable.  Way kewl on that.", "Date": "January 9, 2005"}, {"Title": "camera is crap in low light", "Author": null, "ReviewID": "R3KFEAIPLH815D", "Overall": "1.0", "Content": "won't focus unless you are in bright sunlight, jpeg compression is bad, can see the artifacts in an 8x10 that used highest quality mode. Took it back the next day.", "Date": "May 8, 2004"}, {"Title": "New to Digital", "Author": "Tracy", "ReviewID": "R364IKF4CL8VEK", "Overall": "4.0", "Content": "First off, I am an amateur photographer and use a Nikon SLR for most of my \"serious\" pictures. But I really wanted a camera for every day use. One that fits in my purse, but wasn't so small that my husband couldn't use it too. After a lot of research, I decided digital was the way to go and bought the Kodak DX4530.I love the camera. My husband actually enjoys taking pictures now too. The picture quality is great. The night setting is awesome and has just the right amount of flash to take clear pictures in low light. The LCD screen is crystal clear in good lighting, but harder to see in low light, only when framing your picture though. Once the shot is taken, it appears in true form on the LCD. It is also fast - so you don't miss those important shots and I haven't had any problems with blurry shots.The only things I don't like about the camera are probably the features Kodak scrimped on in order to offer the DX4530 at such a great price. 1) The lens cap falls off on it's own in the camera bag. 2) The lens is a Kodak, not the higher quality lens protected by a shutter found on some of KPdak's pricier cameras. 3) This is no fault of Kodak, but with 5 MP, the pictures take up a lot of memory, on the camera and on the memory card, so you definitely want to buy a memory card, maybe a few. But I am sure those are the sacrifices made to get a 5 MP at or below $300.", "Date": "January 1, 2004"}, {"Title": "Close ups are questionable.", "Author": "Bill", "ReviewID": "RXY5SDS1Y0R9O", "Overall": "3.0", "Content": "Fair camera for the price. I have found out that a close up of something that has text is blurry. I have a college with a similiar Cannon product. When I compare the pictures side to side the Cannon wins out. I have had a brand new out of the box Kodak 4 MP camera that I gave to a relative. After 15-17 pictures it kept saying the battery was dead. With every NEW battery replacement it kept saying the same thing. My faith in Kodak products is going down hill", "Date": "October 11, 2004"}, {"Title": "Non American Made Kodak DX4530 AMAZON ERROR(alkalines) xxxx", "Author": "\"aaaamericandotcom\"", "ReviewID": "R3C6LPPNSRQYA7", "Overall": "5.0", "Content": "Do not use Alkalines in this Non American Made Kodak named camera. Amazons editor must not know this. As it was listed in the product specs they entered(alkalines included, rechargeables recommended);. Use of that form of battery may/will damage it.A Lithium battery pack is included and has a LONGgg life span as reported in Consumer Reports.Reading the reviews here is an asset prior to purchase as the aware consumer is the best user of any product/service in my opinion.Comparison price and  find your best cost basis. This camera is a wonderful unit with low cost as well quality with ease of usages.The light next to the viewfinder is a PITA as well the lens cover but like living near rail tracks you get accustomed.I do wish this was MADE in the USA!", "Date": "March 4, 2004"}, {"Title": "Great Pictures Even By 2010 Standards", "Author": "Barclay Hinson \"Red Clay Dawg\"", "ReviewID": "RPQKCVQ130Z5I", "Overall": "5.0", "Content": "Very rarely do I like a product enough to take time to write a review, but my old friend the Kodak DX4530 deserves some love.I bought this camera \"like new\" in its original packaging at a local pawn shop in 2004 - about a year after it hit the market with a $400 list price. This camera was made before you could buy a 10 MP camera new for $75. I paid $75 for it used and it has proven to be money well spent. It is our \"go to\" camera for point and shoot use.Every family gathering we attend, this 5 MP camera routinely outperforms newer model cameras with larger file size capabilities. The sister in-laws with 8 and 10 MP cameras are perplexed by their cameras inferiority to the DX4530 and always ask how we take such great photos.One cool feature this camera possesses is that it actually has a viewfinder (you know, the little glass window folks used to peer through for a preview of their shot) in addition to an LCD screen. I am not aware of any point and shoot digital cameras made with a viewfinder now. The viewfinder is good for two reasons - (1) it allows you to save money on batteries by disabling the \"live view\" LCD screen, and (2) it reduces camera shake when you press it against your face to take a photo.I really don't have a problem with the lens cap and \"bulk\" I have read others complaining about. Compared to the 35mm's I grew up with this thing is tiny.This camera has been a real workhorse over the last 6 years. If you can find a used one in good condition I would jump on it. It will take photographs comparable with many of today's point and shoot digitals.", "Date": "May 30, 2010"}, {"Title": "A quick note", "Author": "L. Renninger \"LisaMama\"", "ReviewID": "RIWI78M6ZLM8R", "Overall": "3.0", "Content": "Just a quick note: the lens cap attaches to the camera via a string, and is a real pain.", "Date": "November 4, 2006"}, {"Title": "NOT FOR EBAY SELLERS", "Author": "Wendy \"Wendy\"", "ReviewID": "R35CVFR1JDT68D", "Overall": "1.0", "Content": "I purchased this camera after my Olympus 1.2 Megapixel died after 5 years of hard use.  If I could revive my Olympus, I would in a heartbeat.  I am so very Disgusted with this Kodak camera.  It is impossible to get a picture that doesn't look dark indoors.  I sell items on ebay and the pictures I attempted to take of anything red came out very blurry.  I read the entire manual and tried every combination of settings to try to improve the picture quality.  The night vision also produces extremely blurry images.  It is easy to use, and the software is easy, I liked the camera dock, but if you want good quality pictures, don't go with this camera.  I am taking it back and spending the extra money on the Olympus, my first one never failed me.", "Date": "December 24, 2004"}, {"Title": "OK pictures terrible software", "Author": "W. A. Wood", "ReviewID": "R2AABNT7RZMQB3", "Overall": "2.0", "Content": "Camera is small, light and easy to handle. It takes ok pictures, nothing great but acceptable. The kodak software is awful. Half the time it works and half the time I have to delete the program and reinstall. Maybe I am spoiled by my Sony camcorder that also takes still pictures where the camera and software work very well. Have had the kodak since Oct 2003 and find it only marginally satisfactory.", "Date": "August 19, 2004"}, {"Title": "I'd never buy another Kodak camera!", "Author": null, "ReviewID": "R2SH5W2UDOG4A1", "Overall": "1.0", "Content": "I'd never buy another Kodak camera!I bought a Kodak digital camera and it has been fine. However, knowing what I know now I would never buy another Kodak camera. Ever. I dropped the camera, and a little plastic piece broke off which keeps the battery pack in the camera. Not a big deal. But NOONE repairs Kodak cameras. Instead you HAVE to send it into their corporate repair center and they instead sell you on trading it in for a refurbished camera. So, I can send this one in and for $250 get a new refurbished camera. Whooppe! But it only sells for $50 more on amazon.com - and thats a new, non-refurbished one! Its a total crock. Just be forwarned. I'd never buy a camera which I cant get repaired locally.", "Date": "April 14, 2004"}, {"Title": "This camera failed me", "Author": "Dawn", "ReviewID": "R19IUKNOZHVIDK", "Overall": "1.0", "Content": "I don't think I can honestly give this camera 1 star.  I had the camera for a month, worked great, brought it on a vacation and quit working, the screen went black, all my pictures were black (and the lens cap was off!).  The flash went off every time taking a picture, but turned completely black.  The quick view was completely black.  I pushed a few buttons and it worked again; the next day it failed me once again.  I went to a Kodak shop which offered little help, I called Kodak directly to speak with a technician for an hour plus and yet my camera continued to not work on my third of ten days on vacation.  I was very dissapointed.  I showed the camera to a family member, which made it work like it was brand new.  Last Friday, I was taking pictures and it went black once again.  I brought it to the store I purchased it from and they could not figure it out and I would suggest to anyone not to purchase this product.  It is not fun to know you are on vacation and cannot take any pictures because your camera quit working.  I will stick to film for awhile now.", "Date": "January 25, 2004"}, {"Title": "Excellent Quality, Easy To Use", "Author": null, "ReviewID": "RB2L4BV1MKJC0", "Overall": "5.0", "Content": "I'm very, very impressed with this camera.  I've had no problems with it & I'm amazed at the quality of photos.  It's very easy to use, it's as simple as opening the box, removing the battery, and insert the battery.  Kodak makes it very easy to shoot, view & share your photos.  Two things that I wish were a bit different:  #1 32MB Onboard Memory, I wish it were larger, but you can get about 20 photos at the highest quality setting.  #2 The optical zoom is only 3x.  It'd be nice if it were more, but it does have an extra 10x digital zoom.", "Date": "November 3, 2003"}, {"Title": "Mixed opinion", "Author": null, "ReviewID": "R2ZXAHW896EYLZ", "Overall": "2.0", "Content": "I gave this camera all the time and kept giving the befit of doubt to it, that may be I am not taking the pics properly and the fact that it is a kodak, and who would make a better camera than kodak.I still have it and looks like that I am going to return it, the pics are excellent on sunny days and also indoor pics are very good too especially if the subject is close.  But the evening pics are just disgusting, and dont even talk about the night pics, flash is useless if the subject is more than 15 feet away.My biggest problem is that this camera gives very very blurry pics if it is shaken even very slightly duing the pic.  Sometimes it is blurry, and sometimes it is not.Easy of usability:  Great.Internal memory:  Great (32MB).Pixels 5MB:  Great.Price:  Great.But it cannot take great pics, why bother with all the other things.", "Date": "December 26, 2003"}, {"Title": "How fast can you take pictures", "Author": null, "ReviewID": "R2SS3ZZH0VWC92", "Overall": "5.0", "Content": "For those of you who have this camera, how fast can you take pictures back to back?Thanks", "Date": "January 12, 2004"}, {"Title": "KODAK Made in China designed in Japan", "Author": "JR", "ReviewID": "R3N9J6C66ZH2H6", "Overall": "5.0", "Content": "Kodak has this great low cost camera which is actually multinational. Designed in Japan, made in China and for Kodak. As read here there are only a few flaws like when those counties use there people to model for clothes, shoes and other things. Sometimes the fit has things to be desired.The lens cover does need to be improved upon as it drops when turned on. A small green light next to the viewfinder is not useful in that place. Software quirks do exist and need tweaking. We use the Windows 98 (First Edition) and Windows 95 First Edition (Remember BOB and the game on it?). Netscape 4.7 in a browser is still great I think also no attacks like people with MS Explorer and the newer Operating Systems by MS.Taking pictures with this remarkable machine is wonderful then with ease a push of one button going into the computer (pc) controller. Wow talk about easy this is great and  with the  DX400 Easy Share Prointer also.Reading reviews here, in magazines like Consumer Reports and asking others helps . Finding the best cost basis I think is most peoples factoring bottom line and here helps best.Try this machine at your local stores and ask the agent to show you how it works too with exaples. Thats why they get paid eh?Remeber the ad? TRY IT YOUALL LIKE IT!", "Date": "March 9, 2004"}, {"Title": "Kodak Easy Share DX4530 great condition with manual", "Author": "Nancy A. Wakeman \"Nancy Anne Wakeman\"", "ReviewID": "R25P8FPJIG3MW4", "Overall": "5.0", "Content": "I would like to sell this digital camera with leather case included, as I use a Fugi. This camera has had very little use. Original price was 429.00. Willing to sell for 135.00. Gathering income from electronics to purchase new printer. I am a professional photographer. Comes with manual as well.", "Date": "December 12, 2005"}, {"Title": "love the camera", "Author": null, "ReviewID": "RC9EGPKKW6E0W", "Overall": "1.0", "Content": "I found the camera so easy to use. I would not have been familar with digital cameras until we purchased this kodak camera. everything with it is so simple. so easy to use. Brilliant camera.", "Date": "April 15, 2004"}, {"Title": "Better deal at Walmart", "Author": null, "ReviewID": "RJCF55GK1GEJ3", "Overall": "1.0", "Content": "This one is available for under $300 at your local walmart. No extra memory though.", "Date": "November 15, 2003"}], "ProductInfo": {"Price": "Unavailable", "Features": "5.0 megapixel sensor creates 2588 x 1954 images for high-resolution prints up to poster size\n3x optical zoom and 3.3x digital zoom for 10x total\n32 MB internal memory with slot for adding MMC and SD memory cards\n60-second video clips with audio; 1.8-inch indoor/outdoor LCD; compatible with 4000-series docs\nPowered by 2 AA batteries (CRV3 lithium included, rechargeables recommended); connects with Macs and PCs via USB 1.1", "Name": "Kodak EasyShare DX4530 5MP Digital Camera w/ 3x Optical Zoom", "ImgURL": "http://ecx.images-amazon.com/images/I/41GBDHBEQ0L._SX300_.jpg", "ProductID": "B0000APONO"}}