{"Reviews": [{"Title": "3.2 megapixel's + izone 300 = large blurry jpg", "Author": "Steve", "ReviewID": "R2R7S3D9H7LNE2", "Overall": "2.0", "Content": "I was highly disappointed after having purchased this camera.  I wanted to use this camera as a way to quickly capture some white board information on business trips, and record a few sights along the way, with the built in battery.  To do those few things and be small enough to fit in a shirt pocket seemed like it was a perfect fit, wanting to travel light.What I got was a camera that may only take good pictures in bright sunlight, which I did not have.  I was in a hotel room, and I would have been in conference rooms and factories, where the light would tend to be on the moderate side.Without the flash (in a well lit hotel room), the pictures were very dark and noisy.  Even holding the camera extremely still, I could not get a crisp picture.With the flash, I got a picture what was still very dark in the darker colors, and very bright in the lighter colors (not very balanced).  I tried the adjustments they allow (exposure compensation, and white balance adjustments), with no luck in making it perform any better.  I know my way around digital cameras enough to know what I could adjust to make it perform a little better.The pictures were basically 3.2 million pixels that formed a blurred image.  Even the best photo's I took had very little clarity in the details when zoomed in after loading onto my computer.  Not nearly as effective as I had hoped.  I could barely make out typed words on a comment card, and I was trying to take the best picture of it that I could.The camera MAY perform well in a bright sunlit environment,  when all you want it a quick snapshot, but most people want an all around camera that will also take a decent pictures indoors, and some in low light with the flash.Aside from the look and feel of the light weight and small camera, as well as the internal li-ion battery, I could not find anything in the way of the actual photographs that would make me want to keep it.I promptly returned it and purchased a slightly more expensive and larger Canon Powershot A410.  I would recommend you bypass the Polariod izone i300 altogether and go for the Canon... But that will be a different review altogether.  I can't say enough good about the A410 for the price.", "Date": "October 29, 2005"}, {"Title": "THE BEST I'VE EVER SEEN FOR THE PRICE", "Author": "Dale Sabacky", "ReviewID": "RBRWYEHV5WO0O", "Overall": "5.0", "Content": "I just returned from a business trip to Vermont. I had promised my daughter a picture of the snow and forgot my camera. I went to Walmart and was going to buy a disposable when I saw the iZone 300 and decided to buy it for the trip and then give it to my daughter. I went back to the hotel and looked up reviews on it before opening the box. After reading the reviews on this site I almost returned it before trying it out. However, since I had a week and nothing to lose I figured I'd give it a try and then return it before I left if it was as sucky as some of the reviews indicated. I honestly cannot find anything wrong with this camera. It is everything it claims to be and then some. It took absolutely amazing pictures and when I used the flash it worked flawlessly. It says right in the instructions to use the flash only at a distance of 3-6 meters. If you use this camera exactly the way it represents itself in the manual you will be delighted. If you expect more than what it is designed to do or do not use it as directed it will possibly dissapoint you. But, even then you've got to get your monies worth from it. It is a steal at the $78.00 I paid for it. Now that I am home and my daughter is using it she is delighted with it also. She is 10 and taking excellent pictures with it and finds it very easy to use. I highly recommend this camera to anyone wanting an inexpensive camera that's simple to use and takes outstanding pictures.", "Date": "March 5, 2006"}, {"Title": "What did you expect?", "Author": "R. A. Hallett", "ReviewID": "R1LZZJ0M1XJR52", "Overall": "3.0", "Content": "I purchased this camera KNOWING that I was buying an inexpensive digital camera that I could use for fun pictures.  I didnt think I would be winning any awards with the photos I took with it (I have a $300 Canon Rebel EOS for that).  So far I have had some struggles (mostly with the flash) but I have to say overall Ive been pleased with the results.  Once you figure out that natural lighting works best, you can get good inside pictures.  I took several beautiful pictures of the Rocky mountains from an airplane window as I flew over at 30,000 ft.  Ive taken some great outdoor shots as well.  When you buy a $70 camera with no optical zoom and 3.2 megapixels why would you expect perfect shots without some operator effort?  I say, be patient with it and figure out what works best and you'll be happy with this camera as a fun, travel camera for vacations or just amusing day to day adventures.", "Date": "May 7, 2006"}, {"Title": "Read the reviews.", "Author": "Nir@d", "ReviewID": "R2ROCTXRS2OI9W", "Overall": "1.0", "Content": "Do not buy this camera, I repeat do not buy this camera! Just read the reviews and you'll know exactly what I mean. Lucky I got this piece of junk for Christmas, so I didn't spend a dime on it. I opened the package BEFORE reading any reviews. Now I wish I've read the reviews before opening the box. I don't care what setting you use, I tried them all and I have yet to take a picture any better than my cell phones camera. The lighting sucks, you either end up with dark pictures or super bright ones. I really wanted this camera to work, it looks sweet but sadly it can't take pictures.", "Date": "December 25, 2006"}, {"Title": "Undervalued Tech", "Author": "David Van Brink \"Consumer\"", "ReviewID": "R1E4YB0S32LIOC", "Overall": "5.0", "Content": "I've been using my iZone 300 for about four months now. I still love it. It's got round corners so I can carry it in my pocket, and it recharges while plugged in to the USB. I've almost never run out of battery power. I got a 256mb card that holds hundreds of pictures.It _is_ a cheap camera. It won't take great low-light pictures. The flash is useful at medium-distances to help fill in the area, sometimes. Too close and you'll get a white smear.It _does_ take very beautiful pictures. Somewhat technicolor looking, sometimes. It is fixed-focus and fixed-angle. You can digital zoom a little, but the default angle is just fine.I find the UI very straightforward.", "Date": "July 18, 2006"}, {"Title": "HORRIBLE CAMERA", "Author": "Steph4587 \"Steph\"", "ReviewID": "R2R6F6XMBIW43", "Overall": "1.0", "Content": "I was in Walmart looking for a digital camera, and came across this cute little thing. I saw it was a 3.2 MP, being a decent picture. I was sold solely on the compact look,the price and i assumed it has alright quality. (the pic's took ok in the store but only b/c of how bright it is in there)I got it home, and took a few shots, they were no good. so i thought id keep it for the weekend and play around with it, thinking i needed to get to know my camera. WRONG!! this thing doesnt get better!!! its horrible. the quality is crappy. the pictures blurr. the flash is delayed for 10 sec. u cant take a pic closer than 5 ft away from object (ex. fun pics of u and ur friends/family where u hold it out in front on you) the pics will come out white!!! BAD BUY!!! WASTE OF MONEY!! BEWARE", "Date": "April 25, 2006"}, {"Title": "Is this thing defective? (Problems other than bad pictures)", "Author": "Dan R. Dilocker \"Regular College Kid\"", "ReviewID": "R1YKTGKU53QQWK", "Overall": "1.0", "Content": "I'm a college student, and I got this as a Christmas gift from my girlfriend.  I REALLY wanted to like this camera, but it eventually HAD to be taken back.  I seriously thought it was just defective until I read some of these reviews.  I read a review where some guy thought it took great pictures of some snow and gave it a 5-star rating... well, duh.  Of course it takes good pictures of snow.  Snow is white, just like every picture this thing takes.  Every picture is at least somewhat blurry.  And besides the blurriness, every picture is either too dark or too bright.  I read some reviews that were defending this camera that say the pictures look fine if taken between 6 and 9 feet.  Oh great.  That's useful.  Because no one ever wants to take a picture outside that range???  You have to have EXTREMELY low expectations to think that this camera takes decent pictures.Besides the low picture quality, the fact the camera doesn't allow you to use AA batteries is a bad thing in my mind.  What if you're on a trip and you don't have access to an outlet to charge it?  It'd be nice to just have an extra pair of lithium AA's.  Plus.. rechargeable batteries eventually no longer hold a charge.  After a year, the internal battery, when maximum charged will probably only be able to take a dozen pictures before the battery is spent.  This is just a simple fact of rechargeable batteries.  That's why laptop makers provide a maximum of 1 year warranty on their batteries.Also, the thing won't stop beeping!  With every click of a button, the thing makes this annoying beep.  You go to the settings to mute the beep, but when you restart the camera, the settings are reset and back comes the beep!  And it takes about 8 clicks to get to the mute setting... So, say you're at a wedding and you want to take a picture.. all of a sudden.. BEEP... BEEP.. You may kiss the.. BEEP... c'mon Polaroid.  I guess the picture wouldn't turn out unless your 6 to 9 feet away anyway...One last bad thing about this camera.  On any other LCD display I've used... even on my cheap camera phone.. when you're in a dark environment, the lcd display automatically adjusts to be brighter so you can see what you're taking a picture of.  When the environment is bright, the lcd adjusts to be dimmer.  This display doesn't change!  If you're even in a simple dim living room, you can't see anything on the display!  That is just ridiculous.Overall, I feel this camera is a piece of junk.  It looks cool, size is perfect, it could be pretty convenient if it worked, but the purpose of a camera is to take pictures.  This 'camera' does that VERY poorly... therefore, this is a poor camera.  Buy it if you enjoy disappointment.", "Date": "April 4, 2006"}, {"Title": "Gawd Has Foresaken me...", "Author": "Robert Lanckton \"Alice\"", "ReviewID": "RWLCI59427ULE", "Overall": "1.0", "Content": "I got this camera very quickly, service was fantastic. I say this because any retailer who sells these shouldnt feel too responsible for the sin that is this camera. I have had my dealings with 3.2mp cameras, some made in the 1990s and I am very appalled to have used this camera and to get this kind of low quality shot.Pictures are blurry. Well unless you use the flash, then they are completely \"pixelated\" and are engulfed in white.This is not a deal for the money, it doesnt even serve its purpose as a camera.I will say I love the design of the camera, and this just makes me want apple to delve into the camera industry.Conclusion: dont purchase this if you're looking for something to take pictures with. If you want to load this on your computer and waste your time, go for it, otherwise, buy anything else.", "Date": "March 19, 2006"}, {"Title": "great for me, but probably not for everyone", "Author": "R. Loughney", "ReviewID": "RBI7XGEWGWLYX", "Overall": "4.0", "Content": "I bought this camera because Ive been holding out on buying an expensive top of the line point and shoot for casual picture taking. Im going on vacation soon, so I decided to spend a little to get a little. This camera delivers exactly that. The picture quality is good for emailing pictures to friends and relatives, and the size and style of the camera are great. The battery life and lcd screen are some things that arent that great. A room that you might think is not that dark will show only black on the LCD screen. The flash at close ranges will wash out colors at times. All these things that are considered to be flaws with a camera have turned out to be the reason I really love the pictures this camera takes. Many pictures look somewhat artsy and while others may think the colors are off or the picture is blurry, I think the pictures this little inexpensive camera takes are interesting. After buying this camera and a 512mb memory stick for less than $100, I may never get around to buying that expensive 7 megapixel camera.", "Date": "July 17, 2006"}, {"Title": "THIS IS ACTUALLY A DISPOSABLE CAMERA IN DISGUISE", "Author": "Photo Mom", "ReviewID": "RHLICSGOZFPPZ", "Overall": "1.0", "Content": "DO NOT BUY THIS PRODUCT!  IT IS ESSENTIALY A VERY EXPENSIVE DISPOSABLE CAMERA!!!  I WOULD HAVE GIVEN IT ZERO OR NEGATIVE STARS BUT THEY DON'T HAVE THAT OPTION!I bought this camera about a year ago for my daughter because it is relatively inexpensive and Polaroid has been around a long time.  The picture quality was pretty lousy, but that really didn't matter since it was for a child...BUT, right from the start the battery did not charge...we assumed we were doing something wrong, and recently the camera was completely dead...we tried to find out how to change the battery and ended up contacting the company...this is the reply we received:Thank you for your recent email about your needs for service.There are no replacement parts available for the iZone 300 Digital Camera, including batteries.If you need to order a replacement part for your Polaroid product, please call us at 877-388-3779 during office hours.When you call us, please give the service agent your EMAIL ADDRESS so they can find you in our database for prompt processing of your request.Regards,Polaroid Technical SupportNot only is it crazy not to be able to replace the battery in a non-disposable type camera, but then they tell me to call to order replacement parts that they just told me don't exist...You're better off spending a little more and dealing with someone that supports their product, like Fuji or Canon...please beware!!!!", "Date": "May 10, 2007"}, {"Title": "good enough for the price", "Author": null, "ReviewID": "R2JEC990VQHS5V", "Overall": "3.0", "Content": "I got this camera around a year ago for christmas, its a good camera for the price. You usually always have to have flash on which can get a bit annoying, considering no one wants to be blinded by the flash. This isn't a camera that you just mess with it and you know how it works, people, actually read the directions.This really should just be used for snapshots, dont buy it if you plan on taking high quality pictures with this thing, it just wont work. The size is good, it doesn't break easily. Its mainly a kids or teens camera, if you want a really good camera, you're price range will have to be, at the lowest, around $150.So for the price, its not that bad.", "Date": "January 14, 2007"}, {"Title": "Great product... if you don't want to take pictures!", "Author": "J. Chorel", "ReviewID": "R3R2IZZA5Y1SM2", "Overall": "1.0", "Content": "I purchased this camera for my 6 yr old daughter. It isn't even good enough for a child's toy camera!She had asked for a camera with a flash and screen for viewing what she had taken photos of. This camera looked like it would fit the bill. It was small and \"cool\" looking, had a dock (great idea), Li-ion battery (great idea) and a skin (great idea.) Unfortunately it lacks the ability to take decent photos in varied environments (We are not always outside in the sun!) If they would put a better camera in the same package it would become very desirable.Save yourself the grief and buy something else. I'm getting a 5MP HP (for less money even!)", "Date": "November 30, 2006"}, {"Title": "it is a nice camera", "Author": null, "ReviewID": "RUTP95MI6LY1S", "Overall": "4.0", "Content": "im a 13 year old girl that gets mad easily. i did not get mad over this thing.i dont know what other people are talking bout when it doesnt work. i got mine yesterday and it took great pics. the only prob. is that you cant see what you r taking a pic of in the dark. the beep turned off right when i press it to stop. i did not know that there was a video thingy but it was cool. the thing w/ that is that u need light cause that doesnt have flash. other than a few things, IT IS THE GREATEST CAMERA I HAVE HAD!!!!!!!!", "Date": "April 18, 2006"}, {"Title": "Not worth the money", "Author": "Justin Pope \"jupo42\"", "ReviewID": "R24XX0TS8SV662", "Overall": "1.0", "Content": "I got this free when I bought a laptop late last year, and even then, it's barely a value at that price.As other reviewers have said, the picture quality (yes, at the highest quality settings) is barely better than the <1 MP camera in my cheap-o cellphone. Whether using the flash or taking in a well-lit environment, you'll still need a rock-steady arm to avoid getting a big blurry mess.I had hoped this little free camera, cute as it was, would at least help me get by after my old Fuji 3MP camera was stolen. I didn't expect it to match the Fuji's quality, but this extreme difference is inexcusable. Instead, I've gone back to using my 35mm film camera and scanner.If you actually decide to pay money for this camera, well, I feel very sorry for you. Please spend a few bucks more and find a REAL camera...", "Date": "June 16, 2007"}, {"Title": "Buy Something Else", "Author": "Reese From CT", "ReviewID": "R38HZK2THL9U31", "Overall": "1.0", "Content": "We have had this camera for about a year.  We wanted an inexpensive camera but buying this was a big mistake.  The picture quality is terrible and now it is not even working. We have a Canon Powershot A60 as well and have been very happy with the performance.  I would not recommend this Polaroid camera to anyone.", "Date": "February 16, 2007"}, {"Title": "THE WORST CAMERA I EVER HAD!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!", "Author": null, "ReviewID": "RZZS8ZJ4YO292", "Overall": "1.0", "Content": "I got this camera for my birthday last year and...let me tell you...DONT GET IT!!!!...this is what i dont like about it...1. that annoying beeping noise it makes while taking a picture.2. you take like 5 pictures and the battery dies!!!3. (i) cant recharge it with the wall adapter thing...4. pictures dont show up good on the screen.5.  well...its just a peice of junk!", "Date": "February 19, 2007"}, {"Title": "Good starter camera - don't listen to the negative reviews", "Author": "L. Fiddler \"BookWorm\"", "ReviewID": "R1Z258V9DXDZ9F", "Overall": "4.0", "Content": "I purchased this camera for my sixteen year old niece.  It's only a 3.2MP so the picture quality isn't as good as a 5.0MP, however, 3.2MP is above average quality.  This is a great starter camera for a young person or teenager.  It's compact, has easy to use menu items, and a cool charger base.  The batteries run out a little too fast but so do the ones in my expensive 5.0MP camera.  It's the nature of the beast...The person who wrote the review about the pictures being to dark didn't turn on the flash.  The flash must be turned on in low light.  If they had read the directions, they would have figured that out.  Once the flash is turned on the pictures come out perfect.Don't hesitate to buy this affordable camera for someone as a starter.  It is a great device.I gave this \"4\" stars because of the price, features, and slim body.  I thought \"5\" stars was too high because it is not for a serious picture taker, it's a great \"first\" camera.", "Date": "December 27, 2006"}, {"Title": "Izone 310", "Author": null, "ReviewID": "R27V2PFOTBP53B", "Overall": "4.0", "Content": "I recently got an Izone 310 for Christmas.  At first, the pictures came out dark.  If I turned on the flash, it came out white.  But today, I called technical support because the e-mail support wasn't working.  They said the flash has a range of 6-9 feet, and any closer than that would be washed out.  If you want the picture to be closer, use the zoom.", "Date": "February 20, 2006"}, {"Title": "Flash Problem An Easy Fix", "Author": "T. Eiden \"tlb\"", "ReviewID": "R3O5X0B6TZFAK", "Overall": "3.0", "Content": "We purchased this for our 13 year old daughter- the cradle and the softwear make it really easy for her to download her pictures.  The only complaint she had was that when she tried to take close-ups with the flash the faces washed out.  We taped a tiny piece of white paper across the flash (diffusing it just enough) and the close-ups look just fine now.If you need something simple to use this would work well.", "Date": "November 29, 2007"}, {"Title": "a complete disappointment", "Author": "Carlos Avila Arquin \"Gato\"", "ReviewID": "R1VFS7Q8S9OUQ8", "Overall": "1.0", "Content": "For years I have had my old Samsung Digimax 300 of 3.2 mp, And let me tell you that is a pretty good camera, I'm using even now, and the quality of the pictures it is great, so, when my brother gave me some weeks ago the Polaroid Izone 300 I was very exciting about my new camera, cos I thougth this one it could be the choosen one to replace my old camera.But the whole thing it was a complete dissappointment, I mean, I can not compare the quality of the pictures of my old Samsung Digimax (it is almost 4 years with me!!!) with this new one Polaroid iZone.So if you are looking for a new, cheap and good Digital Camera, I suggest to buy a Samsung Digimax, maybe of 5 mp, you can find it here, in amazon for less than US$ 100 I think... actually I am very exciting cos I am waiting for my new Sony Cybershot DH 2, a more powerfull camera than my old Digimax, so I think that camera will be a decent replacement of my old camera, but avoid to buy this one, trust me!!!", "Date": "April 30, 2007"}, {"Title": "Good buy for amateur starving artists/ photographers", "Author": "A. Gregg \"Nashville Punx\"", "ReviewID": "R3TA3KUTO1MF22", "Overall": "4.0", "Content": "I just got this camera for Christmas and have already taken tons of pictures and used the video feature several times. Its small design is a great feature, is great for students, and the styling is absolutely adorable. My two complaints are:1. The LCD screen shows black for what most would think of as of a well lit room. Indicating that the need for flash may be more prominent than on other cameras.2. The camera is not, by any means, self explanatory.I have an absolute phobia of manuals and guides, so when I first got the camera out of the box, I can say only that I was amazed at the many functions that can be fit into only 1 button. If you, like me, have a fear of manuals, either do not buy this camera or get a trained professional (or the closest person near you) to help you figure the camera out. One day at a time, my brothers and sisters. One day at a time.", "Date": "December 31, 2006"}, {"Title": "pfft.", "Author": "sally", "ReviewID": "RA33KZ1XNHZ8G", "Overall": "1.0", "Content": "this camera is a piece of junk. you have to be standing outside in bright sunlight to get a decent picture. and then when you try to use the flash it is so bright that everything in the foreground of the picture is washed out. not to mention the battery life is horrible. i got a 1 GB memory card so i could take lots of pictures, but the battery runs out after i took about 10. so all in all, if you're considering buying this thing, save the money and frustration and just don't.", "Date": "February 9, 2007"}, {"Title": "This is a Polaroid Camera.  Relax.", "Author": "J. Hagar", "ReviewID": "R2UXM813JIQJW6", "Overall": "4.0", "Content": "This is just in response to all the whiny reviews I've read about this camera.  It's a Polaroid.  Whether you're using the old film kind or the new digital kind, this is not meant to dazzle.  Polaroids have bright flashes and are always at least slightly unpredictable.  It's a sense of adventure that compels you to buy the Polaroid because you're not concerned with how pretty your picture's gonna be.  So honestly, if you want top notch photos, then spend the money!  Stop whining that you paid as little money as possible for a digital camera and it's not making you look like a good photographer!Anyway.  I think the camera is great fun and it's quirks make for some really interesting shots.  Then again, that's why I've always loved Polaroids.  I have a real camera for taking real, capital P, Photos.  It's $80.  Relax.", "Date": "January 7, 2006"}, {"Title": "Good", "Author": "Beth Wingard", "ReviewID": "R3CB2AQ3YYKAVB", "Overall": "5.0", "Content": "My five year old granddaughter wanted a real camera and seems happy with this.  I haven't seen any pictures yet, so can't comment on quality.", "Date": "January 3, 2014"}, {"Title": "great camera", "Author": "patt", "ReviewID": "REXS0AQGSH4Z5", "Overall": "5.0", "Content": "My favorite digital camera. Its so easy to use and for the price I was not upset when it went swimming, however,  after it dried out, I was able to use it!", "Date": "June 26, 2013"}, {"Title": "horrible - stay away", "Author": "Doug \"chaos40\"", "ReviewID": "RSUSJZNBH44HD", "Overall": "1.0", "Content": "How far Polaroid has fallen. Selling this \"camera\" with the brand name \"Polaroid\" on it is an insult to the hard work and dedication of all the people who ever worked there.  Here are the positives: Light weight, durable, easy to insert and remove the SSD memory card. Here is the negative: TAKES HORRIBLE PICTURES.  I mean bad. Really, really terrible. I'll try to link to one of the actual pictures taken with this camera (not sure if Amazon will leave the link intact). Note the 'Fun House Mirror' effect, too: [...]", "Date": "April 6, 2011"}, {"Title": "I can't believe Amazon sells this camera yet", "Author": "La Mar R. Binder \"spudmonk\"", "ReviewID": "R55TNX5XD3S66", "Overall": "1.0", "Content": "I bought this to be a small knock-a-round camera, to take with me when I wasn't in controlled conditions. That bill it filled exactly. However, I did expect some decent pictures out of it. Basically, picture wise, it is pathetic. It's easy to use, but takes horrible pictures, and the flash is all but useless. A total waste of money, considering you can get a Kodak for about the same price, which gives far superior picture quality. Don't waste your money. Buy something else, or just don't buy. Shame on Amazon for continuing to sell something this bad.", "Date": "May 9, 2009"}, {"Title": "Pathetic Camera...", "Author": "Shadow", "ReviewID": "R14R8GIN7PT8IR", "Overall": "2.0", "Content": "This is probably the worst digital camera I've ever seen. I got it as a gift for Christmas a few years back, and I rarely used the thing. Why? The camera is simply horrible at taking photos if there's no light around. The LCD screen is practically useless; rarely can I get it to show a thing. The camera looks nice, I'll give it that, but at the price I believe it was purchased at (Around $50) it wasn't nearly worth its value. All I use it for now is as an SD card reader. Overall, don't buy this camera... there's lots of better ones out there. Even a cell phone like my RAZR has a better camera than this!", "Date": "March 6, 2009"}, {"Title": "very basic but  works", "Author": "K. lett \"gemini6kl\"", "ReviewID": "R2UMDC42IDLH7M", "Overall": "3.0", "Content": "After i bought the camera i went to amazon and looked at the reviews and was wondering if i made a big mistake, well i wanted a basic cheap camera for a friend so i bought this one. well the camera came and i was expecting something that took horrible pictures, well suprise..,,,, i tested it by taking  a couple of pictures and was quite surprised the picture came out well, people  u must read the instructions, inside photos u MUST use the flash  and people or objects must be a few feet away and the flash works fine no whiteout. in no way is this camera for zooming in on stuff or  taking really good photos for special occasions . the megapixel is just not enough for that . its great for a simple small photo of let say yourself or friends. Very basic  and small but works.", "Date": "May 17, 2008"}, {"Title": "3.2 MP? I think you mean -0.00 MP!", "Author": "Joey", "ReviewID": "R2YGT23VRYOWTM", "Overall": "1.0", "Content": "A few years ago, my first digital camera was purchased. This camera happened to be Polaroid iZone 300. Well, I regret even touching this pathetic thing. My camera phone takes better pictures than this. This camera can't even take a perfect picture in the house. When I wanted to take my Myspace pictures, I had to be in the bathroom, which had about six or seven lightbulbs. This camera is a disgrace.Ladies and Gentlemen, do not purchase this camera. Look at all the reviews. This digital camera is horrible. Pictures look terrible. Things are too dark, and rarely too bright. A typical Polaroid  product. What ever happened to, \"Just right\"?", "Date": "March 12, 2008"}, {"Title": "\"Can you do half a star?\"", "Author": "C. perkins", "ReviewID": "R3G0ZJ9H7FG2SK", "Overall": "1.0", "Content": "I can't believe how much this camera sucks. I finally gave it to my two year old to play with.", "Date": "November 29, 2007"}, {"Title": "Sleek, cheap and easy", "Author": "L. Rodriguez", "ReviewID": "R1URG02E2PYN4Z", "Overall": "2.0", "Content": "Its sleek, Its cheap and its easy to use. Its great for outdoor shots but indoor not so. Indoor shots tend to be dark even with the flash and while the flash highlights the target the skin color tends not to be true to life. I would recommend this for outside pictures but not indoors. Battery life is decent and the charger is fine. Battery life lasts longer without the use of the flash.", "Date": "November 27, 2007"}, {"Title": "FASHIONISTA'S Camera!", "Author": "C. Balagot \"\"plug it in\"\"", "ReviewID": "R18G0YFKI90BYN", "Overall": "4.0", "Content": "POLAROID Ingenuity & Styling. Inexpensive BUT delivers! For the young and fashion-conscious crowd. What a pocket-digital should be! Very Nice and Sleek Design. Full-Function Camera. FUN to use and very reliable.", "Date": "November 16, 2007"}, {"Title": "Terrible.", "Author": "Dee", "ReviewID": "R2OQW8FEOM4AB0", "Overall": "1.0", "Content": "As some have said in their reviews the camera dies way too quickly. I don't know whether this was just with my camera but sometimes when I would take pictures the LCD screen would turn green and I would have to turn the camera off and back on again. Even in a lit room the LCD screen would be seemingly dark. The only way I could actually be able to view something so that I know whether or not I am getting a good snapshot of a picture is if I am outside in the bright sunlight. My camera is now broken because somehow the LCD screen has a crack on the inside of it which I don't see how this could have happened seeing as how I never really took my camera anywhere. When I called Polaroid to see if it could be fixed they gave me no information whatsoever. They only repeated back to me the obvious, which was that it was, well of course, cracked on the inside. Luckily I got the camera as Christmas gift though I believe my father only bought it because it was cheap camera.", "Date": "November 8, 2007"}, {"Title": "Good camera for the 12 and under!", "Author": "trm \"T\"", "ReviewID": "R14D9WYWSLHI6Z", "Overall": "3.0", "Content": "Let me start by saying this: if you pay more than $40, and purchase this for someone over the age of 12, you will most likely not be satisfied. I would then down grade this to a 2star, because they could almost get the same results with their camera phone(with the exception of more mega pix w/izone).I purchased this for my 6yr old girls, and I think it will be a great 1st camera for them. (Xmas gift) The buttons on the camera are well place, it has a flash, a decent size lcd (1.5) monitor, which you can view your pictures(which I noticed alot of kids cameras at low prices you cannot). You can change the image size to get the most out of your internal 8mb (640x480 47pic, 1600x1200 9pic)you can add extra memory w/sep purchase of an sd card.It has a built in battery and comes with a charging dock so you dont have to keep on replacing batteries. It has a clear skin you can attach to the camera to protect it from mishaps, and still take pictures. The quality of the pictures are decent, the camera is slightly bigger than a credit card, and has nice look and feel. (I felt the Fisher Price cameras would be to babyish for my 6 1/2yr olds, plus too awkward to carry around, and the disney cameras you did not get the larger lcd screen plus lower mega pix and alot less features at a higher price).After intense searching for an inexpensive camera that would give me some of the same functions as a more expensive camera would, I am quite happy with my purchase, and I think my girls would be too. Shop around and try not to pay any more than $40, and I think you would be quite satsified.  I purchased one camera through Amazon and one on ebay for less than $35 incl. shipping.", "Date": "October 19, 2007"}, {"Title": "Horrible Quality", "Author": "A. Maggard", "ReviewID": "R6W3TFFX7RXGL", "Overall": "1.0", "Content": "This was my first digital camera and I though I was getting a good deal because it was by Polaroid. Well, I was wrong and if this is the quality I get from a Polaroid digital camera, they need to stick to - well - Polaroids. Not only was the picture quality horrible, but the images took up so much memory I had to constantly upload the images to my computer before I left to go do something.The battery life is terrible and to be honest, the charging dock is pointless when you can just plug it directly into your computer via cable.It takes horrible pictures in the dark and the flash produces nothing but a blank, white image.If there's one thing I've learned, it's you get what you pay for and a quality camera is going to cost some extra. I've since bought a Kodak digital camera for about $200 and it is wonderful! Don't waste your money on this sorry excuse for a digital camera, instead, save for a better one. Not even worth giving to a 6-year-old as a gift.EDIT: I just now looked at the price on this thing. $100?! Are you kidding me!? I bought this camera at Wal-Mart something like 3 years ago and it was only $25! Even at that price it is a huge waste of money! I could have fed starving children in Africa! If you just want to get rid of $100, donate it to a charitable foundation, not to Polaroid!", "Date": "August 29, 2007"}, {"Title": "Do Not buy this Camera", "Author": "George King \"Emergentguy\"", "ReviewID": "R3LW3TWCHM9M21", "Overall": "1.0", "Content": "This is among the WORST customer service I have ever received in my history in the industry.  The item was damaged.  The company took calls on a what seemed to be a cell phone.  It took a week to get an answer, they did not offer to make what was wrong right.  They sent an invoice slip with no # on it or a return address.  The associate was rude.  You have been warned.", "Date": "June 7, 2007"}, {"Title": "HORRIBLE CAMERA", "Author": null, "ReviewID": "R151M9YWP7NEP6", "Overall": "1.0", "Content": "I asked for this for christmas, I was extremely happy with it, before I took any pictures. It is really nice to look at, but when you want to take a picture, it is dark. If you use the flash even remotely close to someone then they get like washed out to a white color, they flash blinds my friends, it sounds like an old camera flash and kind of goes POOF and pops when you use it. It scared my dog, the flash sent her into a corner scared. When you are trying to take a picture you cant use the LCd unless you are in bright sunlight outside, which then dont even come out great, the LCD is almost always black, i made sure it was on, and i played around with all the settings, it doesnt come with good instrutions. Very higly dissapointed, i do not reccommended this", "Date": "January 2, 2006"}, {"Title": "Worth It", "Author": "A Fan", "ReviewID": "R2A8VUKHD2990D", "Overall": "5.0", "Content": "It's easy to use and makes good pictures, easily a match for the disposable cameras that require you to turn the camera in and wait. I also have a 1GB san card so I can shoot up to almost 1400 pictures. As it is I shoot a couple and then load them into my laptop and send them to people via e-mail.", "Date": "January 3, 2007"}, {"Title": "Is this thing even supposed to be a camera?", "Author": "A. M. Patel \"MD, PhD, MBA\"", "ReviewID": "R2QGLMXIZX9SOY", "Overall": "1.0", "Content": "Maybe if this thing was designed to be a play-toy for preschoolers it might be okay.  Read the review by Regular College Kid and it is completely accurate.  Some people wrote a good review for this camera, but you must remember - there are a lot of not-very-smart people in this world.  I was especially surprised by the reviewer who wrote that the washed out colors and blurriness were \"artistic\".  Nobody wants a camera that has washed out colors and blurriness! Any room short of something really well lit will result in a black display on the LCD.  You can refer to Regular College Kid's review for all the info you need to know.  Luckily this camera was free.  I think i will use it for target practice or run over it with my car, just to avoid passing it on and frustrating another user.", "Date": "November 24, 2006"}, {"Title": "Eh, not that great.", "Author": "Abbie R", "ReviewID": "R1A8JZAV0ZSPF0", "Overall": "2.0", "Content": "This was my first digital camera. I bought it with rather high expectations, thinking that at 3.2 mega pixels it would have rather good display and other qualities. The things that bothered me most were the over-bright flash (which washed out the color of every photo I took with it, even outside at night) and the inadequate zoom. The display was pretty good for a camera at this price, but many things could've been improved. My advice to you: look around a bit more before settling on this camera. You may find it wasn't what you expected.", "Date": "July 15, 2006"}, {"Title": "Great for a Polaroid and It's Price", "Author": "Unkown", "ReviewID": "R5PJXUXSTJAFB", "Overall": "5.0", "Content": "Like the other reveiwer said, it is a Polaroid. They never have made GREAT! cameras. But this is a preety good one. Its a good camera for the price of $80.*Its has a nice small size*stilish look*takes good pictures, unless your hands are shaky*Great even if it were more expensiveIf your dont like the Quality pictures it takes then buy a better camera for a more expensive price.Overall Its a pretty good camera and i have enjoyed it!", "Date": "February 1, 2006"}, {"Title": "Bad Camera", "Author": "Mark Twain \"Sam\"", "ReviewID": "R2BP0SIC0O3G34", "Overall": "2.0", "Content": "I was very upset when i opened this camera on Christmas. All I asked my mom for was a camera that was simple that i could take pictures with when I'm with my friends. I started using this camera and found that I couldn't see through the screen, everything was dark. The flash was just obnoxious and annoying and hurt people's eyes, and if you took a picture from a meter away of someone, the face was washed out from the flash. If you didn't use the flash the picture would be dark. I tried playing around with the settings, but nothing seemed to help.I never tried using the camera outside in the daylight, where I'm sure it would work better.Overall, I was very upset with the iZone 300", "Date": "December 27, 2005"}, {"Title": "Not as good as I thought....", "Author": "Jill M. Curtis", "ReviewID": "RSSPEVVNEX970", "Overall": "2.0", "Content": "The picture quality is okay, but the battery life is HORRIBLE!", "Date": "February 6, 2007"}, {"Title": "COMPLETE WASTE OF MONEY", "Author": null, "ReviewID": "R1JMP0O5JM2XF9", "Overall": "1.0", "Content": "I just bought this camera today. I've been trying to find one of those cool small and thin cameras, and so I went to Target to spend some of my Christmas money on one I had glanced at earlier: the Polaroid izone 300. It seemed perfect: only $80, sleek and slim, 3.2 mp, 3x digital zoom, etc. The biggest drawing point was how cheap it was compared to similar cameras. Now I know why it was so cheap. The camera sucks!!!! In anyplace but outside in daylight, the lcd screen is dark!! Nothing I tried worked to fix it. Also, the user guide was incredibly unhelpful, not really explaining anything I wanted to know. The beep sound the camera makes whenever you press any button gets extremely annoying, and even though you can turn it off, every time you turn the camera power off and then on the terrible beep is back! It was driving me crazy. And even if you can deal with the beeping and the dark screen, the flash is way too bright and it takes forever to take another picture since the flash takes like 20 seconds to recharge. Overall, everything about this camera is awful, besides its looks, and apparently everyone else thinks so too.P.S. I've also been looking at the Che-ez! Foxz3 digital camera on amazon...its $100, and similar to this camera: its got 3.21 mp, but a bigger 2\" screen, looks even cooler, has 4x digital zoom instead of 3x, is thinner, AND it has gotten some good reviews...there are a few bad, but the good ones make it worth the chance, and besides, if you don't like it you can always return it!! I am going to return mine tomorrow and order a Foxz3 off of amazon.com. Hope this helped!", "Date": "January 6, 2006"}, {"Title": "sucky camera", "Author": "Susan JOnes \"Sue\"", "ReviewID": "RQU6OWZUDN4L0", "Overall": "1.0", "Content": "I got this camera for my kids for Xmas. We used it often. It was taking pictures fine outside or in a sunny room. But any other pictures taken were dark. I couldn't even find the target. I had to follow the lamp in the living room and move the camera down to floor where our dog is because the view window was black. Only the light stood out. I read all the directions one by one exactly as it said and it still takes crapy pictures. When you put the flash on the pictures come out when you look at them white. So bad you can't even see what the picture is. I tried taking a pictures of my sisters bridal shower today and now the pictures are coming out red. The cake came out with a flash all white. Nobody knew what it was. We thought for our first digital camera we wouldn't spend to much. It was small. You didn't need batteries. It had a charger. But I'm sending it back. I thought maybe it'd fix itself. So much for that. I wouldnt buy one.", "Date": "February 19, 2006"}, {"Title": "A waste of money", "Author": "Alfred K. Lagat \"The Lion Never Sleeps\"", "ReviewID": "R2YZ0KEJ3UAL7P", "Overall": "1.0", "Content": "This camera sucks, thats all i can say about it. One thing not mentioned before, you have to be super still to take a clear picture, otherwise the slightest shake will produce the worst distortion of your face ever.", "Date": "July 30, 2006"}, {"Title": "this carmera is not good", "Author": "mistake", "ReviewID": "R3FLDFPA7UYAAS", "Overall": "1.0", "Content": "poor user interface. bad picture quality. etc. etc.the camera looks cool, just doesn't work well", "Date": "February 21, 2006"}, {"Title": "Cool camera for teens", "Author": "B. Dangos \"Igorota\"", "ReviewID": "RARJXXDU6S7D3", "Overall": "3.0", "Content": "I bought this camera for a graduation gift. It is a very cool camera for teens. It's just the right size for teens to carry around.", "Date": "August 22, 2006"}, {"Title": "screwed", "Author": "Nancy Cain", "ReviewID": "R3TXRVD6FJUS07", "Overall": "1.0", "Content": "terrible camera which cost me plenty because i had to pay postage to return the thing.  totally screwed.  thanks for asking.", "Date": "November 5, 2006"}, {"Title": "Don't buy this camera!", "Author": "Kate in Chicago", "ReviewID": "R3P8ADU7JODBNE", "Overall": "1.0", "Content": "I'm all for buying inexpensive cameras.  I know I'm no Ansel Adams, I just wanted a camera to bum around with.  One small problem, though.  You can't see through the screen to take a picture!  My photographer brother even tried to adjust it and he could do nothing to remedy the situation.  Don't buy this camera!", "Date": "January 19, 2006"}, {"Title": "SUUUUUUUUUUUUUUUUUKY!", "Author": null, "ReviewID": "R3PHVR56MGK1SY", "Overall": "1.0", "Content": "This camera was sooooooooooooooooo crappy! The pictures only look good if it is poop! You should buy one!", "Date": "March 12, 2006"}, {"Title": "Let me read reviews", "Author": null, "ReviewID": "R3HMIQ879URW3C", "Overall": "5.0", "Content": "I just bought the camera. I want to read the review that's already here. Can't seem to be able to do so.", "Date": "November 25, 2005"}], "ProductInfo": {"Price": "Unavailable", "Features": "3.2 megapixel resolution for fine image capture\n1.5\" Bright TFT LCD preview screen\n3x digital zoom\n8MB built-in memory with SD card expansion slot\nIncludes rechargeable batteries and docking station/charger", "Name": "Polaroid iZone 300 3.2MP Slim Design Digital Camera", "ImgURL": "http://ecx.images-amazon.com/images/I/41rDsYoymbL._SX300_.jpg", "ProductID": "B000ATD7XS"}}