{"Reviews": [{"Title": "A best buy", "Author": null, "ReviewID": "R38HZFS4CJ3XE9", "Overall": "5.0", "Content": "This digital camara is a very nice camara.  You can take photos and videos with this camara.  This camara comes with a program for your computer to load photos and videos from your camara to your computer. You can take photos by looking in the viewfinder or the screen. Looking at the screen to take photos is more fun, but I get better photos with the viewfinder and the screen uses more power.The camera came with Kodak batteries, but I would recommend rechargeable Energizer AA batteries with a charger ($1$$) because they can last up to 205 photos before you need to recharge the batteries.The Kodak batteries only last about 140 photos before you need to BUY more batteries.The camera comes with 8MB internal memory and a memory card slot.  You can also buy memory card for the camera 16MB,32MB,64MB,128MB and 256MB memory cards.The internal memory is if you plan on taking 9 photos in the best photo quality with the best (3.2) setting you can take 10 photos before the memory is full.The better photo quality can take about 18 photos before the memory is full and the good setting can take 30 photos before the memory is full.You can also turn the flash on and off, a 10 second timer for the shutter, you can change from color to black & white or sepia.Overall this is a very nice digital camera.", "Date": "September 11, 2003"}, {"Title": "For $75, it beats the Vivitar", "Author": "Cassandra \"The Seer\"", "ReviewID": "R1YE60FVIA4S15", "Overall": "4.0", "Content": "Situation: Camera for precocious 5 year oldExperience: Kodak, Fuji, Nikon & Canon digicams ($300-$1+k range)Rating Justification: It's interesting how some folks will take a $2 knife an attempt to perform precision brain surgery with it.  That's a humorous way of saying this camera - at $75 sale price - is a great introduction to digital photography.  Kodak has produced at least 3 top-flight consumer/prosumer cameras and is known for the quality of their image and color capture software (see various camera reviews on [...] & imaging-resource.com).  Kodak also makes some serious digital equipment for top-flight professional photographers (DCS-1, I think).  So anyone implying that Kodak doesn't understand digital photography isn't providing the whole story.This camera follows a time-honored, age-old Kodak tradition to get the non-techie into cameras as cheaply and easily as possible.  Thus the Easyshare line, a line of cameras designed to make going from image to memory book as easy as possible.This camera is an ENTRY level camera in the Easyshare line.  The camera is the digital equivalent of Kodak's old Instamatic - that single-focus, 1 film-speed mainstay of KodaColor glory. The CX6200 is small, simple and shoots what it's pointed at.  It takes reasonable pictures w/the color Kodak is famous for.  And it does this for about $0.30-.70 per 4x6 print with a cheap printer.  If you are looking for a take-it-anywhere camera that lets you see what you've just captured, stores 75-150 pics and won't cause tears if it's dropped/lost, this will work.Problems?  Sure - it doesn't zoom, can't adjust exposure and could break its plastic case if it's dropped. It also isn't a good camera to \"learn\" photography on (not enough features).  But for some consumers, it's the right tool for the job.  [NOTE: I would suggest this camera to those already using SD/MMC somewhere in the household; just pass down the smaller-sized flash memory to whoever in the family gets this camera.  I would also ALWAYS recommend a memory card reader over installing the software.  I just don't like software I don't otherwise need cluttering up my computer.]Like any inexpensive item, there are many things it doesn't do.  But as an entry-level, memory-capturing scrapbook filler, most users will be satisfied.  Consider this a cheap intro that should provide results and pleasure at not-too-great a price. Are there other choices?  Always.  Be a wise consumer. Tired of shopping?  You could DEFINITELY do worse than this camera as a beginner.Make up your own mind - check those web sites out.And I'm buying one TONIGHT for my 5 year-old.....", "Date": "November 28, 2004"}, {"Title": "Great camera for kids", "Author": "L. Frary", "ReviewID": "R2TBVHYEKJBI5A", "Overall": "4.0", "Content": "I would recommend this camera to anyone who needs/wants a camera that is really easy to use.  We purchased this camera for my 10 year old son 4 months ago as an alternative to a disposible camera.  He was able to use the camera immediately with very little assistance and has taken hundreds of pictures since. He loves viewing the pictures immediately to determine if it is a good picture or not.  The picture quality is very good (equal to our Nikon 800.)  The battery life is also very good, but you will probably want to invest in rechargeables. If you can live without zoom capability and want a simple; reliable and low cost camera that takes good pictures, the Kodak 6200 is an excellent choice. Note: Ecost is a good site to get inexpensive memory.", "Date": "October 24, 2004"}, {"Title": "Good simple inexpensive camera", "Author": "Grejam", "ReviewID": "R2HJTEF0XOBSCI", "Overall": "4.0", "Content": "I was looking for a digital camera for my almost 12 year old.I've had digital cameras for years, and expected to find something simple, like an older model I had. Very hard to find!  Only other simple models I was finding were strange brands I never heard of (and suspected wouldn't last long).My alternative was a film camera - I don't want to get into thecost or hassle of getting film developed any more.So far, quite happy with this simple little camera.  2M is quite large enough for what he'll use it for.  Tonight, he was photographing the sunday comics...  8-)", "Date": "November 15, 2004"}, {"Title": "Fun little camera.", "Author": "Joshua Kenney", "ReviewID": "R1XQJGGNUOCBCH", "Overall": "5.0", "Content": "For a hundred bucks you can't beat this little camera.  It's up and running within minutes of leaving the box, and setting it up to transfer the pictures to a computer was very simple (in fact, user error was the only misstep in the entire process; make sure those cables are snug...).The picture quality was surprisingly high, which is a nice bonus.My only quibble is the internal memory isn't very roomy (8 pictures on \"Best\" quality, 30 on \"Good,\" which is the lowest).  But, media cards are getting quite cheap nowadays, and since I planned on purchasing one anyway, it's not that big of a deal (the 128 MB card will hold 149/595 respectively).Overall it's a nice beginner digital camera -- enough options to take good pictures, not so much that they'll overwhelm the user.", "Date": "December 31, 2003"}, {"Title": "two camera for two teens for Christmas", "Author": null, "ReviewID": "R2BB6PTIOZ5K5V", "Overall": "5.0", "Content": "I wanted to purchase a digital camera for  my daughters ages 15 and 17.  It needed to be simple enough to use with a short learning curve on the software and cheap enough to buy that I wouldn't mind them taking it everywhere or be upset when the day comes that it is lost or broken.  I read all the reviews on this site and they were SOOOOOOOOO helpful.  I decided on this camera based on that information...bought some insightful accesories also mentioned in the user reviews and packed them up upon arrival for Christmas morning.The cameras were a huge hit.  They were wonderful.  Without reading the directions the girls had taken pictures, e-mailed them to friends, edited out the red-eye, made movies, screensavers, slide shows, and used up the extra batteries (I need to buy the rechargeables...do it right away.!!!)all this activity in under 24 hours.  Since the kids will not be printing out any or many pictures the 2mega pixel camera is just fine.  I am satisfied that we will  never have to wait to see their photos, pay for film, wait for developing and labor over photo albums ever again.We are very happy with the camera.  Thanks to all who reviewed this before me...it made all the difference.", "Date": "December 27, 2003"}, {"Title": "For the price, you just cannot be this digi-cam", "Author": "M. Ha \"absolute584\"", "ReviewID": "RG9MEEZSDE14R", "Overall": "5.0", "Content": "1st off, price.  This camera is less than $100 bucks for 2-megapixels.  Is 2MP enough you may ask?  Yes.  At least for the avg. joe that wants to take pictures to store on his computer or for fun.  I've used this for the past 2 weeks and I love it.  My brother can't stop asking me to borrow it.  The picture quality is great.  It takes pictures at 1600x1200 (I think this is 8x10).  I don't really plan on printing any but the usual 5x7 or 4x6 will come out just fine.  The video quality however is mediocore.  What do you expect from a cheap camera, the best of both worlds?  Nope, I bought this primarily for the camera feature and it works wonders.  I have a digi-camcorder for my videos anyways.  One other thing is I didn't like the fact that it doesn't have a lens cover.  I'm afraid to scratch it but I keep it in a case.  I know Logitech came out with a cool wallet digi-cam but it's 1.3MP and it's around 70-100 bucks.  I'll take the 2MP.  This camera is very simple to use as I learned all the features within 5 minutes.  I'd recommend this camera for the simple enthusiast!", "Date": "December 15, 2003"}, {"Title": "Great Camera...Poor Software", "Author": "J. Kaas", "ReviewID": "R1E3167MYCIX8G", "Overall": "4.0", "Content": "This is a good camera, simple to use. Easy to use menu, easy to use camera. I was able to take all kinds of pictures without using the cd manual. Problems with the Easy-share software...it won't work. I would recommend, especially if using XP, to just go to the website and download the driver only, not the easy share software. Use other ways of pulling the pictures off the camera, it should show up as an extra drive. Don't even use the cd, but be sure to download the drivers first. It is easy to use, and fun too. The screen works great and the camera is a good size.", "Date": "April 26, 2004"}, {"Title": "Great camera for the price", "Author": null, "ReviewID": "R36N9FWJ4B88S0", "Overall": "5.0", "Content": "This is my first digital camera and at $100, I figured at that price it was worth trying.  It is well worth the price, the camera takes good pictures overall.  It takes excellent pictures if the lighting is good, but gets pretty grainy on indoor shots if the lighting is not great.  All the outdoor shots I have taken have come out excellent and require little to no color correcting.  The camera has a video option with no sound, and you can record video up to your amount of memory.  If you use the LCD review screen often, it will eat up the batteries quick.  Using the viewfinder to take photos will help battery life significantly.  The camera has no optical zoom and I found pictures using the digital zoom to be quite grainy, so I don't use it for the most part.  The camera also doesn't have a lens cover, which would be a nice thing to have been added to the camera.As another reviewer said, if you have Windows 2000 with SP4, you might run into problems with the Easy Share software.  I had trouble installing the software on 2 different machines.  Just make sure to get the newest software from the website (version 3.2 at time of this review).  Also, make sure you are logged in as Administrator, I had problems installing the software logged in with an account with administrator priveledges.Overall, if you are looking for a basic point and shoot digital camera that takes good pictures, it is well worth the money.  I have tremendously enjoyed the camera.", "Date": "December 14, 2003"}, {"Title": "Great value for money, but with \"hidden\" costs...", "Author": "TTV \"TTV\"", "ReviewID": "R382WIG3VMTL79", "Overall": "4.0", "Content": "This review is written from a value-for-money perspective. It's surprising what you get for such a low price. One of the good point of this camera is that it's also quite suitable for night photography (a tripod is needed though). Just simply turn off the flash, put it on a stable platform and adjust the exposure time upwards to +2 (in the menu settings). You can capture the ambience and dynamics of the city at night (illuminated buildings and streets, traffic etc.) or even firework with this. The results & colors are surprisingly good (a flash would ruin such nightscenes). To the contrary to some of the reviewers wrote, you can turn off the flash for the entire session, so it's not disabled for one photo only. The flash would go back to its default status (\"on\") when you turn off the camera. However, the camera comes with \"hidden\" costs in that you will have to buy rechargeable batteries and memory cards.Pros: easy to use, good color balance, adjustable exposure time, basic but good functionalities (for the price), acceptable video quality considering the priceCons: no protection for lens, digital zoom is a bit disappointing, no built-in rechargeable batteries, internal memory is very low (only 8MB), LCD screen is small, the sofware is indeed full of spyware (as a previous reviewer had wisely noted)", "Date": "January 26, 2004"}, {"Title": "Great camera, ROTTEN software", "Author": null, "ReviewID": "R31ZE8QG21ZIO0", "Overall": "4.0", "Content": "The most important thing first:  DO NOT, under any circumstances, install the Kodak Easyshare software CD which comes with this camera.If you have newer versions of Windows, including XP, you don't need to install the software in order to download the pics from camera to the computer.  The computer will automatically download them.  What will the Easyshare CD install?  Some of the crappiest photo-management software I've seen, a bunch of programs which constantly connect to Kodak's web site, and a bunch of spyware which Lavasoft's Ad-Aware 6.0 discovered.You can get rid of the spyware with Ad-Aware, but merely uninstalling the Easyshare software won't remove everything.  I still have a Kodak CCS process running, despite numerous attempts to get rid of it.Ignoring the software, this is one of the easiest digital cameras you will ever use.I've had several digital cameras since the late 90s and this is the best 2 megapixel camera I've had.  The menu is fairly intuitive.  Battery consumption, if you use NIMH rechargables, is reasonable.Picture quality is very good, especially outdoors.  Indoors, the pics occasionally suffer from a weaker-than-it-should-be flash, but they're still quite good.  Red-eye, an occasional problem with using a regular flash is very rare.  There is a red-eye flash option if you need it.The price, less than $100, is excellent value.If you're looking for a semi-decent 2 megapixel camera, this is it - just don't install the crappy software.", "Date": "February 14, 2004"}, {"Title": "A great beginning", "Author": "Anthony D Ravenscroft", "ReviewID": "RW02VSMID6MXE", "Overall": "5.0", "Content": "I've been a lousy (but dedicated) photo hobbyist for more than 30 years. Highly complicated cameras are great... but I always find myself doing most work on point-&-shoot cameras. Last year, when my 1960s-era Fuji started to fall apart, I spent $20 on a Fuji Smart Shot 35mm.I was all set to drop $400 on a digital camera, so that I could finally move into the 1990s, as well as post & send photos without having to scan them. I got overwhelmed by all the questions, though: how many mp? what memory format? how much zoom? optical or electronic? movies? audio?I was all set to give up the hunt & stick with 35mm, then I was buying office supplies & the CX6200 was on sale.Sure, hardly top-of-the-line. Sorta fragile... like my Fuji.My biggest -- & so far only -- gripe is that the Kodak doesn't have any sort of lens cover. I mean, come *on*, people, a camera that can't even take a rubber lens cap???In all, if it only lasts a year, I figure the 6200 is a good investment. Between buying film & having it developed, I spend at least $80 a year, only to discard more than half the photos as necessary waste in getting what I want. It's a good camera for point-&-shoot use, yet also gives me a little flexibility as far as image quality, & the redeye-reduction feature has thus far been perfect.Accessorize!! I'd recommend that you get a decent memory card (the 64mb seems to strike a nice balance for me between cost & storage), a NiMH battery kit (or a Kodak dock if you find a good price), & a $10 case. The Kodak software has its minuses, but I'd say to skip the cutesy bells&whistles, just buy an inexpensive USB reader.", "Date": "April 3, 2004"}, {"Title": "A great camera for under $100.", "Author": "Amazon Customer \"reallycheap1\"", "ReviewID": "RF1DTPMK3XZZ4", "Overall": "5.0", "Content": "I originally bought this as an inexpensive digital camera for my 12 year old for xmas.  And boy was I immediately impressed with it. The quality of the picture was excellent; had a nice zoom capability; the viewing screen was very user friendly and intuitive; and it was very, very simple to shoot and operate.  Then came the true test: whether I could download pictures to my PC.  And to my amazement, it was surprisingly simple and wonderfully packed with great features.  Loading an accompanying CD program was simple and rebooting my PC with Windows 98 easily loaded the driver for my USB connection.  With the USB cable that comes with the camera, I connected it to the PC, and simply told the easy to follow menu to grab the pictures. After that it was very easy to organize and edit the pictures, including Kodak's red eye elimination feature.  Emailing the pictures was a snap, sending pictures in a nice 3x4 size to the recipient.  I was so impressed with the ease of operation and quality at this price that I had to write this review, something I generally wouldn't bother with.  Compared with my girlfriend's $400 Minolta digital camera, the decision to buy this should be a \"no brainer.\"", "Date": "December 30, 2003"}, {"Title": "Great Little Camera", "Author": "Antonio C. S. Rezende", "ReviewID": "R2XR4PXOXOWWM4", "Overall": "4.0", "Content": "I really liked the camera, small, easy to use and afordable, but for the price,  I would buy the Easyshare 6230, that cames with optical zoom, records movies with sound and have more memory(16mb instead of 8mb).The only complaints I have for the camera are that it doesn't record movies with sound, doesnt't have a protection for the lens and the back lcd is too dark in dark places, making you have to guess where are the things you want to take the picture.But for the price, it is a great camera...", "Date": "May 25, 2004"}, {"Title": "Thank you, Santa!", "Author": "Irina Iacobescu", "ReviewID": "R1D2L6TUNAB1RY", "Overall": "4.0", "Content": "Santa Claus was very inspired to give me this present!I enjoy a lot taking pictures, but I am not a pro and I often feel uncomfotable with high-tech devices. This camera is perfect for someone wishing to take simple pictures and make short length movies with an easy to use camera.Even if has only 2.0 mega pixels, the quality of the pictures is very good and so are the colors. Transfering pictures into the computer is very simple and the camera is so small and light, that it fits into a pocket.Just make sure you buy good batteries and an extra memory, so that you won't have to transfer the pictures too often to your computer. I promise you will have a lot of fun.", "Date": "January 12, 2004"}, {"Title": "Great Beginner or Kid's Camera", "Author": "Jules \"Scrapbooker\"", "ReviewID": "R3FL50UOTUQG9B", "Overall": "3.0", "Content": "Purchased this for my daughter and niece both under 12.  This is a very easy to use no frills camera at a great price.  If you are looking to replace your camera with a new digital camera - I would shop around.  I prefer Canon.  However, if price is an issue and ease of use - this is a great little camera.  Pictures turned out better than I anticipated with only 2.0.", "Date": "September 29, 2004"}, {"Title": "If you have Win2K, stay away!", "Author": "airfirehorse", "ReviewID": "RTQRUXYO9E4AQ", "Overall": "3.0", "Content": "This camera is more than adequate for the price range. I had to return it, however, because i have Win2K with SP4. Apparently, the software does not work with this service pack. I then tried to access the updated software on the website. After about a half an hour i finally downloaded EasyShare 3.2 (the problem i have is documented on Kodak's site). This version gave me a different error. I asked Kodak for help via e-mail (which, incidentally, they try to hide on their site along with separate drivers). Their e-mail said contact within 24 hours, they never got back to me until i called an 800 number. Bad customer service, rude person on the phone, not worth my trouble. I have never had software from a new product just refuse to install until this camera software.If you don't have Win2K with SP4 and need a handy, little camera with enough features and ability for most picture-taking, i think it's a decent camera. If you have any problems whatsoever, return the camera immediately instead of trying to get it to work.", "Date": "November 8, 2003"}, {"Title": "Pretty good", "Author": "D. Lopez", "ReviewID": "R249NHDL1B5YK", "Overall": "4.0", "Content": "For a 2.0 megapixel camera, it takes clear pictures. I don't understand why people want higher pixels, unless your a pro and its your job then you get higher pixels but just for fun and personal use, this camera does its job.", "Date": "September 9, 2004"}, {"Title": "Great Little Point and Shoot Digital Camera", "Author": null, "ReviewID": "R1CNBH1BZ5SA1G", "Overall": "5.0", "Content": "This is a great litle point and shoot camera. Perfect for a beginner digital camera. The only thing missing is an opitcal zoom but if you want that it's only fifty bucks more for the CX6230 (Also a great little cheap camera).", "Date": "December 25, 2003"}, {"Title": "may as well spend a little more and get something reliable", "Author": "olive", "ReviewID": "R1MQ9CDVXIYFHD", "Overall": "3.0", "Content": "i was perfectly happy with this camera for the first six months i had it. i probably took 600 pictures and had no complaints except that i ended up spending $80 more for a memory card so i could take a reasonable (more than 15) amount of photos (necessary for travelling or even taking it out of the house really). so all told i spent $180 on it and had no trouble until... the shutter started sticking and now it's either stuck shut so the view is black and i can hear it isn't clicking or (after a firm bang on the table) it takes a photo but seems to have no control over how long the shutter stays open, resulting in grainy/blurry/artsy type photos of extremely unpredictable quality. very frustrating at only six months old and after i took perfect care of it... i'm investigating how to get it serviced but that's a pain in the ass. i'm wishing i just spent the extra money to get a better quality camera with a reasonable amount of storage that would not be so tempermental and unreliable at this point.", "Date": "August 30, 2004"}, {"Title": "Compare the 6230", "Author": null, "ReviewID": "R2JADLHW932K8O", "Overall": "4.0", "Content": "I came to this one because (a) I refuse to pay many times more for digital, and (b) I like the review & delete buttons on the back, instead of having to use a menu to delete.By now the 6200 and 6320 models cost about the same (close to US$100), but the 6230 has 16Mb internal where the 6200 has 8Mb, and the 6230 also allows much closer-up pictures (special mode); so there's no reason to buy this one anymore.", "Date": "July 18, 2004"}, {"Title": "Good Camera", "Author": "Llewellyn L. Ifill", "ReviewID": "RY1WG9KFNHC8K", "Overall": "5.0", "Content": "I have always been interested in photography and like to experiment. I have a small camera which fits in the palm of my hand and wanted to get something bigger and inexpensive. Since I am a regular shopper at Amazon, I decided that there is where I would go to look for a camera. On receiving the Kodak Easyshare 6200, I immediately started to experiment. The Camera is very easy to use and takes great pictures. The software is also very user friendly as long as you can get it installed on your system. (I had problems at first. I have shown the camera to some of my friends and very soon they too will be ordering the Kodak Camera.P.S I hope that Amazon can start shipping directly to Barbados. In that way many more orders would become a reality.Llewellyn IfillBarbados", "Date": "July 7, 2004"}, {"Title": "Great camera, good quality photos", "Author": "ClaireBeth \"ClaireBeth\"", "ReviewID": "R1V01D87H001QT", "Overall": "5.0", "Content": "I purchased two of these for Christmas.  I kept one for myself and gave one to my son and daughter-in-law.  We are all enjoying this cool camera and having fun sharing pictures via email.  It is simple to use and I was impressed with the picture quality.  For the money this is a really good camera.", "Date": "January 2, 2004"}, {"Title": "A Great Camera!", "Author": null, "ReviewID": "R2ADDN7K3LTIMH", "Overall": "5.0", "Content": "I got this camera for Christmas last year and it is the best!  It's pictures turn out like they would on a 4.0 mgapixel camera!  They took one great camera and simplified it to make it really easy to use.  The editing software is ok, but the great deal about it is it is user friendly and you can upgrade youre software for free!  I got amazing pictures of my trip to Arizona with it.  If you want a great camera get this one!", "Date": "May 12, 2004"}, {"Title": "WW", "Author": null, "ReviewID": "R1ARNWXF53RTXX", "Overall": "5.0", "Content": "A fun, easy to use camera.  Docking station might be useful but I had no problem hooking this up straight to my computer's USB port (Windows XP).  You can pay a little less and get a lot less camera.  Picture quality with 2MP is very good on a PC, and we got nice 4\" X 6\" prints after uploading to an on-line printing source.", "Date": "January 11, 2004"}, {"Title": "It's so good!", "Author": null, "ReviewID": "R1S51QT8LF0ONM", "Overall": "4.0", "Content": "I got this camra from Santa and I was so excited!  If you are a beginner at taking pictures this is the camra for you!  It is sooooooooooooo user friendly.  My only complaint is that there is no falsh on video.  If you want a great digetal camra get this!", "Date": "January 5, 2004"}, {"Title": "Not high quality but good", "Author": "Mary", "ReviewID": "R3KBJVPLX2J5ZT", "Overall": "4.0", "Content": "We've enjoyed our EasyShare camera and have already taken hundreds of pictures. The pictures aren't high quality but do look good on the computer and in small prints. For the money it is worth it.", "Date": "November 16, 2003"}, {"Title": "Kodak EasyShare", "Author": "Patricia Hayden", "ReviewID": "R2F6W6UUEUK6XG", "Overall": "4.0", "Content": "I have enjoyed using. Instructions are easy to follow and accurate. Product works to my satisfaction.", "Date": "September 21, 2005"}, {"Title": "Kodak CX6200", "Author": "\"bamamommy2001\"", "ReviewID": "R2R1DOCNXAU31B", "Overall": "5.0", "Content": "This is my first digital camera. It is easy to use and very affordable. I highly rate this camera for anyone. My 6 year old daughter even uses it for scrapbooking, it is that simple and the quality of pictures it takes is excellent. My daughter loves the black and white pictures while I love the color pictures and it is very simple to switch the mode to your choice.", "Date": "December 30, 2003"}, {"Title": "I love this camera", "Author": null, "ReviewID": "ROXUUNJQ6JAJA", "Overall": "4.0", "Content": "This camera is perfect for a beginner digital camera user.  I have taken over 40 pictures and 3 videos and still have life left on the original batteries ( as long as you do what the book says on how to prolong battery life).  I am so happy with this camera and would recommend it to anyone.", "Date": "January 11, 2004"}, {"Title": "Easy to use and good picture", "Author": "F. Scott", "ReviewID": "RPJSY9UXOHKZX", "Overall": "5.0", "Content": "I bought this camera for my mother. She is a beginner in using digital cameras. This camera was perfect for her. It's easy to use and the picture quality is surprisingly good for 2MP. This was definitely a good buy. It is the best camera at the best price for beginners.", "Date": "December 24, 2004"}, {"Title": "Died 3 days later....", "Author": null, "ReviewID": "R3V03XU3UP9O5I", "Overall": "2.0", "Content": "Took some great Christmas pictures, great zoom and clarity but the whole thing broke before New years 2004! I didn't drop it or anything... even put new batteries... so its off to the manufacturer... be careful with this one!", "Date": "January 4, 2004"}, {"Title": "Camera", "Author": "Tzuria", "ReviewID": "R1FFVK5V70E0DX", "Overall": "5.0", "Content": "This was a great camera, easy to use and the flash was just bright enough my dog didn't shut her eyes when I went to take a picture, however I think it's been discontinued, they now have something a \"little bit better\" because after I lost this gem, I went to buy the same model, but it wasn't available.", "Date": "March 22, 2013"}, {"Title": "I Loved this Camera", "Author": "C. Hrubiec", "ReviewID": "RX1UR219LEPMO", "Overall": "4.0", "Content": "I had this camera for about two years and my brother lost it on me. It was a really good camera and took me a year to figure out how to use digital zoom (left and right arrows) but anyway i loved this camera. Took outstanding pictures.", "Date": "January 18, 2007"}, {"Title": "I got my money's worth, I guess", "Author": "Armanda H. Pruitt \"Book Addict :-)\"", "ReviewID": "R33ZZ06MOTFIK5", "Overall": "3.0", "Content": "IMHO, this was a pretty good camera for the time I've had it. The photos came out adequately clear.The only complaints I have are:1. it takes a long time between shots, which is really not a huge deal since I didn't miss too too many shots2. the picture quality becomes really blurry when you zoom in after a certain point (to get a bigger and better quality picture I just crop during editing)3. the screen goes black in low light where you have to guess and shoot4. it goes through batteries very quickly5. moving photos become a blurry mess in night scene mode6. after a while (about a year), the camera just would not come on at all unless I kept turning it off and on until it finally came on7. the flash causes the pictures to look grainy in low lightOverall, the camera wasn't terrible and I adjusted to its setbacks (e.g., carrying a lot of batteries, keeping the camera on, turning the flash off, etc.). I managed to get a lot of good shots in spite of.", "Date": "December 18, 2006"}, {"Title": "Best used as a kid's camera", "Author": "Digital Enthusiast", "ReviewID": "R11YBWBB9OGG5J", "Overall": "2.0", "Content": "Bought this as a gift for my parents.  Was disappointed as soon as I got the camera in my hands.1) Very 'cheap' feel to it.  Lightweight plastic body.2) Preview screen has very low resolution.  I found the LCD screen to be difficult to use because of the low quality3) FIXED FOCUS.  I completely missed that this camera has no optical zoom or auto-focus.  Thus, every picture you take with the dig. zoom is bound to be fuzzy.The only plus I found is very easy-to-use controls.", "Date": "December 29, 2004"}, {"Title": "Poor performer- images, batteries, etc.  & overpriced", "Author": "JAB \"JAB\"", "ReviewID": "R14MYY2UELF6R7", "Overall": "1.0", "Content": "This camera takes images with great color HOWEVER, the images are perhaps the WORST of any 2MP camera.  They are grainy, noisy, poorly compressed (large files but poor quality).  This camera also uses up 2-AA Batteries within about 35 shots- not good!Look elsewhere for a camera.", "Date": "December 17, 2004"}, {"Title": "Not as good as the CX4200 was.", "Author": "E. Lundin \"eal5b\"", "ReviewID": "R3BQTPWC1QTISZ", "Overall": "3.0", "Content": "I used to own Kodak's previous 2MP digital camera, the CX4200 (only available used now).  I bought a CX6200 thinking I could get the same 2MP quality AND video capability for an even better price.Unfortunately, while the CX6200 takes good photos, they just aren't as crisp as the 4200's.  The CX6200 doesn't have a real lens cap, to begin with.  It only has a clear piece of plastic covering the lens, and this cover cannot be removed or replaced.  ....Which means 1) photo quality suffers because of the filtering effect of this plastic and 2) if the cover is scratched or discolored, you can say bye-bye to picture quality.  In picture comparisons, the 6200's photos seem to have more \"noise\" than the 4200's pics.The 6200 apparently does not have an auto-focus lens, and it shows.The 6200 also does not have the incredible close-up-photo ability that the 4200 had.  The 6200 takes decent close-ups, but once you get closer than 18 inches from the object it starts to get a little blurry.Video Quality: Really grainy.  I wasn't expecting much, but this was about the minimum I was hoping for.  There is all kinds of noise (by noise I mean red/green/blue-ish pixels the camera inserts to fill in picture information), the video is in barely compressed QuickTime format, and the maximum video length is 30 seconds no matter what size memory card you have installed.  Oh, and there's no sound.  Even without sound and with such mediocre quality, a 30-second clip will cost you over 7MB.  This capability is only good for very casual clips in perfect conditions.Those are most of the Cons.  PROS:- Pretty good battery life--at least as good as the 4200 (using 1800mah NiMH).  As with all digital cameras, you MUST buy rechargeables.  Good battery life in video mode as well.- The camera is just slightly smaller than the 4200, thanks to the rounded corners, and is very portable (but it may be a bit heavy).- The LCD is as bright as advertised.  Definitely an outdoor display.- The directional buttons are separate buttons, unlike the 4200's pad, which was clumsy to use.- The pictures are good quality, sufficient for basic photo taking.  Colors are pretty good and it adapts well to changes in light.- The camera allows you to take photos in black and white, and sepia, as well as true color.- In addition to Good, Better, and Best quality settings, you can take wide photos at 3:2.It's not a bad machine, but you're definitely only getting what you pay for.", "Date": "January 29, 2004"}, {"Title": "Good photos/digital movies, BAD computer connection", "Author": null, "ReviewID": "R1AHWGKTK5IKRB", "Overall": "3.0", "Content": "The photos this camera takes are of high quality, and I would probably rate them as a 5. For the movies I would probably give a 4 because although the images are good there's no sound. But the REAL problem with the camera is the software that is given to you (the Kodak Easyshare program.) I would probably give the computer connection a 1. The whole point of the camera is to put all of the photos/movies onto the computer. Whenever the camera is full of photos and movies and is hooked up to an IMac and turned on, the Kodak file opens up but it always says \"no pictures on device\". Then if you go to Iphoto, it'll let you transfer the photos, but not the movies, which means the movies have nowhere to go. So the only way to get all of your photos onto the Kodak system is by importing them in from Iphoto. Every once in the while the Kodak transfer system works ONCE, and then stops working, so the way in which the transfer system works is pretty random. Even though the software stinks, if you are willing to deal with it for good photos, then you should buy it.", "Date": "March 20, 2004"}, {"Title": "Great camera for the price", "Author": "W. Alsing \"cozaar\"", "ReviewID": "R3QYC9LX9CISY0", "Overall": "4.0", "Content": "I wanted a decent digital camera to keep in the car for a minimum cost and this one is the best buy I found. It is simple, takes good pictures, fits in a pocket and has some features that make it a pleasure to use. For Macintosh OS X users, if you download version 3 of the EasyShare software from Kodak's web site it is as good or better than Apple's iPhoto software and interfaces with the camera in unique ways. I am very happy with it, but highly recommend buying rechargeable batteries or buying Kodak's dock which comes with rechargeable batteries.", "Date": "January 3, 2004"}, {"Title": "Superior Camera", "Author": null, "ReviewID": "RJR1I8W95M3R2", "Overall": "4.0", "Content": "Pros: Super quality Best flash Advanced Software Email compatable Super battery life (except for the one it comes with) Strong Lightweight LCD Display Automatically emails when transferred Organized Bells and whistles Video option (if you have a Secure Digital Card) Wonderful camera lens Cons: Flimsy battery door Pictures are a bit darker than wanted (it can be fixed) Zoom only works with viewfinder (which drains battery) Triggers on when you do not want it to And worst of all, the batteries it comes with are intended to be used while you immediately run out of the house to get the batteries it needs. Suggestions: You do not need a Camera Dock. Best batteries are AA NiMH rechargeable batteries Do not leave it on overnight by accident or whatever Get at a 256 MB (or at least a 128 MB) Secure Digital Card if you want any videos Kodak Accessories are a bit pricey, so get the cheaper ones that work better. The one thing that irritates me the most is they jacked down the price right after I bought it (and it was previously the cheapest 2.1 MP camera besides Aiptek which works horribly). Fortunately, I can get my money back since it was only two weeks! I am 90% sure.", "Date": "October 26, 2003"}, {"Title": "nice", "Author": "caleb", "ReviewID": "R2G5GQHOLUQTZS", "Overall": "4.0", "Content": "boughtthis cam for my girl,  works fine i guess... no bells no whistles, but 2 be real this take great pics for 2 mega pixels", "Date": "October 6, 2004"}, {"Title": "Good camera", "Author": "Eric Malsack \"Eric M.\"", "ReviewID": "R10SKL3OK1U0NK", "Overall": "5.0", "Content": "Great Camera.  This is my first digital camera and I'm quite amazing how good it is for $80. Clear pictures and quick flash.  Took a picture of my CPU fan running at 3000 RPM and the picture looked like it wasnt even moving. Just wish it had more internal memory.", "Date": "September 13, 2004"}, {"Title": "Cheap, Simple, Camera", "Author": null, "ReviewID": "R146RTIA5BWPT9", "Overall": "4.0", "Content": "I got this camera in December and I am very satisfied with it.  It's my first digital camera and I would definitely recommend it for anyone who is inexperienced using them.  It has very few options so there's not a whole lot you can do to mess up.  The only reason why I deducted a star was because the batteries don't last very long (and aren't rechargeable); and because when taking pictures on their best quality setting the camera will only hold about eight.  However, for what you pay for it, the Kodak Easy Share is definitely worth the money, and worth splurging $30 for a rechargeable battery.", "Date": "February 5, 2004"}, {"Title": "Good camera! TERRIBLE customer service!", "Author": "hillary", "ReviewID": "RBWMULA2TTTX8", "Overall": "2.0", "Content": "I had recieved a kodak camera for christmas from my father! It takes wonderful pictures! around feburary it started acting funny! after a while all the pictures would turn black. i called kodak and they told me to send it to a camera repair place in illanois! well they had told me i would have it fixed for free so I figured go a head and send it in. 2 weeks later I recieved a bill for 200.00 MORE THAN THE CAMERA COST! worse yet if i didnt want it fixed there was a 30.00 inspection fee plus 15.00 to ship it back. Well mym father called kodak and they got it figred out. 2 weeks later no camera. I call the repair shop adn they said they would look in to it and then call me within an hour! they didnt I called the next day to find out what the heck was going on with my camera and it was shipped the previous day! well today i recieved all the other stuff I sent in, but no camera! there was a note saying they were going to replace the camera. I was on hold for an HOUR!! then all they told me to do was call the repair shop! I should be reciving my camera soon and i asked why it took so long to send me a different camera, \"they had to back order it, they didn't have the parts\". What I learned. I will never but from kodak again!", "Date": "July 6, 2004"}, {"Title": "Ok", "Author": null, "ReviewID": "R3R2KQRSHQPDJ2", "Overall": "3.0", "Content": "The camera is great, but the software is really annoying. If you have network it's terrible, you basically have to call customer service in order to get the software to work anyway. But overall the camera takes good pictures, after setup and installation it's easy to e-mail pictures.", "Date": "May 9, 2004"}, {"Title": "Disappointed at best.", "Author": "Mark Goodwin \"Mark E. Goodwin\"", "ReviewID": "R1LGZE3NX8XVML", "Overall": "1.0", "Content": "okay from the beginning. The internal memory in the card allows for 8 shots. Yipee! So I have to spend $30.00 on a card. Plus $7.00 shipping. I bought this because my Olypus was back at the factory. I should have waited for the Olypus to be returned (which it has been no charge, in 3 weeks) In my opinion, the photos are terrible worse if you use the kodak software. They are dark, the camera has to \"charge\" the flash between photos, (which seems to take forever). The monitor is dark. The only good thing that came of this is a bought the camera printer dock. The can work with any digital photo on file. Beautiful shots! No more going to the store to have a print made. Oh yes before I forget. I had to buy a card reader because my computer would not \"see\" the camera while on the dock. If I plugged in the camera directly, fine it saw it. Final thoughts,my late father would always say: \"you get what you pay for.\" Wise words from years from years ago. My first olypus digital lasted 5 years. My son is in New Zealand and he is still using it sending me beautiful photos. This is a \"kiddie\" camera. I let me 6 year old use it,without fear because if it breaks we lose nothing. When you start with nothing you have nothing to lose. Heed my advice, spend some money if you want some decent photos. I would not even recommend this to a teenager because they are way smarter than us adults.  That's all from videomanmark, a amazon.com pro seller.", "Date": "July 14, 2004"}, {"Title": "Bare Bones Camera", "Author": "R. D. Hanson \"rdhanson1\"", "ReviewID": "R8FW62GO1IPUV", "Overall": "3.0", "Content": "That's what it is. If that's what you want, then buy it. Mine didn't come with the sometimes-mentioned memory card. Got it day after Thanksgiving for $80, though. Photos look great on the computer screen (Sony 15\" LCD). Haven't seen prints.Problems are:* No carrying case or lens cover* Viewfinder is off significantly from the lens. About 20% of what I photograph is out of the viewfinder.No lens cap is just cheesy. There's no excuse for the latter. Hence the 3 stars.", "Date": "January 21, 2004"}, {"Title": "Don't buy if it's going to be used for an adult", "Author": "M. De Moya", "ReviewID": "R3LTM4F0NMSWO0", "Overall": "3.0", "Content": "Its amazingly simple, but image quality is worse than the old time mavicas. So buy it for your kids, and save for something like Casio Exilim or Nikon over 4 MP.", "Date": "January 18, 2005"}, {"Title": "Super delivery. Camera works great", "Author": "KC", "ReviewID": "R1Q7XV457QIJ0B", "Overall": "5.0", "Content": "Product was delivered as promised. Quality and performance are better than expected. I recommend it.", "Date": "September 19, 2004"}, {"Title": "Money  thrown down the drain!!!", "Author": null, "ReviewID": "RRPWRE33W1BLT", "Overall": "1.0", "Content": "I received the camera for Christmas and used it twice.  After I changed the batteries in it, the camera stopped working.  I called Kodak and they said I would have to send it in for repair.  After wating for a while without a reply, I called Kodak again to find out what was going on with my camera.  They told me that water or some liquid got into it and corroded it and because of that, it would not be covered by the warantee.  The camera was never near any water as I only had the opportunity to use it twice.  Their customer service is awful and they want $130 to fix the camera.  I would rather buy a new one than give them anymore of my money.  Stay away from this camera!", "Date": "March 19, 2004"}, {"Title": "GREAT", "Author": "Kathryn Schall", "ReviewID": "R1KAYV2AOHKVT0", "Overall": "4.0", "Content": "I brought this for my son to take pics of my grand daughter and it woeks great!!!", "Date": "November 16, 2003"}, {"Title": "Good, but not what I was looking for", "Author": null, "ReviewID": "R153QJ6Q9IYYU7", "Overall": "3.0", "Content": "I bought this camera to take pictures of things I want to sell on ebay. I'm use to higher end digital cameras (Nikon 995, Olympus 4000?) and I didn't have super high expectation for this camera.Here's what impressed me about this camera:- The ease of use of this camera is incredible. I find most digital cameras extremely difficult and cumbersome, this was a snap!- The delay between taking a photo and the camera ready for the next photo was very short. There was also a very short delay between hitting the shutter button and the picture being taken.- The software (I was using the version for Mac OS X) was very smooth and useful. I think it's a bit quicker than iphoto.The disastisffaction comes with the image quality at close range (<4\"). I didn't realize there's no macro mode, so I'm unable to take detail shots of things I'm selling at close range. These close up images were extremely blurry. When I zoomed in to a graphic file using photoshop there was a lot of jpg distortion, more than I've seen on other cameras. You can adjust the image resolution (number of pixels) of the camera, but not the level of jpg encoding. I tried taking close-up photos with the flash off, in my expereiene with other cameras, this can sometimes increase image quality. All of these photos were underexposed (even when I adjusted the image exposure compensation). I think this might be because the longest shutter speed is 1/2 second.The photos I took at normal conditions seemed to be of good quality.Synopsis: Great camera interface. Good regular condition photos. Very sucky close-up photos.I'm probably going to return this camera and get a higher end 2MP camera. A good camera, but I've pushed its limits with my needs.", "Date": "January 30, 2004"}, {"Title": "Money  thrown down the drain!!!", "Author": null, "ReviewID": "R19JA5B39MJ83F", "Overall": "1.0", "Content": "I received the camera for Christmas and used it twice.  After I changed the batteries in it, the camera stopped working.  I called Kodak and they said I would have to send it in for repair.  After wating for a while without a reply, I called Kodak again to find out what was going on with my camera.  They told me that water or some liquid got into it and corroded it and because of that, it would not be covered by the warantee.  The camera was never near any water as I only had the opportunity to use it twice.  Their customer service is awful and they want $130 to fix the camera.  I would rather buy a new one than give them anymore of my money.  Stay away from this camera!", "Date": "March 19, 2004"}, {"Title": "Kodak Easyshare CX6200", "Author": null, "ReviewID": "R1SABFZ9WDXY93", "Overall": "1.0", "Content": "I bought this camera about 2 months ago n i guess i did some good filming with it and what not, but it takes huge pictures. it started off taking like 24 kb pictures and now it takes 1-2 mbs. Now screen cracked on me and that will probably cost more to replace then the camera itself. i dont really like this camera.", "Date": "March 20, 2004"}, {"Title": "kodak  cx62200", "Author": "K. Cowan", "ReviewID": "R2FVO5AIEZXGET", "Overall": "1.0", "Content": "Camera is a piece of trash. Used the camera twice and the battery cover broke in half. Should have taken the advice of my son, when he told me that Kodak had a substandard design.", "Date": "July 20, 2004"}, {"Title": "Horrible", "Author": null, "ReviewID": "R3C94MYLK1CTX0", "Overall": "1.0", "Content": "The picture quality is very bad and the camera feels cheap compared to Canon and Fuji brands. This is a camera for poor people who can't afford a good brand.  I would stick with a Japanese brand camera.", "Date": "January 7, 2004"}, {"Title": "What is love really?", "Author": "Porter \"moonlightbingerased\"", "ReviewID": "R2JZO18N4O3QHB", "Overall": "5.0", "Content": "Is it wrong to be in love with your digital camera? I can't even start to explain my deep feelings for my 'Kodak Easyshare CX6200'. Maybe it is it's sleek body and smooth design. It could be the way I feel like I'm always in charge in the relationship and it goes with me everywhere. It's not ashamed to be seen with me in public. And it never makes me look well, a little hippy in my pics I email my friends from my trip to the beach. It could be the way it looks at me with complete admiration. It never gets hostle and makes a great listener, but it does get a bit gassy around the holidays, but all the same wheter it's wrong or not it really is my soulmate.", "Date": "November 6, 2003"}], "ProductInfo": {"Price": "Unavailable", "Features": "2-megapixel sensor creates 1,600 x 1,200 images for sharp prints at sizes up to 8 x 10 inches\nCrisp, sharp pictures with a Kodak 37mm (35mm equivalent) lens\nBright 1.6-inch new indoor/outdoor display with exceptional viewing quality\n8 MB internal memory with slot for adding MMC and SD memory cards\nPowered by 2 AA batteries (alkalines included); connects with Macs and PCs via USB 1.1", "Name": "Kodak EasyShare CX6200 2MP Digital Camera", "ImgURL": "http://ecx.images-amazon.com/images/I/41MR5K48Q2L._SX300_.jpg", "ProductID": "B0000ACXZU"}}