{"Reviews": [{"Title": "Great Camera", "Author": "Gustavo Coca-Perraillon \"GCP\"", "ReviewID": "R2QN5HISZWFZY5", "Overall": "4.0", "Content": "If you are reading a review is probably because you are new on the digital camera world or you want to upgrade your camera. If the previous line is true for you, this review can be helpful for you.This is a digital camera to take pictures without worrying about the technical aspects of photography. You have plenty of scenes modes that will automatic adjust the appropriate settings for the picture, so it is an automatic digital camera, there are a few settings that you can adjust manually but those ones aren't the key ones of professional photography.Almost every Nikon's camera I used have great quality, this one is a better and more interesting model because it is from a new generation of Nikon's digital cameras, so on the Nikon's learning curve, this one of the latest state of the art consumer digital camera (September 2005).So I give you a few tips in order to help you on the decision of buying this product:1. Great photo quality, read the entire manual before and after you first shoots (Don't complaint about quality if you fail to do so). Get a tripod if you can.2. It is automatic, great for a person that only wants to get decent, great pictures and from time to time take wonderful ones without being experts on the technical world of photography; I if you find yourself falling in love with photography, take some curses and then buy a pro or an almost professional camera.3.  Great photo quality! Nikon has it! The best way to notice this fact it is looking at the \"view shared images from other users\" on the models and brands you want to choose from.  Let your eyes make the decision.4. Visit web sites where you can find information about megapixels, autofocus, composing pictures with autofocus, multi area focus, memory cards, and rechargeable batteries. You will find this information helpful on the future and on your buying decision.5. L1 has a 5x zoom lenses, a close up from 1.6 inches. This optical combo is hard to find on the market. 6.2 Megapixels, excellent definition.Cons:1. Multi Area Focus, great new feature on L1. Bad explain it on the manual. I recommend you get the default setting to Auto Focus Center and then take a tour on the internet in order to fully understand what Multi Are Focus is and how you can take advantage of this feature.2. Be aware on buying mini tripods, this digital camera has the tripod adapter on the left side of it, making the camera not well weighted; try mini tripods before buying one. You won't have problems with normal tripods.I used other brands, I keep Nikon. I hope your had find this review helpful for you.", "Date": "October 15, 2005"}, {"Title": "Beautiful Pictures, Great Camera", "Author": "missk7 \"missk7\"", "ReviewID": "R2EUE407DEC165", "Overall": "5.0", "Content": "I have had this camera for almost 6 months and have never had any complaints.  It is a really universal camera that will take beautiful pictures in a wide range of settings.I saw that some people left reviews about the camera being having blurry pictures and I have not had this issue at all, even without a tripod.  (They must have mistakenly reset some of the settings) The colors come out beautifully.  The settings are logical and easy to use, but I still recommend reading the instructions.  With this camera, and knowing how it works, you can take beautiful, professional-looking photographs.I do recommend investing in a good pair of batteries, but this is true with all digital cameras these days.  As the cameras get more powerful they need more power and I have not seen any new camera out there that you can get more than 30-40 pictures on a regular pair of alkaline batteries.  And the type of memory card you use makes a BIG difference in the time between shots, again this is true of all cameras.Overall, I will never buy another camera except Nikon.  This camera helped me capture perfectly come of the most important moments of my life and I could not be more pleased.", "Date": "April 29, 2006"}, {"Title": "excellent pictures just need to outfit it right - oh, and tough", "Author": "Scott A. Gallaher", "ReviewID": "RAPH0533GK6J1", "Overall": "5.0", "Content": "Excellent pictures, easy, intuitive interface, and a great 5X zoom that really makes the difference compared to 3X or even 3.5X are all the things I really like about this camera. There are some negative reviews on this product but I would counter with this: accept the fact that AA Lithiums are the only way to go and spring for a solid, dependable, ultra-high speed SD card and you'll be fine and happy. The LCD screen is the view finder and I have no problems with it-- I live in Phoenix and it is very, very, bright here to say the least. I have taken over 200 pictures with the camera on one set of batteries, so far, and it's been four days since I've had the camera. I use the Energizer Lithium AA's (are there any others?). For an SD card I use the SanDisk Ultra II 1 Gig (currently like $50 on Amazon) and the card is significantly faster than the Lexar I bought at Sam's. Yes, with the flash, you still have to wait-- but the faster the memory, the less you will have to wait. Without the flash, even on the 6mp + setting, it still only takes a second or two to write to the card. I like the fact that the camera has a tiny bit of bulk to it making it more \"grippy\" for my hands. Using AA's for me is great because I really hope to do a lot of travelling and hiking and I know that I can pack one pair of spare AA lithium batteris that weigh nothing and be fine for a whole week of solid picture-taking. I also know what can happen on 100 foot escparments and accidents with a $1000 digital SLR, so given the current street price, the outstanding quality of the pictures, the street price, the zoom, the street price, and the fact that I use the camera for travel, this camera was a great buy for me. Also, I think the shortcomings are manageable, in my opinion. What are they? Lithium batteries are the most expensive kind so if you plan on using the camera 24X7 365 days a year, then probably you should look at a different kind of power supply! The camera doesn't offer the sheer speed of an SLR in picture capture, so if you are going to be bouncing around in a jeep on an African safari, then you might want to go with an SLR or Nikon's P3 or P4 with \"vibration reduction.\" But for me, I bought this camera for five things: 5X digital zoom, great pictures, SD card memory-type, double AA battery power, and ease of use.-May 29th update dumped camera inside makeshift vinyl case into a fast moving creek. went running downstream after something else, then noticed my Nikon bobbing through my ankles. Picked it up, took the batteries out immediately, took the memory out, let everything dry for 48 hours, put the batteries back in..... the camera still works fine. Kids do not try this at home.", "Date": "April 10, 2006"}, {"Title": "Don't Buy This Camera", "Author": "S. Paczosa", "ReviewID": "R3S2UKWXLH33B5", "Overall": "5.0", "Content": "After a year, I've decided I hate this camera. It takes terrible pictures when there is low light. I have fiddled with all the settings and read detailed guides on how to get the best out of the settings and I have had no luck.", "Date": "January 31, 2006"}, {"Title": "Excellent for ameteurs;", "Author": "Baivab Mitra \"Save a tree, one at a time\"", "ReviewID": "R10Y0V63BY82X", "Overall": "4.0", "Content": "I am a good photographer and have participated in quite a few exhibitions/publications too. Thus, I know a bit about photography. I purchased this camera for my wife - who had the following criteria (A)Construction - solid and sturdy. Combination of plastic and metal.Lens - VERY, VERY sharp.Caveats - VERY, VERY BAD battery life + NO manual controls whatsoever.FLASH QUALITY - Good. (As expected from a P&S;)", "Date": "August 2, 2006"}, {"Title": "Great camera (Read the update)", "Author": "Soundcraft", "ReviewID": "RURJ6259HN53H", "Overall": "4.0", "Content": "I got this camera for Decembaer last year as a gift for myself, and i'm very please with what i got.the camera is very user friendly, actualy i first bought a Sony DSC-S90 but when i met at a firends home for diner at night with my wife and we took some pics, me with my Sony and my friend with his Nikon 4600, the results spoke for themselve, his photos where more bright and accurate in the same conditions than mine, and i took the same picture with both cameras, making use of the same \"ignorance / knowledge\" in this matter of digital photography and the results with the Nikon overuled the Sony. For this reason mainly i decided the next bussines day go back to the store and change the Sony for a Nikon and i bought the Coolpix L1. i have taken very nice pictures in all posible conditions, at the beach, sunsets, indoors, outdoors, at night, noon, etc and all great.read the manual in order to take the best out of this camera, but if you don't read it, still will get nice pics.the only thing i regret is the lack of a AF light, which definitly would make AF in low light easyer and faster, other than that, very niceJuly 11 2006 UPDATEAfter several month using my Nikon, i decided to change it because the time it takes to focus on most indoor conditions is too long most of the times. i looked imn the market and decided to go for Sony again but this time i bought the DSC-W50, and the change is amazing, better AF speed and accuracy, not to mentiont the better flash power in night conditions.i dislike the quiality of the Nikon's pics at night, but i'm very satisfied with the results with the DSC-W50.I cannot say the Nikon is a bad camera, but for sure there are better options for the price range.i took my time to research and went for the Sony over Samsung and equally priced Panasonics, not to mention Cannon (i was afraid with so many comments regarding some misterius lense error a lot of people complains about)If i could i'd lower the stars for this camera to 3 instead of the 4 i gave it a whyle ago.", "Date": "February 24, 2006"}, {"Title": "Great Little Camera", "Author": "rachels \"rss\"", "ReviewID": "RMZN5MJAPT2KG", "Overall": "4.0", "Content": "this camera is great. Granted, I've only had it for a week, but I still love it. sometimes it takes awhile to focus but it does fine in the end. I love all the image modes. They are very handy. the camera is smaller than it looks, but a bit on the chunky side. It looks very good. the picture quality is amazing. The zoom is awesome, one of the main reasons I bought it. Another reason to buy is the screen. it is giant and extremely bright. YOu can always change the brightness if you want it brighter. THe controls are easy and straightforward so I barely had to read the manual. On thing you should know is that it doesn't have a big or comfortable grip. Still I would definetly recomend it.", "Date": "November 26, 2005"}, {"Title": "Worthless", "Author": "Erik B. Cass", "ReviewID": "RSOPXCZ1CCPO1", "Overall": "1.0", "Content": "My first digital camera was a Nikon coolpix 3700.  I *loved* that camera.  It was fast, light, compact, very durable, and took excellent qaulity photos.  It's fatal flaw was it's custom battery is charged by a charger that is no longer in production.  Damage the charger, and the camera is pretty much useless.This camera has none of these qualities.  Being brand loyal, all the while remembering my lession from my experience above, I searched for a Nikon camera with more standard batteries, and finally settled on the L1.  What a mistake.  The camera is heavier, bulky, poorly constructed, s-l-o-w,  and the pictures it takes leave everything to be desired.Some specific complaints:- Delamination:  almost immediately, the protective coating (?) began flaking off, making it look ugly.- Eats batteries:  My original PUNY 128MB SD memory card cosistantly outlasts regular AA batteries.  And this thing is a 6 megapixel camera!  Do the math...- Slow reponse time: There is a unacceptably long delay between pressing the button and when the camera actually takes the picture... at least a second, longer with the flash.  Makes taking an action shot or pictures of kids impossible.- Slow recovery time: There is a infurating long delay between when the camera takes a picture and when the camera is ready to take another picture.  I've tried high-quality batteries, and fast memory cards, to no avail.- Inability to Focus:  I've all but given up on trying to take a photo that is in focus.  This camera takes forever to focus, and 9 times out of 10 fails to focus correctly.  I mean, this isn't rocket science...- Battery/Memory Card Access Door:  First, how stupid to put them in the same place.  If you want to change the memory stick, you end up removing power from the camera.  Bad design.  Also, the access door is held in place by a miniscule piece of plastic that (at least in my case) breaks quickly.Look elsewhere... Nikon is a good brand, but they failed with this one.  Bigtime.", "Date": "December 25, 2006"}, {"Title": "Good deal", "Author": "C. Yoon \"ChuckY\"", "ReviewID": "RAPZ9TGKRAO9M", "Overall": "5.0", "Content": "This is a great camera!  So great I decided to write a review!First of all, I have to say this is for Beginner or Intermediate photographers who want an easy to use camera.  If you're wanting a lot of flexibility such as setting fstops, shutter speed, adding lenses, etc... This camera is not for you.  This is a easy to use no thinking fun camera.Not only is it easy to use, but it has a lot of easy options when you set it in the different modes.  At first it seems intimidating as there are a lot of options, but if you play with it for awhile, you'll soon learn to mostly use a few of the many options available.  I think the picture quality is great.  This camera also has a macro mode that lets you take good close up pictures that are clear.  This camera also has a 5X zoom which is much better when compared to the average 3X zoom offered on other cameras.I've read some reviews that say this is a blurry camera, and I must say, there is some slowness in the focus, and it does not take great pictures if you turn off the flash.  But if you're willing to take mostly flash or outdoor pictures, most pictures should come out great!Unfortunately the required flash really wears down the batteries.  I reccomend picking up some rechargables, and also picking up the Nikon EH-62B AC Adapter so you can plug your camera in when reviewing pictures or transfering them to your computer.  This will save you tons on your batteries.I also love the video mode on this camera.  It looks great for a still photography digital camera.  I use to think this was a lame feature offered in order for camera makers could offer it as a feature, but when I use to see this on older cameras, it was mostly useless because the audio was bad, and the video was choppy and looked terrible, but on this camera, it looks not all that bad.  It actually looks pretty decent.  I'm definitely going to use it lots more than I ever thought I'd ever use it.  It's just so great to have a mini video camera in such a small package.  Althought if you must use this camera as a video recorder, I reccomend picking up an SD card that can write at least 20 M/Sec.  I would use the Sandisk Extreme 3 card or the ATP 150X card.  Depending on how much video you want to shoot, get a large card.  I have a 2 gig card, and it will record about 53 minutes of video at 320X240 mode.  This camera also has a 640X480 mode, but the quality is terrible in that mode and it's very choppy and films at only 15 frames/second while the other modes shoot at 30 frames/second.  I read a review trashing the video on this camera, but that reviewer seemed to want a video camera.  His complaints are valid, but this camera isn't meant to be a video camera, so I don't get why he's complaining.  This is just a bonus feature that works well IMO.In conclusion, I think this camera is a great deal for the casual photographer. The video is really fun for capturing little moments.  I wouldn't reccomend this camera for artistic or advanced photographers who want to really fine tune the controls or for people who want to shoot in low light conditions without a flash.", "Date": "October 15, 2006"}, {"Title": "This camera is awesome", "Author": "David Paulk", "ReviewID": "RC80L2OPAWRQN", "Overall": "4.0", "Content": "I bought this camera about two weeks ago, and the first place I used it was in Seattle, WA.  I read the instructions on the flight over to Seattle, and when I got there and took some pics I was amazed.  We had a perfect view of the Space Needle from our room in the hotel, so needless to say I took a few pictures of it.  The pictures turned out great, several pics I took throughout the city almost look professional.If you are considering buying this camera and are on a tight budget (like i was), definitely get it.  But, be prepared to read the instructions, buy some rechargeable batteries, and I would recommend buying a small tripod.I cannot say it enough, if you read the instructions and don't freak out when you get unsatisfactory results, then you will be VERY happy with this camera", "Date": "April 27, 2006"}, {"Title": "Great pictures but lacks viewfinder", "Author": "D. Rawlins \"MacDuff\"", "ReviewID": "RL6EX04R437N9", "Overall": "4.0", "Content": "This camera takes incredible pictures and is easy to use.  However, it lacks a viewfinder.  The only way to compose pictures is with the built-in screen.  This is OK indoors, but practically worthless outdoors.  Moderate sunshine makes it very hard to see the image before you shoot.  You'll need a hat to cover your eye AND the screen to have any success at all.But for the price- a good deal.", "Date": "April 4, 2006"}, {"Title": "Nice Form Factor, Great Quality Pictures", "Author": "Travis Illig \"Software Engineer\"", "ReviewID": "R16PM7C9Y6CD4D", "Overall": "5.0", "Content": "I got the Nikon Coolpix L1 to replace a Kodak digital camera I had was fairly large, ate batteries like popcorn and took mediocre pictures.  I am not disappointed.The L1 is a nice, compact size and works on AA batteries, which is extra cool because you can get rechargeable batteries and one of those 15 minute chargers to keep you in business.  Plus, having the AA batteries rather than an internal battery means cheap replacements and upgrades when the time comes, which is also key.The pictures it takes are really nice, far better than my last camera.  I'm a fairly entry-level point-and-shoot kind of photographer, and I'm happy with how my pictures turn out.The size of the camera is nice and makes it convenient to take with you on day trips and such.  My last camera was bulky, and form factor was key on this new purchase.  The size is just right - not too large to be inconvenient, but not so small that the preview LCD is unusable.In fact, the preview LCD is super clear and much more usable than many other cameras I looked at.  It's high enough resolution to make menus and icons very clear and the colors are reasonably vibrant.The scene assistant feature is really nice, helping you to automate the configuration of various settings (flash, exposure, etc.) based on common situations (sunset, portrait, fireworks show, party, etc.).  My favorite is the \"panorama assist,\" which helps you to line up successive shots in a panorama.  I didn't even know about that when I bought it, and it's been one of my most used features on the camera.The only real downside is there's not much in the way of automatic picture stabilization, so you really have to hold still when you're taking a picture.  It's not as bad as all that - most of my pictures turn out great - but you can tell a few are slightly blurry because I moved at the wrong moment.  If you're going to use this one a lot, you might want to look into one of those little tripods.All in all, I'm really happy with it.", "Date": "July 31, 2006"}, {"Title": "Not sure why....", "Author": "MMaclover", "ReviewID": "RQYQAZX4PQ936", "Overall": "5.0", "Content": "I am not sure why so many people dislike this camera. I am no where near an expert with cameras, and I find this one to be so much fun! It has many different settings, most of which came in handy on my last few trips. Yes, I do get blurry pictures from time to time, but being a child to two more advance photograghers, I know it is more of an issue with me than with the actual camera. I would, however, recommend rechargeable batteries and a memory card, but I have been getting by on normal batteries. Again, I don't understand people's issues with those- I get about a week to three weeks use out of the batteries.", "Date": "July 3, 2006"}, {"Title": "LOVE this camera.", "Author": "J. dean \"mom 1\"", "ReviewID": "R3NZ3UC9W14EGH", "Overall": "5.0", "Content": "I love all the things you can do with this camera. Regardless of a couple of reviews it is very user friendly, caught on right away. I looked at several cameras and this was the easiest to use and the quality is great.", "Date": "February 5, 2006"}, {"Title": "Great quality introductory level camera", "Author": "J. Zywicke \"kayaknasty\"", "ReviewID": "R27MP7BTQ5FJW", "Overall": "4.0", "Content": "I bought this camera 3 weeks ago and have had nothing but ease in use.  The camera is easy for me, a novice to digital much less normal photography, to function and take great pictures.  It takes great landscape shots, and even action shots while skiing the deep powder of Montana.  As for indoor photos, they look good as far as I can tell.  The only trouble I've had is trying to use the detail focus functions without a tripod.  In these shooting modes, the camera will notice your wobbling hands and take blurry pictures as a result.  I haven't used the video feature enough, but it works well so far.  For thus just getting into digital photo, this camera is awesome.  Very easy to use and great quality for the price.  Regardless of what other folks say, the 6 megapixels can be noticed and the detail of the pictures is beautiful.", "Date": "January 19, 2006"}, {"Title": "Not a very good buy.", "Author": "Method2Madness \"Alex\"", "ReviewID": "R15TK32FEELB82", "Overall": "2.0", "Content": "Let me preface by saying that I sell cameras for a living and may be a little more picky than most, that being said onto my review.I bought this camera for my fiance as a gift and ended up returning it a week later. I was initally enticed by the size of the camera, the large LCD and the 6mp. I was replacing a Canon a75 and figured this camera would do just as good quality wise, with a higher resoution. Boy was I wrong. First of all bAttery life is PATHETIC. I was charging my 2100mah NiMh batteries but still wanted to play with the new \"toy\", so I popped a set of Duracell Alkalines in. Within 45mins(35 or so pics) the batteries were totally exhausted. Thinking I had a bad set I used another. This time i got about 40 pictures and they were dead. This is TOTALLY unacceptable. Once the rechargeables were charged, i put them in for a test. As expected run time was extended to about 1.5 hours or about 80 photos). Again, disappointing. Now onto picture quality. To sum it up. Daytime shots were acceptable. Macro mode yielded the best picture, funnily enough and Indoor/Low light shots were almost ALWAYS blurry. There is no AF assist lamp, nor the ability to adjust ISO to defeat the blurriness. Again, totally unacceptable for a camera in this price range. Nikon loads this camera up with useless features such as BSS(Best shot Selector), which should actually be labeled WSS(Worst shot selector); facial recognition(doesnt work) and the blurry photo detector(which works great.....and is illuminated most of the time......which just backs my previous statments of poor quality, blurry prints.95% of the photographing community does not NEED a 6mp camera. For most a 4mp will work. Save yourself the money and the grief and get a good 4mp camera like the Canon A85 or A520. Heck even the $135 Sony Cyber-shot® DSC-S40 is a MUCH better choice.", "Date": "January 12, 2006"}, {"Title": "Could be awesome with a couple of changes", "Author": "Blank Stare", "ReviewID": "RCZ288RBYPM3Q", "Overall": "4.0", "Content": "I love the pictures this camera takes but I don't like the camera very much.  It's small but not beautifully designed like so many of the other cameras that are out now. It's also really heavy for its size so I don't take it with me in my purse like I planned.For the price it offers a superior lens, great zoom, great mp, lots of features, and the price was good.  Too bad it's so ugly.I also liked that it runs on normal batteries but this turns out to be a problem.  Normal batteries run down really quickly (maybe an hour or so, the rechargeable batteries last longer) so I strongly suggest only using rechargeable batteries.  The camera gives no signal when the charge is low and just stops working with the lens still sticking out so you always have to carry extra batteries with you.  I guess I should have returned it because this is probably a malfunction but didn't manage to in time.Other than that, this takes the most beautiful photos in the world (well, hehe, within my limited capacity).  When shopping I read that getting a good lens is the most important thing when shopping for a camera and that Canon and Nikon make the best lenses.  I've owned a Canon and never really liked the photos I took with it (I'm the only person you'll ever hear that from by the way).  This Nikon is really incredible though. This is my first digital camera and am having a lot of fun with all the settings.  Just being able to adjust the White Settings according to types of lighting is awesome because you can take indoor shots with much less color distortion.  You can take a picture in almost pitch black and still capture an image.  I keep it on amped up Color mode all the time because I'm a painter and have never liked the grayed down images of photography.Another negative trait is that the camera is so slow.  It hasn't really made much of a difference when I'm taking pictures but if you're trying to take pictures of your kids at sporting events you might miss something. I haven't used the video mode.Eventually I would like to buy a Sony because that lens takes very sharp, crisp \"techno\" style pictures and is small enough to carry around all the time, but I don't want to get rid of this one because it makes me feel like I'm Rembrandt.Good Luck with your Shopping Hell.", "Date": "October 6, 2006"}, {"Title": "Great camera!!", "Author": "Shop Girl", "ReviewID": "R3MQ8ZR2WAEL8E", "Overall": "5.0", "Content": "It took me a while to decide which camera to buy, and I'm extremely happy I purchased the Coolpix L1. It is very easy to use, it has a nice zoom, and the large preview screen it amazing! I was also able to record short video clips with sound (when previewing the video on a computer, the quality is better if you keep the screen small, otherwise the video looks grainy on a full-size screen).I have not yet used the included software to edit photographs, but from what I see from the photos submitted by other customers, it looks like I'll be able to get very artistic...!", "Date": "August 20, 2006"}, {"Title": "Good Clear Pictures", "Author": "Pradeepan Anthony \"Pradeepan Anthony\"", "ReviewID": "R6XI48O8NOU9P", "Overall": "4.0", "Content": "It has a very good zoom. 2.5 LCD is pretty cool. The resolution is superb. Very handy cam and its easy to carry.", "Date": "February 16, 2006"}, {"Title": "Ultimate picture quality and Great Zoom", "Author": "Vishal Raval \"Vishal Raval\"", "ReviewID": "R1QSF0R5MB0XC0", "Overall": "4.0", "Content": "It has wonderful zoom and great resolution in its class. Image quality is superb. The only problem is with downloading snaps to computer.. You need to have batteries in it, it doesn't take power from computer USB.", "Date": "November 29, 2006"}, {"Title": "dang nice camera", "Author": "Chuck Norris", "ReviewID": "R1U2KCT8BB120Z", "Overall": "5.0", "Content": "I dont understand why most people dont like this camera.  I think they dont know how to use it fully and havent taken the time to learn it. With the autofocus on Nikons you have to slightly touch the button for it to focus, otherwise you will get a blurry picture. Once you learn this camera you will realize just how nice it is. Im a somewhat serious photographer and bought this camera just for a more portable ease-of-use type camera, I never realized just how good it was. This camera takes just as good of pictures as my 35mm SLR (aslo a Nikon)and the video on it is pretty decent for what the camera is.  As for all the different features this thing is rediculous, there;s a feature for everything! I've taken pictures at night, pictures at dusk, mid day, indoors, and no matter what they come out great. All I can say is that for the money you can;t beat it!", "Date": "August 14, 2006"}, {"Title": "Nikon -not cool pics", "Author": "DD \"DD\"", "ReviewID": "R2BWEGC1QDJVOZ", "Overall": "2.0", "Content": "Have been trying several new camera's, first one was the super small Nikon credit card cam, I don't recall the # right now, it has been the best so far. This L1 simply doesn't take good pictures easily. I am a basic user, but my wife is a semi professional, highly educated camera person, and she agrees it ain't just me--she actually advocates returning this one. There is also a obnoxiously long wait for the cmaera to recharge between shots--whether with flash or without. The only thing redeeming--and why I tried this one, is that the lens actually protrudes from the camera body, making it difficult to put your finger in front of the lens. This was a major issue with the little credit card model.", "Date": "January 21, 2006"}, {"Title": "So Good, We Bought Two!", "Author": "Guy M. Blasi", "ReviewID": "RK2E9BLT9D5D4", "Overall": "5.0", "Content": "I originally purchased this for my wife's birthday earlier this year.  After her exclaimations about what a wonderful camera it was, I decided to buy one for myself.  I had been a fan of another camera brand and now I have a couple of other digitals that I'll probably put up on auction.  This camera is an easy point-and-shoot and you get great results.  The menu is packed with features to shoot in about every type of lighting and situation, even portraits.  I still don't know the all the exact features, but you really can't get a bad photo, unless you jar the camera when you press the shutter button.  Great camera!", "Date": "December 3, 2006"}, {"Title": "Sturdy and convenient", "Author": "MagentaSky", "ReviewID": "R2KLTNZ20AZ88R", "Overall": "4.0", "Content": "This camera works well, except that the shutter speed is a bit slow. The image quality is decent. The use of AA rechargeable batteries is also convenient. The camera is pretty sturdy. I've dropped it a few times and it still works fine.", "Date": "January 30, 2007"}, {"Title": "Top notch transaction", "Author": "Marianne Cadle", "ReviewID": "R1LSBM2KEY779L", "Overall": "5.0", "Content": "Outstanding service.  Product as advertised.  Excellent packing job. Arrived in record time.  Would buy again from this seller.", "Date": "January 12, 2007"}, {"Title": "Nikon Coolpix Ll 6.2MP Digital Camera", "Author": "J. Hayter \"Unicorn\"", "ReviewID": "RT1OF5IVAXNZ9", "Overall": "5.0", "Content": "The camera arrived very quickly.  THe software installation took about 2 minutes and seems much simplified compared to the software for an earlier Nikon camera.  I am still finding how to apply some of the features to various 'picture taking' situations.  With an external power source and the correct media card it can even take a 25-minute movie with sound.", "Date": "January 9, 2007"}, {"Title": "A marginal camera at best...", "Author": "Robert Wheeler", "ReviewID": "R2JQ49T5Y0BAER", "Overall": "2.0", "Content": "VERY slow storage even with a fast card....small but too thick for comfortable handling. I ended up selling it on ebay and buying a Canon SD600 which is a great camera, thin enough to fit in your shirt pocket, fast storage of images and the battery lasts a very long time. I've charged it once and have taken many many holiday pictures. Don't buy the Nikon without first checking out the Canon SD600.", "Date": "January 5, 2007"}, {"Title": "great picture quality", "Author": "S. WANG \"okleba\"", "ReviewID": "R1S38JO65H7AVA", "Overall": "4.0", "Content": "I love this camera based on:the great quality of pictures;good quality of vedio capture;however:it is much bigger than I have imagined from the website;the battery life is too short, a new pair of AA energizer batteries can stand only about 3 hours.this stuff need too a long time to recharge itself (about 5 seconds) and i cannot take pictures without wait, so sometimes i lost a lot of great moments.", "Date": "January 3, 2007"}, {"Title": "Disappointed, I exchanged it", "Author": "Bloodymary", "ReviewID": "REDOEC4I2FK2A", "Overall": "3.0", "Content": "I bought this camera for it's size, it's optical zoom, and it's features. Had my eye on the simialarly featured & priced Panasonic L3, but the salesman convinced me that this was more camera for my money because it had more features. Brought it home & took a few pictures in different settings- everyone of them came out blurry.. tested it on my ceiling fan and it was a blurred shadow.  So I read the directions and reset the camera to it's original settings- Only then was I able to get  some very nice, clear shots.  Still having a problem with the zoom & blurring, and the camera will auto focus perfectly on a subject in macro or zoom- then pull back out of focus and blink red.. try again.  It focuses when it wants to focus, and when you are taking pictures you don't always have an hour to set up the shot to the camera's liking.  Also it was near impossible for me (not a complete novice to digital cameras either) to get a clear shot in any mode other than auto- so all those extra features were worthless unless I wanted to lug around a tripod everywhere I went. If you will notice even the best reviews here all say \"get a tripod\", I mean lets be practical here- how many people expect to have to use a tripod on a $200- $300 range 'point & shoot' camera? If I wanted a professional set up I would have spent and extra $100 on an SLR and even that would have worked better as a point & shoot! The camera took forever to write to the card, and the screen would display the image you shot for a second- then go blank for 3-4 seconds while it wrote to the card.  Meantime you could not take another picture until it was done.  Sure a higher speed card would write faster, but the same SD card is working just fine in the Panasonic I exchanged it for.  Another thing I didn't like was the fact that that beautiful 2.5 inch LCD was cluttered with a thousand little symbols at all times, you could barely see your picture.  And the battery life- Are they freaking kidding me with that?  My good quality fully charged NI-MH rechargables lasted about 10 minutes before the camera display added yet another symbol to the screen- the flashing \"your battery is dying\" symbol- expect to see that one all the time if you buy this camera.  Seriously, for  a day at the park you would need to carry at least four sets of batteries!  Now the same batteries are in the Panasonic for about 40 pics so far, and at least an hour total of messing around with the new settings and they are still not low.  I decided that the L3 with less features and an easier interface was worth exchanging it for- then I saw the L5 for the same price-  Has even more features, still MUCH simpler to understand and image stabalization so that sweet 6X optical zoom is not completely worthless without a tripod.  I could not ba happier that I exchanged it.", "Date": "April 28, 2006"}, {"Title": "Great Camera", "Author": "Harpoon \"Harpoon\"", "ReviewID": "R2I4U5ZOIUBOV5", "Overall": "4.0", "Content": "I really like the size of the screen and quality of the pictures.  It is really easy to use and the pictures turn out great.  The only drawback is that there is almost no chance to take a picture without the flash except in sunlight.  Without the flash you get a shakey picture.  But overall the camera is exactly what I was looking for.", "Date": "August 31, 2006"}, {"Title": "I love this camera", "Author": "Gina M. Rodgers", "ReviewID": "R3RJDAS2SOIGSA", "Overall": "5.0", "Content": "It takes very good pictures, very easy to use. Get some rechargeable batteries", "Date": "June 25, 2006"}, {"Title": "Great", "Author": "K. Vu", "ReviewID": "R1G3PIBS1LKCJJ", "Overall": "5.0", "Content": "The camera has great qualities at such a good price. If you read the manuel, it makes it even easier for the camera to be used. The camera at Amazon including shipping is less than 200 dollars, and all other cameras that only have 5.0 megapixel with 3x optical zoom is set up to 300 dollars. If you care about the tinyness of the camera and won't mind paying a few extra hundred for a camera that has the same qualities then this one isn't for you.", "Date": "January 10, 2007"}, {"Title": "Nice camera", "Author": "kyle", "ReviewID": "R1NW0OG00KK8XG", "Overall": "5.0", "Content": "Takes nice clear pictures. My mom spent $500 on a canon and this camera takes as good and somtimes better pictures. The menu is also extremely easy to use to select different shooting modes which really do make a huge difference in photo quality.  Macro mode works about 50/50 for me. Sometimes unbelievably good..other times really blurry but those are also extreme close ups.", "Date": "August 18, 2006"}, {"Title": "I should've listened to the other reviewers", "Author": "J. Nahmias", "ReviewID": "R2JUN32UML5JT2", "Overall": "3.0", "Content": "I was wooed by the report of 6MP/5x zoom/2.5 LCD screen.But the awful AutoFocus makes this a semi-expensive piece of junk.Go with an Olympus.I wish I had.Even my bosses, with a 3MP Olympus, take better pictures.Thanks to this camera, my trip to Europe will be remembered as \"slightly blurry\".", "Date": "February 18, 2006"}, {"Title": "Nice little digital camera", "Author": "M. Tucker", "ReviewID": "R3CPRA3HVPHKRK", "Overall": "5.0", "Content": "This camera takes beautiful, detailed pictures and has a very clear display. It also has a timer function that has come in handy, and it seems good with battery power (it takes two double A batteries). I'm very pleased with it.", "Date": "September 15, 2013"}, {"Title": "defective 2 times", "Author": "Michael J. Mueller \"mmueller63\"", "ReviewID": "R1AEWFTZ899RTK", "Overall": "1.0", "Content": "I ordered this camera in May and it would not shut off when the button was hit. I contacted the seller and returned it at my cost and was sent another the end of June. I contacted the seller when I tried to use it the second time at it was doing the first as the first camera. I have contacted the seller 3 times since and have never received any solution. It has been almost a month since I last heard from ABCDEALS.Beware!!", "Date": "June 9, 2009"}, {"Title": "Good camera", "Author": "J. Graham", "ReviewID": "R1ZX0GYPGTYVKM", "Overall": "4.0", "Content": "The viewer on the back is really big.  I like the features that it has.  The panoramic help is particularly nice.  The main downfall to this camera is the time lapse between pushing the button and the picture actually being taken.  Then after the picture is taken, you have to wait a little while for it to be stored.  It takes good quality pictures, but it's hard to have a \"photoshoot\" with toddler and have any of the pictures look okay because the toddler is faster than the camera.  I haven't taken any strictly scenery pictures with it yet, but I have a hunch that those will turn out great.  There is a vivid color setting and the pictures that I have taken outside are very nicely colored.", "Date": "January 5, 2007"}, {"Title": "Great Nikon", "Author": "Thomas B. Holt \"Thizzo\"", "ReviewID": "RPAB8DN7I7W5I", "Overall": "4.0", "Content": "I have had this camera for a couple months now and it has been a great camera. I really was attracted to the black casing as well as all of the Nikon features. I have only owned Canon digital cameras in the past. But I wanted to make this switch to Nikon. I am really glad I did. The only negative I have is that it seems to go through batteries fairly quickly. But if you get a re-chargable set-up then your ok. The functions are easy to use and the pictures are outstanding. Definatly a great camera!", "Date": "December 24, 2006"}, {"Title": "Nikon Coolpix 6.2", "Author": "Hilda Gonzalez \"hg\"", "ReviewID": "R1N6XXHN6970E", "Overall": "4.0", "Content": "I would have love the camera to be a little thinner, it's a bit bulky but I like it very much.I still need to get to know it better, play with it more.", "Date": "January 15, 2007"}, {"Title": "Great Camera, Amazing Photos!", "Author": "T. A. Rodgers \"Camera Man\"", "ReviewID": "R2T7HCSPYPKENA", "Overall": "4.0", "Content": "This is a great Camera for the price. If your looking for a great easy to use point and shoot. The menu system is nice and it has alot of options.The only down fall that I saw was the speed. It's not breaking any speed records. (but I'm not using it for that) I even have I high speed SD card and it doesn't make that much difference.Also, people were saying that it took blurry pictures? They must not know how to use the camera. These pictures are the best quality that I have ever seen.You won't go wrong with this camera!", "Date": "January 11, 2007"}, {"Title": "bad time/date battery", "Author": "H. A. Campbell", "ReviewID": "R37QN6BPA825HG", "Overall": "3.0", "Content": "Each time I changed batteries, I would lose the date/time stamp. E-mailed Nikon and they responded with \"probably have a bad interal battery\". Had to pay to send the camera back to Nikon, since the company is \"not that big\"..... and can't have local repair shops everywhere.  Guess they haven't heard of designating a local repair shop as a local Nikon repair center>  Anyway,no more Nikon digital cameras in my family...", "Date": "January 9, 2007"}, {"Title": "questioning the quality on a room with a flash", "Author": "Vicki Kunkle", "ReviewID": "R35TV6FNNDAK6H", "Overall": "3.0", "Content": "On the whole I relly like this camera but am questioning the quality of the picture when it is taken across a small room (8ft). Everything looks so washed out and doesn't have any color. I have tried changing the settings but it still has a blueish gray tint to everything. Close up shots and shots outside appear true to color.Any suggestions?", "Date": "January 1, 2006"}, {"Title": "chunky camera, average pictures", "Author": "DB9", "ReviewID": "R1AJNP326N91TH", "Overall": "3.0", "Content": "Pictures taken outdoors during the day are fine. Portraits also work out well regardless of the location as long as you have a flash. Night pictures and indoor shots are poor though. Batteries don't last long, be sure to use the lithium batteries designed for electronics.", "Date": "December 13, 2012"}, {"Title": "Wonderful camera, you can't go wrong", "Author": "Radiant Light", "ReviewID": "R2XQ5S1IMMU6Y", "Overall": "5.0", "Content": "I bought the Coolpix L1 in 2005 and it's still my \"go-to\" camera today. Probably because it's always in my purse! Simple to use, easy to change batteries when needed. Sharp images and color is vibrant. It's the one that I use for those spur-of-the-moment photo sessions. No image stabilizer so you need to hold it steady to prevent blur. Also you need to check your settings when turning it on as it doesn't revert to auto mode when powered off. I LOVE this camera and plan to use it until it breaks (if it ever does!) I do a lot of closeup photography of flowers and this does a nice job. I added a few pictures to the image gallery. I've never used the video function so I couldn't offer an opinion on that. I paid quite a bit more for this than it is selling for now but would buy it again in a heartbeat even at the higher price.", "Date": "January 21, 2012"}, {"Title": "Awesome Camera", "Author": "Katherine A. Brotherton", "ReviewID": "R3E5MWC8LFHLRG", "Overall": "4.0", "Content": "I had this camera for over three years, and it never gave me any problems in those years. Just recently it broke though, it doesn't turn on, so I just figured it was time for an upgrade since they have all new cool features on the new cameras. Nikon has always been my camera brand favorite, and I would highly recommend this to anyone who wants a simple point and shoot digital camera.", "Date": "August 25, 2009"}, {"Title": "Coolpix L1", "Author": "Roger Sayre", "ReviewID": "RXWB8RH1P09IS", "Overall": "4.0", "Content": "I am a beginner with digital cameras, and this camera has worked great. I got it about three years ago, so I pretty much know how to use every mode on it. This camera works great for still shots and scenic pictures. Also, it takes really clear pictures of close up items, such as plants or insects. It also has many different settings on the \"Scene\" mode, that can allow you to take pictures of fireworks, make a panorama, and many other things easily. Also, this camera is very durable. I have dropped it countless times in the snow, in puddles, on cement, and it still works well. However, this camera is kind of hard to use for action shots. When you press the shutter button, it takes a full two seconds to take the shot. Two seconds may not seem like much, but, for example, when you want to take a shot of someone kicking a soccer ball right as it leaves the ground, after two seconds, the ball is a lot farther away. Also, it burns through battery power fast, so rechargable batteries are a good investment. Overall, I think this camera is a great choice for a person who wants good quality pictures on a camera that will last a long time.", "Date": "December 8, 2008"}, {"Title": "Worth the price, best for outdoor/daylight", "Author": "Shockster", "ReviewID": "R177UTZXN1DWZA", "Overall": "3.0", "Content": "I bought this camera because I needed something inexpensive that I could break or lose without feeling too bad. The camera is worth the price, but don't set your expectations too high. It's a great camera to keep in your bag at all times but probably not the end-all of your camera needs.Pros:PriceNikon quality, very durableBattery life is MUCH better than most digital point-and-shootsCons:Flash stinks, which is expected for an on-camera point-and-shootLag time between shots in low light is painfully slow", "Date": "December 7, 2008"}, {"Title": "Muy buena!", "Author": "R. RODRIGUEZ", "ReviewID": "RG4EJMADZTOR1", "Overall": "4.0", "Content": "Esta camara es muy buena. La calidad de imagenes de las fotos es excelente, tiene gran variedad de funciones y aun facil de usar. Pero tiene algunas cositas que yo diria en contra, el lente pareciera estar un poco \"flojo\" y con los nuevos modelos que han salido ahora es un poco grande y pesada, pero del resto excelente, aunque despues de aprox. 2 años comenzó a grabar un sonidito cuando estoy grabando el video, no se si lo que quiere decir es que necesito una nueva!!! :-))). En general excelente compra, fotos muy nitidas. Recomiendo este producto ampliamente!", "Date": "November 15, 2008"}, {"Title": "Nikon coolpix L1", "Author": "Alan Kessler \"FairhopeMan\"", "ReviewID": "R2BTNL7PDN0DNL", "Overall": "4.0", "Content": "Excellent camera with several surprising capabilities. Easy to use, minimal buttons and good response time. Built-in microphone is tuned perfectly; does not pick up background noise. Pictures are the usual superb quality you would expect from Nikon. The only digital cam I will own.", "Date": "July 5, 2008"}, {"Title": "It's the photographer, not the camera", "Author": "Shawn P. Wright", "ReviewID": "R2M4XD5ZAA6XFO", "Overall": "5.0", "Content": "I received this camera as a gift for Christmas 2005, and have used it extensively (over 5k photos and videos) for everything ranging from portrait photos to architectural photos to concert photos, and it has never let me down. Granted, it's not the best performer in low light situations, and it would have been handy to have a few additional exposure settings, but it's performed really well for me.Contrary to what some of the reviews have said, the battery life is just fine. I shot The Cure during a show at the Wolstein Center in Cleveland on June 18, 2008, and I got close to 250 shots before I had to switch the batteries. Also, the quality of said photos has more to do with the photographer than the camera. Don't blame the camera because all of your shots come out blurry. Play with the settings and stabilize yourself when possible, and seriously, don't expect every single shot to come out amazing. Perhaps you could do that with enough skill using an SLR, but with a point-and-shoot, it's not realistic, so be realistic, and you won't be disappointed. :)With that said, I do plan on upgrading to a better camera soon, but this model has served me well, and I'd recommend it to anyone.", "Date": "June 25, 2008"}, {"Title": "Great first generation", "Author": "M. Peng \"oranageangel\"", "ReviewID": "R1J41QX9MSGJNC", "Overall": "4.0", "Content": "This is a first generation Coolpix.Was it worth is $$$ at the time? Absolutely. Is it worth $$$ now? Not quite so. My advice: go for the newer Coolpix. The series is excellent, so you can't go wrong with it. But the most recent models are thinner and I believe have a better LCD screen in the back.If you're looking for a basic point and shoot, it's excellent.5 x optical zoom - that saved me more than once. 3x just won't cut it at times, and digital zoom is another word for pixelized (unprintable).Easy interface - I learned on this camera. The one-touch buttons are easy to use, and the camera has cool features such as portrait or landscape help. You press that, and it gives you place holders of where the heads should be, or how to align things, so that you can have better composed pictures. It's like a little helper!Good white balance and contrast. I've taken great B&W; shots with this camera, as well as good, boosted color shots with this camera. In fact, you may be so spoiled with the quality of your own shots, that you won't like what you take with a DSLR! It just makes everything you take better.Very durable and reliable. I've owned this 3 years and NEVER had a problem. Added bonus: you can use rechargeable AAs with this camera. Meaning, you're on travel abroad, you don't have to cry that you're out of battery - you go to the local grocery store, buy AAs, and you can keep shooting. That is definitely NOT the case with other cameras these days.Conclusion: great value. Awesome pics. Easy to use. But its little brothers and sisters in the Coolpix family are just way cooler.", "Date": "May 29, 2008"}, {"Title": "Simple and easy", "Author": "Z. Moore \"the rocker\"", "ReviewID": "R1K4RNY36H8YDM", "Overall": "5.0", "Content": "I really like how simple the interface is. True point and shoot camera with a great quality picture. I bought this as a present for a family member so I am really waiting to here their review on it.I like the aspect that it has a 5x digital zoom which is plenty for a point and shoot camera.", "Date": "January 5, 2008"}, {"Title": "Blurred Disappointment", "Author": "Katherine Mueler", "ReviewID": "RK9CQ2PL2O300", "Overall": "2.0", "Content": "I was so excited to get this camera could hardly wait to rip it out of the box and take a bazillion pictures!  But my excitment was washed down the drain quickly because every photo burred w/ out the flash. And it wouldn't focus unless the flash was on.  It only seems happy w. the flash on even when not nessecary, making my pictures to bright and the color horrible.  I have read the manual and have to change all the settings for any hope of a good photo.  Each picture shouldn't require a setting change or WB change. This camera is a pain in my butt and I wish I had gone w. something else.  I applaud all who can get it to function properly!", "Date": "April 19, 2006"}, {"Title": "even better than we expected", "Author": "Jo Ann Harvey", "ReviewID": "R2PRATCJDKNB8Q", "Overall": "5.0", "Content": "The camera arrived in a timely fashion and was an awesome birthday present. It has been easy to use and the birthday boy was very happy to receive it. We are pleased and would shop here again.", "Date": "November 5, 2007"}, {"Title": "great camera with a super fast shutter speed", "Author": "B. Jean Clark", "ReviewID": "R3RALW9BK05QYO", "Overall": "5.0", "Content": "I got this camera yesterday, and I am already loving it.  it has way to many settings, for me to figure out how work.  I love this camera.", "Date": "September 29, 2006"}, {"Title": "Do not buy this camera if you have any interest in using the video function.", "Author": "Jason E. Flynn \"jasoneugeneflynn@yahoo.com\"", "ReviewID": "R3UM2COQH80R05", "Overall": "1.0", "Content": "Nikon typically makes a great product and I love my D70 SLR but in this case they have really let me down. I shopped around and bought into the 6.2 megapixels and 5x zoom Nikkor lens. The still photos are not my main problem (although the monitor can get crowded and saving each shot takes longer than I would have liked). Here is my main problem: the video function of the camera. First, while capturing video there is no way to adjust the zoom. Second, and most importantly the audio that is captured along with the video includes noises from within the camera. This is caused due to the sensitive mic being so close to the lens which is constantly refocusing. The noise that is picked up renders the audio element of the video captures, useless. There is a way to improve the audio quality: by setting the camera up to only focus in the beginning of the shot, which eliminates some of the sound problems picked up but a) does not totally avoid them and b) it has to keep that one focus for the entire shot - potentially a problem depending on what you are shooting. I have to say the images themselves are fine but I wanted a point and shoot with video capabilities (both video & audio) and this camera fails to deliver that. There are many cameras I have seen and used since that do not have this audio problem in the playback of the videos so please look into this before purchasing if this is an important function for you. By the way I exchanged this camera three times so it was not a \"bad\" one from the bunch, even Nikon explained to me that nothing can be done to avoid this. Their response was that it was not the main, intended function of that camera, so basically, deal with it - may be so but it is there and it needs to be corrected -  and I would not make a purchase of this sort from Circuit City or any other chain like them due to the customer service you will not receive.", "Date": "August 25, 2006"}, {"Title": "Horrible Camera", "Author": "emory2001", "ReviewID": "R1QTIAEK5040FW", "Overall": "1.0", "Content": "Well given the other reviews, I must have just gotten a bum camera.  The shutter speed is too slow, and no matter what setting it is on, and no matter how steady my husband and I hold the camera, it takes blurry pictures.  Not what we expected from a nice camera.  We have had this one about 6 months and are buying a new one already.", "Date": "August 20, 2006"}, {"Title": "Not Happy", "Author": "Peaveydude \"Terry\"", "ReviewID": "RKLSEU1OR0FRU", "Overall": "2.0", "Content": "I tryed the Coolpix L1 6.2MP.I have never returned anything in my life,but I took this back.I could not get a clear pic.day or night,outside or inside.I have a old 1.3 megapixel camera that takes better pic.I love photography.But I could not get a good pic with this camera.I will not buy a Nikon camera again.", "Date": "July 22, 2006"}], "ProductInfo": {"Price": "Unavailable", "Features": "6.2-megapixel CCD captures enough detail for photo-quality 14 x 19-inch prints\n5x optical zoom; 2.5-inch LCD display\nFace Priority Autofocus and In-Camera Red-Eye Fix, plus On-Screen Help menu and D-Lighting\n15 scene modes; macro setting focuses as close as 1.6 inches from subject\nPowered by 2 AA-size batteries; stores images on SD cards", "Name": "Nikon Coolpix L1 6.2MP Digital Camera with 5x Optical Zoom (Black)", "ImgURL": "http://ecx.images-amazon.com/images/I/41CNR04HQEL._SX300_.jpg", "ProductID": "B000AXQSVC"}}