{"Reviews": [{"Title": "Great transition from 35MM SLR to Digital Photography", "Author": "Dr. Eugene E. Nanay Jr. \"Rev. Dr. Gene\"", "ReviewID": "R2QAOT3GTX6VXJ", "Overall": "5.0", "Content": "I had been trying for years to introduce my wife (a published photographer) to digital photography and this camera really inpressed her from the first time that she used it. The size, ease of operation, and clarity of image were more than she had expected and she is very enthusiastic about continuing her hobby. The price was very fair and I would recommend it to anyone looking for a great digital camera.", "Date": "November 29, 2005"}, {"Title": "Good, solid little camera", "Author": "Andy Apple", "ReviewID": "R3IMLE1MJI790P", "Overall": "5.0", "Content": "I learned a valuable lesson recently. When I first bought this camera I loaded it with some 2500 mAh batteries. I was extremely disappointed that I could only get about 30 pictures before the battery died. When I started to research battery chargers, I came to realize that not all chargers are created equal. Many older and even cheaper new chargers are not capable of fully charging high capacity batteries. This is because they use a timed charge which shuts off without regard for how much the battery is actually charged. So if you are still using a 3 or 5 year old charger and it isn't a \"smart\" charger, then you might only be getting a 50% or less charge. In my case, with an old Energizer charger, I reckon I was only getting a 30% charge.The other thing you should realize is that Alkaline batteries are not a good choice for digital cameras. You'll be very disappointed with their life if you try to use them in this and most other cameras.Pros:High quality photos with Pentax SMC lens and big 6MP images.Uses SD card. Check out Kingston's 512 MB card on Amazon for a good deal.Uses AA batteries.Great battery life (but you MUST get yourself some high capacity Ni-MH batteries and a charger capable of charging those same high capacity Ni-MHs). With 2500 mAh batteries, it will get more than 250 pictures.Very solid construction.High quality metal case.Big 2.5\" LCD screen.Good black and white image quality.Cons:No viewfinder (which only becomes an issue in low light conditions).Indoor pictures can be difficult to get right.With Alkaline batteries, it will only get about 40 pictures.Slow recycle times between pictures when using flash.Overall I am very pleased with this camera; it represents very good value for money- shop around!", "Date": "June 3, 2006"}, {"Title": "Mediocre", "Author": "Uinta Hiker", "ReviewID": "R1OEJC73IRQW73", "Overall": "2.0", "Content": "On paper, this camera should be ideal, however, it fails to live up to its marketing hype: picture quality for outdoor scenic shots is good, but indoor and softer light situations show its limitations. Photo quality is mediocre. The camera also uses batteries rapidly. I would suggest looking at the Canon A510, Sony Cybershot DSC-series, or Kodak Easyshare C-series instead.", "Date": "January 10, 2006"}, {"Title": "Pentax S60-  Big price little perks", "Author": "Review Guru \"Review Guru\"", "ReviewID": "R1FZ4PO8D9Q8KV", "Overall": "4.0", "Content": "$199+ The Pentax S60 DOES take very nice pictures HOWEVER it may not be worth the price because of its poor features: only 11 MB of memory, low AA battery-life, and the movie playback mode is hard to hear (not loud enough).  Also the latch that keeps the battery in place does not seem sturdy. The upside to this camera is its picture quality (6 MP) and large screen.", "Date": "November 30, 2005"}, {"Title": "Decent Camera, but not the Greatest", "Author": "staclo24", "ReviewID": "R1DD1BFXRWBFA9", "Overall": "3.0", "Content": "I've had the Pentax Optio S60 since Christmas of 2006.  Right at the beginning, the things that bothered me about this camera were: 1) it came with no memory card and the built-in memory only allowed me to take about 5 pictures, and 2) AA batteries last for maybe 40 pictures (if you're lucky).  I found right away that lithium where the only batteries that worked well for me.  I did like the picture quality at first.Now that I've had it for a year and a half, here are the pros and cons as I see them with this camera:Pros:Seems to be sturdy.  Has held up for a year and a half with toddlers always trying to get ahold of it.  It's had its share of drops and it still works.It's pretty easy to use.It has a nice large screen (but no viewfinder)Cons:Does not take fast pictures (especially with a flash). I don't hardly have any good pictures of my kids, b/c they only smile for a second and then they are done.  The camera just doesn't shoot fast enough to capture their smiles.The quality seems to have diminished (unless it's my imagination).  I recently ordered about 50 pictures from Kodak.com and the quality of most of the pictures is sub-par at best.  They almost seem foggy and the color looks off.  I know that it's not just the prints, b/c some that we ordered were taken from a different camera and they turned out much better.Overall, after a year and a half, I'm done with this camera.  I just ordered a Canon Powershot, so I'm hoping that I have better success with that one.  It definitely isn't worth the price that it's listed at now (as of 8/08).  If it weren't for the fact that this camera has held up so well and did seem to have decent quality pictures at the beginning, I would give it 2 stars.", "Date": "August 1, 2008"}], "ProductInfo": {"Price": "$329.99", "Features": "1/2.5-inch primary color 6.0-megapixel CCD for outstanding image quality\nLarge, 2.5-inch LCD color monitor for easy viewing\nFeatures auto-focus, autoexposure, and auto flash capabilities\n3x optical zoom and 2.6x digital zoom for combined 8x zoom\nHigh-quality aluminum alloy body for sleek design", "Name": "Pentax Optio S60 6MP Digital Camera with 3x Optical Zoom", "ImgURL": "http://ecx.images-amazon.com/images/I/51YyUNnEWOL._SX300_.jpg", "ProductID": "B000BB39A6"}}