{"Reviews": [{"Title": "Cute Little Number...", "Author": "A. Nash-Brooks \"An Amazon\"", "ReviewID": "R1DYPCWCBSQC4V", "Overall": "4.0", "Content": "I just purchased this camera and I am impressed so far.  My pictures are clear and the carmera is user-friendly.  The only problem I had was finding the port for the external memory...however, if I would have read the manual first, I wouldn't have had any trouble finding it...LOL!  By the by...it fits perfectly in the palm of my hand...not too sleek (to lose)...not too bulky (to annoy).  I'm enjoying it...hopefully you will too.", "Date": "November 17, 2005"}, {"Title": "Good camera!", "Author": "M. Holdridge", "ReviewID": "RAOBI26M38UH7", "Overall": "5.0", "Content": "I received this camera as a gift for Christmas in 2005.  I am still using it without any problems to this day.  I dropped this camera on cement steps and it still works.  This camera takes great pictures, no fuzziness or blurring unless you dont have a steady hand.  I have used this tons of times without problems.  I even took a photograph with it that won Best Of Show at the local art fair.  Battery drain can be bad with any digital camera if you use the screen.  If you get name-brand batteries, they will last longer.  It mainly depends on whether or not you use the viewing screen to frame the picture.  The one problem I did have was when I got impatient and did not let the camera finish saving the picture to the card and tried to take another picture then shut the camera off.  It \"corrupted\" (half of the picture had the film negative look) a few pictures on the memory card.  You should let the camera finish saving the picture before trying to take the next one just to be safe.All in all, I have taken some amazing pictures with this camera and some not so amazing ones (thanks to me)  When I have a steady hand or tripod, this camera takes SHARP & CLEAR pictures.  5mp is great for anything up to 8x10I would recommend the HP M415 to anyone looking for a great Point and Shoot", "Date": "July 5, 2007"}, {"Title": "good for the price", "Author": "bgd73 \"1781792\"", "ReviewID": "R1M9AUBLGTCDVZ", "Overall": "4.0", "Content": "I received this with a missing usb cord and the wrong memory card.Thought to be broken. I was about to give up until I read the manual about its internal memory. It functions fantastic. Be sure to have jumbo maH in the aa rechargables, 5.2 mp is huge. My 1700 maH aa's do very good and it recharges the flash in no time, at least as quick as my a205 fujifilm (same batteries go figure). The extras really are good like \"5mp best\" and audio with simple vid recording. Great for price, and even better for free. go to hp for the memory module, it seems to be very finnicky even if following hp's guidelines on what this camera will take for external memory cards.This one returned errors even with a correct card, but hp's correct card seems to be the best answer.", "Date": "April 8, 2007"}, {"Title": "Super camera for this price", "Author": "H. Bolatoglu \"Aydinzeybegi\"", "ReviewID": "R32DJ9VOI8XBBX", "Overall": "5.0", "Content": "I bought this camera 9 months ago and I've been very happy with it. Picture quality is superb. Never showed blurry pictures unless \"shooting without flash in darker places\". If you shoot without flash in dark places pictures will be blurry. It is not a flaw. This problem is related to \"night shot\" ability. You may choose others for more money. Movie quality is medium. Overall this is a perfect choice for leisure purposes.", "Date": "July 16, 2006"}, {"Title": "fuzzy image, poor battery efficiency", "Author": "Ke Liao \"ken\"", "ReviewID": "RYLU1O8JYXLTF", "Overall": "1.0", "Content": "i bought this just because it is a 5M pixels camera, but it turns out to be a big disappointment.i bought another canon A410 3M too, its way shaper and clearer than HP. i tried tripod, highest resolution, but the HP pic is always blurred(like a piece of white paper), espically for portrait mode. guess its because their little tricks ---\"lower the sharperness and make it natural\".2AA batteries are only good for 20 pics.will return it, and go for japanese cameras.", "Date": "November 3, 2005"}, {"Title": "Final Pictures are screwy - Pixel layout highly distorted", "Author": "H. L. Rugnetta \"new mom\"", "ReviewID": "R1KY5YQZ4HCCC1", "Overall": "2.0", "Content": "Let me start by saying I'm a huge HP fan.  My PC is an old HP, both of my printers are HP (the 820C and the photosmart 7760), and my previous two digital cameras are HP.  I can't tell you how disappointed I am with the M415.  The pictures look great on the rear display, and even on the thumbnails as the images are being upload, but the horror and disappoint comes when you blow up the image to full screen - the bottom half of the picture is missing!Let's put it this way, it might as well be missing. The bottom half of my pictures look like someone has cut it in half and replaced with a negative (you know, the 35mm film negatives)of part of the bottom half.  The real trouble comes in that the problem is not consistant - I can take 20 pictures with no flaws, but the next 50 will be screwed up.  I've missed wedding, graduation, vacation, and baby pictures with this camera.Mind you, this is the second camera (the M415) HP has sent me, both with the same problem. HP still insists that they have never heard of the problem before (BTW, tech support is very polite, but very slow. Over 4 phone calls I was on hold 7 hours).  The camera is too expensive for me replace after just 4 months - buyer beware.", "Date": "December 7, 2006"}, {"Title": "Great photos.  Eats batteries.", "Author": "A Snider \"a snider\"", "ReviewID": "R2TDKTT76PTLOY", "Overall": "3.0", "Content": "I previously had an HP digital camera and it took great photos.  It got dropped and broken.  I bought the M415 for office and work use.  It takes good photos, sharp and clear.  The video clips are fuzzy, but great to add to a presentation.  The transition between photos requiring flash is very slow and this camera eats batteries.  In the four years I have had this camera, I have probably spent at least twice as much on batteries as I paid for the camera.", "Date": "July 28, 2011"}, {"Title": "So So", "Author": "Money", "ReviewID": "R2M53CCHNH9AYO", "Overall": "2.0", "Content": "The door for the battery is broke so it won't stay closed unless you tape it. Seller had to have know because there was sticky residue left around that area, letting me know it was previously taped. I bought this product for a pre-teen. That specific info would have been nice to know in the item description prior to purchase. It also needed to be cleaned. Other than that it's fine. No manufacturing default yet.", "Date": "January 16, 2011"}, {"Title": "Nice camera", "Author": "Tom", "ReviewID": "RPZGGZLTI5KYS", "Overall": "5.0", "Content": "It is a very nice product. easy to use. Good picture quality. I am so happy with it.", "Date": "April 19, 2006"}, {"Title": "Fuzzy image - poor auto function", "Author": "mensagrrrl \"mensagrrrl\"", "ReviewID": "R36H2MD3TP5ZXN", "Overall": "1.0", "Content": "This camera takes fuzzy images and there doesn't seem to be any way to fix that.  I thought it was me but even steadying the camera produces a fuzzy result.  From any resolution you look at them, they have flaws, and are not good for prints.  I'm returning it.", "Date": "December 20, 2005"}, {"Title": "Not impressed at all", "Author": "Valarie Weinhaus \"Val\"", "ReviewID": "R9OO26XXVJYLG", "Overall": "1.0", "Content": "I have owned an HP320 for years and have been very happy with it. I decided to once again go with HP for my new camera, and bought an M415 because of the 5.2 megapixel and the price.  Mistake.  The pics are blurry, the focus is off and the batteries don't last more than one setting of pictures.  The flash takes a good 6-7 seconds to recharge and I've missed shots because of it.  The HP support people are Indian and I can't understand them, so they are no help to me at all.I'm trading it in for a Canon tomorrow.", "Date": "January 14, 2006"}], "ProductInfo": {"Price": "Unavailable", "Features": "5.2 Megapixel Photo Smart Digital Camera\n16 MB internal memory and 1.5 Inch Color Display\n18x Total Zoom (3x Optical, 6x Digital)\nImage Format JPEG/MPEG-1 for Video Clips\nMaximum Shutter Speed 1/2000 sec", "Name": "HP M415 5.36MP Digital Camera with 3x Optical Zoom", "ImgURL": "http://ecx.images-amazon.com/images/I/412480GC7XL._SX300_.jpg", "ProductID": "B000B63RJY"}}