{"Reviews": [{"Title": "A durable point-and-click from Olympus", "Author": "Country Folks Can Survive", "ReviewID": "R2L2J65FXD7CIG", "Overall": "5.0", "Content": "I have two kids and we travel frequently, so I enjoy the durability of this camera. I really like the ability to take pictures underwater.  I bought this to replace an Olympus Stylus Tough 8000.  This camera is less expensive and can take less of a lickin', but the LCD screen is larger and the features are more streamlined for casual point-and-shoot. If you are trying to decide between this and a more expensive Stylus Tough, I recommend this camera.", "Date": "May 8, 2013"}, {"Title": "Captured the Bahamas", "Author": "edacherry", "ReviewID": "R2E3U3LS50SY4E", "Overall": "5.0", "Content": "I work professionally as a photographer and I DON'T want to lug around my equipment when I'm on vacation. This was perfect for my main goal: take underwater photos while in the Bahamas for post-wedding portraits AND snorkeling when I had the time. Easy to use and great for when out of the water, too.", "Date": "May 3, 2013"}, {"Title": "Simple and Durable", "Author": "TJ", "ReviewID": "R385PPUJ1OY17W", "Overall": "4.0", "Content": "Pros-Mostly made of plastic but feels durable.-Light weight.-So far indeed is waterproof (sink test and rafting trip).-No lens that pops out, so no lens to worry about bending accidentally.-Worry-free to take onto beach and adventuring, no worries about sand getting into lens or dropping the camera - just drop in pocket and go!-Simple and intuitive shooting options, quick to turn on/off flash, get into different \"scenes\".-Cool scene features include : panorama (with assisted visual cues), HDR (mildly impressive), High ISO (for taking photos in low lighting)-Boots on pretty fast-Extremely fast shots and burst mode - seriously fast!-Dedicated Movie button!!!Cons-High-speed movies feature is sort of a joke - you can only take about 20 - 30 seconds of video in 640 res and the lens or whatever is very slow/dark, so you'll need extra lighting to compensate. A little misleading since I think the \"HS\" part of the name means high speed. Though it is high speed, I was expecting a little more length capacity!-The \"photo review\" is kind of slow compared to Canon cameras - takes a few seconds to load between pages of photos.-Biggest aperture is 3.9, pretty weak but might be on par for a cheap compact camera.-High ISO setting unsurprisingly produces water-color-painting-ish photo quality (noise, smearing). Photos are plenty bright but detail is lost a great deal. Reasonable for price range and size of camera.-Photo quality is just OK, deteriorates quickly with higher ISO's.-The self-timer feature only allows for one photo at a time compared to Canon cameras which allow you to customize the timer length and number of shots taken! I would have paid more to have this must have feature!!! Don't understand this.-Does not include a separate battery charger - instead you hook the camera to a possibly proprietary USB cable that goes into the power socket to charge the battery - in other words, out of the box you cannot use the camera if you need to charge the battery, even if you buy extra batteries! So be sure to be the \"sold-separately\" independent battery charger, either through Olympus or third party.-The menu controller is a little plastic joystick that sticks out from the camera a little bit. I wonder if it might get damaged if dropped in the right angle. For everyday use, doubt that would ever happen but just fyi.Given all those cons, why do I give it four stars? This camera is marketed as a relatively cheap, outdoorsy camera and with that in mind, I think it's a pretty good camera. I am worry free about it when out adventuring and that's worth something.", "Date": "October 3, 2013"}, {"Title": "Perfect for my needs.", "Author": "Ash", "ReviewID": "R2NNKDCCZNFVV6", "Overall": "5.0", "Content": "I got this camera because I go out Hiking, Kayaking and pretty much anything else outside and I have never been easy on my cameras. This little blue guy can take a bit of a beating and be fine... Its taken a tumble off a cliff side and lived... still takes fantastic pictures above and under water. So I am very please for the price.", "Date": "June 23, 2013"}, {"Title": "Excellent camera, stupid cable", "Author": "Rocketship", "ReviewID": "R2WEE39V9CRT17", "Overall": "4.0", "Content": "This camera has been excellent so far, good image quality and very good exposure control. I've been able to take better pictures in almost all lighting - sunsets, backlit, etc on the basic automatic setting, and the camera delivers stunning results.The only bad thing so far - the camera has a charging/data port that is just about the same size and shape as a usb plug, but Olympus gives you a proprietary plug (that is about the same size/shape as a usb plug). Fail! They could have stretch a little bit and made it a standard plug, of which I have ten floating around the house, rather than a specific one that I have to keep track of and identify.", "Date": "August 4, 2013"}, {"Title": "This. Is. The. One.", "Author": "jayson", "ReviewID": "R33SI6WXOYHITD", "Overall": "5.0", "Content": "I've gone through many many digital point and shoots -- Canons, Minoltas, Nikons, Samsungs, you name it -- and none of have come anywhere near this one for usability, durability or picture quality. I brought this along on a trip to Guatemala as a waterproof supplement to a higher-end Samsung and ended up using this superior camera exclusively for everything, on dry land as well as in the water. There's something about the layout of the buttons, and particularly the way the toggle sticks a little farther out from the body of the camera, that makes it astonishingly easy for my large fingers to quickly make settings and adjustments. The burst feature is fantastic -- firing successive pictures at machine-gun speed -- and the camera works brilliantly in low light. Also flawlessly waterproof -- I kayaked and swam and spelunked in a cave with water over my head -- and had no leak problems at all. Can't recommend this one highly enough!", "Date": "March 12, 2014"}, {"Title": "smaller than expected...in a good way", "Author": "howard l.", "ReviewID": "R14Q02Y5DXXC7O", "Overall": "4.0", "Content": "The TG-630 is relatively small for a \"rugged\" camera and it's got a bunch of advanced features for the price (too many for the average point & shoot consumer), but the interface is super user friendly. However, like most ruggedized cameras, it doesn't have a lens cover or much rear screen protection.Photos are exponentially better than the Fuji XP series (returned the awful XP-60) - a little dark in the shadows, but some of that can be tweaked in P-mode or photoshoped. The \"LED illuminator\" is a bonus for when the flash is too intense...or just as a flashlight to see in the dark. Time/date can be accessed when camera is turned off...but only military time is available.Battery life is a couple of days of frequent use. The 630's battery has been upgraded to last longer than the TG-620 and is exponentially better than those old point & shoots that ate AA batteries within an hour. Keep in mind, using the video function uses the charge much quicker than just taking photos.Two high speed movie modes that have also been added since the TG-620 are 120fps and 240fps...although their resolution is quite low.I got confused with \"SDXC\" written on the memory compartment. Fact is, it doesn't require an XC card, but also accepts any type SD card (actually, the smallest XC card is 64 Gigabytes, which is about 30 times more memory than the average P&S; photographer needs). $ave buying a much smaller capacity \"SDHC\" card...a 4GB will hold approx 1000 photos. Only if you need to take full advantage of the camera's continuous burst features and 1080p video capability should you splurge on a Class 10 card.Also confusing is the box, manual and camera DO NOT have the acronym \"iHS\" printed anywhere...but happy to find there isn't a \"non-iHS\" version of the TG-630.The port door has to be opened every time to charge or transfer photos...little worried how the hinge and locks are going to hold up.I was most disappointed in the color I received: IT'S NOT RED! All the stock photos I've seen of the \"red\" TG-630 are vivid, primary red...but, in person, it's actually a dull fuchsia pink. I'm male and don't want an feminine looking camera (exchanged it for white...which isn't particularly masculine, either, but looks great).UPDATE Apr 1, 2014:  The screen is hard to see in glaring sunlight (especially with sunglasses on). Therefore, it's easy to put the camera away still turned on. If put in a pocket while still on, any movement may press buttons, extending the time it's on and draining the battery. Fortunately, sound is emitted when buttons are pressed, reminding you it's on...do not turn the sound feature off, unless necessary.", "Date": "September 21, 2013"}, {"Title": "Really nice little camera, and it is a Tough Camera", "Author": "Steven S. Nelson", "ReviewID": "R26J2WYL5ELLCQ", "Overall": "5.0", "Content": "Really impressed with this camera, takes nice pictures and is waterproof to 16 feet, shockproof to 5.5 feet, freezeproof to 14 degrees F.  It is also very small with a nice display.  The buttons are small and required a little getting used to, but all in all, really pleased with camera.  You can get spare batteries and a charger to keep you going even longer, although the battery life hasn't been an issue for me yet.", "Date": "May 25, 2013"}, {"Title": "I was sent a USED camera!!!!!!!!!!!!!!!!!!!!", "Author": "S. M. Tilley", "ReviewID": "RFS50LCN2DDC9", "Overall": "1.0", "Content": "Buyer beware: If you are buying from the vendor listed, J&JWC; Group, be careful.  I just opened my package and the camera is clearly used.  The case is scratched front and back, there are fingerprints all over it.  I tried to take a picture of the mess with my iPhone but it kept catching a glare.  I leave for Maui in one day and now have NO CAMERA!", "Date": "June 3, 2014"}, {"Title": "Love it!", "Author": "Stephanie", "ReviewID": "R1KOM94UJNDXFR", "Overall": "5.0", "Content": "This camera really does work in the water. I got great pictures and videos of my family. I even dropped it in the snow and nothing happened! Great price and I recommended it to my friend cause I like it so much! We might even buy a second one soon!", "Date": "February 25, 2014"}, {"Title": "best small camera", "Author": "Heather Lynn", "ReviewID": "R17668TT1T2VS0", "Overall": "5.0", "Content": "This has been the best small camera I have ever owned. Used this on my trip to Dominican Republic many features, I did take photos underwater make sure it is in the locked position-I was scared at first to put it underwater but I finally did it was awesome!!!", "Date": "February 4, 2014"}, {"Title": "Bang for your buck", "Author": "Christopher Elias", "ReviewID": "R29G0QO81NPC0M", "Overall": "5.0", "Content": "What an incredible little camera. Fantastic pictures taken while in the water. Love the lock features on the external compartment doors.", "Date": "July 7, 2013"}, {"Title": "Great choice", "Author": "Kandy \"Kandy\"", "ReviewID": "R2WRU3ONS4F2LV", "Overall": "5.0", "Content": "I bought this at the last minute before going on a trip so I would not have to take my very large digital SLR camera.  I read one review in Runner's magazine and got on Amazon to see which Olympus cameras were available for Prime 2 day shipping (because I really waited until the last minute). This one had the functions I was looking for (zoom, waterproof, shock proof, recording ability) and the price was much less than listed for retail, so I gave it a chance. I was not disappointed. It has all of the standard photo settings you would find on any digital camera, and indicates how many photos/how much recording time is left with use.  Picture quality is above average. It is extremely easy to switch from photo to record and back to photo (literally one touch).  The audio on record is very clear. There is a light that blinks if the camera is left on--which is important if you are out for the day and not near electricity to recharge the battery. This camera is tough. It has been to an outdoor concert, zip lining, in the jungle, in the ocean, and covered in sand with no signs of wear and tear. I did not worry about a case.  This camera traveled in back pockets, backpacks, purses or dry sacks.  I highly recommend this product if you need a tough camera at a great price for all your future adventures on land, sea and air.", "Date": "July 30, 2013"}, {"Title": "Olympus Stylus TG-630 iHS met my expectation", "Author": "John in Montana", "ReviewID": "R1XLDT6OBMMIT9", "Overall": "4.0", "Content": "I recently purchased the Olympus TG-630 iHS to replace an 8-year-old waterproof Pentax.  I like to carry a point-and-shoot camera in my pocket when I go fishing.  I want a waterproof camera in the event that I drop the camera in the river and for the occasional underwater shot.  I do not need the additional features that come with the more expensive models.  I just want a camera that takes good pictures.  I am impressed with the quality of the images from my first trip out with this camera.  The menus are very intuitive.  My only complaint is that the joy stick is a little funky - it is too easy to make mistakes while trying to navigate the menus.", "Date": "July 19, 2013"}, {"Title": "cmos not all it's cracked up to be", "Author": "Jim Ogre", "ReviewID": "R1JON46OET5NBG", "Overall": "3.0", "Content": "overall the camera performs as expected, I have taken it on a few water trips, however the auto focus function does not work well. I found myself taking several pictures of the same thing hoping that one of them would turn out in focus.", "Date": "June 10, 2013"}, {"Title": "good camera", "Author": "turtle man", "ReviewID": "R22KB7YJST1WJZ", "Overall": "5.0", "Content": "i bought the fuji finpix xp60 and it did not even last to the end of the boat trip, so when i returned it i got the olmypus tg-630 and love it, better pics even thought its a lover mp, easy to use, and after useing it under water it still worked uunlike the fuji, the pics on it are just amazing", "Date": "June 1, 2013"}, {"Title": "Good Images Ontop and Under", "Author": "Billy Carpenter", "ReviewID": "R2G255NUJ3ITN5", "Overall": "4.0", "Content": "We had planned a trip to the BVI and wanted a camera for underwater photos while snorkeling. After reading reviews on a number of cameras I selected this camera because many of the reviews stated that the camera made very good pictures both underwater and out of the water.  I was not disappointed in the performance. All the pictures turned out well and the videos were great. A shortcoming I experienced due to the location of the lens was my finger being in the pictures until I previewed some and saw it. I was careful after that to be sure the finger was elsewhere. My advice to anyone taking pictures underwater is to practice underwater photography before you take your trip. This camera is great for snorkling but the 16 foot depth limit is not suitable for scuba diving when depths are usually deeper.", "Date": "October 9, 2013"}, {"Title": "Took on cruise", "Author": "Big B in South Carolina", "ReviewID": "R3E7ODCSEGQYBT", "Overall": "5.0", "Content": "I bought this for the water excursions we had set up on crusie ship. We were at Dunn Falls in Jamamica. Walked up the water falls, camera got soaked pretty good. Camera can be submerage into water down to 16 feet.Use it later to take underwater movies of stingrays. Excellent picture quality. Takes better pictures than any of my other cameras. For $170 you cannot beat this.", "Date": "March 21, 2014"}, {"Title": "underwater video/pic camera for vacation", "Author": "Greg Vandermark", "ReviewID": "R365AOBLXUC05E", "Overall": "4.0", "Content": "Have to say I was very pleased with this purchase.  It was kinda hard to find the right sd card that was \"recommended\" and when tried to get ahold of Olympus to get questions answered and appropriate sd card - was put on hold forever and never did get to talk to anyone.  My expectations were met from reviews and tips read prior to purchase.  Had to be aware constantly of where my finger was when taking video/pictures because it too easily got in view of lens.  Taking action shots were a little blurry - but maybe did not have it set to correct setting for that.  Underwater snorkeling video/pics very good. Panoramics good.  Still learning all features.  All in all I  would recommend this camera.  Pleased so far.  Anjela", "Date": "November 18, 2013"}, {"Title": "Honeymoon Perfect!!!", "Author": "P. Handy", "ReviewID": "R1SLFX5TWBPS8R", "Overall": "4.0", "Content": "Took it on our honeymoon to Jamaica and of course we had to use it underwater. AMAZING experience, especially under water... overall, this camera takes awesome pics and is worth the cost!!!", "Date": "November 11, 2013"}, {"Title": "Excellent Point and Shoot Camera", "Author": "Fett", "ReviewID": "R3VGXWMV4NQX4C", "Overall": "5.0", "Content": "My wife and I enjoy the ease of use of the point and shoot camera and are anxious to try some of the more advanced features such as the panoramic shooting.  Low light shots have worked out great with no adjustments.  We haven't tried the underwater features of the camera yet and hope that we don't, accidentally.  Video definitely needs a tripod for stability in spite of the IS features of the camera.", "Date": "September 24, 2013"}, {"Title": "Waterproof camera great for bad weather photography", "Author": "S. Moss \"Store-a-lot\"", "ReviewID": "R2IRA17GFC4D9O", "Overall": "5.0", "Content": "This waterproof camera is great for shooting in the rain. Takes good pictures so long as you keep it steady when pressing the shutter button. Good buy for the money.", "Date": "August 29, 2013"}, {"Title": "So Far, So Good!", "Author": "Fred Erikson", "ReviewID": "REIKH4GANQ6JY", "Overall": "5.0", "Content": "Follow the directions for use and like I said \"So Far, So Good\".  Used in the ocean surf, underwater, in the pool (underwater also), The Skloosh at Knoebles in PA (log Flume ride).  I like it!  You get a whole new dimension to your home movies when water is not a concern.  Oh, did I mention it takes great pictures.", "Date": "July 18, 2013"}, {"Title": "Great camera", "Author": "Zane Metz", "ReviewID": "R2X9O4J4R23KXL", "Overall": "5.0", "Content": "This is the second one of these cameras Ive purchased. We use them to take pics on jobs and they hold up well and do a really good job, and take the abuse of riding in a truck seay", "Date": "July 11, 2013"}, {"Title": "Amazing cameras", "Author": "Dave", "ReviewID": "R2VAN4KMKT27EV", "Overall": "5.0", "Content": "These Olympus tough cameras are amazing! I currently own one for my work, and have my own for vacations. It takes amazing pictures and is very clear even when snorkeling.  I bought this one for my mom as a present so that she could be more adventurous on her vacations. HIGHLY RECOMMEND!", "Date": "May 27, 2014"}, {"Title": "An outstanding camera", "Author": "J. Malcom Gibson", "ReviewID": "R1YRUTL1LRZPWA", "Overall": "5.0", "Content": "Having destroyed two cameras with fine sand and water I chose this to be a point and shoot trouble free. There are more features than I really expected and am delighted with it. A learning curve to remember to hold it by the base and not the top where the kens is is the only trouble. When first activated it opened in Russian! Help was onto this immediately and quickly changed back. Picture quality is outstanding.", "Date": "April 27, 2014"}, {"Title": "It handled ziplining into the water!", "Author": "dinghypursuits", "ReviewID": "R24KQY3BDHND44", "Overall": "5.0", "Content": "Crisp photos underwater and above. Loved it! Amazing that a sleek camera can handle going underwater. Just remember to wipe water off the lens if you pop out of the water for an above-ground photo.", "Date": "April 26, 2014"}, {"Title": "GREAT CAMERA", "Author": "Jamie dunn", "ReviewID": "R35ML5QQR18AN0", "Overall": "5.0", "Content": "I love this camera. It does have two draw backs. In stead of using a standard multi-connector like on your cell phone cord it has a odd size. The second problem, is it is hard to hold and not get your fingers in the picture. I would buy this camera again.", "Date": "April 23, 2014"}, {"Title": "Vacation Camera", "Author": "Shannon Royal", "ReviewID": "R3OIRQS7N2AO60", "Overall": "4.0", "Content": "Great little camera! Easy to take with you almost anywhere and decent quality pictures. Used this on our cruise and did not have to worry about keeping it dry.", "Date": "April 12, 2014"}, {"Title": "Bought camera for 6 year old girl at Christmas", "Author": "Amazon Customer", "ReviewID": "RSPJR8C7AF2QD", "Overall": "4.0", "Content": "She loves the camera and able to navigate the basic functions well.  Much better than the kid friendly cameras on the market where the pictures and capabilities are not very good.  The one challenge (versus phone based cameras) for her is sharing and printing the pictures.  If there was a way to share it easily from the camera it would be close to perfect.  She has already dropped it and used it in the bathtub without any issues.", "Date": "February 23, 2014"}, {"Title": "Good camera", "Author": "Sergey Shvets \"SGS\"", "ReviewID": "R2Z9THY154GXEW", "Overall": "2.0", "Content": "Good quality of pictures, but little bit heavy and water proof was not great. Get water inside when used it in the poolFortunately it did not damage the card, but took some time to dry the camera", "Date": "February 8, 2014"}, {"Title": "Crapped out after the third use", "Author": "Mary Long", "ReviewID": "R1JVX1M6CEPZ8G", "Overall": "2.0", "Content": "I used it twice in a pool, and once or twice on dry land.  I was very careful about following the instructions for use and drying it out.  The next time I turned it on, it would only power on for a second or two, then power itself off.  Olympus sent me a replacement battery, but that didn't help.  I am now sending it in for repair--under warranty, luckily.  Olympus so far has been very nice about service, and we'll see how this repair goes, but I'd prefer that things simply work, at least for a while!", "Date": "February 7, 2014"}, {"Title": "Awesome", "Author": "Zonk", "ReviewID": "R3LKE2UFXTNOS9", "Overall": "5.0", "Content": "So many effects and just started using them! Definitely and idiot proof camera. Used it underwater and at the beach. Its nice not having to worry about the rain or water! Took pictures at Niagara Falls with no worries! Took pictures underwater! Love the camera, highly recommended for the pictures taking novice photo dude.", "Date": "February 5, 2014"}, {"Title": "Great vacation camera.", "Author": "Dallas", "ReviewID": "R23SH1P2I1L44P", "Overall": "5.0", "Content": "It took great pictures on land as well as while snorkeling.  A quality product.  A good buy for the average camera user.", "Date": "January 27, 2014"}, {"Title": "Great Camrea", "Author": "Hello", "ReviewID": "R3TRBD6Q13NG8", "Overall": "5.0", "Content": "I got this for $110 used with no usb charger. I dropped it five feet and it still works. The side top dark blue side of the case is poking out a little bit (it's still attached obviously) however it still works just as well. I doubt my camera is water proof after that fall though... It's a camera I highly recommend, next time though I wouldn't set it up top of a five feet ladder on a windy day...", "Date": "January 19, 2014"}, {"Title": "Haven't dunked it but it is a really nice camera", "Author": "Katano", "ReviewID": "R35SRG7JRZMV8J", "Overall": "5.0", "Content": "Like the headline states, I haven't had the spunk to dunk this camera and test its underwater effectiveness but over the holidays it took some really nice shots. The pictures turned out clear no matter the lighting and the craftsmanship is solid. The user interface was easy to learn and simple but had decent features. I like that it uses a regular sd card so I could buy a class 10 card and shoot 1080p video. This camera did capture 1080 brilliantly. It was very smooth so it was at least saving 30fps.", "Date": "January 15, 2014"}, {"Title": "Olympus Digital Camera", "Author": "Michelle Beltran", "ReviewID": "RWDO7A8SJBJ8G", "Overall": "5.0", "Content": "Although the camera is brand new to me; the fact that it is \"tough\" says it all.  My last camera I accidently dropped in the sand and it quit working immediately after...I have dropped this particular camera 3 times so far (on accident) and no scratches.  I'm still learning about it, but it does what I want and I love it.", "Date": "January 7, 2014"}, {"Title": "Perfect camera for beach vacation", "Author": "Karen Lenfestey", "ReviewID": "R22MCKU7EOS7XY", "Overall": "5.0", "Content": "This camera is small, light-weight, and water-proof, which is just what we needed for our vacation to the beach. It dropped out of our beach bag on day one and I was so happy it was shock-proof. I ruined my last camera because sand blew into the lens, so this camera was perfect.", "Date": "January 6, 2014"}, {"Title": "The best point and shoot I've ever used", "Author": "Almost F.", "ReviewID": "RK0ZV01TBZPOP", "Overall": "5.0", "Content": "The best point and shoot I've ever used. It's much better than any of the Sony's I've owned in the past. The color is great. The settings could be a little more user friendly, but the camera is such high quality, that I can overlook that. The underwater and in water pics are super clear and bright. Don't hesitate, buy it.", "Date": "June 21, 2013"}, {"Title": "I don't hate it, but I REALLY don't like it.", "Author": "Sparkit", "ReviewID": "R3LLIF4PABWMX3", "Overall": "2.0", "Content": "I had high hopes for this waterproof, shockproof, outdoor camera....however, it definitely has not met the standards of a good camera. I ordered two of these cameras for use on photo documenting projects at work. The pictures are grainy, and also seems to have a lot of high contrast. I have played with the settings several times and cannot achieve the results of a clear, balanced picture that I am looking for. I realize this is a \"point and shoot\" camera, but there are many other cameras out there that are taking phenomenal pictures. My phone takes better pictures.It also seems that you have to remain VERY steady to not get the picture to blur while shooting. The camera boasts lots of bells and whistles, but in the end I just need a few functions that work well. Who needs a \"beauty shot\" anyway!?!? The one good thing I would say is that the panoramic feature works fairly well, but overall my disappointment still comes through strong for this camera. I think I will just stick with Canon after this one.", "Date": "January 23, 2014"}, {"Title": "Small, extremely fast and well protected", "Author": "Arcady Chumachenko", "ReviewID": "R2C813XDN6DLF6", "Overall": "4.0", "Content": "I was looking for a pocket-size camera to take anywhere and snap pictures on-the-go. According to tests, this camera had very fast focus and turn-on times for a pocket camera, it's small, and, as a bonus, well protected from water, shock and other bad things. Only one disadvantage I found is the battery time, I need to charge it few times a week. My good old Lumix LX-3 takes better photos, sure, but on everyday walks I use only my new Oly.", "Date": "July 16, 2013"}, {"Title": "momof3inillinois", "Author": "tiffany mullarkey", "ReviewID": "R1THD2AE2847L7", "Overall": "5.0", "Content": "We were in the market for a new digital but didn't want to spend to much and this is the perfect camera.  It is easy to use, easy to download the pictures.  The pictures come out great.  I read the reviews and some have said the video is not as good but I have not used it yet but will update my review if I do.  The one issue I had with this camera and it isn't a big one is that when you go to delete pictures you can only do it one at a time it gets a little annoying especially after taking a hundred or so pictures on vacation.  Our last camera you had the option of deleting multiple. Other then that I would recommend this camera to anyone looking for a good, durable and good price digital camera.", "Date": "June 22, 2013"}, {"Title": "Affordable, reliable camera", "Author": "Jared Updike \"keyboard buff\"", "ReviewID": "RI0N6MJ8XLLI3", "Overall": "4.0", "Content": "The camera is water proof (for snorkeling) and turns on and takes photos very quickly. Our only real complaint is that in bright sunlight the screen is hard to see, making it a bit of a challenge to tell what you are pointing at. Part of this was a foggy mask but the dim screen did not help. Overall it was a good purchase: the image quality is fair but not great (make sure to set the highest image quality or your JPEGs will be noise reduced and smeared to death), but the price and waterproof reliability make this a fun first underwater camera for us.", "Date": "May 15, 2014"}, {"Title": "As good as advertised maybe better", "Author": "Joe Canno", "ReviewID": "R2JEEO9JSERNQ", "Overall": "5.0", "Content": "So far this camera has exceeded my expectations. Very simple to use. Most of the buttons on the TG-630 are for one use only and the menu gives you a description of what each position does so its not necessary to memorize everything.The picture quality is real good including the HD video. I decided on this model because of its underwater capability and the wife and I are headed for the ocean soon so we will see how that works.If you are looking for a good camera without having to become a pro to use it this is it.", "Date": "May 7, 2014"}, {"Title": "Great camera for outdoor enthusiast", "Author": "Jeanine Botkin", "ReviewID": "R2W6LZY2DLVCUK", "Overall": "5.0", "Content": "Purchased this camera so that I didn't have to take three different cameras with me on vacation.  It worked great and is user friendly with lots of settings.  I used it snorkeling and got great pictures.  I have used it hiking and have gotten great shots.  I have dropped it with no consequences.  This is my new companion on all my adventures.", "Date": "April 30, 2014"}, {"Title": "Great Camera as far as I know.", "Author": "John McEntee", "ReviewID": "R3846IJ1UX28AN", "Overall": "5.0", "Content": "I bought it for a gift for my daughter for Christmas. She's a successful young woman and lives on her own, she goes on allot of weekend trips throughout our state and takes lots of pictures. So far....., no complaints and her pics on FB look just fine.", "Date": "February 17, 2014"}, {"Title": "Terrible picture quality", "Author": "Mindcontrol", "ReviewID": "R1FIMDG676BL9Q", "Overall": "2.0", "Content": "There are a couple of nice features about this point and shoot:1. Lightweight2. Water/Shock/Freeze proof3. Fast shutter speedThat's about it. One of the most important (if not, the most important) features on a camera is obviously the picture quality. That is where this camera severely lacks. It looks the the IQ from my old EVO 4G cellphone. For this reason I'll be returning it. I'm mainly a DSLR user and stitching over to a P and S I really didn't expect that same quality. However, this is unacceptable.", "Date": "February 8, 2014"}, {"Title": "Love it!", "Author": "Book Lover", "ReviewID": "R2CMEMXJCTIQSH", "Overall": "5.0", "Content": "Quick delivery.  Love the large screen.  Love the color.  Love the definition of photos.  Not too crazy about the square battery, however.  Would have preferred AA or something more common.  Already used it and put photos online.", "Date": "January 3, 2014"}, {"Title": "Gift for my daughter for hunting.", "Author": "Mark", "ReviewID": "ROW1G95QHW1RE", "Overall": "4.0", "Content": "She has only had a chance to use it a couple of times so far, but saves and playback are quick and smooth!  She has been playing with the presets and has been very pleased with the results.", "Date": "January 2, 2014"}, {"Title": "i", "Author": "Chinhung Pang \"Keith Pang\"", "ReviewID": "R27U7079BQJZH1", "Overall": "4.0", "Content": "Nice cammera. Pretty sensitive and fast .  Except aperture 3.9 don'thv enough depth.  But this cam is design for all weather.", "Date": "December 13, 2013"}, {"Title": "feel like a pro", "Author": "laura klitzke", "ReviewID": "RCL0Q5WCFURQQ", "Overall": "5.0", "Content": "wanted a camera that was rough and tough yet easy to use and would take great pix without maximum effort.", "Date": "December 3, 2013"}, {"Title": "great point and shoot camera for the price", "Author": "xxilimited", "ReviewID": "R3ER9GYTOVFCXM", "Overall": "5.0", "Content": "This camera seems to have plenty of options and features and works well. The price here was great too, better than other sites and brick and mortar stores. highly recommended.", "Date": "November 30, 2013"}, {"Title": "Love this camera!!", "Author": "S. McDonald", "ReviewID": "R2K9LO0YZWWZUB", "Overall": "5.0", "Content": "Awesome little camera that does everything!!  Super easy to use and nice special effect settings!  Quick to learn the settings", "Date": "November 26, 2013"}, {"Title": "Decent camera built tough", "Author": "jim", "ReviewID": "R3DV20GQBIL9QW", "Overall": "3.0", "Content": "The camera is decent with no technical problems. I give it only three stars because I don't get as crisp pictures as I did over the digital camera that I just replaced. I believe the problem is that the camera can't handle much movement when taking the picture, even the slightest will make it a little fuzzy. Overall all it is a very sturdy camera and great for the beach.", "Date": "November 23, 2013"}, {"Title": "Upgrade from abused, old, and tired Olympus Tough 6000", "Author": "dbrowne", "ReviewID": "R3RMUW7O73ORL2", "Overall": "4.0", "Content": "Still getting used to the menus and features of this camera. The choice was between this and the Nikon sport camera, so far very happy with Olympus brand.", "Date": "October 30, 2013"}, {"Title": "It takes a picture", "Author": "Noah's Ark", "ReviewID": "RIFZTIKIXQ642", "Overall": "3.0", "Content": "The main things about this product are that it takes the picture and video records.PROS:Waterproof, drop proof and a semi rugged style.Review buttonVideo record buttonCON:Does not have a lens cover (The glass might get scratched up) like the older Olympus cameras.The modes - Camera will reset your settings when you turn it off.  I don't prefer reconfiguring my settings every single time.Uses a lot of battery.Overall:The product to me is so-so, the only reason why I kept the product is, I use it as an everyday random picture taking camera for the family.Have a great day!", "Date": "September 15, 2013"}, {"Title": "Cook", "Author": "jacque", "ReviewID": "R2WZA92BX1Q8B9", "Overall": "5.0", "Content": "it is so great to have a under water camera. It takes super underwater pictures of the grandkids swimming. Great day light outdoor ones. Not so great in dark places or indoors, but that is not why we bought it. Love this camera and so do the grand kiddos", "Date": "September 3, 2013"}, {"Title": "Great Camera", "Author": "Loretta", "ReviewID": "RNSUEWSPZIHSY", "Overall": "5.0", "Content": "This camera is as durable and rugged as I had hoped it would be.  And it takes nice pictures, too.", "Date": "August 30, 2013"}, {"Title": "Great small and durable camera", "Author": "Mike Rydzy", "ReviewID": "R1TCQN0G8FIHEH", "Overall": "5.0", "Content": "The tough camera wworks as advertised, took the camera underwater and shot a lot of landscapes and action, all came out great.", "Date": "August 29, 2013"}, {"Title": "Great little point and shoot", "Author": "JBM \"JBM\"", "ReviewID": "R1AB24HKTI6PW5", "Overall": "4.0", "Content": "The picture quality for general snapshots is just OK, but not any worse than typical for its price range.  However, IT TAKES PICTURES UNDER WATER!  Not to mention HD movies. Get the floating case or arm band and take it to the pool with the kids and have a blast with this thing!  Then, go to the beach and catch those shots you're usually afraid will trash your camera (or keep you out of the fun protecting it).It is surprisingly quick between shots and the burst modes work great as long as you don't need the flash.  No complaints about battery life either.  Would give it 5 stars if it could serve as a nice general use point and shoot, but the image quality isn't quite there (still going to pack the Panasonic ZS for vacation).  Regardless, it's a great value for a really fun camera.", "Date": "August 14, 2013"}, {"Title": "Great Value", "Author": "Dan", "ReviewID": "R3UDUZMXSMT5NH", "Overall": "5.0", "Content": "This camera takes great pictures, clear and crisp.  It was  great value, wish i would have found it much sooner!", "Date": "August 1, 2013"}, {"Title": "Nice camera!", "Author": "Mike S", "ReviewID": "R3B0N3EIIDCCMQ", "Overall": "5.0", "Content": "This camera gives a default of pretty saturated colors! The wife and I took it on our honeymoon, and it operated perfectly! Got some great shots, and we have used it several times since then with no disappointments. I swear I'm still nervous about putting it under the water (but I did anyway). It definitely has given us no trouble there!", "Date": "July 30, 2013"}, {"Title": "love it", "Author": "Marianne M Wear", "ReviewID": "REAKJREYJKJ3C", "Overall": "5.0", "Content": "Needed a camera for lots of water sports with extreme action. Color, speed, ruggedness all perfect from tiny grandkids learning to swim to adult kids doing wakeboard flips.", "Date": "July 24, 2013"}, {"Title": "Excellent all purpose camera", "Author": "David C", "ReviewID": "R2BPVYB2JCDHBT", "Overall": "5.0", "Content": "Does everything I want and more.  Underwater shots are cool.  Rapid fire pictures are good.  Fully acceptable with purchase of additional battery and charger.", "Date": "November 17, 2013"}, {"Title": "good buy", "Author": "aterry0809", "ReviewID": "R3T47U6H7L3KFZ", "Overall": "4.0", "Content": "Great to take to the beach....and other outdoor events. Bought it specifically for paddleboarding excertion worked out awesome! Small enough to fit in a clutch or my back pocket", "Date": "August 24, 2013"}, {"Title": "LOVE it", "Author": "cd2002", "ReviewID": "RI1C6N9KRDA95", "Overall": "5.0", "Content": "I have this camera in the lake,pool and just out and about and I LOVE it. I have even dropped it twice and it works great. Took it to the lake and it took great pictures, in and out of the water. I just hook it to my bathing suit and go. The downside is it sinks.. like a rock, so keep a good hold of it. I also knotted the hand strap in the middle so it would be a tighter fit on my wrist. I love taking it to the pool because the water is clearer than our lake and it takes Awesome underwater pictures. The kids would go under and I would just hold the camera under and click constantly, the pictures are so good; clear and colorful.  I can't wait to get them developed. As for battery life - I did notice that the battery dropped fast after I shot a short video, but I took over 100 pictures and didn't see the battery bar drop once in the picture mode. Overall every pleased with it!! I will say that it doesn't perform well in darker situations though, but I learned that if I just turned the flash on and left it on the pictures were much better.", "Date": "June 20, 2013"}, {"Title": "Not perfect, but I'm impressed with the Camera", "Author": "CV", "ReviewID": "R31LLO370UE3GC", "Overall": "4.0", "Content": "My wife and I didn't want to spend a lot of money but want to get something for occasions like waterparks/pools events that we would take the kids to. With that in mind i really would've just been happy if just the waterproof function worked and didn't care about taking pictures regularly with this camera. It SURPRISED me. Especially when taking pics simultaneously. I'm not a pro but that setting works well for things like rollercoaster (in my case going down a water slide). Pictures looked good when loaded on my laptop but I had to edit them a bit (all that stuff in my opinion really is a preference thing.) to get the colors to pop the way i liked it. Overall i think it was money well spent. I plan on using it for our next trip to the pool, waterpark, and experience with it more just taking regular pics. The camera looks nice and feels \"TOUGH\". Glad I made the purchase.", "Date": "August 29, 2013"}, {"Title": "camera for my husband", "Author": "Me", "ReviewID": "R2N3FKMJQEI6WF", "Overall": "4.0", "Content": "My husband has not used very much yet but he is happy with the product and it's featues.  Good stuff", "Date": "August 14, 2013"}, {"Title": "This is for Under Water Only.", "Author": "Alex A. \"Halekz\"", "ReviewID": "R2NV3U7ELZSBPB", "Overall": "2.0", "Content": "Only get it if you plan to take pictures Under Water.For regular indoor pictures is terrible! all blurry and lack of life.Under Water Only.", "Date": "November 13, 2013"}, {"Title": "Doesn't Work", "Author": "Shauna Murphy", "ReviewID": "R1V5N9TMZVI7I4", "Overall": "1.0", "Content": "This is a garbage camera!  Maybe mine is a defective one, but it keeps erasing my photos. It will then give ma a message that says \"Write Protect\" and won't let me take any more photos.  Any photos recently taken are deleted.  No menu option to let me try to correct the error either.  If you value your photographic moments, don't chance using this thing!", "Date": "December 14, 2013"}, {"Title": "Olympus came with damaged parts", "Author": "Christine N", "ReviewID": "R3LBMUA4NKWW3U", "Overall": "3.0", "Content": "The plug to charge it did  not work and we are attempting to get a replacement from17th street photo.  Not easy to communicate with and are taking a long time to respond.  I know that I am more likely not to get a working replacement rather than get one", "Date": "June 23, 2013"}, {"Title": "just buy at a store with warranty. malfunctioned", "Author": "Harry Bragg", "ReviewID": "R2GA5DD79DR6V6", "Overall": "1.0", "Content": "Great use out of it then dropped it maybe around 2 ft and screen no longer came on which makes it worthless. Thouroughly examined and saw water got into side compartment although it was secured shut and locked. Tried to return the seller denies it then sends me to an okympus site that charges $80 to fix it. Irresponsible seller.", "Date": "July 27, 2013"}], "ProductInfo": {"Price": "Unavailable", "Features": "Waterproof 5m/16ft, Shockproof 1.5m/5ft, Freezeproof -10C/14F, Dustproof\n12MP BSI CMOS Sensor, TruePic VI Image Processor, High-Speed Performance\n1080P Full HD Video, HDMI Output and Control, Multi-Motion Movie IS, 720/120fps High-Speed Movies", "Name": "Olympus Stylus TG-630 iHS Digital Camera with 5x Optical Zoom and 3-Inch LCD (White)", "ImgURL": "http://ecx.images-amazon.com/images/I/31gJg1yFn0L._SX300_.jpg", "ProductID": "B00AQ2BVTQ"}}