{"Reviews": [{"Title": "Do not purchase", "Author": "Hillary Goodwin", "ReviewID": "RO1XWICUE3UMZ", "Overall": "1.0", "Content": "Purchased this camera for my daughter for her 6th birthday.  It arrived, placed in new batteries, and it turned on once, allowed her to take one picture, and would not turn on again.  Replaced the batteries, even though they were new, and still would not turn on.  Bought this because it was reasonable price for a kids camera, but ended up returning and spending more.  Don't waste your time on this one.  Piece of JUNK!!!", "Date": "July 18, 2013"}, {"Title": "Unpredictable", "Author": "Davina Hunter \"dancing bookworm\"", "ReviewID": "R3GY9P0R7FZAMJ", "Overall": "2.0", "Content": "I loaded brand new batteries into the camera, turned it on, completed the set up screens (date/language options), took fewer than six photos only to see a 'low battery' warning followed by the screen going black.  I pressed the power button.  The camera powered on for a few moments and battery icons on the settings screen showed full power.  Then after a few moments it shut down without warning.  I tried the power, reloaded the batteries, and was successful twice in turning on the camera again.The camera was turned on for mere moments before the power indicators showed 1 bar on the screen.  The power \"on\" button is not responsive after one brief, initial use.  I changed batteries, reloaded them and have yet to turn the camera on with the power button.  I would not recommend this camera based on my experience so far.update:  The camera view screen is dead.  I tried to take a picture and the screen came up in a confetti pattern.  Reboot, new batteries, new card all failed to resolve the issue.", "Date": "February 4, 2013"}, {"Title": "Dreadful Little Camera", "Author": "K. Curley \"kcurley8\"", "ReviewID": "R1ARN4TYMB9SMO", "Overall": "2.0", "Content": "First of all, I had to return the first one of these cameras since when I first turned it on, I received nothing but ERROR messages.  The second one started up okay, and allowed me to input the time/date and was ready to go.  The problem?  Not so much the camera, but the ease of use (or should I say, LACK of ease).  You get precious few control buttons that control multiple functions.  This would simplify the camera IF THE INSTRUCTION BOOKLET CONTAINED ACTUAL INFORMATION.  You get nothing - less than even the most basic instructions on how to operate the camera.  For example, the camera is a 7.1 megapixel.  Yet when you first start it is set on the lowest (3 MP) setting.  So just change it?  Good luck with that.  Nothing in the 'instruction' booklet tells you how to do this (or much else apart from turning the thing on).  I guess you have to discover the camera's full potential by trial and error...a lot of error.  The menu screen is damn near impossible to navigate and the unit eats the AAA batteries it runs on.  Spare yourself a lot of misery...buy another camera.", "Date": "November 28, 2012"}, {"Title": "great kids camera", "Author": "Jennnifer A. Murphy", "ReviewID": "R28J58M80SBVRD", "Overall": "3.0", "Content": "easy to use and pretty durable so far. my 10 year old uses this camera primarily. it does eat thru batteries so i would suggest getting some recharge able batteries.", "Date": "January 7, 2013"}, {"Title": "Not worth the money", "Author": "Donna", "ReviewID": "R31H672LB3QP6U", "Overall": "1.0", "Content": "Total waste of money. Photos are extremely blurry. Do yourself a favor and purchase another product, sped the extra money.", "Date": "October 30, 2013"}, {"Title": "Don't buy it.", "Author": "Nola Baby", "ReviewID": "R3W2NJKGCRAFL6", "Overall": "1.0", "Content": "I took three photographs with this camera and it broke. For the price I guess I shouldn't be surprised but I thought we would at least get a few months use out of it.", "Date": "May 22, 2013"}, {"Title": "You get what you spend money", "Author": "Aref", "ReviewID": "R1G91B2RL4955S", "Overall": "3.0", "Content": "Spend more money and get a better camera. It gets more blurry pictures and some good pictures, and use a lot battery for videos.But I think it's OK for a $34 camera.I recommend spending more money and get a better one.", "Date": "November 28, 2013"}, {"Title": "BROKEN from the START!!", "Author": "WiseCrew", "ReviewID": "R3QSC3SZFDXIZ4", "Overall": "1.0", "Content": "This is the WORST camera I have ever tried!!  I WISH ZERO stars were possible... WHY force someone to give 1 star to something that never even worked... not even for 10 seconds?!One of my kiddos received this as a gift, but they didn't actually physically receive it until 1 1/2 YEARS after it was purchased for them, so no recourse for the thing being BROKEN right out of the package.What a JOKE!!For starters no clue is given as to which way to put the batteries in... so after 5 minutes of flipping them into several combos, I put 3 fresh batteries in & it started up... great, or so I thought.  It prompted me to enter the \"language\".  It's already set to English, but it would NOT allow me to hit \"set\" to accept that and I can't even get the thing to take 1 picture.  I tried 2 sets of batteries... I even tried 2 different brands & 2 different types... rechargeable VS standard... NADA, nothing!!So I decided to go to Google to see what I could find.  Much to my dismay (((sarcasm here))) it is a piece of garbage camera.  After I let my child try it herself (just so she sees it came BROKEN), which she will be VERY disappointed after, I will be throwing it into the garbage.  Thank you for crushing my kid's heart, Vivitar!!RUN AWAY from this joke of a camera... I would never buy a Vivitar anything after receiving this \"gift\"!!  In this case it truly was the thought that counted, because the camera isn't even worth a penny... piece of JUNK!!", "Date": "October 16, 2013"}, {"Title": "Good for casual picture taking", "Author": "J", "ReviewID": "RPZNJZ879926A", "Overall": "4.0", "Content": "It took time to get used to the distances and focus because it is slightly blurry.  But, it still took some clear and beautiful pictures, at somewhat different distances than the instructions stated.  The price fits me and I like it for my casual spare or kid's camping trips.", "Date": "July 26, 2013"}, {"Title": "Nice camera for kids.", "Author": "D. Sheppard", "ReviewID": "RV7BR4YLZPN58", "Overall": "4.0", "Content": "I bought this camera for my 13 year old to take to her band outings and snap pictures of her friends. It is very light weight, and colorful so it is easy to find if laid down among all the backpacks, purses and cell phones.I would recommend for all young ladies.Also easy transfer of the photos using the SD card (which you have to buy separate) and a cord, which comes with it.", "Date": "January 17, 2014"}, {"Title": "Second Vivitar Camera that didn't work", "Author": "S. Hansen", "ReviewID": "RRZQ312VE9349", "Overall": "1.0", "Content": "I guess this really wont be a very fair rating on this product but I got this as a gift for my daughter for Christmas.  When they opened the camera and went to use it, it didn't work!  Not happy with receiving a product that does not work.  This is the second time that I have purchased a Vivitar Camera and not have it work. Because of that I will NOT be purchasing Vivitar cameras again.", "Date": "December 30, 2013"}, {"Title": "Not High Definition.  Bottom of the Barrel", "Author": "Anthony M Farina", "ReviewID": "R5EKSPQXIO701", "Overall": "1.0", "Content": "This camera is listed as High Definition and I should have known better for the price.  The Camera is not high definition in any way.  I haven't seen pictures and video this grainy and choppy for at least 7 years.  The Camera feels like a toy and is a waste of money.  If you really want a high definition camera looks somewhere else cause this one fails miserably.", "Date": "December 26, 2013"}, {"Title": "Ok", "Author": "Qudratullah", "ReviewID": "RAYD4XCUZF4QC", "Overall": "3.0", "Content": "It's ok for the price I paid but not realy good quality the picture is not as good as it looks.", "Date": "December 20, 2013"}, {"Title": "garbage", "Author": "peter Oelslager", "ReviewID": "R1OPKWMKYA94B", "Overall": "1.0", "Content": "Don't buy this piece of crap.  I knew it would be kind of garbage because of the price and everything, but I thought it would be semi-decent to just get a couple cheap pics of some stuff sent to me overseas.  Honestly this thing is practically non-functional.", "Date": "December 15, 2013"}, {"Title": "You get what you pay for", "Author": "Akaheba \"MT\"", "ReviewID": "R1BHOKCANYES1Y", "Overall": "1.0", "Content": "I just wanted a simple little camera, nothing special.  So, I spend the least I possibly could for a digital camera.  Big mistake.  This thing is worse than a disposable.  For every 10 pictures I took, holding it as steady as possible, I still only got maybe 1 or 2 clear pictures.  Too Bad.  I didn't buy through Amazon sadly.  They would have refunded my money.  Purchased at Target, lost the receipt (even though I had used a debit card and they could have looked it up) but they said they can't accept the camera because I cut off the packaging--that horrible plastic packaging).  My mistake was not buying it on Amazon--the camera still would have sucked but Amazon would have refunded my money.  Anyway, I ended up buying a Sony Cyber-shot for 90 bux on sale and am much happier.  Do yourself a favor and just spend a bit more for a decent camera.  Even a kid would hate this thing, which is NOT worth 39 bux.  It's worthLESS.", "Date": "February 16, 2013"}, {"Title": "I love the Vivitar Camera", "Author": "cak3069", "ReviewID": "R2EKT3EKTWQ5VH", "Overall": "5.0", "Content": "It's just so easy to carry in my pocket and walk around, shooting nature scenesI recommend this camera to anybody who loves digital photography and would like a camera that's easy on the budget", "Date": "September 18, 2013"}, {"Title": "Not recommendable, did not work, very disappointing.", "Author": "Nina", "ReviewID": "R15LQUKMC6G1BF", "Overall": "1.0", "Content": "Didn't even work for two days, it was my 7 year old only wish for her Birthday. She was so disappointed.", "Date": "November 28, 2013"}, {"Title": "Not bad", "Author": "Mojo", "ReviewID": "R12IYLP34BWLH", "Overall": "2.0", "Content": "But no memory card and no warning that it does not come with a memory card.thank you very much", "Date": "March 12, 2013"}, {"Title": "gift item", "Author": "Mary Phillips", "ReviewID": "R2YVXRVU4Z9IJG", "Overall": "5.0", "Content": "This item was given to church for the giving tree at Christmas.  I hope she liked it.  It was reasonably  priced.", "Date": "January 1, 2013"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B00AAHT4ZA"}}