{"Reviews": [{"Title": "Handy and light", "Author": "netski", "ReviewID": "R5U02VWYCLOYA", "Overall": "4.0", "Content": "My camera arrived so fast .. barely a week . this is the fastest delivery I got. !Was so excited to have this camera. It was so handy and light. Since it was a package, at least i already have the lens in it. I had a great time taking good pictures although i have to get use of the settings but frequent use made me good now. Initially it was quite hard to put the flash but a friend taught me how to it right..now i dont have a problem with it. Using the different lens was a great fun.. Am looking forward for my another weekend off for another photoshot trip.Yes, i was so lucky to have this camera. I love it.", "Date": "March 3, 2013"}, {"Title": "A couple of glitches", "Author": "Nicki Brockamp", "ReviewID": "R32BN8F10ETYAU", "Overall": "4.0", "Content": "We were excited to get our camera but realized right away that installing the software for it wasn't going to be easy. It took me days of searching the web, reading people's suggestions and finally phoning Olympus to spend quite a bit of time on the phone trying to sort out the download for Windows 7.The manul is extremely lacking for beginning photographers. More detailed explanations for scene selections, when to use things like Landscape vs Landscape Portrate would be very helpful.The only issue we've had with the camera itself, is the flash insersion. It's very difficult to fully insert the flash, to the point where we're always worried we're going to break it due to the force required. It usually takes a few tries and a bit of frustration to make it work.The camera has taken some beautiful pictures though. We don't know much about cameras and have mostly been taking pics in auto settings but we're working on our skill level.The kit and lenses are great, although I'm not sure what all the stuff in the kit is. I'm sure we'll figure it out one day.", "Date": "February 3, 2013"}], "ProductInfo": {"Price": "$539.95", "Features": "KIT INCLUDES 14 PRODUCTS -- All BRAND NEW Items with all Manufacturer-supplied Accessories + Full USA Warranties:\n<1> Olympus PEN E-PM2 Digital Camera Body & 14-42mm II R Lens (Silver/Silver) + <2> Olympus M.Zuiko 40-150mm Lens + <3> Transcend 32GB Class10 SD Card +\n<4> Spare BLS-1/BLS-5 Battery + <5> PD Mini Sling Backpack + <6> .45x Wide & 2.5x Tele Lens +\n<7> Zeikos 50\" Compact Tripod + <8> Vivitar 37mm UV Glass Filter + <9> Vivitar 58mm UV Glass Filter + <10> PD 6pc Complete Cleaning Kit +\n<11> PD SDHC Memory Card Reader + <12> PD Memory Card Storage Wallet + <13> LCD Monitor Screen Protectors + <14> Image Recovery Software", "Name": "Olympus PEN E-PM2 Digital Camera Body & 14-42mm II R Lens (Silver/Silver) with 40-150mm Lens + 32GB Card + Backpack + Battery + Tripod + Lens Set + 2 Filters + Accessory Kit", "ImgURL": "http://ecx.images-amazon.com/images/I/61nxdpK0vcL._SY300_.jpg", "ProductID": "B00A25KUE4"}}