{"Reviews": [{"Title": "Made especially for BestBuy for Black Friday 2012", "Author": "Yarii", "ReviewID": "R2FM3D2WOYSZXK", "Overall": "4.0", "Content": "This is actually a Nikon S9100  Nikon COOLPIX S9100 12.1 MP CMOS Digital Camera with 18x NIKKOR ED Wide-Angle Optical Zoom Lens and Full HD 1080p Video (Black)  specially made for BestBuy's loss-leader deal for Black Friday 2012 ($99) which you can also buy today as long as they still have some in stock. The only difference is Nikon tweaked the optical zoom down a bit--but other than the zoom being a little shorter, the cameras are the same.There's nothing at all wrong with this camera, I'm surprised at the ratings, but some people buy these not knowing how to properly take a photo. I was reading some of the reviews for this camera on BestBuy's site and determined some people post reviews that know nothing about cameras and shouldn't be rating them. I know, we all have to start somewhere....I paid my \"ignorance dues\" in 2003 when I got my first digital camera. It seems most are complaining about blurry photos when they aren't allowing the camera to focus. (press shutter button halfway, wait for the beep and the green dot, then press the shutter fully). And above all, read the MANUAL!!!This is a fine basic point and shoot camera for the ridiculous price of less than $100. Quality build, takes excellent photos outdoors (most do), indoors good as long as you use the flash-otherwise some things can be a little noisy, but for the most part, good. Good battery life, acceptable shutter response, ok HD video and a CMOS sensor! You really don't need more than 12 MP, especially when the sensor size in most of the cameras in this range (and even into the $400-$500 range) is small itself. Some complain about the manual pop-up flash, but I am liking this more and more on my recently purchased cameras -- YOU choose when you want the flash, not the camera where it may overexpose your shot.I bought this ahead-of-time for a relative's upcoming birthday, but decided to test it first before wrapping it up.You will need extra memory, this is a good card to use and it's inexpensive:Transcend 8 GB Class 10 SDHC Flash Memory Card (TS8GSDHC10E)(No, you don't need a Nikon card, I even spotted a reviewer on BB's site giving this camera 1 star because he/she couldn't find a NIKON card for it (sorry, but I wish I had a shaking-head icon to insert).", "Date": "March 16, 2013"}, {"Title": "Mixed Bag", "Author": "venky", "ReviewID": "R1DATXYEKT43WL", "Overall": "4.0", "Content": "Pros: Features (truckloads of them), does not touch up photos, great range of focal length, reasonable low light performance, flash does not flatten out colors in the pictureCons: Image Stabilizer is slow, focusing system is slowOthers: camera is bigger than normal, has sturdy build and is easy to handle.That means that the lens quality is good, and photos have good detail. Camera won't touch up right after the snap, so you will feel that photo quality sucks. If you open in a laptop or take a print out, you will be definitely surprised with the quality, detail and its closeness to real life colors (almost all Sony cameras seem to touch up the picture to enhance colors while the picture is being saved).Camera has touch up options built into it. The number of modes is stupendous and needs you to read documentation. Give yourself time get used to this camera or to read documentation. Otherwise, you will be disappointed.I have owned it for almost a month now, went on a vacation and have used it for Christmas gathering.I would have given it 3 stars if not for its low light performance, which I believe is reasonably good for a travel camera. You can employ the flash without the risk of flattening out the picture.EDIT:I got this for BF from BestBuy, so got it for a good deal. I probably will not spend more than hundred and fifty for this one.", "Date": "December 26, 2012"}, {"Title": "Love it", "Author": "Ace", "ReviewID": "RKK5HRRD3BPA9", "Overall": "5.0", "Content": "I've had Nikon cameras before and I really like the make. User-friendly, Good optics, always.The camera itself is heavy for its size, but fits well into the hand. My former camera, a Fuji was bulkier but lighter, because of the plastic components, some of which fell off....., so I respect the heft of this Nkon Coolpx S9050. The controls a-aplenty are for me to learn about and  get used to. The manual that comes in the box is good for starters but there is a 200+ page manual online that IS quite comprehensive. There also is software. I have yet to install it, as my puter is a used one that I bought for $200 so I don't hold any high hopes for this process, but will get back to this review after I attempt to install the software.The Nikon Coolpix S9050 is a winner with me. It is compact, fits in a pocket, and replaces my faithful 9 year old Fuji (and its identical twin, which was a workhorse, but had some plastic parts (the same ones) that literally fell off both after a while).The only thing I need to get in duplicate will be the charger. No batteries in this Nikon to replace, so I can't carry any spares, which is what I'd do for my Fuji, but I don't want to get caught with a low system when I'm not home.", "Date": "April 29, 2013"}, {"Title": "Okay....Better out there", "Author": "Jore", "ReviewID": "R32NT1K1PBJESO", "Overall": "3.0", "Content": "This camera has many options and it records HD video (1080). Going to get straight to the point in my review. Read many bad reviews about the picture quality. Thought I'd take a chance because for the price, you get many options. Bad mistake. In \"auto\" mode, you expect a great picture. With this camera, maybe 35 out of 50 pictures were decent. I also own a Canon DSLR camera and wanted a small point and shoot for those quick shots and so I wouldn't have to lug around my DSLR all the time. I have a baby on the way and needed something I can pick up real fast to take a quick shot and be confident in the quality. With the Nikon S9050, I believe you can get that quality you want but you have to mess with the settings, as it has many. For me, if I want to mess with my settings to get a great picture, I'll use my DSLR. With my DSLR I can get an AWESOME picture. With a point and shoot, I wanted a GREAT picture. Sadly this model didn't give me that. I purchased at a local merchant and returned it the very next day.", "Date": "January 26, 2013"}, {"Title": "Extremely Disappointed", "Author": "Shauna Cordaro", "ReviewID": "R2D1LN6WQRHKXX", "Overall": "1.0", "Content": "I am lucky if maybe 1/4 of my pictures turn out. Worst camera we have owned thus far. Extremely disappointed.", "Date": "November 25, 2013"}, {"Title": "Save yourself", "Author": "Annoyed to say the least", "ReviewID": "R3BR3P1UMQPH5U", "Overall": "1.0", "Content": "Crap crap crap... bringing it right back in the morning, the delay on this is ridiculous!  The quality of photos on \"auto\", try again not worth the great \"bargain\" it appears you are getting!", "Date": "February 24, 2013"}, {"Title": "Don't be fooled by the features", "Author": "Rodrigo Cavalheiro", "ReviewID": "RFDO4S3Y3G8P8", "Overall": "1.0", "Content": "This camera is full of great features but most times that are not ready for \"point and shoot\".Zooming while recording video goes throught a blurry path and pictures are not that good. My 7.1MP Canon PowerShot SD1000 takes pictures far better than this Nikon.This camera doesn't deal very well with light. Scenes with partial light and partial shade are mostly unrecognizable.Menu options are not clearly and there are no manual settings in the menu, only presets.I don't recommend this camera. Don't waste your money with Nikon. Go for a Canon.", "Date": "December 14, 2012"}], "ProductInfo": {"Price": "Unavailable", "Features": "Screen Size: 3\"\nScreen Features: LCD with 460K dots\nMegapixels: 12.1MP\nImage Resolution: 4000 x 3000\nOptical Zoom: 15x", "Name": "Nikon Coolpix S9050 Digital Camera (Silver)", "ImgURL": "http://ecx.images-amazon.com/images/I/417o4ShWbML._SX300_.jpg", "ProductID": "B00ADGXXJ6"}}