{"Reviews": [{"Title": "great pocket-sized point and shoot", "Author": "Jim", "ReviewID": "R24WWRLCPWEAJ8", "Overall": "5.0", "Content": "Love this camera!  Takes great low-light photos (with or without flash) and has some great features.  Took it out golfing the other day and using continuous shutter mode it actually caught full swings frame-by-frame.  Very high quality pics too, when I uploaded them to the computer you could make out tiny details in a big picture - like the logo on my golf ball!  In addition, they dual purposed the gyro sensor in the camera that helps stop blur t so you that while reviewing series of shots you can tilt the camera to cycle through them making almost a miniature movie of your pics.Panorama works well and is super easy - no pausing in between frames, just keep moving the camera.  Love the full 16:9 aspect ratio of photos as well.  Wifi works great too - very cool and easy to send the pics right to your smartphone (which lets face it, is where most of us keep our photos now) for storage and uploading to sites like facebook.It is really small though which makes it great for putting in your pocket or taking it out with you, but also makes the buttons a little close together.  Takes a little getting used to.When purchasing this camera it came down to this and the Elph 130.  I liked the buttons and simpler of the layout of the Elph better, but I think I made the right choice with the wx80 - full hd videos, excellent low-light capabilities, panorama and a faster frame rate.  Plus it charges by micro-USB without having to take the battery out of the camera - you can just use your phone charger.I've read some issues about battery life, but I haven't had any yet.  We took over 50 photos golfing in like 30 minutes and lost about a quarter power - and that's with a lot of screen time reviewing shots.  I purchased a bundle with an extra battery pack just in case though.I highly recommend this camera.  Sorry for the long review, but when I was debating between cameras there weren't a lot of good detailed reviews, so I thought I'd try and help out.", "Date": "May 3, 2013"}, {"Title": "Super tiny - almost too small - but big on features", "Author": "Yarii", "ReviewID": "R59E9PQQUSYP4", "Overall": "3.0", "Content": "NOTE: I ended up returning this camera. It was a little too tiny for my liking, and I also had an issue of it losing my password on occasion.A couple years ago I tried a Canon Elph -- this camera is similar in size, so if you have large fingers, you may have trouble using the controls. It's so small, Sony went back to a smaller 2.7\" LCD screen when they've been using 3\" screens on most of their latest cameras.There is no control mode knob on top. Everything is set via menus, however there is a dedicated Movie Button.No touchscreen. I knew it didn't have one, but some web sites like Snapsort, where you compare various camera models, are saying this DOES have a touchscreen. That is incorrect.The Menu Button is no longer a round easy-to-push button, it almost looks like a rocker switch with the Help/Delete button right below, as best I can tell they are separate, but touching, buttons. The Menu Button is hard to push without touching the Control Wheel, and vice-versa.  Especially so if you have short fingernails. You almost need a stylus, not kidding!This camera is made in China. I have other Sony cameras also made in China and I've had no problems with them; I think part of my problem with this camera is it's so tiny and feels more fragile than the others - such as this one, one of my favorites but much larger/heavier and harder to carry in a small bag: Sony Cyber-shot DSC-HX10V 18.2 MP Exmor R CMOS Digital Camera with 16x Optical Zoom and 3.0-inch LCD (Red) (2012 Model).I started to return this when I thought Sony had included the wrong size micro USB. Well, stupid me! I was trying to insert it into the bottom of the camera where the HDMI cable goes because I hadn't noticed the small door on the side. The charging hook-up is behind one of those rubber flap doors on the left side of the camera (as you are facing the lens). I hate those rubbery doors as they easily break off after using them for awhile, so I will buy a separate battery charger.The battery charges inside the camera via the micro USB cable and the AC adapter which are both included. Not a big deal as most all new cameras come this way now,  the manufacturer saves money since they don't have to provide a separate charger. You can also charge it without the AC adapter, by plugging it into your PC, but that will take longer.I've finished with the \"Cons\"! Let's move on to the good things.Super-fast at start-up, focusing, and processing to take the next photo, due to the Bionz processor.Decent pictures, especially outdoors, but most cameras are this way - I am not a pixel peeper but you shouldn't be with a camera like this. To a normal person, the photos this produces are fine. Although these photos aren't as good as what I get from my Sony HX10V, but it costs a lot more and it's a larger camera (see link to that camera above).Superb movies! Sony amazes me with their ability to make cameras where the videos are so much better than others.Battery Life: Some complain, I think it's pretty good. I have taken over 150 photos and 10 movies since I got it and the battery symbol is at 1/2 remaining.8X optical zoom, not as much as other cameras, but even if you use the Clear Image Zoom (digital but better than most) you can go out to 16X zoom.16 MP - this is still a little high, but I'll take it over a 20 MP camera with a small sensor.Wi-Fi - If your router has a WPS Push Button it's easy-peasy to set up (my Cisco Valet has the WPS button, but I'm not sure if other routers have this button as my only router experience is with Valets). After you have the PlayMemories software installed, you have to \"one-time\" connect the camera to your PC and set up the SSID/password. If you have the WPS Push Button, you press your router button first, then get into the menu on the camera and press Wi-Fi Push. It takes a few minutes to completely connect, but once you've done that, you're good to go. It also takes a long time to transfer photos. If you don't have the WPS Push button on your router, you have to enter everything manually like a keyboard on your LCD screen. You can also use your SmartPhone as a remote control to take photos but I haven't tried that yet.Special effects:  Love the watercolor and illustration effects, which you apply in the playback menu, and it also saves your original photo.EASY setting - perfect for older people who want limited choices and feel overwhelmed with a digital camera.Conclusion: If you are looking for a tiny camera that you won't even notice if it's in your pocket, this is a good choice...but don't expect the Wi-fi to work perfectly and grow your nails longer for the tiny buttons.", "Date": "May 14, 2013"}, {"Title": "Easy but Powerful", "Author": "Sergio Zavarce", "ReviewID": "R2ODRSBL4GBMYP", "Overall": "5.0", "Content": "Its a great package since it has so many features in a very light and small camera. Zoom and focus work great, panoramic pictures are very easy to take.I bought it because I always wanted a good point and shoot for low light situations, and since it was one of the features advertised I wanted to give it a try, and I am very satisfied with them. Low light pictures are very good, even when you do not use the flash, can still get a good picture at night, with not so much light around.My only complains would be that it does not come with a separated battery charger (but it is optional), and the HDMI cable is not provided. I know is not such a big problem since you can buy them, but it would be nice to receive them with the camera (just like the canon sx260).", "Date": "March 24, 2013"}, {"Title": "Great new Sony camera for 2013.  Here's a rundown after my first week...", "Author": "E. Tucker", "ReviewID": "R237SUYEBDLDOT", "Overall": "5.0", "Content": "This is Sony's new Cybershot for 2013.  It is a very powerful and compact device and after using it for a week it performs much better than my older Sony model in overall speed and low light conditions.  This is due to the upgraded processor and the upgraded Exmor R sensor.  This new model has an 8x zoom which is an upgrade from the 5x of the previous model which is a welcome addition.  One of the newer more cutting edge features is the built in wifi.  This lets you transfer pictures to your computer, your iOS or android device, or use your iOS or android device to remotely take pictures and it works flawlessly.  Another fun feature are the \"Beauty Effects\" which are built into the camera. They include skin tone changing, eye widening, and teeth whitening.  These aren't only easy to use, but they actually work surprisingly well.If you are looking to upgrade your camera and $200 is your pricepoint; the WX80 is a great choice for a full featured point and shoot for 2013.If you wanted a bit more zoom (20x), a slightly bigger screen, and a bit more megapixels (18MP) your next option is the April release Sony seen here.http://www.amazon.com/gp/product/B00BEHQKPW/ref=as_li_ss_tl?ie=UTF8&camp;=1789&creative;=390957&creativeASIN;=B00BEHQKPW&linkCode;=as2&tag;=stupisms-20Of course, when you're ready for the big leagues it's time for the RX1 which was voted the best camera of 2012 by many enthusiasts.http://www.amazon.com/gp/product/B0097CXFCC/ref=as_li_ss_tl?ie=UTF8&camp;=1789&creative;=390957&creativeASIN;=B0097CXFCC&linkCode;=as2&tag;=stupisms-20", "Date": "March 26, 2013"}, {"Title": "Ahhh yes!", "Author": "Kat", "ReviewID": "R2XQY2J1DY8ESE", "Overall": "5.0", "Content": "I chose 5 stars because it really takes such lovely pictures, even just on the automatic setting. I am still learning but everything about it, is great. The quality and weight you can feel simply by holding it in your hand. The powering on function is really fast! As soon as I tap it, it's on and ready to snap away! The macro function comes on automatically when you are very close to something...hopefully I find an actual button for it but I haven't yet. The flash is powerful, but doesn't wash anything out. The backlighting feature that it is so well known for is also incredibly good, I can take pictures in such a dark room without flash but still don't need to brighten the picture later. I haven't had a camera before that didn't need that. The zoom is also really nice, you can get very close with it and you don't lose too much quality in the picture.Over all I love this little camera, it is exactly what I needed at this point in life, and great for the money.", "Date": "May 14, 2013"}, {"Title": "Nice Camera!!", "Author": "Rohit Pande", "ReviewID": "R1FK0QXEMP54Q9", "Overall": "5.0", "Content": "What i like most about it is the Carl Zies lens .... the picture quality is very good & its very small & Handy.", "Date": "April 25, 2013"}, {"Title": "Beautiful pictures indoors and out - stabalization is amazing!", "Author": "Matthew S. Martinez", "ReviewID": "R2PUYMNFUR7Z3D", "Overall": "5.0", "Content": "I've had this camera for about 2 months now and have taken it to several events and parties. I get great shots even with difficult lighting situations. Pictures are beautiful and the features on the camera are easy to use. This camera is not just for the laymen, but gives enough options to foster the creative process. The HD video is impressive, but can lack clarity when zoomed in. When sharing from the camera screen, everything is clear and crisp. Pictures look great even on the big screen. The size is perfect to fit in a pocket or purse and is very light. I would recommend this camera to a friend for sure.", "Date": "June 14, 2013"}, {"Title": "This being a new model is full of features", "Author": "Vic Hett", "ReviewID": "R1M3PWEIE3S23T", "Overall": "5.0", "Content": "This camera is loaded with more features than I expected and takes wonderful pictures.  Very easy to figure out the camera settings menu for ease of use..I did a battery upgrade and would recommend this to be very worthwhile especially with the dual voltage charger..", "Date": "April 6, 2013"}, {"Title": "lack of customer service", "Author": "Marla G.", "ReviewID": "R3JGDFZH3TPT80", "Overall": "2.0", "Content": "This camera broke literally 2 days after I got it.  The view screen became filled with white \"holes\" that you couldn't see through.  I returned the product as was directed me, and so far, (a month later) it still has not been credited to my account or have I been notified of its arrival back to them.  I am so so disappointed in Sony and Amazon for failure to communicate effectively.", "Date": "January 7, 2014"}, {"Title": "Very nice camera for everyday companion", "Author": "Mario Lopes", "ReviewID": "R13AVWMY8MVIYR", "Overall": "5.0", "Content": "I don't ordinarily start a review with my summary and conclusions. But I am going to here since there are a number of lengthy reviews and if you want my bottom-line here it is. Sony created a remarkable high performing point and shoot in a very small and relatively light weight body with fantastic battery life. The most outstanding features to me are the very fast shutter and autofocus (rivaling DSLRs), vibrant and accurate color reproduction, good Wifi and smart phone control, and astounding low-light performance. Where the camera falls a little short is with background defocus  and very good but not great video performance. Overall though this is a great take everywhere, in the house, everyday companion and is recommended.", "Date": "March 29, 2014"}, {"Title": "Excellent little camera!", "Author": "VaVet96", "ReviewID": "R1OJQX05CSME5", "Overall": "5.0", "Content": "Just took this on a vacation where I shot over 700 pictures.  Easy to use with amazing quality in both high and low light situations.  I often turned off the flash indoors and got beautiful pictures with a lot more character than if I'd used the flash.  The cameras small size is both a blessing and a curse.  Very easy to slip into any pocket.  However, if you have very large hands as I do, you'll find yourself accidentally changing settings on the very sensitive control wheel. Getting better with practice, but I never had to worry about that with the slightly larger Canon this one replaced.  The viewing screen on the back of the camera is amazingly clear and accurate. I've only had this for a few weeks now so I can't comment on long-term durability, but so far, I'm very happy with it.", "Date": "April 7, 2013"}, {"Title": "Terrible Battery Life", "Author": "Amazon Customer", "ReviewID": "R3U6X2GTL6IXCM", "Overall": "2.0", "Content": "I'm flabbergasted by the lack of battery life.  When battery died after 30 minutes of use, I thought I had a dud, but apparently this is how long the battery is supposed to last for ordinary shooting (according to the manual).  I can't believe Sony engineers ignored this.  It makes the camera a novelty item, rather than a viable camera (maybe the idea is you bring this AND a camera with a normally functioning battery?).  I don't get it.  There's no workaround either.  You can't plug it into an external power supply.  When a USB cable is attached, all functions are disabled except browsing, and unlike the Handycam-line, there aren't other battery sizes to attach.  The battery compartment will only fit this tiny and inadequate battery.  Terrible.  Terrible.  Terrible.", "Date": "April 18, 2013"}, {"Title": "Wow!", "Author": "Peter B.", "ReviewID": "R1002DBICCTX81", "Overall": "5.0", "Content": "This little point and shoot can barely fit in my hand, but the pictures are amazingly beautiful with detail, color and sharpness. I purchased a spare OEM Sony battery and charger also including the silicone rubber case. Please spend the extra couple of dollars for the sony battery, yes you can buy aftermarket cheaper, but read the reviews do you really want your battery to not hold a charge, melt, ruin your camera or catch fire?  The other reason I would recommend a spare battery is the usb charging is fine, but the little door cover for the usb plug does not seem well engineered and the silicone cover has to be removed if you want to charge it that way. This is something they should have realized, extra steps, it's a pain actually. With the spare battery you only have to pull down one side of the silicone case to pop in a new battery much quicker and easier. The camera is apower house with all its features, truly amazing, wifi, wifi to tablet, phone, or tv to view pictures is pretty cool. The HD video is awsome for this little thing but, yes there is a but! If you are running updated software and the latest hardware you will be fine to view video in 1080p on your pc with play memories software. (You have to download seperately, no disc) if you do not have the latest and greatest and want to play video on an old system 5 years or more with lower than recommended hardware, play back will not be smooth and will skip and jump. The solution is to record in standard SD to eliminate the stutter and skipping. We took hundreds of pictures during our Floriday trip and really gave it a workout at Bushgardens. The zoom was very good and the pictures did not come out blurry like my last camera during motion events, which was my primary complaint with my last camera and one of the reasons I bought this. Colors are vibrant and truly pop, all I can say is for it's size and price im truly satisfied.", "Date": "September 21, 2013"}, {"Title": "really fast!  great pictures!  really small!  ... a little flimsy???", "Author": "fluffymustdie \"fluffymustdie\"", "ReviewID": "R8TCO5ZERFY2W", "Overall": "5.0", "Content": "Not SLR fast, but this is a true point and shoot camera; not a point, press the button, wait, then shoot camera.  The lag between pressing and shooting is barely noticeable.The flash turns on when it needs to, and the camera does a great job knowing when it needs the flash.  Half of the picture can be bright blue sky, but the flash will pick up the other half wonderfully!  ... and still with negligible lag between pressing and shooting.This is a 4.9 star camera.  The .1 is a preference thing... I would actually like a bigger case so that I do not feel like I am about to drop every time I turn it on.  And it does feel a little plastic-y, which makes me more afraid to drop it.I usually say you get what you pay for.  I feel like a got a lot more.", "Date": "June 12, 2013"}, {"Title": "It's not perfect, but for the size, the zoom, the low light performance, the price - it deserves 5 stars", "Author": "Golfing Fool", "ReviewID": "R1BF3RUR9YN8GB", "Overall": "5.0", "Content": "I have a Fuji HS20EXR - I love it.  It is the perfect bridge camera for me.  But I have been searching ---- forever --- for that tiny camera that does well (not perfect --- come on, let's get real) in low light.  This is it!I do not own a DSLR so when reviewers talk about how they wish there was RAW capabilities, I kind of tune out.  I am that amateur who just loves to take a good picture, using macro, or one in low light, or zooming in on my neighbor's flowers and having it look like a magazine photo (though not enlarged to show any potential flaws).I struggled to get the wi-fi going; had to call Sony customer chat room; 1 hour --- I couldn't find enough info in the manual nor the play memories download to explain how to get wifi going to send pics from the Sony WX80 to my Iphone 4S.  (Maybe the readers are smarter than me.)Some tips (I hope I remember the all the steps):  Download play memories to both Smart phone as an ap and PC computer (for wi-fi capability to both), Go to Camera and go to the icon that looks like a suitcase which is shooting settings.  Move down to WPS push and sync with your wi fi.  You will have to enter your I Phone Password.  Then make sure under Iphone Settings - you show wireless as on and a new WiFi choice.  When you want to send a pic to your Iphone; you hit playback, Wifi, select Image (or images), then go to your iphone and make sure right wireless address is chosen (under Iphone settings wifi) and also make sure you open play memory ap and choose connect. THEN it works.After walking me through this; then the SONY Customer Service sent me this link which I had not found on my own:http://support.d-imaging.sony.co.jp/www/disoft/int/playmemories-home/operation/import/wi-fi-cyber-shot.htmlAs long as I use it occasionally, I should remember that there's three parts to downloading - send from camera, click the right wi-fi choice on your phone and then open playmemory ap on phone to connect. Please --- if someone thinks this is easier than I have laid out - feel free to comment but, please, don't judge. I've done my best.And even after all this:  I've had fun sending pictures to my iphone and I still rate the phone 5 stars for all the reasons listed above.  The pictures are pretty great for the size & price!", "Date": "June 7, 2013"}, {"Title": "Love the camera...", "Author": "S. Sundberg \"Sue\"", "ReviewID": "RST2VX76UR1AM", "Overall": "5.0", "Content": "Love the camera.  Takes awesome pictures and great videos.  Small enough to tuck in anywhere to keep it handy for the impromptu shots.  Clear action shots.  Good battery life.... love the stability qualities....Completely satisified with my purchase.", "Date": "June 3, 2013"}, {"Title": "great camera", "Author": "Melissa Simonson", "ReviewID": "R1NEPIOO51AX7Q", "Overall": "5.0", "Content": "this is a very small camera,LOVE that! takes great pictures even in low light it really brightens everything up, only down fall would be battery life, if you use it for extended periods of time you will need extra batteries, but this is minor, I bought a great starter kit that had 2 extra batteries so all is well.", "Date": "February 20, 2014"}, {"Title": "Great Lens", "Author": "UpsetBoner", "ReviewID": "R3W2GOPO3XRVW7", "Overall": "5.0", "Content": "The Carl Zeiss lens on these really set them apart from similarly priced cameras. Get your hands on one before they stop making them!", "Date": "January 30, 2014"}, {"Title": "got it as a gift for my wife who likes it because it is simple to operate", "Author": "DanL", "ReviewID": "REH9NLU1QMTPX", "Overall": "5.0", "Content": "but it still has a lot of flexiblity in taking a lot of pictures.  Takes great videos with good sound", "Date": "January 23, 2014"}, {"Title": "Nice Little Camera", "Author": "Nat_M", "ReviewID": "RT47ED6U7UDGK", "Overall": "5.0", "Content": "I have a big DSLR Canon 60D camera and wanted something smaller that will provide a comparable quality pictures for trips when it's not suitable to take the big camera. I found my almost ideal mini camera. It takes nice pictures even in the low light and it has a lot of interesting effects. Has a Wi-Fi, location and takes very good quality HD videos. Zoom is very nice for this camera size as well.One thing that I do not like is the miniUSB slot cover. Need to be very careful when opening and putting the miniUSB cable in, it seems to be really fragile.", "Date": "January 10, 2014"}, {"Title": "cute little camera!", "Author": "Colleen", "ReviewID": "R29RHUCEVBU3ZZ", "Overall": "4.0", "Content": "I got this camera to replace my 5 year old  7mp cybershot. I chose to stay with Sony because I never had any issues with my older camera and I like how the controls are set up so I didn't have to relearn how to take pictures before going on vacation. The camera is great - very quick start up to capture time, great detailing in pictures, and little to no blur on most shots. I decided to finally get a new camera because of the slightly greater zoom and the CMOS processor that's supposed to be better in low light and a little steadier than older processors. I can't say I've had any trouble learning features or taking great pictures (even through screen windows, at night!), however I still don't have consistently great pictures in low light and some of my low light pics are tinted either yellow or purple - a draw back that I experienced with my other cybershot as well. It also advertises 360° panorama but I haven't been able to figure out how to get it to go through more than about 180° however this may be something I'm doing wrong.", "Date": "July 25, 2013"}, {"Title": "Best Point-and-Shoot Camera I've Owned!!", "Author": "RoboticDolly", "ReviewID": "RTPLVHU8QFRJR", "Overall": "5.0", "Content": "It's a small camera that can easily fit in your pocket or in your purse.  It's even smaller than my phone!!  My phone isn't huge by any means, but the camera is a bit smaller than that.  The camera itself has MANY 'Scene Modes' to choose from.  From Anti-Blur to Night-Scene to High-Sensitivity... It has practically every basic mode there is to use with a small point-and-shoot camera.  I personally love the Anti-Blur Mode on the camera, since my hand is normally VERY jerky, resulting in blurry photos.  And the Anti-Blur is just what I needed.  My boyfriend has VERY sensitive eyes.  Whenever I use the Flash on the camera, he's always squinting or has his eyes closed.  So the Anti-Blur Mode will help take No-Flash photos with Anti-Blur, of my boyfriend and myself, so the photos will come out beautiful every time!  But it also does great capturing sunsets, nature, items you're trying to sell online... It's a great camera for everything.  Sure, the camera isn't going to replace your DSLR cameras out there, since those are professional quality cameras, and this is just a small camera for basic stuff.  But the photos still come out beautiful.  I've always been a fan of Sony products.  I've never had a problem with ANY of their products before.  And this is no different.  As for those of you that love to take videos of your children, pets, or whatever, this camera even has an Anti-Blur Mode for videos!  Which is great for those videos where there's a lot of movement in!My old camera was a Canon PowerShot A2300 camera.  It was a 16MP camera with a 5X Optical Zoom, but it didn't have a Mode for Anti-Blur, nor did it have any sort of Image Stabilization.  So whenever I took photos without the Flash on, the photos would ALWAYS be blurry.  Even though my Canon camera was a 16MP, and the Sony camera is a 16.2MP, the Sony camera takes MUCH better photos with and without the Flash.  I'm sure that .2MP doesn't make much of a difference, but I think the Carl Zeiss lens on the Sony camera definitely helps boost the image quality.  Which is WONDERFUL.It is a bit weird how you go about charging the camera battery, though.  Most companies include a charger that has a slot to stick your battery in, then you plug it into a wall socket.  Even older Sony cameras used this method.  For this camera, you plug the charger into a wall outlet and connect the USB cable from the charger to the camera.  And it basically charges the battery INSIDE of the camera.  Kind of reminds me of the mp3 and mp4 players that they make nowadays, where you have to plug them in to charge them.All in all, this camera is GREAT!!I'm not sure why so many people are rating this camera 1 star, due to the packaging and the delivery.  I thought the review was supposed to be for the CAMERA??  And the packaging and delivery has NOTHING to do with the camera itself.", "Date": "May 16, 2014"}, {"Title": "Great pictures", "Author": "Jeanne", "ReviewID": "R2NMA58NVQVH2X", "Overall": "5.0", "Content": "Took the camera when we went on vacation to Alaska - the pictures turned out great & the beautiful scenery shown through on every picture", "Date": "April 23, 2014"}, {"Title": "Great lightweight camera", "Author": "CarolynP", "ReviewID": "R3FKNPYZDJNGL7", "Overall": "4.0", "Content": "Picture quality is great. Can't believe how a light and small it is. Not that intuitive though and still haven't had time to figure out how to wirelessly transfer photos. Should be a bit easier. Overall I like it.", "Date": "March 19, 2014"}, {"Title": "Great camera!", "Author": "Teach 172 \"Teach172\"", "ReviewID": "R2TFTD3Q92QI3X", "Overall": "5.0", "Content": "Easy to use.  Lots of megapixels.  Fantastic selection of scene modes. I love the scan panoramas!  Small enough to fit in my wife's purse!", "Date": "March 5, 2014"}, {"Title": "Remarks", "Author": "Robert", "ReviewID": "R6TQ9YVLZ7FPN", "Overall": "5.0", "Content": "Camera as expected and small enough to slip into pocket. 16.2 MP excetional for this size camera with plenty of feature as larger SLR cameras. Takes great photos with little effort.", "Date": "January 28, 2014"}, {"Title": "Great camera", "Author": "william malizia", "ReviewID": "R1O4RDADH9JWB6", "Overall": "4.0", "Content": "Seems like a great camera, pictures very clear. Great value for all this camera includes, also Amazon gave us a free camera case.", "Date": "January 13, 2014"}, {"Title": "Quality camera in a small size.", "Author": "kenneth W. Shaw \"ken shaw\"", "ReviewID": "RDD2BUSS0Y79F", "Overall": "5.0", "Content": "One reason I chose this camera is because I have always been pleased with other Sony cameras I have purchased. It was also chosen because of it's with-fi feature & it's various settings, plus its small size. Also, it takes great pictures. This little camera from Amazon is a great buy.", "Date": "January 12, 2014"}, {"Title": "Great Camera", "Author": "Richard Hubbard", "ReviewID": "R2PVA3CX9LBACK", "Overall": "5.0", "Content": "This camera takes fantastic pictures for such an inexpensive camera. It takes some getting used to because it does so much, but once you understand its menu you'll be taking some really great pictures.", "Date": "September 12, 2013"}, {"Title": "Small and Sharp", "Author": "Adrian", "ReviewID": "R38XOETT4DGRLM", "Overall": "5.0", "Content": "I wanted a camera small enough to easily slip into a pocket and good enough to take low light photos and moving subjects.  This camera is nice and compact. Its probably a lot smaller than your smart phone. Even though it is very compact it still has an 8x zoom, great photo quality, fast burst mode, and WiFi that I love to use to transfer photos to my phone and tablet when I'm on the go.I've used this camera in lots of different situations and I'm consistently impressed with the results.  This camera is easy to take with me than any smart phone and takes photos that are in a completely different league.", "Date": "September 11, 2013"}, {"Title": "Decent point and shoot", "Author": "deirdrebardowl", "ReviewID": "R262P1RTVFX2TG", "Overall": "4.0", "Content": "I lost the charger for my little w560 and after looking around a bit I was surprised to find out that Sony makes point and shoots with CMOS sensors for around 150 bucks.  That intrigued me and even though my trusty w560 is still in perfect working order besides for the charger, I decided to upgrade.  What I have discovered is that I need a point and shoot with the low light capabilities of this camera.It's really amazing to be able to take decent pics indoors without the windows open or using the flash.  This camera can do it.  This camera also has a host of neat little shooting modes and color options as well as being capable of HD video with stereo sound.  I have played with this camera for a week now and I'm still discovering new things buried in the menus.  I'm very happy with my 150 dollar purchase and it's worth every penny.Now for the cons.  The build of this camera is smaller than my w560 and feels more flimsy.  The smallness isn't a problem but coupled with the plastic feel it's a little bothersome as far as worrying about damaging the camera.  The shutter button is also another issue, at least on my camera.  The zoom function is tied into the shutter button and it will actually rattle if I shake the camera gently.  I thought I had broken my camera when I used the zoom function the first time, it moves around and isn't seated firmly at all.  It doesn't seem very stout and able to put up with much use.  The screen is smaller than I imagined which is just a nit-pick.The anti-shake technology also isn't everything the company preaches it is.  In low light it does much better than a normal camera however hand shake is an issue.  I mean if you can hold as still as is humanly possible you can get some great shots but if your subject is moving or you are moving for any reason, the image isn't usable which I expected.  Even my Sony CMOS DSLR has issues with low light without using flash but the company shouldn't use the anti-shake in low light as a selling point making people believe something that isn't even possible with more professional products from this brand.Having said all that, this camera is still deserving of 4 stars.  Only the build and the bit of flamboyant marketing is questionable about this camera.  I am a firm believer in Sony as being more bang for the buck and this camera is not an exception.", "Date": "September 4, 2013"}, {"Title": "Great point and shoot camera!", "Author": "Bigdoggolfer8", "ReviewID": "R1IFZDRRVJGMK6", "Overall": "4.0", "Content": "I recently bought this camera for a vacation as my old point and shoot camera's zoom control broke.  After using this camera, I noticed a good picture quality and plenty of features to kept it interesting.  All in all, a great camera for the money!!!", "Date": "August 20, 2013"}, {"Title": "good camera", "Author": "hussam", "ReviewID": "R2PNFTH18ZEVHN", "Overall": "5.0", "Content": "photo are good all overcamera was even smaller than I expectedconnecting it to my Samsung s4 mobile was easy using the appthe came it self is also has pretty design", "Date": "July 30, 2013"}, {"Title": "I love it", "Author": "SoCalMom", "ReviewID": "R1IZGST6Y9WIU4", "Overall": "5.0", "Content": "Way better than my old camera.  Takes good LOW LIGHT photos that's what I was after!!! :) very pretty in white, nice change from silver and black.  Good zoom lens.  Small, compact.  Bought extra batteries but didn't find the original battery to be a big issue like some commenters said.", "Date": "July 29, 2013"}, {"Title": "Nice camera!", "Author": "R. Calhoun", "ReviewID": "R364BXASUGDWU1", "Overall": "4.0", "Content": "Really nice little camera, very compact and user friendly. Sharp pics, excellent low light and macro performance (I shoot model cars quite a bit). Simple, intuitive controls and features. Recommended.", "Date": "July 29, 2013"}, {"Title": "Compact and easy to use", "Author": "Mary Ellen Menzel", "ReviewID": "R3TNG8P6URKBAX", "Overall": "5.0", "Content": "This is my first digital camera and I am very pleased with it. Compact, light-weight and takes great pictures and videos. I was really impressed by the clarity of the pictures.", "Date": "July 24, 2013"}, {"Title": "Nifty Point and Shoot w/Upload!", "Author": "Amazon Customer", "ReviewID": "REMN8OR29BF91", "Overall": "5.0", "Content": "Very nice little point and shoot!  Cmos/EXMOR R sensor is viable feature as is the wifi connectivity. Screen, while not touch sensitive, is big and clear.", "Date": "July 2, 2013"}, {"Title": "Sony", "Author": "Mutt", "ReviewID": "R1WBN757E6BK80", "Overall": "4.0", "Content": "Not a bad little camera. A little smaller than I expected but has a lot of features that has come in handy. I love the wi fi !!!!! I received the camera a day earlier than I expected and the price and service were exceptional. Great job everyone. I shall return.", "Date": "June 16, 2013"}, {"Title": "Great camera for people with small hands", "Author": "Mr. M", "ReviewID": "R3F3WJ0A8YBA58", "Overall": "4.0", "Content": "The picture quality is excellent.  Automatic settings work well. Lots of great feature I might or might not very use.  Like the wifi feature However, it is a rather small camera with very small buttons that make it a bit difficult to use and I don't have particularly big hands. All in all a great camera.", "Date": "June 11, 2013"}, {"Title": "Great", "Author": "El Viejito", "ReviewID": "R1AP5S7PSDKZ0P", "Overall": "5.0", "Content": "A great camera for the price. Small enough to fit in your pocket, yet powerful enough to take hundreds of photographs of good quality.", "Date": "June 6, 2013"}, {"Title": "First impression", "Author": "PK in MN", "ReviewID": "RL58M5ZSFY3SG", "Overall": "4.0", "Content": "Bought as a reasonable replacement for a previous pocket size digital camera that broke recently.  First impressions are the lightness & larger screen (like 2 times than my previous).  After reading some of the paper and internal operation manual, it appears easy enough to use & lots of addt'l features my older camera did not.  We're taking an Eastern European vacation later in June & that will be the ultimate test in whether my first impressions hold up.I appreciated how quickly the camera was delivered after placing the order.", "Date": "May 31, 2013"}, {"Title": "Awesome", "Author": "WrongButton21", "ReviewID": "R3EV87L156E9WW", "Overall": "5.0", "Content": "Loving the camera, easy to use and understand. Was shipped quickly and arrived with no trouble. Connects to multiple devises and that's the main reason I bought it. Very happy with this purchase.", "Date": "May 31, 2013"}, {"Title": "Great Handy Camera", "Author": "Mr President \"I know what I like.  It may not...", "ReviewID": "R46T6FEJTG9NR", "Overall": "5.0", "Content": "I researched digital point and shoot cameras a long time before deciding on the Sony DSC WX80/B.  This is my third digital camera and I am very pleased.  My $400 Olympus Stylus 1200 went dead after a couple years, needed $200 to repair.  My Nikon Coolpix cost $90 but took blurry pictures.  This little Sony is the size of a deck of cards and takes super clear and sharp photos with its Carl Zeiss lens.  The battery life seems longer, too, than my other cameras.  Easy to switch to video. The surprise was the simple ease of this cameras WiFi and the quick usefulness of having my photos immediately on my tablet, a Sony Tablet S.  I own many Sony products and am very pleased with the quality of each.  This camera was a bargain.  I also bought the Wasabi 2 battery pack and charger, although this camera comes with a Sony battery for in-camera charging.  Also bought separately a high quality memory chip, a PNY 16GB, 90 MB/second transfer rate for fast repeat photos. This camera has a burst photos feature which I haven't tried.  There is a one to two second delay between photos when shooting stills normally or in telephoto.  The zoom is impressive for such a small camera.  I use this mostly for sports events and some wildlife.  It freezes action very clearly.  The wifi feature is now a necessity to me, very convenient.  Many other features.  Highly recommended.", "Date": "April 8, 2014"}, {"Title": "Perfect", "Author": "Franzi", "ReviewID": "R1J80U99Q8XBNL", "Overall": "5.0", "Content": "I really love the camera. The pictures are great and it makes muich fun to take pictures. It is easy to handle, but not to easy/boring. I think it is a perfect camera for non-profi-shooters and for people who are still expecting much", "Date": "May 19, 2013"}, {"Title": "Great small camera", "Author": "Catherine Ann Rowlette", "ReviewID": "R262OYE3CZIKDN", "Overall": "5.0", "Content": "I get very good results on landscapes with this camera, and the zoom feature does a great job too!  The \"controls\" are easy to figure out (a big plus).", "Date": "June 4, 2014"}, {"Title": "I'm very happy with my new camera", "Author": "themom0925", "ReviewID": "R3V64LLSYCI8P2", "Overall": "5.0", "Content": "It arrived as scheduled and works great.  The low light photography is excellent.  The buttons are small so if your fingers are big this camera may frustrate you a bit.  I love the option to take snapshots as I shoot video.  I shot my sister-in-law's wedding and that feature was very nice.  I would buy this camera again.", "Date": "June 3, 2014"}, {"Title": "This a freaking unbelivable camera", "Author": "Joy", "ReviewID": "RCGJKUGVHE9UJ", "Overall": "5.0", "Content": "For it's size this camera is amazing it's much much better than my Canon PowerShot SX500 IS which is huge next to this one! I love taking it to shows the pictures come out so beautiful!! I had a problem with the pictures coming way to bright but I fixed the light exposure and yay now it's great. I don't think I recorded videos with this one so I cant speak for that. Really recommend for someone that wants something small but with great pictures :)", "Date": "May 22, 2014"}, {"Title": "Awesome!", "Author": "NancyP", "ReviewID": "RFZ4NC2YOTA11", "Overall": "4.0", "Content": "A serious pocket cam that does amazing things.  I was very surprised at the quality of photos.  Glad to have this camera.", "Date": "May 21, 2014"}, {"Title": "Awesome buy", "Author": "Richard V. Nguyen", "ReviewID": "R26UFZQSNPSV9I", "Overall": "5.0", "Content": "This was an awesome by at the time. I think the camera was selling for 180 bucks. The package was for about 160 I think. The camera takes great pictures in the day or night. Lots of options. and the wifi device remote is remarkable. I did not expect that to work well but it works great. I was in 2 different rooms and I was still able to control it and take a picture. Range was better than the gopro wifi. I contemplated using this for recording in the car.", "Date": "May 13, 2014"}, {"Title": "Camera is great", "Author": "Aroddz", "ReviewID": "RX237GKNQOV8W", "Overall": "5.0", "Content": "This camera takes great pictures. I love it. Panaromic pictures come out beautiful and the shots it takes while moving are wonderful.", "Date": "May 3, 2014"}, {"Title": "It takes good pics but the camera itself has issues.", "Author": "blah2012", "ReviewID": "R2JHPXCRI4N5OJ", "Overall": "3.0", "Content": "I got this for Christmas last year (2013) and I loved it...well until about 2 mths ago that is.It started doing odd things and every time I put my SD card in I can only take 40pics before it says the memory is full. I have no idea why it says that. I upload my pics multiple times throughout the day to my computer so the SD is always empty from the previous uses. When I first got it I could have 300 pics or more on there at a time and now it won't let me go past 45 max! I can't take video because it tells me memory is full. I have deleted everything so there is no reason for it to be telling me the memory is full! I have used both a 2GB and 4GB SD card and it still does this!The feature where it is suppose to close the lens when going off well that stopped happening months ago. About a month and a half after I got it that stopped. It will come on and have errors automatically.Now as of May 1st. I can't get the darn SD card to go into the slot!! It won't go in! I am NOT happy.The power cord plug in on the camera itself is horribly made. It is very delicate and half the time it is very difficult to get it to plug in.I like the features on this camera but without flash it is really hard to get a steady non blurry photo even with trace focus on.We have the insurance so I'm going to send it back and see what happens. I will update on that as it happens.This isn't a bad camera but I think for what we paid, more than what is listed now, it's not worth it. It should not be having issues already after only 4mths of use.", "Date": "May 2, 2014"}, {"Title": "Very good", "Author": "Mercedes", "ReviewID": "R2D383TN0682Z0", "Overall": "4.0", "Content": "Got something smeared on the screen of the camera and flash won't work but overall it is a good cam", "Date": "April 30, 2014"}, {"Title": "all I asked for", "Author": "AL", "ReviewID": "R2QN4PPM3KTBUF", "Overall": "5.0", "Content": "I have had a couple of the Cybershot T series cameras which are really very nice to use and small/sleek for carring in a pocket. I was looking to change as the touch screen controls were difficult to see and manage in bright light. My daughter had gotten a WX80 for Christmas and I liked the way it handled. Sony had discontinued the WX80 for the newer WX830 however after using my daughter's while on vacation in Mexico I was able to get the WX80 on Amozon for less than the newer model from Sony.", "Date": "April 26, 2014"}, {"Title": "Great Little Camra!", "Author": "Lauren", "ReviewID": "R31Y7T2KRDALE7", "Overall": "5.0", "Content": "I am very pleased with this purchase. If you are looking for a super tiny and super light weight point and shoot that delivers wonderful quality photos, this is the camera for you! Only con is that it does have a very delicate feel not hardy at all, I would recommend buying a case for it. Love the WiFi capabilities, I can transfer my photos to my smartphone easily and edit and upload them to social media in an instant! All around a perfect pocket camera, just don't drop it without a case, it just might shatter into a million pieces!", "Date": "April 9, 2014"}, {"Title": "very fast shipping gret camera!", "Author": "rebuz", "ReviewID": "R28PEN8ZW1ACCR", "Overall": "5.0", "Content": "Great camera fro the price.  nice and compact.  Takes good pics and great vids.  Sony is a great product.  True", "Date": "March 22, 2014"}, {"Title": "Great performer, but not top quality.", "Author": "Rick", "ReviewID": "R38YNZMHNFFGNV", "Overall": "3.0", "Content": "I had this camera for almost a month.  The photos it took were pretty good.  Focus and low light capability were excellent.  Where this camera falls down is on smoothness of operation.  The menus are overly complicated and frustrating to change any of the settings.  It has a number of different 'mode' settings that you are supposed to translate into low-light settings etc.  Wouldn't it have been easier to just give me simple ability to manually set shutter speed as on high-end cameras.  Ironically, on 'complicated' high end cameras, shutter speed can be simply set from the knob at the top of the camera.  I gave up on trying to navigate the menu system and stuck with just turning the flash on and off and leaving everything else in auto.The buttons are tiny and a little clumsy when trying to quickly navigate the menus.  I read this from another reviewer before purchasing and thought that tiny buttons wouldn't bother me because my fingers are small.  It's the combination of Sony's goofy selector wheel, small on/off button and convoluted menu system make the camera a little frustrating to use for anything except the most basic pointing ans shooting.The lens does make a 'strained' sound when it's going in and out when you turn it on and off.  This doesn't fill me with confidence that the camera will be a long term performer.I did compare this to the similarly priced Canon Elph 330.  While the Elph does require you to remove the battery to recharge, the image quality is a little better on the Canon.  The Canon menu system is simple to navigate as a point of comparison and the operation of the lens is smooth as silk.  The Canon is also slightly larger.  I wound up returning the Sony in favor of the Canon.On the plus side, the camera is tiny.  One of the smallest I've found.  The USB charging is another big plus.  But these weren't enough to make me fall in love with this tiny performer.", "Date": "March 16, 2014"}, {"Title": "The Best camera", "Author": "Donna L. Spitzer \"DonnaSpitzer\"", "ReviewID": "R1KDJDPYBTTZLY", "Overall": "5.0", "Content": "Bought as gift. Easy to use. Does everything you need. upload onto FB & Twitter Great directions Easy to understand. Pretty colors to choose from Great warranty service. nice light camera. easy to carry easy to use", "Date": "February 27, 2014"}, {"Title": "Glad we bought this one!", "Author": "Larry B Lindstrom", "ReviewID": "R32QQHBY9B9TS4", "Overall": "5.0", "Content": "This has been a great camera!  I needed a small camera for a trip we were taking as I couldn't take my larger, expensive camera and this one reviles the expensive one in photo quality.", "Date": "February 24, 2014"}, {"Title": "Excellent camera.", "Author": "POD Chicago", "ReviewID": "R1IIQ2QXB6O5AA", "Overall": "5.0", "Content": "The camera is nice and small, but takes great pictures and video in all lighting conditions. It connects easily to download and print the photos.", "Date": "February 21, 2014"}, {"Title": "Flash won't charge. Not Available", "Author": "Shawn Muder", "ReviewID": "R3PI350QYAAPTE", "Overall": "2.0", "Content": "Yep, that's the error code (E:91:01) I am getting from this camera less than two months into owning it.  Having babied the camera by buying a special container for it when not in use, and making sure it was never dropped or bumped, this is disheartening.  I am having to send it back to Sony for repair after the various initialization and factory reset procedures proved fruitless in getting the flash to work again.I am fairly sure the flash somehow managed to burn out the last time the camera was used or it has become confused because of a fast change of light intensity in the room.  Regardless, a camera without a flash is pretty much useless.", "Date": "February 18, 2014"}, {"Title": "One step forward. Two steps back?", "Author": "B. Stark \"Stark Rhavyn\"", "ReviewID": "R15OMBJVW9NDIY", "Overall": "3.0", "Content": "I used a previous model before getting this one.This one has more zoom and higher res video, plus the wifi feature is neat.Older one, however, had a bigger screen, and more importantly, the videos could upload to my Mac.I'm still working on it but this model's AVCHD video format won't download along with the pics via my mac's iPhoto app. I'm sure there are some work arounds but that's a pain. My last Cybershot didn't require work arounds or separate applications just to get the videos off the camera. Unfortunately, that old camera has become buggy (even though it's MAYBE two years old).", "Date": "February 14, 2014"}, {"Title": "Wonderful Camera", "Author": "mbuggie42", "ReviewID": "R156NASYRSP4EC", "Overall": "5.0", "Content": "I got this camera as a replacement for my old Olympus U840 that finally gave up the ghost and absolutely could not be happier with this product.  It's easy to use, great for casual photography, a good weight, and offers a nice variety of features.  I'm particularly impressed with the quality of photos taken without a flash - a huge improvement from what I was used to dealing with when using my previous camera!  Also, the battery life is pretty good and it doesn't take forever to charge.  Are there better cameras out there?  Sure.  But for ease of use and an affordable price, you can't go wrong with this product.  I can honestly say this is one of the best digital cameras I've had in years.", "Date": "February 13, 2014"}, {"Title": "Great camera!!", "Author": "diamond", "ReviewID": "R180Y1JVAWXNP7", "Overall": "5.0", "Content": "I have had this camera for a couple weeks, and am LOVING the pictures I am getting from it. I have a baby and take a decent amount of pictures in various lighting and this camera hasn't failed me. As other reviews have stated on the first use the battery is short lived but only on the first use. Once it's been charged it's great. Lowlight pictures have turned out great. Very happy with this purchase!", "Date": "February 9, 2014"}, {"Title": "Just what I was looking for!!!!", "Author": "Tricia Grona", "ReviewID": "R1K4KC6U39Z83", "Overall": "5.0", "Content": "faster than expected shipping.  Great camera.  I love all the features and how crisp the pictures are.  Quick shutter easy to use.  I don't think you can go wrong with Sony", "Date": "February 3, 2014"}, {"Title": "Excelent picture quality!", "Author": "marcosrse", "ReviewID": "R2VYYV5EI3A50D", "Overall": "5.0", "Content": "The picture quality is just like I expected, but I'm really happy with wi-fi function... sharing pictures with my smart phone is really easy!", "Date": "January 4, 2014"}, {"Title": "So far so good.", "Author": "Holly Wrigley", "ReviewID": "RNNVY251DTQL", "Overall": "5.0", "Content": "I just wanted a little camera that would fit nicely in my purse that could take a decent picture. So far so good!", "Date": "January 3, 2014"}, {"Title": "Loved it !", "Author": "SkyJiths", "ReviewID": "R2EVQGMDSBQSIG", "Overall": "5.0", "Content": "I was looking for a compact camera which can take quality pics in low light. And after doing lil research, I decided on Sony DSC-WX80/W. It really takes amazing shots in low light and also otherwise.small, sleak and wifi addon. Thumbs up !", "Date": "January 3, 2014"}, {"Title": "Sony is the Best", "Author": "Shima", "ReviewID": "R34JZ8C2KAX4X8", "Overall": "5.0", "Content": "Love this camera it takes great pictures and its nice and small and can fit right into my pocket or handbag. So far the images look wonderful. The WiFi function is also great .", "Date": "January 2, 2014"}, {"Title": "WIFI", "Author": "E. N. Knez", "ReviewID": "R1O0Y5DYO5S4SX", "Overall": "4.0", "Content": "Wife having hard time figuring out WIFI. Great photos so far. Easy cable feed to computer for downloads of pictures.", "Date": "January 2, 2014"}, {"Title": "Very small but powerful", "Author": "J. Trippi", "ReviewID": "R1YC6XP8O5T5DH", "Overall": "5.0", "Content": "Purchased a refurb unit (did not come in a box but a mailer) which saved much and got a perfect unit.  Battery charges in camera obviating a battery charging holder. In my early use, the camera functions well, creates good to excellent images and video and has nice wifi transfer of images.  The small camera size leads to a small viewer by necessity; the view image quality is only fair.  SONY software is never intuitive, but this is not bad.  Excellent unit for travel when space is a premium.  Take plenty of SD cards though because images sizes are large.", "Date": "December 30, 2013"}, {"Title": "Black Friday deal", "Author": "Percy AllanO", "ReviewID": "R1TQILKGUHZ88X", "Overall": "4.0", "Content": "Purchased based on price. The model above (WX200) is different only in having a better zoom range on the lens. My main use will be  for video. It does shoot full HD video at 1920 X 1080i 60 which I convert to 1020 X 1080p 30 using the hand break program which I can  use in my video editor pitivi running in Fedora linux. One can shoot lower resolution video at 1080p or 720p in mpeg4 files but i prefer to use the highest resolution. I am very happy with the video at all resolution settings. The optical image stabilization does a good job. Considering the size of the battery its life is great. No big surprise but the buttons are wee for one with big hands.Now for the minusesThe manual that comes with the camera is printed on news print and awful. Go on line and google DX80 users guild to get something truly useful.There is no included battery charger only a usb cable one can use to directly transfer data to a mac or pc and charge the battery. For some reason I have an old sony charger which works with this battery.The thing I like the least is you need a PC or Mac with the sony software to get the video data from your SD card into a computer. It seems to work fine once it is set up. When I put the SD card into my card reader or hook up the camera via usb it automatically uploads my data and put it into my pictures folder. Unfortunately for me it does not work in linux.There is a micro HDMI out port on the camera but no cable is included. I ordered a couple of micro hdmi to hdmi adaptors for less than $1 each off amazon and am waiting for them to come from honk kong.All in all with the super deal I got on this camera I feel it is a wonderful photo/video tool. Great camera for the budding vloger or someone who wants a big step up from the quality of their portable phone.", "Date": "December 29, 2013"}, {"Title": "Vacation", "Author": "Nova", "ReviewID": "R16Y2CZ0UL6ID0", "Overall": "5.0", "Content": "Product lasted through a month long vacation in Morocco, the shots were very good, battery life was great, and the camera wasn't damaged at all in whole month.", "Date": "December 25, 2013"}, {"Title": "Fantastic camera", "Author": "Tim Destro", "ReviewID": "RQFH5II3SRR8E", "Overall": "5.0", "Content": "Best camera I have ever bought. Replaces video camera and still camera. Great pics too. Lightweight what do you need can carry it in your pocket.", "Date": "December 4, 2013"}, {"Title": "Great purchase", "Author": "Wendy Aldecoa", "ReviewID": "R2JB0MEXRZ25WG", "Overall": "5.0", "Content": "When I got the camera, it was a little smaller than I thought. However this is a gift for my daughter and she will be able to take it everywhere with her. She loves to take pictures and this is a good starter camera for her to see if this is something she would like to pursue as a career. One of my coworkers has this camera and recommended it to me, and I do like the fact that she can upload pictures directly from her camera.", "Date": "December 3, 2013"}, {"Title": "Upgrade to a previous model that I owned", "Author": "sms", "ReviewID": "R7ZV2PBG3DVCA", "Overall": "5.0", "Content": "Excellent Point and Shoot! I leave the camera in Superior Auto and go.  I have an infant and a toddler and this camera takes a good action shot. The low level lighting pictures come out well, but not fantastic and the camera is little slower to take pictures in this lighting. It has good resolution and high quality. Unlike a previous model that i owned, you can chose what format to shoot movies in.  Whatever Sony's movie files were set-up for before, it didn't work on most media players.  This new camera allows me to choose to shoot movies as MP4's, and they play on most things now.  It makes it nicer to share files with family that live out of town.", "Date": "December 1, 2013"}, {"Title": "best camera I've owned so far", "Author": "Teela", "ReviewID": "RPJNMI4S48GE4", "Overall": "4.0", "Content": "I. Love. This. Camera.The picture quality is amazing, it's slim and sturdy, and I've had dozens of compliments on how simple it is to use and how fantastic my pictures turn out. The colors and level of detail are wonderful.My only concern is that when I was taking video for an extended amount of time at a concert, it started to get *REALLY* warm. After a while, I just stopped so it would cool down. Nothing bad happened to it, though (thankfully) and it still works great.", "Date": "November 21, 2013"}, {"Title": "great little camera", "Author": "S.A.W.", "ReviewID": "R1GC2CXE7KLRJQ", "Overall": "4.0", "Content": "and I do mean little.  I have big hands and that makes it sometimes hard to use this camera.  It only down side is being a littel to small", "Date": "October 25, 2013"}, {"Title": "Perfect Camera", "Author": "Santiago Fernandez Herrero", "ReviewID": "R2ZFGV09SV7WX4", "Overall": "5.0", "Content": "I really love this camera, easy to use and strong. I recommend it for all the people that want a simply camera with excellent quality Photos", "Date": "October 9, 2013"}, {"Title": "A very nice camera", "Author": "Glenn Jerome Everette \"Cautious Consumer\"", "ReviewID": "R3NPLQ9L0F4N4X", "Overall": "5.0", "Content": "After living without a decent camera for so long the Sony Cyber-shot DSC-WX80 is a breath of fresh air. The pictures and crisp and vivid. The 1080 video is amazing.", "Date": "September 8, 2013"}, {"Title": "Great deal!  Love the quick burst mode and remote wifi.", "Author": "D. Barker", "ReviewID": "RDUPB5QV5I0ED", "Overall": "4.0", "Content": "Looking for something that was quick enough to keep up with our kids, and this one does it.  Not to mention the Sony quality.  It's a bit small, so I would suggest the Sony LCJ-WB/D Silicone case.  We got an orange one so its easy to find ;)", "Date": "July 23, 2013"}, {"Title": "The greatest camera I've ever owned.", "Author": "daniel", "ReviewID": "R2JFPZCF06JKUZ", "Overall": "5.0", "Content": "Since arrival I have taken more pictures and better quality pictures than anyone else I know. It's compact with a lot of potential for getting the best picture or video from up to 100 feet away, easily. Be sure to buy a high gig memory card. An extra battery wouldn't hurt either.", "Date": "July 21, 2013"}, {"Title": "Great Camera", "Author": "chakla", "ReviewID": "R2VMC0NNAFO26H", "Overall": "5.0", "Content": "I have always been a big fan of Sony Cyber-shot cameras and this would the 4th if not 5th Cyber-shot I have owned. I have purchased this many because I upgrade my camera with higher megapixels every 12-18 months. The camera takes incredibly sharp pictures and is very easy to navigate through the menu. The sliding button on the side easily allows you to change from photo, panoramic to movie mode unlike other cameras that the changing modes is through a menu on the camera. It is very small and makes it easy to take use on every occasion. Big fan and definitely recommend Cyber-shot cameras!!", "Date": "July 17, 2013"}, {"Title": "great little camera", "Author": "Dizzy Gillespie", "ReviewID": "R1TBT59IIGE6K7", "Overall": "4.0", "Content": "great little camera, not perfect. I got a case, extra battery, and ac charger.  I had worn out 2 pentax optios (5 mp). This is 16 mp and has a huge lcd for it's size. my biggest gripe is the ease of accidentally hitting the  tool selection wheel on back, which changes the mode at inopportune moments. Also, it refers to 3D mode without any documentation of use. The innate panorama is nice. HD video very good, battery life very good. I use the wi-fi to send pictures to my smart phone when in the field, for quick FB upload. Would buy again, have recomended to friends. The sensor is said to be state of the art.", "Date": "July 12, 2013"}, {"Title": "Great deal", "Author": "Tania", "ReviewID": "R3A58EZQ06MZ2X", "Overall": "5.0", "Content": "I love the deal it was the best I found out on line.  The pictures taken by the camera are awsome and the color is beautiful!", "Date": "July 12, 2013"}, {"Title": "Great Camera", "Author": "Robert Kirstatter", "ReviewID": "R2WUD0GUBVU046", "Overall": "5.0", "Content": "Bought this camera for my wife for her birthday and she loves it. It's easy to use and has several useful options that make this camera great.", "Date": "June 22, 2013"}, {"Title": "Good Camera", "Author": "Vijay Atri", "ReviewID": "R1LVZVRX4SNWOA", "Overall": "4.0", "Content": "I liked the Camera a lot. It did everything it said it will do and more. Very handy. Just love it.", "Date": "June 19, 2013"}, {"Title": "Camera good, but wall charger  doesn't work", "Author": "Donna J Ruberti", "ReviewID": "R2U5LHCW1947UD", "Overall": "4.0", "Content": "The power source that plugs in the wall does not work.  Since I bought an extra battery and charger, (plus I have extra i-phone/i-pad power sources),  I didn't want to go through the hassle of returning the entire camera.The camera itself works great though.  Takes clear pictures. Looking forward to using it at upcoming family events and concerts...", "Date": "June 9, 2013"}, {"Title": "Great camera, low price!", "Author": "Norman Salazar", "ReviewID": "R9094DJY3V5TL", "Overall": "4.0", "Content": "I just bought is camera to replace an old Sony Cibershot and I'm amazed with the features this little fellow offer. The one I like the most is the wireless connection to transfer pictures to my PC, IPhone or IPad.  Big value for such a low cost!", "Date": "June 6, 2013"}, {"Title": "Worthy the money", "Author": "damansur", "ReviewID": "R1955NEYPMHU4N", "Overall": "5.0", "Content": "It is a great camera for a reasonable price. Easy to handle it, nice pics, but not touch screen. Havent tried to much in the dark", "Date": "May 1, 2013"}, {"Title": "Very poor battery life", "Author": "Cat lover \"Marcia\"", "ReviewID": "R3RB1I4GIYXYGP", "Overall": "2.0", "Content": "My old Canon Powershot 1300 takes beautiful outdoor photos but is poor in low light and sometimes mediocre with the flash. I purchased the Sony because it was supposed to be excellent in low light and also had twice the zoom of my Canon. The price seemed excellent for a good compact digital camera. Unfortunately the fully charged battery lasted only about an hour. The store was gracious about taking it back and Best Buy let me return the extra battery and wall charger that I had bought. Next time I purchase a camera I will be sure to check out the battery life before purchasing it. If anyone knows of a Canon under $300 that takes decent low light photos I would love to hear about it.", "Date": "April 22, 2013"}, {"Title": "I am disappointed in the quality of this product.", "Author": "Public Librarian \"Miss Pat\"", "ReviewID": "R2ZHAVLYOYGBEF", "Overall": "3.0", "Content": "I bought this camera to replace an older camera of the same brand because I liked my older camera very much, but it has malfunctioned. I also own another larger digital camera of the same brand.I am disappointed with the quality of the newly purchased camera, compared to my older one, however.The on/off switch is very delicate, as well as the latch to the battery and camera card. I don't think this camera is made as well as my previous model, and will not last as long. It has a lot of the same features as my previous camera, so that helps make up for some of the disappoint, but it seems like they are making things cheaper and cheaper.I probably would not buy another camera on/line. I would want to actually hold it and examine all the features before purchasing a camera on/line. In this case, the brand name alone was not necessarily a good choice.", "Date": "July 20, 2013"}, {"Title": "Best alternate to smartphone pics", "Author": "Tina Sobering \"Dr Doolittle\"", "ReviewID": "R30IYA8SGXKZFP", "Overall": "5.0", "Content": "This little camera is awesome! I haven't had it long, but love it! It has great features..16+ mp, up to 32x digital zoom,....the wifi feature is cool and easy. It allows you to transfer photos to your ipad or smartphone without cables or extra accessories. Switching between still shots, panoramic shots, and movie modes is easy, too. I was worried about the zoom not being enough for the money, but it stays clear even during digital zoom. So I can't wait to see what it will do at a concert! The other thing I like is the stabilization, so if my hands shake at all, for the most part it helps me still get a clear shot. I am glad I rolled the dice and tried this one out. It packs a lot.of punch for a little camera.", "Date": "July 27, 2013"}, {"Title": "Sony DSC-WX80/R 16 MP Digital Camera with 2.7-Inch LCD (Red)", "Author": "Janice", "ReviewID": "RT88SSXAJS20E", "Overall": "4.0", "Content": "Sony DSC-WX80/R 16 MP Digital Camera with 2.7-Inch LCD (Red) has a fantastic zoom.  I was concerned that the picture would be blurry when using the 8X optical plus digital zoom for enlargements, but I took pictures out of a boat of an eagle and nest and they turned out great.  My only concern is the door to the battery compartment seems a little flimsy.", "Date": "May 24, 2013"}, {"Title": "Small, light and fits in my purse!", "Author": "Ricardo Martins", "ReviewID": "R28VRZA95RC3Y9", "Overall": "4.0", "Content": "I bought this camera for my wife and she liked it very much. Technically speaking, a very good camera, great pictures, easy to use it, and good features. But what most pleased my wife was, the size, the weight and ease. Recomended!", "Date": "May 20, 2013"}, {"Title": "not great low light photos", "Author": "Amazon Customer", "ReviewID": "R33ZHNG4ZSN3C8", "Overall": "3.0", "Content": "I Am returning this camera.  Low light photos had strange color, it seemed to add gold or orange tones to the scene.  Also, this is a very small camera - easy to fumble.  I thought the LCD screen was too small - 2.7 inch vs the usual 3 inch, but it just seemed small.", "Date": "May 9, 2013"}, {"Title": "Haven't really used it yet.", "Author": "Jo Anne", "ReviewID": "R3H1Z0VIZ4CTJB", "Overall": "4.0", "Content": "I'll know more when I really use it a lot.I bought it because of the lens.Check with me again.", "Date": "May 2, 2014"}, {"Title": "Great photos, easy features, but 6 months of use and the camera strap broke", "Author": "Laurie", "ReviewID": "R1UTTVHY4Q0XDN", "Overall": "4.0", "Content": "And when it broke, of course the camera fell on cement.  It still works, but there is now a mark on every photo, something must have dented from the drop.  I feel this is a design flaw.  It was the piece that holds the camera strap...a little metal loop, that broke.  Apparently it wasn't thick enough.  I did use the camera almost daily, but it also spent alot of time in my pocket.  Unfortunately I couldn't find anywhere to provide this feedback on the Sony sight.Due to this flaw, I will not be getting another cybershot, even though I loved the \"color pop\" feature", "Date": "January 8, 2014"}, {"Title": "Camera", "Author": "Jeff Bevard", "ReviewID": "RO4SCDQ06UR1J", "Overall": "4.0", "Content": "Since purchasing this camera I've gone to really learn how to use it and it is a great tool to have takes great pictures and all different types of scene", "Date": "December 14, 2013"}, {"Title": "in love with this camera", "Author": "Angie RN \"Angie RN\"", "ReviewID": "R3Q4P8TETXN2O9", "Overall": "5.0", "Content": "Im in love with the pictures this camera takes! Its fantastic and the lighting in my house is not very bright so the low light claim is true. Pictures are very crisp and detailed. Cant wait to try it out on my daughters birthday party this weekend.  The only draw back is Im having a hard time connecting the wi fi to my computer but Im not very tech savvy any way and that is part of the reason I got this camera.  I plan to have my husband figure it out but for now I have no problem using the USB cord to download pictures.", "Date": "November 6, 2013"}, {"Title": "Nice product", "Author": "E. Preston \"History teacher\"", "ReviewID": "R3EFYNI651L9GK", "Overall": "5.0", "Content": "Having carted around a Nikon SLR or some other brand of SLR overthe years, I've shot thousands of pics. Wanted a digital, \"in the pocket\" alternativeto an SLR. Used this one to take about 450 pics on a trip to DC. It worked great.Large image LCD screen is a plus. As is zoom. A few too many menus at first, but I got thehang of them. Low light with stabilization feature only real weakness that I could see.Happy with sharpness and color and ability to frame image and control elements of shotstechnically. Size a real plus since it is big enough to make it handy, but not so big that it isawkward. Battery life generally very good. Even if you shoot limited video or use strobe a lot.", "Date": "August 20, 2013"}, {"Title": "Average quality", "Author": "Crouching Tiger", "ReviewID": "R3VHZ8LJ2LOXS0", "Overall": "3.0", "Content": "When it was launched, it was being touted as the harbinger of things to come, with the digital zoom, panorama and wi-fi transfer features. Digital zoom works well, but only in high-light conditions. Image stabilization under low light in Auto mode is poor. Till now, I have been able to open the videos ONLY using a custom Sony software, which is a pain, especially if the computer you are transferring the video to is not your own. I am not very satisfied with my purchase.", "Date": "June 5, 2013"}, {"Title": "Backpack camera", "Author": "William Mitchell Jr", "ReviewID": "RQS1C9BIHP70T", "Overall": "5.0", "Content": "Great little camera for the backpack hunter. Small enough to fit in any pocket and takes great pictures when the harvest is complete.", "Date": "May 22, 2013"}, {"Title": "FRED'S REVIEW OF MLY WX80 CAMERA", "Author": "Earl", "ReviewID": "R3LXZL6NSHAY4S", "Overall": "4.0", "Content": "A GRANDDAUGHTER OF MINE RECOMMENDED THIS CAMERA.  SHE HAS A CHEAPER VERSION OF THIS CAMERA.MY ONLY DIFFICULTY WITH THE CAMERA WAS DOWNLOADING THE IMAGES FROM THE CAMERA TO THE COMPUTER USING THE WI-FI OPTION.  THE MANUAL IS NOT CLEAR IN MY VIEW.", "Date": "May 1, 2013"}, {"Title": "Vertical Lines on shots - will not fix under warranty", "Author": "A. Cable \"akble\"", "ReviewID": "R3HXF3AOGSXW90", "Overall": "1.0", "Content": "Poor quality photos - vertical lines on many shots. Reset as Sony suggested - then bought a PRotection Plus Warranty as they suggested. Sent Camera in and told $161 to fix. They refused to use Warranty they sold with Ser# by questioning the purchase date.  They would refund the cost of warranty - What a joke - obvious design / part problem but cheaper to return the Warranty Price than to fix.  Last Sony for me or anyone who asks me", "Date": "November 13, 2013"}, {"Title": "Fairly good photos, buggy software", "Author": "Jackie", "ReviewID": "R2DFOXXMAC329", "Overall": "3.0", "Content": "I like the images but the software is a little buggy (photo files upload as read-only so you have to take them all off read-only to edit and save them! Also there's no way to delete several photos at once off the memory stick, you have to click each individually on the camera). I asked Sony customer service and they said that was all that could be done (click through several dozen photos and then delete them. click-click-click-click-click-click...). I tried using the memory stick in my card reader, but that just leaves these black photos with question marks on them.When I saved pics to my computer and tried to edit them, they were all uploaded from the camera in \"read-only\" mode. So I had to change them off of that before being able to save them.I don't understand WHY this software doesn't work correctly. My old Cyber-Shot did not have ANY of these issues with photo editing and saving.", "Date": "June 21, 2013"}, {"Title": "Good app.", "Author": "Winston", "ReviewID": "R1BWGFC59QSEG4", "Overall": "4.0", "Content": "Well, the battery power drops quickly if Wifi function is on. Suggest to get more battery.PlayMemory App is quite handy.", "Date": "April 9, 2013"}, {"Title": "WOW!!!", "Author": "David Mortlock \"Dave Mortlock\"", "ReviewID": "R3NE2RCYU2V42Z", "Overall": "5.0", "Content": "This is a wonderful camera, I cannot fault it. I bought this as a wedding present for my son and daughter-in-law and couldn't be happier with my decision. It can do so much, even more than was advertised. It recognizes a smile and automatically takes a shot when someone smiles that you point the camera at, wifi, and so much more. And the price I paid $207, including a Sony Soft Carrying Case and a 32GB flash memory card was a bargain and my boy and his new wife were really pleased with it.", "Date": "May 6, 2013"}, {"Title": "Good video with poor photos", "Author": "mgchris", "ReviewID": "R8GFAOV17PCHT", "Overall": "2.0", "Content": "The picture quality is on par with that of a good cell phone.  File sizes are much larger than my previous camera, but image quality is noticeably worse.  There is no option to force flash.  The flash options are auto and off.  There is no option to disable review after taking each picture.  The view finder is not very good either.One saving grace of this camera is that the video quality is much better than expected.", "Date": "October 20, 2013"}, {"Title": "poor customer relations", "Author": "Alaska Allem", "ReviewID": "R1F8W8U6Q3B00T", "Overall": "1.0", "Content": "Sending my new WX 80 to Sony repair for rough lens movement, the camera was broken at the repair facility and I am left with a poorly designed broken case with no responsibilty admitted by Sony.Great camera, but Sony service is very unsatisfactory and not recommended to take a chance with their product service.Many other brands available with customer satisfaction a priority.", "Date": "August 13, 2013"}, {"Title": "Great camera, fun features...poor quality frame.", "Author": "E. PRICE", "ReviewID": "R3TP9D91QQXLU3", "Overall": "2.0", "Content": "I've had this camera less than 90 days.  The white frame on the bottom of the camera next to where you attach a tripod has snapped!  Contacted Sony CS and was told \"Physical damage is not considered part of the warranty.\"  Normal use, not even every day.  Then the CSR told me that the physical damage voids the warranty! What a joke.", "Date": "May 10, 2013"}, {"Title": "Loved it!", "Author": "Willian \"Will\"", "ReviewID": "R29QN5B9SU81AY", "Overall": "5.0", "Content": "As an Sony H9 owner, at the same time I miss that more professional look but also love the compact pocket size.The wifi function works great with my iphone.", "Date": "April 11, 2013"}, {"Title": "Great product.", "Author": "Gdua", "ReviewID": "RJR3W7TUMBRES", "Overall": "4.0", "Content": "I like how sleek and slim this is. The color paint is not so glossy, so it's not easily scratch-able. Easy and dummy-proof function buttons. Except, the screen doesn't really show the true quality of the picture, so judge the quality until you upload the pictures on the SD card to your computer.", "Date": "April 12, 2013"}, {"Title": "Compact Camera indeed!", "Author": "BunnyLion", "ReviewID": "R2G35VB71XJA8X", "Overall": "2.0", "Content": "I really wanted to like this camera. My whole life I've been a Sony Cyber-shot fan and owner. I should have taken the size of the product more seriously. I looked at the dimensions and still thought that it couldn't be right. Everything was perfect except for the size. When I opened it and put it in my hand it basically looked like a child's toy camera, possibly smaller than an iPhone 4s. If size is not an issue than you would enjoy this.", "Date": "January 8, 2014"}, {"Title": "Wifi hype misleading", "Author": "Leslie Christopher", "ReviewID": "R2HDX2SRNJ106S", "Overall": "3.0", "Content": "After spending several days reviewing reviews of the various digital cameras out there I finally decided on this one to take on an upcoming trip to Europe.  What sold me was the \"wifi\" capability and being able to send the pictures to my new iphone 5 and/or my mac laptop.  Lo and Behold......the app you have to download in order to send the pictures to an iphone is not compatible with the iphone 5.  I even contacted sony and chatted with a technician, he agreed that this was, indeed correct.  Sorry.Hooking it up with my router is a nightmare because my router doesn't have a WPS button (if you have one of those things it is easy) and I have no idea how to find the SSID number and password, which would enable me to connect it manually.  I will have to hire someone to do it for me as I am obviously NOT a techie :)Anyhow, I really wanted to be able to connect this camera to my phone and opted for the smaller LCD screen in order to get this feature and it doesn't work.It does, however, take beautiful pictures.", "Date": "June 23, 2013"}, {"Title": "cable cord", "Author": "Claire Romano \"Sox4me\"", "ReviewID": "R3SLLCUW38XLYX", "Overall": "1.0", "Content": "beware that I have received 2 cameras with cable cords that do not fit. the cord fits my old camera, but the connector on the new one is not the same. I could buy another cable but should come with one that fits", "Date": "February 6, 2014"}, {"Title": "Loving this camera so far", "Author": "C. Head \"Cheri\"", "ReviewID": "R1EZE7LUEI64D6", "Overall": "4.0", "Content": "When I opened the camera, I first thought that the wrong cord was shipped with it, making it impossible to charge or use the camera.  Then I realized that the cord that ships with it plugs into a port which is hidden by a rubber cover.  Guess I should have read the manual first.  :)  I really like the camera so far.  Unfortunately I I dropped it and part of the cover broke off, but it didn't affect the picture taking at all.  So far so good.", "Date": "November 8, 2013"}, {"Title": "Cheaply Made", "Author": "JKB0076", "ReviewID": "R2URYCROHAOHOL", "Overall": "2.0", "Content": "This camera is basically like holding a 3/8\" thick credit card.  I know the dimensions are listed but until you get a feel for it in your hands, it's hard to get an idea just how small.  It cramped both mine and my wife's hands up trying to hold on to this thing.It's cheaply made and all plastic. The lens housing is plastic and looking inside of it looks like it's unfinished plastic.  I can't imagine this thing lasting to long.The flash in auto mode was harsh, almost useless which means shooting indoors with this slow lens is useless.  The few pictures we took indoors were not even usable(overall a dim household).  Outside pictures were pretty decent.We decided to up our budget to $300 and end up with the Panasonic DMC-LX7.  Extremely nice camera, well made, great IQ, nice clean UI, indoor night shots are very usable(f1.4 lens and no flash to) and just feels like a polished product.If you're budgeted for around what the WX80 is, I suggest looking at another camera.  There has to be better.", "Date": "September 10, 2013"}, {"Title": "TERRIFIC", "Author": "Allan hill \"allan hill\"", "ReviewID": "R296L8EQ990QFD", "Overall": "5.0", "Content": "this camera is lots of fun . works as advertised.dress it up with a glove like case see photo. LCJ-WB SILICONE made for this camera UPDATE:4/22/2013 if you load your photos using WI-FI or watch videos on camera screen you will use more battery power. get a spare ,check your onscreen battery meter ,change battery.believe reviews that say AMAZON VERIFIED PURCHASE.  or you can charge your battery simply by plugging in the supplied charger.ENJOY!", "Date": "March 4, 2013"}, {"Title": "Really?", "Author": "D. Martinez", "ReviewID": "R1OMOQIF4D0ZS0", "Overall": "2.0", "Content": "No memory card included!  I purchased a camera before (same brand) and it DID have a card included- this one did not!!  Really disappointing!  :(", "Date": "April 21, 2014"}, {"Title": "rip off", "Author": "myron lyvon boling", "ReviewID": "RWJZ9JKGQKU8D", "Overall": "1.0", "Content": "No charger included in box. Will be asking for a refund. Bought for wife to use at a special event. Was unable to charge.", "Date": "February 23, 2014"}, {"Title": "Disappointed!", "Author": "Anne \"Anne\"", "ReviewID": "R3VZS7Z7BQCA0S", "Overall": "2.0", "Content": "Nice little camera, but I have found it impossible to use the wi-fi.  Very disappointed and I'm waiting to hear if I can return it to the seller.", "Date": "December 9, 2013"}, {"Title": "Cheap plastic model, made in China.", "Author": "Dokdek", "ReviewID": "R2NXQBK7RXZVZI", "Overall": "2.0", "Content": "I used to own another Sony Cybershot camera a long time ago.  This one is made of cheap flimsy plastic body.  The sides are metal, but they seem to be made without care to detail.  Made in China.  I didn't try taking a picture with this, and just returned it.  Canon cameras seem to be made better.", "Date": "December 11, 2013"}, {"Title": "Disappointed", "Author": "Marjorie A. Habbestad \"bookworm\"", "ReviewID": "R3R2DNSH5OB2YC", "Overall": "3.0", "Content": "I wanted a small camera that would take picturesof children and landscapes.  The color is nottrue and not quality.  Now I'm going to buyanother better camera.", "Date": "July 8, 2013"}, {"Title": "Can't get Wifi to Work", "Author": "Arnie Layne", "ReviewID": "RJMTK57HOE1UW", "Overall": "1.0", "Content": "The main reason we got this camera was for the wifi support. The product promises \"back up [pictures and video] on a network-connected PC.\" Unfortunately, the stupid camera refused to recognize the Sony laptop on the same wifi network. It recognizes the access point, but can't connect to the laptop. The camera tells you to install \"Play Memories Home\" to get this to work. That's all I need. Another buggy piece of software to manage and mangle my libraries. Even after installing this unneeded bloatware, the camera refused to connect to the PC.Online support says that the firewall may need to be reconfigured. No. The camera or the Play Memories Home needs to figure this out. Not the consumer.We returned the camera after finally getting the pictures off the old fashioned was with a USB cable (which the camera thinks is \"an USB\").Sony needs to figure out that no one will be buying these cameras in the age of smartphones. They can't afford to be making things this difficult.", "Date": "July 6, 2013"}, {"Title": "No memory card, would not have purchased", "Author": "Carp", "ReviewID": "R2B9SK13VSSCE9", "Overall": "3.0", "Content": "No mention in details that product had no memory card. Would not have purchased had I know that. Not a good deal.", "Date": "August 5, 2013"}], "ProductInfo": {"Price": null, "Features": "8x optical zoom plus 16x Clear Image Digital Zoom\n16.2MP images with stunning low-light performance\nWi-Fi sharing to upload photos and videos\nFull HD 1080/60i with dual record of stills and movies\nOptical Image stabilization with 2-way active mode for smoother videos", "Name": "Sony DSC-WX80/R 16 MP Digital Camera with 2.7-Inch LCD (Red)", "ImgURL": "http://ecx.images-amazon.com/images/I/41EmukVnWIL._SX300_.jpg", "ProductID": "B00AQDG7YE"}}