{"Reviews": [{"Title": "Fast Camera and incredible video capability", "Author": "Stefan G \"Digiman\"", "ReviewID": "R3OLFTYAJ5HC2G", "Overall": "5.0", "Content": "I just got this camera in time for the first nice weather weekend on the East Coast and we went to NYC with the family for a nice day in Central Park.I purchases a ZS10 2 years ago and skipped last year's model to buy the ZS25 this year.It is a very fast camera from start up time to auto focus time and shutter release. I can't even tell the difference in speed compared to my DSLR (5 yrs old)Lumix is known for superior lens quality - I read an article that they have a very close working relationship with Leica which speaks for itself. So I wasn't surprised at the image quality - even at max zoom. BTW keep in mind this is a 24 mm to 480 mm lens - meaning that 24 mm is a nice wide angle - comes in handy for indoor and nice group shots.The reason I sound so exciting is the video capability of this camera. We went to a school concert the other night and I took some incredible videos of our little girl on stage. Just make sure you switch the recoding mode to MP4 - the default setting is on AVCHD the compression mode that no computer can read!The videos I took were great - not too noisy even though it was real dark.I am very pleased and feel this is a great little camera that is compact but gives you lots of shooting options.", "Date": "May 10, 2013"}, {"Title": "Excellent Features and Good Picture Quality", "Author": "CT Guy", "ReviewID": "RZEVC0UY9E447", "Overall": "4.0", "Content": "I was deciding between the ZS25 and the Canon SX280HS.  I felt that the Canon had better picture quality but the battery life issue during video was a deal breaker.  I decided to go with the ZS25 and I am impressed with it so far.Pros- Compact size. Perfect for traveling especially with the ability to charge the battery in the camera.- Leica lens- Very good picture quality with natural looking colors- 20x optical zoom is impressive. Ability to zoom to 40x with intelligent resolution and maintain very good picture quality.  See the pictures I posted.- Intelligent Auto does a great job picking the best settings for the situation.- Pictures taken with HDR have significantly better exposure- Very good pictures in low light situations- Panorama feature- Very good HD video capability- Many creative picture features- Decent battery life (200+ shots with good mix of pictures, video, and flash).  You should get a spare battery if you plan to be shooting for a full day.- Made in JapanCons- Pictures can appear soft. Intelligent Resolution makes the pictures noticeably sharper.- Pictures viewed at 100% can appear noisy.  This should not be an issue if printing to typical smaller photo sizes.- Panorama feature is nice but picture quality is not as good as regular pictures- Videos with zoom fully extended and be a little shakyI gave the ZS25 four stars because the picture quality does not seem to be as good as my old Panasonic DMC-LZ2.  The DMC-LZ2 takes excellent pictures for a 5MP point and shoot.Overall, the ZS25 is a very good camera with many useful features.  The Intelligent Auto feature makes it easy for anyone to take very good pictures with no effort, which is what many people look for in a point and shoot camera.", "Date": "September 23, 2013"}, {"Title": "Best pocket camera on the market.", "Author": "A. Bose", "ReviewID": "R3J73ZOAWUXJ7Q", "Overall": "5.0", "Content": "I have used the older model DMC-TZ5 for several years and love it. Previously I have owned Sony, Nikon and Canon pocket digital cameras and ended up giving them away. Lumix is by far the best. I wanted to upgrade to this DMC-ZS25 for more MP and the extended Zoom. This is an excellent camera for trips and vacations. It is small, light, compact and fits in your pocket. If you do not want to carry bulky DSLR's and still get lots of functions this is a good choice.The only issue I have is Panasonic did away with the external battery charger. Now the battery has to be in the camera to charge. A USB cable and an external plug is provided. I do not like this system. Should something go wrong you will never be able to charge the battery. This has happened to the SONY DSC P1 a camera I purchased in 2001 for $799.00.Panasonic DE-A65B battery charger adapter will work with this battery, DMW-BCG10PP. Since the spare batteries are sold on Amazon by third party vendors with many negative reviews I decided to purchase the spare battery and charger from Adorama.Another minor issue I have is the microphone is mono and not stereo. This was not a deal breaker because the camera is great and Amazon had it at a reasonable price with quick shipping.If you plan on keeping the camera for a while I would strongly recommend purchasing the battery charger adapter while they are still being made. It is actually a spare part for a different older model.", "Date": "June 29, 2013"}, {"Title": "The Perfect Travel Point-and-Shoot", "Author": "Merle J. Gast", "ReviewID": "R8BJVEK1W4SZE", "Overall": "5.0", "Content": "This little camera does it all very well. I am in my late sixties and I have been a photo buff most of my life. I am so happy to now have my ZS25 for my travel camera. It is very lightweight, simple, sturdy, and it takes great pictures.The 24-480 mm lens is amazingly clear and undistorted throughout the range and the image stabilization lets you use that 480 in situations where you normally wouldn't even try.I shoot mostly with the smart ISO setting. However, having a preset \"scene\" at the ready is very nice and it is simple and quick to change. I normally have mine set to \"through glass\" for candid shots through windows. As if that were not enough this little camera also has full manual settings plus Aperture Priority, Shutter Priority, and exposure compensation. So if your creative juices start flowing you have all the tools available.The HD setting is one I thought I would not use much. However, after a few experiments I now just leave it on. Its biggest benefit is in backlit shots. It averages out a nice exposure almost every time. The HD effect is not the unrealistic overdone effect that you see in the photos making the rounds on the web. It simply brings out some highlights that have been missed in the given lighting conditions. That makes this camera truly a point-and-shoot. All you have to do is pay attention to your composition.I don't know what more you could ask of a point-and-shoot camera. Panasonic has created the ultimate in this model. I once read a wise statement somewhere to the effect that \"the worst camera in the world is the one you left home because you didn't want to bother carrying it around with you.\" You need never be in that situation again. There is always room for the ZS25.", "Date": "September 7, 2013"}, {"Title": "Returned for a Sony", "Author": "Amazon Purchaser", "ReviewID": "R2RHO6EZAJYY66", "Overall": "2.0", "Content": "Sad, but true - I've owned numerous smaller Panasonic Lumix cameras.  The smaller, pocket-size versions all work well and last about 2-3 years before they go bad.  By that time the technology changes anyway, so it's not a big deal for me to think about replacing them with the latest version.They have always been well-made, and delivered excellent quality pictures.  Expected the same for this one.Tried it for over a week, but was just not loving it.  The build quality of the Lumix DMC-XS25 was not as good as it should be.  They seemed to have replaced some parts with more plastic than in past models, and the quality of the pictures was not perfect either.  Disappointing, as I have loved all my other Panasonic cameras and recommended them to others.  I still like the smaller versions they offer, but this one did not deliver.It felt like it was going to break, and the photos at 16 MP didn't seem as crisp and sharp as you'd think they should be.Instead, ended up paying less than $100 more for the Sony DSC-HX20V, which seemed like more of an investment but looking back I cannot imagine NOT doing it.  The Sony is head and shoulders above this Panasonic.  The only downside in comparison is that it's not as fast as the Panasonic (i.e., when you are trying to take pictures in rapid succession the Panasonic is much faster, as the Sony evaluates each photo as it's taken and corrects it electronically).I still like Panasonic, but for this specific camera it's just not up-to-par.", "Date": "April 29, 2013"}, {"Title": "Great upgrade for a Lumix camera fan", "Author": "med_bookworm", "ReviewID": "R1UW1BT1DI170U", "Overall": "5.0", "Content": "I am a previous owner of the Panasonic Lumix DMC-FS5 (and before that the -FX07).  I used these compact point-and-shoot cameras with great glee for the last 5-6 years until the -FS5 put a gray spot in every blue sky two week before I was to leave for vacation in Iceland.  I looked extensively at the other Lumix cameras (I wanted the Leica lens & the features I was used to from the -FS5) and decided to upgrade to the -ZS25 for:- Wide angle lens:  This is awesome for group photos and scenery (and hand-held self-photos). I had this on my older cameras and it is great in this camera too.- Macro mode: I love taking up-close flower pictures.  Unfortunately, this doesn't work as well as on the -FS5 and -FX07 cameras. On the old cameras, I could always force the camera to focus on the flower I wanted; this doesn't always work now with the flower mode in the intelligent auto.  However, when it did focus, the pictures were equally marvelous (or better) than before.- Panoramic mode:  This definitely took the most practice so it doesn't look choppy or have lines; however, once I got the hang of it, this is an amazing function. [see sample in customer photos]- Hand-held night shot:  This function is amazing.  I used it in the Vasa museum in Stockholm (17th c. sailing ship in dim light) and the pictures look in even better light than what it looked like in real life. [see sample in customer  photos]- HDR: This function solves classic problem of trying to get the scenery and sky to look awesome in same photo.  The camera decides when to use this in the intelligent auto mode (so you can't force the camera to do it) but it figured it out most of the time and took amazing shots. [see sample in customer photos]- 20X optical zoom:  I didn't even have the digital zoom turned on and was able to take really great zoomed in pictures without a tripod.  The stabilization works really well.The other note is that I rarely used the intelligent auto mode on my old Lumix cameras because I preferred to choose the mode.  The technology has improved so much in the last 5 years that now the intelligent auto is so much smarter, it did a better job of choosing the mode than I did so I used it most of the time (unless taking a panorama).  I really debated whether to spend the extra $100 (over the cheapest point and shoot Lumix models) and was very glad I did on vacation.I also got an extra battery (Panasonic DMW-BCG10PP ID Secured Battery) and external battery charger (Panasonic DE-A65BB Battery Charger for DMW-BCG-10) from B&H; Photo which allowed me to take more than 250 photos per day and to charge both batteries at night.  This camera does not come with an external charger.  Instead you have to use the (very short) cable to plug the camera in, which is annoying if there is no table at the level of the plug in.", "Date": "September 30, 2013"}, {"Title": "Photos are a little soft", "Author": "Yarii", "ReviewID": "R3PAIMAV1AYRSO", "Overall": "4.0", "Content": "I like this camera although the photos are a little too soft.....still, my favorite Panasonic is the SZ7 which is cheaper, but also more basic in features. Panasonic Lumix SZ7 14.1 MP High Sensitivity MOS Digital Camera with 10x Optical Zoom (Black)  At the time of this review, the SZ7 is over $100 cheaper in price but it does not have P/A/S/M and only 10X optical zoom. They both start-up fast, faster than any other cameras I own/have previously owned, fast focusing (unless you are zooming out at the max), fast shutter response, fast recycling to take the next photo due to the CMOS sensor. (I always use Class 10 SDHC cards). If only the SZ7 had full manual controls, it would be THE perfect camera as the photos are much sharper to my liking.PROS:-- The ZS25 is a fast camera for focusing, shutter response, etc.-- Colors are good, natural. Not abnormally bright or vivid unless you have it set on vivid.-- Leica lens - LOVE Leica!-- You can optically zoom during the video and the zoom motor is quiet.-- Metal body (aluminum?) - although it sounds like plastic when I tap on it, it has good build quality.-- CMOS sensor.-- Creative Controls: Like these, some never available in previous Panasonic cameras-- Made in Japan!CONS:-- Too soft, I can sharpen them up only so much in photo editing. It seems like several Panasonic cameras I've tried in the past year or so have been too soft for my liking. I guess most people like softness or Panasonic would change it. Hmmm...-- No separate battery charger, the battery charges inside the camera. This is starting to become the \"new normal\" with most camera manufacturers, except for the LX7. Quit being so cheap Panasonic, supply us with a separate battery charger!-- No RAW, for the RAW enthusiasts (I am not).The 1080 video is decent, but not as good as Sony cameras provide. Battery life - pretty much average. I got 200 photos and a couple videos before the low battery indicator was down to 1/3 left.I've always loved the Quick Menu feature on most Panasonic cameras. What I don't like on this camera is they eliminated the playback switch, now it's a button. On older Panasonic cameras, I kept the Playback Switch on playback when I put the camera in the case, as that prevented accidental zoom of the lens if the camera accidentally was turned on inside the case. You can't do that with this camera.I struggled with the star rating on this camera, 4 stars is all I think this camera deserves (since Amazon's definition of 4 stars means \"I like it\", and 3 stars means \"it's OK\". Panasonic should have done better. This camera replaced the ZS15. When new cameras come out, you are always hoping they are better than what they are replacing. If you're happy with your ZS15 (or ZS20) there's no reason to upgrade to the ZS25; I wouldn't even call it an upgrade, it's more like a downgrade. If you don't care about having manual controls, check out the SZ7 (see link above) and save some money.", "Date": "April 15, 2013"}, {"Title": "Great little camera", "Author": "Anastasia Yeager", "ReviewID": "RLV916FTBVBIK", "Overall": "5.0", "Content": "I have had three Panasonic Lumix cameras in my lifetime. I went with a Sony for a time and was so disappointed in the picture quality that I could not wait to go back. Found a great deal through Costco for $229. (Sorry Amazon. I love you but $70 is a big savings so please forgive)Took a picture of Mt. Shasta right away. Yes I can see Mt. Shasta from my house. Not Russia. Great picture quality from the get go and this was late afternoon. Imagine what great pictures you could take under optimum lighting conditions. I'm so happy to have a Lumix again. That lense is just to good for words.", "Date": "September 27, 2013"}, {"Title": "Poor quality", "Author": "Ryan L. Wilson", "ReviewID": "RK1R0DHWFTYV1", "Overall": "2.0", "Content": "I have had numerous different models of the Panasonic Lumix and each new one seems to be just a bit more cheaply made than the one before.  This model went beyond the tolerance threshold for low-quality.  This camera has one of the widest angle lenses on the point-and-shoot market and thats why I bought it, but fewer menu options and more plastic parts are not signs of a good product.  I use these cameras several days a week, but not for anything where crystal clarity is required in the photos, so the fact that ALL the photos are just a bit fuzzy was never that big of a deal.  What bothers me is that the LCD screen on the FIRST DMC-ZS25S I bought went bad after 2-3 months.  I figured it was my fault and replaced it with another identical camera without even thinking about sending it in for Warranty service.  stupid me.  The LCD screen on the SECOND camera went bad in less than 2 weeks!!!!!  This one I sent in for warranty service and, after having it for a full MONTH, Panasonic refused to cover the screen and wanted me to pay $180 to fix the damn camera!!!!!  There was NO visable damage and the camera looked like it had just been taken out of the box!!!!!  Of course, there is no way to appeal this decision.  My new paper-weight makes me angry every time I look at it.Do not buy Panasonic electronics, there are other companies who at least honor their warranty contracts.", "Date": "September 25, 2013"}, {"Title": "Camera Gets 5 Stars Amazon Gets 3 Stars", "Author": "D. Allen", "ReviewID": "R36YM0U0ZFZAMF", "Overall": "5.0", "Content": "This camera gets 5 stars for the way it looks and performs.  The photos are very sharp and the directions easy to undertand.  I took the disc in to be printed out on paper as I prefer hard copies.  Now for the bad:  I received this camera in a manila envelope and no protection except the box.  I filed a compaint on that with Amazon.  I also did not get the card for photos as stated in the ad.  Ad says it is sold and distributed by Amazon.", "Date": "December 16, 2013"}, {"Title": "As Pleased as I was with the Lumix LX3", "Author": "Mary Dickinson \"Legal maven\"", "ReviewID": "R2PV4X1CW2578D", "Overall": "4.0", "Content": "I was looking for a quality, fixed lens super zoom camera. I tried a Nikon but was very disappointed.Too much plastic and too big.  I did my homework and purchased the ZS25 (did not need the bells, etc. of the ZS30).This little camera is very sturdy, and reminds me of the LX3 (the finest fixed lens, point and shoot compact ever made!) The menu is logical and very easy to master. The picture quality is excellent, and I simply love the feel of the camera. I never comment on the video of any of these cameras, as I wish there was no such capability. I never use it.My DSLR cameras  are Canon, my compacts are Panasonic/Lumix, and my first retro is a Fuji X E1. I have purchased my cameras over several years, and use each of them often. This being said, the Lumix LX3 for outdoor shooting is just wonderful, and its newest cousin, the ZS25 is well worth looking into if you need a fun zoom camera for travel. OK, I admit, I love to collect cameras, but I do so after trial and error. (My Canon xti remains my favorite DSLR)Have fun!", "Date": "September 11, 2013"}, {"Title": "Best Choice After a Long Search", "Author": "R. Alan Martín", "ReviewID": "R1LI8RH64YKT2S", "Overall": "5.0", "Content": "First of all I want to address a few of the negative reviews I've read about this camera.I'm not sure I'd give a camera a bad rating for the failure of a battery. If a camera is requires frequent charging, that's one thing. But a battery failure after several months--?  My opinion-- I've  had the camera several weeks and I've no problems with excessive battery usage. I did purchase the Wasabi battery package--2 spare batteries.The other problem noted was the brightness of the screen in bright sunlight. Read the instructions on the monitor settings to make sure it's set to the mode that automatically adjusts the brightness for the LCD. Finally, there were comments about \"soft\" images--again check the manual to make sure you have the settings on \"fine.\"The flash--with any point and shoot or DSLR it's best to get get an LED bar and turn your flash off. The effective range of the flash in these small cameras is minimal--don't expect amazing results from the small flashes fitted in point-and-shoot cameras.The next are for cameras in general, including a comment or two for this model:In general, on reviews for almost all cameras there's the \"zoom issue.\" Well, it's cinematography 101 not to use/overuse a zoom. If you look at TV shows and movies they use fixed shots, with cut-aways. Zooming, if used at all, tends to be a tight (close-in) shot that goes wide-- you just don't see the zoom-in and zoom-out on professional production works.Please be sure you purchase a \"Class 10\" SD card with a very high write speed.The two other cameras I strongly considered prior to my purchase of the ZS25 were the ZS20 and the Canon  SX280.The ZS20 has documented problems with both zoom failure and lens/sensor dust. I guess the price was right, so there was high volume sales of that model--it does have GPS but that sucks the battery dry if it's on. So unless you need it--? The other feature is the touch screen, but I've always had problems with \"touchy\" touch screens. Personally, I don't like touch screens on my cameras, but just my preference.The Canon SX280 is great if you want to buy a camera with a video that doesn't work. Why anybody would spend that amount of money on a camera, when the video doesn't work? I don't understand it. You can tell it's a design defect, otherwise there would be plenty of \"refurbished\" units on the market. There are none--the bad units are returned to Canon and written-off as a loss.If you want a well-built camera made in Japan with manual and automatic controls, this is for you! Sharp photos with terrific colors--I'll post some photos later. I think you'll be totally happy with the ZS25! I'm happy I made this my camera of choice.", "Date": "April 5, 2014"}, {"Title": "OK as long as you don't need service", "Author": "Pikup Andropov \"E. Reed at myereader.blogspot\"", "ReviewID": "R3AC3PWW1J4QMX", "Overall": "1.0", "Content": "This is actually the second Panasonic Lumix I  purchased, but I will never purchase a Panasonic product again.Why? Very simple - service is horrible.While still within the one year warranty period, my camera malfunctioned required I send it to a Panasonic Repair Center.  Easy enough to get authorization online and I included a copy of my Amazon purchase receipt and sent it off by USPS Priority Mail.  That was well over a month ago and I still don't have my camera.  What's worse: Panasonic never communicated to me once during this entire time unless I first called or emailed to them.  No email \"Camera received\".  No email \"Work in Progress\" .  No email \"Expected completion date\".  Nada, zip, nothing.Originally, I had hoped to get it back within 3 weeks to take on an overseas trip.  Ah what a fool I was.  My first email to Panasonic after 10 days to 2 weeks was \"status of my camera\" please.  I at least confirmed that Panasonic had received the camera, when the return email said \"status: with repair technician\".  I took an older Lumix (DMC-ZR1) that was good camera, but actually needs service, but is operational (I wouldn't dare send it to Panasonic now).  I kept writing every week, same response \"In repair\".  When I returned to the US, and no camera had arrived and over a month had passed, I was really angry.Finally, after I called they said it was shipping the day I called.  How did they ship it?  The slowest possible way - Fedex ground (OK, I know UPS ground could be slower). So sometime next week, more than a week after they shipped I should receive my camera.  If I am lucky that will total 45 days.  If am really lucky, the camera will work.All through this Panasonic has been awful.  Other than \"I apologize\", but not a single offer of a discount, or credit or anything.Good cam if you don't ever need service.", "Date": "October 31, 2013"}, {"Title": "Takes HORRIBLE pictures!", "Author": "Miss D", "ReviewID": "R2XNMP7SXBBXHI", "Overall": "1.0", "Content": "I ordered this camera because of the wonderful online reviews, but am VERY disappointed with the quality of the pictures! Pictures taken outside are pretty good, but I haven't had a single indoor picture...especially of people...turn out well. Faces are never clear and it doesn't matter if I take it up close, farther away, with the zoom, without the zoom, with a flash, or without a flash! I am returning it and resuming my search for a camera.", "Date": "August 8, 2013"}, {"Title": "Nice Camera", "Author": "Mark W. Gagermeier", "ReviewID": "R26XB84JFTIF8A", "Overall": "4.0", "Content": "I bought this camera as a replacement for an older Panasonic Lumix that took a swim in the toilet (yuk...).  I should have reviewed this camera a little better before  my purchase though.  There is nothing wrong with this camera, it just that the older camera had a few features that made using it a little easier to use. For instance, the ON/OFF button on this camera is small and recessed into the body.  Not as convenient as a slide switch. The photo/movie review button is tiny and recessed into the body, also not as convenient as a slide switch. The older camera had stereo sound recording, this one is mono.The zoom is great and 16 MP results in great looking photos.  Once I get accustomed to this new camera I will not miss the older one... too much...", "Date": "August 27, 2013"}, {"Title": "Retired pro photographer: Poor image quality. Returned it after one day of shooting.", "Author": "bruceb100", "ReviewID": "R4R91UAURQSGH", "Overall": "1.0", "Content": "My wife and I tested this camera for one day. We tested it thoroughly in various ambient lighting situations and with the flash. The zoom range is amazingly wide but the image quality is amazingly poor.  We have a 2009 Canon 8 megapixel camera kicking around and after noticing the consistent softness in the Lumix images and the overly aggressive \"smoothing\" (that cannot be disabled), we compared images side by side with the old Canon A590IS. The old 8 megapixel Canon, which would today sell on eBay for about $25 bucks, absolutely blew away the Lumix on sharpness, shadow detail and especially on highlight detail.  The Lumix images looked washed out, soft and noisy side by side compared to the Canon A590IS images.", "Date": "January 18, 2014"}, {"Title": "Takes poor quality, grainy photos", "Author": "Wandering Eye", "ReviewID": "R2RPEUXUQ8HAH", "Overall": "2.0", "Content": "I tried this camera out for a few days, and returned it because all of the photos are poor quality and grainy.  While the image resolution is high, it appears as though the JPEG compression setting is too low, and it cannot be made higher.  I took the photos of the same scene with this camera and an older, lower resolution camera that did not compress the JPEG as much, and the difference was very obvious.  Otherwise the camera has great features, but none of that matters if the photos display notable image compression artifacts.", "Date": "August 18, 2013"}, {"Title": "Crippled Camera", "Author": "Why \"Why\"", "ReviewID": "R3UOS2CO50D3U2", "Overall": "1.0", "Content": "This ZS25 is my third Panasonic Travel Zoom.  It replaced a ZS20 in which a wire came free inside the lens after 14 months.  Panasonic's repair cost is comparable to the cost of the ZS25, so I decided to try the newer model.1.  It's very difficult to see this screen in bright sunlight, unlike the ZS20.2.  For some inexplicable reason, all the features only seem to work in the iA mode.  In P, A, T, M mode, the lens won't zoom past 3x and the digital zoom is disabled.  Since this camera tends to overexpose and you can't compensate in iA mode or bracket, this is a serious problem.At this point, I'm switching to a different brand because it's disconcerting that a wire would break free inside a lens two months after the warranty expired and the ZS25 is so bad.", "Date": "July 1, 2013"}, {"Title": "Don't recommend the ZS25!", "Author": "Shamayah", "ReviewID": "R3QRGCXC55ZJGR", "Overall": "1.0", "Content": "I love the Lumix cameras, but not the ZS25.  Photos blurry, not bright, crisp, and clean as they are with the ZS19, ZS20, and even earlier models.  Purchased the ZS25 at Costco a week ago after killing my DMC-ZS19 and am returning the ZS25.  The sales person there advised this model is a compromise, between longer battery life than previous Lumix models and less photo clarity.  I'll take photo clarity over longer battery life any day - easy enough to keep recharging the battery and/or purchase a 2nd battery.I own a Nikon D3S, D7000, and Canon Rebel with the best quality lenses that I absolutely LOVE and use almost daily, BUT I like a simple pocket camera when I don't feel the need for a DSLR around my neck.  The ZS25 is NOT the one for me!  Yuck!  I wouldn't recommend this to my friends.", "Date": "May 29, 2013"}, {"Title": "These cameras are great!", "Author": "Ergin Salih", "ReviewID": "R1NKJZ8DWRBR8W", "Overall": "5.0", "Content": "I purchased this as a Christmas present for my son and so far it is performing perfectly.  These types of Lumix cameras are wonderful, we have had these type for years and they just keep working.  We started with a 7MP version (can't remember the model number) with a 10x zoom and it just worked (no HD recording back then), it was easy to use and started up quickly. The thing that drew me to this camera range was the lens, these cameras use Leica lenses, for the uninitiated Leica is a German manufacturer of high quality cameras and lenses, remember that the image has to get to the sensor via the lens, if the lens is no good the sensor gets crap and the image suffers.I got a DMC-ZS20 last year and it was equally easy to use, mode mega pixels and HD recording, this time with 20x zoom like this model.  The build quality is awesome, these cameras look like they can handle the day-to-day knocks that they will experience.The question I get a lot is why bother with a dedicated camera when you have a smartphone with lots of megapixels.  I suppose it depends on what you want to use them for, for day-to-day pictures when you don't have your camera around the smartphone works, however for more serious subjects (like weddings, birthday parties etc) then a dedicated camera (in my opinion) gives much better results.Some of the features that are cool with this camera, the 20x zoom mentioned above,  different picture taking modes including full manual, battery life, the size (they pack a lot of technology in to a small space), one touch HD video recording.Overall a good camera that performs well and produces good pictures in many situations.", "Date": "February 23, 2014"}, {"Title": "Good wide angle camera", "Author": "Barbara Almli", "ReviewID": "R1FRR36AYHTSOM", "Overall": "4.0", "Content": "Takes good wide angle photos which is why I purchased it.  I like the small size and I especially like the fact that the battery is charged by plugging the camera into the computer.  I always felt that using rechargeable AA batteries in my Cannon was a pain as they didn't seem to hold a charge.  The camera would be perfect if it had a viewfinder.", "Date": "September 7, 2013"}, {"Title": "Nice but not as nice as it's predecessor", "Author": "RIK", "ReviewID": "R1WAYYYD5FMHCI", "Overall": "4.0", "Content": "Have personally tried several compact superzooms in the last 3yrs - Canon SX260HS, Sony DSC WX300/HX20V/HX9V, Samsung WB750, Nikon Coolpix S9100, Casio Exilim EX ZR100 and Panasonic Lumix DMC-ZS19 and found the Panasonic to be best overall. However I was a little disappointed when I upgraded to the Panasonic Lumix DMC-ZS25.It's still a great camera but a \"downgrade\" in some ways - the touch screen is gone as has the high speed video (those weren't big deals for me) but the bigger problem was artificial limitations on the optical zoom. The zoom cannot be used with panorama mode forcing the most distant view in panoramas and if you zoom on close by objects ex. trying to capture a flower without bending over the camera doesn't focus after a certain zoom level. Not sure why the designers turned off support for these creative use cases.The camera is still sturdy and slim for a 20x optical zoom. The very wide angle 24mm Leica lens and the Power OIS work well allowing full use of the 20x optical zoom. The photos and videos are still nice overall.", "Date": "December 19, 2013"}, {"Title": "Panasonic Lumix DMC-ZS25 is terrific!", "Author": "John B. \"John505\"", "ReviewID": "R2BMBAXZEDKJKZ", "Overall": "5.0", "Content": "I purchased this new model just before heading off to Europe for a 30-day vacation.  I literally read the manual on the departing flight.  Not only is the ZS25 small and very easy to use, it is very flexible in its functionality and takes spectacular pictures.  For example, we visited many ancient churches in Italy that have amazing artwork.  In most cases, no flash is allowed, which is a good thing.  And, the churches are often quite dark inside.  But, I still got spectacular photos.  In some cases, I couldn't really see much detail with my eyes, but the camera could actually see the pieces with truly remarkable detail and clarity - and I didn't even have a tripod.I did a fair amount of comparison shopping before purchasing this camera, and I am very happy with my choice.  Although it does not have an optical viewfinder, the high resolution display does an admirable job even in bright sunlight. It easily fits in a pocket, is very comfortable to hold (which many of its small competitors are not) without inadvertently hitting any controls, has minimal shutter delay,  and is available at a very fair price.  I strongly recommend that you check out the Panasonic DMC-ZS25 if you are interested in this type of camera.", "Date": "June 27, 2013"}, {"Title": "Extraordinary performance!!!", "Author": "Amazon Customer", "ReviewID": "R3R2K52XSE0LE7", "Overall": "5.0", "Content": "I already own aZS10, and it's a very good little camera, but recently, I used it for a wedding. The wedding pictures were excellent, but the wedding dinner afterwards, was held in a dimly-lit restaurant and it failed miserably. Not happy. I got the ZS25 to remedy that and have been extremely pleased with results I am getting in low-lite situations. Problem solved.", "Date": "March 20, 2014"}, {"Title": "Not the best solution for all point and shoot needs", "Author": "Vladimir Bajic", "ReviewID": "R2TSYPI5AHDQAD", "Overall": "2.0", "Content": "I think that this is great camera as long as you do not attempt to print a photo on letter size paper. Results will not be that good. The main problem that this system has is that it compresses JPEGs to 180 dpi. Thus, trying to do any re-touching is out of question. So, if you are planning to do 6x4 prints, email family and friends, or upload to the Facebook, this will do great. Focus is fast and I had no problems catching up with my 4 year old. However, I need something that can print on larger paper, and for 16MP, results were unacceptable. I have exchanged it for Nikon Coolpix 9500S", "Date": "June 23, 2013"}, {"Title": "Great pocket camera for general use.", "Author": "Jean Marc Filion", "ReviewID": "R1TTPWWWJ0CGUM", "Overall": "4.0", "Content": "This 20X zoom camera is great for those quick pictures that would otherwise escape you.  The zoom is a little slow in focusing but the extra 3-5 seconds it takes is worth the wait.  The stabilization feature works well and even with a big zoom there is little blur.", "Date": "April 21, 2014"}, {"Title": "great value for money.", "Author": "skipper", "ReviewID": "R2ZI15ZBUBIJ7D", "Overall": "5.0", "Content": "Compact, light and ez to use. Great value for money for a Leica lens. Shipped quickly and free case and 16GB mem card a bonus.", "Date": "April 20, 2014"}, {"Title": "Great camera", "Author": "John Metz", "ReviewID": "R1VWDVM0HLAZAA", "Overall": "5.0", "Content": "This is my second Lumix and I continue to be very happy with the features and performance of the camera.  The camera has a slick panoramic shot feature; it is compact, light and has very little delay when turning it on.  The Leica lens supports clear, sharp pictures.", "Date": "April 15, 2014"}, {"Title": "Awesome, awesome, awesome", "Author": "Jeepnick", "ReviewID": "ROQC5JE5CV90A", "Overall": "5.0", "Content": "I have had a number of smaller digital cameras and this one is the best yet.  My last one was a Nikon and I had Canon before that.  This one has a bigger zoom than the others, the steady shot works awesome and best of all it takes AWESOME pictures in low light.  Oh yeah, it is super fast to focus and shoot too.  All around a fantastic camera that easily fits in a pocket.  I highly recommend this to anyone.", "Date": "April 9, 2014"}, {"Title": "Not expensive for what you get.", "Author": "chameleonwatcher", "ReviewID": "R20CID5RQPKKCF", "Overall": "5.0", "Content": "Great small camera to carry in my purse everywhere I go.  The 20X zoom really is a good feature and the pictures are high resolution.It's easy to use and you get the bang for your bucks on this.", "Date": "March 28, 2014"}, {"Title": "My 3rd Lumix", "Author": "Bonnie", "ReviewID": "R2H660BK3AC0F9", "Overall": "5.0", "Content": "Just love this camera brand! Panasonic Lumix!  I especially like the optical zoom. I've used many different cameras in over 30 years and I like to carry this one in my bag everywhere. I just keep it on automatic. Very simple. This is my 3rd Lumix.", "Date": "March 17, 2014"}, {"Title": "Review of Lumix DMC-ZS25", "Author": "James Wise", "ReviewID": "ROMUMWOYG038W", "Overall": "5.0", "Content": "Possibly the best of the pocket cameras.  High light sensitivity, excellent image quality and stabilization, and a huge zoom range for such a small camera.  The Leica lens is superb.  Will do at least 90% of what an SLR will do, but will be there when the big camera is not.", "Date": "March 16, 2014"}, {"Title": "OUTSTANDING CAMERA", "Author": "jJOHN", "ReviewID": "R3IVANRBWZHQKV", "Overall": "5.0", "Content": "This is my fourth panasonic travel camera and the best yet. Easy to use and pictures are great whichever mode I have selected.", "Date": "March 15, 2014"}, {"Title": "Top notch point and shoot", "Author": "Sheila Whiting \"artist\"", "ReviewID": "R1092RFX87CR1M", "Overall": "5.0", "Content": "I bought this camera in January as a replacement for the same model that was stolen.  I had it for several months and loved it. I have had Nikon's and Cannon's and been very pleased with them as well.  Two friends own Lumix, and the quality, ease and convenience of the point and shoot very much appeals to me. I own an SLR as well yet use the point and shoot much more often.  I highly recommend this model for those on the go, traveling and wanting to be able to capture \"in the moment\".", "Date": "March 15, 2014"}, {"Title": "Great camera for the price (even if it cost quite a bit more)", "Author": "John T.", "ReviewID": "R2G4YU0JZPJNA6", "Overall": "5.0", "Content": "This is what I was expecting when I bought a ZS7 a few years ago.  That had great specs and poor picture quality.  Panasonic got it right with this one.  I can go full zoom and then look at it up to 50% on my computer screen without seeing any noticeable graininess.  With the ZS7 a full zoom shot looked grainy at 16% on the screen.  Macro on this is much better as well.  It even has a modest HDR routine if it senses a picture is backlit - I got some nice low-angle shots of tidepools with some cloud detail in the background.  I can't do that without post-processing with my DSLR. Very happy customer.", "Date": "March 2, 2014"}, {"Title": "very good point n shoot", "Author": "James Spence \"jim s\"", "ReviewID": "R15H87XM2CNO8T", "Overall": "4.0", "Content": "best point and shoot i've owned (i have a fuji, kodak).  It is used for work site pictures and has been no problem.  Would give it a 5 if it used regular batteries.", "Date": "February 28, 2014"}, {"Title": "Nice unit", "Author": "Gary W", "ReviewID": "R9W4F43ZZEFET", "Overall": "4.0", "Content": "I have used it on a pretty limited basis but it seems like a great little camera.  Amazing zoom - very precise and clear, which is precisely what I was looking for.", "Date": "February 21, 2014"}, {"Title": "So fast and crisp pictures!!", "Author": "Linda S. Elmore", "ReviewID": "R1VFBW8IYO1OMK", "Overall": "5.0", "Content": "I am so happy with my new Panasonic camera, let's me take pictures quickly and the pictures are very crisp.  Also, love the 20xzoom and the plug in recharging for batteries.  Easy & fun.", "Date": "February 12, 2014"}, {"Title": "I love this camera!", "Author": "Geraldine Dean", "ReviewID": "R2O9WZQZYZ2MHS", "Overall": "5.0", "Content": "I previously had bought a Nikon that was WI-FI ready. It just didn't take the quality of pictures that this Panasonic takes. I took back the Nikon and bought this Panasonic camera. It has a 20x zoom and I have taken pictures of my grandchildren playing sports. I was in the bleachers on the opposite side of the gym and used the zoom. The pictures looked like I was right there instead of far away. The pictures are clear and the camera is easy to use.", "Date": "February 4, 2014"}, {"Title": "lots of bang for the buck.", "Author": "donna mccann", "ReviewID": "RVPV64TIKG7PZ", "Overall": "5.0", "Content": "vivid, clear, ease of use, lots of zoom, good macro, lots of fun editing options as well as shooting options.", "Date": "November 4, 2013"}, {"Title": "Lumix Quality Brings Me Back.", "Author": "John B. Hoehn", "ReviewID": "R3JGZIC7BF7LE4", "Overall": "5.0", "Content": "I've owned several Panasonic cameras both point and shoots and the 4/3 changeable lens mini-SLR system.  But I decided to try a Canon point and shoot last time.  It worked for a little while, had touch screen controls which means you are tapping and retapping all the time and smearing the screen.  A few days after the 1 year warranty the Canon got a black spot on the screen, and would have cost $135 to repair, so I bought this camera for about $180, it had better Zoom, it uses switches instead of touch screen, it takes good pictures in a small pocket-able format.  Lumix, I'm back and will stay here!  Great little camera.  Great price.  Sorry Canon.  The only thing the Lumix needs is an optical viewfinder so you can take pictures outside in the sunshine!  With that it would be perfect, perfect.", "Date": "September 6, 2013"}, {"Title": "Very Pleased", "Author": "Amazon Customer", "ReviewID": "R3O2RIO0TN3XEN", "Overall": "5.0", "Content": "We purchased this as our travel camera because our Canon SLR is too big.What a beautiful camera.  Very small, zoom is excellent, but most of all the camera takes amazingly clear photos.  It is perfect if you want decent quality pics while on the road.  My brother had told me the Leica lens would be excellent, and he was definitely right.  Highly recommend this for anyone who needs a decent, but reasonably priced, point and shoot digital camera.", "Date": "September 6, 2013"}, {"Title": "A fantastic little camera", "Author": "Allan D. Lieberman", "ReviewID": "R64LY5Z6XCVBY", "Overall": "5.0", "Content": "This is my third Lumix and I am amazed at the sharpness of these pictures. But there are features on this camera that I do not understand and the instruction booklet is very poorly written and printed.", "Date": "August 15, 2013"}, {"Title": "No Remote, No Voice Notes", "Author": "R. Roberts", "ReviewID": "R2S05QLCWPLSN4", "Overall": "4.0", "Content": "fwiw, I am a big fan of the lumix line, but I hope that panasonic reconsiders two important features that are a big reason why I decided not to upgrade to this model.No Remote Control Option... other camera oems such as canon have it on most of their cameras, but only the high end lumix cameras even have the option.  The ability to trigger the camera remotely is essential for many photographic needs.\"Voice Notes\" option has been removed.  Earlier point an shoot lumix camera's had the option to automatically capture voice notes following each image snapped and the notes were stored as audio files with the same filename as the jpg's.  For some reason, panasonic dropped this valuable option a couple of models back.Panasonic is unlikely to view... or care about... these notes, but, if the above points are something you need, know that they are not available on this and most of their small cameras.", "Date": "March 13, 2014"}, {"Title": "Best Point and Shoot Ever", "Author": "Hurricane", "ReviewID": "R3FP5YIQSQAQ2C", "Overall": "5.0", "Content": "This is the 3rd Lumix camera I've had since 2007 (the first one died after 3 years of heavy use and the second one was damaged due to my carelessness).  The quality of the pictures can't be beat in a point and shoot camera.  Any camera which can compensate for my horrible picture taking abilities and produce high quality pictures is a plus in my book.  I especially like the 20x digital zoom in this camera The Lumix DMC-ZS25 has not disappointed me.  I highly recommend this product.", "Date": "December 6, 2013"}, {"Title": "Disappointed.", "Author": "J.J.", "ReviewID": "R6HB2WF68JZ0A", "Overall": "3.0", "Content": "First of all, Amazon shipping did a great job. The delivery date was shown to be Dec 2nd, but it was actually delivered on Nov 29 so that I could use that for my daughter's birthday party. Thanks, Amazon.The camera looks great and the 20x optical zoom is amazing. The build of the camera is great. It feels solid and the grip is very comfortable to take shot using only one hand.Although I haven't had enough time to play with it, the performance is not so good as I expected. The outdoor shots are great. The color is so vivid. 20x zoom is great, but sometimes has trouble to focus with high zoom number. The indoor shot is not satisfying. Maybe it is because that I only use the iAuto mode (I guess?). The pictures are blurry and it looks like that camera tried to smooth the picture and it tried too hard. More than half of indoor shots are blurry and zoomed pictures are not good either.I will give myself some more time to learn how to use this camera. But I am a little disappointed and at least I think the iAuto mode did not handle low light very well.", "Date": "December 2, 2013"}, {"Title": "I LOVE PANASONIC LUMIX!...HIGHLY RECOMMENDED", "Author": "Annette S.", "ReviewID": "R1RUZ0VDCOZ2CN", "Overall": "5.0", "Content": "I love the picture quality, the video quality, the \"scene\" options, espescially the sports and sunset options....i'd never buy anything BUT a Panasonic lumix!...I tried all the top cameras...[point and shoot cameras.]..and sent them all back but this one...HIGHLY RECOMMENDED! This camera produces picture quality as good as my friends dslr. It also has options to do creative retouch right through the camera itself. Everyone tells me my pictures are  beautiful, and I have blown up scenery and other pictures  to 16 by 20 inches, with no blur! If you love photographing your grandchildren at play, or hummingbirds and stopping their wings in flight, or a butterfly landed on your lilacs, this camera is for you!The zoom is amazing! And my sunset pictures I've blown up to 16 by 20 have sold, framed, for $75.00!....Eventually I hope to buy a Panasonic DSLR, but for now i'm very happy with this one. The price you cannot beat!, especially through Amazon.com I would recommend buying extra batteries so as to never risk missing your perfect shot! I got a battery 2 pack, plus charger, through Amazon. You plug the battery into the wall and charge, plus it came with a car charger. When your battery low warning comes on, just grab a new one fully charged and you're ready to go! I really do rate this camera a #5 star!", "Date": "June 2, 2014"}, {"Title": "Great Little Camera", "Author": "lynn Harms", "ReviewID": "R1XZJ5LY3HEGBZ", "Overall": "4.0", "Content": "Bought this camera for my wife before a trip to Israel.  she loved it.  found it very user friendly and got some great shots during our tour.  Enjoyed the ease of changing modes and found the options to be very useful and easy to use.", "Date": "June 2, 2014"}, {"Title": "Another great Lumix", "Author": "M. Reed", "ReviewID": "R1J2Y5YG997U2N", "Overall": "5.0", "Content": "This is the 3rd or 4th Lumix I have owned. I would have been happy with the same specs as the ZS-1 that we had before this camera. However, I am very impressed with the 20X zoom. Even when taking pictures from a moving boat, I am still able to get reasonable well focused pictures at full zoom, better than I would have thought possible. Exposures are very accurate in a wide variety of conditions. I don't need 16Mp resolution, but fortunately I can dial it down to 5Mp and save on storage and download time.", "Date": "May 25, 2014"}, {"Title": "Exceeded my expectations", "Author": "Mason", "ReviewID": "R3GKRIQ6CFPMX8", "Overall": "5.0", "Content": "Fantastic camera for the price.  The 20X zoom works great - sharp, clear close-ups from an almost unbelievable distance.  I would recommend this camera for those wanting features of an expensive camera at a bargain price.", "Date": "May 22, 2014"}, {"Title": "Okay camera for the price", "Author": "Tracy A. Gourlay \"tag\"", "ReviewID": "R2X0SUUYC32ZCE", "Overall": "4.0", "Content": "I have several cameras, dslr, 3D, and an upscale point and shoot, but I wanted a pocket camera and decided on this one. Some features are great like the macro! I photographed a black ant and could see the hairs on it's back! It cannot take a macro shot of a snowflake though, but wouldn't expect it to being just a pocket camera. I love the panarama feature. It's easy to operate and the pans come out clear! Not impressed with the zoom. The pictures tend to come out blurry when zoomed at full length even with a tripod.I got this camera to take on trail runs and 5k's. It's light enough to carry with me. So for the price, it serves its purpose. I am impressed with the macro and the panarama. It takes better macros than my DSLR.", "Date": "May 20, 2014"}, {"Title": "awesome", "Author": "Darlene Gladhill", "ReviewID": "R5UKNLEEW7WOM", "Overall": "5.0", "Content": "i love this camera the zoom is 20x which i love that...the picture is very good....great video full hd...love this camera", "Date": "May 9, 2014"}, {"Title": "Best Compact Camera Ever", "Author": "rockycard", "ReviewID": "R1EN096OPC79PY", "Overall": "5.0", "Content": "Owned an older model, this was a replacement, and was it ever a GOOD ONE! Has excellent features and is very easy to use! Would definitely recommend! Pictures and video are fantastic quality!", "Date": "May 5, 2014"}, {"Title": "Lumix DMC-ZS25", "Author": "Eva G.", "ReviewID": "R15WWGK79LF49J", "Overall": "5.0", "Content": "This was my 4th Lumix ZS25 and I knew in advance what I was getting. Excellent camera to throw in your purse for everyday photos! The photos are sharp and the 40x zoom on Auto is a real bonus! I highly recommend this model...", "Date": "May 4, 2014"}, {"Title": "excellent point and shoot camera for $200", "Author": "Michael Lee", "ReviewID": "R3PO7QYOSN760Q", "Overall": "4.0", "Content": "Bought it for my trip to China did everything I needed it to do. 20x zoom is neat but didn't need that much zoom. Rotary knob on top feels flimsy. I like not having to remove battery to charge.  For $200 can't go wrong. No case included. Lumix case bought separately is kind of chintzy but does the job.", "Date": "May 3, 2014"}, {"Title": "Soft picture quality", "Author": "a fan", "ReviewID": "RHCZA9TWABHXV", "Overall": "3.0", "Content": "I had to replace my DMC-ZS19 as it got a spot on the inside of the lens- quite annoying.  I liked the size and picture quality although you need to frequently enhance the images with iPhoto.  I purchased the ZS25 and am returning it one day later.  Picture quality for some photos of flowers around my house was quite good.  However, I took some landscape shots of San Francisco and Sausalito and the picture quality is just not acceptable to me.  I like the Panasonic cameras but I don't think this one is a keeper.", "Date": "April 29, 2014"}, {"Title": "Great simple P&S; camera", "Author": "Fred Chittenden \"DrFredC\"", "ReviewID": "R1XMV9V2CAJ5KP", "Overall": "5.0", "Content": "Got this for my wife.  She loves it.  Quick start, very good intelligent mode, nice panorama and other modes too.  You can add a polarizing filter if desired to get professional looking dark blue skies and less glare in many pictures.  Excellent 20x zoom plus great macro mode pictures of flowers. Excellent video.  Doesn't have wifi or touchscreen like it's cousin the zs30, but otherwise is pretty much the same camera for a lot less.Charges with a USB micro cable, which means you don't have to carry a battery charger, just have access to a USB port.  You can also charge the battery with a smartphone backup battery device via USB micro.  I bought a couple spare batteries and plug-in charger.", "Date": "April 29, 2014"}, {"Title": "Complete satisfaction !", "Author": "nancy ibold", "ReviewID": "R1SLYX6XKYP6JR", "Overall": "5.0", "Content": "The perfect pocket camera for EVERY situation!It answers every need I have and MORE ...What else can I say ?", "Date": "April 26, 2014"}, {"Title": "Excelent camera, great pics", "Author": "Oscar Cuervo", "ReviewID": "R12RUKU7D1P0H7", "Overall": "5.0", "Content": "It takes very good pictures, good zooming, recomend this product. Good resolution and speed even when you take pictures at night.", "Date": "April 26, 2014"}, {"Title": "A fine little camera", "Author": "C. Gwen Jacobson", "ReviewID": "RSBB3BO1NMOX1", "Overall": "5.0", "Content": "This camera is compact, takes excellent photos and is easy to use. I bought it because I wanted the 20x telephoto nestled in a compact camera. This fits the bill. I'm very pleased and would recommend this camera to anyone who wants a good quality. compact camera at a reasonable price.", "Date": "April 23, 2014"}, {"Title": "I love this camera", "Author": "Zap \"zap0007\"", "ReviewID": "R23YHUTUTE5I5C", "Overall": "5.0", "Content": "It's a great little camera, has fantastic HD video and great photos also.  It's small enough to fit into a pocket, and is very fast.  I also like the zoom on the lens (20X) sound is not bad.", "Date": "April 16, 2014"}, {"Title": "Very nice digital camera and affordable price", "Author": "Lucy Delgadillo", "ReviewID": "R1TRTNNIBEXLBS", "Overall": "5.0", "Content": "I am very satisfied with the camera. It has the qualities of a bigger camera with the lightness and size of an inexpensive one.", "Date": "April 14, 2014"}, {"Title": "Very good camera for the price", "Author": "ruruspears", "ReviewID": "R9IRZHVDZFZNN", "Overall": "5.0", "Content": "I've been using this new camera for a couple of weeks.  Takes nice pictures inside and out.Very pleased so far.", "Date": "April 10, 2014"}, {"Title": "Lumix,  a great point and shoot camera.", "Author": "mary donegan", "ReviewID": "R1KGV88AZB1LQF", "Overall": "5.0", "Content": "This is my second Lumix camera.  Love the 20x zoom...weighsa little more than my previous camera., but still light enough to carry in a pocket.", "Date": "April 8, 2014"}, {"Title": "Great Purchase", "Author": "Bob", "ReviewID": "R242SZYMHPFCJ7", "Overall": "5.0", "Content": "Great carmera for the money. A great camera to carry evertwhere on vacation. Offers a lot a options. My third Panosonic Lumix.", "Date": "March 24, 2014"}, {"Title": "arrived in good order", "Author": "laserman", "ReviewID": "R3NLA1JI6D4G2D", "Overall": "5.0", "Content": "all good..bought from USA at good price and so far so good.keep up the good work and many thanks", "Date": "March 12, 2014"}, {"Title": "Very Good Pocket Camera", "Author": "B. Hyatt", "ReviewID": "R1QR0U5C30XGT5", "Overall": "5.0", "Content": "Having 20X zoom in a pocket camera is great! Small and fits in my pocket easily so I can take it with me everywhere. Photos have been sharp with no distortion.", "Date": "March 4, 2014"}, {"Title": "The Panasonic Lumix DMZ-ZS25", "Author": "J. H. Tan", "ReviewID": "R21EE17ZMBCVIW", "Overall": "5.0", "Content": "The item arrived as scheduled in excellent condition.  It is a good travel camera that is small enough to carry in one's pocket but has a sensitive 16 MP sensor and a powerful 20 X  optical zoom capability", "Date": "February 27, 2014"}, {"Title": "The camera works perfect!", "Author": "James Kennedy", "ReviewID": "R16W7EO8ELI1YE", "Overall": "5.0", "Content": "I ordered this DMC-XS25 for our vacation pictures.  I use it regularly when we travel. It works perfect and meets my needs completely.", "Date": "February 27, 2014"}, {"Title": "New camera", "Author": "Sammie", "ReviewID": "RY633QSF62JSG", "Overall": "4.0", "Content": "So far we have loved our new camera. It is easy to use. We are still learning about all the extra things it does.", "Date": "February 21, 2014"}, {"Title": "GREAT CAMERA", "Author": "Teacup", "ReviewID": "RQSDB88IIBAT1", "Overall": "5.0", "Content": "Just got this camera n had read several reviews, which helped me a lot! Some were very detailed n others not, but all raved about the camera except about the mono on video well that's alright I didn't want touch screen gets too complicated for me. The lens is great haven't done much yet but which camera wasn't plastic instead of metal as my other panasonic are. All in all it's a great camera...price half what Best Buy is selling for!", "Date": "February 6, 2014"}, {"Title": "Lighter", "Author": "Larwanda Williams", "ReviewID": "R1OWB8IBIOLG44", "Overall": "5.0", "Content": "I love the camera it is lighter than the older model I have but takes just as good of a picture", "Date": "January 26, 2014"}, {"Title": "Great camera", "Author": "Mary S Page", "ReviewID": "R28L9A19QXDVZF", "Overall": "5.0", "Content": "This is a great camera for the money.  It has lots of settings and they all work really well.  We use it for taking pictures of wild life everyday.  It takes really great pictures for a point and shoot.", "Date": "January 20, 2014"}, {"Title": "Love the Lumix Line", "Author": "Dominoe Wheeler \"accept2010@live.com\"", "ReviewID": "R2DVXH9AF4KGHC", "Overall": "5.0", "Content": "I have been a big fan of the Lumix line of camera since I bought my first on in Baghdad. This is a great camera, compact, simple to use, the perfect gift for someone who wants to  take pictures, but doesn't want to be overwhelmed with complexity, like my sister.", "Date": "January 15, 2014"}, {"Title": "panasonic lumix dmc-zs25", "Author": "susan s. kreider", "ReviewID": "R395WNHJK3U6E", "Overall": "5.0", "Content": "very pleased with the 20x zoom - light and compact ~ would recommend this camera to anyone ~ yes to the camera", "Date": "January 2, 2014"}, {"Title": "panasonic is a crystal clear camera", "Author": "Anthony Cavacini", "ReviewID": "RYES8PCCTDCL1", "Overall": "5.0", "Content": "IF YOU BUY IT RIGHT YOU HAVE ONE OF THE BEST CAMERAS ON THE MARKET FOR THE MONEY.IT HAS A LICA LENS SAY NO MORE THIS CAMERA IS RUGGED IT CAN DO ALL THINGS PERFECT CRYSTAL CLEAR EVERY TIME YOU SHOOT A PHOTO.THERE ARE MANYOTHER PANASONIC SIMMILAR MODELS AS GOOD.  BUY ONE.POINT AND SHOOT NO REGRETS.  TONY PHILA.PA.", "Date": "December 28, 2013"}, {"Title": "great camera", "Author": "RMS \"RMS\"", "ReviewID": "RCJMBEC2ZDRAB", "Overall": "5.0", "Content": "this camera is small, light, and has a great lens.  easy to carry around so you don't miss a shot.  light and simple to use.  easy to transfer photos to the computer.  24mm wide angle - 400mm zoom is awesome!!", "Date": "December 23, 2013"}, {"Title": "Excelent", "Author": "juanra290378", "ReviewID": "R2G0E0PC4T26DT", "Overall": "5.0", "Content": "Very good camera, I'm testing it and it worked excellently. I love the definition and operation of zoom, soon prove landscapes in Guatemala and I am sure it will work perfectly.Juan Ramón", "Date": "December 21, 2013"}, {"Title": "Great compact camera", "Author": "William F Buholtz", "ReviewID": "R1AQSKOH9MB01H", "Overall": "5.0", "Content": "This is my second Panasonic, they have made the user interface much easier than my older model. Better MP and optical zoom, great quality pictures that I print up to 11x14 with great clarity.I like having a camera I can put in my pocket and have when I need it and still get quality pictures.The one thing this camera does that most do not is the ability to zoom while making a video recording.", "Date": "December 21, 2013"}, {"Title": "Super camera", "Author": "SpiritualOne \"spiritual one\"", "ReviewID": "R27B86M5WZY7OW", "Overall": "5.0", "Content": "This camera is small enough to fit in a pocket or purse. It takes great shots and is versatile as it can be used in auto mode, manual and video. Bought this for a trip, no regrets", "Date": "December 21, 2013"}, {"Title": "Great compact long zoom camera.", "Author": "Dale Hoffman", "ReviewID": "RO09AHX12DILX", "Overall": "5.0", "Content": "Great little camera.  20X zoom with 40X electronic zoom capability makes this a great camera to carry to sport events, vacations, or just with you when that perfect picture moment occurs.  The stabilization and custom photo settings are excellent.  The auto settings give you perfect pictures for the novice to the expert.  The lens are high quality crafted and the quality of the pictures excellant.  Recommend as a great camera for on the go.", "Date": "December 16, 2013"}, {"Title": "Compact easy to use camera", "Author": "himalnid", "ReviewID": "R1X4V3V1TX76UG", "Overall": "5.0", "Content": "This is an excellent, small camera. It almost dose as well as professional camera and produces great shots and has numerous options such as creative ones. Not difficult to use.", "Date": "December 11, 2013"}, {"Title": "Great camera.  Superior photos", "Author": "Susan Musgrove", "ReviewID": "R2QQAPPMU9LOTU", "Overall": "5.0", "Content": "Great camera. Took to Hawaii for special memories and it was perfect.  Quality of photos is superior.  I charged it every night and it had enough battery each day.  I took photo of canoe away from shore and could see the people clearly and was not expecting that type of quality.  Great price too!", "Date": "December 10, 2013"}, {"Title": "Just what we wanted", "Author": "AMA 5326", "ReviewID": "R1TSAJHVXJYRGF", "Overall": "5.0", "Content": "This camera did all that we wanted without being to complex.  It has lots of capability and we may use it in the future, but we needed a straight forward easy to use camera for an upcoming trip an the DMC-ZS25 was a great selection.  Durable, compact and easy to use.  We made a good choice.", "Date": "October 28, 2013"}, {"Title": "Fantastic Camera!", "Author": "DDonut", "ReviewID": "R3JJ5ZY44H7T14", "Overall": "5.0", "Content": "My husband has an earlier version of this camera (DMC-ZS10) and he has loved it so we decided to get the newer version for me. I am now learning how to use it for HDR photography and the results are fantastic! The only note I have is that you really need to get an extra battery to carry with you. I have been taking so many pictures that I ran out of power while touring a cave and missed some shots I would have loved!", "Date": "October 23, 2013"}, {"Title": "Great camera", "Author": "Secular Libertarian reviewer", "ReviewID": "R117EZXF5QYPE4", "Overall": "5.0", "Content": "I bought this camera because of its compact size, the brand name and its 20x optical zoom feature. Several friends and I have had great experience with Panasonic Lumix. I've noticed that this camera takes great pictures when I'm moving (e.g. on a bus) or the object is moving (e.g. an animal).", "Date": "August 26, 2013"}, {"Title": "A step back in image quality from the ZS15", "Author": "Brad Hutchinson", "ReviewID": "RSD3EFTZPVT8L", "Overall": "2.0", "Content": "I dropped my ZS15 about 20 feet down a dry waterfall on a recent hiking trip and had to upgrade to the ZS25 with overnight shipping to replace it.  The difference between the two cameras is basically the ZS25 has more megapixels and a longer zoom. I have been using the ZS25 now for about a month and at first my impressions were that the camera was excellent but with continued use I am incredibly dissappointed.  The additional megapixels and small sensor size on the ZS25 has unfortunately resulted in noise filled images.  There is so much noise in the images they are essentially useless if you intend to crop or zoom in.  The longer telephoto zoom is nice and can be used without a tripod with no problem.  I have borrowed my younger brothers ZS15 and without question the ZS15 takes better images than the S25. For the past two weeks I have been trying out an Olympus SH-1 and Nikon S9700 as potential replacements and both take images with less noise than the Panasonic, unfortunately they each have other issues and I can't recommend either of them either (reviews coming soon for each).  My recommendation is to get a ZS15 if you are seeking a compact travel zoom it is a much better camera.", "Date": "April 16, 2014"}, {"Title": "loved it", "Author": "ovadia moshe", "ReviewID": "R1OQMSGBMWRYF0", "Overall": "5.0", "Content": "the camera is in the right size, small for pocet,taking amazing picturesheavier than i expected wonderful useful ZOOM", "Date": "October 2, 2013"}, {"Title": "Love the cam", "Author": "Jade G Buermann", "ReviewID": "R3LCGQXAH2S9X1", "Overall": "5.0", "Content": "The zoom is great and the weight is perfect.  The quality of pictures is very good and the zooming close ups even in videos is great.", "Date": "September 14, 2013"}, {"Title": "Better than most in same camera class", "Author": "FRHNCARB", "ReviewID": "R2QY6K8QBPNVRQ", "Overall": "4.0", "Content": "excellent quality, excellent lens, great photos. Many options for creative photography. At 16 mp, 8x10 photos have great detail. Highly recommended..", "Date": "August 25, 2013"}, {"Title": "Great camera at this price point", "Author": "B. Hay", "ReviewID": "RX2JH5G0AZ559", "Overall": "4.0", "Content": "I bought this camera for my wife as the last stepping stone from a point and shoot to a DSLR.  I was pretty concerned about battery life given the reviews here and pre-emptively ordered a set of spare batteries and charger.  I may never need them.  We've taken 200+ pictures of all varieties and video and the battery is still going strong.  I wouldn't worry too much about the rechargeable internal only battery unless you plan on shooting several hundred photos daily.This may be a sign of the times but the full owners manual is only on CD.  Now if you want to look something up, you have to load up the computer and search for the desired function instead of quickly leafing through the manual.  Luckily, the camera is pretty intuitive.I'm impressed with image stabilization and picture quality at maximum zoom.  It also does a pretty decent job at night in low light even when set to program.Bottom line, a pretty darn good camera at this price point.", "Date": "July 8, 2013"}, {"Title": "one \"Slow\" camera", "Author": "Li LU", "ReviewID": "R11ZPEWOUH9NJS", "Overall": "2.0", "Content": "Maybe there is some fancy tuning that can make it a superb camera, but by default, it is just a bad point and shoot camera. focus is slow and so it take some very steady hands to get a good shoot. Whatever the edge the 20x optical zoom bring over is canceled out by the slowness.", "Date": "December 9, 2013"}, {"Title": "Top quality point and shoot superzoom", "Author": "apestate", "ReviewID": "R35QO2HXQ78I1M", "Overall": "5.0", "Content": "Cameralabs is where I get my reviews for cameras.  It was a toss up between this and the Canon 280... but the Panasonic is capable of USB charging which is a must-have for backcountry expeditions.  I cannot carry enough batteries to do videos in the woods, so I need a solar charger.  USB charging is the most convenient and efficient so I have a 5v solar panel.  Therefore, the Panasonic with USB-charging feature is the camera I need.Otherwise, the SX280 is a better machine for only 25% more total cost.", "Date": "July 24, 2013"}, {"Title": "Very nice.", "Author": "Mark Sandstrom", "ReviewID": "R8G16J12GVITC", "Overall": "4.0", "Content": "Exactly as advertised. Very pleased with this purchase.Good online manual. I bought the recommended case too. It fits but you might want somethign a bit larger.", "Date": "June 10, 2013"}, {"Title": "Outstanding Point And Shoot Camera", "Author": "DaffyD \"( : []=\"", "ReviewID": "RKS2EFNNFQFJU", "Overall": "5.0", "Content": "I bought this camera for my wife's Mother's Day present. This is a great camera but there is a learning curve involved. However, we can't believe all the features it offers and my wife is quickly learning how to use them.This camera is fast, the zoom is incredible, it does well in low light situations, and the pictures are wonderful. Some are softer than others because my wife needs to learn more about the auto focus and custom settings.I read one review where the person stated the software included on the camera CD was incompatible with Windows 7. I have Windows 7 and I installed the software I wanted with the appropriate drivers and I am having no problems with any of it. Well, that isn't totally true; at times it can be a bit tricky to connect the camera and its memory card to my PC but then I've only done it about three times. Still, photo transfers from the camera to the computer are fast and the basic photo editing software both in the camera and on the computer hard drive are both very good for what they are: photo editing tools for the beginning to intermediate home photographer.This is the best camera value in its class out there.", "Date": "June 6, 2013"}, {"Title": "Great balance between size and power", "Author": "Dean D", "ReviewID": "R2MKD2WOHL8U5M", "Overall": "5.0", "Content": "The 20x zoom and 16MP sensor combined with the compact size makes this a great pocket or travel camera, particularly when I don't want to take my larger interchangeable lens camera with me.The 10fps burst mode makes shooting my son's sports easy and yields great results, and I like that I can take full HD Video with the same device.I've experimented with the creative controls, and the modes help me take more creative/artistic photos and never need to edit them on my PC.Definitely worth a look!", "Date": "May 9, 2013"}, {"Title": "Good camera", "Author": "Siobhan Eddy Young", "ReviewID": "R33Z90EG6GQPPC", "Overall": "4.0", "Content": "On/off button quite small, also some of the other operational buttons. Lots of interesting features that will take me a while to learn.", "Date": "April 23, 2014"}, {"Title": "Price, Quality, Performance", "Author": "Edward A Dobbin", "ReviewID": "RHDJM5KCPLAGM", "Overall": "5.0", "Content": "I rated this 5 stars for the very high performance for the very reasonable price. I shopped for quite a few weeks for a camera with the specifications this one has for a price point under $200. This one filled the bill and even included a case, memory card, and free shipping. Both photo and video are wonderful!", "Date": "January 20, 2014"}, {"Title": "Absolutely Great Camera!", "Author": "R. D. Wauchope", "ReviewID": "RY45PRXXQVNMF", "Overall": "5.0", "Content": "This is without any doubt at all the best point-and-shoot camera I've ever had, and so far I haven't found anything at all that I don't like. The picture quality is superb, the \"lag\" on taking pictures is almost nonexistant, and the optical stabilization can't be beat.  I've taken pictures from a moving car, with telephoto maxed out, and they are sharp as a tack!  I still can't believe how excellent this camera is.  Low light photograpy is amazing!  Battery lasts a long time (my old Canon A570, with its 2x AA cells, drove me crazy with constant \"change your batteries\" messages. Not this one!)  I am so pleased, I hope this camera lasts forever!", "Date": "January 17, 2014"}, {"Title": "I like this, but haven't fully mastered it.", "Author": "Pilgrim \"Pilgrim\"", "ReviewID": "R2O4WZOFHBP7GZ", "Overall": "4.0", "Content": "I bought this camera to take on a trip to Japan. I like the size and weight, but have not fully mastered all the options.  It's not terribly user-friendly, so I really need someone more experienced to help me out. The picture quality seems fairly good, but I am not totally thrilled with it.", "Date": "January 17, 2014"}, {"Title": "Nice camera compact and crisp pictures", "Author": "Joseph Kaiser", "ReviewID": "R2RET42MIW8K7U", "Overall": "4.0", "Content": "I kept looking on various models because I wanted a compact so I did not have to drag my full size SLR around for short trips.  This one fit the bill.  Very happy with the results and no complaints thus far.  My only disappointment was after I bought it from Amazon, 3 weeks later I walked through Costco and the same camera was $50 cheaper.  Oh well I thought as I pushed the cart along.  :)", "Date": "January 7, 2014"}, {"Title": "Lack of essential memory card", "Author": "Margaret C. Jackson", "ReviewID": "R24Q8ZL0UDY0HX", "Overall": "3.0", "Content": "This item came without the essential memory card.  I just bought a 64 GB for Euros 65,  thus making the camera in fact substantially more expensive.  That said, I look forward to the good performance I had from an earlier model...  My harsh words (and rating)  are only in regard to the lack of memory stick.", "Date": "February 17, 2014"}, {"Title": "Great Product had no problems with it or the delivery of the product. I would recomend to a friend. thumbs up", "Author": "Kent", "ReviewID": "R33QHE88LXKZEY", "Overall": "5.0", "Content": "Great Product had no problems with it or the delivery of the product. I would recomend to a friend. thumbs up this is the best camera I've owned. Fast shutter lots of great fetures very clear pictures even zoomed all the way", "Date": "July 24, 2013"}, {"Title": "Great quality", "Author": "Andrea Mc", "ReviewID": "R3HXJ3MFO2XXO5", "Overall": "5.0", "Content": "I haven't had the chance to use it much yet, but I tested it out in my yard with my dogs and the quality is good.  This was an upgrade from a Lumix that i had for 4 years and loved, but I really wanted a better zoom for concerts.  So far very happy!", "Date": "July 20, 2013"}, {"Title": "Terrific camera, especially for the money", "Author": "Michael Ronzano", "ReviewID": "RBS0SNC66RQ59", "Overall": "5.0", "Content": "Easy to use, compact, 20x zoom. Really, all you could ask for in an under-$200 camera. The Leica optics are great and the finished product--the photos--are top notch.", "Date": "July 20, 2013"}, {"Title": "The best of the best!", "Author": "T. Clark", "ReviewID": "R2H9DLZ9VAA0KD", "Overall": "5.0", "Content": "I have used Lumix cameras for 5 years and have never been disappointed. The lens in this camera are excellent. The color rendering is excellent. The size is excellent. The view screen is excellent. This camera has so many options that it requires multiple readings of the manual available online.", "Date": "May 23, 2013"}, {"Title": "For everything BUT VIDEOS", "Author": "Rebecca St Martin \"rbccstmrtn\"", "ReviewID": "R2QJ8F50SLJY0U", "Overall": "1.0", "Content": "If you're counting on taking videos with this camera, find another device. However this camera produces the files, they are not flat files (like AVI or MPG) and requires the use of special software.I had hoped, like a previous, similar model, that I would be able to take videos, open up Windows Explorer (PC) or Finder (Mac) and be able to transfer the files to my computer, easily, to back them up. NOT SO. I couldn't get the camera to connect to my PC at all. I could get it to connect to my Mac, but only JPG files showed up.I called Panasonic for support. They were quick to blame Apple for their product's failure/incompatibility. I escalated support 2x. They told me I have to use iMovie on the Mac side. I asked them to walk though every step because iMovie didn't recognize the files either. (They simply don't appear.) They then blamed my PC...saying I should try another PC. (Like they expect people to have several computers laying around at their disposal? I happen to...but this lack of responsibility is insane.) I'm taking my camera back.If it doesn't work and the company won't support it's weaknesses or failures, it's as good as trash in my book.", "Date": "July 2, 2013"}, {"Title": "Great Camera!", "Author": "Marsha", "ReviewID": "RM05KHU0K8LU0", "Overall": "4.0", "Content": "All of my sisters have this camera & highly recommended it to me.  It is smaller & lighter than my last camera.  Only problem is that you MUST get a memory card as the camera itself only holds about 10 pictures without additional memory.", "Date": "January 23, 2014"}, {"Title": "perfect and nice", "Author": "DANIEL VELASCO", "ReviewID": "R2O086RQCC2ZOI", "Overall": "5.0", "Content": "ITEM AS DESCRIBED, VERY FAST DELIVERY AND WELL WRAPPED. no issues on device and it is working fine just out of the box.the zoom is very powerful and it is a compact camera.", "Date": "October 24, 2013"}, {"Title": "Do not buy!", "Author": "James Duke", "ReviewID": "R3F88RI98B1E0D", "Overall": "1.0", "Content": "I have owned two Panasonic Lumix cameras.  The first one developed black spots on the screen.  After returning for repair for the same problem three times, and more than 5 total hours on hold and talking with worthless customer service representatives, they finally replaced it.  All work was under warranty, but each time I was without a camera for a month.  The replacement camera was a different model Lumix.  It failed within a year.  This time it was an auto focus issue on zoom.  I was advised that the replacement camera only had a 90 day warranty.  I purchased the lumix primarily because of the zoom lens.  DO NOT PURCHASE OR YOU WILL BE SORRY!", "Date": "April 16, 2014"}, {"Title": "Does a great job...!!!", "Author": "Michael F Keane Jr", "ReviewID": "R1UNFKAY0YDKZ9", "Overall": "5.0", "Content": "This camera does everything a bulky 16 mp SLR will do...including excellent HD movies! But unlike the SLR, it also fits in your pocket. A really great camera...this is my third one (one damaged-one lost). Picture resolution and sharpness is also excellent.", "Date": "June 22, 2013"}, {"Title": "Great Camera", "Author": "nsxone", "ReviewID": "R1O3BK9SMJZ0HZ", "Overall": "5.0", "Content": "Great camera very easy to use. I have been using this camera for 2 months and love it. This is a lot of camera for the money. Very happy.", "Date": "May 13, 2013"}, {"Title": "Excellent", "Author": "Pud", "ReviewID": "RQBRTYRPB9MMM", "Overall": "5.0", "Content": "Too good to be true!  Easy to use, easy to carry, and user help built into the camera.  A great buy for the price.", "Date": "June 23, 2013"}, {"Title": "I love it", "Author": "Magnus Jonsson", "ReviewID": "R26WV5MTEN0X7Y", "Overall": "5.0", "Content": "I had similar camera from same maker that got damaged . so l bought another one, and the new one is even better.", "Date": "June 2, 2013"}, {"Title": "Powerful small cam", "Author": "Nkmic", "ReviewID": "R21OQTH5GANUQ0", "Overall": "5.0", "Content": "The camera is small, handy and has excellent features.My wife loves it.The only minus is that the flash photos are a little overexposed, but the quality without flash is stunning.Good Buy.", "Date": "April 29, 2013"}, {"Title": "Buyer beware of the ZS25!", "Author": "Sunday Driver", "ReviewID": "R1MK86NYZSSNN6", "Overall": "1.0", "Content": "To clarify from the start, this is not a review of the entire camera itself, but rather an alert to potential buyers of the Lumix ZS25.  I just purchased the camera and discovered that it does NOT have stereo microphones as Amazon's detailed description page clearly states!This may not be a problem for some, but the ZS19, ZS20 and ZS30 have stereo mics and I definitely wanted this feature in the ZS25!  Panasonic, what's wrong with you??  Why would you offer this otherwise attractive camera with full HD video and not stereo audio??  I'm baffled by that one.So do not take this as a review of the remaining features of the camera itself, but just beware that it records mono audio and the product description is a lie!", "Date": "April 29, 2013"}, {"Title": "Great product!", "Author": "Collins Njoku", "ReviewID": "R3FLE4GDA53OR8", "Overall": "5.0", "Content": "This is by far the best digital camera I have bought. I very much appreciate the fast processor when taking moving subjects.", "Date": "April 24, 2013"}, {"Title": "low quality", "Author": "S. ardekani", "ReviewID": "R123V8TM3NICQY", "Overall": "1.0", "Content": "it is not as the old Lumix very low quality. very cheap build. Iboghut a ZS-20 and so far so good.", "Date": "August 21, 2013"}, {"Title": "Battery dead after 8 months of use", "Author": "shiyong yan", "ReviewID": "R1IGRBRWG7CCFG", "Overall": "2.0", "Content": "Ok Camera.Battery dead after 8 months of use.Now I am trying to see if that is covered by warranty.", "Date": "March 29, 2014"}, {"Title": "LOVE IT!!", "Author": "Vicky Telford", "ReviewID": "R2N65RDWCFC3EM", "Overall": "4.0", "Content": "LOVE THESE CAMERAS - ON #5 NOW.  WAS SLIGHTLY DISAPPOINTED IT DIDN'T HAVE A GPS SYSTEM LIKE MY ZS20 HAD BUT FIGURE I'LL FIND OTHER WAYS TO REGISTER WHERE I AM", "Date": "July 4, 2013"}, {"Title": "PLEASE READ THIS! ONLY buy this camera if you are going to use it outside or never with the flash.", "Author": "Amazon Customer", "ReviewID": "R3D6ZCMSVOSQD4", "Overall": "1.0", "Content": "I spent hours trying to figure out what camera I wanted. This was the camera I purchased. It ended up being a big mistake!! I noticed, after it was too late to return the camera, that there was a shadow that is created by the wide zoom lens on pictures that are taken inside with the flash.I talked to Panasonic and had it sent in for repair and because it functions \"normally\", they will not replace it and they can't fix it.", "Date": "April 2, 2014"}, {"Title": "I like it, wish I could love it", "Author": "J. Holman", "ReviewID": "R3P0472BP416OS", "Overall": "4.0", "Content": "I like this camera, and there's a good chance I'd buy it again. I bought one of its predecessor models about four years ago, and it still works, while a newer and more capable Sony died after a year. But I can't say that I love it. Some have said nice things about its video quality, but in a side-by-side comparison with the IPhone 5 (importing video from both into Final Cut Pro) the IPhone 5 produces noticeably better video (of course, without the benefit of the ZS25's flexibility). The ZS25's quality on still photos is likewise acceptable, but one can do better, especially for images shot at higher ASAs, for about the same money or perhaps just a bit more. What you probably can't find, at least at this price point, is a camera that offers the ZS25's particular combination of advantages -- the 20X lens, the compact size, a well-thought out interface and decent image and video quality. I wish the image quality was better, and I wish the ZS25 was even more compact. But for the price, and since I own a couple of DSLRs and several camcorders, nothing suits my needs for a casual, walkaround camera better.  If I hadn't bought the ZS25, I'd been leaning toward a Canon SX280, which might be a step up in image quality and offers its own advantages But it's typically at least $75 more, and it's also thicker and heavier than the Panasonic.", "Date": "July 7, 2013"}, {"Title": "Quite perplexing!", "Author": "dhlchung", "ReviewID": "R3R0N7FBBILJG8", "Overall": "2.0", "Content": "I am no expert photographer but I picked this up based on the raving reviews on the ZS20 so I thought this has to be newer and better. Much to my surprise, I have not been able to take one good picture either indoor or outdoor. I am really quite stumped that this camera could be so poor, as compared to my Nikon P300 which was good but not super. This is by far very disappointing and may be someone else will have better luck and give me some advice as to how to use this new camer!", "Date": "April 4, 2013"}, {"Title": "not bundle pack", "Author": "S. Marrin", "ReviewID": "R2XZXKZXSO477F", "Overall": "3.0", "Content": "i looked at some of the questions and someone had asked if this was a bundle pack with case and SD card.  The answer was yes, so I went ahead and bought it.  It did NOT come with these items.  Had I known this, I would have gone to Costco to make my purchase.  Camera is good, not happy about not getting the other items.", "Date": "July 17, 2013"}, {"Title": "Camera works great.  Software is written by an idiot.", "Author": "JAS \"JAS\"", "ReviewID": "R1KKW192E9517U", "Overall": "1.0", "Content": "My camera takes great pictures.  When I went to download the pictures and print them I was not even allowed to complete the process.  First of all if you want to really screw up some ones head with a software program just put everything in a hard to find area on the screen and don't do anything that is normal with other software, like putting a print prompt under file. Put it some ware where you have to go to the instructions to figure it out. Another thing you can do is not allow your program to print without opening a certain office program.  Then make sure there's a glitch that wont let it print anyway.  Then of course set up your program so that it is so user unfriendly that it takes 30 minutes to figure out how to crop a photo.  It took me 30 seconds to figure this out on Sony software. There are not enough bad words in the English language to explain what crap this Panasonic software is.  I just spent 2 hours trying to print one picture and after doing everything necessary was given a message that said system malfunction and the program shut down.  I'll keep trying but I'm almost ready to return the POS. By the way I'm not computer illiterate.  I'm not the problem.", "Date": "June 19, 2013"}, {"Title": "NO GPS!! Contrary to what you may read here or elsewhere", "Author": "Suomigrrl", "ReviewID": "REMHQHG5NMJ96", "Overall": "2.0", "Content": "Lots of ads all over the web, including here on Amazon, tout this camera as having GPS capability.  It doesn't.  Period!  Total deal-breaker for me; back to Costco it goes.", "Date": "June 4, 2013"}, {"Title": "Have rally not used yet", "Author": "Annette Irizarry \"Aries\"", "ReviewID": "R3G7SDKNZO1R46", "Overall": "4.0", "Content": "I expect to enjoy it soon, but have not really used it.  Once I learn I will revisit this subject.", "Date": "May 8, 2014"}], "ProductInfo": {"Price": "$299.99", "Features": "16.1 Mega Pixel CMOS, 20x optical zoom, 40x Intelligent Zoom, Power O.I.S. with Active Mode, Venus Engine\n3.0\" LCD Screen, Intelligent Auto Mode, 14 Effective Create Control, Light Speed Auto Focus, 10 fps Burst Shooting\n1080p Full HD Video, AVCHD, MP4, Leica DC Vario-Elmar Lens, Nano Surface Coating", "Name": "Panasonic Lumix DMC-ZS25 16.1 MP Compact Digital Camera with 20x Intelligent Zoom (Silver)", "ImgURL": "http://ecx.images-amazon.com/images/I/4189fOIMMSL._SX300_.jpg", "ProductID": "B00ATE7WFS"}}