{"Reviews": [{"Title": "Good Camera", "Author": "Dan Richardson \"Dr. Dan\"", "ReviewID": "R14X9CYXGFEPEO", "Overall": "4.0", "Content": "This is a good little camera.  I wanted something that would easily fit into my pocket and take good photos.  This was exactly what I needed.  Here is some of the good and bad:I like the anti shake capabilities of the camera.  I could take photos at night with less of a chance of having a blurred photo.I like the wide angle view of the camera.  It can take it a wide angle.I like the photo size options.  It allows me to choose a photo size that will fit exactly to my LCD screen.  That is how I view most of my photos so it is nice that it fills the whole screen.I like the time option to shoot after 2 seconds.  That helps in taking night shots without shaking.The battery that comes with the camera has good life.The panoramic photo is capability is good for horizontal panoramas.  It would be nicer if the panorama setting was a little easier to get to.  Also it would be nice if it would also take panorama photos in the vertical direction.When I select an option such as which flash option I want, the menu disappears a little too fast.  I have to be quick to turn off the flash or set it on Auto.When I was taking indoor photos in a Palace at St. Petersburg.  Most of the photos were very good indoors.  However some of the rooms were had a very gold color to them.  I tried to adjust the white balance but it did not take out the gold color.", "Date": "October 21, 2013"}, {"Title": "Perfect Camera", "Author": "BARBARA", "ReviewID": "R3IHUR3E2JED7Z", "Overall": "5.0", "Content": "The perfect camera - small and with a great zoom feature.  Easy to carry and easy to use. Love it!", "Date": "November 3, 2013"}, {"Title": "Not as good as the FinePix Z series", "Author": "Mary Gordon", "ReviewID": "R10ELFY6TWL25G", "Overall": "4.0", "Content": "I bought a FinePix Z about 3 years ago and loved it. They no longer make the Z series so I decided to try this. While it has more features (such as panorama and selective color) ,and more MP, It does not focus as quickly. The user interface is substantially better for all fujifilm products than General Electric or Kodak.Pros-16 MPLots of modes/featuresGreat user interfaceCons-Slower than I would prefer", "Date": "October 28, 2013"}, {"Title": "I like it!", "Author": "Conrad Heisman", "ReviewID": "R2G2DOHUNI73AR", "Overall": "5.0", "Content": "Works as expected. Nice point and shoot camera.Instructions are not very good though.I had a T500 for which the telescope froze. My fault.Left it in the car during several 90 degree days. Not good!", "Date": "October 24, 2013"}, {"Title": "Super slim better quality", "Author": "Amazon Customer \"Laura\"", "ReviewID": "R39T1C6K79ULNM", "Overall": "5.0", "Content": "This is a super slim better quality point and shoot.  I love the size.  It is 16mp so I am hoping for great quality photos. I haven't started using it yet. The down side it that it does not come with a memory card, and the manual is on cd form  Really, now when you are out and about, can you actually pop in the cd and get a tip.  I landed up watching the whole thing and making a cheat sheet to put in the case. The BIRUGEAR Black Zipper Eva Pouch Carrying Case works great with this camera.", "Date": "January 21, 2014"}], "ProductInfo": {"Price": "$159.95", "Features": "3.0-inch TFT color LCD monitor\n16 million effective pixels 1/2.3-inch CCD image sensor with primary color filter and Optical Image Stabilizer\nFujinon 12x optical zoom lens with approx. 2x digital zoom (up to approx.. 24x, with 12 x optical zoom)\nFocal Length: f/4.3mm-51.6mm; Full Aperture: f/4 (Wide), f/6.9 (Telephoto)\nHD movie (1280 x 720p)", "Name": "Fujifilm FinePix T550 16MP Digital Camera with 3-Inch LCD (White)", "ImgURL": "http://ecx.images-amazon.com/images/I/51dWFRDsBEL._SY300_.jpg", "ProductID": "B00ATM1MVK"}}