{"Reviews": [{"Title": "A really enjoyable camera with pleasant image quality.", "Author": "Anthony Pantliano \"The Photo Guy\"", "ReviewID": "R1WOMYH0RM6UOR", "Overall": "4.0", "Content": "<!--\n\nfunction fp_resizePlayerSpace(nsPrefix,w,h)\n{\t\n  try {\t\n    var ifrm = parent.document.getElementById(nsPrefix + \"movieFrameID\");\n    if (ifrm) {\t\n        var h2 = h + 35;\n        ifrm.style.height = h2;\n      }\n    } catch(err) {\n \n    } \n\n\n  if (h > 0) {\n      document.getElementById(nsPrefix + \"clipDiv\").style.height=h+\"px\";\n      document.getElementById(nsPrefix + \"videoPlaceholder\").style.height=h+\"px\";\n  }\n  else {\n      document.getElementById(nsPrefix + \"clipDiv\").style.height=\"\";\n      document.getElementById(nsPrefix + \"videoPlaceholder\").style.height=\"\";\n  }\n  document.getElementById(nsPrefix + \"flashcontent\").style.height=\"100%\";\n}\n\nfunction fp_rewriteDiv(nsPrefix,divName,html)\n{\t\n    document.getElementById(nsPrefix + divName).innerHTML=html;\n}\n\nfunction embeddingPopup(nsPrefix)\n{\n  alert(\"placeholder function for embedding code\");\n}\n-->\n\n\n<!--\n\nfunction cv_moLUGS7EFB2MXEembeddingPopup(){\t\nalert(\"Embedding code will be displayed here.\");\n}\n\n-->\n\n\n\n\n\n\n\n\n\n<!--\nfunction cv_moLUGS7EFB2MXErefresh_preplay() {\n\ndocument.getElementById(\"cv_moLUGS7EFB2MXEchiDiv\").innerHTML = document.getElementById(\"cv_moLUGS7EFB2MXEhiddenPre\").innerHTML;\n};\ncv_moLUGS7EFB2MXErefresh_preplay();\n\n-->\n\n\n\n\n\n\n        // <![CDATA[\n\nvar cv_moLUGS7EFB2MXEso;\t   \n\n\nfunction cv_moLUGS7EFB2MXEloadSwf_Core(swfLocation, swfWidth, swfHeight, flashVersion, bgColor, swfParams, flashParams, embedAttributes) {\n\n  try {\n      cv_moLUGS7EFB2MXEso = new SWFObject(swfLocation, \"cv_moLUGS7EFB2MXEAMPlayerProd\", swfWidth, swfHeight, flashVersion, bgColor);\t   \n\n      for (var v in swfParams) {\n        cv_moLUGS7EFB2MXEso.addVariable(v, encodeURIComponent(swfParams[v]));\n      }\n      for (var v in flashParams) {\n        cv_moLUGS7EFB2MXEso.addParam(v, flashParams[v]);\n      }\n      for (var v in embedAttributes) {\n        cv_moLUGS7EFB2MXEso.setAttribute(v, embedAttributes[v]);\n      }\n\n      cv_moLUGS7EFB2MXEso.addVariable(\"swfEmbedTime\", new Date().getTime());\n\n      var agt = navigator.userAgent;\n       \n      var reFirefox = new RegExp(\"firefox/\", \"i\");\n      var regx = agt.split(reFirefox);\n      var ffVersion = 8;\n      if (regx[1]) {\n          var pts = regx[1].split(/[.]/);\n          ffVersion = parseFloat(pts[0] + \".\" + pts[1]);\n      }\n      var minorVersion = parseFloat(navigator.ap);\n      if ((navigator.appVersion.indexOf(\"Mac\")!=-1) || (ffVersion < 1.5)) {\n          cv_moLUGS7EFB2MXEso.setAttribute(\"height\", swfHeight);\n          cv_moLUGS7EFB2MXEso.setAttribute(\"width\", swfWidth);\n          cv_moLUGS7EFB2MXEso.addVariable(\"oldFirefox\", \"1\");\t     \n      }\n\n      if (cv_moLUGS7EFB2MXEso.write(\"cv_moLUGS7EFB2MXEflashcontent\")) {\n          fp_resizePlayerSpace('cv_moLUGS7EFB2MXE', \n                               320, \n                               283);\n      }\n      else {\n          var nsPrefix = 'cv_moLUGS7EFB2MXE';\n\n          fp_resizePlayerSpace(nsPrefix, 0, 0);\n          fp_rewriteDiv(nsPrefix, \"flashcontent\", '<br/>To view this video download <a target=\"_blank\" href=\"http://www.macromedia.com/go/getflashplayer\" target=\"_top\">Flash Player</a> (version 9.0.115 or higher)');\n      }\n  } catch(err) {\n      fp_resizePlayerSpace('cv_moLUGS7EFB2MXE', 0, 0);\n  }\n  return false;\n}\n\n\n\nfunction _cv_moLUGS7EFB2MXEloadSwf(movieID, playerVersion) {\n    var swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/20120510035744301/AMPlayer._V148501545_.swf\";\n    var swfWidth = \"320\";\n    var swfHeight = \"100%\";\n    var flashVersion = \"9.0.115\";\n    var bgColor = \"#FFFFFF\";\n\n    var swfParams = {};\n    var flashParams = {};\n    var embedAttributes = {};\n    swfParams.amazonPort = \"80\";\n    swfParams.allowFullScreen = \"true\";\n    swfParams.telemetrySubPageType = \"VideoReview\";\n    swfParams.nsPrefix = \"cv_moLUGS7EFB2MXE\";\n    swfParams.locale = \"en_US\";\n    swfParams.logUrl = \"gp/mpd/l\";\n    swfParams.canResize = \"1\";\n    swfParams.autoPlay = \"1\";\n    swfParams.sessionId = \"000-0000000-0000000\";\n    swfParams.marketplaceID = \"ATVPDKIKX0DER\";\n    swfParams.salign = \"LT\";\n    swfParams.preset = \"detail\";\n    swfParams.mediaObjectId = \"m1CIX2B3CLAVQ\";\n    swfParams.autoPlayTimer = \"\";\n    swfParams.mediaObjectIDList = \"m1CIX2B3CLAVQ\";\n    swfParams.playIsUserGenerated = \"1\";\n    swfParams.enableShare = \"0\";\n    swfParams.permUrl = \"gp/mpd/permalink\";\n    swfParams.telemetryPageTypeID = \"R1WOMYH0RM6UOR\";\n    swfParams.xmlUrl = \"http://www.amazon.com/gp/mpd/getplaylist-v2/m1CIX2B3CLAVQ/000-0000000-0000000\";\n    swfParams.amazonServer = \"www.amazon.com\";\n    swfParams.scale = \"noscale\";\n    flashParams.allowFullScreen = \"true\";\n    flashParams.salign = \"LT\";\n    flashParams.bgcolor = \"#FFFFFF\";\n    flashParams.allowScriptAccess = \"always\";\n    flashParams.quality = \"high\";\n    flashParams.wmode = \"transparent\";\n    embedAttributes.title = \"Flash Player\";\n\n    if (movieID){\n      if (playerVersion == '3'){\n        swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/20120510035744301/AMPlayer._V148501545_.swf\";\n        swfParams.mediaObjectIDList = movieID;\n      } else {\n        swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/legacy/20101014901/AMPlayerProd._V197491872_.swf\";\n      }\n      swfParams.xmlUrl = \"http://www.amazon.com/gp/mpd/getplaylist-v2/\" + movieID + \"/000-0000000-0000000\";\n      flashParams.wmode = \"transparent\";\n      swfParams.autoPlay = \"1\";\n    }\n\n    if (document.getElementById('cv_moLUGS7EFB2MXEduration')) {\n      document.getElementById('cv_moLUGS7EFB2MXEduration').style.display='none';\n    }\n    cv_moLUGS7EFB2MXEloadSwf_Core(swfLocation, swfWidth, swfHeight, flashVersion, bgColor, swfParams, flashParams, embedAttributes);\n\n  return false;\n}\n\nfunction cv_moLUGS7EFB2MXEloadSwf(movieID, playerVersion) {\n   return _cv_moLUGS7EFB2MXEloadSwf(movieID, playerVersion);\n}\n\n\n\t\n\t\t// ]]>\n\t\n\n<!--\n\nfunction cv_moLUGS7EFB2MXEnewHeight(h)\n{\t\n    fp_resizePlayerSpace('cv_moLUGS7EFB2MXE', 0, h);\n}\n\nfunction cv_moLUGS7EFB2MXEresetPlayer(w,h,bw,cc) {\n  cv_moLUGS7EFB2MXEnewHeight(h);\n\n  cv_moLUGS7EFB2MXEso.addVariable(\"resetBandwidth\", bw);\n  cv_moLUGS7EFB2MXEso.addVariable(\"cacheCode\", cc);\n  cv_moLUGS7EFB2MXEso.setAttribute(\"height\", h);\n  cv_moLUGS7EFB2MXEso.setAttribute(\"width\", w);\n  cv_moLUGS7EFB2MXEso.write(\"cv_moLUGS7EFB2MXEflashcontent\");\n}\n\n-->\n\n\n\n\n\n\n\n\nvar cv_moLUGS7EFB2MXERollOverImg = new Image();\ncv_moLUGS7EFB2MXERollOverImg.src = \"http://ecx.images-amazon.com/images/I/91gDnMPOcdS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play-active,BottomLeft,130,-12_CR0,0,0,0_.png\";\n\nvar cv_moLUGS7EFB2MXEpreplay = document.getElementById('cv_moLUGS7EFB2MXEpreplayImageId');\nif (cv_moLUGS7EFB2MXEpreplay) {\n  cv_moLUGS7EFB2MXEpreplay.onmouseover = function() {\n    cv_moLUGS7EFB2MXEpreplay.src = \"http://ecx.images-amazon.com/images/I/91gDnMPOcdS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play-active,BottomLeft,130,-12_CR0,0,0,0_.png\";\n  }\n  cv_moLUGS7EFB2MXEpreplay.onmouseout = function() {\n    cv_moLUGS7EFB2MXEpreplay.src = \"http://ecx.images-amazon.com/images/I/91gDnMPOcdS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play,BottomLeft,130,-12_CR0,0,0,0_.png\";\n  }\n  \n  \n  var node = cv_moLUGS7EFB2MXEpreplay.parentNode;\n\n  var cv_moLUGS7EFB2MXEcurrentClick = node.onclick;\n  node.onclick = function () {\n    var head = document.getElementsByTagName(\"head\");\n    if (head[0]) { \n      var logTag = document.createElement('script');\n      logTag.type = \"text/javascript\";\n      logTag.src = \"/gp/customer-media/du/log.html?ie=UTF8&p=CustomerImage&s=CustomerVideoPlay\";\n      head[0].appendChild(logTag);\n    }\n\n    if (cv_moLUGS7EFB2MXEcurrentClick) {\n      return cv_moLUGS7EFB2MXEcurrentClick();\n    }\n  }\n}\n\n\n\n\n Length:: 2:40 MinsThe Olympus Stylus SH-50 has an awesome zoom, nice image quality, and tons of great features.Design wise the Olympus is very handsome and understated.  It has a rubberized grip on the front that makes holding the camera easy and the camera feels great in the hand.  The camera's materials are very nice with a metal front plate.  The buttons and dials feel high quality and work smoothly.  It's nicely assembled and feels sturdy.  Size wise it's not going to fit into a jean pocket but will travel well in a jacket pocket or a small bag.  Included with the Olympus is a USB cable that plugs into your computer or the included power adaptor.  The battery charges in camera.  Also included is a stylus to operate the touch screen, but I found the touch screen worked well enough that I didn't need it.The Olympus has lots of features that cater to photographers of every skill set.  For those who prefer to let the camera do all of the work there is an automatic mode, a handful of scene modes, and a few artistic filters (pinhole, fisheye, etc.).  One thing to be aware of is that in automatic mode the camera will rarely fire the flash.  The Olympus would rather keep the shutter speed low.  That may result in blurry photos due to camera and/or subject movement.  To make matters worse, in automatic mode you're only given two choices for the flash, automatic and off, so you can't even force the flash to fire manually.  The solution is to shoot in P mode or the indoor scene mode, where flash fires much more readily.  This is a pretty odd way for the camera to behave, and I think it is the Olympus' biggest flaw.  For those who want more control the camera offers a fully manual mode that lets you choose the aperture (only two available at any given zoom), shutter speed (from 15\" - 1/2000), and ISO speed (there is no auto ISO in M mode).  Additionally, there are two presets for custom white balance.  One thing I don't like is that the Olympus does not have a dedicated macro button.  If you want to access the closest shooting range you have to enter the macro scene mode, which is completely automated.Using the Olympus is easy.  The buttons are well laid out, the menu system is simple and easy to understand, and the touch screen is very responsive.  The thing about the touch screen is that it only controls a very limited set of functions.  When taking photos it will let you tap take the photo or just set the focus/exposure.  It works well and responds quickly.  In playback mode you can use the touch screen to go through photos or pan when zoomed into a photo.The Olympus is a very speedy camera.  After you turn it on it is ready to shoot in about 4 seconds.  It focuses at wide angle in about 1 second and the long end in about 2 seconds.  It rarely hunts for focus, even at full telephoto.  Continuous shooting speeds are also great.  When shooting full resolution you are offered a choice of two speeds.  The faster one takes a few photos every second and stops after 17 photos, while the slower speed takes about 1 photo every second and I stopped at 50 photos but the camera could keep shooting.Photo quality of the Olympus is great.  Color, exposure, and focus are perfect about 99% of the time.  Overall, the photos have a very pleasant and appealing look with rich accurate color and nice tonality.  However, the one place where the Olympus falters is with resolving fine detail.  This is a small sensor packed with pixels and in order to combat noise (color speckling) Olympus chooses to blur it away.  Therefore, even at the lowest ISO speeds, details like grass and hair end up looking mushy and indistinct.  I'd consider up to ISO 400 as where you'd want to do most of your shooting, use ISO 800-1600 in a pinch, and stay away from higher sensitivities as photos look less like photos and more like blotchy watercolor paintings.  Still, unless you're making huge prints, or cropping photos dramatically, you probably won't even notice the loss of detail and will be very happy with the photos the Olympus takes.  The image stabilizer is very effective and I was able to take sharp shots at wide angle at 1/5 and at telephoto at 1/250.  Strangely, the stabilizer will sometimes make a loud squeaking/farting noise at full telephoto.  Be careful in a quiet setting as people may think the noise is coming from you!Movies shot with the Olympus are quite nice.  They are full high definition and have stereo sound.  You can use the optical zoom while shooting, but you'll hear the motor on the recording in quiet environments.  The image stabilizer is very effective, and movies are smooth and have little shake.The lens on the Olympus is quite a performer.  Not only does it start at a nice wide angle of 25mm (letting you fit more in the photo), but also the 24x optical zoom lets you get really close without reduction in photo quality.  The lens is sharp, and even wide open at wide angle the corners are only a little soft.  Another nice thing about the lens is that is starts at f/3.0 on the wide end.  That number represents the lens' aperture.  The lower than number the more light the lens can collect.  Most cameras in this class start at f/3.3 or more, so at wide angle the Olympus will be a better camera in low light.  At telephoto the lens is a not so great f/6.9, so you won't want to zoom with the Olympus in low light unless you have a tripod or are willing to live with the detail loss the required high ISO speeds will entail.Battery life is great and I was able to take 386 photos with lots of zooming, reviewing, and menu navigating before the battery died.All in all... a terrific mega-zoom compact camera.Feel free to leave a comment with any questions you may have and I'll answer them as soon as I can.", "Date": "August 28, 2013"}, {"Title": "Great non-DSLR alternative", "Author": "NyReckDiver", "ReviewID": "R2Y83GVEZ42T0X", "Overall": "5.0", "Content": "As a professional freelance photographer, I try to take my primary DSLR camera everywhere.  However, it's simply impractical, especially when on family vacations. I have carried a number of alternatives including the Nikon COOLPIX P7700 12.2 MP Digital Camera with 7.1x Optical Zoom NIKKOR ED Glass Lens and 3-inch Vari-Angle LCD and the Fujifilm X20 12 MP Digital Camera with 2.8-Inch LCD (Silver).  While those are different class cameras and aptly suited as DSLR alternatives in certain situations, I find the SH-50 just as suitable for nearly every situation with limited exceptions.  For example, since the camera does not produce RAW files, in my opinion, camera use is limited to those situations in which you will not seriously post process images.I reviewed this product from the perspective of a typical end-user looking for portability and quality with ease of use. This camera scored high in all areas. It is an advanced level point and shoot camera without question and will perform incredibly well for any end-user seeking high quality images in a convenient package.Product packaging is exceptional with very clear instructions.  As always, I recommend reading the manual- an often overlooked task.  The product build is also exceptional, providing a very solid build quality typical at this price point. In fact, the next jump to build quality in my opinion puts you in the Nikon COOLPIX P7700 12.2 MP Digital Camera with 7.1x Optical Zoom NIKKOR ED Glass Lens and 3-inch Vari-Angle LCD class, at a much higher price point (though it is expected to drop with the announcement of the Nikon COOLPIX P7800 12.2 MP Digital Camera with 7.1x Optical Zoom NIKKOR ED Glass Lens and 3-inch Vari-Angle LCD. Note, this build quality also increases the size.  Unlike much cheaper options, this camera will not fit into pants pockets.  It is better suited for carrying in a bag or a waist pack. Ergonomic design is well thought out in all aspects and any complaints would really be nitpicking. The rubberized grip on the right side of the camera seriously improves shooting ability through a better grip and a stabilized hold.  The touch screen provides limited value in my opinion, but its nice to see this option finally emerging. I do miss a viewfinder, which I consider critical for serious photography.  However, this camera was not designed or marketed with that intention.One of the most important, yet often overlooked, aspects of consumer cameras is responsiveness; and, specifically three key areas: time to turn on, time to focus and lock, and shutter time. In all three areas, the Olympus exceeded my expectations and I have found it to be nearly as good as my more expensive P7700 in this regard. Even in low light, the Olympus seemed to acquire and lock focus far better than expected.  Keep in mind, for context, I am a full blown pro level DSLR shooter.  This ability to obtain and lock focus means you will likely not miss those important shots of your family in action.The SH-50 provides a decent amount of manual control for the creative types. However, it offers ease of use through fully automatic control with scene detection. However, in automatic mode, I noticed the flash rarely fired.  As a strobist myself, I rarely shoot without flash, even in broad daylight. The camera also offers custom white balance though I imagine most will stick to automatic white balance, which worked very well in my tests.Since this camera, like nearly all at this level, does not offer RAW files, image quality of the produced jpeg out of the camera is critical as most users will not post process.  In this regard, the Olympus is likely best in class. Skin tones were accurately reproduced with decent, yet not over-saturation. The camera shot with minimal noise to ISO 400 but I would never exceed ISO 800 with this camera personally (I am a low ISO shooter by design). But, you can go to ISO 1600 if needed. Exposure and color were incredibly accurate in my tests.  A key thing to keep in mind is the ability of the camera and lens to resolve details at increased zoom lengths (any camera really). In this case, the small sensor with the dense pixel design (16mp on a small sensor) cannot overcome the 24x optical (versus digital) zoom.  Keep that in mind as you zoom in.A final key selling point of this camera is the 25mm wide angle capability.  While I would never shoot portraits at this focal length, the wide angle capability clearly opens up creative options for the user as well as more practical applications such as large group photos.As always, feel free to ask any questions and I will try to respond as quickly as possible.  You will not be disappointed in this camera.", "Date": "September 15, 2013"}, {"Title": "Best Camera I've Ever Owned", "Author": "Thomas Krafft \"thomaskrafft\"", "ReviewID": "RFHCCCK84NOGK", "Overall": "5.0", "Content": "Beautiful form meets ultimate function in this camera and that's no exageration. I have had five digital cameras before this one, including an interchangeable lens micro 4/3rds Olympus that I liked very well. None has had the full features in a convenient size as this one does. The menus are intuative and easy to use, the buttons are comfortably and traditionally located and the anti-shake features are as good as Olympus claims. Best and most important of all the photos look extremely fine with little noise and the colors seem very accurate. Battery life is plenty long, but I did also purchase a spare. I do wish there were a way to charge the battery outside the camera, but there is a light around the power button to let you know when it is fully charged. I love the telephoto range and at this point no other point and shoot this small has such extreme range and with the superlative stabilization. You can use the full zoom without a tripod. I give this camera my highest recommendation. For an unbiased, extensive review go to [...]", "Date": "July 12, 2013"}, {"Title": "Just what you need if your looking for an excellent camera!", "Author": "Amazon Customer", "ReviewID": "R1EO7DZYM8RLIM", "Overall": "5.0", "Content": "I purchased this camera mainly for the 5-axis video stabilization and I was not disappointed. The camera seems to be floating through the air when taking videos while on the move. Another great feature which I like is the ability to just touch the screen on what you want to focus on and take the picture without having to use the shutter button. Pictures and video all are sharp and clear. The 3-axis stabilization when taking pictures also does a great job while the 24x/48x zoom is a lot of range for such a small camera. The camera is very well constructed and has a little weight to it. The only thing I did not like on the camera is the plastic cover over the USB and HDMI connections. A hinged door would be less inclined to be broken. Overall a great little camera.UPDATE: One thing I've found is that it is extremely difficult to hear the sound from video when playing back on the camera. Most cameras have a small hole to allow the sound to exit the case. I have been unable to find any on this camera. I also have an Olympus TG-830 camera and the sound is very easy to hear. This isn't a big problem but could be for those who like to view and listen to videos on the camera.", "Date": "July 8, 2013"}, {"Title": "A bit too bulky for me, but not a bad camera", "Author": "J. Maxon", "ReviewID": "R2MVNSWZ1YT1EX", "Overall": "3.0", "Content": "I like the old school look, particularly the pop up flash, but the plastic feels a little cheap. Also, for a point-and-shoot, it's fairly bulky. I couldn't fit it in any of my other point-and-shoot cases. The biggest problem is with how far the lens sticks out, even when fully reclined. It also doesn't use a standard Mini or Micro USB connector. You have to use a special cable by Olympus (provided) to connect the camera to your computer/charger. This means one more miscellaneous cable to keep track of.The controls are simple, but the menu system is a little messy to navigate. The 24x zoom provides excellent reach for distant shots. The macro option was a little disappointing; it forces the lens/zoom at a fixed position so you are stuck using predefined settings. I also had a hard time taking a handheld macro photo that wasn't blurry, even with a fair amount of light on the subject; you pretty much need to use a tripod (or a steady surface). Not so good for moving subjects. However, the camera was able to use autofocus fairly close to the subject, I measured about 1\" from the lens, which is about 3\" from the camera body/image sensor.There are no aperture and shutter priority modes, but you can somewhat tweak the settings under the manual mode. I'm being generous using the word somewhat. The shutter speeds go from 1/2000 to 15\", the ISO from 125 to 6400 (expect lots of noise higher up the scale), but the f/stop for aperture is useless. Instead of moving up and down stops, you get two options depending on the zoom. Zoomed in, you get F3.0 and F8.7. Fully zoomed out you get F6.9 and F20. Nothing in between. And because you can't set the priority mode, changing one value doesn't auto-set the other, so you need to manually tweak each setting. On the positive side, the preview screen does show you approximately what the picture will look like as you are making your adjustments.Overall, the camera feels a little cheap to me and is limited on options (no GPS, for example). It's bulkier than I like a point-and-shoot to be, and 16MP isn't the highest quality you can get for this price range. The best thing this camera provides is the 24x zoom, but for the bulk, I'd rather go with something a little smaller. For example, the Sony DSC-WX300/B is 18.2 MP with a 20x Optical Zoom and is half the size. Not to mention a better build, longer battery life, and a smaller price tag (currently $278.00 on Amazon). Granted, the Sony has even less features than this camera does, such as no macro or manual mode, but it's a lot more compact and easier to carry around. When looking for a camera, it really depends on how you're planning to use it. I like the Sony DSC-WX300/B for quick out-and-about family type shots, the Sony Alpha SLT-A99V for more professional shooting, the Canon EOS Rebel T3i for full control and good quality photos without having to lug around the A99, and the Panasonic Lumix ZS20 for the best overall full control/features on a point-and-shoot. I just don't see where the Olympus Stylus SH-50 iHS fits into my arsenal. That said, if it's your only camera, and you don't do anything overly complicated with it, it's not a bad choice.", "Date": "September 18, 2013"}, {"Title": "Great camera. Hits its niche.", "Author": "D. MCKICHAN", "ReviewID": "R11M7UNCQU6645", "Overall": "5.0", "Content": "I have had probably a dozen or so digital cameras in the last 10 plus years ranging from what was at one time top of the line compacts in the 1-2 megapixel range with at most a 3x zoom, to DSLR's, and superzooms in between. At one point I needed them for work purposes and was always looking for good photos and video shot at long range in different lighting conditions.DSLR's are the best in the consumer class. I have an Olympus (E-510) with the 4/3rds sensor and a Canon (T1i) with APS-C. Both took outstanding pictures and despite now being several years old, are two that I have no plans to upgrade as for pics around the house and on trips, they really capture all the detail I need and most photos come out looking almost professional. Drawback however is the large size, especially with a decent zoom attached. I use them for important events but they sit more often or not as they are not fun to lug around for a long time or when I have no plans to shoot anything but want to be spontaneous and bring a camera along.Enter the compact cameras. I have not tried any of the mirrorless offering as they still seemed to big and lack zoom but I do have a Panasonic zs20 and Olympus XZ-1 as my most recent upgrades. Those I got a year ago and are the best comparisons for the SH-50, especially the ZS20 which I got for exactly the niche that the SH-50 is designed for.The SH-50 is built with typical Olympus heft. My E-510 and XZ-1 have great build quality. I love the E-510 despite it being 6 years old now. It was cheap when I got it but in the hand feels far better than a lot of the entry level Canon's and Nikons it was competing against (ditto for the lenses). So despite the fact I have Panasonics, Canon's and other \"bigger\" brands I think highly of the Olympus stuff which seems to be better build wise than comparable offerings in the same price range. The SH-50 has good heft to, parts that fit together well, and no visible manufacturing flaws. It comes with a battery, wrist cord, stylus pen, charger, and manual/viewer on CD. It also has a quick guide that basically just shows you how to put the battery in and turn it on. (CD has a manual on it. If you don't want to install the viewer and other stuff the CD will try and make you do, just open the files on the CD, go to manuals, and for English open the ENU pdf.)Camera itself is a bit on the \"large for a compact\" size. This is bigger than my ZS20 and almost the size of the XZ-1. The small camera case I use for the ZS20 won't fit the SH-50. Still a lot in a smaller package with the 24x zoom and various stabilizing systems. It is a pocketable camera. No GPS but I don't use mine on the ZS20 so no loss.Battery took a bit to charge. Looked to be at less than a 1/3 charged out of the box and took about two hours to hit full. It is a USB type charger with included wall plug in. Most of he USB charged cameras I have take a long time to charge up. Battery is a bit bigger and heavier than what I have in the ZS20 so it will hopefully last longer in the field (and probably why it took so long to charge up). No SD card is included but I had a 16gb Sony class 10 on hand that I put in. It powered up fine and I took it out for a test spin.I have a few tests I run with any new camera I get and I ran it through the same telephoto, moving subject, and movie tests.I will start with just normal photos. They are fine. Far less noise then the ZS20, despite both cameras having 1/2.3 sensors at about the same megapixel count. The XZ-1 takes better normal pictures but like a DSLR it has a bigger sensor. Cost of that on the XZ-1 is bigger sensor in a small camera, but with a significant loss of zoom capabilities. The SH-50 is a backlit CMOS so maybe this helps vs. the ZS20. The SH-50 has a pop-up flash that is hidden if you don't want to use it.Telephoto was excellent in good outdoor light. I was surprised by the lack of noise (in all shots) and the telephoto was very clear at 24x and even a click or two when zooming later on the computer. Auto focus was decent and if it focused on something I didn't want initially it would choose a second or third focus point when I re-half pressed the button to focus. Very nice when shooting through something like trees. 24x zoom in something this size is outstanding. The IS system works very well. At 24x you still need to hold very steady as you are asking a lot of the IS, but if you can do it the pics turn out good.Moving subjects in good light come out well in even the auto mode. I got some of the kids swinging and running around the backyard at about 630pm and some clouds so light was good but not great and there was no blurring. Definitely something I would feel comfortable with taking out to a ballgame or trip and getting good shots in a variety of conditions and while using some telephoto.Movie mode is where this camera shines vs. the other compacts I have. XZ-1 tops out at 720p. ZS20 will do 1080 at 60fps but the IS not as good (and I like Panny's IS). The IS on the SH-50 for video though really does work great. Best movies I have shot with a consumer class camera. Again good light is a big part of that with such a small sensor, but assuming your lighting is good the IS on the SH-50 gives you buttery smooth video. Audio is good and you can zoom with out motor noise. Some focus issues if you zoom in or out to fast but overall very good and great detail preserved at max zoom. IS at max zoom is stressed and looks to float, but again at 24x that is to be expected. Working with it at near zoom ranges it holds steady quite nicely.The only tip I will give is that you need to go into the \"on screen\" menu to change the modes as far as frames per second goes. The SH-50 is set up to shoot 30fps out of the box in 1080 mode. This is great for slow moving events, but I took a test of the kids swinging and then jumping off and got a lot of motion artifacts with the quick movements. I saw that my pics were 30fps. Went into the \"menu\" accessed by the menu button and found I could change 1080-720-VGA but nothing to adjust it off the 30fps. Even the 120fps mode isn't there. You need to look at the screen. Along the right are a series of icons. The one on top is a movie camera icon. You use the silver select dial to work with these. (Hello manual on the CD). This movie camera icon allows you to select the 1080i 60fps mode (Kids swinging and jumping of came out perfect) and the 720p 120fps mode. The 120fps mode is the best slo-mo I have used (The ZS20 has a similar mode as do a few others I have). The SH-50 though is 720p and captures by far the most detail. It isn't breaking glass or a drop of water exploding cool but for a bonus mode it is actually useable and fun. Good light though is a must in this mode or you will get detail loss and noise. For fun though it is neat and kids will love it.Overall I'm very pleased with this camera. It is actually cheaper then, the now over a year old, ZS20 and takes better pictures (less noise, has more zoom, as good build quality, and takes better video). I like the ZS20 and in fact just used it last weekend at a 5K my wife was in and was pleased with the pics and video but the SH-50 is nicer especially with the better price point. I lose GPS but didn't use it anyways. The XZ-1 with its larger sensor takes better portraits, low light photos, and less then 4x zoom photos. It should though with its larger sensor, just like my DSLR's take much better pics then the XZ-1. But the XZ-1 has lesser video and no where near the zoom range. That is the trade off if you want to carry 24x zoom in your pocket, you need the smaller sensor to pull it off.The SH-50 gives you the flexibility to take near and extreme far pics as well as video. If you are like me on trips or kids events, you want that flexibility of choice and are willing to give up that larger sensor to get some of those other benefits in a small package. If you are going to be shooting indoors and at close range and want small size look at something like the XZ-1 or similar bigger sensor  compacts. With the SH-50 it will do decent photos inside and close but its niche is \"small with massive stabilized zoom\". It nails that and adds top notch video.  For the price this is a great travel zoom camera. I would recommend it.", "Date": "August 23, 2013"}, {"Title": "Perfectly fine pocket super super zoom and not expensive either...", "Author": "Alexander Don-Doncow \"Critical Al\"", "ReviewID": "R3VQQNY8F97QUO", "Overall": "4.0", "Content": "Very good pocket super zoom, very decent picture quality for a small sensor camera that is...Color is excellent except for the reds that are noticeably exaggerated . Nothing that cannot  be easily corrected in Photoshop.Exposure, about the most consistent I have seen in any camera.Resolution, theoretically great, in practice rather poor. Here is where this camera limps notoriously. Olympus chose to apply a very aggressive de-noising algorithm.It is on at all ISO speeds and there is no way to adjust or cut it off. End result, very mushy images when viewed at high resolution; you can forget about printing 16x20s or larger, sorry...Having said that, I must say that the camera still produces pleasant if not perfect images. It might even surprise you occasionally when shooting in low  light.User interface is easy to learn, quick and effective. Lots of features, very decent and usable HDR, panoramas and more.Very limited manual controls but automation is so good that you might not even miss them.Awesome zoom with one glaring shortcoming, light gathering power at the extreme zoom end is outright pitiful, it is so low that the camera has to use very long exposure times even on sunny days. Even the excellent stabilization system cannot cope with it and you are forced to lean against solid structures even in broad sunny daylight if you want reasonably sharp picturesUsing the zoom indoors with live subjects; forget it!  Not even on a tripod!Now for the real forte of this camera - Incredible videos, the stabilization system for videos is truly stunning, it is practically like having a \"SteadyCam tm\" built into the camera (for those who know what a SteadyCam does).On the other hand, the superb stabilization comes at a price, and the price is very, very aggressive cropping, this prevents from taking full advantage of the excellent wide angle capabilities of the lens. Strangely enough, Turning off the stabilization does not prevent cropping, so that's that.Manual controls in video mode are rudimentary, and there is no provision for an external mike. Nonetheless, the built in sound is very acceptable even outdoors (with the wind noise filter on).Thankfully, touch screen focus can be fully enabled during video recording and that kicks it one big notch up making it, in a pinch,  a very viable videographer's tool.Even if the picture quality may not be to your liking, you may still seriously consider this camera for its video capabilities.", "Date": "April 1, 2014"}, {"Title": "Solidly built, great zoom, easy to operate!", "Author": "Amazon Customer", "ReviewID": "RULAH3EFHMC8C", "Overall": "5.0", "Content": "The Olympus Stylus SH-50 is the most solidly build point-and-shoot I've seen.  The metal body is sturdy and seems as though it would take quite a beating.  The touch screen on the back is also inset just slightly, so that if dropped or dragged across a rough surface while flat, the screen wouldn't be damaged.Perhaps one of my favorite features on this camera is the ability to take still pictures at full resolution while the video function is still recording.  This eliminates the need for two cameras (one videoing and one still shooting) while I've been recording school functions.  The quality of the video is outstanding, and the audio recording from the internal microphone is very good also.  You can zoom in and out while recording, which was an improvement from my previous point-and-shoot, which would disable zoom when videoing.The zoom on the camera is also incredible - at 24x, this means you're able to shoot a good close-up shot from the bleachers at one side of the football field to the bleachers on the other side of the football field.  I was also able to get some good close-up pics of a humming bird in flight, and the pics came out with great color balance.The camera functions very well in low light (must be a good sensor!) and I was able to take some photos using an IR filter (not attached, simply held in front of the lens pressed against the front of the camera and using the low-light/night shooting setting).Potential down sides: - The camera is pretty big - it's not one to slip into the pocket of a pair of jeans.  I suppose it isn't easy cramming a 24X telescoping lens into a tiny camera.  It's also a little on the weighty side. - The touch-screen is a neat feature but drove me a little crazy - one setting enables the camera to take pictures when you touch the screen.  The downside is every time you accidentally touch the screen (a large part of the back of the camera), it takes a picture.  I ended up taking a bunch of accidental pictures just while manipulating the camera.  You can turn this feature off, and I have left it off since discovering the option.Recommendations: - Buy an extra battery and charger - all these great features drain the battery pretty fast, especially when videoing and shooting. - Invest in a high speed, large capacity SD card, such as a class 10 32GB card - as the camera can out shoot and out record some smaller cards.Overall, I really enjoy this camera.  It would be a great camera to serve as a family's primary digital camera for indoor/outdoor events, or for a school or organization looking for great shots without paying the hefty price for a complicated SLR type camera.", "Date": "October 17, 2013"}, {"Title": "Fun easy camera", "Author": "Nicholson", "ReviewID": "R3OOT09CQY83QZ", "Overall": "5.0", "Content": "I bought this camera because I wanted an easy to use point and shoot camera and am familiar with Olympus cameras  as I actively use some of their micro four thirds cameras. I was attracted by the inclusion of image stabilization as well as picture quality. I was impressed with the quality of the pictures from this camera. I do a lot of Photoshop work and this camera automatically makes pictures that are so sharp and bright it takes all the work out of getting sparkling sharp pictures. There are also loads of special features which are just plain fun to use such as the mirror image function. You can make  all sorts of freaky  faces of yourself and others.  The image stabilization takes the jerkiness out of pictures especially movies and gives them a smooth floaty appearance,within limits.  About the only decision you have to make is the quality of picture. I set mine on high. Don't try flash with Intelligent Auto. One cool feature is back light control. I often see people lining up their family in front of a landmark with the sun coming from the rear. With ordinary cameras you get bad results but using the HDR back light setting you can get away with it.This is not a pro camera as it only shoots in JPEG although you can use Photoshop on it. You don't get raw images. If viewed at high power some images can be waxy. It uses screen viewing only,no eye piece. Uses touch screen or traditional  button pushing picture taking . I am a touch screen fan. There is no GPS. It will work with wi -fi  but  it requires a special card for this. It works best at lower magnification . It has tremendous optical zoom power but it is really hard to see what you are doing at high power on the touch screen. It could use a two stage zoom feature to make it more controllable when you zoom. The last quarter inch of the zoom lever makes the picture go completely bonkers.", "Date": "September 8, 2013"}, {"Title": "Great Camera for the Price", "Author": "Bob-On-The -Go \"Bob-On-The -Go\"", "ReviewID": "R2Y9LNIV8T1NPQ", "Overall": "5.0", "Content": "OK ,where to start.  24X optical zoom, 3 inch HD LCD, image stabilization better than anything on the market, HD video, incredibly high quality photos and more features than you can shake a stick at. I've had it for a few months and am still discovering wonderful new things that it can do. A camera like this would have cost well over $1000 a couple years ago and it would have been bigger and bulkier. As some of the reviews point out, about the only things this does not have are WiFi and GPS, but I could care less. What''s the point of WiFi in a camera. I like to have control of downloading the photos and videos, especially when I don't want them all. And I've never been a fan of GPS on a camera. Sure it's kind cool, but not worth the tradeoff of many of the other features on this awesome camera.", "Date": "January 10, 2014"}, {"Title": "Retro Inspired Point and Shoot", "Author": "E. Byers", "ReviewID": "R1RBKTPA2RKNGI", "Overall": "5.0", "Content": "While this camera may look like some of the micro 4/3 replaceable lens cameras, it actually uses the sensors found commonly on small point and shoots.  However these sensors despite their smaller size have gotten quite a bit better over the years, especially the processing power attached to them.  This camera mates a super zoom lens 24x zoom (25-600mm equivalent), fast responsive touchscreen, and some amazing image stabilization in a retro looking package.Photo quality: Compared it to our Canon G10, which is an older slightly step up from the point and shoot sensor size, and while the G10 had a small edge, the photos were quite close.  The CMOS sensor on the stylus helps here, since it can get more light into the sensor without noise.  The main difference I noticed between the two cameras was the electronics and other technology utilized.  The Stylus's touchscreen was quick and response, even allowing you to take photos right from the touchscreen.  Also the image stabilization was quite good on the Stylus.However where the Stylus really shines is in video capture, full 1080p, sure it's just resolution, but this camera takes great video at that resolution.  The 5 axis image stabilization is amazing.  You can turn on video, move around and the image just floats, stabilizing in a mind boggling way.  You can also capture stills while shooting video which is great.This is a great point and shoot, comes in quite a bit cheaper than the step up, or going to a micro 4/3's format, while being more portable.  The zoom lens needs quite a bit of light fully extended, but this is almost always the case in these cameras.  The sensor is great, image stabilization especially on video is jaw dropping.  Great little camera.", "Date": "September 23, 2013"}, {"Title": "Great Camera, love the image quality.....BUT......", "Author": "Nancy Kossmann", "ReviewID": "R3P9ONPDIB0VC3", "Overall": "4.0", "Content": "I have no problem with the camera, but the A/C adapter did not work right out of the box.  I contacted Olympus within three days of receiving the camera and they tell me that the part is no longer available.  So,..... they're still selling a camera (brand new) that they don't make battery chargers for any more???  This is ridiculously hard to believe.  I realize I can buy this part seperately or charge the battery via my computer, but come on Olympus...this is very poor customer service.....open a box on a new on and send me the adapter.  Camera, great!  Customer Service, \"Don't count on any!\"4/16/2014 Update:  Olympus now sends an email stating that the original email was a mistake and that I should call them at their toll-free number to resolve the issue because \"these types of issues are best solved over the telephone\".  So, I take the time to call them, and re-explain the entire issue, then the person tells me that I should deal with the seller on this issue and then to call them back if the seller doesn't correct the problem.  Wow! Great Customer Service, right?  BUT WAIT:......I then contacted Amazon and they DID take care of the problem.....I LOVE AMAZON!  Thank you Amazon and Mark!Another update to the actual product....I am LOVING this camera.  It has a \"Magic\" setting on the dial that adds filters to the photos:  Wide-angle, pin-hole, mirror-image, pop-art, dramatic, etc.  these are fun options!  Also, the 16mp is something I will use to print enlargements of my photos.  The camera is easy to use and the pictures a very sharp.", "Date": "April 10, 2014"}, {"Title": "Exceptional Focus for a Point-and-shoot", "Author": "Ardeal \"Emi\"", "ReviewID": "R33M6UQE6567L", "Overall": "5.0", "Content": "I'll start with a little background: I have been a passionate amateur photographer for more than 20 years. Over the last 2 years, although I am primarily a DSLR photographer, I used more than 10 new point and shoot cameras: primarily Sony, Canon and Panasonic.This is the first point-and-shoot that truly amazes me with its FOCUS ABILITY. I've come to accept poor focusing as a result of a smaller sensor. Not anymore! A month ago I was at the pool with my two kids as they prepared to jump in the pool about 15 feet from where I was. I got some amazing shots with both of them in the air, even though they were not at the same distance from the camera, and get a nice clear background. If you are OK with smaller size pictures, you can use the various burst modes to take even 20 pictures in a row! Or use the video that has a great focus too.The camera feels solid. Compared to other cameras of this size, I would say it is just a little on the heavier side - which to me means higher quality than some cheap $100-150 cameras. The camera has a nice balance between buttons and touch-screen features, that are very easy to master. The MANUAL CONTROLS are fairly good - and the instant histogram comes in handy. The HDR landscape feature is similar to that of other cameras in this price range.One feature that my kids enjoy: the MAGIC enhancements - such as half an image mirrored, as well as the fish-eye-lens feature.Overall, an impressive camera. I have checked review sites comparing this camera to others such as Snapsort site, and it gets good grades. In some cases I have to disagree with their verdict in favor of this camera, even if the other cameras are $100 or more expensive. Olympus has really done a great job with this one.2 things of concern: the charger is different than the regular mini-USB charger: although I've seen a lot of digital cameras, this charger is different than all the other I've used. Also, the video recording does not have audio on my TV because of the format. I did not have that issue with Sony or Panasonic cameras.Looking for a perfect bag for this camera? The Case Logic DCB-302 compact Case Logic DCB-302 Compact  Case for Camera - Black is perfect size and costs just $6 at this time.One last thing - you do not have to be worried about carrying the stylus around for the touch screen. The finger works fine - I never had to use the stylus and I don't think I will.", "Date": "September 26, 2013"}, {"Title": "Quality Camera!", "Author": "Syd", "ReviewID": "R1B3GH06F1GY9T", "Overall": "5.0", "Content": "First, to reiterate (and to answer a customer's question), the touch screen feature is not always on as it can be easily locked. I use the shutter button almost 100% of the time. I know three young adults who have photographic training, even on the professional level, and each of them comment on what a nice camera this is - feature-wise and quality-wise. I spent many hours researching cameras and this is the choice that suited me. I wanted more than the average point and shoot so I would get quality photos but I did not want a Digital SLR camera with features I know I would never use. This camera has many options from Automatic to Program to Manual and other useful modes, along with special effects modes. The video is very nice quality also. The camera comes with an instructional CD so you can really learn how to use all of its unique features without feeling overwhelmed. I appreciate the camera's anti-blur technology and this was a big selling point for me. I did buy an extra battery at my local electronics store so I have a back-up when I am traveling and taking a lot of photos. The camera feels substantial (not cheap) but it is small enough to fit into my camera pouch - a perfect size for travel. I chose the black color option and I am very satisfied with the camera's design. I finally found a camera that I really like and it is easy to use, producing great photos, plus it offers excellent camera options/functions/settings for expanding my skills and taking my photographs and videos to a higher standard and quality.", "Date": "September 23, 2013"}, {"Title": "Overall Excellent Camera", "Author": "A. C. Bauer \"Major Husker\"", "ReviewID": "R2IX9E6BQDNS6Z", "Overall": "4.0", "Content": "This is a really good camera overall. It is very easy to use and takes great pictures. The zoom is awesome - no complaints at all about the quality or operation of the actual camera. My only issue is that it doesn't use a standard Mini or Micro USB connector for charging the batteries. Why it is a totally different connector from every other piece of electronics I have is beyond me. Learned the hard way when I just packed my usual connectors for a recent trip - ran out of battery juice after a few days and could not charge the battery. My fault, but just annoying.", "Date": "February 25, 2014"}, {"Title": "Spectacular picture taking machine.", "Author": "rollo", "ReviewID": "R1E3C5WL2HNHW9", "Overall": "5.0", "Content": "The colors and focus are fine, the optical zoom is flawless, the battery life is very good and the camera is easy to operate. Pictures are excellent. The camera has a little more weight than most of the same size nevertheless, I cannot say enough good things about this camera.", "Date": "December 16, 2013"}, {"Title": "Great camera full of features that make a difference!", "Author": "G. Perez \"Always having fun!\"", "ReviewID": "RG3HEETE9GTEG", "Overall": "5.0", "Content": "Let me start off by saying that I own a semi professional camera that is super awesome to take pictures. The only problem with that camera is that it's too bulky to take everywhere. I had been debating whether to get a second smaller camera to take to places where I don't find the need to take the SLR, and along came the SH-50, this camera outdid my expectations, it is very compacted, it's full of features that you will actually use and the picture quality is just superb. You can tell Olympus didn't cut any corners when they designed it.I highly recommend this camera for anyone who wants great image quality on a compacted, not so bulky camera. You will not be disappointed.", "Date": "September 19, 2013"}, {"Title": "Disappointed in macro & pet scene - otherwise fine", "Author": "Yarii", "ReviewID": "RS83CC28AXZYN", "Overall": "4.0", "Content": "This is my first Olympus camera after using Sony, Panasonic Lumix and Fuji cameras my entire life. I'm somewhat disappointed with this camera, although it does have it's redeeming qualities with video.There is no dedicated macro setting on the thumb-wheel, You have to go into the Scene Settings and choose Super Macro, but sometimes this choice doesn't do such a good job, 25% of my macro shots aren't as sharp as I like, even when using a tripod. I have better luck shooting close using the P mode and cropping the photo.  Speaking of tripods, the tripod mounting socket on this camera is plastic that will break if you're not careful. For the price this camera is, the socket should be metal.The Pet Scene settings aren't so great either. I have 3 cats and using the Cat setting, photos are washed out, noisy and grainy even though my cats hold still. I get better results for cat photos on iAuto.This is a compact camera but it's heavy and large. None of my compact camera cases would fit, so I opted for a genuine leather Olympus case which is made for this camera and the price isn't bad considering it's leather - see link below.The build quality is good, except for the plastic tripod mount. Made in Indonesia if that matters.  The zoom motor sounds strong. Image stabilization is excellent.My Sony cameras were always my \"go to\" cameras for superb-quality videos....but this Olympus really excels in the video department. It's better than any of my Sony cameras, plus it has high speed video, which in reality becomes slow motion when you play it back. When using this camera (or any camera) in high speed video, there will be no audio. There can't be, it would be like the opposite of the Chipmunks.The battery life is good, considering a touchscreen uses more power. You charge the battery inside the camera.Camera is quick to focus, quick to take the photo, and fast response to take the next unless you're using one of the Magic Filters.  I love the \"fragmented\" filter which makes the photo look like you've taken a hundred photos and combined them into one.So like most cameras, there is good and bad to this Olympus. If good macro shots are at the top of your list, I'd choose a different camera. If full manual control is on your list, definitely don't choose this camera; you have only 2 choices, neither one good. If you aren't into macro shots or full manual control, you'd probably like this camera a lot, as the photo quality is mostly excellent, especially landscapes - beautiful!Genuine Olympus Case: Leather Case for XZ-1 & SH-50Class 10 SDHC Card:  Transcend 32 GB Class 10 SDHC Flash Memory Card (TS32GSDHC10E)", "Date": "April 21, 2014"}, {"Title": "Great little point-and-shoot camera", "Author": "Joanna Daneman", "ReviewID": "R1J8LKTB8C5Q6A", "Overall": "5.0", "Content": "This pocket-sized camera has some features that set it apart from the usual point-and-shoot digital cameras. Even if you use a Digital SLR (interchangeable lens camera), often a small point-and-shoot is handy for backup, for carrying when you don't want a bulky camera, or just for people who simply want a digital camera that takes stills and videos but isn't going to set you back five hundred bucks or more. I can say that this camera is probably going to work for most people, and even work for the more serious photographer who wants a quick-shoot camera.PROS24X zoom is HUGE. You can zoom in from a great distance and take close-in shots for sports, outdoor nature photography or for tight framing of portraits (a medium telephoto is a great way to take a face picture sometimes.) You zoom by toggling a lever on the top of camera. Easy.Image stabilization in this camera is exceptional. You get three axes of stabilization for stills, plus two more for videos, meaning that you can get sharp results even without a tripod.Full HD Video Recording (1008/60i)Smart Panorama feature to let you take panorama shots (but chews up battery life, beware.)3\" Touch Screen. I got used to using a touch screen on my main camera and I find it's the easiest way to change settings. 3 inch is a very good sized view screen.Battery lasts for about 300 shots, pretty good.11 \"Magic Filters\" These let you convert your images in the camera to artsy shots. You can always do the same thing with your photo editing software, but for people who send their digital camera shots directly to Instagram or Facebook, it can be convenient and fun.Form factor: a bit larger than typical point and shoot. Also, it's made mostly of metal. Has a very sturdy, robust feel. A great camera for backpacking and outdoors.Cons:A bit grainy at low light setting (ISO 1600)Flash seems a bit weak in very dim light.This camera is bigger and heavier than most point-and-shoot. It is 30% bigger than a Canon Powershot I typically use as a backup camera. (But it also does more.) So, a bit bulkier than typical point-and-shoot cameras, which are often about the size of a pack of cards.No viewfinder (this is now usual in point-and-shoot cameras as it adds cost, and it's not used for videos, so pretty much, viewfinders have gone away. But in bright light, a viewscreen can be hard to see.) A minor point, but realize you may want a screen protector as the viewscreen is how you are going to be framing your shots.The manual settings and some other setting are a combination of dial and touch screen. I got used to touch screen on a Canon DSLR and a touch screen makes settings about as easy as you can get. I found some of the settings not as simple to get to--and the manual is not complete. Some information (such as how to use the Magic art filters) is simply not there. To use the filters, by the way, you set M for Magic BEFORE you take the shot and scroll through which variation (pop art, fragmented, pin hole, dramatic, sparkle, punk, watercolor and the reflection which mirrors your shot on a horizontal axis. This last is great for videos. It's a bit slow to set your filter, but it lets you visualize AS you shoot, not process after shooting and it lets you apply the filter as you shoot video. This is unique to most filters on digital cameras and could be a lot of fun.)Video: very easy to use, high def is an advantage.Software: the software is not very sophisticated. In particular, the video portion is almost useless (you can merge clips, extract a still, export, but very little else.) It's there for users to have something to process photos and videos, but you'll need a lot more than Olympus offers.Manual: Somewhat sketchy on the deeper features. It's a PDF file on the included disk.Summary:I like it far more than my Canon Powershot. If you can only buy one camera and it needs to be affordable and compact, this one is a great choice and has a lot of features for the price.", "Date": "April 16, 2014"}, {"Title": "GOOD PRODUCT! GOOD 24X ZOOM!", "Author": "liang zhang", "ReviewID": "R14XGGJJINGGDX", "Overall": "5.0", "Content": "This is really good product, and the 24x zoom is very clear from the picture. and the models of manual could satisfy the basic things for iso......", "Date": "May 13, 2014"}, {"Title": "Great features and great pictures", "Author": "B. Campbell \"akreader\"", "ReviewID": "R2UKWW26KA6SFG", "Overall": "5.0", "Content": "I love the \"super zoom\" - even have used it in a pinch like a pair of binoculars! It has so many features that I don't use, but hope to some day. Not as compact as my previous camera, but the features make up for it. I was a little surprised that it uses SD cards instead of XD.", "Date": "March 22, 2014"}, {"Title": "Takes great pictures", "Author": "Paul Stanley", "ReviewID": "RZWLJOGORYM16", "Overall": "4.0", "Content": "24x zoom works great. no noticable auto-focus lag. The lens got stuck and wouldn't extend once, but I think it was dust in the mechanism. Now I have a case and the problem has not repeated.", "Date": "February 24, 2014"}, {"Title": "Amazing value", "Author": "E. Gottwald \"emilG\"", "ReviewID": "R4UB9H4YOWJEE", "Overall": "5.0", "Content": "Given the features, this is great value for the price. The body could be a little sturdier in my opinion. The battery/memory card compartment door has a cheapo slide lock and the fact that Olympus chose to use odd USB sockets for power and file transfer are both minuses in my opinion, but they are not bad enough to negate the great pictures this camera takes.", "Date": "February 21, 2014"}, {"Title": "excellent", "Author": "sunxin770", "ReviewID": "R2158I58IVX8T3", "Overall": "5.0", "Content": "it's really good and i like it, i will pay more attention to this shop, everything runs well, hope this one helps", "Date": "May 12, 2014"}, {"Title": "great camera", "Author": "Amazon Customer \"Christie\"", "ReviewID": "R2FMLAKTV3C06P", "Overall": "5.0", "Content": "Love my new camera! It takes awesome pictures, esp for a camera this size!Still learning what all it can do........", "Date": "May 1, 2014"}, {"Title": "Fun easy to use camera", "Author": "Lee A. Vercoe \"TangSooPap\"", "ReviewID": "R3H2RS5WVHO7PR", "Overall": "5.0", "Content": "I wanted a camera to take with me that was smaller than my DSL but still gave terrific pix. This does the job. I can fit it in my pocket if necessary and don't have to have a heavy camera hanging around my neck marking me as a tourist.There are lots of neat features with this that my DSL doesn't have like video, panoramic, a better zoom, terrific stabilizing and even an optional date stamp. The special settings are varied and easy to get to such as pinhole, fireworks, sunset, sports and many more. I particularly like the document setting using increasing contrast for B&W; documents. I use it to take photos of my pencil drawings for uploading. My scanner just won't pick up the details of the penciling.In short I can see me using this as my main camera on vacation and other events.", "Date": "April 29, 2014"}, {"Title": "great camera", "Author": "sue byrd", "ReviewID": "ROD3477UH08Q", "Overall": "5.0", "Content": "I have always used full bodied Nikon cameras. I bought this for a trip to Disney, where a larger camera is a pain to use. I took almost a thousand pictures, and several videos. I was very surprised at the quality of the pics. The video was really good as well, however don't shoot video with the camera sideways. I have yet to figure out how to flip it 90 degrees, so I can watch it. It is easy to use. Takes great pics in medium to good light. The built in flash works great, just click the open button and you are ready. All in all a great little camera. I would recommended it to any level photographer.", "Date": "April 27, 2014"}, {"Title": "Love this Camera", "Author": "D. Crawshaw \"Retro Collector\"", "ReviewID": "R11Y67G3281IFG", "Overall": "5.0", "Content": "Best camera I've ever owned. It's taking a while to learn how to use it, but so far I am very happy with it.", "Date": "April 25, 2014"}, {"Title": "Its a winner.", "Author": "Ralph C. Browne", "ReviewID": "R2KFSW3744RZ3Y", "Overall": "5.0", "Content": "having had 5 differant digital cameras in the last 3 years this one came as a realy big surprise.  Though it looks rather unremarkable don't be fooled.  The pictures it takes are great.  Seems like there aren't any conditions it won't take a picture, unless you are in a mine with the lights off.  It will even take really shockingly good pictures of anything my HDTV is showing with very good resolution and color.  It is a good start for anyone who wants a camera capable of doing a great job of taking pictures without the user having to get an advanced degree in photographic science.", "Date": "November 26, 2013"}, {"Title": "Great camera", "Author": "Deliliah J. Whitehead", "ReviewID": "R3I853O1XWSUDU", "Overall": "5.0", "Content": "The  ability to focus quickly is the first outstanding feature. No more missed shots waiting for your camera to focus. The pictures are very clear and the colors are accurate ( except under certain lighting indoors, then the colors are a tad yellow). This body of this camera has a nice solid feel (not to small for larger hands), with a retro look. This camera is a good choice for those of us who desire to capture the beauty of the outdoors on a seconds notice. No more stopping  to take off the lens cap to capture your shot ( at a long distance). I was so pleased with this camera that I decided to take out a extended warranty on it, and that was a first for me. If you are looking for a simple camera (without all of the hype) that takes really good pictures, this one will fulfill all your needs.", "Date": "January 19, 2014"}, {"Title": "Great Camera", "Author": "cliffb", "ReviewID": "R1796HY7U9QBVQ", "Overall": "5.0", "Content": "Compact powerhouse. Camera has a myriad of features in a compact package. cAMERA HAS A GREAT ZOOM  Capability and many features. Great quality .", "Date": "September 8, 2013"}, {"Title": "A preliminary review", "Author": "Reuven", "ReviewID": "R26B0Z6QFHHL0R", "Overall": "5.0", "Content": "Since I have this camera only for a week, this review should be considered a preliminary and not an exhaustive.Having said that, I have some observations.First this is my 3rd mega zoom compact camera. The first was Panasonic TZ3 and very recently Sony HX30V. I love those cameras as they are easy to carry in your pocket and quick to use while traveling.This Olympus is a bit larger than the Sony but still small enough to put in your pants pocket. It doesn't feel cheap and plastic. Feels solid and sturdy. The settings are much less complicated than the Sony, and the zoom is better.What stands out is the Optical Image stabilization. I only took still images (not video) but even for a laymen like myself I felt at 48X zoom the camera stable. It was also reflected in the pictures.The colors in my test are very good.They only thing I am not crazy about is that in order to use the flash you must first manually release a switch, so when needed it will flash.There is not GPS tagging, which I miss, and no WI-FI connectivity which I do not feel is useful. And if you insist, you can use Eye-FI SD memory card.So far it looks like a great little camera, solid and practical for a quick use and travel.", "Date": "August 14, 2013"}, {"Title": "Been Waiting for this!", "Author": "Rex C. Becker", "ReviewID": "R2SP3WE8KS3ZRL", "Overall": "5.0", "Content": "Have looked and looked at cameras for a long time.  Tired of switching lenses plus have not been able to find the features that the SH-50 offers.  Decided to wait until this was released.  Could not find anything within this price range with the features found in the SH-50.", "Date": "August 11, 2013"}, {"Title": "Very Happy  -", "Author": "B. WILLIAMS \"B WILLIAMS LOOKING FOR LIGHT\"", "ReviewID": "R2NKDUSGKUB0QI", "Overall": "5.0", "Content": ". . . I have cameras everywhere and the last thing I needed was another camera.  I was looking for something other than a camera when this popped up in the gold box.  Checked it out and watched a video and bought it.  Have used it several times for photos and even made a mini-move with it to upload to Vimeo; sharp as a tack.  This is very well made and you'll know you have it in your pocket due to it's weight; I bought a case with a belt loop for it.  Very pleased with it's performance. Will be taking it on my next Holiday !!!", "Date": "April 26, 2014"}, {"Title": "Great for casual use", "Author": "Susan C. Bennett", "ReviewID": "R21GEZJHQU6YNK", "Overall": "5.0", "Content": "I bought this to carry when I didn't want  to take my Nikon.  I've been very happy with this camera and would recommend it to anyone interested in a small, quality camera.", "Date": "January 30, 2014"}, {"Title": "Awesome camera!!", "Author": "R. Graziano", "ReviewID": "ROZFBY4FHI3CZ", "Overall": "5.0", "Content": "Compact.  Fits easily in my pocket.  The light sensor and onboard processing were PERFECT for photographing fireworks for this past memorial day.  The camera's charge cable plugs into any USB power supply capable of recharging a tablet.  To date, I've used my 10W apple USB recharger, and a mobile one I plugged into my car.Pictures are clear and crisp.  Movie mode takes awesome videos, and also lets you take snapshots as you record video.  You won't find this camera in the big box stores.", "Date": "June 6, 2014"}, {"Title": "Best Olympus ever", "Author": "Joseph C. Moos", "ReviewID": "R1U6O903ZBXXJ1", "Overall": "5.0", "Content": "Iam a long time Olympus user. This is a great camera. I found it eady to use and the 24x zoom is fantastic. Battery life is long (I'm on week 3 of my trip).picture quality is crystal clear and low light photos are perfect.", "Date": "June 3, 2014"}, {"Title": "Major disappointment", "Author": "DCDave", "ReviewID": "R3NVBNM8PV1VOR", "Overall": "1.0", "Content": "Almost every outdoor shot in all types of lighting lacked clarity and shots of the sky with clouds had lots of purple fringing and tons of noise. Did fairly well indoors. Could not take a normal shot of clouds in the sky or of anything with sunshine on it, especially trees. Colors on outdoor shots was always muted. Just plain unattractive photos.", "Date": "June 3, 2014"}, {"Title": "Love it", "Author": "Gramma03", "ReviewID": "R1ERX5FMVMQRUT", "Overall": "5.0", "Content": "I bought my camera a little bit ago and truly haven't used any of the special features but I still Love it.  On the auto setting with the zoom I have taken some fabulous photos.  So easy to use.", "Date": "June 1, 2014"}, {"Title": "Olympus SH-50 cmea", "Author": "Kindle Customer", "ReviewID": "R2RKB02UOHL0MP", "Overall": "4.0", "Content": "I am pleased with this camera.  It takes excellent pictures and image stabilization works very well.  I am disappointed at no viewfinder.  Also, there is only a printed setup sheet--no printed instruction manual.  Instruction manual is on a digital cd and I had to transfer it to my Kindle from my computer, a cumbersome process.  Picture transfer from camera to computer can only be done w. a direct connection, i.e., camera to computer.  My memory card reader does not work w. this camera", "Date": "May 29, 2014"}, {"Title": "Great pictures with outstanding resolution", "Author": "Mark", "ReviewID": "R2A41KHZUJ79Q9", "Overall": "5.0", "Content": "We bought this camera based on various reviews and it has lived up to all the reviews.  The pictures have been great with great resolution and has been very easy to use.", "Date": "May 27, 2014"}, {"Title": "Olympus Stylus SH-50", "Author": "R.J.", "ReviewID": "R894LQSES8A3I", "Overall": "5.0", "Content": "Great camera! Some of the best photographs I've ever taken. The included options and photo effects are fantastic. I only wish there was an eye viewfinder, along with the 3-inch viewfinder.", "Date": "May 22, 2014"}, {"Title": "not happy", "Author": "pkwright", "ReviewID": "RL22MZGDQ9BX", "Overall": "1.0", "Content": "received this camera about  a month ago, was very pleased with the pictures it took.  I was still learning about all the features that it offered and now it won't do anything.  Fully charged, came on, lens came out and NOTHING.  It won't come on, it won't do anything. and nothing in the manual offers anything regarding troubleshooting or even a phone number for help..  Nice camera that does not work.", "Date": "May 20, 2014"}, {"Title": "Great Zoom and Stabilization", "Author": "Ian Randolph", "ReviewID": "RO3R1K9Y609QP", "Overall": "4.0", "Content": "This camera makes a great compact camcorder with fantastic zoom capabilities. The still pictures are pretty decent, but they aren't as sharp as I'm used to.The main reason I got this camera was for the zoom capability and price, and I think it it lives up to my expectations in those areas. The place where it excels is with it's stabilization (both in still and video modes) and video capabilities. One feature I absolutely LOVE that I didn't realize it had until I started using it is the ability to continue shooting still photos while shooting video!All-in-all a good camera for the sale price I paid for it ($149).", "Date": "May 18, 2014"}, {"Title": "Great camera!", "Author": "J. Fricks", "ReviewID": "R2JCBA68W3SHGT", "Overall": "5.0", "Content": "Great camera, nice and clear pictures even when zoomed! Seems to have good battery life too. Would definitely purchase again!", "Date": "May 18, 2014"}, {"Title": "Good buy", "Author": "John W. Hinerman", "ReviewID": "R2CUWRBEFA0ELW", "Overall": "5.0", "Content": "Good value for the $, would recommend this camera for inexperienced photographers.  Works very well for my needs go get it", "Date": "May 18, 2014"}, {"Title": "Wonderful camera!", "Author": "Janna Whitehead", "ReviewID": "R2MZBWZ8KQFMSW", "Overall": "5.0", "Content": "This camera takes great photos!  I purchased it because my previous camera was old and I was tired to having to replace the AA batteries all the time.  The Olympus just plugs into the wall for charging…no more AA batteries!", "Date": "May 15, 2014"}, {"Title": "Great camera", "Author": "David Springer", "ReviewID": "RMYWDQ6KXWVOR", "Overall": "5.0", "Content": "This was a gift for my wife.  She is very happy with it and has taken some excellent photographs with it already.  I was disappointed that another store advertised it for nearly $50 less just after I purchased this one but I suppose that is just unlucky timing on my part.", "Date": "January 10, 2014"}, {"Title": "Meets my needs", "Author": "lindakay520", "ReviewID": "R3K2PRGRGK56AD", "Overall": "5.0", "Content": "Camera is easy to operate and takes sharp photographs. I use it for business product shots, family photos, and travel.", "Date": "December 22, 2013"}, {"Title": "This one was a real lemon", "Author": "K. Kurtz", "ReviewID": "R303BLA7STZCM9", "Overall": "1.0", "Content": "First of all the charging adapter was way too tight for the USB plug and then I discovered it was not charging the camera. After I switched adapters and let the camera charge for over 12 hours, it would not power up. It would beep, blink a light, make a noise and even acted like it was going to turn on but it did not. Finally, after 30-40 tries the camera powered up and showed a full battery on the screen. However, the flash worked only a couple of times and then it completely stopped working again when I unplugged the USB. Now there was nothing, no beep, no little flash of light and no noise. I am returning this piece of junk first thing Monday.", "Date": "April 19, 2014"}, {"Title": "Great Camera", "Author": "Mark", "ReviewID": "R12V5KDK788W9W", "Overall": "5.0", "Content": "Love this camera! I got it to take along on a trip just to have a point and shoot to take with. This camera has prooved to be beyond my expectations.", "Date": "March 21, 2014"}, {"Title": "BEV", "Author": "Beverly A Crowley", "ReviewID": "R2J4QUB309W6XU", "Overall": "5.0", "Content": "The camera is easy to use. If I do not like the picture I can delete it and not waste film.", "Date": "May 19, 2014"}, {"Title": "Very poor indoor picture quality", "Author": "Sampath \"Interneter\"", "ReviewID": "R3HUQ91KJ67R40", "Overall": "2.0", "Content": "Bought this based on many positive reviews and also it was on a good deal. I was very disappointed to see the quality of the image when taken indoors. My 6 year old 6 MP camera was way better. Pictures were lacking details. Then the zoom and the image stabilization for outdoor pictures. I don't know what the \"3-Axis Image Stabilization\" is supposed to do; but it just didn't help even at half of the zoom. Other things I didn't like were - non-standard USB cable and lack of viewfinder.", "Date": "May 15, 2014"}, {"Title": "Defective", "Author": "robert t king", "ReviewID": "R3LRUKRK8RPNBD", "Overall": "1.0", "Content": "There is a defect in my camera.  I turn it on and can take maybe one or two pictures, then the camera completely freezes up.  I cannot even turn it off.  I have to take the batteries out. Don't buy this camera.", "Date": "April 28, 2014"}, {"Title": "Good camera for the price", "Author": "Elizabeth D.", "ReviewID": "R38DW67IIFA1Y6", "Overall": "4.0", "Content": "This turned out to be a terrific little camera.  The zoom is excellent, focus in dim lighting is very good, handy for action shots.  I had the impression from the description in Amazon that this camera had a rapid \"burst\" mode, offering 10 shots per sec.  This did not turn out to be the case.  Otherwise, it is a nice camera for the price.", "Date": "February 11, 2014"}, {"Title": "Nice Camera with many great features and few bugs", "Author": "N. Winslow \"62deluxe\"", "ReviewID": "R2QMSZAUJTNMF3", "Overall": "4.0", "Content": "Very good sharp telephoto, many interesting features, Dramatic (grunge) in the magic wand is very cool, Sunset mode is not so great.  Sometimes a little soft at wider angles.  Super Macro is excellent for flowers and bugs.  It's easy to bump the screen and turn on a feature that takes a picture whenever you touch the screen, this results in many accidental pictures.  Overall a good camera with good to excellent picture quality.", "Date": "October 5, 2013"}, {"Title": "satisfied cust.", "Author": "Dennis Kaczmarczyk", "ReviewID": "R2Y9BD039198WA", "Overall": "4.0", "Content": "Camera has a lot of features. have used several times and enjoying it to date.. waiting for spring vacation to really try out camera.", "Date": "March 4, 2014"}, {"Title": "Not happy with the quality of the photos taken", "Author": "Sandra Peeler", "ReviewID": "R10NMK8Z5EGNBD", "Overall": "1.0", "Content": "I have been a fan of Olympus cameras since I purchased an Olympus C-3000 Zoom in 2001.  But my old camera's photos remain sharper and crisper than the Stylus SH-50.  I returned the camera.  I was highly disappointed with the quality of photos from this camera.  I stick with my old Olympus camera and keep searching.", "Date": "September 15, 2013"}, {"Title": "Quality photos", "Author": "William Beegle", "ReviewID": "R1V0JFD2MXW0SH", "Overall": "4.0", "Content": "Clear pictures and somewhat easy to use. Instruction info on disc therefore need to use computer. Still having trouble understanding how to use some of the features.", "Date": "January 1, 2014"}, {"Title": "Product  bundling", "Author": "Mark  H.  Pierson", "ReviewID": "R27C82QOLV8TML", "Overall": "4.0", "Content": "The  Camera  is  very good  .  I  believe  the  owner/operator manual in  hard  copy  should  be  includedrather  than  a  special  order  add  on  .", "Date": "December 16, 2013"}, {"Title": "Great camera at a great price", "Author": "Rachel", "ReviewID": "RGOC3GHTB79SC", "Overall": "5.0", "Content": "10 times better than my previous digital camera. I love the quick shutter speed and the clear pictures. I is Very easy to use and has a lot of neat features.", "Date": "December 5, 2013"}, {"Title": "Great Pictures", "Author": "Carl Armstrong", "ReviewID": "R1T3EXQ7FSAYH6", "Overall": "5.0", "Content": "The pictures with this camera are great.  Especially in low light.  This is SO MUCH better than my last camera.  The flash is really not needed.  I also love that it can take high res pictures while filming a movie.", "Date": "April 5, 2014"}, {"Title": "Only 1 use, but terrific", "Author": "Duane Sparks \"Duane\"", "ReviewID": "R20AMN3MOD3VFW", "Overall": "5.0", "Content": "I've only had this long enough to use it once and maybe my rating will change later.  If so, I will update.  I took about 45 photos with it on a trip to Chicago's museums and it gave me brilliant photos in all sorts of different lighting conditions.  Whether in wide angle or telephoto, the pics were clear and picked up all the details of the exhibits.There may be tests the camera fails, but this was a fairly severe test considering what and where we were photographing.", "Date": "August 20, 2013"}, {"Title": "Nice", "Author": "Erica", "ReviewID": "R1GN1LSOPYB3UL", "Overall": "4.0", "Content": "The camera has lots of features which is a pro and a con.  It would be nice if there was an eyehole to look through when taking a photo versus just having a screen to look at.", "Date": "January 3, 2014"}, {"Title": "So so camera", "Author": "Soundtracklover", "ReviewID": "RT91ZWZWZ6I1J", "Overall": "3.0", "Content": "Like its Overall fit, quality  design and easy to use . I didnt like its image quality. For a 16 mp latest camera  I expected more sharp pictures. I have an also Panasonic fz150, maybe because of it didnt like this much.", "Date": "February 2, 2014"}, {"Title": "rating olympus stylus camera", "Author": "Jo Anne", "ReviewID": "R3KI7RFQ4Y6G1N", "Overall": "3.0", "Content": "Seemed like a nice camera, a little to heavy for me.  Had to return.  Although I liked the  24x zoom feature.", "Date": "February 3, 2014"}, {"Title": "Do not purchase!!!", "Author": "L G Beauvais", "ReviewID": "R7I2TO1OKJQSI", "Overall": "1.0", "Content": "Plus: great quality pics when takenMinus: visual display very difficult to view outdoors, worst set of instructions for any device", "Date": "April 14, 2014"}, {"Title": "Missing essential information.", "Author": "peter Martin", "ReviewID": "R38S41PMTUFF0E", "Overall": "3.0", "Content": "I suspect this camera will more than meet my expectations. However as I worked through the setup instructions they told me to insert the memory card. There was no memory card! After calling both Amazon and Olympus I found out that it is not part of the package and that any of the card options mentioned in the instructions can be used. However this requires either a second order from Amazon or a trip to a local camera supplier. Amazon should make this clear in their advertising so that a complete working package is purchased in a single order.", "Date": "August 20, 2013"}, {"Title": "Olympus Stylus SH-50 iHS Digital Camera with 24x Optical Zoom and 3-Inch", "Author": "Lula Reeves", "ReviewID": "R2XXWSQOLHKP94", "Overall": "1.0", "Content": "There's a lot I have to learn about it but I think it's going to meet my need. Thank you!", "Date": "January 25, 2014"}], "ProductInfo": {"Price": null, "Features": "Outstanding image quality, 24X wide-angle zoom, 3-Axis image stabilization\nWorlds first 5-Axis video stabilization in a compact camera, 1080P full HD video\nManual mode, touch screen and live guide, tele-macro", "Name": "Olympus Stylus SH-50 iHS Digital Camera with 24x Optical Zoom and 3-Inch LCD (Black)", "ImgURL": "http://ecx.images-amazon.com/images/I/41GYwJA%2Br2L._SY300_.jpg", "ProductID": "B00AQ2BV0U"}}