{"Reviews": [{"Title": "Easy", "Author": "Christopher Leighton", "ReviewID": "R926NVJOJC8QA", "Overall": "5.0", "Content": "This camera is easy to opperate and capture outstanding shots. Bought it for a resent trip to the Antartic and the results are better than they should be knowing my expertise. Used it in all conditions from bright sunshine or pouring rain, never missed a beat.", "Date": "April 5, 2013"}, {"Title": "Excellent hand-held carry anywhere camera", "Author": "William M. Connolly \"William M. Connolly\"", "ReviewID": "R3SB29N42JY6VT", "Overall": "5.0", "Content": "I prefer the mechanical operations, not the touchscreen, plus touchscreen screen gets greasy, oily too quick. Camera exceeded my expectations: wonderful sharp realistic colors, colorful (not over or under saturated) pictures. Although the minimum ISO is 200, it's O.K. because even though I've shot film as low as 25 ISO, I preferred shooting everything at 400 ISO, so 200 ISO with a good fast 2.8 is really great. Sony and sigma lenses work great on it!", "Date": "April 3, 2013"}, {"Title": "Whats included with the 6ave Sony NEX-F3", "Author": "Raven \"Raven\"", "ReviewID": "R201L26HSLRRQB", "Overall": "5.0", "Content": "I received an open box Sony Nex-F3 from 6ave on 1/16/14.6ave describes it as \"Camera Body Only (Black) New in Open Box\".Except for the 18 to 55mm lens and body cap, everything listed in the F3 manual was in the box.This includes a strap, USB micro cable, AC adapter to charge the battery in the camera, manuals, software disc and paperwork.The Sony F3 box shows signs of wear.The menus were set to English.I checked the number of shutter activations using: http://tools.science.si/index.php. There were 17.Sony lists the F3 in silver without a lens for $319 so thank you 6th Ave for a very good deal.", "Date": "January 18, 2014"}], "ProductInfo": {"Price": "$199.99", "Features": "16.1Mp Exmor APS HD CMOS Sensor\nFull 1080/60i/24p HD Video Capture\nTilting 3.0\" LCD Display\nUp to 5.5 FPS Continuous Shooting\nOptical SteadyShot Image Stabilization", "Name": "Sony NEX-F3/B NEXF3 NEX-F3 16.1 MP Compact System Camera Body Only (Black) New in Open Box", "ImgURL": "http://ecx.images-amazon.com/images/I/417hzJ4eA2L._SX300_.jpg", "ProductID": "B00AYGLO4G"}}