{"Reviews": [{"Title": "Perfect in every way!", "Author": "Steve Jensen", "ReviewID": "R2R3LPQRCU61K3", "Overall": "5.0", "Content": "I took a bit of a chance buying this unlocked device.  I didn't know for sure if it would work on the AT&T; network and I can confirm that it does. One of the first things I did was remove the SIM card from my phone and place it into the camera.  The camera booted right up and connected to the cellular network.  I was able to send, receive texts and well as upload images to DropBox.  That said, I will probably be using my wireless hotspot with this camera the majority of the time, but for those wondering whether it will connect to the AT&T; network, I can confirm that it indeed will.The stock rom is version 4.1.1 of Jellybean.  This version will not support the remote viewfinder which is a great feature.  It allows you to use your phone as the viewfinder, zoom in and out and actually snap the picture.  You then have the option of saving the image to the camera only, the phone only or both devices.  I sought out the upgrade file for 4.1.2 which is the version of Jellybean that supports this feature.  First I checked for updates from \"Settings\"... nope, latest version is installed.  Next, I downloaded Samsung Kies, plugged in the camera and there was no update available.  Finally, I sought out the update file and found it on Hotfiles herehttp://hotfile.com/dl/210290153/91452aa/GC100ZSBMC1_GC100OZSBMBC1_TGY.zip.htmlBe patient, it is a huge file and the bandwidth is throttled unless you are a premium member. The upgrade file is flashed to the camera via Odin.  For those who would like to undertake this upgrade on their own, here is a link to a page that gives step by step instructions on how it's all done.http://www.ugrades.com/2013/05/update-samsung-galaxy-camera-gc110-to.html#chitika_close_buttonI followed the steps and successfully flashed my phone to the latest 4.1.2 update.  I can confirm that the remote viewfinder does indeed work using the 4.1.2 update and a Galaxy 3s phone.  It's so cool it just tickles me to death.For anyone on the fence, I would say go for it.  This is a great camera, unlocked and ready to go.  I have had loads of fun with it just in the past few days I've owned it.  If you have any questions about upgrading the phone, please feel free to leave a comment and I'll do my best to help out.", "Date": "August 13, 2013"}, {"Title": "I love this camera!!!", "Author": "Lee P.", "ReviewID": "R2WVCPLH7A79A", "Overall": "5.0", "Content": "There isn't much I do not like about this camera!  It does everything they advertise well.  I can't get over how smart this camera is!!!  I love to play with it and the pictures are  sharp and professional looking...good enough for what I need.I wish I could get all my loved ones one...but because its a bit pricy that's not possible. I can say, it's every bit worth the price!  I'm finding you can't go wrong with Samsung. All there products are amazing!", "Date": "April 12, 2013"}, {"Title": "galaxy cam is a game changer....but needs some work.", "Author": "A2Z Inspections & Thermal Imaging", "ReviewID": "R7DOLTOUH0IGY", "Overall": "5.0", "Content": "Love the Galaxy Cam, though it's zoom is very touchy... seems to go from 9.0 to 17 to full 21 zoom no matter how gently you try to fine tune the image. battery life is decent roughly 4 hours of life on power saver mode while running software .... twice as good as any laptop I've used in the field.Glare is killing me when outdoors, cant read the screen at all - worse than other cheaper digital cameras. none of the glare reducing BS scratch guards seem to help.", "Date": "August 13, 2013"}, {"Title": "Genial", "Author": "Gil Gonzalez", "ReviewID": "R1CQYL9YGNBXJM", "Overall": "5.0", "Content": "Huy pues que decir es una camara realmente senzacional, por donde la veas, toma unas fotos geniales tiene muchas opciones las cuales no las tienes en una camara de un celular y como esta no hay dos.", "Date": "February 13, 2013"}], "ProductInfo": {"Price": "$699.00", "Features": "3G: HSDPA 850 / 900 / 1900 / 2100\nDisplay: 720 x 1280 pixels, 4.8 inches (~306 ppi pixel density) Corning Gorilla Glass 2\nCamera: 16.3 MP, 4608×3456 pixels, autofocus, 21x optical zoom, pop-up Xenon flash, AF light, Video: Yes, 1080p@30fps, 768x512@120fps\nOS: Android OS, v4.1 (Jelly Bean)\nCPU: Quad-core 1.4 GHz Cortex-A9 GPU: Mali-400MP", "Name": "Samsung Galaxy Camera Ek-gc100 8gb Black, Android Os, V4.1 (Jelly Bean) 3g Unlocked Hsdpa 850 / 900 / 1900 / 2100 By Samsung", "ImgURL": "http://ecx.images-amazon.com/images/I/41x%2Bd-wGtnL._SX300_.jpg", "ProductID": "B00AMPOIYM"}}