{"Reviews": [{"Title": "Great idea, but...", "Author": "Don Peach", "ReviewID": "RMME1K9L90RN9", "Overall": "3.0", "Content": "I'm still fooling around with this and still not getting images worth much. The shutter speed is too slow most of the time. Blurred shots are common. I love the idea behind it but it needs much improving. Costs too much for the  images you're getting.", "Date": "February 26, 2014"}, {"Title": "Another Direction for Photography", "Author": "Whinge", "ReviewID": "R179Z22EKKOD1M", "Overall": "4.0", "Content": "Once switched on and left to its own devices its cheerful screen and quiet sounds go dark and it automatically begins taking what in earlier days were called 'snapshots' meaning uncomposed, often poorly lit, and mostly random pictures of those people and things around you. They're sometimes blurry with questionable exposure and an overabundance of everyone's most unfortunate camera angles - you'll save about 10% of them. They'll never make National Geographic and frankly, they're pictures you'd never take yourself but that is the point entirely. With uncanny ability, Autographer chronicles life's most unphotographed and intimate moments with a detached but personal perspective that is at times both unnerving and humbling. Reviewing the previous day's bustle often results in a surprisingly nuanced look at what you've missed the past 24 hours.", "Date": "April 7, 2014"}, {"Title": "Warmth and spontaneity - the most natural photos of my grandparents", "Author": "Warmth and spontaneity", "ReviewID": "R2OHIWMDO6C45Z", "Overall": "5.0", "Content": "I was lent one of these cameras for the weekend and I wore it to visit my 94 year old grandma and 85 year old grandfather. I spent the day with them with the camera clipped to my jumper. I was so impressed with the results I bought one immediately. The images taken during the day were the most beautiful, natural and warm images I have ever seen of my grandparents going about their day with visitors. The camera is completely unobtrusive and the wide angle lens captured both the context of their lives as well as some amazing portraits. Some of the compositions were so creative and accidental yet perfectly captured the feeling of the day by the details  - for example a shot of my grandma's hands collecting tea cups or of my grandparents helping each other with their coats. The price of the camera was justified by this day of photos alone. I've since made the day into a stop motion video using the images and have a lovely record of that time spent with them.Since then I have worn the camera on dates, at friends' birthdays, on bike rides and walks around my home city of London and every time i am left with a lovely, creative record of the event and some unexpectedly beautiful photos. Give it a try, you won't regret it.", "Date": "June 4, 2014"}, {"Title": "A cool new modern take on photographer!", "Author": "Adnan Hemani", "ReviewID": "R30I1QJIP2EE6N", "Overall": "4.0", "Content": "First wore this on a bike ride to a village fete. Just clipped it on and didn't think about it for the rest of the day. Got some really cool pics  at the fete without doing anything.  Plus had pics from my bike to create a cool motion gif of the journey. The autographer has a gps built in so you can see the route you have taken.  Be great for holidays, you know exactly where the pictures were taken.  Perfect for social occasions too, get some really great candid shots and importantly you are still part of whatever is going on as you don't have to step back and exclude yourself from what is happening just to pick a normal camera to get a shot. Makes your photo memoirs far more real and relevant. Very cool, very modern.", "Date": "May 21, 2014"}, {"Title": "Can't wait for festival season", "Author": "Julian Belvedere-Campbell", "ReviewID": "R2DTM64ZMWCJA3", "Overall": "4.0", "Content": "The English weather has prevented me giving it a proper test so far - hoping to get out and give it a go in the great British countryside if the rain ever stops. So far I've mostly used it for recording days out with friends or clipping on for walks across London. I also go to a lot of gigs and wish I could record the madness with my autographer. Its been hard to do it so far - most of them are at night and obviously in the UK winter it’s dark anyway so the camera hasn’t been able to capture much, but hoping for better results in summer, esp with festival season coming up.", "Date": "May 19, 2014"}, {"Title": "My new wearable camera!", "Author": "Joel Byron", "ReviewID": "RJYG178RUAHV", "Overall": "4.0", "Content": "I’ve really enjoyed getting to know my Autographer. I found when I first wore it, I kept trying to frame photos, e.g. deliberately turning a certain way to try to capture things, but soon got used to the Autographer way of life and forgot about it. Initially the sheer number of images was overwhelming but I’m now familiar with the software to help manage it all. I took it on holiday recently and now have an amazing pictorial record of an unforgettable trip!", "Date": "May 16, 2014"}], "ProductInfo": {"Price": "$399.00", "Features": "Autographer is the world's first intelligent, wearable camera.\nSpontaneous and hands-free photography\n136º field of view\nFree Autographer Share cloud service\n5 on board smart sensors + GPS\n(ambient light / accelerometer / magnetometer / PIR / temperature)\nBluetooth\nGlass hybrid wide angle precision optics\nFixed focus\n5MPx low light sensor\nDedicated smartphone app\nMeasures approximately 3.7cm(W) x 9cm(H) x 2.3cm(D)\nWeighs just 58g", "Name": "Autographer Wearable Camera - Classic Black", "ImgURL": "http://ecx.images-amazon.com/images/I/31qiyN2rULL._SX300_.jpg", "ProductID": "B00AMYNREU"}}