{"Reviews": [{"Title": "First DSLR", "Author": "Mike D", "ReviewID": "R3V0BCK5707UJV", "Overall": "4.0", "Content": "This is my first DSLR so it is a bit overwhelming.  I got this on a recommendation from a friend who is a hobbyist and has been taking photos for a while. I used the camera around the house for some pics with some settings and some pics at a friends wedding.  The quality is miles beyond the old point and shoot.  I'm looking forward to learning how to better use it.", "Date": "November 15, 2013"}, {"Title": "Very good camera", "Author": "Katarzyna", "ReviewID": "R22XAMSTJNJIP5", "Overall": "4.0", "Content": "The camera is very good. I bought it actually for the 55-135mm lens. It was cheaper to buy the set than the lens separately. The accessories though are not the best quality. The tripod is not stabile enough for this camera and the bag is rather pood quality. Still it is a good set for the price.", "Date": "January 23, 2014"}, {"Title": "Canon EOS Rebel T3i Digital Camera + Canon 18-135mm IS Lens kit", "Author": "Superfarmer \"superfarmer\"", "ReviewID": "R2HO3EWN0VZG9H", "Overall": "5.0", "Content": "I have owned the T3i for a couple years and for what I use it for: vacations, family pictures and outdoor pictures it does a fine job for an entry level camera.  This one was purchased for a gift.  I would recommend it for outstanding pictures for the DSL beginner and more.  Fast shipping.", "Date": "January 20, 2014"}], "ProductInfo": {"Price": "$799.00", "Features": "Includes EOS Rebel T3i digital SLR camera and EF-S 18-135mm f/3.5-5.6 IS Type II Lens\n3.0-inch Vari-Angle Clear View LCD; Built-in flash; Full HD movie mode at 1920 x 1080 resolution\nDIGIC 4 Image Processor; Scene Intelligent Auto mode and Picture Style Auto incorporate EOS Scene Detection System\nUSB 2.0 terminal; Video out terminal: NTSC/PAL selectable; SD/SDHC/SDXC memory card slot (32GB card included)\n18.0 megapixel CMOS sensor; Eye-level SLR viewfinder; Compatible with full line of Canon EF and EF-S lenses", "Name": "Canon EOS Rebel T3i Digital Camera + Canon 18-135mm IS Lens +32GB Tripod Kit -- Includes: + Large Vidpro Camera and Lens Case (Black) + Zeikos ZE-TR26A 50-inch Camera Tripod + Zeikos LP-E8 Spare Battery + Transcend 32 GB Class 10 Memory Card + Card Reader + Memory Card Wallet + Micro Fiber Cloth + 3-piece Filter Kit (UV Protector, Circular Polarizer, and FLD) + Shutter Release + Digital Camera Cleaning Kit", "ImgURL": "http://ecx.images-amazon.com/images/I/51nL8qpCWaL._SX300_.jpg", "ProductID": "B00AFKLTQ4"}}