{"Reviews": [], "ProductInfo": {"Price": "Unavailable", "Features": "Fujifilm FinePix JX500 Highlights - Fujinon 5x Zoom Lens A high- quality Fujinon 5x zoom lens delivers picture-perfect results across the entire zoom range, from wide-angle compositions to dramatic close-up shots.High Sensitivity ISO3200\nDigital Image Stabilization - Automatically detects blurred subjects and instantaneously increases shutter speed to ensure crisp, sharp images.\nHDTV-compatible Photos & Video -Able to capture both photos and movies in high-definition 16:9 format, the FinePix JX580 / JX500 lets you discover the impact of full-screen HDTV image display. Capture high resolution images in 16:9 format (1280 x 720 pixels).\n6 Scene SR AUTO - Framed scenes are automatically detected and selected into appropriate camera settings: Portrait, Landscape, Night, Macro, Night Portrait, and Backlit Portrait. Don't wait until you get home to start choosing which pictures to upload to FACEBOOK. Start the process in camera by tagging the pictures you want to share. The next time you connect to your home computer your images will upload automatically. The same goes for movie clips too, which can also be uploaded to YouTubeTM.\nThe JX500 camera features a 2.7\" LCD screen that's been redesigned to be seen easier in sunlight when users are composing pictures or reviewing their shots. It also comes equipped with a 5x Fujinon optical zoom lens (26-130mm equivalent to a 35mm camera) with a powerful 14MP sensor designed to capture scenes packed with detail. Smile & Shoot and Blink Detection ensure that users never miss a memorable moment and as this camera has been re-engineered to lock focus on subjects in a shorter time than previous models, users are virtually guaranteed never to miss a shot that matters.", "Name": "FUJIFILM Finepix JX500 (Black) 14MP Digital Camera w/ 5x Optical Zoom Lens, 2.7\" LCD Display, HD Video, with Bonus 4GB SD Card and Case / 100 Bonus Prints", "ImgURL": "http://ecx.images-amazon.com/images/I/51ThJ0Wjj3L._SY300_.jpg", "ProductID": "B00AW5HQBY"}}