{"Reviews": [{"Title": "Solid performance, good value, Nikon nails it again!", "Author": "Yano", "ReviewID": "R14LV8W093RJSM", "Overall": "4.0", "Content": "This camera may be the best APS-C in its class so far. After Nikon's quality control issue with the full-frame D600 (sensor oil spot problem), Nikon may be able to win back its trust with this new release, again aimed at enthusiasts and amateur photographers. Being an amateur photographer for years and have invested quite a sum in Sony, Canon and Nikon bodies and lenses, I myself settled with Nikon in personal preference. I would say all three brands got its personality (good and bad), especially with Sony pushing the translucent mirror technology.The D5200 is a step up from the D3200 as an entry to mid-level body. Very solid performance and thank god it does not suffer the fate of the D600. The D5200 produces extremely good quality images just like the D3200. Both the D3200 and D5200 share the 24MP sensor resolution, with the difference being the light sensitivity in high ISO situations. Both cameras are able to produce extremely well results in terms of photo quality. I am usually able to get better image results from the D3200 and D5200 compared with Sony's A65 and A77 in actual use. Sony somehow made the older A55 easier than the A65 and A77 at getting a clean and noise free shot (maybe due to sensor difference). So Nikon wins here, I would say the image quality of the D5200 is as good as the well acclaimed Canon 60D in most cases easily done (with the D5200 at a higher resolution). So the major difference of the D5200 compared with the D3200 is the focus sensor and exposure meter sensor. The D5200 borrows the technology from the bulkier D7000 and presents 39 AF points including 9 cross-type AF points for accuracy and a more precise exposure metering system (D3200 have 11 AF points, 1 cross-type). This is extremely useful in specific situations, such as shooting moving objects or in macro photography. The D3200 performed very well in everyday shooting, but with my 40mm and 60mm Nikon Micro lenses, the AF failed to accurately or effectively focus on very close subjects. The D5200 however is much better, the body focused efficiently on to desired subjects precisely. The focus speed is still mainly dependent on the lens.The swing-out LCD screen is useful in some situations and video shooting, but proves less useful to me. And keep in mind when using live-view, the camera no longer uses the phase-detection AF sensors, but rather switches to use contrast AF, which utilizes your APS-C image sensor and the CPU (less accurate and slower AF in most cases).The D5200 is not designed to be weatherproof, but it will survive a short time of mist and a few droplets. Anything more may just end up killing the camera. The battery life is very good for photos, will last you 1000+ shots on a single charge in most cases while not using live-view. However when you need it for a video project, consider carrying a few extra batteries with you or resort to an external power source.If you are starting out in Nikon or just DSLR in general, buy the 18-55mm Kit, and add on the 55-200mm VR lens (you get $100 discount bundled). The Nikon 55-200mm DX VR is a VERY GOOD lens, you do not want to get it later since you may be paying the full price for a new one. The VR (Nikon's optical vibration reduction) of the 55-200mm will allow you to capture subjects/people at a good wanted distance with extremely well image quality and brilliant background defocus, opens many doors for quality and creativity. The Nikon 55-200mm DX VR is one of the best lenses I have used and also at a very affordable price.The other kit lens offering of the D5200 is the 18-105mm kit. The 18-105mm is not very good and I'm not going to get too much into the details; it generally is not very good in terms of construction for a heavier lens and causes more barrel distortion.For me, how the function buttons are positioned on the D5200 is a little awkward, but for others it may just be a matter of time to get used to. Compared with the D5100, the D5200 is quite a big step-up in terms of crucial internal hardware.", "Date": "January 20, 2013"}, {"Title": "Nice step up from the D5100, Big Plus Articulating Screen!", "Author": "Adam Petrone \"Adam\"", "ReviewID": "R2AHN35SKV5UAX", "Overall": "5.0", "Content": "I upgrade every 2 years or so and was close to buying the D7000 when this was announced.  I owned the D5100 since it's release and have been very happy with it, but being a gadget guy I'm always looking to upgrade. As far as I was concerned the D7000 was buying old technology. I love the D5200's interface as it's much easier to navigate than the D5100 and the auto focus is much quicker and precise. The photo's are sharp and very accurate in color. I'm very happy with the D5200. Just for the 39-point AF system for smarter focusing and tracking of moving subjects (compared to the 11-point module on the D5100), a 2,016-pixel RGB metering sensor (whereas the D5100 judged exposure based on just 420 pixels),the new Expeed 3 processor that permits up to five shots per second (versus the older camera's 4 fps)and the new easier to navigate interface makes it worth the price. Let me just add 1 more very big plus, the articulating screen, no other Nikon has it and it is a big plus. I've used it for shots over others heads and other creative angles that I could never get with a fixed screen.", "Date": "February 13, 2013"}, {"Title": "ROCK SOLID PERFORMANCE! More Bang For Buck Than The Canon 6D.", "Author": "Faymus Media", "ReviewID": "R2F2NYTG7I4CR0", "Overall": "5.0", "Content": "<!--\n\nfunction fp_resizePlayerSpace(nsPrefix,w,h)\n{\t\n  try {\t\n    var ifrm = parent.document.getElementById(nsPrefix + \"movieFrameID\");\n    if (ifrm) {\t\n        var h2 = h + 35;\n        ifrm.style.height = h2;\n      }\n    } catch(err) {\n \n    } \n\n\n  if (h > 0) {\n      document.getElementById(nsPrefix + \"clipDiv\").style.height=h+\"px\";\n      document.getElementById(nsPrefix + \"videoPlaceholder\").style.height=h+\"px\";\n  }\n  else {\n      document.getElementById(nsPrefix + \"clipDiv\").style.height=\"\";\n      document.getElementById(nsPrefix + \"videoPlaceholder\").style.height=\"\";\n  }\n  document.getElementById(nsPrefix + \"flashcontent\").style.height=\"100%\";\n}\n\nfunction fp_rewriteDiv(nsPrefix,divName,html)\n{\t\n    document.getElementById(nsPrefix + divName).innerHTML=html;\n}\n\nfunction embeddingPopup(nsPrefix)\n{\n  alert(\"placeholder function for embedding code\");\n}\n-->\n\n\n<!--\n\nfunction cv_mo6GIYVK45SYQ5embeddingPopup(){\t\nalert(\"Embedding code will be displayed here.\");\n}\n\n-->\n\n\n\n\n\n\n\n\n\n<!--\nfunction cv_mo6GIYVK45SYQ5refresh_preplay() {\n\ndocument.getElementById(\"cv_mo6GIYVK45SYQ5chiDiv\").innerHTML = document.getElementById(\"cv_mo6GIYVK45SYQ5hiddenPre\").innerHTML;\n};\ncv_mo6GIYVK45SYQ5refresh_preplay();\n\n-->\n\n\n\n\n\n\n        // <![CDATA[\n\nvar cv_mo6GIYVK45SYQ5so;\t   \n\n\nfunction cv_mo6GIYVK45SYQ5loadSwf_Core(swfLocation, swfWidth, swfHeight, flashVersion, bgColor, swfParams, flashParams, embedAttributes) {\n\n  try {\n      cv_mo6GIYVK45SYQ5so = new SWFObject(swfLocation, \"cv_mo6GIYVK45SYQ5AMPlayerProd\", swfWidth, swfHeight, flashVersion, bgColor);\t   \n\n      for (var v in swfParams) {\n        cv_mo6GIYVK45SYQ5so.addVariable(v, encodeURIComponent(swfParams[v]));\n      }\n      for (var v in flashParams) {\n        cv_mo6GIYVK45SYQ5so.addParam(v, flashParams[v]);\n      }\n      for (var v in embedAttributes) {\n        cv_mo6GIYVK45SYQ5so.setAttribute(v, embedAttributes[v]);\n      }\n\n      cv_mo6GIYVK45SYQ5so.addVariable(\"swfEmbedTime\", new Date().getTime());\n\n      var agt = navigator.userAgent;\n       \n      var reFirefox = new RegExp(\"firefox/\", \"i\");\n      var regx = agt.split(reFirefox);\n      var ffVersion = 8;\n      if (regx[1]) {\n          var pts = regx[1].split(/[.]/);\n          ffVersion = parseFloat(pts[0] + \".\" + pts[1]);\n      }\n      var minorVersion = parseFloat(navigator.ap);\n      if ((navigator.appVersion.indexOf(\"Mac\")!=-1) || (ffVersion < 1.5)) {\n          cv_mo6GIYVK45SYQ5so.setAttribute(\"height\", swfHeight);\n          cv_mo6GIYVK45SYQ5so.setAttribute(\"width\", swfWidth);\n          cv_mo6GIYVK45SYQ5so.addVariable(\"oldFirefox\", \"1\");\t     \n      }\n\n      if (cv_mo6GIYVK45SYQ5so.write(\"cv_mo6GIYVK45SYQ5flashcontent\")) {\n          fp_resizePlayerSpace('cv_mo6GIYVK45SYQ5', \n                               320, \n                               283);\n      }\n      else {\n          var nsPrefix = 'cv_mo6GIYVK45SYQ5';\n\n          fp_resizePlayerSpace(nsPrefix, 0, 0);\n          fp_rewriteDiv(nsPrefix, \"flashcontent\", '<br/>To view this video download <a target=\"_blank\" href=\"http://www.macromedia.com/go/getflashplayer\" target=\"_top\">Flash Player</a> (version 9.0.115 or higher)');\n      }\n  } catch(err) {\n      fp_resizePlayerSpace('cv_mo6GIYVK45SYQ5', 0, 0);\n  }\n  return false;\n}\n\n\n\nfunction _cv_mo6GIYVK45SYQ5loadSwf(movieID, playerVersion) {\n    var swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/20120510035744301/AMPlayer._V148501545_.swf\";\n    var swfWidth = \"320\";\n    var swfHeight = \"100%\";\n    var flashVersion = \"9.0.115\";\n    var bgColor = \"#FFFFFF\";\n\n    var swfParams = {};\n    var flashParams = {};\n    var embedAttributes = {};\n    swfParams.amazonPort = \"80\";\n    swfParams.allowFullScreen = \"true\";\n    swfParams.telemetrySubPageType = \"VideoReview\";\n    swfParams.nsPrefix = \"cv_mo6GIYVK45SYQ5\";\n    swfParams.locale = \"en_US\";\n    swfParams.logUrl = \"gp/mpd/l\";\n    swfParams.canResize = \"1\";\n    swfParams.autoPlay = \"1\";\n    swfParams.sessionId = \"000-0000000-0000000\";\n    swfParams.marketplaceID = \"ATVPDKIKX0DER\";\n    swfParams.salign = \"LT\";\n    swfParams.preset = \"detail\";\n    swfParams.mediaObjectId = \"m1Z7EPVFKTXBBL\";\n    swfParams.autoPlayTimer = \"\";\n    swfParams.mediaObjectIDList = \"m1Z7EPVFKTXBBL\";\n    swfParams.playIsUserGenerated = \"1\";\n    swfParams.enableShare = \"0\";\n    swfParams.permUrl = \"gp/mpd/permalink\";\n    swfParams.telemetryPageTypeID = \"R2F2NYTG7I4CR0\";\n    swfParams.xmlUrl = \"http://www.amazon.com/gp/mpd/getplaylist-v2/m1Z7EPVFKTXBBL/000-0000000-0000000\";\n    swfParams.amazonServer = \"www.amazon.com\";\n    swfParams.scale = \"noscale\";\n    flashParams.allowFullScreen = \"true\";\n    flashParams.salign = \"LT\";\n    flashParams.bgcolor = \"#FFFFFF\";\n    flashParams.allowScriptAccess = \"always\";\n    flashParams.quality = \"high\";\n    flashParams.wmode = \"transparent\";\n    embedAttributes.title = \"Flash Player\";\n\n    if (movieID){\n      if (playerVersion == '3'){\n        swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/20120510035744301/AMPlayer._V148501545_.swf\";\n        swfParams.mediaObjectIDList = movieID;\n      } else {\n        swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/legacy/20101014901/AMPlayerProd._V197491872_.swf\";\n      }\n      swfParams.xmlUrl = \"http://www.amazon.com/gp/mpd/getplaylist-v2/\" + movieID + \"/000-0000000-0000000\";\n      flashParams.wmode = \"transparent\";\n      swfParams.autoPlay = \"1\";\n    }\n\n    if (document.getElementById('cv_mo6GIYVK45SYQ5duration')) {\n      document.getElementById('cv_mo6GIYVK45SYQ5duration').style.display='none';\n    }\n    cv_mo6GIYVK45SYQ5loadSwf_Core(swfLocation, swfWidth, swfHeight, flashVersion, bgColor, swfParams, flashParams, embedAttributes);\n\n  return false;\n}\n\nfunction cv_mo6GIYVK45SYQ5loadSwf(movieID, playerVersion) {\n   return _cv_mo6GIYVK45SYQ5loadSwf(movieID, playerVersion);\n}\n\n\n\t\n\t\t// ]]>\n\t\n\n<!--\n\nfunction cv_mo6GIYVK45SYQ5newHeight(h)\n{\t\n    fp_resizePlayerSpace('cv_mo6GIYVK45SYQ5', 0, h);\n}\n\nfunction cv_mo6GIYVK45SYQ5resetPlayer(w,h,bw,cc) {\n  cv_mo6GIYVK45SYQ5newHeight(h);\n\n  cv_mo6GIYVK45SYQ5so.addVariable(\"resetBandwidth\", bw);\n  cv_mo6GIYVK45SYQ5so.addVariable(\"cacheCode\", cc);\n  cv_mo6GIYVK45SYQ5so.setAttribute(\"height\", h);\n  cv_mo6GIYVK45SYQ5so.setAttribute(\"width\", w);\n  cv_mo6GIYVK45SYQ5so.write(\"cv_mo6GIYVK45SYQ5flashcontent\");\n}\n\n-->\n\n\n\n\n\n\n\n\nvar cv_mo6GIYVK45SYQ5RollOverImg = new Image();\ncv_mo6GIYVK45SYQ5RollOverImg.src = \"http://ecx.images-amazon.com/images/I/81Lqh1%2BKJFS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play-active,BottomLeft,130,-12_CR0,0,0,0_.png\";\n\nvar cv_mo6GIYVK45SYQ5preplay = document.getElementById('cv_mo6GIYVK45SYQ5preplayImageId');\nif (cv_mo6GIYVK45SYQ5preplay) {\n  cv_mo6GIYVK45SYQ5preplay.onmouseover = function() {\n    cv_mo6GIYVK45SYQ5preplay.src = \"http://ecx.images-amazon.com/images/I/81Lqh1%2BKJFS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play-active,BottomLeft,130,-12_CR0,0,0,0_.png\";\n  }\n  cv_mo6GIYVK45SYQ5preplay.onmouseout = function() {\n    cv_mo6GIYVK45SYQ5preplay.src = \"http://ecx.images-amazon.com/images/I/81Lqh1%2BKJFS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play,BottomLeft,130,-12_CR0,0,0,0_.png\";\n  }\n  \n  \n  var node = cv_mo6GIYVK45SYQ5preplay.parentNode;\n\n  var cv_mo6GIYVK45SYQ5currentClick = node.onclick;\n  node.onclick = function () {\n    var head = document.getElementsByTagName(\"head\");\n    if (head[0]) { \n      var logTag = document.createElement('script');\n      logTag.type = \"text/javascript\";\n      logTag.src = \"/gp/customer-media/du/log.html?ie=UTF8&p=CustomerImage&s=CustomerVideoPlay\";\n      head[0].appendChild(logTag);\n    }\n\n    if (cv_mo6GIYVK45SYQ5currentClick) {\n      return cv_mo6GIYVK45SYQ5currentClick();\n    }\n  }\n}\n\n\n\n\n Length:: 4:36 MinsThe D5200 has 24MP. 39 AF points 9 are cross type. While the Canon 6D only has 11 AF points and 1 cross type. The 6D is more than 2 times the cost and has 22MP. The Nikon D5200 has a rotating screen, picture control presets, aperture priority, shutter priority, P, and M modes. The D5200 has +/- 5 stops of exposure compensation, the 6D has 3!The D5200 has a great burst rate of 5fps. ISO range from 100-25,600. Exspeed 3 processing power, face recognition, and full time AF with full HD video. What more could you ask for when buying a camera less than $900? I did a complete hands on review video for \"Focus Camera\" in NYC. I will be posting it to this review sometime later in the week when finished.My thoughts are this camera is light, and while it is not as rugged as a 6D or D600 you get what you pay for. This camera provides great lowlight performance and stunning resolution that is higher than the $3400 5D mark II. Which is worth mentioning. Nikon has leaped ahead of the competition with their new line of cameras.The auto focus on this camera while doing some street and urban photography is very quick and accurate. I had a blast using it as the weight is a very big plus because it can be more easily carried for longer periods of time. If you are in market for a great camera and you are not willing to spend $2k for the D600, there is nothing that will compete with this camera in terms of \"Bang for Buck\" with either of the brands for under $2k.The only 3 things worth complaining about is you can't change aperture in Live View, however you can't do that in the D600 either. It isn't 100% viewfinder, which would be nice. Also the internal microphone is not that great but does have manual control. These 3 issues are not that big of a deal when considering what this camera does so well for its price range.Great camera, amazing capabilities, worth every penny.Video to Come later this week.Corey BenoitFaymus Mediafaymusmedia.comcorey@faymusmedia.com", "Date": "February 12, 2013"}, {"Title": "Finally, A Worthwhile Upgrade to the Nikon D3100 and D5100", "Author": "Ken", "ReviewID": "R33T5MT1Y9RZWG", "Overall": "5.0", "Content": "Nikon has made some awfully good \"Entry Level\" Digital SLR cameras over the years.  The most recent were the D3100 and The D5100.  The main differences between the D3100 & D5100  was the D5100's articulating/brighter LCD and a bracketing feature.  The D5100 is about 10% heavier and costs a bit more than the D3100.  The D3200, the sucessor to the D3100, was released last year.  However the D3200 was arguably a step backward introducing a much higher resolution sensor (24MP) but at the undesirable cost of additional noise at higher ISO settings.The D5200 uses a 24MP sensor like the D3200 (although the sensors seem to be from different sources; the D5200 uses a Toshiba sensor while the D3200 uses a Sony sensor).  This time fortunately, the high ISO performance has actually improved. The D5200 body is almost identical to the D5100 camera body including the articulating, high resolution LCD.  The LCD screen now highlights settings for ISO sensitivity, Aperture size (F Stop setting) & Shutter speed making these settings very visible even at a glance.  The LCD layout is much better (and different) than anything Nikon has previously used.  Nikon does not include an LCD on the top of this camera (or on any of their smaller DSLRs) presumably due to physical surface area constraints.The key improvement is image quality. High ISO performance is actually improved despite the 50% increase in megapixels. ISO 1600 is almost indistinguishable from ISO 200.  ISO 3200 is very usable (but not really too far beyond that). Automatic White Balance for incandescent lighting, is still not great but has improved somewhat since the D5100 (but still not nearly as good as the older D5000); shooting raw is still really necessary to get the white balance right in artificial lighting (TIP: When shooting indoors, try \"Sunny\" instead of AWB). ISO settings can be incrementally increased between stops (ie ISO 2000) to help avoid using a higher than necessary ISO setting..JPGs are a little soft even after making in-camera adjustments; Shooting Raw and using Nikon's very good Image Editing software can enhance the photos quite a bit.  The built in flash is not great; an external speedlight with bounce capabilities is really essential for properly exposed photographs (or alternatively not using a flash at all and shooting at a higher ISO/slower shutter speed).  Like all modern DSLRs, 'live view' (LCD framing) can be used in lieu of the viewfinder.  However if you regularly prefer Live View to an optical viewfinder, probably the SONY offerings or even a compact system camera (ie the Olympus PEN series) is a better choice.The auto focus system on this (and almost every other Nikon SLR) is really, really good.  Unlike the Canon SLRs (including some very expensive ones), the Nikon uses an independent infrared auto focus beam that focuses instantly on any fixed object under all lighting conditions (even total darkness).  Try shooting in total darkness with any other camera series (except the 4th generation Olympus Pen) and the camera will simply refuse to auto-focus.  The Nikon D5200 (and almost all Nikon SLR cameras) focuses under such conditions effortlessly.This camera is expensive when compared to the current prices for the prior generation D5100 or D3100 which are both excellent cameras. Budget minded purchasers may want to give those cameras consideration or else wait for the inevitable price fall of the D5200.", "Date": "June 17, 2013"}, {"Title": "Outstanding for entry-level photographers!", "Author": "Torrell Booker", "ReviewID": "R2UGQE8YCJCQCZ", "Overall": "5.0", "Content": "I'm a beginner photographer and this is my first DSLR purchase.  I had been playing around in full manual mode on a Canon G15 point and shoot before buying this so the transition was relatively easy.  If you're having difficulty understanding what all of the numbers mean, the graphic display does a great job of graphically showing you what you're settings are.  Another great feature for beginners is that if you don't know what a menu option does, you can hit a button and it will describe what the menu option does, differences between the settings, and which situations the settings would be optimal for.You're probably reading this because you've looked at several entry-level DSLRs and are trying to figure out which you should purchase.  I was deciding between this camera and the D3200.  Why did I pick the D5200 over the D3200?Firstly, the D3200 is not capable of doing autobracketed shots, however the D5200 is.  You could manually bracket your shots, but it will take a lot longer and you run the risk of moving the camera or your tripod.  With the D5200, I can take three autobracketed shots in less than one second.  I do a lot of landscape photography so that is very handy!Next, from other reviews I read and watched (feel free to correct me) it sounded like the D5200 had a little better low-light performance.Lastly, I don't plan on purchasing another DSLR for at least a few years.  The D5200 is basic enough that I can learn, but advanced enough so that I can grow.  I wanted a camera that I'd be happy with for a while and this was a perfect buy.  It has all the features I'll need for a while.  I hope this helped.", "Date": "July 10, 2013"}, {"Title": "In between a good point and shoot camera and a professional camera", "Author": "Steve in Bozeman Montana", "ReviewID": "R351VI1XBF2Y80", "Overall": "3.0", "Content": "Updated November 25, 2013Professional camera reviewer Ken Rockwell suggests that the 5200 body for about $800 can do mostly everything the can be done by the D600 $2,000 body so why pay the difference for some extra dials and buttons?  I followed his advice and bought the D5200 and will keep it, but if a good used D600 body were offered for sale for $1,000 I'd gladly swap.  While I realize the camera can do a lot, the lack of easy control buttons and extra modes bugs me. It's a downsizing I know, but to have to hold down one button while activating another ... not intuitive after shooting for years with a larger more expensive D300.  Example:  somewhere along the line I was trying to adjust the aperture in A mode and apparently wound up sending the exposure compensator to +4.5, thus way over exposing my shots beyond any use.  This would not have happened with the additional dials and buttons on the more professional Nikon series. (My dog was happy to fetch another ball for another test.)The camera can indeed take great images.  After resetting the exposure compensator to zero I shot images of my dog running back with a ball.  In Aperture mode with aperture set at f4 the auto exposure system chose a 1/1,600 speed and the auto focus worked well;  the resulting image was very sharp, even for the eyes of the dog and the marks on the tennis ball in his mouth.As another reviewer noted, this camera's auto focus feature works with some, but not all, Nikon auto focus lenses.  For example, it works with my AF-S 70-200 and 18-200 lenses, but not with a 50mm Nikon auto focus AF lens nor with a Tamron auto focus lens that I own. That's understandable and should not be a problem for people buying new lenses.  Just be aware.This might be a good starter camera for someone who thinks he or she might grow into doing more creative photography than normally done with a simple point and shoot camera.The D5200 might also be a relatively inexpensive camera body for someone wanting to do fast moving sports photography; I've not tested the fast tracking feature, but it sounds great and the large number of megapixels should allow wider angle photos.  I.e., rather than zoom in on a galloping horse and perhaps later discover the nose is missing, one could take a wider photo of the horse and background to be sure all of the horse is in the photo and then in editing crop out the unwanted parts and still have a high resolution image of the entire horse.  To me that's a fairly significant advantage.The D5200 seems to me a great technological achievement in a compact plastic size. On the other hand, for about $1,000 for the D5200 and a compatible lens, perhaps most consumers (particularly those who won't be wanting to use various lenses)could do as well with a lower cost, more pocket size camera, while photographers who are used to a larger size camera with controls we can use without looking may find themselves a bit frustrated.It's a matter of fit between the buyer and the camera.  Good luck and have fun._______Nov 25 2013  I just returned from a month long trip on a large sailboat crossing the Atlantic Ocean.  Because weight and size were concerns in traveling, after debating I took only my D5200 with only my Nikon 18-200 VR lens.This worked well!  I used the weight saving to take my older larger laptop with my familiar LR and PS software;  accessing the \"cloud\" was mostly not possible / practical and I was glad I'd made this choice.I found the video mode surprisingly useful.  When I was at the helm of the huge sailboat, the person to whom I passed my D5200 camera could not quickly use it to shoot photos, so I put it in video mode and handed it back to her.  The video mode worked well in full automatic, allowing anyone who can point and shoot to create good memories.  The built in microphone picked up some wind noise, but that's to be expected on the deck of a moving sailboat.With days at sea, I began playing with the video and to push the limits.  I tried videoing flying fish which sometimes skimmed above the waves, which proved too difficult for the camera's autofocusing(at least in my hands).  However that was asking a lot - with the photographer sailing forward while also moving up and down from sideways swells, the background consisting entirely of waves in motion, and airborne fish briefly skimming in a different direction!  In another unfair test, I got acceptable results: Others on the boat had created a slideshow on a laptop using contributed photos and were attempting to record music to match the images.  I essentially had my D5200 look over their shoulders to video the laptop images while also capturing the music being played.  I instead of a tripod I used a bunch of masking tape to tape my camera to a brass rail to keep it stable relative to the subject (both gently rolling sideways at the same rate).  In this interior setting we would want the aperture to remain constant because only the music is changing.  However, the images on the laptop screen varied in brightness and the D5200 dutifully reacted, causing some unnatural changes in the overall result.  My unusual situation made clear why the camera must be in automatic aperture mode when producing video: to keep a relatively stable brightness for later viewers despite changing brightness when recording moving subjects.In another strange situation, which no one else should attempt, I risked ruining the camera by shooting it directly at the sun with no filter protection. I did so during a solar eclipse and only during the few seconds when the entire sun was blocked, with only the corona and solar flares being visible.  My images turned out to be better / more interesting than those taken by some scientists on board.  Luck sometimes triumphs over skill.In summary, the lightweight fairly compact D5200 can perform a variety of tasks.Another person also got surprisingly good images with a $250? point and shoot camera:  a Panasonic with a built in Leica lens which an on-board technical employee of Leica said was a quality lens.", "Date": "August 4, 2013"}, {"Title": "Great little Camera", "Author": "MrHarleyDavidson", "ReviewID": "R1P0SRG6EO5538", "Overall": "5.0", "Content": "As a professional Photographer I have Nikon equipment. This, latest edition, is my carry along camera so that I never am without a good camera capable of making exceptional images. The 24mp DX sensor is exceptional in such a compact camera. I really love the reticulating screen which allows me to compose interesting angles and particularily get low angle views without having to lie on the ground. I also really appreciate the exposure bracketing allowing me to easily create real HDR images.", "Date": "February 18, 2013"}, {"Title": "Migrated from D90 to D5200", "Author": "E. Reilly", "ReviewID": "R1P7GNQ2RBJK9X", "Overall": "5.0", "Content": "I have owned a Nikon D90 for about 4-5 years - love the D90 - but just recently the jack for the remote control port (i.e. GPS port) became wonky.  So instead of shelling out $200/300 to get it fixed - I figured I would put that cash toward a new Nikon body.  I chose the D5200 for many reasons - but I also considered buying the more expensive D7100 in part because the physical camera controls/buttons of the D7100 were almost identical to D90.This turns out for me to be of no concern.  Even though the D5200 (1) moves most camera controls to the back LCD panel (i.e. eliminating the tiny LCD display that was atop the D90) and (2) eliminates the forward-most D90 thumbwheel - I find that the camera controls on the D5200 are possibly even easier to use now.Just my two cents for those considering an upgrade from the D90 or D70 etc.", "Date": "May 9, 2013"}, {"Title": "Just love it Great camera !", "Author": "Kenny C", "ReviewID": "R2OZCSIVE7YV2O", "Overall": "5.0", "Content": "I purchased just the body and teamed it up with a Tamron 18 - 270 all in one zoom and it performs as advertised, Excellent ! The pictures are sharp , and you have so many features, AMAZING. I was looking at the canon T4i but after checking both out this was the better quality camera. You won't go wrong. I also bought a DVD on this camera from A pro Michael Andrew on line, its about 4 hours long, and it's excellent for leaning all the in's and out on the camera but also more tips on photography.", "Date": "June 7, 2013"}, {"Title": "Great Camera at a Great Price", "Author": "Douglas Lang", "ReviewID": "R3BA3DQPVNK3ZX", "Overall": "5.0", "Content": "I wanted a lighter DSLR when upgrading from my D90. The D5200 is a great camera. Better video, better digital imaging, nice weight with a flip out screen. Couldn't be happier. I bought the body only and am using all of my lenses. Sweet deal!", "Date": "April 22, 2013"}, {"Title": "How A  Senior Prudent Student Chose Nikon D5200", "Author": "Charles Matthews", "ReviewID": "R1KESSYGQ64IO6", "Overall": "5.0", "Content": "I am a senior citizen and a novice to photography so I enrolled in a Digital Camera class at my local Adult Ed program to learn the basics. Soon I wanted to upgrade from my (excellent but ageing) little Kodak point-and- shoot digital camera.  I began my research by visiting the larger electronic retailers to see the varieties and options available and deciding what kind of photos I might like to capture.  I like stills of family vacations, landscapes, group shots and stop action photos of grandkids but I NEED easy to operate.  I also want low light capability for \"No flash\" venues like museums. Over a six month span I gravitated to Nikon D series.  I asked myself, \"What are the minimal camera features I would need to satisfy my intentions?\" and \"If price is no object which version should I choose?\" I discovered the flexible view screen of D5100 would allow me to shoot from a low angle without hurting my arthritic back and knees. The discounted D3200 kit with two lenses was a tempting option for me but the testimonies of other reviewers stated that they liked their Nikon cameras so much that they later bought the next generation as well--not a prudent and economical strategy for me. Also, the lenses offered in the kits were entry level so I would surely later wish I had upgraded to the better Vibration Resistant lenses available.  My choice has been to purchase a D5200 black body separately instead of a kit with lenses. Then I selected two lenses more to my liking--Nikon 18-170mm VR to use as my \"Do-it-all\" lens and a Wide Angle lens for scenery and group photos.  No doubt I'll grow to want a portrait lens as well someday. Meanwhile, I have the ideal entry level set up for my needs.", "Date": "June 16, 2013"}, {"Title": "Nikon D5200", "Author": "jose", "ReviewID": "RZVIS593FK2T7", "Overall": "5.0", "Content": "It's my first professional camera, was analyzing various brands before choosing, I am very satisfied with the Nikon D5200 camera, brings many advantages over other brands, is a lightweight camera, compact, effective when taking pictures, use friendly the menus, photographic effects are great, I'm amazed I'm exploring the utility for this camera, I am actually very happy and satisfied with this product and this brand of camera respectively dsrl.I recommend it for beginners, intermediates and experts can actually take much advantage to all camera functions so I give it 5 stars, soon will begin to acquire new lenses to expand my horizons in photography.", "Date": "August 24, 2013"}, {"Title": "Nikon D5200", "Author": "kmh2610", "ReviewID": "R19B9ECMRIWBVC", "Overall": "5.0", "Content": "I bought this camera to update my old Nikon D50. The 5200 is definitely an awesome camera with a ton of option's. It has a bit of a learning curve but it is very user friendly. I bought this as a package deal with the memory card back pack and extra battery. You need the memory card if you do not have one you need the bigger size card's like 32 gb because the pictures use a lot of memory this one is the perfect size to get about 500 to 800 pictures depending on your setting's.  If your just starting out this is a good dslr camera but it takes some work to get the most out of any camera . Also takes hd movies. You need to have the right kind of lenses the older ones from my Nikon d50 will only work on manual focus no auto focus. Definitely a great deal for the money .", "Date": "July 27, 2013"}, {"Title": "Great upgrade from D3100!", "Author": "Leonardo Sepúlveda", "ReviewID": "R25NT9G9XE7N1H", "Overall": "5.0", "Content": "I have a D3100 and I decide to buy another Nikon, the D5200. I didn't test the camera so much, I just had one trip and it was so much intense, so I just used the camera on the auto program. On the camera screen, the photos looked like nice, but when I transferred to the computer...WOW, incredible quality for an auto program pictures! You can easy notice the quality improvement from the D3100! The D5200 has also a very fast shoot sequence on RAW extension, you get 5 pictures per second!", "Date": "May 13, 2013"}, {"Title": "Ahhhhh :-)", "Author": "J. Archer \"jarcher\"", "ReviewID": "R3FYFWW7BN8CIX", "Overall": "5.0", "Content": "Amazing camera! I've got a D7000, and needed a camera to help with video. No reason to change over to the 60D, this camera takes great video when you put a good lens on it (I used the Nikkor 35mm f/1.8 lens set to aperture of 2.8, Nikkor 18-200mm f/3.5-5.6, and Sigma 18-50mm f/2.8-4.5). The pictures are great too, the 24.1 MP makes for some great cropping ability. Highly recommended for the articulating screen, great sensor and great video at a reasonable price.", "Date": "June 24, 2013"}, {"Title": "Just what hoped it would be", "Author": "LazyShopper", "ReviewID": "R2V1L39VVY2PY8", "Overall": "5.0", "Content": "I am a rank amateur but having studied the market for lightweight SLRs, this one seems to have it all.  Couple of vacations proved it takes outstanding pictures, esp. when viewed in my Mac Retina display.  Still to explore its myriads of features and video.", "Date": "June 17, 2013"}, {"Title": "A must have for serious hobbyists!", "Author": "redrock73", "ReviewID": "RX636CC7PV5S8", "Overall": "5.0", "Content": "I have owned Nikon cameras for years and have never had a problem with any. I have owned the D5100 for several years and still very happy with it. But when the D5200 was announced, I decided it was time to upgrade.It arrived very fast and was awesome right out of the box. It is much lighter and a little smaller than the D5100. It also is much faster and the picture quality is awesome. I had to try all my prime lenses out and I did not regret my purchase after seeing the results. I could go into a lot of technical aspects but most who read this would be lost. So I will just say that the quality of photos that I took were amazing. The upgraded 39 point AF paired with the new processor took some of the most amazing pics I have seen in what is considered an entry level DSLR. The colors just popped out at you and the images were tack sharp when using prime lenses. I also tried numerous macrel shots and they were amazing.This is a great camera and the only complaint that I have is that I wish nikon would have done it in a touch screen so the more novist photographers would have a little more ease of use. But overall.....This is a must have and you will not regret your purchase.", "Date": "February 17, 2013"}, {"Title": "buy it without thinking", "Author": "sultan alshahrani", "ReviewID": "R2J9YGJ530RVLN", "Overall": "5.0", "Content": "i did a research for a whole month and i found there is no competent for this camera for the price and what you get for example canon t5i has only 17.9 MP and 9 focus point and color depth is 21.7.but for d5200 you will get 39 focus point and you will get 9 cross section focus and also you will get 24 megapixel and 24.2 color depth for this price this is really good deal I would recommend it over d5300 because of the price and there are basically the same, besides that the d5300 have GPS and Wireless and nothing more. try to get it with the Amazon bundle you will save a lot of money.buy it from here to get up to 300$ off and free bag and free SD cardhttp://www.amazon.com/gp/feature.html/ref=br_lf_m_1001386181_pglink_2?ie=UTF8&docId;=1001386181&plgroup;=4&plpage;=2also i would recommend to get the 55-300 lensescheck this site[...]", "Date": "November 1, 2013"}, {"Title": "Magnificent DSLR for the Money.", "Author": "Mihir B \"Mihir3308\"", "ReviewID": "R4646CD52ZAL0", "Overall": "5.0", "Content": "Its a great DSLR for those who want to buy their 1st one or upgrade from the point and shoot.It takes great pictures right out with auto settings.I usually dont use the Auto Settings since i know how manual settings of shutter speed,aperture,focus,iso works.Sensor is great and ranks high even compared with D7100 on certain levels (for more check comparison on DXO Mark).I seriously think the kit lens is damn understated as i have taken some great,crisp,sharp pictures.If want to avoid kit lens 18-55mm go with 35mm 1.8g prime lens best bang for the buck.This is definitely better than Canon T4i or T5i as i was in the same league to go for which one.One of the best purchases i have made in recent time.However if you want to do a lot of videography by your dslr i would suggest for CANON t4i (T5i is the same .. save some money and spend on prime lenses)Nikon Offers best business with photography .. Video is definitely good not saying anything bad..though Canon has a little edge in this department over Nikon.", "Date": "August 8, 2013"}, {"Title": "Great price for a great camera!", "Author": "Tony N.", "ReviewID": "R1MO66GHXLQUF6", "Overall": "5.0", "Content": "This was my first, \"big boy\" camera purchase. Very easy to use and the pictures this cameras produces are simply amazing! The various settings are intuitive, simple and easy to adjust. I believe this is a good camera for beginners and seasoned veterans alike", "Date": "June 22, 2013"}, {"Title": "A good second body, especially if you have AF lenses already", "Author": "Joseph F. Mcconnell \"jfrancismcluggage\"", "ReviewID": "R2OP3KIGX1RJ2I", "Overall": "4.0", "Content": "Upgraded to this from an older D80.  Lens compatibility was an absolute requirement, or I might have gone for something lighter, but it's a solid improvement over the earlier body.  Somewhat lighter too, although I would have preferred even less mass.  The UI is an improvement too, but still Nikon-style -- many buttons, obscurely labeled.  But for better or worse, I'm a Nikon addict  -- have been since the old FMs.", "Date": "December 2, 2013"}, {"Title": "I love this camera!", "Author": "dlv \"Debbie\"", "ReviewID": "RTKULA9AIP20H", "Overall": "5.0", "Content": "I own the D90 and D7000 as well.  All are great cameras but the 24.1 megapixels in this camera - really make it!  I even had an accident with my first D5200 and broke it and reordered a new one immediately.  You can really tell the difference between the shots with the D7000 and the D5200.  The D5200 shots are so much clearer.  I would highly recommend the camera.", "Date": "April 30, 2013"}, {"Title": "Nikon D5200", "Author": "Amazon Customer \"junkyardjames\"", "ReviewID": "RNE75O42QZMG", "Overall": "4.0", "Content": "The camera is a step up from the trusty Canon Powershot A610 that I have had for years. I wanted to step up to a DSLR and after reading reviews I chose the Nikon over the comparable Canon. I have just begun to learn the capabilities of the camera. Even in auto mode the image quality is fine. I shot video of my son's wedding and was impressed with the picture quality although an external microphone would have been useful. Amazon had the right price and the reputation of standing behind the sale that made my choice to purchase from them rather than the many other options available. A $100 rebate on an additional Nikon lens also was a factor.", "Date": "September 6, 2013"}, {"Title": "A lot of camera for the money.", "Author": "R. Cassato \"RJ\"", "ReviewID": "R22HGRZN4G4H45", "Overall": "5.0", "Content": "A letter I wrote to Nikon with some comments on the D5200. I have found three bothersome features on the D52001. When I set the 2 second timer delay, it resets to single shot after every picture. Can Nikon create a firmware update so it stays in 2 second timer until turned off?2. Same condition applies when putting camera in the HDR mode. The camera reverts to normal after every picture taken. Can Nikon create a firmware update so that the camera stays in the HDR mode until manually turned back to normal picture settings.3 I shoot all RAW all the time. I understand because the special effects are processed that they have to be in JPEG. The issue is that when I want to shoot HDR I have to constantly go back to the menu and change to JPEG only. My question is: Can there be a Firmware Update that Can allow HDR be enabled when in RAW mode and then the camera only record JPEG as long as HDR is enabled? In addition can this be applied to all special effects. It is a pain to keep changing from RAW to JPEG every time I want to do a special effect.In the end I am constantly changing the settings of the camera and this takes a lot of time when I am shooting. It would be great to have a firmware update to correct this little flaws.On last item is that I shoot a lot of night shots with this camera. It is really great that the LCD is very bright to see during the day......but at night it is a glaring sun. Again I have to go back to the menu to change the brightness of the LCD. It would be nice if there was an ambient light sensor somewhere to automatically dim the LCD at night and then brighten it up during the day. This may not be a Firmware Fix. Just a note for future models.On the last item I found the menu to turn the \"Info\" off between pictures as not to blind me when shooting at night.So far so good with image quality and I am having good success with pictures so far.In general I am very happy with the camera.  The items that I mentioned above are not deal breakers, just little annoyances.RJ", "Date": "March 9, 2013"}, {"Title": "Great camera", "Author": "James B", "ReviewID": "R2L6Q9F808ZV15", "Overall": "5.0", "Content": "This is my first DSLR and I love it. I've enjoyed photography for years with my point and shoot but wanted to step up to something that would give me more options and let me experiment creatively.I considered some interchangeable lens cameras like the Sony NEX line. My friend has one and is a huge fan by the way. In the end I decided I wouldn't want to shoot in Auto mode and so instead wanted the fiddly knobs and buttons at my fingertips while I looked through the viewfinder. I'm an engineer; we love to tweak settings.I decided on the D5200 over the D3200 because I felt I'd have a little more room to grow with this camera. I also wanted the option of the wireless controls these cameras can be equipped with (the D5100 can't link to your phone but it is much cheaper and otherwise basically the same camera).", "Date": "July 22, 2013"}, {"Title": "Everything I need in a digital SLR", "Author": "The Old Drake \"the old drake\"", "ReviewID": "RKRRUYGSAX5CN", "Overall": "5.0", "Content": "Quite simply, it has all the manual control I used to have with my F2s and F3s plus the automatic modes to function as a point and shoot camera. The picture quality is amazing and the HD video is a real plus for an outstanding still camera. It sits between the professional models and the amateur cameras in Nikon's line and fits my needs perfectly.", "Date": "April 10, 2013"}, {"Title": "Back Focuses Slightly but Otherwise Fantastic Camera", "Author": "Paulybrooklyn", "ReviewID": "RFIRP3MRJJLIS", "Overall": "4.0", "Content": "I've tested two D5200's (one from Amazon, another from BH) and they've both been consistently back focusing with the several lenses I have tried.  Back focusing (the camera and/or lens focuses slightly farther than where you target) seems to be an epidemic problem among both Canon and Nikon SLR cameras.  It is a frequent cause of soft images.  This purchase has been very frustrating, because it is an otherwise wonderful camera.  A salesman told me that many photographers end up exchanging several times before getting a keeper. This seems like a ridiculous technological disparity--they've got a sensor that can capture an ingrown hair on a gnat's left buttock but the camera won't focus properly.  I was told that it's very hard to callibrate a camera to be accurate with all the lenses that are available....but if the problem is back focusing 90% of the time (which seems to be the case with numerous models--I've never heard of a problem with front focusing) why don't these guys start adjusting their products to compensate for that?UPDATEAfter shooting hundreds of test pics and comparing with the D7100 I've concluded that I was getting my drawers in a buch over nothing. The back focusing only seems to be a problem with extreme macro photography; the 1/8 inch inaccuracy does not interfere with sharpness under normal shooting conditions. Although the D7100 is slightly more accurate wide open at very close range, when taking a picture of a person at f/8 from across the room the sharpness is exacatly the same. The resolution really is incredible, and the detail you can extract from the shadows is unlike any DSLR I've ever seen.", "Date": "April 12, 2013"}, {"Title": "i would still buy this even ovr the new d 7100", "Author": "paradox", "ReviewID": "R2JWF74ZCQA7X3", "Overall": "5.0", "Content": "Ok, for starters we all know this is a crop framed camera. This price for this camera is awsome unlike the d 7000 and new d 7100 which are still cropped frame cameras. This little camera packs a punch when tested against a d 7000. The image quality was better and had far less noise not to mention hdr feature which the 7000 lacked. Now the new d 7100 has 51 auto focus points and 15 cross type points and is about 400 dollars more then the new d 5200. Are you really getting more for your money? Not really the d 7100 is a beefed 7000 with 24.1 mp cmos sensor. Still has 2 card SD slot weather sealed and the whole 9 yards with hdr added. There are some features that are good about this 7100 that you normally only see on full framed cameras but the d 5200 has a few of these features as well. Yes, we would all like a d5200 to be weather sealed but eh can't always get what you want. The end result is the d 5200 is the best camera you can own for under $1000.00 us dollars. The d7100 seems like a bit of a scam seeing how its not much further priced from the the full framed d600 granted the d600 had a bad start with the spotting on images after about 200 shots in, but none the less you can't go wrong with a d 5200 and when its time to upgrade its not too smart to upgrade to another cropped frame camera just doesn't make sense. I would looked into d800 and d800e if you want all the bells and whistles. So if your getting a cropped frame camera like a dx get the 5200 it may not be weather sealed and so on, but the image quality is amazing for its price. Also if your not into professional photography it has an easy to use interface. I originally got this for a back up camera and find my self playing with it more then my d 800. Its a fun little camera and if your new to photography I would look Into getting one of these.", "Date": "February 22, 2013"}, {"Title": "Great camera", "Author": "Amazon Customer", "ReviewID": "R37540DSK9EQU9", "Overall": "5.0", "Content": "I have used the heck out of this camera. I love the size, weight and functionality. I've been shooting with Nikons since the days of Nikormats. I really like the way this one feels in my hand when I'm shooting and it's a joy to use. I actually sold the first one of these I purchased and replaced it with the D7100. I didn't enjoy using it so I sold the D7100 and just purchased another D5200. I just got the new smaller 18-55mm lens and it really feels good with that one on. My favorite lens to pair it with is the fast 35mm, especially for portraits indoors with natural light. It's great with the 55-300 for wildlife, concerts and sports.", "Date": "March 20, 2014"}, {"Title": "Here's What I Did", "Author": "Anthony J.", "ReviewID": "R46G2NHGVXEJ7", "Overall": "5.0", "Content": "First I spent about 20 hours researching DSLR's from about $200 cheaper to about $400 more expensive because I wanted to upgrade from a Pentax 35mm and a pretty decent Fuji 16MP 15x RAW shooting, point and shoot. My major concern was noisy pictures because all of the digital's I've used can shoot pretty well in sunlight but can really be poor in low light. Trying to stay reasonable and add accessories is a challenge however, so I was leaning towards the D3200 with the Nikkor 300mm, while wanting the D5200. Then I browsed the used offerings here and found many claiming to be new in the box starting at about $550 and spent a little more after investigating and because of the seller's higher positive rating. So this is what I purchased and it was new and unopened in the box with FedEx sign for delivery and a 14 day return.$585..Nikon D5200 with 18-55mm lens$144..Sigma 70-300mm Sigma 70-300mm f/4-5.6 SLD DG Macro Lens with built in motor for Nikon Digital SLR Cameras$19....Polaroid 32GB UHS-1 card Polaroid 32GB High Speed SDHC CL10 UHS-1 Rated Flash Memory (P-SDH32U1-30-GEPOL)$20....AmazonBasics medium DSLR bag AmazonBasics Medium DSLR Gadget Bag (Orange interior)$53....AmazonBasics 70\" pistol grip tripod AmazonBasics 70-inch Adjustable Pistol Grip Head Tripod$821..TotalI'm not trying to do your shopping for you but if you price the D3200 with the cheapest Nikkor 300mm lens you'll see why I'm happy.This is truly a fabulous setup and the camera I can not praise enough. It's only been about 40 hours of shooting but I'll tell you what...it's no BS about low light shooting. Even at full telephoto the low light shooting is great! I figure another month and 80 hours of shooting I might be able to use the camera's potential but don't worry about using it right after the battery is charged because auto works awfully well. With all the good reviews here and across the web I just wanted to convey that you might be able to afford this once high priced camera setup (before the new model release and with Nikkor 300mm) cheaper than you thought. I recommend this camera however you purchase it and write this review because I'm just trying to help.", "Date": "March 6, 2014"}, {"Title": "Excellent for entry/mid grade dslr!", "Author": "F. Cotton", "ReviewID": "R3QPU0E5NJ5TE9", "Overall": "5.0", "Content": "This thing takes amazing pictures for the price. Beware generic batteries as I have found the Nikon to hold a better charge unfortunately, but just as we'll could buy a few generics and carry with you! Also I had to get a faster SD card so there Wasn't as much delay. Google how to use it and check out the \"ken\" tutorials. His page has helped me greatly!", "Date": "October 5, 2013"}, {"Title": "Great camera for the price", "Author": "Mark J. Farwell", "ReviewID": "R3KNUC1B1CHCS4", "Overall": "5.0", "Content": "This is simply a great camera.  Low light is not a problem with this bit of kit, especially while using a F1.8 35mm prime.  Even without a low f-stop, this camera performs very well in low light.  Noise with ISO 1200 and below is almost non-existent except for black areas.  Feature set is very nice and 4-5 frames a second is no problem.  Video looks great, although there is just a bit of softness that can be cleaned up in post.  The audio leaves a lot to be desired, especially when the source is at a distance.  Somewhat be expected though.  Neewer TT560 boot flash for about $30 is a great addition to this kit and definitely recommended.  Articulating screen is great for tough shots, although there is about a 1/4 second delay with the shutter in the mode.  Live mode and video will eat your battery though.  Overall I am extremely happy with this camera.", "Date": "July 20, 2013"}, {"Title": "Great starting DSLR", "Author": "M. Grenda", "ReviewID": "RTNV2S80N5PEY", "Overall": "4.0", "Content": "Got this as my first DSLR camera, and it has been fantastic. Nikon makes some quality cameras and the D5200 has a great balance of photo and video quality for under $1000 with a decent variable or prime lens. More than enough presets and forgiving auto modes for a beginner as well as full manual shooting. The focus is a bit loud on the 18-55mm VR lens during video with the camera's  built in mic. I'd strongly recommend a lens hood for the kit lens, and certainly at least one prime lens if you are just beginning with DSLRs.", "Date": "January 13, 2014"}, {"Title": "Very Happy, but Nikon should re-visit the grip design", "Author": "AZgoodbooks \"mikesimons\"", "ReviewID": "R34ANR2B93GJT9", "Overall": "5.0", "Content": "After several years with the Nikon D-50 I upgraded to D5200.  Love it!  Honestly, there is only one thing I dislike:  From a perspective of ergonomics, I strongly prefer the design and the way the right-hand grip and controls work on the D50 to those on the newer D5200.  I brought my D50 to a store, compared both, and my wife and I were both surprised the newer model just isn't as comfortable as the earlier model.  But all the new features, the larger screen, the higher megapixels of the newer model convinced us we'd get over the ergonomics.", "Date": "December 8, 2013"}, {"Title": "Great camera for the money, light weight ,has many features and a easy to access menu.", "Author": "DBRich \"DBR\"", "ReviewID": "R2I4951KDZE6BZ", "Overall": "5.0", "Content": "This camera was my upgrade from my old D 3100, the extra megapixels does make a difference.The swivel screen is a very handy plus and Wifi capability comes in handy for those over head shots.", "Date": "November 26, 2013"}, {"Title": "Awesome camera", "Author": "Karen G. \"KDG\"", "ReviewID": "R349WDYB2S1PFD", "Overall": "5.0", "Content": "This is an all around great camera.  You can go to any website that reviews cameras and get all the details that I can't put here, but I love it and use it all the time.  Great for anyone whether they are a pro or a beginner.  Has lots of options and features.", "Date": "November 14, 2013"}, {"Title": "Very pleased", "Author": "P. Williams \"pmscom\"", "ReviewID": "R1I7RZ6E1VOA9C", "Overall": "5.0", "Content": "I shot one event, about 400 photos, and when I came home I was pleasantly surprised to find very little editing was necessary.  All the shots were superb.  But I need to find some time to explore ALL the camera's features. There are just not enough hours in the day for me!", "Date": "October 3, 2013"}, {"Title": "Amazing technology at the right price", "Author": "I. Bloch \"BigdogNJ\"", "ReviewID": "RNMUP673X3DGS", "Overall": "5.0", "Content": "Truth be told, I was looking to upgrade my Nikon D50 to an FX (full 35mm size image sensor) format camera when I began shopping for a new camera body. The price of those professional workhorses was unfortunately beyond my reach. I found this gem when I set my sights a little lower and I am very pleased with the outcome.The pixel count is extraordinary, yielding native 10x13 prints at 300dpi. The 11x17 prints I have made are beautiful, something I was unable to accomplish with the 6.1 megapixel D50.The camera is compact and lightweight almost to a fault. I know I'll appreciate this when traveling, but the \"feel\" of it is somewhat \"cheaper\" than I'm used to from Nikon.The vari-angle LCD panel is large and bright and provides easy access to the vast majority of camera settings when not in Live View mode. In Live View, it allows framing pictures at otherwise impossible angles. (I find the shutter lag in Live View disturbing and therefore use this mode only when absolutely necessary). I like the fact that the settings and menus are navigated by using buttons, the joypad and the dial rather than a touchscreen interface.The viewfinder is kind of off-center on the camera body and it took a little getting used to before I was able to automatically center my eye on it. Once that happened I found the screen bright and the framing accurate. The toggle-able grid lines are a very useful feature. The camera's exposure settings are clearly visible.The 39 point autofocus system is fast, flexible and accurate. The various exposure setting paradigms are remarkably accurate.The embedded technology is simply amazing. Along with the numerous scene programs the 5200 offers Active D-Lighting and High Dynamic Range (HDR) modes. Each of these post-processes the image to give dramatically better results in backlit and high contrast situations. The HDR mode actually takes two images at different exposures and combines them so that both highlight and shadow detail are properly exposed in the final image. There is a calculated multiple exposure mode plus a host of special effects and in camera image editing features.All in all, an excellent addition to the Nikon line for serious amateur and light professional photography.", "Date": "September 22, 2013"}, {"Title": "High Imaging Quality", "Author": "MagicMark", "ReviewID": "R2F36AO8M9PL3B", "Overall": "5.0", "Content": "This camera, to my knowledge, has the highest quality of any camera that's under $2000 (see DXO Mark's scores.  It's even better than the D7100).  So far, I have enjoyed this camera and I intend to shoot some landscapes too.I have been using this camera for a little while now and I can say I really am impressed with the image quality.  I can shoot with higher ISO settings (ISO 640-2500 is common for me, even 3200 will do in a pinch) than I used to with my previous camera (Canon Xsi), which is a pretty good camera back in the day.I love the Picture Control function.  It allows me to customize my JPEG shots.  I shoot BOTH Raw and JPEG and use the JPEG format more often, mainly because I have already (with the Picture Control setting) made my image the way I want so I don't have to spend a lot of time in Photoshop trying to make the picture I envisioned in the first place.  Plus, you can customize the Picture Control settings exactly the way you want.And I this review would not be complete without a REASON for why, after 33 years with Canon, I switched to Nikon.  You see, I love in-camera special effects.  In fact, my favorite technique is multiple exposures.  But when I was 16 years old, Canon did not have a camera (for under $1000) that could do that.  So, I waited.  And I waited.  I waited 33 years and Canon still did not make one so I switched to Nikon.  This particular camera (D5200) has two different multiple exposure capabilities, one for JPEG (you can choose 2 or 3 exposures to overlap)and one for RAW.  The Raw one is interesting.  It lets you choose ANY two images on the memory card (they must be RAW format images) and you can control how bright each image will be in the final picture.  I LOVE my Nikon!Now of the not so good part.  There's always a down side to everything. And Nikon is no exception to that generalization either.  The only two flaws that I can see with this camera is 1) the battery life is short.  But this can be remedied by purchasing a battery grip (off brand names are inexpensive, under $100) and 2) the 18-55 kit lens that came with the body is pretty cheaply made (I recommend purchasing the body only and getting an independent lens, i.e. Tamron's 18-200mm zoom. It sells for under $200 here on Amazon).This camera is worth every penny!  Add to cart!:)", "Date": "September 20, 2013"}, {"Title": "OMG I love it.", "Author": "Garry D. Kepley", "ReviewID": "R1GP8HRF9QRX8S", "Overall": "5.0", "Content": "My previous camera was a 2000 Olympus 5 MP. So when I bought the D5100 last year I was totally amazed at the improvement.I loved it so much when the D5200 came out I bought it and gave my D5100 to my daughter. The 24MP is even better. You can crop till you drop and it is still an amazing photo. The new graphics are great too.", "Date": "September 14, 2013"}, {"Title": "Incredible", "Author": "Michael Wells", "ReviewID": "R13ICDWQRSHNUN", "Overall": "5.0", "Content": "This is everything I expected and wanted out of this camera. Other reviewer's have mentioned how they didn't like the stock lens, but I have really liked everything that has come out of the camera. Picture's are super crisp and clear. This has been an excellent buy.", "Date": "July 22, 2013"}, {"Title": "Reliable, easy to use, packed with features", "Author": "Beau", "ReviewID": "R321OD9I77V2U2", "Overall": "5.0", "Content": "A exceptional camera for photographing sports and low-light settings!I purchased this camera to photograph and video tape my children's sports events. The Nikon D5200 delivered on the action photography and captured balls leaving the bats and soccer balls contacting the foot. The D5200 captures clean images even in low light. Multiple auto settings makes it a easy and fast to use while the manual setting help put you in charge of the outcome. I highly recommend this camera for action shots -- it has served me well.", "Date": "July 14, 2013"}, {"Title": "Very Happy With Purchase", "Author": "Herball \"herball\"", "ReviewID": "R3S3G8UCY339O4", "Overall": "4.0", "Content": "Switched from Canon Rebel DSLR’s to Nikon and glad I made the switch.  Being a hobby photographer, I am by no means an expert.  Have had the camera now for a week and 90% of test images have been very good and probably had the camera been set properly, most of the remaining shots would also have been good.  Aside from reading many comments on vendor sites, I read a lot of so called “professional” reviews and spec comparisons and would hope that others considering the D5200 do the same since this may not be a good fit for everyone so I will keep this short. It was not a deal breaker for me given the other specs, but I do wish Nikon would have added a touch screen. However it didn’t take long to get used to all the settings/menu controls.  Build quality in my opinion is slightly better than the entry level Rebels I had, but am a little concerned about comments I have read about dust.  I suppose time will tell if this becomes a problem.  Video quality was better than I had expected and in my humble opinion pretty much equal to the Canon T4i.  The AF has been very quiet and not a problem with videos. AF on stills photos is more than fast enough for me and low light image quality has been very good to ISO 1600. Bokeh with the kit lens has been a mixed bag but with a prime lens (which I have on order) should be better. However, I do have a couple of images where I was really surprised how good the bokeh was with the kit lens. From a non-professional perspective, for the casual photographer or those just getting into the DSLR format, I would highly recommend checking out the D5200.  If I could have given it 4.5 stars, I would.", "Date": "April 11, 2013"}, {"Title": "Great Camera", "Author": "RnW1107 \"'Noleman\"", "ReviewID": "R17JG5SFOX5FWR", "Overall": "5.0", "Content": "I bought this camera expressly to use on my cross country drive from NC, north to North Michigan, down to Muskegon, across Lake MI, thru WI, MN, on to WA, down the west coast to San Diego, turned left, then hit all the major places in TX, AZ, NV, UT, down thru AL, LA, MS, FL to St. Augustine, Savannah, and home to NC. I shot over 4,000 pictures with my Nikon, as well as some movies. I never had a hiccup with the camera. I'll be the first to admit I don't know a ton about cameras but if you take your time even a 70 yr old dude such as I can get some wonderful pictures.If I had it do over again I'd buy a 200mm lens to go with the one I got.", "Date": "August 22, 2013"}, {"Title": "forget the kit lens, just by the body.", "Author": "Stevo", "ReviewID": "R293NOPF51WAL1", "Overall": "5.0", "Content": "i bought this camera for the girlfriend, and i secretly like using it more than my d7000 (love the gf most tho haha). the resolution is much better than my aps-c d7000 sensor. i returned a d3200 since nikon switched their sensor manufacturer when the d5200 was released. i love the video capabilities, esp the 1080/30fps. as the title says, skip the kit lens, invest in something like the 35mm 1.8g, or my personal favorite, sigma 17-50mm 2.8 os. i may consider adding a battery pack, but then the whole thing might be too bulky.cheers.", "Date": "August 20, 2013"}, {"Title": "Great Camera", "Author": "James P. Bell", "ReviewID": "R1ZUYKNRO0I5RN", "Overall": "5.0", "Content": "Bought this as a 2nd Nikon to join my D7000.  Love the camera and articulated screen.  I was a Canon user for years, but between the D7000 and now the 5200 I am a Nikon person through and through.  Will likely trade the 7000 on a 7001.  D5200 is easy to use, light and affordable.  Great choice.", "Date": "August 5, 2013"}, {"Title": "its a nikon what can i say", "Author": "john c stoebling", "ReviewID": "RSJW1UVEPIAMT", "Overall": "5.0", "Content": "outstanding camera 24 mp its sharp and crisp the lens is great fast auto focusit works with all my old nikon ai lens just fine just put it in manual mode pick the f stop you want on your old lens and set the shutter speed and focus you cant beat the old nikon glass i have tried it on a 20 mm 35 mm 50-f 1.2 85 mm 105 mm 200 mm and the best of all the 55 mm 1.2 micro  nikkorthe only draw back so far is the battery life buy a second one # en-el14 if you are going to take a lot of shots keep a second one on hand also buy the ml-l3 remote control shutter release if you do macro work you can put the camera in live view and  fire it with no vibration it also works well with all the nikon ttl flash units", "Date": "March 12, 2013"}, {"Title": "Best Grab Camera Yet!", "Author": "April Vawter \"Wilderness Photographer\"", "ReviewID": "RDJET6OV0NILD", "Overall": "5.0", "Content": "I admit that I added this to my other two walk-about bodies, a D7000 and a D5100 because I thought the 24MP file-size would give me some wallop and keep the DX format.  I purchased a D800 last year, but use it mostly in-studio because FX threw me back to remembering that with film, 300mm really is 300mm, and I have to admit also, that I've grown happily accustomed to the 1.5 increase in focal length that DX offers.Don't hate me, but I still prefer the D7000 for most shooting situations, partly because I still like to carry my 70-210 f2.8 lens around, and I don't know if I'd really trust it on a plastic body for any length of time.  I also really miss the depth of field preview on both the D5100 and D5200.All that said, the D5200 offers a far better chip, more video options, and easier...more or less, menu on the viewing screen, a brighter screen that seems easier on batteries and more versatility than the D5100.  I haven't used it enough yet to give a long-term impression, but the CMOS and focusing array, and its options are impressive.How much better is a 16 or 24MP file than the 12MP on my old D90?  I don't know, and may never, because I don't have the need for huge prints that I used to.", "Date": "April 5, 2013"}, {"Title": "nikon D5200 camera", "Author": "frank", "ReviewID": "RWQEHXR9UIKGA", "Overall": "5.0", "Content": "great camera would recommend, only fault is color balance has to be adjusted after picture has been takenvia photoshop or other software media", "Date": "May 17, 2014"}, {"Title": "Outstanding Proffesional Quality images, Lightweight, Easy to Learn, Versatile, I love this little camera!", "Author": "RustyMike", "ReviewID": "R3J1JLWTG0Q5F3", "Overall": "5.0", "Content": "Before reading my review you should know this one crucial detail. Until I took a chance and bought this camera, I've only ever used Canons. I was actually looking to get a Canon 6D, then I checked out the specs, compared images and videos between the 6D and so many other cameras, and I went with the Nikon D5200 in the end. It really does capture an image with a slightly higher quality. It's subtle but significant. In terms of overall image quality alone, the only real advantage the Canon 6D has over the Nikon D5200 is the full-frame sensor's resolution, which does give you about 2x sensitivity to light as well. But full-frame DSLRs aren't right for everyone, and they incur extra expenses for more specific lenses as well.If you're after image-quality, video-quality, versatility, and affordability, I'd say this is the best DSLR you can get for under $1k USD. In fact, hands down, I truly believe this DSLR even has the best quality image you can get for under $2k USD.Again, I'm not a fanboy of Nikon or Canon or Sony or Pentax or anything. I've used a Toshiba VHS camcorder, a Sony point-and-shoot, a Panasonic Mini-DV camcorder, a Canon DSLR, a Kodak disposable, and anything else that worked well and made sense... I don't care what the brand is or how expensive or \"pro\" it is. All I care about it is: How good is the image quality, and is it designed well enough to easily master using it? The second point I can throw out the window if the image quality is that much better than it's competitors, but that isn't the case here either. It's a great camera all aroundPROS:1.5x crop sensor Vs. Canon's 1.6x (very close to a 35mm cinema camera crop-factor)6000 x 4000 resolution with 15.3 µm² pixel size (Image is sharp, colors are detailed and very accurate!)921k dot LCD resolution which is more than you even need for the screen size.Shoots .NEF RAW... (Get the free plugin from Adobe if you use Photoshop or Lightroom)Battery lasts a very long time when not shooting (about 500 shots when shooting)30 second to 1/4000 of a second exposure range.Discrete built-in flash with multiple modes / Shoe for external flash24.2 bit color depth, 13.9 EV Dynamic range (tones are detailed, colors are rich and vivid!ISO can go up to 1200 in almost any scenario before getting noisyCompatible with almost all Nikon LensesHas a built-in help system, accessible on the fly, for every single feature and setting!Shoots HDR precomposed in camera or by bracketing multiple exposures to combine later.This baby can capture a crisp and beautiful image! The resolution is large enough, the dynamic range and color depth are wide enough, and the ISO efficiency is so good, I can take a low-light photo of a streetlamp at night, crop out a third of the image, blow it up to the original's size, and still have a crisp, clear, vivid, and noiseless image that I could print at 13x20 inches and hang on a wall, or sell at a gallery. The noise is so low, and the images are so sharp that you could easily blow up an un-cropped image to twice the captured size (26x40 inches) and it would still look fantastic.I was taken aback when I took this little guy out for it's first night shoot. Of course, a little know-how and some trial and error plays a role, but I was amazed by how accurately this sensor represents colors. I took a picture of some flowers in the immediate foreground against a backdrop of a park in the midground and a downtown strip in the far distance. Despite the street lighting, the moonlight, the neon signs, and all the little details in the store fronts, cars, trees, grass, benches, cobblestone walkway, and the telephone poll about a mile away... The picture I took was a spitting image of what I saw with my own eyes. Maybe even a little better. From the flowers in the foreground to the telephone poll far away, everything looked clean and clear and as it was in life. I was about 50 yards away from the storefronts with a 35mm lens, and I could still make out license plates in the photo. If I had focused to infinity, I probably could have made out the plates from even further away. Just as an example! That's not a regular habit or a hobby of mine. hahaha...CONS:Definitely not 100% intuitive menu settings... Read the manual before using to avoid possible confusion.ISO does not have it's own button/dial, however it's very easy to get used to using the \"function\" button for this.Menu system works well, but organization feels a bit chaotic and crammed in certain menu tabs.Nikon doesn't distinguish much between photography and videography. READ MANUAL to get familiar with all settings!Non-CPU manual lenses can only be used in Manual Mode. Would be nice to at least have auto ISO/Exposure as an option.The (BRONZE) paint job is not a matte finish like it looks in every photo you see. It's a glossy finish like the red version.PART 2 ~ THE LENSE:The Kit lens feels a little cheap compared more expensive lenses, but it actually performs very well. I used it a couple times and went immediately back to my primes though, but that's because I'm more comfortable with them. I don't know what to do with a zoom lense, so this was a great opportunity to get a pretty decent one to experiment with for a good price. For these reasons, I can't really comment on the lense that comes in the kit. All I know is it's much more highly praised than any other kit lense for this camera. I'll have to use it more to see how it holds up to my primes.", "Date": "May 14, 2014"}, {"Title": "Nikon D5200 or D3200 ?", "Author": "H. F. SANDOVAL \"Creative Designer\"", "ReviewID": "R1CH07WMKSUV3X", "Overall": "5.0", "Content": "D5200 is a really nice camera...  Althought it is not a super pro, It is a really nice entry-mid level and if you know how to use it properly, you could achieve awesome results.  I have had the D5100 and the D3200, and the D5200 have several improvements against them that I would definetly recommended.If you only take pictures for fun, I would recommend you to get the D3200 the quality is it almost the same. of course d5200 is better is several ways and have more functions... but D3200 it is a great deal for the price.", "Date": "April 26, 2014"}, {"Title": "Compact, light weight, and great images", "Author": "Bill", "ReviewID": "R19548H3D4JZS2", "Overall": "5.0", "Content": "I bought this camera primarily for the increase in pixel count over my D7000, but it turns out to be much simpler to operate and much lighter in weight.  While the D7000 can accommodate most vintage Nikon Nikkor lenses, the D5200 pretty much has to use the new S VR lenses because it does not have the lens motor drive built-in.  The increase in pixel count from 16 to 24 allows a little more cropping of distant shots over the D7000 (the newer D7100 now has 24 megapixels).  I also like the swivel view screen over the  fixed view screen on the D7000, this makes it easier to view your subject when the camera is held well above or well below your head.  The D5200 is a good buy for the money, I got mine \"used\" on Amazon.", "Date": "April 7, 2014"}, {"Title": "absolutely what i was looking for!", "Author": "Bethany", "ReviewID": "R3KQRPQK0LTFRI", "Overall": "5.0", "Content": "I was debating between this camera and the D5300. This was the clear choice due to price and only very minor differences. So far, I am very pleased with this choice.", "Date": "April 5, 2014"}, {"Title": "Awesome camera", "Author": "Zmaximus \"Zmaximus\"", "ReviewID": "R3900MN9ZW2QIC", "Overall": "5.0", "Content": "This is my first DSLR camera so while I will admit that I do not have a lot of photography experience but I must say I love this camera. I have nothing negative to say about it. I take it with me everywhere I go and have even expanded into a small photo business with it because of my love for the wonderful job it does.Again I am not a pro by any means so I could be missing comments about the deep tech talk of it all but I personally would recommend this camera to anyone looking for a great DSLR camera!", "Date": "February 5, 2014"}, {"Title": "Awesome little Nikon!", "Author": "Prad..The Gadget Man", "ReviewID": "R1PR75ZEZVMLL7", "Overall": "5.0", "Content": "Most value for your money, Clarity, professional features, great little camera, pair it with some good lenses and you will be so happy you did not spend money on some of the costlier SLR's.Great camera for beginners and photo enthusiasts alike", "Date": "February 2, 2014"}, {"Title": "wow great camera body", "Author": "Kool \"frank\"", "ReviewID": "RBQALDYHM284T", "Overall": "5.0", "Content": "It is a great camera, lightweight with controls very convenient placed on the camera body. There were two instructions that should be highlighted. I did not read that you had to press the screen button twice to go to the menu selection and spent a while to figure it out. My fault. Also I had set the AP-C instead of the AP-S and the camera would not  shoot the picture. After I read the manual I understood the specific condition that AP-C to be used for focusing on  moving targets. Again my fault.I really like it where you could cover and protect the screen side. This is because I accidentally damaged and cracked my D90 screen. It is really a fantastic camera with lots and lots of features that I would probably use about 30% of the sophisticated features.  I hope to really test it out when I go on a 10 day business trip to China.", "Date": "January 28, 2014"}, {"Title": "very good camera with the right price x benefit", "Author": "C.abud", "ReviewID": "R1WQP3VU3PE42T", "Overall": "5.0", "Content": "Perfect cost x benefit with a lot of features and amazing picture quality. Really recommend if you like good pictures.", "Date": "January 27, 2014"}, {"Title": "Great canera", "Author": "Troy A Kaznowski", "ReviewID": "R19H0QEFM23KPR", "Overall": "5.0", "Content": "Great camera and easy to use.  I look forward to doing more with it.  I would recommend this to anyone.", "Date": "January 26, 2014"}, {"Title": "Great Camera", "Author": "Michael Knippers", "ReviewID": "R314ZW59JZY6C0", "Overall": "5.0", "Content": "My first SLR camera. it take pics with the clarity of seeing in person. I am very happy with and plan to purchase more lenses to go with it.", "Date": "January 25, 2014"}, {"Title": "Excellent for the angle impaired.", "Author": "richie rich", "ReviewID": "R3SJSXTL59DEWE", "Overall": "5.0", "Content": "I already owned Nikon gear but decided to get a smaller, lighter, higher pixel count camera for vacations and now for shooting video.  It will work along side my Sony video camera with a similar sensor size. Once you see the big sensor on video there is no going back to the smaller camcorders (1/6 or 1/3\" sensors I mean). The camera works great.  Good images. But the batteries or not very long lived.  Get extra batts if you buy this for heavy video use.  The camera shuts down after 30 minutes of video recording and that is really as long as the battery charge is good for.  Maybe an other 5 or so minutes.  So it works out well 1 Battery per 30 minutes of recording.  The battery seams to be fine for still pictures though.  I never went through a complete charge in a day for that.", "Date": "January 21, 2014"}, {"Title": "A very good buy", "Author": "Tom Wolter", "ReviewID": "RR25QVPOZZLXS", "Overall": "5.0", "Content": "I use a D90 and wanted a camera for my wife.  The D5200 is light and fits her hand perfectly.  I love my D90 and the quality of pictures and the D5200 equals the quality if not an improvement.  The read out features are great.  The size and convenience of the monitor is perfect.  The setting are very easy to use as you take pictures....", "Date": "January 20, 2014"}, {"Title": "nice dslr!!", "Author": "Aki J", "ReviewID": "R26OOFNFKNBSXA", "Overall": "5.0", "Content": "the body size is great for me and it takes great pic. a good mid-range dslr which allows for some flexibility while takes good pic in full auto mode too.", "Date": "January 12, 2014"}, {"Title": "Very good, and with the fixed shortcoming, now a 5 star.", "Author": "Dwegs \"Dwegs\"", "ReviewID": "R1U7YF1USGC985", "Overall": "5.0", "Content": "I imagine most are coming to this camera as either an upgrade to a point and shoot, or as a next step from a lesser Dslr.My needs are a little different, so bear that in mind when you read this. This will be primarily a camera used for a studio setup, as I don't need weather sealing, high FPS, or super fast/accurate AF. That said, here are the things that I note. Both pro and Con.Pros:1. Excellent resolution (and I would be the 5300 is better still in this area) that tops out well above what I have needed in the past (about 16mp)2. Very nice ergonomics and handling. The feel in your hand (I have medium hands) is comfy and just large enough to feel \"real\".3. Af is better that I experienced with the D5100, or even the D7k (both previous studio bodies for me).4. The menu layout has minor improvements that I find are just notable enough to feel better than its predecessor.5. The colors out of camera seem closer to reality with this than either the 5100, or 7k bodies were. Not as nice as the D700's though.6. Swivel screen is perfect for me, esp. when using it to get low angle shots of kids and pets.Cons:1. The position of the AFL/AEL button (which I use for AF-on), is slightly off to the thumb. Too far out IMO.2. 1/4000th a tad slow.Above average functionality and great files are what make this a very good camera for my current use. For what the market seeks when looking at this sort of camera, it does very well. Even along side the best competitors, it easily holds its own IMO.Is it up for the task? Yes.Are the images it can produce pretty good (allowing for the skill behind the camera, and the lens in front)? - No, its not pretty good, its excellent overall.Will it make toast and tuck you in at night? Well if that was what you hoped for, you were looking in the wrong place anyhow.EDIT: Nikon updated the firmware today, and fixed the only real bug this camera suffers from. Namely the AF-on functionality during certain shooting setups.", "Date": "January 11, 2014"}, {"Title": "Birthday/Christmas gift", "Author": "Katinski \"MovieMaverick\"", "ReviewID": "R3FZVAZAZJCHNJ", "Overall": "5.0", "Content": "My children and my wife got together and supplied the purchase of a camera that I had been drooling over for the past several months.  One son is a very serious amateur photographer and owns several Nikons.  This camera is somewhat a challenge with all the menus and buttons, but having used one of his early Nikons, I'm not totally lost. The pictures that I have taken for Christmas and other events have produced photos that far exceed anything I have taken with my Point and Shoot cameras and also the early Nikon.  Would advise anyone moving into a serious DSLR to consider this camera", "Date": "January 10, 2014"}, {"Title": "Recommended", "Author": "Wellard", "ReviewID": "R77RDZ0VTGSCG", "Overall": "5.0", "Content": "After much research I settled on purchasing the D5200 in favor of the D5300 and do not regret the decision.  It's a great camera that's easy to use, packed with features and produces amazing quality images.  It will take a while to master the features, as the manual is pretty close in size to the bible, but if you are looking for quality images with minimal post-processing, then this camera is the way to go.", "Date": "January 4, 2014"}, {"Title": "Phenominal", "Author": "Bmwalla", "ReviewID": "R1IHKHQR557GCF", "Overall": "5.0", "Content": "I purchased this camera in November and I've waited a few months to write a review.  I'm not sure how it is for others, but for me this was a major investment that I budgeted for.  I had my eye on this camera for quite some time and when i received it i was very impressed.  Right out of the box, on the auto setting, I was taking great pictures w/ lots of character and color.  I'm slowly learning more and more via the internet, books, and the classroom.  The great thing about photography is you can make it as involved as you want and this camera lets you do just that.  It is an excellent point and shoot camera and an excellent 'professional' camera as well.", "Date": "January 3, 2014"}, {"Title": "First time dslr and Nikon user.", "Author": "Tony", "ReviewID": "RDT5GFIMJYTJ0", "Overall": "5.0", "Content": "First time Nikon and dslr user here, and I must say that I'm loving this camera! I'm a huge fan of all the still and video options it gives meaning that even all the preset auto functions deliver outstanding pictures in almost every imaginable scenario. I'm more a fan of manual controls as I'm more familiar with using them on hd camcorders but it's nice to know that if I just want to pop off a few shots without any fuss, I can easily do so.The camera feels rock solid, the screen is nice and bright and all of the controls are easily accessible.My only complaints are that the battery that comes with the camera drains pretty quickly and I really wish the camera had come with an ac adapter (sold separately).I still stand by 5 stars for the quality of stills, video and ease of use all of which are excellent. Time to plan some vacations!", "Date": "December 11, 2013"}, {"Title": "Great Camera", "Author": "Erich A. Mabray", "ReviewID": "R2W6637DCYLSKW", "Overall": "5.0", "Content": "Bought this for the wife. Very good camera with a decent zoom lens. Easy to use, and there's tons of features on it. Definitely not a pro photographer, but this takes some seriously good pictures. Flash is pretty decent for stock, but if you plan on taking a lot of low light pics, might want an additional flash.", "Date": "November 19, 2013"}, {"Title": "Great Kit", "Author": "Eric Moynihan", "ReviewID": "R1X33LKLIL8N2Z", "Overall": "5.0", "Content": "Awesome camera for new photographers like myself!  Took with me on a trip i had recently and came back with the best photos I've ever taken.", "Date": "November 15, 2013"}, {"Title": "Excited to have a quality camera!", "Author": "CLEVE CLARIDGE", "ReviewID": "REU0NFKDCSSRC", "Overall": "5.0", "Content": "I'm still learning to use my new D5200 but so far, everything has worked great. Pics are very clear and I've become a shutter-bug again. Can't wait to try this out in low light conditions when we go to Cosumel this December. My wife got me the Nikon D5200 For Dummies book so I can teach myself how to use this camera to full advantage.", "Date": "November 7, 2013"}, {"Title": "Excellent!", "Author": "LUIS F GAMBOA VADILLO", "ReviewID": "R14TRKNUKLZPOP", "Overall": "5.0", "Content": "Excellent camera and very easy to use. It has many fun features and the quality of the photos is wondrrful.", "Date": "October 4, 2013"}, {"Title": "Nikon D5200", "Author": "Eric", "ReviewID": "R2AWI1F5EZX9IA", "Overall": "5.0", "Content": "It came well packaged with no damage.  I am very happy with it.  Photos are awesome.  All I need now is more glass and a piggy back mount for my lx200", "Date": "October 3, 2013"}, {"Title": "I love it!", "Author": "Javier Orlando Buitrago", "ReviewID": "R4EAR09VQ1JO0", "Overall": "5.0", "Content": "I think this product is excellent, it's a good balance between price and quality. I recommend this for the most profesional people that wants best for his job.", "Date": "September 6, 2013"}, {"Title": "Great camera and value for your money!", "Author": "S. Holder", "ReviewID": "RAE1SSPVRDXFL", "Overall": "5.0", "Content": "I've had this camera for about 4 months (got thousands of wonderful pictures from it already) and am satisfied with its performance. Before purchasing, I reviewed many alternatives (sony, canon, micro 4/3) and now can say I am please with my decision, I got value for my money. Also, I made this purchase on one of the bundle deals and got the nikkor 18-55mm and 55-200mm, 64GB, filters x 2, bag, remote control etc for next to nothing. The camera feels good/sturdy in my hands is not heavy and has a fully articulated screen that I use a lot (over the head shots in crowed areas and family pictures that include me - here the remote shutter is convenient). Most importantly, I can concentrate on taking pictures and learning photography and not be overly concerned about gear as this camera is versatile.", "Date": "August 30, 2013"}, {"Title": "Fun for the family.", "Author": "RedSoxFans", "ReviewID": "R3U5TMCCKKX00D", "Overall": "5.0", "Content": "This camera has been a lot of fun so far for our family. We are learning by doing ( and referencing the manual to try new settings). We take a lot of sports shots and videos of sports. It is heavy so I don't think I will take it on big family vacations but for what I wanted, I love it.", "Date": "July 20, 2013"}, {"Title": "Great camera!!", "Author": "S. Taylor", "ReviewID": "RXG2ZU86EJR8E", "Overall": "5.0", "Content": "I purchased this camera as a \"backup\" camera to my D7000.  I have had a ton of fun with it.  It took me a bit to get used to the info screen but once I got the hang of it I loved it.  I am very pleased with this purchase especially when considering I almost bought a D7100 and was going to demote my D7000.  My budget-driven decision to scale down had a great result with this camera and its price.", "Date": "July 19, 2013"}, {"Title": "Excellent resolution for the price.", "Author": "Jimmy P", "ReviewID": "R3HVKR98J85I1R", "Overall": "5.0", "Content": "Combined with my Nikor lense, the VRII 18 - 200 mm, I am excited about the picture quality.5 frames a second is nice feature and it has an easy to use menu too.", "Date": "June 10, 2013"}, {"Title": "Perfect for My Purposes - So Far", "Author": "Mike Wright", "ReviewID": "RFWH4XOD3E0HT", "Overall": "5.0", "Content": "This is my first digital SLR. I began using film SLRs back in 1965, but quit photography for a while when the last one broke down in the 1980s. I've been through a variety of small digital cameras starting in 2000, the last being a 4-megapixel Nikon Coolpix 4500 purchased in 2003 (for $529.95).I've taken at least 6,000 photos with the CP 4500 -- mostly macros of insects and spiders, since it can focus down to 0.7 inches, but also lots of bird shots. When the flash quit working on the CP 4500 early in 2013, I decided that it was time for something a bit more advanced. I did a lot of research online and settled on the D5200 with the 18-105mm zoom. We were heading out as far west as Tucson, AZ for our spring vacation, and I wanted more zoom than the usual 18-55mm kit lens for birding.The combination of D5200 and 18-105mm zoom worked out extremely well during our 3-week vacation, and I got hundreds of great shots. I've recently added the 85mm f/3.5 Micro-Nikkor for macro work and Nikon's 55-300mm zoom to get closer to the birds, and will be trying them out during a couple of weeks in Florida just after Christmas.I've been completely satisfied with the D5200 so far, and I like having an SLR with interchangeable lenses again. The flip-and-tilt LCD screen is one thing that influenced my decision. The CP 4500 had a twistable split-body that permitted taking shots of arthropods from lots of odd positions, and I wanted that flexibility, even though the D5200 will be too large to get in everywhere the CP 4500 will fit.Of course, things are a bit pricey nowadays. My first film SLR cost $59 (and didn't have auto-anything -- not even a built-in light meter), which is about 1/17th of what the D5200 cost, but then again I used to buy Levis for $2.95, and cameras have improved a whole lot more than blue jeans have.", "Date": "December 11, 2013"}, {"Title": "Saved lenses", "Author": "John Pollock", "ReviewID": "R1JFA1Q9X14BJ8", "Overall": "5.0", "Content": "Upgraded to this camera from a D3000. Needed the video mode. The higher quality photos are a plus. Easy to use and learn. Great novice camera.", "Date": "August 17, 2013"}, {"Title": "love it", "Author": "lilly", "ReviewID": "R154AT1WFSW7BU", "Overall": "5.0", "Content": "I love this camera it is everything I hoped for. It was such a big improvement from my canon rebel xs", "Date": "May 9, 2013"}, {"Title": "From D3200 to D5200", "Author": "Berny", "ReviewID": "R1S4AR8RFQ3JNG", "Overall": "5.0", "Content": "Now I get better autofocus system, and more control (low, medium, high...) on D-lighting, ISO, noise reduction, plus I get HDR (High dynamic range),build in Interval timer shooting (no need extra accesories!!) Improved video quality, stereo mic and I can move the monitor screen to get very slow,high or hard to get angles.All other things are basically a D3200", "Date": "March 14, 2013"}, {"Title": "D5200 vs. D7000 vs. D70", "Author": "Breb", "ReviewID": "R21PJIV8XOG0BM", "Overall": "4.0", "Content": "About a year ago I went from D70 to D7000 in one gulp.  Despite all the \"D7000 is a very great move\" suggestions online it was a very silly idea because I could barely operate the D7000.  I tried a variety of lenses, but nothing could fix my lack of know-how. Eight wonderful D70 years did NOT prepare me for the D7k.  The fact that the d7k even HAS an Auto button is a JOKE. I had to shoot manually to get even half decent shots (although I have to say it was great for doing high speed shots of dogs leaping through the air)So a few months ago I craigslisted my D7000 - it pretty much covered a nice new D5200.The D5200 was a good move for me.  Even video became a possibility with the d5200 (quite difficult on the D7000 due to the awful fixed screen and the 24fps)The D5200 works nicely with my 50mm prime lens and with my old kit D7000 lens.  It even works well with my old D70 kit lens!!However it would seem that the skin color of pictures with the prime + D5200 seems off,bland,  and often a little overexposed.  But sometimes it's great. I have no idea, really.Anyway to sum up: good snapshots, easy to use all round.  LIGHTER than the D7k.  Good in low light. But for video? BEWARE! This isn't a camcorder!  The autofocus on my lenses in AF-F trying to track kids/dog/baby is awful. It does the best it can but the technology for a rank amateur just isn't there, and won't be anytime soon.If I could just stop the pictures from being a little too bright it would be a perfect camera for me!", "Date": "October 30, 2013"}, {"Title": "Very nice camera", "Author": "Jean Taillon", "ReviewID": "R1KJ4GM7XXFA41", "Overall": "4.0", "Content": "Bought this camera to replace my Nikon D5000,  Got the \"body only\" because I have the 2 Nikon lenses that came with my D5000 but I use the camera 90% of the time with my Tamron 18-270mm lens. Very nice combination.Was looking at the D7100 too but if think it is not worth the price difference. For my use, it is the perfect SLR. Canon makes good camera too but I am a Nikon fan. Will give 5 stars when the price comes down.", "Date": "June 12, 2013"}, {"Title": "Super for starter", "Author": "Sik403", "ReviewID": "R3UIMS8IVHCSUT", "Overall": "5.0", "Content": "Just loving this DSLR!  It's been a month I got my DSLR , this is amazing camera. If you know the options, you are the boss ! This was my first DSLR, I learnt most of the options from YouTube videos and taking few random clicks. My experience till now is mind blowing.", "Date": "May 27, 2013"}, {"Title": "Satisfaction Guaranteed! An Excellent Beginners Choice", "Author": "Allen", "ReviewID": "R2FY47BQ8EU03S", "Overall": "5.0", "Content": "This is my first upgrade from the Nokia D3100 and the difference is astounding. If you are willing to make the jump (an extra $300 from lesser versions), you ARE getting much more! I would suggest something as good as this to any budding professional looking for great equipment under $1000. Good Luck!", "Date": "October 1, 2013"}, {"Title": "Beautiful!", "Author": "Bryan", "ReviewID": "R1AXPOLNYR5FWD", "Overall": "5.0", "Content": "This camera is beautiful and works wonders. The picture is crisp and clean. It takes only like, an hour to really get the hang of it if you're not too familiar with fancy shmancy cameras. (Which I was not.) I love the motion button. It takes around 22 pictures in a row without stopping and can catch any movement. I first tried it out on my dog while she was running around. It caught every hair on her body in movement. Just wonderful. I still need to get the hang of the flash at different settings, but other than that, it's great! Oh and the video is pretty good too. Not amazing but certainly better than any phone or cheap video camera. I recommend getting it in red. The others look a little plasticy and I dunno....not professional? The red looks best in my opinion.", "Date": "September 9, 2013"}, {"Title": "Great camera!", "Author": "S. Redwing \"heyshanny\"", "ReviewID": "R2F2YWL49WQOSS", "Overall": "5.0", "Content": "Awesome features.  Takes amazing pictures! I would recommend to anyone who's looking to upgrade their starter DSLR.  I'm thrilled with my purchase.", "Date": "August 21, 2013"}, {"Title": "great camera", "Author": "Cem", "ReviewID": "R2SH9SDOT6LDWH", "Overall": "5.0", "Content": "Don't forget to get a remote control. I had the opportunity to take pictures of the planetary alignment on May 24th. The picture came out great. It is lightweight and the grip is strong.", "Date": "June 4, 2013"}, {"Title": "My first DSLR and loving it!", "Author": "garet821", "ReviewID": "R1YG12INGZM4OE", "Overall": "5.0", "Content": "I finally made the upgrade from a point and shoot to a DSLR. I'm very happy with it so far. I shoot a lot of video for action sports and wanted to consolidate great video capture ability with full burst mode picture stills. The video quality is great, the audio not so much. This isn't a problem as I would normally add an external mic anyway. As far as the action stills go, you can't beat it. I race and shoot pics for motocross which is very demanding on a camera to get a crisp shot. It makes it very easy for even a novice to come away with professional quality images. I haven't figured out how to work half of the stuff on this camera, so it should keep me satisfied for a long time to come.", "Date": "March 28, 2013"}, {"Title": "The camera is very goof", "Author": "HXX", "ReviewID": "R4P0FTZ7RVY2P", "Overall": "5.0", "Content": "The camera is that I want to buy first. My choose is right. It is greatly good. The price is cheap for customers.", "Date": "June 5, 2014"}, {"Title": "Great  Camera, easy transaction", "Author": "Daniel J Vieira", "ReviewID": "R397G6DQLCWYFH", "Overall": "5.0", "Content": "Camera is as described. An awesome camera. Entire transaction was painless and went smoothly. Definitely would recommend to anyone interested in a new camera.", "Date": "June 2, 2014"}, {"Title": "AWESOME Camera!", "Author": "Andy Crofton", "ReviewID": "R3G6T6ITF8UG8V", "Overall": "5.0", "Content": "I bought this camera a couple months ago and couldn't be happier! It takes stunning pictures and has outstanding functionality. You can't go wrong buying such a great camera! It's also very reasonably priced! You get a lot of bang for your buck.", "Date": "June 2, 2014"}, {"Title": "Great Cammera!", "Author": "Juan Carlos", "ReviewID": "R3UMCGH7JBBUZX", "Overall": "5.0", "Content": "I'm very satisfied with this product.The delivery service was so god and all intact. Very recomendable!So, if you want to make amazing photos, you should to buy a 50 mm f/1.4 Lens.", "Date": "June 1, 2014"}, {"Title": "Words cannot describe how happy I am with this", "Author": "Nick", "ReviewID": "R21TSKGZ3I8SDH", "Overall": "5.0", "Content": "The subject says it all. I've been going back and forth about this camera for over a year now. I am very pleased I finally got it. It takes fantastic pictures, AND it works with all my old lenses. The catch with the old lenses is that they don't auto focus during the videos. I'll apparently need to get a new digital SLR lens that will auto focus properly for me. I want it mostly for vacation pictures and videos so I don't really need to have the absolute control over the focus when I'm taking a video", "Date": "May 27, 2014"}, {"Title": "I bought this for a client", "Author": "Richard Porter", "ReviewID": "R17BCBPN7JW997", "Overall": "4.0", "Content": "I bought this for a client, so far no complaints from her, I've always bought NIKON anyway for personal use", "Date": "May 24, 2014"}, {"Title": "We love this camera and it is good price too.", "Author": "Doris Cho", "ReviewID": "R1F4X2RLHJLVAP", "Overall": "5.0", "Content": "Thank for your services. It is nice camera and we enjoy it. We will do the business with you again.", "Date": "May 23, 2014"}, {"Title": "Great camera", "Author": "Andre Araujo", "ReviewID": "R56X1VXA4GSSP", "Overall": "5.0", "Content": "Nikon D5200 is such a great camera and has a fast access to the controls without too much fiddling.All my pictures are perfect now.", "Date": "May 22, 2014"}, {"Title": "excellent beginner DSLR", "Author": "Rob \"Combo\"", "ReviewID": "R31BCR7W4FN764", "Overall": "5.0", "Content": "Great product; love this camera.  Good beginner dslr. It can be as simple or complicated as you wish and pictures are excellent.", "Date": "May 21, 2014"}, {"Title": "Great camera!  Clear and brilliant pictures", "Author": "Mom to Curtis", "ReviewID": "R2SA8284V5LBJD", "Overall": "5.0", "Content": "This is a great camera; takes beautiful and clear pictures.  There are many settings and filters to learn.  I am new at using this kind of camera, but it is easy to learn without reading the entire book.  If you are looking for a great camera with many settings, filters and takes clear photos then look no further.  The only thing I wish I would have purchased at the same time was the 55-200mm lens because the 18-55mm lens (that comes with it) doesn't have any telephoto or real close up view.  I have ordered the additional lens.", "Date": "May 19, 2014"}, {"Title": "Very happy with this purchase", "Author": "Jimmy \"/jimmy/\"", "ReviewID": "R33PH7LHP9MFPL", "Overall": "5.0", "Content": "I'm not a pro photographer -- but with a medium learning curve, this camera takes great photos.  Added a Nikkor 18-200mm lens and I'm ready to go.", "Date": "May 18, 2014"}, {"Title": "Love it!", "Author": "Faith N", "ReviewID": "R12ROCZ81LOB0Q", "Overall": "5.0", "Content": "I'm no photography pro but I purchased this after playing around with my best friend's Nikon D5100. 6 months later I'm still in love. This camera is everything I wanted and more. It's true to all the specs given, I've had no issues with it so far. Hoping all my future purchases of Nikon will be just as good!", "Date": "May 17, 2014"}, {"Title": "Great Camera", "Author": "Ed", "ReviewID": "R3JXMKQSHRBPLL", "Overall": "4.0", "Content": "This is an awesome camera. It was between this or the canon rebel T5i. It's not cumbersome to operate. In fact my wife is terrible with tech items and she finds it simple to use and loves it. If you have kids in sports/activities the rapid fire option is great. Beware you will take a lot of pics so make sure you have a large SD card and hard drive. We also bought the extra lens for long shots and it was a little expense but worth it.", "Date": "May 16, 2014"}, {"Title": "Great Camera for amateur photographer looking to take amazing photos!", "Author": "K. Kendziora \"Kory\"", "ReviewID": "RJFDKYCEP8I8G", "Overall": "5.0", "Content": "I am upgrading from the Nikon D40 and I found that the D5300 was very easy to use and it has the no flash feature which works great in lower light scenarios.  The stock lens is just right in size and ability to take your everyday shots.  I find that the feel of the camera is just right and I don't notice it being to bulky or too small for an SLR (The D40 seemed to be a bit small for my larger hands).The speed and quality of the shots form this camera are outstanding and I am very happy with my purchase!", "Date": "May 15, 2014"}, {"Title": "Awesome Camera!", "Author": "David G.", "ReviewID": "R2MJ8UX1TA1EDN", "Overall": "5.0", "Content": "I found this camera by looking up best begginer DSLR cameras. This Nikon was on top so I went with the best. The settings are easy to learn for an extreme newbie like me or anyone starting. The lens (18-55mm) is great as well. Overall great camera I have in fact tried others but this one hit the spot even after the \"best\" review.", "Date": "May 12, 2014"}, {"Title": "Good value for high quality filming", "Author": "FilmPro", "ReviewID": "R2UZQ7TO0QFCSC", "Overall": "4.0", "Content": "I've always been a Canon guy, but recently decided to try out Nikon. The D5200 has become a great,reliable backup camera for me. It's lightweight, takes high quality images and full HD video up to 60i which is great for moving images. There isn't much noise even at high ISOs. My only gripe is that it is harder to adjust settings using the buttons and scroll wheels, so you are forced to enter menus to make fine changes that could be more easily be done on my Canons.However, even for a main camera, not just a backup, I can still recommend the D5200.", "Date": "May 9, 2014"}, {"Title": "Love it!", "Author": "Stephanie tter", "ReviewID": "R1XIQ4WG5BW4W2", "Overall": "5.0", "Content": "I purchased this to upgrade and I am so happy that I did. I am ready to get outside and use it even more.", "Date": "April 15, 2014"}, {"Title": "As promised", "Author": "Cole", "ReviewID": "R2RXI0YQW99OUN", "Overall": "5.0", "Content": "Great experience. Bought \"like new\" and was pleasantly surprised. Couldn't even tell it had been used. Love the camera already and haven't even read the manual. Would recommend seller and camera!", "Date": "April 14, 2014"}, {"Title": "Good camera for Photo. Not great for video.", "Author": "Abhi gautam", "ReviewID": "R3HWOR5RQUUTTH", "Overall": "4.0", "Content": "After taking hundred of shots i am pleased with camera's performance. Photos are sharp and accurate. Not good enough for video recording as some of the frame goes out of focus, hens giving only 4 star. Apart from that it rocks.", "Date": "April 9, 2014"}, {"Title": "Great camera", "Author": "Midastuch78", "ReviewID": "R2N977OQ6MQFWM", "Overall": "5.0", "Content": "Out of the box this camera is very pretty. I was a bit surprised and panicked a little bit when I turned it on and the language was set to Japanese though. Luckily it was easy enough to find the language section and change it to English.Great camera and I have had so much fun taking pictures all over South Carolina.", "Date": "April 4, 2014"}, {"Title": "Nikon D5200 camera", "Author": "Terrence Lindley \"poetiq\"", "ReviewID": "R3QD4IMFB0PQ5O", "Overall": "5.0", "Content": "I love this camera. I bought a 55-200 mm lens and it is brilliant. Fumbling around only shooting in manual mode is fantastic, wonderful photos in low light.", "Date": "March 28, 2014"}, {"Title": "The best of Nikon for entry level cameras", "Author": "charles schwabacher", "ReviewID": "R3R17DTITXVHU8", "Overall": "5.0", "Content": "Ten times better than my N3000. Does more with less work. The 5200 is as good as the 5300 at a lower price and can do all a professional unit can except for very special apps.", "Date": "March 24, 2014"}, {"Title": "Nice camera", "Author": "Amazon Addict", "ReviewID": "R3CFAUNW35UN87", "Overall": "5.0", "Content": "I'm not going to get into the stats of this camera. There are many other reviews and websites that already have this information available.The Nikon D5200 is a nice camera. It has a swivel screen which is useful for video or weird camera angles. It has a lot of nice features, one of my favorites being all the auto-focus points and the low noise at high ISOs. The stock lens is perfect for a beginner. You can learn on the kit lens and still have quality pictures. You will want to upgrade eventually though.I think this camera is great for people who want to actually learn photography. If you're just going to shoot in Auto mode all the time, get a nice point and shoot and save yourself a lot of money. If you're actually interested in learning how to manually control your camera, then get a DSLR. The D3000 series (D3300 is most recent at the time I wrote this) is another great series by Nikon with a few less features. Also a great starter DSLR.", "Date": "March 21, 2014"}, {"Title": "GREAT body", "Author": "Rodrigo Vilches", "ReviewID": "R23DJ9AW7G1ECT", "Overall": "5.0", "Content": "Fantastic camera, I had the D40, D3200, D5100 and this one is by far the best of all, a great improvement from the D5100 and extreamly fast", "Date": "March 21, 2014"}, {"Title": "Nikon D5200", "Author": "Victoria A.", "ReviewID": "R2PKSEHW5HU86A", "Overall": "5.0", "Content": "I absolutely love my camera! It has many features and love how my pictures come out! I am very satisfied!!", "Date": "March 18, 2014"}, {"Title": "Small, but very powerful!", "Author": "Gabriel", "ReviewID": "R19O9O9FU4VCGB", "Overall": "5.0", "Content": "I got this camera refurbished, and it works perfectly!  I also have use an older Nikon D80.  Compared to the d80 (should apply to the new D7000/7100 too), the D5200 feels more \"plasticky\" and hollow.  Performance-wise, the camera is remarkable.  It's definitely the one to beat for a while.  Both photos and videos look beautiful, and the screen interface is simple and a treat to look at.  Raw files can get a little large, though (~36mb), but with a good SD card, this shouldn't be much of a problem.", "Date": "March 17, 2014"}, {"Title": "Landscape, Wildlife Photogragher", "Author": "Jack M Seaman", "ReviewID": "RCAV7VFBIQOBA", "Overall": "4.0", "Content": "I have only had this camera for a short time this winter. So far I am very satisfied with the layout of the controls, the light weight of the camera and quality photo's I have taken so far. As the weather gets better and I use the camera more I might be able to rate it higher.I traded my D3200 for this camera and I believe the D5200 turns on faster and is much easier to focus under some conditions.I would say you can't hardly go wrong with this camera for the price.", "Date": "March 17, 2014"}, {"Title": "Nikon D5200 with (kit) 28-55mm zoom lens", "Author": "Alfred T.", "ReviewID": "R29BKN0HRHSI41", "Overall": "5.0", "Content": "This camera has many features of the Nikon D7000 professional model for roughly half the price. Using good lenses, and a good photo editor I seriously doubt anyone on the planet could tell the difference.", "Date": "March 11, 2014"}, {"Title": "Perfect.", "Author": "Toya", "ReviewID": "R5X4VJWR8N1I4", "Overall": "5.0", "Content": "Amazing. I love this camera. The quality it's beyond what I expected. I couldn't be happier with my new camera.", "Date": "March 9, 2014"}, {"Title": "Awesome camera", "Author": "Sharolyn Sievert", "ReviewID": "R18V6W9IF12DZJ", "Overall": "5.0", "Content": "I did a lot of research before getting this camera.  I am a volunteer search & rescue K-9 handler and needed a camera that could take action photos of working dogs.  This does that and much more.  It has way more options that I anticipated and am still learning to use, but so far am very impressed with the photos I've taken.  Great service, received as expected!", "Date": "March 2, 2014"}, {"Title": "Great camera", "Author": "Wes", "ReviewID": "RWDNV4R3MD3CP", "Overall": "5.0", "Content": "I will not pretend I know anything at all about a good camera. We use this to take pictures of our family and nature. Our lives. It is a beautiful camera. Some of the best images we have ever seen have come out of this camera. It has an amazingly fast shutter. You can edit your picture right on the camera. I would buy it again if I needed another. Worth every penny.", "Date": "February 27, 2014"}, {"Title": "The adjustable live view monitor is great.", "Author": "DeeCee \"Western fan\"", "ReviewID": "R1CT2X8JNP50UF", "Overall": "5.0", "Content": "While I normally use the view finder, the live view monitor is great for taking pictures if I'm too short or I don't want to crawl in the mud.  I can turn the monitor to a position where I can remain standing and still frame the picture.  This is my second Nikon and I'm glad I upgraded to the D5200.", "Date": "February 26, 2014"}, {"Title": "Great Camera For The Price", "Author": "VooDoo \"VooDoo\"", "ReviewID": "R1WHKEL8CLH1LI", "Overall": "4.0", "Content": "Camera takes nice clear bright photos.  Easy to use.  This is a nice entry level camera to the SLR market.", "Date": "February 6, 2014"}, {"Title": "Excellent Camera", "Author": "Champ Jones", "ReviewID": "R2KPE8Q0P96V5I", "Overall": "5.0", "Content": "If you are looking for a middle of the road camera when it comes to budget, This is hands down one of the best options out thereRidiculous quality on photos and videos, I did some research on every different type of camera and the dslr type cant be matched when it comes to delivering quality in this price range(this is my opinion)Only negative with this camera would be the power drainage it suffers when shooting high quality video, as well as the mic, the mic in the camera is cell phone like, this didn't disappoint me because the quality of everything else greatSo I recommend getting an extra battery and an external mic if you want to shoot videosAlso the Rokinon 85mm f/1.4 lens should be one of the first lenses you get, incredible lens, the nikons 35mm and 50mm dont seem to match its sharpness", "Date": "January 24, 2014"}, {"Title": "nikon 5200", "Author": "Veniamin Kalmanovich", "ReviewID": "R3VS6VCM3LHNWT", "Overall": "5.0", "Content": "exellent camera.I bought it refurbished but it looks and feels like brend spanking new.takes exellent pictures and I really like quality of the video.", "Date": "December 11, 2013"}, {"Title": "Purchase of my Nikon", "Author": "Marcelo Mastrostefano", "ReviewID": "R2H1AJVONL8GMG", "Overall": "5.0", "Content": "I choose it because of some advice of my friendsIt was really a good productI recomend it to any ho wants to buy an SLR camera", "Date": "October 2, 2013"}, {"Title": "LOVE", "Author": "Stacey", "ReviewID": "RBO1V9Y91YWY4", "Overall": "5.0", "Content": "So far I love everything about this camera. It is a fabulous intermediate camera. It has so many features of the higher end professional models and the ones that it does not have I would never use anyways.I would highly recommend this camera.", "Date": "September 22, 2013"}, {"Title": "Awesome Camera!", "Author": "MLAM", "ReviewID": "RLEJJR727DAMX", "Overall": "5.0", "Content": "This camera performs really well, takes really great pics and the videos are super clear too. I highly recommend this camera and this lens to go with it - 70-300 F4.5-5.6 G ED-INTERNAL FOCUS AF-S VR. I bought the lens used for under $400. The two together are amazing!", "Date": "September 20, 2013"}, {"Title": "Great step up from D5100", "Author": "blitz2010", "ReviewID": "R3C4GJB4Q8PQO5", "Overall": "5.0", "Content": "Love this camera! It has replaced my D5100.  I love how clear the images are and there are 39 focus points, which is great!", "Date": "September 17, 2013"}, {"Title": "almost as good as the d300s", "Author": "All ammo", "ReviewID": "R1KWHR1J6BHGP1", "Overall": "5.0", "Content": "I have own the d3200 and now the d5200 which I returned and exchanged.  I first thought the D3200 was awesome until I have taking pictures with the D5200.. auto focus is very fast and very accurate.  One day I had my friend over with his D300s,  We did a comparison test with his beast 24-70 f2.8 and my prime 35mm f1.8. we took pictures with both cameras on both lenses, both on identical  manual settings.  The D5200's pictures are brighter and more crisp and detailed when zoomed in.. I guess is because it has more megapixels.  I will not say the D5200 is better than D300s.  The D300s is much faster in almost everything and it also have auto focus motor build it and magnesium body.  I would suggest get just the body and the 18-200mm vrII since now is $250.00 off with the camera.", "Date": "February 3, 2013"}, {"Title": "BEST Bang for your Buck.. I got the sweetest deal ;)", "Author": "jog3ee", "ReviewID": "R2EQY48M3V9CA9", "Overall": "5.0", "Content": "Well this is a GREAT camera and you know what's even better? I got a GREAT price on it :D The body + 18-55mm VR kit lens cost me 700$ in my home country instead of 896$ here at Amazon; now isn't that SWEEET.About the camera, I'm new to DSLR photography and took a kind of uncertain leap from Canon to Nikon. I was very happy with my Canon T3i, my 1st DSLR but I am GLAD that I switched to this baby ;)!! In addition to the kit lens I added a 50mm 1.8g lens and Its a package that covers most of my basic photography needs.The performance, the auto-focus, the result, low light performance, and a massive 24 mega pixels give me enough room to crop/edit and still retain great image quality. I'm not much into movies but the movies are sharp and give great low light results as well. The AF in movie mode is something Im getting used to of of and in my opinion not better than the Canon t4i AF but still does a great job and the movie quality is quite superior to that of t4i, or even t5i maybe as that camera is almost identical to caonon t4i except some minor changes.If you're new to DSLRs, get this camera. You wont regret it and it offers quite a lot compared to similarly priced peers.", "Date": "March 29, 2013"}, {"Title": "Best value", "Author": "Ben", "ReviewID": "R2Q9Y1JJ9NTNU9", "Overall": "4.0", "Content": "Positive- good auto focus- good pictures in all light conditions, that's the reason to buy it, also for the video as well- shoots great video!!!- great flashNegative- weird skin tones color sometimes. I shot canon, Nikon, Olympus and Fuji; some I own and some I rented and when I compared photos, there is something about d5200 skin tones that bugged me. I got some very good pictures with d5200, but a good number of them I would not put in my photo album because of skin tones.Yes, I would recommend this camera easily because this is all around great performer with a very good video. A lot of cameras shoot great under certain light conditions, d5200 handles it all without any problems, i just wish skin colors are a little better.", "Date": "April 8, 2013"}, {"Title": "Good but", "Author": "Ms Susan F. Robbiano \"xxxxxxx\"", "ReviewID": "R32A3QXL1RI9VS", "Overall": "4.0", "Content": "Nice pics but the sports mode turns off the flash so if u want flash u need to buy extra flash attachment", "Date": "December 4, 2013"}, {"Title": "Love this camera", "Author": "Skinoze", "ReviewID": "RIM1DTEFOSBSV", "Overall": "5.0", "Content": "It will probably take me a year to master all the functions but I'm completely satisfied with this camera. Excellent value for the money!!", "Date": "August 14, 2013"}, {"Title": "Very inpresed", "Author": "John M. Russell", "ReviewID": "R2LW5VR06SU9X4", "Overall": "5.0", "Content": "I have a d5100 and struggled to decide on getting a d5200 or D600 for a second body.  With the price weight and oil spot problems with the D-600 the D-5200 won.  I couldn't be happier.  The new features like time-lapse, the WU-1a and a little faster shutter are nice upgrade.  One thing you need the fastest memory card you can afford especially if shooting raw or (and jpeg) for it to keep up Extreme SDXC UHS-I card 45MB's a minimum. Extreme Pro SDXC UHS-I 95 MB's even better but it will set you back $70 to $140 respectively.  The D-600 is still in the future but I am very happy for now.", "Date": "April 3, 2013"}, {"Title": "Too Many Important Functions Hidden in Menus", "Author": "Know What I Mean?  Nudge Nudge \"NH AV Fanatic\"", "ReviewID": "R13WES07TFW65V", "Overall": "3.0", "Content": "This is a nice quality effort from Nikon.  The 5200 has a good feature set, and takes nice quality pics, but I found that far too many functions I use on a regular basis were buried in the menus.  That was the deal killer for me.  I read reviews about this, but I want to make people aware that this is much more of a pain in the bum than you think.  Fix this issue Nikon, and you have a Canon killer on your hands!", "Date": "May 11, 2013"}, {"Title": "Beyond expectation", "Author": "Miha Ahronovitz \"myinnervoice\"", "ReviewID": "R3EIIJM3GDVK8K", "Overall": "5.0", "Content": "Our six year G9 Canon camera had a failure too expensive to fix.So we decided replace it.  I considered the new Nikon Coolpix 600. It has no RAW mode and no socket for an external flash, I looked at Canon SX-50. Based on my G9 Canon experience, this is quite complicated to operate. The UI of cameras seems to not make much progress compared to cell phones.Nikon D3200  as an SLR camera,. Because the new model D3300 came out, the D3200's price is suddenly  closer to the long zoom point and shoot. The camera is very light and all commands are intuitive. We added a WiFi access via WU-1a Nikon accessory.The Nikon D5200. I has a rotating display,  so one can take a \"selfie\" It has more pre-set shooting programs and a better focusing system. I could not resist the temptation so we got the Nikon 5200 instead of 3200.The clarity and color of the photos is astonishing. Compared to my Canon 7D, this camera weights almost half. We bought it in red, which looks like a modern art piece in a modern art museum..The price of Nikon D5200 compared to what it offers is a steal. Simply out of the box, If you are real beginner, the camera takes pictures in only two setting; automatic, and automatic no flashThen slowly, you can learn more features as the camera smoothly invites you to try from its sheer simplicity that seems to say \"you can do it\".", "Date": "April 8, 2014"}, {"Title": "My camera", "Author": "Cecilia Fernández Costa", "ReviewID": "R1M8VLUWIIJW4S", "Overall": "5.0", "Content": "I wanted that specific camera, because I was tryining it (with a friend's similar camera). After 2 days reading the manual and proving the functionalities, I can say I am pleased.", "Date": "February 20, 2014"}, {"Title": "My First DSLR", "Author": "Chris", "ReviewID": "R38KYKYTUH788N", "Overall": "5.0", "Content": "I have not used an SLR (Pentax K1000) since i started having problems finding film and developers. I began using my phone to take pictures but they were not exactly what i wanted each time, i kept missing the ability to backlight and change the aperture to increase the focus range. The D5200 has been great, i have been taking much sharper pictures and i continue to play with the manual mode to perfect my shot. What is best now is that i can bracket my pictures without wasting 3 or 4 frames of film. As a new comer to DSLRs i cannot give a great comparison to other cameras on the market, but i can say that this camera did not have a steep learning curve due to the scenes mode and i was impressing people with my first shots. I love the manual, aperture and shutter speed priority and the ability to set the ISO (equivalent) has been great. My only con is that the lenses are much more expensive than i remember from the 90's.", "Date": "November 29, 2013"}, {"Title": "Great camera", "Author": "Matthew", "ReviewID": "R14504KBJ1RGP4", "Overall": "5.0", "Content": "As I  have been playing with this camera recently, i absolutely love it. It's small, compact, it has 14 bit raw, The same focusing system as the d7000 the filters aren't much use to me but to a consumer photographer they should be fun, the only two complaints I have and they aren't really complaints are, that the light meter seems to slightly over expose but that's not hard to fix, as well as the camera it's self has no motor in it for autofocusing and the lens has to. These are the only complaints I have and I definitely recommend this dslr to any beginner and itWould definitely serve to many wedding photographers and land scape photographers", "Date": "October 8, 2013"}, {"Title": "D5200", "Author": "Kenneth Mabry Jr. \"K.Mabry\"", "ReviewID": "R2B5PECXW3Z3C7", "Overall": "5.0", "Content": "I have enjoyed the purchase of my Nikon D5200, while I'm still learning to use the camera and all it can do, I'm very pleased with the performance. I enjoy the feel of this camera in my hands and have used it on many all day events with great captures.", "Date": "August 3, 2013"}, {"Title": "Amazing", "Author": "Kenton Filipowicz", "ReviewID": "R2NN3VR3FT29J4", "Overall": "5.0", "Content": "I love the images and I love the video quality. First time dslr user and I'm a video producer. DSLR's are a little hard to pick up and start using but I'm getting the hang of it. Great camera all around though.", "Date": "June 30, 2013"}, {"Title": "This camera is simply a beast and Nikon rocks.", "Author": "james gomes", "ReviewID": "R2PXDGO3N36TBR", "Overall": "5.0", "Content": "Amazing Camera takes stunning pictures I replaced my canon dos 20d with this camera, I was planing on buying another camera but I chose this instead and I am very happy with the purchase.", "Date": "May 24, 2013"}, {"Title": "Love the photos ..", "Author": "Michael John Wittman", "ReviewID": "R399HRRNUI5W99", "Overall": "5.0", "Content": "I'm not a professional but I'm very happy with the quality and features of this camera.  Some features are hard to find on the menu system but it gets easier as you become familiar with the layout.  Video is superb as well.  Plus this camera is VERY fast .. you won't miss any shots for lack of camera speed.  In the past I've not used special \"scene modes\" since I know enough about photography that I didn't feel I needed it;  but this camera has such wonderful \"on-camera\" photo augmentation I highly recommend experimenting with the \"built-in\" photo enhancements.", "Date": "April 3, 2013"}, {"Title": "Continues to impress", "Author": "J. Sambataro", "ReviewID": "R14BOWKZG10J1B", "Overall": "5.0", "Content": "I upgraded from my Nikon D200 to the D5200 and have been especially enjoying the new camera with the Nikon 16-85mm lens. The sensor is amazing and especially helps for low light; the in-camera HDR works pretty well and can even be done without a tripod with a steady hand; I like how easy it is to toggle between video and still shots; you can even cut new start and end points on the camera to save memory on both your card and computer; and I like how you can either shoot through the viewfinder, use the screen for shot info, or in screen view. I was going back and forth between this and the D7000 and I selected a lighter, smaller camera body with the newer sensor, pixel size, toggle screen, easy video shooting over the durability, weather proofing of the D7000. Here are a few notes to keep in mind:-lens such as a simple 50mm without a motor built in will not autofocus on the D5200 (no in-camera motor). However, I found that using my f1.8 50mm indoors for a party was worth the manual focusing.-battery life of the en-el14 is really short -especially if you use the screen view. Always have a fully charged 2nd battery. If you are in the backcountry for a while without a solar charger, consider a 3rd battery.-one thing i miss is how easy it was on the d200 to toggle around your focal point. This is still possible but I can only figure out how to do that in screen view mode.That's all for now, still more to learn and I can't wait to test its full potential.", "Date": "March 17, 2013"}, {"Title": "Disappointed with Video", "Author": "Neel", "ReviewID": "R2SD8JQ36AJYZT", "Overall": "3.0", "Content": "<!--\n\nfunction fp_resizePlayerSpace(nsPrefix,w,h)\n{\t\n  try {\t\n    var ifrm = parent.document.getElementById(nsPrefix + \"movieFrameID\");\n    if (ifrm) {\t\n        var h2 = h + 35;\n        ifrm.style.height = h2;\n      }\n    } catch(err) {\n \n    } \n\n\n  if (h > 0) {\n      document.getElementById(nsPrefix + \"clipDiv\").style.height=h+\"px\";\n      document.getElementById(nsPrefix + \"videoPlaceholder\").style.height=h+\"px\";\n  }\n  else {\n      document.getElementById(nsPrefix + \"clipDiv\").style.height=\"\";\n      document.getElementById(nsPrefix + \"videoPlaceholder\").style.height=\"\";\n  }\n  document.getElementById(nsPrefix + \"flashcontent\").style.height=\"100%\";\n}\n\nfunction fp_rewriteDiv(nsPrefix,divName,html)\n{\t\n    document.getElementById(nsPrefix + divName).innerHTML=html;\n}\n\nfunction embeddingPopup(nsPrefix)\n{\n  alert(\"placeholder function for embedding code\");\n}\n-->\n\n\n<!--\n\nfunction cv_mo3DXUP0M2C5SPIembeddingPopup(){\t\nalert(\"Embedding code will be displayed here.\");\n}\n\n-->\n\n\n\n\n\n\n\n\n\n<!--\nfunction cv_mo3DXUP0M2C5SPIrefresh_preplay() {\n\ndocument.getElementById(\"cv_mo3DXUP0M2C5SPIchiDiv\").innerHTML = document.getElementById(\"cv_mo3DXUP0M2C5SPIhiddenPre\").innerHTML;\n};\ncv_mo3DXUP0M2C5SPIrefresh_preplay();\n\n-->\n\n\n\n\n\n\n        // <![CDATA[\n\nvar cv_mo3DXUP0M2C5SPIso;\t   \n\n\nfunction cv_mo3DXUP0M2C5SPIloadSwf_Core(swfLocation, swfWidth, swfHeight, flashVersion, bgColor, swfParams, flashParams, embedAttributes) {\n\n  try {\n      cv_mo3DXUP0M2C5SPIso = new SWFObject(swfLocation, \"cv_mo3DXUP0M2C5SPIAMPlayerProd\", swfWidth, swfHeight, flashVersion, bgColor);\t   \n\n      for (var v in swfParams) {\n        cv_mo3DXUP0M2C5SPIso.addVariable(v, encodeURIComponent(swfParams[v]));\n      }\n      for (var v in flashParams) {\n        cv_mo3DXUP0M2C5SPIso.addParam(v, flashParams[v]);\n      }\n      for (var v in embedAttributes) {\n        cv_mo3DXUP0M2C5SPIso.setAttribute(v, embedAttributes[v]);\n      }\n\n      cv_mo3DXUP0M2C5SPIso.addVariable(\"swfEmbedTime\", new Date().getTime());\n\n      var agt = navigator.userAgent;\n       \n      var reFirefox = new RegExp(\"firefox/\", \"i\");\n      var regx = agt.split(reFirefox);\n      var ffVersion = 8;\n      if (regx[1]) {\n          var pts = regx[1].split(/[.]/);\n          ffVersion = parseFloat(pts[0] + \".\" + pts[1]);\n      }\n      var minorVersion = parseFloat(navigator.ap);\n      if ((navigator.appVersion.indexOf(\"Mac\")!=-1) || (ffVersion < 1.5)) {\n          cv_mo3DXUP0M2C5SPIso.setAttribute(\"height\", swfHeight);\n          cv_mo3DXUP0M2C5SPIso.setAttribute(\"width\", swfWidth);\n          cv_mo3DXUP0M2C5SPIso.addVariable(\"oldFirefox\", \"1\");\t     \n      }\n\n      if (cv_mo3DXUP0M2C5SPIso.write(\"cv_mo3DXUP0M2C5SPIflashcontent\")) {\n          fp_resizePlayerSpace('cv_mo3DXUP0M2C5SPI', \n                               320, \n                               283);\n      }\n      else {\n          var nsPrefix = 'cv_mo3DXUP0M2C5SPI';\n\n          fp_resizePlayerSpace(nsPrefix, 0, 0);\n          fp_rewriteDiv(nsPrefix, \"flashcontent\", '<br/>To view this video download <a target=\"_blank\" href=\"http://www.macromedia.com/go/getflashplayer\" target=\"_top\">Flash Player</a> (version 9.0.115 or higher)');\n      }\n  } catch(err) {\n      fp_resizePlayerSpace('cv_mo3DXUP0M2C5SPI', 0, 0);\n  }\n  return false;\n}\n\n\n\nfunction _cv_mo3DXUP0M2C5SPIloadSwf(movieID, playerVersion) {\n    var swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/20120510035744301/AMPlayer._V148501545_.swf\";\n    var swfWidth = \"320\";\n    var swfHeight = \"100%\";\n    var flashVersion = \"9.0.115\";\n    var bgColor = \"#FFFFFF\";\n\n    var swfParams = {};\n    var flashParams = {};\n    var embedAttributes = {};\n    swfParams.amazonPort = \"80\";\n    swfParams.allowFullScreen = \"true\";\n    swfParams.telemetrySubPageType = \"VideoReview\";\n    swfParams.nsPrefix = \"cv_mo3DXUP0M2C5SPI\";\n    swfParams.locale = \"en_US\";\n    swfParams.logUrl = \"gp/mpd/l\";\n    swfParams.canResize = \"1\";\n    swfParams.autoPlay = \"1\";\n    swfParams.sessionId = \"000-0000000-0000000\";\n    swfParams.marketplaceID = \"ATVPDKIKX0DER\";\n    swfParams.salign = \"LT\";\n    swfParams.preset = \"detail\";\n    swfParams.mediaObjectId = \"m1KMYISZY31NPI\";\n    swfParams.autoPlayTimer = \"\";\n    swfParams.mediaObjectIDList = \"m1KMYISZY31NPI\";\n    swfParams.playIsUserGenerated = \"1\";\n    swfParams.enableShare = \"0\";\n    swfParams.permUrl = \"gp/mpd/permalink\";\n    swfParams.telemetryPageTypeID = \"R2SD8JQ36AJYZT\";\n    swfParams.xmlUrl = \"http://www.amazon.com/gp/mpd/getplaylist-v2/m1KMYISZY31NPI/000-0000000-0000000\";\n    swfParams.amazonServer = \"www.amazon.com\";\n    swfParams.scale = \"noscale\";\n    flashParams.allowFullScreen = \"true\";\n    flashParams.salign = \"LT\";\n    flashParams.bgcolor = \"#FFFFFF\";\n    flashParams.allowScriptAccess = \"always\";\n    flashParams.quality = \"high\";\n    flashParams.wmode = \"transparent\";\n    embedAttributes.title = \"Flash Player\";\n\n    if (movieID){\n      if (playerVersion == '3'){\n        swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/20120510035744301/AMPlayer._V148501545_.swf\";\n        swfParams.mediaObjectIDList = movieID;\n      } else {\n        swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/legacy/20101014901/AMPlayerProd._V197491872_.swf\";\n      }\n      swfParams.xmlUrl = \"http://www.amazon.com/gp/mpd/getplaylist-v2/\" + movieID + \"/000-0000000-0000000\";\n      flashParams.wmode = \"transparent\";\n      swfParams.autoPlay = \"1\";\n    }\n\n    if (document.getElementById('cv_mo3DXUP0M2C5SPIduration')) {\n      document.getElementById('cv_mo3DXUP0M2C5SPIduration').style.display='none';\n    }\n    cv_mo3DXUP0M2C5SPIloadSwf_Core(swfLocation, swfWidth, swfHeight, flashVersion, bgColor, swfParams, flashParams, embedAttributes);\n\n  return false;\n}\n\nfunction cv_mo3DXUP0M2C5SPIloadSwf(movieID, playerVersion) {\n   return _cv_mo3DXUP0M2C5SPIloadSwf(movieID, playerVersion);\n}\n\n\n\t\n\t\t// ]]>\n\t\n\n<!--\n\nfunction cv_mo3DXUP0M2C5SPInewHeight(h)\n{\t\n    fp_resizePlayerSpace('cv_mo3DXUP0M2C5SPI', 0, h);\n}\n\nfunction cv_mo3DXUP0M2C5SPIresetPlayer(w,h,bw,cc) {\n  cv_mo3DXUP0M2C5SPInewHeight(h);\n\n  cv_mo3DXUP0M2C5SPIso.addVariable(\"resetBandwidth\", bw);\n  cv_mo3DXUP0M2C5SPIso.addVariable(\"cacheCode\", cc);\n  cv_mo3DXUP0M2C5SPIso.setAttribute(\"height\", h);\n  cv_mo3DXUP0M2C5SPIso.setAttribute(\"width\", w);\n  cv_mo3DXUP0M2C5SPIso.write(\"cv_mo3DXUP0M2C5SPIflashcontent\");\n}\n\n-->\n\n\n\n\n\n\n\n\nvar cv_mo3DXUP0M2C5SPIRollOverImg = new Image();\ncv_mo3DXUP0M2C5SPIRollOverImg.src = \"http://ecx.images-amazon.com/images/I/91JVVR9dW0S._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play-active,BottomLeft,130,-12_CR0,0,0,0_.png\";\n\nvar cv_mo3DXUP0M2C5SPIpreplay = document.getElementById('cv_mo3DXUP0M2C5SPIpreplayImageId');\nif (cv_mo3DXUP0M2C5SPIpreplay) {\n  cv_mo3DXUP0M2C5SPIpreplay.onmouseover = function() {\n    cv_mo3DXUP0M2C5SPIpreplay.src = \"http://ecx.images-amazon.com/images/I/91JVVR9dW0S._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play-active,BottomLeft,130,-12_CR0,0,0,0_.png\";\n  }\n  cv_mo3DXUP0M2C5SPIpreplay.onmouseout = function() {\n    cv_mo3DXUP0M2C5SPIpreplay.src = \"http://ecx.images-amazon.com/images/I/91JVVR9dW0S._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play,BottomLeft,130,-12_CR0,0,0,0_.png\";\n  }\n  \n  \n  var node = cv_mo3DXUP0M2C5SPIpreplay.parentNode;\n\n  var cv_mo3DXUP0M2C5SPIcurrentClick = node.onclick;\n  node.onclick = function () {\n    var head = document.getElementsByTagName(\"head\");\n    if (head[0]) { \n      var logTag = document.createElement('script');\n      logTag.type = \"text/javascript\";\n      logTag.src = \"/gp/customer-media/du/log.html?ie=UTF8&p=CustomerImage&s=CustomerVideoPlay\";\n      head[0].appendChild(logTag);\n    }\n\n    if (cv_mo3DXUP0M2C5SPIcurrentClick) {\n      return cv_mo3DXUP0M2C5SPIcurrentClick();\n    }\n  }\n}\n\n\n\n\n Length:: 0:51 MinsThe Nikon D5200 has several great features that other customers have taken the time to point out. It has good quality control, the ability to take very high resolution photos, a compact and relatively lightweight design, compatibility with many lenses, and many functions that are designed to improve photo quality in different settings.However, I noticed a major flaw that is highlighted in the attached video. There is a constant sound that comes from the camera in every video one shoots with it. In my video, I have quelled the sound significantly using some software. However, even after all of this effort, the sound is still present and can be heard alongside the crashing waves. This is a major flaw that causes the D5200's video quality to be considerably sub-par.I would like to stress that visually, all the images and videos have excellent quality. However, sound is a necessary component to a video.", "Date": "August 31, 2013"}, {"Title": "Great value for the $", "Author": "AZazel", "ReviewID": "R3NYEX8UQZ6ANN", "Overall": "5.0", "Content": "Just upgraded from a D5100 and could not be happier. The D5100 was\\is a good camera BUT the D5200 has those few extra things (bells and whistles) that I had been wishing the D5100 had.  I took a couple dozen shots within minutes of getting the camera and I am very pleased with the results.  Looking forward to learning how to properly use all the abilities this camera capable of.Relatively light-weight and easy to hold with the 18-55mm lens. No P.h.d. needed to operate but some level of photography knowledge will help you use this camera to it's full potential.  If you want a more \"point & shoot\" type DSLR look at the D3200.Sadly tho Amazon's packaging left more than a little to be desired. The units box was loose within Amazon's shipping container.  It was able to move\\slide 3-5\" in most directions and that made me very nervous as it came thru the USPS, a group not renowned or known for it's careful handling of packages.Luckly there was no damage, just a dented outer box (shipping container). Note to Amazon:  If I'm spending over $900.00 with you I do expect better packaging.", "Date": "February 26, 2013"}, {"Title": "Unbelievably Versatile", "Author": "Salvatore Mansu", "ReviewID": "RDS53BG89R7IL", "Overall": "5.0", "Content": "Wow! there is nothing this camera won't do. What makes it so nice is how intuitive it is.  The learning curve was very short but most important, I have never had my photos come out so good.  Every day I learn more about the camera and every day my photography gets better.", "Date": "April 3, 2013"}, {"Title": "Beginner", "Author": "P. Soto", "ReviewID": "R3BKJL9YBNYEI3", "Overall": "5.0", "Content": "I love everything about this camera.  I had been learning about photography for only 6 months with a Canon and was very scared to try a Nikon because they just seem too complex.  After spending a little time with my new Nikon D5200, it was easy to learn and operate. I have been shooting in raw and the pictures are just crystal clear.  It has so many features that I can't wait to explore.  It is lightweight and the red color is beautiful. The software is also easy to use.", "Date": "February 7, 2013"}, {"Title": "Great Camera", "Author": "Ricardo Martinez", "ReviewID": "R72TEYOB3A9LQ", "Overall": "5.0", "Content": "I love the 24.1 MP since that lets me crop images ( arrange composition ) without loosing details.The body feels strong.Since I was using a Cannon Camera before, It took me a while to get used to Nikon's navigation controls ( I still think that on this part Cannon cameras are easier to use ).Continuous shooting is superb on this camera.", "Date": "May 31, 2013"}, {"Title": "LOVE IT!!!", "Author": "Andrew Bebow \"APB\"", "ReviewID": "R24QCVYC8URM2Y", "Overall": "5.0", "Content": "I've had this for almost 2 months and am in my second photography class with it and just love it.  I researched many cameras and am so happy that I chose to go with this one.  Many people in the class have wished their cameras included the top notch features that this camera has.", "Date": "March 29, 2013"}, {"Title": "EXCELLENT CAMERA", "Author": "Sergio Augusto", "ReviewID": "R1RSXC1SL2MCPE", "Overall": "5.0", "Content": "I have been taking pictures for a while. I find this camera faster than may old D3100: it focus faster. I have been having sharper pictures. It also takes more pictures one after the other faster and with better quality.I feel my photos are with better colors and sharpness. Has also nice effects like keeping one subject in color and rest in black and white. I will test other features like filming and then report later. So far, I think it was worth the extra money from D3100.", "Date": "February 16, 2013"}, {"Title": "Great Camera", "Author": "Steve V", "ReviewID": "R8W4GFJOM8474", "Overall": "5.0", "Content": "I've owned a DSLR camera for many years and I've always just used it in the fully automatic mode.  I decided to get more serious about photography, so I upgraded from my old early model Sony to this camera.  I now shoot all my photos in either \"M\" mode or \"A\" mode and my photos turn out much better.  With the way the digital display is laid out on this camera made it much easier for me to scan through all my settings which is really nice when you're not an experienced photographer. I'm definitely glad I bought this camera.", "Date": "April 1, 2013"}, {"Title": "Damage camera", "Author": "Daniel Bertoni", "ReviewID": "R1DOEQ7GKS7UA", "Overall": "1.0", "Content": "This item was bought to be deliver internationally.As I received it, it was damaged. Its not working.Looks perfect, but does not work.How could we do in order to exchange it for one that functions.Please advise to this mail: bert@grupo-gerencial.comThanks in advance.", "Date": "May 13, 2014"}, {"Title": "The best toy!", "Author": "eAragon", "ReviewID": "R2JXYM5NMXR0RP", "Overall": "5.0", "Content": "Nice!! The best toy for take pics! Like a porfessional tool is excelent for many situations. Resistant body and very good quality.", "Date": "April 6, 2014"}, {"Title": "Nikon D5200", "Author": "Bill F", "ReviewID": "R3V0R029GJFKCZ", "Overall": "5.0", "Content": "I have only owned this camera for about a month now. It does everything as advertised.The only things I would mention to people upgrading to a dslr would be that the D5200 autofocusis built into the lens. Where as if you spend a couple hundred dollars more the autofocus systemis built into the camera. With the latter type camera you can use older lenses.The other thing worth mentioning is other than the shutter setting you need to push and hold down a button andthen rotate the setting wheel to change your ISO and aperture settings. This can become challenging whenlooking through the view finder.For the price, if you are on a budget you can't go wrong with this camera. The bottom line is the actual picture andthe D5200 takes an awesome picture!", "Date": "March 14, 2014"}, {"Title": "D5200 nikon", "Author": "Mary Maloney", "ReviewID": "R2O5UNRLJZBHDV", "Overall": "5.0", "Content": "I signed up for a photography class that required a camera with changable lens. After doing some research the D5200 was highly recommended for what I needed.  I bough it under used but it was new and in the box. I received it on time, in fact a day early.  I have really enjoyed the camera and hope that I will know what all the bells and whistles will do.", "Date": "February 24, 2014"}, {"Title": "Great next level entry DSLR", "Author": "Joe Cool", "ReviewID": "R2VMRNLLEBTH0M", "Overall": "5.0", "Content": "This is my first DSLR, moving up from a fully programmable Fuji point and shoot.  While i used the settings on the Fuji (aperture, exposure etc.)  It just didn't have the speed.  This certainly does & is very easy to use.  Spend a couple bucks and get a good zoom, the 18-55 is nice but not nearly enough zoom.", "Date": "February 16, 2014"}, {"Title": "Arrived earlier than expected in excellent condition!!++++", "Author": "Amazon Customer", "ReviewID": "R2ZBP42ZIPE8MT", "Overall": "5.0", "Content": "Thank you for the prompt service, I will definitely be ordering form you again in the future, everything was as advertised, and in great condition. Very well packaged and arrived way earlier than i thought! Thanks again!My previous camera was a D90, and this is definitely a step above! i would highly recommend it to anyone looking to upgrade!", "Date": "February 14, 2014"}, {"Title": "excellent!!!!", "Author": "Jacopo", "ReviewID": "R28PPQ7PAJV0CF", "Overall": "5.0", "Content": "the camera was sold as described. It was new and the shutter count was zero, so no picture were taken. Perfect conditions.", "Date": "February 11, 2014"}, {"Title": "Great camera with great features!", "Author": "Kevin Everley", "ReviewID": "R3LFYX751TK93Z", "Overall": "4.0", "Content": "Great camera! It takes a little while to get used to if you've never had a DSLR before, but once you get the hang of it you can really get professional quality photos with it (especially shot in RAW format). The lens is a bit limiting but is good for the range it was made for.", "Date": "February 8, 2014"}, {"Title": "Great transaction", "Author": "Kevin Q", "ReviewID": "R3A0M4RK7UPWJY", "Overall": "5.0", "Content": "Product arrived promptly with everything in order - hassle free:-)  I would order from this reseller again.  The D5200 is great for my Prosumer son that is studying film  in college,", "Date": "January 10, 2014"}, {"Title": "Good", "Author": "3E", "ReviewID": "R3RUIYRVCF5I3Y", "Overall": "5.0", "Content": "I have no issues with this product. But it's my 1st SLR camera so I don't really have anything to compare it to. It takes good photos which I expected.", "Date": "January 8, 2014"}, {"Title": "Great Camera", "Author": "James R", "ReviewID": "R22WGE0TNN0RYJ", "Overall": "5.0", "Content": "This is just a very nice camera--it has a high quality MP and is very easy to use--but very difficult to master!  Came exactly as advertised.", "Date": "January 8, 2014"}, {"Title": "Excellent Camera!", "Author": "Jamie", "ReviewID": "RBG40NUO6AF6E", "Overall": "5.0", "Content": "I haven't had the camera that long but so far I am loving it!  This is my first step in the SLR world and overall it has been an easy transition from a point and shoot.  I have only used the manual settings a few times but i'm learning more and more each day.  Even when using automatic settings the pictures turn out beautifully.", "Date": "January 6, 2014"}, {"Title": "Excelente Camera", "Author": "Sebastian Lisi", "ReviewID": "R35VY11N0E9IJZ", "Overall": "5.0", "Content": "It's exactly what i wanted :). It's a very nice camera the pictures are too clear and the lens is versatile.", "Date": "January 6, 2014"}, {"Title": "Nikon is clearly a great product", "Author": "RISA I CAPOBIANCO", "ReviewID": "R7Q0C288VNBKN", "Overall": "5.0", "Content": "Bought this as a gift for my daughter who is a somewhat experienced photographer. This was her first real pro slr so I didn't want it to lack in options at the same time be so heavy she couldn't hold it.  It delivered on all levels.  The 18-140 lens was a good choice because she can go effortlessly from one shot to the next.  Took some great photos and blew them up to frame. Beautiful color and clarity.  She can upgrade with more lenses when she is ready.  I fell i made a good choice.  A combination of ease of use and quality.", "Date": "January 5, 2014"}, {"Title": "Learning as we go", "Author": "S. Casey \"caverugger\"", "ReviewID": "R1SBYLCLNVHWI9", "Overall": "5.0", "Content": "Like others, we finally made the leap to a SLR. This is an intermediate choice, with a sophisticated and robust processor. There is a great review by \"Faymous Media\" that provides a nice video of the capabilities and specs. It helped tipped scales in favor of this model over the 3000 series, and over comparable Canon models. We are very happy with the photo quality, excellent frames per second, and depth of options.After a month of playing, we are beginning to get an understanding of how to use the vast range of the D5200 capabilities.  We are now shopping for other lens varieties for other types of photos, both long distance and ultra-wide. We highly recommend the WU-1a adapter if you have an iPad or iPhone.  With that you don't need to bother with buying the remote shutter. It also allows quick views and wireless copying of photos already on the SD card.", "Date": "December 25, 2013"}, {"Title": "Just the right amount of features for a beginner who wants to do almost everything the big boys can do.", "Author": "Randall", "ReviewID": "R1UR3MDWNN39UC", "Overall": "5.0", "Content": "This is one hell of a step up from taking pictures with my cellphone.  I'm still learning and this camera has the power to let me practice what I learn.", "Date": "August 6, 2013"}, {"Title": "My best camera ever!", "Author": "Brian Will", "ReviewID": "R13JI3SXEA0F35", "Overall": "5.0", "Content": "It's light!It's fast!It's the best low light performing camera I ever had!You cannot beat the price!I love it!", "Date": "July 9, 2013"}, {"Title": "nice camera", "Author": "D. Shaw \"Oh meow\"", "ReviewID": "R2JPSL3CS97VCE", "Overall": "5.0", "Content": "Nikon D5200 is very nice camera that have variable angle LCD much easier to use than D3100, D 3200, D600 and D7100, etc. which are fixed LCD.", "Date": "July 6, 2013"}, {"Title": "Much improvement!", "Author": "KNovo", "ReviewID": "R1T2BWHTAE5F5S", "Overall": "4.0", "Content": "This is a bigger improvement than the Nikon D5000. The megapixels are outstanding and so are the manual settings. The automatic can be screwy sometimes in the sense of the autofocus. That is the only downfall for this camera. The camera is user friendly.", "Date": "July 5, 2013"}, {"Title": "YES!", "Author": "Darrell French", "ReviewID": "R1L75135XO3N52", "Overall": "5.0", "Content": "Definitely has helped me a lot. I'm thinking about stepping up to the D7000 now that i'm learning how to use the camera a bit more.", "Date": "July 3, 2013"}, {"Title": "execllent", "Author": "gordon k.", "ReviewID": "R2LC0OTXSCC8DT", "Overall": "5.0", "Content": "Great camera for ease of use and manual setting easy to read on screen.  View finder is large and easy to see display.", "Date": "June 20, 2013"}, {"Title": "Fast and Furious!", "Author": "M. E. Cosentino", "ReviewID": "RG0MGEXSJSZHT", "Overall": "5.0", "Content": "Very nice product, I'm upgrading from a Nikon D3100, and the new features are amazing. Still a lot to learn about photography, but I confidence that Nikon D5200 will help me.", "Date": "March 28, 2013"}, {"Title": "Huge back focus issue", "Author": "James", "ReviewID": "RV96AMN3J2LF3", "Overall": "1.0", "Content": "There is a huge backfocus issue with this camera. Same this happened for D7000. If you are looking into advanced-beginners photography try to avoid this. Lot of users are having the same issues [...] I contacted Nikon Support and they said I have to pay to fix it, even though I have 1 year warranty, since its a mirror issue.", "Date": "September 22, 2013"}, {"Title": "But", "Author": "A. Barnes", "ReviewID": "R1LQT2SGJYT2AS", "Overall": "5.0", "Content": "The camera is great but I went to Tall's and it was on sale for 300 less than what I paid and it came with two kit lens boy was I upset and the one I have wasn't even brand new.", "Date": "December 27, 2013"}, {"Title": "Really useful features of SLR camera", "Author": "Rahul Mani", "ReviewID": "RG4M11P1YHIBJ", "Overall": "4.0", "Content": "Worth going for the midrange than the Nikon D3200. Love the pullout feature of the LCD and the manual features", "Date": "October 2, 2013"}, {"Title": "great camera", "Author": "Leslie Olson", "ReviewID": "R2PMFZJ5L8W8HR", "Overall": "4.0", "Content": "Takes great pictures! It is user friendly and the menu is easy to understand. The video is a little challenging to use.", "Date": "October 2, 2013"}, {"Title": "Digital camera", "Author": "Mario Esparza", "ReviewID": "RCG6P31456SOA", "Overall": "5.0", "Content": "From a 35mm camera that I had for many years?, jumped into this camera! I love. It very much!!Made the right choice", "Date": "July 15, 2013"}, {"Title": "i fell in love", "Author": "jonathon mcadam", "ReviewID": "R3DMTC3CKMKXTM", "Overall": "5.0", "Content": "I have used a nikon d5100 for awile and finally decided I wanted more mega pixels. The layout is awesome and I love my new camera.", "Date": "June 14, 2013"}, {"Title": "Wonderful Camera!", "Author": "Steven", "ReviewID": "R15EARRT4CCF7E", "Overall": "5.0", "Content": "I really enjoy this camera and has been a great upgrade from my old Nikon D40x. Picture quality is wonderful, focus is quick and responsive. Would be really good camera for novice or more advanced users.", "Date": "March 11, 2013"}, {"Title": "Now I am very disappointed", "Author": "STRAJ", "ReviewID": "R232KQFY5PYYIJ", "Overall": "1.0", "Content": "When I got this camera, I wrote a very positive review. Had only good things to say.Unfortunately after 2 months of use, I have a problem. I was about to shoot pictures and after I turned it ON, I get the following error message: Error: Press shutter release button again.I went researching this issue and I see this is a common problem in the various nikon camera series. So, buyers please beware.", "Date": "September 3, 2013"}, {"Title": "good but lacks phase detection in liveview and touchscreen", "Author": "A reader", "ReviewID": "R1B1YPT9E21555", "Overall": "3.0", "Content": "This camera produces great pictures and works well overall if you do not have specific needs. Two main issues if the autofocus system is very important for your purchase1- AF is really better than cameras like the EM5 only if you shoot via the viewfinder instead of looking at the screen (liveview). In liveview the AF does not use phase detection so focusing on moving things will be more a hit and miss like in all M4/3 cameras.2- the 39 point focus system is great if autofocus is able to know where you want to focus...otherwise you may have to move the focus point manually and this may take time with 39 points, especially if you want to move across the focus area. A touch screen would have been a perfect means to solve this issue", "Date": "March 14, 2013"}, {"Title": "Defective or not par with 5100. Test yours within 30 days.", "Author": "vj", "ReviewID": "R2R3WR5FS85H67", "Overall": "1.0", "Content": "I own a D5100 and 50 mm 1.8 G, absolutely  love every picture 5100 takes,the pictures are sharp in focus points.Recently i upgraded to 5200 thinking it will improve low light image capturing and better pictures and more focus points. But I was wrong, 5200 cannot produce sharp image with any lens i own (Kit lens, 50mm and 55-300). The picture is not sharp even at focus points regardless of settings. The images seems like taken from compact cam.Its my fault that I didn't test this camera within 30 days. I think mine is faulty but not sure.With Nikon warranty you have to have pay shipping cost for repair, so I would recommend everyone to test you cam within 30 days or you have go through all frustration and \"copy paste\" response from Nikon customer care (seriously irritating).1 start for Nikon and when the camera is repaired , i'll test and provide stars.", "Date": "February 7, 2014"}, {"Title": "Great camera, got the red D5200 for my wife and it is sharp", "Author": "James E.", "ReviewID": "R2UB3TERI6I7PV", "Overall": "5.0", "Content": "Nice camera, shipped fast, pictures are very clear. Wife was using the Nikon D90 and these pictures are better. She loves to take cross country and track photos and this seems to be it.", "Date": "October 11, 2013"}, {"Title": "Compact and sharp", "Author": "M. Winchester", "ReviewID": "R2FO9LBXZPKT1T", "Overall": "5.0", "Content": "I only had this camera for a short time (had to get the D7100 for its' more advanced features). But I felt it's metering was very good, the AF system offered much more flexibility than the D3200 I had been using and the 24mp was useful to me, allowing some cropping flexibility in post, if I needed it. I also liked how light it was - very convenient for day hikes.", "Date": "March 24, 2013"}, {"Title": "from d3200 to d5200", "Author": "Kenneth E. Epperson \"Kenneth E. Epperson\"", "ReviewID": "REOW6GC435IRK", "Overall": "5.0", "Content": "I originally purchased the d3200, after having it for a couple weeks found it just didnt have all the features I needed. What was an even bigger surprise was when I returne the d3200 for the d5200, not only did it have a lot more features that I needed, but seemed to me to be a totally differnt camera in several respects. I would say if you are looking for a first time dslr shooter, the d3200 might be a goid place to start, but if you have already owned any dslr before, do yourself  a favor and move up the the d5200 from the beginning, you will be glad you did.", "Date": "March 16, 2013"}, {"Title": "Nikon 5200", "Author": "b105984", "ReviewID": "RUIZRNYAOZXZ0", "Overall": "4.0", "Content": "I purchased this for my  son and daughter-in-law.  The price was very excellent and they have used it since Christmas and are very happy with it.", "Date": "February 23, 2014"}, {"Title": "Great camera for advanced non-professional", "Author": "DMB in NC", "ReviewID": "R3OQXM8REPSDKN", "Overall": "5.0", "Content": "Have had a great time with this camera since its arrival. Just got back from Charleston, SC which is a photographer's paradise, and the shots that I have examined so far are fantastic.", "Date": "February 21, 2014"}, {"Title": "Great improvement on my little point & shoot", "Author": "Madricucho", "ReviewID": "RV8VC5KHFCWIF", "Overall": "4.0", "Content": "Great improvement on my little point a shoot, still getting a hand on basic funtionality. Experimenting on Shutter and Aperture mode and raw format. Do not forget to by an extra battery and high capacity SD cards, I promess and update on this review when I get back from vacation .", "Date": "July 27, 2013"}, {"Title": "Great value with many useful features. Very satisfied with the initial evaluation.", "Author": "Thomas J. Drisgill", "ReviewID": "RTDLN8398I4KQ", "Overall": "5.0", "Content": "I first read the D5200 technical specs, features, and user reviews on Amazon prior to purchasing. Received the new camera with the 18mm to 105mm lens about two weeks ago.  Have taken some marvelous images while at Bayou La Batre, Al. and also at Bok Tower Gardens, Fl.  Still experimenting with the multiple settings and shooting modes.  So far, all images are at least as good as expected.  The D5200 with this lens is not too heavy, and has good balance. Menu's are easy to understand and to select modes to enhance shooting effects.This new dSLR was an upgrade from my Canon SX10is, Minolta d-Image 7, and still holding on to my film cameras Pentax 35mm SLR and Mamiya C330 twin lens reflex medium format.  The last two make good conversation pieces.", "Date": "June 2, 2013"}, {"Title": "Not like my D40X", "Author": "Kathy", "ReviewID": "R3EYPOVA9KTR1J", "Overall": "3.0", "Content": "I am kind of disappointed with this camera.  My D40X was fabulous....great pics and easy to use.  Until my granddaughter drowned it in the Atlantic Ocean this summer.  Don't get me wrong.....this is easy to use, has a lot of fun features that my old camera didn't have, but I just don't feel that the quality of photo is there.  When I shoot outdoors, they are great, but my indoor pics are really making me crazy.  Lighting very different from the D40X, and when I try to shoot scrapbook pages, I can't seem to square them up like I could with the D40X.  I will have to work with it, for the price I  paid, but I'm not truly happy with it and wish that I wasn't so glued to the Nikon name----should have looked at other brands before buying!", "Date": "January 14, 2014"}, {"Title": "excellent camera", "Author": "manuel", "ReviewID": "R1LDPVKKDLAE3Z", "Overall": "5.0", "Content": "like the functions, speed and image qualityalso the new quick settings are just perfect for family picturesthis weekend will go to the mountains and test it", "Date": "October 17, 2013"}, {"Title": "Takes great pictures out of the box", "Author": "Faust5", "ReviewID": "R25Y287T5GZ2WN", "Overall": "4.0", "Content": "This is my first DSLR, so I'm unfamiliar with most of the details of the device. However, just for taking pictures as though it were a point-and-shoot, the pictures are fantastic. I'll update this review as I figure out my product.", "Date": "June 19, 2013"}, {"Title": "Great camera!", "Author": "Brasewel Noronha", "ReviewID": "R1BNOBGP0I8U2L", "Overall": "5.0", "Content": "I bought this camera to learn photography and boy was I impressed. It's incredibly easy to learn and use and I have taken some fantastic photos. It's got all the features you would need as an amateur photographer and more. Additionally, it also takes great video.", "Date": "June 16, 2013"}, {"Title": "Nikon D5200 is excellent camera for the money.", "Author": "J. Sykes \"Photog\"", "ReviewID": "R1LO1W103KP9YP", "Overall": "5.0", "Content": "Nikon D5200 24.1MP Digital SLR Camera is very well make and the image its product better too. The color and tone is perfect and high MP is good enough for any publication or advertising project. I highly recommended to pick up grip for the camera for people who have a big hand. Video with continue autofocus with the Nikon lens is better than ever. You will not be disappointed.", "Date": "April 17, 2013"}, {"Title": "great camera", "Author": "arlene e. santana", "ReviewID": "R3D0PO1WW0VCQH", "Overall": "5.0", "Content": "lightweight and versatile.  i would recommend it to anyone interested in a portable, but powerful slr nikon camera.  love it.", "Date": "April 7, 2013"}, {"Title": "Upgraded to full frame", "Author": "Victor", "ReviewID": "R1E33APF98RCB7", "Overall": "1.0", "Content": "It had a back focus problem, 70% of my vacation photos were out of focus :( My point & shoot camera is doing much better. Maybe that was because of the Sigma 17-50 lens - I returned that too.I went for Nikon D610 after that. Full frame gives you those dream/art pictures that you love to set as a background on your computer. APS-C format is not close to that.Go full frame!", "Date": "January 14, 2014"}, {"Title": "Works great for video!", "Author": "Tad Hathaway", "ReviewID": "R3KCDN4HL2QXNC", "Overall": "5.0", "Content": "Very impressed with the video on this camera...didn't notice much difference between its video and the more expensive D600 or D800.  Here's some sample footage I shot in New Orleans during Super Bowl weekend.  [...]", "Date": "March 9, 2013"}, {"Title": "Very good camera", "Author": "Jose J. Pena \"East Side\"", "ReviewID": "R1RYGVCM50I1DH", "Overall": "5.0", "Content": "I love it, easy to use,I want it in a diferent color,thats why I ordere it in color red,everybody have the camera color black.", "Date": "October 29, 2013"}, {"Title": "Nikon D5200 24.1 MP CMOS Digital SLR with 18-55mm f/3.5-5.6 AF-S DX VR NIKKOR Zoom Lens (Black)", "Author": "rcg", "ReviewID": "R3LZ4KM6J3LJDC", "Overall": "5.0", "Content": "Nikon D5200 24.1 MP CMOS Digital SLR with 18-55mm f/3.5-5.6 AF-S DX VR NIKKOR Zoom Lens (Black) very happy with it so far.", "Date": "June 18, 2013"}, {"Title": "Nice comparing to Canon 650D", "Author": "Patrick M,", "ReviewID": "R3FUQFO6NI0TV8", "Overall": "5.0", "Content": "24mega pixels gives a lot more color depth and little less noise than the canon 650D (t4i). the 18-105mm lens gives it a lot more value over the 18-55mm.", "Date": "March 24, 2013"}, {"Title": "A Different Take with (unfair) Comparison", "Author": "Boogaloo", "ReviewID": "R1UBPMEVWS82G8", "Overall": "3.0", "Content": "Four Stars for features and Three Stars for results.  My bundle featured the dove-tailing AF-S 18-55mm VR and 55-300mm VR lenses in a kit for my wife to keep her out of my Canon 60D bag that was kitted with Canon's 18-250mm IS. I'm not married to makes/models or I would not have bought this Nikon.  I don't get into the weeds on menu layouts, materials and other subjective items.  I rarely shoot video and offer no comments there.  This Nikon is otherwise a highly featured camera, especially with scene modes, making it nicely serviceable from new entrants to those who like full manual.  I very much like its very hi-res screen display.  My typical shooting is in the arena during Texas style barrel racing events demanding high shutter speeds and accurate tracking focus that freezes the dirt in mid-air.I shot the Nikon with its VR 18-55mm lens this morning side-by-side with the Canon 60D / 18-250mm knowing it is not an exact comparison; it's what I had available.  There are, however, reviews here extolling this Nikon over pro-sumer models, notably Canons.  The subject was flower blossoms and bees providing for both stationary and high speed shooting subjects.  The conditions were morning light with cloud cover shooting in Aperture, Shutter, Program and Macro modes with equivalent settings.  The 24MP Nikon operated well, but in NO WAY did it's bundled lenses compete with the 18MP 60D kit.The results were very much equivalent to my first DSLR ... a Rebel XT with Canon's earlier and much maligned 18-50mm EOS kit lens.  However, shooting with the Nikon VR 55-300mm lens was more satisfying.  It still doesn't match the Canon 60D combo, which comes at a $600-$800 price difference. I call it 'satisfactory'.  Its minimum focus distance is longer than Canon's 18-250 IS; about 5-6 ft.  If I could only buy a Nikon kit w/ one lens, the VR 55-300mm would be it, while searching for a different wide angle zoom.  At best, the VR 18-55mm might work well as a portrait lens when 'soft' is desired.  Overall, I cannot agree that this Nikon kit is the equivalent of higher end models. That said, it is otherwise so nicely feature laden that it could be the only camera you'll ever need when it is equipped with higher caliber lenses.I see nothing gained with a 24MP model over the Canon 60D 18MP, which produces sharper images as a kit shot for shot. The megapixel wars are over in this camera class.  It's the lens wars that matter ... hold on to your wallet for that!!", "Date": "July 27, 2013"}, {"Title": "Great product", "Author": "David Nielson", "ReviewID": "RAETBA80ZFKFO", "Overall": "5.0", "Content": "Good buy. In great condition. Everything was included as described and the item was on time. 100% satisfied with this item", "Date": "October 28, 2013"}, {"Title": "not a pro but I love using it", "Author": "booboo", "ReviewID": "R278JFSURR48H2", "Overall": "4.0", "Content": "this camera is the best. although I've not use it to its full potential because I am an amateur. I took it to Europe this summer and took some amazing shots.", "Date": "July 28, 2013"}, {"Title": "Nice pics, weighs a bit too much", "Author": "Joe D", "ReviewID": "RKFUD2XYIM9IY", "Overall": "4.0", "Content": "This camera takes amazing pics, however it's not as light as I thought it would be. Make sure to get a wrap in vase it is dropped. Spend a little money on a bag as well.", "Date": "July 16, 2013"}, {"Title": "That's what it stars", "Author": "Vasily Nikiforoff", "ReviewID": "R1LG41WW870LCZ", "Overall": "4.0", "Content": "And I can because it's a nice camera and have a good zoom that's why I chose this camera or professionals for the shoes", "Date": "November 26, 2013"}, {"Title": "nikon d5200 uncompressed video out", "Author": "ickball", "ReviewID": "R3L0R4C867Z6YD", "Overall": "5.0", "Content": "why does not anyone tell that the nikon d5200 has a clean uncompresed video out at the highest quality??that is sooo important,,you can now record to a field recorder like the atamos ninja at raw video out with HDMI clean video output..that was the only reason i got this camera,,and on ebay it was 600 dollars,,that is a scandle that this is being sold so cheap,,the video on this is professional quality as good as the 5dmark2 or 3 and higher quality camcorders,,this video is that good,,the color is amazing and the sensor out put to recorder you can edit uncompressed video.just an amazing camera.why are people not buying this camera??because it has a plastic body,,???yes,,yes uyes,,people are stuck on looks just like everything else they deside on,,,well good,,that means i get to have a professional quality video camera for cheeeeeap...keep not buying the overpriced consumer stuff  cameras so i can pick the good stuff up,,,keep buying the more expensive with less quality,,,,go americans,,,,,idiots.", "Date": "August 28, 2013"}, {"Title": "Nice camera", "Author": "MLight", "ReviewID": "R2CS9E88O990RS", "Overall": "4.0", "Content": "I bought this camera as a replacement for my D3000.  I'm certainly not disappointed. It is everything that has been advertised and reviewed. The only thing I dislike is the articulated arm for video. However, it does stay flush with the camera when in the correct position. To me, they could eliminate this feature on a DSLR. I've run through about 500 shots on this camera so far extremely pleased with the result. I've been so pleased that I've included some 8x10's in my portfolio. If you're a serious amateur or just starting a professional career, this is a great tool for your business.", "Date": "April 2, 2013"}, {"Title": "Disappointing compared to real Nikon DSLRs", "Author": "Survivor", "ReviewID": "R1W9UU5DRB92TG", "Overall": "1.0", "Content": "Briefly, this camera has some amazing features.  The sensor gets a very high rating from DXO Mark, eclipsing the D7100.  The viewfinder is ok.  Not great.  The auto-focus in low light conditions is abysmal.  It is a very very slow camera in low light, or when put into high resolution JPEG/RAW recording mode.  When the camera is in live view mode, it slows to a crawl.  Don't expect this camera to capture action indoors under many circumstances.  The battery life is good, but you can't use the full range Nikon lenses and expect the camera to work its magic.  You need at least a G-class lens, I think, for the auto-focus to work.  A Nikon D lens will not auto-focus on this body.  The full-auto mode renders acceptable images, but it freely records at ISO 3200 indoors even in relatively well lit environments, which brings some unnecessary noise into the images.  I think there are less expensive point and shoot cameras that would do a better job overall.In sum, I bought this camera body because I wanted a lighter, more compact, DX format body with higher resolution and image quality than a D7000.  What a TOTAL disappointment.  If you're a beginner, don't buy this camera.  There are many better choices out there.Update: Nikon has replaced the D5200 with a D5300 as of this week.  Vindication of my assessment of this camera.", "Date": "October 7, 2013"}, {"Title": "Good PIctures, Poor Build, Dust Magnet", "Author": "MattBianco", "ReviewID": "R1VUJN19JU13LD", "Overall": "3.0", "Content": "This was an upgrade from my seven year old, still-alive-and-kicking-and-taking-great-pictures, Sony A-100 with an 18-200 lens.Pros:- great image and color accuracy- fast zoom- many \"effects\" that can make picture taking more interesting- a great all purpose 18-200 F3.5 lens with the kit I purchased- high quality videosCons:- Dust gets in the camera somehow. I have requested a return. After three days, I had dust visible and not cleanable, in the viewfinder- Menues and UI are very complicated relative to Canon and Sony DSLRs- AE lock not always successful- Some effects take forever to set up, such as B&W; with some colors excluded, will take 1-3 minutes to set up.- Location of the video record button is close to the shutter button, except you cannot use the viewfinder to video, only the LCD screen, for video. Therefore, all you videos are bump as you search for the button which is located somewhere totally useless and difficult to feel/find.- not able to record videos in 16:9 aspect ratio when every TV made in the last five years is 16:9- poor battery life (I got less than a 100 clicks and 3 minutes of video after a 24 hour charge)- cheap plastic build, including flimsy battery door- Price -given this is a glorified point and shoot- too many pixels -just a data hog- not enough camera.I wish my old Sony A-100 would take videos, and that it had better pixel count and better color accuracy. It is a lot easier to use, easier to hold, has longer batter life and better built -this camera is entirely plastic. I have dropped the Sony on solid rock several times but it has not affected it in anyway. With the D5200 you just have sense that it has to be held and placed on a table like you handle a 2 week old baby.I decided after the first day that given the high picture quality, I would live and master the poor UI and awkward button location for the video, and treat it like a precious child. It would be a price for high quality photography. However, when dust penetrated the camera after three days, I could not accept such a quality issue.I fell for Nikon as several of my photographer friends swore by the brand. In all fairness, they are all full size DSLR users. A journalist working for a local paper however told me that he switched to Canon 5 years ago, after 30+ years of being a Nikon fan, and has never looked back.I think I will go back to Sony, this time to A77.  Just the magnesium alloy body on that model makes a difference to me, with picture quality that is comparable.", "Date": "April 11, 2013"}, {"Title": "I love it", "Author": "Nichada Thinoiwong", "ReviewID": "RBISEDNEQSOJ1", "Overall": "5.0", "Content": "It's camera in my mind.I love nikon. I love color of camera. That's awesome for me. I will enjoy for my big picture.", "Date": "June 29, 2013"}, {"Title": "minor refresh of the D5100", "Author": "l2", "ReviewID": "R1HEPO1QVZ68TK", "Overall": "4.0", "Content": "The D5100 was a big improvement over the D5000. The D5200 is only a minor enhancement over the D5100, but at a much higher price. More AF points is an interesting change for some types of photos. More MP is rarely useful at this level. Stero mic on the camera isn't really important; use an external microphone if you care about sound quality. If you're thinking about a D5200, do yourself a favor and look at the Nikon D5100 also. You might find one for half the price (especially Nikon factory refurbished) and not notice any performance difference.", "Date": "February 2, 2013"}, {"Title": "Nikon 5200", "Author": "J. Cordero", "ReviewID": "R2N63EYK90TN21", "Overall": "5.0", "Content": "Hi everyone, I just picked up this camera from Costco on Tuesday.  They had it in a bundle for $1050.00 until April 27th.  It included the body(obviously),  both 18-55 and 55-300mm lens, the wifi adapter, Nikon bag, and 16 mg memory card.  This is our first DSLR and everyone we talk to tells us how great of a deal it is so we just wanted to share it with everyone.", "Date": "April 18, 2013"}, {"Title": "good", "Author": "Lynda", "ReviewID": "R38IUADLT80MNB", "Overall": "3.0", "Content": "love the camera and everything about it just that when i received the camera the lens was damaged a bit....kinda found out after few months later when i took a massive amount of photo because i found a weird mark on all the same spots on every picture", "Date": "July 26, 2013"}, {"Title": "Get the broken camera", "Author": "Eduardo Santos", "ReviewID": "R3D4IZCGYWROS6", "Overall": "1.0", "Content": "the camera is not in good condition because the camera shutter does not work and it is impossible to take photos. I am very upset -100 far have not given me any solution yet.", "Date": "March 5, 2014"}, {"Title": "Great Product, fast shipping......", "Author": "Eaglelax36", "ReviewID": "RPCCUVMX5C6DD", "Overall": "5.0", "Content": "I love the camera, takes great, clear pictures. The package came without any damage to the contents within. I have not had much time to reeally get deep into the camera and try out all of its features, but the camera is very simple to use. I recommend this camera for anyone who is wanting to upgrade from the traditional point and shoot cameras.", "Date": "March 9, 2013"}, {"Title": "excelente", "Author": "unouno", "ReviewID": "R2TF8XSACLOL6Q", "Overall": "5.0", "Content": "Excelente camara, muy facil de usar efectos buenos y creativos. Los puntos de enfoques son muy utiles y ademas excelente resolucion. Recomendada 100%", "Date": "February 2, 2013"}, {"Title": "Nikon DSLR D5200", "Author": "Matt Bacharach", "ReviewID": "R34S0DCQX4N4ZQ", "Overall": "5.0", "Content": "Read reviews for months before was available in the US. Worried about overseas suppliers. The camera is easy to use & takes great pics right out of the box. Can also use all my old Nikkor lenses - a bonus for sure", "Date": "February 19, 2013"}, {"Title": "Amazingly awful", "Author": "Hamid Moham", "ReviewID": "R5IXYUVHMGXHJ", "Overall": "1.0", "Content": "I've been used to the d3100 & I wanted a quicker, sharper body.  The d5200 I got I tried on my 70-300mm lens which I have used, with total satisfaction, for 3 years.The d5200 did not perform as I expected.  In fact the resolution & focusing mechanism was far inferior, compared to my old d3100.  I sent it back to the seller.  Thank you very much !!  I have no idea why others have a totally different experience.", "Date": "October 2, 2013"}, {"Title": "Where is the battery!", "Author": "M. Stephanie Kellerman", "ReviewID": "R1Z0ODWFOJSZJJ", "Overall": "3.0", "Content": "I know I ordered the body only as I already have other lenses so I didn't need a duplicate lens, but the battery for my D90 does not work with this camera.  I would have fully expected a battery with it.  To me that is part of the body!  Really irritated. I don't care if that page shows that others also ordered a battery with it.  That means \"additional\" battery to me.  My D90 came with a battery.  Why didn't this one.  This is a warning for those who want to buy this.  Now I have to hope to get a battery by Saturday.", "Date": "August 13, 2013"}, {"Title": "Love it! Except for the Fixed Pattern Noise", "Author": "A. Jackson", "ReviewID": "R2OAHM4M4LKFUN", "Overall": "2.0", "Content": "Let me start by saying I don't take pictures. This is just my opinion as far as the video features are concerned. The D5200 with a fast lens is a real dream camera. That is until you look at your footage on a computer and see the fixed pattern noise. It appears at every ISO and makes it a real pain to pull any detail from the shadows. There are ways to deal with it using software but it's time consuming and not a lot of fun. So, if you're looking to use this camera for video you should keep this in mind. There are a lot of discussions about this problem and I can confirm that the issue is real and hard to overlook.I hope Nikon tries to address the problem. If they did then I would have nothing but wonderful things to say about this camera. It's a shame.", "Date": "May 14, 2013"}, {"Title": "My Camera", "Author": "Djon jaunes", "ReviewID": "R3SYIBF3O4E0EF", "Overall": "5.0", "Content": "I am a novice when it comes to cameras and I really am trying to learn, I picked this camera because it was red.  I have taken  a lot of pictures since I bought the D5200 and I was amazed at how nice they turned out.  I have recommended this camera to others.", "Date": "March 1, 2013"}, {"Title": "Not like a point n' shoot camera, better.", "Author": "roaeja \"Hey you!\"", "ReviewID": "R1CG2O89YXPU2N", "Overall": "5.0", "Content": "Using a DSL is allot different than a point-n-shoot camera. It's a different mentality and user experience.Think of the DSR as a platform, for different lenses. In order to take advantage of its full potential, you need different lenses to attach to the platform body.The point and shoot has those built in. But, once you attach the correct lens to a DSR, then its magic will come out. It is a very precise platform, when attached to the correct lens, where as a P'n'S is not.I send mine back...they are coming out with a d7100, with better specs.\"Nikon has revealed a new enthusiast-level flagship DX-format camera, the 24.1-megapixel Nikon D7100. The much-awaited update to the aging D7000 has a professional-level 51-point AF system, and continuous full resolution shooting at 6 fps. Notably, the camera also does away with the optical low pass filter - meaning it should be able to capture sharper detail than cameras with a similar resolution.The Nikon D7100 has been given a specially designed DX-format (APS-C) 24.1-megapixel CMOS sensor (so not the same one employed in the D5200) which doesn't use the traditional optical low pass (anti-aliasing) filter found in most cameras. Nikon says this means it can produce sharper images that make the most of its resolution ... and presumably the firm is confident users won't suffer (too much) in terms of moiré and aliasing artifacts.Autofocus is another area where Nikon has significantly improved the camera. The D7100 uses the Nikon Advanced Multi-CAM 3500DX autofocus sensor module, and employs the same algorithm used in the Nikon D4. This gives what Nikon describes as \"professional-level performance\" from the 51 focus points (15 cross-type sensors), including speedy subject acquisition, and phase-detection AF down to a minimum luminance of -2 EV (really dark conditions).Using an EXPEED 3 image processor, the new camera has an ISO sensitivity of 100-6400 (expandable to 25600) and can shoot full resolution images at a not-too-shabby 6 fps, though the buffer capacity is only good for six frames in full 14-bit RAW (or 33 frames in JPEG fine and large).Interestingly, Nikon has also introduced a new 1.3x crop function which crops images, giving an extra telephoto effect - and taking it to about double the 35mm-format focal length. This is likely to be welcomed by sports and wildlife shooters, who will also benefit from the way focus points cover a wider area of the cropped frame ... and the increase in continuous shooting speed, which goes up to 7 fps. Cropped images are 15.4 megapixelsOn the video side of things there's Full HD (1920 x 1080) recording at frame rates of up to 60i/50i and 30p/25p/24p. Dropping the resolution to 1280 x 720 gives users the option of 60p recording. Video recording can be based on the full DX-format or using the 1.3x crop (both in an aspect ratio of 16:9). While there's a stereo microphone, videographers will also be pleased to see an external microphone jack and headphone connector.There's a 3.2-inch LCD on the rear with 1,229k dots, while the 100 percent coverage optical viewfinder has been given an OLED display (for the information under the image) which is said to be very bright and have low power consumption.Measuring 5.3 x 4.2 x 3 inches (135.5 x 106.5 x 76 mm) and weighing 23.8 ounces (675 g) the D7100 features magnesium alloy top and rear covers in a durable body which is dust, weather and drop resistant. For those who prefer their cameras with a vertical grip, Nikon has also introduced the MB-D15, which adds the usual shutter-release button, AE/AF lock button, multi selector, and command dials. It can be powered either by six AA batteries or the standard D7100 batteryThough there's no built-in wireless capabilities, the Nikon D7100 is compatible with the optional WU-1a Mobile Adapter which allows users to transmit images wirelessly to an iOS or Android device, or to remotely control the camera.While the numbering of the Nikon D7100 shows it's an update to the D7000, it's also possibly the closest thing the D300s is going to get to a replacement. Nikon is choosing to refer to it as the \"flagship of Nikon's DX-format HD-SLR lineup\" and it's hard to see what the fabled D400 could add ... other than a larger full-metal body and faster continuous shooting with a bigger buffer.The Nikon D7100 will sell for US$1,200 body-only when it goes on sale in March, or $1,600 with the AF-S DX NIKKOR 18-105mm f/3.5-5.6G ED VR kit lens.\"I mean for $300 more, why not get a better one?  Coming out soon!", "Date": "February 19, 2013"}, {"Title": "The good and the bad", "Author": "mongyaj \"Panasonic ZS7\"", "ReviewID": "R2GG3ZGUESTXZ9", "Overall": "3.0", "Content": "I think I have a bad unit. It would not take a perfect picture as it come out blurry. 2 out of 10 would come out good. Back focusing problem and completely blurry. There is no way you can tune it. When recording in HD, the LCD would glitch and freezing the video when you play back. I will return it back for a refund and will get the D7100 to see if it worth another $600... Look for lower rating because you will be aware for the up coming problem it may occur with the D5200.", "Date": "June 24, 2013"}, {"Title": "im soooooo happy", "Author": "Amazon Customer", "ReviewID": "R1TE22CLU3WGLA", "Overall": "5.0", "Content": "My husband bought me this camera for our anniversary because I take really good pictures, and my phone memory card is always full. I always act like I'm a photographer because my picture always look beautiful. Now I can be a real photographer AFTER I READ THE MANUAL AND FIGURE MOST FEATURES OUT. This is the first product that I ever had to read the manual fo. This camera has it all. The effects are mind blowing, it focuses on one thng and blurs the back ground. It zooms and it has a flash light built in for taking picture in the pitch dark. Omg I'm melting with excitement. Enjoy", "Date": "March 16, 2013"}, {"Title": "Nikon or cannon?", "Author": "Jeffrey m Snyder", "ReviewID": "R2W2HX69NGCBJA", "Overall": "5.0", "Content": "Who knows. I've been on an extended trip out west and I got to tell you people have cannons about 8 to 1.  Might mean something other than good marketing?  My camera seems ok. I'm just learning how to use it still, but can't say anything too negative about it", "Date": "September 23, 2013"}, {"Title": "Great little camera", "Author": "Adam Mueller", "ReviewID": "R3CU36Y8B9U6J1", "Overall": "3.0", "Content": "This camera is great for the beginners and the experienced photographers. I love canon but i tried the nikon and it is great. I use it from time to time but nothing compares to a canon.", "Date": "August 20, 2013"}, {"Title": "missing accessories, someone else's memory card", "Author": "jay", "ReviewID": "R35RA213GZUF5U", "Overall": "3.0", "Content": "it's a great camera.  the reviews are spot on.i'm just not sure how mine arrived in this condition.  it was missing a DK-5 Eyepiece Cap, the AN-DC3 Camera Strap, and the EG-CP16 Audio Video Cable.  But it came with a 2gb memory card, loaded up with someone's trip to DC taken with a D50.I can't easily contact Amazon about this.  My only option is to send it back, which I really don't want to bother with-- I want to use the camera.  Anyway, bummer Amazon.  I'm not sure how you did this, but you sent me a screwed up D5200.And if i tried to buy the accessories from you, it would cost me $28.44. No thanks!", "Date": "May 18, 2013"}, {"Title": "THe D5200 is just OK, but not great.", "Author": "CyberCat", "ReviewID": "RAJ7TY1YXW0AF", "Overall": "3.0", "Content": "After using a D 200 and several point and shoot cameras, I wanted to \"upgrade\". The D5200 is a nice camera, but not a great camera and certainly produces no better pictures that a good point and shoot camera in side by side comparison , shooting the same scene in close sequence. Despite the multi point focusing, the pictures all show only a clear central area , while the periphery is uniformly out of focus. close up pictures are all black and not useable. Even in bright sunshine, the camera requires the flash about 40 per cent of the time. The D5200 is comfortable to hold and carry.  Overall, for general photography, i.e., family , sports and outdoor scenes, I would not find a reason to spend the money for this camera .", "Date": "June 29, 2013"}, {"Title": "only takes nikon AF-S AF-1 lenses", "Author": "rb maui", "ReviewID": "R2XNTANE295E9W", "Overall": "3.0", "Content": "I Just received the D5200 and found it does not work with any  of my off brand lenses. It will only auto-focus with the proprietary Nikon AF-S and expensive Nikon  AF-1 lenses. I'm disappointed that I can't auto-focus with my new Tokina AF100-400mm. My D 200 works with just about every lens. The D-200 has an interior motor and the D-5200 apparently rely s on the lenses motor.", "Date": "February 2, 2013"}, {"Title": "Very bad in many points....un usable", "Author": "kay bhee", "ReviewID": "RAW5MOTW8TQG7", "Overall": "1.0", "Content": "too many problems, so after 2 hours of TestingDID NOT BUY this nonsense...a... Pix are NOT sharp. BAD LENS.you have to buy Better MOTORIZED LENS,so you need to budget few hundred dollars more...first they are dishonest to you, then you pay more for their greed.( i talk of garbage lens  AND non motorized body too,(oops sorry, amazon, is Garbage allowed inyour world ? )b.... iso, speed, aperature, etc...TOO DIFFICULT To changeas if some UNFORTHCOMING  engineer with Severe Logic problems designed this.compare to any other REAL camera by ricoh, fuji etc etc.in which  the above things are EASY to change, and you dont need an INSTRUCtion manualto do so....c.... this is class C type nikon, NO focus motors in the body...so you are blackmailed  yet again, you need to find motorized lenses...class B cameras also have same prob...only top end, over usd 2000 camerashave a cheap 20 dollar motor in them, in the camera body.extreme greed by nikon nowadays...d....if you plan to use manual lenses and focus thru tiny viewfinder,you will find it too dark to see that tiny green circle in left bottom cornereven with an f 2 lens.over the years, nikon doesnt give a HOOT for us,so better to drop them altogether now.TOo heavy in weight  and yet a bit big for smaller asian hands...remember this is half chip size, NOT full format size...even.nikon wonders why slr cameras aint selling so hot. duhhhfor this price,one has SO MANY OTHER Smaller options and sharper fotos, andEASIER To use logical menus.Try cameras from ricoh , fuji, pentax and even canon...best of luckthanks", "Date": "July 26, 2013"}, {"Title": "great!", "Author": "Juan Botero Londoño \"Juan\"", "ReviewID": "RI0FXJTAYJN9L", "Overall": "5.0", "Content": "Great camera. First available in amazon.com received 18/01/2013 with prime while in stores is available from 10/02/2013. Nice packaging.Battery is empty. So you have to wait before try the camera.The camera is not beautiful. But feels solid and is nice to handle.", "Date": "January 18, 2013"}], "ProductInfo": {"Price": "$699.95", "Features": "24.1 MP DX-format CMOS Sensor\n3.0 inch (921k) Vari-angle monitor\nEXPEED 3\n5 fps continuous shooting\n16 scene modes", "Name": "Nikon D5200 24.1 MP CMOS Digital SLR Camera Body Only (Black)", "ImgURL": "http://ecx.images-amazon.com/images/I/41QvMUWDRVL._SX300_.jpg", "ProductID": "B00AXTQQDS"}}