{"Reviews": [{"Title": "Why I 'jumped ship' from Canon PowerShot series to this Fujifilm S8200", "Author": "NLee the Engineer", "ReviewID": "R3TUC6A600IZEW", "Overall": "5.0", "Content": "I have been a loyal Canon shooter since the days of film SLRs over 20 years ago. In the past decade I have bought two Canon 'super zoom' cameras: the original PowerShot S1 in 2004 and the PowerShot S5 in 2008. Lately I'm itchy to get another super-zoom camera to replace the S5, because its 12x zoom no longer considered 'super' by today's standard. Naturally my first choice is another Canon PowerShot camera, either the PowerShot SX50 or the PowerShot SX500. After comparison, however, I decided to 'jump ship' and go with this Fujifilm FinePix S8200 instead. Here are my reasons why:- The Fujifilm S8200 is powered by four AA batteries. I prefer this design because I can use a set of Sanyo eneloop Pre-Charged Rechargeable Batteries in it, and keep another set as backup. In case of emergency, I can even use disposable alkaline batteries to power the camera. Early models in the Canon PowerShot Pro series (S1 to S10) were all powered by AA batteries. But latest models are using proprietary lithium-ion rechargeable battery packs. That means I have to buy another battery pack as backup, and also need to bring yet another dedicated battery charger for my trips.- The Canon SX500 (which is priced similarly) has a big disadvantage in that it is missing the EVF (electronic view finder). Using EVF on the S8200 makes it easier to shoot under bright sunlight, and it helps to hold the camera steady when shooting at super zoom.- The Canon SX50 has an EVF and offers a longer zoom range (50X vs. 40x). But it is also priced 50% more than the Fujifilm S8200.After playing with the S8200 for a few days, I'm very happy with my choice. For shooting under daylight, the image quality is good enough for most situations. Of course, the image quality at low-light cannot compare to that of a digital SLR camera, such as my Canon EOS Rebel T1i. This is to be expected given the tiny image sensor used in a camera this size (It's the law of physics: smaller sensor pixel area means worse signal-to-noise ratio). For low-light situation, I prefer to fix the ISO at 1600, and save in 'Small' (4MP) image size.Some other observations:- The zoom lens of the S8200 is physically much longer than that of the S5. See the pictures I uploaded to 'Customer Images' section for size comparison.- The S8200's lens makes louder noise than the S5 while zooming (the latter advertises \"UltraSonic\" on the lens)- The focusing is NOT maintained while zooming. This is the same problem I have with S5. In contrast, my Canon EF-S 17-85mm Image Stabilized USM SLR Lens does maintain focusing while zooming, but that lens is 2x the price of this camera.- The image stabilization mechanism works quite well. Note that both Canon and Fujifilm cameras use optical image stabilization which works equally well across zoom range. Other cameras (such as the Olympus SP-800UZ) that use 'sensor-shift' mechanism do not work well at high zoom.I have no problems migrating from my old Canon S5 to the new Fujifilm S8200. Most of the controls are either identical, or very simple to figure out. Basically I just pick up the new camera, set it to 'P' (programmed auto) and started shooting. On the other hand, there are still a lot of new features on the S8200 that I have yet to take advantage of. For examples:- Rapid shot of 10 frames in one second- Automatically capture 360-degree panorama- Shoot video in high-speed to playback in slow-motion, and so on.So maybe one of these days, I'll actually get around to reading the user manual...", "Date": "July 7, 2013"}, {"Title": "Awesome features!", "Author": "Karen Ford", "ReviewID": "R2DDLEH4AH0GU4", "Overall": "5.0", "Content": "This is my third Fuji camera, and I love the brand.  This particular camera is loaded with lots of features, from special filters to a 40xzoom.  And as always, Fuji cameras are user friendly.  I especially love the double zoom switch, one on top of the camera and a rocker style switch on the lens barrel, so you can use it right or left handed.  The picture quality is awesome, and the menu is easy to navigate.  I'm an advanced amatuer photographer, having over 40 years of experience with film and digital, and I have to say this is one of my favorite cameras.", "Date": "May 10, 2013"}, {"Title": "Fuji S8200 and the Nikon P520", "Author": "D. Baxley", "ReviewID": "R3MANKHUWBWD5T", "Overall": "4.0", "Content": "July 31, 2013I am trying out a Fuji 8200 and a Nikon p520 -- the Nikon's nearest competitor would be the Canon SX50 and both of these cameras are twice the money of the Fuji S8200 -- And guess what?  I think the Fuji S8200 can compete right along of them.  I am not a pro, far from it, but I am a consumer, sometime beach visitor, family reunion, grandpa, etc. kind of guy using a camera for the occasional sunset and kids running around -- yeah, close up facials too.  Anyway, in the hands of a novice like me the Fuji is the big winner.  I know, I know, the true camera buffs will be throwing fruit at me, but it is the real world I live in and I do not have the fancy equipment to test these thing, only my own physical attributes, as weak as they are, help me make the choices I make.  Look at it like this - how many times have you research, and research then bought the recommended product with Consumers Report's stamp of approval only to have the very same 5 star product fail you?  Never?  Then you are not a true consumer.  The rest of you know of what I speak.  Okay, so here are my reasons and my findings, minus the expert opinion - and often it is just an opinion.The Bad (cons) first:The Video Zoom can be tricky.  The image will break up as it tries to keep up with you moving (me) the camera wildly around form one subject or animal to another.  Stable shooting, leaning on top of a post, or car hood (how has time to set up a clunky tripod?  The images once stable are great.  Also, the zoom motor is recorded - definitely do not like that, it is noisy and hard to ignore.  Solution - do your zooming before you record.  I know it is fun to zoom in and out, but save your batteries.  Guess what?  The Nikon zoom is a wonder.  It is quiet as can be and will not appear on the sound track of your videos.  It also seems to handle the fast movements and focusing better.  My next biggest gripe for the Fuji is the tiny viewfinder, not as big a dime, and the image is so hard to frame and you feel like you are guessing a lot, but the pics once upload look great - update, after 3 days:  Later this announce dissipated as I became more accustomed to the viewing images through it and framing the shot I wanted, still, couldn't it be a little bigger?  The Nikon P520 and the Canon SX50 the same is true -- tiny viewfinders and I found the Nikon the most irritating for some reason and it made the Fuji seem better, but I have no reason why, they seem to be the same size.  Images coming out of the Nikon were crisp (sharp) but the colors seemed washed out a bit, the greens not so green and dry grasses (shooting some Elk in a Field) nearly invisible or faded out.  The Fuji seemed to burst with color, you could see the individual strands of grass and the various shades of green just popped off the screen of my Laptop.  I tried different settings but a pro would have to explain this to me, I could not see the reason why the much more expensive Nikon appeared to be weaker in this area - after all, it is the pictures we are after, right.  Perhaps, on some kind of photo analyzer the Nikon would prove to be the more accurate photo but when you put the two, same shots, together, under the exact same conditions of the exact same Elk - well, what can I say, the Fuji S8200 creamed the Nikon in my eyes.  The Fuji seemed easier to navigate the outer buttons and menu control, being slightly larger on the Fuji, except for the record button -- the placement is fine on the Fuji and I have gotten used to it,  but I found myself searching for it in my mad panic to get something on video -- the Nikon, however, has the record button is in a sweet spot and easy on easy off in such a natural position you have to love it.  The Fuji is a bit bigger than the Nikon and this would explain the somewhat larger control buttons. The sx50 Cannon falls somewhere in between, for size.  I have never used the canon, only played with it at the display table.The on-off switch of the Fuji is a simple pull (slide) button, easy to find and use.  The Nikon has a sunken push button that might give you problems is you are wearing gloves, but it has a neat feature, when it is on and LED light that lights up around the button so you can see if it is on or off.In the beginning I honestly tried to keep talking myself into the Nikon because of all the positives the pro photo picture takers give it.  After all, more money means better, tight?  Plus, I do like the compact, smaller feeling of the Nikon. But in practical, side by side use, by a grandpa novice the Fuji wins and I find myself grabbing for the Fuji first.From What I can See:Fuji S8200 - faster start up, really quick compared to the Nikon\\Zoom seem fasterShoots just as good in low light --Shoot HDR - for improved picture definition --Shoots 3D pictures -The camera bag with the Nikon is practically useless - maybe just for storing the cameraThe camera bag that comes with the Fuji is practical and useful - the camera can be carried in a ready to retrieve and shoot, it has a good cover flap with Velcro fastener for quick closure and retrieval, also enough storage for extra batteries and SD cards.  I guess the Nikon, in being smaller, they were thinking smaller?I found the design excellent and after a couple of days of shooting on the beach and off the pier at New, Port Oregon, I am falling in love with this camera - Fuji S8200, that is.  It has the coolest Panoramic feature that I have never seen before.  First the Panoramic setting is right on top of the camera on the selector wheel, just click and shoot.  Set the selector on Panoramic and press the snap button and release and begin panning around in a circle - it does it automatically.  You can do a 120 degree shot or a 180, or 360, very nice.Pricing:  Either the Nikon and Canon are way over priced or there is something terribly wrong with the Fuji and I just have not found it yet -- maybe the lens will fall out after a 1000 pictures?  Maybe, however, it is the Fuji that is fairly priced and it is Nikon and Canon that are trying to --- make money?  Fine, I'm not against making money, but one camera is $230 and the other two are $400 plus?Battery Powered:  The Fuji uses AA batteries as its power source and if you spend $9 at Bi-Mart, or Wal-Mart you can get a charger and four Nimh batteries that the manual says will shoot 500 pics -- every bit as good as the Nikon Lithium-ion battery pack -- but if you spent the extra dough and get a charge with the Lithium recharge batters the manual says it jumps to 700 pics which beats both the Nikon and the Canon in power savings.  UPDATE:  I bought a RayOvac NiMh recharge kit, came with four batteries too, for the $9 I had mentioned before.  After trying them out, well, the low battery light keeps coming on after a few shots, but I have ignored this for the past couple of days shooting.  It seems the after a few shots and some video the batter low signal comes on.  I shut the camera off and a few minutes later it seems to recover and I continue shooting.  Two days not and I am on the same batteries, and I have shot at least 200 pictures and 6 or more videos and zoom, zoom, zoom - the low battery light still comes on after a few shot but keeps recovering.  I think it may be due to the capacity of these cheap batteries may be lower than what is actually required.  But, they are working.  I am scouting out Amazon and have found some Lithium Batteries and Charger I will order with at least 2800 mh - Amazon, here I come again, no shipping charges, you have to love it.  I think the NiMh I have may only be 1,100 or 1,400 mh and look as I might I cannot find anywhere on these RayoVacs the mh levels - some kind of trade secret, I guess, or they are just embarrassed to say - but, after two days of low battery warnings I am still taking pictures.The Manual: The manual that come with this Fuji is excellent.  The Starter mini manual is definitely a Quick Starter - the real manual is on the disk and is about 130 pages.  It is loaded with info about this camera and its features.  Funny thing, about the Software, another reviewer said they did not like the fact you had to use their software to access you images?  This was coming from someone passing themselves off as semi-pro photographer, too?  This is not true at all, and I think most of us having used or not used the manufactures software know this.  The Images can be load straight from the SD card to your PC or Laptop and you can use any photo software you want.  You are not restricted as the other review suggested.  I have owned 6 digital cameras and have not like the photo software that came with any of them.  In fact I hardly ever use any of the photo software at all.  Film correcting, for me, takes place on the spot, retouching is old hat and most cameras, like this Fuji will do on the spot editing, even cropping and red eye.  If you want more then go for the DSLR type of camera.  I hear the Nikons are really good - I did try out the Nikon P3000, but I wanted more lens ($200+) and a macro lens, and a bag of filters and --- well, you get the idea.  I have all of this in the Fuji as does the Nikon and Canon SX50.After several days of use:The Fuji S8200 has a neat feature - located on top of the camera is a round, selector dial, and on this dial is something called the SRAuto, also where the Panoramic selection is on the same dial.  The SRauto setting selects the shooting situation for you - do not confuse this with Auto, which is good for us novices, too, but this setting goes a step further and actually moves to the setting for the condition you are shooting automatically.  For example, a bee lands on a flower and you hustle to get set up in Macro for a close up - bee flies off - with a DSLR you have to crack out another lens - with the Nikon and Canon you have to find the Macro setting - with the Fuji you just zoom in or move in and take the picture.  With the SRAuto set, you are automatically set into the macro mode just by going for the shot, incredible - not absolutely perfect, but close and more often than not.  Does it work?  You bet it works.  How do they do it?  Beats me, but it does work.  You are taking pictures of flowers and you look up and realize how beautiful the mountains are, you point the camera at the mountains and it automatically reset to the settings for shooting distant mountains.This camera also has a \"Features select\" call the Adv setting on the selector wheel, and from this setting you can go crazy.  Super Low Light shooting, 3D pictures and a whole range of other types of shots.I have only begun to explore what this camera will do.  If, however, you want to be the total master over your domain (God's creation, really), and you thirst for full creative license, then go buy a Nikon 7000, for over a $1,200 (on Sale), or maybe a Nikon 5100, then buy some expensive lenses to switch in and out for the particular purpose you are looking for.  I would advise the pro photographer to get one of these cameras to shoot pictures with while their assistant is setting up their Pro camera for that once in a life time shot.  Oh, look, a butterfly, look at that bird and those clouds, and that lizard on a rock - hey, assistant, have you finished setting me up yet?As for me, grandpa shooting snotty nosed little grand kids, the occasional sunset, and playing like the pro photographer and getting some really great shots, this camera might be the one for you it is turning out fine for me.  I have set the Nikon aside and will return it, as per the return policy Cost Co offers, with no hard feeling - I bought the Fuji at Cost Co also and see the price at Amazon to be compatible with them.  If, however, you want the Nikon then by all means, buy from Amazon and save nearly $80.I promise to update this review if the Lens falls out, or some other event, proving you pay for what you get.  So far this Fuji S8200 is proving to be a reliable and well built camera with fantastic features and abilities beyond the norm.  Love it.  Okay, Fuji, where is my check?  Only kidding, I really am a retired retail clerk and grandpa with real world experience.UPDATE - 09/10/2013:  After taking many hundreds of wedding pictures -- we traveled to Bend Oregon to attend two weddings.  This camera preformed as expected -- great.  Still, while the view finder was a life saver in the bright, high desert sun, if you know Bend in the summer, the view finder was a real pain.  Really small and hard to see through.  I felt like I was guessing a lot but it did help get me on the shot I wanted but I could not tell if it was going to be a great shot, a clear shot, until I could review it later.  This has become such and issue with me, because I wear glasses, that I coughed real hard and upgraded to a Canon Rebel T3i, which I love -- then I better love it at twice the price of the Fuji.  The Zoom of the Fuji was so great I had to then buy another lens for the Canon so I could enjoy the same kind of power.  It helped that I found this Canon marked down, for some reason.  Wal-Mart apparently did not want to carry this camera anymore and marked it down to $450, which is strange, as my home store Wal-Mart still sells this camera for $699.  This Canon came with the 18-55mm lens and works great and is about equal to a 3-4x zoom.  I went on line and found the 75-300mm canon lens for $100 and just got it the other day, and love it.  I have nothing bad to say about the Canon Rebel T3i -- the view finder is marvelous (think Billy Crystal), just marvelous my dear.  What a nice camera, pretty easy to use and under stand.  Still, the Fuji was only $240, and believe me, it is a lot of camera for the money and the pictures?  Well, I have everyone from the weddings requesting copies and I see some of them showing up online -- everyone was taking pictures, mostly with phone cams.  I only wish I had had this Canon then.  Peace, Dan", "Date": "August 7, 2013"}, {"Title": "I wanted to love this camera but I compared to the Nikon Coolpix L820", "Author": "Fdo Shopper", "ReviewID": "R21OJUBJIDWKMW", "Overall": "3.0", "Content": "I bought the Nikon COOLPIX L820 16mp but wasn't happy that it didn't have a view finder.  So, I purchased the Fujifilm Finepix S8200 and did side by side (picture/picture and video by video) comparisons.I think you should know I wanted the Fujifilm to win, it's just so much more fun to use....it has a programmable mode dial, fast picture shooting is a little quicker than the Nikon's, easier to do 360 images, view finder (although a little cheap) is a nice plus, 40x zoom, feels better in your hand etc..Image, Video- The Nikon was the clear winner for image and video quality no matter what the ISO/light, by leaps, pictures are clear, video quality and frame rate are excellent and on par with a dedicated video cam.  In both comparisons the Fujifilm had more noise and colors were either washed out or too dark (I tried adjusting the settings and the gains were minimal).Audio - Nikon wins.  The audio from the Nikon is clear and audio capture/output is on par with a video cam.Low light (no flash) - In low light there was no comparison, the Nikon's ability to brighten and color with significantly less noise than the Fujifilm is borderline amazing.  I took a photo of my dog at the entrance of our apartment at night with only ambient light behind me, the Nikon produced detail I couldn't see with the naked eye and Fujifilm could even render the my dog.Low Light (w flash) - The Nikon wins.  Pictures are quick to take, the Flash is accurate, colors are rich.  The Fujifilm does a good job but when compared to the Nikon, the images look washed out and grainy.Image Stabilization - Nikon wins.  Both set to 30x zoom and the Nikon made taking photos a breeze while the Fujifilm required significantly more concentration for a steady hand.30x Zoom v 40x Zoom - This is deceptive because one would think at full zoom you would see more detail from the Fujifilm, not the case.  When both cameras were set to 30x zoom, the Nikon was the clear winner, it's shots are significantly clearer with better colors.  I did a 40x and 30x zoom comparison whereby I increased the Nikon's captured image to match the scale of the Fujifilm's captured image at 40x.  Results: Fujifilm's 40x could not better Nikon's 30x for detail...big surprise.SD write speed - Both are fast in good light.  In low light the Fuji is a little quicker but the image capture is not the same quality.Battery Life - Both have excellent battery life. For the Nikon, I finally ran out of juice after 400 or so images and 12 mins of video.Bottom line Nikon Coolpix L820 - The Nikon is just a very good camera in all respects and excellent value.Bottom Line Fujifilm FP S8200 - The Fujifilm S8200 is OK.  It came close to matching the Nikon's image quality when outdoors in bright conditions.  Ultimately, you get a little more than what you pay for.I'm glad I compared the two and now totally OK with not having a view finder. ; )", "Date": "September 11, 2013"}, {"Title": "s8500 camera", "Author": "Paul Oman", "ReviewID": "R2O6QDI4XZYXO4", "Overall": "5.0", "Content": "This camera replaces an old finePix s5100 I've had and enjoyed for years. I am very happy with this new camera. It feels good and appears to be as well built as my s5100 which had a 10x zoom.A bit disappointed in the 46X zoom, which was a main reason for the purchase. Zooms are pretty cool up to about 10 or 15X but then the image only seems to 'enlarge' a small amount for all that extra zoom. But is nice is the other end, without the zoom (equals a 24mm lens) which is sort of wide angle. I like that!There are 10 shooting modes with different options in each. The most simple is a easy point and shoot mode.There are 2 zoom buttons. You can set one to work faster or slower than the primary zoom. It is nice to slowly zoom in.What help convince to buy another finepix camera is that they use 4 AA batteries - easy and cheap to find and buy and carry a spare set. No need to recharge some funny battery that probably will not recharge in a few years - or might not even be available. Also I like looking through a view finder rather than a screen. Maybe I'm just old, or my vision isn't that good, but having both options is a must have.For me the $300 cost was a lot of money, but I see similar cameras selling for $600 or $800 and I don;t really see what all that extra money buys - maybe just a classic camera brand name.After setting all my personal options etc. I found pictures turn out to be about 7.5 megs and that my 32g memory card can take about 2000-2500 pictures. Great numbers, especially since I use most of the pictures on a web site where I reduce the picture size to about 100 meg.good camera!", "Date": "April 30, 2013"}, {"Title": "Very versitile camera", "Author": "Steve Sleightholm", "ReviewID": "R1M9SAN0PMDPI5", "Overall": "5.0", "Content": "I travel to Europe on occasion and I have always wanted a camera that has a wide aperture for low light conditions and shallow depth of field, a long lens to eliminate the changing of lenses for those objects that one can't readily get close to and a F2.9 28mm wide angle lens for those interior or close image opportunities.  This camera offers all of that with the longest telephoto that I have ever encountered on a PS.  In addition - the zoom feature is extremely fast and quiet.  When combined with a 16.2 meg processor that provides tremendous resolution - I could not ask for more for the price.  There are many more features to the camera, however, just about all camera manufactures are offering similar within the same price range.", "Date": "September 7, 2013"}, {"Title": "Nice, fast camera for about $300", "Author": "Michelle", "ReviewID": "R2O0YFSY7APS22", "Overall": "4.0", "Content": "This review is an initial impression from a long-time Kodak EasyShare user. Every camera I have owned had its strengths, its weaknesses, and its places that improve with a learning curve. The FinePix S8200 is no exception.The fast menu displays and easily pushed navigation are sure to be assets once I figure out the basic layout of my new camera. But for now, I am lost. I cannot read and understand what is going on before the screen changes. Here are my other pros and cons:Pros:* I got some nice shots with good color and detail!* The bigger size is not as awkward / heavy as I was afraid it would be.* You can leave the lens-cap on when you are not taking pictures. (to review / set the menus)* No bright/blinding autofocus light. With my previous cameras, a bright autofocus light made it hard to sneak pictures of kids and pets just being themselves. And family members with sensitive eyes would complain, even if I turned off the flash.Cons:* Lighting - Pictures taken in low light come out much darker than I expected. Pictures taken in bright light are more washed out than expected. And the sunset picture I took ... I have no idea how the sky showed so dark!* Focus - Pictures taken indoors with auto and party setting did not come out as clear as I expected. Hopefully this will get better as I learn to work with the camera.* Colors - Regular shots do not have as much contrast as I am used to. The pop color doesn't look right. And the partial color under advanced filters is buggy. I took a picture set to show red of my daughter holding a large red heart. EVERYTHING showed up gray. Took another picture of some pink liquid (still set on red) and about half of it showed as pink/red. Took another (yellow) of my daughter in karate class. Her yellow hair tie and yellow belt were highlighted, but so was a portion of her brown hair.* Doesn't have all the fun/easily accessible features as I am used to.* I don't like the 1080 interlaced video. I prefer 1080p for crisper views when I click pause. Works fine at 720p.Overall, I still give this camera a 4-star rating. I think it will be excellent when used in the right conditions. I just have to figure out what those conditions are.", "Date": "March 18, 2013"}, {"Title": "Purchasing a Fujifilm FinePix S8200 Digital Camera", "Author": "Thomas", "ReviewID": "R2VLBJRN56ULUY", "Overall": "5.0", "Content": "I was in the mode of replacing a $350 Nikon camera which had been dropped on a very hard surface. Several weeks were taken researching different camera brands on line and with users. During the process the sight was found relating to the marketing of the Fujifilm FinePix S8200 16.2 Digital Camera. With further research, several different price ranges were found. I read all reviews I could find relating to this camera. Then I visited with one of my son-in-laws who is a real Professional Photographer. All specifications were discussed. Knowing my camera skills and future usage, he provided a positive word relating to this camera. When I share the favored price found, he assured me that it was a very good price for a camera of that quality. Having used this camera for about a month, all the negatives listed in the reviews have not surfaced. I am very pleased at its flash-less low light results. I was very pleased finding the power zoom 40X. With the absents of fingers from my left hand, the locations of camera controls and design of the main cabinet frame enables a comfortable one hand operation. The neck strap provides camera drop security for a hand handicapped individual. I am looking forward to many years of enjoyable service with this camera.", "Date": "October 2, 2013"}, {"Title": "An excellent alternative to a SLR", "Author": "John W. Cecil", "ReviewID": "R1QE0WTT9V6WW3", "Overall": "5.0", "Content": "Camera handles well, has many features (many of which the average user may not use), images are superb. The supplied printed owner's manual is minimal. Printing a complete manual from the included DVD takes care of that problem, however. The menus are a little confusing, but when all else fails, read the manual. The quality of the images and the associated image stabilazation make this a terrific instrument. The video is easy to use as well. The CMOS sensor allows very good sensitivity while color fringing, an artifact of CCD sensors, is essentially non-existant. My Nikon D 80 DSLR wil not need to be replaced with a later model any time soon", "Date": "July 8, 2013"}, {"Title": "It's the best Fuji I've ever had.", "Author": "Leonel Morales", "ReviewID": "RFQC950UEU9SF", "Overall": "5.0", "Content": "The zoom is incredible!!, you can take pictures with an acceptably resolution to 46x, and the start is so fast.", "Date": "October 6, 2013"}, {"Title": "Good camera but.....", "Author": "Maciek Fulton", "ReviewID": "R1DDNFOXYFVXX1", "Overall": "4.0", "Content": "Great camera, amazing zoom, fair video capture (the high speed capture is useless since it records at 240p). And the auto focus is ok, but is to fast when taking videos. The auto mode is quite good as-well. I did not buy the camera from amazon, since amazon was $50 more then my local camera store. This camera is great if you are taking pictures outside or in medium to high light.The camera lacks good quality low light abilities. The camera fails at low light tests. The pictures have so much noise in them that even using professional programs in Photoshop (like noise ninja) don't help that much. The ISO needed to be turned down to 100 to even get a fair picture inside (the camera should only have to be set to 800-1600 to take a good low light picture). And if you turn the ISO down to 100 then your going to need a tripod to stay sill for 1.5 sec or your picture will become blurry. It is impossible to hold the camera still for that long with out a tripod. I have a $100 Sony point to shoot that takes better pictures inside then this camera. This camera looks like someone took the picture with a smartphone when in low light..... The build quality is great and the viewfinder is not 1/2 bad. The screen is also not that bad, but you should really only use the view finder so that you can save some battery.I would recommend this camera as still the best Bridge SLR out there for under $300. But if you can save up some cash, I would recommend the SONY DSC-HX200VB, or another high end Bridge SLR.--------------------------Update 8/12/13I gave the camera one more star (4/5)After using it some more, I compared the pictures to other bridge SLRs in this price range and found that it was one of the best IN ITS PRICE RANGE. I would still recommend getting a higher end Bridge SLR or even a normal SLR if you can afford it. But if you don't want to spend more then $300 then this is the camera for you. If you are wondering, there is no underwater housing for this camera :( Anyway I uploaded a total of 30 pics to amazon but they don't seem to be uploading all at once, I think they just need some time to get approved. Here is what I mean by the bad low light ability.Here is a pic from the S8200 in low light, notice the noise.[...]and here is the sony Cyber-shot DSC-WX9 ($100 point to shoot)[...]", "Date": "July 14, 2013"}, {"Title": "I like it a lot.............................", "Author": "Dragoslav T. Marcovich", "ReviewID": "R2SOJHIN65Y10U", "Overall": "5.0", "Content": "Bulkier than the s1000 and s1800 it is the equivalent of the s6800 but with a viewfinder as well as 3\" screen. There are 3 versions of this model; s8500 (Europe), s8200 (USA) and s8300 (the rest of the world??) with minor differences in zoom power. The camera feels very good in both hands, it is ergonomic, for super sharp pictures (maximum pixels) above X20 one needs a tripod or a 'bean bag' but there seems to be image stabilization in lesser pixel modes (sporting events) so that action shots are sharp. The macro feature is fantastic and the camera comes with several \"artistic\" modes [soft focus, vignette, diorama, etc.]. I believe it is well worth $310.", "Date": "April 27, 2013"}, {"Title": "Great Camera for the price, easy to use, nice and compact. must read maual and play with camera to learn advanced features", "Author": "Cat Mom \"Jean\"", "ReviewID": "RITQE99TVKFAV", "Overall": "5.0", "Content": "I love his camera for the price. This camera is great for an Amateur photographer. This would not be for a experienced photographer. If this purchase is for a family camera anyone can use this camera. A more advanced shooter than an aim and shoot to using manual settings for a more advance Aim and shoot features. You must read the manual play with the settings to take pictures to get to know this camera. The way you change your ISO settings in the camera for a particular shot does take great pictures. My husband does not get into picture taking and I can set it to the automatic setting for him and he can take great pictures with it. I am more advanced than Aim and shoot photographer for enjoying leisure photos of places I go. Love this camera for the size and not bulky  or heavy. Fits in small hands well. The best part I love is have great zoom capabilities and no camera lenses to lug around. This camera has a setting that you set for the 3 different types of batteries you can use in this camera. You can use an expensive photo battery, 4 Lithium batteries or 4 Alkaline batteries in this camera. I found the most affordable and easy accessible batteries and last a long time is Energizer Ultimate Lithium batteries in this camera. When set the type of battery you have in the camera makes the camera have excellent battery life. Most cameras I have seen don't have that feature and battery usage is a very important feature in a camera. That is why I chose this camera over Cannon was the battery life reviews. This camera has excellent reviews on battery life. I am very pleased with this camera and have no regrets with this purchase. To get the best quality pictures with this camera you must take pictures play with the camera to learn all that it can do. You will not be happy if you just use the basic features to get the best potential and great snapshots with this camera. It took me a few times out to find a great setting for exposure, shutter settings etc. in the camera for my own liking. Make sure you play with the camera and you will be an excellent picture taker and pleased with this camera and what it can do in a compact camera all in one. Make sure you fill out the registration card with Fugi for excellent warranty experience. And lastly this camera does not have WiFi uploading to facebook technology. Which actually you can do just as well uploading to your special website using the USB card reader for easy transfer of photos to save them to your special hard drive or special online storage of your photos. Why do you need a special camera to do Wifi when most people have cell phones to do that? Better security when you have more control how you upload your photos. I would rather spent less money for a camera that takes great photos than paying for a feature to do Wifi technology. Simpler the better for a camera that takes great pictures. One thing with this camera it would not be good for the beach getting sand in it. Highly recommend getting a small affordable water camera for the beach snapshots.", "Date": "November 14, 2013"}, {"Title": "Best camera ever!", "Author": "Thomas Shumadine", "ReviewID": "ROV9PV09FRN4J", "Overall": "5.0", "Content": "I have had 3 other ultra zoom digital cameras and this is by far the best.  Excellant for outdoor scenic photos.  I love the 46x lense, very crisp and clear. Also very good on batteries.  I took over 1200 pictures with my first set of AA batteries.  Colors are vivid yet natural.  Very good buy for the price.", "Date": "October 13, 2013"}, {"Title": "Amazing", "Author": "charlie page", "ReviewID": "RM77NGN27SSMX", "Overall": "5.0", "Content": "Amazing buy for the price. It's a professional camera that novices can use easily. The pictures come out amazing and it's one of the better buy's i've made.", "Date": "July 17, 2013"}, {"Title": "Great Camera!", "Author": "Edgar_C", "ReviewID": "R2Z5QEJVVFM6UL", "Overall": "5.0", "Content": "this camera works great!!, I can take great pictures (at least looks great pictures to me), a lot of features and I don't need to carry different lens .", "Date": "July 7, 2013"}, {"Title": "Nice 42x Camera!", "Author": "C. Garza", "ReviewID": "R1L6PSR94J1STT", "Overall": "5.0", "Content": "First off, this camera is exactly like the Fujifilm FinePix S8200 16.2MP Digital Camera with 3-Inch LCD (Black) and Fujifilm FinePix S8500 Digital Camera 16MP, 46x Optical Zoom (Black) with the difference being that those have 40x and 46x zoom, respectively and this one has 42x zoom.  I just mention those other 2 because they have far more reviews, sample pictures, and questions asked than this one (not sure why) even though they function exactly the same (minus the zoom difference).  You should check those 2 out to get a better idea of how this camera will function.  Anyways, I got this camera as a gift and couldn't be happier.  I really like the long zoom and the pictures are really nice as well.  This is not an SLR but it also doesn't have an SLR+equivalent lens price.  However, that does not mean it doesn't take nice pictures.  I really like that the lens is the equivalent to a little over 1000mm lens, something that would cost way more if investing in an equivalent lens in an SLR.  In the meantime, I'll try to post some pictures on this particular flavor of the S8XXX.", "Date": "October 31, 2013"}, {"Title": "GREAT shooter", "Author": "GrMa CiCi", "ReviewID": "R12JM87ARHQ4WO", "Overall": "5.0", "Content": "I am always looking for GREAT pictures whether it be wildlife or rainbows-Quick on the spot AND absolutely love the 3\" LCD and option to change it to the viewfinder because of glare at times AND the viewfinder helps steady your ZOOM focusing- Lots of features to choose from!  I have had two comparable Nikon SLR cameras and the quality of this Fujifilm S8200 is just as good BUT the price is even better-40X zoom is unbelievable. Takes a steady hand or tripod with the 40X ZOOM=quality shots/quick and easy to use-I love the AA battery feature-You can always find a fresh-new AA battery, I purchased the Fujifilm FinePix S8200 Digital Camera Battery Charger Replacement of 4 AA NiMH 2800mAh Rechargeable Batteries, with Charger from Amazon.com at the same time and it has already saved me even more $$ and works SUPER GREAT.  I am thrilled with my purchase.", "Date": "August 4, 2013"}, {"Title": "very good \"bridge\" camera", "Author": "Diane M. Johnson", "ReviewID": "R3TK8TSLNQY6NJ", "Overall": "5.0", "Content": "Takes very clear pictures, has plenty of extras that a regular point & shoot doesn't have.  A good transition from a P&S; to a better camera without the price of a SLR.  The added electronic view finder feature is helpful in bright light picture taking.  The menu allows the average photo buff to do more with picture options that are usually found only on the more expensive cameras.  Camera has good balance and not as heavy as it appears, in fact, it is fairly light , considering it's capability  and 40x zoom.  Very good camera and price, if you don't mind the larger size, and want to step-up in quality and features without spending big bucks!", "Date": "May 19, 2013"}, {"Title": "MY FUJIFILM S8200 REVIEW", "Author": "JAC", "ReviewID": "R3L75LWQQ6UDK9", "Overall": "5.0", "Content": "WHAT COMES INSIDE THE BOX:- the camera body with fixed lens- lens protector or cap (which have to be removed manually to take pics)- Manual (very usefull it is a must read) and CD with bloatware (i will never install any program just for upload my photos to facebook... never! its just my opinion)- and a neck strap (this one is actually very sturdy)EXTERIOR:Ok let start this review saying that this camera feels, weight as much, and looks like a DSLR even my friends tryed to remove the lenses once, so Funny:), its built quality  is good, it feels really good in your hand, it has leather covers to rest your fingers of your right hand, and the plastic band around the lens is used to be rested on your left hand (for long range-zoom shots) please note that the band has no useful purpose other than stetic or to give a better camera grip, (is not a manual zoom or anything like that)BUTTONS:Very well thought buttons, they are so easy to remember even when looking inside the EVF (Electronic view finder) i configured the right zoom button to be fast and the left side lever on the lens to be a slow steady zooming button.the FN button or up button of the camera is a custom button it comes customized as an ISO button, and i left it that way.there are 3 buttons that are specifically designed for: 1 rapid shot modes, 2 white  balance, and 3 camera recording (this last one let you record in almost every mode your have selected using your preferences, and you can still take some photos)and finally theres a flash pop up button used for logic reasonsAll other buttons are standard on almost all cameras so i wont make you lose time reading about them.INTERFACE:If you have used a sony camera the menus will look ugly, you can select some colors, i went with black, but they are still usefull so i dont mind you can scroll using the analog buttons and a scrolling ring.SCREEN AND EFV:Not really the strong side of the camera, the colors look ok and the resolution is decent, the LCD has a sun mode to increase brightness but it is still limited, that is when the EVF comes to live and you notice it has a very low resolution but still good to take some good shoots, (remember to calibrate it before use otherwise you will see everything blurry) and this is ponit in favor to this camera for the price few bridge camera feature a EVF.ZOOM:this is the strongest side of the camera along with its features, almost no loss in quality but with less contrast and bright in the pictures when using it at maximun, the zoom is nice and good, its like using mi old telescope but clearer and with a more steadier movement (thanks to the camera systems) but still, it is highly recomended to use a tripod for max zoom shots.PICTURE QUALITY:Its Decent-good ive seen better and worse its like a canon sx 510h 12mp picture enlarged to 16mp but with less contranst (the two cameras use the same sensor size), super macros (1cm) are unique and impressive, long range pictures are good, wide angle pictures are good at ISO 100  and in fine settings, try to never use ISO above 3200, you have been warned.there is no RAW format to be selected keep that in mind. fine format uses about 7mb each picture, and normal format jpeg uses 5mb each picture. if you want some example pics or a more in deep review go here: [...]in my personal use i have purchased the camera with a HCSD class 10 of 32GB that gives you around 4000 pics in fine setting or 7000 pics in normal settings in 16mp and 2 rounds of eneloop batteries (4 batteries each) that will last you 600 pics each.VIDEO QUALITY: (IMPORTANT IT IS GOOD)there are so many reviews that have negative scores about this feature just for the zoom noise, there was a mayor point in favor (1080p\\60fps) and in con (noisy zoom when recording video)in my experience with this camera i can tell you this 3 things that will help you a lot in videos: 1.- The video quality and speed is awesome the stereo sound is good, 2.- if you dont want to hear the zoom, just change the settings from optical to digital zoom and it IS SOLVED (IT IS THAT EASY), and 3.- important you can only film in full HD clips of max 30 minutes it doesnt matter your memory card capacity.and lets not even mention the high speed video at 320p look terrible but still a feature to be playing with.FEATURES3d shots .- you are supposed to take 2 pictures of the same object in different positions, it can only view them on 3d certified devices (not this camera) i ve never tried it so no comments hereburst mode.- up to 10 fps in 16mp and only 3 in max quality settings, and 30fps or more in 3mp.auto advanced mode.- automatically select the best scene in 6 modes, kinda usefull for macros and portrait.some filters: toy camera, and othersMY FINAL CONCLUSION:this camera is a steal if you compare the price i got mine on amazon for about 185 USD, even the canon sx510h or nikon have a better image quality (a friend of mine have one) but does not come so well feature packed as this one for the price. best features: zoom and price (for the price everything looks good)so i recomend it****° 4,5 stars :)hope to help you! i will update if i experience any problem with the camera, 1st month, so far working fine, i will test it on an trip to galapagos islands.Some Tips:Buy this camera with:- A tripod (i got the pedco ultrapod 2 with velcro)- 2 kits of 4 AA rechargable batteries (i got eneloop with charger)- a 32 gb SD Class 10 (i got trascend for the price)- and a case for all, i got a case logic compact system/hybrid camera case, and believe it or not it is smaller than i thougth and still i can carry all the accesories i had mentioned before, 8 AA batteries, charger, tripod, camera, with no problems but there is no space for more items and the tripod legs are outside the case but i can live with that :)and i am sorry for my english i am not from an english speaking country so i tried my best to give some information to you.", "Date": "May 6, 2014"}, {"Title": "Simply Terrific!!!", "Author": "Grandpa", "ReviewID": "R2VUWDTO2YZP3C", "Overall": "5.0", "Content": "I decided it was time for a new camera.  I had three fundamental requirements going in:  1) viewfinder, 2) AA batteries, and 3) long zoom.  I spent quite a bit of time reading reviews, contemplating, and comparing cameras.  When it came down to it, there was no other option.  The Fujifilm S8400W  was the camera for me.  So, I ordered it.  My old camera is a viewfinder Fujifilm with AA batteries and I had a great experience with it, so I was comfortable with the decision.The camera came today, and my wife and I spent two hours taking photos around the neighborhood.  I'm in awe.  I was able to take handheld photos at full zoom with no visible shake.  I timed the camera from off to \"ready to take that shot\".  It was fast ... more than fast enough for me at less than two seconds.  I tried a wide variety of settings and options.  It was easy to change settings.  I took about 300 shots, including some full-HD videos, and my rechargeable AA batteries were still going strong.Although I prefer a viewfinder, my wife prefers using the LCD screen.  She was pleased that it was bright enough to be useful in the bright Florida sun, unlike her old camera's display.  She found the camera easy to use and is pleased as well.I then spent some time playing with my Android tablet.  Accessing photos on the camera from my tablet via WiFi using Fujifilm's Android Apps very simple.  Very simple and very logical.  Intuitive even.  That will be a real asset when we are on travel, as a 10\" tablet screen is much better than the camera's  3\" display for reviewing the day's photos.Setting up the application for wireless backup on my PC was not nearly as easy.  I blame the directions provided by Fujifilm  rather than the software itself.  After I finally figured out what Fujifilm was trying to say, it wasn't all that difficult to set up, and works flawlessly.Bottom line:  This is simply a terrific camera.  It takes great shots, is very flexible, and the image stabilization works extremely well.  The camera is solidly built, perhaps even better than my old Fujifilm that I was so happy with.There is a firmware upgrade available at the  Fujifilm website that I will be installing tomorrow.  It is supposed to make image stabilization even better.Two week update:  I love the camera.  We took quite a few photos of nesting birds with it from a boat and many of the shots  were at full zoom. I'm still amazed I can do that, hand held, and get well-focused pictures.  Also, I updated the firmware; it was quite easy to do and Fujifilm's directions were very clear.I have had some problems using the \"PC Autosave\" cabability, which transfers photos from the camera to your PC (in my case, Windows 8.1) using WiFi.  It ultimately works, but have had a few sniggling problems that I have contacted Fujifilm about.  I suspect it's a Windows 8.1 problem.", "Date": "March 20, 2014"}, {"Title": "Fujifilm FinePix S8200", "Author": "C. Parks", "ReviewID": "RZZOIWET5B6RZ", "Overall": "2.0", "Content": "First Review - TWO STARs....I purchased this camera for a few main reasons; I've had Fuji FinePix cameras for many years and liked them all; many cameras have good reputations but not many have viewfinders; an electronic view finder/LCD screen setup is an absolute must for me; I am familiar with how Fuji FinePixs  operate ( I don't care much for change, probably an age thing) .Ist observations out of the box:  It appears to be well made, as are the other FinePixs I have had. At set-up it is very noticeable that it is a much heavier camera than the two most recent Fujis I have owned. According to my (old) Acculab gram scale the S5000 weighs 478 grams (1 lb. 0.8 ounces) and the 3800 is only 412 grams (14.5 ounces), whereas the S8200 comes in at 705 grams (1 lb. 8.8 ounces)! All the weighing was done with carrying straps attached as well as batteries and memory card inserted.2nd - The zoom is very LOUD! It scared off the birds I tried focus in on to photograph! Oh no! This is not good - definitely not acceptable!3rd - Though the LCD screen is viewable, nothing is recognizable when sighting through the EVF.  It is like looking through a fog-bank. Bummer!! Guessing on what the subject is, isn't acceptable either!Because of this request in the information packet: PLEASe DO NOT RETURN THIS PRODUCT TO YOUR PLACE OF PURCHASE BEFORE CONTACTING FUJIFILM, I have not yet returned it. I will reserve final thoughts on this product for now. Tomorrow I will talk to them and will add to the review or adjust the rating.UPDATE 12/11/13: Contacted Fuji today and the very nice man told me he was, \"Sorry about the product. There is nothing I can do for you\", which is what I expected. Will be contacting Amazon now.UPDATE 12/14/13: Amazon, the superior seller it is, refunded the cost of the camera almost immediately (12/13). Still my favorite place to shop!", "Date": "December 10, 2013"}, {"Title": "Good Point & Shoot Camera", "Author": "Kindle Customer", "ReviewID": "R21DRC338TSVB2", "Overall": "5.0", "Content": "I am a novice camera user. When my Cannon SD600 quit working, I started looking for a camera a step up. This camera takes good pictures set on AUTO. It is one of the few cameras, in its price range, that has a view finder. Its 40X lens is fantastic. I am sure when I learn how to use all the described features, I will be even happier with my choice.", "Date": "July 12, 2013"}, {"Title": "Awesome Camera!", "Author": "Lisa Pool", "ReviewID": "R2CHPFFWM2T0TZ", "Overall": "5.0", "Content": "This camera is, AWESOME! I am not a pro but I get some really good pics with the FinePix camera's (this is my 3rd or 4th one).  There's so many things that the average person doesn't even know they're looking for that is in this camera so I'm going to recommend going to youtube and putting in the model number to get some tips/answer questions as well. The most awesome thing I've found on this camera that I've never seen on another one, is... go to the advanced dial, and try out \"pop\" in all of the different settings. When doing sunsets/sunrises and flowers, or anything with a lot of color, this setting will pay for itself with that setting alone.", "Date": "November 15, 2013"}, {"Title": "Very nice camera with familiar Fujifilm usability", "Author": "imdanimal", "ReviewID": "RH6XMM77AFGXH", "Overall": "4.0", "Content": "We purchased this camera as a replacement for an aging Canon point and shoot. Overall, it's very nice. Zoom is very good and takes surprisingly good photos at 40x. The night shot and panorama features are also very impressive. We have a very similar Fujifilm camera that we bought several years ago. Can't remember the model number, but it had about one quarter of the pixel capacity and zoom capacity of this model. It's pretty impressive that it feels the same way that the old camera did. About the only complaint or concern I have is that while zooming, it sounds like the motor struggles a little bit. Overall I'm extremely happy with it.", "Date": "September 23, 2013"}, {"Title": "Not a bad camera for the money.", "Author": "Thomas E. Vogel \"Tommy V\"", "ReviewID": "RAU9LARK3IV6A", "Overall": "3.0", "Content": "It has a problem with focus when in the video mode and the zoom is used.  I don't like the fact that it does not appear as a devise when plugged into a USB port.  I would like the option to use software of my choice to down load mt photos and videos. Overall the 40:1 zoom is quite good although max. telephoto needs a tripod.  I wish it had rechargeable batteries but overall I am happy that I bought this camera.", "Date": "July 23, 2013"}, {"Title": "great day at beach", "Author": "Nancy", "ReviewID": "R23THV3ZA150SP", "Overall": "5.0", "Content": "it works great and so simple to use. The pics of my grandkids playing were great to see after a day at the beach. I would say to anyone buy it.", "Date": "June 8, 2013"}, {"Title": "Pleased with the performance of this camera", "Author": "Altoona Story Teller", "ReviewID": "R2F89XYGGNIMJR", "Overall": "4.0", "Content": "We have only had our new Fuji S8200 camera for a short while but I have adapted to the easy operation.  Photography is not my strong suit so I appreciate a camera that is easy for me to learn to operate and that provides a decent product.", "Date": "June 3, 2013"}, {"Title": "Good general/vacation use camera", "Author": "Crisanto G Deuna", "ReviewID": "RXP1SINYEIA2U", "Overall": "4.0", "Content": "Good camera for general use. I purchased this camera specifically for an overseas trip and held up pretty well and provided good pictures. The features hold up pretty well as indicated. The only drawback for this camera is that it eats power too quickly and does not have a live battery/power level indicator. I had to carry along quite a bunch of disposable AA batteries and just goes dead without any prior warning. But overall, it does give you very good clean pictures even in night shots. Even my friends liked the camera that they have decided to purchase the same for themselves. The myriad of features it carries and the wireless transfer of images to your tablets or smartphones was a high selling point for me and my friends. I do recommend this for people who wants a simple yet versatile and simple to operate general-use camera users.", "Date": "January 6, 2014"}, {"Title": "Love it", "Author": "cat", "ReviewID": "R2CMJT8EE1WTK1", "Overall": "5.0", "Content": "Exactly what I ordered.  It came on time.  The picture quality was excellent, sharp and crisp.  The zoom was remarkable, I have an older verson of this camera and when you see the zoom on the exact same picture is remarkable.  Will stick with Fine Pix.  It does all the work of a much more expensive camera but the price is right.", "Date": "December 6, 2013"}, {"Title": "Excellent Camera", "Author": "Gary L. Anderson", "ReviewID": "R380Y4T8ESYYT6", "Overall": "5.0", "Content": "Everything I had hoped for...ease of operation, great options and excellent photos. Would highly recommend for anyone looking for a digital option to SLR.", "Date": "November 29, 2013"}, {"Title": "OK for the price", "Author": "Jim", "ReviewID": "R3Q8XYXWLNBQGD", "Overall": "3.0", "Content": "I wanted a travel camera with a good zoom lens to replace my Nikon D300. After one trip I'm more than a little disappointed in the quality of the image that this camera produces. Downloading the images to either Photoshop or Piacsa, I'm only getting 6 or 7 MP in the JEPG format which isn't enough to do any croping or color processing.  An even bigger problem is the panorama shots were less than 2 MP which makes them useless for printing.There is no customer service phone number in the manual or on-line that I could find, and my on-line question about the image size has been acknowledged but unanswered for 2 weeks now.The camera is easy to use, the different modes and settings are intuitive and easily accessed, and the pictures are fine for sharing on line. And at this price point, I guess that's about all I should have expected, but it's not what I wanted. I'm going to try to return this camera.", "Date": "August 8, 2013"}, {"Title": "all in one camera", "Author": "BB", "ReviewID": "R2UB0IVI67HBDJ", "Overall": "5.0", "Content": "This camera does it all, has so many options to take pictures of various shootingconditions.  Nice long zoom lens to take long distance and Wifi to transferyour pictures is pretty easy to do.Only thing I see as a slight negative iswhen you are using recording is you will hear the zoom motor if you arezooming while recording, somewhat annoying but certainly not a dealbreaker. I bought this mainly yo be able to take pictures long range andespecially for the Wifi! Does take good pictures, im not a fanatic so if thepictures look good to me im satisfied.", "Date": "January 18, 2014"}, {"Title": "Excellent value", "Author": "Robert McCann", "ReviewID": "R1NK7OIWXRPAZZ", "Overall": "5.0", "Content": "I've used the camera frequently and it has functioned exactly as advertised.  I would certainly recommend it to a friend.", "Date": "January 7, 2014"}, {"Title": "Good camera", "Author": "Raul R Cabrera", "ReviewID": "R1OUZMW0Y4B6AG", "Overall": "4.0", "Content": "Seller shipped item right away and I received it as promised. Still working with the camera I usually use a Nikon SLR, however I wanted a smaller camera with an an SLR type look. I also like that it has a pretty good zoom without having to carry several different lenses. I have owned several Fuji fine pix and they are great for the price.  Still learning it, but so far it takes decent pictures.", "Date": "December 28, 2013"}, {"Title": "Impressive shots, easy to use camera!", "Author": "T Woody", "ReviewID": "R3GPZD1MLZMDY5", "Overall": "5.0", "Content": "The Fuji camera is easy to use and lightweight. It made capturing great shots effortless.  Also, the camera's 1080i HD recorded crystal clear clarity.  A great quality camera for the amount spent!", "Date": "December 26, 2013"}, {"Title": "great camera for a small price!", "Author": "Charlotte Curry", "ReviewID": "R3MGUMF2H2ZK9U", "Overall": "5.0", "Content": "My photos were clear, bright & beautiful, even from a moving car!  i took 400 photos on the same battery pack.", "Date": "November 3, 2013"}, {"Title": "What a bargain!", "Author": "Ken", "ReviewID": "R17HMHGJ4KYWWG", "Overall": "5.0", "Content": "I bought this camera as a quickdraw zoom bird watching camera. Telephoto lens at 40X, silent operation option, continuos shooting and other features of this camera is icing on the cake. To me the price is right, quality is good, and it does everything I could ask for so far.", "Date": "September 6, 2013"}, {"Title": "Great Zoom Camera", "Author": "Gary W. Williams", "ReviewID": "RO7FBVR70XEY1", "Overall": "5.0", "Content": "I bought this camera to upgrade from my Fujifilm Finepix S5200 and so far I really like it.  I primarily take wildlife & nature pictures and this camera has a great zoom.", "Date": "September 2, 2013"}, {"Title": "great camera", "Author": "Benjamin Guest", "ReviewID": "R2WQ8FRDONQX", "Overall": "5.0", "Content": "love this camera and the price was right! With the 32 G memory card you have all you need to take many quality pictures.", "Date": "August 21, 2013"}, {"Title": "Great Camera", "Author": "H. Puterbaugh", "ReviewID": "R29G79M0SBKUSC", "Overall": "5.0", "Content": "Great camera, still learning how to use all of the functions, but so far pix have been great, pix look fantastic", "Date": "August 17, 2013"}, {"Title": "works as expected", "Author": "fezz", "ReviewID": "R2MXUBGCO5ELUF", "Overall": "5.0", "Content": "this product was purchased to upgrade to hi def my video recording abilityit works as expected and the first time out gave me great hi-def videothe draw backs are it eats batteries (1 hour of video per 4 bat set alkaline) but I hadn't found all thepower saving settings yetthe camera noise of operation is transmitted to the mic(s)took awhile to focus at times in movie modepressing the shutter button caused the camera to shake and blur the image (but a 2 sec delay can fix this)positives very good zoom full 1080p video in .MOV format easy format to work with nice color too !!I only took 4 pix with it and all were blurry but if I activate the 2 sec shutter delay I think I will be OKincluded CDR has fuji program to copy large files off the chip through the camera via USB (up to 29 min.hi quality video per file and a 8 gig chip will get you about an hour of video ...(you must use this program as windows file transfer will balk at a large file so find and save and load the CD)i used a 32 gig chip and it formatted OK and worked OK but the remaining time function was out of wackshowing less time then really available on the chip .... I'm sure a firm ware upgrade could fix this if theywant to include one ....as is the remaining time showed less than an hour to start when it should haveshown 4 hours but it counted down slower so it never hit zero for the 32 gig chiphave not done anything with the special bells and whistles but I expect blink red eye low-light etc. will workas advertized camera is fairly light and I held it for over an hour of video with no strain to my wrist etc.next up I will try the panorama function as this seems like a cool feature just need a good subject.I have an external audio capture device so I am less concerned with how much you can hear the camerafunction noise in the built in mics (the zoom in/out is very audible) (focus not too audible)in short it gave me high quality video with minimum drawbacks :-)I bought the separate AC adapter so I could transfer large files and play back VID through its built in HDMImini \"c\" port to the TV with out draining batteries. cost around $20 including shipping and well worth it as theysay a power loss during transfer of files could harm chip and or lose data yikes !!I also bought mini \"c\" to regular HDMI adapter for $10 at the shack and a regular HDMI cable found everywhereto get the hi-def signal out of the camera and into the TV. looks very nice by the way !!", "Date": "August 21, 2013"}, {"Title": "Not D.O.A. but close", "Author": "Dan The Man", "ReviewID": "R15APKHBQQUGUE", "Overall": "3.0", "Content": "Received this camera as a gift. Impressive features and a good value compared to similar competing models. Unfortunately mine almost immediately developed an intermittent issue getting the camera to turn on. I tried two sets of fresh batteries, checked all items listed under troubleshooting in the manual, but no luck. The battery compartment seemed good and tight. When it did turn on it stayed on and worked fine. Hopefully this was an isolated problem as I haven't seen this issue reported with this or other Fujifilm bridge cameras.", "Date": "July 23, 2013"}, {"Title": "Photo Quality is Poor", "Author": "J. Jenkins", "ReviewID": "R3W5BE57F58RQM", "Overall": "2.0", "Content": "Although this camera offers a ton of functionality, it just doesn't take great pictures. I used it in automatic mode and all of the manual setting modes and achieved the same results, washed out foregrounds and backgrounds and unimpressive colors.Ultimately, I decided I could do a lot better if I spent a bit more money, so I sent the FinePix S8400W back to Amazon and purchased the Sony a58, which I'm very happy with.", "Date": "July 28, 2013"}, {"Title": "Novice learning...", "Author": "V. S. Cook \"vscookjr\"", "ReviewID": "RD7HAGH7UI5UN", "Overall": "5.0", "Content": "Still just learning this camera but continued to be amazed at the functionality and features.  More than I truly understand at this point.  But I do know that the best thing I can say about this camera is it does take great pictures.  While I know some more discerning and more experienced users my not agree but to my eye when I have the camera set correctly, the resulting pictures are much better than what I was getting with my old point and shoot.The second thing I can recommend is to READ THE MANUAL!  You have to understand the features and how to utilize them to get the most out of this camera.  Don't blame the camera if you can't figure out the function and get poor results accordingly.  This is not an expensive DSLR.  It is a reasonably priced next step camera for people like my self who want to expand their photography skills but don't want to spend a ton of money to do so.You will enjoy this camera if you have the patience to read a bit, play with it enough to learn it and then explore with it.", "Date": "April 19, 2014"}, {"Title": "Great", "Author": "MARGARET N.", "ReviewID": "R1GOPFG06YBLKM", "Overall": "5.0", "Content": "Love the zoom. Love the ability to wirelessly sync with my phone and laptop.  Able to zoom in, take photos, sync to my phone, upload to facebook.  All wirelessly.  Excellent.  Very easy.", "Date": "March 24, 2014"}, {"Title": "Happy with my choice.", "Author": "thomas condon", "ReviewID": "R3IQ7DASV93Z8A", "Overall": "5.0", "Content": "Great bridge camera for the price. The auto focus when holding the shutter half way down worked good so far too.", "Date": "December 30, 2013"}, {"Title": "The best", "Author": "kim", "ReviewID": "RQWXQ5LK59VV6", "Overall": "5.0", "Content": "Love it best camera I have ever owned!!! Love the way the photos turn out auto focus is perfect no other words except love it", "Date": "August 29, 2013"}, {"Title": "Great camera!", "Author": "Bernard Charland", "ReviewID": "R2SR6PYZK01PEC", "Overall": "5.0", "Content": "Wanted a better than average camera and this camera fits perfectly.  Almost comparable to a SLR.  Has great features.  Easy to use and understand.  A lot of camera for the money.  Highly recommend!!", "Date": "August 25, 2013"}, {"Title": "Great camera", "Author": "Hawk", "ReviewID": "R11M34KWHJ8W9R", "Overall": "5.0", "Content": "This camera is really nice, lots of easy to use features.  Read the manual to get the most out of it.  Zoom is huge, clear, and easy to do.", "Date": "July 16, 2013"}, {"Title": "One Speed Zoom", "Author": "Jon Helberg", "ReviewID": "R2EL0OTL2I0365", "Overall": "3.0", "Content": "Love the camera in all respects but one - why does it not have a variable speed zoom? All the competitors have it. We have done some amount of video with our Panasonic point-and-shoots (we have owned at least five of them over the years and all shared this feature) and it's so nice to slowly zoom in on a subject instead of blasting in at it full speed, which is the only way to do it with the Fujifilm. Full speed zoom is nice when you're taking stills, but NOT for video. That's a deal breaker for us on this otherwise extremely desirable camera. Sorry.", "Date": "August 10, 2013"}, {"Title": "Despite its zoom capabilities, it's not the camera to purchase.", "Author": "R", "ReviewID": "R1GLS6DZRYWTZP", "Overall": "1.0", "Content": "After extensive research, I bought the the Fuji S8400W as a bridge camera for an overseas trip I was taking with my wife to Italy.  I am an avid and knowledgable photographer, often taking a couple of hundred shots per day using multiple cameras.Unfortunately, this camera cannot handle basic outdoor photos on a sunny day, nor indoor ones with mixed lighting -- despite all attempts to change necessary settings. What a huge disappointment. It is going back to Amazon as soon as we return to the States.When all is said and done, you always want to stick to Canon and Nikon cameras.", "Date": "May 19, 2014"}, {"Title": "couldnt love without my camera!!", "Author": "karen Weinburg", "ReviewID": "R1VO82H4V3H4W0", "Overall": "5.0", "Content": "I absolutely LOVE this camera!!!! Best money i ever spent. There's so many different functions and setting on the camera that allows you to take such amazing picture. I truly love it!!!", "Date": "May 18, 2014"}, {"Title": "This is for the Finepix S8300 It is better than the other S8### models", "Author": "B-Side", "ReviewID": "R33IHJ5XS5ATEO", "Overall": "5.0", "Content": "I love this camera - I have a Sony A57 and an underwater Panasonic Lumix TSC-20. My wife started taking my Lumix point and shoot  away from me on trips. When we realized she had a great eye and needed a better camera of her own, we did some research and came up with this little number. The Finepix S8300  is what they call a Bridge Camera. Its a Point and shoot with the soul of a DSLR. It has an incredible zoom, great lens sharpness, fantastic extra features like black and white with one selective color (red, green blue, yellow purple and orange) panorama and 3D! Shoots great HD video and up to 480 frames per second for great super slo mo video - although at that rate there is no audio and it is at 320x120 resolution. It is light, takes AA batteries (which I would buy rechargeables if I were you),but its good for up to 500 shots on one charge. The f stop range is only 2.9 to 6.5 which is a little limited, but is ok for hobbyists - if you are a pro you would be looking to spend more than the >$225 area anyway. Tons of features for such a small cam and low price. I used Snapsort.com to compare this to other Fuji and SONY, Nikon and Cannon. Although the popularity and fixed lens brought its score down, for the price, extra features, focal length and video formats its clear that the Fuji would be the best choice for me. There are a few differences in the finepix S8000 series cameras, and a bigger difference between their other S#### cams. In my opinion the S8300 features and price make it the best one.", "Date": "May 16, 2014"}, {"Title": "as advertised", "Author": "david conley", "ReviewID": "R24WAMNSYFZ7VS", "Overall": "5.0", "Content": "My first digital camera \"scared to death\" thought it would be over my head. Love it...point and shoot..Everything I wanted in one camera..\"Old School\" sure would like owners manual in paper back.", "Date": "May 10, 2014"}, {"Title": "Excellent camera - very versatile", "Author": "Dennis D. DeRosier", "ReviewID": "R21SIWXQYGGGOE", "Overall": "5.0", "Content": "I bought this camera to replace my Olympus SP-560, which I inadvertantly dropped. The cost of repairing the Olympus was as much as this camera cost, so I opted for a new camera. So far I am extremely pleased. It has all the features I desired: It uses standard AA batteries, has an electronic viewfinder in addition to the 3\" screen, a scene-recognition mode that auto-selects the appropriate scene mode, a ful 360-degree motion panorama mode and takes HD videos. The 40x optical zoom takes excellent pictures even at full zoom and hand-held. I would recommend this camera to others.", "Date": "May 2, 2014"}, {"Title": "Camera", "Author": "Lynda Springer", "ReviewID": "R3GRORTSLNNVYZ", "Overall": "5.0", "Content": "Love it its just great. Takes great pictures would recomend to other people. I have told a lot of people to buy this camera", "Date": "April 28, 2014"}, {"Title": "Excellent product.", "Author": "raulpv-mx", "ReviewID": "R2ZQDV8LX4EE1C", "Overall": "5.0", "Content": "After much search and compare brands and prices, I decided on this camera Fujifilm. It is indeed a great product and meets all expectations. I recommend it!", "Date": "April 11, 2014"}, {"Title": "I would buy it again (I just did)", "Author": "PeterAZ", "ReviewID": "R29R7EETVRTTJ9", "Overall": "5.0", "Content": "I bought this camera last June. Very happy with all the features (Picture quality, ease of use, zoom, battery life, low light photos, etc.) Two weeks ago it was stolen, so once I was sure it was gone, I ordered a replacement, exact same model. This time I'm writing down the serial number.", "Date": "April 10, 2014"}, {"Title": "Fantastic Service, Nice Camera", "Author": "Victoria Gaytan", "ReviewID": "R2EEABQY1YKQLB", "Overall": "5.0", "Content": "Camera shipped and arrived within 2 days of purchase, fantastic service and very competitive pricing on this Fujifilm camera.  This camera is feature loaded and is quite capable of taking great photos once you learn to use all the features.  Controls are simple and very intuitive allowing for rapid adjustments to settings in all modes.  HDR photography, High Speed Video w/stereo sound and Burst Modes are a nice addition to an entry level super zoom camera.  The styling is very much like and SLR and the unit includes a built in flash.  The camera is very light and is not built for rugged use but it packs a lot of nice features in a very portable unit that uses AA batteries (a big plus to me).  No it's not a pro camera and it's not going to impress any photo snobs and yes it does not have a traditional view finder and the monitor is not adjustable but overall it's a great value and only a bad photographer blames their tools........................", "Date": "April 5, 2014"}, {"Title": "Great Camera and dealer", "Author": "Anthony Manganaro", "ReviewID": "RM9TQYW6XCGAH", "Overall": "5.0", "Content": "The camera arrived a little ahead of schedule and in perfect condition.I am an new amateur photographer and wanted a camera that would take high resolution photos and have a powerful optical zoom feature without breaking the bank.  About 3 months into using the camera I did notice a few small white flakes had appeared in the front lens housing. They weren't directly in front of the lens but they could end up there.I contacted FujiFilm and shipped the camera out for repair.They said it would be about 2-3 weeks from the time I shipped the camera to the time I received it back.I am happy to say I had it back in 2 weeks and it was repaired, cleaned and tested.The camera is now perfect and I am quite happy with it.For a beginning photographer it is a great camera.  I love to shoot Nature and wildlife pictures and the camera does a very nice job.I do which it had a better Manual control system and the ability to keep the shutter open for more than just 8 seconds as I would like to be able to do night photography of the skies.", "Date": "March 31, 2014"}, {"Title": "i'm loving it!!!", "Author": "Vanessa González", "ReviewID": "R1OOUKMUS0K1C3", "Overall": "5.0", "Content": "i just have a few days using my new camera, and i extremadly happy with it!!! i searched a lot before choose it and looked a lot of photographers blogs and i can be happier with my choice!!! it performances like a pro", "Date": "March 20, 2014"}, {"Title": "Love my mew Fuji Finepix", "Author": "Doris Patrick", "ReviewID": "RRCDVGSOSDY42", "Overall": "5.0", "Content": "I Love Love Love my new camera!!!!! I can't wait to see what kind of pix I get on the baseball field this season. ....", "Date": "March 18, 2014"}, {"Title": "Very pleased with the camera", "Author": "larrya", "ReviewID": "R36VB3YIYP0T4P", "Overall": "5.0", "Content": "I purchased after seeing good reviews and it was reasonably priced.  I am very happy with it.  I'm not an expert with a camera and this camera does such a nice job on the automatic function.  Wonderful closeups and the 40x zoom is super.  Excellent value.", "Date": "March 10, 2014"}, {"Title": "Ok shots, lots of settings, TERRIBLE zoom noise on movies...", "Author": "Chuck", "ReviewID": "RQWMO9TB15ML8", "Overall": "3.0", "Content": "I have used Fuji cameras in the past an always liked the extra features they had. This camera is no exception. It has a ton of added features, including Wifi. One of the setting I like is to put the camera in P mode and use the Auto(xxxx) setting where xxx is 400,800,1600,3200. Doing this limits the top end ISO setting it will use. It is nice if you want to force it to use a lower ISO while not limiting you, if the camera thinks it can go lower. The pictures in general were good but anything above ISO400 showed some some noise, which was a bit disappointing(this is where the Auto(400) comes in handy). The focusing was ok, but it did have some issues at times, when zoomed in.The Wifi worked well and it handled Wifi Access points properly(unlike the Canon SX510). The one issue I had tho was using the phone app to browse stuff on the camera. Every time I tried to use this mode, it wouldn't connect. Otherwise it was great.The main issue I had was recording movies. If you didn't zoom, they came out fine, although you had to be careful to let it refocus at times. The sound was weak tho. I felt like it should be picking up more sound than it was. The real issue was when you used the zoom while recording. I got a serious motor noise that was loud enough to completely overrun any normal audio I happened to be recording. I saw a few people mention this, but I'm surprised more haven't, as it is extremely annoying and really puts a damper on recording movies.I really wanted to like this thing but the motor noise/weak sound on movies(which I use on occasion) and added noise at the higher ISOs I think is just too much for me.", "Date": "February 18, 2014"}, {"Title": "Great for wanna be professionals", "Author": "DavidA", "ReviewID": "RNYAVS4UIWFBW", "Overall": "5.0", "Content": "With a 42x zoom lens and other options, this is a great product for people serious about their photography. Only complaint is it takes a while to learn everything.", "Date": "February 16, 2014"}, {"Title": "Great buy", "Author": "Donna steel", "ReviewID": "RM9NHLSXBOMWY", "Overall": "4.0", "Content": "Very good pictures..easy to use..I wish it had a remote but otherwise a great camera. Can't wait to use it this spring and summer.", "Date": "February 4, 2014"}, {"Title": "Great camera for the price", "Author": "wlsp8", "ReviewID": "R1GJP5IWP8NNCJ", "Overall": "4.0", "Content": "I bought camera for wife ,she loves it .A good camera for the price. Now she can take pics that are not grainy", "Date": "January 19, 2014"}, {"Title": "i am impressed with the quality and the options", "Author": "Edgar J. Puckett", "ReviewID": "R2NPHOPA1KS3D3", "Overall": "4.0", "Content": "This replaced my several year old Sony DSC-H1 that I dropped a few months ago smashing the LCD.  I really like the picture quality, and the software options in this unit.  Some of them could be a little easier to use or explained better, but even an old geezer like me can figure them out with a little use.  there are a couple of physical improvements that would be beneficial, first is the lens cap.  It is a squeeze type that snaps into a grove in the lens housing, but it is slightly wider than the housing and requires very little pressure to release, so it comes off with the slightest touch, even putting it in and removing from a camera bag causes the cap to fall off.  The second thing is there are no threads in the lens housing, only a groove for the lens cap, so You cannot use any type of filter or hood.", "Date": "January 19, 2014"}, {"Title": "Love it!", "Author": "Lucy", "ReviewID": "RBA0O03DN95J0", "Overall": "5.0", "Content": "I'm not a professional photographer, but love photographing. I better camera with powerful  zoom and viewfinder, but couldn't afford an expensive one. This camera is fantastic for the price. The zoom is wow! Shoots fast, the effects are really good, and it gives me option to customize my photos. The battery life is not bad at all, but I advise to carry batteries with you, if you are planning to take many photos. The viewfinder makes it easy to take photos even in very bright days. If you love photographing, and is not a professional, I would encourage you to buy this camera. I'm very happy with it!", "Date": "January 18, 2014"}, {"Title": "Awesome Camera For The Price!", "Author": "Drew", "ReviewID": "RYIU82LWVIOTR", "Overall": "5.0", "Content": "Great camera for a first time beginner, a great price for this camera, recommend this camera for people who dont wanna spend alot of money because it does everything just cant take off the lens", "Date": "January 12, 2014"}, {"Title": "Quality vs Cost", "Author": "Thomas", "ReviewID": "R8248O9GZ9PYK", "Overall": "4.0", "Content": "I believe Fujifilm cameras are the best bang for the buck. This purchase was to replace a prior Fuij SL2000 model that was dropped one to many times.", "Date": "January 9, 2014"}, {"Title": "Camera review", "Author": "Kaye O'Donoghue", "ReviewID": "R382XHJXD6PEPS", "Overall": "5.0", "Content": "The zoom is very good.  Very easy to operate.  The picture quality is very good.  I would recommend this camera.", "Date": "December 6, 2013"}, {"Title": "Great camera", "Author": "Samm", "ReviewID": "R3ESO1TAL3SJ99", "Overall": "5.0", "Content": "I had been looking to buy a mirrorless DSLR and happened to see a different version on this on one of the shopping shows, so I went looking on Amazon and found the S8200. Works great for photos. Need tripod for high zoom. Movie mode worked good but was dissappointed that I could not easily put them on a DVD without buying a little white box that Amazon also sells. Easy to use but need more time to figure out all the features!", "Date": "September 18, 2013"}, {"Title": "Camera Fever", "Author": "u2canwrite", "ReviewID": "R1C6V2CTC1F037", "Overall": "5.0", "Content": "I love the Fujifilm s8200 that my husband gave me for Christmas. Let's start with the fact that I am no longer in my teens or twenties (far from it!). I was accustomed to using my 35mm Canon when the digital age hit the marketplace. I started using the point-and-shoot digital cameras that I could put in my purse or pocket. In the course of a few years I moved from a Kodak, to a Nikon, to a Canon digital, each getting a little better picture for me. I could carry them in my pocket but my pictures just weren't as clear or good as I had hoped. I've wanted to go DSLR, but those cameras were WAY out of my price range, so I did the best I could with my little digitals. A few months ago, my husband heard me say that my nephew was getting better pictures on his cell phone than I was getting with my cameras.That began our search for a good camera that was reasonably priced. My research led me to the Fujifilm cameras. I was thinking of the S4200, (largely due to a price-quality comparison) but when we went shopping, my husband, knowing my love of photography, kept moving me up the line to the s8200. It was almost double what I had wanted to pay, but the camea was impressive. Once I made up my mind, the stores where we were shopping were out of the s8200s. Amazon came to the rescue.So .... what do I like? The camera is smarter than I am. Its point-and-shoot settings let me take good-to-great pictures while I am learning to use the many settings & features as I go along.I used to do some professional photography when I was younger, so this camera \"feels\" like a camera. It has a 3-inch LCD monitor & an electronic viewfinder that I can use to stop the glare that makes it almost impossible to frame my pictures in the older digital cameras. This is not a little rectangular box; this is a camera. There is a comfortable handgrip I can use to balance my pictures. Its image stabilization feature is helpful. My hands aren't as steady as they used to be. The 8200 tries hard to give me the best possible picture, sometimes in spite of my efforts. ;-). There is significant adjustability that allows me to choose shutter or aperture priority so I can be as creative as I wish if the situation calls for it -- or I can choose one of two automatic point-and-shoot settings if I am just snapping pictures. The dials, buttons, knobs & menus are easy to use.  The scene position modes allow you to select SR Auto (scene recognition helps me frame the scene & automatically chooses the ideal settings), Auto (for ordinary snapshots),  Advanced mode (lots of flexibility with this one), Custom (accepts user preferences), Aperture priority (sets the aperture), Shutter priority (sets the shutter speed), Scene positions (helps me match the scene with the settings I have chossen), Program AE (allows me to use settings other than the aperture & shutter priorities), and motion panorama (allows me to sweep the camera right or lift for panoramic pictures). I have just started using some of these settings & I like what I see.When I know the kinds of pictures I would like to take, the s8200 gives me position settings that help get the best picture. I can use Portrait, Landscape, Night, Night (Tripod), Snow, Flower, Baby, Smart, Fireworks, Beach, Text, Smile & Shoot, Sunset & Party. As I said earlier, the camera is smarter than I am right now, but I'm learning and I'm not feeling stressed about these features.The Fufjifilm s8200 also has video capabilities, but I'm not into them ... yet. As I said, I can learn as I go without feeling threatened by my camera.One of the best reasons to buy a  Fujifilm s8200? Other cameras with the same or similar features are more than double or triple the cost of the s8200.The s8200 takes easy-to-find AA batteries. Although I bought extra specialized rechargeable batteries for my older digitals, I still found myself running out of power at the most inopertune moments. I can deal with a battery emergency with less stress because AA batteries are everywhere.OK, so what don't I like? Well, It is heavier than the point-and-shoot digitals I've been using, but it is surprisingly light when I compare it with my previous 35 mm experience. I know that is a HUGE variation, but the s8200's weight is not an issue for me. Sure, it's bigger, thicker, wider, etc, but I feel like I am using a real camera. OK, so I can't carry it in my pocket ... or my purse. Well, I guess I could get a bigger purse (just kidding!). When I bought the camera, I also bought a delightful little camera bag that is just the right size for the camera & a few accessories.If you like to switch lenses, the s8200 is not for you. It has a fixed lens with enough flexibility to meet my needs. I do not need to have specialized extra lenses to worry about. I am gladly giving up the extra lenses for my 8200's scene position settings.Overall, I am happy. My nieces & nephews do interesting things & now I can take better pictures of them doing so.", "Date": "January 4, 2014"}, {"Title": "Great camera!", "Author": "Tanya Hughes", "ReviewID": "RFWF45W6VLTV6", "Overall": "5.0", "Content": "This camera is really nice. I love the panorama option and it's really easy to use. Product was new as promised in original packaging. Photos are gorgeous. Went from a Cannon 4x zoom to this and what a difference. Took a great picture of a plane in the sky!", "Date": "October 12, 2013"}, {"Title": "Great camera.", "Author": "JAL", "ReviewID": "R2X1QXS71ZPTJY", "Overall": "5.0", "Content": "I have another FujiFilm camera.I decided to buy this one and upgrade the one I have.They are very easy to use and take great photos.", "Date": "July 4, 2013"}, {"Title": "I wanted to like it.....", "Author": "Kami R. Beck", "ReviewID": "R17571B9FJD5IC", "Overall": "2.0", "Content": "I received the Fujifilm S8200 as a Christmas gift. I had originally purchased the Nikon L820 but decided that the Fuji was better with full manual controls, a 40x zoom, an EVF, and many filters and effects. However, when I took pictures with it outdoors, there was a lot of noise in the pictures. For some reason, the auto mode set the ISO really high, so I lowered it, but the noise was still there. I then went to the Nikon L820 and the Fuji S8200 Flickr pools and looked at sample images, and the Nikon's were much better, crisp and clear, but the Fujifilm's were noisy and of low quality. The EVF is of low quality and you can't see details with it, even with adjustments. The autofocus has focusing issues at any distance. Don't buy this camera without looking at sample images.", "Date": "December 27, 2013"}, {"Title": "This is the one!", "Author": "Patricia Cotton", "ReviewID": "RQQT14NFZ8V4O", "Overall": "5.0", "Content": "This camera was recommended by a friend who is a photographer and also has purchased the same camera. I explained to him the features I wanted in a camera and how I was so disappointed with the current moderately priced cameras which I had been able to find. He then explained the features of this camera and recommended I buy this one. This camera has many features not found in other cameras in the same price range. It does a very nice job on automatic for the person who does not want to learn all the particulars of photography, but has settings for artistic control for the amateur or professional photographer. I am very pleased with this purchase and especially appreciate the available view finder for shots in the bright sun light. The fact that it also uses 4 batteries size AA helps the flash to recover more quickly and insures longer battery life. Unless you are willing to pay a lot more money for a professional quality camera, This is the one!", "Date": "January 15, 2014"}, {"Title": "I like it", "Author": "Dexter", "ReviewID": "R395JA0J93IZOP", "Overall": "5.0", "Content": "I like it. Haven't used it much but have noticed that it takes pics very fast compared to the other digital cameras i've had. No lag...n takes very good pics.", "Date": "January 14, 2014"}, {"Title": "Fujifilm S8400W Camera", "Author": "Ken Ledeman", "ReviewID": "R2VJ69DT23BP3Z", "Overall": "5.0", "Content": "The camera arrived on time, performed as expected and indicated in your information.  I plan to enjoy this camera for many years to come.", "Date": "January 6, 2014"}, {"Title": "AA powered camera", "Author": "Chad Hughes", "ReviewID": "R1FRZHF8U005WJ", "Overall": "5.0", "Content": "bought as a gift, this camera was purchased because of it's AA battery power.  Requires 4 batteries, the gift was for a person who was unable to remember to keep their other point and shoot charged.", "Date": "December 19, 2013"}, {"Title": "Good camera", "Author": "GREGORY E HOLTZ", "ReviewID": "R2J6GN5G9WIS9O", "Overall": "4.0", "Content": "Good camera for the average user.  Still learning how to best use it.  I really like the zoom lens, but mot important featureI wanted was a viewfinder as I often take action pictures in bright light.  The 3\" LCD display is nice for reviewing your photos", "Date": "August 30, 2013"}, {"Title": "Great camera for the price....", "Author": "Julie Soto", "ReviewID": "R2S006CE4S3F40", "Overall": "5.0", "Content": "I purchase this camera so I wouldn't have to use my phone to take pictures of my children. I love the ease of use of the camera phone, but sometimes the pictures aren't are high of quality as I would like. I have only had this camera for a short period, but recenlty used it at the zoo and the zoom and details of some of the animals came out amazingly. I love the continuous picture option, especially when my kids are running around or moving, as I have a 2-year old and a 8-month old.The black and white option on the camer is great. The pictures come out so clear everyone I have shown the camera to has loved it. In fact, I am buying one for my brother-in-law for his birthday.", "Date": "June 6, 2014"}, {"Title": "Great Value. Great camera.", "Author": "William Cinadr", "ReviewID": "R19NZ96T7GP3YS", "Overall": "5.0", "Content": "Graduation present for our daughter. She has always been a good photographer. Now she is more of a full-featured one. This camera was recommended by a friend who is a published photographer. He has more high-end cameras but made the recommendation based on specs. She has since signed up for some on-line (free) photography classed.", "Date": "June 5, 2014"}, {"Title": "GOOD BYE FOR THE MONEY.", "Author": "akkelley", "ReviewID": "R1AJUWI2CP399S", "Overall": "4.0", "Content": "WELL THIS IS A GOOD STARTING CAMERA. I BOUGHT IT FOR MY GRILFRIEND AND SHE LOVE IT. THIS IS A  46 X OPTICAL ZOOM. IT SAID RIGHT ON THE CAMERA LENS. NOT SURE WHY THEY KEEP SAYING IT IS A 42 X .I USE ....PRO TYPE DSLR CAMERAS.... ( SONY A 77 AND A99 ALFA  MODELS.) BUT THEY ARE A LITTLE TO BIG FOR HER. TO HEAVY AND HARD TO USE. BUT THIS CAMERA DOES A MILLION THINGS. GREAT PRICE AT AMAZON . COM.  S MM.OME TIMES I EVEN USE THE CAMREA BECAUSE OF THE BIG ZOOM RANGE. TO PHOTOGRAPH ANIMALS AT LONG RANGE. MY BIGGEST LENS IS A 600.MM LENS. AA BATTERYS HOLD UP PRETTY GOOD. AND YOU CAN GET THEM ANY WHERE. THE PANORAMA, ADV.,  SR AUTO AND SP STTTINGS WORK PRETTY GOOD MOST OF THE TIME. THE  LAYOUT ON THE CAMERA IS VERY WELL DESIGN. NICE COMFORABLE FEEL TO IT. THIS A NOT A ...DSLR CAMERA. BUT YOU GET ALOT FOR THE MONEY AT AMZON.COM..I PAYED JUST OVER 200.00 DOLLARS. I GAVE IT 4 * RATTING BECAUSE IT IS HARD TO FINE A BETTER CAMERA IN THAT PRICE RANGE.  GOOD SHOOTING OUT THERE EVERY ONE.", "Date": "June 4, 2014"}, {"Title": "Great camera", "Author": "Albert J. Coy", "ReviewID": "R2W6RGHK50IKZ9", "Overall": "5.0", "Content": "I really like this camera.  It was purchased to replace a Fuji 9000 that was lost.  Lots of great features, easy to use, still uses 4 AA batteries instead of usb or battery pack and takes great photos.  The only downside is that it does not come with a memory card.  Some of the features are you can make movies and take panaramic photos.  Both came in real handy the first time out using it.  Audio is a bit low for the movies in play back on a computer though.", "Date": "June 4, 2014"}, {"Title": "Great camera", "Author": "Dan White \"Dan Whitepath  Flutemaker\"", "ReviewID": "R1LW26VT0ZT7IO", "Overall": "5.0", "Content": "I have not used my new camera as much as I would like yet, but so far am very pleased.  I wanted to shoot video of RC planes in flight and am finding this a bit difficult, but it is with Any camera.  The view finder is useful for this however.  I have shot many stills of my new planes and helis and they all turn out great.  A nice little gray rat snake visited my wife's hanging basket of Petunia's and I got a super sharp, great shot of the rascal with his tongue flicking out.  I think this camera is top quality and as feature packed as many much more expensive brands.", "Date": "June 4, 2014"}, {"Title": "Camera", "Author": "Marti", "ReviewID": "R6XW5WJ66YW4G", "Overall": "5.0", "Content": "I was looking for a digital camera with a view finder & the digital screen I found both in this camera.  I have only used it a couple of times.  The picture image is awesome.  The cons is there is no internal storage.  All the other digital cameras I have owned always had a small amount of digital storage.", "Date": "May 27, 2014"}, {"Title": "Great camera for the money!", "Author": "Sandra L. Channin", "ReviewID": "R387GN8B4QEJCF", "Overall": "4.0", "Content": "This is my second fuji finepix camera. It is a fantastic camera with a view finder  for the money. I have a collection of many beautiful photos taken with fugi finepix.  My only small complaint is that the battery cover is difficult to close.", "Date": "May 27, 2014"}, {"Title": "Nice Camera but not perfect", "Author": "Nightwing's Fan \"starchild212\"", "ReviewID": "R360K1AJ407Y7R", "Overall": "4.0", "Content": "Camera takes decent photos with zoom. Took some decent shots from a balcony at a concert.  Takes nice photos in HD /widescreen.  Have to really press in record button to film footage.  Color is crisp.  Filming looks great in black and white but the audio does sound a bit tinny--odd thing about it is it don't countdown AND shows time left on memory card to film.  Menu can sometimes be hard to navigate--they don't give you a booklet manual--but one on a cd-rom.  Much life used with Duracell batteries. For the price it is really good for what it does.", "Date": "May 19, 2014"}, {"Title": "Excellent bridge to dslr", "Author": "STEPHEN", "ReviewID": "R2NYBH3IDEVN0W", "Overall": "5.0", "Content": "Easy to use, great battery life and the range of the zoom is excellentManual operations give a good opportunity to learn photography skill", "Date": "May 16, 2014"}, {"Title": "Love the Zoom!", "Author": "Brad Gray", "ReviewID": "R2UDFGTSR30MLN", "Overall": "5.0", "Content": "This is my first \"real\" camera. So I'm no expert, but with this 42x zoom I was able to take some pictures of a mother eagle feeding her baby from over 200 ft. away and It looks like I was right next to them. I'm a happy camper.", "Date": "May 12, 2014"}, {"Title": "interesting package", "Author": "Stephen", "ReviewID": "R2DI46AY7HWSPI", "Overall": "4.0", "Content": "so far this  has proven to be a good product, pictures are full of colour ant the zoom is great", "Date": "May 9, 2014"}, {"Title": "Awesome", "Author": "Ray Lockwood", "ReviewID": "R1KVX2JBNZMISW", "Overall": "5.0", "Content": "I bought this for my wife for birthday and Mother's Day and she loves it.  It is perfect for a person is starting out and wants something more than a point and shoot camera.  It was priced right and has enough features to keep her learning for a while but the ease if she wants to point and shoot.", "Date": "May 8, 2014"}, {"Title": "great deal wonderful cameria", "Author": "trapper", "ReviewID": "R2X6JDM5P6XDUG", "Overall": "5.0", "Content": "great deal wonderful camera,so many things you can do,I bought this for my son and he uses it every ware go loves it", "Date": "May 7, 2014"}, {"Title": "I love the Fujiflm FinePix S8200", "Author": "John D. Morse", "ReviewID": "R2FH2W4UJ6NWZI", "Overall": "5.0", "Content": "I love it. It is everything I expected. I would buy it again. I would recommend the camera and seller. Great value!", "Date": "May 1, 2014"}, {"Title": "great deal", "Author": "SHarda", "ReviewID": "R7PC35ZFVY5BO", "Overall": "5.0", "Content": "Excellent, value for money. I would recommend this for beginners. I'm am still sorting out the the full features but the picture quality is great.", "Date": "April 29, 2014"}, {"Title": "Battery Life Awful!", "Author": "gobucks", "ReviewID": "R2V6B81ARCN8AB", "Overall": "2.0", "Content": "The features of this camera are great... when the batteries aren't drained! After first purchasing, I noticed my rechargeable batteries weren't lasting very long. I assumed it was either the brand or the fact that they were a little older, so I purchased a new set of rechargeables in a different brand. The new set lasted as long as the old set, for maybe a total of 50 pictures before the camera shut down. I don't know if I got a camera with a bad connection in the battery compartment, but I hate having to take two spare sets of batteries just for casual photo shooting. I'm not using any of the fancy features or camera settings, and I've never shot a video with it. It sounds like other people are having better luck with their camera, and I did lots of research before choosing this model, assuming I'd have just as positive of an experience. I've contacted the company for suggestions, and I will add to my review after I (hopefully) hear from them.", "Date": "April 27, 2014"}, {"Title": "Great caamera", "Author": "Coxey", "ReviewID": "R1I3TLY0TVS4PU", "Overall": "5.0", "Content": "Has many of the features of more expensive models, without the size, weight, or cost.Easily totable. Great pictures.Great camera.Great price.", "Date": "April 27, 2014"}, {"Title": "love this camera", "Author": "Dee Dee Padilla", "ReviewID": "R3U5DZELQLOK1O", "Overall": "5.0", "Content": "i used to have a Canon - but the batteries always needed to be changed,, this camera works ALOT better and i would recommend this camera for all", "Date": "April 24, 2014"}, {"Title": "poor viewfinder", "Author": "Amazon Customer", "ReviewID": "R2HC4E7V7KZ1ZO", "Overall": "2.0", "Content": "This camera was bigger and heavier than I wanted, but so few cameras for the \"lazy\" photographer who is not trying for a Pulitzer, just wants a decent vacation pix, have an eye piece anymore.  Apparently many people don't bother to frame a picture before snapping since most screens are not visible in even moderate sun.  The eye piece in this is a TV screen with very poor resolution and I find it frustrating to use.  I also wanted a camera that could take fast flash pix of my active grandkids.  While it does freeze the action well, the flash takes its time about being ready to go.  The stabilizer in the camera seems pretty good, I can manage to take much better telephoto shots with this camera and action shots come out remarkably clear.  Again, I am lazy, no tripod for me.  The various options on the camera are far more complicated than I wanted and I don't have the patience to make learning to use the camera a big priority. It's not intuitive IMO.  Also I find colors are a little off.  I also haven't figured out how to use it in bright sun.  I really hate having to try to re-set all the parameters every time I want to take a picture. It definitely has some features that are better than my old camera, but it certainly isn't the camera of my dreams.", "Date": "April 21, 2014"}, {"Title": "Fine Camera", "Author": "Darth Corvus", "ReviewID": "R26SDWGCJWEZJT", "Overall": "5.0", "Content": "Everything you would expect from the product description. My wife loves it and prefers it over the similar Canon model this one replaced.", "Date": "April 21, 2014"}, {"Title": "I love it!!", "Author": "melissa brown", "ReviewID": "RV9ZDPCODCEUK", "Overall": "5.0", "Content": "I love the many features this camera offers and the price on Amazon was much better than in the store", "Date": "April 18, 2014"}, {"Title": "Great", "Author": "Ava H. Coley", "ReviewID": "R3KQS21RLQFSQM", "Overall": "5.0", "Content": "This was an excellent shopping experience.  I wish all my purchases could be made online with as little hassle as these. Great Shopping Experience.", "Date": "April 14, 2014"}, {"Title": "Truly a professional best gift", "Author": "summer", "ReviewID": "R20PHMIKJLKDFI", "Overall": "5.0", "Content": "I purchased this camera for my best friend since her last camera got stolen being a lot more professional and alot more in depth in photography than me I knew she was stuck in the cannon or Nikon age but when I saw the features on this camera with the zoom range of 42 x without an attachment lens and the use of a rechargeble aa battery I knew she would jus fall in love with this and I was right she loved it and even said she never had looked at fijifilm cameras before !", "Date": "April 12, 2014"}, {"Title": "LOVE this camera", "Author": "Dave Martin", "ReviewID": "R1BTM4V04KIEJU", "Overall": "5.0", "Content": "Okay.. to start with, I am NOT a photographer...  I'm just a point and click kinda guy and for the past 4 years have only used my smartphone for pics.  I have 2 great trips coming up and wanted a nice camera.  Received this yesterday and started playing with it.  I cannot believe the pics it takes on the Auto setting.  I have lots more playing around to do trying out all the settings, but I can tell already that I love this camera.", "Date": "April 11, 2014"}, {"Title": "Pretty good", "Author": "C. scott", "ReviewID": "R19GH7FYDZL4OH", "Overall": "4.0", "Content": "I have taken some great photos with this camera! There are somethings I wasn't impressed with though. 1) It didn't take very good pictures of stars, or moons. 2) while zooming in and out on a video, you can't hear anything but the lens moving. Other than those things, it is really quite good. I love taking pictures of sunsets and other fun landscapes. If you can't get anything over $200, this is pretty good when you know all of the special effects and such.", "Date": "April 9, 2014"}, {"Title": "Better than I expected", "Author": "Kim Frymire", "ReviewID": "RVK483X8C14XU", "Overall": "4.0", "Content": "I have a nother Fujifine pix 30X optical that I broke the viewfinder on. The S8200 ended up having better stabilization with a greater optical zoom and the lowlight setting is a big improvement. I primarily use it for shooting in low lighting in concert situations. Happy with my shots so far.", "Date": "April 7, 2014"}, {"Title": "It's OK", "Author": "J. Landry", "ReviewID": "R2638GJXGBZQME", "Overall": "3.0", "Content": "Nothing special. I knew what it was when I bought it. It works as advertized. Overpriced for it's usable life span. I use this simply as an event/data recorder. In other words a throw away; If it's stolen I haven't lost much. This is not for serious photography.", "Date": "April 2, 2014"}, {"Title": "Unbelievable camera for the money!", "Author": "Farmerdan", "ReviewID": "R3N3GE0W02M19H", "Overall": "5.0", "Content": "This is by far the best camera I have owned.  I have always had a compact digital camera but it was time to move up to a nicer camera. There are many things going on with my family that requires a very good camera that takes good pictures and movies.This is the one.....  telescopic lens for extremely far off things etc.  I just take out the SD card and pop into my laptop to down load the pictures and movies ....  sending them via email to my family and friends is very easy.Highly recommend this camera...............", "Date": "March 29, 2014"}, {"Title": "This is a great camera", "Author": "Carlene Lind-Baker", "ReviewID": "R22DI5WJMLR5X", "Overall": "5.0", "Content": "I just love this camera. It is lightweight and easy to use.  I've taken several pictures and found the pictures to be clear and sharp for me.  If you want a digital camera that is easy to use, then I would definitely recommend this one.", "Date": "March 28, 2014"}, {"Title": "amazing", "Author": "J. Silvers", "ReviewID": "RX95UHHGSQS8N", "Overall": "5.0", "Content": "My wife loves to take pictures and the camera she had was a little old so I got her this she absolutely loves it she said it is great she takes so many pictures of our kids and grandbabies I am glad I got it for her", "Date": "March 27, 2014"}, {"Title": "My third Fuji FinePix.", "Author": "Edgar F. Garner \"Mt. Man\"", "ReviewID": "RJL0FVQJHO44G", "Overall": "5.0", "Content": "My third Fuji because it takes great pictures when you are not a pro. I have had some folks say my pictures are pro. The reason I keep buying another is to get the greater zoon in one package. The second best thing is Fuji only requires AA batteries you can find everywhere. My older Fuji's still work great but I keep liking the newer one even more. Can't tell you how many folks go on vacation and have a hard time finding special batteries for their cameras. Want a great camera and a good deal, buy Fuji and get the Fuji case, it is also great.", "Date": "March 26, 2014"}, {"Title": "I lve my new camera", "Author": "the deandrea's", "ReviewID": "R24NEVYXTLS18U", "Overall": "5.0", "Content": "I brought this as a starter camera and it is very good. it has amazing quality. I took this picture of a hummingbird and it looks so clear and its so detailed you can see each part of it.", "Date": "March 19, 2014"}, {"Title": "Awesome camera", "Author": "Elizabeth Howard", "ReviewID": "R3M614QNEXOG7H", "Overall": "4.0", "Content": "I had 2 friends recommend Fujifilm camera.  I am very happy with this one.  The only problem I have is that the Basic Manual, that was listed as coming with the camera, was not included.  To me this is an important item that you would carry with your camera.  I have contacted Fujifilm about this but they have not replied.  Still, I would purchase this camera again.", "Date": "March 17, 2014"}, {"Title": "Satisfied Customer", "Author": "Coleman Travis", "ReviewID": "R12ODSWYC8D9PY", "Overall": "5.0", "Content": "Though I have been told that camera's with view finders are \"not the thing of the future\" the camera will meet my needs. The fact that I had the opportunity to purchase a protection plan online gave me confidence in the seller.", "Date": "March 17, 2014"}, {"Title": "Good camera for amature photographers", "Author": "Citi", "ReviewID": "R22Q33QRNHT5EI", "Overall": "5.0", "Content": "I am not a professional photographer however, I took an opinion from a friend who knows cameras. He rated it pretty good. I find this camera a real good, still exploring real all its attributes and slowly I am falling in love with it. A good piece of equipment for the price I paid.", "Date": "March 17, 2014"}, {"Title": "I LOVE IT!", "Author": "Laura Wheeler", "ReviewID": "R3HS4GZIFNZW54", "Overall": "5.0", "Content": "This camera just fits my hand to a T ... takes beautiful pictures from the wide angle to the longest telephoto with it's impressive lens.  I especially like how I can take portrait shots of my grandkids running and playing without their knowing it.  I have gotten some really good ones ... and I am so pleased at the ease of it.  I really bought this for my upcoming trip in an RV to Alaska this summer ... and a transatlantic cruise and visiting with friends in Spain in April and May.", "Date": "March 15, 2014"}, {"Title": "Loaded wit many features, Great zoom lense.", "Author": "Gottfried F. Metzler \"Ole Photographer\"", "ReviewID": "R2OF8HPDIKTF46", "Overall": "5.0", "Content": "This is my third FinePix camera. It has may steps up in quality and ease of use.  The night-time exposure feature is wonderful. The panoramic feature is much improved.", "Date": "March 9, 2014"}, {"Title": "Nice and easy", "Author": "eveline kanganis", "ReviewID": "RZQ3SINACR02D", "Overall": "5.0", "Content": "Love the camera. Easy to use. Happy I made the purchase. Recommend it to someone looking for a great inexpensive camera.", "Date": "March 2, 2014"}, {"Title": "Fantasitic camera for the price", "Author": "rgernst1", "ReviewID": "R3N5TQJQTR2P78", "Overall": "5.0", "Content": "I chose this camera after doing considerable research on many in this price range.  The features and photo quality are fantastic for this price.  I was suprised that no operating manual was included but it was not a big deal to down load the correct manual.  I am delighted with the unit thus far", "Date": "March 2, 2014"}, {"Title": "It came early!!!! YEA!!!!", "Author": "Jeanette Link", "ReviewID": "R2WLMTSH88RJTN", "Overall": "4.0", "Content": "This was the whole reason for a birthday combo gift and it came in one month early!!! Thank you so much. My soon to be 13 year old is very happy with ease of use and the quality of the pictures!", "Date": "February 25, 2014"}, {"Title": "Fujifilm s8200", "Author": "photo hobbiest", "ReviewID": "RKA85R74LK0ID", "Overall": "4.0", "Content": "I have two Canons, and I love them.  I bought this so I could have a camera with me most of the time.  It is great for what it is.  I doesn't take the quality shots that the Canons do with lenses that cost a few times more than the Fuji.  It pretty much does what I expected it to do, and I like it.  The manual controls are not quite a versatile as I would like, but they give me some flexibility beyond automatic.  The control wheel is a little sensitive and difficult to get it to do what I want it to without bumping into something else, especially with cold fingers.", "Date": "February 21, 2014"}, {"Title": "Fabulous Camera for the Price", "Author": "Jerrel E. Phillips", "ReviewID": "RY08Y72I7YBPX", "Overall": "5.0", "Content": "I bought this camera as a bridge camera when I didn't want to be carrying my DSLR. In the past I've always owned Canon cameras and this time I was again expecting to buy a Canon. However, when features and price were factored in there is simply no way that the Canon bridge cameras will measure up--particularly when they are producing cameras that do not use AA batteries and then have well documented problems with battery life. Nevertheless, I was hesitant to go with the S8200 because of some reviews of poor picture quality. I needn't have been.The picture quality on the S8200 is equally as good as the Canon Poweshot cameras I've owned in the past. The lens is equally as sharp, though a bit slower. As far as features go the S8200 cannot be beat in this price range. I have taken it on outings doing landscape work, birding etc. and it performs as expected.The only drawbacks I've noticed concern low light performance. The camera does have problems focusing in low light situations, but then, I've also found that this can often be corrected by using one of the special settings that are there to handle such situations.While I haven't used the video much at all, when I have used it I have gotten excellent quality images and they have been easily uploaded to Windows Media Player or other such software such as Corel.The bottom line is that this camera performs amazingly well for a bridge camera. It is not a DSLR, so don't expect it to perform as one. However, I highly recommend the S8200 if you are looking for a camera that feels good in your hands, has plenty of features, produces good images and therefore prompts you to take more pictures--which is what a bridge camera should do.", "Date": "February 17, 2014"}, {"Title": "great camera", "Author": "LB", "ReviewID": "R2B70M4XPVJC23", "Overall": "5.0", "Content": "I bought it for my husband for his Birthday gift.  He is very happy with it. It takes great pictures and has a multitude of settings for various shots. The price point was right for my budget too. All said.....great bang for your buck!", "Date": "February 16, 2014"}, {"Title": "very satisified", "Author": "M. Powell", "ReviewID": "RVYX2AV5A47RL", "Overall": "5.0", "Content": "I am a very pleased with this idem. It is everything i expected it to be and more. Great Camera", "Date": "February 15, 2014"}, {"Title": "Great Cam", "Author": "JoAndra Van Dowall", "ReviewID": "R8M4DX6WS50H4", "Overall": "5.0", "Content": "I'm still learning how to use this camera, both still and video. The only problem I haven't solved yet is how to focus from a distance. I have some vids that are a bit blurry. I'm sure I can figure that out. Overall, I give this item a 99% satisfaction.", "Date": "February 13, 2014"}, {"Title": "Nice camera", "Author": "kenneth mason", "ReviewID": "R2RUEN8WQ6YQSY", "Overall": "4.0", "Content": "The camera is easy to use and a viewfinder makes it great for bright conditions. The zoom is amazing and provides sharp pictures. I have a digital SLR that I love but for every day use this camera in much easier to use. I would recommend it for vacation travel and all around photo needs.", "Date": "February 4, 2014"}, {"Title": "What A Deal", "Author": "Guy G.", "ReviewID": "R2H4CXUEPPUMYG", "Overall": "5.0", "Content": "I have always liked and used cameras of different capabilities.  A close friend of ours introduced me to this camera and I felt I just had to have one also.  I am not at all unhappy with my purchase.  I am still learning all the wonderful features that this camera has to offer.  I highly recomment this product to anyone who enjoys great pictures and lots of value for their money.", "Date": "January 31, 2014"}, {"Title": "Very good", "Author": "Francisco Izurieta", "ReviewID": "R1B1RRZKBBTZ40", "Overall": "4.0", "Content": "Very good quality and technology, much more than price.I would request to improve the menus but, it's ok for standard.", "Date": "January 24, 2014"}, {"Title": "Nice features but lacking in picture quality", "Author": "T Wilson \"fitwilsons\"", "ReviewID": "R1GHCEYHCHIJGK", "Overall": "3.0", "Content": "I'm not a photographer so maybe if I was more knowledgable I could've made this camera work for me, but i'm not and it was sent back.  The features are great!  I wanted to like this camera SO much!!  I did a bunch of research and narrowed it down to this model for my price range/needs.  In the end, my iPhone 5s took better quality pictures so this was returned.The zoom is great.  We live in a woodsy area and have a lot of wildlife to snap pictures of and this could zoom in to capture the best shots.  In fact the outdoor pictures were fine.  When I took indoor portraits of my daughter with this and my iPhone, the iPhone just took a much better picture.  The color was amazing, the shading was just right and it was crystal clear.  With the Fuji, the color was too washed out and harsh, there were more shadows and the picture looked more \"grainy\" (noise I believe it's called?).I ended up getting a Nikon L820 instead.  I debated because the Nikon lacks some features that I really wanted (a viewfinder for one), but the picture quality is better and that's what I need.  It's also smaller and easier to tote along.", "Date": "January 18, 2014"}, {"Title": "Fuji S8200", "Author": "floyd", "ReviewID": "R39GU5WWUQ4JD8", "Overall": "5.0", "Content": "shipping on time, made it in good shape. $185 i think that was a steal, i call it buy'n a last years model. it be'n my first real camera an all i got nothing to compare it to. well im off to play with my new toy. P.S. have to say i is real happy!", "Date": "January 17, 2014"}, {"Title": "Excellent buy", "Author": "Michael Zamzow", "ReviewID": "R38Q2VPCZNKR8U", "Overall": "5.0", "Content": "This camera does everything, It's automatic modes work perfectly. Customization of settings is relatively easy to figure out. One wish: remote capability. Realized this after the need arose.", "Date": "January 7, 2014"}, {"Title": "Love the camera", "Author": "Karen M.", "ReviewID": "RQDJKSE34YKUS", "Overall": "4.0", "Content": "Absolutely love this camera.  Easy to use.  My only complaint is that the day after I received it the price went down by $20.00.", "Date": "January 6, 2014"}, {"Title": "Quality", "Author": "Tylor R Frailey", "ReviewID": "R2VUVJP5D695M4", "Overall": "5.0", "Content": "Such a great camera for the price! You would think you get what you pay for, this being in the cheaper side of cameras, u actually get a lot more then I realized with quality.Only down side, drains batteries pretty quick . Get a lot of rechargeable ones!", "Date": "January 3, 2014"}, {"Title": "had it only for about a week. Works as advertized", "Author": "someone", "ReviewID": "R2DY5THMIY15R4", "Overall": "5.0", "Content": "Great pictures and videos, agree with most other reviewers. Panorama mode is awesome! Not long enough to write a detailed review but it appears this is a great camera for the casual user.", "Date": "January 1, 2014"}, {"Title": "Good camera", "Author": "Jared Hatch", "ReviewID": "RLGFEH8B5XHIE", "Overall": "4.0", "Content": "Good camera. The auto modes actually work quite we'll for me. My wife had trouble with the auto-focus at first, but she's got it now.", "Date": "December 27, 2013"}, {"Title": "Wife's happy", "Author": "nappydrew", "ReviewID": "R14LXNEK18UIQ1", "Overall": "5.0", "Content": "Wife's happy, therefore, I'm happy.I thought my iPhone took nice pic's.What do I know? I'm not a photographer", "Date": "May 6, 2014"}, {"Title": "Video feature not what I expected", "Author": "Jeffrey S Sudds", "ReviewID": "RRUCO24LH5YMF", "Overall": "2.0", "Content": "The camera itself was OK. It had a little trouble focusing but admittedly there may have been some user error. However, when I used the video feature it definitely was the camera having trouble focusing on the subjects in the video. The biggest thing though was when I would zoom in and out you could hear the zoom of the camera in the video! You can hear \"fzzzzzzz\" zooming in and \"fzzzzzzz\" zooming out. It was so stupid. I returned the camera.", "Date": "May 5, 2014"}, {"Title": "Perfect!", "Author": "Kathleen Staley", "ReviewID": "RJVN2LS9TA8AL", "Overall": "5.0", "Content": "This camera does everything and then some!  The pictures are very professional looking.  The zoom works great, too.  Absolutely love it!", "Date": "April 6, 2014"}, {"Title": "great camera", "Author": "twylyte", "ReviewID": "R2OVHB1UICGDYS", "Overall": "5.0", "Content": "i've had the s8200 since January and i love it. it's great for on the go shooting. it's not a high end dslr, it is a bridge camera so as long as you know what you are buying it is a great camera for the price. it does not have inter-changeable lenses, it does not have a hot shoe, it goes through tons of 'AA' batteries BUT it takes great pictures, it is light-weight, and has a lot of the options that mid-range dslr's have for a great price. if you are just starting out or you need a low price, good quality, reliable backup camera; this is a great choice.", "Date": "April 5, 2014"}, {"Title": "Great camera", "Author": "Annie \"country girl\"", "ReviewID": "R2YHXJF1YN292", "Overall": "5.0", "Content": "I upgraded my camera to this one, I love it, all the features it has, my favorite one is the panorama picture, the camerai is easy in handling, takes great pictures and made it my hobby, photography, even more enjoyable. I had many cameras before, also Kodak but this is the best of all of the ones I had.", "Date": "January 20, 2014"}, {"Title": "GREAT LONG ZOOM POINT & SHOOT", "Author": "Amazon Customer", "ReviewID": "R2GF4UWQSRD16E", "Overall": "5.0", "Content": "I'm giving this 5 stars for a point & shoot.Autofocus is fast.Long zoom shots can be taken handheld.Expect some digital noise in the photos. I think this is unavoidable with today's point & shoots after trying out several over the past year. The noise is less than what is produced with the Fuji Finepix F900EXR.This camera can take nice close up portraits indoors with the flash. It will usually choose ISO 100 resulting in no noise, & the colors are true to life with detail in the picture.The flash covers a good range & produces good color in the photos. If not using flash indoors expect iso from 800 to 1600 with noise, but the photos are still usable & look nice at normal size prints.Camera uses 4 AA batteries, so we bought a nimh battery charger & 2400 mAh rechargeable batteries.This camera surprised me in that in can produce pretty blurry backgrounds with close up macro shots or full zoom in full auto mode. This is my 8 year old son's camera, & he has done it several times w/o trying.Video is great for not being a dedicated camcorder. 1080p with continual autofocus. No complaints. If you're looking at Fuji Finepix F900EXR & want video, skip it. Video is poor.", "Date": "January 11, 2014"}, {"Title": "SLR quality at a fraction of the cost", "Author": "Grand Wazoo", "ReviewID": "R7FTFIR3QPYAH", "Overall": "5.0", "Content": "Spent quite a bit of time researching cameras before buying one, and found lots of positive comments about this one.  Reasonable price with many features.  Sure, the badge whores would never consider anything but a Canon, but feature for feature, this camera delivers almost as much for a fraction of the cost.", "Date": "January 10, 2014"}, {"Title": "Perfect", "Author": "Jeramy", "ReviewID": "RZ7ZDIQF8N98B", "Overall": "5.0", "Content": "This camera does exactly what I want. Got it at a great price. Others like it go for around the 1000's of  dollars range. The zoom the angle the clearness, HD, it truly has it all", "Date": "December 14, 2013"}, {"Title": "super camera", "Author": "James H. Foster", "ReviewID": "RUHRNHKM5N6VW", "Overall": "5.0", "Content": "great camera.  no problems.  easy to use; great photos.  good size for woman's hand.  no problems or cons; no complaints", "Date": "December 3, 2013"}, {"Title": "Excellent prodict and price", "Author": "Jitty Kitty Closet, Inc - Jitty Kitty", "ReviewID": "R1TA44LPC3TC6C", "Overall": "5.0", "Content": "Very impressed with the capabilities of this camera. Excellent price for the product we received.Was son's graduation gift and he loves it!", "Date": "November 28, 2013"}, {"Title": "As good as one twice the price", "Author": "Christopher Owens \"everything samsung\"", "ReviewID": "RYILYQJQXPCCV", "Overall": "4.0", "Content": "I absolutely love it. I took pictures of a boat 5 miles or more away from my beach balcony. Excellent camera", "Date": "October 25, 2013"}, {"Title": "Not for me!", "Author": "Melissa Mermaid", "ReviewID": "R2ZHX8POTE2EBV", "Overall": "2.0", "Content": "... and sadly, probably not for you either--if quality, depth, clarity, and vividness are important to you. I wanted to like this camera b/c it's reasonably priced and I'd seen a couple of photos on Flickr thought made me believe it could compete with cameras like my Panny line. Not even close. It was pretty much like taking a picture with a cellphone--if that. The only good thing I can say about it is that the super macro is very amazing. I got so close to a flower that I ended up with pollen on the lens. Only problem is the resulting picture still wasn't of the quality that I would be proud to show it. Way too noisy (with or without flash); the zoom is very very noisy as well--not just when taking video but when just taking pix; shutter button takes more effort that it should to take a picture; and the battery compartment lid feels like it would break extremely easily when using the camera frequently--and sadly that's also where the SD card goes as well (I transfer my pix via the SD card plugged into my laptop--lots of transferring). .Sorry. had to send back.", "Date": "March 6, 2014"}, {"Title": "Awesome, but not perfect.", "Author": "S. Benda", "ReviewID": "R1B2B2W2FMY785", "Overall": "4.0", "Content": "Took this camera to the Badlands and Devils Tower to see how it does with landscapes. Controls and many features weresimilar to my Nikon Coolpix. One big plus is the zoom. Incredible smooth zoom action that gives much more control than Nikon,plus the 40x is worth the purchase. Most landscape and wildlife shots were taken either at dawn or late morning, and majority areexcellent.However, some canyon shots are very underexposed, which is surprising since the lighting was perfect. Also there was severalshots at Devils Tower where the color saturation was way off. Some of these \"errors\" might be my own fault, since I did not have achance to practice with the Fuji before vacation.Overall I am very satisfied, though, with the camera and hopefully with more practice can eliminate the few bugs I found.", "Date": "September 22, 2013"}, {"Title": "Nice zoom", "Author": "Amazon Customer", "ReviewID": "RUCXGO2PT86JY", "Overall": "3.0", "Content": "The view finder is horrible. It's blurry and seems only good for a general framing of the picture. All other features work well", "Date": "March 2, 2014"}, {"Title": "Features, Quality, and Price", "Author": "John M. Graves", "ReviewID": "RE2T8L4WF191U", "Overall": "5.0", "Content": "Shop all you want. Compare all you want. This little camera from Fujifilm is full of features that you will not find all in one camera from the major brands. The price should make Nikon, Canon, Olympus, and Pentax shutter!", "Date": "February 25, 2014"}, {"Title": "LOVE IT...", "Author": "M. Velasquez \"Curioso\"", "ReviewID": "R38AN8P6A2Z5K4", "Overall": "5.0", "Content": "THIS CAMERA WORKS VERY WELL AND THE OPTICAL ZOOM (40X) IS ONE OF THE REASONS I PURCHASED IT.... THE PRICE WAS THE SECOND REASON AND THE PICTURES IT TAKES ARE VERY BEAUTIFUL.... I WOULD CERTAINLY BUY ANOTHER  \"FUJIFILM\" PRODUCT.....", "Date": "February 22, 2014"}, {"Title": "Great Fugi product", "Author": "lindsey", "ReviewID": "R17CPITA9PVMJ5", "Overall": "5.0", "Content": "Haven't had a lot of time to use it, but so far it has been an excellent piece of equipment. Downloaded instructional manual which makes it easier. Great price and will accomplish an array of tasks.", "Date": "January 29, 2014"}, {"Title": "Great cam for that price", "Author": "Mauricio Cortes", "ReviewID": "R83PA14HVSIWY", "Overall": "4.0", "Content": "Good overall performance and many functions for a low price.I would like Manual Focus in this camera, but it is just a bridge model.", "Date": "April 16, 2013"}, {"Title": "great camera", "Author": "Gwen Niccum", "ReviewID": "RLYFKCKRXJKVV", "Overall": "4.0", "Content": "The only thing that would make it better is to have camera function work with rechargable system and not 4 batteries", "Date": "December 31, 2013"}, {"Title": "Kick A$% Camera!!!", "Author": "KillerBees", "ReviewID": "R2OC2PZMK38O6Y", "Overall": "5.0", "Content": "This camera has so many features and is a great price! I'm looking forward to putting it to good use!", "Date": "November 14, 2013"}, {"Title": "Very nice!!", "Author": "José Ramos", "ReviewID": "R3CTV5NS2IP2M0", "Overall": "4.0", "Content": "This is my first fuji film camera. I hope it's good brand. Is a excellent choice for quality and price. Recommended", "Date": "October 3, 2013"}, {"Title": "very bad picture quality", "Author": "Rodrigo", "ReviewID": "R11BD8PDY6SZP6", "Overall": "2.0", "Content": "I am very disappointed about the quality of the pictures, it has a lot of noise and the colours are kind of pink. The other features of the camera seems to be OK.", "Date": "January 2, 2014"}, {"Title": "Great Camera", "Author": "Daniel", "ReviewID": "R1S9NJH9S2ZAZY", "Overall": "5.0", "Content": "I love this camera. It is what I wanted and then some. I would buy it as a gift for my family.", "Date": "February 2, 2014"}, {"Title": "Amazing!!!!", "Author": "cadence crovetti", "ReviewID": "RH3AWDIKKQDJ2", "Overall": "5.0", "Content": "This camera is amazing!! I read reviews and researched for months and couldnt decide on a camera. I am so glad i got this. The zoom and shutter speed are amazing! I am not a camera pro but the pics i can take on this are excellent!!", "Date": "February 1, 2014"}, {"Title": "great camera", "Author": "Willa Baker", "ReviewID": "R157BS44ERWP0Q", "Overall": "5.0", "Content": "Clear pictures, easy to use.  The price was great $300.  We really feel that we got our money's worth with this product", "Date": "January 29, 2014"}, {"Title": "Limited Aperture Settings", "Author": "B. M.", "ReviewID": "R23BELUFW3ZI25", "Overall": "2.0", "Content": "At the short end, you can only get three aperture settings in manual mode: f/2.9, 3.2, and 8.4.  That's right.  It jumps from 3.2 all the way to 8.4.  There's no way to get other settings like 3.5, 4.0, etc., unless you zoom out which is rather weird.  I called Fuji and was able to reach a helpful tech support person very quickly on the phone.  He told that's actually the way the camera was designed and that's just the way it is.  He actually agreed with me that it's odd for a camera to limit you like that.  He said the S series is meant to be a limited feature model.I ended up shipping the camera back.  It's a shame that anyone would put out a camera that does that.  And there's nothing in the specs to warn you about this.  Very disappointed.", "Date": "February 20, 2014"}, {"Title": "Just received the S8200 yesterday", "Author": "William W. Weikel Jr.", "ReviewID": "R1JNWM5C0MRDAJ", "Overall": "4.0", "Content": "I'm still playing with the camera and reading the disk supplied product manual but I believe this is going to be a fantastic camera once I figure out all of it's capabilities.  After I use it a few times I'll give it an upgraded review, but for now I'm a happy happy novice photography. All the reviews seem pretty encouraging. Four stars because I really haven't used it yet.", "Date": "December 14, 2013"}, {"Title": "Very Disappointed", "Author": "Mikey", "ReviewID": "R1Y0SP7EKQYN1B", "Overall": "1.0", "Content": "Missing the WOW factor! Took a lot of pictures, under a variety of settings, of many subjects, under different lighting conditions, and didn't get one image that validated my decision to buy this camera. All the gimmicks and features in the world don't make up for poor picture quality. Pictures in general were noisy, blurry, and contained digital artifacts. Used the automatic setting and took HD video. Later, when viewing the video, I could hear the auto focus click-click-clicking as it hunted for the correct focus. I suspect there's a way to avoid that but I assumed automatic meant automatic and all I had to do was point and shoot. I took some video of the same scene using my Motorola smart phone and compared them side by side. The phone video was better than the camera video.I have enjoyed the digital photo/videography hobby for many years and have owned  many digital cameras so I'm not a novice. But I wasn't able to find the sweet spot with the S8200 and didn't feel it should have been necessary to search for it.One last item . .  there is NO manual focus on this camera, a critical requirement for taking long focus images.", "Date": "September 24, 2013"}, {"Title": "Did not meet expectations", "Author": "Larry", "ReviewID": "R3DVEY26PBDX2T", "Overall": "2.0", "Content": "Bought the Fuji as a smaller version of a \"regular\" digital SLR that we had been using for years. Picture quality of the Fuji was poor in comparison to the Sony SLR.  Returned the Fuji as it just didn't seem to be doing a good job with the pictures taken. Perhaps more time spent with it would have improved the results, but didn't want to get stuck with a camera we didn't like.", "Date": "August 30, 2013"}, {"Title": "Nice more than I expected!!!!!!!!", "Author": "SYLVIA HERNANDEZ", "ReviewID": "RAXDMV0PJNQSN", "Overall": "5.0", "Content": "Great camera with some great features more than I expected. Still haven't used it I'm waiting to use on my the cruise trip", "Date": "November 10, 2013"}, {"Title": "Batteries?", "Author": "Frank J. DeFelice", "ReviewID": "R3AZVQIQCX88M3", "Overall": "2.0", "Content": "This camera uses batteries (AA) which is not mentioned in the description. No rechargeable lithium battery.  Also, the rangefinder doesn't seem to work. You have to use the monitor.", "Date": "February 19, 2014"}, {"Title": "Colors goofy", "Author": "gary masterson", "ReviewID": "R1J02INHYU3OS2", "Overall": "1.0", "Content": "So I go out to shoot birds...Nikon and this camera.  Fuji colors about 60% as good.  They look washed out and do not blow up to poster size even tho there are more pixels than a Nikon 5100.  Also, my prime shipping took a week..", "Date": "February 16, 2014"}, {"Title": "Wished it would have worked", "Author": "Ann Blevins", "ReviewID": "R1F6KSZ2JNVKPT", "Overall": "2.0", "Content": "My family got this camera for me for my birthday and it only worked long enough to take 1 picture. :-( . It took several weeks to get my refund.", "Date": "December 6, 2013"}, {"Title": "it was awful", "Author": "Debra A. Spillane", "ReviewID": "R3RHSZ6VK6ZQZB", "Overall": "1.0", "Content": "i don't like it the quality sucks, it doesn't take the pictures fast enough and it doesn't focus very well either.", "Date": "May 2, 2014"}, {"Title": "It stopped working", "Author": "Dayana Zapata", "ReviewID": "R33PPWBWUTQRH3", "Overall": "1.0", "Content": "I feel very frustrated. The camera stopped working after two days. I did not have the chance to enjoy the camera even one time. Bad quality. I did not have the time to return it because I live outside USA and I left after I bought it. Not recommended.", "Date": "February 8, 2014"}, {"Title": "Beware People!", "Author": "Milanprima", "ReviewID": "RDFOO8P2F8NKY", "Overall": "1.0", "Content": "These numerous reviews are for several different cameras, not just the one you are trying to research.  I made the mistake of choosing one based on what I read in reviews and it turned out NOT to have a viewfinder after all. So now I have to send it back.  I think Amazon should not mix reviews for different cameras this way.  It is really deceptive advertising.", "Date": "January 21, 2014"}, {"Title": "Not what I expected", "Author": "robert", "ReviewID": "R205V2QFH53MKU", "Overall": "2.0", "Content": "The item description made it sound like a manual focus camera, but it's anything but that. It looks much higher quality than it really is, as it's just a blob of plastic. I should of realized this ofr the price. =D", "Date": "January 29, 2014"}, {"Title": "Fujifilm Christmas gift", "Author": "Bonita S. Gilbert \"yankeerev\"", "ReviewID": "R1JXJQKFTQSB1N", "Overall": "1.0", "Content": "I have no idea if this camera is any good because I can't use it.  My husband gave me this camera for Christmas.  The card said \"open me first\" so I could take family pictures with it.  This is the sixth digital camera we have bought, and it's the first one ever  that didn't come with a memory card.  So, no pictures.  There is nothing on the Amazon web site or on the box it came in that said anything about the memory card being a separate purchase. When I called tech support the woman was quite snotty about it.  I am feeling ripped off and NOT happy.", "Date": "December 26, 2013"}, {"Title": "big point n shoot with tiny sensor and noise", "Author": "kay bhee", "ReviewID": "R3F80EJIBC82CT", "Overall": "2.0", "Content": "VERY typical camera nowadaysi did NOT buy it, due to not sharp enuff, andtoo much noise even at iso 200not enuff for me... need more sharpness, atmax zoom...i want to SEE and read those signs mama....not blur them out of memoryhalf the people will be accepting of this cameraby Default..asthere are many many more worse cameras in our world todayjust lying around like reincarnated dirty mouse traps.so, if compared, this is stillsemi ok for most average people...its a point and shoot and its big... tiny sensor,noise, and the usual  usd 150 camera problems persist.duhh", "Date": "September 5, 2013"}], "ProductInfo": {"Price": "$499.95", "Features": "16 million pixels\n1/ 2.3-inch CMOS with primary color filter\n3.0-inch, approx. 460K-dots, TFT color LCD monitor\nFujinon 46 x optical zoom lens", "Name": "Fujifilm FinePix 16.2MP Digital Camera with 42x Optical Zoom (S8500)", "ImgURL": "http://ecx.images-amazon.com/images/I/41PWA1Wiz7L._SX300_.jpg", "ProductID": "B00AX12XTC"}}