{"Reviews": [{"Title": "Review by early owner and non professional", "Author": "audiodude", "ReviewID": "R2TIF1YE3KJ5WT", "Overall": "5.0", "Content": "I got the camers 3/15/13 and so far I am impressed. I am not a pro photographer but I do make software for a living. We make a product called iWatermark for Mac, Win, iPhone/iPad and Android so we quite a bit of experience with cameras. If you are interested our site is available with a search of Google (reviews don't allow links).This is my initial review. To get it out of the way the highlights are 50x zoom, Raw as option, video up to 440 fps (at very small rez). I've tried them all. They work as advertised and they are awesome features for a camera this inexpensive.Features* 16 megapixel BSI CMOS sensor. Photos look great.50x optical zoom lens (35mm equiv: 24-1200mm). Simply awesome.Great Optical image stabilisation3 inch 920k dot tilting LCD screen. Love the tilting LCD very handy when shooting over peoples heads. Also for shooting at kid or pet level.Hotshoe920k dot electronic viewfinder (EVF)Full 1080p HD video recording with stereo sound and at 60 fps.ISO 100-128001cm minimum focusing distanceHDR & panorama modesFull manual controls and RAW shooting10 fps continuous shooting full rez or down to 480fps (240 x 180 pixels) or 240fps (320 x 240 pixels) or 120fps (640 x 480 pixels).Many special effects.Switch on Time to Taking a Photo  2.55 secsShot to Shot without Flash  1.4 secsShot to Shot with Flash  2.8 secsI am still experimenting with the huge number of features in hardware and software of the camera and will report back when I get some time.It is the most powerful, versatile and inexpensive camera I've ever owned and I would recommend it highly. I have tried all the other super zoom cameras and this is the winner for me.PS To solve the squabble by two other reviewers the manual zoom is in the usual place by the shutter button on the right top and on the left side middle of the lens. It works well and smoothly with a bit of noise.", "Date": "March 19, 2013"}, {"Title": "Not a DSLR but very, very nice", "Author": "Tooncesmom", "ReviewID": "RCUATJPYRUG1X", "Overall": "5.0", "Content": "I was thrilled to be able to test and review the Fujufilm FinePix 16 Megapixel SL1000. It replaces a Canon Powershot G2 with 4 megapixels so is a huge step up for me. (And, to be admitted, a big learning curve, even though it's a \"point and shoot\" camera--at least for most of my photography.First of all, do download the online extended manual since the abbreviated one included with the camera is not completely accurate. One example: when charging the battery, the included manual states the charger light turns green. Not so. The orange LED turns off. I emailed Fujifilm Support to learn this tidbit. Also, if you're not familiar with the variety of shooting modes (Auto, Advanced, Scene Position, Motion Panorama, Shutter Priority AE, Aperture Priority AE, Manual and Custom) the included manual provides little detail. The downloadable 127-page extended manual is a necessity. I had mine printed on both sides and spiral bound since I will be referring to it constantly until I learn each procedure.The camera has many of the features of a DSLR, including a fantastic Fujinon 24 to 1200mm 50x zoom lens that is a combination of both spherical and ED lenses. With an aperture rating of f/2.9 - 6.5 (17 elements in 12 groups) you can count on great image quality. I've been shooting flowers in my garden and my jewelry creations using the macro in automatic mode and have been very pleased with the results. Even my hand-held shots are clear and detailed. A lever on the left-hand side controls the zoom and focus is automatic. Fujifilm offers 100x Intelligent Digital Zoom that brightens some of the darkest areas so my indoor shots are suitable for the high-quality images I need for my web page.The FinePix SL1000 comes equipped with a high-resolution electronic view finder that makes it easier to frame subjects (something I did not have with the Canon Powershot).I shoot mostly in JPEG (standard and fine) format but appreciate the ability to shoot in RAW. I'm still trying out the filters and the other shooting modes and will report back when I've fully evaluated these features. Also, I have not tested the HD video aspect.I like the size of the SL1000. Weight isn't a problem, but at just under one and a half pounds, it's a bit heavier than similar cameras due to the lens, and not something you could carry in your purse.The wide-angle LCD screen tilts to provide flexible viewing options for both high and low shooting positions, though for macro I prefer using the LCD screen in the flat position.The pluses far outweigh the negatives. Image noise has been mentioned ISO 100., but it hasn't been a problem for me. The lens cap detaches easily and is suspended by a cord so it won't be lost. Battery life is a problem, especially when using the zoom and/or shooting in automatic mode. Fujufilm's batteries are proprietary, but they are not expensive (under $20). I suggest keeping an extra battery or two on hand if you plan to shoot a lot of pictures. Charge time is under an hour with about 90 minutes for a first-time charge.Everything considered, I give the Fujifilm FinePix SL1000 very high marks. I love this camera.", "Date": "July 18, 2013"}, {"Title": "Fantastic zoom that's great for video. Photos are good for the price point", "Author": "Lon J. Seidman \"lon@ lon.tv\"", "ReviewID": "R3755DW2X80CDR", "Overall": "4.0", "Content": "<!--\n\nfunction fp_resizePlayerSpace(nsPrefix,w,h)\n{\t\n  try {\t\n    var ifrm = parent.document.getElementById(nsPrefix + \"movieFrameID\");\n    if (ifrm) {\t\n        var h2 = h + 35;\n        ifrm.style.height = h2;\n      }\n    } catch(err) {\n \n    } \n\n\n  if (h > 0) {\n      document.getElementById(nsPrefix + \"clipDiv\").style.height=h+\"px\";\n      document.getElementById(nsPrefix + \"videoPlaceholder\").style.height=h+\"px\";\n  }\n  else {\n      document.getElementById(nsPrefix + \"clipDiv\").style.height=\"\";\n      document.getElementById(nsPrefix + \"videoPlaceholder\").style.height=\"\";\n  }\n  document.getElementById(nsPrefix + \"flashcontent\").style.height=\"100%\";\n}\n\nfunction fp_rewriteDiv(nsPrefix,divName,html)\n{\t\n    document.getElementById(nsPrefix + divName).innerHTML=html;\n}\n\nfunction embeddingPopup(nsPrefix)\n{\n  alert(\"placeholder function for embedding code\");\n}\n-->\n\n\n<!--\n\nfunction cv_mo2J6TUZFUVZYNCembeddingPopup(){\t\nalert(\"Embedding code will be displayed here.\");\n}\n\n-->\n\n\n\n\n\n\n\n\n\n<!--\nfunction cv_mo2J6TUZFUVZYNCrefresh_preplay() {\n\ndocument.getElementById(\"cv_mo2J6TUZFUVZYNCchiDiv\").innerHTML = document.getElementById(\"cv_mo2J6TUZFUVZYNChiddenPre\").innerHTML;\n};\ncv_mo2J6TUZFUVZYNCrefresh_preplay();\n\n-->\n\n\n\n\n\n\n        // <![CDATA[\n\nvar cv_mo2J6TUZFUVZYNCso;\t   \n\n\nfunction cv_mo2J6TUZFUVZYNCloadSwf_Core(swfLocation, swfWidth, swfHeight, flashVersion, bgColor, swfParams, flashParams, embedAttributes) {\n\n  try {\n      cv_mo2J6TUZFUVZYNCso = new SWFObject(swfLocation, \"cv_mo2J6TUZFUVZYNCAMPlayerProd\", swfWidth, swfHeight, flashVersion, bgColor);\t   \n\n      for (var v in swfParams) {\n        cv_mo2J6TUZFUVZYNCso.addVariable(v, encodeURIComponent(swfParams[v]));\n      }\n      for (var v in flashParams) {\n        cv_mo2J6TUZFUVZYNCso.addParam(v, flashParams[v]);\n      }\n      for (var v in embedAttributes) {\n        cv_mo2J6TUZFUVZYNCso.setAttribute(v, embedAttributes[v]);\n      }\n\n      cv_mo2J6TUZFUVZYNCso.addVariable(\"swfEmbedTime\", new Date().getTime());\n\n      var agt = navigator.userAgent;\n       \n      var reFirefox = new RegExp(\"firefox/\", \"i\");\n      var regx = agt.split(reFirefox);\n      var ffVersion = 8;\n      if (regx[1]) {\n          var pts = regx[1].split(/[.]/);\n          ffVersion = parseFloat(pts[0] + \".\" + pts[1]);\n      }\n      var minorVersion = parseFloat(navigator.ap);\n      if ((navigator.appVersion.indexOf(\"Mac\")!=-1) || (ffVersion < 1.5)) {\n          cv_mo2J6TUZFUVZYNCso.setAttribute(\"height\", swfHeight);\n          cv_mo2J6TUZFUVZYNCso.setAttribute(\"width\", swfWidth);\n          cv_mo2J6TUZFUVZYNCso.addVariable(\"oldFirefox\", \"1\");\t     \n      }\n\n      if (cv_mo2J6TUZFUVZYNCso.write(\"cv_mo2J6TUZFUVZYNCflashcontent\")) {\n          fp_resizePlayerSpace('cv_mo2J6TUZFUVZYNC', \n                               320, \n                               283);\n      }\n      else {\n          var nsPrefix = 'cv_mo2J6TUZFUVZYNC';\n\n          fp_resizePlayerSpace(nsPrefix, 0, 0);\n          fp_rewriteDiv(nsPrefix, \"flashcontent\", '<br/>To view this video download <a target=\"_blank\" href=\"http://www.macromedia.com/go/getflashplayer\" target=\"_top\">Flash Player</a> (version 9.0.115 or higher)');\n      }\n  } catch(err) {\n      fp_resizePlayerSpace('cv_mo2J6TUZFUVZYNC', 0, 0);\n  }\n  return false;\n}\n\n\n\nfunction _cv_mo2J6TUZFUVZYNCloadSwf(movieID, playerVersion) {\n    var swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/20120510035744301/AMPlayer._V148501545_.swf\";\n    var swfWidth = \"320\";\n    var swfHeight = \"100%\";\n    var flashVersion = \"9.0.115\";\n    var bgColor = \"#FFFFFF\";\n\n    var swfParams = {};\n    var flashParams = {};\n    var embedAttributes = {};\n    swfParams.amazonPort = \"80\";\n    swfParams.allowFullScreen = \"true\";\n    swfParams.telemetrySubPageType = \"VideoReview\";\n    swfParams.nsPrefix = \"cv_mo2J6TUZFUVZYNC\";\n    swfParams.locale = \"en_US\";\n    swfParams.logUrl = \"gp/mpd/l\";\n    swfParams.canResize = \"1\";\n    swfParams.autoPlay = \"1\";\n    swfParams.sessionId = \"000-0000000-0000000\";\n    swfParams.marketplaceID = \"ATVPDKIKX0DER\";\n    swfParams.salign = \"LT\";\n    swfParams.preset = \"detail\";\n    swfParams.mediaObjectId = \"m2J8ZUMRT2W81G\";\n    swfParams.autoPlayTimer = \"\";\n    swfParams.mediaObjectIDList = \"m2J8ZUMRT2W81G\";\n    swfParams.playIsUserGenerated = \"1\";\n    swfParams.enableShare = \"0\";\n    swfParams.permUrl = \"gp/mpd/permalink\";\n    swfParams.telemetryPageTypeID = \"R3755DW2X80CDR\";\n    swfParams.xmlUrl = \"http://www.amazon.com/gp/mpd/getplaylist-v2/m2J8ZUMRT2W81G/000-0000000-0000000\";\n    swfParams.amazonServer = \"www.amazon.com\";\n    swfParams.scale = \"noscale\";\n    flashParams.allowFullScreen = \"true\";\n    flashParams.salign = \"LT\";\n    flashParams.bgcolor = \"#FFFFFF\";\n    flashParams.allowScriptAccess = \"always\";\n    flashParams.quality = \"high\";\n    flashParams.wmode = \"transparent\";\n    embedAttributes.title = \"Flash Player\";\n\n    if (movieID){\n      if (playerVersion == '3'){\n        swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/20120510035744301/AMPlayer._V148501545_.swf\";\n        swfParams.mediaObjectIDList = movieID;\n      } else {\n        swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/legacy/20101014901/AMPlayerProd._V197491872_.swf\";\n      }\n      swfParams.xmlUrl = \"http://www.amazon.com/gp/mpd/getplaylist-v2/\" + movieID + \"/000-0000000-0000000\";\n      flashParams.wmode = \"transparent\";\n      swfParams.autoPlay = \"1\";\n    }\n\n    if (document.getElementById('cv_mo2J6TUZFUVZYNCduration')) {\n      document.getElementById('cv_mo2J6TUZFUVZYNCduration').style.display='none';\n    }\n    cv_mo2J6TUZFUVZYNCloadSwf_Core(swfLocation, swfWidth, swfHeight, flashVersion, bgColor, swfParams, flashParams, embedAttributes);\n\n  return false;\n}\n\nfunction cv_mo2J6TUZFUVZYNCloadSwf(movieID, playerVersion) {\n   return _cv_mo2J6TUZFUVZYNCloadSwf(movieID, playerVersion);\n}\n\n\n\t\n\t\t// ]]>\n\t\n\n<!--\n\nfunction cv_mo2J6TUZFUVZYNCnewHeight(h)\n{\t\n    fp_resizePlayerSpace('cv_mo2J6TUZFUVZYNC', 0, h);\n}\n\nfunction cv_mo2J6TUZFUVZYNCresetPlayer(w,h,bw,cc) {\n  cv_mo2J6TUZFUVZYNCnewHeight(h);\n\n  cv_mo2J6TUZFUVZYNCso.addVariable(\"resetBandwidth\", bw);\n  cv_mo2J6TUZFUVZYNCso.addVariable(\"cacheCode\", cc);\n  cv_mo2J6TUZFUVZYNCso.setAttribute(\"height\", h);\n  cv_mo2J6TUZFUVZYNCso.setAttribute(\"width\", w);\n  cv_mo2J6TUZFUVZYNCso.write(\"cv_mo2J6TUZFUVZYNCflashcontent\");\n}\n\n-->\n\n\n\n\n\n\n\n\nvar cv_mo2J6TUZFUVZYNCRollOverImg = new Image();\ncv_mo2J6TUZFUVZYNCRollOverImg.src = \"http://ecx.images-amazon.com/images/I/813oLm6n0kS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play-active,BottomLeft,130,-12_CR0,0,0,0_.png\";\n\nvar cv_mo2J6TUZFUVZYNCpreplay = document.getElementById('cv_mo2J6TUZFUVZYNCpreplayImageId');\nif (cv_mo2J6TUZFUVZYNCpreplay) {\n  cv_mo2J6TUZFUVZYNCpreplay.onmouseover = function() {\n    cv_mo2J6TUZFUVZYNCpreplay.src = \"http://ecx.images-amazon.com/images/I/813oLm6n0kS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play-active,BottomLeft,130,-12_CR0,0,0,0_.png\";\n  }\n  cv_mo2J6TUZFUVZYNCpreplay.onmouseout = function() {\n    cv_mo2J6TUZFUVZYNCpreplay.src = \"http://ecx.images-amazon.com/images/I/813oLm6n0kS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play,BottomLeft,130,-12_CR0,0,0,0_.png\";\n  }\n  \n  \n  var node = cv_mo2J6TUZFUVZYNCpreplay.parentNode;\n\n  var cv_mo2J6TUZFUVZYNCcurrentClick = node.onclick;\n  node.onclick = function () {\n    var head = document.getElementsByTagName(\"head\");\n    if (head[0]) { \n      var logTag = document.createElement('script');\n      logTag.type = \"text/javascript\";\n      logTag.src = \"/gp/customer-media/du/log.html?ie=UTF8&p=CustomerImage&s=CustomerVideoPlay\";\n      head[0].appendChild(logTag);\n    }\n\n    if (cv_mo2J6TUZFUVZYNCcurrentClick) {\n      return cv_mo2J6TUZFUVZYNCcurrentClick();\n    }\n  }\n}\n\n\n\n\n Length:: 9:01 MinsThe zoom on this FujiFilm camera is absolutely incredible.  It's practically a telescope!  I have never seen an optical zoom this good in a camera at this price point.  Will it best a 1200mm lens on a DSLR in sharpness or overall image quality?  Of course not.  But this Fujifilm camera won't require a second mortgage either.Photo quality is decent for its class but a little soft when using the zoom. There is very little shutter lag and the camera can fire off a number of shots in rapid succession with the continuous shooting mode. The 16 megapixel resolution gives you some additional flexibility when cropping.But it's video where this thing really shines. Unlike some DSLRs it will continually focus (relatively quickly) while shooting. That's nice.  Even when zoomed to the max images are relatively crisp, but just be sure to use a tripod. I should note that I did have some compatibility issues with Final Cut Pro X and I had to pre-encode the videos prior to ingesting for editing.The coolest thing has to be the high speed video feature.  The fastest mode will record at an amazing 480 frames per second - enough to see the world in an entirely new way.  You won't get much resolution at that frame rate but nevertheless it's still amazing to see something like this packed into an inexpensive camera.", "Date": "June 23, 2013"}, {"Title": "Fabulous Photos - No Math", "Author": "Kimberly Morris", "ReviewID": "RGE68W1RO2S15", "Overall": "5.0", "Content": "I love taking photographs. My photos have won prizes at the Tennessee Valley Fair. (Whoo-hoo!)  Just once I'd like to say to someone, \"My hobby is nature photography,\" and have that person reply, \"Me, too. I love the intricacies found in a rose.\" But, no. They always reply,\"Me, too. What shutter speed do you find most effective when photographing moving water in partial shade?\" What's up with that? I'm not an engineer. If I wanted to spend an afternoon doing math, I'd balance my checkbook.  I am the artist; the camera is the scientist. My job is to notice how beautifully the shadow of an ancient oak tree falls on the side of an abandoned house. The camera's job is to capture that image digitally, without me having to tell it how. This camera is GREAT at that. Between the scene-recognition auto button and the choose-a-scene button (parties, beach, night scenes), this camera does everything I ask, and beautifully.The zoom is awesome. When I was taking pictures of the abandoned house, I couldn't step on the porch, because it was rotten. Still, I was able to get a close-up of the brass doorknob every bit as good as if I'd gone right up to it. Without a tripod. On an overcast day. It's the perfect camera for the person who's photography skills lie primarily with seeing great pictures. I see the picture; the camera takes the picture. I love this camera.", "Date": "November 24, 2013"}, {"Title": "Massive zoom!", "Author": "CyberNik", "ReviewID": "RU9J269CGKQPY", "Overall": "5.0", "Content": "Being skeptical about buying a DSLR (due to the cost mainly) I decided to try out this bridge camera, and I must confess I was more than impressed. The main feature of course is the unbelievable 50x zoom, which is totally stunning, and will help you take photos you could never have imagined. Photo quality is quite good, although noise does make its way into certain iso settings, but it's not that obvious and you can easily correct this by \"playing\" with the settings(or lighting, if possible) . The camera focuses really quickly, though in macro mode if the light is low it may have a bit of a difficulty focusing. You can set the shutter and the aperture, or just switch to auto and let the camera decide what's best for it's shot. Generally, the photos in auto mode are very good, unless you want to tweak the settings for a specific shooting. You also get many creative options, like the toy camera effect and the cross screen, among others, which can give nice creative photos without the need of additional editing. Video quality is simply amazing, and luckily the camera keeps its focus(unlike previous Fujifilm models). There is also the option of raw saving, if you have the need for it. The lcd screen is crystal clear and it can tilt so it makes taking low or high photos a piece of cake.My only complaints:-the proximity sensor on the eyepiece is a bit tricky because it can be triggered by your body or hand and the lcd switches off to the eyepiece, which is kind of annoying ( you can select for the lcd to be always on and render the sensor inactive, which is exactly what I did).-the sound of focusing is apparent in videos ,like in previous Fujifilm's models.-Battery drains quickly especially if using the zoom, so you better have a couple of extra batteries at hand.For its features (especially the 50x zoom) and price, this is definitely a bargain. Due to the small amount of noise at certain iso settings I would give this camera 4 stars, but because of the price it is offered and the features it has, I chose to give it 5. Overall I'm very pleased with it and very happy that I bought it!", "Date": "March 23, 2013"}, {"Title": "Good, but NOT good image quality", "Author": "James P. MccArthy \"FotoDad\"", "ReviewID": "R3CPHEZI1UD4KR", "Overall": "3.0", "Content": "Tried out this camera for a week and returned it. My comparison is to the Canon SX40 and Nikon P510, of which have both been replaced by newer models, but with little difference (same sensors). The Fuji is a camera I wanted to love for it's easy to navigate menu, buttons in the right place for quick access/change, and decent build quality. As a long time photographer, my number one priority is good image quality (IQ). As much as I tried, I could not get this Fuji to give me sharp images. At all focal length, they appear soft..some very soft. I shot in good morning and evening light, a few in bright mid-day sun, and only a few true low light shot indoors with low lighting. Macro is decent, but nothing stellar. When compared to the Canon and Nikon, the Fuji just does not have the sharp, in focus, noise free images. The Canon's and Nikon's images are visibly much better, especially if viewing on a large monitor or flat screen HD tv. One big problem with the Fuji was at full zoom length, the focus (set to center)is almost impossible to lock..it constantly moves in/out of focus..very frustrating. If very good image quality is not your first requirement, then the Fuji is a contender. But for me, and after taking shots with the Canon and Nikon, I passed on this Fuji.", "Date": "August 20, 2013"}, {"Title": "Canon sx 50 watch out", "Author": "Todd", "ReviewID": "R17IXDOG8QB5OZ", "Overall": "5.0", "Content": "The Fuji SL 1000 is a great all around camera. The construction and features are user friendly and the quality of the pictures for the money, are second to none. I also own a Nicon D 7000.What I realy like about the Fuji is that is a lot lighter and with features that the camera offers makes it a great camera for travel.If I realy want the best pictures quality wise then I use my Nikon, but like I said for travel and wildlife photografy I don't see any other camera comming even close to this one once again for the price. I paid a little over $ 300 in amazon. The other camera that I considered very carefuly was the Canon sx 50 but the price difference was sustancial and I went with the Fuji.Battery life is a little bit short but for a little over $ 20 you can get the Wasaby replacement batteries (2) of them plus an extra charger.Once again I do not have any reservations recommending the Fuji SL 1000 as a secondary/Travel-wildlife camera", "Date": "May 27, 2013"}, {"Title": "Overlooked and Under Rated: Best Deal in its Class, Easily", "Author": "Randy Wakeman \"Randy Wakeman\"", "ReviewID": "R2KZ05TIL75QBZ", "Overall": "4.0", "Content": "Nothing competes with this camera at its current, stunning low price point of $250.The 28.5 oz. SL1000, uses the slightly smaller 1/2.33 sensor (compared to the Fujifilm HS50), yet is still a 24-1200mm 35mm equivalent camera. It also loses 25%-30% of the HS-50's its price as well. No other name-brand camera gets you to the massive 1200mm range for $260 or less, actually $250 as this is written. No one shoots at 1200mm all the time, or even most of the time for that matter. If you want the capability to do so, the SL1000 gets you there the most affordably. It offers a larger, 3 inch 920K dot tilting LCD, a 920K EVF as well: a better treatment than several more expensive cameras in this class. Consider the Sony DSC-HX300/B 20 MP Digital Camera with 50x Optical Image Stabilized Zoom and 3-Inch LCD (Black) (about $400 at the time of this writing) that lacks RAW, and in general isn't as competent a camera, despite its comparatively high price.If the end use is standard prints, the internet, along with 8 x 10s from time to time, you'll be happy. Give it plenty of light, try to shoot at lower ISOs, you'll be more than happy. It is no secret that more pictures are taken every day with cellphones than with any other device. It is also no secret that sales of the smaller point and shoot cameras have plummeted, but long zoom cameras have been in demand. The SL1000 does everything that your smartphone cannot, and that's a good thing.There are a *lot* of choices out there, but not at $250. You can also spend $360 Sony DSC-HX50V/B 20.4MP Digital Camera with 3-Inch LCD Screen (Black) and more on pocket cameras, and more. You can spend a lot more on bridge-class cameras as well. The \"Ultimate Compact Camera,\" according to some, is the Fujifilm X100S 16 MP Digital Camera with 2.8-Inch LCD (Silver). It is about $1300, though, with no optical zoom at all.Just two years ago, no bridge camera with a 1200mm zoom was even available. And, whether we like it or not, two years from now there are going to be several more options that some will call significant. That's why the SL1000 makes sense. Anyone would call it a generally very good camera if you didn't know what brand it was. For $250, though, it is a screamingly good, outstandingly superb camera. It isn't necessarily the best bridge camera, it isn't, but it is the best for the least dollars. If you are willing to spend more, yes . . . the SX-50 Canon, the Fuji FinePix HS50EXR are all quite worthy of your consideration, as are the Fuji X-S1 and the Panasonic FZ-200. For the money, though, at this price point . . . the SL1000 is a lot of bang for the buck.You'll probably want to drop twenty bucks for Pack Of 2 NP-85 Batteries And Charger Kit For FujiFilm FinePix SL240 SL260 SL280 SL300 SL305 SL1000 Digital Camera + More!! and Transcend 16GB Class 10 SDHC Flash Memory Card (TS16GSDHC10E) to get up and running. The 350 shot battery life is good, compared to the Nikon P520's 200 shots for example, but use outdoors in cooler weather nerfs that a bit, and even a small amount of video can run the battery down quickly.It is a far better-featured camera than expected, with the EVF and LCD quickly putting the more expensive Canon SX-50 and Panasonic FZ-70 units both to shame. Scoring 2,773 lines per picture height via Imatest, it is one of the sharpest len arrays ever put on a bridge camera. Nor can most bridge class cameras match the 1080p60 video capability of this economical powerhouse. It should surprise very few that this camera likes a lot of light, and if you are going to spend a lot of time at the 1000mm - 1200mm area, a good tripod is your friend. I won't suggest that this is my favorite wildlife / outdoors camera, the Panasonic Lumix DMC-FZ200 12.1 MP Digital Camera with CMOS Sensor and 24x Optical Zoom - Black is, a far better camera for my purposes with commensurately higher price tag to go along with it.The SL1000 delivers solidly on its intended target: a huge zoom range for not huge dollars.Copyright 2013 by Randy Wakeman & Randy Wakeman Outdoors. All Rights Reserved.", "Date": "October 14, 2013"}, {"Title": "Mid-level super zoom bridge camera.", "Author": "D. Hentze", "ReviewID": "RF2PONK7K5TVJ", "Overall": "4.0", "Content": "The Fujifilm FinePix SL1000 is Fuji's mid-level super zoom bridge camera. The S series is a notch below Fuji's high-end HS series of bridge cameras. Although it lacks some of the settings and features of the HS series, the SL1000 does have some features that are impressive. The main feature is its massive 50X zoom lens. Before I go any further though, I must point out that although this camera looks a little like a DSLR, it is not. It is a bridge camera with the same tiny sensor as you average pocket point and shoot camera. It is just housed in a DSLR style body, with some extra features and a massive zoom lens. Now that we got that out of the way, on to my review. Unboxing the Fuji SL1000, I noticed that it weighs slightly less and is slightly smaller than the Fuji HS50EXR super zoom. It weighs much less than my DSLR. In the box are the usual assortment of accessories. I was disappointed that there is no lens hood. First charge of the battery took about 90 minutes. The proprietary battery is charged in a proprietary external charger. The camera itself has average build quality and is almost entirely plastic. I was disappointed that even the tripod mount is plastic. The camera's ergonomics are very good, and everything is well laid out. No SD card is included, so make sure you have one. A fast \"Class 10\" speed card is recommended. The SL1000 menu system is very simple and easy to figure out. The camera has a variety of shooting modes including full automatic and \"manual\". There are also some built in filter effects which are pretty neat. I was disappointed there were no settings to adjust the camera's Noise Reduction like there is on the HS Series. The SL1000 does have RAW Mode which is a very good thing.I set out on a sunny day, and took over a hundred pictures under various conditions. I used several different modes and settings. I shot mostly in (P)Mode, and auto mode. I used Fine/JPEG Format, not RAW. Refresh time between shots was very fast. I noticed that when shooting in shady conditions, the camera would use an unnecessary high ISO. Sometimes 400 or higher. I turned off Auto-ISO and manually selected ISO 100 or 200 if needed. The 50X zoom lens performed well. It's incredible 24-1200mm range didn't disappoint. The 3\" high resolution screen is very good. It's is clear and bright. It isn't an articulating screen though. It only slightly tilts, which I thought was kind of a weird design. While out, I also took several minutes of video to evaluate later. When I got home, I also shot a few dozen indoor pictures for testing purposes. I shot most of them in simple auto mode to see how the camera would handle low light without any help. After shooting 100+ pictures and several minutes of video, my battery still shows as full which tells me battery life is very good.When I finished my testing, I hooked the camera up to my PC and HD Monitor using the included USB cable. Thankfully, the cable is standard and not proprietary. Once downloaded, my results generally very good. Almost all my outdoor pictures came out excellent no matter what mode I used. Details were great. Colors were accurate. I didn't notice any optical aberrations, etc. The Fuji's Image Stabilization generally did a great job, but a steady hand is needed at the high end of the zoom.  The overall results were almost as good as my higher end HS50EXR, but not quite. I did notice a little image noise, especially when the camera went above 100 ISO. My indoor results were good too. Image noise wasn't bad up until ISO 400, and still acceptable at ISO 800. I have no doubt that with a little tweaking of the camera's settings, my results could be even better. My HD test video came out excellent too. It did not disappoint on my HD monitor.The Fujifilm FinePix SL1000 is not a DSLR, and it isn't perfect. It is a very good point and shoot camera with an incredible lens though. With a little trial and error, it produces very good results outdoors, and good results indoors as long as you keep the ISO as low as possible. I recommend it.Pros:Incredible 50x Wide Angle Zoom Lens.Electronic Viewfinder.Hot shoe.Good automatic modes.Manual controls.RAW Mode.Generally very good image quality indoors and out.Very good 1080i HD video quality.Fast focusing and refresh time between shots.Very good battery life.Good value.Cons:Average build quailty.Tiny 1/2.3-inch CMOS Image Sensor.Image noise noticeable above ISO 100.No noise reduction settings.No lens hood and mediocre accessories.Proprietary battery.", "Date": "June 24, 2013"}, {"Title": "SLR features without SLR hassle and cost", "Author": "W. L. Holder", "ReviewID": "R2O6RORYP48WDM", "Overall": "5.0", "Content": "There are many great reviews here already covering the main features of this camera, so I will keep my review of those features short.  The main benefit I see of this camera is that it provides many features of a SLR, but without the associated costs and hassles.I loved using my Cannon SLR.  Though due to its cost and having to drag around all the associated lenses, I rarely take it with me when I go somewhere I may want to take photos.  I seem to always take a small pocket camera with me now, as they have increased in performance massively over the past couple years.  The drawback to the  pocket cameras is that there is no hotshoe, the lenses dont zoom enough, or they just dont have the features I like about the SLR's.  This camera is the answer to that.  There are no lenses to change or drag around, yet you get excellent wide angle and zoom capability beyond what I have seen in any pocket camera.  There is a hotshoe in case you want to use a quality external flash, as the built in flash on pocket cameras are usually lacking.  In short, this is the perfect 'missing link' between a SLR and a pocket camera.The zoon is excellent, as is the wide angle setting.  With the image stabilizing, it takes quality photos even at higher zoom rates.  You will still need a rest or tripod for ultrazoom photos to be at their best though.Battery life seems to be typical of most cameras, nothing to exclaim or complain about there.  The weight is nice, enough to be stable in your hand but not enough to make your wrist or elbow tire if shooting for a long session.  The overall build quality seems good.If you are like me and prefer using SLR type camers, but dont want to risk taking an expensive SLR with you certain places, or dont want to invest in thousands of dollars worth of lenses, but dont want to revert to using a pocket camera for everything, this is a great option.", "Date": "July 24, 2013"}, {"Title": "Advanced features that are easy to use", "Author": "Juniorverse1", "ReviewID": "RZK3B3E75S4MC", "Overall": "5.0", "Content": "I'm enjoying how easy it is to take great photos with this camera.  Advanced users will be attracted to full shutter and aperture control.  More casual users will love the auto-scene analyzer and the fun special effects.Moving the mode dial to SR AUTO selects the auto-scene selector, which automatically detects the scene type and applies the optimal settings for the scene.  Examples include night landscapes and night portraits, backlit portraits, and daytime landscapes.  This camera does a good job of automatically detecting the scene and the resulting photos look great.The camera includes advanced filter effects that replaces the need for post-processing on your computer.  Effects include \"toy camera\", \"miniature\" that applies a tilt-shift effect, \"pop color\", \"high-key\", \"soft focus\", \"cross screen\" that creates star-like lines that radiate out from bright objects, and \"partial color\" effects that take black and white photos but keep a certain color, like blue or yellow, in its original form.  There are other post-processing tools like red eye reduction, cropping, and photo rotating.There are plenty of other presets that you would expect a point-and-shoot camera to have, like sport mode, night mode, fireworks, snow, flower close-ups, and more.  You can also take panoramic photos.  You can shoot movies in 1080i resolution.  The movies looks great, and there are easy editing functions for trimming or joining movies.The camera is not as small as many point-and-shoots, but it feels nice in your hands and the controls are well-placed.  Menus are easy to navigate and the camera does a great job of explaining the selected mode and how it operates.The lens extends significantly as you use the very powerful zoom.  When you zoom in very far, the camera still takes nice photos with the help of image stabilization.  The screen is bright and relatively easy to see in bright light.  There is also a digital display showing the typical camera settings as you look through the viewfinder.I definitely recommend this camera for anyone looking for a high-quality camera that is easy to use but also gives you plenty of control.", "Date": "July 7, 2013"}, {"Title": "Better than the canon sx 50", "Author": "Jimmy", "ReviewID": "R1CMX02YPCTNQA", "Overall": "5.0", "Content": "I'm not a professional photographer but I am writing a review to tell you why I like the fujifilm sl 1000 better than the canon sx 50. They both have great 50x zoom but the fujifilm has more features. When using the canon it was weird not having features I was so used to having on my fujifilm. For example the canon lacks any kind of slow motion filming mode. The fujifilm has two different slow motion filming modes. The fujifilm screen is larger and much clearer. Also the veiwfinder is a lot clearer than the canon. The rubberized grip around the lens of the fujifilm makes it easier to hold and allows you to actually grip the lens like a DSLR. I won't get into the details of photo quality because the two camera are about equal in that area. Hopefully this helped you decide if you were between the two cameras. Remember not to buy a camera just because it says canon.", "Date": "November 1, 2013"}, {"Title": "Amateur photographer", "Author": "Spyndrilleum", "ReviewID": "R1D1JCRONNCXV", "Overall": "5.0", "Content": "I am a mother of 8. I hate paying ridiculous prices for school photos and to have our pictures taken in a studio. I wanted a camera that takes good quality pictures with out having to pay a ridiculous price for a professional camera. Especially since I don't really know what I am doing. I also wanted to pick up photography as a hobby. My sweetheart bought me this as a birthday present. I have yet to try any of the manual setting and have just been messing around with the camera in its factory preset mode. Now that I am a little more comfortable with it I am going to print the user manual for it.For now however I am very pleased with it!! The camera has taken really good shots of my kids on the trampoline and other action shots. They come out clear and beautiful. I have taken some pictures of my kids having them do poses in the yard all dressed up and in different natural lighting and the camera continues to impress me.I have uploaded some of the pictures I took using different zoom settings and different lighting. The spider one is taken in very low lighting with the stock flash. As you can see there is awesome detail. The dandelion is crystal clear and show in great detail. And the eagle is several mile away and the camera is fully zoomed and you can see the details in the wings. Again I am a point and shoot kind of person and when you talk ISO and Macro you might as well be speaking Greek. What I do know is that for an Amateur this camera is awesome! I would highly recommend it to anyone who wants good quality pictures with out the high price for a professional sitting. I think the pictures speak for themselves.", "Date": "October 12, 2013"}, {"Title": "Well done, Fuji!!!", "Author": "sashaineurope", "ReviewID": "R3JY4FD1NT42I5", "Overall": "5.0", "Content": "Very pleased with this camera. I would like to make it clear that I am not a pro in photography, so those who expect an expert review may skip reading mine. I bought before this one Nikon COOLPIX S9200 16 MP CMOS Digital Camera with 18x Zoom NIKKOR ED Glass Lens and Full HD 1080p Video (Black) and had to return it since it was making blurry pictures and could not lock focus, also: when zoom used , the focus was missing at all. This Fuji camera is big (but light) and not so easy to carry everywhere or put it in your purse, but it is definitely worth carrying it. The pictures are crystal clear even when you use just automatic settings, or at night time(night pictures are a big issue with almost all cameras, but not with this - there are modes for beautiful night landscapes) . It is easy to lock a focus, also you don't need sturdy hand - quite shatterproof.(Make sure to hold the zooming lens underneath for extra support - check some youtube videos from fuji for instructions). The 50x zoom is amazing - you can use it as a binoculars and see exotic bird in the sky :). The close up photos of a flower or leaf are so crystal and detailed - beautiful. The 360 panoramic pictures - also! The videos - perfect.CONS: Many people complain that the lens cap has to be removed manually - for me this is a minor inconvenience (this is a huge lens and closing and opening automatically requests a lot of power).Also: the battery doesn't last a long time, but it is not expensive, I would buy a spare one to carry in the camera bag.I still have not tried all the modes and possibilities of this amazing camera. I have to say - Well done, Fuji!!!", "Date": "April 12, 2013"}, {"Title": "If it had a manual focus mode and used AA batteries it would be practically perfect!", "Author": "D. Jensen \"snake man\"", "ReviewID": "R28L8K2OQ38OY1", "Overall": "4.0", "Content": "After the whole world had gone digital (except for me), I finally sold my extensive Olympus collection, consisting of 3 bodies and an arsenal of lenses, said goodbye to film, and bought my first digital camera - a Fuji SL7000. With a whopping 6-megapixel processor (pretty standard for the time), I used it to photograph my sister's wedding. The results were impressive. In 2008 I bought an Olympus UZ-570 (10-megapixels and a 20x zoom) for a trip to Africa, and I used that camera for six years until last month when I bought the Fuji SL1000.What can I say? The SL1000 packs a wallop in the zoom lens department! At 2 1/2 times the power of my Olympus \"ultra zoom,\" the 50x zoom on the Fuji is a 1200mm equivalent in a DSLR system, eliminating a lot of weight to lug around and a lot of time and money saved by not having to buy expensive lenses and change them constantly. I did not want to return to the days of a 40-pound camera bag. The SL1000 and everything else I need fits neatly into a holster style case that I can wear on my hip.Photo quality is excellent, even at full zoom, with the camera compensating for shake. Video quality is equally good, and the stereo sound recording is amazing! The menu is intuitive, modes are logical and allow for a great deal of creativity whether you are a pro photographer or a newbie. I photograph snakes and other reptiles, and the SL1000's macro ability is phenomenal.I was disappointed that the SL1000 (and most of the new Fuji lineup) doesn't have a manual focus option. When I was in Africa, there were times when a lion was in tall grass and my Olympus would automatically focus on the grass, giving me a blurry lion. This was easily corrected by switching to manual focus mode. This is not possible with the Fuji, and could be problematic for anyone who spends time at the zoo photographing through glass, chain link, bars, etc., or who just prefers to be in total control by being able to focus on their own.Best features besides the lens include a hot shoe, an adjustable diopter (for folks who find it awkward to wear glasses while looking through a viewfinder), an adjustable screen for up and down (but not sideways) viewing, dual zoom controls, and a neat assortment of special effects, all packed into a solid, lightweight, compact camera.One of my main criteria for choosing digital cameras in the past was the ability to use AA batteries which are inexpensive and available everywhere. Battery type was the main reason for choosing the SL7000 and the UZ570. I compromised with this camera because I wanted the zoom, and I wish the technicians at Fuji would try to be more consistent in making all of their cameras AA compatible. Right now it's about half and half. (Are you listening, Fuji?) Proprietary batteries are a pain in the butt! They are expensive, require a charger, and are difficult to charge away from home, especially in foreign countries.Overall, this is an excellent camera choice for anyone who wants a simple-to-use camera that yields excellent results.", "Date": "February 2, 2014"}, {"Title": "Great family camera", "Author": "Kat", "ReviewID": "RKMBKVXYPA9M", "Overall": "5.0", "Content": "Since I loved my Fuji Finepix E550 that finally died this year after almost 8 years of service, I knew I would go back to Fuji for my next camera. My husband has always wanted a great zoom for when we go hiking so that was first on our list of must haves for the new camera. After much deliberation, research, and discussion, we decided to go with the SL1000. And after a week, I am so glad we did. This camera is great for a family with young children who don't stop moving!Our previous camera was blurry inside and during playtime outside but this one is fabulous! The many modes are great for all the different situations you find yourself in with kids. Pictures that were once blurry in the living room at night are now clear and well lit. Running pictures are clear. To be honest, it did take a couple of days of playing with different settings to determine what mode is best for what but I think that is true for any camera. The zoom is great! The stabilization works very well. The filters are fun and give you some room to be artistic if you so choose. The high speed video is a lot of fun. My six year old finds it entertaining to make slow motion videos of toys falling. The HD video itself is wonderful and a lot better than the previous camera.I would recommend buying more batteries. The one that comes with it does last quite a while and it charges in about 2 hours but it is well worth it to have extras. Also, the strap that comes with it is not comfortable around the neck. Kind of scratchy. I would recommend getting something different.Updated 11/24/13: This camera has now gone a trip with us to Colorado and some serious hiking. The pictures were fantastic and the video is equally as great. The zoom was so great out there that we got many pictures we would have never gotten without it. It also got used at work for our annual party which was in low bad lighting and it performed wonderfully. Still love this camera!", "Date": "October 10, 2013"}, {"Title": "Good all in one camera", "Author": "Amy Willingham", "ReviewID": "RGS3D62YYGMEE", "Overall": "5.0", "Content": "I currently own Sony Cyber-shot DSC-HX200V which I LOVE and take on all of my travels. But the price difference between my Sony and this Fujifilm is about $150 which makes the Fujifilm more affordable for people looking for an all in one camera.Pros:*Very easy to navigate on screen- able to change how you take pictures and speeds*Gives you almost all the functions of SLR in one complete camera without having to worry about changing lenses.*Has very quick focus and super fast shutter speeds. I shot some pics of the boys playing basketball and this camera is great at capturing them mid-air or at other times when they are running back and forth. A common problem with Non-DSLR cameras is that they can't capture objects moving fast enough or they do but them come in really blurry. With my Sony, I am able to capture people in mid-air but when they are running back and forth it can become a challenge to get a clear picture. I say with my Sony 1 in 4 will be perfectly clear but with this Fujifilm 3 in 4 come in clear.*Super zoom function with clear focus- My Sony can only do 30x zoom while this Fujifilm can do 50x!*Easy to grab photos from camera to import into your computerCons:*For a non-DSLR this camera is a bit heavy and bulky. When I compare the weight and size with my Sony this camera is both bigger and heavier. For a person looking for a camera without having to change lenses the weight and size shouldn't be an issue. But for others who are looking for a slimmer non-DSLR camera that they can throw into a backpack and not worry about extra weight, this camera is not the right one for you.*Doesn't have high quality low light/night shot ability. My main factor in purchasing my Sony was how frustrating my old point and shoot would take museum pics and night shots. Even though this Fujifilm says it works well for low light/night shots I am personally not impressed by it. If one of your main buying reasons for this camera is low light shots (such as museums,concerts, and late night parties)I have to tell you to look somewhere else. The pictures still come in very dark and blurry if your object is in motion. Now if I where to take the same pics with my Sony... as my hubby says \"Hey look your camera just made these night pics into day pics!\"Overall for the price and what this camera can do I think it's a great value(unless you wanted a camera for low light and night shots) and has everything all in one camera. The zoom function is amazing and even though my Sony can go up to 30x.. with 50x the zoom I can just imagine all the shots I could have taken of Our Lady Liberty while I was on the Staten Island Ferry. And trust me my Sony got some AMAZING shots of her! So instead of buying a true DSLR that can cost you over $1,000 and you will have to carry multiple lenses, I suggest paying 1/4 the cost and investing in this Fujifilm. If you love this camera abilities and just wished it could provide good quality low light and night shots, I have to suggest Sony Cyber-shot DSC-HX200V.", "Date": "July 16, 2013"}, {"Title": "Easy to use!", "Author": "Ken N", "ReviewID": "R2AP3SAJX1H033", "Overall": "5.0", "Content": "I purchased this camera as a more light-weight option when traveling. We just returned from two weeks in Nepal where we trekked through the foothills of the Himalaya and then ventured down to Chitwan National Park for an elephant safari through the jungle. The camera was very portable and easy to use and the pictures I took, even on the AUTO mode, were outstanding. I am still amazed by the camera's performance. I would highly recommend this camera for a more convenient option when on rigorous trips.", "Date": "April 2, 2014"}, {"Title": "Initially great camera, BUT (see followup review)", "Author": "Denny", "ReviewID": "R1BCZJ5MQH94L4", "Overall": "2.0", "Content": "I bought this for a trip to Washington, DC. It worked great. Easy to use if you've had an SLR camera before. The telephoto lens did a great job at it's max setting while being held by hand. Haven't had a chance to check out other features, yet.Followup review...I purchased this camera roughly 6 months ago because it had so many great reviews, and at first, I thought it worked very well. I bought it for ease of use, however I'm starting to be a little disappointed.1.  If I didn't use the camera for a couple of weeks, it would not turn on. I thought it was the battery, so I charged it (but thought this was funny because the battery should last a little longer without being used). It didn't take long to charge which was unusual, but it seemed to work fine after that. I would just have to remember to check the charge a day before I planned on using it, but was worried that when one of those special pictures came up that it wouldn't work. AND, this is just what happened. Only this time, when the camera wouldn't turn on, I pulled the battery out and put it back in and it worked and showed fully charged. I've charged the battery several times now. I just went to see if it would turn on and it wouldn't. I put it in the charger and it wouldn't charge. I'm assuming a bad battery (it should have lasted longer than this).2.  Preview button. I pressed the Preview Button to look at some of my pictures, but at times it would say that the picture was corrupted, so I lost the picture. It would almost freeze searching for the picture. Not sure if that was the card or not, but shouldn't have been.3. This Christmas I used the camera at our family Christmas. Many pictures turned out blurry when a subject barely moved. It's always taken descent pictures in low light, but not that night. I had to turn the flash on to get better pictures, but the lighting was adequate for clear pictures. Sometimes it works right, sometimes it doesn't.I'm a little disappointed that I have to spend so much time trying to get this camera to do what I want it to do and I am no novice when it comes to cameras. I've had other SLR cameras before this one.I'm going to get in touch with Fuji to see what they will do.", "Date": "July 11, 2013"}, {"Title": "SlL1000 Buy It", "Author": "Pete", "ReviewID": "R1G0Y9IG5FQI1P", "Overall": "5.0", "Content": "After reading many reviews , watching you tube videos and several visits to Best Buy to compare Sony, Nikon, Canon, and Fuji I ordered the Fuji SL1000 from Amazon. No one had the SL 1000 in stock so I looked at the S8200 from Fuji for comparison purposes.  Why the SL1000?  First of all the battery is rechargeable, has a viewfinder along with the LCD screen that tilts, has a 50X optical and 100X digital zoom and can shoot in Raw not that I will use it much..  The SL 1000 is so close to price of the S8200 and  S8400 why settle for less. The closest Nikon and Canon cameras with viewfinders were at least $100 dollars more. I was  concerned about picture quality but I was convinced on Amazon by the reviews by the semi pro photographers to buy this camera as all of those reviews were positive and had 4 or 5 stars under photo quality. Although I have only had the camera for two days I know I made the right choice.  I took the camera to the ocean (15 degrees below zero wind chill factor) and got some great pictures.  I have taken both good and bad pictures but the  bad ones were my fault. I have experimented with the different settings and shooting modes and still have much to learn. I have the camera picture quality set to Fine and 4.3. The memory card will hold less pictures but the quality is higher with better resolution. I am using a High Performance SDHC Pixtor  SanDisk Class10 Memory Card. I have taken some  good pictures on auto mode but got even better results with experimenting with the different settings. If you want to take time to really learn how to use this camera it is IMHO the best camera with the  most features at the best price. A friend of mine who is a semi pro photographer stopped by the house today and saw the  camera.  She picked  the camera up and was surprised at how little it weighed and used the 50X  optical zoom and said \"that is Sick\", I guess that means she was impressed. There are simpler cameras out there and the SL 1000 can be used on the auto modes to get good pictures but if you want to learn more about photography and become a better photographer this is the camera to buy unless of course you want  full DSLR and many lenses.  At $249 on Amazon I felt I could not go wrong and at that price I bought the 4 year protection plan at  $42.00 which includes accidental damage with some exceptions.  The price for the camera and protection plan is less than most cameras in this class at most stores.  I am looking forward to learning how to get the best results from my camera and am very happy with my purchase. I hope this review is helpful to some of you. Good luck with your decisions.", "Date": "January 8, 2014"}, {"Title": "Take great photos without any photography knowledge.  Comparison to S4500,  choose cost based on your photography needs.", "Author": "Two kids mom \"scienceteachermom\"", "ReviewID": "RFD3FTLUXK3R9", "Overall": "5.0", "Content": "We already owned a FinePIX S4500 and I will compare the SL1000 to this camera.  Currently the S4500 is about half the price of the SL1000. We love both of them, but the comparison below may help you make a choice between the cost/benefits for both cameras.These cameras are excellent choices for those who want more than a little point and shoot but less than a full fledge SLR.  They both offer the ability for the total photo novice to take excellent photos and as you learn more for you to take more control over the shots.  The size and weight are much lower than an SLR and the options much greater than a point and shoot.  If you are going to be taking photos of birthday parties, soccer games and vacation photos the lower end S4500 will serve you quite well, you can even move up to more complex photography by taking over some of the control from the camera as you learn.  If you want to move up to images you can really edit, higher optical zoom,  (want to be able to do extreme close ups) ,the ability to have different outputs,  to be able to add a fancier flash (perhaps use one you already have for an SLR) or video extreme close ups then you should chose the higher end SL1000.  You do need to manage battery use more with the SL1000, since it uses a rechargeable battery rather than standard AA.  For a more detailed comparison and more information continue reading.Weight and Size: The S4500 weighs about 19 oz (540g) with the AA batteries and the memory card) and the SL1000 about 23 oz (650g).  This would not seem like a lot, but held in your hand it does make the difference.  The longer optical zoom (50X on the SL1000 vs 30X on the S4500) means that the SL1000 is front heavy and it does feel heavier when you are holding it.  It is also physically larger although not a huge amount.  Carrying it in the case makes little difference.Image:The S4500 is 14 pixals while the SL1000 is 16.2.  When printing your average photos you will probably not notice the difference, we cannot tell which photos were from which camera.The S4500 has a focal Length of 24-720mm and the SL1000 from 24 to 1200mm (this is a big difference, you can take photos from MUCH farther away with the SL1000).  Full aperture is F3.1 (wide) to F5.9 (telephoto) on the S4500  and F2.9-6.5 on the SL1000.  The SL1000 can go up to the equivalent of ISO 12800 while the S4500 goes up to 6400, another big difference, meaning that the SL1000 can handle lower light levels.  Fuji is a leader here,  they get lower noise in high ISO shots without blurring detail (algorithms will decrease the image detail in some other camera brands).  There is some argument about how film ISO translates to digital ISO, but for comparison purposes across the same brand the SL1000 is much better here.JPEG  (Stills) and AVI (movies) are the only file outputs on the S4500 while the SL1000 can do JPEG, RAW (RAF format) and even MPO (Which is 3D) as well,  the movie output is in MOV form not AVI.The S4500 actually has more shooting modes (Zoom Bracketing, Natural Light, Natural Light & with Flash, Portrait, Baby, Smile, Landscape, Sport, Night, Night (Tripod), Fireworks, Sunset, Snow, Beach, Party, Flower, Text) than the SL100 which has (Portrait, Landscape, Sport, Night, Night (Tripod), Fireworks, Sunset, Snow, Beach, Party, Flower, Text).  They both have a Panorama mode as well.  The modes are actually pretty amazing, point the camera at a person and it knows the difference between that and a flower.The zoom on the S4500 is at the front while the SL1000 has both front zoom and a button on the side of the lens for zooming.  There is NO manual zoom on either, which those who previously use SLRs will find annoying.Both have a build in flash, but the SL1000 has a shoe (a place you can put a fancier flash, like for an SLR)Both have SR AUTO, Instant zoom, Face Detection, Auto red-eye removal, Framing guideline, blink detection, Frame No. memory, Histogram display, motion panorama, Face recognition, Date stamp and the SL1000 adds an advanced mode, zoom bracketing and a framing guideline.  The blink detection can be amusing, we have been told that the camera detected a blink in a tree....Video:The S4500 video quality is lower,  1280X270 (mono sound)  vs 1920X1080 (stereo sound).  This is noticeable when playing back on a TV both in image and sound quality.  However, the lower quality is perfectly acceptable, better than my Flip video and in both cameras you CAN use the optical zoom when recording video on both cameras which is really neat.Power:The S4500 uses AA batteries, and I would suggest the lithium ones.  In fact, with the lithium batteries the S4500 takes noticeably more photos that the SL1000 with its rechargeable NP85.  You need to buy another NP85 (two are less than 20 bucks on Amazon currently) so you can charge one while using the other.  The fact that you can buy AA anywhere makes the S4500 more versatile here.LCD:The LCD on the SL100 can fold out, should you want to hold the camera at a weird angle to take a photo and still see what you are doing.  This is nice, but adds to the cost.Summary:Either of these camera is an excellent choice taking your general photographs to another level beyond point and shoot but without the expense and weight of an SLR.  If you want to really get into photography or higher quality video is important to you, choose the higher end camera.  If you are not sure, you just want to take great photos without much effort,  go for the lower end,  you can still have some control as you learn to take better photos and if you decide later you need something fancier, cameras will have probably improved even more in the meanwhile.", "Date": "July 1, 2013"}, {"Title": "Better than my sx40 canon", "Author": "Wen \"wmrss\"", "ReviewID": "R21Z4F0N01WRXT", "Overall": "5.0", "Content": "I usually don't write reviews, but decided this is worth writing. I am usually a canon person but have always been open to other brands, I must say I like this Fujifilm sl1000 much better then the canon sx40. The zoom is great have took great pics handheld at full 50 times zoom.Lots of features on this camera. Have owned this for 30 days and have taken several 100 pics with all coming out clear.", "Date": "January 27, 2014"}, {"Title": "Great camera, but it is missing one thing.", "Author": "P. Oberlander", "ReviewID": "R1MHESM0IQV6BS", "Overall": "4.0", "Content": "The zoom is really great.The feature set is robust.  I love that it has aperture and shutter priority modes.It has a hot shoe for external flash, which you will need if you use the zoom in low light (on any super zoom).My only problem is that it has no manual focus.  When you are trying to shoot distant objects against a flat background (like the full moon or (believe it or not, I got a picture of this) the crescent of Venus, getting the camera to focus isn't easy.  If you could set the focus to infinity manually, it would be a perfect 5 star.", "Date": "March 6, 2014"}, {"Title": "Good Camera", "Author": "MWA", "ReviewID": "RMRTXDQXBF8H6", "Overall": "4.0", "Content": "I spent a lot of time researching various \"cross over\" cameras: 16 MP or better, zoom telephoto. Price was definitely a consideration. All things considered, this was a good choice. The telephoto is better than I could have asked for. The images are bright and crisp when viewed on my computer screen and 46\" HDTV. I have used it more for outdoor photography than indoors, I need to practice more on the indoor settings. There are a lot of setting possibilities, some of which I will probably never use, but you never know...I've shot a little video and it was fine for me, but I'm not that into video.A few notes:-Order a second battery, you'll be glad you did.-Use a tripod for distant/lowlight telephoto shots.-I wish I could get a haze filter that would somehow fit the lens, I hate to touch a camera lens, even with microfiber, and a haze filter offers good protection from inadvertent finger smudges, splashes, etc. No matter who you are, things happen!-the case recommended on the Amazon site works well. It holds the camera snugly, and has room for the USB cable, extra battery, microfiber cloth, maybe one or two other small items.", "Date": "March 2, 2014"}, {"Title": "Good buy", "Author": "The Woodlander \"Wally\"", "ReviewID": "R372066TALBPX3", "Overall": "4.0", "Content": "I have very little to complain about with this camera. Almost all of my pictures come out very clear. The only flaw is not it's fault; it's a fault of all non-DSLR cameras. It recharges slowly between shots, so that you can't take rapid fire shots of moving events. I bought this as a supplement to my Nikon D3200 because we're going on a cruise in May and it's cumbersome to be carrying a large bag for lenses, and for changing lenses (Nikon) itself when you don't have all the time to do so. The Fujifilm FinePix SL 1000 solves that problem. But use this only for non-rapid fire shot requirements. Otherwise, I'll use my Nikon. So each one has its advantages and disadvantages. The ideal would be for a DSLR to have a fixed lens of from 24-1200mm, like my Fuji. Is this even possible (for you professionals out there!)?", "Date": "February 2, 2014"}, {"Title": "Great", "Author": "Pranab N. Jha", "ReviewID": "R2K2T2ZHJUS1WV", "Overall": "5.0", "Content": "Its my first high end (for me) camera. I took some pics recently in the auto mode and they came out great. Even in low light and setting sun, the pics were very clear. There are lot of modes you can play with. I myself have yet to experiment with all of them, but my initial feel is that the camera is very good for its value. The zoom is excellent, best feature I think.", "Date": "January 26, 2014"}, {"Title": "Great camera to grow with", "Author": "Sue Sutton", "ReviewID": "R1LBW94AEQIY0E", "Overall": "5.0", "Content": "I first saw this camera featured on HSN and fell in love with it on site.  Then when I received it as a Christmas present, I was so excited.  It has so many precalculated settings to help even the beginner take the most amazing pictures.  I used the SNOW setting just yesterday to capture the beauty of the last snow storm.  Beyond the presets, other features of the camera that help with ease of use are the big tilting screen to help get those difficult angled shots, the automatic eye sight conversion from the screen sight.  The weight of the camera is well balanced with the deep grip.  The zoom is accessible from the front of the shutter button and also on the left side of the camera lens.Overall, I love, love, love this camera.", "Date": "January 10, 2014"}, {"Title": "so so bridge camera", "Author": "Adam", "ReviewID": "R3C0BZ5MVVJSSF", "Overall": "3.0", "Content": "The idea of this superzoom camera is appealing but so far the images are grainy.  Further, I think I would prefer to manually zoom rather than electronically zoom.  Might want to upgrade to the the HS50exr.", "Date": "August 25, 2013"}, {"Title": "Incredible Camera and Easy to Use", "Author": "Darena Shopz \"darenashopzatoutlookdotcom\"", "ReviewID": "R1WCICFAQTHR01", "Overall": "5.0", "Content": "I'm not a professional photographer, just a mom that likes to take a lot of pictures. I like cameras to be automatic. I don't know what to adjust, how much lighting I need, etc. I had used point and shoot digital cameras for several years and was never satisfied with the results. They were OK but the color quality is only so-so. For about a year or so I have been just using my iPhone for a camera, mainly just because I have it with me. Unless I am outside, the color and lighting is terrible on it and if anyone moves at all, it's blurry. I have been wanting a better camera.I have been using the Fujifilm Fine Pix SL1000 and am thrilled with it! It provides such great quality pictures and easy to use.I have used it in all sorts of situations and it has provided top quality pictures in them all. We shot pictures of the super moon and used the zoom to get some super close photos of the moon. We went on a cave hike and took it with us and all the pictures turned out great. It was completely dark except for very low lighting from some lights and the camera knew exactly what to do to make the pictures look great. I took them on the SR AUTO mode which selects optimum camera settings for certain modes. We have also used it for just everyday shots, inside and outside and they have all turned out excellent. All the colors seem true to life and not red like my last camera and my iPhone both take.The hardest part about using the camera for me was trying to put that stinking strap on. My husband put it on without much trouble though.The camera comes with the strap which is really nice and the USB cable so you can hook it up to your computer. This camera has a rechargeable battery so it also comes with that and the battery charger and plug adapter. You'll also get the lens cap and string to attach it and a basic owner's manual. Included is a  CD which has the complete owner's manual in PDF on it and a picture program.I am really pleased with this camera, it's all I could ask for in a camera. It's pretty heavy and large but it still fits in my hand well and wasn't uncomfortable to lug around all day while we hiked since it has the nice, large strap.I highly recommend it!", "Date": "July 4, 2013"}, {"Title": "Its just Okay", "Author": "R Hogan", "ReviewID": "RSMH5PF0VBQ0Z", "Overall": "3.0", "Content": "Well I was hoping for a large Zoom which this camera has without the noise,Sadly Fuji did not put enough thought into this model to reduce the noise even at 100 iso. So I sent it back and maybe next time they will get it right,Had some nice features but noise to me is a deal killer.", "Date": "July 29, 2013"}, {"Title": "I love this", "Author": "Half Fast Farmer", "ReviewID": "R1P6U3L5M5RDCO", "Overall": "5.0", "Content": "I am not a great photographer. I have zero training. I have never taken great pictures or really enjoyed taking them.So I loved this camera. Suddenly, I can take decent pictures. Ansel Adam's legacy is still safe but I can take pictures that are beautiful to me. That has been so fun. I have a ranch in the Rocky Mountains. We have some amazing wildlife around but they are always too far away and moving too fast to take good pictures. But with this camera I have gotten some amazing shots of elk and wolves that were so far away I could barely see them. The camera takes care of the distance and movement easily and quickly enough to catch the really great moments.I have actually taken the camera off \"auto\" and tried some different settings. I have been able to work with them and get some fun shots. I have looked a couple things up but mostly it is really easy to figure out how to use this camera.The camera is heavier than I expected. All of the components work smoothly and feel sturdy. To remove the battery cover you have to slide a button down while pushing the battery cover to the side. It is a little awkward. The battery lasts for the weekend.I could not be happier with this camera. I would recommend it to anyone.", "Date": "July 21, 2013"}, {"Title": "Everything I was looking for", "Author": "Adam", "ReviewID": "R2E6I5B49LI6TL", "Overall": "5.0", "Content": "My wife and I have never heard any good or bad about Fujifilm so I was hesitant to by this camera. I took a gamble and it paid off. Its got all the gadgets a geek like me loves and the simplicity and speed my wife enjoys. SUPER zoom is awesome and it takes great shots. I recommend a monopod just in case you have slightly shaky hands like me for those relay close up zoom shots. Everything on this camera works great and better then I expected. The only down side is that the battery does not last as long as my under water camera, but that's to be expected with something that multitasks like this. It last a couple of hours but I recommend a second battery if you plan on taking it the whole day. Other then that, AWSOME. And the price cannot be beat......... ;)", "Date": "May 25, 2013"}, {"Title": "love it", "Author": "gary doberstein", "ReviewID": "R3EUI3MSPYCVJM", "Overall": "5.0", "Content": "this camera is awesome it takes awesome pics... the zoom is just wow ive been using fuji cameras for years and this is deff the best one yet  ty", "Date": "January 27, 2014"}, {"Title": "Very good camera for many", "Author": "Seaweid", "ReviewID": "R11TQ5UODWE5O5", "Overall": "5.0", "Content": "I got this just before Christmas to capture all the fun stuff of the season.  Works great and is just what I wanted at a great price.  In fact the price dropped a few days after I got it and I called Amazon and they gave me a credit!  That's why I like buying from them.  They stand their policies without B.S. !I have 2 older SLR units (film) but it is getting so difficult to use these anymore, and costly.  Electronics has indeed taken over and for the better as a general note.  The 50X OPTICAL zoom is just right for most situations and very easy and FAST to shoot with so you don't miss the action.  This however is NOT a $1200 camera like some have tried to state or compare. It is however one of the best for those that want an upgraded unit, easy to use/understand, and doesn't set you back a house and car payment! Ha!  I believe you will enjoy this unit at many different levels and has many cool extra features that are always a plus to use.  The number one reason, out of many I purchased this is for FAST on the go shots that I could zoom in quickly and not have to deal with changing lens types...  what a pain when you just don't have the time or want to carry the big bags.  That's why some professionals have two or three cameras around their neck - FAST SHOOTING.  But then most of them are getting paid for it!So...  go for it if you what a very good upgrade that has many nice extras, to a snap n shoot camera that really brings home quality lasting pictures forever!  I have already used the tilt back screen to shoot shots in crowds as I am not real tall, and got the shots of \"Santa\" in arriving.  Happy picture taking!ps...  Do Not go cheap on the memory card!  This camera is a high-end fast shooting and must have a very fast grade card.  Most brands are fine as long as they are coded \"HCI or (10) speed. SD cards come in many speeds along with the size or amount they can hold. You will kick yourself and blame the camera if you use less, like a no. 4 speed, good for low end stuff.  They just are not built to record fast data that your new camera can produce.  Have fun!", "Date": "January 16, 2014"}, {"Title": "Definitely a winner in my book", "Author": "Joshua Ramirez Wharwood", "ReviewID": "RWFP29NJB4FHQ", "Overall": "4.0", "Content": "I'm coming into this previously owning a Fujifilm FinePix S4000 which unfortunately died after a good run. You can tag me as the type that loves having a good lens and the ability to do some SLR-like tweaking without the SLR premium price.With that said, PROS:- You really have to see the 50x zoom this thing boasts about to believe it. Like, WOW- There is a hot shoe in addition to a pop-up flash- It handles RAW images- Image quality is not as stellar as an SLR, but as long as you keep the ISO low, you'll get some images with good exposure, sharpness and color-The build quality is top-notchCONS:- The power switch is a bit wonky at times. It doesn't respond until after a firm, emphasized slide- The eye sensor is very sensitive. Normally I just force it to remain on either the LCD or the EVF via the EVF/LCD button- For some, the price may be a bit off-putting (the alternatives can go for as little as half the price of this one), but the amazing zoom and the feature offerings are more than worth itOut of all the cameras I've played with here and there, so far this one feels like the most versatile; whether you're a pro looking for an array of photography styles, or someone like me who's still learning the intricate stuff, it will meet your demands and then some. Truly 4.5 out of 5 for me, but because Amazon loves integers so much, 4 stars.", "Date": "January 15, 2014"}, {"Title": "Find out what you want before buying a camera!", "Author": "AG", "ReviewID": "RCPDSVMNYN8YV", "Overall": "4.0", "Content": "This is a great camera at a great price! You need to know what you want first, before buying a camera.  What do you want it for?  where are you planning to use it the most, indoor or outdoor?  How much do you want to spend?  Is size important? etc...Here's my take:I have never done any kind of photography, other than casual phone or point and shoot; but, this year I felt like getting a camera that would make me enjoy taking pictures!  I couldn't be happier: now, I never leave home without it; every day is a 'shooting' opportunity.  Please read all the technical details about this camera, so you can be informed of what you're getting.  I can only write about the practical shooting enjoyment that I'm getting out of this:1. Great feel on the hand, secure, solid, and balanced weight2. Easy to use, and learn to navigate3. Easy to transfer pics to computer, using the SD card or USB cable4. Great shooting range, from close up distance(macro) to out of sight distances(over a mile!)5. Fairly good quality; the better you get with camera, the better the pictures get(take your time to learn to use all its features!)6. Performs great under low light(find out best setting for best results!) as well as outdoor sunny days7. The zoom really works, and makes this camera all worthy!This camera is exactly what I wanted; It's a little bulky, but very comfortable on the hand.  I would give it a 5 stars if I was better at taking pics; the more I learn, the more the rating increases.  I highly recommend it...", "Date": "January 1, 2014"}, {"Title": "Beat Similar DSLR Camera!", "Author": "Claudia V. Mcdowell \"Claudia Vera\"", "ReviewID": "R2UBT5ZR73J2OX", "Overall": "5.0", "Content": "Please listen to this review. I got the camera as a present  for christmas. Although amazon had many christmas orders mine came in 1 week, past christmas but still ontime. When i turned on the camera i was not impressed. The screen looked grainy and pixelated! I was so disappointed and was wondering if i should return it. I then stRted exploring the camera. I had already watched \"the fuji guys\" videos on youtube teaching how to use it. It hepled so much! As i started exploring it i found over 10 filters or shooting options! The panormama is also amazingly great and the macro quality was absolutely AMAZING. I got the camera for the amazing FULL HD camera quality. I wanst disappointed. The video is so clear and amazing i can even see it perfectly clear on my new 50\" tv! There are also many other features for advanced camera people. My favorite was the amazing zoom that wasnt pixelated even after zooming in ALL the way! The viewfinder is also very cool because it has any eye sensor so the lcd turns on and off if you near the viewfinder! This camera is ABSOLUTELY AMAZING and worth the money!!!", "Date": "December 28, 2013"}, {"Title": "Great All Purpose Camera", "Author": "E. Clark", "ReviewID": "RGCAA4QYSPSLT", "Overall": "5.0", "Content": "This camera is very easy to use, right out of the box.  The SR Auto setting allows a very wide range of focus from extreme zoom to extreme macro, from bright light to almost no light.  Being able to tilt the viewing screen is very helpful.  I prefer to use the viewfinder rather than the screen, so I was a bit disconcerted for a few seconds when I brought it to my eye, as the camera automatically goes from the screen to the eyepiece.  That was very easy to adjust to.Since the extreme zoom also magnifies motion, I was concerned about being able to hand hold.  The shutter speed and image stabilization make it possible to brace against something solid and get the distance shot without a tripod.I have an older professional level DSLR with changeable lenses, which is a very good camera, but also very heavy.  This Fuji is much lighter weight and easier to take along.This camera has many of the features of a DSLR, and for the price it is an excellent choice.", "Date": "November 2, 2013"}, {"Title": "My new all in one camera - Good quality pics with ultra zoom", "Author": "XNOR", "ReviewID": "RGY1HGT2QH5M7", "Overall": "3.0", "Content": "I have a Canon T2i SLR camera with 3 lenses (18-55mm, 50mm fixed, 75-250mm) and when I want to travel - I have to carry the huge camera, the lenses and keep switching them to take good quality pictures.Now with the Fujifilm finepix I do not have to do that - I just need to carry one camera which covers more zoom than all my lenses put together.What is good about this camera ?  - Ultra zoom with focus length as low as 1 cm - even my Canon T2i cannot match  - Quick focus and fast shutter speeds for action scenes - shot some birds moving and was capture very well even when the light was not that bright  - Full SLR functions to adjust aperture, shutter speed, ISO to shoot the images your wayWhat is not good about the camera ?  - As much as bulky as an SLR - but atleast you do not have to carry that many lenses  - I really really miss my canon 50mm fixed focal length lens for portrait images : nothing in this camera matches that lens :)  - Ultrazoom without a tripod is pretty usesless since even a small shake will distort the image - that is with any other cameraOverall - it is a better alternative to SLR - not only does it work out better in terms of price, but also more convenient to carry and play around with.~Update :  After using it for the last couple of months - I tend to go back to my DSLR or my point and shoot primarily because of indoor picture quality - which are not really up to the mark. Hence I reduced the rating from 4* to  3*", "Date": "July 10, 2013"}, {"Title": "Best in class features offset by image noise issues", "Author": "Rowan Wing", "ReviewID": "R3PLEK3Y8S83YN", "Overall": "3.0", "Content": "I really wanted to like this product. Hi-res EVF and Screen, dual zoom levers, good build quality and grip on zoom barrel, high speed video etc.Why did this not work for me?Best in class features combined with high noise even at low iso. This has to be compared with other very small sensor megazoom cameras, which is what I am doing here. There is no point comparing to APS-C sensor cameras (compact mirrorless or DSLR), apples and oranges.- Image quality plagued by noise at 400 or even 200 iso. A lot of reviews discuss this. Compared to the competition, image noise is much higher even at low ISO. That is a big trade off even with a much lower price tag.- Zooming is not that fast compared to sony or canon (hx300/sx50) although released after- Manual focus is not availableI am still looking for the ultimate bridge camera in 2014. I am waiting to get my hands on a Sony HX400V which uses Bionz X processing, which looks like it might be a serious contender despite its relatively larger size, and Canon is about to announce a successor to its SX50. I have tried the Nikon P600, and see no notable changes over the 520 (and 510). The zoom speed has not improved at all, making it one of the slowest megazoom cameras.If Fuji can come up with (much) better noise processing at least matching sony, canon / nikon, and keep the hi-res evf and screen, add manual focus and speed up zoom, they will have a winner.", "Date": "May 22, 2014"}, {"Title": "High quality!!", "Author": "HelloDough", "ReviewID": "RO0U9P7CNFH1B", "Overall": "5.0", "Content": "I got this camera as an upgrade from my small handheld canon powershoot point-and-shoot camera. And man, was it an upgrade! I was first considering a DSLR but the price was way out of my range. I got this camera after reading several reviews and jumping from camera to camera. I used it at my brother's college graduation and we sat in the way back of the Big House (google it, i was far up) but I was able to zoom all the way in to see the Commencement speakers and the orchestra kids' faces. The pictures came out very high quality. I also used the video option to record a guitar cover and i was very pleased with the quality. I was able to watch the video back in 1080p on youtube, so good stuff!", "Date": "May 17, 2014"}, {"Title": "This is my 4th Fujifilm FinePix and this one is the best yet!", "Author": "Sharon Barrett Kennedy \"artrageous\"", "ReviewID": "R1O1IG5GFZHPKZ", "Overall": "5.0", "Content": "I have been so pleased with this brand due to its versatility.  I take a LOT of photographs and I love being able to instantly switch from the zoom setting to super macro to capture whatever catches my interest.  At first I was disappointed to see that it didn't use AA batteries, but I bought an extra Li-on battery and that way I always have a spare.  The battery life is good and I've been averaging about 300 pictures before needing to replace it.I was really surprised, too, at the quality of the video--absolutely amazing!--even though I don't use it that often.The 50x zoom allows me to get up close and personal with wildlife, and as I've experimented with the manual settings, I've been able to take some truly outstanding pictures of the moon.  (Friends have asked if I used a telescope!)If you're thinking about purchasing a much more expensive DSLR, bear in mind that you would need to buy several different expensive *lenses* to do what this one camera can do. I'm very pleased with my purchase and I will continue to recommend FinePix cameras to anyone who is looking for an affordable way to enjoy photography.", "Date": "May 11, 2014"}, {"Title": "Nice bridge camera for beginners/amateurs", "Author": "Elizabeth A. Gempka \"Lizard\"", "ReviewID": "R2JY49X1R2YDCY", "Overall": "5.0", "Content": "I am going on vacation May 2014 and was looking for a camera that had more features than just a point and shoot, but I also didn't want to lug around an SLR with multiple lenses, etc. I decided on the Fujifilm and am beyond happy that I did. The camera has a viewfinder, which is a feature I was specifically looking for (I guess I'm old school like that lol) but its a bit on the temperamental side, so there's always the option to turn it off altogether. The menu is easy to navigate but I do suggest thoroughly reading the manual. The zoom feature is outstanding, but as another reviewer noted if you plan on using that feature quite a bit then its good to have extra batteries on hand. Its a great camera for someone who is just a 'beginner' or who is just looking for something a little more simple than an SLR. I also received a camera bag with this, but its WAY too small to hold anything more than the camera so I'll be buying a bigger bag to hold the extra batteries, etc. That's really my only complaint.Bottom line (from someone who's not a professional): Fun, easy to operate camera for a great price. Highly recommend.", "Date": "April 21, 2014"}, {"Title": "I LOVE this camera! Great quality at an affordable price.", "Author": "Bob \"Mr. Bob\"", "ReviewID": "R2R4MZFWUEWG9A", "Overall": "5.0", "Content": "I had high expectations for this camera - it has far exceeded them.I am not a professional photographer, but I wanted to get better pictures than I would get from a normal point and shoot camera. The SL1000 has met my needs.ProsThe camera is light weight. I was concerned that it would be heavy, bulky, but that is not the case.The zoom is absolutely incredible, far beyond what I expected. I took the camera with me on a short trip to Africa. We did a lion safari tour, and I was able to easily zoom in on the faces of the lions and tigers without difficulty. I never expected to get close-up portrait shots of a wild animal, but I did with this camera.One day I was outside and saw an aircraft contrail. I could not see the plane. I zoomed in with the SL-1000 and got a brilliant shot of the aircraft with the contrail behind it. If the plane was at 30,000 feet, that means it was six miles away when I took the shot! Using a tripod I have taken many pictures of the full moon and have been stunned by the high resolution: craters are easily visible and at the edge of the moon, I can clearly see the outline of mountains.The camera has a multitude of settings. I rarely take the camera out of the AUTO mode and have found the photos to be very good.I can use an HDMI cable to connect the camera to my HDTV to see the photos: they really look great on the large screen.You can use the large viewscreen on the back of the camera, or the viewfinder. Most cameras do not offer this option. I have found the viewfinder to be very helpful when shooting on an extremely sunny day. You can set the camera so that it will sense if you are using the viewfinder: when it senses you are  it will turn off the LCD screen, helping to save battery power. When you are done with the viewfinder it turns that off and turns the screen back on.The LCD screen tilts up and down. This came in very handy when I was in a crowd and had to hold the camera way above my head to take the shot. I adjusted the screen so that I could still see the shot and was able to get some good photos.It does a wonderful job, in AUTO mode, of setting depth of field. The item at the center of shot is in focus, the background is not, helping to highlight the item I am shooting. I prefer that to a photo where everything is clear.I have not used the movie option, so I cannot comment.I bought some extra batteries on Amazon and carry them with me, but have never gotten to the point of needing to replace the battery in the middle of the day.The MACRO setting is phenomenal. There are two settings, regular macro and super macro. I took some shots of some old coins - I had the camera so close that I was almost touching them. The camera was able to automatically focus, even at such a close distance, and gave me incredibly sharp photos of the coins.It has a popup flash - I've only used it a few times, it has helped a lot.Overall, I am most impressed by the amazing clarity and sharpness of the photos I have taken with this camera.ConsIt sometimes has a problem focusing in a very dimly lit area. In this case a manual focus would be a big help but it does not have one. If I took a lot of photos in dimly lit areas, this might be a big problem. However, it has rarely come up.The zoom is auto, you zoom in and out by pushing buttons. I'd like a manual control.OverallAs I said, I LOVE this camera. I have been able to take shot that I never would have imagined with any other camera. The zoom is incredible, the photos are amazingly sharp, and the camera is comfortable to hold and use. Five Stars!!", "Date": "March 12, 2014"}, {"Title": "Love this camera", "Author": "Amazon Customer", "ReviewID": "R3NJ6NEI73G487", "Overall": "5.0", "Content": "For years I've used the same 5 mp Fujifilm camera.  When I got that one that was top of the line, if that tells you how long ago it was.  After my son dropped it, and broke that camera I began looking for a replacement. After a lot research, and reading product reviews, watching video's, etc.  I decided to get this camera.  I haven't played around with all the functions, but am totally in love with this camera.  I was a little disappointed an owner's manual didn't come with the camera, but that was easily fixed by going to their sight and downloading a pdf version.  The camera comes with a basic manual.  I definitely suggest downloading the complete user manual.  At first as some other reviewers have said, it was a bit confusing and hard to get focused pictures.  After going through the Owner's manual I've gotten a better handle on what I was doing wrong.  I couldn't figure out how to work the flash until i read it either.  Now I have a great camera, with excellent zoom to take lots of pictures of my dogs, kids, the lake etc.  I recommend this camera.", "Date": "March 1, 2014"}, {"Title": "All my children's cameras did..???", "Author": "docblade", "ReviewID": "R1MZ4WSVNFHWNB", "Overall": "4.0", "Content": "Don't buy camera if you want to play your video on a TV with sound. This camera has an audio format that is not recognized on a TV.. All cameras I have owned did. All my children's cameras did..???", "Date": "February 28, 2014"}, {"Title": "Great camera for the money", "Author": "S. Foster", "ReviewID": "R2EVUJ004HJ0DL", "Overall": "5.0", "Content": "This camera is lightweight and easy to handle. While traveling, it gives you a lot of versatility with such an incredible zoom that other photographers are envious. The controls are very user friendly and maneuvering the various functions is straight forward and not confusing at all. I'm glad that I shopped and compared cameras because I absolutely love this Fujifilm!", "Date": "February 21, 2014"}, {"Title": "awesome camera!!", "Author": "Sandidee", "ReviewID": "R4EW6SLX5AI2F", "Overall": "5.0", "Content": "This camera is awesome! I was a little worried about battery life after reading the reviews but have not had a problem with it dying too quick .. and it takes awesome pictures! Very nice and would totally recommend it to anyone.", "Date": "February 17, 2014"}, {"Title": "Excellent product! images clear, vibrant, accurate! zoom apperciated. Great feel to the camera. Reviews helped me decide.", "Author": "FB from Ann Arbor, Mi \"outdoor adventurer\"", "ReviewID": "R3SBLVIJ4FAHLI", "Overall": "5.0", "Content": "First the product feels very good in the hands. Solid, well built but not extra heavy.  Macro, super macro, excellent photographs. Doesn't take an inordinately amount of time to master almost all features. Buy extra batteries and an extra 64Gb card and you'll spend next winter creating fantastic slide shows and presentations with crisp clear photos and enjoyable video. Great choice!", "Date": "February 5, 2014"}, {"Title": "Great Deal for the price.", "Author": "M. Kadinger", "ReviewID": "R38Y11EILVFD7H", "Overall": "4.0", "Content": "I bought this camera because I'm not interested in a true DSLR. But I wanted a bridge camera that allowed me to experiment a bit. I was not disappointed. It's a good camera for the price, and a great entry level camera for those who may want a DSLR in the future. Overall I am satisfied. But the one thing that irritated the hell out of me was the lens cap. Not a huge thing for sure, but sometimes it's the little things that count. Whoever designed that lens cap needs to be horsewhipped. It is one of those little things that you have to deal with every time you use the camera. And every single time you are forced to deal with that lens cap you will get irritated. I don't like to get irritated. Does anyone know if some company is selling an aftermarket lens cap that works? If so, please me know. I actually destroyed that lens cap that comes with this otherwise great camera. I feel better now, but I still need a lens cap.", "Date": "January 23, 2014"}, {"Title": "A Camera for all Reasons!", "Author": "Doug Charmley", "ReviewID": "R1CK2A9ZMM6ZG3", "Overall": "4.0", "Content": "You name it and this little honey packs a wallop and has the right equipment to meet the many needs that are, and are not, found in the larger, bulky expensive, harder to manage well known DSLR Camera's that we know about and are used today! Where can you get 1200 lens that can double right on the same enclosed devise/equipment like is in this well accomplished Fuji FinPix SL1000 digital camera. We now have the \"speed\", focus,  vast lens range and all the other bells & whistles that are used, and found on, both a point and shoot and the high end DSLR's. Folks you really cant go wrong here even the price is amazing for the huge amount of \"Equipment\" you get in this packed little and amazing set of photo taking device/equipment. Just look around, as I and many others have, and seeee for your selves!The one concern, and problem that they could have and NEED to address is that the power needed to function this little power packed camera is that is should have came with a Better, longer lasting, higher powered battery supply. The 1700mAh  battery is not near enough for the use of the \"huge zoom\" lens factors, fast focus features, and the on off power usage . I recommend getting one-two more batteries for the customer; and I recommend Fuji FinePix Camera Design engineers \"try\" looking into their \"Battery designs\" for an upgrade, modification and a \"Reasonable Power Increase Factor\"(RPIF) of at least, and up to, and around 22000mAh to 2500mAh for \"PROPER & NEED AVERAGE BATTERY USES\" on this camera, Fujifilm FinePix SL1000 16.2MP Digital Camera!!!Product DescriptionThe Fuji FinePix SL1000 Digital Camera features a 16 megapixel 1/2.3\" backside-illuminated CMOS sensor that is able to produce high quality imagery with notable low-light sensitivity. High speed performance is afforded throughout the system, enabling fast continuous shooting up to 10 full resolution frames per second and an auto focusing speed of 0.2 second. Full HD 1080i video capabilities are also supported at a frame rate of 60fps. An incredibly long 50x optical zoom lens is also built into the SL1000's design, giving a 35mm-equivalent focal length range of 24-1200mm. This range can be effectively doubled through the use of Intelligent Digital Zoom, and an optical image stabilization system benefits shooting at such magnifications by reducing the appearance of camera shake. Both a rear LCD monitor and electronic viewfinder are available for monitoring and image review, and both have a high 920k-dot resolution for clear image viewing.", "Date": "January 3, 2014"}, {"Title": "SL 1000", "Author": "Brenda", "ReviewID": "R1NS5SXS54I682", "Overall": "5.0", "Content": "I have been shooting Professionally for over 25 years, the SL 1000 makes taking pictures Easy and Fun. I have a SL 8400 and a Cannon too.  I use to use a Fuji 901 which I would put up against any Nikon or Cannon, it was way ahead of it's time. The Varsitilly of the Sl 1000 is great, no need to carry Bulky lenses, you've got it all in one.", "Date": "December 29, 2013"}, {"Title": "Great camera!!!", "Author": "Poolnrd", "ReviewID": "R37GOTGEMYUSD3", "Overall": "5.0", "Content": "I am in Costa Rica as I write this. Still learning all of the features this camera has to offer but I am very happy with the results of those pictures I have taken. I have pictures of birds, dozens of iguanas and coatis and a hundred or so pictures of the Westin resort and the beach. Tomorrow we travel down the river where I hope to get pictures of the monkeys, crocodiles and snakes. I'd recommend this camera to all beginner or intermediate photographer. You won't get the quality pics like those from a $1000 Canon but the pictures are certainly acceptable to me. The camera is easy to use and carry and you don't have worry about changing lenses.", "Date": "December 13, 2013"}, {"Title": "The SL-1000 is just a great bridge camera!", "Author": "Timothy J. Schrader", "ReviewID": "R37L9ZSPLLWO9C", "Overall": "5.0", "Content": "This is a great camera for novice to advance amateur.  It is part point & shoot, and part DSLR.  The controls are laid out nice and easy to use. The big owners manual is easy to read and reference.  I really enjoy taking pictures with this camera. Plus, I think Fujifilm has the best web support for their camera's and customers. Web pages are easy to use and find what you are looking for.", "Date": "December 7, 2013"}, {"Title": "Excellent", "Author": "Jairo M.", "ReviewID": "R1J6ZXNIS2BLB8", "Overall": "5.0", "Content": "is better than I expected. probe took him to the moon picture and details of the relief of the moon is excellent. still learning to use all its features. practically is a professional camera.", "Date": "November 12, 2013"}, {"Title": "Another great camera from Fuji", "Author": "J.L.H", "ReviewID": "RXDCDX120R78Z", "Overall": "5.0", "Content": "I'm an avid amateur photographer who spends most of my free time in my kayak.  I always take a camera because you never know when nature will bless you with an opportunity.  I have had the 18x, 30x and now the Sl1000 50x and have been extremely pleased with quality in all these Fuji cameras.  The Sl1000 is truly an amazing camera with a zoom equivalent to a 1200mm SLR lens.  The cost is reasonable and try and get something comparable for the price and quality. You won't find it.  Aces all around Fuji. Thanks.", "Date": "October 7, 2013"}, {"Title": "Good quality in a money saving package", "Author": "Scott Anderson \"Sharpsburg\"", "ReviewID": "R3JL7CUFVOTMES", "Overall": "4.0", "Content": "I purchased this as a go between for my heavy SLR Digital Canon and a lesser quality video camera picked up off the shelf at Wal-Mart.  I was looking for a good quality build, great zoom lens, easy to use features and a quality name brand.  I've found some of the that with this system.  In fact some of the first pictures taken with the camera have been my favorite and are now my home page on my iPad.  I can list the Pros and Cons I see so far.Pros:50x wide angle zoom lensElectronic viewfinderManual controlsHot shoe for external flashRAW modeVery good image quality, inside and outExcellent 1080i HD video qualityFast focusing and refresh time between shotsVery good battery life.Great valueNot very heavyGreat zoom feature on lens and camera bodyTilting 3.0-inch TFT color LCD monitorCons:Small 1/2.3-inch CMOS Image Sensor.Image noise is noticeable above ISO 100.No noise reduction settings.Proprietary battery, no AA or AAA abilityI'm more than likely going to return the camera however due to the high noise issues in the images.  I've tried to compensate but it's not working out, so I will be looking into a Nikon or Canon to fill the requirements.  More to update as I progress through the next several days of picture taking.Update:8/19/2013The pictures I've been taking were at a lower setting, once I reset the camera to the correct settings the noise has really dropped off and the pictures have come out fantastic.  Several were printed up on 8x10 and 11x14 photo paper without beautiful results.  I've bumped up the review to 4 stars and I am really enjoying the camera!Update:1/12/2014Setting were pictures size and the images have been much improved.  Fuji does a nice job in mid range cameras, and I look forward to future demos from the company to showcase their ability.", "Date": "September 11, 2013"}, {"Title": "I like it but....", "Author": "Phillip Dacus \"Meeds Met\"", "ReviewID": "R18CWAX2WXEECC", "Overall": "4.0", "Content": "I do like the camera. It seems to take good pictures. It has a ton of buttons that I will probably never use. The main reason I got it was for the zoom and the shutter speed and continuous pics. I can push a button, make 1 more selection then with the press of the shutter button, take many many pics at the same time. So its easy to get lots of shots as something moves and get just the right pic. I love this.My last camera was sooo slow, that I would press the button to take a pic, but by the time the shutter actually closed to take a pic, the subject had already moved. It was terrible.The thing that is driving me nuts though is that I cant get the pics out of the camera. With other cameras. I could just plug the USB into a computer, windows would pop up something asking to import the pics and that was it. Sure Easy.With this, I plugged the USB cable into a Mac and then a PC. Nothing. I even tried loading their software into both the Mac and the PC. Still nothing. I searched the manual, but found nothing. At this point, Im thinking that the camera is defective. Surely the manufacturer would not make it this hard to do something this simple.The pics are all stored, I hope, on the card I bought. So I am hoping that I can find an easy way to get the pics off the card. If anyone has any suggestions on how to do this, please let me know.Phillip", "Date": "August 24, 2013"}, {"Title": "Superb high-end point & shoot camera, you are mobile when on the go", "Author": "Paramananda", "ReviewID": "R11E68P54BUIXG", "Overall": "4.0", "Content": "The optical zooming quality is good. If I use a DSLR, I need to carry separate lenses but Fuji S1000 serves the purpose of both long range and macro level photography. With this camera, I can groom myself further and equip myself. Cost wise, it is good 'value of money'.The negative elements:You see some noise in the picture quality (whether it was clicked using zoom or not). Moreover, hand shaking control is not good enough...so it demands a greater level of patience :-) , however I'm fine with it. Last point I would like to mention is that sometimes while doing night photography, you feel too much of light in the shutter box (more than required....I know it can be adjusted to some extent but I'm talking about the auto mode :-) )Overall, I'm happy with this camera and it will be my best friend for at least 1 year or two :-)", "Date": "August 22, 2013"}, {"Title": "Good camera for aspiring photographers", "Author": "Michael Casey", "ReviewID": "R3HZW9VYQBT6IQ", "Overall": "4.0", "Content": "Easy to use, but macro setting tends to white out on some macro shots or blur.  Could be something I'm doing wrong.  Otherwise I love the camera and will be taking it with me on PCT hike for several months.", "Date": "August 10, 2013"}, {"Title": "Great Super Zoom Camera", "Author": "kpf", "ReviewID": "R13C0W8X5MI0PF", "Overall": "5.0", "Content": "When I decided to buy a 50x camera, I researched the three brands that were available at the time.  Really couldn't make a decision by the reviews, as they all had both good and not so good reviews.  I decided to go with the less expensive model, and I couldn't be happier!  I bought the camera to use mostly at concerts, as my Olympus 35x had difficulty focusing on moving subjects amid flashing lights.  Took this camera to a recent show and got some amazing photos from 25 rows back - you could actually see the color of the artist's eyes!  Also took a picture of the \"supermoon\" with no tripod, and it turned out beautifully - able to see all of the craters, etc.  Definitely recommend to anyone looking to save a few dollars over the Canon and Sony cameras - this speaks volumes from a former Sony fan!", "Date": "August 8, 2013"}, {"Title": "Mixed bag but great zoom", "Author": "Grimmy \"Grimmy\"", "ReviewID": "R1G4506VX8ZK8S", "Overall": "4.0", "Content": "First, the good. 50X zoom. RAW recording. Multiple-pic modes (flash on/off, HDR, zoom bracketing, best frame, etc.). Viewfinder. Somewhat-tilting 920k-dot screen. 10-shot burst mode. Movie editing mode. Motion panorama. Super slow-motion filming. Manual controls. Hot shoe, which lets you attach external flashes.The zoom is amazing, if sometimes iffy indoors - it sometimes had trouble focusing on objects within a room. Outdoors, much better, although you may still get some blur at max zoom. Using the zoom a lot will use up the battery more, though.RAW is there if you want to play around with it, but for non-DSLR owners, it's probably going to be unused, unless you want to get familiar with RAW editing.The multiple-pic modes are useful, but not easy to get to - you have to switch modes and pick the one you want unless it's already assigned. You could use the one Fn button for something (ISO, image size/quality, white balance, etc.), but it may not have the function you want.The viewfinder lets you hold the camera steadier. It has a sensor turns the LCD on and off when you use it. However, you may find yourself triggering it by mistake.The screen tilts up and down only, to a limited degree, although still useful.Slow-mo uses a smaller screen size, understandably. You can get some really nifty stuff here. Zoom works during video recording, although you'll hear the motor.Nice, rubberized feel.In auto mode, it tends to overexpose quite a bit. This is probably the most annoying aspect of this camera.Noise starts at ISO 200, somewhat grainy at 800, soft pics at 1600 and up. Low-light produced less-than-sharp pictures. Generally good pictures in normal conditions, but if you're picky you may notice pink/purple fringing at the edges.Aperture priority is limited to three choices, for whatever reason.The spring-loaded power switch may trip you up sometimes and keep you from getting that fast startup.To be fair, I was expecting much better performance from their advertising, so I could have set too high a bar. But the zoom is a huge advantage, the pictures are usually good enough, and the other features such as burst mode and HDR will help take better pictures. A spare battery is a must, though.", "Date": "July 25, 2013"}, {"Title": "A huge number of features for this price point", "Author": "E. Swope", "ReviewID": "R12F64SBNOZ1GK", "Overall": "4.0", "Content": "I have really been enjoying using the Fujifilm SL1000, and am overall very impressed with its flexibility, number of features, and most importantly, image quality.  Some months back I was shopping for a DSLR for my daughter's birthday.  As I reviewed the options I became more aware of how many improvements had been introduced since I last upgraded my camera.  Suddenly I found myself shopping for 2 cameras.  Hers was actually the easier, as she is a fairly accomplished photographer, knows what she wants and needs and has a lot of lenses from a certain company.  For myself, the decision was a lot more difficult as I wanted fine image quality (primarily for shooting art glass) and a good zoom for my son's band performances, high sensitivity for night photos, and to eliminate the need for flash in the glass photos.  In other words, I was looking for a good all-around camera, without breaking the bank.  After reading dozens, maybe even hundreds of reviews, I decided that a bridge camera would be a good choice but found it a challenge to balance quality, features and my price point.  For the past 10 years or so I have been using Panasonic Lumix cameras and have been very happy with the quality (both build and image) as well as the flexibility (long zoom, small package).  To be truthful, it was the introduction of their FZ200 which made me feel like my old camera was sorely lacking.  I set the FZ200 and it's cousin the Leica V-Lux as the \"holy grail\" attempting to match features and quality within my price bracket (no easy task).  Reviewing the options, several popular cameras which shared most of the features were in my range,but I really wasn't satisfied with image quality.  I ultimately purchased an Olympus Pen micro 2/3 for the image quality and the ability to use my old Minolta lenses.  That, however, was a fairly big disappointment (if interested, that review is here http://www.amazon.com/Olympus-Thirds-Interchangeable-Digital-14-42mm/product-reviews/B004L9IXWI/ref=cm_cr_dp_synop?ie=UTF8&showViewpoints;=0&sortBy;=bySubmissionDateDescending#R2YXXZAS08PQNH ). Back to the hunt.  I considered the Fujifilm FinePix HS50EXR 16 MP Digital Camera with 3-Inch LCD (Black) but nixed it because of the manual zoom.  To cut to the chase, the SL1000 builds on the features of the HS50 adding a 50x zoom lens and very bright optics (F2.9-5.6), very nice in a lens this size, achieving ISO sensitivity to 12800. It has a CMOS sensor and optical image stabilization, which produces a  nice image quality, even at maximum zoom (see sample photos).  The articulating screen and electronic viewfinder (a rarity in bridge cameras in this range) providing excellent options for composing shots in a variety of lighting conditions.  Both start-up and recovery are fast, so I do not have to worry about losing shots as I did with the Pen...which brings me to another favorite feature which I did not initially consider: moving object tracking.  Since I did not get this with sports photography in mind, and my kids are at an age where I can get them to stay still, it was not a high priority, BUT combined with image stabilization makes for some nice sharp pictures, compensating nicely for shake, wind or movement which can blur pictures, problems often accentuated in a large zoom.  That said, I could recommend this as a good camera for people with toddlers, pets, or sports fans.  It gets nice action shots.The SL1000  offers a full range of options for manual control, as well as auto focus and the ability to effectively use it as a point & shoot.  Unlike many cameras in this price range it provides the option of shooting Raw.  Several creative filters are available, as well as the ability to do panorama stitch in-camera (and stitch video as well).  The only thing which took this camera down a notch in my eyes is that the color reproduction was not as accurate as on 2 other cameras I compared it to (a Lumix travel zoom and PEN micro 4/3).  Granted this is not comparing apples with apples, however, in terms of sharpness, depth, overall quality, it compared nicely, producing better pictures than the other 2 in most circumstances!  The colors on the Fuji were just a little hot, popped too much, or seemed unnatural on some shots (most evident on pink & red flowers).  There is still some temptation on my part to give this 5 stars taking price into account, as in truth comparing it to a camera which costs 3x as much or is a completely different format is not really fair.The bottom line is that it shoots nice crisp pictures, provides a huge amount of flexibility and has a good solid build at a very reasonable price point.  It's a combination which is tough to match.", "Date": "July 21, 2013"}, {"Title": "Good feature rich camera for the price", "Author": "Patrick Holt \"txdragon\"", "ReviewID": "R2BDNBPOYYTWQ3", "Overall": "4.0", "Content": "I have the previous version of the camera, and its nice to see that they listened to some suggestions for the new version.  The main things that stand out to me are:1. Ability to save your photos in Raw Format - this is a great feature, that there is no excuse not to include.2. Lens optic have improved, pictures are much sharper3. Better low light capability with less noise at higher ISO but not on par with bigger sensor camera's but that's to be expected.4. If your not into shooting raw, the JPG processing engine does a nice job as well.5. Better construction and control layout6. Manual control -sort of- including aperture and shutter speed.Like the last version it has super zoom.  Now this is a great thing and kind of the main feature of the camera. But keep in mind, the more you zoom the more camera shake gets magnified.  You you try zoom all the way and go hand held, you probably will have some soft or blurry pictures if the subject is close up.Overall for the price this is very versatile and good camera that I would consider prosumer.", "Date": "July 17, 2013"}, {"Title": "loads of cool features, meh in low/med light", "Author": "Laura B", "ReviewID": "R320Z08FNZX3VZ", "Overall": "4.0", "Content": "3.5 stars (I'm rounding up to 4 because I think I am comparing too much to a DSLR.)I have been wanting to get a mid-range camera. I have a couple of older point-n-shoot cameras and a DSLR.  I wanted something that was better than the smaller cameras, but not as complicated as a DSLR.  This seems like the perfect choice.  For most things I really, really like this camera.  It has a couple of things I don't like.So, let's start with all the cool features.The video capability on this thing is AMAZING!  There are so options from FULL HD to high speed filming!  I'm not sure how often I will use the HS filming, but it sure was funny to watch my 5.5 month old jumping in his jumperoo in slow motion.  The HD is beautiful quality.  I was amazed how awesome it looks on my computer.  And to record?  Just push the little red dot button--no need to change modes (a pain and you can easily miss something if you are changing modes to go from still to video).There are tons of different setting options.  You can do full manual, aperture priority, shutter priority, Auto, and Auto select (it detects the type of photo for you).  You can essentially act like you have a DSLR (without lens options) or a point-n-shoot.The lens is super HUGE.  I know all the reviews mention this, but it is important to mention.  This thing goes from wide-angle to super close-up.  WOW.  Just WOW.Now, for what I think could be improved.Low-light/medium-light shots are noisy.  When I shoot photos indoors during the day with seemingly plenty of light, the pictures still look grainy.  Plus, they seem a little overexposed and washed out.  There are no vibrate colors at all.  I admit that I don't care to use the flash much, so if I did use the flash it looks better, but it is obvious I used the flash.  Plus, things are still a little overexposed.  I tried changing different settings for this (ISO, shutter, or aperture priority), but nothing seemed to work.  Plus, since I was photographing my kids (5.5-month twins and a 2-year-old), I got a lot of blur.  Leading me to my next nit...The focus is just ok.  I really like my DSLR with a grid of focus points I can choose from.  Here, I am given a few choices, but I cannot pick the specific focus point (outside of tricks of focusing and then moving the camera).  You can do center, continuous, tracking, or multiple.  I was trying to take pictures of my twins, so I had it on multiple, but it kept focusing behind them, so they ended up blurry compared to an in-focus background.Overall, this is a cool camera that does so much for its price-point.  I think it would be great for someone thinking about upgrading to a DSLR, but not wanting to spend that much money on lenses or accessories.  Just be mindful that it is better for outdoor photos and not indoor portraits (unless you like using a flash, which I prefer to use natural light).  I don't recommend this for someone wanting to take pictures of their kids or just for family pictures around the house.", "Date": "June 30, 2013"}, {"Title": "Qaulity shots every time", "Author": "G. Redshaw", "ReviewID": "RVQ693I9XWY4H", "Overall": "5.0", "Content": "Granted the only thing I have really used the camera to take photos of, are sports cars moving at a fairly high speed, I had to use multi-shot, but i had a few moments where it was on single mode, but the settings were perfect for some lucky shots that turned out to be the best I had of the day.Great camera, certainly recommend to anyone looking for a \"bridge\" camera, and I highly recommend learning about using the functions of the aperture, and shutter speed, as using the auto settings will not make you improve your skill (if you are looking to improve anyway).Ridiculous zoom range, anything over 100 meters is easily focused in on by this camera.I'm still learning the ropes with this camera, and the settings beyond the preset ones.", "Date": "June 19, 2013"}, {"Title": "Yet another excellent camera from Fujifilm", "Author": "Tanya Miller", "ReviewID": "RHTN6ABX04KBR", "Overall": "5.0", "Content": "I bought this to replace my 5 year-old 8mp Finepix.  This camera has exceeded my expectations at every turn--great image quality for a bridge, easy to handle, comfortable in my hand, a wonderful alternative to carrying my DSLR everywhere.  It's hard to beat Fuji's image-stabilization especially with the big zoom on this camera.  Great for shooting sporting events and anything else where you want the flexibility to shoot without a tripod.  Love, love, looooove this camera!", "Date": "June 12, 2013"}, {"Title": "Fujifilm SL1000", "Author": "Glenn D. Durst", "ReviewID": "R3444IKB1I7332", "Overall": "5.0", "Content": "Great camera. Takes fantastic images and is impressive in very low light. If you are looking for an inexpensive digital camera with some truly nice features, then consider this one.", "Date": "June 11, 2013"}, {"Title": "interesting camera", "Author": "D. Rohrdanz \"dkstr\"", "ReviewID": "R1HN13SUQKDWTM", "Overall": "5.0", "Content": "I come here from pocket Lumix (good) and Canon with mobile LCD's (very cool).  This is a new venture for me, and this camera is amazing, but a little big perhaps for what I was thinking of. I can't see why haul different lenses around tho-this starts with a great wide angle and shoots 1 cm macro!  I like some of the special features-the function \"wheel\" on the back can be set up so that there is a special filter, effect or function available with the push of a button-I like putting the bright light highlight feature on it-so that I can quickly add depth and character to bright daylight shots.  quickly takes 2 shots, one with and one without flash (you know how great some digital pics come out if you don't use flash?  This lets you choose later!.)  I don't use the zoom on the left of the lens...occas use the view finder, occas move the LCD.  great Panorama, totally automatic.  I think checking the actual dimensions against a camera you already own would be a good idea-I might have wished I had a oh 30 x zoom size of a baseball instead-smaller is sexier, but larger can also be sexier!  See user pic of two cameras side-by-side.  On other hand, got great blood Full Moon shot handheld middle of street..I got it for about $240, a steal deal. I like it a lot. fast, versatile.sexy.", "Date": "May 30, 2014"}, {"Title": "great buy", "Author": "Adam Burroughs", "ReviewID": "R90PP129SY83Q", "Overall": "4.0", "Content": "Bought this for my wife as she is a beginner in photography.  She loves it needless to say.  The only issue is the camera has a blotch on the lens that won't come off it was given this way.", "Date": "May 22, 2014"}, {"Title": "Great Photo's", "Author": "kathryn ward", "ReviewID": "RU8THJ6AKD65O", "Overall": "4.0", "Content": "I bought this camera for my mother-in-law who love's taken photo's and her old camera the shutter would not work correctly. She love's it the pictures are a lot more crisp even while in action. Only thing is it is a little heavy to carry around all day.", "Date": "May 22, 2014"}, {"Title": "What great camera for Fuji's first digital s.l.r type camera!", "Author": "velly", "ReviewID": "RHJG8P54IQ4TX", "Overall": "4.0", "Content": "I was a little surprised how the zoom feature help up its claim. The LCD screen is pretty cool, being, one of the best features on the camera. I was enjoy the panorama mode, as well the wide angle features. The best I'd say on the camera is the hotshoe witch allows you put a dedicated flash unit on top, giving the camera a full look of a standard s.l.rI plan to use this as a temporary start up for my business, until I purchase the rebel t.i 3 from cannon.", "Date": "May 12, 2014"}, {"Title": "Fuji FinePix SL 1000 Digital Camera", "Author": "Bjoerling Idolater", "ReviewID": "R10W9SVD1S2ONJ", "Overall": "5.0", "Content": "There has not been a chance to really put it to the test, but I am not worried.  I steady tripod is a MUST for longer focal lengths.Raising the ISO also helps.  Am happy with the purchase.Bjoerlng Idolater", "Date": "May 12, 2014"}, {"Title": "Great camera!", "Author": "Sandy K. Oksen", "ReviewID": "RUBROVNB08GD1", "Overall": "5.0", "Content": "Love it I got it for my husband for his birthday. We're looking forward to taking it on a trip with us. Takes awesome pictures.", "Date": "May 1, 2014"}, {"Title": "Love it !!", "Author": "Mc G", "ReviewID": "R4OQGRGAN44M0", "Overall": "5.0", "Content": "Great Camera, ease of use with all the features usually only found on an SLR cameras twice the price. added a 32gig high speed card.", "Date": "April 28, 2014"}, {"Title": "Incredible camera", "Author": "dpittman414", "ReviewID": "R24CFGE2IJE3SG", "Overall": "5.0", "Content": "I am still learning the camera, but it does everything I have wanted it to!  Photos are clear and sharp.  Great camera, Great Price!", "Date": "April 27, 2014"}, {"Title": "LOVE this camera.", "Author": "MaryEM", "ReviewID": "RA2NENU58895A", "Overall": "5.0", "Content": "I am by no means an expert on cameras - wish I was! I just love taking pictures. I was looking for a replacement for my current digital point and shoot camera but wanted something that had a better zoom on it - this camera has it! I am still learning how to use it as it has so many more features then a regular old point and shoot. Also, I love the color resolution in the pictures - very vibrant. And the picture quality is very good as well.Cons - This really isn't a con but the only one I could think of. This camera is not just a point and shoot so I was a little frustrated at first but put the camera on Auto mode and was able to get good pictures until I could read the manual and play around with it a bit. I still need to watch the DVD that comes with the camera - hopefully that will help even more.Overall - this is one of the best cameras that I have owned and for the price, it packs a lot of features!", "Date": "April 25, 2014"}, {"Title": "Love this camera", "Author": "C. Hammaker", "ReviewID": "R2J2VWRVMOH3BL", "Overall": "5.0", "Content": "I like simple.  This camera is very simple to use.  My teenage son used the camera the other night to take pictures of the eclipse of the moon, and the pictures turned out great.  He had never used the camera before and was able to take great shots of the red moon.I use the camera mainly for videoing my son's wrestling matches.  The camera takes excellent videos at 60 fps, which makes it easy to view in slow motion for review with his coach.  I can video his matches from the stands because of the tremendous 50X optical zoom capability of the camera.", "Date": "April 23, 2014"}, {"Title": "Super \"FUN\" Camera, beautiful pictures.", "Author": "R. Neese", "ReviewID": "R2W718NLKO5Z85", "Overall": "5.0", "Content": "I've owned this camera for over 6 months and have shot hundreds of pictures with it.  I love it.  This is the most fun camera that I have ever owned.  Pictures are beautiful.  The many modes of operation and HD video make it super versatile and allow you to be creative.  It can even shoot Slow-motion video as well as 3D pix.For me, the 50x zoom lens is it's best feature.  (That's equivalent to a 1200mm lens on a 35mm camera.)  I've taken pictures of the moon with it that show more detail than my astronomical telescope does.  I've also focused in on wildlife 100 yards away that appear in the viewfinder, to be right in front of me.  An equivalent Cannon telescopic lens would cost about $17,000.  For real.  Look it up.  (Of course the Cannon lens would be much superior in quality.)I'm very satisfied with the pictures taken by this camera.What I don't like about it is that the battery compartment cover feels flimsy and I need to be very careful when opening it to extract the battery or SD memory card.  Also don't like that the lens cover sometimes pops off easily and also that no filters or lens hood can be mounted.I'd definitely recommend this camera if you want to explore photography and have fun at a very reasonable price.", "Date": "April 9, 2014"}, {"Title": "Review", "Author": "Harisankar PT \"hrisnkr\"", "ReviewID": "R1FWE4LW7F05U8", "Overall": "3.0", "Content": "Picture quality is not that great, also not a very good option for low light picturesSince it gives you the better zoom, you cant except the same better in its qualityover all a descent product", "Date": "April 9, 2014"}, {"Title": "camera", "Author": "jerry1s", "ReviewID": "R11FOI1FTFC4UA", "Overall": "5.0", "Content": "I am very happy with this camera, it takes GREAT pictures and the zoom is fantastic I bought this to take pictures of a new grandson and the shots are great, I've blown them up to 8x11 and the detail is fantastic.", "Date": "March 13, 2014"}, {"Title": "I like it so far...", "Author": "C. Davis", "ReviewID": "R2N69ZN2Y151R9", "Overall": "5.0", "Content": "I seems to take beautiful pictures but I won't really know how good it is until spring comes and I can get out a take a lot more shots. I do have a problem with the viewfinder (the one you look through) - it's not very bright so it's hard to see what I'm trying to photograph when I'm outside in the sun. I do really enjoy the long zoom lens, though.", "Date": "March 8, 2014"}, {"Title": "Love It", "Author": "Ed", "ReviewID": "R3B6QY9NEE14QM", "Overall": "5.0", "Content": "Replaces my old Kodak that was simulor to this one, easy to use for the basic and above user & has lots of extras for someone that either knows the better cameras or wants to learn", "Date": "February 28, 2014"}, {"Title": "nice camera", "Author": "lester", "ReviewID": "R3LJ303O3JQZQ7", "Overall": "4.0", "Content": "Very nice camera. Well built feels like a premium product. Just a little complicated to find the best picture setting.", "Date": "February 24, 2014"}, {"Title": "true to its promises", "Author": "Daniel Almadani", "ReviewID": "R1O7LHN2EUM6X3", "Overall": "5.0", "Content": "I highly recommend you visit Fujifilm website to learn all about its spec. The picture quality is very crisp and high. I have canon xti and I have to say that the picture quality is very comparable. Buy it and enjoy.", "Date": "February 20, 2014"}, {"Title": "Bought as a gift, now I have many happy memories", "Author": "Lori Hamilton", "ReviewID": "R3O6QEG7J4HLFD", "Overall": "5.0", "Content": "I purchased this at my daughter request as her Christmas present.  She loves it and I have LOTS of pictures of my Grandson.  It had many of the same features of pricier cameras, but cost about $150 less.  Produces high quality photos.", "Date": "February 9, 2014"}, {"Title": "Good price for a good product", "Author": "Marcio Roberto de Souza", "ReviewID": "R2AVNF8HGOR5ML", "Overall": "5.0", "Content": "The shipping delayed one day, but they refounded me the shipping costs. The camera is exactly what I wanted: simple to use and better than a compact camera, especially because of the super zoom.I recomend.", "Date": "February 6, 2014"}, {"Title": "Great Fuji camera", "Author": "batyah", "ReviewID": "R35DOYU7G9AKKX", "Overall": "5.0", "Content": "I tried several other cameras, Fuji as well as Nikon, trying to find a 14-16MP with a view finder plus the 30-50X telescopic lense but still be able to get great close-ups  with out having a camera that was complicated and too heavy to hold still. This is one had met all of those requirements and prayerfully this one will be my go-to camera for many years. I been using a Fuji S700 for almost 7 years but the quality of the photos were not what I wanted.The price is reasonable and it is a great camera for those of us who like to take photos but are not professionals.", "Date": "February 5, 2014"}, {"Title": "perfect camera", "Author": "charlotte", "ReviewID": "R1AORDGG5ZPUGN", "Overall": "5.0", "Content": "the camera is amazing, i took the most beautiful pictures with it. i'm very happy i bought this wonderful camera", "Date": "February 1, 2014"}, {"Title": "50X zoom and 3D pictures, amazing...", "Author": "Phyllis Courtney", "ReviewID": "R17SXAK4MNRSYA", "Overall": "5.0", "Content": "50X zoom blows me away. Don't know how everything works yet. Haven't gotten to the 3D shots. It's an amazing camera.", "Date": "January 10, 2014"}, {"Title": "Very good product.", "Author": "Blaine A. Jackson \"arcajun1\"", "ReviewID": "R3R7C2ISF8YW21", "Overall": "5.0", "Content": "I have found the product to be very good, and easy to use. The ability to take still photographs while a video is recording is an excellent feature, and has been very useful. I am still learning, but well satisfied so far.", "Date": "January 10, 2014"}, {"Title": "very good camera", "Author": "Álvaro Saldarini", "ReviewID": "R3VROH27BYNGS4", "Overall": "5.0", "Content": "really it looks like a DSLR camera, but it's much easy to take good phtographs in any situations, the size is ideal, i'm ver happy with my purchas", "Date": "January 7, 2014"}, {"Title": "Great camera.", "Author": "SissyJ", "ReviewID": "RP2GAEN638ST0", "Overall": "5.0", "Content": "Really like this camera for close-ups of birds and wild animals, timed photos of groups, etc. Definitely recommend it for anyone who wants a 50X zoom at a good price.", "Date": "January 3, 2014"}, {"Title": "Great Camera", "Author": "KRISTINE", "ReviewID": "R17P66YSEC9OO5", "Overall": "5.0", "Content": "I love this thing I keep it in my car and have so many great shots that otherwise would have been missed! Very easy to use Just a great camera LOVE IT LOVE IT", "Date": "December 25, 2013"}, {"Title": "Just a geezer taking pics", "Author": "Michael", "ReviewID": "RQU00EAS7Y0IO", "Overall": "5.0", "Content": "It works for me , take it snow shoeing , the cold has not affected it yet , I am happy with the battery life , And The ZOOM is Awsome !I can see the deer the deer can see me but I am far enough away where they stay put and my photos make me happy .Its enjoyable .Remember this camera is what it is , just an all round fun camera with a big zoom , if you looking for the best quality on the planet this is not for you , I can not complain about the results I get , my screen saver looks nice and the prints I order are really decent . The battery has decent life also.", "Date": "December 20, 2013"}, {"Title": "excellent", "Author": "Akhan", "ReviewID": "RCQ7WX1ZZ52US", "Overall": "5.0", "Content": "Excellent camera; the zoom is very impressive, at such a price.  I recommend every one to buy this product confidently.", "Date": "December 9, 2013"}, {"Title": "Awesome Camera!", "Author": "Michael Montejo", "ReviewID": "R55C7T1TUXSNA", "Overall": "5.0", "Content": "Amazing camera!!! Absolutely love it has the best zoom I have every seen.  very easy to use not complicated at all and great price is also a plus!!", "Date": "December 3, 2013"}, {"Title": "Very pleased", "Author": "Scott R. Wales", "ReviewID": "R3J62YBORPTT0Q", "Overall": "5.0", "Content": "It does everything promised and it very user friendly.  I did not want an SLR and needed a camera that my wife could \"Just pick up and use\".  The burst (continious) mode was a important feature.  The 1000 has an easy acess button to activate this featue.", "Date": "November 22, 2013"}, {"Title": "Good as a general purpose \"snapshot plus\" camera", "Author": "Scott_G", "ReviewID": "R3FB99RZHC43RQ", "Overall": "4.0", "Content": "Have not had the chance to use it on manual, but it does a decent job in full auto - if you have a ton of light.  In anything less than direct sunlight, it starts using higher ISO settings.  In some settings - say, over 800 - the images gain a lot of noise, or grain.  It so happens that some of the pix I've taken look pretty good this way.  But for a lot of them I'd be happier with less noise.  The zoom level is pretty impressive, especially if you're on a tripod or monopod.I really bought this as a camera to keep on me while traveling.  It doesn't compare to my Pentax K30 for \"good images\" but, as they say, the best camera is the one you have with you.  Beats dragging around $1,200+ dollars worth of cameras and lenses.", "Date": "November 16, 2013"}, {"Title": "So far, I am loving the camera but not happy with fuji film customer service", "Author": "Linda Vorisek", "ReviewID": "R1LIGO1MD5EZFP", "Overall": "4.0", "Content": "I have taken some pictures using the Auto Mode, they are clear and very nice. However, the charger that came with the camera did not work. I called Fuji, to get a replacement. I am responsible for paying for the shipping of the charger, I think that stinks and is poor customer service. I just bought the camera last week and have only been able to use it because I got a charger from another company. I hope this camera lasts!!", "Date": "October 25, 2013"}, {"Title": "Excellent product", "Author": "Victor Miguel Saraiva Tomczak", "ReviewID": "R2KHJ41HDMA352", "Overall": "5.0", "Content": "Excellent camera. Does everithing a camera of this category must do, it's features are equivalent to those of a Canon, a Nikon, a Sony, but it's price is more fair.", "Date": "October 22, 2013"}, {"Title": "Superb! Excellent! You will not go wrong with this camera!", "Author": "AngieSouthCarolina", "ReviewID": "R1HZ951WLQSFY9", "Overall": "5.0", "Content": "Excellent!!! I wish I could add the photos I took of Venus and the moon! Yeah I was able to see Venus quite well with this camera. The pics of the moon are amazing.It almost looks like a 3 D pic you can see the ridges on the craters. That was all in the point, zoom, and shoot mode because I do not know anything about setting that aperature, ISO stuff I kept reading about. The video mode does awesome as well. I could see Venus well but it seemed to jump out of focus a lot on Venus. But hey....its a camera that you can see Venus with and even got some cool video. Price is super right! Amazon has this camera $200 cheaper than I could find anywhere else. Get it...you will not regret this purchase!", "Date": "September 30, 2013"}, {"Title": "Still in evaluation", "Author": "John Turner", "ReviewID": "R3FRNHGIG7WFX1", "Overall": "4.0", "Content": "So far I like camera.  This is the second SL1000 ordered . First returned due to faulty battery or charger.  This 2nd charger and battery are responding the same as first shipment.  Trying to reach Fuji for additional details on suspected problem.", "Date": "September 14, 2013"}, {"Title": "Great camera... but", "Author": "Fred J. Morgan \"Jeff Morgan\"", "ReviewID": "R3EXEDPDOKPYVU", "Overall": "5.0", "Content": "I love the camera... REALLY LOVE IT. BUT so far two bad chargers sent.  But the price afforded me to order \"Pack Of 2 NP-85 Batteries And Charger Kit For FujiFilm FinePix\" which came quickly and works great... trash the FUJI Charger.Tested camera:  High zoom show great detail without loose in image or contrast. Good focus throughout range. VERY LITTLE Aberation at high zoom. Color is clear. 30 second exposures on tripod at 3200iso makes good star photos. Best Bridge camera I have used. Price lower than many quality brands (though Fuji has good name).. Photos better than many of those brands.Missing (like most bridges) Flash options like delay. Missing filter threads (I found a 52mm fits perfectly and snugly on lens when camera is on....Like all Bridge camera, it does not have all the features of a SLR but to be honest.. Who can afford n SLR with a 1200mm lens, more-less a zoom 28-1200mm????  GREAT CAMERA... WORTH EVERY PENNY.", "Date": "September 11, 2013"}, {"Title": "Awesome Camera", "Author": "Caroline Berkeley", "ReviewID": "R2A5YX19S6EJ4L", "Overall": "5.0", "Content": "Camera is easy to use if your a beginner and takes awesome pictures,  if you are more experienced it allows you to make the photos look the way you want them to easily", "Date": "August 17, 2013"}, {"Title": "Good Camera for Beginner", "Author": "Celeste", "ReviewID": "RVO8M1RQQ2Z3C", "Overall": "3.0", "Content": "What I like:Great zoom lensGreat for shooting in low lightManual, Aperture, shutter priority modesHas a nice viewfinderWhat I don't like:Too heavyNot many F stops-not able to get a blurred background or nice bokeh image with this lensNo manual focusContinuous shooting is horrible in this cameraHad it since august of 2013. Selling to get an interchangeable lens camera and a less heavy camera.", "Date": "August 4, 2013"}, {"Title": "Fujifilm FinePix SL1000", "Author": "Thomas Mcguine", "ReviewID": "R1W7T1ANJ9AR5E", "Overall": "5.0", "Content": "A number of years ago I had a FinePix S5000. I am very happy with the SL1000. There is one feature I enjoy the most. You can take a picture then edit it via the \"crop\" feature. This allows you to zoom in on the picture taken and then take a second picture. Your first picture will remain as is. A wonderful feature especially if you want to get closer views from your original picture.Needless to say the zoom on the camera is exceptional. The camera feels comfortable to hold and the weight of the camera is not an issue.Wonderful camera. Highly recommended.", "Date": "July 30, 2013"}, {"Title": "Great pictures!", "Author": "ed", "ReviewID": "R3T4XWNFG67TY4", "Overall": "5.0", "Content": "I purchased this camera for a trip to Europe and the quality of the pictures are amazing! I definitely recommend this camera!", "Date": "July 27, 2013"}, {"Title": "Best bridge camera Yet", "Author": "Lloyd A.", "ReviewID": "R2KCNYSUQ3WSNL", "Overall": "5.0", "Content": "Would appreciate this camera more if the zoom lens had a manual focus feature.  The switches to move the zoom are not as smooth as if manually set.  Otherwise love the hot shoe, the 50 - l optical wide to telephoto lens, the new automatic lens settings, the panorama feature, and the smaller size.  Wonder if the optional flash unit is a dedicated flash that is controlled by the various automatic lens settings. Or, is the flash synch.d. only at certain shutter speeds??", "Date": "July 22, 2013"}, {"Title": "A Very good camera", "Author": "Joseph R. Caruso", "ReviewID": "RZIPJ77HIFG39", "Overall": "4.0", "Content": "The quality of this camera is very good.  Well made.Although to date, I haven't had much time to use it.I've been disappointed with some of the pics but thatcould be my inexperience in using it.  I have anotherFujifilm camera (S1800) and was always pleasedwith it's performance.  Would recommend this camerato others.", "Date": "July 22, 2013"}, {"Title": "Awesome Camera - Fujifilm Finepix SL1000", "Author": "Dipteshkumar", "ReviewID": "R39T05N95PF1M2", "Overall": "5.0", "Content": "Good alternate for DSLR.Didn't expect this many features in this price. The image quality is really nice 50x Optical Zoom.The only problem is you need to get used to with it. It won't take more than a week.", "Date": "July 16, 2013"}, {"Title": "Pretty good camera, the battery died quickly though", "Author": "Sebastian Fernandez", "ReviewID": "R365NJY2Y3HM5F", "Overall": "3.0", "Content": "There are some aspects that I loved about this camera, but others that came up short.Pros:-Amazing zoom in a reasonably small package-Has many DSLR features without being a DSLR camera-Excellent grip, which is much better than many camaras I have tried in the past, including several DSLRs-Easy to use, if you are looking for a camera that can do some nifty things without having to take a photography course to get it done, this camera might be what you wantCons:-Even though the zoom is truly amazing, it is extremely hard to get crisp pictures inside when using the zoom setting near its max.-The on-off button is awkward to say the least, not sure who came up with that idea-The battery died on me after a month, I fully charged it before the first use but I already noticed that it took longer than what the manual said it should take to charge. Then I used the camera for a while and recharged the battery. After a few days I went to grab the camera and the battery was totally dead, and when trying to recharge it, it remained that way. Not the end of the world, but truly annoying.Bottom line is that the camera has some nice features but comes up short in other areas.", "Date": "August 15, 2013"}, {"Title": "MIssing Parts.... shocker", "Author": "Jodi", "ReviewID": "R3JY61N9ZGYN3C", "Overall": "3.0", "Content": "vacation is in our near future and I bought this to take with us.... Charger and USB cord are missing and its obvious the camrea packaging itself had been opened and re-taped previously. I will probably return it if I cant find the parts on my own.", "Date": "May 2, 2014"}, {"Title": "A real dud", "Author": "Mary J. Johnston", "ReviewID": "RT3FBZPV1Y7CL", "Overall": "1.0", "Content": "I have had had a Fuji camera before and loved it's quality of picture so I kept trying to get used to this one. I took it on vacation and really tried to get it to take a good picture. Close picture wash out If a person isn't completely still it blurs Far pictures are grainy. I'm told that I can't return this even though I have had it a couple of months. Will never buy Fuji again", "Date": "March 7, 2014"}, {"Title": "A learning procees", "Author": "john h phelps", "ReviewID": "RVKKO14OF8R3A", "Overall": "3.0", "Content": "I have always owned an Olympus camera, but the one I chose to replace my current model was uncomfortable and I tried the SL 1000.. this seems like a great camera, but the instructions booklet is hard to understand... It was written as if you completely understand photography and I am only a novice...  The few pictures I have taken were excellent and I think this will be a slow learning process because of the instructions.... I love the camera and wish I could learn how to use it quickly.", "Date": "August 15, 2013"}, {"Title": "DSLRish but not a DSLR replacement", "Author": "Kanishk Rastogi \"Freelenser\"", "ReviewID": "R2R4594N7RRCAA", "Overall": "4.0", "Content": "Adding to the comments from other reviewers- 50 X Zoom and 16 MP are really fantastic.- Camera form and fit is very good and Fuji did a very good job with the layout like main dial, buttons, etc to provide an ease of use.- Picture quality is good in auto mode and Super Auto mode which can continuously change the settings automatically as you move around the camera in a scene.- Low light capability is decently good. Not at DSLR level like with the wide aperture lenses, but lot better than the standard point-n-shoot.- Size is definitely not too small. Under most conditions you will need a belt-pack at least. It may fit in a jacket pocket in winters.- A/S/M mode shooting is not very convenient and easy to go with. However, I have 2 other DSLRs and if I am in a situation where I really need that perfect shot with all the right settings, I will go with a DSLR. For most other daily purposes, this one will work fine.- Battery life is on the lower side which surprised me a little, but its not really a dealbreaker if you are not one of those \"photography day trips\" kind of people.- At very high zooms, the pictures can be blurred or shaky, so it will depend on the user to get the best use out of this. I think it works well upto 40X.- Screen tilt option is really very useful, especially if you trying to get an infant to look at the camera .- One issue which I have noticed is that the colors are not always consistent under the same set of lighting. For example, in our living room the lighting sources are always same but still I notice the color rendering to be different at times. I will not expect this in a camera in 300 price range.Overall, this is nice camera if you are debating whether to buy a DSLR. It has several of those features with a good image quality, but I recommend to look for the right deal!", "Date": "August 15, 2013"}, {"Title": "Fujifilm camera", "Author": "C Bear \"biker\"", "ReviewID": "R16EB6A9U10TE1", "Overall": "4.0", "Content": "As much as I wanted to give this camera 5 stars, there were enough little things about it that didn't warrant it. The on/off switch is tricky and can make you try more than once to start the camera up. When finally engaged, start up is fast but still slower than the Canon Powershot SX40 and SX50. If you take burst frames at the maximum file size, it will stop to save the frames taken causing a loss of action. Use a lower size option if quality isn't an issue.My biggest problem with the camera is the inconsistency of photo quality under the same lighting conditions. It will over or under expose using the same aperture, speed and lighting conditions in a 2 or 3 minute time frame. I'm use to having all photos taken within a short time having similar characteristics as long as they are taken in the same conditions.The 16mp capability is great. Most photos do come out looking beautiful just fewer than I usually get with other cameras. The panorama feature is effortless and gives fantastic results without having to stitch a series of photos together at the computer. Since you don't have to reposition the camera for each shot and instead pan the vista, there is less problem with cloud and shadow movement.An unthinkable oversite by Fuji is not being able to attach filters for protection of the lens and other uses. The greatest plus is the zooming capability. It truly does bring the smallest object up close. Although I have gotten good photos hand-holding the camera at maximum zoom, do use a tripod. It improves your chances of a great shot each time and is less tiresome than straining to hold the camera steady.  Carry a tripod and use it. You'll be glad you did.Download a user's manual if you didn't get one with the camera. There are a lot of options you would be unaware of without it.", "Date": "August 11, 2013"}, {"Title": "Awesome Camera for the price!!!", "Author": "Jerry", "ReviewID": "R2N09ETS8DTGDW", "Overall": "5.0", "Content": "I received this camera about two weeks ago and have just been learning its features, but have already taken some great photos. I would definitely recommend this camera to anyone, from beginners to pros.", "Date": "July 8, 2013"}, {"Title": "Fujifilm FinePix SL1000", "Author": "L. Steiner", "ReviewID": "R3157JQBEWW3TF", "Overall": "5.0", "Content": "First of all,  this camera is big, please see the picture I posted of it next to my 18x zoom camera, although being big is not always a bad thing. It's easy to hold and the separation between the buttons is good. The barrel of the lens makes a steady platform to hold the camera and surprise, there's a second zoom control on the side of the lens so you can zoom while keeping your trigger finger on the button. The surprises continue with the presets and programs, things you didn't even know you needed! For example, Motion Panorama 360- hold the shoot button down and turn in a circle and you get a 360 degree view. Check out the product description for the other features and you'll still probably be surprised by a feature when you get it. The rear display adjusts to perpendicular when viewing down while shooting low and to about 45 degrees down to view when holding the camera over your head. The Goldfinch picture I uploaded was taken with moderate zoom at 20 feet and no tripod, and the Tiger Lily was taken on Super Macro.", "Date": "June 25, 2013"}, {"Title": "bang for your buck!", "Author": "JoeDale", "ReviewID": "R1EBYCPP068PZ8", "Overall": "5.0", "Content": "If you are looking for great quality photos with one amazing zoom at a great price, this is the best thus far.... I am loving ever photo this beast takes!", "Date": "June 18, 2013"}, {"Title": "Great camera for me", "Author": "Nina", "ReviewID": "R2JGAHEC06MPN2", "Overall": "5.0", "Content": "I wanted to go back to a Fuji camera because I feel they just have the best features that are easy to use and understand, and take the best quality pictures.  This camera did not disappoint me in all aspects!!  There are SO many ways to take photos it will keep me busy figuring out all of them!  Love and recommend to anyone who is looking for a camera that does everything without having to get extra lenses for every shot. After taking my camera on vacation I have come back to give it a 5 star rating!  I have taken the best photos with this camera with no problems occurring at all.  SR Auto mode is SO easy for any person to use; professional photography or amateur!  Best purchase I have made in 2 years.  Thank you FUJI!!", "Date": "June 12, 2013"}, {"Title": "owner of an NEX 7 testing this camera", "Author": "onestopnyc", "ReviewID": "R31OKC5YDEN28F", "Overall": "3.0", "Content": "I had some time to play around with this camera and try it out. I own a Sony NEX 7 which granted is not on the same league as this one and can't really be compared to it in any way but that's why I want you to understand my opinion.- Camera is fairly heavy and even though you can get a good grip holding it, I don't really see someone with a small hand being able to hold it very well- The view finder is pretty subpar in terms of quality- Yes the zoom is 50X and very powerful but in terms of quality the end result is pretty bad in terms of noise- The LCD display can be tilted but it has it limit- I will post some photos taken from my apartment without a tripod and you'll notice what I am talking about.There comes a point where you either want a power zoom or you want good photos, for the price of this camera I would rather recommend you buy something from Sony or Canon without a crazy zoom but that will be able to take good photos. Or spend $200 more and get the X20 fuji.", "Date": "June 24, 2013"}, {"Title": "reviewing my new camera", "Author": "elana shoval", "ReviewID": "RGQ5RMBG8OBCE", "Overall": "4.0", "Content": "i choose this camera after looking many cameras on the web. the finepic sl 1000 met my needs as an advanced amature and the budget i could stand.i have it only few weeks but enjoied using it and the quality of the photos", "Date": "April 10, 2014"}, {"Title": "Best camera for the money", "Author": "jerry Cox", "ReviewID": "R2GYGJN2PB00M1", "Overall": "5.0", "Content": "This is clearly the best camera that you can buy for the money. We bought 3 different ones and took them back because there was something that we didn't like about them. We love it and use it all the time, Just got back from vacation out west and took over 2000 pictures. I do recommend that you purchase a extra battery and the car charger like i did, that why you never run out of life on the batteries.", "Date": "March 26, 2014"}, {"Title": "Great Camera", "Author": "John Decorde", "ReviewID": "ROW04N4FVTDSK", "Overall": "5.0", "Content": "Not being exceptionally proficient with photography, this camera make you look like a pro with he quality of picture it takes!!!", "Date": "March 6, 2014"}, {"Title": "Best bang for the buck!", "Author": "LuisH", "ReviewID": "R1Y26I8DOL57UI", "Overall": "5.0", "Content": "It's a great camera, with nice pictures for an amateur photographer like me. I put it in SR Auto and let it do all the work for me. Hope one day I can learn to set this thing so I can take better pictures in low lighting conditions. The zoom is incredible! I just have a little issue with it and I don't know if it's normal or mine has a problem, but when I take the first picture using flash, the second one takes very long to finish (the screen goes blank and after like 10 seconds it shoots).", "Date": "February 9, 2014"}, {"Title": "Fujifilm FinePix SL1000 16.2MP Digital Camera with 3-Inch LCD (Black)  -  Very Nice", "Author": "Richard M. Green", "ReviewID": "RUNST6BXE8W8T", "Overall": "4.0", "Content": "This camera is a big step up from the versatility and clarity of even the best mobile phone cameras.Biggest complaint is the operator's manual because it's very confusing.  The camera itself is pretty straightforward though and even the video function is excellent.", "Date": "October 2, 2013"}, {"Title": "So delicate", "Author": "Pen Name", "ReviewID": "R38ZFLPZMZE3PK", "Overall": "5.0", "Content": "This is my second one, i purchased the first one with a leather bag to protect it but with a little knock down it was totally damaged, now iam taking extra care of my new one , the picture is perfect with detailed zoom and variety of shooting types, LIKE IT", "Date": "July 2, 2013"}, {"Title": "bad battery", "Author": "Tyrone", "ReviewID": "R1LYKDN2VGBDR", "Overall": "4.0", "Content": "i like the camera. The battery that came with it won't charge and I can't take but about 6 pictures and then I have to recharge it.", "Date": "July 2, 2013"}, {"Title": "poor customer service", "Author": "Kristen Rempel", "ReviewID": "R1BS40I6BDYJMR", "Overall": "2.0", "Content": "I purchased this camera direct from the manufacturer and gave it as a holiday gift. When the recipient opened it and followed the directions for set up, the battery and/or charger did not work. I contacted the company and they have told me that since I contacted them 40 days and not 30 days after the item was shipped, they will not provide a replacement even though it was a gift and that's why it wasn't opened within 30 days. Instead the only option is to purchase a replacement part for at least $45 plus shipping and that may not even take care of the problem of this faulty part right out of the package. Perhaps this is a great camera but the customer service just isn't worth the hassle.", "Date": "January 2, 2014"}, {"Title": "Out standing camera", "Author": "Edgar D Dearmore", "ReviewID": "R2EXHTIUL4KXYI", "Overall": "5.0", "Content": "I bought it for the zoom feature.  It can be a bit jetter when hand held at the longer zoom but partice will reduce this.  The digital zoom works better than any camera I have used, just use a lower resolution.The only negative aspect I have found thus far is the lack of a shutter release either wired or IR/RF.", "Date": "April 27, 2013"}, {"Title": "King of the ultrazooms - UPDATED - camera broken after two weeks.", "Author": "ScOObydoo", "ReviewID": "RSGM68PI0FIO9", "Overall": "5.0", "Content": "UPDATED REVIEW: The camera stopped working after about two weeks, any time I press the shutter, it turns off. To make matters worse, Fujifilm has has the camera for a month, and still doesn't have an ETA on the repair time.UPDATE 2: Now almost two months later, and the camera is still with the repair center \"waiting on parts\". Disgraceful compamny.Crikey - what an overlooked and awesome camera this is. Amazing how a once mega brand like Fuji can barely even find shelf space at the local electronics store when they make brilliant cameras like this. Lets start with the obvious - that lens! When fully extended, it just looks plain silly, but the range is fan-tas-tic! Sitting on a patio, I spotted something tiny, pulled out the camera and zoomed all the way into the point where my eyes could barely even see that far.Photos come out almost perfect - at full length, you obviously lose a lot of light, so don't expect to use it in anything other than daylight, but on auto the results are a step above most P&S;'s in this price range.Add things like a great sensor (for the price), hotshoe, viewfinder (with eye-sensor), tilting screen, support for RAW, 10FPS and even 60FPS hd movies and you have a true winner. This thing even beats the similar Nikon and Canon products hands-down.Downsides - it is big - DSLR big, the lens at full length feels \"wobbly\" and there is no remote/mic input. But at $329, this thing can not be beat.", "Date": "June 30, 2013"}, {"Title": "Pigspop", "Author": "Pigspop", "ReviewID": "R7111LEKBU7LQ", "Overall": "5.0", "Content": "Got the camera today, 6/18/13, impressed within the first 15 minutes. Have several cameras but Fujifilm has knocked this one out of the park. Easy to use, light weight, inexpensive as far as price goes.", "Date": "June 19, 2013"}, {"Title": "Fuji sl1000 Zoom vs Canon sx 50 hs Zoom", "Author": "Marcus W", "ReviewID": "R2T3U25IHNEXMC", "Overall": "5.0", "Content": "I am just a \"point and shooter\" when it comes to these two cameras. I dont know the technical stuff about the cameras, but heres what i have experienced with both the \"Fuji sl1000\" and the \"Canon sx50 hs\". I would rather do a video, but it will take longer than 10mins.Trust me i already tried to talk about 1 camera in under 10 mins, and its very hard to do.Which is probably why nobody posted a video.  First of all the Fuji camera came with everything you need to operate the camera and the link cable so that one could upload the photos to the internet. The Canon camera didnt come with a \"basic instruction manual\". It came with a disk.  The fuji came with a disk also but it came with a \"paper manual\" as well. The Canon didnt even come with a link cable.The Fuji Camera is cheaper than the Canon, but came with more. Yay for Fuji! :DFuji is more difficult to navigate than Canon. On the outside, Canon has more options(buttons) than the Fuji.  Canon comes out of the box ready to use. When you turn the Canon on, all you do is point, Zooooooom and shoot. You will get the 200x(optical+digital), yes i said 200x zoom right out of the box. But not the Fuji. Fuji you will get only the 50x right out of the box. Which almost made me give the fuji a \"not so good\" review.  Yes you can get the 200x zoom with the Fuji, in order to do so you must \"Press the Playback (button w triangle inside of square)Button, Press Left on the FN(function dial), then press Down to select the settings option,  Press Right, then scroll down to \"INTELLIGENT DIGITAL ZOOM\", then turn it on. After that, back out then press menu button, scroll down to \"INSTANT ZOOM\" then select  2.0x, and after you do that, back out and now you have 200x zoom. This formula equals (50xoptical + 50xdigital= 100x then 100x times 2.0x = 200x) NOTE : when you turn on Instant Zoom, you decrease the screen view to a little box. AND you must turn on INSTANT DIGITAL ZOOM everytime you cut the camera off. There may be away to prevent that like by using the custom feature.  When the \"Canon\" zooms to its max zoom, it does so smoothly, while focusing alot better than the \"Fuji\", and maintains focus alot better than the \"Fuji\" also. When zooming with the \"Fuji\", the Fuji is noticeably louder than the Canon.  According to the LCD screen on the camera, Canons photos look better than the Fuji photos. But i wont judge these two by the LCD screen. Again The Canons photos via LCD screen looks better than the Fuji.  I like both cameras and both camera zooms, i like the ease of use of the zoom with canon, better. so therefore i choose the canon over the fuji when it comes to the zoom, and clarity.  Note : Canon is a 12 megapixal and Fuji is a 16 megapixel camera.  Not sure how they effect the zoom.  That concludes my experience and opinion of these two superzoom cameras, super zooms :D  Oh yea i have seen ppl say that theres no way to cut off the automatic electric view finder on the Fuji. Well, they are wrong. You can do such by pressing the EVF button one time for off, another press to move the view to EVF, another press to turn automatic EVF off.Update: I was just playing with the ADV mode and 3D mode on the Fuji, this Camera is soo nice i will post a picture or few from ADV mode.", "Date": "June 5, 2013"}, {"Title": "Savings", "Author": "Elizabeth Parris", "ReviewID": "R3PRANR7SL6CAL", "Overall": "5.0", "Content": "Im sooo mad!! I bought the exact same camera at HSN for a $110 more!!! I wish I did a little more research.", "Date": "December 5, 2013"}, {"Title": "Great camera", "Author": "Mary Ann Gifford", "ReviewID": "R36ZG64GO9O1PS", "Overall": "5.0", "Content": "This camera has an amazing zoom as well as a great macro lens for up close shots. The batteries are rechargeable so I bought a couple extra to always have ready.", "Date": "June 28, 2013"}, {"Title": "good value", "Author": "Flavio D", "ReviewID": "R33HEE64FHM1MW", "Overall": "4.0", "Content": "I'm just begining to read the manual to get an idea of the different configurations and options I have with this camera. First impression, excellent in many aspects. Must check the options with the flash when in auto... only shows me 2 options.", "Date": "June 16, 2013"}], "ProductInfo": {"Price": "$379.95", "Features": "Tilting 3.0-inch TFT color LCD monitor (920K-dot) and electronic viewfinder with eye sensor\n16.2 million effective pixels 1/2.3-inch CMOS image sensor\nFujinon 50x optical zoom lens and digital zoom approx. 2.0x (up to 100x with 40x optical zoom)\nFocal Length: f/4.3mm-172.2m; Full Aperture: f/2.9-f/8.4 (Wide), f/65.-f/7.6-f/18.7 (Telephoto)\nFull HD movie 1080i/60fps with stereo sound and one touch movie recording", "Name": "Fujifilm FinePix SL1000 16.2MP Digital Camera with 3-Inch LCD (Black)", "ImgURL": "http://ecx.images-amazon.com/images/I/41kX-dadfTL._SX300_.jpg", "ProductID": "B00ATM1MVU"}}