{"Reviews": [{"Title": "I'M IN PHOTO-HEAVEN", "Author": "Bill McLean \"Serious Enjoyment\"", "ReviewID": "RMQLHRBI47VHD", "Overall": "5.0", "Content": "There's  so many other great and accurate reviews on this camera body that I'm just going to relate how it serves me best and make some money savings suggestions..I couldn't afford the T5i body or I would have purchased that.  I couldn't even afford  this T4i body - at least not new.  II purchased it  \"Used - Like New..\"  It was exactly as advertised.  I've always had good luck when purchasing photo equipment this way.As a serious amateur I like close-up and action photos best.  My favorite lens  is the Sigma 50mm - 200mm zoom. (I also purchased that lens as \"Used - Like New.\"  It focuses maybe a little faster than Canon's Ultrasonic lenses and the zoom control is smoother than my Canon (ranging from  28mm - 135mm)  While the Sigma  lens is a bit sharper than the Canon, I like this Canon lens for its range.  I also use other brand battery grips on my Rebels.I have been happy with the T2i  for a long time now.  But the T4i has many improvements from which I can really benefit.  (The difference between the T2i compared with the T4i is greater than the comparison between the T4i and the T5i.) The most important for me has been the speed of the continuous shooting setting.  It is not only much faster than the T2i , it is significantly quieter.  Shooting at the local dog park requires me to shoot fast without being a distraction.  This goes for not only  dogs but also for candid shots of people.My use of the articulating screen has been limited to shots taken of cats in the neighborhood.  I keep back, and with the camera at waist level, I look at the screen - not the cat.  This works fabulously allowing me to shoot several shots (telephoto close-ups) before the cat gets spooked.  I know I can also use this in my candid photography, I just haven't done any with this camera yet..  .There is much more for me to discover, and I expect this is the last camera I'll ever purchase.  I can hardly believe that technology has advanced so far in only one lifetime.  Buy the  best you can afford and enjoy every minute of life.", "Date": "May 29, 2013"}], "ProductInfo": {"Price": "Unavailable", "Features": "KIT INCLUDES 10 PRODUCTS -- All BRAND NEW Items with all Manufacturer-supplied Accessories + Full USA Warranties:\nCanon EOS 70D Digital SLR Camera & EF-S 18-135mm IS STM Lens + Canon EF 70-300mm IS USM Lens\nTranscend 16 GB 300x Class 10 UHS-I SDHC Card + Spare Battery + Spare Battery Charger\nCard Reader + Memory Card Wallet + 67mm 3-piece filter Kit\nCamera and Lens Case + Digital Camera Cleaning Kit --- Exclusive by TheImagingWorld", "Name": "Canon EOS REBEL T4i 18.0 MP CMOS Digital Camera with 3-inch Touchscreen and Full HD Movie Mode (Body Only)", "ImgURL": "http://ecx.images-amazon.com/images/I/51ALpDz2xUL._SY300_.jpg", "ProductID": "B00AFHAS1E"}}