{"Reviews": [{"Title": "Good, long zoom p&s; cam", "Author": "PSBone", "ReviewID": "R2P4058SZIAG7W", "Overall": "4.0", "Content": "I primarily chose this because it had Dog and Cat Scene modes, see my pix. It's pretty cool as it detects your pets face and automatically shoots, no shutter pressing. I like its also easy to navigate around the cams contorls, zoom is smooth tho haven't use it at the longest end as you'll need very steady hands, and it locks onto its subject quite well. Read another review complaining about the macro mode, w/c even tho I haven't used this cam extensively for that, does suffer from poor focusing or blurry shots. He also mentions the Flash, which you'll have to pop up yourself. I never had problems setting my Flash to Auto and it not firing, so i have no complaints here. If you've seen my pix, indoor shots are pretty good as long as lighting is bright enough, low light isn't bad either, but not the best, while Outdoor shots are sharp and excellent.All in all not a bad cam, takes good pix, focuses well, not the speediest, but not slow either. Pix are surprisingly sharp and clear, zoom works. Size-wise it's compact, just a tad bulky due to its 26X zoom lens, but design wise love it's very good grip.Also, I've seen Amazon say that the SP-820uz is a newer model, it's not, it's their highest end model with higher zoom and more features. It's also a bit bigger.Just wanted to add, as per someone asking if the zoom works in video mode, it does. It's a bit slow, it'll blur slightly while zooming but focuses well in the end and you'll hear the zoom motor working, not loudly, so your audio will be slightly muted while in use. If your not using the zoom or stopped, audio is fine and unaffected.", "Date": "April 13, 2013"}, {"Title": "great camera for the price.", "Author": "Joseph Denby", "ReviewID": "R1U6PE4BBVX9FV", "Overall": "5.0", "Content": "You couldn't ask for a better camera for the price. it looks nice. its very easy to use. only a few buttons to navigate the interface with is quite intuitive. I really just wanted a camera to take some nice pictures on trips and things and didn't really care about all the extra features, however after playing with some of the extra features on this camera, i'm happy it has them. The automatic panorama is very cool and simple to use. Has some fun color and image effects. The 1080p video it take looks great.  The main reason i chose this camera was the built in (but removable) battery and charger, so i never have to keep buying batteries all the time. I have yet to drain the battery completely before i was able to charge it again. You can also charge the battery by hooking it to a computer via USB so that is nice.Its a point and shoot camera not a DSLR. i was fully aware of that when i got it.. but it does look like a DSLR camera and has a good weight to it and fits comfortably into your hands.", "Date": "August 14, 2013"}, {"Title": "Amazing camera!", "Author": "Jeff", "ReviewID": "R37DDMF6JO8DGO", "Overall": "5.0", "Content": "This camera is an awesome buy, the quality of the pictures and videos is astounding. The picture quality does not fade over its epic 26x zoom either making this camera just amazing for its price.", "Date": "March 28, 2013"}, {"Title": "Step above a basic point and shoot", "Author": "Timothy Haitsma", "ReviewID": "RRK8PAVNPHWA", "Overall": "4.0", "Content": "I got this for my birthday back in Febuary. It's the next level up from a basic point and shoot camera that most people start off with. While its no where near the level of SLRs, the body has some weight to it, so make sure to use both hands to help keep it stable. I haven't used the video format on it yet so I can't comment on that, but the camera takes great photos. Read through the manual though and take some practice shots around your home to get a feel for how the camera works. It's worth the investment if your looking to upgrade from a basic point and shoot, but not ready for a SLR", "Date": "March 25, 2013"}, {"Title": "Great Travel Camera", "Author": "Lee", "ReviewID": "R2K7BGEVT2KQ8E", "Overall": "5.0", "Content": "This camera turned out to be the best investment we made for our recent trip to Alaska.  The 26x zoom and the light weight were the main motivations for buying this camera.  I was prepared for a so-so picture quality, but the results were really good - clear & precise colors for our mountain and glacier shots.  We're now recommending this camera to our friends.  If you buy this camera, be sure to purchase extra batteries with a separate battery charger so you have backup power to last the day.", "Date": "September 18, 2013"}, {"Title": "great camera for the money", "Author": "John Welker", "ReviewID": "R3OM9FMZ1CPIB1", "Overall": "5.0", "Content": "I bought this camera to replace my Kodak easy share that I lost. this camera is so much better, crystal clearpictures, and very easy to operate. I like the large 3\"screen, It is a bit bulky,however not enough to rate itlower. I think this is an outstanding value for the money and would recommend this camera to any friend or family.", "Date": "July 15, 2013"}, {"Title": "Great photos and has \"super macro\" for close ups", "Author": "Sharon", "ReviewID": "R3KOPW6O3PXAMN", "Overall": "5.0", "Content": "I needed a camera that could take closeups and clear images for Ebay.  This camera is amazing and does the job perfectly.  There were a few things I wasn't sure how to do, but I opened the manual that was installed on my computer and I am now taking amazing close ups. I'm very happy with this purchase.I did install the IB software that came with it, and a week later uninstalled that feature.  With IB software I did not have an option to erase all images in my camera after importing to my computer and it seemed to just be duplicating what I already had set up.  I prefer to just use the \"import images\" and have it automatically delete from camera.  Works best for me.I have yet to try the beauty feature.  But the super macro feature is amazing.", "Date": "October 23, 2013"}, {"Title": "Great camera!", "Author": "Bo", "ReviewID": "R2GS05XM1DOKYT", "Overall": "5.0", "Content": "I'm a beginner with cameras. I have only used a camera, a point and shoot, while on vacations so I'm not quite a novice. I love this camera because it is a better point and shoot with a rechargeable battery, and a 26x optical zoom for those distant vacation shots. I recommend it for any novice who wants more of a point and shoot camera, and any experienced photographer who want a quick shot and knows how to use its many features.", "Date": "September 24, 2013"}, {"Title": "Excellent pictures", "Author": "Manuel", "ReviewID": "RQ1ZSZVDPRNXA", "Overall": "5.0", "Content": "Fantastic. Full HD and beauty images.Safe buy. Optimizad size a and multiples options to capture.Very good machine. ok", "Date": "April 22, 2013"}, {"Title": "GREAT Camera!", "Author": "Sarah", "ReviewID": "R20FYONCGY9Z9P", "Overall": "5.0", "Content": "I love this camera. I did quite a bit of research before I finally chose this one and I am more than happy. It takes amazing pictures, has a great battery life and fits well in my hand. For the price, I don't think I could have got a better deal. I don't have anything bad to say about it!", "Date": "January 16, 2014"}, {"Title": "So far, so good", "Author": "Claudia", "ReviewID": "RBOP8GSJMWOTJ", "Overall": "4.0", "Content": "Camera is very nice and picture quality is very good. I am still working on figuring out its additional charms. Picture effects are nice too. Only main issue is that the internal memory is VERY small, so you HAVE to buy an SD card along with this one if you don't want to have to download and erase every 10 pictures.", "Date": "December 3, 2013"}, {"Title": "Great Camera", "Author": "Luis Acosta", "ReviewID": "R39611IWJ10MPR", "Overall": "5.0", "Content": "This is a great camera.  Pictures and videos are of high quality.  Scene selection and video recording is at your fingertips. The camera is easy to use and I highly recommended it.", "Date": "October 25, 2013"}, {"Title": "good camera for the price", "Author": "Cristhian G \"Drummer\"", "ReviewID": "R1AMOPJHNDKO17", "Overall": "4.0", "Content": "this camera is very nice and useful, the only problem is that the autofocus when you zoom it is not very good, but for a $130 its perfect. the video recording is very good.", "Date": "October 21, 2013"}, {"Title": "I love the camer", "Author": "Catherine Carter Miller", "ReviewID": "RYUM1H3ZJZJI5", "Overall": "5.0", "Content": "Hey it takes good photos in spite of a poor photographer. Just returned from a cruise. It was great and we have a Good record of if", "Date": "April 24, 2013"}, {"Title": "great", "Author": "MARK BROYHILL", "ReviewID": "R3T4OK8S02M1DA", "Overall": "5.0", "Content": "This product was great for my project it worked great and i am very satisfied. i would recommend this product.", "Date": "February 16, 2014"}, {"Title": "Bought this for my sister", "Author": "Jessica T", "ReviewID": "R2CU2S9E1F338W", "Overall": "5.0", "Content": "She loves it! It was everything she expected. Zooming is amazing! Pictures are absolutely stunning!  Even at night the pictures are wonderful!", "Date": "February 12, 2014"}, {"Title": "very happy", "Author": "Greg Donley", "ReviewID": "RMGH8R8IRK71Y", "Overall": "5.0", "Content": "This camera is extremely easy to use, takes great pictures in all lighting conditons and is very light. The software that came with the camera is alsoeasy to use and allow you to be very creative. All in all a great deal.", "Date": "February 6, 2014"}, {"Title": "Very happy with purchase", "Author": "Uncaballo", "ReviewID": "R2V8ROL14YU31L", "Overall": "5.0", "Content": "This is a nice little camera for snapshots! Still figuring out the settings and what works best for me. But for now I will say Great price, decent camera!", "Date": "January 3, 2014"}, {"Title": "Good camera, but only outdoors.", "Author": "Kennedy Patton", "ReviewID": "RT18ZZ5N2TQZP", "Overall": "3.0", "Content": "The Olympus SP-720US iHS camera takes excellent pictures outdoor pictures, however any photos taken indoors are no better than a cheap point-and-shoot camera.", "Date": "December 30, 2013"}, {"Title": "Excellent", "Author": "Steven J Jacek \"Steve\"", "ReviewID": "RSNPGH2S1Q768", "Overall": "5.0", "Content": "This is my 3Rd Olympus camera. I love the quality of their products. Understanding their menus obviously helps but provides a lot of options. This has a nice zoom lens (24x) but focus can be a little slow. This is a great value buy.", "Date": "December 16, 2013"}, {"Title": "Yes buy this camera", "Author": "Teri C.", "ReviewID": "R1RD9O6X8THCK5", "Overall": "5.0", "Content": "The second camera works great, if asked, I would say yes, purchase the camera. Yes, but this camera, it's great, nice pictures", "Date": "December 14, 2013"}, {"Title": "Great Camera, lots a value so we bought a 2nd one!!!", "Author": "Wolv54b1", "ReviewID": "R3OAK4TSKH1M6", "Overall": "5.0", "Content": "For the cost, this is an amazing camera.  A great point and shoot camera with a lot's of functionality.  Bought this camera for an upcoming trip as an alternative to my bulky DSLR and liked it so much that I bought one for my son.", "Date": "November 29, 2013"}, {"Title": "In love with this camera", "Author": "Mirella Gonzalez \"Happymomof 3\"", "ReviewID": "R1NIY15LD13M0A", "Overall": "5.0", "Content": "I love this little camera so many cool features and love taking it around with me every where I go takes beautiful pics and want to upgrade to the sp-810 just to have too", "Date": "November 8, 2013"}, {"Title": "nice camera", "Author": "donut52", "ReviewID": "RVO00J4FA0K3X", "Overall": "4.0", "Content": "nice camera, first ever this large, to big for pocket but zoom works well, wish the audio was better on filming thoughwould buy it again as I cant afford those thousand dollar cameras so this will have to do.", "Date": "November 4, 2013"}, {"Title": "J-me", "Author": "j-me", "ReviewID": "RBFATIG1VJCB", "Overall": "5.0", "Content": "Have only had my new camera for a short while but delivery was very fast and it is very easy to use.The pictures are crisp and the buttons/controls are easy for my arthritic fingers to press. The only negative was that there was not much of any instructions on how to use the camera and what the different icons mean.", "Date": "October 16, 2013"}, {"Title": "N8ce camera for the price", "Author": "R. H. V \"Amat Victoria Curam\"", "ReviewID": "RAZKL1W0FDAUS", "Overall": "4.0", "Content": "Camera arrived perfect and on time. Out of the box everithing was complete and ready to go. The camera has many features ghat will requide to rwax well manual inorder to take full advantage. Wanted power zoom but realized that will need Tripod to used it because any movement will sh9w on shot. Great camera for the price.", "Date": "October 12, 2013"}, {"Title": "Received this as a gift, VERY surprised by quality.", "Author": "D. L.", "ReviewID": "RQOMTKGRL5D53", "Overall": "5.0", "Content": "PROS:Awesome macro settingsTons of features and controlCompactLithium Ion batterySuper zoomClear picturesLarge SD cardGood customer service (I had to send mine in for warranty repairs)The only cons I have with this camera is, the flash tends to \"white wash\" a little bit but if you become familiar with this camera, you will eventually learn how to take pics to minimize the white effect of the flash.Here is some info. The description on Amazon is kind of lacking.Image SensorEffective pixels14 MegapixelsType1/2.3'' CMOSLensOptical zoom26x (WIDE)Focal length (equiv. 35mm)26 - 676mmMaximum aperture3.2 - 5.6MonitorResolution460000 dotsMonitor size7.6cm / 3.0''Monitor typeTFTMovie Recording SystemRecording formatQuickTime Motion JPEG®HD Movie quality1080P Recording time: 29min.Movie qualityVGA Recording time: Up to card capacitySizeDimensions (W x H x D)102.7 x 69.2 x 70.3mmWeight376gThis camera is equipped with a 26x optical ultra-zoom and Full High-definition movie capability.Main FeaturesThis camera packs a 26mm*2 wide-angle to 676mm*2 telephoto, 26x optical ultra-zoom lens.Equipped a CMOS shift-type sensor, and high-sensitivity DUAL IS*3, for double image stabilization.Supports Full High-definition movie (MOV/H.264) shooting. Magic Filter*4 is also available for use when shooting moviesThe 14.0 megapixel*5 CMOS sensor enables HDR backlit correction, and easy high-speed continuous shootingThe SP-720UZ is equipped with a 26mm wide-angle to 676mm super-telephoto, high-magnification zoom lens, enabling an extremely wide range of shooting possibilities. The power of a large and heavy size super-telephoto lens is available on the compact body of the SP-720UZ, fitting in the palm of your hand, and making it the perfect companion for keeping baggage light on a trip. This is an \"all-in-one\" camera for easily taking high-grade pictures and movies on the go.With the 26x optical zoom lens, users can capture the expressions on children's faces at school games and plays, and the action of athletes at sporting events, with a level of detail not visible to the naked eye. With the wide-angle 26mm, users can not only shoot wide-open scenery, but also capture shots in small rooms or large group shots as well. With just this one camera, users can enjoy shooting various scenes at just the right angles. With CMOS shift-type image stabilization and DUAL IS for high-sensitivity shooting, camera shake is effectively reduced during telephoto shooting.Simply pressing the button on the back of the camera allows high magnification, Full High-definition movie shooting, and Magic Filter also adds to the enjoyment of shooting movies on a digital camera.Main Features -- Details26x Optical Ultra-Zoom LensThe compact body of this camera is crammed with the power of a high-performance SLR 600 mm telephoto lens. The high-powered zoom on the SP-720UZ captures far away subjects dynamically, showing the details of their expressions.Full High-Definition MoviesWith a 1920 x 1080 High-definition size, and H.264 movie compression, beautiful movies can be shot even longer. With a dedicated movie button, starting and stopping movies is easy with a single touch. Linear PCM method is used for clear audio quality when recording.DUAL IS Image StabilizationDUAL IS is an image stabilization system that counteracts the direction of camera shake by moving the CMOS sensor via a shift-type image stabilization mechanism, and uses digital SLR algorithms. By using this function in combination with high-sensitivity shooting, camera shake and subject blur is effectively reduced, providing double image stabilization.Magic FilterDramatic and Random Tile have been added to the popular Magic Filter mode. In addition to previous options, the two new filters make a total of 12 different options to choose from: Pop, Pinhole, Fisheye, Sketch, Wedding, Rock, Watercolor, Crystal, Miniature, and Mirror. Pop, Pinhole, Sketch, Fisheye, Wedding, Rock, Watercolor, Miniature, and Mirror can also be used when shooting movies.Beauty Mode*6 Makeup FunctionThe Makeup function has been added to Beauty mode, allowing users to apply full makeup to people's faces in images after shooting. This function offers a full range of 17 different effects that will make women happy. Because effects are divided into four different themes such as Makeup, Eye Effects, Performance, and Spa, they are easy to choose from.The Makeup menu screen is packed with cosmetic choices such as Cheeks, Eye Shadow, and False Eyelashes, so that users can easily choose and apply effects. In the Eye Effect menu, users can not only change eye color, but make eyes appear bigger. In the Spa menu, users can make subjects faces appear smaller, and add effects such as Lift-up to make faces look even more beautiful.High-Speed Continuous ShootingThis camera is able to shoot 5 fps at 14 megapixels. In high-speed continuous mode, the camera can shoot at a maximum speed of up to 30 fps. Continuous shooting function: 2 fps (14M), 5 fps (14M), 10 fps (5M), 30 fps (5M)3D Photo*7 Shooting FunctionThis function enables capturing everything from everyday scenes to dynamic scenery in 3D.3D Photo brings a fully three-dimensional feel to photos so that it feels like looking at actual scenery. For even more intense enjoyment, users can view the images on a 3D compatible TV or computer.By simply selecting 3D Photo from the shooting mode, pressing the shutter button and sliding the camera horizontally, a 3D photo is created. Both the 3D data (MPO format) and the JPEG data are saved. 3D Photo can be used in Auto (after the first shot is complete, the second shot will automatically be taken once the camera is moved to match the target) and Manual (after the first shot is complete, the user takes the second shot after matching the semi-transparent layers). To play back, users simply select 3D Photo or regular photo, and then images can be viewed on a 3D compatible TV or computer.MPO Files (Multi Picture Format)This is a file format that conforms to CIPA standards for treating multiple images as a single image file. With 3D Photo, the two images with a disparity between the left and right eyes are merged into a single image and recorded as a Multi Picture Format file.Pet Mode (Scene Mode)*8Dogs and cats are automatically detected. By selecting Pet-cat or Pet-dog modes, the camera will automatically detect cats or dogs and focus on their faces. Up to ten dog or cat faces can be detected.Auto ShutterCapture pets' cute expressions. With Auto Shutter, the camera will automatically shoot when a pet faces the camera head-on. With this function, users won't miss the whimsical antics of their pets. (Auto Shutter can detect only one pet.)Eye-Fi Support*9Eye-Fi cards are SDHC memory cards that contain an internal wireless LAN. Images can be wirelessly uploaded to picture services, online photo albums, and computers.SNS Upload FunctionThis function allows images to be easily uploaded to services such as Facebook and Flickr.After shooting, images users want to share can be added to a list, and then transferred to a computer. Images added to a list on a computer can be searched with a single touch and easily uploaded. (It is necessary to preinstall the included software, OLYMPUS Viewer2, on a computer.)", "Date": "March 24, 2014"}, {"Title": "Camera", "Author": "duane gruber", "ReviewID": "R22OBQW3VNDTCV", "Overall": "5.0", "Content": "This camera is great for the price. I have taken a lot of pictures with it and they are all crisp and clear.", "Date": "October 12, 2013"}, {"Title": "Great little camera!", "Author": "jhagen", "ReviewID": "R2K7NDW0JFN0W1", "Overall": "4.0", "Content": "We ended up returning this because we were gifted with a much nicer, fancier camera. If we hadn't received the nicer gift, we would have been just fine with this camera. It's a great value!", "Date": "June 4, 2014"}, {"Title": "Completely satisfied", "Author": "Carrie Martin", "ReviewID": "R2B39YAT1HDZ94", "Overall": "5.0", "Content": "We just took a vacation and this camera met all expectations and took exceptional pictures. We have a lot of clear memories because of the quality it provided. There are still a lot of extras that we haven't figured out how to use yet, so I'm certain we will love it even more.", "Date": "June 2, 2014"}, {"Title": "This camera is  great camera'", "Author": "wilbert germany", "ReviewID": "RYEWJVZ0OOWHD", "Overall": "5.0", "Content": "this camera is easy to carry.It's easy to use and the photos are great.I have already taken lots of photos.I want be leaving it behind when I take vacation.", "Date": "June 2, 2014"}, {"Title": "Good camera", "Author": "Sandra Kazubowski", "ReviewID": "R44CZJABU8ZAA", "Overall": "3.0", "Content": "I have found this camera to be very good.  I do have problems sometimes getting it into the right setting as it doesn't always do what I expect it to do.", "Date": "May 27, 2014"}, {"Title": "Love this thing", "Author": "Benjamin C. Pottle", "ReviewID": "RQJIRTY67KOZI", "Overall": "5.0", "Content": "My favorite camera I've ever bought at this price. The chassis is gorgeous and the shutter speed is formidable. No complaints.", "Date": "April 29, 2014"}, {"Title": "Great camera for the kids!", "Author": "John Cawley \"Get Animated!\"", "ReviewID": "RWU9SM9UHZ49Y", "Overall": "5.0", "Content": "Love this camera.  Takes great shots of all our kids (four legged and feathered).  But would be better with a \"close-up\" feature.", "Date": "April 26, 2014"}, {"Title": "Love it.", "Author": "Dottie", "ReviewID": "R3AJD0CLQ9LTNL", "Overall": "5.0", "Content": "Took this on vacation to Europe and got great pictures.  It also fit 12 of is in the picture like a breeze.  No problem.", "Date": "April 26, 2014"}, {"Title": "Nice pictures outside but not great in low light or back light situations", "Author": "SALNJ", "ReviewID": "R3OIMSUEBY0S1I", "Overall": "3.0", "Content": "I've had this camera for awhile now and while I keep trying to tinker with different settings and use all of the features it has, I just can't seem to take decent pictures indoors or with any imperfect lighting.  It's great in the sun, snow, and outdoors.  The zoom is awesome and it takes great video as well.  However, the flip up flash rarely goes off in the auto mode.  Putting the camera in the P mode seems to get the flash to operate when needed but then I get too bright pictures.  In the scene mode, many of the features that used to work great on my old Samsung camera just don't get the results I want. Today I was using the backlight feature taking pictures of my daughter and her cousins and everything was still dark. Even the video I took of them with backlight was so dark you couldn't see them.  Battery life is terrible too.  Full charge before I left today and I took maybe 5 minutes of video in total plus about 20 pictures and it was already giving me the low battery warning in my last few shots.  This camera had a lot of great reviews when I made the decision to purchase it but unless I'm doing something horribly wrong, this camera just isn't what I had hoped it would be.", "Date": "April 20, 2014"}, {"Title": "good", "Author": "erik", "ReviewID": "RKXNAKT1PG80X", "Overall": "5.0", "Content": "nice resolution.very neat pictures.it's just great. ilove it. i recieved it in good conditions snd on time thanks for being responsable", "Date": "March 13, 2014"}, {"Title": "camera review", "Author": "Patti Bainsky", "ReviewID": "RCMUJY2RZSS91", "Overall": "4.0", "Content": "the camera has inconsistant picture clarityi  When using the flash the pictures seem much clearer. overall a fairly good camera", "Date": "December 30, 2013"}, {"Title": "Pleased", "Author": "Chris W. Johnson", "ReviewID": "R24DYDMKNBPSZG", "Overall": "5.0", "Content": "For the money I am very very pleased with the quality and functionality of the camera.  I know it is a previous generation camera, but the newer generation uses batteries and that is a non-starter.", "Date": "December 21, 2013"}, {"Title": "Difficult to focus", "Author": "Angelica J. Huizar", "ReviewID": "R25OH20AG5T0QW", "Overall": "5.0", "Content": "I had the camera for about three weeks and I could not figure out how to get it to focus on the subject I wanted.  It seemed to have a mind of its own even on the \"auto\" feature.  If I had an action shot of moving subjects--with kids that's always--the camera never got the shot in focus.  I just didn't figure it out.  It went back.", "Date": "January 7, 2014"}, {"Title": "so small", "Author": "Amazon Customer", "ReviewID": "R2FG2ZHYNM0ET6", "Overall": "1.0", "Content": "to small for hand. bought for a friend but had to return as it is to difficult to hold and shoot if you have hand of any size.", "Date": "March 3, 2014"}, {"Title": "Nice", "Author": "Abingdon Auctions \"Robert Zeiler\"", "ReviewID": "RB3ES45QE7DB1", "Overall": "4.0", "Content": "This camera was a very nice buy. It takes very nice pictures. I am so very glad that I purchased.", "Date": "August 16, 2013"}, {"Title": "Broken camera", "Author": "Joshua Hibbard", "ReviewID": "RVG21Q13PQGQP", "Overall": "1.0", "Content": "To my understanding this is a pretty good camera , unfortunately I would not know even though i just received mine because it is broken. In just about any other situation you would have seller contact information with useful ways to resolve any problems you have. Unfortunately , you get a useless email that in my experience still to this day gets you no were. It has been over a week and as far as I have gotten is what my order number was and yet still awaiting a reply on that. This company has 0 sense of urgency on fixing there mistakes and I am questioning if they are going to even do anything about it. In the end it looks like i got a busted camera and they got a quick $180. Do I recommend this camera ? Judging by its reviews , sample images , price and ability , yes i do but , I recommend you buy it elsewhere. You can get the same camera for the same price right off Olympus web site. At least this way if you run into the same problems I have , you have a better shot of getting it taken care of.", "Date": "October 27, 2013"}, {"Title": "LINE", "Author": "junior.bryce", "ReviewID": "R2N9UYTFUOQXZU", "Overall": "1.0", "Content": ", THERE ARE SOME LINES ACROSS THE 3-INCH LCD EVERY TIME I TURN IT ON THE LINES GET MORE AND MORE", "Date": "August 31, 2013"}], "ProductInfo": {"Price": "$199.99", "Features": "26X Long Zoom with Wide-Angle Lens\n14 Megapixel CMOS Sensor\nFull HD Video with HDMI", "Name": "Olympus SP-720UZ iHS Digital Camera with 26x Optical Zoom and 3-Inch LCD (Black)", "ImgURL": "http://ecx.images-amazon.com/images/I/41iEFBsea1L._SX300_.jpg", "ProductID": "B00AQ2BUWE"}}