{"Reviews": [{"Title": "We are very happy with this camera", "Author": "Contrarian", "ReviewID": "R1W1V96CF8MGWT", "Overall": "5.0", "Content": "I just bought this for my wife. It is a very nice compact camera. I read the reviews carefully for a number of compact models on Amazon, Cnet and elsewhere. Panasonic seemed the best in this category so I went with the recent model. We are very happy we did. We are happy with Canon for larger, more serious cameras but for compacts Panasonic seems best. This is certainly better than the Canon it replaced.The response time to click and shoot is very short compared to other compact cameras we have had. The picture quality seems excellent in \"Intelligent Auto\". It is flexible if you want to customize your shots with several built-in photo types and also freedom to adjust yourself. The 10X optical zoom is very good, too. [Note: goes to 20X with \"digital zoom\". Pictures look fine but I think it is more meaningful to compare the optical zoom. 10X is very good for a camera this small.]The only thing that we have any trouble with is the \"panoramic\" feature that stitches several pictures into one wide one. It is not a feature very important to us the but the couple of times I have tried it I had trouble getting it to work. It said they camera was not moved horizontally enough to work.Other than that, it is very easy to use. The buttons are well-located and the menus are clear and easy to navigate. Overall, we are very happy with this camera.", "Date": "June 11, 2013"}, {"Title": "Simple to use, takes \"OK\" photos - Panasonic SZ3", "Author": "Yarii", "ReviewID": "R3E68FLRAMAW93", "Overall": "4.0", "Content": "Although I love the styling of the new XS1 Panasonic camera Panasonic Lumix XS1 16.1 MP Compact Digital Camera with 8x Intelligent Zoom (White) and came close to ordering that model, I chose the SZ3 instead. The reason I chose this camera instead? The XS1 uses a micro-SD card, those little tiny cards smaller than a fingernail that are normally used in cell phones (and some Samsung cameras!). Since I like to remove my SDHC card to get my photos off via a card reader, I chose the SZ3 instead since it uses the normal SDHC card. I recommend getting a Class 10 card for this if you plan on shooting videos.Even though this has a CCD sensor instead of the newer CMOS sensor found on more & more cameras nowadays, I can't see much difference in speed. It is quick to turn on and be ready for a photo, quick to recycle after taking a photo, burst speed is fast enough to keep me happy.Photos are true to color, although similar to other Panasonic cameras, a little \"soft\". This can be remedied by keeping your setting on Vivid (normal setting) to increase sharpness. This has a Leica lens, known for being one of the best lenses available.Plenty of scene settings, even for pets. Most of the time though, I can get a better pet photo with the setting iA (Intelligent Auto mode).A *major* disappointment is the lack of the Quick Access Menu button as other Panasonic cameras have. It also falls a little short on macro shots. I get better close-ups with some of my other cameras; at the same time, those cameras cost more.Low light: No matter what the camera manufacturers say, not only Panasonic, but the others, you can't expect a camera in this price range to be good in low light. It's just not gonna happen. Now if you're in a dimly-lit restaurant and use a night scene setting with the flash, yes, you'll get a decent photo, but if you expect anything more, you'll be disappointed. In that case you need a camera 4 to 5 times the price of this one such as the Sony RX100.I love the Creative Control options with this camera, this seems to have more options than some of the other camera models. My friends and I are having a blast with the \"Beauty Retouch\" function! You can retouch a photo to give yourself a more glamorous look, even a smokey eye!Battery life is decent, I can get around 200 photos and a couple videos before the battery needs recharged. As far as recharging, the battery is charged INSIDE the camera like a lot of others these days. You can charge it by your PC or by plugging the cord into a receptacle.Build quality: It's plastic, but seems to be durable for a cheap camera. No matter how much one spends on a camera, the battery doors are always flimsy, so just take extra care when opening it. This camera is on the smaller side, but not \"too small\" and the controls/menus are easy to access even with chubby fingers. The LCD screen is a tad smaller than most, but seems to not have as much glare in the sun. One downside is this camera is made in China, while most of my other Panasonic cameras were made in Japan, even those that were similar in price.As far as video, some may think it's a \"con\" that this only records 720p, not 1080p. Frankly, I can't tell much difference between the two when I view them on my computer on YouTube, however, you may see a small difference if you watch the video on a TV. My computer is 5 years old and doesn't handle 1080p very well, it's a little quirky.I recommend this camera, even though it's a basic point & shoot with very little manual control. Sometimes I favor ease-of-use and the ability to easily carry a camera rather than carry around a heavy one. This camera fits inside my smallest purses. It's simple to use, takes good photos and it's a good price. I bought it in white (I have a thing for white cameras!) the back is charcoal gray though. It's stunning and you'd think white would show dirt more than the other colors, that doesn't seem to be the case here.", "Date": "June 5, 2013"}, {"Title": "Great small camera and sharp lens at a very reasonable price!", "Author": "Amazonian Consumer", "ReviewID": "R3MNTT7VHXMY43", "Overall": "5.0", "Content": "Currently, the Lumix SZ3 is the lowest priced Panasonic Point-and-Shoot digital camera that comes with a Leica-licensed lens. And the DSC-W730 is the lowest priced Sony that comes with a Carl Zeiss-licensed lens. Leica and Carl Zeiss are legendary German photographic lens designers who are known for their super sharp and accurate color lenses. Not all Sony and Panasonic cameras have Carl Zeiss and Leica marking on the lens, respectively. Those that do not cost less, but I always choose ones that do.I have both of the above cameras and like them very much because they take excellent, sharp, color accurate pictures without costing a lot of money. The Panasonic costs a bit more, but both are excellent.The Lumix SZ3 has a slightly greater zoom range of 10X, compared to Sony's 8X. Both cameras have the wide end of the zoom lens at 25mm (35mm film camera lens equivalent), which is great for group and scenery shots.I prefer the SZ3 camera's physical user interface, especially the direct \"movie button\" and the shutter button surrounded zoom lever. They are more convenient and easier to use than Sony's.The SZ3 shoots video in 720p at 24 frames per second (fps). Some users like this frame rate because the resulting video looks more film-like, or movie-like than when shot at 30 fps or higher.I buy extra compatible batteries on eBay. For the SZ3, you can typically get 2 new batteries, with free shipping, for about $13. Just search \"Panasonic SZ3 battery\".The black version of the SZ3 also comes equipped with a black-colored lens barrel - a rarity these days. IMHO, it makes the whole camera look better/more consistent.If you need a carrying pouch for this camera, I'd recommend Case Logic's DCB-302 (less than $6) Case Logic DCB-302 Compact  Case for Camera - Black. Its size is just right for the SZ3, with a few centimeters of extra space so it isn't too snug. The small accessories pocket is perfect for memory cards and batteries.Instead of using the pouch's shoulder strap, I urge you to tie the camera's wrist strap to one of the two shoulder strap ringlets, so that the camera and the case are loosely tied together. The arrangement permits me to hold the case with my left hand while I take pictures with my right hand. If someone bumps into me at this moment, my camera is less likely to fall to the ground, as its wrist strap is tied to the case held by my left hand.", "Date": "September 28, 2013"}, {"Title": "Great performer - lots of artistic options in camera", "Author": "shutterbug33", "ReviewID": "R2KHYQH662UOCB", "Overall": "5.0", "Content": "I have a DSLR.  I have 24x/48x zoom camera that I think is just the best thing out there, after buying and trying LOTs of cameras.  I am very particular and have been pretty elitist about the efficacy of small cameras vs my more professional ones.. BUT going on a trip, wanting to have everything I NEEDED in a waist pouch, I bought this LUMIX 10x optical, 20x digital LEICA lens (in white) camera.  I am from the \"old school\" and have more trouble holding a camera out to look at amonitor/screen but this camera really amazed me.  I love it for what I use it for.  Pictures are very sharp, as one would expect from the LEICA lens and you can choose a huge number of artistic options for your photo, in camera!  Love that too!  Great MP size, solid feel, not plastic feel. Got some incredible pictures.  So, long story short.. you CAN teach an old dog new tricks!", "Date": "August 4, 2013"}, {"Title": "Defective shutter scratches camera lens!", "Author": "AAyers", "ReviewID": "R146QOP3VYF5DE", "Overall": "2.0", "Content": "I've had the Lumix for a while and have been pleased with it until I recently noticed several fine vertical scratches on the lens (some are more like a dashed line ----). Each photograph, especially those where I've aimed into any kind of light source, have hazy white lines in the center of the photo. I couldn't figure out how I could have scratched the lens since the cover retracts automatically when it's not on. I am very careful with my camera and keep it in a lens case when being carried around. A little research turned this up: http://www.amazon.co.uk/Lens-scratches/forum/Fx39Y385WF8RDUQ/Tx1ZBKB3Z7Z73R8/1?_encoding=UTF8&asin;=B001T0H0RG. Apparently lots of other people have had this this issue. The scratches are due to a defect in the camera shutter which scratches the lens each time it closes. When I listen closely I can hear it making contact with the glass. I called Panasonic and spoke to Otis, a supervisor in their Camera Repair dept. and, as expected, he told me that I'd have to return it for repair at a cost of $128. He said \"defect or not, it's out of warranty\". And that's that. I will not be returning it for repair at that cost, of course. Nor will I ever buy another Panasonic product.", "Date": "October 14, 2013"}, {"Title": "A sweet little gem of a camera", "Author": "kittylover \"MCB\"", "ReviewID": "R16M1WI8JE23F4", "Overall": "5.0", "Content": "Oh wow was skeptical at first even though I have owned Lumix before, but I am so happy with this little guy. It takes amazingly fast beautiful shots. Just point and shoot and the download to my pc is so fast. I can't say enough good things about it. I  have been taking pictures since I was 10 years old. I am now 61 and I got to tell you that if you love just taking good quality pictures without the expense of a fancier camera then this is the camera to use. So glad I read the reviews and acted on them. Great camera for a really good price.  The best camera I have ever owned. I take it with me wherever I go. So small it fits perfectly in a shirt pocket or purse. If it ever goes belly-up I would replace it in a heartbeat. Thanks amazon for offering it at an affordable price.", "Date": "July 21, 2013"}, {"Title": "Good camera for the price", "Author": "Joan", "ReviewID": "R2YXD0YRJ3VSFG", "Overall": "4.0", "Content": "This is a very nice point & click camera.  I've taken many pictures since receiving it and have found it both easy to use, and reasonably good in picture quality.  It does not come with a case, which probably helps to keep the price down, but that's something that I plan to purchase so I can be a little more care-free while taking it everywhere.  My only complaint -- and this is pretty big to me -- is that it does not come with an actual, hands-on manual.  Rather, everything is on the computer.  You download the manual and the PhotoFunStudio program.  I don't know about you, but if I find myself in the middle of Bryce Canyon, or some place equally stunning, and have to try to figure out how to use a feature of my camera, that's going to be pretty darned inconvenient.  Not too many computers out there. . .", "Date": "June 13, 2013"}, {"Title": "Remarkable Camera  especially at this price!", "Author": "G P Padillo \"paolo\"", "ReviewID": "R2M1U9AZOI7WSE", "Overall": "5.0", "Content": "First off, the thing weighs in not much more than a couple of credit cards but what they've packed into this little dynamo is simply terrific.  Great quality digital photographs, easy to use . . . save for some small necessarily small buttons (like the on/off switch).  The zoom feature is (particularly for the money) terrific.  You can fit this puppy in a pocket and hardly be aware it's there . . . even a shirt pocket!  My Canon Powershot which gave up the ghost this past year had many more features, but not nearly the picture quality in \"zoom\" (or the power of the Lumix' zoom) . . . but it cost 3 times as much.  Nice camera for every day use.  Highly recommended.", "Date": "August 3, 2013"}, {"Title": "Best of 3--Love this camera!", "Author": "J&KN; in NC \"kathyn\"", "ReviewID": "R1WH2LNJVMWYZV", "Overall": "5.0", "Content": "Had ordered and returned two other cameras (Canon and Nikon) and thought I'd never be able to find a good \"point and shoot\" camera.  The \"auto\" setting on these cameras just seemed to blur pictures and they took too long to take a picture and also to be ready to take another one.  But not so with this camera.  Yes, it's still too smart for me (my son had to explain how the panoramic feature works) and I printed and read the whole 128-page manual.  The manual wasn't nearly as useful as my son!  But every picture had terrific clarity and color.  I think the case is plastic, so I bought a small camera bag and recommend having one.The only (somewhat) disappointment was that I have a Mac computer and none of the included software would work on it.  But I have iPhoto on my Mac, so didn't really have to have more software.  I don't like iPhoto much and mainly use PhotoShop Elements.  I really didn't need to do much of anything to my photos, except to occasionally crop one.Turned out third time was the charm.  I love this camera.", "Date": "September 5, 2013"}, {"Title": "Great Camera", "Author": "Darrell Freshour", "ReviewID": "R1RA3GL2AOLWKK", "Overall": "5.0", "Content": "Good light sensing flashFast picture deleteGreat zoomEasy to useGood pictures too !Good all around camera", "Date": "July 27, 2013"}, {"Title": "Read the Reviews and BELIEVE Every Word You Read!", "Author": "Donna L. Boston", "ReviewID": "R1KQN5JTIX2LD2", "Overall": "5.0", "Content": "Needed something to \"throw\" in the purse, point and shoot and download to my computer.  Fell for this because of the many positive reviews as well as other info on line regarding this particular Panasonic Lumix and because of the Leica lens which is one of two manufactures of lenses with a genuine superb reputation and I own an old, old Leica and in its day it was the greatest thing since sliced bread.  This little goodie has a lot of features and I use every one of them.I don't think you'll be disappointed.", "Date": "January 7, 2014"}, {"Title": "No macro but decent camera", "Author": "Matthew Crowell", "ReviewID": "R1MJHTSOJS7LMW", "Overall": "4.0", "Content": "I also shoot a Nikon DSLR but I always keep this little camera handy. It's size and quality make it great. I call it my \"cheater\" because most people can't tell the difference between photos taken with this camera or my DSLR. My only complaint is that it doesn't have obvious access to a macro mode.  A little exploration revealed that the \"food\" setting works the same as macro mode on most cameras.", "Date": "May 1, 2014"}, {"Title": "Compact and easy", "Author": "Jenni26", "ReviewID": "RNLLZHWEUQYDT", "Overall": "4.0", "Content": "I love this little camera. It's the second one I've bought, since little did I know, you should not take pictures at a concert with lasers!", "Date": "January 23, 2014"}, {"Title": "nice camera", "Author": "Brenda W.", "ReviewID": "R1UOHIIP829DMX", "Overall": "5.0", "Content": "This is a nice little camera.  It's compact without being too small to hold.  It's easy to use, takes good photos and video, and the sound quality of the audio is excellent.", "Date": "September 25, 2013"}, {"Title": "Good so far, but WHAT THE HECK?", "Author": "angie", "ReviewID": "RC809RTUR3TO6", "Overall": "4.0", "Content": "Okay, I'm fairly certain I was sent a used or returned camera.  As I opened the box, I could tell it had been opened before.  Then the bubble wrap pack holding the camera was unsealed AND there were fingerprints on the LCD display of the camera.  Geez.  Really?  You're sending me USED stuff now for NEW prices?  (I'll be filing a complaint in addition to this review).That being said, the camera appears to be fine, works just fine and all that.  I'll play with the settings, etc. if I decide to keep it based on the fact that is USED.  Wow.  Just wow, Amazon.  This makes me sad.", "Date": "May 29, 2014"}, {"Title": "Excellent camera", "Author": "Wilson F. Raposo Prata", "ReviewID": "RH71172QB366O", "Overall": "5.0", "Content": "This is a excellent camera for its price. Very fast taking pictures with excellent quality even in night time. Highly recommend it", "Date": "May 6, 2014"}, {"Title": "Why did they change battery format?", "Author": "T. Dettloff \"noble thomas\"", "ReviewID": "R1DFFB95Y2OFFY", "Overall": "4.0", "Content": "I lost a Lumix overboard while kayaking.  Bought this as a replacement.  Very happy with it but discovered the battery is not the same as my previous Lumix so I am not able to swap batteries.  Why did they do that!?", "Date": "April 26, 2014"}, {"Title": "Panasonic does it again!", "Author": "E. Swope", "ReviewID": "R1TD2YYGZ4IYZK", "Overall": "5.0", "Content": "I have been a huge fan of Panasonic cameras since I bought their original travel zoom, the tz1 Panasonic Lumix DMC-TZ1S 5MP Compact Digital Camera with 10x Optical Image Stabilized Zoom (Silver)when it was released circa 10 years ago.  At the time I was a little skeptical of a camera made by an electronics manufacturer, but from the beginning Panasonic has partnered with Leica (which is why I bought the first one, and this one, my 4th.  Honestly, this was not necessary. There are... quite a few cameras in the house. including some very good ones (one of the FZ bridge cameras, an Olympus Pen and 4 more Panasonics and then some).so why did I buy this?  They say it is the camera you have on hand, and because of it's size, the Panasonic FP3 Panasonic Lumix DMC-FP3 14.1 MP Digital Camera with 4x Optical Image Stabilized Zoom and 3.0-Inch Touch-Screen LCD (Red) is usually that camera.  It is a great little camera. I lOVE the touch screen! but it only has a 4x zoom and no wide angle.  I am writing this review primarily because of how impressed I am be the difference the lens has made (the FP3 is the only  one of my Panasonics which has a lumix lens).  The price Amazon is selling this for is astonishing! The lens alone could easily cost that much! so now  I have another amazing pocket size camera. I think my FP3 is going to get jealous, because the image quality on this one is so nice, it will be the one in my purse. or pocket.  I have only played with it  day or 2 but am just floored by the image quality, color rendition.It is a very simple camera, point and shoot. You will not get all the manual features you get on micro 2/3rds e.g. but it is simple and intuitive, shoots high quality video and stills, has noise and shake reduction. It is an almost fool-proof camera with an amazing lens, at an amazing price point.The build quality is not quite up to the other Pansonics. it has a fiddley door (similar to those on cell phones) covering the usb port. But really, a camera is a lens in a box. Never has that been clearer than when holding this camera.  he lens is amazing, and the rest of it is also pretty good.  I sincerely doubt it is possible to get a better camera for under $100 and if there is one, I would like to see it ;)I will have to edit to add a link, but I want to point out that Amazon has some wonderful leather cases in overstock at an even more amazing price which fit this camera perfectly!! (The Olympus slim leather case) Olympus Slim Leather Case for Compact Digital Cameras (Red) guaranteed to be the nicest case you will find for under $5, and even quite a bit more ;) .", "Date": "March 16, 2014"}, {"Title": "Looks nice out of the box but mediocre results", "Author": "G. L. Munn", "ReviewID": "R117YH8B51VT77", "Overall": "2.0", "Content": "I have been very pleased with other two Lumix purchases but this camera was a disappointment. The iPhone 5 camera takes far better pictures than this. The lack of a macro mode means that close-up shots will be impossible. My wife was dissatisfied with this gift.", "Date": "February 15, 2014"}, {"Title": "This is a little gem of a camera.", "Author": "Deborah Stone \"mokkijo\"", "ReviewID": "R1UH205R4O3CPM", "Overall": "5.0", "Content": "I ordered this camera when my Canon Powershot Elph broke after 6 years of use. I hadn't really kept up on digital cameras, so I did alot of research before I purchased this. I travel a fair amount & really wanted a \" point and shoot\"that delivered. I took 125 photos on my last trip, and I have some stunning shots.I especially like the ability to \"photoshop\" the pictures right after I take them inside the camera! I also like the battery life. It's a snap to use and I highly recommend this very well priced camera.", "Date": "January 25, 2014"}, {"Title": "Excellent straignt forward video and still camera.", "Author": "Chris", "ReviewID": "R2U6W90EHDQJS8", "Overall": "4.0", "Content": "Given as a gift to an 85 year old who wanted a digital camera. It took very little time for her to be taking still and video pictures of her grandchildren and while it took a bit longer to explain how to download the pictures to a PC and then load the still photos intoa digital photo frame after a demonstration she was up and running. So a simple to use camera with decent introductory documentation. The description of how to get pictures to a PC and the software (that is actually an unnecessary alternate download option !) could be better.", "Date": "January 10, 2014"}, {"Title": "Great Simple Camera", "Author": "K9Mom \"Love To Read\"", "ReviewID": "R1EMG6O413Y610", "Overall": "5.0", "Content": "I've had Lumix cameras for years now - just the simple point and shoot.  I ordered this one thinking it would be the same as the Lumix cameras I've used in the past but lots of things have changed and there are many upgrades.  It's lighter too.  Just a simple, easy camera that takes clear pictures and is great for a novice or someone who doesn't want to spend a lot of money on a camera.", "Date": "January 4, 2014"}, {"Title": "Simple Camera", "Author": "LPD", "ReviewID": "RLXXSOCNVXZV", "Overall": "4.0", "Content": "This camera works great for its limited uses, but it is a very simple camera. It does not have a macro setting, but can take decent close up macro pics in the Intelligent Auto setting. Though other uses of the IA come out very blurry. There are not very many settings. I got this camera to supplement my ipod camera that doesn't take very good pictures, especially inside. I wish I would have gone for the mid grade as opposed to the low end of the Lumix line.", "Date": "November 26, 2013"}, {"Title": "Great gift for grandma.", "Author": "Lola", "ReviewID": "RSED5Z02U63PY", "Overall": "4.0", "Content": "This was a gift for my mom. She had an older Fujifilm camera that was actually too difficult to use for a non-techie person like her. So, we banded together and bought her this camera for her birthday. She LOVES it. That's all that matters!!", "Date": "November 23, 2013"}, {"Title": "panasonic lumix dmc=sz3", "Author": "sully", "ReviewID": "R31CE5KVVOFGEM", "Overall": "4.0", "Content": "Nice little camera to have in your pocket or purse.  Takes nice pics and has some good scene selections.  I was trying to replace my last lumix that was small also but could not find the exact one.  This was a good camera for the price. It is very small and that was what I wanted.", "Date": "October 15, 2013"}, {"Title": "For the price it is a great little camera", "Author": "shelley stallings \"Tongass Timber Framer\"", "ReviewID": "R1J36T2OAAMABG", "Overall": "4.0", "Content": "For the price it is a great little camera.  My only concern so far is the very fragile looking door for the SD card access.  I doubt it will last very long, but I am hoping I am wrong.", "Date": "October 13, 2013"}, {"Title": "a great little camera", "Author": "Nikki Schrager", "ReviewID": "R2VL0YEYKH3ZPM", "Overall": "5.0", "Content": "This Lumix is terrific.  Lightweight but precise.  I can carry it around in my pocket.  The Leica lens is magnificent.", "Date": "September 13, 2013"}, {"Title": "excellent products,  easy to use , high quality pictures", "Author": "emrl", "ReviewID": "R3LL1T3BCOT9RK", "Overall": "5.0", "Content": "Easy to use, holds xc cards and came with and useful program, best product for the money. Nice and clear pictures!", "Date": "September 9, 2013"}, {"Title": "Super Little Camera", "Author": "William J. Wright \"W J Wright\"", "ReviewID": "R2PR3DQIAW9KVU", "Overall": "5.0", "Content": "Bought this camera--Panasonic Lumix DMC-SZ--3to take on vacation, part of which was riding our motorcycle on the Tail of the Dragon and the Cherohala Skyway.  The ride was spectacular, made all the more fun because I was able to take some really great shots (while riding on the back) with little to no blurring.  Small and easy to carry.  Battery life was great.  Did a great job of recoding our memories.  So glad I bought this camera!  Panasonic Lumix DMC-SZ3 16.1 MP Compact Digital Camera  with 20x Intelligent Zoom (Black)", "Date": "September 9, 2013"}, {"Title": "Lightweight and Great Optics", "Author": "ursafilms", "ReviewID": "R2Z1C3KS86KH9Y", "Overall": "5.0", "Content": "For the profile alone I would have bought it, but the lens is exceptional.  It fits VERY nicely into a cellphone case.", "Date": "August 31, 2013"}, {"Title": "camera", "Author": "Carole \"sound lover\"", "ReviewID": "R1I5C6YWD3E3I8", "Overall": "5.0", "Content": "the color is great. The pictures come out crystal clear. I love the pics. They are positively the best for this size camera.", "Date": "August 25, 2013"}, {"Title": "Excellent Panasonic Lumix Camera!", "Author": "Mario Alberto Alfaro Porras", "ReviewID": "R1E3ZJUE2E2X6L", "Overall": "5.0", "Content": "Well, I purchased this item on July 1st and I got it on July 5th.  I used it for my trip to St. Ignace, MI and it was very useful and perfect for my pictures.  I did not have any problem with this camera.  The only thing is that I had to purchase a memory card to save all my pictures.  I recommend you to buy this camera if you want something great .  Mario Alfaro", "Date": "August 6, 2013"}, {"Title": "I really wanted to like this camera", "Author": "iguanamom", "ReviewID": "R3BKREJWJ2MPMU", "Overall": "2.0", "Content": "I had to switch from a really nice Canon (not a point and shoot) to a compact camera due to extensive traveling.  I didn't want to spend more than $200 on one and I wanted one with a fairly good zoom.  Everything I researched kept bringing me back to this camera.  At the time there were only about 10 ratings on it but they were mostly positive.  Here's what I've found with it and I've had it for almost 7 months now:Good:-It takes nice sharp landscape pics without zoom just fine-It has a wide angle, unlike most cameras of this size (which can be good and bad)-The panoramic is awesome and does a very good job of stitching-Battery life is ok, not fantastic-It is small and easy to carry-It's been reliable, had no issues with it except recently with a spot on the lens which I just tried cleaning last night and haven't tested today-Easy to navigate the menus-Has enough creative controls to keep you happy-Video quality is ok but if you walk around with it, it will be shaky and zooming takes a long time.Bad:-The zoom is horrible.  At full zoom the pictures are completely grainy.-Image stabilization?  None here.-You can't zoom in on anything that's close to you without it being blurry.  You have to get the camera right up next to the thing you want to photograph and even then, it's not guaranteed it will be out of focus.-It's hard to tell on the preview if your photo is blurry or not without zooming in on it.-The microphone is in a horrible place for shooting video.  It's right where you hold the camera so I often find I can't hear anything because my finger was covering it.-I have to take the videos into Free All Converter before posting it on YouTube due to the incompatibility...that's horrible.-Night time pictures simply don't come out...they are completely dark and grainy if not using the flash.  Even under typical to dim lighting conditions inside.-If you want to do a long time exposure you only have 3 choices for the time...better have a tripod.I really would love to get a different camera.  I just think that $200 should buy you more than this.  It's caused me to not even want to take pictures anymore unless it's something fabulous which is a real bummer.  It seems like no matter how long you wait, a good camera never gets any cheaper.  This is more like a $100 camera to me, which is why I spent the extra $100 thinking it would NOT be that.  Live and learn!", "Date": "December 30, 2013"}, {"Title": "Lumix sz3 impressive little camera", "Author": "Ronald D. Harry", "ReviewID": "R3RCOU1H6CMFN2", "Overall": "5.0", "Content": "Things that impresses me most:1. Crisp, sharp photos (and videos) with no blurr2. ease of use; very intuitive with a lot of features3. The zoom is excellent4. panarama mode is highly improvedI owned a coolpix compact for years, and the battery latch broke so went to replace; but from readings and hands on investigation, decided on the Lumix sz3.  The Lumix is a much better product [remember comparing older tech however; the Coolpix was only 6 megapixels], as the coolpix was a solid no frills 'auto' device, but this Lumix is a sophisticated machine offering both simplicity and functionality...and some override for manual control for real photo buffs.  And the ZOOM is superlative.  The zoom reminds me of my old 35 mm SLR film system telephoto lens etc.  Amazing now we have this at the touch of our fingertips on small pocket sized cameras like this Lumix.  The coolpix I thought was nearly indestructible until that latch broke but only after years of use and abuse.  We'll see if that Lumix holds up as well, or better.  For now, I feel really good about this purchase and really like this camera [the Lumix].", "Date": "July 6, 2013"}, {"Title": "DO NOT BUY PANASONIC!", "Author": "suzannell", "ReviewID": "R2H5TYV2SO8H7R", "Overall": "1.0", "Content": "I ordered a camera from them and it quickly had a system error and would not function. They sent a refurbished one, same error, and a another refurb, same error. Basically just sent junk refurbished items until it was out of warranty. Happened again when it was out of warranty by a couple of weeks and then said too bad despite the fact we'd only had the replacement for about two months. Horrible product, even worse customer service!", "Date": "December 11, 2013"}, {"Title": "Not impressed", "Author": "OutOfTexas", "ReviewID": "R98CJYMJKKL8F", "Overall": "2.0", "Content": "The photo quality is not good, and the camera is very basic. It almost seems old-school. I wouldn't recommend it.", "Date": "January 2, 2014"}, {"Title": "An absolute best value.", "Author": "Kerry M", "ReviewID": "R3J3NPOM0J3PAE", "Overall": "5.0", "Content": "Feature packed, great picture quality, easy to use menu, very compact, great zoom range, long battery life, and very low cost.  I have donated my older compact digital to a friend (it cost more but does less).", "Date": "November 4, 2013"}, {"Title": "Easy to carry with you.", "Author": "Lsd", "ReviewID": "RB4F6LQ0DJN89", "Overall": "4.0", "Content": "I would have given this a 5 star, but i think the shell of the camera is a little cheaply made.  Has great setting for taking a wide variety of pictures.  As well as edit them when you are done.  The zoom could be a little better.  My daughter took it to England with her.  Hence the easy to carry and light weight.", "Date": "September 21, 2013"}, {"Title": "Great camera!", "Author": "Susan Ulrich", "ReviewID": "R18QPG33M5B8GJ", "Overall": "5.0", "Content": "Very easy to use. Fits in my purse. Nice and light. Easy to zoom. Takes great photos and pictures download easily onto my computer.", "Date": "July 29, 2013"}, {"Title": "Great Little Field Camera", "Author": "Stephen G. Townsend \"tactown\"", "ReviewID": "R1QMZPQX5M7YOA", "Overall": "5.0", "Content": "This is my third Panasonic Lumix. The other two are still in use. I bought this one because it has even greater zoom capacity, and produces very sharp images with the Leica lens. I use these cameras to do field work, and often have to shoot from some distance. They are capable of retaining a high degree of detail. I would warn that the lens protection does have a tendency to get dust in it. This can lead to jamming, with e zoom becoming inoperable. So it is important to keep the camera in a case when it is not in use. I have shot thousands of frames on these cameras, and find they do stand up to repeated use. The durability, quality of picture, the compact size, and the cost make the Panasonic Lumix DMC-SZ3 a really great tool in the arsenal of folks doing field work. Because this camera does not have a view finder it can be a challenge under certain light conditions. But even shooting blind I am usually happy with the results.", "Date": "June 6, 2014"}, {"Title": "Disappointed.", "Author": "Patti Aaron", "ReviewID": "R25C33MAHJTSY9", "Overall": "2.0", "Content": "I had an older version of this camera and loved it. I lost it. This replacement does not take photos of the same quality and does not have the flower close up feature. I'm disappointed.", "Date": "June 5, 2014"}, {"Title": "excellent camera", "Author": "Shel", "ReviewID": "R1UJD6EAW13QRX", "Overall": "5.0", "Content": "although I bought this camera about a year and half ago, I am just learning more about about its capabilities.currently taking a photography class and finding out that this camera has all of the same functions as any high end camera without the bulk.I can carry it anywhere anytime and have it take great pictures.since it is a pocket camera the sensor is small and so everything stay in focus all the time.other than that draw back I haven't come across anything that will hamper my use or produce results lesser than anyone else's camera in my class.our teacher for the class is a ace photographer and been in the business for 40 plus, her highly recommends this camera.I have the 14.1 MP camera not the 16.1.Great zoom by the way, captures really good picture even from a distance.I like it very much too.", "Date": "May 29, 2014"}, {"Title": "Great Pics!", "Author": "Amazon Customer", "ReviewID": "R1CSJ6BXTK90CW", "Overall": "5.0", "Content": "Easy to use and great, clear pictures. Would recomend to friend. Also easy to hook up to computer for sharing.", "Date": "May 20, 2014"}, {"Title": "I love it", "Author": "lollygagger", "ReviewID": "R1IXMXV7J7CQJU", "Overall": "5.0", "Content": "Simple but good", "Date": "April 28, 2014"}, {"Title": "Just what I was looking for", "Author": "Bilbo", "ReviewID": "R1VIG7N31B5LH9", "Overall": "5.0", "Content": "Very happy with the size, weight, and zoom capabilities.  Not easy trying to figure out how to delete a picture from the camera.  I delete all when I download the pictures.  Deleting a picture from the camera I have succesfully done this twice, however, I have no idea how I got to that area when I finally arrive at it.  The booklet  does not tell you how - this is my only complaint.", "Date": "April 19, 2014"}, {"Title": "Low Quality", "Author": "S. M. Barnes", "ReviewID": "RS3230SXTO4OW", "Overall": "2.0", "Content": "Right out of the box, you can tell that the camera is not quality. It feels and looks cheap with a plastic, flimsy body. I started taking test photos around my living room and couldn't believe how awful the photos were. I ordered this so I can take better everyday, casual photos than my outdated phone, but my old cell takes better photos than this camera!I should have known the price was too good to be true and I will be returning this ASAP.", "Date": "April 18, 2014"}, {"Title": "nice camera", "Author": "barak shamur", "ReviewID": "R2PPF3K7EA6JG", "Overall": "4.0", "Content": "I can only say that  it fits its priceno real exelencies but its small and compact and functioning great", "Date": "April 17, 2014"}, {"Title": "LOVE THIS CAMERA!  Great point and shoot for the average person", "Author": "Shana Myers Herring", "ReviewID": "RUWEQDAU9RSEE", "Overall": "5.0", "Content": "It's EASY and takes GREAT pics--especially close-ups which my old digital camera could never do AND the charge lasts a really long time.  I'm very happy.", "Date": "April 10, 2014"}, {"Title": "Bought for grandmother", "Author": "Rama", "ReviewID": "R25IUIIEUQWEE3", "Overall": "5.0", "Content": "I bought this for my grandmother for Christmas, as she as trouble with...most electronics. She hasn't used it a ton, but she hasn't had any trouble getting used to it. Very simple design and use, easy to feel buttons.", "Date": "April 2, 2014"}, {"Title": "Love it", "Author": "Iveta", "ReviewID": "R3VPZBRAO1ZAIT", "Overall": "5.0", "Content": "+Panorama photosBattery stays for long timePocket size camera-Don't know anyI bought this camera because sometimes it's hard to carry with me my big dslr. So if I want to take some pics while skiing, jet ski or some other sports it is really good. It was cheap so also I don't have to be afraid of breaking it. Love how light it is. And battery stays for sooo long, even I tried it when was -7F, I was all day skiing and using it a lot and battery was still alive after that day.", "Date": "March 20, 2014"}, {"Title": "Panasonic Lumix DMC-SZ3", "Author": "Louise C. Lambert", "ReviewID": "R115T30VPYXOIF", "Overall": "4.0", "Content": "We are very happy with this camera.  It's small enough to fit in a pocket, the zoom is really nice, and the controls are easy to master.  The pictures are sharp, even when taken at full zoom.  Not as quick as others to take the picture.  I have an older model of the same camera; I wish they would have kept the same on/off switch instead of the button (same with \"review picture\" button).  LED screen is slightly smaller, but so is camera.  Very hard to see LED screen in sunlight, but so are most other small cameras.  I would recommend this camera.", "Date": "March 15, 2014"}, {"Title": "Excellent", "Author": "Victoria Pimentel Díaz", "ReviewID": "R190SQPD6I5FXV", "Overall": "4.0", "Content": "Excellent product filled the expectations, I will recommend to family and friends. Perfect and consistent packaging. May. Thank you. Sincerely. victory", "Date": "March 13, 2014"}, {"Title": "Great product", "Author": "Ronald F Koch", "ReviewID": "RGYT6G3MVCX97", "Overall": "5.0", "Content": "This is a great product, vary fast, long battery life and good pictures plus zoom for this camera is good for the price", "Date": "February 24, 2014"}, {"Title": "Great for the price !", "Author": "Chris", "ReviewID": "R2S4IY2PTFKGPU", "Overall": "5.0", "Content": "Wanted a camera small in size that takes a good picture of work I have done as well as to be kept in backpack while fishing & hunting . Perfect for this application. If I loose it not the end of the world as it was not a lot of money camera. Takes a decent picture.  I am a point & shoot type though this camera can be adjusted by someone with photo knowledge.", "Date": "February 23, 2014"}, {"Title": "Great Point and Shoot", "Author": "William R, Detmers", "ReviewID": "R2PYVZLAGUFHOK", "Overall": "5.0", "Content": "The Lieca Lens is wonderful. For a point and shoot pocket camera, this is a winner all the way. Easy to operate, sharp pictures, accurate color, etc.", "Date": "February 16, 2014"}, {"Title": "Simple, easy to use camera", "Author": "jeh437", "ReviewID": "R1MWW0QW89R3UQ", "Overall": "5.0", "Content": "We bought this camera for our mother for Christmas. So far, she loves the camera! It's very simple and easy to use, and doesn't include any complex features. I think it's a great camera for someone who isn't very tech savvy, as there are very few complicated features about this camera and it is very easy for anyone to learn how to use. I've personally owned a different model of the Lumix, and in general, I think these are very high quality cameras.", "Date": "February 15, 2014"}, {"Title": "Initially thought it was ok but on closer look, it was not as great as what I thought it was.", "Author": "Romeo P. Venes", "ReviewID": "R3LH2H9GJOENRS", "Overall": "2.0", "Content": "I bought this to replace a Lumix FS7 which I lost but which met all my expectation for point and shoot camera for the last 3 years. This replacement is much better than the old one I lost.I am updating my review of the SZ3 I got after 2 months of use. The former Lumix which I lost was found and I got to compare the picture quality of the 2 Lumix I have now; i.e., the FS7 with 10MP and the 16MP SZ3. In order to be fair in the comparison I set the two camera on the same resolution. When I set the two cameras at 5 MP resolution, the old FS7 would consistently take pictures that are a lot more clearer than the SZ3 with outdoors, indoors, with or without flash. I also noticed that the FS7 can take better shot in low light situations compared to the SZ3, though I wouldn't say that the FS7 is a good camera for low light situations at all but it still has better handling of low light than the newer model. There's a lot of noise in the shots of SZ3 compared to shots taken with same resolution by the Lumix FS7 and my sister's Sony Cybershot DSC H10. After these tests, and solid first hand evidence of various trials, I now think that the SZ3 I have is not a good one at all. I am just not sure of whether the one I have is representative of the normal quality of an average SZ3 or I was just unlucky to get a bad one. Having said so, I am changing my rating for this camera from 5 stars to 2 stars for poor picture quality. I tried different settings on this camera but I couldn't get it to take sharp, noise free pictures consistently. I am so disappointed with this camera. I bought it because of the high ratings it received from others who gave it high ratings.", "Date": "February 9, 2014"}, {"Title": "Excellent size", "Author": "Elizabeth T.", "ReviewID": "R1F66S5SPALNV8", "Overall": "5.0", "Content": "This is the perfect little camera to fit in a clutch or handbag. I bought it to take with us during wedding season this past summer. I had a larger camera that wouldn't fit into any of my smaller bags. This one is perfect, and takes excellent quality pictures to boot. I highly recommend this.", "Date": "February 7, 2014"}, {"Title": "Panasonic lumix DMc-sz3", "Author": "Pen Name", "ReviewID": "RNC5M8JEJOKU6", "Overall": "5.0", "Content": "The Panasonic lumix  DMc-sz3 16.1 mp compact digital camera with 20x..... Is very good product. I like very must . It small.", "Date": "January 28, 2014"}, {"Title": "Nice Camera", "Author": "DeweyC", "ReviewID": "R2Y1IES9FOAETQ", "Overall": "5.0", "Content": "Really nice camera takes clear pictures due to it's small pocket size makes it easy to take with you anywhere got the card and case also one can't go wrong with this camera. For party's or casual use cant beat the price zoom is decent really enjoy the little camera and would recommend it for what I have stated.", "Date": "January 20, 2014"}, {"Title": "Nice little camera", "Author": "Phillip Cohen", "ReviewID": "R14L55H1DKGE56", "Overall": "5.0", "Content": "Nice light compact design with enough features.  Camera takes great pictures and \"mini\" movies so far. Would recommend for a carry around everyday camera.", "Date": "January 13, 2014"}, {"Title": "Excellent camera for my needs", "Author": "maxsb", "ReviewID": "R3D1MDQK1U5R5W", "Overall": "5.0", "Content": "I had an earlier version that needed replacing and I liked the idea of a wide angle lens. This camera is great for my needs. It could be a little wider but overall I'm very impressed and satisfied. Would recommend *****", "Date": "December 30, 2013"}, {"Title": "Light camera", "Author": "Irene S VanBuskirk", "ReviewID": "R390OQAKMHEHAM", "Overall": "5.0", "Content": "I bought this camera so I did not have to lug around my larger camera in certain situations. The quality is not great, but it's good enough for some situations.", "Date": "December 29, 2013"}, {"Title": "Great little camera.", "Author": "Marsha Wogan", "ReviewID": "RJUM2CZG6C85M", "Overall": "5.0", "Content": "Although I've only had it a couple of weeks, it fits my needs wonderfully.  Although the screen is a bit smaller than my other Panasonic, it is so clear, it's just as easy to view.  Love the size and what it can do.  Simple and easy to use.", "Date": "December 10, 2013"}, {"Title": "best camera", "Author": "smoker", "ReviewID": "R299Y8KZYY5TTM", "Overall": "5.0", "Content": "the best camera I ever had . takes clear pics even at 60 miles an hour {not the driver lol} and good inside pics for graduation in a dark  auditoruim", "Date": "December 8, 2013"}, {"Title": "Great Little Camera That Takes Awesome Stills and Videos", "Author": "RSB", "ReviewID": "R1S8T4HC396U70", "Overall": "5.0", "Content": "This small camera is marvelous!! My brother plays in a band and I videotaped several of their songs...everyone was amazed at how clear the video was! I bought a 32gb memory card, so was able to record at least 5 of their songs with plenty of space, AND my battery wasn't worn down at the end of the set; I had enough to take several still shots. This is the best camera I've ever had---it fits nicely into my purse and is always ready for impromptu shots! I purchased a Lumix case that fits it  perfectly and keeps it safe and secure.This is a great purchase!", "Date": "November 29, 2013"}, {"Title": "Very nice compact camera", "Author": "Alan E Evenson", "ReviewID": "R3ES4DDMAW0C82", "Overall": "5.0", "Content": "I have had a Lumix FZ20 for several years and like it very much but wanted something much smaller for an upcoming trip. The SZ3 should fit the bill very nicely. Amazing amount of features in such a small size. I chose Lumix again because I have had absolutey no problems with my previous Lumix. Planning to buy a second SZ3 for my wife. I have had several Nikon 35mm SLRs over the years but Panasonic/Leica makes a great product.", "Date": "October 3, 2013"}, {"Title": "Returning this camera after several uses", "Author": "Wayne Plourde", "ReviewID": "RUVR69GSLWT9Q", "Overall": "2.0", "Content": "We have previously owned a Panasonic Lumia and were quite happy with that. We expected similar quality with this model but the autofocus and color balance are unsatisfactory under indoor light and close up work.", "Date": "September 30, 2013"}, {"Title": "Broke the first time I used it", "Author": "Ilinx", "ReviewID": "R28WSEWTFXNATJ", "Overall": "1.0", "Content": "The camera broke the first time I used it - display completely scrambled. Terribly disappointed in this camera. I am trying to return it.", "Date": "March 22, 2014"}, {"Title": "over rated waste of money", "Author": "Rick", "ReviewID": "R121ZQJQOLGU1G", "Overall": "1.0", "Content": "Not as good of a camera as I was expecting. The picture quality is sub par at best. My gfs LG phone takes better quality of pictures.", "Date": "March 13, 2014"}, {"Title": "Not what i expected", "Author": "Cheryl Cleven", "ReviewID": "R26WW0SYJGKUS4", "Overall": "2.0", "Content": "Doesn't take very good quality pictures...and the battery goes dead way to soon....not at all what I wanted.would like to trade it for a more expensive one of better quality", "Date": "January 1, 2014"}, {"Title": "Good, but far from perfect", "Author": "Gail Mank", "ReviewID": "R174S1MJWULZ6C", "Overall": "4.0", "Content": "So far so good, but any shake or movement makes the pictures very blurry - in fact the position required to take the pictures leads to camera shake. The zoom control is counter-intuitive, zooming out in the direction I would think was to zoom in, and vice versa. The flash can almost turn night into day with only a slight grainy-ness of the image. Focus is sluggish when zooming sometimes, but I have been able to salvage nearly all the pictures I have taken so far. The digital zoom is almost worthless for handheld. I'm still working through the bells and whistles (ie all the settings and where they work the best), but overall a good camera for my needs.", "Date": "November 8, 2013"}, {"Title": "Enjoy the Panoramic feature", "Author": "Marsha Surles", "ReviewID": "R38Y78QNRD2JM9", "Overall": "3.0", "Content": "I bought this compact camera because of its size, weight, and brand name. I have had the larger size Panasonic Lumix for several years, so basic navigation through the various menus in the camera was already familiar. The Panoramic feature is easy to use, and this camera takes an excellent quality picture. I find locating the feature I want to use on the camera a little tedious because I have to scroll through so many different menus. This camera is best suited for a quick \"point and shoot\" rather than adjusting for custom settings for more professional looking photos.", "Date": "October 20, 2013"}, {"Title": "Great camera", "Author": "Amazon Customer", "ReviewID": "R4E4JIJNEHSHA", "Overall": "5.0", "Content": "It Zooms in really far. Has a lot of neat features. Great camera for picture far away. You can edit pictures on camera as well.", "Date": "June 30, 2013"}, {"Title": "Awesome camera", "Author": "Stephen L. Zeiner", "ReviewID": "RRGBB7Z5NF1NW", "Overall": "5.0", "Content": "Light weight. Crisp clean pictures. Very easy to use and store. Fits nicely in a handbag. Excellent price!! Would purchase this again, in fact we did. The husband knocked the first one off a shelf onto concrete and broke it!", "Date": "June 28, 2013"}, {"Title": "Great little camera", "Author": "Wilma Hume", "ReviewID": "R39IAGHHTKNWZV", "Overall": "5.0", "Content": "Love the 16MP and longer zoom. Easily fits in my small camera case and then in my pocket or purse which is what I was looking for. The photos are perfect and there are lots of \"fun\" things to do with the settings. Only had it a short time but love as much or more than the one I lost. Would recommend this camera to anyone looking for ease of use but also more sophisticated settings.", "Date": "June 24, 2013"}, {"Title": "great camera", "Author": "Robert Bertolini", "ReviewID": "R2WB3NDI5WU771", "Overall": "5.0", "Content": "Panasonic Lumix SZ3 16.1 MP. As far as I can assess the short time I have had this camera and the pictures I have taken I am very happy with the performance.It is light weight and very nice to handle, good function,and it takes great pictures.", "Date": "June 15, 2013"}, {"Title": "Great Camera", "Author": "V250330", "ReviewID": "R1FO6Q9DFW8EWS", "Overall": "5.0", "Content": "I bought this camera for a trip through Europe and was very happy with it.  Love all the special effect options and long battery life.", "Date": "May 20, 2013"}, {"Title": "Cheap is as cheap does", "Author": "L. Cheney", "ReviewID": "R3C03AU4CIWK1M", "Overall": "1.0", "Content": "I bought this camera as a replacement for my much loved DMC-FH20 when it suffered a scrached lens.  I thought with the higher resolution, more powerful optical zoom, and Leica lens this would be an worthy sucessor.  Boy was I ever wrong.  You cannot take closeups with this camera, and forget about macro.  I have a beast of a time even getting a decent picture of my hamster!  The picture quality does not reflect the supposedly better resolution.  and be prepared for indoor shots to either be a bit dark or noticeably washed out. And it's cheap.  Cheap body, cheap USB port cover, cheap lack of a charger, cheap lack of features... even the USB cord is thin, short, and cheap.  I've gone back to my old camera, scrached lens or not.  Seriously, spend the extra money for one of the better models because this one is no bargan.", "Date": "December 13, 2013"}, {"Title": "Lumix DMC SZ3", "Author": "Jane Youngbar", "ReviewID": "R2WQ9X7YONGBFM", "Overall": "5.0", "Content": "I have not purchased a camera for myself, ever. My husband bought me one (a very good one) at least 25 years ago. A lot has changed over the years. I wanted a point and shoot. I can hardly believe what I have seen with this little camera, especially when I look at the price. I know that I will have loads of fun with my little blue Lumix.", "Date": "March 5, 2014"}, {"Title": "Very nice camera", "Author": "Tammy", "ReviewID": "RO9AL7R5JS7M6", "Overall": "5.0", "Content": "I have been looking for a while for a replacement camera and this is a small,versitle camera with a great rating", "Date": "September 19, 2013"}, {"Title": "Great camera until it fails", "Author": "James Duke", "ReviewID": "RQOH0J5FSBCRG", "Overall": "1.0", "Content": "I have owned two Panasonic Lumix cameras.  The first one developed black spots on the screen.  After returning for repair for the same problem three times, and more than 5 total hours on hold and talking with worthless customer service representatives, they finally replaced it.  All work was under warranty, but each time I was without a camera for a month.  The replacement camera was a different model Lumix.  It failed within a year.  This time it was an auto focus issue on zoom.  I was advised that the replacement camera only had a 90 day warranty.  I purchased the lumix primarily because of the zoom lens.  DO NOT PURCHASE OR YOU WILL BE SORRY!", "Date": "April 16, 2014"}, {"Title": "Good pictures with few option", "Author": "Ibrahim", "ReviewID": "R3VBQNUJ7Y48N7", "Overall": "4.0", "Content": "as much as this camera have few option but the pictures i took with it nicei want to try it at night but till now i didn't had the chance for thatbut i think it will be good", "Date": "September 9, 2013"}, {"Title": "Stinks, images show distortion and blurriness", "Author": "Coolgirl \"jenstad-collectibles\"", "ReviewID": "R3K1B75EBN6E2U", "Overall": "1.0", "Content": "Terrible camera.  I purchased this camera based on the reviews given on Amazon.  It seemed to have alot of positive reviews, so I went forward and purchased the item.  I have owned a Panasonic lumix point and shoot, for many years now, and decided to upgrade.  I currently have a 7mp camera, (from 2006) and wanted to upgrade to 16 mp or higher.  I purchased this camera, and when I first tried this camera out, the images gave off a weird distortion & slight blurriness of images.  I thought to myself, o.k. let me go back and read the instructions again. So, after reading and playing around with the features I was still getting a blurriness and distortion in my images.  Some images were even showing a type of noise or spots in background.  So, I figured I was doing something wrong.  I called up Panasonic customer support.  Well, after being on the phone for over an hour an half, the customer support agent said that I could return the camera for another one or return the item to the store.  So, obviously I asked the customer agent if that verifies there was something seriously wrong with the camera.  They couldn't verify, what was wrong with camera.  So, I returned the camera back to the store and got my money back.WHAT I REALLY NEEDED THIS CAMERA FOR:  I only needed the camera to take images of merchandise, inside my house, in low light settings primarily for my online eCommerce stores on amazon & ebay.  Apparently, doing this simple task was too much for this camera.  I personally didn't try taking images outside.So, in final it was disappointing.  I was a huge fan of Panasonic and I guess you get what you pay for... But, I just can't see spending $1000+ for a camera to take simple images indoors.  I'll have to keep searching, as there has to be a decent digital camera, at an affordable price.  Happy Holidays everyone.", "Date": "December 4, 2013"}, {"Title": "Don't Take This Camera To The Beach", "Author": "Buddy and Hopkins", "ReviewID": "R28GAO00M3H83T", "Overall": "3.0", "Content": "I was able to take wonderful images with this camera... until we went to the beach. I had kept it in my pocket, away from the sand, but somehow a tiny grain must have gotten into the zoom lens, and it just stopped working. After searching on the internet for ways to fix it, I found that this is a common problem. It's very delicate when it comes to sand and dust. I guess my advice would be to buy a case along with it - which is what I should have done....and don't take it to the beach.", "Date": "September 29, 2013"}, {"Title": "Totally bailed on me", "Author": "Ahimsa Kerp", "ReviewID": "R2BJG586U8WF6N", "Overall": "2.0", "Content": "It's not a bad camera; I like the small size and it has some fun features.  But less than 6 months into buying it, it utterly crapped out on me, leaving me cameraless.  :(", "Date": "April 25, 2014"}, {"Title": "Hoping for Better Photos", "Author": "susan m higgins", "ReviewID": "RNL2SRASKZVQL", "Overall": "2.0", "Content": "Used yesterday and photos were not clear, colors not bright.  A disappointment.  I have two other small, point and shoot cameras (other manufacturers)  which are far better.", "Date": "November 20, 2013"}, {"Title": "Nice little camera", "Author": "kathfz", "ReviewID": "RRHH7ZLSLVEG0", "Overall": "4.0", "Content": "This is a nice little camera but not what I was looking for at the time.  I'm still searching for the perfect pocketable camera that takes nearly the quality of my dslr, if that even exist.", "Date": "September 29, 2013"}, {"Title": "Five stars", "Author": "Patti", "ReviewID": "R2WEJDR8WVBOO7", "Overall": "5.0", "Content": "My husband loves this camera. He can slip it in his pocket and go, he loves to take pics of things and he can grab and go and take and put back.Excellnet product. Gear this towards hunters.", "Date": "May 23, 2013"}, {"Title": "Its okay", "Author": "MJ \"coffee keeper\"", "ReviewID": "R2VPRL79XD7JLY", "Overall": "3.0", "Content": "Since the lense comes out it leaves room for dust and dirt to get in mechanism and easily \"damage\" it. I had ordered multiples and within 2-3 months they were damaged. I use for work- maybe for personal use it is better.", "Date": "July 12, 2013"}, {"Title": "A Sad Lapse in the Lumix Tradition", "Author": "Ahmed \"Ahmed\"", "ReviewID": "R2YSEPSPENKG0P", "Overall": "2.0", "Content": "I have owned Panasonic Lumix cameras since they were first introduced and have always purchased them because of their excellent optics.  This camera does not follow in the Lumix tradition.The images are soft and lack contrast.  My former, Lumix Model DMC-FS15, puts this camera to shame in both areas.The other thing that should be disclosed on your website in big bold letters is that there is no external charger provided.  You have to charge the battery while it is in your camera.If you are concerned about sharp, saturated images and the convenience of being able to charge your battery while it isn't in the camera, look for another camera.P.S.  If you so buy one, don't go near the internal \"retouch\" setting on this camera.  All it does is blend adjoining pixels and turn the images to \"mush\" trying to hide the wrinkles in your subjects.", "Date": "November 4, 2013"}, {"Title": "defective usb adaptor", "Author": "Ricardo N", "ReviewID": "REJF9TBHK0XET", "Overall": "1.0", "Content": "Great point-and shoot camera. The one-star rating is for cutting-corners with the accessories. This camera and the one I bought to replace it (same camera, same seller) shipped with a defective USB wall adapter - which will not charge the battery. I took the replacement camera with me in the car, right out of the box. and charged it with my USB lighter adapter.  However when I took it home and plugged it to the wall adapter I got the same error light (and failure to charge) as with the previous camera. Instead of returning the camera again I am just making due with one of the many USB wall adapters I already own. Panasonic could take a clue from other electronics manufacturers and just omit the wall adapter all together.", "Date": "January 7, 2014"}, {"Title": "not good", "Author": "camera8", "ReviewID": "RKPEL6RQ0FE98", "Overall": "1.0", "Content": "Sent this back after my first time out with it,bad screen hard to see what you are taking a picture of,plastic body and just a overall bad camera, the only neat thing was the art work button, I don't think this camera is worth the price! Electronics basket listed it as they had it in stock which they did not and sent me another camera without checking with me first, not good, got the camera I wanted but this is not a good camera, Electronics Basket not a good company to deal with, came in a box with hardly any wrapping and was given wrong address to ship it back, now waiting for box to return to resend it! A bad thing all around!!", "Date": "October 7, 2013"}, {"Title": "Back LCD bad", "Author": "James S. Middleton", "ReviewID": "RQK0ZH431ICBN", "Overall": "1.0", "Content": "While a new model this is not an update to the SZ1.  Price points be what price points are Panasonic cheapened this model line to meet the new price point.Out of the box the rear lcd was bad.  Had shadows.  Hard to explain but looked sorta like plasma TV screen burn in.Exchanged without question, thanks Amazon, but still.", "Date": "August 7, 2013"}, {"Title": "not what I ordered", "Author": "Teresa M. Vaughn", "ReviewID": "RX8IJ2HDINX4G", "Overall": "1.0", "Content": "I ordered a camera that was 20x zoom. This was only 10X. I was counting on the 20x zoom at my kids ball camp.", "Date": "July 8, 2013"}], "ProductInfo": {"Price": "Unavailable", "Features": "16.1 Mega Pixel, 10x optical zoom, 20x Intelligent Zoom, Mega O.I.S.\n2.7\" LCD Screen, Intelligent Auto Mode, Venus Engine, 12 Effective Create Control\n720p Motion JPEG Video, Sonic Speed Auto Focus, Creative Panorama Shot", "Name": "Panasonic Lumix DMC-SZ3 16.1 MP Compact Digital Camera  with 20x Intelligent Zoom (White)", "ImgURL": "http://ecx.images-amazon.com/images/I/41XFePFrOnL._SY300_.jpg", "ProductID": "B00ATE7TIS"}}