{"Reviews": [{"Title": "Great value and lenses", "Author": "BMilly", "ReviewID": "R18THFT86HLUVG", "Overall": "5.0", "Content": "Thought these were a great value and the lenses look great - well-packaged! I had a little trouble getting the cap off the macro lens but finally got it. Like the leather pouches they came in and the added accessories.", "Date": "January 8, 2014"}, {"Title": "Broken with first use.", "Author": "Karen S.", "ReviewID": "R26R2TY6I4FHE6", "Overall": "3.0", "Content": "I was really excited about this kit as I wanted to try some different effects w/o spending a lot of money. The telephoto lens was okay (picture quality was alright) but it broke about two minutes after I put it on my camera.  The glass literally fell out as I was taking a shot.!! Since I was disappointed with the telephoto lens, I haven't used any of the other components of the kit.", "Date": "January 7, 2014"}, {"Title": "Sure why not.", "Author": "Gabriel Alfaro", "ReviewID": "R35BU2S4OMF394", "Overall": "3.0", "Content": "Feel like I bought to of the same lens. They both look like the one on the left. 2.0 and 2.2 has no real difference but i know that. None of them say macro on the box or lens and My macro 58 mm. gets closer shots without them on. The try pod will not even come close to supporting the weight of my canon but didnt really think id be using it any way. probably just put it in a back pack with my little digital snap shooter.  Im going to take a ride, see what it can do out doors. All in all they do seem pretty heffty and well designed and im sure ill figure some way to get the best use out of them. Not a bad price. just be sure you have a 58mm to fit them on, i know that confuses people sometimes. they have no sensors, they are only thread ons. just saying.", "Date": "December 16, 2013"}, {"Title": "Great Lens!", "Author": "Shawn", "ReviewID": "RBWS8I4OS1OCH", "Overall": "5.0", "Content": "Great product for the price! I take great pictures with my new lens. I love the quality of my pictures when I use it!", "Date": "July 1, 2013"}, {"Title": "SSE Wide angle & Telephoto lens kit", "Author": "ShaDexRob", "ReviewID": "R2P1NF6EG1SXJN", "Overall": "5.0", "Content": "Very Nice and got here fast.  I am very pleased with this lens kit and all for the cleaning stuff that came with it.", "Date": "March 27, 2013"}], "ProductInfo": {"Price": "$29.89", "Features": "Razor-sharp optics, as well as a detachable macro lens for close-up shots\n0.43X Super Wide Angle (with Macro) High Definition Lens\nHigh Definition 2.2X Telephoto Lens Comes with a Lens Pounch\nIncluded bonus accessories make this kit an outstanding value.", "Name": "SSE Wide Angle & Telephoto Lens Kit for CANON REBEL EOS DSLR Cameras (Including T4i T3 T3i T2i T1i XT XTi XSi 60D 7D with 58mm lenses). Includes: 0.43X Super Wide Angle (with Macro) High Definition Lens, 2.2X Telephoto High Definition Lens, Bonus Lens Cap Keeper, Lens Cleaning Pen, Table Top Tripod, LCD Screen Protectors, Cleaning Kit & SSE Microfiber Cleaning Cloth", "ImgURL": "http://ecx.images-amazon.com/images/I/51SIOJ-VgjL._SY300_.jpg", "ProductID": "B00A84WZ1U"}}