{"Reviews": [{"Title": "Excellent product", "Author": "Eye Doc", "ReviewID": "R3KPA0II6EGGXW", "Overall": "5.0", "Content": "I wish I would have learned more about what lenses were best before buying this package.  The 2x and 1.4x lens really are pretty useless.  It would be much better to have the 18 to 135mm lens....which I ended up buying seperately.The 32GB card is fantastic and the camera bag, extra battery and tripod are nice.", "Date": "February 17, 2013"}, {"Title": "My Canon", "Author": "Hector", "ReviewID": "R1GVMLPVWD1IUP", "Overall": "4.0", "Content": "I originally bought a Rebel XT and really liked it.  If you haven't updated your old Rebel, you need to.  This is a really great camera.  The quality of the accessories that came with the kit I bought was not great but not bad to play around with.  All the important stuff like the camera body, lenses and batteries are great.  I do give the Canon T4i 5 stars but it's the accessories that brought it down to a 4 star rating.  Lets face it, if the kit was gonna get a 5 star rating I would have paid a whole lot more for it.  So its a great camera with great lenses and some ok accessories.  I definately recomment this purchase.  If you have the money, spring for the top notch wide angle lenses as well.", "Date": "March 5, 2013"}, {"Title": "False advertising. The title says  'Telephoto & Wide Angle Lens'.", "Author": "farhan", "ReviewID": "R1PV7US5JKMDAP", "Overall": "4.0", "Content": "Not everyone is an expert on Camera's. If the title says -  'Telephoto & Wide Angle Lens'. , I would expect to see those,", "Date": "June 3, 2013"}, {"Title": "Canon EOS REbel T4i", "Author": "Adam Schlachter", "ReviewID": "R2D5VNIOL04Y55", "Overall": "5.0", "Content": "Phenomenal camera.  This camera allows the average photographer to take pictures like the professionals.  I have used the camera for several months now, taken several thousand pictures and have not had one issue.  I have shot everything from low light, live action sports to sunny day, washed out landscapes and I have not yet found a situation where I could not adjust the camera to get the perfect shot.  The 75-300mm lens is a must have in my opinion.  The tripod that comes in this package is great, as are the lens filters and adapters.I would recommend this product to a friend.", "Date": "July 4, 2013"}, {"Title": "Good buy", "Author": "Mark Banning", "ReviewID": "R3K2HW6EH3N7T9", "Overall": "5.0", "Content": "Fantasitc camera.  Easy to use and takes wonderful, sharp pictures. The accessory kits offered vary but I am very pleased with the one purchased.", "Date": "November 25, 2013"}, {"Title": "Great Product", "Author": "TINA GUILLIAMS", "ReviewID": "R2VPP6XPXTQIV5", "Overall": "5.0", "Content": "This was an upgrade from mly Canon EOS.  I have been very pleased with the camera and lens.  Delivery tme and packaging were excellent.", "Date": "November 20, 2013"}, {"Title": "Great product", "Author": "Phyllis", "ReviewID": "R1X5TMJ5XPR1CT", "Overall": "5.0", "Content": "Love this camera!!! Beautiful pictures and great combo with lots of excessories.  LOve being able to video and take pictures all in one.", "Date": "July 25, 2013"}, {"Title": "Worth the camera and two canon lenses alone!", "Author": "James Kemp", "ReviewID": "RYWNYT9DYH099", "Overall": "4.0", "Content": "Plus you get an extra battery and lens filters. It comes ready to use after a battery charge, and sdhc car insertion. Some of the other stuff you get is on the cheap end but price the camera and two canon lens alone and you find that the other stuff is free. And I really like the camera. I still have a lot to learn about using it properly in different lighting and speed settings. I like the speed at which you can snap pictures, very much. I would definitely do it over.", "Date": "July 20, 2013"}, {"Title": "Great camera", "Author": "SR1", "ReviewID": "R6TFYH8B328MR", "Overall": "5.0", "Content": "This T4 rebel camera takes pictures fast to catch the action and captures with clarity. Vendor shipped quickly.  The bundle deal was an exceptional value as the camera and the lens would have cost more if purchased separately.", "Date": "July 18, 2013"}, {"Title": "Love the camera and all the accessories", "Author": "Becki Yeomans", "ReviewID": "R3PMQ7IKIJDFB0", "Overall": "5.0", "Content": "This was a gift that was better than I expected and overwhelmed the recipient.  I would recommend this package to anyone who is interested in purchasing the Canon EOS Rebel T4i.", "Date": "July 16, 2013"}, {"Title": "It was better than expected", "Author": "Elizabeth3TX", "ReviewID": "R170MAWI7X1G5A", "Overall": "5.0", "Content": "Paying such a small amount for so many things, I was expecting some really cheap products. The Cannon stuff, obviously, was the same high quality I've come to expect from Cannon. The other stuff was also very good quality. I am very happy I get this kit.", "Date": "July 15, 2013"}, {"Title": "Great kit", "Author": "Leonardo Tamura", "ReviewID": "R2IM3SBUY29DCQ", "Overall": "5.0", "Content": "The camera and the lenses are awesome.The acessories are of good quaility for a reasonable price.It is a great kit to start.", "Date": "June 16, 2013"}, {"Title": "The camera is ideal for someone who wants to learn photography, but who is not ready for a more advanced model.", "Author": "Michael J.", "ReviewID": "RUX7PCVNS5DU8", "Overall": "5.0", "Content": "The accessories added tremendous flexibility and needed equipment for a variety of photo shooting scenarios. The touch screen on the Ti4 is a nice bonus, but not necessary.", "Date": "June 13, 2013"}, {"Title": "Awesome deal", "Author": "lindsy", "ReviewID": "R34V9WQ1VMY4J3", "Overall": "5.0", "Content": "love it so far :) just started looking at all the goodies that come with it. could use a bigger bag for everything to fit in it,", "Date": "May 30, 2013"}, {"Title": "Great Deal!", "Author": "Kyle", "ReviewID": "R37YOIBDH6EAHI", "Overall": "5.0", "Content": "Everything arrived quickly and works well. This is my first DSLR and I have loved it so far. It is nice to have the added options for shooting that the kit provides, even though I don't think I needed everything. Each item is good quality, except the tripod is a little shaky. Great choice for a beginner DSLR.", "Date": "May 30, 2013"}, {"Title": "happy", "Author": "CARLOS BOTERO", "ReviewID": "R7BB28D8PY94X", "Overall": "5.0", "Content": "It's perfect for take good pictures, is the gift that I always desire.  the quality of the products in the set are good", "Date": "May 25, 2013"}, {"Title": "Great camera and great pack!", "Author": "Rafael Neves", "ReviewID": "R3V13W5FKFPS5G", "Overall": "5.0", "Content": "The one regret I have about this pack is not having it before! Great camera that comes with a great pack! Although it's a professional camera, it's easy to learn how to use with the dvd and the manuals within the pack.", "Date": "May 20, 2013"}, {"Title": "Excellent Camera Kit", "Author": "Thomas", "ReviewID": "R1IVHRKIBFSG0Y", "Overall": "5.0", "Content": "I am shooting with several other professional photographers, and they all like my new T4iThe touch screen adds a nice touch to the camera.It takes excellent photos, and and the lens selection is nice.It's a great starter kit, and you can expand at will.The camera bag that comes with it is not big enough to fit everything and the camera.I purchased an extra flash and a Wang Fong defuser, and this camera takes excellent pictures.Highly recommend this camera kit.I'm a big Canon fan though so I'm slightly bias.  ;-)", "Date": "May 10, 2013"}, {"Title": "Canon Rebel T4I", "Author": "Gabriel", "ReviewID": "R3J593P0O652LI", "Overall": "5.0", "Content": "This camera is awesome. One of the best purchases of my life. I'm really glad I was able to get the bundle package with the camera as well. The lenses really come in handy. Amazon is amazing.", "Date": "April 30, 2013"}, {"Title": "Great Camera", "Author": "djdomsmom", "ReviewID": "R2QT7FEVS7TRQU", "Overall": "5.0", "Content": "This camera takes great pictures and is so easy to use.  The price is good for the amount of products you get.", "Date": "May 5, 2013"}, {"Title": "great package!", "Author": "Liliana Hinojosa", "ReviewID": "R159WGVT6RIM3U", "Overall": "5.0", "Content": "The lens kit package was great. The bag is amazing and sooo useful..camera in great condition. Lenses (canon ones) work great...the attachment ones are alright. Memory card is perfect as is the lens cleaning kit. No complaints, really....well the battery dies kinda fast but that's ok. Still better than nothing for a backup!", "Date": "August 19, 2013"}, {"Title": "Even better than I expected...", "Author": "Mr. C. Scott", "ReviewID": "R2QGQ52UW4QMZP", "Overall": "5.0", "Content": "Great service from the seller and a very good selection for what I would call a beginner.I have yet to use the tripod but have been putting the rest to good use.The camera is so easy and intuitive to use, I just need to understand how the video function works although I mainly got this for stills of course.", "Date": "July 27, 2013"}, {"Title": "Great Camera!!! Really love it!!!", "Author": "Lori Chun", "ReviewID": "R3HOJG7V0ZBG86", "Overall": "5.0", "Content": "Great camera for a novice.  I feel that it is almost like a point and shoot, yet there are more options available - I haven't discovered them yet, but I know that they are there waiting for me to learn how to use them.  In the meantime I can still use my camera and get great results!!!", "Date": "June 18, 2013"}, {"Title": "I am sure it is a great camera", "Author": "KIKKOMAN", "ReviewID": "R5XNZ9PGP3BDT", "Overall": "5.0", "Content": "I read lots of reviews and feedback from other people. Great deal with $950 no tax. But unfortunately, my husband doesn't agree on $950 camera to spend. so, I am returning it even I haven't open any of the camera boxes, but just shipping box. The accessories are gerat. They aren't canon brand just a peak I looked at it. If you can sepnd $950 for a camera, go for it. I am going to purchase it when it goes down to around 600 like T2i. I probably have to wait another 3-4 yrs and hope it is still in the market.", "Date": "April 19, 2013"}, {"Title": "Works great.", "Author": "Dorothy M. Berkner \"DM\"", "ReviewID": "R3X4L5Q74MQBA", "Overall": "5.0", "Content": "The camera seems to be taking very nice pictures.  Both lens have a good feel.  I'm Happy with the camera and accessories", "Date": "February 5, 2013"}, {"Title": "Excellent", "Author": "Pen Name", "ReviewID": "R3GP222SKS3SRG", "Overall": "5.0", "Content": "I love this camera and all the stuff that comes with it!! Great deal!!  It gave me everything I needed and more!", "Date": "December 30, 2012"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B00A2ATBTO"}}