{"Reviews": [{"Title": "Good for oudoor shots....", "Author": "Cindy", "ReviewID": "RVSA3RE4WHO5I", "Overall": "2.0", "Content": "If you only take photos outdoors on sunny (but not TOO sunny) days, this is the camera for you. It takes great pictures in those conditions. If you have small, active children and would like to capture those fleeting precious memories, spend a little more and get a better camera. I have managed to take countless photos of the backs and tops of my kids' heads as they turn away during the three to five seconds it takes for this camera to focus and actually take the picture after you hit the shutter release button. If I'm really lucky, these awesome pics of my kids' heads aren't blurry. These are all indoor pics though, it really does take good outdoor pics (and very quickly) in good lighting. For indoor birthday parties, forget it. I admit, I am one of those people who likes to use the auto settings on a camera, so maybe that's part of the problem, but I have tried manually setting the different scene modes, and the pictures all looked pretty much the same.", "Date": "April 4, 2013"}, {"Title": "best camera", "Author": "George W. Ganssle \"ganssle\"", "ReviewID": "ROMBQWGSMYW8J", "Overall": "5.0", "Content": "I've been a camera buff for the last 45 years. I purchased my first digital camera in 2002. It was a Canon and it was a very good camera. I then got a Sony Cybershot and it was the worst piece of junk I've owned! Like a fool, I bought another one on line and it had the same problems. My wife bought me a Nikon D80 and that thing would just quit working sometimes. I see from reviews online that many people have that same problem with the D80. This Nikon Coolpix is the best camera, hands down, that I've ever owned. One thing that shutterbugs may eschew is the fact that, when set to highest setting, the movie mode will take up 250MBs for one minute of video!! Now, that's a quality flick. Four little movies and you've used up a GB. There are lower settings, though. Great Camera!!", "Date": "August 21, 2013"}, {"Title": "Nice camera", "Author": "Proud Mama89", "ReviewID": "R2GUE4F19DR09", "Overall": "5.0", "Content": "Great camera, the pics are really clear. It doesnt use batteries, you have to charge it up. But the battery has a surprisingly long life.", "Date": "June 12, 2013"}, {"Title": "Good job", "Author": "cynthia boyd", "ReviewID": "R39J90FKAG4RSN", "Overall": "4.0", "Content": "It was presented as in very good condition AND IT IS! The pictures are good. The videos are good . I use it nearly daily in doors and out doors.", "Date": "June 24, 2013"}, {"Title": "Camera was a gift. The recipient liked it.", "Author": "Dave", "ReviewID": "RD1SAS9R4U56J", "Overall": "5.0", "Content": "The camera was a gift. The recipient liked it. Hard to find a lightweight digital camera with these specs at this price.", "Date": "January 13, 2014"}], "ProductInfo": {"Price": "Unavailable", "Features": "Coolpix S3200 16.0 Mp 6x Wide Opti", "Name": "Nikon Coolpix S3200 16.0 Mp 6x Wide Optical Zoom Digital Camera (Silver)", "ImgURL": "http://ecx.images-amazon.com/images/I/51I0LxYMMhL._SX300_.jpg", "ProductID": "B00AD6JHH8"}}