{"Reviews": [{"Title": "Great camera", "Author": "Marc meyer", "ReviewID": "R2MVNKDBZYIJ56", "Overall": "5.0", "Content": "Im new to DSLR and i love this camera it does everything i want and more so far no issues everything worked without flaw someone commented the case is to small to leave lens on and thats not true it has removable dividers.the shutter release works great from 10 feet away i have already taken some great pics love this camera i would buy again", "Date": "November 13, 2013"}, {"Title": "Great Camera Puchase from Amazon", "Author": "Constance M. Langford", "ReviewID": "R2C6KNJHBD9GHM", "Overall": "5.0", "Content": "This is my first DSLR camera so I don't have another digital SLR camera to compare it with. Someone recommended this particular manufacturer and model to me and I am very happy with it. The camera body itself fits my hand very well...it has a good solid feel to it. One of the things that I was thrilled with, at first, was the LCD screen. However, I now use only the viewfinder because I find that it gives me a truer guide as to what will be in the photo itself. The only thing I use the LCD screen for now is to review pictures that I have taken.I was little intimidated by all of the buttons and dials when I got the camera. So I used the Auto setting when I first started taking pictures and it took beautiful pictures. However, I have spent more time with the camera manual that came with the camera, learning more about the buttons and dials and I am amazed at the photos I am now able to take using the Manual setting. The camera came with the Canon EF-S 18-135mm Lens Kit. There were a number of items in the Master Kit. Some of the items I will use and others that either did not work or were unsuitable for other reasons. The only things that I will use are: Digital Camera Cleaning Kit; the Transcend 64 GB Class 10 SDXC Memory Card and perhaps, in a pinch the Extra High Capacity Lithium-Ion Battery Pack. The battery pack would not fully charge. When I called about this, I was told that because it was not a Canon product, I could not expect that it would charge properly with the Canon charger that came with the camera. I could not get the Zeikos Shutter Release to work, so I gave up on it and bought a Canon shutter release. I have not used the Card Reader so not sure whether it will work or not. The Vidpro Camera and Lens Case was not large enough to store the camera with the lens attached, so it is of no use to me. In spite of these shortcomings, I am happy with the Canon EOS 60D camera and the lens.Does it have features that would satisfy a more advanced photographer? I don't know the answer to that. But I can certainly recommend this camera to anyone who is ready to graduate from a point and shoot digital camera to an SLR.", "Date": "November 6, 2013"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B00A3IS69Q"}}