{"Reviews": [{"Title": "Quality is good enough for commercial use", "Author": "Mark Kitaoka", "ReviewID": "R2YJYZPMMGELFV", "Overall": "5.0", "Content": "I'm a full time commercial performance photographer who specializes in theatrical, symphonic and dance photography, both for production as well as publicity. I have waited to review the X100S I purchased from Amazon and received on March 28 2013 simply because I wanted to take some time to use the camera before writing a review.I had purchased an X100 just before the S model was announced and found the image quality to be remarkable. Because I was late to the game in purchasing the X100 many of the 'quirks' others complained about I did not experience due to the numerous firmware updates Fuji had released since the camera's inception. Because the X100S had features that could not be fixed through a firmware update such as the Q button and moving the focus point selector from the left to the right I opted to sell my X100 and preordered the S model. I will say that I sorely missed having an X100 or S model during my two month wait.I have experimented with the X100S over the past two months using it in both personal and commercial work. Yes I said commercial work. There are several features I find quite remarkable on this camera regardless of a camera in any price range:1. The sharpness of the images due in part to the elimination of the optical low pass filter2. The noise performance of the camera3. Having an (almost) unlimited flash sync speed due to its leaf shutter4. Built in 3 stop ND filter5. An almost completely silent shutter (again due to its leaf shutter)What I would like to see improved:1. A bit more resistance to the on/off switch2. Allowing the user to customize the Q menu to allow for ALL camera operating choices3. Allow shooting in RAW mode to include 100 ISO (200 is currently the lowest ISO in RAW)4. Allow shooting at any shutter speed at any aperture. (this may not be physically possible...)5. The camera has a tendency to overexpose by about 2/3 of a stop. Easily corrected with the EV control6. Even though the X100S has a dedicated EyeFi card menu selection, the transfer speed of small JPGS to an iPad is very slow. Much slower than a 5DIII and in some cases makes using it as a wirelessly tethered camera almost useless.The OVF and EVF viewfinders are absolutely brilliant. I find that I have used both equally depending on the shooting situation. In very low light I have found the EVF invaluable. In situations where I need to keep an eye on the environment, the OVF is just killer. While I'm on the subject I personally would never consider a camera that does NOT have a dedicated viewfinder. Since I grew up using SLRs and DSLRs I just cannot effectively use a camera where my only option is to use an LCD screen. I'm also not a fan of having to purchase an 'optional' EVF viewfinder for any camera. Just a personal preference.Did I consider other non DSLR cameras before purchasing the X100S (originally the X100)? Yes, I considered the Canon line for a couple of reasons; their G series has a viewfinder and my primary gear is Canon. Others? Only those that had a viewfinder and I found that those which only have an EVF were a bit too 'jerky' to me. I also tend to put more stock into reviews from people whose body of work I respect. There are plenty of sites on the Web that give tech details and masturbatory reviews of tech specs, but in the end what I produce from any camera is what's more important. I respect Zack's (Arias) work and put stock into how he feels about a camera simply because of his body of work. Although we shoot different types of imagery I trust his and other photographers I respect more than technical sites. A personal view which has served me well.I have always wanted a camera that is lightweight and compact (relative to my work gear) that I can carry with me everywhere. No the X100S is NOT something I can slip into my pocket, but that's OK by me. I simply wear it across my chest using a Luma Labs Cinch strap and I barely notice it's there. My plan was to use it primarily for street shooting, which is something I have a voracious appetite for and have done quite a lot over the years. At least when I have time! Yes I miss a zoom which I found I depended upon quite a bit for my street shooting. But something that a fixed lens camera forces me to do is to immerse myself into the environment for street shooting. It also allows me to grow as a photographer, to get more context into my shots. I have personally found that using the Fuji at night rather than the day makes it easier for me to street shoot. The ISO performance of the X100S is on par with my 1DX up to 6400 ISO and a tad better than my 5DIII. The f2.0 lens allows me to bokeh scenes in a wonderful way. Of course that all depends on how close I am to the primary subject, aperture, etc but I've found it quite lovely.One of the most remarkable features for me is the ability to use small hand held flash units off camera as fill flash with the X100S due to its leaf shutter. I was literally blown away that using a single Canon 580II through a modifier could produce results that in the past required me to use a studio strobe and an ND filter to achieve. I love the fact that I can carry a small flash unit in my bag and take almost commercial level portraits. I'll try to upload some examples with this review. I had mentioned that one of my wishes was for Fuji to enable the X100S select any shutter speed with any aperture. Currently they recommend 1/1000th at a minimum aperture of f2.0. If you want to use 1/2000th, then you must use f4.0 or smaller.I have found that if I'm using a radio trigger to activate the off camera flash 1/1000th and f2.0 works. Anything faster in speed results in funky exposure results. However if I use a cable rather than a radio trigger I can squeeze 1/2000th with f2.0. In terms of flash, milliseconds count so a wired connection is better in some circumstances. It all depends on what you're trying to achieve.In terms of the 'silent shutter' I had firsthand experience with that feature this past week. I was hired to photograph both a live and rehearsal performance of a major US symphony. Since I use two cameras whenever I shoot production had I not had the X100S I would have only shot with my 5DIII in silent mode during louder passages. I never even considered my 1DX because even on 'silent' mode it is way too loud. And when I was told the last commercial shooter was kicked out by the world renowned conductor due to his camera noise (understandable) and attitude (bad) I didn't intend to make the same mistake. So during passages where the musicians were playing very softly I was able to make images with the X100S. Again, a remarkably useful feature for my work.I won't go into the things I 'love' about this camera since that is all relative to each user. I also won't ever be able to completely replace my commercial gear with only mirrorless cameras. Because I shoot dance and live theatre the X100S along with other cameras of this type are just not fast enough from a focusing/shutter release standpoint. But for portraits and publicity work I have and plan to continue to use it for client work; it's that good.Who should buy this camera? Who am I to say!? I can only say (in no particular order) that with its remarkable shutter sync speed, image quality, hi ISO performance and build quality I'm very happy to have purchased this little camera. It's THAT good. And like any tool (rather than looking at gear as a 'jewel') it's perfect for the right job. Will it make you a better photographer; nope. Only improving your skills and executing your imagination will do that.UPDATE June 18 2013I have had my first image taken with the X100S published commercially. When reviewing imagery my client is not made aware of the camera I've used and bases their selection strictly on image quality, feel, impact among other factors.UPDATE June 30 2013I recently utilized a wired solution to obtain faster sync speeds than 1/1000th of a second using an off camera flash. I purchased the following system through Amazon: [...]I have been successful at using shutter speeds up through 1/4000th at f2.0 using a WIRED off camera flash. The reason I chose this particular tethered option was twofold. First by having the ability to use regular CAT 5 Ethernet cable I can select what length to carry with me rather than being confined to lengths offered by other off camera flash cords.I also prefer straight cords over coiled because coiled cords tend to tip over my light stands if I stretch them. One of the most remarkable features of this system is the ability to attach up to three cables to the very same controller on top of the camera. I find I'm often using two flash units whenever I take a shot and having this option in one unit is just brilliant. Also since the sockets are on both left, right and front of the controller I can use the two side sockets and not worry about having to hold the cable away from the lens like other single cord off camera cables.I never use TTL so only having one TTL feature available with multiple flashes attached does not affect me.UPDATE 7-21-13I have posted my commercially published image for the Dallas Symphony Orchestra's 2013-14 season which was printed 11x17 and mailed to all current subscribers.UPDATE 1-14-14One of my publicity images was printed at 18x80 feet for Dallas Symphony Orchestra. The image was shot with my X100S.[...]", "Date": "May 31, 2013"}, {"Title": "A generational camera.", "Author": "Tsur", "ReviewID": "R2GHK56E6KWMQ6", "Overall": "5.0", "Content": "You can look at my Amazon review for the x100 and see how desperately I wanted to love the camera. I gave it three stars, for all the wonderful things it could do, but I was let down by its slow auto focus and abysmal manual focus.But I kept it and used it for almost two years and got some fantastic images despite the quirks. FYI, \"quirks\" are what you call flaws in most cameras, but because of the stellar image quality of the x100 you call them quirks to be forgiving. Though I  learned to live with the x100, I eagerly awaited what I thought would be the x200. Instead Fuji delivered the x100s and it really is all that I hoped for. Every major flaw that kept me from loving the x100 have been addressed. In short, the camera is fantastic.The image quality is superb. The colors are slightly different but not any better or worse. I appreciate the extra megapixels, but I'm not wowed by them. Though I am very appreciative that the extra resolution didn't introduce any extra noise. In fact, I think the S is better with noise than the original model - high praise.In good light, the auto focus is quick, very quick - just shy of lightning quick. The x100 doesn't even come close to the S in terms of auto focus. In low light, the AF is good. Not great, but solid and definitely very usable.The manual focus is infinitely better than the x100. The original camera's manual focus was so bad that I simply never used it. It was a huge oversight on Fuji's part. The new focus ring isn't a mechanical connection, but the feel of it is so much better than the original. But more than that, I really appreciate the split focusing. I find it incredibly useful. It also offers focus peaking, but I don't find it as useful.The EVF is amazing. My Amazon review for the x100 expressed my disdain for EVFs. The S changes my mind. All of my past experiences with EVFs were awful. The S has a beautiful, crisp and fast EVF that it really makes me want to use it. For the original camera, I almost always left it in optical mode. Now, I can easily see myself splitting my time between the two modes.As an added bonus, the video mode no longer sucks. Honestly, I don't know a lot about video, but I know that the x100 couldn't keep focus on even the slowest moving objects. The S is very usable.I feel that the x100S is a generational camera. That is, I see myself keeping it for a decade or longer - like really great 35mm cameras from past decades. My father used his Pentax K1000 for 20 years, I hope to have the same relationship with the x100s. In five years I may look back on this review and laugh as I shoot with my 3D holographic camera. But currently, I really do feel the x100S is that special.The x100S has fine enough image quality and speed, in such a reasonably sized package, that the next generation of camera doesn't appeal to me. The x200S could have twice the resolution and twice the speed and I simply wouldn't care. I'm not suggesting that the x100S is the pinnacle of fixed lens digital cameras. But I am saying that Fuji has achieved such a balance of features and performance with the x100S that I can't reasonably see myself upgrading or switching for the foreseeable future.I love this camera.", "Date": "April 1, 2013"}, {"Title": "This is what photography is all about...", "Author": "rsbagga", "ReviewID": "R3U3VL8HEGAJ7W", "Overall": "5.0", "Content": "Got this camera a few days ago after preordering it several weeks back.  Let me be clear; I am still learning this thing, but these are my initial impressions.There are very few, so let me first discuss the few \"cons\":1) Obviously, it isn't cheap. Took lots of thinking before I bit the bullet on this one.2) It isn't really a \"compact\" camera - its way smaller than my massive dSLR with grip, flash, and lenses, but it's not pocketable - especially not with a hood on (sold separately).3) Quirky at times - it is generally easy to go through menus, etc, but it takes some training and time before you figure it out.  For example, I got frustrated for 10 minutes trying to switch back to the optical viewfinder from electronic before realizing the optical with overlay doesn't work in Macro mode.4) The optical viewfinder overlay is awesome, but the lens barrel intrudes on the view (none of the reviews mentioned this), and there is the natural distortion that comes from using this type of optical viewfinder.5) The strap it comes with isn't great - it isn't long enough to comfortably go around your neck and shoulderNow that thats out of the way, the pros.1)  Beautiful images.  Great pictures of things, but honestly the camera shines for its photography of people.  Skin tones, etc. are all stunning.  The grain pattern is beautiful and truly \"film-like\".2)  Lens.  I was worried about a 35mm fixed lens.  But the lens is the perfect focal length and is sharp throughout.  I read cnet's review after i'd already used the camera, tried recreating their qualms at f/2.0, and couldn't.  Frankly I don't know what they're talking about.  Mine is super sharp. ***UPDATED*** - Upon a suggestion from a reply I got to this review, I did put the camera in macro mode and shot a close up object at both f/2 and f/4 at full size. And yes, there is a difference in sharpness - you have to get to f/4 before it is razor sharp.  I will say that you can only notice it when \"pixel peeping\" (i.e., you have to zoom in to 100% and compare the two of them.  I've taken tons of pictures in f/2 already while outside of macro mode and have been thrilled with the results.  Accordingly, I still take issue with CNET's suggestion that the camera is \"unusable\" at f/2.3)  Viewfinder.  Yeah I complained about it above a bit, but it really is wonderful, both optical and electronic.  Use it and forget about using LCD screens.4)  Size. As I said above, it isn't compact - but its kind of the perfect size to actually hold in your hand comfortably and snap away.  Any smaller and it wouldn't be as comfortable.  Any bigger and it would be heavy and clunky.5)  Satisfying.  Strange thing to say about a camera, perhaps.  But truly, taking pictures with this thing is satisfying.  I am picky - I love my NIkon dSLR and i've tried several other cameras (i wanted a smaller \"take around\" camera so I dont look like i'm paparazzi).  This really is an enjoyable, satisfying camera to use.  It makes you want to take more pictures.  This is NOT a point and shoot camera - even putting it in auto, you really need to know what you're doing.  But with all of the manual controls and options, it makes you want to try things differently than you've done it before.Great camera, and will likely be my \"go to\" camera for years to come.", "Date": "April 3, 2013"}, {"Title": "Best walkabout camera", "Author": "Samsuddha", "ReviewID": "RHPDTDRTFM6JA", "Overall": "5.0", "Content": "You know the photographic cliche that \"the best camera is the one which is currently with you\"? Well, this is the best camera to have always with you - so by extension, this is the best camera, period!What I mean is, it is small, very well built, and takes extremely good pictures with a sensor which is big enough to take prints at large sizes and provide some DOF control (though really shallow DOF can only be achieved on close focusing/ very wide apertures on a 'wide-normal' lens such as the one on this), and a lens which is very sharp across different apertures (more later); it is very versatile, and looks sexy. you won't want to leave this at home to give your shoulders some respite like I know you do with your DSLR (I own a D600 which is hardly the heaviest DSLR out there; and a 24-70, f2.8 and a couple of primes; but I find carrying such a kit a pain for just casual walkabouts around town).Did I actually say 'versatile' to describe a fixed lens camera? Yes. This is why: With a Fuji x100s, you don't waste time thinking about which prime to pull out of the bag (you in fact now don't even carry a bag, remember?), you just shoot. If you were used to zoom lenses, now you don't have to spend much time thinking about what focal length to compose at - again you just shoot - or you walk back and forth. the X100s also has quite an adept macro end performance - may not have the magnification and good working distance of dedicated high-focal length macro lenses, but again, versatility is the key here.  Besides, most fixed aperture good quality zooms are very heavy and you wouldn't even be carrying your camera to half the places would you find yourself carrying the x100s.Specific Observations -I will concentrate mostly on issues you may have on your mind reading other reviews.Autofocus - I had no problems with it - it is very effective and pleasant to use. The D600 equipped with the 24-70 f2.8 (and I use only the central AF-point) is probably as fast as autofocus gets, south of the high-end pro bodies.  The fuji x100s obviously doesn't reach such rarified speeds, but you wouldn't notice any difference in normal shooting conditions - unless your normal shooting conditions involve shooting pictures of a plain wall at night without lights on.Bottom line is: if you are worried about AF performance. Don't. It is fantastic; and the AF is VERY accurate, even more so than any DSLR I've used. I don't want to compare the speed with other systems like the Ollie 4/3 cameras like the EP-5 and the OM-D series because (a) I don't own those cameras ; and (b) its not about split second differences; its about whether the AF is fast enough for wide range of normal uses (Yes!) and deadly accurate (Heck yes!).I generally use the AF-S (single point auto-focus).  the AF-C mode is not that useful since the AF tracks when you are NOT half-pressing the shutter (which is kind of counter-intuitive for DSLR users) and locks when you do - which means it is useless for shooting moving objects in burst mode (which is mostly when we need continuous auto-focus).  If you need to get one shot of a moving object - you follow it WITHOUT pressing the shutter and then press completely at the decisive moment. It usually gets the focus right - but puts a huge onus on choosing the right moment.  Also you can use only the central AF point in this mode.  I agree the AF-C mode is not very useful.Manual focus - I've heard many complaints about the x100 manual focus. I never owned one so can't comment on that. But in case you are worried about any such problem on the X100s - don't.  Manual focus is a real pleasure. It is not a mechanical MF system like in DSLRs so it requires more turns (though it covers focal distance quite fast between 1.5m and infinity), but this is actually a big advantage for macro work and precise focusing (which is precisely the only time you should be using manual focus in an AF camera!).  Further, there are two amazing focus confirmation methods (the digital split view which gives you a B&W; patch in the center a little like a rangefinder focusing patch; and a focus highlight which make the focused areas sparkle like vampires in bad teen literature) - these tools make manual focusing much easier and more pleasurable than in modern DSLR systems (where there is no split prisms, and you have to trust the focus confirmation dot, which is not always accurate).Conclusion: MF is perfect and tailor-made for uses which generally require precise MF - like macros and precise focusing for still-lifes/ portraits. Similar in effect (though not in implementation) to the manual overide system in some high end DSLR systems, you can do a hybrid autofocus cum manual fine-tuning for very precise work.  To do this, press the AF/AE-Lock button when on manual focus - it auto-focuses; after that if necessary you can fine tune! so this is a good sub for manual override.Sharpnessbetween f2.8 and f11 it is superb; f2 is perfectly usable regardless of what CNET tells you (the largest apertures are always slightly softer but there is very little noticeable loss of sharpness at f2 on the x100s) and above f11 there may be some diffraction induced softness (this is the usual range for APS-C sized sensors); but f11 will give you enough depth of field for most purposes with a 35mm equivalent lens. Don't worry about sharpness; it is superb (owning to removal of the anti-aliasing filter we are told, but those are for nerds - the results are all I know personally).FilesThe image files are just superb - the jpegs look great enough right out of camera for casual use; and the raw files yield superb images with my workflow (Lightroom 4.x, PS6 and Nik Software Collection).This is the reason you will want to buy a Fuji.  I read about it but didn't believe it.  But when I saw the pictures - yes, even the out-of-camera jpegs, I was a happy soul.  There is just something pleasing about them.I like the jpeg picture settings - they are not generic and soulless 'vivid\" \"standard\" \"Potrait\" etc., but very unique looks, wherein saturation, contrast etc obviously vary, but the result is a cohesive artistic whole and not just a result of tweaked settings.  Yes they are named after popular films and that's a bit of a gimmick really (it really doesn't look the same - which is why I am still shooting film - an actual film look is just different!) but these are still very well done, IMHO. Just don't expect the results to look like actual Velvia or Astia slides seen through a slide projector (they different, not qualitatively worse)!Low-light performanceThe high ISO images leave any other APS-C sized sensor I've used in the dust (I've owned the D90 and D7000 and have used my Dad's Canon 550d). Granted, these are not the latest APS-C DSLRs but the x100s' high ISO performance matches even those from my D600 so I guess it probably outshines even modern APS-C sensors.  I am quite confident the pictures will have way less noise than any micro 4/3 camera can produce - just on account of the size of the sensor and the qualities of the X-trans processor. So would you rather have a slightly faster low light AF or ultimate pictures which have much less noise?My philosophy with high ISO performance is that you don't judge results by peeping at pixels of photos of diverging lines for noise (like review sites do).  It is more useful to see how much detail one can preserve once one applies proper noise correction software such as Define2 or even the built in LR or Capture NX noise tool.  With the Fuji, I can preserve as much detail as with my larger sensor-ed D600 and that makes this is a real winner for me. I can happily shoot at ISO 3200 and get usable files (hint: you get much better files shooting handheld at ISO 3200 and shutter speed of 1/40 then with ISO 1600 and shutter speed of 1/20). 6400 is quite usuable for casual uses though I am not sure about prints (I'd be amazed if ISO 6400 yielded good prints in any camera).All in all, best high-ISO performance one can expect not counting full frame sensors.ViewfinderI love this to bits.  Both the optical and electronic viewfinder systems have their advantages and with this camera (and the x-pro1) you never wish you had one or the other!  The OVF is very usable especially with parallax correction and tons of useful information which is overlaid - I find especially the histogram, the focus distance scale, and image plane level indicators very useful. the histogram especially is extremely useful to figure out whether highlights and shadows will be preserved and the focus distance scale is extremely useful to confirm whether the AF has fixed on the correct object. A common question regarding the x100s and the Fuji X system, as also my concern before actually trying the x100s, was dependable focusing with the OVF (without which the OVF feature is just useless), but owning to the focus confirmation signal (the focus box outline highlights in green) which is mostly accurate unless you TRYING to fool it (i tried and, alas, succeeded), and more importantly, the focal distance scale (which is more foolproof), focusing with the OVF is absolutely usable.I use the optical viewfinder more during harsh light or while  shooting into the light- the nature of electronic viewfinders is such that contrasts are too high to make out details in either the darker or very light areas in these conditions.  On the other hand, in low lighting, the electronic viewfinder can be quite useful to avoid squinting at dimly lit objects. Also the ease at which one can literally \"switch\" between the two (just flick of a lever) makes this work as even better than the sum of the parts as you can use both types of viewfinders to confirm the exposure and compositional aspects of the shot.  Of course, for macros, you can use only the EVF which is sensible since the parallax error would be too high to handle for the OVF and you need the EVF to confirm the focus since the distance scale is undependable for such precise requirements (where we are talking about fractions of millimeters when focusing for macros).Layout and usabilityEvery camera system is different.  Coming from another system (like me), there are some menus and layouts to get used to, but nothing I find too counter-intuitive or frustrating.  I think the Q button system which lets one access the common camera settings instantly, including some saved shooting settings, is a very useful tool. Most of the buttons which you need to reach when the camera is held to your eye are sensibly laid out such the OVF/EVF flick, the control toggle, the focus point selector and flash etc (though understand that there are constraints given the camera size -for example, the exposure mode is one of the buttons on the left side of the camera's back and as such difficult to get to because that's usually where one's nose is, when the camera is held to one's eye).  Camera ergonomics I believe increase with size and heft upto a certain point - I find my D600 and F100 easier to handle due to their bulk and contoured body; with the x100s the small size and svelte styling causes some fumbling on my part; however my wrists (and shoulders) don't pain anymore after a long day of shooting so win some, lose some.  Also note that, while smaller than full frame DSLRs or modern SLRs, it is actually of comparable size or larger than most of its actual competition like the RX1 and RX100, Pen cameras, OM-D cameras or GX-1/GX-7 type cameras. It is also only slightly smaller than my film Olympus OM-4T.  Its probably just that I am ham fisted..I have ordered one of those leather half-cases with extra padding on the grip area - hopefully that will make the camera easier to hold....lets see.I love the fact that it has proper dials for shutter and Exposure compensation, and that you change aperture with a ring in the lens - to be honest, changing aperture this way is necessarily a two handed operation unlike in a modern DSLR/SLR  like the D600 or F100 where you can hold the camera and flick the aperture dial with a single hand, but its a compromise I am willing to make for the vintage feel it gives. I also like that it doesn't have a PASM dial with lots of scene modes or art filters - In fact it doesn't have a PASM dial, period. One selects shutter priority by putting the aperture ring on Auto; aperture priority by placing the shutter dial on Auto and Program Auto mode by putting both on auto - just like an old time RF.  The lack of quick access to scene modes and art filters may put off some casual shooters but this camera I think is consciously designed for a more advance users who are aware of how to set up their cameras for different lighting challenges and uses such as \"night portrait\" \"landscape\", \"parties\" \"silhouettes\" etc by themselves and prefer to apply filters in post processing.  I should add that there are some art filters available (the usual toy camera, soft focus etc)- but these are hidden away in the shooting options and don't take up a dial on the top of the camera (unless you want to dedicate the Fn button to that. you don't really - use to it adjust the ISO).Conclusions:All in all, I am very happy with my purchase. Money well spent. I will be using my D600 for specific projects such as planned landscape outings and portrait shoots and the Fuji for most everything else.  Depending on Fuji's roadmap, I am seriously considering switching to the X-system as well when they bring out their next X-pro body.Recommended for:Enthusiast to professional photographers who would like a high quality camera as a constant companion.Not for:Inexperienced casual shooters looking for a camera for snapshots.  The controls and IQ are designed with at least a slightly knowledgeable user in mind. A beginner can definitely use it but there is a slightly steeper learning curve. There are better choices for snapshots, holiday pictures etc, some of which even provide comparable (though not equal) picture quality.  I think the NEX or 4/3 system cameras or even the superzoom cameras serve better for such users, and provide a more gradual learning curve.Scores (these are extremely subjective based on my own experience and not based on clinical test)Build quality, look and feel - 9 (only gripes: strap feels cheap, lens cap falls off easily)Picture quality (sharpness, noise, color rendition etc)  JPEG  - 9.5  RAW  - 9Focusing  AF  - 8 (points deducted only for not so useful AF-C)  MF - 8.5Viewfinder  - 10 (amazing technological achievement)Ergonomics and layout  - 7 (apart from points made above; would have preferred a dedicated ISO and AF-on button)UI and shooting options  - 8.5 (if you don't need scene modes or art filters)", "Date": "September 25, 2013"}, {"Title": "Longterm report", "Author": "HoldenRider", "ReviewID": "RFV5TPW1CQXWU", "Overall": "5.0", "Content": "I have over 40 years of experience as a professional photographer and to date I have liked very few compact Digital Cameras. I work with Canon's 1ds Mark 2 (3 & X) or my  Hasselblad H5d-60 nearly everyday.  All are the top pro cameras in their respective markets, with the latter costing $40,000. I have always carried a smaller \"pocketable\" camera that I use when I am not hauling around these beasts for work.Here is the problem: I am used to a high level of picture clarity. It is something I see everyday at work and unfortunately all the digital pocket cameras I have purchased to date have been major disappointments. Before digital, I would carry a pocket Rollie 35 or an Olympus XA. The lenses were nowhere as good as my pro cameras, but the film was the same.  It was usable and I could get great results. In fact,  in Grand Central Station (New York) there was a famous Backlit billboard with a picture taken from the XA that was over 200 Feet long.  The Photographer used  Kodachrome 25, and for it's day, it was impressive - Nice detail, Great color saturation.  You could walk right up to the image and see all that detail.Even the best compact digital camera's from canon, panasonic and many others fall short of anything near professional ( Sony of late is the exception here).  I have tried them all.  It's been a hobby of sorts.  Then came the Fuji x100s. The first time I opened an image in Photoshop I was shocked. I heard that the picture quality  was good, but I was not prepared for just how good. I thought I was using my 1d X, it was that good. I can tell the difference, of course, but it was minor.  After so many years looking at the best images from the best cameras and lenses you can buy, it is very hard to give up any picture quality.  I wanted the same detail only in a smaller package.  The image detail, skin tones, blacks and Bokeh, are so good on this camera, so clean, that I am not sure the average snapshot photographer can really appreciate just how well it takes pictures.  Add to that professional construction and the best, most usable, button layout I have ever seen on a digital camera and you have a near perfect camera. To be clear, the controls on this camera are better than any of my pro cameras.  Canon and Hasselblad should take note.There is more.  This camera has a hybrid viewfinder that lets you select between an optical viewfinder( with a nifty digital over-lay guide)  or a pure digital viewfinder.  It works perfectly.  This is not a gimmick - it is an essential photographic tool.  It all starts at the viewfinder and this is one of the best I have ever seen.  It is perfectly implemented. I thought I would hate the digital viewfinder, but is so sharp and detailed that it is at least 95% as clear and tack sharp as any one of my pro cameras.  In fact it is much better for 2 reasons:  1) it is unmatched in low light viewing.  Now I can actually check my focus before I shoot.  2) Right after I take a picture, for about a 1/2 second, the actually photo appears in the view finder  as a double check. It is just long enough to see if your exposure was spot on.  1/2 second may seem too fast, but it is more than enough time to see this.  More importantly, it happens so quickly that it is not annoying or takes away from the speed of the camera.  It is just perfect like so many other aspects of this camera.Moving on, there is a host of subtle, yet profound features that make everyday use, for a pro like me, so welcome. These were not features that were thrown in to get the feature list up, these were very carefully thought out.  One example: If you press the \"display\" button just a slight fraction of second longer than normal, the camera enters a silent mode and turns off  all sounds,  the focus light, all indicator lights and the display.  Great for times when you need to be discreet. I could go on about these sort of details,  but this review would be 10X longer and there are great reviews from guys like Ken Rockwell on this camera already. It is this attention to detail and pure design simplicity that make this, without question, the best, most pro usable compact camera I have ever owned PERIOD. It is that good. I can't find a single MEANINGFUL fault with this.Some people say a 35mm (equivalent) fixed lens on this camera is the one major drawback - and that it should have interchangeable lenses.  If you do think that,  you are not the intended user for this X camera.  This is a \"second, carry-all-the-time, Manual camera for pros\"  ( and serious enthusiast).  It was made that way.  There are no compromises, None.  That is why it cost $1300.  It is steal at that price for this quality.  Considering that the next step up is a $6000 Leica M ( without a lens).  Somebody at Fuji actually talked to us.  These guys are really on it.  I think it is sheer brilliance, and my favorite feature,  that there is simply one perfect single lens on this.  What you get is a contrasty, super fast (f2)  tack sharp gem.  My old \"street\" f nikons always had a 35mm 2.8 for everyday use anyway,  so did my Rollie and the XA.  Even, my on venerable leica MP.  I have many lenses for the my Leica, but the fact is, the one I actually KEEP on my camera is my 35mm f/2 Summicron.  This lens seems modeled after that lens.  I love my Leica, but that said, in many ways  the X100s is the camera Leica SHOULD have made - Better viewfinder ( both Optical and Digital),  lighter, faster and an the overall picture quality is close to 90% of the Leica (that is saying a lot).  I find this camera more enjoyable to travel with.  I was impressed the moment I pulled this camera out of it's hIgh quality box, and it  continues to earn my respect with each shot.I have been waiting for Leica to make this camera for 40 years and yet somehow Fuji is the perfect company for this.  They seem to make beautiful, innovative, classic cameras that are a quality level between Nikon/Canon and Leica.  To be clear, it is a quality level ahead of anything nikon or canon has.  This is not just my opinion, anyone that handles the x100s  gets it.  Quality is just something you have to see and feel in person to appreciate.  Maybe it is details like the liberal use of Magnesium, or the machined dials or perfect click movements.  Even the camera strap eyelets  have a solid chrome insert inside the eyelet.  That is just that insane attention to detail I am talking about.  Nothing is plastic here save for the battery/memory hatch that is reinforced with a steel plate, or the  the thick, tough, high quality, hinged USB/HDMI door embedded in the hard rubberized body.  This is not the rubber plug that you see on too many cameras. It opens and closes perfectly. There are no cheap click indents.  Everything opens and closes positively and silently. It is designed to last without fail.  Clearly this is a very very high end product that will appeal to those that care about this type of quality and about a camera that was designed to last a very long time.For those of you that are not familiar with Fuji, Fuji has been around in the pro space for sometime (think GX680 6 X 8 ).  Unlike Nikon or Hasselblad, Fuji makes all the important parts like: the camera bodies, processor,  digital viewfinder, CMOS sensors and all of their lenses!  In fact, my $40,000  Hasselblad H5 uses \"Hasselblad\" Branded HC lenses that are in fact made incredibly well by Fuji in Japan!  In short,  one of my all time favorite cameras.  It has it all -  the look, ergonomics, usable features, outstanding image quality (in high and low light ), great materials, Brilliant construction and pro operational simplicity (no gimmicks).  About the only problem with the camera whether to get it in black or Silver - Both look great.  I have it in silver with a  Cognac brown kobe strap made by Artisan and Artist.  What a beauty.", "Date": "January 10, 2014"}, {"Title": "Great camera, but not perfect", "Author": "Ben", "ReviewID": "RT8M3WGCDVZG7", "Overall": "3.0", "Content": "Currently Fuji x100s is my main camera, I've used it for 1 month and even ordered some prints. I sold Olympus OM-D E-M5 because I have easier time with Fuji x100s skin tones and color. Also low light photos and video is better in x100s. I rated this camera three stars because of my cons. If this camera was cheaper, this would have been a 4 star camera. So I read Zack Arias review on Fuji x100s and he says that not even once he wish he had a different camera with him. In my shooting I found this to be mostly true, the only time I wished for a different camera is in midday sun, see my cons on dynamic range. Fuji claimed fastest auto focus with x100s, really? This is getting close to Nokia's camera phone marketing. This is another reason why I rated this camera 3 stars. Auto Focus is not fastest, it can also be slow, but still good enough for me to sell my OMD. Of course OMD is so much faster, its not even in the same league.Pros- Very good skin tones- Great low light images and video- Very good Built-in flash- Good 30fps Video- Stereo mic- Fast camera performance.- Small size, fits in most of my pocketsCons- Auto Focus, still a little slow- Dynamic Range, it is good but pictures look too contrasty with Auto DR in midday sunlight, in my opinion, this is where i miss Nikon- Good video but has quirksColor & Olympus OM-DThe reason people stayed with Fuji x100 is because of the color and skin tones. x100s color is very good but different. I've read Robing Wong's opinion on Fuji x100s and he mentioned that color looks very similar to Olympus color, I agree with him. I have done mini shootout with Olympus OM-D and Fuji X100s, i took pictures of my family. at the same time with both cameras and then showed it to my wife after minor adjustments in Aperture. (this is what i would normally do with my photos) First thing my wife says is that how similar they look and she had hard time choosing a better picture. After i told her to select a better pictures based on skin tones, Fuji won, mostly because OM-D is too contrasty IMO. Also in my opinion Fuji x100s gives me a better image under most conditions that matter to me. in my mini shootout, OM-D actually produced better images few times under some low light shooting. So camera is not perfect, but very good. In general shooting, I feel like i get a little better people colors with Fuji, especially with my newborn. x100 is the best camera i tried for newborns, IMO.3d PhotosI read complains about Fuji x100s not producing 3d like images, I'm really not seeing that but then again I never shot with Leica. Just turn noise reduction to -1 or even -2. I have seen noise reduction flatten faces a little so I keep mine at -1 and also raw files show plenty of 3d in Apple's Aperture software, not sure how it looks in Light Room.VideoI only buy a camera if it has stereo mic and a very good video. x100s video won for me vs OMD because of better low light image and color. Yes, you really have to make sure there is no shake and don't shoot 60fps. 60fps produces really really bad video, just don't try it. 30fps video is the reason why i kept Fuji x100s and sold my OMD. OMD gave me a very steady and sharp video but I found color to be better with x100s and less noise.", "Date": "May 1, 2013"}, {"Title": "Point & Shoot King?", "Author": "Cackling Crow", "ReviewID": "R245S13C3L0YTO", "Overall": "5.0", "Content": "Ok, I know the X100S is not a point-and-shoot, but it's just as much fun.The only other camera I own to compare this with is my Canon 7D, also an APS-C sized sensor.  Otherwise, it's image comparisons.  So let's compare.  I prefer the X100S over the 7D for:Image Quality (The reviews are correct; SOOC JPEGS are fantastic.  RAW shots look fine to me after the LR update.)Viewfinder is awesome, both OV and EV (So is handling the camera like a P&S; and watching the 2.8\" LCD on the back.)Weight (It's about 678 pounds lighter than a DSLR.)Film Simulation (Astia and B&W;'s are especially amazing.  Fuji color is greatness!)Cost (Believe it or not, I would have rather spent all this scratch on the X100S and gotten the amazing IQ right out of the camera than spend the same amount on the 7D and then have to turn around and then spend the SAME amount on a lens good enough to get images like the X100S.  Don't spend money on a wide L lens for the 7D, buy the X100S, have some fun and fuggedaboutit.  Sorry, Canon!)Fun (Yes, the X100S is a JOY to shoot with.  The big DSLR's are like carrying around a baby all day.  Does baby need a new 13 pound lens?  Aww[...])Lens (I like the lens on the X100S.  It's definitely not the best I've ever used, but I don't see the problems some people say they are seeing at f/2.  That said, I'm not a \"pixel peeper.\"  I believe a photograph speaks for itself, flaws included.  I did get some light leak shooting into the sun, even with the lens hood on.)High ISO Performance (I bought this camera for my hopes in the ISO.  The 7D doesn't even come close and I would put it up against the full-frame bad boys also.  I can most definitely use images at 6400 from the X100S.  I can use some images from the 7D at 3200, but then I've got to de-noise to the point where people look like they're all in the The Dark Crystal.  Y'all remember that one?  Dorks!  High ISO is amazing, nuff said.)Camera Styling (You'd better enjoy talking to strangers.)So, what don't I like?I don't like the $2.00 strap that comes with the $1300 camera.  Why not just give me a piece of twine, Fuji?  Or a shoestring...  At $1300, a case would also be nice.Despite Fuji claims, the AF is not the fastest, especially in lower-light.  However, it's not awful; perhaps even completely acceptable.  It's also not the sports-shooter the 7D is; not that it claims to be.The camera also seems to have difficulty waking up from sleep from time to time.  It's almost faster to turn it off when not shooting.Some of the menu choices are a little iffy.  You can't change the options in the EVF without looking through the EVF.  So you're trying to look through the EVF and push the menu buttons at the same time.  Oversight?  Firmware fix?I shot a 2-day charity event with the little X100S up against another photographer with a Nikon 800D and another with the Canon 6D (true story.)  I was worried about the little X; I had only had her for about 5 days.  The X100S held her own against the big boys.  Image quality is just THAT good.  SOOC.  JPEG.  I did go through 3 batteries each day of the shoot; I don't like it that auto-shutoff doesn't go less than 2 mins.  A small nuisance for the payoff...I still like my 7D, but the X100S changes the game for me.  Digital photography is getting better and smaller.  The Fuji X100S is a tiny juggernaut in the world of extremely heavy titans.  Bravo, Fuji!  Encore!Addendum:  After using the X100S for over two months, I still love the camera.  I don't know what it is, if it's the metering system or what, but the camera seems to have trouble locating the correct exposure.  I don't know if others have had this issue, but if I shoot anything in auto mode, (aperture, shutter or ISO) the exposure is not ideal, usually overexposed.  The upside to this is that the camera is forcing me to shoot fully manual, which is helping me become a better photographer.  Luckily, you can set the big 3 very easily on this camera.I've seen a slideshow with stills from this camera and others on a 46\" flatscreen TV; the X100S IQ is just amazing.  The photos taken with this camera stand out above the others.  I've heard somebody say this camera is a \"Leica killer.\"  That may be a reach, but it ain't far...  I'd still buy and pay full price for this machine.", "Date": "April 20, 2013"}, {"Title": "\"The New Leica\"???", "Author": "G. Ma", "ReviewID": "R1OV37C3MEF8V7", "Overall": "5.0", "Content": "For this purchase, I blindly heeded the gospel of David Hobby, who posted a 40 minute walkthrough on the X100s and Zack Arias, who proclaimed the X100s \"the new Leica.\" Initially, I was teetering between the X100s and the X20, a much cheaper alternative and to a lesser extent, the Fuji X-E1. I figured if I was buying a more portable option for my DSLR, I don't need another set of lenses to add to the bulk. Thus, I was all set on the X20, but read minor quibbles here and there, with the slow on/off lag being the most egregious of them. Ultimately, I went with the X100s and I couldn't be happier. Paired with an Eye-fi + mobi SD card, the pictures come out well enough straight out of camera, I can share online without relying on Lightroom for post-processing. Skin tones are spot on and it's got a myriad of filters/features I've yet to experiment with.My only HUGE complaint, which'd potentially knock my review down a whole star, is the battery meter. Twice now, I've left the house with the meter showing full bars, only to transition to half-bars, which is synonymous with 'you're shit outta luck' because a dead battery follows a minute later. In each case, they were milestone moments for my infant daughter that I had to defer to the iPhone camera. Like Hobby says in his review, I/we sincerely hope Fuji offers a firmware update that'll give a more accurate battery reading. Other than that, this is a solid camera that I can take with me where ever I go, even though it's a little heftier than standard P&Ss;, which I'm totally not lumping the X100s in the same category as!", "Date": "June 23, 2013"}, {"Title": "My Leica Is In Serious Jeopardy!", "Author": "Robert J. Steiner \"Bob Steiner\"", "ReviewID": "R3189ZV7DUFUK", "Overall": "5.0", "Content": "As a long time Leica shooter and professional photographer, I was somewhat skeptical of this new breed of less expensive, rangefinder-like cameras. But that's what Leica does to you - the lenses and build quality of their cameras are second to none - hence, one can't help but become a Leica snob. And this was my life for years, right up until the M9 - which to me created the perfect balance between digital and film camera. So, there I went, carrying around my M9 and 3 Leica lenses everywhere - until one day, panic struck - suddenly I was so aware of the cost of this system that I was afraid to put my camera down, in fear of it getting stolen - afraid that I would accidentally drop it, and/or crack one of my $3-4000 lenses. That's when someone told me about the Fuji x100, and why I should consider it as a backup to the Leica. I read the specs but wasn't totally convinced (again, the Leica snob factor kicking in). Then, as if sent from heaven, came the Fuji x100s. Now you're talking, I remember saying - finally, we have a camera that does everything my 7k M9 does (actually more!) at a fraction of the price. Okay, this all seems good on paper, but let me put it to the test. Long story short (lol), after several weeks with this camera, it's become my primary shooter. Here's why: good build quality, lightweight, fits well in my hand, live mode and/or through viewfinder focus, 1080p video, fantastic Zeiss lens, and, most importantly, the ability to zoom in on a subject (once focused), and pinpoint accuracy using the focus ring. Any Leica shooter will tell you that this feature alone is worth the price of x100s, as the old rangefinder way of 'trying to get two squares to match/overlap' for focus, was to me, a completely inaccurate science. Bottom line: A Leica is a Leica - and their lenses are unsurpassed - however, if you want exceptional quality at a fraction of the price (who wouldn't?), then this is your camera.Bob Steiner[...]", "Date": "July 9, 2013"}, {"Title": "Hard to keep silent.", "Author": "H.Kim", "ReviewID": "R29F3JCNLU8CJ8", "Overall": "5.0", "Content": "I actually ended up purchasing this camera at a retail shop in Hong Kong (couldn't take the wait), but my extreme satisfaction with this purchase has led me to write my first ever Amazon review.This is a fantastic camera. Colors pop and jpeg images straight out of camera are pleasing and have a smooth quality to them. Having used the X-Pro1 before, image quality doesn't lack for anything, and I can say with certainty that the AF is the best of any of Fuji's offerings.Personally, I use the focus-peaking feature much more often than the digital split-image, but in regards to MF compared to X-Pro1, it's like night and day. It is much closer to the feel of a range finger than ever before, and I use MF for street photography much more than I thought.Menus are generally intuitive, and the main point is that this camera is a joy to use. It inspires me to shoot more.On a more shallow and superficial point (and let's admit that it plays a big part) this camera just oozes something fierce. The glint in the eyes of people who see this camera almost makes it worth it.Just one piece of advice: if you have any trips to Hong Kong planned in the near future, definitely purchase this camera at Fortress, which a major (read: dependable) electronics chain store. Hong Kong has no sales tax, and this camera ended up costing me about USD1235. PLUS, they included two 16gb class 10 SD cards, a decent tripod, screen protector for back LCD, cleaning kit, AND the official leather case for the previous model X100 (which retails for over USD120 and fits the X100s perfectly). Doesn't get any better than that anywhere.", "Date": "March 21, 2013"}, {"Title": "The new Black Fuji X100S is THE BEST CAMERA I have ever owned !!!! period", "Author": "John J. Goodman \"iPhone crazy\"", "ReviewID": "R20ZG6ONH4M7Y1", "Overall": "5.0", "Content": "Now I see why all the REAL photographers absolutely love this camera. It takes such sharp pictures. No wonder it recently got WORLD'S BEST DIGITAL CAMERA !!! The colors it produces and the speed is phenomenal. Incredible for the size of camera and I have had so many expensive cameras. Even at $1400 with tax. This is the bargain of the century. It feels so perfect in your hands and it is stunning when it comes to Bokeh photography. This camera is so easy to use as well. You can set everything to auto and have professional photography for free. But then it also has so many features you can learn to be a great photographer in no time. I love the control and adjustments. Also all real true professional photographers I know use the x100S and admit it is better then there over $10,000 cameras. It looks just like an $8000 Leica yet is leaps and bounds better. Just make sure and get the x100S with newest firmware update. ( the only way to make sure of that is to buy the new BLACK Fuji-film X100S. But I understand very easy to update old x100s but make sure the S is on end or it will be significantly slower then this ((( awesome camera ))). I love this camera so much I can not put it down. And my children used to dislike their picture being taken. Now they don't mind at all. Also for street photography this is the king. My thought is it is a lot less intimidating then one of my huge Nikon DSLR's with a battery grip on etc. Because you cant't even see my face behind camera. Plus the x100S is SILENT --- no noise. Google Fuji x100S and you will see everyone loves it except diehard Canon photogsssss or others that don't like something this small and unassuming. It is almost like we are afraid people wont think we are pros unless we have the big cameras. I have to admit the black color really is sleek but I even love the more retro looking silver addition as long as it is the S version you will love this camera. WOW and I am a gadget freak. I have owned every type of ipad and iphone and apple computer and yet this FUJI camera beats them all out. And I was a die hard Nikon man until this camera. This is about all I carry now unless I am needing to have my 300 m zoom lens on my big heavy magnesium alloy that weighs so so much more than this wonderful light yet perfectly weighted ( heavier then point & shot ) #1 camera. I could go on & on because I want Fuji to make more cameras like it in the future", "Date": "April 17, 2014"}, {"Title": "An amazing camera once you learn it", "Author": "Yip Sun Eng", "ReviewID": "R301WROQ3EHSVP", "Overall": "5.0", "Content": "First of all, before reading any more of my review on the Fuji x100s, drop all thoughts and presumptions about what this camera should do. Drop all thoughts concerning auto focus, ISO, and handling performance. Forget that this camera lacks modern features such as image stabilization and NFC. Now with a clear mind look at what this camera is. This camera is all about bringing the photographer back to their roots and hone their skills in the art of image capture.Let me say this right away, this camera is not for beginners looking for an auto mode and image stabilization to get the job done. That would be an insult to what this camera is capable of doing. They are better off with a point and shoot or a mirrorless alternative. This camera isn't about speed either. When focusing, even with the improvements over its predecessor, it pales in comparison to my OMD.So it seems like Fuji made a lemon right? Not at all, the x100s is a wonderful camera that can take outstanding photos once you understand its limitations and fully utilize its strengths. The lack of image stabilization may seem to be a deal breaker for some, but remember that image stabilization is an aid to help the photographer. Too often the user is dependent on aids such as image stabilization to get a sharp image. With the x100s, you have to do image stabilization the proper way, with a suitable shutter speed (1/focal length minimum). Fortunately the x100s is happy to oblige with its fast 35mm 2.0 lens and usable ISO range from 100-6400 so that obtaining a fast enough shutter speed is pretty easy. This is what I mean about learning the camera; the x100s is capable of producing stunning images that shames my OMD and other DSLRs provided that you learn how to extract the most from it.The viewfinder of this camera is simply superb. Fuji's setup effectively merges the benefits of an OVF with an EVF. With the OVF, there is no delay when panning around the scene. However the main issue with using the OVF is that with the uncertain auto focus system, you may not know if the image captured was in focus at all. This is an issue with the x100s, the auto focus system can get confused easily. Good thing that we can review the images and reshoot if necessary. Another good thing is that the manual focusing aspect of this camera in combination of the focus aids such as the focus peaking feature, allows you to focus even when the camera refuses to.Another great feature of this camera is the built in ND filter. Although the shutter speed limitation of 1/4000th may be troublesome, using the ND filter can help get around this issue.The best feature of this camera is the sensor. I have no issues using ISO 6400 when the lighting situation isn't optimal. Yes the image may not be as detailed my full frame camera, but photography is about capturing that moment and having an image that isn't as detailed nor as clean is preferable to not having the image at all. From my experience, the ISO performance of this sensor matches or is better than my OMD.So there you have it. From my experience with this camera, it has been wonderful to me. I have been able to capture some amazing photos by learning to deal with the limitations of the camera. Yes I can take amazing photos from my other cameras, but this camera has a specific look and feel that the others doesn't seem to have. This camera is more like a companion camera more than a DSLR replacement. This is the camera you take when don't want to lug around your DSLR with the 35mm lens. This is the camera that you carry around that won't draw attention when you try to discretely capture street scenes. If you decide to get this camera, spend 2-3 weeks with it, shooting solely with this camera. Carry it around with you everywhere. You may initially find the task daunting, but it will be well worth it.", "Date": "January 20, 2014"}, {"Title": "My Fuji X100S, Finally!", "Author": "MetalMan", "ReviewID": "R2J88CKCKAYM4U", "Overall": "5.0", "Content": "WOW!!!  What more can I say!  I've lusted over this camera for most of this year and finally pulled the trigger as an extravagant early holiday gift to myself.  I'm hoping to gain some quality time with this camera over the next few months in order to be prepared for a couple of upcoming \"life\" events in Spring, 2014; the birth of my first grandchild and a medical school graduation.I've been taking photographs since the early 1970's and used my work to help pay for my college education.  I still have my old Nikkormats, Minoltas, multitude of assorted lenses and other kit.  I was a reluctant convert to digital photography and took the first plunge in 2005 by purchasing a Canon G6 followed in 2011 with a Canon G12 both of which have served me well.  I find that my photographic adventures are now more confined to travel and family and could not justify the expense of investing into a DSLR system whose performance (sensors, speed, etc) seems become obsolete within a year or two as the technology improves.Although the picture quality of both Canons have been remarkably good overall and the cameras are both still very serviceable, I must admit that I have missed the ability to exert more control over the photographic process.Now, having found the X100s, I believe that my infatuation will last well past the next iterations from Fuji.  What more can one ask for?  This camera is truly an instrument to behold, a work of art.  In hand, it exudes quality.  Just playing around with the camera in the last week, I have focused on still life's around the house.  The images captured by the X100S have an amazing sense of color saturation and depth; my daughter said they almost look 3-D.Am I satisfied?  Absolutely!  I feel very fortunate to have become the owner of such a remarkable camera and look forward to exploring its vast potential.", "Date": "November 26, 2013"}, {"Title": "Superb! This is the digital M that I've been waiting for...", "Author": "Otter", "ReviewID": "R2S9CL00H2N7SA", "Overall": "5.0", "Content": "My background... I'm a people photographer. I've owned dozens of cameras for the past 30 years from all manufacturers. Some of my favorites were the Leica M3 & M7, Olympus OM-1 & diminutive XA, and the original Canon 5D. I recently tried the highly acclaimed Sony RX100 and disliked the user interface. Quickly sold it on a well known auction site.Then I heard about the Fuji X100S. Did some more investigation and began to realize that this MIGHT be the digital camera I have been waiting for after all the years of missing my Leica M's (I did own the digital M8 for a while but was never very impressed with it). So I ordered the X100S from Amazon and quickly got it in my hands thanks to Prime.What do I think of the X100S now that I have had some time to use it? I'll cut to the chase. Fuji has hit a grand-slam home run. This camera is everything I had hoped for and more. Everything about the image quality, ergonomics, and user experience is superb. It is eerily silent. I love the quickness and tactile feedback of rotating knobs and clicks versus working with a menu-driven camera. Digitally speaking, this camera is a more Leica-like than anything that has come out of Solms. It is the digital M that I was always hoping for. Thank you Fuji.Almost all of my current DSLR equipment is now being looked at critically and readied for sale. I will probably keep one DSLR body and a few lenses for certain specialized purposes, but the X100S is the camera that I now take with me everywhere. It has liberated me from the DSLR sore shoulder and bulkiness. I'm officially over it. The X100S is a game changer. Thank you again Fuji.", "Date": "June 18, 2013"}, {"Title": "My experience..", "Author": "Ken", "ReviewID": "R3NBHXT6UDPYT6", "Overall": "4.0", "Content": "I'm sure if you're looking at this camera, you've probably read enough reviews and specs about it.. there's definitely no shortage on the web.  I'll just share MY experience with it:Why I bought the X100s:1. Compact size - I already had a Canon DSLR and a Sony NEX.  The DSLR was just too bulky and heavy as a 'take anywhere' camera and the NEX had a very compact body, but the lenses used would double its size.2. Manual Controls: I loved how my DSLR handled, but was not thrilled with Sony's menus and lack of quick-set dials.3. Viewfinder: My NEX lacked a viewfinder.  I thought I could live with this as a trade-off to a more compact body, but I missed it greatly - especially in the sunny outdoors.4. No GAS (Gear Acquisition Syndrome):  Buying the X100s let me focus on taking pictures with what I have, instead of the 'what if I had a different lens'..What I liked:1. It hit all of the above points that I was looking for.2. Being able to choose between OVF/EVF/LCD based on the situation is great.3. It is much more of a rewarding shooting experience. Makes you slow down and think about what you're shooting and pushes you to understand the effects of your settings.4. Quiet shutter:  There have times where I have passed up photos with my DSLR/NEX because I didn't want to draw attention to myself with the shutter sound.  The X100s shutter is MUCH quieter.5. Manual focus: Manual focus is great and I've found using it much more than expected.  Probably because the AF can sometimes be iffy (see below).  I still shoot probably 2/3 of the time in AF though.Didn't like:1. Auto-Focus speed and accuracy in low light.  The AF will hunt in low-light and can take a bit to get focus lock.  It can even miss focus in good lighting occasionally (tho seldom).2. Battery indicator.  The battery life is actually much better than I was expecting based on all the reviews.  It's been very acceptable for me, tho I rarely use the LCD.  I think the main issue is that the indicator has only 3 bars that does not go down evenly.  It will show full for what feels like 2/3 of the battery life and most of the remaining 1/3 will be on two bars.  Once it hits one bar, you've basically have a few shots left.  This isn't a problem for me as spares are cheap and work well.3. It would be nice to force the preview image to show only on the LCD when in OVF-only shooting mode.  You can set it to eye-detection, but it will show the image on the EVF if your eye is still up near the viewfinder.  Sometimes you want to shoot a few then take a peek at  the LCD instead of constantly having the OVF toggle to EVF back and forth.4. Focus peaking color is only highlighted in white.  It would be great to choose red or a different color in some scenarios.Overall, it's a great camera.  I did take one star off for the auto-focus issue which I hope they can further improve with firmware.. the rest of the negatives I found are pretty minor. If you can live with the fixed focal length (and it's a big IF) and understand the limitations of a camera of this type, I think you will be happy!.", "Date": "March 21, 2014"}, {"Title": "My Favorite Camera!", "Author": "Paul R. Deatherage \"Lazaerus\"", "ReviewID": "R8YF2KKM3PS4D", "Overall": "5.0", "Content": "Purchased this camera to use on a vacation to New Orleans and Corpus Christi so I wouldn't have to carry a full size DSLR and lens, plus all the other goodies that I would typically carry with me.  I have 3 Nikon bodies (baby D60, D300s and D700) plus a great collection of trinity glass to go with them.  Typically my D60 with a 35mm f/1.8 lens is my travel camera, due it's small size and being light-weight makes it ideal.  The D60 has a lot of shortcomings though, so I wanted to get something that would be light-weight, small and inconspicuous, plus I wanted something that would perform as well as my D700, especially in low lighting.I had seen images from the original X100 a few years ago and I was very impressed, so I revisited Fuji to see what they were all about.  After reading hundreds of reviews and looking at images from the newer X100s I was sold.  Purchased the camera through amazon along with some accessories, including 2 additional batteries (you will need these if you purchase this camera) and insurance.  Of course I received the camera and everything I needed in record time (thank you amazon!) and had some time to test her out.I had read about some of the short-comings of this camera and I must say that there is some truth to the slow focusing, but only when you're in low neutral lighting, otherwise it performs very fast and accurate.  I have seen the same issue when I used a Nikon D4 (which is claimed to be one of the best and fastest AF's out there) this last summer, so it's not anything new or unusual.  Another issue that I had read about was slow starting, which is kinda slow, 1 to 2 seconds when using the On-Off switch and maybe 3 to 5 seconds when waking it up from an auto shut-off.  Both of these \"issues\" are blown away by the sheer power of everything else this camera does in my opinion.This camera is a joy to work with and the images are spectacular!  Everything about this camera has exceeded my expectations 10 fold, and I'm still learning more about it every day.First and foremost are the images, and the ability to change film types depending on what you want for result ~ First Class in EVERY way!Low light shots exceed what my full-frame D700 can do, which absolutely amazed me!  I personally thought that my D700 outperformed the D4 when shooting a concert at night this last summer, and this little X can do it better!!!Love being able to view through the viewfinder with my right eye and look at what I'm shooting at without any obstruction with my left eye... it really does make a difference when making the right capture, especially when there is a lot of activity, like Bourbon St. at night!In less than 2 weeks this has become my favorite camera to shoot with.It's appearance is retro and very cool, and all the knobs and dials are perfectly placed and easy to use.If you want a simple point-and-shoot camera this is NOT what you're looking for.  If you want a fixed-lens camera that can do just about everything you want, then this is the one.", "Date": "December 2, 2013"}, {"Title": "Small enough and crazy sharp", "Author": "Shane O. Laake \"camera nerd\"", "ReviewID": "R1YACPFHU54I1W", "Overall": "5.0", "Content": "If you're looking at reviews, you probably have an inkling why this amazing little camera costs 5-10x as much as compacts, and you may even start to recognize that this is a steal compared to spending 10x on a Leica setup.  If that describes you, go ahead and pull the trigger, if not let's discuss this more.Three things that generally are hard to get without spending a good chunk of change are a great lens, a great sensor, and a compact usable package to make it all work.  This offers all three, and it does so at a great price.First off is the sensor, as that's often where people first draw there attention.  16mp is perfect.  12-16mp of great pixels is all just about anyone will ever need.  Here you have 16mp of great pixels.  Fuji's sensors forego a resolution depleting anti-aliasing filter due to their innovative design, this helps make an already great sensor even better, as you don't lose sharpness by design (as 99% of comparable cameras do).  Additionally the sensor is close to the lens (no mirror), which allows light to better strike the sensor, allows for smaller lenses, and most importantly more technically sound designs.Secondly there is the lens.  Ranglefinders and other non-SLR designs allow the lens to be placed right up to the sensor, which is a very sound design, especially for normal and wide angle lenses.  Leica, Zeiss, Voigtlander, etc... make great lenses for Leca cameras, but they are all beneficiaries in the cameras lack of a mirror to put the lens in the wrong place.  It's Amazing Nikon, Canon, et al get as much as they do with their lenses (only recently have they truly mastered wide angle SLR lenses).  Thus the Fuji 100s starts off in a good place, but it also delivers outstanding optics.  I see this as a replacement for getting the same lens in your SLR lineup, and as such can start to pay for the price of the lens.  It's as sharp as anything you'll get from Nikon or Canon.  Plus it's compact and attached to that great sensor.As for the final element, the compact usable package is what's so novel with the X100s.  It offers an optical viewfinder that can also act as an EVF via its unique hybrid design.  The design adds some bulk, but honestly the whole setup is a remarkable package.  There's also a built in flash, which benefits from an extremely fast flash sync (if you don't know how this helps, worry not, as it's capabilities make your life easier).  Likewise the built in ND filter helps with lighting (again it's a good thing).  The ergonomics are a bit of a mixed bag at first (coming from a Nikon SLR), but it becomes intuitive.  The quirks and issues of the X100 (especially the AF performance) are all fixed here, so there really are no negatives.I wish this could be had for $500, and one day it will, but for now, there's no better solution for the money.  It's fast, easy enough to use, and creates awesome images.", "Date": "December 23, 2013"}, {"Title": "DISCLAIMER: Beware of Serial Number when Purchasing", "Author": "Andy Chon", "ReviewID": "R2S5VP31NMCT93", "Overall": "5.0", "Content": "Hey guys.Frequent Amazon customer. Please please please when you're buying a used or even new X100S, make sure they are an authorized dealer of Fujifilm. I've done tons of research on this and spoke with Fujifilm in regards to serial numbers and their X100 and X100S models. If you are in North America, the serial number has to contain an \"A\" or else it is considered gray market and Fuji will not honor the warranty!!! Google X100S Serial Decoding for other regional codes. A lot of people have been tricked by shady sellers so please be careful. Cheers!", "Date": "April 10, 2014"}, {"Title": "Nipping at the heels of DSLR shooters", "Author": "NyReckDiver", "ReviewID": "R2TE0XJMXI5LWY", "Overall": "4.0", "Content": "As a long time semi-professional Nikon DSLR Shooter (D100, D200, D300s, D800), I am happy to say, Fuji won me over with this camera to the point I dumped my Nikon gear and began retooling in anticipation of the Fujifilm X-T1 16 MP Compact System Camera with 3.0-Inch LCD and XF 18-55mm F2.8-4.0 Lens.  However, this camera will always stay in my bag. Simply put, it brought back my enthusiasm for shooting.  But, it is not perfect.I was given the Fuji X-100s as a gift.  Being so used to very large and heavy cameras as well as lugging around a ton of gear, I initially rejected the capabilities of the X100s, without even trying it. This was especially true given the reported issues (quirks) of the previous X100, since corrected via firmware upgrades.  However, after trying the camera and processing 1000's of images, I slowly swung to Fuji's side and found myself shooting more whereas before, I came to view photography as a chore to be avoided, so much so, I rejected new clients(part-time).Coming off huge and bulky DSLR's, you will have to get used to handling this camera. This camera is by no means a typical point and shoot that fits in a pocket, but it is smaller than a DSLR.  Build quality is incredibly good, feeling solid.  The external controls are intuitively placed and it is not hard to learn.  Within a week, it will become second nature.  The feel of the X100s is simply exquisite compared to a D800 or D300s. The Electronic Viewfinder, which I thought could never replace an optical viewfinder, does a very good job and is near perfect (can't wait to see the XT-1).I found very little lag, especially for my style of shooting (portrait and landscape).  But, it will take a few weeks to get used to the switch. Also, keep in mind that the X100s offers both optical and EVF modes. I also took to Fuji's \"Q\" buttom quick access to the menu and common camera settings instantly.Image quality is SUPERB across the entire RAW or jpeg spectrum.  The colors are slightly different than what I found with Nikon, but not worse. Fuji has had a distinct color to it that most people can discern and I love skin tone results. A look that I love. High ISO performance is also very good, though I never ever met a photographer that shoots at the extremes except for testing purposes. with the fixed 35mm f/2 lens, I had no issues in low-light performance and found Auto Focusing to work fine.  In fact, I was surpised by the speed of AF.  Of course, I found the Nikon D800 faster and more accurate in high speed sports situations (of course). Manual focusing is a dream with this camera.  There are two focus confirmation methods, 1) digital split view which gives you a B&W; patch in the center similiar to some rangefinders and 2) a focus highlight which makes the focused areas glitter.The most critical aspect (for me) I am missing in a transition from Nikon to Fuji is off camera TTL lighting.  I am used to firing 4 SB-900's on PocketWizards for maximum creativity options.  Fuji does not provide this capability and I will miss it. However, I will not miss carrying around all that gear.The bottom line is that this camera is a serious threat to DSLRs, especially for use by advanced amateurs.  Clearly, professional and commercial shooters will not make the move en masse anytime soon.  However, I suspect most others will opt to dump DSLR's in favor of cameras like the x100s or the XT-1. Point and shoot folks should not treat this camera like a point and shoot- it is not.  They will get frustrated if they try.  This is a serious camera for serious shooters who do not shoot on auto and understand shutter speed, aperture, ISO, and all the intricacies. It does not make photography easier.  It makes it more pleasurable.", "Date": "March 31, 2014"}, {"Title": "Fuji, once again, almost got it right", "Author": "JB123", "ReviewID": "R3GHXJCZMSIJNF", "Overall": "3.0", "Content": "What do it want a camera to do:  exactly what I tell it to do.I don't want a point and shoot.  Today's ever escalating arms race of shoving more and more bandaid technologies into tiny cameras allowing the user to do nothing more than push a button is really frustrating.  I know how to take photographs and I just want a camera that will not get between me and the image I want to capture.In film days I always used small fully manual SLR's.  That is what I was comfortable with.  Digital SLR's have always been frustratingly big and over saturated with automation features for my taste.  I have heard arguments that SLR have to be the size they are due to the mirror.  Nonsense.  The Pentax K1000 (one of my all time favorite cameras) measures just 94mm H x 143mm W x 50mm D.  Compare that to most DSLR bodies today that are at least 75mm deep.  A mirror does not require a 75mm deep body.  Rangefinders always appealed to me for the optical clarify of the viewfinder and their small sized lenses.  But Leica body and lens prices were always prohibitive.The Fuji X100s had looked to be exactly what I had always wanted.  Compact size.  Superb optical rangefinder style viewfinder.There are very, very few gadgets that I would ever even consider \"pre-ordering\".  The X100s was one.  I anted up and placed an order for one long before it was expected to ship earlier this year and was apparently one of the first to actually get one.The \"hybrid\" viewfinder is superb.  It is a real step forward in the evolution of photographic equipment and I hope other manufacturer will follow Fuji's lead here.  The X100s is truly pocketable unlike any SDLR and unlike many so called point and shoots.Initial impressions of the build quality were disappointing.  While the top and body feel solid, it is a bit of a façade.  The small USB port door on the side is flimsy and the battery / memory card slot on the bottom is pathetic plastic.  The X100s should have been weather sealed.  I believe Fuji could have done this for a modest increase in final price.  I would gladly have paid another 10 or even 20% for a weather sealed body.  This is supposed to be a go anywhere street shooters camera.  It has too many entry points for moisture to be safely carried in even moderate precipitation.In use, the camera continues to frustrate.  Even after thoroughly reading the owners manual many functions and features are hidden in obtuse menus.  Many things just seemed backwards to me.  The so-called shortcut for ISO changing is done by pushing the Fn button and then scrolling left and right using the top right command dial.  Trouble is my brain always says smaller numbers should be to the left.  Yet rolling the dial left gets you bigger ISO numbers.  There are many places where I found the Fuji menus and selections just backwards from what my intuition and previous camera experience led me to expect.I avoided the original X100 because one thing I have learned is that I have to have absolutely instantaneous power up and no shutter lag.  This has kept me using DSLR's as those are the only digital options with real instant on capability.  The X100s was touted as having much faster performance.  Yes, sort of.  Power up is slow but can be sped up by playing with custom power saving menu options.  The shutter lag is low but only when the camera is prefocused.Manual focusing should cure the prefocus shutter lag issue but here again the X100x is crippled by it half manual half auto hybrid design.  The focus by wire system means when you turn the focus ring on the lens you are not actually changing anything mechanically in the lens elements.  You are sending electronic signals to the camera asking it to change the lens focus.  This may be better than the X100 but it is not good enough for real manual focusing.  At least not good enough for me.I spent too much time looking for settings in menus and struggling with focus lag causing shutter lag.Image quality is great, when you can get a shot.  But what good is it if the camera is so difficult to use that it prevents getting those in the moment shots.  Or if it is so delicate that I am afraid to carry it outside.What would make me happy?1. Remove about 90% of the electronic menu functions from this camera.  I do not want to edit my photos on the back of my camera.2. Give it real mechanical manual focusing.3. Weather seal it.  Come on, a $1000 plus camera without even basic seals on the battery door?  That is embarrassing4. Remove the built in flash.", "Date": "October 30, 2013"}, {"Title": "It lives up to the hype so far", "Author": "sinisterbrain", "ReviewID": "RE2BBX3FC7BP1", "Overall": "4.0", "Content": "I am a Canon shooter.  My current primary camera is a 5D Mk2, but I realized since \"upgrading\" I carry my heavy camera and multiple lenses out of the studio with me less and less.  The thing is, after shooting full frame, most point and shoot cameras leave me disappointed.  There are other APS-C and even a Full Frame compact camera now, but few receive the hype that Fuji has been making.An extremely competent, lightweight, fast camera?  Is it hype?  I took the risk to find out.My initial impressions (non-scientific) 2013-04-03:* It's bigger than I thought, but that's also a good thing.  Fits in my hands better than most point and shoots.* The controls are very ergonomic.  Within 10 minutes of use I found myself using them without looking.* Compared to the 5D Mk2, the AF is like comparing a lighter + gasoline to matches + damp twigs.* I *love* the fact you can move the AF point to somewhere useful for composition.* To my surprise the JPG's are very usable, I haven't tried RAW yet.* Also to my surprise the ISO performance is spectacular.  You can shoot about 1-Stop higher than a 5D Mk2 with the equivalent noise levels.* I'm loving the viewfinder, though I can't find the words to explain why yet. The on-screen display is a major factor.* The auto-iso + minimum shutter speed setting is surprisingly useful.  Auto... within limits.* It's dead silent once you enable silent mode.  Just a pleasant \"click\".My only dislike right now, and it's very minor, is the battery charger.  It works, but the cable, when folded, is about the size of the charger; combined they are about the same volume as the camera.  Would love the option to forego the cable all together.  Alas, it's functional and won't affect shooting.I'll update this review once I've used it more.  I wanted to share my initial findings from a non-fanboy perspective.  I think this will satisfy my needs.  From what I can tell it lives up to the hype.Giving a 4-star.  If I'm still this excited after a month, I'll update to 5 stars.  :-)", "Date": "April 3, 2013"}, {"Title": "Tough choice but I'm certain I made the right decision", "Author": "Sam T", "ReviewID": "R3B3B8YZKQRXW1", "Overall": "5.0", "Content": "Needed a 35mm option to compliment my event photography.  Was torn between the new Fuji x100s and the new Sigma 35mm f/1.4 HSM lens for my Nikon full frame DSLRs.  Both are terrific 35mm field of view options but each offers different application options.Opted for the x100s after reading Zack Arias' review.I may someday still get the Sigma 35mm f/1.4 for its amazing sharpness and contrasty images.  But today, I'm incredibly happy with the x100s.  It is my everyday carry camera and I've been using it as my 2nd camera for events.Positive points for the x100s:- The x100s images are sharp, rich, and robust. I have no issue giving these images to a client.- I'm amazed that I can sync my Nikon Speedlights with the x100s to 1/1000 of a second.- Small and portable compared to a DSLR.- Beautiful and unique looking camera compared to a DSLR.- Quiet and discrete.- Almost a perfect 2nd camera or everyday carry camera.Negative points for the x100s:- A bit quirky with a moderately steep learning curve (fixed lens, button ergonomics, and menu diving).- Not a camera for a beginner. There are smarter choices if you want a point & shoot.- Not a camera for fast action like sports.  And especially not in low light.- Does not measure up to a DSLR as a do everything camera (focus speed, lens choices, flash systems, flexibility, etc...)Addendum *May 16th, 2013* -- David Hobby, a pro photographer, put up a YouTube video detailing the camera's features and how to set up the x100s.  Good reference for those that own a x100s and it will help you understand the camera better if you don't already have one.[...]", "Date": "May 14, 2013"}, {"Title": "Really great small camera", "Author": "kdu-917", "ReviewID": "R61YHWJRY5TS7", "Overall": "5.0", "Content": "Got this to replace Nikon P7000 which I bought because I'm a Nikon shooter and figured that it would be easy to learn with same menu system, etc.  Also could use same flashes.  I was wrong - the P7000 had klugey software, a lens cover that never opened etc. made this a PITA.  Took some great pictures here and abroad, but what a struggle.  Bought it from Calumet at retail and when I had a problem they forgot to know me.  Told me to send it back to Nikon or take it down the street.  I bought a bunch of stuff from them and I guess their business practices have finally caught up with them...The Fuji X100s is a joy.  Like the vintage Leica look and the fact that it does not draw attention. I do a lot of street photography and the size and look is a real plus. Have had only one person recognize it for what it is, everyone else thinks I'm shooting 35mm film !?!  Wasn't sure about the fixed lens, but had been going out with a manual 24mm lens on the Nikon D7000 and thought it would not be creatively constraining and it isn't.  The menu structure is logical and most everything is only a button push or two away.  Have produced some lovely shots with this camera.  The color rendition is really nice and I really like the feature that allows you to use color profiles that mimic the Fuji films I used to use; Provia, Velvia and Astia  The electronic viewfinder allows you to look through the lens with exposure profiles overlaid on the image allow you to fine tune the exposure to get good results.  I've yet to find something this camera cannot do, including timed exposures at night.  After a couple thousand shots I'd say it's a great creative tool. Highly recommended.", "Date": "April 28, 2014"}, {"Title": "Still lovable, less annoying", "Author": "Sarah Cooley", "ReviewID": "R39FS4PZVQGZE6", "Overall": "5.0", "Content": "Hello, my name is Sarah and I have a have an unhealthy addiction to this camera.  I'm one of those people who bought the Fujifilm x100 because a photographer friend of mine loved hers.  The x100 was quirky and annoying but so lovable and enjoyable.  My x100 and I were partners in crime.  I referred to it as my finicky b**ch camera. The x100 felt so good to use and every now and then the photos were magical.The Fujifilm x100s is just as playful, just as lovable, but it isn't quite as \"quirky\" and isn't as constrained.  I used to tell people the x100 was great for still, street, and portraits -- anything else may work but took a miracle.  However, if you had time to frame it or wanted something a little more visceral feeling, it would do that for you.  The x100s still takes amazing, crystal clear, shots with amazingly vibrant colors (though the colors are slightly different than the x100) and still gives you that classic street look but now it's possible to take action shots.  I won't say it's a strong point but it CAN and everything else is much easier too.  I especially love the manual focus peeking and tools.In short, yes, it was worth spending nearly $2k to rearrange the menus, fix a few bugs, speed up auto focus, change a few buttons, and improve manual focus.  It was easily worth every penny.", "Date": "October 7, 2013"}, {"Title": "A perfact companian, Fujifilm X100S, you Rock!", "Author": "Kaushik Parmar \"Kaushik\"", "ReviewID": "R3UEESF7MQDT19", "Overall": "5.0", "Content": "Dear AllI am proud owner of Fujifilm X100, and I have had chance to use the latest X100S for 15 days. I am fully convinced with the features of the new X100S, I am jotting down my views and feedback on this model. Although, I am not going to make this review a more technical one, I will surely share my experience.The only part that I did not like in this whole process was returning the X100S after the test period but I guess I did not had any other option! (Clarification: I have not purchased it from anywhere but I had privilege to use it for one assignment,  and once work over I returned it.)The X100S is actually a better camera than X100, but that does not mean that X100 is not a good camera; it still is a great camera; but now it is more affordable than before and means more volumes for the company.The first thing that came to my mind after using the X100S for the first 10 to 15 minutes was that, in my opinion Fujifilm was in hurry to launch X100 two years ago, and now with this new X100S they have almost fixed all problems of the X100. X100 was not very good in terms of focusing but after some firmware that problem was sorted out. Even after this, X100 was successful, because of its image quality and its great look. Despite its slow auto focus, almost unusable manual focus system and others issues, photographers were amazed by images coming from the camera.  X100S has improvised on this feature and manual focus is really great feature in this model.When I picked up this camera first time, I immediately turned it back and tried to check the Menu/ Ok button, as in X100 it is very difficult to use, but the same feature in X100S now centre round button is more edged out as compared to the X100, making it very user friendly.The print on the operating buttons should be not erasable and should be long lasting so as to endure years of use. The prints on my X100's Menu & AFL/AEL buttons are not visible, and have totally disappeared after constant use. My suggestion would be a kind of embossed button or maybe first layer should have some transparent layer, which would protect the print from fading.Performance:Handling:As far as the aesthetics are concerned, the X100S looks almost similar to X100. But performance wise, the X100S is faster than X100. The response time of X100S is good. Also the \"Q\" button is welcome feature which allows faster access to the menu and if you keep press \"Q\" for longer time the screen will be bright very useful for outdoor! . Optical viewfinder is `sexy'!Auto focus:X100 was terrible in the auto focus department, but after some firmware now it is usable, but the manual focus is still not usable. In the X100S auto focus is very much improved making it very fast. The focusing ring really works just fine; just put your finger slightly and you will be helped out by ring, lot of improvement here; credit to Fujifilm here.Only sometimes it fails to focus and maybe Fujifilm can make a little bit of improvement here and bring up the speed levels to the likes of Olympus OM- D E-M5, which is incredibly fast! Even my Panasonic GH2 is very fast.Fujifilm has done great with the introductions of the \"Peaking\" mode and \"Split\" mode; very useful. Sometimes in the auto mode, the camera focuses on something else which is actually not wanted but in manual focus, using any of these two would be very useful.  Personally I do not use manual focus because auto focus is so perfect! But manual focus is very much needed in some specific conditions.Continuous shooting:I used the 3fps for a burst 44 JPEG frames and 6fps for a burst 31 JPEG frames out of the two continuous shooting modes that the X100S has, I used 32GB class 10 card and camera was incredibly fast! Well-done!Image Quality:X100S produces gorgeous images, 23mm F2 lens is amazing it is indeed very sharp, F4 gives stunningly sharp results! The Dynamic range of the X100S is much better than X100. Honestly, image quality is so great that with right tool, we can make amazing HDR effect with a single photo. I have been successful in creating so many high quality HDR single pictures, directly out of the camera!The RAW files are amazing! I noticed that it is impossible to make 16: 9 RAW file. I set the camera in JPEG + RAW and that too in 16: 9 but when I saw the output pictures, RAW was in 3: 2 ratio! I tried to find a solution to this issue from the manual of X100S but there is no mention that RAW with 16: 9 ration is not possible and default is a 3: 2 ratio image. I checked this out in the X100 and it has the same flaw,  but my other camera, the Panasonic GH2 can record RAW in 16: 9.  Fujifilm should provide RAW file in 16: 9 ratio.Video performance:X100S has to offer Full HD 1080P video at both 30fps & 60fps. 24P is missing! The video looks so good when ii is taken in good light. The dedicated recording button is still missing. Prior to recording you can set the aperture, exposure and film simulation mode.Flicker proves to be a big problem when used at night and it is very annoying! Very important for Fujifilm to resolve this issue.Camera struggle in continuous auto focus mode while recording video it is very slow and  unusable. It is time for Fujifilm to concentrate on its video department. I feel that with good light this camera produce great videos, it is possible to have great Bokeh effect too!Digital Zoom 90mm is not aviailable in new X100S, in X100 it gives amazing result!Pros:1, Great F2 lens, very sharp.2, Image quality is outstanding and stunning!3, JPEG files are very beautiful.4, Sexy & light weight5, New Artistic filters are fun to use.6, Appearance, a big plus.7, Very silent.Cons:1, Poor video features.2, Slightly expensive.3, Battery cover accidentally opens and that too frequently.4, Focus selection switch is not user friendly, should be changed.My feature wish list for next upcoming camera for this X100 series is:1, Panasonic GH3 like video solution with dedicated video features.2, HDR feature.3, Full frame.4, Tilt screen.5, Water & Dust proof.6, Shutter release cable.7, Direct ND filter access.As mentioned before, the launch of X100S does not make X100 a bad camera, X100 is still great camera with the exception of speed.I also noticed X100S produces darker image than X100.ND Filter/ Flash combo is great to use!X100S has moiré patterns but a little lesser than X100 though.ND Filter should be accessible by single button and there should be separate button for it.Conclusion:X100S is the day camera and you can learn so much with it, and it will not disappoint you in terms of performance specially its Image Quality. It has excellent ISO noise performance and with new censor, accurate and faster focusing system and other improvement now X100S is a great performer. Kudos to Fujifilm for this one! And looking forward to see better & better in future.I could be error prone.My work which I made by using X100S & X100, please see all photos & links if you get time:[...]Kind Regards,Kaushik Parmar", "Date": "June 20, 2013"}, {"Title": "Why the Fuji X100S?", "Author": "Q", "ReviewID": "RIV766A25SNS8", "Overall": "5.0", "Content": "The X100S has a full-size APS-C sensor, fully 13.4X bigger than my Panasonic ZS20 compact travel zoom (with a typical size compact camera sensor), and 9X bigger than my Nikon P7100 zoom. The X100S sensor is 1.66X bigger than the micro-4/3's sensor found on, for example, the Olympus OM-D EM-1. The large 16mp sensor of the X100S gives fabulous images which can be cropped way down or blown way up while still retaining good image quality. The X100S works well in low light at high ISO settings. I don't like to use a flash unless I have to, since it is so distracting in any kind of group setting. It also has a \"quiet setting\" which makes the shutter completely silent and no flash or AF light. The jpegs straight out of the camera are usually excellent, but if you don't mind processing RAW images, you can get even better results. It comes with a printed owner's manual, battery, battery charger, lens cap, and shoulder strap.One main reason to buy this camera is the exquisite rangefinder form-factor. It's a nice size, substantial, well-built camera in the hand, without being too big and heavy. I like how the flash is built into the front of the camera, in contrast to the usual \"pop-up\" flash these days. The textured leather finish has a great feel and is easy to grip. It's relatively easy to use. Unlike some other reviewers, I find the menus easy to navigate, and the controls very accessible and intuitive. This is just a fun, very enjoyable camera to use. Owning it makes you want to take more pictures.If you want a range-finder style camera, why get the X100S instead of the Fuji X-E2 or the Oly OM-D EM-1, which have interchangeable lens and are thus more versatile? The two cameras mentioned don't have the wonderful, large-view optical viewfinder of the X100S; I won't go into details on this technological marvel; just check out the on-line reviews. The Oly OM-D EM-1 certainly has comparable image quality, but it also has that big, what I consider, ugly hump on top, which really ruins the classic rangefinder styling. Also, the zoom lens on those cameras are very big in proportion to the body, which kind of defeats the purpose of the compact rangefinder form factor. And there are some advantages to having a fixed lens: not only is it very compact, but the whole camera can be optimized for the best performance for that one lens. I think this is reflected in the amazing high ISO performance of the X100S.In most situations, this will be the only camera I carry, but I don't actually consider the X100S to be an all-arounder because of the fixed lens. If I'm using a shoulder bag, I will also take my excellent Nikon P7100 with a 7X zoom, and I'm considering the Canon GX 1 Mk II.Cameras are like computers nowadays, in that the technology is improving so rapidly that one hesitates to buy an expensive camera since a better, perhaps cheaper one, will be released soon. That said, I consider the X100S to be a mature product, the culmination of the attempt to reproduce the classic film rangefinders in digital form (setting aside the Leica's, which are out of my price range). I expect to be happy with the X100S for several years. The only way I would consider replacing it is if Fuji releases a version with a 50mm lens. BTW, Fuji will be releasing a 50mm teleconverter for the X100S soon, which will retain the same aperture range as the built-in lens. I plan to buy one, even though it will add considerably to the size of the camera.There's been some controversy about the auto-focus. One of the big improvements of the X100S over the X100 is auto-focus performance. In my experience it works fine, very fast. When the aperture is wide-open at 2.0 and you're doing a close-up, the camera might take a second or two to focus; but in most situations it works almost instantaneously.Recommended accessories: *STK's Fuji NP-95 Battery*Manfrotto MB SCP-7BB NANO VII Camera Pouch*Gariz Genuine Leather XA-CFX100BK Camera Cap Fixs for Fuji Fujifilm X100 X100S*Apple Wall Plug Duck Head for Apple Macbook (to replace the bulky cord on the charger)*Transcend 16GB Class 10 SDHC Flash Memory Card (good for about 400 shots of \"raw + fine .jpg\", or 2452 fine jpegs)*Fujifilm EF-20 Shoe Mount Flash (when the built-in flash isn't strong enough)*Domke F-6 Little Bit Smaller Bag*Lensmate concave brass soft release button*Domke 1-Inch Camera Strap (web) 740-1BK*Sea to Summit Nylon Stuff Sack (XXS, 1 liter) [protects against dust and moisture]*Book: Fujifilm X100S: From Snapshots to Great Shots (not released yet)", "Date": "March 7, 2014"}, {"Title": "I LOVE this camera - portable, fantastic images, great in low light!", "Author": "reviewer173272", "ReviewID": "R24XKGJSN7GIZO", "Overall": "5.0", "Content": "This is my favorite camera and the BEST for me. I LOVE it so, so much. It's not perfect for everyone, but here's why it's totally perfect for me.1). It fits in my purse. I primarily take family/travel shots and love having my camera on me at all times. (You know.. \"The best camera is the one you have with you\"). For years, I carried around my DSLR every where but then my shoulders hurt and the big bulky bag got annoying. Then I switched to a half-decent point&shoot; I could throw in my purse. I wanted better quality images and thus began my research that led me to the Fuji. The Fuji x100s fits quite nicely in my purse, and isn't big and bulky. And it takes GREAT pictures.2). It takes phenomenal photos. It really does. I am continually amazed. The quality is just great. I'll try to add some sample pictures on the listing if Amazon will let me.3). It excels in low-light. I prefer not using the flash whenever possible, and the Fuji x100s allows me more flexibility flash-less than I've ever had before. Indoor shots come out great. Handheld night shots even look good. I love being at a restaurant or even in the car and being able to leave with great captured moments, not just blurry smudges. Many of my images end up being in less-than-ideal lighting situations and this camera handles it with charm.4). Ability to balance competing light - wow! Imagine sitting in a room with a big window of sunshine behind your subject - this camera can capture the subjects just fine without blacking them out.5). Great bokeh - macro feature is pretty good too.6). Easily accessible manual controls - aperture, shutter speed, exposure compensation - quick accessible dials.7). I actually really like the lens cap too. It's a friction design with felt on the cap and ridges around the lens. This means it comes off and on very easily, but doesn't fall off on its own. No annoying release edges to push like on a DSLR lens. Those always fell off or made you struggle to get them on right half the time.8). No lens that mechanically moves in and out. I researched against a similar camera - Nikon's Coolpix A - and one of the deciding factors for me was the whole motorized lens moving in-and-out every time you turn the camera on. I've had that fail before, rendering the camera useless. Since the Fuji lens is ready to go, there's no motor to break... AND, you're ready to take your image a couple fractions of a second sooner. Hey, that speed makes a difference sometimes. (The downside is no zoom, but I'm ok with that - \"zoom with your feet\"! or 16MP means you can crop it later)9). The Fuji has an LCD screen AND a viewfinder (and an electronic viewfinder if you want to feel all kinds of fancy!) I enjoy having the option to choose.I wouldn't recommend this camera to everyone though, because it does take some knowledge and manual decisions to operate. It's not a mindless tool for grandma to use. While I mostly use it in Auto mode to snap & go, sometimes it needs a quick tweak to get exactly what you want. I don't mind taking a second to manually define the focus area, or choose the desired flash setting, or set the exposure compensation. I prefer having control over my images vs. the ease of \"the camera makes every decision for you and you never have to think.\"Some other notes:1). I bought & returned the knock-off Fuji case that others recommend. For me it all became too bulky and I couldn't see it being easy to use with that case.2). I store it case-less in my purse - with a screen protector for the LCD. I may find some additional cushion, but I'm not too worried about it.3). Macro ability is pretty good. I wish it focused a bit closer, but I'm not complaining (and I have a beautiful macro lens for my DSLR so I may be spoiled with that).4). When I do use the flash I find that it balances the light very well - not overly bright and washed out like most flashes.5). In-camera menus seem pretty straightforward6). Oh, this is fun! With the newest firmware (01/14) you can customize the first 4 letters of your file names. Forget DSCN or IMG. I used my initials and the year so I'll quickly know in the future what year I took the picture.7). I like that you can reset the image counter for file names. (I've always hated starting a new year on DSC_8956 knowing I'll soon return back to 0 and it would mess up my yearly organized file structure).8). The LCD shows lots of great info - histogram, grid lines (with auto horizon that shines green when you're holding the camera flat vs slightly tilted), shutter & aperture, and more.9). You can turn on the \"eye sensor\" so that the camera will automatically switch to the viewfinder vs the LCD screen when it senses your eye is near. That's pretty dang neat. (Although sometimes it misconstrues your hand if you're holding it weird, and the screen goes black and you forget why for half a second, so I sometimes turn this off, especially if I have to hand the camera to the random guy to take a group picture for us).10). I like that the camera body supports the more secure key-ring type camera strap vs the \"fish this webbing through the camera and the little plastic over-under thing and hope that it doesn't slide through one day randomly and you drop your camera\" as has happened to friends. (Although I've yet to find a strap I like and currently just have a piece of rope tied to it, ha!)11). Here's something that's important for users to be cognizant of - many of the settings are \"stay on until you turn the setting off.\" This can wreck havoc on your images if you forget that you turned the aperture to 8 and then 2 days from now you try to take a photo of your kids in the low-light car. If you assume the camera's in Auto, you'll get a buncha really poor images. This can happen with Macro mode, focus area (Two options - \"Multi\" (i.e. auto) or \"Area\" (64 point grid that you choose), so if you select the left side of the screen for some artsy shot, and then forget to change it back, the next time you try to take a photo of Aunt Sally you'll wonder why the chair to her left is in focus and her face is not.) Most DSLR users are probably familiar enough with this, but if you're used to a p&s; without lots of features, it'll take a bit to train yourself to \"always turn it back\" when you're done with anything outside the ordinary.12). Video's a great feature. I haven't used it extensively, but it's always nice to have the capability. In Mr. White's book (mentioned below) he mentions you have to turn the camera to \"auto focus-continual\" in order to use video for most instances, or the camera will focus when you start the video, and maintain that focus throughout the entire video. This is VERY helpful to know as my first few videos were awful (\"Nothing's in focus after the first shot!\"). But, we left it on \"AF-C\" for a recording of a monologue and the focus kind danced around a little - my face, my hair, the wall behind me, etc, so we turned it on to \"AF-S\" since the subject and the camera were not moving. Much better. The quality is pretty good - HD something or another.13). Battery life seems pretty good. I don't feel burdened.Accessories I'd recommend:*) Photographer's Guide to the Fujifilm X100S - by Alexander White. I didn't even bother with the Fuji manual - this guy does a great job explaining features and how to really use the camera. It's easy to use the camera wrong without understanding it fully. Highly recommend.*) Expert Shield - THE Screen Protector for: FujiFilm FinePix X100S Lifetime Warranty*) STK's Fuji NP-95 Battery - 2000 mAH for Fujifilm Finepix X100S, X100, F30,... - Have cycled only once. No problems.", "Date": "February 6, 2014"}, {"Title": "Well worth the money I paid for this great camera.", "Author": "Christopher Rice", "ReviewID": "R2O21G33ZTGA1F", "Overall": "5.0", "Content": "I own a Canon 5d mklll and I am getting better low light performance with the X100s! Images are very sharp even when shooting at f/2.8. I had one issue when I received the camera, there was some dust on the sensor and I had to send it back to Fuji USA at a cost of $35.00 to have it serviced, Fuji refused to pay for the shipping back to them or refund the money, even though it was their quality control issue! Other than that I am very happy with the camera and would recommend it for anyone that is serious about photography.", "Date": "June 23, 2013"}, {"Title": "Good Autofocus, leaf shutter, incredible image quality, great lens... should I keep going?", "Author": "james clifton barker", "ReviewID": "R2YJ6VBMK4CAT2", "Overall": "5.0", "Content": "I bought this camera for 1 specific purpose--sync hand-held flash for street photography.  I love that Bruce Gilden look, who doesn't?  This is THE BEST CAMERA for that (except maybe the Leica M6 in Bruce Gilden's hands).You've read too many reviews already, I'll put it in bullet points.--Does what the M9 does... better, cheaper and easier (I have an M9, and the Monochrom, still love Leica though :)--Leaf shutter syncs flash up to 1/4000th of a second!!!  Higher than Phase One, Hasselblad... anything.  Do yourself a favor and use a chord instead of a pocket wizard, it doesn't sync as well at high speeds.--It's beautiful in black.--The ef-x20 is amazing, and syncs in command mode without the need of chords or pocket wizards.Cons:--The ef-42 flash won't sync with it.--It's not a Leica?--Clunky to begin with, better than the x100 menu system, but still not as intuitive as some other cameras.In college, I worked at Ritz and came to know the fuji brand of cameras... these X-Series cameras are so so so sooooo far away from the finepix offerings of the mid 2000's.  I swore off the x100 and x100s for years because of the bitter taste of the finepix, let me assure you that these are just so much more than you could ever want or need in a camera.", "Date": "May 8, 2014"}, {"Title": "Amazing camera", "Author": "Thomas Lynge Jensen", "ReviewID": "R2YUPRQ4V28W9W", "Overall": "5.0", "Content": "I am an amateur photographer that has taken pictures 'seriously' for 5-years. I own a Nikon full frame D700 and several Nikon prime lenses. I love my D700 however it is big - thus I needed a more portable camera that I can bring everywhere I go. For for the last year I have been on the lookout for a small high quality compact camera. This is an absolutely amazing piece of magic - extremely high quality pictures. In particular I am blown away with its use of fill-in flash. I can very highly recommend this camera.", "Date": "January 2, 2014"}, {"Title": "Love it so far", "Author": "Dan G. Hiris", "ReviewID": "R18UUWD7S2I526", "Overall": "4.0", "Content": "So I had a day with the x100s and here is my initial impression. Keep in mind that I've been a long time user of the X100 so I already was familiar with the menus and abilities.I'll start with the menus, the whole interface is very intuitive. It's easy to find the options you want through a very well built menu system with intuitive controls. The x100 kept me lost scrolling through pages for a very long time.The AF-S AF-C and M selector switch is pretty easy to use and AF-C (rarely used by me) is in the middle so you don't have to feel for the switch to figure out what option you have chosen when switching between AF-S and M.Image quality has improved considerably also. The ability to shoot in auto ISO up to 6400 with low noise is pretty cool from such a small camera. Makes it perfect for night-time concerts and night street shooting.Manual focus with split image is very nice but it's still pretty hard to tell when you found the focus in the dark because of the low contrast in the image. The outline focus finding (almost like super high-contrast) is not working very well for me. Maybe I need more practice with it but It seems to me like I got good sharp focus when I shoot while the image itself is blurry.The Electronic View Finder is sharp but it doesn't show a histogram, which to me is a thing I would like to have so I can easily switch the EV setting while framing and focusing.Autofocus is relatively fast in the dark but it doesn't work with backlighting even if you set center focusing. It focuses on the background instead of the darker foreground.Battery life is a-ok. It lasted me for about filling a 16 GB memory card with RAW+jpeg in the dark, (no AF assist or flash). If you have a bigger memory card or multiple memory cards, 1 spare battery per 16GB is a good rule of thumb.I uploaded some sample photos to give you an idea for its capabilities.", "Date": "September 22, 2013"}, {"Title": "A serious camera for serious photography", "Author": "Michael L. Craft \"Camera Crazy\"", "ReviewID": "R1K77R0IXR54O1", "Overall": "5.0", "Content": "Anyone pondering the purchase of this camera probably already knows a thing or two about it's capabilities. Let me assure you it's all what you've read and heard. Fuji have created a truly remarkable mirrorless camera that, in my opinion, is the equivalent of the famous Leica M series film cameras. It does require a fair amount of photographic knowledge and application--this is no ordinary point and shoot (although one can set the controls to allow the camera to function in program mode). However, if you're serious about photography and are willing to spend the time to fully explore the controls of this superb instrument, you won't be disappointed. The lens is superb; menus are logical and well laid out; focus is much improved over the X100; the hybrid viewfinder is a joy to use; and finally, the camera feels natural in the hand. Be sure to buy extra batteries, however, and invest in a good screen protector for the rear screen. Highly recommended, especially for urban photography.", "Date": "March 19, 2014"}, {"Title": "I like it!", "Author": "tall2010", "ReviewID": "R9WQA3Y064DXV", "Overall": "4.0", "Content": "Used to have a Nikon D600 with many lenses but sold it for the Fuji X100sand a Sony RX100 (zoom lens).The X100s is unique, a lot of fun and the image quality, especially high ISOis astonishing, therefore, I often leave ISO on Auto with max set to 3200.Got an inexpensive adapter, lens hood and 49mm filter for $15 on eBay and this is agreat accessory, not using a lens cap at all.You'll need at least one or better two spare batteries.I can absolutely recommend the X100s, not to beginners, but to people who appreciatephotography and do not feel limited by a fix 35mm focal length lens.The camera is a real joy to use!Edit after 2 weeks: As much as I liked the X100s it simply didn't replace a DSLR, therefore,I got a Canon 6D with 24-105L f/4 lens instead.", "Date": "October 26, 2013"}, {"Title": "Great, but could use dial locks and faster AF", "Author": "N. Tran", "ReviewID": "R18STEJMY5ADEJ", "Overall": "4.0", "Content": "I used to own a Nikon D600 with 24mm f/1.4 lens to take people pics. I usually crop do I can do without a zoom. I like to take people and scenery pictures at events, but most events don't allow detachable lens.I was looking for something less bulky, with great optics and a non-detachable lens. I searched for the best people picture camera and Ken Rockwell recommended the X100S. After further research it seemed like this was the best out there. It's a pricey point and shoot but you get what you pay for. The images are priceless.Pros:- Great optics and low-light performance- Excellent fill flash performance- Produces beautiful people pics- Digital view finder is awesome, although I rarely use itCons:- The dials could use a lock since they are easy to turn on accident. I rarely use the dials (usually leave the aperture and ISO on auto, and exposure compensation at 0) and they usually get bumped at parties or when handing the camera to someone else to take a shot. I could do without all three dials, especially the exposure compensation dial.- The autofocus could be faster. It does the job but there are times when it will miss. It's not great at close up macro shots, even in macro mode (better to AFL in manual mode).- Battery life is erratic. At times, it'll jump 2 bars and the next thing you know it's dead. Good thing Amazon has a great deal on 2 extra batteries + screen protector for under $19.- The focus ring and d-pad dial has gotten sticky and is hard to turn.- Lens hood is not included at this price- Filter requires an adapter, which is also not included- No image stabilization (must have for shooting videos)I highly recommend this camera to anyone who is looking for a great people picture camera and can live without a zoom lens. This camera will take excellent pics with fill flash that is not too harsh. The 16MP allows for room to crop. It's also great for landscape, scenery, and panoramic shots. This is the people picture camera to take to most events.", "Date": "August 9, 2013"}, {"Title": "Great Point and Shoot...", "Author": "D. Martinez \"David\"", "ReviewID": "R2RP0HX03IP9SY", "Overall": "5.0", "Content": "Most important aspect of any camera review! Will it take great pictures... YES!This is a point and shoot camera... no two ways about it. It is the most advanced (and most expensive), quality P&S; I own. Great camera that will never replace my professional gear but one that I have no problems with carrying solo. Leaf shutter!!! Strobist dream! Good AF, not DSLR but good. Better than my 7D in the APS-C IQ arena. Great looking, small but not jean pocket-able. It will get you noticed by other photographers... almost like carrying a 1DX with a 200-400mm into a room of Rebels. Most of the non-photography based public will just pass right by though. Silent !!! Great for street work and people shooting, fast moving children might be a challenge.I'm not going to review every detail of this camera. If you need that, Google it. Google Z Arias, Hobby and the plethora of on-line reviewers. You'll find 90% positive reviews and this camera richly deserves the accolades. Is it perfect... no camera is perfect. Could the X100S be even better, for sure. Will this camera kill the DSLR market, hardly. Do I love it? Absolutely. Can I confidently leave my gear bag and DSLR's at home... YES!!!One other note, to those 1 Star reviewers here on Amazon or those that want to compare it to their DSLR's. Total BS, not verified buyers or... well, let me respond with the reply I left for Jakob \"Swede\" about his issues with this unit;\"The lady protests too much, methinks...\"I find this interesting... this reviewer has made it a point of posting this complaint in every possible corner of the world and now here on Amazon. It appears to be a personal ax to grind with Fuji. We are supposed to take his word for this \"story\" as gospel... he did nothing wrong and Fuji is out to get him. Could he have abused this camera and now expects a full replacement? Dropped it hard? Got it wet? It's just as plausible as his story of the camera mysteriously dying. He is not a verified purchaser here on Amazon, or BH... if you are on Flickr, he also complains there too. Something quite fishy. All cameras mass produced can have issues but something doesn't add up here. I use cameras as tools and at 1200$, you are not breaking any banks here. If you truly are a professional photographer, you'd understand this statement and are prepared for occasional issues or accidents. This isn't a Hassy or a Leica, or even mass produced 1DX. It's a P&S.; Get it fixed and move on. Oh, BTW... I am a verified purchaser and professional user. It's a great camera, without flaws... no! Possible lemons out there, maybe. How often do you hear this complaint about this camera? The only other 1 star complaints you find here on Amazon (or anywhere else) about this camera are based on \"fake reviewers\" or people expecting DSLR like AF from this X100S. If you want a professional camera with professional AF for $1200, you're dreaming. Should you trust reviewers like Jakob \"Swede\"... that's only for you to determine. Me, not so much.*** Again, this is a P&S.; Not a professional build level camera with sport photography based AF. If you're looking for that in the X100S you're delusional. If you're looking for a great alternative to the 25lb plus gear bag and DSLR kit... this might be what you're looking for. It was the answer I had been looking for and had hoped for in the X100. That's a great camera but missed on a few important aspects, IMHO. Now, the X100S addressed those aspects and came back STRONG!!!", "Date": "August 8, 2013"}, {"Title": "So good w/a few quirks", "Author": "Ingrid", "ReviewID": "R136UMI83A4HZK", "Overall": "4.0", "Content": "Love the camera - for sure has some quirks to it, but overall great!The Bad: The control wheel spins too easily in my opinion, so it can move the exposure +/- 1/3 stop at a time by accident while shooting. The lens isn't the sharpest thing in the world wide open - which is a shame, because that's what I feel a camera like this begs to be used at. It isn't awful, just on the soft side (put a positive spin on it and call it \"dreamy...\"). The OVF is pretty significantly blocked when using the lens hood (buy the $15 knock off brand, btw, works exactly the same!). And finally, obviously, the price is a little steep. There's not really an alternative (unless you don't care about a viewfinder, which was a deal breaker for me), so I guess that the price is tough to argue too much with, but it just feels more like a $900-1000 camera, and not a $1,300 camera.The Good: Everything else :-) With the new ACR 7.4, I've been loving raw workflow in Lightroom, and the film simulation mode is pretty legit when not wanting to deal w/conversion (even the auto WB is better than I'm used to on my 5d3). The images have a ton of detail in them for an APS-C, and while a 35/2.8 equivalent lens isn't necessarily a bokeh machine, what there is looks nice and clean to me. From 2.8 on, the lens seems perfectly acceptable to me for large prints, and distortion seems to be minimal when shooting people. Such a nice size/weight, and handling/ergonomics are so good! The EVF is absolutely incredible (kind of a battery drain, but totally worth it!), it's so bright and detailed, and more responsive than other EVF's I've used. The whole look and feel of it just make you want to use it, which to me matters more than anything else! I would re-buy this in a heartbeat, and highly recommend it!4.5/5", "Date": "April 10, 2013"}, {"Title": "Nice", "Author": "GX107785 \"groovybadger\"", "ReviewID": "RE3V0YPBW5S4X", "Overall": "5.0", "Content": "This camera feels great! Unlike my DSLRs, I feel I will be keeping this one for a very long time.Pros-------Beautiful OOC colors.-Feels solid.-Looks cool.Cons-------AF speed not as fast as advertised. No big deal, it's not that slow and it is firmware fixable I suppose.-JPEGs tends to come out a bit too contrasty. I noticed the dynamic range isn't very good on the OOC jpegs or at least, to my eyes, the shadows don't show much details. I ended up having Shadows -1 in all my settings. This is all based on personal experience, nothing scientific.-Expensive. For $1300, you can get a very good interchangeable lens camera.*UpdateAnother disappointing aspect is the video capabilities. The bitrate is not very high (~around 10fps I was told) and you have no manual control over the video, contrary to common belief since you have all the exposure dials (shutter & aperture) available to you. But then again, if you bought this camera for the pictures like me, then it shouldn't be much of an issue.I never had a X100 before so I can't talk about the improvements over the X100 but I do own a compact Fuji and I must say, it's a lot less quirky compared to the compact Fuji. The menu and options all make sense now. It's feels more like a Canon than a Nikon and that's a good thing.", "Date": "April 23, 2013"}, {"Title": "What I Hoped It Would Be", "Author": "Dennis", "ReviewID": "R55OZLENI4GKD", "Overall": "5.0", "Content": "I generally do not buy new technology when it first comes out because of how quickly it is outdated and replaced.  I bought a used Canon 5D2 a few years after it was released because the pricing was so much lower and it had proven itself as a great camera.  I loved that camera, but realized I was not using it to its full potential and it was such a commitment to carry around as a casual shooter.  The x100s came along and the stellar reviews convinced me that it was time to take the plunge. Yes, you're limited by a fixed focal length, but I think limitations force me to be more creative in the right environments.  The conveniences of less weight and smaller size, while not compromising (much) on image quality and performance have won me over.  I am taking this thing with me daily and barely notice it's there.  As others have noted the jpgs are very usable and the low light ISO performance is more than acceptable.  Sharpness is softer at f/2 than I would like, but that is mostly noticeable when at 100% zoom.The buttons on the back are not great.  It's easy to advance a menu too far or choose the wrong one.  The only way I can describe this is the tactile response isn't as pleasing or easy as I have experienced on larger body cameras.  The only other complaint I have (all things considered) is the power button is too easily switched on.  This could be a good thing if you need the camera in a hurry and a bad thing if you go to pick it up only to realize that it was switched on by mistake and the battery has been drained or draining.  Learning a new menu system is never my idea of a good time, but I'll get used to it.Yes, it is $$, but as a replacement for DSLR as a \"walk around\" camera it is totally worth it.  Off camera lighting is still very much an option and the HD movie mode works ok.", "Date": "April 18, 2013"}, {"Title": "Buy This Camera", "Author": "ReMark 4N \"ReMark\"", "ReviewID": "R1NOX6PRK3SD7N", "Overall": "5.0", "Content": "I've had the Fuji X100S for only a few days and it is already my favorite.  Over the past few years, I've purchased several cameras, including a couple of DSLRs (Nikon 5100 and 7000), a Canon ELPH pocket sized camera, and an Olympus PEN system camera with interchangeable lenses.  They are all great cameras, but I can see that this is going to be my everyday go-to shooter.The best feature is its simplicity.  Instead of hunting through menus, the most important controls are at your fingertips.  The aperture ring and shutter speed dial make selecting Program, Aperture Priority, Shutter Speed priority, and Manual modes as simple as moving the ring and dial from Automatic to a specific setting.  And exposure compensation is a third actual knob on the camera body.The ability to operate the main functions from old style controls means that the menus on the LCD are easier to navigate.  Fuji has made it even easier by eliminating a lot of the less useful functions added to modern cameras in favor of a simpler menu that offers the options a photographer is most likely to need.One feature I had to have was a view finder.  I find trying to compose a photo on an LCD screen difficult at best, although there are times when it is useful.  The optical and electronic view finders on the 100s make shot composition very easy for me.Stylistically, it is a work of art.  Many reviewers have commented that it is less obtrusive than a big DSLR, which is true, but only as far as to not call attention to the photographer.  The camera itself causes a lot of attention because of its retro style.  Most people think you are carrying a film camera.  I bought the leather case Fuji sells and I have to say that the whole package is the work of some sharp designer.Photographically, the pictures I've taken so far are crisp and vivid.  With a fixed lens, you need to zoom with your feet.  This also harks back to the old days, when you had to spend some effort to move around to get the best possible shot.  A good thing, in my opinion because the harder you work for the shot, the better the end result.  And with today's digital processing, you can always crop and alter as needed, post shooting.As I said earlier, I've only had this a few days, but it has already become my favorite camera.  I don't think I've been as comfortable with a piece of photographic equipment since my Canon AE-1.", "Date": "May 30, 2014"}, {"Title": "Took the Plunge", "Author": "Ruskin Browne", "ReviewID": "R8GQYBD2G1IFK", "Overall": "5.0", "Content": "With a big trip coming up and a photographic project in mind, I knew I needed to get a simple, next-level camera, and the X100S was my choice. I'm extremely happy: ease of use, quality of the images, feel of the camera are all excellent.", "Date": "May 9, 2014"}, {"Title": "Love it!", "Author": "Shabeera Rauther", "ReviewID": "R2LNJV30YXNSGO", "Overall": "5.0", "Content": "The JPEG's from this camera are so beautiful! The sharpness of the pictures is striking! Still have to get used to the various functions, but what I like the most is the portability and easy to travel with nature", "Date": "April 17, 2014"}, {"Title": "Best camera I have ever owned", "Author": "DRJIMMYS \"Jimmy\"", "ReviewID": "RYO95ZLA5BJOS", "Overall": "5.0", "Content": "After years of looking, buying and giving away \"digital\" cameras I finally got a camera that works, feels and produces pictures that I feel happy to have and keep.", "Date": "December 27, 2013"}, {"Title": "Back to basics", "Author": "Samuel L Spear, Jr.", "ReviewID": "R3NPBWXKCWFXW5", "Overall": "4.0", "Content": "To shoot with this camera takes some adjustment because of the single lens, however it produces outstanding images. Makes you really get into the craft of photography.", "Date": "November 24, 2013"}, {"Title": "Awesome compact picture making machine.", "Author": "T. Dyrkacz", "ReviewID": "R30YKCMBVVD62R", "Overall": "4.0", "Content": "Great Camera. I love all the manual controls. The build quality is really really good. The autofocus is more than adequate for me. I used to shoot the Nikon D90 and sold it to get this camera since I needed a more portable camera. For me this camera focus faster than the D90. This was unexpected as I have read everywhere about the slow AF of the fuji. I expected slow, but I guess my expectations were too low. Image quality is awesome.The reason I dinged the camera and only gave it 4 stars is that while the build quality is good it is not great. 90% of the camera is built well, but there are some weak points. For example the battery door is a flimsy plastic.Also the battery fits into the camera in the correct as well as incorrect position. They should have designed batteries which only fit the proper way.I am thrilled with the camera so far, but I've only had it for a day. I will post updated once I've lived with the camera for a while.Update 11/3/2013Just a quick update. I had a chance to shoot the camera at a party for a number of hours last night and so far I am thrilled. The lighting conditions were not ideal, but the camera performed great. The autofocus performed flawlessly 98% of the time. It locked focused in situations where the Nikon D90 simply would not. Keep in mind that I used to shoot the D90 with the 35mm f1.8 lens. The fuji colors really impress me and the camera is incredible at ISO 6400. It is actually completely usable at ISO 6400. The nikon topped out at 1600.Quick Update 11/10/2013I bought the EF-20 Flash to go with the camera. Love the size of the little flash and the fact it has bounce capability. Still really like the camera, but I do have a few things to report. I did not think I would be so bothered by the terrible battery life. It seems like I'm always running out of juice. I bought 2 extra batteries but if I was going away for a weekend with the camera I don't think 3 batteries would be enough. I will be buying 2 more batteries. Even though one of my previous cameras the Panasonic LX7 also had similar battery life it did not seem to bother me so much since it was not my primary shooter.Also I had a few instances of the camera taking extremely long time to write a picture.I'm talking about a minute or so long to write a single picture to the card. This happened after shooting a long exposure photo in bulb mote or T mode. One more thing... It seems that the camera overexposes photos. This is very easily remedied with the exposure dial. It may have something to do with the fact I have a single focus point selected. It may be selecting just one point as opposed to average of the entire image... Not really sure why it is happening yet.Update 1/1/2014I've lived with the camera for two months now. Still really love the camera. Last night I shot a New Years' Eve party with it with terrible lighting conditions. I used the EF-20 bounce flash. Mos tof the pictures were shot at F2 , ISO 3200 and 1/60 shutter speed. The pictures it produced were simply outstanding. No need for noise reduction as the pictures looked so clean. (I am talking about RAW since jpgs already have NR). There is really nothing else out there like this camera unless you want to spend thousands more on a leica etc... There is no way I would have brought a DSLR with me to a party and no other small camera that I know of could have produced these type of results under these conditions.", "Date": "November 2, 2013"}, {"Title": "A Non-technical Perspective", "Author": "Jerry L. Wilson \"bugswilson\"", "ReviewID": "R2GX7JEPRXJB6E", "Overall": "5.0", "Content": "Like many who either already bought this camera or are still on the waiting list (I waited 6 weeks on Amazon's list, then found one in stock at Cameraland in N.Y. with free shipping at the $1,299 price), I read many reviews and consumed a dozen or more uTube videos.  I knew I wanted a no-lag shutter for street shooting, a large sensor, and a fixed 35 equivalent lens was OK with me.  The retro look and manual focus features were a \"plus.\"  When I started using the camera, having watched those uTube feature reviews really helped.  I've read through the manual, but by applying the uTube tips to the type of shooting I was actually doing, I was able to recover from some mistakes very quickly. Since there's no book out there yet - watch those videos and you won't need a book.  I was so excited about getting the camera, I actually took notes on the features described in the videos, unless I already knew the concept thoroughly.In short, this is an amazing camera for street photography.  I noticed immediately that people react to it in a non-threatening manner.  It looks like a gleaming (wish it weren't silver!) German toy camera.  I use a set-up that harkens back to my film-shooting days:  manual focus set to about 6 feet out, auto iso, and f8 (shutter on \"A\").  With this setting, if I don't have time to actually focus, the hyperfocal distance involved in this setting provides assurance that my \"feature creature\" is in sharp focus.I did buy a non-Fuji adapter ring and hood -- and the hood is a beautiful \"piece of kit\" (if you're British), but . . . I ended up putting a 49mm rubber hood from Digital Goja on it, with the outside of the hood circumcised by an Xacto knife (to avoid vignetting).  The rubber quality of the Goja hood is excellent; and it folds back nicely in my bag/pouch.  The metal hood was snagging when mounted and rattling when not.  The rubber hood is dorky, but much more quick-draw practical.  And, non-silver.  You do need the adapter ring from the metal hood set in order to mount a protective filter and the Goja lens hood.  I don't think you can get an adapter ring for the Fuji without the hood.  I also bought the little metal shutter button from eBay - it gives you an immediate \"feel\" for pressing the shutter without looking.  It's red (Why?), but I'm going to paint it black soon.I've shot the same photos with my Canon 5dMkii with the 24-70 f4 is lens, and I can't see any sharpness or noise improvement there over the Fuji x100s.  Although you can post-process your own color tweaks, I like the out-of-the-camera color of the Fuji much better than the Canon provides (and that \"ain't shabby\").  The Fujifilm x100s was all and more than I was anticipating.  The \"what, shoot me with that toy?\" effect on people is soooo worth it.", "Date": "September 23, 2013"}, {"Title": "Love it", "Author": "Jerry13", "ReviewID": "R26LY2I5CHR3GN", "Overall": "5.0", "Content": "First go to Sigma DP2 merrill and DP3 merrill reviews (I just posted one)I initially had the x100 and now x100sThis is a brillant camera, fast AF, lovely JPEG pictures (don't have to spend any time on the computer they are so good), what I do is to take the JPEG pictures but for the ones which I think I will print big (20 x30 or bigger), will take them in RAW also and convert it in-camera.I have gotten rid of all my DSLR's (Canon, Nikon etc) and only use this and it stays with me where I go, it is small enough to go in my pocket and with great battery life (unlike the sigma)Just get it.", "Date": "July 10, 2013"}, {"Title": "My favorite camera/Constant Companion.", "Author": "gatorheadLuis", "ReviewID": "R3L2AJHL09HBVX", "Overall": "5.0", "Content": "This is my pick up and go and most favorite camera I have ever owned.I would suggest this camera for anyone looking for an everyday general purpose camera to document life.The 35mm fixed view that the camera has is really the best general purpose view for photography that you could ever hope for. That combined with it's high ISO performance and bright 2.0 lens... I have never encountered a situation that this camera couldn't handle in general purpose every day life photography.Is this designed for wildlife at the zoo... photographing tight head shots... photographing sports.... no. But for everyday general purpose/travel/documentary style photography.... this camera is perfect.I've owned the camera now for 5 months and have decided to only shoot with it for a full year. It's that good. I ENJOY using it and the image quality is truly amazing... especially when you consider that the thing is so small.I highly recommend this camera to anyone wanting a portable, lightweight general purpose solution to document every day life through the lens of a camera.", "Date": "March 27, 2014"}, {"Title": "Great camera in a small package", "Author": "Jonatas Mendonca Dos Santos \"Tiago\"", "ReviewID": "R1AAY1W4A9WLIK", "Overall": "5.0", "Content": "Great camera!! No complains. Now i barely use my 5d and canon gear.I can take fuji everywhere with me, it fits in my pocket.", "Date": "December 18, 2013"}, {"Title": "Best Camera I've Ever Owned", "Author": "Phantom Flier", "ReviewID": "R1LB30UJWA62V0", "Overall": "5.0", "Content": "From the viewpoint of a person who likes and owns professional gear such as the Canon EOS 1-D Mark III and L lenses, this is the best camera I've ever used. Yes, this DOES beat that camera (in everything except lenses), though to be fair, the Mark III is 7 years old now.Every time I use the X100S and go back to my 1-D, I find several things to grumble about. Things like a built-in ND filter, leveling indicators, hybrid optical/OVF finder, the list goes on.When I don't want to drag along my giant 1-D (which is almost always), this goes along with me. The incredible performance of this camera caused me to replace my 1-D with another, newer camera (similar capabilities), since the accomplishments of technology is really amazing.You won't be disappointed with this camera. Be sure to get extra batteries, off-brand is fine. This cameras biggest drawback is battery life. It's even worse in video mode.", "Date": "November 20, 2013"}, {"Title": "Spectacular little camera.", "Author": "Ashton R. Lee", "ReviewID": "R2AIEHXU9MK9FP", "Overall": "5.0", "Content": "I have a Leica M9, and Nikon D-800 and this is the camera I carry in daily travels. The picture quality rivals either of the previous cameras. I suppose I might prefer a slightly tighter lens, as I use a 50 much more than a 35 when I have both.", "Date": "June 16, 2013"}, {"Title": "Fantastic camera--but not recommended. Why?", "Author": "A. Shrestha", "ReviewID": "R25XIEGW5WMQDQ", "Overall": "5.0", "Content": "This is a fantastic camera with excellent potential. Plus, 35mm in FX is one of my favorite focal lengths. So I was really excited to try out this camera when the black version was released. But after playing with it for 3 weeks, I found that the X100s wasn't quite there yet.Here's why: The Fuji X100s begs to be your every-day companion. It has wonderful potential, but it falls just short of being a great camera. Unless you need/want/appreciate a leaf shutter (including all it's limitations like 1/1000 sec max shutter speed at F2.0), I wouldn't recommend the X100s.This review is geared for advanced users. I need to define some acronyms:AF - Auto FocusOVF - Optical View FinderEVF - Electronic View FinderCDAF - Contrast Detection Auto FocusPDAF - Phase Detection Auto FocusDX - Nikon's APS-C crop sensorFX - Nikon's full frame sensorSOOC - Straight out of camera (jpegs)IF - Internal FocusingDOF - Depth of FieldND - Neutral Density Filter (needed to lower the shutter speed; for example when shooting at F2.0 in sunlight)MILC - Mirrorless Interchangeable Lens CameraX100s Cons:1. EVF isn't very good. Fuji's X100s EVF seems like it's 2 generations behind. The Sony NEX-6 or Olympus OM-D E-M5 have significantly better EVFs. In comparison, the X100s EVF is laggy, poor resolution, and colors are not close to accurate. This is coming from someone who actually likes EVFs.2. Weather sealing - This camera, which to me can be your companion, needs to be weather sealed. The build is *almost* excellent, minus some of the doors. Dust can get into the OVF. This camera can easily accompany you as you travel the world. Fuji, make it weather sealed please.3. Nearly worthless horizontal level - X100s can only level for rotation/roll, which is easily fixed in post. It needs to be able to level for tilt/pitch.4. Lens needs internal focusing - It's annoying to have the lens focus louder than the shutter. Plus, with the lens element going in and out, it can pull dust into the camera.5. OVF autofocus can easily miss - Even with the AF parallax correction box (which I highly recommend you turn on) the AF using the OVF can easily miss focus. Meaning, you can focus on the tree instead of the person, on accident.6. Macro AF is incredibly slow - Macro AF is very close. It's accurate, fortunately, but it's slow. Not a big deal though.7. Macro needs to be stopped down to F4.0 - Although not a big deal, F2.0 and F2.8 don't produce sharp pictures in macro. You need to stop down to F4.8. AF speed - Fuji loves to claim fastest AF speed. This must be a joke. AF speed is fast if focusing in sunlight on objects that are similar distance. For low light, or objects ranging in distance, the X100s AF is much slower. Olympus OM-D E-M5, E-PL5, E-PM2 (or newer) and Sony NEX-6 or even Sony RX100 are faster. From my experience, after 10,000+ frames with the OM-D EM-5, Olympus does the best CDAF by far. It's fast, and more importantly, it's accurate. Anyways, although the X100s AF isn't as fast as Fuji would like you to think, it's still fast enough for my use.9. AF Accuracy - Now this is where the X100s AF system fails. Not only does the X100s get a lot of failed AF (red box instead of green box), but it will give you false positives. You can get a confirmed AF (green box), and then when you check your picture, you'll see that it's in fact out of focus. Fuji's X-M1 (which I also have) doesn't seem to give nearly as many false AF, so I'm not sure why the X100s does this. Out of 100 shots, I may have gotten 5 or so missed AF using the EVF.10. Battery - You must buy spares. The battery is pitifully weak, and the X100s is the worst vs. X-M1, OM-D E-M5, E-PL5, NEX-F3, NEX-3N, NEX-6, and RX100. (I'm only listing cameras I have hands-on experience with). Spare batteries are cheap and small, so this isn't a big deal.11. Lens has a lot of barrel distortion - This is easy to see in the OVF. Doors / walls or other straight vertical lines 5 FT will appear curved. The camera will correct for it though. So not a big deal.So in summary, the X100s can produce wonderful pictures. Q menu is intuitive and easy to use, and the X100s makes it easy to take great pictures. SOOC JPEGs are great, and RAW files are malleable in the newest versions of Lightroom. Fill flash works well and the leaf shutter has some tangible benefits (high sync speed, fill flash, and super quiet).Here's what I hope Fuji fixes in the next iteration:1. AF Accuracy - Fuji, don't let CDAF fail with false positives. Seriously. (But I think Fuji is close, because I've had my X-M1 since release, and I've only gotten a few false positives, too few to recall individually).2. AF Speed - If you claim something, please let it be honest. Fuji's X100s CDAF/PDAF AF *may* be fastest in sunlight with AF on subjects that're at similar distances, but it's generally slow in real-world use. Everyone can do fast CDAF in sunlight. It's overall use that people remember, and in overall use, the X100s is comparatively slow. Olympus does CDAF best.3. IF - Make the lens internal focusing so it doesn't suck in dust and so it's quieter.4. Allow filters - Although you can buy a filter adapter, Fuji should have made it compatible with filters from the start. There may be an engineering/practical decision for this, but I'm not aware of one.5. Improve the EVF - I'm sure this will happen. EVF technology is getting better for everyone. Fuji just needs to use the X-T1 EVF in the next X100 iteration.6. Weather sealing - For a camera that begs to be your everyday companion, the X100s should be weather sealed. It feels solid in the hand, but the doors are flimsy.Recommended competition/alternatives: Keep in mind, nobody has an OVF as usable as the X100s, so there's no real direct competition.Affordable MILC without EVF: Olympus E-PM2 or E-PL5MILC with EVF: Olympus OM-D EM-10 or OM-D E-M1Compact Point-and-shoot: Sony RX100M2.I also recommend you check out the X-M1, X-E2, or X-T1 if you want to buy into Fuji's X Trans sensor.I'm really excited about what Fuji has been doing, and I can't wait for the next iteration of this camera. I'm also very happy that the camera is selling well because it'll encourage Fuji to continue with the X100 series.", "Date": "March 16, 2014"}, {"Title": "Almost there but not quite...", "Author": "Bryan Haywood", "ReviewID": "R359N79XR0QOYX", "Overall": "4.0", "Content": "There's a lot to love about this camera. It made me fall in love with photography again... I didn't think I could find a commercial grade camera in a body and for price like this one. This is the camera I always wanted Leica to make but they never did...Fuji did. Some of the wonderful things about this camera are:1. Almost unlimited flash sync speeds due to the leaf shutter... it instantly makes any external flash you have better and with such high speeds you can almost kill the sun!2. Built in 3 stop ND filter (helps with some of the limitations with a leaf shutter)3. This camera pretty much makes no noise... it's amazing at street/event photography.4. No AA filter, so you get crisper, sharper photos.5. The sensor has a special RGB pattern that is more randomized for a more natural/film like look.Before you read anymore... do yourself a favor. Go to 500px dot com and search for Fuji x100s and take a look at the quality of the photos yourself (this is something you should be doing with any camera anyways) and marvel at the quality of the photographs. This is a unique situation... because normally you would have to wonder and worry about what kind of lens that person is using and then feel helpless when you find out that lens is worth 2,000 USD but not with the Fuji x100s... everyone has what you have and what you see you can do it too. It's really quite empowering and I know there's some post processing but with the world we live in today you have some really cheap photography processing programs but that's another conversation.This camera would be really great for a person who has out grown a point and shoot and wants to get really serious about photography. The price is a little steep but I think with it's limitations it would really teach someone the fundamentals of photography. If you are a street photographer you should have one of these...unless you have the 10,000-15,000 to spend on a Leica and even then I think the Fuji is better. This makes a great travel camera (in good weather)and I would recommend this for photojournalist but the lack of weather proofing (I'll get more into this in a minute)makes me say no. Pros could use this camera as well and they do (David Hobby and Zack Arias, check them out).As much love I have for this camera there are a few things I would love to see in the next iteration of this camera that would make it perfect.1. Weather proofing- for a camera that boast that you can take it anywhere, the lack of weather proofing is a little disappointing to say the least. Dust scares the crap out me since I can't even take off the lens and clean anything...even the salty air of the sea scares me...salt film.2. WIFI- it's been in the most basic of cameras for a while now and for a 1,300 USD camera... there's really no excuse, it should have been in this.3. Function buttons- There is only one right next to the dials on top and it's great but we need more. I think one right next to the EVF on the hot shoe side would help out a lot. That way you could put that as the flash modes (if you wanted it to be that) and put a permanent ISO button on the scroll wheel rather than the flash mode button and then free up the F1 button for something more useful like the ND filter option. There might be room for third F button on the other side of the hot shoe as well.4. Warmer flash- Most everyone I know who uses this camera puts on a warming gel...myself included or do what apple has done and add second flash inside with one being cooler and the other warmer.5. Include a lens hood/ adaptor- we're paying quite a bit for this camera and it needs (deserves) a lens hood... and if you aren't going to include one don't make the thing 90-150 USD... it's just a piece of metal... I don't know anyone who buys the factory hood when you can get one for less than 20 USD that works just as good. I would rather support Fuji but not at the cost of an arm and a leg.6. That light in the back...For the love of all things holy...please... I said...PLEASE... let me turn that thing off completely. I and almost everyone else has had to put gaffers tape on this to block that annoying light.7. Battery issues-  it stays at 3/4ths for a while and then all the sudden it's dead with little to no warning. It could be a firmware update that could fix this  and even on the current camera but I'm not sure but if not on this one please on the next one make this camera better at telling how much life it has left.and now for the wishful thinking section of things I would like but probably won't happen.1. Touchscreen- it seems like a obvious choice and would make navigation quicker but I don't think Fuji is going for this on this camera...but it would be nice!2. Android Operating System- I would love to have different cloud drives to send my pictures up and imagine having snapseed or Photoshop touch on your camera...or even emailing your clients, Friends, and Family pictures right from your camera. I know android is a little wonky and not really made for cameras but it has a lot of support and don't get me starting on being able to do firmware updates without using a computer... that would be amazing.3. I'd like a 50mm equivalent version...not an adaptor with \"lens correction\" but a real 50mm tweaked for the best results for the sensor. I shoot street and while I like 35mm sometimes for shooting, I tend to prefer the 50mm range... I can't be alone on this. I understand it would take a way some of the simplicity of the x100 series but I don't really like being right up on people when taking street portraits.4. 20mp sensor- I know pixels don't matter after a certain point and with it being a crop sensor there are some limitations for pixel count but I'd like to be able to squeeze a little more detail out of the pictures I have without having to add sharpness or clarity in post. Also we all know you're supposed to crop in the camera and not in post but there are times you can't get close enough and it would be nice not to worry so much about loss of detail.All in all as it is now this camera is wonderful and the pictures and RAW files are superb and you should go and buy one right now if you haven't already.", "Date": "May 29, 2014"}, {"Title": "Another way to think for XE-1 Owners", "Author": "Sky Blue", "ReviewID": "RRVMLW1RYEWDE", "Overall": "5.0", "Content": "The new XF 23mm f1.4r lens currently sells for about $400 less than this camera.  It is one stop faster and supposedly is better optics.  I already own XE-1 body (see my review here: http://www.amazon.com/review/R1U7H3UI5RDDNH/ref=cm_cr_dp_title?ie=UTF8&ASIN;=B0092MD6QW&nodeID;=502394&store;=photo) and considered various glasses for street photography angles such as the XF 23 mm, XF 27 mm and XF 18 mm, but in the end decided to go for separate bodies: XE-1 and this X100s.  In other words, I would use XE-1 to cover most other angles, possibly with 18-55mm zoom lens, 55-200mm zoom lens, and some fancy lenses (Zeiss or Fuji's own 14mm or 35mm), and I would use X100s for street photography angle in lieu of 23mm, 27mm and 18 mm glasses altogether.There are multiple reasons for my decision:1. X100s is superb, both in body and lens, in the same league as XE-1 body with a fixed-focus lens.  I saw test shots comparing this one to XE-1 with aforementioned XF 23mm f1.4r.  Color renditions, contrasts and sharpness were almost indistinguishable, at least for the non-commercial purposes I was using.  Of course 1.4 would have a better bokeh, but for 23 mm use, that is not what I am looking for.2. X100s is so much less conspicuous, lighter and easy to carry around than XE-1 with XF 23mm.  The advantage of this could not be emphasized enough in real world situations.3. X100s has a better viewfinder - OVF/EVF hybrid, instantly switchable and individually customizable.4. Since even ISO 6400 produces usable results, one F stop advantage does not mean as much.  F2.0 is fast enough.In conclusion, if you are an XE-1 owner like me and think of buying a 23mm or other lenses for street photography, do not forget that you have the option to buy a whole body+glass combination at just $400 more.  It is every bit just as well made.", "Date": "November 30, 2013"}, {"Title": "A great camera that's a pleasure to use. You'll leave that bulky stuff at home.", "Author": "Fred C. Mcclanahan \"Agent-19\"", "ReviewID": "R2BY08PFCRFCSM", "Overall": "5.0", "Content": "I'd read all the hype about this camera for over a year but just wasn't convinced that I could do without my zoom lens and all that stuff I usually use when I'm on the go. Then, I remembered that I'd started in photography with a basic Pentax SLR with a 50mm lens - that's it - no autofocus, no meter, no flash - just a camera. I got great shots, shots that got me a job as a photographer. Could I could go back to being a photographer instead of a slave to all that camera gear?Last Summer, we took a trip to France (before I got the Fuji) and I took my Nikon D700 with my 28-300 FX zoom and a Nikkor 24mm autofocus lens. The zoom never went on the camera.  I used the 24mm for everything.  Then I knew for sure that a fixed-lens camera could work for me.What I like most:+ Amazing low-light performance. at high ISOs, this camera is wonderful. The images are clean and the color is true. I've never use the flash in low light unless I needed fill for some harsh lighting on faces.+ Great built-in flash. The flash doesn't have much range because with the camera's low-light capability, you don't need it. What it does have is the near magical ability to supply perfect fill for harsh shadows without over-powering the subject.+ Excellent electronic viewfinder. I use the electronic viewfinder almost exclusively. If you set the camera correctly, it automatically switches on as your eye approaches it. Viewing the just-taken image in the electronic viewfinder makes it easy to know you got the shot you wanted.+ Easy to use exposure compensation control - right where you need it. I use this all the time. Even with pretty good automatic dynamic range compensation, you sometime need to adjust for extreme highlights.  I photograph fires (as in structure fires) at night and cameras don't always know what to do with that much light and dark all in one place. Compensation is a breeze with the Fuji.+ Sharp, sharp, sharp. This fuji lens is as sharp as any I've ever used - and I've got some great macro lenses. The only thing that could mess it up is putting a cheap filter on it. I keep a filter on my camera for protection and I strongly recommend the Hoya 49mm HD2 UV (Ultra Violet) 8-layer Multi-Coated Glass Filter. Not cheap but worth it. It seems to repel dirt and water like those fancy glasses you see on TV.+ Good ergonomics. It's a pleasure to hold and use. Everything is where it needs to be. Just grab it and use it.+ The Quick menus are really handy once you've mastered the main menus in general (see below).The one thing I like less:+/- The menus are better that those on the X100, or so I've been told. There are still a ton of choices and it can be bewildering to anyone who wants a simple point and shoot. This is a serious camera and is at its best in the hands of someone with a fair amount of photographic knowledge. Without the right settings and and / or an understanding of how to make the right settings, much of this camera' capabilities might be wasted.Summary:I'm very impressed with this camera and it's the one camera I always have with me. But, it's best for general photography, casual pictures of people and groups of people. It's great for travel, landscapes and general outdoor photography. I wouldn't use it for portraits, party pix or sports photography.If you're a pretty knowledgeable photographer or enthusiast and looking for something much better than a typical point and shoot or phone camera - this is it.  Stop looking.", "Date": "May 22, 2014"}, {"Title": "My search is over!", "Author": "Cobra", "ReviewID": "R4XG4B9UMIISE", "Overall": "5.0", "Content": "I went through quite a few cameras before I settled on this one.  The added bonus happened when Fuji finally released one in Black!  It took me a while to get used to the incredibly detailed menu system, not because it's not intuitive but because there's so many different variables at your disposal.  Every aspect of taking a photo can be adjusted.  I've never had a camera so detailed as this one.  Once you get the settings you like for the kind of image taking you do, you will be rewarded with incredible images.  The form factor is so much more portable than a DSLR and the images blow away anything you'll get in those small sensor compacts that so many of us have been using.  The 35mm lens is perfect for a great deal of photography.  A few steps forward and you've got the field of view of a portrait lens.  A few steps backward and you've got the field of view of a wider angle.  Leaning to move around just a bit with your camera is a better idea than just zooming all the time.", "Date": "March 17, 2014"}, {"Title": "Perfect Bliss", "Author": "David Ausman \"VB.Net Guy\"", "ReviewID": "R3UJDMCBRQ8BC6", "Overall": "5.0", "Content": "I tried this camera and ended up being converted.  It has a soul.  Everything I do with it is so much better than when I had my full frame Nikon, which I sold after using the Fuji for a few weeks.  People relax around this camera and show no stiffness during portraits.  Once you try it you will never go back.  It makes photography seem fresh again.", "Date": "December 23, 2013"}, {"Title": "Excellent street camera", "Author": "S. Strembicki", "ReviewID": "R1CI001OCPXR5U", "Overall": "4.0", "Content": "To add some context, I own a Nikon D800 and D7100 which are my professional workhorse cameras, I have also been using a Panasonic GX-1 as my everyday carry around and party camera. I was looking for something a little nicer and as I teach a photo class in Florence, Italy in the summer, wanted something of a all day carry around camera and a camera that is not so intrusive. The Fuji X100S fits all those requirements. Its a great package, the Xtrans sensor gives a great file and I have made 20x30\" prints off of it. In my experience, you can push the ISO to nearly 1600 and get a file that has an acceptable degree of noise. In the aestectic side, the camera is often mistaken as a Leica film camera, a design element that I am sure did not happen by chance. With the standard built in lens, a very nice low key camera that is easy to carry (I also own the WA adapter, see my review of that).My only beef with the camera is the poor AF lock, compared to the Nikon and Panasonic, it at times failed to lock on at all and never had I had a camera with such a high rate of out of focus images. I use mine a lot in the manual focus mode and the hybrid viewfinder is terrific for that. the menu takes a bit to get used to compared to the Nikon, but its an improvement over the Panasonic. I really looked hard at the Fuji X1Pro and its a bigger body and not quite as elegant a design as the X100S. All in all, a good design in  terms of knobs and controls; a great sensor; old school aestectics in terms of its look and if you can deal with the short comings of its AF system, a really nice all around street camera.", "Date": "October 21, 2013"}, {"Title": "Worth The Wait?", "Author": "Matthew Richards", "ReviewID": "R15T1SJJW9S9YP", "Overall": "5.0", "Content": "I'm not gonna lie, I thought about canceling my order several times over the nearly two month wait that I had to receive this camera.  I'm pretty happy I didn't though.  This camera took some time to get used to.  It is much smaller than a dslr and the menu system takes a bit to get used to.  I'm finding the lens to be really great, though not perfect for a lot of types of photography.  If you're looking for fast action/sports photography then this probably isn't the camera for you.  If you're looking to do tons of portraits then you may want to consider an slr and a few prime lenses for the same price.  I'm finding that this camera can shoot good portraits, but it definitely makes you think differently because of it's wide angle lens.  You don't get a ton of bokeh, even when it's opened up at f2.  That being said this is a pretty great camera.  It's very discrete and good for walking around town without attracting too much attention.  The only attention I have gotten is when other photographers ask me if I'm using a film camera.  I'm giving this camera a 5 star rating because it really makes you want to shoot.  An slr is a tool.  It's just an ugly hammer.. but the fuji x100s is a work of art and inspires every time you pick it up.", "Date": "July 19, 2013"}, {"Title": "My new favorite camera I have with me at all times", "Author": "SithTracy", "ReviewID": "R2945GZS5G84IG", "Overall": "5.0", "Content": "The camera is a joy to use.  Has a fixed 23mm (35mm full frame equivalent) lens.  Shhhh... Silent!!!  You cannot hear this thing and I get shots of my family that I cannot get with my Canon 5D Mark III... they see that coming, this, too small to notice, to silent to know.  Love the hybrid view finder.  Toggle back and forth to make sure you are composed.  And the manual focus... WOW!!!  This thing does things my Canon cannot (well, not with stock firmware... Magic Lantern gets some of the features).  This is the camera I pick up first.  Can use my Yongnuo RF-603 II's to trigger off camera flash.It is truly a fun camera to use.  Needed some tweaks to make it feel at home in my hand.  A EzFoto lens hood, a Lensmate thumb grip, and a soft release.  I don't want to put it down.Download the manual from the Fujifilm site and read it.  Plenty of manual controls.  Nice Q menu.No, it is not a sports camera.  It does not replace my 5Dmk3, but I am looking forward to seeing what Fujifilm brings to the table with their mirror-less system.", "Date": "April 9, 2014"}, {"Title": "I'd give it ten stars if I could", "Author": "Larry Fasnacht", "ReviewID": "R27NVNRBBW0V4H", "Overall": "5.0", "Content": "Short version; this is my desert island camera.  If I could only have one, this would be it.  I also enjoy using a Nikon D300, D700, an Olympus OMD E-M5.  But the Fuji is a much better all-round camera/lens combination for me.Long answer;  Wow!  I bought an x100 in July of 2012.  I really liked the camera but there were a few \"quirks\" that drove me nuts.  And since I have not seen some of them addressed in other reviews, I will do so here.First I pre-ordered my x100s camera in January from Adorama.  I received it about a week ago and have shot about 2,000 images with it so far.  Super camera.Things that drove me crazy with the x100 were that I could not switch focus from Manual to Auto quickly as the Auto setting was in the middle of the three position switch.  That has been fixed.The manual focus on the x100 was a joke.  That has been fixed.  In addition the new focus assist features are very cool and work great.Another niggle, to take a shot with the flash on then take another with the flash off was very frustrating with the x100.  I had to wait until the camera finished writing the file, then turn the flash on then shoot.  The x100s allows me to switch the flash on and off while the camera is writing, also it writes MUCH faster.I am a Strobist fan and shoot off camera flash a fair amount.  To turn the off camera flash option on with the x100 was a mining expedition in the convoluted menu system.  With the x100s it is now one of the selections on the flash button, super easy!The menu system is FAR superior.  And the Q button makes many selections easier still.Start time when switched on is almost imperceptible.There are a few cons;  the RAW file sizes are about 32 megs each!  Having said that the JPG's are so good that I am seriously thinking about turning off the RAW capture setting.  I haven't tested it scientifically, but it seems to me that the battery life is even less than the x100 was, which was pretty dismal to begin with.  To be fair my batteries are older now so maybe that has something to do with it.  I have 5 batteries that I bought for the x100 that fit the x100s.  I won't leave home without at least one extra battery, probably two.Other than those two niggles, this is a super camera.I am glad I traded my old one in and bought this one.", "Date": "April 21, 2013"}, {"Title": "If 23mm (35mm) is your length, then this is your camera!", "Author": "Stefan Georgiev", "ReviewID": "R26PKSDLVJIR48", "Overall": "4.0", "Content": "Yes,the camera is really good.You may read all the positive stuff all over the internet.I'll tell you what I don't like. It will be more useful to know.The camera AF:It's fast, but not great. It still hunts, especially in low light and even in daylight when try to focus at close objects. This could be frustrating sometimes, but so far it's not something I can't live with.Real time exposure:the screen and the LCD don't show changes in the exposure in real time. you have to half-press the shutter to see how dark or light the scene will be. For example on NEX-7 the lcd/viewfinder changes in real time when you change aperture/speed/iso.Filters:I don't like the fact that you have to use the adapter in order to put a simple uv filter. And the lens extends quite, loosing the initial idea of small lens.How hard would be to make it possible to screw the filter directly on the lens?????External Mic:It does have an option to use external mic, however - good luck finding the adapter, as Fuji doesn't have the standard small jack input.And my biggest bug - the single 23mm lens. Yes, it's my favorite length - if I had to choose only one, that would be it, but I would prefer if it had similar to x20 lens.Besides those \"negatives\" the camera is amazing!Highly recommend it and I'm giving it 4 stars.Added:The jpg are quite smudged - yes they look very sharp, but have somehow water painting look. I believe they tried to clean some noise and then apply sharpening on top.The effect is not so visible when not look at 100%.", "Date": "March 28, 2013"}, {"Title": "I love it. I really do.", "Author": "Derek F.", "ReviewID": "RKAJ2574BKVFR", "Overall": "5.0", "Content": "Having a camera that is small enough to tote here and there with me is doing wonders for my portfolio of strangers doing strange things in public, or serving me food, or sleeping on benches, and having dozens of people each day compliment me on my spiffy little camera is doing wonders for my self confidence.Never again will I tote my unprestigious and heavy D90 about. Never again will I be forced to reply 'Well, it's OKAY.' to the queries of the uninformed about whether my mid-range Nikon DSLR is 'Good.' Now everyone knows me as 'the photographer with the cool little camera.' Bless you, Fuji, for, you have saved me from cursed anonymity.Actually, now that I think about it, there is a bit of a learning curve. You'll have to play with it for a couple of days before the tiny thing feels as natural in your hands as your old (obsolete) DSLR. On a DSLR, you literally have a dedicated button (or function+button) for everything you need. On this, if I'm juggling back and forth between changing ISO and turning the internal ND filter on and off, I'm going to have to do some menu-surfing. Smaller camera, less room for buttons, comprende?Aside from that minor quibble, I'm really happy with this camera. Just get some extra batteries- They're small, and you want to have one or two on you for when the EVF runs your battery dry. Again.", "Date": "May 21, 2014"}, {"Title": "Like this camera!!!!!  Definitely worth purchasing.", "Author": "DJ Miller III", "ReviewID": "R27ZCKXAEEWL4M", "Overall": "4.0", "Content": "I really dig this camera so far!  Well built, beautiful images, people drool over it when you are photographing with it.  Honestly it is truly beautiful.  I am still learning how to use it, but I am very happy with the focusing system so far.  Sure it back focuses some times but so do all my canon cameras including my 1DV and 5DIII.  It's not perfect, but no camera is going to be.  It chews through batteries, so make sure and get extra, get a lens filter to protect the lens, a lens hood, lens cap and a way better neck strap.  A protective case would be good as well.  It's not ready to rock out of the box so do some homework and get the items you will need to fully experience the camera.  Pretty fun to shoot at 1000 of a second at F2!  There are some minor complaints like not being able to shoot RAW and having the camera film presets being applied to the raw file automatically on upload.  Or not being able to shoot film brackets in RAW+Fine mode.  There are more things similar like this that bug me but all in all I still like the camera a bunch.  Get it while it's in stock!", "Date": "October 8, 2013"}, {"Title": "best camera I've owned!", "Author": "Radu Wolf", "ReviewID": "RZHSNBHRMMDYJ", "Overall": "5.0", "Content": "easy to use and logical controls. great color. great out of camera pics without need to retouch.stating all that, make sure you read the manual and understand how it meters and focuses!", "Date": "October 2, 2013"}, {"Title": "great camera, everyone thinks it's ancient", "Author": "Stevo", "ReviewID": "R1QF74M5OSO0C7", "Overall": "5.0", "Content": "the image quality is great, you can read all about it in forums.im not too happy with the focus speed, it's definitely slower than dslrs. you have to leave it on high performance mode for better af speed. pushing the ae-l button on MF mode might also be the quickest according to flickr discussions.i love using this camera for its compactness and fixed lens. i rarely shoot with my nikon dslr now. i may actually sell my nikon gear. you should also read the review by Zack Arias if you get a chance.dont bother adding shutter release buttons to this, it doesnt stay fastened.buy the x100s for the sharpness and the compact size. if your use requires faster af speed, stick with a dslr.cheers.", "Date": "August 20, 2013"}, {"Title": "Super sharp lens, very useful EVF, awesome JPEGS", "Author": "Marcus Censor", "ReviewID": "R9KVSVSC49WKT", "Overall": "5.0", "Content": "Awesome JPEGS? I know. It seems like an oxymoron. What the folks at Fuji have seemed to accomplish, however, is not only an external body which hearkens back to the film days, but a shooting experience that does so as well. Except you have all those sweet Fuji films bundled up in your camera body, ready to be used at your whim. Pretty cool. Oh, and they don't look like \"effects\". They look like exposures of film. Print a few jpegs, and you will see what I mean.By all means, if you are looking to simplify things and willing to trust the awesomeness of the x100s film jpegs, take the plunge and don't look back.", "Date": "April 15, 2014"}, {"Title": "Almost perfect", "Author": "Ponskippa", "ReviewID": "RSRUIZAH6ONCN", "Overall": "5.0", "Content": "I've owned this camera for almost 2 weeks now. I read a bunch of reviews online from various street photographers who praised this camera. I finally took the plunge, and i do not regret it one bit. This little camera has awesome image quality, very sharp. The main reason i wanted it is because it is so small, and so \"portable\". No more carrying around a huge DSLR and a handful of lenses. No this camera does not replace a DSLR. It's not intended to. What this has done is made photography fun for me again.I own a Nikon D7000 and the image quality is on par if not better. Depending on what lens i have mounted onto it.Back to the Fujithe Lens on this camera is fast, sharp, i love the Aperture dial on it.The hybrid viewfinder is amazing, i remember telling myself WOW when i put my eye up to it.If you are looking at this camera, I am sure you have already read a ton of reviews about it.I am here to confirm that this camera is Legit. I may end up selling my DSLR in the long run.one minor thing that bothers me about this camera is that when using autofocus through the optical viewfinder. \"The frame\" which you compose with tends to readjust toward the focus point when shooting. Ill have to dig through the manual and see if i can turn this feature off. If anyone knows about it? Leave a reply? Thanks!", "Date": "March 16, 2014"}, {"Title": "Great Camera", "Author": "William A. Koplitz \"Imagetracker\"", "ReviewID": "R35K9305A72OYZ", "Overall": "5.0", "Content": "This is a great camera and I'd recommend it to anyone.  This size and weight is perfect, the lens is sharp and the sensor is excellent producing great image quality.  The shooting controls are easy to get to and are mechanical making this one of the easiest cameras to work with and with the rangefinder it's very easy to use and helps get sharp photographs in manual focus mode.  I've found that it's difficult to get sharp focus with an a led screen.Pros are:  size, weight, image quality, battery life, focus speed, build quality, short focus distance and the rangefinder is one of the best I've used and this camera is quiet.  It's a great match for my style of photography.The menu and controls take a little working time to get used to, but once I did I found it to be as easy as any other camera I've ever used.", "Date": "January 30, 2014"}, {"Title": "Love this camera!", "Author": "Ryan Greeley", "ReviewID": "R21TE98XT5I1BA", "Overall": "5.0", "Content": "I have used a DSLR for years and have been very happy with it.  However, with a full time job and a family I have less time to dedicate to photography.  And I have less space on my person for camera gear.  The X100s addresses both of these needs perfectly:1) Time.  I have hundreds of unprocessed RAW files on my computer from holidays, vacations, etc.  I don't have the time to process them all. The JPEG engine on the X100s is wonderful.  I find myself shooting RAW+Fine and using the JPEGs most of the time.  This saves me a ton of time in post-processing.2) Size.  Lugging my huge DSLR and pro lenses when traveling with the family was becoming cumbersome. With the X100s it is much easier for me to wrangle the kids and still take all the pictures that I want.This camera has become my daily shooter.  My DSLR is now more of a specialty camera - for sports (fast autofocus) and scenes that require different focal length.", "Date": "January 29, 2014"}, {"Title": "Great little camera", "Author": "Roxanna L. Harvey \"outdoor girl\"", "ReviewID": "R2VP1Z3LBFFRVV", "Overall": "5.0", "Content": "This camera is easier to carry around than my DSLR and it takes great pictures.  It is easy to use and the results are fantastic.  So far I haven't missed having a zoom lens.", "Date": "October 4, 2013"}, {"Title": "Wonderful carry anywhere performer", "Author": "E. A. Gonzalez \"creative professional\"", "ReviewID": "R2PE41MC6A7Q71", "Overall": "4.0", "Content": "I admit, I have G.A.S (gear acquisition syndrome), i'm a sucker for new camera gear and usually sell 'old' to fund new purchase. The X100s is one camera that will not see the same fate. It's my take anywhere, specially while running errands, camera. I recently sold my Nikon D7000 and 17-55 f.2.8 to fund my entry into the fuji family. I started with Fuji Xe1 and 35 f1.4. That lens was absolutely outstanding!! My only issue with it is that the approx 50mm (35mm equivalent) was just too long for my indoor shooting style. I was looking forward to fuji's 23mm, but it was just too big a lens for me. I sold the Nikon gear for that reason; too bulky. I realized that at the moment i had no need for an interchangeable camera system so sold XE1 kit and bought X100s. No regrets. I'm comfortable with fixed lens and is perfect for indoor candids of family and friends. I may have been spoiled by the speed of Nikon's focusing system, which is why I only gave it 4 stars. Don't get me wrong, it's still quick, you just need to take the time to learn the camera.", "Date": "March 11, 2014"}, {"Title": "A Must-Own For Any Photographer", "Author": "JM", "ReviewID": "R2NACEKOSV4QRL", "Overall": "4.0", "Content": "This camera is hands-down the best camera I have ever owned. That being said, your next question logically is \"if it's that good, why not five stars?\" The only reason I haven't sold my thousands of dollars worth of Canon equipment is that because you cannot change lenses on it, the camera becomes slightly less versatile than a camera whose lens can be changed. Which to be honest is why I'm writing this review, because I've fallen in love so much with my Fujifilm that I'm looking to buy a similar body style with interchangeable lenses, and I realized that I should probably write a review to help someone who might be in a similar position to me.  To be clear, I am by no means a professional photographer, it's just a hobby that I've been into for a while now. I won't list off any crazy technical details, you can find that in the description or in a post by a professional. But, I've been using this for a few months now, and I've gotten to know the camera pretty well. For starters, it's slim, not bulky in the least. Which is not to say that it's flimsy, it has a good solid build to it that you won't have to worry about how it's going to hold up. The first thing anyone who sees the x100S says is \"wow, is that an old camera or a new camera?\" It has that \"retro\" look that's cool now because of all these hipsters, but there's a reason it has that look. It's a classic style because it works, it feels comfortable in your hands and it just feels right. It looks gorgeous, there's nothing frail-feeling about it.  It has three viewing modes, which are the optical viewfinder, digital viewfinder, and the back display. As you're looking at the front of the camera, the switch at about the 10 o'clock position of the lens with the red dot on it controls whether you want to use the optical viewfinder or the digital viewfinder. The optical is nice if you're looking for a more \"authentic\" experience with a rangefinder, but my personal favorite has become the digital viewfinder. Not only will it show you a live view of almost exactly the picture you should expect to take through the viewfinder, but it also has leveling lines that, when aligned, become one green line to show that you're holding the camera level.  Yes, the autofocus is fairly quiet and it's pretty fast, but as far as I'm concerned, who cares about the autofocus? When you're shooting with it, you don't WANT to use the autofocus. I went years without using the manual focus on my Canon SLRs more than a handful of times, but I never take this camera out of manual focus. It might take a minute to figure out, but it's not bad at all. While using the optical viewfinder, it looks just like focusing with any other lens, but in the digital viewfinder, it's completely different. As soon as you start adjusting the lens, it goes from color to black and white, and it digitally zooms in on a spot. You then find what you're trying to focus on and adjust the lens so that your subject becomes very sharp, and you know when they're the sharpest because they're very grainy, like you cranked up the ISO. Once you're focused, you can depress the shutter button down halfway to exit out of that and then go for your shot. It sounds very complicated, but once you use it you'll find that it's really not. Another interesting feature with the viewfinder is the sensor that is right next to it. It will detect if the viewfinder is up to your eye, so when you put it to your face the backscreen shuts off and the information transfers to the viewfinder. When you take it away, your backscreen comes back on. There are many little features on the camera like this that just all add up to a great experience.  The 23mm lens is a practical focal length for every day use, mostly street photography and portraits, in my experience. While you can't change lenses, the lens that comes with it is great, it's fast, sharp, and quiet. Combined with the cleaner high ISOs, it can shoot in low light well enough to put my Canon to shame. If you have to be \"stuck\" with one lens, this is the one to be stuck with. It  Enough with the pros, here are some cons: battery life is terrible, I have to switch batteries almost every time I take it out for a day of shooting (and I don't use the live view on the back.) Therefore, I have a total of three batteries that I carry with me every time I take the camera everywhere. Luckily, they're relatively small, so I keep them in a pouch and they fit comfortably in my pocket. Not necessarily a \"camera\" review, but a heads up, if you're looking for a case for it I would not recommend one of the leather cases that pop up all the time in the searches. While yes, they will protect your camera and yes, they do look nice, I have two problems with them. One, they're a hassle to deal with. It's unlikely that you can access the camera with one hand if you needed to. Two, IF you decide to take the memory card out or WHEN you have to replace the battery (which is quite often), you have to undo another two snaps and then take the bottom off. It's too much of a hassle, too much work, it's too complicated and too bulky. (My suggestion is a something like a Domke 710-10D F-901 pouch which will hold the camera and an extra two batteries, but that's just me.) If you shoot in RAW (like I do) and use Adobe Bridge (like I did), those days are over. While Bridge works just fine for my .CR2 files, it doesn't recognize the x100S' .RAF files and therefore become useless. My solution was to switch to Lightroom, but that's for another review.  I have never touched the x100, so I cannot do comparisons to that, and I don't shoot video, so I can't write about that, but just taking my camera with me different places I go it has proven itself to be a great, solid, reliable camera. Whether you own it because it's relatively compact, or for the quality, or just because of how gorgeous it looks, I think every photographer should own one.", "Date": "November 14, 2013"}, {"Title": "Amazing camera!", "Author": "Ryan A. Graves", "ReviewID": "R3F3I75TWA5BNL", "Overall": "5.0", "Content": "this is the best amateur camera on the market. take beautiful photographs and forces me to really learn photography. i couldn't recommend this camera more!", "Date": "May 29, 2013"}, {"Title": "Only thing missing is an M mount!", "Author": "J. Howard", "ReviewID": "R39BL3182NOE27", "Overall": "5.0", "Content": "I got mine last week, and so far I've shot a few hundred photos with it.  Admittedly, this isn't a very long term review, so we'll have to wait and see if any major quirks or mechanical defects rear their heads.So far, this is exactly the camera I've been waiting for someone to make - with the exception of the fixed lens.  If Fuji releases an \"X200S\" (or X101S or whatever they end up calling the next generation) with a detachable lens mount that I can adapt to Leica M or even Canon EF (sans adapter glass!), I'd swap in a heartbeat.That said, I'm enjoying shooting this camera more than any of the others I own or have owned - it's much, much more handy than my big DSLR's, and much more capable than any compacts I've owned.Also, the hybrid viewfinder is the best thing since sliced bread, and the high ISO performance on this camera has to be seen to be believed.  In a word: phenomenal!", "Date": "June 27, 2013"}, {"Title": "Big usability improvement over X100", "Author": "Kevin", "ReviewID": "R2D17HSCIXWW5R", "Overall": "5.0", "Content": "I've been using the X100S for about a week after previously owning and using the X100. The camera is a joy to use. The size is perfect for me for many situations -- small and light enough to not feel heavy or burdensome or intimidate people, but large enough that I can get a good grip on the camera, keep it stable, and easily access all the important controls. (For a smaller \"pocket\" camera I love the Sony RX100.)Here are the most important improvements of the X100S over the X100 for me:*Better autofocus*Vastly better manual focus (you'll need this in very low light situations)*Faster on/off, electronic/optical viewfinder switching, picture writing & viewing, etc.*Better high ISO image quality*MUCH easier to change auto-ISO function on the fly (this is important)*Higher resolution electronic viewfinder*Better menu system & \"Q\" menu for quick access to a lot of featuresIt's just a great camera. Expensive but worth it. Watch for open-box deals to pop up on this site.", "Date": "May 5, 2013"}, {"Title": "Much improved handling from the X100", "Author": "Craig Wu", "ReviewID": "R16L4SX79ETLX", "Overall": "5.0", "Content": "I really wanted to like the X100 but found myself frustrated with the ergonomics during actual shooting. AF was good enough, image quality was superb, but the inability to move the focus point with one hand as well as the macro distance switchover made the camera difficult to like. These last 2 issues have been addressed with the X100S and it's made it a much more enjoyable camera to use. The X-Tran sensor is sharp and RAW conversion in LR 4.4 is fine. Overall the camera is faster - AF, startup, card write speeds, but I could live with those with the X100. For me, the AF and macro handling improvements make the X100S a very worthwhile upgrade over the X100.UPDATE: I find the X100S to be great for casual portraits with an off camera flash through a Lumiquest Softbox LTP in the left hand and the X100S in the right hand triggered via PocketWizards (Plus III on the X100S and FlexTT5 for the flash). Even with a Plus III the X100S is a nice weight for one handed shooting. While this was possible with the X100, because it took 2 hands to move the AF point you ended up recomposing, which at f/2 was always hit or miss due to OVF parallax error (even with Corrected AF on). With the X100S i can move the focus point with my right hand on the X100S keeping the flash in my left and get much better portraits on the first try. With the X100 it was always \"Ok wait wait let me adjust something...Ok now let's try again...wait wait...\" repeat.For those with an X100 wondering if it's worth the upgrade, for me this is the reason to upgrade. If the AF point selector was moved on the X100 via a firmware update I'd stay with the X100.", "Date": "April 17, 2013"}, {"Title": "And I thought my x100 was AMAZING...", "Author": "Ryan Gallant \"RRG\"", "ReviewID": "R29JI00FNBD58H", "Overall": "5.0", "Content": "When I got my x100 I was immediately amazed, the pictures I could make were art, the build quality was awesome, and overall I was in love.  And like love there were so many frustrating little quirks that had to be learned and mastered, those went fast though, it really is an artist's camera.  Now when I saw the specs of the x100s I knew I had to have it, most of my complaints (although minor) were addressed, and my one major complaint, the shutter speed was addressed in a big way.  I have had the camera for the better part of a day and so far this camera is UNBELIEVEABLE it is so fast, and the EVF is so much more vivid and crisp, there are some changes, some improvements to the menu structure, the new sensor is phenomenal, the auto focus is lightning fast, the camera has the same intelligence as its predecessor when it comes to white balance, choosing the correct autofocus point, and flash control, it also seems almost incapable of producing noise until you get to nearly unbelievable iso's, it also seems to have night vision, it is definitely more comfortable in low light than the x100, and the colors it produces are so rich and vibrant.  This camera is kind of like Fujifilm listened to its customers, fixing what was needed, not tinkering with the good, and upgrading the cr@p out of everything else!  I wont be using my Nikon D300s much that's for sure.  I think what I like best about the x100 and x100s is that they have made me a better photographer.", "Date": "March 28, 2013"}, {"Title": "Fuji X100s", "Author": "STEVEN A LIMON", "ReviewID": "R23ZZKJ6QJEYI5", "Overall": "5.0", "Content": "If you're OK with a  fixed prime, this camera is a great deal.  Well built, awesome pictures.  Get one !", "Date": "November 19, 2013"}, {"Title": "Great camera", "Author": "J. O'Neill", "ReviewID": "R3R43LLU1D5SIZ", "Overall": "4.0", "Content": "This camera is everything it's cranked up to be, but it really is important to read the manual. Otherwise you can make some real mistakes. You do have to watch the dials on the top. It's way too easy to turn one without noticing it. Otherwise, I've give this camera a 5 star rating. If they have 4.8 stars, that's how I would rate it.", "Date": "November 18, 2013"}, {"Title": "Seriously amazing", "Author": "Jeff Soto", "ReviewID": "R2JLD3B9BTZ8EK", "Overall": "5.0", "Content": "I can't recommend this camera enough. The picture quality is amazing and performs really really really well in low light.", "Date": "September 6, 2013"}, {"Title": "Pictures are sharp, OVF/EVF is innovative, manual controls are handy... flipping from screen to evf for settings is confusing", "Author": "Chris Holland", "ReviewID": "R1CSE2W1671BZL", "Overall": "4.0", "Content": "I love almost everything about this camera.  The feel, balance, performance, image quality, retro look, sharpness.  The overlay of picture information in the OVF is handy - but sometimes difficult to read in bright situations.  The only thing that bugs me about the camera is that when you are trying to select things other than aperture and shutter speed then things get really confusing.  I haven't yet figured out what (if anything) I am doing wrong - but making changes from the screen seems to not then flip back to metering and other info in the OVF when you put your eye up... and then sometimes I can make changes to settings in the OVF - and then sometimes not.  Perhaps the eye sensor is not functioning or I am doing something wrong... or if there is a button to make the switch between screens and turn the eye sensor off that I havent figured out yet...", "Date": "September 5, 2013"}, {"Title": "Best all-purpose camera", "Author": "Jeanne Gardner \"JeanneBean\"", "ReviewID": "R37O31Y2H6GPPE", "Overall": "5.0", "Content": "The Fuji X100S is just about perfect. Great lens, perfect size, + flawless photos. Can't recommend it enough. If you're only going to carry one camera, this is it.", "Date": "August 29, 2013"}, {"Title": "This was what I wanted fix lens and ZOOOOM w/my feet", "Author": "steven swaby", "ReviewID": "R29OFYUPEPAZTV", "Overall": "5.0", "Content": "I'm not a pro of any sort, just like taking pics of my kids, family and anything worth while. The pics I get from using this camera is so good I only crop and tone the photo if need. Heads up it will take some getting use to, but like anything else if it is easy it might not be worth it 16mp APS-C like a pro enjoy", "Date": "June 16, 2013"}, {"Title": "In love all over again", "Author": "..jarno", "ReviewID": "R34BME79A8AS00", "Overall": "5.0", "Content": "There's so much to explore and discover about what makes this camera so amazing. The thing can practically see in the dark better than my own eyes, the q menu is a godsend and the unit impresses with every exposure. It's reinvigorated my love for photography  ..... Incomparable until you try it on your own. Do not expect a point and shoot marvel, this guy takes some patience and effort to unlock its abilities, I was still blown away my first set of out of the camera exposures, it only gets better.", "Date": "April 5, 2014"}, {"Title": "My All Around Favorite Digital Camera", "Author": "Frank A. Vincent", "ReviewID": "R3CDGI8VRS55CB", "Overall": "5.0", "Content": "Get one while you can!  The X100S is my grab and go camera.  With the recent software upgrade, it is a truly professional fixed lens wonder.  It doesn't do everything, which is why I bought the XS-1 also.  It does, however, perform in low light, indoors or outdoors, is easy and quick, and gives all the options I could need.  I use it for shooting events, family, scenic, low-light.  I have used mine for over a year now, and have only one complaint.  The battery can be inserted backwards, so it sometimes takes a couple of extra seconds to get it in correctly.  Minor problem. I find it easier to use than the XS-1 because it has fewer automated options to get wrong.  All in all, it's the unsurpassed image quality that continually sells me on Fuji cameras.", "Date": "December 9, 2013"}, {"Title": "Just say'n, it's true... the camera is fantastic", "Author": "Bob North", "ReviewID": "R3AF3UL3G9ZJ0G", "Overall": "5.0", "Content": "Plenty of reviews here. Don't need much from me: It looks like my first German camera back in 1959. It feels like it. It does much more, much more easily. The results are fantastic. You don't need telephoto when image is this good. I'm just enlarging on my computer. It took two months to get it from Amazon but was worth the wait. I love it. We also bought the X10 and love that as well.", "Date": "August 19, 2013"}, {"Title": "not sure I'm in love, but it's a neat camera", "Author": "D. Jacobowitz", "ReviewID": "R2YTPL52HD5FMD", "Overall": "4.0", "Content": "My other camera is a Canon 5D3 with some pretty expensive glass, including a Sigma 35/1.4 that is usually on the camera. But it is a heavy combination and people are over the moon with the X100S, so I thought I would try it out as a more portable replacement.After about two months, I like the weight and the UI is fine when using the controls but not so much fun when using functions you have to go to the buttons for. The AF is good, not great, nowhere near as good as the 5D3 -- expected despite some of the hyperbole on the web.IQ can be great, but I think the FF SLR is more consistent, actually. WB is definitely good. The OOC JPEGS are great. I haven't spent too much time with the RAW files, so I guess that means I like the JPEGs.", "Date": "February 15, 2014"}, {"Title": "Good Camera for the right people", "Author": "Kenneth J. Hudak", "ReviewID": "R1FQXCVRRYI6HC", "Overall": "4.0", "Content": "This camera takes very nice pictures for the most part . I do find the jpegs to be too smooth at high ISO...yes I know one can make adjustments to help alleviate this problem...but not in its entirety...I guess working in raw may be the better option...but for all saying this is a great street photographers camera....well in very good light it is...but get on the shady side of a street and this camera will be slow to focus...to shoot street with this camera the best way to go is to set this camera up to use as a rangefinder as opposed to using autofocus...learn your hyperfocal distance and set this camera up accordingly ...you will be very pleased...and maybe learn another way to do photography...good luck with this and enjoy", "Date": "December 12, 2013"}, {"Title": "Awesome upgrade to an already sensational camera!", "Author": "Stratman \"Don\"", "ReviewID": "R3OMS3WCY46082", "Overall": "5.0", "Content": "I just got my X100S today - I ordered it through Amazon back in mid-January.  It will replace my X100, which is a great camera with a few minor annoyances.This review will be short, as I've only played with it for a few hours; I'll update is with a more detailed analysis in a few days.The X100S boasts a completely different sensor system that by all accounts is a significant step up from the X100's already excellent sensor that produces outstanding images.  A couple of quick observations:-  The 100S boots up/resumes much more quickly than the 100; the latter could be painfully slow to boot/resume, resulting in lost - or hurried - shots.-  The \"OK' button in the middle of the rear command dial is now raised such that it can easily be pressed without danger of accidentally mashing down one of the other  dial selections, like \"trash\" or \"flash\".  I often had to use my fingernail to press \"OK\" to avoid hitting something else instead.-  Autofocusing is MUCH faster-  Lowlight focusing is now much faster and more accurate.- The focus mode selector switch on the left side now puts the \"continuous focus\" in the middle postion, making it less likely you'll select it by accident when you're actually intending to select single AF or manual focus (since the latter are now at the upper and lower extreme of the switch's travel).These are just some first impressions, but I'll be back with more later.Update, 4/29/13 - still learning about the new features.  Having owned an X100, in my early use of the X100S I tended to treat it as the same camera, but with speed improvements to low-light focus and similar issues.  The X100S incorporates \"focus peaking\", which is a very useful tool for manual focusing (keeping in mind that extensive manual control is one of the things that makes the X100/X100S great).  Focus peaking essentially is a high-tech version of the split-image or blurred image circle tools found in early (non-digital) SLRs.  It's an invaluable tool for using the manual focus feature of the X100S.  Since nearly all autofocus cameras have some issues in low light, focus peaking is a wonderful alternative: use manual focusing, but turn on focus peaking (there are two versions on the X100S).  More later, but suffice to say that X100S corrects almost all of the nagging deficiencies of the X100.", "Date": "March 29, 2013"}, {"Title": "Didn't Live Up To The Hype", "Author": "MJT", "ReviewID": "R19583G9P9QBDW", "Overall": "3.0", "Content": "You're probably reading this to ascertain why someone would give this universally acclaimed camera only a 3 star rating.  I fully expect the Fuji x100s faithful will submit many comments to challenge my review, but it is what it is.Let me first note that my primary use for a camera is to shoot indoor photos of my one year old girl.  And for comparative purposes I've been using an Olympus E-PM2 with a Panasonic - Leica 25mm 1.4 lens, which I was expecting the x100s to replace.The first issue I encountered has nothing to do with the camera itself, but rather Amazon.  Based on the condition of the camera upon arrival, it appeared to be an open box item, which is hard to imagine since the all-black version only just came out.  But let's get to the camera itself.While I loved all the traditional dials on the camera, the overall shape just didn't work for my hands.  I just couldn't get a good grip on it and the surface had a plastic, slippery feel to it.  Always felt like I was holding it with my fingertips and expecting it to fall at any second.  Just couldn't get comfortable using it.  Yes, I realize there are aftermarket grip solutions for this, but my review is based solely on the equipment out of the box.I also experienced several occasions when the display would go blank for about five seconds for no known reason.  Then it flickered back on and worked just fine, allowing me to continue using the camera. For this reason alone, the camera will have to be returned as there is definitely something wrong with it.As for the quality of the images I took, all of them appeared softer compared to those taken on my Olympus/Panny-Leica 1.4 despite multiple adjustments to the x100s settings.  I also preferred the colors from the Oly, which did a better job of capturing the blue of my daughter's eyes.  The skin tones, while spot on from a color perspective, had a smeared/brushed look to them that lacked natural texture.  Granted, colors are a subjective issue and can always be adjusted via software processing, but my comparisons were based solely on images straight out of the camera.  The image differences between the x100s and Oly are well-exemplified by comparing Ken Rockwell's photos that are part of his x100s review and various Oly reviews by Robin Wong.  Some may certainly prefer the x100s, but I found the Oly photos more pleasing.  Again, this is a subjective area.Of course, the autofocus was also nowhere near as fast, with the x100s prone to hunting.  But this was no surprise based on many professional reviews and I found the AF manageable once I got used to it.I definitely wanted to love this camera, but my existing Oly simply does a better job at producing sharp images with pleasing colors at a much lower cost.  Granted, this camera may provide substantially better results for outdoor/still photography.  But for indoor shooting, I wasn't impressed. As a result, the hunt for the perfect camera continues.", "Date": "February 8, 2014"}, {"Title": "Great family shooter but ...", "Author": "D. Roos", "ReviewID": "R1ISISTXPCD473", "Overall": "4.0", "Content": "Me: I understand cameras and photography but I'm not a hobbyist. My main goal is to get great pics of my family.Pros:* I've had it a month and have already taken some of my best family shots of all time* If you like to tinker with a gadget this camera will keep you engrossed for quite awhile* Much lighter and smaller than an SLR* A good value for the money. I've seen many comments about this being a pricey camera, but it's all what you compare it to, and the value to you of great photos* I agree with some reviews that the fixed focal length (no zoom feature) is actually kind of liberating. Just walk right up and snap your photo. Some competing cameras have smaller bodies, but when you attach any lens then they're much bulkier.* The built-in flash seems to work really well.Cons:* Can I give it to my wife who doesn't like to \"fiddle\" with technology and expect a great result? Maybe.If I've taken a moment to re-set it \"standard\" settings then YES. If I've accidentally left the neutral density filter on or changed the drive mode and forgotten about it, then NO, it could stump her and she may get bad pictures.* Much larger and heavier than a pocket camera. You'll never forget you have it with you. I'm sure future models will get smaller.* This would not be a good camera for sporting events or school plays because you can't zoom in. Also, at home you may not be able to  \"sneak\" pics of the kids from a few feet away without them noticing.Suggestions:* Even though it's a \"semi-pro\" camera it sure would be nice to have a total auto setting and also some scene modes like portrait, sunset, etc. The auto settings would be great for lazy moments or if one is in a hurry.* Definitely buy Alexander White's Photographer's Guide to the Fujifilm x100s as a companion. You just spent $1300 on a camera, treat yourself to a proper owner's manual.* If you want to see photos taken with this camera, and others, go to Flickr and do an advanced search by camera model. Very cool. Also a Flickr account is free for a terabyte of storage. Awesome.", "Date": "January 28, 2014"}, {"Title": "Favorite Camera", "Author": "Joseph Anderson", "ReviewID": "R15ML8VSJIPEIR", "Overall": "5.0", "Content": "My favorite camera ever. The 5D mark II is like the wife I've been married to for too long. The X100S is my fun fling!", "Date": "June 25, 2013"}, {"Title": "ONLY FULL-FRAME COULD BE BETTER!", "Author": "David L.", "ReviewID": "R13P67XNN8G2J2", "Overall": "5.0", "Content": "Now that I travel a lot more internationally, I wanted a camera that delivered images as wonderful as the ones I used to get with my DSLR but in a much smaller and portable package.  This image quality of this camera combined with the clarity and sharpness of the lens is RIDICULOUSLY GOOD.I am still playing with it and learning the features but so far I believe other reviews which have said this is about 80% of a Leica rangefinder at 20% of the cost (15% for my deal).  I'm very, very pleased and that is saying something because I am extremely particular when I fork out hard earned money on a camera.  I will trade this in once Fujifilm (I hope) puts a full-frame sensor in a body like this - that would be perfection!", "Date": "May 12, 2014"}, {"Title": "\"Hey Mister - is that an antique camera?\"", "Author": "HD_Dude", "ReviewID": "RVYRG3PY63QZ4", "Overall": "5.0", "Content": "I really love this little camera.But right up top, let me say - whenever I'm out with it, I use the Fujifilm leather case, with the top part back in the hotel room, so I just have the bottom part and the leather strap.And it is hilarious.Random people everywhere say - \"Wow, what a cool antique camera!\" And \"Hey Mister, how old is that camera?\" And, \"Leave it to Steve to have a 50 year old camera with him.\" And my favorite: \" Is that a Leica?\"Ha!My responses? Kind of depends on the knowledge level of the person. But typically...\"Actually, it's brand new, with an insane sensor, as big as a Nikon DSLR. The hottest little camera on the planet. Oh...and one more thing: No zoom. To zoom in? You walk forward. To zoom out? You walk back. It's a prime.\"At this point, the unenlightened kind of glaze over. But true shooters lean in...with an awesome...\"wow\"So, yes, it shoots great photos. And yes, it's flipping amazing. But get ready for some social interaction - with the  X-100s.", "Date": "February 25, 2014"}, {"Title": "Late to the X - camera movement, but what a joy to use the X100s", "Author": "Gregory Stoner", "ReviewID": "R2ALVW7OIK16P7", "Overall": "5.0", "Content": "First thing you feel is how small and light and solid built the camera is.  then you put your eye up,  wow OVF with overlaid HUD is fantastic, a histogram right there for you to see.  The images out of the camera are very good.  This really is camera that make you better photographer, since it gets you to move around since you on fixed focal lens.  it really make think more about the shot and give you the tool make it happen.  This camera I have with me alway.  It is a solid photographer tool.  Also I love having access to manual set up of Aperture and Shutter speed  so quickly before I go into a shot.Now if you looking to do lot of Video work with camera of this class  I would look at the A6000 or Alpha7 this has limited video capabilities.When you get the camera pick up some STK FNP-95 batteries they inexpensive and work well.  Also recommend Lensmate Thumb Grip and Soft Release Button; EZ Photo Metal hood, and B+W 49mm UV filter.  One thing put the filter after the EZ Photo ring then put on Lens hood when you need.  Without hood the normal lens cover still works to cover the Filter and lens", "Date": "March 1, 2014"}, {"Title": "Image quality is astounding. Autofocus is not", "Author": "Rick Prescott", "ReviewID": "R387WQMMQR2PJM", "Overall": "4.0", "Content": "First, the image quality of this camera is very impressive. Extremely sharp and with the f2.0 lens, you can get wonderful bokeh effects. What I do NOT like is the slow autofocus, which seems to occur in both dim and bright environments. I am not expecting dSLR speed, but the ability to focus rapidly and capture images of people. Like many guys, I bought this after selling my dSLR gear that was simply too big and heavy to use consistently. I keep this camera out on the table so if my family does something funny or cute, I can take a picture right away. The slow focus, however, is very noticeable and I am beginning to not trust the camera to do what I want it to do.An upcoming vacation will be the real test, including taking some family portraits for friends. If it fails or gives me softly-focused shots at that time, I will be very disappointed and will likely start looking fondly back at my Nikon, which was always lightning-fast and focused spot-on.", "Date": "February 10, 2014"}, {"Title": "I am taking this camera everywhere!", "Author": "candid_review", "ReviewID": "R1NQEU0ZWFSDW1", "Overall": "5.0", "Content": "I have used LF, MF and 35mm cameras, nothing comes close to having so much fun as with my little Fuji x100s. I have been using this camera for approximately a month.There are many other very useful reviews here, so without having to repeat all the plus-es and minus-es, here are something I would like to highlight: (Firmware version 1.10) :1. JPEGs of very high quality. I stopped capturing in RAW -- a practice I have always followed for my dSLRs.2. An incredible viewfinder system, which is actually two displays inside called EVF (electronic) and OVF (optical) view finder. You have to try out the camera to experience the joy.3. The very quiet Leaf shutter. I just love the freedom I have of shooting with a flash at practically speaking any shutter speed.4. High quality lens in a high quality and very compact camera body.5. Exposure preview -- available in manual mode. I use it all the time, if possible.Here are a few enhancements I would like to request Fuji:1. 'Preview exposure in Manual mode' option: It has two choices: On and Off. It should have a third choice: DOF preview. That is, when the shutter is pressed for DOF preview, the exposure preview would also be available. This would be hugely appreciated in the upcoming firmware updates -- I hope somebody from Fuji is reading this!You need this when the shooting conditions are a bit dark, and flash needs to be mixed in. Exposure preview is desired, but so is a faster speed to shoot at! If you increase the shutter speed, exposure preview makes even focusing hard in lower lights. So this exposure preview along with DOF preview will help! To summarize, one can not always shoot with 'exposure preview' turned on, so the momentary exposure preview will help!2. The 'fn' button should give more choices: e.g. flash compensation. Right now it is buried deep. Another quick choice for me would be 'exposure preview in manual mode': on, off, DOF. Also, sunlight sensitivity turn on/off for OVF.4. More control over bracketing. Right now I have to take three shots, up to 1 stop apart. This need not be!If Fuji were to come up with the next model: here would be a few things to add there:1. A choice of shooting with 24, 35 and 50mm (135 equivalent) lenses. And still leaf shutter of course. Flash to match.2. Flash compensation button.3. More than one 'fn' buttons.4. A contoured hand grippable body.5. A larger sensor :-)6. A tilting rear screen, preferably flip-out, like Sony SLR - example A65.I have shot with Sony a7R, and would still prefer to use my X100s!Update: Apr, 2014:This camera works beautifully for macro mode. Built in flash is very useful, and should hopefully be made more powerful in future models, and with more control on flash power!There is one big flaw for macro shooting, easily corrected perhaps by a firmware update: external flash can't be combined with built-in flash!!!!The hot-shoe should always give out a sync, as the norm with most cameras! And this can be controlled by an additional firmware option.Ergonomics wise, for future models: if the tripod mount can be farther from battery slot, it will help a lot in quick battery change. Also, please make sure the battery can be inserted in only one way.", "Date": "February 2, 2014"}, {"Title": "Jeffrey Ar", "Author": "Jeffrey Arguedas", "ReviewID": "R1VZWCHM3BQVY2", "Overall": "5.0", "Content": "It's a great camera, this camera for documentary photography is fantastic, it has very good image quality, I recommend this camera for street photography", "Date": "December 7, 2013"}, {"Title": "Fun end to end", "Author": "Alex Braverman", "ReviewID": "R1V1L3XA2X3FKQ", "Overall": "5.0", "Content": "I'm a pro photographer used to carrying Canon EOS 1D(whatever) and 2-3 lenses wherever I went. Yeah, in many cases it is necessary in my line of work. I also started getting scoliosis!I got this one for kicks as a runaround toy -- and I was blown away by:1. Image quality2. Look and feel3. High ISO performanceThis one makes me feel like a kid with my first camera -- a rangefinder true to the last button.And let me mention the soft dynamic range gizmo, it really does work and I haven't seen it on other brands.Get it and enjoy it! And it comes at about one tenth of the price of the BIG NAME that still hasn't got the M model available 13 months after the initial announcement.", "Date": "October 24, 2013"}, {"Title": "as perfect as it gets", "Author": "Alan Medvinsky \"am\"", "ReviewID": "R2WUY77NB6ZY5G", "Overall": "5.0", "Content": "I'm a pro photographer, mostly working in studio and on-location. I wanted something small and reliable instead of hauling my DSLR bodies and lenses with me all the time. Now x100s it's always with me...I originally rented x100s from BurrowLens for my trip to Spain this summer.  It turned out to be the perfect companion.From portraits, landscapes to street photography its just feels good and images are solid.I've done some cosmetic modifications to the camera, black lens hood and covered most of the body with gaffer tape. Additional batteries (3) are usually somewhere in my bag. Never have I run out of juice.People approach me asking about the camera and thinking it's a Leica. Good conversation starter to take that portrait.", "Date": "October 10, 2013"}, {"Title": "Wow!", "Author": "O. Khouri", "ReviewID": "R2BC4KH6E0LT4C", "Overall": "5.0", "Content": "I bought the X100 just before the announcement of this camera and I was very disappointed that I didn't wait. Eventually, I decided to upgrade and I simply cannot believe how much better the handling of this camera is. Almost every single problem with the old camera has been fixed. The focal length is boring when compared with my large range of DSLR lenses, but I still really enjoy using this camera. I cannot wait for my vacation to start so I can start capturing a foreign land :-)", "Date": "July 14, 2013"}, {"Title": "Great camera - simple but powerful", "Author": "Prime Reviewer", "ReviewID": "R2ZYSA466V2JNX", "Overall": "5.0", "Content": "The photos are impressive.  Having a prime lens is a big plus.  The sync flash is great.  I love the size.", "Date": "January 17, 2014"}, {"Title": "Love IT!", "Author": "Carole Fitzpatrick", "ReviewID": "RONRFXJVCFDK4", "Overall": "5.0", "Content": "I did a LOT of research before buying this camera.  I'm a \"Nikon person\" but my fav shooting is on the street and up close animals and the Fugi is perfect for that.  Love the challenge of the fixed lens.  This is the camera that will take me to manual mode although the auto focus is beautiful.  Tons of options to get me thinking about photogaphy.  Ready to go to the next level.", "Date": "March 6, 2014"}, {"Title": "Love this Camera", "Author": "Strawberry", "ReviewID": "R32C3TOXPWVGLF", "Overall": "5.0", "Content": "I purchased this camera as a an all around and travel camera. Although I wouldn't consider it very portable or light, it takes amazing pictures. The viewfinder is bright and easy to use, controls and menu options are intuitive, and the camera locks focus very quickly. The body is plastic but it feels very solid.The lens is not interchangeable, for that you would need something such as the X-Pro 1.", "Date": "February 21, 2014"}, {"Title": "Love this camera", "Author": "Mike McClendon", "ReviewID": "R1TAJQB34C6G2O", "Overall": "5.0", "Content": "Amazeballs. Bought this camera before having my first baby and am so pleased with the results. I'm not the best photographer and people still comment on how well the photos come out. I was a little skeptical about shelling out this much money for a camera but it was worth it.", "Date": "February 16, 2014"}, {"Title": "Simple Beauty of a Camera", "Author": "B. Francis \"ebrett\"", "ReviewID": "R2Z5G6XGXP3628", "Overall": "5.0", "Content": "It feels old and new. Classic and fresh. Oh and it takes great shots that have a warmth and sharpness that seem to come from different eras simultaneously too. Ultimately a great purchase with years of enjoyment ahead of me.", "Date": "October 20, 2013"}, {"Title": "This camera is great....get the Ebook", "Author": "Dean", "ReviewID": "RAYM9BFS8N3CJ", "Overall": "5.0", "Content": "Get the white covered Ebook \"Photographers guide to the Fujifilm fine pix x100\". While the menus are slightly different from the x100, the Ebook describes each setting in detail.  It was 9.99I bought this camera to supplement a Nikon dslr.  The smaller form factor and quiet operation make it great for an every day camera", "Date": "October 7, 2013"}, {"Title": "Beside the AF speed, PERFECT!", "Author": "Diogo F. R. Lopes \"DWL\"", "ReviewID": "RDN8KF1MNT93Q", "Overall": "4.0", "Content": "Yes, the IQ is amazing.Yes, the build quality is stunning.Yes, the size and weight is very \"portable\".But, the AF speed sucks... If this is important for you, you may try first some Olympus cameras. (PEN or OMD)I still prefer my x100s over the PEN/OMD because of the IQ. But when I try to take pictures of my dogs, I always get frustrated...", "Date": "July 17, 2013"}, {"Title": "Very nice camera", "Author": "Kgsmith", "ReviewID": "R2N25VM98JN1DZ", "Overall": "5.0", "Content": "I always liked the feel and format of the Leica M6 with 35mm lens and this simulates that camera. This Fuji is light and therefore is likely to be present whenever a photo opportunity arises. The sensor takes very nice images. This is my new travel and family event camera.", "Date": "December 11, 2013"}, {"Title": "Loving this camera.", "Author": "M. Deguzman", "ReviewID": "RSEWJG0VY04H8", "Overall": "5.0", "Content": "What's not to love about this camera. The retro look is great. The sensor and overall picture is great. This thing can take excellent pics in very low light. Ended up selling my 5DmkIII. Fuji got it right!", "Date": "February 13, 2014"}, {"Title": "Great walk around camera.", "Author": "Kyle S Ford", "ReviewID": "R38MT90DWEKX2S", "Overall": "4.0", "Content": "This camera look and feels great in your hand. I picked this up for a walk around camera so I didn't have to lug around my DSLR while out and about. It's amazing for the size and price. It goes perfectly with the Leica M3 that accompanys it in my bag. I enjoy the the rangfinder style eye piece. The autofocus is sometimes a little flaky, but works alright. The images also seem a little flat out of camera RAW but a quick process in Lightroom fixes that straight away. Would recommend this to any one.", "Date": "December 16, 2013"}, {"Title": "Fuji Raises the Bar Again", "Author": "Senna", "ReviewID": "R3B6JMMJAXX88D", "Overall": "5.0", "Content": "For those of us that were fortunate enough to own a Fuji X100 you know what a love hate relationship with one is.  It offered exceptional image quality with the quirks of a focus system that left a lot to be desired.  The X100s has overcome many of the X100 faults and raised the bar.On the exterior little has changed with the exception of a new \"Q\" or quick menu button and rearrangement of a few function locations.  The good news is that your X100 accessories will work with the X100s and the \"menu/OK\" button is now raised and much easier to press.Under the hood the X100s is a beast.  Lightning fast autofocus and very responsive manual focus now compliment the exceptional lens and image quality that is Fuji's secret sauce.  Gone are the quirks that plagued the SD card read and write time as well.  Start up time has been dramatically improved.I like taking pictures and not spending hours in front of a computer editing and tweaking them.  In my opinion in this day and age most if not all cameras should output good JPEG files.  Sadly this is not the case but the X100S does.  It even offers in camera RAW processing if you are inclined to shooting RAW.If you like the X100 you will love the X100s.", "Date": "March 25, 2013"}, {"Title": "Still some bugs", "Author": "Jon", "ReviewID": "R13BM4SS36YZX", "Overall": "5.0", "Content": "Great camera, auto focus is a bit shady sometimes and hard to judge in camera if it's accurate but when it's on the image is great", "Date": "April 6, 2014"}, {"Title": "Great Image Quality", "Author": "craig s", "ReviewID": "R2YBWYM95FMZMH", "Overall": "5.0", "Content": "Decided to take the plunge and move away from DSLR's. Ended up selling my Nikon D7000. I love the controls and handling of the X100S. Leaf shutter is amazingly silent.**I forgot to add**I also ordered the JJC hood adapter,Lensmate thumb grip and a 10mm convex soft shutter release,all are worth the expense. Also the STK battery is nice for an extra,it fits the factory charger perfectly. Fujifilm X100S Thumb Grip by Lensmate Silver,ASIN:B005HNNJXA, JJC LH-JX100 Lens Hood/Adapter Ring,STK's Fuji NP-95 Battery - 2000 mAH for Fujifilm Finepix X100S, X100, F30, X-S1, F31fd, Real 3D W1, NP-95, BC-65", "Date": "March 22, 2014"}, {"Title": "Worth it.", "Author": "CJ", "ReviewID": "R52SIMQKKSBFD", "Overall": "5.0", "Content": "Best camera I've ever owned.Prefer it to my d800- it makes photography fun again.HUGE improvement over the x100.Great IQ, great usability, so much faster all around.", "Date": "April 3, 2013"}, {"Title": "form & function", "Author": "Orobosa N Omoregie", "ReviewID": "R1O8MCWPGGY7ZW", "Overall": "5.0", "Content": "my 5d mark II has since taken a break since i received the X100s in the mail - its all in the form factor for me. I am not exactly an expert on the technical features of camera as such i tend to shy away from those discussions. that being said i love the results i am getting from this camera - more than does the job - a style statement as well", "Date": "February 20, 2014"}, {"Title": "Wow", "Author": "Peter C. Forcey", "ReviewID": "R1T3L8TE5NI8C", "Overall": "5.0", "Content": "This camera is awesome.  I have 2 DSLRs, and multiple lenses. This is now my go to camera.  The size is super, the pictures equally so.  Easy to learn and use, but this is definitely not a point and shoot.....leather case 100 bucks is slick and very necessary as you take this camera everywhere.", "Date": "January 12, 2014"}, {"Title": "Fuji x100s", "Author": "basilio", "ReviewID": "R27E34F8UR77C3", "Overall": "5.0", "Content": "Ordered the x100s at the end of September when the camera was impossible to find in any store in half of Europe and the US and everyone was backordering it. The camera left at the end of the week (ordered it during the holidays) and arrived perfectly packaged and protected. The product functions flawlessly and the transaction went smoothly and with zero issues.", "Date": "October 15, 2013"}, {"Title": "Puts your DSLR (show camera) to shame.", "Author": "DC Gallie", "ReviewID": "R3COOBSPA1WXDL", "Overall": "5.0", "Content": "So here's the camera that's got the photographic community on its ear. Its colour matching and speed is unparalleled. This is due to the lens being built into the camera as a perfect match. No zoom on this camera because it would ruin the performance of this perfectly matched instrument.The only way to get this kind of performance with wide/telephoto focal lengths is to manufacture separate cameras with built in \"one piece\" lens/sensor units of the most popular fixed focal lengths.", "Date": "October 13, 2013"}, {"Title": "Close to Perfect", "Author": "D007", "ReviewID": "R1PVH0TSAZPY3U", "Overall": "5.0", "Content": "I've had my x100s for a week now and I can't get enough of it.  I highly recommend this to anyone who, like me, struggles with the dilemma of carrying a DSLR around with the kids at the weekend with a desire not to compromise picture quality and creativity.", "Date": "March 18, 2013"}, {"Title": "Best camera ever.", "Author": "Andy Sapp", "ReviewID": "R2GC8A5T5BNZUE", "Overall": "5.0", "Content": "If you're even remotely pondering this camera... stop now and just buy it.  I promise you will not regret it.Also, the seller that sold me this camera was ABSOLUTELY top-notch.  Trustworthy and FAST.", "Date": "February 4, 2014"}, {"Title": "Fantastic Camera", "Author": "Franklin Miller", "ReviewID": "R2XW4VYN1MWLAX", "Overall": "5.0", "Content": "Payed extra for it at Cardinal, because it is hard to find a seller in the US. They sell out right away, B&H; had a recent shipment, and sold out before I could click the \"BUY\" button. As for paying more, I justified the extra cost in the same way as I do if I can't get a ticket to a concert - the scalpers have the ticket, so I can watch the concert or cry that I missed it. The choice was mine and I do not regret it. Although I would like to know why such a reputable company like Cardinal would charge more than retail for a product. Makes me think twice about buying other products from them, that's the down side to charging more. They did not have the American cable for the battery charger, so they sent me the proper American cable, and an extra batter for my inconvenience, and they both arrived the same day as the camera. Great service, but the extra price begs explanation!!!", "Date": "September 16, 2013"}, {"Title": "Fuji x100s and reviews !", "Author": "Mohamed A. El Morr", "ReviewID": "RZQTYSH6RWEJ3", "Overall": "5.0", "Content": "i just ordered said camera, its my first Fuji ones i ever use !  my background come from Nikon Dslr gear , D3S, D800 with almost full range of N lense line,  latest one i have boughT was the Nikon 24 F 1.4 Which i didnt test enough yet, i was struggling to buy Nikon 35 F1.4 as well for street photography and nice portraits lensethen by pure quincidence i have read about Fuji by  a friend , i done my studies , read a lot , watched a lot , and came to the conclusion this,  must be the perfect all round lense ( and ofcource ) camera for me, as i said i did not have it in hands yet.as i said i did not hold said camera in my hands yet, but there are some stuff you get the feeling its the right thing for youthe thing im astonished about, that this camera is either being compared with a DSLR ones , so they might get a negative review ! which i see its unfair comparison for many reasons despite the type or Dslr brand ! and also as well with Leica M series which is purely manual or ahead with advanced glass and technicalities...so these are not apple to apple comparison ...if you want to compare a more advanced point and shoot or semi like Dslr ( which the opposit in fuji case coz its a fixed lense ) then it must be with same brand leven so it would get a fair comparisoni beleive for whats intended for the fuji would be quiet impressive one despite the flows for slow focus and other minor thingsso again , i wish reviews would have been more in comparison and not to expect a 10,000 $ gear to be compared toi will add my own revised review in a week when i get the new toy in hands ...REVISED on 23-9-13,  ok i received my x100s todays, i wont go through build quality and all the things been said, i tried some shots in a low light , but it seems i still need to study the phenomenon of fuji system and this camera,menu is quiet easy when you get to know which key doing what .so after 10 minutes , i got familiar with another system i never been used before, as i always been used to a  Nikon ones that almost doesn't change,i love the way this camera look , also i have tested Raw converter that comes with the camera, works pretty nice, as well i can edit and view my Raw files on Ps CS6 with no issues as Fuji X100 settings already there..so you will have no problem with that partthe only thing i couldn't get is the file numbering which seems a bit diff than Nikon ones as it starts with DSCF1-1001 for first picture .unlike Nikon which is DSC 0001,  and there is another setting for the numbering which im not sure whats the difference but it says resetting number.so i guess it starts from the beginning each time !the only annoying thing for me which im not used to , is the shutter feeling, its a bit loose for me, unlike what im used to with Nikon , so i bought Gariz Metal XA-SB2 Camera Screw Type Soft Button for X-PRO1 X100 X10 LEICA CONTAX, Black and Redsome of the accessories that i had with the Fuji X100sGariz Genuine Leather XS-WSM1 Camera Hand Strap for Mirroless Camera, BlackGariz Genuine Leather XA-CFX100BK Camera Cap Fixs for Fuji Fujifilm X100 X100S Leica X1, BlackGariz Genuine Leather XS-CHX100MBK Camera Metal Half Case for Fujifilm X100 X100s, Black w. Red StitchSTK's Fuji NP-95 Battery - 2000 mAH for Fujifilm Finepix X100S, X100, F30, X-S1, F31fd, Real 3D W1, NP-95, BC-65GGS Optical Glass LCD Screen Protector 3 inches for Digital CamerasLensCoat LCHXXSBK Hoodie XX Small (Black)STK's Fuji NP-95 Battery Charger - for Fujifilm Finepix X100S, X100, F30, X-S1, F31fd, Real 3D W1, NP-95, BC-65National Geographic NG 2342 Earth Explorer Small HolsterB+W 49mm Clear UV Haze with Multi-Resistant Coating (010M)Fujifilm X100S Thumb Grip by Lensmate Silverofcource its a matter of preferences what you like your camera to have on , or what you really need, but these accessories i done a lots of comparisons and i found to be best in the  market so far, i had all of them from amazon ..so didn't have to go through many storesoverall happy with the choice  although i paid more than the regular price as it was backordered for a long period everywhere", "Date": "September 19, 2013"}, {"Title": "After all the hype, the x100s was disappointing.", "Author": "S. Hoffman", "ReviewID": "R19Y2FX0RWWZGJ", "Overall": "3.0", "Content": "After reading all year about the amazing Fuji X100s, I put my skepticism aside and plunked down the $1300.00 for one. Then I waited two months.  By the time it finally arrived, my own internal hype over this camera was probably too much to for any electronic device to overcome.  My main purpose for buying this camera was to essentially have it with me at all times to take pictures of my daughter and whatever else caught my eye.  I'm sad to say after about four hours of use, I determined this camera is not for me and its on its way back to Amazon. The deal-breaker was speed.  The x100s is slower than my cellphone.  I can grab my Samsung Galaxy S4, open the camera app and take a picture, then another and another, quicker than I can get the x100s ready for the first shot (from off). And coming from a Nikon D300s, the x100s is glacially slow. Granted, the x100s takes lovely pictures and the low-light capability is stunning, but I need the speed that apparently only DSLR's can deliver. If you're into shooting landscapes, architecture, or other non-moving subjects, this is truly a great carry-around camera.  If it were only $400.00, I'd probably even keep it. I'll be putting my refund towards a Nikon D600 or the D610 (depending on the improvements) and will wait for the mirrorless revolution to catch up.", "Date": "September 15, 2013"}, {"Title": "Amazon= 0 Stars!!! Camera= 4 Stars", "Author": "Noah", "ReviewID": "RBQTI6YWCNKBO", "Overall": "4.0", "Content": "Okay, all the professional reviews you read on this camera are completely true.  As a former professional photographer, the camera lives up to the hype.  The JPEG's are scary good.Amazon on the other hand failed big time.  The wife ordered it first on her account as a gift. After over six weeks of waiting, Amazon mysteriously cancelled the order and said they were unable to fulfill it.  Although when I went on their website, it showed as back ordered but able to order. Called customer service; while friendly she said my only choice was to order again and no they could not move me up in line before the other people.  So here we are, I order the camera AGAIN.  Order placed this time on July 13th, arrived with one day shipping August 28th.  The long order time is really Fuji's fault, what a terrible launch.  Get your crap together Fuji! I also now see Amazon's third part retailer is gauging people by charging $300 over market price.  So if you're reading this, know that all of the people reviewing this paid $1299 not the $1599 they are trying to rip people off of now.  My advice, order it from different seller.", "Date": "August 29, 2013"}, {"Title": "A street camera only", "Author": "The Author", "ReviewID": "R2BW7N3YIVGAWP", "Overall": "4.0", "Content": "There are just a few flaws in an otherwise flawless camera. I won't go into all its high points because that's already been covered and I agree with it all. Here are just a few things to keep in mind that make this a 4 star review not a 5: The lens cap doesn't stay on well. I wish it clicked into place or had a little strap attaching it to the camera. I ditched it, it was so bad, but now I feel like the camera's a bit unprotected. My cap also got bent being in the bag so that made things worse. The display menu isn't intuitive. Low light performance at the higher ISOs are very grainy. Displaying the photo you just took on the LCD and shooting your next photo is a bit slow especially if you want to shoot several photos. As an example, I shot a bride and groom walking down the aisle and only was able to fire off 4 shots for the entire aisle. I could have gotten dozens on my Canon 7d. However, in those 4 shots was the money shot so it worked out. The shutter button feels a bit loose and flimsy under my finger especially compared to the solid Canon 7d shutter button.What I love about this camera is how easy it is to leave on manual. Take a few test shots and you're golden. Street photography looks beautiful, a perfect fixed lens for the streets. No one notices this camera and it's as quiet as they say. Harsh light photos look beautiful with the ND filter. Turn the ND filter on when outdoors always, your photos are elevated to a whole other level and shooting in harsh sun is MUCH less of an issue than it is for any other camera I've used.Bottom line, this is a street photography camera. It's just so easy to use this camera to capture that street \"look.\"  If those are your style of pictures (for me yes, 99% of my people photos are street style/candid), you must have this. If not, skip it, and this is not a family vacation camera (again unless you like street style vacation photos).", "Date": "November 14, 2013"}, {"Title": "Camera locks up constantly and is unusable", "Author": "B. Krause \"Bluecow\"", "ReviewID": "R29ABIOOJMECLT", "Overall": "3.0", "Content": "My x100s arrived on April 1st, but I've only had a couple occasions to use the camera since then.  I've shot perhaps only 15 photos, but now the camera is completely unusable.  The camera locks up after doing virtually anything with it and the only way to make the camera responsive again is to remove the battery and reinsert it.  The camera locks up when attempting to focus, regardless if it's autofocus or manual, and the green light on the back then remains on until the battery is removed.  If the shutter button is pressed completely, then the light turns to red and, of course, becomes unresponsive.  This means taking a photo is impossible.  When switching between the optical viewfinder and the EFV the viewfinder shade closes and the camera becomes unresponsive.  When any changes to the menu are attempted the camera becomes unresponsive.  When attempting to format a memory card the camera becomes unresponsive.  I was able to successfully update the firmware from version 1.01 to 1.02, but the problem persists.  Essentially the only things the camera can do right now is turn on, the menu can be browsed, and the shooting settings (shutter speed, ISO, and aperture) can be changed using the dials.  If anything beyond that is attempted the camera becomes unresponsive.  In case it makes any difference to anyone, I was using a Sandisk 32GB Extreme Pro SD card.  I tried a different SD card and it made no difference.I really like the camera and when it was working for the couple of photos I was able to take it was very enjoyable.  However, the camera is completely useless right now.  I have contacted Fuji and will update my review if they are able to resolve it.5/2/2013 Update: I called Fuji and the guy said he had never heard of such a thing happening to the x100 or x100s.  He was eager to see it in person, so I shipped it off for warranty repair today.  He thinks it must be a problem with the \"main board\" and that it should be able to be fixed quickly since parts are currently available.  I could have returned it to Amazon for an exchange of course, but since Amazon says it won't be in stock for 1 to 3 months I figured it's better just to get mine repaired.  I will update my review once I get the camera returned.5/24/2013 Update:  I sent the camera back to Fuji and it was back in my hands exactly 1 week later.  So I'm very impressed with their technical customer service.  The camera appears to be working properly now.  Since I'm writing this review based on my experience with the camera I'm updating my review from 1 star to 3 stars.  I like the camera itself and the image quality is excellent.  I wanted a fun, lightweight camera with great image quality to use more on a daily basis instead of lugging around my DSLR kits for certain occasions and this camera does deliver that.", "Date": "April 28, 2013"}, {"Title": "broke after 4 months of use.", "Author": "whitney", "ReviewID": "R149LOPYX5QPDX", "Overall": "2.0", "Content": "The shutter broke after 4 months of use. I am very disappointed as I needed to use it for a special occasion, and had to send it to be repaired.", "Date": "May 23, 2014"}, {"Title": "stylish and great performance", "Author": "Damon", "ReviewID": "R3DPMHO6Y8VO2O", "Overall": "5.0", "Content": null, "Date": "January 27, 2014"}, {"Title": "Amazing camera", "Author": "D. Barnes", "ReviewID": "R2TGWAYR6LVQLU", "Overall": "5.0", "Content": "I'm glad that I waited for the X100s model instead of jumping on the previous X100. Many helpful improvements in the new model.Still on the petite side -- the body is about the size of a 3x5\" card. And light enough to be easy to carry around. This is not a pocket camera, however.Turn off the electronic sound effects, and it's nearly silent.Sharp, fast lens!Lens hoods are quirky. The camera has a 49mm *male* thread. Fuji's hood is very expensive. There are many cheap clones.", "Date": "April 24, 2013"}, {"Title": "Amazing camera with leaf shutter", "Author": "Corey J. Sandler", "ReviewID": "R3AQYT9JSIY0DI", "Overall": "5.0", "Content": "Just got this camera a couple of days ago. I love it so far! The leaf shutter is so quite and allows me to shoot with flash at speeds greater than 1/200th of a second (to capture action). Will update review in the future once I have used it for awhile, but right now it seems like the perfect camera!", "Date": "April 4, 2013"}, {"Title": "One of the best cameras I have owned.", "Author": "Abraham Lincoln", "ReviewID": "R2V9BG135EYROW", "Overall": "5.0", "Content": "I first used fixed focus cameras in Japan and it even looked like this one that is digital.I like it and I like the digital images.", "Date": "January 27, 2014"}, {"Title": "Wow!", "Author": "Christina S", "ReviewID": "R192N5O5TZ2VAI", "Overall": "5.0", "Content": "This camera is absolutely amazing. It has all the features a pro would want, yet is very user friendly for the beginner photographer. I can't believe this baby is in my hands right now.  If anyone ever has anything bad to say about this camera, I can only guess they have stock with the other competing brands and just want to make Fuji-film look bad.  I would never consider purchasing a large bulky DSLR again.", "Date": "July 19, 2013"}, {"Title": "Lens Coating Issue", "Author": "Barry R.", "ReviewID": "R6HYDO3SUF533", "Overall": "4.0", "Content": "Have had the X100s for a few months now... Image quality is very good and the camera is enjoyable to use. That being said, my X100s has been treated extremely gently, the lens cover is mostly left on until ready to shoot, and it has been mostly used indoors. So the other night I was somewhat surprised to notice several significant spots on the lens which I then carefully and gently tried to clean away. Quickly realized the four metallic looking spots of various sizes were not on the surface of the lens but apparently are on the back of the lens and probably is the lens coating flaking off. Spoke to Fujifilm Tech Support who claimed they never heard of this issue although I found it mentioned online (Google 'X100s lens coating flaking'). Sent it off to Fujifilm Repair Service in Edison NJ this past Friday and am awaiting their explanation. Very disappointing, to say the least... Honestly I am concerned they will report that they will not repair this issue claiming it does not affect the photos. I am sincerely hoping that will not be the case. Hope to update this saga as I learn more.PART 2 The Adventure Continues... So Fujifilm received the camera the following Tuesday.  The camera was seen by a tech who examined it and apparently missed completely what the camera was sent in for. On the work order that was enclosed back with the camera he claimed he found dust on the lens and viewfinder which he cleaned. Obviously he completely missed seeing the spots inside the lens and the camera was returned in exactly the same condition it was in when it was sent to them. Clearly not happy at this point since it cost more than $22 for postage and insurance sending it to them via USPS. Called them back and to their credit apologized and told me to send the camera back to them at their cost. They would send me a FedEx label in the mail. It took four days to finally receive it. Sent the camera back to them, this time enclosing very clear photos of the spots in the lens with circles and arrows so it wouldn't be missed. The tech I spoke to also asked that I direct the package to his attention and he would personally check it out and call me while the camera was in front of him on his bench. This sounded good so even with the extra hassle I'm thinking this will get solved. Took the camera two or three days to reach them and I'm waiting to hear back from the tech when I get an email that the camera was already shipped out back to me. Puzzling, but I figured I'd wait to see the camera before doing anything else, thinking the tech saw the problem and just took care of it and a call wasn't necessary. Two days later the camera is delivered. The work order shows they changed the lens assembly. This is good. At least until I start to take test shots and it appears to me the autofocus is not calibrating correctly, most obviously in macro mode. I put the camera back in the box and called Fujifilm the next morning. I reach the same tech who I spoke to last time, who told me he never saw the camera and it must have been serviced by someone else despite the fact I had put 'Attention To:' and his name all over the label, the box, and the paperwork inside. Aside from being surprised this happened he was also very apologetic. I asked for a supervisor but none was available and the tech explained little could be done without the camera there in front of them for them to evaluate and determine what they would do next. This time, instead of waiting four days for a label to arrive he gave me the FedEx acct # so I could go over to FedEx that same day and overnight it back to them with a guaranteed 8:00 am next day delivery. Having lost confidence at this point they're ever going to get this camera right I told him I think they should provide me with a new replacement since, by this point, they've probably had the camera longer than I've had it. The tech said he couldn't promise anything but with the camera in hand he would advocate for me to his manager the next day and call me first thing the next morning. I waited the entire day to receive that phone call. I finally tried to reach him, twice, both times in the late afternoon, both times I was told he was in meetings. At 5:30 pm the same day I finally did get a call back, this time from the manager with whom I then went over the entire chain of events, including my request that the camera needs to be replaced with a new, and not refurb, camera. To his credit he really was trying to make this right for me but made me aware it would be difficult or impossible to swap this out for a new camera. He then hit upon a solution which he offered me, and which I accepted, which was explaining to me that on occasion Fujifilm gets cameras returned from camera dealers whose boxes were somewhat damaged when the retailer would open the delivery carton. He assured me the cameras are absolutely brand new but because the box may show some damage it therefore would not considered in saleable condition. After we finished our conversation he emailed me that he made inquiries and one such camera was available in California, and he had already requested it be sent to to him. He then emailed a few days later that the camera arrived but before sending it out to me he first wanted to completely check it out. The camera then arrived here two days later and was, as promised, a brand new boxed camera. The box had a spot where there was very slight, insignificantly damage, barely noticeable, and clearly irrelevant to affecting the camera. I emailed to thank him. So that's what happened... All the people at Fujifilm who I dealt with were all very nice, all very understanding, and all of them seemed to want to do the right thing, and eventually did, but somehow, at least in my case, things seemed to fall between the cracks quite a lot.. So then the real question is whether this was a typical or a unique experience with them and did I just get lucky finding the right person to solve this issue for me or would anyone else have also walked away satisfied they were dealt with properly - I have no way of knowing. Would I recommend to a friend they avoid buying Fujifilm products because of this? Absolutely not. Ultimately everyone at Fujifilm I dealt with, as I already said, was very nice and wanted to do the right thing, and, as I also said, eventually did exactly that.  That counts for a lot. So I guess that all you can really take away from this entire experience is that just sometimes s*** happens... What else can I say??...:-). And, by the way, the camera really is superb...", "Date": "October 30, 2013"}, {"Title": "This camera isn't a DSLR replacement", "Author": "Mr Mach5", "ReviewID": "R2RJK71W3FSW9I", "Overall": "5.0", "Content": "Okay there are 3 things that you need to know about the Fujifilm X100s1) This camera isn't a replacement for a high quality DSLR2) This camera isn't a replacement for a high quality DSLRAnd3) This camera isn't a replacement for a high quality DSLRThe X100s is a high quality hybrid digital rangefinder camera and comparing the auto focus speed of the X100s and any high quality DSLR is comparing apples to oranges - period. (I'll bet the auto focus of the X100s is still faster than most people using manual focus)Look, you can hammer a nail into a piece of wood with a hammer and you can do it with a rock. It doesn't mean you should hammer a nail into a piece of wood with a rock. Think of the X100s as just another tool in your tool box and not the only tool you'll ever need to get every job done.The X100s is a fantastic camera and the image quality is great. I bought mine on ebay because I wasn't going to pay over MSRP on Amazon.", "Date": "September 18, 2013"}, {"Title": "Really wanted to like this.", "Author": "tabby", "ReviewID": "R3U6GA2NMU4NVD", "Overall": "3.0", "Content": "I had tried the X100 when that came out. Didn't like the X100 because of the poor AF capability, and also poor EVF resolution.When the X100s came out, I put myself on the wait-list and waited about 1.5 months for Amazon to ship.With the X100s, the AF is quite a lot better. The EVF is quite amazing, it looks almost like real life. The image quality about rivals a D300 camera. The ISO capability is in-between the D300-D700.I really wanted this camera to replace the D800 that I currently have. However, although the size is smaller, weight about 1/2 the D800, the AF speed is still too lacking. I take pictures of my new baby, and lots of time, even though the AF speed is much improved, it is still too slow to capture the right moment. (Agreed that the D800 AF speed is very dependent on the lens that's attached to it, here, I'm attaching the D800 to a 24mm F2.8)Unfortunately, even though I really wanted to keep this camera, the following factors resulted in the return to Amazon:1. Needs to be about 20-30 percent smaller. This camera size is in no-mans land. It's way larger than a point and shoot, but smaller than a DSLR.2. Needs better build quality. This camera just feels like it is cheaply build. Lots of plastic. I am just scared of mishandling it in any way.3. Needs better AF speed.All in all, this is likely the best mid-sized camera that money can buy. I was really hoping to retire my DLSR, but I guess I'll have to wait another generation or so from Fuji.", "Date": "July 31, 2013"}, {"Title": "Excellent when it works", "Author": "Jakob \"Swede\"", "ReviewID": "R3CZ1RNB6YS7H8", "Overall": "1.0", "Content": "I have a love hate relationship with this camera. When it works, it's a phenomenal camera for its size. The autofocus is more than adequate and the overall speed of the camera is great. This is a camera you have to get to know very well in order to get the best out of it. For example, using continuos autofocus is fairly awful when it comes to tracking fast moving objects (the camera isn't made for that purpose) but continuos mode can be a life saver in low light when it's struggling to achieve focus; it's much more effective than single shot AF mode. Also, the leaf shutter is great. I use this camera professionally for weddings and it's incredibly discrete (and dead silent) which makes perfect for moments when you don't want to stand out as a photographer. Other fun things to try is using strobes and leveraging the leaf shutter's 1/1000 sync ability. You can easily overpower the sun and shoot wide open while engaging a strobe (or several).However, I do believe people have gotten a little carried away with the X100s and claiming it to be the killer of DSLRs etc. There is NOTHING this camera does better than a high end DSLR with the exception of the leaf shutter and its size/weight. For example, Canon's 5D MKIII has better battery life, autofocus, ISO, contrast, color, exposure eval, speed etc...I could never show up to a professional gig with just the X100s...but it does complement any photographer's bag very well.And most importantly, it needs to function for one to take advantage of this wonderful camera. Mine has gone dead twice now and I am hopefully getting a replacement unit this time. Both times it died during very inopportune moments and if I didn't have its big brother, the X-E1, with me, I would have been in big trouble.", "Date": "July 11, 2013"}, {"Title": "I love it", "Author": "John Mixon", "ReviewID": "R39UDSKF8B89PJ", "Overall": "5.0", "Content": "Marvelous.", "Date": "May 5, 2014"}, {"Title": "Quick, snappy, and speedy.  Did I mention it was fast? BUT...  be sure to compare it to the...", "Author": "E. Tucker", "ReviewID": "R2SYQYJFT9SZDU", "Overall": "5.0", "Content": "As an amateur/semi-professional photographer I was able to get my hands on this camera that feels like you've picked up something from the future.  The Fuji X100S looks like a retro camera that is built with speed and features of a camera that came from the future.  The auto focus and menu performance is absolutely stellar and leaps and bounds faster than it's predecessor in terms of ease and speed.  All around, it is the fastest Fuji camera built to date.  It also will blow you away with its low light photos.If you weren't aware the X100S is a successor to the X100http://www.amazon.com/gp/product/B006UL2VKK/ref=as_li_ss_tl?ie=UTF8&camp;=1789&creative;=390957&creativeASIN;=B006UL2VKK&linkCode;=as2&tag;=stupisms-20If you have the budget, however, the camera that consistently took awards for camera of the year in 2012 is the Sony seen here...http://www.amazon.com/gp/product/B0097CXFCC/ref=as_li_ss_tl?ie=UTF8&camp;=1789&creative;=390957&creativeASIN;=B0097CXFCC&linkCode;=as2&tag;=stupisms-20", "Date": "March 26, 2013"}, {"Title": "X100S", "Author": "F. Meszaros \"MezzyMez\"", "ReviewID": "R2EEI8ST9ZA6FC", "Overall": "5.0", "Content": "Amazing camera. Just got it from Japan. I am selling my D800 and my D7000 if anybody interested. I do not need those heavy cameras to carry around when the X100S makes way better photos and much lighter and smaller. Heavy and big is so so old.Thank you Fujifilm. I can't be happier with my X100S.", "Date": "March 7, 2013"}, {"Title": "Something you won't get from any other brand.", "Author": "Canaan", "ReviewID": "R2TPZOIFGL0DQZ", "Overall": "4.0", "Content": "TLDR: A not so amateur camera, very quirky, very adorable, if you are looking for a small setup for inconspicuous photography and you really know what you are doing, beware, this might be the camera you are looking for. For all the rest of the point and shoot seeker move on and get a G15, G1x, Lx7 and or Rx100II, this Fuji is not the camera for you (reverse psychologically)A camera that cannot take drive by shooting from a car (AF sooooo slooooow), AF points that floats across the OVF because of parallax, a battery life (in video mode)so short you need to carry three of these in a shoot, a battery retention methodology that makes North Korea space program incredible.And I would still buy it again.And I would be anxious to hear a full frame version of this puppy.Yes. North Korea. Such wow.Yes. This is the X100s, yes it has 4 stars, and yes,  I stand by it.If you can live with all of these minuses, I would suggest you to buy the lens hood from EZfoto(no not the fuji this is way over priced) and buy a circular polarizer of 58mm from your favorite brand (HOYA / B+W)so you can use it with the lens hood (going for the 49mm is a pain because your thumb and index cannot reach the inside of the lens hood). Then a couple of NP-95 wannabe from STK, and the x100s thumb grip from lens mate. And if you believe leather will get in the way of taking pictures, I suggest you J.B camera design case, they smell bad, but it will disappear in a few days of camera use.Congratulation, you have now a kit that beats the crap out of a d3200 and 20mm 2.8 (incredible lens with no AF on a d3200)With the X100s, we comparing something like 30 2.8 to 35mm 2.0 full frame equivalent.So with the X100S, you will gain (a slow) autofocus and a faster lens.The lens is soft at f2, but it is not bad (it is #somewhatdreamy), stopped at 2.8, the nikkor takes a serious beating. You will love it, it is refreshing.AF speed is... sluuuggish if you are coming from a D3, slow if you are coming from a nikkor 50 1.4 G, incredibly fast and accurate if you come from a Leica M9 :)Build Quality is okay, not bad. Great. But not excellent (plastic knobs feel, battery door and orange plastic retention mechanism, and you can still mount a battery incorrectly!!!!)For a photog, this is a looong series of minuses, but you will manage. If you want to drive by and take pictures from your car, forget it. You have to set it to manual focus, press AE/AF lock and shoot! the AF is too slow and not precise enough, how about for regular street photography?Absolutely. It will work, precise, accurate. But slow.Never forget that you can switch to manual then Ae/AF button lock will focus for you.You now realize that I haven't talked about EVF, OVF, textures, the colors, the high iso the fact that you can use a SB700, SB 800, SB910 and the like...This is for your to (re)discover. I would not even call this a rangefinder, this is a Leica M3/M5 on electronic daft punk steroid.The X100S is not the perfect camera, but for some, it is out of the point. It is not as intuitive as a K20D, it is not as engaging as a Leica M9, it is not as shattering as a D3 and 50mm 1.4...The X100s is nothing like that, it is simply a X100s, something you cannot found in any other brand.If Fuji ever release the same recipe with a full frame in 35mm, I am all for it, cause you know, I am not that good of a photographer. The X100s reminds me of the the K100D, it clicks, it is quirky (Af point shifting across the OVF thank you parallax), but it is one hell of a ride. Have fun, you reading those lines, you already made up your mind.So why 4 stars? I told you, this camera is a quirky little thing, from the menus, to the video mode, to the custom mode 1/2/3 out of place (and useless) the Q button does not even allow you for the fast ND parameter but offers you a redundant, flash, wb parameters... Unacceptable! Fn button assigned to movie mode... you cannot be reassign when entering custom menu 1/2/3... Mr Fuji, you have to get out and use other cameras like a K5 or even a D300s / 70D, GH3!Anything, learn a few thing about user interface!!!But to hell with all of these quirkiness and slowish AF (it is not the slowness that kills it, but the lack of anticipation from the photographer to understand that the AF point is not in line with the lens again, parallax).It will make you think, it will make you walk on your toes. And all of this makes for great photography.What a sensor.Coupled with a Nikon Sb700 flash, you can get seriously creative.Don't look for speed, don't buy it for the look, buy it for the experience. I would not describe this as a true rangefinder though, it is much more than that. I hope you enjoy it as much as I do, now go get outside and shoot something, anything. I wish it to be weather sealed.Little piece of advice, you can make an OVF protector by defining lines on a UV filter (utility knife and 52mm would be a good start), on a previously taped UV filter, then \"break\" your UV glass panel  along these lines by pressing with two pliers, then remove the tape (so it does not scratch). Don't cut yourself! use gaffers tape to tape off this newly made protector.", "Date": "February 10, 2014"}, {"Title": "It’s not a pro camera, it’s not a semi-pro camera. It’s a nice looking toy. That’s all. 2 stars.", "Author": "Mike Burlak", "ReviewID": "R2DBY2M2GWJY68", "Overall": "2.0", "Content": "I started taking pictures when I was a child. I was developing film and printing photographs in the darkroom by age of 13. I began photographing again as an adult around end of last century and have been doing it since. My total photographic experience is thus over 15 years. I do not do this for a living as I prefer art photography to taking paid assignments. Some of my work has been sold and some published. I do not call myself a “professional photographer” but consider my level of knowledge and proficiency in the field higher than that of the most people who call themselves that.Having said the above let’s turn to the equipment.I own quite a few pieces of photo equipment. Among those are three (3) Canon SLR bodies (two of them digital) and a set of L lenses. For night/street shooting I use Bessa R2A with Nokton 35mm f/1.2. I also own Canonet QL17 GIII.When I saw the x100S I found the look of it appealing and resembling the QL17. Then I read the rave reviews, all the specs and features and thought I’d like to have one. And now I do.After a little over 2 months of shooting here’s my impression.I thought if I could get a rangefinder type digital camera for night/street photography that would yield at least similar results to the R2a and Nokton or at least to QL 17 - I’d be satisfied. After all Bessa R2a and Nokton 35mm f/1.2 combo is comparable in price (at least it was at the time I bought it). Nokton 35mm f/1.2 is a superb lens. It seems it can see in the dark better than the naked eye sometimes. Even though it uses center weighted spot metering it never blows out the shadows or burns out the lights. Plus the distortion is minimal.X100s is lacking all of the above. It made me reminisce about one of my first digital cameras of 2001 – 2002: the Olympus C-4040. And now, 12 years later I think the Oly performed better. It had a super bright super sharp f/1.8 lens, focused fast, rendered true colors. Batteries lasted a long time. The only drawbacks were low 4 megapixel count, shutter lag and ISO limited at 400.It feels like X100s has the same shutter lag and it’s taking its sweet time to focus too. Mind you, 12 years had gone by.I think most of the rave reviews for the x100s are written by lamers (no offense) who either never owned professional gear or don’t know how to use it. A comment from a “professional” photographer who wrote the x100s was the best digital camera in the world its worst “killer” flaw being silver color just about killed me.Never ever will the x100s be able to do what DSLRs with pro optics are able to do. Even if I compare it with 8 year old Canon EOS 5D.Shutter lag, slow auto focus (it does focus in the dark when it’s in the mood, granted), confusing complicated menus = many many missed shots.In fact oftentimes I find myself in the street messing with the settings while my subjects walk away.When you do manage to get a shot, often you will find that the camera didn’t focus spot on. And if film is somewhat forgiving in this respect, digital sensor is not. Then you notice that in most cases when using spot or center weighted metering outdoors your shadows would be black with no detail. I don’t own any lenses slower than f/2.8 save for f/3.5 8mm fisheye and I would think the prime f/2 lens should produce satisfactory images. No, sir, it does not.Distortion is absolutely horrible. It seems there are no vertical lines in the shot no matter how hard you try.Battery life – horrible. It seems while the rest of the world were developing batteries Fuji were doing something else and then were too greedy to purchase a patent. Why would they declare 330 shots per full charge when the camera cannot do that. It just can’t. I purchased a spare and barely manage to do 300 shots with both. It goes from half charge to red zero charge in no time, sometimes during shooting.Bottom line: it’s not a pro camera, it’s not a semi-pro camera. It’s a nice looking toy. That’s all.2 stars.", "Date": "February 11, 2014"}, {"Title": "SOLD AS NEW, RECEIVED USED", "Author": "Tom Hall", "ReviewID": "R3LXPFQZHOKT7W", "Overall": "2.0", "Content": "The camera is great. I highly recommend it.  But since the only other place to provide feedback is about \"Packaging / Delivery\", I am including this here as well. (I want to use the camera, and the only recourse Amazon provides is getting my money back, they will not replace it.) To the point:This is a *used* item, priced as new. It was taped shut with scotch tape. I turned on the camera and the date was already set.  It showed shutter count 300.  The macro mode was on.  I waited two months and paid full price for this camera, and got a previously opened and used one. I expected better from Amazon.", "Date": "August 14, 2013"}, {"Title": "Just OK", "Author": "A. Nelson \"Alex\"", "ReviewID": "R1HD4J37FJOPXZ", "Overall": "3.0", "Content": "I didn't the x100 as it was annoyingly slow.  I couldn't help myself from ordering an x100s after seeing all the hoopla surround the improvements.  It's a nice camera, looks cool, everyone asks about it, but I'm likely returning it.Cons:- Focus still seems slow. It reminds me of why I love DSLRs...they always do what you want with the speed you want.- It's way too slow to wakeup; take a photo, walk around for a few minutes and attempt to take a quick photo, but the camera seems to be in a coma.  You need to press the shutter button down slightly to wake it up.- RAW files are the same size as my compressed 12-bit Nikon D800 files.  ~32MBPros:- JPGs straight from camera look quite nice.- Less intimidating for your subjectThe use-case just doesn't make sense for me.  If I know I want to take pictures I'll bring my DSLR, if I didn't plan ahead my iPhone 5 takes great pictures.", "Date": "May 6, 2013"}, {"Title": "Best from Fuji", "Author": "edmiester", "ReviewID": "RZ41M8JTTNRB2", "Overall": "5.0", "Content": "I've had my X100 since it came out and loved it even thou it had some issues and fixes (mine was sticky blades) which was fixed at no cost, the focusing is much better especially for my street photog's and the brilliant ISO, I bought it in Australia at [...] Now the NEW x100s is going for AUD$1265, I would have liked to bought it in Hong Kong store which had a better price but shame their was no stock left when I was their last week so my order will be for the Aussie store, I'm not paying USD$1699 I'm sorry but I think this price is too high either wait or get a friend to buy it for you if there going overseas.", "Date": "April 5, 2013"}, {"Title": "Almost Perfect", "Author": "Robert C. Brooks", "ReviewID": "R7BQGFEMS8OE", "Overall": "4.0", "Content": "Why did I buy a Sony NEX 6 instead? Because I could get a manufacturer's extended warranty on it. With the 35 mm lens it's about the same price, and I'm not saying there's anything wrong with Fuji's, but these little things have \"repair\" written all over them.", "Date": "October 7, 2013"}, {"Title": "Beware of Amazon Open Boxes", "Author": "Thorsten Claus", "ReviewID": "R1SC0GR0TM59QO", "Overall": "3.0", "Content": "Just received my order, and unfortunately this was on open box -- the metal clips and clip attachment tool  was missing, protective covers also, the box was banged up and some bar codes were crudely covered with white stickers, ripped to size.When I spend $1,500 on an item I expect a bit more respect for my order. Lesson Learned: It's better to buy photo items at B&H; Photo Video, at least I know that they don't try to sneak in open box items, hoping I wouldn't notice...UPDATED MAY 30th:May 28th I received the replacement from Amazon (ordered April 24th): AGAIN AN OPEN BOX!  This time whoever had it before me was not very sneaky about it: all plastic wrappers were ripped open, cheek marks on he screen, a dirty viewfinder, and the camera-internal picture counter showed \"15\" (someone didn't know how to do a factory reset), the settings were played with. Of course I was furious -- I didn't want to wait another 4 weeks for the next open box.  So this time I called Amazon. After a very short wait I vented my frustration (and almost managed to stay calm). The customer care agent was great (!), though, went into a chat with his supervisor, and was able to make me an irresistible offer to keep the used camera.I'm now a happy owner of a used X100s, and with firmware revision 1.03 a lot of the initial glitches are done with, too.  While I wish I would've gotten a new box the first time, I am happy that Amazon's customer was so forthcoming (well, we also spend an insane amount on Amazon every year).", "Date": "April 24, 2013"}, {"Title": "An x100 with improvements", "Author": "Andrew Hamed", "ReviewID": "R2TG144FRJ30J4", "Overall": "5.0", "Content": "These people giving 1 star reviews have no idea what they're talking about. This just like the x100, but welcome improvements. Chances are, the people who are giving 1 star reviews have never used an x100.", "Date": "March 6, 2013"}, {"Title": "Requesting features", "Author": "Ryan Matthews", "ReviewID": "R3B8PBQ4A6QRWG", "Overall": "3.0", "Content": "Fuji, please add:1) NFC Wi-Fi so I can control start/stop recording and zoom via my iPhone (Like Sony has with PlayMemories Mobile and their Cybershot line)2) Some optical zoom!And you'll have yourself a loyal customer...P.S. - Great job on 1920x1080 60fps.", "Date": "December 24, 2013"}, {"Title": "x100s is better", "Author": "Damhieu", "ReviewID": "R50DGOPX46XWI", "Overall": "5.0", "Content": "X100 is great, x100s is better for sure. X100 is rated at 4.3 so x100s must >4=5s. That is my logic. Sorry about my english", "Date": "March 7, 2013"}, {"Title": "5 star year right", "Author": "Nicolaos Chrysanthou \"Nick\"", "ReviewID": "R16PHMUFUMY4YQ", "Overall": "1.0", "Content": "It is not a bad camera, however it is hugely overpriced and should have been sold for a third of its present day value. Even the lowest end DSLR will beat it in any field and still have the versatily of using the best lenses in the market. Added to that, its biggest selling point ie its size is a little smaller than a decent DSLR with a small lens. You dont want to carry a huge burden just get a 35mm or 50mm lens and use a Nikon 600d or canon 6d and you have yourself the best of both worlds. Alternatively you can buy a 3200 Nikon for half the money more quality and be happier. The rest is just retro marketing crap.", "Date": "October 21, 2013"}, {"Title": "Fuji X100S should be excellent.", "Author": "mitchelr", "ReviewID": "R1DHPW4I1ZJHKI", "Overall": "5.0", "Content": "Certainly it is not appropriate to \"rate\" a product unseen. Disregard the \"stars\" above.  But if the X100S is any improvement at all over the outstanding X100 it will be worth every penny - and every star.  I've had the X100 for a year and had more fun (and good results) in that 12 months than in the preceding  decade. Complaints?  Slow focus?  This was a problem for me exactly one day.  I then upgraded to the latest firmware (as recommended), never removed the memory card without a reformat (as recommended), and found the X100 an agile, intuitive, fully controllable street shooter of the first order.  The results are something to behold - spot on auto white balance auto dynamic range and excellent, FAST auto-focus if you upgrade and obey the memory card rule.  Not enough lenses?  Some people need more gadgets.  I was trained by a WWII combat photographer - very old school.  When he landed on Normandie beach, laden with an Army issue B&H; 35 with 4 lens and filters and all manner of goodies dangling about his neck he advanced up the beach perhaps 200 yards, found a foxhole and said goodbye to everything but the body and a normal lens.  Run forward - \"telephoto\"; run back, \"wide angle\" he taught us.  He won many awards, was shot twice, and marched all the way to Berlin, filming the whole way.  One lens was good enough for him. And for some of us it still is.  I spent more than three decades with various Leicas and a ubiquitous 35mm lens.  I owned other lens but the 35 was the sweet-spot, for me, the best way of seeing the world.  When in my old age, focusing became more challenging, especially with the M6 and M7 I switched to Contax, then assorted digitals.  Then along came the X100.  Is the X100S better?  Time will tell.  But I will be absolutely at the head of the line to buy one.  And no, I'm not selling my X100.", "Date": "February 6, 2013"}, {"Title": "X100S", "Author": "H. Whitehead", "ReviewID": "R2M2JRJVWF0XQ1", "Overall": "5.0", "Content": "I dont know why this camera is getting so many negative reviews. This camera is the best thing since sliced bread. Love it. It has replaced one of my DSLRs.", "Date": "February 18, 2013"}, {"Title": "All \"reviews\" are fake, this product has not been released yet.", "Author": "Derek B", "ReviewID": "R3UKFG03EX4EM1", "Overall": "1.0", "Content": "This is not \"my thoughts about Life, the Universe and Everything\" page.This is a review page where, as per Amazon advice, one should \"focus on specific features of the product and YOUR EXPERIENCE WITH IT\". Amazon says: \"We and millions of shoppers on Amazon appreciate the time you took to write about YOUR EXPERIENCE WITH THIS ITEM\" (capitalization mine).This is not the place to continue making predictions and expressing personal wishes which are not based on experience with yet to be released X100S. 1 star to balance fake 5 stars ratings.", "Date": "February 12, 2013"}, {"Title": "This is a WINNER!", "Author": "The Company", "ReviewID": "ROOQ6I6IYZX53", "Overall": "5.0", "Content": "Fuji will have have a hard time keeping up with the pre orders on this one. Perhaps this will be the \"DSLR Killer\" ?This is a great camera for fine art, fashion, reportage, and street. If its any improvement on the first generation it will be epic.I don't get the negative talk about a fixed focal lens. I have a Hasselblad V system and the only lens I ever use is the 80mm. I never needed more lenses.My only beef with the X100 is that the lens is a 35mm and not a 50 (personal preference) but the 35 is close enough that I can live with it.", "Date": "February 10, 2013"}, {"Title": "Thank you Robert Garcia", "Author": "Alan Brody \"Al\"", "ReviewID": "R1X74E7AGTA9HF", "Overall": "1.0", "Content": "How can people put in a 5 star review for a camera they have never seen? I agree that this looks like a great camera, but it has major limitations as well. Most important, it has a fixed focal length non-interchangeable lens. It also costs over $1000. I'm willing to believe that what it does it does extremely well, but I don't know that from experience, which is what I thought these ratings were all about.Word to the wise READ the reviews, don't count on numbers", "Date": "January 18, 2013"}, {"Title": "Now With Auto Focus!", "Author": "FocusQuick", "ReviewID": "R2D8EKJA1HANOU", "Overall": "5.0", "Content": "I loved the original one but the issues surrounding the AF performance kept me from doing anything other than playing with other peoples. Here is to hoping the new system will be worth-wile!", "Date": "January 7, 2013"}, {"Title": "Just a great camera.", "Author": "cameraman", "ReviewID": "R36A2TI6LP0497", "Overall": "5.0", "Content": "I don't own it but the specs are awesome. I have been waiting for a camera like this. Wowza is the best way to describe it. Thanks fuji film.", "Date": "January 7, 2013"}], "ProductInfo": {"Price": "$1,299.95", "Features": "APS-C 16M X-Trans CMOS II sensor with OLPF-less architecture\nFujinon 23mm F2 fixed focal length lens for quality without compromise\nNewly developed Hybrid Viewfinder\nDigital Split Image Manual Focus System\nFull HD movies", "Name": "Fujifilm X100S 16 MP Digital Camera with 2.8-Inch LCD (Silver)", "ImgURL": "http://ecx.images-amazon.com/images/I/51POFQTHzWL._SX300_.jpg", "ProductID": "B00ATM1MVA"}}