{"Reviews": [{"Title": "Lumix camera", "Author": "ARPAD", "ReviewID": "R3IR73T4X52HTM", "Overall": "5.0", "Content": "This is a great sleek camera that does not weigh a ton and looks good! It was not very costly and has excellent reaction time. It even plays muic when its playing back a slideshow of your pictures! I recommend this camara to anybody that enjoys taking pictures!", "Date": "June 20, 2013"}, {"Title": "Easy to use.", "Author": "Grandma Kay", "ReviewID": "R1TWSBZY8KFSGG", "Overall": "5.0", "Content": "I bought this camera right before vacation, so I didn't have time to really learn to use it. It was easy, and it takes really clear pictures. It's easy to download pictures to the computer.", "Date": "June 19, 2013"}, {"Title": "Very nice!", "Author": "Ray Shiva", "ReviewID": "R8SGDZVFBM560", "Overall": "5.0", "Content": "Love the camera. Got it primarily for its compact size but I've increasingly started using it instead of my Canon EOS (too bulky) as well as the older Lumix DMC-ZS3 (another compact but not quite as small as the FH10). The FH10 picture quality cannot match the EOS but I am not a pro photographer. The small size, good zoom, and decent picture quality of the FH10 are usually good enough for the everyday pictures I take. I can easily put this camera in my shirt or jean pocket.", "Date": "September 5, 2013"}, {"Title": "priced right!", "Author": "l.money", "ReviewID": "R1HVIBODV8BCEA", "Overall": "4.0", "Content": "This camera was not super expensive, and its not super fancy. i love the size of it and the pictures it takes are very good! Time between pictures is a little slow, so if you are going to be shooting lots of pictures in a row, this might not be for you. But i really like it. I've taken it on a 3day breast cancer walk and on a camping trip so far! Hasnt let me down!", "Date": "October 29, 2013"}, {"Title": "Careful to get the right memory card!!!", "Author": "bec", "ReviewID": "R2KVMEGIRA1LUL", "Overall": "4.0", "Content": "I just bought this and bought the SD card that Amazon had suggested was bought by many others to go with the camera, which I presumed was the card used for the camera.  I should have been more careful to check out the specs.  It needs a micro SD card!  Drats!Anyways, from what I see so far, the time between shots and to go to the view mode is a little slow compared to the Canon I previously owned. Colours and picture quality are nice. And I like the panorama feature where you can just hold the button and scan across the scene. Will say more when I use it more.", "Date": "September 23, 2013"}, {"Title": "Very convenient camera for people on the run!", "Author": "Gabriela Castillo", "ReviewID": "RM7BQKF8JN4LA", "Overall": "5.0", "Content": "Great camera! Accessible to carry on one hand because it is so slim! Love the auto retouch button. Also the recharging and transferring pictures cord is the same one! Very convenient camera for people on the run!", "Date": "January 20, 2014"}, {"Title": "Good", "Author": "Javier", "ReviewID": "R1Z3H7PPV79H3Q", "Overall": "4.0", "Content": "This is exactly what i needed, good price, good made and design,100% recommended if you're looking this kind of product.", "Date": "January 16, 2014"}, {"Title": "Lumix", "Author": "Allan Hawkins V", "ReviewID": "R3H1ENR0VPH247", "Overall": "5.0", "Content": "Wao!!! This is a little monter!! I like to walk and take thousands in a single day, and after a couple of hours, a Lumix ZS-15 is heavy! this will fit perfectly in your hands and/or pockets. I HOPE not to get dust inside the lens!!", "Date": "January 2, 2014"}, {"Title": "Good camera!", "Author": "Jason Shultz", "ReviewID": "R2AER9BW1AE4MM", "Overall": "4.0", "Content": "Happy with purchase.  Compact and lightweight.  Fits easily in pocket, making it easy to carry with you.  Highly recommend for anyone considering a new digital camera.  Picture quality seems adequate as well for cost.", "Date": "December 25, 2013"}, {"Title": "camera", "Author": "Shemaedz", "ReviewID": "R3P0VYE3E06I6E", "Overall": "5.0", "Content": "love this camera, also bought a chip for it...works really good with chip takes alot more pictures, micro-chip.... u need to ge this.....She", "Date": "November 24, 2013"}, {"Title": "Compact size, great value", "Author": "K. Dietry \"Culinary Challenged Mom\"", "ReviewID": "R67MPQPQC2LAZ", "Overall": "4.0", "Content": "I love how compact this camera is - really not much bigger than a credit card.  Of course, the trade-off for its size is the lack of a zoom (only 5x zoom), and I do miss having that feature.  Also, shutter speed and playback is a bit slow.  Otherwise, though, a great camera - perfect for slipping into a purse or pocket and being ready to capture a moment!", "Date": "November 5, 2013"}, {"Title": "Expected more from this.", "Author": "Elizabeth Vazquez", "ReviewID": "R1GVC6DKHY0ZTD", "Overall": "3.0", "Content": "This camera is ok. Nothing special.Very slow to show photo after you take it.I like that it doesn't require batteries.It last about 4-5 hours once  charged.This product advertises excellent zoom but it doesn't really reach very far.If you take a photo from far the faces are distorted.I am dissapointed.", "Date": "October 14, 2013"}, {"Title": "LOVE IT LOVE IT", "Author": "caz", "ReviewID": "RH3ZPJP3PSCV3", "Overall": "5.0", "Content": "I had a Nikon camera paid around 400 for it and someone dropped it 2 weeks ago. I needed a camera quick for a party so ordered this one. IT is perfect and takes great pictures. The size is great and goes right in your back pocket. I leave it in Intelligent auto mode and no matter where I am or what the lighting is the pictures come out great.", "Date": "October 10, 2013"}, {"Title": "Lumix FH-10", "Author": "Anthie", "ReviewID": "R1Y3SSSSOYR8RH", "Overall": "2.0", "Content": "The cameral functions well, but the quality of the images is inferior to a 16MP camera. In indoors photographs in particular, with or without flash, the quality of the image is below average with the photo having visible pixels when zoomed x4. This was a let down for me, since compared to my old photos from a 2004 Sony DSC-V1 and a 2009 Canon IXUS, Lumix performed poorly in the overall image quality. In addition the old ones had visible pixels only after x5/x6 zoom respectively.", "Date": "July 5, 2013"}, {"Title": "A good camera but not as good as the previous Panasonic", "Author": "Martin", "ReviewID": "R3VU5X34E6H0XG", "Overall": "4.0", "Content": "I bought this camera to replace a Panasonic DMC FX35 point and shoot which has now taken 6000 pictures. Eventually it developed a flaw like a smudge in images under bright light, particularly in the sky. I bought the DMC FH10 to replace it, as it was the most similar model currently available. The FH10 is lighter and thinner than the FX35. The menus are very similar and the controls and menus are straight forward. However, the combination of a thinner camera and a smaller lens results in lower picture quality in the FH10 than the FX35. I may be quibbling about a point and shoot that costs $100. There is nothing wrong with the images, just slightly less definition than in the previous model. BTW one reason I buy Panasonic is for the image stabilization. It remains great.", "Date": "August 10, 2013"}, {"Title": "expected a better quality camera", "Author": "angi", "ReviewID": "R1YMYQ8HJU7X98", "Overall": "3.0", "Content": "expected a better quality camera. was not what I expected to be a brand so famous. Plastic seems, weighs nothing and is very basic. is small for such a wide hand man. besides all this did not give the two remaining stars because amazon server itself recommended me to buy the 8gb memory card and it turns out when I wound the camera does not accept this type of memory, using memory mini sd, I mean I lost my money.", "Date": "October 15, 2013"}, {"Title": "Chip inserted in adaptor card", "Author": "robert karman", "ReviewID": "R1GG5O3KIPL695", "Overall": "3.0", "Content": "Regarding THE LUMIX FH10Instructions on the small chip you insert in the adapter card are not clear at all. What is its purpose, when do you take it out,etc.It would have been very helpful to have included a picture showing all the steps and benefits of using this chip.", "Date": "April 26, 2013"}], "ProductInfo": {"Price": "$109.99", "Features": "16.1 Mega Pixel, 5x optical zoom, 8x Intelligent Zoom, Mega O.I.S.\n2.7\" LCD Screen, Intelligent Auto Mode, Venus Engine, Panorama Shot\n720p Motion JPEG Video, USB Charging", "Name": "Panasonic Lumix DMC-FH10 16.1 MP Compact Digital Camera with 8x Intelligent Zoom (Black)", "ImgURL": "http://ecx.images-amazon.com/images/I/41nZmWBF08L._SX300_.jpg", "ProductID": "B00ATE7SAM"}}