{"Reviews": [{"Title": "Outstanding camera", "Author": "John", "ReviewID": "RLWBO8NUPD6I", "Overall": "5.0", "Content": "Nikon Coolpix L310 Handling The L310 offers a rubberised hand grip as well as a rubber pad on the rear for your thumb, making it an easy camera to grip. As you may expect for a budget camera, the body is made from plastics, but it does have a metal tripod socket and a lock to keep the battery and memory card cover firmly in place. Nikon also supply a lens cap with the camera.The menus system is simple and easy to navigate using the d-pad. The other buttons are typical for a digital compact, with a movie record button placed on the rear. The 3 inch LCD screen is clear and easy to view.The L310 is powered by four AA batteries, meaning it'll be easy to find replacements when necessary. It has a CIPA rating of 420 shots, we managed in excess of this number during testing, the number of shots will very much depend on the quality of batteries used.Continuous shooting mode records at full 14 megapixel resolution, with Sports continuous limited to a maximum of 3 megapixels.Nikon Coolpix L310 Verdict Other than having 21x optical zoom there aren't many other features that particularly stand out on the L310, but it is capable of taking good pictures with excellent colour reproduction. It's unusual to see a budget super-zoom camera with such good rubber grip, there is also a lens cap and a metal tripod socket, thumbs up to Nikon there.Nikon Coolpix L310 Pros Good zoom range Value for money 1cm minimum focusing distance Comes with a lens cap Generous rubber grip Image quality is OK Excellent colour reproduction Auto white-balance performs well", "Date": "November 28, 2012"}, {"Title": "Great camera for the price!", "Author": "Kevin", "ReviewID": "RZDSI5JEZOOEE", "Overall": "4.0", "Content": "A great camera for beginners.I've been using this camera for a a year now, Shot a lot of pictures and videos as well.It uses AA batteries, so i advise you getting some rechargeable batteries.When taking videos, it's a one click button, also the mic is pretty good as well.It takes pictures in both standard and widescreen.Don't know if it's just mine or not, but when you point at a light source, there's a streak of light in the view finder. But doesn't appear in the picture or video.So if you want to see, here's a link to most of my pictures i'I've taken with it: http://postimg.org/gallery/15crrnz2/", "Date": "December 2, 2013"}, {"Title": "Great!", "Author": "Gracie", "ReviewID": "R14U9HRGY6AYGB", "Overall": "5.0", "Content": "I love my new camera!  The only thing I don't like is that it didn't come in when it was supposed to.  Other than that it's amazing.", "Date": "January 17, 2014"}, {"Title": "Nice camera", "Author": "Alejandro", "ReviewID": "R25RB0M6PHBALW", "Overall": "4.0", "Content": "Great camera, takes great pictures and video.The only negative things are that it doesn't take panorama pictures (I knew this before buying the camera, but I still think that a camera of this price and being kind of recent model should take panorama pictures, I mean, even cellphones can take them) the other thing is that it makes a lot of noise when is focusing, but that might an isolated case.", "Date": "November 26, 2013"}, {"Title": "Review", "Author": "Robert G. Alcaraz", "ReviewID": "RI66949ZNCNQE", "Overall": "4.0", "Content": "Well its ok the only thing that bothers me is that the camera is very sensitive to vibration and the image comes blurry but other than that its good", "Date": "September 4, 2013"}, {"Title": "Hunk of junk", "Author": "Leslie E. MacCoy-Clayton", "ReviewID": "R2TTOBPJM65I1H", "Overall": "1.0", "Content": "Bought this camera for my 14 yea old daughter. It froze up within the first month. Sent it back for repairs and the same thing happened the next week. Sent it back the second time. The pictures were grainy and blurry. By the following week it locked up again. After more research, I discovered that lots of people had the same problem. Don't waste your money.", "Date": "December 6, 2012"}, {"Title": "Great for the price", "Author": "charles jones", "ReviewID": "RP61CNDBPODWW", "Overall": "5.0", "Content": "This camera does all that is expected. Battery consumption is high but manageable. Weight and balance of camera makes it inappropriate for children under 14 years of age as blurry images may result from shaky hands.", "Date": "July 19, 2013"}, {"Title": "Blurry photos", "Author": "loveagoodromance", "ReviewID": "RW1N9PKDOEBXH", "Overall": "1.0", "Content": "Without a tripod, this camera takes nothing but blurry photos. Tried mastering the settings, but still doesn't help. I do not recommend this camera.", "Date": "June 1, 2013"}], "ProductInfo": {"Price": "Unavailable", "Features": "14.1-megapixel CCD sensor for superb image quality\n21x Wide-Angle Optical Zoom-NIKKOR Glass Lens\n5-way VR Image Stabilization System\n3.0 LCD display\n4 AA batteries included", "Name": "Nikon Coolpix L310", "ImgURL": "http://ecx.images-amazon.com/images/I/41d926ebeBL._SY300_.jpg", "ProductID": "B00ABSY0PM"}}