{"Reviews": [{"Title": "Good package", "Author": "peace-for-ever", "ReviewID": "R26I1I1Q9AE3DG", "Overall": "4.0", "Content": "This is a very good package in the sense you get an extra battery, which is very helpful when you go on trips. You also get 32GB memory, HDMI cable, tripod, bag, and cleaning kit.I am very satisfied with Camera and lens. However, camera is heavy to carry. The canon strap that comes with the package is sturdy enough to hold the camera and lens. Only down side I saw until now is the bag. It is not from canon but from Focus and it doesn't have zip. The top of the bag covers the camera but I thought having a zip would protect the camera better, especially when you go on country side trips where you find dust. I plan to buy a new bag from local store that has zip. I haven't used the tripod yet but it seems to be sturdy too. Cleaning kit, I think, is very helpful in cleaning the lens.Overall, this is a good deal. Satisfied with the camera and lens.", "Date": "December 25, 2012"}, {"Title": "Excellent Performance", "Author": "Chaitanya Kiran P", "ReviewID": "R2ORFSPB8PE9V4", "Overall": "5.0", "Content": "For Beginners i recommend this DSLR because of its wide features and ease of operation. Though the T4i doesn't have more additional features than the previous t3i, the upgrade to Digic5 Processor, touch screen is worth trying.", "Date": "December 27, 2012"}, {"Title": "Canon t4i", "Author": "mariella ducci", "ReviewID": "R1JXZ0VXLWIPWV", "Overall": "5.0", "Content": "Great friendly camera for an amateur photographer who wants to feel like a pro! Love the touch screen and general features", "Date": "June 9, 2013"}, {"Title": "Tool kits are helpfule", "Author": "Dong Han", "ReviewID": "RH7BISGD7T4CR", "Overall": "4.0", "Content": "Because there is a cleaning tools for lens which is helpful to me. 32GB flash memory and bag are included.", "Date": "May 2, 2013"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B00A3H15RM"}}