{"Reviews": [{"Title": "Practical", "Author": "Manny Lopez", "ReviewID": "R1UNWBU2L9TJQ4", "Overall": "5.0", "Content": "I recently got the camera at a local store; although, it was cheaper at Amazon, I needed it right away.After going through all the cameras in my price range; I found that this camera has features found on much more expensive cameras that I was looking at.Its compact size makes it easy to carry around.  The ability to take good quality pictures as well as Full HD video eliminates the need to also carry a video camera.The camera has several shooting modes to select from such as Portrait, Panorama, etc...  Pictures look realistic, they are sharp and the colors are vivid and natural.  The image stabilization helps take sharp photos; I found this especially useful when using the zoom for long distance.As they claim, the pictures at low-light are very good, much better than I expected.  At my daughters dance show, they allowed the audience to take photograph without flash.  The pictures and videos came out real good considering the distance that I had to zoom and the low light.The built in HD video camera (CMOS) recording quality is very good.  There is a separate button to record videos.  You can also pause the video recording so you don't end up with a bunch of short clips.The camera has editing features to do things like lighten skin tones, whiten teeth, whiten eyes, reduce dark circles beneath the eyes, and apply a blush-like effect to cheeks.With the built-in wireless you can quickly send your pictures and video to your smart phone, tablet, etc... to email them to your friends and family, or post them online.  This beats having to take your memory card out of the camera or plug the camera to a computer to share your pictures.  You are also supposed to be able to control the camera with your smart phone; however, I haven't tried that yet.Options for Image size: 16MP - 4608 x 3456, 8MP - 3264 x 2448, 4MP - 2272 x 1704, 2MP - 1600 x 1200, VGA - 640 x 480, 16:9 (12MP) 4608 x 2592", "Date": "February 14, 2013"}, {"Title": "Good Camera, Great Price (Wifi description)", "Author": "S. Teague", "ReviewID": "R1SG4Q27102OXA", "Overall": "4.0", "Content": "I bought this camera a week ago at Costco.  It is $159 (after $40 rebate) with 8gb card and leather case.  I got the red color, as it is nice, and \"different\" but not as bright as the orange.  I was replacing my Nikon Coolpix S5200 (I believe) that had the touchscreen (horrible).  I had bought it in March at Costco for the same price as this, but it was horrible....Anyways, I haven't used the camera that much, but so far I am impressed with the pictures I have taken.  The speed could be faster, from wake up to processing between photos' but I don't want to be too picky.I wanted to explain the WiFi as I couldn't find that much information on it before purchasing....If you have a Iproduct (Phone, Pad, etc), you download an app from the App Store called \"Wireless Mobility Utility\".  You go to the settings on the camera, and you turn the Wifi on, it starts \"searching\".  During that time, you go to your I\"product\" and you go to your Wifi Settings and choose \"Nikon Coolpix\" as that is now your Wireless \"hot spot\".  (you can do this anywhere, you do not need to be near any other wifi hotspot).  You open the App and you can either use your I\"product\" to \"take a picture\" remotely (great for family shots, but the camera still has the 2 second and 10 second timer mode), or you can View the photos on your camera, and upload them to your iproduct instantly.  It is GREAT!!!!  There is no need for any special attachment for your ipad/phone to insert the SD card (I already have this, but won't need it now).When you are done, you turn the Wifi off on the camera, as it is a battery suck, and your wifi on your iproduct goes back to whatever hotspot you were usually using for uploading to social media, or whatnot.", "Date": "June 6, 2013"}, {"Title": "Very Good Camera for the price. :)", "Author": "Lexi", "ReviewID": "R16QYFQRHOA67X", "Overall": "5.0", "Content": "Overall this camera has lived up to what I expected from it. It is a very good camera for a casual photographer like myself. Awesome optical zoom (I'm amazed by what they can fit into the slim cameras nowadays). It takes amazing pictures. And it does really well in low lit areas.My only complaints are that you have to charge the battery while it is in the camera, and the WIFI capability drains a lot of power when used.", "Date": "April 4, 2013"}, {"Title": "Good Camera, but not really \"Wi-Fi\"", "Author": "Deep Thought", "ReviewID": "R17SHAS2VVM6P", "Overall": "3.0", "Content": "If you want to buy this for the wi-fi feature, dont bother, or at least make sure that you understand what this feature really is.I wanted a wi-fi capable camera. I saw this one and was drawn to it's name. The word \"wi-fi\" is prominent right there in it's name, appearing even before the word \"camera\".Nikon COOLPIX S6500 Wi-Fi Digital Camera.That's why I was disappointed to learn what that really means (or rather doesn't mean). No you can't use this \"wi-fi\" camera to shoot pics and upload them to the net, cloud storage, social media or anything like that at all. You cannot connect this wi-fi camera to your home network or any network, let alone the internet. What Nikon means when they say \"wi-fi camera\" is that it connects to your smart phone and then you can transfer pics to it wirelessly. In a sense that sounds something like a Bluetooth connection, but If I wanted a camera with blue-tooth I would have shopped for a camera with blue-tooth. What this does is turn into a \"hot-spot\" that you connect your smartphone to just as you would browse for routers or hot-spots and connect to them. You just connect to your camera instead.This is how it is supposed to work in theory any way, but I have yet to be able to actually connect my Motorola Droid 3 to the wi-fi camera. If that sounds like a wi-fi camera to you, then you might not be dissapointed (or if you don't care about having a real \"wi-fi camera.\"I'm not reviewing the rest of the camera since that is done well enough by others here and on the photography sites. Yes, it's small, cute, stylish looking (I chose the orange color which is quite nice) and takes great pics especially given it's size and price. I want this review to strictly highlight the wi-fi issue. Another thing to be aware of is that it is very small and might even feel awkward for some, so I'd suggest a hand-on at a brick and mortar store before purchase. Yes it deserves more than 3 stars on the camera itself and I am partly to blame for not thoroughly vetting this before ordering (the low price-point had a lot to do with that and admittedly that in itself should had tipped me off. I feel though the harsh deduction is justified given the labeling \"Wi-Fi Camera\" and lack of clear information on just what that actually means.If someone tells you that if you like you health insurance, you can keep it, or tries to sell you a \"wi-fi\" camera, you'd better read the fine print (if you can find it).", "Date": "November 5, 2013"}, {"Title": "This Camera is Awesome!!!!", "Author": "Bonita", "ReviewID": "RBO6P1SHST0DO", "Overall": "5.0", "Content": "First, I am not a professional photographer, but I love taking pictures of my grandchildren and the outdoors.  I had been looking for a camera that would give me sharp, crisp pictures and I have finally found this in the Nikon S6500.  Even when usng the zoom. the pictures are great.  Kids are never still when trying to take pictures and this camera catches every moment.Yes, this is a great camera and I would recommend that you at least try it.", "Date": "March 20, 2013"}, {"Title": "Fabulous little camera", "Author": "Maryann E.", "ReviewID": "RFT2S35M7PJ1Y", "Overall": "5.0", "Content": "I really enjoy being able to add different effects to my pictures right in the camera. I especially like the painting one. The camera takes fabulous photos. Small enough to fit in my jeans pocket.", "Date": "April 16, 2013"}, {"Title": "Great Little Camera", "Author": "Gray14", "ReviewID": "R2VJR9TQVBFGV1", "Overall": "5.0", "Content": "I bought this camera for some trips I was going on. It replaced a camera I had with 3x zoom and 8 mp. First I used it at home to try it out. I took pictures with this camera and my old one of the same trees, car and sky. This camera blew my old one out of the water. THe pictures were crisp, clear and the zooming was amazing even close to its maximum zoom. The only problem I had was that I didn't change the scene to \"beach\" before taking the pictures of the sky. Once I did that, they were awesome.Now for the best part. The wi-fi. I took the camera to work becasue a co-worker needed some pics for a project. I took the pictures then realized that I forgot the USB cable. So I synced it to my iPhone and transferred the pics. Then I emailed the pictures from my hpone. It was so easy! I also used it on my bicycle with a bike mount for a Go Pro like experience and it worked perfectly! (bought the camera mount on Amazon)Now I am no way near a camera expert and don't even know what the mechanism is that makes the lens zoom in and out (don't judge me) but it seems like if anything were to break, it would be that. And if it does, I will cross that bridge when I get to it. My final recommendation would be that should you buy this camera, you spend some time getting to know it. I have found that some of the negative reviews would not be quite as negative if the people who boughtthe camera could navigate it a bit faster. I hope this helps!", "Date": "August 5, 2013"}, {"Title": "Best Purchase Ever !", "Author": "L. Anderson", "ReviewID": "R1T1E982GQZAEZ", "Overall": "5.0", "Content": "Bought this for my husband after months of comparing digital camera features. HE LOVES IT! Easy to use, fits in your pocket, and the photo quality is amazing! The zoom feature is truly awesome. Can't wait to take this baby on the road!", "Date": "April 5, 2013"}, {"Title": "worked fine for 3 days", "Author": "Patricia Schmidt", "ReviewID": "R1ZG0XK5Q87VKX", "Overall": "1.0", "Content": "We bought the camera to take on vacation to New Orleans.  We loved it for the first three days.  On the 4th day it took one picture and froze... wouldn't retract it's lense wouldn't do anything.  Recharged it .. nothing... changed the battery and then recharged again and it finally closed up.  Next morning one picture and froze again....wouldn't retract even with the batttery and card out....couldn't put it in it's case with the lense out.  Looked on internet and it is loaded with complaints about this problem.  Went on the Nikkon site and they had no suggestions and appeared to be oblivious to the problem.  We have returned the camera for refund since we don't trust that the next one won't be the same.Thank heavens we took the old kodak camera along or we would have had 5 days of no pictures.", "Date": "October 3, 2013"}, {"Title": "My Idea of Point and Shoot", "Author": "Alice", "ReviewID": "RODOUG347C2X9", "Overall": "5.0", "Content": "I was looking for a point and shoot that had high resolution, zoom, good lighting, and good focus. For the price, size, and quality of picture, I think this is a great camera. It met my expectations and I am quite comfortable using it without reading the manual or needing to figure out what the buttons mean. Perfect size to fit in a pocket so it's great to bring along without needing it's own bag. I was impressed with the zooming capabilities and its auto focus. As long as you aren't doing anything too fancy but need a little more of an edge to your photos, this is perfect.", "Date": "April 30, 2013"}, {"Title": "Not impressed", "Author": "A. Roy", "ReviewID": "RZ0PQSDOOQK8U", "Overall": "1.0", "Content": "I had several issues with this camera, some were with the design. But ultimately it just stopped working after 2 months and I had to return it.  Lucky for me I bought it at Costco and they have an excellent return policy.  I'll admit I didn't do much research before buying this, as I needed to get it fast before leaving on vacation.  It's been a few years since I've bought a digital camera so now I know what to look for.For starters, there's the Wi-Fi feature.  The camera creates a mini network or hotspot that your phone or tablet can connect to, and you use an app to transfer photos.  This worked ok, but it wasn't what I was expecting.  I was more hoping to connect to the camera similar to a network drive (smb  protocol).  What really annoyed me was the app on my tablet transferred all the photos at a lower resolution than they were taken.  Being on vacation, I was hoping to transfer photos and make room on the camera, but not deminish the quality in the process.Second annoyance is the proprietary power connection on the camera, which is not micro-USB.  Not only does this mean you have to bring this specific cable along when traveling (I'm already bringing micro USB cables for my phone/tablet), but there are two slots side by side on the camera  this connector will fit into, the other being a mini HDMI (I think).  Many times I've fit the plug into the wrong hole.  I'm not sure if this is what ultimately contributed to the camera not working.There is no tightening clasp on the wrist strap.  Seems like such a simple little thing, but my Canon Powershots always had them.  So if you're walking along with your camera in hand, you can't rely entirely on the strap to keep it secure.Picture quality could be very good, but could really suck too.  I didn't have it long enough to experiment with all the settings, and you need to play around with it a lot before you want to capture those fleeting moments that really count.No GPS feature. The phone app will \"add\" a location when you transfer the pictures. Unfortunately this is usually many miles and days away from where the photo was taken, so what's the point?No share with Facebook or email.  This is what I was really expecting with a WiFi-enabled camera.The camera finally stopped working.  I could plug it in and charge it, and the green LED would then on, but no response when pushing the power button, plugging into a computer, out pressing the play button to review pictures.  So back it goes.", "Date": "December 27, 2013"}, {"Title": "So many features!", "Author": "Tabitham84", "ReviewID": "R3ORLJPJHDO256", "Overall": "5.0", "Content": "I love everything about this camera so far. It takes wonderful pictures, and I still haven't been able to take advantage of every feature but I plan on it this summer! I'm going to upload some pictures onto the page for others to see. The POP feature is my favorite. It really brings out the vibrancy of colors that you see do see with the naked eye. Amazing camera for a little point and shoot. :) It's lightweight, and smaller//thinner than I was expecting.  The only con to this camera is that sometimes it lags a little after you've taken a picture, before it'll show up on the screen. Otherwise, I recommend this camera if you want something affordable, light, and easy to use!", "Date": "June 12, 2013"}, {"Title": "Frustrated.", "Author": "Lawrence Zeringue", "ReviewID": "R3BFMZ1UK4KKVE", "Overall": "2.0", "Content": "It takes great pictures. However, it does not allow you to take multiple pictures without editing the the first picture, i.e., no burst mode. This is very frustrating when you are trying to take picture multiple pictures in rapid succession. I returned the camera because I missed my daughter walking across the stage at her graduation (only one picture).", "Date": "June 8, 2013"}, {"Title": "AWESOME!!!", "Author": "Amazon Customer \"L.A.B.\"", "ReviewID": "R29GWIQCQGFPNL", "Overall": "5.0", "Content": "I love this Camera I wouldn't change my purchase given the chance. Own a smart phone? You can control the camera via wireless with the Wireless Mobile Utility application (Available on Android and iOS.) Take about ultimate selfies and great photos from a tri-pod :)Please know that the Wi-Fi will not work until you insert and SD card. (Even Nikon support neglected to tell me that,) I strongly suggest Google-ing this product because you will find helpful articles as did I. This takes great photos and has a number of interchangeable setting. Any questions? Just email me.. L.A.Bacon@gmail.com with any questions. I am so impressed with this device that I would love to turn people on to this awesome Nikon product. Enjoy folks!!", "Date": "July 1, 2013"}, {"Title": "Sweet Little Camera", "Author": "JoHarley", "ReviewID": "R3VE4071UHPOTN", "Overall": "4.0", "Content": "Great little camera. Had the S6100 but lost it, 'somewhere'. The S6100 did have the touch screen, which I really liked. The S6500 doesn't have the touch screen, bummer! But this camera is great to hook on the belt and have with you where ever you go. Takes the greatest shots!Looking for an excellent case? Found these on Amazon. I use this case for all 4 of my compact cameras. They're so in expensive I even bought extras. Excellent case for this camera.Black Semi-hard Magnetic Closure Universal Camera Case for Nikon Coolpix", "Date": "April 26, 2013"}, {"Title": "Wouldn't buy it again", "Author": "James W. Ireland", "ReviewID": "R2JW2SYA3ENP9Z", "Overall": "1.0", "Content": "Although the zoom is great I did have a problem when the camera 'froze'. I was turning it on and off quite a bit while on a tour. It got quite warm. You probably should turn it on and leave it on. I had to remove and reinsert the battery to recover.I reported it to the maker and was told to check the memory card to see if it is was the correct one and to check to see that the software was current. The memory was the correct one. The software was one level down from where it could be. But, getting the memory upgraded is not just a matter of plugging the camera into a USB port and downloading it into the camera. Evidently you have to buy a device that lets you plug a memory card into it in order to upgrade the software. It also seems to be a very technical process.", "Date": "December 9, 2013"}, {"Title": "nikon", "Author": "Liz", "ReviewID": "R22Z2R8URIONZ4", "Overall": "2.0", "Content": "I bought this camera cause it had good reviews and the Canon wasn't available in 16 megapixels where I was. I took it in a trip to use for the first time, and while it does take good pictures, I was disappointed. It took 5-10 seconds to be able to take a picture from the time of turning it on, and a lot of times would take longer between photos (and I turned off the editing). I'm not sure what's up with this, but in a touristy area, I missed a lot of good shots of things because by the time my camera allowed me to actually take a picture, people were in the photo or the action was over. Also, the low light photos look like they were taken in daylight, not in the evening time (which is what I mostly used it for). I wanted the photos to still look like they were taken at night and they don't at all.", "Date": "September 13, 2013"}, {"Title": "Returned it after half a day", "Author": "150 F3", "ReviewID": "RMAPGEF49VU2S", "Overall": "2.0", "Content": "Problems: Lots of out of focus photos in strong daylight (with half pressing shutter button, getting focus confirmation beeps, and seeing green brackets displayed). Auto HDR feature delivered very, very, very weak results, like overexposed pastel gray versions of regular non-HDR photos. Auto HDR photos had less dynamic range than regular photos. Lots of camera shake in strong daylight. Digital zoom was turned off, but I saw blocky edges on objects in 8 megapixel photos at less than full optical zoom. The blocky effect was probably from Nikon's choice to overcompress JPEGs. Self timer automatically turned itself off after being used, so I had to manually turn it back on over and over and over. Wind noise reduction did not work at all. Audio had loud pops and clicks that did not correspond to real world sound waves. Tiny, recessed power button often had to be pressed more than once to turn on the camera. There was no low saturation option, so it was impossible to photograph day-glo subjects. They had clipped highlights at EV -2.0. Glamour retouching produced bizarre results with way too much skin smoothing. Battery door impeded access to SD card, making it quite difficult to remove with door unable to swing open more than 90 degrees. USB port door impeded access, making it quite awkward and difficult to plug in the cord. Did not work with a Linux PC. Had to use a card reader, meaning I had to deal with the frustrating battery door too often. Camera rotated photos that didn't need rotation, with no option to disable auto rotation. Cumbersome interface with lots of submenus and the need to confirm, rather than simply choose options. Video start / stop button was recessed and difficult to operate. Buttons failed to respond for several seconds after camera appeared to be on and ready. EV reverted to 0 in most modes after powering down and up. Pop, Toy Camera, Cross Process, and Soft Focus modes produced hideously ugly photos. Nikon used a read only file system for SD card, making it impossible to reformat an 8 GB card in Linux. Upon checking to fix errors, the disk utility in Linux said the file system was not clean. Had to use another digital camera to reformat. Felt lied to. Felt tricked. Felt regret. Lost faith in ability of English language to convey true information. Lost faith in technological progress.Good points: Very pretty paint job. The metallic orange was lovely. The screen was OK. I liked having the tic tac toe grid overlay option to help align photos with horizons and vertical subjects. Product was superficially attractive. A lot of thought and care went into its surface appearance (and marketing). Interface and buttons were responsive. Macros were appealing when cropped from 16 megapixel originals.This product turned me from a Nikon admirer to a Nikon hater. I don't understand why a manufacturer would make products this awful, then put their company name on them. I wish the engineers simply made the basic functions of still photography fast and easy and left the gimmicky and disappointing extra features for third party software creators to worry about. I wish digital cameras just had 5 or 10 settings that stayed where the photographer left them. It's no fun remembering whether or not a certain feature switches itself off and on depending on what other features cluttering up the system are in use. The S6500 takes commands, makes one photo, then undoes the commands on the condescending presumption that users making camera adjustments don't know what they're doing. I'd rather take pictures in a creative flow with a passive camera, not have to fight and struggle repeatedly for influence over machines supposedly meant to augment human capabilities. What a waste of money.", "Date": "August 16, 2013"}, {"Title": "Coolpix S6500 with Wi Fi??", "Author": "JEANNE NEARMAN", "ReviewID": "R3G8WGT0576WWM", "Overall": "3.0", "Content": "The camera is fine however I didn't find out until I downloaded all the Wi Fi info that I needed an I card or I phone to use the Wi Fi.  Was very disappointed in that.", "Date": "July 10, 2013"}, {"Title": "DO NOT BUY THIS CAMERA", "Author": "Mindy Butler", "ReviewID": "R1TET7QGKMNTRV", "Overall": "1.0", "Content": "I purchased this camera for my daughter's surprise birthday trip to Disneyland. I received it the the first part of September took a few test shots with it and then took it with us the end of October. Half way through the trip it stopped working. After we got home I sent it in for repair. It's a brand new camera there has to be something wrong with it right? They wanted to charge me $116 to fix a brand new camera. No thank you. I will go back to using a Canon at least I never had any of theirs quit on me after 2 months.", "Date": "January 8, 2014"}, {"Title": "Horrible functionality, settings always switch", "Author": "Amazon Customer \"joannemeise\"", "ReviewID": "R5LK2MZJNEG3X", "Overall": "1.0", "Content": "We bought this camera only a few months ago, and are so disappointed.  Here are the main issues:1) Settings constantly revert to ones that make your pictures fuzzy or with poor lighting2) You need to wait about 10 seconds between pictures to take the next one -- missing key moments3) Video captures in freeze frame technology, not in real videoI have resorted to taking all pictures with my cell phone.  What a waste of money -- don't buy.", "Date": "December 26, 2013"}, {"Title": "OK camera", "Author": "Jessica", "ReviewID": "R13D0S87I8OL1M", "Overall": "1.0", "Content": "ORIGINAL: This is only my second outing with this camera and I am severely disappointed.  It takes pictures fine, but when I click to view my pictures, the camera freezes and the screen goes black.  The lenses stays out, and the camera won't respond to anything until I remove the battery and restart it.  Don't have my laptop on vacation with me so I'm not even sure if the pictures are being saved yet.  Guess I'll be using my phone camera after all.UPDATED: Although I had used my camera before with no issue, and although my memory card works just fine on my fugi waterproof camera, my problem was resolved by replacing the memory card.  I have not had another problem since switching the cards.  I upgraded the rating from one star to four stars.  I am still upset that I had this issue to begin with.  Pictures turn out fine.  I don't like the fact that the camera prompts me turn off silent mode when I turn on the flash.  I do like the color of the camera. Pictures turn out fine, nothing spectacular but does the job.", "Date": "July 3, 2013"}, {"Title": "Decent but not great", "Author": "Bob C. Chen", "ReviewID": "R1HYDPBLGX2UOD", "Overall": "3.0", "Content": "I got this instead of the Canon elph 330 and for the most part it is okay.  Pictures are good but the auto focus has trouble at times.  The body is plastic and feels cheap.  Overall a good point and shoot when you don't want to lug around a DSLR.  One major gripe is that you power on the camera which causes lens to open when you just want to view your pictures.  On my Canon's simply pressing the picture preview button will let you view pictures without the lense extending.", "Date": "May 20, 2013"}, {"Title": "1 Week Old & Lens stuck/camera won't turn off/on", "Author": "Not her Real Name", "ReviewID": "R3GVAJWFZUFK6C", "Overall": "1.0", "Content": "Yikes.  Bought this camera a little over a week ago to take to a very important family celebration.  I had tested it at home and it was all fine, and the photos looked nice.  I was able to get about 20 photos when the camera stopped working and I couldn't get the telephoto lens to retract. I was in another city so I couldn't go back to the store to get a replacement.  This was a major family celebration but I don't have many photos of it so I feel pretty terrible.  I haven't bought a Nikon since they were good cameras that were made in Japan.  This one's made in China.  I looked online and see a lot of people have had this problem.  I didn't drop the camera--no time to do that in its week with me, but I think there's a design flaw that makes this a common problem.So sorry I didn't buy something reliable.  I would have loved to have photographs of my family.", "Date": "May 19, 2013"}, {"Title": "Great Camera and lots of features for in a compact camera", "Author": "jason l bemiller", "ReviewID": "RTD799C0WPJ0O", "Overall": "4.0", "Content": "This was to help with the short outings instead of lugging the giant DSLR that we have.  The pictures are very good.  I am not a professional.  They are clear and not blurry.  We just use it in auto and let it do its thing.  Sometimes, it doesn't focus very fast.  But, usually, you just back up a little bit and try again and it works fine.  The only con would be the speed at which you want to take the next shot is delayed by the camera prompting you to add effects on every photo.  Not sure if that feature can be shut off or not.  It is light and small and the zoom is adequate.  I have not used all of its features, but the effects when you use them are really cool.  I have not used the Wi-Fi and it doesn't have GPS.  It does have panorama picture taking.  I would have put 5 stars except the effects prompting is annoying.  We are using the sandisk ultra 32GB SD memory cards and they work fine.  We had an Olympus that used those crappy XD cards.  Not anymore.  This camera does a great job!  Had it about 2 months.", "Date": "April 10, 2013"}, {"Title": "Disappointed", "Author": "KP", "ReviewID": "R1OHJAREET4KJ7", "Overall": "2.0", "Content": "When it worked it took nice pictures, otherwise it was a headache. I tested this camera out on a recent trip and was disappointed by its performance. It was slow to turn on, wake-up from sleep mode, and to turn off. It did not hold its charge for very long even with small picture files in a moderate climate. The wi-fi feature did not work even though other devices were able to connect. In order to turn on the camera after it was done charging, I had to remove the battery and put it back in. While the video feature worked fine and the picture quality was good, I would not recommend this camera.", "Date": "June 6, 2013"}, {"Title": "Great buy and reliable", "Author": "M. Fernandez \"MFB\"", "ReviewID": "R347Z8VURMCBCP", "Overall": "5.0", "Content": "I just bought this Camera through Costco for $159 as a replacement to my Sony CyberShot DSC-WX9. The Sony only lasted a year then died.So far, I love the case it comes with, the pictures it takes, and the zoom.It is a great camera for the price. I love the Nikon name, too. Also, if I don't like it, I can return to Costco within 90 days. :)I love Costco!", "Date": "June 4, 2013"}, {"Title": "too slow for a good vacation camera", "Author": "RAS", "ReviewID": "R1D16XZ7QQGCQV", "Overall": "2.0", "Content": "I bought this camera as a replacement for a 7 year old Canon 800 IS digital elph after noticing that my iphone now often takes better pics than the elph. I still like a point and shoot, so this looked like a good option. Mostly it takes good enough pics, though it over exposes low light shots in most modes. The deal breaker though is that is is SLOW to wake from sleep mode, causing multiple missed opportunities. Also, in some scene mode, particularly night landscape, it takes a full 15-20 seconds to process a shot before you can take another shot! This is a bit of a deal breaker for me. I was constantly irritated by it on a recent trip to China. Other than this, it seems a decent camera - good auto shots in normal lighting, I like the museum mode a lot. I will, however, be looking elsewhere, possibly back to canon, for a vacation point and shoot.", "Date": "June 6, 2013"}, {"Title": "Disappointed in Nikon", "Author": "Lindsey Fleischhacker", "ReviewID": "R45DXIK5JA24E", "Overall": "2.0", "Content": "I purchased the s6500 as an upgrade to my Coolpix s550. I've been a very loyal Nikon customer for a long time. I've had multiple coolpix and multiple film cameras. This by far is the most disappointed I've ever been with Nikon.This would be a good camera for high light, still photography, or tourist or nature photography. I have a 2 year old, 2 dogs and a cat. Nothing in my house sits still. Of 10 pictures I would take, I might get 1 that was decent. There is a delay in the shutter and the picture you think you capture is great, the image you actually capture leaves much to be desired.Needless to say I've returned the camera and am searching for a new one.", "Date": "May 30, 2013"}, {"Title": "Zoom Lens Issues", "Author": "A. R. Scheidler \"slow-n-steady\"", "ReviewID": "R6JLRF1KK68SN", "Overall": "1.0", "Content": "Zoom lens errors.  After a couple weeks of use the zoom lens would no lnger work and the camera would shut down whenever I tried to zoom out. \"Lens error\" message was displayed across the screen.  Pictures were great from the two weeks it functioned, but not worth the frusteration.", "Date": "December 4, 2013"}, {"Title": "Wi-fi feature works well.", "Author": "Puglover", "ReviewID": "R2A68F10H4NDE5", "Overall": "5.0", "Content": "We are on vacation in Italy and have been using our camera almost daily.  Just sent pictures to our IPad and were able to email them back home.  Love this feature and it's simple to use.  Just download the Nikkon app, turn on camera wi-fi in Settings.  Connect to Nikkon wifi network on IPad, open app and pictures should be available for download.  I had a problem at first, then realized I had to enable Photo setting in I Pad settings.  Sound complicated?  I'm no techie and was able to get this set up in a few minutes.  This little gem is perfect for travel; small, lightweight takes great pictures and video. Highly recommend.", "Date": "October 25, 2013"}, {"Title": "Impossible to transfer pix to computer", "Author": "Beth Tebe", "ReviewID": "R2A5EB3UTRX6WU", "Overall": "1.0", "Content": "It's the 3rd day of trying to figure out how to transfer pictures from the camera to my computer. My husband has even called Nikon to no avail! Shouldn't you simply be able to plug your camera into your computer and transfer a photo? You'd think so. But not with this camera. I haven't had the other problems reviewers are saying, but it's not worth having a camera where you need to practically take a college course in order to learn how to transfer a photo. My husband has transferred photos from many other cameras, so the problem ISN\"T that we're tech-challenged. I bought this camera for the zoom, which is really nice. But if you can't transfer a photo, what good is it? By speaking with Nikon we learned we had to install a driver. This was not an easy process, but it's now done. Hopefully transferring pix will now be simple. Still not worth all the aggravation. Had I known I would have bought a different camera.", "Date": "February 19, 2014"}, {"Title": "Cool and Calculated", "Author": "Amazon Customer", "ReviewID": "R2YCSHBZL6DXWM", "Overall": "4.0", "Content": "My first weeks with this camera have been a delight. The range of its focus is excellent though I find it a bit slow when tryingto take quick shots. I was expecting a bit more speed in that regard, but realize that the more advanced Nikons like the D7100 provide this facility. The S6500 is extremely flexible as a pocket camera and its 16 megapixels makes for excellent images. The WIFI element is a bit cumbersome, not as easy as an IPhone with the shoot and send feature. Overall I love the Coolpix.", "Date": "July 24, 2013"}, {"Title": "Perfect for me", "Author": "Mary", "ReviewID": "RKRAHD98M836S", "Overall": "5.0", "Content": "We bought this for our trip to France.  It is small but packs a lot of features.  The other reviewers mentioned that it took great pictures in lower light, even without the flash.  Really good value for the price.", "Date": "July 22, 2013"}, {"Title": "Nikon COOLPIX S6500 is a great camera but I am used to a higher quality Nikon picture", "Author": "Richard Curtis \"Richard Curtis\"", "ReviewID": "R1AJBP5C4AK8A3", "Overall": "5.0", "Content": "This vendor was excellent to do business with.  They described the product well, the price was good and quick on time delivery.I didn't want to carry my Nikon D3S or my Nikon D800 around Germany for 21 days.  The image on the Nikon COOLPIX S6500 was very good, but not expect the same high 300 pixels per inch like on a $4,000.00 professional camera.  After 4 days of using the Nikon COOLPIX S6500, I chose to carry the Nikon D800, for the greater resolution.But for a point and shoot camera you will love the results.  You will need to read the Camera Manual to get the most from the camera with its Special Menu of shoots options. For example, landscape, night time, portraits, close up, etc.  I think there are over 20 setting for preset subjects.My opinion is based on using a $6,000.00 Nikon D3S, which I understand the Nikon COOLPIX S6500 at $154.00 can not compete with the professional level camera.Note: Other people said that the Nikon COOLPIX S6500 \"eats up batteries!  Yes it does.  Knowing this I carried 3 backup Wasabi Power backup batteries with me.  I was changing batteries every 2-3 hours during an 12 hour sightseeing day in Germany. Batteries are cheap, set of 2 and a charger will cost only $18-$30 on Amazon.com.  That is a very small price to pay to be sure that you can shoot for 12-16 hours.", "Date": "November 26, 2013"}, {"Title": "DIFFICULT TO CONNECT TO WIFI", "Author": "BC", "ReviewID": "R16GPQ2Q34U1BB", "Overall": "4.0", "Content": "I love the camera, but there are absolutely NO DIRECTIONS that make the WiFi easy!  I still can't figure it out!!!", "Date": "July 31, 2013"}, {"Title": "No GPS?", "Author": "Amazon Customer", "ReviewID": "R3J5BVEJQR8MEJ", "Overall": "3.0", "Content": "I don't own this camera but was considering buying it.  Amazon advertises GPS, but the user manual doesn't mention it nor does the Nikon site.  Better check it out if you are looking for GPS, as I am.", "Date": "July 5, 2013"}, {"Title": "Nikon S6500", "Author": "Chuck", "ReviewID": "R1DH6LB2IRJIX1", "Overall": "5.0", "Content": "The Nikon S6500 is everything I had hoped for  in a digital camera.  My only complaint is that the instruction book is incomplete.  It just gives you enough information to get started using the camera.  The camera comes with an instruction book on a CD and is about 100 pages long.  It is not very practical to print this instruction book and carry it with you.", "Date": "July 8, 2013"}, {"Title": "Excellent vacation/family snapshot camera", "Author": "Michael Gillette", "ReviewID": "RS7SB77KZXKV9", "Overall": "5.0", "Content": "I bought the Nikon COOLPIX S6500 for a recently completed trip to Europe.  It performed exactly as I expected.  I have a Canon EOS Rebel but didn't want to lug around that big of a camera since this was a bus tour of multiple countries and I want to travel as light as possible.  I kept the camera in my pocket and discovered if you put a couple heavy-duty rubber bands on it it's easy to grab and won't slide out of your pocket.  (That also helps foil Europe's ever-present pick pockets...)  Other reviews have noted that they were annoyed because after every shot the Quick Effects screen precludes a quick second picture.  If you SLIGHTLY depress the trigger button when the Quick Effects screen appears it will disappear just as quickly, enabling a relatively fast second shot.  My only issue with the camera was the relatively short battery life, but that's solved by having a second/backup battery.  Now, if I can just remember to carry the backup battery with me -- rather than leaving it on the bus as I did on three occasions -- I would have had no issues at all.  But that problem certainly wasn't the camera/batteries fault.  It's an excellent lightweight travel camera that takes amazingly good pictures.", "Date": "June 2, 2013"}, {"Title": "Nikon COOLPIX S6500... great camera for the money.", "Author": "GolferSA \"Odie\"", "ReviewID": "R1LAVTQS4DOLE1", "Overall": "5.0", "Content": "Takes awesome pics, zoom is great, especially if you can stabilize against a door frame, tree, etc.  Once I figured out that the best way to get ONE good photo was to hold down the shutter once focused, and let the camera keep on snapping away... then use whatever photo editing software to go in and delete the ones you don't care for, save the ones you do.  I took some 'stop action' pics of hummingbirds on my feeders... you can actually freeze their little wings in mid hover.  About the size of a deck of cards, extremely easy to carry with you.", "Date": "July 16, 2013"}, {"Title": "Tons of blurry photos - Cannot capture motion of any kind", "Author": "Haze Reid \"haze1123\"", "ReviewID": "RRQTA1QTMQL7K", "Overall": "2.0", "Content": "This is an OK camera when the subject is absolutely, 100% still and motionless.This camera is terrible at capturing motion of any kind.Motion captured in the frame is always blurry - even a very small amount of motion.I tried putting the scene selector into Sport mode, to avoid the blurriness...But that was no help.This camera gets one star from me because half of the pictures it takes are blurry.", "Date": "May 11, 2014"}, {"Title": "Find another camera", "Author": "Marvin J Anderson", "ReviewID": "R2QNR54YOLO72S", "Overall": "1.0", "Content": "The camera will not auto focus for close up pictures.  The battery does not last very long - less than a day of shooting - and takes quite awhile to recharge; since recharging is through the camera itself rather than a separate charger, you can't use it while recharging.Not recommended.", "Date": "April 19, 2014"}, {"Title": "Bad choice", "Author": "Sandy Filson", "ReviewID": "R2HTR47216QC8U", "Overall": "1.0", "Content": "I bought this camera at the end of September 2013, and used it on one overseas trip.2 days prior to a major trip at the end of November I decided to check the battery.The camera would not turn on i.e. the lens would not extract in spite of the charged battery.I hastily replaced it with a Canon Power Shot for my imminent trip. Nikkon will not repair it under the warranty, and wants $109.00 to fix it..Nikkon says the HDMI port contacts are smashed. I have never used this feature. I wish I had purchased this camera at Costco since its return policy/understanding of a defective camera is much better than that of Amazon or Cameta camera,the vendor. The Canon performed really well!", "Date": "February 24, 2014"}, {"Title": "BAD CHOICE BY ME", "Author": "Jay Bamford", "ReviewID": "R1KOOZP41KJGKD", "Overall": "1.0", "Content": "it broke-- will not turn on.  The lens is inop.  It will not extract.  Battery is charged but no operation", "Date": "January 31, 2014"}, {"Title": "Wi-Fi is broken, hi gloss plastic, feels cheap.", "Author": "Joey", "ReviewID": "R2AIWPV8YUWW14", "Overall": "1.0", "Content": "If Wi-Fi is a deciding factor in buying this camera, you'd be much better off with the Canon Elph 330 - I regret reading all the reviews here AFTER my purchase. Picture quality and features are very similar and the Canon feels more solid too.", "Date": "December 7, 2013"}, {"Title": "DO NOT BUY", "Author": "Jason Berger", "ReviewID": "R2WRQIVQ84Q2KB", "Overall": "1.0", "Content": "I've had it one day.  It already freezes up half the time i hit the playback button.  After some quick googling, I see this is a common problem.Needless to say, i'm going to be returning this, and hopefully getting a camera that isn't terrible.", "Date": "December 6, 2013"}, {"Title": "Nice little camera with one fatal flaw", "Author": "Azra Love", "ReviewID": "R1H8ADU86QTTDZ", "Overall": "2.0", "Content": "It's very nice little camera. It's very small and has a zoom as good as can be realistically used with a camera of this kind. The battery is rechargeable but doesn't last very long so get a spare one. It has a bunch of useful pre-programmed modes so those of us that are not good photographers can still take some pretty amazing pictures. Get the fastest memory card you can find because this camera is sluggish when saving and deleting pictures.The wireless feature is limited to cell phones and tablets. You can't use wireless to transfer pictures to a notebook/desktop computer or control the camera. Bummer.But the biggest flaw of this camera is the click button that just does not work most of the time. You click and nothing happens. So you need to keep clicking until it finally decides to snap a picture. It's not because the camera is busy saving the previous picture. It's something else. Maybe it can't focus or something. Whatever. But it just doesn't take the picture when you want it to. You will miss a lot of special moments because of this. It's extremely disappointing. Definitely not the camera for sports/action photography.For this reason alone I cannot recommend this camera to anybody. Get another brand.Video is HD 1080/30p, but the picture quality is not particularly good (and when moving it is downright awful in either 1080/30p or 720/60p). The length is limited to 30 min only. It doesn't matter if it can't take longer videos because the battery will promptly die after 30 min of video anyway.Simply stated, the zoom is the only thing this camera has that a modern phone does not have. You decide if it's worth the cost and the trouble of carrying two devices.", "Date": "November 10, 2013"}, {"Title": "Peer to Peer Using WiFi is what this cam does", "Author": "Ctman2", "ReviewID": "R1HINMHV05EGMU", "Overall": "4.0", "Content": "The gold standard of WiFi is a smartphone where you have apps to post to Facebook, Tweeter, etc directly but this camera is really a two phase process that only allows you to peer with a smartphone to transfer the pix to it and then use the smartphone to do the rest; this could have been done with Bluetooth but I'm sure the engineers figured this was cheaper and easier to do as well as support the modest cost of the camera.  When you try to connect to the camera network from a PC it will not connect so you cannot directly use WiFi to transfer pix to a PC which I find restrictive.  The documentation for setting all this up is not clear at all using even the full manual but it is better than not having any WiFi at all.As for the camera itself I view it as a good value for the money for both stills and videos with the panoramic feature equivalent to my Iphone 5 where you sweep to get the picture which can be up to 360 degrees.  There are many picture processing features some better than others and most available in post processing software but I'm sure the target audience is looking for a final product out of the camera; I was really impressed with the BW options.  The zoom at max does have some chromatic aberration blue fringes but again the overall quality of the system is quite good.  As a lifetime photographer it still amazes me how far we have come with digital procession to automate the process and increase the probability of getting a good picture which can be optimized by simply taking multiple versions of the same scene since \"film\" is free and this cam has a high rate in burst mode.Provided you can live with the WiFi limitation above this is quite a good value for the $150 you pay for it as a package that easily fits in a pocket or handbag which means it will be available when the opportunity presents itself more than a larger camera and provides better quality pictures and features than current smartphones do.............", "Date": "November 8, 2013"}, {"Title": "Nice photos, but fragile", "Author": "Jen M.", "ReviewID": "R3MBRK60CLPH85", "Overall": "2.0", "Content": "This was my second and last Nikon product.  My first, the Coolpix 6100, suffered problems with the lens opening device, which bent easily and then didn't allow the lens to open or shut.  I bought this one, in the fabulous orange color, in July 2013. In August, I dropped it from about 8 inches onto a tile floor, which caused damage to the LCD screen. The damage bled from one corner across half the screen, rendering it non-functional. As the damage isn't covered under warranty, my quite new camera would now make a great paperweight.If you are careful, if you don't want a camera to take hiking, backpacking, or camping, if you don't intend to carry the camera in a pocket without protection, I recommend the camera.  It takes lovely photos.  However, if you are the least bit clumsy or careless (and who isn't?  How many times have I dropped my smartphone from waist level without it suffering any damage at all?), don't choose this camera.I'm looking for a new, shockproof camera.  Sadly.  It will definitely not come from Nikon.", "Date": "September 25, 2013"}, {"Title": "Works as advertized", "Author": "ajchecker", "ReviewID": "R20A4NV12LB27S", "Overall": "4.0", "Content": "After 3-4 weeks of use during my tour overall I am very happy with the camera. Its has numerous 'auto' features and correctly detects the type of focus needed -day, night, closeup, scenic view, night scenic view, indoor etc. The pictures come out great.The battery seems to have a short life though with only 60-80 pictures and drains even more quickly if I make videos. (I believe the advertised like was 150 pics per charge... not sure). The storage of 16GB or 32GB has to be bought separately. For the price I got the camera for the zoom and pix specifications I am overall happy. I am going to order 2 extra batterys.", "Date": "August 25, 2013"}, {"Title": "wifi", "Author": "Amazon Customer", "ReviewID": "RMI7R3R8XG1S5", "Overall": "4.0", "Content": "I was able to get the photos from the camera to the tablet easily, but couldn't do anything with them from there.  I love the camera, the special effects are great and the zoom is good.  Nice size, too.  I just upload the old-fashioned way.", "Date": "August 20, 2013"}, {"Title": "It works for our needs.", "Author": "guest", "ReviewID": "R1ZSAE3UTPES6S", "Overall": "4.0", "Content": "We are the average photographer and this camera meets all of our basic needs in a camera.  We would recommend to any average photographer.", "Date": "August 4, 2013"}, {"Title": "Coolpix S6500", "Author": "J. Lester \"mel\"", "ReviewID": "R3FU5Z9J76727W", "Overall": "5.0", "Content": "If you have ever owned a Nikon Coolpix, this one will not dissapiont. I am not a photographer I just like taking pictures of my family and of course my Boxer. For people like me this is an easy camera that takes beautifully clear pictures. I love it.", "Date": "June 21, 2013"}, {"Title": "Very Happy", "Author": "tmansbamaw", "ReviewID": "R31CUS6EVXAXJ1", "Overall": "5.0", "Content": "My old camera was just about worn out. I wanted one that was able to take pictures AND video. I am certainly no photographer but I love to take pictures (I do a lot of scrapbooking).  But I have a grandson who plays football so I wanted to be able to video him playing football. The pictures are, in my opinion, great. I haven't used it much yet for video, but have experimented with it and I love the zoom capability! I'm looking forward to September!  AND I love the awesome orange color! To me, it was an added bonus!", "Date": "July 15, 2013"}, {"Title": "Perfect!", "Author": "Karla T.", "ReviewID": "R37DY8L3SB24HS", "Overall": "5.0", "Content": "This is the best little camera! I ordered this as a birthday present for my best friend and she was excited beyond words! Not only is it a terrific little camera, but the bonus is, it is ORANGE!", "Date": "July 11, 2013"}, {"Title": "The camera is okay", "Author": "KATE", "ReviewID": "R2D0L6ZXS3PDEO", "Overall": "3.0", "Content": "I use a Nikon SLR and wanted a pocket-size camera for snap shots.The camera ISO goes up to 1600.  I thought that would be nice for inside shots without a flash.But of course the photos are quite grainy.Basically it is small point and shoot for snap shots.  Don't expect anything more.", "Date": "June 8, 2013"}, {"Title": "Nikon Coolpix", "Author": "K. Delker", "ReviewID": "RCAJLWCGIAULE", "Overall": "3.0", "Content": "I have always been a canon guy but I thought I would purchase this camera based on features and price point at the time. I have used the camera on multiple outings and if I had to do it again I would go with another camera. The functionality of the camera itself seems to be ok but the LCD screen leaves a bit to be desired. The first thing I did after getting the camera was to go and buy a LowePro camera bag that specifically fits this camera. I always kept the camera in the bag when not being used however after my second trip the LCD screen was broken.  I don't abuse my equipment especially when a couple hundred dollars are involved (a lot of money in my world). I sent it to Nikon and of course their response was that the item was abused so it was not covered under warranty. I had just purchased an expensive paper weight. After several months of looking at it on the shelf I finally decided to attempt a self repair. I found a part on Ebay and went to work. I learned that the screen has almost no protection and the outer cover is only a thin piece of plastic. (All of my other cameras have a hard thicker plastic screen cover).  I was able to repair the camera and it works however I don't use it very often because it seems to be to fragile. If you are to purchase this model go out and buy a hard plastic screen cover (sold on Ebay) and all should be good. I guess I learned my lesson and will do more research in the future.", "Date": "May 1, 2014"}, {"Title": "So far, so good!", "Author": "Annette Halvorson", "ReviewID": "R15UWZ4M4E6CJF", "Overall": "5.0", "Content": "Love the orange, and that the camera comes in so many colors. Each employee can have a different color so they know which camera is theirs. Hoping that the higher mp, even though it is less zoom, will serve our purpose. Historically, for us, this line of the Nikon's has been a great performer.", "Date": "March 7, 2014"}, {"Title": "Nikon", "Author": "HUNG T LE", "ReviewID": "R1GIVM8AD6GEKP", "Overall": "5.0", "Content": "This item came on-time and in good conditionVideo and pictures is very good.Batteries life also supported enought for what I wantI am did not getting any trouble with this product.Recomend to user for travel with on more battery.", "Date": "March 2, 2014"}, {"Title": "Simple, compact, great pictures!", "Author": "S. Nicholson", "ReviewID": "R3TZWLXRIPLL71", "Overall": "5.0", "Content": "I bought this camera before going on vacation, and it's terrific! It's super easy to use, it's compact, the battery lasts a long time (and I bought a spare in case I was in the middle of nowhere and ran out of juice), and it takes great pictures without a long delay like my old camera. I am extremely happy with this product!", "Date": "February 27, 2014"}, {"Title": "Easy to Use Takes Great Pics!", "Author": "Kimme", "ReviewID": "R3UJNSQ6BICT3W", "Overall": "4.0", "Content": "I guess the title of my review says it all. I used to have the less expensive versions of this camera. I actually had 2 of them. Both were dropped and broke immediately. I recommend using the wrist strap every time now! The camera is easy to use and has many great effects. I don't have a smart phone capable of downloading the app for Wi-Fi which is a bummer. I found nothing as far as an app for a PC or a Mac- only for an iphone.", "Date": "February 18, 2014"}, {"Title": "Piece of Junk", "Author": "Frank Vehorn", "ReviewID": "R14TNR8OID0LUZ", "Overall": "1.0", "Content": "This is a great camera - when it works. Had it for six months and power went out. won't turn on. recharged battery, bought an expensive new batter, still won't turn on. Nothing. Note on internet several others have had similar problem and there is no \"fix.\"Stay away from this camera if you are smart. Nikon once made grade products. Not so much now.", "Date": "December 31, 2013"}, {"Title": "Froze on playback mode", "Author": "Heidi R. Miller", "ReviewID": "REU70U2SN7T50", "Overall": "1.0", "Content": "It worked beautifully for one day. The next day, it froze every time I pressed the playback button. I had to take out the battery and put it in again to get it to start working. Sending it back.", "Date": "December 18, 2013"}, {"Title": "Great features", "Author": "Lee3333", "ReviewID": "R2F83KJLOD6X6M", "Overall": "5.0", "Content": "Just got the camera on Sunday night, so only beginning to use it, but I wanted to leave my first impressions.  My biggest concern was shutter lag.  I had a Nikon point and shoot about 10 years ago, and while it took nice photos, the shutter lag made it impossible to use.  After pressing the button to take a picture, it literally took 2 or 3 seconds before the actual photo was taken.  There were many times when I had people pose and walk away before the shot was taken.  And this was not due to flash delay.  It was just that slow.  None of the other digital cameras (Canon, Fuji, Casio, Kodak, or Viviar) had this problem.  I am pleased to say that the S6500 does not suffer from this.  Press the shutter and it takes the shot.  There is a time delay when you process the photo with a special effect, but you do not have to do this after each shot-you can do it at any time later, like when you are watching TV or eating lunch when you are not going to be using your camera.3 of the nicest features-long zoom to wide angle range, excellent low light capability, and a dedicated button for video (so you don't have to switch any controls or go through a menu to change from snap shot to movie mode).  The lens seems to be very good, as the pictures are sharp.  And the high megapixel rating allows you to crop and blow up areas of the picture without losing resolution.  I also like the wind reduction feature, as I like taking videos from my car as I am driving, and since it is a Jeep, the wind sound used to be a big problem.  When the weather gets nice again, I will see how this setting really works out.  That said, the camera is small, about the same size as my Canon SD890 it is replacing (that camera still works fine, but i just wanted a new toy with newer features).  Plus, the batteries are much smaller, which is important to me as I always carry 2 spares with me.  THe controls are all pretty intuitive.  The slight drawback is that scrolling through the different camera settings and special effects requires you to only go left and right through the different icons, and not up and down which would speed up the process a little.  But that really is not a big deal.My only concern is the durability, as other reviewers here and on other web sites complained about various malfunctions.  But the camera does have a warranty, plus I am considering purchasing extended coverage.", "Date": "November 20, 2013"}, {"Title": "So far so good.", "Author": "Hrmason", "ReviewID": "R342LA20IMFIAG", "Overall": "5.0", "Content": "I just received the camera yesterday. I have played with the functions and taken pictures. I am very happy with the quality, the zoom is amazing and its versitle in its options.  Great camera so far, with a great price tag..this is the cheapest I found it anywhere!", "Date": "October 30, 2013"}, {"Title": "Cool camera", "Author": "Ilene F Schmitt", "ReviewID": "RLO2B3MX07SGE", "Overall": "5.0", "Content": "I compared this camera against many others before finally purchasing.  I like the small compact size and the color.  Price was best I could find.", "Date": "June 28, 2013"}, {"Title": "Battery Life Stinks - a $145 paperweight", "Author": "Robert Allen \"Theologian 101\"", "ReviewID": "R9YF41CXZV1NC", "Overall": "1.0", "Content": "The pictures are good, the camera easy to operate but the battery life is so poor that every time my wife wants to use it, the stupid thing has died.  I thought, Nikon must know how to make a good camera, but someone forgot to tell them if the thing doesn't hold a charge very well, it's more like a 6 oz paper weight.", "Date": "January 11, 2014"}, {"Title": "Nikon Coolpix 6500 not happy", "Author": "Carol Wells", "ReviewID": "R1W5LI0FBAASCN", "Overall": "1.0", "Content": "After using it twice it would not turn on.  I have sent it back for warranty repair.  Hopefully I will have it back for the trip I am taking next week.  The reason I bought it in the first place.", "Date": "October 30, 2013"}, {"Title": "NO GPS!", "Author": "1080p fan", "ReviewID": "R3VPO05S98A4O7", "Overall": "5.0", "Content": "Could someone at Amazon please correct the title of this review?One of the features we need is GPS.  I got the impression there was GPS on this model based on the title of this Amazon review.Nikon COOLPIX S6500 Digital CameraI bought the camera, and tried to setup the GPS, but GPS is not included.We are taking a European vacation, and GPS would have been a nice feature.  Otherwise, the camera has the specs we need.More after the trip...", "Date": "September 19, 2013"}, {"Title": "Great Camera", "Author": "kackleberryfarms", "ReviewID": "R3I85FN7ACWYCC", "Overall": "5.0", "Content": "This camera takes the best pictures ever!!  And it's so small I can take it everywhere.  I like that it's a bright color so that I can find it easily, too.", "Date": "August 5, 2013"}, {"Title": "Folks! this is my First such Tiny P&S.; I've never held anything small like this in my hands before..", "Author": "H. N. RASTOGI \"HNR\"", "ReviewID": "R1GJ5CF9UG01WE", "Overall": "4.0", "Content": "I wanted a small camera for 2 wks. Trip to Turkey and wanted to keep my load lighter (I have Sony Cybershot DSC-H50 which I love to death) so I purchased it and started using while there. Well I'm Not Happy about the pictures quality as such they are fuzzy as others said too but boy o boy, hold your breadth the video quality is SUPERB 1080i and sharp, so I decided to keep it. I'll use both cameras (BTW even Sony takes excellent sharp 1080i Vid) since this is small I'll tuck it in my purse and take out when I need otherwise shoot w/DSC. I think I got best of both the worlds.. Sony and Nikon. Life is a charm.There are quite a few Cons but I'll hold my comments on that because everyone has elaborated enough on them and Yes I support all what the other viewers said.But I love this tiny orange color little camera, my First. Is Nikon listening? I sure hope so. They should fix all negative that people are saying about this camera and manufacture a New updated Model. :)) Everyone Happy.", "Date": "July 7, 2013"}, {"Title": "Love this camera!", "Author": "Lisa", "ReviewID": "R18KZUJHAY2YV8", "Overall": "5.0", "Content": "I have a bigger Canon that I love, but it is too bulky to throw in my purse. I wanted something small to carry around wherever. This camera is great in low light, has an amazing zoom for its size and its wifi feature is easy to use. Its only drawback is that its sound quality for videos is poor. If you want to video a concert, use a bigger camera or video recorder. Otherwise, I would highly recommend this camera.", "Date": "June 16, 2013"}, {"Title": "Poor Service", "Author": "Joseph P.", "ReviewID": "RQDO9A44TRPKI", "Overall": "1.0", "Content": "Bought camera as a Nikon fan and expected an easy to use camera with generally good quality pictures.  Performance basically as expected better than a cell phone and easy to bring along on trips or for use during the holidays.  It simply stopped working after 5 months I tried a new battery to no avail.  I sent it to Nikon they agreed it was under warranty.  This was over a month ago.  I was initially told they were waiting for part and have not heard anything since.  I have asked for a replacement but I am very dissatisfied with Canon service and this will be my last Nikon product.", "Date": "January 6, 2014"}, {"Title": "Loved the camera, until it stopped working. Waiting from Nikon support and I will change my review accordingly and update.", "Author": "Skeletronis", "ReviewID": "R1YKQM18ORSU8K", "Overall": "3.0", "Content": "I ordered this camera last month and it will no longer turn on. I have trouble shot the product with other batteries as well as with it plugged into the wall unit and no dice. I spoke with Nikon customer support and they told me to send it to them to look at. The camera was great and I will add more stars if i did not purchase a paper weight :)The zoom was great, as well as the low light pictures.", "Date": "November 22, 2013"}, {"Title": "Great Camera", "Author": "Kris Faltin", "ReviewID": "R1I4LLTC4B4T5L", "Overall": "4.0", "Content": "I recently purchased this camera prior to a Yellowstone Vacation.  The zoom is excellent and we were able to capture great pics of wildlife from a safe distance.  The only problem I had was the camera \"freezing\"  several times, hence the four stars. :(  I removed and reinserted the battery without difficulty which resolved the problem.  I would highly recommend this camera for all picture amatuers like myself!", "Date": "September 16, 2013"}, {"Title": "Great little camera", "Author": "K. N. CHRISTENSEN", "ReviewID": "R3TBGJ5E3QT9PI", "Overall": "5.0", "Content": "I am very pleased with this simple to operate camera. I never leave the house without slipping it in my ppocket or purse. I've gotten some terrific shots", "Date": "July 25, 2013"}, {"Title": "Wi-Fi does not work!", "Author": "Marlene E. Bryant \"Garden bird\"", "ReviewID": "RV476RE1G4UMI", "Overall": "2.0", "Content": "Love Nikon, but had to return this camera.  Even after talking with Nikon tech, still no luck.  Back it went 1q", "Date": "July 11, 2013"}, {"Title": "Nikon Coolpix S6500 Wi-Digital Camera", "Author": "neklady", "ReviewID": "R3D04GHV2IIXO6", "Overall": "4.0", "Content": "Happy with the quality if the pictures. Didn't read the specifications close enough so was disappointed I could edit the pictures on the camera. Light weight. Still learning how to use it.", "Date": "July 7, 2013"}, {"Title": "Quite satisfied", "Author": "Kim Stanfield", "ReviewID": "R2BVSGUMF7DJ85", "Overall": "4.0", "Content": "I bought this to replace an s4300. I have been very pleased with the photos. I'm not a photographer, just a mom who doesn't want to miss the important moments. I like this camera because the settings are easy to use and the auto setting seems to be correct most of the time- the only exception was in a low-light museum with blue and purple effect lighting.I recommend this camera for novice photographers like me who don't need a camera that's smarter than themselves :)", "Date": "June 28, 2013"}, {"Title": "Love this camera!", "Author": "games", "ReviewID": "R2CWMU9B3K134", "Overall": "5.0", "Content": "This is the second Coolpix camera our family purchased.  Took it to the Grand Canyon, loved the pictures and features!", "Date": "June 13, 2013"}, {"Title": "Disappointed with this camera", "Author": "Photomom", "ReviewID": "R1FG50WO5GXW65", "Overall": "1.0", "Content": "I bought this camera to take pictures and videos at my daughter's wedding. I does poorly in low light even with the flash. Pictures were blurry and unusable. It works best in daylight and the quality of the pictures is good. The video on/off switch is hard to use without shaking seen at the end of a video. It is not an easy button to push. The final straw came the other night, I was taking some video and pictures and came in to hook it up to my computer like I always do and it wouldn't connect. I changed the battery and tried again. Still nothing. It won't even turn on now and it is useless to me. I am taking it back to where I bought it for a refund today. Very disappointing. I would not buy it again.", "Date": "May 31, 2014"}, {"Title": "Problems you wouldn't expect from Nikon", "Author": "Jerold D. Tierney \"Jerold Tierney\"", "ReviewID": "R1EV1UUMOO21SW", "Overall": "2.0", "Content": "I just returned from a 6 week vacation in Europe and had this as my only camera.  I bought it primarily for it's size to fit in a pocket.  The photo quality was ok.  The off / on switch is awkward and slow.  It requires a firm careful push that wastes time and makes it slow for responding to a quick photo opportunity.  Occasionally it will freeze and you have to release and reset the battery to get the camera to function.  The manual zoom control is poorly located and slow to respond.  You have to open the lens to review photos on the chip.  The battery strength warning is almost worthless.I just returned home from a trip so when I have time I intend to try and get my money back for this camera.  If not, I will give it away and buy a cannon or other brand point and shoot but never again a Nikon product.  I'm amazed that a point and shoot camera could not compare to a similar Cannon product I purchased over a decade ago.", "Date": "May 30, 2014"}, {"Title": "Easy to operate and compact", "Author": "Hulagirl72", "ReviewID": "R3W07IKOFL3FK7", "Overall": "4.0", "Content": "I had an older model Coolpix so I was trying to get another one that wouldn't be too complicated to operate and that the methods of operation were similiar.  This model is close.  It did not come with a memory card and my old camera did so I had to buy a memory card and then format it to the camera.  This camera has a little more technology than I need but the few pictures I have taken with it are very nice and clear.  The battery seems to hold a long charge and that is a plus.", "Date": "May 27, 2014"}, {"Title": "Great camera.....but", "Author": "Robert C Warren", "ReviewID": "RJU2A2D6RFJ0H", "Overall": "3.0", "Content": "This is a replacement for the first one I bought a while back.  The camera has tons of features for this low price.  Really like the wifi transfer of pictures to my mobile devices.  This is one of the main reasons I purchased it plus its a Nikon.  The wifi is really more like Bluetooth in how it works.  Wifi may be a bit misleading although you must have a wifi connection for it to work.  I actually had to write to Nikon customer support for more detailed instructions in using this function.  They replied within a day with more detailed instructions that made it clear to me.  One of the issues is you can't put the camera in wifi mode unless you have at least an 80% charge on your battery.  Kind of an... Oh by the way.  The reason I gave the camera only 3 stars instead of the 5 I would've given it is because I had to repurchase this camera again.  I had my first one in a very padded case as I was carrying it.  I dropped the case maybe a foot and a half into a grassy area.  When I went to turn on the camera the LCD screen was ruined making the camera worthless.  I've accidentally dropped iPads and iPhones and even a laptop on to hard surfaces and didn't have this happen.  I was totally shocked it broke with no more impact than that.  But I loved the camera so I chanced it and bought another one.  I have yet to formulate my case to submit to Nikon customer service about my experience.  Great camera but don't drop it.", "Date": "May 21, 2014"}, {"Title": "great", "Author": "knock2x", "ReviewID": "R2715FTFYTMXT8", "Overall": "4.0", "Content": "This is an excellent compact camera & is fairly easy to use. Takes great pictures. The only draw back is the enclosed instructions do not explain how to activate or connect the WiFi that's built into the camera.", "Date": "May 14, 2014"}, {"Title": "Nikons Coolpix S65OO Camera", "Author": "jerome r valenti", "ReviewID": "R4NXFDHQC0FAL", "Overall": "2.0", "Content": "I really don't like this camera. No body knows how to download the SD Card to make DVDs.. The battery in the rear makes it combersome and clumbsy.", "Date": "May 9, 2014"}, {"Title": "Good little camera", "Author": "Kevin H.", "ReviewID": "R2Z4KYSSX8OXH2", "Overall": "4.0", "Content": "Just took this camera on vacation, worked very well,nice pictures.the wifi works well to transfer my favorite pics to my phone to share", "Date": "April 30, 2014"}, {"Title": "Awesome camera with excellent value", "Author": "B. Schenkel \"Brad\"", "ReviewID": "R10WL9LAN2ECCW", "Overall": "5.0", "Content": "Very high quality camera at a good price.  It really does all the actions that I need it to do.", "Date": "April 27, 2014"}, {"Title": "bad design", "Author": "Anthony DiMinno", "ReviewID": "R1X1JJP7VPKING", "Overall": "2.0", "Content": "Sent one camera back because couldn't get battery to charge. Next one worked for awhile (2 Months) then same problem battery wouldn't charge. Nikon was of little help as they do not admit problem exists. Sent back for repair. I am sure it will not solve the problem. Will up date when repair complete.", "Date": "April 26, 2014"}, {"Title": "This little beauty is taking some very nice photos", "Author": "RestlessTime \"Dean Fan Forever\"", "ReviewID": "R3UQE01OBSQTBW", "Overall": "5.0", "Content": "This camera is very easy to operate which is what I really need.  I like to point and shoot and this camera does the trick for me.  So far I am loving it.  I took it to our annual family Easter dinner and the photographic results were stunning.", "Date": "April 25, 2014"}, {"Title": "Grrrrrreat camera!", "Author": "Editor", "ReviewID": "R19XMSLPSP8BD6", "Overall": "5.0", "Content": "I love this camera that is a replacement for my Coolpix 5200. It has even more shooting options (scene choices, sharper resolution, video). The camera is easy to use, comes with a quick start booklet, and access to a 300+ page complete guide on CD, also USB and audio-video cables, and the battery plug for charging. I am not used to charging the battery in the camera, but I plan to get a portable charger so I will always have an extra battery ready for those important occasions.The shipment was super fast, nicely packed, and provided clear information if it would be necessary to contact, and, above all, it is a great deal! Thank you.", "Date": "April 22, 2014"}, {"Title": "great deal", "Author": "ben", "ReviewID": "R1HJ60LXJ2JIKS", "Overall": "5.0", "Content": "recived camera two days earlyer than exspected..camera works perfect and was packaged with all kinds of protection to insure nothing would hurt it thru shipping process. very very happy with these people!! this was a company that went all out to make sure i recived everything in mint condition!!just a great deal..", "Date": "April 16, 2014"}, {"Title": "If your looking for simple...this is the camera for you.", "Author": "Stephanie", "ReviewID": "R25ZHYP10X56I6", "Overall": "5.0", "Content": "I bought this camera for a vacation, because I didn't have a camera besides the one on my phone. I didn't want nothing fancy or too expensive. This camera was perfect for me! It takes great quality pictures and its small and handy. It shipped right on time too.", "Date": "April 14, 2014"}, {"Title": "good prodduct/nikons6500", "Author": "Maureen M. Gibson", "ReviewID": "R9K2VYBGHJ3Z2", "Overall": "4.0", "Content": "I have used many different cameras. I was looking for a replacement for my regular camera. I had seen this model in stores at higher prices. I am not in to computer or wifi features on a camera. The picture quality is good. The camera is easy to use in everyday features. I have more expensive camera, but prefer a less expensive camera for every day usage. The camera was a lower price than the stores. Good picture quality for the money", "Date": "April 12, 2014"}, {"Title": "Love it!", "Author": "Grace", "ReviewID": "R2JRJ0RKZ4X04G", "Overall": "5.0", "Content": "I went to BestBuy looking for a camera, but they were all a lot more expensive than I expected.  I found this little one for 120.00 (usual price at Best Buy is 219.00, it was on sale) and expected it would take good pictures, not amazing pictures!I love love love this camera.  I was very worried when I first purchased it, as I wanted a really nice one (couldn't afford the DSLRs).  I didn't expect really really nice.  I took it out of the box, charged it for a few hours, and 3 hours later, the battery is still full!  This takes great macro pictures and normal shots. I'm attaching a few pictures that show how great this camera is.For this price, it really exceeded my expectations.  Will be using this for years to come!", "Date": "April 12, 2014"}, {"Title": "So far so good", "Author": "Pete Lawler", "ReviewID": "R3F2A2C9XVPS5I", "Overall": "4.0", "Content": "Have only had this camera for a few days.  Got a chance to play with the WiFi function.  It does not transmit directly to social media as some seem to think but if you have a smart phone, download the Nikon camera app to your phone and get ready to play.  I can set the camera on a tripod, aim it where I want to shoot a picture, connect my phone to the camera and zoom in or out and activate the shutter from my phone.  The pictures will immediately download to my phone.  Enjoying the camera so far.", "Date": "April 10, 2014"}, {"Title": "so perfect", "Author": "Gun toting great-grandmother", "ReviewID": "R3CRY42WDFCTMX", "Overall": "4.0", "Content": "My window faced a building and putting this on the bottom pane made my view of the so much nicer and the colors are beautiful", "Date": "April 8, 2014"}, {"Title": "Good choice for a pocket camera", "Author": "Trene", "ReviewID": "RVBK96DJRADU1", "Overall": "5.0", "Content": "Does what it advertises. Images are very crisp and sharp. Makes a good pocket camera to have on hand at all times.", "Date": "April 6, 2014"}, {"Title": "Takes great shots...if you can get it to focus", "Author": "Kitty Leigh", "ReviewID": "R34EX91VZ1E6P1", "Overall": "3.0", "Content": "Meh.  Just meh.  When the pics come out, they're really something.  I spend most of the time trying to get the camera to focus on what I want.  Doesn't always work out in my favor.Love the wifi feature, but battery must be at least half charged to get it to connect to my iPhone for the data transfer.Nice size, very light weight.", "Date": "April 6, 2014"}, {"Title": "Great little camera", "Author": "leviispa", "ReviewID": "R2KH5QGGEDJN6K", "Overall": "4.0", "Content": "I would have given five stars but the battery charges inside the camera so it can't be used when charging.  Not a deal breaker, but a little inconvenient.  Love the camera, small and takes great pictures.", "Date": "April 5, 2014"}, {"Title": "Nikon COOLPIX S6500 Wi-Fi Digital Camera with 12x Zoom (Orange)", "Author": "Eric Butler", "ReviewID": "R2NW6IGHX8NJK1", "Overall": "5.0", "Content": "I bought this camera to have one I could slide in a shirt pocket.  I have a D90 Nikon and just didn't want to lug it with me on a trip I was taking.  I like Nikon quality and this camera had all the features id expect from a good camera. The 12x zoom is one of the features that i was wanting.  Since returning from my trip and using the camera i can say i picked the right one.  The quality of pics are outstanding, the ease of use, the compactness makes this a very nice camera to have handy.  I take it with me now everywhere i go. I grab for it now instead of my phone, although my phone takes nice pics it doesn't have the zoom ability that the S6500 has and that is mostly the plus for this little camera.  I gave it a five star because it roamed across Europe with me for a week and never missed a beat.  I got a good one.  Thanks Amazon!  Your prices are the best too.", "Date": "April 5, 2014"}, {"Title": "Great camera", "Author": "Paul G Kurtz", "ReviewID": "R349RX7ZYXSQ9Z", "Overall": "5.0", "Content": "Works great. It can take pictures really fast. It is a very small camera to have 12x zoom. It fit well in my pocket.", "Date": "April 4, 2014"}, {"Title": "decent for the price", "Author": "jamie", "ReviewID": "RMLYIOVNNACSJ", "Overall": "4.0", "Content": "It takes quite a bit of time to figure out everything this camera can do and it does take really nice pictures for the most part. If you need to zoom in close on something like a document, forget it. It's just one big blurr. I'm still going through the options because the auto isn't always that good on this.Definitely worth the price though.", "Date": "March 30, 2014"}, {"Title": "Cds", "Author": "Laurie Olson", "ReviewID": "R31MSO2X7XKPG", "Overall": "4.0", "Content": "I like the product. One complaint. I received 2cds but nothing was on them. Tried them on all my devices. Nothing", "Date": "March 26, 2014"}, {"Title": "Great Choice", "Author": "flexjam", "ReviewID": "R2SUT73NC4GG9Y", "Overall": "5.0", "Content": "I love this camera. I wanted a camera that took great pictures like my Nikon D5200 without the bulk or weight.", "Date": "March 22, 2014"}, {"Title": "Nice and compact", "Author": "Randall Thornton", "ReviewID": "R3UZN22HDCHE4R", "Overall": "5.0", "Content": "My wife loves this replacement camera (I dropped her old red Nikon) This one is more compact and has a lot more updates.", "Date": "March 10, 2014"}, {"Title": "Good camera", "Author": "Matt", "ReviewID": "R1L54KG2NM7ROW", "Overall": "4.0", "Content": "This camera does everything i expected it to and takes excellent pictures. The only reason for the four stars and not five is the difficulty in turning it on with that smallish on/off button. the camera is small and lightweight , also easy to handle, Ilove the zoomfeature incorporated with the video.All in all anexellent buy.", "Date": "March 9, 2014"}, {"Title": "Wow!", "Author": "DCJ \"Logic\"", "ReviewID": "R21N950QMGAV07", "Overall": "5.0", "Content": "The resolution of the pics this camera takes is outstanding.I'm not a professional.We take a lot of pictures and have used many different makes of small digital cameras.This one, by far, takes the best looking photos right out of the box.Setting features is still a bit of a pain (date, time, size, occasion, etc) but you can just charge the battery and shoot without setting anything and you will still get a great shot, anytime, anywhere, any light.Sometimes you just have to ignore Consumer Reports and listen to the real consumers. Us.", "Date": "March 6, 2014"}, {"Title": "Nice Camera", "Author": "Janice L. Barker \"Jan B\"", "ReviewID": "R1ZG5XU7D1PAFC", "Overall": "4.0", "Content": "I bought this for an upcoming trip to DisneyWorld primarily, but plan to also start taking other pictures as well.  This is my first digital and I bought it based on Consumer Reports ratings.  The only downside to this camera, and others of this same type, is the small size as it can easily slip from your grip. On the flip side is the small size makes it easy to carry.  Be sure to wrap the strap around your wrist!  I'm still learning about it and haven't used it very much, but am pleased with it so far.", "Date": "March 6, 2014"}, {"Title": "So far-so good", "Author": "Walter Boehm", "ReviewID": "R18I8SNF59F3OR", "Overall": "5.0", "Content": "Just started using camera so far so good, Enclosed software wouldn't load but i was able to download at Nikon USA.", "Date": "March 5, 2014"}, {"Title": "Small With Optical Zoom", "Author": "CautiousBuyer", "ReviewID": "R34GPJGY2DPCH6", "Overall": "4.0", "Content": "Not all smart phone pictures are great and a smart phone doesn't come with optical zoom.  We bought this camera because it was small but still offered the optical zoom feature.  We also have another, more expensive and heavier camera we can use for those higher quality pictures.This camera is great.  We carry it biking and it's small size and light weight and just what we wanted.  The pictures are pretty good for a camera this size.  It has a WIFI feature that allows us to download pictures straight to a tablet or phone and even to control the camera as a remote.  The only negative I'd give this camera is that the WIFI feature won't work unless the batteries are fully charged.  That wasn't something obvious to us and took a while to figure out what we were doing wrong.We haven't used our heavier camera since we bought this one.", "Date": "March 3, 2014"}, {"Title": "Nikon Coolpix S6500", "Author": "Matt Ludwig \"MDKLudwig\"", "ReviewID": "R2UIO4SEP4G2AP", "Overall": "5.0", "Content": "Highly rated on Consumer Reports and rightfully so. Absolutely AWESOME camera!!!!Pictures are crisp every time!!My first compact and I'm gonna ditch my big one now, this ones better!!", "Date": "February 26, 2014"}, {"Title": "Nikon COOLPIX Camera Satisfaction", "Author": "Skip Gotschall", "ReviewID": "R1ALPRA1TVFSBY", "Overall": "5.0", "Content": "We bought this camera to replace an older model of the Coolpix camera that was a very good camera.  The new Coolpix operates in much the same way as the old one so was easy to start using.  It is lightweight & small in size so easy to carry.  We have not had pictures developed yet but am quite sure the outcome photos will be great!", "Date": "February 24, 2014"}, {"Title": "Love it!!!", "Author": "william j christianson", "ReviewID": "R322TUYTPX404S", "Overall": "5.0", "Content": "I love this little camera. Small and lightweight. Love the fun color. Very easy to use. Ended up buying my sister one as well as myself.", "Date": "February 20, 2014"}, {"Title": "Nikon coolpix", "Author": "Dodici Group", "ReviewID": "R37ROK0TCRDHL3", "Overall": "4.0", "Content": "Small size, high quality pictures. Need to read manual to understand some features. I would recommend to a friend. good buy.", "Date": "February 16, 2014"}, {"Title": "Great Compact Point & Shoot Camera", "Author": "B.Fair", "ReviewID": "R1QB0IYJGEK0IQ", "Overall": "5.0", "Content": "I needed a small inconspicuous camera for a recent trip to Cuba and bought the S6500 Coolpix based on its 12X optical zoom and its relatively low price.  I found it very easy to use and friends have been raving about the photos i brought back.  I took about 325 shots and  aside from a few taken in impossible light conditions I had to delete none because they were poorly exposed.  Others have indicated that the battery discharges rather quickly.  I was caught short-handed near the end of the day early on the trip after taking a lot of video, but carrying an extra battery insured that didn't happen twice.", "Date": "February 15, 2014"}, {"Title": "Great Home", "Author": "veronica kingston", "ReviewID": "REEGM18COOV0R", "Overall": "5.0", "Content": "My step daughter needed a camera for her 10th great photography class so I bought her this. It takes some very nice photos and is easy to use.", "Date": "February 12, 2014"}, {"Title": "Great camera", "Author": "mohamed gamal eldien", "ReviewID": "R15HVYADTHORIA", "Overall": "5.0", "Content": "Wi Fi option is awesome, you can edit your photos directly on I Pad , enough zoom range, excellent battery , easy to use", "Date": "February 12, 2014"}, {"Title": "Wifi confused me!!", "Author": "Colleen DuBry", "ReviewID": "R2Y6EQ67G0YJPK", "Overall": "5.0", "Content": "I love this camera but I did have to research and found on You Tube video how to down load an app to my smart phone to connect to my camera.  I have a cheap smart phone and after I deleted a couple of the other apps that I don't use on my phone I was able to down load an app that the camera uses and it doesn't cost a thing.  I am no smart phone genius or computer genius and was rather proud of myself for being able to do so without asking for my husbands help. Camera takes wonderful pictures but I think they should have a DVD that shows you how to do it as I watched the video and was able to follow along and it made it easier for me.  Love the look of the camera and now the wifi.  My son is an MMA fighter and can't wait to connect the camera to my TV to watch his fights again.  With this Amazon had a special price on an extra battery and HDMI Cables so I bought them also.", "Date": "February 11, 2014"}, {"Title": "Great little camera", "Author": "Rhonda Schimanski", "ReviewID": "RX5PF0IASUUXC", "Overall": "5.0", "Content": "Refreshing to use and the quality is very good. Durable and doesn't use up the batteries like some others I have used.", "Date": "February 10, 2014"}, {"Title": "coolpix", "Author": "Cherie", "ReviewID": "R3BYFG3IR4K7QZ", "Overall": "5.0", "Content": "I bought myself the Nikon Coolpix, and it is fun and easy to use. I am a casual photographer, and I enjoy being able to recharge my camera and not worry about running out of batteries. I am still learning to use the features,figuring out how the wi fi works, et c. It is a very sophisticated camera for being such a small gadget", "Date": "February 9, 2014"}, {"Title": "Great", "Author": "Larry  C", "ReviewID": "RIGQEZWAAACOY", "Overall": "5.0", "Content": "The Nikon s6500 is great. I love the Zoom when used at the Circus. Get quality pictures V simple to operate  Would recommend to every one who wants a fun camera.", "Date": "February 8, 2014"}, {"Title": "A TEENY CAMERA", "Author": "PHANRANG KID", "ReviewID": "R1YRPGAI6ZH053", "Overall": "4.0", "Content": "Well, NIKON is a great  name in cameras and this one does the job.  As a :Point and Shoot\", it fits the bill.  Small enough to fit in pocket, purse, or pouch.  It is pretty, too.", "Date": "January 3, 2014"}, {"Title": "Not what I expected", "Author": "Christine", "ReviewID": "R11WAILK4FUEVB", "Overall": "2.0", "Content": "The image quality was pretty good—it didn't blow me away, but I also realize this is a small point-and-shoot, so it was acceptable for what it is. However, the reason I purchased the camera was for the Wi-Fi, so that I could take better-quality shots than my iPhone, but still be able to share them via Instagram and Facebook immediately, without having to wait to go home and upload them onto my computer. The Wi-Fi almost never connected, and I was doing everything correctly. I am sending it back, hopefully Nikon can fix this glitch.", "Date": "January 3, 2014"}, {"Title": "Disappointed", "Author": "John E. Lynch", "ReviewID": "R3T0WEXFA75UUC", "Overall": "4.0", "Content": "Didn't realize that the camera DID NOT INCLUDE memory chip.  Would have appreciated alert so I could have ordered the gift + the memory card.  Perhaps the web site disclosed the issue, but I didn't, obviously, see any alert.Amazon is AMAZING and no wonder people avoid miserable stores and favour the web", "Date": "January 3, 2014"}, {"Title": "wow", "Author": "Lov2read", "ReviewID": "R3VQXD22RE5L15", "Overall": "5.0", "Content": "this is an excellent quality and price for such a versatile camera. Loaded with features and compact to carry anywhere.", "Date": "January 1, 2014"}, {"Title": "Great camera!", "Author": "Clew", "ReviewID": "R21DXK8NP8Z3HM", "Overall": "5.0", "Content": "Great pictures and videos super simple and pocket size. Just what I was looking for! Amazon made it easy to find and quick to receive.", "Date": "December 25, 2013"}, {"Title": "Great Camera!", "Author": "Steven Casada", "ReviewID": "RDGUWMP562H3S", "Overall": "5.0", "Content": "Bought this camera for several reasons.  The brand, the reviews and the options plus the WI-FI feature.  As of today I am extremely satisfied.  i would highly recommend this camera.  Extremely simple to use but packed with a lot of great features.  You just can't go wrong buying this camera.", "Date": "December 25, 2013"}, {"Title": "I love the camera - But", "Author": "Jeffrey S. Brown", "ReviewID": "R3NUGFJSZY2GF0", "Overall": "5.0", "Content": "The advertisement said I would receive a 16 GB SD card with the purchase at no cost to me.  The card did not arrive with the package.  I do not know who to contact at Amazon about that.  You are only asked to comment not the delivery and the product or to return the item.  There is not an option to ask about a missing piece that was part of a promotion to help sell the camera.I hope by writing this Amazon will correct this an place an \"other\" response area for us to use.I am quite happy with all the products I've bought here and also with Amazon Prime.  This is the first time I have run into this problem.", "Date": "December 17, 2013"}, {"Title": "Great features for the price.", "Author": "papa", "ReviewID": "R1R8BJ4T7PUIUN", "Overall": "5.0", "Content": "so far,no problems, bought this for my wife as she was headed on a cuise by herself, and wanted  a camera that was durable and take decent memory pix for her trip.", "Date": "November 14, 2013"}, {"Title": "Good deal for price!", "Author": "AliM", "ReviewID": "R30ZFC8H6TQWR7", "Overall": "4.0", "Content": "This camera is great! Its a little bit slow when you turn it on and off but that is my only complaint about it!", "Date": "November 10, 2013"}, {"Title": "Okay, not great", "Author": "Kristy Stout", "ReviewID": "R29QVJGOJ7ZBRR", "Overall": "3.0", "Content": "I got this camera after researching for quite a while but needing to buy something more local or fast.  I had a Sony Cybershot that was a lower pixel, lower zoom and took amazing pictures but broke.  So I got this one.  It can take great pictures but I have to do pictures over over and many are blurry.  It's very disappointing.", "Date": "November 9, 2013"}, {"Title": "Good Camera", "Author": "agedrunner \"agedrunner\"", "ReviewID": "R297TQ2S4XT039", "Overall": "5.0", "Content": "This is an excellent point and shoot camera that will easily fit in a shirt pocket.  The image quality is excellent and the camera has many features which are useful, including several in camera editing options.", "Date": "November 1, 2013"}, {"Title": "easy and fun", "Author": "no name", "ReviewID": "R20XOGDNP5BHVE", "Overall": "4.0", "Content": "I purchased this for my teenaged grand daughter; she is very happy with the size, the weight, the zoom and the ease of taking good candid phoros.", "Date": "November 1, 2013"}, {"Title": "nikon coolpix s6500", "Author": "Carleton W. Hart", "ReviewID": "RSGR4ZTTD1VQW", "Overall": "4.0", "Content": "Good value, earlier version works well.  Surprised that wireless feature only works to a smart phone with special app.  Would like to wirelessly transfer photos to pc as well. .Color options for case is great idea.  Arrived a day earlier than promised, which was a nice surprise.  .", "Date": "October 31, 2013"}, {"Title": "Cannon coolpix", "Author": "Braulio Baeza jr", "ReviewID": "R1HQTCY2SUNZZD", "Overall": "5.0", "Content": "All I had expected and more great buy the wi fi feature make it easy to share pictures memory cards are pricey", "Date": "October 24, 2013"}, {"Title": "Love this camera!", "Author": "Lectroman \"George\"", "ReviewID": "RCROOUSNXRHDE", "Overall": "5.0", "Content": "I bought this camera for our trip to Italy. It was perfect for us. Took great pictures even inside where they don't allow flash. Has a Museum setting which I used a lot. Pictures came out great and it fits in my front pocket!", "Date": "October 2, 2013"}, {"Title": "VERY HAPPY WITH THIS PURCHASE", "Author": "Naomi Donalson", "ReviewID": "RY8963EOLUCD1", "Overall": "4.0", "Content": "I HAVE BEEN REAL HAPPY WITH THIS NEW CAMERA. THE MULTI FOCUSING IS A MAJOR PLUS, ALONG WITH BEING ABLE TO TAKE PICS WHILE IN MOTION. IT TOOK A LITTLE GETTING USED TO THE NEW CAMERA, BUT SO FAR WELL WORTH THE EFFORT.", "Date": "September 12, 2013"}, {"Title": "Nice camera!", "Author": "starman", "ReviewID": "R378KLPDXCA41O", "Overall": "5.0", "Content": "This was a great purchase for me.  The camera did everything I could ask for.  I don't consider myself very technologically savvy, and this camera is extremely easy to use.", "Date": "August 15, 2013"}, {"Title": "I enjoy it, really good", "Author": "sandra salas", "ReviewID": "R3R0COS17S2702", "Overall": "4.0", "Content": "This is an excellent camera for me and family,y just have a small complaint and is the battery lasts long, need one backup if you used it all day.", "Date": "July 6, 2013"}, {"Title": "its a very good camera", "Author": "Ben Jule", "ReviewID": "RPRJQKNSG2LZO", "Overall": "5.0", "Content": "i ordered for it and got it on time, it met my expectations, i have been using sony but just to try this, it is just as specified. i have not use it for long but for the time been it is okay. but no memory card in it. the batter is ok", "Date": "July 6, 2013"}, {"Title": "Nikon COOLPIX S6500 Wi-Fi Digital Camera", "Author": "Papoo", "ReviewID": "R12QD605BKQ5OB", "Overall": "5.0", "Content": "The camera performed as it should, we are still getting use to it, but the camera is working as it should.", "Date": "June 4, 2013"}, {"Title": "Producto defectuoso.- Defective Product. -", "Author": "Martin Pera Cecchi", "ReviewID": "R1UDMOJVQGND84", "Overall": "1.0", "Content": "Luego de 35 días de uso normal la cámara digital dejo de funcionarNunca se golpeo y solo se sacaron 200 fotos. El producto estaba fallado, ahora no puedo reclamar porque pasaron 30 días.-Muy triste, No recomiendo la compra de este producto.-After 35 days of normal use digital camera stopped workingNever hit and only took 200 photos. The product was failed, now I can not claim it's 30 days. -Very sad, I do not recommend the purchase of this product. -", "Date": "October 23, 2013"}, {"Title": "Nikon camera", "Author": "Cheyan A. Steele", "ReviewID": "R1ZG1F5JZTF280", "Overall": "5.0", "Content": "great unit for the money.  worked great as soon as it was charged.  happy, happy, happy.  Takes pictures like it should", "Date": "January 21, 2014"}, {"Title": "Great image quality, especially in low-lighting", "Author": "Joshua \"Josh\"", "ReviewID": "R3Q99JYMKNN81W", "Overall": "5.0", "Content": "I'll mention first that I was disappointed in the wi-fi feature. Being able to connect to the internet to upload photos to Flickr, Picasa, Facebook, or whatever was what I was expecting. The way it actually works was a little disappointing. Though the manual explains the feature pretty well:The camera’s built-in Wi-Fi (wireless LAN) function* allows you to remotely release the shutterof the camera by operating a smart device that is wirelessly connected to the camera.The camera’s monitor view is displayed on the screen of the wirelessly connected smartdevice, enabling you to remotely zoom the camera in or out on the subject. You can alsotransfer saved images from the camera to the smart device.* To use the Wi-Fi (wireless LAN) function, Wireless Mobile Utility must be installed on the smartdeviceLuckily I have a smartphone or it would have been even more disappointing. I was able to get it connected to my phone after a few tries. The app that I had to install on my android phone was pretty lack-luster and could definitely use some polishing, though it did the job.It potentially provides a way to send/share photos when out-and-about or on vacation which could be useful for some. It also lets you use your phone as a viewfinder for the camera and lets you remotely snap photos. This could be especially useful when using a tripod to eliminate camera movement. This is great for me since I bought the camera to photograph my artwork. In retrospect, the way the wi-fi feature actually works will probably prove more useful to me than my assumed social media connectivity.More importantly, I was very impressed with the image quality, especially when taking low-light photos. Taking a photo of a dimly lit room transforms it into a well lit room. The photos I took of darkly lit scenes actually looked better lit than they did when looking at the scene with a naked eye. I haven't messed with most of the other features of the phone yet. The retouch options seemed similar to something like Instagram filters which could be handy at some point. Of course, being able to connect your phone via wi-fi means that you could just use Instagram or any other photo editor on your phone.The only other negative I can think of is that it takes a few seconds to boot up from being powered off (there is a standby mode though), which could be an issue for people to snap photos spontaneously. Still, it's faster than opening the camera app on my phone. I bought the camera so I would stop using my phone as a camera (Optimus Elite) and to photograph artwork and other potentially low-light scenes. This camera fills that need perfectly and I would definitely recommend it for the price range.", "Date": "January 3, 2014"}, {"Title": "I like it !", "Author": "Janet Puig", "ReviewID": "R3C9BY98LPVE3X", "Overall": "5.0", "Content": "I really like it. It zooms, does continuous shooting, has a large view screen and it even lets me crop photos while still in the camera.", "Date": "November 29, 2013"}, {"Title": "Meh... Big disappointment.", "Author": "Josh", "ReviewID": "R1LRE4TS4JRN0Q", "Overall": "2.0", "Content": "Pictures are okay... I thought they'd be crisper and better in low light.I am EXTREMELY disappointed with the built-in wi-fi option. It's not quick, it's not easy, and really, why bother... Certain \"things\" need to be set in place for you to even be able to enable the wi-fi option. Super annoying when you don't have a manual handy. I hate how it shows you the option, but you can't change anything on it unless these \"conditions\" are met. Screw it. Cumbersome. Crap. I should've went with the Sony. They're always a lot easier to use right out of the box.", "Date": "November 24, 2013"}, {"Title": "Good little camera but beware if you purchase", "Author": "Robert A. Jung II \"retired banker\"", "ReviewID": "R28HOACRY5QPI1", "Overall": "3.0", "Content": "Good little camera if you want more than what the iphone camera can do but it has two major drawbacks.  The battery life is very short which has been indicated in other reviews and the wifi function needs better explanation on set up and must function better.  You have to set it up every time you want to use it and requires many button pushes.  Then it does not stay on and you have to redo it.....very irritating.  I couldn't get it to work again after an hour of trying to figure it out and then read in manual that when battery has 30% life left, the wifi function stops working!  Very disappointed in Nikon engineering as I purchased this little camera because of the name.  Speaking of little...this is a very little camera so if you have big fingers, you will not enjoy pushing very little buttons.", "Date": "November 6, 2013"}, {"Title": "Canera Delight!", "Author": "James E. Restivo", "ReviewID": "RU10AVQ02ISXM", "Overall": "5.0", "Content": "I bought this camera for my wife,because she complained my camera was to large for her to carry in her handbag and to cumbersome and hard for her to use. She is delighted with her small camera and she loves the clarity and brightness of the pictures color. She never leaves the house without it. I don't believe I could have made a better present selection if I would have tried. I also believe this camera is a delight.", "Date": "September 15, 2013"}, {"Title": "Fun camera for a college student", "Author": "deb t", "ReviewID": "R2IPBZZTPI7M2Z", "Overall": "5.0", "Content": "Easy to use and take good pictures in low light.  Be sure to buy the Kapaxen Two High Capacity (1000mAh) EN-EL19 Battery Packs & Charger so you will never be out of power.", "Date": "August 29, 2013"}, {"Title": "Great Product Great Seller", "Author": "Wayne Hall", "ReviewID": "RX6MCANVOJZ2J", "Overall": "5.0", "Content": "The camera does a great.  I am quite impressed with the wi fi capability to download pictures to my tablet wirelessly.Very good and the seller did an excellent job of shipping and getting it to me in recoed time.A+++++++++++++++++++++++++++++++++++goose20", "Date": "July 29, 2013"}, {"Title": "Mikon Coolpix S6500", "Author": "springgulch95", "ReviewID": "R29G1C68IYW2D5", "Overall": "5.0", "Content": "The camera has excellent resolution and has met all of our expectations. I would recommend it as an intermediate camera for travel, family gatherings, etc.", "Date": "July 1, 2013"}, {"Title": "Colors", "Author": "G Wing Racer", "ReviewID": "R3BDM7JOKPG68U", "Overall": "1.0", "Content": "I purchased this camera for to taking pictures using incandescent lights. This camera falls far short of showing the real colors. Everything has a reddish tint to it when using the incandescent setting.", "Date": "August 23, 2013"}, {"Title": "Cool, like in Coolpix", "Author": "Kelly", "ReviewID": "RMT46LMIPZLTE", "Overall": "5.0", "Content": "Beautifully crafted & simple to use. Everyone should have one, besides their cell phone cameras. It would have helped if Nikonhad crafted a nice case for it.", "Date": "May 14, 2013"}, {"Title": "Decent Camera For the Price", "Author": "Beatrice", "ReviewID": "R1DF868QC4HACM", "Overall": "4.0", "Content": "I bought this camera for a trip to Europe. What I was mainly looking for was a small size that was comfortable to carry around. I was also looking for decent zoom for when I took pictures of landmarks and vistas, especially when I wanted to get the details in the work. At the same time, I wanted something that could focus quickly, and overall had a quick learning curve. I have to say I was quite impressed with the camera. I was a little unsure at first but it really takes nice pictures especially for the price. Playing around with it for a few days really taught what certain buttons did, what settings applied depending on the lighting. I was really surprised by the retouching software that comes in the camera. Its kind of fun to play around with and if used lightly it can really have a nice realistic effect since it does things like reduce redness in skin, increase eye size, change face size, etc. One of things I did not like was the fact that the camera is charged by connecting a cable from an outlet directly to the camera. I would have preferred a wall charger for the camera so I could have a spare battery charging while using the camera for taking pictures. While the battery has decent battery life, when I was out sightseeing, I had to be conscious about not keeping the camera turned on so that I did not inadvertently drain the battery. But overall a very nice camera and really serves its purpose for taking great pictures.", "Date": "March 31, 2014"}, {"Title": "Nikon", "Author": "paulie gee \"paulie\"", "ReviewID": "R1BQLQL4KMR85Z", "Overall": "5.0", "Content": "great camera but I had to return it as I bought it for my daughter and her boyfriend already bought one for her.", "Date": "January 26, 2014"}, {"Title": "Great camera!", "Author": "M. Hooft", "ReviewID": "R16BCP79W896AI", "Overall": "5.0", "Content": "This was a great choice for a \"good\" camera without spending thousands of dollars!  The picture quality is exceptional and I'm able to blow up the pictures and not lose any of the clarity.", "Date": "January 18, 2014"}, {"Title": "Of course I love this thing", "Author": "Dan Girard", "ReviewID": "R27G5WR8ZRK7MG", "Overall": "5.0", "Content": "Takes great pictures. My girlfriend loves playing with it.  Zoom is awesome.  Lots of picture options to fiddle with.  Balls", "Date": "January 15, 2014"}, {"Title": "Great Camera", "Author": "Moe", "ReviewID": "RIW1YE3UJ7K5", "Overall": "5.0", "Content": "I had a Sony before this Nikon and went with it because others I know have taken great photos with it, not to mention the affordability and the quality of a Nikon.", "Date": "January 14, 2014"}, {"Title": "Nikoncoolpix S6500 Camera", "Author": "Elizabeth Hamel", "ReviewID": "R2WW1PH9TY2TMX", "Overall": "5.0", "Content": "I love it and finding it easy to use.  It fits so easily in my hands and can carry with me, love the orange.  gives a great picture and love that you can see before permanently saved.  .", "Date": "January 13, 2014"}, {"Title": "My favorite digital camera so far!", "Author": "Bargain Hound", "ReviewID": "R31WCGRDB4Z6L5", "Overall": "5.0", "Content": "I've owned lots of digital cameras. My last one was a Kodak, and I loved it so much, I didn't think another one would compare.  It finally broke on me, and I decided on this camera after shopping around for quite some time.  I couldn't be happier with my purchase!  This was my first Nikon digital camera and I'm very impressed.  The quality of pictures I get are amazing, it's very easy to use, download, etc.  I read some of the reviews where people said they couldn't get it to focus, but I had no problem with the focus.  It even has WIFI features, which I haven't even tried yet.  If this camera broke on me, I'd go out and buy the same one!  I love it.  And, it came in my favorite color :)", "Date": "January 12, 2014"}, {"Title": "Nice little camera", "Author": "Avid Reader Santa Fe", "ReviewID": "R3LP88QGZK2O95", "Overall": "4.0", "Content": "I like that it is tiny and easy to carry.  The photos are good.  It does not come with a photo disc so you will need to buy that separately.  Also, I'm still trying to figure out how to connect it to my wifi so I can download or print directly from the camera.  Very confusing directions.", "Date": "January 7, 2014"}, {"Title": "Great Camera", "Author": "Martin Sheffield", "ReviewID": "R1XKW20KK1DYRH", "Overall": "4.0", "Content": "Nice camera, takes sharp pictures and is fairly easy to use. My only complaint would be for Amazon to inform potential buyers that the package deal does not come with an SD Card and is only capable of taking 5 or 6 pictures without one. Had I known before hand, I would have added an SD Card with my purchase.", "Date": "December 28, 2013"}, {"Title": "HD video should have HD audio", "Author": "Ben \"Ben\"", "ReviewID": "R3768EZHAIJBP8", "Overall": "2.0", "Content": "mono microphone? with all these futuristic features Nikon should've known better.  now I have to bother selling this on ebay", "Date": "December 22, 2013"}, {"Title": "Nice compact camera.", "Author": "Phillip B McNeely", "ReviewID": "R1Y18ZIX0QNMK", "Overall": "4.0", "Content": "Great little compact camera that takes really nice pictures.  I'm no photography expert, but the picture it takes look really good to me. Sometimes it has a hard time figuring out what to focus on, so shots are delayed, which can be annoying. Also doesn't take great pictures at night, but I am pretty sure this is common in most cameras.", "Date": "December 15, 2013"}, {"Title": "Fun camera", "Author": "Allen F Lessenger", "ReviewID": "R3JV75KQCIHXCL", "Overall": "5.0", "Content": "It worked perfectly for my wants in a camera and has a 12X digital zoom which is fantastic in such a small camera.", "Date": "December 13, 2013"}, {"Title": "Way to go COOLPIX!", "Author": "Oct 30th \"robpeg\"", "ReviewID": "RKKPNPI6E8RVQ", "Overall": "5.0", "Content": "Loved this camera from right out of the box.  The pictures were excellent as well as the videos.  I purchased this camera to replace my S630.", "Date": "December 5, 2013"}, {"Title": "good value", "Author": "Grandpa", "ReviewID": "R3SOG9J026YASL", "Overall": "5.0", "Content": "Very good zoom, easy to use, fits in shirt pocket, nice features at a good price. takes very good pictures", "Date": "December 3, 2013"}, {"Title": "Great camera", "Author": "Bon", "ReviewID": "RT3325LAIYZQK", "Overall": "4.0", "Content": "Bought for vacation in Tenn. Mts. Took nice pictures has a lot of extra's to still figure out happy made a good pick Bob in Florida", "Date": "October 17, 2013"}, {"Title": "Great pictures and design", "Author": "Amanda J Herrlein", "ReviewID": "R3E79XO5VG8IEY", "Overall": "4.0", "Content": "Bought this camera because of the reviews and it doesn't disappoint.  The only thing that annoys me is that unlike every other digital camera I've owned, you can't retrieve the pictures from the memory card when you plug the phone into the computer, you must have a memory card reader - which I had to buy.  Other than that, love it!", "Date": "October 15, 2013"}, {"Title": "So far so good", "Author": "R. A. Nester \"Ranger Rick\"", "ReviewID": "R79G5KMSIAQPL", "Overall": "4.0", "Content": "I am still not convinced the rechargeable battery won't leave me with a dead camera, so I bought a spare... otherwise I am happy with the camera.", "Date": "October 9, 2013"}, {"Title": "Great pics, but....", "Author": "j miller", "ReviewID": "RB02F3C0J5OXH", "Overall": "4.0", "Content": "Great pictures.... almost as good as my DSLR (D80).  The LCD screen ishard to see in bright daylight.  Needs a viewfinder for those conditions,otherwise very good camera", "Date": "October 6, 2013"}, {"Title": "Nice clear photos", "Author": "KD-D", "ReviewID": "R1H42IEFSV14LY", "Overall": "5.0", "Content": "This little camera takes lovely, clear photos such as scenic or panoramic shots, and even macro shots.  It's user-friendly, and features wi-fi transfer of your photos.  The best part of this is it's 12X optical zoom.  You can zoom even farther with the digital zoom, though keep in mind that it won't be as clear as the optical zoom.  It's a perfect little camera for the price, and I personally love the red color.", "Date": "October 4, 2013"}, {"Title": "very nice", "Author": "Joseph A. Natale \"joe_natale\"", "ReviewID": "RK891D20873UZ", "Overall": "5.0", "Content": "Very impressed with the camera. It works great and the picture is very sharp. Highly recommended for a moderately priced camera.", "Date": "September 10, 2013"}, {"Title": "Great pics", "Author": "Jamie/Landry McKee", "ReviewID": "R18FWACLW6F2UW", "Overall": "5.0", "Content": "My wife loves this model. She uses it at work & orders her photos at the same time.Nice & compact too", "Date": "September 3, 2013"}, {"Title": "Great camera", "Author": "david", "ReviewID": "R2T7W7X99VQ3WP", "Overall": "5.0", "Content": "Takes very good pictures and video.I like 12x zoom.Wi-Fi works well.takes good pictures at night.battery life is not bad.", "Date": "September 2, 2013"}, {"Title": "Nikon", "Author": "Vicki C.", "ReviewID": "R2Z5UWHTG32QES", "Overall": "5.0", "Content": "Love the product and the price I found on amazon.  Still learning how to use all the wonderful featureson new camera.", "Date": "August 31, 2013"}, {"Title": "Coolpix s6500", "Author": "Nicki Drake58", "ReviewID": "R3ME0CF6KGOCVZ", "Overall": "5.0", "Content": "I love it so far, the other camera i ordered, i took it out of the box and tried it blurry pic's an felt lighter,This camera, is awesome!! I pulled it out of the box tried it and no blur!! also it has some fun settings on this camera.Wi-Fi & GPS.. i have not check yet!!  30 minute video time, the new 32gb Class 10 card in it..and bought extra batteries..This camera has some weight to it,.. i Have A Coolpix P500, I love it, now i have some of the same features. I would recommend this camera, oh did i say i am a Photographer of Local Bands & Events around town, and Logged over Thousands of picture with my p500, and hope many more, Same for this camera, i am doing a 3 day event & a major concert in the next week, Taking this one along to ck it out.. I will leave you know... Thanks Nikon!! Thanks Amazon for 2 day mail!!", "Date": "August 29, 2013"}, {"Title": "Coolpix S 6500", "Author": "Mary", "ReviewID": "RBFSIMAZ6Q5H2", "Overall": "5.0", "Content": "Planning a trip to Peru & wanted a great small camera. This one will fit in my back pack & it has already shown me that it takes great pictures,", "Date": "August 25, 2013"}, {"Title": "Great product", "Author": "PC George", "ReviewID": "RW2UOLJLZ5LKY", "Overall": "5.0", "Content": "Great all around features add to the simple operation of this camera.Ease of operation and navigating thru the menus.I would recommend this camera to anyone, even a novice.", "Date": "August 22, 2013"}, {"Title": "Great camera", "Author": "Patricia Hayden", "ReviewID": "R2K46BEHEZQDUA", "Overall": "5.0", "Content": "Takes wonderful pictures, even when zoomed way in.  Many settings to choose from, but the automatic setting takes wonderful pictures.", "Date": "November 7, 2013"}, {"Title": "Great camera, Great price", "Author": "Michael S. Huhn \"Mike\"", "ReviewID": "R9DD0IUIKPSYX", "Overall": "5.0", "Content": "Replacing a Canon that did great pictures be keeps thinking fresh batteries are dead.  This camera is even better on pictures.", "Date": "September 14, 2013"}, {"Title": "great camera", "Author": "Amazon Customer", "ReviewID": "RIC2FW6564RST", "Overall": "5.0", "Content": "My wife and I were looking for a small digital camera that takes great pictures and this camera met and exceeded our expectations.", "Date": "August 15, 2013"}, {"Title": "Simply, the BEST.", "Author": "Fede Torch", "ReviewID": "R1UC6HQN1V9C14", "Overall": "5.0", "Content": "It is simply and by far, the greatest pocket point and shoot camera there is in that price range. Absolutely worth it.", "Date": "August 12, 2013"}, {"Title": "takes good still shots", "Author": "K. Tully", "ReviewID": "R3VER3XYCNT4DW", "Overall": "4.0", "Content": "I've looked through the menu options & can't figure out how to get it to take better action pictures - they're all blurry.  Hopefully when I look through the manual I'll be able to find it.  good quality photos, if everyone is still, but got this to take pics of the baby, who's always moving.", "Date": "July 3, 2013"}, {"Title": "S6500, the good and not so good", "Author": "Texguy", "ReviewID": "R1RLJCERILADWF", "Overall": "4.0", "Content": "Bought this camera as an upgrade to my previous Nikon.  It is excellent!  The only disappointment is that the Wi-Fi only works with an Android phone.  My fault for missing that in the literature.  What we need, Nikon, is Wi-Fi that works with everything.  That would make this an awesome camera.", "Date": "June 8, 2013"}, {"Title": "I pressed the button, take the picture already!", "Author": "Thomas H. Thompson", "ReviewID": "R2Z5JYYGXBDS2C", "Overall": "2.0", "Content": "All I want is for the camera to take the picture when I press the button.  It seems every few pictures, the camera refuses to do exactly that.  I tried several different settings, scenes, etc.to no avail and ended up missing some primo shots.  The camera had trouble with indoor shots even when on indoor party mode.  It kept using a slow ISP speed which led to lots of blurring.  Battery life was also about half of what I'm used to getting with digital cameras and that was with the wifi off.  Also, the buttons on the camera weren't all that responsive.Only good thing I can say about camera was it took really good video.", "Date": "June 8, 2013"}, {"Title": "Stars", "Author": "Jimmy Spencer", "ReviewID": "RO71TWU2D8Q1K", "Overall": "5.0", "Content": "5 Stars should speak for themselves.  Lord! I didn't know this was going to turn into a freakin' essay Goodby", "Date": "May 1, 2014"}, {"Title": "Returned", "Author": "J. Breit", "ReviewID": "R2G5MVR2RW2L8Y", "Overall": "1.0", "Content": "I had to return it because it was defective.  It would not acknowledge my SD card.  The return process was quite easy however.", "Date": "January 18, 2014"}, {"Title": "Dont buy Nikon.", "Author": "TDaniel", "ReviewID": "R13KW2SO7BDLWT", "Overall": "1.0", "Content": "Not happy. The screen broke internally in 2 months. Nikon was going to charge me 100.00 to fix it. I PAID a lot to ship it. Dont buy it!!", "Date": "December 24, 2013"}, {"Title": "Takes pictures.", "Author": "J. Miller", "ReviewID": "R3NS4O5A7UVSSA", "Overall": "4.0", "Content": "It's fine. I'm having trouble with the WIFI up load to my computer, but I haven't tried very hard either. It meets my expectations overall.", "Date": "June 13, 2013"}, {"Title": "Never buy a Nikon again!", "Author": "Susan Smith", "ReviewID": "R2EIFPGAIN21VW", "Overall": "1.0", "Content": "I've owned 3 Nikon Coolpix cameras since February 2013.  The first one I dropped and broke.  The last 2 quit working for various reasons after only a few month.  Pure Junk!", "Date": "January 18, 2014"}, {"Title": "Looks good but....", "Author": "Crmbooks2 \"Helen\"", "ReviewID": "R1LTGJ92KIOO01", "Overall": "1.0", "Content": "Excited to receive my new camera. Wanted to use it over the holidays as relatives were here visiting. Followed all the instructions, plugged camera in to charge overnight to make sure battery fully charged....now when I went to turn on ....nothing happened. Apparently battery was dead or camera was defective..So I emailed seller who was willing to replace camera or refund my money. I mailed camera out 12-27-13 and just today 1-9-2014 he received the camera. I am currently waiting for my refund. Sadly I never got the chance to use my Nikon camera. I didn't want to wait any longer so went to Best Buy and bought a Sony DSC WX300 20x zoom and happy with this purchase", "Date": "January 9, 2014"}, {"Title": "nice camera", "Author": "Ignacio Montes", "ReviewID": "R9885ZDW2VW0Y", "Overall": "5.0", "Content": "nice camera of a top brand as nikon. First camera i build and i am fully happy with it. Nice photos", "Date": "August 23, 2013"}, {"Title": "Junk", "Author": "John T.", "ReviewID": "R32FQOY0JWEJWV", "Overall": "1.0", "Content": "Will not connect to wifi. First it says it's \"Negotiating.\" Then it says \"Could Not Connect.\" If it can't connect, it's junk.", "Date": "August 20, 2013"}, {"Title": "Love this Camera", "Author": "DAV \"Movie Enthusiast\"", "ReviewID": "RNNN4W1PGQKW3", "Overall": "1.0", "Content": "This camera is awesome, love the zoom and the clarity of the photos. Came well packaged, before time delivery and I am very satisfied. I would recommend this camera to anyone looking for a great deal in a quality camera. Well worth the money.", "Date": "May 2, 2014"}, {"Title": "My order was lost and I had to go else where to purchase.", "Author": "jluallen", "ReviewID": "RB0GJF44D1S1J", "Overall": "5.0", "Content": "My order was lost and I had to go else where to purchase.Very little support from Amazon on lost package. Was given only one alternative. Refund my money. Not at all satisfactory. I asked for alternate solutions to the problem, like amazon could re-ship. Was told that this was not an option.......This incident has pushed me to look to other providers.", "Date": "June 24, 2013"}], "ProductInfo": {"Price": "$169.95", "Features": "16.0 MP CMOS sensor\nBuilt-in Wi-Fi for photo sharing\n12x optical zoom with NIKKOR lens\nOptical VR image stabilization minimizes camera shake\nUp to 7 shots per second", "Name": "Nikon COOLPIX S6500 Wi-Fi Digital Camera with 12x Zoom (Black)", "ImgURL": "http://ecx.images-amazon.com/images/I/41CnICuUHwL._SX300_.jpg", "ProductID": "B00AY6Y2YK"}}