{"Reviews": [{"Title": "A really fine pro-like camera that does not make your older lenses obsolete! Truely excellent images!", "Author": "Ron John \"Road racer\"", "ReviewID": "RBW9JIVUHYBRB", "Overall": "5.0", "Content": "This camera is mostly for those photographers who wish to make high quality stills (as opposed th video) and have an awesome arsenal of operating modes and the availability of a vast selection of fine optics.Weak spots: Video imaging does not measure up to comparable Nikon and Canon models. It is very sensitive to the brand of SDHC memory cards chosen; class 10 Sony cards are not recognized. I have had good luck with Kingston cards and Pentax forum members suggest staying with Sandisk.All Pentax 35mm film camera lenses from screwmount Takumar with bayonet adapters to the present will work in at least one or more modes. Love the idea of non-obsolesence.Great handling and intuitive controls. An adapter is available for using four AA batteries in place of the rechargable lithium.The dirt and moisture sealing makes shooting in those tough situations really free of stress.A replacement model with a higher price has already been introduced with the capacity to wirelessly send images to another device ( I don't need that feature).I am very pleased with the performance. Working with RAW images mad eon this camers gives the serious shooter an qualitative advantage over images made with competing Brands.I can live with the fact that the body is polycaronate and not pro-level magnesium alloy.Get one of these while you still can!", "Date": "September 2, 2013"}, {"Title": "Almost everything I want", "Author": "Ant", "ReviewID": "RUJZDORYFO8QT", "Overall": "5.0", "Content": "This was an upgrade from the K100D.  I debated between this and the K5 or K5-ii, but price drove me to this one (and I used the savings for another lens and some filters).  I had a couple other Pentax lenses, so I wanted to stick with the brand, although Nikon/Canon had some tempting alternatives (again price to match my existing lens set with a new system drove me to stick with Pentax).  This was a nice upgrade, and now that the K50 and K500 are introduced, it looks like the price is going down on this, making it a real steal.  Dual wheels, weather sealing, and quick focusing are pros.  Cons are focus issues at low light and movies have significant rolling shutter when zoomed in (although this seems to be common for most DSLRs)  I also wish the grip was a little thicker and taller, but I have relatively large hands.", "Date": "June 19, 2013"}, {"Title": "Excellent, lightweight, functional, accurate camera!", "Author": "mrsstreet", "ReviewID": "R1226MCFU5O01V", "Overall": "5.0", "Content": "Being a Nikon shooter from forever, at first I found this camera an alien beast!Initially purchased simply for the water resistance and the modest price.  Littleby little I came to appreciate virtually every aspect--reasonable AF, good DR and IQ,creative menu system, and all the necessary outboard buttons and dials withoutclutter.  Lightweight, relatively small and nice in the hand!  Hey, I think I like this camera,and the results are punchy and sharp without blown highlights in most cases.  At thislevel and price, I would say Nikon has some catching up to do.  If the D5200 were cheaper,then Nikon would win a 15 round decision on the basis of sensor, AF and DR.  Clearlythe Pentax wins on the magnificent pentaprism finder, large and beautiful for this pricecamera, or any APS-C DSLR for that matter except the pro cameras.So far I'm not raving about Pentax modern lens lineup, but shouldn't speak from limited experience.As far as the camera it's fun, affordable, light, solid and great IMHO!  What's not to like!", "Date": "September 4, 2013"}, {"Title": "Compact is the best for me", "Author": "Charolette L Stoehr", "ReviewID": "R3QCB05GS4NSB2", "Overall": "5.0", "Content": "I read many reviews on all the top brands of DSLR's before purchasing the Pentax. I went with it for a few reasons; I wanted a smaller more compact body as I have small hands and this size is perfect for me. I wanted a WR body and lense so I could shoot outdoors with confidence. Most of my shooting is outdoors in all kinds of weather. I do wish I would have gone with a different lense however, as with what some people said, the 18-55 isn't enough for me. Now I will just purchase another lense, so an easy fix. I haven't had time to play around with the features much but am going on a trip to Mexico soon and will do just that! Navigating seems simple enough as I had family over and took a good family photo using the timer and my tripod. I am pleased with this purchase and the price was good.", "Date": "March 11, 2014"}, {"Title": "Great Camera Kit", "Author": "JayC", "ReviewID": "RIX7M7IW533BN", "Overall": "5.0", "Content": "This camera has a great quality of pictures, so vibrant color, easy to use, a lots of great functions than others. Don't buy and pay for the brand, buy real camera.", "Date": "August 18, 2013"}, {"Title": "I am so glad I found the Pentax.", "Author": "Sean Gately \"Book Review\"", "ReviewID": "R1NVKRH2OL7MG0", "Overall": "5.0", "Content": "For my anniversary I wanted to get my wife a DSLR camera. She has mostly used point and clicks and her phone, but, we had run into camera fatigue with an over abundance of less desirable photos, so we ended up deleting most of them or never even looking at them. It was time for an upgrade.I actually ordered the Nikon D3200 before this guy, and only noticed it with Amazon's \"suggested products\" and was glad I did. After intensive searching to make sure this camera wouldn't be to much for a new DSLR user I was convinced.First the Pro's.* It rates at a much higher level than it's price tag. So if your comparing price to price you may want to look up a few levels. For instance, when comparing this against the D3200 or D5200 it comes out ahead in most feature analysis and forum posts with educated camera aficionados.* It's fully sealed and can be used in the rain, outdoors, dust (I live in Arizona) and most other places. The weather sealing feels great to the touch and adds a layer of protection that makes you feel comfortable as a new user.* I like the weight and look of it. Some reviewers say its ugly, or it's to small but it fits perfect in my and my wifes hands.* It takes AMAZING photos. The color, clarity, and overall image quality surpasses anything we have used before. It's actually fun to take pictures again. We have only used auto settings until we feel comfortable enough going manual and really learning this camera.* You get amazing quality for the price. For instance 6FPS, Pentaprism Viewfinder, Twin Control Dials etc.* 6 shots a second! As fast as you can press the button you get photos. With little ones running around I was always \"missing the shot\", but with this, and until I get better, I can machine gun my photos and choose the best one.Cons* It's not Nikon or Cannon so the aftermarket parts are said to be limited. I haven't seen that, most of what I needed is out there on Amazon, including the Sigma 70-300 that I picked up for $140 that takes absolutely amazing photos.* Battery seems to go quick when LCD screen is on. I recommend buying another battery.* There is a lot to learn. A pro or con if your coming from a point and shoot or your phone. But the photo quality is worth it.Other more experienced folks will write more in depth reviews on actually taking pictures, but this review is for the people looking at Nikon and Cannon and upgrading to their first DSLR camera.Overall my impression is that this camera is well made, has to use better internals compared to Nikon and Cannon because of the name recognition, and is a fantastic find for anyone upgrading from Point and Shoot to a DSLR.", "Date": "October 29, 2013"}, {"Title": "Happy with it!", "Author": "Hari Dasi", "ReviewID": "R167TM9MEQ1J4F", "Overall": "5.0", "Content": "I'm very satisfied with this camera, absolutely fine for my intermediate photo student needs. I'm relatively new to digital photography and I'm finding it comparable the the older model rebel I used in the past. Very nice images, the smaller size fits my hand and it's light without feeling cheap, very happy with it!", "Date": "February 18, 2014"}, {"Title": "Nice camera, my first dSLR.", "Author": "IVAN POBLETE ALLENDES", "ReviewID": "R2JGURQRR5P25P", "Overall": "5.0", "Content": "I have had some compact and automatic cameras (those with big zoom) and have been reluctant to purchase a dSLR, mainly because it requires more dedication and the extra effort of carrying it along.Now, with my small children I have noticed the compact cameras give me a hard time when trying to take indoor pictures under low light.I just have to say I'm very happy with the camera, and I'm learning the basic concepts of photography in order to be able to take advantage of both the camera versatility and a \"new way to look through the viewfinder\".I got an extra zoom lens, camera bag, extra batteries and so on... so I wish it will payback soon!My purchase criteria was checking out some forums, and adjust my budget. The ideal one was the Pentax K-5 over the Nikon D7000, but I'm more than happy with this one.", "Date": "December 31, 2013"}, {"Title": "Excellent Buy", "Author": "J.R.", "ReviewID": "R1ADK8MDZ8KJ85", "Overall": "5.0", "Content": "Excellent camera. I wanted to use my old lenses with it.  They work great with it. Easy to operate, takes amazing pictures", "Date": "December 8, 2013"}, {"Title": "Awesome camera", "Author": "Chris", "ReviewID": "R28P020EY7PGR8", "Overall": "5.0", "Content": "I love this camera. Great purchase, awesome camera, no regrets.Price is appropriate for an entry level dslr, And it's a better camera than any Nikon or Canon in the same price range", "Date": "October 21, 2013"}, {"Title": "Small and Powerful Camera.", "Author": "Tee Cee", "ReviewID": "R3UDRHXATOXI3Q", "Overall": "5.0", "Content": "Great bang for your bucks.Water/Weather/Dust Resistant.16MP sensor.  To get anything else around this powerful and water resistant you would have to settle for a Canon 60D.  And you could buy two K30s with the price!Cons:  Motor/Shutter is loud.  But I mean it's a solid camera.", "Date": "October 8, 2013"}, {"Title": "Fantastic Camera for the price!!!", "Author": "Marcos Mattos", "ReviewID": "RYT44O7NUY0GT", "Overall": "5.0", "Content": "I will be very objective on my review:Weather sealed camera;Less than $600,00;Very good grip;Fast.Be careful to verify if the lens are weather resistant (WR) and with metal mount.K50 comes with a WR lens but with plastic mount and K30 normally comes with non WR lens with metal metal mount.", "Date": "October 24, 2013"}], "ProductInfo": {"Price": "$799.95", "Features": "Full weather sealing throughout the entire body and lens ensures worry-free use in any weather condition\nA high performance 16 megapixel APS-C CMOS image sensor strikes the perfect balance between resolution and image quality with ISO speeds up to 25600\nPRIME M image processing engine is optimized for HD video capture, smooth live view, low chromatic noise and low energy consumption\nLow profile glass pent prism viewfinder, with interchangeable focusing screens, achieves a 100% optical field of view for framing accuracy in a highly compact form factor\nSensor-shift Shake/Dust reduction ensures sharp, dust free imaging with any K mount lens", "Name": "Pentax K-30 lens kit blue w DA 18-55WR Weather-Sealed 16 MP CMOS Digital SLR with DA 18-55mm and 3-Inch LCD Screen", "ImgURL": "http://ecx.images-amazon.com/images/I/41dcI5bpIeL._SX300_.jpg", "ProductID": "B00A2AGJX0"}}