{"Reviews": [{"Title": "An exquisite hot cake to mirror-less market.(Update Jul-27-2013)", "Author": "Z. Wu", "ReviewID": "R1V5X47HSTYK5S", "Overall": "5.0", "Content": "<!--\n\nfunction fp_resizePlayerSpace(nsPrefix,w,h)\n{\t\n  try {\t\n    var ifrm = parent.document.getElementById(nsPrefix + \"movieFrameID\");\n    if (ifrm) {\t\n        var h2 = h + 35;\n        ifrm.style.height = h2;\n      }\n    } catch(err) {\n \n    } \n\n\n  if (h > 0) {\n      document.getElementById(nsPrefix + \"clipDiv\").style.height=h+\"px\";\n      document.getElementById(nsPrefix + \"videoPlaceholder\").style.height=h+\"px\";\n  }\n  else {\n      document.getElementById(nsPrefix + \"clipDiv\").style.height=\"\";\n      document.getElementById(nsPrefix + \"videoPlaceholder\").style.height=\"\";\n  }\n  document.getElementById(nsPrefix + \"flashcontent\").style.height=\"100%\";\n}\n\nfunction fp_rewriteDiv(nsPrefix,divName,html)\n{\t\n    document.getElementById(nsPrefix + divName).innerHTML=html;\n}\n\nfunction embeddingPopup(nsPrefix)\n{\n  alert(\"placeholder function for embedding code\");\n}\n-->\n\n\n<!--\n\nfunction cv_moGHI2BCRC9NEOembeddingPopup(){\t\nalert(\"Embedding code will be displayed here.\");\n}\n\n-->\n\n\n\n\n\n\n\n\n\n<!--\nfunction cv_moGHI2BCRC9NEOrefresh_preplay() {\n\ndocument.getElementById(\"cv_moGHI2BCRC9NEOchiDiv\").innerHTML = document.getElementById(\"cv_moGHI2BCRC9NEOhiddenPre\").innerHTML;\n};\ncv_moGHI2BCRC9NEOrefresh_preplay();\n\n-->\n\n\n\n\n\n\n        // <![CDATA[\n\nvar cv_moGHI2BCRC9NEOso;\t   \n\n\nfunction cv_moGHI2BCRC9NEOloadSwf_Core(swfLocation, swfWidth, swfHeight, flashVersion, bgColor, swfParams, flashParams, embedAttributes) {\n\n  try {\n      cv_moGHI2BCRC9NEOso = new SWFObject(swfLocation, \"cv_moGHI2BCRC9NEOAMPlayerProd\", swfWidth, swfHeight, flashVersion, bgColor);\t   \n\n      for (var v in swfParams) {\n        cv_moGHI2BCRC9NEOso.addVariable(v, encodeURIComponent(swfParams[v]));\n      }\n      for (var v in flashParams) {\n        cv_moGHI2BCRC9NEOso.addParam(v, flashParams[v]);\n      }\n      for (var v in embedAttributes) {\n        cv_moGHI2BCRC9NEOso.setAttribute(v, embedAttributes[v]);\n      }\n\n      cv_moGHI2BCRC9NEOso.addVariable(\"swfEmbedTime\", new Date().getTime());\n\n      var agt = navigator.userAgent;\n       \n      var reFirefox = new RegExp(\"firefox/\", \"i\");\n      var regx = agt.split(reFirefox);\n      var ffVersion = 8;\n      if (regx[1]) {\n          var pts = regx[1].split(/[.]/);\n          ffVersion = parseFloat(pts[0] + \".\" + pts[1]);\n      }\n      var minorVersion = parseFloat(navigator.ap);\n      if ((navigator.appVersion.indexOf(\"Mac\")!=-1) || (ffVersion < 1.5)) {\n          cv_moGHI2BCRC9NEOso.setAttribute(\"height\", swfHeight);\n          cv_moGHI2BCRC9NEOso.setAttribute(\"width\", swfWidth);\n          cv_moGHI2BCRC9NEOso.addVariable(\"oldFirefox\", \"1\");\t     \n      }\n\n      if (cv_moGHI2BCRC9NEOso.write(\"cv_moGHI2BCRC9NEOflashcontent\")) {\n          fp_resizePlayerSpace('cv_moGHI2BCRC9NEO', \n                               320, \n                               283);\n      }\n      else {\n          var nsPrefix = 'cv_moGHI2BCRC9NEO';\n\n          fp_resizePlayerSpace(nsPrefix, 0, 0);\n          fp_rewriteDiv(nsPrefix, \"flashcontent\", '<br/>To view this video download <a target=\"_blank\" href=\"http://www.macromedia.com/go/getflashplayer\" target=\"_top\">Flash Player</a> (version 9.0.115 or higher)');\n      }\n  } catch(err) {\n      fp_resizePlayerSpace('cv_moGHI2BCRC9NEO', 0, 0);\n  }\n  return false;\n}\n\n\n\nfunction _cv_moGHI2BCRC9NEOloadSwf(movieID, playerVersion) {\n    var swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/20120510035744301/AMPlayer._V148501545_.swf\";\n    var swfWidth = \"320\";\n    var swfHeight = \"100%\";\n    var flashVersion = \"9.0.115\";\n    var bgColor = \"#FFFFFF\";\n\n    var swfParams = {};\n    var flashParams = {};\n    var embedAttributes = {};\n    swfParams.amazonPort = \"80\";\n    swfParams.allowFullScreen = \"true\";\n    swfParams.telemetrySubPageType = \"VideoReview\";\n    swfParams.nsPrefix = \"cv_moGHI2BCRC9NEO\";\n    swfParams.locale = \"en_US\";\n    swfParams.logUrl = \"gp/mpd/l\";\n    swfParams.canResize = \"1\";\n    swfParams.autoPlay = \"1\";\n    swfParams.sessionId = \"000-0000000-0000000\";\n    swfParams.marketplaceID = \"ATVPDKIKX0DER\";\n    swfParams.salign = \"LT\";\n    swfParams.preset = \"detail\";\n    swfParams.mediaObjectId = \"mBE8M86W3TMFR\";\n    swfParams.autoPlayTimer = \"\";\n    swfParams.mediaObjectIDList = \"mBE8M86W3TMFR\";\n    swfParams.playIsUserGenerated = \"1\";\n    swfParams.enableShare = \"0\";\n    swfParams.permUrl = \"gp/mpd/permalink\";\n    swfParams.telemetryPageTypeID = \"R1V5X47HSTYK5S\";\n    swfParams.xmlUrl = \"http://www.amazon.com/gp/mpd/getplaylist-v2/mBE8M86W3TMFR/000-0000000-0000000\";\n    swfParams.amazonServer = \"www.amazon.com\";\n    swfParams.scale = \"noscale\";\n    flashParams.allowFullScreen = \"true\";\n    flashParams.salign = \"LT\";\n    flashParams.bgcolor = \"#FFFFFF\";\n    flashParams.allowScriptAccess = \"always\";\n    flashParams.quality = \"high\";\n    flashParams.wmode = \"transparent\";\n    embedAttributes.title = \"Flash Player\";\n\n    if (movieID){\n      if (playerVersion == '3'){\n        swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/20120510035744301/AMPlayer._V148501545_.swf\";\n        swfParams.mediaObjectIDList = movieID;\n      } else {\n        swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/legacy/20101014901/AMPlayerProd._V197491872_.swf\";\n      }\n      swfParams.xmlUrl = \"http://www.amazon.com/gp/mpd/getplaylist-v2/\" + movieID + \"/000-0000000-0000000\";\n      flashParams.wmode = \"transparent\";\n      swfParams.autoPlay = \"1\";\n    }\n\n    if (document.getElementById('cv_moGHI2BCRC9NEOduration')) {\n      document.getElementById('cv_moGHI2BCRC9NEOduration').style.display='none';\n    }\n    cv_moGHI2BCRC9NEOloadSwf_Core(swfLocation, swfWidth, swfHeight, flashVersion, bgColor, swfParams, flashParams, embedAttributes);\n\n  return false;\n}\n\nfunction cv_moGHI2BCRC9NEOloadSwf(movieID, playerVersion) {\n   return _cv_moGHI2BCRC9NEOloadSwf(movieID, playerVersion);\n}\n\n\n\t\n\t\t// ]]>\n\t\n\n<!--\n\nfunction cv_moGHI2BCRC9NEOnewHeight(h)\n{\t\n    fp_resizePlayerSpace('cv_moGHI2BCRC9NEO', 0, h);\n}\n\nfunction cv_moGHI2BCRC9NEOresetPlayer(w,h,bw,cc) {\n  cv_moGHI2BCRC9NEOnewHeight(h);\n\n  cv_moGHI2BCRC9NEOso.addVariable(\"resetBandwidth\", bw);\n  cv_moGHI2BCRC9NEOso.addVariable(\"cacheCode\", cc);\n  cv_moGHI2BCRC9NEOso.setAttribute(\"height\", h);\n  cv_moGHI2BCRC9NEOso.setAttribute(\"width\", w);\n  cv_moGHI2BCRC9NEOso.write(\"cv_moGHI2BCRC9NEOflashcontent\");\n}\n\n-->\n\n\n\n\n\n\n\n\nvar cv_moGHI2BCRC9NEORollOverImg = new Image();\ncv_moGHI2BCRC9NEORollOverImg.src = \"http://ecx.images-amazon.com/images/I/81y2fHbOgeS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play-active,BottomLeft,130,-12_CR0,0,0,0_.png\";\n\nvar cv_moGHI2BCRC9NEOpreplay = document.getElementById('cv_moGHI2BCRC9NEOpreplayImageId');\nif (cv_moGHI2BCRC9NEOpreplay) {\n  cv_moGHI2BCRC9NEOpreplay.onmouseover = function() {\n    cv_moGHI2BCRC9NEOpreplay.src = \"http://ecx.images-amazon.com/images/I/81y2fHbOgeS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play-active,BottomLeft,130,-12_CR0,0,0,0_.png\";\n  }\n  cv_moGHI2BCRC9NEOpreplay.onmouseout = function() {\n    cv_moGHI2BCRC9NEOpreplay.src = \"http://ecx.images-amazon.com/images/I/81y2fHbOgeS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play,BottomLeft,130,-12_CR0,0,0,0_.png\";\n  }\n  \n  \n  var node = cv_moGHI2BCRC9NEOpreplay.parentNode;\n\n  var cv_moGHI2BCRC9NEOcurrentClick = node.onclick;\n  node.onclick = function () {\n    var head = document.getElementsByTagName(\"head\");\n    if (head[0]) { \n      var logTag = document.createElement('script');\n      logTag.type = \"text/javascript\";\n      logTag.src = \"/gp/customer-media/du/log.html?ie=UTF8&p=CustomerImage&s=CustomerVideoPlay\";\n      head[0].appendChild(logTag);\n    }\n\n    if (cv_moGHI2BCRC9NEOcurrentClick) {\n      return cv_moGHI2BCRC9NEOcurrentClick();\n    }\n  }\n}\n\n\n\n\n Length:: 1:33 MinsThis review is for both new NEX adapters and exist NEX members wish to upgrade to 5R.I'm a active NEX users and very fond of NEX-7 for it's whole package. I bought this 5R as a backup camera to my NEX-7. So here is some conclusion of my 2 weeks extensive experience with NEX-5R, hope it can give you some ideas:The NEX-5R is the 3rd generation of Sony NEX camera line:2010-2011Entry: NEX-3Intermediate: NEX-5Enthusiastic: None2011-2012Entry: NEX-C3Intermediate: NEX-5nEnthusiastic: NEX-72012-2013Entry: NEX-F3Intermediate: NEX-5RSub-Enthusiastic: NEX-6Enthusiastic: NEX-72013-Entry: NEX-3NIntermediate: NEX-5R(update soon)Sub-Enthusiastic: NEX-6Enthusiastic: NEX-7(update soon)Thus, the NEX-5R is the successor of NEX-5n.If you have don't have a extensive knowledge about NEX-5n or NEX family, here are the highlights of my field experience:1. APS-C sensor size, 1.5x crop for lens DOF and focal calculation, very popular and balance sensor size, give you enough shallow depth of field but still keep lens in a affordable weight, seize and price.2. Sony CMOS Sensor, the most widely used and acclaimed sensor in recent days, even Nikon, Pentax, Olympus, Fujifilm put Sony senor into their highest level DSLR cameras. It gives you the lots of dynamic range, color depth and top notch low light ISO performance.The field benefit is I can live with jpegs directly come from the camera w/o tweak Raws and struggle for more detail and dynamic range.3. Compact size, well designed simplistic camera body is very easy to handle and grasp.4. Relatively long battery life compare to similar specs mirrorless cameras.5. 20ms shutter release latency and articulate LCD makes it perfect for street snap shot.6. Handheld twilight, Panorama photo, Auto HDR is best in its class, easy to use and boost creativity.7. High-definition (640x480) quality LCD with fast refresh rate and wide view angle, color reproduction is very good and accurate.8. Highest movie record profile: 1080 60P 28Mbps more than the requirement of Blu-ray and have extensive control over movie recording.9. High speed focus, comparable to DSLR in daylight but suffers at night. Face detection and scene recognition.10. For experienced users, NEX system have a 18mm flange-to-sensor distance, so basically you can adapt almost any camera lens in human history to the NEX and enjoy the old style creativity with high technology: Zoom-in focus and focus peaking.If you already own an NEX and want to know the difference about NEX-5n and NEX-5R, here are the upgraded areas:1. CDAF+PDAF hybrid auto-focus system, provides both CDAF's accuracy and PDAF's focus tracking capability.2. Focus speed improved, even with CDAF, the new focus algorithms in those 3rd generation NEX makes them hunts less and more intelligent.3. More consistent control style, fixed some button and make the Fn as standard button in all modes and apps. (detail list below)4. Add a new dial, provide more flexible control.5. Combined shutter release button with power switch similar to other Sony/Nikon/Pentax DSLR shutter release button.6. Articulate screen can provide 180 degree self-portrait and also gives you 45 degree downward view and still keeps the screen slim.(more photos please see my gallery uploaded to the production page)7. Wifi function can share photos to mobile device and PCs.8. App function provides more capability to this camera.(detail list below)9. New minor improvements added and bug fix: Electronic level gauge, Movie button can be turned off, AEL lock with shutter release, Bracketing range increased from previous +/-0.7 to +/-1,+/-2,+/-310. White balance is more accurate.11. In-body Macro-USB charging.The problem still exist:1. PDAF needs lens support, right now all Sony NEX lens support PDAF functions, some need a firmware update.2. App store is a great concept, but it also exposed the hardware limitation of NEX: app experience not comparable to modern mobile devices.3. NEX operation system have been improved, but still lack of pro menu functions and it's more family-oriented, such as separate of Movies and Photos libraries. and \"world record super long setup menu\".4. Still using the Smart terminal 2 proprietary hotshoe, limit the studio wireless flash and create useless proprietary waste.5. Wifi function is a little hard to setup and not easy to use for many causal no geek users.6. App store is just the 1st step for Sony, and what's the future of it is still unknown.So,if you wants more details:1.control style evolving:Historically, NEX-5 are criticized for it's awkward menu and lack of Quick-menu for quick adjustment. So Sony upgrade NEX-5n with a custom center button, which used to be modal change button, provide a custom menu of 5 functions, but leave with a mess and contradiction menu style: If you set the 5n's center button to Quick custom menu, you have to assign either right arrow or down arrow to modal change function in order to change modes(P A S M...), but if you jump into Panorama or Handheld twilight, the center button will recover to model function. thus you lose your Quick-menu function. It's so awkward and makes the your NEX is very different to your friends' NEX after the learning curve. So in 5R Sony made a great decision to it:Sony makes the center button fixed and cannot to assign any functions, which means in any NEX w/o dedicate modal in future, the center button is fixed to change the camera mode(P A S M...). And add a dedicate Fn button, to trigger the previous Quick-menu.I know it's a little frustration at first glance: 5R added a new Fn button, but fixed the customization of center button. But if you consider this in a more brighter way: it's good to have the modal button fixed and the new Fn button is easy to trigger with your index-finger, plus you won't lose your Quick menu in any situation even in app mode. it's not a loss. And a little comfort is this qucik-menu can assign 6 functions.Another control style change is fixed right arrow to ISO and down arrow to exposure compensation. This modification is also accompanied with the previous discussed: make the NEX camera more canonical, so everyone touches a new generation of NEX can play with it and enjoy the new feature without dig into menus system and assign your own style. I can understand their effort to make NEX family standalize but lose the customization of control style still makes me feel NEX become obsolete and inclined to traditional DSLRs (with tremendous dedicate buttons).2. PDAF do have some limitation:PDAF is mostly benefit in the AF-C mode (Please watch the movie within this review), AF-S didn't improve much compare to previous CDAF, still hunts for focus.PDAF can only be activated when aperture value is no greater than f/6.3 (e.g: f/1.4-f/6.3 works, f/7.1-f22 won't work)PDAF is only works with still image, not for movies.PDAF won't work when it's dark.PDAF won't work when AF illumination turned on.3.The NEX-5R have two kinds of wifi usage:a. link to a exist wifi hotpot, andsurf the web and download appsupload the photo to photo sharing site: play memory, facebook,flickr(possibly) you name it...b. create a direct hotspot by itself, andLet your cellphone/device to collect to this personal hotspot and wirelessly using live view/ shutterLet your cellphone/device to collect to this personal hotspot and the camera transfer its photos to your cellphone/device4. Welcome to  App world.I really welcome this, but my feeling is a little mixed: promote such a important function in camera is quite a innovation. but does the users ready to accept the concept that they have to pay for a function in future?When iPhone opened the world of mobile apps, it have a most important conviction: user-centered. Every app is around user: satisfy user needs. Does Sony fully understand this and through the app to improve their user experience? It's a little early to place any conclusion.But I expect Sony understand why Google play and iTunes are successful app stores because they satisfied user needs and improve customers experience.For example, at present, the NEX-5R app store have 4 apps: 3 free 1 for sell with $4.99.Those free apps:Remote control is just works, using your smartphone as live view and control the camera shutter.Direct upload needs some updates, it's only function is upload photos to facebook or play memory gallery, hope it can support flickr or picasa in future.Fliter+ is provide more filters, like the newest watercolor or blend two filters effects together, a welcome addition to NEX users.The only app with price is multi-frame noise reduction app. It works like Handheld twilight but with more controls over aperture, iso, shutter speed. Sony provide such function in their Alpha cameras, but not in NEXs, NEX only have \"lite version\" as the automatic Handheld twilight.I end up give MFNR a try, and here is the interesting part: You buy the app once and it can gives you 10 licenses to any camera associate with your Sony account.Because I cant upload full-size photos to give you the illusration, So I just give you the conclusion:In MFNR, the ISO 12800 is comparable to standard ISO 3200, ISO 6400 is comparable to standard ISO 1600, etc... and it's also makes the ISO 400 to ISO 800 noise free when 100% zoom-in, So I'd say it provide 2ev improvement over normal ISO shots.In some sense, it's still seems like a steal money from us. but like someone said before: you have the choice. However, please understand not everything from a camera manufacture \"should\" be free, Nikon charges it's Capture NX 2 for $130 and Camera Control Pro 2 for $180, can we say \"because you a my camera's manufacture, so everything software associate with your camera should be free?\" Software is a intellectual property, manufacture have the rights to sell it or bundle it in some camera. So it's a decision made by Sony, and it's your decision whether buy it or not.If this works like the way app store on mobile. For real example: I purchased goodreader when it came out on year 2009, it still on my newest mobilephone and upgrade twice a month from 2009 to 2012. it's quite a bargain when you consider this app cost $1 when it came out. So does this apply to many successful apps and great thanks to those hard working programmers. They treat old customers well, and we recommend those app to our friends. a win-win situation.If Sony treat apps like MFNR, time-lapse in this way: constant upgradeable and compatible on all future cameras. people like me are willing to pay for it.There also some bad examples: GPS device charges you fee for map upgrades(hopefully, they're dying because mobile devices.), antivirus software charges you year by year(they're dying too),Microsoft, Adobe charges quite a amount for upgrade version.", "Date": "October 21, 2012"}, {"Title": "Buy it.", "Author": "Thomas Krafft", "ReviewID": "R3LYUMK45FOEBX", "Overall": "5.0", "Content": "Just received my Sony NEX-5RK/S with the kit 18-55mm lens, along another lens I bought separately - the Sigma 30mm F2.8 EX DN- Sony E 330965, (http://www.amazon.com/gp/product/B0078ZYBP0/). I've only had a few hours to play around with it, but am already very impressed and happy.I am not a professional photographer, but have used a wide range of cameras from point-and-clicks, to the Canon EOS Rebel XT DSLR I've owned for more than six years. If you're a serious professional photographer, then I'm sure there are plenty of cameras better suited to your level of expertise. If you're like me, someone who just wants professional-LOOKING photos from my various outings, holidays and special occassions, then you will be very pleased with the Sony NEX-5RK.WHY I BOUGHT ITI bought the Sony because my old Canon was simply too bulky and not at all easy to use on vacation of family outings. I wanted something with more of the convenience of the pocket cameras, but with all the professional capabilities of the DSLRs. The Sony, even with the zoom kit lens, is small enough to fit in a jacket pocket or purse - or just use the included neck strap. The camera is so light, you won't even notice it. The shipping weight says 3 pounds, but that includes the charger and manuals. The camera alone - with lens - is probably closer to 2 pounds.ACCESSORY NOTESWhen I purchased this camera, there was a free accessory package offer I added to my order - which included a (1.) 16GB memory card, (2.) a camera bag (Case Logic DCB-304 High/Fixed Zoom Camera Case (Black) - http://www.amazon.com/gp/product/B0039BPG1A/ref=oh_details_o02_s01_i00) and (3.) a Pogoplug device. The camera bag is perfect, and also includes a strap. If you can't get it free, I'd still recommend adding it to your order. It's worth it. WARNING: The Pogoplug devices might seem like a good travel backup - but they don't travel, and they're not a backup device. In other words, useless. Don't buy it. You can read my review of that product there.AUTOMATIC AND MANUAL PHOTO MODESBack to the camera: Again I'm not a professional photographer, but am familiar enough with various light and focus options. This camera gives you the option to shoot in several automatic, and preset modes, or to go full manual if you want. Either option will meet your needs - but more importantly for novice photographers like me, Sony's automatic modes and presets are WONDERFUL. I was prepared to dig into the guts with all the custom manual settings, but after spending a couple hours with mostly automatic modes, I'm VERY impressed. It's been several years since I had a new camera, and the technology on the Sony is quite surprising and exceptional.For me, I set the camera to \"SLN\" mode, and from there you can use the selector wheel on top for two click access to all the presets, including Closeup, Portrait, Action, Landscape, Low light (tripod) or Low light (handheld), and several others. If, like me, you REALLY enjoy a narrow field of focus (where the subject or nearest thing is focused, but everything in the background is slightly or more blurry), you'll LOVE the Portrait and Closeup presets on this Sony. I've never had a small, almost-pocket camera that could do this before - and it's a real treat.Basically, don't let all the details about manual modes scare you. Or, if those things do scare you, don't worry: The automatic and preset modes on this camera will seriously exceed your expectations, giving you really professional looking photos, with just a spin of the selector wheel and clicking \"OK\".TAKING PICTURESThis camera does not have a view-finder like most DSLRs - but interestingly, I'm perfectly happy using the big LCD screen, like you find on most point-and-click cameras. You can buy the EVF (external viewfinder) accessory separately, but I don't think I'll need to. Besides, that same port can be used by the small flash - which is included with your box. Between a viewfinder or flash, you won't miss anything by not having the viewfinder.My favorite new thing, which I couldn't do before, is touching the LCD screen to focus on specifically the subject I want. The camera has several automatic modes (it can even be set to snap a photo as soon as it \"sees\" your subject smile!), but for normal photo shooting and all the fancy stuff turned off, it was extremely quick to focus once the shutter is held halfway down, and for all other shots - especially where I used a narrow field of focus - that touch-screen focus capability is really neat.There are several timer modes (10 second and 2 second), and the camera again surprised me with how smart it is. I turned the LCD screen around so I could see myself while taking a self-portrait. Without needing to click anything else, when I clicked the shutter, the camera automatically knew to give me 2 seconds (and showed me a timer indicator right there) before snapping the shot. Very smart.USING THE FLASH, LOW LIGHT PHOTOSBy the way, even without a flash attached, this camera does have a built-in orange/red light used to detect distance and focus. Even in lower light conditions, I found the camera was very good at getting the range, focusing, and then automatically adjusting light and exposure as needed to produce very good shots - without any flash attached. I've read the other reviews about pretty good night time/dark photos, but still haven't had a chance to see for myself. Personally though, for every few thousands pictures I take, maybe only one is outdoors at night, with no other lights around - so I'm not too concerned.VIDEOThere's a movie button on top of the body. Click it. Thats it!Once you set the movie quality in the Settings menu, you never have to worry about it again. I held the camera, clicked the movie button and walked around for a few minutes, putting various subjects into view. Again, for you novice photographers out there - or even the professionals who don't want to bother with all the manul settings, taking videos on this camera is a real pleasure. I've had numerous camcorders before of varying quality, but it's been several years since the last. The Sony gives me better video than anything I've ever used before - definitely professional quality. And my favorite part, again, was the ability to just click the button and walk around - the camera automatically moved things in and out of focus as I aimed the camera at them, or moved away. And in those cases where I wanted to override the automatica stuff, and focus say on an object off to one side of the frame, all it took was a touch of the LCD screen while recording, and the Sony would move the focus to that object in less than 2 seconds. Brilliant!APPS, SOFTWARE, WIFI, AND SMARTPHONE CAPABILITIESWow. Just wow. The Sony 5R has wi-fi and app capability - which means it can connect to any local wireless network AND it also acts as a wireless connection for your smartphone. This is big. I can already tell this will make a HUGE difference in how I use cameras, store and share photos and videos. The process goes like this:(1.) You create an account on Sony's PlayMemories website. Remember this login.(2.) When you're within range of any wireless network, you go into the Applications menu of the camera and connect to your network.(3.) Now, the camera itself can act like a wireless computer, and can download apps, filter effects and connect with your PlayMemories account. Download and install the Sony apps for your camera shown in the camera's Applications area.(4.) Make your smartphone even smarter. If you have an Android or iPhone smartphone, search the app store for PlayMemories and download both apps. One is so your phone can mange your local photos and upload to the PlayMemories site or Facebook to share photos. The second app is the REALLY neat one. It makes your smartphone into a remote control and storage device for your camera. Once you've installed the PlayMemories Mobile app on your smartphone, and the Smartphone Remote app on your camera (which you do in the previous step), you connect your smartphone directly to your camera, via the Wireless Network Settings on your smartphone. The camera itself gives off a wifi ID and gives you a password, so you can connect to it with your smartphone, like you woudl connect to any other wireless network. Neat.(4.A.) The best thing about this Remote is that I can be holding the camera or place it anywhere within range - and whatever is visible through the camera's lens will appear on my smartphone. In other words, not only can you finally be in your own pictures - and NOT have to run real fast once you click the timer button - but you can be part of almost any picture you can imagine. Just set the camera, and use your smartphone to click the shutter and often as you want. Brilliant. I can finally get good photos of me sitting with my wife in the park, or of me and the kids *while* we're playing together. Every time you want to connect the remote, you just connect your smartphone to your camera's wireless transmitter, and open the app.OVERALLIt's amazing what you can do with this camera - the quality and range of both automatic and manual modes, having both high quality photo and video capability, its compact size and light weight, with options to change lenses, plug-in other accessories too, aloing with the Wi-Fi, smartphone app and remote operation capabilities. There simply are no \"CONS\" for me. Thumbs-up, 5 stars.", "Date": "December 18, 2012"}, {"Title": "Mixed feelings about NEX-5R", "Author": "S. Vogt", "ReviewID": "RIC01WL10192A", "Overall": "3.0", "Content": "I took the NEX-5R hiking with me yesterday and thought the shooting experience was a mixed bag. Here are my pros and cons:PROs:-Excellent image quality. Color, detail, and ISO performance are all first rate for an APS-C camera. Noise becomes noticeable at ISO3200 but even at that sensitivity, the noise is of the fine grain variety so it still looks halfway decent. Color performance does degrade a little as you get to ISO1600 and beyond but this is pretty typical for this class of camera.-Exposure is generally on the mark if skewing a little towards underexposure. Which I prefer to overexposure.-Dual dials for adjusting both aperture and exposure.-Autofocus performance is generally pretty good.-Shot to shot times are good.-Camera feels solid and well-made.CONS:-The LCD sucks on this camera. It's extremely reflective in sunlight even with the settings adjusted accordingly. This is a big problem because, unless you buy the add-on viewfinder, it's all you have to compose a shot. By the time you got the add-on viewfinder, you could've paid the same amount for the NEX-6 which features one built-in.-The touch screen is of the resistive type rather than capacitive. It's good in a way because it prevents you from accidentally firing off a shot but at the same time, it just isn't as responsive as a capacitive touch screen.-Like other Sonys, I find the menu system needlessly complicated and feel it should be streamlined for access to commonly used shooting settings.Judged by its images (especially if you put a decent lens on it), the NEX-5R is an excellent imaging machine right up there with the best of the APS-C cameras. Whomever says that Sony can't compete with Canon and Nikon on image quality hasn't used any of their cameras as of late. However, the usability factor in the NEX-5R still lags behind the other cameras which takes some of the enjoyment away from the overall shooting experience. Unless you absolutely need the touch screen, I suggest spending the extra money on the NEX-6. It has the same excellent imaging performance but is more comfortable to shoot with, has that great built-in OLED EVF, a physical dial for changing shooting modes, and a built-in flash.", "Date": "May 12, 2013"}, {"Title": "So much camera in such a small package", "Author": "Katya", "ReviewID": "R1ERWVKRBU90T6", "Overall": "5.0", "Content": "After 6 months of research, I bought this camera and the 50mm/1.8 lens.I wanted the camera for 3 primary purposes:- family portraits and candids- outdoor photography on hiking trips (so small size was important)- gymnastics photos and video (very low light, very high speed)I knew that this wasn't the ideal camera for the gymnastics photos... but there wasn't really anything better in the sub $1k for body+lens market and I couldn't stretch my budget any higher in the next 12 months.It takes outstanding portraits both indoors and out-of-doors. In A (Aperture priority mode) I get beautifully in-focus faces and soft backgrounds.I haven't had a chance to test outdoor shots yet.The pleasant surprise was the gymnastics photos. I got some great stills on two high-speed events (floor and rings). Most of my son's body, including his face, is in focus and the motion is frozen. I've added the two images to the camera's photo gallery. It's not professional quality, but I am very pleased with the results.", "Date": "November 30, 2012"}, {"Title": "Nex-5R: Like Turning the Nex-5N into a Souped Up Hot Rod and Yet...", "Author": "cameracraver", "ReviewID": "R32RGES29U4QG0", "Overall": "4.0", "Content": "NEW FULL FRAME TO NEX LENS ADAPTER AND LENS SPEED BOOSTER ADAPTER AS WELL AS OTHER ADD ONS and also NEW APPS AVAILABLEI have heard that a 3rd party manufacturer has announced something called a LENS SPEED BOOSTER for the NEX series that will enable the attachment of a \"full frame lens\" to the NEX mount including of course the NEX5R.  According to one review \" When you attach a full-frame lens to the adapter, it will give your mirrorless' APS-C or MFT sensor nearly full-frame coverage out of that lens, while increasing the amount of light hitting the sensor by one stop. So a 50mm f/1.4 effectively becomes a 35mm f/1.0\". The NEX5R has what is called an APS-C size sensor. The so called full frame sensor is a larger sensor size found on more expensive cameras and is supposed to be the same size as the old 35mm film. This is another example of 3rd party add on s including the various adapters that allow the attachment of a variety of lenses. You'll have to search on the Internet for details of the new lens booster.NEW APPS FOR NEX5R and NEX6 ARE HERE (Update)Much more than just loading photos onto a computer by WiFi, one of the key capabilities of the NEX5R is the ability to modify the camera and make it more powerful by uploading new apps to it. It's sort of like buying a camera that can grow more powerful over time. It depends on your imagination as well as Sony's. Two new apps have been added to the app store. As I mention below, these apps join others including the remote control app which I think is wonderful. THE REMOTE CONTROL APP WORKS WITH TABLETS TOO,you can SEE THE IMAGE ON A SCREEN MUCH LARGER THAN THE LCD OF THE CAMERA. Remember the NEX 5R GENERATES IT's OWN WI-FI SIGNAL. You DON'T NEED TO BE IN A WIFI HOTSPOT.1. Timelapse , which as the name implies automates time lapse photography2. Cine photo , which creates a sort of photo-video mashup where part of the \"photo\" is a movie.You can see samples at the app store.The 180 DEGREE TILTABLE ARTICULATING SCREENThe ability to see yourself (something the Nex5n and the Nex6 can't do) as well as yourself and others or yourself and the surroundings is incredibly handy. It enables many shots at interesting angles you just wouldn't get and the ability to frame the picture or video leads to more great shots and fewer duds. I can't over emphasize this. Until you try this yourself it isn't obvious what a potential boon this could be. You'll scratch your head wondering why so few other cameras (exceptions, albeit more of point and shoot type, include the Samsung MV800 and MV900, BenQ G1 and the Casio ZR1000)5R EASIER TO ADJUST THAN THE 5N, GREAT FOR MANUAL CONTROL and WHY USE MANUAL ANYWAY?The EXTRA CONTROL WHEEL allows for better manual control vs playing with with the menu screen on the 5N. By rotating the control wheel on top and the wheel on the back you can get full control of aperture and shutter speed in manual. Using that together with the histogram and you can adjust for exquisite pictures. Why use manual control? Because sometimes the semi automated settings just don't get you what you want.INDOOR PICTURESThis camera can TAKE GREAT PICTURES  in less light THAN OTHER CAMERAS using higher ISO with less image noise. Automatic white balance (color adjustment) to get accurate colors in the picture works better outdoors than in. I often need to use Custom White Balance indoors to get accurate colors. It's easy,set it to custom and just aim the lens at something in the room that is white and click the shutter.See below for UPDATE ON USEFULNESS AND FUN OF THE REMOTE CONTROL APP FOR CELL PHONES AND TABLETS. This remote control app facilitates self portraits and group or scenery shots with yourself in the picture,something which turns out to be very handy creating a lot more opportunities for photos as does the 180 degree and also fractions thereof, tiltable screen. (once you have worked with an articulating screen such as this one that allows views from all sorts of angles you will scratch your head wondering why all cameras don't have one)POWERFUL IMAGE SENSOR The 16 megapixel sensor on the 5R seems to have hit a sweet spot for light sensitivity. The megapixel count along with the large size of the sensor helps get better pictures versus a point and shoot. It is also easier to get shallow depth of field which lets you focus on the subject and blur the background. Some reviews argue that the 16 megapixel sensor as on the 5R actually produces better looking pictures at higher ISO than the 24 megapixel sensor on the NEX 7 because the 24 megapixel sensor has more pixels squeezed in and therefore smaller pixel size. Smaller size pixels usually produce more noise than larger size pixels.When you increase ISO, you are increasing sensitivity to light but you also get more noise, it's like turning up the volume on an AM radio with a weak station, it gets louder but maybe also more static.So when higher ISO,(sensitivity to light) is employed to get pictures in darker conditions, they say that the 16 megapixel sensor actually produces superior pictures with less image noise than the 24 megapixel sensor!MORE NEW FEATURES OF THE NEX5RBut a new day has dawned and now I am the proud owner of the Nex-5R. It's like they sent the Nex-5N to a hot rod shop and they ripped out the engine and dashboard and replaced it with a souped up turbocharged 16 cylinder engine with a voice controlled light activated dashboard. This baby has an OPTIONAL TOUCH SHUTTER on the 180 degree flexible screen, you just touch the screen ,not only does it lock focus, it takes the shot! And that SOUPED UP HYBRID focus using a contrast /phase detection combo means speedier focus with pictures when the subject is moving.Having phase detection cuts down on the hunting that contrast detection does.CONTROL OF ISO ISO for VIDEO and PICTURES: The ISO for video (sensitivity in darkness) is ADJUSTABLE THROUGH 6400 vs 3200 on the 5N. The ISO for pictures is ADJUSTABLE to 25,600. The availability of the Multi Frame Noise Reduction APP will help with the problem of image noise in darker conditions. This is a built in feature on the SLT cameras.COMPARING FEATURES OF NEX 5R ,5N, NEX6 The NEX 5R offers SUPERIOR AUTO (does more) and INTELLIGENT AUTO vs the NEX 5N which offers only INTELLIGENT AUTO.The TILT screen on the NEX 5R tilts upward 180 degrees to allow self portraits and portraits with yourself and others or scenery, the tilt screen on the NEX 6 does not go to 180. The NEX 5R DOES HAVE a TOUCH SCREEN and an OPTIONAL TOUCH SHUTTER (see below) vs The NEX 5N that has a TOUCH SCREEN ONLY. The NEX 6 DOES NOT HAVE A TOUCH SCREEN.By the way, Sony offers a free software update for some older NEX lenses so they  can use the ultra fast hybrid focus of the 5R.OVERHEATING WITH VIDEO RECORDING May or may not occur and depends on the environment. I can feel the camera heating up as it is recording. I RAN ONE TEST in a 70 degree room and got a warning indicator at around 18 minutes.I did not wait to see when the camera would shut down. Many if not most dslr cameras especially from other manufacturers, C or N ? have limited short shooting times.MORE ABOUT DOWNLOADABLE APPS  The REMOTE CONTROL CAMERA APP is turning out to be more USEFUL than I thought it would be. It allows you to SEE a (nice reproduction) image on your cell phone of what the camera is seeing AND trigger the shutter to capture the picture.. ALSO it has the option of introducing a 2 second TIME DELAY IF you wish. (Remote control does not seem to work in video, I think it ought to!).. This app concept is a great idea. It's sort of like buying a camera that can get more powerful with time. They NEED A LOT MORE APPS. But they are on the right track. The App is USEFUL and FUN. Remember the NEX 5R GENERATES IT's OWN WI-FI SIGNAL. You DON'T NEED TO BE IN A WIFI HOTSPOT. Making a change on the camera is reflected on the tablet image, eg. changing the aperture. Images can be saved to a folder on the tablet in the Gallery. The APP worked on a Google Nexus 7 but not a Samsung Galaxy Tab 2. I see from comments on the play store that many Galaxy Tab owners have experienced this and are looking for an update.SO NEAR YET Sony cameras push the technology. Yet,they always seem to leave something out or take something away. Case in point, I bought the SLT-A33. Great for video except the built in mic picks up the noise of the lens motor so I plugged in an external remote lavalier mic..Voila, no camera noise! but the camera shuts down on me when the sensor overheats. OK, so then I bought the Nex-5n.  It takes great video and photos but there is no place to plug in an external mic and Sony sells one, count em, one external mic that fits on the \"smart\" accessory terminal (And still picks up local camera noise such as when you touch, tap or jostle the camera or rotate the lens barrel). The NEX 5R AND the NEX 6 do NOT have an external mic input (the NEX 6 does have a non proprietary hot shoe, though) but the NEX 7 DOES have an external mic input.", "Date": "October 25, 2012"}, {"Title": "Great camera with terrific new technology", "Author": "Mike Hendren", "ReviewID": "R2234KGQUC15OI", "Overall": "5.0", "Content": "I've had the NEX-5R for 4 days and it is truly a terrific camera. The 16 Megapixel sensor produces excellent images, handles noise well at the higher ISO's, and gives us phase-detection autofocus which has been faster and more reliable than any other NEX I've owned (5N, F3, and 7).The Wifi capability has worked well and the new ability to download apps from Sony's PlayMemories App store is awesome. I've downloaded them both by connecting the camera to my computer with a USB cable and wirelessly to the camera over my local network. These apps offer some possibilities that are rare in any camera: like the Bracket Pro app that allows you to bracket shutter speed, aperture, focus, and flash. The difference is this bracketing does NOT bracket the exposure, so you get photos that are all normally exposed but with different depth of field, focus points, etc. This opens up some very nice new possibilities.The camera is very light and small and I highly recommend it!", "Date": "October 23, 2012"}, {"Title": "Truly enjoy so far", "Author": "Anna Braun", "ReviewID": "R1EYJT2KV0ZEQ6", "Overall": "4.0", "Content": "Just traded in my D3000 for the Nex 5R.  I've loved my Nikon (and the D50 before it) for years, but was growing a bit weary of chasing the family with the heavy camera and lens.  I started reading reading reviews for these mirrorless slrs and decided to give it a try.  Just got it last week and took it to Disney World for the weekend.  I really enjoyed the light weight.  It focuses very fast (almost as fast as the Nikon). It is loaded with all kinds of features, of which I haven't even attempted to try out, but the auto feature is foolproof, and does neat things like determining when backlighting is needed, and facial recognition is a great feature...it saves 2 images, 1 of the photo you frame, and one of the face it recognizes.  Flash works really well for such a small unit.", "Date": "October 29, 2012"}, {"Title": "Review of WiFi aspect of the camera", "Author": "araknid_x \"araknid_x\"", "ReviewID": "RQPY0ZPN10U7X", "Overall": "2.0", "Content": "Please note that this review pertains only to the WiFi capabilities of the camera. Read one of the many other reviews for other features.I have to say I was not very impressed with Sony's implementation of WiFi functionality, here's all that you can do with the WiFi on the camera.1. Remote control to snap pictures using a free mobile app. You will have to first launch the corresponding app on the camera, the app effectively gives you a live viewfinder on the mobile phone app. You can then trigger the shutter from the mobile app. The live view works in both portrait and landscape modes on the phone. After the shot is taken you get to see the preview on the phone. There's absolutely no other control other than to trigger the shutter.2. Transfer pictures from camera to phone. Your options here are to send one image, all images in one date (based on image currently being viewed) and all images on the camera. Once an option is selected, the camera starts a wifi hotspot and shows the ssid & password. From the mobile phone you launch the Sony app and from there you can view thumbnails of the selected images from the camera, you can then select all or some of these and transfer the full size images to the phone.3. You can upload to Sony's Play Memories site or to Facebook. I only tried uploading to Sony's site and it has limited sharing capabilities but I'm not really interested in storing my images in yet another place on the cloud.4. DLNA push images to DLNA compatible TVs (including Hisense Pulse Google TV via it's built in Twonky DLNA app). This works pretty well for pushing one image at a time or for a slide show.Shortcomings:1. I don't understand why #1 & #2 need a camera hotspot, it should just use the currently signed on WiFi network if the camera is already on it. Obviously when connected to the camera hotspot your phone is effectively disconnected from the internet.2. Remote trigger could easily be augmented with additional options to control more features on the camera.3. It would have been so much better if they had provided a simple FTP option to upload to a server. If that's too complicated they could run a simple HTTP service on the camera to view and download images from a browser on any platform. As of now you need to run an App on an ios or Android phone to get the image off the camera.4. Currently the only way you can transfer pictures to a computer is by moving the SD card or by using a USB cable, this is so backward given the WiFi capability that's on the camera. Update 2/13: If you use Sony's custom software that comes bundled with the camera you are able to wirelessly transfer images after a one time setup via USB. The PC app has to be first started up and then you initiate the transfer from the camera. Also, this only works for Windows and MAC and there's no support for Linux/Ubuntu.5. A quick email option from the camera would be nice (of course sized appropriately).6. Finally, the image transfer from camera to phone works about 1 in 4 times, the rest of the time I get a \"processing\" or \"transferring\" or some other message and it spins forever. This is on a Samsung Galaxy S3 with stock ICS firmware.-> One more thing..., I'm not returning the camera due to its limited wifi capabilities, it is still a great camera I'm just disappointed at what Sony decided to put out there. This review should not affect anyone's purchase decision but should help them be informed before making the purchase.", "Date": "January 6, 2013"}, {"Title": "Wi-Fi feature is definitely worth it", "Author": "Craig Van Blaricum", "ReviewID": "R1IMTJMGPZ78O3", "Overall": "4.0", "Content": "Overall, the camera is great so far.  It's basically DSLR quality, but I find that it's not as quick as the mid-range DSLR I own... the Canon T4i.  But you get comparable quality in a much smaller package.What I've read in many reviews is people say that the WiFi features are not worth considering if you're also looking at non-WiFi cameras such as the NEX-5N or NEX-3N.  I completely disagree.  I think the WiFi features are a big deal if you're the type that likes to share photos immediately.  I'm speaking specifically about the ability to upload photos to your phone, which is all I really use.I have an iPhone 5, and while the upload process and iPhone app might be clunky, they work.  I've used another product, the Maxell AirStash, and it's pretty much the same process.  Here are my suggestions for getting it to connect quickly to the iPhone:Wait for the camera to display the network information before trying to connect your iPhone.  Then go into WiFi settings on the iPhone and make sure the iPhone is connected to the camera before opening the app.  If you do this, the app finds the camera right away.  I've had no issues connecting when following these steps.I also want to clear one misconception about the iPhone and Android apps... you can download full resolution JPEGs from the camera.  For the iPhone, you have to go into \"Settings\" (on the home screen), then scroll down to the list of apps and select \"PlayMemories Mobile\" and then press \"Image Quality\" and select \"Original\".  I compared a file imported via the app and imported to my computer right from the memory card, and there is no difference... same file size, same exact file.", "Date": "June 1, 2013"}, {"Title": "Meaningful upgrade from previous version", "Author": "Y. Wang", "ReviewID": "R2N0DUT2S6M1JV", "Overall": "4.0", "Content": "I used to have the NEX-5N. I upgraded to the new NEX-5R mainly because of the extra dial and Fn buttons, faster auto focus, and 180 degree flip screen. I'm very happy with my upgrade.Pros:*In my opinion, the biggest new feature is the Fn button and dial. This lets you use the camera on full manual. You can change EV, ISO, shutter speed, and fstop all in one menu. I loved the NEX-5N but digging through the menus for all the features was honestly a pain and time consuming. This has a APSC sensor that rivals the quality of most other SLR cameras in a smaller form factor so why limit it with poor manual controls? Prior to getting this, I used to shoot on aperture priority mode because manual mode was too annoying and you miss the goof shots because you were fumbling with the menus. Since getting the NEX-5R, I'm using manual all the time and never used any other modes!*The 180 degree screen. I originally thought this was a gimmick but now I'm completely sold. It may sound dumb but this lets you take self portraits and set up timed shots  with ease. When you flip the screen up the camera automatically uses a 3 second countdown. No setting any options! Flip, press the shutter, and run back to your friends and wait for the snap! No more embarrasing self photos in front of the bathroom mirror with camera in hand! Eat it Myspace!*The wireless smart phone compatibility is great. This \"app\" lets you connect your smart phone for remote capturing. Good for self portraits when you don't have a friend to snap for you.Cons:*I've noticed that the build materials have changed. My old NEX-5N had a magnesium metallic body that was good and sturdy and felt cold to the touch. I've noticed the NEX-5R seems more plasticy and the body was warm and the sound was different when you tapped on it. I suspect it's changed to a cheaper thinner metal or some sort of plastic.The body overall feels lighter.*The apps are mostly useless. Granted the smartphone remote capture was nice but it's not done seamlessly. Navigating to the option takes a lot of time to enable the wifi and then sync your phone to it. The other apps are mostly a gimmick. Color correction is useless. Anyone who buys this camera probably knows about RAW and photoshop or some sort of post photo editing. I don't know why anyone would use a really simple and novice color correction software on the camera.*Loss of battery charger. You lose the battery charger with this camera. The NEX-5N came with a battery charger that lets you charge the battery independently of the camera. I had a spare battery that I would swap in and out but now you have to charge by inserting the battery into the camera and then connecting the camera via USB cable to in the wall socket. This is dumb if you own a multiple batteries which I do.*New Hybrid auto focus isn't that great. I've tested both cameras with v1 and v2 for the new Hybrid auto focus. The differences are slight but not game changing on on the 18-55 kit lens. You notice it but overall focus is stillllll verrry slow. The 50mm f18 prime lens which I use often doesn't even have new software updates to take advantage of this new feature.Over I think Sony cheaped out on this camera to fit the price envelope. The price has increased to $750 from $700 and you lose the battery charger (which is like $40 independently) and some build quality. I generally expect when products get refreshed you get MORE functions, BETTER quality, and LOWER price. This is not the case. You do get more features but unfortunately, price, build quality, and included accessories were all sacrificed.", "Date": "January 14, 2013"}, {"Title": "Excellent camera", "Author": "Jaime Passy \"Marisol Passy\"", "ReviewID": "R36CH0S73E4U50", "Overall": "5.0", "Content": "I have been using my NEX-5r for about a week now. I am an amateur photographer and have had Canon and Nikon entry level and middle DSLR's.The bottom line is that if you have the money to buy a $3,000 dollar DSLR, then do it. Otherwise, any camera below that is going to be pretty similar in photo quality. I can say with confidence that this little camera shoots like a $2,000 dollar DSLR. And probably with a high quality lense will shoot pictures that look like a $3,000 DSLR.It came down to three options for a go-to everyday camera. The A66, the NEX-7, and the NEX-5r. Picture quality is virtually the same. Unless you want to print poster size pics, you don't need a 20+ mp camera. For amateur and digital only photography (no printing), 16 mp are more than enough. With features like WiFi for easy transfer to smartphones or computers, the NEX-5r is the best camera for the amateur photographer.", "Date": "November 24, 2012"}, {"Title": "If you place your camera on a tripod, get something else", "Author": "Keith Rembisz", "ReviewID": "R1KKVCMRHRZQOH", "Overall": "2.0", "Content": "Menu difficult and confusing.  Feels like a plastic toy.  I sold mine on ebay about 6 weeks later and bought the eos m with a 22 prime lens for about 80 bucks less with the lens.  If you tripod a camera beware, look at the tripod hole.  It has no area to snuggle up to your tripod mount", "Date": "November 26, 2013"}, {"Title": "Great camera, my wife loves it!", "Author": "E. David \"-end\"", "ReviewID": "R1WHOPKAZGN23S", "Overall": "5.0", "Content": "More details below but first the summary:Pros (Just the big ones, no room for them all):-Great full-sized sensor, preforms really well in low-light-Quick auto focus, also works well in low-light and has a very useful focus point tracking-Really small and light (surprisingly so) but still feels sturdy-Great kit lens that works for both still photography and video-Ability to add a larger flash, viewfinder or directional mic-Sony's software makes it easy to import photos via (fast) USB or (super slow) WiFiCons (Let's be honest I'm reaching here, it's a great camera):-Doesn't come with a battery charger (easy fix, Wasabi makes one, costs $20 and comes with two extra batteries)-No viewfinder or built in flash (so if you want/need both look at the Nex-7, personally it's not an issue for us)-WiFi upload is SLOW, ridiculously so, and the camera must be turned off then on again afterwards (Fix: Use USB)-Isn't weather sealed (It would be nice, just saying)-Doesn't come with the available PZ 16-50mm F3.5-5.6 power zoom lens as part of the kit (This lens is amazing!)-aaaannnnnd...nothing else I can nit-pick really, sorry but it's just a great camera.I spent about a month or two looking at various cameras for my wife after she said she was interested in getting back into photography. Originally I was leaning towards a DSLR but after my wife complained (correctly in my opinion) that they were bulky and unappealing I started looking at ILCs.After a lot of looking and a long discussion about viewfinders (my wife is a trained photographer and started on film so she was initially uncomfortable with a camera without one), though we eventually decided that $300-$500 more for a viewfinder-equipped camera wasn't worth it. The primary reason I picked the Nex-5r was that it was moderately priced and equipped with a full-sized sensor, allowing better performance in low-light, as well as having the ability to mount an optional viewfinder or boom-mic.So far the camera has performed flawlessly. We have been shooting portraits and candids of our daughter, athletes in motion and in dim to bright environments, and using it for street photography and the images are great. The only real issue is we both want to shoot with it all the time (I'm considering getting a second Nex-5r or maybe a Nex-3 body this holiday). In summary, we both love the camera and recommend it as a great beginner to intermediate user camera (I've even read about some semi-pro photographers using it or the 6 & 7's as their primary camera).", "Date": "October 2, 2013"}, {"Title": "Best bang for buck digital camera on the market, $500? Seriously.", "Author": "Warner", "ReviewID": "R1H7K7VJM0I44M", "Overall": "5.0", "Content": "I've toyed around with 7D's, D3100's, Canon's new 6D...I sent them all back mainly because I wasn't thrilled with the images. I'm a film guy and never really made the switch to digital full-on until recently. Don't be fooled by the size, weight, plastic, touch screen, it's actually a serious camera that produces excellent images on all factory settings. The white balance is always perfect. There is more dynamic range and subtle color reproduction than the 7d or the 6D. Throw a Zeiss Contax or Voigtlander ASPH lens on with an adapter and you've got a poor man's Leica.Of course it's not suitable for most professional work, but it's fully capable of producing comparable images.Manual focus assists are a life saver, image mag. and focus peaking are great. Battery lasts quite long.Video: looks as good or better than Panasonic's $4,000 AF100  (maybe 5R not built for pro's but gives comparable results)You may want the NEX 7 if you demand the absolute best image possible from a NEX camera, but I'm satisfied with the 5R.", "Date": "August 30, 2013"}, {"Title": "A month into ownership, can't put the camera down!", "Author": "X. Ying \"Geek\"", "ReviewID": "R9G8WSPHG0XTH", "Overall": "4.0", "Content": "After 4 years with a Nikon D40, I was in the mist of purchasing my first lens other than my kit lens - the 35mm f1.8 Nikkor, priced at $200 on Amazon. As I was looking for reviews of this lens before finally putting the dough down for the Nikkor, I came across this article by G+ Photographer Trey Ratcliff about \"3rd gen cameras\" :http://www.stuckincustoms.com/2012/01/04/dslrs-are-a-dying-breed-3rd-gen-cameras-are-the-future/Needless to say, I started looking around and found that these new \"Point and shoot\" bodies have a bigger and better sensor than my D40! Why was I going to stay with my meager D40 when I can spend a little bit more for the Nikkor 35mm for a better camera!Off I went, a NEX-R with WiFi sharing came in the mail rather quickly thanks to Amazon PrimeFor over 30 days now, I've adapted my shooting to the 5R and it has been a JOY to use, not only that, but the ability to use old lenses via adapters has opened my eyes to the world of photography that I've never dream of... I never knew how weak my Nikon kit lens was.. until I understood a bit more about Aperture and what a $50 Minolta 50mm f1.4 could achieve on the NEX5R! Now the Nikkor 35mm f1.8 seemed expensive to me...For 4 years, my Nikon has been just the stock 18-55 kit lens, all other lenses were pricey and I wasn't sure which was going to be compatible with my camera...The NEX5R? Not a problem, a week after I owned the camera, I bought a 35mm f1.7 CCTV lens here on Amazon for $30. Within 2 weeks, I had won an auction on eBay for the Sigma 19mm and 30mm for $145 and several other lenses for under $100. My lens collection has grown to 9 lenses in the last 30 days, and have shot AMAZING shoots.Thanks to this camera, I am becoming a better photographer and learning more than I ever did with my D40, and thanks to the light weight and small body, it's on me all the time, and like Chase Jarvis said, the best camera is the camera you have with you!", "Date": "June 26, 2013"}, {"Title": "Low Light Video Not Appreciably Better Than Canon Rebel", "Author": "A. Ashley", "ReviewID": "RETLKIDCGH05Y", "Overall": "4.0", "Content": "This review is for the video performance only and manual focusing exclusively. I use Canon 550D/600D/650D. I was attracted to the NEX for its reputed low light performance and high dynamic range. After testing against the 3 Canon cameras with the same lenses (I used an adapter for the NEX) I found that though the NEX may be slightly better in low light at the pixel peeping level, on a day-to-day practical level, I could not see a difference in the quality of the video between the cameras. Since I am already geared up for Canon, and the fact that I can run Magic Lantern on the Canons, I decided to return the NEX.If I were starting from scratch, I would find the small size of the NEX attractive. For example, I use fully manual lenses and liked being able to see the aperture and focus settings while behind the camera without having to look over the flash housing of the Canon’s. This may seem a small issue, but in the heat of a busy shoot, it’s nice to have the visibility. As other reviewers have pointed out, the controls of the NEX are not DSLR-like, and not necessarily intuitive, but this would not be a reason to stay away from an otherwise good camera.I gave 4 stars to the NEX. I would also give the Canon cameras 4 stars, and the combination of Canon & Magic Lantern together 5 stars plus.For those who are not familiar with the funny sounding name “Magic Lantern”, it is software that runs in conjunction with the Canon firmware, and allows a much greater degree of control over the camera settings.", "Date": "May 26, 2013"}, {"Title": "I LOVE IT!", "Author": "rach", "ReviewID": "R22WSK994PSBSC", "Overall": "5.0", "Content": "So I'd been thinking about investing in a DSLR for months and months and finally one day, I decided to actually start researching. I ended up abandoning the idea of DLSRs and decided to get a CSC instead, as I am not one to get excited about lugging around anything bigger than my iPhone. After a few weeks of research, I decided on the NEX 5 because of the flip up LCD screen (which is useful for self-portraits and self-videos. It's also right in the middle in terms of \"fanciness\" - professional and complicated enough to be a definite step up from a point & shoot but not so intense that I'm intimidated. It's a great medium between the two. I maintain three different blogs and the photos I am producing now are worlds ahead of my pathetic P&S; and iPhone shots.The touch screen and wifi are just bonus features to me, but I definitely use and appreciate them.", "Date": "May 1, 2013"}, {"Title": "NEX 5R with 16-50mm lens: Great upgrade from NEX 3 with 18-55mm lens", "Author": "S. Sze", "ReviewID": "R3OQ2ZB5ZNKJVK", "Overall": "4.0", "Content": "After enjoying the NEX 3 with the 18-55 kit lens for 2 years I finally found a good reason to upgrade myself to the NEX 5R accompanying the newer 16-50mm powerzoom lens (SEL1650pz) which i have a separate review on the lens in amazon.com (and a separate review on NEX 3 in 2011)Having been using the camera for 3 months I think it is a good time for me to give it a review. My review will be base on comparing my experience with the NEX 3 (which was a very decent ILC by itself)Pro:1) Compactness: with the 16-50mm lens and the 5R body it is MUCH smaller and lighter than my NEX 3 with 18-55mm lens.2) PHASE+Contrast detection focus: Much faster focus than my NEX 3, one major reason i want to upgrade3) Additional Fn/Dial for control/settings: Less digging into the menu to find settings!4) 180 Flip TOUCH Screen: NEX 3 has a 100 degree flip screen which is decent but 180 is just better :)5) Full HD recording (my NEX3 only takes 720p)Con:1) WiFi: The \"Play Memories\" user experience is still fairly immature, connecting speed and user interface is tedious  comparing all the new mobile touch screen technologies out there. The android remote control is limited to just snapshot and review.2) External Flash: If they can put the flash inside the 3N body, they could have done it on the 5R, small issue since i have not used flash on my camera for over 2 years.3) Power switch can easily be triggered since it sticks out from the front(the 3N configuration seems better) It was a problem with my power zoom lens since the lens wants to stick out if the on/off switch gets triggered inside my jacket pocket.4) MOVIE switch is hard to reach if the screen is flipped up even slightly5) MP4 is only 1440x1080 (1920x1080 for AVCHD only), not sure why, it looks fine enough though5) No more 3D pictures!? (used to be in my NEX 3, not that i ever really needs it, just saying)Wish:1) Can capture picture while doing video (they have that in lower end cameras!) - can be done with firmware update?2) Improve WiFi / Playmemories user experience and have more controls via mobile app like video capture, setting changes, etc) - sony has a long way to go but can be done with firmware update3) Faster start up time4) Brighter screenOverall I am happy with this upgrade. Really looking forward to see if Sony will bring new firmwares to improve some of the user experience shortfall that I mentioned above.", "Date": "March 21, 2013"}, {"Title": "Very happy with the camera!", "Author": "Lance Maurer", "ReviewID": "RNYLRFKA8KGIP", "Overall": "5.0", "Content": "Camera has met all of my objectives, extremely small and portable for hiking/trail running, great flash speed, catches everything, and unlike a lot of other extremely fast cameras the photo quality is beautiful at 10 FPS.The panagraphic photos are unbelievable especially on landscape photos.Haven’t yet played with the Wi-Fi yet; looks like it might be somewhat of a pain??Got to be honest I am not very camera savvy and the camera is very easy to use and needless to say stupid proof.My daughter is a senior in high school and we were in the process of having to pay a very large sum to have what we felt were not the best quality senior pictures.  On a whim I suggested that she and I head out for the day and take some photos.  I easily took over 4000 photos that day at various locals (indoor and outdoor) and the photos were so amazing that we decided to forgo the professional photos and took the cream of the crop photos from our outing.In the process I probably saved $400.00 easy!Very Happy?", "Date": "January 23, 2013"}, {"Title": "Nice camera - coming from someone who returned it!", "Author": "Justin", "ReviewID": "R26ZBZOECUVLIA", "Overall": "4.0", "Content": "I bought this after much research and deliberation.  I was looking to get my first ILC and didn't want the bulk of a DSLR.  I decided to pull the trigger and buy it.Pros- Great image quality, even in low light.- Focus speed was very good.- Continuous shooting capability was amazing.Cons- Size with the kit lens was impressive, but still not pocketable.  It would still be bulky in cargo shorts/pants or a jacket pocket.  To make it better, you could buy a pancake lens for about $200.  I have my iPhone with me at all times, so I wasn't necessarily planning on taking my ILC everywhere anyway.- The flash didn't contact well.  The camera wouldn't recognize that it was connected half the time.  I tried tightening the screw as well as I could, but it's not the easiest to access for a good grip.  One of the main uses for me is shooting my kids around the house in poor light and the option to use the flash was a must for me.  The high ISO performance is very good, don't get me wrong, but the option was a must.  I probably could have sent it back to Sony or exchanged it, but I didn't want the same thing to happen a year from now.- Lens options and costs.  There are very few lenses available compared to Canon or Nikon, and the cost of similar lenses is much higher.  For instance, a 50mm f/1.8 prime is $110 for a Canon and approximately $275 for the Sony E mount.Semi-Con- The menu system was a little cumbersome, but I don't think it would be too bad after extended use.Overall, I ended up returning the NEX-5R after 4 days (taking ~400 photos) and buying a Canon Rebel T3.  I have my iPhone with me at all times, so I wasn't necessarily planning on taking my ILC everywhere anyway (so the DSLR size wasn't as big of an issue, or at least I hope not).  With the price difference between this and the Canon T3 I could get an additional lens and camera bag and still come out ahead.  It was a better option for me as I am just getting into the ILC market and didn't want to spend a ton of money.  I still give this camera four stars, as my cons are more based on my individual use case (and the fact that the flash issue probably could have been fixed).  The image quality and camera performance was outstanding for the four days I used it.", "Date": "February 22, 2013"}, {"Title": "Great Pictures, Poor longevity and customer service, Panarama feature stopped working at 4 months", "Author": "C. Sheffield", "ReviewID": "RUTO5FVFCOF0J", "Overall": "2.0", "Content": "This camera takes wonderful photo's and is compact and easy for on the go.  Small enough it is not cumbersome for vacation use.Unfortunately Sony customer service is pretty inconvenient.  I purchased this camera in April 2013, it mysteriously stopped working in February 2014.  I took it to the Sony store, they are not equipped to handle camera's.  They referred us to the technical support line.  I had to mail the camera in, at which point I was told that the camera had physical damage and could be repaired for $800.  My problem with the product is that the camera had never been dropped, any damage done I would deem as normal wear and tear.  I feel the longevity and durability of the camera should have been better in this price point.The Panorama feature on this camera was GREAT!  Until is completely stopped functioning after four months of use.  The photo's were too dark to discern anything.", "Date": "April 15, 2014"}, {"Title": "Good product for the price", "Author": "sylmic", "ReviewID": "R2KLT26XQL0BLH", "Overall": "5.0", "Content": "Really nice pictures (my other camera is a Nikon D300S !), better movie than the SLR and quite easy to use. No so compact though... doesn't fit in your pocket...", "Date": "April 2, 2014"}, {"Title": "If you are a traveler this camera is the righr choose for you", "Author": "Bern", "ReviewID": "R3ELTU62H0TS7A", "Overall": "5.0", "Content": "I've been using the 5R for one year and I really can’t complain about the quality of the pictures. I took the camera to one of my friend’s wedding and people were asking about the pictures the week after since the pictures were in a higher level than the regular cameras. It behaves fine on low lights and when you master the camera, definitely you will get great results.", "Date": "March 29, 2014"}, {"Title": "Works great unless you plan on recording long videos", "Author": "james Carson Grane", "ReviewID": "R23O8CPKC2PY20", "Overall": "5.0", "Content": "The reason why I bought this camera was to use it to film some high school basketball games. The quality is fantastic and I can easily power it on and press record in time to get all the good shots. The only problem though is that if you are planning on recording videos anywhere near the 10 minute mark (even sometimes near the 7 or 8 minute mark) the camera will begin to overheat and will become a pain to try to use until you give it a break. I completely understand why this happens but it can be a drag.Literally, every other aspect of the camera works great. I have been using the camera at least twice a week since the beginning of November now, and besides the overheating, the format, quality, audio, and everything else works great.", "Date": "March 17, 2014"}, {"Title": "Kids camera", "Author": "Kimberly Sessions", "ReviewID": "R1YEACCSJVESAM", "Overall": "5.0", "Content": "Great camera to use with kids because it can take several images together.  I don't even find the size that heavy to use throw in my purse.", "Date": "March 10, 2014"}, {"Title": "\"Upgraded\" from 5N", "Author": "K. Shin", "ReviewID": "R3BUFDZZ8M213G", "Overall": "4.0", "Content": "I'm one of those upgraders that went from a 5N to 5R. I really didn't need to but the price differential of how much I was able to seel the 5N for and buy the 5R was small enough so I went with it (I was just looking for any justification really :).  The user experience and the quality of the photos are very similar so I won't go into too much detail since I already wrote a long review about the 5N. One of the reason I got 5N was that I got tired of the bulk of my Canon DSLR. NEX is such a better experience for me, though I wish the lenses were smaller/lighter.On the 5R:- The new physical control wheel is nice and convenient.- Noticeably higher battery drain than 5N (and this is with wifi off).- Photo quality is similar to 5N- Overall user experience is similar to 5N.I think it's time Sony kill the proprietary NEX port and move to something more standard for the next iteration, as it's done on NEX6.  I have all the accessories - EVF (which I use a lot), flash (I use from time to time), and mic attachment (I've never used).  What's annoying is that if I wan't to use the flash to do some bounce photos indoors, I have to take off the EVF.The screen articulates better than 5N and now you can do a complete 180 flip and see the screen for self-pics.  It's a great feature and I've really used it.  However, the other design decision (oversight) I don't get is, if you have an accessory plugged into the NEX port, you can't do a full 180-flip.  So let's say I had the EVF on (which most of the time is), to take a self shot, I have to take the EVF off... and if you know how these NEX ports work, it's pretty annoying b/c it's not a simple click-and-snap motion.  You have to unscrew the dang thing on/off.  With the bigger flash unit, I understand, but with the EVF, the screen almost flips completely 180... almost but not quite and for the screen image to flip itself vertically, the screen has to be completely 180.  Perhaps a downwards 180 flip might have been better but then the tripod users will complain :)I still like using NEX over a DSLR, though these days, I'm eyeing a good m43 deal... the smaller lens (generally) of m43 format is really hard to ignore.", "Date": "January 19, 2014"}, {"Title": "AELock by depressing the shutter release halfway", "Author": "Julianne", "ReviewID": "R23TJT3TF5EHML", "Overall": "4.0", "Content": "I agree with ALL of the pros and cons in-depth analyses of many reviewers below.I do have one useful experience to share. This took me a whole evening to figure out (and the instructional manual does not explicitly explain this).If you want to have AELock of your exposure by pressing half way onto your shutter release button, then remember to setup your 5N this way first:1) In SETUP mode: set \"AEL w/shutter\" to 'on'2) then you must go down to set \"Live View Display\" to 'Setting Effect On'.Without the 2nd step, you will not get AEL with half depressing the shutter release.This is a great camera, but Sony really needs to do something to explain things to users, even experienced ex-user of NEX-5N.", "Date": "December 25, 2013"}, {"Title": "Amazing camera", "Author": "pika2000", "ReviewID": "R1RXGRETT12FBW", "Overall": "5.0", "Content": "I just love this camera. I bought this to replace my old original NEX-3. There is a lot to love.-Great battery life. My old NEX-3 eats up battery pretty quick. To my surprise, the NEX-5R lasts significantly longer.-Function button and extra dial on the top. One of the challenge in using the NEX-3 outside auto mode is the minimum amount of physical control available for you. There is only one rotating dial, making things harder when you want to adjust things. On the 5R, there's an extra dial on the top right and a function button, allowing you to access a quick menu for common settings. This makes the shooting experience in other modes, even on manual, much more usable.-Wifi. Yes, this camera has wifi that allows you to upload a resized JPEG shot to the Sony PlayMemories app on your smartphone/tablet. Even better, you can set up your phone/tablet to be a wireless viewfinder for the camera. Refresh rate is fairly low because of wifi, but it's a great thing to have. Imagine having the camera in one corner of a room, and you are taking pictures from the other side of the room using your iPad. Not much controls you can do from the app though, but it's a neat concept.-180 degrees screen swivel. The screen swivel 180 degrees up so you can take selfies easily. Well, it's not just for selfies, but it makes things easier in certain situations, allowing you to keep seeing the viewfinder instead of guessing when composing.-Touch screen. Touch screen allows easy focusing. You can also interact with the menus via touch (unlike some Olympus micro 4/3rds).-Phase detection auto focus. A firmware update adds phase detection auto focus. It's supposed to allow faster auto focusing. I'm not technical enough to notice any differences though. Also, some lenses' firmwares have to be updated too to take advantage of this.-One weird thing is that Sony is selling \"apps\" for this camera. Yes, there's an app store. I doubt people would be willing to pay for any though., and I also doubt we will see 3rd party developers doing anything for this really niche app store.-Also an annoying thing is how Sony design the settings menu. It takes too much scrolling just to get to some settings. Luckily there's that function button.-Lastly, it didn't come with an external battery charger. Yes, just like most modern smartphones, Sony wants you to charge the battery in-camera, via USB charging. This makes charging a spare battery highly inconvenient. On the bright side, if you are low on battery, you can simply charge it with your phone charger or many USB external battery packs out there.An awesome camera. Coupled with some of the great E-mount primes, like the 35mm f1.8 or the 50mm f1.8, you can get stunning pictures, on a device that is a fraction of the size of a typical APS-C DSLR. The only concern I have is that Sony considers the NEX as a consumer lineup, so don't expect long term support in terms of firmware updates. The NEX-3 stopped getting any further firmware updates fairly quickly. Sony already release a newer version of this, the NEX-5T.", "Date": "December 16, 2013"}, {"Title": "it will change your life", "Author": "daiyi", "ReviewID": "R3OOZSWSZ03ZNH", "Overall": "5.0", "Content": "Compact, powerful, light. I use it with the 16-50mm pancake so it is extra portable. I toss it in my bag whenever I leave the house. It does extraordinarily well in low-light settings, perfect for indoor gatherings, dusk activity shots, catching lurkers in the shadows and whatnot. Downsides include resistive touchscreen (unless you're into early 2000's throwbacks), and relatively speedy battery drainage, but neither are sources of deep feelings of regret. The wifi/app stuff/selfie-mode is gimmicky but on its own it is already an excellent camera. If you're thinking about getting one, you should probably do that.", "Date": "October 13, 2013"}, {"Title": "Definitely Superior Quality Sensor compared to the Nex-3", "Author": "agranados777", "ReviewID": "R146PB1MC19GTK", "Overall": "5.0", "Content": "The images of the Nex-5 have a much better contrast than those of the Nex-3, colors are also much more vivid, the Auto-Focus Feature is much more precise, overall is very well worth it to get the Nex-5 instead of the Nex-3.", "Date": "July 10, 2013"}, {"Title": "Fast!", "Author": "Timothy Travis", "ReviewID": "R1W5BMYHDXAH4S", "Overall": "5.0", "Content": "This camera is fast the shutter speed is very quick. The camera has a lot of features that are really cool like the smile detector \"it takes a phot when you smile!\" We bought this so we would have a good camera to take pictures of our daughter, she just turned 1 and I took 440 pictures during her party but it didn't feel like I took that many cause the camera is so fast.", "Date": "December 17, 2012"}, {"Title": "fair price for a good camera", "Author": "Jinzhu Li", "ReviewID": "R3ONO04QFOTO1R", "Overall": "5.0", "Content": "So far so good. Taking good pictures with a lot of awesome effects built-in! Apps are easy to install and use.", "Date": "December 2, 2012"}, {"Title": "GREAT CAMERA FOR THE MONEY", "Author": "Christopher Binns", "ReviewID": "RW99ZRDKHCBPB", "Overall": "5.0", "Content": "Exceptional picture quality for a sub-$800 camera, especially when paired with high quality after market prime lens like the Sigma 30mm f/2 or the Sony 50mm f/1.8. Images are brightly rendered, richly hued, razor sharp and crystal clear in ideal, illuminated settings. Night/dimly lit shots are very good. Video quality is amazing, especially when set to 1080p/60fps; it's ever-so-slightly better than the Sony HX30V in terms of contrast, richness of color and motion smoothness, in video mode. The controls could be more operator friendly, however; one must often dig deep into the menu to make basic adjustments. Take time out to LEARN this camera! My suggestion? Buy this camera WITHOUT the kit lens and wait for the power zoom or invest in better lens like Tamron for your everyday, but definitely buy the Sigma 30 or the Sony 50 for serious photography. Great job, Sony! I'll be waiting and saving my pennies for the inevitable full frame NEX...", "Date": "January 23, 2013"}, {"Title": "Excellent camera with a few small disappointments", "Author": "Son Dang", "ReviewID": "R2R354HBB48JUK", "Overall": "4.0", "Content": "Since current reviews of the NEX-5R already cover technical aspects and picture quality, I won't go into those too much. My review focuses on a few usability issues that I found through using it the past few weeks.WiFi ConnectivityOne of the main reasons I chose the NEX-5R over another compact system camera in its price range is WiFi connectivity. But having WiFi isn't as useful as I thought it would be due to the limitations in Sony's software. There are several ways to get pictures from the camera and they all have drawbacks.- Direct Upload - Sony touts apps as one of the big features for the NEX-5R and Direct Upload is an app that does what its name suggests. However, the only two supported destinations are Sony's PlayMemories service and Facebook. No Flickr, no Picasa, no Dropbox. Uploading to PlayMemories is pretty easy, but once my pictures are in there, I can't do much with them. I can't even share a picture by directly linking to it. Instead, I have to send an electronic postcard using one of the gaudy templates.- PlayMemories Mobile - What I love about taking pictures on my iPhone is being able to share them instantly through text message, email, Instagram, etc. The PlayMemories Mobile app for iPhone allows me to use my phone to view and copy the photos currently on the camera. The only problem with this method is it requires disconnecting my phone from my WiFi network and connecting to a wireless hotspot the camera creates. I understand why Sony did this; there most likely won't be a WiFi network available outside. However, when I'm inside with both the camera and iPhone connected to my home WiFi network, PlayMemories Mobile should be able to connect to the camera through the existing network.- PlayMemories Home - I hate having a bunch of USB cables connected to my laptop so the main thing I expected to do through WiFi is upload full resolution pictures from the camera to my laptop. It sounds like I might be able to do this using the PlayMemories Home software; there's a short paragraph about it in the manual but it is weirdly worded so I'm not sure. I wasn't able to test this out because the PlayMemories Home software doesn't work with OS X. It took me a while to figure this out because the packaging plainly states the camera is compatible with Macs. However, Sony is being only partially truthful because although Macs can recognize the camera when it's connected through USB, PlayMemories Home is not available for Macs.- USB cable - This is the old-fashioned way and it works just fine. After connecting it to my Mac, Aperture immediately recognized it and I was able to upload pictures easily.For now I'm grudgingly using the USB cable method to upload pictures. Once in a while I'll use PlayMemories Mobile on my phone, but fiddling around with the WiFi network is too much of a hassle so I'd rather wait until I get back to my laptop before sharing any pictures.Touchscreen & ResponsivenessThe overall quality of the hardware is fantastic. It feels very sturdy. The only aspect of the hardware that isn't excellent is the touchscreen. It's definitely nowhere near as responsive as a touchscreen on a modern smartphone.The software makes the touchscreen feel even worse than it is. Many buttons have small touch targets so it takes several tries for me to successfully tap them. Fortunately, there are hardware equivalents for the on screen buttons. For example, instead of tapping the OK button on the screen, I can press the center button on the directional wheel, which I do most of the since it's a lot easier.Typing on the screen is a huge pain. On certain screens, Sony displays a dumb phone style keyboard where multiple letters share one button so I have to tap it several times in order to get the letter I want! When trying to download an app, I have to log into my PlayMemories account. For those instances, Sony displays a regular keyboard. However, the screen doesn't always recognize when I tap a key. The good news is I've only had to use the keyboard a couple times - connecting to my WiFi and logging in to PlayMemories.A minor hardware decision that bugged me is the NEX-5R comes with a bulky shoulder strap similar to ones that DSLR's have, which seems to defeat the purpose of getting a relatively small camera. Instead of using the included shoulder strap, I bought a wrist strap that's much smaller. The one I bought is the EzPhoto leather wrist strap. It looks great and is strong enough for me to confidently hold the camera using just the strap. At only $8, the EzPhoto wrist strap (available on Amazon) is a great purchase.Overall the NEX-5R is a fantastic camera. Although the issues I described above are disappointing, they don't affect the most important feature of the camera, which is taking high quality pictures.EzFoto Black Genuine Leather Hand Wrist Strap, for Fuji X100 X10; Nikon N1 V1 J1; Leica X1 D-Lux5 M9 M8 M7 M6 M5, M4; Panasonic GF1 GF2 GF2K GF3 GX1 LX-3 LX-5; Olympus E-P1 E-P2 E-P3 E-PL1 E-PL2 E-PL3; Sony NEX-3 NEX-5 NEX-C3 NEX-5N NEX-7.", "Date": "December 31, 2012"}, {"Title": "Camera is excellent with some cons", "Author": "Tri D.", "ReviewID": "R29RNITK2728E2", "Overall": "5.0", "Content": "This is for EVERYONE before they start using the camera. UPDATE THE FIRMWARE!!!The firmware is actually for the lens and not the camera itself. However, you have to update it through the camera with the lens attached to it. YOUR HYBRID FOCUS WILL NOT WORK WITHOUT THIS UPDATE!!. You also need to turn on phase detection AF to have hybrid AF. I've seen \"professional\" reviewers bashing the slow focus and bad night time AF when they're so professionally inclined to do a simple update job.Hybrid AF = phase detection + contrast detection. Phase detection AF works great and as intended. It is faster than I can press a stopwatch. I do notice that phase detection does not work with illumination light or low aperture. Low aperture means a high fxx number! remember that! But even in my dark bedroom with only 1 lamp + shades, I am still at about F4.0-5.5 on the stock 1855 and therefore phase detection still works like magic.I bumped ISO to 3200 and sometimes 6400 in my room to compensate for lack of light and pictures still came out with relatively low noise. I noticed my camera tends to underexpose a tiny bit so I bump EV +.3. However, this is only using the camera's LCD. I have not have time to upload the pics on my comp.I did get the 10fps speed continuous. However, it really is only for the first 10 frames. Then it feels like 3 fps afterwards. This is with the Sandisk extreme class 10 UHS 1 45mb/sec. The Nex 5R does not support UHS so it reverts to class 10.The flash attachment works great. When you install it, you must push it down and turn the little wheel on the inside of the bend. Else, it would pop out on you. I almost missed that step because I never read instructions.HDR and DRO settings are in the color settings instead of camera settings. Why? I have no idea. Maybe the Japanese have a different way of organizing things. I tried it and it just works like in the product description. However, the last shot seems to take a much longer time than the first 2 shots. Remember that and don't pull the camera until it finishes. I think there are times where it needs up to 6 shots.I don't know what people are saying about controls. Yes it is finicky initially trying to figure out everything since not everything is labeled. But it literally took me about an hour to get used to the control. Some of it is redundant and I hope they fix that. Like the top dial and back dials sometimes serves the same function which is annoying. It's not the easiest interface but it's definitely easy to use if you just invest some time and learn. Or like me, just play around pushing every button and turning every dial. You cannot break the camera by pushing buttons!Image quality is excellent. I feel as if my lack of skills was compensated by the camera's ability to take great pics. It does most of the thinking for you. Rule of thumb is to use Intelligent auto for regular shooting and superior for high contrast scenes. Or pick a scene selection mode and it'll always get the job done for you. Once you google photography basics and learn about aperture, shutter speed, iso and exposure. You can use the priority modes or manual once you get used to the controls.I spent 2 hours in my room playing with this cam, doing firmware updates, going out to a pho restaurant and snapping a few pics to try out the features. Everything is just like it says or better. AF is fast and generally focus on what you want but you can always use the touch screen to have it focus on something else(like if you want to focus something on the edge of the screen and defocus the middle and background). NO EVF IS NOT A DEAL BREAKER! first, you already know it has none before you bought it. And then the naysayers complain about wanting EVF + flash. WTH, the LCD screen works just fine at night. And if you are a pro photographer then I ask you why are you using this camera? haters will always hate. Dumb people will always make dumb decisions.Battery life definitely last way past the 330 rated shots for me. I took about 180 and my battery was at 75%. Maybe they meant 330 on raw + jpeg with flash and LCD on brightest outside in -20 weather. But maybe they are compensating for the battery over time. IDK but the battery lasting longer is a good thing, no complaints here.I do have a few complaints. I hate the wifi and touch screen. Touch screen is pressure sensitive and not touch sensitive. I feel like i'm bending the screen sometimes because I actually am! Wifi is useless. Stick the card in your laptop and enjoy the UHS speed. Plus it doesn't drain your cam's battery. Or better yet, just plus the cam into your laptop and you can charge/transfer photos at the same time. Windows 7 automatically installed the camera btw, I didn't have to install anything except Playmemory software if you want to use it. I don't want more junk, I didn't bother with it. I have playmemory on my ipad2 and it works great transferring there through wifi but it's much slower. You know what? screw you apple! when are you going to have an SD slot?!?!?!Turn on lens distortion correction in your settings!!! These lens are cheaper but they are ok. With the distortion correction, these lens should be excellent but don't expect it to be like $4000 professional hardware because it is not! Sony charged you an extra $100 over body only. What did you expect? a few Ferrari F430?I like the size compared to the performance. It is pocketable body only but who does that? With a 16mm pancake lens, you can pocket it but why would you? You will have a better social life if you strap it around your neck(not waist! it's 2012!). It's light enough to not snap your spinal cord and big enough for people to notice and start a conversation with me. I was sitting there eating pho tinkering with this thing and a lot of people was looking at it(no i wasn't taking photos) Some even came to ask me about it because they did not know which to decide. Some just came to admire it because it is a very cool looking gadget. I will repeat this one more time. DO NOT POCKET THIS CAMERA! and DO NOT TAKE OUT THE LENS UNLESS YOU HAVE SOMETHING TO PROTECT THE SENSOR!. Yes, i took the lens off and it is right there in the bare.I did some research on the web and found that memory stick duos will be slightly faster than sd class 10. It will also produce less heat from the camera. If you have money to eat steak and eggs in the morning instead of a coffee and rice like me then go for it. I don't like Sony all that much to give in to their expensive crap. It cost about twice as much as the equivalent SD card from Sandisk.READ THIS!! I have solved the slow recharge problems. Instead of using the brick sony included, I used the usb wire sony included and plugged it in my ipad's charger brick. It recharged my 5r from 11% to full in less than 2 hours.Pros: Fast AF if you update the firmware. Excellent image quality even at high ISO. A lot of features. Will improve your social life if you don't pocket it. Better manual controls. Wifi for Ipads. Battery life exceeds expectations. Flip screen. Free flash.Cons: wifi lacks speed. No support for UHS-1. Touchscreen is smash screen. Not pocketable. Nothing protecting sensor with lens off. Controls are sometimes redundant. Maybe no EVF?(but you already know it has none!)", "Date": "January 4, 2013"}, {"Title": "Impossible to operate", "Author": "John Erickson \"John\"", "ReviewID": "R6G6NAQJA7PBL", "Overall": "1.0", "Content": "Have been a serious amateur since the early '60's and owned several digital cameras.Initially purchased a NEX-6 and returned it due to very poor documentation.  Couldn't figure out how to use HDR and manual left me clueless.Purchased the NEX-5 and an auxiliary manual (thank goodness) and got it to work.  The controls are totally non-intuitave.Was at an event last weekend and lost about half of the good shots due to fumbling with controls and searching through sub-menues.  Hit the wrong button and away go your pre-sets.I expect to have the camera be an extension of myself and this doesn't do it.  Like having your turn-signal in the glove compartment and shift lever in the trunk.I'm trading it after 6 months.  Gave it a valiant effort.(But on auto modes and taking snapshots it's great - but so is my iPhone)", "Date": "November 5, 2013"}, {"Title": "Quite pleased with the package.", "Author": "David", "ReviewID": "R3RJ63AFYC8RLS", "Overall": "5.0", "Content": "I made the switch from point-n-shoots to this camera, and I must say I have been very pleased with the picture quality so far. I ended up picking the entire lens package to go with the camera (16mm, 18-55mm, and 55-210mm zoom), and while swapping lenses isn't exactly convenient, I have found myself taking a reduced volume of pictures with a much higher rate of good photos. I was a bit displeased with the video format getting broken up into segments by the camera, but the included software lets you stitch the videos back together, and it seems a good practice to preserve segments of video should battery run out. Otherwise I am very pleased with the video quality.To get the full advertised capability of the camera you have to download camera apps, a process which was kind of tedious but I eventually got working, I discovered using your cell phone as a remote control for the camera is impossible. The connection is dropped repeatedly, connecting takes forever, and the app for the phone crashes. I have found the little IR remote to be much more effective and easier.On a technical note, the exposure level flickers when using the 16mm lens (I have yet to figure out why), and gets worse when using filters. The 16mm is a must have for self portraits however, as the 18mm just doesn't cut it at arms length. The 16mm also makes the camera very portable. The intelligent modes are pretty useful for most shots, but you will need the program and manual modes occasionally for things like low light shots or HDR photography. The camera forces JPG only when in many of it's special shooting modes, so RAW and RAW+JPG is only available for intelligent and manual modes. For the most part I rarely use the flash, or even need to. The sensitivity on the camera is usually good enough for most of the situations I have put it through. You do need it for night time shots with people in them though.On the whole, I do find myself occasionally missing the convenience of the integrated zoom lenses of point-n-shoots, but I do so love being able to crop small objects out of large photos and have them be clear and large enough for desktop wallpaper use. The NEX is very portable compared to a normal DSLR. The menus are a bit long, and take a bit of scrolling to get through, but once the camera is set up and you get familiar with the layout and customize things, it is pretty easy to change things on the fly.The touch screen is pretty much just a novelty, but it does let you select subjects, take pictures and focus.", "Date": "February 13, 2013"}, {"Title": "nice images/poor menu structure", "Author": "Richard Gray", "ReviewID": "R1TX86K898QAXO", "Overall": "3.0", "Content": "I've only had this camera a few months.  Here's what I think so far.  The images are good, but not as spectacular as I had hoped.  My buying decision was based primarily on the APS-C sensor size.  I believe that the included 18-55 MM lens might be the problem.  The photos are soft, especially at the lowest (3.5) f-stop.  I thought about buying the e-mount 16mm lens, but reviews were mixed.  So, I have just ordered a 30MM Sigma lens that gets strong reviews, so that might help.  The other negative comment has to do with the process to select specific menu items.  The layout/design is cumbersome.  This is especially true if you have to go into the setup category to make a change.  There are numerous settings and scrolling through dozens of them to find what you are looking for is a pain.  For example, changing the brightness of the LCD screen.  Last negative is that Adobe Raw cannot yet process the RAW format pictures, even though it apparently works for the NEX-5N previous model.", "Date": "December 30, 2012"}, {"Title": "Great photos, very easy to use until you have to update or install apps.", "Author": "jrock", "ReviewID": "R2B9AKQ307W6Z5", "Overall": "4.0", "Content": "Photos and interface are great. Updating software and installing apps is somewhat contra-intuitive and can be buggy. Overall, very satisfied.", "Date": "May 25, 2014"}, {"Title": "I love it! Great quality videos with AUTO FOCUS for YOUTUBE", "Author": "Mylah Dylah", "ReviewID": "R3AHO6CTG29PFW", "Overall": "5.0", "Content": "I needed a great quality camera for filming videos. It has auto focus and I can see myself while filming+++. I film videos for youtube. After seeing video reviews and reading reviews on Amazon I bought it for $450+tax from SammysCamera. I got it within a week. (longest week ever due to excitement) I'm totally happy with it. I haven't bought additional lenses for it, simply because I feel it's great as is with the 18-55mm. If you want to see the auto focus in action with beauty tutorials look me up at TashChynna on YouTube. All my videos from the last 6 months have been with this camera :)", "Date": "May 9, 2014"}, {"Title": "GREAT", "Author": "RayQ", "ReviewID": "R305B2IWFHXJQT", "Overall": "4.0", "Content": "A great camera as always a Sony quality product. I returned it because it was a body only but that was my mistake and they refunded my total amount paid. Other than that I still recomend this vendor.", "Date": "April 23, 2014"}, {"Title": "Great, but stiff on/off switch", "Author": "Oberoi", "ReviewID": "R1VL0KHU3OMF03", "Overall": "4.0", "Content": "This camera was a good purchase. It takes great pictures. However, after a few months, the on/off switch became very stiff i.e. difficult to click to the left and right. We called Amazon and were asked to send the camera to Sony for repair. Since we are still within 1 year of purchasing the camera, we don't anticipate any issues with this repair process for us. If we do have issues, we will come back and update this review.", "Date": "April 19, 2014"}, {"Title": "Excellent Camera and Lenses With Some Quirks", "Author": "Joel Myron", "ReviewID": "R1JR88HD0FFSCI", "Overall": "4.0", "Content": "I bought this because my megazoom lacked the speed to photograph my grandchildrens'  sports events adequately.  For the most part it performs well capturing key fast movement shots.  But at times, despite excellent remaining battery strength, it will only shoot slowly, or not at all.  I would also like a more powerful, rapid, E mount zoom lens that works with the Sony.", "Date": "February 12, 2014"}, {"Title": "Sony next 5 r", "Author": "Ray Teller", "ReviewID": "R3AF4WY17Z92VZ", "Overall": "5.0", "Content": "Great low lux camera. Easy to operate love it. Takes great pictures. Haven't explored all features yet, but will shortly", "Date": "February 5, 2014"}, {"Title": "Good Camera", "Author": "SirCill", "ReviewID": "R38UEU2S2KWF6L", "Overall": "4.0", "Content": "This camera is really nice. It offers all the manual features a amateur photographer wants the size that a consumer wants for a good price. The only things that bother me is that sometime the camera seems to crash and gets stuck on a black screen requiring a power down. Its very limited though, out of 500 pictures it happened twice.", "Date": "January 6, 2014"}, {"Title": "Excellent camera", "Author": "wusang", "ReviewID": "R3S6ZY1IAGJ4MC", "Overall": "5.0", "Content": "The Sony NEX 5R is a great mirrorless digital camera with an APS-C sensor. I am quite impressed with the picture quality, menu system, DSLR like performance in a small, easy to carry form factor, and the WiFi function that enables quick transfer of images to my desktop PC. I am also impressed with the capability of the camera to tether to my smartphone so that each shot gets automatically transferred to my smartphone (and my tablet too.) The Sony PlayMemories Mobile app on my smartphone can be used to remotely control my camera while I watch live view on my smartphone before I remotely press the shutter. The PlayMemories Mobile app work in conjunction with Smart Remote Control app that you can download right to your NEX 5R.The camera underexposes pictures a little so that you can use software(eg, Lightroom) to recover details of shadow area. Thus a great dynamic range can be realized, especially if you shoot raw. If you don't have Lightroom or Photoshop, you can just use the Sony PlayMemories on your PC to adjust the exposure.It has a resistive touch screen that is considered less responsive than a capacitive touch screen. However I find that I can improve the touch screen by calibrating the touch sensitivity. I actually like the resistive touch because it's not over sensitive like my smartphone.The menu system is logically arranged and it is fairly easy to get used to it after some use. It is not complicated - just a lot of customization that can overwhelm some people. Once you get used to the menu system, it is easy to navigate through the menus. Frequently used menus can be called up from the Fn button and you can customize the Fn button too. With Sony's pre-assigned customization of the Fn button, I have not needed to change the default customization.I presently use the NEX 5R without an Electronic View Finder that can be purchased separately. I can shoot in bright day light without the EVF when I use autofocus lens. I simply adjust the brightness of the LCD screen. Then I can simply frame and shoot. If you use a manual focus lens that requires looking at the details to focus, you should get the Sony EVF. Better yet, simply get the NEX 6 with a built-in EVF that does not stick out as much - important if you want a pocketable camera. However, the 5R makes the camera more affordable than the NEX 6, and knowing that you can always get an EVF if needed, I chose the 5R. There's one caveat though if you want fill in flash while using an EVF on the 5R: you can have one or the other but not both. So if you can swing the budget, I recommend the NEX 6.I am very happy with the NEX 5R.", "Date": "January 4, 2014"}, {"Title": "Nex 5r is the best camera for video under $1,000 and fantastic with stills.", "Author": "Tanner Hoke", "ReviewID": "R1E3ZF5BG5QIVO", "Overall": "5.0", "Content": "This is the best camera for video under $1,000. Now that's bold but hear me out.Nex 5 prosQuick learning curveErgonomic controlsTilting screenAdaptable to virtually any lens in an indie budgetPotential to achieve full frame qualities with a focal reducer/speed boosterAvchd format (could be a con if your software doesn't recognize it)24p AND 60p at 1080p resolutionPortableISO 100 in video vs canon rebels 200Auto features are great5r consViewfinder is around $200Video playback loads slowly (plays fine tho)Playback is organized by stills, mp4, and avchd..instead of everything chronologicallyMf assist is nice but annoying to switch on and offWhite balance is deep in the menu (but that can be a custom button)E mount lenses are priced highRecording button takes considerable pressure to activate and a \"recording...\" Text comes up for 2 secondsView screen is highly reflective.Non-photo people underestimate it", "Date": "November 26, 2013"}, {"Title": "Am I doing something wrong or do I have a deffective camera?", "Author": "Mom", "ReviewID": "R4NUF9QMZAQK2", "Overall": "3.0", "Content": "I was so excited about this camera! I bought it to replace my old Sony Cyber-shot DSC-H20/B 10.1 MP. After reading so many positive reviews. I thought I was upgrading. However, most of my pictures are slightly out of focus.... the ones with the flash are in focus but too bright. I am pretty disappointed and I don't know if I have a defective camera or am I doing something wrong at this point (Yes I have read the manual and I am not a professional but also not a novice). The video quality is great ! No complaints there but the pictures are disappointing.", "Date": "November 1, 2013"}, {"Title": "Great Camera", "Author": "Rage", "ReviewID": "R3PN1JQOPQPQZ2", "Overall": "5.0", "Content": "Really easy to use and takes amazing photos and videos.The lenses are pretty expensive but the kit lens does well in most situations. I'm looking to add a pancake lens to make a more travel-worthy camera, but those options are extremely limited.All-around a great camera at a great price, the newer version isn't worth the added cost.", "Date": "October 14, 2013"}, {"Title": "great camera", "Author": "niyongjian", "ReviewID": "R27O2D1G399FFZ", "Overall": "4.0", "Content": "great camera, very easy connect to my ipadmini by sony playmemories app.the lense in the web is black, but I received is silvery, not match the black body.", "Date": "October 9, 2013"}, {"Title": "I like the NEX series！", "Author": "382776882", "ReviewID": "R2SNQ22B3VHGQY", "Overall": "5.0", "Content": "Just 449 dollars, it's have very high capability/price value. This camera has a equivalent grade with the canon 700D, nikon D5200. And it has a metal body.", "Date": "October 8, 2013"}, {"Title": "good camera !", "Author": "Kaige", "ReviewID": "R11U8XOEEBUPAT", "Overall": "5.0", "Content": "It's a good camera ! It give you the possibility to control your picture, with the lens and strong functions, but without being to heavy.The only thing I don't like is the battery. You will have to charge it almost everyday.", "Date": "October 3, 2013"}, {"Title": "Sony Nex 5r camera", "Author": "anton neumeier", "ReviewID": "R3L5L07LMG6EVQ", "Overall": "5.0", "Content": "Very happy with my purchase and will probably purchase the optional flash for the camera. I am also considering the purchase of the view finder.", "Date": "September 22, 2013"}, {"Title": "Great camera, decent apps, GPS would still be nice", "Author": "Lyle", "ReviewID": "R3VQHYL0B8Y6P7", "Overall": "4.0", "Content": "I upgraded from the original Sony NEX-5 to this.The speed is awesome (shots per second) and I really appreciated the upgrade to 1080p video. The 180° tilt of the screen is awesome and makes self-portraits much simpler.The touch screen is fine for normal menu navigation, although I often just use the click wheel/hard buttons anyway because it's usually faster and I was already familiar with them from the previous camera. Where it truly excels, though, is the feature that lets you tap the screen to take a picture (I don't remember what they call it). It makes it drastically easier to focus on the exact spot you want – no centering the focal point just to focus and then reframing your picture. This, combined with the recharge speed, makes it really easy to capture exactly what you want.The apps are alright. They definitely add some useful functionality (time lapse, non-exposure bracketing, etc.), but take a bit to load. It would be nice if these fairly common features were just included in the default software so they worked more smoothly.  One app that is pretty cool is the remote app. This is one of the better uses of the camera's built-in WiFi. My first trip after buying this camera included a visit to Arches National Park. I was able to use the camera's remote app + iPhone app to climb onto a rock formation and position the camera about 50 feet away from one of the arches, then climb back down and get under the arch with my fellow travelers, watch a live stream of video from the camera to help us pose correctly, take a few pictures, review them, and then finally retrieve my camera.The main improvement I think I would still like to have in these cameras is GPS. I love being able to explore my pictures from a map, but there's not a great way to do it with this camera. I've tried Eye-Fi cards with their pseudo-GPS tracking as well as using iPhone apps to create waypoints and merge then with the pictures later, but the overhead is still enough that I usually don't end up tracking it and resort to manually adding geotags later, if I desire. I realize adding GPS could significantly decrease battery life, but this camera isn't exactly made to excel in that department (no optical viewfinder results in a lot of power spent on the LCD). I would rather carry a couple extra batteries (I already always have one spare) than hassle with geotagging solutions.All-in-all, I think this is a good camera. I'm usually not much of a Sony consumer, but I've been pleased with their hybrids, and would consider them in any future upgrades.", "Date": "May 24, 2013"}, {"Title": "I love this camera", "Author": "David Muollo", "ReviewID": "RMEZGU0ZC4RWV", "Overall": "5.0", "Content": "Seller was awesome! Quick shipment! Camera shoots beautifully and has many options. The video is super crisp. The only downside is the clunkiness of the camera and holding it while you shoot. Once you get over that it's great!", "Date": "April 18, 2013"}, {"Title": "my favorite camera", "Author": "Terri Green", "ReviewID": "R2985L7T3FZB6Q", "Overall": "5.0", "Content": "i love that its not heavy like big nikon or canon, but good enough to be just as professional especially for a rookie like me. I take it on all my vacations and everywhere I go the quality is so good. I love the wifi feature too", "Date": "April 17, 2013"}, {"Title": "Fantastic Camera!", "Author": "C. Burnes", "ReviewID": "R3QD0NA0YC0SJJ", "Overall": "5.0", "Content": "This camera is absolutely fantastic.  It takes phenomenal photos and is so user friendly!  This camera most impressed me by the night images it takes.  It's incredible. It's small, lightweight, and takes SLR quality photos - what more could you want!?", "Date": "February 18, 2013"}, {"Title": "Good upgrade", "Author": "Niten Jaiswal", "ReviewID": "RR3XBBJ70VB4V", "Overall": "5.0", "Content": "I have a NEX-3 and think this camera is worthy upgrade.  I do see an improvement in picture quality and definitely feel the increaed quality of the all metail body.", "Date": "February 6, 2013"}, {"Title": "Amazing pictures.", "Author": "Eric Gray", "ReviewID": "R1S0RQ89X9VBJ1", "Overall": "5.0", "Content": "I moved from using a phone to take all of my pictures to this camera, and what an amazing change.  The quality of the pictures is breathtaking.  It's a perfect DSLR starter camera at a good price, and ultimately portable.", "Date": "January 26, 2013"}, {"Title": "great camera", "Author": "cb", "ReviewID": "R24WVPJZH9Y4U1", "Overall": "5.0", "Content": "We use this camera as an addition to a Canon 5D mark 2, however this is really our go to camera because it is so easy to use!It takes great pictures and video. We also love that we can upload pictures straight to facebook from the camera.It takes a little time to get it figured out, but for the quality of pictures it takes.. totally worth it! And if you just want to use it for a very basic camera you can do that quite easily.This camera has a lot of great features that you can take advantage of if you choose to.", "Date": "January 20, 2013"}, {"Title": "Good", "Author": "JWhiskey", "ReviewID": "R3JWZ4YKSYY3ND", "Overall": "5.0", "Content": "It's a good camera. Recommend getting the 16mm pancake lense. Wifi transfer to my smartphone is cool and controlling the shutter remotely is awesome for group shots.", "Date": "January 18, 2013"}, {"Title": "Simply the best", "Author": "M P Lokuta", "ReviewID": "R3A8XULTOKWN32", "Overall": "5.0", "Content": "Not too big not too small. Takes great pictures. What more would you want. Simply the best for the price.", "Date": "January 11, 2013"}, {"Title": "Perfect Camera", "Author": "Doug daman", "ReviewID": "R5EOA2RZSC400", "Overall": "5.0", "Content": "My wife has gone through numerous Modern cameras and just always been disappointed. This ones a little expensive for just taking family and vacation pics which is all she does with a camera. But she LOVES it. She's all thumbs when it comes to technical stuff and although shell probably never use half the features she finds it very easy and friendly to use. The quality of the photos is beyond description and the camera just seems to \"know\" what to do. The tilting screen also makes it so much easier.", "Date": "January 10, 2013"}, {"Title": "Awesome Camera", "Author": "Brian George", "ReviewID": "R1YXE7O489KS3R", "Overall": "5.0", "Content": "Very good quality. It is very sturdy, strong, and works great with my Sony SELP-1650 lens. I highly recommend it!", "Date": "December 29, 2012"}, {"Title": "I truly enjoy using this camera", "Author": "Ron Mundekis", "ReviewID": "R2Z1OQGZ53V6QF", "Overall": "5.0", "Content": "First off I'm an amateur at the whole photo thing, I bought this camera so I could take some pictures in low light situations such as basketball games.  This camera has worked good with the kit lens but I've come to realize that I still need a faster lens to shoot at a fast enough shutter speed to really get some decent pictures.  For indoor pictures with low light this camera is great.  I plan on buying the 50mm 1.8 lens to shoot inside the gym, during basketball games so I can move my shutter speed above 125 - 160 range that I get with the kit lens at 3200 ISO.  I realized that most of the shots I take are at the the 50mm range so I really think this lens will do the job.  I'll post later with the results of that.Love the WiFi hookup to my android phone, I've been asked by a lot of people to take a picture and email it to them at games or just because they can't get a good enough picture with their phone.", "Date": "December 26, 2012"}, {"Title": "Nex 5 DSLR without the weight.", "Author": "Dean Linville", "ReviewID": "R3BA9HD0JEJPDV", "Overall": "5.0", "Content": "I wanted an dslr but didn't want the bulk. This camera fits my needs perfectly. Image quality is great. Range of features is incredible. The ability to download apps is an unexpected bonus", "Date": "December 26, 2012"}, {"Title": "Just what I was hoping for", "Author": "DrivenMeandrous", "ReviewID": "R34AUKL3B1GU3D", "Overall": "5.0", "Content": "Simple to use, fast & very portableImage clarity is amazing for this camera size. I had some doubts switching from my 5pounder DSLR but this Christmas season saw me happily snapping without even knowing I had anything strapped to my neck.", "Date": "December 25, 2012"}, {"Title": "Amazing camera, highly recommended", "Author": "Whatever", "ReviewID": "R7UDN56S1GMZS", "Overall": "5.0", "Content": "For best out of the box results consider buying the 16-50 lens kit. The 18-55 is not bad at all, but 16-50 is better and has a very small profile, giving your a (relatively) pocket-sized package with amazing shooting power.", "Date": "December 20, 2012"}, {"Title": "Great camera", "Author": "Lee Cravens", "ReviewID": "R1YLBV4IQZGINH", "Overall": "5.0", "Content": "It takes some getting used to the menu layouts but is a great camera. The image quality is also excellent.", "Date": "December 10, 2012"}, {"Title": "Camera is fantastic...but", "Author": "Kenneth J. Hudak", "ReviewID": "R1RU8TIBRCZU53", "Overall": "3.0", "Content": "The nex 5r is a wonderful camera...the images are bright and beautiful...but with the 18-55 kit lens the image quality are horrid ...this lens is so poor Sony should be ashamed that they even put it on the market...as many people know...a camera is only as good as its lenses...the 50 1.8 is a nice lens but there is no current firmware update for the phase detect to work with it...the Zeiss is nice...for a grand it better be...and actually should be better...and for the price of the sigma 30mm 2.8 now at 140 bucks...those images are some of the sharpest produced by this camera...Looking forward to the  new lenses Sony is soon to release....let us hope the worse is passed...really though the 5r in itself is an awesome machine", "Date": "November 26, 2012"}, {"Title": "Mixed feelings but good camera overall", "Author": "Patti Cake \"basschick\"", "ReviewID": "R1LPCNPV3FI05M", "Overall": "4.0", "Content": "First off, if you're looking for a bigger sensor in a very small body, the NEX line is a great option.  I find the 5R (and its predecessor, the 5N) to be very comfortable in the hand, the screen is bright and clear, and I don't find the virtual mode dial to be any more complicated to use than a physical one.  I found the Fn button to be very useful, although sometimes the dial on top of the camera isn't very intuitive. And I've always liked navigating camera menus via a touchscreen.My NEX 5R pics look good overall, with good dynamic range, and the movies look great.  But the main reason I thought an APS-C sensor camera would be better than the micro four thirds cameras I had been using didn't come to pass - my Panasonic G3 shot cleaner low light pics than the 5R. On the other hand, my NEX has truer colors and better saturation at similar settings.I had a Sony 5N for a few days, then exchanged it for a 5R.  For those asking which of the two cameras to get, I'd stick with the 5N if you can find one new.  First, and most important to me, the 5R pics are just a little bit noisier than the 5N pics.  Also I didn't find the hybrid focus to be very helpful, and while I've had other cameras I liked to use the touchscreen to not only focus but to shoot the pics, with this camera when I touch-shoot, the pics come out soft every time.Yes, the menus are pretty counter-intuitive, and sometimes quite long.  Sony NEX menus were the reason I waited so long to get into the NEX line.  With most cameras, I can find what I want in the menus without referring to the manual; with the NEX cameras, I find myself referring to the manuals or even asking for help on dpreview.com from time to time.One last thing that I found inconvenient is that I was able to work with the raw pics from the 5N in my existing raw programs, but not the 5R - its raw files wouldn't open in the program I use with my Canon and Panasonic cameras and with the 5N, so one must choose to buy a new raw program or use the supplied Sony software.But the thing I really don't like about my 5R is that it's always focusing, so if you focus a shot, it will refocus it. It's great for video, as it's quite responsive, but it's annoying shooting pics as there's no focus lock button.  And I wouldn't mind if there was a way to disable this feature, but there isn't - I wrote to Sony support and asked.As you can see by now, I have mixed feelings about my 5R.  The image quality is good, the videos are very nice, and it's the most comfortable camera I've ever held, not to mention the lightest removable lens camera I've owned.  The touchscreen is useful and touch focus works pretty well. But the menus could be better, the hybrid autofocus can't always lock onto things I'm taking pics of and the camera constantly re-focusing can be downright annoying.  Auto, scene modes and program work well, as do the useful more manual modes.  And I'm surprised that sweep panorama can be more than just a novelty, and is easy to use.  Would I buy this camera again?  Honestly I'd have kept the 5N or perhaps even my Panny G3, but the 5R is still a good camera with a lot to like about it; it's just maybe not the camera for me.", "Date": "March 22, 2013"}, {"Title": "Nice camera, but with flaws you should ideally know before buying", "Author": "Kartick Vaddadi", "ReviewID": "R4U7A7JEIEMNF", "Overall": "4.0", "Content": "I upgraded a few months back from a point-and-shoot to this camera. I like this camera on the whole, but it has some flaws you should know about.The autofocus is bad and takes blurry photos often enough. This happens particularly at night, but it messed up an afternoon indoor shot with the only light coming in from behind a curtain. While my 5-year-old point-and-shoot took a correctly focused, beautiful shot. This is so bad that I've learnt to manually focus while shooting at night.This camera supposedly has a hybrid contrast- and phase- detection autofocus system that's supposed to be better than the contrast-detection autofocus system used in point-and-shoots. But it only works with some lenses. So the bottom line from my point view is that the autofocus is terrible.Pay attention to the kit lens the camera is being sold with, if any. If it's the old 18-55 lens, you may want to buy it body-only and add a lens of your choosing, such as the more compact 16-50 power zoom, or the 18-200 lens, or the new 18-105 constant-aperture (F4) lens...There's no way to take an exposure-bracketed burst with a timer. This is important for night photography, where you need a timer to avoid camera shake caused by pressing the shutter button (even with a tripod). So you need to manually do exposure-bracketing.The touch-screen is terrible and not worth using. A $200 tablet has a better touch screen.Neither is the wifi, which once caused the camera to lock up so badly that even the power switch (the hardware switch, not the soft button) wouldn't work. I had to eject the battery and put it back in.The Android and iOS apps are terrible, too. They break basic expectations you think you have for a mobile app, even ones you didn't realize someone could screw up.Here's a review of the mobile apps:- Basic functionality such as shooting a burst, or shooting with exposure compensation, or manual focus, is missing. Other functionality like ISO is available, but on the camera, not the Android app.- This app requires a companion app to be installed on the camera. Some settings are there, and some are in the Android app. Both UIs are a train-wreck, worse than the native Sony camera UI (three different UIs!), which itself isn't a work of art compared to an average Android or iOS app. So, for example, if you normally want to a change a setting, like ISO, you'll find it in the menus. But when you're using the mobile app, the setting is not in the standard camera settings, but in the settings pane WITHIN the app on the camera, or the app on the phone. It's anybody's guess which of the two places will have what you want. Or neither.- The app sometimes locks up the camera so badly even the power switch doesn't work -- hardware switch, not a button. You have to remove the battery.- You can't record a video.- This app requires an account, and asks you go to a URL, which is broken.- When you find the correct URL, and fill out the form to create an account, it gives an error. I tried four times over a couple of weeks. Finally I had to claim I live in a different country from where I actually do, to create the account.These are all probably minor flaws with the camera, which is why I rated it four stars.If you are coming from an interchangeable lens camera, you may have higher expectations, in which case you should make sure everything you expect is supported here.", "Date": "December 1, 2013"}, {"Title": "Can't get my hands off it!", "Author": "F. Chan", "ReviewID": "R1JNYSASZDXPKC", "Overall": "5.0", "Content": "I am not a professional photographer... actually I use my iphone 4S to take most of my picture and I am still ok with it.however, when it comes to night/indoor picture, I have a problem. because I want to take the picture w/o flash. I had tried a couple point and shoot cameras (Sony, Nikon, Cannon etc) and they all failed.This one is great! I haven't try the manual mode yet, but just using the auto mode, you can already shoot beautiful indoor/low night picture. also, the screen can be turned 180 so you can take picture of yourself, which is a big plus for me.the only cons is the size/weight. of course it's not a P&S; so it is bigger. but It's a good trading off with the picture quality.", "Date": "January 12, 2013"}, {"Title": "Nice package", "Author": "Zahra Aminzare \"Zahra Aminzare\"", "ReviewID": "RJKYE82E5XTQ0", "Overall": "5.0", "Content": "I bought this camera $650 during black Friday. It took me some long time to decide between this and Nikon d5100. This one is supper light and easy to carry. The image quality may be not as good as d5100 but it is fairly good. I have enjoyed the wireless very much (you better have an iPad for that) but still I need some time to figure out all the capabilities. I have got some portrait BW photos and some of them turned out really nice.", "Date": "December 1, 2012"}, {"Title": "Mixed feelings about NEX-5R", "Author": "Nicole Stewart", "ReviewID": "R3Q0TS208XHLT", "Overall": "3.0", "Content": "I took the NEX-5R hiking with me yesterday and thought the shooting experience was a mixed bag. Here are my pros and cons:PROs:-Excellent image quality. Color, detail, and ISO performance are all first rate for an APS-C camera. Noise becomes noticeable at ISO3200 but even at that sensitivity, the noise is of the fine grain variety so it still looks halfway decent. Color performance does degrade a little as you get to ISO1600 and beyond but this is pretty typical for this class of camera.-Exposure is generally on the mark if skewing a little towards underexposure. Which I prefer to overexposure.-Dual dials for adjusting both aperture and exposure.-Autofocus performance is generally pretty good.-Shot to shot times are good.-Camera feels solid and well-made.CONS:-The LCD sucks on this camera. It's extremely reflective in sunlight even with the settings adjusted accordingly. This is a big faux-pais because, unless you buy the add-on viewfinder, it's all you have to compose a shot. By the time you got the add-on viewfinder, you could've paid the same amount for the NEX-6 which features one built-in.-The touch screen is of the resistive type rather than capacitive. It's good in a way because it prevents you from accidentally firing off a shot but at the same time, it just isn't as responsive as a capacitive touch screen.-Like other Sonys, I find the menu system needlessly complicated and feel it should be streamlined for access to commonly used shooting settings.Judged by its images (especially if you put a decent lens on it), the NEX-5R is an excellent imaging machine right up there with the best of the APS-C cameras. Whomever says that Sony can't compete with Canon and Nikon on image quality hasn't used any of their cameras as of late. However, the usability factor in the NEX-5R still lags behind the other cameras which takes some of the enjoyment away from the overall shooting experience. Unless you absolutely need the touch screen, I suggest spending the extra money on the NEX-6. It has the same excellent imaging performance but is more comfortable to shoot with, has that great built-in OLED EVF, a physical dial for changing shooting modes, and a built-in flash.", "Date": "June 14, 2013"}, {"Title": "Love the camera", "Author": "Michael D. Warren", "ReviewID": "R34L6J52C9T8SX", "Overall": "4.0", "Content": "I bought this camera, just before Christmas last year. I love the depth, and quality of the photos from this camera. The wifi was also a huge selling feature for me too.Reasons I didn't give it 5 stars:- The wifi only transfers using their software. It will not auto transfer my photos to a network drive, like other wifi devices can do.- Sony advertises features for the camera, which it doesn't actually come with. You have to purchase it. For example, time-lapse. It is a $10 app you have to buy, before you can use that function on your camera. Not TERRIBLY expensive, but considering the price of the camera, I think it should be included. It definitely should not be advertised, if it isn't included.Here's a link to the apps, and how much they cost: [...]", "Date": "April 2, 2013"}, {"Title": "best place to buy cameras", "Author": "LowClass Citizen", "ReviewID": "R2CFCLHBIS34LA", "Overall": "5.0", "Content": "I got it before time and everything was perfect. It came just how it was explained :) I'll buy here again", "Date": "April 30, 2013"}, {"Title": "GREAT DSLR ! Does everything in PERFECT way !", "Author": "FANI MARGARI \"THEOFANIA Glamour Enterprises LTD\"", "ReviewID": "RMX429NKGDZF7", "Overall": "5.0", "Content": "This a lesson from SONY to Canon and Nikon !PERFECT little camera !Focus pick and sensor are the TOP features for a cinematographer !", "Date": "April 25, 2013"}, {"Title": "Excellent Camera, not so much the lens", "Author": "Rafael Palma", "ReviewID": "R1FFSFZWPAQOTY", "Overall": "5.0", "Content": "My only complaints:The lens could be better.Should have an application to send photos by email.besides that everything else was excellent.", "Date": "December 28, 2012"}, {"Title": "DO NOT BUY FROM AMAZON", "Author": "sonyfan", "ReviewID": "R9LPLXWYWSAPY", "Overall": "5.0", "Content": "Nice camera, but all other stores give the 16mm lens free ( 16mm f/2.8 Wide-Angle LensModel Number: SEL16F28)  for buying this camera for same price, the 16mm lens is worth $248. So why buy from amazon where you pay same price for camera and do not get the 16 mm lens worth $248 that is given away free for buying from all other sony retailer stores including the sony store?", "Date": "January 22, 2013"}, {"Title": "Worth it!", "Author": "Zachary", "ReviewID": "R12YSZEDOB8Z2G", "Overall": "5.0", "Content": "It has a great and natural buff on your looking! The flip back screen is brilliant! Very helpful!  It sells 999 SGD in my places!", "Date": "July 29, 2013"}, {"Title": "Easy to use, satisfactory results, short battery life, shutter malf(x) that required repair on a new camera", "Author": "adam w", "ReviewID": "R2164LHA33LOGD", "Overall": "4.0", "Content": "I bought this to replace an almost 8 year old Olympus DSLR. Prior to that, I owned a film Canon SLR. So, I have a little bit of amateur level experience with SLRs and DSLRs.Uses: predominantly family photography with a couple attempts at more technical photos. I don't have time or interest to pixel peep and I am extremely unlikely to enlarge any shots more than 8x10 or some such.Positives: 1. Most importantly, it takes good shots of what i need it to take. Although i do know something about manual settings and i still use them at times, the intelligent auto and scene settings work for their intended purposes as well. I really bought this for the huge ISO range and the hand-held night settings. So, it can do what my previous two SLRs can and then has some new whiz bang gimmicks that are better than old cameras. Is that different from other choices available now? That is the real question i wished i could answer. 2. optics are as good as my previous cameras, probably better. 3. Wifi is actually useful for an amateur family photographer. Can share photos fairly rapidly with others. Yes, you need the apps to do this. 4. Not that hard to learn how to use. I do not find it difficult to navigate for the most part.Neutrals: 1. The photo editing software PlayMemories is limited and awkward. 2. It is not a pocket sized camera with the kit lense. the 16mm f2.8 primary enables it to be a pocket sized camera.Negative: 1. On several occasions, i have gotten an error message after the first shot after turning the camera on, saying i have to turn camera off then back on to continue. then, after about a month of use, the shutter wouldn't release anymore. i called sony customer support who eventually had me return the camera. i had to pay for shipping which isn't cheap and shouldn't have been necessary for a new camera. after about 3-4 weeks, they replaced the shutter and returned the camera. aside from the $20 shipping charge and time, this was all covered under the new camera warranty. so far, the error has not recurred. still, a dissatisfying experience with a new camera. since it malfunctioned within a month of routine use (i really didn't drop it or abuse it at all), it makes me wonder when will it break again? 2. Battery life is suprisingly short compared to my olympus dslr. Certainly won't last more than a full day of heavy shooting. I haven't used the flash bc of the wide iso abilities and scene options but even without that, the battery lasts maybe two to three days of routine use. Guess it is the 3 inch LCD. 3. transfer of images. I am not very tech savvy but I didn't have this problem previously. Whenever transferring images, it transfers all images left on the device regardless of duplication. The Olympus didn't do this. It is annoying to me to have select which date or images to transfer. I think it should do this on its own. Not sure if this is only the PlayMemories software or something else. I think something else.Aside from the malfunction in the shutter release of the camera i recieved, the negatives are probably somewhat minor compared to the most important feature - the photos and optics. However, other reviews have also commented on malfunctioning new cameras - poor quality control? this camera is not perfect and I'm not convinced there isn't something better out there. but, it does pretty well in amateur hands with the possiblity of going fully manual and with the 16mm f2.8 prime lens, it will fit in the pocket of my cargo pants comfortably with a telephoto lens in the other pocket - thereby making it truly portable, fairly complete camera system.", "Date": "June 9, 2013"}, {"Title": "nice cammer", "Author": "yaxizhong", "ReviewID": "R3UVCGL1WJTT19", "Overall": "5.0", "Content": "easy to carriy and best picture  the most wonderful gift for the summer and beach , buy it now ,", "Date": "July 10, 2013"}, {"Title": "Electronics Basket is evil. 3 months passed, they never returned my refund.", "Author": "Debbie J.", "ReviewID": "R2AVB56RTRIC3Z", "Overall": "1.0", "Content": "They never returned my refund. It's over 3 months now. Even after I've chased them to do it. another month later, still no refund at all.I rejected the shippment (because I found a cheaper option) and never touched the camera by the way.", "Date": "February 13, 2014"}, {"Title": "It's NOT a DSLR as many reviews say", "Author": "RobeGarza", "ReviewID": "RWXA2KY3C0866", "Overall": "4.0", "Content": "I had a Canon Rebel XSi DSLR, even though i am not a professional photographer (or even close to) i loved the camera and love playing with the manual functions... still, i was tired of travellig with it because of its size...so after reading a lot of reviews from wired and many other companies saying the mirrorless cameras are going to dissapear the DSLR i decided and sold my canon to trade it for a Sony NEX-5RK/S... i havent used it more than 3 days and have not travelled with it yet but:*****- The Size is better than expected, when i opened the case i though i was grabbing only the lens when i realized it was the whole thing, so this aspect was way better than expected.- The pictures and the functions are preety cool and you can do a lot of stuff like select color and stuff.- the wifi sharing part is very cool but as many reviews say its slow and clumsy... but i still love transfering the pictures in high quality to my iphone***- ITS NOT a DSLR: our first impression was great, but our insctinct was to grab the camera and use the intelligent plus mode, Sony says this is the \"for dummies\" mode, it will take the pictures, fix brightness and color and make it preety for you,BUT ITS SLOOOOWWWWWWW, compared to a DSLR...yes the moment i started taking pictures with this mode i had to wait for full seconds before taking the next picture, which led me to start using the other modes...the aperture and speed modes are very cool, and the fact of seeing how will the picture be before taking the picture is cool, but its still not a DSLR...- THE FEEL is more of a digital camera than that of a DSLR, when you take the pictures you kind of hear a digital shutter and not a mechanical one, so from here it kind of makes a lot of stuff psychological...my conclussion would be: if you are moving from a DSLR try the mirrorless first... i would say it is a very cool digital camera rather than a very small DSLR...THE DSLR is still better, it takes better pictures, its faster, but this has a lot of functions the DSLR wont give you...I WOULD BUY IT AGAIN, but i would probablly not sell my DSLR for it...oh and by the way the camera is very very preety! and it takes very good pictures and video, IT IS a good camera, but i though it was going to be more of a DSLR than of a digital camera", "Date": "July 2, 2013"}, {"Title": "Sony NEX-5R Excellent but I suspect it was shipped as  Used (open box) instead of new?", "Author": "Chetan Shirol", "ReviewID": "R14XSHOETO176G", "Overall": "1.0", "Content": "Firstly when I ordered, the product description said camera with 2 lenses (18-55mm and 55-210mm) but I got only one and later me and Amazon realized that it was description issue  and Amazon fixed in their website. That's fine for me. (But Amazon didn't honor the as described product, instead they asked me to ship it back!).Second, once I opened I realized a shocking experience - all the components instead the Sony box looked like already used or open box or returned product and Amazon simply sent it to me! Shocking.Sony factory box was not SONY sealed and never looked like fresh and new.AC adapter was not in plastic wrap instead it was some where inside the box (that is simply impossible for Sony to pack product that way).All the other components like shoulder strap, wrap around the lens looked like already opened for sure.I request Sony (if they are reading) to provide some or other way to customers to know if it already registered (used) or fresh new purchase (by product serial number or through online registration or some how?) . I am fine if Amazon told as used inspected instead of selling it as new Condition. I am really worried of purchasing electronics like this online and feel better to go to in store since I can see on the spot - verify factory seal and inside component etc.", "Date": "January 5, 2013"}, {"Title": "Totally Different Operation from Other Sony's or DSLR's I Have Used.", "Author": "William Evins", "ReviewID": "RKACIEZ3DA9IQ", "Overall": "1.0", "Content": "I have used electronic SLR cameras since the 1970's, basically since electronic SLR's came out. My latest before this one is a Sony HX100V.  For the life of me I cannot figure out how to operate the NEX. I was expecting something similar to the 6 or more electronic SLRs I have owed and used in the past. The NEX is totally perplexing. The instructions are not that great also. But the hardest part is getting used to a totally new unique non-intuitive operating procedure. If you have never used a DSLR go for this one. You may be able to figure it out, maybe.", "Date": "October 9, 2013"}, {"Title": "O Audio, Audio - Wherefore Art Thou, Audio?", "Author": "UFO6", "ReviewID": "R85IRV6G1FML6", "Overall": "3.0", "Content": "I realize at the outset that as a generalized complaint rather than a user review, this is likely to fail tragically in getting all of those (apparently) coveted \"helpful\" votes, and a great big \"tsk\" to that.  This is a kind of festering catharsis that's long overdue, something all camera manufacturers desperately need to hear - something I wish I could shout from the mountaintops with the aid of the latest, greatest, cutting-edge high-tech Vogon-Ultra-Quadraphonic loudspeaker system this part of the universe has ever heard, with a special array of Vogonish imagery intensifiers and \"alliterative residulators,\" directing the crux of the complaint straight at every one of those major camera manufacturers:=> Where is this camera's AUDIO spec information? <=There are twenty-eight(28) paragraphs listed above, a veritable blizzard of leading-edge-technology features on this camera, but not a word, not a whisper, not a solitary peep, about microphones, microphone jacks, or audio capture specs of any kind.  Zero. Zippo. Nada. Rien. Zilch.The standard retort one typically hears, slithering down the noses of the pompous within the photography clique, goes something like this:  \"Well - ahem! - if you're so concerned about video recordings with good audio, then go buy a video camera!\"Survey SEZ?  Gronnk!  Sorry, wrong answer.Here's the deal:Some of us want both HD video and HD still photography from a compact camera that will fit in your pocket.  A dedicated video camera does not fit in a standard-issue pocket, and is not suited for quality still photography.  And... a combination of both HD video and HD still photography is the very thing that's being advertised here, which means: yes, manufacturers are indeed selling both HD video and HD still photography in the same compact camera, and that's why we're all here. D'OH!So it's better than a decade into the 21st century and nearly a decade since HDTV became a common household product.  We are fast approaching **a full century** since the last silent movies gave way to talkies.  If you are capturing video with garbage audio, then in essence what you're doing is creating:  a silent movie.If you are boasting... how do they put it... \"HD Movies in your choice of super-smooth 60p, standard 60i or cinematic 24p, all at Full HD 1920x1080 resolution,\" as a prominently-advertised feature of your camera (a feature people like me consider to be half of the draw to the product,) you as a manufacturer have ipso facto accepted the responsibility of providing what you've advertised **in its every significant aspect.**  Audio is a significant - nay, indispensible - aspect of any kind of video recording in any context.  Unless you're going to try being Fritz Lang or Mel Brooks.  Every time you record.Forget all of that mind-boggling esoterica like signal-to-noise ratio or frequency response.  We know absolutely nothing about whether this camera even has a jack for external microphones (the best possible audio option.)  We do not even know what kind of microphone this camera has - or even IF it has one.  Presumably it's got at least one?  It's as if audio has suddenly ceased to exist within the human condition, and nobody has noticed.  Huh?Let me hasten to add here that this is no particular slam against Sony.  A cursory check of comparable cameras from all major manufacturers will yield the exact same omission. I just happen to be looking at the Sony NEX line just now, and am stymied once again in my effort to find a camera.As someone who a.) is sitting on an older camera which has similar HD video capability but audio quality so horrid it's entirely useless, and who b.) is therefore in the market for a replacement, this industry-wide \"audio oblivion\" is intensely frustrating.  It's also keeping my camera-budget money in my pocket rather than where it would otherwise be: in the revenue columns of accountants who work for camera manufacturers like Sony.  And that is just intensely short-sighted and foolish, IMO.So here I sit, patiently waiting for a tone-deaf industry to finally catch up to its customers and to the other half of the technology they're ostensibly selling.  Maybe I should go to Vegas and take odds on the number of years it will take before we see this no-brainer at last arrive on the compact camera market.", "Date": "January 22, 2013"}, {"Title": "Don't know", "Author": "Rod McGarrie", "ReviewID": "RJZ3RYE9TGFCP", "Overall": "3.0", "Content": "camera received with a black body and silver lense.....appeared someone had switched the lense out. It was advertised with a bag and disc which did not come with the camera or later. Camera was retruned to seller for a refund.", "Date": "January 8, 2013"}, {"Title": "Disappointment", "Author": "puocwsw", "ReviewID": "R3BHAG4CDDDSBD", "Overall": "2.0", "Content": "We bought the SONY NEX-4RK for Christmas and started having problems the first day.  The error became progressively worse until we could take only one picture before having to reboot the camera.  So now we send the camera in for warranty work, and instead of replacing it, SONY is going to cobble together a camera from parts on hand in the hope the next one will work.  SONY's service (turn-around and quality) is extremely disappointing.", "Date": "January 26, 2013"}, {"Title": "another return", "Author": "rj45", "ReviewID": "R2VRHH9V0L7TWN", "Overall": "2.0", "Content": "I first got the sony nex first gen about two years ago, returned it due to soft pictures, and I held off on the sony nex 5N due to video clicking issues reported.  Now with this 3rd gen of sony nex 5R, I figured things will be fixed by now and it's the perfect camera.  The sony nex 5R is a really beautifully designed camera externally and loaded with features.  Unfortunately, it's going back to the store.Here's why:1) body feels way too plasticy, though the metallic kit lens feels solid; while the grip is improved over the 5/5N, it still feels a bit awkward to me, handle too smooth; a rubberized grip like Nikon will be much better.2) you can't attach a flash and a view finder at the same time, though not a big problem for me, may be for some folks, and the view finder is like 350 usd3) great tilt screen, but the claim about 180 degree rotation is flawed, you can only tilt about 110 degrees if you got the flash attached4) love the cute little flash, but it comes off loose fairly easily; I prefer this over a built in flash cuz it is raised higher from the body; I wish it could tilt all the way up 90 degrees or more5) at 750usd for nex 5R, the body and lens are made in Thailand, only the battery is made in Japan6) the real deal break is I can't get any decent pictures on this thing without the flash; pictures simply lack color saturation and crispness;  I took close to 100 shots with nex 5R randomly inside my living room, only about 1/3 of the pics were clear; then I created similar random shots with my old p&s; Nikon S8100; the Nikon produced more good shots, and equal if not better clarity.  I also don't like how the nex 5R defocus the background on some shots when in Auto mode.7) the extra lens are expensive, and limited compared to Nikon/Canon SLR lens; using anything other sony lens means using an adapter, and losing auto focus which is just not acceptable to me; if I'm going to pay for the high price expensive lens, I want the max out of it, which means the autofocus.buying a new camera these days is crap shoot at best; quality assurance is not there. sony is like apple in cameras; great looking design and slick and innovative, but unfortunately too pricey for me, and enough flaws to be unacceptable.  for the price, I rather go for a real SLR, maybe Nikon D3200.", "Date": "November 15, 2012"}, {"Title": "Missing the flas light.", "Author": "Netiva", "ReviewID": "R1ZMML9SRFT695", "Overall": "3.0", "Content": "Camera is fine but the flash light was never received and was mentioned on the package to be included. I cannot therefore use the camera in the dark.please, send me another one. Thanks:)", "Date": "February 6, 2013"}, {"Title": "Interesting, full of bells and whistles, Image just average.", "Author": "Frank C", "ReviewID": "R3BDM98YIVTCW8", "Overall": "3.0", "Content": "Maybe I'm just old fashion, but this camera came short on image quality, the G15 is better at half the price.  For $1100 (including average lens) there are many other cameras with better image quality.  If you are going for the convenience/geeky features, then this camera is great and leads the pack by a long shot.  The phone interface is great!  To me that fact remains, a camera should take good pictures first,else I just get a Galaxy 4 at 12 MP, already includes a lot of the same toy features for no money.IMHO if you want good pictures get a real SLR.  Entry level consumers should be happy with it, considering that most people seldom print larger than 8X10 in anyway, they will never notice the shortcomings of this baby. Sony is banking on that, I'm sure.", "Date": "March 28, 2013"}, {"Title": "complicated to operate", "Author": "Craig G Buehler", "ReviewID": "R4ZTKPJMQY89G", "Overall": "2.0", "Content": "Not real easy to use as you need a background in photography. I'd stick to some simpler models if you're not a photo-head.", "Date": "June 4, 2013"}, {"Title": "Product seems to be good but customer service is is sub par", "Author": "Hari", "ReviewID": "R2UMVI9IJ383FA", "Overall": "2.0", "Content": "I ordered this camera two days back but made a mistake of not choosing the color I wanted. I know it is not a big deal but I would expect that I have the ability to change my order before it is shipped. I contacted the customer care on the same day and was told that the order is 'Ready for Shipment' and cannot be modified. After two days, it still has not been shipped and is probably sitting at the their warehouse but they are not willing to do anything to accommodate my request. I was told that my only option is to return the product and that I would have to shoulder the shipping cost. When I am buying a $700 product, I would expect that a multinational organization like Sony would try to help me out with my situation especially when the product is still in their hands.I do apologize for not having a product review in here but I feel that the quality of customer service is as important as that of the product itself.", "Date": "January 2, 2013"}, {"Title": "This or NEW Version", "Author": "Tnker", "ReviewID": "R8TFE4KCXTEHR", "Overall": "3.0", "Content": "Well first of all this is a great camera. Good color sat and fast shutter times, with its low cost now this will do fine for those that go out and take family photos , however if you need some thing better than I would go with the latest model. I will say tho that this model is still a great deal for the price and the pics are still amazing for the family", "Date": "November 1, 2012"}], "ProductInfo": {"Price": "$1,099.99", "Features": "DSLR-quality in about half the size and weight\n16 MP APS-C sensor with fast up to 10 fps shooting speed\nFast Hybrid AF includes phase-detection for DSLR-like focus\nFull HD movie shooting at 60p/24p with full exposure control\nincludes 55-210MM zoom lens", "Name": "Sony  NEX5RK/B2BDL NEX5RK 16.1 MP Compact System Camera  with 3-Inch LCD (Black) and 55-210mm Lens Bundle", "ImgURL": "http://ecx.images-amazon.com/images/I/41Xpp9Cc4HL._SX300_.jpg", "ProductID": "B00AB4I5W0"}}