{"Reviews": [{"Title": "Great value for an underwater camera!", "Author": "Eric Slay", "ReviewID": "R1N8IBJWTL1UYV", "Overall": "4.0", "Content": "It's a great time to be in the market for underwater cameras. Because so many people have good cell phone cameras, camera manufacturers have had to step up their game and offer point-and-shoots with more functionality than the phones that everybody already has in their pockets. Underwater/shock-proof/dust-proof/freeze-proof cameras are for those times when we're having fun in environments that would typically ruin a regular camera or phone.Here's what I like about this camera in general:1. You can take it in the pool. Last summer, some of my best shots were of my kids underwater in our swimming pool. We have so many great memories of our pool, but until we got an underwater camera, we didn't have these captured. Another thing that we've really enjoyed is the ability to take video underwater. For fun, I get in the pool, have the kids dive in and then swim up to me while I video the whole thing. There's something really amazing about starting a video above the water with all the sound and water reflections and then going under when they break through the water and hear the muted underwater sounds as they swim up to me. More importantly, the smiles on their faces are bigger/more authentic than when we're just standing in the back yard and I ask them to smile.2. You can bring it to the beach and just throw it in the sand. When my kids are at the beach, we like to build huge sand castles. In the past I have brought my non-sandproof camera and spent most of the time a)protecting the camera from flying sand; and b)getting angry with my kids for flinging the sand in the direction of the camera. Now, I actually get in the line-of-fire as they're digging because the flying sand in the foreground makes for some great pictures.To sum it up, the best camera for the job is always the one you have with you. If you're scared your camera is going to get wet, sandy, or freeze, you'll leave it at home where it won't do you any good. With this Fujifilm FinePix XP60, you'll have *no worries*---As far as this type of rugged camera goes, I have owned Canons, Nikons, and Olymupus' offerings. Currently, my favorite of all is the Olympus TG-1iHS 12 MP Waterproof Digital Camera with 4x Optical Zoom  (you can see my review there as well) (*also note there is also a new model for this, which is here: Olympus Stylus TG-2 iHS Digital Camera with 4x Optical Zoom and 3-Inch LCD (Red))This Fuji proudly sits in second place in my opinion. That being said, it is also nearly $200 less than my beloved Olympus, so it is definitely a great value.Here's some specifics:The camera is built well. It's sturdy and has a solid feel. BUT, the biggest selling point for it's build-quality may be it's biggest problem for some: it's pretty small - like the size of two iPhones pressed together. This is great because you can just throw it in your pocket or purse and it won't take up much room. The problem this presents is that the buttons on it are pretty small, which will mean you might press the wrong buttons once in a while, especially when using it underwater. I'm an average size guy and it didn't offer me too much trouble, but if you're larger-than-average, you might want to look elsewhere.The photo quality is great. The pictures look good in and out of the water. Because I only use it for messy, sandy, watery situations, I can't report on how good it does indoors or in extreme low-light situations.There are a ton of features, and many of them are useful. In fact, it shares many of the features with the Fujifilm X20 Silver 12 Digital Camera with 2.8-Inch LCD (Silver). If you check my review there, you'll see that I love:SR is an advance auto mode that determines the best settings based on the scene. It even shows its predictions, so you can see if it is accurately assessing the situation. From my experience, it's startlingly accurate. It chooses from: landscape, night, tripod, beach, sunset, snow, sky, greenery, and sky & greenery. Having these settings on a camera is old news, but having the camera predict the scene itself and do so with great accuracy is a pretty exciting advancement.Also, there is a NATURAL setting which I love. What it does is takes one picture with flash and one without continuously and then let's you decide later which worked best in the situtation. Being a pro photographer, I am usually pretty good at choosing, but this is really helpful to my wife. Let me give you an example: If you're taking pictures in a darkened room of your child blowing out their birthday candles, your camera is going to choose flash to lighten things up. The problem with this is that it kills all the beautiful candle light. Using the natural-mode on the camera will give you both. It's actually a great learning tool.As far as video quality goes, this camera does a great job with that as well. Don't expect it to look like and HD movie you've rented from Nexflix, but you can expect it to capture great detail that your phone just can't see.--In conclusion, I think this is an excellent choice for a rugged underwater camera. Buying this (or another model) to capture the fun you have this summer is a no-brainer. The pictures you get will be priceless before you know it....If you found this review helpful, let me know! If there are any questions you'd like answered, I'll do my best to help. Have fun!", "Date": "May 25, 2013"}, {"Title": "Fujifilm FinePix XP60 16 MP Digital Camera / MUST READ ! !", "Author": "partyoffive", "ReviewID": "R5LASEGU9O2GH", "Overall": "5.0", "Content": "After doing plenty of research on underwater cameras at this price level. I came to the conclusion that this is the best camera for the price.  PEOPLE,..its an underwater camera,..not a $400 SLR professional camera. ITS best pics are outside and underwater. Expect good pictures at night with the flash at about 10ft of distance,..nothing more. But if I wanted this,..I would not have been using an underwater camera..... HELLO ???My galaxy S3 phone takes great HD pics and video so I am comparing this review using my phone and the camera. I have an underwater case for my phone and the pics and video are truly HD and awesome. So this little camera had its work cut out for it since I bought it. I thought there would be now way that it could come close to my phone pics and video. I was wrong !PICTURES: Great high resolution pics even with an 8GB class 4 SDHC card, above and under the water. Love the fact you can take video and shoot pics at the same time. Screen brightness blows my phone away. I can barely see my phone under direct sunlight, but this camera has great brightness and can easily be seen under direct sunlight. Love the burst shot mode ! !VIDEOS...........VERY IMPORTANT......YOU NEED A CLASS 10 SD CARD TO RECORD HD 1080I VIDEOS. I bought my camera as a bundle at COSTCO which brought me the 8GB SDHC card CLASS 4. DO NOT USE THIS CARD FOR YOUR VIDEOS. A CLASS 4 CARD DOES NOT SUPPORT 1080I VIDEO WELL. IT WILL RECORD IT BUT THE QUALITY WILL REALLY LACK. TRUST ME.  I have tried it with both the class 4 and the class 10 cards. Also,..I did research on these cards. The class 10 records perfect 1080i video like my galaxy S3. Some people don't know this and notice that their videos are not great. Its not the camera,..its the card !So many features that I have yet to learn on this camera. This camera does some things that my Nikon L820 doesn't do. The floating strap is a must if your planning to take it in the ocean. It holds the camera and does not let it sink. Over all. I definitely recommend this camera. I do strongly suggest you buy an external battery charger on ebay or amazon so that you can charge your battery outside the camera. While charging the battery you have to use the provided USB charge cable which means you have to open the battery door and leave it dangling while the battery charges in the camera. This leaves the battery door at somewhat of a dangerous open position and subject to breaking. Overall, this camera does what its supposed to do. Period !", "Date": "August 5, 2013"}, {"Title": "Great camera. With Limitations.", "Author": "Otaku Guru", "ReviewID": "RQLOPR4MXXFI", "Overall": "4.0", "Content": "I have a problem. I buy cameras like every year to every other year. I do have valid reasons for upgrading. Trying to find the perfect camera for the use. For me, this is my cruising camera. I needed something that can go deeper. That I can use on a boss excursions (think a scooter and sub combined), snorkling, and free diving while under water. I need an underwater camera that can take great underwater pictures and video and not have it look all green or blurry. I needed something with an optical zoom rather than digital only. I got this little baby on ebay for $140 with case, underwater strap, and a 8gb sd card. For the price I paid it is worth it. This camera is neat, but there are some minor flaws as well as pluses. I still think you can do better on underwater cameras, but even the nikon aw100 that is similar priced has nearly the same flaws. I think it has more to do with limitations with it being an underwater camera and the glass they use.This camera is waterproof. It goes down to 20 feet. Although their are cameras that go deeper, why spend $300 on one. Even the ones that go 30-36 feet are not universal. I almost bought one since I like to scuba dive, but that's rare and only on select cruises since I am not certified. Scuba diving you will go 30-60 feet underwater with a discover class. If you go deeper than 30 feet you risk your camera. Why get a $300 camera when it may not even work for basic scuba diving. I know the depth varies on where you go, but it helped know that the $300 still may not be able to go that deep for scuba. Boss you go down about 12 feet and this camera can easily do that. It is about 8 feet to the top of the helmet. I haven't tested this camera in deep water. Just the bath tub. It stayed sealed and the pictures were pretty good for underwater, but that's not a great test. I know from the videos on youtube with the xp50 the underwater pictures and video are superb. They rank right next to $300 underwater cameras. For me, this is an underwater and on water use camera only.This camera has some great pictures modes like 3d, panorama, selective color, underwater, landscape, etc. The auto in general is great, but you will need to go to picture mode underwater for the best under water pics. I talked with fuji about that since I was going to try staying in auto on trips.One thing I like about this camera is like my slr, you can snap pictures while recording video. Great for family functions. Just know you will hear clicks on the video from the shutter.I have a caribbean cruise coming in March. I wanted to use this on the trip exclusively since most of the excursions are on or around water. Problem is, the picture quality is somewhat lacking. Not awful. When you zoom in on the pictures they get fuzzy really quick. The picture quality zoomed in is the worst I've seen on any of my recent cameras in the past 5 years. The good news is this is a 16mp camera so unless you are making a movie size poster, when will stretch it past 100%? I messed with settings and if you lower the picture quality to 12mp or 14mp the picture quality greatly improves. You still get big pictures, but zooming in they look better by shrinking them slightly. I guess the sensor they used is not ready for prime time. Or better yet, maybe a firmware update will fix it. Within the settings you want to change your pictures to \"fine\" instead of the default standard. It gives a little more detail. Because of the picture quality, I'm going to use my budget pocket point and shoot. That way my slr is safe on the waves and only break out the xp60 for in the water pictures. Also, because of the picture quality issue, make sure you zoom in while taking pictures rather than trying to edit them on your computer. That way you get the best pictures. I'm not saying the pictures are that bad. Without being resized they look great. Let's say you want an 8x10. That is shrinking the image by a good half. When you shrink down the image while printing you get just as good if not better picture quality. For most people that's great. Just if you don't plan ahead on what you will print and use something like photoshop to zoom in you start to see a bit a blurring at around 120%. Unless you use photoshop or need to blow up a small 1/8th chuck of your photo you will never have a problem. This camera doesn't do great in low light. It loses a lot of detail. Avoid using at night in the house or when there's not a lot of light in the room. Outdoors it is great though.This is a really snappy camera and fun to use. Underwater this camera is the bomb. I love how the latch clicks into place and you should be sealed against water. Just watch the strap doesn't keep the door unlocked. Be careful handing this to others while in water. That latch looks like a camera knob and the last thing you want is someone popping out your battery under water and frying the camera. The latch has to be turned and the middle button pushed in to unlock it, so it does make it harder to accidently open the camera. For kids, this is a great and versatile camera. However, if you are cruising you are better off using a point and shoot as much as you can and using this camera where it is risky like around water. Even a nice underwater camera like from Nikon has image quality issues when zoomed in. I think it has a lot to do with the glass they use to protect the lenses. For 95% of the people out there you won't blow up the images before you print. With it being able to handle 16mp or even with my recommended 14mp to address picture quality issues you have more than enough mp to print what you need. In the end this is the best budget underwater camera I've found. Awesome snorkeling pictures and video. Land pictures are very good, but know you are limited in zoom.Personally, I would only recommend this camera for kids that need a camera that can take a beating or using this around extreme outdoors. For general indoor and sight seeing by land you want to keep your existing camera that probably has better zoom, better in low light, and hopefully better picture quality when blown up on the computer.", "Date": "April 22, 2013"}, {"Title": "Leaked on vacation", "Author": "ts", "ReviewID": "ROTFLSIGG7FOZ", "Overall": "2.0", "Content": "Ordered camera for a trip to Mexico. Received a few days before and used to photograph some of the flooding here in CO (in the rain), and on a quick hiking trip in the mountains (dry). Was happy with the picture quality. To get clear/well lit photos just play with the pre-set modes until you've learned what is best for different situations. On the trip I was generally happy with the photo quality- the LCD screen was hard to see underwater, and it had a hard time in low lit situations, but overall good enough considering how much fun it was to use it on the beach.  The camera seemed to be doing fine and I was meticulously following the instructions in the manual after every ocean or pool use (rinsing, soaking, drying, etc). However, on day 3 of my vacation I took it snorkeling. When I came out, it would not turn on. I rinsed, dried, etc. when i got back to my room. The lens, LCD screen, and flash all fogged up. I let it dry according to directions. Nothing. Even when returning to dry, not-humid CO the camera never would dry out/work again or charge. Very disappointing as i was only halfway through my trip. If you plan on using this in the rain, want something that can survive an accidental dunking, or wade on the beach (but not swim) this camera would probably be fine. If you plan on submerging it I would not recommend. Returned mine yesterday and will look at other brands.", "Date": "October 2, 2013"}, {"Title": "Considering the price I'm very happy.", "Author": "J. Donaldson \"Cal-diver\"", "ReviewID": "R2EGTRABVA99GT", "Overall": "4.0", "Content": "August 22, 2013 UpdateWe are having a lot of fun with the XP60. We take it on the boat, to the beach, in the spa, and the local city pool. It's just great to put the floating wrist strap on my, or my grandson's, wrist and snap away when we feel the desire. I don't have to worry about bumping it, or getting it wet.As long as I keep the camera locked on ISO 100 we do get some decent photos. I also have taken some reasonable video. This one is jerky because I was driving a jet ski with one hand and taking the video with my left hand. [...]June 18, 2013 UpdateWe've now used this little camera extensively since it arrived. We've taken perhaps 500 photos with it. Here are my recent observations.The photo quality is not the best and the camera sometimes makes poor exposure decisions. Many photos come out of focus. Some of this is operator error, especially the focus issues. There is quite a lag between pushing the shutter button and the photo being captured so it is easy to push the button then lower the camera before the shot is capturee. Even with the ISO fixed at 100 the image quality isn't really great.I would say about 95% of the photos are properly exposed, and 75% are in focus.All of these comments must be taken in the context that I am a photo enthusiast and I usually am using a $650 camera body with an $850 lens. With that camera rarely is a shot out of focus and almost never improperly exposed. Of course the image quality from the DSLR is exceptional. The DSLR also has near zero shutter delay.On the other hand...I really like that this camera is hardy and waterproof. For the first time I was able to take a camera on the tow tube and take photos of the boat from there. It is so nice to hand the camera to anyone and ask them to take shots or video. I'm quite at ease having it move from place to place on the boat and not worry that it is going to get damaged.One of the big benefits is my three-year-old grandson likes using it and I'm happy to let him. 98% of his shots are trash but the other 2% are worthy of posting. As someone on Facebook said they are finally able to see me in photos.I no longer have to worry about using my iPod Touch on the boat, or don't have to bring the expensive DSLR along on the boat either.In the right conditions the camera does spit out some good photos, most are worthy of posting online which is my main use for photos most times. Videos are not bad either.Would I recommend this camera? Yes with the understanding that it is inexpensive and the waterproof feature is the biggest benefit.I have two other inexpensive (but more expensive than the XP60) and I spent some time comparing the image quality of those two cameras against the XP60.Sony W50 6MP camera (not waterproof) images were of lower quality than this XP60. This made me feel like I'd made the correct decision because with a waterproof housing the Sony W50 has been my on water camera for several years.Sone w150 8.1MP camera (not waterproof) images were almost identical to the XP60.Original ReviewI have a consumer level DSLR for great photos. I needed something for the boat/jet ski. I'm not always comfortable with the DSLR on the boat. This one fills the bill.I have to put all of my comments in the context that this camera costs about 1/10th the price of my DSLR. Obviously there is no way the photo quality, low light capability, or sharpness can match an expensive DSLR with a great lens. But for a waterproof point-n-shoot under $200 this is a pretty good camera.Pros:- Small and pocketable- Rugged to 5 foot drop, I can hand this one to my 3-year-old grandson.- Waterproof to 20 feet.- 5X zoom, one of the main things that attracted me to this camera.- Pretty good image quality for outdoor shots (considering it is an inexpensive point-n-shoot)- Zoom during video - there are many cameras on the market that can't do this trick- Auto focus during video - there are many cameras on the market, including a whole bunch of very expensive DSLRs that can't do this.- Quiet zoom so you don't hear it on the videos- Take snapshots during video - very cool feature that I wish was available on my DSLR.- Good menu system- Dedicated video button- 10 frames per second (up to 10 max)- 1080i video at 60 frames per second- Totally internal zoom. Nothing protrudes from the camera body.- Can use the camera while it is plugged into AC or another power source. (I have an external USB battery pack that can charge/power the camera)- Too many other features to mention in detail here here. I mean really, face detection, several movie modes, several shooting modes, numerous scene modes (sports, low light, HDR, portrait, landscape, filters, panorama, night, and more), Auto ISO ranges, various image sizes, white balance options, continuous shooting, shutter volume, exposure compensation, self timer, etc.- The front glass that covers the lens resists water droplets. Very cool.- AF illuminator to focus in the dark.- Uses a standard USB cable to charge.- The AF Illuminator lamp doubles as a charge lamp.- Micro HDMI connector- Printed help manual included- CD full help manual includedCons:- Some grain even at 100 ISO but outdoor shots don't show it until you crop 100%- More grain than you'd like at higher ISO- Not so good low light capability- Wrist strap slide/keeper slides too easily- Battery can be inserted backwards - dumb design fault.- No viewfinder. I said I wouldn't buy a camera without a viewfinder but this was just too good and cheap to pass up. I still think it needs a viewfinder for bright sunlight situations.- Snapshots during video are not the best quality- I wish the lens was in the middle of the face of the camera. It's too easy to get fingers in the photos (much like my iPod Touch)- No smile shutter option, but I've never used that feature on my other cameras anyway.- The \"standard\" USB cable is a type with a very small connector on the camera end. None of the dozens of USB cables I already have would fit.- No external battery charger supplied but for this price I didn't expect one. I ordered the $19.99 Wasabi Power charger with 2 extra batteries on Amazon.- Clunky manual 3D images - but I don't care because I'm not a 3D proponent.I will post a few photos I took today.I did take the camera into the spa this afternoon. I didn't let it stay underwater too long because I was afraid it might overheat. It worked great in both single photo mode and in video mode. It was great to play with the camera, look it over, and check all the menu options, without worrying that it was getting wet. I won't be using this at 20' depths but it will certainly get wet on our boat or jet ski.I did not buy this camera from Amazon, my favorite store, it was on sale elsewhere.", "Date": "June 13, 2013"}, {"Title": "Don't Buy a Fujifilm Camera!", "Author": "Lloy A. Keeling", "ReviewID": "RGE1F2EYBL9NU", "Overall": "1.0", "Content": "I purchased a Fujifilm X60 and used it three times before it failed.  The camera was not abused, dropped, or.used underwater.  It simply stopped working and would not turn on.  I returned the camera to Fujifilm per their instructions and was surprised and dismayed to receive an invoice for $117.00 to repair what they termed an out-of warranty problem, stating that the HDMI pins were bent.  I HAD NOT connected this camera to an HDMI cable!  How the pins became \"bent\" is a mystery to me.  I emailed the details to customer service with no response other than a message to say the email was received.  I then called the repair department and asked to speak to a supervisor and was transferred to voice mail.  After leaving two messages, I received NO response at all.  This has to be the poorest customer service I have ever experienced.  No reputable company should treat their customers with such disrespect.  Needless to say, I will not purchase from Fujifilm again.", "Date": "January 6, 2014"}, {"Title": "Good Camera, Terrible Support", "Author": "Steven M Cygan", "ReviewID": "RSEIXP4NM5S3X", "Overall": "2.0", "Content": "I got this on sale for $150 and at that price you really can't beat the number of features in a waterproof camera.  My main problem is that the HDMI port wouldn't accept a cable (I verified the cable works on other ports), it looked like there was an extra piece of metal or something in there.For some reason I actually paid attention to the bundled notice to send it in for repair rather than just returning it.  They informed me that my warranty was void because of damage to the USB port.  First of all, the USB port works just fine, short of pouring glue in it, I wouldn't know how to damage it even if I wanted to.  After arguing with their customer support several times about why they were refusing to fix a defect (this was not damage, it was present from the moment I opened the box), I finally gave up and returned it.  It seems clear to me that the repair technicians are instructed to find any possible reason to avoid honoring the warranty.", "Date": "October 2, 2013"}, {"Title": "Value Camera Performer", "Author": "W. L. Holder", "ReviewID": "R2LIAXT1VR9UO8", "Overall": "5.0", "Content": "This is a nice camera.  It is durable, waterproof to shallow depths, and takes excellent photos.The photos are excellent, particularly with the image stabilization.  Unlike so many others, you can actually zoom in on a subject without camera shake ruining most of the photos.  The burst mode works well too, though it takes a while to save afterward.  The panaramic option in burst is really cool, allowing you to easily take panaramic shots by sweeping accross a landscape while in burst mode.The video quality is surprisingly excellent as well, particularly the sound.  This camera could easily replace a mid-level camcorder for most uses.There is an option to sysc the camera to directly upload to your preferred social media, though I admit not trying this out as I have no desire to do upload photos that way.The camera is waterproof to 20 feet, which would be great for swimming pools and basic snorkeling, though I wouldnt recommend for SCUBA as that depth is too easily passed.  I have tested this in the pool and the river, it takes great photos and stays completely waterproof.Fujifilm claims the camera is shockproof to 5 feet, though I did not feel compelled to drop it from 5 feet to test this.  Ill take their word on it and report back if my kids ever knock it off the counter or something.Overall, this is an amazing camera for the price.  To top it off, it even comes with a \"real\" memory card so you dont have to immediately run out and buy a bigger one.", "Date": "June 17, 2013"}, {"Title": "Broke my 2nd one, already", "Author": "Michael P. Furey \"Michael Furey\"", "ReviewID": "R4Z0RSNT9H4J4", "Overall": "1.0", "Content": "I've just killed my 2nd example of this Fuji camera in three years.  The first one died after I dropped it on the kitchen floor.  I expect breakage from a regular camera, but this one claims to be shock proof.  So, I bought another one because it took good pictures, especially underwater in the pool and at the beach.  The second Fuji is on its second summer but it's on borrowed time.  The view screen permanently shows a huge black hole in the lower right corner.  If I jump into the pool with my kids with the camera strapped to my wrist, the screen shows pink and green horizontal lines and will not take a picture. I have to take out the battery and memory card and let the camera spend a day sitting in the sun to dry out.  I don't think I'm terribly abusive to this camera but it just doesn't seem to hold up to my expectations of a camera intended to be part of an active, outdoor lifestyle.  As soon as I find another sale at Target, Amazon or Costco for the Olympus TG-630 (regular price is $180 and sale price is $120) I'll try the Olympus because it gets much better reviews.", "Date": "August 15, 2013"}, {"Title": "Not great but not bad either", "Author": "Happy r/c", "ReviewID": "R2RJH9DXW5NTNT", "Overall": "3.0", "Content": "PROS:- I went diving in Florida up to 20 feet underwater and it did stayed dry thanks to the awesome dial that you have to turn to close the door tightly.- Good underwater photos- 9 out of 10 high def videos played back fine on my pc.- The floating strap- I was not afraid to bring it with me to the beach in sand and saltwater.- Amazing 5X optical zoom in a little camera, although when I was underwater, taking shots at 5X zoom was very difficult to get the subject in the screen so I mostly shot zoomed out.  The Amazing 5X optical zoom was better used for when I was standing on the beach and shooting.CONS:- Video is saved in Quicktime .MOV format so when I tried to stream it from my pc with TVersity software to my Microsoft XBOX, it would not play.- When I played the video on my pc, one of the 10 videos played back in slow motion even though I did not do that.- Kind of weird that both photos and movies are saved in the photo folder on the memory card instead of separate folders (photo and video) like my SONY and PANASONIC cameras.SUMMARY:I would prefer the videos in AVCHD format like my SONY and PANSONIC cameras.  In the meantime, to stream from my pc using TVersity software, I'll have to convert Quicktime to AVCHD format using Sony Vegas Movie Studio HD.6/25 update: I installed a different codec for TVersity and now the Quicktime format plays (but it looks horrible like the days of standard analog tv) but my other zillion movies in AVCHD format stopped working. I guess I have to keep searching for a codec that plays all formats.", "Date": "June 12, 2013"}, {"Title": "Very Disappointed", "Author": "Captain Jim", "ReviewID": "R1NEJPPLTOMJKT", "Overall": "1.0", "Content": "This camera did everything it said it would for about 2 months. Now it won't take a charge, even with a brand new battery. I have tried everything but it still won't turn on, nothing lights up. I'll never buy another Fujifilm camera again.", "Date": "December 17, 2013"}, {"Title": "Poor image quality, poor LCD display, rest is fine", "Author": "david", "ReviewID": "R1PGBGQ3DPWYAJ", "Overall": "2.0", "Content": "I bought this camera at Best Buy and returned it after a week.In users' reviews, when you read \"It does great pictures\", \"great high resolution pics\", \"great photos and videos\", remember that's very subjective. I worked in a photo lab, and I had many customers telling me that the quality of the pictures from their single-use camera was great. But it was not, not great compared to the picture you'd get from an average camera. But people were happy with them.For this camera and any other cameras, do a bit a research and google for reviews on specialized sites. You'll see some sample pictures. For the XP60, picture quality is poor, really. There is a lot of noise, even at ISO 100 and pictures are really lacking of details. Yes, it may not bother you when looking at a screen resolution, but you'll notice on prints, and if you crop the picture.[update]  I uploaded a customer image for this product showing a crop at 100% zoom: http://www.amazon.com/gp/customer-media/permalink/mo2WXJBWOTHMDHO/B00ATM1M92Do yourself a favor and compare the picture quality of the XP60 with other cameras. For instance google \"ephotozine xp60\" and you can see full size test images.The other big issue is the quality of the display. The resolution is significantly lower than other cameras. In 2013 a 2.7-inch LCD display with a resolution 230k dots is definitely a big disadvantages versus the competitors. Viewing angle is pretty bad as well. This means that underwater depending on the conditions, you can't really see what you're shooting. You need to be just in front of the display, if you're a little above, you won't see correctly the picture, and with the poor resolution, it doesn't help.Apart from these two issues (which for me were the reason why I returned it) the camera is nice. It's fast, you can quickly turn it the camera on and take a picture. Some camera have some delay that will make you miss pictures. I had no issues with water leaking or other water issues. I believe that Fuji have now a lot of experience in underwater cameras and if you're operating it correctly you won't have issues using it underwater.The video mode is nice (although I'm not the right person to judge video quality). An issue I found with Video is as soon as you zoom a little, it struggles a lot to find the focus.You you need to know about these two issues (picture quality and LCD quality) before making your choice. If that's not an issue for you that's a great camera. But for me picture quality is the most important thing about a camera, that's the reason why I put only two stars.For the same price range, have a look at the Olympus TG-620 Tough iHS Waterproof Digital Camera (Blue) with Case and Float Strap. Picture quality is night and day, the display is 3 inch and 460k dots. It's 12 megapixels. Believe it or not, on small cameras like this, it's better to have 12M than 16M because the sensor has more light sensibility and on these cameras, the real resolution bottleneck is the lens.Other options is looking at older version of the Fuji XP, cheaper, with less megapixels and better picture quality (especially the noise). You can get a GPS version for the same price (if it's useful for you).", "Date": "August 15, 2013"}, {"Title": "Junk Camera", "Author": "Jefferson Bagley", "ReviewID": "R3NS4PGAAP55JM", "Overall": "1.0", "Content": "Camera died after only 5 months. Fujifilm refused to honor warranty. I will never buy a Fujifilm product again. Olympus cameras last forever!", "Date": "December 10, 2013"}, {"Title": "It's OK", "Author": "Book Guy", "ReviewID": "R1X1171YAIU8IG", "Overall": "3.0", "Content": "I purchased this camera to compliment my Cannon SLR. Let me just say my SLR has me spoiled and this thing is not even in the same league as my $700 SLR, but that's ok.  I bought this because I wanted to take pictures in situations where using my SLR could be dangerous (rain, pool, beach, dirty environments) and wanted a smaller camera that I could fit in my pocket easily.  Having gone through multiple digital cameras due to water damage, dust, dirt, etc. I decided a waterproof one was needed.First the good, this camera is at home underwater, the pictures it takes are just amazing.  I've take it to the beach and on snorkeling trips and it constantly surprises me with the quality of the pictures.  It also takes really good pictures in daylight and/or in bright conditions it can almost match the quality I see in my SLR pics in these conditions.Now the bad, throw in shadows or a darker environment and this camera has no clue what to do.  Turning on face tracking seems to make it better but it doesn't fix it entirely.  I don't think the software in this camera is up to the task of recognizing the environmental conditions and adjusting the hardware accordingly.  Often times when taking pictures in medium to low light conditions I have to pick the scene selection manually and/or switch to plain auto mode to get a decent picture.Video on this camera is ok, I haven't played it on my digital TV yet so I couldn't comment on its quality yet.Overall if you want a tough little outdoor point and shoot, its a good camera.  It is not suited to all conditions and I wouldn't recommend getting this as your sole camera over a normal point and shoot.", "Date": "August 20, 2013"}, {"Title": "Rugged, User Friendly, High Resolution, Lousy Zoom", "Author": "Kyle Slayzar", "ReviewID": "R2EBNVKOUR663D", "Overall": "4.0", "Content": "I do a lot of photography and video work whether it be making instructional videos for the class I teach online (US Military History) or just enjoy seeing what the world has to offer via vacationing.  I have a small fleet of cameras at my disposal including two GoPro Hero 2s, a Canon Vixia, an old Sony Cybershot we won't bring up again, and am thinking about getting a Canon DSLR for more professional shots albeit my skills being anything but.The only other thing I do not have is a single-shot ruggedized camera.  While I have my GoPros, I use them almost exclusively for mounting shots on anything that does not require an operator such as vehicles, helmets, and, in one instance, mounting them on the rifles of ND Guardsman.  I needed something for quick, single-shots on the go in environments that I wouldn't risk expensive cameras on, hence the need for something a little more ruggedized.When I had the opportunity to review the Fujifilm XP60, I already had some tasks in mind to try it out and, so far after almost a month of testing, it's still operating in new condition.The first test I put it through was working in the rain.  During the last month, here in Bismarck ND, it has been raining a LOT more than usual with the occasional thunderstorm.  I also have a North American Robin's Nest recently built above my home's gas fireplace exhaust.  Upon receiving the camera, the mother Robin had just laid her eggs and this gave me the perfect opportunity to track the progress of the nest from the laying of the eggs to birth, adolescence, and eventual departure from the nest.  In the rain, and sometimes the thunderstorms, I ventured outside, kept a safe distance from the nest as to not disturb the mother, lifted the camera above my head to get the lens at the perfect angle, and took shots of the nest.I am happy to say that I got some amazing pictures of the baby Robins from birth to their leaving the nest last week (after an unfortunate misunderstanding when my mother came over to see them and ignored my warnings to keep a few yards back and got dive-bombed), and the XP60 is still in great working condition.  To explain just how rainy it was, at one point we were under a severe thunderstorm warning and, despite that, I was out taking pictures of the mother Robin keeping the babies warm and, while I was soaking wet necessitating several beach towels be utilized to dry me off, the camera was equally soaked but remained operable.To test the picture quality I then had the pictures professionally printed (don't have a printer yet, at least, not a good one worthy of 16 mexapixel) and sent to my room mate's parents, who requested them during their stay here last month.  Even on 8 1/2 x 11 glossy prints none of us could tell a reasonable difference between mine and those of a 35mm print.The XP60 sports 16 megapixels and that is amazing, especially for those of us who thought 4.6 megapixels were amazing back in 2001 and had not bought a digital camera since 2008 (the evil Sony Cybershot that I still have).  I am not a professional photographer despite having some field experience (IE: filming US Army field training, mountain climbing, hiking on non-designated trails, etc.) so I cannot comment on the image quality of the XP60 versus say a higher end DSLR (which, I'm trying to get into) but I was deeply impressed with the overall picture quality of the XP60.  My family certainly appreciated the glossy prints of the Robin's nest I took and my Grandma is considering rendering them into watercolor format in her studio as she is a professional painter.However, even with the rugged durability and the fantastic picture quality, what really impressed me was the user-friendly interface.One test that I always employ to measure how user-friendly anything is that I hand them to the least technologically savvy person I know and have them conduct tasks with them without ANY instruction to see how long it takes them to figure it out.  Fortunately, as stated earlier, my room mate's parents were in town and, to illustrate their level of techophobia, his mother was still rocking a 14 year-old Nokia 3310 cellphone that was lauded for having \"rare\" features like the game Snake and a working calculator.  I remember having to explain what iTunes was (\"An evil program that will crush your soul but do it efficiently.\").  My room mate did not have a digital camera and asked to borrow my new XP60 so I tossed his mother the camera and asked her to turn it on and take a picture of me, then promptly delete it not to test her but because I'm as photogenic as Julia Robert's ex-husband.To my surprise, she was able to complete the task within two minutes.  Her biggest obstacle was finding the review button, but that took all of 30 seconds as she simply utilized Holmesian deduction in deducting what buttons were NOT the review button.  The button interface is easy enough to figure out and so is the actual software interface.  Imagine what we users could do if we utilized the nerd mantra of \"RTFM\" (\"Read The Flippin' Manual!\")!!My only complaint about the XP60 is the lacking zoom lens.  While it's 5x optical zoom is slightly larger than the industry average of 2-3x, it still makes the XP60 little more than an in-your-face or right-in-front camera.  However, after reading my comments on the XP60, it isn't designed for such medium to longer-range endeavors; it's an everyday camera intended for outdoor durability.  It's a summer camera designed for your average, everyday American, whose only camera experience ranges from children's parties to that summer road trip that turns out to be anything but enjoyable (\"Are we there yet?\").The XP60 will make a great addition to my fleet of cameras, especially as I prep for an anime convention this month in Minneapolis and will hand it off to my partner, who only takes pictures with his iPhone 4.  Oh, the horror!", "Date": "June 12, 2013"}, {"Title": "Does not work.  Fujifilm does not stand behind this camera", "Author": "regularperson", "ReviewID": "R293CIQ67MGYOQ", "Overall": "1.0", "Content": "The Finepix took poor pictures.  But we tolerated that for the waterproof/shockproof features.  Then it completely stopped working and we sought warranty coverage.  Other reviewers described this issue -  Fujifilm claimed \"the customer damaged HDMI pins.  Damage not covered under warranty.\"  Fujifilm said that to us as well.  I explained we had never used the HDMI.  Fujifilm said the consumer must have accidentally used the USB in the HDMI port and damaged the pins.  I said I had looked before we sent it and the HDMI pins were fine.  Fujifilm said \"we used a microscope and could see damage that caused the pin to short circuit the entire board\".  A microscope to disallow damage on a shockproof camera?  Fujifilm knows there is a problem with this camera, but its policy is to refuse to honor the warranty.  Fujifilm partially admits there is a problem because they will offer to send you a new camera with an extra batter at 1/2 price ($60).  If the consumer is fully at fault, then why offer such a steep discount?  Instead I will use that money to buy a good camera from and honest company.  If you buy the finepix, do not expect good pictures, do not expect the camera to work for long and do not expect Fujifilm to honor the warranty.", "Date": "April 22, 2014"}, {"Title": "Sporty, waterproof, and shockproof camera.", "Author": "D. Chou \"THE Savvy Consumer\"", "ReviewID": "R1WNC5BLEHCTTB", "Overall": "4.0", "Content": "My family and I enjoy the great outdoors so we were glad to try out this Fujifilm FinePix XP60.  What we've noticed after using it a few weeks:Likes:>Waterproof to 20ft/6m.  Perfect for pictures/videos at the beach, by the river, or in the pool.>Shockproof at 5ft/1.5m.  Prevents permanent damage from minor mishaps.>Nice 2.7\" LCD screen for shooting and viewing pictures/videos.>Easy to start up: insert the battery and SDHC memory card into the waterproof compartment, charge it, and it's ready to roll!>Simple set up: turn on camera, set language and time, and start shooting pictures or videos.  Additional cameras settings are simple using the easy to navigate menu.>No worries about taking pictures in the rain or accidentally dropping it in a shallow fountain or pool.>Freeze proof to 14°F/-10°C for our trips to Alaska and Northern Canada.>5x optical zoom and 10x digital zoom to capture faraway scenery.>High Speed Burst Mode for taking pictures in rapid succession (9 fps) to freeze/capture action scenes at the exact moment that I want.>Advanced filter modes for different colors/effects.>Advanced 3D viewer and static picture mode that allows 3D picture printing by Fujifilm.  (Will try that feature soon).>Handy, optional Surf Camera Case provides hands free operation when swimming, shallow snorkeling, surfing, paddle boarding, and boogie boarding, etc.>We've gotten at least five hours of use when only taking static pictures.  Battery life shortens noticeably when taking HD videos (1920x1080 @ 60fps) at the highest resolutions to about two to three hours (a much larger memory card will be needed).>We use the intelligent SR (Scene Recognition) Auto mode that lets the camera automatically select the optimal settings for easy point and shoot.Slight Dislikes:>Printed manual only covers the basics.  One needs to use the owner's manual on the FinePix CD to learn about the more advanced features.>No carrying case.  We had to purchase a neoprene waterproof case separately.>Shockproof rubber borders mainly around the LCD so that still leave some plastic case edges vulnerable to damage.>Very short USB-micro USB charging/data cable: only 23\".  Awkward when charging or transferring data.>Wall adapter only for the charging cable.  No battery wall charger included.>*NO SDHC memory card included in standard retail version!*. Fujifilm was kind enough to provide reviewers with a 4GB SDHC card, enough memory only for taking static pictures or very short duration/low res. videos.  We've immediately upgraded to a 32GB SDHC for taking more pics and videos.>LCD screen is still susceptible to scratches like all cameras so I applied a more water resistant clear screen protector that will stay in place.>Similar to most waterproof sports cameras by design, this XP60 doesn't have an automatic lens cover so the large front camera lens is susceptible to fingerprints, dusts, debris, and scratches.  *Camera lens must be cleaned off frequently for clear, bright pictures!*>Construction, materials (mostly plastic and rubberized plastic required for most waterproof cameras), and tactile feedback of the buttons don't feel as high quality as my Canon Powershots (mostly metal/alloy).>Pictures and videos are very nice and sharp but the colors somehow don't seem as \"natural\" as my Canon Powershot cameras.  Most likely because we've been using Canon cameras for many years.  Strictly subjective.Overall:A sporty, versatile, waterproof, and shockproof camera with all the latest camera technologies and features that should fulfill the needs of most consumers especially adventurous travelers who enjoy water sports.  Long term durability and water/shock resistance remains to be seen.", "Date": "June 2, 2013"}, {"Title": "Underwater Fun", "Author": "Evan Jacobs", "ReviewID": "R2NSZKAVFFSG9E", "Overall": "5.0", "Content": "OK, I received this camera and was excited to try it out.  After installing the battery and charging it I found that the camera wouldn't turn on.  Nothing.  Very odd.  After some investigation I discovered that, unlike just about every other digital camera I've ever owned, you CAN install the battery upside down.  This means nothing works, of course.  This is a profound design error but once I flipped the battery around, all was well.  The camera is more stylish than my Panasonic Lumix TS4 Waterproof Digital Camera although it's slightly larger.  I much prefer the locking mechanism for Fuji's battery door.  The specs on the Panasonic's waterproof and shockproof are about double the Fuji but neither is really suitable to scuba anyway.  The Fuji picture quality is excellent and there's a burst mode that is very cool.  The Panasonic's lens goes just a touch wider than the Fuji but not enough to make a difference.If you enjoy time around water, the beach, river, swimming pools, etc this is a great camera to have.", "Date": "July 4, 2013"}, {"Title": "Great camera", "Author": "jody h young", "ReviewID": "R2J5ZNXJXH73AE", "Overall": "5.0", "Content": "Bought camera for a trip to Florida. Used it for snorkeling, swimming with dolphins, and just goofing around in the pool. Pics turned out clear. Just what I was hoping for!", "Date": "June 18, 2013"}, {"Title": "Great camera!", "Author": "annahull", "ReviewID": "RDDFOKWPKFZDA", "Overall": "5.0", "Content": "Used this camera for underwater shots during snorkeling in Bahamas. Really is waterproof and no problems. Very happy with this camera.", "Date": "June 15, 2013"}, {"Title": "Shock proof??? Not really...", "Author": "Renato A Martins", "ReviewID": "R17ALUFPCTLMID", "Overall": "1.0", "Content": "Got this camera as a gift for my mom, since she had a stroke and sometimes let's things fall from her hand. Unfortunately, didn't buy it from Amazon, but instead, from a physical Target store. First few days of use, she is sitting side-by-side with a friend, and hands over the camera to her friend. It slips from her hand and falls on the floor (it was not even 2 feet-high, they were sitting!!!). Result, camera doesn't work anymore, gives a \"zoom error\" or a similar message, and won't focus anything.Ah, right, and couldn't even test its underwater resistance.As I don't live in US, the camera is not covered on the warranty here... In summary, burned 160 bucks...Certainly won't go for Fuji cameras again. I've read good reviews on the shock/waterproof Panasonic Lumix. Will give it a try.", "Date": "October 3, 2013"}, {"Title": "One of the worst customer service and repair department doing business today!!!!", "Author": "Jorge", "ReviewID": "R120UN4SVNFZLY", "Overall": "1.0", "Content": "I copied this review from another person because is exactly what happen to me. Their customer service department is one of the worst I have ever dealt with. I left 6 phone messages for the manager and he did not return any. Beware if anything goes wrong with the camera Fuji Repair will try to get you to paid for it. This is the review: \" The Finepix took poor pictures. But we tolerated that for the waterproof/shockproof features. Then it completely stopped working and we sought warranty coverage. Other reviewers described this issue - Fujifilm claimed \"the customer damaged HDMI pins. Damage not covered under warranty.\" Fujifilm said that to us as well. I explained we had never used the HDMI. Fujifilm said the consumer must have accidentally used the USB in the HDMI port and damaged the pins. I said I had looked before we sent it and the HDMI pins were fine. Fujifilm said \"we used a microscope and could see damage that caused the pin to short circuit the entire board\". A microscope to disallow damage on a shockproof camera? Fujifilm knows there is a problem with this camera, but its policy is to refuse to honor the warranty. Fujifilm partially admits there is a problem because they will offer to send you a new camera with an extra batter at 1/2 price ($60). If the consumer is fully at fault, then why offer such a steep discount? Instead I will use that money to buy a good camera from and honest company. If you buy the finepix, do not expect good pictures, do not expect the camera to work for long and do not expect Fujifilm to honor the warranty\".", "Date": "May 8, 2014"}, {"Title": "Terrible camera! Do not buy!", "Author": "fiala", "ReviewID": "R16F9L7VLXEBKM", "Overall": "1.0", "Content": "This is a terrible camera! The pictures were never clear from the start. We took this as the primary camera on a cruise. It worked (kind of) on the first few days. On the third island we went snorkeling. Halfway through our snorkeling, the camera started recording video on it's own and then flipping through menus continuously. I tried taking out the battery and putting it back in, but that did not help. Water did not get in the battery And SD compartment, but it was leaking out of the buttons on the camera. We tried leaving the camera out and open for 24 hours, but that did not help either. I was not able to take the pictures on the last half of my cruise because of this camera. I'm very disappointed.", "Date": "April 1, 2014"}, {"Title": "John T", "Author": "Bonnie Tromans", "ReviewID": "RROQVVDFQP07A", "Overall": "1.0", "Content": "I had the same experience as did Mr Richard Fan.  Camera failed in the third use and when I sent it back to Fuji they claimed that I damaged the HDMI port.  I have never used this port!  That must be Fuji's standard ploy to avoid warranty repairs.  I took about 80 pictures and that comes out to $2 a picture.  This camera is not worth the box it comes in.  I will never buy a Fuji product again.", "Date": "March 18, 2014"}, {"Title": "The best camera I ever had!!!!", "Author": "Felipe Antonio Amaya, M. D.", "ReviewID": "R2I0VJENRB1IFQ", "Overall": "5.0", "Content": "I love this camera so much that I have put a nail on the wall & keep looking @ it often to make sure that it hasn't walked.  I was accidentally introduced to the ruggedness & power of this camera as I was taking pictures from my bathroom window on a second floor of my cousin on the first floor.  Somehow I lost my grip & this camera fell.  I was distraught as my two day old camera had just dropped from the second floor.  I rushed down stairs and to my surprised, my camera was totally functional, including the flash, & it didn't even have a scratch on its paint coat.The next day I went & bought another one.  Now I am happy with two.The quality of the pictures is just amazing & the flexibility to alter them to your taste will leave you extremely satisfied.", "Date": "February 27, 2014"}, {"Title": "depends on your needs", "Author": "C. Walker", "ReviewID": "RULFL7LI2W4BU", "Overall": "3.0", "Content": "If you want a camera that is SPECIFICALLY for outdoor use, this is a great choice. If you need a camera to take on your mountain biking trip or while surfing, this tough and inexpensive camera is what you want.But that toughness comes at the price of photo quality. Indoor shots are very disappointing. This camera does not focus well indoors without the flash on, even in extremely large, light rooms. And the flash is harsh and washes colors out. To get a halfway decent indoors photo you have to fuss with the manual settings far longer than a small child is willing to sit still.Get this camera if you're going on an adventure trip. But don't expect great photos on Christmas morning in the living room.", "Date": "February 4, 2014"}, {"Title": "SO so", "Author": "dave smith", "ReviewID": "R1KTGZ7IZAFA77", "Overall": "2.0", "Content": "My phone takes better pics and is much faster and always in my pocket....however I like the waterproof and shockproof idea....should have come with a memory card", "Date": "December 27, 2013"}, {"Title": "Poor HD movie format.", "Author": "Nevermore", "ReviewID": "RV50AJ5IRWM4F", "Overall": "2.0", "Content": "This is a reasonably good camera for the money in many ways, it unfortunately has one glaring technical oversight. The HD movies this camera creates instead of being in a normal 1080p/30 format are in a 1080i/60 format! For the most part interlaced movie formats have been obsolete for years. What this means is that if you wish to use these movies for anything other than basic playback where most media players will automatically de-interlace the format, then you will have to convert them using software such as handbrake to a standard format first. This is a time consuming tedious step which should be completely unnecessary. If you forget to do this first, then despite what's your project looks like on your screen while playing, you'll find that when you export it to the final product it becomes a complete mess of interlaced lines. It's too bad, because in most other ways this camera has performed admirably for the price point and I would have given it four stars. However a bizarre and incompatible movie format is simply unacceptable at this point in camera development.", "Date": "November 11, 2013"}, {"Title": "Great camera for the price", "Author": "T. Wortham", "ReviewID": "R2AB550POVDO6V", "Overall": "5.0", "Content": "After comparing this with the XP170 (with wi-fi), I decided on this camera because of the photo options ( 12 options vs 4 option on the XP170).  I bought it for my son and we used it on a recent trip and it took great pictures.  I had my Canon Rebel on the trip also but rarely took it out of the case, as this one was so convenient to use.  I didn't want to take my Canon to the beach so this one went with us and we didn't worry about it getting sand or water on it.  My son tested the underwater capabilities and the pictures were good and there were no leaks.  Overall, it's a good camera for the options and the price.", "Date": "September 7, 2013"}, {"Title": "Great Camera, Reliable Underwater Performance", "Author": "J. Perkins", "ReviewID": "R2V1J3OM1JZFSN", "Overall": "4.0", "Content": "Instead of repeating the specs aptly described by other reviewers and the product description above, I will focus on my general experience with this camera and a few features that stood out to me.  Overall, I think this is a great camera.  I have bought several different digital cameras recently for family members (Sony Cybershot, Kodak EasyShare), even another rugged underwater camera for my young son (a Panasonic Lumix TS20).  This camera certainly compares favorably with all of them.The camera takes great quality photos.  It has a multitude of features and modes.  The menu is easy to navigate, easier than other digital cameras that I've had.  In particular, I used the burst mode to catch the kids in action or at least the exact moment when they are both looking at the camera and smiling at the same time and not distracted or fighting with each other.  Natural and With Flash Mode is useful too, taking 2 photos one after another, one with and one without flash, so you can select the best result in any particular situation.Video recording works great.  It operates using a separate, dedicated button so you don't have to go into the menu.  So you can take a photo, then push a button to record a short video, push the video button again to stop recording, and go right back to taking pictures.  I used this to great effect at my daughter's last softball game to take some still shots, and then get some videos of her at-bat and running the bases.A couple of modes that I played around with, but did not get good or expected results were the panorama and 3D mode.  With 3D mode, to be honest, I have no idea what I was doing or getting with that mode.  It probably is just me.  With panorama mode, you get the option of 120, 180, or 360 degrees.  On vacation at the beach I experimented with this mode, but even using 120 and 180 I could not get an accurate panoramic photo of the length of the beach.Can you actually use this camera underwater and get decent results?  Yes.  To prepare the camera for underwater use, simply check the seals on the battery door to make sure they are clean and in good shape.  Select the underwater shooting mode, and you are ready to shoot.  Within an hour of using underwater, rinse the camera off under running water or soak in a bowl of water for 10 minutes, then dry it off with a towel and let air dry for a little while.I actually was so pleased with the normal everyday performance of this camera that I really did not want to risk using it underwater in case it did not perform well and was damaged.  Fortunately, there have been no problems or leaks when used underwater.  We have used it twice at pools to take underwater photos with the kids, which was a lot of fun.  Overall, I am very pleased with this camera so far and highly recommend it.", "Date": "June 26, 2013"}, {"Title": "Great for camping!", "Author": "STybring", "ReviewID": "R3TGOKXIP05H7P", "Overall": "5.0", "Content": "Took it canoeing and camping for a long weekend and it was great. I took an extra battery just in case but did not need it. No performance issues whatsoever and the features were fun! I upgraded my memory card and it took very fast shots", "Date": "April 25, 2013"}, {"Title": "Are you kidding me?!", "Author": "Ramon Lopez", "ReviewID": "R1LUMEL4TCH5IO", "Overall": "5.0", "Content": "I bought this little gem for my family's vacation to St. John's in the Virgin Islands mainly because I wanted underwater photos while snorkeling with the kids and I didn't want my Sony NEX anywhere near the sand. Well, guess what??? My Sony stayed at the resort and we toted this little camera everywhere-pool, beach, ocean....First, let me say that this camera is WELL worth the small investment in terms of capturing an expensive vacation. It took beautiful pics, great underwater photos and video that really surprised me! The photo quality is not perfect, but for less than $200 - you can't go wrong.I bought the camera as a bundle that included a floating wrist strap, so this camera floats if lost at sea (or pool).The video was a bit fast, but the camera withstood mild abuse and diving to about 15 ft....I didn't push it past it's tasted limits.I thought the video was bad when I downloaded directly to my ipad, but it turned out to be Apple's video codec. Downloading to a standard PC proved it worked as advertised.In short - buy this camera without hesitation if you want good underwater photos and video. I gave it 5 stars not for the photo quality alone, but for the entire package. You won't be disappointed :)", "Date": "July 14, 2013"}, {"Title": "problem not covered by warranty", "Author": "kristen crouch", "ReviewID": "R33RS86VKVI15G", "Overall": "1.0", "Content": "My daughter received this as a Christmas gift. We wanted something that was water and drop proof.  I don't know of anything happening to it, but within 2 months it wouldn't charge or turn on.  We sent it in only for them to tell us the issue wasn't covered and would cost $100 in labor to fix.  We were very disappointed in the customer service and will not buy another Fuji camera.", "Date": "April 30, 2014"}, {"Title": "Great underwater pics!", "Author": "Jess in Cali", "ReviewID": "R2J6ADB3EK9RU8", "Overall": "5.0", "Content": "We took this camera to Belize and used it everywhere from underwater, to the beach, to the jungle.  It held up fabulously on the entire trip.We followed the directions, rinsed it off after use underwater, and had no problems!!Great value for the money :)", "Date": "March 1, 2014"}, {"Title": "Very satisfied", "Author": "JAMES NEILL", "ReviewID": "R394XIXNTWL6L9", "Overall": "5.0", "Content": "Camera takes excellent pictures. I haven't used it under water but have been using it on the beach in Mexico. You can see the viewfinder in the bright sunlight.  I am very satisfied.", "Date": "February 23, 2014"}, {"Title": "Great second camera", "Author": "Charles G Martin", "ReviewID": "RS1Z9IZG6NE3K", "Overall": "4.0", "Content": "I purchased the XP60 as a secondary camera. Of particular interest was the fact that it is water proof ,shock and dust proof. The shock proof part was tested early on. I took a tumble on some ice and the camera dropped out on my pocket. It works just fine. This camera has an amazing amount of features that make prefect for a glove box camera, or for time when you don't want to pack a DLSR.", "Date": "February 19, 2014"}, {"Title": "Great camera", "Author": "Ryan J", "ReviewID": "RR7MZFG4H6SWI", "Overall": "5.0", "Content": "Bought this camera for an anniversary trip.  Last time we were at a resort we missed a lot of pictures because we didn't have a waterproof camera.  This time we got tons of great pictures by the pool.  Camera turns on fast and takes pictures fast so you don't miss the action.  Love the mode where it takes multiple pictures as long as you keep the button down.  Got some great shots of jumping into the pool.  Very happy with the camera and the quality of pictures.", "Date": "February 6, 2014"}, {"Title": "Great underwater camera!", "Author": "A. tan \"ALT\"", "ReviewID": "R3792MJ2KWHS8R", "Overall": "3.0", "Content": "Pros:-Underwater (yes tested this in a pool and worked fine)-Stylish looks.-Long Lasting battery.Cons:-Poor image quality even my cellphone takes better pictures.-Bad light balance. It takes too long to balance pictures usually comes out very illuminatedYes I tried everything on the best or finest options and even tried to manually adjust the light settings. For the price I cant complain and would reccomend it.", "Date": "February 3, 2014"}, {"Title": "Sb", "Author": "Sb", "ReviewID": "R2R1HSI0GKAGO7", "Overall": "5.0", "Content": "We took the camera to Belize for our two week vacation. I snorkeled multiple times and it took amazing videos and pictures. IMO this camera was worth every penny! I also purchased a 32 gig ultra scandisc. After 600+ photos and more than an hours worth of snorkeling videos the camera was still taking perfect pictures!", "Date": "January 16, 2014"}, {"Title": "Good Value Camera!", "Author": "Masayuki Shimizu", "ReviewID": "R85DKNRW4Y9WJ", "Overall": "4.0", "Content": "I use this camera for mainly taking pictures at beaches or underwater. I have a canon DSLR and Sony point & shoot for regular uses. The picture quality might be not as good as my canon or sony for standard uses. I do not recommend this product for your main camera. As a waterproof/shockproof camera, this camera is great value. You can take nice pictures or videos underwater. Few minor complains are that there is a fair amount of time lag between when you push the shutter button and when the camera actually capture the image. I see a fish in the center of LCD and press a shutter button. The fish is often out of flame in captured images, or you capture the tail of fish in the image. Also, the shutter speed is not fast that some images of fast moving fishes come blurry. I think you need good practice before you can take good underwater images.", "Date": "November 25, 2013"}, {"Title": "Great features but phone like picture quality, often out of focus", "Author": "Skelshy", "ReviewID": "R3K16069Z0BBCX", "Overall": "2.0", "Content": "We got this because previous camera failed and we wanted one we could take to the beach without having to worry about sand and splashes. Taking it snorkeling was a big bonus.Starts up fast, pretty communicative, on screen help and such. Usually focuses fast. We liked all the colors it comes in. Panorama mode, HDR, image stabilization, the works. Inexpensive for the features.After a day at the beach, we had trouble opening the battery compartment because sand had gotten into the locking mechanism. Fortunately we had a safety pin at hand to clear out the sand otherwise we'd been unable to charge the battery.Pictures were really disappointing, low contrast, dull colors, often slightly blurry. It's about as good as the better phones. The closest camera to compare is the one we had three cameras ago, a $100 Canon A series. That Canon took much better pictures, even with a cheap third party waterproof housing. Currently our other camera is an S90. The S90 of course takes better pictures, but it also costs twice as much. Let's be realistic - a waterproof camera is a compromise. Moving parts (zoom) have to be internal and you probably only get a plastic, flat front lens. What's expected is a camera that reliably takes pictures for Facebook use where we can't take other cameras. Because, hey, if you have no camera with you because you are afraid it might get damaged, you get no pictures at all.In this light, this camera doesn't quite do the trick. Even for Facebook use, the pictures are very soft and visibly washed out. Taking pictures under water, a lot of shots were missed because the camera would not focus at all. when it did, most were a grey-brown blur. I realize underwater photography is tricky, and results can be mixed. But we've simply seen much better results from other cameras. My wife, who isn't a pixel peeper at all, didn't like the camera either and decided to return it.There is no orientation sensor, this means you can't upload pictures directly, you have to sort through them and manually rotate. Other cameras do this automatically, and it can be a substantial time-sink.", "Date": "August 4, 2013"}, {"Title": "Ho Hum", "Author": "Michael J. Murphy", "ReviewID": "R8KB28I67WQ6P", "Overall": "2.0", "Content": "I used the camera for the first time last weekend.  I have no idea what I did from picture to picture, but one picture will look fantastic and the next picture (taken 2 minutes later) will look blurred.  These point and shoot camera's are pretty easy to use and I'm well-aware of how the focus works.  That's not the problem.  The problem is that picture quality is inconsistent.Perhaps I'll find some dum-dum mode that makes it all work all the time, but I'm a little disappointed.  It should come pre-set in dum-dum mode.", "Date": "July 23, 2013"}, {"Title": "BEWARE: Proprietary USB cable", "Author": "E. Hoffman", "ReviewID": "R1309N0U9E0QM5", "Overall": "2.0", "Content": "I received this camera for my birthday and though I haven't tested it thoroughly yet, I'm giving it a review of 2 stars because it uses a proprietary USB cable.  It doesn't appear you can buy this cable from Fuji.  There are 3rd party \"compatible\" cables for sale on Amazon, and Fuji makes a standalone battery charger (model BC-45W), but as it ships you're stuck with just the cable.  I have lots of Micro USB and Mini USB cables around my house so it's really frustrating when companies make products that don't adhere to the standards.  One of the selling points for this camera was the price, but if it ends up requiring the purchase of a $30 battery charger it negates that somewhat.For what it's worth, the interface seems easy to use.  The pictures quality looks OK, but I mostly wanted this for an upcoming vacation so I can take underwater pics.  When that happens I'll update the review.", "Date": "February 13, 2014"}, {"Title": "GREAT camera", "Author": "Cindy", "ReviewID": "R26YTK7PU110TT", "Overall": "5.0", "Content": "Don't let the small size of this camera fool you!!  Very easy to use.  I ordered this camera because I was going on a cruise and had planned a lot of water activities that I knew I would want photos of. It worked GREAT!!!! Even with the picture size set at medium the photos I took in and out of the water look amazing!! The colors are vivid and bright, true to what I was looking at when I took the photo.  I was a bit concerned that outside in the bright sun I would not be able to see what I was taking a photo of.  But that was for nothing, I could see the display even in the bright Bahama  sunshine. Bottom line, I was definitely not disappointed with this camera and the wide range of things you can do with it.  Video, panoramic photos, continuous shoot mode, underwater, taking of 2 shots of the same thing with and without flash, the zoom is amazing! The shock proof seems good, I did drop it off my counter top onto a tile floor, and it also fell out of my pocket and hit a rock on a golf course and no problems with any of the functions.It's light weight and easy to put in your pocket or small purse. I went to a local store and purchased camera straps I could put around my neck, and even carrying for several hours there was no strain on my neck.  I am now considering selling my other big name larger camera and making this my primary go everywhere camera!!!!", "Date": "May 11, 2013"}, {"Title": "Fuji Waterproof - ahhh, nothing special if you don't mind a three year life maximum", "Author": "Capeman", "ReviewID": "RITX0E8ARMNVZ", "Overall": "2.0", "Content": "I 've owned two of these and it seems that once I was  in the third year as an owner/user, like clock work they failed.  It just won't power on, It has a charge on the battery but N/G.  I did use the camera for under water photos as well as in & out door photos.  I was satisfied with all the photos.  They were clear and in focus.  So if you don't mind the three year life span than this is the camera for you.", "Date": "May 14, 2014"}, {"Title": "impressive capabilities but....", "Author": "david dannhauser", "ReviewID": "R3A43PPT0DJ1O7", "Overall": "3.0", "Content": "Really an amazing camera for the price. A vast range of customization available to achieve outstanding pics in every conceivable condition in a user friendly interface.  Sadly however out of the box the HDMI port was not working and now has been returned for repairs. Camera was a factory refurb but one would still expect all functions to be tested.", "Date": "May 2, 2014"}, {"Title": "Takes great videos when it works", "Author": "Eric J. Oswald \"I drink your milkshake...\"", "ReviewID": "RL4PD0HC5Z83V", "Overall": "2.0", "Content": "I bought this for taking underwater videos. The videos it took were great. The quality of still images was just ok.I followed the directions and never had the camera more than about 5 feet underwater. After using it a few times it made a terrible buzzing sound and stopped working. Is sent it to Fuji to be fixed (they made me pay the shipping). They sent it back saying it was fixed but it wasn't. It seems its a bad battery (which they didn't replace). I have talked to them 3 times now over the last month. They promised each time they were sending a battery. Just found out today they forgot to send it.I will never buy a fuji camera again.", "Date": "May 1, 2014"}, {"Title": "OK", "Author": "Scott Coffelt", "ReviewID": "R1A925AXJMDZWM", "Overall": "3.0", "Content": "Camera is good for outdoor pictures, but not as good for indoors and did not take clear underwater pictures in ocean.", "Date": "April 24, 2014"}, {"Title": "Camera", "Author": "Susan T.", "ReviewID": "R39MQDPIIYDGED", "Overall": "5.0", "Content": "I absolutely love this camera.  I am so impressed with all the functions that this camera is capable of. And it is water proof. Love it.", "Date": "April 17, 2014"}, {"Title": "weak on portraits", "Author": "whtwtr17 \"p.diablo\"", "ReviewID": "RIUQOESKU189Y", "Overall": "3.0", "Content": "Clearly not the a primary design of this camera, but I was still hoping for better.  Otherwise I'm pretty happy.", "Date": "March 26, 2014"}, {"Title": "working camera battery sucks", "Author": "Tiquanetta", "ReviewID": "R2CUM82VIYV8N1", "Overall": "3.0", "Content": "Camera is working fine but battery completely charged once and won't charge again. Will need to buy another battery. Wouldn't charge while we were on vacation so we could only take pictures on our phones the rest of the vacation.", "Date": "March 25, 2014"}, {"Title": "Awesome Camera", "Author": "Lisa Anne Beck", "ReviewID": "R17O2TPNAP44CR", "Overall": "5.0", "Content": "We needed a waterproof camera to take on a cruise. After lots of research, I decided to get the Fujifilm FinePix XP60. We took it out on snorkeling adventures and were very pleased with the ease of use and picture quality. Highly recommend this camera!", "Date": "March 3, 2014"}, {"Title": "Beautiful pictures", "Author": "M. Schutz \"MN Kindle\"", "ReviewID": "RTLS3TQPG0G7T", "Overall": "5.0", "Content": "I was not expecting much from this camera because it was so reasonably priced.  I was so happy with my purchase, I have recommended this camera to 4 other people.  It took great pictures underwater as well as out of the water.  My only minor complaint would be that sometimes it was hard to see the display screen under water, but it certainly did not bother me too much.  This camera is a great value and I plan on taking it on every vacation.", "Date": "March 1, 2014"}, {"Title": "love, love it", "Author": "L.Licker", "ReviewID": "R30UHI742SXWWC", "Overall": "4.0", "Content": "I've already used it snorkeling, in the rain, everyday use, and on the beach. The different filters are great and give files larger than my DSLR. Since there is no camera lens I did have to get a case to protect it from scratches. That's the only downside. Had one been made for it then I'd say it's perfect.", "Date": "February 23, 2014"}, {"Title": "Great waterproof camera!", "Author": "LM", "ReviewID": "R34F0EFV7BJR5L", "Overall": "5.0", "Content": "Bought this for my husband as a birthday gift before our trip to Hawaii and he loved it!  It is easy to use and it takes great pictures!", "Date": "February 21, 2014"}, {"Title": "great product", "Author": "Amanda stinson", "ReviewID": "R3ORJOEMZSI8HH", "Overall": "5.0", "Content": "Great camera I am very happy with it. Take amazing quality pictures. And I love the under water modes. And fast moving picture modes", "Date": "February 20, 2014"}, {"Title": "Great for surfing!", "Author": "Jen K.", "ReviewID": "R2UQ31DM1ULEPT", "Overall": "5.0", "Content": "This camera is awesome! I take it with me when I surf, and so far it has performed beautifully. Even underwater shots are quite good. I'll be doing some trips to the springs here in Florida, where the water is super clear, so I am excited to see how the pictures will turn out. One tip, I wear Seaspecs when I surf which have polarized lenses, and that makes the LCD screen a little harder to see. Otherwise this camera is great for all things int and around the water. Also, you need to buy a memory card, because it doesn't come with one. Well worth the money.", "Date": "February 10, 2014"}, {"Title": "Awesome", "Author": "Jana  Levitov", "ReviewID": "R2OKWNAJB0W6BG", "Overall": "5.0", "Content": "Got this camera for my Caribbean vacation. I love that I didn't have to worry about my camera getting wet/destroyed. I took it snorkeling, zip lining, to a waterfall, jet skiing, and kayaking. The out of the water shots were very crisp and pretty.  Because the sun wasn't out when we went snorkeling, the underwater shots were just okay (not the camera's fault). The only minor problem I encountered was that I couldn't get the flash to stay on.  I think that if I had played with it more it would have been fine.  For the price and convenience I strongly recommend this camera.", "Date": "February 6, 2014"}, {"Title": "Only recreational camera you'll ever need", "Author": "Herbert Estes", "ReviewID": "R14Z3I254KL0V8", "Overall": "5.0", "Content": "Wife has the XP50 without the multi-shot option, and I have the XP60. We've been taking these cameras to the reefs of Jamaica and Belize, the results have been awesome. Pictures and video under water turn out great, to include the audio on the videos.", "Date": "January 31, 2014"}, {"Title": "Underwater Camera a HIT!!!!", "Author": "Lynne Fabian", "ReviewID": "RAOJI988CVY14", "Overall": "5.0", "Content": "I had and excellent experience!!!  My 11 year old daughter stated to me that if \"Santa\" brought her an Underwater Camera, then she would know for sure, there is a Santa (Cuz she knew I could not afford such a gift).  So, only a couple of days before Christmas I looked on Amazon and found what she had requested.  It was in it's packaging, with all attachments (i.e.; charger, usb cord).  It came exactly as the Ad stated on Amazon.  Even though I couldn't afford the extra for overnight mailing, I received the Camera the day before Christmas Eve.  She was so Happy when she saw the camera!!!", "Date": "January 26, 2014"}, {"Title": "So much fun!", "Author": "Lauren", "ReviewID": "R1H9KNPMUV9FWA", "Overall": "5.0", "Content": "I bought this for my honeymoon cruise. I wanted to take underwater pictures primarily. It has so many functions and options it was so much fun to play with. It took great pictures of sunrises on the sea. Oh yea the zoom is sick! I used the speed function and zoom to get a cool pic of a F-16 fighter jet that was practicing overhead. I'm not savvy when it comes to these gadgets and it was easy to understand and use.", "Date": "January 22, 2014"}, {"Title": "FinePix XP60 Waterproof camera", "Author": "krusin", "ReviewID": "R2UNCWN7IHKUG6", "Overall": "5.0", "Content": "This camera is of good quality. It is winter here, so I have yet to try it in or around water yet. Just the right size for a camera and it fits right into a small pocket. Gave it a 5, I have no complaints and the pictures are good quality.", "Date": "January 19, 2014"}, {"Title": "loving it", "Author": "William Collins", "ReviewID": "R3LROWCJZPD82X", "Overall": "5.0", "Content": "It takes great pictures!  I like the clarity in the pictures.  I like all the capabilities like its HD function.", "Date": "January 8, 2014"}, {"Title": "Love the camera!", "Author": "SRF10", "ReviewID": "R3VV06C0M8984N", "Overall": "5.0", "Content": "I have not taken this camera underwater yet (or dropped it...not looking forward to that feature) but it takes great pictures and is easy to use.", "Date": "December 29, 2013"}, {"Title": "I LOVE THIS CAMERA!", "Author": "Love Home Alone", "ReviewID": "R3PFU7TTBJHA6H", "Overall": "5.0", "Content": "This camera takes wonderful pictures both in and out of water.  I was pleasantly surprised at how good the pictures came out from my trip to Hawaii.  I also \"practiced\" with it in our pool... and the underwater pictures are so good that I had one blown up to a 16x20 canvas print of my 4 year when she jumped in the pool and was completely underwater!", "Date": "December 6, 2013"}, {"Title": "works great so far", "Author": "yukon 2004", "ReviewID": "R1GCSDM5IGYXCL", "Overall": "5.0", "Content": "took with me to guam where we have spent plenty of time in the ocean, and in waterfalls and rivers.  so far so good.  no leaks or issues, just follow the directions provided and everything works fine.  takes great photos, has many options.  love the panoramic option great shots of cliffs and WW2 landing sites.  would not hesitate to tell my mother to buy it.", "Date": "October 21, 2013"}, {"Title": "great camera so far", "Author": "Rudy", "ReviewID": "R202865S2H18QM", "Overall": "5.0", "Content": "I used the xp60 on a trip to the beach. We took pictures in the ocean and in the pool. The pictures are great. We've had no issues so far. I took video as well and the film looks amazing. I recommend this camera as a first time user of underwater cameras. I was very careful with it though and kept it above water as much as possible.", "Date": "October 14, 2013"}, {"Title": "Great camera", "Author": "Pikemon \"QueenofEmbroidery\"", "ReviewID": "R2YTT8W7AHO465", "Overall": "5.0", "Content": "I haven't used it underwater yet but I am impressed by all the specialty camera settings available.  It even has 5 built-in filters.  The pictures are crisp and clear.  I do wish that it had come with a more detailed user manual.  I'm going to look for one to download.  I do have questions about how to use the 3D and panoramic features.  All in all, I am not sorry that I purchased this camera.  It's small and of good quality.", "Date": "September 1, 2013"}, {"Title": "Great camera!", "Author": "W P Bailey", "ReviewID": "R27NDHK5PLUBPV", "Overall": "5.0", "Content": "Fantastic camera! Bought this camera for a 7 day cycling vacation with my family.  It survived a 3' drop, rain, mud & sweat! Great panoramic feature and a dozen or more features. All you need to do is turn it on, point and shoot.", "Date": "August 28, 2013"}, {"Title": "I absolutely love it!", "Author": "Amazon Customer", "ReviewID": "RZHYKY8ZY2CTI", "Overall": "5.0", "Content": "I wanted a high MP camera that was waterproof and drop proof. This camera delivers all that and more. It is awesome and I look forward to using it all the time.", "Date": "July 26, 2013"}, {"Title": "Right Red and Ready!", "Author": "Judy", "ReviewID": "R2EGSM252YGHP3", "Overall": "5.0", "Content": "Really wanted this camera in red and unavailable in most stores in red.  I look forward to using this for multiple family events and documenting our belongings.  This has all the features that I want without being a difficult to use camera.", "Date": "July 9, 2013"}, {"Title": "Simple, Elegant Ready for Use", "Author": "Alper Orus", "ReviewID": "R38SUIMQHWI7ZM", "Overall": "5.0", "Content": "I won't write a long review here. I already own a Digital SLR camera and wanted to buy a small, compact, ruggidized camera for outdoors. I've decided on XP60 and it was ready to use. I've just opened the box and started to use it. It is simple enough for my wife, nice photo capture with auto selection and smart mode.I advice this camera to people who wants a secondary camera for outdoors and everyday family pictures.", "Date": "June 30, 2013"}, {"Title": "Great Underwater Camera", "Author": "Mr. Bey", "ReviewID": "RR126VO3Q06VN", "Overall": "4.0", "Content": "This camera is definitely intended to be used in rugged conditions. As far as its use as a touristy camera, the camera can be beaten by many of the market. However, if you're looking for a camera that can handle underwater clearly, you'll be impressed with this Fujifilm camera.I like this camera's ability to quickly snap pictures underwater. If you're going to go snorkeling, you'll appreciate this camera's ability to capture what see you before it swims away. It's also the kind of camera that can take a beating if you bring it out on the trail. The camera is also very easy to charge and hold its battery quite well.The 5x zoom is a bit of an inconvenience if you're exploring in an area that doesn't let you get right up close and personal. The camera makes up for it a bit with the HD quality video, which is more impressive than many. The data is also easy to transfer over to your computer.This camera won't serve as the end all be all of cameras, but it has many effective uses. I've enjoyed using it underwater. If that's what you're looking for, you'll be in luck.", "Date": "June 11, 2013"}, {"Title": "Xp50 is a thousand times better than xp60!", "Author": "Dee", "ReviewID": "RXWFZYIWMKQZ3", "Overall": "1.0", "Content": "The older model is so much better than the xp60! Xp-60 can don't be used for indoor shots like the older model can. All indoor shots turn out with a red tint since the xp-60 has a recall defect on the flash timing ( flash goes off after the pic is taken.", "Date": "January 25, 2014"}, {"Title": "camera looks cool...but horrible pictures", "Author": "howard l.", "ReviewID": "RUI1KVGWHSCAH", "Overall": "1.0", "Content": "Great looking outer design (small and well built), but, according to most pro reviews, the XP60 has the lowest photo quality of all the current weatherproof cameras...and I agree.  For that matter, it has lower photo quality than cameras from a decade ago.Even in the \"auto\" modes, colors are over-saturated, sunny/outdoor shots are too contrasty, indoor shots are dark, grainy with fuzzy edges.  I was hoping the specialized manual modes would help in low light shots, at least, but they're still extremely dark and dull (you basically can't avoid flash when indoors, even when well lit).  The macro also sucks on this, etc.Supposedly, most of us monitor viewers/internet photo swappers wouldn't be able to tell the difference between these pics and a better camera...but, no, they're really bad (spent a lot of time in photoshop trying to fix them, to no avail).  Hell, my cheap 14 year old (4 megapixel) Olympus takes sharper, more natural colored pictures than this...too bad it devours batteries and doesn't work when very cold, or I would keep using it.I'm not even going to go into the XP60's weather resistant features, simplicity, etc (which are quite good) since the photo quality already kills it.  I was going to give it 2 stars, but with such bad photos, I don't think this should even be on the market...it's garbage.I've since bought the Olympus TG-630.  It takes exponentially better pictures, plus it's smaller, lighter and less expensive.", "Date": "September 8, 2013"}, {"Title": "Great Fun in the Pool", "Author": "Michael Burns \"Burnsie13\"", "ReviewID": "RK038VO4UKFPF", "Overall": "5.0", "Content": "My daughter loves her new phone.  We purchased a Sure Shot first, but it leaked on the first plunge into the pool  Last night, my daughter and her friend took a load of underwater pictures with her new camera.  Well done.", "Date": "July 13, 2013"}, {"Title": "Better Than My Other Water Proof Cameras", "Author": "W. Dietrich \"WD\"", "ReviewID": "RVDF2DNQR7FPE", "Overall": "4.0", "Content": "My first waterproof camera was a Kodak Play Sport (1st Generation).  It was super easy to use.  For the price of this lower end water proof camera, it had OK video and good photos.  After 2 different vacations in Jamaica it started to seep in water and died. Thankfully the SD card survived.On a snorkeling trip to Belize, I decided to upgrade and purchased a Panasonic Lumix and another Kodak Play Sport HD (2nd generation) for my wife.  The Play Sport took much better video and photos than the Lumix.  The Lumix photos were generally blurry and green.  In the water you are constantly moving with the waves and the Lumix had zero stability, thus the numerous blurry photos.  The Play Sport had better photos but the view screen was so scratched up by the end of the trip.  By the way, the Lumix had OK land photos and the Play Sport was horrible on land with no flash. (Play Sport was great with very bright sunlight land shots.)I upgraded to the Fuji, hoping this will be my last waterproof camera.  When I first played with the camera, it was in the evening hours and the metallic buttons made it difficult to determine what the button was for.  Using it in daytime, I was able to clearly see the pictures/letters on the buttons.  The camera has a pretty good locking mechanism for its battery and memory card slots so there is no fear of accidentally opening the chamber underwater (unlike the Play Sport).The Fuji is equipped with Optical Image Stabilization.  It holds up well to the waves of people jumping in and out of a pool with no burred shots. The HD video is sharp and clear.  There are plenty of options and special effects to choose from, like red eye reduction, timers, continuous shots, panoramic shots, options for moving objects, and even different filters.  There are also options for shooting on the beach, for photographs of sunsets, and low light.  The camera definitely had more bells and whistles than I expect to use, but it is nice to have.The Fuji camera is far superior than the other two cameras I purchased.  This camera quickly replaced my Fuji XF1 as my daily, go to camera.  The reason I gave it only 4 stars was due to the zoom.  I do not believe that the zoom will be powerful enough to get a close up of a fish hiding in coral on a snorkeling trip.  I will be using this camera on my next snorkeling adventure in the fall, so I will be updating this review on how it held up to the open waters.", "Date": "June 15, 2013"}, {"Title": "LOVE it!! (But don't forget to buy a SD memory card) update 9/12/13", "Author": "critters", "ReviewID": "R2D70LR4NEKPFE", "Overall": "4.0", "Content": "I have/had at least 4 Fuji cameras, counting this one, but this one's different! The camera is fast to turn on, fast to take a pic, and fast to fire up the flash. Did I mention it's FAST??!! It takes beautiful pics with a depth of field that is perfect for me.In contrast to the others, this one was supplied with an internal battery charger (2-piece USB charger plug), which I don't prefer. Because of the water resistance, the plugs are inside the battery/card door, and I don't want to leave the door hanging open during charging. For another thing, using my old external chargers from the other cameras lets me have extra batteries charged and ready to go, so this is what I've chosen to do.I have no reason to be dunking this baby, so I'll leave it to other reviewers to tell you about the effectiveness of the water resistance; I'm too fond of it to risk it!!MOST highly recommended!9/12/13 I take tons of pictures now that I'm doing photobooks, and I'm just not satisfied with the flash on this camera. Sometimes it works and sometimes it doesn't, even when it's pitch black dark. I'm just not satisfied with that aspect of it, and takes a noticeable length of time to focus. I can mostly live with that, but the flash drives me up a wall. Hence, it has lost a star.", "Date": "May 24, 2013"}, {"Title": "Don't Buy!", "Author": "RiverFun", "ReviewID": "RKHGELZHQCUWY", "Overall": "1.0", "Content": "<!--\n\nfunction fp_resizePlayerSpace(nsPrefix,w,h)\n{\t\n  try {\t\n    var ifrm = parent.document.getElementById(nsPrefix + \"movieFrameID\");\n    if (ifrm) {\t\n        var h2 = h + 35;\n        ifrm.style.height = h2;\n      }\n    } catch(err) {\n \n    } \n\n\n  if (h > 0) {\n      document.getElementById(nsPrefix + \"clipDiv\").style.height=h+\"px\";\n      document.getElementById(nsPrefix + \"videoPlaceholder\").style.height=h+\"px\";\n  }\n  else {\n      document.getElementById(nsPrefix + \"clipDiv\").style.height=\"\";\n      document.getElementById(nsPrefix + \"videoPlaceholder\").style.height=\"\";\n  }\n  document.getElementById(nsPrefix + \"flashcontent\").style.height=\"100%\";\n}\n\nfunction fp_rewriteDiv(nsPrefix,divName,html)\n{\t\n    document.getElementById(nsPrefix + divName).innerHTML=html;\n}\n\nfunction embeddingPopup(nsPrefix)\n{\n  alert(\"placeholder function for embedding code\");\n}\n-->\n\n\n<!--\n\nfunction cv_mo2HXHH06YCX1XFembeddingPopup(){\t\nalert(\"Embedding code will be displayed here.\");\n}\n\n-->\n\n\n\n\n\n\n\n\n\n<!--\nfunction cv_mo2HXHH06YCX1XFrefresh_preplay() {\n\ndocument.getElementById(\"cv_mo2HXHH06YCX1XFchiDiv\").innerHTML = document.getElementById(\"cv_mo2HXHH06YCX1XFhiddenPre\").innerHTML;\n};\ncv_mo2HXHH06YCX1XFrefresh_preplay();\n\n-->\n\n\n\n\n\n\n        // <![CDATA[\n\nvar cv_mo2HXHH06YCX1XFso;\t   \n\n\nfunction cv_mo2HXHH06YCX1XFloadSwf_Core(swfLocation, swfWidth, swfHeight, flashVersion, bgColor, swfParams, flashParams, embedAttributes) {\n\n  try {\n      cv_mo2HXHH06YCX1XFso = new SWFObject(swfLocation, \"cv_mo2HXHH06YCX1XFAMPlayerProd\", swfWidth, swfHeight, flashVersion, bgColor);\t   \n\n      for (var v in swfParams) {\n        cv_mo2HXHH06YCX1XFso.addVariable(v, encodeURIComponent(swfParams[v]));\n      }\n      for (var v in flashParams) {\n        cv_mo2HXHH06YCX1XFso.addParam(v, flashParams[v]);\n      }\n      for (var v in embedAttributes) {\n        cv_mo2HXHH06YCX1XFso.setAttribute(v, embedAttributes[v]);\n      }\n\n      cv_mo2HXHH06YCX1XFso.addVariable(\"swfEmbedTime\", new Date().getTime());\n\n      var agt = navigator.userAgent;\n       \n      var reFirefox = new RegExp(\"firefox/\", \"i\");\n      var regx = agt.split(reFirefox);\n      var ffVersion = 8;\n      if (regx[1]) {\n          var pts = regx[1].split(/[.]/);\n          ffVersion = parseFloat(pts[0] + \".\" + pts[1]);\n      }\n      var minorVersion = parseFloat(navigator.ap);\n      if ((navigator.appVersion.indexOf(\"Mac\")!=-1) || (ffVersion < 1.5)) {\n          cv_mo2HXHH06YCX1XFso.setAttribute(\"height\", swfHeight);\n          cv_mo2HXHH06YCX1XFso.setAttribute(\"width\", swfWidth);\n          cv_mo2HXHH06YCX1XFso.addVariable(\"oldFirefox\", \"1\");\t     \n      }\n\n      if (cv_mo2HXHH06YCX1XFso.write(\"cv_mo2HXHH06YCX1XFflashcontent\")) {\n          fp_resizePlayerSpace('cv_mo2HXHH06YCX1XF', \n                               320, \n                               283);\n      }\n      else {\n          var nsPrefix = 'cv_mo2HXHH06YCX1XF';\n\n          fp_resizePlayerSpace(nsPrefix, 0, 0);\n          fp_rewriteDiv(nsPrefix, \"flashcontent\", '<br/>To view this video download <a target=\"_blank\" href=\"http://www.macromedia.com/go/getflashplayer\" target=\"_top\">Flash Player</a> (version 9.0.115 or higher)');\n      }\n  } catch(err) {\n      fp_resizePlayerSpace('cv_mo2HXHH06YCX1XF', 0, 0);\n  }\n  return false;\n}\n\n\n\nfunction _cv_mo2HXHH06YCX1XFloadSwf(movieID, playerVersion) {\n    var swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/20120510035744301/AMPlayer._V148501545_.swf\";\n    var swfWidth = \"320\";\n    var swfHeight = \"100%\";\n    var flashVersion = \"9.0.115\";\n    var bgColor = \"#FFFFFF\";\n\n    var swfParams = {};\n    var flashParams = {};\n    var embedAttributes = {};\n    swfParams.amazonPort = \"80\";\n    swfParams.allowFullScreen = \"true\";\n    swfParams.telemetrySubPageType = \"VideoReview\";\n    swfParams.nsPrefix = \"cv_mo2HXHH06YCX1XF\";\n    swfParams.locale = \"en_US\";\n    swfParams.logUrl = \"gp/mpd/l\";\n    swfParams.canResize = \"1\";\n    swfParams.autoPlay = \"1\";\n    swfParams.sessionId = \"000-0000000-0000000\";\n    swfParams.marketplaceID = \"ATVPDKIKX0DER\";\n    swfParams.salign = \"LT\";\n    swfParams.preset = \"detail\";\n    swfParams.mediaObjectId = \"m1VZD6CKM4Z610\";\n    swfParams.autoPlayTimer = \"\";\n    swfParams.mediaObjectIDList = \"m1VZD6CKM4Z610\";\n    swfParams.playIsUserGenerated = \"1\";\n    swfParams.enableShare = \"0\";\n    swfParams.permUrl = \"gp/mpd/permalink\";\n    swfParams.telemetryPageTypeID = \"RKHGELZHQCUWY\";\n    swfParams.xmlUrl = \"http://www.amazon.com/gp/mpd/getplaylist-v2/m1VZD6CKM4Z610/000-0000000-0000000\";\n    swfParams.amazonServer = \"www.amazon.com\";\n    swfParams.scale = \"noscale\";\n    flashParams.allowFullScreen = \"true\";\n    flashParams.salign = \"LT\";\n    flashParams.bgcolor = \"#FFFFFF\";\n    flashParams.allowScriptAccess = \"always\";\n    flashParams.quality = \"high\";\n    flashParams.wmode = \"transparent\";\n    embedAttributes.title = \"Flash Player\";\n\n    if (movieID){\n      if (playerVersion == '3'){\n        swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/20120510035744301/AMPlayer._V148501545_.swf\";\n        swfParams.mediaObjectIDList = movieID;\n      } else {\n        swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/legacy/20101014901/AMPlayerProd._V197491872_.swf\";\n      }\n      swfParams.xmlUrl = \"http://www.amazon.com/gp/mpd/getplaylist-v2/\" + movieID + \"/000-0000000-0000000\";\n      flashParams.wmode = \"transparent\";\n      swfParams.autoPlay = \"1\";\n    }\n\n    if (document.getElementById('cv_mo2HXHH06YCX1XFduration')) {\n      document.getElementById('cv_mo2HXHH06YCX1XFduration').style.display='none';\n    }\n    cv_mo2HXHH06YCX1XFloadSwf_Core(swfLocation, swfWidth, swfHeight, flashVersion, bgColor, swfParams, flashParams, embedAttributes);\n\n  return false;\n}\n\nfunction cv_mo2HXHH06YCX1XFloadSwf(movieID, playerVersion) {\n   return _cv_mo2HXHH06YCX1XFloadSwf(movieID, playerVersion);\n}\n\n\n\t\n\t\t// ]]>\n\t\n\n<!--\n\nfunction cv_mo2HXHH06YCX1XFnewHeight(h)\n{\t\n    fp_resizePlayerSpace('cv_mo2HXHH06YCX1XF', 0, h);\n}\n\nfunction cv_mo2HXHH06YCX1XFresetPlayer(w,h,bw,cc) {\n  cv_mo2HXHH06YCX1XFnewHeight(h);\n\n  cv_mo2HXHH06YCX1XFso.addVariable(\"resetBandwidth\", bw);\n  cv_mo2HXHH06YCX1XFso.addVariable(\"cacheCode\", cc);\n  cv_mo2HXHH06YCX1XFso.setAttribute(\"height\", h);\n  cv_mo2HXHH06YCX1XFso.setAttribute(\"width\", w);\n  cv_mo2HXHH06YCX1XFso.write(\"cv_mo2HXHH06YCX1XFflashcontent\");\n}\n\n-->\n\n\n\n\n\n\n\n\nvar cv_mo2HXHH06YCX1XFRollOverImg = new Image();\ncv_mo2HXHH06YCX1XFRollOverImg.src = \"http://ecx.images-amazon.com/images/I/81UAtlys6qS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play-active,BottomLeft,130,-12_CR0,0,0,0_.png\";\n\nvar cv_mo2HXHH06YCX1XFpreplay = document.getElementById('cv_mo2HXHH06YCX1XFpreplayImageId');\nif (cv_mo2HXHH06YCX1XFpreplay) {\n  cv_mo2HXHH06YCX1XFpreplay.onmouseover = function() {\n    cv_mo2HXHH06YCX1XFpreplay.src = \"http://ecx.images-amazon.com/images/I/81UAtlys6qS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play-active,BottomLeft,130,-12_CR0,0,0,0_.png\";\n  }\n  cv_mo2HXHH06YCX1XFpreplay.onmouseout = function() {\n    cv_mo2HXHH06YCX1XFpreplay.src = \"http://ecx.images-amazon.com/images/I/81UAtlys6qS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play,BottomLeft,130,-12_CR0,0,0,0_.png\";\n  }\n  \n  \n  var node = cv_mo2HXHH06YCX1XFpreplay.parentNode;\n\n  var cv_mo2HXHH06YCX1XFcurrentClick = node.onclick;\n  node.onclick = function () {\n    var head = document.getElementsByTagName(\"head\");\n    if (head[0]) { \n      var logTag = document.createElement('script');\n      logTag.type = \"text/javascript\";\n      logTag.src = \"/gp/customer-media/du/log.html?ie=UTF8&p=CustomerImage&s=CustomerVideoPlay\";\n      head[0].appendChild(logTag);\n    }\n\n    if (cv_mo2HXHH06YCX1XFcurrentClick) {\n      return cv_mo2HXHH06YCX1XFcurrentClick();\n    }\n  }\n}\n\n\n\n\n Length:: 0:24 MinsPicture taking: The idea of burst mode is nice, but of the multiple \"burst\" photos taken at once, only one (and sometimes none) of the pictures were in focus when using the camera's built-in automatic sensor mode.  For general one-shot-at-a-time pictures, when using the automatic sensor, wherein it is supposed to figure everything out for you and select appropriate setting in the moment, none of the shots were actually sharp...barely passable in some pictures!Video: This is where the camera is nearly worthless!  Took it on its first use to the river to capture family boating fun. I detected no image stabilization whatsoever in the videos taken; they were grainy and out of focus at many times.  Even more frustrating was that the camera seemed to change recording speeds during the same video sequence.  What I mean is the recording would be at real-time speed, and then appear to have processing difficulty that would eliminate frames (perhaps since it could not process fast enough) and make the video look out of sinc, like it was being recorded with a special effect...virtually never recorded a seamless video without problem.I will be returning to Costco if they will take it back without the packaging which I threw away.  I had a very old Kodak that got ruined when splashed at the river...it had maybe one-quarter the supposed processing power as this fuji, but it's videos were twice as good as the dismal stuff resulting from this finepix XP60...I think it's a big miss and cannot recommend at all!  See attached video to see how worthless the shooting is with this unit.", "Date": "June 30, 2013"}, {"Title": "Fuji won't stand behind poor design", "Author": "carolblue", "ReviewID": "R290J4TUQ0JBUT", "Overall": "1.0", "Content": "I used my camera at work in a hospital and needed to clean it with wipes after entering every patient room.  Upon walking out of a room, I dropped the camera from waist high.  A piece broke off of the top black plastic, making it unable to be cleaned with wet wipes.Fuji's customer service is refusing to honor the warranty because \"we designed this camera to not break when dropped\".  DUH.After sending the camera in, I received a $116 repair estimate.  I will NOT spend the $116.  I will buy a Canon or other decent camera with decent customer service.  Then I will spend a couple of hours writing this same review on every site I can find on the internet.", "Date": "May 29, 2014"}, {"Title": "A Must Have !!!!!", "Author": "shahid qureshi", "ReviewID": "R2937I3SU335Q7", "Overall": "5.0", "Content": "Takes beautiful pictures, I'm the type who photo shops all my pictures but OMG I didn't have to edit and fix any of the pictures I took from this camera, even the under water, pictures were ,very clear, even the pictures I took in the pool of my son who was splashing water all over the place, yet this camera didn't fail me at all, it was amazing to see every drop of water being captured so perfectly, takes beautiful videos too , even under water, the battery life is really good, its a well built water proof strong camera. I suggest to get the Transcend 32GB 10 memory card with this item, I also purchased the accessory kit and WOW everything that comes in it, is a must have with this camera, this camera is the perfect vacation companion and I can give it a 5 stars because I've just come back from vacation and love my videos/pictures, the price is well worth it for something so good like this. I saw a couple of people with this camera too when I was on holiday, and I also saw many many people who were  looking at my camera at the water park in the water who didn't have this camera but you could tell they wish they had, I owe this camera for my fun filled perfect trip", "Date": "April 27, 2014"}, {"Title": "This camera is terrific!!", "Author": "Len Eisenberg", "ReviewID": "RMJNTB3S9X8TU", "Overall": "5.0", "Content": "I use this camera when I kayak.  I bought it because it was said to be waterproof and sinceI'm on the rivers for hours at a time I thought it would fill the bill..  It has.....in every way.I have dropped it a couple of times in the water with no ill affects whatsoever.  I just keep shootingwith it.Picture quality is excellent whether using the still or movie venues.  And it will do many more thingssuch as editing, that I was surprised with.  I have a much more expensive Nikon camera that doesn'tdo some of the things that this little camera does.Highly recommended.", "Date": "April 24, 2014"}, {"Title": "Item is NOT sold new im certain....", "Author": "djginyc", "ReviewID": "R1IYAP00PB99TD", "Overall": "3.0", "Content": "Im 100% sure this item is not NEW and may be Refurbished. It came in a box that was not in its Original Fuji packaging with NO user manual or factory warrenty. The picture quality is \"O.k\" at best and i havent used its waterproof feature yet but im expecting the worst given i failed to read the reviews before i purchased. Im curious as to why it was shipped as it was....", "Date": "January 5, 2014"}, {"Title": "Beware Mac Users", "Author": "D. Frohlich", "ReviewID": "R1Q72G7W3LALEB", "Overall": "1.0", "Content": "Of 3 cameras this is absolutely the worst digital camera I have ever owned.  It has been impossible for even IT experts to recover my photos on either a Mac or PC.  Fujifilm's tech support is also useless. So much for my recent trip to Peru.", "Date": "December 27, 2013"}, {"Title": "BUY THIS!", "Author": "Amba2314 \"AA\"", "ReviewID": "R6B063NS0MYU2", "Overall": "5.0", "Content": "I ran into a guy with this camera at Typhoon Lagoon in Disney World. We had all just snorkeled with sharks and he asked me to take a picture of he and his family. After the pic, he showed me the UNDERWATER HiDef video with AUDIO of their experience and I immediately knew I had to have this camera!! I got it for an amazing price under One fifty and I have taken SO MANY pictures with this camera!!! We went on a 5,000 mile road trip and this camera performed in all situations and climates!! I even took in into the HOT springs in Pagosa Springs, CO and it performed beautifully despite the heat and minerals. Regular pictures are awesome, esp with the setting selected for the 10 shots at a time. Great for motion shots. I am 2000% pleased with this camera, the best I have ever owned. Amazing.", "Date": "September 12, 2013"}, {"Title": "Good choice if underwater photography is important", "Author": "Bruckner", "ReviewID": "RZUAKS0RNOWU8", "Overall": "4.0", "Content": "I bought this camera for my fiancée to use on a cruise. She found it to be very easy to use and carry around with her. She really liked the flotation wristband while she was snorkeling. She wanted something that would get good pictures, be easy to carry and would work underwater.Looking at the pictures I thought they were good if not great - several times the camera was fooled on its exposure, and since the camera shoots in JPEG only it limits your ability to correct exposures afterwards. She said the camera focused very slowly. Any camera of this type will struggle with underwater photography because of its small lens and the relatively low-light nature of the environment - this camera had a little trouble with blur and focus underwater, but with some practice I think it could be very effective. To get more capability I think you'd have to spend a whole lot more.Overall I think this is a really good camera to carry around as a quick point and shoot with underwater capabilities. If the underwater features aren't important, I'd probably prefer a Canon or Nikon for their better photo quality.This product is or has... Long shutter delay  Poor zoom range/performance  Easily fits in pocket/purse  Long battery life  good choice for underwater amateur  not the best choice unless u want underwater", "Date": "September 7, 2013"}, {"Title": "It works well but picture quality is poor.", "Author": "E. Gruss", "ReviewID": "RU2YIY3V9Q9UI", "Overall": "2.0", "Content": "I purchased from another retailer and tested it out in the pool and compared to pics on my Nexus 4 smartphone with an 8mp camera.  I decided to return the camera and will be using a dicapac to take underwater pictures with my phone instead.  My cell phone pictures were just as good as this camera, same level of detail even though this camera had 2X the pixles.Also when trying to take pictures with the sun in the background did not turn out well at all.  It gets lensflare very easily.  The LCD on the camera really adds color to the pictures that I didn't see once they were on the PC.  If you want it just to put pictures online and create some youtube videos with it being able to go underwater and take some hits then the camera should be fine and will work for you.I was hoping to take it instead of the good camera while on vacation, that it would perform better in more situations than my cell phone.  Unfortunately that was not the case.", "Date": "September 6, 2013"}, {"Title": "Spontaneous erasure", "Author": "bruce amrhein", "ReviewID": "R3IWRLJZBLCEJG", "Overall": "1.0", "Content": "I had probably 10 videos of a white water trip. They looked awesome when played back on camera. A day later, after recharging, the pics, videos, all gone. Zip , nada, pffft. Can there be anything worse. Such a disappointment.", "Date": "August 4, 2013"}, {"Title": "Takes great pictures & videos, a great camera!", "Author": "hwrose379", "ReviewID": "R1ZU4TIUCU159L", "Overall": "5.0", "Content": "I bought this camera when it was on sale at Costco for $40 off. I had some extra money to spend so I thought, why not? And ultimately, I'm glad I chose this camera!This camera takes really good quality pictures. I have a lot of stunning pictures that I've taken on my two grand adventures with the camera so far. Focusing is very easy as the shutter button has a very obvious halfway point. The only downside to this is that it's hard to tell whether a picture was fully in focus when it took until the picture was transferred to the computer. But other than that, this camera has a stunning picture quality...pretty amazing for such a small camera.One of the many strengths this camera has is the continuous picture mode. When this mode is switched on, you can take 10 continuous shots with one press of the shutter button (10 pictures per second). This mode is extremely useful and is extremely fun to use. I've used it numerous times as my siblings jump in the pool...I get to capture the jump, the falling, and the splash all in one continuous shot. I've also used it while taking pictures of campfires and you can get some pretty awesome fire pics with this mode.When I read that this camera can record videos in 1080p HD at 60fps, I didn't really believe it at first...until I tried it myself. It is AMAZING. The 60 frames-per-second really makes the videos feel more lifelike and it makes the experience of watching the videos much better.Perhaps the best thing about this camera is that it's waterproof. This was one of the main reasons why I bought this camera, as I wanted to get some awesome underwater pictures of my siblings while they were swimming in the pool. The waterproof feature works flawlessly and I love it so much. Recording videos underwater is amazing, too. It's awesome to record a video outside of the pool and then jump in while it's still recording. We've been working the waterproof feature to death and we love a lot of the pictures and videos we've taken so far.This camera has a very nice size...it fits into most pockets easily. It's about the size of an iPhone 4 only twice as thick. It's this thickness that may cause the camera to not fit in some pockets.All-in-all, I really enjoy this camera. It has awesome picture & video quality, and I really love the continuous shot and waterproof features. This camera is well worth the money and I'm glad I bought it.", "Date": "July 29, 2013"}, {"Title": "TERRIFIC camera, WATER AND SHOCK PROOF and GREAT VALUE", "Author": "Tech Mom", "ReviewID": "R2LPQQRTUBNRCE", "Overall": "5.0", "Content": "The FinePix XP60 is a great little camera. I purchased this for my teenage son just before we went on a vacation to Costa Rica. The timing for this particular camera could not have been better.  While I was carefully removing my camera from the ziplock bag in the rainforest, my son was diving into a pristine waterfall and taking underwater photos through the crystal clear water of tiny fish.  My identically configured Fuji camera seemed suboptimal in comparison in so many ways.  It can rain anywhere, and this camera goes anywhere.  He also dropped it from horseback, naturally onto a rock, and it was fine - not a stratch.  It is so nice to have a camera that you do not have to worry about!The camera is simple to operate and takes great images.  The photos from the trip that we had blown up were all taken with this camera which outperformed my camera with identical features but which did not have the water and shock resistance.  Something else that I noticed is that direct connection image transfers were much faster from this camera than mine - also a Fugi 16 MP.The zoom feature is very good, and seems to take much better pictures from a distance.  His photos of monkeys in the trees were all very crisp and could be enlarged easily.  The camera seems to focus better at a distance than mine.I highly recommend using a very large data card in this camera, because you will be much more likely to keep this camera handy in your pocket and use it extensively.  I highly recommend this camera.", "Date": "July 27, 2013"}, {"Title": "What this camera Is and Is Not", "Author": "Trevor Goodchild", "ReviewID": "R1W9VX812YCU7A", "Overall": "4.0", "Content": "The Fuji XP series is one of your better choices if you want to do some simple underwater shooting. These are great cameras to take to the beach and on vacation, but sacrifices have been made.First of all, the image quality is about what you'd expect from a tiny lens system and sensor--it needs lots of light and is grainy. You'd be surprised how quickly the light falls off underwater. This camera makes a few improvements over the older XP50:* Stabilization system to assist in low light shots* Much less noticeable red shift* Improved image quality.One strange thing I noticed was the battery socket was not keyed, so you were able to put the battery in the wrong way-- so watch out for that.Overall, if you want to take pictures near or in water, this is a one of the most economical ways to do that.", "Date": "July 18, 2013"}, {"Title": "Underwater Camera", "Author": "D. R. Sant", "ReviewID": "RH062QQOZM2KR", "Overall": "3.0", "Content": "It is a great camera, although the mic isn't good unless it is underwater.  Perfect for travel.  Wish I had purchased the wifi one!", "Date": "June 28, 2013"}, {"Title": "Best camera for the money in its class", "Author": "weezee", "ReviewID": "R18K2LT4COBB1B", "Overall": "5.0", "Content": "We took this camera to Florida for vacation took pictures of all types day, night, beach, inside, underwater and so on great pictures videos are awesome couldn't have asked for much better.", "Date": "June 14, 2013"}, {"Title": "This camera survived 9 days on the Colorado river!", "Author": "Mandy Schoen", "ReviewID": "R31TLJX9KFK9BP", "Overall": "5.0", "Content": "I choose this camera for our 9 day river rafting trip through the Grand Canyon.  After reading many reviews of disappointment for it not being good at taking underwater pictures, I was kind of on the fence. Even though I wasn't planning on taking under water pictures, I still needed a good camera (not expensive either) that would survive the trip. This is a great point and shoot camera! I was able to get nice scenery pictures on the water and on the trails. No problems! Great battery life too! Over the course of 9 days I only used 3 batteries and took over 600 pictures.  Great value! And it's not much bigger than a smart phone, just a bit thicker.", "Date": "June 6, 2014"}, {"Title": "Mother's Day Gift", "Author": "Michael Loveday", "ReviewID": "R3OC3N2XWIEZL8", "Overall": "5.0", "Content": "Bought it as a gift and my mother loves it very much. Easy to use even for tech challenged  people. Glad I purchased.", "Date": "June 6, 2014"}, {"Title": "Great for the $$", "Author": "Linda", "ReviewID": "R3D8M5H32Q4S93", "Overall": "5.0", "Content": "Love it!!!!! Awesome pictures.  Took it to water park and fishing. Held up great. Pic come out nice and clear under and above water", "Date": "June 6, 2014"}, {"Title": "Great Quality for Price!!!", "Author": "Nate P", "ReviewID": "R2SUAPYKDLZSJ", "Overall": "4.0", "Content": "I purchased the XP60 for roughing and tumbling in obstacle mud races and underwater shooting.....it has yet to let me down!!!", "Date": "June 6, 2014"}, {"Title": "Great little point and shoot", "Author": "I B Cookin", "ReviewID": "R1Z5NZFRHVMEH4", "Overall": "5.0", "Content": "I bought this camera because it is dust & water proof. I like to take it along with me when I sail. I don't have to worry about it getting wet. Also, because it is dust proof, I don't have to worry about getting dust on my sensor that cause little spots in my images. This camera has a lot of features to play around with. I enjoy the rapid shot and the panoramic feature.", "Date": "June 4, 2014"}, {"Title": "Great Water Camera", "Author": "Devin B", "ReviewID": "R2MVY5S2VPRVPT", "Overall": "5.0", "Content": "I take this camera on the river with me and it takes great pictures and videos. The picture quality is up to my standards, it is waterproof, and the price I got it for makes it so that if it gets lost I won't be too upset. I took some cool videos with it while rafting and the sound quality was good too. I would recommend buying an extra battery or two.", "Date": "June 4, 2014"}, {"Title": "Ok for most photos", "Author": "Christopher Steltzlen", "ReviewID": "R2VTVQ0LF6ZTAF", "Overall": "3.0", "Content": "I was NOT impressed with the zoom and the manual to use it is over in inch thick and must be printed on your computer.  Also, the memory card did not come with the camera. I really needed a waterproof camera with a zoom for bird watching.  Lesson learned.", "Date": "June 3, 2014"}, {"Title": "Awesome", "Author": "David", "ReviewID": "R131DARJ5SBNT3", "Overall": "5.0", "Content": "Camera works well and takes impressive photos. This is a must have for anyone that takes photos at the beach, lake, or pool!!", "Date": "May 26, 2014"}, {"Title": "Great value - submersed many times and dropped quite a few times then still worked", "Author": "Raymond", "ReviewID": "R9C3QVBLFMKOR", "Overall": "5.0", "Content": "I bought my second one of these from Amazon because for the price this camera is a good value. I have completely submerged this camera at least four dozen times while filming fish I am bringing in to my kayak. I have done kayak surf launches where this thing becomes totally soaked and I have taken it to the dusty desert and this camera never had dust inside the lens. I have owned my first one  of these cameras for a year. I get decent battery life and good video quality. In fact this thing is way better than my GoPro (which gets zero battery life and sucks). It's either this camera of the Lumix which my friend has. I don't think either one is better.", "Date": "May 21, 2014"}, {"Title": "Camera", "Author": "Patty Tanner", "ReviewID": "R3P0W9P70BO2JR", "Overall": "5.0", "Content": "It is what I was looking for and so much more. I love it! I've already gotten more pics of my daughter than I've been able to get in years.", "Date": "March 24, 2014"}, {"Title": "worth the money!", "Author": "Holly Ganz", "ReviewID": "R3PMOAA9JPBAQ", "Overall": "5.0", "Content": "It works perfect for what I need it for.  I film alot of mudding events and when I got splashed it keep right on working.  Excited to try it under water", "Date": "March 16, 2014"}, {"Title": "cool underwater pics", "Author": "PlaynDoc", "ReviewID": "R1P0GTEA9EH40G", "Overall": "5.0", "Content": "we took this on our disney dream cruise.  swimming pool pictures are quite sharp; in the ocean water, a bit cloudy.  the camera will see what a person would see, wearing swim goggles.  can't expect better than that.  along with a 32 gig card, we took a whole hellava lot of pictures, and never worried about filling the card.  great photos on shore, too.  the only thing that would be an added cool factor, would be a better/closer zoom feature.", "Date": "March 12, 2014"}, {"Title": "XP60", "Author": "Jeffrey", "ReviewID": "R1S0WYCLDRK512", "Overall": "5.0", "Content": "Researched this underwater camera against other brands on Amazon and on you tube for picture and video quality. Used it on our Caribbean vacation 3/2014. Highly recommend this camera for the price.", "Date": "March 12, 2014"}, {"Title": "Refurbished Unit", "Author": "Charles Webb", "ReviewID": "R26RMQXS7XZZU7", "Overall": "5.0", "Content": "Love Camera but came with no box or manual.I sent an email to seller asking if he had the Camera manual or knerw where I could obtain but received no reply.I beleive there should have been disclosure that there was no box or manual for this Camera. I like the Camera!", "Date": "March 10, 2014"}, {"Title": "easy to use", "Author": "Lynn Latham", "ReviewID": "R3HL2RSIAPZYEB", "Overall": "5.0", "Content": "Great underwater camera!  Got it for my trip to Mexico and it was very easy to use and pictures turned out great!", "Date": "March 10, 2014"}, {"Title": "Great item!", "Author": "Grace Szeja", "ReviewID": "R2WT6AYJFS7W5D", "Overall": "5.0", "Content": "Best camera I have ever owned! I take it on mud runs and it survived! Great if you have small children too.", "Date": "March 10, 2014"}, {"Title": "Great Camera, especially for the price.", "Author": "Michael Ament", "ReviewID": "R3PFTZ6AXPWPJB", "Overall": "4.0", "Content": "Easy to use, clear photos.  And amazing underwater feature!Used this camera for a vacation and it took great scenic shots, and was tons of fun to use in the pool.", "Date": "March 5, 2014"}, {"Title": "It exceeded my expectations", "Author": "wanda wright", "ReviewID": "R3SUGRNIY4ICQK", "Overall": "5.0", "Content": "It was a gift for my adult son who started using it immediately.  It takes very good quality photos and was a huge hit", "Date": "March 2, 2014"}, {"Title": "Not what I expected", "Author": "Diver Jan", "ReviewID": "RJ0G7EGNXYPHG", "Overall": "2.0", "Content": "I used this camera for a few days and had to take it back.  The flash button didn't work - the flash never would come on.  The button for macro also didn't work.  The picture quality is very bad and the zoom didn't work very well either.  I was hoping to have a camera for snorkeling rather than have to use my big u/w camera - well, I still don't have an option that works.  could have returned it for a new one but decided to not give another one a try.", "Date": "February 26, 2014"}, {"Title": "Excellent product.", "Author": "nando", "ReviewID": "RE5AKBEMOG3EH", "Overall": "5.0", "Content": "It Was much more than what i Was expecting. Inside the water it works very well, it is a really a good câmera.", "Date": "February 22, 2014"}, {"Title": "5 star because...", "Author": "Jey85", "ReviewID": "R241CGID2HTTXN", "Overall": "5.0", "Content": "it takes underwater CLEAR pictures!!!!!!! my camera didn't come with a sd card but that's fine anyway because I will buy a good quality card. overall its a great camera.", "Date": "February 19, 2014"}, {"Title": "Awesome!!", "Author": "Amy", "ReviewID": "R2KKB0ISP419Y6", "Overall": "5.0", "Content": "Bought this camera for a week long cruise through the Caribbean.  It worked flawlessly.  Awesome underwater shots, great pictures from parasailing, snorkeling, playing in the sand.  I love everything about it and I didn't have a single problem.  Definitely worth it for the price point!", "Date": "February 18, 2014"}, {"Title": "great camera", "Author": "Central Wyoming College - Library", "ReviewID": "R229URDJ6FPTHE", "Overall": "5.0", "Content": "Has great features and easy to use.  Still learning but used it for capturing pictures of the three new babies in the family over a weekend and had no problems.", "Date": "February 18, 2014"}, {"Title": "great camera!", "Author": "Danielle Burruss", "ReviewID": "R3PHTRKCET3BGZ", "Overall": "5.0", "Content": "Fast delivery. Love the camera. Bought it for out trip to Maldives to take photos underwater. Very excited about using it.", "Date": "February 12, 2014"}, {"Title": "perfect camera", "Author": "Robin L. Haggerty", "ReviewID": "R2W0UYKZ82HT3C", "Overall": "5.0", "Content": "We had the older generation and loved it as well as wore it out.  We had to replace it so naturally we turned to Amazon and the camera we know and trust.  Super happy to hit the vacation excursions, typically snorkeling and snap away at the pictures.", "Date": "February 7, 2014"}, {"Title": "Camera did not leak", "Author": "Albert Holm", "ReviewID": "RB225FIALBMTC", "Overall": "5.0", "Content": "I bought this for my wife to use during our Hawaiian vacation. She used it during six snorkeling excursions of an hour or more and did not have any difficulties (except for forgetting the charger at home; luckily my charger worked for her batteries).", "Date": "January 30, 2014"}, {"Title": "Water sports", "Author": "Cindy", "ReviewID": "R2UO6JSZ0PEZYQ", "Overall": "4.0", "Content": "For several years I have used the older version of this camera. Kayaking and hiking, water, rain, dropping are no longer issues for me.  This purchase was a gift for my husband and he is learning the features. The closing latch has changed from the older camera but it is relatively easy to use. It has many settings for different type photos and I have had good results. Best of all no waterproof case required. I keep a small waterproof case attached to it when paddling or swimming so it doesnt sink. For the money", "Date": "January 25, 2014"}, {"Title": "Battery DOA", "Author": "Lucal", "ReviewID": "R2X1DYTYILH5KX", "Overall": "2.0", "Content": "I bought 2 of these cameras from 2 different sellers. When I change out the battery this camera works. The problem is that it is a special battery that I cannot find anywhere and it was a broken gift out of the box that seriously disappointed my daughter who could not use it on our vacation. The other camera that the gloating sister got to use took nice underwater pictures and was enjoyed.", "Date": "January 23, 2014"}, {"Title": "What a great camera", "Author": "R. Browning \"t5grrr\"", "ReviewID": "R88Y9IIG6YSB", "Overall": "5.0", "Content": "Took it to Costa Rica and used it in the surf, underwater, etc. never a problem and great battery life. Remember to rinse it as per instructions to prevent salt water corrosion though!Very nice photos, far superior to most other small point and shoot cameras.", "Date": "January 22, 2014"}, {"Title": "Awesome for our 5 year old son", "Author": "nordkat", "ReviewID": "R114SUBD2L0QTO", "Overall": "5.0", "Content": "We bought this camera for a 5 year old son for Christmas because he loves to take pictures.  He was able to operate it without any instruction from us.  (Caveat: He has used digital cameras before.)  We feel safe because it has that 5-foot drop protection.  It's very rugged and well made.  And our son is excited to use it underwater at the pool this summer.  We picked yellow because it's easier to find than black or a dark color when he 'loses it' in the house.  I would recommend this camera to other parents.  And for adults who want a rugged camera.", "Date": "January 11, 2014"}, {"Title": "great", "Author": "Jarboe", "ReviewID": "R2KRUCGJOD4ALE", "Overall": "5.0", "Content": "I bought this camera specifically for a snorkeling trip and loved it. It took great pictures and video. Will certainly use it again in the future.", "Date": "January 10, 2014"}, {"Title": "Lovely Shade of Green!", "Author": "John Beard", "ReviewID": "R532X0VRUJNY1", "Overall": "4.0", "Content": "This was a gift for my 9 year old grand daughter.She is approving of this camera so far and that is all that needs to be said!Actually she told Santa she wanted a \"GREEN\" camera, that limited the field a lot.This camera seems to be everything one could ask for in this price range, plus it is water proof to a shallow depth.I paid more for MY camera that did not have rechargeable batteries.", "Date": "January 8, 2014"}, {"Title": "love it", "Author": "mona \"annec@ioa.com\"", "ReviewID": "R1OR0BBPDC89CY", "Overall": "5.0", "Content": "I got this for a 10 year old and she figured most of it out on her own.  We have only taken pictures inside the fish tank (fun), but we can't wait to try some pool shots.", "Date": "January 8, 2014"}, {"Title": "Good little camera", "Author": "MissingBj \"Karen\"", "ReviewID": "R27WIY3FTE21A4", "Overall": "5.0", "Content": "Good little camera - decent price -  I used it under water & near water on a trip.  It was nice to not worry about getting it wet while, sailing, paddle boarding, etc.  took great shots of the kids in the pool under the water.  Have not tried it yet in the snow.  If it lasts ---- it is a winner...", "Date": "January 7, 2014"}, {"Title": "Performed well", "Author": "Ed Hillman", "ReviewID": "RAZ8XE01VDFN3", "Overall": "5.0", "Content": "Bought this to take on a high altitude trek; it performed well -- no freezing or dust problems; clear pictures remained sharp when made to poster size.  Will take it under water in 2014; stay tuned.", "Date": "January 3, 2014"}, {"Title": "Perfect camera for snorkeling.", "Author": "DAVID L EVANS", "ReviewID": "R205O0L5VG6679", "Overall": "5.0", "Content": "We bought this camera to take on a cruise and do some snorkeling. I worked perfectly and the pictures came out great. We were in about 8-12 feet of water and I got some really nice clear photos underwater. I took it jet skiing and got some really good photos just by reaching down and holding it underwater. The camera always works and never leaked.", "Date": "January 3, 2014"}, {"Title": "Best buy among snorkeling cameras", "Author": "manatee", "ReviewID": "R2ITT3PTW8OIKH", "Overall": "4.0", "Content": "I chose this model over its \"big brother\" (FinePix XP200) because it's smaller, lighter and has a longer battery life. I would have liked the Wi-Fi connection of the XP200, but I don't need my fish recorded in stereo.  Neither camera is capable of accompanying me to scuba depths. That requires a separate housing to keep the water out. If you can free dive deeper than 20 feet or so, consider the XP200.  It is rated for deeper depths than the XP60, but this one is fine for snorkeling along the surface with an occasional dip deeper.  I took it on a recent beach trip to Curacao and it met my expectations.  I didn't find a lot of difference in color rendition between the \"underwater\" recording mode and the surface modes but coloration can be corrected by computer processing.  At least this camera didn't leak and you're warned not to open the access door without drying the camera off. I followed the warning and had no problem. But remember, this IS an underwater camera with a non-protrucding lens behind an optical-glass screen. You can probably find less expensive cameras that will take equally good or better pictures than the XP60 (especially as regards contrast and definition) but they won't go swimming with you!", "Date": "December 27, 2013"}, {"Title": "great camera", "Author": "mehtap cicek", "ReviewID": "R1236F4L3XYXDF", "Overall": "5.0", "Content": "I got it for Christmas today and it works better than my past camera (a Panasonic lumix) it has good sound quality and zooms really good!!", "Date": "December 25, 2013"}, {"Title": "Crap!", "Author": "Joshua S.", "ReviewID": "RX9HG6JZIYNGT", "Overall": "2.0", "Content": "Two days of use at beach and pool and it stopped working.  The \"door\" was correctly shut as the photos it took look pretty good!Now it's not charging (can't even tell if it is) and not turning on.  After 24hr dry out time still dead.  Glad Target has a 30 return policy on this crap. Now stuck in Puerto Rico without a back-up camera!!  Stupid move, I know.", "Date": "December 25, 2013"}, {"Title": "Used it in the Caribbean and worked excellent!", "Author": "Brad Towle \"photo freak\"", "ReviewID": "R2IQCS5IAW0CL3", "Overall": "5.0", "Content": "Was very pleased with the quality of the camera and the clarity of the pictures.  Love the features on it.  Did not have any problems underwater, even up to 18 ft deep. I just wish the water wasn't as stirred up by the trade winds! I would highly recommend this camera!", "Date": "December 17, 2013"}, {"Title": "Nice looking camera", "Author": "Oscar P Juarez", "ReviewID": "R3ICFC1UZ16BY4", "Overall": "4.0", "Content": "I like the looks on the camera. and I can wait to go to the beach and use it. I want to see how it does under the water.", "Date": "December 13, 2013"}, {"Title": "Wonderful for the price", "Author": "Jen", "ReviewID": "R3I11PDYS7GUBA", "Overall": "5.0", "Content": "I bought this camera right before an October cruise to the Bahamas because our other underwater camera completely died on us.  I'm very happy with the picture quality, and the video setting is really easy to use.  It definitely works for snorkeling, and I'm looking forward to using it again in March for our Western Caribbean port stops.", "Date": "December 10, 2013"}, {"Title": "I like Love the color", "Author": "Ed", "ReviewID": "R3EWQMK7YONJM4", "Overall": "4.0", "Content": "The product appears to function as described, but have not had long enough to activate all its capabilities.  I wish it came with a printed manual.", "Date": "November 25, 2013"}, {"Title": "OK", "Author": "Yoshio Saito \"Aloha\"", "ReviewID": "R9Q5G9LIZBPVF", "Overall": "3.0", "Content": "I know I cannot expect a lot for this camera because it is just $150! So, it works well and not bad. Easy to use, handy but we cannot expect high quality water photos. Maybe the quality of lens is not good. But it's OK.", "Date": "November 16, 2013"}, {"Title": "Slow Speed", "Author": "Mimi", "ReviewID": "RU7NZJ587IH7Z", "Overall": "2.0", "Content": "This camera is very slow when trying to take back to back pictures.  Also, some pictures come out blurry if taken too fast.  At other times, if the subject is moving, it will also be blurry.  When I first received the camera, this was not the case and now, it seems to be getting slower and slower.  I tried some of the different settings also.", "Date": "November 8, 2013"}, {"Title": "Camera with fresh look", "Author": "Ehrmann, Marc", "ReviewID": "RD8C54AIW5WEY", "Overall": "5.0", "Content": "Nice camera, first pictures seem to have good quality, intented as present for a child, just delivered (Nov 2013), therefore durability to be proofed in future", "Date": "November 6, 2013"}, {"Title": "Excellent", "Author": "DAVID GARRETT", "ReviewID": "R2JNMWY53781Q9", "Overall": "5.0", "Content": "We are getting excellent photos in the Pool of our 3 year old daughter. The high speed feature is great for getting action shots of her jumping in. The quality of the under water photos and video is fantastic. The Auto feature that selected the correct mode works so well we have never manually selected a camera mode.", "Date": "November 4, 2013"}, {"Title": "Great Camera", "Author": "Nate", "ReviewID": "R3802MBTBX9LAM", "Overall": "5.0", "Content": "Great camera. Takes really good pictures. Never did get to use it in the water as we planned. BUT it did get wet by accident and there was no problems with it.", "Date": "October 31, 2013"}, {"Title": "Best purchase I ever made!", "Author": "SP", "ReviewID": "RQ7XOBIXG3BOA", "Overall": "5.0", "Content": "Great product!  Took great pictures in and out of water.  Very fast.. Was able to take multiple shots of fish very quickly!  Would totally recommend for those tropical people!", "Date": "October 21, 2013"}, {"Title": "Not waterproof as advertised", "Author": "Nature Lover", "ReviewID": "R3H0UPMD1QCWT8", "Overall": "3.0", "Content": "Considering its low price it takes okay photos.  Simple controls. Excellent low light pics.  After using it for a couple of weeks for underwater pics in Tahiti it developed moisture problems. This is unacceptable. The camera was never more than 3 feet under water at any time.", "Date": "October 19, 2013"}, {"Title": "Fujifilm Finepix XP60 digital camera", "Author": "Jean P. Colbert", "ReviewID": "R39CI1QRAJFUQ1", "Overall": "5.0", "Content": "This is my first digital camera - I still have a lot to explore about its options. I found it easy to use - and pictures came out in focus even when taken from a moving boat or bus.", "Date": "September 5, 2013"}, {"Title": "Great camera", "Author": "Roberto", "ReviewID": "R3GSJK4ENCGEYH", "Overall": "5.0", "Content": "This camera is awesome. Pictures and video underwater are just amazing. High definition quality and lots of pictures on a single 8 gb memory", "Date": "September 1, 2013"}, {"Title": "Great for paddlers!", "Author": "John", "ReviewID": "R2QQ0FJ69D9LMU", "Overall": "4.0", "Content": "Purpose, intended use:  I bought this for kayaking and Canoeing... fresh water use..Quality of pictures uploaded: It takes good pictures but not great for action pictures.  Movies/video taking works fine.  some have come out blurry.  I need to learn how to get a faster shutter speed for action photos.  When I am still and allowing time to focus it works great.Pros: It is Waterproof, it does download easy,Cons: It doesn't come with a memory card and the internal memory is small.  So, You need to buy a memory card for it.  The owners manual doesn't tell you what you need so you have to research it.General Summary opinion:  I like it because it is an easy to use one hand camera while out on the river.  fBought it on Amazon because I couldn't get the Sam's club cheaper purchase, So for the $, I think it was a good buy.  I am happy with it and will use it and learn to take better pics with it.  I am very active, my family is very active in water.", "Date": "August 22, 2013"}, {"Title": "Good enough for rough work!", "Author": "Gene A. Dobbins Jr.", "ReviewID": "RY4MDE3TJVP1C", "Overall": "4.0", "Content": "This camera was used by myself  and my Grandson with no problems. Video was easy and clear and pictures were very  clear as well. I was a little skeptical of the claims and good reviews but  am pleased that this camera performs very well. I ordered a second battery and charger but the original battery seems to last at least for several hundred pictures all on large fine. The SR (scene recognition) setting seems to work very well . One needs to remember that the lens is near the upper left so fingers don't show up but otherwise it is very intuitive. I do prefer my Canon SX 10 IS digital for serious work as it allows for external flash, 20X magnification and more controllable and creative settings but on program the Canon and Fuji XP 60 on SR pictures seem about the same quality. My Grandson took it into the water but the water was so murky that the results were inconclusive. I plan on taking the  camera into a pool and seeing what the underwater setting will look like. I like the price, the compactness, the ease of use and the many settings that are possible with the Fuji.I should get a floating wrist strap as I worried about my Grandson losing the camera but he kept the included strap on and it worked. It came with a small camera case but I needed to have a bigger one to carry the charger and the battery as well as the camera. It is a Lowepro compact camera case and fits everything perfectly. The camera  also came with an 8gb SD card which surprised me. I downloaded the manual from Fuji's site and saved it to documents as the quick setup manual that comes with it is not the most complete.Overall I would recommend this camera to anyone needing a pretty durable, waterproof and sand proof camera so they could save the DSLR from sand and surf problems and still get very good pictures and HD video.", "Date": "August 22, 2013"}, {"Title": "Waterproof Digital Camera", "Author": "Gerry McD", "ReviewID": "RAZSWBKSTXHVE", "Overall": "4.0", "Content": "I like the pictures it takes, but the instruction manual is a little weak and disorganized. I have not exposed the camera to a wet environment yet.", "Date": "August 22, 2013"}, {"Title": "Wonderful!!!!", "Author": "Kathryn J. Amiel", "ReviewID": "R3HPYG3133VEGV", "Overall": "5.0", "Content": "I bought this for my 16 year old granddaughter.  She uses it everyday and loves it.  It is very sturdy and if you have a teenager you know how careless they can be.  This stands up to the test.", "Date": "August 18, 2013"}, {"Title": "Stuck cmos pixels", "Author": "Kevin Fitzpatrick", "ReviewID": "RCNH2T3LU1X22", "Overall": "3.0", "Content": "I got my camera from Costco. Build quality looks good and I like the locking knob on the battery door. I got this camera to take on vacation for use in the water, however it did not pass the standard test. I took several pictures and videos to ensure the camera works before I leave for vacation. I knew not to expect great quality, but that ok since it was just for water use. I reviewed the pics and vids and found a lot of white specs in them. There was many stuck CMOS pixels. Any dark object was like a starry sky. I googled this issue and could not find anyway to perform pixel mapping. I think the amount of bad CMOS pixels I had were excessive. I think Fuji should have used a good 12MP CMOS instead of the 16MP (seems more like a sales pitch). If it were not for the pixel issue I would have kept it. I decided to try something different since I saw no way to perform pixel mapping. Any one here know how?", "Date": "August 17, 2013"}, {"Title": "LOVE this little camera!", "Author": "Amy", "ReviewID": "RWYUKF8HLE3UE", "Overall": "5.0", "Content": "Amazing quality for the price.  I purchased for my honeymoon because I wanted to be able to take underwater pictures and video.  It does both things quite well.  I was able to zoom in to get crisp shots of sea life as well as action shots of birds in motion.  Sometimes the camera has difficulty adapting to low lighting when on auto, but the sunset and low light settings seem to do the trick.  Macro pictures and panoramas also turned out quite well.", "Date": "August 14, 2013"}, {"Title": "hard to keep lens clean", "Author": "D. Dwin \"D.Dwin\"", "ReviewID": "R2GWVHZLDHUQTJ", "Overall": "3.0", "Content": "i've had this camera for several weeks kayaking and at the beach.  an image sensor defect left a black dot and required a swap at costco.  it takes pretty good photos, and you don't have to worry about getting it wet - which has ruined a few low cost point and shoots for me.  the most difficult thing for me is keeping thevlens clean.  its right where your fingers want tp grab the camera.  also, beads of water will ruin your shots.  this is probably true of other waterproofs because none have lens covers (manual or automatic) for between shots.  now i carry a bunch of disposable lense wipes, but that's a pain.  i wonder if rainx would work, but i would hate to prmenantly cloud the lense if it doesn't.", "Date": "August 8, 2013"}, {"Title": "Fine pix", "Author": "Sal", "ReviewID": "R3TBP55YLXOHDN", "Overall": "5.0", "Content": "Superb under water; excellent beach and extreme low light situations. Multiple settings: very easy software--intuitive. Big screen, easy to see text while snorkeling . Best value out there .But....factory battery drains waaaay too quickly. Get online and spend another $9.00 for third party, higher power battery and life is sweet.I've owned dozens of point/shoot uw cameras. Fuji got it right this time for price/portability .", "Date": "August 2, 2013"}, {"Title": "3rd underwater camera and so far it has survived.", "Author": "Nancy Z", "ReviewID": "RYGSFMC28IHQT", "Overall": "5.0", "Content": "I run through underwater cameras pretty often.This camera is very durable.Battery lasts forever.Great photos and videosuper fast as processing.My fav part is when you flip back through photos to show people it offers a thumbnail view that is very fast.Bout the size of a wallet (with some money in it)", "Date": "August 1, 2013"}, {"Title": "love it!!!!", "Author": "Sandra Rullan", "ReviewID": "R1HR2LVEZXOWAH", "Overall": "5.0", "Content": "Excellent photos, excellent resolution, the best waterproof camera. I using all the time in my kayak fishing days. I make a videos, best buy ever!!!", "Date": "July 29, 2013"}, {"Title": "Digideals4less & Roger A. on the Fujifilm Fine Pix XP60", "Author": "Virginia Drake", "ReviewID": "R3HR8E67BU2ISQ", "Overall": "5.0", "Content": "This camera is a good little camera for a family with kids.  It's hardy, and stands up to it's claims.  If you're going through looking for a refurbished camera and looking to be confident about dealing with a \"seller\" company, Digideals4less is definitely a great company run by an extremely kind individual.  He is superb in his ability to \"MAKE IT RIGHT!\"  You just don't find that everywhere and it is clear why he has a 5 star rating!", "Date": "July 16, 2013"}, {"Title": "Great vacation camera", "Author": "chaos", "ReviewID": "R2CQV2KXABFVGD", "Overall": "4.0", "Content": "This is a nice camera with a lot of nice features. It is 16 MP, it has 5X optical zoom. It has a burst mode which will take several pictures in quick succession. This is a really cool feature. While the pictures I took in this mode were not all perfectly focused, they were okay enough to have fun with this mode. This feature works much better outdoors in good lighting. When I tried it indoors the movement was all out of focus.This camera has 23 shooting modes to choose from! While it's good to have a lot of choices, it can also be frustrating having to scroll through so many before getting to the one you want. There is no dial on the outside of the camera to quickly change the shooting mode. It is done in the menu section.The picture quality of this camera is pretty good. I like that this camera is so durable. Having a camera that is water proof, shock proof, takes good quality pictures, takes good quality video, and is small enough to fit in my purse makes this a good choice as a vacation camera.I find that the dial/lock to open the side battery/SD card compartment to be very annoying. You have to press the tiny button while turning the dial. This is really hard to do.", "Date": "June 23, 2013"}, {"Title": "Nice camera but battery time is lacking", "Author": "Cat", "ReviewID": "R2BYL4PFDQXGXQ", "Overall": "4.0", "Content": "We got this camera as a last minute purchase for our California vacation. We wanted a small camera that could take some punishment. We got this one wet, sandy and dropped it. It held up. The picture quality is good and it was nice to have a small camera to take to places. I have a very nice and rather expensive Cannon that is still my favorite but when I need a smaller one, I will be taking the Fuji. My only complaint about it is that it sucks the battery dry. We spent a long day at Seaworld and the camera died 2 hours before we were done at the park. I've had Fuji cameras before and had the same issue and would always carry extra batteries. Unfortunately, I couldn't get a spare battery on our trip. I just had to make sure to charge it every night and just use it as long as it lasted the next day.", "Date": "June 23, 2013"}, {"Title": "love it", "Author": "Sonya Ramirez", "ReviewID": "R1HKZY4X21P775", "Overall": "5.0", "Content": "Exactly what it says. videos don't download to ipad well. Will be checking into video apps to correct this. Thanks.", "Date": "June 18, 2013"}, {"Title": "Not worth one star!", "Author": "Mr Richard Fan", "ReviewID": "RRGFFW2F9WQJ1", "Overall": "1.0", "Content": "Add me to the owned six months and the repair needed to fix is not under warranty.  How convenient.  The HDMI pins are bent due to my supposed shoving the charger in the wrong hole.  Seriously.  I can manage to charge items that cost much more than this but I can't figure out which hole a charger goes into ?!?!?!  I bet there would be less 5 star ratings after people realize how easily this camera breaks.Done with Fuji.  DONE.", "Date": "February 26, 2014"}, {"Title": "Poor quality", "Author": "JH \"parent\"", "ReviewID": "R29FZ34VWK3L2W", "Overall": "1.0", "Content": "First one never worked, replacement lasted one trip.  Terrible quality, complete waste of money.  Really disappointing for the entire family.", "Date": "September 15, 2013"}, {"Title": "Wonderful Camera! But Definitely Read the Manual :)", "Author": "Tracey Carter", "ReviewID": "R3VOLOH299D88G", "Overall": "4.0", "Content": "I love this camera. It takes beautiful pictures, is compact, sturdy, and easy to use. It's great to be able to have a camera I can safely throw in my purse and take everywhere.It takes pictures faster and the flash resets much more quickly than on my old Nikon CoolPix. The battery life has been great. I've charged it once since I received it last month. Overall I couldn't be more pleased with it.The one negative thing I have to say about the camera is that some of the features and the menu weren't intuitive to use initially. There was a small learning curve, but if I had taken the time to read the manual I might've had an easier time. It may also be because my previous camera was a point-and-shoot Nikon which uses a slightly different menu structure than the Fujuifilm FinePix.When I was first setting up the camera the beeping every time I pushed a button was driving both my boyfriend and I crazy, however, I had a LOT of difficulty changing the key push to silent because I had first changed some other setting while taking some photos and didn't realize that once I put it on a specific mode I was unable to change some of the other settings. After ten minutes of frustration and frantically flipping through the relatively small but informative manual I was able to realize where I had gone wrong, but as a well-educated reasonably-intelligent individual I was aggravated that I had to resort to reading the manual. However, all that aside I really do like this camera and it's a great replacement for my old Nikon and it's so great to not worry about throwing it my purse and taking it to a ballgame or anywhere else.If the menu was slightly easier to navigate and I could have more easily figured how to change some of the settings I'd gladly give this camera five stars.", "Date": "June 27, 2013"}, {"Title": "Fantastic camera!", "Author": "D. H.", "ReviewID": "R3TGK0C0EBNSRR", "Overall": "5.0", "Content": "I love this camera, I use it mostly to take pictures and videos of my 3yr. old grandson. It takes great action shots, and the clarity of the videos are awesome. I have also used this underwater in the pool, and the pictures and videos come out great. This is a wonderful camera to take on vacation, because it is very durable as well. I have dropped it several times, and thank God it is shatter proof, because if this was any other camera, I would be out of luck. The battery holds a charge for a pretty long time, the only thing that I really wish, is that it had a longer charging wire. It is very short, and I have to make sure I have an outlet with a table right next to it. Other then that, I am very satisfied with this camera. Now my daughter wants me to buy her one!", "Date": "June 21, 2013"}, {"Title": "Either the battery or the camera or the charger is Faulty", "Author": "creamycharb", "ReviewID": "R2WFT5IDL3X5AH", "Overall": "1.0", "Content": "I will change my review once I get this issue resolved. Right out of the package i tried to charge the battery. I had it plugged in overnight. the red light on the charger never went out, and the camera would never turn on.I will be returning it.its a shame too, as it was a birthday present, and i wont get a replacement item soon enough for the big day.hopefully i will get this returned and resolved and be able to update my review.", "Date": "May 15, 2014"}, {"Title": "Sweet", "Author": "E. Joel Guthrie", "ReviewID": "R3AND09OI2EN8V", "Overall": "5.0", "Content": "Takes great pictures! All that I hoped for and more out of this little guy. I have big hands but had no trouble using it once I got familar with the controls.", "Date": "April 23, 2014"}, {"Title": "It's ok.", "Author": "Lynn", "ReviewID": "R2B5BL6BF3NZMR", "Overall": "3.0", "Content": "This review may not offer you much insight.  I bought it for my son to use while caving; he liked the micro function of his Nikon Coolpix camera for taking pictures of insects, salamanders, frogs, bats, etc., but was looking for a waterproof camera.  This camera did not live up to his expectations for picture-taking abilities compared to his old camera.  So we returned it.  I don't believe he ever tried out the waterproof aspects of the camera.", "Date": "April 22, 2014"}, {"Title": "Good quality pictures and easy to use", "Author": "Amazon Customer", "ReviewID": "R1OB7PG42J4QQX", "Overall": "5.0", "Content": "We took pictures with this camera both in and out of the water during our last vacation, and the quality is really nice. Plus I like the one-touch movie recording button, which makes it very easy to record a video without messing with dials. One note, though: the battery runs out FAST. When I used the camera for a full-day outing, I definitely had to charge it that night so that it would last through the next day. Plus there's a note in the manual that says the battery charge runs out even when the camera is NOT in use, so you'll want to charge it right before you want to use it.", "Date": "April 17, 2014"}, {"Title": "Very good camera", "Author": "Amazon Customer", "ReviewID": "R2NTFNTSXU4QC1", "Overall": "5.0", "Content": "Works well both under water and above.  Sharp pictures.  Easy to use.  Pictures are much better than from disposable underwater cameras.", "Date": "April 11, 2014"}, {"Title": "Love this camera", "Author": "Todd Silaika", "ReviewID": "R2PQN5D5JOMY5D", "Overall": "5.0", "Content": "This camera takes amazing underwater photos -- it was perfect for our family vacation -- the added features of high quality out-of-water pictures is pretty awesome too!  There are really cool settings for the camera (adding a hint of sparkle, monochrome with a hint of color, among others).", "Date": "April 7, 2014"}, {"Title": "Amazing pictures", "Author": "Eric Powell", "ReviewID": "R1LDRPVUIO8J3T", "Overall": "5.0", "Content": "I just recently bought this for my cruise and cave tubing adventures and bought the Sony 64GB SDHC/SDXC Class 10 memory card.. what a perfect combination. This camera takes amazimg photos and video and performs amazingly well.  The bettery seems to hold it's own too. I bought a spare battery but have not had to use it yet but always have \"just in case\" anyways.  You'll ne happy with this camera!", "Date": "April 6, 2014"}, {"Title": "Love It!", "Author": "Amazon Customer", "ReviewID": "R3D3RX76YB4IEJ", "Overall": "5.0", "Content": "This camera is great!  Got it to keep my 8 & 10 year old off my cell phone camera.  I now use it as much as they do!  TONS of features that really improve picture quality. My favorite is a dual pic function that takes every pic twice, one with flash and one without.  This function has made taking pics for ebay product sales turn out great.  Easy enough for kids to use and I don't worry about them breaking it.  I recommend buying a 32G SD card and a stick and find fob to accompany this so you can find the camera when the kids have wandered off with it.", "Date": "April 5, 2014"}, {"Title": "Camera is flawed but FujiFilm came through", "Author": "Julie Groninger", "ReviewID": "R1BAM2ES3JVE3W", "Overall": "3.0", "Content": "We purchased this camera for our daughters birthday in August.  She used the camera for a vacation in November.  In January, she said the camera would not charge.  I decided to buy a new battery.  The new battery did not charge.  I sent the camera to the FujiFilm to be repaired under warranty.  They denied the warranty stating that the HDMI pins were bent.  We never used the HDMI port.  The camera charges from the USB port.  I contacted the repair center manager and never received a call back.  I have sent several e-mails asking for some assistance.  The only response I received was to contact the repair center to get our issue addressed.  This was the third FujiFilm camera we have purchased, but will probably never buy one again.UPDATE:  We finally got in touch with a manager at FujiFilm repair center.  He explained that it appears that my daughter may have put the plug in the wrong port to charge the camera (to her defense, the ports are almost identical looking).  This caused a pin in the HDMI port to break off and short out the camera destroying the board in the camera.  FujiFilm repair center agreed to reduce the repair cost and actually gave us a new camera and a battery charger we could plug in instead of directly charging the camera.  We are happy that they finally have addressed this and hope they change the design or provide a battery charger with future models.  We have upgraded our rating as the pictures the camera takes are decent but we have spent quite a bit of money on it.", "Date": "April 4, 2014"}, {"Title": "Super little camera!!!!", "Author": "ralph castelucci", "ReviewID": "R661BK4N1LQ6T", "Overall": "5.0", "Content": "Bought this little camera in February '14 for a cruise vacation. I'm a Photographer by trade and definitely didn't want to take my 'good' cameras out in the sun and sand and most definitely not in the water.I used this for the entire week and got some SUPER photos!! I have to say, I was very impressed!!I took it a good 15 feet under the water and swam with it on my arm (with a floating camera strap on my wrist) for hours. It did SUPER! No hesitation recommending this camera. 100% excellent for sun and fun and water play and also from the boat and shore.  Will try to post some pics from the camera.  I bought the green color and it's very pretty and fun!", "Date": "April 1, 2014"}, {"Title": "ALL FUN NO WORRY", "Author": "Barbara L. Gartland \"cabincrazy\"", "ReviewID": "R1MYWV2H1GRKGX", "Overall": "5.0", "Content": "EVERYTHING I WANT IN A CAMERA THATS JUST FOR PLAY.I SWAM WITH IT IN THE ISLANDS AND SNOWSHOED IN WISCONSIN.", "Date": "February 3, 2014"}, {"Title": "quality", "Author": "zenaida", "ReviewID": "R2WWI3O56RY72B", "Overall": "5.0", "Content": "It is everything I expected in this product I really charm throughout both the quality and duration thank you very much.", "Date": "February 2, 2014"}, {"Title": "NO memory card included", "Author": "J. Kellner \"oohjk\"", "ReviewID": "R3JQUABB2S04FZ", "Overall": "3.0", "Content": "There are several posts indicating a memory card is included - NO MEMORY CARD IS INCLUDED.  Budget an extra $20 to get the memory card separately.", "Date": "January 28, 2014"}, {"Title": "Wrong Battery Sent...Need a Customer Service Number if any of you have one?????", "Author": "anonymous", "ReviewID": "R1D7HA6PK43YMC", "Overall": "3.0", "Content": "Well, I think it will be great when we actually get to use it.  It came in a week later than the expected delivery, which was already weeks after ordering it.  Then when we opened the package, there was only a CD manual and not even a professional box to hold the camera...odd.  At any rate, I don't know who to contact to let them know that they accidentally sent the wrong battery.  The battery they sent won't fit the charger or the camera.  So when I find all this out and let them know that I am sure it was an honest mistake and to please send the correct battery, I am very sure that it will be just perfect for my 7 year old!", "Date": "January 23, 2014"}, {"Title": "Takes excellent pictures!", "Author": "Dion \"D Coker\"", "ReviewID": "RZAFTLRJYSAD8", "Overall": "5.0", "Content": "We bought this for our cruise and I must say, this has to be one of the better point and shoot cameras I've owned! At first I didn't think it was taking good pictures at all, but that was actually due to the LCD screen. Once we got home and I moved them onto my pc, the pictures were phenomenal! Takes excellent moving pictures as long as your ready (it does take a an extra second or two to focus, but that's normal for any camera) I was even able to take several pics of a waterplane taking off while standing on the deck of the cruise ship in a summer rain storm and the pics of that came out crisp and clear. I definitely recommend this camera! One extra thing I would recommend is that you also buy the warranty that is offered with it. Your buying a ruggedized camera, not a bouncy ball, and accidents happen!", "Date": "December 23, 2013"}, {"Title": "IMPRESSIVE PICS FOR THE PRICE", "Author": "Bargain Hunter", "ReviewID": "R3L9C0P34RN2BQ", "Overall": "5.0", "Content": "I was concerned about buying this camera because many of the comments implied it takes inferior pictures.  I bought it because I was going snorkeling while on a cruise.  The photos we took while snorkeling were great.  Don't hesitate to buy this camera.  Yeah, there are better ones out there (there always are) but if you don't want to put a lot of money into a camera but need the underwater feature...pick this one.  I was impressed.", "Date": "December 16, 2013"}, {"Title": "Excellent Camera", "Author": "James B. Coates", "ReviewID": "RKSDWO1M5QG5O", "Overall": "5.0", "Content": "I am amazed at the quality of the pictures this camera takes.  It gets a good picture in very low light.  I purchased it mainly for saltwater/fresh water use while fishing and kayaking.  Numerous programs including auto, night, beach, and others.I would recommend this camera especially for outdoor and sports use.", "Date": "October 7, 2013"}, {"Title": "Good camera - love the underwater feature!", "Author": "TexasGirl", "ReviewID": "RBXV5WU4BTATS", "Overall": "4.0", "Content": "This is a really good camera for vacation.  It takes good pictures and works underwater.  I use mine not only on vacation around water, but also for pool parties and other activities during the summer where the is a pool or lake involved.  If you buy the floating wrist strap, makes it really easy to keep track of.I have no real issues with the camera - typical controls, easy to use, takes decent pictures.  The only real downside is the size - it's a little too big for your pocket - does fit but not so comfortable.  That said, it's small enough to carry around and is lightweight.I liked it enough to buy one for my friend for her birthday, so would definitely recommend.  I'd just prefer it be a bit smaller.", "Date": "September 16, 2013"}, {"Title": "Not too bad for a point and shoot", "Author": "sabre03", "ReviewID": "R3ILIUIO7TWO8Z", "Overall": "4.0", "Content": "I purchased this camera to supplement my dslr. It obviously isn't as good as a dslr, but for a point and shoot it's the best one out of four I've had. The action shot's tend to come out blurry, but otherwise the picture quality is pretty good. It's been used in the rain and been splashed with water and still works well. For what it is, and the price I thought it was a descent buy.", "Date": "September 11, 2013"}, {"Title": "Great Camera", "Author": "ZZMom", "ReviewID": "R2EOD0BJJC61JN", "Overall": "5.0", "Content": "After spending countless hours reading reviews of waterproof cameras, I purchased the Fujifilm FinePix XP60 16 MP for our family trip to Belize.  Some folks complain that the image quality isn't that great, but it's an inexpensive point and shoot.  For the price, it is durable, user-friendly, takes good pictures, and most importantly, remains dry! It survived cave tubing and a full week of snorkeling--2-3 hours in the water daily.  There are a lot of imaging options, so if you take a few minutes getting to know the camera before jumping off the boat, it's a breeze to use. The battery life was very good.  I only charged it every other day or so, and that was just to make sure I would be ready to go.  I really like the closure to the battery compartment.  It's a little tricky to open/close the first time, but I felt very secure in that fact that the camera would remain leak-proof.  When I was shopping around, I was surprised at how some other models didn't seem as watertight or durable.We made videos, took low light nighttime pictures, and pretty much gave this camera a run for its money on our 2 week adventure.  I'm looking forward to taking it on another trip soon, as I know it will capture our memories wonderfully.  If I had to complain about anything, I would like better zoom, but really--It's hard enough to photograph a barracuda without worrying about zooming in on that scary grin.  For our purposes, this was the perfect camera and I am 100% happy with my choice.", "Date": "August 3, 2013"}, {"Title": "Good camera I don't worry about breaking", "Author": "Darren Griffith", "ReviewID": "R3EOIF59GL3A1W", "Overall": "4.0", "Content": "The best thing about this camera is that when mountain biking, SUPing, etc. it doesn't break.  It has several nice features, like taking HDR photos.  Several features are a bit too automatic, which makes them hard to use; like the panorama mode.  Overall it takes nice photos that can be shared on line or via a digital frame.  I haven't tried printing any yet.  The photos aren't quite as nice as my other compact camera nor the SLR.  Of course neither of those are waterproof.", "Date": "July 2, 2013"}, {"Title": "takes great pictures", "Author": "darla wotherspoon", "ReviewID": "R3IN3AUIM7SHX6", "Overall": "4.0", "Content": "So far this camera is taking great pictures and is fairly simple to operate. Pictures are clear and full of color. Haven't put it to the water test yet but will be soon. With the 32GB memory card it's more than fast enough to take the action shots we wanted. So Far the battery life is pretty good. It will last all day on for pictures. Haven't tested battery life on videos yet.", "Date": "May 1, 2013"}, {"Title": "Toughness will be tested", "Author": "Kevin Wilcox", "ReviewID": "R8NEU64ZC4S1M", "Overall": "1.0", "Content": "I bought this camera so I could record pictures and videos of my Thanksgiving trip with family. Got home afterwards, satisfied with the hours of video we took and excitedly told my family I'd have an edited video for us within a couple weeks. I was looking forward to providing everyone with a quality production of our time together, but alas that won't happen.After 3 hours of struggling to get the files off my camera, onto the computer, and view them in a workable format I have finally conceded that every single one of my videos and pictures is corrupt and can not be opened. I have downloaded 10-15 programs of varying levels of shadiness trying to fix the broken videos, after it had already taken an hour of problems just to get 10% of the files off this thing and onto my computer. Every program I've tried has said the same thing: \"File can not be opened\". ALL of the videos and pictures I took are worthless and the time I spent trying to get quality shots of my family was a complete waste.We're not trying to be the Kardashians but I did want a nice compilation of memories for my family; apparently I made the wrong decision when I bought this piece of junk. I will try to return the camera to Amazon tomorrow, and if they won't take it I am going to happily smash this thing into bits. I guarantee the \"tough\" BS will not withstand my rage.*EDIT*Amazon did take my return and I'm very grateful, I've always been impressed the customer service of this company. My opinion on this camera, however, does not change. I'll even point out I tested taking a couple pictures on the internal memory to see if maybe the memory card was corrupt. Nope, the camera itself stored every image and video in a format that can't be opened or used.", "Date": "December 4, 2013"}, {"Title": "Bought this to take outdoor video", "Author": "Ken from Honolulu \"Aloha!\"", "ReviewID": "RDOCNTJPQMPXR", "Overall": "3.0", "Content": "I really wanted to buy the Canon D20 but this was such a deal and after reading the reviews here on Amazon, decided to get it. 90% of my online purchases are from Amazon but I saw this on sale at at Costco for $140 and decided to get it. I bought this strictly to take video at the beach or at the pool but haven't got a chance to yet. I have used it indoors and some of the videos were bad. The still pictures, for the most part, were pretty good. I will update this review after I get a chance to take it out in the water.FYI: What was in the package / box1. float strap2. 8GB SDHC (class 4) card3. charger w/ usb cord4. case5. manual (not very detailed) & other literature6. software7. L-Ion battery8. carrying strap9. cameraUpdate: Shortly after my original post, I took this out to Waikiki and the waves were small so it was perfect to try it out. To make it short, the video wasn't what i expected so I decided to return this camera a few days later and just save up for something better.", "Date": "July 3, 2013"}, {"Title": "Alright Fujifilm, I'll give you another chance.", "Author": "Armando N. Roman", "ReviewID": "R3GZAL7FHI2LDJ", "Overall": "5.0", "Content": "Fujifilm first got under my skin a few years ago when I got a point and shoot digital camera by them that was supposed to be the \"best\" one at the store. It ended up taking pictures that looked like they were shot by the first phone to feature a camera. I took it back to the store in less than 24 hours, after trying to get good photos in dozens of different places, with different lighting conditions and with all the settings, and was much happier with the Samsung model I swapped it out for. And now, here I am, 4-5 years after that first disaster, giving a product of theirs 5 stars.The FinePix XP60, despite coming in a goofy array of colors, is one of the better point and shoots I've seen in a couple of years. I'm no camera expert, and everything I learned in photography class 11 years ago has went out the window, so let me just say that all this camera has earned the mostly positive reviews here. It's fast to take pictures, doesn't take seconds to get ready for another one, and performs perfectly underwater. It's cool to be recording a video above water, then going under and coming back up to finish a shot, as basic as it may seem. Kids will love taking this little doozy into the pool with them, and there's a good chance they'll be filming some pretty fun things with it.This camera was made for trips to the beach or the pool. Be sure to get a big memory card if you plan on giving this one to the kids for a little bit!", "Date": "June 20, 2013"}, {"Title": "Terrible camera, terrible video, just plain awful.", "Author": "S Surveyor \"Amazonion\"", "ReviewID": "RPL3FG8A908CQ", "Overall": "1.0", "Content": "The lens on this camera is so bad, every picture's resolution is worthless at the edges.  Video and picture quality is ruined by the terrible sensor.  Noise and fuzz, shimmering skies, you name it this camera does it worse than most.  Even bright sunny days (don't even try less than full sun or indoors) result in terrible results.  It's the worst camera I've ever owned.", "Date": "May 22, 2014"}, {"Title": "Worth the buy", "Author": "Robert", "ReviewID": "R2MS8N1ZQDUSLP", "Overall": "5.0", "Content": "The waterproofing and underwater aspect were great. It has good low light qualities but seems to over expose on any setting during some types of lighting environments. Overall, worth it, very satisfied.", "Date": "May 15, 2014"}, {"Title": "Great Camera: under or above water!", "Author": "Troy", "ReviewID": "R1QRCR62U45NH5", "Overall": "5.0", "Content": "Good camera, seamless operation and good quality shots. Highly recommended for your casual daily use camera, trips, or capturing great moments underwater.", "Date": "May 14, 2014"}, {"Title": "Worked Great on the Honeymoon!", "Author": "RyanG", "ReviewID": "R37BFLJFSYRH7Y", "Overall": "5.0", "Content": "My wife and I wanted a waterproof camera so we could take pictures on our honeymoon to Punta Cana. After doing lots of research, I eventually purchased this camera based off of the reviews.The camera worked great; we were in either the ocean or pool pretty much all day, and we never had a leaking problem or any issues with the camera.The picture quality was great, and we were able to get some pretty cool shots in the water. The buttons and interface was easy to use/learn as well. Its nice to have a instant video record button, and not have to switch settings around.I highly recommend this camera!", "Date": "May 14, 2014"}, {"Title": "Nice camera", "Author": "Kay J. Leick \"Kay\"", "ReviewID": "R2FY8I5NZX737C", "Overall": "5.0", "Content": "I like the fact that the camera is small and able to use it in water. It takes good pictures. I use this camera when I don't want to carry my bigger camera along with me and when in the water.", "Date": "May 10, 2014"}, {"Title": "great camera", "Author": "Roberto Valadez", "ReviewID": "R2ID1KA03G00KF", "Overall": "5.0", "Content": "I bought this camera for my family to use and it has been nothing but great surprises with this little camera. I love it.", "Date": "May 8, 2014"}, {"Title": "great refurb", "Author": "suzyQ", "ReviewID": "R2RS2QJBY9926P", "Overall": "5.0", "Content": "Easy to use, recently used it on a river rafting trip & it took a beating but still works like new.", "Date": "May 8, 2014"}, {"Title": "Love it and I'm a pro.", "Author": "Ron B.", "ReviewID": "RYFLOYSOXYLOB", "Overall": "4.0", "Content": "I was looking for a replacement for my GoPro. This camera does it all and better. Take a close look at what it can do.", "Date": "May 1, 2014"}, {"Title": "Great bang for your buck", "Author": "Anonymous", "ReviewID": "R12GHE0WDVVO75", "Overall": "4.0", "Content": "Takes decent photos and is great for the beach and other outdoor occasions. I tested it out in the sink and have been using it instead of my other camera to get used to it.  I like it a lot.", "Date": "April 30, 2014"}, {"Title": "Good value for the money - would recommend", "Author": "HoustonTX", "ReviewID": "R3BKGGJH8TP64F", "Overall": "4.0", "Content": "I am by no means an expert, but do have several higher-end cameras (including an older Nikonos 35mm underwater camera used for diving).I bought this camera as a low-price option to take on vacation that the kids could use in the pool and at the beach and also could be used for snapping quick pics at dinner as well.  I was a little leery as some of the reviews were negative on picture quality.  Consumer Reports also gave it a lower rating, but I decided to give it a shot anyway.Overall, I'm happy with the purchase - the picture quality was pretty good and definitely good for the price of the camera.  It worked well for us in all situations (on land and in the water) and is easy to use.  It has some interesting features and filters that were fun to play with.I would recommend purchasing a floating strap to keep from losing the camera (I didn't lose it, but came close on one occasion).", "Date": "April 25, 2014"}, {"Title": "Good Camera but WAY overpriced on Amazon", "Author": "Don", "ReviewID": "RG6OK17KYOUQ7", "Overall": "4.0", "Content": "I reviewed this camera in and out for about 5 days, wanted something we could take on our cruise that would take a beating while being waterproof and this one fit the bill, I will say there are a ton of features on this camera that will take some getting used to. One thing I want to point out is the price has increased on Amazon over the last month, in Jan of this year it was $124, now its $50 more (prob has to due with spring time), anyway we searched and found it at our local walmart April 1st for $126 plus tax. These are cheaper on ebay too BUT you will NOT get a manufacturers warranty if you buy on ebay so keep that in mind, you have to buy from a FujiFilm authorized retailer (like amazon and walmart are). Only reason for 4 starts is due to Amazons high/increased price.", "Date": "April 2, 2014"}, {"Title": "great camera", "Author": "Steven S. Abadi", "ReviewID": "R3LIZMPP5N3COM", "Overall": "4.0", "Content": "bought this camera used for a coworkers birthday that wanted a waterproof camera and she was very satisfied with the quality and durability of this camera!", "Date": "March 31, 2014"}, {"Title": "The BANG for you BUCK$", "Author": "Jose varela", "ReviewID": "R3WB0VOYCVE25", "Overall": "5.0", "Content": "Simply Amazing!! Couldn't of asked for a better camera for that price. WELL worth it went snorkeling with it battery last very long.", "Date": "March 30, 2014"}, {"Title": "Absolutely wonderful underwater camera!!!!", "Author": "Jessica", "ReviewID": "RYX67E1U4L8HZ", "Overall": "5.0", "Content": "Takes awesome underwater photos and  underwater panoramic photos!!! Brought it on our caribbean cruise and captured great pictures! Would highly recommend this camera for anyone!", "Date": "March 29, 2014"}, {"Title": "Victor O", "Author": "Victor Olivera", "ReviewID": "R8IJ3U0X0I9D0", "Overall": "5.0", "Content": "Is what i was looking for and more!Is great!!!The pics are fantastic and the films are so good!", "Date": "March 25, 2014"}, {"Title": "Great pictures", "Author": "Bonnie Cole", "ReviewID": "R2NAJ9GG6DRP6J", "Overall": "5.0", "Content": "I bought this camera to go on a cruise and we had a lot of water activities planned. It was great, took good pictures and movies in and out of the water.  The screen was easy to see what you were shooting at. One thing I didn't like is its to easy to cover the lens when your holding the camer because it's in the coner of the camera.  It would also be nice if it came with a float strap since it's a water camera.  I would recommend buying this camera, for the price it's a good little camera.I was unhappy with the shipping time. I paid extra for expedited shipping and it took 5 business days to receive it. It came the day before we left, so it left very little time to get acquainted with how the camera worked.", "Date": "March 24, 2014"}, {"Title": "Pretty great", "Author": "Angela Johnson", "ReviewID": "RVSMR5XD9SH3V", "Overall": "4.0", "Content": "I bought this camera because it was waterproof, high megapixels at a reasonable price with decent reviews. Over all i like the camera. Its nice looking, easy to work, has some great features, etc. it doesnt take as high quality pictures as i would like. U have to use a tripod to get actually great pictures to avoid any bit of blurriness. I was also not impressed with the macro feature either. As a nature photographer i take a lot of close up pictures and wanted a compact camera that could take great photos. All in all for the price, u really cant do much better though. I do recommend it.", "Date": "March 23, 2014"}, {"Title": "FujiFilm FinePix waterproof camera", "Author": "ANDREA JORDAN", "ReviewID": "R1WS3CMXGGBJSP", "Overall": "5.0", "Content": "I took this camera to the Bahamas. Although i did not get the opportunity to take underwater pictures, the other photos turned out amazing.  My new go to travel camera", "Date": "March 21, 2014"}, {"Title": "like camera, vendor not cooperative", "Author": "Just Dan", "ReviewID": "R2KKU3G0BAD1AL", "Overall": "5.0", "Content": "I like the camera, does what I expected.Accidentally order went through twice. Received camera from vender just in time to leave for vacation, so was unable to request return of second camera. Now over 30 days vender refuses to accept the return of the UNOPENED, unused duplicate camera. I will be sure NEVER to order if KNOCKOUT DEALS is the vender.", "Date": "March 21, 2014"}, {"Title": "Fantastic crisp pictures!", "Author": "Francette Trasybule", "ReviewID": "RF9U9AKNKVGM0", "Overall": "5.0", "Content": "Went on a trip to Costa Rica and we were afraid to put the camera under the water, but the pictures came out great! We did snorkeling and took pictures of fish underwater. Bright and clear with no damage to camera or pictures. I highly recommend it!", "Date": "March 19, 2014"}, {"Title": "Great camera.", "Author": "Michael W Sefton", "ReviewID": "R3ISPNBFH8DNCO", "Overall": "5.0", "Content": "I really enjoy this camera. I am anxious to try it under water. It arrived sooner than I expected and the price was good.", "Date": "March 18, 2014"}, {"Title": "Great Quality!", "Author": "Doug Rowand", "ReviewID": "R2Q8VJATUT4CRN", "Overall": "4.0", "Content": "We took a sailing trip where this camera was constantly in a wet swimsuit or pounding surf and it held up beautifully, and more importantly took great pictures!", "Date": "March 17, 2014"}, {"Title": "Perfect", "Author": "Mrs.Reiter", "ReviewID": "RAIXV4BF5GQH4", "Overall": "5.0", "Content": "Got this camera for our honeymoon in hawaii. I have zero photography experience. The pics we took all came out fabulous! Took lots of underwater as well as above water shots all were awesome! Great easy camera to use.", "Date": "March 17, 2014"}, {"Title": "amazing!", "Author": "kathleen dalton", "ReviewID": "R1SM63QSQIUZUM", "Overall": "5.0", "Content": "This is the best camera ever! I got amazing underwater pics and videos! It also works amazing out of water! Highly recommend this product!", "Date": "March 14, 2014"}, {"Title": "Awesome camera", "Author": "Julio", "ReviewID": "RLEN5UO6UMKT0", "Overall": "5.0", "Content": "Great camera and awesome to use in the water just like advertised. Would defenately purchase another one in the future.", "Date": "October 13, 2013"}, {"Title": "Had a dead pixel in it.  Also, no paper work was in the box.", "Author": "Old Time Rock Lover", "ReviewID": "R3BY5I6IWDBBZA", "Overall": "3.0", "Content": "The basic design of this is fine.  The unit had a dead pixel in the lower middle of the sensor.  No paperwork was in the box upon delivery, so that did not facilitate return.  Time is valuable, wasting time on stuff like this is not.  If Amazon reads this and wants to get me my paperwork, fine.  I don't even know how to \"take care\" of something like this, but from what I gather if it is not sold directly by Amazon, you won't necessarily get satisfactory return service from the seller, and as for shipping it back to China, good luck.", "Date": "October 2, 2013"}, {"Title": "Can't go wrong in or out of water", "Author": "jay", "ReviewID": "R3BITTR8JJ0QOL", "Overall": "5.0", "Content": "Great Camera pictures are excellent battery lasted 3 days we even had thrown it of the cliffs to each other to get picture of cliff jumping no major impact but more than a standard camera could take inside stayed dry under water", "Date": "September 30, 2013"}, {"Title": "Excellent, Works as Designed", "Author": "stuffintn", "ReviewID": "R1E8HYGORRK0EW", "Overall": "5.0", "Content": "takes excellent pictures in water or out, took to Florida and was able to use in ocean and pool, worked great", "Date": "September 27, 2013"}, {"Title": "Works well", "Author": "Carol12345", "ReviewID": "R2E6LAKFJLIADI", "Overall": "4.0", "Content": "Works well.  I like the features (works in lots of light settings, can take panoramic, etc.).  Haven't tried to use it underwater yet.  I'll update review after I've tried it.", "Date": "September 22, 2013"}, {"Title": "Cool camera", "Author": "Corrinne Babbitt", "ReviewID": "R3KYNFF1NV876G", "Overall": "5.0", "Content": "Like the underwater capability and ruggedness. Wish it focused better and took faster pics (I have it on the fastest speed and its still slower than my cheapo camera). Doesnt zoom as far as my cheapo either, which made me sad. But good pixels, good size (fits in my pocket), nice settings, cool colors and good for people with toddlers who like to take pics on their own too (my 2 year old loves it).", "Date": "September 8, 2013"}, {"Title": "Waterproof on a boat is a good thing", "Author": "Sam A. Molletti \"Captain Sam\"", "ReviewID": "RAZC5HQQTX0GI", "Overall": "4.0", "Content": "My last camera, also a Fugi, did not survive a dunk in the bilge.  This camera has the same operating system but is waterproof, so far..", "Date": "September 5, 2013"}, {"Title": "Good, strong camera!", "Author": "Lindsey", "ReviewID": "R2G1UYYMXCBXFG", "Overall": "4.0", "Content": "This camera is truely eveyrthing proof like it advertises but some of the pictures are a little blurry at times.", "Date": "August 20, 2013"}, {"Title": "Gotta Love Fuji, just not the Fuji XP60", "Author": "Pilotjay", "ReviewID": "RAZM67BGUTNJC", "Overall": "2.0", "Content": "I'm happy to have a Fuji again. IMO Fastest camera from \"ON\" to shooting. I used to have the Fuji F700 and missed it greatly. It finally failed and I switched to Nikon. The Nikon L120 takes about 5 seconds \"ON\" to shooting and is bulky. This Fuji XP60 is fast, takes good photos, light, small, waterproof, dustproof, shock resistant...perfect for an active person. I can carry this everywhere I go easily! The only feature this camera is missing is full manual control, shutter speed longer than four seconds, so time exposures are not possible.UPDATE: Photos taken from distance lack any detail. The picture quality is substandard and I am very disappointed with this camera. I'm going to try the Fuji F660EXR. I love Fuji's speed, but I require quality photography. I really miss the Fuji F700!", "Date": "July 23, 2013"}, {"Title": "My daughter took it to Antigua.", "Author": "Henry Rodriguez", "ReviewID": "R28UQCLJVU404G", "Overall": "5.0", "Content": "I got it for her and she loves it, in the water out of the water.  She took a ton of pictures.", "Date": "July 21, 2013"}, {"Title": "Fun Camera! Quality Photos!", "Author": "anon \"anon\"", "ReviewID": "R1QTIE7IX40IU1", "Overall": "5.0", "Content": "This is going to be a lot of fun this summer. My daughter is anxious to take this to the pool and beach. But we tested it out today by using a plastic container filled with water and some sea shells and sea glass. It felt strange at first, purposely putting a camera in water. I kept feeling like I was going to ruin it, but of course, it is waterproof so it was fine. I posted some of the photos here, up above at the top of this amazon page.We took the pics in our carport, so it was shady, but still they came out pretty good. I have not edited these at all, but it would be easy to brighten them a little using Picasa (free download from the internet) or whatever photo editing program you like to use. For one picture I held the lense halfway above the water and halfway under the water. I went in and added a small red mark so you can see where the water line is. That might be a fun angle to use in some of the water pics this summer. The rest were taken with the camera completely submerged. We used the water setting (and there is even a macro/small-detail water setting, but we didn't need that). I am really happy with the way they came out. I was worried an underwater camera would show a lot of distortion and blur, but happily that was not the case.I also posted one picture of my chicken so you can see what regular, non-water photos come out like. My daughter took this one and said she just had it on the auto setting. I love how close up you can get yet it's still so clear and clean.My family and I are going to get a lot of use out of this camera!edit 8/3/2013: I took my daughter and her friend to the pool this weekend and we brought the camera. They had a blast! They took pics, but also made videos of each other jumping in, and swimming underwater. It was really neat to come home and look at the pictures and watch underwater videos. This is a lot of fun. If you like the pool or beach, this is a great camera for you. My favorite video was my daughter swimming in circles underwater around her friend, then popping up and seeing her friend above water. It reminded me of a shark's point of view, in a goofy way. Just one more way to perserve summer memories. :)", "Date": "June 19, 2013"}, {"Title": "Do Not Buy This From Amazon", "Author": "Ashley", "ReviewID": "R2CWVHIGNQYV6P", "Overall": "1.0", "Content": "I bought this a few months back and only got to use it once before it just stopped working for no apparent reason. It was too late to return it back to amazon.com, and it is covered under one year warranty by Fujifilm but, as I just found out, you need a camera serial number on your receipt (for proof of purchase for that certain camera for the warranty) and amazon.com does NOT keep track of serial numbers of consumer electronics they sell. So I am s*** out of luck. I even brought it to a local photo store and they said it does not look water damaged and there are no dents, so it is an electronics issue that would (hopefully) be fixed under warranty IF amazon.com would have kept track of serial numbers. I don't have any complaints about Fujifilm or this camera, because events like this do happen with electronics, but I will NEVER buy anything that could be under warranty from amazon.com EVER again. I am not going to risk this chance and waste another $150.", "Date": "April 30, 2014"}, {"Title": "Outrageously Good", "Author": "Mark King", "ReviewID": "R3RNFT77UV5Y6S", "Overall": "5.0", "Content": "I love this camera, it shoots amazing photos and videos. I bought it to take diving in Jamaica, but I had it for two months before the trip. I fell in love with the compact size, easy operation and the fact that it's sealed against rain, dirt and dust. I took a lot of photos with it before I took it diving and I was worried that maybe it would not be water proof.Finally the day came, we went diving, the pictures and videos turned out amazing. We used the camera down to 12 foot depths and never had  a problem. Everyone who has seen the pictures is amazed that we did them with a $130 camera. A 32GB SD Card had plenty of capacity for a whole week of photos and videos in Jamaica. We're very happy with the camera.Several people who saw us using it asked what it was, I was glad to tell them how happy I am with it.I really think that if someone has a problem with water getting in they did not have the door closed correctly. It could be easy to get the wrist string in the gasket and deform it, then you're going to have problems. I was very careful every time I opened and closed my camera and I had zero problems.We may get another one just so we have a back up, we really liked it a lot.", "Date": "May 20, 2014"}, {"Title": "if you don't have a waterproof, you need to get one", "Author": "Elle", "ReviewID": "R1KR3K8695IDUO", "Overall": "5.0", "Content": "finally a waterproof that functions as well as your typical portable camera. something that your typical portable camera does not have is a record button instead of a record-setting. a single button push start your videos from the shooting mode. by the end of my trip I was not even using my Sony Cybershot anymore.", "Date": "September 16, 2013"}, {"Title": "Works Fine In Pool", "Author": "Phyllis T. Smith", "ReviewID": "R35O4O21EDKVF0", "Overall": "5.0", "Content": "II'm not a particularly sophisticated photographer--this is only the second camera I've had in the last ten years.  I wanted something rugged that would be simple to operate.  Also was fascinated with the idea of taking pictures underwater in the pool. This is easy to use and yes, it works fine under water. I got some nice shots of friends swimming and look forward to using this a lot this summer.  Nothing to criticize because so far I am completely satisfied.  I particularly liked how easy it was for a relatively inexperienced photographer like me to learn to use.", "Date": "June 21, 2013"}, {"Title": "Fantastically nice little camera for the intended use.", "Author": "Narut Ujnat \"Enthusiasm is contagious.\"", "ReviewID": "R3LH71L33JZM7C", "Overall": "5.0", "Content": "As I am sure many people have experienced the wish that the nice little digital camera could be practically used in environments that no one would have anticipated years ago.  I do sure remember using film cameras that were disposable at the beach and during snorkeling trips.This camera is digital, and is able to be used in places we just might talk about at a fancy party.1.  What's in the box?:  You receive the camera (I received the blue version), a battery, a cord, a charger (with USB cord), and a instruction book with a CD manual.2.  Aesthetic:?  First off, the camera is a nice small size that is about the size of a palm for a larger person, or a entire hand for a child: the camera is not large.  The camera coated with some rubber like matierial on the sides and the back.  The lens is on the top right (facing you on the front), with various buttons on the top (including power) and a nice display with the expected buttons on the back next to the display.  On one side, there is a big button that rotates to securely hide the brains of the unit (picture card, etc).3.  Use:?  I am familiar with Fujifilm based on another excellent camera I tried some months ago.  I will say that this camera is not in the same universe as far as function.  That is, this camera is for taking pictures in a demanding environment and so film images are not going to be as high quality.  There is no practical zoom on the camera itself as the lens does not move.  You do get 5X zoom, but that is very limiting.  The power up is extremely quick on this camera, which is excellent.  there is also a appreciated 'burst' function that allows for quick  numbers of pictures during an action sequence, for example.  The functions are almost standard today in terms of the ability to display pictures, turn flash on and off and the like.  There are some neat features you can use for stringing together videos, plus functions for different locations which is a very nice feature.The pictures themselves are very nice with the 16MP camera.  For simple point and shoot, the camera takes nice pictures, and I wouldn't complain about quality for simple shots with little composition (in other words quick pictures at the beach, hiking , etc.)  As there is no real zoom, distance shots are not excellent and should not be expected.  Most of the shots should be close-in and not yards away for the best results.  The flash is not overwhelming, so night shots in lower lighting will not be excellent, but serviceable.  (Again, form over function is some cases with this camera).Waterproof?:  I have not tested this camera underwater - yet.  But, I have placed the camera underwater in a sink, and in the shower and the camera has not died.  In fact, the brains (the card port, USB port for charging, and the mini-HDMI for display) are under one opening door. This door has a clever button to push down to open and must be turned to open or close.  You hear a nice click when the door is secured. Also, if you examine the parts, you see a nice silicon seal that has a nice metal fork with puts pressure to seal the camera off from water.  Of course, water pressure will also help to seal off the camera.  It seems secure, and it is difficult for this to be opened accidentally.In short, I am impressed with this camera for what it is.  It will survive water and other bad actors and allow you to take some nice pictures (with the proviso above) as well as video for those trips during which taking your phone is just not the smart thing to do.I will update the review as I continue to mess with more functions of the camera and use it in more demanding circumstances.", "Date": "June 6, 2013"}, {"Title": "Fun camera", "Author": "Michelle Sachtjen", "ReviewID": "R1KHCEVS8AT5TX", "Overall": "5.0", "Content": "I love that it's water and drop proof! Fun pool pictures without freaking that the kids are splashing near my camera! I do wish it had more zoom. Glad I didn't sell my other camera. I will still use it when I need more zoom.", "Date": "April 22, 2013"}, {"Title": "Does Not Impress Me a Bit!", "Author": "Tech Weenie \"T. Weenie\"", "ReviewID": "R3JXPZ2JHTVIF5", "Overall": "2.0", "Content": "I own this camera but bought it elsewhere. I figured at 16 megapixels it would produce some pretty outstanding images but it doesn't. My iPhone 5 absolutely blows this thing away on image quality. About all I can give it credit for is being water-resistant. Images are noisy at any ISO and the autofocus sucks. It will not isolate and selectively focus on a closer subject even when set to center focus and macro settings. A real loser in my book!", "Date": "April 11, 2013"}, {"Title": "Great delivery", "Author": "Icarus \"Icarus\"", "ReviewID": "RIXTKURCFC42W", "Overall": "5.0", "Content": "Going on a cruise next month and wanted something durable. I've taken a couple of pictures so far, but nothing wet or wild yet.This item was delivered extremely quickly! Ordered on Sunday and bit was in my mailbox on Tuesday. Haven't had any issues to even need customer service but if it's anything like the delivery service I'm sure I'll be happy.  I did also purchase the wrist band and data card that were recommended for it.", "Date": "February 9, 2014"}, {"Title": "Great beginner camera", "Author": "Psychdrk", "ReviewID": "R2LU0AHZZAEU95", "Overall": "5.0", "Content": "Got this for a 10-year-old boy to make videos and take photos. It has great durability and takes fantastic photos for him!", "Date": "September 20, 2013"}, {"Title": "battery completely dead after 9 months (only a couple of usages)...", "Author": "suxiang gong", "ReviewID": "R2PYUEZI7K5HYY", "Overall": "1.0", "Content": "I feel obiligated to write this review and let people be aware...We planned for months a snorkeling trip to Cancun and we found out the night before our flight that the battery is dead and cannot be charged.  It worked well with the AC connected so we didn't notice.  We had to buy a couple of disposable cameras in Mexico so that we won't completely miss the moments in our snorkeling trip.  I was furious as we bought the camera about 9 months ago and used it only a couple of times! It is totally a design defect.  User be aware:  If you are planning to take the camera to an important event, buy something more reliable.  We are very disappointed!", "Date": "March 18, 2014"}, {"Title": "Love it", "Author": "vic", "ReviewID": "RLSGS2843YUH", "Overall": "5.0", "Content": "just finished a trip to the philippines and it works great. im just a causual user...great in the ocean and pool.", "Date": "April 30, 2013"}, {"Title": "I HATE THIS PIECE OF CRAP.  And their customer service is USELESS AND INCOMPETENT", "Author": "anonymous", "ReviewID": "R3DJV9K5UUG4PW", "Overall": "1.0", "Content": "This stupid camera is the worst piece of crap ever.  I bought one in August and it's made two trips back to the manufacturer.  It's currently there right now because (two weeks after receiving it) their useless customer service team of 3 guys can't get their act together and do work.  It's insane; the manager promised me rush delivery on my exchange as soon as he got it.  Now, they just keep hanging up and putting me on hold without doing anything.  I paid $200 to never be able to use my camera.The reason it went to the shop?  The focus stopped working.  Also, even though it's waterproof, there was saltwater damage to the battery compartment.  Ridiculous.  Then, the replacement they sent me had the EXACT SAME PROBLEM.  It is truly a cheap, worthless camera.  Spend the extra $30 and get a Samsung.", "Date": "July 1, 2013"}, {"Title": "One sweet camera", "Author": "Colorado Hermit \"ColoradoHermit\"", "ReviewID": "R1Z10ZZW7FD6PJ", "Overall": "5.0", "Content": "I have a couple other digital camera's, a Canon PowerShot S3 IS and a old Kodak EasyShare. This one is just as easy to use as the simple Kodak but takes great photo's as nice as the Canon PowerShot S3. It's one nice Point-n-shoot camera. I haven't had a chance to try it under water yet though. That will come later this summer when I make a trip down south to southern Oklahoma to see my old friends and get some Bass fishing in. I highly recommend this camera for anybody that doesn't like the over complicated ones and cant get a steady picture out of the smaller point and shoot.", "Date": "June 27, 2013"}, {"Title": "Thrilled to have this camera", "Author": "Duane Sparks \"Duane\"", "ReviewID": "R10M83L8R6QIOV", "Overall": "4.0", "Content": "Upon receiving the camera today, I immediately opened the box to try it and see what it was like.  I've never owned a waterproof camera and we are going to the Florida Keys for snorkeling.  I am SO anxious to see how good (or bad) the photos taken underwater will be.  I like the idea of the complete manual being in the camera.  I haven't taken enough photos yet to test the battery life, but it charges quickly and the charging plug makes it easy to use.  It is a little small for my large hands and the buttons feel a bit tiny, but they have a nice firm touch to them.  I tried with my diving gloves on and there was sufficient feel to make me confident I could operate it underwater.I took outdoor photos in bright sun, both closeups and using the optical zoom.  All photos were simply excellent.  There was the slightest bit of blurring in the zoom photos when set at the greatest distance from camera shake.It was quick to warm up when first turned on, and took very little time between snaps.I am still skeptical of anything underwater ( I never wear my waterproof watch in the shower), but I am tempted to fill our bathtub to the top and try this out.  I won't do that...but the idea is there.I highly recommend this camera based on one day's usage.  If that changes, I will modify my review.", "Date": "May 20, 2013"}, {"Title": "trash", "Author": "turtle man", "ReviewID": "RFR66JSL20JCF", "Overall": "1.0", "Content": "bought on sunday took out in boat monday, never used underwater at most misted from sea spray, did not even last till the end of the boat trip, i think i might have set a record for fastest broken camera", "Date": "May 28, 2013"}, {"Title": "Package was torn,, Obviously NOT NEW", "Author": "arock", "ReviewID": "R2R4U40N3VX43G", "Overall": "2.0", "Content": "Obviously not a new item even though advertised as new. The packaging had a huge rip in it. The whole bottom right corner is torn off. Nothing inside is sealed. This was intended to be a gift. Now what am I supposed to do??", "Date": "July 8, 2013"}, {"Title": "Poor and Inconsistent picture quality", "Author": "Robert M", "ReviewID": "RC29X8YH7AUUJ", "Overall": "1.0", "Content": "Some pictures are in focus but far too many of them are not despite have the camera focus on the subject.White balance is usually off also.I compared this to my Olympus TG-1 and there is no comparison. The Olympus is much better albeit more expensive.", "Date": "June 1, 2013"}], "ProductInfo": {"Price": "$179.95", "Features": "Waterproof to 20 ft., Shockproof to 5 ft., Freeze proof to 14°F and Dust/Sand proof\n2.7-inch TFT color LCD monitor\n16.4 million effective pixels 1/2.3-inch CMOS image sensor with primary color filter and Optical Image Stabilizer\nFujinon 5x optical zoom lens with approx. 2x digital zoom (up to approx. 10x, with 5x optical zoom)\nFull HD movie recording (1920 x 1080p) with a dedicated Movie Recording Button and Burst Mode Button", "Name": "Fujifilm FinePix XP60 16.4MP Digital Camera with 2.7-Inch LCD (Blue)", "ImgURL": "http://ecx.images-amazon.com/images/I/51xLKuRGJXL._SY300_.jpg", "ProductID": "B00ATM1NBO"}}