{"Reviews": [{"Title": "Great pictures, great value.", "Author": "Goodman916", "ReviewID": "R1I2APEHY0PETZ", "Overall": "4.0", "Content": "I purchased this camera on sale with reservations. The price of the camera droppedand the lower price seemed to indicate a lack of confidence or something worse. Afterusing the camera and viewing its pictures. I am very happy with the results. I am gladI purchased this camera at a good price.Pros-CostSizeFeaturesPIcture QualityCons- Low light pictures are average at best.Overall  I would highly recommend the camera especially to persons seekingevery day pictures. The amount of features on this camera makes it a bargain.Even with the low light images just being fair. I would not hesitate to purchasethis camera again.", "Date": "February 23, 2013"}, {"Title": "Amazing price.", "Author": "Stephen Mathews", "ReviewID": "R2MIGZIK7MB8G3", "Overall": "5.0", "Content": "The Samsung ST201 is a good camera for a great price.  I was skeptical at first that I wouldn't like the images when ordered it since I am used to my DSLR's image quality, but that was all put to rest when I actually got this camera in my hand.  This camera is one of the most under-marketed camera's available. I would have never found it if I hadn't seen it listed on Woot.com.  Granted, this camera doesn't measure up to up to that of a DSLR, but it is still quite respectable.  The build quality is above average, and so are the images.  I'm a very negative person, but I only have two cons. 1) The image quality with a high depth of field lease some to be desired. 2) Not the best of images in low light, which is to be expected coming from a DSLR user.  3)  It uses micro SD cards which is a con for me seeing as I already have a bunch of money invested in normal SD cards. Although, it doesn't bug me too much because it does help reduce the size of the camera and, when I decide to change cameras again, I can always throw the Micro SD in my phone.  All in all, it is a very nice camera for a great deal. Especially since I picked it up for 50 dollars, but at standard price it still would be a great choice.  I like the image quality. I bought it because I don't always want to be carrying my DSLR around with me and this is very portable.", "Date": "May 23, 2013"}, {"Title": "More than I thought", "Author": "Ryan Fordan", "ReviewID": "R1MVRGDWPFDZBU", "Overall": "5.0", "Content": "Great camera and even a better price!!!  So many features, I would highly recommend this camera for the price point.", "Date": "June 18, 2013"}, {"Title": "Love this camera !", "Author": "Donna Shaw", "ReviewID": "R3V4SSN3VEDYLK", "Overall": "5.0", "Content": "Love this camera, the price was $20 cheaper than Walmart & on top of that it had all the aspects that I was looking for : rechargeable battery, 10X zoom ,16 pixcels, great for an inexpencive camera , easy to use , I received in it in just 4 days ,very pleased !", "Date": "April 9, 2013"}, {"Title": "It gets the job done", "Author": "Nulani", "ReviewID": "RE94GEB91SGCW", "Overall": "5.0", "Content": "Not a fancy camera, but easy to operate.  The photos are fine.  The price is right.  I'm pleased with it.", "Date": "January 5, 2014"}, {"Title": "The memory don't SDCH only micro SD", "Author": "Roxana", "ReviewID": "RM66RGZOHAHRH", "Overall": "2.0", "Content": "The camara is Ok. But in descripcion say accept SDCH and a buy this memory, that don't put them...DONT BUY SDHC FOR THIS CAM.!", "Date": "January 3, 2014"}, {"Title": "Bought for my wife for christmas.", "Author": "Reichly", "ReviewID": "R32LCOLAV0FC0D", "Overall": "5.0", "Content": "She loves it and it works so much faster than here old canon poc. Nice size to fin in pockets and takes great pics.", "Date": "December 27, 2013"}, {"Title": "Everything I wanted", "Author": "Barb", "ReviewID": "R1XGRHB41HAPMV", "Overall": "5.0", "Content": "Very easy to use and takes great pictures.  I looked a long time and this camera meets all my expectations.", "Date": "October 2, 2013"}, {"Title": "Excellent camara for the money", "Author": "Steven R. Murray", "ReviewID": "R2D35C48OGV8EG", "Overall": "5.0", "Content": "I love this camera.  Talked my sister in law into buying one too.  Great optical zoom (16mp) and loads of features for a point and shoot.  Far easier to carry around than my Canon SLR.", "Date": "August 13, 2013"}, {"Title": "Excellent quallity", "Author": "HOANA", "ReviewID": "R3HBV2IAHJ24TT", "Overall": "5.0", "Content": "You can not get more features in a miniature camera for this little money. Absolutely top quality, easy to use. What's not to like?", "Date": "May 25, 2013"}, {"Title": "Awesome Buy!", "Author": "Josiah Jackson", "ReviewID": "R24939O8DWYDWG", "Overall": "5.0", "Content": "Great still if your looking for a camera that does it all .With high megapixels and panoramic, i honestly couldn't ask for more.", "Date": "April 18, 2013"}, {"Title": "This is an awesome camera.", "Author": "James W. Jacobs", "ReviewID": "R1QL58X108XIVK", "Overall": "5.0", "Content": "I purchased this camera strictly to take pictures on my current \"vacation\" and so far it has been awesome!! This camera has awesome picture quality as well.", "Date": "July 2, 2013"}, {"Title": "Great bargin", "Author": "Joe  Beach", "ReviewID": "R452IAOANQ4A5", "Overall": "5.0", "Content": "Got tired of the nikon's and olympia's that keep breaking. This one's got more features than I need but it's all a bonus. good battery life.", "Date": "June 24, 2013"}, {"Title": "Good...", "Author": "Anita Rodriguez", "ReviewID": "R156S1RF5UYHLU", "Overall": "5.0", "Content": "The delivery was excellent, received on March 8.  I'm satisfied with the buy, but I wished I had brought a bundle because I'm still searching for a 16GB memory card, shipping was very expensive.", "Date": "March 16, 2013"}, {"Title": "Be aware !", "Author": "Khan", "ReviewID": "R131Y9MGBFHO1C", "Overall": "2.0", "Content": "Overall this camera is good but it's mic is not very powerful, resulting in low voice videos. One more thing, it will not record a video for more than 20 minutes at a time", "Date": "March 3, 2013"}], "ProductInfo": {"Price": "$136.03", "Features": null, "Name": "Samsung St201 16.1mp 10x Zoom 3.0\" lcd HD Digital Camera Black", "ImgURL": "http://ecx.images-amazon.com/images/I/51yCBrcfoHL._SY300_.jpg", "ProductID": "B00AEGGRUW"}}