{"Reviews": [{"Title": "Very Nice Camera for General Use, Wildlife and Birding", "Author": "DonD \"Retired IT Systems Specialist\"", "ReviewID": "R39G4VEMUIGCRW", "Overall": "4.0", "Content": "Review of Fujifilm HS50EXRThis review is based on my experience with the Fujifilm HS series cameras (HS10,20,30 and 50) and represents my opinion and not necessarily scientifically tested fact. One should visit the Fujifilm forum (use a search engine because Amazon will not allow me to list the URL) to develop a better understanding of all of the features. Just be sure to ignore all of the trolls.Conclusion:The new Fujifilm HS50EXR is a very nice upgrade of the HS30EXR. I would give it 4 ½ stars if Amazon would allow. The best feature of this camera is the 42x (1000 mm eq.) F2.8-5.6 zoom lens. It is very sharp throughout its range. The next best feature is the very fast and accurate focusing. Fuji uses a new ½ inch sensor with phase detection pixels and contrast detection to quickly AND accurately focus the lens. All in all, a very nice wildlife, birding and general camera for a good price.The Good:- Whopping 42x (1000mm eq.) F2.8-5.6 zoom lens. Edge sharpness is good and purple fringing is all but eliminated by the EBC lens coating and the software.- Fast and accurate automatic focusing within the optical zoom range. Focusing accuracy is average to poor while in digital zoom.- Lens shift optical image stabilization is excellent and allows you to hand hold to 84x(42x optical, 42x digital).- The new processing system is much, much faster than the HS30EXR. Frame freeze is eliminated (so far).- Image quality is good and comparable to the HS30EXR but is still limited by the ½ inch sensor.- Space for your fingers above the lens has been provided to manually focus the camera.- The macro mode is outstanding and allows you to focus as close as one centimeter. Produces amazing insect photos.- Fuji's color has always been outstanding and is so with this camera.- The EVF (Electronic View Finder) is very usable with 920 K dots and is my preferred method.- Excellent 920,000 dot articulated LCD display.- Very useful \"Q\" button that gathers all of your most changed settings in one place.- Three way switch on the side of the camera that allows you to change from Continuous, Single and Manual focus is very useful.The Average:- Manual focus is better, especially using focus peak highlight to strengthen high contrast outlines but I still yearn for my split screen as on my Nikkormat and no focus hunting.- I find that I only use EXR mode when the conditions are poor. In looking at my photos, I find I have good photos of poor conditions and usually do not use them.- Focusing accuracy is average to poor while in digital zoom.- The menu system needs to be better organized with like settings grouped together.- The manual needs to be expanded and organized, with actual explanations of the myriad of features and a usable index. It is not enough to just list the feature.- You should not have to go through menus to access RAW file mode. It should be one touch as on the earlier HS cameras.-As a Photoshop user, I find the SilkyPix included program to be very un-intuitive and almost useless.The Poor:- The battery door is an accident waiting to happen. It is poorly constructed of cheap, flimsy plastic, is difficult to open, and sure to break. What happened to the old HS battery door that was well constructed with a steel back?- This year's lens cap is also a disaster. In the name of style, Fuji has eliminated any chance of gripping the cap and releasing it from the lens. Maybe I can buy last years model that was designed with function over form.*** Addendum 4-13-2013 *** I purchased the HS30EXR lens cap from Fujifilm USA to replace the crappy one on the HS50EXR. Problem solved. Cost was $6.50 plus S & H.", "Date": "March 15, 2013"}, {"Title": "Fujifilm FinePix HS50EXR", "Author": "Michael T. McCaffrey \"sumofan\"", "ReviewID": "R3RACRIIJQ1897", "Overall": "5.0", "Content": "Fujifilm FinePix HS50EXR 16 MP Digital Camera with 3-Inch LCD (Black)  I just received my Fujifilm HS-50. I had ordered a new charger and some spare batteries that arrived sooner today, so I had a chance to charge up before the delivery of the HS-50 and was ready to go on a few tests the minute I took it out of the box. THIS IS A GOOD CAMERA! I am more than pleased with the test shots: clear, well focused, the zoom is great. This should be a great camera for anyone wanting to not have to change lenses with changing requirements. Having had all the HS series cameras prior to this one, I can say this is a worthy update (zoom). I have always had great success with shots pleasing to me, particularly with the HS-30, and have no doubts whatsoever that the HS-50 will be perfect for MY needs/desires. NOW: I might have stated this with my review of the HS-30 previously, BUT:  this is a camera with a 1/2 inch sensor. The pros out there might want more (I just sold off a DSLR with an APS-C sensor, 24mp, and all sorts of lenses due to NOT wanting to change lenses every time a great photo op came into being ... photo ops don't want to wait for lens changes ... and, let's face it, changing lenses (and risking getting dust on the sensor every time one lens is changed for another ... been there) is an absolute pain in the posterior!). The HS-50, right out of the box, has a great solid feeling to it, a camera of substance. Compared to DSLRs I have owned, the weight of this thing is an absolute non-issue. I bought a CASE LOGIC SLR HOLSTER case (same kind I carried the HS-30 in, which was totally perfect) along with the HS-50. I also bought a B&W; Clear Haze Filter. A previous excellent review mentioned the clumsiness of the CHARGER that comes with the HS-50, I totally agree. It has a wire that has to be plugged into the charger, a non-starter for travel. I bought the WASABI 2 battery set with a charger that plugs directly into the wall. The FUJI charger will be relegated to a box somewhere. The one test I haven't done ... yet ... is to try to track a flock of geese in flight to test the write speed of this HS-50 vs the previous HS-30. I do want to say that I LOVE THE MANUAL ZOOM LENS!Few observations:  If you want great shots that should be pleasing to you, this could very well be the camera you're looking for. If you belong to a photo club where one's status is often determined by the size/price of your lenses or how many megapixels are in your camera, then this will not put you at the head of the class, if that's important to you.  :-)Post processing:  This means using software to \"tweak\" your pics (I routinely do this to all my pictures ... whether from a DSLR or the FUJI). I find this adds that \"finishing touch\" that I personally love ... everyone has different tastes. Just thought this might be worthy of mention.Lastly:  Considering the price of the HS-50 vs. a DSLR and lenses, preferably quality lenses - and the fact this does not weigh anywhere near what a DSLR assemblage in a large case does ... AND the fact one does not have to change lenses all the time ... then I ... personally ... think this HS-50 is a steal.UPDATE:  3-21-13:  No camera is ever fully adopted by me unless I take it out to my favorite park and give it the FULL WORKOUT, which I just did this morning. I believe I said this in my review of the HS-30 a year or so ago:  buying a camera ... any camera ... is a subjective thing. No camera is satisfactory to everyone. The camera that IS satisfactory to YOU, the reader, is the one that does what YOU want it to, based upon your interests/desires/budget. After my gaggle of MANY DSLRs in the past, I always find myself returning to the HS series cameras. Why? \"Bangs for the bucks!\" The things do just about EVERYTHING in one easily transportable package that doesn't break your neck/shoulders when \"out there\" taking pics. The HS50 performed, FOR ME, marvelously today ... and I never had any doubts, based upon my prior experiences with the HS series in the past. There is one thing I feel like alerting buyers/would be buyers: be a bit careful of the ON/OFF switch. It appears a bit sensitive if you accidentally brush against it when moving the camera about. Everything worked fine today, and the ZOOM ... that wonderful zoom ... worked superbly. I got shots today that I NEVER would have gotten with the VERY expensive DSLRs I disposed of (without buying even more/increasingly highly expensive zoom lenses).Before buying ANY camera, ask yourself what you want to do with that camera, what are your realistic expectations ... how much do you want to spend, when all is said and done ... then you'll make the right choice. AND:  Whatever camera you do end up with, remember to CONSULT THE INSTRUCTION MANUAL when you have questions. The manuals give many insights into what your camera will/won't do. :-)Leaving you with a thought:  \"It is an illusion that photos are made with the camera... they are made with the eye, heart and head.\" - Henri Cartier-Bresson.Regards,  Mike", "Date": "March 20, 2013"}, {"Title": "This is a real \"bridge\" camera.", "Author": "Jan Wieck", "ReviewID": "RYUW7TE83ROY4", "Overall": "5.0", "Content": "Except for changing lenses, this camera allows to do everything, you normally need a DSLR for. One can go from the complete \"auto\" modes, that are very much like high-end point'n'shoot, to complete \"manual\". And when I say \"manual\", I mean it. There are no zoom buttons, the zoom is manual. When in manual focus mode, there is a focus \"ring\" to turn - no buttons. It has all the modes - shutter-priority, aperture-priority and full manual control over both. Interestingly, the half-auto modes only support f/8. You have to go full manual to use f/11. I don't mind that, but someone preferring the half-auto (priority) modes might care.The manual zoom is a blessing! You control the speed, at any rate you want, and it never drains the battery. The lens has another feature that is rather unusual for bridge cameras. A standard 58mm threading for filter lenses. No ugly adapter ring needed. Not that digital cameras need many of them, but a circular polarizer is always good to have in your camera bag. Other than that, the lens is outstanding. For a 42x optical zoom, sporting an aperture of f/2.8 at a 24mm equivalent is excellent.Since this is NOT a DSLR, the viewfinder is of course electronic. However, Fuji packed the same 920K-dot resolution, you find on the 3'' rear screen, into the EVF. The EVF is a 1:1 copy of the LCD screen. There is a button that lets you switch between LCD, EVF and an auto-mode, where a sensor next to the EVF switches back and forth as you hold the camera to your eye or move it away. The LCD screen can be folded backwards for protection. I prefer looking through the viewfinder ... but I'm an old f*rt, as you can probably tell by now.Speaking of buttons, They are right where I think they should be. Not too many and none missing. I especially like the dedicated \"focus mode\" switch on the left side. One can easily select between manual focus and two different auto-focus modes. A button in the center of that switch activates a digital zoom for fine tuning the manual focus. Or if pressed long, toggles between different modes of manual focus assist, there black and white pixels highlight high contrast areas in the picture.Other buttons, that are easily available \"blind\" (in other words while looking through the EVF), are the EV and burst-mode buttons. The EV button has different functions in different modes. In programmed auto mode, it just enables control of the Exposure Value via a dial, easily used with the right thumb. But when shooting in the semi-auto modes (shutter or aperture priority) it toggles between the EV and the selected shutter speed or aperture value, again controlled with that thumb dial. And in full manual mode, it toggles between shutter and aperture. In that mode, you will see a kind of exposure meter displayed, where the EV setting used to be ... very useful.The sensor in this camera is rather average for this class. It is a CMOS sensor, so not surprisingly Fuji has packed 1080p 60fps video recording and even up to 480fps slow motion recording (with lower resolution depending on speed) into it. Being able to attach an external mic is a plus, and again above average for bridge cameras.A nice side effect of using a CMOS sensor are the burst modes. And the HS50 has plenty of those. Not only can you shoot 11fps at full resolution (assuming your memory chip can keep ... which it can't ... even a Class-10 SDXC will bog down to 3fps very soon). 3fps continuous at 16 megapixels still isn't bad. But there is a very interesting \"best shot\" mode. The moment you half-press the shutter release, the camera starts taking pictures at the selected frame rate (3/6/11/16fps). They all go into internal memory, none of them go onto SD. The moment you press the button all the way, it stores the last 3, this one, and the next 4. I definitely need to play more with this feature, because I did miss many shots in the past by not being fast enough on the trigger.So after all this praise, there are a few little things, Fuji should have done different.Making the USB connector not only an exotic type, but switching the wires around just to push sales on the remotes? That should be below Fuji's standards. I guess some marketing drone won that discussion. And like everyone else has complained, the battery door does feel flimsy to me too.Conclusion:I think this is an excellent \"bridge\" camera. Maybe even more than that ... an alternative to a DSLR.I love it!", "Date": "July 13, 2013"}, {"Title": "Feature rich, portable and versatile!", "Author": "J Reinhart", "ReviewID": "R3TCQBJK7XNY9R", "Overall": "5.0", "Content": "Simply put, this is truly a great camera. I have been following Fujifilm's progress in the HS series since the HS10 and they have constantly improved upon the previous models. Sure, some things have changed, some maybe not for the better (people have mentioned a sturdier battery/memory card compartment door in previous models, and the arrangement of the buttons is different), but really, if you take care of your device, nothing's going to break. I find the build of good quality, even if it's a plastic case. It does not feel cheap.The main improvement is the lens and the now easily accessible manual focus ring. If you had an HS series camera before, you will feel at home with the setup. I find all the controls are easily reachable, the menu structure is clear; the (Q)uick access button is very handy and allows you to adjust every major setting - that allows to be adjustable in the chosen mode - very fast. Although I generally avoid automatic modes on cameras, the EXR Auto mode is definitely worth a shot. I managed to take a picture of a lady bug, which had strategically placed itself in a thorn bush's most inaccessible part, in that camera mode, where (semi-)manual settings did not cut it.The image quality is very good for a (technically) point-and-shoot camera, and a lot of times the images reach DSLR quality even without postwork. Make no mistake though, this is NOT a DSLR. If you expect the same quality of this camera, you will be disappointed, and reviews along those lines can be disregarded. The exposure time is limited to a maximum of 30 seconds (or less, depending on the chosen mode), there is no adjustable DOF and the f-stop goes to a maximum of f11.On the bright side, you are getting a highly portable, well-built device with a huge range and plenty of nice modes and features. As part of your purchase you definitely want a UV filter and polarizer (58mm), additional batteries and I definitely recommend a tripod and remote shutter (http://www.amazon.com/gp/product/B00COVYFB8), because this camera does take great night shots, too. The zoom range even allows for stunning images of Earth's moon!I found that the camera takes better pictures if you do not zoom right the way into the 1000mm (42x). It also doesn't handle twilight overly well, but I'm sure I'll eventually find a good setting for that, too. It does excel at daylight shots and at night (with Tripod preferably). The up to 16fps (11 at full resolution) are marvelous and it really does portrait pictures very well using the (Adv)anced mode's portrait setting. Absolutely incredible from my perspective, especially at round 80mm focal length.Problems other people had with a focusing issue I did not experience. If you use the little dial to the left of the camera body to set the correct focusing mode ((S)ingle, (C)ontinuous or (M)anual), then you will get clear, sharp pictures without a problem. Tests have shown that the camera focuses in under 0.2 seconds and I definitely concur. I haven't timed it, but it's fast! My wife takes a lot of reference photos for her charcoal paintings and especially when taking photos of musicians playing guitar, the 11 fps really start to shine, especially in dimly lit rooms!The only hiccup I had was that I found a rather large piece of dust/fluff inside my lens after I ordered it (my wife's camera was fine -- we had ordered two) which happened most likely during the manufacturing process. Within 36 hours I had a replacement from Amazon (RMA'd Sunday evening, replacement arrived Tuesday by noon). No issues since.I gladly and happily recommend this camera to hobbyists and professionals alike, especially if you enjoy nature photography, portrait photography and enjoy close-ups as much as taking ranged photos. This is a camera that will get as close to a DSLR as you can imagine without the need to change the lens or having to carry a lot of weight!", "Date": "June 21, 2013"}, {"Title": "Great Camera - Excellent Focus and Features", "Author": "Pete \"Pete\"", "ReviewID": "R3901C3YWCD58R", "Overall": "5.0", "Content": "I kept my Canon SX 50 for a quick comparison before returning the Canon in favor of the Fuji. I was fully impressed by the Fuji right out-of-the-box. The camera is very substantial with great ergonomic design and features. The manual zoom is quick and precise And most importantly the autofocus is also immediate and precise. The focus area is clearly defined and outlined in the view screen And a gentle half press quickly brings the screen into sharp focus with an audible beep for confirmation. I was able to capture shot after shot with perfect point and shoot ease before even starting to explore the many more advanced features.Notable features so far:Great design ergonomics. Easy to grip, point, zoom and shoot with confidence of getting an in focus shot.Focus mode switch on left body of camera with 3 distinct settings; Manual, Continuos and Single auto focus.Q button to access internal menu itemsPopup flash button with Force Flash featureEvf/LCD button with a evf auto feature that switches off the view screen if/when you raise it to your eyeMacro setting that actually let's you turn on Macro or super macro in addition to the camera making the automatic scene selection in EXR mode.Panorama mode where you can select the degree of coverage 120, 180, 360On Off switch with 2 minute time out feature- I can let the camera go to sleep and pick it up with all zoom and other setting in place and resume shooting with a press on the shutter button.I have enjoyed photography for many years and have accumulated several cameras going back to my Canon 35mm SLR, going digital with the Sony DSC-F828, Canon power shot, Sony cyber shot 16.2, Panasonic DMC-TS4 waterproof and my Nikon D90 with 18-105 and 70-300 lens. (Yes, my wife thinks I'm obsessed and I guess she has a point) but I'm always looking for that perfect camera for the situation and I think the Fujifilm HS50erx fills that \"Bridge Camera\" bill.It zooms further and closer than the Nikon, has a great many DSLR features and quality and is more portable. I am very pleased with HS50 and Amazon sales and customer service is the Best in the Business!", "Date": "July 13, 2013"}, {"Title": "Not a bad choice; but really only average", "Author": "J. Mason", "ReviewID": "R2BAGRM0CAENJS", "Overall": "3.0", "Content": "I really wanted to love this camera; but the love just isn't there.This review is based on trying out two different Fuji HS50 EXR cameras.  On the first camera I received, I thought the zoom was defective; so I returned it to Amazon for a replacement.  The replacement camera had the same problem; so apparently it wasn't just an isolated problem.The camera's zoom lens is a twist-barrel style, like found on a DSLR camera lens.  This was one of the main reasons I choose the Fuji HS50 EXR over one of its rivals.  Sadly, the Fuji HS50 EXR's twist-barrel zoom lens turned out to be quite disappointing.  It is very stiff, lacking the smooth, fluid feel it should have.  On my first camera, I thought I'd gotten a defective lens; but the zoom on my replacement camera is equally as stiff.  Despite the stiffness, the twist-barrel zooming is still much faster than using an electronic zoom.  I definitely don't like the stiffness; but I can live with it for shooting still photos.  On the other hand, trying to zoom, while shooting a video, produces horrendous results.Right from the start, I found the camera's off/on switch to be rather awkward.  It is the same lever-style switch, and in the same location (i.e. around the shutter button), as the electronic zoom lever found on many other digital cameras.  Old habits die hard; so on more than a few occasions, I goofed and turned the camera off, while meaning to zoom.  Yes, this was my mistake; but it was never-the-less frustrating.  Since the lever extends slightly beyond the front edge of the camera, it is also easy to bump; thereby also turning off the camera.  (Did that too a few times!)  Why Fuji didn't put the off/on switch somewhere else is just one of life's little mysteries.On a more positive note, having a 42x zoom is awesome.  With the camera's image stabilization turned on, I managed to get a few acceptable handheld photos at the maximum telephoto range; but only if the lighting was very good.  Otherwise, my maximum zoom photos came out a bit too blurry.  I'm just not the type of person to lug around a tripod; so it's sad to have so much zoom power and not be able to make full use of it.  I can get acceptably sharp handheld photos up to about the 26x range.  Beyond that, it's hit or miss, more often miss.To the camera's credit, the HS50 EXR has a very solid build.  But, along with that solid build comes a bit of extra weight.  The camera weighs about the same as an entry level DSLR, with a small lens attached.  The weight could be a pain in the neck (literally) to carry around all day.Another disappointment was the camera's Panorama Mode, which is very temperamental.  I managed to get about 1 out of 6 successful panoramic photos.  On my unsuccessful attempts, the camera complained that I was  panning too fast, too slow, not straight enough, not far enough, etc.  On  my few successful panoramic photos, most of them had an exaggerated fisheye effect.  All things considered, I won't be using the camera's Panorama Mode.  I've had much better success taking my own series of overlapping photos and using my old ArcSoft Panorama Maker software to create a nice panoramic image.Some people may like this camera's Advanced Mode settings; but they didn't really appeal to me.  The Toy Camera, Pop Color, Dynamic Tone, Partial Color, etc.  are designed to produce \"artsy\" look photos; but I prefer more \"true to life\" looking photos.The Multiple Exposure mode was something I thought I might use.  In my film camera days, I played around with double exposure photos a bit.  It was always fun to do a double exposure of the same person (i.e. once on the right side of the frame, then again on the left side of the frame).  The resulting photo gave the illusion of the person being a set of identical twins.  I tried the same thing with the HS50 EXR's Double Exposure mode; but the resulting photos turned out to be a jumbled mess of pixels superimposed on top of each other.The Pro-Focus mode, which is supposed to produce a sharp subject with a blurred background, didn't work very well either for taking photos of flowers.  I had better luck using aperture priority mode to get the depth of field results I want.  Incidentally, one of the camera's scene modes is for taking pictures of flowers; but it didn't do very well at blurring out the background either.To the camera's credit, I found the Pro Low-Light mode fairly useful.  In this mode, the camera takes several photos in rapid succession.  It then combines the sharpest areas from each photo to produce one final picture.  I didn't find the low-light color balance to be significantly better or worse than other cameras; but at least, Pro Low-Light mode did eliminate some of the blurriness.Other reviewers have complained about the Auto Focus being sluggish, especially at the extreme telephoto end of the lens.  I have to totally agree.  I've tried to take photos of birds in flight; but the cameara couldn't focus fast enough.  Since I don't use my camera for very many fast action shots, the slow auto-focus is something I can live with.The camera's EXR Auto mode was entirely too inconsistent to be worthwhile.  In EXR Auto mode, the camera analyzes the scene and decides the best shooting mode to use.  That type of artificial intelligence may be better than human stupidity; but it's definitely no match for human intelligence.  While I'm no genius, I am intelligent enough to know whether I'm trying to take a macro shot, a landscape shot, a portrait shot, or some other type of shot.  The EXR Auto mode's scene analyzed was wrong as often as it was right.  Rather that rely this sort of hit or miss analysis, I'll just choose my own shooting mode from the scene menu options.Another frustrating thing about EXR Auto mode was trying to take a flash photos.  Even though I had the flash set on \"forced flash\",  sometimes the flash would fire; and sometime it wouldn't.  I never quite figured what was up with that; but I suspect it had to do with the mode the camera had chosen.  For example, I know my old Panasonic camera won't fire the flash in Landscape or Burst mode.Previewing and deleting photos was another pain in the ___.  Photos always look sharper on the small LCD screen than they looks on a large computer screen.  To tell if a photo is sharp enough for me to keep, I zoom in, while previewing it on the LCD screen.  If I decided to delete a photo, the camera required that I  zoom all the way back out again first.  This might not sound like a big deal; but I found it annoying.  Pardon my sarcasm; but I wonder if Fuji did this so I'd wear out the cameras buttons faster and have to buy another new camera.Also, after deleting an individual photo, the camera stays in delete mode.  All I'd have to do is press the OK button to delete the next photo, and the next, and the next.  Unless I'm very careful, I could accidentally delete a photo that I wanted to keep.  The camera has a function for selecting and deleting multiple photos; so if I wanted to delete more than one photos, I would use the multi-delete functons instead.  What were you thinking Fuji?No camera review would be complete without discussing image quality.  Overall, I can only rate the image quality as average.  Bear in mind that I only shoot in jpeg mode, not in raw mode.  (For those who might be thinking I'm expecting DSLR quality from a small-sensor superzoom bridge camera, I assure you that is NOT the case.  This is somewhere around the 10 digital camera I've owned; so I know what to realistically expect in the way of image quality.)  I've gotten some very good photos with the camera; but entirely too many shots have come out too soft or blurry.  Even using the camera's pre-set modes for specific types of scenes (landscape, portrait, macro, etc.), most of my photos have usually been average at best.  The HS50 EXR has a lot of settings that can be tweaked, such as sharpness and noise reduction.  I seem to get the sharpest photos by using the camera's Program Mode, with the noise reduction set on -2 and the sharpness set on +2.  Unfortunately, most of the camera's preset modes won't let me tweak these settings.Last, but not least, the user's manual (I'm also including the more comprehensive manual, which can be downloaded from the Fuji website) lacks a lot of critical information.  The manual tells you about the camera's various functions; and sometimes it tries to explain how to use a functions.  On the other hand, detailed step-by-step instructions aren't usually provided.  For example, the manual may tell you to go to a menu item and choose such-and-such option; but it doesn't tell you which one of the 5-6 menu tabs you'll find the menu item listed under.  And, in some cases, the menu item isn't even there, unless the camera's mode dial is set on a particular shooting mode.  Of course, the manual doesn't tell you these things; so you have to figure them out for yourself.To wrap things up,  this camera has two very strong points, a solid build and a 42x zoom.  Some aspects of the user interface are good; and other's (like the off/on switch, twist-barrel zoom, picture delete function, etc.) are poorly implemented.  Straight out of the box, the handheld image quality is pretty average (getting poorer at the higher zoom levels).Despite the negative things I've pointed out in my review, I do intend to keep my Fuji HS50 EXR camera.  Before purchasing it, I read countless reviews on the Fuji HS50 EXR, the Nikon Coolpix P520, the Canon PowerShot SX50 HS, the Sony Cyber-shot DSC-HX200V, and the Panasonic Lumix DMC-FZ200.  All of these cameras seem to have their own problems; so picking one of them seems to be a matter of choosing the \"lesser of the evils\".---Update:  After three weeks of testing, tweeking settings, etc., I still wasn't satisfied with this camera; so I did return it to Amazon for a refund.  This camera may be, as I said before, \"the lesser of the evils\"; but at a cost of almost $400, it had far too many negative things about it to warrant keeping it.---As for the rival superzoom cameras, I did test out a Nikon Coolpix P520 (in the store only).  It's plastic body had a very cheap feel, the auto-focus was pretty sluggish, and the image quality was only average.Although I didn't get to test out the other rival cameras, the Panasonic Lumix DMC-FZ200 has a slightly higher rating than any of it¡¦s the rival  cameras.  It also costs $150 more; and the build is nowhere near as solid as the Fuji HS50 EXR.  If past performance is any indication of quality, I've owned two of the previous Panasonic Lumix DMZ-FZ camera models.  After 1.5 years, my first Lumix camera (an FZ18) developed a bad pixel on the sensor.  And, after 2.5 years, the electronic zoom lever on my second Lumix camera (an FZ28) wore out.  I know Panasonic is a respected brand;  but twice burned was enough for me.The other rival camera weren't available locally; so I could only go on the basis of the online reviews.", "Date": "September 2, 2013"}, {"Title": "Simple and Easy Review", "Author": "Paul E. Seals \"Lunasdude\"", "ReviewID": "RL306V6021DW2", "Overall": "5.0", "Content": "Simple and Easy Review: I have had the HS10 and HS20 and both were excellent cameras.The HS50 is easy and simple to use on EXR (fully automatic) mode or as complicated (Manual mode) as you want.Build quality is solid.Focusing is now on par with a low end DSLR level, meaning it's dam fast in great light and very quick in low light.Battery life is excellent but the HS50 uses a proprietary battery, but you can get aftermarket batteries.The HS50 is set up for a eyefi card which means it will keep transmitting even if the camera is turned off until it has uploaded all your pictures!Accessories such as the remote that worked on the HS20, 30, 35 will not work on the HS50 which has a different input.You will need a 2.5mm adapter to use a standard external microphone with this camera.The Standard Fuji Flashes such as the HS42 flash (or compatibile pin flash) will work.Overall, an excellent camera, incredibile zoom, Fast focus, great pictures!", "Date": "March 23, 2013"}, {"Title": "Fuji HS50 EXR vs Canon SX50 HS", "Author": "Andrew Singh", "ReviewID": "R25H008MJSN1Q2", "Overall": "4.0", "Content": "I compared both the EXR 50 and the Canon side by side image by image over several weeks. Both excel in different areas, but it came down to individual preference:Canon pros:Slightly bigger zoom than FujiBetter hand held IS (image stabilization) for long shots like the moonMore compactMakes colors in images 'pop' a bit more  (subjective)Metal tripod screw in baseCanon cons:Case and texture feel flimsy/hollowMight be a bit small for guys/larger hands (subjective)Delay saving/writing images between shots (Fuji was noticeably faster)Has a tendency to over compensate 'pop' in most images, thus some slight yellowing can be seen on skin tones etcSmaller EVF and LCDNo auto eye detection on EVFElectronic zoom can feel a but jumpyFlash flip-up does not have a button (use your fingernail to push up ...looks and feels very cheap)Fuji pros:Built like a tank - very solid, rubberized coating feels good to the touchLarger LCD, and EVFAuto eye detection on EVF (very convenient)Manual zoom is more stable in your handsMenus are a bit easier in the Fuji and there are more pre-selected categories to choose from for a noviceImages don't have as much 'pop' as the Canon, however images are much more realistic in color (subjective)No lag between shots (Canon was noticeably slower here)Dedicated flash up button. Much better than the CanonFuji cons:Can be a bit heavy compared to Canon (subjective)Slightly less zoomIS at far night objects like moon needed manual intervention to capture (Canon captured the moon shots on auto mode with no fuss).Since images are more realistic, some may consider them 'bland' as compared next to the CanonPlastic tripod screw-in baseI ended up sending back the Canon and keeping the Fuji. It was very close comparison with both scoring well in certain categories and underscoring in others. For me, I had read several articles before that claimed the Canon had superior image quality (IQ) but I wanted to see for myself in an objective test. Time an again in multiple modes and manual settings, the Canon over-colored the images and the Fuji presented them as-is. There was no discernible sharpness or distortion difference to the average person looking at the images side by side. I ultimately felt the Fuji produced a truer representation of what my eyes were seeing in terms of color, vs an enhanced colorized image by Canon. Both units are great pieces, but for my preferences, Fuji was ever so slightly, the better fit.Giving it 4 stars because of the cons noted.", "Date": "January 20, 2014"}, {"Title": "A very useful general purpose consumer camera that takes great shots out of the box - especially valuable for parents & birders", "Author": "N. Andersen", "ReviewID": "R3A2L72QGH7AYS", "Overall": "4.0", "Content": "This is a serious step up from your standard pocket point and shoot, but one that doesn't commit you to the learning curve and expensive lenses involved in going to a DSLR. It's ideal for someone who wants an all-in-one package, with no need to change lenses, and where there's enough flexibility in the controls that you can usually get the picture you want in camera, without needing to export it to a computer for additional editing. I've been very impressed with the images I've gotten so far - and think this would be a great choice for amateur photographers who like to shoot outdoors - and for young people who show an interest but aren't quite ready for a serious investment that involves not just a camera body but lenses and other equipment.The most obvious and exciting feature is the lens, which allows for manual optical zoom from 24-1000mm (or up to 42x). I really like the ease and flexibility of rotating the lens myself to get the framing right, rather than using a button. It's ideal for getting shots of birds and other elusive animals, out in the wild. It's also essential for parents who like to get photos and videos of their kids sporting and other events. I remember when my oldest was growing up and I only had a cheap compact digital camera - we'd be in large auditoriums watching her sing or get awards and the inability to zoom in more than, say, 10x, really hampered my ability to get good shots. I had to try and sneak up closer, risking the annoyance of other parents, even to get a usable shot. With this one, I can sit pretty much anywhere and get something to be proud of and remember.Of course, to get really good shots at full zoom you'll want to invest in a monopod (useful for shooting in crowds where there's no room to set up a tripod) or a tripod.The video looks quite good - the sound is passable but not great - but don't expect it to give you the recording flexibility you get with some of the newer DSLRs. You can select the frame rate and recording speed in advance - and in standard definition mode you can over crank it for some nice slow motion shots (depending on your video editing software). You can, obviously, select the zoom level using the manual zoom controls. Otherwise, though, what you see is what you get. You can't select aperture or shutter speed - if you are in shutter priority mode, for example, and select a slow shutter speed, that doesn't translate to the video. The video looks the same no matter what mode you're in or what settings you have on - except for the video frame rate and speed you select in advance. Even if you have it in manual focus mode for video it automatically does focus and you can't adjust focus at all while shooting. As far as video goes, then, this is essentially point and shoot.When it comes to photos, though, there's a whole lot of flexibility. The Macro button for close-ups and extreme close-ups does a great job with insects and flowers. I also like to shoot textures close-up, and keep a folder of them, some of which I'll use in Photoshop to create special effects.You can shoot either JPEG or RAW files - and you can also set it up to record both a RAW file and a JPEG file of every shot, though doing that means it takes a bit longer to be ready for the next shot. Obviously, if you make it a habit to \"post-produce\" your photos with photo editing software, its best to shoot in RAW, since that gives you more flexibility to play with the image you've shot. Still, I expect that this camera would be ideal for the person who just wants to learn how to use it well and not need to do any further editing before uploading and sharing or printing their photos.The camera's various controls and buttons are very well set up to balance elegance with ease of use with ease of access. I love the fact that when focus is set to manual, you can adjust focus with a dedicated focus ring on the lens, and you can set it to indicate via highlights where things are in focus. It's got a very quick automatic focus, but it's nice to be able to control it when I need to.The camera offers several modes of shooting. In addition to standard modes that let you set the shutter speed and aperture, together or independently, there are \"scene modes\" optimized for a wide range of shooting conditions. What you are not as likely to see in the smaller point and shoot cameras are the EXR modes. EXR Auto sets the scene mode and other settings automatically. Other EXR options include \"resolution priority\" which does a great job capturing the range of details in your subject sharply, \"high iso & low noise\" which is great for low light situations, and \"D-Range Priority\" which comes pretty close to giving you an HDR shot, with a lot of detail in the highlights and shadows. You can also shoot in \"Panorama\" mode and get 360 degree shots, and the \"Advanced\" mode gives you some cool filters, another low light setting that focuses on clarity, a \"Pro Focus\" mode, that gives you a sharp foreground and soft background by shooting multiple images and superimposing them. There are a wide range of other settings available on the camera, most easily accessible by pressing the Q button, and all accessible via the menu and selector buttons.To sum up: this is a very nice medium-range camera, with a lot of flexibility that allows you to get very nice photos in camera. Video's just okay, but where this really shines is for shooting outdoors, wildlife and sports using the fantastic manual zoom lens.", "Date": "May 14, 2013"}, {"Title": "Excellent bridge camera for those wanting to move beyond point and shoot cameras", "Author": "Nick \"whereishawkins\"", "ReviewID": "R1L5VU46YZNNMU", "Overall": "5.0", "Content": "One of the downsides of being a photography enthusiast is that you tend to get stuck within a particular brand's ecosystem. I'm a Canon guy, and when looking at new cameras, I tend to ignore everyone else out there. So I went into this review a bit biased - can this bridge camera do as well as my beloved Canon cameras can?I shoot with a SLR most of the time, and sometimes it's just a pain to carry and deal with. But I want to be able to take good photos and have decent range without swapping lenses. It sucks the fun out of photography.At first glance, the Finepix HS50EXR fits great in your hand. I love the manual zoom ring, so it makes me feel at home when compared to my SLR. The camera is fairly intuitive, with manual controls for aperture, shutter speed, full manual, \"automatic\" (EXR mode) and more. Out of the box, you get the impression that you can take great photos without reading the manual. However, I do recommend reading the manual, despite it being awkwardly written.The big selling point on this camera is the 42x zoom. However, when fully pushed out, I felt like my photos lacked detail that I typically got at wide-angle on this camera. In a way, this is expected. Between the sensor size and the optics of the lens - something has to give. However, it wasn't a show stopper.Image quality is superb - however, once I started pushing up the ISO past 400, the more grainy the image became. At ISO 800, it was noticeable. At 1600, it wasn't pretty.Things that I like about the camera: The electronic viewfinder is awesome. The LCD has a great range of motion and excellent detail. Video quality at full HD is great. Battery life rocked - I shot over 400 images and still had ample charge left. The camera is very responsive - ready to go as soon as you turn the power on, and I didn't notice any buffering when shooting in quick succession.What didn't I like? Not much, actually. The camera is heavier and larger than most cameras in this class, but coming from a Canon 5DM2, this felt downright lightweight. The FinePix Viewer software was just ok but was awkward to navigate around. I'd highly recommend spending the extra money to buy a copy of Adobe Photoshop Elements. The battery charger was big and bulky. The big gripes are the lack of detail when fully zoomed out and noise at higher ISOs, but it's a tradeoff for the range. The included panorama mode is nice but you're better off using a free solution, like Photosynth for Windows.I'd also suggest buying this camera with a SDHC card (class 10 is ideal) and you might want to consider a 58mm UV filter that will protect the lens' front element from scratches. And if you're new to photography or want to improve, you should check out Scott Kelby's books.The verdict? I'd recommend this camera to everyone - from someone who wants to leave their SLR at home and to someone who wants to grow from a point and shoot camera. But I'd also suggest taking a long look at the Panasonic Lumix DMC-FZ200 12.1 MP Digital Camera with CMOS Sensor and 24x Optical Zoom - Black. But make no mistake - for the price, this is one heck of a camera.", "Date": "April 24, 2013"}, {"Title": "Great features at a great price", "Author": "R. Hammer \"rhammer\"", "ReviewID": "RPPF38RISGFVD", "Overall": "5.0", "Content": "<!--\n\nfunction fp_resizePlayerSpace(nsPrefix,w,h)\n{\t\n  try {\t\n    var ifrm = parent.document.getElementById(nsPrefix + \"movieFrameID\");\n    if (ifrm) {\t\n        var h2 = h + 35;\n        ifrm.style.height = h2;\n      }\n    } catch(err) {\n \n    } \n\n\n  if (h > 0) {\n      document.getElementById(nsPrefix + \"clipDiv\").style.height=h+\"px\";\n      document.getElementById(nsPrefix + \"videoPlaceholder\").style.height=h+\"px\";\n  }\n  else {\n      document.getElementById(nsPrefix + \"clipDiv\").style.height=\"\";\n      document.getElementById(nsPrefix + \"videoPlaceholder\").style.height=\"\";\n  }\n  document.getElementById(nsPrefix + \"flashcontent\").style.height=\"100%\";\n}\n\nfunction fp_rewriteDiv(nsPrefix,divName,html)\n{\t\n    document.getElementById(nsPrefix + divName).innerHTML=html;\n}\n\nfunction embeddingPopup(nsPrefix)\n{\n  alert(\"placeholder function for embedding code\");\n}\n-->\n\n\n<!--\n\nfunction cv_mo1BK6SNM1QJDYSembeddingPopup(){\t\nalert(\"Embedding code will be displayed here.\");\n}\n\n-->\n\n\n\n\n\n\n\n\n\n<!--\nfunction cv_mo1BK6SNM1QJDYSrefresh_preplay() {\n\ndocument.getElementById(\"cv_mo1BK6SNM1QJDYSchiDiv\").innerHTML = document.getElementById(\"cv_mo1BK6SNM1QJDYShiddenPre\").innerHTML;\n};\ncv_mo1BK6SNM1QJDYSrefresh_preplay();\n\n-->\n\n\n\n\n\n\n        // <![CDATA[\n\nvar cv_mo1BK6SNM1QJDYSso;\t   \n\n\nfunction cv_mo1BK6SNM1QJDYSloadSwf_Core(swfLocation, swfWidth, swfHeight, flashVersion, bgColor, swfParams, flashParams, embedAttributes) {\n\n  try {\n      cv_mo1BK6SNM1QJDYSso = new SWFObject(swfLocation, \"cv_mo1BK6SNM1QJDYSAMPlayerProd\", swfWidth, swfHeight, flashVersion, bgColor);\t   \n\n      for (var v in swfParams) {\n        cv_mo1BK6SNM1QJDYSso.addVariable(v, encodeURIComponent(swfParams[v]));\n      }\n      for (var v in flashParams) {\n        cv_mo1BK6SNM1QJDYSso.addParam(v, flashParams[v]);\n      }\n      for (var v in embedAttributes) {\n        cv_mo1BK6SNM1QJDYSso.setAttribute(v, embedAttributes[v]);\n      }\n\n      cv_mo1BK6SNM1QJDYSso.addVariable(\"swfEmbedTime\", new Date().getTime());\n\n      var agt = navigator.userAgent;\n       \n      var reFirefox = new RegExp(\"firefox/\", \"i\");\n      var regx = agt.split(reFirefox);\n      var ffVersion = 8;\n      if (regx[1]) {\n          var pts = regx[1].split(/[.]/);\n          ffVersion = parseFloat(pts[0] + \".\" + pts[1]);\n      }\n      var minorVersion = parseFloat(navigator.ap);\n      if ((navigator.appVersion.indexOf(\"Mac\")!=-1) || (ffVersion < 1.5)) {\n          cv_mo1BK6SNM1QJDYSso.setAttribute(\"height\", swfHeight);\n          cv_mo1BK6SNM1QJDYSso.setAttribute(\"width\", swfWidth);\n          cv_mo1BK6SNM1QJDYSso.addVariable(\"oldFirefox\", \"1\");\t     \n      }\n\n      if (cv_mo1BK6SNM1QJDYSso.write(\"cv_mo1BK6SNM1QJDYSflashcontent\")) {\n          fp_resizePlayerSpace('cv_mo1BK6SNM1QJDYS', \n                               320, \n                               283);\n      }\n      else {\n          var nsPrefix = 'cv_mo1BK6SNM1QJDYS';\n\n          fp_resizePlayerSpace(nsPrefix, 0, 0);\n          fp_rewriteDiv(nsPrefix, \"flashcontent\", '<br/>To view this video download <a target=\"_blank\" href=\"http://www.macromedia.com/go/getflashplayer\" target=\"_top\">Flash Player</a> (version 9.0.115 or higher)');\n      }\n  } catch(err) {\n      fp_resizePlayerSpace('cv_mo1BK6SNM1QJDYS', 0, 0);\n  }\n  return false;\n}\n\n\n\nfunction _cv_mo1BK6SNM1QJDYSloadSwf(movieID, playerVersion) {\n    var swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/20120510035744301/AMPlayer._V148501545_.swf\";\n    var swfWidth = \"320\";\n    var swfHeight = \"100%\";\n    var flashVersion = \"9.0.115\";\n    var bgColor = \"#FFFFFF\";\n\n    var swfParams = {};\n    var flashParams = {};\n    var embedAttributes = {};\n    swfParams.amazonPort = \"80\";\n    swfParams.allowFullScreen = \"true\";\n    swfParams.telemetrySubPageType = \"VideoReview\";\n    swfParams.nsPrefix = \"cv_mo1BK6SNM1QJDYS\";\n    swfParams.locale = \"en_US\";\n    swfParams.logUrl = \"gp/mpd/l\";\n    swfParams.canResize = \"1\";\n    swfParams.autoPlay = \"1\";\n    swfParams.sessionId = \"000-0000000-0000000\";\n    swfParams.marketplaceID = \"ATVPDKIKX0DER\";\n    swfParams.salign = \"LT\";\n    swfParams.preset = \"detail\";\n    swfParams.mediaObjectId = \"m3I1S6RNGEO4OE\";\n    swfParams.autoPlayTimer = \"\";\n    swfParams.mediaObjectIDList = \"m3I1S6RNGEO4OE\";\n    swfParams.playIsUserGenerated = \"1\";\n    swfParams.enableShare = \"0\";\n    swfParams.permUrl = \"gp/mpd/permalink\";\n    swfParams.telemetryPageTypeID = \"RPPF38RISGFVD\";\n    swfParams.xmlUrl = \"http://www.amazon.com/gp/mpd/getplaylist-v2/m3I1S6RNGEO4OE/000-0000000-0000000\";\n    swfParams.amazonServer = \"www.amazon.com\";\n    swfParams.scale = \"noscale\";\n    flashParams.allowFullScreen = \"true\";\n    flashParams.salign = \"LT\";\n    flashParams.bgcolor = \"#FFFFFF\";\n    flashParams.allowScriptAccess = \"always\";\n    flashParams.quality = \"high\";\n    flashParams.wmode = \"transparent\";\n    embedAttributes.title = \"Flash Player\";\n\n    if (movieID){\n      if (playerVersion == '3'){\n        swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/20120510035744301/AMPlayer._V148501545_.swf\";\n        swfParams.mediaObjectIDList = movieID;\n      } else {\n        swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/legacy/20101014901/AMPlayerProd._V197491872_.swf\";\n      }\n      swfParams.xmlUrl = \"http://www.amazon.com/gp/mpd/getplaylist-v2/\" + movieID + \"/000-0000000-0000000\";\n      flashParams.wmode = \"transparent\";\n      swfParams.autoPlay = \"1\";\n    }\n\n    if (document.getElementById('cv_mo1BK6SNM1QJDYSduration')) {\n      document.getElementById('cv_mo1BK6SNM1QJDYSduration').style.display='none';\n    }\n    cv_mo1BK6SNM1QJDYSloadSwf_Core(swfLocation, swfWidth, swfHeight, flashVersion, bgColor, swfParams, flashParams, embedAttributes);\n\n  return false;\n}\n\nfunction cv_mo1BK6SNM1QJDYSloadSwf(movieID, playerVersion) {\n   return _cv_mo1BK6SNM1QJDYSloadSwf(movieID, playerVersion);\n}\n\n\n\t\n\t\t// ]]>\n\t\n\n<!--\n\nfunction cv_mo1BK6SNM1QJDYSnewHeight(h)\n{\t\n    fp_resizePlayerSpace('cv_mo1BK6SNM1QJDYS', 0, h);\n}\n\nfunction cv_mo1BK6SNM1QJDYSresetPlayer(w,h,bw,cc) {\n  cv_mo1BK6SNM1QJDYSnewHeight(h);\n\n  cv_mo1BK6SNM1QJDYSso.addVariable(\"resetBandwidth\", bw);\n  cv_mo1BK6SNM1QJDYSso.addVariable(\"cacheCode\", cc);\n  cv_mo1BK6SNM1QJDYSso.setAttribute(\"height\", h);\n  cv_mo1BK6SNM1QJDYSso.setAttribute(\"width\", w);\n  cv_mo1BK6SNM1QJDYSso.write(\"cv_mo1BK6SNM1QJDYSflashcontent\");\n}\n\n-->\n\n\n\n\n\n\n\n\nvar cv_mo1BK6SNM1QJDYSRollOverImg = new Image();\ncv_mo1BK6SNM1QJDYSRollOverImg.src = \"http://ecx.images-amazon.com/images/I/81o7Ha3ChxS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play-active,BottomLeft,130,-12_CR0,0,0,0_.png\";\n\nvar cv_mo1BK6SNM1QJDYSpreplay = document.getElementById('cv_mo1BK6SNM1QJDYSpreplayImageId');\nif (cv_mo1BK6SNM1QJDYSpreplay) {\n  cv_mo1BK6SNM1QJDYSpreplay.onmouseover = function() {\n    cv_mo1BK6SNM1QJDYSpreplay.src = \"http://ecx.images-amazon.com/images/I/81o7Ha3ChxS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play-active,BottomLeft,130,-12_CR0,0,0,0_.png\";\n  }\n  cv_mo1BK6SNM1QJDYSpreplay.onmouseout = function() {\n    cv_mo1BK6SNM1QJDYSpreplay.src = \"http://ecx.images-amazon.com/images/I/81o7Ha3ChxS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play,BottomLeft,130,-12_CR0,0,0,0_.png\";\n  }\n  \n  \n  var node = cv_mo1BK6SNM1QJDYSpreplay.parentNode;\n\n  var cv_mo1BK6SNM1QJDYScurrentClick = node.onclick;\n  node.onclick = function () {\n    var head = document.getElementsByTagName(\"head\");\n    if (head[0]) { \n      var logTag = document.createElement('script');\n      logTag.type = \"text/javascript\";\n      logTag.src = \"/gp/customer-media/du/log.html?ie=UTF8&p=CustomerImage&s=CustomerVideoPlay\";\n      head[0].appendChild(logTag);\n    }\n\n    if (cv_mo1BK6SNM1QJDYScurrentClick) {\n      return cv_mo1BK6SNM1QJDYScurrentClick();\n    }\n  }\n}\n\n\n\n\n Length:: 4:39 MinsI have to caveat the video that it was inadvertently cut short due to size restrictions on video reviews.  Please watch the video for an in-person look at the camera.  I'm including my overall observations below since they were truncated from the video:PROS:-Great zoom range in one lens-Macro ability down to 1cm-16FPS for great action shots at kids games-LCD Viewfinder works flawlessly in sunlight (no wash-out)-The unit is light!-Lots of advanced features for seasoned pros (manual mode, aperture priority, built in panorama functions, full manual)-Full autofocus 1080p videoCONS:-Awkward on/off button.  Feels like a zoom setup from most point and shoot zooms-The zoom is backwards from the Canon zoom.  I constantly found myself zooming out when I wanted to zoom in.-Eye Viewfinder is electronic and not a true viewfinder (i.e. optical), just an alternate way to view the LCD screen.-Unit has a hard time focusing quickly at anything above 600mm.  It hunts for a while and needs a lot of light to find lock.FINAL OBSERVATIONS:I have shot the Canon xD line (now have the 7D) so I'm used to a camera that has the ability to accept multiple lenses, programming setups, etc.  Having spent the weekend with this camera I can honestly say that I was pleasantly surprised at just how competent this HS50 unit is.  Sure it's an digital zoom, sure it leaves f2.8 immediately upon most the zoom at all, but the quality of the photos, the 16FPS, the ability to shoot full-time autofocused 1080p video with the push of a dedicated video button make this unit really stand out.I would have no reservations forgoing my 7D and taking this instead on a family trip where space and weight were critical.  The quality and features are there...for me, it's just overcoming the learning curve as I get used to a different platform than Canon.", "Date": "April 20, 2013"}, {"Title": "A very, very good camera", "Author": "Abraham", "ReviewID": "RVERV6WUJS7IC", "Overall": "5.0", "Content": "This camera has a number of good features.  In no particular order, they are:o The lens is long and fasto The viewfinder and LED screen (920kPixels) are EXCELLENT.o The sensor is larger than that of many of its competitors. This sensor has 8 times as many pixels as a full HD display.  If you're going to put your photo on your computer, you will have a lot of pan and zoom available to you.o CMOS sensors like this are better at low light.o The artificial horizon is a helpful toolo The focussing aids work well - as long as you know they are going to come ono The hybrid autofocus is indeed faster, often seeming almost instantaneouso Both in spot and average, the focus is very good at bringing into focus what I want in focuso The manual zoom is a wonderful thing to have (for all stills and low dynamic video)o The manual zoom saves an enormous amount of battery lifeo The manual focus is actually usable - using a lens ring is a wondero The manual exposure controls are the easiest I have seen in a non-SLRo The camera has an unmarked knob to which almost ANY function may be assigned.  Majorly COOL.o Saturation and color accuracy are the best I have seen from Fuji and easily rival a Canon HS we also own.o The camera is easy to handle (though it certainly won't fit in your pocket)o Battery life is more than satisfactory, though from 1st Low Battery warning to DEAD can be very short indeedo The solidity and build of the camera are substantial and pleasingo The number of features available in the UI is impressive and most are quite usableo Under Advanced, the camera has a mode in which it will rapidly take 2-4 pictures with a very high ISO setting and then combine them into a single frame to eliminate the usual high-ISO noise.  The results are ASTOUNDING.  You can take shots by candlelight that look like 25 ASA Kodachrome (if you're old enough to know what that even means).  NO NOISE.o I found the complaints about the ON/OFF switch to be unfounded.  This is the third or fourth camera I have owned with a power switch of this design and it has never been an issue with me.o Motion panorama needs a tripod if you have any zoom on at all, but does produce excellent images.o Movies are crispy and well exposed.  Focus and exposure are both dynamic and accurate.  Manual zoom's a litte rough for videoo The ability to vary the camera's dynamic range is useful and enables some creative tricks you never saw outside of Photoshopo This camera supports both sides of \"Zen and the Art of Motorcycle Maintenance\": an expert can use it and a complete novice can use it (as long as the novice doesn't start messing with the knobby bits).  It has a truly brainless AUTO mode that will take care of everything and in almost all cases, take excellent pictures.The only drawbacks are, as I have already noted, that the manual zoom makes long, slow zooms in videos very difficult to accomplish, particularly if you are not on a tripod.  TIP: always use a tripod when shooting video. TIP: Viewers get rapidly tired of long zooms and pans; shoot primarily static shots; allow your subjects to do the moving.You will need to spend some time really learning how to use this camera.  Like any new, upper end camera, it has a LOT of features and if you just pick it up and try to start shooting, you are going to get confused and/or frustrated.  Have the camera in front of you as you go through the full manual.  Operate every feature and setting till you at least know what it is doing - whether or not you think you will ever use it.  The reward will be feeling much more comfortable and being able to get the camera to do what you want it to, which is a LOT.As pointed out by several other reviewers, replacing the capability of this lens with interchangeables would cost a fortune and you will, of course, have to stop what you are doing to dig out the next lens, switch them and put the old one away by which time your Pileated Woodpecker has flown the coop.  I keep telling myself I'm going to get a DSLR, but if they keep producing point-and-shoots like this, I believe I never will.Genug.", "Date": "January 2, 2014"}, {"Title": "great job fuji!", "Author": "hendro tri wibowo", "ReviewID": "R8BUZNOGHN41O", "Overall": "5.0", "Content": "I've been using a lot of point and shoot cameras and also dslr , i.e. pentax, olympus, sony, canon, nikon.  And i can say this hs50exr is one of the best bridge camera out there. Smaller sensor doesn't mean bad IQ, you just have to find the right configuration to be able to take this camera to the fullest :-). It's using new developed sensor by fuji. Remember the old days when everything is big,.i.e. tv, cell phone.  And now everything is smaller,thinner  and beautiful :-). Well of course at some point you can not compare the IQ with high end DSLR,  but the again you  will have to spend thousands of dollars with DSLR. $475 for this fuji is pretty expensive for bridge camera, but believe me, it's worthed :-) you can get nice pics with this camera, don't need to change lenses and the IQ is  comparable to mid-end DSLR, IMHO.", "Date": "May 13, 2013"}, {"Title": "A Nearly Perfect \"Bridge\" Camera", "Author": "Jeffrey N. Fritz \"Nikon Jeff\"", "ReviewID": "R28N57SNUYVWPS", "Overall": "5.0", "Content": "There exists an important space between DSLR cameras and point-and-shoot cameras. Although the point-and-shots have begun to push upwards and the DSLRs downwards, neither has been able, up to now, to quite fill the gap. This space is where certain cameras, often dubbed the \"bridge cameras,\" exist.Bridge cameras look like DSLRs but without the interchangeable lenses. They are larger than a typical point and shoot, but carry many point-and-shoot characteristics.The Fujifilm FinePix HS50EXR fits right into the bridge camera space and does a superb job doing so. Feature rich, well made, fitting perfectly in the hand, this feels and acts like what it is--a very well thought out, very well designed, quality camera. It is so capable at what it does that it can easily fool you into thinking that indeed it is a DSLR.Of course, it is not a DSLR--a fact that readily makes itself apparent. The viewfinder is electronic. When the camera is powered off you see nothing through the viewfinder. You can not remove the non-interchangeable lens. The lens that comes attached to the camera remains attached to it for life. However, it's a decent zoom lens and the lens does accept commonly found 58mm filters--a very good thing. The zoom range is amazing, it shoots RAW, has manual controls. It is the perfect beginner's camera and a credible back up camera for professionals such as myself. In fact, it meets or exceeds nearly every item on my backup camera checklist.Sure there are some things that I wish had been included.As a manual shooter, having separate controls for aperture and shutter speed would have been nice. The  HS50EXR  does have manual aperture and shutter speed control. However,  it is necessary  to push the +/- button to change the command dial to one or the other adjustment mode. This kind of restriction tempts me to use aperture or shutter priority to save me from the inconvenience--and that is simply not my shooting preference nine times out of ten.The viewfinder is a bit large protruding out of the back of the camera far more than on my DSLR. It is a small annoyance now, but no doubt I will get used to it over time.Of bigger concern is that the lens is a manual zoom. There is no motorized zoom in the camera. Not much of an issue for stills, to be sure, but a very big issue for video. If Fujifilm wants to offer video in their cameras, a motorized zoom is a must.However, even with these concerns, this is one great camera at a very reasonable price. In addition to the camera, you get a strap, a lens cover, a lens hood, a built-in flash, a charger, 1080P 60 FPS, stereo sound video capability, a USB cable and brief, but very readable instructions. Not too shabby. And the image quality on stills or video  is quite good.This is a fun camera with nice features, great performance and it includes a decent menu system. It is, above all, intuitive and easy to operate. With or without your user manual, you will be up and running shortly after opening the box. It takes longer to charge the battery than it does to learn the camera. Well done Fujifilm!", "Date": "April 23, 2013"}, {"Title": "Outstanding Bridge Camera", "Author": "M. Stevens", "ReviewID": "RJDXLCNCC96NU", "Overall": "5.0", "Content": "This HS50EXR is replacing my Fuji S9100 which has served me fine for 6 years. I always felt my pictures with the S9100 were very good until I got this new Fuji. The speed, resolution, features and typical Fuji build quality are all A+ with this unit. I feel there is nothing on the market that can compete with this camera in it's price range. I researched for a week+ looking to even break away from Fuji and the sad thing is, I found nothing to compare the HS50EXR to, either in bridge form or for under $425.00. If you are a casual user of cameras I suggest sticking with a lower model of finepix or even another brand. However, if you want super clear/sharp/hi-res pictures with amazing color reproduction I suggest you don't hesitate on buying the HS50EXR. You will not be disappointed.", "Date": "July 1, 2013"}, {"Title": "HS50 EXR. Probably the best camera I have ever owned!!!", "Author": "Dennis & Janet", "ReviewID": "R3EZ1KAGE5AM27", "Overall": "5.0", "Content": "I was a dyed in the wool 35mm SLR owner for years.  My preferred choice were Canon bodies, flash guns and lenses.  Digital freed me from carrying round a suitcase and, as Fuji were a top film manufacturer, I went with them.They have gradually got better over the years and the HS50 EXR is their best yet.I have read other reviews here and wonder whether they are a review of the camera or a platform for the author to demonstrate their technical knowledge of digital photography.  I don't want to hear whether the camera isn't tough enough to be used in a war zone or it does not succeed in competing with £4000-00 worth of digital kit.  It's all irrelevant!  The cameras strengths are as follows-1. It takes great pictures in a variety of conditions that are super sharp.2. It handles like a DSLR so requires no modification of long learned techniques.3. On auto it allows the user to concentrate on composition of the photo rather than the camera technology.4. In most instances no post production is required as the camera gets it right first time.5. It is as easy or as complicated to use as you would like.6. Check out the 1000mm zoom.  Incredible!In short, if you want a great camera and are not supplying pictures to international advertising agencies, this is the one to get.  If you just want to talk about cameras, specs, aberrations, flare, converging verticals and other irrelevant matters, go ahead and see if you can get anything like the same spec for under £4000-00.This camera is capable of capturing images of a quality that anyone would be proud of!Remember the David Bailey advertisement in the 70's re the Olympus Trip!It is not the camera but the photographer who makes the great pictures and the camera merely helps.  If you don't believe me have a look on the net at some of the great images captured by this camera and you will see what I mean.And no!  I have no connection with Fuji or any manufacturer or retailer.It's £350 quid.  What have you got to lose?Buy and enjoy.I have!!!", "Date": "August 30, 2013"}, {"Title": "Can't say enough good things about this camera!", "Author": "Laura Lea Evans", "ReviewID": "RYOMWYN8Z7NHF", "Overall": "5.0", "Content": "After lusting for months, I finally was able to buy the HS50EXR, but; going from the previous model HS20EXR (another excellent camera) had me wondering if all the hype would pay in results. Honestly, I needn't have worried as... OMG, it's a killer camera this one! I went out for fall color and brought home dazzling pictures using the Dynamic setting in Auto. Blowing friends away with their Nikons and Canons in the process. Okay, I'm a Fuji enthusiast anyway, but pretty darn critical of my own work and this model is the tops. Easy to operate. The only flaw is the on/off switch which is located atop the camera body and seems awfully prone to be turned on even when putting the camera back into the bag. This translates to a dead battery if one is not attentive. I've learned quickly to check that switch each time consequently.I love the longer lens too. Being able to get those distant shots in sharp focus or the macro images without changing lens is a miracle. I watch folks struggling with tripods, huge lenses and think: why?? This camera does it all and with no fuss, no blur. It's exciting to get great, dependable photographs with just one camera, one lens. Can't beat it.", "Date": "October 14, 2013"}, {"Title": "High end super-zoom bridge camera", "Author": "D. Hentze", "ReviewID": "R2RECDWEQEWM0A", "Overall": "5.0", "Content": "The Fujifilm FinePix HS50EXR is Fuji's latest EXR high end super-zoom camera. Before I even start my review, let me point out although this camera looks like a DSLR and has some DSLR features and controls, it is not a DSLR. It is basically a \"point and shoot\" with a fairly small 1/2\" sensor, inside a DSLR style body, with an incredible zoom lens. Now that I got that out of the way, on to the review. Unboxing the HS50EXR, the first thing I noticed was the size and weight of the camera. I have several other super-zooms, and this is by far the biggest and heaviest. It's not quite as heavy and big as a DSLR, but it's close. In my hands, the cameras has good ergonomics, and feels well built. Controls are fairly well laid out too. After charging the proprietary battery, which took about 2 hours in the included external charger, I noticed my first disappointment. The plastic battery door does not seem that well made and designed. It feels cheap and I question how long it will last. My next disappointment was the all plastic tripod mount. I then installed the lens cap, neck strap, and lens hood. All seem about average quality. There is no SD card included,  so make sure you have one. A fast Class 10 is recommended. After turning the camera on, setting it up for how I wanted to shoot was quick and painless. Having some experience with an earlier Fuji EXR camera helped me decided how I was going to shoot. If you've never used a Fuji EXR camera, there is a learning curve to get the best results. It's not as easy to accomplish as others I've used. I set out on a bright sunny day, and took over a hundred pictures under various conditions. I used several different modes (this camrea has many) and settings. I shot mostly in EXR High Resolution Mode,(P)Mode, and simple auto mode. I use Fine/JPEG Format, not RAW. Refresh time between shots was almost instant, and the fastest of any similar camera I own. The manual zoom lens was a pleasure to use. It's incredible 24-1000mm range didn't disappoint. It isn't quite as smooth as a DSLR manual zoom lens, but I didn't expect it to be. The 3\", high resolution articulating screen also didn't disappoint. It's is clear and bright. While out, I also took several minutes of video to evaluate later. When I got home, I also shot a few dozen indoor pictures for testing purposes. I shot most of them in simple auto mode to see how the camera would handle low light without any help. After shooting about 200 pictures and several minutes of video, my battery still shows as full which tells me battery life is excellent.When I finished my testing, I hooked the camera up to my PC and HD Monitor using the included USB cable. Thankfully, the cable is standard and not proprietary. Once downloaded, my results didn't disappoint. Almost all my outdoor pictures came out excellent no matter what mode I used. Details were great. Colors were accurate. I didn't notice any optical aberrations, etc. The Fuji's Image Stabilization did a great job at the high end of the zoom. I used \"continuous mode\". One other setting that seemed to have slightly better results was turning the NR down to \"low\". All my other settings were the camera's defaults. The results were easily as good as my old Lumix FZ35, the super-zoom I considered the best for image quality until now. My indoor results were very good too. Image noise was low up until ISO 400, and still acceptable at ISO 800. I have no doubt that with a little tweaking of the camera's settings, my results could be even better. My HD test video came out excellent too. It did not disappoint on my HD monitor.The Fujifilm FinePix HS50EXR is not a DSLR, and it isn't perfect. It is a great camera with an incredible lens though. With a little trial and error, it produces pictures as good as any bridge camera I own. I recommend it.Pros:Incredible 42x Wide Angle Manual Zoom Lens.3\" High Resolution Articulating ScreenElectronic Viewfinder.Good automatic modes.Manual controls.RAW Mode.Excellent image quality indoors and out.Excellent 1080p HD video quality.Super fast focusing and refresh time between shots.Great battery life.Cons:Fairly expensive.EXR settings have a learning curve.Poor battery cover and tripod mount.Mediocre accessories.Proprietary battery.Larger and heavier than most bridge cameras.", "Date": "April 22, 2013"}, {"Title": "If you like high zoom and wide aperture without DSLR cost, this camera could be for you", "Author": "Joel Avrunin \"Electrical Engineer who loves S...", "ReviewID": "R10VV1NJE5EWV7", "Overall": "4.0", "Content": "I have been steeped in digital photography for over a decade and have quite a few cameras to fit my needs.  I'm not a totally gear-head - I do tend to prefer cameras that work well in pure automatic mode, reserving manual fine tuning for rare occasions.  In other words, a camera that is only serviceable via RAW mode is no use for me.  I have three cameras in my arsenal right now, the Canon PowerShot A4000IS 16.0 MP Digital Camera with 8x Optical Image Stabilized Zoom 28mm Wide-Angle Lens with 720p HD Video Recording and 3.0-Inch LCD (Red), Canon PowerShot S100 12.1 MP Digital Camera with 5x Wide-Angle Optical Image Stabilized Zoom (Black), and the Canon EOS 20D 8.2MP Digital SLR Camera with EF-S 18-55mm f/3.5-5.6 Lens.  The A4000IS is really the camera for the kids, but the S100 is my pocket camera and the 20D DSLR is my good camera for when I don't mind the weight.So where does the Fuji H50EXR fit into this picture?  This is a bridge camera, with the body profile of a DSLR, but the lens is not interchangeable and the cost is far less.  There are plenty of extensive reviews on the web, so I'm hoping my review can provide insight beyond the encyclopedic coverage on features you will never use.In short, this camera has three strong points going for it - the 42x zoom, the 24mm wide angle, and the f2.8 aperture opening.  That's not to say there aren't other great features (like a bright LCD, HD movie recording, etc), but those are what sets it out at this price point.Most people know why 42x zoom is important.  Note that this is a purely optical zoom, not digital.  Digital zoom just takes a high resolution photo and pre-crops it.  Optical zoom preserves the image quality.  With the 1000mm lens, you can zoom into far away objects quite easily.  The zoom is manual, a nice feature when zooming during a video, or when you need to zoom quickly.  Many cameras are near useless at maxmium zoom without a tripod because the image blurs, but the built-in image stabilization means that the 42x is quite usable.It is also nice that the lens can go to 24mm.  That means you can do easier shots indoors when the subject is near you - this is effectively a wide-angle or macro-type setting.  Many super zoom lenses cannot also do the 24mm setting.So what is f2.8 and why should you care?  The f-setting refers to how wide the aperture can open.  While the f2.8 only applies at the widest setting, it is significantly better than competing cameras, many of which are closer to f3.5.  In dark rooms, a camera with a lower f-setting will let in more light and get lighter pictures with shorter exposure time.What else does the camera offer?  It has some cool features such as a built-in panorama stitch mode and a 480fps movie mode for making slow-motion videos.  These features are mostly for fun.  The panorama stitch mode unfortunately only does vertical resolution of 1080 pixels, or less than 1/3 the normal vertical resolution of a still photo.  The 480fps mode also is extremely low resolution and is neat, but almost unusable as the video is so hard to see.There are some facts of life with this camera.  You can't get a pitcher of orange juice from one orange, nor can you get the best images from a small sensor and smaller optics.  The sensor is small, only 1/2\", which means that images will have more noise than DSLR cameras with larger sensors.  While large sensors have started to filter into the lower-end space, they don't come in cameras that have 42x zooms or cost less than $500.  Camera specifications for a given price range have give and take.  The Sony NEX-3NL/W Compact Interchangeable Lens Digital Camera Kit (White) might have a large beautiful sensor, but the kit lens is only 55mm, not 1000mm.  Add on a better lens and you're into DSLR territory.  In short, a camera must be evaluated on image quality within the price range of the camera.There are some similar market competitors with even better zooms for similar camera bodies, but of course many don't have all of the extra features like panorama or the really wide aperture.All of that being said, it's a 4 star camera.  I was disappointed that they didn't include a manual and I had to download it off the web.  I couldn't find any method to show a histogram of the picture during review, a useful feature to know if the photo is properly exposed.  It has since been pointed out to me how to do it, so I can say it does have histogram, but I still couldn't find it easily.  The camera screen also didn't give me useful feedback in manual mode to know if the picture would be properly exposed once taken as I adjusted the aperture and shutter speed.  I had to click and find out.  A manual focus wheel, a multi-purpose adjust dial, and a \"quick\" menu are a manual do-it-yourselfer's dream, but you will take some time to get used to these.I also found the user interface a little cumbersome.  Given that this is a new camera, it's about time they went touchscreen and got rid of all of these buttons.  Browsing and zooming on photos you took requires two buttons near the front of the top and the scroll wheel on the back.  In quite a few uses, you will find yourself going all over the camera looking for the right button.  I acknowledge that some of this may be familiarity - I know Canon better than Fuji - it just seems that they didn't make this as easy as they could have for new photographers.  The interface just felt clunky and not well organized.Other shortcomings?  The flash must be manually opened and the zoom is also a little stiff compared to my DSLR to turn.  Truthfully, the camera is surprisingly heavy for its position as a bridge camera.  It's honestly not much lighter than my DSLR, and when I went out with it on a hike today, wondered why I didn't just bring my DSLR along.  Granted, I normally carry a 270mm lens and not a 1000mm one, but I was still surprised by the weight.  That being said, not everyone can afford a DSLR, making this an excellent choice as a value high-end camera.Despite smaller shortcomings, this is a nice camera that you can take from the box, put into \"auto\" mode, and start taking nice photos.  If you value the 1000x zoom, the f2.8 setting, and the lower cost, it is a fine choice for general purpose use and for a low-cost alternative to a DSLR that gets you a wide aperture and excellent zoom.", "Date": "May 12, 2013"}, {"Title": "Meet all the expectations .", "Author": "Joey", "ReviewID": "R3GUVHNOAKC2RR", "Overall": "5.0", "Content": "Purchased this after wanting something more than a small point and shoot . Wated something in the real of an SLR without paying the big bucks .Went to CNET.Com to get their views on the sites reviews of Compact cameras 7 found this and one other camera ( Cannon HS50 ) were in close proximity of one another on  the features ; however low light photography leaned on the FujiFILM Fine Pix HS50EXR . It does have a manual zoom . Of which is fine for my photo shooting . The Zooms were said to produce noise . Also this camera has a high resolution . The ease of handling ( holding the camera was another concern with those flat faced cameras . This although smaller than full sized SLR's ( which are  much more costlier also ) it provides a good grip for my large mitten hands . great buy & hope to take some great pics especially at Christmas time . Would recommend reading all the Reviews out there & the reviews of those that have purchased this camera . Also if interested in a small camera bag that fits it try the Lowepro Toploader Zoom 45AwIt fits the camera with the sun shield on it . looking for more space see the others in this line of cases that offer a little more room for stuff.", "Date": "October 17, 2013"}, {"Title": "Fujifilm HS50EXR 5 star rating", "Author": "Charles", "ReviewID": "R1QODCAH3JSWM7", "Overall": "5.0", "Content": "During this review I will cover a few main areas that really blew my mind with this Camera. I am mostly a black and white and still frame/freeze motion (color) photographer but still enjoy all types of photography including macro/landscape.  First off, The IQ (image quality) on this unit is amazing, especially when using the new EXR technology. Although black and white photos dont truly take advantige of the color aspect/range that this camera is capable of, I primarly was looking for Sharpness and contrast ability. This unit has scored a 10/10 in my book and i have used DSRL cameras in the past so i do have something to compare it to. Although the image sensor is the biggest thing that i have found DSRL only users complain about, I have had no complants as far as that aspect goes (I'm not trying to print things the size on a poster board) lol.  The Manual Zoom and manual Focus ability has also risen the bar for me on this unit. The 42x Zoom is outstanding while upholding the quality of the image. The manual focus ring is also very helpfull when your taking pictures of Items/objects that tends to drive autofocus up a wall (i.e photography of moving water/ Freeze frame, macro ect ect).  The autofocus system is also a 10 out of 10 on the HS50. I have a good friend that is a professional photographer that only uses Canon and he was amazed at the speed this camera deliveres while upholding the picture quality, especially when shooting continuous at 11 photos per second. When Fujifilm advertised a .05 auto focus capability, i will admit I had my doubts, but I was would have been wrong. The .05 auto focus response system is true and accurite. I have even found in low lighting that it holds it's own compared to mid range DSRL's.  The other shooting options on the HS50EXR including, Manual, Apeture priority, shutter priority, advance, Program mode ect are also excellent features to have and I will say all work with exeptional precision.  All in all fujifilm has raised the Bar with this camera, taking in the price and all the options avaliable i would recommend this digital camera to anyone ranging form amatuer to professional that does want to change lenses everythime a photo opportunity comes up or spend thousands of dollars on camera lenses. Although it is only a bridge camera, it's giving mid range DSLR's a run for there money. I look forward to the other advances Fujifilm makes with the new EXR CMOS technology in the future.Excellent Job Fuji :)", "Date": "May 30, 2013"}, {"Title": "Its really a good camera in its class. Compared with Nikon P510, Canon SX50 & Sony HX100V", "Author": "Gajanand", "ReviewID": "RELTQDO35BZOG", "Overall": "4.0", "Content": "Hi,I bought this camera from Amazon US, got the delivery on time. I appreciate Amazon, good work, keep it up.About the Product:It really a good camera amongst bridge category.Although its a good camera, it has got some pros and cons (from my point of view).Pros1. Very powerful Lens/Sensor in its class/range.2. Nice 42X Zoom3. Auto focus Response is Excellent.(*****)4. Capturing speed is really good.5. Manual Focus is also nice.6. Proximity sensor is really nice.7. Full HD Video at 60fps.. Awesome clarity.(*****)Cons:1. Zoom ring is bit Jerky, not suitable for Videos(if you want to zoom).2. RAW format is not impressive, it takes 25MB space to store each image and the image looks bluish.3. EXR mode works good. All the remaining modes have some limitations. Need to be an expert to handle other modes.4. While handling digital zoom, you need to be very firm and steady.People think that fujifilm cannot give good results when compared to other leading brands in the market which is totally nonsense. I have used Nikon P100, P500, P510, Sony HX100V and compared this camera with Canon SX50 as well and found that it is the best camera in its class.Thanks & RegardsAnand", "Date": "May 6, 2013"}, {"Title": "outdoors only", "Author": "AmazonKate", "ReviewID": "R1E0M2TJR8DQZK", "Overall": "2.0", "Content": "The zoom is amazing, the 'IS' is amazing, the autofocus is crazy fast (when it has lots of light)...Indoors, it's a different animal. With ambient light, the AF \"hunts\", often unsuccessfully. The picture quality in lower light situations is only borderline acceptable in lower resolution image capture. Actually I'm being too kind, the image capture in ambient indoor lighting situations is not very acceptable at all. Not for a camera of this caliber. The manual settings only ever make the picture quality worse, as it interferes with the camera's automated image improving schemes. jpg images have the look of pictures which have been through too many filters, taking on a slight 'painting' look. raw images show you all the image aberrations being masked (with loss of detail) by post processing. anything above ISO 800 is more marketing gimmick than realistically usable.I'm not a big \"returner of things\", and I was kinda psyched to get this camera, but it was disappointing enough with the indoor shots that I had to send it back for a refund. The final straw in my decision to return it, was when i compared the pictures to the pics I took side by side with my iphone... this camera takes better pics than my iphone... but not four hundred dollars better. The HS50exr's pics were consistently better than the iphone's pics, but not impressively better (iphone 4s for reference). For the bulk, weight, price, and single-functionality... the HS50 should have taken pictures that look stunning compared to any smartphone... It didn't. Not indoors anyway.If you want a camera for outdoor use, you want a big zoom (wildlife photography perhaps), or indoors with 'flash only' in fairly good lighting, and you do NOT want to take any ambient lighting pictures in mediocre lighting... then the camera might work fine for you. If you want to capture ambient lighting indoor shots though, this is not your camera. The 1/2\" image sensor is too small for good light gathering, and the aperture goes from f2.8 to f5 very rapidly if you even think of touching the zoom. Manufacturer claims (and some reviewer claims) that this camera has good low light handling capability are patently false.", "Date": "January 22, 2014"}, {"Title": "Love it", "Author": "Estella", "ReviewID": "RLVF016ADEVY7", "Overall": "5.0", "Content": "I can't add much to what the other reviewers have said. I love this camera, even though it has a few little drawbacks, such as the on/off switch being in a place that is vulnerable to being accidently turned on. I have not had any problems with the zoom being stiff. I like having the ability to tilt the screen in case you need to hold the camera high above someone's head, such as at a concert. I also have been having a lot of fun playing with the partial color feature. You can make very cool artsy pictures with no skill at all! I \"downgraded\" to this camera from a Nikon SLR, and I'm getting better pictures than I ever have. The super macro is great for flower pictures, and the zoom is wonderful for wildlife shots. If you just want good pictures and you're not interested in impressing people with your hardware, this is a great camera.", "Date": "November 22, 2013"}, {"Title": "A great buy!", "Author": "Michael Bender \"Pixel Peeper\"", "ReviewID": "R3FZF1VUWKRIZS", "Overall": "5.0", "Content": "This Fujii HS50EXR camera makes me sad I had previously purchased a Canon 60D and an assortment of lenses for it.  The Fujii is almost its equal, the only advantage the $1000 dollar 60D has is that it processes and stores the shot faster.  The Fujii does have a buffer though that lets you take 5 quick shots before things slow down.  For me, an amateur, though it is not a detriment and I will gladly give up the speed of consecutive shooting for the benefit of a lighter weight and not having to change very expensive lens to gain the same reach.  When comparing the output of the two cameras I can't see where the Canon puts out any sharper or noiseless images.  I'm sure a professional photographer might not agree but comparing by pixel peeping images from both cameras on a 22 inch monitor makes me think the huge diffference in price for a DSLR isn't worth it .When shooting indoors with ordinary lamps you do have to use a gray card or white sheet and set the White Balance for custom to get a more natural color for both the Fujii and Canon.  That said though, you can boost the ISO number in both cameras and not get excessive noise.  I also love that you manually extend the telephoto lens the same as a DSLR and don't have to struggle to get the right extention by pressing a switch and having a little motor or whatever do it.  I think shooting in live view the Fujii is way better because it doesn't have to flip a mirror up to focus and shoot.I was surprised that a Nikon P510 would allow you to shoot indoors using the Automatic White Balance setting and the camera would produce pretty good colors.  If you raise the Nikon ISO above 200 though, you get noticeable noise in the image and the Nikon also won't automatically turn on the view finder when you put your eye to it but you have to press a button, which I found quite frustrating.", "Date": "September 17, 2013"}, {"Title": "Solid camera but a few \"bugs\" good value for price point.", "Author": "Momma Mary \"Expert Mom!\"", "ReviewID": "REX7U3WSPDAKK", "Overall": "4.0", "Content": "Prosumer Review:Since I got my new HS50 it has now completely replaced my old Nikon P510 as my go-to DSLR. I take it on all my treks though the woods and countryside and have captured some really stunning shots. One of the main reasons I selected this camera was due to the manual 42x zoom and I can't say I'm disappointed. The P510 had some problems with loosing quality when zooming far distances but this HS5o's handling it like a champ!I tried using the default SilkyPix that came with the HS50 but I found that it was a too simplified and didn't have all the features I use daily so I still prefer doing all my touchups on Aperture and manually uploading.Something that I'd recommend to anyone getting this or any other HD camera is to get a Class 10 SD card for this camera! When I tried using my old Kingston Class 4 the delay in-between shots was greatly decreased and actually caused me to miss a few good shots.Also I noticed when in video mode the mic doesn't pic up voices clearly if you are too far away, so play with it a bit first before missing \"spontaneous\" footage, so you are familiar with the optimum range for your needs. It does make a difference in the voice quality and distance depending on if it is indoors (& the size of the room) verses outdoors. So play with it a little bit so you will know the optimum parameters for recording video.Pros:Amazing macro (1cm!) for those closeup shots of natureLong battery life, and it does allow for aftermarket batteries as wellLarge LCD screen1080P video is absolutely beautiful at 60 fpsAuto-stabilization is top of the line, it looks as if I am using a tripod while free handingWhen looking through the view-finder it turns off the 3 inch LCD42x Zoom! Distance wise I was able to take a photo from about 100 yards away (Very useful for taking pictures of wild animals)Automatic Gif creator (I love playing with this mode)Cons:Software included is lacking many featuresbuilt in Mic has limited rangeThe zoom feels a little jumpy, its not a smooth as I would like it to beIf I had anything negative to say about the camera it would be the zoom. It seems that the zoom it a little rough to zero in on that perfect shot", "Date": "May 7, 2013"}, {"Title": "I LOVE this camera!", "Author": "Sarah Small \"francefan\"", "ReviewID": "R3R9MY4E0EKF32", "Overall": "5.0", "Content": "I purchased this camera back in November, before a trip to Paris.  I have had three Fujis before this one, but the 100.00 pocket type, but since I recently got into photography (using a friend's camera) I decided I wanted to invest in a better camera to really play with.  My cousin, who is a camera buff, helped me choose this model based on my needs and budget.  In his words \"This camera will do everything my $4,000.00 camera will do.\"  He was right.  I practiced a little with it before I left for Paris, which is the best thing I could've done.  In fact, I spent the day with my cousin, who really understands cameras, and we went through the manual (which is really not enough.....go online to the Fuji website and download the one there) and he helped me get it set up with the proper settings, as well as understand what the filters do etc.  Do not buy this camera and go on a trip the next day!  Unless you are familiar with all of the settings, you will spend a lot of time trying to figure them out.  Hey...I admit it....I'm a creative sort, not a technical sort.....so a lot of the technical stuff is just gibberish to me!That all being said, I took almost 800 pictures while in Paris for 5 days....and since I have been there several times before, I knew which pictures and subjects I wanted to go back for a \"do-over\" with...including a night shot of the eiffel tower lit up, which I was never able to successfully take before.  This time....WOW.  It was amazing!  The zoom on this camera let me zoom in on the gargoyles at the top of Notre Dame and never lose resolution.  All I can tell you, is when I came home, and downloaded my pictures and looked at them on my computer, I thought \"WOW....you are one helluva photographer!\"  LOL.I used the Advanced filters a lot. They enable you to pick a color like RED, and when taking the picture, everything red stays, all else in the background go to black and white.  Stunning pictures using that in Paris.  You can do the same with blue, green, yellow, orange and purple. Some of the pictures I took using those filters are downright amazing (IMHO).  There is also FANTASY filter that allows pictures to look a little \"gothic (my word)...and that was fun to play with with some of the architehture, churches and statuary, as well as those gargoyles.  I had more fun taking pictures with this camera!If you just want to take a good all around picture....AUTO works great on this.  It has a pop up flash, lots of other settings for taking portraits, macro, multiple exposure, etc.  Just get one and play play play!!!", "Date": "January 2, 2014"}, {"Title": "Excellent Camera - Portable and Versatile.", "Author": "Christopher Mohommed \"Computerman\"", "ReviewID": "R3QTY1RJD0EUY8", "Overall": "5.0", "Content": "The camera is everything I expected it to be. The phase detect is really fast and I like the ability to manipulate/tweak the auto focus settings for different shooting situations. The macro/super macro works well. The optical zoom is great. The intelligent digital zoom is ok. The stabilization is very good. Although my personal preference, for long range shooting, is to use a tripod whenever possible. The 'filters', although not necessary, do add a layer of simplistic fun to the camera. Being able to shoot in RAW is definately a big plus!My personal opinion is that this camera is not for novices. If you have never changed a setting to take a picture on any camera you have ever used then this camera is not for you! If you are a beginner and have lots of patience and are willing to spend the time to learn, then this camera will serve you well. If you are an experienced user and value the importance of being able to customise your settings 'on the fly' you should be quite satisfied with this camera.The main reasons I love this camera are portability, versatility and RAW! It is much easier to walk around with this camera for casual shooting than a DSLR with kit. Once you master this camera's settings you will be able to manipulate it very quickly to suit any occasion. In terms of picture quality, I'd consider it quite suitable for non-commercial purposes.", "Date": "December 5, 2013"}, {"Title": "great camera", "Author": "wade m smith", "ReviewID": "R85EF5KHOEJ0Q", "Overall": "5.0", "Content": "i bought it to take on a trip to the redwoods. it was perfect. the zoom worked well. we took pics of deer and elk at 60 yards and it looked like they were 5 feet away. when i was taking pics of the redwoods the camera said greenery in the view finder and adjusted for the shot. then i was taking pics of a sunset on the beach and it said sunset. it would recognize the scene i was looking at and make adjustments. I have two professional photographers in my family and i got complements on some pics i would recommend this camera for anyone who is looking for a bridge camera or anyone who is looking for a telescopic lens and dose not want to pay for a SLR", "Date": "October 7, 2013"}, {"Title": "Superb camera", "Author": "Amazon Customer", "ReviewID": "RP2QVRMYE9XFB", "Overall": "5.0", "Content": "This Fujifilm camera is great, especially with a manual zoom function.  It is the closest to a dslr and the photos are good if not better than my Nikon dslr.  The EXR function is novel and really helps with resolution.  It has a variety of effects and is quite intuitive to use.  Amazing zoom capabilities.  Really happy with this purchase, and would recommend this to everybody who wants to take great photos with relative ease.  Macro and portrait are excellent too.  So is the rapid shooting mode.  Recently succeeded in taking amazing photos of the supermoon, something I couldn't get right before the EXR and zoom feature of this Bridge camera.  Thanks Amazon!", "Date": "August 8, 2013"}, {"Title": "Hand Held Craters on the MOON!", "Author": "Jared W. Jarvi Connection", "ReviewID": "R1D22YZVDPYOJJ", "Overall": "5.0", "Content": "My last stop before 4K and beyond.If your not making the big bucks yet but want a great digital camera for short movie production this is the one.I wanted just alone to get a famous Fujinon 1000m optical lense and they threw in a great camera as well.The best I could find unless your ready to spend $3000. to $10,000.Super cool Panorama and simple film stock simulation.This is a WoW camera way beyond semi-pro, no phone or Pad can out perform a real optical lense.", "Date": "June 15, 2013"}, {"Title": "For the Novice Photographer Who Is Need of Extra Large Zooming", "Author": "Canis Majoris", "ReviewID": "R16W2FLPFXOEK1", "Overall": "4.0", "Content": "This is a digital camera--non-SLR--that has a very large zooming capability. The 42x zoom could mean anything really e.g. 1mm-42mm however the specs for this particular camera are: 24-1000mm. That is the actual range you will be getting with this zoom. What the 'digital' means versus the SLR (Single Reflex Lens) is that when you look through the viewfinder you will be getting the camera's best 'guess' at what the image you are looking at looks like. Compare this to an SLR where you are looking directly at the light being exposed to the camera so that you see the image as the camera will see it when you take the picture. If you are one who usually prefers to preview your shots through the LCD screen, then this will not be an issue for you.Digital Camera - The light (your picture) filtering through your camera will go directly to the photo sensor--part taking the picture. The light will also pass through a sensor--different from the one through the lens--with the purpose of only relaying the 'image' back to you. When shot, the camera will take a different picture than the one you see in the viewfinder or LCD. As you have seen in digital cameras before, the 'guesswork' by the sensor is usually good enough in the accurate depiction area.SLR - The light from the image being shot is relaying directly to your viewfinder through a prism/mirror, and this light source is the same one that the sensor will shoot when you click the shutter button. When you click the latter to take the picture, a 'shutter' will open up the pathway from the light source and route it to the photo sensor, blocking you from seeing it at that time though before you shot the image, you saw what the camera was going to take. The natural camera sound is the flipping of the 'shutter'.Not wanting to go further into the differences of a digital vs SLR, I assume you know what you need and so I will not delineate on this subject anymore.[---Who Buys This Camera---]Someone who likes the feel of a bigger camera, that can comes equipped with a much bigger zoom than a point and shoot. Bigger camera, in this case, means better sensor than your average to mid-tier cameras. At the current price, it will be hard to find a comparably priced camera (even SLR) that has the type of sensor and zoom that this comes with.[---Quality---] 8.5/10Camera is heavy which I prefer however you may not like the weight of this when carrying it around by hand or around your neck. For me, though, it means well put together--which this camera is. The buttons are rigidly springy and the outer rubber and plastic shell does not feel cheap.**The zoom, while being a big selling point for this camera, is not fluid in its movement. It is the only item on the camera that feels cheaply done. While the zoom works as it should, the zooming by hand is rough, jerky, and 'grainy'. This is not a perfectly smooth zooming experience--which also decreases the possible 'precision' of the zoom being done.[---Pictures---] 8/10Taking normal light, everyday shooting, the quality is superb with no noticeable detail loss even at large increases in size for blow-up purposes. Colors are biting and saturated and light is represented fairly accurately as long as you properly white balance. Comparable to the Canon T3i series and above.[---LCD Screen---] 9/10Extraordinary sharp picture and color with viewing through the LCD screen. Allows navigating through menus fast with minimal strain--becuase of the sharp contrast, the screen is even appropriate to use in high daylight.[---Intangibles---] 9/10The abilities of the camera to do 'shallow focus' and sport shooting should be mentioned here because it does these very well, which is not what I expected. Looking at this product, my initial thoughts were that for parents doing family photography while on vacation or at a kid's sports game this would be one of the high-end, better options to take around. It performs evenly, and better in most cases, to the SLR cameras I was used to. Sports shooting was crisp and 'frozen', and short depth of field was fairly easy to obtain because of the more wider-than-usual aperature, added with the long zoom.[---Other Items to Note---]- Taking pictures through a digital camera (the HS50EXR is a glorified, beefier point-and-shoot) feels too 'easy'. There is no feedback when taking pictures. When you push the shoot button, you feel nothing--only you hear the virtual shutter sound file from the camera. This will feel less like you are 'making' the shot however, it is something you will have to get use to.- Lens is not interchangeable (you cannot swap out the lens).- Uses SDHC Class 10 well and takes advantage of it speed.The feeling of the camera is better than the price warrants--for I have felt slightly more expensive cameras that felt less in construction as the HS50EXR. If you are in need of this zoom, the picture will do great justice to your expected products in this range (mid-high tier). For this it is more 'comfortable' shooting in mid to high light situations and does not suit lower level lighting as much. For your sunny days on vacation or on the field with your kids, this will be the end of your search for a family shooting powerhouse.", "Date": "May 26, 2013"}, {"Title": "No, it's not a replacement for a DSLR - BUT:", "Author": "A. McCullough", "ReviewID": "R184J75PVWKSIH", "Overall": "5.0", "Content": "One has to judge a camera by the category in which it belongs, AND if the camera feels right to YOU. This is a small-sensor camera with a non-removable lens; it's towards the large end of the bridge camera genre but is not uncomfortable to use. I've owned the HS10, the HS20, and just recently upgraded to the HS50 - and it IS an upgrade, in most respects.On the pro side, as has been stated by other reviewers, is that whopping 42X zoom. The image stabilization has been vastly improved over the HS20, and it had to be, to make such a massive zoom at all feasible. I'm able to handhold this thing at 1/10 in mid-zoom in fairly poor light and get sharp images at ISO 100. Maybe I have steadier hands than most, but I'm middle-aged and fairly small in stature and frame and in my mind, the IS works (I keep it set to continuous for best results). Full zoom at that shutter/ISO combo, not so much (grin) but in better light that would up the shutter speed, it still works very well.The fully articulated LCD screen (which is incredible to look at) is another plus, and the EVF is fantastic as well.With the addition of phase detection focusing (in addition to the standard contrast detection), plus a substantial upgrade to burst mode shooting (up to 11 fps), it should be possible to capture images that weren't really an option in the previous incarnations. I haven't yet tried it for birds in flight, but I see no reason why this should be a problem for this camera.It DOES take some getting-used-to. There is a learning curve for this camera, and some settings do work better than others. I've spent time reading forums and noting the settings many others have listed - my hat's off, with thanks, to those who've spent the time in trial and error - and so far these are the ones I like:I use the Provia (standard) color setting. Astia is too soft and too slanted towards greens for my taste, Velvia too brash.Though I can shoot fully manual, I prefer Program mode (some animals are just not going to wait for you to dial in settings, grin). The rest of these settings would work with A, S and M modes too.On an everyday basis I have it set in terms of ISO to AUTO (1600) - the camera does a fairly decent job of matching the ISO to the circumstance and can often get you a shot that would have been lost otherwise. However, don't let the \"auto\" setting override your own judgement - if you KNOW that ISO 100 or 200 will work just fine for a particular set or shot, change it as needed. But for everyday, \"walkabout\" camera use, I do make use of that auto setting.Turn noise reduction as low as it will go; on this camera, that's -2 . Or shoot RAW, which has no noise reduction - but if burst mode speed is what you're after, RAW will only do 3 fps.  This camera's NR is EXTREMELY aggressive and will muddy the daylights out of detail. It doesn't produce much noise, either, even at fairly high ISO's, which makes me question Fuji's wisdom on that matter (grin). If what little noise there is bothers you, it's an easy fix in any program that does NR - just a little will do.Image size: Large (4:3). This will net .jpgs out of camera at roughly 5 mb each and RAWs in the 25 mb range, but it will get sufficient detail for VERY nice prints. Anything less and you're really wasting this camera's sensor. However, do remember to cut them down if you're emailing, please :DSet Sharpness to +2, Color to +2, Tone to -2, and Dynamic Range to 200% This will produce a crisp image with very, VERY natural color and a surprising amount of range between light and dark - if you're into photo editing, you'll be pleased to see how much headroom there is here in terms of rescuing either extreme.I normally use Auto white balance - it just plain works well - though in late evening you may want to set it to \"shade\" to remove some of the blue tint that can appear in shadowed areas.Photometry (metering) - I prefer Average as it simply does a bang-up job, though depending on what you're shooting you may need to set it to SPOT once in a while.There is an AF Tracking mode which works QUITE well for staying focused on moving subjects (either your motion or the subject's) but be aware that it will lock you out of the two macro modes of this camera. I prefer the standard center focus mode.If you shoot any macros, you're going to LOVE this camera's Super Macro - you can literally touch the object with your lens and it will focus.Manual focus mode is controlled by an external switch - turn it to \"M\" and the manual focus ring on that massive lens barrel is activated. It's smooth, quick - it works VERY well.Chromatic aberration, purple fringing, and vignetting is surprising low here - quite pleased to discover that.I don't shoot any of the \"art\" modes; I prefer to add any effects after the fact via software and not ruin an original. So I can't speak the \"toy camera, pop color\" etc. modes, nor can I speak to the panorama function. I don't use a still camera for shooting video so I'm not the person to ask about that either. There is an external mic socket. Haven't used it.You can use an external flash; the Fuji EF-42 flash is perfect for this if you're looking for TTL. Other aftermarket flash models can work but only in manual, they won't communicate with the camera. There is a menu item in the camera that tells it you want to use an external flash - that hasn't changed from the HS20. There is NO shutter sync limitation between the camera and the flash, or if there is, I haven't found it yet - I've seen folks posting flash shots at 1/1000 of a second. Yep, you read that right.Its image quality is VERY GOOD for a bridge camera, though its small sensor limits just how good it can be; I have an older Olympus 12 mp DSLR whose 4/3 sensor runs rings around this camera for sheer image detail capture. But having said that, the HS50 does produce some VERY good images indeed. I wish Amazon hadn't taken away the \"customer image\" function, I would have been pleased to post a few from this camera.Ergonomically I'm used to the weight and heft of this thing, having used two of its predecessor models. I haven't shot an automatic zoom camera (one with a zoom rocker switch) for years, so I don't find the placement of the on/off switch an issue.The one big drawback is that this camera no longer uses AA batteries - I was quite miffed to see that. Be aware, as others have noted, that this thing can go from an indicator that says \"mostly full\" to \"empty\" in a heartbeat - when I see that indicator drop AT ALL I start fishing for the spare.Overall, I'm VERY pleased with it, and I seriously enjoy shooting with it.", "Date": "May 18, 2014"}, {"Title": "so much more than I expected", "Author": "amichay oren", "ReviewID": "RLKOSCHFSXSIC", "Overall": "5.0", "Content": "When I looked at the camera's description I wasn't sure if it could really be that good. It still amazes me how perfectly this camera fits for me. I explored every small feature in it and haven't found even one little flaw, it's just perfect. This camera is customized for someone exactly like me. I like to have the option of high quality quick focus. I like to sometimes play a with the filters, which look much better then photo editing,  when I have time. I love to zoom in 42X on something and have a picture as sharp as if I was standing right next to it. I admit it took me a few days to figure out all the filters and modes. But until I did I just set it on EXR mode and the image was amazingly satisfying.The flash is very good too, but I don't usually use it. I only ordered this camera after I checked about every model existing of this type of camera. When I finally ordered it, I was willing to use it even though it didn't look very physically comfortable. I was so wrong. The camera body is shaped so well and it doesn't even get uncomfortable or heavy after holding it for hours. Considering all of these factors, the price is ridiculously low. I've had this camera for a while now. I am aware that my review seems totally unreal but I just love everything about the HS50EXR.", "Date": "March 1, 2014"}, {"Title": "Lots of pluses. Size and weight may be a negative for some.", "Author": "mark justice hinton \"mjh\"", "ReviewID": "RCICTZ8QZA3OM", "Overall": "4.0", "Content": "The Fujifilm Finepix HS50 EXR feels like a DSLR. It is much larger and heavier than other superzooms, though that may not matter to some users.This camera has the fastest shutter of any camera I've used (I don't use any DSLR). You point, you press the shutter, and the image is almost instantly captured. I think this feature sets the Fujifilm apart from all other superzooms and is its major strength.One unusual feature is that the zoom is entirely manual. Just as with a DSLR or traditional film camera, you turn the barrel to move the zoom. Sony has a feature similar to this except that the zoom is powered, whether you use the lever or the barrel. The Fujifilm zoom is very smooth and absolutely quiet.The lens is threaded for 58mm filters and the lens cap fits very securely. A sensor detects your face near the viewfinder (EVF) to automatically switch between the LCD and the EVF. This feature worked very well for me (Sony has this on some superzooms, as well). The EVF has the highest resolution of any point and shoot and is a real pleasure to use.The image processor in the Fujifilm is slightly larger than other superzooms. I didn't see any significant benefit, though in theory is should result in better images.Two years ago, I tried a predecessor to this camera and returned it to Amazon. Almost all of my objections to that camera have been resolved in this camera.In the past six months, I have used the Canon Powershot SX50 HS, the Sony CyberShot 200v, and the Fujifilm Finepix HS50 EXR, arguably the top 3 superzoom point and shoot cameras on the market at this moment. Each has its strengths and weakness, its fans and foes. None of the three is perfect. All three produce great images in bright light outdoors, making them excellent for landscapes and wildlife. My complaint that applies to all three is that the image quality doesn't live up to the superzoom. You'll get close, but you may not like what you see, especially as you crop.Updated 03-06-14:I ended up returning this camera because the quality of the images wasn't superior to the Canon PowerShot SX50 HS 12MP Digital Camera with 2.8-Inch LCD (Black). I have since purchased the Fujifilm X-S1 12MP EXR CMOS Digital Camera with Fujinon F2.8 to F5.6 Telephoto Lens and Ultra-Smooth 26x Manual Zoom (24-624mm), which has better image quality.", "Date": "December 30, 2013"}, {"Title": "A DSLR without the hassle of hauling lenses, .....", "Author": "JT", "ReviewID": "R6KBEXAJ845TW", "Overall": "5.0", "Content": "One of Fuji's best.This Camera is a DSLR without the need to haul a bunch of extra lenses. I have been shooting since way  before digital, and have had most all the big name SLR and DSLRs. Done a little professional work, and been published a couple times. That said, I think this camera is one of the best camera values out there. Capable of fantastic shots, and amazing Fuji quality. For the money, you can't beat it.", "Date": "November 27, 2013"}, {"Title": "Nice!", "Author": "FlyingCat", "ReviewID": "R1JJGK369OFEPN", "Overall": "4.0", "Content": "Lots better than my previous camera.  Canon PowerShot SD790 IS.  Don't get me wrong, I loved that Canon for 5 years!  But all I wanted, at that time, was a small point & shoot camera.  But my teenaged grandson spent some of his summer with us this year and I was disappointed with the quality of the shots.  So, after research, I decided on this Fuji.Maybe in 5 years I'll be asking myself why I bought this piece of ****, but right now, I'm very impressed.Yes, I haven't had a Canon or Nikon in the same class to do a comparison.Yes, I did have to take a class to learn how to use this.  I was taught about f-stops, aperture settings, etc.  But wasn't taught where all those \"things\" were on this camera!  The instructor was a professional photographer but had never used a Fuji.  I had brought the owner's manual with me to class but very difficult to read. But I muddled through and found those things she was wanting to teach us how to use.I came home from that class and experimented with what we were taught and I took the best picture that I've ever taken!  Wish I could post it on this review.  I took a picture of one of my orchids and you can see every little hair on the shaft of the flower.  I'm impressed with the lens on this camera.When I was growing up, the first camera I remember holding was a Brownie. Then I remember the first handheld camera with a flash!  Look how far we have come!I always take these reviews with a grain of salt.  I like the reviews that give the Pros and Cons.I haven't had enough cameras to give Pros and Cons about the picture quality of the camera.  But I will give you my pros and cons on what is important to me.Pros:Good quality pictureTelescoping lens is very adequate for my needsLike the silent feature so camera noise doesn't startle wild life (including grandkids)Very rarely have camera flash glare eyes in pet pictures. Don't know if it's the setting or what, but it's nice to see cat eyes with just indoor light.Cons:Put marks in the light meter. Where is center?  If we want to adjust light exposure + or -, there are no marks.  We have guess what is 50% or 40%- or 40%+, etc.Transferring pictures from camera to computer...very short cable. Have to put the camera on the floor next to the computer to plug it in. Alternative is ???Is a bit heavy but I haven't had another camera of this quality to use as comparison.4 stars instead of 5 because of the manual.The manual on this camera could have comfortably have been the size of a paperback book.Camera manual....loads of information but font is way too small.  Hey, kids, remember that there are a lot of us Baby Boomers that are now grandparents that have the money to buy a decent camera.  We would like the manual to be written in a large enough font that we don't have to have our reading glasses plus a magnifying glass in order to read it!  Spend a few pennies more for more paper for a larger manual booklet.  Be considerate of us old folks and we might remember you in our will.  *grin*", "Date": "November 26, 2013"}, {"Title": "amazing camera", "Author": "Brandon Greer", "ReviewID": "R1SFXDMTJDXF8M", "Overall": "5.0", "Content": "This is an awesome camera and takes pictures that look like professional photos.  It is a great camera,  easy to use, and the zoom can really bring you close up......buy this camera", "Date": "August 6, 2013"}, {"Title": "Love this Camera!", "Author": "cemeterysrock", "ReviewID": "R1RPI6AQE9V981", "Overall": "5.0", "Content": "I love Fuji cameras and this one is no exception. I had it for 3 days and took over 2000 photos involving various lighting, motion, day and night shots, and used the manual and set focus'. Photo quality was very good and the camera is easy to use. Night action shots are blurred but I need to practice (to be fair). My last camera was a S1800 and I will be keeping that as my second.The camera is heavy but not unmanageable. I would suggest that you familiarize yourself with the manual first but options are easy to find", "Date": "July 14, 2013"}, {"Title": "A glorified Point-and-Shoot", "Author": "Valerya Couto \"LOTRsherlockHPFreak\"", "ReviewID": "R3U0RA84FKDZOL", "Overall": "4.0", "Content": "I'm no photo expert but I can certainly distinguish between an awful camera and a pretty nice one. For my needs, this is a VERY nice camera. I have 2 toddlers and my one gripe has always been delayed focus. I don't have time to wait for a picture. When I click the big button, I want that exact shot, not a delayed one. If I had an SLR I wouldn't have this issue, I know, but I can't exactly afford one. This particular FinePix is quite fast in regards to shutter speed, and focusing. For me, that's a keeper. I can snap away without worry. I do get the blurry image every now and then, but for the most part, it works flawlessly. Images come out crisp and clear, the colors pretty spot on. Pictures taken outdoors with natural lighting are near perfect; I wish I could take all the pics that way. Indoors, the flash is reliable and rarely washes the image out. 99% of the time I use the camera on Auto, simply because I just haven't had the time to properly set everything up manually. But this camera is very capable. Video mode is easy to use and is very nice quality as well. I love how long the battery lasts between charges. Far better than my older model Fujifilm. The zoom is amazing. 42x is more than alot of people need, including me, but it's still fun to play around with. I also love the panorama mode, but it takes a bit of practice to get it just right. The menu takes a bit of getting used to and there's many different buttons to figure out, but it just takes a bit of time and reading of the manual. My one gripe would be how heavy this camera is. It is very bulky and though nice and solid, it gets uncomfortable in a short amount of time. The neck strap it comes with is pretty thick and comfortable though and comes in handy.For this price, you will get an amazing camera but I can understand chipping a couple hundred dollars more to get an SLR. Like I said, for my needs it isn't necessary and this camera accomplishes pretty much everything that I was looking for. The lense alone is worth the price. I am quite pleased and plan on using this for quite a few more years, if it lasts!", "Date": "June 19, 2013"}, {"Title": "One amazing bridge (not DSL) camera", "Author": "Beenaroundyaknow", "ReviewID": "RA7020ELIE4H0", "Overall": "5.0", "Content": "I love this camera.  I spent 3 weeks deciding between three brands but the reviews of the Fuji sold me. This is not a DSL with interchangeable lenses but the supplied lens is amazing.  It is a little hefty, which I actually like, due to it's aluminum internal case and big lens vs. plastic for all others I considered.  The 22 mm to 1000 mm zoom lens is phenomenal.  A quarter turn of the barrel goes from one extreme to the other.  The photos taken are top rate and this camera has so many features it will take me 6 months to try everything.  The instruction book is less than 10 pages with tiny print but you can download a 132 page manual that is actually pretty well written.  The camera can easily change from a point and shoot mode to a sophisticated bridge digital camera with a twist of the selection dial. The way the vibration/movement dampening works especially at 1000 mm is awesome and the burst modes go from 3 to 11 frames per second.  All pre-programmed menus which are detailed, extensive and all very good require 3 clicks or less to activate any mode.  If you manual set your shooting conditions you can save those setting for later use.  You can shoot normal, fine, or raw images.  Video record for up to 25 minutes and you can change zoom and take individual shots while recording with it's intelligent auto focus system.  The camera starts up very quickly and responds and auto-focuses quickly as well. If you want a point and shoot look elsewhere and save a few bucks but for a serious sophisticated camera that rivals DSL's a half the price you can't go wrong.", "Date": "April 21, 2014"}, {"Title": "Great camera", "Author": "Camela Miller", "ReviewID": "R29LVZBZIRQJIE", "Overall": "5.0", "Content": "This camera exceeded my expectations.  I'm a DSLR user but wanted a bridge camera as something to leave in the car and for the range of the lens.  I've ended up using it 50% of the time!  It's great for when I find a beautiful duck on a pond, etc. - I can handhold the long lens because it's so much lighter than an equivalent lens on a DSLR.  Plus the camera seems to have a very good image stabilizer. I've also used the macro capability for very crisp, detailed shots.  And some of the built-in special effects are fun - the PoP color and the Dynamic Range produce some interested building shots. My only caution for potential buyers is that they understand that this is a heavy camera - heavier and a bit bulkier than my Canon Rebel.  But I don't really mind - in a way it helps to stabilize the camera when using the long lens because the weight is in the back end.  Very comfortable grip.  If you want a \"good\" camera, don't want to move up to a DSLR, don't want to be changing lenses all the time, this camera is well worth the price.  It is NOT a Point & Shoot - the menus are complicated and there is a learning curve, but if you understand the basics of photography, you'll quickly figure it out.", "Date": "April 16, 2014"}, {"Title": "My second cam.", "Author": "Juan A. Moreno", "ReviewID": "R2BSF7271TH83U", "Overall": "4.0", "Content": "Really, it's about my 5th, but I've only retained a Sony HX300, (my baby) and now, this HS50. The seller packaged this one adequately and the cam arrived before the scheduled date. So far, the many fine features of this camera have made me want to evaluate it with 5 stars, but I've one serious issue with the lens. The only way to zoom this cam is manually, by a ring on the lens itself. My beef is that I find the zooming somewhat rough rather than smooth, as if something were rubbing inside, or a lack of lubrication. My Sony (in comparison) which BTW, also provides manual zooming in the same way, feels very smooth as you turn the zoom ring. As previously mentioned, in all other aspects, this camera is truly a marvelous piece of engineering. The focusing speed now rivals some DSLR's because of the use of 2 methods (contrast & phase) which automatically switch when available light or lack of detail requires it. Too bad the sensor is so small; a larger one would give this cam better low-light performance.", "Date": "January 11, 2014"}, {"Title": "very fun camera", "Author": "Richard T.", "ReviewID": "R2PO29C2WMTPHP", "Overall": "5.0", "Content": "This a a fantastic camera for photoing butterflies and quick moving wildlife. Also not bad for video and landscapes. The photos seem great but haven't printed any as of yet. Yes it has a small sensor but gee this camera does a lot! Thanks Amazon", "Date": "January 10, 2014"}, {"Title": "This little bridge camera \"rocks\"!", "Author": "Bill Barber", "ReviewID": "R1LBWG36ISDDO2", "Overall": "5.0", "Content": "The Fujifilm FinePix HS50EXR is a new bridge super-zoom digital compact camera. Looking and handling like a DSLR, the Fujifilm HS50EXR boasts a 42x zoom lens which covers a 35mm equivalent focal range of 24-1000mm and features mechanical image stabilisation and twist-barrel manual zoom and focusing controls. Other highlights of the HS50 EXR include a 16 megapixel ½-inch EXR Back Side Illuminated CMOS sensor, a 3-inch vari-angle 920k-dot LCD monitor, 920k-dot electronic viewfinder with eye-sensor for automatic switching, and full 1080p HD movie recording at up to 60fps with stereo sound. The biggest difference over the previous HS30EXR model is the inclusion of Phase Detection pixels on the sensor to achieve an incredibly short autofocus lag of just 0.05 second in ideal conditions. In addition there’s an ISO range of 100-12800, High Speed movie capture at 480 fps, continuous shooting at 11fps, Focus Peak Highlight function, 500 shot battery life, a customisable Function button, full manual controls and support for the RAW file format.its external design the new Fujifilm FinePix HS50EXR looks almost identical to the HS30EXR model that it replaces.  At the heart of the HS50EXR is a new, incredible non-interchangeable 42x zoom lens, up from 30x on the HS30EXR, complete with manual zoom and focus rings, just like on a DSLR lens.New to the HS50EXR is the Q button. This calls up the very handy Quick View screen, a feature borrowed from the X-E1 and X-Pro1 mirrorless cameras, and also newly incorporated on the X100S and X20. This provides quick access to lots of frequently used shooting settings including the ISO speed, White Balance, File Size and File Quality, with the 4-way controller and command dial used to quickly change them. An unfortunate consequence of the new flip-out LCD screen is the removal of the handy vertical column of five small buttons on the HS30EXR, which have essentially been replaced by the Quick menu.", "Date": "November 4, 2013"}, {"Title": "Great camera, great price", "Author": "Don", "ReviewID": "R1RCSXVSQKNORK", "Overall": "5.0", "Content": "This camera has an excellent zoom works great for my son's football games.  I actually find myself turning back the zoom cause I just don't need it all.  I have also taken very good macro pictures of some bee's.  What I like the best is the picture's I have taken of the moon.  They look like they belong in a text book.  You have to play around with the camera a little bit but once you get it, it's a breeze.The battery life so far seems to be excellent.  Not sure how many pictures I have taken, but seems like a lot and still have not charged the battery since the first time.I don't know about pictures taken in low light I have not had a chance yet to test that out.I would definitely recommend this camera. I had an older fuji camera that a lot of the pictures came out blury but not with this one.", "Date": "September 25, 2013"}, {"Title": "Fujifilm FinePix HS50EXR Camera Review", "Author": "I. Curry", "ReviewID": "R36DZZNAF290C3", "Overall": "4.0", "Content": "I bought this camera for an upcoming trip to Italy.  I have been \"playing \" with it to understand its many many options.  It takes excellent pictures and am pleased with what its done so far.  Because I am a novice in photography, it is sometimes difficult to understand what the end result is on a setting.  For example, one setting changes the \"aperture\".  The instructions assume the end user actually knows what aperture is and what it does.  So it takes patience & perseverance to understand its capabilities, if you're a beginner,like me.  The good thing is when in doubt use the point & shoot option.  The 48x zoom is awesome. The purchase includes a \"mini\" manual, but the full manual is online. Wish they had included the full manual.  I am very pleased so far with the end results & am looking forward to using it in Italy.", "Date": "September 19, 2013"}, {"Title": "Incredible zoom range.", "Author": "lynnie", "ReviewID": "R3VLYNQ2E0B9OV", "Overall": "4.0", "Content": "Negative part of the process is the skimpy information regarding the initial setting of camera controls.  One must stumble through trial and error process to get controls right for maximum photography.  Once completed, best route is intelligent auto-easy where camera sets everything except picture size.  Images are pretty good but tend to go toward overexposure-a bit.  Manual controls and images are great.  Live view lets you see what picture will look like as you change shutter speed or aperture or iso rating and is great.  It is easy to use and produces good images.  Great close ups are easy and fun.  Colors are great--Lastly, write speed is slow even using class 10 cards but telephoto zoom is the reason I bought the camera and it works well for that purpose.", "Date": "September 5, 2013"}, {"Title": "BEST CAMERA FOR THE MONEY.", "Author": "PC Ron", "ReviewID": "RXGYGF38X49D6", "Overall": "5.0", "Content": "The camera fits all my needs of CLEAR pictures; CLEAR movies; and the MANUAL TELEPHOTO ZOOM LENS is just PERFECT.", "Date": "August 1, 2013"}, {"Title": "Fujifilm FinePix HS50EXR", "Author": "happyusa98001", "ReviewID": "R3PQT9Y7VOF2GH", "Overall": "4.0", "Content": "Fun, easy to use camera that is truly productive outdoor for sport, wildlife, street photography.A real good, affordable upgrade for point and shoot users.PLUS- Easy to control. Q-menu. Many hardware bottoms like a real DSLR.- Very light compared to DSLR. Fast start up.- Good colors.  Easy setup thru Q menu. Filters good.- Noise adjustment level for JPEG.- Great hand held stability.- Focus speed ok and real fast if using smaller file size.- Macro feature fun but not a mainstream feature: Being one inch or less from object create light issues.MINUS- The small sensor size is as expected the biggest trade-off.- Noisy jpeg if you chop image or use at low light.- Detail level is not what you expect of macro shots due to sensor size.RAW ARW files are about 20Mb. JPEG 4-5 Mb. I did not try to adjust RAW files for noise.Overall, a pleasure to use outdoor.", "Date": "March 17, 2013"}, {"Title": "I thought I had found the perfect camera.", "Author": "Mangochuy", "ReviewID": "RMOWQB0UQ796K", "Overall": "3.0", "Content": "Here's the short story on this camera. It should be a five-star camera. The photo quality is great. The speed is wonderful. The handling and ergonomics are fantastic. The twisting LCD and the viewfinder are sharp, large, and bright. The slow motion is really fun. Unfortunately, the thing that really separates this camera from the crowd, the manual twist zoom lens, is a near failure. I'm really scratching my head as to why what is perhaps the biggest selling point of this model is so poorly done. It is not even remotely smooth. It drags and takes so much oomph to turn that the camera moves in your gripped hand. When you get near the telephoto end you can actually hear (and feel) gears clicking. Again, in all other respects, this is easily a five-star camera in this price range. I'm stumped why such a big feature as the manual zoom is so bad. I kid you not when I write that if feels like plastic scraping plastic -- no bearings, no Teflon glide, no quality. That's really a shame, because it is significant enough of an annoyance that is makes the camera not worth keeping. Read other reviews about this problem and believe them. I wanted to like this camera, but the manual zoom feels as if the camera is defective. Others have commented that they've returned their units thinking it actually was defective, but the replacements performed the same way.", "Date": "June 1, 2014"}, {"Title": "Highly recommend for starting out in photography", "Author": "Josh Perez", "ReviewID": "R2C4D5I4HW5HG8", "Overall": "5.0", "Content": "I purchased this camera for my wife's birthday knowing she wanted to get into photography.  I didn't want to purchase an overly complex camera, but I wanted to have enough advanced features where she can learn and play with different settings.  After reading the many reviews on Amazon I pulled the trigger on the order.My wife couldn't be happier with the camera and it's really a well designed product.  I'm not a camera expert, but we've put it to a few tests already and have been very pleased with the results.This past week we had the lunar eclipse (Blood Moon) and I took several pictures around 2:00 am from my neighborhood and captured some stunning images with the camera zoomed and unzoomed.  Many of my friends who saw the images on Facebook thought I hired some expert to take the shots.We also took the camera out to the Ft. Worth Stockyards and took pictures in different light settings and also a couple videos.  The pictures came out great and my wife used Picasa and Paint.NET at home to adjust some of the lighting in the high res pictures.  The videos I took with the camera were nothing short of stunning quality.  I was very impressed as was my dad who saw the videos himself.  There was on small complaint I would have to make, but its really more of an observation than a complaint.The digital zoom does take a couple of seconds to adjust while taking videos.  It does the same during pictures but its naturally more evident when filming.  It's a very small nuisance and the video quality far surpasses the nuisance in my opinion.If you're looking for a starter camera and can't or would rather not splurge on the full blown DSLR's, I would pick this option.  I've read that many folks with DSLR's can take superior images but at the cost of lugging around a bunch of different lens and equipment.  This Fujifilm can take comparable images without the fuss of lugging around anything outside of maybe a carrying case for protection.I hope this review helps you make a decision.", "Date": "April 22, 2014"}, {"Title": "Good camer but not for beginner", "Author": "A. Kim", "ReviewID": "R6XZA8LR5AZNL", "Overall": "4.0", "Content": "Had this camera for couple of months.  Suffice to say if there is one reason to have this camera it is the zoom.  42x is no longer the biggest optical zoom but it is more than adequate in use.  Of course, greater zoom means that you will have to most likely have tripod ready to keep the camera steady.Another feature I like about this camera is the manual zoom.  In use I found manual zoom much easier to play and adjust compared to the motorized zoom one.Picture quality is not the greatest on auto setting.  You will have to play with photo software in your computer to bring out the best in the picture.", "Date": "April 14, 2014"}, {"Title": "Great camera", "Author": "Susan Bettis \"sbettis@easystreet.com\"", "ReviewID": "RY01UY4DHON8R", "Overall": "5.0", "Content": "I own a number of cameras including DSLRs and medium format film cameras.  I have been a photographer for a number of years and I have never had as much fun with a camera as I have with the HS50.  As a birder I get shots that I didn't believe possible greatly aiding me in bird identification.  At my grandson's football games I am able to zoom in on the action.  The camera is able to handle back lighting in amazing ways so that my target doesn't turn out a black blob against a bright sky.  It has raw capability for post processing.  They say your best camera is the one you have with you and this is the one I carry around most of the time.  I have never been disappointed.", "Date": "March 11, 2014"}, {"Title": "Works great but the manual focus is dodgy", "Author": "Ian G. Heller", "ReviewID": "R2FUH0AM9T2PHM", "Overall": "4.0", "Content": "I really like this camera. I know \"serious\" photographers criticize the quality of the optics, but for my needs, it's a terrific, all-in-one camera. I love having the wide angle and the very long zoom and this camera has a very nice feel in your hands. Several people have commented on my \"fancy\" or \"expensive\" camera, which is rather funny, considering I paid <$400 for it.Prior to this, I used a Canon SX40is and prior to that a Canon SX20is (I love super zooms). Compared to those cameras, the Fuji is much faster -- hardly any lag time between shots and a very useable \"burst mode\" and feels much better made. Plus, it looks like an actual DSLR, which is a minor benefit.This is not a small camera; in fact it is about the same size as my son's Canon T4i. I like the fact that it shoots RAW, but iPhoto doesn't currently support this particular Fuji format, so you're stuck with the weak software that Fuji ships with the camera. That will no doubt change in the future, but it's a hassle right now.In addition to the incredible lens flexibility, I bought the camera for the manual focus -- which doesn't work all that great. It's really for refining focus that the camera has already selected and I find it cumbersome and difficult to use. However, the camera has several other features that I really like -- including the \"EXR\" mode, which is a Fuji system that does a great job identifying the shooting situation and automatically setting the camera to capture the scene.Just for fun, I bought a couple of Helder screw-on lenses from B&H; Photo: a .45x wide angle and a 1.7x telephoto. They're pretty well made and when you remember that they are very simple (no zoom or focus built in), you understand that they're optically better than you might expect despite the low prices. Anyway, the telephoto lens turns the Fuji long lens into a telescope (more or less), with a 16MP sensor. I have had fun taking pics of the moon, for example, although I had to buy a long-lens brace because the Helder screw-on is really too heavy for the camera without some help (the wide angle doesn't require the brace).We use Canon 5D's at work, so I understand the difference between an inexpensive camera like the Fuji and a top-notch DSLR. I'm sure if I spent loads of time in Photoshop, the optical limitations of this camera would bother me. However, I don't edit photos very often and I think the pictures look amazing and I get lots of compliments on them, so I'm very happy with this product.", "Date": "March 10, 2014"}, {"Title": "I really wanted this camera", "Author": "Joe", "ReviewID": "RCVR2UVAJHQFC", "Overall": "5.0", "Content": "I researched mega zoom cameras for quite a while, and although a few may have been rated as slightly better in picture quality, I really wanted the manual zoom. I'm glad I chose this camera. I don't have a lot of photography experience, so experimenting and learning with this camera has really been fun. I love being able to shoot about any type of picture I want without the hassle of lugging around extra lenses.All the other cameras I tried in stores had power zooms, and with my big hands, proved somewhat of a challenge, and I kept going back to the manual zoom on the Fuji. For me, its just more comfortable and easier to get the results i wanted.So far, I love it.", "Date": "February 5, 2014"}, {"Title": "Easy to operate.", "Author": "Marty Springer", "ReviewID": "R2VL1TZV8WEZTC", "Overall": "5.0", "Content": "The zoom is fantastic and the image comes out sharp. I took over four hundred images the first day I tried it out and have some \"Money Shots\". Great bird pictures you can really get in close.", "Date": "January 17, 2014"}, {"Title": "Great Pro Camera Without The Expense", "Author": "J E P", "ReviewID": "R2J4PFFQ7VBLZQ", "Overall": "5.0", "Content": "This camera was purchased as a gift for a discerning semi pro photographer. She is very pleased and usually grabs the Fujifilm instead of her Cannon. She says it does everything she could ask for in performance, no need to carry different lenses, good battery life. Great camera.", "Date": "January 16, 2014"}, {"Title": "Fuji HS50EXR Camera", "Author": "Amazon Customer \"FOTOWAG\"", "ReviewID": "R2IZMYAAXG84DD", "Overall": "5.0", "Content": "I love this camera. I've been in the photo finishing industry for over 20 years and have been a Nicon F4-F5  SLR user. As a composite 16 mega pixel cmos camera this Fuji works great.  All of the necessary digital control are good and provide great pictures.  I purchased to use on my Panama Trip and took over 1700 pics. Zoom capability was unbelievable in providing images with great detail.", "Date": "December 14, 2013"}, {"Title": "PERFECT CAMERA for students and amateur photographers", "Author": "buying_for_the_win", "ReviewID": "RK7MB406V796E", "Overall": "5.0", "Content": "incredibly fast processing speeds, dynamic apature ranges, and even novelty settings like the \"toy camera\" emulator! the manual settings are fast and easy (unlike the HS20 i started out with). THIS CAMERA IS AWESOME!PROS:fantastic manual featurespin sharp imagesmanual focus has been greatly improvedCons:proprietary battery gives me an insecure feeling since i can't just swap out AA's like prior models.max exposure time is 30 seconds, not quite enough for night time/dark situation photographyprevious model remotes do not work on this one...", "Date": "November 15, 2013"}, {"Title": "No extras needed with this camera", "Author": "Amazon Customer", "ReviewID": "R2QJUB34K4PD07", "Overall": "5.0", "Content": "I moved from a system camera with five lens to this very nice camera that is so aptly equipped. Very well designed, very high quality", "Date": "October 7, 2013"}, {"Title": "Great bridge camera", "Author": "Frank P.", "ReviewID": "R1SM2Q075LR1L7", "Overall": "5.0", "Content": "This is a really great bridge camera. It does everything my K-30 does plus a little more. I can't wait to take it out and do some wild life photography. It has a wonderful zoom and takes beautiful photos. I can see that this may become my primary camera and my Pentax my back up. The only negative would be the fact that it doesn't come with a complete owners Manuel. You came get one on line but it is 140 pages of printing. That sucks.", "Date": "September 26, 2013"}, {"Title": "Love fujifilm fine pix HS50 EXR", "Author": "G. Fine \"GSF\"", "ReviewID": "R1GGBP92K548OV", "Overall": "5.0", "Content": "I wanted a camera that would come close to my Nikon 7100 but not be as heavy. I plan to take it when I travel . It has proved to be everything that I wanted.", "Date": "September 22, 2013"}, {"Title": "made a profesional photographer jealous", "Author": "brian", "ReviewID": "R25ZDKWYPDVP0X", "Overall": "5.0", "Content": "I recently was shooting at a car show and a profesional was asking me about the camera to see the pics i had taken.. then asked me to send some video and pics so his company could use them in case his didnt turn out as good.. so far they have used every one i have sent them..", "Date": "September 12, 2013"}, {"Title": "Wonderful camera !", "Author": "Lilly S.", "ReviewID": "R3N4QDN8VNIRY2", "Overall": "5.0", "Content": "I got this camera recommended from a friend, and I must say I absolutely love it ! This camera has it all, and for a good price as well.  Just the thing that the lens is not removable suits me perfect. And with a lens with 24-1000 range, you don't need an addition. You can also rotate the lcd-sreen, so when you don't use it, you can turn it to the cameraback, so it's protected. I love the function 360 panorama, and that you can take really slow movies which are very funny to watch. Only small minus is the on-off switch which could easily be turned on or off, but it's just a precaution when you're aware of it. Well, to make it short, just buy the camera - and I guess you will like it as much as I did :-)", "Date": "August 2, 2013"}, {"Title": "Best and most reasonable all-round camera for professional photographers", "Author": "bulldog3945", "ReviewID": "RDOVTI6V21BOK", "Overall": "5.0", "Content": "Old school professional photographers will find this camera will do virtually everything they need and are used to with some practice without dropping thousands.", "Date": "July 30, 2013"}, {"Title": "Current 1 month review of camera so far...started rocky, but much happier now thanks to Fuji Guys on YT", "Author": "David L", "ReviewID": "R24RGIOOG35ZPB", "Overall": "4.0", "Content": "To be completely honest, I have NOT put this bridge camera through all it's paces yet.  I bought this camera primarily to have a good snap-shot camera AND an even better digital video camera, for music concerts indoors and in low light settings.  So in that regard, it has not been completely put through the testing phase yet.  Also, I had a steep learning curve on this camera, but everyone NEEDS to bookmark the Fuji Guys on Youtube!! They have a 3 part series on ALL of the functions on this camera, and it completely changed my outlook on the usefulness of this camera!Here's what I can tell you right now, so you know what you're getting.PROS:- Not as heavy as people say it is...at least compared to my SLR camera days, it's downright light!- Extremely fast camera focus- Transitioning to film mode is quick, a lot quicker than with my old Panasonic TZM or my Sony Cybershot!- Hella-fast manual zoom...it's going to be a perfect camera for airshows and battle re-enactments!- External mic jack! Very very very few digital cameras have this.- Many many many options and modes to play with, more than I'll ever need, but nice to have- It DOES have a manual focus mode, usable for camera OR video!- Built in audio is fairly crisp and clear, somewhat directional to the front- Overall pic quality is best I've seen in non-DSLR cameras!- Unlike other point n' shoot cameras, the image coloration is very natural and true to what you see in real life...colors are not oversaturated or enhanced, which you often see with small digital cameras- Flip-out screen is hella-high quality, the best on any camera I've seen...and it works in reverse, so now I can see myself in my own vids/pics!- Built-in flash is very intuitive, adjusting for close vs. distant flash pics, but you CAN force-flash it!  And the results are very good, compared to other non-DSLR cameras.CONS (and please know, these are mostly just nitpicky points, but things everyone should know):- So far, I don't have a good idea of how much space is available on the screen when filming...I have to guess looking at the available number of picture space left- Video, especially in low lighting conditions, is a bit more grainy than I want to see.  My little Sony Cybershot somehow has better video image quality, but it has a lot more limitations that I cannot live with any more (no ext. mic input, very slow zoom speeds, not quick to engage in film mode, etc.)- The autofocus in video mode does exhibit that focus fluttering when it's trying to regain focus, as has been mentioned in other reviews.  This is very annoying if you want to film a how-to vid with close-up shots, where the movement constantly causes this to happen.  But again, compared to my prior cameras, it's a flaw I'm willing to live with.  Besides, manual focus can overcome this.- Viewfinder is digital, NOT optical as with a true DSLR...in fact, it's so distracting that I completely have no use for it.  Again, if you want that, get a DSLR- Video WILL pick up the noise from your lense zooming in or out, or if use use manual focus, twisting the ring to focus will be heard on your camera...that's unavoidable though, and shouldn't be a real surprise, but you should know this beforehand.- Manuals are...inadequate at best, and the full manual that's 80+ pages long is ONLY available as a .pdf on the CD that comes with the product.  It is good in detailing WHAT the functions are, but lousy in explaining WHY you might want to use certain modes.Again, I can't say this enough...the Fuji Guys on Youtube completely saved this review from being a 2-star/return-it order to this 4-star ranking...which I may move to 5-star after a few concerts.  There, now you're informed, yawl!!!", "Date": "March 10, 2014"}, {"Title": "Lot of camera for the money", "Author": "Jerome L. Crowder", "ReviewID": "R2X48G2DM93HAH", "Overall": "5.0", "Content": "Wife and I are old school SLR film folks with the killer cameras and lens..... I teach yearbook and news at my school and recently decided to research digital SLR cameras. We got a Nikon 3100 and a Fuji EXR. Yes, the Nikon does have a slightly better pix to the trained eye. However, the Fuji is an excellent picture taker, much more (though fixed) zoom, and way simpler to use. The Fuji will take shots on auto focus that baffles the Nikon (rainbows, precipitation shots...)Bought this camera for the wife. She loves it!If torn between the Fuji or others, ask yourself, \"How much do I really want to dedicate myself to learning camera geek speak?\" If the answer is \"Not much\", get the Fuji. It is an excellent Digital SLR. that is not much above a simple point and shoot.", "Date": "March 6, 2014"}, {"Title": "Worked well for me.", "Author": "Vermithrax", "ReviewID": "R2EA2YB40DSVX3", "Overall": "5.0", "Content": "First digital camera - I bought this specifically for the large zoom capability for use on a European tour.Pros:  performed as I had hoped, although I spent the tour with the camera in AUTO mode.  This allowed me to shoot while on the move, in and out of buildings.  There are a large number of available settings I did not fully explore that might have helped me with subjects in the foreground that were darker than the background (a person with the sky to their back, for example).  Good combination of zoom and low light capability, this allowed me to take pictures of frescoes and paintings found in historical buildings and churches where the lighting is subdued.  Picture storage.  This defaults to the add on memory card (not included) if one is present.  This is handy, since it means that all your pictures will be on the removable card to transfer to a computer for uploading, posting or editing.  Pictures are stored under the DCIM folder on the memory card, in a folder that stores each photo with a sequence number, and date and time.  The camera's stored file structure (FAT32) is compatible with Windows (serialized file number, date and time) and was readable by my smartphone so I could send a couple of shots by e-mail while on the road.Cons:  No GPS on this device, but this was not an issue for me.  One nit - if you silence the \"beeps\" the camera makes when powering on or pressing buttons, a side effect is that it also suppresses the flash.  This is observed by a crossed out icon on the display.  Settings to correct this noted below.Workarounds:  Took me a moment to search the Internet and discover how to get the flash operating again (to highlight the dark subjects in front of a light background).  You re-enable sounds, just turn the sound volume down so the camera operates quietly.  The full operator's manual is on the supplied CD and is also downloadable, but it is over 100 pages long.  Rather than haul a book around I kept the full copy on my smartphone and the abbreviated Basic Manual in my camera bag for the trip.Recommendations:  Removable memory cards.  Amazon will recommend buying an extra memory card, and will offer the SD series of cards.  I bought the smaller micro SD that came with an adapter to fit the SD slot in the camera.  This allowed me to use the removable card in both the camera and my smartphone while traveling (the smartphone only takes the smaller micro card).  Individual photos with this camera are about 5 MB a shot.  You may find yourself posting photos rather than e-mailing them (transfer to computer or", "Date": "October 3, 2013"}, {"Title": "An amazing camera that DSLR owners and first timers can both use.", "Author": "Tom B.", "ReviewID": "RM7A8X5ZN9TXJ", "Overall": "5.0", "Content": "I've been shooting with a SLR for years. First with a 35mm film SLR and then with a DSLR. I generally find point and shoots overly simple and can't match the ability of SLRs to capture great shots.The Fuji FinePix, however, does an amazing job in bridging the gap between a DSLR and a all in one.First, let me say this is a fairly large camera. It looks very much like an SLR and handles like one. For its size, though, it is very light. It is comfortable in the hand, and the build quality is very nice. The only part of the camera that feels a little flimsy is the battery door.The controls feel secure and well thought out. Perhaps for people used to digital zooms on smaller cameras, who may accidentally shut off the camera when intending to zoom, as the on and off switch is in a place common to zoom controls on lower end cameras.There is a large LCD screen for viewing your shot, and reviewing your images and movies. For SLR users like me, who perfer to use a eyepiece, you can use that by shutting off the LCD screen. The only drawback to that is, unlike a SLR where you are actually looking through the lens, the eyepiece is, instead a small camera so image quality through that option is a little less than I would have liked.The lens has focal lengths of 24 to 1,000. I need to have two lenses for my DSLR to match that, and this has it in an all enclosed package. For people not familiar with focal lengths that amounts to a 42X manual zoom. Manual zoom is important to take quality long distance shots as it doesn't diminish quality of the shot the way that digital zooms do. As a digital zoom is basically just a software thing that cuts and resizes the image as you zoom. There is an optional digital zoom, but I don't suggest that.The camera has a wealth of options that would make for an overly long review to go over here. I will say that there are options for the serious and expert photographer. You can choose manual mode; you choose aperture and shutter speed. There is a shutter priority where you choose the shutter speed and the camera chooses the aperture, and aperture priority where you choose the aperture and the camera compensates and chooses the shutter speed.There is also an purely automatic mode for quick point and shooting, as well as pre-programmed advanced modes as well as the EXR option which can pre-set options for tilt shift, low light, depth of perception, and on. You name it, between the EXR option and the Advanced presets, the camera can compensate for you.You can choose ISO speeds from 100-3200. You can also set it to automatically adjust the ISO with a maximum setting you prefer, so if you want a maximum ISO of 800, but want to also shoot outdoors without changing settings the camera will do that for you and perhaps change to 200 or 400 as needed.Picture quality is wonderful. The camera shoots and automatically focuses quickly.  Boot time for the camera is also on par with high end DSLRs. From the time you turn on the camera until you can shoot is very fast. No missing shots here.Video quality is very good, as long as you have a fast SD card. I would suggest a class 10 at lest. The camera has a mini HDMI output so you can view your images and movies on your television.To connect to your computer you unfortunately have to use their proprietary USB cord, which is included. It would have been nice to use standard MICRO USB.This is a great camera. Good for seasoned shooters, newbies, and everywhere in between. Well constructed, and easy to learn. I will probably be finding myself using this camera more and more, and using my CANON DSLR less and less.", "Date": "April 24, 2013"}, {"Title": "Prosumer camera with very high zoom", "Author": "Michael D", "ReviewID": "R2L3Z5U0GEE4I7", "Overall": "3.0", "Content": "I was interested in this camera as a middle-ground between my large, heavy pro camera (Canon 1D) and my pocket cameras (a Canon PowerShot ELPH 300 HS 12.1 MP Digital Camera (Black) and my iPhone). I was disappointed.GOOD~ Well suited for daylight photography, particularly if you want to zoom in frequently, don't want to switch lenses, and don't need a very high quality zoom. Its  huge zoom range is equivalent to a 24-1000mm zoom on a 35mm camera.~ Full HD recording.  Quality videos. You can take high-res photos in the middle of video recording.~ External mic jack, plus built-in stereo mics.~ Optical image stabilization gives wide-angle videos an appealing steadicam feel, and substantially improves handheld zoom shots.~ Main viewfinder is sharp and clear. However, the digital eye viewfinder has poor resolution and color fidelity.~ In low light, it takes several photos in succession and then averages the frames -- this nicely reduces the noise.~ Boot-up time, and responsiveness are all acceptably fast.~ Manual focus ring.BAD~ This is not professional camera by a long shot. It feels flimsy, the low-light photographs are noisy, zoomed image quality is fuzzy, and the user interface is awkward.~ Real-time view finder does not use the same exposure settings as your photos, so the color balance, grain, ISO, etc., can be different in the actual photo you take.~ Manual settings are inefficient to change.~ Parorama mode is hard to use. My iPhone makes better panoramas.~ The advertised macro settings are misleading. The closest object you can zoom to fit the frame is approximately 1-2 thumbnails in size.~ Despite claiming \"unmatched\" auto-focus speed \"as fast as 0.05 seconds,\" with indoor or late afternoon light, autofocus can take 2-3 seconds -- if it works at all.~ Slow-motion effect is cool, but at 120 pixels wide, the resolution is pathetic and in my testing, the scene flickered.~ Has 2.5mm mic jack instead of the normal 3.5mm size.~ Turning record mode on and off is awkward because of the position of the record button", "Date": "April 22, 2013"}, {"Title": "Probably The Best Bridge Camera", "Author": "Kalaab M. Pickering", "ReviewID": "R229WRZ3U3FMHH", "Overall": "4.0", "Content": "Bridge cameras are a quirky lot: they're essentially a point-and-shoot camera with DSLR-like features.  For the HS50EXR, the phrase \"DSLR-like\" sums it up almost entirely.There are many reviews on Amazon and elsewhere that touch on the HS50's main features, so I won't go into those beyond saying that the manual zoom is great and the image quality (which has been spoken poorly about in some cases) is actually quite good.  This review is intended to hit on features that might not get immediate consideration when you're looking for a bridge camera.I purchased the HS50EXR as a backup to my DSLR, something that would be easy to carry and that my wife (who is not a photographer) could use and get good results.  Also, I needed something with strong video capabilities that would auto-focus well.  This camera delivers in spades.  It's fantastic, full-featured, and easy for my wife to use but with enough control to give experienced photographers plenty to play with.A few points that don't get much press about this camera:Focus Ring: This camera features manual focus via a free-spinning focus ring behind the zoom ring.  The focus control is strictly electronic, but the focus ring has a quick, responsive, and organic feel to it.  Obviously, for video work you'd want to be able to exert a bit more control over focus, but overall it's impressive.  In photo mode, there are focus highlights that appear on whatever the lens is focused on, a useful feature that the Magic Lantern crowd will recognize and appreciate.  Sadly, that same crowd will be sorely disappointed to find out this feature is not present in video mode.  Video mode will allow manual focus, of course, but without the handy focus peak highlights.Bayonet/58mm Lens: This camera includes a bayonet-style tulip lens hood (which was impressive to me), and also accepts 58mm lens accessories.  That was my big gripe about other bridge cameras; there was no way to provide the glass with any protection.  The HS50EXR lets you put a UV filter on the front, which is especially crucial considering you don't have the luxury of replacing a lens if it gets dinged up.Video Quality:  One of the best things about this camera is its video quality.  It is sharp, responsive, quick to focus, maintains focus easily, and there are a number of high-fps options for slow-motion video.  Of course, the faster the shutter goes, the lower your resolution gets, but if you're looking to capture something cool at a high frame rate, this will definitely do it.  One disappointment for video mode is that you are not allocated any control over exposure, so no aperture, shutter speed, etc that you would get on a DSLR.Articulated Screen:  This is great for videographers like myself who need to frame a shot while being in front of the lens.  Very handy.Q Button:  This is a great feature for the camera to have.  In true DSLR fashion, you have a dedicated screen to adjust ISO, white balance, shutter speed, aperture, etc.  Fantastic, easy to use, and handy.Now, there are a few things that I would have changed on this camera that keep it from getting a full 5 stars:Plastic Tripod Socket:  This camera is big and heavy, like a small DSLR.  The tripod socket is a heavy-duty hard plastic, but I would have much rather had something metal.Lack of Control in Video Mode:  I like that you can use manual focus in video mode, but other than that you get what the camera gives you, which is not exactly what I want.  Still, the video mode is great on its own.Sensor Size:  This is the biggest difference between the HS50EXR and a true DSLR.  Even an entry level DSLR will dwarf the 1/2\" sensor that this camera sports.  The HS50EXR's sensor is the most tangible throwback to its point-and-shoot roots, but don't write it off immediately.  While you'll never fool anyone into thinking your shots came from a DSLR, you'll be sure to get some excellent looking shots.  Even some camcorders at this price level have smaller sensors than this, so it's not as bad as people say it is.  In fact, I think considering its size, the images look amazing, but I would have liked to see Fuji use a bigger sensor to live up to the DSLR features and aesthetics.If you're looking for a good family camera that's a jack-of-all-trades that yields great results, this is what you're after.  If you're on the fence about this camera and a full-fledged DSLR, go with the DSLR.  I was glad I purchased a DSLR before purchasing this camera because it gave me a much better sense about what the HS50EXR can and can't do.  Once you understand its limitations and capabilities, you can really start making great images with this camera.  I definitely recommend it.", "Date": "June 4, 2014"}, {"Title": "Just what I wanted", "Author": "Shala Kerrigan", "ReviewID": "RW7MXTR74S8GK", "Overall": "5.0", "Content": "I've been using bridge superzoom cameras for years for taking photos of crafts, food and plants for my blog as well as taking pictures of birds and wildlife in the Anchorage area. I am not a photography expert, I just want to be able to take the best pictures possible using the automatic settings.My very first bridge camera was a Fujifilm camera and I loved it. My next ones were Kodak, Sony and Kodak. They all had their good points and bad points. For motion photos- I loved the Kodaks, and they also did well with night time shots of the Aurora Borealis. They weren't as good with macro shots of plants, and iffy with food because of the color saturation. The Sony didn't saturate colors as much on the close up shots, allowing a truer photograph for close ups. Distance shots with the superzoom lacked crispness and had almost a painterly effect, it looked nice, but it wasn't what I wanted. So for my birthday this year, I asked for, and got this camera.Back to Fujifilm- the obvious drawback to it compared to other superzoom bridge cameras is size. It's bigger and heavier than other cameras with comparable pixel sizes and zoom. But what it does is take pictures extremely well on both ends of the spectrum. My macro shots are crisp, clean, and using the EXR function, focused perfectly. Going birding with the camera, I was able to get that photo crispness and again- using EXR- the background was blurred gorgeously with the in focus bird being very clear and prominent. This camera makes me look a lot better at taking pictures than I actually am. The color saturation is really good too. The manual zoom is easy and precise compared to button and toggle zooms on other cameras. The view finder is one of the only ones I've been comfortable using. Usually I prefer the LCD screen, with this camera, I like and use both depending on subject.When I do put it on manual settings- like for a picture of the moon- I can save my settings, which is very helpful. It means that in the fall when I figure out the best settings for aurora photos, I can reload them easily.I still have that first Fujifilm camera- the only reason I stopped using it was because of the image sizes. I like working with larger images. I plan to give that one to my son. This is my new favorite camera ever.My husband prefers the Kodak because mostly he's doing bird photos and the saturated colors and quick focusing on the motion settings works well for him and he's very comfortable with it. It's a smaller camera, so it's easier for him to carry around with him regularly too.", "Date": "May 20, 2014"}, {"Title": "As great as the reviews had said", "Author": "ELG", "ReviewID": "R1FZ73HJ5ON592", "Overall": "5.0", "Content": "There are a few of the top rated super zooms and it's confusing as to which to choose. When you get it down to the top few, go and touch/feel the camera. This just felt right in my hand and has not disappointed.", "Date": "May 11, 2014"}, {"Title": "Seems like mid DSLR quality without hassle", "Author": "Joanne Reid", "ReviewID": "R3GAG3MM50DN2Y", "Overall": "5.0", "Content": "I studied and researched this camera for many months, had a Fuji film camera years ago and loved it.  Too many choices now for digital cameras but I wanted one that was above lightweight and simple, somewhere in the upper middle range.  The HS50EXR is heavier than most as other reviews stated, but it certainly doesn't bother me, gives it a solid professional feel.  So far I find no issues I dislike.  I'm getting used to the manual zoom and after some practice I don't have a problem with it.  I use the camera for my business taking shots for Facebook and printed advertising.  Now that Spring is here I'll be doing a lot more experimenting with outdoor and action shots.  Seems to have unlimited features so of course takes practice.  So far so good.", "Date": "April 30, 2014"}, {"Title": "Great camera", "Author": "kwc", "ReviewID": "RQ32MKLU1VDSM", "Overall": "5.0", "Content": "One of Fuji's best high end fixed lens consumer cameras. Was received quickly. The image stabilization in the lens works great.", "Date": "March 7, 2014"}, {"Title": "Fujifilm Finepix HS50", "Author": "Jill Kenyon \"JPK\"", "ReviewID": "R1JZN1GWXTT1Z3", "Overall": "5.0", "Content": "I received this camera in the height of the winter storms in New England, so I didn't get out as much as I wanted.  When I finally did, however, this camera truly won me over.  I don't shoot raw, but the .jpg files are clean, the EXR mode is amazing.  It's a bit bigger than I had imagined, not having had the opportunity to handle it before ordering, but still worth the extra ounce or two.  The zoom is crystal clear even at full length.  As a fairly serious bridge camera, I would have a hard time finding something better (and I spent a lot of time comparing).", "Date": "February 25, 2014"}, {"Title": "Big and Bad", "Author": "David R. Glover \"LD\"", "ReviewID": "R3APT00EU794RD", "Overall": "5.0", "Content": "I am a big guy and this is a big camera. It looks awesome. The Auto Mode is simple and so far great shots. Plus it has all kinds of manual settings. Snaps photos fast. Also very god looking video so far. Happy with purchase.", "Date": "January 3, 2014"}, {"Title": "My best camera ever.", "Author": "Duane Muizelaar", "ReviewID": "R3OOO5OF1I40HE", "Overall": "5.0", "Content": "I came from an other Fuji that I had damaged. Sorry I lost the last one but this one surpasses it. And thee zoom is especially great. You need to steady it but a mono pod is enough.", "Date": "January 3, 2014"}, {"Title": "Great Camera", "Author": "Virginia Leonard", "ReviewID": "R340ASUEQVPX84", "Overall": "5.0", "Content": "The pictures are beautiful.  I'm still learning all of the settings and tricks but so far am very pleased with the product.  It feels sturdy in my hand and well made.  The controls are in easily accessable places for my fingers so that I don't have to stop and look to see what I'm changing.All in all, I'm very pleased.", "Date": "January 3, 2014"}, {"Title": "Great camera, DSLR type without the extra lenses", "Author": "Deborah Strandberg", "ReviewID": "R13JZKIRPQTBQU", "Overall": "5.0", "Content": "If you are looking for a DSLR type camera, but don't want the hassle of all those lenses. this is your camera.  This camera has so many bells and whistles. First you get a great zoom feature, you get various focus features, many shooting modes, as well as the ability to shoot excellent video. This camera has so many features I'm still learning everything about it. I keep the owners manual handy on my desktop/laptop computers just for reference.  Just when you think you know all the features you find a new one. Wow! All this a and great price. What more can you ask?  This camera was recommended by a professional that knew I did not have the ability to hold a heavy DSLR camera due to hand and shoulder problems. This camera is light enough that I can hold it and shoot the photos I need without any problems. The quality is beyond excellent.  Yes, I can not say enough good about this camera. I have been converted from Canon/Panasonic to Fujifilm.  I very highly recommend this camera.", "Date": "December 20, 2013"}, {"Title": "Lot Fuji superzoom cameras.  My 4th one I think.", "Author": "Lion Michael \"Dreamtoys\"", "ReviewID": "RNQGXT8SX059W", "Overall": "4.0", "Content": "This is my 5 fujifilem camera and may be the 4th Superzoom.  Lover the manual zoom over electronic ones.  But hate the fold our screen.  Why?  Missed the left hand side buttons.", "Date": "November 28, 2013"}, {"Title": "Fujifilm FinePix HS50EXR 16MP Digital Camera with 3-Inch LCD (Black)  GREAT CAMERA", "Author": "andres", "ReviewID": "R3I4NP0YECSXCE", "Overall": "5.0", "Content": "THIS IS A GREAT CAMERA LOVE THE ZOOM GREAT PICTURES AND VERY EASY TO USE AND FULL HD VIDEOS ARE GREAT WOULD RECOMEND", "Date": "November 24, 2013"}, {"Title": "Very easy to learn", "Author": "bmd lover", "ReviewID": "R2GNSQ2102HOY1", "Overall": "5.0", "Content": "This camera is amazingly intuitative.  It makes learning what it can do very easy.  I hate big books of instructions to pack around. It replaces a larger Canon I bought a couple years ago, but could not afford the lenses to make it do what I want.  This one meets all those needs and is much less bulky.  Very pleased.", "Date": "November 20, 2013"}, {"Title": "great", "Author": "izzy4145", "ReviewID": "R136LURUWP01B7", "Overall": "5.0", "Content": "I LOVE this camera. Reached in 4 days with free shipping.best camera i have ever owned. If you want a DSLR, then buy a DSLR...if you want a great point and shoot this is it", "Date": "November 18, 2013"}, {"Title": "Very nice camera.", "Author": "Bill Diller", "ReviewID": "R1TWPS3O4LLCAG", "Overall": "4.0", "Content": "Overall, I like this camera. I've had previous Fuji HS cameras, and this is the best by far. The only reason I didn't give it 5 stars is because I haven't had a chance to use all the features yet. It does a very good job up to 400 ISO, and I've even gotten a few keepers at 800 ISO. The range of the lens is great - I got a keeper of a red-tail hawk the first time I took it out. For anyone looking for a long-zoom camera, I'd recommend the Fuji HS50.", "Date": "November 5, 2013"}, {"Title": "Love the features", "Author": "B. Jones", "ReviewID": "R1QVVMNKY9F1WT", "Overall": "5.0", "Content": "I chose this camera because it really covers all of the bases for me. Not being a pro, I needed something that was a big step up from a camera phone and this has all I need: wide optical range, fast shooting settings, manual focus, macro capabilities, HD video with slow motion capture and external audio source, ability to use add on filters, a hot shoe, and remote shutter controls. I figure I will be able to handle nearly any photo or video project I need all in one camera. It may not be the best in IQ compared to a DSLR, but that is the compromise I'm happy to make for the economy and convenience. What really sold it for me was the zoom and manual focus on the lens. For my needs it was the overall best balanced camera, all things considered.", "Date": "October 28, 2013"}, {"Title": "Excellent Superzoom camera", "Author": "Timothy Smith", "ReviewID": "R2YVMF2O0JX9ZG", "Overall": "5.0", "Content": "As this being my step up from my pocket camera, all I can say is that this camera is amazing.  It does everything I need it to do.  Take pictures of my kids at races, not a problem.  Zoom into Mt. Baker from an adjecent peak and get a clear shot of a cravass, not a problem.  A 360 shot, not a problem.  This camera is more fun than my phone and is easy to port around.  Add that with the two extra batteries and a four day trip in the backcountry adds up to hundreds of amazing pictures.", "Date": "October 2, 2013"}, {"Title": "love this camera", "Author": "happydad", "ReviewID": "R3DJCJA3X86MMM", "Overall": "5.0", "Content": "This was the second fujifilm camera that I have purchased and I am extremely happy with my choice. This camera takes amazing pictures and is extremely easy to use.", "Date": "September 3, 2013"}, {"Title": "Shutterbug", "Author": "Jeanie Hunt", "ReviewID": "RNNTM7JTCP9SN", "Overall": "5.0", "Content": "WOW! This camera is awesome! All my photos are great! I've gotten so much business since switching to this camera. I like it better than a Canon or Nikon. The quality of photos is amazing! The options are wonderful. I love the fact that the lens is built in and you don't miss those \"quick\" shots by having to \"change\" out lenses.", "Date": "August 30, 2013"}, {"Title": "Amazing and unbelievable camera for its price.", "Author": "Faiez Syala", "ReviewID": "RPUB6H6A7INY", "Overall": "5.0", "Content": "I've had a 3 years of experience with the older version ( Finepix HS10 ) and it took me about a couple of months to make professional shots with it, but with the HS50EXR, it's unbelievable, from the first 2 days I was able to get a clear and clean shot for the moon, also tried some macro shots, the new EXR CMOS is excellent.I can't say anything else but to recommend this Camera to any  one who wants to have a perfect camera for a good price.", "Date": "August 27, 2013"}, {"Title": "I thnk this will be a great camera for me", "Author": "B. Lewis \"scififan\"", "ReviewID": "R13DIY4B9U6UQA", "Overall": "5.0", "Content": "I wanted a camera that didn't suffer from shutter lag so I could actually get the pictures of my Granddaughter before she moves. So far I have been very impressed w/the Fuji HS50exr. Probabaly has more settings than I will ever use, but the EXR setting seems to do a great job of figuring out what I am trying to get a picture of and gettin me the picture I want w/o alot of hassle. Looking forward to using it when we go to Europe next month.", "Date": "August 23, 2013"}, {"Title": "Easy to use", "Author": "JOSE E. MELENDEZ", "ReviewID": "R18NIXZQOD4VDX", "Overall": "5.0", "Content": "I was between a DSR or a point and shoot camera. I like Fujifilm cameras for a long time but I thought I was due for an upgrade. I decided to buy this camera because of the zoom, however we were in shock how beautiful and the details from the photos. I bought for the family trip to Europe and the part I enjoy the most was that when people had to stop to change lenses I took multiple pictures and they lost the moment.", "Date": "August 21, 2013"}, {"Title": "Excellent Camera", "Author": "jderrico", "ReviewID": "R1C57AUR570I1W", "Overall": "5.0", "Content": "I am very pleased with this camera.  I have been taking photographs of birds and landscapes, and the results are nice and sharp when printed on 8.5\" X 11\" photo paper.  The camera is easy to operate, and all the controls and menus are easy to navigate and understand.  I like the feel and balance of this camera in my hands, and I like having a zoom lens which I manually rotate to zoom in and out, rather than using a button or switch to electronically zoom in and out.  Both the electronic viewfinder and large LCD screen show crystal clear views.  I take photographs while handholding the camera, and I also use a heavy beanbag and a tripod.  I also have a Panasonic FZ200 camera and a Nikon D700 DSLR.  I've been using this camera for more than a month and I have no complaint at all.", "Date": "August 20, 2013"}, {"Title": "Awesome camera", "Author": "Glenn Wong", "ReviewID": "R3SRZYMOLNLYVD", "Overall": "5.0", "Content": "This is a fantastic camera. I own various Nikon and Canon SLR digicams, and this FujiFilm bridge camera is as good as some of the basic ones from Nikon and Camera, especially without the need to change lenses (hence no issue of dirty sensor and pentamirror screen.The seller is also very prompt and fast in the delivery. Overall very good experience.", "Date": "August 5, 2013"}, {"Title": "Works better than I expected", "Author": "Donald W. Cooper", "ReviewID": "R39VQWCPPXP0GR", "Overall": "5.0", "Content": "Must read the instructions completely through as I did, and then with a little practice, it all makes sense.  Takes very good pictures in my opinion and the automatic EXR setting seems to perform exceptionally well.  I am very pleased with the purchase and glad my hunt for an affordable, excellent camera is over.", "Date": "July 20, 2013"}, {"Title": "Nice Alternative to a SLR. Noise starts to take over at 1600 ISO", "Author": "M.L.", "ReviewID": "R1T7X342BGOBE8", "Overall": "4.0", "Content": "Brief BackgroundPhotography is a hobby for me; however, taking  great photos is important to me. Having the right gear is a must for creating great photosI have had various cameras over the years.  My last 4 have all been Digital SLRs.  My current camera is Canon 5D MKIII.The Fuji HS50 sits between a standard point and shoot and a digital SLR. The camera has an equivalent 24-1000mm zoom(42x) and includes image stabilization. The 16MP Sensor.  The sensor is 1/2 size, allows Fuji to reach the  long range of the lens. The f stop range is 2.8 to 5.6. The camera has a built-in flash.  The camera can do 11fps when shooting in jpeg mode. There is a microphone socket so you can add an external mic for video.I have used the camera for a month so my review is based on my initial impressions.  As I have more usage, I will update by review from time to time.Indoors:The first thing I noticed with my first couple of shots indoors was how fast the camera focused and the speed of the shutter.  I was shooting at 24mm and 800ISO with no flash during the mid afternoon. The quality of the photo were good. The noise on the images was not overwhelming, which will allow for larger prints.  Once I started using the longer range on the lens the photos started to getting to soft. The colors were no longer popping. Still acceptable for 8x10 prints.  When using the flash indoors I had to dial it down a little because they pictures were a little blown out. The flash did restore some quality to photo. The camera is above average indoors as long as you have enough light.  I did test the camera at 1000X indoors and there was some bokeh within the pictures. Not a large amount but that is expected at 5.6. At 1600 iso there is too much noise on the photos, you will need to cleanup the photo if you plan to use 1600 unless noise does not bother you.Outdoors:Being able to lower the ISO really helps the camera excel.  I was impressed by the  zoom.  While does take a little longer to focus at 1000mm, I was amazed by going from wide to zoomed.  The photos do suffer at the 1000mm but there are usable to print.  I will post some samples of wide to zoom.  As I have already mentioned the camera is fast so you will be able to capture the kids running around without motion blur.  I also used the camera to take macro photo of flowers and a lizard that happen to walk by.  The photos turned out well but you get much better images with the SLR and Macro Lens.Other features I have not tried yet is the panoramic mode and taking video. You can do a 360 panoramic.  I will update my review once I had the opportunity to try the features.I would definitely recommend this camera to friends and family.", "Date": "May 10, 2013"}, {"Title": "Great Camera", "Author": "L. Berk \"Leah Lionheart\"", "ReviewID": "R233RT5DFWWDFT", "Overall": "5.0", "Content": "First, I'm not a photography person. I've had to learn my way around a digital camera with this device, and have found the learning curve to be manageable and not overwhelming in the least. This is a great intermediary camera between a standard point and shoot and an SLR; it's an excellent beginner's camera, I think, and has taught me a lot about different elements of digital photography. Many of the other reviews here espouse the technical details, but I've only learned based on - well - practicing.The camera autofocuses quickly, and is able to snap pictures in rapid succession - even in low light. The zoom feature maintains the photos' crisp quality, and doesn't distort.It takes excellent photos, with the option of saving them as RAW and/or compressed files. Transfer is done via USB cable, and goes pretty rapidly. I haven't tooled around with anything I've taken yet in any high power editing software, but have been told the JPG files can have some noise to them.The external LCD screen, able to be twisted around and viewed from all angles - is a nice touch, and useful for flipping through pictures you've already taken. It's also made strong enough so it doesn't feel like it's going to snap off or break at a moment's notice.Another useful tool is the use as a video camera: it can take HD videos, and includes an HDMI port. I haven't used this feature extensively yet, but it's a handy inclusion and can work well in a pinch.Physically, the camera is sturdy and doesn't feel cheap or like it'll easily break. It includes a neckstrap and tether for the lenscap, which are both super handy to have around.", "Date": "June 13, 2013"}, {"Title": "Good compromise between the P&S; and the Digital SLR", "Author": "JB", "ReviewID": "RT6D2BP5NHI6Q", "Overall": "5.0", "Content": "All digital cameras are forced to make compromises based on the target market and the competition.  The perfect digital camera would be small, light, have exemplary image quality, take great pictures of fast action or low light scenes, and have a zoom from extreme wide angle to extreme telephoto.  In reality of course, you get to pick a few of these items and the rest of the parameters are chosen for you.  For instance, the best image quality and low light performance are found in full frame (or larger) DSLRs - but these DSLRs are typically large and heavy.  Small P&S; cameras are pocketable and convenient, but typically offer minimum zoom range and mediocre quality.I state the above because I have found the Fujifilm FinePix HS50EXR to be a great mid-point between the P&S; and the DSLR, and the compromises made here make a lot of sense:- The zoom range of 42x (effective 24mm to 1000mm) is amazing; I'd say that up to 500mm is totally usable handheld, while extreme zooms approaching 1000mm may require a tripod, monopod, or other means of support.  Image Stabilization allows those longer focal lengths to be used without the shots being ruined by camera shake.- The 1/2 inch sensor is quite small compared to that of a full frame or APS-C DSLR.  As a result low light performance of the HS50 is not as good as that of my Canon EOS 7D 18 MP CMOS Digital SLR Camera with 3-Inch LCD.  But the sensor is larger than the 1/2.3\" sensor found in other mega-zoom cameras, meaning better low light performance than other cameras in its class.- The included f/2.8 - 5.6 zoom lens is also very bright considering the extended zoom range.  This allows for faster shutter speeds and better IQ when shooting at the longer end of the zoom range.- There are tons of \"pro\" features on this bridge camera - aperture priority, shutter priority, full manual, manual zoom (which I personally prefer to a motorized zoom), one shot or continuous autofocus, manual focus, selectable ISO, RAW format and/or JPEG, etc.- Fuji's \"EXO\" mode is capable of salvaging decent shots out of horrid conditions (bad lighting, etc).My main concern is about the sensor and resulting picture quality - with a sensor 1/10 the area of the one in the Canon 7D you are going to see a bit lower IQ when you closely look at the images, esp. if the pictures were taken in poor lighting.  That said, the picture quality is surprisingly good, and you might never notice the difference if looking at web size photos or 4 x 6 prints of pictures taken in good lighting.A second thing I've recently noticed is that it is more difficult to shoot fast moving objects with the electronic viewfinder on the Fuji that with the optical viewfinder on a DSLR.  So for sports or birds in flight I'm more inclined to being the 7D along, even if it is larger and heavier.Another minor issue I have is with the included manual - it needs to be a bit more detailed.  For instance, it mentions there is a focus select dial on the side of the camera, but does not explain what the settings are!  You should not need to reference the included CD or go online to get info on basic camera functions like this.In sum, I am impressed with the Fuji HS50.  It can't replace a small P&S; for convenience, and it can't replace a full size digital SLR for ultimate IQ.  But it does very well as a relatively light camera with an amazing zoom range that is capable of taking very good pictures.", "Date": "April 25, 2013"}, {"Title": "The Best Camera!", "Author": "Sheri Fogarty", "ReviewID": "RWN2ZDS94PGJP", "Overall": "5.0", "Content": "I am not a professional photographer, but I am our family photographer and have been taking pictures for many years. I even studied photography and did some darkroom work in high school and college.The two camera I've been using, before the HS50EXR, is a digital Canon - Powershot A720 IS with 8.0 mega pixels and a 6x optical zoom and a Canon DSLR - Rebel T3 which I have two lenses for, the standard 18-55mm and a telephoto 55-250mm. I've been using both of them a lot lately as I've been documenting a garden project and taking a lot of wildlife photos. I have to say, the FujiFilm is amazing in comparison and will enable me to do everything I need to do with this one camera, much easier then before.This is considered a bridge camera - somewhere between a digital and an SLR, but I have to say I like it MUCH better then my Canon Rebel T3 - as a family photographer I've found it daunting to figure out some of the settings on my DSLR and with the FujiFilm, it does it for me. I love the EXR mode and how the camera selects the best setting for your pictures, it's good for those of us who just want to be able to take really nice pictures.A problem I've had recently with my SLR camera has been needing to constantly switch between my regular and telephoto lenses.  This camera has an amazing 1000mm zoom. It takes pictures very quickly and the manual zoom is easy to use and has worked great. I have taken pictures of everything from landscape to close up with just a twist of the lens. You just zoom, half click to focus and get a great picture. The colors are sharper then both of my Canon cameras as well and the auto focus has worked perfectly, and takes just 0.05 seconds - it's fast and clear.You can also take excellent quality 1080 HD video with full stereo. You can use the camera in manual mode, if you want to do your own settings  and there are some great advanced options for filter effects (things like miniature, pop color and soft focus) and 'scene position' option for over a dozen different conditions like, portrait, landscape, sports, night, sunset and more.I have to say I adore this camera and it looks like my other cameras are going to be gathering dust from now on. I give the FujiFilm FinePix HS50EXR my highest recommended!", "Date": "April 24, 2013"}, {"Title": "Awesome Semi-SLR Camera", "Author": "Arjun", "ReviewID": "R1FQ45NSMHXOP4", "Overall": "5.0", "Content": "Exceptional crisp photos .. a little bulky compared to other brands .. but I have no regrets buying it and would recommend this to others. I previously owned the HS30 EXR which as awesome - I sold that and purchased this one. Felt like the added zoom will help.I have had this for 1 month now .. will update after using it further.", "Date": "June 18, 2013"}, {"Title": "Fantastic for the price. SImple review..", "Author": "Rick", "ReviewID": "R1OVJEXH769WOJ", "Overall": "5.0", "Content": "Wide angle is great. Picture quality is superb. Macro is stunning.Only con is manual zoom is not as smooth as I would like, but I can live with that, for the quality, technology and price point of this camera.I would recommend this camera to any avid photo enthusiast who wants all the latest technology without the expense of thousands on extra lenses. This has a 24mm wide angle and zooms to 1000 mm (optical). Fuji film has been putting out awesome cameras for years. This is my 3rd. I also owned (until recently) a Leica v-lux 1 which I was never quite happy with.In my opinion, this fuji camera is better. I highly recommend. Important to note, this is a bridge camera, (in between a point and shoot and a profesional model, weighs MUCH less and costs less than 1/3rd of what a heavy professional model would. Great for travel.", "Date": "May 30, 2013"}, {"Title": "Great Camera", "Author": "P. Schultz", "ReviewID": "R3JU9X5WRKNHG0", "Overall": "5.0", "Content": "This is my 4th Fujifilm camera.  This camera is the best out of all.  The only thing is I wish it would focus quicker.  I've notices some pictures are blurry because I was in a hurry to catch the moment and it came out a littled blurred.  Other than that I would recommend this camera to anyone.  It is very easy to use & I like the fact that you can zoom manually.", "Date": "March 2, 2014"}, {"Title": "FANTASTIC", "Author": "Ryu Jin", "ReviewID": "R20D34CG1V5T4C", "Overall": "5.0", "Content": "Living in Japan has its drawbacks when it comes to mail, so I did not receive the camera in the specified 10-14 days.  Almost 2-weeks later when the camera arrive everything worked perfectly right out of the box. I have put the camera through its paces from stage performance with my grand-children in poor light, to track-and-field meets on the sunniest-of-days.  I'm very happy.", "Date": "February 28, 2014"}, {"Title": "Great Camera", "Author": "Brad Heuer", "ReviewID": "R1K0WSNJQ3K9P4", "Overall": "5.0", "Content": "Great camera, great zoom, and quality.It's no SLR but it is close to the untrained eye.We bring it with us everywhere now.", "Date": "October 16, 2013"}, {"Title": "Wonderful camera that will exceed the expectations of most photographers.", "Author": "Lauren", "ReviewID": "R2BAKJ7HZUT4AZ", "Overall": "5.0", "Content": "Awesome camera, keep in mind this is not a DSLR but unless you are  professional photographer this camera will more than deliver on everything you could want it to do. The battery life if fantastic and the image quality is as good as you are going to get out ov anything that is not a DSLR.  If this camera was ever produced with a DSLR image sensor it would be without a doubt one of the best cameras money could buy in terms of value, functionality and practicality.", "Date": "September 19, 2013"}, {"Title": "Excellent camera", "Author": "Earle F. Stone \"Photo bug\"", "ReviewID": "R2QBN4E41ESJ8A", "Overall": "5.0", "Content": "This camera is loaded with technology and special features. There is a slight learning curve to become aware of it's many features.I seldom have to use a flash, as it is excellent in low light conditions. The 24 to 1000mm (42X) telephoto lens is really good, and the anti shake feature, allows you to take great shots. The movies are HD with vibrant colors. I really can't find any drawbacks to this camera.", "Date": "August 20, 2013"}, {"Title": "versatile", "Author": "Amazon Customer", "ReviewID": "R2AJ9OB0U60OA9", "Overall": "5.0", "Content": "Covers the range of requirements for most situations.Recommend for anyone not wanting to hassle with raw photos and/or multiple lenses.", "Date": "July 4, 2013"}, {"Title": "Another great Fuji!", "Author": "Terri Keller", "ReviewID": "RH2KS4JS5ERL4", "Overall": "5.0", "Content": "I have only had this camera for a few weeks but love it!! It takes amazing photos. Fuji is the only kind of camera I ever purchase and I am always pleased with them. Portraits with these cameras usually require little processing as they capture skin tones so beautifully! The zoom on this camera is AMAZING!!", "Date": "May 2, 2013"}, {"Title": "Fuji not for me.", "Author": "Marilyn Patterson", "ReviewID": "RDLZKGGLJVKR", "Overall": "1.0", "Content": "This camera didn't live up to the great Fuji name.  I switched back to Sony. The quality of the photos were not real good.  It doesn't work well in automatic which is what I use for wildlife and bird photography. I sent it back.", "Date": "May 29, 2014"}, {"Title": "a very good balance between picture quality and zoom range", "Author": "anthony ricci", "ReviewID": "R2QKA4INNYQO2Z", "Overall": "4.0", "Content": "This is my 2nd order to replace a defective camera that was shipped to me a week earlier from a 3rd party seller. I have gone ahead and contacted Amazon to see whether they can help.  It turns out that Amazon also offer the same camera.  After explaining how much it is costing me to return a defective e camera, Amazon immediately offered to match the price and expedited the camera to me and was in possession of the camera not even three days later.The Camera I received from amazon works great and I am very pleased with the zoom capabilities and the focus speed.  Picture quality is above average, especially for a bridge camera and not being a DSLR.  Overall I think this camera offers a nice balance between image quality and zoom.  I would recommend this camera as a 2nd camera to carry along with your DSLR.  Especially for high zoom shots.In addition, Amazon decided to extend a good bit of money to compensate me for the expenses I had to pay in order to handle and ship the defective camera.  I am very satisfied with this outcome.  In any event, when it comes to receiving a defective product, I don’t feel that a consumer should be penalized by being responsible for shipping and handling expenses.", "Date": "May 18, 2014"}, {"Title": "Very nice superzoom", "Author": "EvilTwin", "ReviewID": "R33V2PV8LHK4SI", "Overall": "4.0", "Content": "This was my first Fujifilm camera, I have been pretty consistent with Lumix and Canon.  Its very well built and for the price I paid I am very pleased.  It was sold as used through Amazon warehouse deals and it looked brand new.  Many more features than you can hope to remember.  I would give it 5 stars except for one detail.  The manual zoom is fairly stiff so if you read other reviews about trying to zoom while doing video, that is why.  You just cant make it smooth with the amount of twist you have to apply to the barrel.  And if you are used to a panasonic superzoom as I was, you end up constantly shutting the camera off since the on off switch is identical to the power zoom on the lumix cameras.  From reading other reviews,  this is how they all are.I did not find the door for the memory card access to be flimsy, though and I wish they would have made the battery charger a one piece unit where you snap in the battery and plug the charger directly into the wall, as Panasonic did.  This one has a cord with it, more cumbersome for sure.Photo quality for jpegs looks fine, I haven't tried raw yet.  I did experiment with some of the other features after watching the Fuji guys video on u-tube.  That was a help in trying to figure out everything it can do.A few days after I purchased the camera, the price rose dramatically for a used model.  Had it been at that price originally I probably would have went with the fz200 or fz60 lumix cameras.", "Date": "May 17, 2014"}, {"Title": "exxxxelent", "Author": "Rainer Schmidt", "ReviewID": "R35U4DDSQ2N9DM", "Overall": "5.0", "Content": "The Camera does everything i expected,especially the manual focus ring,(a little bit on the too smooth side),but it's OK.So was the Price.", "Date": "May 13, 2014"}, {"Title": "So many whistles and bells", "Author": "sfensler", "ReviewID": "R3488KDZN783D8", "Overall": "4.0", "Content": "I've scanned the manual twice. Played with as many settings as my mind could absorb. How long does it take to figure it all out?Ran a test the day I got it to see if I could use it for a dance recital. I was concerned about quality and whether it could run continuously for 2 + hours. It ran for more than that. I noticed in the manual there is an over-heating indicator, and it got warm but not hot in a 74degree room.During the test I used two Halcyon 1800 mAH batteries and the Fuji battery. One of the Halcyon 1800 mAH batteries lasted 35 min the other 50 min, and the Fuji 2hr 10 min.I also tested a Komputerbay 64GB SDXC class 10 SDXC card to see how many minutes of continuous HD 1080 video I could get. If you read the manual very closely the camera records in 14 min increments. I did get 2 hr and 10 min on the card with no glitches. It looked great in playback on my computer. I recorded TV shows and they played back a little brighter than the TV and liked to put a bluish tint to everything. I'm not surprised. I have reviewed sample videos from other reviewers with no blue tint.CON!: The playback sound on the computer was fine, full and clear. I could not hear the zoom lens movement over the TV sound. While playing back the video on the camera with the sound at volume 10 I could barely hear any sound with the camera held to my ear.  Any comments about camera volume would be greatly appreciated. I would hate to have to send back for replacement.Update 5/19/2014I did zoom during the above test. There was no sound from the zoom at least not louder the recording subject. If the zoom was much looser it would move around when the camera was pointed up or down.Part of the test was to run continuously on HD video in 14 min (see manual) increments , using the Fuji battery and a 64Gb SDx card. The card and the battery ran for 2hr 10 min. Very pleasantly surprised!As I said I bought the camera for a Dance recital. I tested it during practice to verify continuous focus for a staged event with stage lighting, a dark back curtain, in a dark auditorium. Auto-focus was a disaster. Sometimes the auto-focus would get lost and never come back. What to do??So, of all things, I read and reread the manual. It offered little help but presented some parts of the puzzle. One of parts was that some of the settings in camera mode carry over into movie mode. Of course one of the items was to use the manual focus mode switch on the side of the camera, but with any camera screen size it's difficult to see when the camera is truly in focus. On page 85 there is a setting called \"Focus Peak Highlight\". You set the focus using this setting in camera mode then press the movie button and the camera stays focused. The other automatic functions such as WB and aperture seemed OK.So even though this camera does not have all the features of a Cam-corder it does the same beautiful job in video as with stills.PS> When outdoors in daytime the auto-focus in movie mode doesn't seem to have this problem. Of course the auto-focusing problem is the same in still mode in dark settings.", "Date": "May 10, 2014"}, {"Title": "Fugifilm FinePix Digital Camera", "Author": "Dannyboy", "ReviewID": "R1AQ3F4CQ8N86A", "Overall": "5.0", "Content": "Nice camera and great features. I purchased this camera to replace the old fugiflim unit which was more that six years old. I like this unit and would definitely recommend this camera to others for purchase and use.", "Date": "May 5, 2014"}, {"Title": "HS50EXR great camera", "Author": "L. Rinaldi \"ski rat\"", "ReviewID": "R13OZIX5ODW8OU", "Overall": "5.0", "Content": "I purchased this camera used from Amazon. The camera arrived in the original box, no blemishes or scratches. I'm using in in EXR Auto mode until I familiarize myself with its features. I need to review the DVD and check out the available blogs.For now, the camera takes good photos in auto mode under ideal conditions. I enjoy birding and zooming in on a variety of species visiting our feeders.I purchased a 32 GB Transcend SDHC Class 10 card from Amazon. Haven't tried HD video, only taking stills.The only feature missing IMO, is Bluetooth which I understand is available on the newer models.Considering the price and condition of the camera, I am pleased and would recommend it to my friends and family.", "Date": "May 5, 2014"}, {"Title": "Best camera I have had!", "Author": "sandyt60", "ReviewID": "RI409X2S4R58A", "Overall": "5.0", "Content": "Takes sharp clear pictures! Easy to use. I have not found any faults with my purchase . I'm so excited I went with this camera", "Date": "May 4, 2014"}, {"Title": "Ths is a good camera for everyday use and travel purposes.  I have a Nikon but it's too heavy to keep around my neck 24-7.", "Author": "Janine Salzman", "ReviewID": "RWLHGNN88YVLN", "Overall": "5.0", "Content": "So I was looking for a camera to travel with. Some places have a problem with gypsies etc so I want to keep it around my neck at all times.  Yes it's light enough to do that and it offers so much for its size including manual zoom which I love.  All in all it is a really good value and excellent image quality in its category.", "Date": "April 8, 2014"}, {"Title": "Fujifilm FinePix HS50EXR 16MP Digital Camera with 3-Inch LCD (Black)", "Author": "Carolyn \"C DB\"", "ReviewID": "R20C3C00BDOASP", "Overall": "5.0", "Content": "Just love the camera. There's a small learning curve just so many cool featuresIts a little heavier than my old camera  Truly a professional camera.Great price.", "Date": "April 2, 2014"}, {"Title": "Great pictures, but could be better indoors", "Author": "Kelly", "ReviewID": "R1JC3OKG79N9L3", "Overall": "5.0", "Content": "This camera takes great pictures outside, and ok pictures inside. I take a lot of pictures of my kids, and inside when they are running around the pictures are just blurry. That said, I have yet to find an affordable camera that can do that. Overall I love this camera, and use it all the time. It a great combination of manual and automatic.", "Date": "March 14, 2014"}, {"Title": "great camera", "Author": "Hank the Tank", "ReviewID": "R1RTUPQ4GE9DRF", "Overall": "4.0", "Content": "and takes great video.  Some of the controls could be better located but overall a very good camera.good value for the money spent", "Date": "December 31, 2013"}, {"Title": "A fantastic \"bridge\" camera", "Author": "Ted Pastrick", "ReviewID": "R3G2X5WR2BMI4B", "Overall": "5.0", "Content": "I'm not a photographer by any means but this camera makes me look like one! It's easy to use and the 42x zoom gets shots that I'd never been able to get with my point and click cameras. I haven't had any complaints about it at all.", "Date": "December 22, 2013"}, {"Title": "FAST! I am SO Happy with this camera!", "Author": "Marcy From Maui \"marcyfrommaui\"", "ReviewID": "R1DMC7SWFMJA1W", "Overall": "4.0", "Content": "I am SO Happy with this camera! I got it to replace the older version. I used for pictures of my son surfing so I needed a camera that can take pictures FAST and recover fast! The older version was so slow and I had to be lucky to get a good shot even though the zoom was good. This one is SO MUCH better! I can go fast shot to shot or continuous without losing my subject ( surfer ) on the wave so I can shoot more. Not great in low light, but I LOVE that it has a \"eyeball viewfinder\" which is a huge plus in bright light!Also the battery lasts a long time!", "Date": "November 21, 2013"}, {"Title": "Great camera for the price.", "Author": "Judith Emrick", "ReviewID": "R2XF7F38E9V726", "Overall": "4.0", "Content": "Camera is easy to use and the picture clarity is excellent. Shot a definable picture at 2000 ft - nice.", "Date": "November 8, 2013"}, {"Title": "verry happy with this camera features", "Author": "Trung", "ReviewID": "R1EPEZY2MPY130", "Overall": "4.0", "Content": "Verry happy with this product, the only one thing annoying me is stiff twist lens barrel. O read some review and knowing this is the way it is!!! I Prefer auto zoom.", "Date": "October 6, 2013"}, {"Title": "Great all around camera.", "Author": "Bruce Meekin", "ReviewID": "R2I25VFO3KIW3X", "Overall": "5.0", "Content": "If you can only afford one camera I definitely recommend this camera. It allows me to be very creative in all types of shooting situations. I can set in an automatic mode and my wife feels very comfortable with it and gets some great pictures.", "Date": "September 1, 2013"}, {"Title": "HAPPY ABOUT THIS PURCHASE", "Author": "a2z", "ReviewID": "R333HHNQQLJB9K", "Overall": "5.0", "Content": "LOVE IT. It takes quality pictures. Purchased for my son for his birthday.  Feel like I made the right choice", "Date": "August 10, 2013"}, {"Title": "I love Fujifilm", "Author": "Khaled A. Salama", "ReviewID": "R1E9JAGC6EW65T", "Overall": "5.0", "Content": "U can call me crazy as I already own the HS 30, But I rushed to buy this camera cause of its awesome features, slow motion video, & of coarse the zoom, i gave my DSLR to my wife to buy this one, no need to change lenses or buy costy ones", "Date": "August 7, 2013"}, {"Title": "Met my expectations!", "Author": "Trini LuvyT", "ReviewID": "R2L259AN5F7UKM", "Overall": "5.0", "Content": "I received my HS50EXR a few days ago and have been practicing with all the modes and so far I am quite happy!The EXR mode is quite intuitive and returns great quality photos, but right now I am experimenting with the Aperture Mode and achieving a nice depth of field in my photos.I purchased this camera as a step up from a classic point & shoot to prepare myself one day for owning a full dslr. I must say that being a newbie at photography, I am definitely beginning to appreciate the differences of shooting in Auto and PSAM modes.The zoom pics are amazing in detail and I am waiting for a full moon so I can capture it.I hope you enjoy your HS50EXR as much as I am enjoying mine!UPDATE (05/20/13)Took my new HS50EXR on vacation in the Caribbean and I have some great pics to post up (will try it later if Amazon will let me). The focusing on the zoom did take a little longer but I was satisfied with the quality of the photos I got. I was able to capture a great still of a resting hummingbird...beautiful! Even tried taking a picture of the moon at full zoom but the camera would focus and instantly go out of focus. I could see all the details and craters in the moon while the camera was focusing, but when it was done, the moon just came out like a white blob. Will definitely try this again though.I am still struggling with mastering low light photos with this camera however...but maybe it's the trade-off for the massive amount of zoom. So far, it seems to perform quite well in bright light (once the sun is out). I will keep trying it out though.", "Date": "May 5, 2013"}, {"Title": "Versatile camera with amazing zoom capabilities", "Author": "terpfan1980 \"Barry\"", "ReviewID": "R3O98F9MBGE537", "Overall": "5.0", "Content": "I had the good fortune of being able to review another Fuji super/high-zoom camera (Fujifilm FinePix SL300), a 30x Optical Zoom \"budget\" camera that I since went back and bought a second of just so I could give one to my brother's widow to have as her own.  With that camera, part of my initial impression was that the FinePix SL300 felt \"light\" and somewhat \"cheaply made\".  Even with the weight of the lens(es) in that camera, it just has a feel that gives off a bit of a budget camera vibe.  That camera works very well, really there's absolutely nothing wrong with it from an operational and usage point of view, but it absolutely felt to me like a camera that would probably break into a myriad of pieces if it was to be accidentally dropped.Flash forward a bit (no pun intended there) to me obtaining this very nice FinePix HS50EXR and I'm struck by just how much more hefty this camera is compared to that one.  Granted, with a 42x Optical Zoom lens system on it, it should have some heft, but beyond the lens, well into the body and overall construction, this camera just exudes heavy duty and heavy weight construction.  It felt very substantial as I took it from the box, and feels a bit like a brick as you hold it in your hands.  That worries me a little in that I can imagine my arms getting tired while holding this versatile beast up in the air to take photos or videos, but given the zoom capabilities, it is a trade off I think I'm more than willing to make.This is a feature rich camera with a well thought out combination of optics and lenses that offer a lot of the best of all possible worlds in the photographer's spectrum (again, no pun intended).  Fuji has obviously put a great deal of effort into creating a competitive product here and it really shows in the resulting camera.Some observations:* I love the automatic electronic viewfinder detection.  Hold the camera up to your eye and the LCD display is turned off in favor of the electronic viewfinder.  It limits the distraction for others around the user of the camera and offers old school photographers (like me ;-) ) more privacy in getting our shots right.* The lens system is a bit stiff, at least during the initial usage.  Moving the lens through the various zoom range felt a little stiff and sluggish.  I think that is to be expected, at least during a break-in period, with this sort of camera and hope, and expect to a large extent, that over time the lens system will move more freely.  Actually the stiffness is a good thing since it makes it less likely to accidentally change the focus while holding the camera, but at the same time, well, a user might like it to be a little less stiff.* Related to that thought, it takes a good bit of user's adjustment to move from a camera with a fully automated focusing system with easy focusing just by flicking a lever one direction or another to this camera where the user must do the majority of the focusing by rotating the lens.  This camera is more in the line of an SLR type and less in the line of a simple point-and-shoot style where the focus is traditionally done by flicking a knob or lever to zoom in or out.* Zoom beyond 20x (approximately) into the higher range is not immediate and can take a little patience to get through.  Zooming out to the approximately 20x range is very quick and somewhat smooth, but as you venture beyond that range this camera takes a little time to catch up with you.  Basically don't expect a nice smooth move from 20x through 21x, 22x, 23x, etc., up to 42x.  It would be more in the range of 20x up to 30x, up to 40x, etc.  You can make finer moves up or down, but the primary movement in the range tends to happen (on the upper end) in bunches.* Weight may be an issue for long-time usage.  I would seriously recommend getting a tripod to use with this camera, even a small portable type, so that you can set this camera up on it and hopefully avoid having to hold it over the longer term.  I would expect your arm to get tired relatively quickly as the heft starts to take on a toll for the user.* The 3-inch LCD display folds out and adjusts to virtually any angle you could ask for.  I love that feature as well.  Flip the display out, turn it around if necessary (flip it over as necessary) and angle it to where it is easiest for you to see.  Especially useful if taking pictures that require holding this camera up above your head or eye level.Items that don't come with this camera but will be desired:* A nice camera bag to hold this wonderful camera.  I was able to obtain a bag locally (at a local 'mart) that seems  to do the job for me, but would note that because of the size of the lens, you'll need a bigger bag for this camera than you might find on most shelves.  That's a good thing, but is worth noting so you shop around for something roomier and less constrained for this camera to be carried around in.* Memory card not included.  Expect to purchase an SDHC memory card for use here.  Class 10 typically recommended.  It isn't that expensive, especially not when you consider what you'd spend on this camera, but it is a necessity and should be obtained when you get the camera, or should be expected to be needed before being able to use this camera.I'm not sure I could recommend this camera highly enough.  It makes a great addition to my stable of photographic equipment.  While I still love most of the other cameras I have, I can see where this camera would be right at home throughout most of the usage I might think of.", "Date": "April 23, 2013"}, {"Title": "Beautiful photos with mediocre video from this hybrid _ UPDATED 10/25/13", "Author": "Andrea Polk", "ReviewID": "R3N25YDGKW8MTW", "Overall": "5.0", "Content": "I was lucky enough to receive this camera as part of the Amazon Vine reviewer program.  Being an intermediate digital photographer, and by no means an expert in manual settings or photography, I was a bit intimidated by this one - but not for long!My first thought after playing with this camera for about 3 hours is: \"I LOVE IT!\"  And my advice: 'Don't hesitate to buy this camera!'Frankly, that's rare for me.  I can't say I've felt this excited taking photos in a long time, nor have I felt like wholeheartedly encouraging others to buy one... until today.I currently own 9 cameras.  Point and shoot types you throw into your pocket, and some that are a bit bigger including:  Fujifilm FinePix SL300 14 MP Digital Camera with 30x Optical Zoom (Black), Sony DSC-H200 Digital Camera with 3-Inch LCD (Black) and Olympus SP-600UZ 12MP Digital Camera with 15x Wide Angle Dual Image Stabilized Zoom and 2.7 inch LCD.I'm familiar with digital 'zoom' cameras at a lower price point.  None of the cameras I have can compare to the features and quality output of the Fujifilm FinePix HS50EXR.This camera ships with a rechargeable battery, AC battery charger, USB cable, lens cap, lens hood, shoulder strap, basic manual (in French, Spanish and English) and a FinePix CD.NOTE: You will need to purchase a SDHC, SD or SDXC memory card (suggest Class 10 speed for best performance) to store your photos and video.First, the camera is incredibly versatile. It takes great candid shots of your family and pets, as well as stunning landscapes and low light photos.  Perfect photos can be snapped again and again via super-macro down to 1cm, and via a 42X manual optical zoom (84X Intelligent Zoom) with image stabilization.I've never found a digital camera to be great with both macro and zoom, but this one achieves both, effortlessly.Having used other cameras with similar interfaces I jumped right in.  It wasn't hard to get the hang of its navigation and transitions from one part of the menu to another were quick and intuitive.Second, this camera is super fast! Continuous shooting modes, as well as single snaps were blur-free. Shooting modes have some affect, but truly, comparing this camera to the others I own, I notice virtually no lag with a Wintec Filemate 16 GB Professional Class 10 Secure Digital SDHC Card installed.Third, the FinePix has an incredible array of photography functions built into the camera. Scene modes and easy to use advanced settings that will delight intermediate users, and help them to grow as photographers.I had a ton of fun playing with shooting modes (landscape, sports, portrait, etc...), which are found on other digital cameras, as well as with advanced features (panorama 360, advanced filters - toy, soft focus, pop color...).  All of them yielding great results.Fourth, it also provides HD 1080P video recording, and has an external microphone jack.  This is great for anyone who does YouTube videos.  Put this camera on a tripod and wear a Olympus ME-52W Noise Canceling Microphone.  Using rotating LCD on the FinePix, you will be able to see what you are recording in 1080P and get outstanding results!  You can upload to Facebook or YouTube directly once your camera is connected to your PC via the included USB cord, or edit and do it later.An HDMI port on the camera makes it easy to show others your HD movies on HDTVs and PCs via an HDMI cord (not included).I wasn't overly impressed with the FinePix HS50EXR's video camera's audio without an external mic outdoors, but it probably would be fine indoors without one as long as the room was quiet.  The nice part is that with this camera, you have options!The HD 1080P video quality was outstanding, but be prepared for a bit of choppiness if you're on the move or panning an area versus remaining stationary.Even without any special filters or tweaks, this camera takes incredibly sharp photos and video, with a depth of color reproduction that is unmatched by other digital cameras I've used.There were a few things I wasn't completely satisfied with but considering the great overall performance of this camera, they seem minor and shouldn't be a deal breaker for most.Macro setting provides stellar results, but sometimes the camera had a tough time focusing in macro via EXR mode. I found that using 'Text' (in advanced settings) with macro worked well for enhancing details.Zoom works well and adjusts for moving objects most of the time, but sometimes acquired images in the background (focusing on them) instead of the one I hoped it would catch.  Playing with scene modes helped, thus it was probably more 'user error' than the camera.I wish the on/off switch wasn't where other cameras I own have the zoom function.  It will take time getting used to this placement and hope I do so before I miss out on some great shots!I'm sure that with all its features and outstanding performance, the Fujifilm FinePix HS50EXR will delight many intermediate digital photography enthusiasts (and advanced users too).  Giving them the tools to take good photos now, and quickly grow into taking fantastic photos in the near future.UPDATE: 4/27/13 - Dropping from 5 Stars to 4 StarsI took this camera to a 'low light' indoor event where I put it through its paces using EXR Auto for most of it.  I probably should have done a low light setting, however I wanted to know if 'auto' alone would adjust and produce good photos.Photos came out good overall, even without a flash.  Auto adjustments were quickly made by the camera and 70% of the photos showed no blur or lack of focus.Then I took a 6 minute video.  The camera had a tough time remaining focused with the subject of the video moving a little (walking back and forth across a stage).Sound capture from 12' away was awful without an external microphone, leading me to believe that only videos taken at short distances will be 'good' using the internal mic.Video playback was choppy. 'Not good.'  Using a SanDisk Extreme Pro 16 GB SDHC Class 10 UHS-1 Flash Memory Card 95MB/s SDSDXPA-016G-X46 I expected better capture and playback.Stills taken as video recording was occurring were grainy.  Overall video very disappointing.I love the way this camera is quick to respond, captures vibrant color and detail (even on auto settings), and has advanced features to promote creativity.  Photo taking is fun with this one and produces good results.I wish the 1080P HD video was equal to the photo taking capabilities, without the need for enhancements such as an external microphone.  I hope to discover the best media to use with it, and will probably choose another camera for video taking other than for indoor, microphone enhanced product review-type videos.UPDATE: 10/25/13At the risk of appearing a bit like someone who can't make up her mind...I've moved up the star rating on this camera from a 4 to a 5 star rating.  I still wish the video was equal to the still capabilities of this camera, but frankly, I love this camera the more I use it and hardly ever want to take video - so what's the big deal?For those who want both exceptional still photography with great zoom AND equal video quality, keep looking.  Otherwise - this is a winner with tons of features to enjoy for years to come.", "Date": "April 22, 2013"}, {"Title": "fujifilmfinepix HS50EXR", "Author": "William Penn", "ReviewID": "R3EEKZXCUJSAL6", "Overall": "4.0", "Content": "The camera is all and more then I expected.  There is a lot to the menus and takes time to prepare for a special shot.It's not as simple as my DSLR.  The pictures are very sharp.", "Date": "January 15, 2014"}, {"Title": "Good camera", "Author": "Heno", "ReviewID": "R3NEB09VQHZOPJ", "Overall": "4.0", "Content": "I got it for my son and he is using it for high school projects, the camera is fast and got all the options. The SD card is missing, usually they have small SD card for test but this one didn't have it.", "Date": "January 11, 2014"}, {"Title": "Best thing since sliced bread.", "Author": "Kenneth L Hansen", "ReviewID": "RBDJAP8KAZX3O", "Overall": "5.0", "Content": "Like the little train that could..  This can do.Full manual setting and love the highlight peaks for focusing in the low light or anytime.", "Date": "January 10, 2014"}, {"Title": "Nice but unstable", "Author": "Robert Betts", "ReviewID": "RGKZP0OX6JNTQ", "Overall": "4.0", "Content": "I just got this camera and I am impressed with the quality, however, the zoom could use some work. I tried to zoom in on a subject but  it wasn't very smooth, there is a lot jerking when zooming in on your subject.  I have looked this issue up online and apparently many users of this camera are having the same issue. Another issue is with recording video, the lens will auto focus even though the camera isn't moving causing your video to blur which can be irritating if you decided to use this for recording vlogs. The photograph quality is amazing but I think Fuji rushed this out without perfecting it.**UPDATE: 3/15/2014After having a fair amount of time to use this camera, I have to say this camera is good for taking photos only. If you are a vlogger and looking for a stable camera to put out high quality video, this camera isn't it. The FujiFilm HS50EXR is a light hog and has been giving me nothing but trouble in terms of video. I asked Fuji Guys on YouTube about it and they recommended I go all manual to insure proper focus, I did and that didn't help.", "Date": "August 1, 2013"}, {"Title": "Fuji 550exr", "Author": "Gomer 42k", "ReviewID": "RGGINF01SJ86I", "Overall": "3.0", "Content": "Well, I am still evaluating but here is my impression so far.  First, be sure to get a polarizing filter for the lens (58 mm).  If you shoot outdoors, a UV alone wont do it.  Get a polarizer.  I recently took this camera during a hike in Yosemite.  Pics are good, but there is limited zoom ability during crop.  Dont let the megapixels fool you.  Use the optics to get the shot you want and hope you dont have to crop into the picture too much.  The optical viewfinder is so-so.  Even the LCD screen for reviewing is a bit deceptive.  Wait to view your pics on the computer.  I think both the LCD and the optical viewfinder are a ways behind Panasonic, Canon and Nikon.  The sensor is a bit larger than the 50x Canon and Nikon, but each has their drawbacks.  I tried both, and returned both.  The Fuji seems to have better capture on the flash card, just that you cant always know it until you upload to the computer.  The optical viewfinder is ok, way better than the Nikon 50x and the LCD is mediocre.  But the pics are quite good for a lightweight camera with this much versatility in one package.  I would take a full star for the viewfinder and LCD, and another star for the light metering and autofocus.  Light settings seems to be subject to shot conditions more than your typical SLR camera.  Autofocus is slow, couldn't track a flying pelican with continuous mode.  The EXR mode is fairly useless in my opinion.  The aperture priority mode was not responsive with proper shutter speed, and program mode did not work like an SLR.  Otherwise, panorama shots seemed to work fairly well at fixed metering.  Dont go from brighter to darker, it cant discern.", "Date": "August 9, 2013"}, {"Title": "Grad gift for my daughter", "Author": "Ron Krebs", "ReviewID": "RAIEDYL5ST942", "Overall": "5.0", "Content": "She took it to school and is now loading up FB with all her nature shots and selfies.  I got a Fujifilm S7000 and I'm thinking of swapping it with hers when she comes home on break.", "Date": "May 11, 2014"}, {"Title": "The Fujifilm FinePix HS50EXR is a fine \"Bridge\" camera with lots of  DSLR features at a good price.", "Author": "GeorgeC", "ReviewID": "R219NBUE7CB2EG", "Overall": "4.0", "Content": "I think I'm going to raise my rating to 5 stars as soon as I finish learning the rest of the features. Everything worked as advertised, although I found zooming while filming was slightly jerky; not a great deal, but a little. Battery life was and is great. New England leaf-peeking was easy and turned out great.George Clouette", "Date": "December 10, 2013"}, {"Title": "I love it..", "Author": "Lightning Rod \"TM\"", "ReviewID": "RH5MWDSR0II5", "Overall": "5.0", "Content": "I could go into F-stops and all that technical jargon but I've already seen more than one review about that so I'll write this like a common consumer.  I've owned one other DSLR (Konika-Minolta) and presently own this one Nikon D5100 16.2MP CMOS Digital SLR Camera with 18-55mm f/3.5-5.6 AF-S DX VR Nikkor Zoom Lens.  I will admit I don't use it to its full advantage because I really don't know what all the features and haven't taken the time to learn them.  A big loss to me.  The Fuji is very, VERY similar to a DSLR with one HUGE difference:  you don't change lenses.  That is very, very nice.  It does take good pictures but they suggest putting the flower shade on it.  It will grey out your pictures and they don't end up very good.  :(  I'm uploading some of my own pictures and you can make your own judgement.As a final note, I decided to take some pics with this camera and with my Nikon.  I have 2 lenses for my Nikon:  18-55 and 55-300.  Good shots from both, however, the shots I took up close with the Fuji were awesome!  (I tried taking some with my 55-300.  Bad idea.)  Even though I have a terrific DSLR on hand I can see myself using the Fuji more frequently (and my lenses can fit too-the polarized, wide angle, etc...)  Easier to carry in my holster:  AmazonBasics Holster Camera Case for DSLR Cameras (Black).  No need to change lenses.  Kinda heavy compared to other point and shoots but you'll never get what this camera does for you with other point and shoots.  Never.  Worth the money!  Enjoy!", "Date": "May 15, 2013"}, {"Title": "Autofocus Issues - Best for Outdoor Use - Excellent Image Stabilization - Does Not Need a Tripod or Monopod", "Author": "christinemm  from The Thinking Mother blog", "ReviewID": "R1RBVYFE98BYD3", "Overall": "3.0", "Content": "If you are looking to move up from a point and shoot and have not yet used a DSLR and need a lens that goes to 1000 mm with image stabilization so you don't need a tripod or monopod, you may be very happy with this camera. If you own a DSLR that you like and perhaps cost you more than this Fujifilm HS50, you may be disappointed when it cannot do what you are used to your other camera being able to do (even in auto mode), even if you have to use a monopod or tripod.Before writing this review I took over 900 photos in Auto or EXR mode over more than three weeks' time. I photographed people inside and outside, pets, gardens, macros of plants and flowers, perched birds and flying birds, landscapes in overcast and sun, and used the zoom lens for two days at a sport event. I used it side by side with my Canon DSLR for a comparison.My main camera has been the Canon xSi DSLR but I wanted a macro lens that went closer than 28mm, and I have a problem at the same events needing the 70-300mm zoom but finding 70mm was too close for candids of people so had to switch back to the 28-50mm lens. I also use the iPhone a lot for casual photos. I have not been using manual mode with my Canon or with the FujiFilm Finepix HS50 EXR. I had hoped this new Fuji would be a great solution to using just one lens for convenience while at sport events when I needed a long zoom then the next minute needed to take photos of people in close range. Secondarily, I was curious to see if the image stabilization could truly be used for long zoom without a tripod or monopod.Pros:One fixed lens, long zoom lens (although its use is flawed with autofocus - see below)Great image stabilization (better than my Canon xSi), I was able to shoot using 1000mm zoom at boat races without a monopod or tripod! (So long as the autofocus focused on the right spot).Happy with the resolution, seems the same as my Canon xSi DSLR.Works best in daylight or bright light outdoorsPhone customer service is helpful. (I made 3 calls and was asked to do an email follow-up.)Easy to start shooting intuitively or with the simple paper owner's manual. (Use PDF longer manual on the disc for the rest, including some basic operations.)Cons:Auto focus is not as well rounded or easy as you assume. I had trouble shooting close (non-moving things: plants, a still lizard, a sleeping cat, a building's wall).  Even shooting from 10 feet with zoom the camera would not focus during half-way press or for the photo taking, but on photo 2 or 3 it suddenly would focus.Shooting rowing scull races from about 50 yards was difficult also; it focused on the background river wall or trees not the boat despite the boat being in the focus range box.EMAIL FROM FUJIFILM: \"With the (unfocused) cat photo, you probably zoomed in too close if you were 10ft away. If that's the case, turn on macro mode to help the camera focus. Or you can adjust the zoom back a bit until it focuses. The min focus range in the normal focus mode is 1.4 ft. In macro mode the focus range in wide angle is 0.2ft - 9.8ft. In telephoto (lens zoomed out) it's 8.2ft-16ft.\"I don't like the viewfinder view being highly pixelated; it is so bad that you can't see if a person's eyes are open, for example.When the viewfinder shows the object blurred and smear-y when I move or when the lens moves or the subject moves. This causes delay in the ability to align the subject and shoot the photo. This is a problem not just for sport races and moving objects but for candids of people in close range. The blurred or smeared object was so bad that I missed boats crossing a finish line, and could not tell if the boat in the viewfinder was our team or another. I missed many good shots.I was unable to take photos of flying birds, the camera focused on the sky and the blurry, smear-y image meant I could not even see the bird in the viewfinder before it moved again and I lost the shot. I had problems getting multiple perched birds to come into focus to get good photos, even one that I was shooting from behind glass when it was six feet away.Customer service said when I see the flower symbol in the viewfinder I have to press the macro (flower) button on the back. This includes when the object is 10 feet or 20 feet away but when using the zoom. The fact that the zoom is available was making me not get up and move closer (especially since something like a wild bird or a pet may leave or change position if you get closer.) This is clumsy but I guess I could learn to click that button with my thumb without moving my eye away from the viewfinder. I see that often but had not realized that as I'd not read the entire user manual cover to cover at that point in time.The viewfinder and screen on the back of the camera has garish-unrealistic colors. The actual photos have the proper color.The viewfinder is dark, when shooting a face that was five feet away I could not tell if the person's eyes were open or if their mouth was open or closed. I just shot a lot and hoped some came out, and often, some did.  It was like shooting blind. However my naked eye right there could see the face clearly. (I do not understand the reasons behind this but there must be a technological explanation.)Although I used the camera on the basic settings customer service said the cause of some of the autofocus problems could be that my camera needed a reset. I don't get this, but if your camera is acting funky, try resetting it. It did seem to help me.I like my photos date stamped but upon download the 3 dates in the properties change to the download date & download time. This is different than my Canon DSLR so after troubleshooting with the user manual failed and with the Fuji software's help function, I phoned Fuji and was told that is the way Fuji cameras work.  What I had to do to preserve the original date/time stamp was plug the camera into my PC then view the memory card for the date. I file in folders by dates. I had to manually create each folder and then look for the dates, highlight and copy them to that folder. Then I could delete the photos from the memory card. This is time intensive and this operation is something that my Camera software does automatically for me (including folder creation).I was unable to download the user manual the normal way and had to phone customer service to have them show me the back door way.When I downloaded the Fuji software it hogged up my computer then I lost connection to the internet and had to do a restart of my computer to get everything working again. Odd and annoying.The lack of built-in flash even with EXR mode (that sometimes chooses to take 3 photos in succession and puts them together into one image) is not that great. While I do have photos of existing light with shadow (that is impossible to do in auto mode on a DSLR or which would trigger built-in flash use with my Canon xSi),  it is not as important to me as taking accurate color photos and crisp photos. For example some of the existing light photos are yellowed in tone, which is ugly for people's skin tone. Candid shots of people are difficult to get as if they move the slightest they blur out in both Auto and EXR.  This is a problem when shooting family photos indoors, blowing out the birthday candles, opening presents, etc.The low battery light does not give enough notice. I thought the Canon was bad but this is worse. It will go on to indicate it is low then on the very next shot the battery is dead and it won't take that shot. I advise that you buy at least two more batteries and keep them charged and handy so you can change it at a moment's notice. When shooting using EXR mode with S for focus setting I went through batteries in just a few hours (in sunlight outdoors).Despite the marketing saying this is a fast camera it is slower than my Canon xSi due to the autofocus delay. For example if I try to frame a shot, then focus and take it, don't move the camera, it is out of focus again, and it has to refocus when I push the shutter half way down to take the next shot. (My Canon holds the focus in that spot so I can see clearly and decide when to shoot again and if a focus tweak is necessary it does it automatically.)Other Notes:Read your owner manual (on the disc) about the focus button located on the left side of the camera, the round dial with M, C, S. I had not realized this and it was left on the S mode when I think sometimes I should have been using the C setting even though they say it will consume a lot of battery.Be sure to change the dial to the left of the viewfinder to make the image clear to your eye's vision. That was not my focus issue but you should not miss that important step, especially if you are over 40 and your eyes have started changing!I am not a video taker so did not test that aspect of the camera. I am glad it is there but haven't used it yet.In conclusion this is a camera with pros and cons and I find it risky to rely on. When I miss shots of my kid crossing the finish line in a race, that's a problem. The convenience of image stabilization and a 1000m lens that also goes down to 26mm for closer shots is not a benefit if you miss the shots you want to get. I also need a camera that can take fast photos indoors with accurate lighting (not yellowed out or with weird skin tones) and that can take candids of people without them being all blurred from moving a tad. We can buy an external flash, I guess, but that is another expense to consider.Each camera has its pros and cons and we each need to figure out what is worth it to us. I personally will use this for outdoor bright light situations and for sport events for other people, except when my son is racing, then the Canon xSi with monopod will come out.  For indoor shots needing flash I will use the Canon xSi since I already spent money on Fuji batteries and a camera case for it, and need to curb new purchases.", "Date": "May 10, 2013"}, {"Title": "Bought used", "Author": "John Wright", "ReviewID": "R130KAYKZUCZ5M", "Overall": "3.0", "Content": "I bought a used Hs50exr and the camera is awesome, Sad part is with the used one i got didn't focus manually or auto between 24mm-50mm. and that also made  panoramic mode useless.Overall the camera is great takes great other pictures. going to try my luck again and hope that the next one will work perfect", "Date": "March 2, 2014"}, {"Title": "Nice Camera", "Author": "PABLO JOSE CORTI", "ReviewID": "R326YNUOIL6C10", "Overall": "5.0", "Content": "It is an excelent camera for non profesional photographer . I would recommended it specially to people with children to follow up their grow.", "Date": "September 21, 2013"}, {"Title": "I liked it at first, but...", "Author": "C. Kleist", "ReviewID": "R39XEP6IG4XS5A", "Overall": "2.0", "Content": "When I first got the HS50EXR, I thought it would replace my DSLR (several year-old Canon Rebel XT).  I know this isn't a DSLR, and I knew that when I got it.  At first glance, it's a great camera.  It's got the rotating/flip lcd on the back, as well as a standard viewfinder.  The lens has good zoom range, auto-focus works well.  The trouble:  It hasn't taken good pictures.  It's quick, but not quick enough, and no matter what I do, motion pictures have blur.  I'm not talking about filming race cars, I'm talking about taking pictures of my kids on a swing, or running in the yard.  I've had other point and shoot cameras (mostly Canon Elph) which don't struggle as much as this Fujifilm seems to.  I can't recommend it.", "Date": "May 30, 2013"}, {"Title": "So much potential ...", "Author": "Working Poor \"JD\"", "ReviewID": "R2NNGGM2CZX2SN", "Overall": "3.0", "Content": "I am a Canon loyalist, but went with this Fuji because it had everything I wanted, including the ability to add filters (58mm),  -without- buying or adding an adapter, it has a shoe for external flash (Canon flash does work), RAW format, and ergonomic zoom/focus rings. Where this camera comes up short is picture quality, much to my dismay.  : ( Even with excellent lighting and a tripod, the pictures pixilate into oblivion as the ISO creeps past 200.  I didn't get the Canon XS50 because of all the bad reviews about it's electric view finder.  I figured what good is a super zoom camera if you can't compose a decent photo because of a lousy view finder?  The Fuji has an excellent EVF, but takes sub-par photos.  The only thing that saves this camera is the ability to come back and tweak the photos in RAW format, but this is time consuming.", "Date": "May 15, 2013"}, {"Title": "Bought New...Came Used", "Author": "Misc59", "ReviewID": "R28PRMHXZ0SYM6", "Overall": "3.0", "Content": "Bought the camera new but it arrived used with several finger prints all over it...had well over 2000 exposure on it when it arrived.Amazon got right on it and corrected the issue to my satisfaction in a very courteous and professional manner.The camera itself is excellent...many features and fun to use...awesome lens...but just a little soft.", "Date": "December 15, 2013"}, {"Title": "Camera  wouldn't focus", "Author": "C Bowling", "ReviewID": "RP56XLEQPEHHJ", "Overall": "2.0", "Content": "Ordered as a Christmas gift for our son. Tried everything to get a \"clear' picture . Never did. Returned imediately and account was credited.", "Date": "January 21, 2014"}, {"Title": "dissappointed with the flash", "Author": "Henry Cowen", "ReviewID": "RU91QHVWBT052", "Overall": "3.0", "Content": "I am disappointed with the absence of the flash. I t is built into the camera but I can find no way to make use of it.", "Date": "February 10, 2014"}, {"Title": "Worst Fuji EVER", "Author": "Bobby B", "ReviewID": "R1H0KOUB4FQ4V9", "Overall": "1.0", "Content": "First let me say I own a lot of cameras, including Fuji. So when I ordered this, I had expectations...I only spent 1 day before returning the camera.  The IQ is terrible. The auto focus is the fastest I've seen, but what good is it if the picture quality suffers. 1000mm on a camera like this is worthless unless your photographing the sun. It doesn't allow enough light in.  The last complaint is the build quality.", "Date": "January 22, 2014"}, {"Title": "HATE IT", "Author": "Erin", "ReviewID": "R232LAMBAH7ZAK", "Overall": "1.0", "Content": "I spent months researching cameras. I don't have much of a fun budget and really splurged for this camera. I really wanted to like it, the specs are great... everything I was looking for.  The pictures are VERY poor quality. I don't see how anyone gave it a positive review and I'm really disappointed. I have a 10 year old kodak easy share camera with 10x zoom and 6.1 megapix that gets as good if not better pictures. Don't waste your time or money.", "Date": "April 16, 2014"}, {"Title": "The camera has a problem in a manual mode", "Author": "Rodrigo Molina Moncada", "ReviewID": "R1CRWZ9LEBSX3V", "Overall": "1.0", "Content": "I configure the camera in any manual mode specialy \"M\", and configure F=11, the obturation time in 30'' and the full 16MP size, When i take the picture with this configuration or similar it shows a message \"processing\" forever. It show this message forever until the battery is unloaded. I try a lot of time to take this picture of long exposure and always happened the same: the \"processing\" message forever. I contacted to amazon and they suggested me to return the camera. I'm gonna do it, but i want to know if someone with the camera has the same problem or is just a problem of my camera.  Actually all the characteristics of this camera are amazing, but this problem in manual mode is so bad. I want to know if  it is a problem of this camera model or only of my device in order to buy it again in future", "Date": "December 27, 2013"}, {"Title": "Limited to certain Flash/Mic units, quality still bested by the one-year old Canon SX50HS", "Author": "WolfX5", "ReviewID": "RN4NWAZ707IBB", "Overall": "3.0", "Content": "Lured in by a higher megapixel count, slightly larger aperture, and a built-in panorama mode, I was thinking this camera could be a nice replacement for the Canon SX50HS I already own...I was wrong. It's unfortunate that Fuji developed such a promising camera only to cripple its ability to use external accessories. Firstly, I discovered after the fact that the HS50EXR has a 2.5mm mic jack instead of the more popular 3.5mm size, so if you want to record external audio you are going to have to purchase a cable adapter. Secondly, Fuji decided to further cripple the HS50EXRs ability to use external flash units by giving you only 2 choices of flash unit. You MUST use either the Fuji EF-20 or EF-42 flash units with this camera. I found these designed-in limitations incredibly annoying.In daily use, I found the manual zoom be be less workable than the fully-automatic zoom on my Canon. While the manual zoom had a more \"traditional\" DSLR feel to it, I found the ability of the Canon to zoom AND shoot with one hand to be very advantageous in taking photos, and nearly a necessity when trying to shoot smooth video. I DID like the manual focus ring though on the Fuji which the Canon does not have (you zoom the Canon \"manually\" by using a jog dial in manual focus mode).I had my own issues with the quality of the raw Fuji images (noise mainly), but for those of you that want an unbiased third-party review of actual camera images I recommend you consult CNETs review on April 2nd, 2013, and POCKET-LINTs review on March 4th, 2013 and come to your own conclusions. I agree with these reviews based on my own tests.I also found the zoom a little short. That's sounds crazy to say when the Fuji has a 42x optical zoom and an 84x digital zoom but my Canon SX50HS has a 50x optical zoom and a 200x digital zoom - which comes in surprisingly handy when taking travel/wildlife photography. In real use, taking uncropped, lower-resolution 12MP pics of a subject with the Canon at its maximum optical zoom of 50x bested the higher-resolution 16MP images of the same subject taken with the Fuji at its maximum optical zoom of 42x because the Fuji images had to be cropped to produce a finished product with the same \"reach\" as the Canon. I also found the optical image stabilization is better on the Canon. The Fuji did have some more flexible video options (my Canon can only do 24p frame rates) and if that's important to you that should be a consideration of the Fuji. The Fuji does have an external mic input (albeit proprietary) as I mentioned above which might also be important to some people.Furthermore, in comparing the features against the camera I currently own, the Canon currently has support for its RAW mode in all of the current Adobe products, and has full support for barrel distortion correction and chromatic aberration correction in DXO Optics Pro 8 - neither of which the Fuji HS50EXR currently enjoys. The ability to use these 3rd party tools on images is invaluable in producing a quality photographic product, so it's too bad this Fuji doesn't (yet) seem to enjoy the same level of support from other software vendors.", "Date": "March 20, 2013"}, {"Title": "Camera", "Author": "Kerstin Mitchell \"kscwgrl\"", "ReviewID": "R13FAFDCP1NMGT", "Overall": "3.0", "Content": "I bought this used in like new condition is what it said. But when I got it it didn't work so I didn't get to use it. The feel of it felt really sturdy and well put together! looked just like a DSLR in my opinion. Would have loved to try it out. When I get one soon I will elaborate on this review", "Date": "February 7, 2014"}, {"Title": "todo como lo esperado", "Author": "Eduardo Gonzales", "ReviewID": "R2S7RJYD4Q6KK1", "Overall": "5.0", "Content": "se siente bien en las manos, el manual de uso viene en español en el cd quetrae la cam... muchas posibilidades d facil calibracion,,, me encanta estoy muy enganchado con mi comprA.todo llego en perfecto estado.", "Date": "April 16, 2013"}, {"Title": "Very dishonest zoom stats. Not a 42X zoom", "Author": "Neill Southwick", "ReviewID": "R15L32X29O89ED", "Overall": "2.0", "Content": "This camera is really about a 26X zoom. It has a 2X digital zoom option. They use this to arrive at the 42X zoom number they use.  That's not all that's bad on this camera. The zoom itself is jerky and has several catches when you turn it.  The menus are tiny, ugly and confusing. the ON/OFF switch is constantly getting moved by accident.  The owners manual is really terrible, both the short and long version. Hard to find what you what read about and very incomplete. On top of all that the image quality is well below my Panasonic FZ150's. The shots are soft, and slightly washed out in comparison. The camera is heavy but I liked that feature.  The grip is very comfortable, the memory card placement is very handy. I liked the Video button location.  The flash looks like it would break easily.  I would not recommend anybody buy this camera. Much better choices available. I'd give it one star if it were not for the few things I liked about it.UPDATE:About the zoom number of 42X. Rather than using the digital zoom capabilities to arrive at the 42X number I've now decided quite likely what they did to arrive at that number is by having you lower the resolution by some number in the picture size menu which would allow for a higher zoom number. Basically it's nothing but cropping.  My Panasonic FZ70 is rated at 60X. The number is arrived at by taking the focal length of the lens from  wide to max long into consideration. The Pany has 16 max of megapixels.  By changing my Panasonic to shoot using 5 megapixels instead of 16 the zoom increases to 196X. The zoom rate of a camera has always been listed as what range a camera can zoom in from it's widest focal range to is greatest zoom range on the long side using the maximum megapixels available. It's misleading to rate a zoom range using any other method. Looking back at my tests with the Fuji vs. my Panasonic and having both almost identical in the zoom factor I now thinking Fuji just pulled a fast one to achieve their 42X but using a lower resolution setting when taking a shot.", "Date": "September 19, 2013"}, {"Title": "Jose Gonzalez", "Author": "gonz33", "ReviewID": "R34D4TD1ILP28E", "Overall": "3.0", "Content": "Excellent camera, I've always been all FujiFilm HS-10/30 and now the HS-50 has more and better features, is a little more big and heavy but worth it, the only thing I didn't like is that the camera received with the menu already handled, when one buys a camera Fuji HS and turn it on for the first time, she asks you to select the language of your choiceWhen I turned it on, the English language was already selected and the date had already recorded, this is thus factory, for all the other was good buy, Amazon has to give me a gift for this lack.", "Date": "May 24, 2013"}, {"Title": "BIG point n shoot still small sensor and noise...", "Author": "kay bhee", "ReviewID": "R2YJG4Z7TR2NZ2", "Overall": "2.0", "Content": "why to spend so much money on this image quality ...unless u have no other camera near you ?there are dozen s of better cameras out there at these pricings...i did NOT buy this...did NOT buy 8200 model either,,that one had even tinier sensor and more noise and fuzz...not sharp enuff.againfor manythis is a default camera...it is better than the HUNDREDS out therewhich are far far worse...butu can do better..unless u dont care, and are satisfied at this level...ordont know  Better exists...shhhh... tis a secret...shhh", "Date": "September 5, 2013"}], "ProductInfo": {"Price": "$499.95", "Features": "Tilting 3.0-inch TFT color LCD monitor and electronic viewfinder with eye sensor\n16 million effective pixels 1/2-inch EXR CMOS processor with primary color filter and lens shift image stabilization.\nFujinon 42x optical zoom lens with approx. 2.0x digital zoom (up to approx. 84x with 42x optical zoom)\nFocal Length: f/4.4mm-185mm; Full Aperture: f/2.8-f/11 (Wide), f/5.6-f/11 (Telephoto)\nFull HD Movie (1920x1080p/60fps) with stereo sound", "Name": "Fujifilm FinePix HS50EXR 16MP Digital Camera with 3-Inch LCD (Black)", "ImgURL": "http://ecx.images-amazon.com/images/I/418p4zoeLsL._SX300_.jpg", "ProductID": "B00ATM1MGA"}}