{"Reviews": [{"Title": "Very Disappointed", "Author": "Lynne", "ReviewID": "R8OQXXGRP1Z3D", "Overall": "1.0", "Content": "I had read reviews for this camera in many places. Most of them were really good so I decided to try it.16 megapixel and 24x optical zoom.Now I am not a camera expert, but I do feel like I can use a camera reasonably well and I am used to using different settings. I can use a camera beyond just point and shoot.The first pictures I took were in my livingroom. I wasn't impressed with the focus and lighting. So I tried using flash, no flash, indoor setting, auto setting . .  hmmmWell, it was time to go to my daughter's school concert. At the school the kids faces all turned out yellow, I had one picture turn out and I don't know why that one did. (I even brought it home and took the sd card out to look at it on my computer to see if it was just the camera display, nope the pics were terrible).Then I tried to video. The faces were yellow on the video too. But even worse than that, if that's possible, there is NO stabilization!!!!Also, when you zoom in and out it does not stay focused and has to re-adjust the focus constantly! So in the middle on the video there is blurry spots where the camera was refocusing. Sometimes school events are hard to take pictures at due to the lighting (it was in the gym & I was in the front row)So I tried again at home. I had my daughter stand by her granddad. He turned out clear her face was blurry. I manually adjusted the exposure and ISO bypassing all the presets. That sort of helped.I did not try the camera outdoors. I know some cameras that don't do well indoors do great outside.The next day I reset all the factory settings and tried one last time to take a picture in the kitchen of my daughter, it was so blurry. That was it, packed it up and took it back.", "Date": "April 25, 2013"}, {"Title": "Disappointing purchase", "Author": "MsKat", "ReviewID": "R2EESA4HDVH7D0", "Overall": "2.0", "Content": "Camera takes too long to focus on subject. My subjects are primarily birds, and the bird is gone by the time the camera is focused. Camera design makes it awkward to hold.", "Date": "April 20, 2013"}, {"Title": "VERY Disappointed in my first Camera from Olympus", "Author": "Mike Swope", "ReviewID": "R3JOV9199TXDT1", "Overall": "1.0", "Content": "Olympus has had a good reputation in the camera world...or so I thought. My wife bought this camera for me for my birthday, and it is a HUGE disappointment. As another reviewer mentioned, this camera feels like it would break at any moment...light weight plastic construction. When you move the camera in your hand, you can feel something inside the camera move. No joke! Maybe it's the battery? Don't know. But you can sure feel the movement inside whenever you move the camera. The zoom, while 24x is very nice, zooming in is a problem. When zooming on my model, the zoom continues to zoom, even when I've removed the finger from the zoom button! This is true only when zooming in; not zooming out. The result, I have to rezoom back out to get my photo. Very time consuming in the world of taking photos! Also, when zooming past 24x, this camera does not focus...it's very odd. Doesn't even attempt to focus. Not clear what's happening here. I took about 35 photos with the camera, but they are all oversaturated. They were taken out of doors. My cheaper $120 point-n-shoot took truer photos! A freelance graphic designer who occasionally takes photos, I can't use this camera at all. It would make me look cheap, stupid, unprofessional. I really can't express well my disappointment with this camera. Don't buy it. That's it. Just don't buy it.", "Date": "July 7, 2013"}, {"Title": "Easy to Use & geat Pictures.", "Author": "jrtalent \"jrtalent\"", "ReviewID": "RYSEU1XKMAL4G", "Overall": "5.0", "Content": "There are a variety of settings to digitally alter pictures for fun. The software provided has a lot of Photoshop qualities including editing & file storage. The company is responsive when you have a question, I've owned a variety of cameras. To me, this is the best.", "Date": "July 2, 2013"}, {"Title": "Not What I Expect From Olympus!", "Author": "S. Deister", "ReviewID": "R11CS9ZT9TISXP", "Overall": "1.0", "Content": "I've been using Olympus cameras for over 30 years and have the full range from film to SLRs. I bought this camera because I wanted a bit more zoom than my warhorse Stylus 810 has, so that I have a \"pocket\" camera to take into concerts. I knew that this wasn't going to be a good experience from the minute I took this camera out of the box. Rather than having something that FEELS solid, this feels cheap and is made of light weight plastic.Olympus removed some of the traditional settings, such as bird watching, so you have to fumble around to figure out what's what. But!! that's ONLY after you make your way through a maze of what's not identified as a menu--the actual menu also has removed traditional functionality that's on other models, so you have to figure out where they've put those functions, too!To have the untrained user have to set their own white balance? Very poor!The latch on the bottom where the battery and memory card are both in the same slot feels like it could break at any time.The battery charger is doomed to die as it's a USB cord that can plug into device that you plug into a wall--that same cord is what you'll also use to download pictures using their crappy software that doesn't recognize the device until you unplug and replug several times. These two should be separated for the sake of the USB will wear out and need to be replaced--I can see already that this will run a small fortune to replace from the way Olympus has been heading!The \"shooting screen\" is useless in the sun, even with sun glasses! (OLYMPUS BRING BACK Eye viewers! They are the ONLY way people can actually SEE what they're shooting!!! These screens are a joke!!)Don't even get me started on the software that comes with this! They're far more interested in getting you to race off to some online company to upload and buy your pictures than allowing you access to them and editing them!The quality of pictures is the real disappointment. This isn't what I expect from Olympus! There's are massive yellow and green tinges in the pictures, not the rich blues and reds that I've come to expect!This was $160 wasted. Since I can't return it, I'll probably donate it to Goodwill, as this camera is such a piece of junk I wouldn't want a friend or family member to own it!", "Date": "July 7, 2013"}, {"Title": "Very Disappointed", "Author": "Michael R McMahon", "ReviewID": "R2R3PPNQGLK274", "Overall": "2.0", "Content": "I had very high hopes for this camera based on my very positive experiences with two previous Olympus cameras, but in the end was very disappointed.  Auto focus was inconsistent leaving pictures without good definition.  Colors were washed out compared to scenes being photographed.  Video focus was constantly hunting, resulting in playback that was sometimes very sharp, and others almost unrecognizable.  It has lots of great functions for taking photos, but unfortunately, that functionality didn't result in good pictures on many occasions.  On the other hand, some pictures came out great and were real keepers, but the inconsistency drove me crazy.  I’m not a professional photographer, but I do enjoy photography and have been engaged in the hobby for a long time.  This camera was not going to allow me to enjoy my avocation.  I returned it for a refund after three weeks and many disappointing photos while on vacation.", "Date": "February 1, 2014"}, {"Title": "Great little camera", "Author": "Ruth Laverty", "ReviewID": "R32WJCZS2WA5J0", "Overall": "5.0", "Content": "I have only had my SZ15 for a week now but I have played with it off and on and find it a marvelous little point 'n shoot.  I have went from a 35mm, down to smaller and smaller digitals thru the years.  Decided that they have finally gotten the little ones as good as the SLR size.  No, it will not do everything but this little camera is a workhorse.  The pictures have been great even in low light (using flash of course).  The easy of use is marvelous.  And I just love, love, love, the \"magic\" function.  No yellow people as mentioned in one review I read.  But you can get them if you want.  There's an app for that.  LOL  Actually it's one of the magic functions.  I ran across it by accident.  The only bad thing is there is no viewfinder and the LCD is very washed out in direct sunlight but that is typical.  But I still can't wait to use this little gem on our next vacation.", "Date": "August 9, 2013"}, {"Title": "Started Out Good", "Author": "Linda", "ReviewID": "RAXGRQH92UYI8", "Overall": "3.0", "Content": "It takes good pictures and zooms in fine, but after using it for 6 months it suddenly freezes up and I have to remove the battery and reinsert it to reboot it.  It then works fine for awhile and then freezes up again.  I have to now package it up and send it to Olympus for repair.  It's still under warranty but I have to pay the postage to return.  Hopefully it is returned repaired and working fine.", "Date": "April 18, 2014"}, {"Title": "Faulty build quality", "Author": "Pheonixisback", "ReviewID": "R1SJI2R73UTY0L", "Overall": "1.0", "Content": "Bought this to replace a point and shoot that died. Worst waste of money ever. The camera takes good pictures when it gets focus outdoors but that's when it gets focus. The zoom switch broke after two days of sightseeing use. PITA to try to get it repaired. Avoid this camera like the plague.", "Date": "December 19, 2013"}, {"Title": "Good value for the money, however", "Author": "Rusted Nut Garage", "ReviewID": "R12G5TCF03S8YK", "Overall": "4.0", "Content": "The fact that you get two batteries, a nifty little charger, a USB cable, and a small lens cloth make it very hard to go wrong.  If I were to put on my critical technician hat I would have to be somewhat skeptical of the batteries.  Please understand that they have not undergone significant usage in the field however they come in a generic box with out any indication of their capacity.  One would at least hope for a Miliampere rating of some kind.  There is no written information in or on the box that would provide any useful information.  Trying to research these on line proved fruitless.  However they are a prefect fit for the camera.  The charger is a nice compact size with prongs that fold out and plug in (nice travel size with no need for a cord) and it has an indicator led that changes from red to green when the battery has been fully charged.", "Date": "January 18, 2013"}, {"Title": "great", "Author": "Rick", "ReviewID": "R3EUVPRKWJHLPE", "Overall": "5.0", "Content": "works fast perfect for my cameras and with multiple cameras and extra betties  I never to worried there so small they fit in my pocket", "Date": "December 3, 2012"}, {"Title": "It all works!", "Author": "Blazer the Engineer", "ReviewID": "RWNNXU62WK16E", "Overall": "5.0", "Content": "It all works great with my Olympus ZX-12. I love having the separate charger. Haven't used the 12v adapter yet. With 3 charged batteries I can go a long time without charging. When the battery gets low I swap it out and charge it in rotation. I had misplaced my original usb cable so the package was perfect for me. Great price!", "Date": "November 29, 2012"}, {"Title": "GTMax 2x Replacement LI-50B Battery + Travel Charger with Car Adapter + Replacement CB-USB6 Cable + Cleaning Cloth for Olympus S", "Author": "Chuck", "ReviewID": "RA513XTO36IRW", "Overall": "5.0", "Content": "Nice package - no problems - everything as described.Great addition to the Camera Package- It's been all overOregon - rivers, coast and backyard. It's been all overNorthern California - rivers, Monterey Bay, and lakesnear Mount Shasta.", "Date": "September 8, 2012"}, {"Title": "Disappointig", "Author": "AB", "ReviewID": "RYWNR5DPCTU04", "Overall": "3.0", "Content": "After owning several Olympus cameras this last one has proven to be a let down. The latest design moved the video button to the back upper right corner where it interferes with the handling of the camera and always gets actuated when I am just holding the camera or trying to take a picture.  The auto focus on the camera hangs and you must turn the camera off and back on to reset.  The picture taking speed of the camera is very slow in both in natural light and with flash.  The flash is very weak.", "Date": "November 1, 2013"}, {"Title": "Dads Birthday", "Author": "Anthony", "ReviewID": "R1IXEOH5YQBETP", "Overall": "5.0", "Content": "It was a birthday gift for my dad and he loves it so much so thank you for having this item in stock", "Date": "August 16, 2013"}, {"Title": "great camera", "Author": "ying y lew", "ReviewID": "R1DAQNK6T5ET7G", "Overall": "5.0", "Content": "low price!its has many features for beginner photographer to take good photo. best buy with this kind  of price.I am very happy that I brought the camera.", "Date": "July 11, 2013"}, {"Title": "Works Well", "Author": "Charles Moyer", "ReviewID": "R3ITACAXTSS0GS", "Overall": "4.0", "Content": "Performs just as expected. I have no issues with the quality or performance of this camera. Right for the price.", "Date": "June 6, 2014"}, {"Title": "recommend", "Author": "Lori S Perry", "ReviewID": "R2QUVUI7IUQWJS", "Overall": "5.0", "Content": "Arrived very quickly. Both the in house and car battery charger works great ! The fact that it came with 2 extra batteries was a plus. Cant beat the price.", "Date": "May 19, 2014"}, {"Title": "great", "Author": "Estela Civit", "ReviewID": "R3CH6G090OHGYA", "Overall": "5.0", "Content": "It works great. I'm really happy to have it. I have taken many pictures and they look great. I would recommended this camara", "Date": "May 16, 2014"}, {"Title": "Love this camera, and the price!", "Author": "Patrick Gordon", "ReviewID": "RHERTPOICR85", "Overall": "5.0", "Content": "Great product, great pics, great value! For the money, this camera is an absolute steal. I've used it at family events, sporting events and more, and it always does the job.", "Date": "May 13, 2014"}, {"Title": "I  liked it, it was cheap and practical.", "Author": "rui kang", "ReviewID": "R1DHPZG0Q8W25O", "Overall": "4.0", "Content": "I liked it, it was cheap and practical. It makes me wonder zoom capability, but the focus needs to stand far away.", "Date": "May 13, 2014"}, {"Title": "Great Value", "Author": "Shad Finney", "ReviewID": "R32YUF0XL5OXXX", "Overall": "5.0", "Content": "A point and shoot with extra bells.  A nice feature is the ability to self adjusts apertures and such in contrast to auto settings that are over the top. Another neat feature is magic filter, built in special effects that make wedding shots soft, or people look miniature, just fun stuff. Aside from a massive 24x wide zoom, a macro setting is in the setting adjustment. I have shot some nice shots of sun sets and nature hike shots. The SZ-15 is great value for the money.  I found this at Wal-Mart $129, but already spent $139. The cameras also has a built in battery so you don't have to be worried about batteries. A lot of bang for the buck.", "Date": "April 13, 2014"}, {"Title": "ok/good", "Author": "gm8", "ReviewID": "R3DM3OILMZ3H66", "Overall": "4.0", "Content": "I like this camera overall. It takes a bit of time to figure out the proper scene mode for the time, and at times the Auto mode doesn't pick the right mode I thing.  It does shoot slow at times too. However, I am happy with the video features.  The quality and sound of the videos are even better than my camcorder, and I love all the zooming features.", "Date": "March 27, 2014"}, {"Title": "Great zoom", "Author": "loveflorida", "ReviewID": "R2MAI8RCX3DU5O", "Overall": "5.0", "Content": "Love this camera easy to use.24x optical zoom is great plus it has a digital zoom for dose who need it.", "Date": "March 2, 2014"}, {"Title": "works great and very inexpensive", "Author": "William Loskota", "ReviewID": "R3AU9PTZVQ78MG", "Overall": "5.0", "Content": "works great and very inexpensive.  what a deal for a nice piece of electronic equipment.  can't go wrong with this.", "Date": "September 19, 2013"}, {"Title": "Product as advertised", "Author": "BeeVee Ragan", "ReviewID": "R1NDECMO1LT6PA", "Overall": "5.0", "Content": "The charger that came with the camera was different than this one; the charger included the USB cable but was lost and this was the perfect replacement for it. We needed a charger and a USB cable and this fit the bill", "Date": "August 11, 2013"}, {"Title": "Hard to Review", "Author": "Doug4.7", "ReviewID": "R3134REPRL29HR", "Overall": "4.0", "Content": "This package is difficult to review.  First off, the items look NOTHING like the picture.  However, the batteries and cable work great.  On the other hand, the charger actually exploded. However, they did refund me some of my purchase for the smoking charger.  So I give them 3 stars for QA issues, but add a star because they did address the issue by giving me a partial refund.", "Date": "June 21, 2013"}, {"Title": "Great Product", "Author": "Vince Oaker", "ReviewID": "R2YIPIRMNS8XMD", "Overall": "5.0", "Content": "So far, the batteries are proving solid. To bad Olympus and their proprietary cabled connections are not more readily available. Glad to see 3rd party companies able to make/sell their products.", "Date": "June 17, 2013"}, {"Title": "Just what I needed.", "Author": "Rick Garner \"Finzleft\"", "ReviewID": "R36IBPK914MNEI", "Overall": "5.0", "Content": "The batteries have a long life, and the charger is very convenient.  It certainly makes my use of the camera a lot simplier.", "Date": "May 20, 2013"}, {"Title": "REPLACEMENT BATTERIES", "Author": "Pix4Kix", "ReviewID": "R2EXTPQU5WNCB4", "Overall": "5.0", "Content": "EXACTLY WHAT I NEEDED PLUS.  GREAT VALUE FOR THE MONEY.  RECOMMEND HIGHLY.  SO FAR HAS MET ALL OF MY EXPECTATIONS.", "Date": "May 20, 2013"}, {"Title": "Everything Came as Described", "Author": "nyc \"nyc\"", "ReviewID": "R3PQSAXOC5DTL5", "Overall": "5.0", "Content": "I was skeptical even after reading other reviewers that everything came with this package, but everything came in the package.  I was very happy to see all the things that were to come in the package came, and they all work really well.  Each item was individually packed and was new.  The two batteries really helped because I needed them on my recent cruise to the Bahamas.  I was able to switch the batteries out quickly and everything was small enough to carry in my small camera bag.  I have the Olympus SZ-12 and the two batteries worked great and the travel charger made it super convenient to charge the batteries independently from the camera.  I was able to charge one battery while still using my other batteries in my outings with the camera.  The car adapter came with the package, but I doubt that I will need to charge the battery in the car much.  The replacement CB-USB6 cable was useful in that it can allow me to connect to my computer.  I was surprised to see that they didn't forget the cleaning cloth as I've seen other sellers always forgetting this little minute item.  These batteries in this package lasted almost as long as the original battery that came with my camera.  I have to say that I liked this package.", "Date": "February 4, 2013"}, {"Title": "Great Value-pleasantly surprized", "Author": "Karen Lakey", "ReviewID": "R1ZMYAUOCUQK25", "Overall": "5.0", "Content": "I bought this because the sync cord that came with my camera got mashed in my suitcase and the cord Olympus offered was more expensive than this whole package. How nice to have 2 back up batteries, a charger and a 12 volt charger included for less money. Very nice!", "Date": "January 9, 2013"}, {"Title": "Perfect", "Author": "Amy Jane Daum", "ReviewID": "R3SMSW1JY6J715", "Overall": "5.0", "Content": "Exactly what I was looking for and priced right!  I haven't had the opportunity to utilize the new batteries yet (as they are for back up).", "Date": "January 7, 2013"}, {"Title": "Fast service good product", "Author": "CKindick", "ReviewID": "R2SAQSFR6U8QL", "Overall": "5.0", "Content": "Received my product fast and on time.  The product fit and works great. I will purchase from this company again.", "Date": "December 18, 2012"}, {"Title": "Good Buy", "Author": "Frances Burns", "ReviewID": "RYPM1ECCWHB0O", "Overall": "5.0", "Content": "I always want extra batteries and extra charger for my electronic items.  Don't ever want to be caught with a dead battery.", "Date": "November 24, 2012"}, {"Title": "Saved my TG-810 From Being Written-Off", "Author": "Chris Leow", "ReviewID": "R6A6DY4Q04F5R", "Overall": "5.0", "Content": "My TG-810's internal battery charger stopped working after a snorkling trip. Without a charged battery and the ability to charge the battery, my TG-810 was about to be a write-off. Until I found and ordered this battery and charger set. The GTMax batteries seem to last as long as the original + the external charger was extremely useful for keeping batteries charged while the camera was out in use. It gave my TG-810 a new lease of life. For that, I give it 5 stars.", "Date": "November 22, 2012"}, {"Title": "1 star is too much", "Author": "MARIBELL", "ReviewID": "RMVBTKJZI3H8D", "Overall": "1.0", "Content": "This is the worst camera ever all of pictures from my concert were ruin dont waste your money. When you snap pictures it takes for ever to shoot and the pocture quality is just plain horrible worst purchase ever is going right back.", "Date": "February 15, 2014"}, {"Title": "Worst Camera I ever used.", "Author": "Sydney Sheep", "ReviewID": "R25YIR550414LP", "Overall": "1.0", "Content": "It is one of the worst cameras I have ever used. I agree with all the others that gave it a bad review. And I suspect if there is one out of thirty that like it that person probably has a vested interest in the product. We have taken so many shots sometimes one after another (when the camera would let us) and one would be good and the next horrible. That feature of taking a picture then WAITING until camera is ready to shoot another, and if you press the button in a hurry it will just snap when it's ready. Never had that problem with any other camera. With the Canon and Panasonic when I snapped a picture and viewed it if I touched shutter button again camera went right into shooting mode and I could snap picture after picture as fast as I wanted. I could find nothing in the settings or on line that would correct that. Never will I purchase an Olympus again.", "Date": "November 3, 2013"}, {"Title": "so far, not so good", "Author": "D. J. Reilly \"pennypincher\"", "ReviewID": "RYDZZ3FPU9RR9", "Overall": "2.0", "Content": "first of all, did anyone else notice that the majority of the positive reviews for this item were not for the camera, but for an accessory package?I too have experienced the yellow people and the inability to focus.  I am not pleased at all, and even though I only paid $48.00 for this camera, it is going back to the store.  I guess you really do get what you pay for.", "Date": "April 11, 2014"}, {"Title": "great buy", "Author": "Scott Fillmore", "ReviewID": "R2RFMIC9EPPPFG", "Overall": "5.0", "Content": "I did not pay much but got a lot of needed items in this kit.  I would recoment it , if you are needing something for the Olympus camera that goes with the kit", "Date": "July 19, 2013"}, {"Title": "Charger is great,", "Author": "Richard", "ReviewID": "R1ZVKGBIM1KATU", "Overall": "3.0", "Content": "Charger is great and cables, but I wish they would post the MAH for the batteries. It seem like they have a pretty low value. But for the price still a great deal", "Date": "January 11, 2013"}, {"Title": "WELL WORTH THE PRICE", "Author": "Joseph D. Silverstein", "ReviewID": "R33I7MAY3VQB2O", "Overall": "4.0", "Content": "QUALITY IS AS GOOD AS ANY OTHER CAMERA OF THIS TYPE. THE TELEPHOTO LENS, AND THE DIGITAL ENLARGEMENT IS TERRIFIC. WHAT A QUALITY FEATURE FOR A CAMERA OF THIS COST. BRAVO OLYMPUS", "Date": "June 18, 2013"}, {"Title": "A Traveler.", "Author": "V. Edmondson", "ReviewID": "R15R3ZLETYL118", "Overall": "4.0", "Content": "I haven't really used it that much yet. I am going to be trying it out and working with it more as soon as it warms up a bit. But it seems to be as advertised.", "Date": "December 31, 2013"}, {"Title": "Great birthday present", "Author": "Be Bop", "ReviewID": "R3KUG1THFLVM58", "Overall": "5.0", "Content": "Gave this camera to my Son for his birthday, he loves it.  The camera has many features, and is the right size for travel, not so large that you need a camera bag, but large enough that you can see the adjustments and settings.", "Date": "October 14, 2013"}, {"Title": "Terrible", "Author": "MARY", "ReviewID": "R39M1AHAPWIZRI", "Overall": "1.0", "Content": "Terrible focus every pic blurry. Do not buy this camera I am so very disappointed.  I really hope to return this item for another product", "Date": "June 9, 2013"}], "ProductInfo": {"Price": "$199.99", "Features": "24X Wide-Angle Optical Zoom Lens (25-600mm equiv.)\n16 Megapixels\nHD Video with HDMI output and control", "Name": "Olympus Stylus SZ-15 Digital Camera with 24x Optical Zoom and 3-Inch LCD (Red)", "ImgURL": "http://ecx.images-amazon.com/images/I/51I92RFUTKL._SX300_.jpg", "ProductID": "B00AQ2BU7E"}}