{"Reviews": [{"Title": "Perfect for my needs.", "Author": "MillyJo", "ReviewID": "R30BKUE7FIOJTP", "Overall": "5.0", "Content": "I needed a camera that could be carried easily in a purse, could be used like a point and shoot camera, yet had controls if I wanted to use them.  I needed to take photos for posting on FaceBook and other internet groups, as well as take photos for personal use.  This camera came with everything needed and meets my needs perfectly.  I can either link the camera to the computer with a cable, or use a usb card reader equally well.", "Date": "August 17, 2013"}, {"Title": "A great gift!", "Author": "mary chervenak", "ReviewID": "R3H2QDGQP3DNY", "Overall": "5.0", "Content": "I bought this as a gift for my mother to replace her outdated digital camera from 2005. Arrived quickly and well packaged. Loved the bundle. Everything you need to get started was in there. Camera is super easy to use. My non-technological parents rave about its ease of use. Would recommend!", "Date": "October 2, 2013"}, {"Title": "WAS GREAT FOR TRAVELING", "Author": "Laurie \"Laurie\"", "ReviewID": "R30CYYJDYTBLO4", "Overall": "5.0", "Content": "We wanted a camera small enough to tuck in our pocket while traveling with a missions work team. This camera performed well, the pictures are great. The batteries could have lasted longer between charging. The only problem was the on button was easy to bump even while in the case and that probably contributed to the battery problem.", "Date": "September 19, 2013"}, {"Title": "SMALL EXCELLENT PICTURES", "Author": "alittlewiser", "ReviewID": "RI8KPAEE7CLQK", "Overall": "5.0", "Content": "when transfer pictures to my computer and expand them they are excellent quality with the kit the carrying pouch is just the right size for 2 extra batteries in the bottom then camera and the usb adapter was an excellent idea.", "Date": "July 28, 2013"}, {"Title": "Great pictures", "Author": "Angela J. Wortman \"hs mom md\"", "ReviewID": "R9PF7WCGAW4FW", "Overall": "5.0", "Content": "It takes great pictures and the red one is $134+ for the same camera. The whole package together is nice.", "Date": "July 13, 2013"}, {"Title": "Great Starter Camera", "Author": "G-Man", "ReviewID": "R3M0S3QW70CPUM", "Overall": "4.0", "Content": "Product was a gift for a young girl for Christmas.  Perfect sized for a young one and so many features.", "Date": "January 1, 2014"}, {"Title": "Well Made Camera!", "Author": "Richard Ketchledge", "ReviewID": "RA224KRP17AK0", "Overall": "5.0", "Content": "Excellent! I would recommend buying this camera! Has everything you will need for taking pictures. Is compact and easy to use also!", "Date": "April 19, 2013"}, {"Title": "Great as a starter camera", "Author": "S. Partington", "ReviewID": "R1MRNW8F77ZCF4", "Overall": "4.0", "Content": "It's fantastic with all you receive. My son is in seventh heaven with his excitement. The only drawback I currently see is the camera runs through batteries like crazy so definitely a plus with the rechargeable batteries and charger. Also, the camera itself seems...well less than what I'd thought it would be. For my ten year old son, he loves it. For an adult who uses your camera plenty of times I wouldn't switch to this one. It almost seems like going backwards.", "Date": "May 21, 2014"}, {"Title": "kodak easy share", "Author": "joseph r ayott", "ReviewID": "R1VPVOL4D5NFXT", "Overall": "3.0", "Content": "It's okay nothing more then that, but I chose it and researched it and you get what you pay for", "Date": "May 17, 2014"}, {"Title": "worth the money", "Author": "Red Truck Driver", "ReviewID": "R3MP6E4X5KY3N2", "Overall": "5.0", "Content": "I didn't pay much and feel I got the value I paid for.  Satisfied.  The camera is a basic one and the accessories were great.", "Date": "May 15, 2014"}, {"Title": "Watch out: NO MACRO OPTION", "Author": "K. Hamacher", "ReviewID": "R14S2INSU3YC8I", "Overall": "2.0", "Content": "If you want to buy a simple point and shoot, it is probably ok but I was very disappointed that there is no macro option. The minimum distance is about 4 feet and the zoom is not particular good neither. For the price I am sure I can do better.", "Date": "April 13, 2014"}, {"Title": "Not too good", "Author": "Andrew L. Stewart", "ReviewID": "R1A5UPPGK9629D", "Overall": "3.0", "Content": "My computer just would not install this camera. And Kodak does not offer install help anymore according to their web page. Had to return.", "Date": "March 5, 2014"}, {"Title": "sad valentine", "Author": "John C. Webber III \"johnnyC\"", "ReviewID": "R1SX4SU0LLVFDJ", "Overall": "1.0", "Content": "the camera bag is not the same as the picture the camera wont fit in it. the camera does not take good pictures, very blurry or to much grain in the pictures poor quality about little kid grade. 5x zoom does not work. I would not recommend this product if you want clear pictures.", "Date": "February 8, 2014"}, {"Title": "Good Value", "Author": "JL@HG", "ReviewID": "R30AS7UGG23JF5", "Overall": "4.0", "Content": "I purchased this as a Christmas gift for my granddaughter. She had a big smile on her face upon opening the gift, but then was a little disappointed. Please keep reading, because now she is thrilled with the camera and accessories. She had been using another camera in a class at school and expected this camera to \"act\" the same way. I was also disappointed not to find a \"macro\" button which I have on my camera and use everytime if take photos. Well, after spending an hour or so with the camera, she tried out all the settings and found what she was looking for and started taking \"selfies\" and photos of her other Christmas gifts and now she is happy with grandma again. I think overall this was a great starter camera for her to use until she has a cell phone to replace it. Thank you, Kodak, and thank you Amazon for this offer.", "Date": "January 1, 2014"}, {"Title": "Great Camera", "Author": "Yolanda", "ReviewID": "RVBZRVMTCRKRF", "Overall": "5.0", "Content": "Great camera, and I'm not technically savvy and it is truly a joy to use and upload pictures to the computer.", "Date": "November 14, 2013"}, {"Title": "Camera", "Author": "Jennie L. Helmick \"great gifts\"", "ReviewID": "R3TU8VMU6EBITU", "Overall": "3.0", "Content": "This camera doesn't take as clear pictures as my former Kodak Easyshare camera and it also has a 5 second delay before it takes pictures.  I have corrected the setting numerous times but it doesn't seem to help.", "Date": "October 29, 2013"}, {"Title": "great kodak camera", "Author": "IRISHNANNY", "ReviewID": "R2UN6T4MUTP7OL", "Overall": "5.0", "Content": "I am so happy with the great pictures the easy way to take pictures, easy to down load on my computer, I would buy this camera anytime", "Date": "October 2, 2013"}, {"Title": "headline?", "Author": "Dianne Ford", "ReviewID": "RR2CXH2SAYZRG", "Overall": "4.0", "Content": "the camera was awesome and the kit was as advertised but can not download my memory card after following the easy directons.", "Date": "September 19, 2013"}, {"Title": "Great Value", "Author": "BAMoilan", "ReviewID": "RZLLYOPNVJN8X", "Overall": "5.0", "Content": "This budget camera deal is a great value when you are looking for an inexpensive \"carry camera.\"  In my case the unit will be used to record experiences in Liberia West Africa during a medical mission trip.", "Date": "September 16, 2013"}, {"Title": "KOdak EasyshareC1505", "Author": "sally", "ReviewID": "RVZV0X969959C", "Overall": "5.0", "Content": "This is a great gift. The receipient loved it. Will recommend to family and friends. Love to the max. Was utterly surprised at the gift.", "Date": "June 22, 2013"}, {"Title": "its a nice stuff", "Author": "uddy", "ReviewID": "RYYE2600U0EW3", "Overall": "4.0", "Content": "I bought this camera for my younger one at school, they were excited about it. the only issue with the bundle was that the lens cleasing liquid was leaking and the tripod stand got rusted asa reult of the leak.", "Date": "May 31, 2013"}, {"Title": "I love it", "Author": "jewell's toy", "ReviewID": "R2JKEFMO2L00PL", "Overall": "5.0", "Content": "I love it so far haven't really used it but will be using it this weekend and if I have a change of mind I will edit this review", "Date": "May 24, 2013"}, {"Title": "support", "Author": "nancy love", "ReviewID": "R11YGOD74MUGFU", "Overall": "4.0", "Content": "great little camera, didn't know kodak was going out of the camera business, hope it is supported if i have problems", "Date": "May 14, 2013"}, {"Title": "Awesome delivery time and what I expected", "Author": "Michelle \"Michelle Huss\"", "ReviewID": "R3JUJFLB2U5LDW", "Overall": "4.0", "Content": "I just got the package today and I still need to start using it and I will not be able to give an actual review until after the first of the year. I am pleased to have the product several days before the estimated delivery date.", "Date": "December 28, 2012"}], "ProductInfo": {"Price": "$93.09", "Features": "12Mp Resolution\n2.4\" LCD Screen\n35mm Lens\nSD/SDHC Memory Card Slot\n5x Digital Zoom", "Name": "Kodak Easyshare C1505 12 MP Digital Camera with 5x Digital Zoom (Red) 8GB Package 1", "ImgURL": "http://ecx.images-amazon.com/images/I/512DkXORpeL._SY300_.jpg", "ProductID": "B00A7BF1JC"}}