{"Reviews": [{"Title": "This is an extraordinary camera.", "Author": "Lavender", "ReviewID": "ROVE648O4E02J", "Overall": "5.0", "Content": "I bought one of these to take on vacation to Hawaii. The screen on the back is larger than most and allows one to view the subject more clearly. The camera has many additional features. It is ready to use out of the box and very easy to operate. I had never owned a camera before and yet I was able to use this one with ease. A great value!", "Date": "July 6, 2013"}, {"Title": "Coolpix camera", "Author": "W. hall", "ReviewID": "R1IT0YMJ6TS9NY", "Overall": "5.0", "Content": "Love camera, replacement of one I lost, not sure of red color but when it came I love it! Very easy to take pics", "Date": "July 8, 2013"}, {"Title": "Nikon COOLPIX S4200", "Author": "JohnO", "ReviewID": "RVZXYFZX3IJG0", "Overall": "5.0", "Content": "just got it and tried many of the different options.movie recorder with audio works but probably better inside as u can hear the wind on the playback. I use the automatic settings and the landscape colors are great. if your fussy there are other options u can try. telephoto works great. installed the cd and transferred pictures with ease. also a lot if good information. great camera for the price. comes with needed cables and battery. battery holddown looks flimsy so use a little care installing the battery.", "Date": "June 28, 2013"}, {"Title": "Great Camera", "Author": "Alyssa", "ReviewID": "R2KYHIFGFJ3FPI", "Overall": "4.0", "Content": "I love this camera because it takes clear shots and centers the picture for me . Its easy to use and takes great sport shots.", "Date": "July 14, 2013"}, {"Title": "Awesome Camera !", "Author": "Hunter", "ReviewID": "R1GEGLUEJYBWS1", "Overall": "5.0", "Content": "That's awesome ! I bought it before go travel in Australia. Cheap price and hight quality. I also buy 2 memory cards too. This camera has many features and auto-shoot mode. You can easy to choose quickly and just point and shoot in the real meaning.Remember buy more memory card for this. You will feel lack of storage when shooting too much.Check this link for the cheap memory card, just 7$ for 8GbB007JRB0TC", "Date": "July 30, 2013"}, {"Title": "Great Camera!!!", "Author": "Lee Canada", "ReviewID": "R3UEHNIH1R613E", "Overall": "5.0", "Content": "This  camera is  a great  little  camera. It takes  very nice pictures. It  has  an assortment  of picture  sizes and  video  types. The instructions  are easy  to understand and  follow. Am really  going to  enjoy  this  camera. This  is our third NIKON camera we have  purchased and  we love  all of  them!!!", "Date": "July 11, 2013"}, {"Title": "Defective", "Author": "blumarlin", "ReviewID": "R3JDAEXPF5PW55", "Overall": "1.0", "Content": "I gave this as a Christmas gift.  The recipient took one picture and the camera then froze with the zoom lens out and a black screen.  Nikon support was of little help.  It was returned.  I did not order a replacement because I am now afraid of that particular model.", "Date": "January 4, 2014"}, {"Title": "My review", "Author": "B. Jones \"Jonesfsu\"", "ReviewID": "RDPFBVW905U06", "Overall": "3.0", "Content": "This is overall a good camera. There is a little problem with the memory card battery area, it does not close perfectly. Otherwise it's good.", "Date": "December 3, 2013"}, {"Title": "blurry pictures", "Author": "Slappy Blanco \"you betcha\"", "ReviewID": "R2SVZ24YOKLGWO", "Overall": "2.0", "Content": "This camera has a lot of nice features, clear crisp pictures is not one of them.  Played with the settings for a few days and put on a tripod to make sure it was not me moving and causing the issue.  Nope, its the camera.  Expected much better from a name like Nikon.  Will return this and try a Canon.", "Date": "July 1, 2013"}, {"Title": "For the price, this is an outstanding little camera!", "Author": "J. Hall", "ReviewID": "R1E7ANPSARZT3Y", "Overall": "4.0", "Content": "First off, I chose a 4-star rating by my own criteria, not as any kind of a camera expert.  I wanted an easy-to-use point-and-shoot-type camera that was small enough to fit in my pocket.  I wanted easy-to-read settings, a big display, and some zoom capability.  It takes lovely photos, though I haven't quite gotten dialed-in to how to get the best low-light (dusk/night) photos yet.  But I was never very good at that, anyway.  I did find, however, that with one low-light photo I took, when I downloaded the photo to my PC and lightened the image a little, it came out pretty darned good.  I think the longer the shutter is open, the steadier the camera has to be held.And I'm VERY happy with the HD video capabilities of this camera!  Because of it's tiny size, you do have to be sure to hold it as steady as possible while filming, but when you do that, you get AMAZING results!  I also like that I can take much longer videos with this camera than I ever could with the one in my cellphone.One of my favorite things about this camera is that you don't have to keep feeding it AA batteries, like I had to do with my old digital camera.  If I was going to use it all day, such as on vacation, I had to bring a big heavy package of batteries to feed it all day.  With the Nikon Coolpix, I LOVE the rechargeable battery, and the battery seems to have a long life.  I have yet to run out of battery charge before I'm finished taking photos.  I also love that it fits neatly into the back pocket of my jeans, or even into my little coin-purse.  The small size makes it easy to always have it with me, so as not to miss a good photo opportunity.  I also love the red color (it matches my red cellphone!)  So it's easier to find if it's at the bottom of my backpack.  I didn't have a lot of money to spend, so finding a camera with so much capability relative to the low price was extremely important to me.(PS:  I noticed the price listed above was $109.99.  I bought mine for around $79.00.)It arrived quickly, and in perfect condition.  I've had no problems with it whatsoever, and as an amateur photographer who mainly takes photos to print for myself, share on Facebook, or send in emails, I'm very happy with my purchase.", "Date": "May 5, 2014"}, {"Title": "Difficulty downloading to picture file", "Author": "Kathryn Puckett", "ReviewID": "R30LX54K15ACMZ", "Overall": "3.0", "Content": "The soft ware for this new camera won't work on my aging computer. I found I can download via USB cable with current program  but could  not get memory card to download as previous Kodak Easy Share had done (before I dropped and cracked the case).", "Date": "February 9, 2014"}, {"Title": "Good camera", "Author": "Miss D.", "ReviewID": "R31GAH23JDB7AS", "Overall": "3.0", "Content": "I haven't actually used this camera a whole lot since I bought it, but my impression so far is that it's good.  The pictures are very sharp and I love the touch screen aspect of it.  I do love the color and the compact size; I can take it in my purse with me wherever I go, it's real convenient.  The cons of the camera: the zoom part of the camera is not that great; the closer the object the more blurry it is.  Also, even though it has Image Stabilizing you still have to hold your hand real still when taking a picture to avoid blurriness (this may have to do with its small size, but not sure).  I'm not complaining a whole lot though because I only paid $90 for it, however, had I paid the original $300 price I would be more than likely returning it.", "Date": "January 28, 2014"}, {"Title": "A great camera for vacation", "Author": "Ernest", "ReviewID": "R3J5SDC5V4RZW6", "Overall": "5.0", "Content": "I bought this camera for my vacation over the summer. It was well worth buying. It take wonderful pictures and lightweight to carry around. The touch screen is a little sensitive but most touch screens are. I really can't compare it to any other camera because i never really had a digital camera before.", "Date": "December 31, 2013"}, {"Title": "Point and shoot.  Very easy operation.  Just what my wife ordered.", "Author": "budsims", "ReviewID": "RYTEKVLNMYOA2", "Overall": "5.0", "Content": "My wife wanted a camera that would take good clear photos but was a point and shoot.  You can/t go wrong with a Nikon.", "Date": "November 4, 2013"}, {"Title": "great", "Author": "Jason C", "ReviewID": "RAT45KPKMMYGM", "Overall": "5.0", "Content": "We love our new camera we used it on our most recent trip to Florida. Our daughter loved taking pictures", "Date": "October 1, 2013"}, {"Title": "Nikon Cookpix S4200", "Author": "NWB", "ReviewID": "R2IM7COE5BMD1Q", "Overall": "5.0", "Content": "I like my little Nikon Coolpix.  The only negative so far has been that it's hard to keep some of the pictures from blurring - especially when using the zoom lens.  However, the convenience and ease of use if a real plus over my bulkier digital camera.  The price was a main factor in this purchase and I feel like I got good value for my investment.", "Date": "September 29, 2013"}, {"Title": "Why I love this camera", "Author": "L. Porter", "ReviewID": "R2BX6IQWQD2ZJN", "Overall": "5.0", "Content": "I have had many many point and shoot cameras.  This one has unbelievable clarity, focus and zoom. Yet is small, light and cool looking (I have Red).  I just love it", "Date": "August 4, 2013"}, {"Title": "Takes horrible pictures", "Author": "James", "ReviewID": "R1TO0N2U7KO55Y", "Overall": "1.0", "Content": "Horrible indoor and outdoor photos. Do Not buy! You will be disappointed. It also takes forever to take multiple photos.", "Date": "December 13, 2013"}, {"Title": "Thank goodness for warranties!", "Author": "C. Walton \"Jewelry Junkie\"", "ReviewID": "R3FNFKG17X868C", "Overall": "1.0", "Content": "I use a lot of these cameras at work, with very heavy usage (and abuse), so when I wanted a point and shoot for personal use, I bought this one.  It worked wonderfully the first time, but two weeks later when I used it again it wouldn't turn on, saying the battery was depleted.  It had been on the charger all night before and we even swapped batteries, but with the same result.  It's headed back to Nikon even as I type this.  I do know from work experience, that Nikon is very good at honoring it's warranties, so I anticipate getting it back in good working order.", "Date": "May 30, 2014"}, {"Title": "whom ever said this camera takes blurry photos...i just don't know how", "Author": "Heidi M Huff", "ReviewID": "R2U21IEL181JAE", "Overall": "5.0", "Content": "The pictures are clear and crisp. The video is wonderful. The camera is soooooo easy to use. It is elementary.I recommend this for anyone.  Do not believe the blurry photo stuff.  I couldn't figure out how in the world they were getting blurry photos. They must have a wrong setting,  or something.", "Date": "April 5, 2014"}, {"Title": "new user", "Author": "Lynne Saxsma", "ReviewID": "R1U8ZJ1X0NZT5M", "Overall": "4.0", "Content": "So  far so good...have not used it a great deal yet and am still learning to use all its capabilities.  the bottom door needed to open to charge it seems a bit \"light weight\" and seems to me that it will break off easily.", "Date": "February 8, 2014"}, {"Title": "Great Camera", "Author": "Lawrence O.", "ReviewID": "R2CY7H3NNXXO9S", "Overall": "5.0", "Content": "Great camera at a great price.  I bought this camera for my wife to use.  It is simple to use and takes great photos and videos with sound. I bought a separate high capacity Ultra San Disk for extra storage for my wife to use for all of her photo fun!", "Date": "January 19, 2014"}, {"Title": "Great Camera", "Author": "Judy Naples", "ReviewID": "R17DGOIMQU9V9P", "Overall": "5.0", "Content": "I just got this little  camera, and I love it!  It is my second Nikon..  I'm still trying to learn all the features, so far it is fantastic!", "Date": "January 8, 2014"}, {"Title": "Really nice camera", "Author": "SheAll", "ReviewID": "R2ZRHG3UWYVQ3C", "Overall": "4.0", "Content": "Really like our new camera with it's slick color, easy playback & more.  It's lightweight & pictures have such clarity.", "Date": "October 2, 2013"}, {"Title": "nikon coolpix camera", "Author": "carol dooley", "ReviewID": "R3JA5WTEDETPQ1", "Overall": "5.0", "Content": "I was hesitant about getting a digital camera but a relative of mine has a similar one & I needed a camera. This is the best one! So many features, very easy to use, & a good price. I would recommend it to anyone who was in the market.", "Date": "August 26, 2013"}, {"Title": "Nike Digital Camera", "Author": "Joan Howerton", "ReviewID": "R2NGV8UYH6GBZN", "Overall": "5.0", "Content": "This is the nicest camera I've ever owned.  It's light weight, attractive, and takes beautiful pictures.  Nikon makes a great product.", "Date": "August 9, 2013"}, {"Title": "Summer Vaca", "Author": "Elizabeth Carroll", "ReviewID": "R2D3Y7IKOC486X", "Overall": "5.0", "Content": "I bought this for my summer vacation and even though I can't use all the special aspects, I got great photos and I look forward to experimenting with it in the future.", "Date": "August 6, 2013"}, {"Title": "On time but inoperable", "Author": "Terry Mills \"TerryMKC\"", "ReviewID": "R3OPQGLZ7VSIYD", "Overall": "1.0", "Content": "I ordered this camera with 1 day delivery so I could use it over the weekend. It showed up in time on Saturday, but I was extremely disappointed because the camera wouldn't turn on and the battery wouldn't charge. It is probably a bad battery but It has a special battery that can't be picked up at a local store in my town, so I was out of luck and without a camera when I wanted it.", "Date": "September 16, 2013"}, {"Title": "good pictures, slow turn around", "Author": "vetmom", "ReviewID": "RHMNF5C3L181K", "Overall": "4.0", "Content": "This camera is very easy to use and takes good pictures. I like the touch screen and ability to zoom with it. The quality of the pictures definitely decreases as the zoom increases though. Also it seems to take longer than usual (5 - 10 sec) before you can take the next picture. If I has [aid full price, I would be disappointed but got a good deal on Amazon so I'm happy with it!", "Date": "August 6, 2013"}, {"Title": "Nikon Coolpix S4200", "Author": "Forrest Walker", "ReviewID": "RJ8SN5LL1A8G4", "Overall": "5.0", "Content": "I like the huge 3 inch touch screen. Price was great. So far it meets expectations. Came on time with no damage.", "Date": "August 1, 2013"}, {"Title": "Just what I was looking for.", "Author": "Stephen R. Payne", "ReviewID": "R13O689XEST9JJ", "Overall": "5.0", "Content": "I love taking pictures so much that I decided to purchase this beautiful Nikon camera. I bought this particular camera because of it's size. It fits very nicely in a belt loop carry case measuring just 4 1/2'' long, 3 1/4'' wide and 1 1/2'' thick. The case not the camera. The camera it's self measures 3 3/4''long, 2 1/4'' wide and 3/4'' thick. The pictures produced are sharp and clear. The motion picture capabilities of the camera are about what you would expect. Nice at the low end of the zoom and a bit grainy when at the high end. All in all I do like this camera a great deal and I would highly recommend it to anyone looking to pick up a nice pocket shooter for vacation purposes or just an everyday 'have in case something comes up' camera. Remember to pick up a nice carry case in order to protect your purchase. Also give some thought to a back up battery  # EN-EL 19. This is a 'In the camera' charging system so the purchase of an extra charger is not necessary. Best wishes...Steve....PS. Remember to pick up an 8GB SD card for your camera. You will need it in order for your camera to store more pictures.", "Date": "May 25, 2014"}, {"Title": "Very happy with this camera", "Author": "Amazon Customer", "ReviewID": "R367VSFTMM20HC", "Overall": "5.0", "Content": "I plan to give this camera to my granddaughter. I currently own anther Nikon Coolpix camera, and enjoy it very much. I love the color of this one. It is so easy to use. It is a little awkward to charge the battery, however, it is easy to adjust. It is definitely worth the price that I paid. I will definitely shop this vendor again.", "Date": "May 24, 2014"}, {"Title": "Sharp pictures", "Author": "Daffy", "ReviewID": "R1E2V2PKQ5NRSS", "Overall": "4.0", "Content": "Easy to use .  Don't have to focus. Great for vacation and save space for packing.  Can't wait to use it on my son's graduation.", "Date": "May 19, 2014"}, {"Title": "recommend", "Author": "SAG123", "ReviewID": "R1FIFYF70S572V", "Overall": "5.0", "Content": "Great price, great camera, very light weight highly recommend if 6X optical zoom works. Your ready don't need more with all those mega pixels", "Date": "April 28, 2014"}, {"Title": "Awesome Camera", "Author": "Michelle R. Kidwell \"Michelle R Kidwell\"", "ReviewID": "R1DD2PC8DZB4L3", "Overall": "5.0", "Content": "I got this from my family as a gift and i must say i love it the pictures come out beautifully...", "Date": "April 4, 2014"}, {"Title": "Touch Screen", "Author": "Beachgirl", "ReviewID": "RR2BH7UPVKPWR", "Overall": "5.0", "Content": "I love the addition of the touch screen and it is a good point and click camera.  Quality is fine and met expectations.", "Date": "February 27, 2014"}, {"Title": "awsome", "Author": "Nancy Etheridge", "ReviewID": "R3CGE88XJ0ZQ9S", "Overall": "5.0", "Content": "I absolutely love this camera, very easy to use and love the color. takes great pictures of my dogs,  love it!!", "Date": "February 21, 2014"}, {"Title": "I love this Nikon digital camera in red", "Author": "Doreen S. Davidson", "ReviewID": "R2AU68B5ECGQ7G", "Overall": "5.0", "Content": "It is a wonderful digital camera and easy to use.I love the red color so it I put it down, I can find it easily.The pictures come out great!", "Date": "February 15, 2014"}, {"Title": "Great Gift", "Author": "S. Symmes", "ReviewID": "R3QIC9ELK93OBM", "Overall": "5.0", "Content": "My daughter-in-law is thrilled with her new camera.  Seems to have been a good purchase.  Does and good job and cute to boot.", "Date": "February 6, 2014"}, {"Title": "good product", "Author": "Mitch B.", "ReviewID": "R3HXGNHP4ZD2EW", "Overall": "4.0", "Content": "good product....love the 720 P....needs more explaination about use of memory cards (must use 10 gig fast card...not standard 2 gig...not explained) telephoto zoom can't control speed of zoom...all  the same fast zoom in without operator choice ...had to use zoom in post production software to slow down speed", "Date": "January 27, 2014"}, {"Title": "Great camera for the price", "Author": "Carolyn F. Hickox \"Carolyn, aunt-in-law\"", "ReviewID": "R30D4ILQSB4Q71", "Overall": "5.0", "Content": "Got this simple to operate camera for my husband and he loves it! Takes great photos and is very easy to use.", "Date": "December 23, 2013"}, {"Title": "Great Little Camera", "Author": "Bob Shoreman", "ReviewID": "R23NPHPQ1A3CXG", "Overall": "5.0", "Content": "As represented, fast ship.  Takes great pics.  Video works good, too.  Small size makes it easier to carry than my Nikon D3000 with assorted lenses when traveling.  Excellent value.", "Date": "August 13, 2013"}, {"Title": "Nikon COOLPIX S4200 16.0 MP Digital Camera - Red", "Author": "krasimir", "ReviewID": "RTPZ2U9UYWBH2", "Overall": "5.0", "Content": "Create your best photos and HD movies yet with the stylish COOLPIX S4200. With 16 Megapixel CCD sensor, electronic Vibration Reduction (VR) image stabilization system, creative in-camera effects, 20 scene modes and more, you'll achieve beautiful results in any setting. And controlling the camera is a breeze thanks to its intuitive 3.0-in. touch screen. Style and performance, together in harmony.Ultra-slim elegance and intuitive touchHighly capable zoomSpecial effects and Filter effectsCapture the moment in style. Create your best photos and HD movies yet with the stylish COOLPIX S4200. With 16 Megapixel CCD sensor, electronic Vibration Reduction (VR) image stabilization system, creative in-camera effects, 20 scene modes and more, you'll achieve beautiful results in any setting. And controlling the camera is a breeze thanks to its intuitive 3.0-in. touch screen. Style and performance, together in harmony.", "Date": "June 24, 2013"}], "ProductInfo": {"Price": "$299.99", "Features": "16 megapixel CCD sensor 6x optical zoom lens (35mm equiv: 26-156mm)\ne-VR (electronic vibration reduction) 3.0 inch 460k-dot LCD touchscreen\nSmart portrait system 720p video recording\nISO 80-3200 5cm minimum focusing distance", "Name": "Nikon COOLPIX S4200 16.0 MP Digital Camera - Red", "ImgURL": "http://ecx.images-amazon.com/images/I/41%2BB4A7vSBL._SX300_.jpg", "ProductID": "B00AR5FJNQ"}}