{"Reviews": [{"Title": "I'm very pleased", "Author": "Elizabeth L.", "ReviewID": "RB2OJQ066KIXA", "Overall": "5.0", "Content": "It was probably a stupid thing to do, but I'm glad I did it.  I'd been looking for a new camera for a while, but no matter what brand or price of camera, the reviews all had a few negative comments that made me reconsider my purchase.  So when Amazon posted the Olympus Stylus SZ-16 for advance purchase months before it's release, I decided to take a chance - no reviews meant there couldn't be any negative ones.I'm really very please with the camera - the zoom is amazing, the shutter is fast, it does really well in low-light situations - I've rarely need the flash.  Plus it has some fun features, for taking \"dramatic\" or \"pop art\" photos.  Also has setting for fireworks, sports, and two pet modes (Camera automatically snaps a pic when it recognizes the face of a dog or cat - I mention this because this feature amuses me, I haven't tried it yet.)Way back in high school I bought a Pentex SLR which I used for years, and took great pictures, but it was difficult to lug it, plus the lenses and flash around, and when digital came along, I switched to point & shoot.  My pictures where never as great as those taken with my SLR, and I had assumed that I had lost whatever \"it\" was that helped me take great photos.  With my new Olympus Stylus, I have \"it\" back.  Turns out that the right equipment helps make a great photographer.  (And how lucky are my all my Facebook friends to be regularly treated to my awesome photos? - Actually, I'm appreciative of their indulgence of me.)My one little quibble is that the USB cable port is behind a small door on the side of the camera that has a rubber hinge.  I'm not optimistic about that hinge lasting the useful life of the camera.", "Date": "May 10, 2013"}, {"Title": "Early review and contents of camera box", "Author": "Amazon Customer", "ReviewID": "R1H5XI8TZ7TPC8", "Overall": "4.0", "Content": "I just received my camera today.  This review is actually to correct an answer I received from someone.  There is no list of what you get in the camera box.  Here's what you get:1.  the camera2.  camera safety cord - long enough to wrap around your wrist - not your nect3.  1 Li-ion battery (not charged when you get it)4.  CD ROM with 84 manual about the camera; software to view the pictures / video you've taken; software link to register your camera with Olympus5.  a.  USB AC Adapter cord - install the battery which is not charged in the camera.  Connect the cord to the AC adapter and let it charge the battery inside the camera.  It takes about 3 hours to charge.5.  b. USB AC Adapter cord is also be used to download pictures and video from camera to your computer.  This is also used6.  Quick start printed instructions7.  Warranted from Olympus printoutI wanted this information before I bought and it wasn't available.  I hope it helps you.", "Date": "December 17, 2013"}, {"Title": "Olympus Stylus SZ -16: great camera!", "Author": "regina keith", "ReviewID": "R3JTZZOHN0EJ2K", "Overall": "5.0", "Content": "I'd like to start off that the customer service was amazing with very fast responses!I bought this great camera because I wanted one that had a nice zoom without the bulkiness of a big camera.  I was at my daughter's softball game and sitting from the bleachers, I zoomed in close enough to see her face when she was batting. It takes excellent pictures from far away. The pictures don't come out grainy when you zoom in and print them out.The camera is very light weight and has many options/features. I'm still trying to navigate through those so I can't really comment on it. My main buying incentive was the price, the zoom and overall size of the camera. I bought it in white because I have a white iPhone and iPad and wanted everything to match.This camera has exceeded my expectations. I hope you find this review helpful. Good luck!", "Date": "July 13, 2013"}, {"Title": "So much packed into such a small camera!", "Author": "one voice in the crowd", "ReviewID": "R3JHSV6397C2OY", "Overall": "5.0", "Content": "My husband wanted a small camera that he could use to take photos (as well as video) on a trip to Hawaii, some upcoming weddings, and to shoot reference photos for paintings that he would create at a later date.  He is notorious for not wanting to spend much money on something, and then later regretting that he chose something that didn't have enough of the features that he needed.On this occasion, I was happy that he didn't just go for the cheapest thing out there - he actually did a tremendous amount of online research and spent a little more than his normal budget, and he is THRILLED with this camera.  Part of his joy comes from that fact that this camera performs as well (and sometimes better) than cameras on which we have spent far more in the past (including a semi-pro digital video camera we spent over $1,000 for about 12 years ago).Granted, the video function has some drawbacks: the zoom is VERY harsh (not smooth/subtle at all), and the sound drops out momentarily during the split second zoom.  However, that being said, the digital stabilization is VERY good, which is a big help in situations without a tripod.  (Obviously, the farther out you are zoomed, the shakier your shot will be no matter what you do.)  The zoom feature is surprisingly robust, with very good quality - great for nature shots, and at weddings where you are far away from your subjects.  My husband loved the fact that there is a grid feature for the viewer that allows you to keep a straight horizon line (for video and photos), which has always been a struggle / pet peeve for him.The settings on this camera are helpful: he utilized the \"sunset\" setting very successfully in Hawaii and got shots that rivaled (and sometimes surpassed) those from my $1,000+ Canon20D digital.  I, personally, find menu-based controls too confusing, and I thought that he would, too (he has very short patience for technical things), but he mastered the menus/functions extremely quickly, so maybe I would be able to learn them, as well, if I was sufficiently awake?I also thought that this camera would be too small for my husband's hands - I know that I struggled a bit to keep a grip on it, being spoiled to the rubberized grip on my Canon - but he doesn't seem to have a problem.  (He DOES keep the long neck strap that he bought for it around his neck at all times for safety.)  I noticed at the Olympus website that there appears to be an accessory you can get that provides a grip and attaches to the bottom of the camera - this may be worth investigating...As with all digital camera preview windows, it is often impossible to see whether you are getting your shot when you are in bright conditions, but we were both astounded when reviewing our photos/video on the computer later at how often shots came out not just well, but beautifully, when the preview window made it seem as if they would be washed out.One small negative (but not enough to take away from the 5 star rating) is that the latch on the battery door is not spring-loaded, so the door will not stay closed if you do not move the latch to fasten it.  I am spoiled to my Canon's spring latch, so I have to be VERY careful when loading the battery into the Olympus.  And as will most digital cameras, the door hinges on the compartments for the ports are very delicate/tricky, but if you are sufficiently patient/careful, they aren't a problem.All in all, my husband feels that this is one of the most satisfying purchases that he has ever made.  He recommends this camera without hesitation.", "Date": "September 1, 2013"}, {"Title": "The good and the bad.", "Author": "Star rated Walter", "ReviewID": "R2BDFTLJBDGKQW", "Overall": "3.0", "Content": "The Olympus Stylus SZ-16 has good and bad features.Pros:1. Excellent zoom quality for such a relatively small camera.2. Great image stabilization.Cons:1. One can take rapid fire pictures; however, there is a recording delay  of 2 -3 seconds before one can take another shot if you are taking single shots.2. It requires six steps to delete an image.3. No printed manual included.  Only a CD is included.", "Date": "January 5, 2014"}, {"Title": "Excellent camera", "Author": "Carol Thacker", "ReviewID": "R27K4IU455HIFC", "Overall": "5.0", "Content": "I've been buying Olympus cameras for a few years.  I value the ability to zoom so that I can compose shots with minimal walking around and Olympus seems among the leaders in telephoto zoom for sub-SLRs.  Also, sticking with one brand minimizes the cost of transitioning from one camera to another.  The SZ has a 24-power zoom combined with wide-angle zoom so for many shots I can quickly compose the shot one-handed, with just my finger moving from the zoom knob up to the shutter button.  I like having the menu quickly available on the view screen.  I had to switch to a different memory card with this camera but the card holds close to 5,000 pictures so that's not a big drawback.  The SZ is deeper front to back than my Styluses, so it's bulkier to carry in a pocket, but it's well worth it to have such powerful features.  My last observation is that the construction seems lighter, less sturdy than that of the Styluses.", "Date": "June 21, 2013"}, {"Title": "Such an underrated camera. Best one I've ever had.", "Author": "DieterDT", "ReviewID": "RO69OPYTXXPRM", "Overall": "5.0", "Content": "This is such an underrated camera -true Olympus is not the best known brand and they certainly don't make much fuss when launching a new line of cameras, but even here the comment list is so scarse-.I've owned a few camera's up to date (Nikon, Panasonic, Sony) and I'll have you know that this one is, without a doubt, the best one I ever had.It has so many features (panorama, fish-eye effect, pop art effect, and such), a beautiful design (metal and stained Reflex Camera-like plastics) and a wonderful image quality): much much better than its Sony, Panasonic and Canon counterparts (especially looking at cameras from the same price-level).If you doubt between this and one of the mentioned other brand... go for it! I can guarantee you: you will not be disappointed.", "Date": "June 28, 2013"}, {"Title": "For a point and shoot, this camera has met ALL of my expectations!", "Author": "Michael S. Boren", "ReviewID": "R2OPJW285JSZ3K", "Overall": "5.0", "Content": "When looking for a point-and-shoot camera, I had recently given up an extensive hobby of photography using an Olympus Evolt E-620 Digital SLR Camera.  Expectations for a point and shoot were therefore high, with some reservations to whether or not I could remotely find something that would allow me to have fun and be creative while still grabbing eye popping pics.  So after weeks of research and reviews, I chose the Olympus Stylus SZ-16 iHS Digital Camera.  In short, I'm extremely pleased with the camera through and through.  Does it come close to my old SLR Olympus for pix clarity and quality?  No.  However, for a camera under $230, I'm amazed at the quality it does have, as well as the simplicity of use, long battery life, quick picture taking, quiet & quick zoom for pic and video taking, great macro, surprisingly good low light pics, and simply the over all quality of pics (if not looking to close at a picture on your editing software).  Remember, this is a point and shoot not an SLR.  With that in mind, take a look at these pics (some are from my SLR and some are from the Stylus SZ-16 iHS) and judge for yourself the quality behind the camera.  [...]", "Date": "August 13, 2013"}, {"Title": "awesome camera", "Author": "beachgal", "ReviewID": "R1PWG95KHR2RNJ", "Overall": "5.0", "Content": "i LOVE this camera!!  the night photos/low light shots were truly amazing...i also played around with the \"magic feature\"...awesome pics!  am looking for a polarizing filter...my landscape photos were not as spectacular as i would have liked...", "Date": "April 29, 2013"}, {"Title": "Extremely easy to take great pictures", "Author": "Dragon King", "ReviewID": "R1ZRS0LCSD97BJ", "Overall": "5.0", "Content": "I have always been a Canon person, but I have been extremely happy with this camera.  It is super easy to take great pictures with.  The auto mode works absolutely amazingly.  I almost never manually select any of the modes.  Since I take the pictures, myself, I tend to be overly critical of them, but my friends (even ones who are amateur photographers) are stunned that this point-and-shoot has such accurate colors.  The zoom is also amazing, and I love being able to take 1080p video.  I've been surprised at how well the flash works, too.  Being a 16 MP camera, there is some graniness, when you zoom in really close, on the pictures.  Also, when taking video, you can hear when you zoom in.  Those are the only negatives I can think of.  At this price, I would recommend it to pretty much anyone.", "Date": "September 3, 2013"}, {"Title": "Great Features for a Great Price", "Author": "R. C. Junkins Sr. \"omnidj\"", "ReviewID": "R1DNNOHK9JPTM6", "Overall": "5.0", "Content": "The positive Amazon reviews sold me on this camera. I agree with every positive review, as well as the cautionary notes about battery life. That's why I also purchased a spare battery and charger. The quality of the pictures is phenomenal for a camera in this price range, and the zoom feature works extrtememly well, allowing me to capture photos of birds at my feeders that I never thought I'd get with a P&S; camera", "Date": "July 31, 2013"}, {"Title": "Great camera", "Author": "kathleen doerr", "ReviewID": "R20T1C2RCSGIIA", "Overall": "5.0", "Content": "This is with out a doubt the best point and shoot camera I have ever owned. I hike daily in the mountains and take a minimum of 40 pictures every day from wild flowers to action shoots of wildlife, and the results are amazing. A large DSLR camera would be just too large and cumbersome to carry, and the SZ-16 fits in my coat pocket comfortably. Shooting on automatic gives you fantastic images whether you are shooting macro or telephoto.  By experimenting with the different setting you can get very close to professional results. The image stabilization feature is somewhat loud when taking 1080 video but when shooting long telephotos it does an amazing job. Most low light conditions are handled automatically and I very rarely ever use the manual pop up flash. The camera is that smart.  I suggest purchasing an additional battery and plug in charger so you always have a backup.  Our friends look at these images and ask what kind of DSLR camera I bought. I have four friends who have purchased this camera after seeing our results and they are all thrilled with the camera. It seems that Olympus is going backwards on the new model camera. I have friends with the newer model and they get nowhere near the results we get with our SZ-16. We highly recommend this great little camera.", "Date": "May 6, 2014"}, {"Title": "Turns bad amateur photographer into good amateur photographer", "Author": "Stewart Thomas \"teacher, cultural anthropologist\"", "ReviewID": "RL1XMOIBQZ8K", "Overall": "5.0", "Content": "I chose this camera because it is a Consumer Reports best value in the Mega Zoom category of digital cameras.  I've been able to take some really amazing action shots (sports) and I've enjoyed playing around with the \"Magic\" features (special effects).  One of the other reviewers complained that it was difficult to delete bad shots, but I disagree.  It takes only two steps to delete a photo.  It is superior to my old compact digital camera in every way.  I wish I'd bought one sooner.", "Date": "April 13, 2014"}, {"Title": "This camera is just what I wanted", "Author": "B. Crawford \"Kindle Instructor\"", "ReviewID": "R2TLP5UVA8ODNZ", "Overall": "5.0", "Content": "The Olympus Stylus SZ-16 replaces a previous, and much older, Olympus. I liked the old one and this is even better.I like the image stabilization and the zoom range. I use a small amount of zoom to help offset the wide-angle distortion (not bad but noticeable.)The SZ-16 does not come with an SD card. In addition to that I bought two extra batteries and a separate charger to insure I always have a fresh battery when I need it.The camera is on the small side for my hands. But I can hold it easily and use it without any problems. A virtue of the smaller size is that everything, camera, extra batteries, and charger all fit in a fairly small case I already had.This is a good camera for snapshots and that's why I bought it.", "Date": "February 21, 2014"}, {"Title": "Love this Olympus camera.", "Author": "Richard McBryde", "ReviewID": "R1OG6S45EO8MJO", "Overall": "4.0", "Content": "I bought this camera for my wife for Christmas.This camera is fast and very user friendly. It takes wonderful indoor pictures with or without using the flash. Outdoor pictures have been limited due to the winter weather, but what I have taken so far turned out great. It is fast enough to catch the grandkids doing what they do, and they are quite quick little buggers.The battery life is quite good. I purchased a charger and 2 batteries to supplement the original.I would recommend this camera to anyone serious about good pictures at a modest price.It also has many different settings for the photographer who likes to experiment and fiddle around with stuff.I believe so far that the only drawback is no viewfinder. That would be handy in bright sun when the LCD screen is hard to see.", "Date": "January 14, 2014"}, {"Title": "Its a nice camera", "Author": "karen brennan", "ReviewID": "R2SC4CKA0FLTUD", "Overall": "3.0", "Content": "I was originally looking for a camera to capture soccer shots.  The zoom pictures are not as clear as I expected - grainy.  There are some nice features like selecting the type of picture and it is smaller than the DSL cameras.  Pictures not using the zoom or just a slight zoom are really nice.", "Date": "January 3, 2014"}, {"Title": "Great buy!!!!", "Author": "Alexander's", "ReviewID": "R2Y2CHQIG505LX", "Overall": "5.0", "Content": "Best camera I've ever owned! Great zoom, fast shoot, great low light, clear pictures and the camera is very light.", "Date": "October 14, 2013"}, {"Title": "Olympus sz-16.", "Author": "michael mitrone", "ReviewID": "R1HCYTCZY4HFEJ", "Overall": "5.0", "Content": "Very pleased with the performance of this camera. Great price and pictures are great! I have owned Olympus most of my life and this product goes over  expect ions .", "Date": "August 10, 2013"}, {"Title": "Great camera", "Author": "Thomas Mason", "ReviewID": "RU0C0KQNWGZKK", "Overall": "5.0", "Content": "The camera is easy to use and the display is great. Takes great pictures!  I like the rechargeable battery and it uses a SD card which makes it easy to download pictures. Really worth the price.", "Date": "July 25, 2013"}, {"Title": "Great camera, good price for all its features", "Author": "Londo", "ReviewID": "R6GUJTXLOVURO", "Overall": "5.0", "Content": "I wanted to buy a good camera for an upcoming trip to Alaska. After some research on consumer reports, etc, including Amazon user reviews, I bought this camera. Boy was I glad I did! It took wonderful pictures. I selected the auto mode for most of them as it selects the appropriate mode based on lighting and focus. Did a superb job. I really liked that super zoom. Got good close ups of a pod of orca and some grizzlies.  I am also glad I bought that extra battery along, or I would have been out of luck for part of a day. I like that they are rechargeable. It did everything that was asked of It. There were a few occasions where I wish it could have recycled for next picture faster, but for all the features it has, this little camera cannot be beat.  I compared similar fotos with a Nikon and Canon user, and this Olympus does more. don't feel like you have to buy a \"big name\" camera- this Olympus does as well or better than any of them, and the price is right. You won't be sorry.", "Date": "July 31, 2013"}, {"Title": "great camera", "Author": "bobinvt", "ReviewID": "R3D65N4PH3CNP1", "Overall": "5.0", "Content": "First, I am a home inspector and use my camera a lot, I mean, a very lot.  It's not uncommon for me to take 150 pictures a day, six days a week. I have owned four different models of the Panasonic Lumix cameras with optical zooms from 12X to the latest 20X. The Panasonic takes good pictures, however, after about six months of use, all of the cameras had issues focusing when zooming past 12X. Two have gone back for repair and were not much better when returned. I switched to the Olympus for the zoom and price point. This has been a great camera. The zoom and focus works flawlessly, all the way out to 24X. I have not had one issue with focusing and the pictures are very clear. I estimate I have 2,000 pictures on this camera so far without a issue.  If you are looking for a good, affordable point and shoot camera, give this camera a look. I don't think you will be disappointed. Last thing, pick up any other point and shoot camera and hold them like you were going to take a picture. They are terrible, nothing to hold onto. Then pick up this camera, it's easy to hold, point and shoot. Enough said. By the camera, you'll like it.", "Date": "April 12, 2014"}, {"Title": "No RAW", "Author": "lizjoe217", "ReviewID": "R345LCWC238FMA", "Overall": "4.0", "Content": "As far as picture quality goes, this camera is great.. A little TOO great. You can see every single detail in a person' face, down to the very PORES!!! The color is remarkable, as well. There's no reason to go into Photoshop and fix the hue, saturation, contrast, etc. This camera records everything perfectly. Video quality is wonderful. There are many photo/video presets that you can choose - from 'Incandescent' to 'landscape', all the way to 'night portrait' and 'sport' - There are settings to capture the most perfect images for any scene you may come across. The only reason I gave this camera four stars, instead of five, is because the camera doesn't shoot RAW files (which are better quality for editing purposes). Otherwise, it's a great, lightweight (but doesn't feel 'cheap', at ALL), easy-to-use camera that will definitely suit your photography & videography needs - whatever they may be!!!!", "Date": "March 17, 2014"}, {"Title": "Takes great photos, has enough extra features", "Author": "dmjs", "ReviewID": "R3RA2V4689YNQ5", "Overall": "5.0", "Content": "Very happy with this camera. Worked well right out of the box after a quick charge. Adjusts well in all lighting, crisp colors in all photos. Great for portraits and scenery alike. Never had to load software. Synced right up to iPhoto on the Macbook without any problems. No graininess in any photos regardless of zoom, lighting, etc.Bought this with a transcend 16GB High Speed Class 10 UHS Memory Card and the photos load up quickly so you can capture multiple shots without using the burst mode.", "Date": "February 6, 2014"}, {"Title": "Very Very happy !!!", "Author": "Discount Gamer", "ReviewID": "R2ZSA1NRCN6DN8", "Overall": "4.0", "Content": "Just bought this camera over Christmas, switched from an old Canon power shot. For the money great little camera can fit in your pocket , no need to wear it around your next like big bulky cameras. Zoom feature is solid, picture come out clear @ full zoom. For under 200 bucks it will be hard to find a better camera !!!", "Date": "January 17, 2014"}, {"Title": "Great camera", "Author": "Sinclair7", "ReviewID": "RJWA164RZ3J94", "Overall": "5.0", "Content": "Oh, it's great!  Wonderful zoom.  For the first time in years I bought something other than a Canon.  Much prefer this.  Love it.  Great colors, quick response.  Haven't used all the functions yet but it's a great camera for me - someone who isn't an expert photographer but enjoys the ability to capture a moment quickly.  Have taken close ups of frogs and leaves in pond and marathoners racing by.  It's done a great job with both.", "Date": "October 27, 2013"}, {"Title": "Nice Little P&S.;", "Author": "Brian Bear", "ReviewID": "RHI9U2M6H5HNY", "Overall": "5.0", "Content": "I am very pleased with the quality of the photos I have taken with this little camera. It is easy to use, easy to hold, small and light enough to fit in my pocket. I bought this one as a gift.", "Date": "June 1, 2013"}, {"Title": "Great pics, nice features", "Author": "NORBIUS \"Technophile\"", "ReviewID": "RGWOFEYI9KHSL", "Overall": "5.0", "Content": "My only complaints about this are that it doesn't come with an external battery charger and that the flash isn't automatic. The pictures are great, the functions are useful and getting to them is very intuitive. The zoom makes this a very nice quick shot, toting camera. It's light and the SLR-like grip make it comfortable to hold and shoot. Feel less likely to slip as is with the case with the square point and shoots.  Great price, great camera, great feature, but needs an external battery charger.", "Date": "May 12, 2014"}, {"Title": "seems to do the job quite well", "Author": "H. Brodzki \"trek monster\"", "ReviewID": "R28VJOPZW5C16L", "Overall": "5.0", "Content": "having been a nikon guy for many many years, i switched to olympus. so far it takes very nice pictures, seems pretty fast. very happy with this purchase.", "Date": "May 8, 2014"}, {"Title": "Great camera", "Author": "inot65", "ReviewID": "R12DKPARJDHYD9", "Overall": "5.0", "Content": "This was my Christmas present (2013). I upgraded to this camera and now can take close ups in one or two shots, the pictures have great color and clarity. I love my Olympus Stylus SZ-16.", "Date": "March 6, 2014"}, {"Title": "great vacation photos", "Author": "mgoldman", "ReviewID": "R32FTR3BH2CPU7", "Overall": "5.0", "Content": "We purchased this as a last minute decision to take with us on vacation instead of the expensive DSLR's that we own. It was a great choice produced really nice photos for a mid to low range point and shoot (price wise). Overall we choose this camera because it could do pano's as well as Dynamic shots (HDR-like). The camera's battery lasted all day while we were visiting Disney and Universal parks. The optical zoom was great, just enough to get me close to the action on some of the parades and then the fireworks over the castle were amazin.I would recommend the SZ-16 to anyone who needs a decent camera for a decent price.", "Date": "October 15, 2013"}, {"Title": "Best in Price", "Author": "GT", "ReviewID": "R3BI20VUW169W7", "Overall": "5.0", "Content": "It is very user friendly.  I did not have to read the directions... It 's photos and videos are clear and good quality.  There is no problem downloading the  photos and videos to your computer.", "Date": "October 12, 2013"}, {"Title": "Perfect", "Author": "kandi", "ReviewID": "R3UR3LFWD9CH3L", "Overall": "5.0", "Content": "Nice large screen, easy to use, lots of settings, have had no problems and have had it since July 2013", "Date": "October 9, 2013"}, {"Title": "Love this camera!", "Author": "Doreen", "ReviewID": "RNGW3TM9UZLXS", "Overall": "5.0", "Content": "This camera is amazing.  The zoom is truly fabulous.  The pictures come out so-o-o clear.  Even zooming out the maximum brings a clear picture.  You just have to hold it in place long enough to snap what you are aiming at.  It comes out clear whatever ends up in the picture!!  I loved this camera.  Had a Nikon that just doesn't hold a candle to this one.", "Date": "November 20, 2013"}, {"Title": "Good little camera", "Author": "Love shopping  Amazon \"Happy Kindler\"", "ReviewID": "R21P2NNUG2DG7D", "Overall": "4.0", "Content": "I brought this on vacation before I read up on how to use it, but was able to easily take some beautiful pictures. What I really like so far is the grip. It's so comfortable to hold, you can do it with one hand. Also, the screen is so much larger than my other camera's screen - a big feature for me and something I looked for specifically. The camera is still small enough to make it convenient to use and non-cumbersome.  I'm looking forward to learning more about the camera. Oh, and it's white - something different and kind of cool.", "Date": "October 4, 2013"}, {"Title": "Works great", "Author": "Grejam", "ReviewID": "R19GSIEX3KAMWK", "Overall": "5.0", "Content": "I bought from a Consumers Reports recommendation; for image quality, flash, and fast camera startup.  It has it all.I actually bought a package for a few more dollars with extra battery, mini tripod, memory card, case.  Look around, I think this was a good package.", "Date": "May 6, 2014"}, {"Title": "Perfect!", "Author": "Robert P. Richardson \"grampabob\"", "ReviewID": "R3W4O41NI0SKF0", "Overall": "5.0", "Content": "Perfect in every respect.  Quick arrival and easy to use.  This was recommended by a friend who is very, very happy with this product.  Zoom is amazing!", "Date": "May 6, 2014"}, {"Title": "Great Camera for this Price", "Author": "S. K. Bhatia", "ReviewID": "R1TWCQW2YK1D5P", "Overall": "4.0", "Content": "We bought this camera for my wife who loves to take pictures everywhere she goes. That's why she doesn't want  to lug a large and heavy DSLR camera. She likes this camera's ease of use and the pictures come out great.", "Date": "April 30, 2014"}, {"Title": "Very good camera", "Author": "Gil Estes", "ReviewID": "R2CRB9QRTUZVRE", "Overall": "4.0", "Content": "Purchased this camera for a cruise we took to Alaska. Wanted a good optical zoom (24x is good) with easy to use features, but the ability to do more complex stuff. I love everything about this camera......BUT...Because there is no view finder (only the LCD), in bright sun light, it can be difficult to see the picture. Other than that...I love it.", "Date": "April 22, 2014"}, {"Title": "Olympus Stylus SZ-16 iHS Digital Camera with 24x Optical Zoom and 3-Inch... OLYMPUS", "Author": "john cope \"nlpokeh\"", "ReviewID": "R2YIES28WQOU4S", "Overall": "5.0", "Content": "beautiful, does everything it says on the box , easy to use, a lot of camera for such a compact size.", "Date": "February 5, 2014"}, {"Title": "Good camera!", "Author": "Nancy F. LaRochelle", "ReviewID": "R201BSV3T7VCD6", "Overall": "5.0", "Content": "Bought camera as gift for 11 yr. old grandson (a bit of a stretch, but he's a good photographer) ------ so far, he loves it!  He's growing into it, and it should serve him for many years.", "Date": "January 17, 2014"}, {"Title": "Easy to use", "Author": "krilc", "ReviewID": "R2ZT9D867DVMQT", "Overall": "5.0", "Content": "The Olympus Stylus SZ-16 took great pictures.  I ordered a couple of days before vacation and didn't have much time to learn how to use the camera.  It was easy to use and took great pictures.  Very pleased with it.", "Date": "January 13, 2014"}, {"Title": "Great little camera, especially for the price.", "Author": "B. Strong \"Foxterriermom\"", "ReviewID": "R3RK2YZU8WZDLO", "Overall": "5.0", "Content": "Love this camera.  Takes great pictures and is easy to use.  I had an older Olympus for 12 years that I really liked and this one is even better.", "Date": "January 6, 2014"}, {"Title": "Good camera - great price", "Author": "Scott Flamme", "ReviewID": "RZ5GZKT7ZCLZG", "Overall": "5.0", "Content": "Great Camera for all weather conditions - took it on a 150 mile -40 trip in Denali on snow machine - battery power and picture quality  - beyond my expectations - great point and shoot camera.", "Date": "December 12, 2013"}, {"Title": "Like my Camera!", "Author": "Shirley Mensch", "ReviewID": "R2RKBZB4S309BR", "Overall": "5.0", "Content": "Like my camera so far.  I have not used it a lot but plan on using it more over the Holidays.", "Date": "December 7, 2013"}, {"Title": "Simple, easy-to-use with great pics", "Author": "Elaine Brown", "ReviewID": "R2W5IY4Z1308UF", "Overall": "5.0", "Content": "I purchased this camera for my mom who has dexterity and vision problems.  It is very simple for her to use and the pictures are great.  I kept telling her I was going to steal it!  Perfect, simple camera with great pics.", "Date": "December 6, 2013"}, {"Title": "pleasant surprise", "Author": "B. Fuhrmann", "ReviewID": "RGSJUXDBSBU4K", "Overall": "5.0", "Content": "I am very pleased with the overall performance of this camera. The indoor shots in the low light mode were exceptional! These were the best photos I have EVER taken at out annual Christmas pageant. An the image stabilization was fantastic. I was very impress at how  the zoom feature  capture things as those you were close to the object although you actually quite far away.  I would highly recommend this camera.", "Date": "December 31, 2013"}, {"Title": "I like it.", "Author": "Corgi", "ReviewID": "RJXEOHPTR3QSL", "Overall": "5.0", "Content": "The zoom is wonderful, the video steady and sharp. I took pictures at an aquarium with my old one and this one and the ones taken with this camera are much sharper. It was a different aquarium so one may be better lit. The video is easy to access when you finally remember you just push the red dot. The panorama is easy and takes wonderful pictures. It is very small for all its features and my pictures usually come out very nice, better than with the old ones when the subject is moving. I take a lot of pictures of animals. I've had good experiences with Olympus in the past, and very bad experiences with a couple of other brands so I didn't really consider anything else. I kept coming back to this one since it has such a good zoom in a small package.", "Date": "November 24, 2013"}, {"Title": "Great little camera", "Author": "Tony", "ReviewID": "R3QSSLWUR5D2AT", "Overall": "5.0", "Content": "Looked at all of the point and shoot cameras and this one seemed to be a good deal for the features and price. Gave it to my wife and she loves it, easy to use, takes great pictures and has all the features you would expect from a point and shoot.", "Date": "November 13, 2013"}, {"Title": "Olympus Stylus -16 IHS Digital Camera", "Author": "roadrunner", "ReviewID": "R1GXFG8OV3FFDD", "Overall": "4.0", "Content": "Received the camera well within the requested time period.  It was as advertised, small but not too small.  I just finished using it for the first time during a trip to Europe it was easy and fun to use with good results.  I still have a lot to learn about the camera so that I can take even better pictures.  I would recommend this camera to my friends.", "Date": "October 13, 2013"}, {"Title": "Gift for my son", "Author": "Marion D. Dickinson", "ReviewID": "R2343D90ATKQEN", "Overall": "4.0", "Content": "It seems to be doing what he wants it to.  Most of his photos are nice and sharp, I don't believe he has done any video yet.", "Date": "September 15, 2013"}, {"Title": "Small and practical camera", "Author": "Santiago Esteban Sojo", "ReviewID": "R9FLZ30X5V2LQ", "Overall": "4.0", "Content": "I like it, small and practical camera with a great zoom and easy to use. If that wath you are looking for this one will be fine.", "Date": "April 29, 2013"}, {"Title": "Light Weight", "Author": "Al Atherton", "ReviewID": "R2VWZHFM99KTFT", "Overall": "4.0", "Content": "IT met the light weight requirements. Haven't had the camera long enough to evaluate all the features yet.Need a booklet to go with it with large print for us older persons.Al", "Date": "January 4, 2014"}, {"Title": "More complicated than I wanted.", "Author": "Margotd \"margotd\"", "ReviewID": "R2512D9FB3XM0D", "Overall": "3.0", "Content": "I have not actually used the camera yet -- 6 weeks after it arrived, because I am still trying to get comfortable with the instructions.  It looks like it will do everything -- that would be fine, except I have to go back to the instructions every time to make sure I am doing the right thing.  There is one major button on the back of the camera, and you have to decide to press it right, left, up, down center, and a few other ways depending on what you want to do.  The arrows are hard to see, very tiny, and just sort of blend in with the color of the button itself, it would be much easier to have more clear markings.  When I see a picture happening in front of me, I want to just snap it right away, without having to strain to see the control buttons.", "Date": "October 28, 2013"}, {"Title": "Why would you sell a product without printed instructions????", "Author": "traveler", "ReviewID": "R1T3W1TOOWNMCJ", "Overall": "1.0", "Content": "I really looked forward to receiving this camera to replace the Olympus camera I already own. I purchased it in order to take it with me on a European vacation, but when it arrived I discovered the instructions were limited to a CD and the printout of the pages would require over 200 pages! I looked everywhere I could online to try to find an instruction booklet that I could take with me on the trip, but none is available.  Hence, the camera was returned.  I hope something can be done about providing a suitable small printed comprehensive instruction booklet for this camera similar to what I have for my Olympus Stylus.", "Date": "October 10, 2013"}, {"Title": "needed a memory card", "Author": "Ava S. Widicker", "ReviewID": "R9K6S6TYIN8WB", "Overall": "2.0", "Content": "Camera did not come with a memory card - didn't open it until we were in Belize and luckily found a Chinese run camera shop who had what we needed.  Would think it would come with a memory card.", "Date": "April 26, 2013"}], "ProductInfo": {"Price": "$229.99", "Features": "Super Slim 24X Wide-Angle Optical Zoom Lens\n1080P full HD video\nMulti -Motion Movie IS", "Name": "Olympus Stylus SZ-16 iHS Digital Camera with 24x Optical Zoom and 3-Inch LCD (Silver)", "ImgURL": "http://ecx.images-amazon.com/images/I/413jtpB81NL._SY300_.jpg", "ProductID": "B00AQ2BWS6"}}