{"Reviews": [{"Title": "Great alternative to SLR's", "Author": "Eric Slay", "ReviewID": "R2P1SGPIIG5UHT", "Overall": "5.0", "Content": "I am a professional photographer and a previous owner of the Fuji X100. The reason I got the original Fuji, and then this x20 was that I wanted to have a nice looking camera I could take with me on trips, etc. that would take great pictures without weighing a ton and being a huge cumbersome burden (like my 5dmk3).Other than the great looks, I wasn't a big fan of the X100. It had so many glaring flaws that I returned it after a week of use. I am happy to say that this x20 model has addressed most of the issues that made the x100 such a pain. Rather than go into them specifically, I'll just give you my thoughts on this new model.First, and foremost, the camera takes amazing pictures. This is not an overstatement. I have used all levels of point&shoot; cameras over the years and this one is the first to really produce SLR-like quality in a small form factor. The pictures are sharp, the focus is accurate, and the colors are rich. Another way of putting it is this: there are always tell-tale signs that pictures are shot with a P&S; camera: too sharp, too much contrast, too vibrant, etc. This camera produces these qualities (sharpness, contrast, vibrance) through great optics, NOT through in-camera processing. It's the real-deal, and you can see the difference.The build quality of the camera is fantastic. It is sturdy, made primarily of metal, and feels great in my hands. Most important controls are easily accessed with dedicated buttons. I especially like the +2 to -2 exposure control dial on the top. This is something that I use all the time on my SLR and something I think a lot of non-pros could benefit from. When the sensor is tricked by backlight, just dial it up, when things are too bright and getting blown out, just dial it down. It's easy and fast and it's second nature to use for me.The only control that I think is left out is a thumb controller for the focus point. As it currently is, you must press the AF button (on a wheel with macro, flash, and timer) and then scroll around to change the focus point. It's not a deal-breaker, but it would have been nice to have an 8way dedicated thumb controller for the focus point. I change my focus points constantly, and I just can't do it as fast as I'd like on this model.  On top of this, when you look through the eyepiece, which you should be most of the time, you can't change it. You need to take your head back and look at the back of the camera.I also love the variety of modes the camera has. There are so many that I haven't been able to master the benefits of each setting yet. Here's a brief synopsis:P, S, AE, and M are the usual suspect that all cameras have.SR is an advance auto mode that determines the best settings based on the scene. It even shows its predictions, so you can see if it is accurately assessing the situation. From my experience, it's startlingly accurate. It chooses from: landscape, night, tripod, beach, sunset, snow, sky, greenery, and sky & greenery. Having these settings on a camera is old news, but having the camera predict the scene itself and do so with great accuracy is a pretty exciting advancement.Adv. Advanced lets you make some stylish choices and make your pictures look a little Instagram-ish. I'm not a huge fan of this kind of thing, but I suspect many people will be. The choices are: toy camera (lomo), miniature (tilt-shift), pop-color, high-ley, low-key, dynamic tone, soft focus, and a handful of partial-color masks (everthing BW except reds, etc.).In this mode, I LOVE the tilt-shift (miniature) setting. I used to own a $1600 tilt-shift lens that I'd pull out once a wedding and use, but sold it because I wasn't using it enough. Now I've been using this and getting the greatest results.Motion Panorama: an onscreen guide steps you through making a panorama.Pro-Focus: the camera takes 3 pics and then softens the background to make a portrait-like shot. This actually works better than you'd expect, but I don't use this feature to take portraits.Pro-Low light: This combines 4 pictures of poorly-lit subjects and combines them. The problem with this and Pro-Focus is that if your subject moves (and they always are, even if just by breathing), it doesn't work well.Multiple Exposure: You can use this to combine several pictures into one. For example, you can take a picture of the moon, then recompose your shot, and place that same moon in the sky over a cityscape. I've used this to create ghost-pictures to scare my kids.SP (Scene-Position): This is your standard setting where the user gets to choose what their shooting. The choices are portrait, portrait enhancer, landscape, sport, night, night (tripod), fireworks, sunset, snow, beach, underwater, party, flower, and text.And finally, there is the macro mode, which is excellent. It is so good, in fact, that I am selling my macro-lens that I use for ring shots because I can actually get results just as good (possibly better) using this camera. And, because the looks of the camera are non-point&shoot; looking, I can pull it out on the job and nobody blinks an eye.---In summary, I think this is a terrific alternative for a bulky SLR. If you're a pro, I think you'd be happy to let this little camera take the place of your SLR on trips to the park, the beach, or on vacations with your family. If you are a hobbyist or family-shooter, I think you should definitely consider this over (or in addition to) a SLR because the best camera is always the one you have with you. If your SLR is too heavy, you'll leave it at home and then all you'll have is iPhone pictures.I hope you found this review helpful. If so, let me know! I'd be happy to answer any questions you have. :)", "Date": "April 15, 2013"}, {"Title": "Fujifilm X20: Superb performance + excellent ergonomics ★[Updates]★", "Author": "John Williamson", "ReviewID": "R2UZ7EQS14RJMS", "Overall": "5.0", "Content": "Fujifilm is a fascinating photo and imaging manufacturing company, a survivor in a world where we've witnessed the demise of such cameras as those from Minolta, Konica, Yashica, Contax, Topcon, Bronica and too many more to mention here. The company has survived largely because of good business practices and listening to the needs of photographers.The Fujifilm X20 is a camera in which I had been highly interested since the release of this and the Fuji X100s early this year. I had looked seriously at the Fujifilm X10 last year, but there were some subjective needs that for me it didn't meet, so it was passed on. I'm glad that I waited, as the number of improvements over the X10 is quite large. There are said to be about fifty improvements that have been made, but in all fairness, I won't get into a Fuji X20 vs. X10 comparison here, as my experience with the earlier model was limited to just a few days use.Getting right down to the subjective points, followed with a more detailed look based on personal use, here are my basic observations.◆ Pros:+ Excellent retro design; solid build quality coupled with good contemporary ergonomics+ Sharp 4x optical zoom; comfortable 28mm to 112mm f/2.0- f/2.8 equivalent, image stabilization+ Has a 7-blade aperture diaphragm; contributes to excellent bokeh effects+ EXR Processor II dual CPUs; cold start-up time about ½ second, super-fast sequential shooting+ Near-instant autofocus; virtually no time lag when the shutter button is pressed+ New 2/3-inch X-Trans CMOS II sensor; 12MP, offers excellent image quality+ Hybrid AF; autofocus instantly switches between high-speed phase detection AF and contrast AF+ Front focus selector dial; AF-S (single autofocus), MF (manual), AF-C (continuous autofocus) modes+ Advanced OVF; optical viewfinder offers exposure info overlay via Digital Trans Panel, 85% coverage+ 2.8-inch color LCD monitor; approximately 460,000 dots, 100% coverage+ Excellent ergonomics; rational array of controls, easy to master+ Rechargeable NP-50 Li-ion battery; averages 190 - 220 shots per charge depending on settings, actual+ Full manual exposure plus Program, Aperture- and Shutter priority modes and more+ Uses readily-available SD, SDHC and SDXC memory cards; full support+ RAW (RAF format) support; also offers JPEG and RAW+JPEG+ ISO range is 100-12800 (in Auto); control available up to ISO 3200+ Excellent ergonomics; raised grip area on the body with a thumb rest, add to handling+ Threaded socket on shutter button; allows for threaded cable releases, soft shutter buttons+ Made in Japan; all of Fujifilm's X-Series cameras are made in Japan+ Built-in advanced filters; allow a choice of 8 artistic effects◆ Cons:- Battery life could be far better- Wish this camera would go to 24mm wide angle- Picky point: the X20 lacks a built-in neutral density filter◆ First Impressions:The X20 came well packaged in a distinctive black box, and from the moment it was opened and taken out, the feel of a solid, precision camera was quite apparent. This is truly a camera for advanced users, or pros looking for a good backup or weekend camera. It's crafted from a die-cast magnesium alloy, and the ergonomically placed mode dial and zoom ring are milled from solid aluminum. The professional feel is there, and is reminiscent of its more costly brother, the Fujifilm X100S, and along with its overall retro styling is a small engraved \"Fujinon Lens System\" logo on top, reminding us of some of the classic 35mm rangefinder cameras of the past. And on the rear, just to the lower right of the LCD screen, is the discretely engraved \"Made in Japan\" note in white letters against the black of the camera body.Followed the directions in the printed instruction manual and charged the battery for about two hours while reading and going through the box contents. The X20 came packaged with the following:● Rechargeable NP-50 Li-ion battery● BC-50B battery charger with US plug attachment● Shoulder strap with protective pads● Triangular strap clips & attachment tool● Lined push-on metal lens cap● Proprietary USB cable● CD-ROM (with MyFinepix Studio 4.2 viewer software, RAW file converter, etc.)● 141-page owner's manual (1-Egnlish, 1-Spanish)● Fujifilm USA warranty directionsThere's something to be said for Fujifilm's attention to detail with this camera, as they've supplied a small plastic attachment tool with the triangular strap clips. That means no more scratches on the body or broken fingernails while attaching the camera strap clips. The BC-50B battery charger indicator glows steadily when charging, and cuts off when the battery is topped up. I put the USB cable in a safe place (it's proprietary, so don't lose it), and once the battery was fully charged, inserted a Class 10 SDHC card and took the X20 out for a trial run to get a feel for it.◆ The X20 in Use:Following the instruction manual, I did some preliminary setups, setting the camera to its Quick Start mode from the Fuji X20's power management menu. The first thing that I noticed was the exceptionally fast start-up time, which only took about ½ second. Shutter lag is almost nonexistent while in this mode, and on top of that, the autofocus is incredibly quick, perhaps the fastest that I've ever encountered. Technically this is due to the X20's built-in phase detection and its \"Intelligent Hybrid Autofocus system,\" but from a practical perspective of a user who could care less about specs with an eye in the viewfinder, this is exceptionally good for action photographers and street shooters.Speaking of viewfinders, the X20 has an excellent and highly useful optical viewfinder, one that's far more functional than my older Nikon P7100 and many other similar cameras. The optical viewfinder shows 85% coverage continuously, which is fine, and there's a diopter adjustment which is good for those of us with corrective vision. But it also has a Digital Trans Panel that shows highly useful information, such as aperture, shutter speed and focus area. There's a sensor next to the optical viewfinder that automatically senses when the camera has been lifted to the eye, and it turns off the rear LCD screen when you do so. It took a few minutes to get used to this, but after awhile I found that I was using the optical viewfinder far more than I ever did with the Nikon P7100, which was a surprise. It's also good when you have a sun in the face shooting situation.The X20 has a 460,000 dot, 2.8-inch TFT LCD screen. It's a decent screen that's bright and clear, enough so that it deals with reflections and glare fairly well.  This high-contrast screen has a wide viewing-angle, and makes dealing with its excellent GUI menu system easy. That said, it's slightly disappointing that it doesn't have the +920,000 dot 3-inch LCD display found in the Nikon P7700 and other premium compact cameras currently on the market. It's not a show-stopper, but a subjective consideration.As expected, the camera offers complete PSAM control along with other settings from the top mode dial near the shutter button. There's a good sized exposure compensation control to the right of the mode dial, useful when taking photos of very bright, dark or high-contrast subjects, which offers ± EV in one-third increments. On the front is the front focus selector dial, offering AF-S (single autofocus), MF (manual), AF-C (continuous autofocus) modes. There are plenty of other controls on the camera, each offering specific ways to manage various settings and options.In regular use, I found a mild irritant in that the X20 powers down automatically after a few minutes. When this happens, you have to twist the on/off mechanism on the collar surrounding the lens barrel to turn it on again. There is a workaround: go to the menu, and find the standby mode. Setting this means that you can have the camera wake up by gently depressing the shutter button, which is quite practical if you're often in this situation.There's a Q (Quick Menu) button next to the menu controls, and it's quite handy. It displays the most frequently accessed settings on a single screen so that you can quickly navigate to each setting individually and use either scroll wheels to change the value or function of the setting. This made access of the various functions such as ISO settings, white balance, dynamic range, image size and such to be far easier than exploring the camera menus. Tried various shots accessing trying film simulation, the different metering settings and such, all as part of the learning experience. This shortcut method is far better than digging into the viewfinder menus to access the various features. Some magazine reviewers have suggested that it might be better if the X20 had a touch screen so that one didn't have to scroll around the quick menu, but I disagree. If you own a smartphone or tablet, such as a Kindle Fire, just imagine those same streaks and smudges on the screen of the camera. Simply put, the small Quick Menu button, along with the programmable Fn (Function) button on top, quickly became my allies.◆ The Lens and More:I've been a fan of Fujinon since my 4x5 view camera days when I owned a superb Fujinon 90mm f/8.0 SW lens, and it's good to see that the same attention to detail found then has carried through onto the X20. For the technically minded, its 4x optical zoom is made up of 11 glass elements (not plastic) in 9 groups, including 3 aspherical lens elements and 2 ED lens elements, with a proprietary HT-EBC coating applied to control flare and ghosting from appearing on images. It's also image stabilized, which helps for low light shooting without a tripod.What this means to you and me is that we have a metal barreled lens that performs beautifully, offering sharp, clear images throughout its entire range. The zoom action is smooth, and it offers both a Macro and Super Macro mode, allowing you to get as close as 0.3\" from your subject. The lens incorporates 7 diaphragm blades which enable you to create a good-looking soft 'bokeh' effect to make your subject stand out from the background perfectly, especially at the f/2.0 aperture setting. At 28mm you have a maximum aperture of f/2.0, and its f/2.8 at the 112mm telephoto end, so the lens is plenty fast.You might find the occasional compact digital with a 4x lens that's as good as the one on the X20, but you'll be very hard pressed to find one that's better, at least not yet.Regarding image performance, the colors produced in images are pleasingly saturated without being overdone. The standard color setting (Provia) is good for most situations, while for portraits you may want to play with the Astia color setting, which renders images with a softer look for better skin tones. The Velvia emulates a more saturated fine-grained slide film, which is the choice of many nature and landscape photographers but you should explore these film emulations to see which is best for your shooting.The X20 has an increased sensitivity ISO range going to ISO 12,800, but for best results, you may wish to stick between ISO 100 and 800. At ISO 1,600 you'll begin to get soft details with some grain present, and beyond ISO 3,200, contrast drops and noise becomes noticeable. These are subjective observations, and your level of acceptability may be different.A full 360° panorama can be shot, and the panoramic options can be found in the Advanced mode.The Advanced Filters selection offer a choice of eight artistic effects, and you can preview the effect on the LCD monitor before you press the shutter button. These filters cover High Key, Low Key, Soft Focus, Toy Camera (with shaded borders), Miniature, Pop Color, Dynamic Tone, Partial Color (retain one color and change the rest of the photo to b&w;), along with multiple exposure. Have not fully explored all of these filters, but the High Key and Dynamic Tone filters are surprisingly creative for in-camera work.Video performance of the X20 was good, and resulted in sharp details and excellent colors, though I'll admit that I'm an infrequent video shooter and easily satisfied in this regard. The continuous autofocus on the X20 performs well with a gradual transition from close to infinity. You can shoot 1920 x 1080 Full HD videos, and the onboard stereo microphone also picked up ambient sounds clearly. There's a movie setting on the mode dial, but be aware that there is no dedicated video button.There's a built-in automatic flash (referred to as the \"Super intelligent Flash\"), and for snapshots and the like, it works fairly well. You slide the pop-up switch on the rear of the camera, then select from a variety of modes from the selector to the right of the menu button, such as Auto, Forced Flash, Suppressed Flash, Slow Synchro and Red-eye Removal. It does a reasonably good job, and the built-in red eye works well. If you're serious though, you may want to look at a more powerful flash to mount onto the X20's hot shoe.◆ Other Observations:The battery life for the X20 is listed in the specs as being approximately 270 frames, but if you're a heavy user, especially if you have the camera configured for performance shooting, you may find that you get somewhere between 190 and 220 actual shots. During one session taking rapid sequence shots, the battery warning indicator came on at ~150 shots. This is not surprising for this or most other digital cameras, and luckily the Fujifilm NP-50 Li-ion Rechargeable Battery is readily available and worth getting as a backup. Owners of other Fuji digital cameras may already have this battery, as it's the same one that came with my older Fujifilm F300EXR, which is still in service. In any case, it's highly recommended that if you go for this camera, get yourself this backup battery.The zoom lens is threaded for Ø40mm filters and accessories, and don't make the mistake of ordering a Ø40.5mm filter. That half a millimeter does make a difference, so if you want a UV or protective filter on the front of the lens be sure to get the 40mm size. The other option would be to go for the Fujifilm Lens Hood LH-X10, a two-piece unit that screws into the 40mm threaded end, yet allows for a vast array of commonly available Ø52mm filters... and Nikon DSLR owners probably already have a number of these.If the Fuji LH-X10 is a bit rich for your blood (check the price), the Lens Hood LH-JX10 for Fuji X10 with Lens Adapter is a perfect replacement at a far lower cost, and it accepts Ø52mm filters just like the original LH-X10. I bought this along with a Fujifilm Camera Lens Filter PRF-52 Protector Filter (52mm), and both are on my X20 right now.I looked at considered a number of case options for the X20, and while there are some nice retro-look leather cases by Fuji and others, found that the Think Tank SubUrban Disguise 5 Compact Shoulder Bag was perfect for my individual needs, as can be noted in my review of bag. It holds not only my Fuji X20, but my Nikon P7700 as well, where either could be grabbed easily and quickly on a moment's notice for fast street photography or action shooting. This solves the problem of where to carry spare batteries, my Android phone and other essentials, along with protecting all against an accidental rain shower.Speaking of retro, there's a slightly-overlooked feature, and that's with the shutter button. Look closely and you'll see that it's threaded like the old 35mm rangefinders from years ago. This means that if and when you're using the X20 on a tripod, you can employ a mechanical cable release time exposures or for macro photography. There are many different one available here. You can also use a soft shutter release button that screws into that same threaded socket for greater control. It's a nice touch.To be honest, I did not install the MyFinePix Studio software that comes on the CD. For some it may be a decent, basic way of importing and viewing your photos to your computer, but I cannot offer an opinion. For Adobe users, Camera Raw 7.4 and DNG Converter 7.4 became available as a final release on April 2nd, 2013 as announced by Adobe's Lightroom Journal. The good news for Adobe users is that among others, this upgrade specifically impacts the Fujifilm X20 and the X100S. If you use Adobe software, you know what to do, and enough said on this.If you want a small point-and-shoot digital camera that slips easily in a pocket, this isn't it. The X20 will fit in many large coat pockets, but is best carried in a bag, a case or around your neck, ready to shoot. The strap might be worth replacing, as its non-slip pad actually chafes the neck if you're wearing a short sleeve or t-shirt in warm weather. This became an annoyance during the first warm day of shooting this spring.If asked to recommend a better digital camera to advanced enthusiasts, pros looking for a DSLR backup, or amateur photographers wanting to break into street photography, this would be a good choice. And if I had to personally pick one as a sole camera for weekend travel photos, this would be within the top of a very narrow list.Note: this review will be 'dynamic' in that as other findings with the use if the X20 will be noted here. Major notes and additional resources will be noted in the comments.◆ Update 5/10/2013:After putting the X20 through its paces with thousands of images since it was received, I've ordered a total of three extra Fujifilm NP-50 Li-ion rechargeable batteries as noted in the link above. These have settled down to giving about 200 to 230 exposures per charge. I did order and try a lower-priced third party battery, and after three charge cycles, that battery was only giving 120 to 130 shots. Trashed that one.Also found that the SanDisk Extreme Pro 8 GB SDHC Class 10 UHS-1 Flash Memory Card with its 95MB/second write time proved to be perfect for sequential high-speed no-lag shooting. This size outlasts the batteries, but there are larger sizes available. Just remember to format it within the camera, and not on a PC or Mac.Also see the comments here for additional findings, and yes, I do respond to questions as can be seen there.◆ Update 5/23/2013:★ Firmware Update Notice ★On 5/16/2013, Fujifilm Global published its X20 Firmware Update Ver.1.02, a standard procedure for digital cameras where the user can update the camera. This firmware update is only for the X20, and does not apply to the X10 or any other models. You'll find details on this update in the comments section to this review on this date as outside links cannot be posted within the body of the review.◆ Summary:The Fujifilm X20 is one of many in a growing field of advanced digital compact cameras, and the competition continues to grow. But Fuji has been good in listening to the photographers' needs, and along with the new Fujifilm X100S, we see generational cameras that are more evolutionary than revolutionary. The +50 improvements in the X20 over its predecessor back this up. The Image quality and resolution we find here push it up to class-leading levels, and few can offer a better lens and sensor-size combination. Image quality and a multitude of user options are half the reason that I personally find the X20 to be so good; superb performance and excellent ergonomics make up the rest.4/8/2013; Updated 5/10/2013, 5/23/2013", "Date": "April 8, 2013"}, {"Title": "Excellent not-quite-pocket-sized camera.", "Author": "William Grose \"Tzu Crazy\"", "ReviewID": "RGW0JY4UDDW1O", "Overall": "5.0", "Content": "I must admit. I'm a tad spoiled as my wife has been using the absolutely fantastic Sony DSC-RX100, so I figured I'd do a little comparison between the RX100 and X20, with some standalone thoughts on the X20.First, the X20 is a very attractive camera, because it captures that retro look very well. On the flip-side, you could take out the X20 at a party and easily convince everyone you bought it in 1985. That's a good thing or a bad thing depending on your standpoint. :-)Anyway, the build quality is excellent. This is a solid-feeling camera, much more so than the Sony RX100. However, that solidity comes with some seriously more weighty... weight.Weight:Sony DSC-RX100 with battery = 8.5ozFujifilm X20 with battery = 12.7ozThat means the Fuji is a hair under 50% heavier than the Sony, and it's quite noticeable.Dimensions:Sony DSC-RX100 = 4 inches (w) x 2.3 inches (h) x 1.4 inches (d)Fujifilm X20 = 4.6 inches (w) x 2.7\" (h) x 2.2\" (d)That dimensional difference, too, is extremely noticeable. The additional weight and size means you're not carrying this on your person unless you have very baggy pockets. The lens sticks out considerably further on the X20 contributing to this.That said, the Fujinon lens on the X20 is excellent, - an absolutely joy to use. This camera is much, much easier to attain dreamy bokeh on than the Sony, due to the much wider aperture at full zoom (f2.8 on the Fuji vs 4.9 on the Sony). In this regard, the Sony can't touch the Fuji, despite the Sony's much larger sensor size (double the Fuji's!). Also, quite niftily, you can attach a 40mm-to-52mm ring adapter to the X20's lens, thus enabling you to use all manner of cheap UV, polarizing and neutral density filters etc. Awesome.I'm using this one, personally, and it works just great because it works as a lens hood, too: EzFoto 52mm Filter Adapter + Lens Hood for Fuji X10, with a free lens capThe X20 has a manually-activated flash that pops straight up and points dead ahead, unmoving. The Sony RX100 has a shutter-activated flash, and has the outstanding ability of being able to be pointed up to the ceiling and used as a bounce flash (as well pointing straight ahead). While it's not a blazingly-poweful light, in a pinch it works great in relatively small rooms, and portraits have turned out infinitely better than a head-on flash using this feature. I was surprised to be able to do this, but it's such a great little feature! I wish the X20 worked similarly.In terms of menus etc, neither the Sony nor the Fuji have particularly intuitive interfaces, and both have a learning curve before you'll feel anywhere near adept. The nod has to to go the Sony, though, as the menus feel quite modern and.. swish. The Fuji's menus aren't terrible, but I found myself quite a bit more frustrated trying to navigate around them. They're just quite clunky.The X20 has two dials on the top of the camera. One is for your typical pictures modes (aperture/shutter priority, manual, special picture modes etc), and the other, inexplicably, is an exposure compensation dial from -2 to +2. I was surprised that Fuji dedicated a dial to this one feature, and assumed there would be more uses for the dial that I'd discover by digging through the manual. Nope. Page 49 says the following:\"Use exposure compensation when photographing very bright, very dark, or high contrast subjects.\"That's it. A whole dial (described in just a single sentence in the manual) dedicated to one thing that could easily be accessed via a shortcut menu. Crazy!On the plus side, the X20 has a viewfinder - yay! While it's only an 85% viewfinder (you'll have some image around the edges that you'll see in post-process that you don't see through the viewfinder), it works \"OK\" (see March 27 edit, below), but does show you plenty of useful information (iso, f/stop, shutter speed). It's great to be able to keep your eyes through the viewfinder and change settings once you learn the controls. Good stuff. It can sometimes be a bit tricky to focus your eyes on the projected text in the viewfinder, though, but you tend to get used to it.The X20 features 49 selectable focus points on the LCD, and I found each and every one of them to be very accurate.While the RX100 and X20 both have panorama functionality, I found the RX100's to be superior, with less erroring between frames when they're stitched together. Both do a great job, though.The X20, sadly, does not have an HDR mode built in that I could find. This is an extremely useful feature, and I've seen some absolutely fabulous, natural-looking HDR'ed shots from the RX100 that, sadly, won't ever come from the X20.The X20 shoots at 12fps, which is two more than the RX100's 10fps. Both are blazingly fast, though the RX100 is shooting 10fps at 20MP, whereas the X20 is shooting 12fps at only 12MP. I need to spend more time comparing files from both cameras, but you won't be disappointed by the images from the X20, that's for sure.The X20 has an absolutely fantastic macro mode, letting you get as close as 0.4 inches away from your subject. It's truly excellent for the dreamy-bokeh lovers out there, because the subject separation is stellar.Overall, in my initial testing, the X20 is a super camera. It's not the game-changer the RX100 is (sensor size and variety of features in such a small package), but what you do get is a superior lens, no optical low pass filter - for crispy photographs, an actually usable viewfinder, 12fps, superb build quality, and delicious, delicious bokeh! If you're cross-shopping the RX100 and X20, it's certainly a tough decision. If fitting a camera in your purse or pocket is important, the RX100 wins hands down. For build quality? The Fuji. Photo quality? Well... I won't jump to any conclusions until I've had more time to test (this review will be updated!). So far, though, the X20 seriously impresses.Only the menu-system learning curve and inexplicable exposure compensation dial nag at me, but this camera is still full of win.5 stars out of 5.*EDIT March 27, 2013*More time with this camera has shown that it really is a competent shooter, and here are a few more tidbits:1.) ISO3200 is the highest attainable when shooting in the RAW format vs 12800 in JPEG. Not a big deal in my experience. ISO800 and 1600 are quite pleasant, but the jump from 1600 to 3200 is really significant in terms of the difference in noise. ISO800 and ISO1600 add a pleasing (dare I say it!) noise grain to the image which is not objectionable, whereas ISO3200 just turns things a bit muddy at the pixel level, especially in really low light or with dark objects.2.) At the time of typing, you need Adobe Photoshop Lightroom 4.4 Release Candidate to process the RAWs from the X20. Not a problem.3.) There is no \"real\" indication of focus point when looking through the optical viewfinder. A large green box will appear to show you the \"rough\" approximation of where the camera is focusing, but it's simply not good enough, especially for macro photography. That means that while you may have set the focus point to the top left of the image, you have no way of knowing exactly where that focus point is when you're looking through the viewfinder because the box shown through the VF is so vague. This is actually a pretty significant shortcoming. The camera lets you actually shrink the focus points down on the LCD using the main command dial (for more precise focus on an object), but there's no indication of this through the viewfinder; the giant green rectangle still shows you roughly, but not exactly, where you're focusing. Not good enough, in general, but I think it's \"good enough\" for just using the center point. If you're shifting the focus point, stick to the LCD and don't bother with the VF.4.) 9fps is the max when shooting in RAW, and 12fps is the max shooting JPEG.5.) The X20 has the rather nifty feature the Sony RX100 has, and that is the focus->recompose feature (Tracking Autofocus). With the RX100 and X20 you can have the focus point dead center on the LCD, and lock it on whatever object you want to be in focus. Then you can move the camera (recompose), and the square will stay on the object you're trying to have in focus (yes, the focus square will shift position on the LCD). Essentially it's a focus->recompose tool where the recomposing still maintains perfect focus, and it works excellently!6.) Bokeh really is excellent with this lens. This can't be overstated.7.) You can see the lens through the viewfinder at 28mm, but at around 42-43mm the lens is no longer visible.8.) It's quite easy to change f-stop by mistake with the command dial or sub-command dial, so keep your fingers away from there. Those dials rotate VERY easily (especially the sub-command dial).9.) Any case that works with its predecessor, the Fujifilm X10, will work with the X20. I bought this one on Amazon, and it works perfectly!Ever Ready Black Leather Case Bag for Fujifilm FinePix X10Yes, it says X10 (subtly indented into the leather rather than obviously emblazoned in some funky-colored stitching), and since there are no specific X20 cases available yet (as of this edit), this a great clone of the Fuji official case.*EDIT* April 18, 2013:Still really enjoying this camera. The battery life I've found to be not great, though, so be sure to pick up an extra battery if you want to get more than a few hundred shots while you're out and about.In the comments for the review, it was brought to my attention that Marumi makes a 40mm filter that does fit the Fuji X20. Marumi 40mm DHG Lens Protect Filter for Fuji X10 -40mm- (Made in Japan) This will work great, and has the added benefit of you being able to put the lens cap back on, too (though not quite as snugly). The downside is that you lose the hood functionality the 40mm->52mm adapter gives you, and that the filter choice is not as great at the 40mm size. For example, I haven't been able to locate a 40mm (40.5mm will not fit) neutral density filter. Boo!While I linked a cheaper, third-party 40mm-52mm hood/adapter earlier in the review, Fujifilm makes their own 40mm-52mm hood/adapter, but it is more expensive. I'm including it here for reference, though:Fujifilm Lens Hood X10 for Digital Camera*EDIT* May 13, 20131.) I didn't mention this in the original review, but the X20 has a lens cap that must be removed before taking photos. You can always leave it off when the camera isn't in use, but that isn't recommended since you want to protect that excellent Fujinon lens. Conversely, the RX100 has an integrated electric cap that opens and closes on the lens when you turn the power on/off. In terms of convenience, the RX100 is hard to beat, though some might not find the \"manual\" lens cap too bothersome.2.) If you're left-eye dominant (i.e. you look through viewfinders with your left eye), you'll be able to rest the X20 against your nose like you do on an SLR, - when using the viewfinder. This is great for steadying shots. However, if - like most people, you're right-eye dominant, your nose will stick out to the left of the camera, and so doesn't help you steady the shot at all. Boo!3.) The build quality of the X20 really is excellent. While my love for the RX100 is no secret, it doesn't hold a candle to the solidity that comes with the X20. The more I use both cameras, the more I appreciate that about the X20.", "Date": "March 26, 2013"}, {"Title": "The master craftsman's artistic kid brother!", "Author": "nagappa", "ReviewID": "R2YDYMT2S28HAJ", "Overall": "5.0", "Content": "Background:--------------I am writing this review as owner of an Olympus OM-D EM5, regarded by many as the camera of the year of 2012.If one has taken the trouble to master the Olympus OM-D, for example with the help of David Busch's Olympus OM-D E-M5 Guide to Digital Photography (David Busch's Digital Photography Guides), one would feel instantly at home with the Fuji X20. If one can consider the Olympus OM-D to be a master craftsman, with its myriad of features and excellent menu system, then one might consider the Fuji X20 to be the craftsman's artistic kid brother!My impressions about the X20:----------------------------------First and foremost, does the Fuji X20 justify its premium price for a point and shoot camera in the thing that matters most, image quality? And does it have that special Fuji \"magic\"? The answer is an emphatic yes to both questions!The Olympus OM-D and the Fuji X20 are similar in many ways, starting with the retro design and excellent magnesium alloy construction, to the layout of the controls, the menu system, and scene and art modes. Granted the X20 offers only two custom modes to the OM-D's four, but the X20 also offers excellent macro capability, fast focus with face detection, and a blazing fast frame rate of up to 12fps (albeit with image size set to small).I feel that the X20's menu system and well laid out controls makes it easier to use compared to the Olympus OM-D. I also like the X20's quick access (Q) button better than the OM-D's live view/super control panel button.There is, at the present time, no book in English written specifically for the Fuji X20. (David Busch, please take note!). However, you can find excellent video demos online. (Go to youtube and look for \"Fujiguys\").The optical viewfinder (OVF) is quite good, although one must keep in mind that it only gives an 85% field of view and cannot be used for macro, due to the parallax issue. Still the OVF is more that adequate for shooting group pictures, where in the LCD information overlay, the focus area and autofocus confirmation come in handy. For serious picture composing I prefer to use the LCD screen.The X20 has an excellent 28-112mm F2.0-2.8 lens, that is capable of pulling in plenty of light rendering sharp focus in all focal lengths. This lens, coupled with its 2/3\" sensor (largish for a point and shoot) with the latest X-Trans CMOS technology, and lack of anti-aliasing filter, make for sharp 4000x3000 images with awesome color rendition. It also comes with an excellent optical image stabilization (OIS) system, and I have been able to capture sharp pictures taken at 1/4 second.The image quality on the Fuji X20 nearly rivals the sharpness and tonally nuanced colors of my Olympus OMD with the excellent Olympus 14-54mm f/2.8-3.5 II AF Zuiko Lens for Olympus Digital SLR Cameras (which I have reviewed). I was also pleasantly surprised by the camera's 2X digital tele-converter, which is able to generate pretty good full sized (4000x3000) jpegs which are hard to distinguish from a non-interpolated image unless you pixel peep. In fact I have set the Fn button to the digital converter mode. This effectively gives me a zoom range of 8X (28mm - 224mm), making it useful for photographic wildlife and sporting events!Understanding the limitations of the X20:----------------------------------------------Having said that, the smaller sensor which has roughly a fourth of the area of the micro four-thirds sensor on my Olympus OMD (and roughly an eighth of the area of the APS-C sensor on the Fujifilm X-M1 Compact System 16MP Digital Camera Kit with 16-50mm Lens and 3-Inch LCD Screen (Silver)) imposes some limitations both in terms of high ISO/low light performance as well as shallow depth of field and background blurring (bokeh) capability.In terms of noise, this means that an ISO800 image taken under similar lighting conditions from the X20 will have perhaps the same level of noise as an ISO1600 image from an Olympus OM-D and an ISO3200 image from a Fuji X-M1. In terms of depth of field and bokeh, an F2.0 image from the X20 will have about the same depth of field as a F4.0 image from an Olympus OMD and an F5.6 image from a Fuji X-A1 or X-M1.Given that Fuji has packed in so many pixels (4000x3000) into a 2/3\" sensor, if you \"pixel peep\" you may notice artifacts such as water-coloring and smearing when viewing full (100% crop) pictures taken under less than normal lighting conditions.(For \"pixel peepers\" only, the smearing is especially noticeable landscape shots that include grassland and foliage. One way to get around the smearing issue is to shoot in RAW and use the RAW converter in your photo application such as Apple's Aperture or Adobe's Lightroom. But you will lose Fuji's proprietary film simulation modes in the process. Another way, that is recommended by many in the Fuji X20 user community, is to set the in-camera noise reduction to the lowest setting (i.e., -2). This approach does result in grainier images, but detail is preserved. My personal preference is for grain rather than smearing).For the above reasons, in my opinion, the Fuji X20 is NOT a replacement for a DSLR or compact system camera. You cannot win a battle against simple laws of Physics. The Fuji X20 is a companion to, not a replacement for, a DSLR or compact system camera!In weighing a purchase decision of the Fuji X20 versus the similarly prices Fuji X-A1 or the slightly higher priced Fuji X-M1, you must take the above considerations into account. Remember that the X20 has a F2.0-2.8 maximum aperture, which is a big advantage in low light! Under adequate lighting conditions, I have been able to get some pretty decent pictures up to ISO1600. For my best pictures, though, I don't go beyond ISO400 where noise starts to become apparentMy experience with the X20:--------------------------------Having talked about the science and limitations behind smaller sensor cameras, I must say that the Fuji X20 produces fantastic images for most situations except extreme low light. The images have that natural, detailed, organic, film like quality that make them very pleasing to look at. This is one of the main aspects that sets Fuji's X-series cameras apart from the competition.Fuji's proprietary \"film simulation\" modes give's one a wide range of artistic capability. The default Provia mode provides vibrant colors for all occasions, while Velvia is excellent for nature and landscapes, and Astia for portraits. The monochrome modes are awesome, and work great even in extreme low light conditions.Because the camera has excellent out of camera (OOC) jpeg images, I avoid shooting in RAW. The \"film simulation bracketing\" mode lets me take a picture and obtain three separate images of different film modes at the same time!Speaking of RAW, I am not a big fan of the supplied SilkyPix RAW converter. I use Apple's Aperture software for RAW conversion instead. SilkyPix's RAW converter is not even able to accurately match Fuji's proprietary film simulation jpeg modes (i.e., Provia, Velvia, Astia, etc.) that are available in camera. However, you can perform RAW to jpeg conversion in-camera on your backed up RAW images, using the X20's excellent in-camera RAW converter, after copying the RAW images from your computer back to the SD card. (This is perhaps the only reason I would shoot in RAW).(If you are interested in getting Fuji's film simulation modes after RAW conversion by SilkyPix, I can recommend Corel's AfterShot Pro, which has some neat plugins which simulates many of Fujifilm's proprietary film modes. Keep in mind that Aftershot Pro does not currently support RAW conversion for the Fuji X20.)In conclusion:-----------------Despite its high ISO limitations, this camera excels in its primary capability, picture quality! It is excellent, even exceptional for a point-and-shoot camera.  It has an easy to use menu system and well laid out controls. With this camera I just feel like shooting and don't worry too much about technicalities or pixel peeping. Out of camera jpeg images are excellent and often I don't worry about post-processing.Given the very large percentage of good to excellent images I am able to get out of this camera, I feel my expectations have not only been met, but exceeded by a wide margin.(For a set of my test pictures, please refer to the comments in this review where I will post a link).Recommended accessories:------------------------------1. Fujifilm X20 Leather Case for Camera (Black) (Note, this case will not work with the Fuji X20's optional lens hood system, but will work with a 40mm filter).2. Fotasy Pro 40mm MRC Multi-Resistant Coating Super Slim MC UV HD Filter for FUJIFILM X10 and X203. OP/TECH USA 4701202 Battery Holster - Black for storing spare batteries.4. Fujifilm NP-50 Lithium Ion Rechargeable Battery for Fuji F60fd, F50fd & F100fd Digital Cameras - Retail Packaging5. Gariz Genuine Leather XA-CFX10BR Camera Cap Fixs for Fuji Fujifilm X10 X20, Brown (Stylish lanyard for your original Fuji X20 lens cap. Prevents it from getting lost).Other products to consider:------------------------------1. Sony DSC-RX100M II Cyber-shot Digital Still Camera 20.2MP, Black2. Nikon COOLPIX P7800 12.2 MP Digital Camera with 7.1x Optical Zoom NIKKOR ED Glass Lens and 3-inch Vari-Angle LCD3. Fuji X-M1. (I would recommend you read Avi Shrestha's excellent review of the X-M1).4. Fuji X-A1. (Prices exactly as the X20, and similar to X-M1 in all respects, but lacks the X-Trans CMOS sensor which eliminated the anti-aliasing filter. Thus sharpness on the X-A1 is reduced slightly).", "Date": "September 16, 2013"}, {"Title": "The Tiny X-Pro?", "Author": "Nathan D Jedinak", "ReviewID": "R367YW4M3605LW", "Overall": "5.0", "Content": "Last Autumn, we took a family trip to the wonderful island of Oahu in Hawaii.  I hadn't been to Hawaii in many years, and was very excited to shoot photos during our fun family adventure.  It was just as beautiful as I remembered, and I had the excellent Fujifilm X-Pro 1 along to capture the colors and mood of the Islands.While on the trip, I expected to see all sorts of wonderful cameras, and I pre-supposed that I'd see a few X-Pro's along the way.  However, while I did see many of the normal DSLR's, I noted throngs of traveling Japanese photographers carrying along a little Fuji I knew as the X10.  While I did see one other X-Pro on that trip, it certainly stuck in my mind that the X10 had to be one of the most popular cameras on the island.  This surprised me, as I always considered the X10to be the \"inferior little brother\" of the \"real X-cameras.\"  I know of the culture of miniaturization in Japan, but beyond size, I wondered: am I missing something?Much later, I noted the announcement of the Fuji X20, which essentially appeared to be an X10 with a better viewfinder (including shooting information), better autofocus, and an application of the X-Trans sensor technology in the 2/3\" sensor size.  This really intrigued me, and I decided to answer that question (\"am I missing something?\") by ordering an X20 from Amazon.The first X20 that arrived was clearly used, even though I purchased a new model.  I was disappointed, and even more so when I found out I couldn't receive a replacement from amazon, I had to ship it back, get a refund, and order a new camera.  I figured if I had to go through all that trouble, I might as well take a few shots to see what I thought; if I ended up unimpressed, I could always just not order another.  I only shot a few frames while out for dinner one evening, but I was quite pleased with what I saw, finding it particularly good at black and white, with a fairly characterful rendering by the fast zoom lens.  The autofocus was snappy and positive, and I REALLY liked the twist-to-zoom lens with \"35mm equivalent\" marked focal lengths.About a week later, I received my 2nd X20.  I had the great fortune to receive it on a Friday afternoon, just before a beautiful weekend where I had a good amount of leisure time to put it through it's paces.  Perhaps surprisingly, I have already answered that question all the other Japanese tourists knew: YES, I was missing something by discounting the X10/X20…  This really is a great little camera.Certainly, compact cameras have come a LONG way in the past few years.  One could argue that they had to--otherwise the cellphone-cam-shooting public wouldn't buy them in any numbers.  With each year, compact enthusiast digital cameras get better and better--not only in specs, but in haptics, operation, and image quality.  I feel like Fuji, in particular, has really been on a roll lately; although their cameras aren't always the best at a pixel-peeping-level, they sure feel built by photographers, for photographers.  The X20 felt just like a mini X-Pro 1; the controls are in the same place, you have the same options for configuring and shooting, and it just disappears in your hands and lets you shoot, chasing your muse.I feel like the X20 is skirting the ability to satisfy completely; in good light, the image quality is stunning, with excellent \"pop\" and 3-dimensionality from it's images.  I didn't expect this from such a tiny sensor, and it has just enough subject separation that you do get a nice \"feel\" to the images.  You're not going to vaporize backgrounds, and the fujinon zoom isn't the smoothest of bokeh renderers in some situations.  But there's some of that X-Trans magic in there (smooth tonality, rich color palette, nice quick transition between in-focus and oof).  Although not as forgiving as the bigger APS-C X-Trans, and very quickly as you move up the ISO ladder you get a lot of noise and lose some of the tonal magic, there's just enough performance in there to reward exploring the envelope a bit.When you do explore the envelope, you find a camera that responds intuitively, quickly, and positively.  The autofocus positively rocks--if the X-Pro were this good people would swoon, selling their SLR's in droves.  Maybe not, but I speak in hyperbole to emphasize that this little camera didn't stand in my way like so many little cameras of the past--I felt free to use it just like I would my DSLR.  There were occasional missteps when shooting with the OVF (the X20 does help with parallax correction, but its response takes some getting used to), and sometimes the tiny sensor just couldn't quite give me all the tonal details I wanted, but to be perfectly honest--there were just as many times that I let the camera down, so I can't lay all the blame on the little X20.I'm also finding the film simulations to behave quite well; I had an X-S1 last year and while I really enjoyed the fun of having such a flexible (and well built) all-in-one camera, I found the image quality wasn't any better than my Pentax Q and the film simulations behaved nothing like those on the X-Pro.  It's no secret I loved the film sims on the X-Pro; for me, it's very freeing to have so many \"film types\" built into the camera.  I'm old enough to have many experiences of walking around with a roll of film in my camera, and thinking, \"oooh, I wish I had X film loaded instead of Y film.\"  Certain subjects simply lent themselves better to one emulsion over another, and learning the ins and outs of those emulsions stimulated creativity and enhanced artistic intent (IMO).  I remember when I got my first digital camera, and I thought, \"this is sweet--I can shoot every film type I want, changing every frame if I wish!\"  Only that proved completely untrue…  Digital cameras simply pumped colors one way or another in a very unnatural fashion.  Until the X-Pro.  Excepting the Velvia film simulation, which I still feel is the furthest from \"real\" feeling to me, I dearly love the other film sims and the highlight/shadow tone controls Fuji gives to tweak their response.  Although the X20 behaves a bit different from the larger X-Pro's X-Trans, especially in the tone curve area, I am finding the sims and tone curves every bit as useful and fun as those in the X-Pro.  My favorites on the X-Pro are quickly my favorites on the X20 (monochrome Y and G, Provia, Pro Neg Std, and Astia).  I'm very pleased that this little 2/3\" sensor has enough color depth and richness to pull this off.Speaking of the X-Pro 1, the X20 handily beats that camera in speed.  Focusing, image review, in-camera RAW development, burst speed; all are noticeably faster in the X20 than the flagship X-Pro.One more quick mention of a feature not often discussed: Face detection works brilliantly, and the viewfinder overlay even shows the detected face with added parallax correction, so I'm finding myself using the OVF quite a bit with \"people photos.\"  This is fabulous, as any OVF allows one to focus on expression in real-time, grabbing just the moment you want.  This is a fabulous camera to shoot kids, with fast focus acquisition and parallax corrected OVF, you can really grab those beautiful childhood moments.Limitations?  Yes, other than the smaller-than-APSC performance envelope mentioned above, there are some things that limit one a bit.  You do get some DoF control, but not as much as you do with a larger sensor.  Bokeh is usually quite good, but some light sources are rendered as a hard-edged ball with a distinct center bullseye; not so pretty.  The JPG engine is heavily biased towards noise reduction, and even with it at -2 (which I leave it at, all the time!), it's too heavy.  Color depth and richness is good-to-excellent at base ISO, but never reaches the drown-yourself-in-richness of the X-Pro, and suffers quite a bit as ISO rises.  In some light you just won't get the color flexibility of the larger camera.  High ISO capability is good, and coupled with excellent image stabilization you can shoot in almost any light, but I won't use >ISO 800, to be honest.  Things just get too smudgy up there, and color accuracy and richness becomes iffy in some light around ISO 800 and goes downhill fast after that (although nothing like the Sigma Merrill cameras, which take the cake for worst high ISO performance of any camera!).  Battery life isn't great; this is the same battery as used in the Pentax Q, and it gives about as many shots as it's mouse-sized impression would lend you to believe (around 200).  You may need more batteries.  I'm thrilled with the parallax correcting ability of the focus point in the viewfinder overlay, but it takes some study to master, and since I haven't mastered it yet I still miss OVF shots on occasion.Quick comparison with the Sony RX100: I owned a Sony RX100 for some months, and although I was (and remain) astonished at the pure image quality that the RX100 can deliver in good light, I ended up cooling to the camera over time.  Firstly, it feels like a computer, not a camera.  The X20 is obviously built by folks that know photography as an art form, and not a spec sheet.  The RX100 feels like a tech toy.  Is this a problem?  It can be; if the tool doesn't \"disappear\" in your hand, your art will suffer.  Some won't care, and that's ok, although the X20 produces stunning files at low ISO, the RX100 will be a bit \"better\" from a sharpness and detail perspective, at least (color is another matter).  Secondly, the RX100 requires one to use an external RAW editor to get the best out of the camera.  As a family/travel camera, I don't want to sit behind a computer and edit RAWs for hours on end; the X20 gives you excellent RAW processing right inside the box.  Thirdly, the RX100 wasn't durable for me.  Mine broke just carrying it in my pocket.  Sony fixed it fast, but I lost faith in the camera as a pocket camera.  Time will tell with the X20, but it certainly \"feels\" better built than the RX100.All in all, I am really enjoying the flexibility that it gives--it's like a tiny X-Pro 1 with 28, 35, 50, 85, and 105mm lenses all in one…  Dial up your preferred focal length, look through the bright real-image OVF, and shoot like a tiny rangefinder.  What fun!  There are limitations, briefly touched on above, but I encourage you to try the X20 before dismissing it as the \"inferior little brother\" of the X camera line..!  I now see why all those tourists carried the X20's predecessor--although it won't have quite the performance envelope of the bigger-sensor cameras, you gain flexibility and a really carefree attitude towards shooting that seems to fit a vacation.  No one is paying me to shoot my own travel, in the end.  And I did find myself wishing I had the XF zoom for my X-Pro on occasion.  So why not an X20?", "Date": "May 24, 2013"}, {"Title": "Outstanding performance and fun -- replaced my SLR, no regrets! [Updated with tips]", "Author": "Candid Reviewer", "ReviewID": "RU1ODK72H7VSJ", "Overall": "5.0", "Content": "The Fuji X20 is the first point-and-shoot camera that I have found to be a fully acceptable replacement for an SLR. In fact, I traded in my Nikon DSLR and extensive lens collection when I made the switch to the X20. After a couple weeks of use, I have NO REGRETS!First, let me assume you're NOT a professional photographer who sells prints for a living, but an enthusiastic and experienced amateur like me--someone who derives pride and enjoyment from snapping excellent pictures, and who is wondering whether this camera will perform well enough to satisfy you. Here's the short answer: If you hold your pictures to high standards for clarity, color, and sharpness, WITHOUT obsessing about post-production editing or nit-picking about \"flaws\" that are only visible when you \"pixel peep\" at 100% magnification or beyond, this camera will absolutely satisfy you. However, if you enjoy spending hours tweaking levels and pixels in Photoshop or Lightroom, or if you measure quality by scrutinizing flaws at 200% magnification on a computer screen, you'll be happier with a DSLR or CSC with a larger sensor and better high ISO and low light performance. The X20 yields exceptional photos that will stand up to a reasonable amount of editing and should satisfy the artistic side of almost any photographer, but it will not match the richness and editing flexibility of RAW files captured on larger sensors. I don't consider that a serious downside, though, since the X20 is absolutely capable of producing breathtaking images.In short, the X20 is the ideal \"every day\" \"take anywhere\" camera for someone who wants to experience and enjoy life without the camera getting in the way, without settling for mediocre shots from a smartphone or run-of-the-mill point and shoot, AND without having to abandon the pleasure of having total creative control over the camera's functions.Why get rid of my DSLR? In a word: convenience. I found myself using my DSLR less and less--especially after my kids came along--because managing all those lenses and the bulk of the camera itself became a chore. Years ago, when I was single, it didn't bother me because I could dedicate a whole day to photography and even enjoyed hauling around a bunch of cool gear as I went questing after an awesome shot. Now, I have a (growing) family. While I'm certainly keen to snap photos of my children as they grow up before my eyes, I keep finding that multiple lenses, large camera bags, and a bulky DSLR body just get in the way of enjoying the experiences I'm trying to photograph. Sometimes, they even forced me to miss out on certain experiences because expensive camera gear doesn't mix well with some activities and \"someone\" has to watch the gear after all. So, I switched to a mid-priced point-and-shoot with a long zoom for awhile (Panasonic ZS1), and I even tried relying on my smartphone's camera for awhile (Samsung Galaxy Note 2), but I was frustrated that the resulting images offered little to no post-processing flexibility and had to be confined to small prints for pleasing results. Those cameras also didn't offer any of the delight I had often felt while using my DSLR with its more robust creative controls.In the X20, I have found the perfect solution, and it doesn't feel like I had to compromise at all! Trust me, someone who invests the time to learn the nuances of this camera (and understands good composition) will be able to produce STUNNING photos. Yet compared to an SLR or CSC, the X20 will do it with less weight, less bulk, more convenience, more discretion, and more fun! Moreover, it can produce nearly comparable image quality except under certain conditions, such as very high dynamic range shots, ultra low light photography, or very large prints--all of which will fare better with larger sensor cameras.Here's another reason I switched over to the X20. This is a camera my wife and kids can operate. My wife doesn't share my enthusiasm for photography, but she does appreciate good pictures. Since she wasn't interested in learning how to use my DSLR, I went missing from whole albums of vacation photos because I always had to be the one behind the camera! Fortunately, the X20 has an excellent Auto mode (two actually) so she can simply point and shoot to get great results. Yet it also offers a full suite of manual controls to satisfy my deeper creative urges. Think of the X20 as a camera that can please virtually anyone--from those who like idiot proof point-and-shoot simplicity, to those who like user-friendly pre-set modes for more playful or stylized photos, to those like me who want total control over every nuance of the camera's operation. The X20 fulfills all those roles extremely well.What else should you know about the X20? I'll elaborate briefly on a few things other reviews seem to shortchange or ignore. Obviously, the X20 can produce excellent still images. However, its greatest weakness (relatively speaking) is the video capture, which is a little odd and finicky. Certainly, it's better than the average smartphone's video capture and it is possible to get some very good results, BUT... (1) the autofocus can be finicky and may periodically \"seek\" back and forth, blurring your scene; (2) it captures video at 1080p or 720p, but only at 60 fps (there is no 30 fps setting, which is strange and yields larger file sizes); and (3) it offers very little control over video capture settings. On the upside, you can adjust microphone levels, the camera's integrated microphone is pretty good, and in good lighting, I was able to capture smooth, crisp videos of my children at play. I think it will be fine for basic video capture, such as making YouTube videos or commemorating special moments, like a trip to the zoo. However, if you're a budding cinematographer or video is a high priority for your needs, this camera is NOT designed to excel in that regard. Other reviewers are correct that video feels more like an afterthought here. Hopefully, a future firmware update will offer expanded controls or a 30 fps option for HD capture. It's surprising to find video so neglected on a camera in this price point.As for battery life, many reviews complain about the short battery. I think they're exaggerating the problem. After fully charging the OEM battery from Fuji, I set the camera to \"High Performance,\" but then changed Image Stabilization to the #2 setting (only on while depressing the shutter), lowered the LCD brightness to -2, turned off focus tracking, lowered the system sound volume to the lowest volume, and set the autofocus to AF-S (single instead of continuous). At those settings, I was able to capture 301 pictures on the \"Fine JPEG\", including 10 with the flash, four large panoramas, and a few dozen low-light shots that required the AF illuminator to assist, PLUS about 12 minutes worth of full HD video recording. During that time, I also played with the camera menus and settings a lot, reviewed most of the pictures on the LCD screen, and relied more heavily on the LCD than the optical viewfinder. Whenever I wasn't taking shots, I turned the camera off instead of letting it go into sleep mode. I also did not use \"Quick Start,\" which would have placed a greater drain on the battery. (I found the X20 able to start up and snap a shot in under 2 seconds even without Quick Start enabled, so it didn't feel necessary.) If you buy one spare battery, you'll be well prepared for a full day of shooting. However, if you're planning a longer trip or will not have regular access to an outlet for charging, consider buying multiple spares.As for the lens, it is fantastic and Fuji did a superb job matching it to the sensor for optimal quality. This camera can produce photos that few people would guess came from a point and shoot. But I haven't seen any reviews mention the fact that, in addition to the optical 28mm to 112mm range, the X20 also has an \"Intelligent Digital Zoom\" option that automatically doubles the focal length. Although it is a digital zoom (which I usually disable and regard as useless), this one is surprisingly capable and was able to produce some remarkably crisp results. If you need a little extra reach in a pinch, you can map the \"Intelligent Digital Zoom\" function to the function (Fn) button for easy access. Then, with just one press, you can transform the long end of your lens from 112mm to 224mm! I wouldn't have believed the quality if I didn't try it myself. If you do your part, the resulting pictures do not look like they were taken with digital zoom. In fact, I'm not quite sure how Fuji pulls this off without the typical pixelation and smudging, but a few of the shots I captured this way look like they were shot through pristine optical glass. I won't need it a lot, but I'm pleased to find that it's actually usable.There's much more I could say, but there are already many good X20 reviews out there. I just wanted to share that even a serious, enthusiastic amateur like me finds the X20 to be an IMPRESSIVE camera, and a satisfying replacement for a DSLR. Does it sacrifice some image quality compared to DSLR and CSC cameras with larger sensors? Of course. But don't get too lost in the technical specs and nit-picky pixel comparisons. Most folks would be hard pressed to distinguish a difference in the quality of the resulting photos, assuming you acquaint yourself well enough with the X20 to learn its nuances so you can get the most out of it. More importantly, I suspect you may find that the compact size of the X20 and its excellent, versatile lens will make you far more likely to bring your camera with you more often. Indeed, I find it truly liberating compared to the chore of hauling around multiple lenses, tripods, and other gear. I've NEVER experienced a point and shoot that felt this satisfying to my photographic sensibilities, or that delighted my gadget-loving fascination with thoughtfully-designed equipment, or that offered such deep rewards for patiently exploring its feature set and capabilities. This is truly a great camera.You might find other cameras that have more options, or that offer equivalent control. You might find other cameras that are slightly more user friendly, or smaller, or which take better video. You might find a few with an optical viewfinder, or slightly better image quality, or a faster lens, or a longer zoom, or a larger LCD. What you will NOT find is a camera that strikes a more ideal balance of all these qualities and contains them in an appreciably compact, exceptionally well-built, satisfyingly well-designed, highly functional package. Fuji really hit a home run. I love it and I bet you will too. Not only do I give it 5 stars, but more tellingly, I have no regrets about trading in my DSLR. Very highly recommended! If you want to look at alternatives, the only formidable competition in my opinion is the Sony RX100 II, which is more compact and offers slightly better image quality at higher ISO. However, I liked the ergonomics, the viewfinder, the faster lens, and the controls of the X20 much better.[UPDATE 9/27/2013: I finally had an occasion to make a very large print (2' x 3') to hang over the mantle in our living room. All I can say is WOW! I've been getting spectacular images out of this camera for awhile now, but this is the first chance I've had to make such a large print, and the results are indistinguishable from my previous Nikon DSLR! Since I'll likely never need larger prints than this, I can say confidently that this camera has all the imaging power I'll ever need. I'm stunned by the rich, sharp images I get from this little camera--and frankly, I expected to see more of the sensor's limitations at the 2' x 3' size. Nope! If you're shooting decently lit scenes and doing your part, I have no idea why one would prefer an SLR over this small, convenient, powerful X20. It takes awhile to learn how to maximize its potential, but it's awesome!][UPDATE 12/10/2013: A brief update after several months of extensive use... I continue to be delighted with this camera. Its compactness and light weight are its best features and the more you practice with it, the more capable it becomes. Plenty of power and versatility, but so light that I tote it around a lot more often--and actually enjoy toting it around--than I ever would've with my SLR. That means a lot more wonderful candids of the kids, and fewer annoyances of the kind that arise when you have to lug around heavier, bulkier equipment.The only two shortcomings I've consistently noticed involve low light. (1) There is some finicky behavior from the autofocus, which can be slow or unresponsive when the light isn't ideal, or when the focus subject is very small or low in contrast. (2) The low light image performance while shooting moving objects (i.e., my kids, who are always running and bouncing around) can be hit or miss. Even with a very solid understanding of the camera's features and quirks, you will have to be very aware and deliberate about what you're doing when taking shots of moving subjects in the evening, especially indoors with low lamp lighting or some other concentrated (not well diffused) light source. Otherwise, get used to blurring or use the flash. That's true for many SLRs also (depending on the lens), but this camera struggles more noticeably than my Nikon DSLR ever did. If you get it right, you'll still capture much better low light photos than the standard fare compact digital camera, but it's one of the only \"common\" shooting scenarios in which you'll frequently notice a significant performance loss over an SLR with a very fast lens. That means having to brace and steady yourself more deliberately, as well as having to wait for those brief moments when your subject pauses long enough--and then inevitably missing some pictures because your subject moved just a nanosecond too soon. If your subject is steady and you have a tripod, it's not an issue and the images are great: a little noisier/grainer than cameras with larger sensors, but it's controlled well--and you can't expect everything in a camera this size.Overall, despite wrestling periodically with these minor shortcomings and thus, missing a few great shots, I love it. And the compactness has certainly caused me to capture many more shots than I've missed since switching over from an SLR.][UPDATE 1/1/2014: X20 TIPS & TRICKS -- I thought I'd share some of the handy hidden shortcuts I've discovered over the past few months...- Press and hold \"Q\" for a few seconds to switch the LCD to outdoor/sunlight viewing mode. Repeat to toggle it back to normal brightness again.- Press and hold the \"DISP BACK\" button for a few seconds to switch the camera to Silent mode (disabling all sounds) for stealth photography. Repeat to toggle it back to your usual sound settings again.- Press and hold the Play (triangle) button for a few seconds to turn on the camera and review your photos WITHOUT rotating the lens to turn the camera on. Press the Play button again to shut it off again.- When reviewing photos with the Play button, you can instantly zoom in to 100% magnification to check sharpness/detail by pressing in on the thumb wheel (just above the \"AEL/AFL\" button). Press it again to zoom back out. It's much quicker than the zoom in/out buttons to the left of the LCD.- Obviously, you can move the selected autofocus area by pressing up on the circular pad and moving the AF selector rectangle to another area. However, you can instantly reset it to center by pressing \"DISP BACK\" instead of having to manually navigate back to center.- When setting up Custom dial settings (\"C1\" and \"C2\"), the camera mimics the properties of whichever mode is set (\"M\", \"A\", \"S\", or \"P\") when you save them to C1 or C2 in the menu. For instance, if you want C1 to be Aperture-priority, set the camera dial to \"A,\" input all of your desired settings, then open the menu and tell the camera to save your current settings to C1. Now, when you rotate the dial to C1, it will not only have those settings, but will operate as an Aperture-priority mode! (or Shutter-priority, Manual, or Program... whatever mode the camera was set to when you saved the settings).- For the best detail, you want a low ISO; however, keeping your C1 or C2 set to a low ISO by default really hinders your low light/indoor light performance for moving subjects. So I set C1 and C2 to Auto ISO and use the menus to set the maximum ISO to 400 (for C1) and 800 (for C2). This gives more flexibility. Then, I use map the \"Fn\" button to the ISO menu. When I want tack sharp photos, I can use my C1 or C2 settings, but if I don't like the Auto ISO's choices, I can force the ISO lower by using the \"Fn\" button and selecting a lower ISO. This override is temporary and is canceled any time you rotate the dial or turn the camera off and on again. I find this method gives me the best compromise of control-yet-automatic-flexibility for my C1 and C2 settings (which are where I leave the dial 90% of the time). If I'm snapping quick candids, I usually let the camera choose ISO (both my C1 and C2 are set to run in Aperture-priority also, as described above). But if I find a great subject and want really sharp and fine detail, then I force the ISO low (to 100 or 200) using the \"Fn\" button and take more care in how I shoot.I hope these shortcuts and tips help you!]", "Date": "August 20, 2013"}, {"Title": "Nice upgrade!", "Author": "JCC \"Tech Maven\"", "ReviewID": "RRJXZ9OIKBD7K", "Overall": "5.0", "Content": "I purchased the previous version of the Fuji X20, the X10, a year ago. I was so disappointed with it that I returned it.  Perhaps it was because of the version 1.0 firmware or that I bought a defective unit but the performance, especially the image quality, was very poor, like many other P&Ss.; The focusing was sluggish, the pictures were soft, the color was flat and inconsistent, and the visual defects such as chromatic aberrations and the infrequent but dreaded white orbs added to my dissatisfaction.  It was a real mess.However, like many others, I was in awe of its retro design. So, with the new X20 I took another stab at ownership with hopes that these aforementioned problems have been fixed.  Fuji said they made more than 50 changes.Here are the highlights of Fuji X20 changes over the previous model:* 12MP 2/3″-type X-Trans CMOS sensor => compared to the old EXR sensor, megapixels and size remain unchanged* On-chip phase detection autofocus, in addition to the contrast detection \u2028=> digital compact cameras usually have only the much slower contrast detect autofocus* `Advanced Optical Viewfinder' with electronic information overlay\u2028=> the old Fuji X10 has an optical viewfinder with absolutely no information superimposed* Full HD 1080/60fps movie recording (36Mbps bitrate)\u2028=> for a digital compact camera the bitrate is very good, which should translate into high quality videos with very little artifacts* Focus peaking display for manual focus\u2028=> give me a super fast autofocus any day, but for those who like to manual focus, this should make things a bit easier* Faster EXR Processor => faster response time, lower noise level, 12fps continuous shooting vs. the old 7fps.Fujifilm X20 key features* 12MP 2/3\"-type X-Trans CMOS sensor* On-chip phase detection autofocus* EXR Processor II* 'Advanced Optical Viewfinder' with exposure information overlay* 28-112mm equivalent, F2.0-2.8 lens with optical image stabilization* Manual zoom ring and lens retraction mechanism* Full manual control, RAW format recording* 2.8\" 460k dot LCD* Full HD 1080/60fps movie recording (36Mbps bitrate)* Built-in stereo microphones, optional MIC-ST1 external microphone* Film simulation modes for different color and monochrome 'looks'* In-camera RAW conversion with all processing parameters adjustable* 'Advanced Filters' image-processing controls, previewed live on-screen* Focus peaking display for manual focus using the rear LCD* Lens Modulation Optimiser for compensation of aberrationsSo, what's the verdict?  Wow! What a difference a year makes.First of all, say goodbye to the white orb issue of the first batch of X10s!  Since it's a new sensor, no white orbs.  I haven't tried in all conditions but so far, no white orbs in my test shots.But most noticeable improvements are the focusing and image quality.  The focus speed is now the same as some of those Olympus M4/3 cameras such as E-PL5. It's really is very snappy and responsive.The images are top of the class for small sensor cameras.  No, you're not going to get the same level of detail and resolution as the larger sensor cameras, no matter what the advertisements seem to suggest.  No more than you can get a Honda to drive like a Ferrari.  That means you can't really use this as your ONLY camera if you want the best images for your shots. But it fits the bill perfectly for casual photographers looking for a small, carry around snap camera.  The pictures are sharp. Color is fantastic, just like the old Fuji film.The new quick menu is a nice feature.  It would be even better if the camera had a touch screen so that you don't actually have to scroll around the quick menu. Perhaps that's a feature they will incorporate into the X30? The quick menu displays all of the most used settings for photo taking on a single page and you can move to each setting individually and use either scroll wheels to change the setting.The viewfinder is a real lifesaver in bright sunlight.  The LCD is almost useless in the sun but the clear OVF with information overlay is definitely helpful (I was just made aware that if you press and hold the Quick Menu button for 2 seconds it will activate the bright setting so that you can see the screen better in the sunlight, hold it for 2 seconds to turn it back off to conserve battery). Although, when in the bright sun it's sometimes difficult to see the information displayed in the viewfinder as it's in a dark gray font.  I wish it were a different color to make it stand out more.  Perhaps the next firmware update will address this? In dim situations, it's green so it's very readable.  The optical viewfinder is somewhat intelligent in that it will focus box around objects not in the center of the screen.  This is readily apparent when you're using the multi-focusing mode.  When you're using focus tracking mode, the you can only use the LCD as the optical viewfinder won't turn on.  That makes sense as you need to first pick a subject to track and it's easier to do that with the LCD.One other nice feature of the new camera kit is not actually part of the camera.  It's the battery charger.  It's small, about the same width as the equally small battery, and great to travel with.What's still a big disappointment is the fact that there's no RAW support for Apple's Aperture or iPhoto for the X10 since it has been out for over a year now.  That means that don't expect support for the X20 anytime soon.  I'm not sure if the problem is with Fuji or Apple's end but both of them need to get it together.  In the meantime, if you want to use RAW on a Mac you'll have to stick with Adobe Lightroom/Photoshop or Finepix/Silkypix, or what I like to call Crappix.Is it worthwhile for those who own the X10 to upgrade? It depends on whether or not you think the faster response time of the camera, focus, as well as better sensor are important enough.  I would only upgrade if I were able to sell the old X10 to recoup some of the expense. Otherwise, wait for the X30.Update 3/28/13I've been playing around with the Power Management function.  This allow you to chose between Power Save and High Performance modes.  Power Save is what I've been using as my default but I have switched it to High Performance to test.  Power Save will keep the LCD relatively low while the High Performance will keep the LCD bright as well as boost focusing speeds.  It IS slightly faster focusing on High Performance mode.  I would say about 25% -30% faster.One drawback is when you're trying to do quick successive focus on a moving object or trying to focus multiple times on different objects quickly, there is quite a bit of screen lag as you pan.  It's quite noticeable.I also noticed that the camera has a difficult time focusing on objects with essentially uniform color of black or beige and a smooth surface, or even just a cloudless clear blue sky.  I'm sure this is not just this camera but a weakness of other phase/contrast focusing cameras as well. Although I hope Fuji continues to improve on this and the screen lag with future firmware updates.Update 4/22/13It looks like Apple and Fuji listened and a new RAW Update 4.05 for Macs now has been posted that brings Fuji X20, X100S, X-E1 and X-Pro1 RAW compatibility. Yes!", "Date": "March 24, 2013"}, {"Title": "Professional Features of Fuji X20", "Author": "Roger Beck", "ReviewID": "R7EIYRFCO2MPK", "Overall": "5.0", "Content": "Professional Features of Fuji X20I ordered a Fuji X20 to play around with.  I have only used professional and prosumer cameras and an iPhone and this is my first point and shoot.  Fuji combined a classic film based rangefinder and and a point and shoot and came up with some serious retro camera candy.  A point and shoot is a camera that does not have removable lenses and is usually used for amateur photography. This is one miniature Nikon-looking, gorgeous picture-taking, perfectly-designed little point and shoot camera.It's silent.  It is all electronic, nothing moves when you take a picture.  When you turn the \"shutter taking\" sound effect off, it is a truly silent camera.  When you leave the effect on, it's a very slight \"whisp\", not click-y at all, reminiscent of a leaf shutter.  It also means you can hand hold it at slow shutter speeds.It's the size of an iPhone.  It's thicker than an iPhone, but has very similar height and width.  It is truly portable, easy to tuck away.Fast focusing and no shutter lag.  One of the main \"features\" of a point and shoot is that there used to be a delay between the time you pressed the button and the camera took the picture, that is known as shutter lag.  The absolute quickness of this camera to take pictures makes it a professional choice.Knobs, buttons, screens.  All right where they should be.Nice kit lens.  The X20 built in lens is a 28-112, 2.0-2.8, that makes it a prime zoom.  It is sharp at the edges of the image as well as the center area and at all lengths which make it a pro quality lens.It has a Fn button.  It's called a Function button.  You can set that button to do almost anything you want, call up the ISO, whatever setting you want to change ASAP.  Press the Fn button and you do it right away without submenus.  On pro camera this can be set to almost any focus or meter or custom setting, very handy in fast moving situations.12fps.  To get twelve frames per second in a professional Nikon body you would have to buy  a Nikon D4 for $4k and then its only 9fps.  The electronic shutter helps no doubt.Hot shoe.  Very, very handy. It's sort of a rebel camera.  (No pun intended) because it is so small and still looks like a classic rangefinder.  This camera is essentially a wolf in sheep's clothing.OVF. It has an optical viewfinder rather than an EVF or electronic viewfinder.  This helps with shooting in low light.  If a photography session were indoors and didn't use flash, that would be considered low light shooting.Macro.  It will focus as close as 1cm.  While it may used for general photography most of the time, being able to come in that close means not having to carry specialized equipment or a separate camera.Rubber grips.  So you can hold it firmly and accurately with one hand to take pictures without it moving or slipping down.  When you shoot candidly and quickly, you need a camera with a rubber (or leather) grip to easily position and hold the camera at different angles.Focus point selection.  The ability to move the focus point around the viewfinder.  This feature shows how serious Fuji is about making great cameras.  It is a feature you may not use very much but it is indispensable for shooting candids in which you may encounter any lighting or composition situation.Enjoy!", "Date": "November 23, 2013"}, {"Title": "This camera has re-invigorated my passion for photography", "Author": "Rich Manalang", "ReviewID": "R5VSB1MM6C81I", "Overall": "5.0", "Content": "I used to take lots of pics with various SLRs, both film and digital over the last 20 years, but have gotten lazy about my hobby. After picking up the x20, it reminded me all the reason why I love capturing photos. My SLR and my collection of lenses has taken a toll on my hobby over the years. The weight and complexity of today's SLRs has led me to lose interest over the years. Having to consciously think about lugging my gear around is a pain. The x20 makes it possible for me to always be equipped with a quality camera and lens so I can capture moments that I never would have with my SLR.I'm going to skip the pros/cons about the x20 because it's already been said over and over in these reviews and on the web. What I will say is that for me, the x20 isn't just like any digital camera I've picked up over the years. The x20 makes me want to make pictures. The results I've gotten are beautiful (see for yourself [...]If what you're looking for is something that's going to make you want to create beautiful pictures without the hassle of an SLR but without sacrificing image quality, the x20 is for you.", "Date": "July 23, 2013"}, {"Title": "Fujifilm X20 review", "Author": "Ranchibi", "ReviewID": "RZ6PG7M2ISMEK", "Overall": "5.0", "Content": "I was looking at the X10 and X100 but decided to wait on this model to come out. I don't own an X10 so I cannot compare the two. This is a great advanced compact and has all the features I was looking for....lots of dials make it easy to access control of certain functions, an incredible optical viewfinder that has a digital overlay that shows F-stop, aperature and shutter speed. It has manual focus peaking making it fun to focus. It has a wonderfully smooth manual zoom and, the whole camera is metal including the lens barrel....it exudes high quality craftsmanship! It's menu is expansive and deep giving one a plethora of shooting options...which can be learned using a well layed out paper manual. Take the time to read thru and learn these functions and it will suit you well in the field. Most importantly the photos are crisp and detailed with beautiful color saturation in each film mode. It is not DSLR quality close but, daylight pics are close enough and, the portability fun factor makes it a joy to use and, is the reason I got it...I will carry it because of those two factors. I shoot it in aperature priortiy with NR set to -1 and, I set the manual compensation dial to 1/4 over exposure since all smaller sensors tend to under expose most pics. Forgot to mention that the optical viewfinder automatically goes on when you put your eye up to view and, the LCD goes off automatically also and, vice versa. The Fuji colors in Provia, Velvia and, Astia are sublime when used for the right situations. Just the perfect high-end compact for me. The sensor is a 2/3 size making it larger than most all other compacts except the Sony RX100 and, Canon G1X (which really is not compact). The Sony is smaller with a larger sensor  but, to me does not handle as well and, the IQ in daylight pics is not enough and, at the telephoto end is much slower at 4.9 compared to 2.8 for the Fuji. The Fuji is more of a tool compared to the Sony which is a great point and shoot. The Fuji also has an incredible macro focus down to 1cm and, is very sharp there. The telephoto for my taste is perfect at 28-112 since I shoot mostly between 28-90. If you want a high-end compact that you can manipulate to your liking then look no futher!", "Date": "March 31, 2013"}, {"Title": "Love it.", "Author": "Reflections", "ReviewID": "R2ESXFRWD7ABBB", "Overall": "5.0", "Content": "I own Nikon D800 and have been looking for  a point and shoot with view finder and retro look, this is perfect. Pictures are sharp and colors are beautiful. Noise at low light is acceptable. I am totally happy with the camera.", "Date": "May 22, 2013"}, {"Title": "The best current high quality Point and Shoot in the market", "Author": "M. Rahman \"mzr\"", "ReviewID": "ROEEEF3K6ZJL", "Overall": "5.0", "Content": "Fujifilm has done it again! X10 was a remarkable powerful camera with quality and functionality that are many times absent from intro to intermediate level DSLR. In my personal testing X10 was better performer than Sony's RX100, Canon's S100 and G15. But that was just X10. So, when Fujifilm came out with an upgrade of X10 as X20, honestly, I got a little skeptical because sometimes an upgrade will ruin the original. So, I waited a little until I saw some sample images at some popular review sites. So finally, when X20 became available for shipment, I had to order it to try it out. Boy, was I surprised at the image quality and performance! X20 is not an upgrade to an already great camera X10 but an amazing high quality camera of its own class and distinction. Pictures are crystal clear with so much details. Focusing much faster than any other point and shoot I ever used. Works fantastically well in low light. Most cameras have lot of trouble taking decent shots in low light or indoors. But X20 is a champion of low light and the indoors. The macro and the super macro works flawlessly and the super macro magnifies tiny stuff quite a bit with awesome clarity. Bokeh in the zoomed wide aperture shots are also super sooth and looks great. Needless to say this is an awesome camera and I am deeply in love with it. If you are in doubt don't be. Get one and see it for yourself. I am sure you will fall in love as soon as you get it.", "Date": "May 6, 2013"}, {"Title": "Once your over the learning curve, a great portable camera", "Author": "George Dionne", "ReviewID": "R11C57THOQ0O5W", "Overall": "4.0", "Content": "I have never used an SLR camera and I am not a pro photographer. I have seen the SLRs and all the features they have but most confuse me. I just want to be able to point and shoot, have great photos, and not lug around lots of equipment. Now I can.With the X20s SR+ setting in place, the camera does all the work. It decides the most appropriate setting for low light, outside, up close, etc. Of course if you know what your doing you can play with the flash options, macros, shutter speed etc.If you are beginner or even intermediate I can't stress enough to read the instruction book. Even though the camera does all the work, it's not always 100%. Shooting photos of my live band was a little problematic on the SR+ setting. Most shows are in low lighting with minimal stage lifting and lots of motion. A lot of the pictures were blurry at first. Once I read the instruction book completely I found just the right settings for the shots. Now the pictures come out great!A great little camera that does the work of the big boys.", "Date": "May 16, 2013"}, {"Title": "Great Camera For Photo Enthusiasts - Highly Recommended", "Author": "C. Hill \"CFH\"", "ReviewID": "R3UWPIOAY4RTWX", "Overall": "5.0", "Content": "The Fujifilm X20 camera is an outstanding choice for the experienced photographer ready to take control of their photos! I have been using this camera for well over a month and have come to love the flexibility provided by the various modes and huge number of presets. We do a lot of product photography for our small business and have come to rely on our excellent, but aging, Fujifilm F200EXR, but this X20 is a far superior camera in all aspects. Here are my observations:Pros -+ Quality; this is a well made camera that looks and feels like it will hold up well+ Image Quality; the 12 MP images are stunningly crisp+ Lens; 4x optical zoom is sharp and clear with only minimal distortion at the farthest extremes+ Features; huge number of pre-sets and modes to suite any occasion, but also allows for full user control is needed+ Video Quality; surprisingly good video right out of the cameraCons -- Battery; I am not a fan of the NP-50 battery, which seems to drain faster than expectedI picked up the EzFoto 52mm Filter Adapter + Lens Hood for Fuji X10, with a free lens cap, which helps protect the lens.This camera offers so many effects and options that it feels like I have only scratched the surface after over a month of using it almost every day.Highly RecommendedCFH", "Date": "May 15, 2013"}, {"Title": "Fujifilm X20 Review by gooddady", "Author": "gooddady", "ReviewID": "R2B3JTWEPIXCZQ", "Overall": "4.0", "Content": "Received my X20 on April the second, a timely gift for myself on my birthday. I would like to congratulate Amazon for their great effort worked on Easter weekend so I may have it on time to celebrate.The choice of buying a new digital cameras has not been an easy tusk, as a long time DSRL user and adaptor of NEX system two years ago (I reviewed the NEX-5N) and owner of  Olympus XZ1, the demands of image and handling qualities are rather high. Recent full frame product has been disappointed due to oil on sensor issues, the good APC size sensor seems to stay at 16 mega pixels and the 24 mega pixels camera did not show advantage in image qualities over the NEX-5N. With these in mind, I took a different route and decided to get the Fujifilm X20 for its retro designing and the technology innovations inside.The all metal construction of the camera gave a nice feeling of rigidity and excellent quality. The camera fit nicely in my rather smallish hand, all buttons dials and knobs are located at the right places and within the easy reach of the fingers. The right side hand gripper is small however with the manual zone ring on the lens, this camera is a two hands version, therefore this is not a big issue. Handling of this camera is a pleasure, the focusing is fast and precise, the shutter is light and remarkably quiet, the optical view finder though only cover 85% the viewing area but come in handy at advisory light conditions, however the center focus point is not at the composed picture center, this really reducing the effective usage of this feature drastically, too bad.I managed to take some pictures with the new camera before the sun set. The jpg pictures look sharp and vivid particularly those taken with hand held super macro mode revealed remarkable amounts of details of the azalea buds. This camera is a photographer camera, the placement of the dials and knobs were designing intuitively so to operate the camera was very nature. There are enough manual controls to help the composition of desired pictures. Two issues stood out immediately; the tiny battery running out of juice rather quickly (granted not fully charged) and am I missed the build in ND filter of XZ1, using manual metering can utilize the 1/4000 sec shutter speed and using the wide open apertures, the details will be addressed in later sections.Some accessories have to be ordered before serious evaluation can be initiated; a spare battery, a faster SD card and a screw on Marumi 40mm DHG lens protector, no adaptor is required. For those interested, a 40mm circular polarizer is also available.As enough have been said about this X20 in various reviews, I would like to spare you of all those specification and technical details rather concentrate this review in real shooting secessions and addressing the focusing, image qualities, dynamic range, jpg vs. raw and raw conversion with different software issues and real data feedback. It is my understanding some of those topics were barely touched in reviews and hope this review could stir more discussions and inputs so we all can enjoy the X20 more.One thing I have to clear with those interested, \"do not expect the small sensor digital camera can perform miracles\" rather to look into the sensor technology, electronic and optical advancements in recent years. Now, we can enjoy the image quality of the photos from small sensor cameras that few years ago only DSL can deliver. With this said, lets see what the camera can do in every day shooting.The review will performed in following categories;Section 1: Initial shooting in raw and jpg, the differences, super macro marvelous,Section 2: Raw conversion with software vs. in camera raw conversion,Section 3: Low light focusing dilemma at a church wedding in Honolulu, Hawaii,Section 4: Some unexpected twist of camera setting and operation,Section 5: My conclusion, rating and wish list.Here we go;Section 1On the fourth day, a lovely sonny morning I took the camera to the city park of Swam Lake to run some initial tests, the flowers were in full blooming and scenery were plentiful.  Loaded with the partially used battery, set at ISO 100, I managed to take around 70 pictures in raw format. As said the camera handling the shooting nicely, the focus was fast and lock on target precisely, non of the picture has show signs of out of focus under the good lighting conditions. most photos were taken with the pattern metering setting and aperture priority AE mode.Examining the photos in Lightroom 4.4 with newly release ARC 7.4 revealed rather flat converted pictures; the color was not as saturated, the azaleas and tree leave looked little fuzzy and the picture appeared to have a light mist layer coating random the pictures not as sharp as should be. With the white balance set at auto, the pictures also look on the cool side.Loaded with a fully charged battery and a spare in the pocket, I started shooting in jpg to examine the difference in imaging qualities. At this secession I began to feel missing the build in ND filter of my XZ1filter badly. In aperture priority AE shooting mode, the shutter speed max out at 1/1000 sec, impossible to take the advantages of using this fast zoom lens. When shooting the beautiful white cherry blossom at wide aperture of f2.0 to f2.8, I have to use either speed or manual shooting modes to obtaining proper exposures.  It was confirmed 1/4000 sec shutter speed can be used in both settings. In program AE mode, the camera tends to shooting at higher f number instead wide open apertures. For example, with my black basil watch laid on piece of white paper shooing at 112mm, the speed priority AE achieved 1/4000 at max f2.8 however, the program AE revealed the setting of 1/1600 sec at f 4.0.The jpg pictures were judged to be more saturated, brighter, and, sharper than the raw counterpart! but blown highlights became problematic. The hand held super macro shots were beautiful and vivid.  Oh, the battery lasted for 200 plus shots including the time of my fumbling with those knobs, dials and wheel.The jpg vs. raw issue warranted additional investigation and test.Section 2In my case, there are three ways to convert the X20's RAF raw files namely my de facto Lightroom 4.4, Fujifilm's raw convert powered by Silkypix and the in camera raw converter. Shots taken with a make shift in door setting using color books and a green vase plus selective outdoor shots, some interesting results were found;Lightroom 4.4 converted photos appeared to be flat not as sharp but true to the colors of the originals and retained the dynamic range.The Fujifilm raw converted casted a yellowish tint over the pictures particular in those low light shots. I judged the pictures were slightly shaper than those converted with LR 4.4. and retained a little more surface details but not likely I am going to use it.Using the in camera raw converter just like a blind date, you can not see the other until it was done. Alas, surprise and surprise, the resulting pictures were amount the best so far I can get my hands on. The pictures were judged to be vivid and sharper however, the highlights blown out is a blemish, histogram confirm this problem. The various combinations of setting choices allow to obtain the pictures to your taste, patient is required.Section 3Took the camera to a wedding in Honolulu. The wedding was in a church with light from side windows and overhead fluorescent light, the X20 began shown some hesitation in focusing. At ISO 400, lots of blurred shots at 1/30 ~ 1/40 sec and f2.8 surprised me, I still can not figure out why, helps are needed here.Section 4During my in camera raw conversion of the ISO 100 shots, I was stunned that the program does not allow to correct the over exposes photos that is -1/3 EV an beyond is a no go. Reverted to ISO 200 than you can freely correct the exposure all the way to -1.0 EV, Why Fujifilm?My conclusions: Four stars out of FiveAfter almost two months of continue shooting with my X20, I really enjoy to use this beautifully crafted and features loaded cameras. The were restriction, surprises and short comes, however once you understand and familiar with the operation of the camera than you shall be happy with it. In good lighting, the pictures from in camera raw conversion were vivid and sharp. At low light conditions the pictures taken in ISO 640 to 800 were quite acceptable. You will carry the X20 with you more than you usually do and get pictures you can enjoy.I wish Fujifilm can remove the restrictions of Aperture exposure speed and ISO 100 exposure correction by firmware update. The miss ND filter is still missing!", "Date": "May 28, 2013"}, {"Title": "The Ultimate Shooting Experience", "Author": "mofmd", "ReviewID": "R174XDIHT4M2MW", "Overall": "5.0", "Content": "Fujifilm X20 Silver 12 Digital Camera with 2.8-Inch LCD (Silver)After researching the Sony RX100, Sony NEX6, Canon G1X, Panasonic GF6 I concluded that the Fujifilm X20 was a perfect fit for me. I recently graduated from a Nikon D5000 and was terribly disappointed with results.  I was looking for a camera with the quality of a DSLR with the size, weight and portability of a point and shoot. It was daunting for me to think about hauling the big DSLR and lenses around with me when I travel to Europe in the fall.  When I travel the camera never leaves my possession so therefore size and weight are a huge consideration.  I consider myself an average amateur photographer who likes the flexibility of a camera that I can control as well as having a fully automatic point and shoot.The first thing you will immediately notice with the X20 is that there is no shutter lag.  You don't miss those candid shots because the camera is processing the last shot.  The flash recovery is quick and the photos are crystal clear.  The fast 28mm-112mm, f2.4 zoom lens gets the job done. You will notice the sharpness of each photo first thing.  For example I took a picture of my dog from about 15 feet and her eyes were discernibly brown.  The clearness of her eyes never showed up when I took similar shots with the D5000, they typically looked black and I could never get the eyes fully in focus.  The color and contrast is spot on.  I do not have to spend considerable time in post-production working in Photoshop fixing the color and contrast.  This is a huge plus when you take a significant number of shots.I highly recommend this camera for folks like me who are photo enthusiasts but have reached a point where you no longer want to haul around sizable DSLR and lenses but still want the control and quality.PS: Check out the sensor CMOS 2/3, optical zoom 4x, 12mp (don't get hung up on megapixels the sensor size trumps mp).", "Date": "July 4, 2013"}, {"Title": "A photographer's camera", "Author": "Luis Vergani", "ReviewID": "R2S8QE1XDVPPXY", "Overall": "5.0", "Content": "Update October 2013* Short version *The X20 is helping me to make better photos and rather forget about the camera. I suspect I will stick to the X20 for quite a while.* Longer version *After six month using the X20, I just love it!It feels like a real camera. To start with, no need to switch it on, as it comes instantly alive on deploying the otherwise retracted lens.Mine goes around protected, discreet and ready dressed on a permanent Fotasy 40 mm UV filter and a Megagear old-way-looking black leather case.For fast action, looking through the viewfinder and using AFL, the delay is just that between human brain and human finger.If so needed, it can be made to work silent. I mean, really silent as only a leaf shutter can.The tiny built-in flash is super intelligent at filling-in portraitsPicture quality beyond reproach. On average shooting conditions, for average purposes, indistinguishable from an ASP-C DSLR: fine detail, natural colors, no burnt highlights nor overcontrast.JPGs out of the camera look nice - but I got spoiled after discovering PhotoNinja, a converter that pulls out magic out of the X-Trans RAW files. X20 and PhotoNinja seem to bo born for each other: hi-tec hidden below the hood, user friendly, great output.Cameras do not take pictures. People do.Thanks, Fuji!", "Date": "June 12, 2013"}, {"Title": "Sorry DSLR...", "Author": "Robert Bursk", "ReviewID": "R3R6D2J6ZHCMMH", "Overall": "5.0", "Content": "I'm incredibly impressed with the quality of this camera.  I have a Canon DSLR that is (was) my main camera, but it's too bulky to travel with on a daily basis. I ordered this camera as my all-around, every-day camera.  Even though this is a fixed lens, the quality of the glass and decent range make up for the inability to swap lenses.  I don't know if I can add any more information or word anything better than the other reviews, but this is a great camera and I love it.", "Date": "May 16, 2013"}, {"Title": "A good camera to keep with you!", "Author": "JaySin", "ReviewID": "R2K5U58OWX0K8H", "Overall": "4.0", "Content": "I must preface this by saying that I am a pro photographer. My taste and needs have changed over the years and no longer am I carrying around a clunky DSLR. I have opted instead to arm myself with the incredibly capable OMD-EM5 for the majority of my work, a Leica M9 for those days where I feel like being more of an artist than a photographer and now as my everyday camera I have opted for a fixed lens and have purchased the X20. Over the years I have shot several film Fuji's but never a digital and I am pleasantly surprised by the quality. When researching my OMD I did consider the xPro1 but let it slide since I really needed an AF that was more responsive for work needs.The x20 does not disappoint in terms of AF speed. Most of the time it is quite fast and when it does not work as quickly as Fuji claims it is still quite acceptable in terms of speed and I have not missed a shot. I am not one for DXO marks or running through a spec sheet but prefer to work on camera selection based on what I can see and feel. You know you have a wonderful piece of equipment in your hands when it just feels right and the images impress you upon viewing them before any post processing work has been done. I felt that way about my M9 and my OMD files and now with the x20. The lack of an AA filter really does well to increase sharpness and the firmware does wonders in terms of reducing noise and moire. I honestly say that I was incredibly surprised with the image quality of the x20 and in comparison to my OMD and M9 files I can't say that this was not a wonderful purchase. The zoom range is sufficient for most encounters, the constant aperture of f2.8 is a wonderful feature and the camera honestly feels like a nice solid piece of equipment rather than a cheap piece of plastic.The x20 will be the camera I keep in my messenger bag so that I have a digital with me at all times. I feel that in addition to the film camera's I keep either in the car or my bag this will keep me quite happy for some time.", "Date": "April 3, 2013"}, {"Title": "ALMOST PERFECT LITTLE CAMERA 5 stars down to 3 stars", "Author": "Harry Samuel", "ReviewID": "R1AM48VEH9CR78", "Overall": "3.0", "Content": "Great camera for everyone. Is it perfect, NO. Can it do everything, NO. But unless you are willing to buy a DSLR(BIG HEAVY) with expensive lenses this little camera can do a lot. I bought it the day before a vacation trip.This is a very hard camera to review, Fuji made a 5 star camera for 90% of photographers, Fuji's choice of filter size was just plain STUPID. For those photographers who use filters which includes me this is a 3 star camera. 40.5mm is the standard, see cons below for more information. For those who think I am being to critical over the filter size spend time trying to find the right step-up ring, to use ND, or IR filters which everyone has made for years in 40.5mm, no one makes them in 40mm. Why Fuji did you use a non-standard filter size? Really turning into a big pain, 90% of photographers will not care.PROs:Has a complete automatic mode for the first time photographer, has manual mode with many options for the PROVideo is good, but use a tripod it will look SO much better (that is true of ALL cameras)Has two custom settings for those who are willing to spend time learning what all the settings are or the PRO who wants a camera to use in their bag of tricks.Beautifully machined solidly built camera, reminds me of my Leica 35mm of years pastExcellent image quality, with more options from film selection to manual control of everythingFast f/2-2.8 zoom lensGreat ISO range shoots well after sunsetFlash sync speed with any manual flash in the hot shoe all the way to 4000 of a second (big plus here)Optical viewfinder that is handy some of the time. I never really use LCD on my DSLR, but really only use the LCD on this oneVery very deep Menu system that you will need time to go through, but don't need to for great pictures out of the boxCreative options for in-camera Raw processing, I don't use themAccepts filters but also a con see belowFast autofocusMore creative options for different looks than you may get to360 degree panorama that works very well, it is hard to finish the full 360 but everything I got made me happy.small size that makes it easy to carry anytime, leave it in P mode for those quick shotsConsdoes not use standard filter size, big problem don't know what they were thinking  it is 40mm BUT it is not 40.5mm - I am still trying to figure that out how to use ND, IR, or several other filters.  The only step up ring I found NOW has a B+W clear locked into it, buying another step-up ring  would really like Fuji to explain the non-standard filter size, what a pain.The filter size has become a big issue, the ONLY company making filters are Marumi, and they only make a UV and CPL filters. if Fuji had gone with standard 40.5mm filters EVERYTHING made would fit. The step-up ring is an OK solution, but vignetting is now an issue.I have downgraded my review from 5 to 3 stars over this. If you are the 90% of photographers who do not use filters then this will not matter to you. For those of us who always carry several filters this is really a pain. Vignetting with just one filter.The lens cap is cool, but Fuji should include two with every purchase, I worried about losing it every time I took it offlens cap is big and bulky, not comfortable in your pocket (buy a filter and use a generic pinch cap) will update sizeBattery indicator gives little warning ( I need to buy a second battery, charge it every night and you will be fine )The dealer sells them for $19.99 or get the Wasabi, I got the Fuji from Amazon but am not 100% sure it is an OEM. If you buy OEM get it when you buy the camera, wish I had thought of it then.Cons others have mentionedI have read many say the 460K dot LCD should be better, this LCD is as good as my 920K LCD on my high end Nikon's  the LCD is fine to compose shot and check focus after if you chimp all the timeImage noise is not a problem at all , if you want really great pictures with no noise over ISO 800 buy the Nikon D4 Nikon D4 16.2 MP CMOS FX Digital SLR with Full 1080p HD Video (Body Only) or high end Canon (another non-issue)No dedicated movie recording button (no big deal, you rotate the dial)Premium price tag (great camera, made well, not plastic crap, much cheaper that the Leica's)SummaryI was under pressure to bring a camera with video on vacation, this one did a great job. After using this camera every day, all day for two weeks I knew I had a winner. With all my reading AFTER my trip I confirmed the little I read before my trip. I did not have time to buy a case before I left but did on my return, and an still waiting for a filter, step-up ring, and other options.accessorieslens hood - you can buy one, but don't, it does not do anything except allow a 58mm lens cap be used. Does not fit any case  for the cameracase - there are several, the only thing I wish one had was a hole for the tripod mount, I want a clean hole, need to find a  hole punch the right sizeI bought this one EzFoto Black Simulated Leather Case for Fuji Fineix X10 fits very well on the X20  the case fits with a step-up ring UV filter and the pinch lens cap, but you know it is pressing against the case.  I really like tan better, but don't want my camera to disappear, black is a low key plain jane caseflash - any flash will do, I use my SB-800 in manual, the Yongnuo Professional Flash Speedlight Flashlight Yongnuo YN 560 III for Canon Nikon Pentax Olympus Camera / Such as: Canon EOS 1Ds Mark, EOS1D Mark, EOS 5D Mark, EOS 7D, EOS 60D, EOS 600D, EOS 550D, EOS 500D, EOS 1100D is a good choice  remember I am setting the flash power MANUALLY on my shots, if you do not know what that means look at another  flash like the two Fuji make, but do not expect much from them. reading their reviews they may be good for an  indoor party, but outside in bright sunlight you are better buying the Yongnuo and learning how to use itlens cap - I need to update this, I have ordered a 40mm to 40.5 step-up ring a 40.5 B+W filter and have pinch type lens caps& filters  remember any filter you put in front of your $600 camera needs to be as good as the lens you put it in front of  and at night you may want to take it off - light transmission B+W 40.5mm Clear Filter with Multi-Resistant Coating (007M) - 66-1069039 is very important. A CPL or setup ring to a CPL you have is neededI am getting minor vignetting from 28 to 35mm with the step-up ring and B+W filter mounted. I might order the 40mm Marumi to see if it has any vignetting or not.infrared - yes this camera does it - 40.5mm filters are available as are many others. NO 40MM ARE MADE AS OF TODAY  WHY 40MM NOT 40.5MM?????????????????", "Date": "September 1, 2013"}, {"Title": "Fun Camera", "Author": "Deyna79", "ReviewID": "R2KN474WN248ZN", "Overall": "5.0", "Content": "I have a DSLR but wanted a smaller camera to carry around for hiking and other things I don't want to lug the bigger camera around. I feel like this one lives up to the great reviews online and can easily keep up with everything I want to do. The auto focus seems a tad slow sometimes, but otherwise I just love it. It's just so fun to use.", "Date": "January 7, 2014"}, {"Title": "On the edge of a great product", "Author": "Chicorob", "ReviewID": "R8HMVK2Q6PLCQ", "Overall": "4.0", "Content": "I like this camera.  Why?  It is a great size for travel, has high quality images, has some unique and nice in camera features, shoots RAW, and is fairly ergonomic.  There are things I wish could be better.  I do not care for the electronic manual focus.  I would rather have an electronic zoom with a manual focus ring but that is just me.  I also struggle at time to change the focus point but that may just be the learning curve on my part.  I do wish the lens was a little wider (maybe 20mm equivalent) but the range is acceptable as a walk around lens.  For a compact, the low light performance is good but not stellar.  It is probably in the range of the older Canon T1i SLR but is no where close to the current DSLR offerings and probably not quite a match for some of the nicer mirrorless cameras either.  One major reason I bought this camera was it offered a viewfinder, and an excellent one at that.  If you do not shoot with a viewfinder, I would consider a look at the Canon M which will give you higher quality and bigger sensor for your money.  If you want a viewfinder look at the G1X or G12 first.  I think they are all good cameras and you choice would come down to ergonomics and features.", "Date": "July 18, 2013"}, {"Title": "Outstanding Performer!", "Author": "Borderbiker", "ReviewID": "R2S6UEMUF4ZR9K", "Overall": "5.0", "Content": "I am extremely pleased with the Fujifilm X20. I knew it was an outstanding camera when I purchased it from having researched it and reading user reviews, however, it exceeded my expectations. I needed a camera to replace my NikonCoolpix P7000. Having been very satisfied with the performance of the Coolpix, my obvious contenders for replacing the P7000 was and upgrade to the Coolpix P7100 or the newer P7700.Although the X20 didn't offer the optical reach of the Coolpix, I was attracted to the combination of the upgraded technology, slightly larger sensor, and, having been involved with photography since the 70's, the retro look of the camera. I took it on an Alaska cruise expecting to use it exclusively for the shipboard experiences. I found, however, that I used it for the majority of my Alaska photography, leaving the landscape photography to my Nikon D300 and the X20 for everything else.The camera is indeed very attractive and its build is high quality with a robust heft and solid feel. I have the black version which, I believe, further enhances its professional appearance.  The quality of the images is extremely high with exposures being right on. The exposure compensation dial on the right side of the camera permitted quick and accurate exposure adjustments on the fly. The data, which appears in the optical viewfinder is very helpful and trumps the Coolpix optical finder, which has no data available in its optical finder.I am very pleased with the Fujifilm X20 and would recommend it highly to everyone from beginner to highly experienced shooter, including professionals to use as a walk-around casual camera.", "Date": "July 1, 2013"}, {"Title": "Quick Shooter", "Author": "Marcus Censor", "ReviewID": "RJ60C445HHVJE", "Overall": "5.0", "Content": "The two things I like about this camera are its size and its quickness.Size.Most compact cameras are too small for me to use comfortably. The X20 is the perfect size for me. I wear it around my neck (proudly) and wield it with two hands while shooting. For me this is a much more natural shooting experience than trying to take photos with something the size of an Altoids tin.Quickness.The plethora of external controls on this camera (WB, Autofocus, Shooting mode, Exposure dial, AE/AF lock button, fn) means that you don't have to go thumbing through a menu in order to manipulate basic functions of your camera. Very handy. This along with the manual zoom and lightening quick focus means you get the shot you want before it passes you by.In sum.Do pick up some extra batteries. I use Wasabi Power Battery and Charger Kit for Fujifilm NP-50. The Fujifilm X20 Leather Case for Camera (Black) is also very sweet, if you want to splurge.Oh yeah, and the images are stunning...", "Date": "May 30, 2013"}, {"Title": "Great compact camera", "Author": "Leo Pineda", "ReviewID": "RJ69DRRGMOT4W", "Overall": "5.0", "Content": "Man is this camera fun to shoot with!  I have an S95 that I have enjoyed using for years as my primary travel camera but the X20 is just more intuitive to use and is a lot more responsive when focusing and processing.  Sure I can't fit it in my pants pocket but the lens and sensor are far more superior to the S95's.  I would also consider looking at the X100s with its bigger sensor but I like the flexibility of the zoom range in the X20 as opposed to the fixed focal length of the X100s.Bottom line, it won't replace my 5D in terms of performance and picture quality but just for the pure joy of shooting and portability, the X20 is tough to beat.", "Date": "July 31, 2013"}, {"Title": "Perfect for 90% of my needs", "Author": "JohnOfEldorado", "ReviewID": "R1VTM56L5YXEMD", "Overall": "5.0", "Content": "I'll confine myself to a few comments rather than a complete review. As an older person, I have a hard time with viewscreen-only cameras due to insufficient ability to shift back and forth between a distant scene being photographed and the viewscreen a few inches away. The solution is a diopter-adjustable separate viewfinder, and the one on the X20 is excellent. The framing through the finder is not 100% accurate, but of course the screen is still there for times when composition is more critical. By the way, for some reason when the battery is not charged, the screen takes on a foggy yellowish cast. Out-of-the-box I initially thought this was a defect, but it disappears once the battery is charged.I really like the manual zoom, which is fine-tuneable without zipping past the intended setting as on every power zoom camera I have used. Incorporation of the main on-off switch into the zoom ring allows powering up and immediate precise setting of the desired zoom in one motion.  The 4:1, 28-112 equivalent range is adequate and hand-holdable at all but the slowest shutter speeds. For my purposes, the limited zoom range is an acceptable tradeoff for the f2 maximum aperture to keep the lens reasonably compact.The menus and controls are comparable to other digital cameras I have used, neither better nor worse. I have not tried all of the numerous modes, so cannot comment on them. The handling of the camera while actually shooting, including the substantial feel of the threaded shutter release, resembles that of an old rangefinder Leica, but without the mechanical feel or need to keep a thumb on the film advance lever. I like the retro look, which prompted my daughter's friend to comment that \"it looks like a real camera.\"I bought this with the EzFoto hood and lens ring filter adapter for the X10 (which fits the X20 as well) and allows use of my stash of 52mm filters from my old Nikon. The lens cap that came with this adapter is a bit cheesy, but the adapter itself fits great and the price is right.", "Date": "July 8, 2013"}, {"Title": "X20 - What's not been said", "Author": "MSC", "ReviewID": "R1ZNEQ5FO3B271", "Overall": "5.0", "Content": "I've had the X20 for about a month now and have shot about 500 images.  The reviews are generally accurate.  It is a great camera, but here's what I have not seen mentioned:1)  It is smaller than it looks in the pictures.  It's smaller than the X100 and it doesn't have a great grip.  I use it for street photography and added an aftermarket thumb rest that fits into the hotshot; huge improvement.2)  Battery life is terrible.  When I'm out for 3-4 hours I carry two extra batteries.  The good news is I bought them on Overstock for $4 each.3)  There's a design flaw in silent mode that is important.  If you put the camera in silent mode, which is truly silent by the way, you can't use the flash.  Even with the popup flash popped up, you can't activate it without disabling silent mode, which is done by press and hold the DISP button.  So if you are outdoors in silent mode and want to use fill-flash, don't forget to disable silent mode.Other than that, great camera, great images and great looks.  Worth the money.", "Date": "April 28, 2013"}, {"Title": "It all started with a search for a fast F1.8/F2 lens in a small body", "Author": "chain03", "ReviewID": "R31XSSMGXUXHYA", "Overall": "5.0", "Content": "I originally owned many canon/nikon/pentax  DSLR . the latest with me is D5100 which i like.i bought a 35mm F1.8 lens and was amazed at the quality it gives out.i was so much obsessed with the lens that i stopped carrying  by 18-20mm nikon lens.so i started to look if i can get these Focal lenths in more compact body for vacation type of trips.I looked at canonn G16 ,nikon & sony RX100. settled for Fujifilm somehow (my first fuji) & I was very skeptical of buying this.I looked at pictures from fuji X20 lens at flickr ,hear in amazon and openbloom.com (look in camera section)I took the decision to buy X20 due to few reasons in addition to excellent look and feel .it looks stylish and expensive.-- excellent lens. i also liked the mechanism to turn on the camera by turning lens. some people did not like it ,but i am not a motorized lens fan (for zooming) in these small cameras. i need freedom to zoom as i want like a DSLR.-- ability to take pictures in F2 - F2.8 to get great bokeh and also excellent low light.-- there is super macro mode (in addititon to regular macro) and it works great and you r almost very close to your subject byut still camera can focus.-- i found the view finder very useful although it is not 100% ,but i can tell you i feel it better than nikon D5100 view finder.-- for most of the settings there is a Q button and  you can quickly adjust settings. there is a function button too where you can set 1 desired function. ex:- JPEG Vs RAW.-- inbuilt flash is excellent ( i found this to be less harsh than nikon build in. Although i bought the fuji portable flash EF-20 . i like external flashes and do not use builts as much as possible.I  bought following items to work with Fuji X20 to complete my kit-- camera bag (National Geographic NG A1212 Vertical Pouch )-- External flash - EF-20 (small flash which can tilted upwards. you can also buy a tofen /diffuser.-- i researched a lot about neutral density filters and finally settled for  Promaster 4572 40.5mm Variable ND Digital HGX Filter  step up adapter (40-40.5 mm ) from ebay german seller. Pro-Photoshop.Pro-Photoshop", "Date": "May 13, 2014"}, {"Title": "The best point and shoot I've ever used", "Author": "Photo_Nut", "ReviewID": "RVRQ5CIM85Q2V", "Overall": "5.0", "Content": "Wow....what else can I say?  The Fuji X20 REALLY surprises me with its wonderful image quality!  This, coming from a Fuji X-T1 and Olympus E-M1 owner (me) and having been a long time DSLR (full frame) shooter.  The image quality at lower ISO from this camera truly does rival that of an APS-C sensor size DSLR.  I'm not exaggerating.  ( shoot raw format, not jpg)  The images are sharp, very detailed and very clean for a point and shoot camera.  I can't say enough how much it surprised me.  I was just looking for a small camera to keep in my backpack, but I got so much more.  The only real drawbacks for me is the fact that there's no EVF, only the limited use OVF.  I would much prefer to have an electronic viewfinder vs. an optical viewfinder, even on my larger cameras.  The LCD screen can be a little difficult to see in bright sunlight, like any point and shoot camera or camera with a LCD.  But, that's expected and I don't really consider it a negative.  It is what it is.Focusing is fast and accurate.  Overall operating speed is very good.  This is literally the best point and shot I've ever used (I've had the Panasonic LX-3/L-X5, Nikon P7000 and other premium point and shoot cameras and the image quality from this X20 is definitely a few steps avbove any point and shoot I've used.", "Date": "April 25, 2014"}, {"Title": "Excellent in just about every way", "Author": "PC \"Sleepless in LA\"", "ReviewID": "R3LOPCZACWLXBR", "Overall": "5.0", "Content": "I got this to replace an LX3 as a portable point and shoot. I also have a D700 and several film SLR when I pretend to be more serious than just a hobbyist.The image quality and color from the X20 jpg are miles better than the aging LX3 (LX3 was good in its time). And more and more often I decided to grab the X20 instead of the bulky DSLR. This little camera was able to capture what I wanted to most of the time and that really matters.The style is great. In fact, I felt that the style adds to the excietment of using this camera. I do want to whip out the X20 and experiment with the scene more than I do with other cameras! Don't know how to explain that.I put on a 40mm filter to protect the lens. With the thickness of the filter the cap can't stay on very securely. I suspect soon I'll just go without the cap and rely on the filter only. That additional hood seems to make the whole thing a bit too big to my liking.The optical viewfinder was a factor when I made the choice (an old-school thing). The overlaying information is indeed useful, too. But when it comes to actually taking shots, I actually use the optical VF less often as I expected.I would highly recommend this camera to all hobbyist who want to learn and enjoy photography and start to feel that DSLR plus a 28-300 zoom are getting too heavy! This is a great all around camera for most occasions.Updated 2014/5/12:I just verified that after 160 JPG shots within 48 hours, most of them medium size and only ~20 of them using flash, the battery is dead with the big red flash. This is somewhat disappointing even though it is well known that X20 doesn't have great battery life. Also, by the time you see the battery turn from full 3 bars to 2 bars, it is close to empty. One or more extra spare batteries is a must.", "Date": "February 26, 2014"}, {"Title": "Want to love it, but end up just liking it", "Author": "Kane Cheung \"xy1981ca\"", "ReviewID": "R32IY1YC6BK8NO", "Overall": "4.0", "Content": "I want to love this camera, it has great handling & makes me really want to take pictures of everything. We took it to Seaworld and the Zoo and was surprised how it was able to snap everything at such high shutter speeds. It wasn't until we got back home and reviewed the pix on a bigger monitor that we saw everything was taken at ISO800 with heavy noise reduction, sharpening, artifacts & smearing. Many images were comparable to pictures taken with a cellphone.The noise & smearing issues can be addressed in a couple of ways:1. Set ISO 100, NR -2, Sharpness -1, DR 100 and use in Aperature mode2. Shoot RAW & at lower ISO (out of your control in auto modes)3. Shoot B/W where noise tend to look more like grain than digital noisePros:+ Great handling, love the exposure dial and easy to navigate menus (maybe Pentax MX1 has better menu)+ Retro style is pleasing+ Fast response makes it easy to take pictures, will get a lot more use out of the camera this way+ Very smart auto mode that helps capture scenes in all lighting conditions+ Fun and useful artistic filters/modes.+ Fast & accurate Auto Focus+ Fast boot up timeCons:- The auto modes cannot be fine tuned (ISO, Noise Reduction, Sharpness & Dynamic Range are all locked), so you have very little control over image quality when you put it in auto modes.- The camera can capture scenes even in poor lit conditions because it sacrifices ISO to achieve faster shutter speeds, but you end up with horrible noise & artifacts- This camera is noisy and the JPEG converter & default settings add a lot of artifacts and smearing to the JPEG. When using auto mode in poor lit conditions, photos often come out no better than my cellphone, but at least it captures the picture at fairly fast shutter speeds (due to high ISO).- The built in flash is quite weak & external flash needs to be enabled/disabled in menuI still really like this camera. I take a lot more pictures with this when it's around my neck vs my DSLR. The fast response makes it possible to capture pictures very easily, but at serious cost to image quality. The image quality issues can be overcome, but then you're left with average performance. The obvious answer is the X100 or X100S, which costs twice as much as the X20. Too bad indeed.", "Date": "January 2, 2014"}, {"Title": "Best camera for family", "Author": "James", "ReviewID": "R3TYKQZAL52LRD", "Overall": "5.0", "Content": "It is the camera that most people need for high quality photos. I like the bunch of manual options. I like the old style design.", "Date": "December 2, 2013"}, {"Title": "Good looking, good functionality, good photos.", "Author": "Tuscanwino", "ReviewID": "RO2MRH7A0OK31", "Overall": "5.0", "Content": "In seeking to replace my 5-year-old Panasonic DMC pocket camera with a more advanced & updated camera, I consulted Consumer Reports.  The search was narrowed to Canon G15 (now G16), Nikon D5100, and Panasonic DMC-FZ200.  Then there's Fuji, which that magazine ignores, but I didn't.After consulting two very good web blogs, and thinking about the options and camera choices for a couple of months, I decided on the X20.  Main reason, I admit, was it actually looks like a camera.  But it also has the electronics and features that the others have, a respectable zoom range, and high ratings on the blogs and from users.I like the camera's feel as well as its looks.  Since it is not pocket-sized (except for cargo pants) I agree with others that it might as well be a bit larger in order to have better access to controls for those with fat fingers.  But that aside, the controls are well placed ergonomically.  I particularly like the programmable `Fn' button, which I have set to RAW+jpeg.  The programmable C1 and C2 choices are very helpful; I programmed one for fall foliage and the other for sports/action shooting.My first photos were taken side by side in Auto mode with my old DMC camera, also 12.6 megapixels.  The X20 results were similar in resolution but much better in an overall sense.While shooting a sporting event, I use Drive mode (burst) with great results.  The `bracketing' options in Drive mode are excellent features for still photography, such as bracketing exposure or dynamic range in landscape shooting.As recommended by another reviewer, I purchased a Fotasy 40m filter which fits the lens without an adapter, and the high quality Fuji leather case which fits very well even with the filter and lens cap in place.I'm not an `enthusiast' so I need help understanding features not in my old film cameras, like white balance and histograms.  As others have noted, the Fuji manual won't do the job.  So my first recommendation is the `Photographer's Guide to the X10.'  Not a typo, this book is for the X10 but is very applicable to the X20 (see my review).", "Date": "October 26, 2013"}, {"Title": "A Great Camera", "Author": "Cosbyite", "ReviewID": "R2LUBC2CCG9BKZ", "Overall": "5.0", "Content": "If a point and shoot doesn't give you quite the thill you need for an everyday carry camera, the FujiX20 is perfect.  I use this camera while hiking because I can put it in auto when in a hurry to catch a changing scene, or put it in manual to work on a set scene.I love the feel, the look and the operation. No complaints. All the details in the other reviews have played out accurately for me.", "Date": "October 21, 2013"}, {"Title": "Great camera", "Author": "Quaiser Absar", "ReviewID": "R1I6LJRQFVQ37N", "Overall": "4.0", "Content": "Love it. Takes great pictures and very easy to use. I wish someone come with a tutorial book on x20.", "Date": "September 3, 2013"}, {"Title": "Most satisfying camera I've used in years", "Author": "Maximzodal", "ReviewID": "RHBPIPSFRDBSO", "Overall": "5.0", "Content": "I won't restate all the good things said about this camera already.  Suffice it to say it is just a more satisfying camera for me to use than a big DSLR or a point and shoot. The proof is that I find I take it with me more often than my larger cameras. I use a hand strap and the lower weight makes a huge difference too. Getting used to using a viewfinder has taken time, with some disappointing, unusable shots, but I'm getting better.  I certainly can't complain about the quality of the camera or the photographs it is capable of taking.  Though I was a bit skeptical of buying something other than a Nikon, I'm very glad I bought this Fuji.", "Date": "August 24, 2013"}, {"Title": "Crazy about this camera", "Author": "RocketMan", "ReviewID": "R21GLELQZ270AU", "Overall": "5.0", "Content": "This camera exceeded my high expectations, based upon professional reviews. I have not had it long enough to learn the features yet, but it does not seem to be lacking anything for the average user.PROS:Beautiful, retro look. This is the best looking camera I have ever owned. More mfgs should take a cue from this.Finely machined metal and sweet operating wheels and buttons. The tactile feel of everything is greatEverything about this camera speaks to well thought out ergonomic and aesthetic engineering (except one issue, below).The faux leather is convincing. Very little plastic on this guyThis camera has build quality that I would expect on much more expensive cameras. Fuji hit a home run with this designCONS:The two USB ports don't have a micro or mini USB, which are common sizes. Fuji seems to have a proprietary USB or at least one that other devices don't use. Must bring along yet another cable when I travel. However, I can take out the storage card and plug it directly into my laptop, but that does not make up for what appears to be an engineering lapse in thinkingI like devices that charge through the USB port, which this camera won't do.My initial impression of the rechargeable battery life is that it will not last a long time under high performance settings.These are minor quibbles with an otherwise fine camera", "Date": "August 9, 2013"}, {"Title": "Great camera", "Author": "Meredith Hayward", "ReviewID": "R1U2XY16MFR3Y0", "Overall": "5.0", "Content": "I had a Canon SLR digital camera that broke and needed an alternative for my trip. I wanted a camera that was a bit smaller than an SLR but still takes great photos. After doing extensive research, I decided on this one. I wasn't disappointed. It's easy to use, takes great photos, and it's easy to use the different modes, even manual and shutter/app priority modes. The pre-programmed modes for low light photos take awesome shots, which is a huge plus. After having this and using it on my three week trip, I don't even know if I'll be getting another SLR!", "Date": "July 23, 2013"}, {"Title": "Like Better than X100", "Author": "Shutterbug \"Shutterbug\"", "ReviewID": "R29U5KNRPSWBXW", "Overall": "4.0", "Content": "If X100 was set-up like X20 I would be a happy Camper. I prefer the image quality of the X20. I'm a retired Pro in Industrial Photography. My Hobby is \"Street Photography\" and was disappointed with the X100.....Anyone need a paper weight !!", "Date": "February 14, 2013"}, {"Title": "Exactly what you should expect.", "Author": "michael bellina", "ReviewID": "R2SWHUSC6DZK1C", "Overall": "5.0", "Content": "I'm always baffled by bad reviews because people rarely explain their expectations and what they wanted from what they bought. So this is what I wanted from a camera, this one specifically.-great picture quality-relatively good speed-relative ease of useThis machine passed with flying colors in every division.The camera shoots in full HD, ridiculously good for the price. There's no doubt in my mind that even an avid photographer would be very pleased with this type of output. It's very pretty and compact, I have the silver/black model and it gives off an old school vibe which I'm certain many will enjoy. The camera has a ton of modes to choose from as well, all with their own unique settings and some of the modes are kinda goofy and fun. It's FANTASTIC in low light settings to boot.You may like the fact it's a 12 megapixel camera, too. I think this may be the reason a lot of the pictures don't have this overly \"crisp\" DSLR effect (I know that's not a great way to describe it, forgive me). This is something you may want to watch out for, though, I'm a student in college and like my pictures without flash and to be somewhat old fashioned because I find they look better once developed but I know that's a sort of weird opinion so if the megapixel discrepancy is a problem for you I'd say upgrade to the x100.Some things you should watch out for.-You'll need at least a class 6 SD card if you plan to shoot video in 1080, I'd play it safe and go with 8 or above, but that's just me.-It's not a bad camera for beginners but with such a vast pallet of options that you may find a less expensive camera can do all the same things if you just plan to snap photos of your friends casually, some of those cheap $150  digital cameras take really nice pictures for a third of the price.-Finally, and I can't stress how important this is, I'm still new to photography. Everything I've told you is just me describing my experience the best I can. I'm learning to shoot photos better on my own and by learning from a friend who's a professional, however, I'm still a novice and if you're a really experienced photographer then know this . Overall, though, I love the x20 and I'm having a lot of fun with it.", "Date": "July 17, 2013"}, {"Title": "my last camera?", "Author": "J. M Ullman \"chimayred\"", "ReviewID": "R3D44L8MP8EQHD", "Overall": "5.0", "Content": "I bought an X20 for my wife who is an enthusiast, and I have a year old X10.There's a ton of stuff written about these cameras and I'm not going to add anything new to a big technically nuanced conversation about IQ, Bokeh, sync, etc.I'm a 58 year old enthusiast and I currently own a FUjifilm F30, Canon G10 and an Olympus OM-d EM-5.  Generally when I travel I shoot about 1000 pics in a week, and these range from Yellowstone to smoky Czech bars.I think the overall shooting experience with both of these is similar, given the differences in technology, sensor, viewfinder, etc.So here's my deal.  My first real big boy camera was a 35mm Canon fTB-n with 3 lenses.  For those of you too young to understand that, it was a 3 pound solid steel behemoth that was the Canon equivalent of a Nikkormat.  I had a 1.8 50mm \"normal\" lens, a 70-210 Soligor zoom, and a Tamron 28mm.  I packed all of that up and went to Europe as a 21 year old.  Within 4 weeks I hated switching the lenses so goddamned much that I traded them all in on a brand new Hoya 35-105 zoom, which stayed on my camera until I sold it nearly 30 years later.  But in the meantime, even with the Hoya, it was a 6 lb albatross around my neck.  And it just wasn't fun.  So I bought an early point and shoot autofocus Ricoh zoom 35mm.  And I was amazed that the pictures were very good.  I once blew up a 35mm slide to 2 x 3 feet of a window and flowers in a Belgian resort town and it was pretty serviceable.  I'm not a National Geographic photographer.So when the digital revolution hit I jumped on Board.  I've owned at least a dozen digital cameras.  At once point I moved up to a Nikon d-40 with a Tamron wide-tele zoom.  And you know what?  I was right back to the volume equivalent of my Canon Ftbn.  6mp.  Fun, good pictures.  But big.So I dabbled with a G10, with a LUmix superzoom, a couple other FUji's, an Olympus EPL-1 and liked them all.I thought ( and still do ) that the OM-d EM-5 was going to be the optimum (as opposed to perfect) camera, and I have the 14-150 and 12-50 lenses and love it.But part of the experience of a camera is the camera itself, and part of it is the pictures.  The minute I saw the x10 I thought they'd nailed it.  They had to get past the (possibly delusional) white orb fiasco, and they did.  I bought mine with the new sensor and havent' seen a glimmer of a white orb.BUt the versatility of the camera is wonderful, but the ergonomics, feel, build, and appearance are so gorgeous and so retro that it is almost all you need.On my last trip which was to Oktoberfest and the Czech Republic 2 months ago I violated my first rule and just took the Fuji.  And the pictures were astonishing.  Some of them were mind bogglingly so.  I took a photo of a painting on a store front, blew it up to 11 x 30inches and it hangs in my office.  I can't see a bit of distortion or grain or noise.  Only issue is battery life.  Some of the adapters I used in Europe didn't fit in the sockets and one day all of my \"charged\" batteries were dead.  This unfortunately has happened with other cameras as well.My wife is absolutely thrilled with her X20.  She traded in an S95 and a G10 to buy it.I love turning it on with the lens.  Flash is excellent.  It is virtually pocketable.  I had no trouble getting a good 40.5 mm filter.  Video is fine.  And if you want to see what these cameras are capable of, don't take any of our words for it.  Go to the Flickr x10-x20 forum and see for yourselves.", "Date": "January 2, 2014"}, {"Title": "Best value for a compact digital!", "Author": "Chuck T", "ReviewID": "R2R3CA6L9XXZHP", "Overall": "5.0", "Content": "This little guy is great! This is perfect for travel or for any casual shooting. The retro styling and weight of the camera adds a lot of value to it. The manual controls are nice and gives the camera a lot of flexibility. The lens on it is great and provides a wide range (28-112mm equivlent). With a apearture of 2.0-2.8, this is wonderful in low light situations and to get shots with decent bokeh. I love that there is a  viewfinder with a settings overlay. This gives the camera less of a point and shoot feel. The built in flash is ok for close up or small room shots but I also love that there is a shoemount on here. I'm able to use my Nikon SB series flashes as well as Pocket Wizards on this camera!There are many in camera features that give this camera more value. The macro/super macro feature is great and the detail that you get in these shots are impressive. The advance modes, (Toy camera, minature effect, panorama, dual exposure) are fun.As far as overall performance, for what it is, it will not perform as well as a mid range or high end. I shoot with a Nikon D800 for work so its hard to expect the same performance/results with the X20. An example is the focal points, you can select a focal point but would have to use the actual screen and not the viewfinder. So it's not as intuitive if you're accustomed to using a mid range dslr or higher. Though I think this might be able to hang with a entry level dslr such as the nikon d3100.The picture quallity is very impressive. Not too much noise for high iso shots and is overall acceptable for most applications. Over all I think this is a great camera for this size and features. Definitely recommend this!", "Date": "May 13, 2014"}, {"Title": "Perfect for me", "Author": "N. Westley", "ReviewID": "RIITUK8DAHQ1W", "Overall": "5.0", "Content": "I was looking to step up from simple point-and-shoot cameras to something that gives better results without being incredibly complicated and this camera hits the mark perfectly. You can put it in full auto and still take reasonably good pictures in most situations, like a point-and-shoot, but better. Where it really comes into its own is when you start playing with the huge array of options it offers. This seems like a great camera learn how to take good pictures with as the controls are fairly intuitive and well laid out. I'm really impressed by the image quality, especially in low light.", "Date": "April 15, 2014"}, {"Title": "I love this camera.", "Author": "J. Hansen \"Human\"", "ReviewID": "R1SP7K1CPBGQZJ", "Overall": "5.0", "Content": "I am a long-time Fuji point-and-shoot fan in addition to my Nikon D7000 (which replaced my D70), so I was especially excited about the x20. It takes great photos, is stylish (not that important to me but still a nice point), and is small and easy to carry. I'm a bigger guy and this fits in coat and sweatshirt pockets easily, maybe not jeans so much.  The battery life isn't as great as the smaller older Fuji cameras I've used but its adequate. I'm glad I bought an additional battery though and recommend carrying a spare.At this point, the quality of this camera is well know so I won't elaborate the point here. I paid $600, happily, for this camera and think it's a steal at $500 now.  If you're thinking about it, fret no more and just buy it. I can't imagine you'd regret it.", "Date": "March 26, 2014"}, {"Title": "Great cmaera, affordable and high quality. easy to use.", "Author": "Earl R. Denmark", "ReviewID": "RRMJUJKOSBQ4L", "Overall": "5.0", "Content": "Great camera. Small, and light. So many features and effects. Great all around camera. We took over 900 photos for our wedding week.  Our first one got stolen, make sure you are home for delivery!", "Date": "November 18, 2013"}, {"Title": "Great Camera", "Author": "FujiX20", "ReviewID": "R188BMGXINM2IP", "Overall": "5.0", "Content": "I bought this camera for my two upcoming overseas trips because I wanted a camera that produces near-SLR quality without the weight.  The camera performs!  I like that it can be used as a point-and-shoot and as a full manual camera.  The lens is sharp from edge-to-edge and the RAW files retain amazing amount of details.", "Date": "November 7, 2013"}, {"Title": "Very nice camera", "Author": "Colorado Mom", "ReviewID": "R2X5TX63F4T382", "Overall": "5.0", "Content": "Took it on a vacation to Hawaii and it didn't disappoint. Pictures were crisp and clear. I didn't want to take my big, heavy digital SLR on the trip and this camera was a great alternative. I looked at a lot of cameras before choosing the X20 and this one is a very good buy.", "Date": "October 17, 2013"}, {"Title": "Love this Vintage look Camera !", "Author": "Dan Hubp", "ReviewID": "R2FMJ7YBWU2TV1", "Overall": "5.0", "Content": "Last real camera I purchased was a 35mm Nikon when everyone still shot film only. I've own several point and shoot digital cameras since, but have yet to step into a nice, mid-level digital camera until now. When I first saw the looks of the silver X20, I was immediately hooked. Ad the MegaGear Dark Brown Leather Case - which also provides extra gripping areas to steady shooting - and this cameral looks like it came out of a time machine from 1960. I own several vintage Bolex and Beaulieu 16mm film cameras, so the X20 is just a natural for me. I looked at the X100, which is also a beautiful retro model, but wanted something with a zoom. The wide angle 28-112mm zoom on the X20 is a perfect solution. Image quality is great - low light shooting for my needs is also great. Built in Flash and traditional style viewfinder is also a plus. Love it !", "Date": "October 7, 2013"}, {"Title": "Replacing the Canon G7", "Author": "D. Reinsel \"WorkAtHomeDave\"", "ReviewID": "R38OPX74KQN8AV", "Overall": "5.0", "Content": "My Canon G7 was getting long in the tooth.  I either needed to upgrade my Canon to latest generation or switch.  I switched, desiring the larger sensor size. So far, very pleased with my decision.", "Date": "July 17, 2013"}, {"Title": "Great Camera", "Author": "Larry", "ReviewID": "R1OKHRNHFG5OGM", "Overall": "5.0", "Content": "This was a gift for a person that takes pictures leisurely throughout travels. The size is great and the pictures are beautiful.  The seller did a great job of describing the camera accurately and the delivery was on time.  I hope to do business with this seller again in the near future.", "Date": "June 30, 2013"}, {"Title": "I love it!", "Author": "maria espadas", "ReviewID": "R2AMX7U2UCHLR7", "Overall": "5.0", "Content": "I have it with me all the time, the pictures are great and it's a beautiful camera, it's my favorite toy :)", "Date": "June 29, 2013"}, {"Title": "Amazing little camera", "Author": "Andrew Lynn", "ReviewID": "RG9H6U8OLJ37I", "Overall": "5.0", "Content": "This is a fantastic camera. The lens is the best I've ever used in a compact and the sensor does very well at up to ISO 800 and gives an image that's more than good enough for screen and small prints at 3200. The color reproduction is beautiful, it makes JPGs you can use straight out of camera and shoots raw files that most of the common software packages can process. The camera has a great feel in the hand, looks like a classic and has much better handling than I'm used to in a compact, with the mechanical zoom ring, control wheels and proper shutter release cable socket.I had an X10, and this is a worthy upgrade. The sensor does perform better, the AF is improved, overall responsiveness is noticeably quicker and the improved information in the optical finder is very useful when shooting. More of an incidental feature, the latest version of Apple's raw processor (for iPhoto and Aperture) does a good job on the X20 raw files but fails to read the X10 ones.", "Date": "June 13, 2013"}, {"Title": "Superb camera....", "Author": "Confucious", "ReviewID": "R2HMOX3CFU8GQH", "Overall": "5.0", "Content": "This is such a superb camera from Fujifilm. The X20 has lots of capabilities of an SLR but packaged in a point and shoot body. My previous camera that I can compare it to is the Panasonic LX3. Both cameras have a similar style body wise. The X20 is a tad bigger but still very comfortable to hold. It feels very good in your hands. It has a nice weight to it. It does not feel like a cheap camera at all. The metal body is just great. This one also has a view finder so it gives you that SLR feel too. The LCD screen is very big, bright and crystal clear. I suggest reading the manual. I tend to jump straight to the camera without really learning what I am getting myself into. You do get to take advantage of your camera. The photos this camera produces are just plain beautiful and crisp. You can print nice photos in 3x5 to poster size prints from this non slr camera. The other thing I miss from the LX3 is the wide angle but once I started using this camera with all its features I didn't really miss the wide angle. The video quality is also great. Not as easy and comfortable shooting video with the way you hold this camera but its a great feature to have when you need to capture videos in certain moments. Overall an excellent camera with lots of bells and whistles.", "Date": "May 16, 2013"}, {"Title": "Fuji has another winner", "Author": "Edward G. Dickau \"Ed. Dickau\"", "ReviewID": "R2E8VQ6VN5N55G", "Overall": "5.0", "Content": "I traded off my X10 before purchasing the X20 and I am not sorry. I am a Nikonian but use the X PRO-1 extensively and this makes a small companion to either system when I really don't feel like carrying much equipment.  Paper prints of the 11 x 14 size are easy and detailed. Fuji continues to amaze with their sensors and listening to their users. If you want a bridge camera; you can't go wrong with this one.", "Date": "April 26, 2013"}, {"Title": "The best Survey Camera I have ever owned", "Author": "S. Pirtle \"margrad\"", "ReviewID": "RQTT1CR2C4YQE", "Overall": "5.0", "Content": "I am a marine surveyor.  In my job I have to be very mobile, climbing over lots of things made of steel, while having my camera always at the ready.  I have gone through about five point and shoot cameras over the last four years.  This one is by far the best.The neck strap, keeps the camera level on my chest, ready for a quick shot, while I am writing in my note book.  The video is very good for those times when I want to record something in motion. The very best thing for me is the optical view finder.  I work a lot in the bright sunlight, and being able to frame my photos when I can see the LCD screen is a godsend.  I also love the fact that when you hold the camera up to your face to use the viewfinder, the screen turns off, so it isn't shining into your eye.  Also when you rest the camera on your chest, the same sensor turns of the screen, saving batter life.  Since I routinely put in 12 days of surveying.  I carry a handful of batteries.  Though the batter life is said to be low in some of the other reviews, I have found that I rarely have to use more than three batteries in a day.  Unlike my Sony camera that uses \"G\" batteries, the Fuji batteries are very cheap, so have a bunch doesn't break the bank.  I still keep my Sony in a pocket for the times when I need more zome or more Mega Pixels, but the Fuji is the usually used 98 % of the time. To get a camera better than this I would have to go up to the professional level cameras, which have the disadvantage of size and cost.", "Date": "March 30, 2014"}, {"Title": "Generally great, but certain things should be resolved in next interation of this product", "Author": "Allen Timothy Chang", "ReviewID": "RLHG8QZSVL2JG", "Overall": "4.0", "Content": "I won't repeat all the positive things other reviewers have said about this camera except to say it's a pure joy to operate it compared to the Sony RX100 Mark II even if the Sony camera has somewhat better image quality than Fuji X20.  Certainly love to take pictures via the viewfinder especially when this is rare among digital cameras.  Also love the fact that one can choose Auto ISO in manual mode for the Fuji X20, but one can't do that for the Sony RX100.However, there are certain issues that I would like addressed in future iterations of this product:1) Provide a micro-USB port on the camera capable of charging the battery.  All sorts of gadgets use the micro USB port for charging these days, including tablets and cell phones.  These gadgets can be connected to an external battery/portable charger via USB.  The same should have been implemented on the X20 to reduce the need of bringing yet another type of non-standard charger on journeys or vacations.2) Provide a harder (ie more scratch resistant) LCD screen especially when we spend so much money on the camera.  I've been trying to protect my camera using the standard X10/X20 case accessory from Fuji, but after several weeks of use, I see a lot of fine hair like scratches on the monitor either under the sun or a bright lamp.  Sometimes I wonder if even using a micro-cloth causes scratches!  This of course highlights the need of applying a LCD protector on the monitor immediately after purchasing the camera.  While the camera is made in Japan, I wonder where the outer covering of the monitor is sourced from.  As a person probably suffering from OCD, I find these scratches very annoying, but to be fair, the build quality of the other components is excellent.3) Provide a pinch cap, or at least allow the lens cap to connected by thread.  Otherwise, one is almost guaranteed to lose the cap.  Best to purchase a ND filter to attach on the camera as a type of protection (probably better to find a 40mm filter so that you can still place the camera inside the standard X10/X20 case accessory.", "Date": "December 24, 2013"}, {"Title": "Best Camera Ever For The Money", "Author": "William D. Thomas", "ReviewID": "R1P9EAFYFQYCXW", "Overall": "5.0", "Content": "Great camera. I have had many camera's over the last 50+ years. Of course film camera's and for the last 10 years several digital camera's. This is be best ever! Fantastic build, looks and feels like a camera costing 3 time as much. Great control for an experienced photographer. Love the optical viewfinder, although I do fine myself using the LCD screen much of the time. In the end the value of any camera is in the results - how good are the photo's. This camera gives excellent results. Go to my web site to see lots of photo's, all the latest taken with a X20 (williamdthomas.zenfolio.com).", "Date": "November 24, 2013"}, {"Title": "Utterly Wonderful", "Author": "Jon R", "ReviewID": "R310TRQAHG6FMR", "Overall": "5.0", "Content": "I have a bunch of digital Nikon SLR's so I bought this, non-interchangeable-lens, camera as a pocket camera when I didn't want to lug the SLRs around.  Now I know I will have to buy into the upper end of Fujifilm's X range too.  This camera is as close to perfect as I can imagine (except that I wish they could find a way to retract the lens completely).  It has a ton of functionality which bridges between point-and-shoot simplicity (with a lot of well executed auto artistic options), through to pretty much any degree of manual control a purist could ask for.  Even the tiny flash (which are usually useless) works extremely well.  Best of all is that it delivers this performance with the same mechanical build quality and consequent joy of use that old mechanical film cameras used to deliver.", "Date": "June 29, 2013"}, {"Title": "Great camera.", "Author": "Luis Davi Freitas", "ReviewID": "R1HU857XEE0VZB", "Overall": "5.0", "Content": "The camera is great, very sharp, lightweight and precise! You can adjust and set up aperture, iso control, speed and manual adjustments!", "Date": "May 30, 2013"}, {"Title": "One of the best purchase decisions I've ever made", "Author": "Gokhan", "ReviewID": "RH8HTZN7GWB8C", "Overall": "5.0", "Content": "For years, I have always thought of buying a DSLR camera. But I have always backed down seeing my friends' cameras rusting at their home, because they weren't portable. A few months ago, I saw a review of Fujifilm X10 in a techsite, and it had my attention. I still wasn't convinced, because I had a few Sony Cybershots before, and after a short time I bought them, I have always gone back to my iPhone camera. So I thought I would do the same thing with this. However, when I saw Fujifilm X20, and read a few reviews about it, I was convinced to buy it. The main point in the reviews was: \"You will love taking pictures with it\". And this was exactly what I was looking for.And now that I have it, I absolutely adore it. First of all, it's flexible. You can set every single thing manually, or, you can take a perfect picture in auto mode, and you will get amazing results in both cases. Second, it has a a good user Interface, and an amazing retro design which makes the design very fun and easy to use. Third, it's very compact and durable, although it's not exactly pocketable, you can slip it in a small bag and take it everywhere, way more portable than DSLRs.As a result, this camera makes me wanna go out more, because I want to use it more! I'm not exactly your photography geek, but I can comfortably say that it's a big big big improvement over your regular point and shoot, and if you're like me you won't even notice any kind of difference between your friend's DSLR pictures and yours in 95% of the time. And your camera will be way more cooler and way more portable.", "Date": "May 14, 2013"}, {"Title": "The best compact retro camera.", "Author": "josef sievert", "ReviewID": "R26SCEPZIHQ0E0", "Overall": "5.0", "Content": "The x-trans sensor in this camera is amazing . The color is your typical fuji vibrant color. I love shooting RAW in this camera. Please consider this camera before buying a sony rx100. You will love this camera! The build quality is just amazing.", "Date": "May 13, 2013"}, {"Title": "My New Fuji X20", "Author": "james h williams", "ReviewID": "R2EFXEQIFFUECH", "Overall": "5.0", "Content": "What a marvelous little camera! That OVF is perfect for those bright days when everyone limited to their LCD is seeing only a black screen...and I am seeing a perfect real life view of what I am shooting!The images are superb, and if you can find a more solid all metal camera finished out with solid controls and wrapped in a gorgeous little body, you had better buy it, because it will be the only one on earth other than the X20!Is this camera dream, or a dream come true? It will come true for you the first time you feel that fine craftsmanship in your hands and then take a shot, using the fastest auto focus of any small camera made! Half press, and it's focused sharp and accurate before you even get the shutter button all the way down....simply amazing!Options abound, the great Q menu give you fast and easy access to most all you ever need to chane settings. ...and did Imentionthat fantastic Fuji color...plus your choice of retro Fuji film styles.You're going to love it, I guarantee!", "Date": "April 22, 2013"}, {"Title": "All that x10 should have been", "Author": "BookWorm", "ReviewID": "RB6032CXJ8ECB", "Overall": "5.0", "Content": "While good on paper x10 was a huge disappointment in real life (posted a review). Fuji  learned from that experience and this time created a real jewel. The focusing speed, the menu system, Q menu button, better sensor, more grippy control wheel and less flimsy multidial (the latter was a nightmare in my copy of the x10). The camera is compact, so it feels very \"dense\" (good for holding stable), perfectly fits in the hand with very comfortable grip and excellent tactile feel of the grainy finish. I don't buy cameras for their looks and I like them stealthy but the \"silver\" version actually has a grey gunmetal finish that is simply stunning with thex20  black body.This is still a P@S camera (with many advanced features) not an all-in-one all-around solution. There are more pocketable/lighter cameras with better battery life (Sony RX100, Olympus PL5, Nikon 1 [heavy as x20, less bokeh but super fast focusing, good DR-colors in RAW, good battery, interchangeable lenses, also comes in pink or white for a bit less adventurous informals...]). I wouldn't take it on a several days backpacking trip, sports or low-light shooting (at least as the only camera). Taking pictures of running kids/pets is a challenge, you'll miss a lot but one out of 10-20 that is in focus most likely will be a keeper. Other reviewers covered it in details.The x20 is not for everyone, to get most of it one needs to be comfortable with manual/semi-manual settings but shooting with the x20 is an experience.", "Date": "April 5, 2013"}, {"Title": "A Camera to take with You", "Author": "Harold G. Meeks Jr. \"hal2k\"", "ReviewID": "RRBM3JLY9CU6I", "Overall": "5.0", "Content": "Fuji's x20 camera represents the higher end of non-interchangeable lens cameras. It's chunky body bristles with controls, combined with both manual and flexible automatic shooting modes. It is designed to appeal to high end photographers that want something smaller than a DSLR but with enough control to be satisfying for artistic use.The camera is very tactile; from it how you turn it on (twisting the lens barrel), it's manual zoom,  it's two command dials (main and sub-command), to it's dedicated control for exposure compensation. These knobs are made of metal, as it the subframe of the camera. It has a substantial heft that prevents it from being a truly pocketable camera, but at the same time has a feeling of solidity and precision. The main command dial falls right underneath the thumb, as it should. The sub--command dial requires the thumb to move down into a position, that for my hands, is useable but not as comfortable. The body has a vintage feeling pebble finish that helps with grip, particularly with one-handed operation. There is even support for a shutter release cable via the threaded shutter release button.The 28mm - 112mm lens is enough for most shooting conditions. True, it would be nice if the lens was a little wider, but 28mm is decent enough for architectural shots and landscapes. It is an ideal camera for street photography; a camera that you will want to take with you always. It starts up extremely fast, and image cycle time is impressive. The camera shoots 9 fps in FINE+RAW quality mode (use a good class 10 SDHC card). Autofocus is quite fast, in some cases it feels almost instantaneous.The viewfinder is sharp and clear, follows the manual zoom and has a LCD overlay for camera status that doesn't impact image quality through the viewfinder. It is genuinely useful, including color functions such as the AF notice turning from green to red when it is not able to focus, giving rapid feedback. There is an eye sensor that turns the LCD off while using the viewfinder, to conserve batteries.It is commonplace now to have touch screens on cameras; the X20 eschews this for a combination of two menu systems that work together. The main menu button gives access to all functions of the camera. It is dense but well organized.  The Q menu (with it's own button) is a quick access menu for commonly used functions, laid out in a 4x4 grid. Menus are very responsive, with the sub control combination scroll and click wheel handling navigation. That being said, for the first couple of days keep the included manual handy. The manual assumes some basic knowledge of camera terminology. The table of contents is detailed enough that it functions as an index to the manual itself, making it easy to look up information.The modes on this camera include the typical auto and manual operation. The advanced mode includes both special effects (such as the lomoesque Toy camera), a 360 panorama mode (which works well as long as the photographer moves at a steady pace and keeps the camera level) combined with useful modes such as pro focus (a bokeh effect) and pro low-light (combines 4 exposures to reduce noise). The SP mode is a scene selection function that is common on cameras (portrait, landscape, sport, night etc).  Of course, it has both Aperture and Shutter priority modes and full manual. Manual focus is handled through the sub menu scroll wheel, with the ability to use edge contrast peaking and image zoom to aid in focusing on a subject. The submenu scroll for manual focus is proportional; spinning it faster jumps quickly from close focus to infinity. There are two custom settings on the mode dial, plus a programmable function button situated to the right of the shutter release button.The video mode on the camera is 1080P/60fps at a generous 36 Mb/s. There are lesser resolution modes, including a couple of curious, but marginally useful high frame rate (but low resolution) modes such as 320x240 at 150 fps. The video is recorded using h264/avc and stored as .mov files, ready to be used in your favorite video editor, such as Final Cut or Adobe Premiere.It should be noted that the camera does not have the now common HDR mode, nor is it a camera which uses Fuji's well known EXR imaging sensor, with it's unique enhanced dynamic range mode in a single shot (at half resolution). That being said, the camera is capable of excellent exposure, which combined with the RAW mode can produce images with quite good dynamic range.  RAW images are supported by tools such as Lightroom (version 4.4 RC), Aperture with the latest update and the included SilkyPix software.The camera uses a commonly available NP-50 battery. It's good for around 300 shots, depending on whether the LCD display is left on or not - not stellar, but adequate performance (buy a spare battery for trips). There are two accessories available for this camera. The LXF-X20 kit includes a lens hood, filter adapter, 52mm UV filter and pinch lens cap. The MIC-ST1 is a plug-in stereo microphone for when the camera is shooting video.As has been noted above, this is an excellent \"take along\" camera that combines responsive operation, a broad selection of physical controls and excellent image quality. It is not quite pocketable, given it's heft and size, but in exchange offers flexibility of shooting from a fully automatic mode to fully manual, with many options in between. It is a camera that one is likely to take with them because it is so enjoyable to use.", "Date": "March 31, 2013"}, {"Title": "Love this camera but Video issues, need help? - resolved", "Author": "Jerry13", "ReviewID": "R1ZT335YFTFDQA", "Overall": "5.0", "Content": "I ordered this camera for my wife ( I have the X100s prior to that x100 and prior to that 5dii, got rid of all of them except the X100s which I am keeping).The photos are great, amazing, printed them at SAMS on Epson, they came out great.Yesterday had the X20 at the Kids concert, took pictures and then tried the video at full zoom, well it would take just a few seconds of it and then stop and then message would show up \"write error\" so could not take the video at all, had to use the iPhone for the video.We love the camera, anybody has the same issues (incidentally had a toshiba 16gb card in the camera),Should I return the camera and try a different one?Suggestions.4/27/13 - Finally resolved the issue by changing to a different brand SD card and now video works perfect, love the camera, a keeper. Updated the rating to 5 stars.", "Date": "April 23, 2013"}, {"Title": "Beautiful to look at, wonderful to use, great results.", "Author": "Anthony Pantliano \"The Photo Guy\"", "ReviewID": "R13OUPF39AK733", "Overall": "4.0", "Content": "The Fuji X20 is a terrific enthusiast's camera with excellent ergonomics, great photo quality, a fast and sharp lens, and a useful optical viewfinder.Build quality wise the Fuji shines.  It feels exceptionally solid and well built.  It's just a joy to behold and hold!  Most of the knobs and buttons have a high quality feel with good tactile response and the camera feels great in the hand.  Even the lens cap is made of metal.  The few sore spots are the slightly chintzy feeling command knobs on the back, a crooked exposure compensation dial, and a manual zoom that feels stiff when zooming through 35mm.  Despite the camera's dense build quality it is not a burden to carry around all day.  Indeed, instead of using the included neck strap, I find the Fuji works quite well with a wrist strap.  Size wise the Fuji will not be slipping into your pant's pocket, and travels best in a small camera bag or a jacket pocket.One of the Fuji's nicest features is its optical viewfinder.  It's almost as good as the one on my Fuji X100, but it only covers 85% of the frame and does not give as many details about shooting settings.  Still, it gives you shutter speed, aperture, and when you change the ISO speed that will show up as well.  In low light the display's information glows in green so it's easy to see.  Optical viewfinders such as these are becoming a rarity and I shoot almost exclusively with the Fuji's viewfinder unless I'm close to my subject and framing is critical.  I very quickly adjusted to how the viewfinder frames shots, and what my final shot should look like.  There is an accurate eye sensor that turns off the rear LCD as your face comes up to the viewfinder.  Speaking of, while the LCD is big, has very accurate framing, and high enough resolution, it tends to wash out a bit in direct sunlight, so it's nice that Fuji included the shortcut of holding down the \"Q\" button to brighten up the LCD.Being an enthusiast's camera the Fuji has all of the requisite manual controls and is covered with buttons and dials for direct access to many settings.  The auto ISO control is highly customizable, with settings for minimum and maximum ISO and minimum shutter speed.  Despite all the direct access buttons the Fuji can take a little while to master since some of the controls are not consistent (for instance when choosing Auto ISO you have to hit the back button instead of the OK button).  There are a few other little handling quirks like this, but you'll get used to it after you shoot with the Fuji for a while and the \"Q\" menu gives you quick access to lots of settings.  A couple of other things I didn't like were the limited options to review images after they are taken (.5 or 1.5 seconds or holding until the shutter is pressed), and that you cannot delete a photo right after it is taken.  Another thing that took a little getting used to was extending the lens to power the camera on, but it's a feature I quickly came to like, as it was possible to turn the camera on and instantly zoom to my desired focal length without having to wait for motors to power the lens.The Fuji powers up quickly and navigating menus and changing setting is also brisk.  The camera rarely leaves you waiting.  Focus speed and performance was also good.  In good light and low light, from wide angle to telephoto, the Fuji was always quick to focus and rarely hunted.  It focused accurately about 99% of the time and when it missed, it really missed so you knew you had to take it again.  Shot to shot speeds are quick, even when shooting RAW, but you may have to wait while the camera writes images to the card before you can review them.  When continuous shooting RAW shots the camera stops after 8, and for JPEGs the camera starts to slow down after about 12 shots.  Battery life is good and I was able to take a couple hundred photos, with lots of setting changing and photo reviewing, before the low battery icon showed up.As far as photo quality is concerned the Fuji shines for a pocket camera.  The photos are well exposed, have great color, and focus.  Overall, they just look very smooth and \"professional\".  Noise wise, it's definitely not going to compete with my Fuji X100 or Canon G1 X at high ISO, but it compares very well to my Canon S95.  Indeed, up to ISO 400 I was very happy with the results, and while even at base ISO details like grass can look a little mushy, sharpness was high and noise levels were low.  Shooting up to ISO 1600 was also decent, but there was definitely visible detail smudging (photos started to look more like watercolor paintings) and they started to show visible noise.  Above ISO 1600 I would consider to be emergency use only as things really start to look processed.  Thankfully, the Fuji lets you adjust noise reduction of the JPEG files and I've found that by reducing it to the lowest level available you get a decent amount of detail back, and, to me, it's worth the extra noise.  I'm very critical of image quality and \"pixel peep\", so if you're printing high ISO images smaller than 8x10 you'll be very happy with the JPEG results.  Using Lightroom, and processing RAW files is the way to extract the best image quality from the X20.  There's a marked improvement in detail retention, and a loss of color noise when done that way.  Thankfully the bright lens on the Fuji (f/2.0-2.8) and image stabilizer allowed me to keep ISO speed down.  Speaking of, the lens is very sharp from corner to corner, even wide open.  The X20's wide aperture and slightly larger than average sensor also allowed for nice depth of field with subtle and smooth backgrounds.  The one sore spot in the lens' specs is the lack of a built in neutral density filter.  In all other photographic quality regards the Fuji did very well.  Exposure, color, sharpness, and dynamic range (I set the X20 to auto dynamic range) were excellent and rarely did I have to make adjustments.  The Fuji's built-in flash is a little weak, however, and makes for a modest fill flash.  Lastly, the X20 does not suffer from the white orb problem that the X10 had.All in all... a terrific beautiful camera with all the features and high photo quality that enthusiasts want.04/13/2013 Update: Having used the camera a bit more I've made a few more observations; 1) The screen is still a pain to use in bright sunlight.  Since it's so dim it's hard to tell if the photos are exposed properly.  Thankfully, the Fuji does an excellent job with metering, so it's rarely an issue.  2) I like to set the ISO to auto with a maximum of 400 and then set the Dynamic Range to auto as well and the camera will choose the proper dynamic range level all the way up to 400%.  3) When using manual focus, the focus peaking feature works well.  4) Lastly, the zoom is starting to smooth out a bit as you zoom through 35mm.  I also love that you can have the LCD show you your current zoom setting in 35mm equivalent.08/05/2013 Update:  This weekend someone knocked into me and the Fuji was knocked out of my hands and into a vinyl floor from about 4 feet.  To the Fuji's credit it survived the drop with one little scratch.  Also, I don't like that you can't access the higher shutter speeds from aperture priority mode.", "Date": "April 1, 2013"}, {"Title": "Another gem by Fuji!", "Author": "P. Baek", "ReviewID": "R3I7V6T1K0FK3H", "Overall": "4.0", "Content": "Just received my silver X20 several days ago. Here's my quick take on it. (BTW, I also own the previous X10 and also a Sony RX100)Pros:-- Excellent overall image quality from ISO 100-400; very good/good image quality from ISO 800-1600. Obviously, some noise is there as you increase ISO, but playing around with the menu settings helps things a bit. Even with the brand new sensor, not a huge difference in image quality compared with the X10, but rather it's subtle (i.e. little better image detail and shadow highlights). Compared to the Sony RX100, overall image quality is similar most of the time, but the Sony wins easily in resolution. Colors look a bit better on the Fuji.-- Generally excellent overall performance. AF is usually fast and dependable most of the time, however, as to be expected in most compact cameras, it doesn't do that well with fast action or in challenging lighting conditions.-- Excellent build quality:  I love the chic \"retro\" design in the silver/black X20....gets great compliments from everybody that sees it. I only wish the rear LCD screen had swivel and/or tilt feature.-- Very good movie mode:  It's finally full HD (1080) and much better than the X10 in this regard....However, the RX100 is easily the best in this area......much smoother and more detailed.Cons:-- Menu still antiquated compared to the competition.-- Rear LCD screen has no swivel/tilt feature-- No dedicated \"movie\" button-- No WiFi feature-- Easy to lose lens cap-- Somewhat bulky (compared to the RX100)-- Flash a little weak and not tiltable like the RX100's", "Date": "March 31, 2013"}, {"Title": "Great except for slow focusing and filters.", "Author": "Emileigh", "ReviewID": "R2V0D7NFX2RZLB", "Overall": "4.0", "Content": "I was really psych'd when I ordered this and this is an early review, but other than not being able to find a way to turn the back screen off (I like using the viewfinder) I am really, really excited.  Except for the slow focusing, which cost me a wonderful shot of a red-tailed hawk landing on a transmission line tower.Generally the camera is really amazing.  The camera design itself is beautiful and the controls you use the most are conveniently located and intuitively labeled.  I like to shoot outdoors with a polarizing filter, and having the exposure compensation nob on top is so cool.  It's nice to not have to wade through lots of menus to get to it, unlike a camera from a different manufacturer I own.  On the software UI side, the menus are well thought out, and you also have a customizable \"Q\" menu (Q for Quick I think) that lets you put the most frequent functions on button push away.I could go on and on about how great this feature is, or how great that feature is, but on the whole I think it would just be easier to say it meets or exceeds the quality and performance of my big DSLR, though since it is about 2 years old now, this camera has some additional features that my old one does not have.  I guess that is to be expected.I really want to give this camera 5 stars, but - the slow focusing was a disappointment.  Maybe it's a setting I don't have optimized though, and if so I will come back and revise the review.One thing however, is there is NO question about is the filter size.  For some odd reason Fuji has decided on a proprietary size (some say 40mm, other's say 40.3mm) and not the industry standard 40.5 mm.  Don't believe it if someone tells you the 40.5 filter works, it may go on for one thread, but that's it.  It won't be stable.  Fuji sells their own adapter (that goes up to 52mm) but then I am sure it will block the viewfinder (they say the slots let you see through it, but I'm not sold.)I bought a Transcend Wi-Fi SD Card to go with it.  That seems to work pretty well although having the wifi active seems to suck battery life.  So I've bought two extra batteries.  A normal SDHC card doesn't seem to do so.", "Date": "August 9, 2013"}, {"Title": "Excellent camera", "Author": "Pete V", "ReviewID": "R2A655CXNX50DP", "Overall": "5.0", "Content": "I am an experienced amateur photographer and I wanted a smaller camera than my digital SLR cameras but with the same facilities.I love the X20. It I'd beautifully made and I like the retro look.If I have one small complaint it is that the lens only stops down to f11.  I would rather see f22.Addition April 2014.I have now had this camera for just over a year.  In the past week it has developed a fault in that the error message \"lens control error\" appears at start-up on occasion but not all the time.  The message appears at random: sometimes frequently and then not at all, and when it does appear the camera is not useable.  I have tried several remedies suggested on the internet but none have fixed the issue and the error message still appears on occasion.I do understand that modern and complicated electronic equipment does sometimes fail.  No-one else on the Amazon comment has reported a similar malfunction and so I am just unlucky with this particular item. I still rate the fuji X20 as 5 star.Because I use a camera very regularly, and repairs to this one will take a long time, I have ordered another fuji X20 because I have not found another camera with the specification, looks and results as this.  Of course if I experience the same malfunction again I might consider reducing my rating somewhat!", "Date": "June 6, 2013"}, {"Title": "Fujifilm X20 12 MP Digital Camera with 2.8-Inch LCD (Silver)", "Author": "KT", "ReviewID": "R3UEMN78BC8SM8", "Overall": "5.0", "Content": "I love the fuji x20. I usually shoot with a Canon 5D mk 3, but wanted a camera to take snapshots of my family with on a recent trip out of the country when I didn't want to lug heavy and expensive gear with me. I was surprised at how great the images from the camera looked, especially since it is a point and shoot. It has great color rendition, dynamic range and really nice bokeh when you open up the aperture. (Note: I always shoot RAW images, so of course that helps with the image quality.) I was hesitant to buy a camera with a built in lens but it totally blew me away when I saw the photos. If you're looking for a smaller camera to toss in your bag in lieu of a DSLR, this is perfect.", "Date": "June 3, 2014"}, {"Title": "Perfect compact for my needs!", "Author": "Matthew Hillier", "ReviewID": "RWRD4FTIQV8MQ", "Overall": "5.0", "Content": "I simply adore this camera. I bought it because the music festival I'll be attending soon doesn't allow \"professional cameras with interchangeable lenses\" and because I needed something low-profile for street photography.  It definitely fits the bill in many regards. I love the film simulation modes and customizable dials. The B&W; and Velvia modes are my favorite. The super macro mode is stunning!  Focuses very fast. Handles low-light situations with ease. The only peeve I have is the short battery life and lack of a 100% coverage viewfinder, but I'll manage ;)  Also, not to sound spammy, but I would highly recommend a 40mm filter of some sort for lens protection and a thumb grip (both of which can be found on Amazon).", "Date": "May 22, 2014"}, {"Title": "great looking and takes great photos", "Author": "yrstruly.", "ReviewID": "R1U8KY1OW4YPQ4", "Overall": "4.0", "Content": "i'm hesitant to post a long review because i've had the camera less than a week.  but so far, i'm thoroughly impressed.  i read on other sites that the video quality was poor but i have not found that to be the case.  the video was very crisp and clear.  i've been having some problems with an orange tone to indoor photos - so i took one star off.  i wish there were more scene options as well but overall, this camera is fun to use and takes excellent photos.", "Date": "May 4, 2014"}, {"Title": "It's all about the pictures's", "Author": "Shane O. Laake \"camera nerd\"", "ReviewID": "R3KXBPJYFSZN1J", "Overall": "5.0", "Content": "While I've used SLRs and the higher end Fujifilm XF series of cameras and flashes, it's not the specs or the cost of the camera that matters. Some cameras transcend sensor sizes and F #s (worry not if these mean nothing to you), and this camera fits the bill.  It just takes great pictures.  The compact size helps a ton, as you can carry it anywhere.It looks great, it's easy to use, and it takes great pictures.  The pictures simply pop with great color, contrast, and sharpness.  Granted most of the frame will be in focus, but that isn't always a negative.  It's easy to use, and while it may lack some of the dials of the X100, it's not really that type of camera.I cannot recommend this enough for anyone looking for a relatively compact (not pocketable) camera that takes great pictures, as long as you aren't looking for a super zoom (this isn't one).", "Date": "May 3, 2014"}, {"Title": "Nice vintage look - Great quality in daylight/outdoors", "Author": "Fede Rega", "ReviewID": "R4QQD24AH5H46", "Overall": "4.0", "Content": "This is a very nice camera when you don't want to carry a bulky SLR one (I must say that I'm a SLR-lover); mainly in places where a \"profesional\" camera is not allowed into, e.g. NBA/MLB games.Picture quality is great for a camera this size; much better in outdoor/daylight than in indoor.I'd like that picure size where a little larger (I'm used to 18-20 megapixels with my SLR cameras); largest picture in this camera is 12 MP (4000x3000) in a 4:3 format. If you want a \"wider\" format, it falls to 4000x2250 which is 9 MP.I really like the vintage look.It has several features for taking fun pictures, like B&W; plus selective colors.Video quality is pretty good; it is much better than the video taken with an iPhone 5.I don't give the fifth star because of the cost-picture quality ratio and the fact that the battery does not last more than 150 pictures. (100 if you take in RAW format). I paid $499 for it.", "Date": "May 1, 2014"}, {"Title": "I have it as my second camera, my main one is a D7000.", "Author": "Hector", "ReviewID": "R3Q5VQKYGKEL67", "Overall": "5.0", "Content": "good picture quality, compact and easy to carry. 100% view finder will be better but you get used to it..", "Date": "April 30, 2014"}, {"Title": "Nice camera", "Author": "Bill LaRiviere", "ReviewID": "R2J5P0MA9JC6BJ", "Overall": "5.0", "Content": "Nice size camera, although not pocket size.  Sharp images.  Plenty of options avaliable for advanced users.  Control when I want it to shoot in manual mode.", "Date": "April 30, 2014"}, {"Title": "Simply the best", "Author": "BallaghMan", "ReviewID": "RNB6YY71Y3IZZ", "Overall": "5.0", "Content": "We've gone through a lot of cameras over the years, we are not professionals but we are fussy, and this lovely camera is probably the best we've bought, for sharp, well focused, clear, versatile pictures.  Highly recommended if its in your price bracket.", "Date": "April 29, 2014"}, {"Title": "Exceededexpectations", "Author": "Joseph D. Darnell", "ReviewID": "RVNK6AFL58NAN", "Overall": "5.0", "Content": "Size is right, picture quality exceeds my expectations. Excellent for action snap shots.  Controls are easy to use. Particularly like the manual zoom function.", "Date": "February 16, 2014"}, {"Title": "Great compact for travel with one of fastest lens and great color renditions", "Author": "amazon buyer", "ReviewID": "R3C12HQJVMCQ38", "Overall": "5.0", "Content": "F 2.0-2.8 is hard to beat for great low light shooting and good enough to have a pleasing off focus for portraits.  The color capture of the Fujifilm is one of the best and for users with a bit of camera basics and control the camera easily with all the available external settings.  Focus is pretty fast as well for center weighted mode and I am able to use it to capture family pictures where kids don't stay still.  From someone that already own a SLR on trips, I would opt for X20 for all future trips as it is a lot more portable and picture quality is comparable to entry level SLRs which is plenty good for me.", "Date": "January 1, 2014"}, {"Title": "Great Retro and well make Camera", "Author": "sticky moose", "ReviewID": "R256A6N1CHF2T3", "Overall": "4.0", "Content": "I love the retro look and well made, the camera has a few quirks in the way you take images. I can learn to work with it.At time i wish it had a little more zoom, but that is only 5% of the time. This camera was purchase to take vacation photos.Any really good scenes we would use our DSLR.", "Date": "December 12, 2013"}, {"Title": "Great gift - but get one for yourself, too", "Author": "Vicki", "ReviewID": "R141QDBJXOLMX7", "Overall": "5.0", "Content": "I actually bought this for my daughter. Her other camera is a Canon Mark II 5D for professional photography. But she found this little guy to stick in her purse for when the moment strikes you (way smaller to carry around!). It has full capabilities her Mark II has. I played with it for a little while and it is really sweet (I am truly amateur). Now I want one.", "Date": "November 20, 2013"}, {"Title": "Very nice camera", "Author": "Theodor Kirkeby", "ReviewID": "R27MNY82LEPE92", "Overall": "5.0", "Content": "First the cons: The camera focus can sometime take a bit long, the camera is not really pocket size but it looks cool around your neck. The zoom is not very long eitherPros: Looks very sweet, both the pictures and the camera style, very fast at taking pictures, displaying them, and starting up, the different modes are very useful once you get to know them, and the video looks very sharp when there is enough of light.I am very happy with this camera and i hope they make a \"sequel\" that is not so expensive as the x100s", "Date": "October 13, 2013"}, {"Title": "Small but mighty", "Author": "David R Readinger", "ReviewID": "RSVYPE842PDYI", "Overall": "5.0", "Content": "Great little camera that does everything I need and produces excellent images in all kinds of light.  Wish the batteries were easier to find but can't have everything.", "Date": "October 2, 2013"}, {"Title": "Stylish Quality", "Author": "E. J Tastad \"ejt\"", "ReviewID": "R1UFPH1ZPK6V9J", "Overall": "5.0", "Content": "Pros:Build Quality/MaterialsImage QualityOverall PerformanceCons:AF-C (Autofocus-Continuous) mode of limited useRelatively LargeExpensive for a point and shoot (but competitive with other enthusiast point and shoots)Manual Focus (no focus ring, turn rear dial)Focus: 4/5AF-S and AF-C Modes.  AF-C mode works as advertised, but not as AF-C mode in a DSLR.  It continuously focuses until you half press the shutter and then it stops.  The point here is it keeps the focus point near where it needs to be, but it is annoying because it stops when you half press, and if you are in burst mode it won't focus between shots even at slowest burst rate.  Besides AF-C the autofocus is exceptionally fast an accurate.  For fastest AF, depress the button all the way without half pressing.  The image might appear out of focus on the screen when it stops displaying but usually the resulting image is in focus.  Half pressing the shutter release results in slightly slower focusing, but easier to verify your subject will be in focus. Manual focus is next to useless, very slow turning rear dial.  Thankfully it is rarely needed.Image Quality: 5/5I shoot mostly RAW with Lightroom 4.4 (just released), but with JPEG this camera is very good as well.  I initially shot only JPEG and was pleased with the results.  If you don't mind some grain you can set auto ISO up to 1600 or 3200.  The grain is mostly pleasing, film like.  Not like older digital cameras which had a strong pattern.  In JPEG mode I like the dynamic range mode on auto, and it will help restore shadow detail if you shoot into bright light.  The only issue with image quality is if you shoot in some of the \"Adv\" modes like Pro Focus.  If you shoot Pro Focus at high ISO it can really make some weird smoothing artifacts.  Consider this mode only useful for 4x6 prints or similar, or shoot at base ISO with a very different color background to avoid smoothing the subject into the background.  I didn't notice ORB issues or anything on this camera like the previous model suffered from (highlights would be perfect circles instead of star bursts, from clipping around the highlight).Lens Quality: 5/5No significant issues with the lens, could be longer zoom range, but the shorter zoom range helps keep the quality higher.  I love that the aperture remains f/2.8 at the telephoto end where most cameras drop to f/4.5 or smaller at the telephoto end (this means this Fuji lets in more than twice as much light).Usability: 4.5/5There are numerous buttons for direct access.  I love the metal machined lens barrel and zoom ring.  The silent mode is nice to make the camera virtually distraction free, just be aware the flash won't fire in this mode.  The macro mode is helpful to tell the camera to focus close, my only complaint is some of the modes are not compatible with some features and it might not be immediately obvious what is wrong.  For example, the optical viewfinder won't \"work\" in macro mode, it keeps feeding all the info to the display.  You have to remember to turn off macro mode to get the optical viewfinder to function properly (show focus indicators and shooting information).  It should flash a macro symbol in the viewfinder to show the error or some indication of what is going on.  The power switch is weird, you turn the lens and extend it and this automatically turns on the camera.  It is fine when you get used to it, but it is different.  A helpful tip is if you only want to review images, press and hold the playback button for about 1 second and the camera will turn on even if the lens is in the off position.  This will let you edit some camera settings, view images, and develop RAW files, etc.Build Quality: 5/5Metal and high quality plastic construction.  Large detailed screen.  High quality optical finder.Battery Life: 2/5Buy an extra battery or two.  Carry it with you.  I get maybe a few hundred shots on a charge.  They are very slim batteries and take up minimal space.Video Quality: ?/5Sorry, I don't shoot video and won't pretend to rate the quality.  The few clips I did shoot looked nice enough, but don't have a lot to compare them too.Overall performance: 5/5Great camera.  I love the build quality, image quality, and usability.  It is a beautiful compact which I carry with me all the time.  It isn't small enough to slip in a jeans pocket though, but fits nicely in a jacket pocket or is light enough to carry on a shoulder no problem.  However, this camera isn't for everybody.  It is for an enthusiasts who might be impressed by high build quality, film camera like appearance, and likes the retro appearance.Camera Setup: I use the camera in the high performance mode and with the factory firmware.", "Date": "April 6, 2013"}, {"Title": "Very competent in a tiny package", "Author": "A. Shrestha", "ReviewID": "R2VJMW110KQAAY", "Overall": "3.0", "Content": "Overall: This was my first Fuji camera, and I had big expectations. I was expecting to be blown away by the supposedly amazing \"Fuji color rendition\". Although this little camera is competent, I was not impressed overall. I would not recommend this to the person graduating from the point-and-shoot, because you can buy a system camera (u4/3 or NEX) for less and learn more. But the advanced user tired of carrying their DSLR and lenses may want to consider the Fuji X20 for a competent camera in a tiny package.Pros:+ Optical viewfinder+ Fast focusing+ Easy to use menu+ Super easy to use Quick Menu+ Quality macro mode allows close focusing+ Panorama sweep mode+ Plenty of art filters and simulation modes+ Solid build quality and feel+ Excellent flash and high speed since+ Super quiet! (seriously, sometimes I wasn't sure I even took a picture)Cons:- Did not live up to the hype (for me)- Optical viewfinder offers too little coverage- Fuji non-standard filter sizesFirst Impression: As I was unboxing this thing, I was very impressed with the weight, feel, and build of this little camera. Everything felt very sturdy and not plastic like the Sony NEX 3/5. I have very little doubts as to the long term durability of this camera. It felt the way the cameras from the 70's and 80's feel: sturdy. (I have a Nikon FE2).VS the Competition: I can't compare it to any of it's direct competitors but I'll compare it to some of the other cameras I've owned:A) NEX F3: The Fuji X20 has better build quality, autofocus, menus, and usability. The NEX has better image quality, especially for low light, and better ergonomics. The NEX has atrocious menus.B) Olympus OM-D EM-5: The Fuji X20 build quality seems to compare well with the OMD. Autofocus is similar between the OMD and X20. Both are very fast. However, the OMD has more advanced features like face detect with near eye (which works great, BTW). OMD EVF is better than the Fuji X20 OVF. OMD also wins in image quality and low light. Of the two, I recommend the OMD - it is a unique and wonderful shooting experience.C) Panasonic LX7: Fuji X20 has better build quality, autofocus, menus, ergonomics, usability, and image quality. The LX7 is cheaper.Side note: People either love or hate the Fuji menus. If you like the way Olympus and Nikon do menus, you'll like Fuji too. If you like the way Canon and Panasonic do menus, it'll take you time to get used to the Fuji, but you may learn to like them. Nobody likes Sony NEX menus and no manufacturer should imitate Sony NEX menus. I learned on Nikon DSLRs, so Nikon, Olympus, and Fuji menus are natural and easy to navigate for me. The Fuji Quick Menu is very good and easy to use.My preference, in order of best to worst menu system (and thus, a big factor in general usability):1. Nikon or Olympus2. Fuji (Quick Menu is excellent)3. Canon4. Panasonic5. Sony NEX (which is terrible)However, overall, I wasn't too impressed with the Fuji X20 image quality. Also, after reading other reviews about how the Fuji color rendition was great, I think I had too much expectation for this little camera. It's a good advanced point and shoot, but I wouldn't recommend it to the average user.Fortunately, Fuji makes it very easy to use this camera. You can use the control wheel to easily change aperture, shutter speed, and program shift. I generally use cameras in Aperture Priority. Autofocus speed is excellent and on par with the OMD, and significantly faster and more accurate than the Sony NEX.The Fuji X20 is incredibly quiet as well. Sometimes I couldn't even tell that it had just taken a picture. My wife couldn't tell either.Lastly, Fuji does one thing better than any of the other camera listed above: fill flash. Combined with the leaf shutter, you can get some very fast flash sync speeds that are not possible with your typical Nikon, Canon, Olympus, or Sony. And the Fuji fill flash looks very natural without being overpowering.In Summary: I think this is a really nice camera, but a little underwhelming compared to my expectations. At $600, I wouldn't recommend it to the person who is graduating from a point-and-shoot because it is too expensive and you could use the money for a system camera (like Panasonic, Olympus, or Sony NEX). However, I would recommend the Fuji X20 to an advanced DSLR user who needs a competent camera in a small package.Thanks for reading and I hoped this review helps you make an informed decision about this much hyped camera.- AviUpdated 08/03/2013: I dropped this to 3 stars. I have the X-M1, and it blows away the X20. Of course the APS-C sensor is significantly larger than the 2/3\" sensor. I highly recommend buying the X-M1 over the X20. For a competent point-and-shoot, I also recommend considering the RX100 M2 before buying the X20.", "Date": "April 29, 2013"}, {"Title": "Great little retro looking camera", "Author": "relichunter", "ReviewID": "R1Y0Y0THANNPJN", "Overall": "5.0", "Content": "I got tired of lugging around a big DSLR while im on vacation,but i wanted something better than a $100 point and shoot,I set $500 as the max I wanted to spend,I searched in vain for a $500 Leica M9 lol,I have a single malt scotch taste on a beer budget,I looked at several cameras over a months time,hands on testing,I tried my brother in laws new sony RX100, my preconceived opinion that this was the holy grail of small cameras,It left me cold it feels so sterilized and modern,I did not like much of anything about it personally,The Lumix LX7 was the same altho I like the price point,I am not a nikon fan at all megapixels alone do not make a picture,I learned that on my canon 5d with 12 megapixels which takes amazing photos, I wanted a nikon D800 with 36 megapixels I dont like anything about that camera,photos in my opinion are not better,my next DSLR will be a canon 5d mk111,but will take a year of saving,I tried a canon G15 I really like this camera it has so much going for it,this is not a technical reveiw its my gut review,then I tried the fujifilm x10 and I fell in love with this camera,its build quality and retro looks just made me want one,it takes amazing macro photos,and human skin looks so gorgeous its just the right hue for candid portraits,Its not perfect I still would rather have a Leica M9 or X2,but I think that for me this camera is the best compromise,but then the fujfilm x20 came out,It is rare to find at this point but I found one in a camera store in seattle but it was sold,the salesman walked me through the x20 and took a few photos,Its true its $600 but,its a real beauty so I ordered one,I will edit the post after awhile with an updated opinion,I feel like a kid in a candy store.", "Date": "April 21, 2013"}, {"Title": "DSLR-like pocket-sized camera (limited by its zoom)", "Author": "bored99", "ReviewID": "R1Y9W7Y2DSXK1P", "Overall": "5.0", "Content": "Other reviews will give you a better sense of the technical specs for this camera, but my specialty seems to be explaining things in terms \"the rest of us\" can understand :) And the bottom line is that this is may be the most sophisticated pocket-sized camera I've seen. Its zoom is fairly limited at only 4x, and I wasn't able to enlarge the pictures for use as backgrounds in my kids' yearbook, but otherwise it has options you can generally only find on a DSLR (which are usually 2-4 times as big, and therefore somewhat prone to being left at home when you need to bring other things along, like books or small children).PROS* Super-easy to use (once you figure out that twisting the zoom is also how to turn the camera on)* Somehow manages to give you a TON of different options without overwhelming you with buttons or menus; even has an awesome \"Q\" button that displays a quick grid of all your settings so you can easily select and tweak the ones you want to change if you don't feel like jumping through menus. This is a lifesaver when you want to change 4 settings and don't want to futz with shuffling up and down through menus 4 times. (It also has a C1 and C2 button to quickly toggle between two distinct sets of \"manual\" camera settings)* Has a few buttons on the left side for more-common functions (like \"play\" and \"burst mode\" and white balance) so they're easy to access* Takes good pictures (reference technical reviews and samples if you want more details on that front; for most of us, the pictures will be entirely usable)* Modes: I can't list them all, but it has pretty much every mode I've ever seen on another camera (sunset, beach, fireworks, sports, portrait, soft skin portrait, indoor party, nighttime still, toy camera, panorama, spot color (6 of them), landscape, flower, night, snow, beach, text, dynamic tone, high key, low key, etc.). When I'm out with kids, I just put it on \"sports\" (for most things), or \"portrait\"/\"pro focus\" (if I want a more artistic shot with the background blurred out), and save the other options for a day when I have more time* Has good color options that are quite easy to select or change: standard, intense (\"velvia\"), B&W;, sepia... plus the aforementioned 6 \"spot color\" options where one color (like blue) is kept, and everything else is B&W;, plus a bunch of ways to manually tweak the color that I confess are beyond my ability* Specs:  the f-stop ranges from 2.0 to 11 (so it's on the \"bright\" side, as their marketing says, but is good at focusing on _just_ the element you want in your picture, and has decent options for letting you select precisely which element that is); the shutter speed ranges from 4\" to 1/4000, so that's a broad range. You're going to have more luck getting portraits, sport shots, and pictures of moving objects (children included) than you will of waterfalls, or other things where you want a slow shutter speed without whiting out the entire screen (which a waterfall shot would do without a higher f-stop option, or an external \"neutral density filter\"), but slow-shutter-speed evening/night shots are just fine* Has a fairly wide angle at 28mm, which makes life easier if you're photographing a children's museum or an indoor birthday party (people don't have to squish together quite as much to fit into your image)* Can fit into a (large) pocket. Barely ;) But it's still teeny tiny compared to a DSLR, and really easy to grab and go.CONS* Only 4x zoom - better than no zoom at all, but it's much easier to compose pictures well with a 10x or 15x optical zoom, especially if your child is across a soccer field and you want to have them be the clear star in your photo* An indicator on the side tells you what your exposure is, but the LCD doesn't always reflect it. So it might look normal on your screen, but if you mess with the settings in manual mode, the picture itself could be super-light or super-dark (so you have to pay attention to the exposure indicator on the side). This isn't much of an issue in modes where it automatically decides the exposure for you, but be aware that it can be an issue in \"manual\" mode* The pictures can't be enlarged as much as you may hope. The camera supports 12mp (3000x4000 pixels), but when I tried to stretch the images for use as backgrounds in my kids' yearbook, the software informed me that the resolution simply wasn't high enough (it was happy with the 6000 x 4000 pixel images from my DSLR). So if you ever print images for wall-art or posters, double-check that the resolution will be high enough for you", "Date": "March 26, 2013"}, {"Title": "This stickler is pleased", "Author": "Douglas Henderson", "ReviewID": "RQJR604E3AW7B", "Overall": "5.0", "Content": "A nicely built little camera with excellent lens.  The copy I received from Amazon was brand new, unopened and untouched since leaving the factory.  I won't repeat all the camera features and particulars--but those that surprised me:1) the various frame formats offered beyond 3:4 (9:16, 1:1, etc.) only seem to work with jpg's, not Raw shots--too bad2) RAW photographic results, despite the modest-sized 2/3 sensor, are simply stellar--with the right RAW developer softwareI downloaded software for developing RAW files from three independent Raw developers:1) Iridient Raw Developer--the current version which I updated from an earlier one for a discount specifically for this camera2) Capture One (trial basis)3) Photoninja (trial basis)Fuji's modified sensor requires more care developing RAW files--but any of the above software works well.  Photoninja seems to work the very best of the three, but I'm getting beautiful results with Iridient, the TIFF's then fiddled with in Photoshop RAW Camera tools.  The resulting images come out remarkably sharp, though you will see noise with pixel peeking.  The low light landscape photos were really nice, so I don't care about the inherent noise characteristics of a smaller sensor wedded to an excellent lens when together they do such good work.  A pity one can't post examples next to comments.The smearing of some image details mentioned in some reviews is particularly well handled if not entirely erased by Photoninja and much diminished with the other RAW developers.  Adding some middle darks more or less addresses most of the smear effects that are quite noticeable in early online reviews of the camera.The lens shows a little light falloff around F3.2., at least under the 35mm setting.  At the widest 28mm lens angle, the far edge image resolution on the horizon falls off a little as well--again with pixel peeking.  And that is all I could find to fault--and I do look for faults.I rounded out the purchase with an off-brand PU \"leather\" case that allows the top to be removed if the camera is on a tripod and an off-brand lens hood and cap.  And a second battery.  A Class 10 SDHC card is recommended for video. The photos record fine with Class 4 SDHC cards.Lastly, Amazon really out to take better care about cushioning product boxes in their packages.", "Date": "January 17, 2014"}, {"Title": "This is a great camera. The one I've got had a problem.", "Author": "Gi Yeul Bae", "ReviewID": "RQRRALUJXUP63", "Overall": "3.0", "Content": "This is a great camera for everyone.No doubt.But the problem is that the one I've got didn't fire flash at all. I've returned it and will get a new one.When you purchase this camera, double check if everything is working before you use it.", "Date": "January 9, 2014"}, {"Title": "Great camera - could use raw support.", "Author": "Silvana Craig", "ReviewID": "R12LW70A6EQBAY", "Overall": "5.0", "Content": "Loved this camera.  Color balance and exposure are right on.  Easy to use if you use JEPG.  Only problem is that you have to use their CD to enable raw and many new computers don't even have CD slots [ my Mac Book Pro ].  Am trying to check to see if it can be downloaded from the Net.", "Date": "November 13, 2013"}, {"Title": "Fun & cool", "Author": "danielle marco", "ReviewID": "RVYQQU3D6DRLW", "Overall": "5.0", "Content": "The retro is so swanky. I love the feel and look of it. As far as the camera, it is great! Wonderful point and shoot. I'm still learning it, so, that's all I have on the review right now!", "Date": "July 23, 2013"}, {"Title": "Excellent Camera", "Author": "ALIK NAZARIO", "ReviewID": "R29K4MGYIZ12J5", "Overall": "5.0", "Content": "Im not an expert on cameras but know something about quality.This is a well built camera and is very easy to use", "Date": "May 24, 2013"}, {"Title": "Spectacular pictures. Extremely well made! Beautiful color saturation. Great viewfinder. Love this camera!", "Author": "Valentin Hernandez", "ReviewID": "R7VMFX8G3W5UG", "Overall": "5.0", "Content": "Spectacular pictures. Extremely well made. Beautiful color saturation.  Great viewfinder. Replaced my X10. Well worth the upgrade. Love this camera!", "Date": "April 21, 2013"}, {"Title": "Beautiful Get Up & Go Camera", "Author": "Ms_Ladi \"...just wandering the world.\"", "ReviewID": "RMZ8GRUWR784N", "Overall": "5.0", "Content": "I absolutely love this camera, so five stars from me.  That said, I'm a fan of cameras and the many uses every one has.  The SLR for professional events and jobs, the Leica for when I'm feeling \"artistic\" (yeah right), and the Sony Nex-7 for everything else.  I even love my iPhone for photos.I have been searching for a replacement for my Sony Nex-7 combined with Sigma 30mm f/2.8 lens.  The camera is/was great, I just wanted something more as far as dynamic range without investing in an expensive lens.  The Fuji X20 does not fit the bill, but it has a few extra static traits that make it a great all-in-one.First, I didn't realize how much I missed zoom on a point-and-shoot camera until the X20.  The newest cameras, even with smaller sensors, do the zoom quite well compared to the tiny zooms of the early-2000s.The look is fantastic.  The camera fits squarely in my small hands...a must, since I hate accidentally pressing the wrong buttons.  It has a nice, expensive feel.  While on the lower end market of pricing...if $600 can be considered low, it packs a $1K punch.It was pretty simple to navigate the camera.  However, setting the mode on \"P\" will get even the novice shooting awesome photos.  I get in the habit of bringing two cameras with me, and handing an easy one to my friend to shoot photos with.  The X20 is a pretty simplistic camera to pick up and start shooting.Focus is pretty spot on.  This camera is perfect for use, and I wouldn't purchase a less expensive camera to save money.", "Date": "April 7, 2013"}, {"Title": "Great Little Camera for Family, Vacations, etc.", "Author": "Talvi", "ReviewID": "R3CVK1VH0W5QIL", "Overall": "4.0", "Content": "This is one of those in-between cameras that used to be called Prosumer but are now called \"enthusiast\".  What that means is that there are a lot of features for those who like some control on their cameras (manual shooting, aperture, etc.) but it is also fully automated for those that want very good pictures without needing a photography course first.The look and feel of the camera are wonderful - that retro 1970s feel when street photography was vogue and all the cool people had a good film camera that looks like this.  It is solid - heavier than your standard point and shoot but also much sturdier feeling. But it is also a bit larger (due to having a much more versatile lens that most point and shoots) so it doesn't fit comfortably into normal pockets.  It's good for a purse or larger jacket pockets, though.The lens has a zoom range from 28-112mm.  In layman's terms, it means you can shoot very close up or very far away - get a lot of a cityscape or landscape or just a beautiful flower.  Also, the lens opens up to an f/2.8 aperture at its widest. That means this camera gives that beautiful, soft, out of focus area around your subject that is so appealing from DSLR cameras.  You won't get that on point and shoots and very few prosumer enthusiast cameras can give as much soft out of focus area (called bokeh).  It means you get really beautiful portraits where your subject stands out against busy backgrounds.The camera has a small dedicated flash that can't be repositioned.  This is kind of a letdown in an otherwise great camera since it means you are going to get more instances of red eye and deer in the headlights with your people.  Other manufacturers like Sony have great swivel flashes that can be pointed against walls or ceiling to bounce the light and give a softer more natural look to your subjects.  It's this lack that makes this a 4-star and not 5-star review.The camera has a decent sensor size.  It's not so big that you run the risk of getting blurry subjects.  But the compromise is that you do lose some detail and crispness when there aren't enough pixels to define an area clearly (more noticeable on landscapes and far away views than on a headshot, for example).  But Fuji gets away with a smaller sensor size by the greater aperture opening of the lens giving that lovely blur.  And of course, you get that great color that Fuji is known for.I am a professional photographer with $75K worth of camera equipment. Yet I am very happy to own this camera as well for my snapshots. When I'm asked what camera the layman should get, I have always recommended Fuji over the years (though my pro equipment is Nikon).  They have an innovative way of approaching the cameras and photography that Canon, Nikon, and many others just haven't.  My first 'point and shoot' when I wanted a quick vacation camera was a Fuji as well and I loved that camera.Interestingly, the camera has an option for exposure compensation at the top of the camera.  What that does is make the camera shoot a bit brighter if it is looking at a dark area (after sunset, full shade on a sunny day) or lower the exposure a bit if you are shooting a bright sunny day.  Just don't forget to change the button back afterwards!  While an interesting option, it is quite surprising that it is the only one on the buttons.So why is this better than an iPhone and more point and shoot compacts?  It definitely has to do with the versatility of the 28-112 lens (being able to shoot far away or close up) and especially that great lens that has an F/2.8 aperture for creating that creamy out of focus area behind your subject.  But this camera also gives you manual controls so that if you want to learn the basics of photography for even better pictures (aperture, shutter, exposure, metering) you can learn with this camera's manual control settings as well.  As with all enthusiast cameras, you won't get DSLR camera level quality (and that ONLY comes with experience and knowing photography, so I never recommend a DSLR for the layman. That's like buying a racecar to go to the store).  But you're going to get a LOT nicer images with this camera than with the regular compact point and shoot.If you ever wished you had a professional photographer to give you a camera recommendation for something that will shoot your kids or vacation photos better than your iphone or previous point and shoot, here is your answer.", "Date": "April 6, 2013"}, {"Title": "Fantastic Camera Love using it!", "Author": "Zeb \"zebra01\"", "ReviewID": "R1X8TD285U8VW1", "Overall": "5.0", "Content": "I am presently using my Nikon D800 and a Sony RX-100. Have owned many cameras over the years like my Hassy 500c and Nikon F3 and many others including my first Digital SLR - Nikon D40. I have enjoyed photography for many decades. So I have had a broad range of cameras.Many disappointments over the years of so called highly rated cameras so I am rarely impressed.I am so impressed with the X20. The X20's sensor is wonderful with beautiful dynamic range and color. The lens is truly first class - beautiful color rendition and contrast. I have owned some lenses that clearly demonstrate such characteristics. Fuji clearly put one such lens on this camera!!!!!Many of the other features are typical of the present issue of cameras but it is Fuji execution of the features that makes the X20 stand out from the rest. For example I shoot most of my photos in available light. Many cameras have the feature where the camera tales 3-5 photos and builds the finished photo. The X20 does it so well and beautifully it is stunning.The build quality is first class and Fuji makes the camera in Japan. I find myself truly enjoying using the X20", "Date": "March 27, 2013"}, {"Title": "AN EXQUISITE LITTLE CAMERA", "Author": "Robert D. Williams", "ReviewID": "RLQ3AISAV08XE", "Overall": "5.0", "Content": "Right out of the box I could see that Fuji put their heart and soul into making this camera.  There are about 50 improvements over the X10 placed in the new X20 camera.  Just holding it made me feel like more of a photographer than I really am.  It has that retro look of the glamorus rangefinders of yesteryear but inside it's actually a completely different animal.  I have a Canon G12 which really comes the closest to the X20 as any other camera that I own, but the Canon pales in comparison to the X20 in many respects; fit and finish, small finder, with no info readouts, full plastic body, slow lens, no full paper manual, and many other functions.  The X20 is the camera that I always wanted but had not yet been built.  It came with a thick paper manual that I found I must read as there are many differences between the Fuji and my Pentax DSLRs or my Nikons even.  But once you have it learned, the camera is very easy to operate.  One of the cool things it has is the film simulation mode and  bracketing.  I find that especially great for portrait work.  Especially combined with the f2 lens and bokeh.  At 28mm the lens protrudes into the frame but disappears beyond 50mm.  100mm is great for portrait work so lens protrusion should not present a problem there.  I wouldn't call the X20 a P&S; although you could certainly use it for that.  It's more akin to a Leica M camera and in some ways is superior to one.  A poor man's Leica, well maybe.  I think that if, not to anger Leica fans,  the X20 had been available to Alfred Eisenstaedt (a famous Leica shooter) he might well have opted for it.  In this age of do everything cameras, the X20 is something different. Sure it takes good pictures and has a zillion modes, but most every camera can do that too. And great pictures can be taken with any of them.  But there are some cameras that you just gotta have and beg to be taken out and used.  The X20 is one of them.  No, I don't work for Fuji and this is not an advertisement.  I just like the X20.  If I was forced to issue a complaint, I would say size.  It feels just a bit small in my hands.  5.5in would feel better.  Also the diopters only go from -3 to +1.  I would rather see a -3 to +3 range for my eye sight.  Well, maybe in the X30.", "Date": "March 27, 2013"}, {"Title": "Great", "Author": "Corine C. C.", "ReviewID": "RAKVNZMGZEGBO", "Overall": "5.0", "Content": "the enthusiast compact sector has undergone a distinct revival in recent years, with every major manufacturer now producing a model or two that offers full manual control and raw recording, aimed as a second camera for enthusiast who usually carry an SLR. In general these have split into two camps-small slimline 'shirt pocket' cameras design for portability, and large models with more external controls, flash hot shoes, and large aperture zoom lenses. the X20 is fujifilm's latest offering in the latter class.", "Date": "May 26, 2014"}, {"Title": "great camera", "Author": "tammy miller", "ReviewID": "R2EOG7MMQ6PFNW", "Overall": "5.0", "Content": "Great camera. good job Fuji. next model should have interchangeable lenses. The after market thumb grip should be a standard item on camera.", "Date": "May 26, 2014"}, {"Title": "Fun to use", "Author": "Amy Thibodeau", "ReviewID": "RK601GG65RZHM", "Overall": "4.0", "Content": "This camera takes pretty great photos and allows for many of the manual settings a bigger, more complicated DSLR but it's lightweight and easy to use. I also love the retro look and I've never had a camera where the lens cap never falls off. This last thing is a minor detail but I really appreciate it.My only complaint is that it's impossible to take night sky photos because there's no bulb mode. This feels like an obvious miss.", "Date": "May 22, 2014"}, {"Title": "Great Look & Feel", "Author": "Gary Burandt", "ReviewID": "R3K5Z1LD47P1NU", "Overall": "4.0", "Content": "Love the look and feel of the X20.  Like others, I find the ON/OFF system annoying.Not sure the pictures are any better than with my Canon G12 - but that is a high point & shoot standard.", "Date": "May 11, 2014"}, {"Title": "Nice cam!", "Author": "Didier Mazier", "ReviewID": "R99RHA3PXDF3I", "Overall": "5.0", "Content": "Not a DSLR but with almost the same result. And it is so light you can always have it on you", "Date": "January 27, 2014"}, {"Title": "Fantastic", "Author": "Oleksandr Kobyakov", "ReviewID": "R3DQ4LLFXABCU8", "Overall": "5.0", "Content": "I have only one grudge against it - it renders my DSLR unusable. Almost the same quality but much less weight to carry about.", "Date": "August 8, 2013"}, {"Title": "Love my first Fuji film camera!", "Author": "Marla", "ReviewID": "RHUN9URSRHXNY", "Overall": "4.0", "Content": "I was pleasantly surprised by my first Fuji Film camera. I'm a novice and this camera is a dream come true for me. I do have a Nikon 3100 but I'm still getting familiar with that one so the pain free excellent shots of this one along with the HD movie mode is truly worth it. At first glance, the X20 feels sleek yet solid in hand though it is a bit bigger and heavier than some of the digital cameras in the market. I agree with some other reviews stating that this has a retro style to it. This takes great indoor shots with decent ones in low light, and I'm very impressed with the overall image quality and performance of the camera. The battery life is pretty good and the LCD screen at 2.8\" looks great. I definitely think that the optical viewfinder and the 4x manual optical zoom lens are two of the strongest points of this camera comparing to a Sony Camera I have. The price is a bit high considering you can get an entry level DSLR, however, if you want to be free of the complexities involved in using that kind of camera, you will love this!", "Date": "April 27, 2013"}, {"Title": "Perfect Street Shooter", "Author": "B. Harding \"cameracritic\"", "ReviewID": "R2NOFQFRFUC81T", "Overall": "5.0", "Content": "Here's my take after 3 days shooting:Generally good build quality.  The battery hatch, pop-up flash and front focus mode switch feel of less quality (plasticky). EVF is simple and works good enough for my needs. Don't expect the hybrid VF of the X100s.  The EVF does not work in Supermacromode. Nice size, light and unbelievably quite shutter.  Burst mode is comparable or perhaps faster image capture than OM-D EM-5 (12mm f2 lens).  People will make comments when you are using this camera.  Filter options are a bit over-kill, but why quibble? Supermacromode is particularly nice for bug and flower shooters.  Colors look great right out of the camera as JPEGs.  Easy to use.  Image quality looks fantastic. I'm not a pixel counter.A few minor gripes.  There is partial viewfinder obstruction from 28-35mm. No biggie.  The scrolly wheel feels too loose to me.  It is also super sensitive.  Batter life does not seem particularly good on AF-S, and worse at AF-C.  Pick up a few extra batteries.", "Date": "March 29, 2013"}, {"Title": "Handsome model with great picture quality,slightly larger than pocket size", "Author": "Ward J. Lamb", "ReviewID": "R3UVQSFKP4PUDB", "Overall": "4.0", "Content": "The X20 is a sleek solid model that has a feeling of quality,feels good in hand.It is 12.07 ounces and measures 4.6 width by2.7 height.I have had several fuji cameras,and I like their product.It's wide aperture works well at full zoom even though it's 4x zoom is somewhat limiting..Clarity and color are excellent.At first glance I found the view finder riveting in it's clarity.the pop up flash works well,and is manual.It has a short distance ability though and that is a limitation.The menu itself is not user friendly,at least for me,and I found it a bit clumsy to learn,and am still learning.I need more time to master it.It is advisable to use exposure compensation when in bright lit situations.I take some theatre type images and I find this tip compensates for saturation.The optical view finder gives shutter sp info aperture,and iso speed.It's green low light warning is a feature that is useful.I will be writing more as I develop more ease with the camera.I think it is an excellent small camera that rivals the quality of other small cameras. i wish it had wi fi capability,but in truth this model has many good features.It is an excellent pocket  small camera with limitations that do not merit if you are just looking for a quality slightly larger than pocket sized camera.It is a great on the go model and will see much travel the  coming summer.", "Date": "April 13, 2013"}, {"Title": "Thank you Fuji for fixing everything about the X10 I didn't like", "Author": "JB123", "ReviewID": "R3QYOBBIQYAIHQ", "Overall": "3.0", "Content": "Too bad the X20 is still too buggy for my liking.  Fuji fixed the X10 by adding info into the optical viewfinder.  This is great!  Just having that basic exposure and focus info through the viewfinder makes this a great improvement over the X10.The X20 nearly the same size and weight as the X-E2 which offers interchangeable lenses and a pro level sensor.  The X20 is just too big.Focusing is a mixed bag.  Manual focus is really not viable in my experience.  Auto focus is unreliable at best.  I'm not talking about complicated low light or high speed sports situations.  Basics outdoor daylight landscape shots make the focus hunt and often never lock.  I does not default to infinity focus as every other camera I own does.  It you try and focus on sky or clouds it just roams endlessly.I like the optical finder.  The images are nice and clean when you can get focus.", "Date": "April 13, 2014"}, {"Title": "Great camera in this price range", "Author": "T. Tom", "ReviewID": "R2IT6WUFWH126W", "Overall": "5.0", "Content": "It's going to be difficult to beat this camera in this price range. Everything from the metal build quality, retro form and modern function to the resulting image quality on the FujiFilm X20 seems excellent. Certainly, the image quality does not best a DSLR, but that's not what a small camera like this is about.If you are looking for a fairly small camera that has a zoom lens and want image quality that can at times rival that of a DSLR, look no further.The zoom lens retains an f2.8  speed throughout the zoom range, even when zoomed all the way to 112mm. Many other cameras have to go to something like f4.5 when zoomed in. The f2.8 when zoomed in is great for getting a nice bokeh for portaits for example. Note, this camera has f2 only when not zoomed in at all, at the 28mm focal length.The optical viewfinder has a nice crisp display with a 'head up' type of electronic overlay in it which is very nicely implemented. I really like the way that you turn on and off this camera is unique and feels very natural. You just turn the zoom lens ring. No having to find and fiddle with a switch on the camera body or press a button.While the image sensor on this camera is smaller than that on the higher end FujiFilm x100s model, the images are still of quite high quality since the lens and sensor are very well matched and engineered. This camera also has the zoom lens whereas the X100S does not and the X100S also costs double what this camera does.This camera also shoots full 1080p video.All in all, I'm very impressed with this camera as a 'take everywhere' camera, especially for the price. It also has a great classic design and sturdy feel to it which evokes a real sense of nostalgia and style that I really appreciate. When I don't want to carry around my big DSLR camera and heavy lenses, I can have faith in instead bringing the Fujfilm X20 with me and have a small lightweight and stylish camera that gives me professional results.", "Date": "March 27, 2013"}, {"Title": "Received a defective copy. Fuji's Service/Support stinks!", "Author": "Kyle F Opitz", "ReviewID": "R2JKFSJ9R0D6IN", "Overall": "1.0", "Content": "Pros:-Looks awesome.-Takes great photos.-Feels great in hand.Cons:-Dreadfully short battery life; be sure to stock up on plenty of generic extras.-I was sold a defective copy.  As a collector of cameras I have never had the misfortune of receiving a defective model and I certainly did not expect my first Fuji camera (especially an X series model at a premium price) to come to me brand new with so many major issues.  The following is a list of problems I encountered with this camera in order:1.) The electronic viewfinder is hazy and dark and the icons and text are dim and hard to read in all lighting conditions. (yes the glass is clean, yes the diopters are properly adjusted, yes the power saving mode is set to hi performance). I checked my X20 against a friends copy.2.) The face detection mode does not work at all, even though I always shoot in AF-S.3.) When attempting to record video, the camera will stop after about 20 seconds and then a \"write error\" message will come up on the screen. Unfortunately for me, this particular malfunction burned me bad when I was petitioned to record a family function with a busted camera.  Almost as unfortunate as receiving a busted camera is having to navigate Fuji's customer service/support system. I first wrote a concise thoughtful email to Fuji support only to receive an automated response with a 1 800 number to call. I called the number and after about 2 minutes one the phone with the support technician I was referred to another support website. The website gave me a form to print out with a tiny space to record the problems I had been experiencing.  Now I get to take additional time out of my day to carefully pack and then ship my X20 (at my own expense mind you) and then wait so that it can be repaired (Fuji does not allow replacement of their \"pro\" line of cameras). Shame on Fuji. This will be the last Fuji camera I buy.", "Date": "November 2, 2013"}, {"Title": "A solid, well-built, little camera... but with some limitations", "Author": "ZL", "ReviewID": "RBMUA0S21CXN8", "Overall": "3.0", "Content": "The following review is based on a few hours of shooting indoors and outdoors, with and without flash, shooting people, landscapes, and still life.  I only shot JPEG's, since that is what I planned to use the camera for.PROS* The camera exudes style and quality* Solid, extremely well-built body, with a good feel to most buttons* Lens zooming is very smooth, with very little wobble at full extension (also, the sticky point midway between OFF and 28mm appears to be gone - this was present on the X10 that I had)* Very fast operation (focusing, shutter release, flash pictures, flash recycle, etc.)* Very good focus accuracy - maybe only 5% of my shots had missed focus* Incredibly sharp lens at all focal lengths and apertures (sharper than my Nikon 16-85mm, and Panasonic 14-45mm Lenses), with no de-centering* Excellent ISO 100 JPEG's with very good detail (Note: I did not test RAW images)* Menu system is easy to navigate* Q button is very handy* Viewfinder now fits tightly with the body (it was slightly loose on many X10's), and is definitely usableCONS* Camera is just a bit too small for my medium-sized hands, making the handling just a bit uncomfortable* Both dials are fiddly to use, and operate slowly/not at a 1:1 ratio when changing values (for example, when in Av Mode and you want to change the aperture quickly, you can turn the dial 3 clicks quickly, but it might only register 1 click;  if you wanted to go from f2.0 to f/8.0, you have to sit there and just keep turning the dial... waiting to finally get there - it's the only thing that I found where the operation is annoyingly slow)* Battery/Memory Card hatch quality does not quite match the rest of the camera*  LCD screen is small, and slightly laggy in darker conditions (the LCD screen is one area where this camera significantly lags behind the competition)* The exposure compensation dial is too stiff, and difficult to turn (but I definitely prefer this over the dial being too loose)* Movies came out too dark (but I admit that I didn't spend a lot of time dialing this in)* Continuous focus didn't work AT ALL (it may have been broken on my sample???)* JPEG quality is ok at ISO 200, fair at ISO 400, and marginal at ISO 800.  At ISO 1600 and above, there is just too much smearing going on.  (Noise reduction at -1 seemed to produce the best balance of holding detail while keeping the noise reduction (the source of smearing) at a minimum* There is minor JPEG artifacting in the corners at certain focal lengths, probably due to distortion correction* Very poor battery lifeUnfortunately, my camera came with a deep scratch in the metal below the front logo, and scratches on the rear LCD screen.  The serial number ended in XXX0002, so I'm not sure if it was used for internal testing or not - the box did not appear to be opened???  This is the main reason, why I sent it back.  However, I may have sent it back based on the poor quality at ISO 1600.  (This is a requirement for my type of use.)  It would be a superb camera for someone who can live with shooting at ISO 100 to ISO 400.  It really is a very nice camera if you can live with its limitations.", "Date": "March 29, 2013"}, {"Title": "Great all purpose camera", "Author": "SSSS \"sssss\"", "ReviewID": "R15DKP90FH35ZS", "Overall": "5.0", "Content": "I just got this Camera. Easy to use, great all around performance. Incredibly fast auto-focus. Great sharpness. Beautiful too look at.", "Date": "April 26, 2013"}, {"Title": "it's not a bad camera... but for the price it's a bit stuck in the middle.... here's why", "Author": "Dan", "ReviewID": "R36XTZRYQSB0RH", "Overall": "3.0", "Content": "The Fuji x20 is a good camera... works well... has a good layout of buttons and feels good in the hand.My only problem with the camera was the quality at higher than 800 ISO.  To be fair I'm a DSLR user and have a D7000 along with a D800E so I know this camera is not going to give me the same quality. BUT I expected something decent for the price of this camera.I felt this camera took pictures comparable to my old $200 canon point and shoot.... OBVIOUSLY this camera has more control (Aperture mode, Manual mode, Shutter... etc etc) that a point and shoot doesn't have... but the quality of the pictures to me was lacking ... for the price.....I checked into the sensor size and this camera has one of the smallest sensors compared to the others in the same price range... I saw the sony Rx100 had a much bigger sensor for around the same price... there are also a few others like that.Like I said... in general the quality is good... but I decided to return the item because the price was just too high.Also my copy had an issue with reading the memory card.... I could take pictures and review... but if I turned off the camera and turned it back on it would not let me see the pictures anymore... said read error.That was the icing on the cake and caused me to return it after only a few days.I'm probably going to go for something like the x100s or a used/old x100 for little more cash.", "Date": "May 17, 2013"}, {"Title": "Exceptionally good looking - great photos - questioning the high price", "Author": "ScOObydoo", "ReviewID": "R2R5LCWA4RDDAN", "Overall": "5.0", "Content": "Lets open with an admission - I am not a professional photographer in any way. My camera never leaves \"auto\" mode, but I'm a big fan of good looking cameras. I've owned most of the PEN series from Olympus.I tried the previous version of the X20, but was not a fan - since I rely heavily on automatic settings, its auto-focus was a real let-down.Thankfully, that one issue appears to be fixed in the X20 (The X10). Auto-Focus is much better, and indoor performance also appears to have improved. That said, the final result (regular JPEG with no post-processing) do not \"pop\" like the photos from some of my other cameras.The X20 does look stunning - and in some cases, people thought I was working with old fashioned film. Sadly, the price is not in line with what you get, and good looks don't make up for the price.A Sony R100 is in the same price range, and you can even get something like a Lumix GX1 with Power Zoom for less. In fact, there are so many other good cameras in this price (or for less) that perform better. The camera also lacks features like remote and mic input.The viewfinder is a great bonus - as is the hotshoe, but if you are looking for a camera purely as an amateur, most of those won't be of much value.I wish I could recommend this to anyone looking for a camera in the upper $600 price range, but there are just too many alternatives that are so much better. Consider the Sony R100, or even a NEX.", "Date": "April 13, 2013"}, {"Title": "Good looking but????", "Author": "jtjam", "ReviewID": "RC08CDR617R81", "Overall": "3.0", "Content": "I waited for the Fuji X20 for a couple of weeks.  When it finally came I was excited to open it up and start using this beautiful electronic device.  I was very happy with the way it looked and handled although the lens did pop out a lot more than I would have liked.  The controls are placed nicely, it starts up lightning fast and looks nice, I guess I said that already.  Auto focus is fast fast in the right light.  Challenge it a bit with less than favorable lighting conditions and it will struggle some.  Image quality is good but definitely not good enough for me to fork out the kind of money Fuji is asking.  The X20 is a good camera but seemed to me like a big boy looking camera with nice controls that doesn't deliver in IQ.  The viewfinder was ok.  It really sucked if you added a filter adapter and hood as it blocked the bottom 25% of your view that made the VF useless.  It would be a great camera at the $300.00 price point.  I am convinced that I could find a much cheaper point and shoot the delivers better than the X20 unfortunately.  Sorry Fuji I really wanted to like this camera but it's not in the $600.00 club.  I purchased the Sony rx100 and love it.  This is after trying the Fuji x-e1, the Lumix G5 and the X20.  All different animals I know but the Sony beats them because how balanced it is.  Great IQ, features, controls (menu but still good), size, build quality, art filters and video.", "Date": "April 5, 2013"}, {"Title": "Fiji x20", "Author": "Jjbphoto", "ReviewID": "R18IFXM5EW6W5W", "Overall": "3.0", "Content": "The start up time for the camera was very slow when it was in standby. Missed many of shots because of this. Also the auto focus didn't perform very well either, it seemed it couldn't decide what to focus on. The image quality was pretty solid though. If you are looking to use this for a basic point and shoot, it should be good.", "Date": "June 25, 2013"}, {"Title": "Nice camera....but", "Author": "Teddy W. Raper", "ReviewID": "R1LXC3RMZDIK32", "Overall": "4.0", "Content": "The Fuji x20 is a nice camera; very well built and takes very good pictures.  The autofocus is quick, yes, but it does need contrast in order to lock on, so I would not exactly call it state of the art.  The 2.0/2.8 lens is nice; the build quality is top notch.  The optical viewfinder is the best non-EVF I have used.The claims being made about its image quality being superior to other similar cameras are off the mark, though.  I compared a 13 x 19 print from the Fuji to one the same size taken by a Nikon P7700, and there is no difference - in fact, the Nikon may be a little cleaner (sharper).  The Nikon also has a bigger zoom range, and an articulating LCD, plus it's a good bit cheaper.I got the Fuji because I already use a Fuji X-E1 and wanted a similar small sensor camera.  If I were using a different system, though, I'd probably go with the Nikon.", "Date": "March 24, 2013"}, {"Title": "Has a wide learning curve.", "Author": "Lulu Magoo", "ReviewID": "R1IK7FIBGM7V1B", "Overall": "3.0", "Content": "**Updated 06/23/13** I finally managed to tweak a few settings to improve the image quality - mostly with regards to focus. (Because I was struggling to get anything in focus that I was (auto)focusing on.) Primarily using A mode (Aperture Priority) I set the Dynamic Range on 100 and also set \"Shooting\" under stabilization as I'd read that by adding the \"Plus motion\" it messes up the exposure by automatically setting a high shutter speed. (Though in my case it seemed to be driving up the ISO (if on Auto) was leaving me with flat, grainy images.)Built like a 1950's rangefinder, the X20 has a ton of retro hipster options like an optical viewfinder with a cool LED display, (though not very handy if you are shooting anything except for 4:3) a hot shoe, manual zoom, and the ability to accept a shutter release cable. The lens is threaded to accept a 52mm filter - not a bad idea to protect that glass with a UV filter or maybe explore a vintage Cokin filter system? Note that the lens cap could probably benefit from one of those old-school elastic cap-keepers.I'd initially taken several hundred images with this camera under a variety of lighting conditions using shooting modes both automatic and semi-automatic and couldn't seem to take a single \"wow\" image until I changed the Dynamic Range to 100 and set \"Shooting\" under stabilization.I'm still not in love with any of the color \"film\" options but I do like the straight B&W; mode.As solid as this camera feels, (so good in the hand!) with it's nifty array of vintage options, it does have somewhat steep learning curve for it to produce amazing images. I don't dislike the X20, just need to be sure I put on my thinking cap prior to using it. As smart as these camera keep getting, it seems like there is still a lot of room for error when there are so many combinations of settings to chose from.", "Date": "May 13, 2013"}, {"Title": "Great Comact Camera!", "Author": "jfhnhh \"jfhnhh\"", "ReviewID": "RTICCX9GMOE9I", "Overall": "5.0", "Content": "I owned a Fuji X-10 for about a year and had great looking pictures even though I predominantly use the EXP or automatic setting.  This is an update version of the x-10 with improved performance and more features.  I just had to upgrade!", "Date": "June 14, 2013"}, {"Title": "2nd Review", "Author": "Ogr8ys1", "ReviewID": "R36HLK9T89BTR9", "Overall": "3.0", "Content": "I expect the \"gear heads\" will hate this review as much as the first one.First off this is a very nice camera.  The pictures I took (as well as a video or two) are crisp and clear and the software that comes along with the camera is unusually useful.It was pointed out to me by another reviewer that the reason the lens can only 4x is for the speed of the shutter and for the money that you spend on this camera should in my opinion shoot much faster.  The average photographer I am sure would rather have a lens that will take pictures across a soccer field instead of across a living room for the details of the subject.This camera is also not for a beginner and for 600 bucks comes with many features that an amateur would have no use of and you can get a camera for half the price to take satisfactory pictures.  In the comments I need someone, (I know you are already lining up) to tell me what this camera provides that a Cannon 200 dollar camera does not.This is priced for the semi-pro and truthfully either go pro or go low for this mid level entry does not offer what the pro wants and offers too much for what the amateur needs.", "Date": "March 27, 2013"}, {"Title": "Got it... returned it", "Author": "J. Fried \"Book Monster\"", "ReviewID": "RVR19LJIKU0ZD", "Overall": "3.0", "Content": "I was longing for it. Ordered it. Received it. Worked with it. Returned it. I use a D7000, Cannon S95/100, and other small digitals. My feedback is in no particular order. Had excellent build quality, sharp lens, good feel... The focus in various modes was a \"pain\", seemingly not getting it in focus when not zoomed out, macro very cool,  the menu system was deep and somewhat easy to navigate, and I found myself using various \"film\" modes (that I can replicate via editing) I ordered a Skylight filter, did not fit. The on and off lens cap a pain and the need to order an adaptor no thanks... or a tether nah... the leather case looked very cool, but again, i have gotten lazy and do not \"case\" my Nikon so this case while very retro cool, became annoying fast.  My way of shooting now that I do not do it for a living is shoot with one of my cameras and upload the photos I like to my iPhone and edit there. I print from time to time, but much of my output goes on instagram and to family as visual journals via email. So this camera did not provide me with what was needed, a camera beyond the S100 and not my D7000. Oh well... on to the next", "Date": "April 4, 2013"}, {"Title": "I don't get who this camera is for.", "Author": "The Noise", "ReviewID": "RKEE6FPBJKYRD", "Overall": "3.0", "Content": "There is so many mirrorless(non SLR) cameras on the market currently. And I can't decide where this product fits in. The price is what's puzzling me.Why would Fuji choose to use a small sensor 2/3\" in the camera which is almost as big as an OM-D. X20's sensor is significantly smaller than 1\" Sony rx100 sensor smaller pocketable camera in the same price range. And it's fourth of the size of a micro four thirds sensor, which is available in a large selection of m4/3 cameras, the cameras of the similar size that can be obtained for less than this camera costs, which offer far greater image quality and interchangeable lens flexibility.I have to say I love the design of the camera, and I think the UI and controls are great. If only it had a bigger sensor or a collapsible lens which could make the camera somewhat pocketable. As such I feel that this camera is overpriced compared to its competition.To give an example Panasonnic Lumix LX-7 features a similar sized sensor. A more versatile and category leading lens f/1.4 at the wide angle. Smaller size, pocketable in fact and all this for $200-300 less. Is 85% OVF worth that much extra? You decide.", "Date": "April 7, 2013"}, {"Title": "Not the improvement it should have been", "Author": "depscribe", "ReviewID": "R10XAHJLHVE2T8", "Overall": "2.0", "Content": "Fuji took what was a competent low-end professional camera and magically transformed it into a high-end toy camera. The image quality is not as good -- even at 12mp jpeg -- as that of the X10. The viewfinder enhancements do not really aid in picture taking in my estimation. If the new sensor adds anything to the program, it's well hidden. It *is* faster focusing, I'll give it that. But such things as viewing the just-taken picture in the LCD are gone, replaced by the eye sensor thing, the latest in 1950s grocery store door technology brought to cameras today by Fuji, which is an annoyance but a fatal one in a camera already beset by abysmal battery life. There is no focus area indication in the viewfinder prior to pressing the shutter, and the \"parallax\" correction is so draconian that to be accurate the optical viewfinder and the lens would have to be pointed in different directions. It's just awful.The camera also typically underexposes pictures.Typically Fuji releases cameras well before the firmware is soup. It's my hope that they announce a firmware upgrade very soon, before the return window closes. In the meantime, I'm glad I kept my X10.", "Date": "March 27, 2013"}, {"Title": "An expensive X10 with live viewfinder?", "Author": "George Sherwin", "ReviewID": "R305Q02873F0U9", "Overall": "3.0", "Content": "Okay, I'm one of those annoying reviewers who doesn't actually own an X20.  And, honestly I haven't seen one in the flesh.  I DO however, own, and use extensively an X10, which, comparing the pictures, seems to be virtually identical to the X20 with the exception of the live viewfinder which is not an X10 feature.I just recently upgraded my 18 month-old review of the X10 which I am duplicating here, since I do believe my experiences will apply to this camera as well.  I downgraded my initial rating for the X10 from 5-star to 4-star, and the 4 star rating I felt only applied due to the drop in price from $599 to $386 (X10), but now Fuji trots out what seems to be the same camera from 2 years ago, tarted up a bit with a live viewfinder, for a $200 premium?  In my mind, that sort of pricing is only good for a 3-star rating.Below is a copy of my recent added review for my X10, based on my 18 month experience with the camera.  Most all my comments apply to the X20 as well.A 'scientific' review by a guy who takes 3 different images with 3 different cameras is always helpful, but sometimes you have to actually work with a camera for awhile before the 'features' and eccentricities either enchant you or annoy you.  In my case, I have to say that the more I've worked with this camera, the less enchanted I've become with its so-called features, and the more annoyed I've become with its distractions.I hope this helps a potential buyer make an informed decision:UPDATE - June 2013Well, I've had this X10 for some 18 months now, and used it a lot. I own and operate a classic car limousine service, catering mostly to weddings, and do a lot of night photography in conjunction with this. Looking back, my rational for purchasing this camera in the first place was:1) Have a pocketable camera as an alternative to my bulky Nikon D70002) A fast lens for low light photography3) A Wide angle aperture for those beautiful limited depth-of-field bokeh shots.Over the past few months, I find that I am picking up the D7000 for my nighttime engagements, and that the X10 is gathering dust in the closet, and, honestly, I have to say that I'm a bit disillusioned by the camera at this point. Here are the reasons, corresponding to my original purchase checklist above:1) This is by no means a pocket camera. It just ain't gonna happen. This is a hang-round-your-neck camera, just like a full sized DSLR2) Fast lens.. well, yes, f2.0 does sound impressive, but, let's face it... it just isn't good enough for any sort of night photography without flash (and that little pop-up flash is only useful if you're shooting right in someone's face). Sure, you can get an image at night, but it is going to be grainy and you'll never be able to call it a professional image. The difference in quality between a f2.8 lens on my D7000 and this f2.0 is really glaring. I know, it's NOT a DSLR, but still, what's the point of paying near-entry-DSLR prices if you can't get better images?3) Limited depth of field.. this has been one of my biggest disappointments in this lens. An f2.0 lens on a small-sensor camera is NOT equivalent to the same focal length on a DX or FX format camera. Only when shooting extremes (like focusing on a subject no more than 2 feet away) will you get any semblance of focus fade in the background. Sure, you can dial up the in-camera D-O-F software, but why would you want to permanently gork up your photo when you can accomplish the same yet better soft-focus effects in Photoshop or Lightroom and have complete control.Other issues that I have increasingly become annoyed with after extensive usage:* The manual focus mechanism is absolutely useless.. to get from one end of the distance scale to the other requires some 8-10 full revolutions of that hard-to-manipulate focus wheel. Why couldn't they have at least added an acceleration mode to the wheel (turn it faster, move the dial faster). To make matters worse, the focus selector lever (AF or Manual) on the front in right in the position where virtually EVERY TIME you remove the camera from its case (which you HAVE to do to see the viewfinder or back screen) the lever gets moved from AF to Manual. Can't tell you how many ruined images I've deleted because the $!%@@& focusing got switch to manual without my noticing... grrr* Lack of standard filter threads... This is one of the most idiotic and non-customer-friendly features of this camera. The threads on the lens won't match any standard filter, so if you want any sort of filter, even a UV to protect the non-replaceable lens, you have to shell out a hunk to Fuji for their adapter ring... Then.. the filter housing obstructs the view in the viewfinder; you can't use that nice aluminum lens cap; AND, now the camera won't fit in that expensive leather Fuji case you bought. Really?? Was this camera designed by photographers, or just a bunch of engineer/marketing geeks?* Auto White Balance... The auto white balance on this for night time shots is just unusable. On virtually every shot I have to make major adjustments to the white balance. I shoot almost exclusively in RAW mode, so pictures are salvageable, but it is an annoying additional step, when I almost never have to adjust the white balance on similar shots with my D7000* Battery life is pretty short... I don't understand why they couldn't have found room for a larger battery in such a large bodyIn summary, 1.5 years down the road, the X10 (and now its successor the X20) is starting to look a bit long in the tooth. For your money you're getting:1) A cool retro-look camera that feels and is solidly built2) Camera RAW ability3) A reasonably fast lensFor my money, if I were buying a camera to fit this niche today, I'd opt for the new Fuji XF-1... it's a true pocket camera but appears to have roughly the same guts as the X10, probably improved, with a slightly faster lens, and it looks great!", "Date": "June 23, 2013"}], "ProductInfo": {"Price": "$499.95", "Features": "2/3-inch X-Trans CMOS II image sensor with primary color filter\nFujinon f/2.0-2.8 4x optical zoom lens\n2.8-inch advanced optical viewfinder\nIntelligent hybrid AF - TTL contrast AF / TTL phase detection AF\n1920 x 1080 movie recording", "Name": "Fujifilm X20 12 MP Digital Camera with 2.8-Inch LCD (Silver)", "ImgURL": "http://ecx.images-amazon.com/images/I/517hr8pli5L._SX300_.jpg", "ProductID": "B00AV3XH9W"}}