{"Reviews": [{"Title": "Pretty good camera", "Author": "NCarmody", "ReviewID": "RYRZ7QJL01LO", "Overall": "5.0", "Content": "To be honest when I first got this camera I was ready to ship it back.  I was looking for a camera with some manual options that was not as expensive as a dslr.  It took me about two and a half hours to figure out why I could not get one decent picture.  One thing I found out is that this cameras menu is a little more complex than some of the others I have.  Also I realized that although you use AUTO, there are auto defaults that can be changed.  In my case some needed to be changed out of the box.  I had to change the anti-blur option, remove the toy effect from being the default (I don't know why it would be), and change sharpness.  Once that stuff was done I got some decent photos.  Some can be viewed in the customer images section of this product page.  Again I have only had the camera for 2 days and I am still learning the available options of this camera.  I may increase or decrease the rating of this review once I use it a little more.  Overall I am happy with this camera.  And for those who are curious, this product is made in China.Update 4/20/13I have had this camera now for a few days.  I have taken about 400+ photos.  I own a variety of different cameras; but his is my first Fuji. I have taken inside, outside, low light, bright light, fast moving subjects, macro, landscapes, etc. and the pictures are beautiful.  As I get use to this cameras menu and learn the options I am taking much better photos with it.  The pictures even at the furthest end of the zoom are excellent!  I would highly recommend this camera.  The manual zoom, optional manual focus, and creative options makes this camera a lot of fun to use.", "Date": "April 18, 2013"}, {"Title": "Great Camera", "Author": "len610", "ReviewID": "R3G0F70YM9AENF", "Overall": "5.0", "Content": "Being a corporate photographer for 20 years, I am pretty familiar with cameras and their operation.  I had a fairly expensive Nikon digital camera that took a dump on me.  I wanted all the features of a professional camera without the high cost and the high cost of having several lenses to meet my needs.  Searching on the net what was available, I came across Fujifilm camera.  I purchased a lesser expensive Fuji camera and liked it so well, I wanted to upgrade to a better Fujifilm camera.  The HS35 seemed to be about the best deal for the bucks.  And now that I have it, I cannot tell you how much I love it.  It has all the features and more of my former Nikon.  It actually takes better pictures because it is a higher megapixel camera than my former Nikon.  And best of all, I don't have to lug several lenses around with me.  The built in lens is pretty much flexible enough for all my shooting needs from wide angle to extreme zoom.  It IS actually a very professional camera.  Great photos and easy to use with the flexibility of full manual over ride if necessary.  I especially like the manual zoom over a powered zoom.  The lens has accommodations for filters and lens hoods like any professional lens in addition to a hot shoe for flash accessories.  What more can you ask for?  Another added feature is the electronic viewfinder.  In my opinion the prism through the lens viewfinder is obsolete.  So an electronics one serves the purpose of composing photos in bright light very well.  And it is automatic as it comes on when you look through it.  With the EXR feature it is literally impossible to take a bad photo.  This camera has a very nice \"feel\" to it as you hold and use it.  I guarantee you will not be unhappy with the camera or the results.  About the only thing it lacks is video quality.  Even though it shoots in high definition, the video quality is OK, not great.  However, I am totally OK with that because I did not purchase this camera for shooting video.  I have a high def camcorder for that.  So any video you shoot with this camera is an added plus just in case you don't have your camcorder with you. For the average person, the video quality is more than adequate.  But if you are into shooting high quality video, you will still want to use a better quality video only camcorder.  All in all I'm totally thrilled with my Fujifilm camera and I'm also very happy to be a part of the Fujifilm camera family.  You don't have to drop thousands of dollars on expensive camera equipment to get great results.", "Date": "January 2, 2014"}, {"Title": "Works Well for Auto Racing", "Author": "Malcolm \"motorsports\"", "ReviewID": "R2K6YLPCQLSXUQ", "Overall": "5.0", "Content": "I was going to the stock car races and was looking for a good camera without going into the DSLR stratosphere. After reading the specs and reviews I settled on the Fujifilm FinePix HS35EXR 16 MP Digital Camera with 3-Inch LCD (Black). To go along with it I bought the Case Logic SLRC-200 SLR Camera Holster (Black), 2 Pack Of NP-W126 Batteries for Fujifilm FinePix X-PRO1 X-PRO 1 X-E1 HS30EXR HS33EXR HS50EXR Digital Camera Includes NPW126 Battery + LCD Screen Protectors + Cleaning Cloth, and SanDisk Extreme 16 GB SDHC Class 10 UHS-1 Flash Memory Card 45MB/s SDSDX-016G-AFFP. The camera comes with one battery and I had a 4GB SDLC card so I figure I'm covered for any long racing weekend.As with any camera, I got it almost a week in advance so I could get a few hundred shots under my belt before they counted. This included a couple sessions by the freeway to practice panning and photographing moving vehicles. My first session seemed fuzzy and I realized I'd been shooting with the wrong scene setting. The HS35EXR is complex enough that getting the setting right is important.Shutter action is good, but not SLR good. Continuous and multi-shot modes can make up for some of that, but I didn't do any at the raceway. Focus at full zoom is better than I expected, with some shots nice-and-crisp and most with only minor issues. I was able to capture great action shots in the corners.The first battery lasted for 421 shots. Out of the 483 pictures, 361 made the first round cut, where I eliminate the nose, tail and blank road pictures. Having 75% pass the first round is great!The camera says the 16GB SD card holds over 2400 images at the highest detail. Everything I take is at the highest resolution and the 361 images have an average size on disk of 5.66MB. The new SD card is notably faster than my old 4GB card.The Case Logic SLRC-200 SLR Camera Holster (Black) is a little large for the camera, but it protects it well, is light and easy to carry. I like it.The batteries are working as expected so far...I am pleased with my purchase.", "Date": "June 24, 2013"}, {"Title": "Great camera for the price", "Author": "David Kopczyk", "ReviewID": "R15PB0R7P9H3KP", "Overall": "5.0", "Content": "Before I purchased this camera, I had used one of my school's Canon Rebel DSLRs and wanted to get one of my own.  However, every DSLR out there was out of my price range.  After comparing some other cameras, I stumbled upon the HS35EXR, which seemed like a fairly good deal.PROS:-Manual Zoom-Adjustable ISO, f-stop, exposure time-Quick autofocus-Shoots in RAW, RAW+JPEG-Shoots 30fps 1080p videoCONS:-Autofocus can act up when recording a video and your subject is moving-No external microphone port (only a problem if you plan on using this for video)-Flash casts a shadow (more on this later)-Pictures appear to be overexposed/too bright by defaultAs soon as I received my camera in the mail, I started it up, went through the date/time setup and started taking pictures. Right away I noticed the pictures that I had taken were very low quality and I thought I had been swindled, but this was not the case. I was shooting on the default EXR setting, which is pretty much automatic everything, and it didn't do a very good job indoors.  Over the next few hours, I took between 300-400 pictures playing with the different settings and software filters on the camera.  Eventually, I realized that it's a lot easier to shoot on manual if you have some time to get all of your settings (iso, fstop, exposure time) set for your environment.  One issue I had was that the built-in flash causes a shadow to be cast from the lens - but this is solved by using an external flash or stepping back from the subject.The only other quirk about this camera is that most photos seem to come out brighter than they appear on the viewscreen, but if you can anticipate that problem, it's easy to circumvent.  I found this out when I was attempting to photograph the moon a few days ago and it looked okay on the viewscreen, but as soon as the picture was taken, it was overexposed.  Eventually I was able to find the right settings - it just takes a while to get to know the camera.Video shot on the camera appears to be ok quality - not exactly professional work.", "Date": "September 24, 2013"}, {"Title": "Rough Zoom", "Author": "pen name: pen", "ReviewID": "R1A1NUE4FZPZGG", "Overall": "2.0", "Content": "I wish this camera had worked out as I really like Fujifilm products.  However, two factors figured in my decision to return the camera: 1) foremost, the zoom is very rough. It is impossible to keep the camera aimed at the subject as one rotates the zoom ring; very \"notchy\".  2) The camera is just to small to work comfortably as a manual zoom.  If only Fujifilm had increased the angle between the lens and the handgrip.  As it is, the near right-angle between the zoom and grip would not accommodate my fingers.  Just too small.", "Date": "May 3, 2013"}, {"Title": "This camera does everything", "Author": "B. Lindsey \"your friend\"", "ReviewID": "R2NP0BQ2E8ZL1S", "Overall": "5.0", "Content": "I am not a camera savvy person, but I have had several in my lifetime. This one does everything! Someone wrote in their review that the zoom is rough and \"notchy\". I would not say that at all, mine is very smooth. The pictures turn out beautifully. I like it for many reasons, but one is that it can be fully automatic, or it will allow you to take pictures manually and make any adjustment you want. This camera seems to me to be great for beginners or advanced users because of that. Love the built in filters. The programming makes it fun to take pictures.The only thing I would change on this is the size of the grip. I have large hands, and when I wrap my fingers around it, they don't fit, so I have to hold it more with my fingers than with my palm. My fingers are just a little too long and it feels awkward. They must have used tiny people to design this.", "Date": "November 1, 2013"}, {"Title": "great", "Author": "alfonso", "ReviewID": "R3H5J8H7EHVKFU", "Overall": "5.0", "Content": "great valuegood performancegreat battery lifewith a lot of features as color modes filters, high speed recording etc.check the site.", "Date": "September 14, 2013"}, {"Title": "Wonderful camera at a ridiculous price", "Author": "Steve Francesco", "ReviewID": "RLIA5N7KBS5HN", "Overall": "5.0", "Content": "I bought this as an upgrade to my aging Fuji s6500 which is getting rather old at this point however still going strong after 7 years of festivals, nightclubs, sailing trips etc ...where it will be used as my \"go-to\" knockabout, where I need decent enough high ISO low-light performance, but would be throwing it into every situation where a DSLR could potentially get destroyed (or stolen) and need a long optical Zoom in a light body. After checking multiple reviews on the HS30 was about to pull the plug until I saw this bargain for the newer HS35 and snapped it up.The Auto EXR modes are fantastic for point and shoot, much better than the regular \"auto\" modes, Although you lose half the pixels the tradeoff of getting a useable shot is well worth it.The Zoom, oh the Zoom! will absolutely have you in awe, and the speed that the camera captures at is really phenomenal and kind of took me back a little having used some other bridge style cameras recently that really took their time to take photos.Admittedly its not a DSLR, however it doesn't really try to be. Its the kind of camera you should always have with you when you simply can't bring a huge lens or need something reasonably low profile and need to get close to the action FAST e.g. festivals, concerts, weddings, birthday parties etc... Even if you are a pro photographer this would be an ideal backup high zoom \"walkaround\" camera where you can discreetly take snaps of the un-aware from the other side of the event.The manual zoom is SOOO much better than motorized and one of the reasons I chose the Fuji over many other brands having got used to it with my old s6500 there really is no substitute.Focus is snappy and fast in all but the worst lighting conditions, and even then it is no slouch.The Movie mode is a fantastic upgrade for me (from 640 x 480!), slow motion function is not only fun but can actual be useful in situations where you want to learn about something e.g. sporting posture, however useless for anything else really due to the resolution. The Screen and EVF is simply gorgeous and responsive (however EVF refresh suffers in very low light).What surprised me more than anything was the lack of flash shadows and the fact that virtually every photo (in EXR) was almost processed to perfection right out of the camera with zero red-eye and no blown out faces. if you dive deeper into the advanced photo modes you can get some really cool images by e.g. a portrait in \"toy\" mode.Battery life is simply brilliant.The only really bad minus point I could make is that the manual \"fly by wire\" focus is still not nearly as fast as a real lens and it can be difficult to focus on objects unless you are reasonably stationary and in bright light. It has a tendency to overshoot the focus point unless you are extremely gentle with the ring, however the fast auto focus makes up for this an in 99.99% of situations will focus in less time than you could adjust a ring anyhow.Conclusion: For the current price of sub $300 its a no-brainer bargain. However, if the price goes up I think a better purchase would be be the hs35's \"big brother\" Fuji X-S1 which can be picked up refurbished for similar money and has a more professional edge, bigger sensor etc ...", "Date": "April 9, 2014"}, {"Title": "Overpass my expectations", "Author": "dromeroq", "ReviewID": "R3LPBIYZX4RTG9", "Overall": "5.0", "Content": "This camera is one of the best purchases I've made​​, it's just what I was looking for. It has a variety of configurable options, iso, fstop, exposure time, to name a few. But at the same time the preconfigured settings do not disappoint at all. The quality of the photos is very very good, color photographs of exteriors are crisp, vivid and rich.The fact that the focus and zoom are manual gives you that feeling of being using a professional camera.I recommend this camera for anyone who wants to start in the world of photography and does not want or can not do a major expense with a DSLR camera.I hope you enjoy a lot with this camera as I did.", "Date": "October 8, 2013"}, {"Title": "Great camera for the money.", "Author": "Stickinrock", "ReviewID": "R31II8B8L45RQM", "Overall": "4.0", "Content": "We bought this for our teenage son Who is really getting into photography. He has learned to use the camera really quickly and has taken some very nice pictures in the short time he has had it.Pros: great camera for the money.Cons: focus is a little clunky at times. You have to learn the settings for the type if shot your taking when indoors because the auto settings are not the best.", "Date": "June 1, 2014"}, {"Title": "Super", "Author": "graphic designer", "ReviewID": "R6UZ0T8SXIFE8", "Overall": "5.0", "Content": "If you can't run with the big DSLR dogs this is the porch to stay under. Features galore, easy and intuitive operation, clean sensor, great color and saturation right from the camera. This camera allows you to pay more attention to composition and less attention to operation. One weakness all bridge cameras seem to share is the manual focus. This one is pretty good, but it will never equal the focus on a SLR.", "Date": "May 29, 2014"}, {"Title": "Good indoor photos of my infant.", "Author": "jpm \"Jay Chand\"", "ReviewID": "R8B4A7NNF2B5Z", "Overall": "5.0", "Content": "Disclaimer: I am not a camera expert. Had many point and shoot cameras ( less than $200 price range) before, none of them took good in-door photos. I bought this camera, and it has an indoor setting, and voila I get awesome pictures of my newborn taken indoor. The in-door setting takes 4 pictures and stitches them together/processes them and gives a great indoor photo. Highly recommended if you want to take awesome picture of newborn babies taken indoor without flash or bright light.", "Date": "May 5, 2014"}, {"Title": "Good for the price you are paying", "Author": "Naeem Ahmed", "ReviewID": "RHIQ9BQXG88BJ", "Overall": "4.0", "Content": "Its a good camera for a beginner like me. The day shots are just awesome however,  I am having some challenges in shots at night. Overall good deal.", "Date": "April 30, 2014"}, {"Title": "Great camara for amateur photographers", "Author": "Ariette Acevedo", "ReviewID": "R36U6MTYSJVCSF", "Overall": "5.0", "Content": "I just recieved the camara and I am in love with it. I have never had any experience what so ever taking photographs apart from using a cellphone camara, and this camara makes it so easy to have beautiful photographs with little experience. Very easy to use as long as you read the manual and use it accordingly. My only problem was that the AC connector for the rechargable battery comes with a European plug instead of an American one, no biggie will try to find a converter locally or just buy one from Amazon. One thing I really like about the camara is the professional feel of it, without the professiona price hitting my pocket.", "Date": "April 12, 2014"}, {"Title": "Great camera for the price", "Author": "Francisco Paolo Ferrara", "ReviewID": "R3PPS3UFJH8CM8", "Overall": "5.0", "Content": "great valuegood performancegreat battery lifewith a lot of features as color modes filters, high speed recording etc.check the site.", "Date": "April 6, 2014"}, {"Title": "excellent deal for the price", "Author": "Ayman", "ReviewID": "R1J22013DUBHI", "Overall": "5.0", "Content": "too many features and with simple tutorial i know how to take benefit from everythinggood for people how wants to start the world of photography like me", "Date": "April 5, 2014"}, {"Title": "A Great Ultrazoom for a Nice Price!!!!", "Author": "Anthony D. Parker", "ReviewID": "R1SUYY9B0FVO3", "Overall": "5.0", "Content": "Let me get this out of the way:  I really had my eyes on the HS50 EXR, initially.  Then, I saw that the HS35 had similar specs (minus 280mm on the zoom lens) and a lower price.  At $266, I knew that I had to have this camera.  I received it 2 days after I'd placed the order & made it a point to look it over.  After tweaking some of the settings and adjusting to the manual zoom, I'm looking forward to taking this camera out when the weather gets warmer.  I'm also the proud owner of a Fujifilm FinePix S4200 and a Nikon 3100 DSLR, and I still use these cameras to this day.  When I need something that's has the simplicity of the S4200 with some extra zoom added, the HS35 will be my \"go to\" camera.  I'm currently taking Digital Photography and am looking forward to Basic Photography & Creative Photography in the near future, so I have three options as far as cameras are concerned.  I'm glad this camera is capable of shooting in RAW and RAW+JPEG and just has tons of features that I can experiment with.  I had to buy an SLR-sized camera bag at a local OfficeMax since the one I ordered with this camera was much too small.  Long story short, I'm going to be using this camera more than the Nikon and probably almost as much as the S4200.  These three cameras will suit my photographic wants and needs just fine.The price I paid for this nice ultrazoom is unbeatable and I know I would've likely paid $400-$450 had I bought it retail.  I've been a Fujifilm fan since the film days and I was won over by the quality and value of their cameras when I purchased the S4200 (I chose the $179 FinePix S4200 over an equivalent $250 Nikon CoolPix model) last year.  Kudos to Amazon, Fujifilm,and the seller for offering a great camera at a great value!!!!", "Date": "February 7, 2014"}, {"Title": "Gift for friend.", "Author": "RPS51472", "ReviewID": "R1MF59Q8SCS4AP", "Overall": "5.0", "Content": "Nice smart camera. Bought it as a gift for a friend. She loved it a lot! Great features for the price.", "Date": "February 1, 2014"}, {"Title": "Easy to use & Good image quality", "Author": "Warren Wm Gollop", "ReviewID": "R1HIGROSUMZ7HP", "Overall": "5.0", "Content": "So far so good. I am purely a green box shooter who bought this to take some pictures for clients for web use.  I would have to say that the image quality has been great, even in low light.  Zoom is fantastic and relatively steady.  Will have to circle back to this one when I learn to really use the features.Love the horizon feature.  Makes shooting product so much more reliable", "Date": "November 26, 2013"}, {"Title": "Decent Camera for the price.", "Author": "Rick Rasor", "ReviewID": "R1LJC0R7P165QL", "Overall": "3.0", "Content": "The camera seems well built and functions well.  It offers a lot of nice features and is priced well.  Overall this is a decent camera unless you intend to shoot in low light at high ISO's.  Any setting much higher than ISO 100 produces a significant amount of noise in the image.  I like the 3\" LCD and the focus speed.  For a couple of hundred more bucks you can find much better cameras.", "Date": "December 10, 2013"}, {"Title": "Stay Away", "Author": "Brian S.", "ReviewID": "R31EDGH7H1YF7J", "Overall": "2.0", "Content": "I just received yesterday, very disappointed.  I owned a X-S1 which was brilliant except for the auto focus, this is nothing like it.This camera is just cheap, the focus adjustment via lens barrel is hard to turn and uneven. Picture quality is fair. Overall the camera just feels cheap, IMO not even worth the low price changed for it.There is a reason there is no reviews of this camera to be found anywhere online.", "Date": "May 9, 2014"}, {"Title": "Adequate for its price. but pic quality not as good", "Author": "daveC", "ReviewID": "R3IQ9X6TIG42D", "Overall": "3.0", "Content": "Bought this camera new here are my verdict. I am using this as a backup to my DSLR which I uses the CAnon 60d and 40d.Pros: Price, size, shoots RAW, good video, desent pic quality and Video. Cons: pic not up to even my Canon 40D but again it is not a DSLR. pic quality is not as good even when I shoot in RAW., focusing is slow, small buffer and transfer pic after a shot to card is slow. Again I was shooting RAW and not JPG . the LCD screen does not do full movement ... but a limited amount of position. Pic are a little overexpose when shoot in default. Flash does cast a shadow on the pic.I would say the it is adequate for its price and has good features. Pic quality is so so..... speed is not as great. other features like zoom and lens is good .", "Date": "December 3, 2013"}, {"Title": "Not the camera's fault", "Author": "Eileen L Rosfjord", "ReviewID": "R25IV7VRF4BF2H", "Overall": "1.0", "Content": "I just received my new camera - an item I had researched and anticipated enjoying. HOWEVER, I cannot comment on the camera, because I cannot use it. The camera was shipped with a European style cord for the battery charger. Can't plug in charger, can't charge battery, can't use camera. I've been on the phone with Fujifilm and once I fax them a Repair Form and my Amazon Invoice they will mail a new charger cord to me.Why did the box contain a European style cord? Only Amazon knows! What's the point of 2-day Amazon Prime shipping when I can't use the camera until Fujifilm mails me the correct cord?I've purchased many items from Amazon, and I have been satisfied with the quality and the delivery. But I do feel that Amazon let me down this time.NJ grandma", "Date": "February 24, 2014"}, {"Title": "wow", "Author": "rana", "ReviewID": "R1IYC8BUKFD34L", "Overall": "5.0", "Content": "Beyond what i expected how ever you have to have a sd card only hold 6 pictures on camera memory", "Date": "March 18, 2013"}, {"Title": "Excellent camera, no regrets. Difficult to focus, I tried  automatic setting and more of the same, P S A M confusing handling", "Author": "Daniel Armas-", "ReviewID": "R2AOLU5MMSJCNH", "Overall": "4.0", "Content": "May I be wrong, this camera is not on the intuitive side. Trying  to compose a shot its not easy unless you close your eyes and make a guess shot, not quick enough for any take, unless using sports mode. I will keep trying so in the near future have better knowledge and skills.", "Date": "May 25, 2013"}], "ProductInfo": {"Price": "$379.95", "Features": "3.0-inch TFT color LCD monitor and electronic viewfinder\n16 million effective pixels 1/2-inch EXR CMOS processor with primary color filter and CMOS shift type image stabilizer\nFujinon 30x optical zoom lens with approx. 2.0x digital zoom (up to approx. 60x with 30x optical zoom)\nFocal Length: f/4.2mm-126mm; Full Aperture: f/2.8 (Wide), f/5.6 (Telephoto)\nFull HD movie (1920x1080p/30fps) with stereo sound", "Name": "Fujifilm FinePix HS35EXR 16MP Digital Camera with 3-Inch LCD (Black)", "ImgURL": "http://ecx.images-amazon.com/images/I/51h5Uv2k03L._SY300_.jpg", "ProductID": "B00ATM1NBY"}}