{"Reviews": [{"Title": "Sony NEX-6 and KIT IS EXCELLENT", "Author": "J. Gordon \"JGordon\"", "ReviewID": "R19NHPBGLUWGQK", "Overall": "5.0", "Content": "The Sony NEX-6 camera and the new kit lens have exceeded my expectations.  It is the sharpest, fastest digital camera I have ever owned and I have owned many including Canon, Nikon, Panasonic, Fuji.  It took some reading and playing with it to fully appreciate it and get it functioning the way I want to use it.  There are enough options to assign functions to quick buttons so you don't have to go digging into the menu system to get the setup you want.  It's amazing the capability they have packed into such a small camera and lens combo.  The few negative comments I may have had are far outweighed by the results I am getting.  The electronic viewfinder is amazing and has me shooting like I did in my days with an SLR.  For a right handed person it is perfect. For a left handed person--learn to shoot right handed.  The accessories packaged with this kit are great, especially considering this kit is priced only slightly more than the camera and lens alone.  I especially like the wide angle and tele lens adapters. They are very useful and make me less compelled to go out and buy more lenses right away.  Spare battery, charger, filters, cleaners are very useful. A lens hood and flash would be nice additions. The included camera case was quickly relegated to an old camera and a new one acquired for my needs. I tried my Canon Speedlight on the hotshoe.  It does not function as an automatic flash synched with camera settings, but it does work fine in bounced mode.  Perhaps a dedicated Sony flash is needed to be fully automated. I don't know if the accessory shoe would solve this problem or not. I could not get a direct answer to my question on the Sony Support Site. I know they can't guarantee their answers. I was just asking for help with their best guess. The wifi setup is extremely tedious and frustrating. A touch screen is definitely needed but not available. Keying in your wifi settings and passwords by scrolling thru a tiny table on the LCD screen is awful. Especially when you have to keep entering the information again when it fails. It took me 3 days to get the wifi working. When I finally got to the Sony site to download the apps I got the message the site was down for maintenance. It took me another 24 hours to get the apps. I think Sony at least should allow you to perform these functions while connected to a PC by a cable so you can use the keyboard. I would call myself an advanced amateur (50 years in photography) and did a lot of research of available cameras before deciding on the NEX-6. It is expensive but with this camera you can start off with no experience using the iAuto modes and get outstanding results. For the pro, it has everything you can ask for without stepping up to the size and expense of a DSLR. No one will be disappointed with this camera choice. Amazon and it's vendor are great--I had the camera in two days.", "Date": "January 31, 2013"}, {"Title": "The camera is awesome, I wouldn't buy the kit though", "Author": "D. Jason Spruance \"Family Man\"", "ReviewID": "R3PC9V31U361FN", "Overall": "4.0", "Content": "This camera is amazing.  I don't know a lot about photography.  I'm an enthusiast at making videos and have been wanting to get a DSLR for video mostly.  After using a friends Nikon 1 V2 to make a short video for my daughters girl scout troop, I decided the mirror-less compact was the way to go.  After much research, I decided on the NEX-6.Now that I have the camera, I am turning into a photo guy as well.  I've used it now to take pictures and video at my kids Tae Kwon Do tournament and soccer games as well as some good portraits and macro shots.  Sports pictures are incredible in burst mode.  It has produced some amazing shots, even for an amateur like me. You can tune the thing to your liking very easily (if you spend some time learning the system) and it makes it easy to change your ISO/white balance/etc on the fly thanks to the programmable function buttons.  I highly recommend this camera for anyone wanting to go to a compact system.  The only two complaints I have so far about the camera are 1) the motor on the zoom of the lens is very loud.  When filming video and using the zoom, you can clearly hear it, even when you are rotating the ring and not using the power zoom.  And 2) the FOV on the heads up display is not acurate a lot of times.  I will have the lens all the way out at 50mm and it will tell me I am at 40mm.So the camera is what gets the 4-start rating.About this kit.  All in all, what you get with it is technically worth $50.  I would save the money though. I was in a time crunch with my kids events coming up and I figured I needed the case and spare battery and the other stuff was just a bonus.  First off, the 2x zoom lens and macro lens - the zoom lens doesn't do anything.  I am not an optics guy, but I know I have it attached correctly. If you have the lens all the way in at 16mm, you get a vignette look with a circle in the middle.  If you zoom to about 35mm, the matte goes away, but the frame looks identical as without the lens.  Same with all the way out to 50, no additional zoom, it just looks the same.  I have not tried the Macro lens, but I assume it is the same.  I'm assuming this is why these lens attachments are so cheap and professional photographers probably don't use them.  From what I saw on Amazon, it looks like you can get the same attachments for about $7-10 each if you want to try them later.The lens cleaner, screen protectors, and tripod came in a package together.  The lens cleaning solution leaked and I lost probably half of it.  It got all over the screen protectors and the paper wouldn't peel off.  And the rest of the kit is a few q-tips and a soft cloth that is more like a soft napkin. The tripod might come in handy, but I already had a Gorilla pod which is much more useful.The bag is way too big unless you have multiple lenses.  I just have the one lens so the huge bag is worthless to me.  I ended up stopping by BestBuy and getting the CaseLogic HighZoom camera case for about $20.  Its small but big enough to fit the camera and lens, cleaning cloth, spare battery and charger, and spare memory cards.You can get the battery and charger for about $20.  The battery though (as with a lot of knock off batteries) appears to last maybe half the amount of time as the Sony OEM battery.  So when it craps out, which my guess is won't be too long, I will probably replace with a Sony battery which is about $40.I know I can get this cheap of a 32GB memory card at my local Microcenter for $15 and I will not use the wallet.  And I'm not a real photographer, so I'm not even sure when I would use the filters.The seller of this kit delivered promptly and without issue. I have no problem with them. I left seller feedback to this part.  I did notice that the battery was dead when I got it (which anymore with electronics is strange) and when I took the first picture, it registered as number 365, which leads me to believe the camera had been used, at least on a limited bases.  Maybe they were QA testing it through one battery cycle.  I did not leave this in my feedback to the seller because I just now realized it but the camera did not come with the body cap or inside lens cap.  If you read the \"what's in the box\" on Sony's website, it states it should at least come with the body cap.  Another reason this leads me to believe it may be used.In summary, the camera is a definite buy.  The kit is a don't buy.  Although you technically get more than $50 worth of merchandise, you are going to have to spend additional to get what you want later.  And you end up with extras that you will probably never use.  You can get the camera straight from Sony through Amazon for $50 cheaper and then buy the spare battery, memory card, and bag of your choice at the same time.", "Date": "April 28, 2013"}, {"Title": "Good camera - very poor support from Sony", "Author": "Skywalker", "ReviewID": "R1HG7U3U0GAID2", "Overall": "2.0", "Content": "My daughter liked the camera - but it started having problems with less than 20 photos and a couple of days on it.  It seesm from Google searches that its a common problem.  Contacted Sony and was very surprised at how poor and how slow their service was.  The camera was bought to do a specific project and Sony didn't care.  Took days to get back to you; to just ask more questions, ask again for the same information (its as if you had to repeat the whole problem again because they didn't read their notes) and then a couple more days pass by.  Finally after over 2 weeks of a brand new non-functioning camera got an RMA number and a FedEx AWB - but non commitment on speed of repair.  I suspect this will be the last Sony product I buy.  Not the fault of Cardinal Camera and Amazon.", "Date": "June 3, 2013"}, {"Title": "Sony Alpha NEX-6 DSLR with 16-50mm lens", "Author": "jennifer borwick", "ReviewID": "R2CWEL2WZHIF3A", "Overall": "5.0", "Content": "The camera itself is exceptional and takes superb photos.  It is relatively easy to use, and comes with a user manuel. I shopped around a lot for this camera, and found the best package with this seller.  A lot of essential goodies were included, and that in itself was an enormous cost savings.", "Date": "March 25, 2013"}, {"Title": "Camera is perfect, extras are cheap", "Author": "Angela Haver", "ReviewID": "R1LMEOPKPEDGPM", "Overall": "4.0", "Content": "This would have been a 5 star, but I was really disappointed with the extra battery.  It will not charge in the camera.  They provided a wall charging unit that the extra battery will charge in, but the Sony battery will not charge  in it.  This makes for inconvenience in that you have to charge one battery one way and the other another.  I am loving the camera itself.  Overall I suppose this is is a good deal given all you get.  I was just really disappointed with the extra battery.", "Date": "July 27, 2013"}, {"Title": "Not for me", "Author": "Cerise \"Major Foodie\"", "ReviewID": "R250OVQ1MI2BTH", "Overall": "3.0", "Content": "I'm a professional photographer and wanted a small light-weight camera as a good quality back-up. The image quality is very good but the menus have way too many silly options and you have to go through them all to finally get to what you need (like formatting the card). Also the menu is often a two-step process so selecting what you want is time-consuming. Mostly, the zoom lens is too short on the telephoto side for me. The swivel LED is limited and doesn't turn so you can put the camera away with the glass protected. This camera is very expensive and not even worth half the price. I gave up on the small aspect and got the Canon Rebel T4i which I love.", "Date": "April 21, 2013"}], "ProductInfo": {"Price": "$949.00", "Features": "16.1MP Exmor APS-C Size CMOS Sensor\n16-50mm f/3.5-5.6 Zoom Lens Included\nFast Hybrid AF With Phase-Detection AF\n3\" 921K-Dot TFT LCD\nXGA OLED Tru-Finder EVF", "Name": "Sony Alpha NEX-6 Mirrorless Digital Camera with 16-50mm Zoom Lens (Black) 32GB Package 3", "ImgURL": "http://ecx.images-amazon.com/images/I/51-4j3CwWkL._SY300_.jpg", "ProductID": "B00AJ1AKAU"}}