{"Reviews": [{"Title": "Its cute but thats about it", "Author": "Brie Padfield \"deal savvy mommy\"", "ReviewID": "RXWM1J5IK4F98", "Overall": "1.0", "Content": "I bought this camera because I temporarily lost my Kodak Easy Share Mini. This camera has 4 additional megapixels on the Kodak, so I was excited about getting an upgrade. WRONG! The touch screen doesn't respond half the time. The pictures are always blurry or stretched out. When I took pictures on the beach in Florida, my 5mp phone camera took way better photos. This camera doesn't seem to adjust to different levels of light, it doesn't like to use the flash AT ALL. You have to set the flash to \"ON\" instead of \"AUTO\" for it to work in the dark (Doesn't seem to adjust to light levels...). Save yourself the money and buy a camera you will like from the get go, not something you have to learn to live with.", "Date": "June 29, 2013"}, {"Title": "Average Camera", "Author": "Rob J Wolfe III", "ReviewID": "R3CRU6WKKF8ED1", "Overall": "3.0", "Content": "I bought this for my teenage daughter to take photos. This camera does not focus very well. Even with flash, most of the photos appear out of focus. I am assuming that is why this item was returned once already. Would not purchase this camera unless I could buy it under $20.", "Date": "June 24, 2013"}, {"Title": "Not as Great", "Author": "Julia", "ReviewID": "R2IA6027U7X33I", "Overall": "3.0", "Content": "I didn't realize it was a touch screen (and not a great touch screen.) That being said, it works great, good battery, as long as I don't lose the charger that I did for my last one!No real complaints. It has no lens cover so I am scared that the glass will get scratched. Gonna have to buy a velvet bag for it!", "Date": "May 19, 2013"}], "ProductInfo": {"Price": "$59.99", "Features": "Full 3 touch screen\nAnti-Shake feature\nSmile detection", "Name": "Vivitar 16 MP Digital Compact System Camera with 1.8-Inch LCD - White (VS130-WHT)", "ImgURL": "http://ecx.images-amazon.com/images/I/51RVaNCC0pL._SY300_.jpg", "ProductID": "B00ATTHFPU"}}