{"Reviews": [{"Title": "Too many compromises.", "Author": "Jeff Kraus", "ReviewID": "R147BUG7MQ95IC", "Overall": "2.0", "Content": "The DSC-W730 contains a 16.1 megapixel sensor in the 1/2.3\" format (about 28 square millimeters, smaller than a fingernail). The obvious drawback here is noise.  The more pixels you cram into a small area, the more digital noise that will be evident in the resulting file. On its own, that's a reduction in quality that negates the need for such a dense sensor; who cares about the extra megapixels if you're not getting any more actual information, just noise? All it's doing is filling up your hard drive faster.  In the case of the DSC-W730, you're talking about around 6.5MB per image.  You'll even hit the limits of the optics well before 16.1 megapixels, so there's absolutely no reason (other than marketing) for Sony to put such a sensor in this camera.Unfortunately, they did it anyway.  And probably because of the increased sensor noise, they decided to really crank up that in-camera noise reduction.  It looks awful, and it's evident at all ISO settings.  This NR cannot be reduced or defeated. It's there for good, and it's even noticeable when viewing an image on my computer at 50% of its original size.  Of course, the higher the ISO, the more destructive they get with the noise reduction, which just makes matters worse.  The issues are somewhat less noticeable when shooting low ISO outdoors with the lens at its widest setting.  In fact, in that specific scenario I'd say the image quality is pretty good.  Once you change any of those parameters though, you start to see more problems.The lens is an 8x optical (25-224mm in 35mm terms) lens, f/3.3 at the wide end and f/6.3 at the tele end.  In other words, slow and dark.  You will almost always need to use the flash indoors, especially if you're zooming in at all.  Autofocus indoors with zoom is spotty at best and generally takes a couple of seconds to lock on to something (if it can lock onto anything at all).  Sony attempted to combat this by adding a retina-frying orange LED as an AF-assist lamp, but while it might occasionally increase the odds of getting good focus on a subject indoors, it doesn't really seem to speed the process up at all. Outdoors (and sometimes indoors with the lens zoomed out all the way), the camera locks focus much quicker (around half a second).In the majority of cases, indoor flash photos are exposed pretty accurately.  Outdoors without flash, I noticed in many cases the camera underexposed by 1/2 to 1 stop, and sometimes even more underexposed that that when trying to shoot indoors without flash (especially when zoomed in at all). Combined with the existing noise from the ISO setting and the very heavy handed application of NR, trying to bring up the exposure of those ambient light indoor shots to normal levels is going to increase the shadow noise quite a bit.  It's not pretty.The build quality is about what I'd expect from a low-end compact in this price range, entirely plastic. It may not be particularly confidence inspiring, but for the most part it seems pretty solid. It's small and light enough to carry easily in a pocket.  I'm not a huge fan of the shutter button though, which has no distinct half-press.  It's there, but you can't really tell when you've gotten there like you can with most cameras. You just sort of rest your finger on it with some light pressure.There are a couple of interesting features, such as a panorama mode that operates similar to that of a phone camera -- rather than taking several shots and stitching them, it does a panning style capture.  There's a \"smile detection\" mode, which I admit was fun for a couple of minutes.  When engaged (there's a shortcut button on the camera for it so you don't need to dig into the menus to turn it on) it actively searches out a smiling face.  When it sees one, it automatically takes a picture. I'm not sure how it works with groups (do they all need to be smiling, or just one?) but regardless I think the novelty won't last long with that feature.My suggestion?  Honestly, if you're determined to find a camera in this price range and you can't save your pennies for something better, I'd recommend looking at the used/refurb market. For example, top-of-the-line Canon Powershot SD cameras from late 2009 were about the same size and weight as this DSC-W730, around 12 megapixels (still more than enough for any camera this size), built like small tanks, with better optics and overall better image quality.  These days even those high-end models can be bought for less than this camera.  A quick search shows that an excellent condition Canon Powershot SD980 IS can be had for around $60-$80 (or refurbished by Canon for $129 which I think includes a warranty) and that was the best, most expensive Powershot SD model of its time. It even has a big touchscreen display.", "Date": "May 20, 2013"}, {"Title": "...Awesome Photos! :)", "Author": "Katharena M. Eiermann \"Existential Diva -- Pr...", "ReviewID": "RO74WLDDK12BZ", "Overall": "5.0", "Content": "Sony DSC-W730 16.1 MP Digital Camera with 2.7-Inch LCD (Silver)Impressive right out of the box which contains one Sony DSC-W730 16.1 MP Digital Camera with 2.7-Inch LCD, an AC Adaptor, Rechargeable Battery Pack, Dedicated USB Cable, Wrist Strap. note: there are no memory sticks or cards included.Some of the Many features the Sony DSC-W730 16.1 MP Digital Camera with 2.7-Inch LCD has, that stood out for Me:I might suggest, the first thing one does, before anything else -- attach the, longer than normal, wrist strap (included).  Wouldn't want to, accidently, drop (*shudders at the thought*) your new Sony 16.1 MP Digital Camera before having the chance to fully explore all the bells-and-whistles.I chose the Silver Cyber-Shot, which has a sort of brushed satin, finger print resistant finish.  Sleek and classy, goes with most any outfit!  The screen is large and (for Me) easy to view without using a magnifying glass. The slightly recessed buttons are easy to press, respond well. The camera navigates from mode to mode, function to function et al with ease and is pretty fast. When powered on, the navigation icons, are good sized, colorful and invoke a sense of fun -- and, have readable balloon pop ups that explain what each selection does.Using a dedicated side slide type button, switching between Still Images, Panorama 360° (that's a full circle) and  720p HD Movie mode is an absolute breeze. Pressing the zoom toggle switch, camera responded quickly -- zoom in, zoom out -- without any lag, or stiffness.The built in flash is very bright, and does an excellent job of lighting the subject, or adding a bit of fill flash to a dark area (like shade).On the bottom of the Sony DSC-W730 16.1 MP Digital Camera with 2.7-Inch LCD, is a dedicated tripod socket hole.  I was able to screw (mount) the camera onto a monopod and 3 different tripods, that I use regularly, with ease -- resulting in a secure fit with no wobbling.The Instruction Manual is very concise and informative.  The graphics are clear and understandable. There is also an in-camera guide.  With a couple of clicks of a button, one can have their own personal guided through instructional of most anything this camera can do -- plus, it will always be in the camera, in case it is needed on-the-fly, so to speak.  Nice! :)Charging the battery:  Insert (supplied) battery in camera, connect the camera to the AC adaptor (supplied) using the dedicated USB cable (supplied). Connect the AC adaptor to the wall outlet.  Orange light comes on (camera) when charging.  About an hour later, light is off, camera battery is fully charged.  Easy!  Insert Memory card (not included). I used a Standard SD HC 16 gig Flash card, class 10 -- and it worked just fine for all functions.Right off the bat, there are 2 modes one can choose from:  Easy Mode (for those who just wish to pick up the camera and Photograph) and the Standard Mode -- for Creative shooting with Picture and Beauty effects etc.*  16.1 megapixel plus 8x optical zoom captures detailed subjects -- that 16.1 megapixels means about a print size of 13x19.  One can easily chose from a variety of qualities/sizes.*  Optical SteadyShot Image stabilization with 2-way active mode. After taking 50 photographs, I had no blurry photos.*  Continuous shooting mode. Fantastic for capturing multiple still images at action packed events without pausing:  soccer, baseball, basketball, ballet recitals, parades, birds in flight etc.Whew!  Lots more to explore with the Sony DSC-W730 16.1 MP Digital Camera with 2.7-Inch LCD.  This camera will keep one busy for a very long time. *sips espresso* :)Does the Sony DSC-W730 16.1 MP Digital Camera with 2.7-Inch LCD, sound like what you may be looking for? :)  Highly Recommended!  --Katharena Eiermann, 2013", "Date": "May 29, 2013"}, {"Title": "For the Lucky", "Author": "Nerd Alert", "ReviewID": "R56K01NDSLRKD", "Overall": "3.0", "Content": "I do not own a DSLR, and I have never purchased a fancy camera. My cameras have always been in the same price range as the Sony DSC-W730, but that is not so bad any more. Some companies are making startlingly good cameras for the budget point-and-shoot crowd. Is Sony's new contender worthy of the competition?BUILDThe DSC-W730 is compact, though not as small as some cameras in this category. Still, it's easily pocketable or pursable. The housing is made of plastic with chrome plastic accents, and there is no attempt to make it particularly sleek. Exposed screws and large seams may make it look cheaper than its price tag, but it all feels durable and ready to take a few drops.The SD card slot is a bit flimsy, but careful use should prevent it from breaking. Storage space should not be an issue given the compatibility with SDXC cards.INTERFACEThis is my first Sony camera, so the interface was a bit confusing. The lack of a scroll wheel for options made me think that the screen would allow touch, but it does not. Navigating through the options is a bit slow and unintuitive. Switching between picture, panorama, and movie modes is accomplished with a handy slider, and the screen is bright enough to see on a moderately sunny day.IMAGE QUALITYGiven my positive results with other cameras in this price range (and perhaps low standards compared to DSLR owners), I figured that the complaints about this product were from picky users expecting too much. I was wrong. Compared to others I've used (Canon, Olympus, Kodak), the pictures are very grainy and sometimes blurry. This is a shame, since I was excited about the 16 MP resolution. The pictures look like they were snapped from a low end phone rather than a dedicated camera. However, every once in a while, with bright outdoor light, everything works just right and the picture is not bad at all. What is the issue?One problem is perhaps a small sensor, which means that the subject of the image and my hand need to be very still to avoid motion blur. The advertising on the Amazon page talks about image stabilization, but I do not see it working. A tripod would help with this, so this camera might work for product shots for ebay.Another issue is the slow and unpredictable auto-focus. With a point-and-shoot, auto-focus must work well, since we aren't focusing manually. Most camera manufacturers have this down to a science at this point, and surely Sony does as well with their higher end cameras. In general, the software seems completely confused, and the auto scene selection (nighttime, macro, etc.) is random. I am not sure what happened during development, but taking a photo with this camera is like playing the lottery. Do you feel lucky?Panorama mode is a major bullet point in the advertising and has its own button, so I played with it in different environments. Overall, it works, though the focus and contrast issues of the still images can be exacerbated. It is a fun effect, but for a photo that you want to keep of family or a cool nature spot, I suggest taking a series of pictures and using software to do the panorama. The difference for me was night and day, and you can even do it in free software like the photo editor that comes with Windows. One caveat: do not use burst mode to take the pictures. The focus is far too sluggish for that and the software is not smart enough to keep up. Even with the super slow burst rate, the pictures look like a mess.VIDEO QUALITYMy old low end Canon point-and-shoot (and my phone) don't have HD video, so I was looking forward to trying out the video on the DSC-W730. It is nice to have video in widescreen and with smooth zooming during video. When zooming, the motor noise is not obnoxious. This was my favorite aspect of the camera, and I've included a video with this review. The downside, which is not so evident in this video, is that the picture can be soft and not \"HD\" looking because it isn't sharply in focus. If you are taking a video of people or moving around, the camera is easily confused and can make everything blurry for a long time. This can happen with any camera that doesn't have a big depth-of-field, but it happens a lot more with this camera than others.EDIT: Amazon would not allow my video to be posted because they said it violated their guidelines.  It was of some trees and a pond, so I don't know why.  Sorry about that.CONCLUSIONSFor all of my critiques, I don't hate the DSC-W730. While the image quality and speed is more reminiscent of my cheapo phone than a point-and-shoot in this price range from a company like Canon, some pictures come out very nicely. It is not just a hardware problem, but perhaps even more critically a software problem. The video fares better, though again it doesn't compete well with Canon. In this very competitive low end compact camera category, it is hard to recommend the DSC-W730. It could be a worthwhile purchase if it goes on a deep sale.", "Date": "May 25, 2013"}, {"Title": "Great camera", "Author": "daniel", "ReviewID": "R8OYGH6IDYFIQ", "Overall": "5.0", "Content": "I am a regular traveler, who uses the camera on these travels only, and for me that camera worked perfectly. It's light, easy to deal with and lots of mpixels for you to have fun. The quality of the pics is something that has amazed me compare to my old digital camera. Overall, Im very satisfied with this product.", "Date": "May 11, 2013"}, {"Title": "Takes great pictures in low light settings", "Author": "maryann kahse", "ReviewID": "RG8WIFW97M6Y0", "Overall": "5.0", "Content": "I had a nikon coolpix  and it took terrible blurry pictures in low light, I bought this camera based on various reviews and I am so happy, it takes great pictures in all different lighting conditions and that is on the auto mode, very easy point and shoot!", "Date": "July 25, 2013"}, {"Title": "GREAT CAMERA GLAD I FOUND IT HERE.", "Author": "ed gerhold", "ReviewID": "RBRUWCPDHV0U2", "Overall": "5.0", "Content": "IT'S SMALL,THIN,CAN PACK IT EASILY,JUST WHAT I WANTED FOR ALL AROUND PICTURE TAKING.THE PICTURES ARE SHARP AND THE VIDEOS ARE AWESOME.", "Date": "October 4, 2013"}, {"Title": "A basic camera that is fun and simple to use", "Author": "Richard J. Brzostek", "ReviewID": "R1YXUH9Q9JDKKY", "Overall": "5.0", "Content": "I have owned several digital cameras, most of which were made by Sony.  This camera is on the more simple side to use, but still takes some quality photos for a \"point and shoot\" style of camera.The Sony DSC-W730 16.1 MP Digital Camera with 2.7-Inch LCD is similar to the last digital camera I bought (Sony Cyber-shot DSC-WX150 18.2 MP Exmor R CMOS Digital Camera with 10x Optical Zoom and 3.0-inch LCD).  While this one doesn't have quite as many MP, the price is also considerably lower than what I paid for the fancier model.  The Sony Cyber-shot is honestly a lot more complicated to use as it has so many settings and it is easy to take blurry looking photos with that if you have it in the wrong setting.  Oddly enough, the photos always look fine on the screen of the camera, but not when on the computer if you have it set incorrectly.So while the Sony DSC-W730 might not have all the bells and whistles of the Cyber-shot, it probably has all the best features and is much easier to use.  I found it very simple and intuitive to use.  This camera is going to be best for those who want a low cost camera that can take nice looking simple photos.As with pretty much all cameras, you will have to get a memory card (which for $10 to $35 you will be able to get a real decent one).  Again, like most cameras, this one doesn't have a case.  It does have a strap and a recharge cord for the battery (which is nice as it is such an improvement from the days of having to buy batteries that last for about an hour in a digital camera).", "Date": "June 20, 2013"}, {"Title": "Nifty little camera that takes good photos.", "Author": "William Polm", "ReviewID": "R15DIE6WEK2J45", "Overall": "5.0", "Content": "This camera works fine for me.When I tried to use a Canon SD card I kept getting error messages: either \"no card\" or \"not enough memory on the card.\"It definitely had trouble reading the Canon SD card, but when I tried others (Transcend 16Gb, for example) they worked fine. The camera does not come with a card, so keep that in mind if you order one. It also does not come with a USB connector cord.Some reviewers concluded that the image quality is poor. I found just the opposite. Now this is not a technical review, like some others on this page, but I tested this camera against my phone camera (Samsung Brightside SCH-U380, 4 MP), a Canon Elph (Sd8009is, 7.1MP), and my Canon SX30is (14.1MP). Frankly, the Sony's photos came out clearer than all the other cameras. I was a bit surprised (after those negative reviews), so tried the the test a second time. Same result. Also the colors were right on when compared to the scene (using my eyes to view it).Reviewers also mentioned that the  battery door seems thin and weak.  It does seem a little thin, but here's what to watch out for: make sure the SD card is pushed all the way in until it \"clicks\" in place, then shut the door and move its button to closed. Once I did this, the door seemed solid enough. And I had no problems with the camera reading the card or using its battery.An excellent quality is the size and weight of the camera. It is light and small. It will fit easily into most pockets. I recommend using the small strap that comes with it: since it is so small, it would be easy to drop.My daughter is using this camera to photograph items to display on her website because she, too, found that its photos were sharper than those taken with our other cameras.  I will use it on sketching outings to capture scenes where there is not enough time to stay and paint.Recommended.", "Date": "June 2, 2013"}, {"Title": "It's a 9.5 on a scale of 10.", "Author": "Tom Zeni", "ReviewID": "R33DIBJ9XW55RL", "Overall": "5.0", "Content": "The Sony DSC-W730 is all I could expect from a point and shoot camera. We travel extensively, and my wife enjoys scrapbooking, So this light, flexible use camera is perfect for taking all types of photos. The mode of picture/pano/movie is easy to change. The 8x zoom is as much as anyone with normal photographing needs. And with the lithium battery and a 16gb SD card, you are good to go for the entire day.  After years of carrying bulky Nikons and Cannons with various lens, this Sony, and others that I've had previously owned, is a joy to own.I really enjoy the panoramic mode, especially when traveling and taking photos of wide vistas of various types. I've taken great photos of PNC Park in Pittsburgh, The Red Rock Canyon in Las Vegas,the rainforest of the Eastern Caribbean just to mention a few. And there are online sites that will print them, or you can crop them to suit your needs.My only downside is the 16 megapixel images. The files are large, and to upload them to an online photo service takes more time than my previous Sony. A 6.5 meg picture is a lot of megapixels. Clear, sharp, absolutely, but my previous camera with 14meg was just as clear. The good thing is you don't need to shoot in the 16meg mode. You can reduce it to 10, and even further down. I would have wished the gap from 16 to 10 wouldn't have been so distant from each other. A 12meg setting would have been a better choice.In closing, if you're not some special effects buff, and the Sony does do some of that, like a fireworks mode, etc, but take photos of vacations, birthdays, sporting events, and all around general use, you can't find better than this Sony for quality and weight.", "Date": "July 20, 2013"}, {"Title": "great camera for the average tourist", "Author": "L. Steiner", "ReviewID": "R8J16U2OM5T67", "Overall": "4.0", "Content": "I am not a photographer, and I don't understand very well all of the differences between different models and brands.  I just want an easy to use  camera that takes clear pictures, and this camera does it pretty well. It also takes very good videos. I love the small size and solid feel and how quickly it turns on and is ready to go. I also appreciate the rechargeable battery, which for my purposes lasts a long time. Im still learning how to play with the visual effects, and will update my review after I've had the camera a little longer.", "Date": "June 5, 2013"}, {"Title": "Lots of features, good looking shots", "Author": "Koala1356", "ReviewID": "R18XLNHBG6B6VD", "Overall": "4.0", "Content": "INTRODUCTION & OVERVIEW:For a pocket camera, there's a lot to love about the Cybershot DSC-W730.  This is a great pocket camera that I can take anywhere because of its small size.  I'm not a photo professional, so I think it takes decent photos and movies.  However, there are some trade-offs.  The camera has an entirely plastic body.  This makes it lightweight but it also gives it a cheap feel.  The LCD screen is smaller than my other cameras because of the overall small size (only 3\" diagonal) but it's adequate.The battery charges directly in the camera, so I don't think having a spare battery is a viable option.  The battery charges one of two ways: via the mini-USB cable plugged into the power adapter and into the wall, or via the mini-USB cable plugged into a computer USB slot.I like that there's a built-in instruction guide in the camera, so if I'm away from home I can still check how to use a feature if I forget.While this camera is intuitive to use, transferring images to my PC was not. I expected to connect it to my PC and find it as a drive (like with every other camera I've used) but the DSC-W730 will not show up under File Explore by default.  It required me to download and install the SONY \"Play Memories\" software for transfer of my photos and videos.I love the Panorama mode!  Set the camera to this and it automatically takes five shots in a sweep, all adjusted exposure etc, and stitches them right on the camera for remarkably cool panorama shot.There are some photo effects, like those you might normally apply via additional software on your PC, that you can apply directly on the camera as you take the shot.  I particularly like the Partial Color effect.  It takes a b&w; shot with the color of my choice highlighted.  EG: a red rose, only the rose would be red and the background would be b&w.;  This makes for some truly striking imagery.  Can be applied to stills, movies, or panoramas.IN THE BOX:* Sony DCS-W730 camera* Wrist strap* Sony NP-BN lithium ion battery* Proprietary Mini-USB cable* Power charging adapter* User's GuideNOTE: The camera does not come with any sort of flash card included, not even a tiny one.  You'll need to supply your ownSTILL IMAGE MODES:* Easy* Intelligent Auto - Exposure adjustment with automatic settings* Program - Auto exposure with adjustable settings* Picture Effect - shoot images with different effects applied. Toy (toy camera look, you can change the color hue: normal, cool, warm, green, magenta), Pop (pop and colorful scenes), Partial Color (b&w; shots with one extracted color: red, green, blue, yellow), Soft High-Key (warm fresh shots emphasizing bright areas)* Scene Selection - select best scene mode for environment and shoot (Soft Skin, Soft Snap, Landscape, Night Portrait, Night Scene, High Sensitivity, Gourmet, Pet, Beach, Snow, Fireworks)* Smile Detection (three sensitivities)* Face detection* Continuous shooting mode* Red Eye reductionIMAGE SIZES:* 4:3 (16Mb) for prints up to13\"x19\"* 4:3 (10Mb) for prints up to 11\"x17\"* 4:3 (5Mb) for prints up to 8\"x10\"* 4:3 (VGA) smaller size for email* 16:9 (12Mb) 11\"x17\" for viewing on HDTVs* 16:9 (2Mb) for viewing on HDTVsSWEEP PANORAMA MODES:* Sweep mode* Picture effects: Pop (pop and colorful scenes), Partial Color (b&w; shot with one extracted color: red, green, blue, yellow), Soft High-Key (warm fresh shots emphasizing bright areas)PANORAMA IMAGE SIZE:* Standard* Wide* 360 degreesMOVIE MODES:* Auto* Movie steady mode (two modes: Standard or Active)* Auto white balance (or selectable to Daylight, Cloudy, Fluorescent 1, Fluorescent 2, Fluorescent 3, Incandescent, One Push, or set it yourself)* Picture effects:  Toy (toy camera look, you can change the color hue: normal, cool, warm, green, magenta), Pop (pop and colorful scenes), Partial Color (b&w; movies with one extracted color: red, green, blue, yellow), Soft High-Key (warm fresh shots emphasizing bright areas)MOVIE IMAGE SIZES:* 720 Fine 1280x720* 720 Standard 1280x720* VGA for web uploadsIN CONCLUSION:For a small pocket camera, I think the DSC-W730 does a terrific job with point and click photos. There are enough features to keep me amused, but my basic use will be for stills, movies, and the occasional panorama and I will probably be shooting in \"Intelligent Auto\" mode for all of these because I think the camera does a great job with the automatic settings.  I would recommend this camera to my friends and family, although I would first point out that the transfer of photos to a PC requires the download of the SONY software.  Otherwise 4-better-than-average stars from me.", "Date": "June 11, 2013"}, {"Title": "Good for a Point-and-Shoot, 4 by 6 print kind of audience", "Author": "Ashley Mott", "ReviewID": "R3B07JQ7PFTWL7", "Overall": "4.0", "Content": "News flash: the Sony digital camera that is not advertised as a DSLR is not a DSLR and does not take DSLR quality pictures. Instead, it takes pictures as good as or a bit better than other point-and-shoot cameras in its price range.I have a current generation smart device that I was using to take pictures prior to receiving this camera, and I will probably continue to use it for snappy pictures since I usually have it right beside me. However, the flash and image optimization can leave a bit to be desired at times, and this camera avoids that *in most instances*.I'm generally a very pale person, and I have a hard time with point-and-shoot and smart phone cameras leaving me with white ghost face, but the automatic image optimization and flash adjustment of the Sony actually left me looking the way I look in the mirror. Ditto for my husband, though his problem isn't paleness -- cameras usually just make his wrinkles look more prominent than they are because of a hot flash -- this doesn't.In addition to portraits I took several outdoor pictures of both landscapes and objects as well as indoor photos of objects using the default, automatic settings. Approximately 25% of my outdoor pictures with really dense colors (large swaths of freshly excavated dirt, a wide tree canopy) had a fair amount of noise (when viewed full-size on my computer monitor) in the areas where the colors were deepest. When viewing a 4-by-6 print, this isn't noticeable.With some close-up shots both with and without the macro setting, it took a few snaps to get a photo without the object in the foreground being soft with a sharp background. I experienced better results with a tripod (which the average point-and-shoot user may not want to use or have handy for most pictures).Indoor macros also experienced this phenomenon but not to the extent of the outdoor shots since the camera flash tuned in differently to compensate for the lack of indoor light.Most of my pictures (95% ish) had stunning colors that translated beyond the viewing menu to my computer monitor and then prints.I had a Panasonic Lumix briefly last year and returned it because it was overkill for a point-and-shoot and required too much work to take good pictures consistently. If I wanted that kind of trouble, I would invest in a DSLR and dedicate time to learning how to operate it properly. I don't want that. I have only ever been interested in point-and-shoots that let me get the picture I want within a few shots if I'm doing something posed or that will take nice pictures for reproduction as 4 by 6 (and occasionally 8 by 10) prints for a scrapbook. This camera does that.If I had expectations for this unit beyond its intended niche, I suppose I could be disappointed with some aspect of its performance. As it is, I think it is very respectable given its price and advertised capabilities.", "Date": "May 23, 2013"}, {"Title": "Best little camera", "Author": "Paulette L. Hand \"sixhands\"", "ReviewID": "R3TVP7K36FRV1Q", "Overall": "5.0", "Content": "I love my new Sony digital camera.  So many people are just using their phones for pictures, but I like an actual camera and this one fits the bill perfectly.  It is small enough to slide into a pocket, but the quality of the pictures is great. The screen is large and very easy to use.", "Date": "April 10, 2013"}, {"Title": "A great product", "Author": "Bharti", "ReviewID": "RY7EFQJ1LN0N8", "Overall": "4.0", "Content": "I love this camera and use it on all my trips. I haven't figured out its different modes but with the basic mode it works well for me. Its easy to carry so I don't need a lot of space.The battery life is good. The quality of pictures is good. It works well in the dark and takes awesome pictures in different shades of light.I bought an additional memory USB to save the pictures while using the camera. It was very cheap like 12$. Overall a great product to have. Would recommend it to the friends and family.", "Date": "December 31, 2013"}, {"Title": "Absolute Bargain", "Author": "Elaine", "ReviewID": "R1Z5DSBS0GO3RW", "Overall": "5.0", "Content": "I brought this for my son who is living in America, he said its a really good camera and is pleased with it and I was impressed with the price!", "Date": "December 28, 2013"}, {"Title": "Best Point-N-Shoot camera bargain on the web...", "Author": "John Kully \"DeepSea\"", "ReviewID": "R2LW8QOZYAA2IH", "Overall": "5.0", "Content": "This little camera had so many great features ( Size, Zoom, and Panoramic shooting), I had to try it...Wow...better than expected... I had just bought another major brand \"Point n Shoot\" and was vas very happy with it (an I still am),  but I find my self carrying this camera more and more for daily photo shooting...it's half the size and weight (and 2.5 times less than my other).  My other is a great camera with great 20X zoom when you need it, but if I had seen this first, I would have only one point and shoot cameras, instead of two...Worth the price of ownership...in fact on Amazon, it was less than $100.00...best bargain on the web...now I need to find a family member who needs a new point n shoot...", "Date": "November 14, 2013"}, {"Title": "Great camera", "Author": "Bill Allegretti", "ReviewID": "R2U03KGV0UH8DA", "Overall": "5.0", "Content": "Great cameraEasy to use and a great lensI like the fact that the flash can be used in bright situationsThis is my second, after the first was lost", "Date": "October 20, 2013"}, {"Title": "unbeatable value", "Author": "ry", "ReviewID": "R18LBZCK4NWUZ3", "Overall": "5.0", "Content": "a most easy to use camera, quick change from camera to video, strong flash, more than sufficient zoom for everyday use", "Date": "September 7, 2013"}, {"Title": "Nice Camera!!", "Author": "Raul Colon", "ReviewID": "R1YULOUWQ4NMPI", "Overall": "4.0", "Content": "Its for simple use,..but nice pics..and discreet to carry on,..not into those bulky cameras..its a very good price also..Hope never to have problems with this camera.", "Date": "July 13, 2013"}, {"Title": "A functional and compact point and shoot", "Author": "Sibelius", "ReviewID": "RKE3EEM4NVRCL", "Overall": "4.0", "Content": "Sony's 16.1 megapixel DSC-W730 provides decent, all around point and shoot functionality with respectable image quality thanks to good image stabilization, intelligent flash lighting and a Carl Zeiss (licensed) lens.  While most of the unit is housed in a metallic plastic case build quality seems decent for the price point.  What I appreciated the most was its compact sizing (slightly smaller then a deck of cards) and speed at which the unit can go from power-off to photo taken in less than 2 seconds.  The 8x optical zoom goes through its progressions smooth and quickly and the 3 inch LCD display is adequate when considering the devices size.  The menu and options UI is mostly standard and intuitive if you've used other point and shoot cameras over the past 5 years.  Overall, a handy little camera with image quality that will surprise you if you experiment with the manual settings.", "Date": "June 23, 2013"}, {"Title": "Decent camera for beginners.", "Author": "MM", "ReviewID": "RC90KMGYOSIR", "Overall": "4.0", "Content": "Very easy to use for a beginner like me who has no photography skills what so ever.  Just put it in automatic mode and start snapping pictures.  Zoom function, panoramic, etc were all self explanitory and worked well.  Easy to charge and get pictures from the camera onto the computer.  Picture quality is pretty good too.The auto smile detector is kind of creepy, but I think it could be useful in some situations. Also, the red laser beam scanning thing for the smile detector is kind of annoying.  The camera did not come with a memory card, as far as I could tell, and without one it only holds 4 pictures on the default quality setting. So definitely bigger memory card is needed.Overall it seems like a very good camera for a beginner like me.  Not too complex, and mostly easy and convenient to use.  I looked up the price, and $100 seems like a reasonable amount for what you're getting.", "Date": "June 15, 2013"}, {"Title": "Nice little Camera fits in your pocket.", "Author": "samsi8000Y", "ReviewID": "R3BVVPDZ6NOTAN", "Overall": "5.0", "Content": "I like this camera because the following1. Size - Fits into your pocket like a mobile phone2. Light weight - you won't feel and no need to carry a big case3. Comparable picture quality with good zoom (8X)4. Picture transfer and charging made easy with USB cable.Overall nice camera for the price under 100.", "Date": "June 12, 2013"}, {"Title": "returned it the next day", "Author": "cacat", "ReviewID": "R17WDOJ18VB9WZ", "Overall": "1.0", "Content": "We bought it at BestBuy then returned it the next day. The picture quality is awful. The size of the picture files are at 6MB. But the quality of the pictures is obviously much much worse than that of the pictures taken from our Nikon Coolpix S6200, even though the file sizes from the S6200 are in the range of 1MB.", "Date": "May 14, 2013"}, {"Title": "Disappointed.", "Author": "Pikkidok", "ReviewID": "R3T95KRML53YA6", "Overall": "2.0", "Content": "I wanted a slim and light camera so I bought this.Only problem is that the pictures are not good.worse picture quality than my 5 megapixel samsung phone camera.the pictures cannot stand up to my old pentax optio m20 and my ultra cheapo nikon s30both cameras lack image stabilization and have smaller sensors and lower pixe countyet they consistently take better pictures than this sonythis sony boasts a carl zeiss lens but at the wide end, the periphery is badly distorted.I think zeiss cheapened their name on this camerathe main problem with this camera is that the iso is set too high for indoor shots.with 16.1 MP packed into a tiny sensor, I should have guessed that noise will be a major problemI was tempted by the zeiss lens, high zoom and low pricewell now I knowpictures taken with iso800 has a lot of noise and really degrade the qualityso this camera is good for bright outdoor shotsfor bright outdoor shots, you can use your phonein conclusion, I  cannot find a good reason to recommend this cameradont be tempted by the high pixels cramped into a tiny sensorit only serves to create noise at high isomy 7 megapixel pentax camera bought in 2007 is way better in capturing good quality photosdo not be hoodwinked by megapixels and branded lens.", "Date": "February 5, 2014"}, {"Title": "Great value for your money", "Author": "Julian", "ReviewID": "R1J1YV9GN4ZWHM", "Overall": "5.0", "Content": "Simple, good, zoom, great images, pocket size, all what i need and a very good price. Great value for your mnoney", "Date": "January 18, 2014"}, {"Title": "EXCELENT PRODUCT", "Author": "Herbert Randolf", "ReviewID": "R12F9UZORY2TJY", "Overall": "5.0", "Content": "EVERYTHING GREAT. I PURCHASE 5 OF THIS PRODUCTS AND THEY ARRIVE PERFECTLY. GREAT PHOTOS AND THE BATTERY CAN HOLD MORE THAN 24 NHOURS", "Date": "January 16, 2014"}, {"Title": "Great little camera at a reasonable price.", "Author": "Ed John", "ReviewID": "R2LDEWS859PGLX", "Overall": "5.0", "Content": "I was interested in upgrading my existing Canon point and shoot camera.  I am very pleased with the features on the Sony and the ease of use.  I like the higher zoom which is set according to the size of the prints you wish to produce. Menu is easy  to follow without any reference to a manual. I can use flash in bright light with a simple push button on the camera without having to go into the menu as I had to do with the Canon.  I use camera for 3 trips we take a year plus all the birthday parties and any other event I like to capture on camera. I then enter the memory card in my laptop, develop pictures by an on line provider and organize my pictures chronologically.  Amazon purchasing options such as \"open-like new\" is fantastic.", "Date": "January 16, 2014"}, {"Title": "It's practical!", "Author": "Isabel Paz", "ReviewID": "RG3WW2N2GESI4", "Overall": "4.0", "Content": "I always like the image that cybershot provides. The only BUT that this camera has is that when you are going to watch the pics you take, it is to slow.", "Date": "January 3, 2014"}, {"Title": "nice digital camera", "Author": "Dr. Genao", "ReviewID": "R36UJSG3K3WS2D", "Overall": "4.0", "Content": "It's good and it was that I expected.good price also and I used that model for a long time", "Date": "January 1, 2014"}, {"Title": "great cam", "Author": "luisa", "ReviewID": "R2O43GNZVZ8K5G", "Overall": "5.0", "Content": "Its pretty simple but its a good basic camera... I love sony ciber shot ill never change brands again! the best.", "Date": "December 31, 2013"}, {"Title": "Great camera!", "Author": "Danyel", "ReviewID": "R3B9VFFZCV8ON2", "Overall": "5.0", "Content": "It works great!  Exactly what I wanted.  Not to difficult and takes great pictures.  And the battery life is excellent.", "Date": "December 1, 2013"}, {"Title": "great product", "Author": "Monique", "ReviewID": "R35H9IZG7CAGLR", "Overall": "5.0", "Content": "purchase this for my friend as i already have the same one and she is enjoying it a lot she carry it all over with her", "Date": "November 30, 2013"}, {"Title": "Good, simple, handy to have and use.", "Author": "Bo Tep \"BoTep\"", "ReviewID": "R2NKBZHXPW9JO4", "Overall": "4.0", "Content": "Good, simple, handy to have and use with enough pixels, features, zooms, video, compactness, reasonably price, good battery life span...", "Date": "November 30, 2013"}, {"Title": "Good head quality.", "Author": "Leonardo C.", "ReviewID": "RHE08Q6DTVY9W", "Overall": "4.0", "Content": "Good head quality.Photo strip fast.Many pros ...The unique thing that not delighted, were:1 - Slow delivery, failed to meet the deadline;2 - Does not come with memory sd (Okay, I just buy one)", "Date": "October 16, 2013"}, {"Title": "Not good as it is expected", "Author": "Hari Guragain", "ReviewID": "R30180DN7JAV7A", "Overall": "3.0", "Content": "This product is ok. But it is not as per expectation. The pictures are not good as expectations. But it is ok according to price.", "Date": "September 4, 2013"}, {"Title": "Sony W730 vs. Panasonic Lumix SZ3 ... Both are excellent.", "Author": "Amazonian Consumer", "ReviewID": "R250BLC9QBIZFS", "Overall": "4.0", "Content": "Currently, the DSC-W730 is the lowest priced Sony that comes with a Carl Zeiss-licensed lens. And Lumix SZ3 is the lowest priced Panasonic Point-and-Shoot digital camera that comes with a Leica-licensed lens. Leica and Carl Zeiss are legendary German photographic lens designers who are known for their super sharp and accurate color lenses. Not all Sony and Panasonic cameras have Carl Zeiss and Leica marking on the lens, respectively. Those that do not cost less, but I always choose ones that do.I have both of the above cameras and like them very much because they take excellent, sharp, color accurate pictures without costing a lot of money. The Panasonic costs a bit more, but both are excellent.The Lumix SZ3 has a slightly greater zoom range of 10X, compared to Sony's 8X. Both cameras have the wide end of the zoom lens at 25mm (35mm film camera lens equivalent), which is great for group and scenery shots.I prefer the SZ3 camera's physical user interface, especially the direct \"movie button\" and the shutter button surrounded zoom lever. They are more convenient and easier to use than Sony's.On the other hand, the Sony W730 consistently shoots better fill-in flash scenes than the Panasonic Lumix SZ3. The resulting images look very good, as you almost can't tell that fill-in flash is used.When reviewing pictures taken, the Sony displays a \"rough, unclear\" image first, then sharpens up in a split second, while the Panasonic can display each shot without this extra step.The W730 shoots video in 720p at 30 frames per second (fps), while the SZ3 does it in 24 fps. Some users like the 24 fps frame rate because the resulting video looks more film-like, or movie-like than when shot at 30 fps or higher.I buy extra compatible batteries on eBay. For the W730, you can typically get one for about $5, or 3 batteries plus a charger for $13. The aforementioned prices include free shipping. Just search \"Sony W730 battery\".If you need a carrying pouch for this camera, I'd recommend Case Logic's DCB-302 (less than $6) Case Logic DCB-302 Compact  Case for Camera - Black. Its size is just right for the W730, with a few centimeters of extra space so it isn't too snug. The small accessories pocket is perfect for memory cards and batteries.Instead of using the pouch's shoulder strap, I urge you to tie the camera's wrist strap to one of the two shoulder strap ringlets, so that the camera and the case are loosely tied together. The arrangement permits me to hold the case with my left hand while I take pictures with my right hand. If someone bumps into me at this moment, my camera is less likely to fall to the ground, as its wrist strap is tied to the case held by my left hand.", "Date": "November 15, 2013"}, {"Title": "better than expected", "Author": "Mark Perry", "ReviewID": "R19OQTS5WW18JU", "Overall": "5.0", "Content": "Bought for my fiancé, and she loves it.  An upgraded version of my old camera, many new features.blah blah blah", "Date": "July 21, 2013"}, {"Title": "Good little camera", "Author": "T. Winzent \"TW - Denver\"", "ReviewID": "R1UZFVGZNKJSL", "Overall": "5.0", "Content": "I really like this camera.  It takes awesome photos for a small camera.  I like it because I can carry it in my purse and always have it at hand.  I am not a technical savvy person.  This camera is easy to use as well as getting the pictures off the camera.  This is my second Sony camera, I had a earlier version of this camera that I loved also, but I dropped it with the zoom lens opened.  I decided to get the same camera, but an upgrade with a better zoom.", "Date": "June 5, 2014"}, {"Title": "Look elsewhere", "Author": "E. London \"Starvin Marvin\"", "ReviewID": "R2OZ1YUNXF16IF", "Overall": "2.0", "Content": "Pros: very small, easily fits in pocket. 8x optical zoom.  charges quickly.Cons: takes forever to focus; pictures are often out of focus especially need to quickly snap a shot", "Date": "May 24, 2014"}, {"Title": "Just as I expected", "Author": "Y. Curtis \"Sci-Fi Fan\"", "ReviewID": "R344X8K34MH0RL", "Overall": "5.0", "Content": "This a great camera. It takes great photos with no fuss at all. If you aren't an experienced photographer and just want to take great photos of your kids or vacation, this is a great camera.", "Date": "May 19, 2014"}, {"Title": "Sony DSC Experience.", "Author": "Michael Soto", "ReviewID": "RN2JX7WHCJUO6", "Overall": "5.0", "Content": "This camera is light compact and more important takes excellent photos and video.The zoom is great. The 2.7 inch screen gives you a good view of your subject. Enlarge images with little or no distortion. I recommend this item to novice and experienced photographers who want a handy camera for unexpected events.", "Date": "May 17, 2014"}, {"Title": "Sony Digital Camera", "Author": "Judith A. Foley", "ReviewID": "R2YA4TP27TVSW9", "Overall": "5.0", "Content": "I love this camera.  I had another Sony but they do not make the memory cards for them, so I bought this camera, I am hoping that they don't stop making the memory cards for this camera.  I would recommend this camera to anyone that wanted a very nice camera.  This camera takes great pictures.", "Date": "April 25, 2014"}, {"Title": "Excellent !!", "Author": "RONISVALDO RIBEIRO DOS SANTOS", "ReviewID": "R163HQO5TMN4AT", "Overall": "5.0", "Content": "Very good product as shown in the page for a very good price !! I recommend, and hope you enjoy like me !", "Date": "April 23, 2014"}, {"Title": "Happy with this camera", "Author": "Nazly Lopez", "ReviewID": "R34BUUH2GR3SKD", "Overall": "5.0", "Content": "Thanks! My camera is working perfectly and I really like it. It Was a good gift to myself :) :)", "Date": "April 8, 2014"}, {"Title": "Not that good for capturing images in dark specially at night", "Author": "Harshal", "ReviewID": "R20PQO3B41YJF9", "Overall": "2.0", "Content": "Not that good for capturing images in dark specially at night. Also picture quality is not good when you xoom 50%. Its good for taking close up pics.", "Date": "April 2, 2014"}, {"Title": "Value for money", "Author": "Rajkumar Ghosh", "ReviewID": "REH5O5BJWDM3J", "Overall": "5.0", "Content": "I have purchased this camera for my fiance. She loved the color. The performance is very good. I have purchased this during the thanksgiving. It's the best camera with a very little price.", "Date": "April 2, 2014"}, {"Title": "Great little camera", "Author": "C. Olson", "ReviewID": "R38KZ1Z97HG8KA", "Overall": "5.0", "Content": "This is a pocket size camera that simply does the job. The zoom is just what I expected. It is perfect for someone on the go.", "Date": "March 31, 2014"}, {"Title": "Sony digital camera", "Author": "HUNG T LE", "ReviewID": "R283IV8ZUB37NH", "Overall": "5.0", "Content": "It is came on-time and good condition. Pictures is very good. Video is not as I expectation. This is because the size of product to small in size and weight these cause its unconvinience.", "Date": "March 2, 2014"}, {"Title": "Lovely.", "Author": "Carrumba", "ReviewID": "R2U41Z9L26QMV4", "Overall": "5.0", "Content": "Easy, easy, easy. It's Sony...the one and only. There are some refined features that keep your fingers from accidentally turning the machine off, which I find great. This little computer is a worthy ally if you're in any of the arts, building trades, or just making insurance inventories. It produces clear shots, even in the dark! And high levels of light aren't too tough to overcome with this camera. All that, and it fits in my coat pocket too!", "Date": "February 27, 2014"}, {"Title": "love it", "Author": "Cathy Herbert", "ReviewID": "R1GKPVRUPGEN8", "Overall": "5.0", "Content": "I really ike this camera. Had one and accidently went into the Caribbean with it, my fault. Got another because it fits my needs.", "Date": "February 18, 2014"}, {"Title": "No Memory card included!", "Author": "Cajun Chef", "ReviewID": "R3AITGZIGHT7V8", "Overall": "3.0", "Content": "Not a deal since no memory card was included.  First Sony Cyber-Shot I ever bought without one.  Rude awakening when I got that error message when trying to use it at an event.", "Date": "February 8, 2014"}, {"Title": "Perfect Camera", "Author": "R. D. Kelly", "ReviewID": "R34SFZSVFGTWTI", "Overall": "5.0", "Content": "This is an excellent camera for vacations and everyday photos.  We love it!  It is small and fits in your pocket.", "Date": "February 4, 2014"}, {"Title": "bad quality", "Author": "Mingjian li", "ReviewID": "R1SF6RU12RYMQZ", "Overall": "1.0", "Content": "It is easy too break! only after two days I found it has been broken.I think it's quality is too bad.", "Date": "January 25, 2014"}, {"Title": "Mom loves it", "Author": "Maxine Thomas", "ReviewID": "RYN1LQ484VUO6", "Overall": "5.0", "Content": "Bought this as a christmas gift for my mom.  And for lack of a better description, she is a 'picture taking fool' now.  No complaints from her so far. Considering getting this for myself.", "Date": "January 22, 2014"}, {"Title": "I LOVE it", "Author": "Ariane Bashimbe", "ReviewID": "R317BVXFQAW34G", "Overall": "5.0", "Content": "i gave 5 starts Because this BEAUTIFUL pictures!!!!!!!! buy it you will not regret buying this cameras, is awesome i take everywhere with me when i traveled!!", "Date": "January 12, 2014"}, {"Title": "good", "Author": "Rossanna", "ReviewID": "R2JJZ0Y5L2HFX1", "Overall": "4.0", "Content": "and bought this computer for a friend and she is very happy with what I received,  fast and reliable bendedor, pructo good quality, thanks", "Date": "January 12, 2014"}, {"Title": "Perfect.", "Author": "Johanna Cabrera", "ReviewID": "R14KCLUANLIMIK", "Overall": "5.0", "Content": "I love this cam and it was so cheap. My collegues at the job are very jealious to see it so fantastic and so cheap", "Date": "January 3, 2014"}, {"Title": "very disappointed", "Author": "Annie", "ReviewID": "RLZA4RJXV3ZZQ", "Overall": "2.0", "Content": "It is very unusual for me to write a negative rating for an item but this camera is like a toy.  I am very disappointed and may send it back.  Using it makes one think you are taking photos with a kids camera.", "Date": "December 26, 2013"}, {"Title": "Great pics!", "Author": "Eleise Butcher", "ReviewID": "R34GS95RIRGK6I", "Overall": "5.0", "Content": "I wanted a smaller, flatter camera to carry in my purse.  This one is great and takes some great pictures.  My problem is remembering to charge it periodically.  A second battery will solve that issue soon.", "Date": "December 24, 2013"}, {"Title": "Great Camera!", "Author": "Amanda Cividino", "ReviewID": "R1RZJP2697AURZ", "Overall": "5.0", "Content": "The images are beautiful and the device is really easy to use. Good for someone who just wants to point and shoot!", "Date": "December 21, 2013"}, {"Title": "Good!", "Author": "amazon616", "ReviewID": "R322UU5GEW4J7G", "Overall": "5.0", "Content": "Pros: Light weight, slim, easy to use, takes great pictures.Con: Takes 5-10 seconds to view picture that was just taken.Good to-go camera for people who are looking for better picture quality than cell phones but does not want to carry around a heavy camera.", "Date": "December 20, 2013"}, {"Title": "great little camera", "Author": "karen", "ReviewID": "R1QZMBR50JCK2K", "Overall": "4.0", "Content": "I had a sony before that i loved so wanted another and this one you can plug in (no battery!)Yah!good pics and easy to manage..", "Date": "December 14, 2013"}, {"Title": "~Cute~", "Author": "Brittany Pettyjohn", "ReviewID": "R1AR9MCIRZDDVY", "Overall": "5.0", "Content": "It's easy small and discrete! Excellent picture quality! Perfect for our family :)  Shipped on time as always, and in a protected packaging.", "Date": "December 12, 2013"}, {"Title": "Great Quality & Easy to Use", "Author": "crazyerina", "ReviewID": "R1HRAZI9MBBXN7", "Overall": "5.0", "Content": "I purchased this as a gift for my mother. It is incredibly easy to use and is so small it fits in a pocket. The picture quality is much better than ourold camera. The 8x zoom worksreally well. The blue color looks a bit more purple but I like both colors so even that is a plus!", "Date": "December 7, 2013"}, {"Title": "Good buy", "Author": "Mimizuku", "ReviewID": "R2ZBLQIH9P6SZ0", "Overall": "5.0", "Content": "This was a birthday present for my boyfriend's mom. She loves it , and takes it everywhere. Cute color and takes good pictures.", "Date": "November 6, 2013"}, {"Title": "Great Camera, great price.If you want a great value, this is the camera for you.  It's small and you can take over 500 pics.", "Author": "bradnelson", "ReviewID": "R3TG2N43D3D94X", "Overall": "5.0", "Content": "Awesome little camera.  Takes great pictures and videos. If you want a small camera, this is great! the zoom works really good and the pics are clear.", "Date": "November 6, 2013"}, {"Title": "Nice little camera", "Author": "Cindy", "ReviewID": "R19MHVRA21PZQO", "Overall": "4.0", "Content": "Only used the camera once so far, and it was easy and pics came out good.  Will rate again as I am looking forward to seeing how it works on a trip to the Grand Canyon next month!", "Date": "August 16, 2013"}, {"Title": "Easy camera for quick use", "Author": "SMB", "ReviewID": "RP5FAO5CKBE01", "Overall": "4.0", "Content": "This is a great little point and shoot.  It's easy to use, has good picture quality and is small.  The only negative thing I can say about this camera so far is that it came with a rechargeable plug that connects to the camera itself.  This means if your battery dies you can't  charge it while using a back up battery.  I personally like to do that very thing and find it annoying I can't.", "Date": "June 9, 2013"}, {"Title": "Wait for a Gold Box special before ordering", "Author": "M. Kelly \"Life is a Cabernet\"", "ReviewID": "R3IYEZIYAFBKVU", "Overall": "3.0", "Content": "I am a little disappointed with the quality of this point and shoot. First, the pros are that it is light, attractive, small and easy to carry. Everything else, in my opinion, really revolves around what you get for the money. Quality of the pictures is just ok, I honestly think my Apple iphone takes better pictures (even in dimly lit areas). But for those people who want to take a lot of pictures on a trip and need memory card, then a camera would be a must have. Not crazy about the zoom capability, seems to definitely be less than advertised. As I mentioned, in low lighting camera stabilization seems low. Overall, if this was in a gold box deal for $99 I would jump on it for the name and durability of a Sony product. But not for $20-30 more than that. I think you can do better.", "Date": "June 6, 2013"}, {"Title": "Might be ok if it wasn't defective", "Author": "JM", "ReviewID": "R12YSJEGQACCE3", "Overall": "2.0", "Content": "(Not Amazon's fault; I bought it locally.)  The camera seemed easy and intuitive enough to use, but the latch over the battery and memory card was so flimsy that with the card inserted, the pressure (spring) from the card pushed the door outward enough that the memory card no longer made contact.  Granted, even great things can have a defect now and then, but this just seemed cheaply constructed.", "Date": "May 7, 2013"}, {"Title": "Not good enough", "Author": "G. Perez \"Always having fun!\"", "ReviewID": "R3E1P43X1X0MSE", "Overall": "3.0", "Content": "Let's get one thing straight, more megapixels DO NOT mean better picture quality, and this camera proves my point. It sounds great on paper, it has all these awesome features, but what good are they if the picture quality is mediocre? Is it really worth carrying this extra bulk around as opposed to just using your cell phone? It's not. In all honesty, iPhone 4th generation and above, takes better pictures.I guess it's not a bad deal when you consider the price, but you're still better off with a good cellphone camera.I would only recommend this camera for people who do not currently own a smartphone from 2012 and above, otherwise, just stick to your cellphone camera, save yourself some carrying space and money.", "Date": "May 23, 2013"}, {"Title": "I think my iPhone takes a better picture", "Author": "Karen in Mommyland", "ReviewID": "RFH3UMDRPXQQO", "Overall": "2.0", "Content": "I should start off by telling you that I really don't like point and shoot cameras.  I almost never get decent results from them.  I've spent the past six years shooting only with a Canon DSLR (Canon EOS Rebel T3i 18 MP CMOS Digital SLR Camera and DIGIC 4 Imaging with EF-S 18-55mm f/3.5-5.6 IS Lens) or my cell phone.  For my children, my usual go to brand of point and shoot cameras has been Kodak (Kodak Easyshare M530 12 MP Digital Camera with 3x Wide Angle Optical Zoom and 2.7-Inch LCD (Carbon)) simply because the cameras typically give them good results and are very user friendly when it comes to choosing different modes (portrait, sports, low light, etc.).  Recently I had mentioned to my husband that I probably should get a little point and shoot camera that I could slip in my bag or pocket for those times when I don't really want to lug my DSLR all over the place but might still want to take pictures.  When presented with the opportunity to review this Sony camera I figured it was worth a shot.What I like about this camera is it's compact size.  I also like that it has a rechargeable battery.  I refuse to buy any point and shoot camera that runs on regular batteries, so the rechargeable battery is certainly a plus.  Appearance wise, the camera looks nice.  What I like about the camera pretty much stops there.I found this camera to be a pain in the rear as far as navigating the menu to change settings was concerned.  They make it near impossible to play with the settings easily.  In that area, every Canon and Kodak point and shoot I've ever operated has Sony beat.  The irritating toy like sounds this camera makes drove me crazy and convinced me that it was just a cheap camera that looked nice, but I still needed to take some pictures and see how they turned out.  I wasn't impressed.  The camera just doesn't take a very impressive picture.  I think my iPhone 4s takes a far better picture, and I'm really not all the impressed with the pictures my phone takes.  I honestly expected better picture quality from a dedicated point and shoot camera.  I'm sure there have to be a better compact point and shoot camera out on the market than this one.  I would honestly keep looking if you're considering this camera.", "Date": "May 21, 2013"}, {"Title": "works ok i guess", "Author": "Caleb Shultz", "ReviewID": "R3KW5OWKUNN52P", "Overall": "3.0", "Content": "Picture quality doesn't seem any better then my old 8 mp sony  or my cell phone, probably a waste of money. Would have been more impressed if the photos weren't so grainy.", "Date": "October 19, 2013"}, {"Title": "MEMORY DEVICE REQUIRED", "Author": "Russell E. Owen", "ReviewID": "R38XTXFUJGF4BP", "Overall": "5.0", "Content": "You also need to also order a very expensive memory device to use it. It is totally useless without it.", "Date": "September 12, 2013"}, {"Title": "Sony camera", "Author": "Joan Van Fulpen", "ReviewID": "R2NF7AZXJDIPRK", "Overall": "1.0", "Content": "This seems like a nice little camera. It .. takes good pictures. I just wish that it came with an instruction BOOK .  I still have not mastered the use of it, I should not have to print the instructions it should have came with them.", "Date": "April 3, 2014"}, {"Title": "Great camera", "Author": "Manuel Alberto Díaz Lazo", "ReviewID": "R21PXZPKMYTSCJ", "Overall": "5.0", "Content": "Time for receiving was great, better than expected.Hope to use Amazon again for this type of items.5 stars for that", "Date": "January 21, 2014"}, {"Title": "Nice Camera for the price", "Author": "ritesh", "ReviewID": "RE5322KSW344W", "Overall": "4.0", "Content": "Overall Nice Camera . It Was a bit smaller than I thought it would be. But it was preety nice.", "Date": "January 3, 2014"}, {"Title": "Memory Card", "Author": "NitMM", "ReviewID": "R2UPMSRUA5R5WJ", "Overall": "4.0", "Content": "The camera is awesome but it doesn't brings the memory card, so read twice the product details and buy one XD.", "Date": "December 23, 2013"}, {"Title": "do not like new Sony Camera", "Author": "Mary Maskill", "ReviewID": "R1P9C5XOX1XW5G", "Overall": "2.0", "Content": "It does not work as well as my old one did. It is less user friendly and does not take pictures as good.", "Date": "November 19, 2013"}, {"Title": "Good for kids, until it dies its sad little death", "Author": "Personal Robot", "ReviewID": "R13JQGA50HR8UR", "Overall": "1.0", "Content": "Update (January 5, 2014): In just a few short months, this camera went from a great kids camera to a paperweight. It technically still takes photos, but they're blown out and marred by horizontal lines. Oddly, it still takes video just fine and does panoramas without issue. I have no idea what the problem is, but the camera has been replaced by a Nikon COOLPIX S31 10.1 MP Waterproof Digital Camera with 720p HD Video (White) for Christmas.Original Review (June 20, 2013): The big draw here over other low-end cameras is the 8x zoom but my title says it all: I'm not real impressed with the quality of the images, as I think the Sony firmware compresses the images too much which compromises image quality, making them murky and blobby when viewed close-up, but my 7 year old daughter took to the camera right away, figuring out its features and falling in love with it immediately. That zoom lets her get up close to all the things she wants pictures of - birds, bugs, trees, etc. And in her hands, over less expensive but less-capable cameras, she gets some great stuff. She's even had fun with the panorama feature, which she just stumbled on and figured out by the on-screen instructions.This camera wants to be the answer for adults who want a very compact point-and-shoot, but it simply isn't good enough for most adults when we all have smartphones that have similar quality cameras built-in and which are lacking only the zoom. I think most of us, if we are interested in good photos, are willing to shell out a bit more and get a better quality camera for that kind of zoom (or more) and better quality pictures. You're not going to find it here. But if you're looking for a solid \"second camera\" for you school-age kids, this might suit your needs.", "Date": "June 20, 2013"}, {"Title": "Average Camera for Fun Use", "Author": "A Customer", "ReviewID": "R3TOGXMOOZ5UDE", "Overall": "3.0", "Content": "Sony has a great name in electronics (although coming under attack), and is building a solid brand in mid-range digital cameras to compete with the Nikons and Canons of the world (myself, I'm a Nikon man after being a Contax man!).The average consumer will buy this camera because (a) it's a Sony, (b) 16 megapixals, (c) small size and (d) feature set.  For snapshots, fun use, little movies they'll be very happy with it.  For something beyond that, it will probably disappoint.For a point and shoot, I have a Nikon L26 which is very competitive to the DSC-W730, and I would choose the Nikon over the Sony for these reasons:-Shutter speed on Sony is slower (and the Nikon is not particularly fast), meaning that for fast action (sports, children, pets) you may miss the action-Menu system on Sony is more confusing than that on the Nikon-Build quality is a step or two below the Nikon (I've only used the Sony briefly and it doesn't seem as solid as the Nikon, which I've used for about a year and it is just as firm as the day I bought it)-Image quality is lacking-it might be using too high an ISO setting, or something else, but the pictures lack the Nikon's sharpnessOverall, it is a good camera but in this price range there are better choices.  Not a bad camera, just nothing special.", "Date": "June 14, 2013"}, {"Title": "Not Totally Intuitive....", "Author": "VW Smith", "ReviewID": "R2T6I7LHQJ3JHF", "Overall": "3.0", "Content": "Both this camera and the photo storage system it requires you to download \"PlayMemories\"  are not as easy to use for me personally as they have been for others.  I can't currently find the pictures I downloaded  into PlayMemories but there are a lot of previous pictures that are now handily stored in one central location.  Not the drive I wanted it on but hopefully it will switch easily.I was just getting started with this camera and I asked my teenager a question.  Within seconds he'd already set up the time, language and who knows what all else before I could stop him and do it myself.This camera really needs a small case to keep it safe and dust free.  I was able to use a small zip pouch I already keep in my purse- like a small makeup bag.  I'd prefer a harder case but this works for now.The pictures I've taken so far aren't amazing and I wish I'd sat closer to the front of the auditorium for graduation night.  It took great close ups of my garden from the upstairs window so it will just take some practice to figure out the best distances for pictures for different situations.I love the size.  Just like all cameras these days you'll have to buy a memory card- shop around so you'll know what's a deal and what's not.  I got an 8GB? card from Walgreens originally marked around $40 down to around $13. I just saw a 16 GB? card on Amazon for around $15.  We have 4 similar small cameras in our family so I'll have to compare pictures when we're all together.", "Date": "June 8, 2013"}, {"Title": "Average", "Author": "error", "ReviewID": "R31VL9PFH6CTFY", "Overall": "3.0", "Content": "This camera is just fine for someone just starting out, someone who doesn't take that many pictures and just wants something very portable around just in case, or for the kids.  However, if you're looking for consistently good pictures without weird blurriness/fussiness and something that takes good night shots, look elsewhere.  I have tried adjusting the settings but for some reason half of my pictures just come out fuzzy looking.  They're not utterly blurry by any means but you can clearly tell the difference between this camera's images and my other camera.  I'm guessing there's something wrong with the lens or some sensor.", "Date": "June 27, 2013"}, {"Title": "Very portable, but photo quality is so-so.", "Author": "H. Wang \"jwangamazon\"", "ReviewID": "R3FU4JGBWQ2MRD", "Overall": "4.0", "Content": "This Sony DSC W370 is light, and small enough to slide into a pocket easily. For people with big hands, you might want to attach a long strap to the camera to prevent dropping it by mistake. The menu system is pretty intuitive for settings. Nevertheless, this's a simple point-and-shoot, not much settings for me to play around. The screen is large and bright enough to see on a moderate sunny day. The small battery is the same as the one used in my Sony DSC-TX10. Be aware, the small battery won't hold too much charge (I learned it from using my Sony DSC-TX10), if you plan to use the camera for a long day, you should get a backup battery. The backup batteries are quite available in Amazon, with pretty good price.The built in flash is strong enough to improve the lighting condition for objects in 6 feet range. Time from power-off to photo taking is less than 2 second, which is good for this small camera. The delay between shot is about 1 second if no flash light is used. When flash light is used, you need to wait a little bit longer for charging the flash light, this is pretty typical for camera in this price range.The photo quality is just ok as the photo does not seem to be sharp. When shooting indoor where lighting is weak, you can see some grainy photos. The problem is less when shooting outdoor with good lighting.In video taking mode, the menu already declares that zooming noise will be captured by the camera. I usually edit my videos, so I can silent the zooming noise from the video clips. Not a big issue to me. When you move your camera around in video mode, the camera adjusts the focus continuously. This is a camera, not a camcorder. So, don't move camera too fast, this gives camera time to adjust focus continuously.The panorama mode is just for fun as the panorama photo quality is not very impressive. If you are seriously in creating panorama photos, I recommend to take still shots and create the final panorama photo with photo editing software.The 8x lens is a big selling point for such a small point-and-shoot camera. But the image stabilization does not seem to be strong enough. So, you need a very steady hand to take advantage of the 8x lens, otherwise the photo will be blurry.All in all, for price under $100, this would be a good buy. For price in the $130 range, there might be better options around.", "Date": "June 25, 2013"}, {"Title": "Cute", "Author": "Shilohna", "ReviewID": "R3DX7LGE8A83CB", "Overall": "3.0", "Content": "I bought this as a Christmas gift for my sister. It is pretty small and neat which is good. Fits nicely in the hand and the colour is beautiful. My sister isn't into anything too \"techy\" so she is happy with it's lack of features. However for me was a bit of a drawback. Also it uses the usual sized SD card so that meant having to go search for one. Fortunately they sell micro memory cards with the adapter to change the size. But take note of that! Good thing I opened the box and checked that before I gave it to her! That and the minimal feature made me give a 3 star score.", "Date": "December 31, 2013"}, {"Title": "Serious let-down from DSC-W690", "Author": "Lester W. Miller \"TBear\"", "ReviewID": "RLZ1XSLO9U79U", "Overall": "2.0", "Content": "My first Amazon review!  I have owned three Sony compact digitals in a row, weirdly, each of first two were stolen.  The build got worse by model.  I forget the first, but second was W690.  Really appreciated the glowing gold light it sends out for indoor evening shots to focus and maybe set flash intensity.  But this one has too much lag time until shutter goes, and I use it at a very low MP setting (16.1 MP is nuts in a basic snapshot).  I am seriously unhappy with this one, and was happy enough with prior two to order without thinking.  The 690 is still available, for almost double, and I may order it and give this away.  I prefer to not have to re-learn another company's menu system.", "Date": "October 30, 2013"}, {"Title": "Disappointment", "Author": "Linda", "ReviewID": "RFOZWP7FKCS7", "Overall": "1.0", "Content": "My family and I have owned several Sony Cyber-shot cameras and always been pleased with them.  However, this one just doesn't measure up to the others.  Despite adjustments to correct the problems, photos are still blurry and have too much noise.  Returning this camera and will try something else.", "Date": "September 1, 2013"}, {"Title": "Ok for daylight, unusable otherwise", "Author": "Ccl", "ReviewID": "RI2KBPQD8ULL0", "Overall": "1.0", "Content": "This camera replaced a Canon Elph SD450 that was over 7 years old and only 5.1MP. I am sad to say this camera pales in comparison to that relic. Most pictures went straight to the garbage as the camera had trouble focusing in any mode in less than the brightest situations. Perhaps it is the small sensor. It wasn't worth the $99.99 I paid for it and I returned it back to Target.", "Date": "October 30, 2013"}, {"Title": "Barely better than a modern cameraphone", "Author": "Shane O. Laake \"camera nerd\"", "ReviewID": "R13P8K1EUYWQ8B", "Overall": "2.0", "Content": "I wanted to like this camera, as I can always use a good camera handy (my smartphone has a crap camera).  Sadly I'm not too enamored with this.  Its small, but again next to a camera in gadgets many of us already carry, it's got to add value.  The value here is negligible.  I like the sweep panoramas, but that's coming to more phones.  The zoom is nice, and honestly a few years ago an 8x zoom on a camera this size would be breathtaking.  The problem is that the quality is simply bad.  The image quality is really all that I was concerned about, and it's not good.  it's both grainy and lacking into detail as processing smears stuff.  If you can get this for a great price, then maybe as a camera of last resort.  Otherwise, pay a bit extra for a better smartphone.For those without smartphones: I think the need for a small camera may be greater in this scenario, but expectations should be beyond what's delivered here.  I'm not too familiar with other options, but check those out first.  They should be better.", "Date": "June 15, 2013"}, {"Title": "Buy it at Best Buy $89", "Author": "Redstorm \"Rick\"", "ReviewID": "R2FSBLUTJRHR21", "Overall": "1.0", "Content": "It's cheaper at the store. Otherwise I can't say much more because I don't own one.  Try one out at Best Buy.", "Date": "March 12, 2014"}, {"Title": "unfortunate quality control", "Author": "mgoodyear", "ReviewID": "R2OPI88Z5KOMFH", "Overall": "1.0", "Content": "I'm writing this only to fill in some details not in the item's description:  The lens is said to zoom from 25 to 200mm equivalent.  The camera is tiny, just a little over 3 1/2 inches across, less than 2 inches high and less than 1 inch thick - very pocketable, but I might have had difficulty operating it without pushing buttons accidentally.  But I'll never know for sure; before you can operate the camera you have to tell it what language to use and what the date and time are, and the button that's supposed to say \"OK\" to the language selection wouldn't function so I had to send the camera back (thank you, Amazon - you're the best).If Sony's quality assurance is that poor, I don't want a Sony, no matter that I was intrigued with the Zeiss lens (made under Zeiss license anyway).  One more thing: the battery has to be charged in the camera, which I found a bit awkward.", "Date": "February 16, 2013"}, {"Title": "awful!", "Author": "margarita", "ReviewID": "RC6M6TF7YVQ6J", "Overall": "1.0", "Content": "the worst camera ever. It takes bad pictures, blurry, low quality. There is no warning that the battery is going to be low - it just shuts down and you cannot take any pictures. I fully charged it before my trip and after 5 days the battery was gone.It is a total waste of money.", "Date": "November 3, 2013"}], "ProductInfo": {"Price": "$139.99", "Features": "16.1 megapixel plus 8x optical zoom captures detailed subjects\nOptical SteadyShot Image stabilization with 2-way active mode\nCapture your videos in 720p HD Movie mode¹\nCreative shooting with Picture and Beauty effects\nAdvanced Flash illuminates distant subjects for beautifully lit photos", "Name": "Sony DSC-W730 16.1 MP Digital Camera with 2.7-Inch LCD (Silver)", "ImgURL": "http://ecx.images-amazon.com/images/I/419xt6hFe1L._SX300_.jpg", "ProductID": "B00AQDG99M"}}