{"Reviews": [{"Title": "good image quality, bad user interface", "Author": "Alberto Vargas", "ReviewID": "RMI0AANJDXT0I", "Overall": "3.0", "Content": "Here is how I came to buy the Nikon 1 J3:During a recent trip, I discovered that my new Moto X phone took amazing photos and my old digital SLR was just too big & heavy for most occasions. So I started a mission to find something smaller and lighter which would partly or completely replace my SLR and take better photos than my phone. Note that most point-and-shoot cameras do not take better photos than the recent generation of phones, and in fact have the same sensors if not worse. Some sort of mirrorless large-sensor system seemed to be the answer, and I tried the Nikon 1 and others.In a nutshell, the Nikon 1 J3 is an outstanding camera with a terrible user interface.GOOD:- Takes good photos in all types of light. Press the shutter and it takes a photo right away, freezing the moment. No second guessing. Can't say that about most other cameras.- Super fast autofocus. It may well be quicker than most SLRs even. This camera is probably better suited for kids and sports photos than anything else you can buy.- Very high frame-per-second rate for full-sized photos. 15 fps with autofocus, 60 fps without! This is better than practically all other cameras on the market right now. I personally prefer the more sedate 5 fps which is still better than entry level SLRs :)- Good auto white balance. The photos come out looking natural, with good skin tones, etc.- Small and light. The kit lens has an interesting folding design to make itself more compact. This camera is smaller than all other interchangeable-lens mirrorless systems, as far as I can tell.- You can get some decent bokeh (blurry background for portraits etc) with the kit 10-30mm lens with big aperture plus remotebackground. Not as easy as APS-C or full frame sensors, but at least doable.- Clever \"unlock the lens and turn the camera on\" feature. No need to press the on/off button. Hard to describe but very handy. I wish other manufacturers did this too.- Even when noisy, the photos have an \"optically fuzzy,\" instead of \"digitally smeared\" look when viewed 1:1, which is a better and more pleasing noise reduction than many other manufacturers and cameras offer.- Instant access to HD video. Press the smaller button with a red dot on it from any camera mode.BAD:- Although it is small and light, and fits in a jacket pocket, this camera is bulky. The kit lens protrudes enough to make it look like you are carrying a good old rock in your pocket. I wish it were flatter. Still, much smaller than any SLR.- The mode selector wheel on top is useless. Normally you expect to find Auto mode + PASM. Here you get Auto + 4 weird and semi-useless modes which were probably conceived for the Japanese market. PASM is hidden under the menus of one of them. The other ones are \"automatic selection of the best photo\", \"take a slow motion 1 second clip before snapping a photo\" (WTF?) and advanced movie mode (which is useless since you can record HD from any mode with a dedicated button).- The camera is too menu driven for what it is. See above - PASM and scene modes are buried under menus. I like changing between P, A, and S. (On this camera, S is the most useful mode in my opinion.) HDR is hard enough to get to that I never really use it.- You can't hold this thing one-handed. It is very smooth and there is no finger hold on the right. Why? Even basic point-and-shoots have some little ridge, and SLRs have a big bulge for your right hand to grab.- Auto ISO tends to pick the highest allowed ISO (in my case, 3200) too often when indoors. I wish it would instead try to take a lower-exposure photo instead and let you handle it in post-processing.- No automatic orientation for photos and videos. Are you kidding? I had to flip all my vertical (portrait) orientation photos by hand  in Picasa or Lightroom. Good luck flipping a video file. Any smart phone can do better. My 5+ year-old cameras can do better than this.- Lens cap. Annoying. I like using hoods on my SLR lenses so the lens is protected when open but this is not an option here. Given the puny zoom range, I wish this were a fixed lens self-capping design (like any point-and-shoot).- Noisy raw photos. I tried taking a few indoor shots in NEF, Nikon's raw format. The luminance and chroma noise were shocking. I will stick to JPEG since the image processor does a good job taming the noise in a visually pleasing way. I do not want to waste my time in Lightroom or some other software on this issue.- High frames per second are a bit of a waste of time and storage space. 15fps produces a flood of nearly identical photos that take a while to wade through, and can clog up your storage card. I find it impossible to take a single photo in 15fps mode, while it is doable in 5fps. In 15fps mode, the camera occasionally loses focus (it autofocuses in between frames) and then finds it again. I am sure 15fps and 60fps have their use, but they don't appeal to me yet.- Short battery life. 300 photos maybe? You may last a daytrip if you don't do bit multi-frame-per-second bursts or video.- Image quality is visibly below SLR level. My 5+ year-old APS-C sensor DSLR with the 50mm 1.4 Canon lens (and half the megapixels) utterly destroys this Nikon 1. Better sharpness, color, noise, bokeh, level of control over the camera, etc. That said, that lens alone costs more than what I paid for this Nikon package on sale. Still, it is good to keep things in perspective. The Samsung NX series has equal or worse image quality compared to Nikon 1 (with kit lenses), so it is not just the sensor at play here but every element in the imaging chain.VERDICT:- Great for kids, sports, and low light situations. Better than an ordinary point-and-shoot camera in terms of speed and image quality. The responsiveness, fast focus and frames per second are on par if not better than an SLR at a fraction of the weight and size.- If the camera were more compact, like the Sony RX100 (which has the same sized sensor and is very fast too), I would be in love with it. As it is, it is too bulky to be pocketable and my daily companion, and I am still not sure if I want to keep it.UPDATE JANUARY 2014:- I returned this camera to the store. Instead, I got a Sony NEX 3N and I love it. It is lighter and yet is has a larger sensor, flip screen, wider angle kit lens, and vastly better ergonomics (plus it costs less). Feel free to check that camera out. It also does 4 frames per second, which is not as fast as the Nikon but enough to capture sports or kids in motion.", "Date": "December 25, 2013"}, {"Title": "Only the first day", "Author": "Jeff", "ReviewID": "R1PHGAQ6CTB312", "Overall": "5.0", "Content": "Five stars for the excellent photo quality,usability, lightness of the camera and ease of interchanging lenses. I am by no means a professional photographer but decided to step up the quality of photos from my old point and shoot digital camera. After taking a variety of photos and video with this camera over the course of an hour or so the quality of both are incredible and I found the camera very simple to use. It does have a steep price tag but for me it is an excellent camera! I will miss the gps capabilities of my old camera, but the higher quality pics make the trade off worth it for me.", "Date": "April 3, 2013"}, {"Title": "The best camera is the one at hand", "Author": "Laercio Albuquerque", "ReviewID": "R10FG60S1GSC1E", "Overall": "5.0", "Content": "I own a Nikon DSLR with some lenses and I would rank myself as an amateur photographer, mainly focused on travel and family (my 3year old son mostly) photos. Both are areas in which the camera really excelled my expectations.First, the camera is, if I can call it, a “small DSLR” in terms of capabilities. Second, with the FT-1 mount (too expensive, but cheaper than having to buy extra lenses), it is compatible with my Nikkor lenses. Third, the super-fast focus which is great for capturing my son’s deeds, especially with the Best Moment Capture Mode (Great feature!!!). Finally, it is light, small and always at hand (the main problem with my big DSLR). So, if you own a Nikon DSLR it is a sure purchase.", "Date": "May 9, 2013"}, {"Title": "Wonderful step up from my point and shoot", "Author": "June Slusser \"dog lover\"", "ReviewID": "RSBDW8IP3PZEF", "Overall": "5.0", "Content": "I took this on a trip out west and brought back over 500 high quality photos from our vacation.  The camera is extremely easy to use and the interchangeable lenses provides options usually only achieved with the larger SLR.  Great camera.", "Date": "July 29, 2013"}, {"Title": "Overall great purchase", "Author": "Darren", "ReviewID": "R2SUVMA1WBUVSG", "Overall": "4.0", "Content": "Overall great buy. Produces great photos, has a great feel and touch, the additional lens kit in the package is added benefit.The only things I wish it did have, in case they're important to you are:- Time Lapse setting- More automated settings- Wifi", "Date": "November 27, 2013"}, {"Title": "you wont regret it.", "Author": "Chili POP \"the improv frog\"", "ReviewID": "R1MAPUSWDEFP5R", "Overall": "4.0", "Content": "Cute, and easy to use. I have a Nikon digital SLR D3200, and I use the Nikon 1 J3 alot more. Dont get me wrong...the full DSLR 3200 is a better camera for the professional photographer, but for my every day needs, I use the Nikon 1 J3.I bought the all white model, and whenever I pull it out, everyone wants to take a look at it.It takes a little getting used to the front heavy aspect, when you have a Nikkor 100mm lens attached, but I got used to it pretty fast and take this camera with me every where.", "Date": "December 30, 2013"}, {"Title": "Great Camera", "Author": "Jeremy Clark", "ReviewID": "R2JGDFJNFJ2YTU", "Overall": "5.0", "Content": "This camera has been great.  It's easy to use and takes fantastic pictures and videos.  It's super light and great for travel as well!", "Date": "August 20, 2013"}, {"Title": "Great camera", "Author": "Andrea Brown", "ReviewID": "R2Z40EJ8C5461M", "Overall": "5.0", "Content": "This camera takes the most beautiful, clear pictures even in low light. Easy to use and lightweight. Great Christmas gift for myself!", "Date": "December 9, 2013"}, {"Title": "goog quality", "Author": "Wen-Juan Liu", "ReviewID": "R2QQZOBVED854M", "Overall": "5.0", "Content": "What a good camera!That is what I need !!! Finally I can \"catch\" my babies!Thank you for this very good product!", "Date": "November 12, 2013"}, {"Title": "Awesome", "Author": "Mahdy", "ReviewID": "R6FZGMJ2IVE0P", "Overall": "4.0", "Content": "I love this camera, not so much the zoom. Yes its lightweight  but the lenses get in the way. Going to buy the next lense it comes with.", "Date": "April 27, 2014"}, {"Title": "THE CAMERA", "Author": "phew thao", "ReviewID": "R1U8NLVEJZC540", "Overall": "4.0", "Content": "Everything I Wanted in a small package. The price is decent but overall it was the best present i gave.", "Date": "January 28, 2014"}, {"Title": "Love my Nikon J3", "Author": "Daniel Watson", "ReviewID": "RH8EC3Z6G330T", "Overall": "5.0", "Content": "I replaced both my Canon 60D and Olympus OMD with the J3.  I know that sounds crazy, but the auto focus is as fast as my 60D (the main reason for owning an SLR) and the image quality is better than the OMD.  The minimalist design is beautiful, the size is perfect (just took it to Disney World), the images are outstanding.", "Date": "December 5, 2013"}, {"Title": "Awesome camera!!", "Author": "Marvin H.", "ReviewID": "RGGHCXRNI3MPY", "Overall": "5.0", "Content": "I loved it, it was great. Shipped 2 weeks before it's eta. Great shape, brand new. Perfect! You will enjoy!", "Date": "May 19, 2014"}, {"Title": "Fantastic camera!", "Author": "A. Chalut \"Book Guun Guun\"", "ReviewID": "RKFXB68K32ZKO", "Overall": "5.0", "Content": "I originally purchased this camera for a trip abroad but was worried it would not do everything my D90 does.  I was wrong. It did more.  Easy to use, easy to carry, a pleasure to shoot with.", "Date": "April 27, 2014"}, {"Title": "Love it!", "Author": "Carrie Bradshaw \"love to shop\"", "ReviewID": "R2CA8XTXN5EXHZ", "Overall": "5.0", "Content": "I love this camera!  It does everything that I want and more.  Great photos!  My only 'complaint' is the lack of wireless transfer but the purchase of an Eye-Fi SD card handled that no problem.  I got a great product at a great price and could not be happier with this Nikon.", "Date": "February 10, 2014"}, {"Title": "Excellent", "Author": "Frank Hubbard", "ReviewID": "R2VJ9HT2UI86BS", "Overall": "5.0", "Content": "An excellent camera, almost too compact.  I purchased an attachment to make it easier to hold and it makes firmly holding the camera much easier.  The only negative comment I have is withg the shutter release.  It fits so smoothly in the camera case that I find it difficult to know when by finger is toiuching it.  There needs to be a small projection on top of the release so you will know when your finger is in contact with the shutterr release.", "Date": "February 10, 2014"}, {"Title": "Christmas gift", "Author": "Casey Yocom", "ReviewID": "R139A9NDJNCHX6", "Overall": "5.0", "Content": "The camera is exactly what my wife was looking for.  It looks great and functionality is superb. Best christmas ever!", "Date": "January 30, 2014"}, {"Title": "Great little camera, big with camera features.", "Author": "Lance Lemke", "ReviewID": "R15CQUHDPYZ07S", "Overall": "5.0", "Content": "My reason for purchasing this camera, was based somewhat on a suggesting of a photograph friend who uses a version of this camera.  Its performance by itself is great, and in low light it shines.  Plus with an optional Nikon FT1 mount, you can use your standard Nikon AFS lens with it as well, giving you 2.7 times the reach.  Really been impressed.", "Date": "January 26, 2014"}, {"Title": "A superb buy!", "Author": "Bill Nelson", "ReviewID": "R11H3F64WJRCEN", "Overall": "5.0", "Content": "I bought this camera as a gift for someone very dear to me. Her reaction continues to be overwhelmingly positive. This was the camera that won out over many \"brain-picking\" sessions that I had with professional photographer friends. Don't wait, BUY ONE!!", "Date": "January 23, 2014"}, {"Title": "excellent camera!!", "Author": "magala", "ReviewID": "R22C2A1UYC66PM", "Overall": "5.0", "Content": "it's just a great camera,it works on every enviroment and every light,everday I love it more and more!", "Date": "January 2, 2014"}, {"Title": "Best small camera purchase ever...", "Author": "Joe", "ReviewID": "R2VLMRF1C9TPG7", "Overall": "5.0", "Content": "The camera is efficient all around... Top quality the point and shoot feature gives superb picture quality.... Easy to handle and info is simple to use.", "Date": "December 23, 2013"}, {"Title": "A great little compact camera, but not much room for improvement.", "Author": "David Griffin", "ReviewID": "R3MIJF51ABNOKM", "Overall": "3.0", "Content": "I am an amateur photographer, at best. Having owned a couple of DSLRs before making the switch to this compact camera system.I love its low light performance, fast focusing, custom shot selections, and the selection of lenses that are available.What I dislike is its lack of options, when it comes to the flash, the microphone, and a remote shutter control. There is no hot-shoe for a flash to attach to, no external microphone jack, and the only option for external shutter control is to use the wireless adapter (sold separately) with an android or apple device. This camera is also in need of a grip on its right side. If you have tiny hands, this may not be a problem, but for someone like me, it's a big problem. Nikon does offer a grip, but it's a little on the expensive side, considering what it is.If I could do it all again, I would probably have gone with a different camera.", "Date": "March 17, 2014"}, {"Title": "Best of both worlds!", "Author": "Timothy Roberts", "ReviewID": "R2NLE828FZ823R", "Overall": "5.0", "Content": "I originally had a Canon point and shoot that I liked very much, but something was always missing... depth of field.  A friend brought is Nikon 1 J3 to work to take some videos.  I got to use it for a few minutes and that is all it took for to get hooked on this compact DSLR.  I was able to play around with it this past weekend and it did everything that I wanted!  The pictures that I took came out great and I love the slow motion that it is able to do.  I haven't been able to try out all the features yet but I am extremely happy with the purchase.The camera is lighter than a normal DSLR but has the same sensors and has a very good response time.  I press the on button and it is ready to go.  I don't have to wait for it to start up like my older point and shoot.  I also like that when I press lens lock button on the side of the lens and extend it out the camera comes on automatically and shuts off when I retract the lens.The only thing I wish I would have done was purchase the option with the second lens; other than that I am very happy with the camera.", "Date": "March 3, 2014"}, {"Title": "Fantastic!", "Author": "Katie Cavaliere", "ReviewID": "R1A8TI0U4PNUJV", "Overall": "5.0", "Content": "This camera is AMAZING! its light and small enough to put in my bag when i'm on the run or climbing. Having the two zoom lenses makes for incredible range and changing them easy. the in camera edits are awesome. it takes some getting used to but i love my camera and the quality of photos it takes. worth every penny.", "Date": "December 13, 2013"}, {"Title": "it's a winner", "Author": "dan w", "ReviewID": "R3V07JKE8OHOCW", "Overall": "5.0", "Content": "with retirement looming, i began seeking out a hobby. i choose photography, someting i enjoyed when younger. knowing my wife would also like to take pictures i purchased a nikon 1 v2 for myself and a nikon 1 j3 for her. I am very happy with both purchases. i love the fact they share lenses.  I knew that i wasn't getting the best nikon camera but this is all i needed. Better than a point and shoot but versitle enough to take great travel photos.", "Date": "November 30, 2013"}, {"Title": "Lightweight and easy to use", "Author": "Cora Cadavona", "ReviewID": "R6YU3CL2J024A", "Overall": "4.0", "Content": "I keep this camera in my bag because I use it on a daily basis.  It's easy to use, the batteries last very long and lightweight.  The shutter speed is just a bit slow so there's a delay when taking pictures.  Pictures turn out very nice.", "Date": "June 5, 2013"}, {"Title": "Superfast autofocus", "Author": "Jake White", "ReviewID": "R2860NT5HE5Y25", "Overall": "5.0", "Content": "We have 2 young children and wanted a camera that shot pictures that could be framed around the house not just posted online.  We can capture moments that were previously just missed.  We plants get the pancake lens for summertime pocket carrying.Couldn't be happier.", "Date": "April 17, 2013"}, {"Title": "Camera gets hot and shuts down after just 30 minutes of video.", "Author": "Enrique Gutierrez", "ReviewID": "R2YUSS43T27UY", "Overall": "3.0", "Content": "Yes, very strange, but during our family summer vacation 2013 using this brand new Nikon 1 J3, while taking video, the bottom part of the camera got extremely HOT until the point where it shut down, and had to wait (10-15 mins) until it came back up.The quality of the photos, usability, weight, battery time, etc. are very very good (coming from a Canon guy). That's why 3 stars only.", "Date": "August 29, 2013"}, {"Title": "No viewfinder", "Author": "Yankee Photographer", "ReviewID": "R1JYAY4HF3UMTY", "Overall": "4.0", "Content": "This is one of the best cameras on the market that has all the right stuff- except for a viewfinder which makes it VERY difficult to see the image your taking a photo of especially if its sunny outside.Otherwise you will love the video and photo quality.", "Date": "July 24, 2013"}, {"Title": "Nikon", "Author": "Lynnie \"Lynnie\"", "ReviewID": "R1EH3ISTWIQWWH", "Overall": "4.0", "Content": "Love Love the camera please read all the reviews it is great in low light and in bright. It lost stars because it came packed so poorly was surprised it wasn't damaged. It also dropped $28 and seller said I could send it back at my expense and get another. Will never use this seller again.", "Date": "March 16, 2014"}, {"Title": "Nikon 1 J3 14.2MP camera with 10-30mm VR 1 NIKKOR Lens (Black)", "Author": "Milic Bogdanovic", "ReviewID": "R3CY9620T1Q08N", "Overall": "5.0", "Content": "This Nikon 1 J3 14.2MP camera with 10-30mm VR 1 NIKKOR Lens (Black), great easy to use compact camera, very happy, still learning how to use all features of this camera. I order an extra battery, but have not used camera enough to drain the battery. I was use to my Lumix camera, so there is a learning curve with this Nikon.", "Date": "March 14, 2014"}, {"Title": "Great little camera, and came earlier then expected!", "Author": "Shawn J. Jansepar \"shawnjan8\"", "ReviewID": "R1TFTZ2FNSAABJ", "Overall": "5.0", "Content": "Bought this camera as a gift - came early and in one piece. Great device - very compact and takes great photos.", "Date": "March 9, 2014"}, {"Title": "Favorite camera!", "Author": "Araseli Cardoza", "ReviewID": "R1G6PXMJF29NAL", "Overall": "5.0", "Content": "I love the color I chose! The camera is light and I love how the pictures look! I would definitely recommend this camera to anyone!", "Date": "January 15, 2014"}, {"Title": "Great little camera - great lens", "Author": "Harley Man \"Ed\"", "ReviewID": "R2LLCKHW1VUC80", "Overall": "5.0", "Content": "The only thing missing is a view finder, but the cameras I considered with view finders were three times as expensive.  The camera does everything I want.  I wanted a fairly automatic camera - this camera has all the functions I think I need.", "Date": "June 25, 2013"}, {"Title": "Nice Camera", "Author": "Latoya", "ReviewID": "R2WUM5TKE8Y1OR", "Overall": "5.0", "Content": "Takes really good pictures. Can look kind of weird with some of the bigger lenses but the quality of the camera surpasses my point and shoot. I'm an amateur photographer so it suits me fine.", "Date": "June 24, 2013"}, {"Title": "Great Camera", "Author": "Christopher", "ReviewID": "R3I25ORUQQJVD", "Overall": "5.0", "Content": "I purchased this camera because I wanted something better than my cell phone that would be compact to carry around.  This camera is about the size of a compact point and shoot without the lens attached and with the lens, it's not much bigger.  You get SLR quality photos in a package that's a lot smaller.  The only drawback to the camera is the auto-focus doesn't offer much versatility.  The camera's AF will focus on whatever is the closest thing in the frame.  It makes it a little more difficult to produce the artistic, background in focus, subject blurred and vice versus type pictures.  But since it does have AF, it's a great camera for those looking for more than a compact point and shoot but don't need or want the bulk of a DSLR.", "Date": "May 26, 2013"}, {"Title": "awesome camera", "Author": "Kathy", "ReviewID": "R10SSOXOJSDWO2", "Overall": "5.0", "Content": "takes great action shots, is very handy and compact extra lenses has been great for all action shots clear and vivid", "Date": "March 19, 2014"}, {"Title": "My daughter LOVES this camera", "Author": "Edward Higginbotham", "ReviewID": "R3TL0N3KBIHKBO", "Overall": "5.0", "Content": "One of my best memories is that God allowed me to be in a position a few years ago to buy my beautiful daughter over 12,000 dollars worth of Canon equipment (EOS 5D and top notch lenses) which she really likes.  She likes this little Nikon just as much but for different reasons.I don't think you can go wrong with the Nikon 1 J3 as an \"almost\" pro-sumer purchase.", "Date": "February 24, 2014"}, {"Title": "great camera", "Author": "Wetpaws", "ReviewID": "R1J5RLP8OJJ0P1", "Overall": "5.0", "Content": "Takes great pictures easy to use just the right size for my Daughter to use. She loves it.  very well made", "Date": "May 18, 2013"}, {"Title": "Compact with big performance", "Author": "Matthew Trueman", "ReviewID": "R1Z7Z163EF08YI", "Overall": "4.0", "Content": "I bought this for when I am on my travels and I simply can't take the DSLR due to lack of space.The auto focus is very good, takes great pictures and is simple to use with manual control when required.", "Date": "March 31, 2013"}, {"Title": "Good beginner's camera", "Author": "Jennie L. Powers", "ReviewID": "R35F6PTJQPTKVU", "Overall": "5.0", "Content": "I love this camera! I am just a beginner photographer, meaning I have taken no classes and I love learning how the different functions on the camera work!Great Camera!", "Date": "May 9, 2013"}, {"Title": "As expected.", "Author": "Taka", "ReviewID": "RIY7RP3MG9GVQ", "Overall": "5.0", "Content": "Did my homework before I got it.  (checked reviews on blogs, watched reviews on youtube) all the pro's and con's were there.", "Date": "March 29, 2014"}, {"Title": "Great camera", "Author": "Karleen Junglov", "ReviewID": "R2285QWYNETTLR", "Overall": "5.0", "Content": "I got this the day before we left for vacation.  Easy to use and takes great pictures.  Very happy I bought it", "Date": "August 9, 2013"}, {"Title": "Love the camera!", "Author": "Shaiza I. Khan \"Waleen\"", "ReviewID": "R37J0IK03MTE86", "Overall": "3.0", "Content": "Love the camera! However the picture quality is no match to a SLR camera.I love the zoom lens! It needs a very good image stabilizer though. The pictures on a tripod with the zoom are better.", "Date": "December 2, 2013"}, {"Title": "Not so great", "Author": "Matthew H. Mullen \"stuff\"", "ReviewID": "R2Y0HP86NNBFN9", "Overall": "1.0", "Content": "Does not alwaysd focus on the subject you want it to.Can't see the viewfinder in bright sunlight (basically any time you're outside on a sunny day).", "Date": "July 10, 2013"}, {"Title": "good camera", "Author": "machinistmate", "ReviewID": "R1OQ2DKC2J4AG", "Overall": "2.0", "Content": "it feels like i wasted my money on buying the j3. sure it has good features and everything but i could have gotten those features with a different camera at a cheaper price or with more features with the same price. they marked down the prices which makes me feel more of a sucker.", "Date": "December 24, 2013"}, {"Title": "neat but not great", "Author": "Debra", "ReviewID": "RDONLB1IVBUMX", "Overall": "4.0", "Content": "The camera did some really neat things and was very fast, but the picture quality was not what I expected.", "Date": "October 31, 2013"}], "ProductInfo": {"Price": "$499.00", "Features": "14.2 MP super high-speed AF CMOS Sensor\nShoot 15 fps w/ autofocus\nWi-Fi Connectivity with WU-1b adapter (not included)\nBest Moment Capture - view live images in slow motion", "Name": "Nikon 1 J3 14.2 MP HD Digital Camera with 10-30mm VR 1 NIKKOR Lens (White)", "ImgURL": "http://ecx.images-amazon.com/images/I/4197vSCY9uL._SX300_.jpg", "ProductID": "B00AY6MAY4"}}