{"Reviews": [{"Title": "So far I'm loving it!", "Author": "graysonsmom \"graysonsmom\"", "ReviewID": "R31WM6RONTFTAT", "Overall": "5.0", "Content": "I have had my S1 for just 2 days. I also purchased the Sony NEX-F3 and I'm leaning towards keeping the Nikon 1 S1. Both are taking great images and are both easy to use and navigate through the menus. I am using prime lenses on both (f/1.8). I need to also play around with the kit lenses some. I love the nikon feature of taking a video of my two little ones and being able to also take still photos. One of the features that most appealed to me and it works great! With big moments like their first steps, you can have a video and stills. Genius! The s1 is my favorite so far bc of that feature, as well as it being smaller and lighter. I was able to put it in my north face fleece jacket pocket this morning. Both cameras have been able to keep up with my kids moving so quickly as well, in low light the images aren't AS sharp as my dslr (nikon d5000) may be, but they are not blurry like my point and shoot type camera or my iphone 4s and with more practice, I'm sure they will improve or with using the flash. I'm actually considering selling my dslr now. This is the perfect camera for us because it keeps up with our kids' speed, has the simultaneous video and stills, and is small enough to fit in my diaper bag or carry around while taking pics of my 2 year old and 6 month old. Much more convenient than my big Nikon d5000. I researched for weeks and read so many negative reviews online from professional photog websites and blogs, so I kept second guessing my desire for the nikon 1, but I should have just ordered it weeks ago. I can't review the service on here bc I ended up ordering from an online photog store, but amazon always does a great job for us. I will update later, but wanted to review since I couldn't find many reviews when I was shopping. And just a side note, I'm not a professional photog, just a mom wanting great pics of her kids. I have taken a short course on taking pics in manual so I do know a tiny bit, but the nikon s1 would be easy for a beginner bc of the menus having descriptions of what aperture mode or shutter priority is. It's so easy!", "Date": "March 8, 2013"}, {"Title": "Very good as a back up camera.", "Author": "M. Koch \"clickitgood\"", "ReviewID": "R3UNTAPZPP5BAS", "Overall": "4.0", "Content": "Seeing as how it costs much less than the enthusiast models like the Canon s120 or Panasonic LX7 and so on...I believe it makes pictures just as good or better than those cameras.  The benefit this has over enthusiast models is the larger sensor (same as the RX100 but half the price) and the ability to buy lenses that will increase photo quality.Pros:Quick FocusingGood shot to shot time (could be better)Nice effects in cameraNice placement of video buttonVery effective auto modeGood color renditions even in mixed light15 fps is really great with kidsBacklighting mode is a great HDR tool that captures more tonality than my SLRQuick access to shooting modes, drive, flash, and exposure compensationGood Battery LifeCons:No Panorama Mode!No touchscreen, Wifi, Touch to focus, or GPSCannot operate flash while camera is in anything but single shot driveFiddly menu and menu diving if you are not happy with auto resultsNo vibration reduction and slow lens (but makes the lens more compact)Backlighting mode is only appropriate for slow moving objects.You get what you pay for.  A lot of my cons are items that would increase the size/cost of the camera and I would not like it if it was any bigger or more expensive.  I feel it fits a sweetspot as a family camera that can be serious if you are patient with the menus.", "Date": "October 29, 2013"}, {"Title": "Get camera with tons of features", "Author": "Padlocked", "ReviewID": "R1MAHHBZVEW8NT", "Overall": "4.0", "Content": "I own several of Nikon's mid-to-high end DSLR cameras.  I wanted something a little more compact that I could carry around to capture everyday candid shots while traveling and something I could use to teach my wife and daughter more about photography.  This camera has so many functions it can be hard trying to remember them all.  It has most of the features you would find on the upper end DSLRs like shutter and aperture priority, plus a host of many other features.  We have not purchased or attempted to swap lenses yet but the collar mechanism seems just a solid as other Nikon builds.", "Date": "August 9, 2013"}, {"Title": "The BEAST in Pink", "Author": "Josh in FL", "ReviewID": "R1H4FURKWIA4HI", "Overall": "5.0", "Content": "This little camera is unbelievably powerful.  Bought it for my wife as a point and shoot because she doesnt feel comfortable taking the D7000 everywhere.  The photos in \"Auto\" on this camera are sensational and it is really easy to use.", "Date": "April 2, 2013"}, {"Title": "First Impressions: A new take on proven first gen. N1", "Author": "Gum Shoe Mike", "ReviewID": "R2RZCR8JKIG0YJ", "Overall": "5.0", "Content": "It just been a few days with the Nikon 1 S1.  I lost my original first generation N1 V1 camera, so I have few lens with no body.  I will be using a neck strap, even tho you could put this camera in a pocket.  I like the output from the 10.1 MP Sensor.  There is a newer 14 MP sensor, but I don't feel like its completely different level of image improvement for my needs.  I plan on having two N1 bodies someday, just going with the smaller sibling first.  The N1 S1 has no AA filter, I guess a new trend lately.LikeNo mode dial means it won't get in the wayAnother kit lens optionIt nails focus fastBounce FlashSlow ViewCan add lens for range of f-stops not available on point shootsCompact and LightNo touchscreen means it won't get in the wayScreen is bright and colors look good for 460kNo compromised short Powerzoom lens, longer PZ in lineup already.DislikesPlayback of images on display options (3) (1) no information  (2) basic (Jpg#, Date, Size) with no values for shutter, ISO, F range (3) detailed give you all values with histogram with small image.  I wish option 2 had different values.No panorama modeCould likeJust abit bigger for Hotshoe.  OLED display.", "Date": "February 27, 2013"}, {"Title": "Nice all around camera", "Author": "Raybina", "ReviewID": "R1YQP343BYNSZZ", "Overall": "5.0", "Content": "I have been shopping around and the Nikon series was not originally on my short list.But when I came upon this deal for a two lens camera, I could not resist.  Having owned a Nikon D50 for over 6 years, i decided to stick with the brand.My main objective was to have a small camera, didn't have to fit in pocket, that was able to shoot indoors with or without the flash, by the way the pointing up of the flash is a great feature, and be able to take shots at outdoor sporting events, like kids soccer games or bring along to the race track.I rated this camera a five since I was well aware that it was going to be a plastic body when I ordered it and for the color, I actually like it.After my first two weeks, I have taken some of the most amazing pictures ever.  I'm thinking that the fact that I had the camera with me at the right time helped also.An added bonus is the video.  I am sorry that I had purchased a Sony Camcorder a couple of months ago- I went on a recent trip to visit my grandchild and did not take the sony out of the case once.  I had more than enough good footage from the Nikon.So if color is not a preference and the price drops again, I would highly recommend this camera for the beginner to the more serious user.", "Date": "October 16, 2013"}, {"Title": "Nikon S1 - Great Camera like other Nikon 1 but I prefer the J1 or J2 over this model", "Author": "Shawn C.", "ReviewID": "R2F6M46JM8V68A", "Overall": "4.0", "Content": "Excellent Compact Camera that is very capable.  I am owner of Nikon J1 and V1.  I bought this because of the low price on a used one.  It's smaller than J1 (same size as J3) and essentially all the features of J1.  I like the pop up flash on this one better because it can be tilted to bounce the light manually.  Still, the controls are not as good as a J1 in my opinion.  I don't like the new graphic menu system and much prefer the older menu as I was able to navigate it more quickly.  The new menu reminds of Sony Nex which I also thought confusing in how they organized it.  Also, you can get a better deal on a older \"new\" or \"like new\" J1.  I would personally get the older J1 for the better control than the S1.  I would even prefer J2 with same control as the J1 with better display and added features like panorama and art filters.  You are also able to turn the camera off by retracting the lens as a J2 like the S1. (I personally don't mind pushing the power button to turn the camera off.  Extending the lens to turn on is more essential than retracting the lens to turn it off anyways.", "Date": "November 6, 2013"}, {"Title": "Great purchase. Great camera", "Author": "Adele Z", "ReviewID": "R19SZ5OPZH7QGR", "Overall": "5.0", "Content": "I was researching small cameras to go on a flight/cruise. Just didn't want the bulk of my larger camera with different zoom lens on a trip with a lot of day trips in European countries. This was perfect ~ not to mention the price was a couple hundred dollars cheaper than the lowest price I could find.", "Date": "June 6, 2014"}, {"Title": "Kick ass product...", "Author": "Enrique Darinel Gonzalez Campos", "ReviewID": "R2EFZVZQBUYSZP", "Overall": "5.0", "Content": "Excellent product, it exceeded my completly expectations...Once you have the camera, you know that you have a professional camera but easy to use...", "Date": "June 3, 2014"}, {"Title": "Little gem for discounted price.", "Author": "Art Mat", "ReviewID": "R1YVLJ6Y3KXEO9", "Overall": "5.0", "Content": "It is a great little interchangeable lens camera at discounted price ($200-$300 depending on kit)!In fact, it is one of two smallest and lightest cameras with 1\" sensor (Samsung Mini is the other one).11-27.5 mm kit lens is very sharp and well made while being light and compact. Nikon provides extended warranty for 5 years for this lens and it is the only movable part of camera and lens combo. S1 has an electronic shutter and a dust shield over the sensor.Yes, there are not too many direct controls but auto mode is excellent and manual controls are availed through menu. There is even HDR option in backlighting mode. Camera is fast and and do not select slow shutter speeds as earlier Nikon 1 cameras. That means blur free&sharp; photos when there is movement in a frame.I use it mostly in auto and HDR/backlighting modes and I am very happy with pictures quality. I love shooting from moving vehicles and this camera with 11-27.5 mm lens is a perfect combination for this versus 10-30 mm lens. It is just a little faster at 11mm (30 mm equivalent) and more compact and that makes all the difference!During my latest road trip I took close to 3,000 pictures out of moving at high speed car and only about 10 of them were not in focus! Of course, I used a continuos shooting drive and many photos were discarded because I did not like composition or something else in the frame, but they were sharp, well exposed photos delivered to me by S1 camera so I can choose which are the keepers and I did not have to worry about technical image quality - it was superb!I will update this review as use Nikon 1 S1 more with observations and photos. I am also planning to check how it works with wireless adapter.As of now, my initial impressions are that it is inexpensive, fast focusing, very compact camera with amazing lens warranty - 5 years, no shots limit (easily 100K a year or more!). Also, it does not attract too much of attention and can be completely silent.", "Date": "May 14, 2014"}, {"Title": "Incredible", "Author": "Viviane Lopes", "ReviewID": "R295WLYJ6SFB21", "Overall": "4.0", "Content": "Its really great and a lot of options to explore.But, unfortunatelly when you use the 'auto' the ISO is not the right one.Meaning, even if you use a good resolution, when you take the image on the computer with zoom, all the pixels and 'noises' from ISO are there.But even tho, its amazing.", "Date": "April 28, 2014"}, {"Title": "Good camera!", "Author": "Paige", "ReviewID": "R270P8B0OVGP4D", "Overall": "5.0", "Content": "Good camera, easy to use. I bought this to use at concerts; which I haven't been to one yet so we'll see in about a week or two if its good for that.", "Date": "April 6, 2014"}, {"Title": "nice camera", "Author": "cindy", "ReviewID": "R2YW6QGOMP4357", "Overall": "4.0", "Content": "it a nice camera but I wanted more of a zoom lens. Delivery was fast  Have not yet develop pic yet nice beginner camera if you want more than just a point and shoot", "Date": "March 19, 2014"}, {"Title": "Great little camera", "Author": "theothersteve", "ReviewID": "RTV1DQJS60XNG", "Overall": "4.0", "Content": "I own two Nikon 1 V1, and I purchase this to supplement them. Already have close to complete set of Nikon 1 lens. The complaint I have is that the body has the kind of slippery finishing as I don't have the habit to install the shoulder strap and I have to shop for the hand or wrist strap.", "Date": "October 14, 2013"}, {"Title": "Be careful, that lens is not VR", "Author": "Freddy Mac Kee", "ReviewID": "R97JDZPEETDUO", "Overall": "1.0", "Content": "VR stands for vibration reduction, and that particular lens, 11-27.5mm, does not exist in a VR version, you can check that on Nikon's website. I think it's a mistake amazon has made when naming the product. I had to send it back and get the J3 that comes with a slightly better lens that happens to be VR. Other than that, it is a really good camera but I can't give this review more stars because you cannot sell it with a feature it doesn't have.", "Date": "July 15, 2013"}, {"Title": "the product is ok.", "Author": "Zhigang Du", "ReviewID": "RH5DNYNEDP2VP", "Overall": "4.0", "Content": "the product is ok,but the cover of the lense is so tight that I make great efforts to open it.the shipment and delivery is fast.", "Date": "October 1, 2013"}, {"Title": "Amazing !!", "Author": "Josue \"Josue\"", "ReviewID": "R1AFZDSZVM1AMW", "Overall": "5.0", "Content": "Bought this for my sister for X-Mas and she loved it. I used it first for our New Years party and the pictures came out great !! Thinking about buying one for myself !", "Date": "April 11, 2014"}, {"Title": "So far......", "Author": "Elizabeth", "ReviewID": "R1JI3B8NSRMVUI", "Overall": "5.0", "Content": "I bought this camera for over 3 weeks now, SO FAR I LOVE IT, its everything I was expecting, I ordered in a pink color, and it looks really nice and shiny, my friends and family really like it too!!!! I got it from Unique Photo's store and I absolutely love how they do their job, my camerawas here in a week, since it was shipped from New Jersey and I live in Oregon, to me it was fast, there is nothing bad for me to say about the product or the seller besides I really liked everything!!!!!", "Date": "November 18, 2013"}, {"Title": "Nice but pricey.", "Author": "WLSinWI \"wls\"", "ReviewID": "R1IC6MSSEPVX56", "Overall": "3.0", "Content": "I haven't bought it yet but I have considered it. I think it is hard to justify purchasing it at $500. The body while stylish is plastic and will scratch easily.  The LCD is low res and not touch enabled. The sensor is the older 10MP as in the J1. The colors are pretty but not patterned like you can get on the J2 (red or Pink model) For $550 you can get the better J2 or you can get the similarly featured J1 for $400 on clearance.  If Nikon wanted it to be their low cost N1 series leader then they should price it at $400 where it can be competitive.", "Date": "February 27, 2013"}], "ProductInfo": {"Price": "$349.95", "Features": "10.1 MP super high-speed AF CMOS Sensor\nShoot 15 fps w/ autofocus\nWi-Fi Connectivity with WU-1b adapter (not included)\nBest Moment Capture - view live images in slow motion", "Name": "Nikon 1 S1 10.1 MP HD Digital Camera with 11-27.5mm 1 NIKKOR Lens (Red)", "ImgURL": "http://ecx.images-amazon.com/images/I/41o%2B4duJG%2BL._SX300_.jpg", "ProductID": "B00AY6MEFO"}}