{"Reviews": [{"Title": "Easy to use and takes great pictures...what more?", "Author": "xxxxxman", "ReviewID": "R34R5YJYS3WRX0", "Overall": "5.0", "Content": "This is the second camera we bought in a weeks period.  The first one went back after a day.  You needed to be an expert in something to understand it.  This one came and the information was online and was easy to read, understand and execute.  The camera itself is easy to do what you want with lots of functions that can be accessed easily with the click of a button.  Deleting unwanted photos and accessing an easy to understand menu are just a couple of things that I like.  Doesn't have a lot of buttons that are unnesssary and just get in the way.Took it to Mexico and took lots of photos in various lighting situations.  All of the came out great, very happy with the Olympus.  Battery life is quite long.  Easy to charge or you can buy another battery for a few bucks and always have a spare.  It has a panarama mode that is easy to access, and takes some beautiful shots.  Three different photos that are put together to make one.", "Date": "February 14, 2012"}, {"Title": "A somehow surprising upgrade", "Author": "Augustin Man", "ReviewID": "R3GGZX25QBJPW5", "Overall": "4.0", "Content": "As the SP-810 has been presented as an upgrade of SP-800, I'll also make my considerations by comparing the two cameras.It's rather unusual, but for those who don't want to read it all, here is the conclusion: SP-810 is even more a P&S; than SP-800, but the IQ is better and the IS much better, actually incredible good at the T end (36X); please see the attached photo gallery. It's however a camera for a hobbyist traveller, not for a photographer traveller.The aspect of 810 is more impressive, but the shooting position is with the lens more extended, like the 800 on super macro setting. It seemed the Olympus people also saw this, so if you switch to display mode, the lens retracts after 15s. Of course when you switch back, there is a notable extra time to revert to the shooting position. They also changed the functioning of the display button: you can start displaying and switch to shooting mode, but you have to put off the camera using the general on/off button, something better I think.From the tests I've made, mainly landscape and zoom by day in P mode, by night SCN-Night Scene, the 810 was all the time better than 800.Other observations: I've imagined that the 810 was more than 800 in choices; well, I was wrong, because the 810 is much LESS: for instance, the SCN-Night Scene has the timer only, compared to the added EV and WB of 800. There is no bracketing, no colour editting and the setting menu was significantly reduced. There isn't the AREA choice of AF, something rather disturbing, as you have to choice SPOT or try refocusing again and again; a tip is to zoom in to the wanted area and than zoom out again; the mark will remain there. Also shooting movies with sound prevents using the zoom, something clearly explained in the 800 Instruction Manual, but not in the 810 one; in exchange the so called \"Fine Zoom\" of 800 is no more called like this, but explained as a trimmed raw image and, more important, shown at the zoom scale also. The All Erase option was migrated to the display menu, probably better, I don't know...That's all for the moment.My advice: if you are a hobbyist in love with big zooms like me, go and get an 810, because it's better and cheaper than 800; otherwise think again...", "Date": "December 19, 2011"}, {"Title": "love my new camera", "Author": "Amazon Customer", "ReviewID": "RZF74NA58CTKQ", "Overall": "5.0", "Content": "Have had for about a month now and have taken more pictures with this camera than I have have in probably most of my life. My favorite function is the fast level 1 multi shot. 5 or 10 frame a second. if your are like me and always seem to get the shot just after the perfect one this is nice. Just take the picture before and you get a frame by frame almost like a flip comic book so you catch multiple expressions. Just happen to be taking a pic of my daughter while she was jumping from one spot to another at the playground and got the jump (the smurk), the landing (the pride that she did it), the slip (she looked scared), the arms waving (the uh-oh face), and catching her balance and looking to see if we seen her do it all. I don't think that any photographer could have gotten all that no matter how good they are. Many cameras have this fuction im sure but I am very pleased with this one in particular. Has a super zoom, it arrived on time, and did not take as much memory as i thought it would. I got over 600 pics on the multi shot function on a 4 gig memory card and only used half of that.", "Date": "January 13, 2012"}, {"Title": "Works", "Author": "vr", "ReviewID": "RLRV7E3NR9NSB", "Overall": "3.0", "Content": "I've only had this camera for two days. I'll write an update in a month or two. So far...PROS- cool effects- panorama works pretty good- flash is easy to work with- seems to take pretty good indoor pictures- zoom is obviously good (also if it is at max zoom... your obviously not going to get an Amazing picture.. pretty sure that is common sense though)- easy menuCONS- sequential shooting only works at 5mp. you can't get the full 14mp if you are using the sequential shooting. This is a major con for me because it was a big part of the reason I bought the camera.- lens cap is kinda flimsy- doesn't come with a case (not the end of the world, but would be nice)- sometimes the sequential shooting gets stuck shooting.. it just keeps taking pictures and taking pictures.. and taking pictures.. until you finally get frustrated and turn the camera off. This is kinda annoying. But doesn't happen on the high speed 1 sequential shooting... (there is normal, speed 1, 2, and 3)- Can take a second or two to focus, which I feel is a little annoying but almost all the cameras I've had are like that so its not a super huge deal. If your used to better camera though.. it would probably be super annoying.All in all its pretty good. I'm trying to decide if I'm going to keep it or not, just because the sequential shooting is a big deal to me. But other then that I feel like its a really nice camera for the price.Update --- I decided to return it because after playing with it all day I was still unable to get the picture quality that I am used to with the cheaper cameras I have owned. Still, all the effects are super cool and if you don't mind the noise, the sequential shooting is nice. Oh I did like the video, it preformed very well.", "Date": "July 2, 2013"}, {"Title": "Best Zoom in the business1", "Author": "victor8184", "ReviewID": "R6EZLF1SPLTZ9", "Overall": "5.0", "Content": "Olympus SP-810UZ - 14Megapixel, 36x Zoom Digital Camera  Best zoom in the business.  Bought it specifically for 2012 Daytona 500 race week day & night racing.  Great pictures and videos.  Would buy it again and that's from a Canon man!", "Date": "April 9, 2012"}, {"Title": "Great Zoom", "Author": "Roger Norman", "ReviewID": "R3V54XGZTYF4LN", "Overall": "4.0", "Content": "Chose this camera for two reasons 1 the make and two the Zoomand am really pleased with it as the Zoom is truly excellent.", "Date": "June 25, 2012"}, {"Title": "A bridge camera that does what it is intended for", "Author": "ellafan", "ReviewID": "R38RALXB4QO7AZ", "Overall": "5.0", "Content": "I have had this camera for a couple of months now,and I am quite pleased. Everything works as it should.The zoom offers excellent quality ,even hand-held.The lens is top-notch quality,and continues the fine reputation Olympus has with their lenses. I can't really find anything wrong with this little gem. I carry it with me in my Jeep wherever I go because it starts up quickly and comes in handy when I want a fast shot,w/o having to haul out my full-sized d-SLR and mess around with changing lenses. And I broke that very camera,so the Oly here is filling the gap until I can afford another d-SLR.I would recommend this to anyone.", "Date": "August 1, 2012"}, {"Title": "Best Camera So Far", "Author": "David W. Orr", "ReviewID": "RFIBQPXNEFZQW", "Overall": "5.0", "Content": "Bought this for my real estate business, where I take about 900 photos each month. Before I shot the first photo, I went ahead and added a very small piece of Velcro (the hooks) to the left-side of the camera body. The loop portion was attached to the lens cap. This stops the lens cap from blowing around in front of lens in the wind, or during action shots.Also, connected both sides of the strap to the same metal loop on the right-side of the camera body. When I'm shooting images of homes, I carry the camera in my right-hand, with the strap poised above my wrist so I don't drop the camera. It's easier to pull the camera out of the bag and work with it, when the strap is on only one side of the camera. Since I am taking dozens or hundreds of photos of a property at a time, having the camera strap around my neck would be a real pain in the neck.My previous camera was a Fujifilm, which seemed to be a good idea at the time - until I realized it used 4 AA batteries and 18x optical zoom wasn't enough for my needs. I hate having to take batteries out of a camera to either replace or recharge. And there's nothing worse than not having enough optical zoom.The Olympus SP-810UZ is awesome! It has 36x optical zoom which is double what I had before. But the operation of the camera? It's smooth, simple, point - autofocus - shoot. I never realized how much better my photos would be with 36x optical zoom - it's amazing.The second best thing about the Olympus camera is the battery pack. No more removing & recharging AA's. Olympus has provided a lithium-ion battery pack that you can connect to a wall charge via USB or a powered USB port for your computer.(Do suggest using the wall charger for the first charge. Thereafter, the USB only charge works great!)Had a small point & shoot Olympus several years ago, and I really liked it. This camera will be my go-to camera for years to come. Or until I need a 72x optical zoom.", "Date": "January 11, 2013"}, {"Title": "Great camera", "Author": "sharlyn13", "ReviewID": "RHK2CMM5QT7FG", "Overall": "5.0", "Content": "After a great deal of research, including reading other reviews of this and many other cameras, I purchased the Olympus SP-810 UZ.  I wanted a camera with a large capacity for zoom as well as built in stabilization...this camera has been the perfect choice for me. It takes great photographs, is easy to use and the zoom feature is great. I haven't tried all of the features yet, but will be experimenting as I go.  My boyfriend who is a photographer prefers to use my camera in certain situations because of the quality of the pictures and it's capacity for stabilization and zoom. Great value for the money.  There are only a couple of drawbacks; one is having to plug the camera in to charge the battery and the other is that it takes a bit of time to focus. (Other reviewers discuss this in more and better detail.) Overall I'm very happy with this camera and would recommend it to friends.", "Date": "July 26, 2012"}, {"Title": "Olympus SP-810 UZ Digital Camera", "Author": "W. Kalamon", "ReviewID": "R1NRC6ADVDDDEN", "Overall": "5.0", "Content": "Amazing optical zoom unheard of only a few years ago.  I purchased this for my wife and she got great shots at the shore with family. I have been a loyal Olympus customer for quite a few years.  Olympus has got game!Bill K", "Date": "August 29, 2013"}, {"Title": "Wonderful camera", "Author": "carma", "ReviewID": "R1Y3JXLU03VWCS", "Overall": "5.0", "Content": "I would recommend this camera to anyone who wants a good, easy to use camera that can capture great pictures and Quick action. It takes great close-ups as well as long distance pictures.The video is also excellent,clean and smooth. Loved this so much we bought a second one.", "Date": "December 13, 2013"}, {"Title": "Olympus SP810", "Author": "lucky me", "ReviewID": "R2R3Y34LFAGC9D", "Overall": "4.0", "Content": "Wow - this is a little harder than I thought it was going to be.  It is not a P&S; as I was thinking.  First you need to point it, then it focuses a while, then when the subjects become clear, they have moved again so it re-focuses.  It is not easy to figure out how to get faster focusing so I do not lose the nice candid shot I was trying to make.", "Date": "July 23, 2013"}, {"Title": "Excellent Camera", "Author": "A. G. Corley Jr.", "ReviewID": "R1PJ7NR9M5RTBD", "Overall": "5.0", "Content": "Love this camera. Took it with me to an animal park and captured some excellent photos. All crystal clear and the digital zoom is something to love. All the pictures turned out perfect. If you want a good camera look no further.", "Date": "September 13, 2013"}, {"Title": "Nice travel camera", "Author": "Seaspray", "ReviewID": "RVSAKP0FDHG6K", "Overall": "5.0", "Content": "Very good travel camera, I also have a older Olympus SP 620 and this unit corrects some issues that I found buggy such as the lens cap falling off and battery cover hard to close ( you charge the battery in this camera) . Like all Olympus SP units this camera seems to be an odd shape but is very practical to hold and lends itself to shoot steady photos.", "Date": "December 3, 2013"}, {"Title": "Hard to use Macro for ME", "Author": "scott", "ReviewID": "R1M5O2YK9FXZAM", "Overall": "3.0", "Content": "It is hard for me to use the macro settings to get a good close up of very small print on items seems, like I cant focus camera. I am sure its me not the camera. Help ? I also have problems sometime getting grainy pictures some times I also am probably getting the wrong setting just not sure what a good setting should be. and last occasionally I get a screen the has a bunch of squares over screen sometimes when viewing what I am taking of. It just seems like a hard camera to use for a non tech guy like me.  I am one of those people that need t have a live conversation to follow along as you go to learn this stuff.So its a little to complicated.", "Date": "November 10, 2013"}, {"Title": "Wonderful Camera", "Author": "Granny 2 B", "ReviewID": "R2O7NB8OP6I0PP", "Overall": "5.0", "Content": "I researched and purchased this camera for my daughter for our trip out west.  She was able to get great long distance shots and  wonderfully clear pictures. It's easy to use and quick to turn on.  For the price, this camera is quite the find.  I would definitely recommend it.", "Date": "October 29, 2013"}, {"Title": "My Dad loves it", "Author": "R. Fieser", "ReviewID": "RE1MX7LZFKL58", "Overall": "5.0", "Content": "This camera has a tremendous zoom range and is pretty easy to use. Apparently, Olympus improved the image stabilization in this camera as opposed to the IS in the  SP-800, as I was able to snap shots at full zoom in daylight without any problem. You need to read the manual to make best use of this camera. It's not really for people who like manual settings. It's small, but powerful. I think my dad really likes it.", "Date": "September 24, 2013"}, {"Title": "Amazing camera for the price -", "Author": "Bruce E. Bennett", "ReviewID": "R2GYVWZY6ZDP9G", "Overall": "5.0", "Content": "This camera does amazing things for it's price - if you are not an advanced photographer, but want to take wildlife photos - THIS IS YOUR CAMERA!!!!I got it for my Mom, and it gets the bird photos she's been trying to capture with her pocket camera without adding a lot of complexity. The 35mm equivalent zoom is 864mm!!  That's like a telescope!! (And, yes it takes great photos at that level of zoom)That said, if you are used to a DSLR, you will find the feature set very limited.", "Date": "July 30, 2013"}, {"Title": "Awesome camera!", "Author": "rkline", "ReviewID": "R1T9HLTJFCGPCM", "Overall": "5.0", "Content": "awesome camera! I still have yet to use all the features, but it takes really nice photos...love it! My first Olympus camera...won't be my last!", "Date": "February 17, 2013"}, {"Title": "It was great", "Author": "Michael Smith", "ReviewID": "R3TRZ42QAM8PE5", "Overall": "5.0", "Content": "This camera was great me and my wife loved it.  It was simple and easy to use for her with enough features for the tech guy in me.  It took beautiful pictures we took it with us on our honeymoon cruise.", "Date": "November 28, 2012"}, {"Title": "Fun and easy camera", "Author": "Ellen E. Mccord", "ReviewID": "R1HE7VBWC7O2VJ", "Overall": "5.0", "Content": "I bought this camera through another source.  I have had it for a week.  It's wonderful.  I had a previous generation, 10 years old, and loved it.  When I found this newer one on sale, I bought it.  I like the ease of using the menu.  Reading the instructions helps to understand how to set the camera for different situations.  It adjusts indoor light beautifully.  I got incredible pictures of the moon, playing with depth of field and adding the digital zoom to the optical zoom--best to use a tripod.  The camera even has settings for fireworks.  I'm looking forward to trying that out.  Contrary to what others have said, you can use the zoom when using video and sound.  It's just not the optical zoom, it's the digital zoom.  The shutter delay is typical of any digital camera that is not a DSLR, but that is affected by metering and zoom.  I cannot afford a DSLR. I'm looking forward to using this camera for many years.The only thing a little annoying is that the on/off button is so accessible, I often press it accidentally and the lens cap falls off.  I can live with that.", "Date": "June 26, 2013"}, {"Title": "Olympus SP-810 UZ", "Author": "Donald A. Medine", "ReviewID": "R3VL2YPMZEY2XR", "Overall": "3.0", "Content": "I returned the camera because many shots came out blurry and the color tint wasn't accurate. Also, it was very difficult to get a good picture at max zoom.", "Date": "January 16, 2013"}, {"Title": "Very low quality photos!", "Author": "Alex and Sarah", "ReviewID": "R1MF94MK0G0TQZ", "Overall": "1.0", "Content": "I tried everything I could to get nice photos, but is almost impossible to get something good out of this camera. Tried all settings but it doesn't matter...everything come out blurry and very grainy.It ruined our trip to Vegas! Around 95% of the pics look crappy!Don't buy this camera!!! It's a piece of garbage!This piece of garbage suppose to be a replacement for our old Samsung L73 (a 2007 camera). The Samsung L73's ASR \"antishake system\" it's 10x better than the Olympus IS \"Image Stabilizer\".We're going to take the Samsung out of the drawer and try to sell this Olympus garbage.", "Date": "January 25, 2014"}, {"Title": "Good camera but not for true macro pics", "Author": "JK", "ReviewID": "R2SN1YAA5RHHJV", "Overall": "2.0", "Content": "I just bought this camera a few days ago, and unfortunately I'll be returning it. Overall, this is very nice looking camera but a bit bulky. The removable lens cap is a bit awkward.This seems like it could be the perfect camera for sight-seeing and nature photography, but does not work for close-ups requiring hairline detail. While I would be using a camera for occasional trips and events, I primarily need one for the Super-macro mode. I need to do jewelry photography several times per week, and every fine, hairline detail must be crisp.I have not been able to get in-focus pictures using the Super-macro mode on this camera. The inability to zoom in during Super-macro mode is also major problem for me.", "Date": "November 20, 2013"}, {"Title": "Good purchase", "Author": "William Douglas", "ReviewID": "R24Z5L2I72AHZV", "Overall": "5.0", "Content": "My daughter has one and I liked it. Very nice camera. Very easy to us for an amature with little eaperience", "Date": "October 9, 2013"}, {"Title": "Love the Olympus SP-810 UZ Digital Camera V103020BU000", "Author": "allie", "ReviewID": "R353KZYHPK3NXX", "Overall": "5.0", "Content": "Love the Olympus SP-810 UZ Digital Camera V103020BU000  Easy to operate and the 36 power zoom is just great!  The camera isn't that large or bulky and feels good in a ladies hand.  It isn't however a pocket camera.  Takes clear lovely photos.", "Date": "October 2, 2013"}, {"Title": "AWESOME!!", "Author": "Curtis Rogers", "ReviewID": "R1ZPRDUW0LTGHN", "Overall": "5.0", "Content": "Awesome camera!! We love the fact that the Zoom is soo Great. We can take pictures anywhere. There are better cameras out there but you'll pay twice as much and get some of the same features.", "Date": "September 16, 2013"}, {"Title": "super focus,super pictures ,easy to use camera", "Author": "Hector Lopez", "ReviewID": "R2JAF0GP0CVQCQ", "Overall": "5.0", "Content": "A perfect camera in a perfect price. You do not have to be a profesional to take beatifull pictures.I recommend it", "Date": "August 29, 2013"}, {"Title": "Great Product", "Author": "Demitri Tijerina", "ReviewID": "R2EVL5RMDEER4G", "Overall": "5.0", "Content": "great product!!!! easy to use and handle, my first Olympus camera. after using other brands this one is the best.", "Date": "August 26, 2013"}, {"Title": "Two stars less", "Author": "Maxesmart", "ReviewID": "RY29OLGS1MTRV", "Overall": "3.0", "Content": "There is no doubt that the camera takes good pictures, but I have taken two stars from it because for me  it has two minus points, the main one being that it has no viewfinder, only a LCD screen. This is a real problem when you want to take pictures when the sun is high and there is too much clarity or, if like me, you don't like having people around watching what you're doing.The second one is that you have to be aware that it dosn't work with micro SD cards, as my other cameras do.", "Date": "April 13, 2013"}, {"Title": "slow and strapless", "Author": "Integrity Man \"Chris\"", "ReviewID": "R2HFC2U8EY6YHX", "Overall": "3.0", "Content": "I just got my camera in the mail and so far i'm just a little impressed. The camera looks SOO much bigger and heavier in the pictures, but it's just a little tiny thing. So far the camera seems to be real slow and i worry about trying to take pictures on the fly. For example, if i want to take a picture of something immediately and moving fast good luck. There are so many choices for fast moving objects its alittle too much. If you are looking for a quick point and shoot this cameras not for you. YI know i've only had it a few days but i have looked this camera over pretty good and right now i feel like i really have to plan my shoots. I may feel differently when i get used to the camera. Also, the strap that came with it does not even fit the camera. It has very small holes for a strap to attach to this camera and im not sure where im going to find one. Anyway, for $185.00 its not too bad.", "Date": "March 2, 2013"}, {"Title": "Olympus camera", "Author": "Bonzer", "ReviewID": "R1VVNHLGZIR691", "Overall": "5.0", "Content": "This cameras 36x optical zoom is great. The 14 megapixles really capture the image with stunning quality. The macro settings are also extremely good. It has super macro setting and you can adjust the shutter speed. Put it this way. I take pictures of the moon with this camera and you can see the impact craters. Best point and shoot I have ever used.", "Date": "January 9, 2013"}, {"Title": "Just what I was looking for", "Author": "Deidre M. Quinn \"dee\"", "ReviewID": "R2R9VGML7QY5T3", "Overall": "5.0", "Content": "I have only ever owned a point and shoot camera, i take a LOT of pictures but just of everyday life stuff and vacations. I was looking for something that had a better zoom/macro option that what I already had. We had a small budget of $150. We picked this up for Black Friday! I am happy with it. It is a little slow on re setting to take another picture but thats really my only complaint. I love using it to take pictures of my toddler and for taking pictures at my soccer and hockey games.", "Date": "March 20, 2012"}, {"Title": "sloooow...", "Author": "drav idian", "ReviewID": "R2A30T2DWT9JLG", "Overall": "2.0", "Content": "sheesh- i do like some of the better photos i've taken with this thing, but it's mostly by pure luck!  can't begin to count how many shots i've missed because it takes so damn long to focus- very frustrating.  if you plan on taking landscapes or still life shots in full light, then fine- but if your subject moves at all, forget about it.", "Date": "January 14, 2013"}, {"Title": "Olympus SP-800 UZ digital camera.", "Author": "paulie1", "ReviewID": "RXF2XWNXIDW1O", "Overall": "4.0", "Content": "Very pleased with wide panorama features, especially for long distance shots. Like the feel of the larger body more suitable for people with larger hands. Has all the features I want for taking good shots. Would have liked a more comprehensive manual which assumes you already have acquired certain knowledge. Could be a bit daunting for first time users.", "Date": "February 15, 2013"}, {"Title": "for the money it ok", "Author": "katie brooks", "ReviewID": "RJ89NJFKXZU3R", "Overall": "3.0", "Content": "after using every setting I realized it does not snap fast enough. There is the multi snap function but even that has a delay", "Date": "July 10, 2013"}, {"Title": "Great camera, use alot for nature photography.", "Author": "K. Segura", "ReviewID": "R1IXIVQV3ZF413", "Overall": "5.0", "Content": "Love this camera! Great battery, the size is perfect but at times can become a little heavy around the neck. I use the optical zoom often to catch images of animals from afar and the clarity for me is perfect! Would highly recommended this camera for those who are on a budget and want to capture nature photos.", "Date": "June 3, 2014"}, {"Title": "Great camera", "Author": "ak_guy", "ReviewID": "R1OEDURT3LPNIL", "Overall": "5.0", "Content": "I wanted a camera that was easy to use and had photo stabilization. This camera met that but I could also go manual... It's a mush better camera then I am a photographer.", "Date": "May 31, 2014"}, {"Title": "A camera for all seasons", "Author": "Jane", "ReviewID": "R1542PQ2E9A940", "Overall": "5.0", "Content": "I have been used to a point and shoot camera by Olympus.  It hit the dust during a trip and was grateful to have my cell phone to fill in the photos that would have been missed.  I feared this new camera, might be too much for this old brain to figure out, but it has been a dream.  Just read the book and away you go to successful photography.", "Date": "May 27, 2014"}, {"Title": "Good. buy !", "Author": "Anthony Smith", "ReviewID": "R21DFUGO5PEN9D", "Overall": "4.0", "Content": "I do like my new camera,it operates very good,the only thing is the battery is not holding a full charge,other than that,it was a very good purchase. A battery was only $17.94, so it's still a good deal.", "Date": "May 8, 2014"}, {"Title": "Great product for the price", "Author": "Juan Guerrero", "ReviewID": "R110YF109NCQPQ", "Overall": "4.0", "Content": "Great ZOOM, autofocus not that great. If you are zooming something you want to focus, you are going to have a BAD time. Asides from that, panoramic and picture quality is great. Nice product for the price being payed.", "Date": "April 11, 2014"}, {"Title": "great buy.", "Author": "Amanda Jeffery", "ReviewID": "R3S4AQXXEPUA64", "Overall": "5.0", "Content": "I love this camera. I accidentally left it outside and it rained that night. The next day I found it and the screen was full of water and sand. I cleaned it the best I could placed it in rice for two days. It has glitched a few times but none worse for the wear. I do not suggest doing this, but what a great product. I also praise on it's zoom capabililities and great pics.", "Date": "April 1, 2014"}, {"Title": "Olympus Camera", "Author": "Harley Hume", "ReviewID": "RUR2W3ZKIA4FE", "Overall": "5.0", "Content": "This camera is easy to use and is very versatile. You can take quick pictures of good quality and it is inexpensive.", "Date": "March 31, 2014"}, {"Title": "Love my camera", "Author": "Sharyn Ross", "ReviewID": "R2HP0QUQUILLLH", "Overall": "4.0", "Content": "Easy to use, great quality pictures.  Still trying to figure out how to use some of the features.  I liked the massive zoom option, but have yet to get the results as shown in the description.  I bought a spare battery and charger which has worked out well for me.  Comfortable to hold.  Great features and effects.", "Date": "March 13, 2014"}, {"Title": "Brand New Camera", "Author": "vanessagullatte", "ReviewID": "R31FSGRXQ0V83H", "Overall": "5.0", "Content": "The first camera that I ordered from this seller did not work the camera lens would not extend properly.  I inquired with my seller about this and he promptly sent me a brand new camera (the one I originally purchased was refurbished).  The camera itself shoots awesome quality pictures and picks up the slightest detail in every setting.  This was definitely a good buy at well below the in store retail price!", "Date": "March 6, 2014"}, {"Title": "takes good enough pics under ideal conditions.", "Author": "O. Mould \"Islander\"", "ReviewID": "RDLRMTRRTNRHE", "Overall": "2.0", "Content": "I had hoped this one would come with true manual settings. No dice. I want full control over aperture, shutter speed and ISO grain. I have found that under the extreme conditions i often operate, this one fails against an old 8mp Canon that is held together with picture hanging screws.  The images are routinely \"soft\", and i often have to \"fool\" the sensor by oversetting the exposure adjustment by +2 or -2.  On the plus side, its heaviness reduces vibration, and the optical zoom is better than anything else you will find in a point-and-shoot.I am just not a point-and-shoot guy.  This one will be relegated to backup camera for outdoor daytime events.", "Date": "February 24, 2014"}, {"Title": "A Move Up from Point and Shoot", "Author": "JPS", "ReviewID": "R1HH3BX6E36DEN", "Overall": "4.0", "Content": "This camera is a move up from a regular point and shoot.  Believe that the 810 and 815 are exactly the same (different markets?)  That being said there are many more options than your regular point and shoot.  If you take the time to assess your light and everything the pictures turn out great.I have had the camera for 3 months, finally took it on a vacation and got it figured out, giving it 4 stars since it is a little confusing to use.  It's a good thing that I did not get a SLR or I would be confused on how to use for years.Be sure to get an extra battery as when you are busy zooming in and out, I used up the battery quickly (in an afternoon).Pros:* 36 time zoom is outstanding and you can hold it steady enough to get clear pictures* Panorama option is easy to use however output is lower resolution* Sunset filter puts out great results* Reflection option is a nice gimmickCons:* Lots of optionsUploaded some example shots with high levels of zoom, then a few panoramas, sunset, reflection etc", "Date": "February 17, 2014"}, {"Title": "Not satisfied.", "Author": "Norwood M Hardee", "ReviewID": "R1AWILWFJ4D9Y6", "Overall": "2.0", "Content": "It takes good pics I guess but the images are poor compared to some cameras I have had that were point and shoots. Definitely need a tripod when taking zoom shots or it will be blurry. I'll probably end up selling this camera for a lot less than what I paid for it. I think I'm gonna go with Lumix next time and get the 60 zoom I've seen so many good raves about.", "Date": "January 28, 2014"}, {"Title": "Sp-810", "Author": "scott walker", "ReviewID": "R557A61Z6E8GM", "Overall": "4.0", "Content": "Have a SP-800 and dropped it.  Got the newest model to replace it.  Not much difference, but because the old one was fantastic, so is the new one. Great pictures and easy to use.  Eye-Fi a must.", "Date": "January 19, 2014"}, {"Title": "Olympue SP-810", "Author": "Richard Hurst", "ReviewID": "R1OZZBJIHWQLG0", "Overall": "5.0", "Content": "I researched for days/weeks reviewing numeous cameras.  I chose this one; because of the many things a person can do with the camera.  To my greatest surprise was the feel, the grip is perfect.  The pictures are great.  They are almost like real action.  The contrast,brightness, etc, are just behind words to describe. This camera is very easy to operate.  A small child could easy use! You really must own this camera to get the experience, I have of owning this camera. I plan to always have it near for photo taking.  The best of all the cameras, I have ever own.  The price was really a price, a person should never pass up.  The camera will preform except to talk to you!  This is the reason, I gave it a total five..", "Date": "January 10, 2014"}, {"Title": "Good camera", "Author": "dal", "ReviewID": "R263PE7DFROZXB", "Overall": "4.0", "Content": "I have had Olympus cameras for many years. This one is to replace a SP800UZ which bit the dust in the rainforest of Costa Rica. This camera is cheaper made than others but works. I received this 12/31/13 and the price has dropped $15.00. Not good for me.", "Date": "January 3, 2014"}, {"Title": "Excellent", "Author": "T. Huck", "ReviewID": "R21XLQYNB9HJQD", "Overall": "4.0", "Content": "great price and no problems with the product so far... just opened up the box and its charging so stay tuned", "Date": "January 2, 2014"}, {"Title": "Great camera", "Author": "Katie Raynes", "ReviewID": "R3D77FA7JTRMQU", "Overall": "5.0", "Content": "I chose this camera because I want to learn to take better quality photographs than with a standard point-and-shoot, but I'm not aiming to become a professional photographer. I was very satisfied with my first tries using this camera. The menu is easy to use while still offering a variety of options if you're looking to go more in-depth. My favorite settings to play with are the macro and super macro, the white balance adjustment (allowing you to set the camera to \"sunny day\", \"cloudy day\", \"fluorescent light\", or \"incandescent light\"), and the exposure adjustment. I'm really happy with the image quality and the camera's ability to pick up on nuances of color. Sometimes it's hard to get the auto-focus to focus exactly on what I want (especially in the super macro) but it's easy to overcome by using the regular macro and the zoom. The zoom is very nice as well - I've taken close-up pictures of a hawk that was a few hundred yards away, and they came out beautifully. I would recommend this camera to anyone who's looking for more than a basic point-and-shoot but doesn't want to go the DSLR route.", "Date": "January 1, 2014"}, {"Title": "Economical, easy to use, but too slow.", "Author": "Laura A.", "ReviewID": "R2PZ400JTTDHDS", "Overall": "2.0", "Content": "This camera is just too slow to be able to capture candid moments-I was quite disappointed in it.  I give it two stars just because it IS better than other \"cheap\" cameras I have had.  I'm going to suck it up and spend the money on a better camera.  This had good reviews when I purchased it, but it has been a disappointment to me.", "Date": "December 26, 2013"}, {"Title": "Tried and tested.... love it", "Author": "Liza A. MCNANEY-JUSTER \"Lizzy\"", "ReviewID": "RP5X32MEZYCJI", "Overall": "5.0", "Content": "So I am not the most professional photographer in the world but do appreciate a good picture to share with family. This camera is user friendly and the photos are astounding. You can tell the difference between my little point and shoot and this, I will put up with the bulk for the picture quality I am gaining. Great price.", "Date": "December 22, 2013"}, {"Title": "Olympus 810 Wonderful", "Author": "Michael Gabriel \"MG\"", "ReviewID": "R2PRB2XE4JVGD8", "Overall": "5.0", "Content": "A great point and shoot camera and the price was excellent.  For the price, you won't find a better camera with all the features than this one.", "Date": "November 6, 2013"}, {"Title": "GREAT!", "Author": "PAUL E SEIBERT", "ReviewID": "R3ELXAKO8AOVRC", "Overall": "5.0", "Content": "EASY TO USE, AIM AND SHOOT. PICTURES ARE VERY CLEAR. THE ZOOM IS THE BEST I HAVE EVER HAD IN A CAMERA. I HAVE ALWAY USED CANON CAMERA'S VERY HAPPY SO FAR WITH OLYMPUS. HAVE TO DO MORE READING TO LEARN MORE ABOUT WHAT I CAN DO WITH THE CAMERA.", "Date": "September 22, 2013"}, {"Title": "Love my new camera!", "Author": "Madly Mazzy", "ReviewID": "R3UO2I3H196ZMH", "Overall": "5.0", "Content": "A friend of mine bought this exact camera, and I was impressed. The zoom lense is amazing and the photographs all turn out wonderfully. Even comes with some easy and fun simple photo editing software. Good price too!", "Date": "August 12, 2013"}, {"Title": "So far, so good", "Author": "CM", "ReviewID": "RUUNMF4DQM2O6", "Overall": "4.0", "Content": "I've enjoyed this camera so far, but I haven't used many features yet.  The outdoor pictures have been really sharp.I really hate reading from a screen for extended periods of time, so I need to print out some of the instruction booklet to work with it.", "Date": "July 16, 2013"}, {"Title": "Great camera", "Author": "ddpound", "ReviewID": "RB6QMTSA51B21", "Overall": "5.0", "Content": "Takes excellent pictures. Took it to the beach and was able to zoom in on objects right from the balcony.", "Date": "July 7, 2013"}, {"Title": "loving it", "Author": "baker4", "ReviewID": "R266B5JPJC9BF4", "Overall": "5.0", "Content": "I have  a camera I just stuff in my purse but I needed one that had lot's of modes and options and took crisp lovely pictures. It takes very clear vibrant pictures. I have not used all of the modes but intend to. I love this camera, very affordable!", "Date": "July 7, 2013"}, {"Title": "Love it!", "Author": "Bogdel", "ReviewID": "RYYZSNHA77DOF", "Overall": "5.0", "Content": "Great camera for its size. I had mine for over a year. Great zoom, great pics. easy to use. Thank you!", "Date": "July 6, 2013"}, {"Title": "Olympus SP-810 UZ Digital Camera", "Author": "Luis", "ReviewID": "R3FUVXNQ815WMH", "Overall": "5.0", "Content": "I chose this rating because I am pleased with the product and recommend the product to those interested in something like", "Date": "December 28, 2012"}, {"Title": "Camers", "Author": "AMOS HALL, JR.", "ReviewID": "R1KQCJN3OM9K9U", "Overall": "5.0", "Content": "My wife loves this.  Very easy to use, and she uses it all the time.  Was as described, and shipment was fast.", "Date": "December 13, 2012"}, {"Title": "If you are looking for a nice camera the Olympus Sp-815 is the one..for your first it still would be the one", "Author": "Glenn E. Caulk", "ReviewID": "RWJ4ZCEJ0K29", "Overall": "5.0", "Content": "It's  a very good camera.I wanted one that the pictures would be light and not dark or just didn't show up..taking my wife to see Johnny Mathis...I wanted to have very good pictures to have for her..This would be the first time to use it..and yes the camera did just what I wanted..since then our Granddaughters has had programs and our pictures have been great..but I still have things to learn about the camera..but, for the price  and so far the camera I love it....thank you", "Date": "December 12, 2013"}, {"Title": "LOVE IT", "Author": "BRANDI WITHERITE", "ReviewID": "R2QCD51AJUK2LL", "Overall": "5.0", "Content": "This  Camera is just what I was looking for takes amazing clear pictures, and the zoom is also amazing. Thank you!", "Date": "May 6, 2013"}, {"Title": "excellent camera", "Author": "Donna", "ReviewID": "RP60DAM13GSP1", "Overall": "5.0", "Content": "LOVE this CAMERA !!!this is just what I was looking for, it works great and is easy to use, it takes great pictures, and is very light and easy to hold and shoot.", "Date": "March 15, 2013"}, {"Title": "excellent", "Author": "YIYANG MA", "ReviewID": "RJ146PHPZGXF5", "Overall": "5.0", "Content": "The speed of discharge is fast.The product meets my requirement.The quality of this product is good.I love it, I think I will purchase stuffs more if there is a chance.", "Date": "January 24, 2013"}, {"Title": "Got this for boyfriend", "Author": "Dee", "ReviewID": "R1WT9ZCYIQN5AH", "Overall": "5.0", "Content": "Got this camera for boyfriend for Christmases and he loves it. It just didn't come with any directions so he having to find out how to use it on line.", "Date": "January 20, 2013"}, {"Title": "good camera", "Author": "Laura A. Henyan", "ReviewID": "R3FXZLMLLT2FKN", "Overall": "5.0", "Content": "I love the 36 X zoom on this camera.  I can get great closeups with it.  However, I haven't had time to use all of the features", "Date": "March 5, 2012"}, {"Title": "Great Gift", "Author": "jowill", "ReviewID": "R2UJIX16N0OJEW", "Overall": "5.0", "Content": "This is the second of this camera model I recently bought.  The first had a flaw. I returned it with no problem and got a quick refund(that seller had no more). This one is perfect. My daughter loves everything about it. It makes wonderful pictures with ease.", "Date": "February 23, 2012"}, {"Title": "Worst camera I have ever had!", "Author": "Bookworm329", "ReviewID": "R2L8C5VVTSDCL8", "Overall": "1.0", "Content": "This camera is so unbelievably slow and takes mediocre pictures. I was so excited to get this camera but boy was I wrong. Yeah, the zoom is pretty cool but it takes so long to focus its not even worth it. There is an immense lag on the screen and I have to wait for to catch up. Don't waste your money!", "Date": "June 19, 2013"}, {"Title": "Amazing!!!", "Author": "Dawn & Mick \"Dawn & Mick\"", "ReviewID": "R1ETUQP80IXIKF", "Overall": "5.0", "Content": "This camera turned out to be the best purchase I've made on Amazon yet!!  We purchased this just before we left on our two week driving vacation, and we couldn't be happier! It took some amazing shots of Mount Rushmore, and anywhere else we went!  An amazing deal for a reasonable price!!!", "Date": "July 17, 2012"}, {"Title": "Good camera, great zoom.", "Author": "G. Cromb \"Mr C\"", "ReviewID": "R2JB3HLVRQ2SGN", "Overall": "4.0", "Content": "I have to start by saying that I'm not a photographer. I just wanted a camera with loads of zoom for not too much money. This camera ticks all of my boxes and I've taken some great pictures with it. I'm not very good at taking pictures in low light, I don't know if this is due to the camera or my lack of photography knowledge.I'd considered buying a compact system camera but was put off by the price. I glad that I bought this one as it does everything that I need it to very well.This camera has plenty of functions for me. I never use most of the functions anyway as I don't really know what they do. I'd like to take a photography course some time, maybe my opinion of the camera would change after that. Either way it's a good stepping point between a compact camera and an SLR.", "Date": "October 17, 2012"}, {"Title": "Great camera!", "Author": "Amanda Smith", "ReviewID": "R1G886W99PJRLK", "Overall": "5.0", "Content": "This is a great camera for the price. Takes great pictures and video. The only issue is that the lens had a small flaw on it when we took it out of the box. It hasn't/doesn't affect the quality of the pictures though so we just kept it.", "Date": "February 5, 2013"}, {"Title": "Buyer beware!", "Author": "Diane OMer", "ReviewID": "R2CLEX70BDRZP8", "Overall": "1.0", "Content": "I had the older model and it was great.  This one is horrible.  The macro and super macro zoom doesn't work.  It says it has stabilizer, but it doen't.  They took features away from the other camera and added some goofy 3d feature that never lines up or works.  This is a horrible camera and a big waste of my money and time.  Buyer beware!!!!", "Date": "March 5, 2013"}, {"Title": "Great Deal, fine camera!", "Author": "James A. Baker", "ReviewID": "R31KZ2YKN03W6P", "Overall": "5.0", "Content": "My Olympus camera is very awesome, and beautiful. The zoom is amazing! Because the zoom is so powerful you must have have a tripod at the higher magnifications or have your arms braced while taking photos.", "Date": "February 13, 2014"}, {"Title": "Smaller than my old one with more zoom and megapix", "Author": "Eugene Peterson", "ReviewID": "R2OJ693G1XZ0NC", "Overall": "5.0", "Content": "I received this camera yesterday and I love it already . It is a lot smaller than my old sp590 which is great . I just have to figure out all the bells and whistles .", "Date": "November 3, 2013"}, {"Title": "Olympus SP810-UZ", "Author": "silvio1954", "ReviewID": "R3UA50NNQMLLYY", "Overall": "5.0", "Content": "Excellent seller, fast and reliable. I recommend him as well as the camera to everyone. You can not take a bad picture, even if you try.", "Date": "September 1, 2013"}, {"Title": "Just received my camera yesterday!", "Author": "Connie", "ReviewID": "R2I87RP0JC953J", "Overall": "5.0", "Content": "Took it out of the box, put battery in and memory card, pointed and shot my first picture! Easy to use, though I still need to figure out all the settings. Took it to the park today to play with it. Even extending the lens out to max the picture came out amazing.", "Date": "January 1, 2013"}, {"Title": "For Me!", "Author": "marie a montalbano", "ReviewID": "R8BFYGX9OW2CL", "Overall": "5.0", "Content": "I bought this camera for ME!! I love it!! It is awesome!!!! I can't wait to go on my first trip with it!", "Date": "December 29, 2012"}, {"Title": "Olympus SP-810 UZ - Professional Reviews", "Author": "Harlan Aliment", "ReviewID": "R2O0U1J181MAR", "Overall": "5.0", "Content": "If you read every review for an item you are considering buying at a website, you can easily find yourself afraid to buy anything. Buyers are basically well meaning amateurs. Reading their reviews you can tell some never read the manual, bought without doing any research, failed to properly use the camera's features, on and on. Save your time by reading reviews by the experts then make the decision on which camera is the one for you.Steve's Digital Camera reviews is one of the best places to start: [...]Other good ones are: [...]  &  [...]Again, do not spend too much time with users reviews, they just don't make the grade. Enjoy your new camera.", "Date": "September 21, 2013"}, {"Title": "Awesome camera (especially for the money)", "Author": "WyoReader", "ReviewID": "R1X9KJN8VGS8TK", "Overall": "5.0", "Content": "This camera is an excellent device. The ultra zoom and burst shooting are awesome features to have. It probably doesn't have all the features that a long-time photo hobbiest would be looking for, however, there are more options/features built into this device then I even have time to learn how to use.", "Date": "June 3, 2013"}, {"Title": "Great Camera (36 optical zoom!!)", "Author": "Rebecca LaBarca", "ReviewID": "R34L1H6M6EGGJ4", "Overall": "5.0", "Content": "I purchased this camera from Staples, it was on clearance for $120.  I love the powerful optical zoom (36x). This camera also has an array of scene settings, \"magic\" settings, as well as manual settings.  Lastly, the camera size is not too bad, it's small enough to fit in a medium sized camera bag.I would say this is a must buy product!(Rebecca LaBarca, museum & park lover)", "Date": "April 20, 2013"}, {"Title": "Great zoom. Light weight. Easy settings.", "Author": "Lyn brown", "ReviewID": "R1QZUM7ZSS6G2E", "Overall": "5.0", "Content": "Great zoom. Light weight. Easy settings. Zoom far exceeded my expectation. The high auto ISO setting worked great catching my granddaughter running during indoor soccer. The only negative, which I knew in advance, no view finder. Good luck finding a low cost small camera with one.", "Date": "March 5, 2013"}, {"Title": "Not easy to use, but I am getting to know how to use it better", "Author": "Brucejean", "ReviewID": "R91NP5S0TT2RO", "Overall": "4.0", "Content": "Not as easy to use as my last camera, but it takes great pictures, the movie aspect is very good . Don't know if I would buy it again though", "Date": "March 4, 2013"}, {"Title": "Excellent price", "Author": "Linda", "ReviewID": "R16PF0R7ORHIEU", "Overall": "5.0", "Content": "Fabulous price for this amazing camera. My teenager won't put it down. She has been testing out all the amazing features and is thrilled. She uses a Canon rebel at school for yearbook photos, so I was hesitant in by this. No worries now!! Best gift ever :)", "Date": "December 28, 2012"}, {"Title": "Is it me", "Author": "Leilani Schiavo", "ReviewID": "R2IZMMDRTOAY7C", "Overall": "1.0", "Content": "The pictures look foggy and horrible, I can't figure out how to make them look better and I can't figure out how to return it..waste of money for me.", "Date": "September 7, 2013"}, {"Title": "Olympus SP-810 UZ Digital Camera", "Author": "Audrey Lucas", "ReviewID": "R2TGN2SH825G6Z", "Overall": "4.0", "Content": "My original purchase of this camera was a packaged deal with the camera case, about 4 yrs ago.  Due to a loss, I re-purchased it, about one month ago.  A hairline scratch was on the view screen.  I really love this camera. It is so versatile to take almost any type of picture.  Great zoom lens 36\" wide.  I can really get close up without having to be upfront!  I should have waited, seems like a lot of deals now.", "Date": "June 5, 2013"}, {"Title": "Good camera, content of the shipping a bit surprising...", "Author": "Gerd", "ReviewID": "R1DYO1RL5AR976", "Overall": "3.0", "Content": "The camera is quite good.The objective is good, the zoom impressive, very easy to use (not too many useless functions), the pictures are nice.Not a model with top latest features (like display a bit smaller as what is standard today) but doing very well the job for the price.The only feature I am missing is a manual focus, but this is likely difficult for cameras with that high zoom ratio.The reason why I gave 3 stars is not because of the camera, but because of the seller.It was not stated in the description that:1) The camera does not come in the retail box, but all items came, individually packed in plastic bags, in a brown box without label2) The camera looks new, but is likely not. It has small defects, like a scratch in a corner of the display (not really disturbing, but is a clear defect)This explains likely the lower price.In exchange (likely to compensate the things mentioned above) the shipment included:A mini tripod ($1.50 at Dyso), lens cleaning liquid and tissue, protective film for the display, a 4GB (class4) memory card, Paintshop Pro X2 OEM software CD).Basically, this is fine for me, and I do not regret my purchase. I just would have appreciated knowing the things in advance and receive what I ordered.", "Date": "August 19, 2012"}, {"Title": "Good one!!!! But..!!!!!!!!! Knowledge is the key of everything......", "Author": "Jorge Cruz \"Jorgino\"", "ReviewID": "RPO9XFSN7Q48W", "Overall": "4.0", "Content": "Good Camera... Good Brand too... But is always better to learn a littler be more of what you buying... In this case?? learn more about photographer to get the benefits  of all new feature this one have ........ Other wise don't waste your money !!!!  Just buy a 50 dollars one and you set......  But is a Good product from \" Olympus \" once again.....", "Date": "December 4, 2012"}, {"Title": "Good camera, but they never sent me the Invoice", "Author": "Surr1984", "ReviewID": "R1FUKV157V5VMQ", "Overall": "3.0", "Content": "I bought 3 of this, none of them came with the invoice. I think you need the invoice in case you need the warranty service.", "Date": "July 3, 2013"}, {"Title": "camara", "Author": "denny rojas", "ReviewID": "R2E90R8HMYFR5V", "Overall": "5.0", "Content": "excelente el producto esta conforme a lo que se requirio y lo que el vendedor ofrecio, lo recomiendo ampliamente se", "Date": "March 26, 2013"}, {"Title": "good one", "Author": "Ray Gallant", "ReviewID": "RAYZUNNPPIJ59", "Overall": "4.0", "Content": "wishing I had more cash to have bought an slr  but  what the hey  ay my age why go too good", "Date": "May 2, 2013"}, {"Title": "Not impressed for the price, just an expensive point and shoot", "Author": "AntsCritic", "ReviewID": "R3RDY02JTK5XTK", "Overall": "2.0", "Content": "Was very excited at the thought of a great camera with a great zoom. Read many online reviews before purchasing. Just looking for a good camera for shooting sports, birthdays, etc. Camera had great zoom and neat features, like the 3d pics and the panorama. Loved the camera at first. Then after taking 200 pics in about an hour, camera froze and would not turn off or on or anything. Took battery out to reset. At the end of the day, put the photos on computer and was not at all impressed. Most of the pics were out of focus or blurry. About 10 of the 500 pics I shot were good.  My wife and I were extremely disappointed with this camera, especially that it froze on the first day and the pics wee not any better than the Nikon coolpix 12 MP that I bought used for 50 bucks. We are sending ours back and have ordered a canon t2i. Didn't want to spend that much but  we want good quality pictures. My advice would be spend a little more maybe on like a canon powershot sx40 hs ( my sister has one and it is great) or step up to an entry level DSLR, like the rebel line from canon or just buy a good compact point and shoot for half the price.", "Date": "April 28, 2012"}, {"Title": "Great camera", "Author": "jose", "ReviewID": "R3O00MABHOZSEP", "Overall": "5.0", "Content": "Im happy with this camera, by the budget, is a good choice. Body look little flimsy, but for the price u cant expect a better one.I make different shots test, and the camera take a nice shots. Using the 150mm photo length, is very impressive , little blurry if you don't use a tripod or support.I have had Olympus all my life, one thing i dont adapt, is to the new menu, like Olympus made a change to cut the list. Really i feel this menu little confused, but this is in all Olympus cameras, so i need go again to check the manuals.", "Date": "April 22, 2013"}, {"Title": "questionable", "Author": "gloria ryckman", "ReviewID": "R2H9A4S7VFAHD5", "Overall": "3.0", "Content": "my daughter wanted this. But she was unhappy with the pictures kept saying they looked painted? i thought they looked finr alot better than my camera???", "Date": "April 4, 2013"}, {"Title": "My memory keeper", "Author": "Carol Spell", "ReviewID": "R2Z49XBLIHYB3Z", "Overall": "4.0", "Content": "It's everything I expected and I haven't really given it a full test yet but am anticipating more great results", "Date": "May 20, 2013"}, {"Title": "Definetely no a pro camera", "Author": "Sixto A. Lopez D.", "ReviewID": "R3PM9CZLCCQ0P9", "Overall": "3.0", "Content": "Even for beginners this camera is elemental with very few options to manipulate your shots manually; the only real advantage is the zoom, outstanding for the price; so if you are looking for a standard digital camera with a great zoom this is for you but If your intention is to get a pro camera with a myriad of features and options you will have to spend a bit more...", "Date": "December 5, 2012"}, {"Title": "Bought this as a gift.", "Author": "J. Forness \"A. Forness,\"", "ReviewID": "R34FPDS0OWGXS7", "Overall": "5.0", "Content": "I have not used the camera, but it looked well built and easy to use.  A great point and shoot camera with few Bells and WHistles to get in the way.", "Date": "May 8, 2013"}, {"Title": "Olympus SP- 810 Camera", "Author": "Paul Jacobson", "ReviewID": "RHE4VHLS8TG9S", "Overall": "5.0", "Content": "I am looking forward to using the camera,  I have had an Olympus camera before and I found it to be very good quality.  The only thing I was very discouraged was the manual, as it had very little letters and was extremely hard to read.  I went to a local printer and had a manual printer with 12 pt type and found it much better, but now the manual does not fit in the camera case. Paul Jacobson", "Date": "May 14, 2013"}, {"Title": "gift", "Author": "Lori Anne Bovat", "ReviewID": "R2SHVYHNHHHJQM", "Overall": "1.0", "Content": "unfortunatley we never got a chance to use this camera - it was sent back because my daughter decided she wanted something else for christmas.  perhaps we will purchase it again some time for me.", "Date": "December 28, 2012"}], "ProductInfo": {"Price": "$349.99", "Features": "14mp Digital Camera\n36X Ultra Wide Optical Zoom (24-864mm EQUIVALENT)\n720P HD Movie with HDMI Control Magic Art Filters (Still & Movie)\nHIGH-SPEED SEQUENTIAL SHOOTING DUAL IMAGE STABILIZATION FACE DETECTION", "Name": "Olympus Sp-815uz 14mp Digital Camera Hdmi 36x Wide Angle 3d - Black", "ImgURL": "http://ecx.images-amazon.com/images/I/31bSsTFH8dL.jpg", "ProductID": "B00AOQCS82"}}