{"Reviews": [{"Title": "Good Camera - Great Price", "Author": "Mark A. Krehbiel", "ReviewID": "R2XVRB98VZ8QOE", "Overall": "4.0", "Content": "I am used to an old 1970's Nikomat Film Camera, and have only used a few low end digital cameras. I read many reviews and decided to go with the Fujifilm Finepix S2400 but they were out and sent an S4400 instead. I think they are virtually the same camera with slightly more zoom on this one. I don't see another difference but there may be some. Overall I am very happy with the camera. The price amazed me. I've payed alot more for some of those earlier digital cameras and they were 3mp and not good.For the BASIC USER - This camera is not bad as a point and shoot with a few quick things to learn. Put it on automatic setting, and you MUST hold the shoot button half way down for just a moment so it will focus then push the rest of the way to shoot. Otherwise it will Not Focus correctly. Easy essential trick.For the MIDLEVEL USER - With a half hour with the owners manual (I downloaded a better one on line) it has many interesting features. Smile recognition, Blink Detection, Night time shots, Snow etc. etc. etc. There are many features available on this camera. As I read more I was amazed at all it can do.For the MORE ADVANCED USER - This camera has manual settings where you can directly set the speed and aperture. I'm still trying to figure that part out. So far it seems to work better on automatic or specific scene selection than I'm able to override and tweak manually.OVERALL SHOT QUALITY - I'm very happy with the quality of the photo's. It has an amazing ability to pick up details on a stone building 50 feet away. Good quality images.CLOSE UP SHOTS - are excellent! I'm very impressed. Flowers on the table were awesome. It can shoot maybe one inch away from an object. Cool possibilities.ZOOM SHOTS FAR AWAY - Are quite good too. 28x real zoom is great. Of course when you zoom far you will need a tripod or rest against something. I've shot vultures and eagles flying high overhead and it focuses well and grabs them. When I put them on the computer and crop it they are pretty good for hundreds of feet up in the sky and moving. Helps me identify what that bird is way up there circling. Daytime moving planes captured pretty well too.NIGHT TIME - I've shot chemtrails by full moon. Pretty interesting. Of course nothing is moving in the shot, camera was leaned against a post for stability, and opened the lens up to longest shot of maybe 4 seconds.ACTION SHOTS WELL LIT - It does pretty good. But there is about a one second delay from when you push the button to when it shoots. Faster in brighter settings. So sometimes I have to plan ahead.DANCE SCENE ON STAGE LOW to MIDLEVEL LIGHT with LOTS OF ACTION and FLASH TURNED OFF - Total Fail! It's asking alot of a camera to try this. I wasn't going to blind the performers with a flash. It needs time to grab enough light so it has to be a longer exposure so the action just blurrs. Out of 188 shots I ended up with maybe a handful of good ones and maybe 20 workable. MY old SLR film camera with super fast film could have pulled it off pretty well. A friends higher end digital camera did a little bit better but still had problems so it was just bad conditions.VIDEO - Is NOT very good. It works but not great quality. If you need a Video Camera I don't recommend this one. It works but quality is not great. Perhaps look at a video camera to go with your shot camera as 2 seperate things?SOFTWARE - I'm never happy with software so... I installed and uninstalled it 10 minutes later. It may be great but I'm not one to decide that. I just open a window and drag off the camera to a folder. Works very easy like that.BATTERY LIFE - Amazing! 4 AA cells is great. I use rechargable batteries and did 6 hours of shooting yesterday with one set. I generally use the viewfinder and not the screen to shoot which likely helps some.SIZE - It's bulkier than one of those little flat camera's but still fits in my fanny pack just fine. Light weight.Overall I am very happy. Price is wonderful. Easy to use. Much higher quality than the older small digitals I've had before. Works very well for my needs and I'm used to a high end film SLR.", "Date": "May 18, 2013"}, {"Title": "great camera", "Author": "Chad", "ReviewID": "R1XO1MK0L7TLY6", "Overall": "5.0", "Content": "I purchased a Canon sx150 and wanted additional zoom and better low light performance...purchased a GE x600 and returned for s4400 and could not be happier...pics of my daughter's orchestra recital last night with ISO set at 400, tripod and full zoom were impressive...set image quality to 12mpIf your looking for manual controls, long zoom, great images (color 2nd to none), and good low light performance look no further than this Fuji", "Date": "October 16, 2013"}, {"Title": "Fuji Finepix S4400 digital camera", "Author": "Steven Crabb", "ReviewID": "R2M405Q8VKJTOX", "Overall": "4.0", "Content": "So far I have really enjoyed this camera. I still have a lot to learn about all of the features this camera has to offer. I find this camera to be very user friendly.", "Date": "June 16, 2013"}, {"Title": "just what i was looking for", "Author": "Deanna Wagner", "ReviewID": "R9D230CET1FT3", "Overall": "5.0", "Content": "We purchased the camera for a trip to England, and we are pretty technologically dumb. So I was hoping that I could understand it well enough to use it to its optimal ability. Although there are still functions I haven't used yet, it is very easy to use and understand. Compact and lightweight with a great zoom lens. It went everywhere with us and they pix were easy to upload and burn onto a disc. I would absolutely recommend!", "Date": "September 22, 2013"}, {"Title": "Very Nice Camera", "Author": "Kindle Customer", "ReviewID": "R1J5FTTZIC4GTK", "Overall": "5.0", "Content": "I got the Fujifilm S4400 to replace an older S1000 that I really liked. This is my 3rd Fujifilm camera. The S4400 has 14mp with 28X zoom.  I’m still learning all the bells and whistles but so far it has exceeded all my expectations.  It uses 4 AAQ batteries.  I use rechargeable AAs and keep an extra charged set in my camera bag. I like the idea that I can buy regular AA batteries if I need to replace my rechargeable ones while out and about.I like using the viewfinder most times but the 3” screen is nice for reviewing pictures, using the macro feature, or recording video. The function controls are nicely placed and easily accessed without having to take the camera away from your eye. The viewing screen is 3” which is bigger than my old one; however, I still get nose prints on the screen when using the viewfinder.I like the macro and super macro modes.  I use them to get really tight shots of flowers and such.  You can get within an inch or so of your subject and the picture comes out great.  You do need to watch the lighting around the camera to avoid shadows in the picture.The video mode is ok for a camera but not great.  You can use the zoom up to 3X while filming with the 4400 unlike the 1000 which would not zoom while recording. The sound quality is very good but there is a little motor noise (not too bad) recorded while zooming and recording.The lens cap snaps on and stays put as opposed to the old one that just pushed on the lens and came off anytime you touched the camera.  The camera will not function with the lens cover on (which is a good thing) and gives you an error message telling you to turn the camera off, remove the lens cap and turn the it back on again to use.The panorama feature is awesome.  It’s best to use a tripod for a steady shot.  Take the first picture then line up the two “+” marks until they turn into an “o” and the camera automatically takes the next picture then repeat for the 3rd shot. The camera stitches the 3 shots together with amazing results.  The zoom feature does not work in the panorama mode.This camera has red eye and face detection which are nice.  It also has smile and blink detection which I’m still trying to figure out how they work but should be interesting.My only negative comment is a minor one and concerns the camera strap.  The strap that came with my S1000 is a much better quality then the one that comes with the S4400.  Not sure why they would skimp out on the strap but it’s no big deal for me because I just switched them around.Overall I really like the Fujifilm S4400 and would recommend it to anyone wanting a good camera that takes great pictures, at a reasonable price without getting into the expense or complexity of a DSRL camera.", "Date": "December 22, 2013"}, {"Title": "FINE PIX CAMERA", "Author": "Gene Lynch", "ReviewID": "R2X6U2MQ3VV49K", "Overall": "2.0", "Content": "FLASH DOESN'T WORK AND THERE WAS NO INSTALL CD. OTHERWISE THE CAMERA WORKS OK. I WAS LED TO UNDERSTAND THERE WAS CD INCLUDED AND NO MENTION WAS MADE ABOUT THE FLASH NO WORKING.", "Date": "November 17, 2013"}, {"Title": "Would be ideal if...", "Author": "Boycotting Fujifilm", "ReviewID": "R39LUYJTQCB434", "Overall": "1.0", "Content": "I wanted a camera that I could carry with me while on my outdoor adventures. I wanted more than a point and shoot but didn't want to risk breaking my DSLR. I felt that this would be a great medium. I anxiously awaited the arrival of my new camera just to be let down. The flash doesn't work. I contact customer service and was told that they might be able to fix it but wasn't quite sure. The place I bought it from was going out of business and would not allow returns. Now I am stuck with a camera that I can only use in situations not requiring a flash. Don't waste your money. I can get the same quality pictures from a point and shoot and have the ability to use the flash when needed.", "Date": "August 1, 2013"}], "ProductInfo": {"Price": "$188.25", "Features": "14 megapixels\n28x optical/6.8x digital zoom\n3.0-inch large, bright LCD display\nhigh precision optic technology are provided for the 24mm wide angle lens", "Name": "Fujifilm FinePix S4400 Digital Camera, Black", "ImgURL": "http://ecx.images-amazon.com/images/I/41wFTGIN-FL._SX300_.jpg", "ProductID": "B00ANCZO42"}}