{"Reviews": [{"Title": "Good quality compact DSLR camera", "Author": "J. Stewart \"Jim\"", "ReviewID": "R2KVJ9GLYE5QB1", "Overall": "5.0", "Content": "Small and light camera which produces quality photos and video footage.Had a problem with the Vivitar replacement battery; it would not recharge in the camera. Focus Cameras agreed to send a replacement battery immediately after notifying them of the problem.", "Date": "December 23, 2012"}, {"Title": "Amazing deal and product.", "Author": "Lodisius", "ReviewID": "R37JNWPP1BD3AZ", "Overall": "5.0", "Content": "One word FANTASTIC! I'm a college student I play sports and like to go out there with my girlfriend doing outdoor activities. This camera can do it all! The extra items that comes with the deal are simply helpful for the performance and affordable for a college student. I don't want to spend thousands of dollars on those big bulky DSLRs when I can have the same capabilities with Sony NEX 5r. I even got the Flash which cost about $100+ free from the deal. I SAVED a lot and really satisfied.", "Date": "July 18, 2013"}, {"Title": "Great Choice", "Author": "cecilia", "ReviewID": "R38HWP3E1339JA", "Overall": "5.0", "Content": "That's exactly what I want, a light and somewhat professional camera. I brought it to my trip to Germany and took tons of photos. I love it and would definitely recommend this to others.", "Date": "September 11, 2013"}, {"Title": "awsome", "Author": "Fernan", "ReviewID": "R2IW96FA70OPEE", "Overall": "5.0", "Content": "perfect camera for beginners specially in doing a manual focus. great shutter speed high iso only cons are the menu on the screen", "Date": "January 9, 2013"}, {"Title": "The camera I wanted to have", "Author": "David Salischiker", "ReviewID": "R2YXMRQDUOAXO3", "Overall": "5.0", "Content": "Great product.The size is perfect and the Quality is very high!!!Perfect balance between Quality and Size!Recommended!!!I love it!!!", "Date": "December 30, 2013"}, {"Title": "Great Camera Bundle", "Author": "Isaac", "ReviewID": "R2LBJ7UO9PQRPB", "Overall": "5.0", "Content": "This bundle was a great deal for everything that was included in it. Other places I checked they would sell the camera body for about $500 dollar alone, without the lens so this deal was incredible and I am so glad I found it.", "Date": "October 26, 2013"}, {"Title": "Great build quality", "Author": "Xavier H.", "ReviewID": "R2CPEF6LH182EQ", "Overall": "5.0", "Content": "I bought this camera for a friend, so I don't have used it very much, but I can tell that the build quality is great, the design is very comfortable to handle and the picture quality is great. It is a little more expensive than other models and brands, but the features and specifications well worth it. In terms of portability I prefer smaller models like Nikon 1 J2 o J3 series, but they also have minor specifications and features, so you can choose one or other according to use you're planning to do. The bundle is a great choice and is a real saving that worth to have. In resume, it is a great choice if it is on your budget.", "Date": "October 22, 2013"}, {"Title": "Excellent compact camera", "Author": "Trini LuvyT", "ReviewID": "R20RFN2NS3OLN2", "Overall": "4.0", "Content": "I have very recently entered the realm of amateur/hobbyist photography and I am loving every chance I get to snap off a few shots! I haven't mastered the photog speak and as such I won't attempt it but will give you the basics of my experience thus far.As a mom, I have been able to capture stunning indoor night-time picture of my kids and nieces and nephews. The clarity of the pics were exceptional when compared to the bridge camera I got for Mothers' Day this year. With little to no effort and without having to use the auto setting, I can achieve great focus and lovely \"bokeh\" (oh oh, photog speak :)Focusing has been really quick and the intelligent auto has been giving me some impressive results. I have been using 3 different lenses...the kit lens (18-55mm), Sigma 30mm f 2.8 and Sony 16mm pancake. The clarity of the Sigma lens has been an eye opener.The LiveView display is a really helpful tool for beginners like me who are still trying to come to terms with the f-stops and shutter speeds. Once you adjust either or the exposure, you can see on screen instantly how the final photo will render! I particularly like this feature. I miss having an EVF however, and purchasing this as an accessory is not that crucial for me right now. I would rather spend that money on a macro lens!The menu and controls DO take some getting used to but I found that this camera makes you want to dig into it to discover all that its capable of! Read the manual or even the Sony NEX 6/5r manual by Gary Friedman...you'll be well on your way to getting photos that you would be proud to print and display!My camera came with battery fully discharged so I had to wait to charge it before I could try it. The charge does seem to take quite a few hours and the battery charges in camera only. The supplemental battery that came with this kit is a definite plus and I purchased an external charger and 2 more batteries as I plan to use this camera on an upcoming trip to the Caribbean.So shoot in RAW, use Lightroom for a little post-processing and you won't be too disappointed at all. I have yet to try the wifi feature, the apps or the video capabilities but as soon as I do, I will edit my review accordingly. In the meantime, enjoy!", "Date": "October 21, 2013"}, {"Title": "Good Product", "Author": "Kevin", "ReviewID": "R1PW4S3MITESNV", "Overall": "5.0", "Content": "Prime is very good! I got the camera in two days. And I took it to  north Michigan in the third day.The camera is very good! I love it and recommend this to my friend. He also bought the same one.", "Date": "October 9, 2013"}, {"Title": "very good quality", "Author": "vina lu", "ReviewID": "R14GRZ38396CZF", "Overall": "5.0", "Content": "everything is good. Love the accessories. still learning to use it! but why it is $50 cheaper now!!!...still worth the purchase.", "Date": "September 26, 2013"}, {"Title": "Worthly", "Author": "Olivia", "ReviewID": "R1BQ5PFFHJVY7L", "Overall": "5.0", "Content": "It's pretty cool~ Every function is very useful. And the introduction is helpful. Don't hesitate! Just buy it. You will never regert !!!!!!!!!!!!!!!!!!", "Date": "September 9, 2013"}, {"Title": "Good product, but a couple of details should be reviewed", "Author": "Rodrigo Soares de Camargo", "ReviewID": "RVLQ5SL879LKK", "Overall": "3.0", "Content": "The camera is really good, excellent,  but the zoom is not enough with 18x55mm lens.The replacement battery pack doesn't work correctly. I will try to let Focus Camera know.", "Date": "August 17, 2013"}, {"Title": "good! nice", "Author": "Daiwei", "ReviewID": "R3O3GL8AO1X768", "Overall": "5.0", "Content": "Feel good. It's very comfortable to use and look forward to for a long time finally to start  ！！！！！！！！！ goood", "Date": "September 4, 2013"}, {"Title": "Sony NEX 5R", "Author": "Sandy \"book lover\"", "ReviewID": "R1TZDQ3GTNF0E2", "Overall": "5.0", "Content": "Still learning to use the camera.  Will take time to get comfortable with making the adjustments possible with the various settings. So far so good,  And the automatic control settings work great while I'm learning.  Pictures are excellent.", "Date": "June 29, 2013"}, {"Title": "Came highly recommended", "Author": "Murali B Reddy", "ReviewID": "RKLWYE9PW7U8L", "Overall": "5.0", "Content": "I bought it as a gift on the recommendation of a friend.  He is very tech savy and did thorough research.", "Date": "June 21, 2013"}, {"Title": "Best camera with dsrl features", "Author": "A. Gift For You", "ReviewID": "R54G9VOHE8MLK", "Overall": "5.0", "Content": "This has to be one of the best offers in the Internet. The camera is awesome and all of the accessories are first class. Best on the market.", "Date": "June 5, 2013"}, {"Title": "loved this product", "Author": "Renato Antonio Haddad", "ReviewID": "R9AT9DQ6NQ1RK", "Overall": "5.0", "Content": "I loved this product because it is very good for what I use. Surprised me. I nominate this product who want make beautiful pictures.", "Date": "March 13, 2013"}, {"Title": "Good camera", "Author": "Bost", "ReviewID": "R1DZGHG9NNU601", "Overall": "5.0", "Content": "It is a good camera. Good deal with card, case, battery and filter. if a car charger included, will be perfect.", "Date": "January 25, 2013"}, {"Title": "Perfect gift", "Author": "santa", "ReviewID": "R1CKU49JVOOXKW", "Overall": "5.0", "Content": "This camera has more features than we had initially looked for in a device. Easy to use, easy to sync with pc and folders, and the pictures are amazing.", "Date": "January 20, 2013"}, {"Title": "Sony nex 5r", "Author": "ELRAISULI", "ReviewID": "ROBS1DXP7MI1O", "Overall": "5.0", "Content": "Excellent camera, very responsive, creative modes superb, light and easy to carry. Accesories not too expensive. Well packaged and shipped promptly.", "Date": "January 5, 2013"}, {"Title": "more than I expected.", "Author": "Esther Moral", "ReviewID": "R15HAU4VE3TZH0", "Overall": "5.0", "Content": "I think this producto contain all I needed for my level in photography.this camera allows obtain really good pictures with nice light and a perfect size for lazy photographers.I totally recomnend it", "Date": "August 10, 2013"}, {"Title": "good", "Author": "ayeon k.", "ReviewID": "R1PMY2UWPQGXOC", "Overall": "5.0", "Content": "I am sure it will fit perfectly to my needs. I am really very exited to use it, yay and happy", "Date": "July 1, 2013"}, {"Title": "Great camera!", "Author": "an", "ReviewID": "R2C2AP4FJO8RBL", "Overall": "5.0", "Content": "meets daily requirement, does well on micro shooting (the 18-55mm lens)does need more lenses to photograph different kinds of scenesvery easy to operate, has good quality and portable", "Date": "December 11, 2012"}, {"Title": "Awesome camera", "Author": "R. Rezek", "ReviewID": "R2C0P766KZ90I8", "Overall": "5.0", "Content": "This cam does exactly what I bought it for, to be compact yet shoot amazing pictures while being able to capture hd video. I'm not someone who knows a lot about dslr and mirrorless camera so I'll leave detailed info to someone else. But for the people that are completely new to dslr cameras and have always wanted to get into it. This is a great camera. I'm a complete noob but I've learned a lot since I owned this cam. Love the feature to instantly send my pictures to my android phone or tablet through wifi and sony app.", "Date": "March 19, 2013"}, {"Title": "Like it. Product is exact same as discribed", "Author": "Feng L.", "ReviewID": "R27QWOMC1OMT2J", "Overall": "5.0", "Content": "The camera works well.All the accessories are good and useful.highly recommended to purchase!if you are a beginner photographer and like cool camera, this one will be definitely a good choice.", "Date": "June 14, 2013"}, {"Title": "Very good camera on the go..", "Author": "Dick L. Leung", "ReviewID": "R1AOEJ141HU63G", "Overall": "5.0", "Content": "Small package, with good lens combination.. auto mode picked light scene correctly and chose matching shooting method. Overall experience very solid build and produce excellent travel photos in any light conditions..", "Date": "May 19, 2013"}, {"Title": "Great!", "Author": "Sub", "ReviewID": "R2PYTVKTGTIVOO", "Overall": "4.0", "Content": "I don't know how good a DSLR can be. I don't have one for comparison. But the image quality is great. The accesories provided are good quality. I wasn't able to use the functions as the software on the camera is not very intuitive. But then again, I've been spoilt by cool software on my smartphone. Cameras need a lot of catching up as far as ease of use is concerned.I still have to figure out taking pictures in low light conditions. Fast delivery!", "Date": "February 18, 2013"}, {"Title": "It is Ok", "Author": "RUi Li", "ReviewID": "R16CWUOMNXXD6P", "Overall": "3.0", "Content": "I am always looking for this stuff for a long time. When I got it, nothing special, just use it. The photos are good quality and vedio is also ok for me.", "Date": "June 7, 2013"}], "ProductInfo": {"Price": "$773.00", "Features": "Sony NEX-5RK/B 16.1 MP Compact Interchangeable Lens Digital Camera with 18-55mm Lens and 3-Inch LCD in Black\nSony 32GB SDHC Class 10 - Sony Camera Case\nReplacement Battery Pack - 49mm Filter - Lens Pen\nProfessional Camera Strap\nScreen Protectors", "Name": "Sony NEX-5RK/B 16.1 MP Compact Interchangeable Lens Digital Camera with 18-55mm Lens and 3-Inch LCD in Black + Sony 32GB SDHC + Sony Camera Case + Replacement Battery Pack + 49mm Filter + Accessory Kit", "ImgURL": "http://ecx.images-amazon.com/images/I/51VVVsJzShL._SY300_.jpg", "ProductID": "B00A4BJTPW"}}