{"Reviews": [{"Title": "Great Waterproof Point and Shoot", "Author": "Jamie", "ReviewID": "RF6LIHEQK7K08", "Overall": "5.0", "Content": "I have only used this camera underwater once so far, but it was absolutely fantastic.  I took it to the swimming pool with my daughter and niece as a test run, and got some great shots of my niece swimming underwater, and alternated with underwater shots and above the water shots.  The camera is made to slough off the water as soon as you pull it out, so the pictures out of the water don't have spots or water drops on them.  It seems like a minor thing, but it really made a huge difference.  As for being waterproof, it seemed to hold up great.  After we got home, I noticed it had some chlorine spots on a couple pictures (after I tried to use a dry cleaning cloth on it) so I soaked it in a sink full of clean water for about 5 minutes, and voila!  Perfect photos again.  I've seen some reviews that say this camera doesn't work well inside, haven't noticed a problem myself.  Pretty much every single picture I've taken with the camera has turned out with great color balance and good lighting.  I have had a couple overexpose a bit with the flash, but hey, this is a point and shoot camera, not a professional grade camera.  The overexposure can be fixed on the camera itself with the offered image editing or with editing software on your computer.We'll be taking the camera on a trip to the lake in a week, so we'll see how it holds up with the sand and murky water, but so far I am more than pleased with this little camera, especially for the price!  Can't wait to take it out and play with it some more.EDIT: Used this camera on a trip in pools, lakes, and rivers.  Had a blast.  Got some great shots in the water, above the water, canoeing, kayaking, and even in a water feature fountain thing for the kids to play in, all with no worries about water leakage.  I do recommend purchasing a floating wrist strap because the camera itself doesn't float if you drop it in deep water.  Even in the lake and river the pictures came out great, though you need to be close to your subject in dirtier/murkier water.  After a month and a couple weeks, I'd say it's already earned its keep for the price I paid.  I think we took somewhere around 1600 photos on a two week trip with this little camera, and 99% of them were fantastic.  I also bought an extra extended life battery, and with constant shooting, I did need to change the batteries about once a day.  But, I take a LOT of photos.EDIT2:  After reading some of the other reviews here, I think something needs to be said - this is NOT an expensive, professional level camera.  It isn't being sold as one, because it's not.  No, you are not going to get perfect pictures every single time.  You're not going to get perfectly clear-as-day underwater photos (although you will get some awesome ones).  This is a point-and-shoot camera that you can take in the water with you.  If you expect more than point-and-shoot quality, you should not buy this camera.  But understand you will spend more money on something else.  For the average user, it is an absolutely fantastic camera for the price.  You can take it anywhere, it fits in your POCKET (how nice is that?) and it will stand up to being dropped, getting wet, getting cold, etc.  Take it on your family vacation without worrying about it.  Now try to do that with a $3000 professional camera.  Also, for people saying the quality sucks, I have blown up some of the photos from this camera to 16x20 prints and hung them on the wall.  I certainly can't tell they were taken with a $140 camera, and neither can anyone else.", "Date": "July 10, 2013"}, {"Title": "Don't know much about cameras but I like this one...", "Author": "Mike Jacobs", "ReviewID": "R1Z46PJIYPDV9O", "Overall": "5.0", "Content": "UPDATE 2: Just noticed another issue. The flash sometimes causes a bit of reflection the color of my finger along the right side of the imate, evidently becuase my fingers are too close (to the flash). This isn't an issue, I just move my fingers a bit. Good thing I preview work-pictures, though. I can't tell you how much I am appreciating the water and dust-proofing in this SE Florida monsoon season! No change in the rating.UPDATE 1: Since purchasing I've used this quite a bit for work and personal photos. I still love the camera - I've been able to take pics in rain, around water and with a 4 year old hanging all over me without worrying about dust, water or dropping it. However, there are a couple of issues I haven't seen in other reviews: (1) the lens is easily \"dirtied\" by a finger print when you take this out of your pocket (no cover), and (2) I have to be more careful about taking photos in the direction of the sun or I sometimes get a big glare-streak... don't know why my other cameras didn't have this problem but it sometimes requires two hands (one to block the sun). These issues have not changed my rating.ORIGINAL REVIEW: Lots of camera-geek analysis here, and from what I read Panasonic meets my criteria - fast cycle after shooting, wide angle, durable and mainstream (\"reliable\") manufacturer. I mostly take photos for work, and any modern camera is satisfactory for family use.This has a wider angle than my Canon PowerShot, which I am replacing, and no moving parts. I can shoot in the rain and carry it in my shirt pocket, neither of which are feasible with the Canon. The unit is \"closed\" so that I won't get construction dust or lint inside the lenses, which is why I need to replace my Canon.Other than that, it's just a nice camera that I can get wet or drop, with all the usual bells and whistles (90% of which I'll never use). The price:value ratio is very good for my needs.", "Date": "February 13, 2013"}, {"Title": "Testing waterproof cameras", "Author": "Sephwin", "ReviewID": "R7U0XXR4XFAWV", "Overall": "5.0", "Content": "I bought 3 waterproof cameras to take with me on vacation to the Bahamas (Used the Consumers Report to pick the cameras). The Nikon Coolpix AW110, Olympus TG2, and Panasonic Lumix FS5. I like the Nikon best for it's true color in and out of water, Olympus for the functions, and Lumix for it's all around used. I found that these three cameras works great if you follow the instructions, like going too deep underwater (Cause to leak and stop the cameras from working) or opening the seal to download your picture without making sure that the cameras have the same temperature as the surrounding environments (this can cause fogging in the lens). Always clean the cameras after used. After my testing, I let my friends barrow the cameras for their used to the beach, pools, snowboarding, and military deployment. The verdict is that my friend love the Lumix most. Great pictures in and out of water. Rugged, the camera survive being drop (snow, water, mud, sand, and even concrete less than 5 ft.). The price also help, it is the cheapest of the three. Panasonic Lumix waterproof camera performed better than what is advertise.US Army Soldier station in Germany.", "Date": "March 5, 2014"}, {"Title": "Works Well.", "Author": "DianeB", "ReviewID": "R12ST2F7AHMRH7", "Overall": "3.0", "Content": "I took this camera to Mexico with us on vacation.  The camera worked well and took some good pictures in and out of the water, as long as you used the normal optical zoom.  My only complaint would be that the Intelligent zoom does not work very well, it's a bit grainy, especially in low light and under water.  Saying that it has an 8X zoom is a bit misleading, since it is not a true optical zoom.  Had no problems with leakage and we snorkeled for a couple of hours.  My husband has an older model that has manual modes and a lot more picture options.  Next time I would go with a higher end model to have those options.  This camera is very small which can make it a bit hard to hold on to and the movie mode button is so small it is hard to push, especially if you had larger fingers.  All in all I like the camera, but some small changes could make it much better.", "Date": "June 23, 2013"}, {"Title": "Self Destructs", "Author": "David White", "ReviewID": "RHKH51DDX41IP", "Overall": "1.0", "Content": "I purchased this camera for its advertised ability to take underwater photos.After following the waterproofing instructions to the letter it did take threeunderwater pictures then promptly died.  It is now useless and only aftertaking three pictures. This camera obviously has a very severe design flaw.Now we have to try to convince the company to exchange or refund our moneyI am not sure how that is going to turn out. If it is an exchange I will notallow this camera near water again.If you are considering an underwater camera, Definately, DefinatelyLOOK ELSEWHERE.", "Date": "October 15, 2013"}, {"Title": "Decent camera but I sent it back for a few reasons...", "Author": "S. Olson", "ReviewID": "R2ZM0M64ZKGCR3", "Overall": "3.0", "Content": "I was really excited to receive this camera prior to going on a vacation to Playa Del Carmen, Mexico. On first use, it was great! I took a lot of pictures in the LAX airport and upon arrival to Cancun (where we flew in). It worked great. Powered on fast, fast shutter speed, fast focusing, and it took good quality pictures as I found out once downloading them to my laptop.I used the camera in the pool and at the beach. Waterproof? Absolutely! I can only attest to its water integrity to about 3-4 feet, but it passed with flying colors. No leaks! Floats well with the floating wrist straps.The second day of our trip I noticed a slight fogging of the lens on the inside. I had read that once you open the case (you have to do download pics) you can allow moisture in. It's very hot and humid in Playa Del Carmen so that's likely what happened. From this point on the camera was useless for the trip. I wasn't going to hold it against the camera because that's just the way it goes once moisture gets into something. But my sister bought the same camera for this trip and she never opened the case the entire time. Her's also began to fog up (not as severe as mine) and that's what really worried me. Waterproof cameras are awesome, but when they fog up, that's that! You can get strips to put inside the latch to absorb the moisture, but I didn't have that at the time.I was still set on keeping the camera but I also discovered later that the video was a bit grainy. I thought it must have been set to a lower setting, but it was full quality. I have a Casio EX-S10 that takes much better quality video (and audio) than this camera and it has less lines of resolution.So anyway...the camera went back today because I don't feel it lived up to the advertisement. I'm pretty fair in my opinions when it comes to my gadgets, so I gave an honest assessment of this product. It's a good camera, and the fogging could probably be corrected with adding strips to absorb the moisture, but the video was the deal breaker for me.3 out of 5 stars. Good, but could be better.", "Date": "July 3, 2013"}, {"Title": "This camera made my wonderfu trip to the Great Barrier Reef fabulous!", "Author": "MWM", "ReviewID": "REC3L7IWKQKDI", "Overall": "5.0", "Content": "This camera was a last minute purchase. I had everything packed for my trip to Australia and had not done enough homework to warrant buying a waterproof camera. A good friend came over, checked the specs on what was available and not too expensive, and recommended this one. I ordered it Prime, received it, packed it, read the instructions on the plane, and then used it to photograph divers on the Gold Coast and underwater coral and fish! This camera lived up to and exceeded all expectations. It never leaked. The battery time was fine. The photos and videos were spectacular. I followed the instructions on how to desalt it in freshwater and it came back time after time. With the exception of the prescription diving mask that I bought, this was my second most important purchase for my trip.", "Date": "August 25, 2013"}, {"Title": "2 cameras, both leaked", "Author": "Mike M.", "ReviewID": "R1FVAS0E2V4O5P", "Overall": "1.0", "Content": "I purchased camera #1 for a trip to Belize last year. It worked well for the first day snorkeling in 8 feet of water, then leaked the 2nd day. The instructions are VERY precise describing how to ensure a waterproof seal and there is NO room for error. I followed the instructions exactly and this camera still leaked. The photos from day #1 however, were excellent. I returned the camera and received a replacement. I'm not sure if salt water is the problem, but the battery terminals were heavily corroded.I just returned from a trip to St. Croix. The camera did not make it through day #1. Again, I followed the instructions precisely and the seal did not hold. I do not recommend buying this camera. I met a couple on vacation with a Canon PowerShot D10 camera that they have had for three years with absolutely no problem. This Panasonic camera is finicky and requires a surgeon's precision to operate.", "Date": "August 10, 2013"}, {"Title": "Safe to take fishing", "Author": "JoEri \"woodswoman\"", "ReviewID": "R23BB0H64B2B5D", "Overall": "5.0", "Content": "Fell in the stream when I was fly fishing.  I always take a camera along.  Needless to say I ruined it.  Decided to replace that camera AND get this one.  I love Lumix cameras because of the ease of shooting photos, the support from Panasonic (which I do not have to use often), and the wonderful photos.  I look forward to taking it into the stream when we fly fish soon in Colorado.", "Date": "July 27, 2013"}, {"Title": "Echo other reviews of poor quality waterproofing", "Author": "ra_rush \"ra_rush\"", "ReviewID": "R1DDPSZCXQFGC8", "Overall": "1.0", "Content": "I am so disappointed to have to echo other reviews of poor quality.  I was initially very happy with the picture quality.... then the camera got wet ( pool, not deep ).  It took pics in the pool, but the next time I started it the screed was not clear - to the point of being unusable.  As soon as I'm back from my trip, this is back to Amazon.", "Date": "November 21, 2013"}, {"Title": "Poor workmanship and worst customer service(Panasonic)", "Author": "Early Riser \"Early Riser\"", "ReviewID": "RSLWGR2AP60L8", "Overall": "1.0", "Content": "This was the 3rd Lumix I had this year.  The first was damaged in a fall so it was replaced by the insurance company. The replacement had such a shutter lag i missed most of my shots.  I called Amazon and they replaced it with no problem.  It seemed slow, but not as bad as the previous one.  I took it in Oct (from purchasing in July of this year) on a Snorkel Trip.  After the first 5 pictures it leaked, badly.  I have been taking pictures underwater for sometime, so I know everything was checked and double-checked.  I called Panasonic when I got  back and they told me to expect a claim number and label in my email in 48hrs.  well, 48 came and went.  I called in again, and they told me the plant, or whomever was in Texas would not issue a label.  I would have to pay to have it sent to be inspected.  I requested to speak with a supervisor since this was a 3 month old camera.  They said someone would call.  That was last month.  I gave up on them and called my insurance company and filed a claim, which they took care of immediately, INCLUDING the shipping label.I will NEVER BY PANASONIC AGAIN.  Why deal with a company who will not back up their own products.", "Date": "November 11, 2013"}, {"Title": "great camera", "Author": "anna", "ReviewID": "R1GNIO8KFVZR5A", "Overall": "5.0", "Content": "I bought this camera to take on my honeymoon to the caribbean.  I love it.  The instructions are clear, it is very easy to use and I am delighted with how my pictures turned out- above water and under water.  Only con is that I wish it would zoom a little more.  For the price, I'm super happy with this camera.", "Date": "May 9, 2013"}, {"Title": "Very happy with this camera", "Author": "kerwin8r", "ReviewID": "RNM5CRSIFJ231", "Overall": "5.0", "Content": "Just got back from Maui and reviewed all of our pictures and videos.  Everything came out great. Camera worked at depths of 10 ft+ while doing Snuba.  Got great pics and video of reef fish and sea turtles! Pools, waterfalls, dry land, jungle zip lining through the air, panorama shots, this camera did it all and did it well.  Combined with a Transcend 300X 32GB sd card. Only used 4GB on a week long trip.Make sure you keep the orange seal area clean after opening to remove memory card or charge the battery and you should have no issues with water getting in. I also did not notice any fogging of the lens. Highly recommend this camera and thought it worked as well or better than any of my Canon point and shoots I have had in the past.", "Date": "August 30, 2013"}, {"Title": "This camera is NOT waterproof", "Author": "George Harris", "ReviewID": "R1GZTWC5JAHAML", "Overall": "1.0", "Content": "Purchased the camera to take underwater pictures during a dream vacation.  I followed all instructions.  Within about 2 minutes the camera began leaking and was ruined!  I was only in about 3 feet of water at the time.", "Date": "September 11, 2013"}, {"Title": "Water proof camera", "Author": "Skeet", "ReviewID": "R41PW5LP2YHTY", "Overall": "4.0", "Content": "Very nice camera for the money, used it on shore excursions on cruise,  took it in water and tubing worked well. Good quality pictures .Would buy again.", "Date": "March 16, 2014"}, {"Title": "A handy little camera", "Author": "Steven Pereira", "ReviewID": "RY3GZ182LM5V7", "Overall": "4.0", "Content": "I like this camera a lot. It was purchased for a cruise where I had planned a couple of snorkeling excursions. It performed just fine...not the best pictures I've ever taken, but it did the job for very little money. I'd never had the illusion that I'd be a master underwater photographer, so I wasn't disappointed with the pictures I got.  Some were fantastic and others were total crap...it totally depended on the light and my (lack of) ability to manage to stay in one spot and not be tossed around by the current.PROS:Cost...hello...I got this camera for at least sixty bucks less (thanks Amazon) than it was being sold in local shops or on the cruise ship itself.Size...it's tiny...so tiny that it fit in the pocket of my very small bathing suit.Picture Quality...on land it did a fine job for an affordable point and shooter. In fact, I was very surprised at the quality of some of my shots. Given the right light and circumstance the pictures turned out beautifully.Water Resistance....that's right. I didn't say 'water proof'. Nothing is water proof if you can open it up. While I did have one instance where there was a tiny bit of fog on the inside of the lens...I just opened it up and let it dry out while I ate lunch. Presto! Clear again. But, otherwise...no problem while being underwater for a couple hours.Cuteness...It probably doesn't count to many people...but, this darn camera is a cutie pie. I was proud to pull it out and it always caught somebody's eye.CONS:Picture Quality...yep...it's under Pros too. It's probably not the camera's fault but I must have taken a hundred pictures underwater and I ended up keeping about fifteen of them. The clarity of the pictures wasn't the best...but, again, that's probably due to the fact that I was underwater that isn't as clear as the air.  (duh.)Software...the photo viewing/editing software that Panasonic offers is crap. I ended up just moving all the pics from the SD card over to my Kodak easyshare software.SD Card....this camera uses a regular sized SD card and not the micro DS card that I already had.  But, I solved that problem by buying an adapter. When that is number three on my CONS list...you know it's not a big problem, right? The camera did happen to handle my 32 gb high speed micro sd card beautifully....no drag at all. Pics were saved super quick and I could take another shot in a second.That's it...I would really recommend this camera to anyone going on a vacation when they don't want to risk using their phone or a nicer camera.  It worked well enough underwater and just fine above water.  I'll probably still use my phone as my every day shooter and my digital SLR for other stuff. But, for cruises and pics by the water....I'll take this little gem with me.", "Date": "December 8, 2013"}, {"Title": "Works Great", "Author": "Jason Pele", "ReviewID": "R32EY8AC6YJYZY", "Overall": "4.0", "Content": "I've used this camera in both fresh water and the ocean, as well as pools and it hasn't leaked or had any noticable problems yet.  For the price, the pictures it takes are good enough quality for me.  I wouldn't reccomend it for diving or scuba, but it's a great camera to have around during the summer when out at the pool or beach.", "Date": "June 17, 2013"}, {"Title": "So far so good", "Author": "Christel", "ReviewID": "R2DZE1DAATN7F5", "Overall": "4.0", "Content": "Im satisfied with the pictures it takes under water, as a point and shoot camera is ok as well, if used a lot of zoom since it's digital the pictures dont look so great, but that is expected. Overall the camera works for what is intended water activities pictures.", "Date": "May 14, 2013"}, {"Title": "River Rafting", "Author": "Lance S. Micklus \"Lance M\"", "ReviewID": "RGQNIGK6RQI4V", "Overall": "4.0", "Content": "<!--\n\nfunction fp_resizePlayerSpace(nsPrefix,w,h)\n{\t\n  try {\t\n    var ifrm = parent.document.getElementById(nsPrefix + \"movieFrameID\");\n    if (ifrm) {\t\n        var h2 = h + 35;\n        ifrm.style.height = h2;\n      }\n    } catch(err) {\n \n    } \n\n\n  if (h > 0) {\n      document.getElementById(nsPrefix + \"clipDiv\").style.height=h+\"px\";\n      document.getElementById(nsPrefix + \"videoPlaceholder\").style.height=h+\"px\";\n  }\n  else {\n      document.getElementById(nsPrefix + \"clipDiv\").style.height=\"\";\n      document.getElementById(nsPrefix + \"videoPlaceholder\").style.height=\"\";\n  }\n  document.getElementById(nsPrefix + \"flashcontent\").style.height=\"100%\";\n}\n\nfunction fp_rewriteDiv(nsPrefix,divName,html)\n{\t\n    document.getElementById(nsPrefix + divName).innerHTML=html;\n}\n\nfunction embeddingPopup(nsPrefix)\n{\n  alert(\"placeholder function for embedding code\");\n}\n-->\n\n\n<!--\n\nfunction cv_moJVAVH2WT46ZTembeddingPopup(){\t\nalert(\"Embedding code will be displayed here.\");\n}\n\n-->\n\n\n\n\n\n\n\n\n\n<!--\nfunction cv_moJVAVH2WT46ZTrefresh_preplay() {\n\ndocument.getElementById(\"cv_moJVAVH2WT46ZTchiDiv\").innerHTML = document.getElementById(\"cv_moJVAVH2WT46ZThiddenPre\").innerHTML;\n};\ncv_moJVAVH2WT46ZTrefresh_preplay();\n\n-->\n\n\n\n\n\n\n        // <![CDATA[\n\nvar cv_moJVAVH2WT46ZTso;\t   \n\n\nfunction cv_moJVAVH2WT46ZTloadSwf_Core(swfLocation, swfWidth, swfHeight, flashVersion, bgColor, swfParams, flashParams, embedAttributes) {\n\n  try {\n      cv_moJVAVH2WT46ZTso = new SWFObject(swfLocation, \"cv_moJVAVH2WT46ZTAMPlayerProd\", swfWidth, swfHeight, flashVersion, bgColor);\t   \n\n      for (var v in swfParams) {\n        cv_moJVAVH2WT46ZTso.addVariable(v, encodeURIComponent(swfParams[v]));\n      }\n      for (var v in flashParams) {\n        cv_moJVAVH2WT46ZTso.addParam(v, flashParams[v]);\n      }\n      for (var v in embedAttributes) {\n        cv_moJVAVH2WT46ZTso.setAttribute(v, embedAttributes[v]);\n      }\n\n      cv_moJVAVH2WT46ZTso.addVariable(\"swfEmbedTime\", new Date().getTime());\n\n      var agt = navigator.userAgent;\n       \n      var reFirefox = new RegExp(\"firefox/\", \"i\");\n      var regx = agt.split(reFirefox);\n      var ffVersion = 8;\n      if (regx[1]) {\n          var pts = regx[1].split(/[.]/);\n          ffVersion = parseFloat(pts[0] + \".\" + pts[1]);\n      }\n      var minorVersion = parseFloat(navigator.ap);\n      if ((navigator.appVersion.indexOf(\"Mac\")!=-1) || (ffVersion < 1.5)) {\n          cv_moJVAVH2WT46ZTso.setAttribute(\"height\", swfHeight);\n          cv_moJVAVH2WT46ZTso.setAttribute(\"width\", swfWidth);\n          cv_moJVAVH2WT46ZTso.addVariable(\"oldFirefox\", \"1\");\t     \n      }\n\n      if (cv_moJVAVH2WT46ZTso.write(\"cv_moJVAVH2WT46ZTflashcontent\")) {\n          fp_resizePlayerSpace('cv_moJVAVH2WT46ZT', \n                               320, \n                               283);\n      }\n      else {\n          var nsPrefix = 'cv_moJVAVH2WT46ZT';\n\n          fp_resizePlayerSpace(nsPrefix, 0, 0);\n          fp_rewriteDiv(nsPrefix, \"flashcontent\", '<br/>To view this video download <a target=\"_blank\" href=\"http://www.macromedia.com/go/getflashplayer\" target=\"_top\">Flash Player</a> (version 9.0.115 or higher)');\n      }\n  } catch(err) {\n      fp_resizePlayerSpace('cv_moJVAVH2WT46ZT', 0, 0);\n  }\n  return false;\n}\n\n\n\nfunction _cv_moJVAVH2WT46ZTloadSwf(movieID, playerVersion) {\n    var swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/20120510035744301/AMPlayer._V148501545_.swf\";\n    var swfWidth = \"320\";\n    var swfHeight = \"100%\";\n    var flashVersion = \"9.0.115\";\n    var bgColor = \"#FFFFFF\";\n\n    var swfParams = {};\n    var flashParams = {};\n    var embedAttributes = {};\n    swfParams.amazonPort = \"80\";\n    swfParams.allowFullScreen = \"true\";\n    swfParams.telemetrySubPageType = \"VideoReview\";\n    swfParams.nsPrefix = \"cv_moJVAVH2WT46ZT\";\n    swfParams.locale = \"en_US\";\n    swfParams.logUrl = \"gp/mpd/l\";\n    swfParams.canResize = \"1\";\n    swfParams.autoPlay = \"1\";\n    swfParams.sessionId = \"000-0000000-0000000\";\n    swfParams.marketplaceID = \"ATVPDKIKX0DER\";\n    swfParams.salign = \"LT\";\n    swfParams.preset = \"detail\";\n    swfParams.mediaObjectId = \"m1EENP78GYBQEP\";\n    swfParams.autoPlayTimer = \"\";\n    swfParams.mediaObjectIDList = \"m1EENP78GYBQEP\";\n    swfParams.playIsUserGenerated = \"1\";\n    swfParams.enableShare = \"0\";\n    swfParams.permUrl = \"gp/mpd/permalink\";\n    swfParams.telemetryPageTypeID = \"RGQNIGK6RQI4V\";\n    swfParams.xmlUrl = \"http://www.amazon.com/gp/mpd/getplaylist-v2/m1EENP78GYBQEP/000-0000000-0000000\";\n    swfParams.amazonServer = \"www.amazon.com\";\n    swfParams.scale = \"noscale\";\n    flashParams.allowFullScreen = \"true\";\n    flashParams.salign = \"LT\";\n    flashParams.bgcolor = \"#FFFFFF\";\n    flashParams.allowScriptAccess = \"always\";\n    flashParams.quality = \"high\";\n    flashParams.wmode = \"transparent\";\n    embedAttributes.title = \"Flash Player\";\n\n    if (movieID){\n      if (playerVersion == '3'){\n        swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/20120510035744301/AMPlayer._V148501545_.swf\";\n        swfParams.mediaObjectIDList = movieID;\n      } else {\n        swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/legacy/20101014901/AMPlayerProd._V197491872_.swf\";\n      }\n      swfParams.xmlUrl = \"http://www.amazon.com/gp/mpd/getplaylist-v2/\" + movieID + \"/000-0000000-0000000\";\n      flashParams.wmode = \"transparent\";\n      swfParams.autoPlay = \"1\";\n    }\n\n    if (document.getElementById('cv_moJVAVH2WT46ZTduration')) {\n      document.getElementById('cv_moJVAVH2WT46ZTduration').style.display='none';\n    }\n    cv_moJVAVH2WT46ZTloadSwf_Core(swfLocation, swfWidth, swfHeight, flashVersion, bgColor, swfParams, flashParams, embedAttributes);\n\n  return false;\n}\n\nfunction cv_moJVAVH2WT46ZTloadSwf(movieID, playerVersion) {\n   return _cv_moJVAVH2WT46ZTloadSwf(movieID, playerVersion);\n}\n\n\n\t\n\t\t// ]]>\n\t\n\n<!--\n\nfunction cv_moJVAVH2WT46ZTnewHeight(h)\n{\t\n    fp_resizePlayerSpace('cv_moJVAVH2WT46ZT', 0, h);\n}\n\nfunction cv_moJVAVH2WT46ZTresetPlayer(w,h,bw,cc) {\n  cv_moJVAVH2WT46ZTnewHeight(h);\n\n  cv_moJVAVH2WT46ZTso.addVariable(\"resetBandwidth\", bw);\n  cv_moJVAVH2WT46ZTso.addVariable(\"cacheCode\", cc);\n  cv_moJVAVH2WT46ZTso.setAttribute(\"height\", h);\n  cv_moJVAVH2WT46ZTso.setAttribute(\"width\", w);\n  cv_moJVAVH2WT46ZTso.write(\"cv_moJVAVH2WT46ZTflashcontent\");\n}\n\n-->\n\n\n\n\n\n\n\n\nvar cv_moJVAVH2WT46ZTRollOverImg = new Image();\ncv_moJVAVH2WT46ZTRollOverImg.src = \"http://ecx.images-amazon.com/images/I/9183YORdjVS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play-active,BottomLeft,130,-12_CR0,0,0,0_.png\";\n\nvar cv_moJVAVH2WT46ZTpreplay = document.getElementById('cv_moJVAVH2WT46ZTpreplayImageId');\nif (cv_moJVAVH2WT46ZTpreplay) {\n  cv_moJVAVH2WT46ZTpreplay.onmouseover = function() {\n    cv_moJVAVH2WT46ZTpreplay.src = \"http://ecx.images-amazon.com/images/I/9183YORdjVS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play-active,BottomLeft,130,-12_CR0,0,0,0_.png\";\n  }\n  cv_moJVAVH2WT46ZTpreplay.onmouseout = function() {\n    cv_moJVAVH2WT46ZTpreplay.src = \"http://ecx.images-amazon.com/images/I/9183YORdjVS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play,BottomLeft,130,-12_CR0,0,0,0_.png\";\n  }\n  \n  \n  var node = cv_moJVAVH2WT46ZTpreplay.parentNode;\n\n  var cv_moJVAVH2WT46ZTcurrentClick = node.onclick;\n  node.onclick = function () {\n    var head = document.getElementsByTagName(\"head\");\n    if (head[0]) { \n      var logTag = document.createElement('script');\n      logTag.type = \"text/javascript\";\n      logTag.src = \"/gp/customer-media/du/log.html?ie=UTF8&p=CustomerImage&s=CustomerVideoPlay\";\n      head[0].appendChild(logTag);\n    }\n\n    if (cv_moJVAVH2WT46ZTcurrentClick) {\n      return cv_moJVAVH2WT46ZTcurrentClick();\n    }\n  }\n}\n\n\n\n\n Length:: 7:09 MinsI bought this camera a few weeks before taking a cruise. This video of river rafting was taken on February 25, 2014 in Ocho Rios, Jamaica. The battery lasted the entire safari - about an hour and a half, but then it was dead. The original sound was in mono but was cleaned up and then synthesized to stereo. The video was not processed - what you see is what the camera took. I had the camera mounted on a bobber which I held in my hand. The bobber was attached to my wrist with a tether.One thing to be aware of with this camera is that when taking video, you may hear clicking sounds in the audio - which is why I gave it a four star rating instead of five. The clicks are the sound of the aperture adjusting to changing light conditions. This is not a defect. It's mentioned in the instruction manual. However, if the sound you're recording is very loud, you probably won't notice the clicks.", "Date": "April 16, 2014"}, {"Title": "RUN AWAY: You get what you pay for!", "Author": "Pcitiyank", "ReviewID": "R3HWH9IF7VCLAD", "Overall": "1.0", "Content": "In spite of reading and following instructions, this has leaked since the first time I used it in The Galapagos.  It has been used for snorkeling and land only.  It has received careful care and no harsh usage.  I have been able to dry it out (mostly) several times, but it leaks about every time and now the view window is foggy. I have not been able to download to see if it is actually taking pictures and hope what was on my card is not ruined.  On a snorkel trip today, a fellow snorkeler said this camera is what she originally purchased and she had the same experience.  She said Panasonic replaced it and it happened to the replacement, as well. I looked closely at her Nikon Coolpix (about twice the price) and see a big difference.  The Lumix has a snap closure, so you cannot control the pressure of the seal. Poor design and/or poor manufacturing.  The Nikon Coolpix has a compression closure, so you can have some control of the seal.  I am off to Costco to buy a Nikon Coolpix so I can enjoy the rest of my Maui vacation.", "Date": "February 11, 2014"}, {"Title": "A step backwards for Lumix in image quality", "Author": "C. Floyd \"floydiak\"", "ReviewID": "R3O2Z4BO8L44D", "Overall": "2.0", "Content": "I've been a fan of Panasonic's Lumix line, and own several dating back to the DMC-FZ7.  I bought the DMC-TS25 to replace a DMC-TS3 (the -TS3 had a cracked rear screen that made it no longer waterproof, but it still functioned normally).  I used the two cameras side-by-side for several weeks, and noticed the older, damaged -TS3 still took much sharper, more vivid photos than the -TS25.  The -TS25's macro capability was also markedly inferior to the -TS3.  I've since returned the -TS25; the damaged -TS3 is still in use.", "Date": "October 2, 2013"}, {"Title": "great!", "Author": "Katarzyna", "ReviewID": "R1MRDZIZO266HV", "Overall": "5.0", "Content": "I really love everything about this camera, it works under the water, it makes nice videos and of  course great pics:-)", "Date": "August 28, 2013"}, {"Title": "I spent hours workshopping the dust specs!", "Author": "Lea", "ReviewID": "R1IYTJ73X2I8YD", "Overall": "2.0", "Content": "This camera was purchased to replace an Olympus Tough series camera.  I haven't had it very long but I am sending it back.Pros:Compact camera is easy to tuck into a pocketCamera gets good reviews for toughness and waterproof capabilities (I have not had time to test it for this)Cons:You have to navigate a lot of menus to use the different scene selectors.  It takes too long when you are trying to get shots of people in motion.The auto setting over-exposes everything.  All of my photos are hazy, grainy and dull.  I get better quality from my iPhone 5There is no lens cover.  Every time you take it out to use it you must dust the lens.  My husband didn't realize this, and now I am spending hours retouching the dust specs from our Thanksgiving celebration photos.The camera is fine if you just want to record incidental stuff, but I can do that with my phone.  I need something that will fit in my pocket, stand up to my two three-year-olds AND take sharp photos.  If I'm only going to get two out of three I will give up the size or the durability, but if I'm going to carry an extra device I will NOT give up the sharp photos!", "Date": "December 1, 2013"}, {"Title": "Used on a night Manta ray dive on the Big Island..", "Author": "Judith K. Walter", "ReviewID": "RNRZZDHD4SYAW", "Overall": "5.0", "Content": "Really liked the idea of a completely waterproof camera and this worked really well on a recent trip to Hawaii.  Here is the video of a night snorkel shot with the camera off of the airport in Kona.  [...]", "Date": "May 27, 2014"}, {"Title": "VERY satisfied with this camera!", "Author": "Y4S", "ReviewID": "R35EDQPXOSD2RK", "Overall": "4.0", "Content": "I needed a waterproof camera mainly to use when I'm taking pics of the kids at the waterpark and whatnot.  I am pretty picky when it comes to what I expect out of a camera even when I'm not spending a fortune. I see it as, \"What's the point of a camera if all the pictures are terrible quality?\" I bought and tried several comparable waterproofs before returning them.  I tried an Olympus one and WOW, what a joke! I couldn't believe how awful it was. This is SO MUCH BETTER.  If you're looking to get pretty decent pics for a deal, trust me. Go with this one.", "Date": "May 27, 2014"}, {"Title": "Fiance loves it", "Author": "S. Stroud", "ReviewID": "R2KQMIJQGZABWD", "Overall": "5.0", "Content": "Fiancé had this exact camera until it was stolen and pawned.  We were headed for a family vacation at an indoor water park and wanted family photos with the kids.  This camera survived the hot tubs, water slides, lazy river, ect, ect.  Very pleased with it.", "Date": "March 27, 2014"}, {"Title": "Broke the second day of use on cruise.", "Author": "Stacy Langley", "ReviewID": "RFRRY94VBTA18", "Overall": "1.0", "Content": "Camera fell out of my bag which was about 1-1.5 ft drop.  After this, the camera would only take black pictures.  The camera states it is shock proof up tp 5ft.  I had to purchase another camera while on vacation.", "Date": "February 10, 2014"}, {"Title": "SOOOOO Disappointed", "Author": "William Kirsch", "ReviewID": "R3ABFJ05JJ5AI3", "Overall": "1.0", "Content": "I bought this camera for my daughter for her college research trip to Belize.  The camera worked for 2 days before failing.  Total bummer as her trip is 17 days and she needed it for documentation.  Her quote:  \"My camera stopped working.  Water got into the screen.\"  I feel terrible about this.", "Date": "January 14, 2014"}, {"Title": "Tough Camera", "Author": "JayJay", "ReviewID": "R304IBGKGO45E2", "Overall": "5.0", "Content": "I purchased this for my wife as she is hard on cameras. To this point it has worked very well. It has been dropped at least twice and continues to function. I expect several more years of proper operation.", "Date": "August 27, 2013"}, {"Title": "Love this camera", "Author": "Greg S. Churilov \"wootheweb\"", "ReviewID": "R1WWVJSINA33HK", "Overall": "5.0", "Content": "I had one, but I left it unattended and it was stolen. I now bought a second one. Love it. Just loaned it to a friend for her Bora Bora honeymoon and she was gushing about all the crystal-clear snorkeling underwater photos they took. :-)", "Date": "August 24, 2013"}, {"Title": "Perfect Underwater Camera", "Author": "Jessica Davis", "ReviewID": "R1VIH4M3E66EHR", "Overall": "5.0", "Content": "This is a must buy if you are going to the beach. It is easy to use and takes great pictures. It is very durable and held up to a week long beach vacation and kids using it. It was in the sand, salt water, dropped, and never missed a heat. I am very happy with this product!", "Date": "August 18, 2013"}, {"Title": "Great family fun vacation camera", "Author": "Anon", "ReviewID": "R14Y0L8WX3O9Q5", "Overall": "5.0", "Content": "I got this to go on a family vacation. I'm truly glad I did. It was such fun to be able to take photos of the kids playing at the beach and in the pool. We now have some wonderful memories to keep forever thanks to the crisp, clear photographs and video this camera takes.", "Date": "August 18, 2013"}, {"Title": "Item delivered on time, was as described.", "Author": "crabman", "ReviewID": "R1VAMZSBLVDZVE", "Overall": "5.0", "Content": "When ordered I wasn't sure if this camera was what I needed but I am happy with the purchase. Expectations exceeded. I recommend for under water use.", "Date": "July 18, 2013"}, {"Title": "Ecellent Product", "Author": "Beth Wager", "ReviewID": "RS38E198GKZMW", "Overall": "5.0", "Content": "This camera is so easy to use!!  I was able to take sports shots at a hockey game and zoom in with a clear picture.  The only flaw is when using the video feature the picture darkens significantly. Otherwise this is the perfect go to camera.", "Date": "June 18, 2013"}, {"Title": "Panasonic Abandoned Me", "Author": "Travis Hostetter \"Gunner43\"", "ReviewID": "R137ZEPF01843", "Overall": "1.0", "Content": "I own an older version of this camera that I paid $400 for on Amazon.  I used the camera lightly and after just one month of sparing usage, the camera broke and took in water.  I never went below the depth prescribed nor kept the camera in the water for more than a few minutes.  Panasonic was incredibly difficult to get ahold of on the phone and when I did, they were not helpful.  I eventually found a form to fill out online and sent it with the camera back to Panasonic.  After many months, they finally sent me a replacement used camera.  However, the very next time I used it, it broke.  Now Panasonic has refused to repair the camera I sent to them and I am out $400.Terrible customer service, poor picture and video quality, and it is certainly not waterproof.  DO NOT BUY!", "Date": "August 21, 2013"}, {"Title": "WORKED VERY WELL", "Author": "Ms.Velazquez", "ReviewID": "RJUF4XO6YP0QJ", "Overall": "4.0", "Content": "Works very well. Many camera options. Feel secure around water ,.,.park. Didn'tt include flash drive or case.  Nevertheless feel very satisfied with the camera color and features and PRICE.", "Date": "June 4, 2014"}, {"Title": "Cool camera.", "Author": "L. Fernandez", "ReviewID": "R1UMPAZTSKCFMF", "Overall": "4.0", "Content": "It can really take a beating, beach, sand, salt water, a 2 year old toddler, pool. If you happen to get sand around the shutter button just rinse it in water and you're good.Obviously you aren't going to get DSLR quality pictures, but they're ok.It serves it purpose.", "Date": "June 4, 2014"}, {"Title": "Great fun underwater pics", "Author": "J. Garcia", "ReviewID": "R27AMS7TZGYFY3", "Overall": "5.0", "Content": "Love it. I compared cameras before I bought this one. The underwater pictures in a pool are amazing.  Also took some pictures while playing with my kids in the Ocean. Just great.", "Date": "June 1, 2014"}, {"Title": "Great camera for the price", "Author": "Jason Townsend", "ReviewID": "R3GLWT89J9AWKL", "Overall": "5.0", "Content": "I bought this to use underwater for a snorkeling vacation. The pictures look very good, but I will say that it was hard to see the LCD screen underwater.  I had no issues with the camera down to about 20' underwater but that is as deep as I went.", "Date": "May 29, 2014"}, {"Title": "I bought this for $84 on sale, at that price it is great", "Author": "Andrew C", "ReviewID": "RQSLCLM3XRZGP", "Overall": "3.0", "Content": "Picture quality is so-so, lcd screen on the back is just ok.  But for $84 to have a waterproof, shock proof camera to use and not worry about.  Yeah, I can deal with that.  I'll keep my Canon Elph for better pictures, but this is nice to have for beach days.", "Date": "May 28, 2014"}, {"Title": "go for it", "Author": "Mexisalva", "ReviewID": "R24VDEWDL7LE51", "Overall": "5.0", "Content": "Camera work great. Takes great picture under water. If you are Looking for an easy to use camera this is the one.", "Date": "May 26, 2014"}, {"Title": "just a fine camera - pictures were not fabulous though", "Author": "lkp \"gracie parra\"", "ReviewID": "RO37OJEXKGN1V", "Overall": "3.0", "Content": "I bought this for my family vacation to Hawaii.  I was very excited to get some great underwater pictures...well the pictures were not so wonderful.  Yes, the water may not have been crystal blue, but the color was not vibrant in the underwater pictures at all.  Maybe I was expecting too much, I don't know.  If you were really close to what you were photographing the pictures were fine, but forget about it if you are more than about 8 -12 inches away.  As far as taking pictures outside of the water, my iPhone does a much better job.  Long story short, this camera will be mostly used by my children...", "Date": "May 18, 2014"}, {"Title": "Worked out perfectly!", "Author": "lnd6c2", "ReviewID": "RNW7VTMQP2XWO", "Overall": "5.0", "Content": "This camera worked out perfectly for our cruise - we had it in the ocean and down the water slides, but it also looked sleek enough to bring along to dinner.  The different functions were great, too, like the panoramic.  Very pleased with the purchase!", "Date": "May 11, 2014"}, {"Title": "opened underwater", "Author": "Ginnyesq", "ReviewID": "R1WPEY4Q44P3IP", "Overall": "2.0", "Content": "the camera seemed nice, but when I got up from snorkeling the first time I noticed that the lock had been unlocked.  It just have bumped my arm--too easy to unlock.  I got no photos.", "Date": "April 28, 2014"}, {"Title": "Excellent Job Site Camera", "Author": "RJV Engineer", "ReviewID": "R1S6N5K6GP8C4T", "Overall": "4.0", "Content": "This is a rugged compact camera.  I needed a small pocket camera for construction site documentation.  It takes high resolution pictures with automatic settings.  The zoom lets you get close to a higher object.  The auto close up let's you take a close up detail of a weld.  Tested it on a quarter.  Set the camera on it a got a detailed close up.The manual is 150 pages of special features that is way beyond what I expected for an economical camera.  I haven't had time to explore all of these.The best thing is I don't have to worry if I drop it or if it rains.The only issues I have is that the lens is in the upper left corner.  It is easy to get your fingers over it.  The zoom button is also easy to hit unintentionally.It took a while to figure out how to stop the warning message for under water use from showing every time you turned it on.Note you have to get an SD card.  It has minimal internal memory.  Maybe 15 shots.Extra batteries will be needed if you use the flash a lot.", "Date": "April 24, 2014"}, {"Title": "Great camera, great pictures!", "Author": "Amazon Customer", "ReviewID": "RTUY7JQQW8104", "Overall": "5.0", "Content": "This camera was the perfect purchase for my cruise.  It was tough, easy to carry, and took great photos.  The battery life is excellent.  I fully charged it about two weeks before the cruise and did not charge it at all during the week-long cruise even though I used it every day.  I used the camera underwater in both the ocean and a pool and had no issues.  If you are wondering what kind of memory card to get (you'll need one), I bought a 64 GB SD XC card and the camera indicated a capacity of over 9500 highest quality pictures.", "Date": "April 24, 2014"}, {"Title": "Such a nice camera", "Author": "Tricia Elkinton \"Mom of Three\"", "ReviewID": "R3M84WHQ15AFRI", "Overall": "5.0", "Content": "This camera was just what I needed for our last cruise.  I was afraid that for this price it wouldn't really be all that great, but it was.  Underwater pics are great.  Just remember to change the setting to \"underwater\".  Small and compact.  I never had to recharge the battery and we snorkeled for around 6 hours.  If only the fish had been as good as the camera :)", "Date": "April 21, 2014"}, {"Title": "humedity no good for this", "Author": "Fernando Diaz", "ReviewID": "RH33N51ZIABW5", "Overall": "4.0", "Content": "Panoramic pics are awesome. Needs to improve underwater photos, it takes with a lot of bright. Also the lens got blur when I took the camera to a place with high levels of humedity, I wasnt able to take pics there anymore. The \"normal\" pics are great, good quality and definition", "Date": "April 13, 2014"}, {"Title": "Great little camera!", "Author": "Amee R. Penso", "ReviewID": "R3MIHLO7YWN3J3", "Overall": "4.0", "Content": "I had to replace my old one so I got another. I love this camera. Does great underwater shots. My only complaint is that is was mailed in a padded envelope and the box was a bit crushed. The camera was okay. The same day I had replacement batteries arrive in box. Fast shipping!", "Date": "April 12, 2014"}, {"Title": "happy with my purchase", "Author": "Amazon Customer", "ReviewID": "R2HLG5FJ00TQPJ", "Overall": "4.0", "Content": "This is a nice compact camera that takes decent underwater pics.  Make sure to set the mode to beach/water and the underwater pics come out nice.  It was a little hard seeing the screen underwater at times, but for a relatively inexpensive camera that is waterproof I am pleased.  No problems with leakage.", "Date": "April 5, 2014"}, {"Title": "Excellent little camera for the price!", "Author": "dmh", "ReviewID": "ROL2L5XLTTW0P", "Overall": "4.0", "Content": "Just returned from a trip to Mexico where we used our Lumix DMC-TS25 for the first time.  We had great pictures.  The only downside is that sometimes we would get water spots on the glass over the lense, you just needed to remember to wipe it off.  We even had great pictures of the fish underwater.  The inside pics were not the best, but that isn't really why we got the camera in the first place.  If you are looking for a waterproof camera that won't break the bank, and will give you good photos - this is for you!  (I saw lots of comments about the camera leaking - never had a problem with that, there is a lever on the side that you need to slide to ensure the camera is locked closed and everytime after the door has been opened there is a message to check the door that pops up.)  You will also definitely want a floating camera strap - just in case.  We bought one from Nordic Quality that worked great.", "Date": "April 4, 2014"}, {"Title": "Great camera", "Author": "Debra S Rankin", "ReviewID": "R185KLDTK6GAAV", "Overall": "5.0", "Content": "This is easy to use and produces vibrant colors; underwater feature is great for vacations; tough enough for the kids to use", "Date": "April 3, 2014"}, {"Title": "My daughter loves it", "Author": "pam \"military mom\"", "ReviewID": "RX9SXWOLEEXW8", "Overall": "5.0", "Content": "My 8 year old daughter is taking pictures and making movies.  The camera is rugged enough to survive all of my daughter adventures.  Pictures are solid and easy to use.", "Date": "April 2, 2014"}, {"Title": "great!!!", "Author": "Pablo Luis Lynn \"Pablynn\"", "ReviewID": "RBIZ5PSN9E8W5", "Overall": "4.0", "Content": "great price.nice pictures underwater.would definitely recommend.indoor and outdoor, easy to use.we went snorkeling and have a blast!", "Date": "April 1, 2014"}, {"Title": "Great camera - perfect for snorkeling", "Author": "Kelly Olsen", "ReviewID": "R276S2RHUX54R4", "Overall": "5.0", "Content": "Despite some reviews of this camera not being that great, I ordered it prior to a trip to the Caribbean and it was amazing! I took 950 photos, half of them underwater, and all of them turned out amazing! I love the in-camera filters available and got some fun shots that way. I would not hesitate to recommend this camera (just for reference, I have a Powershot and and Olympus PEN-E 1 and I like this camera as much as both of those). The settings in the underwater feature allow for increased color variation which is really nice considering the colors get pretty muted starting at about 5 feet. I am really happy with this camera!", "Date": "March 31, 2014"}, {"Title": "Great for kids weekend", "Author": "deb ausen", "ReviewID": "R260A15B885TJ8", "Overall": "4.0", "Content": "I liked the camera underwater.. however, the \"above water\" shots seemed overexposed.  I think it may be something I am doing wrong, but cant seem to figure it out.  I bought it mostly for family shoots for a snorkel weekend... and for the \"selfies\" it was WONDERFUL.  It takes some time to get good photos of the fish, but we did manage to get better as the weekend went on.  Good value for the price Thank You", "Date": "March 15, 2014"}, {"Title": "Great Point and Shoot WATERPROOF CAMERA with Video", "Author": "jw", "ReviewID": "R1OZC6TEK83LPH", "Overall": "5.0", "Content": "For our Cancun vacation I was debating whether to take my D7100 Nikon DSLR which takes great photos.  This time however, I wanted to take underwater photos as well.  Did some research and underwater housing for D7100 was expensive so I thought this was a good time to buy a secondary camera that is small, waterproof, captures decent video for under $200.  So I did some extensive research and initially waterproof cameras from Nikon and Canon came to mind but since this was my secondary camera I wanted to keep it below $200.  If this was my primary camera, I would of spent little more and would of likely purchased Canon, Nikon and even Olympus in the price range of $200-$400.First of all, this is my first point and shoot camera and I am quite surprised by the image quality, especially for a camera that I spent in the low $100. I want to emphasize at this price point because it's unfair to compare a low $100 camera to $1200 Nikon with a $500 lens.  Unfortunately, when we first arrived at Cancun, it was cloudy and raining.  So the pictures taken on the beach are somewhat grainy (I am carefully viewing the photos as I write on a computer screen), but the next days were sunny and the photos quality are somewhat comparable to my Nikon DSLR.  So the overall image quality is there, especially something that is very small to carry around and that can easily slide into your pocket.  Pictures taken inside the hotel during the daytime came out great.  At night, pictures taken with flash came out pretty clear.Afterwards, I went kayaking and submerged this camera underneath the water.  With the large LCD display, I was able to see the ocean bottom from the kayak.  Took several pictures and they came out OK most likely because the water was somewhat murky.  So I really couldn't test the image quality of underwater pictures because the water was not clear.  Then I changed to video mode, and using the default mode the video came out somewhat grainy for both out of water and under water.  I really didn't have time to read the manual and change any settings since the camera came a day before our vacation.  But I really didn't expect high quality video like my HD Canon camcorder.  According to the manual, it captures 720P video.Overall I took over 450 pictures and about 7 minutes of video using a 16GB SDHC memory card and used up only 3.33 GB of memory (approximately 11.5 GB of free space), and fully charged camera about two times during my three days stay at Cancun.  Unless you are taking hundreds of pictures in a day, I do not believe a second battery is necessary.  In the default video mode, 16GB of SDHC memory gave approximately 30 minutes of video recording time.Sure it would of been nice to have a camera that will take better pictures during low light or better quality video, but for the price I really can't complain.  If you want a waterproof camera with high quality video, I would recommend looking at other waterproof cameras with video capability.  But for me, I was quite surprised by this Panasonic underwater camera and it definitely makes an excellent secondary camera  that I can easily carry around.  So out of 450 images, I would say that over 95 percent of the images are keepers that I can print although not perfect.  Oh by the way, the camera focus is pretty fast for a point and shoot.  Obviously, the waterproof works great, otherwise I would of have no underwater pictures, but if there is one improvement (not a complaint) it would have to be the video quality.  My wife and my kids love this camera and I will likely report back once it gets more usage.", "Date": "March 3, 2014"}, {"Title": "Great Waterproof Camer", "Author": "Jerry VanOort", "ReviewID": "R1PNRFGH4ZMXF9", "Overall": "5.0", "Content": "I bought this for a vacation to Mexico so I could take photos in the pool and ocean and around sand.  It performed flawlessly and allowed me to take some great photos.  Just make sure you allow the camera to adjust to the different microclimates as the lens can easily fog up when you get near the ocean.  You just need to give it a few minutes to acclimate and the fog will go away.  I would also make sure that you read the instruction carefully on how to properly maintain the watertight door.  The video is sub-par at best which was a little disappointing but far from being a deal breaker.  I plan on buying a GoPro camera for my next trip.", "Date": "February 19, 2014"}, {"Title": "Great point and shoot", "Author": "Momof4", "ReviewID": "R13EG5KBWR6XT7", "Overall": "5.0", "Content": "Great point and shoot camera. I bought this for my 9 yr old and it's been a huge hit. The fact that it's shock proof and waterproof only make it more practical and cooler.  Highly recommend.", "Date": "February 17, 2014"}, {"Title": "Great while it worked - for 5 days", "Author": "Robert Hawke", "ReviewID": "R2AVXKQC8MLN5K", "Overall": "2.0", "Content": "We bought this for snorkeling in Mexico. We followed all the instructions about closing it properly, only taking it in the water for 1 hour, rinsing it after salt water use, etc. And for the first five days this camera gave us great pictures and we were really impressed how this little camera can work so well AND be waterproof. If our vacation had been 5 days long this would be a 5 star review.On the 6th day when we got in the water the LCD screen started to fog from the inside. So no way to wipe it off. It's not water inside, probably just air with a different temperature that starts to condensate. This was only annoying but at least it still took pictures. A few minutes later the lens started to fog on the inside. Now it was useless because the pictures taken were foggy. After 15 minutes in the water the fog disappeared (probably because the temperature inside got equal to the water temperature). From that point on the camera was ok when outside the water, but would get foggy every time it was put in the water and if we got lucky after maybe 15-20 minutes it would clear up, but not always. As soon as the fog disappears it's still ok to use and on land you wouldn't notice a thing.Summary: Great camera, but if you really want to use it for underwater pictures, consider it a disposable camera. Ours is going back to Amazon and for our next vacation we will look for something better.", "Date": "January 31, 2014"}, {"Title": "Stopped working the first time it got wet", "Author": "S. Little", "ReviewID": "R15Q26OJSNN4AL", "Overall": "1.0", "Content": "I bought this for a trip to Bali and Japan, and I ran it under faucet water before the trip to be sure it didn't take in any water, and seemed fine. I used it for the first 4 days of our trip, and on the last day in Bali before we headed to Japan, I took it into the pool for about 10 seconds, and it stopped working properly. There was no water in the battery compartment, but water got into the screen area, and not only was the LCD screen completely shot, but all photos were totally blurry. I tried drying everything out over several days, but nothing worked. Luckily, we had a backup camera on a phone, but I was extremely disappointed that I couldn't capture better photos from this trip of a lifetime. Even the photos that were taken before it stopped working were not as good quality as I would hope. I would not purchase this camera again, even if I weren't planning to get it wet.", "Date": "January 22, 2014"}, {"Title": "Great dependable camera!", "Author": "Honey Badger", "ReviewID": "R2QUNCI359102X", "Overall": "4.0", "Content": "I ordered this Panasonic TS25 about 3 weeks ago.It is the first waterproof camera I have ever owned. The excellent way it's doing it's job right now, it may be the only one I ever own. Delivery was fast and the package came in great shape!The camera is a neat little thing. It weighs almost nothing at all and feels sturdy to the touch. For the price tag being so reasonable, I think this was worth every penny and then some! At first glance, I thought the buttons on the camera were in no way going to stop water from leaching into the camera! However, that misconception was blown away when I took it to the beach for some great snapshots of underwater seaweed. There were no problems whatsoever.  I put it on it's side on top of a towel for about 30 minutes and it was dry and ready to go! I made note to keep the battery hatch closed during drying due to reading reviews stating that doing so may fog the lens.I stayed at the beach taking various pictures using all kinds of options and software built into the camera. The options to edit photos kept me so amused that I missed several great potential shots! As it got darker, I switched to night sky option and took some shots of the horizon after the last bit of sun sank below. The shots came out gorgeous! Better than what I expected. It captured the stars that were barely coming out as if they were out in full effect. The camera picked up stars I couldn't even see!I later had trouble keeping my hands steady enough so I put the TS25 on a tripod. By this time, it was complete night. The moon was full and there were no city lights within miles. The shots were even more amazing with the tripod. For what I consider a budget camera, this thing took very nice shots of the night sky. There's no trouble telling which constellations are which from the photos.Overall, great product!", "Date": "January 20, 2014"}, {"Title": "Great underwater camera for cheap", "Author": "llauren", "ReviewID": "R81RORR1DMGE1", "Overall": "5.0", "Content": "Bought this camera in August 2013 for a vacation to the Florida Keys. We took the camera with us on our first snorkeling dive. The camera worked wonderfully! We used the camera several times since then and never had it leak. It takes very good land photographs too, which we were happily surprised about. The settings are easy to use. We added a lanyard on to the camera so we would not lose the camera in the rough waves as it does not float. The colors are vivid on land and in water, though i am a terrible photographer so i did not tinker with many settings like i should have underwater.[TIP] If you keep the lens free of debris and bubbles while underwater it will focus beautifully, but if there are even the tiniest bubbles caught on the lens it will auto-focus on those instead of your subject.Here are some sample raw, unedited photos taken on land, and in water.(on land) [...](on land) [...](underwater) [...](underwater) [...]We did notice, the larger the field we were trying to photograph/the farther away from the subject we were, the more washed out the underwater scenery came out in the photos. On the other hand, close-up photos came out AMAZING; vivid, and sharp in focus!", "Date": "December 30, 2013"}, {"Title": "bad instructions on how to use internal memory (70 Gigs) vs. the SD card", "Author": "Carlos Danger", "ReviewID": "R3THKXAKRWBCIQ", "Overall": "3.0", "Content": "It's durable.  It was great on a trip where it was raining and by the ocean when the wind was spraying the ocean and it's nice not to worry about having to get it wet or drop it.  Although I would not want to drop this thing on concrete from more than about a foot, it's nice to have piece of mind.What is annoying me is that it has 70 Gigabytes of internal memory and a slot for an SD card but they aren't really clear in the listing that you don't need an SD cart at all if you are OK with the 70 Gigs of internal memory, which I am fine with.  So I wasted money on an SD card I feel like.  I am also annoyed because I am sitting here with this camera and I've gone through all of the set-up and settings on the camera and looked through the instructions and cannot figure out how to switch from the internal memory to the SD card.I was on vacation and filled the internal memory but then I could not get it to switch to the SD card.  OK, and maybe I am flaking on something and maybe I have not done a good enough Google search on how to do it.  Probably there is a way to do it but I am pretty good at figuring this kind of thing out and going on a few hours now, I have not been able to figure it out.  So let me lower this down to 3 stars as I become more annoyed about as I am writing it.", "Date": "December 5, 2013"}, {"Title": "Disappointed", "Author": "Shelly", "ReviewID": "R2WLHYD7MQJ6", "Overall": "2.0", "Content": "I had higher expectations for this 16 mp camera... The low quality screen turned me off right away. My 10mp Nikon s350 from 2009 takes nicer pictures than this. If you only plan to use this camera under water then maybe its good ( I returned it before trying it underwater) but I did compare it in a store to the fugifilm underwater camera in this price range and the fugi's pictures were much more clear. I returned this camera the next day.", "Date": "December 5, 2013"}, {"Title": "Tough, Waterproof...Horrible Picture Quality", "Author": "Pd", "ReviewID": "R1CXZ4LA09CS7X", "Overall": "2.0", "Content": "I bought the camera for a trip and didn't want to worry about it when by the water. Well it's great for that, but not much else. The biggest problem is the picture quality...its horrible. Every once in a while we can get a clear picture, but most of the time it's blurry and unusable. So if you're in the market for a fun electronic toy for water and toughness, sure. But don't count on getting any quality pics.", "Date": "December 3, 2013"}, {"Title": "Durable and great photos", "Author": "FL mom", "ReviewID": "R3959U9HZ8QKSR", "Overall": "5.0", "Content": "I bought this as a gift for my husband who is tough on electronics. It has survived thus far, including water and falls. The photos are very nice, as are videos. It is a durable and easy to use camera. The 'warning\" when you turn on about leaking is annoying, but we haven't taken the time to bypass it like the reviewers and the manual tell you. Overall, very happy with the purchase.", "Date": "November 30, 2013"}, {"Title": "Perfect", "Author": "Thomas Nichols jr", "ReviewID": "R3V15HOIS7L16Z", "Overall": "5.0", "Content": "worked perfect Got this for a cruise we went on to Jamica, cozemel and the camen Islands. Perfect shots and worked well in the water", "Date": "November 23, 2013"}, {"Title": "Awesome underwater camera", "Author": "Natalie Shubert", "ReviewID": "R32UK0W75OOC15", "Overall": "5.0", "Content": "One of the best I have ever used. There isn't any negative I have to say about it. Love it", "Date": "October 15, 2013"}, {"Title": "LOVE, LOVE, LOVE!!!", "Author": "Nickelmack", "ReviewID": "R175V99PJNDUTW", "Overall": "5.0", "Content": "I used to have the slightly cheaper and less awesome version of this camera, and it was amazing. The upgrade is PHENONIMAL!! I have taken this camera hiking, white-water rafting, camping, on cruises, on road trips... I have dropped it, I have swam in the ocean with it, I have really given it a run for the money, and it is WORTH EVERY PENNY!", "Date": "October 3, 2013"}, {"Title": "Great photos for a waterproof camera", "Author": "Katie", "ReviewID": "R33IE1BG4TY26K", "Overall": "5.0", "Content": "This camera is wonderful for anything with a chance of water interaction. As long as you follow the directions with the camera and rinse it when you're supposed to, you should have no problems. I've had it for about 5 months and it has survived the ocean, multiple lakes and pouring rain, all successful and camera still works like new.", "Date": "October 1, 2013"}, {"Title": "Wonderful little camera!", "Author": "Brigitte Malessa", "ReviewID": "R1LFFCRQ1N48B1", "Overall": "5.0", "Content": "Great camera for underwater snapshots. I have used it regularly in water that is about 50 degrees to take pictures of fish. Works great, the Hi Burst mode is great and takes LOTS of frames per second.", "Date": "September 27, 2013"}, {"Title": "Tough", "Author": "Ronald Sievers \"Ron\"", "ReviewID": "R3PWSRVWFHJO47", "Overall": "5.0", "Content": "My wife has destroyed more cameras than I can remember.  This one has survived a trip to Alaska where between us we took 2000+ pictures.  i merged her pictures and mine that were take from a Canon into albums.  I often retained her shot as the best one.  Picture quality is great.", "Date": "September 20, 2013"}, {"Title": "Good Tough Camera", "Author": "CPAT21", "ReviewID": "RWFZD3U52NEVI", "Overall": "4.0", "Content": "I bought this camera primarily to take along on my obstacle course races. I most recently took it to Run For Your Lives. It worked great throughout the race. First thing I did with this camera was drop it on the hard packed ground at the event, oops. No issues with that. From there it went through some nasty mud and water also with no issue taking great photos the entire time. I can't wait to bring it with me on a Tough Mudder.My secondary use for this was to use at the beach while traveling instead of my SLR. I had it out at the ocean with sand and salt water all over it and it never skipped a beat.The bonus aspect is I can let my 6 year old daughter use it whenever she likes and I don't worry about her breaking my high end SLR.The only reason I didn't give the camera 5 stars is that I've had multiple shots that were taken in bright light and the whites have no contrast. I found this happened outside in a few photos at Disney and SeaWorld. I'm sure there is probably a setting I could use to offset that, but at the time I was taking the picture I couldn't tell there was an issue.I would highly recommend this camera for someone using it in similar fashion to myself.", "Date": "September 18, 2013"}, {"Title": "I received only the camera without important accesories", "Author": "Rosa Rangel", "ReviewID": "R2Z3P9GFO4F7GR", "Overall": "3.0", "Content": "I received the camera but it was not included the cable USB neither batteries. I prefer to pay a little more but with the main acceosries included. I have to submit another order. (:", "Date": "September 12, 2013"}, {"Title": "Awesome camera", "Author": "christopher h.", "ReviewID": "R1Q0SS9H1Q8TUJ", "Overall": "5.0", "Content": "Takes great pics in and out of water.  This has to  be the most durable, overall best  point and shoot I've ever owned.", "Date": "September 3, 2013"}, {"Title": "Beautiful pictures and a durable camera", "Author": "Rachel Weaver", "ReviewID": "R1D1D0RWAEQTBY", "Overall": "5.0", "Content": "This is the second owned in our family.  Takes great photos. Would definitely recommend this for those who want a more durable camera.", "Date": "September 3, 2013"}, {"Title": "Great camera for underwater and above ground pictures!", "Author": "CP", "ReviewID": "RGMYW959HB0ZJ", "Overall": "5.0", "Content": "I returned two underwater digital before sticking with this even the new Nikon Coolpix. This camera surpassed them all! Great buy. Highly recommend.", "Date": "August 28, 2013"}, {"Title": "bought for beach vacation", "Author": "Joy Tunesi", "ReviewID": "R2AXP5GI1211ZD", "Overall": "4.0", "Content": "I was looking at more expensive water cameras but ended up getting this one.i am glad i did it did everything i needed it to on our trip to Turks and Caicos.it was small could be taken everywhere.", "Date": "August 17, 2013"}, {"Title": "Great for a small easy to use camera you can throw in your bag.", "Author": "frog lady", "ReviewID": "R3CIOTCS5UIYJN", "Overall": "5.0", "Content": "Great for a small easy to use camera you can throw in your bag. The battery life is also great", "Date": "August 16, 2013"}, {"Title": "This made the Hawaiin waters sparkle!", "Author": "Alaskan Cajun", "ReviewID": "R2TVVSWTCE0D15", "Overall": "5.0", "Content": "My wife and I recently got married in Hawaii and this camera helped us save a lot of memories.  I could not be happier with the pictures (in the water and out of the water).  If you're on the fence about a waterproof camera, I highly recommend this one!", "Date": "August 11, 2013"}, {"Title": "Overall really happy with this camera", "Author": "Rory C Smith", "ReviewID": "R2KLI9PMIQFFAY", "Overall": "4.0", "Content": "It has great battery life, takes really good photos in and out of the water, the only down side is that the zoom level isn't all that great - but thats the price you pay for being able to take photos underwater.", "Date": "August 11, 2013"}, {"Title": "A fun, easy to use camera", "Author": "Ruthie", "ReviewID": "R1EUW65PEARCJX", "Overall": "5.0", "Content": "This is the smallest camera I have ever owned, about the size of my phone, but it takes way better pictures. I use it when canoeing and it sits in water a lot of the time, with no problems so far. I just have to remember to dry off the lens. I use a floating strap, just in case I drop the camera. The pictures look great when viewed on my computer. Haven't printed any yet. It was very easy to use right from the start.", "Date": "August 9, 2013"}, {"Title": "Panasonic Water Resistant Camera", "Author": "Barbara Jo Finer", "ReviewID": "R1TQP3WSXB1VQX", "Overall": "5.0", "Content": "I'm going to take this camera snorkeling, but in the meantime I've been using it around the house, and I'm very impressed with how easy it is to understand all of the adjustments and the quality of the pictures is excellent!", "Date": "August 9, 2013"}, {"Title": "This camera is easy to use!", "Author": "gjw", "ReviewID": "R13GTG1N538J6F", "Overall": "5.0", "Content": "I am very happy with this camera.  It is easy to you and takes good pictures.  I bought a float for my wrist that I use with this.  The pictures transfer easily to my pc (no special software needed to be installed).  It also takes video and has zoom.", "Date": "August 7, 2013"}, {"Title": "Wonderful photos", "Author": "Brenda Fink", "ReviewID": "R27NIZNWUKQUTU", "Overall": "5.0", "Content": "I was pleasantly surprised how great the photos are. The camera is very easy to use. I love the color.", "Date": "August 6, 2013"}, {"Title": "Good camera for the beach.", "Author": "Matt", "ReviewID": "REXAVXHJD3RE7", "Overall": "4.0", "Content": "Best waterproof digital for the price. Long battery life, good photos, nice zoom, easy to use. Only draw back is 720 not 1080p, but for making videos 720 requires significantly less storage and still makes great video.  My 8 year old loves to use the camera, and this one survived a beach trip.Definately would buy again.", "Date": "August 6, 2013"}, {"Title": "Great camera!", "Author": "Richard A Meier", "ReviewID": "R16F62V6HUKZJ3", "Overall": "5.0", "Content": "I'm no expert at cameras but I have to say that this one added a lot of value to family's first trip to Hawaii.  The kids were so excited to show us the turtles and fish the found while snorkeling.  It was great fun to take pix of them and fish myself.  Video works great.  Easy to use.  Underwater mode is awesome.  Very cool for the money.", "Date": "July 30, 2013"}, {"Title": "Panasonic Lumix DMC-TS25 Tough Digital Camera", "Author": "Joan", "ReviewID": "RARR6E54907W", "Overall": "4.0", "Content": "This camera is very nice and the  White color is perfect.  it takes great pictures and is easy to use.I recommend it to young and old.", "Date": "July 29, 2013"}, {"Title": "Great little camera", "Author": "MMH434 \"MH\"", "ReviewID": "R32ZNEYHLTXJNA", "Overall": "5.0", "Content": "waterproof, shockproof, and definately friend-proof...for those with butterfingers...very good pictures in a small package without all the wifi, bells and whistles.  Rocks.", "Date": "July 26, 2013"}, {"Title": "Tough Little Camera", "Author": "John Mullen", "ReviewID": "R2WTLCRHKELFFQ", "Overall": "4.0", "Content": "Kind of like today's crossover SUVs, which can handle a little bit of everything but not the Baja 500, the Panasonic Lumix DMC-TS25 can handle most things a family with young children can throw at it. It takes less than 1 second to power up and can start taking pictures right after that. With a dedicated Video Record button you're always ready to take HD Video. My only complaint is that the camera (as a whole) and the controls are just a little too small for my addled fingers. My wife has absolutely no problems with the camera. This camera has become our everyday-take everywhere camera.", "Date": "July 25, 2013"}, {"Title": "Great, easy, underwater camera, not super sharp, but how could it be?", "Author": "D. Fogel", "ReviewID": "R3O4JRZB0XTAR4", "Overall": "5.0", "Content": "Nice, easy to use.  Love the Panasonic menus.  We bought this for our 15 year old daughter for her birthday.  She has used it in pools and in the ocean and it works great.", "Date": "July 25, 2013"}, {"Title": "It works!!", "Author": "Prudence Brooks", "ReviewID": "R24KZXS6HANBBE", "Overall": "4.0", "Content": "This camera did very well under water.  The color was good and there was no leakage during use or during the cleaning process..  My only complaint is that the camera is a little slow.  I have been using a faster camera so it took a while to become accustomed to the slower speed.", "Date": "July 24, 2013"}, {"Title": "As promised", "Author": "Moma Imports LLC", "ReviewID": "R2WDBW99Q8CH53", "Overall": "4.0", "Content": "Brought this for a water based vacation.  Taking photos at the high resolution only allows like 15 shots but lower resolution turned out good. There is a slight delay when taking a picture. It is also very hard to see the screen under water but the camera worked, the pictures were great. It performed as promised. I am pleased.", "Date": "July 19, 2013"}, {"Title": "Camera worth the price", "Author": "Joanel", "ReviewID": "R2GX0XAYJ7ILYK", "Overall": "5.0", "Content": "The camera was bought for a trip to Mexico.  I wanted to take pics underwater.  It worked great!  I had no issues with it, in fact, it turned out to be the only camera we used for the entire vacation.  I highly recommend this camera.  I was not disappointed.", "Date": "July 18, 2013"}, {"Title": "Great Camera for the Price", "Author": "Kim Kingsford", "ReviewID": "R2WHPPB3GOP497", "Overall": "5.0", "Content": "We really went back and forth on whether to spend the extra $200 to get the model up but decided this would probably work for our trip.  We are happy we saved the money, this is a great camera for the price.", "Date": "July 18, 2013"}, {"Title": "absolutely amazing camera for the price", "Author": "jose", "ReviewID": "R3SDFDOGUHLU5F", "Overall": "5.0", "Content": "Exceeded my expectations in every possible way. Can't do better for $130... I use it asa work / vacation camera and is working great. Haven't tried and probably won't try the underwater feature since it has gone really bad in previous versi8ns, for me it's just a plus to be able tu use it in the rain or near the pool.", "Date": "July 16, 2013"}, {"Title": "Good camera", "Author": "bellona yuan", "ReviewID": "RN4PEYZZALOV2", "Overall": "4.0", "Content": "Good camera for price. Didn't have a problem with the underwater setting. Yes, being underwater it wasn't as clear but still worked great in and out of the water.", "Date": "July 14, 2013"}, {"Title": "great", "Author": "me", "ReviewID": "R2D1X51S0HF5", "Overall": "5.0", "Content": "Awesome camera does everything and great pictures I would definitely recommend. Florida vacation was great with this camera. Needs more than one battery for sure.", "Date": "July 13, 2013"}, {"Title": "Great Camera for Kids", "Author": "csearer", "ReviewID": "R1EYLFCSZ135R1", "Overall": "4.0", "Content": "We bought this for our 9 year old's birthday. He wanted a camera and I was not about to buy him a camera that wasn't rugged enough to take the drops, spills, and thrills of a 9 year old. Takes good pictures for what it is. Low light situations are not it's specialty. If you're looking for a camera that you know is going to take abuse, this is a great choice. The menu is pretty easy to navigate and the battery last a good amount of time. If you're looking for something that take first rate pictures, spend a bit more money and get a better camera with a nicer lens and more shooting options.", "Date": "July 11, 2013"}, {"Title": "Love it", "Author": "Linda Mcnamara \"lemcnamara\"", "ReviewID": "RGY7WGGHMY19J", "Overall": "5.0", "Content": "It is easy to use and reminds you to make sure the door for the battery and media card it closed and locked. Light weight and long lasting battery. Thumbs up!", "Date": "July 11, 2013"}, {"Title": "Does the trick!", "Author": "david lam", "ReviewID": "RXH5SQP601S42", "Overall": "4.0", "Content": "Was waterproof to ~ 20ft.  Pictures and videos in ocean and on water slide were good.  No issues.  I am happy with it.", "Date": "July 8, 2013"}, {"Title": "Nice Camera", "Author": "Ngina Wilson", "ReviewID": "R3N15VOB8QK623", "Overall": "4.0", "Content": "Nice pictures that it takes, the pictures are clear and it is easy to operate. I like the color of the camera. I have not used the feature yet, but saying that is waterproof is a nice feature just in case something may spill on it.", "Date": "July 6, 2013"}, {"Title": "Flash pictures have issues......", "Author": "James S. Middleton", "ReviewID": "R3D386TYQPN5JK", "Overall": "2.0", "Content": "Started out good.  Pictures/sensor started showing hotspots, circles, in flash pictures.  Sent in for warranty exchange.  Refurb does same thing.  Non-flash pictures great.  Flash pictures have little circles look like water drops, hot spots.  Not happy.  Not a cheap camera.Just contacted Panasonic AGAIN.....12.17.2013 UPDATEWell Panasonic agrees the refurb replacement camera needs repairs. Gee.... BUT they just sent me a bill for almost 200 dollars that they want ME to pay to do so.Really?It is still under warranty.Talk about lousy customer service. I called the phone number and it is an automated operator. You can't speak to a person. I tried every way imaginable and I could not get to a human being. So I faxed all documents, sales receipts, emails, etc., and wrote on the fax for them to call me.....I'll never buy Panasonic again.", "Date": "November 24, 2013"}, {"Title": "Tough waterproof camera", "Author": "K.V.", "ReviewID": "RR6HAJF475N8K", "Overall": "5.0", "Content": "I bought this in July to take kayaking, both flat water and white water. I gotta say: I have beaten the crap out of this thing, and it's still going strong. It's definitely safe for water as long as you make sure it's closed properly. I always keep a float strap attached to it because I've dropped it in moving water more than once. the float strap is a life saver because the camera will sink. I've also dropped it on the hard ground more time than I can count. It's always falling out of something. The picture quality is good, not fantastic, but my pictures come out much better than anyone else's waterproof camera that I've seen. I rarely use it for video, but I'm thinking of finding a way to mount it on my kayak since my friends have so much trouble with their expensive Go Pros. Battery life is solid. For me, it lasts about 2-3 days turning it off and on, maybe 1 day it's getting heavy use. If you want a good outdoor camera, especially for water, this is a great pick. I've been very happy with it", "Date": "November 6, 2013"}, {"Title": "Love it", "Author": "Amazon Customer \"radise\"", "ReviewID": "R1VOKSPECYLS2J", "Overall": "5.0", "Content": "Have had the camera for a week now and have used it just about anywhere. Have taken the camera to the pool, in the ocean and more. I love it. It works better then I thought it would and the images quality is very good for such a compact camera. If looking for a waterproof machine for everyday use I totally recommend it.", "Date": "October 26, 2013"}, {"Title": "Great little camera", "Author": "Melanie Mitchell", "ReviewID": "R3GFBU0K8CTDJ4", "Overall": "5.0", "Content": "I bought this camera in preparation for a day at SeaWorld, after reading blogs saying don't bring a high end camera & buy a waterproof one. However, since I have a fair amount of money in my DSLR, I needed to stay economical. The Lumix has been to pools, SeaWorld, & scuba diving at Key West and has been everything advertised. Good pics & easy to operate; well worth the price & now my daughter is buying one.", "Date": "July 4, 2013"}, {"Title": "Great point and shoot for the money!", "Author": "Rick Neller", "ReviewID": "R1Z2EIV5DO2RCO", "Overall": "5.0", "Content": "I bought  this camera for my honeymoon in the Bahamas.  I was planning to do lots of swimming and watersports and needed something waterproof.  I decided to give this one a shot at it, not really expecting much and just hoping it would survive long enough to give me some good honeymoon shots.  It did a great job.  For a point and shoot, I was pleasantly surprised by the image quality.  I had this camera in my swimsuit pocket most of the week, kept it in there in the pool and took it snorkeling and jetskiing in the ocean.  It was nice to have the opportunity to just take this out and take a picture no matter where I was and what I was doing.  I plan on doing a good bit of river running with this camera as well.", "Date": "July 2, 2013"}, {"Title": "Died during vacation - adding insult to injury is have to pay shipping to get it repaired", "Author": "JustADad \"JustADad\"", "ReviewID": "R3RDJP0DH7MBBU", "Overall": "1.0", "Content": "Bought this camera a month before our vacation to Mexico.  It died during our trip - would not power on after confirming that the battery was charged.  Great.  No camera.  Got back to the USA and found out that I had to pay shipping to get it repaired under warranty.I have a handful of photos from it, and the quality is not as good as the old, low end Canon camera I have.  I really wish I could have just returned it and purchased another brand/model, but I was five days outside the return window.I've been a Canon guy for years, and this was not a good way to convert me to Panasonic....", "Date": "August 17, 2013"}, {"Title": "Breaks easily", "Author": "David Weinstein", "ReviewID": "R2PZ61W5DWOJOY", "Overall": "1.0", "Content": "Broke easily while swimming underwater in the ocean (snorkeling, held within 2 feet of the surface).  I had a previous Lumix which broke while swimming in the ocean, so i was extra careful that this Lumix was being handled properly.  Even though the seal was locked properly, it broke after being underwater for 15 minutes.", "Date": "May 6, 2014"}, {"Title": "STOPPED WORKING THE FIRST TIME IT GOT WET!!!", "Author": "John M. LaSala", "ReviewID": "RD684N6OHYDV0", "Overall": "1.0", "Content": "We purchased this camera for a college field trip for our daughter. They needed to photo document their research of a coral reef for her studies major. The camera froze up after one snorkel trip and stopped working completely. Needless to say she will have difficulty with this class since she now has to rely on photos taken by the other students. Obviously we are completely disappointed and will be returning the camera for a refund.", "Date": "March 24, 2014"}, {"Title": "photos are blurry!", "Author": "annielogan", "ReviewID": "RTHZDY7RTB6E4", "Overall": "1.0", "Content": "before going on a beach vacation, i took some photos at a birthday party. i took about 100 photos and when i looked at the photos on my computer, not one photo was clear! each picture was blurry, nothing was sharp, and the colors were awful!! -- and this was out of the water! i ended up returning this and buying the Olympus underwater camera. it was almost double the price, but it was definitely worth it when i saw the crystal clear, gorgeous photos of my vacation, both underwater, on land, low light, everywhere... definitely don't waste your money on this piece of garbage.", "Date": "January 25, 2014"}, {"Title": "Not waterproof at all", "Author": "aobeachgirl \"aobeachgirl\"", "ReviewID": "R3J76L73IP1L9S", "Overall": "2.0", "Content": "Failed on first trip into water.  Took great pictures up until then, but the whole point was for it to work in water.  I followed directions exactly (and this is my second Lumix-- the first one worked fine in water) and so I don't think it was anything I did.", "Date": "December 2, 2013"}, {"Title": "Oversold, under-delivered.", "Author": "Doug", "ReviewID": "R3U99FJEZMV0DW", "Overall": "2.0", "Content": "Picture quality isn't very good and certainly not better than an iPhone.  The 8x zoom, to me, was inaccurate.  It's actually a 4x zoom with software enhancements which Panasonic feels doubles the image zoom capability.  We got it for someone as a gift- now we feel embarrassed as its just not a very good quality camera- certainly not for the price.", "Date": "November 30, 2013"}, {"Title": "Great camera for newbies", "Author": "vmm312 \"ViMa\"", "ReviewID": "R1JZS3RCFJRP1H", "Overall": "5.0", "Content": "I'm not an expert on cameras. I was looking for a good, stable point and shoot that could survive rougher trips like camping and the beach. So far I'm pleased with the quality of pictures that I've taken. I haven't dropped it so I'm not sure of the toughness, but I've taken it to 6 flags, and it survived being splashed on. I also got it the floating wrist, just in case.", "Date": "November 17, 2013"}, {"Title": "perfect", "Author": "Michael Robinson", "ReviewID": "R11Z6F6C63NLB3", "Overall": "5.0", "Content": "I brought the camera for my wife. the flash works in one second and thats great, no more pressing hard and blurry pictures.", "Date": "October 25, 2013"}, {"Title": "First Screen Asks SAME QUESTION EVERY TIME.", "Author": "Wynette L. Weaver", "ReviewID": "RJQAE2D7J15TA", "Overall": "3.0", "Content": "The reason I like point and shoots is that you can whip the camera out of your pocket to your eye and get the shot when it happens. Not with this camera because a message appears about being careful if you are using it underwater. When you click the shutter another message appears saying something about Do you want to review how to use underwater? Then you have to slide a slider from YES to NO and press shutter again.  Good luck getting that great shot that has now gotten away.  This camera got a rave review for the price and now I remember at the very end was one line saying something like, \"The only annoyance is the screen that asks if you are using the camera underwater\"  This is more than an 'annoyance'.  I don't think there is a way to undo this message.", "Date": "October 24, 2013"}, {"Title": "Blue lines in HD video", "Author": "Flat Stanley", "ReviewID": "R187H3WOC14HTT", "Overall": "2.0", "Content": "<!--\n\nfunction fp_resizePlayerSpace(nsPrefix,w,h)\n{\t\n  try {\t\n    var ifrm = parent.document.getElementById(nsPrefix + \"movieFrameID\");\n    if (ifrm) {\t\n        var h2 = h + 35;\n        ifrm.style.height = h2;\n      }\n    } catch(err) {\n \n    } \n\n\n  if (h > 0) {\n      document.getElementById(nsPrefix + \"clipDiv\").style.height=h+\"px\";\n      document.getElementById(nsPrefix + \"videoPlaceholder\").style.height=h+\"px\";\n  }\n  else {\n      document.getElementById(nsPrefix + \"clipDiv\").style.height=\"\";\n      document.getElementById(nsPrefix + \"videoPlaceholder\").style.height=\"\";\n  }\n  document.getElementById(nsPrefix + \"flashcontent\").style.height=\"100%\";\n}\n\nfunction fp_rewriteDiv(nsPrefix,divName,html)\n{\t\n    document.getElementById(nsPrefix + divName).innerHTML=html;\n}\n\nfunction embeddingPopup(nsPrefix)\n{\n  alert(\"placeholder function for embedding code\");\n}\n-->\n\n\n<!--\n\nfunction cv_mo1N7ATS7S7FG6OembeddingPopup(){\t\nalert(\"Embedding code will be displayed here.\");\n}\n\n-->\n\n\n\n\n\n\n\n\n\n<!--\nfunction cv_mo1N7ATS7S7FG6Orefresh_preplay() {\n\ndocument.getElementById(\"cv_mo1N7ATS7S7FG6OchiDiv\").innerHTML = document.getElementById(\"cv_mo1N7ATS7S7FG6OhiddenPre\").innerHTML;\n};\ncv_mo1N7ATS7S7FG6Orefresh_preplay();\n\n-->\n\n\n\n\n\n\n        // <![CDATA[\n\nvar cv_mo1N7ATS7S7FG6Oso;\t   \n\n\nfunction cv_mo1N7ATS7S7FG6OloadSwf_Core(swfLocation, swfWidth, swfHeight, flashVersion, bgColor, swfParams, flashParams, embedAttributes) {\n\n  try {\n      cv_mo1N7ATS7S7FG6Oso = new SWFObject(swfLocation, \"cv_mo1N7ATS7S7FG6OAMPlayerProd\", swfWidth, swfHeight, flashVersion, bgColor);\t   \n\n      for (var v in swfParams) {\n        cv_mo1N7ATS7S7FG6Oso.addVariable(v, encodeURIComponent(swfParams[v]));\n      }\n      for (var v in flashParams) {\n        cv_mo1N7ATS7S7FG6Oso.addParam(v, flashParams[v]);\n      }\n      for (var v in embedAttributes) {\n        cv_mo1N7ATS7S7FG6Oso.setAttribute(v, embedAttributes[v]);\n      }\n\n      cv_mo1N7ATS7S7FG6Oso.addVariable(\"swfEmbedTime\", new Date().getTime());\n\n      var agt = navigator.userAgent;\n       \n      var reFirefox = new RegExp(\"firefox/\", \"i\");\n      var regx = agt.split(reFirefox);\n      var ffVersion = 8;\n      if (regx[1]) {\n          var pts = regx[1].split(/[.]/);\n          ffVersion = parseFloat(pts[0] + \".\" + pts[1]);\n      }\n      var minorVersion = parseFloat(navigator.ap);\n      if ((navigator.appVersion.indexOf(\"Mac\")!=-1) || (ffVersion < 1.5)) {\n          cv_mo1N7ATS7S7FG6Oso.setAttribute(\"height\", swfHeight);\n          cv_mo1N7ATS7S7FG6Oso.setAttribute(\"width\", swfWidth);\n          cv_mo1N7ATS7S7FG6Oso.addVariable(\"oldFirefox\", \"1\");\t     \n      }\n\n      if (cv_mo1N7ATS7S7FG6Oso.write(\"cv_mo1N7ATS7S7FG6Oflashcontent\")) {\n          fp_resizePlayerSpace('cv_mo1N7ATS7S7FG6O', \n                               320, \n                               283);\n      }\n      else {\n          var nsPrefix = 'cv_mo1N7ATS7S7FG6O';\n\n          fp_resizePlayerSpace(nsPrefix, 0, 0);\n          fp_rewriteDiv(nsPrefix, \"flashcontent\", '<br/>To view this video download <a target=\"_blank\" href=\"http://www.macromedia.com/go/getflashplayer\" target=\"_top\">Flash Player</a> (version 9.0.115 or higher)');\n      }\n  } catch(err) {\n      fp_resizePlayerSpace('cv_mo1N7ATS7S7FG6O', 0, 0);\n  }\n  return false;\n}\n\n\n\nfunction _cv_mo1N7ATS7S7FG6OloadSwf(movieID, playerVersion) {\n    var swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/20120510035744301/AMPlayer._V148501545_.swf\";\n    var swfWidth = \"320\";\n    var swfHeight = \"100%\";\n    var flashVersion = \"9.0.115\";\n    var bgColor = \"#FFFFFF\";\n\n    var swfParams = {};\n    var flashParams = {};\n    var embedAttributes = {};\n    swfParams.amazonPort = \"80\";\n    swfParams.allowFullScreen = \"true\";\n    swfParams.telemetrySubPageType = \"VideoReview\";\n    swfParams.nsPrefix = \"cv_mo1N7ATS7S7FG6O\";\n    swfParams.locale = \"en_US\";\n    swfParams.logUrl = \"gp/mpd/l\";\n    swfParams.canResize = \"1\";\n    swfParams.autoPlay = \"1\";\n    swfParams.sessionId = \"000-0000000-0000000\";\n    swfParams.marketplaceID = \"ATVPDKIKX0DER\";\n    swfParams.salign = \"LT\";\n    swfParams.preset = \"detail\";\n    swfParams.mediaObjectId = \"m26UW9ZFANZ3V\";\n    swfParams.autoPlayTimer = \"\";\n    swfParams.mediaObjectIDList = \"m26UW9ZFANZ3V\";\n    swfParams.playIsUserGenerated = \"1\";\n    swfParams.enableShare = \"0\";\n    swfParams.permUrl = \"gp/mpd/permalink\";\n    swfParams.telemetryPageTypeID = \"R187H3WOC14HTT\";\n    swfParams.xmlUrl = \"http://www.amazon.com/gp/mpd/getplaylist-v2/m26UW9ZFANZ3V/000-0000000-0000000\";\n    swfParams.amazonServer = \"www.amazon.com\";\n    swfParams.scale = \"noscale\";\n    flashParams.allowFullScreen = \"true\";\n    flashParams.salign = \"LT\";\n    flashParams.bgcolor = \"#FFFFFF\";\n    flashParams.allowScriptAccess = \"always\";\n    flashParams.quality = \"high\";\n    flashParams.wmode = \"transparent\";\n    embedAttributes.title = \"Flash Player\";\n\n    if (movieID){\n      if (playerVersion == '3'){\n        swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/20120510035744301/AMPlayer._V148501545_.swf\";\n        swfParams.mediaObjectIDList = movieID;\n      } else {\n        swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/legacy/20101014901/AMPlayerProd._V197491872_.swf\";\n      }\n      swfParams.xmlUrl = \"http://www.amazon.com/gp/mpd/getplaylist-v2/\" + movieID + \"/000-0000000-0000000\";\n      flashParams.wmode = \"transparent\";\n      swfParams.autoPlay = \"1\";\n    }\n\n    if (document.getElementById('cv_mo1N7ATS7S7FG6Oduration')) {\n      document.getElementById('cv_mo1N7ATS7S7FG6Oduration').style.display='none';\n    }\n    cv_mo1N7ATS7S7FG6OloadSwf_Core(swfLocation, swfWidth, swfHeight, flashVersion, bgColor, swfParams, flashParams, embedAttributes);\n\n  return false;\n}\n\nfunction cv_mo1N7ATS7S7FG6OloadSwf(movieID, playerVersion) {\n   return _cv_mo1N7ATS7S7FG6OloadSwf(movieID, playerVersion);\n}\n\n\n\t\n\t\t// ]]>\n\t\n\n<!--\n\nfunction cv_mo1N7ATS7S7FG6OnewHeight(h)\n{\t\n    fp_resizePlayerSpace('cv_mo1N7ATS7S7FG6O', 0, h);\n}\n\nfunction cv_mo1N7ATS7S7FG6OresetPlayer(w,h,bw,cc) {\n  cv_mo1N7ATS7S7FG6OnewHeight(h);\n\n  cv_mo1N7ATS7S7FG6Oso.addVariable(\"resetBandwidth\", bw);\n  cv_mo1N7ATS7S7FG6Oso.addVariable(\"cacheCode\", cc);\n  cv_mo1N7ATS7S7FG6Oso.setAttribute(\"height\", h);\n  cv_mo1N7ATS7S7FG6Oso.setAttribute(\"width\", w);\n  cv_mo1N7ATS7S7FG6Oso.write(\"cv_mo1N7ATS7S7FG6Oflashcontent\");\n}\n\n-->\n\n\n\n\n\n\n\n\nvar cv_mo1N7ATS7S7FG6ORollOverImg = new Image();\ncv_mo1N7ATS7S7FG6ORollOverImg.src = \"http://ecx.images-amazon.com/images/I/71K8GEL1zKS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play-active,BottomLeft,130,-12_CR0,0,0,0_.png\";\n\nvar cv_mo1N7ATS7S7FG6Opreplay = document.getElementById('cv_mo1N7ATS7S7FG6OpreplayImageId');\nif (cv_mo1N7ATS7S7FG6Opreplay) {\n  cv_mo1N7ATS7S7FG6Opreplay.onmouseover = function() {\n    cv_mo1N7ATS7S7FG6Opreplay.src = \"http://ecx.images-amazon.com/images/I/71K8GEL1zKS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play-active,BottomLeft,130,-12_CR0,0,0,0_.png\";\n  }\n  cv_mo1N7ATS7S7FG6Opreplay.onmouseout = function() {\n    cv_mo1N7ATS7S7FG6Opreplay.src = \"http://ecx.images-amazon.com/images/I/71K8GEL1zKS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play,BottomLeft,130,-12_CR0,0,0,0_.png\";\n  }\n  \n  \n  var node = cv_mo1N7ATS7S7FG6Opreplay.parentNode;\n\n  var cv_mo1N7ATS7S7FG6OcurrentClick = node.onclick;\n  node.onclick = function () {\n    var head = document.getElementsByTagName(\"head\");\n    if (head[0]) { \n      var logTag = document.createElement('script');\n      logTag.type = \"text/javascript\";\n      logTag.src = \"/gp/customer-media/du/log.html?ie=UTF8&p=CustomerImage&s=CustomerVideoPlay\";\n      head[0].appendChild(logTag);\n    }\n\n    if (cv_mo1N7ATS7S7FG6OcurrentClick) {\n      return cv_mo1N7ATS7S7FG6OcurrentClick();\n    }\n  }\n}\n\n\n\n\n Length:: 0:31 MinsCheck all features of your camera carefully!! Both models I received suffered from the same problem. I've given up now and will choose another brand.Blue/purple vertical lines appear in the recorded HD video. They are most prominent in lower light scenarios with solid color backgrounds (such as indoors, against a wall). The lines are not present in the pictures, or in VGA video. I returned the first camera, hoping it was fluke, but the second version suffered from the same problem, just in a slightly different location. This is probably poor quality control, and I'm betting most of the other users have the same problem, they just haven't noticed it yet. I've tried to upload a video, but Amazon's video compression will probably remove the lines. The most prominent line appears in the very center of the frame. Again, this is visible on ALL HD videos, it's just harder to make out when the background is busy.As to the picture quality, it's what you'd expect from a camera this small. Photos are adequate in daylight, but suffer in low light scenarios (not much better looking than my phone).Video quality looks overly smoothed, probably from heavy handed noise filtering.I cannot attest to the ruggedness or waterproofing of the camera, since it was defective right out of the box.TL;DR - HD video recording is defective. Photos are ok with enough light. Would not buy.", "Date": "July 17, 2013"}, {"Title": "water proof great", "Author": "Jamie M. Brewin \"Jamie\"", "ReviewID": "RZQ6RU5DFF5Z7", "Overall": "4.0", "Content": "we went on vacation at a water park and i had it on the whole time. it worked beautifully. i got lots of compliments and odd looks too. the pics came out great. its made to handle bumping too and it held up pretty good with that as well.i recommend this camera for anyone who wants to alot of pics on the water. it also takes pretty nice pics. night time pics not so much since the flash doesnt go that far. overall good camera for what my needs were.", "Date": "July 15, 2013"}, {"Title": "Read mixed reviews and took a chance, but it disappointed", "Author": "pam bomersbach", "ReviewID": "RS5FW9P990ET5", "Overall": "2.0", "Content": "I liked the features on this camera, so I took a chance on it, even though many reviews stated that it stopped working after the first time out.  I took my new camera to Cancun, and was loving it in the beginning.  There are a lot of fun features, and it seems user friendly.  I took it in the pool one day, and followed the instructions for after water use.  The camera failed to work for the remainder of the trip (only got 3 out of 8 days on it), and although the camera is working now, it is slow, and the left side of the viewer is not the same.  I have been meaning to contact Panasonic about it, but have been extremely busy since coming back from Paradise.  I considered the Panasonic Ts20, and maybe I should have chosen that one.  I may have just gotten a faulty camera, and would consider owning another Panasonic, but was disappointed with the underwater features.", "Date": "July 9, 2013"}, {"Title": "Great product for the price. Mid range waterproof , weatherproof point and shoot camera", "Author": "Amazon Customer", "ReviewID": "R2RD8MIOH5GL59", "Overall": "5.0", "Content": "Bought this camera for a trip to the south pacific. Satisfied with the features and functionality. Good product for the price. My only gripe is that there is no lens cover", "Date": "June 29, 2013"}, {"Title": "Very good underwater camera", "Author": "Nick", "ReviewID": "RIB1QV73OM0OP", "Overall": "4.0", "Content": "I used this camera in the on vacation and took a lot of pictures underwater and they all came out very good, I would reccomend this to anyone who is going to need some underwater pictures.", "Date": "June 7, 2014"}, {"Title": "Heavy Duty Camera that's Pocket Size.", "Author": "JCinTN \"JCinTN\"", "ReviewID": "RRAFE3HTS5W9F", "Overall": "5.0", "Content": "Heavy duty but able to take good pictures. I am somewhat clumsy and have dropped severalgood cameras which couldn't be repair. I am looking forward to a long life with this Lumix.", "Date": "May 25, 2014"}, {"Title": "Quality not as good as expected", "Author": "Carina Gonzales", "ReviewID": "R2TXED653HZA0Q", "Overall": "4.0", "Content": "The underwater shots were not as good as my daughters Fuji camera. Hers were in color and focus, mine looked gray.", "Date": "May 19, 2014"}, {"Title": "Gift", "Author": "SLChavez", "ReviewID": "RT8FZ0VWUUYY9", "Overall": "4.0", "Content": "So far camera looks good however, I like my Nikon Cool pix better. This was purchased as a present and they like it.", "Date": "May 18, 2014"}, {"Title": "Better than expected.", "Author": "JL", "ReviewID": "R1TQ5HRMM7HCH", "Overall": "4.0", "Content": "I bought this camera for my wife to take pictures while snorkeling. Although the pictures aren't super high quality, the camera does the job. Took some great pictures of Manta Rays and Tropical Fish while on vacation and was super glad to have an underwater camera with us. You get what you paid for and after doing some research I found this camera was the best \"bang for the buck.\" This camera did not disappoint and I found that the pictures were better than I expected albeit not \"high\" quality but still great.", "Date": "May 16, 2014"}, {"Title": "A small format, ruggetized camera.", "Author": "J. Billhofer", "ReviewID": "R3C3MJDQYXF05R", "Overall": "4.0", "Content": "The camera arrived on time and was well packaged. We shot over 200 images so far and have no real complaints. If the camera really works when submerged will the future show.", "Date": "May 15, 2014"}, {"Title": "Good camera", "Author": "Anita Rothgery", "ReviewID": "R1E6CJJ3A2OUTH", "Overall": "4.0", "Content": "I am a home inspector and have trouble keeping the dirt out of a camera that goes under a home.  This camera is great for that.  The flash is not nearly as good as the flash on the camera we were using.  If they would improve the flash it would be perfect.", "Date": "May 15, 2014"}, {"Title": "Good Camera", "Author": "chasstone", "ReviewID": "R13MBWUJHPT5H6", "Overall": "4.0", "Content": "Despite some negative reviews, this camera arrived very quickly, the package contained everything it stated, it all worked and worked well. My photos of the grandchildren in the pool and the sea were great; and it's a great price. The camera is plastic so I'm not yet sure just how durable it is ..... get the 16 or 32 gig card with it ... an essential, and the Nordic floating strap ... it keeps the camera afloat and is not too obtrusive.", "Date": "May 12, 2014"}, {"Title": "Panasonic Lumix DMC-TS25", "Author": "Silvio Henrique Araujo Couto", "ReviewID": "R2W3Z4T87KFTYC", "Overall": "3.0", "Content": "Bought because is waterproof. I had no problems in wet enviroments.Works fine, but with limitations. The pictures are acceptable.It's okay for the price.", "Date": "May 8, 2014"}, {"Title": "Poor image quality.", "Author": "Shuhai Fan", "ReviewID": "R3FHNN9PSFUOGD", "Overall": "2.0", "Content": "This camera is well build and cool. Focus fast. Video quality is ok. But Image is grainy even in bright daytime. Worse than my several cheap phones. When taking photos at night using flash light, 8 out of 10 are severely over exposure. Return it after one day testing. Feel pity about this camera. Although I got it at about 90 bucks when Amazon promoted it, I still don't like to keep it.", "Date": "May 7, 2014"}, {"Title": "Not that great", "Author": "John L. Wathen", "ReviewID": "R3PMS7WRX5T328", "Overall": "2.0", "Content": "Not too good with zoom. Fuzzy at digital zoom. Weak video.Does good for pocket camera used for collecting evidence in rainy weather.", "Date": "May 6, 2014"}, {"Title": "great watterprof camera", "Author": "Javier Carballo, Venezuela \"Javier Carballo\"", "ReviewID": "R1WIIFI6O5GFJD", "Overall": "5.0", "Content": "this camera change my days of beach and pool making amazing photos in all environments, digital zoom does its job, very happy with this purchase.", "Date": "May 2, 2014"}, {"Title": "Worked underwater well!", "Author": "Miles Copeland", "ReviewID": "RG008DE5RV20V", "Overall": "5.0", "Content": "I bought this for my daughter for our trip to Hawaii. Initially had been looking at waterproof cases, but well made ones cost almost as much as a camera. After looking at many reviews, I choose this camera and I have to report that it did very well.  Took great shots and video of the fish snorkeling as well as good pictures on land.  Two thumbs up!", "Date": "May 2, 2014"}, {"Title": "Great Camera", "Author": "Sajmon", "ReviewID": "R16CBRX0L853WY", "Overall": "4.0", "Content": "battery life can be a little short, but worked well on our vacation to Hawaii.  No leaks despite a 4 and 7 year old as primary users. Good pictures both above and below water, but obviously not a SLR", "Date": "April 28, 2014"}, {"Title": "Works great!", "Author": "Darryl", "ReviewID": "R1U7927E4DO2UX", "Overall": "4.0", "Content": "-  Turns on fast!-  Takes video with sound-  Can setup for LED to be on constantly when taking video-  Time lapse feature works well, but may have to read the manualAnd yes, it takes nice pictures under water!  I don't have a $500 waterproof camera to compare it to, but I am happy with the purchase of this budget waterproof camera!", "Date": "April 27, 2014"}, {"Title": "Easy to usd", "Author": "R. ASTRID", "ReviewID": "R2VA78DTKYMFF7", "Overall": "5.0", "Content": "Love it, very easy to use, photo and video both with accessible bottom, very nice pictures for the price.Less clear with zoom especially for the video, I will try not to zoom for videos.Has a Panoramic picture setting that I like too", "Date": "April 24, 2014"}, {"Title": "I love it!!!!", "Author": "Aixa Ripoll", "ReviewID": "R36EHXSSTIS85", "Overall": "5.0", "Content": "I have one and I bought another one for my daugther.The photos are excellent escecially the beach. I love it!!!", "Date": "April 24, 2014"}, {"Title": "Nice Design, Waterproof, But So-So Picture Quality", "Author": "steve kloiber", "ReviewID": "R1PI2KSFS62XJD", "Overall": "3.0", "Content": "This is a nicely designed compact waterproof camera, but having already owned a Panasonic DMC FZ18, I had higher expectations for the picture quality. Shooting in intelligent auto mode my 6 year old 8MP FZ18 kicks butt over the brand new 16MP TS25. Of course, the optics are different. For the most part, I was able to post process the images to get a (somewhat) acceptable outcome.I did use it underwater without problem.", "Date": "April 21, 2014"}, {"Title": "Survived many Snorkles and abuse in the sand", "Author": "A. Nakashian \"all_day_breakfast\"", "ReviewID": "R16DYIO286RBD8", "Overall": "4.0", "Content": "I took this with me to Vieques for a 7 day vacation.  The waterproofing held!  I simply followed the instructions, and made sure there was never anything in the water seal before taking it into the sea.  It worked well down to about 10ft, with no moisture or fogging up of the lens.The picture quality was okay, but nothing to rave about.  Many of my underwater photos and videos were blurry and hard to make out.  The videos were especially dissapointing.", "Date": "April 14, 2014"}, {"Title": "quick decision paid off", "Author": "KLMN", "ReviewID": "R27E5GDEAWSA6Q", "Overall": "4.0", "Content": "we ordered this within 2 weeks of a beach and cruise vacation, wanted to try out a water camera, it was wonderful to have.  pictures came out great", "Date": "April 10, 2014"}, {"Title": "Nice pictures and video under the water.", "Author": "Gustavo R.", "ReviewID": "R17B8ZG3TA386A", "Overall": "5.0", "Content": "I recommend it. Nice pictures and video under the water. Good delivery time and all things arrived, camera, battery, user-guide and cd", "Date": "April 6, 2014"}, {"Title": "serves it's purpose", "Author": "mauimike \"jaime\"", "ReviewID": "RYFFH9E1FE02E", "Overall": "4.0", "Content": "this is a fine little camera for what it was designed for... shallow water snorkeling. bought this camera on cyber monday sale for about $110 making it well worth the money. best underwater pictures are at 6 -10 feet distance.", "Date": "March 20, 2014"}, {"Title": "Cool waterproof camera with a tiny splashing price", "Author": "Alam A.", "ReviewID": "R34TWNKIEV0JJA", "Overall": "5.0", "Content": "Tested it, try it on land and water........goooood. The picture are good (not that super quality) but it meet my expectation.The battery lasted for 4 days, with the last day of full usage in the pool with my kids. No GPS or WIFI connection, but fit the price of less then $100.", "Date": "March 15, 2014"}, {"Title": "Gift for our daughter!", "Author": "R.Durand", "ReviewID": "RUIJ9Q9OZ678P", "Overall": "5.0", "Content": "Our daughter had this camera on her wish list for Christmas.  As far as I know, she is satisfied with the quality of this product.", "Date": "March 11, 2014"}, {"Title": "Great for the $", "Author": "sara kleckner", "ReviewID": "R1HRHVHPXF7777", "Overall": "5.0", "Content": "Amazing for the price I paid. Great clear pics in a small compact size. Easy to use. B. T w", "Date": "March 10, 2014"}, {"Title": "Lens gets DIRTY", "Author": "AB \"AB\"", "ReviewID": "R28WDKESC03XRN", "Overall": "4.0", "Content": "Ok so YOU MUST GET a dust cover or case for this camera.  Unlike most camera that have that cover over the lens.  this doesn't so be prepared to clean it often and put it in a case.  It was easy for me to download pics to my computer with the memory card.  The cub scouts love using this camera and large screen for viewing their pictures.  I have not tested under water yet.", "Date": "March 2, 2014"}, {"Title": "Good cheap waterproof camera", "Author": "Austin Andersen", "ReviewID": "R1TOVC0BTZJP5Z", "Overall": "4.0", "Content": "Took this to tahiti for honeymoon. Worked the whole time without issue of any leakage for lens fogging up. Didn't take it scuba diving but worked perfectly snorkeling. The one gripe is quality, but for $100 camera you get what you pay for. I did end up getting go pro 3+ silver after honeymoon and I would say save your money and get that instead, but wife likes ability to see photos which you can't do with gopro unless you buy attachment.One big negative was battery indicator. It said 2/3 for a very long time then within 5 minutes it was dead. This was with stock battery so that was disappointment as battery gave out before day was over and missed some opportunities.", "Date": "February 20, 2014"}, {"Title": "Not great", "Author": "Linda", "ReviewID": "R2ZSTPACKS9ING", "Overall": "2.0", "Content": "I bought this to replace my old underwater Lumix which I had had for a long time.  Disappointed as if is not as good, shutter speed really slow.  Have bought a Canon which is much better", "Date": "February 17, 2014"}, {"Title": "great pix", "Author": "Roxanne German", "ReviewID": "R1SWX9QUKXSA47", "Overall": "5.0", "Content": "terrific camera for travel and beach/pool shots.  withstands water, dropping, packing tight and takes great shots. i just love the color.  don't know why the blue costs more than the other colors, tho.", "Date": "February 15, 2014"}, {"Title": "Great camera for the price!", "Author": "Kim Morton", "ReviewID": "R2GF7G049QGNGN", "Overall": "5.0", "Content": "We bought this camera to use while snorkeling in Hawaii. It arrived with simple instructions and ready to use. We got some excellent underwater shots with it. It was easy to use, and produced close ups that are frame worthy. Very happy with the camera.", "Date": "February 15, 2014"}, {"Title": "Nice camera", "Author": "Johanna Mae Ondap", "ReviewID": "R1POVDCELJIWDL", "Overall": "5.0", "Content": "I loved this camera it take good pictures and also it is warerproof and dustproof. Great for outdoors! Xoom is okay. Price is great because its affordable.", "Date": "February 12, 2014"}, {"Title": "good upgrade", "Author": "Dennis Mulvaney \"nondestruct\"", "ReviewID": "R2DS0ND6QSMO73", "Overall": "5.0", "Content": "Had to replace my Tough UW camera and this one is an improvement with better tele, features, ease of closing and speed.", "Date": "February 10, 2014"}, {"Title": "amazing", "Author": "kevin", "ReviewID": "R3FIFJCX1VOAX0", "Overall": "5.0", "Content": "used on two vacations not and every day use at sporting events, great camera awesome pics out of water for every day use and pictures under water come out so nice and clear  love the panoramic feature and the video on this took videos of my dive in St. Thomas and then again in the Jungles of Dominican Republic. Great !", "Date": "February 10, 2014"}, {"Title": "Amazing little camera!", "Author": "ioana", "ReviewID": "R12UZ6DW0KO4XT", "Overall": "5.0", "Content": "I've done my research, and definitely the best little waterproof camera for the money! It takes great photos, the construction is high quality, it's reliable, it small and looks very nice!", "Date": "February 8, 2014"}, {"Title": "Decent setup for the price point!", "Author": "maclaren4l", "ReviewID": "R1QY21R6QFZ3X9", "Overall": "4.0", "Content": "This camera, as long as you follow the care instructions, works really well under water.  It's light and compact so you tuck it in your beach shorts pockets.  The image quality is par with other similar size compacts.  The optics and the sensor size are the limiting factors.  It takes pretty decent panoramic captures. Overall I would recommend this buying new.", "Date": "February 8, 2014"}, {"Title": "Awsome camera", "Author": "Kyle J. Von Bose \"Kyle von Bose\"", "ReviewID": "R3395Q0DKV8ACJ", "Overall": "5.0", "Content": "My last Panasonic camera was great but started to get spots in the view screen after i got it wet on a rafting trip. This camera shouldn't have the same problems. most people use these simply for \"point and shoot\" photos, but if you take the time to learn how to use all the functions and perhaps get a book on digital photography, you can really get some amazing shots out of these little cameras.", "Date": "February 6, 2014"}, {"Title": "Nearly perfect pictures", "Author": "Julie L.", "ReviewID": "R23OSU5KMD41H", "Overall": "5.0", "Content": "I bought this camera for a trip to the British Virgin Islands, where we would be in and out of water constantly.  I took nearly 650 pictures, most out of water.  This camera took excellent pics.  There are a large variety of settings available, which was great.  I especially loved the sunset setting, and took some amazing pics.  The underwater pics were good.  We only snorkel, so the depth of this camera suited us fine.  I was able to take clear and colorful pictures of the sealife.  Out of the 650 pics I took, only a handful were slightly foggy, but that appeared to be more sun glare on the water.  I also took video, in and out of water, which worked perfectly.  As to being shockproof, I did drop it a couple times without issue (we were on a boat and it fell off the counter when sailing).  I am very satisfied with this purchase, and highly recommend it to anyone wanting a durable and waterproof camera.", "Date": "January 31, 2014"}, {"Title": "Great camera", "Author": "Dee", "ReviewID": "R34A5M2OXMQXX6", "Overall": "5.0", "Content": "Had one similar, but broke the door so this I chose to replace it..  This is light weight and small, but don't let the size fool you.  It takes great pictures and is perfect for someone who likes taking pictures but it is not a big hobby.  It's small enough to put in your pocket, so it is always handy for those great shots.  I am not a technical person, but can manage to send photos in emails very easily.  It has an underwater feature with this camera, but have never tried it.  A warning appears about the underwater when you first turn on the camera, but there is a way to shut it off.", "Date": "January 30, 2014"}, {"Title": "It is waterproof!", "Author": "cice", "ReviewID": "R1L1RTDO1FXCEY", "Overall": "3.0", "Content": "I purchased this camera for a cruise, which included several days of snorkeling and beach trips.  It was very easy to use, and we had no problem with the waterproof feature. It was definitely waterproof! We snorkeled with it on two different occasions and also took it to the beach another time. By the way, it came in very handy during a rainy day excursion also.  This being said, the picture quality is just so-so.  My son said it best, when he stated that our smart phones produce better quality photos (although our smart phones aren't waterproof!).  The pictures from the Lumix require a fair amount of  photo editing on the computer in order to produce photos with acceptable coloring.  The focus tends not to be as crisp as I had hoped.I give this camera an acceptable 3 stars, because we had no problem what-so-ever with its waterproof capabilities, and were able to have fun taking photographs underwater. Overall, the quality of the photos was below my expectations. That being said, if you are looking to purchase a moderate priced camera to have fun with at the beach, this is a good option.", "Date": "January 28, 2014"}, {"Title": "Snorkeling", "Author": "Buyer", "ReviewID": "R313X58QW9OA7", "Overall": "4.0", "Content": "Bought two of these for my adult children to take on vacation. I also bought myself another brand at the same time. I liked the way you can go from video to still shots simply by pressing a different button. It came with a strap to put around your wrist while underwater to feel more secure but could use something to make it tighter. Takes wonderfull clear images, just be sure to clear the lens of water when going from water to land pics. Worked great in the saltwater and fresh. The reason for only 4 stars is that I can change modes faster and easier with my other brand name camera.", "Date": "January 28, 2014"}, {"Title": "Great middle of the road camera!", "Author": "phenley", "ReviewID": "RWYZPX4B22TXJ", "Overall": "4.0", "Content": "Great underwater camera with lots of nice features for the price! I can't wait to see my son's photos from Bora Bora.", "Date": "January 21, 2014"}, {"Title": "Great quality, fast operation", "Author": "Nick Contorno", "ReviewID": "R35RQYPA1956PF", "Overall": "5.0", "Content": "Needed to get a camera for underwater shots on a cruise. After a little looking around and suggestions from friends, we landed on this one. We were not disappointed.The different modes make choosing setting much easier. Underwater shots come out great. Power on is very short and non-flash pictures are very quick. Instructions were great for cleaning and care.", "Date": "January 21, 2014"}, {"Title": "I dropped it in the lake", "Author": "Uncle Ed", "ReviewID": "R2S9YKJWC7V2HY", "Overall": "5.0", "Content": "I was duck hunting, like to take pics in the down time, which on certain days can be a lot, and pulled this out on a frigid day and my hands were so cold it slid right out, hit the rail of the boat and plop into the water.  I fished it out, patted it dry for a few seconds, blew on it a few times and began to take pictures.  Since then both of my hunting buddies have bought the same camera.  Cell phones just cannot hold a candle to this units quality and easy of use.", "Date": "January 17, 2014"}, {"Title": "Good product just two suggestions.", "Author": "Yiralda Hernandez", "ReviewID": "R3B8VYKZX10XW", "Overall": "4.0", "Content": "The camera is great works perfectly, however should sell it to external memory included and have the option to change the language of the camera.", "Date": "January 16, 2014"}, {"Title": "panasonic underwater camera", "Author": "grandma", "ReviewID": "R3FTRVU4GZTT1Y", "Overall": "5.0", "Content": "I have bought these for all of my grandchildren when they turned 6 yrs old.  It is a sturdy camera and the lens is enclosed.  You do not have to worry about the lens mechanism breaking.  They do not use them underwater but do take them to the beach.", "Date": "January 16, 2014"}, {"Title": "Great little camera", "Author": "James J Kanelos", "ReviewID": "R3Q6LSXQQ6BTK5", "Overall": "5.0", "Content": "This camera takes very nice pictures.Did well in the water and out.Just make sure you soak it after each use in the ocean and you will be very happy!", "Date": "January 14, 2014"}, {"Title": "exactly what i expected", "Author": "Zachary Sale", "ReviewID": "RN2Y7UIHK8V83", "Overall": "5.0", "Content": "i liked how promptly it arrived; it was clear, the camera works great; and the camera has so many more settings that are useful; such as a setting for sunsets/sunrises, starry skies, water setting, and up close setting. all very cool.", "Date": "January 14, 2014"}, {"Title": "No issues at all, picture quality is pretty good", "Author": "RC-Everett", "ReviewID": "RNE6OUJ71OO3P", "Overall": "5.0", "Content": "We took the camera to Florida and a cruise in the Western Caribbean. I used it while snorkeling at a sunken ship off the Grand Cayman island and had no issues. I even had to swap flash cards half way through the excursion and it was fine. I did make sure the seal was clean and dry before closing and locking the cover. The next day the camera again got wet during a down pour in Cozumel and yet again during an air-boat ride in the Everglades. If you follow the instructions and make sure the seal is clean and dry when you close the cover the camera can handle water.", "Date": "January 14, 2014"}, {"Title": "Good for the purpose", "Author": "Igor Sorokin", "ReviewID": "RIZN548EG64VN", "Overall": "4.0", "Content": "I purchased the camera recently specifically for underwater fun and used it on my vacation to Mexico. It worked just fine. I did not expect extra quality shots from its lens. However the fun was there. The camera stayed dry during my 4 snorkeling sessions and took some good pictures above the surface too. Here is the link to some samples:  [...]", "Date": "January 12, 2014"}, {"Title": "Usually Canon - Loving Lumix!", "Author": "All-Access Customer \"Kristine PhotoGal\"", "ReviewID": "RI893MOJMBKH6", "Overall": "5.0", "Content": "I wanted a pocket size camera to carry with me each day -- I had a Canon Powershot previously but the lens cover jammed so I wanted a lens that did not have this same feature - So glad I went with the Lumix -- The size, weight, and results are everything I was hoping for ...", "Date": "January 9, 2014"}, {"Title": "Great little camera!", "Author": "Gerard F Doyle", "ReviewID": "R2ZM62YTNTQV5S", "Overall": "5.0", "Content": "Wanted a simple to use but \"good\" camera for my wife for Christmas. This fit the bill. She loves it!", "Date": "January 7, 2014"}, {"Title": "High performance", "Author": "Rodrigo A. Campos Cordero", "ReviewID": "RDGYRLQ0M6D2O", "Overall": "5.0", "Content": "I tested the camera en sunny, warm and wet places. The photos are perfect even in the tropical conditions.Light weight and easy operating system are good for everybody.It have a low price for a big quality product.", "Date": "January 6, 2014"}, {"Title": "Not worth the cost...", "Author": "Emmayee", "ReviewID": "R2BDGDBTJ1484A", "Overall": "2.0", "Content": "Outside pictures without zoom and flash are passable. Inside pictures not great. Underwater pics are blurry. :( Definitely not worth the cost....", "Date": "January 4, 2014"}, {"Title": "Great for use IATA Disney", "Author": "MARIAN G", "ReviewID": "R105MLDOOR4PL", "Overall": "4.0", "Content": "Adequate for the price. My daughter wanted a camera she could use in Orlando Florida. She is frequently at the Disney resorts. So far the pictures are clear and sharp", "Date": "January 3, 2014"}, {"Title": "Great camera", "Author": "jacqueline st. hilaire", "ReviewID": "R3QSD8MCMDJMVR", "Overall": "4.0", "Content": "Lighweight, easy to use and very nice pics.  Easy to download also.  Very pleased with it so far but looking forward to taking it on a trip soon.", "Date": "January 2, 2014"}, {"Title": "Very Good Quality Camera!", "Author": "U. Bell", "ReviewID": "R3O844N70G7FU4", "Overall": "4.0", "Content": "Used underwater, at the beach, while snorkling...etc I only wich there was more zoom; however, the zoom was pretty clear, not too fuzzy like other cameras.", "Date": "December 30, 2013"}, {"Title": "Awesome!!!! underwater recording quality", "Author": "Enthu \"Kanika\"", "ReviewID": "R1P0CAS4XU6OQC", "Overall": "4.0", "Content": "I bought this camera just before our trip to Cancun Mexico couple of weeks back.  I was looking for a waterproof camera that I could use in the pool and beach.  I ended up using this under water on a Sea Treck tour we went in eXcaret park in Cancun.  The quality of the video underwater was awesome.  Just the underwater recordings on this one trip I feel paid off the price of the camera ($112) I feel.  I am not sure if I can upload a snippet of the underwater recording here, but will try to google and if I find a way to do it, I will.  The regular picture quality too is awesome.  There were a few pictures that were pixilated, but I remember playing around with different modes, and seems like in one of the modes, the picture quality came bad.  But overall, I am very please with this camera.", "Date": "December 30, 2013"}, {"Title": "Great pictures inor out of water.", "Author": "Sebastian Stallone", "ReviewID": "R1P3BGZTVJWS66", "Overall": "4.0", "Content": "Good all around camera, for its price range, only flaw is it did not charge with usb cable, have to use battery adapter plug.", "Date": "December 29, 2013"}, {"Title": "One step up from my last one", "Author": "Helen", "ReviewID": "R2JBZK23T97DL", "Overall": "5.0", "Content": "This camera is one step up from my last Panasonic. A few added features that will make it great for bike and hiking trips.", "Date": "December 27, 2013"}, {"Title": "The best little camera!", "Author": "Esther Lietsch \"Esther's Treasures\"", "ReviewID": "R1Y8XIQC84K59P", "Overall": "5.0", "Content": "This was a present for my husband, he had a Lumix before it last years and finally the battery die he was thinking in getting a new battery that is how much in love he was with his camera, it took beautiful pictures and he took it to every party we had, now he got this one, same brand but updated,  and he is delighted with his new toy, has a lot of new functions, is light, and take beautiful picture! This is a great camera, you can take it any where just put it in your pocket and go!  Not complicated, easy to use , and is water resistant, which means that if for any reason get wet  won't stop functioning , just dried it and keep on going!  Believe me you won't go wrong with this one.", "Date": "December 26, 2013"}, {"Title": "Great camera", "Author": "Rita Forest", "ReviewID": "R1GW94EWHXIW20", "Overall": "5.0", "Content": "Bought as a gift for my grandson so it hasn't been put to hard use yet in the water or on a grip", "Date": "December 26, 2013"}, {"Title": "Awesome underwater video", "Author": "B. Wolfe", "ReviewID": "R3HVD2IP48JE7Q", "Overall": "5.0", "Content": "Bought this for my husband for Christmas for a snorkeling trip in the Philippines.  Unbeknownst to me, he had purchased a different brand for himself!  We took both cameras with us on the trip to a fabulous snorkeling site, and the underwater color videos taken with the Lumix were better color and quality than the other brand.  Great point and shoot as well.", "Date": "December 25, 2013"}, {"Title": "Pictures were not as clear as hoped", "Author": "tito cueva", "ReviewID": "R3JSDY5AT5E9S5", "Overall": "3.0", "Content": "Underwater pictures were not as clear as my sons cheaper underwater camera.  Was a bit disappointed.  I ended up giving it to my 11 yr old daughter to snap pics on vacation.", "Date": "December 23, 2013"}, {"Title": "Great underwater camera, took some excellent photos in average light", "Author": "reviewer999999", "ReviewID": "R39DW555QHJDS8", "Overall": "4.0", "Content": "The camera is great for closeup (less than 12 feet) photography, stick to 0-4 feet underwater unless incredibly clear.But don't use for landscapes or distance photos, just not the camera for that.  At the price point - this is a great choice for underwater holiday photos.", "Date": "December 23, 2013"}, {"Title": "awesome camera!", "Author": "Emain", "ReviewID": "R30VG6UOMZ3RCO", "Overall": "5.0", "Content": "this camera is awesome! if you take care of it the way it shows in the instructions this camera can do and go anywhere. multiple trips to the beach and in the ocean ( we try and keep it out of the sand, but the times it did hit sand nothing was compromised!) just have to make sure that nothing gets in or on the seems of the battery door!would buy again - Pictures are great. underwater pics depend on how clear the water is", "Date": "December 21, 2013"}, {"Title": "Good camera", "Author": "David L. Neer", "ReviewID": "R3CZMF8BXDYXSF", "Overall": "5.0", "Content": "Easy to operate and takes great snapshots and short videos.  Menu is easy to understand.  Have not yet used underwater.", "Date": "December 21, 2013"}, {"Title": "Good Camera", "Author": "Waldo \"Waldo\"", "ReviewID": "RG5ENEOLDAAWH", "Overall": "4.0", "Content": "I am happy with this camera.  Used it for a snorkeling trip and it worked great for that and the rest of the vacation photos.", "Date": "December 20, 2013"}, {"Title": "Lumix", "Author": "Mike", "ReviewID": "R2N5XPDUX2QFMX", "Overall": "5.0", "Content": "I bought this camera to take on a trip to the Caribbean. I had priced underwater cases for other camera and decided to give this Lumix a shot, even with some of the mixed reviews. This camera works just fine. Took it snorkeling and was able to operate the camera underwater, took both pictures and video. The photos are not as good as some cameras, but overall I was very pleased with this camera, especially considering the price point. I had bought it with the theory of if it broke I would not be out a lot of money. Was pleasantly surprised with this camera.", "Date": "December 16, 2013"}, {"Title": "This camera is fantastic!", "Author": "L. Main", "ReviewID": "RE4AWYI2Z6QBF", "Overall": "5.0", "Content": "This camera is fantastic!  I bought for my MIL, and now I wish I could trade my waterproof camera for hers.  The quick response really makes a huge difference when taking pictures of moving objects (like my 3 yr old ALWAYS is), and it does great out of water which is where my Olymus TG-320 falls short.I would highly recommend this camera.", "Date": "December 13, 2013"}, {"Title": "Mediocre camera", "Author": "Jesuaph Nario", "ReviewID": "RBT1QIRBC35YH", "Overall": "3.0", "Content": "The two reasons I am giving this camera three stars is:One, the pictures do not come out as sharp.two,  In the fast moving mode it does not do what it promisses", "Date": "December 13, 2013"}, {"Title": "GREAT PRODUCT!", "Author": "Jason", "ReviewID": "RFCDEDJ4I11TZ", "Overall": "5.0", "Content": "Great product, I am very happy with my purchase.  The quality and price was great!  I would definitely recommend this to friends!", "Date": "December 11, 2013"}, {"Title": "great camera", "Author": "E Moreth", "ReviewID": "R8P76RMW6TN26", "Overall": "5.0", "Content": "Takes great pictures and the underwater function works perfectly. Videos are very good also. Easy to learn and my daughter loves the color.", "Date": "December 4, 2013"}, {"Title": "Great camera", "Author": "Kay \"Catherine Grenfell\"", "ReviewID": "RCOYVY84UOJAN", "Overall": "5.0", "Content": "Bought this for a 10-year-old who loved it.  He had one just like it but managed to lose it last September.  This one will be a Christmas gift.  Which it came with a clip to fasten the strap to a pocket.", "Date": "October 19, 2013"}, {"Title": "happy", "Author": "maria paz", "ReviewID": "R1566K6940Q79K", "Overall": "5.0", "Content": "very pleased. the camera is very light. great quality in the pictures. basic functins, but just what i wanted. pleased", "Date": "October 14, 2013"}, {"Title": "Perfect size, excellent quality", "Author": "Erik Novoa", "ReviewID": "R3RE98Q8FSOGFJ", "Overall": "5.0", "Content": "This is one of the best all purpose cameras on the market. It's perfect for keeping in your back pocket at a party or taking a panoramic picture on a hike. My pro camera is a tank but I hardly have it with me because of Hoeger weight. This is the camera that is with me all the time, which means it gets the shot.", "Date": "October 12, 2013"}, {"Title": "Great choice", "Author": "Pen Name", "ReviewID": "R1CKARWKDPNOQW", "Overall": "5.0", "Content": "This camera exceeded my expectations- excellent quality during the day. Night shots not as good. Would buy this camera again!!", "Date": "October 7, 2013"}, {"Title": "Meets and exceeds expectations", "Author": "Gr8Mom", "ReviewID": "R1RPTR5O9QCS7D", "Overall": "5.0", "Content": "This is definitely one tough little camera. It was so great to get to video my son swimming under water for the first time. It's been through a water park, pool, beach, kayaking. Great camera for people tough on their stuff.", "Date": "October 4, 2013"}, {"Title": "Great little camera", "Author": "castalure", "ReviewID": "RWZ8W2PB2AO20", "Overall": "5.0", "Content": "This little camera is terrific.  I use it when fishing, attached to my hat, mostly for videos.  The wide angle lets me get everything I need, without worrying if I'm looking exactly in the right direction, and it's waterproof, so I don't have to worry about using it in the rain.  It's also simple to use, so my not tech savvy wife can take good pictures with it too.  It's actually supposed to be her camera.", "Date": "September 27, 2013"}, {"Title": "Great underwater camera", "Author": "JTB71", "ReviewID": "R20SSB6MO83GX7", "Overall": "5.0", "Content": "I used this camera in the pool and took great movies and pictures. I also now use it in the rain instead of taking my larger camera. It is also small enough to fit in my pocket.", "Date": "September 24, 2013"}, {"Title": "WOW!!!", "Author": "Jake", "ReviewID": "R17NKEQARZC714", "Overall": "5.0", "Content": "I have never owned a camera I loved this much. I raft, bike, hike, & adventure, and this camera holds it's own. I researched for a better camera after my wife's 5th took a dump. I got her the orange one and then couldn't wait to get my black one. I have put this thing through all heck: spelunking the Ape Caves at Mt. St. Helens - and we found almost 200 Km of seemingly less explored tunnel; I had knee pads on & a helmet. I've also taken this camera in the Pacific Ocean countless times, Mt. Hood National Forest, rafting through class 3 & lower rapids (it could handle more), Yosemite valley; these cameras are our travel partners. I can't find words to express how proud of myself for getting these cameras - and how proud my wife is as well :0).", "Date": "September 23, 2013"}, {"Title": "Good petite waterproof camera", "Author": "Lindsey", "ReviewID": "R2GYP0YJP9N2TA", "Overall": "4.0", "Content": "We purchased this camera for our honeymoon. We have yet to use it in the ocean, but I tested it out in the pool and it worked well. I love how small and light this camera is. I always lug my heavy Nikon SLR around when on vacation. It is nice to have a second, smaller, back-up camera that will fit in my pocket and is waterproof. This is my 2nd Panasonic Lumix purchase and I continue to be impressed by their products.", "Date": "September 18, 2013"}, {"Title": "Compact, tough, and takes great pictures", "Author": "Harry Heflin", "ReviewID": "R1C4JYB71BC8BU", "Overall": "5.0", "Content": "I purchased this camera to take on a 23 day private Grand Canyon rafting trip. I wanted something that would shrug off the dust, sand, and serious water splashes since on my previous trips compact regular point and shoot cameras have died partway through the trip -- even though I was being very careful to keep them clean and dry. It's just a tough environment on the river. Sadly it cannot use AAA batts which are easy to recharge, but I bought a couple of extra lithium batts and was able to keep them charged using a solar charger. Off the river, since there is no lens extension to the front, the camera is slender and tends to fit well in the pocket. It fits in the 'watch' pocket on my jeans and I take it pretty much everwhere, not worrying about the environment. The kids love using it underwater, too!", "Date": "September 16, 2013"}, {"Title": "good quality!!", "Author": "Lindamarce \"lindamarce\"", "ReviewID": "RZMOZCNLTXEJD", "Overall": "4.0", "Content": "It has an acceptable quality but it's not accord to the offered. It functions ok in all places but it could be better with 16.1Mp!!!", "Date": "September 9, 2013"}, {"Title": "Awesome underwater camera", "Author": "Roe", "ReviewID": "R1G1DVOEAQITZF", "Overall": "5.0", "Content": "I JUST LOVE this camera. took awesome photos on my vacation. Fun and easy to use and it takes great photos in and out of the water.", "Date": "September 7, 2013"}, {"Title": "Fine, but a little heavier than expected", "Author": "Kevin McCloskey", "ReviewID": "R39XRG5F3KV7GC", "Overall": "4.0", "Content": "Dropped my old similar Panasonic DMC FP2 about 3 feet on to the sidewalk and it broke. No apparent damage, but it just stopped working. Actually, that was my second Panasonic that met that fate. I am clumsy, I guess. So I paid a bit more for the anti-shock feature on this one. I am not going to test it. But it promises it survived a 5 foot drop onto 1 inch plywood. So I still need to be careful on sidewalk. I am not likely to try the waterproof feature either. Size,same as prior camera, so old case and even cord to computer can be reused. Alas, battery is a different size.My first impression: this is heavier because of the \"armor\", same fine photo quality. Battery life is good.", "Date": "September 7, 2013"}, {"Title": "Great camera for the price", "Author": "J. Keillor", "ReviewID": "R1GG29HFTLDL58", "Overall": "5.0", "Content": "This camera is awesome. It's compact so its easy to carry around but it also takes great pictures and I love the color we chose, teal.", "Date": "September 7, 2013"}, {"Title": "Inexpensive water proof camera", "Author": "c. lam", "ReviewID": "R3DQF6T75PXJ1D", "Overall": "5.0", "Content": "Wish I bought it earlier.  Nice pictures, works in water, no leaks.  Small enough to be very convenient.  At this price, it's not fair to complain.", "Date": "July 31, 2013"}, {"Title": "Perfect Camera for the money.", "Author": "Vicente T. Rodriguez", "ReviewID": "R5VE2BTRE16SU", "Overall": "5.0", "Content": "Love this camera for the money,you get a very good compact lens,great underwater and normal pictures,plus all the other features like wide angle,16 MP,OIS,AI. I would buy it again .", "Date": "July 16, 2013"}, {"Title": "DIgital Camera", "Author": "Amazonian", "ReviewID": "RI5Z4635ELPG5", "Overall": "5.0", "Content": "Easy to use with no complications.  I haven't tried dropping the camera, nor have I attempted to submersed it.  It appears durable and more importantly it takes good pictures.", "Date": "July 9, 2013"}, {"Title": "Too Late to Return", "Author": "Lost In Louisiana", "ReviewID": "R17V7181P278SK", "Overall": "1.0", "Content": "I just recently had the opportunity to use this camera. I tried it out in the swimming pool and all seemed well. I took it snorkeling in the Caribbean and it took about 25 pictures then the camera froze. Now it turns on to a solid white screen and has zero functionality.I certainly didn't snorkel to 20ft! I was at the surface. Obviously it was closed properly or I wouldn't have been able to take the photos that I did. It malfunctioned after having been used and not re-opened during the same photo session. The few pictures it took were great, if that matters. I would rate it higher had I been able to get a replacement. That was some expensive photos!", "Date": "December 9, 2013"}, {"Title": "Didn't last long...", "Author": "Marly", "ReviewID": "R8GZ2X2DMJ2JG", "Overall": "2.0", "Content": "Love Panasonic lumix cameras so my husband got me a rugged underwater one for Christmas.  Great pics and videos...but it only lasted for two trips.  I took great pains and followed the instructions for rinsing and being careful after using in water but now I have a permanent \" reinsert sd card\" on the screen.....it will cost me more to have it repaired than to try another type.  Looked online and this camera seems to have a problem with this....so disappointed but will try another brand", "Date": "August 5, 2013"}, {"Title": "Caribbean camera", "Author": "walls5145", "ReviewID": "R3G7ZF4TJPIVQG", "Overall": "5.0", "Content": "Bought this camera to use snorkeling and tubing in the Caribbean. Had it in the water for hours doing both and it worked perfectly.Be sure to read the instructions well and make sure no dirt or other items get in the seal on the battery and sd card door. I also bought a flotation wrist strap so that when I couldn't be holding the camera I didn't have to worry about dropping it and sinking to the bottom.If it did come off your wrist it would be floating on top of the water.", "Date": "February 10, 2014"}, {"Title": "Terrible \"waterproof\" camera", "Author": "MM", "ReviewID": "R3TK3EY9UWEFP0", "Overall": "1.0", "Content": "This is the worst camera we have owned. The second time we used it the seal broke and water leaked in. Panasonic is no help. Don't waste your money. We have owned the olympus waterproof and it was great I regret not spending the money to replace that one with another olympus. Will never buy a panasonic camera again.", "Date": "January 12, 2014"}, {"Title": "Not waterproof", "Author": "Amazon Customer", "ReviewID": "R3ES4S9OZTUXJB", "Overall": "1.0", "Content": "My family took this camera on our recent trip to the Florida and Bahamas. While in Florida we were very pleased with the picture quality and the ease of use...point and shoot. We couldn't wait to use it when we went snorkeling. That's where it all went down hill. The first time in the water it failed miserably. itr shut off and never came back on. Not only did we lose all of the pictures from out snorkeling trip but everything that was on the memory card before that. Not worth the money if your looking for a waterproof camera don't bother.", "Date": "January 6, 2014"}, {"Title": "Definitely not a waterproof camera!", "Author": "amazononly", "ReviewID": "RY4ZXUBWCJFCT", "Overall": "1.0", "Content": "I followed all instructions on using the product underwater. On the first day of my vacation I took the camera into a 5 foot pool. After taking a few pictures, I sent it out to dry. The next day I opened the camera and found water inside the battery compartment,  then my camera wouldn't turn on properly and my sd card had a read error on another camera. This camera cannot be called waterproof if it is that sensative to being inside water for 10 minutes. I should've shelled out a little more money and bought an actual waterproof camera.", "Date": "December 30, 2013"}, {"Title": "Not worth the money", "Author": "Janet Elkins", "ReviewID": "RJKY11LNKX6HD", "Overall": "1.0", "Content": "The very first time I took it in water it got water in it and it was not worth the money I spent on it.", "Date": "December 12, 2013"}, {"Title": "Excellent Camera for backpacking", "Author": "David Haggist", "ReviewID": "R3N7YYC04IXL6E", "Overall": "5.0", "Content": "After a recent thru hike in Vermont where it rain constantly and I found myself having to return my camera to a dry sack, its going to be nice to be able to keep my camera close at hand despite the weather.  The camera is easy to operate and the picture quality is very good.", "Date": "October 25, 2013"}, {"Title": "Works as Kalashnikov", "Author": "George", "ReviewID": "R2NWPAC4MTSX78", "Overall": "5.0", "Content": "Works as Kalashnikov . Good camera for work at sites. Quality of pictures not so brilliant, but for work ok.", "Date": "October 19, 2013"}, {"Title": "Like!!", "Author": "D Lindsay", "ReviewID": "R19HHCRECZ2JOF", "Overall": "4.0", "Content": "The only thing I don't like about this camera is it hesitates to take an underwater picture. You push the button and there is a hesitation before it actually takes the picture.  Other than that, works great!", "Date": "August 23, 2013"}, {"Title": "horrible product", "Author": "Yoko St Peter", "ReviewID": "R1YSDCZNYD2J5M", "Overall": "1.0", "Content": "I ordered this camera for my Hawaii trip with expedited shipping.  It supposed to be waterproof up to 24 fts, but as soon as we took it to beach and started to take pictures, lenses and flash filled up with water, LCD screen wasn't even displaying anything, it was horrible.  It definitely ruined my vacation pictures.  I do not recommend this product.", "Date": "August 15, 2013"}, {"Title": "Worked well no leaks", "Author": "Dylane", "ReviewID": "R1XY1X0AXYS4EQ", "Overall": "4.0", "Content": "The Ocean pics look a little cloudy but then again it was the ocean.  We didn't have any issues we water leakage.  We followed the directions to soak in freshwater after each  ocean use.  The lens fogged once but after airing it out for an hour or so it was back to clear.", "Date": "August 6, 2013"}, {"Title": "Wish It Had A Viewfinder", "Author": "Frederick L. Ashworth", "ReviewID": "R227Q9QXX6AR5S", "Overall": "4.0", "Content": "This is a great little camera.  i would give it 5 stars in a second, but still wish it had a viewfinder.  In the broad sunlight it, as with all the point and shoot digitals, the screen is virtually impossible to see.  Somebody should come up with some sort of cover for the screen that would filter out the bright light.  Now that would be worth having.  I especially like the panorama feature in this camera.  I'm no longer afraid to take a camera out in the kayak.", "Date": "August 2, 2013"}, {"Title": "Great camera!", "Author": "Kathie Spanos", "ReviewID": "R361VECEEJBLK0", "Overall": "5.0", "Content": "We bought this camera to use on beach vacations and it was perfect. We took it in the pool, and to the beach and used it for scenic shots. It took great pictures, the colors looked accurate and it was easy to use. We didn't have any issues with the lens fogging up or sand or water getting inside the camera. When we got home we watched the images on the TV and they looked very crisp. The camera is very small and lightweight and had good battery life.", "Date": "June 9, 2013"}, {"Title": "Panasonic NOT worth the TROUBLE!", "Author": "suzannell", "ReviewID": "R29CJLVO7HZRJZ", "Overall": "1.0", "Content": "I ordered a camera from them and it quickly had a system error and would not function. They sent a refurbished one, same error, and a another refurb, same error. Basically just sent junk refurbished items until it was out of warranty. Happened again when it was out of warranty by a couple of weeks and then said too bad despite the fact we'd only had the replacement for about two months. Horrible product, even worse customer service!", "Date": "December 11, 2013"}, {"Title": "Leaked second time!", "Author": "Frank Albanese", "ReviewID": "REJG1XXV8F2LS", "Overall": "1.0", "Content": "I got this for our trip to Bermuda. It worked great at a water park where it got splashed. Unfortunately in Bermuda where it got submerged in 4 feet of water it leaked and stopped working. So if you looking for a $150 single use camera then this is the one.The few pictures its took were ok but nothing to write home about. You get what you pay for.", "Date": "August 28, 2013"}, {"Title": "Takes nice pictures", "Author": "David F. Tapia", "ReviewID": "R1KL109ZUHGD5R", "Overall": "3.0", "Content": "Works well underwater, It froze on me a couple times and i had to open up the battery cover to pull the batter to get it to work again. Very frustrating when you're in the water,,,,, Other than that. the pictures are nice underwater and on land.", "Date": "July 4, 2013"}, {"Title": "0 STARS!!", "Author": "LG", "ReviewID": "R1YOIE777HSTAZ", "Overall": "1.0", "Content": "I normally never write product ratings but I felt compelled to write this one to warn future buyers of this camera.I was looking for a compact camera that could take some of the pictures where my iphone 5 falls short: night pictures with flash.Since I was already in the market for a compact camera I thought I may as well go for one I can take with me anywhere: the beach, pool, snowboarding, etc without having to worry about water damage.I went for this camera because normally Panasonic cameras take very good pictures since they use Leica lenses which I consider some of the best lens manufactures out there. Since this one had a Leica lens I imagined picture quality would be good, but I was completely wrong.Pictures without flash were dull and pictures with flash were ultra bright and some of them came out blurry even though they were still pictures. In addition, the water damage warning continuously pops up (ALL the time!) even though the battery cap is securely closed and locked. Finally, the monitor is super grainy and VERY slow to respond, so when you move the camera from one side to another you get a blurry and choppy image until you stop moving the camera. Totally useless in my opinion...I hope Panasonic made a better job with the TS5. I would expect that to be the case since it costs nearly twice as much as this one.0 stars for this camera if this option was possible...", "Date": "April 15, 2013"}, {"Title": "Read the isntructions!", "Author": "A. Customer", "ReviewID": "RM9GGT3WG7RXO", "Overall": "4.0", "Content": "The camera started out with great pictures - or at least as great as the photographer.  Then we took a spill in the kayak and it go submerged.  Now, really, the lens was not wiped after that so I cannot blame the fact that there are water spots on the pictures on the camera!  The camera is very easy to handle and during that dip the memory card was not at all affected.  This is so much like my easy Kodak - just wish I would have thought to wipe the lense after the dip!  The only reason I didn't give it a 5 is because the buttons are so close together and the waters we were on were not the least bit calm so you couldn't really look at where you were putting your finger and it was easy to inadvertently hit the video or the off button instead of the picture taking button.  Love the color of this camera too!", "Date": "May 31, 2014"}, {"Title": "Great little camera", "Author": "Leon Photo", "ReviewID": "R2KHS4ZV4DD297", "Overall": "4.0", "Content": "Great litle camera..  Like the Panorama feature plus can drop it in a pocketand though I will not take it swimming.. It issomewhat waterproof", "Date": "May 29, 2014"}, {"Title": "I'm not desappointed", "Author": "Mariane Coutinho", "ReviewID": "R1NQQI30F4QIM0", "Overall": "3.0", "Content": "Is a good camera, since you take a good care of. Good pictures, specially I the pool, at the ocean is a little bit blurry.", "Date": "May 24, 2014"}, {"Title": "Least favorite small camera", "Author": "Happy Guy", "ReviewID": "R1GJ87JPDUO2AX", "Overall": "1.0", "Content": "We haven't even tried it underwater, but that's the only place we'll be using it in the future.  The pictures didn't meet our (admittedly high) standards.  Any Canon or Sony point and shoot will kick out far superior photos.", "Date": "May 19, 2014"}, {"Title": "Just started using", "Author": "M. Resende", "ReviewID": "R1JBBJ4M6MSZWG", "Overall": "3.0", "Content": "I had a TS20 that lasted no more than one year. Decided to buy the new model. It's a cheap underwater camera that fit its purpose.", "Date": "May 5, 2014"}, {"Title": "A little underwhelmed", "Author": "Neil Pinnick", "ReviewID": "R1C3W2XD76H52E", "Overall": "2.0", "Content": "Not quite what I expected.  The controls are not as good as some other models.  Wish I could return it.", "Date": "March 23, 2014"}, {"Title": "Poor Picture Quality", "Author": "Swan", "ReviewID": "R25BVRZLI306QE", "Overall": "3.0", "Content": "I know it's not suppose to be great, but the pics it took on a trip to Colombia were of pretty poor quality.  My cell phone or 4 year old Canon point and shoot killed this thing.  The picture modes were easy to switch in and out of and the camera worked well under water, but all-in-all I wouldn't purchase again.", "Date": "January 27, 2014"}, {"Title": "Its not HD but it works very well", "Author": "Laura", "ReviewID": "R2TZFXQY7WANW8", "Overall": "5.0", "Content": "The camera is not profesional and i never expected HD pictures, but its underwater function does work correctly. When i opened it i first tasted the camera without the battery or memory to see if water came through and it didnt; i tried it with the battery and memory later on a crystal water cup so i could see myself on the other side and the video seemed to be alright. I love the color of the camera, i'm in love with it and i cant wait to try it at the beach or pool �.", "Date": "January 3, 2014"}, {"Title": "Surprisingly Tough", "Author": "Andrew", "ReviewID": "R2OUWS2B8SW7EJ", "Overall": "5.0", "Content": "I first became aware of this camera in my job as a cell tower climber. We normally use a camera to document our work, but the normal camera we use had been forgotten. A coworker happened to have one of these with him and, volunteered it instead. I immediately managed to drop it 260 feet onto a steel Verizon cabinet, where it bounced off into the gravel. It was, of course, broken, but just barely. The screen still worked, the lens and ccd still worked, and the only apparent problem was with saving to the memory card. I now have my own, and have taken it climbing, canyoneering, climbing, swimming, flying, etc. and haven't managed to destroy it yet. Recommended.", "Date": "December 4, 2013"}, {"Title": "Love it!", "Author": "J.Lee", "ReviewID": "R28Y3PN954CECE", "Overall": "5.0", "Content": "Great replacement to a previous version of the Lumix that I had. Although I have not dropped this one in the water yet, I expect this one to be just as waterproof and life proof as the previous one!", "Date": "November 20, 2013"}, {"Title": "Good little camera", "Author": "Chris", "ReviewID": "R3BBXXQSHN7EC0", "Overall": "4.0", "Content": "This camera is a decent low end camera.  It takes good pictures but the zoom is not the greatest.  The panoramic function is pretty good and the water proof capability is good.  Underwater pictures will take some practice to get good shots, but I think it is possible", "Date": "September 3, 2013"}, {"Title": "This is my second one!", "Author": "poppanam", "ReviewID": "R3U8XPXSLP98PF", "Overall": "5.0", "Content": "I had the previous model and the only issue I had with that one was that it wouldn't return on command. The old one's at the bottom of a river so I had to get this one. It works perfectly!", "Date": "August 31, 2013"}, {"Title": "Very good", "Author": "C. Lan", "ReviewID": "R3AK6TK4F683MA", "Overall": "4.0", "Content": "the package was well received and the quality is very good, and I was right on time for vacation, satisfaction.", "Date": "August 23, 2013"}, {"Title": "Just keeps rocking.", "Author": "GP The Engineer", "ReviewID": "R2KTP4M7VHSHBZ", "Overall": "4.0", "Content": "Bought as a gift for a friend who loves the outdoors. He's had it for a few months now and used it far more than even i expected.Pros:- The rugged exterior isn't just for show. Really is holding up well.- Simple point and shoot. Doesn't take 5 min to decide what settings to use in order to get some good shots.- Compact size. Especially when we're talking packing this with the rest of your gear...last thing you want is to have to carry a second bag for just your camera.Cons:- Photo quality. Maybe it's operator error, but overly bright shots seem to be quite normal.Summary:- I hope they keep developing and launching rugged products going forward. For the money, this was a great buy!", "Date": "August 16, 2013"}, {"Title": "LOVE IT!!", "Author": "Alicia", "ReviewID": "R75KCXAOE0LGR", "Overall": "5.0", "Content": "This camera is AMAZING!!  HIGHLY RECOMMEND to anyone looking for a durable camera with underwater capabilities!Pros:- The auto focus is great both in camera mode and video mode.- When zooming in on an object, the camera can blur out the background so that the primary focus of the picture is the object being zoomed in on- The creative controls allow pictures to be taken in a way that can normally only be done via a photo shop kind of program. (i.e. if taking a picture of a flower, there is a creative control that allows you to focus in on a specific color in the picture, such as the base color of the flower, while making the rest of the picture dull or black and white).- Underwater capabilities are great, pictures taken under water are of great quality- Burst mode enables action shots without missing a beat- An abundance of different \"modes\" allows you to take a great quality picture no matter what atmosphere you are in.Cons:- Cannot use the flash with burst mode making it hard to capture \"action shots\" if the lighting is not the greatest (i.e. taking pictures of your child riding a carnival ride)- Camera is not the easiest to use in terms of all of the different features, must learn all of the features in order to really capitilize on the camera functionality and quality.- I have found that in different scenes, I need to physically change the camera mode to the scene type because the \"auto\" option does not always accurately detect the \"scene\" (i.e. a picture taken at night will turn out alot better when the camera is in one of the \"night scenes\" as opposed to leaving the camera in \"auto mode\" and allowing it to self adjust)", "Date": "August 6, 2013"}, {"Title": "Underwater: Yay!", "Author": "L. Dooley \"Linda\"", "ReviewID": "R2OKA133MZLO0M", "Overall": "4.0", "Content": "came home from a beach trip where a friend had an underwater camera and immediately got this one: it's also great for bad weather or kayaking", "Date": "August 3, 2013"}, {"Title": "no much tough", "Author": "jhon cadena", "ReviewID": "REDG279YUEB7G", "Overall": "4.0", "Content": "i think than this is more tough, i preffer my olympus 14mpx, is better than this, more cuality in photo and equipment", "Date": "July 29, 2013"}, {"Title": "Lighweight, compact camera great for quick pictures and the quality was good for a point and shoot camera.", "Author": "Nicholas J.  Watsik", "ReviewID": "R2QWTIZV6U1U8E", "Overall": "5.0", "Content": "So far so good.  I bought this camera for my son to take on his Boy Scout backpack trip to the John Muir Trail in California. It has only been used once so far but it took great pictures.  I can not vouch for the waterproof capabilities yet because it was not used near the water.", "Date": "July 27, 2013"}, {"Title": "Great point and shoot waterproof camera!", "Author": "Margaret E Smith", "ReviewID": "R2EZTG14CDPYBZ", "Overall": "5.0", "Content": "I bought this camera since my husband and I travel a lot.  So far I have used it in the pool, at a water park, and during a power snorkel excursion during our cruise.  It has an underwater setting that I used while snorkeling.  I read in reviews that people's pictures underwater were dark, so I turned on the flash and it took great underwater pictures.  I also used it as our primary camera for our vacation, and I thought it took great point and shoot pictures and the battery lasted a long time.  I made sure I followed all of the cleaning procedures after we got back from the beach and had no problems. I would highly recommend this camera!", "Date": "July 22, 2013"}, {"Title": "ok for the price", "Author": "el", "ReviewID": "R3S8TGHX227E2", "Overall": "4.0", "Content": "the underwater pics came out good, a little gray-is maybe. i took other regular pictures at the beach and i didn't like the quality, in fact my iphone takes better pics than that.", "Date": "July 17, 2013"}, {"Title": "Not very good at low light", "Author": "Fevazro", "ReviewID": "R5UL4JUBZ05NK", "Overall": "2.0", "Content": "not very good quality pictures for the price. Is almost unusable in low light. Not happy with the video quality.", "Date": "July 13, 2013"}, {"Title": "Durable and Waterproof, But Photo Quality is Poor", "Author": "John", "ReviewID": "R1YQTWQF73TDXL", "Overall": "3.0", "Content": "We've been using this camera every few days for almost three months now.  Probably taken 1,000+ pictures.We have a Panasonic Lumix DMC‑ZS19 and love it.  So when this camera was on sale we decided to purchase it for two reasons.i) waterproof - we are at the beach a lotii) tough - have two small kids who like to pretend to use the camera.Pros-The camera is compact and tough.  We've had several small drops with it without any problems.-It is waterproof, and it is nice to take it into the water. Just be sure to buy a Float in case you get hit by a big wave and drop it!Cons-the camera shows damage quickly.  We've dropped all our cameras many times and this one scratches very easily (disappointing considering it is \"tough\" camera.-the picture quality is quite poor.  Our ZS19 camera is only 14MP and its pictures are way higher quality.  Even our old Sony T100 camera takes more vibrant photos (It's only 8MP).  This TS25 camera seems to struggle with the whiteness/brightness in pictures (parts of picture seem too bright) and when you scale 1:1 details (like leaves on trees) are blotchy (poor sharpness).  This doesn't happen on the ZS19 camera we have or our old Sony T100.  I even went so far as to contact Panasonic customer support and sent identical shot comparative pictures of this vs the ZS19 & T100.  After many emails/tests they said to send it back for repair.  Instead I got a replacement through Amazon and compared the two TS25 cameras and pictures from both cameras were the same!  Glad I didn't pay to return it to Panasonic.We are going to keep the camera.  It serves its purpose of being compact, durable and water poof.  If we want nice quality pictures though, we definitely do not use this camera.", "Date": "September 5, 2013"}, {"Title": "BEST CAMERA I'VE EVER HAD!!!", "Author": "Gloria", "ReviewID": "R11BOTIGZSPMP5", "Overall": "5.0", "Content": "This camera is amazing!!! It takes clear photos & video and has very good zoom and macro for what it is. The best part, in my opinion, is its ability to go underwater, and it takes amazing pics under there, too! It's tough and freezeproof, so it's perfect for snowmobiling and four-wheeling, has many useful settings, and helpful enhancements & effects. It also fits very well in my pocket :)All in all, it's a great camera for the low price, I'd definitely recommend it.", "Date": "June 12, 2013"}, {"Title": "Lousy underwater pics!! Gave it the lowest rating  I could.", "Author": "Donald Hunter", "ReviewID": "R1T78XE2GSVEDU", "Overall": "1.0", "Content": "Bought the Panasonic Lumix TS25 since the Amazon reviews were very high. Have had a regular Lumix for years, so I thought their underwater would be fine.  I was SO WRONG. All my underwater shots have poor sharpness and too much blue, no matter what setting I use: Autofocus, Sports, Underwater, Advanced Underwater -- they all gave me the same lousy pictures. I am so disappointed, since I am now in Roatan, Honduras with an underwater camera that takes lousy underwater pics. It's almost like the settings don't work, since all the pics are poor. Even the regular outdoors in good sunlight are not sharp.  I'm hoping Amazon will do something to help me recover from this, even though I've used the camera. I'm going for an Olympus with the next one. My daughter has one and it has taken GREAT pics here in Roatan.", "Date": "June 17, 2013"}, {"Title": "It is supposed to be a great camera", "Author": "Norka M. Diaz", "ReviewID": "R3LJGPBT26NMYZ", "Overall": "2.0", "Content": "I bought this camera in January, the first time I used it works perfect.  On April 19 I was going to used for second time and the battery was dead, I charged again and only let me take some pictures.  I charged again por more than 12 hours and the same, only let me take some pictures and the battery when off.  Very disappoint for the price.", "Date": "April 20, 2014"}, {"Title": "OLD CARACTERISTICS", "Author": "MIGUEL PLAZA", "ReviewID": "RPSIOGZCIY01L", "Overall": "2.0", "Content": "this is a camera with a bad ressolution, its screen show a poor image on the other hand it looks very nice and resistent, you can sink it in the wáter, but it doesnt have good functios", "Date": "February 25, 2014"}, {"Title": "Wonderful", "Author": "T", "ReviewID": "R2L9TUD373XFG9", "Overall": "3.0", "Content": "Used this for the first time this weekend. Still pictures are great. Underwater pics.....1) if there is not enough light the pictures are kinda dark. 2) if there is plenty of light the pictures are wonderful. 3) Video is wonderful underwater also. 4)easy to operate for pictures and video. The underwater message is annoying but can be shut off.", "Date": "May 21, 2013"}, {"Title": "So far nice camera", "Author": "CFoxtrot", "ReviewID": "RSIDKUN3ABDWK", "Overall": "4.0", "Content": "I did not rate this a 5 star because I have not had it in the water yet. Camera takes good all around images,capable of satisfactory low light(with flash) photos with low noise, far better than the Pentax I purchased first and returned.Controls are easy to use, however the buttons are a bit hard to read.Dedicated movie button comes in handy when going from taking photosto recording movies.", "Date": "May 31, 2013"}, {"Title": "Felt like a toy returning.", "Author": "Asylums Dawn", "ReviewID": "ROKZLE1FQ0YTM", "Overall": "1.0", "Content": "I may be spoiled because the previous waterproof camera I had was slim and had a touch screen. When I started using this one it is bulky & feels like a cheap toy camera. THe buttons are too stiff & the picture quality was horrid for being 16mp. I took a couple of pictures & went right back to using my cellphone with a cracked screen.", "Date": "January 2, 2014"}, {"Title": "Panasonic Lumix DMC-TS25 16.1 MP Tough Digital Camera with 8x Intelligent Zoom (Blue) (Electronics)", "Author": "Shorian \"gadget guru\"", "ReviewID": "RIHV2FDCQ1AM3", "Overall": "4.0", "Content": "I likely won't be taking any underwater shots with this camera but it is nice to know I can. I like that the camera can take some abuse without damage. I have taken some stills in very low light conditions, and the results were better than I expected. I like being able to switch to video with one button. That is a great feature. I haven't tried the panoramic view and time lapse photography yet, but I intend to as soon as my SD card arrives.I have just a couple of cons: The buttons are tiny and a little difficult for me to use. I would like to see a larger on/off button. I have an older model Panasonic DMC-FP1 and to turn it on all I have to do is slide down the lens cover. I understand that this feature would be hard to implement on a waterproof camera.Also, my first few pictures showed my finger covering part of the lens. I find holding the camera so as not to get my finger in the picture, somewhat awkward.Overall, I am satisfied with the camera.", "Date": "June 5, 2013"}, {"Title": "great little point and shoot", "Author": "Kyla", "ReviewID": "RO155OZF6S0YW", "Overall": "4.0", "Content": "I purchased this camera because i wanted a walk around point and shoot that i could keep with me at all times and I wanted something I could use for underwater images. I normally shoot with my canon 7d but try to leave that as my pro camera, and my t3i when I want something more than a point and shoot but I love having this thing when I am out with friends. I am going to Mexico in March and will see how it does under water at that point. I'm pretty happy with this camera at this point. It has been sharp, so simple to use, and it is slim enough that I can carry it with me every where I go. I don't have to worry about my nieces and nephews snagging it to snap some shots because it is durable. I have a canon g9 as well and love this one 100 times more than that point and shoot. Anyway, if you are looking for something simple, easy to use, but with different features you can play with, I'd definitely suggest this one. We'll see how it does under water!", "Date": "April 12, 2013"}, {"Title": "good", "Author": "diego andres ramirez", "ReviewID": "R3G5LV21LT0035", "Overall": "5.0", "Content": "I arrived at lowest I weather conditions recom endaria all my family and friends just as I think of ordering another camera", "Date": "April 27, 2014"}, {"Title": "Good value", "Author": "Michael D Meints \"Mike\"", "ReviewID": "R24JXFDYS8DBYP", "Overall": "4.0", "Content": "Would be best if it had a floating hand strap.  Still a great value for the money.  Would recommend for use.  We use it on our PWC and do not fear it getting wet.  Also have used it for outdoor sports in the rain.", "Date": "May 30, 2013"}, {"Title": "lightweight and good pictures", "Author": "Vestal Mike", "ReviewID": "R14TW0GQD982UY", "Overall": "4.0", "Content": "This camera seems very durable and takes good pictures.  I haven't tried it underwater as of yet, but it has done well banging around in my pocket while hiking.  My only complaint with the camera is more my fault: given the small size it is very easy to have one's fingers partially cover the lens, resulting in pictures of fingers rather than the target.", "Date": "March 31, 2013"}, {"Title": "Awesome!", "Author": "C. Gottstine", "ReviewID": "RFKPYT4NPC1ZN", "Overall": "5.0", "Content": "Hard to believe this is waterproof - very good quality camera with many features.  Can't wait to take it to the South Pacific and give it a try!", "Date": "March 7, 2013"}, {"Title": "Great pictures", "Author": "Momshan", "ReviewID": "R10VI5P4JWOHUO", "Overall": "4.0", "Content": "I really liked this camera.  The shutter speed was a little slow, but it really took great pictures.  Mine ended up on the bottom of the ocean floor while we were sailing, so I never developed any prints to see that quality.", "Date": "March 10, 2013"}, {"Title": "It does not look so good as I expected...", "Author": "Mila S.", "ReviewID": "RSV02KO8MDO17", "Overall": "1.0", "Content": "It does not look as I thought, cannot use yet because I do not have a charger for battaries... I cannot recommend it", "Date": "October 24, 2013"}, {"Title": "Good Item", "Author": "Sandra Morales", "ReviewID": "R2L3I3LC12Z1NQ", "Overall": "4.0", "Content": "It is a very good item, but I don't know it is useful to use in water enviroments and if there is warranty if there will be failures by waterproof.", "Date": "March 3, 2013"}], "ProductInfo": {"Price": "$179.99", "Features": "16.1 Mega Pixel, 4x optical zoom, 8x Intelligent Zoom, Mega O.I.S., Rugged Design, water-proof to 23 feet, shock-proof from 5 feet, freeze-proof to 14 degrees F, dust-proof\n2.7\" LCD Screen, Intelligent Auto Mode, Venus Engine, 12 Effective Create Control\n720p Motion JPEG Video, Sonic Speed Auto Focus, Creative Panorama Shot, 12 Effective Creative Control", "Name": "Panasonic Lumix DMC-TS25 16.1 MP Tough Digital Camera with 8x Intelligent Zoom (Red)", "ImgURL": "http://ecx.images-amazon.com/images/I/41c%2BVX4uKzL._SX300_.jpg", "ProductID": "B00ATE7U64"}}