{"Reviews": [{"Title": "Great camera and zoom lens! Okay package...", "Author": "_MiMorales_", "ReviewID": "R2M844WHU8S82Q", "Overall": "4.0", "Content": "The camera and extra lens in the package is great. The accessories included in the package are so-so. The extra battery is not a Sony original, some things are similar (lens cleaning, cleaning kit, cleaning cloths), the wrist strap's base had the tripod mount pad peeling due to low quality adhesive, and the card reader seems cheap. Overall though, the accessories are basically \"free\" considering the price of the camera, lens, remote control, memory card, and case (all original sony).", "Date": "September 21, 2013"}, {"Title": "Good Package, good camera, great price!", "Author": "Todd", "ReviewID": "R1ZP9XZ1NNFPES", "Overall": "4.0", "Content": "Could of used an external battery charger and a better zoom lens, but still this deal was a steal. Shipping was super fast, all came out in a perfect condition and lots of accessories which complemented the camera. It was a great buy, definitely recommend it.", "Date": "January 13, 2014"}, {"Title": "This is the perfect camera for me", "Author": "shavit kraus", "ReviewID": "R25Y46FV52LC23", "Overall": "5.0", "Content": "1. Lightweight to this group of cameras.2. Can automatically take pictures and pictures and Video.3. Even my wife was able to operate it.4. Possible to photograph photos even in hard conditions.5. get to functions is easy but requires study and experience.On the other hand!It has a lot of functions not clear to me as an amateur what they intended.The camera does not simple to operate.General Reviews: camera that looks great, comfortable to hold, and takes great photos even under difficult conditions.", "Date": "December 23, 2013"}, {"Title": "Must buy", "Author": "SRIKANTH KONERU", "ReviewID": "R2GUDZGCK9PL5R", "Overall": "5.0", "Content": "Excellent buy. Highly recommended. Compact camera with SLR grade pictures. Best buy for the money spent for the package received.", "Date": "December 16, 2013"}, {"Title": "Great Value", "Author": "Mrs. Magpie", "ReviewID": "RTSI7SKY24RY9", "Overall": "5.0", "Content": "This package is a great value. For not much more than others are selling the camera and lens for, you get a 32 Gb memory card (you're going to need it!), a spare battery (definitely going to need it), a real Sony remote and a real Sony carrying bag. There's also a UV filter for each lens and other stuff that you might find more useful than I do but the bottom line is that for those few extra dollars you couldn't buy the memory card.I figured I was taking a chance and there'd be something missing or the warranty would be non-US but I've got everything in hand and it's all good.", "Date": "November 21, 2013"}, {"Title": "Camera is good... Accessories not so much", "Author": "zachary mcgurk", "ReviewID": "RNOR4ATCRGQEZ", "Overall": "1.0", "Content": "Once (if) the send me a back up battery that fits the camera (the one they sent is too big) I will edit and increase the rating on my review.Other than that, the camera is awesome but not worth the extra money if included accessories don't work and/or are the wrong size.", "Date": "January 31, 2014"}, {"Title": "AWESOME CAMERA", "Author": "Eric Merideth", "ReviewID": "R2LICVX1HKWMP7", "Overall": "5.0", "Content": "Exactly as described, it really is a phenomenal camera.  And at this price is the best deal around.  My wife couldn't be happier.", "Date": "January 12, 2014"}, {"Title": "Great camera, Great bundle!", "Author": "Kwesi", "ReviewID": "R3IN9NVLGA83RN", "Overall": "5.0", "Content": "I am very happy with the camera. It focuses very fast and takes great pictures. I also like the bundle of accessories that came with it. There are a lot of good quality cleaning products and OEM Sony items, very useful. The bundle was well put together and the Focus Camera store's customer support was great.", "Date": "January 7, 2014"}, {"Title": "what, no charger?", "Author": "L. Hurley", "ReviewID": "R2GR06UUI5ZWQM", "Overall": "4.0", "Content": "Re the Focus bundle:  The good is that many of the parts are real Sony, including the SD card.  I've heard that other brands can be problematic.  Just got the camera and my only nit is that there is no charger for the 2nd battery.  Pretty hard to keep a spare ready to go without one.I also think Sony could do much better on the instruction side.  There is a lot in this little package and the user manual is pretty limited.  Nikon does a much better job but in the end we decided we didn't want to lug around a full-size DSLR.", "Date": "November 11, 2013"}, {"Title": "Love my Camra", "Author": "tr1pp1n", "ReviewID": "R1NT6H61AJU8BV", "Overall": "5.0", "Content": "When took a Mediterranean trip and wanted a good camera for amazing pictures. This camera did not fail, I was able to take some amazing pictures without the flash. The strap was kind of heavy after a long day.", "Date": "September 22, 2013"}, {"Title": "New camera", "Author": "Robert Eicher", "ReviewID": "R1TWFYMZTJ14YD", "Overall": "5.0", "Content": "Still learning this camera.  Have been experimenting with the basic controls.  It is easy to let the camera control the setting like a point and shoot camera.", "Date": "September 12, 2013"}, {"Title": "Good value", "Author": "surfcity", "ReviewID": "RCHMO5KQGJ212", "Overall": "5.0", "Content": "Includes original Sony card, battery, remote and case as extras for price of camera and lens alone elsewhere.Seller could have used a larger box with cushioning instead of cramming items unprotected into a small box - cameras and lenses can suffer from shock and vibration in shipping without protection, but all seems OK so far.", "Date": "July 22, 2013"}, {"Title": "The best set", "Author": "DmitryS", "ReviewID": "R28I69XRATMNGL", "Overall": "5.0", "Content": "This is the best set for Sony Nex-6. I'm happy with all the items. Standart thin lens is very good, I didn't expect:)  Thanks a lot!", "Date": "July 8, 2013"}, {"Title": "Great Produck and Amazing service", "Author": "Cem", "ReviewID": "R13DFQZLFZUJ17", "Overall": "5.0", "Content": "There are several similar bundles being sold here on Amazon. I will not review the Camera, there is an extensive review in the internet. But the items in the bundle are great.I have bought from Focus Camera mainly because the remote control and the SD card are from Sony. Also, there is a use for every item that comes with it. There are extra cleaning cloths, but if you are a cleaning freak like me, it is not many. Other bundles have some items that I wouldn't use ever. Also this was cheaper by a very small amount than other.Customer service made this an excellent deal. The shipping was very timely and it was (to my shock) through UPS. So it was very fast. Packaging was safe and unpacking was a lot of fun. However, the SD card was not responding. I tried it with other cameras and computer. But when I have sent them an e-mail about it, they said they would sent me a replacement right away.I would definitely recommend this seller.", "Date": "June 4, 2013"}, {"Title": "Good Overall", "Author": "Tan Cory \"MAT\"", "ReviewID": "R2OAHPTE0MA0UU", "Overall": "4.0", "Content": "Camera is good. All accessories are useless. Additional lense is not so good. Good pictures. Get rid of all accessories and include good quality tripod please", "Date": "November 18, 2013"}], "ProductInfo": {"Price": "$1,403.00", "Features": "Sony NEX-6 16.1MP Compact Interchangeable Lens w/ 3\" LED Screen Digital Camera in Black w/ 16-50mm Power Zoom Lens\nSony 55-210MM Nex System Zoom Lens - Sony Class 10 32GB SD Memory Card\nSony Camera Case - Universal Video Camera Screen Protector - Camera Remote Control\nLithium Battery - All in One High Speed Card Reader - 49mm UV Protector\nLens Pen w/ Microfiber Cleaning Cloth - 5 Piece Deluxe Cleaning & Care Kit - Micro Fiber Cleaning Cloth - Professional Wrist Grip Strap - 40.5mm UV Protector", "Name": "Sony NEX-6 16.1MP Compact Interchangeable Lens w/ 3\" LED Screen Digital Camera in Black w/ 16-50mm Power Zoom Lens & 55-210MM Nex System Zoom Lens + 32GB Accessory Kit", "ImgURL": "http://ecx.images-amazon.com/images/I/51q-lNx4yQL._SY300_.jpg", "ProductID": "B00AQ4BG8K"}}