{"Reviews": [{"Title": "Big black rods", "Author": "Alex", "ReviewID": "R3E6XZ3I96SS2J", "Overall": "4.0", "Content": "They're big, black, and 15mm rods. Perfect for the  back end of a shoulder system, or really long lenses that need a follow focus and matte box. Only downside is that they're glossy, and dont allow accessories to slide quite as easily as matte rods.", "Date": "February 24, 2014"}, {"Title": "Excellent quality, well built", "Author": "Stuckshutter", "ReviewID": "RRZR7P692GKTN", "Overall": "5.0", "Content": "What else would you want in a rod? Clean build, sturdy, threaded internally on both ends. And, I need four more words so this will publish.", "Date": "October 8, 2013"}, {"Title": "Pictures of system misleading", "Author": "Scifisteve55", "ReviewID": "R2PQYWVSLFZY1G", "Overall": "1.0", "Content": "Shows a cheap tripod mount with two short rails. It is not plainly obvious that this does not come with it, and the price for two short rails alone are way too expensive--so it is misleading to say the least. It should have shown only the two rails--but at the price they are asking--no one would buy them--I have purchased longer identical rails for less than half the price of these--absolutely no difference!! The cost of returning for a refund is too expensive to justify--so you basically get robbed! This is my second bad experience in the last two months--I have purchased a lot of items over that period--but, it is the misleading advertising and the poor communication skills of some of the Chinese companies that is truly disappointing!!!  Watch out for this! Make certain what they describe is what they are actually selling---Confirm any necessary alterations to the seller and double check it- and then be careful. Hint--long delivery times is a bad sign. No customer reviews--forget it!!!", "Date": "February 19, 2014"}, {"Title": "Excellent quality, solid built", "Author": "AVU", "ReviewID": "R2TT6L2AX9GXQG", "Overall": "5.0", "Content": "This product is high quality with low price. It surprises me, I thought is a acceptable product, but it can compare to product of zacuto.", "Date": "February 14, 2014"}, {"Title": "Good rods. A bit short.", "Author": "Franklin Rymon", "ReviewID": "R2TNLH3B1814QX", "Overall": "4.0", "Content": "As rods go, these are fine. They are a bit short. I took a notion to measure them and they come up at 17 3/4\". The 4\" rods I got from SmallRig are also a 16th off. Having worked, albeit, ever-so-briefly, with machining, where things are frequently accurate down to thousandths of an inch, this strikes me as... really odd. That said, the rods are, otherwise, of excellent quality, and suit me fine in spite of their odd measurements. I will add, each pair of rods I've received are of a consistent length. I'll buy more. but a little wary of their slightly short lengths if such becomes critical.", "Date": "February 4, 2014"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B00AZFZ40G"}}