{"Reviews": [{"Title": "Very disappointing, even given the price", "Author": "Rob", "ReviewID": "ROCWS83SVRFCK", "Overall": "1.0", "Content": "If you are interested in a low-cost, versatile sports camera to record video, look elsewhere.As an avid cyclist, I thought it would be great to film some of my bike rides.  However, I had no plan of spending big bucks on a GoPro or something similar.At a first glance, the specs on this Vivitar camera seemed more than adequate.  Not the greatest resolution and/or frame rate, but I'm not looking to make professional quality recordings. It comes with a waterproof case and versatile mounting hardware. It will take up to a 32GB SD card, which can hold a considerable amount of video footage.  But it's what they don't tell you in the specs or manual that make this camera a big disappointment.When you record video with the camera, it creates a new file every 5 minutes (?!?) rather than creating one continuous file for all your footage.  The quality of the video footage meets my expectations, although it does not work well in low light.  It'd definitely a 'daylight only' camera.  Yet, the most disappointing thing about capturing video on this camera is the battery life.  While recording video, the LCD display remains on the entire time.  It never turns off or enters any kind of 'sleep' mode to save battery power.  Bottom line.....you get a whopping 30 minutes of footage before the camera shuts down (Mfr. specs say nothing about expected battery life when recording video).  It's hardly worth putting a 32GB SD card in a camera like this when the battery will be long dead before you even populate a few Gigs.So once again, don't buy this camera as a low-cost alternative to any of the name brand sports cameras.  Read the specs carefully on any similarly priced product, and if anything is too vague or conveniently missing, try contacting the manufacturer or just skip that produce altogether.", "Date": "May 16, 2013"}, {"Title": "Solid performance and 70 minutes of recording time", "Author": "Steve Nazigian \"steve0701\"", "ReviewID": "RSSMXOBQ2ISNG", "Overall": "4.0", "Content": "The first thing you notice is that this camera is a whole lot smaller than you thought it was going to be. Without the waterproof case it measures a diminutive 2.75 inches wide, and the 2 inch viewing screen covers almost the entire back of the camera.The camera ships without a memory card, so when you buy one I highly recommend at least a Class 10 Micro SD card. Any HD video camera deserves it.  A slower card may not record HD video quick enough to prevent problems such as having your recording stop before you're ready or, worst of all, a slow card might result in data corruption and a camera lock-up. This could be the source of some bad reviews that mention the camera freezing up. Also, you ought to respect the Busy light and do not ask the camera to do anything else while it's saving a file. Just to be safe, there is a tiny reset button on the bottom of the camera. Hope you never have to use it, but it's a better choice than waiting for the battery to expire. So far, I've recorded about 90 minutes of video and plenty of still pictures without a glitch.Focus range is 120 cm (5 inches) to infinity, but in a pinch you can go in a whole lot closer, up to a half inch with useful results. The 4x zoom is digital, so it will always reduce detail if you use it. Get closer if you can, but if not, you can always crop the pictures when you get home. As for video, as soon as you zoom in you are no longer using 720 HD.  My advice: Unless you have a compelling reason, I'd say to keep the camera set at highest resolution for both stills and video, and skip the zoom. For video you actually have two good choices: 720p HD at 30 frames per second, or in case you need to see sharper motion, there is also VGA at 60 fps. Files are saved in AVI format, and either setting will look and sound very good on YouTube and Facebook.The DVR850HD includes a bike mount with extra spacers, a strap-on helmet mount, a separate tripod mount and, of course, a waterproof enclosure which has its own a tripod mount.  Some reviewers have griped about the helmet mount having a strap rather than glue, but I rather like being able to move the camera to a different helmet.  Perhaps the most interesting feature is hidden behind the name Vehicle Mounted Mode. No, this is not an anti-shake feature; it's a honest-to-goodness dash-cam! In this mode it will continuously record forever until the battery runs out. Every five minutes the camera automatically saves, so you don't get enormous files.  And, if the card fills up, the camera is smart enough to erase the oldest file first. So, for the reviewer who complained that the camera only records 5 minutes at a time: Take it off Vehicle Mounted Mode! I recently shot over 70 minutes of HD dash cam video on a single charge, and when the power got low the camera saved the final file and shut down in an orderly fashion. How big are the HD files? Seventy minutes consumed about 10GB. To save battery power, the camera powers itself off after 5 minutes of standby. If you are in dash cam mode the view screen turns off after a few minutes of recording and a red LED continues to let you know you the camera is still on. Despite the small size, Vivitar even found room to squeeze a teensy playback speaker into the package.My one disappointment is that this camera cannot shoot while on a charger. When it recognizes a plug in the USB port it assumes you are connected to a computer, and your only two choices will be to offload the pictures or start using the Vivitar as a web cam. That's a real disappointment because it would have been ideal to leave this camera plugged in as a dash cam and never worry about recharging it.What are the pictures like? Not bad. The center-weight exposure metering gets the job done and, thanks to a coated lens, the pictures show very good color and contrast. Don't expect vivid colors underwater, though. There are technical reasons why everything turns bluish, and your favorite TV shows spend thousands of dollars to make undersea colors look more natural.The package also includes the \"Vivitar Experience Image Manager\" on a mini CD. At 18 MB it looked innocent enough, but after it launched a download from the Vivitar site, the final program installation exceeded 120MB. It turns out that the Vivitar experience includes an expanded product manual, (in the language of your choice), plus a picture browser/manager program that finds all the pictures and videos on your PC. It also includes icons for uploading to your favorite social sites, and it lets you order T-shirts and mugs or create a plain vanilla slide show or custom picture frames.One word of caution: Treat the buttons with respect. You don't want to smash them like one unfortunate reviewer did. Just press slowly until the camera responds, especially if you are operating the camera through the waterproof housing.I am giving this camera a high rating, not because it outperforms much more expensive cameras, but because it is an exceptional value in its price range. Store the camera in its waterproof box for protection and to keep the screen pristine.", "Date": "August 5, 2013"}], "ProductInfo": {"Price": "$109.99", "Features": "Vivitar DVR785 Mini Sports DVR w/ 2\" Touch Screen Digital Camera Blue\n4GB MicroSD HC Memory Card\nWaterproof Flashlight Torch Underwater Rated Up to 100 ft.\nFloating Foam Strap Blue", "Name": "Vivitar DVR785HD Sports Action Waterproof Touchscreen Camera + 4GB Accessory Kit", "ImgURL": "http://ecx.images-amazon.com/images/I/41phswBl6DL._SY300_.jpg", "ProductID": "B00AAGV68Y"}}