{"Reviews": [{"Title": "Powershot N", "Author": "tonymeans", "ReviewID": "R3NLOPSBBHBIPR", "Overall": "5.0", "Content": "So on a lark I bought the Canon Powershot N . It is a nifty piece of technology but a great photographic tool. Its small size and ease of use makes it a perfect pocket camera that you will actually carry in your pocket and take out and use!!. I am a professional photographer in New York and have bought several pocket cameras over the years in the hopes that I will carry and use the thing..Finally  I have found that camera. I have not been happier with a pocket camera and use it more often than I thought I would. I have to say the semi articulating screen is a definite plus allowing you to shoot from the hip or even lower. And the any way up allows you to shoot above your head and still view the screen. I would recommend this to any other photographer and even plan to buy a couple more as christmas gifts to family and friends.Canon PowerShot N 12.1 MP CMOS Digital Camera with 8x Optical Zoom and 28mm Wide-Angle Lens (Black)", "Date": "May 5, 2013"}, {"Title": "A Brilliant Concept Flawed by Networking", "Author": "Rick Grant", "ReviewID": "R3LSGDL4J0JUFM", "Overall": "4.0", "Content": "I have been a Pro and Semi-Pro photographer for many years. Partly because of that experience, and partly because of the staggering advances we have seen in digital DSLR cameras, I was feeling that I had fossilized in my picture taking creativity.Although I have repented since, I was an early and loud fulminator against the whole idea of camera phones.  I also wrote off Instragram and others like it as abominations.Every day for about the last five years I have carried a pocketable camera of some sort, (mostly the Canon S95/100), when I wasn't carrying my large Nikons. I got good snapshots and sometimes photographic art but little of the excitement I used to feel doing what I can only call \"found photography\", or spur of the moment and random inspirations.Then I came across the PowerShot N. It is so quirky in its controls and features that I instantly found myself way beyond my photographic comfort zone. I started taking pictures at odd angles, (the tilt LCD is a big help here), I took them for no particular reason, I took a lot. The camera just begged to be used in weird and chaotic ways.I initially thought that the camera's quirkiest feature, which allows the camera to take not only the picture you wanted but then goes on to take 5 shots of its own using random color temperatures, filters, and zoom positions, was a useless marketers gadget. But that was conservative mindset so I forced myself to turn it on and experiment. Most of the time the random shots are pretty poor or uninteresting, but about ten percent of the time I find that the camera has found a perspective and image setting so far beyond what I would ever have thought of that it verged on brilliant.So, as a creative tool I cannot speak highly enough of the camera, but there are some things that bother me.I find myself accidentally triggering the touch screen and messing up either a menu setting or even preventing the camera from taking a shot.The shutter trigger areas on the front lens ring are a little too small for me and not prominent enough for reliable blind shooting.But the biggest problem is how Canon has implemented the camera's ability to network. Technically I suppose it is great but for the life of me I have never read such a confusing user manual. It suffers from the greatest sin in technical writing; referring the user to different pages during a procedure. So, you start to read about how to connect to lets say your home network; Step 2 might want you to jump 14 pages ahead to read about something. Then while there you might be sent back 5 pages before where you started and so on.The manual also commits the technical writing sin of never explaining why you have to do such and such, or what the effect of any options might be, or any explanation for why something may or may not work.I am pretty comfortable around networks but Canon's user manual is just a dog's breakfast.That said, I now have a superior camera linked to my smartphone (Nexus 4) so I do not have to use the very poor camera in the phone for Twitter, G+ etc.And I really do think this quirky little piece of experimental camera technology has really helped me to break out of my self imposed creative straitjacket.I like it a great deal for that.Rick GrantCalgary", "Date": "August 12, 2013"}, {"Title": "The camera is a hit!", "Author": "MeridianX", "ReviewID": "R3QJ18I7WEP2HE", "Overall": "5.0", "Content": "Just received the camera....so far all I can say is that I purchased the white version and it is a gorgeous little camera! BUT please be aware to purchase a microSD card!  It doesn't mention this anywhere in the description so I need to get one before I can test out the camera...stay tuned...Update: May 5, 2013Camera takes pictures just as good as my Canon S90.  Totally different experience though...it is more like my iPhone.  Intuitive but requires being open to a camera that handles differently than any before it.  The camera is small and subsequently the buttons are small also.  Even though the buttons are small they are easy to hit and because of their location, do not get pressed accidentally. The touch screen works very well, only requiring a very light touch.  Being able to touch the screen to focus on the area you want to be in focus allows for very quick focus targeting.  Also, using the screen to sweep through the pictures is very convenient.  The zoom is very quick and the swing out screen is very handy.  The creative burst feature has been a favorite of my high school age daughter.  She has borrowed the camera quite a few times to take pictures and post them to her social accounts.  I found the slow motion video to be a addicting...there are two speeds to choose from...taking slow motion video of my son's golf swing allows us to see everything very clear and in very cool slow motion.  I have used it to capture my other children practicing gymnastics, bike riding and trampoline jumping...it gives us all a good laugh.  Most importantly, and the reason I bought the camera, is the wireless capability.  So far for me it has worked great.  If I want to post something or want to send a friend a picture I start up the CameraWindow app on my iPhone and I can view all the pics on the camera.  I then select what I want transferred to my iPhone.  The transfer has been quick and effortless.So far I have not explored all the capabilities of the camera but I can say I am very happy with the camera.  I have also had positive reaction and have shown the camera to a number of interested people who have seen me while using it public.  For the price it has exceeded my expectations.Update: May 10, 2013Still enjoying the camera!  I want to add some additional thoughts on this camera.  I have not altogether replaced my compact point & shoot with this camera.  This camera is for someone willing to try something unconventional and is not looking for a replacement for their S95 or G10.  It does not have the traditional manual functions of an enthusiasts camera but it has more capabilities than a camera phone (does use a similar sized flash however).  The camera is more of a curiosity that lends itself to the fun picture taking.  There is a dedicated button that allows you to shoot a quick succession of shots (some randomly of the background and not the subject!) and adds creative filters to them.  This is the type of customer that I believe Canon is focused on.  My teens love it and get a kick out of it when sometimes a stranger in the background shows up as the main subject of one of the random creative shots.  Also, if you do not want to upload your pics via WiFi to your phone then this probably isn't the camera for you. ... Just some thoughts if you are looking for a serious point & shoot camera to replace an old favorite...", "Date": "May 3, 2013"}, {"Title": "Love This Camera, Finally...", "Author": "michael d collier", "ReviewID": "R2PTDXOTSRVSGB", "Overall": "4.0", "Content": "I've had this camera for about a month. I couldn't wait to get it, then I couldn't figure out what to do with it. It is such a departure from any camera I've ever used, it took a while to find a way to enjoy using it.First, the biggest thing is the form factor. How to hold it? I found that for your typical snapshot, opening the screen 45 degrees made for the best combination of holding the camera and seeing the shot. I also found that the ring shutter release is really awkward, especially if you wanted to use the touchscreen to select your focus point. It's much easier, especially with the screen at a slight angle, to touch where you want the focus and snap the shot at the same time. There is a setting to enable the touch to shoot option.Secondly, the next big thing is the WiFi feature. I've used Eye-Fi cards for years, and expected the same experience. Not so. Not nearly as automatic, but still pretty simple once you figure it out. First, press the WiFi button on the camera. It will start looking for an access point on your network, or, what I recommend, a smartphone. Next, on your phone, change the WiFi network to the name display on the LCD of the camera. Now you can select photographs on the camera and transfer them to an impressive number of websites.With these two revelations (for me), I've gone from \"why bother\" to \"hey, this is kinda cool\".Finally, the image quality is extremely good, much better than most P&S; cameras. The Depth of Field is even decent using the method I mentioned. I posted an image here so you can see what I'm talking about.So, if you're feeling a little adventuresome, this is a really well built camera that takes great pictures. The only drawback I see is if you are out with friends and want a stranger to take a picture for you.", "Date": "June 18, 2013"}, {"Title": "Mother's Day Gift", "Author": "lgb", "ReviewID": "R3AXRGA9C8XWQ2", "Overall": "5.0", "Content": "I purchased this camera with my gift card.  So far I love it.  I own several compact digital camera's and think this one will probably be my favorite.  The size is great.  I love the focus lens an touch screen is awesome. The flip screen has so far been great too.", "Date": "June 25, 2013"}, {"Title": "Great Camera!", "Author": "Ellen S. Morgan", "ReviewID": "R3HY2V3A2TMEQD", "Overall": "5.0", "Content": "My daughter absolutely loves this camera.  She said it is everything that she expected and more.  I strongly recommend it.", "Date": "September 18, 2013"}, {"Title": "Finally a small point and shoot that works!!!", "Author": "Roger Norberg", "ReviewID": "R19I4PQ34FP2G", "Overall": "5.0", "Content": "I usually shoot with professional grade equipment but there are always times when you want to carry a very small camera for shooting casual pictures.  I have tried several over the years but the results were never satisfactory, or the camera was slow and not responsive enough.  The PowerShot N is the perfect machine!  Its very fast, images are excellent sharpness across the zoom spectrum and low light or odd light images are very good.You have to spend a little time getting accustomed to handling the camera as it is quite small and the shutter is on the lens ring.  However in a very short time it all makes sense.  Overall its very simple and intuitive, and the wifi feature is an extra bonus.  You don't have to accept smartphone quality pics if you have this camera (which is smaller than a phone).  Its also very well built, quality materials and finish, feels good in your hand.  Some will be turned off by the price but if you want a really high quality very small camera that can shoot high quality images, this is it!", "Date": "May 8, 2013"}, {"Title": "canon powershot camera", "Author": "mel bollom", "ReviewID": "R1G3MUV102V41A", "Overall": "4.0", "Content": "The directions for making use of the camera are weak...and the ability to use its many features will go unused as a result.  6 - 8 step by step directions on the major features would make this a much more valued camera.", "Date": "November 28, 2013"}, {"Title": "You won't be sorry : )", "Author": "Bev", "ReviewID": "R2FN2QPT9N9L6M", "Overall": "5.0", "Content": "Small and really amazing! Love this camera! I carry it everywhere, it is very small and captures images nicely. I love the creative shooting mode, which shoots 5 images using different filters. For the most part the other shots aren't useable, but sometimes you end up with something really great.Different than any other camera I've ever owned. The shutter release is totally unexpected, the touch screen works really well. Love it.", "Date": "November 24, 2013"}, {"Title": "Touch...take 1 or take 6", "Author": "Delia Saunders", "ReviewID": "R1E9HA41K3T9O1", "Overall": "5.0", "Content": "There are 2 amazing features on this camera.  1: the touch screen allows for easy breezy photo taking, and 2: the creative mode feature.  With this one shot creates 6 very different & unique pictures.", "Date": "November 19, 2013"}, {"Title": "Perfect", "Author": "Paul V. Sale \"paulvincent\"", "ReviewID": "RRNMEPBEMNCD7", "Overall": "5.0", "Content": "Ease of use. Touch screen focus/shutter. Auto focus takes you to macro. Built-in fish eye f/x. Nice, compact design although manual shutter and zoom are a bit tight at the base of lens.", "Date": "March 22, 2014"}, {"Title": "Nice!", "Author": "Jereme", "ReviewID": "R15S57VAIZNS9F", "Overall": "5.0", "Content": "I ordered this for my girlfriend as a gift and she really love it. I didn't think it would be that great due to the size of the camera but the photos are surprisingly sharp. Really good buy.", "Date": "February 17, 2014"}, {"Title": "Great Innovations!", "Author": "Bonnie", "ReviewID": "R2VYR3B5MTO4L5", "Overall": "5.0", "Content": "I love everything about this camera. Perfect size for grab-and-go photos. The tilt display is a must for capturing photos from great creative angles. My #1 tip for interesting photos—change the perspective—don't just hold camera up to your face and shoot. For example, try holding the camera at or below your waiste and angle up. I think you'll find it more interesting than normal snapshots. This is why I am so excited about this little gem—the tilt display alone makes it far superior to any camera phone on the market.The zoom ring, which is very old-school, is easy to control and has a very smooth action while shooting video. I've quickly adapted to the shutter ring—but, if you aren't wild about it, just switch to touch screen shutter. For touch screen, hold your finger on screen, wait for in-focus beeps, lift finger and shutter releases.I have found myself cradling the camera in my left hand with my thumb resting on top of the zoom ring and my index finger wrapped around the bottom of the zoom ring—easily controlling zoom with my thumb. I use my right hand for on-screen selections, shutter release, and added stability. This is very reminiscent of my days of using a SLR film camera.I have found the touch screen controls to be very intuitive, but, highly recommend taking the time to load the users guide and reading it to get the most out of this wonderfully designed little camera. I would love to see this ingenious design widely adopted for point and shoot cameras.The metal housing is beautiful and sturdy. I was happy to find that this model sold by Amazon included the neck strap and blue \"sleeve\" that is standard for the N FaceBook model. The little sleeve seems pointless, but I love the neck strap. Also happy with Amazon's service. My first PowerShot N had a serious scratch on the display screen. I braced myself for the hassle and expense of exchanging it. To my delight it was quick, easy, painless, and free. I just followed the exchange procedure and the damaged camera was picked up by UPS the next day (free to me) and the replacement was shipped immediately and arrived in about 4 days.", "Date": "February 16, 2014"}, {"Title": "Adorable", "Author": "mary  sanchez", "ReviewID": "R1PMCUP3TGKLGP", "Overall": "5.0", "Content": "The title says it all. For something so small, I though the material of the outer shell might be plastic, but even though it is it's actually quite strong and feels very good in the hand. Check out more images at my blog: [...]", "Date": "February 5, 2014"}, {"Title": "Best small camera ever!!!!", "Author": "Alicia", "ReviewID": "R3F71W8LE1274F", "Overall": "5.0", "Content": "I Love Love this camera.....My husband bought this for me so that i could have a smaller camera to take places. The pictures are great i love the options it has and it's not heavy when i hang it around my neck. I like that i can connect with WI-fi to my I-pad or I-phone and send pictures.I have a canon rebel but sometimes it's too big to take to Disneyland this camera is perfect for stuff like that. The only thing i don't like is where the shutter button is located and the battery dies fast. But the camera charges fast so i keep a plug in my car.", "Date": "January 29, 2014"}, {"Title": "Small", "Author": "Amazon Customer", "ReviewID": "R3MD1EJTG94JPQ", "Overall": "5.0", "Content": "It works great, especially for being so small.  The wifi feature works easily and is quite handy.  Im Recommended this one.", "Date": "January 18, 2014"}, {"Title": "Great!!!!", "Author": "Nate Wengerd", "ReviewID": "R2Q26F4JM1TQCJ", "Overall": "5.0", "Content": "I only wish it had a manual setting. But overall i really love this camera. Its small and light-weight and takes great pictures.", "Date": "January 17, 2014"}, {"Title": "Canon Power Shot CMOS Digital camera", "Author": "Albert C. Marth \"Albert c. Marth\"", "ReviewID": "RBHZVZ5TOB89N", "Overall": "4.0", "Content": "I was pleasantly surprised when I received this camera.  It takes excellent pictures as well as great movie shots.  It has a bunch of editing features.  Too many to list.  Very nice and clear screen.  A comfortable size that is easy to pocket!  All in all, a great little camera that does a lot for a little.  I think you too would be pleased overall with this camera!", "Date": "January 9, 2014"}, {"Title": "Nice Product", "Author": "Ronald T Gallagher", "ReviewID": "R1PGUWR301R7SG", "Overall": "3.0", "Content": "It was a gift for an older couple and the way you zoom & take shoots was a bit unusual, for me it would have been fine.  Loved that it was compact... just not the best for someone not technically savy", "Date": "January 3, 2014"}, {"Title": "Love this camera!", "Author": "Saphira", "ReviewID": "R32KS85LH5J5C8", "Overall": "5.0", "Content": "I'm a YouTube vlogger, and needed a new camera for my daily vlogs.  This works so well!  The pictures are great, the quality is fabulous, and the camera itself is beautiful!Only downsides:Battery doesn't last as long as other camerasViewfinder doesn't turn all the way around for videoLove this though!  Would definitely purchase again! :)", "Date": "December 28, 2013"}, {"Title": "Love this little guy!", "Author": "Justin Stearns", "ReviewID": "R23QWH58S0E7GF", "Overall": "5.0", "Content": "I am very excited about this camera. Love it to pieces. It's a little strange coming off of a dslr to something like this but I adore it. I bought it because I needed an interesting light and compact point and shoot and really liked the originality of this camera. As far as the heavy weight people discuss on their reviews they are expecting because it is so small that it won't weigh anything, but Canon gave this little guy a full metal body. I am accepting of the weight, just because I know how sturdy this camera is. I have no issues with the screen only flipping 90 degrees, but then again I wasn't expecting it either. I also tried taking selfies and shot self video with no issues. So I don't really see why the screen flipping up is so important. I did use the screen for what Canon intended it for which was high, low and food photography and it was so much better than a standard non flip non swivel screen. The flash seems like a cell phone flash, but it's much more powerful and honestly much less fake looking than cell phone and camera flashes tend to be, which as I have noticed with all of my Canon cameras, seems to be a trend with their flashes. Battery life is a little short here though, but I'm just going to buy some backup batteries. I don't expect such a small camera to power an entire city over night like some people seem to. Overall VERY happy with this purchase and considering buying more for family. :)", "Date": "December 26, 2013"}, {"Title": "very good purchase", "Author": "YING LI", "ReviewID": "R2IWG1WVAXUFBY", "Overall": "5.0", "Content": "The first word to describe my feeling to this cute thing is: Surprised. I've never seen any camera as tiny and cute as this one, which makes it so irresistible. Besides, the quality of picture is good enough to me (as a person who randomly uses camera).", "Date": "August 10, 2013"}, {"Title": "Poor usability and video stability", "Author": "Sun Net", "ReviewID": "R346PDI4M4EHDB", "Overall": "2.0", "Content": "I bought Canon Power Shot N to take on my vacation in a few months. Having tried it for few days I have second thoughts on it and planning to return it.Pros: Slim and handy design, reasonable picture quality comparable with new smart phones. The flip display and touch screen are good features. Zoom and shutter rings around the lens are cool.  Good zoom range (8x optical) with indication of optical and digital. Flip display and touch screen are useful features.Cons: Flip display moves only 90 degrees and not suitable for selfees.  My main complain is its user interface.  Despite the touch screen the navigation is very badly designed and has very poor usability. Many issues are annoying and some are painful. Even the printed ‘Getting Started Guide’ is poorly done.Multi-photo ‘creative shots’ feature is useless in my opinion. Very few people will use it and even then only a few times just to tryout. You have 5 pictures to delete every time you take a picture. A true multipicture feature would have been useful instead of camera deciding on parts of the scene to capture.  Strangely this apparently useless feature is selected with a dedicated hardware mode switch.  However, a useful feature such as slow-motion video is the last selection on the menu. Slow motion performance is nowhere near iPhone 5s. Very poor stabilization of videos and cannot recommend it for taking any videos.  Shutter ring and the zoom ring are very close and one may shutter inadvertently while trying to zoom.Nice leather looking long carry strap, only if you like to carry this tiny camera like a ladies handbag.Note that the camera does not come with any memory at all and you need to buy a micro SD separately before you can even try the camera.", "Date": "January 6, 2014"}, {"Title": "4 stars will most likely become 5!", "Author": "Alexandra Nash", "ReviewID": "RZJEZOXDDRIJ2", "Overall": "4.0", "Content": "I just received this camera yesterday and took it for a test drive today. I gave the camera 4/5 stars only because I haven't had a chance to see what it's like downloading photos to FB. Totally happy with its size and image quality and video quality also impressive. Very easy to use and get used to. Connected it to my iPhone by installing the Canon Camera Window app. Really easy to transfer photos and videos from the camera to my phone, but be patient as it takes some time depending on the number. Having a trickier time connecting to FB since I have a MacBook Air that has no disk drive. Tried to download the software from the Canon website, but my Mac wasn't detecting the downloads. Contacted customer service and they suggested installing the software disc on another computer then downloading it to a USB key and installing it on mine from the key. Will try as soon as I can! I'm a seasoned photographer, well-versed in equipment, and was at one time a professional photographer. This camera is a great addition to my iPhone's camera and is an easy accessory to throw in my purse!", "Date": "August 17, 2013"}, {"Title": "Fits in perfectly between my iPhone & Canon 5D Mark II", "Author": "Gregg W. Stuessi", "ReviewID": "R2BM6BTP4O99G8", "Overall": "5.0", "Content": "I am truly smitten with this PowerShot N. Even though I own an expensive DSLR, I find myself taking 99% of my photos with my iPhone 5. The only thing I am not enthralled with on my iPhone is the digital zoom. In walks the PowerShot N with optical zoom, wifi connectivity with my iPhone and I am in love with the combo!  The \"N\" is small enough to go into a pocket, starts up rapidly, the zoom is easy to manipulate, the touch screen is responsive and the wifi transfer with the Canon iPhone app is effortless. I am not yet in love with the Creative Mode, I find them to be odd at best but it does not lessen my adoration with this camera. I highly recommend it for anyone wanting that extra \"horsepower\" when they are out shooting but may not want to take their DSLR.", "Date": "June 5, 2013"}, {"Title": "I would buy something else...", "Author": "JP808", "ReviewID": "R106M129C13DE5", "Overall": "1.0", "Content": "Not as small as I thought it would be. The screen would be more useful if it could flip up so you can view the picture for timer self portraits or group shots on a tripod. The single shot capture is strange to press the entire ring as the photo button. Also, hard to handle without inadvertently pressing a function on the touch screen. Once you get past all that though it's a decent camera.", "Date": "November 26, 2013"}, {"Title": "A nice little camera that takes quality pics with one major caveat.", "Author": "Christopher E. Fuller", "ReviewID": "R2AU2QCGWHYTUM", "Overall": "3.0", "Content": "It has an adjustable LCD but it really isn't that adjustable because you cannot flip it all the way to take a \"selfie\". So really, what's the point? Try another brand instead if that is what you're looking for.", "Date": "November 3, 2013"}, {"Title": "excellent camera, very difficult software to use.", "Author": "bill-still", "ReviewID": "R1V0NAV2J8X085", "Overall": "4.0", "Content": "great camera capabilities, excellent photos, easy and convenient controls and easy to use.Software is slow loading, difficult to see, (dark background), not arranged logically, and doesn't work for me.Still have not found a telephone number I can call for help.I dont want to return camera, but I am considering returning.", "Date": "October 21, 2013"}, {"Title": "coolest camera", "Author": "SMK \"Laxmom\"", "ReviewID": "RJDJ2VP04IVWL", "Overall": "5.0", "Content": "Love this camera. Still discovering all the things it can do. Does cool insta-gram like shots and can connect to internet to download. Fun camera!", "Date": "August 16, 2013"}, {"Title": "Camera", "Author": "Cheryl", "ReviewID": "R1M8LG9O6TKV7F", "Overall": "5.0", "Content": "I wanted a wifi camera and decided on this one and I am glad I did.  I just love the size and how easy it is to carry.", "Date": "May 6, 2014"}, {"Title": "took it 5 months to die", "Author": "Showiest", "ReviewID": "RWGSMOYQMQENC", "Overall": "1.0", "Content": "Bought it 5 months ago via amazonhardly used it my cell gives better resultsmost of the time stowed in my suitcaseconsumes battery worst than my cellphoneafter 5 months doesn't work only replay is availablecannot find my way to warranty or repair via amazon.....", "Date": "March 18, 2014"}, {"Title": "Cozy, comfortable, useful", "Author": "Andi C Bair", "ReviewID": "R36AL5E0B7L40Z", "Overall": "4.0", "Content": "The Canon N is an innovative, fun camera, focused on convenience. Let me use my usual disclaimer, in the interest of fairness, and admit that many cameras by reputable makers (and there are many) deliver what they promise. It is more about what camera traits you are looking for. So, I would suggest to anyone looking to buy one to google 'camera trait search' and get the whole picture.The Canon N is a fixed lens camera (point and shoot, some would say), with 12.1 resolution (megapixels), and a x8 zoom. The sensor size is 1/2.3 inch CCD-type, which is standard for cameras of its class.It does not have a viewfinder, which, again, many in its class don't. The ISO rating, which is the gauge for how well it does in low light, is 6400. That rating is sufficient for most purposes. The video is a Full HD- that is 1980x1080 resolution. It does not have a hot shoe for an external flash option. That is not unexpected for its size and category. The LCD screen is a 461,000 resolution. The camera does not do RAW processing but you would need only if you did not want to be limited by JPEG type storage. The burst rate is a reasonable 2.3 frames persecond- great for quick shots. The weight of the camera is a convenient 195 grams.Canon N comes with WiFi, and the LCD is both tiltable and touch-screen.Overall, a fun, convenient camera. Having been into photography for a while, I do stress though that you do a camera trait search. That will also tell you more about what you want.", "Date": "March 11, 2014"}, {"Title": "So in love with this little baby!!!!", "Author": "Alexis La'wynn Ryals", "ReviewID": "R2RSYD2RS77ETO", "Overall": "5.0", "Content": "Received this as an Valentines/Anniversary gift from my boyfriend and lets just say I have not been able to put this camera down. Was skeptical of the photo quality due to the cameras small size, but the results have blown me away and not to mention it's a eye-catcher. Being a girl that's always on the go, the cameras size makes it super easy to throw into a clutch or purse without the weight down that comes with other cameras.", "Date": "February 16, 2014"}, {"Title": "NOT THE GREATEST", "Author": "BartGoldNYC", "ReviewID": "R1T78CERA8NVRN", "Overall": "2.0", "Content": "For starters it's a unique design  and that's why I bought it ---and the reason why I might return it. While its small its quite heavy, like having a rock around your neck. Controls are very small, too small, and menus are not simple to use. Be wary.UPDATE: I have, in fact, made arrangement with Amazon to return the camera, the memory card and the charger with two spare batteries. It just is a difficult little bugger. As I stated, it has a beautiful design and is well built and quality like most Canon cameras, but it is far too small to safely handle in the field or indoors, it is too heavy -- that may be hard to believe but it is like a little brick if you have it on a strap around your neck, and the photos are NOT spectacular. I assume it might be \"cool\" for the Facebook, Instagram shoot-and-upload generation. If you are interested in the camera TRY to find it somewhere where you can handle and play with it before you buy. I see that now that the summer camera buying season is over Amazon is dropping the price. The last Canon I bought was in 2007, the Canon TX1, also an untraditional camera BUT great. I still have it and love it. But Canon never made a TX2 because users thought it was an odd shape etc., just like I feel about the N. I'd be surprised if there is an N2. Canon just brought out a Facebook Edition of the N with a button to upload to Facebook. I despise Facebook :0.", "Date": "August 31, 2013"}, {"Title": "Awesome tiny camera", "Author": "Ed31", "ReviewID": "R33H852NZ5VPKF", "Overall": "5.0", "Content": "Love everything about this camera. Just wish the battery would last longer but other than that im happy with the camera. My third canon camera.", "Date": "June 2, 2013"}, {"Title": "Love it, but don't buy it for the connectivity.", "Author": "J. Stevens", "ReviewID": "R3AL34FIJOFLFJ", "Overall": "3.0", "Content": "Nice camera. I really like it. However, if you think you're going to connect to your computer and phone wirelessly as touted, get ready to get out the manuals and settle into hours of frustration with maze-like directions and no help. First, you must sign up for Canon Image Gateway, an experience that first requires registration of your N camera, which then fails to show up under your registered products once you enlist in the Gateway program, and you have to re-register the product all over again.Once I successfully joined Canon Image Gateway, I presumed an icon would appear on the camera (like the Twitter icon that did appear) so I could at least upload pictures to their website for later download, as promised. Uh-uh. You will also find - at least I did - that the Canon N only sometimes will join your network, telling you that your password is wrong, only to tell you next time that your password is fine, even though you haven't changed it. If you think you're going to send photos to your phone, in my case an iPhone, good luck. And I don't mean that sarcastically, because luckily, I did manage to connect to my phone once or twice for a nano-second before being disconnected with no explanation, except for the message \"disconnected.\" So far, I've never substantially connected to my phone (yes, I've downloaded their app), though I might one day. I like the camera, but right now, the advertised \"connectivity\" is not for the faint of heart.", "Date": "May 10, 2013"}, {"Title": "Perfect!", "Author": "Picture Perfect", "ReviewID": "R1WX3AXGQ624HN", "Overall": "5.0", "Content": "I purchased this camera because I like taking pictures with a real camera instead of my phone. The quality is just so much better. So this is perfect because it's small enough to carry around (it's smaller than my iPhone) and can easily upload the pics to my phone. It is a bit thick but not bad. So bottom line, I'm not a pro photographer, just someone that likes to take pics for sharing with friends and social media (Instagram and Facebook) and this is the perfect addition to carry around with me.", "Date": "February 8, 2014"}, {"Title": "Love the multiple shoot!!", "Author": "Monica", "ReviewID": "R2013YME27HOE4", "Overall": "5.0", "Content": "Very happy I got it before my trip. Image's quality is very sharp, same when shooting videos. Loved the filters and compositions she can create when in Multiple Shoot function, my best pictures are probably those with no effort.", "Date": "October 3, 2013"}, {"Title": "your cell phone has better camera functions than this thing", "Author": "Jessica Sorenson", "ReviewID": "R2QC1XLMA2KHOA", "Overall": "1.0", "Content": "Worst. Camera. Ever. Does not have typical settings like landscape, etc. Instead it has only silly filters a la cell phone style - fish bowl, etc. Extra \"fun\" filters would be great if it could do normal settings too but it doesn't. It also doesn't have a button on the top to take the picture like every other camera under the sun. You have to press down on the lens in a specific spot - the zoom is right on top so you have to be careful. It's something you can adapt to if you will never pass your camera off to another person - which isn't even close to realistic. Somehow this camera was listed on best travel cameras. It is small, so that is nice but there are other small cameras out there. The lack of standard photo settings and the need to give anyone who touches it a full tutorial makes it completely useless - especially for travel. Incredibly annoying. I will be returning this camera - too bad I'm stuck with the memory card I had to purchase as well. My cell phone can take these pictures - why would I want to carry around something else that is actually harder to use?", "Date": "November 5, 2013"}, {"Title": "Where is the shutter button?!", "Author": "CraigE", "ReviewID": "R64BUXV5KQAOB", "Overall": "3.0", "Content": "Excellent pictures but the lack of a proper shutter button makes this camera more of a toy rather than what would otherwise be a great point and shoot camera.", "Date": "November 6, 2013"}, {"Title": "Crazy but very fun.", "Author": "TLavine", "ReviewID": "R1L4HDAZ0LLUX8", "Overall": "4.0", "Content": "One of the most unusual cameras I've ever owned, hangs around your neck, flips open yet it's a great little camera, pics are nice.  Great conversation piece.  Just fun to use.", "Date": "July 21, 2013"}, {"Title": "Fun LIttle Camera", "Author": "D. Hanson", "ReviewID": "R1WPRJK0U09D26", "Overall": "4.0", "Content": "I've been pleasantly surprised by this little camera. I own several DSLR (both Canon and Nikon) but I wanted something small that I could fit in my pocket when I go places with the kids and I don't want the hassle of lugging along one of my big cameras.  The picture quality is pretty good and the camera itself feels very well made and is fun to use.  I seem to prefer the touch screen shutter function as opposed to using the shutter ring around the lens.  The only thing that could use some improvement is the WiFi connectivity to a your smart phone.  The initial setup can be a bit confusing and takes a little time to do.  Overall though this is a nice little camera to take along to places where a larger camera would be a hassle.", "Date": "June 16, 2013"}, {"Title": "Memory card sold separately", "Author": "bamboo \"bamboo\"", "ReviewID": "RSDDWQ3GVASFV", "Overall": "3.0", "Content": "Beware, the memory card is not included in the box. I Wish it was made clear. Otherwise item is as described.", "Date": "December 24, 2013"}, {"Title": "No real use", "Author": "Spiked1", "ReviewID": "R16T74UXCFDZ3O", "Overall": "2.0", "Content": "First off I am a huge canon fan and collector of cameras.  I use a G 12 for my pocket camera, which is pocketable, but this thing grabbed my attention for its size. I ordered this camera hoping to be able to take better pictures in low light than my IPhone, which suffers when the subject is even moving slowly.  This camera falls way short for the price.  Indoors, it adjusts the ISO way too high for a decent looking picture while in auto.  While in P it adjusts the shutter way too slow with a lower ISO.  Is it better than my phone? nope.  There is a total lack of control to try to accomplish a decent shot in a tough situation.  Sorry, but this is where film still is a much more economically viable solution if you know what you are doing and actually care about your shots.  To each their own, but to me, film grain looks better than digital noise.  I was not looking for the moon, but I was hoping for better pictures out of this camera for the price.  Save your money and time by just using your phone for shots that you want to post up quickly and look at other options for cameras you want to use when you care about taking a bad shot.  I can tell you though, this camera does not function in lower light levels that most cameras I have used would.  The flash is very weak as well.  This camera would be saved in my opinion by the ability to select scene modes instead of only having the camera do it for you. It does not though...  Hate to say it, but this camera is a gimick and I fell for it.  There are better point and shoots that give you more features for actually taking the shot and at a third of the price.", "Date": "May 7, 2013"}, {"Title": "It caused a stir! :)", "Author": "Hellen White \"Folly\"", "ReviewID": "RB6UVH6F4RKYO", "Overall": "5.0", "Content": "Got my camera just before a fantastic weekend away in the tropics, so it got quite a workout. The photos are fabulous. A professional photographer friend was really impressed with it too. Compact but sturdy. Still learning to 'drive it', but think this will get a lot of use. Have a Canon SX50 as well, so have it all covered.", "Date": "July 21, 2013"}, {"Title": "One Word Fun", "Author": "Joyce B. \"Joyce B.\"", "ReviewID": "R8WKV770NL7LR", "Overall": "4.0", "Content": "At first I thought about sending it back. But as I use it the pictures are better than on my iphone. Also it zooms and does macro. I think the picture quality is good but not on par with my G 12 or G 15, but than her give this little guy a break. I have not tried the wi fi yet but intend to use it for my facebook,etc soon.  The one thing that irritates me is that if you touch it near the program icon it sometimes changes to the screen where you select what program you want. I have used the touch screen to snap photos but it doesn't seem to show a green frame when you do so I prefer to go the more traditional route. I did take a quick film and it came out well. Won't replace my main cameras for more serious photography.", "Date": "May 22, 2013"}, {"Title": "Disappointing", "Author": "Bobby B", "ReviewID": "R3JECHLOJRLCG", "Overall": "3.0", "Content": "I just didn't feel that Canon lived up to it's name.  This is probably better suited to preteens.  The only thing missing is a Hello Kitty Sticker...", "Date": "September 18, 2013"}, {"Title": "Dwight", "Author": "Dwight C. Mogge MD", "ReviewID": "R2NNWB2EL0KWVJ", "Overall": "3.0", "Content": "Battery is very short lived.  A spare is needed to carry with one. I recommend to have one or more spares.", "Date": "May 5, 2013"}, {"Title": "Disappointment from Canon", "Author": "B. Gerber", "ReviewID": "R2SNLHK3SLCO23", "Overall": "2.0", "Content": "I'm a Canon DSLR fan (have a 5D and new very compact and promising Rebel SL1), photography enthusiast and computer systems/networking expert by trade. The PowerShot N is a disappointment for me. It doesn't take very good pictures. Many out of focus or blurred no matter what settings I use. I also find the WiFi capability a pain in the neck to use. I put the camera away in a drawer and will probably sell it on eBay.", "Date": "June 26, 2013"}, {"Title": "Nice and small", "Author": "Bastiaan De Rooij", "ReviewID": "RI348FS3N16Z0", "Overall": "4.0", "Content": "The powerShot N is a tiny little camera, perfect to carry along in your pocket.It has a great zoom for its size and takes very good photographs.The flash isn't too powerful zo night pictures, even close up portraits came out a little dark.There maybe solutions to this but I have unfortunatley not had the time to check them out as I dropped it in the water.It doesn't float and it isn't waterproof (I knew this...) and it went straight to the bottom of the Caribbean sea.I bought a Powershot 270 SX270 instead.", "Date": "June 7, 2013"}, {"Title": "not as cool as I had thought.", "Author": "Anthony Werner", "ReviewID": "R3J579P8P33496", "Overall": "3.0", "Content": "I bought it for my wife as she is a lefty and uses facebook a lot.  it is just okay and the features for uploading automatically work but are just okay.", "Date": "June 30, 2013"}, {"Title": "Bigger Than It Looks. Probably Takes Great Pictures", "Author": "Doron Avizov", "ReviewID": "R2KKSIH3S0XM0Y", "Overall": "4.0", "Content": "I loved my Canon SD780 right up until it fell and broke while we were on vacation. I'm a fan of Ken Rockwell's blog and bought a Canon S100 based on his recommendation. While it's a great camera it is no where near as pocketable as my SD780 was. I've since been patiently waiting for a suitably small replacement. I saw an ad for the PowerShot N, read the reviews on Amazon and bought one same day. Upon opening the box, I was surprised and disappointed to see that the PowerShot N is about the same size as the S100 I was hoping it would replace. I'm sure it takes great pictures but I'm sending it back instead of bothering to find out. The Canon S100 already takes great pictures and I see no point in replacing it with another camera of the same size. The PowerShot N also feels slightly heavier than the S100. My ideal camera is one that I'll forget is even in my pocket.Just because it's not for me, that doesn't mean it isn't a wonderful camera. It's much smaller than any DSLR, \"pro-am\" or \"serious\" camera which means you're more likely to have it with you and use it. The body feels like tough metal construction.  I like everything about it except it's \"averge\" compact camera size. I'm sure the tiny camera I'm looking for will not take as good a picture as the PowerShot N but it will get the shot because it will be in my pocket when I need it.", "Date": "May 27, 2013"}], "ProductInfo": {"Price": "$299.00", "Features": "Built in Wi-Fi for wireless transfer of images to social networking sites\nMobile Device Connect Button allows for a sharing connection to Android or iOS devices\nNew Creative Shot mode uses composition, color and lighting from original image to create five unique images with artistic flair\nNewly designed 2.8-inch capacitive, tilt, touch panel LCD; lens shutter; and zoom ring\n12.1 MP CMOS sensor, DIGIC 5 Processor, 8x Optical Image Stabilized zoom, 28mm Wide-Angle lens", "Name": "Canon PowerShot N 12.1 MP CMOS Digital Camera with 8x Optical Zoom and 28mm Wide-Angle Lens (Black)", "ImgURL": "http://ecx.images-amazon.com/images/I/51ciKzr22jL._SY300_.jpg", "ProductID": "B00AWYN2CW"}}