{"Reviews": [{"Title": "Very nice handling, features, and images.", "Author": "Bron \"Bron\"", "ReviewID": "R2GI8G545QTPO", "Overall": "5.0", "Content": "The Samsung EX2 is a very nice compact camera that reeks of quality, from the nicely designed body to the excellent quality 24-80mm f/1.4-2.7 lens.  It fits the hand well and the controls are well laid out.  The grip is good and it just has that \"right\" feel when shooting.  Some cameras have it, some don't, this one has it.Build quality seems very good and the finish is very nice.  Good thumb area and grip on right front.  Metal body with some plastic, of course, but very solid feel overall.  Body is a tiny bit thicker than some, but I actually like that.  The 3 \" AMOLED screen is very good.  Yes, a view finder would be ideal (and it they made this same camera with a view finder for $100 more, I would buy it!), but the screen is good and gets the job done.  It has some interesting features like a built in ND filter, some interesting modes like HDR, some slightly unusual, but effective control dials, a neat plastic \"rim\" around the lens with a very grippable surface (can be removed), rotating eyelets for the strap, easy to read markings, decent menus, and so on.One thing I really like is the fast, snappy auto focus.  It's very \"crisp\" in operation, I never find myself waiting or hunting for a focus lock with this camera.  Very nice, I can tell you, and something not to be taken for granted (having used other fine cameras that did not, it can soon become very irritating when auto focus does not work well).It has the quite excellent Samsung Fn button menu feature - this is something I love about Samsung cameras, one of the best interfaces I've seen for making commonly needed adjustments easily and quickly -- and with class (nice visuals and feel using the dial on the front of the camera or the wheel on the back, hands down better than the competition in my opinion).The 12.4 megapixel sensor seems to be a good one.  IQ is good.  Noise is not an issue at normal ISO's (<800 or <1600).  This camera is a bit unique and it does take a bit of use to get used to it, but it's well worth it.  I always feel like I'm using a \"real camera\" when I'm shooting with the EX2, if you know what I mean.  It stands out from among the crowd in this highly competitive market segment (compacts around $300 are plentiful).  I wish the zoom were a bit longer, but I can live with it, and I am very happy to have the wide angle and great speed.  F1.4 is a treat and faster than anything else in this segment as far as I know.The WiFi features work well and the PC-AutobackUp is great for quickly and easily transferring photos to your PC or laptop after a quick shoot.  The SLB-10A battery is used by several other Samsung cameras, so I had a charger and a couple of spares on hand already, which was nice.  I have not used the video mode that much yet, but I did some tests and it seemed fine to me.  May come back and update later after I have more experience with it.  Another review I saw mentioned the excellent sound quality of the built-in stereo mics and I can vouch for that.  I ran some tests and was very pleasantly surprised, the sound quality was maybe the best I have heard on a camera in this size and price range.  With the bright F1.4 lens and great mics, shooting music performances inside and getting decent results is a real possibility - shazam!Color and quality on both stills and video seemed good.  Need to do some more testing, but looking at my shots so far, I have been very pleased.  I often come back and update my reviews, so watch for more as I have more time with this fine camera.  For now, it's an easy 5 stars for the excellent build, features, performance and value offered.2013/11/13 Update: Went back and took a careful look at the images I've accumulated and the jpeg quality. Overall the image quality is excellent and I saw no issues with the jpegs at all, in fact, better than most I would say. I feel no need to show RAW, but nice to know it's there if needed. Noticed a lot of the images had excellent exposure and color, good dynamic range, very pleasing quality. The lens seems to be excellent and worthy of the name. I remain very happy with the still images. Took another look at some videos and they looked excellent to me as well and have great audio. I like this camera better the longer I have it.", "Date": "August 22, 2013"}, {"Title": "good stuff", "Author": "J. Soh \"Estran Axl\"", "ReviewID": "R3SMV8X7ORQJC9", "Overall": "4.0", "Content": "Value for money .. got it for under 300 bucks which is a decent price considering the features provided in the camera .", "Date": "October 5, 2013"}, {"Title": "Great camera for travels", "Author": "Arsenii", "ReviewID": "R8IG5G25UI8RC", "Overall": "4.0", "Content": "Good camera, many things to alter and play with. Lots of useful settings, and also it is small. This'll be my travel camera for years.", "Date": "November 28, 2013"}, {"Title": "Great camera! took it to my last trip to central america and the photos are excellent!", "Author": "Nadav Reuben", "ReviewID": "R2S3GW17NMR4XK", "Overall": "5.0", "Content": "Great camera! took it to my last trip to central america and the photos are excellent!many fun. on this one", "Date": "October 2, 2013"}, {"Title": "New?", "Author": "Yibo Wu", "ReviewID": "RMR1C96EFXAIP", "Overall": "2.0", "Content": "The box has been opened when i first got the box. Dont know why. It was used before?Shouldn't it be a new one for me?Please give responses.", "Date": "October 1, 2013"}], "ProductInfo": {"Price": "$499.90", "Features": "<b>The Brightest f/1.4, 24mm, 3.3x Lens</b><br> With an impressive f/1.4 lens, the EX2F delivers a wider range of aperture steps and shallow depth-of-field, providing the ability to blur out the background of your images while keeping the focus on the subject. Plus, the equipped ND (Neutral Density) filter reduces the intensity of light in bright sunlight adding more dimension to your photo.\n<b>12.4 Megapixels, Large 1/1.7\" BSI CMOS Sensor</b><br> The EX2F features a 12.4 megapixels, large 1/1.7\" BSI (Back Side Illuminated) CMOS sensor, which needs less light for proper exposure than conventional CMOS sensors and CCD sensors.\n<b>3.0\" Swivel VGA AMOLED Display</b><br> The AMOLED Swivel Display lets you shoot from just about any angle. Compared to the TFT-LCD found on most digital cameras, the EX2F's AMOLED display has deeper blacks and more accurate, vivid colors. Plus, the display maximizes battery life so you can use the camera longer.\n<b>Wi-Fi Connectivity -- Your Best Photos Instantly Shared</b><br> Instantly send quality photos to social networks like Facebook or email -- directly from the camera. Access your uploaded content on supported connected devices with Samsung's TV Link and MobileLink.\n<b>Wide Range ISO for Perfect Exposure and Full HD Movie Recording</b><br> Get rich tonal gradations and true colors -- capturing clear, crisp images of fast-moving objects.<br><br>The EX2F records clear, precise videos even in low light thanks to its bright F1.4 lens. The EX2F shoots 1920x1080p Full HD video at 30 frames per second, with life-like color and extraordinary sharp details. Then hook up your EX2F to your HDTV and watch your brilliant HF footage in the comfort of your living room.", "Name": "Samsung EX2F 12.4 Megapixel Digital Smart Camera (White)", "ImgURL": "http://ecx.images-amazon.com/images/I/51iB%2Biz62hL._SY300_.jpg", "ProductID": "B00AKF3AMA"}}