{"Reviews": [{"Title": "Not even good for kids", "Author": "Bob S", "ReviewID": "R5YTNSPIPATJJ", "Overall": "1.0", "Content": "Invest in a better camera this is worthless. My 5 year old hates the quality of the pictures. A 5 year old can tell this is junk.", "Date": "May 29, 2013"}, {"Title": "Do not buy .", "Author": "hope winkowski", "ReviewID": "R6ZKEYN2S0MDJ", "Overall": "1.0", "Content": "This camera is cheaply made and more along the lines of something you'd pick up at a Dollar Store. Not worth it", "Date": "January 15, 2014"}, {"Title": "Worst Camera Ever", "Author": "Latonya Ranelwilliams", "ReviewID": "R3JZVMHN5LH8X0", "Overall": "1.0", "Content": "This was a waste of money. Don't waste your time with this camera it is horrible. Not intuitive at all.", "Date": "August 5, 2013"}, {"Title": "would not recommend", "Author": "cindy", "ReviewID": "R21MRQNFQDOJXC", "Overall": "1.0", "Content": "If I could rate this in the negative I would. -- I bought this for my 10 year old granddaughter so we may scap book things together.Ist -- the program will not work on my mac -- it is has the latest operating system but the system tells me the program is suspicious and is malware. therefore will not load. I then tried loading it on my pc laptop and it will not recognize  the program either.There is no one to call for help-- no manual came with it. I can get to a page to see the manual but cannot download or read it since you need to load the program first. Alos on the web site it stated A sd card coudl be use as an option..no way!! the is no place for an sd card. more money spent un wisely.DO NOT BUT THIS", "Date": "February 2, 2013"}, {"Title": "The best thing Ever!!!", "Author": "Samantha Staples I  absolutely love it", "ReviewID": "R3UQ0VNLZM4MI1", "Overall": "5.0", "Content": "This is Awesome and was the Best thing Ever!!!I'm in love with this camera and can't get enough of it!!!", "Date": "January 10, 2013"}], "ProductInfo": {"Price": "$43.99", "Features": "Easy to use\nShoots Video clips\nTakes up to 152 photos\nPC Webcam", "Name": "Monster High Digital Camera", "ImgURL": "http://ecx.images-amazon.com/images/I/31eX3tm59ZL.jpg", "ProductID": "B00AIG4UJI"}}