{"Reviews": [{"Title": "very nice camera", "Author": "m8t3x", "ReviewID": "R1NHMZQZ6AWK3S", "Overall": "5.0", "Content": "This camera exceeded my expectation.  Its got all features of DSLR and then some!  The camera is very comfortable to hold.  Its not big and heavy and its not small.  Its just the right size for my hand.  The controls and features are easily accessible.  I just love this camera.  The only thing i dont like is that its not touch screen but i expected this.", "Date": "March 18, 2013"}, {"Title": "Good replacement to point and shoot", "Author": "jamal", "ReviewID": "RBBLX9E3JE16L", "Overall": "4.0", "Content": "This is a short amature review of the Nex 6 with power zoom lens. The camera has a great size in comparison to a DSLR, very fast focus. And has a vast menue which could be overly complicated, i like manual settings rather than a plethora of pre-sets. I like the amount of technology put in this camera but i still think it wont replace a good DSLR yet. Images are great. Low light performance is good. The ultrawide attachment on the 16mm lens has some distortion at the margins. The motorized zoom isnt fast enough. This is replacing my point and shoot and is great for traveling.", "Date": "February 22, 2013"}, {"Title": "Great purchase!", "Author": "JStew", "ReviewID": "R2RK28YXPJUCPU", "Overall": "5.0", "Content": "It was delivered quickly and as advertised. I love the camera and have used several of the accessories. Most notably the SD card works great as well as the battery. The case also works well with this camera. Would recommend!", "Date": "February 4, 2013"}], "ProductInfo": {"Price": "$1,273.00", "Features": "Sony NEX-6 16.1MP Compact Interchangeable Lens w/ 3\" LED Screen Digital Camera in Black w/ 16-50mm Power Zoom Lens\nSony 16mm F2.8 E Nex System Zoom Lens - Sony Class 10 32GB SD Memory Card\nSony Camera Case - Universal Video Camera Screen Protector - Professional Wrist Grip Strap\nLithium Battery - All in One High Speed Card Reader - 49mm UV Protector\nLens Pen w/ Microfiber Cleaning Cloth - 5 Piece Deluxe Cleaning & Care Kit - Micro Fiber Cleaning Cloth - 40.5mm UV Protector", "Name": "Sony NEX-6 16.1MP Compact Interchangeable Lens w/ 3\" LED Screen Digital Camera in Black w/ 16-50mm Power Zoom Lens & 16mm F2.8 E Nex System Zoom Lens + 32GB Accessory Kit", "ImgURL": "http://ecx.images-amazon.com/images/I/51x-FeeHNHL._SY300_.jpg", "ProductID": "B00AQ4CVES"}}