{"Reviews": [{"Title": "Awesome - Lumix cameras always are", "Author": "TYLER H PERKINS", "ReviewID": "R3CREHZB6WTCMB", "Overall": "5.0", "Content": "As an all-around camera, this is perfect.  The zoom is just long enough for distance shots while travelling, and the lack of a digital zoom doesn't make a difference since no one ever wants pictures that grainy anyway.  It's small enough to fit in my pocket comfortably (without the included Panasonic case) whether I'm traveling or going out to the bars in the evening.While it lacks a touch screen, I can't imagine wanting one on a camera this size - the buttons are faster anyway. I also LIKE it's lack of a dozen-setting spin wheel on the top; no one I've ever met takes the time to switch modes when taking casual photos, and even if they do, 95% percent of the time you'll use the Auto or Custom modes anyway (both of which this camera has, obviously).If you like to carry a spare, the battery can be removed.  However, the package doesn't come with a default \"battery pack charger\".  While I'm sure one exists, this battery charges directly INSIDE the camera via the included USB cable, which can be connected to your computer, or plugged into an outlet using the wall jack attachment.  I actually prefer it this way since it's impossible to forget your battery.  Last February we went to Maccu Piccu and brought a friend's camera...but had left our battery plugged into the charger in the hostel.  Ouch.  Won't ever happen with this puppy.The direct HDMI-out seems nice too, although I haven't used it.And for those that don't know, Panasonic Lumix cameras having a fan-following.  More so than any other camera I've used in this price class, it's literally point and shoot.  No point, zoom, un-zoom, re-zoom, pause, brighten, then shoot.  The process is 1/4 of a second every time, regardless of lighting levels.  It turns on, auto-focuses and takes a CLEAR shot in less than 3 seconds.  And the shutter speed is super quick - so many cameras take ugly shots anytime moving/splashing water is involved, but not this guy.I recommend all cameras in the Lumix line.  The panasonic website has a good table comparing the differences between current models.", "Date": "February 14, 2013"}, {"Title": "This is a great camera!!!!", "Author": "Jane Holcomb", "ReviewID": "R1KIQHWG6SNM39", "Overall": "5.0", "Content": "This is the best little camera I have had. I have many small cameras and most of them are in the price range of above $300. I do have a large camera that I love but to large to carry around all the time. I ordered this one when I figured out I was on my 2 week Disney vacation with only the large camera. I already have many at home so I did not want to pay very much. I ordered this one because it had good ratings.I love this better that any of the other small camera that I have. The pictures could not be better. It was quick to come on and take the pictures. I did order 2 extra batteries because feedback said it used them fast. I only had to use the one batterie, it lasted all day with many pictures and turning the camera on and off all the time. I would charge it at night just in case.I would get this camera again anytime. I almost want to get another one just to have.", "Date": "February 27, 2013"}, {"Title": "excellent", "Author": "excellent", "ReviewID": "R2YK1GM8B8TQCY", "Overall": "5.0", "Content": "Excellent // I love it.. When I can I will purchase another one .. of course. Tanks for this purchase", "Date": "December 31, 2013"}, {"Title": "Nice camera especially if you need to take photos where people or things are in motion", "Author": "Scott Wilson", "ReviewID": "R3EPK8TLKCP6VW", "Overall": "4.0", "Content": "Love this camera which I bought for my wife. The different settings (some which have a very rapid fire point and shoot feature) allow us to take many candid photos of our son. Small, light and charges up rather quickly.My wife loves it and that's most important to me.Photos are very clear as well.", "Date": "November 6, 2013"}, {"Title": "Good little camera", "Author": "Pavane", "ReviewID": "R1KWL51EPSQQLF", "Overall": "4.0", "Content": "I took this camera away with me and came back with some pretty crisp pictures. It is easy to handle & lightweight. Would recommend this camera as to its price and overall use and features. I also found a great book on getting started with photography Digital Photography (Computer Training)", "Date": "July 25, 2013"}, {"Title": "Good camera", "Author": "Maria", "ReviewID": "R32MWD311C7JUC", "Overall": "5.0", "Content": "Great and simple use camera.  The menu sometimes is difficult to use.  Great quality for the price of the product.", "Date": "July 9, 2013"}, {"Title": "Excellent Point and Shoot!", "Author": "Ryan Jarvis", "ReviewID": "R2UZBVD9S631B5", "Overall": "5.0", "Content": "I bought the Lumix for a camping trip I took out to the West Coast. I thought I made a mistake by not really trying the camera before the trip, however the user interface is so intuitive that it took me no time at all to have it down. The camera does an excellent job with capturing color using the Landscape-mode or the \"autoscene\" mode. The panoramic mode also does a great job; rivaling the panoramic feature on my iphone-5. In between camps, we put on a ton of miles, so I was doing a lot of pictures from the back seat. It takes pictures very fast with almost no delay, which was helpful in getting pictures of mountains and the ocean between gaps of trees as we were going 70mph. They weren't blurry either! The zoom is also great without being blurry. One more thing I want to say is that it takes excellent video. We were hiking through the redwoods, and it's really difficult to capture how large they really are and how serene it is with just a photo. The videos are very good quality. The only slight downfalls of the camera is that it was little blurry in low light scenes and I have no idea how the 3D mode works. Overall, I couldn't be happier with the Lumix and I really recommend this camera. Great pictures, great features, great zoom, great video, great speed, and intuitive interface coupled with a price sub $200 makes this a must buy.", "Date": "June 6, 2013"}, {"Title": "Great purchase", "Author": "Alfonso Sandoval", "ReviewID": "R2U5SE36YWDO85", "Overall": "5.0", "Content": "Im very happy with my new purchase.Very good quality versus a good price.It takes great pictures and for the price is a very good itemI recommend this 100%", "Date": "May 29, 2013"}, {"Title": "Excellent", "Author": "Edmond", "ReviewID": "R2HT0QA23LJXP6", "Overall": "5.0", "Content": "This camera, is one of the best camera I have bought! It works well and also gives nice pictures! If you really looking for a small camera that works well, this is the one you need to get!", "Date": "May 17, 2013"}, {"Title": "Panasonic Lumix SZ7", "Author": "Andres Glez", "ReviewID": "RH2VOW35GLSX6", "Overall": "5.0", "Content": "What can you say about this camera, is out of range, the Panasonic Lumix SZ7 is very good, and the lens, excellent, no mistake here on the Panasonic, if you want a good camera at a low price, buy this", "Date": "May 9, 2013"}, {"Title": "Good basic camera", "Author": "Oleg", "ReviewID": "R397L771Y86B8E", "Overall": "4.0", "Content": "Very quick start. Reasonable pictures. Low light pics are so-so. Battery has to be charged in camera (no separate charger)All in all a good buy", "Date": "April 28, 2013"}, {"Title": "The Lumix SZ7 is a fast point and shoot digital camera.", "Author": "L. Porter \"TWA 1963\"", "ReviewID": "R3JJYN3ZW1PA7O", "Overall": "4.0", "Content": "I like this camera a lot. It is feature rich and has a good zoom lens range from wide angle to telephoto. Cycle time between pictures is very short, you will not miss many pictures waiting for the camera to process to a memory card. The body of the camera is small and will fit in a shirt pocket. The controls are where they need to be for easy handling. The LCD screen is bright and easy to see in daylight. The only reason I deducted one star was because the camera did not come with a stand alone battery charger.", "Date": "April 28, 2013"}, {"Title": "Great Camera", "Author": "Ron in San Diego", "ReviewID": "R3HSNCJBSFAP5F", "Overall": "5.0", "Content": "This is a super great camera for the price.  The colors are excellent, the speed of focusing and taking a picture is fanonimal.  I purchased it as a gift and now I regret not having given my $500 camera and keeping this one.  However, in all fairness. I do love the 15X Telephoto on mine, but 5X is more than needed in most all small camera shots.", "Date": "April 17, 2013"}, {"Title": "Great Buy", "Author": "Nick", "ReviewID": "R228049AS1KPRO", "Overall": "5.0", "Content": "This Camera is fantastic! It shoots great video and takes great pics! I got the Nikon S6300 first and was not happy with it so I returned it and got the Lumix SZ7, couldn't be happier with this camera! I coach wrestling and use this camera to tape my wrestlers matches and it is able to keep up with the speed of a match just fine without ghosting or judder. HD video Quality is great!", "Date": "April 16, 2013"}, {"Title": "Excelent!", "Author": "Hernan Petitti", "ReviewID": "R2441HSISA3DYD", "Overall": "5.0", "Content": "Lumix SZ7  met my expectations as described. Works like a charm!8GB SD RAM and Case are good and practical", "Date": "April 8, 2013"}, {"Title": "way faster shutter than old camera", "Author": "J_Leics", "ReviewID": "R34YQ8A023MN6E", "Overall": "5.0", "Content": "Wish we'd got one of these ages ago!It's such a great little camera, fab photos, quick shutter speed.Can't go wrong!", "Date": "March 1, 2013"}, {"Title": "Panasonic SZ7 Junk", "Author": "Blizzard", "ReviewID": "R3EF9F3MF6QTKM", "Overall": "1.0", "Content": "I took 5 pictures with this camera and then turned it off, the lens did not retract, I turned it back on and then off again, the lens would not retract.  I turned it on and tried the video and then turned it off, the lens would still not retract, I even took the batty out and tried a new one and then tried to turn it off and still it would not retract.  ( DEFECTIVE ).The few pics I took 3 outside ( bright ) were good pics, the 2 I took inside somewhat darker were dark adn fuzzy, the video that I took was also outside and while not moving video was good, when I moved or panned to the side it became dizzing and jittery.Maybe if I had more time with the camera, I could have adjusted the indoor pics. I would NOT recommend this camera even without the Defective lens problem.", "Date": "June 12, 2013"}], "ProductInfo": {"Price": "$259.99", "Features": "Screen Size: 3\"\nScreen Features: Intelligent LCD with 460K dots\nMegapixels: 14MP\nImage Resolution: 4320 x 3240\nOptical Zoom: 10x", "Name": "Panasonic DMC-SZ7K 14-Megapixel Digital Camera | Black", "ImgURL": "http://ecx.images-amazon.com/images/I/51CFJEQXuNL._SY300_.jpg", "ProductID": "B00AHJDNIK"}}