{"Reviews": [{"Title": "Love it", "Author": "Teresa A. Maurer", "ReviewID": "R3UPF4W3KZ3LYC", "Overall": "4.0", "Content": "This is a great camera. The menu is so easy to use and in a convenient location. It takes great photos. I love all the options for shooting which includes pet mode and mirror.  So many fun options on this camera.  I highly recommend this camera. Great 24x zoom and very light weight.  It was shipped quickly and as promised. Great company to buy from.", "Date": "December 11, 2012"}, {"Title": "Ok Camera!!", "Author": "Charlett M.", "ReviewID": "R1ONJXXQR4WZKS", "Overall": "3.0", "Content": "The camera is ok, nothing great!! I ended up giving the camera to my 13 yr. old daughter, she loves it!", "Date": "December 12, 2013"}, {"Title": "buena camara, la caja en que vino lo protegio muy bien", "Author": "junior vicioso", "ReviewID": "R23ODYZT2KZF6", "Overall": "4.0", "Content": "exelente camara muy funcional tengo 7 meses con ella y me a funcionada muy bien, doy 4 porque el zoon debes en cuando me falla", "Date": "March 28, 2013"}, {"Title": "overall, very pleased", "Author": "Kaylene Powell", "ReviewID": "R159LJPZV13T7C", "Overall": "5.0", "Content": "Though the shipping worker who handled the camera did so a bit roughly (as it was well-padded in one part of the box but not on the side the lens of the camera was facing against) so that side of the gift packaging was scuffed inside the box, the camera itself was in good shape and it works nicely.  what I like best is how it takes some really nice clear shots whether or not I'm using the flash, even when my hand wasn't totally still.  I really like the pop up flash too--easy to put up and down.  also, having all of the items together in one box made this purchase very convenient.", "Date": "January 10, 2013"}, {"Title": "Lovin' this camera so far", "Author": "Laura Kearns", "ReviewID": "R163HLQMCKXNL0", "Overall": "5.0", "Content": "This camera came in a beautiful wooden presentation box with a slide glass topper. Makes a beautiful gift! The camera itself is actually plastic, even tho it looks metal. But so far the camera works beautifully and takes great quality pictures.", "Date": "December 23, 2012"}], "ProductInfo": {"Price": "Unavailable", "Features": "IN THE BOX:\nOlympus SZ-12 Digital Camera\nOlympus Camera Case\nPNY 4GB Memory Card\nUSB Cable and Charger\nAudio/Video Cable\nStrap\nLithium-Ion Battery\nInstruction Manual and Software CD\n1-Year Limited Warranty", "Name": "Olympus SZ-12 Digital Camera (Red) Gift Set Bundle With Case + PNY 4GB Memory Card", "ImgURL": "http://ecx.images-amazon.com/images/I/31JlXQF91nL.jpg", "ProductID": "B00A0P3T2Q"}}