{"Reviews": [{"Title": "17,500 miles traveled", "Author": "A.S.", "ReviewID": "R2ITZXZGDWXLLW", "Overall": "4.0", "Content": "This is a great camera for fun outside activities. It was used in salt water, pool water, waterfalls, and the beach. You can take it everywhere with you during a vacation or outing without worrying about it breaking.  I had it in my damp swimsuit pocket for hours and it worked great every time I took it out to snap off a picture.  It worked well covered in sand, tanning lotion and dry salt Crystals.It was odd to rinse the camera off in the sink to clean it.  I suggest this is done and the camera left to dry before you open any of the compartments.  Also be sure to clean the rubber seals well when you re close the doors. The battery life is enough to keep you shooting pictures for the day.The camera is heavy, but it is designed to be rugged.  The indoor and low light picture quality is grainy.  The Auto setting has trouble triggering the flash.In all this camera is perfect for an out door camera. It will go on all your adventures and serve you well.", "Date": "June 15, 2013"}, {"Title": "Nice photos, but video makes hammering sound", "Author": "Hummingbirds", "ReviewID": "R2C52A7O70B5MQ", "Overall": "3.0", "Content": "We purchased two of these (in different colors) -- one from Amazon, another one from Walmart. The wallyworld one already went back. They both have the same problem. The video (while very high quality) has an issue with the audio. There is a constant annoying hammering noise in the background of every video, especially when panning. It doesn't seem as loud when keeping the camera still, but move it a little and you will hear the clicking of the little guy with the jackhammer who apparently lives inside. We've tried playing with the settings, changing everything possible, and problem still remains. So it has nothing to do with settings, the battery, or even the SD card. This is definitely a defect in the Olympus TG-830 cameras. It is such a shame too, because the photos are very good, and the video (aside from the audio) is very good as well. I also loved the fact that it is a waterproof camera that is built to be rugged. I just wish the video was better on it. Maybe they will fix this in the next version. If you plan on only taking photos, you would be happy with this camera. But I would not recommend this camera to anyone who wants to capture their priceless memories onto video (at least not if you want audio to go with it!).UPDATE: 8/14/13 - After returning the defective ones to Amazon and Walmart, we ended up purchasing one from our local professional camera shop. I had the chance to actually test drive it before buying. And lo and behold, no hammering noise in the video!!! So we finally got a good one. I guess it just depends on where you buy it and which lot they received. After using this camera on vacation, we love it!!! It takes great photos, underwater and above. The video is also very good (both underwater and above). Just make sure underwater you are using one of the underwater settings as it will come out with much better colors underwater. I would really recommend this camera, but ONLY if you can test drive the one you are buying first to make sure it does not have the audio defect.", "Date": "July 13, 2013"}, {"Title": "An impressive, tough camera", "Author": "Steve B \"Mac User\"", "ReviewID": "RSMU2GI2Z3IJR", "Overall": "5.0", "Content": "When I bought this I was mostly looking for an alternative to the Hero, mainly because I didn't want 180° fish-eye, and wanted something with more versatility than just dedicated use, attached to my helmet. When I received it and started looking into the operation of the camera, trying things out as I went, I was quite pleasantly surprised with the features, quality, speed, and versatility.It DOESN'T come with an SD card, which is probably good since I always replace the cheap cards with something of size and speed that works for me. I bought a SanDisk Extreme 32 GB for it, and it works great! The camera uses internal memory for burst mode, then transfers to the SD card, transparent to the user. It records 1080 HD at 60 frames/ second in normal mode, but if using the 120 FPS mode to create slowmo, it rolls back to 720P HD.There are built-in modes that provide color and other corrections for underwater shots, snow (very bright) conditions, and many others, including night pix. The optical image stabilization works very well for me since I have a twitchy hands. I look forward to my vacation to try out the camera as a helmet cam. It weights in just under 8 ounces.If you want a dedicated camera designed for sports activities, then the Hero 3 Black would probably be better (especially for diving!), but at $400, the Hero is a significant investment. This camera will do 90% of the job at 70% of the cost, with the added benefits that come with a small Olympus.Picture quality is outstanding and movies are awesome.This is a preliminary review. After my vacation where I plan to use it as a helmet cam while mountain biking and river rafting in Moab, UT, I'll update this with any issues I've uncovered. If there are none, then this review will stand, with a 5 star rating.", "Date": "June 6, 2013"}, {"Title": "Not only rugged but packed with awesome features.", "Author": "Kyle \"cylem\"", "ReviewID": "R1LKD5EYZ2GXCY", "Overall": "4.0", "Content": "I had thought about looking around at a rugged camera after going on a canoe trip. I was looking around at the Fuji Film and the Nikon models and they seemed pretty good. I had loved the look of the Olympus TG-2 but it is a bit pricey. I also liked that the TG-2 had a f/2.0 aperture which is miles ahead of pretty much any other rugged camera.I looked at what else Olympus had and the TG 830 looked pretty good, and was priced well too. I ended up choosing it over the TG-2 and the other cameras because it has the best zoom (5x optical, 10x SR zoom), It has the most video feature including 720p 120fps, 60I 1080p, and some other fun shooting modes. It if I saw correctly can take the fastest burst shots, as well as the functioning, shot to shot etc speed seemed to be as fast or faster than the others.So now that I have it i'm very satisfied. The controls are very easy to use (MUCH easier than my previous canon 520hs).Controlling the settings on the camera is very straight forward and I havn't really had to question anything at all.. The Camera feels a bit awkward in the hand, it seems a bit large but I think it is just me getting used to it.Video modes I really love, firstly the 720p 120fps is awesome and fun to use. However one drawback is  the picture darkens down in 120/240fps mode and with the low aperture it makes it hard to get a good video without some decent light (This is mostly true for every high speed video camera though). There is also the ability to take photos in the video, and a mode that automatically takes photos at a set interval during shooting.It has the magic art filters which some are honestly kind of fun I have to admit. There is also something I like alot, a handheld night mode which optimizes everything for shooting a picture during very low light without a tripod, It's nice to have it right on the mode wheel for easy access.The zoom is fairly good with the SR enabled, (though you must have it at 16mp for tha to work). As well you can zoom during video recording as well.I haven't tested the waterproof of it yet but I'm sure I will in due time. I reccomend this to anyone who wants a rugged or an extremely fast camera as well!", "Date": "July 21, 2013"}, {"Title": "Best camera EVER, hands down. Let me tell you why...", "Author": "Emma Johnson \"ExploreLiveLove\"", "ReviewID": "R3QYKQPRBFHL8F", "Overall": "5.0", "Content": "I must say this line of cameras are the best I've ever owned, hands down. I had the first model that came out to go to Costa Rica with. Survived being dropped, stepped on, sat on, cold weather, hot weather, pools, and oceans. After 4 years, I had dropped the camera while one of the little doors was open and it bent the door. It still worked, so I took it scuba diving in Bali and after about an hour in the water the camera died. I took it to the surface only to find it flushed with water - gutted. I dried it out in rice for several days, and although it would turn on again it was never the same. Bought the new model and haven't looked back. I've used it all over the world and in several pools/oceans/rivers and has still provided like my old model :).One more story that will build your confidence on this product:I had bought my brother one for his birthday. He studies fish and is an outdoorsman to the max, so he's in and around rivers and rocky terrain all the time. One day he had dropped his camera in the river, and because it was a deep and quick moving river, they couldn't find it. Two years later, they were diving the same river and actually found the camera. The camera still worked!!! It took great photos, all seals were still in tact and working great, and the only \"problem\" with the camera was that the blue color had worn off in some areas. I could not believe that thing survived for 2 YEARS! I would highly recommend these Tough Cameras to anyone who may be looking for an outdoor camera, a diver/snorkeler, a snow border, or a person that tends to be hard on products ;)", "Date": "December 1, 2013"}, {"Title": "Just what I expected and maybe more.", "Author": "Jordan Iliev", "ReviewID": "R22EHUSAUMIOJN", "Overall": "5.0", "Content": "Solid construction, excellent picture quality and very good video quality. This of course  is the result in shallow water or in open air. At two meters depth the light is not enough and some colour noise appears.", "Date": "May 3, 2013"}, {"Title": "good camera", "Author": "Jeff", "ReviewID": "R2CJGLRJYHJPT7", "Overall": "4.0", "Content": "It does the job of being 'tough' which is why I chose this guy. However, I'm not happy with how long it takes to process the image and get ready for the next shot. good image quality and easy to use. No full manual settings, which I would have prefered", "Date": "July 22, 2013"}, {"Title": "Great waterproof camera.", "Author": "Amazon Customer", "ReviewID": "R1ASTJQY744HLC", "Overall": "5.0", "Content": "I own three other waterproof cameras (Pentax, Samsung, & Kodak) but the Olympus beats them all. Both photos and video are the best of any of them. Underwater videos are very clear.  There are 4 underwater scene modes, one of them being an underwater macro mode. The case that I found that fits this camera perfectly is the Tamrac 3814 case.", "Date": "June 26, 2013"}, {"Title": "Not so Tough or shockproof", "Author": "mom of 4", "ReviewID": "RTCMYS1LBNYNR", "Overall": "1.0", "Content": "<!--\n\nfunction fp_resizePlayerSpace(nsPrefix,w,h)\n{\t\n  try {\t\n    var ifrm = parent.document.getElementById(nsPrefix + \"movieFrameID\");\n    if (ifrm) {\t\n        var h2 = h + 35;\n        ifrm.style.height = h2;\n      }\n    } catch(err) {\n \n    } \n\n\n  if (h > 0) {\n      document.getElementById(nsPrefix + \"clipDiv\").style.height=h+\"px\";\n      document.getElementById(nsPrefix + \"videoPlaceholder\").style.height=h+\"px\";\n  }\n  else {\n      document.getElementById(nsPrefix + \"clipDiv\").style.height=\"\";\n      document.getElementById(nsPrefix + \"videoPlaceholder\").style.height=\"\";\n  }\n  document.getElementById(nsPrefix + \"flashcontent\").style.height=\"100%\";\n}\n\nfunction fp_rewriteDiv(nsPrefix,divName,html)\n{\t\n    document.getElementById(nsPrefix + divName).innerHTML=html;\n}\n\nfunction embeddingPopup(nsPrefix)\n{\n  alert(\"placeholder function for embedding code\");\n}\n-->\n\n\n<!--\n\nfunction cv_moSKVUXZDQV81XembeddingPopup(){\t\nalert(\"Embedding code will be displayed here.\");\n}\n\n-->\n\n\n\n\n\n\n\n\n\n<!--\nfunction cv_moSKVUXZDQV81Xrefresh_preplay() {\n\ndocument.getElementById(\"cv_moSKVUXZDQV81XchiDiv\").innerHTML = document.getElementById(\"cv_moSKVUXZDQV81XhiddenPre\").innerHTML;\n};\ncv_moSKVUXZDQV81Xrefresh_preplay();\n\n-->\n\n\n\n\n\n\n        // <![CDATA[\n\nvar cv_moSKVUXZDQV81Xso;\t   \n\n\nfunction cv_moSKVUXZDQV81XloadSwf_Core(swfLocation, swfWidth, swfHeight, flashVersion, bgColor, swfParams, flashParams, embedAttributes) {\n\n  try {\n      cv_moSKVUXZDQV81Xso = new SWFObject(swfLocation, \"cv_moSKVUXZDQV81XAMPlayerProd\", swfWidth, swfHeight, flashVersion, bgColor);\t   \n\n      for (var v in swfParams) {\n        cv_moSKVUXZDQV81Xso.addVariable(v, encodeURIComponent(swfParams[v]));\n      }\n      for (var v in flashParams) {\n        cv_moSKVUXZDQV81Xso.addParam(v, flashParams[v]);\n      }\n      for (var v in embedAttributes) {\n        cv_moSKVUXZDQV81Xso.setAttribute(v, embedAttributes[v]);\n      }\n\n      cv_moSKVUXZDQV81Xso.addVariable(\"swfEmbedTime\", new Date().getTime());\n\n      var agt = navigator.userAgent;\n       \n      var reFirefox = new RegExp(\"firefox/\", \"i\");\n      var regx = agt.split(reFirefox);\n      var ffVersion = 8;\n      if (regx[1]) {\n          var pts = regx[1].split(/[.]/);\n          ffVersion = parseFloat(pts[0] + \".\" + pts[1]);\n      }\n      var minorVersion = parseFloat(navigator.ap);\n      if ((navigator.appVersion.indexOf(\"Mac\")!=-1) || (ffVersion < 1.5)) {\n          cv_moSKVUXZDQV81Xso.setAttribute(\"height\", swfHeight);\n          cv_moSKVUXZDQV81Xso.setAttribute(\"width\", swfWidth);\n          cv_moSKVUXZDQV81Xso.addVariable(\"oldFirefox\", \"1\");\t     \n      }\n\n      if (cv_moSKVUXZDQV81Xso.write(\"cv_moSKVUXZDQV81Xflashcontent\")) {\n          fp_resizePlayerSpace('cv_moSKVUXZDQV81X', \n                               320, \n                               283);\n      }\n      else {\n          var nsPrefix = 'cv_moSKVUXZDQV81X';\n\n          fp_resizePlayerSpace(nsPrefix, 0, 0);\n          fp_rewriteDiv(nsPrefix, \"flashcontent\", '<br/>To view this video download <a target=\"_blank\" href=\"http://www.macromedia.com/go/getflashplayer\" target=\"_top\">Flash Player</a> (version 9.0.115 or higher)');\n      }\n  } catch(err) {\n      fp_resizePlayerSpace('cv_moSKVUXZDQV81X', 0, 0);\n  }\n  return false;\n}\n\n\n\nfunction _cv_moSKVUXZDQV81XloadSwf(movieID, playerVersion) {\n    var swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/20120510035744301/AMPlayer._V148501545_.swf\";\n    var swfWidth = \"320\";\n    var swfHeight = \"100%\";\n    var flashVersion = \"9.0.115\";\n    var bgColor = \"#FFFFFF\";\n\n    var swfParams = {};\n    var flashParams = {};\n    var embedAttributes = {};\n    swfParams.amazonPort = \"80\";\n    swfParams.allowFullScreen = \"true\";\n    swfParams.telemetrySubPageType = \"VideoReview\";\n    swfParams.nsPrefix = \"cv_moSKVUXZDQV81X\";\n    swfParams.locale = \"en_US\";\n    swfParams.logUrl = \"gp/mpd/l\";\n    swfParams.canResize = \"1\";\n    swfParams.autoPlay = \"1\";\n    swfParams.sessionId = \"000-0000000-0000000\";\n    swfParams.marketplaceID = \"ATVPDKIKX0DER\";\n    swfParams.salign = \"LT\";\n    swfParams.preset = \"detail\";\n    swfParams.mediaObjectId = \"m3BVFJSKCV6HMO\";\n    swfParams.autoPlayTimer = \"\";\n    swfParams.mediaObjectIDList = \"m3BVFJSKCV6HMO\";\n    swfParams.playIsUserGenerated = \"1\";\n    swfParams.enableShare = \"0\";\n    swfParams.permUrl = \"gp/mpd/permalink\";\n    swfParams.telemetryPageTypeID = \"RTCMYS1LBNYNR\";\n    swfParams.xmlUrl = \"http://www.amazon.com/gp/mpd/getplaylist-v2/m3BVFJSKCV6HMO/000-0000000-0000000\";\n    swfParams.amazonServer = \"www.amazon.com\";\n    swfParams.scale = \"noscale\";\n    flashParams.allowFullScreen = \"true\";\n    flashParams.salign = \"LT\";\n    flashParams.bgcolor = \"#FFFFFF\";\n    flashParams.allowScriptAccess = \"always\";\n    flashParams.quality = \"high\";\n    flashParams.wmode = \"transparent\";\n    embedAttributes.title = \"Flash Player\";\n\n    if (movieID){\n      if (playerVersion == '3'){\n        swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/20120510035744301/AMPlayer._V148501545_.swf\";\n        swfParams.mediaObjectIDList = movieID;\n      } else {\n        swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/legacy/20101014901/AMPlayerProd._V197491872_.swf\";\n      }\n      swfParams.xmlUrl = \"http://www.amazon.com/gp/mpd/getplaylist-v2/\" + movieID + \"/000-0000000-0000000\";\n      flashParams.wmode = \"transparent\";\n      swfParams.autoPlay = \"1\";\n    }\n\n    if (document.getElementById('cv_moSKVUXZDQV81Xduration')) {\n      document.getElementById('cv_moSKVUXZDQV81Xduration').style.display='none';\n    }\n    cv_moSKVUXZDQV81XloadSwf_Core(swfLocation, swfWidth, swfHeight, flashVersion, bgColor, swfParams, flashParams, embedAttributes);\n\n  return false;\n}\n\nfunction cv_moSKVUXZDQV81XloadSwf(movieID, playerVersion) {\n   return _cv_moSKVUXZDQV81XloadSwf(movieID, playerVersion);\n}\n\n\n\t\n\t\t// ]]>\n\t\n\n<!--\n\nfunction cv_moSKVUXZDQV81XnewHeight(h)\n{\t\n    fp_resizePlayerSpace('cv_moSKVUXZDQV81X', 0, h);\n}\n\nfunction cv_moSKVUXZDQV81XresetPlayer(w,h,bw,cc) {\n  cv_moSKVUXZDQV81XnewHeight(h);\n\n  cv_moSKVUXZDQV81Xso.addVariable(\"resetBandwidth\", bw);\n  cv_moSKVUXZDQV81Xso.addVariable(\"cacheCode\", cc);\n  cv_moSKVUXZDQV81Xso.setAttribute(\"height\", h);\n  cv_moSKVUXZDQV81Xso.setAttribute(\"width\", w);\n  cv_moSKVUXZDQV81Xso.write(\"cv_moSKVUXZDQV81Xflashcontent\");\n}\n\n-->\n\n\n\n\n\n\n\n\nvar cv_moSKVUXZDQV81XRollOverImg = new Image();\ncv_moSKVUXZDQV81XRollOverImg.src = \"http://ecx.images-amazon.com/images/I/91B%2Bl-SwIhS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play-active,BottomLeft,130,-12_CR0,0,0,0_.png\";\n\nvar cv_moSKVUXZDQV81Xpreplay = document.getElementById('cv_moSKVUXZDQV81XpreplayImageId');\nif (cv_moSKVUXZDQV81Xpreplay) {\n  cv_moSKVUXZDQV81Xpreplay.onmouseover = function() {\n    cv_moSKVUXZDQV81Xpreplay.src = \"http://ecx.images-amazon.com/images/I/91B%2Bl-SwIhS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play-active,BottomLeft,130,-12_CR0,0,0,0_.png\";\n  }\n  cv_moSKVUXZDQV81Xpreplay.onmouseout = function() {\n    cv_moSKVUXZDQV81Xpreplay.src = \"http://ecx.images-amazon.com/images/I/91B%2Bl-SwIhS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play,BottomLeft,130,-12_CR0,0,0,0_.png\";\n  }\n  \n  \n  var node = cv_moSKVUXZDQV81Xpreplay.parentNode;\n\n  var cv_moSKVUXZDQV81XcurrentClick = node.onclick;\n  node.onclick = function () {\n    var head = document.getElementsByTagName(\"head\");\n    if (head[0]) { \n      var logTag = document.createElement('script');\n      logTag.type = \"text/javascript\";\n      logTag.src = \"/gp/customer-media/du/log.html?ie=UTF8&p=CustomerImage&s=CustomerVideoPlay\";\n      head[0].appendChild(logTag);\n    }\n\n    if (cv_moSKVUXZDQV81XcurrentClick) {\n      return cv_moSKVUXZDQV81XcurrentClick();\n    }\n  }\n}\n\n\n\n\n Length:: 0:05 MinsI only had the camera for 3 months and my 9 year old dropped it from 3' to the floor. The silver piece around the lens is PLASTIC and cracked, then fell off. It's not chrome or metal. Now that I really am looking at the whole camera after that happen... it has a lot of plastic parts on it. Right on the camera states Tough, Shockproof to 7ft, and Waterproof. Are they kidding me!!!! This camera is no way Tough and Shockproof. That is false advertising indeed.  I added the photo of it in the customer images also here is the image link http://www.amazon.com/gp/customer-media/product-gallery/B00AQ2BVQE/ref=cm_cr_dp_cust_img_see_all_txt", "Date": "April 1, 2014"}, {"Title": "Great both in and out of water", "Author": "Jaye Stone", "ReviewID": "R2BJTE4004OEPG", "Overall": "5.0", "Content": "I've had several waterproof cameras over the years, this one takes great pictures both in and out of the water.", "Date": "June 30, 2013"}, {"Title": "More Camera Than I Need", "Author": "Dubbie", "ReviewID": "RS4HG8VRZEEZJ", "Overall": "4.0", "Content": "I have always liked Olympus Stylus cameras.  This one has way more options than I want or need.  The viewfinder is nice and big.  The manual leaves something to be desired.....no index, e.g.  Price for all I got, I think, was fine.  If you love gadgets and bells and whistles, this camera is for you.", "Date": "July 25, 2013"}, {"Title": "Pretty good camera, only down side is the hammering noise in video playback.", "Author": "S. Klein", "ReviewID": "RVNF29D8C3FON", "Overall": "4.0", "Content": "Got my TG-830 yesterday, took it out of the box, put in the battery and memory card, fired it up and took some pretty good pics! Then I tested out the video in 1080p and it looked great!.... only one problem (that I've noticed thus far), I got the annoying hammering/clicking noise in my playback of the test video. From what I understand, It's due to the AutoFocus of the camera during recording (you can hold the camera to your ear and hear it clicking even when not recording) and the audio picks up the clicking from the AF. This issue has apparently plagued this model and others in the Olympus family. Now here's the kicker! Some have had this issue and some have not (their cameras work flawlessly). So I called Olympus support and some foreign dude told me that they have never heard of such issue (yeah right!) and told me to send it in for repair. So pretty much, I'm going to exchange this camera for another one and pray that it doesn't have the same problem. I'll update as soon as I get a replacement and see if that fixes it.UPDATE 09/21/2013Received my replacement camera yesterday and tested it out, unfortunately, the hammering noise still remains in the video playback. It seems in the replacement camera that it's not as bad though. I'm going on vacation in 10 days to the Bahamas, so I'll see how well it really performs and rate it accordingly. That will be the determining factor if I keep this camera or send it back. I'll update again when I get back.", "Date": "September 19, 2013"}, {"Title": "Olympus TG-830 Camera - causual/amature photo user review.", "Author": "Rob Q", "ReviewID": "R2X1GPFZJCAX2X", "Overall": "4.0", "Content": "This is my second Olympus tough camera. My first one is a SW1030 and is still working fine but is about 8 years old. I bought this one to take over the duties of photo taking on our trips. I did not hesitate buying Olympus given the experiences with my first one. It survived countless trips snorkeling, swimming haning on the beach and in tropical humidity. A few drops and being sat on countless times.I have the TG-830 for just over two weeks and have been experimenting with the various functions in varying conditions. As with my other Olympus I am very impressed with the capabilities of these point and shoot cameras. But like all small point and shoots has some limitations. I will try to lay out my findings in short points for ease of reading.1. Picture quality is superb just as many professional photo website reviews have noted as well. (not sure what the reviewers on here that say it takes crappy photos have been doing but it is not the camera.) I have displayed the pictures on my 55 inch tv and do not see any graininess or pixilation.2. low light photos are good, and the hdr mode makes the pictures very well balanced, but works best on non moving subjects. they are far superior to the ones i got from my other camera.3. The flash is limited to nearby objects which is expected but works great, used it in restaurants for food photos and subject photos it does not over expose the center of the photo and does a nice job of highlighting the object of focus.4. Video works well have only played with it a few times, HD is smooth with no noise as noted by some reviewers. When changing zoom or when the distance to an object changes there is some minor noise created by the mechanisms but if there are other noises going on they tend to over power this.  Slow mo was good but quality suffers slightly and is limited to only a few minutes of video at a time.5. Battery Life..... saw several posts of poor battery life. NOT true. I have been using the camera for 2 weeks on the initial charge. I have taken about 100 photos and 5 videos as well as reviewed and shown pics etc to people numerous times. I did however use an external charger (my original camera came with one and just happens to use the identical battery.) Yeh for me now I have 3 batteries.6. Camera functions are easy to use and access, although slightly different from my current one so I get a bit confused still on the buttons but if this is your first one they are easy to use and intuitive.7. Start up is quick and multi shots are acceptable, burst mode has not been tried yet.8. the 5x zoom is good and quality does not suffer,9. GPS seems to work well and finds its location quickly, i have not tried the landmark function. I generally have left the gps off.Overall I am extremely pleased with this camera. Photos are clear and sharp, has great functions, I would and have recommended it to many people. I think for the price Olympus makes by far the best all round tough cameras.I have no reservations about recommending this product.only 4 stars as like any point and shoot that does everything it has some short falls.", "Date": "February 20, 2014"}, {"Title": "Great digital camera for under water (and above)", "Author": "M. Farron \"Ringer\"", "ReviewID": "R1TQBT797O6JF1", "Overall": "4.0", "Content": "Just got the camera a few weeks back for an upcoming trip to Hawaii.Bought the separate floating strap to keep from losing it if dropped in water.Was nervous submerging it for the first time , but low and behold it was water tight.Took great stills AND video under water as well as above water.The battery lasted a whole day of snorkeling , etc.Very happy with the camera so far.Only thing that comes to mind that would be better is a 10X zoon, but that's hard to come by anywhere.Over all I'm very happy with selecting this Olympus TG-830.", "Date": "October 20, 2013"}, {"Title": "Sturdy and durable", "Author": "Erin \"avid reader\"", "ReviewID": "R2X5D3CE4A6QIG", "Overall": "4.0", "Content": "I bought these for my company, whose employees use cameras in the field and are pretty rough on them. So far they have been very durable as promised and we haven't had any issues. The pictures come out well. There are extra switches/locks to hold battery and card doors in place, but I think this is part of the waterproof/dustproof protection. Overall a good purchase.", "Date": "May 1, 2014"}, {"Title": "Defective Product", "Author": "Trent Davenport", "ReviewID": "R39ZMTMJ3OFDC6", "Overall": "1.0", "Content": "It worked fine for two months, then one day I went to turn it on and it would not power on with a fully charged battery. I thought maybe the battery was defective so I purchased another battery with a wall charger. Still would not power on. I called Olympus and they said it was covered under warranty. I sent everything in, including my receipt which proved when it was purchased. I called a few times to get an update on the repairs as it was a few weeks after I mailed it in. I was told the contacts where the battery were dirty and just needed to be cleaned and it would be mailed back to me within three days, they also verbally confirmed that my warranty covered everything. Three days came and went and my camera had not been shipped. I called again and was told that I had to pay as they didn't have any warranty information on file for my camera. I was in the process of moving across the country at the time and had my copy of the receipt packed away. I was able to retrieve my credit card statement through Best Buy which listed my purchased and I emailed them the copy. I was told that the camera would be there the Wednesday before I moved. It was not, so I called Wednesday and had them change the address to my new address. They had my Camera for around 8 weeks or so. I was not happy to say the least. I just received the camera back and the first time I used it, it worked fine. I just tried to power it on to take Easter Pictures of my children and the power button would light up, but everything on the camera is dead. It does nothing. I took the battery out and held the power button down for a while, thinking it may fix the problem, but when I put the batter back in, the power light instantly comes on and it stays on without powering the camera. Also, tried using the other battery I had as well, still did not function.  I am pretty sure that it is bricked. So, I have missed taking Christmas Pictures of my children and now Easter, and had to document their Holidays with my Ipads camera instead. I am not happy at all, and will be calling customer service on Monday....again. This problem has been ongoing since Christmas, and my money has been wasted. I am hoping they will fully refund me on the camera so I can purchase a different one.", "Date": "April 20, 2014"}, {"Title": "good camera", "Author": "ronj", "ReviewID": "R2OHE8PWOR6TV", "Overall": "5.0", "Content": "I am not a camera guy, I've lived a long while with an old school digital camera and was pretty happy. Got this for a birthday and I am more than pleased. It is very fast, I can actually get see something and take a picture immediately instead of waiting for it to turn on or charge the flash etc... Yes, it works under water; yes it is tough; yes the picture quality is amazing; yes I would recommend it. I have started using a camera a lot more in recent days :)", "Date": "April 7, 2014"}, {"Title": "Very cool camera", "Author": "Leif Halverson", "ReviewID": "R2FI6IWYJA0H0R", "Overall": "4.0", "Content": "I bought this camera to take pictures underwater snorkeling in Turks and Caicos.  I did not go snorkeling for a few days so most of the first pictures I took were above water and the pictures were very good especially the sunset special setting.  Panorama pictures were hard to take and turned  out with strange blue artificial color.  However I only tried it a few times so I am not sure if I can blame that on the camera or my inexperience.  I practiced underwater before going snorkeling and had a lot of troubles getting good pictures underwater.  Make sure you read about the use of the different types of flashes and underwater special settings when using underwater.  Macro seemed to be the best.  When I figured out the flashes most of the pictures were amazing underwater.  One tip, if the water you are in is not that clear with sand granules or other types of things that the flash may reflect against do not use it.  In those cases I found that if there was good light it was better to not use the flash or use the the LED flash.  I am still learning how best to take the best underwater pictures but overall I took some great pictures when I did it right.  I am giving it only four stars because there are certain things like the pet photo options that make no sense as well as the fact that the manual was not that great about teaching me the best way to take underwater pictures.  Besides that if you want a camera that can take very good pictures above and below water once you figure out the camera then I definitely recommend this camera.  The best setting I found was the sunset setting on SCN mode.  I have gotten some of the best sunset pictures ever with this camera and I have a few other cameras including DSLR cameras.  It is also great because you do not have to worry about protecting it when you go from underwater to the beach to freezing temperatures.  One final thing, lots of people have mentioned a ticking sound with the movies.  I found that I did get a ticking sound when I did movies in lower light.  However, in good light the ticking sound was not present.  That is another reason why I give this camera four stars, but I care more about pictures so this is not that big a deal for me.  For the price this a dependable above water and underwater camera.  I write this review giving it four stars but I expect as I learn everything that it can do with this camera that  I fully expect that I will later give it 5 stars.  One last thing, some reviews mentioned poor battery life.  I took about 200 pictures underwater as well as videos in one day and still had battery life for sunset pictures in one day so I would say that the battery life is quite good.  If you make sure to charge the battery every night before taking pictures the next day for average people I think it is just fine.  In terms of complaints about the in camera charging, I did not find it a problem day to day.  I highly recommend this camera for anyone who wants a good to great camera for the average photographer above and below water.", "Date": "March 27, 2014"}, {"Title": "Excellent camera for all purpose!", "Author": "A. Niewerth", "ReviewID": "RY458YE9B56RH", "Overall": "5.0", "Content": "Bought it for my sun but I'm the one who is using it most. It is really \" bolt\". Used underwater for quite a long time (more than an hour) in a water park and no problem at all. It took me sometime to get how to adjust the \"one click\" shot as during vacations you do not want to think about each photo but after the \"learning curve\" I got it!. One thing Olympus could better is the flash adjustments and timing. It take quite a long time to shoot a second photo with flash after you've took one.", "Date": "February 6, 2014"}, {"Title": "Photo quality not that great", "Author": "Penelope Pepperpants", "ReviewID": "R3NAURF5I8DL1W", "Overall": "3.0", "Content": "We purchased this to replace another waterproof camera (Sony) that crapped out recently.  We really wanted to like this one, but the photo quality was much less crisp than our last one.  As you are preparing to take the picture everything looks super clear and crisp on the screen, but the second you take the picture everything turns slightly blurry.  We thought maybe it was just something about the screen, but sure enough when we uploaded the pictures to our computer they were slightly blurry.  It does seem that the photos taken in the absolute best lighting (outdoors, in good sunshine) were better, but in slightly less-than-ideal lighting (indoors, or cloudy skies) there was a blurry quality to all of the pictures.I know what you might be thinking, that it was some kind of \"user error\" like we weren't holding the camera still enough, but we are pretty avid photographers and have never had this problem with other cameras before.  Plus we tried the camera under many different conditions, different lighting, etc. and my husband and I both agreed that the quality just wasn't what we wanted.  I really think that the photo quality is quite a bit lower than others in this range, so we are returning it.", "Date": "March 5, 2014"}, {"Title": "Love it.", "Author": "Bobbie Womack", "ReviewID": "R2E00L7FVY62KE", "Overall": "5.0", "Content": "This is my 3rd Olympus Tough camera over the years. I would not have needed to buy a 3rd camera if the typhoon of Nov. 8, 2013 hadn't washed it away along with everything in our house.  If I ever find it I'm sure it'll still be usable. I like these cameras for their toughness and underwater feature.  Rain or shine I can take it out hiking, swimming, snorkeling, kayaking etc and not have to pamper it, make sure it's covered, or  be super careful with the camera.  It can handle where ever I go.  I also like the many different settings it has to capture any type of scene, on land or underwater.  Click and go!", "Date": "January 28, 2014"}, {"Title": "I don't like this camera...", "Author": "Paul Busman \"Whistle maker\"", "ReviewID": "R1TTIC5K5YQQ9Z", "Overall": "5.0", "Content": "I LOVE it!  I have a compact ultra zoom camera that I'm happy with, but with an upcoming trip to Mexico including snorkeling, we wanted to go waterproof.  The idea of something pocket size was appealing too.After much comparison shopping we ended up with the TG-830 and we couldn't be more pleased.  I'm not going to give a whole lot of technical critique.  Suffice it to say that this camera does all that we wanted it to do and much, much more.This was my first underwater photography apart from I'd done with a disposable film camera-- with disposable results!The pictures I took on the reef were really great, with natural looking color.  Hint for this and any underwater camera:  check the lens for adhered bubbles.  They are hard to see as your snapping pictures, but they'll show up when you view the results.Land based photography was terrific too.  I'm a nature fan and love taking close-ups.  This camera has a super macro mode which lets you get a couple of centimeters from the subject, making for some dramatic photos.  There's a quick and easy panorama mode which gave me great results at the Mayan ruins at Tulum.There are a lot of built in shooting modes such as fireworks, portrait etc.  I did most shooting on full automatic and was perfectly happy.  I wish the optical zoom was longer but realize that this would require a moving lens extending outside the camera body which would be impractical/impossible in a waterproof camera.  Can't overcome physics.  I did use the digital zoom which didn't give perfectly clear photos, as expected.  Still, for my purposes it's not bad.That's all that comes to mind at the moment.  In summary, if you're in the market for an inexpensive waterproof compact camera which offers a whole lot more, give this one a good look.", "Date": "January 20, 2014"}, {"Title": "Great Camera for beach and water vacations with the kids", "Author": "Kevin D.", "ReviewID": "R1EM858KJZGDL3", "Overall": "4.0", "Content": "I bought this camera for a Disney Cruise with my wife and two kids, and also to use during ski season.  I was leery of buying any underwater camera because all of the available models have at least one review that claims that it leaks water, and that the companies do not support the product.  I chose this one because of the number of features, including waterproof, shockproof, GPS, panorama mode, and HD video for the price of $199. The camera worked very well for the intended purposes.  We used it in the pool, in the ocean, dropped it in the sand, and onto the tile floor, all without any damage at all.  The camera did NOT leak any water despite taking over 700 pictures while wet.  We followed the directions to clean it after using it in the ocean, and then towel dried and air dried prior to opening the door to charge the battery.Our other Not-Water-Proof Camera is the Cannon PowerShot S110 (point and shoot model - not an SLR).  When comparing the two cameras, the Cannon definitely takes sharper pictures in all light conditions, but especially low light.  The Olympus can have some minor graininess when viewed at full resolution on our 24-inch Apple monitor, but it is very subtle.  I think the pictures of my daughter jumping into the pool looked great,  had good color and captured the memories that I was after.  I'm not sure that I would want this as my only camera, but I don't think it is intended for that purpose.  It really is made to use in the cold, in the water, and when you might drop it - all times when you would never bring your other camera.Overall, I am really happy that I bought this.  The pictures are great, the price is very reasonable for all of the features, and it captured great memories from the trip.  I would recommend you consider this camera if you are looking for a camera in this \"tough\", waterproof category.", "Date": "November 3, 2013"}, {"Title": "Excellent", "Author": "Stephen C Wecker", "ReviewID": "R3RUSGM2UGKPO8", "Overall": "5.0", "Content": "Camera works perfectly.  Refurbished was no problem.  Great gaskets on all points to prevent water intrusion.  This is a much better camera than my previous Nikon Coolpix.", "Date": "October 7, 2013"}, {"Title": "Everything and more.", "Author": "Wil Petrich", "ReviewID": "R3H1N74HPZ90H6", "Overall": "5.0", "Content": "Still learning all the new functions. A lot of Camera for the money. Hopefully it will be as durable as my old stylus which outlasted an 8 1/2 month trek in Africa.  (was stolen recently)", "Date": "July 13, 2013"}, {"Title": "Love it", "Author": "Jeffrey Groleski", "ReviewID": "R30DU615SYI8SG", "Overall": "5.0", "Content": "Got this for an anniversary present right before our belated honeymoon trip! Loved the underwater feature and that I can drop it without making the hubby too angry. Has tons of great settings and all of our pictures turned out great!", "Date": "July 11, 2013"}, {"Title": "Solid!", "Author": "Mark Scofield \"Scodog\"", "ReviewID": "RY6NI52XWJBYO", "Overall": "5.0", "Content": "I love this camera!  I am a Novice photographer but have been at it for 40 years.  This is my third digital camera.  I am happiest with it.  The menu is easy to digest and with a couple of reviews of the manual I feel right at home. The Olympus 3 photo manager that is included, imports and uploads my pics with ease.", "Date": "June 30, 2013"}, {"Title": "Love This Camera", "Author": "JackW", "ReviewID": "R2BAYLIXBVMRFU", "Overall": "5.0", "Content": "I had a Canon PowerShot SX1 IS that I loved.  After one too many outdoor shoots, the camera shot craps, literally.  I was told it either had sand in it (yep, was at the beach) or moisture condensed inside (yep, went from AC to humidity at lot).  Well, decided I needed a newer camera commensurate with my lifestyle.  The Olympus Tough Series is that.  The TG-830 is waterproof, shockproof, and freeze-proof.  And yes, I have tested all three.  In the past year, it's been fishing in Canada (and dropped in the Maramichi River), snorkling off the coast of Cozumel (great pics), and mountain biking in below freezing Missouri (great action video), and I've had zero problems.  It's significantly smaller than my old Canon (totally different cameras of course) and lighter.  Coupled with its toughness, I can carry it in my pocket when outdoors at all times...canoeing, hiking, fishing, biking, etc...and it's at the ready.  Just went canoeing a few weeks ago, and had in a zip pocket in my shorts while fording a stream.  No worries.  Most pic's are great, as are the video's.  Only knocks are the limited zoom (but to be expected with a fixed lens) and an annoying clicking sound when videoing.  Other than that, I love it...", "Date": "May 14, 2014"}, {"Title": "nice camera", "Author": "MaryLou P.", "ReviewID": "R2DJUMBDNYCBB1", "Overall": "5.0", "Content": "I have a real issue with dropping things; phones, cameras, etc.  I decided to try this waterproof, drop resistant camera this time.  It takes very nice pictures and is easy to use.  So far, no accidents.", "Date": "May 5, 2014"}, {"Title": "Love it", "Author": "Lorann Watts", "ReviewID": "RAWCW78REDA6U", "Overall": "5.0", "Content": "Being a grandmother, pictures are very important to me.  I love this camera.  In a recent trip to the water park with my grandkids, it proved to be as advertised...waterproof and durable!", "Date": "April 6, 2014"}, {"Title": "Great buy", "Author": "John M", "ReviewID": "RVEDAI2UHUJ7U", "Overall": "5.0", "Content": "We purchased this camera for our seven day cruise in the Caribbean. It was everything we needed and then some. I took some great pictures of my girls with it prior to our cruise and used the magic setting \"soft focus\". The pictures were beautiful and look just like glamour shots photos. The main purpose of this camera though was for the underwater capabilities. We used it while snorkeling in Cozumel, Roatan, and Grand Cayman. It took questions video of the coal reefs where I followed a school of fish, stingray, and an uncooperative baracuda. The battery held up every day except one. That was because we didn't have it on the charger the night before. We did purchase a 32 gig sd card though so we didn't run out of space. Little bit of overkill but worth the peace of mind. Overall I'm extremely happy we bought this camera. Great for all pics.", "Date": "April 4, 2014"}, {"Title": "so far so good", "Author": "gardener", "ReviewID": "R368RW66NDKBVX", "Overall": "4.0", "Content": "The camera looks good so far.  We've taken just a few pics on it and still need to read more of the instruction manual to find out the best settings for different scenarios.It doesn't come with an SD card, but order a good one to use in it- the 32GB  class 10 SDHC looks like it'll be good for quick picture upload and quick snapping of pics.We'll be trying out the waterproof later.  I'll have to add to my review after that to see how that and underwater pics and other pics turn out.We did order a set of batteries with a charger so we can have backup batteries ready and not HAVE to plug in the camera and miss out on pics while its charging.  We ordered them through Amazon and they're not the olympus brand, but still work in this camera.", "Date": "March 31, 2014"}, {"Title": "Nice", "Author": "David Halverson", "ReviewID": "RUAEAOL6L8M8A", "Overall": "5.0", "Content": "Hey, you want a camera that can do it all, from weddings to vacations, I recommend this camera.  Sharp bright pictures and easy to use.", "Date": "March 7, 2014"}, {"Title": "awesome", "Author": "Ashinezz", "ReviewID": "R21WPZ8A1SEAMQ", "Overall": "5.0", "Content": "I love how I can take really cool underwater pictures, and how it comes with nice filters. So far it hasn't made that clicking sound lots of other reviewer have complained about. Overall totally worth the purchase price.", "Date": "March 6, 2014"}, {"Title": "best camera ever purchased", "Author": "drewnoski", "ReviewID": "R3H3ZI36MAWTL8", "Overall": "5.0", "Content": "I bought this camera about 6 months for our honeymoon and we took it all over central America. It takes amazing video underwater and amazing pictures. Out of water it is just as good. It has plenty of options for photos and videos and overall it is extremely durable. I got a silicone gel case for it and I keep it in a pelican case with desiccant and spare batteries most of the time. I am very pleased with the life of the batteries as well. I keep 4 spares in my case in case we are on the road for a long time. I have purchased so many other cameras and they just don't compare. Don't be afraid to order this one.", "Date": "March 2, 2014"}, {"Title": "If you don't have one, a cruise is a great excuse to buy one...", "Author": "Topher \"lavasurfer.com\"", "ReviewID": "R26117PJG7IANV", "Overall": "5.0", "Content": "If you're going on a cruise, I highly recommend you get a rugged water camera for your trip. They are so much more versatile than an ordinary camera and you'll enjoy taking them places regular camera can't go (like the beach, waterfalls, and underwater). Just as I over-research cruise ports, I spent hours researching water cameras.  We wanted a camera we could indeed take everywhere, that took good pictures in and out of the water, and had a good optical zoom.We recently purchased the rugged Olympus Stylus TG-830 for under $200. Wow! that's a great camera for the money. It has lots of easy-to-use picture modes and the panoramic mode just takes your breath away.Here's why it's rugged: it's waterproof to 10m/33ft, shockproof to 2.1m/6.9ft, crushproof to 100kgf/220lbf, freezeproof to -10C/14F, and dustproof (which also means it keeps sand out).  It also has built-in GPS and e.Compass, 5x optical zoom, 10x enhanced (not fuzzy) digital zoom, and full 1080P Full HD Video.", "Date": "February 23, 2014"}, {"Title": "Better than expected.", "Author": "bru16", "ReviewID": "R524AORIZPV6E", "Overall": "5.0", "Content": "Purchased this Olympus camera  for a dive trip in Palau.  This device exceded all expectaions.The underwater video was outstanding recorded at 1080p.  Video on land was of equally high quality with great sound.  Spent several hours in the ocean with the camera to a max depth of 35-feet  and it’s water tight.An unexpected surprise were the extraordinary special effects (“Magic”) filters built into the camera.  The “Dramatic” filter really made the underwater pictures pop.  Very happy with this purchase.", "Date": "February 20, 2014"}, {"Title": "A good camera.", "Author": "Tim Crane", "ReviewID": "R24O5KFCV3EAIA", "Overall": "4.0", "Content": "This is my third TG, the two previous being 610's. Despite their durability, I only get about two or three years of use before they fry. Note, they each have suffered major abuse via bike crashes and my clumsiness, but performed well until the final blow. All have produced excellent images. My only issue with the 830 is that it does not have an auto lens cover, a great feature my previous TG-610's had. I use the TG when I cycle and hike, and prefer to carry it without a case in my pocket so I can pull it out for quick shots. Not having the lens covered when the camera is off and in my pocket can cause debris and or moisture to be on the lens. A small issue, but a hassle. I did not note the lack of this feature in the product description. Had I known the 830 lacked an auto lens cover, I would have ordered another 610. Let me add that I also take many photos in museums where flash is not allowed. The 830, like the 610, as amazing low light capability. A good camera.", "Date": "February 16, 2014"}, {"Title": "Really Great Camerea and I had researched alot", "Author": "Amanda", "ReviewID": "RGXUCDG6KFW7", "Overall": "5.0", "Content": "After reading several reviews, I decided for the money and the positive reviews I would go with this.We were headed to Bora Bora for two weeks and I wanted a good camera that I could use while snorkling.This performed better than I expected. I got great pictures both above and below water.The deepest I took it was 25ft , so I cant speak to how it would be if you were going to sue it for scuba.I do wish the battery life was a little longer and you can accidently hit video without knowing it, which will use up your battery.I would tell anyone to get this camera you will not be sorry.", "Date": "February 15, 2014"}, {"Title": "Simply stated: I am very pleased!", "Author": "Halo", "ReviewID": "R949AHYV6N4LM", "Overall": "5.0", "Content": "I'm starting out with a super rating after our first use of the camera while on a cruise. I took over 800 photos. The quality of the under water pictures is amazing. I was nervous about buying ANY water-proof camera because not one of them had perfect reviews and all of them had at least a few that stated that their camera had failed/leaked.I'm not one who is electronically savvy, and I always dread new electronic gadgets and having to learn them. I downloaded the over 80 pages of instructions with dread in my heart, but the reality is the camera is not difficult to use at all. I love all the features/settings and spent a good portion of my picture taking, experimenting and having fun with those.We spent a lot of time in water and the camera functioned great. In fact, while in Barbados, we were on a full day snorkel and the tour guide had the same camera. That made me feel like I had made a great decision. He said he had been through 10 water proof cameras over the years and really liked this one.So, at this point I am thrilled. If anything happens to change my mind, I will update this review. But for now, this camera has my recommendation.", "Date": "February 15, 2014"}, {"Title": "Works", "Author": "KMP100", "ReviewID": "R3251JQTONOTFZ", "Overall": "3.0", "Content": "This camera works as a good point and shoot and is fairly intuitive. It takes pretty good photos for a point and shoot and has some cute features. However there are two things which keep it from being a great product , 1) the clicking in the background of the video, and 2) it does not shoot raw. The clicking has ruined some video I had planned to use as part of a presentation, and the absences of raw means that you can't really blow up portions of the photographs. However it did get rained on and submerged in the ocean and it still works so that is a plus.", "Date": "February 13, 2014"}, {"Title": "Great camera for a vacation in Mexico - poolside and at the beach.", "Author": "JT", "ReviewID": "R3R1ZUNWW0SJBV", "Overall": "5.0", "Content": "I agonized for awhile about which underwater camera to get since I was going with some friends to Cabo for a week and thought it would be great to have something at the pool and beach - but if something went wrong, then would have no way to exchange it since we would be our of the country.  After reading the reviews decided to take the plunge and get this one - so glad I made the decision. Camera worked just fine, was waterproof - have some amazing photos now of our vacation in Mexico of pictures in the pool and ocean.  I read some online reviews from camera sites saying that the quality of pictures of other brands might be better, but in the end, I was concerned with the camera just working underwater in the first place, and this one did not disappoint at all.  Pictures were great as well and didn't think they needed to be better.", "Date": "February 8, 2014"}, {"Title": "Amazing little camera!", "Author": "Kate Furman", "ReviewID": "R80W2PLLQN8N5", "Overall": "5.0", "Content": "We purchased a different camera for one of our vacations and after one use it filled with water and had to be returned. So I was skeptical about water-proof cameras, but decided to give this one a shot. Took this camera snorkeling and hiking on a waterfall. Came back with some amazing pictures and videos and the camera is still dry. Not only does it take great pictures in the daylight, but at night and under water as well. Highly recommend this camera to anyone who wants to capture their vacation. Do not be afraid to get this wet, it will be just fine! We had it about 15 feet below water recording video and no problems at all. It says its shock-proof as well... did not want to test that feature, like the camera too much.", "Date": "February 3, 2014"}, {"Title": "perfect", "Author": "sara57", "ReviewID": "R1CYZB6Y4C3I6H", "Overall": "5.0", "Content": "after breaking countless cameras due to hiking, rain, beach camping, coffee, steam, and drops,,, this one has held up so far to all of that, and is actually a very high quality camera that I love. I used to have various Olympus and Canon cameras, it is safe to say that this camera is comparable to my old $500 Olympus that was topnotch back when 12mp were high, but the high def on this is NEXT to professional quality. great low light, great during concerts,fireworks,highspeed, just as it says. happy.", "Date": "January 15, 2014"}, {"Title": "Pugs4", "Author": "Bob", "ReviewID": "R1G1E2E7T4SUSO", "Overall": "5.0", "Content": "Fantastic camera, very waterproof. Bought this for scuba diving on a recent vacation. I got many great photos on all dives. The camera was in water everyday for several hours, had no problems, would recommend this camera .", "Date": "December 31, 2013"}, {"Title": "Hatch cover will open when in pocket", "Author": "Elizabeth McCullough", "ReviewID": "RC988QHR0N3ON", "Overall": "1.0", "Content": "The second, smaller hatch cover has latches on it that will open if inside a pocket with other items, thus letting water in and rendering the camera useless.", "Date": "December 18, 2013"}, {"Title": "Short on battery life...", "Author": "Eric", "ReviewID": "R6QM4ZX5HS8DH", "Overall": "4.0", "Content": "I've been using this camera for 6 months, I've used this underwater in the pool, lake, and ocean (note that I also purchased a strap that floats the camera - I highly recommended this if you are in deeper water). It's nice to get up close and personal even when watersports are involved.Pictures always seem to come out clear and there are some neat features you can choose (dynamic, fisheye, panoramic, etc.). Starts ups fast so you don't miss the moment. Video is easy with a one touch button - you don't need to switch over to video mode then back to picture mode. You can also take still shots while shooting video. Zoom is all digital but doesn't look bad. Size is manageable. The only area that I feel this camera falls short is the battery life. On our last trip, the ongoing joke was \"the camera says low battery\". I'm considering purchasing a spare. However, I'm still very please with my purchase.", "Date": "December 17, 2013"}, {"Title": "Excellent camera for general and underwater shots and video!", "Author": "Jackie Horton", "ReviewID": "R2UUVITEXA1LMV", "Overall": "5.0", "Content": "I love this camera!!!  I needed a waterproof camera for a kayaking and snorkeling trip to Baja and finally settled on this one, after much research and comparison.  Post-trip, I believe I made the right choice.  The underwater shots and video are great!  The camera worked beautifully!  I was sure to rinse it with fresh water after being in salt water.  Week-long shooting and with the extra batteries I bought, I never ran out of juice.", "Date": "November 27, 2013"}, {"Title": "Fabulous & Fun Camera!!", "Author": "Janice L Nikolai", "ReviewID": "R2A26HHUR0XQTF", "Overall": "5.0", "Content": "this camera is awesome.  takes fabulous pictures.  I bought it for the underwater capability but the many features it offers makes it an excellent all around camera too.  self framed panorama pictures.  don't worry about missing that fish, use the movie feature which can also capture stills and you've got it all covered.  and the pet feature is cool too.  no more pictures of the side of their head.  it'll take the picture when your pet looks at the camera.", "Date": "November 21, 2013"}, {"Title": "Clear as a DLS camera", "Author": "Lucia", "ReviewID": "R1YRD2DR1RKDJ5", "Overall": "5.0", "Content": "It has everything I imagined a camera could have. This pictures look like they were taken by a DLS camera. The water proof and shock proof area great bonus considering how rough I am on my gadgets. I work part time as a life guard and I take the camera with me in the water several times times. Take some time to learn how the camera works because if one are not using \"Auto\" one can have professional looking pictures just by tweaking the settings.", "Date": "November 5, 2013"}, {"Title": "Great Camera", "Author": "Jeremy", "ReviewID": "RX46ZRFU30K5F", "Overall": "5.0", "Content": "I bought this camera for a vacation at Lake Tahoe thinking I would be using it in the water but did not get a chance due to it being to cold.  But went hiking a lot and this camera did a great job in all aspects especially the magic feature on the camera for instance (Soft Focus, Dramatic, Pinhole, Water Color, etc.) took a lot of landscape photo's and they all came out great with the use of the Magic Feature and Auto.  Also bought an extra battery and wall charger so not to have to charge the battery in the camera thought that was kind of weird. I also checked CR and they rated it well too I would definitely refer this camera to a friend!", "Date": "October 2, 2013"}, {"Title": "Critical access door failure allowed water to destroy the camera", "Author": "Dr. James Williamson", "ReviewID": "R29XTGU14AML55", "Overall": "1.0", "Content": "Despite a double-lock system, the access door to the battery and sim card opened allowing water in that destroyed the camera.  The door that failed was properly locked before the failure.", "Date": "June 16, 2013"}, {"Title": "Okay, but could be better", "Author": "Sulsky Roony \"Sully\"", "ReviewID": "R23UERC24NB5B2", "Overall": "3.0", "Content": "This camera has a lot of potential, however it also has a couple of major drawbacks.Pros:- Nice features like video/picture combination and 360 degree panorama- Good photos when lighting is sufficient- Decent battery lifeCons:- Clicking/hammering sound in video playback. Reported to the manufacturer (Olympus) who responded that it is due to the auto-focus mechanism and the placement of the microphone. He refused to admit to the terms \"design flaw\", but said it was a potential issue with point-and-shoot cameras in general (not an issue that I've ever come across)- Photos are not great if there is less than ideal lighting", "Date": "November 5, 2013"}, {"Title": "must get!", "Author": "isabitz", "ReviewID": "R2CFS7XDF5AFM", "Overall": "5.0", "Content": "this camera is absolutely awesome ! my husband got it for me for our trip to panama and it was amazing , it did not dissapoint at all . it took pictures i  the ocean,pool,waterfall, humid air , my wet pocket after swiming. all of the pictures came out amazing . I am very happy .. i almost forgot i dropped it like 5 times ,as i am very clumsy thought for sure it had broken and nothing happened to it not a scratch .. i am in love with my olympus camera.", "Date": "July 7, 2013"}, {"Title": "Works well", "Author": "colashan", "ReviewID": "R1KDFVUJLNUKEO", "Overall": "5.0", "Content": "Bought this for my wife, so she has used it more than I have, but it seems to work really well, and is waterproof just as advertised.  We haven't dropped it yet, (and hopefully we won't), so not sure, first hand, of the shockproof claim.  The pictures look good, and there are many menu settings to choose from, so big thumbs up from what I can tell.", "Date": "July 1, 2013"}, {"Title": "Great image quality, easy to use", "Author": "Kristina McLaughlin \"frequent reader\"", "ReviewID": "R33TAYBXAW985L", "Overall": "5.0", "Content": "I've used this camera in Curacao and Hawaii with great results.  The images are pretty clear.  It is good above and below water.", "Date": "June 1, 2014"}, {"Title": "Great waterproof/shockproof option!", "Author": "sarahlaree", "ReviewID": "R1UDPPS4OAUFMY", "Overall": "4.0", "Content": "My family and I spend a lot of time boating, kayaking, hiking, and camping.  I always felt like I was missing a lot of great photo opportunities because I didn't have a camera I could bring on these types of trips.  When it was time for me to purchase a new point and shoot, I chose this one for just that reason: it can come with me everywhere I go!  It's been under water, on the water, in the sand, in the cold.  So far it can handle all the abuse I can dish out.It's quick and easy to switch between settings with the mode dial, which I really appreciate.  I've had digital point and shoot models before which were so complicated to switch between settings, you could easily miss good shots.Low light and indoor photos can be noisy; this camera is at its best when it's outdoors.  But, the hand held starlight setting for low light photos can make for some fun and interesting images.Overall, I would definitely recommend this camera -- I'm very happy with it.", "Date": "May 28, 2014"}, {"Title": "awesome camera", "Author": "Iain O'Brien", "ReviewID": "R1STLXYCWZ015D", "Overall": "5.0", "Content": "Very nice and easy to use camera. used it on the move while hiking, on a tomcar, in water, in the cold, etc. awesome picture and excellent battery life.", "Date": "May 26, 2014"}, {"Title": "This camera could fly", "Author": "Robert J. Pinner", "ReviewID": "R6Y1F2JP3GPYB", "Overall": "4.0", "Content": "As an average user I'm intimidated by all the options.  The TG830 has its control buttons well placed.  Being small it is not ideal for big fingers or gloved hands.  Like others I regret having to buy an SC card and battery charger, but I found 2 extra batteries plus charger for $10 on eBay. Also the camera is fairly heavy for convenient daily use, but one has to accept that as a trade-off for ruggedness. I wish it had an optical view finder to save battery, but few cameras offer that nowadays.", "Date": "May 26, 2014"}, {"Title": "Like it", "Author": "Ang", "ReviewID": "R3LZFDIL2AQB5V", "Overall": "4.0", "Content": "I wish it didn't have the bulk like my previous camera did. But it has all the features that I wanted. I needed to upgrade and this camera does me well.", "Date": "May 23, 2014"}, {"Title": "LOVE IT", "Author": "Deborah Johnson", "ReviewID": "R1TVFX70BKSBIM", "Overall": "5.0", "Content": "We bought it for vacation. It was wonderful. We read other reviews and bought and additional battery to keep changed so we would have double life! It was perfect for what we needed. our photos came out nice as well... water slides, splashes, beaches, underwater, etc held up great. Much better than I even expected.", "Date": "May 19, 2014"}, {"Title": "cant be mad at it", "Author": "Kathryn Geary", "ReviewID": "R1LFGPLQJ57YBX", "Overall": "5.0", "Content": "This camera did everything i could have hoped for. it performed perfectly in the water and had no issues with water leakage. the only minor problem i had was fogging on the lens. nevertheless, it worked like advertised.", "Date": "April 24, 2014"}, {"Title": "A good camera for an action vacation", "Author": "C. Tallman \"Geezer Geek\"", "ReviewID": "RYR3CFR04B5PF", "Overall": "4.0", "Content": "I bought this camera to use during a multiweek vacation in Hawaii.  It is rugged and waterproof.  Both of these features were tested multiple times during the vacation and the camera survived all.  I do believe the battery life is shorter than other cameras i have with similar capabilities and I don't feel the focus at infinity as crisp as I am used to, but other than that, it was flawless.", "Date": "April 23, 2014"}, {"Title": "Enjoyed using it in Hawaii!", "Author": "Clifford Kong", "ReviewID": "R2GSESS87SNRLL", "Overall": "5.0", "Content": "Takes great pictures and can be used in the water.  Even if you don't take pictures snorkeling, you will appreciate it during sudden rain or drizzle.  I was glad to have this over my regular digital camera.", "Date": "April 22, 2014"}, {"Title": "used in the carreibean", "Author": "Mike Brown", "ReviewID": "R1X36U2N2R3KJ8", "Overall": "5.0", "Content": "Loved the camera.worked well snorkeling in under ground rivers (cave snorkeling),the ocean and pools.Pics came out clear and videos did just as great.", "Date": "April 16, 2014"}, {"Title": "Water tight, but not great", "Author": "Craig Shuey", "ReviewID": "RIEL3FTG0ZW4T", "Overall": "3.0", "Content": "Awkward controls. Difficult to use under water. Pictures are okay, but not much better than my smartphone.  Seems a bit expensive for what you get", "Date": "April 13, 2014"}, {"Title": "Not impressed", "Author": "Bradley A Spaugh", "ReviewID": "R9GZQSA58FSG3", "Overall": "2.0", "Content": "The form factor and ruggedness are great but the photos are lousy.  I used to have a cannon power shot that took awesome shots but it was not waterproof and it got wet after 5 years of use and failed.  I thought this would be a great replacement but it fails miserably in the photo quality department.  There is no point to having so many megapixels if the result is a giant piece of junk photo.  People, do yourselves a favor and get a photo with an adjustable lens like the cannon power shot.  You will have much much better photos.  This one does not cut the mustard.", "Date": "April 6, 2014"}, {"Title": "Love it", "Author": "Alicia", "ReviewID": "RID9MPEM734K5", "Overall": "5.0", "Content": "I love it, though i Love every tough camera i buy lol Got to say though this one is probably my favorite so far, but i'm sure the next new updated one i get will be of course better maybe...", "Date": "April 6, 2014"}, {"Title": "Good camera - only one minor concern", "Author": "Chris", "ReviewID": "R252X4UHO4GZZO", "Overall": "4.0", "Content": "Great camera - easy to use, quality of pics are very good (for this type of camera).  Haven't tried out the waterproofing yet - hoping to do so.  The only concern was that it died very quickly while skiing in Vermont - despite saying it can withstand cold temps.  I think the wind cutting through my pocket might have made the battery significantly colder, so I've chalked it up to a fluke - but this was the only concern I had.  Overall, I really like owning this camera", "Date": "April 1, 2014"}, {"Title": "Great Camera.", "Author": "Sean R. Torpey", "ReviewID": "R1KTKQRWGDOOJS", "Overall": "5.0", "Content": "We buy this model for all our construction inspectors that are out in the field.  They seem to be able to take the punishment.", "Date": "April 1, 2014"}, {"Title": "Vey pleased", "Author": "RaNae Hendrickson", "ReviewID": "RYJHML4O68ZF7", "Overall": "5.0", "Content": "We went on a cruise to Mexico.  Took this camera in the water, sand. Used many of the features including the movie, zoom, panorama. We was very impressed with the quality and ease if operation and the results. We would highly recommend this camera", "Date": "March 31, 2014"}, {"Title": "Very good for the price", "Author": "DennisF6", "ReviewID": "R9I5POLNT20GI", "Overall": "5.0", "Content": "Good pictures for a compact camera under any conditions.  Great pictures while snorkeling!  I would recommend this camera to anyone needing underwater capability and an all around rugged camera.", "Date": "March 26, 2014"}, {"Title": "The best underwater/tough camera", "Author": "ShopperAdict", "ReviewID": "R277436W19ODWB", "Overall": "5.0", "Content": "This is my second olympus tough camera.  The first one lasted over 4 years, and I put that thing through hell.  It actually still works, but the screen has a crack.  Anyway, I've had this one for a few months now and I like it even more than my first one.  Nice grip, bright scree, double lock on the parts that open for the SD card, and the battery lasts, but I will probably get a second back up battery.", "Date": "March 26, 2014"}, {"Title": "Great Camera for Rough Users", "Author": "Janet Carroll", "ReviewID": "R1HXXT9OE54OL2", "Overall": "5.0", "Content": "I would recommend this product to anyone who travels where they are getting in and out of boats, as it is impervious to water damage.", "Date": "March 25, 2014"}, {"Title": "Great outdoor camera", "Author": "Lisa White", "ReviewID": "RPR9CNZDYNB68", "Overall": "5.0", "Content": "Love this camera, now have two of them.  Took it skiing, in pockets and it worked great.  Video, stills, and pictures are clear and look as good as my Nikon D5000.Its tough and have taken it fishing, kayaking, etc and am confident my kids (10 and 3) cannot hurt it.Recommend highly.  But do wish there was a viewfinder for really bright days.", "Date": "March 18, 2014"}, {"Title": "worked well", "Author": "Kodiak Construction Co.", "ReviewID": "R61FDS5QQKNU2", "Overall": "5.0", "Content": "I researched the different water resistant cameras and for the money this Olympuswas the best value for the cost.Then I used it as planned.  Really good pics, easy to use and durable", "Date": "March 13, 2014"}, {"Title": "Great Camera", "Author": "Peter R. Phillips \"Happy Genealogist\"", "ReviewID": "R1P8H0CK6NWXL7", "Overall": "5.0", "Content": "Bought this camera because I wanted an relatively inexpensive camera for snorkeling.  Worked well - easy to use underwater - good zoom and the pictures of the fish and coral look good.", "Date": "March 11, 2014"}, {"Title": "WOW!", "Author": "Henry M. Pagnanelli", "ReviewID": "R1VG24B847MV8", "Overall": "5.0", "Content": "Great camera, takes awesome shots, holds up underwater, a lot of different ways to use, especially like the panorama shot capability.", "Date": "March 11, 2014"}, {"Title": "best Christmas present ever", "Author": "raiderlady", "ReviewID": "R2RYCOPNCDSANZ", "Overall": "5.0", "Content": "I am going on a cruise and will be snorkeling and scuba diving. I am looking forward to beautiful pictures and a great time.Will update when I get back.", "Date": "March 1, 2014"}, {"Title": "Great camera", "Author": "Luke", "ReviewID": "R1KKSYH4GQFFYL", "Overall": "4.0", "Content": "Love the underwater feature and special effects it has. Offers alot of potential for the price so I can't complain!", "Date": "February 23, 2014"}, {"Title": "Excellent Outdoor Camera", "Author": "Ian D DuPont", "ReviewID": "R1O4V04XXHVB9R", "Overall": "4.0", "Content": "This camera is exactly what I was looking for: something to take high quality pictures on while enjoying the great outdoors.  Pictures in low lighting come out less-than-ideal, but I am still messing around with the myriad of settings.  It works great as an underwater camera, and being drop/freeze resistant was the selling point for me.  It was a little strange getting used to rinsing it off like a muddy shoe when it got dirty, but so far so good!  It's nice to to worry about damaging it with normal bumps, drops, and exposure to weather.  Well done!", "Date": "February 23, 2014"}, {"Title": "Excellent Value", "Author": "Douglas L. Millar", "ReviewID": "R3VTTK3G50LI62", "Overall": "4.0", "Content": "Just what I was looking for.  I'm still learning all the functions and may update review later.  Finally moved from 35mm film.", "Date": "February 21, 2014"}, {"Title": "olympus TG-830", "Author": "lillion lukeman", "ReviewID": "RDRADPJFOOKQP", "Overall": "4.0", "Content": "before i bought this i had the Olympus TG-820, which was a great camera (for the length of time i had it before it some how disappreared off the earth) so i needed another point and shoot for when i cant bring my DSR out. which this camera works for exactly what i need it for.", "Date": "February 20, 2014"}, {"Title": "Tough as expected", "Author": "Joleen M. Etheridge", "ReviewID": "R169W1WXH9NTEQ", "Overall": "5.0", "Content": "This is the second camera I bought. As with the TG-8010 I'm completely satisfied.A lot of improvements from the previous model.I highly recommend this camera for everyone who wants to enjoy adventure and being able to take picture even in \"non-conventional\" situations.Love it !!!", "Date": "February 13, 2014"}, {"Title": "Perfect All Around Camera", "Author": "Ashley", "ReviewID": "R17VQ445T2XPN0", "Overall": "5.0", "Content": "I haven't used this underwater yet, but I have used it out of the water and it takes great pictures.  Good quality with lots of fun different settings to try.  I bought this for our honeymoon to Hawaii.  I will be trying it underwater soon to make sure we are good to go for our honeymoon.  Can't wait!", "Date": "February 4, 2014"}, {"Title": "great camera", "Author": "Andy", "ReviewID": "R8NYMDZFF2PKE", "Overall": "5.0", "Content": "Bought this for my daughter and she loves it.  Easy to use.  Quality of pictures is better than camera she has been borrowing from school. That one costs at least twice as much.  Her teacher is impressed.  She will be taking it on vacation soon.  Really looks forward to using it.", "Date": "January 18, 2014"}, {"Title": "Nice cam and good deal.", "Author": "steven algren", "ReviewID": "RF9A3UGE1MSPC", "Overall": "4.0", "Content": "Everything looks good and as I expected. The camera works fine. The wrist strap bulkier than is needed and is hard to get into the case I have so I orders a smaller one. Also I don't like when they don't send a user manual, I had to print one off from their CD, most companies are doing that these days.", "Date": "January 16, 2014"}, {"Title": "Could Be Better", "Author": "Jeff Baker", "ReviewID": "R32FQQ3EC1SKES", "Overall": "3.0", "Content": "I like the camera. It has great style and the overall functions are very good. I've a number of this style, just older. However, I'm disappointed with digital zoom pictures. They don't come in clear, and the image stabilizer it not as good as it should be in this setting. There is a setting on the camera labeled as \"Super-Res Zoom\", but I can't get seem to find it, no matter what I try.The picture setting wheel is very easily changed without notice, which is not a huge downfall, but slows me down, for I take a lot of photos on the move. The video side of this camera has way too much background noise. Therefore, the microphone and video is below my expectations for this device. Even in a quiet setting, it below average. The video sound is much better on the older versions of the Stylus.", "Date": "December 18, 2013"}, {"Title": "a great experirnce!!", "Author": "katherine dobbs", "ReviewID": "R26WV5XVRRE73S", "Overall": "5.0", "Content": "Great setvice experience using amazon. it made shopping & ordering the exact item I wanyed a real JOY!! I would use them again. I chose this camera for several reasons-to replace a camera that u could alter effects of images without a computer,that had been stolen. I was super happy to find this gem tu my son & his fiance. Plus to top it off it takes better pictures & is waterproof being a avid boater,sailor & all activities in & around the.water having been brought up with boats, ect.  Thanks to amason & my son I'm one lucky, happy person!!!", "Date": "December 15, 2013"}, {"Title": "Not as good as other Tough models", "Author": "me", "ReviewID": "RA119VT9Q3SDU", "Overall": "2.0", "Content": "I ended up returning this camera. The waterproof latches did not close securely and were difficult to operate. It is also a large and clunky camera. I was much happier with my previous model, the Stylus Tough 6020. The 6020 had better latches, was smaller, and looked like a regular camera.", "Date": "December 14, 2013"}, {"Title": "Gets ALL the action...:)", "Author": "G&P;", "ReviewID": "R2SFKKRNIWZGXI", "Overall": "5.0", "Content": "This camera does it all!!!  Took it pheasant hunting with us this year.  Our eleven month old Lab was with us for his first hunting experience.  I set the camera for multiple shots with one press of the button.  Got all the action of his first retrieval!  Really appreciate the fact that it is water AND shock proof!!!  G&P;", "Date": "December 9, 2013"}, {"Title": "Good buy.", "Author": "occamsrazor", "ReviewID": "R1F0RNU0751P9R", "Overall": "4.0", "Content": "Awesome little camera. Delivered lightning quick. Does everything I want it do do and more. I'm not a pro (not by a long shot) so all I will say is that this camera's toughness and good picture quality are what I wanted and received.", "Date": "November 25, 2013"}, {"Title": "Photo quality concerns", "Author": "Kathlene Shaw", "ReviewID": "R2FO40XENZD4J8", "Overall": "3.0", "Content": "The 16mp photos are not quite as good as my old Olympus with fewer mp.  Did like the night shots I was able to get.  But I am disappointed in the overall photo quality.", "Date": "November 21, 2013"}, {"Title": "Good, But Not an Improvement Over Previous Model", "Author": "Mark Price \"Laborman\"", "ReviewID": "R1LN30U773PCNJ", "Overall": "4.0", "Content": "Not quite as good as the model it replaced.  But still a very good all-weather camera.  My biggest gripe is that the previous model had a lens cover, which this does not.  Lack of a lens cover doesn't make the camera any less waterproof.  But it gives the camera less utility in the rain and for activities such as kayaking because you are more likely to have water spots on the lens which will show up in pictures.  I don't know that any of the competition has a lens cover.  So all in all I have still found this to be a superior all weather camera.  It takes clear enough pictures that I use it for most picture-taking situations, regardless of weather.", "Date": "November 12, 2013"}, {"Title": "Olympus Stylus TG-830 iHS Digital Camera with 5x Optical Zoom and 3-Inch..", "Author": "BluerthanBlue", "ReviewID": "R1G55X2CV4OOR8", "Overall": "5.0", "Content": "I love the camera.  Beautiful rich color--not tacky at all. Excellent photos for the price.  I'm thrilled to have gotten it for $179.  Takes great macros!!!!!  Awesome in low light conditions.  I definitely recommend it.", "Date": "November 9, 2013"}, {"Title": "Great for outdoors and underwater", "Author": "Nicole Laliberte", "ReviewID": "R3BAT9L16S1QXN", "Overall": "4.0", "Content": "We took it on our Caribbean vacation- Took excellent outdoors pictures and underwater shots!- Some problems with inside pictures coming out blurry and color being off", "Date": "November 7, 2013"}, {"Title": "Very good camera for it's purpose", "Author": "Michael R. Davis", "ReviewID": "R1MAFO3KXKK9RX", "Overall": "4.0", "Content": "I have been using the camera for about 3 weeks and have taken some great photos. The photo quality is very good and and the controls are reasonably intuitive. I have not taken the camera into the water. The lens position has caused me some problems as it's very easy to get a finger in the picture. I'm used to cameras with a central lens position. The control dial has changed position while puttting the camera into my belt holster. I've learned to check the dial position whenever I get ready to take a picture. The view screen has a very short \"on\" period after turning the camera on. I find it goes dark while I'm trying to compose a picture, which is very aggravating. I found the control option that allows the screen to stay on constantly, but I'd rather be able to control the \"on\" duration rather than have the equivalent of \"off\" and \"on\". Based on what I paid for the camera, the value is excellent.", "Date": "November 1, 2013"}, {"Title": "great little camera", "Author": "wbellis", "ReviewID": "R3C1LNBCZS6PTZ", "Overall": "5.0", "Content": "took this on my trip I took do south the bahamas I took this past month. My wife loves the panoramic shots its and some the other things. I loved the fact it water-proof, shock, and freeze proof.", "Date": "October 30, 2013"}, {"Title": "Just what I thought it would be!", "Author": "Elizabeth Howey", "ReviewID": "RFY8GHO3U66F8", "Overall": "5.0", "Content": "This camera is tough, completely waterproof, and has a ton of awesome settings that are very easy to figure out (from someone who hates reading manuals!)  This model got rid of the sliding lens cover, which was the one piece that broke on my last camera", "Date": "October 10, 2013"}, {"Title": "Great all around camera", "Author": "Ken \"Ken\"", "ReviewID": "R113L52EP1DQ79", "Overall": "5.0", "Content": "I bought this camera after reading the reviews on it about its ruggedness and convenience.  I wanted a camera/HD camcorder that would be quick to grab for vacations and family events but that was also of top quality.  I have been very pleased with this little jewel!", "Date": "October 8, 2013"}, {"Title": "Excellent camera, excellent value!", "Author": "T. L. Kuipers", "ReviewID": "R324CR79X3PR9F", "Overall": "4.0", "Content": "I've been thrilled with this camera so far. It spent 2 weeks strapped to the top of my kayak on a kayaking trip and it performed perfectly! It's tough and sturdy; everything feels very solid and good quality. Underwater photos are fun and surprisingly good quality. I'm still figuring out the settings but so far the picture quality has been great for a camera of this price range and type. Would recommend it to anyone who spends time in the outdoors and wants the peace-of-mind not worrying about falls and water.", "Date": "October 7, 2013"}, {"Title": "Watch prices before you buy", "Author": "Christine A Hulquist", "ReviewID": "R22MYJLMH514MV", "Overall": "5.0", "Content": "I love my camera but I thought I got the best deal on amazon til I saw the same camera on sale for $80 less--- now I'm stuck paying more because I'm sure theyDon't match prices!", "Date": "October 2, 2013"}, {"Title": "Solid and waterproof, digital zoom lacks clarity", "Author": "Burton Kellogg", "ReviewID": "R3CLYYCX7BAN1W", "Overall": "3.0", "Content": "I bought this camera primarily to have a solid, waterproof device to take fishing with me. It works well in that respect. But I'm not happy with the clarity of the digital zoom; the mechanical optics on my old Sony DSC1 are much more clear at full extension.", "Date": "October 2, 2013"}, {"Title": "Great underwater camera!", "Author": "Jared", "ReviewID": "R2JUPR8RWHSU3Z", "Overall": "5.0", "Content": "I was somewhat hesitant about purchasing this because I was terrified that it would get water somewhere in it and stop working.  We have had it a few months and just recently got back from a trip to Mexico where this was our main camera.  It takes wonderful out-of-water photos.  In clear water (pool), the photos are clear and pretty good.  In ocean water, the photos come out well with a bit of editing.One thing to note is that you absolutely have to soak it in fresh water after using it.  We typically soaked it for about 20 minutes, then would allow it to completely air-dry before opening any compartments.  The battery held on for almost a week of use every day so we only had to charge it once.  I would also recommend a memory card of at least 4 GB which allows you to take about 900 photos.Overall, I am very pleased with the performance of this camera and would recommend it to others, in fact, many people on our trip asked what type it was and were more impressed with its functions than their own cameras.", "Date": "October 1, 2013"}, {"Title": "Great camera", "Author": "Zachary Gold", "ReviewID": "RYHD4YS2D78MJ", "Overall": "5.0", "Content": "Great camera. GPS function is very accurate. Works very well underwater. Not too scratch proof but crush proof. I'd get it again", "Date": "September 24, 2013"}, {"Title": "Nice little camera.", "Author": "ATauai", "ReviewID": "R2311HAG21FXCL", "Overall": "4.0", "Content": "I bought this to replace my Canon powershot which had debris inside the lens that couldn't be cleaned out. I'm excited to try the waterproof feature. It takes great pictures outdoors...I need to learn the camera better to get good indoor pictures.", "Date": "September 16, 2013"}, {"Title": "Olympus TF-830.Best wather proof camera.", "Author": "Bope.50", "ReviewID": "R3ZYIZZE9GXFB", "Overall": "4.0", "Content": "It's awesome, I love . That work perfect I'm so glad ; under Water Takes nice pictures ,lot on ad card, shock Really works.", "Date": "September 11, 2013"}, {"Title": "Great camera!", "Author": "Ringo", "ReviewID": "RS8ZBE1YF3OWB", "Overall": "5.0", "Content": "This camera was great on the Grand Canyon rafting trip that prompted it's purchase.  The pictures look excellent!  The waterproof feature was a requirement and it certainly held up.  And it's compact size and weight meant it was easy to take on side canyon hikes.  All in all a great purchase.", "Date": "September 9, 2013"}, {"Title": "Great camera for a great price", "Author": "Wendy J. Clayton", "ReviewID": "R1NV9EDDQCG1KG", "Overall": "5.0", "Content": "I love it because it is smallish, water and shockproof.  Takes great photos as well.I was hiking in Zion national park and dropped the camera which nearly fell off a cliff....with no damage!I then hiked in a river in the park and dropped it in the water and it was fine.So far so good.", "Date": "September 3, 2013"}, {"Title": "Great little camera", "Author": "LJ in PA", "ReviewID": "RV263JPP7JD7K", "Overall": "5.0", "Content": "Great price. Great features.  My son took this off to Peru and the quality of his pictures is excellent.  Also a great value.", "Date": "August 31, 2013"}, {"Title": "Great for the money", "Author": "B. W. Downing \"Bobbi D\"", "ReviewID": "R3IZKJNULI7P04", "Overall": "5.0", "Content": "Easy to use. Amazing Capabilities. Particularly like being able to take stills in the middle of a video. Excellent resolution and high pixels.", "Date": "August 31, 2013"}, {"Title": "Wow!  This camera rocks! - So far.", "Author": "W. Valiunas \"cne9999\"", "ReviewID": "R34TE8SJR947O1", "Overall": "5.0", "Content": "Wow!  This camera rocks!  Had it only a couple hours and had time to go through all the features and this thing simply rocks.The pictures I’ve taken for experimental purposes are fantastic.  The editing feature is kind of lame BUT, the effects, functions, modes, and ease of navigation through the setup menus is fantastic.I will certainly update this review after I have had a chance to actually use the camera for the purpose I purchased it for.  Snorkeling in Maui in late September.  We’ll see.  But so far the camera is absolutely perfect.Keeping my fingers crossed.", "Date": "August 28, 2013"}, {"Title": "Great product", "Author": "Nathan", "ReviewID": "R1FKOB5T1EYCR4", "Overall": "4.0", "Content": "Boots up very quickly and is ready for action shortly after hitting the power button.  Pictures and and easy access movie mode are great.  The geotagging is an awesome feature and very accurate.  Very happy with this purchase.", "Date": "August 26, 2013"}, {"Title": "This is one great little camera.", "Author": "Muleskinner", "ReviewID": "R2O57K6IF0RMD9", "Overall": "5.0", "Content": "I haven't tried it under water, but it takes bright very colorful pictures.  I especially am aware of the low light picture quality.  It is everything and more that Consumer reports and the customer reports said it was.", "Date": "August 26, 2013"}, {"Title": "Awesome camera", "Author": "Jeanette Fee", "ReviewID": "R3ATP6I53JYDUT", "Overall": "5.0", "Content": "Bought this camera to use on rainy days and on the beach. Took better pictures than my more expensive higher quality camera!!So many special effects to use! Love, love, love it!! Fits good in a pocket too!", "Date": "August 26, 2013"}, {"Title": "830 IHS is awesome.", "Author": "Chris", "ReviewID": "R1LGO0RV8HWHUY", "Overall": "4.0", "Content": "Very good camera.  Has awesome picture quality and ability to video in 1080. Has not had any issues under water.", "Date": "August 22, 2013"}, {"Title": "Anyone having a problem with the trigger button?", "Author": "cmc", "ReviewID": "RGVTWRHJ625MW", "Overall": "3.0", "Content": "Is anyone having a problem taking multiple pictures due to the trigger button on the camera being recessed? Is this the way it is supposed to be? The camera seems to be delayed when taking multiple pictures. I keep pressing the recessed button to see how many shots I can take and I am testing this camera out. I have an extreme memory card (SDHC at speed up to 80 mb/s)..... thought this would be helpful, but the camera itself may not operate as fast. Any feedback is greatly appreciated. Otherwise, this is going back. The trigger button seems so recessed.", "Date": "August 14, 2013"}, {"Title": "Best fathers day gift", "Author": "Goobers", "ReviewID": "RYCURPB8YO3OO", "Overall": "5.0", "Content": "I gave this to my Dad & he LOVES it!. It takes video & keeps record of where pictures were taken too.", "Date": "August 13, 2013"}, {"Title": "Great camera!", "Author": "skeptical hippo", "ReviewID": "R2GLY83JBQSS05", "Overall": "5.0", "Content": "This camera arrived in 2 days! It is even better than advertised. If this camera were stolen or lost I'd buy another one today. Great value for the price!", "Date": "August 12, 2013"}, {"Title": "Was good for the two days it worked.", "Author": "df99", "ReviewID": "R1ZDYG11URLFJU", "Overall": "1.0", "Content": "My unit only worked for two days of shooting. On the second day the battery died after about 15 minutes of shooting.  When plugging it in, it will no longer show that it's charging or report the status of the battery.  I'm assuming this unit is defective, and it will be going back to Amazon ASAP.  I will not be buying another copy.  I'm not willing to risk my money on another Olympus product after this failure.", "Date": "October 25, 2013"}, {"Title": "Ticking sound in the video", "Author": "Marty", "ReviewID": "R1KSW54AIOCWMA", "Overall": "1.0", "Content": "I had high hopes for this product. After owning several cameras that had dust infiltration inside the lens, I wanted a sealed camera that didn't have this problem. This camera seemed to fit the bill for me...but when I shot a video, there was a ticking sound in the audio. This is caused by the mechanism inside the camera (probably autofocus) causing a ticking sound, which would stop after a few seconds if you don't move the camera, but once you move it, the ticking starts again. This happened on two brand-new units I tried out. A shame, because it's otherwise a nice product. Some other people commented on online reviews on various websites that they found the same problem. I had hoped my sample wouldn't have the problem. Pity.", "Date": "September 30, 2013"}, {"Title": "Solid.", "Author": "Deb in the Adirondacks, NY \"vtgrnmts\"", "ReviewID": "R27L1BIWDVIZUZ", "Overall": "5.0", "Content": "Did some reading of reviews before deciding on this camera. I've owned a lot of film as well as digital cameras. This one is my first waterproof one. I am impressed thus far. The body and doors and buttons are very solid, but I expect this from a durable droppable camera. The photo quality is excellent. The buttons and menus are very user friendly, especially since I haven't had an Olympus since my OM-4T........It was easy to navigate and figure out where all was located. I plan to use this near the ocean and hiking in all weather.........I would recommend this to anyone that wants to take good shots in any weather or place..........", "Date": "June 11, 2013"}, {"Title": "Great camera for underwater shots and much more", "Author": "Kimberly J. Clower", "ReviewID": "R1W8CLOYRB10R9", "Overall": "5.0", "Content": "I bought this camera for an upcoming trip to Florida where snorkeling will be involved and while I needed the underwater feature I got a lot more. So first off, I did test the camera in the pool immediately as that was my primary reason for the purchase. Not much to see in the pool, but the pictures were clear and the camera survived. But what I didn't see in any description or reviews were all the scene selections for this camera. There are actually 4 underwater scenes that can be set (up close, wide, action, and standard) as well as scenes for landscapes, portraits, sunsets, fireworks, and my favorites a cat and dog setting for detecting animals' faces. I laughed out loud when I saw those settings - lots of animal lovers in the world I guess, though I suspect these settings don't do much more than the portrait setting. But I was happily surprised by the number and selection of scene settings (there are a few more I have forgotten) since when I upgraded my Canon camera recently they took away the sunset setting, which is a great setting for anyone that hasn't tried it before. Anyway, great little camera and I am excited to use it more on my vacation.", "Date": "March 9, 2014"}, {"Title": "Immediately Returned", "Author": "Quackers \"Quackers\"", "ReviewID": "RBIPH0WUOBVKV", "Overall": "1.0", "Content": "I took a chance after reading the reviews and seeing multiple comments about a clicking sound while recording video.  I tried it out right away and sure enough I had clicking in the playback.  If you don't use video you may like the camera.", "Date": "February 14, 2014"}, {"Title": "Great Choice", "Author": "Lora Davis", "ReviewID": "R1DY3EAYAWHF7I", "Overall": "5.0", "Content": "if you are looking for a compact camera that will hold up to sports and the outdoors this is it. this thing is built like a \"g-zone\" phone. i have had the camera for a little over a week and i have absolutely no complaints about it. the camera takes incredible pictures and video. the sound on the video is very accurate too; no distorting the sounds like most recording devices. i do not recommend buying the red one unless you are a woman because the red is kind of pink. thanks for reading and i hope this helped!", "Date": "December 31, 2013"}, {"Title": "Great Camera - Fast Capture!!", "Author": "Diana Ricketts", "ReviewID": "R2I3D5XXDZTZV4", "Overall": "5.0", "Content": "Bought this camera before going on a cruise. We had intended to go snorkeling but were not able to. At least I was comfortable having the camera near all the water. I would suggest that anyone who is purchasing a camera to take in the water to purchase a floating device to attach to the camera!This camera takes great pictures and the picture is taken the second you push the shutter button not a little after. Not missing as many good pictures as I had with my old camera. I like the way the camera has so many options for picture taking.So glad we purchased this camera!", "Date": "November 13, 2013"}, {"Title": "Great side kick camera for a SLR type camera", "Author": "Knight511", "ReviewID": "R23U2YZIQXOOWB", "Overall": "5.0", "Content": "This was a last minute purchase before our trip to Maui in October 2013.  Camera performed flawlessly.  The panoramic feature got a heavy work out hiking the 11.2 miles from Sliding Sands to the Halemau'u trail head in the Haleakala \"crater.\"  The under water shooting delivered GREAT shots and movies while snorkeling all around Maui.  No quirks.  No problems.  the camera just worked and delivered really good photos and video.  It may not be the cheapest tough camera, but it is an excellent tough camera.I carried 2 cameras for all dry activities on Maui.  This TG-830 and a Canon SX50 HS.  The Canon shot better, but it is in a different league.  The TG-830 was the first camera I reached for when I needed \"snapshots\" and worried less about setting up the shot.  It delivered beautifully in all circumstances.", "Date": "November 2, 2013"}, {"Title": "The second one I have purchased", "Author": "blueocean*", "ReviewID": "R2QZXCEBX747GZ", "Overall": "5.0", "Content": "My first one I had on my deployment-I still have it. And it still works, even though I dropped it an it was run over by a HMMV! I freaked but picked it up, brushed it off and was back to shooting pics with it. No damage. Now that is TOUGH. I bought this one because I liked the color and the updates. Pics always are clear- and no, I am not a professional in any sense. I own a Canon, a Nikon, a few disposable cameras and now 2 Olympus TOUGH cameras. I never take my Canon or Nikon traveling- too expensive to replace. The TOUGH cameras go with me EVERYWHERE. I know I can rely on their toughness, and can take it hiking, climbing, boating, camping, running- and I love the obstacle courses so we are not just talking flat roads here. I can take it into the deserts and not worry about heat with this. Into the snowy mountains snowshoes and it doesn't freeze. (I do keep it next to my body, inside my coat. But, no matter where I take this, I always get good pictures-many of which I get compliments on, and I can always count on it being able to withstand whatever trials I put myself through. I will keep buying these cameras as long as they make them.", "Date": "September 9, 2013"}, {"Title": "Takes pictures underwater", "Author": "Elizabeth D.", "ReviewID": "R1SL11DYNLO3A3", "Overall": "3.0", "Content": "I like that it takes pictures underwater, which is totally awesome, but it makes bad choices with white balance and contrast and such. I realize that there are many settings, but none of them does a particularly good job. I also haven't figured out how to control the shutter speed except putting it on sports mode which puts it at 1/500, which is faster that what I normally need, but on other settings, it decides for me, and picks for instance 1/30, which is too slow for moving people. I need a happy medium, like 1/100. There is also a slight delay between the time I push the shutter button and when it takes the pictures. I'm used to my Canon DSLR, so I guess I'm a little spoiled. On the other hand, it's supposedly more rugged, so I have been letting my kid at take pictures at the zoo and such with it without worrying about it dropping or something.", "Date": "August 15, 2013"}, {"Title": "Great product, great price, love the GPS feature, 16MP and HD video", "Author": "K. Ling-Torres \"Jewelry lover\"", "ReviewID": "R3M7GZOE0GMVX7", "Overall": "5.0", "Content": "I love this camera other than being little bit too big everything is great.  The reason why I got this is for our snorkeling tour but ended up didn't go.  It has GPS feature, 16MP and HD video.  The resolution and sharpness of the pictures are great.  Most of the pictures turn out really nice.  You can pay about $100 less for TG-820 model for around $150.00 but I think it is worth the money.  I ended up climbing the waterfalls in Jamaica and the camera accidentally dipped into the water by mistake but nothing happen.  This camera can go under water 33 feet. This is also shock, crush & freeze proof but I didn't do any of those test.  It says 5x zoom but I had one video shot up to 10x, I was shock.  During my research, I couldn't find any where say that what is the size of the memory card.  It is the SD card not micro SD.  My camera vendor recommends this camera to me.  I really love it.I also purchased matching color red case Tamrac 3814, Olympus foam float strap, tripod and Sony 32GB SDHC/SDXC Class 10 UHS-1 R40 Memory Card.  I am really happy with my purchase.", "Date": "August 13, 2013"}, {"Title": "Camera works great", "Author": "Dan", "ReviewID": "R1F6LAIVKVXORY", "Overall": "5.0", "Content": "Wife loves it, she can't wait to take it out to the beach. Also wants to try it out the next time we go kayaking.", "Date": "June 24, 2013"}, {"Title": "Love it", "Author": "Sayward", "ReviewID": "R2NFYQA5ZLBS8O", "Overall": "5.0", "Content": "I have always bought Olympus cameras and so far this one is out doing all the others. It takes fast pics which is great with the kids and they are great quality.  It also takes good video. I have not taken it to the water yet.", "Date": "May 9, 2013"}, {"Title": "Poor at best", "Author": "Seemore", "ReviewID": "R1EV3DWJ4ZI7PW", "Overall": "1.0", "Content": "I must say I have owned on of these before. It worked well till it took on water. I decided it could be user error and purchased a newer version. I have used ( not even myself ) to charge and verify it worked. It has not since, and it has been registered. Amazon determined it was not returnable, but it was purchased as a Christmas gift. Purchased on Sept. 27, and dead before Christmas eve. The manufacturer stated they would sent a new battery which they haven't.I can tell you my disappointment in both Amazon, as well as, Olympus! I am going to swim with sharks tomorrow with no camera. I will seriously consider never doing business in the future.Todd", "Date": "January 5, 2014"}, {"Title": "Poor Picture Quality; Noisy Video", "Author": "C. Emptor", "ReviewID": "R2LA4RR3SANRN9", "Overall": "1.0", "Content": "This is a terrible camera unless you are going to use it for a gift for a third grader or exclusively for social media posts where image quality isn't a factor.The specs and features are impressive, but the camera fails at its core purpose: Photograpy.The images are ok when viewed small, but if you expand to 100 percent you will find they consist of a very pixelated pattern.  Sort of like seeing a mosaic up close.  This effect is not subtle, and renders the images much worse than, say, a point and shoot from 1999.  The panorama mode is even worse.  Fuzzy.The video is a complete waste of time.  You are far better off just using an iPhone or other phone cam video.  Here's why:  The video is fuzzy, and the audio picks up some sort of in-camera adjustment, which sounds a little like far-away automatic weapons fire.  Maybe 600 rounds per minute or so.  The volume is very close to a person speaking n the video, for example.  The burst lasts for about 1 or 2 seconds each time, and it pretty much ruins the video if you want to hear sound for.The camera would be ok for a child or clumsy person who drops it a lot.If you buy this from Amazon, be sure to give it a good check during the return period.  I delayed too long and now I'm stuck with a ~$230 lesson in not being lazy about checking this out doing the review period.  I may be sounding harsh, but the problems with this camera are identical to other Olympus stylus tough camera reviews.  (I did not notice the same complaints about this camera; it had some good reviews on other sites; I thought it was safe.  it is not safe.  They are using the same technology in several models, and it is a genetic defect in the entire family line, not an isolated mutation.Edit:Seeing I am one of only 4 people with a dismal review, I'm wondering if there may be a quality control problem that makes some of these cameras bad?  Either there are a lot of people who are OK with fuzzy video and photos and a noise in the video, or it's not happening for everybody.", "Date": "September 9, 2013"}, {"Title": "A Great Durable Camera!", "Author": "EDay", "ReviewID": "RWLOUGUD2ZV46", "Overall": "5.0", "Content": "Took this on a cruise and took some great pictures. Very easy to learn to use.  Have not tried underwater yet but will this summer. Bought it because my son has an older version and has loved it.", "Date": "May 1, 2014"}, {"Title": "Not good for videos", "Author": "Louise L.C.", "ReviewID": "R10O2UJNPJBZSC", "Overall": "2.0", "Content": "I can't give this camera a good rating because it makes a clicking sound when you playback videos.  If you listen you can hear the sound inside the camera when it is recording. It must be located right next to the mic because it is amplified on playback.", "Date": "April 15, 2014"}, {"Title": "Needs improvement", "Author": "CTLisa", "ReviewID": "R19S2SDO0GQ7PK", "Overall": "3.0", "Content": "Takes great pictures but the buttons are too close together and I end up turning the camera off instead of snapping a picture. The settings dial moves too easily and I frequently found it in the wrong position.", "Date": "March 19, 2014"}, {"Title": "VERY easy to figure out!", "Author": "fastforward194", "ReviewID": "R12X759P6V5KD4", "Overall": "5.0", "Content": "Three days after this camera was delivered, I left for Denmark to be with my grandchildren for a month .  I skimmed through the User's Manual once and didn't have to refer to it again.  Almost all still photos taken in Auto Mode were in focus and colors were true.  I experimented with the pre-programed scene settings and found 3 or 4 of these settings drastically improved the quality of photos taken in each specific, difficult situation.  I used the indoor/night setting a lot!  After I got home I discovered a setting for close-up portrait shots that allows you to enhance in ways similar to more complicated digital editing done on the PC.  The camera will make wrinkles vanish and enhance facial features!!!  Adding all of these great qualities to the fact this Olympus GT-830 is small, easy to use, waterproof, and rugged, I'm glad I spent the extra money for a camera that helps me to record life's special moments so beautifully.  Hey, it even has a GPS!", "Date": "March 6, 2014"}, {"Title": "Great Camera", "Author": "Deb", "ReviewID": "R6E2HX5X9Z3OH", "Overall": "5.0", "Content": "The camera is easy to use.  I plan to take it on a scuba diving trip.  I also purchased the underwater housing but I haven't yet tried out the housing underwater.  I like the fact that the camera without an underwater housing can get wet and if using the camera poolside no housing is needed.", "Date": "February 3, 2014"}, {"Title": "bought as a gift", "Author": "Michael W. Armistead", "ReviewID": "R1FL2W67A0E107", "Overall": "5.0", "Content": "This is the camera my long distance runner son requested.  It will take great pictures and can stand up to the rough terrain he may choose.  He had researched the camera and was delighted on Christmas morning.", "Date": "December 30, 2013"}, {"Title": "Works well and takes good pictures", "Author": "jmyersdad", "ReviewID": "R363O28PZGPHO0", "Overall": "5.0", "Content": "This camera is probably as good as it gets for ones this size in this price range for this kind of durability. I did some research before purchasing, and this Stylus was recommended.In \"auto\" mode I feel the pictures can get a bit grainy or the edges of things gets that weird, hard-outline effect instead of a gradual transition. However, I found these happen because the camera is setting the ISO and aperture and other things for what it thinks is best for the setting. Thus it ends up compromising quality for simplicity.In order to get the best you can out of this camera, you will have to do a little reading to understand how to set various aspects of it yourself to best fit the environment, in my opinion. The lower the ISO, the less the grainy-ness and the better the sharpness. So on auto perhaps not the best out there, but I've owned many point-and-shoot cameras, and none of them have had what I'd call \"great\" performance on auto from a more refined point of view. This is perhaps as good as it gets.As for the durability: My son took this camera with him to Africa this summer, and he captured very adequate pictures for the most part--on \"auto.\" We were pleased with its performance and durability; all the bumpy roads it endured and hard dirt it was dropped on didn't phase it in the least. It came back in the same shape it left. I would buy it again.", "Date": "August 24, 2013"}, {"Title": "like it", "Author": "T. Laszlo \"Buckeye Book Reader\"", "ReviewID": "R3COBOZ9DGC7R4", "Overall": "5.0", "Content": "I like it.  Haven't used it much yet.  Hoping it truly is water proof.  Was not a speedy delivery but came in a timely fashion.", "Date": "August 16, 2013"}, {"Title": "Camera fits the bill to a tea.", "Author": "Harry Wilkins, Jr.", "ReviewID": "R3E7BKAS0GIL3L", "Overall": "5.0", "Content": "I bought this camera as a birthday gift for my wife and it had all the features that she felt were important to her. It arrived just in time for her birthday. he has enjoyed using it as she learns more about the camera. We are now an all Olympus camera family.", "Date": "August 2, 2013"}, {"Title": "Olympus Stylus TG-830 - big disappointment", "Author": "greg", "ReviewID": "R2N5ISX87QT5U6", "Overall": "1.0", "Content": "The camera looks good and has a lot of interesting options. Unfortunately it fails with the most fundamental task - taking pictures.It's really very disappointing but the picture quality is simply very bad. I tried different settings but no change. Colors are pale, lighting looks strange and noise reduction is absolutely out of any proportion.Out of 100 photos, maybe 5-8 were up to acceptable standard. Actually, my cell phone camera takes much better pictures. So, my sincere advice, if you consider this camera, just don't risk big disappointment - get something else.", "Date": "January 9, 2014"}, {"Title": "Don't waste your money", "Author": "Erika Lacerda Brasi­lia Brasil", "ReviewID": "R3CBDMEGVI7TEP", "Overall": "1.0", "Content": "Bad bad image quality. Completely grainy, even under sunshine. Waste of money.Yes, it does have some cool tools, but what's te point if the image is poor?Very disapointed.", "Date": "January 6, 2014"}, {"Title": "Wonderful camera with great results so far.", "Author": "James E Vadas", "ReviewID": "R28ZVIGLP428EK", "Overall": "5.0", "Content": "Have not tested its underwater capabilities yet but had it at the beach in the sand and weather and has done great.  Taking it out in the forests and fields in pocket or backpack is great too although I plan to get a light inexpensive camera case just to keep it from getting scratched up.", "Date": "June 12, 2013"}, {"Title": "does way  to much", "Author": "Michael Caggiano", "ReviewID": "RFKHSJYC9BKZ1", "Overall": "3.0", "Content": "H have an olympus PHD (push here dummy) camera and love it. When I bought this camera I thought it was similar but this camera does so many things I am confused with working it  I am NOT an avid camera buff but I am not stupid either but this camera is very confusing. I have my daughter comming over tomorrow to try to change the date and time", "Date": "March 15, 2014"}, {"Title": "Great product, fair price and quick shipment.", "Author": "M Discher", "ReviewID": "R1O1YKGMVDQD89", "Overall": "5.0", "Content": "This is a Christmas gift so it remains unused (as yet).  I have had GREAT service from my previous Olympus which I obtained prior to going to Iraq in 2008, and it's still in use.", "Date": "December 17, 2013"}, {"Title": "Amazing!", "Author": "Pen Name", "ReviewID": "R354X2WKAVAVQW", "Overall": "5.0", "Content": "This item met my expectations and I have no complaints about it whatsoever. However, I have not tried the underwater mode yet. I highly recommend this item.", "Date": "June 27, 2013"}, {"Title": "Issues with streaking on photos from sun", "Author": "JJonthego", "ReviewID": "R3OY1CB46M9TWI", "Overall": "3.0", "Content": "I was really excited to get this camera but I'm having a lot of problems with the sun causing streaks across photos. Also, when there is bright sun in the background it tends to wash out the sky. Not sure if there is a way to fix this. I am guessing it has something to do with the chrome bezel and the lens not being very recessed.I'm hoping I can find a solution otherwise I will be reselling this and looking for a different camera.Other than that issue it's been really good. Underwater pics turn out well and the camera feels extremely rugged. A bit bulky, but that's expected from a rugged camera.Any suggestions?", "Date": "June 4, 2013"}, {"Title": "Bad Photos and no waterproof.", "Author": "Boris", "ReviewID": "RR85JB70ZVE3Y", "Overall": "1.0", "Content": "The photos are not good because the lens are too small.You need much light for a good photo.No good definition in the photo. Much noise.The camera is very very heavy for a compact camera.If you use under the water. Some of water is introduced inside the camera. Only with 1 ft of water. And after that, the lens fogs, and you cant keep taking photos.Bad bad.The panoramic function are a s*** in this camera.The LCD screen are too dark. When you take a picture outside, with sun, you can't see the image in the LCD screen.In general, is not a good camera.The unique great feature are the GPS feature. But if you want a camera waterproof or with gps, you must buy another, because this are not a good camera.", "Date": "January 29, 2014"}, {"Title": "Ok camera", "Author": "Kahmissa steenhausen", "ReviewID": "RX1KT37Q5VN88", "Overall": "1.0", "Content": "This camera is not very responsive and takes ok pics.  It was a consumer report best buy and I would buy another camera.", "Date": "August 17, 2013"}, {"Title": "Camera rating", "Author": "Brian", "ReviewID": "R4SBF0UVQXXO5", "Overall": "4.0", "Content": "It is going on its first vacation in hours so will see but so far it has taken nice pictures.", "Date": "June 21, 2013"}, {"Title": "Broken camera", "Author": "Jay Stewart", "ReviewID": "R36DOYQCGW6M40", "Overall": "1.0", "Content": "I was very disappointed to receive a completely worthless camera .  It did not work at all straight out of the box.  Can you please advise me on how I can retrieve my money from this company?", "Date": "August 27, 2013"}], "ProductInfo": {"Price": "$279.99", "Features": "Waterproof 10m/33ft, Shockproof 2.1m/6.9ft, Crushproof 100kgf/220lbf, Freezeproof -10C/14F, Dustproof\n16MP BSI CMOS Sensor, TruePic VI Image Processor, High-Speed Performance\nGPS and e.Compass, Full 1080P Full HD Video", "Name": "Olympus Stylus TG-830 iHS Digital Camera with 5x Optical Zoom and 3-Inch LCD (Red)", "ImgURL": "http://ecx.images-amazon.com/images/I/41FVM4Y0AlL._SX300_.jpg", "ProductID": "B00AQ2BVQE"}}