{"Reviews": [{"Title": "Nice camera", "Author": "LarryV", "ReviewID": "R312A0OPH02DVM", "Overall": "5.0", "Content": "In 2011, I purchased a Sony DSC-W570 from Amazon for my daughter's birthday. On a Disney World trip in May 2013, my wife dropped it and the case bent, creating about a 1/16\" gap on the top of the camera. It is still working, but my daughter was really upset, as she babied that camera and it didn't have a scratch on it. And she takes a zillion pictures! I felt so bad for her, that I bought this camera, which is essentially the same model with updated features. She loves it. My wife is forbidden from touching it (per my daughter-who is a senior at University of Georgia). Just to double the security I also bought the Square Trade warranty that covers manufacturers defects, as well as, accidental damage. They are worth the price, and are better than any big box warranty. Used one only once on another product, and they replaced it with no problems. Highly recommend on any electronic product, even if purchased from another vendor than Amazon.", "Date": "June 17, 2013"}, {"Title": "Very good camera", "Author": "Pedro III Bello", "ReviewID": "R2KVVMPHNC95MH", "Overall": "5.0", "Content": "It has a nice design and is very easy to use.The price-value favorese him.I wish the battery lasted longer", "Date": "June 5, 2013"}, {"Title": "Great small camera", "Author": "Henry", "ReviewID": "RAYB052TVIF1K", "Overall": "5.0", "Content": "The Misses loves it! It's a tiny light weight camera. picture quality is great! Great price too. It's pink all around front and back.", "Date": "May 12, 2013"}, {"Title": "Sony Cybershot", "Author": "Chandra", "ReviewID": "R1NCZ6I8KX7Y8S", "Overall": "5.0", "Content": "I love this camera and the color is different!!  It is easy to use and easy to charge.  It is easy to carry because it is light in weight!", "Date": "October 9, 2013"}, {"Title": "Easy to use and great pictures", "Author": "Marise", "ReviewID": "R11B0KJP9YZPDM", "Overall": "5.0", "Content": "This is a great point and click camera. Very easy to use. I have no trouble scrolling through old pictures, adjusting the flash, or taking movies. The 5x zoom is plenty for me and I love how small and light the whole thing is.One thing to note is that on this page there's a 'frequently bought together' that shows a memory stick. The memory stick on that list doesn't match this camera (at least it didn't for me. It might eventually get updated).", "Date": "September 23, 2013"}, {"Title": "I like it", "Author": "donttellmewhat2do", "ReviewID": "R2CPUA496KVG8F", "Overall": "3.0", "Content": "I just received this camera today so I can't speak for durability. However, the immediate testing (pictures, video, sound etc.) proved very good. The colors are great and the pictures come out very crisp even in 5x zoom! I am in love with the panorama mode. The pink color is so cute, also. I like the fact that the shutter button is flush with the top of the camera. That makes it much easier to slide it into a case. The size is great as well. This is my first Sony camera and I must say that I'm impressed-especially for the price.EDITAfter some use, I changed my rating from 5 to 3 stars. While I still think it is good value for the money, I have come to see that the pictures are not always great quality, especially in low light. Some pictures come out great, some come out fairly poor. This would be a fantastic first camera.", "Date": "September 4, 2013"}, {"Title": "Great camera", "Author": "degd127", "ReviewID": "R13G598UM968EK", "Overall": "5.0", "Content": "Light, compact, great focus, easy to carry around, no complaints. I've recommended it for a few people. Video quality also good, and the low-light functions. I haven't used all the other functions.", "Date": "July 26, 2013"}, {"Title": "Great", "Author": "Margaret Lane", "ReviewID": "R2TZBAOW4SVZYK", "Overall": "5.0", "Content": "I like my new camera. It is light weight.It is easy to carry in my purse. I love the color. It takes great pictures.", "Date": "January 4, 2014"}, {"Title": "Great Camera", "Author": "David archer", "ReviewID": "R343UH0W1QC551", "Overall": "5.0", "Content": "Told me wife to pick a new camera and she reviewed all the others available in the price range and this is the one she liked, thanks for the quick shipping!!!", "Date": "October 4, 2013"}, {"Title": "Poor Quality", "Author": "Serena Jeffery \"Serena\"", "ReviewID": "R152521G6C4O5T", "Overall": "1.0", "Content": "The camera started off great, but quickly died. The lens wouldn't retract and I couldn't get it to reset. Not sure if this is a common feature, but there it is...", "Date": "October 2, 2013"}, {"Title": "Love it.", "Author": "cheryllleee", "ReviewID": "RVO74DZJ8ZK9K", "Overall": "5.0", "Content": "Great little camera, love the panoramic option. Not as intuitive as previous cybershot models, but still a great bargain for the price.", "Date": "September 8, 2013"}, {"Title": "Love it", "Author": "Fran Foor", "ReviewID": "R1U7M665YHOR8D", "Overall": "5.0", "Content": "I bought it for my sisters 65 birthday. She has never had a digital camera and I wanted to get her into the 21st. century. This did it. She loves it very much! Thanks for the great price.Fran", "Date": "August 25, 2013"}, {"Title": "Sony Digital Camera", "Author": "Faye Carlson \"Book Lover\"", "ReviewID": "R223FYPSF4Y6N", "Overall": "5.0", "Content": "This digital camera was purchased to replace the one lost on vacation.  It is virtually the same all around.  My daughter likes it.", "Date": "August 15, 2013"}, {"Title": "Great camera", "Author": "Christina \"Christina\"", "ReviewID": "R1XTHQ600YCBB6", "Overall": "5.0", "Content": "Takes great pictures,i love it.Great price of course excellent quality from Sony. Nice color too (pink),love it. Arrived quickly,thanks Amazon for fast shipping.", "Date": "August 6, 2013"}, {"Title": "very nice!!", "Author": "Chary L.", "ReviewID": "RYE75KN4TR237", "Overall": "5.0", "Content": "soooo cute and nice camera..i really love the size and color,, and it has a good capture of the pictures,,fast shipping as well!.. i love it1..", "Date": "June 24, 2013"}, {"Title": "Bought for my daughter", "Author": "Tina Powers", "ReviewID": "R2BNX2R9NOV0EZ", "Overall": "5.0", "Content": "Great gift...I have an older model of the Sony Cybershot...and has a few more bells and whistles than this one...but like I said this one is for my daughter...I love it...and a neat feature is the manual is in the camera...under menu options...Great Feature...Great camera...and pictures...easy to use and fast at catching pictures", "Date": "August 5, 2013"}, {"Title": "So far so good!", "Author": "momof2boys \"tod mom\"", "ReviewID": "R1UM9FYHY6FR4W", "Overall": "4.0", "Content": "Great camera for the price so far.  No real complaints.  It does take a little long to focus and take the picture, but overall, great.", "Date": "October 11, 2013"}, {"Title": "Poor Quality", "Author": "Beautiful Heart", "ReviewID": "R37IIP224RLMD5", "Overall": "1.0", "Content": "I do not like this camera. I hate that it is so tiny and light weight. Also took a few test shots and hated the results: blurry and off colored photos. This was a miss for me.", "Date": "June 10, 2013"}], "ProductInfo": {"Price": "$199.95", "Features": "One-touch recording of smooth, high quality 720 HD video clips with stereo sound\nUsing Optical SteadyShot create superb handheld images even when walking\nAutomatic light and focus setting of up to 11 scenes with intelligent auto\nFace Built in Picture Effect Technology\n5 x Optical Zoom", "Name": "Sony DSC-W630/P 16.1MP Cybershot Digital Camera with 2.7-Inch LCD Screen (Pink)", "ImgURL": "http://ecx.images-amazon.com/images/I/51aj-YmPiXL._SX300_.jpg", "ProductID": "B00AY5GRJY"}}