{"Reviews": [{"Title": "Unacceptable", "Author": "PeterB10021", "ReviewID": "R1LEK4C6OQV4RC", "Overall": "1.0", "Content": "This sleeve is improperly sized for the camera. It is too tight to put on properly and even more difficult to remove. The lens cap is unusable with it and the lanyard for the wrist will snap after several pulls. It needs to be resized. It Is unusable it's current state", "Date": "November 27, 2012"}, {"Title": "lytro become one of my best cam", "Author": "Omar Ali", "ReviewID": "R2GLNHHRIYU34C", "Overall": "5.0", "Content": "best new technology camera and the softwear update is great  but if they can produce one with water proof cover", "Date": "August 19, 2013"}, {"Title": "So far it is the best way to carry a Lytro camera around!", "Author": "Jauvane C. de Oliveira \"JVc\"", "ReviewID": "R3L0IQ0LNOLQP7", "Overall": "4.0", "Content": "I ordered this along with a Lytro Camera. While it does not like the Lytro cap (the cap gets stuck on it, so that you should remove the camera cap before pushing it into this sleeve) it protects the camera nicely, allowing one to carry the camera in a pocket (or purse) without risking damage to the front element. I am glad that I acquired it, but I wish it would allow the cap to stay in the camera. That would allow a dual layer of protection to be used at once...", "Date": "May 9, 2013"}, {"Title": "Lytro Sleve - 4 Months on", "Author": "Louis", "ReviewID": "RBUUDQCWNHZ5P", "Overall": "4.0", "Content": "I was offput by the snug nature of the sleeve at first too.  However, after several months taking it in and out it has effectively stretched to an acceptable size.  The lens cap comes out with the camera, the included wrist strap is far superior to the one included with the camera, and the body of my Lytro is in pristine condition despite being kept in a pouch with my metal pens and keys in my bag.", "Date": "April 25, 2013"}, {"Title": "Too snug", "Author": "diana!", "ReviewID": "R20D7XJ0URL4GZ", "Overall": "1.0", "Content": "I like the concept, and the case looks cool, but it's way to snug for the size of the camera so the lense cap gets stuck every single time I try to pull it out. Purchase the zipper one instead.", "Date": "March 28, 2013"}, {"Title": "Poor quality", "Author": "RH \"RH\"", "ReviewID": "RDU7JBGIQ5ECZ", "Overall": "1.0", "Content": "Sleeve is over priced and built poorly. Recommend that you do not buy it till quality is improved.  Shame on lytro to sell such a poorly built product.", "Date": "March 6, 2013"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B00A4MVS6O"}}