{"Reviews": [{"Title": "Nice camera and case", "Author": "pamela Springer", "ReviewID": "R1WF1M6413GQD6", "Overall": "5.0", "Content": "I really like this little bundle. The camera itself is a very easy to use little camera that produces pretty good pictures. The bundle also comes with a very soft Taylor Swift carrying case that is really handy and fashionable. It also comes with a memory card. A perfect bundle set. Makes a great gift.", "Date": "December 30, 2012"}, {"Title": "I really hate it.", "Author": "yuhui qu", "ReviewID": "R1XGVKNX1JUEFG", "Overall": "1.0", "Content": "I ordered a new one for amzon one month ago. I got a used one and really disgusting. I connected to the seller and asked for the refunded. They agreed. I mailed back immediately and they also received it. But now it near 3 weeks, I got nothing. I don't who I should mad at. I need my refund ASAP.", "Date": "August 23, 2013"}, {"Title": "Great for amateurs", "Author": "P. Wilson", "ReviewID": "R1CD5FTOZEPX2A", "Overall": "5.0", "Content": "I am not a photographer.  I take photos for our online business and photos of our family, but by no sense of the word am I a photographer.  I do not know or understand much beyond the basics of point, focus and shoot.  My husband is even more ignorant than I am.  With that said, this camera takes terrific photos with minimal fuss and very nice results.For you all out there who just want to take a photo of a scene, your loved one or a flower, this camera should do you just fine.  The Amazon bundle of accessories makes this a complete photo set up for enthusiastic  amateurs.When my husband can take clear sharp photos with a digital camera without a lot of fussing and cussing, it has to be a good camera.  Richard Avedon he is not!", "Date": "July 20, 2013"}], "ProductInfo": {"Price": "$189.99", "Features": "Cyber-shot® W690 with LE Taylor Swift case and 8GB SD Card.\nCapture more breathtaking shots with Sweep PanoramaTM mode. Available in wide and up to 360° full circle\nIn 720p MP4 movie mode the camera shoots 1280 x 720 high definition movies at 30 fps\nIncludes Battery, Battery Charger, Manual, Wrist strap, Multi-USB Cable, 8GB SD Card and Carrying Case\n16.1 MP with 10x Optical Zoom, 3 inch LCD", "Name": "Sony DSCW690 Taylor Swift Camera Bundle 16.1MP and 10X Optical Zoom", "ImgURL": "http://ecx.images-amazon.com/images/I/51zKjZcgJ2L._SX300_.jpg", "ProductID": "B00AEF22UM"}}