{"Reviews": [{"Title": "As an Amateur Photographer, I Love It", "Author": "Laura", "ReviewID": "R1C2B4AI0KB53F", "Overall": "5.0", "Content": "I'll note right off the bat -- I've been interested in photography for many years and have been honing my skills, but I am not a professional photographer.  As a result, I can only speak to the qualities of this camera that might appeal to beginner/intermediate photographers.  I owned a previous version of the Canon PowerShot and enjoyed it so much that I decided to purchase this newer model.First, the basic specs.  This camera has a 28mm wide-angle lens, a 16 megapixel sensor, DIGIC 4 image processor, image stabilization, settings for shooting in specific conditions (snow, fireworks, etc.) and numerous special effects (black and white, sepia, miniature, pinhole camera, etc.).  It has sensitivity up to ISO 1600, which is perfect for those who often shoot in low lighting situations.  With this type of camera, however, you're just not going to get the excellent low-light resolution that you will with cameras at a higher price point.  This is only noticeable if you're zoomed in on an image taken at a higher ISO; the resolution in brighter conditions is excellent.One of my favorite features about the camera is its 8x optical zoom; this is a great improvement upon the previous model I've owned.  The image quality and stabilization at a higher zoom is excellent, resulting in perfect images every time.The LCD screen is bright and a great size.  It's easy to review previous pictures and compose a shot using the screen.Although I haven't done much beyond simple experimentation with the movie settings, the camera can shoot 720p HD video (25 frames per second).  The few videos I have recorded have been clear, crisp, and high-quality.  It's not a feature I will use often, but it is an attractive feature for those wanting to capture shorter clips of sporting events, concerts, etc.Thus far, the battery life has been great.  There is an \"eco\" mode that conserves battery power without reducing image quality or camera performance.Other features that may be of interest include:* Wi-Fi capability to directly upload pictures* \"Smart shutter,\" which automatically takes a picture when a person smiles or gets into frame* Face ID detection* Color accent effect, which retains just one color and makes the rest of the photo black and whiteOverall, I highly recommend this point-and-shoot camera for amateur photographers or for those who simply want a small, portable camera in addition to a DSLR.  The image quality is great, and the price is very competitive.  Enjoy!", "Date": "March 14, 2013"}, {"Title": "Initial review & Update 1 + correction  - will update with continued usage", "Author": "Michael Rothberg \"Michael\"", "ReviewID": "R3M32LZ62EOR9J", "Overall": "5.0", "Content": "I just received this camera today.  I had done extensive research and comparison with other Canon Elph models before choosing this one.A few factors led to my decision:1. I wanted high resolution and high optical zoom capability. Optical zoom is so important because that governs how much raw info you can capture.  Digital zoom is just software and ultimately will result in pixellation.2. The Wifi capability was intriguing, but not a deal breaker.3. The price point was well under $200 ($169) and this was far below the MSRP.  A note on this - I would have opted for a higher priced camera but this is a second camera to be used on an upcoming trip where I did not want to lug my Canon Rebel EOS and all of its lenses.  I would not have chosen an Elph as a primary camera - but for travel, it seemed to be ideal.4. In keeping with the above, I also wanted something I could drop in my fanny pack or shirt pocket (although I am not likely to do that - shirt pocket that is.)5. I chose Canon because of familiarity with the brand and generally good experience with an older Elph I bought for my wife, and of course the EOS and lenses.6. I definitely did not want the touch screen that was offered on some new models simply because - although convenient - they are a royal pain and I often mis-touch the screen requiring go backs, or cancellations and do overs.  For a device this size, buttons seemed to be a better choice. I do use the touch screen on my Motorola Razr Droid Maxx and have learned to live with its idiosynchracies.  I also read some really negative reviews on the touch screens and didn't want to be a guinea pig.So, now that you understand what my decision factors were, here is what I have learned experimenting for the past few hours:PRO- It is intuitively easy to use, and if you know the menu system on one Canon, you will know it here as well.- It is so small and compact, yet the controls are easy to use and they are responsive.- The installation process (software & User's Guide) was relatively easy, and I was able to copy the PDF file to my Google Drive so I will have it while travelling (sans computer).- The images are incredibly crisp and clear with good to excellent color rendition at the M1 (medium) resolution setting.  I usually opt for the highest resolution, but I'll explain why I didn't in the CONS.  I would suggest you always opt for the highest resolution you can since you can always reduce an image without losing clarity, but if you choose too low a resolution, you will experience pixellation on digital enlargement.CONS- The WiFi capability seems like a really nice feature, but you better not be using Windows XP if you want to WiFi the pics to your computer.  You can use a USB connection however. There is a disclaimer in the documentation that the WiFi will only work with Windows 7 or 8.  You can however WiFi to your smartphone (Droid or iPhone with the appropriate app from Google Playstore or Apple) and then share pics from there, or upload them to your computer via the cloud.- The write speed to the SDHC card is uncomfortably slow if you are shooting rapidly, and using very high resolution. The difference between L and M1 is incredible.  With the L resolution, you wait what appears to be an interminable time before you can shoot the next picture.  It's not really that bad, but it is in the \"seconds\" range.  If it is perceptible enough to be annoying, when testing, it will also be so when out in the field, particularly with action shots.- It would have been nice if Canon included a memory card in the package, but I understand they are trying to keep the price competitive. I'm sure I paid less for a 16GB card than they would have charged.- It also would have been nice if Canon had included a case.  My wife's older Canon Elph came with a quality leather case.  I purchased an after market CaseLogic case for much less than Canon would have charged.- Battery life - I haven't had an opportunity to really test this yet, but I am a little worried since the User Guide states that I will only get about 200 pics per fully charged battery.  Of course there are many variables that contribute to this (i.e., resolution, read/write time to card, ECO mode or not, flash usage or not.)  It's almost impossible to predict exactly how well I will do here, so we'll just have to wait and see.  My concern is that I am going to Scandinavia and Russia, and while I shouldn't have any difficulty charging the battery with the appropriate voltage adaptors, I will probably buy a second battery so I always have a spare charged.(CORRECTION:  You will not need a voltage adaptor.  The charger clearly states 110-240 volts input.  You may need physical plug adapters, although most European hotels have \"American\" outlets for electric shavers, etc.)- Also note that it took almost two hours to charge the \"cold\" battery completely. This will probably be shorter when starting with a partially charged battery.I have not had an opportunity yet to test the myriad of other features, such as the various shooting scenarios, lighting conditions, portrait vs scenic, close up vs panorama.  I will test these and report back when I have information with meaningful metrics. If necessary, I will adjust the 5 stars at that time, but for now, I will give Canon the benefit of the doubt based upon my previous experience with the brand.BOTTOM LINE - I would buy it again, and I am completely comfortable with my decision to not opt for a higher end model with a touch screen.Hope this has been helpful.============================================================================****Update 1 - 5/18/2013Well, the learning saga continues.  It's sort of an adventure.  I actually successfully set up a WiFi connection between the camera and my home network with the target device being my Motorola Razr Droid smartphone.The basic steps are to download and install the Canon app for your smartphone and configure it with some very simple settings.  Then configure the camera with the name of the target device (which you assigned in the previous step.)  You then need to scan for WiFi nets from the camera and select the appropriate net, enter the key, and you are pretty much in business.  You are then ready to share the pics from the phone via email, Facebook or whatever mechanism or website you choose.  Play with it; it won't bite.After a little juggling with the settings, I actually sent the pictures to the phone. On a scale of 1 to 10 with 10 being the most difficult, I would give this about a 4. Time expended: about 40 minutes. Not bad.  And the next time will be even easier.My next task will be to try to set this up on an open WiFi network somewhere else.  I imagine I will have to identify the phone again, and let the camera search the available networks.I also noticed that it gave me an option to connect to another network which is probably the Canon cloud.  The name of the network seemed to identify Canon, the camera model and a sequence number. I haven't tried that yet, but I probably will later.In addition, I can use the phone as a wireless access point, so I may be able to send pics to the phone without being on a network ... essentially a point-to-point net of two devices, the phone and the camera.I'm trying to get as much of this exploration done before my trip next month so I don't get frustrated when under pressure.  So far, so good.  Still five stars!============================================================================", "Date": "May 17, 2013"}, {"Title": "Amazing new features for an excellent price", "Author": "Ali Pezeshkpour", "ReviewID": "RK8EVTL45G2WW", "Overall": "5.0", "Content": "The Canon PowerShot ELPH 130 is the latest Canon PowerShot I've owned, making it probably the third or fourth in about 8 years that I've been using Canon cameras. What draws me to Canon is the amazing picture quality and the ability to truly customize settings, almost as with a digital SLR, without the bulkiness or hefty price tag.This camera is ultra compact. It's perfect for taking with you on hikes, travel, to parties, events, and for any type of photography. The new features that I'll comment on make it definitely worth the money.First, the ability to resize images brings it in line with other makes, like Sony, that have offered that ability for years now. If you are traveling and running low on memory card capacity, then the resize capability is a lifesaver.Second, the WiFi feature is great. It requires you to install a program on your computer or an app on your smartphone, and after initial setup, you can transfer images almost instantly from the camera to another device. This is great, as in the past I have taken both my camera and my smartphone with me on travels so that I could take professional shots (with the camera) and shots for social media (with my phone). Not anymore. Now, it's possible to snap amazing photos with this camera, come back to the hotel, and use the establishment's WiFi to transfer photos to your smartphone, then from there to Facebook, emails, etc.Finally, the 8x optical zoom is amazing. All photos are crisp, sharp, and have excellent lighting. I couldn't ask for more.If you're on the fence as to which camera is right for you, the Canon PowerShot ELPH 130 is the answer.", "Date": "March 15, 2013"}, {"Title": "Canon ELPH 130 Digital Camera", "Author": "MA", "ReviewID": "R1KFW3J1ME7CMJ", "Overall": "5.0", "Content": "Great camera.  I love it.  The pictures are incredible and clear resolution at 16MP.  I also have a Canon T3i and travel alot.  But during travels, the size of the Canon T3i makes it very impractical and heavy.  So the ELPH 130 is my travel camera.  It goes on my hip and takes great pictures.  I especially love the CMOS capability, which makes it a very nice camera for close quarters and limited lighting.  I strongly recommend this camera to anyone looking to buy a camera that takes professional quality pictures at a fraction of the cost of a large professional camera.", "Date": "April 9, 2013"}, {"Title": "Canon Elph 130 vs. 330 vs. 520 vs. 115 (as well as 300 and SD780) -- which one to buy?", "Author": "Samuel Chell", "ReviewID": "R1E6CSVXOA0VD7", "Overall": "5.0", "Content": "[(2/10/14) I'm currently seeing an unbeatable price for the Elph 330 of $120 when ordered in silver directly from Amazon (not the same as \"Prime\").  Recently, Amazon had lowered the price of the Elph 130 below that of any other seller, making it an unbeatable value for Prime subscribers ($93 for the red model).  What you'll get is a pocket rocket with 8X zoom (Canon's most powerful Elph is 12X) plus Wireless Connectivity.  The caveats, or possible \"downsides,\" of the 130: the wide angle lens is an \"acceptable\" 28mm (not 24mm); the DigiProcessor is the previous edition (4th) rather than the current Digic 5; the maximum aperture is f/3.2, which again is \"acceptable\"; the camera does not bear the HS suffix (Canon's guarantee of rock-steady low-light shooting).  With these considerations in mind, the extra $30 for an Elph 330 strikes me as irresistible.]Amazon point and shoot shoppers are pretty savvy, as shown by the current listing of most popular models on Amazon.  Of all Canon Elves, the Elph 110 continues to hold a price that's close to retail ($200), thanks to consumer interest and \"Consumer Reports\" ratings, but it's far from a \"value play.\"  All of the cameras in the title are going for close to, and even under, $100, making each an attractive candidate for anyone looking for a subcompact camera that stands to shoot pictures with better resolution and sharper detail than a smartphone camera.The choice could easily come down to appearance --for example, a preference for the sharp edges and classic boxy look of the compact but highly competent 500 series over the somewhat \"softer\"-looking 130.  But from the low-priced Elph 115 to the Elph 520, the dimensions, features, and actual results will be remarkably similar, with any particular Elph capable of producing the best pictures in the hands of a skilled and experienced photographer.The features that should be of least interest to the shopper are: 1. megapixels (10 is often as good if not better than 20); 2. movie pixels (720 will be as \"high def\" to viewers'  eyes as 1080p); 3. size of screen (2.5\" is as useful as 3\" or larger, and any size can be worthless under a bright overhead sun); 4. the power of the zoom lens (telephoto lenses should not be a priority for the buyer of a subcompact camera--a lens of greater than 5:1 power may be an indication that the buyer should be looking at a larger camera, such as the Canon Powershot 260-280 line).The features that matter most to experienced photographers are: 1. focal length, especially where the wide angle lens is concerned (28mm is good, but 24mm is better, ensuring better focusing because of greater depth of field as well as the possibility of capturing a large cathedral without backing away by an extra block or two); 2. aperture--for low and and indoor available light shooting, a lens that opens up to f2.8 is better than one opening to f3.2. just as a lens that opens to f2.0 (as on my Canon Elph SD4000) will produce measurably better low-light results than an f2.8 lens; 3. \"Burst Mode,\" which is especially useful (if not essential) for capturing images of pets and active children at just the \"right instant\"; 4. face detection and automatic shutter (when I tell my grandkids to hold still for a picture, I'm usually ignored; when, on the other hand, I tell them that the camera will \"magically\" take their picture if they look at it and smile, I or, rather, the camera suddenly has an attentive audience.  5.  Wi-fi, for those photographers who have been spoiled by their smartphones and wish to maintain \"social connectivity\" while having access to a \"Cloud\" where their pictures will be instantly stored and backed up.For most viewers, the Elph 130 comes closest to offering the most features for the least money--a camera that, in 2009, would have cost 2-3 times its present price.  HOWEVER, it doesn't have burst mode and, perhaps more importantly, the wide-angle lens is 28mm rather than 24mm. The Elph 330, therefore, deserves careful consideration for anyone who plans, for example, to shoot pets and appreciates the advantages of a wide-angle over a big zoom lens.  The Elph 520 looks highly attractive--on paper. But despite its ultra compactness and power, the reviews by users have not inspired confidence in the camera.  It's going for close to a hundred, so it may be worth a gamble if you can buy it from Amazon Prime and try it for 30 days (the new Digi 5 processor has not been getting high marks and may require some improvements.  In fact, Canon's newest Elph, the 340 (yet to be released), returns to the proven Digi-4 processor. Personally, I found that Canon's discontinued Elph 300 came closest to satisfying my wish list.  By looking at \"Like New\" models offered by sellers through Prime (for easy returns), I found my Elph at my price point.  Yet I continue to hang on to my \"old\" SD780 for those bright, sunny days since it was Canon's very last Elph with a viewfinder.Finally, you'll need an SD card.  If you plan to take movies, better make it 16GB.  And while you're at it, don't forget to pick up an extra Canon battery (the Canon SX160 may have been the last Canon to take regular alkaline batteries, and some Panasonics still make it easy by requiring a simple plug-in of the camera into any available AC outlet).  If you plan to get a case, be sure to check out the custom-fitted leather ones made by Canon, as some are currently being offered at a steep discount.", "Date": "January 30, 2014"}, {"Title": "nice little camera for casual user", "Author": "julie akyol \"amazon queen\"", "ReviewID": "R1SR1MTX6QOIQU", "Overall": "3.0", "Content": "I purchased this camera early in March and the price is already reduced by $20+ !  Anyway, I am mostly happy with my purchase. What I like: size and light weight, several settings for special effects and different shooting situations, easy to figure out, wifi.  What I don't like: I use an android tablet and do not have the ability to use Canon Image Maker to download and play with my photos...it requires a cd rom to install the program components, :-(.  I was able to download an app to allow the wifi to download to my tablet gallery, but can't make use of what the canon software would allow me to do. This is a big disappointment.  So far, I havent had any problems with battery life....I just came back from vacation and took several hundred pictures with no problems.", "Date": "March 31, 2013"}, {"Title": "Great Camera, Horrible WiFi", "Author": "BlueCrabVintage", "ReviewID": "R2O4SG90QP10A5", "Overall": "4.0", "Content": "If wireless connectivity to your home computer network is important to you then do not buy this camera. I have tried everything from uninstalling and reinstalling the software to 3 times reading the totally useless instructions manual. I would even consider calling in an African witchdoctor if I knew of one in my area and his rates were reasonable. What makes it even more frustrating is that my computer says the camera is connected, even displays the freaking brand and model number, but the camera ain't buying it and continually says no connection found. On the other hand it connects to my smartphone just fine but that is not what I need. Now let me tell you what this camera does well and that is take pictures. Great  outdoor shots and unbelievably great indoor shots of small items such as Jewelry which is very difficult to photograph. And although I have read reviews stating otherwise, I find the battery life to be phenomenal. The anti-shake feature works great as I have yet to have a need to use a tripod. To use this feature is optional which I don't get, I mean why wouldn't you want it on all the time? So to sum it up, the connectivity problems aside I'm happy with this purchase and hope there was some info here that will help you decide if this camera is right for you.", "Date": "November 18, 2013"}, {"Title": "Very Poor Customer Service", "Author": "kirk williams", "ReviewID": "R1J3UQ76MADKEW", "Overall": "1.0", "Content": "I purchased this camera for Christmas of 2013 and it won't take pictures in the vertical position.I spoke with customer service, was told this model a new model , and there was no question that it was in warrantee.I sent it back to Canon, was told it was out of warrantee, and they want $119.00 to fix it!Never again will I buy a cano product and everyone else should take heed!UPDATETHANKS TO AMAZON'S OFFER TO  ACCEPT THE RETURN  OF THE CAMERA, CANON DECIDED TO CHANGETHEIR MINDS AND SEND ME A NEW CAMERA.AMAZON IS A CLASS OPERATION!!", "Date": "March 20, 2014"}, {"Title": "Nice camera, memory card errors cause picture loss", "Author": "Adam Bliss", "ReviewID": "RACPTM5TY1K59", "Overall": "1.0", "Content": "We purchased ours over a year ago. The camera reported memory card issues a few times and each time we lost some pictures. I've reformatted the card a few times but the issues return intermittently. I'm currently running a different memory card and the camera reported another error and this time the entire card seems to be unreadable. These are brand name cards, class 10 speed. I finally realized that it's the camera. Maybe I have a lemon..I don't know. I have other Canon camera's operate well, but I can't recommend this model.", "Date": "December 26, 2013"}, {"Title": "Poor focus in low light", "Author": "Eve B.", "ReviewID": "R263K9M6D2EGGD", "Overall": "3.0", "Content": "I've owned Canon, Fuji, Nikon, Olympus, and Panasonic digicams in the $100-$200 range.  I know how to focus and shoot a digicam under low light conditions.  Having read glowing reviews both by professionals and users, I thought the Powershot ELPH would suit my needs, once the price dropped to nearly half of msrp.This is the only Canon I've had that focused so poorly in zoom mode, and under moderately low light conditions.  I don't know if I just got a lemon.  After failing that criterion, I did not even want to explore the rest.  My mistake was the lure of the pricepoint. I could have gotten a more spendy Canon HS (high sensitivity) model which takes better low light pictures.I returned this for a FinePix F660EXR.When they say the ELPH models are small, they mean it! I am female with child sized hands and fingers. The selector circle is so small,  I found it easier to use a fingernail than a fingertip to activate the piece of the circle I needed to hit. I have never had to do that on any other camera. If you just put it on auto, drilling through menus should not be problematic for you.On a right-handed gripping position, my fingers look for a rest on the camera face. The only thing to hang onto, on the front is the slightly raised metal logo with sharply defined edges. Would have preferred a rubber grip there, or a smoothly beveled logo. If I'd have kept the camera, I would have stuck a dorky silicone nosepad over it. It may be nitpicky but it detracts from the comfort of handling the camera.Pros- Metal construction with metal (not plastic) tripod mount- Ultra Compact- Large 3\" screen- Intuitive menu controlsCons- Impossibly small selector dial- Poor focus in low light zoom- Rough Canon logo", "Date": "November 22, 2013"}, {"Title": "This is a nice, light weight camera.", "Author": "ElaineJ", "ReviewID": "R194CTN3CXE86M", "Overall": "5.0", "Content": "I bought this because it was a Canon and I wanted something that I could just slip into any bag. It takes great photos for a point and shoot. It's battery life is very good.", "Date": "July 31, 2013"}, {"Title": "Great camera for a great price!", "Author": "aubrey", "ReviewID": "RUR6OURWW26LL", "Overall": "5.0", "Content": "Perhaps this is just coming from a girl whose previous camera was a piece of junk, but this camera is fantastic!  The pictures are crisp and clear, the flash reloads quickly, and the battery seems to have a very long life.  The digital zoom even produces decent quality pics, which is incredibly rare with this kind of camera.I am still exploring the extra features, but those that I have seen so far are too much fun!If I had to pick one piece for improvement, I would want the shutter speed to be a smidge faster, but it really isn't that slow at all.I would absolutely recommend this camera to someone looking for a quality, inexpensive, point-and-shoot with tons of settings that takes excellent pictures.", "Date": "September 7, 2013"}, {"Title": "Canon Rights a Wrong", "Author": "jbcmass \"jbcmass\"", "ReviewID": "R2VLC0GXTU848K", "Overall": "4.0", "Content": "We have had a number of Canon Elphs over the years and we have been very pleased with their performance.  We bought our last one (SD1100IS) over 4 years ago.  We have had this unit (Canon Elph 130 IS) for just over a month and have been very disappointed with it.  The pictures are not sharp (at any zoom) and the automatic lighting adjustments tend to overexpose the pictures.  We are looking to see if we can return it - the 30 days is up from Amazon but we may be able to return it as defective through our credit card.  I definitely would not recommend this camera to anyone.10/14/2013 Update - I decided to return the camera to Canon under warranty. Within 5 days of sending it back, I received a refurbished camera from Canon.  This one works much better.  The lighting is correct and the focus is much better - not perfect, but pretty good (perhaps I am spoiled by my Canon DSLR and L series lenses).  While the one I bought was a dud, Canon was able to quickly right a wrong.  I now rate the camera a 4 out of 5.", "Date": "September 1, 2013"}, {"Title": "It Works", "Author": "Debby", "ReviewID": "R2OD6ZPR0GS3MP", "Overall": "5.0", "Content": "I don't have a cell phone camera, so this nifty little gadget works for me. Excellent focus, beautiful color, and some pretty amazing automatic stuff. I'm glad I bought it.", "Date": "August 2, 2013"}, {"Title": "Super small modestly priced bargain", "Author": "C. J. Clavadetscher \"quickshot carl\"", "ReviewID": "R1PVEGG89ZK3WU", "Overall": "5.0", "Content": "I own a lot of cameras. The one in my pocket is the ELPH 130 IS. It is at the low end of my set price wise. It is near the top in quality overall and features. Want one camera on a budget that will take quality pictures, zoom in and grab those images, at a really modest price? This is it.", "Date": "December 24, 2013"}, {"Title": "Love the Canon Elph cameras", "Author": "BB", "ReviewID": "R2CNFI5KXZ0AMG", "Overall": "5.0", "Content": "This is my third Canon Elph camera in the past 10 or so years.  I can't say enough good things about these cameras.  The only reason I got this one is because mine got dropped on a fishing pier while on vacation. Surprising it did NOT break the camera lens . It still take pictures-but I couldn't review them on the old camera . I had to put the SD card in a computer to view them.  This new camera is a couple years newer model from my old one.  I LOVE IT!  Awesome pictures. Easy to use. Easy to download and great for fitting in my purse, pockets, camera bag!  Also great price!", "Date": "December 14, 2013"}, {"Title": "Great Customer Service-Replacement", "Author": "Casey Ruggles", "ReviewID": "R33S6181E4C82Y", "Overall": "4.0", "Content": "I received the camera and it worked fine for about a day. The next day, a \"lens error\" would show up and it would not let me power the camera on. I called amazon and I spoke to a woman who was very nice and helpful and said they could send me a replacement that would arrive two days from now. Since this was a time sensitive issue I was very impressed it arrived so quickly. The new version works great and could not be happier. I was frustrated at first but after dealing with great customer service, I wasn't so bothered by it.", "Date": "November 28, 2013"}, {"Title": "Excellent Camera", "Author": "Bob C", "ReviewID": "RJR5MP8825U8U", "Overall": "5.0", "Content": "This camera takes great pictures. Stability system seems to work well with zoom to eliminate most blur caused by shaking.", "Date": "May 28, 2013"}, {"Title": "GREAT!", "Author": "The1one", "ReviewID": "R3T0193FTAFA31", "Overall": "5.0", "Content": "This is my 3rd Canon Powershot upgrade.  It just keeps getting better.  I LOVE this camera from the bigger LCD screen to the ability to send pics to Facebook and other social networks via Wi-Fi w/o the use of a usb cord.  It's light and easy to operate and the zoom is great! Keep up the good work Canon!", "Date": "August 30, 2013"}, {"Title": "Love my little canon powershot", "Author": "Rachel Diaz", "ReviewID": "R2IL7029DYNCD7", "Overall": "5.0", "Content": "The small size is great and the pictures look like a professional photographer took them! I would definitely recommend it to anyone.", "Date": "August 9, 2013"}, {"Title": "Get Ready for the WOW Factor!!", "Author": "Amanda Scholz", "ReviewID": "R3T7RV48FRX4IP", "Overall": "4.0", "Content": "So,I would say I LOVE this camera with the small exception that it doesn't do fast/action shots very well.  And by not very well, I mean that it does all right its just not quite as quick as I'd like.  I also readily admit that it could be user ignorance on what my settings should be.I should mention that I had an older model of this until I dropped it in some water, twice.  I LOVED that camera which made me look to the same brand and model for my replacement.  A lot of the reviews I read said that this camera didn't do night shots very well...I call BS.  I haven't had a camera that does night shots so well, EVER.  No tri-pod needed and I'm getting minimal to no shake and crisp brilliant photos at night.  I use the camera for a lot of close up macro-shots for my jewelry business and it does brilliantly at that.  I love the different functions and the ease of use.I haven't tapped into the wireless settings.  Could be easy, but they are hard enough to set up that I just haven't bothered yet.  That wasn't really a factor when I made my decision.I have had this camera for about a month now and the more I use it, the more I love it.  I'm going to do some research to see if I can't figure out how to get some nice action shots out of it.  It used to be a kids and pets setting on my old one that did the trick but this one doesn't have that.I would say that if you are looking for a point and shoot that takes exceptional photos that is easy to use and fits in your pocket...this is your ticket.Happy shopping!", "Date": "June 19, 2013"}, {"Title": "Canon PowerShot ELPH 130 IS 16.0 MP Digital Camera with 8x Optical Zoom...", "Author": "Sandy S \"Sandy S\"", "ReviewID": "R210A4SNW6E1MW", "Overall": "5.0", "Content": "I bought this to replace the exact same one that I ran over with our 4X4 a few days ago. My old one was great and I took about 100 pictures with this new one and it takes awesome pictures. I'm very happy with it and wouldn't hesitate to recommend it. It is light weight and small enough to easily fit into a small purse or a pocket.", "Date": "October 18, 2013"}, {"Title": "Good camera", "Author": "Jenica", "ReviewID": "RV6I5TSLG8A30", "Overall": "5.0", "Content": "This camera works great! Its very easy to use and I love how fast the camera takes pictures. Although its not the fastest it takes pictures in a timely manner.", "Date": "December 5, 2013"}, {"Title": "Nice Camera With A Terrible Battery", "Author": "George", "ReviewID": "R13341940P0U1Z", "Overall": "3.0", "Content": "This is a really nice little camera ruined by a very bad power/charging feature set. This camera has a really nice large screen... that's powered by a pathetic 680mAh battery. I fully charged it after unboxing, and about 2 hours after fiddling around with the settings and taking only 2 pictures with it, the low battery icon started flashing, already down to 1/3 power.Here's the deal breaker: it won't charge over USB. Seriously? Call me demanding but it's simply unacceptable for a new product like this in 2013 to not charge over USB. After 5 hours plugged into a USB wall charger it hadn't charged at all.To have a really low power battery that discharges so fast just exacerbates this issue. Canon seriously expects me to lug around the charger that's literally the same size as the camera? It's about 1/3 thicker than the camera itself and almost 90% as long. There's not much point in having a nice compact camera if we have to lug around this massive battery charger along with it.I could live with the short battery life if it would charge over USB, but its failure to do this makes this item useless to me.Canon: put a higher capacity battery in your next camera and put a micro USB connector on it that I can charge with my cell phone chargers and I will buy it. But this one is going back.", "Date": "March 25, 2013"}, {"Title": "Great Camera/Price", "Author": "Mitch \"Jerry\"", "ReviewID": "R1BKR2T2M52P2M", "Overall": "5.0", "Content": "The Elph 130 IS  takes excellent photo's and fits in your pocket with ease.  I have several cameras, Nikon D2X ($5000 Body), D300 ($2000), Sony RX100 ($700), Sony Cyber-shot DSC-TX200V ($600) and other small compacts.  This Elph takes just as good of a picture as the others I own.  I mainly bought it because of the size and the WiFi feature.  This was a great purchase at an excellent price, very happy.  Make sure you use at least a class 10 memory card.", "Date": "January 4, 2014"}, {"Title": "Nice for the price!", "Author": "Tom", "ReviewID": "R18XU2Z2QBHQBK", "Overall": "5.0", "Content": "Very small and thin, good zoom, re-chargeable battery. Great point and shoot camera. Don't expect miracles with any camera that costs about $100. Came with a soft case", "Date": "December 4, 2013"}, {"Title": "Outstanding value for a quality product", "Author": "Willie of Virginia \"Golf is my Passion\"", "ReviewID": "R1TFQVNH5F0OTL", "Overall": "5.0", "Content": "Easy to use, even for my wife whose hands shake. The picture comes out crisp and clear just point and click.", "Date": "December 2, 2013"}, {"Title": "Great Camera", "Author": "plinkerman", "ReviewID": "R3HAGBDPRAB9WD", "Overall": "5.0", "Content": "I love this camera!  Takes pictures in low light like a champ and the automatic mode takes all the work and mistakes out of getting a great picture.  Very small yet has a big screen to view your scenes.  Batteries charge up fairly quickly and the software is easy to do.  Can get 100+ pictures before another battery is needed with the 32 gb card I purchased seperately.  Really nice little camera!!", "Date": "November 22, 2013"}, {"Title": "Great little pocket camera for vacations", "Author": "AZHome \"AZHome\"", "ReviewID": "RPM0UN6IHS86E", "Overall": "4.0", "Content": "Takes great pictures, it's compact and good for taking on vacations.  But as with many point and shoot digital cameras, it decides when to trip the shutter.  Not so great for action shots and moving subjects.", "Date": "November 23, 2013"}, {"Title": "Terrible Software", "Author": "sifxtreme", "ReviewID": "R1ADWLDDY876Y3", "Overall": "1.0", "Content": "The software to install on the computer is a pain in the butt! It is also extremely difficult to connect to Wifi which is the whole selling point of this camera. Very frustrated with the software side of this camera.", "Date": "May 25, 2014"}, {"Title": "Nice!", "Author": "J. Brad Yeates \"ForeJacks\"", "ReviewID": "RYILV1ALKC3X2", "Overall": "5.0", "Content": "Great little camera. Works very well. Super clear shots. Easy to use and easy to use all the functions. Love the battery charging.", "Date": "December 11, 2013"}, {"Title": "Great Point and Shoot Camera", "Author": "Wizzard \"gwitte2\"", "ReviewID": "R1HF05MLG2Z8XF", "Overall": "5.0", "Content": "This camera is great.  It takes excellent pictures.  The 8X optical zoom is fantastic.  The size is perfect for my needs.  The one button video record capability is a nice feature.  I am very satisfied.", "Date": "November 14, 2013"}, {"Title": "Canon standard of awesomeness", "Author": "Kevin", "ReviewID": "R3A324UVOKZQ3M", "Overall": "5.0", "Content": "Got this to replace an old powershot. Love the Canon powershot series. Small, compact, and fast. Packed with software features that I don't even use, but friends who have the same camera love the extra features.", "Date": "October 3, 2013"}, {"Title": "a tad slow", "Author": "Pontifex", "ReviewID": "R27AHUQEUO2P7T", "Overall": "3.0", "Content": "good camera with nice features and capacity. it is a tad slow when taking one picture to the next, even with a high speed memory card.", "Date": "September 30, 2013"}, {"Title": "Does not have same shooting modes as previous models", "Author": "katealex4", "ReviewID": "R20O9JABKQOO76", "Overall": "3.0", "Content": "I bought this camera about a year and a half ago and was very happy with it.  Unfortunately, I got sand in the lens over the summer and could not get it to work again.  I replaced it with the current model and was very unhappy when I went to use it and realized it didn't have all the same shooting modes as my other one.  Of course it was missing the ones I use the most  - kids/pets (for objects that are moving) and high speed burst (quick sequences of pictures).  I had to return the camera.  This newer model may have more zoom and wifi, but I cannot use it and liked the old model better.", "Date": "October 31, 2013"}, {"Title": "Set Up Is Painful", "Author": "Ranada", "ReviewID": "R2YU1VFMF6IF9H", "Overall": "1.0", "Content": "My boyfriend and I have been setting up this camera for hours and we're still not done.  You have to install software, register the camera, register for an account on their website, download updated software (because the original software they provided is outdated).  It is truly as un-user-friendly as it could possibly be.  The camera better be awesome to make up for this hassle.  So far I'm beyond disappointed in the product.  Also, the whole point of getting the camera was for the wi-fi function and despite the hours we have spent installing and re-installating software and registering and re-registering for accounts, the wi-fi still is not working.  Sheesh!", "Date": "June 3, 2014"}, {"Title": "inferior", "Author": "G. Burnick", "ReviewID": "R14I8RPV148TQX", "Overall": "1.0", "Content": "I'm a Canon Elph fan -- have had several and still do. Wanted to upgrade to a 16mp. I got this and compared same images taken with my 10mp. My 10mp took much better photos. In fact, these were particularly dark. Returned this immediately.", "Date": "May 18, 2014"}, {"Title": "Very disappointed in camera", "Author": "David Zhang", "ReviewID": "RQO9U2WC7HA7", "Overall": "1.0", "Content": "We bought the camera for our vacation to Florida. I've never had a problem with Canon cameras before this one. Unfortunately, we were very disappointed with this particular model. Although all the photos had a yellowy tinge, we figured it was a cheaper camera and had no complaints because it worked fine. Three days into using the camera, it has completely stopped working. We still can't figure out what is wrong with it as it will not turn on. We will be contacting Amazon to see what they can do for us.", "Date": "April 25, 2014"}, {"Title": "The quality isn't there...", "Author": "jediblulady", "ReviewID": "R31L9HDZ6NB90F", "Overall": "3.0", "Content": "I bought the OLD version of this camera and LOVED it. When that camera was broken I just figured I'd buy the most recent version... most of my images are really grainy even on the highest resolution. This works for quick snaps, but just doesn't have the quality I'm used to...", "Date": "March 9, 2014"}, {"Title": "Great camera for the price", "Author": "Seattle Thinker \"Fred\"", "ReviewID": "R3TZMG4UET5JKQ", "Overall": "5.0", "Content": "Obviously, this is not a DSLR, but for the price, it is great. All the pics I took with it while traveling were super sharp and the colors are great - even the ones taken from a moving car. Highly recommended.", "Date": "December 20, 2013"}, {"Title": "Technology goes up and price comes down", "Author": "J. Hess", "ReviewID": "R25CESYCDYWNKZ", "Overall": "5.0", "Content": "I have used an earlierr model elph which I thought was great. This new model with wi-fi and increased resolution exceeded my expectations and at a great price.", "Date": "December 7, 2013"}, {"Title": "Great features and price", "Author": "Jameson", "ReviewID": "R1XQHXH54VW52F", "Overall": "5.0", "Content": "Great small size with incredible picture quality and good zoom capabilities for such a small camera. The vidoe button comes in very handy when someting  is happening that you want to catch on video right away.", "Date": "November 25, 2013"}, {"Title": "good camera love the wifi", "Author": "Son of Detroit \"Robb L.\"", "ReviewID": "R1EH55W6F2CQPJ", "Overall": "5.0", "Content": "I don't like taking pictures with my phone,it's got a good camera(Samsung s3).  this camera has a wi-fi option that's pretty cool, yes im a little of a geek so it took a little bit to get the camera to connect to my phone, my wifes phone, the computer, etc.  o.k. the camera, I geeked out! it takes great shots, small camera size-wise, zoom works great(8x's optical is awesome), works o.k. in low-light(unless you drop$$$ you not gonna find a point and shoot camera that takes GREAT pictures in low-light). large, easy-to-use lcd screen on back.", "Date": "August 25, 2013"}, {"Title": "Canon Powershot ELPH 130", "Author": "Newkster", "ReviewID": "R2A1PECKPDOK6B", "Overall": "4.0", "Content": "This camera has met all my needs. It works as advertised. Pictures are excellent and stabilization  is very good. The only issue is that the camera battery cannot me charged through the USB cable.", "Date": "July 18, 2013"}, {"Title": "Disappointed", "Author": "Russell J Hall \"Lighthall\"", "ReviewID": "R1RB6ZYJAZU66P", "Overall": "3.0", "Content": "This is my third Canon digital elph. I've carried them with me while backpacking, and have gotten many excellent images with them. I have owned this latest one for several months and so far have captured nearly 1,200 images with it. I selected this model primarily for its optics, the 8x optical zoom and wide angle capability being particularly attractive. This combination is rare in small cameras and, as things appear, may be too good to be true. Particularly in the wide angle mode, which I've used normally for landscape shots, and in certain lighting conditions, a disturbing fogginess appears near the center of images. One might think there was a smudge on the lens, but the problem does not appear in images made in close-up or telephoto modes. My guess is that extraneous light is getting in when shooting wide-angle photos. Overall the camera has performed competently, but some otherwise excellent images are flawed and unusable.", "Date": "July 2, 2013"}, {"Title": "Takes nice photos", "Author": "Dee", "ReviewID": "R39RZPVPH76FSJ", "Overall": "4.0", "Content": "Great point and shoot camera with quality photos. The only problem is that you have to remove the battery to charge it.", "Date": "June 27, 2013"}, {"Title": "Good Looking Specs; Focuses Poorly", "Author": "Jayhawk Aviator", "ReviewID": "R3UEDUW5T3QPDA", "Overall": "2.0", "Content": "We bought this camera and tried it.  I don't know if it was just our particular one or the model in general, but this one we had just would NOT focus with any quality at all when zoomed at all (optical, not digital).  We had digital zoom off, which means we were using only optical zoom.  At my daughter's school play, about 40% of the photos were unfocused or slightly out of focus when taken on medium zoom (probably about 4-5x of the 8x range).Anyway, we returned this and went back to our five plus year old Canon Powershot.  Specs aren't anywhere near as good as this one purports to be, but it focuses quickly and takes good photos.  I wanted to try to get a better optical zoom but I don't think this one can do it.  DSLRs are out because of the bulk.  I would not recommend this.", "Date": "April 10, 2013"}, {"Title": "Cool Delivery", "Author": "Shirley Capron", "ReviewID": "R2WWWDWTDY6D6J", "Overall": "5.0", "Content": "I was impressed how fast the Camera came. in just 3 days I got it.Also it works beautifully. I love the camera and would recommend it to my friends. I love the Zoom on it. Thanks again.", "Date": "May 25, 2014"}, {"Title": "Canon Power Shot ELPH 130 IS", "Author": "millerbe", "ReviewID": "R3FKGZ1GZKAVKY", "Overall": "5.0", "Content": "Nice little camera so far.  I downloaded everything easily.  My only problem has bee working with the picture file.  All my pictures from the old file transferred but I still can't figure out how to attach.  I actually began taking pictures the very first night even though I am not very digital savvy.", "Date": "May 21, 2014"}, {"Title": "Nice simple little camera.", "Author": "F. Stuart Phillips", "ReviewID": "R1A57DN0XNKHTU", "Overall": "5.0", "Content": "Camera is just what I wanted. Sweet little camera to keep in a pack or pocket. It was easy to set up and easy to use.", "Date": "May 19, 2014"}, {"Title": "Battery and Camera Died Quickly", "Author": "H. Knapp", "ReviewID": "RQ1T29FFYJU8F", "Overall": "3.0", "Content": "Excellent camera but that rechargable battery cost us a good shot.  My \"shutter-bug spouse\" says it gave no warning of it's low charge condition.  Just failed to take the picture.  Then and only then it told her the battery was depleted.  :-(Added 5/25/14:  Lens locked up. Tried everything but nothing worked.  This camera died as suddenly as its battery.  No warning, damage, water - just locked and died.  Good camera for two years.", "Date": "May 17, 2014"}, {"Title": "Great compact camera", "Author": "Paul C. Aaron", "ReviewID": "R1JICFJ969635A", "Overall": "5.0", "Content": "This camera really performs like the much more expensive ones. I wanted a compact camera to take on a 3 country tour of Europe and not have to carry around a large weight around my neck. This little camera fits in my shirt or pants pocket so it was always with me. I took over 250 pictures in 8 days and did not have one single bad picture. It did great night shots, indoor shots (with or without flash), and the movie feature was really nice to gather the night lights of Budapest and the Danube. VERY easy to use. The only change I made from time to time was the flash for museums and churches that did not allow flash. Those shots came out great.", "Date": "May 12, 2014"}, {"Title": "Best little digital so fn", "Author": "Susie", "ReviewID": "R56DEUC1Z36BI", "Overall": "5.0", "Content": "Point and shoot with ease and nice quality that is good enough to make photo books and the like. I love my cell phone camera, but the quality  is not as good as this nice little Canon.", "Date": "May 11, 2014"}, {"Title": "Great little camera", "Author": "JEG \"CTreader\"", "ReviewID": "R17SPBP4BVS20P", "Overall": "5.0", "Content": "Have had this for three years now.  Takes great pictures.  Easy to use.  Very compact.  Zoom feature excellent. Only problem is I sometimes turn on the video when I only want pictures.  Small size makes it easy to accidentally hit button.  Probably not for the really serious photographer, but it makes me look like a much better one than I used to be.", "Date": "May 6, 2014"}, {"Title": "The ELPH is the greatest!", "Author": "Lynda Gray", "ReviewID": "R19MRFIBJJYLKP", "Overall": "4.0", "Content": "The Canon PowerShot ELPH 130 is a great little camera.  It is convenient enough to carry in my purse so it's handy whenever I need it.  I'm really impressed with the clarity of the pictures.....for such a small camera, it is full of the latest technology.  I haven't had a chance yet to try out all of the manual settings; thus the 4 stars.  I'm sure I will be getting my money's worth and then some from it.", "Date": "April 27, 2014"}, {"Title": "Great camera", "Author": "shelley kimbel", "ReviewID": "R377ZM2G2DP6DD", "Overall": "5.0", "Content": "I really love this camera although setting it up was not as easy as I thought the instructions helped but the process needs to be a little more simpler other than that love the camera", "Date": "April 27, 2014"}, {"Title": "Easy to use camera", "Author": "Lauren Swan", "ReviewID": "RQ6LFOT8DHIOY", "Overall": "5.0", "Content": "I have purchased several of these cameras over the years. If you treat it right its a great little camera. Lightweight, takes great photos. The only downfall is when the camera does not survive your drunken shenanigans. Camera is not friends with liquid, especially beer.", "Date": "April 23, 2014"}, {"Title": "The metalic RED body camera will leave a red glare on certain pictures", "Author": "tonibag \"tonibag\"", "ReviewID": "R3GQZDJ7D8A16Z", "Overall": "4.0", "Content": "First off....LOVE the mechanics of the camera, easy to use, \"most\" pictures come out great.  I purchased the metalic red bodied camera because it was cheaper and it was in stock.....I didn't particularly care how it looked.  I use this camera primarily for items I post to Ebay.  Most of my pictures come out great.......BUT, if you are close-up photographing an item that might have a reflective surface (a knife blade, silverware, crystal jewelry) you WILL have redness on the reflective surfaces in your finished photo.  The red metal camera body reflects.  Again....this was only an issue for close-up pictures of reflective items that I sell on Ebay......unfortunately for me, that is a lot of pictures.  Also unfortunately I figured this out too late to exchange it.Buy this camera, but to play it safe, just don't get the red bodied version.", "Date": "March 26, 2014"}, {"Title": "Compact and outstanding", "Author": "Claudio Andre Heckler", "ReviewID": "R7D1U6OG992J5", "Overall": "5.0", "Content": "This little gem is very compact but packs great features. Its full-auto mode gets most shot right without demanding much from the user, while the scene and semi-manual modes allow for creativity and more targeted shooting.Battery life is better than I'd expect for such a small cell, have taken a couple hundred photos on the very first charge (about 1 in 10 with flash) before it needed recharging.The \"panorama\" mode was confusing at first, I expected it to stitch the photos in the camera, but it is mainly an alignment aid; once I got that, it became clear how to use it.Cannot comment on wifi as I have not used, nor I intend to. To post directly to social media is something I do from my phone, not the camera.  Instead of wifi, I'd have liked more if there was a GPS option to geo-tag photos, that'd use constantly ...Final thoughs: this is an excellent compact camera, and so small I am prone to have it always on me; a great companion to the DSLR, but also would not look bad as your main camera if you're not too demanding.", "Date": "March 11, 2014"}, {"Title": "I purchased this as a gift for my mom", "Author": "Shelby", "ReviewID": "RLNVIFHOS5BRC", "Overall": "4.0", "Content": "I wanted to get her a camera that was easy to learn and to use regularly, and I would say overall this camera does that for her. The one negative thing I would say is that sometimes the camera is trying to focus on faces so long that it misses the shot entirely, which is a little disappointing. Overall I am satisfied with this purchase, though.", "Date": "February 20, 2014"}, {"Title": "Very poor battery life", "Author": "bilwhit", "ReviewID": "R3539A1477EA7G", "Overall": "3.0", "Content": "Nice little camera. I was looking for the slimmest camera available, which would have been a certain Samsung.  But the much better zoom on this one made me buy it instead.  However, the battery is a problem.  I charged it one day, carried it around a few days, took maybe 7 or 8 trial photos, then later the battery was drained.  I've recharged it and recorded the date (2-3-14) and I'll see how it goes.", "Date": "February 7, 2014"}, {"Title": "Very happy", "Author": "Chelsea Anne \"Chelsea\"", "ReviewID": "R1QFS6XF1DWMDV", "Overall": "4.0", "Content": "This is a great camera. I love the wireless function for my ipad and phone (when it works...) and it does take good photos. I admit, the series I owned before this (also Canon Powershot) took better photos, but these are still great and I love this camera.", "Date": "December 3, 2013"}, {"Title": "Nice design, lots of fun settings, decent camera", "Author": "Artist Maur611", "ReviewID": "RHPN6NL35XEYA", "Overall": "4.0", "Content": "Packaged well, in standard Canon box with all the gadgets. Overall I like the camera however I'm slightly disappointed with the color resolution and more let down by the zoom quality. Vivid mode is waaaayy too saturated in my opinion and for a standard shot with no effects or flash I feel most colors are too unsaturated, then again I haven't used it excessively so maybe I need more time to configure my personal settings (I prefer manual over auto anyway). When going into full optical zoom, obviously we're not using an SLR zoom lens, but the pictures are certainly blurred and pixelated. In general I found zooming in caused a lot of blurry problems, it seemed a little harder than my last powershot to focus on images (which I don't understand because that one was from '09). On occasion I get poor quick shots as well- given they are quick shots, but I believe a point and shoot is supposed to be designed for capturing a moment quickly and efficiently. They aren't terrible, just slightly blurry or over exposed.These comments are very nit picky rather than obvious issues I'm finding with the device. I have not owned a point and shoot in a while and only have had an SLR so I just need to get used to the change in quality, but it has impressed me and I'm glad I chose this camera over other canon's. It has just the right amount of necessary features and MP to get you really great quality and also give you options.", "Date": "November 4, 2013"}, {"Title": "Decent camera", "Author": "Vu Hoang", "ReviewID": "RCYQSXCOP7NFJ", "Overall": "3.0", "Content": "This camera takes better pictures that the Canon A\"x\" (been a while so i forgot the exact model) as well as the Canon IOS cameras that we've had in the past.It was fast at first few pictures but then slow down.  We use the Sandisk 64GB Ultra SDXC (30MB/s) and thought that was the bottle neck.  After newly reformatting the card, the speed didn't quite improve.  Not sure what the problem is.It's small enough to fit in any pocket (just remember not to sit on it while it's on the back pocket.)The battery life is pretty decent.Overall, it's a good camera.  I would recommend this to anyone.", "Date": "August 22, 2013"}, {"Title": "This is the way to go if you don't call yourself a pro.", "Author": "Carolyn Seidl", "ReviewID": "R2G8LE5KR2TTOO", "Overall": "5.0", "Content": "Takes great pics and has a nice zoom.  I'm not trying to take professional pics but I do like quality and this camera takes wonderful pics.  The speed at which pics are taken is pretty good.  It take the camera a few seconds to be ready to take the next pic but it works for me.", "Date": "July 12, 2013"}, {"Title": "Have always liked the digital ELPHs.", "Author": "Euphorbia", "ReviewID": "RAI6XPQZSWOAG", "Overall": "4.0", "Content": "Wireless doesn't work with a Mac... too bad.  Otherwise nice features.  Sometimes doesn't focus on particular colors up close (ie for macro shots.)  Sort of hard to navigate the themes compared to older versions.  Nice for wide landscape shots though.  Also no touchscreen on this one, which is a good thing.", "Date": "July 10, 2013"}, {"Title": "Poorer image quality than my previous ELPH", "Author": "Sheri", "ReviewID": "R30VM0C6W7GQB8", "Overall": "1.0", "Content": "This camera was a replacement for an older model ELPH that I used in my work, but the image quality is so much poorer than its predecessor that I'm going to have to buy another camera to replace the replacement. The older ELPH took excellent macro photos with crisp details, but this one's photos aren't sharp at any distance. I've seen smartphone photos that were much higher quality, so I can't even recommend this camera for casual use.", "Date": "March 31, 2014"}, {"Title": "Like the wi-fi, great camera, prefer this over a touch screen version", "Author": "Heather M", "ReviewID": "R19NC1EC1RK3BG", "Overall": "5.0", "Content": "Great camera - I've owned a few PowerShots and this one is great!  I use the wi-fi feature.  I did purchase a touch screen version previously and returned it as the functions were hard to use on the touch screen.  I definitely prefer buttons - I don't have fat fingers, but the touch screen made me feel like I did.", "Date": "November 14, 2013"}, {"Title": "Don't buy", "Author": "Pleasant", "ReviewID": "R24RPRGVWRXP9", "Overall": "1.0", "Content": "This camera has a yellow tint on all the photos.  I wanted to return but was beyond the 30 days.  The price was reduced and I can see why. Poor quality.", "Date": "December 26, 2013"}, {"Title": "Ok camera works good", "Author": "Victor A. Steckhan \"Viktory2k1\"", "ReviewID": "R3S6Z8DBCSK9Y0", "Overall": "4.0", "Content": "Camera actually works great. Long battery life and lots of options.My only complaint is windows xp will not allow wi-fi function to work.Otherwise I would have given it 5 stars", "Date": "April 18, 2013"}, {"Title": "Small compact", "Author": "Shenejm", "ReviewID": "RSR5T8BIC5CSV", "Overall": "4.0", "Content": "I bought this camera for my daughter to take to Paris... upon her return I was amazed by the photos she took... Clear and colorful.. She enjoyed using the camera and said it was a joy to carry because of its size... I liked it due to the Wi-Fi connectivity she was able to take pictures and transfer them to her phone and send us photos daily of her adventures....", "Date": "June 2, 2014"}, {"Title": "awesome", "Author": "jeeplover", "ReviewID": "R299S874EFD1JR", "Overall": "5.0", "Content": "this camera is the best I've used for a point and shoot camera. It has some awesome features, and it takes incredible close-up pictures!no complaints", "Date": "June 1, 2014"}, {"Title": "Packs a lot of power", "Author": "Jocelynleah", "ReviewID": "R380V19DZXI1EL", "Overall": "5.0", "Content": "For such a tiny little camera and a reasonable price, this thing is quite awesome! I have yet to sit down and learn how to actually use all the settings on it, but I recently recorded a video of my daughter's dance recital from the furthest back and highest up row in a performing arts center, and the camera was able to zoom right in to focus on my daughter with a picture that was MUCH BETTER than I expected... I was really, really far away.... My dad kept saying that he couldn't get over how great of a video it was for such a tiny little camera and from such a distance... I am very happy with this purchase!", "Date": "May 30, 2014"}, {"Title": "I would give this a 3 1/2 start", "Author": "micheal scott loew", "ReviewID": "R1K1EB1P4YGYE3", "Overall": "3.0", "Content": "Easy to use.  Camera not great in low light situations.  Lots of indoor pictures are amber color or washed out.Outdoor  photos turned great for a compact.", "Date": "May 27, 2014"}, {"Title": "Great Buy", "Author": "Pam Fosterling", "ReviewID": "R462GTJWZKA8T", "Overall": "5.0", "Content": "Great pictures even in auto.The lithium battery has a long charge life. The only problem is the buttons are very small and a problem for big hands.", "Date": "May 27, 2014"}, {"Title": "CANON PowerShot", "Author": "Linda Rugenstein", "ReviewID": "R1FVJ5YX3RJB6W", "Overall": "5.0", "Content": "I purchased this camera to take pictures with the zoom lens that were also in focus.  This camera does that, and I'm very pleased with the picture quality.  The camera is also easy to use.  I recommend it for everyone.", "Date": "May 23, 2014"}, {"Title": "Great product", "Author": "Peggy Lyman", "ReviewID": "R1SB5TX4CML19C", "Overall": "5.0", "Content": "We love it. Works well for us in out business. Very clear.  We would buy another one when the others we have need replacing", "Date": "May 19, 2014"}, {"Title": "Great pictures", "Author": "wanda", "ReviewID": "R309TTQDOV3OC3", "Overall": "5.0", "Content": "Its compact and takes great pictures.  At first u felt overwhelmed because my husband always takes pictures on vacation well I had to read the book so I can take good pictures. Its very easy to operate.", "Date": "May 17, 2014"}, {"Title": "Great Zooming", "Author": "Donna Harper", "ReviewID": "R1CD1GMNW57WH6", "Overall": "5.0", "Content": "This is a great camera. I purchased it for the zooming capabilities. The camera that I had was awful with zooming in. The picture would be grainy and you wouldn't be able to make out what I was taking a picture of. I haven't found anything I dislike except that it doesn't come with a case. But it's worth the money and I do recommend it to anyone looking for great zooming capabilities.So I give it high marks.", "Date": "May 15, 2014"}, {"Title": "Nice Camera for the price", "Author": "jennki18", "ReviewID": "R3IC3VFWACNN1M", "Overall": "4.0", "Content": "Pros - Easy to use, inexpensive, nice pictures and long battery life.Cons - I don't use it enough with the ease of the camera on my Note 3.", "Date": "May 15, 2014"}, {"Title": "Complicated", "Author": "Richard Casey", "ReviewID": "R1JZY2HMKGCJAF", "Overall": "3.0", "Content": "This camera has bells and whistles that I have never heard of and trying to find out how to work this thing is way above my head. I takes pics - so did my old camera, but that is about all.  I did like the zoom on it.  Nothing is easy anymore.", "Date": "May 15, 2014"}, {"Title": "Great Camera", "Author": "Michael Eastman", "ReviewID": "R1B7SMXZ9PQBFL", "Overall": "5.0", "Content": "Having limited motion in my arms and shoulders which has limited using my wife's Canon and its larger lenses is what had me searching for smaller compact camera. I've been using this camera for about a month and a half now. So easy to use, to upload photos with and having HD video is a plus. Never thought I'd use it much but I find myself taking videos quite a lot,Only issue is setting up the wi-fi upload.  It take sometime and some patience but it is really worth it. My wife has been skipping out on using her more professional camera just because of the using a cord to load and loading time with photos. With this you just set it down and browse the web, then in a few minutes its done.Highly recommend it.", "Date": "May 14, 2014"}, {"Title": "Awesome", "Author": "Valerie Pakaluk", "ReviewID": "R1JY8LH68V71ET", "Overall": "5.0", "Content": "I am not and I repeat NOT a photographer but am planning a vacation this summer overseas where it won't be feasible to take my iPhone.  After much investigating, reading and actually going to stores to hold this in my hands I settled for the Canon PowerShot which is exactly like they say....\"point and shoot\"  It's very easy to set up and takes great pictures. Hopefully by the time I leave I'll be a master at digital picture taking.  I did purchase a spare battery just in case.", "Date": "May 14, 2014"}, {"Title": "Excellent shipping", "Author": "Anumati", "ReviewID": "R1UA6261PX9BFN", "Overall": "4.0", "Content": "I am not the best photographer, but this works for me. Easy, handy and clear pictures. A solution for saving my best memories", "Date": "May 9, 2014"}, {"Title": "canon powershot", "Author": "sandy", "ReviewID": "R1LWYVOKXRVVH1", "Overall": "5.0", "Content": "This camera takes great pictures.  Bring it to your outdoor activities  and in every lighting performs well.  would recommend this for a beginner picture taker.", "Date": "May 6, 2014"}, {"Title": "Great item", "Author": "Sexy Nadia \"Nades\"", "ReviewID": "R2S5ZTLGPXS88", "Overall": "5.0", "Content": "This item rocks,. I love the way it takes pictures. It really easy to use. I recommend it to anyone.", "Date": "May 5, 2014"}, {"Title": "Really Like My Cannon!", "Author": "Judy B.", "ReviewID": "RS1ABGU1Y6Y51", "Overall": "5.0", "Content": "My son recommed it and ordered it for me. I really like it as it takes excellent pictures and is very light weight! I have had Cannon Cameras before and they have serviced me well, but his one has been the best so far!", "Date": "May 1, 2014"}, {"Title": "Takes great photos", "Author": "Dororhy D", "ReviewID": "R1N4JH4G9XOPAL", "Overall": "5.0", "Content": "The camera takes clear pictures and fits nicely in my purse.  I will be traveling in the future and I plan to take this camera", "Date": "May 1, 2014"}, {"Title": "NICE", "Author": "Lady Dee", "ReviewID": "RCTP1NVEO5KO", "Overall": "5.0", "Content": "It takes clear pictures and it is simple friendly in operating it.  I would recommend it to someone. Love it", "Date": "April 30, 2014"}, {"Title": "It is what it is", "Author": "Alec", "ReviewID": "R30XYPINVBH5BF", "Overall": "4.0", "Content": "Does what it says beautiful pictures, wifi, and easy to use. Clicking sound if you zoom while you are videoing is an annoyance that has been prevalent in these small cameras so i can't recommend it to capture video for vlogging, but everything is Canon tried and true.", "Date": "April 29, 2014"}, {"Title": "Canon PowerShot ELPH 130 IS 16.0 MP Digital Camera with 8x Optical Zoom", "Author": "Cynthia Silk", "ReviewID": "R2BFBBPLR8J1BC", "Overall": "5.0", "Content": "I love this camera!  It is very easy to use and takes great pictures!  I use it a lot to photograph jewelry and the quality is superb!  I have only had it a short while so have not used all of the camera's features.  Highly recommended!", "Date": "April 24, 2014"}, {"Title": "I'm probably not qualified to rate this.", "Author": "G. McKay", "ReviewID": "R3IB9AEVWA1WJ8", "Overall": "4.0", "Content": "I confess, I just use the basic features, and let the camera decide the rest... and that's worked for me.  The pictures seem pretty decent to me, which is what matters the most.  I poked through the menu, it all seemed user friendly enough.There's no real protection for the screen, so I ended up ordering the case as well.  They're cheap enough, so no point in getting it all scratched up.", "Date": "April 20, 2014"}, {"Title": "canon elph", "Author": "Karen Runk", "ReviewID": "R539SHQ429DD6", "Overall": "4.0", "Content": "I'm still working with it...getting slow in my old age.  It does take nice pics, though...very big so I can see them.  Thank you.", "Date": "April 8, 2014"}, {"Title": "Unfortunately got defective (center pixel dead)", "Author": "K. Mehta \"km\"", "ReviewID": "R3NVY25MR6WUG8", "Overall": "2.0", "Content": "Amazon had fantastic offer on the prices so I had purchased 4 camera to give as gift (2 gray and 2 red). However 3 out of 4 turned out with center dead pixel. Image also carries the pixel so it is not only on LCD. On one camera it was very easy to see and bit harder on 2 other cameras.So if you plan to give this as gift then first make sure you mark them as gift else user will not be able to return directly and test them out or be ready to return if it turns out to be defective piece.Camera however is good and I have been using Canon for long time now. I am not sure if this issue my cameras or specific manufacturing batch. Since there are other reviews about feature, I wanted to highlight my experience about defective model.", "Date": "April 3, 2014"}, {"Title": "Absolutely. In. Love.", "Author": "N. Pollifrone", "ReviewID": "R27OFQ33DYBHPW", "Overall": "5.0", "Content": "I've recently started a YouTube channel and purchased this camera because of the brand as well as the package deal. I'm absolutely in love with it. I've filmed a corporate video for work that looks so professional. The comments have been nothing short of positive and everyone is so impressed that I captured it all with the Canon PowerShot.If you want to see what this camera is capable of in action, check out my video: http://youtu.be/EgNwrnbN0CkA great purchase. So happy I got it!", "Date": "March 25, 2014"}, {"Title": "Great little pocket camera", "Author": "animal lover", "ReviewID": "R2V78RXXE7NQ39", "Overall": "5.0", "Content": "Stays on automatic until you change it. Does a lot of functions for a little camera. It takes good pictures. Would be good to have an extra battery to have charged to replace drained battery especially when on a trip and taking a lot of pictures.", "Date": "March 25, 2014"}, {"Title": "Great Camera", "Author": "Courtney", "ReviewID": "R2M17LZDKV24FB", "Overall": "5.0", "Content": "I took this camera with me on a cruise to the Caribbean and the pictures are great! No matter what kind of lighting I seemed to have this camera took outstanding pictures. Very pleased with the purchase.", "Date": "March 25, 2014"}, {"Title": "Great value, easy to use, it's totally worth it", "Author": "Daniel", "ReviewID": "R2RRCU8QCH0929", "Overall": "5.0", "Content": "Worth every penny! Easy to use, has a wi-fi feature to upload pictures to your phone or computer. Good quality pictures.", "Date": "March 22, 2014"}, {"Title": "Not Bad", "Author": "Day", "ReviewID": "R1OMJC7IDK6S11", "Overall": "3.0", "Content": "This is a great little camera for the price it takes great pictures.  I love the small compact size.  Pictures are very sharp and clear.  However the video recording is not that good .. if you do not have bright enough light, it comes out dark (normal lighting in my room was not enough).  Also the audio is really really low you can barley hear it.", "Date": "March 4, 2014"}, {"Title": "Wi-Fi set up requires a LOT of time and good computer literacy", "Author": "NanaMBC", "ReviewID": "R21F46WX51TH7U", "Overall": "3.0", "Content": "I am an hour into trying to get the wi-fi set up and am calling it quits.  Multiple screens, back and forth, camera not doing what it is supposed to do as the \"getting started\" guide suggests for necessary steps.  I don't need the wi-fi, just thought it would be fun addition, esp as it is part of the camera.  Forget it.  This is also our third Canon camera in less than ten years. I like the ease of use of the camera and the price, but they don't last long. I bought it again for the familiarity of the camera.", "Date": "February 27, 2014"}, {"Title": "JUst what I needed", "Author": "nancy tedrowe", "ReviewID": "R22QWJJMOQ89ZA", "Overall": "5.0", "Content": "I would rather use this simple camera when I want to take pictures instead of a smart phone.  It is just what I wanted for my simple needs.  Can download the pictures, include them in emails or articles I write for local events or print on my color printer - they look great.  Installed the software that came with it on my laptop and can edit the pictures for brightness sharpness etc.  Pictures have been published and shared with friends who all say they look great and I am by far NOT a Photographer. Great price and so easy to use.  Built in flash takes over when needed .", "Date": "February 26, 2014"}, {"Title": "Very good Value", "Author": "Carol Phillips", "ReviewID": "R20XDEQ1CGP2NX", "Overall": "5.0", "Content": "Good value for money, takes awesome pics.  The zoom is amazing.  Very compact.  I would recommend to anyone who wants it for travel.", "Date": "February 25, 2014"}, {"Title": "Happy with size and picture qualty", "Author": "Robert Smith", "ReviewID": "R1G560NGQLZZCR", "Overall": "4.0", "Content": "Had to replace my old camera because it died. I liked the reviews on this camera and the screen size. The instructions on the wifi could be written better. Had to get my grandson to explain it to me. Ready to travel and take pictures.", "Date": "February 25, 2014"}, {"Title": "Cannon 130", "Author": "Outback", "ReviewID": "R224B3RZCV4MGB", "Overall": "5.0", "Content": "I have had Cannon Powershot cameras for years. Only worn out one, the rest I have lost. They are small enough I carry it in my pocket at all times, They are handy and quick and take excellent pictures. I almost always get a nice comment about the pictures I share. I have run over them and still worked. This is a durable camera.", "Date": "February 16, 2014"}, {"Title": "Stuck in the 90's", "Author": "P. Dean \"pdsinger\"", "ReviewID": "R1LEYSZSHRUX3F", "Overall": "3.0", "Content": "My first impression was that the camera was difficult to hold and handle.  Not that big a deal.  However, the WiFi setup turned out to be the killer.  Canon's instructions and software needs to be updated from the 90's.", "Date": "February 16, 2014"}, {"Title": "Great camera", "Author": "JReader", "ReviewID": "R2RC27ACEUGZIY", "Overall": "5.0", "Content": "I just got this camera for Christmas. So far, I really enjoy it! I used it to take some pictures the other day when some friends and I went out. The picture quality was amazing. I also was happy that it was so small it fit nicely in my pocket. It came with everything I needed. I did have to get a memory card, but I got one at Walmart for like 12.00. I haven't tried taking any videos with it yet, but I am sure they will be great. I do enjoy the wireless feature of this camera too! Great asset!", "Date": "February 6, 2014"}, {"Title": "Canon Elph 130 IS", "Author": "tmeyer", "ReviewID": "R19T12R26VB3ZT", "Overall": "5.0", "Content": "So far, this camera is everything it is purported to be.  Very light, small and fast to power-up.  First time to upload via Wi-Fi to my PC was a no-brainer, if you know the password of your network.", "Date": "January 26, 2014"}, {"Title": "Does its job", "Author": "Lily", "ReviewID": "R3VC93TC0SO83H", "Overall": "3.0", "Content": "For the price this camera met my expectations. I purchased this camera for my 62 year old mother that is not technically proficient and she works it just fine. Only reason I don't give this camera 5 stars I would have liked better picture quality. The images can be a bit grainy if you don't have the perfect environment. For comparison sake I take better pictures with my iPhone 5. Hope this helps!", "Date": "January 23, 2014"}, {"Title": "An excellent LITTLE camera.", "Author": "Norman M. Kaminsky", "ReviewID": "R23QUSL75R3KE3", "Overall": "4.0", "Content": "It is a very well made camera, deliver very sharp photos. It is very small, and easy to carry. However, that very feature makes a bit harder to control. You have concentrate on what you are doing, in order not to cover the flash, or accidentally hit other controls. With practice it will be a great tool!", "Date": "January 20, 2014"}, {"Title": "good camera", "Author": "Gila", "ReviewID": "R3R5DOCR6721B7", "Overall": "5.0", "Content": "a little tricky at first, not too difficult to figure out though, very clear, excellent for what you payed for, i am very happy with it.", "Date": "January 3, 2014"}, {"Title": "Great camera!", "Author": "Cynthia Knight", "ReviewID": "R3UPCBAETZR8I2", "Overall": "5.0", "Content": "I loved everything about this camera. I really wanted it for the wifi capabilities and that is really a great aspect of the camera. You do need to watch the battery life, as it will suck down as you use the wifi. Other than that it is awesome! Got one for me and one for a Christmas present.", "Date": "January 2, 2014"}, {"Title": "Very good.", "Author": "Fern", "ReviewID": "R9Q971ODSKKFS", "Overall": "5.0", "Content": "I gave this to my sister as a gift and she loves it.She has no problem bringing it with her when she travelled.", "Date": "January 1, 2014"}, {"Title": "Awesome Little Camera!", "Author": "KP", "ReviewID": "R33255F2BT9NZL", "Overall": "5.0", "Content": "I bought this camera in preparation for a 2 week trip to Australia and New Zealand. We played around with all the compact cameras at Best Buy, and this one has great zoom, fun features, and fast-taking pictures for the price. It's pretty small and light, super easy to use with both a auto setting and a programs setting. The fun features are under this program setting and create fun effects such as Super Vivid which makes photos appear very bright (like technicolor) which is really helpful on overcast/rainy days in making dull colors more vibrant. It has color selection which you can program to select a certain color and the rest of the picture will be black and white! So much fun! I does take pictures pretty darn fast from turning on to being able to take a picture. I even dropped it in a streaming, few inches deep puddle whilst the lens was zoomed out and it still worked perfectly!!! It's a really fun camera with all of the cool effects and it takes quality pictures as well. Love it!", "Date": "December 29, 2013"}, {"Title": "Small camera", "Author": "Kathleen B", "ReviewID": "RA47RYPMQHC8S", "Overall": "5.0", "Content": "This camera is perfect.  Takes great pictures, even in a dark area. I bought it for taking pictures at work.  It takes great pictures, even in a semi dark area where I want a clear picture of pipes and valves.  This little camera fits in my pocket.  The wide angle option comes in very handy. I take pictures to write procedures at work.  I load the picture to my computer, open it in paint and put arrows and text boxes on it to explain how things work. Perfect for what I need.  All the pictures are clear and I take these pictures inside a factory without good lighting.", "Date": "December 28, 2013"}, {"Title": "Adequate camera for basic photos, but not great", "Author": "M. E. Kunes", "ReviewID": "R3S1YQUFU5CCED", "Overall": "3.0", "Content": "The camera functions well in prime lighting conditions, but in standard room lighting the pictures seem to be somewhat blurry even though this is a 16MP camera. It is adequate an an inexpensive camera that covers the basics and fits conveniently in a pocket, but don't expect to get great pictures.", "Date": "December 19, 2013"}, {"Title": "Stellar", "Author": "Terence O'Halloran", "ReviewID": "R43E6RNK12612", "Overall": "5.0", "Content": "It's everything I bought it for.  Pictures are point and shoot perfect, crisp, and with enough light, clear. Smallenough for a shirt pocket and good enough to impress anyone who looks at thee pics.", "Date": "December 17, 2013"}, {"Title": "great camera", "Author": "brenda f. blankenship", "ReviewID": "R2XJF88YP1RPQ7", "Overall": "5.0", "Content": "Would recommend this camera to everyone ,takes very good quality pictures. We travel a lot and love pics of our adventures!!!!", "Date": "October 25, 2013"}, {"Title": "I really like it", "Author": "Pamela", "ReviewID": "R2NG5C37NAO7EQ", "Overall": "4.0", "Content": "It takes wonderful photos and videos. Not very sharp with closeup images though, but not anything I can't deal with.", "Date": "October 1, 2013"}, {"Title": "Just what I needed for my fishing trips.", "Author": "peter w. colvill", "ReviewID": "R1AAB07QKPL6GZ", "Overall": "5.0", "Content": "Small enough, clips on my waders, point & shoot, picture quality is excellent & easy to use what else can I say.", "Date": "September 24, 2013"}, {"Title": "Canon Power Shot ELPH 16.0 MP Digital Camera", "Author": "winston37", "ReviewID": "RIJDY306UM25A", "Overall": "5.0", "Content": "I haven't used it a lot since I received it, but the times I have I find it very simple to operate, has very clear pictures(I got some developed the other day) is very light weight and just all in all a good camera for the price. I thought my last one was a goodcamera and it was but I feel this one supersedes it. I would definitely recommend it to friends and family.", "Date": "July 13, 2013"}, {"Title": "GREAT CAMERA", "Author": "Temima", "ReviewID": "R3KK0PQFBG3REH", "Overall": "5.0", "Content": "really great camera. got it as a present for someone and one for myself! its super easy to use but takes clear pictures :)", "Date": "December 23, 2013"}, {"Title": "Video mB too large to upload onto websites", "Author": "Insight", "ReviewID": "R1CIQ2IJYM4U59", "Overall": "3.0", "Content": "There is actually no option to decrease the megabytes of a video so that it can be uploaded to blogs and other sites that have MINIMIM mb requirements.  There are only 2 choices of higher quality (therefore more mb) video.  I hate the software it comes with also. It's a shame about these technicalities, because i do like cannon better than the similar Nokia and Sony ones i had of same caliber.", "Date": "November 7, 2013"}, {"Title": "great little camera", "Author": "Ferguson", "ReviewID": "R2VSUSMUFCJ5OQ", "Overall": "4.0", "Content": "Great little camera.  Tucks in a pocket or purse.  Action pictures are a bit hard to capture.  Met my need for a point and shoot", "Date": "May 16, 2013"}, {"Title": "first time use", "Author": "charlie L.", "ReviewID": "R1E5U5BZG2MYKR", "Overall": "3.0", "Content": "bought this camera to replace one that passes away on vacation in july. old one had a view finder, which us old folks liked. just returned from british isles. camera seems to take a while to focus in to a clear view of what you are looking at. and of course when it is sunny I have no idea what I am taking a photo of.", "Date": "August 18, 2013"}, {"Title": "Small but great", "Author": "Bob", "ReviewID": "R3H036JMHPWSD2", "Overall": "5.0", "Content": "Needed a camera for a European River Cruise this summer. We do not have much room and will be traveling long distance to begin our cruise.  This \"mighty mite\" fits all our needs and will provide all the wonderful memories that we are so much looking forward to.  Nice camera, simple to use!", "Date": "May 26, 2014"}, {"Title": "Bad instruction book, bad button and access capability, bad experience", "Author": "Frederick Hornick", "ReviewID": "ROIQDFYUG8URQ", "Overall": "2.0", "Content": "I bought this camera hoping it would be an easy way to post online images to my android phone and Facebook.  It wasn't! Spent hours trying to make the connections and never was able to do so to my phone, receiving an unresolvable \"bugging\" message that stopped me cold.  The operating buttons were small and crammed together making them hard to access.  Too many variations in accessing different functions.  I finally returned it for a refund and will not consider getting another Canon product..", "Date": "May 22, 2014"}, {"Title": "STOPPED WORKING THE 2ND DAY!!", "Author": "John Taylor", "ReviewID": "RZ56H22OP9HHH", "Overall": "1.0", "Content": "I purchased this to take pictures during car rebuild and on day 2 the camera would not operate.The camera is going back and look for a more reliable one.", "Date": "April 16, 2014"}, {"Title": "Worst camera performance!", "Author": "Rodney D. Edge", "ReviewID": "RU8BNBJV96APN", "Overall": "2.0", "Content": "I purchased this camera because I do property preservation work, which if you know anything about that work, know you take a lot of photos, like 75-150 photos every job, and you need to be able to go fairly quickly. This camera is my third of the compact digital variety, and my second Canon. the first two worked very well, except that you got blurry photos quite often, as sometimes, like when approaching a stop sign, you don't come to a complete stop. This camera advertised it fixes this...BULL! Also, when you want to take a photo, it seems like an eternity to actually take it. It may only be 2-3 seconds in real life, but when you are taking a lot of photos, it is very slow. Multiply that time to wait to take a photo or to take more than 1 photo by 5 to 8 times when in flash mode, and if you try and push the shutter too quickly (like within 2 seconds after flash) you will normally have to back up and try again. My other cameras did not have such problems. It is very frustrating. In fact, as I am writing this, I had to reduce my star rating from 2 to 1 as this is making me re-live my frustration again. Please buy a different camera. You will be glad you did.", "Date": "February 3, 2014"}, {"Title": "GREAT LITLE CAMERA", "Author": "JUNEBUGG", "ReviewID": "R2K4001I7K7L90", "Overall": "5.0", "Content": "This camera is a perfect size and very easy to use.  I have not delved into all of the wonderful applications yet, but as of now I love it.  The Amazon price was lower than anywhere else and that is always a plus.", "Date": "December 23, 2013"}, {"Title": "Best P&S; Camera on the Market", "Author": "Zelle", "ReviewID": "R1NSNA3V0AVY4I", "Overall": "4.0", "Content": "Did a lot of research, this one was the best simple camera I could buy without buying a DSLR camera. I was going on a trip to Thailand and I didn't want to have to lug around a massive camera that I would worry about getting stolen. This camera did the job. Definitely not DSLR quality, but I'm not about capturing the PERFECT moment so much as capturing the moment.", "Date": "December 16, 2013"}, {"Title": "Small size, big value.", "Author": "William Guion \"Heartwood author, founder of 1...", "ReviewID": "R3MZVKFNV7ON2A", "Overall": "5.0", "Content": "Small size, big value. And takes great pics easily -- don't have to be a pro to get quality images. I love how I can just drop this in my pocket and carry it anywhere.", "Date": "December 5, 2013"}, {"Title": "Great little camera, super smart auto mode and its super portable", "Author": "Matthew De Jongh \"matthewd5 in Maine\"", "ReviewID": "RSSJ805TBYPP4", "Overall": "5.0", "Content": "Great camera, my wife tried mine and liked it so much we got her one too!Definitely get the extra warranty! I dropped mine on hard marble floor at the Vatican! Almost said a for letter word, the screen got damaged", "Date": "October 2, 2013"}, {"Title": "Good enough for what I needed", "Author": "M Shaffer", "ReviewID": "R1FDH908XD7HZ", "Overall": "4.0", "Content": "Was disappointed that movies can only be shot 10 minutes at a time. Takes great close-up pics, and turns on almost immediately. Not a bad little camera for the money.", "Date": "June 6, 2014"}, {"Title": "ZOOM HITS TARGET", "Author": "Barbara Mims Deming", "ReviewID": "R24PVLTXK4G2I9", "Overall": "5.0", "Content": "I purchased this Canon to replace an older one. I wanted more zoom and this one fits that request perfectly. It allows me to leave my heavier longer-range-zoom camera behind on many trips I make to take photographs. I am a creative writer/instructor and have recommended this camera to students for the ease to carry, the nice zoom range, and the Canon name.", "Date": "June 6, 2014"}, {"Title": "Remarkable Camera", "Author": "Paul Uhland", "ReviewID": "RCL2UVFDIQ4NA", "Overall": "5.0", "Content": "This amazing little $89,  8-ounce cam takes great pics, has an unbelievable array of features: 8x zooms, takes videos, even. As a casual user, so far  I love it. Still exploring  the many built-in  'bells and whistles'.", "Date": "June 6, 2014"}, {"Title": "PowerShot 130 IS Digital Camera", "Author": "Deborah Berg", "ReviewID": "R1RXYJAIFFGB6P", "Overall": "5.0", "Content": "This is just what I needed. Small, easy to handle, great price, and it does what I want it to! Great for the avid and beginner Photographer alike. I still use my SONY, but this one has more for me to utilize on certain shots. Thanks Amazon!", "Date": "June 6, 2014"}, {"Title": "Perfect for point and shoot!", "Author": "Omar Sekandary", "ReviewID": "R3VF26YG27L5J8", "Overall": "5.0", "Content": "Perfect consumer camera for the average user. Easy to use and transfer photos. Great quality picture and even does short videos.", "Date": "June 5, 2014"}, {"Title": "Easy to use and wonderful photos for beginners and intermediate photographers", "Author": "sheri dammarell", "ReviewID": "R279R1WLH1SDD5", "Overall": "5.0", "Content": "I love this camera. The photos are crisp and I haven't read the entire book but will learn more as time goes by. I am very satisfied with this product. Thank you Amazon for keeping the price down!!!! I know that I would be shopping less often if it weren't for your very reasonable pricing and great and secure shipping!", "Date": "June 5, 2014"}, {"Title": "LOVE IT!", "Author": "Ralph Fredella", "ReviewID": "REB5UA1HGFIZI", "Overall": "5.0", "Content": "I love this camera and it's size. Perfect for my work pics and Wi-Fi capabilities. Amazone does good on all the items I have purchased so far and always hope it stays that way.", "Date": "June 4, 2014"}, {"Title": "Modern technology, extensive features at a good price", "Author": "Ancient Mariner \"Proud Republican\"", "ReviewID": "R3CY01Z9RRL7LM", "Overall": "5.0", "Content": "After fifty years of serious photography, the features provided by this tiny camera are astonishing.Canon cameras have been and continue to be, close to the best investments available.Typical superb Canon packaging and rapid Amazon delivery.", "Date": "June 4, 2014"}, {"Title": "Love it and the guy who stole it loves it too... I guess", "Author": "M. Siewierska", "ReviewID": "R2BOWQGK7YXQ0N", "Overall": "4.0", "Content": "My old Canon died a few weeks ago. I wasn't really sure which camera to buy but Amazon is usually the first place I start to look for things. So I ordered this camera and the delivery was on time but the camera was missing from the box. Instead, there was an old silver Canon PowerShot Elph 1000IS 7.1 MP inside ( about 6 year- old model ?) Apparently somebody switched it for a new one and I was the unlucky customer.  I had Amazon contact me promptly and Andrea from customer service kindly ordered the replacement for me. The new camera has just been delivered and I love it.  Thank you, Andrea and I hope Amazon will be able to the bottom of this. I love Amazon but next time I'm buying electronics I'm going to a physical store.", "Date": "June 3, 2014"}, {"Title": "I love it.", "Author": "jose sut", "ReviewID": "R3HCAX41BVMDD7", "Overall": "5.0", "Content": "work perfectly. Take nice picture. i always carrie with me. The video looks nice too. is hd 720. i rocomende to every body.", "Date": "May 31, 2014"}, {"Title": "I haven't fully conquered it yet but so far so good", "Author": "roundgal", "ReviewID": "RI7JN3TQPCP74", "Overall": "4.0", "Content": "I bought this because my old Kodak digital was eating batteries and couldn't do the close ups I need for online selling.  So far, so good with this camera.  I miss a view finder and the lack of one is making the taking of pictures in the sun a bit more difficult.  But reading reviews around the web indicate this is a good choice in its price range and I'm pleased so far.  It does have the close up capabilities I need and I haven't had to recharge the batteries since the initial charge in the month or so I've had it.", "Date": "May 29, 2014"}, {"Title": "great little camera w/video", "Author": "Michele W.", "ReviewID": "R3QFBAAT0PZ9R4", "Overall": "5.0", "Content": "Exactly what I wanted.  Easy to use and perfect size. pics and video look like 1080P although not.  and so much space.", "Date": "May 28, 2014"}, {"Title": "good", "Author": "Kimmai D.", "ReviewID": "RT56EKFB9VZGB", "Overall": "5.0", "Content": "uncle bought these for our family out of the USA. works and looks great so everyone is a happy camper", "Date": "May 9, 2014"}, {"Title": "This camera is a great deal", "Author": "nancy chapin", "ReviewID": "R2U0XLV0T1GUNV", "Overall": "5.0", "Content": "The size is perfect  and easy to carry.  It takes great pictures.  I would recommend it for anyone. It is easy to operate", "Date": "May 4, 2014"}, {"Title": "Great little camera for wound care pics", "Author": "Beckie F.", "ReviewID": "R2HO3CYM6XQO9H", "Overall": "5.0", "Content": "It works great for what I chose it for and takes excellent pics close up and a bit farther away.", "Date": "May 3, 2014"}, {"Title": "Interim replacement", "Author": "Tanika D. Joiner", "ReviewID": "RMAK48YHB8Y93", "Overall": "3.0", "Content": "Like camera. It's okay. Bought it as a interim replacement for a Nikon Coolpix I bought and had sd card errors with. Returned Nikon and needed something inexpensive for the mean time till I can afford something better. Takes nice pics, Having a little issue with some pics being more on the yellow side. Haven't had a chance to see if there is a white balance. I do love cannons though and will probably get an upgraded canon before the year is out.", "Date": "May 1, 2014"}, {"Title": "Great little camera", "Author": "Gregory T. Labacz", "ReviewID": "R3QW09ZY95X5YU", "Overall": "5.0", "Content": "I have the larger cannon eos rebel ,but, I love this one because I can just put it in my pocket . It takes great pictures and is easy to use.", "Date": "April 26, 2014"}, {"Title": "Disappointed", "Author": "Carol", "ReviewID": "R1L2T9V8OMDHXZ", "Overall": "2.0", "Content": "The LCD is not clear enough, the pictures sometimes ok, most of the time not so good. I feel Disappointed .", "Date": "April 22, 2014"}, {"Title": "Not so good", "Author": "Aikz \"real nurse\"", "ReviewID": "R11JFB0NC7XROZ", "Overall": "3.0", "Content": "The flaw of this camera is that the time between you pressing the button and the shot is somewhat long. And the quality of pictures I do not like. Not the same canon I used to have before. Regret that I registered my old canon", "Date": "April 22, 2014"}, {"Title": "the len shutter is not proper shut and always have a line of dust on it.", "Author": "JESSICA C.", "ReviewID": "REVBC1ZYR8NSN", "Overall": "3.0", "Content": "i like the camera is light, fast, functional, and  good price but the shutter of the len is not shut properly, it leaves a line of dust on it, and i have to clean it frequently", "Date": "April 21, 2014"}, {"Title": "exactly how I expected", "Author": "Ann Snyder", "ReviewID": "R36QR6TVHPD0UA", "Overall": "5.0", "Content": "The camera is exactly how I expected and is very convenient. I had a little trouble getting the wireless to work but otherwise everything is fine.", "Date": "April 19, 2014"}, {"Title": "Awesome Camera!", "Author": "DarthCupcake89", "ReviewID": "R2MMBB5NKY0CXD", "Overall": "5.0", "Content": "I bought this camera as a gift to myself after having my daughter. It takes awesome pictures and videos! The mic on the camera is great and after messing around with the settings, it is very easy to understand. I would highly recommend this camera to any novice who is wanting something great for the price!!!", "Date": "April 16, 2014"}, {"Title": "WOW......", "Author": "Michael J. Drougas", "ReviewID": "RNXFQ3TLUJ7VB", "Overall": "5.0", "Content": "VERY FAST DELIVERY.....amazing!!!!! I love this camera....We ride Our horses all over the west and I've been holding out for a light weight compact camera with a zoom......This is camera has it all AND a macro setting!!!!! AND only $109.00......very happy!!!!!", "Date": "April 15, 2014"}, {"Title": "wish buttons would lightup in the dark", "Author": "victoria", "ReviewID": "RB7IEI74LKEFM", "Overall": "5.0", "Content": "I love it..nice upgrade from my old canon.pics are clear when in automode..the other end is like medium quality:/ ..and i wish the buttonpad would lightup in the dark", "Date": "April 14, 2014"}, {"Title": "Power is right", "Author": "William C Pfaff", "ReviewID": "RPD03MNE3EOM6", "Overall": "5.0", "Content": "For the money, this camera is very tough to beat.  Durable, great zoom, and good balance in your hand.  Highly recommended for the beginner to intermediate photographer.", "Date": "April 13, 2014"}, {"Title": "Small but mighty!", "Author": "annross", "ReviewID": "R8DPYO523YED6", "Overall": "5.0", "Content": "We can take pictures anywhere at any time. The quality is 4 star. We would buy this item for friends or family for special occasioins!", "Date": "April 13, 2014"}, {"Title": "Very awesome camera", "Author": "BlueSkyRecipe \"Just a guy\"", "ReviewID": "R1EOVV8LFYPGSC", "Overall": "5.0", "Content": "These little PowerShot cameras are phenomenal when it comes to picture quality. I've personally owned 4 of them in my lifetime, apparently they aren't very useful if you leave them in your hotel room in mexico...IMO these are the pinnacle of Compact Point-And-Shoot cameras, great for selfies, small and light weight, works well in dark and outdoors. Perfect size for capturing family moments, whether video or photos. I won't list features of this camera cause I'm sure someone else probably already has, but I will say that you won't be disappointed with this camera.I've owned Nikon DSLRs for over a decade now and this camera is my pocket cam. Yes I understand that I could just use my smartphone to do the same thing, however there is no comparison in photo quality, and you won't hog up your phones storage space.", "Date": "April 12, 2014"}, {"Title": "An easy to sue camera", "Author": "David Ottinger", "ReviewID": "R34C4M1BS8WD0L", "Overall": "5.0", "Content": "A simple, easy to use camera that allowed me to transition from 35 mil photos. I was able to transfer the images to my computer with no trouble.", "Date": "April 12, 2014"}, {"Title": "Perfect for Amatuers", "Author": "Mike \"McMac79\"", "ReviewID": "R14RKYJBA8M9XL", "Overall": "5.0", "Content": "This camera is very easy to use and takes excellent pictures.  I opened the box, played around with the buttons for about 15 minutes or so to learn about it's different functions and that was about it.  It's very small which was awkward at first however after I got used to it, I found it to be a really good feature for carrying it around.  I honestly didn't have a single bad picture on a recent family vacation.  The different sensors for red-eye, blinking, and movement work amazingly well.  Downloading and editing the photo's to our home computer was simple and fast.  My wife and I are complete amateur's who both still carry flip phones!  This camera is fun to use and it makes our photo opportunities a breeze.", "Date": "April 11, 2014"}, {"Title": "Awesome Camera", "Author": "C. Moua", "ReviewID": "R1B5CL79UE1IRJ", "Overall": "4.0", "Content": "An awesome camera, just awesome. However the battery doesn't last long if you're planning on shooting 20 second clips on 720p and later on put it together for a video. Takes great pictures and video!", "Date": "April 8, 2014"}, {"Title": "like it", "Author": "judie jones", "ReviewID": "R2EL6DAI24IDOX", "Overall": "5.0", "Content": "So far so good, can't hook up to wifi, but I am not great with the computer. I do it the old fashioned way with the cord. Great photos so far and i really have not read the whole booklet to try more things", "Date": "April 8, 2014"}, {"Title": "Love the camera", "Author": "MJ \"Janie\"", "ReviewID": "R1IE889HJ4NRFF", "Overall": "5.0", "Content": "Takes clear pictures.  Super easy to use.  Says it's wi-fi but I haven't had time to try that function out yet.", "Date": "April 8, 2014"}, {"Title": "perfect size", "Author": "dan", "ReviewID": "R1SQZTTT6AFBFU", "Overall": "4.0", "Content": "it is the perfect size camera and takes great photos.  the video is good, but could be a bit better.", "Date": "April 8, 2014"}, {"Title": "Not what I expected...", "Author": "Kayakinggoddess", "ReviewID": "R1C88OOYMOIAM3", "Overall": "3.0", "Content": "I thought the wifi connection could go directly to email accounts but once I received the camera I realize this model is somewhat limited. Just make sure and investigate everything. The camera is perfectly fine and does everything it says it will regarding taking pictures.", "Date": "April 7, 2014"}, {"Title": "Canon Power Shot", "Author": "newnana", "ReviewID": "RAEN3VWYOHAD2", "Overall": "4.0", "Content": "I replaced a similar camera and I am happy with this one but you have to be careful when shooting at an angle or too quickly as I have had some blurred shots.  Probably the operator and not the camera.", "Date": "April 6, 2014"}, {"Title": "Excellent Camera", "Author": "Piotr", "ReviewID": "R3P0QB3M2EMKCS", "Overall": "5.0", "Content": "I read the reviews on this camera and was partially concerned with some of the negative feedback.  I want to say that the camera is excellent.  This is not a $5000 camera so can't expect super fine pictures every time.  The size is obviously a great plus.  It's easy to carry in a pocket without any issues.  The display is large and nice as well.  The camera takes excellent pictures in various lighting, and allows for quick changes.  I have not tried much in the evening or very very low light, but for general use it is a great buy for many purposes.", "Date": "April 5, 2014"}, {"Title": "Great camera.", "Author": "Jason W. Overholser", "ReviewID": "R3PJR2WT6YLFVA", "Overall": "5.0", "Content": "Simple, easy to use. Better photos than your phone takes. Small and light. Love it. Especially for the price! Thanks.", "Date": "April 5, 2014"}, {"Title": "This a little complicated for me.", "Author": "Grammy Cindy", "ReviewID": "R10VHND3UVPE8S", "Overall": "4.0", "Content": "I guess I need to practice a little more taking pictures inside.  I do like the large screen for viewing my pictures, but when taking inside pictures I notice they are a little dark so I guess I'll have to try some different settings other then AUTO.", "Date": "April 4, 2014"}, {"Title": "We love it", "Author": "Paul Harder", "ReviewID": "RKH08H7KIBDM7", "Overall": "4.0", "Content": "Really easy to use and learn. Great quality for reasonable price point and shoot. Weight and size easy to put in pocket or small purse.", "Date": "April 4, 2014"}, {"Title": "Nice little camera", "Author": "Jen Gototweski", "ReviewID": "R16DIXXGK1YVE4", "Overall": "5.0", "Content": "It was small, steady, and took great shots which is all I need for vacations. It was sometimes hard to see the screen in the sun though.", "Date": "April 3, 2014"}, {"Title": "Great little camera", "Author": "Samuel B. Justus", "ReviewID": "R329TFBOECI2PD", "Overall": "4.0", "Content": "Camera has preformed as expected. Would like to put memory card in computer and not use USB cord. Hope to find extra batteries soon.", "Date": "April 3, 2014"}, {"Title": "Overall great camera.", "Author": "TA", "ReviewID": "R3DYVELAWB2E0K", "Overall": "4.0", "Content": "Exceeds my expectations for picture quality and video stability. Battery life is my only complaint, so bought two more batteries.", "Date": "April 2, 2014"}, {"Title": "Canon PowerShot ELPH 130 IS 16.0 MP Digital Camera with 8X Optical Zoom", "Author": "Walter Satterthwait", "ReviewID": "R1NT9Z354U7OT4", "Overall": "4.0", "Content": "Fine camera.  I haven't had it long enough, or used it enough, to know how much I like it in the long term, but so far it's doing well.  Decent batter life, decent picture quality.  I'm not a good enough photographer to worry too much about anything else.", "Date": "April 1, 2014"}, {"Title": "Canon Power Shot ELPH 130 Digital Camera with Optical Zoom", "Author": "Jairo Fonseca Mendez \"Tonny\"", "ReviewID": "RF56BJAHCRBGK", "Overall": "5.0", "Content": "I choose this rating of the product for  the price, size and comfort when using it. The product is better than a similar product (Olympus) that I used for two years. The product met my my expectations.", "Date": "March 31, 2014"}, {"Title": "Great camera", "Author": "Felicia E.", "ReviewID": "R25ZFU5UU931B1", "Overall": "4.0", "Content": "Great camera for novice. Everything I wanted and meets description. Have only used it a couple of times but so far so good", "Date": "March 29, 2014"}, {"Title": "Great camera and Great Price", "Author": "A. Barrett", "ReviewID": "R2MHEMGUSVHQUG", "Overall": "5.0", "Content": "I love this camera.  It picks up every tiny speck of anything in the picture.  The price was a great plus.", "Date": "March 27, 2014"}, {"Title": "Glad I purchased", "Author": "Heidi P. Guilfoyle \"hgilly\"", "ReviewID": "R3J7O6VBIAJXG9", "Overall": "5.0", "Content": "Great little camera - it's lite to carry, small enough to put in a pocket or purse, and takes great pictures.", "Date": "March 25, 2014"}, {"Title": "Good Product.", "Author": "Gene M Phipps", "ReviewID": "R3LER4Y19E2QD8", "Overall": "4.0", "Content": "Not a photography experts so keep that in mind.The camera feels solid and well made.  The memory card and battery are easy to put in and take out.  Compact size and light weight.  Inexpensive enough that you don't mind taking it on vacation or to the beach.  I am more then happy with the picture and video quality.  I bought two extra batteries and a 32gb memory card and the three batteries (one comes with the camera)  were enough for 2 weeks in China taking lots of pictures and videos at two weddings.  I used about 12gb of the card.  Was nice to just take the extra batteries as they are very small and light and leave the charger at home.", "Date": "March 24, 2014"}, {"Title": "GREAT CAMERA", "Author": "Carrol", "ReviewID": "R1FNVEHUMENSUC", "Overall": "5.0", "Content": "CAME FAST VERY EASY TO USE BEAUTIFUL PICTURES I KEEP IT IN MY PURSE ALL DAY JUST A GREAT BUY, SO PLEASED WITH IT.. VERY HAPPY!!!", "Date": "March 24, 2014"}, {"Title": "Good Camera", "Author": "munchie", "ReviewID": "R398NBFOBDHLTQ", "Overall": "5.0", "Content": "For the price it's a good camera & is what I wanted.  The picture quality is good & I'm happy with it", "Date": "March 18, 2014"}, {"Title": "I love this camera", "Author": "Debra Ginder", "ReviewID": "R2DBL5QKRKAPWG", "Overall": "5.0", "Content": "Pictures are really clear on this camera and it is very easy to use.  It is well worth the price.", "Date": "March 13, 2014"}, {"Title": "Great camera", "Author": "hans hofman \"hans\"", "ReviewID": "RJGCE4FM7LDZU", "Overall": "5.0", "Content": "I photographed children, landscapes and oher stuff and they all look pretty similar to what I remembered. Easy to use. And very red.", "Date": "March 11, 2014"}, {"Title": "new camera for my beatiful wife", "Author": "bruce267", "ReviewID": "RL8KKGNT3W5GR", "Overall": "5.0", "Content": "i have always been happy with canon products. this camera is perfect. has many updates that we didnt have in the camera it replaced. very clear pics at a good price", "Date": "March 11, 2014"}, {"Title": "Great Camera", "Author": "Sandra Fox", "ReviewID": "R309O4ZWXSJB0H", "Overall": "5.0", "Content": "This camera takes great photos and is very easy to use.  I use it for closeups and it's fantastic.  It's also very reasonable in price.", "Date": "March 10, 2014"}, {"Title": "canon powershot digital camera", "Author": "mags", "ReviewID": "R3CUTO6A3B19CS", "Overall": "5.0", "Content": "I love this camera!! The design and quality of pictures are amazing! Small and compact so you can carry it with you so when that perfect shot comes along, you are ready!", "Date": "March 10, 2014"}, {"Title": "Camera purchase.", "Author": "Connie Addison", "ReviewID": "R262XHWVYCZBDK", "Overall": "5.0", "Content": "Found this online at a good price.  We received the camera quickly and it was what we expected.  It was a positive buying experience.", "Date": "March 9, 2014"}, {"Title": "Canon Powerball", "Author": "Bootsie", "ReviewID": "R3K7R95U0UTWM1", "Overall": "5.0", "Content": "I love it , so light and easy to use! The pictures turned out beautiful. Will be using this item quite a bit.", "Date": "March 5, 2014"}, {"Title": "Good value for the money", "Author": "RPH", "ReviewID": "RAYFE4E8EMSEN", "Overall": "5.0", "Content": "My sister-in-law has this camera and after I used hers I knew I needed to trade in my old Nikon for one like this. It takes great pictures...great color, short recycle time for the battery, and small enough to fit in my pocket. I love it!", "Date": "March 4, 2014"}, {"Title": "Buttons a little small.", "Author": "Jonathan \"fan_blades\"", "ReviewID": "R3AFQ65QH3Z932", "Overall": "4.0", "Content": "I wanted a cheap camera, mostly to take pictures of things to sell on eBay, but to also take with me outdoors, hiking, etc. every once in a while.  It looks to be exactly as advertised.Like other reviews have said, it's a little annoying to have to charge the battery separately.  And the button wheel is extremely tiny, even for my medium sized hands/fingers.I don't expect this to be a life long product.  The real test is to see how long it lasts before I will have to buy a replacement to see if I got my money's worth.", "Date": "February 28, 2014"}, {"Title": "as expected", "Author": "Kushan Mehta", "ReviewID": "RWXDLNNQLTRHY", "Overall": "5.0", "Content": "only one complain:- lag time for taking picture is more..quality of ppics are good..nice experiece.suggest to buy", "Date": "February 28, 2014"}, {"Title": "Great camera for the price", "Author": "Abby1788", "ReviewID": "R1U5EYJNZ200R0", "Overall": "4.0", "Content": "I know absolutely nothing about cameras. I did know I would need a new one to take photos of my new baby, so I came on Amazon and checked out reviews.This camera takes great quality photos from what I can tell so far. The battery is rechargeable which is very handy. I received this camera on 2/11 and today is 2/26. I haven't had to recharge the battery yet so I'd say it has good battery life.", "Date": "February 26, 2014"}, {"Title": "EZ to Use - Recommend", "Author": "Jay J Melquist \"Jay J\"", "ReviewID": "R1J51PFM7IQIEZ", "Overall": "4.0", "Content": "This is a very nice quality small camera ... could be your primary or second camera.  The photos themselves are very clear ... nice short video option.  EZ to use and priced right so recommend.", "Date": "February 23, 2014"}, {"Title": "Nice Camera", "Author": "Rosalinda Avila \"Lovecat59\"", "ReviewID": "RXRBCUYQP3XGX", "Overall": "4.0", "Content": "I bought this camera to carry with me at all times. I wanted more pixels than a  camera phone. My favorite feature is the vivid color function. Bright, colorful, vivid images every time! Make sure to take pictures at least 3-5 feet away from your subject.", "Date": "February 21, 2014"}, {"Title": "Great little camera", "Author": "Annie", "ReviewID": "RM5BK1RFIO5CQ", "Overall": "5.0", "Content": "I just purchased this camera and took it on a weekend trip to San Diego. I loved the easy use of the camera and the pictures turned out great.  I did quite a bit of research on small cameras and found this one to be the best, and it has lived up to my research.  The only complaint I have is the complications of hooking it up to wifi.  I still haven't been able to figure that out, but it's not a feature that is terribly important to me.", "Date": "February 19, 2014"}, {"Title": "Easy to use", "Author": "jmo69", "ReviewID": "R1Q7D7BD3VNBF5", "Overall": "5.0", "Content": "Simple to use, doesn't need a lot of light and stops action quite well. Battery life is good too. Haven't downloaded the pic yet.", "Date": "February 18, 2014"}, {"Title": "camera", "Author": "carina ferrer", "ReviewID": "RIV3PYQ3EMOSJ", "Overall": "3.0", "Content": "for the price I think its okay and its cute the color but its not professional camera very lightly I mean its not that heavy for my 7 years old daughter she likes it", "Date": "February 18, 2014"}, {"Title": "Nice Camera", "Author": "Lou Collazo", "ReviewID": "R3FPDACEDJL0CQ", "Overall": "4.0", "Content": "This camera was gifted to a person who was visiting the U.S. and who had not concept of photography. The cameral was delivered within the next day, which surprised the tourist, and me too. I am a professional myself and would not carry this camera. Nevertheless, the person who I gifted it to was able to understand and find all the major features without a problem. The price is right for the features and picture resolution. If you need a camera to put in your back pocket or back pack, this is an affordable and good quality camera.", "Date": "February 18, 2014"}, {"Title": "Thought Wifi Sharing was easier", "Author": "Isildur", "ReviewID": "RTCQ7RU2H7GPY", "Overall": "3.0", "Content": "To enable dropbox, youtube, facebook and other sharing services over Wifi,  you must install a software in you computer an then enable it on the camera.  The next version let's you do this directly from the camera.  And it's only 40 bucks more.", "Date": "February 13, 2014"}, {"Title": "still researching", "Author": "Rakesh", "ReviewID": "R1QNNLWTTEMNEA", "Overall": "4.0", "Content": "Camera is good but not the software ,trying to figure out  how wifi works on this camera ,software works fine if you are connected using usb cable.", "Date": "February 12, 2014"}, {"Title": "Excellent Value", "Author": "David Freeman", "ReviewID": "R2WSPO9YJTJITL", "Overall": "5.0", "Content": "This camera has been terrific.  It is easy to use and the picture quality is exceptional.  I was lucky to get this camera on sale but it would still be an excellent value at its regular price.", "Date": "February 7, 2014"}, {"Title": "great little point and shoot", "Author": "bane", "ReviewID": "R1PHNITI437TEI", "Overall": "4.0", "Content": "I bought this to replace my old canon elph which lasted me many years.  It's just as easy to use and is better than my original.  More pixels, larger display, closer zoom.  It takes great pictures for a point and shoot.", "Date": "February 4, 2014"}, {"Title": "Great camera", "Author": "1984 Great Dane", "ReviewID": "R1DHIYSDUYAPZP", "Overall": "5.0", "Content": "Never disappointed us.  We had our iPhone for pictures too, but the quality of picture with this camera was consistently perfect.  Never a graining or out of focus picture.  With the zoom, we could get much closer also.  A lot of camera in a very small size.  One of my best buys this year.", "Date": "February 4, 2014"}, {"Title": "Great camera", "Author": "DJones", "ReviewID": "R2WOXLMHTH7JQ5", "Overall": "4.0", "Content": "Takes great pictures for a small point and shoot.  This is a great camera for teenagers. Nice looking and easy to carry around.", "Date": "January 30, 2014"}, {"Title": "works well", "Author": "rod", "ReviewID": "R1D6HN1BQ4TG6F", "Overall": "4.0", "Content": "Its a great camera and paid less than I would if I bought it at a BestBuy or and other store", "Date": "January 28, 2014"}, {"Title": "Excellent!", "Author": "Elizabeth Bowman", "ReviewID": "RIP7J4851GT2R", "Overall": "5.0", "Content": "The quality of photos this camera produces are second to none. I have received several compliments on snapshots I have taken and truly enjoy using this camera. Recommended to anyone who wants excellent pictures without a huge price tag!", "Date": "January 24, 2014"}, {"Title": "best ever", "Author": "colt45", "ReviewID": "R2QZZZIXB4CEDV", "Overall": "4.0", "Content": "Great camera for the price! lots of features , lite weight. I have looked for the right camera for awhile and I didn't want to spend a lot of money. It was a Christmas gift to myself.", "Date": "January 23, 2014"}, {"Title": "Perfect transaction", "Author": "cher", "ReviewID": "R18QW6Q1UQEI70", "Overall": "5.0", "Content": "Great price, fast shipping. The camera is easy to use and take great pics. My daughter loves it, it goes with her everywhere!", "Date": "January 23, 2014"}, {"Title": "Canon PowerShot ELPH 130 IS 16.0 MP Digital Camera", "Author": "Top Flite Golfer \"Top Flite Golfer\"", "ReviewID": "R1F1VDWR15V29G", "Overall": "5.0", "Content": "Good product but my wife had some issues with reviewing previous pix, initially.  Once she got used to it, all went well.  There's not a whole lot of difference between these kinds of cameras.  Hasn't been used much yet but Canon is quality equipment and we're sure that this camera will fulfill our needs.  We think the product comes at a good price too.", "Date": "January 22, 2014"}, {"Title": "Christmas gift", "Author": "Meredith Samson", "ReviewID": "R3TWDW91ETWJTU", "Overall": "5.0", "Content": "My husband had an old Canon that needed updating.  We have a nice DSL but like to take a small no frills with us when we hike and explore.  This camera takes great pictures and is small and easy to pack along.  I got an extra battery so one is always charged.  A small case with room enough room for a couple of SD cards and you're good to go!", "Date": "January 22, 2014"}, {"Title": "Wonderful point and shoot for home users", "Author": "Zee", "ReviewID": "RT15SF6K0WNTE", "Overall": "5.0", "Content": "I previously owned a Nikon coolpix and this camera is far more superior to that camera in every way. Pictures are clear even without the flash.", "Date": "January 20, 2014"}, {"Title": "Great camera", "Author": "Mildred Busch", "ReviewID": "R2YX3GHGY833TH", "Overall": "5.0", "Content": "I bought this camera as a gift for my daughter-in law, she loves it and very pleased with all the functions and great pictures.", "Date": "January 20, 2014"}, {"Title": "Light and easy to use.", "Author": "DON B", "ReviewID": "R2H9950NPFLCIJ", "Overall": "5.0", "Content": "Simple and fits into a pocket.  Point and shoot with no disappointment.  Not necessarily for the artsy - most useful for portrait use.", "Date": "January 20, 2014"}, {"Title": "Great size better quality", "Author": "DJF_online shopper", "ReviewID": "RU9AW53HHTLHR", "Overall": "5.0", "Content": "Happy with out selection…this camera fits in any pocket or purse. Easy to use and the quality is excellentIts a keeper", "Date": "January 19, 2014"}, {"Title": "great camera", "Author": "Dan", "ReviewID": "R2L5YCBS7MPFC8", "Overall": "5.0", "Content": "great little camera for my wife, she loves how easy it really is. would but another at any time. great", "Date": "January 19, 2014"}, {"Title": "Great camera for a great price", "Author": "Walter \"Walter\"", "ReviewID": "R19CZN8Q1KWAZC", "Overall": "5.0", "Content": "I am happy with the speed, picture quality and over all performance of this camera.No it doesn't have all the features like WIFI, but for the price it meets my expectations.", "Date": "January 16, 2014"}, {"Title": "A gift.", "Author": "Lizzy", "ReviewID": "RLIKGIBI66IVT", "Overall": "5.0", "Content": "The recipient has had nothing but great things to say about this camera.  It was what she wanted and has enjoyed using it - it takes excellent and clear, sharp pictures.", "Date": "January 16, 2014"}, {"Title": "Beware!! Software does not load properly and establishing wifi is impossible!!", "Author": "K. Romano \"Krazy K\"", "ReviewID": "R3FIDUO1PA3RU4", "Overall": "3.0", "Content": "Had a canon powershot before and loved it!  Was excited to see one that had a wifi connection that I could possibly download pics straight to facebook to share with family and friends.  Despite installing and uninstalling the software, I cannot get Canon's Image X to load (it gets hung at 80%) and I cannot get the camera to establish a connection to my computer using wifi.  I have spent the last two days trying to research fixes for these issues and am finding there are no fixes that work.  I am frustrated that I have spent this long trying to fix program problems on something that should be as simple as loading a disk and letting the software do what it should.  I like to think that I am fairly computer savy but even I cannot fix these issues!!  The camera itself is great and takes good pics and video, just don't expect to use the canon software or the wifi!!", "Date": "January 16, 2014"}, {"Title": "So far it seems to work fine.", "Author": "Ivar", "ReviewID": "R2X8GE9KSW91I0", "Overall": "4.0", "Content": "This is the third camera from this series that I have owned. The first lasted for years and years.The second failed when the glass window cracked on the back. other vise it kept working. That is what happens when you carry it in your pants pocket.", "Date": "January 16, 2014"}, {"Title": "great camera", "Author": "barrett l. knight", "ReviewID": "R2V33OOFRP85HL", "Overall": "4.0", "Content": "Easy to use and takes very nice pictures. It is better at the action pics then our old camera. It is small but comfortable in your hand.", "Date": "January 15, 2014"}, {"Title": "Small Package Great Power", "Author": "Godfrey J Pinto", "ReviewID": "R23L2UQO1H4YEE", "Overall": "5.0", "Content": "Once again Cannon has designed an easy-to-use point and shoot camera that is convenient to carry around and takes great snapshots.", "Date": "January 14, 2014"}, {"Title": "\"Canon PowerShot ELPH 130 IS 16.0 MP Digital Camera w/8x Optical Zoom.\"", "Author": "Ronald Yamamoto", "ReviewID": "R8Q4WXI3U5PCT", "Overall": "5.0", "Content": "\"The family member who received this camera reported being overjoyed with this wonderful Canon PowerShot camera, from it's ease of use, excellent photo results under any number of lighting situations, both indoors and out, true color reproduction and clarity of photos.  Bottomline: Canon makes excellent cameras; this superbly made digital model was well priced, easy to use, with wonderful photographic results.  Enjoy!\"", "Date": "January 12, 2014"}, {"Title": "Great Pictures", "Author": "Artison", "ReviewID": "R3LYYIGGJ0HOWY", "Overall": "5.0", "Content": "Was looking for a camera which was small enough to take and place in one's pocket. This camera takes great pictures.", "Date": "January 12, 2014"}, {"Title": "camera", "Author": "Ora M Golden", "ReviewID": "R33VLAS5MT5FMG", "Overall": "5.0", "Content": "So far I love it but I have not had it very long. It is exactly what I wanted in size, fits in my pocket neatly, takes great pictures with great ease.  For me it is perfect.", "Date": "January 11, 2014"}, {"Title": "Canon Powershot ELPH 130", "Author": "jose", "ReviewID": "R34G4AM5D43Z34", "Overall": "4.0", "Content": "Have bought Sony, Nikon and other brands. For some reason never a Canon. When I looked at the specs the Canon was the best for the money. Great wide angle, nice size and fantastic zoom plus wi-fi", "Date": "January 11, 2014"}, {"Title": "Great deal", "Author": "Joseph D. Shea", "ReviewID": "RUQY4YHJN5VEC", "Overall": "5.0", "Content": "A complete camera package, ideal for daily, casual use.Easy to use, convenient to carry and attractive.I love it!", "Date": "January 10, 2014"}, {"Title": "very good", "Author": "Jorge", "ReviewID": "R1T4MJ836153HY", "Overall": "4.0", "Content": "very good your product with specifications agree to put in your ad served me as a gift I am already recommending your store to buy products", "Date": "January 9, 2014"}, {"Title": "Great!", "Author": "Howard", "ReviewID": "R12SCHL1LJLBDV", "Overall": "5.0", "Content": "Easy to use and love the long battery life over old camera with AA batteries. May buy another similar model.", "Date": "January 9, 2014"}, {"Title": "Camera takes very good pictures", "Author": "Ralph Bayard", "ReviewID": "R2PEX1I2OTR2XY", "Overall": "4.0", "Content": "Camera performs very well.  We get good, bright pictures.  Only problem so far is that the WIFI is not compatible with my Vista operating system.", "Date": "January 8, 2014"}, {"Title": "Excellent camera", "Author": "Pilar, Uruguay", "ReviewID": "RCLB27X33MQW2", "Overall": "5.0", "Content": "I love this camera it have a very good zoom, and is very little, I can take it every where.  Thanks", "Date": "January 7, 2014"}, {"Title": "Great", "Author": "bordern", "ReviewID": "RQN6TR0OAPC1F", "Overall": "5.0", "Content": "Great camera and very easy to use.  Video button makes taking videos very simple. Good zoom feature.  Nice compact size.", "Date": "January 7, 2014"}, {"Title": "Bought it as a gift", "Author": "Carole Jean Reese \"Cluete\"", "ReviewID": "R207WRO3MN8X82", "Overall": "5.0", "Content": "This was bought as a gift for my husband and he just loves it.  The view finder is large, the photo's are great, and the ease of use makes it wonderful for putting things on E-bay, taking photo's of the Grandkids, pets or anything else he wants.  This camera was much, much, more in the local stores,  and it was a great price, with delivery on Amazon.If your considering this camera,  go ahead and purchase it ,  You won't be sorry.", "Date": "January 4, 2014"}, {"Title": "Reliable camera, good price, small size", "Author": "Karen", "ReviewID": "R1UYU9SSSDY3HQ", "Overall": "5.0", "Content": "I have an older model PowerShot which has been great for the last 8 years, which I bought for its compact size and have been very happy with it.  I bought another Canon because of this, and for the fact that it is even smaller now with more zoom and features.  Wished that the battery and battery pack would have been interchangeable with the older model, but they are not.  Great camera at a great price.", "Date": "January 4, 2014"}, {"Title": "Ok for Personal Use", "Author": "Sylvia Sloan", "ReviewID": "RVK8SLX1LHF5I", "Overall": "3.0", "Content": "This camera is just OK.  For the money it works fine, but it does not take good pictures inside.  Haven't used the zoom yet, but it does take better pictures outside.", "Date": "January 3, 2014"}, {"Title": "Great camera", "Author": "Linda Bargren", "ReviewID": "R20WXIRA46YQ1F", "Overall": "5.0", "Content": "Just started using it, but pictures are turning out great, Very easy to use, and seems to be very user friendly.", "Date": "January 3, 2014"}, {"Title": "great product", "Author": "skull", "ReviewID": "R1PUZENDTE8LJR", "Overall": "4.0", "Content": "I bought the camera for a Christmas present for my wife. She loves it.The camera meets and excides our expectations.", "Date": "January 2, 2014"}, {"Title": "Great For Every day Use", "Author": "JT", "ReviewID": "RVRRGDJGOKVLY", "Overall": "5.0", "Content": "- Straightforward to use (Just Point and Shoot)- Competitively priced against other cameras in its category- Lighting and picture quality is decent- Video recording stays at a consistent frame rate- software complements device very well*Just a quick note * If you are on OSX , and below Snow Leopard you will not be able to use the software with this camera .I actually had to upgrade my OS to be able use the Canon software.", "Date": "December 30, 2013"}, {"Title": "camera", "Author": "Slim", "ReviewID": "R1VNJ5ZX1DKUVI", "Overall": "4.0", "Content": "i bought this for my cousin and she is very happy with itit was her first camera and she likes that it is simple to usethe ad said if i bought the camera i would get a free case but never got the casethats the reason for the stars", "Date": "December 30, 2013"}, {"Title": "Canon does it again with another great camera.  What a great deal!", "Author": "Godfather", "ReviewID": "R12Y05YAALZW0X", "Overall": "5.0", "Content": "This is my third or fourth purchase of a canon  digital camera.  The last one \"broke\" because it was taken to a beach.  And I loved that one.  You can imagine that you don't want to drop a camera in the sand or place it in the bag with the sandy towels?  This camera was cheaper than my last one and seems to work better!!!  I was amazed at how fast it took a picture and stored it.  Amazing technology in a tiny camera.  A great point and shoot and sometimes I prefer an actual camera over a smart phone, since you will have more control over what you are taking a picture of and the many settings for customization if you need it.  Also....your smart phone is not great for the beach....you drop the smartphone you just lost $600 bucks, you drop a $100 point and shoot....much better way to take pictures at the beach....except for the sand that got stuck in my last lens....oh well....", "Date": "December 29, 2013"}, {"Title": "Great pictures!", "Author": "Pearl", "ReviewID": "RTKJQBUW278VQ", "Overall": "5.0", "Content": "I am so pleased with my Canon ELPH130.  The pictures are so clear and sharp and the zoom pictures stay clear also.  It is easy to learn to use the basic things necessary to instantly begin using.  I have \"accidentally\" learned how to do some other features just by trying a few things or have them appear by something I did and not realizing it. I have not yet used any methods for printing or downloading to my computer.I am pleased with my purchase.", "Date": "December 29, 2013"}, {"Title": "Returned, slow shutter and poor low light quality", "Author": "Dominick Casalena", "ReviewID": "R18II72IUFWXN0", "Overall": "2.0", "Content": "I received this camera as a christmas gift and used it for the day taking indoor pictures.  My first observation was how slow it was to take a picture after pressing the button.  I kept missing the shot I wanted because it took nearly a second to actually snap the picture after pressing the button.  Even after the half press to get the focus first, the full press took a long time to actually snap the shot.  Not only does this cause a frequent loss of the picture you want, but also leads to a lot of blurry photos because it's hard to hold perfectly still while waiting for the picture to snap a full second after pressing the button.Later in the day, I used the camera on a tripod to take the traditional full family picture I always take at holidays.  The room was fairly well lit but not bright, and the camera was about 10 feet from the front row of people.  I used the timer and auto flash, which did go off.  Later when I downloaded the picture it was very grainy and orange as if the flash didn't quite reach the target.  My old powershot SD500 always got this shot perfect, but I dropped it around thanksgiving, and even though it still works perfectly, the case is bent and seams are a bit wider than they were before.  That's why I got a new one for Christmas.In the end I returned the camera, and have another cannon on the way.  Cannon makes great cameras, but this one fell short of my expectations.  It seems like as these cameras become more feature laden, the shutter lag increases.", "Date": "December 28, 2013"}, {"Title": "POCKET PURRRRFECT!", "Author": "Sharon Sorweide", "ReviewID": "R3K0L55EP92X95", "Overall": "5.0", "Content": "I took this camera to the high mountains, riding horseback over 50 miles in snow and rainy weather....the lens kept clear and even in pouring rain the pictures turned out great!", "Date": "October 6, 2013"}, {"Title": "Was what I wanted", "Author": "Richard Keleher", "ReviewID": "R38DOB7Q4I8WBU", "Overall": "4.0", "Content": "The controls for the different modes are not intuitive, especially the icons for them. Otherwise, Just fine. Ran out of battery pretty quickly, until I put it on Eco mode. Now it's fine.", "Date": "September 13, 2013"}, {"Title": "Excellent Camera", "Author": "John C. Balch", "ReviewID": "R1ANZFC934W4Q8", "Overall": "5.0", "Content": "Light, easy to use, takes GREAT pictures. What else does a person need in a camera? Can't go wrong with this.  Sorry for not giving a more tech-detailed review, but I'm a photog, not a camera weenie.", "Date": "September 13, 2013"}, {"Title": "User friendly", "Author": "Esther T", "ReviewID": "R1EVUN8W0V4L71", "Overall": "5.0", "Content": "Very user friendly.  I  take both still pictures and movies of my  grandchildren.  It is so easy to switch from  one to the other.", "Date": "August 27, 2013"}, {"Title": "GREAT CAMERA!!", "Author": "Debbie", "ReviewID": "R27KQWBFAPR4MJ", "Overall": "5.0", "Content": "The Canon PowerShot does everything I want it to do! We took it on vacation and had mypictures developed right away, they came out beautiful!! I am so satisfied with the camera!", "Date": "August 24, 2013"}, {"Title": "Fits in your purse", "Author": "Cheryl D. Jones \"Babygirlcwj\"", "ReviewID": "R22QTEXTNTHGEW", "Overall": "5.0", "Content": "Or pocket.  Love this camera and it takes great pictures.  I am learning to use all the functions as it is a step by step process.  Will be going to Disney World with the grandkids and kids and know I will be enjoying this camera a lot.  This camera also fits in a pocket of your jeans, fits in your hand. Use your imagination as to where it will fit for easy carrying.", "Date": "August 21, 2013"}, {"Title": "Love it", "Author": "geek12", "ReviewID": "RRJOVL0HWR16G", "Overall": "5.0", "Content": "Perfect for hiking and site-seeing. I never took pictures because I never had the patience to set up great shots (too \"in the moment\" to use anything but a point and shoot). Now, I take shots everywhere and I love the high quality of the photos. I have not set up the WiFi feature, but I look forward to it.", "Date": "August 13, 2013"}, {"Title": "Canon PowerShot ELPH 130 IS 16.0 MP Digital Camera", "Author": "eak", "ReviewID": "R3W0EYAUVMAY1Z", "Overall": "5.0", "Content": "Got an older version of this two years ago as a birthday present and eventually lost it. Since I had to buy a replacement I upgraded a bit, but stuck with the same general canon powershot. Love love love this camera.I don't use it for anything too fancy (documenting vacations, minimal editing, occasionally blown up for larger prints), so its small size and crisp photos are perfect for my needs.", "Date": "August 12, 2013"}, {"Title": "Fantastic camera", "Author": "Ma Zoan", "ReviewID": "RKGQRIFCU37TZ", "Overall": "5.0", "Content": "So fat this camera has taken excellent pictures. I really like it because of its compact size and light weight. It fits easily into my coat pocket.", "Date": "August 3, 2013"}, {"Title": "New Canon Camera", "Author": "Griselda", "ReviewID": "R24S0YC04V2YKP", "Overall": "5.0", "Content": "I am more than pleased with my new camera. Its easy to use and the pictures are of great quality. I highly recommend this camera! I'm super happy with my purchase!", "Date": "July 23, 2013"}, {"Title": "Great Compact Camera", "Author": "Schultzfam6", "ReviewID": "RUO7GAEDAK41S", "Overall": "5.0", "Content": "I bought this for my 18-year-old daughter and she loves it!  It's simple to use and takes clear pictures.  A great camera for someone who doesn't want a lot of bells and whistles.", "Date": "July 20, 2013"}, {"Title": "Good camera", "Author": "Dexter Samm", "ReviewID": "R2CID3N5J6C5HH", "Overall": "5.0", "Content": "Very good camera with good pics. I have not tried out the wifi yet but the camera takes good pics close up and at high speed. I recommend it.", "Date": "July 18, 2013"}, {"Title": "Great camera", "Author": "VTS", "ReviewID": "RUJ4U41XD9Q29", "Overall": "5.0", "Content": "Bought this to replace a Canon sd1400 which died after the only fall it has ever had. This was cheaper than newest ELPH so I went with it.  My main goal was to have a camera that worked in low light for the times that I went out and carried a small clutch as my DSLR is not that portable. It works great.", "Date": "July 18, 2013"}, {"Title": "Great Camera for the money", "Author": "Mary E. Erickson", "ReviewID": "R1TJCHZSA7SMJF", "Overall": "5.0", "Content": "I am taking some really good pictures with this.  I think the only problem I have is that the life of the battery before I have to recharge it is kind of short.  I just make sure I always have a second fully charged battery with me.", "Date": "July 14, 2013"}, {"Title": "Great camera", "Author": "John R. Nasi", "ReviewID": "R3ENSOHM85YO9Z", "Overall": "5.0", "Content": "I bought this camera for an european vacation and was not disappointed.  It is very easy to use, has automatic settings that produce vivid pictures and the zoom capabilities are nothing short of amazing.  Lightweight and long lasting battery life.", "Date": "July 13, 2013"}, {"Title": "digital camera", "Author": "michael", "ReviewID": "R2CN2PG3YBSODF", "Overall": "4.0", "Content": "compact size, fair price, able to link to canon printers, still new and learning about all of the features. takes good pictures with easy to use zoomtakes good movies also", "Date": "July 12, 2013"}, {"Title": "Nice Size, the Canon PowerShot Elph 130IS", "Author": "Darlene Jantz", "ReviewID": "R3IK2E0X2NQZSU", "Overall": "5.0", "Content": "Quality great. Size is very good to carry in purse.Very neat camera. Very easy to use. I love it.", "Date": "June 30, 2013"}, {"Title": "Great camera!", "Author": "Cathy", "ReviewID": "R23RAX388E33N9", "Overall": "5.0", "Content": "I bought this camera for the great quality of pictures it produces and the fun effects it can produce (color accent, fish eye lens view, etc.).  I am by no means a professional photographer, and I've only used the camera once so far at a wedding, but I got so many compliments on all my photos.  The wifi is a great feature as well.  However, I can only get it to connect to my iPhone, and not my home wifi network.  Overall, great quality photos for the price.  I'm happy with this purchase.", "Date": "June 27, 2013"}, {"Title": "Canon PowerShot ELPH 130 IS 16.0 MP Digital Camera with 8x Optical Zoom...", "Author": "Ken Webmaster About Facts Net", "ReviewID": "R3GTBDO8LBC5DI", "Overall": "5.0", "Content": "I love this camera. The photos are good, and the camera is small and handy and easily fits into a shirt pocket. If you want better photos then I suggest the Canon A series.KenWebmasterAbout Facts Net", "Date": "June 24, 2013"}, {"Title": "Are we reviewing the same camera here?", "Author": "rjohns", "ReviewID": "R14Z8QHUZ4F1MC", "Overall": "1.0", "Content": "I was so excited to purchase this camera which I did based on all of the great reviews.  I have been using the camera on my cell phone for a couple of years and wanted a good point and shoot camera for taking better detailed pictures of my cats and humming birds.  I don't need a professional studio picture but I expect clear detail if I take a picture of a non moving object or a self portrait.  I have taken approximately 100 pictures and recorded video.  I have used the AUTO setting, and each one of the program settings to see if I could get one clear shot that is as good as my cell phone camera.  I had expected it be much better than my cell phonel.  I have selected fine detail and tried every pixel option as well as every ISO setting.  I am seriously wondering if I bought the same camera that was so wonderfully reviewed.  I researched prior to purchase to ensure I was buying a decent picture only to get a camera that cant take a picture better than my very first Nokia dumb phone 13 years ago.  It is sad to think that a device designed for the sole purpose of taking a picture cant capture a single picture with half the quality of my iPhone 4 or droid incredible 1.  I am going to attempt to get a replacement.  Maybe the one I received is defective and a replacement will be as great as all of these reviews indicate.", "Date": "March 7, 2014"}, {"Title": "Amazing image stabilization", "Author": "C. Fernandez \"Carlos\"", "ReviewID": "R170S2FU98H085", "Overall": "5.0", "Content": "I purchased this for my vacation. I won't write a complete review, but I haven't used half its features. But let me tell you this - I took some pictures on a very windy day at Point Lobos (so windy it took some effort to walk) and there's no blur whatsoever. I'm impressed by the job the stabilizer does.", "Date": "June 4, 2013"}, {"Title": "No problems", "Author": "Scott", "ReviewID": "R1FVBZFQIUL3TW", "Overall": "5.0", "Content": "Camera works as advertised. WiFi photo share is very handy for sharing single pics. Battery life is good. Pic quality is above average for point and shoot.", "Date": "April 28, 2013"}, {"Title": "Don't like the picture quality", "Author": "Cletustu", "ReviewID": "R1AMF28UP2IQ7R", "Overall": "2.0", "Content": "Not that sharp and the colors don't seem accurate.  I am a photo enthusiast with a Nikon d600 and lots of good lenses.  I wanted an easy point and shoot option to carry around.  I know point and shoot will never be as good as a DSLR, but my phone takes better pictures than this...  For $200, I would expect more.", "Date": "May 31, 2014"}, {"Title": "all good", "Author": "Steven Craigen \"Steve\"", "ReviewID": "R2PA7MC0X0OHZ6", "Overall": "5.0", "Content": "I am satisfied with this camera. So far it has worked as it was intended to! I'd buy another one.", "Date": "May 23, 2014"}, {"Title": "Great camera!", "Author": "LoveMy JEEP", "ReviewID": "R2E2GNWY2EK13P", "Overall": "4.0", "Content": "This camera takes excellent pictures, and does just about everything for you.  All you have to do is point and click.  It autofocuses for you and warns you if there isn't enough light, and so many other cool features.  It is about the same size as a cell phone, so a little hard to hold, which is why I only gave it 4 stars. It takes a little getting used to. And, maybe it is just me, but if a camera needs a special type of battery, or needs a SD card, then it should come with it. Yes, you need to buy a SD card.  A case would be nice too.  Cannon needs to make a protective case. It does come with a wrist strap, which I recommend using until you get used to handling the camera, to avoid droppage..", "Date": "May 10, 2014"}, {"Title": "Fun camera", "Author": "Andi C Bair", "ReviewID": "R3F1B9PWTAMGB6", "Overall": "4.0", "Content": "The Canon ELPH series constitutes light-weight, fun cameras, available in many colors, and focused on convenience. Let me use my usual disclaimer, in the interest of fairness, and admit that many cameras by reputable makers (and there are many) deliver what they promise. It is more about what camera traits you are looking for. So, I would suggest to anyone looking to buy one to google 'camera trait search' and get the whole picture.The ELPH130 is a fixed lens camera (point and shoot, some would say), with 16 resolution (megapixels), and a x8 zoom. The sensor size is 1/2.3 inch CCD-type, which is standard for cameras of its class.It does not have a viewfinder, which, again, many in its class don't. The ISO rating, which is the gauge for how well it does in low light, is 6400, up from 1600 for the ELPH 115. The video is a Full HD- that is 1980x1080 resolution. It does not have a hot shoe for an external flash option. That is not unexpected for its size and category. The LCD screen is a 461,000 resolution, up from 230,000 for the ELPH 115. The camera does not do RAW processing but you would need only if you did not want to be limited by JPEG type storage. The burst rate is a reasonable 2.9 frames persecond- great for quick shots. The weight of the camera is a convenient 145 grams.Overall, nice, fun camera. Having been into photography for a while, I do stress though that you do a camera trait search. That will also tell you more about what you want.", "Date": "March 11, 2014"}, {"Title": "Poor Quality of Pictures", "Author": "John King", "ReviewID": "R1U2UAEGUP2Q4Q", "Overall": "2.0", "Content": "Thought with the name \"Canon\" the end result would be a superb picture. Far from good quality. Bought a Kodak 12 years ago with less megapixiels, but what a better result. Probably going to return the Canon.", "Date": "February 26, 2014"}, {"Title": "Great little camera", "Author": "Liza", "ReviewID": "R3G7SFU8JGYHMW", "Overall": "4.0", "Content": "The quality of this camera is great, and love the zoom! The only thing is that there is a few seconds lag time between taking pictures, as I read in other reviews, but otherwise a great camera overall for my needs, which is just taking pictures with friends and family, nothing too fancy.", "Date": "February 16, 2014"}, {"Title": "great camera!", "Author": "D. Smulders \"Mom and Grammy\"", "ReviewID": "R27XAS0CYX1TEB", "Overall": "5.0", "Content": "Great price.  The photos are sharp and beautiful.  The video function also has great clarity.  This small, affordable camera is a great buy!", "Date": "January 31, 2014"}, {"Title": "Great Price, Great Camera!!", "Author": "Pam", "ReviewID": "RCK8JF6EOL6MR", "Overall": "5.0", "Content": "I purchased this for a gift to send to a soldier that had deployed. I wanted something small enough so they could carry it anywhere they wanted/needed to but with good quality. This is the best that I found and is at a competitive price!", "Date": "January 6, 2014"}, {"Title": "Just as expected", "Author": "JB", "ReviewID": "R2O4U59532XP82", "Overall": "5.0", "Content": "The camera is just as it shows, takes great pictures even without flash.The shipping was quick. Wouldn't choose any other.", "Date": "January 2, 2014"}, {"Title": "Great little camera", "Author": "Ellie", "ReviewID": "RK68UFBKFT6Q6", "Overall": "5.0", "Content": "Love my Elph 130 IS Camera. Takes great pictures. I bought it for myself as a Christmas gift to replace an older Nikon that I had. Fits into my handbag easily. Looking forward to taking more great pictures when I go to Europe in the spring.Ellie", "Date": "December 27, 2013"}, {"Title": "Excellent simple use camera", "Author": "ajit thakkar", "ReviewID": "RI4FYCBN4UTZW", "Overall": "5.0", "Content": "Bought this camera to replace the canon I lost. Its a simple camera with excellent results.Takes excellent short movie clips. Great camera for general use without complications.", "Date": "December 23, 2013"}, {"Title": "Christmas Gift Winner", "Author": "Bette R.", "ReviewID": "R19C3ABRRTSAEV", "Overall": "5.0", "Content": "This camera was for my 11-yr. old granddaughter for Christmas.  It is her first camera and while it has many fantastic features on it, she was able to understand and use many of the features.  She was thrilled!", "Date": "December 22, 2013"}, {"Title": "Loving it!", "Author": "Jennie750608", "ReviewID": "R37S4SVVGK5D6C", "Overall": "5.0", "Content": "I received the camera in the mail yesterday, as promised. Arrived in perfect condition. I was so excited to receive the camera. I had an older model of the camera but my ex lost it nearly 3 and a half years ago. I had the PowerShot SD600. I loved the functions it had. When I saw this updated version, I quickly decided that I wanted a similar camera to the one I owned many years ago. This camera has more functions and capabilities than the older model. I love the WiFi option. But I still love the Color Accent feature....it was my favorite back then, and it still is my favorite. I'm going to have a blast re-discovering my new camera. Yay!", "Date": "November 15, 2013"}, {"Title": "Nothing distinguishable in actual photo performance", "Author": "Terri", "ReviewID": "R34JKBGZZ57DZL", "Overall": "3.0", "Content": "Lots of nice bells and whistles. But a digital point and shoot is still just that, have wait what seems like an eternity after i push the button before it actaully takes the photo. Special lighting conditions really confound it.", "Date": "October 31, 2013"}, {"Title": "Overall - not very user friendly", "Author": "JANET GAGNON", "ReviewID": "R15T3NO4639MRZ", "Overall": "3.0", "Content": "Camera is smaller than i expected, takes ok pictures but not very user friendly.  I expected more wifi functionality. For the price, should have included a case of some sort...even a felt one is better than none.  Battery does as long as i had hoped.", "Date": "August 10, 2013"}, {"Title": "Nice!", "Author": "Amazon Customer", "ReviewID": "R2PD871Z8N8BG4", "Overall": "4.0", "Content": "I tried it but it wasnt put to the ultimate testing. I does find that when you are trying to focus the image looks a bit grainy. Will update as i go alone.", "Date": "July 8, 2013"}, {"Title": "Very nice camera", "Author": "Paul R. Prescott \"MilDoc\"", "ReviewID": "R361M8QL39AH85", "Overall": "5.0", "Content": "Bought this for LOML since she hates using my much more complicated one. Nice auto mode, works pretty well. I tested it by taking 100 pics and a few videos myself. and the pics are good as usual for Canon. Have had no problems.", "Date": "May 11, 2013"}, {"Title": "The Canon PowerShot digital camera 130 IS requires a techie to owe it. Be carefuul.", "Author": "Timothy Lassiter \"Joe\"", "ReviewID": "R1M2OSX1VS4I57", "Overall": "1.0", "Content": "Too many negative issues to make note of. BUT I returned this camera due to the inability to use the wi fi functions, the main reason I purchased this particular camera. Many, many hours online with the Canon techs and they couldn't even get the software to load properly which is necessary in order to use the wi fi functions. I quickly realized the tiny, tiny buttons on the back was totally a pain in the butt. Surely Canon can do better. The problems with the camera are all software related including printing photos and sending emails. Impossible for me a t least. I also discovered it is absolutely necessary to download a few other software programs from web sites to use this camera. As I said many hours wasted. Beautiful pictures, pocket sized, bright flash, etc.  were the best part of owning this camera. I listen to too many reviews and misjudged those reviews when others were complaining about the same issues I ran into. I should have been more attuned to those critical reviews. Definitely would not buy this product again or for that matter any Conon PowerShot cameras.", "Date": "May 14, 2014"}, {"Title": "Perfect for the price", "Author": "Katherine Hammontré", "ReviewID": "RGM2XFQD1WNRP", "Overall": "5.0", "Content": "You can't get a better photo for the price.  I love mine and the size is perfect - it takes great zoomed in photos.  Nothing bad to say about it.", "Date": "April 18, 2013"}, {"Title": "Wonderful toy", "Author": "Yuri \"Yuri\"", "ReviewID": "R3P93QCEK1TSYF", "Overall": "5.0", "Content": "After I figured out with the help of community how to do the most difficult task of threading the strap, I have been using the camera for two weeks now on my trip across Florida panhandle. I did not have the time to read the manual but the camera is a simple joy to use. I already produced 200 great pictorial testimonies, some shot on a spur of the moment, the not-so-easy to catch birds, or passing boats. I particularly love the easy zooming. It does require a bit of manual dexterity - a minor and interesting challenge. Make sure you hold it steady for a few seconds and you will be rewarded with easy-to-shoot high quality photos. The camera in addition to being very easy to use, has a great feel and snappy look. Transferring pictures is also so easy, with any browser, and on any PC. As a reminder, one does need to buy a memory stick with it. The 16 GB will serve you plenty.", "Date": "July 30, 2013"}, {"Title": "No problems", "Author": "Dr. Bing Shi", "ReviewID": "R3QGP3JQNLZFXI", "Overall": "4.0", "Content": "I bought it for my brother. They used it and love it. No problems. The images look great. I like it", "Date": "May 10, 2013"}, {"Title": "Nice camera", "Author": "Kenneth McNally", "ReviewID": "R29ZRUG2KNMJ7S", "Overall": "5.0", "Content": "I was looking for an easy compact camera for my wife and this one met all of our expectations. It takes a really clear picture and most of the features are automatic. I would recommend this for anyone who likes to fit a camera in a pocket or purse that takes pictures on the fly. Highly recommended.", "Date": "May 2, 2013"}, {"Title": "Great little camera!  Super photos.", "Author": "Marilyn G. Smith", "ReviewID": "RAR0JG9IBA0EH", "Overall": "5.0", "Content": "Great little camera.  I carry it with me all the time - it fits beautifully in my purse!  Super price.", "Date": "April 15, 2014"}, {"Title": "Eh", "Author": "Hbmommy5", "ReviewID": "R1FB0DUWEE34P4", "Overall": "3.0", "Content": "The quilts isn't so great and sometimes the wifi doesn't connect. I called the customer service once to try to have them help me figure out how to connect it back to my iPhone and they were really rude. Maybe it was just that one just, but his customer service skills suck. Anyways the camera was only like 110 or something so I guess I can't complain. I wish I would have put out the extra money for something a lil nicer.", "Date": "April 14, 2014"}, {"Title": "Canon ELPH 130 Camera", "Author": "M. D. Bruneau \"RAGMAN\"", "ReviewID": "R1ZYTTMA1FVVDU", "Overall": "4.0", "Content": "This is a very simple devise to operate and I would recommend it as a take along camera, takes very good pictures and canon gives good support.", "Date": "April 10, 2014"}, {"Title": "Great camera!!", "Author": "Julie de Monbrun", "ReviewID": "R23HU5TV7J3MMK", "Overall": "4.0", "Content": "I love this camera, I big DSLR and I wanted something small that I could carry in my pocket or purse. It takes pictures great and does give a vivid color but  I like it!! Fun and easy to use! Worth the money!", "Date": "April 6, 2014"}, {"Title": "Great Pictures on Rafting Trips", "Author": "Brian", "ReviewID": "R6ORK4UXR5UKX", "Overall": "5.0", "Content": "I like to go with the quick and handy approach to taking pictures on raft trips.  I have had huge thanks and compliments from the quality of pictures this camera takes and when the photo moment arises, I am able to quickly pull out the camera and capture many moments that are missed with larger cameras packed away.  Make sure to learn how to use the different settings for \"snow\" days, low light, water shots, etc.  Also highly recommend getting the \"Square Trade\" warranty.  I have used it twice with very high satisfaction.", "Date": "March 30, 2014"}, {"Title": "my canon powershot", "Author": "Conniep", "ReviewID": "R2PUI3LWZ3ERRK", "Overall": "4.0", "Content": "I really like the camera itself. The shipping was on time and the service polite. I definitely would buy this type of camera again and I also would buy from this seller again.What I did not like was the fact that one day after receiving the camera the same camera was advertised at amazon.com for $ 10 less. I decided to do more shopping next time before I buy.", "Date": "March 9, 2014"}, {"Title": "overall good deal", "Author": "Y-Not \"John\"", "ReviewID": "R127KMNXATTMMQ", "Overall": "5.0", "Content": "8x Zoom is nice to have at this price point.  I've had good luck with this series of Canon Cameras previously.  Would recommend.", "Date": "March 8, 2014"}, {"Title": "Dissapointed with picture quality", "Author": "Chandima Rajakaruna", "ReviewID": "R2RZTQ2ZSE8DI1", "Overall": "3.0", "Content": "I bought this about 7 months ago and am really disappointed with the picture quality. I can understand poor quality in low light, but I end up being disappointed with about 50% of the shots I take in bright daylight. I have had good Canon cameras in the past but was really disappointed with the picture quality of this one. Not sure if I just got a defective camera but I am actively looking for another camera now.", "Date": "February 18, 2014"}, {"Title": "Just a clicking", "Author": "anne", "ReviewID": "RH0F3RW6U3S2F", "Overall": "5.0", "Content": "I love this camera. I am only having problems with the movie part but I am sure after awhile I will also teach myself to do that too. I don't think the book explanes things simple enough for me to understand. But Love the camera. Price is right", "Date": "February 8, 2014"}, {"Title": "Nice digital pocket camera", "Author": "Pepper", "ReviewID": "R24PWZIFXR2KA3", "Overall": "4.0", "Content": "I chose this camera as a beginning transition from film to digital. So far, I'm not getting very sharp photos, even though I use a tripod and the focusing options to center my subject. I don't find the instructions easy to follow.  I work with it several days a week and look at my photos. I'm an experienced photographer in film and multi-format cameras, including medical and field photography. But for various reasons I won't go into, I'm late moving into the digital photo world.I chose this camera because it has all the properties recommended for my purpose, including movie-making, to learn digital photography. I have other instructional materials that I hope will help me move forward more quickly. Then I'll come back and update my review.", "Date": "January 4, 2014"}, {"Title": "Gift for Granddaughter", "Author": "Bonnie", "ReviewID": "R2DFR3D1B7NPYY", "Overall": "4.0", "Content": "This is a perfect size for a young woman to carry around and very easy to use.  I bought it for her for Christmas to take on her honeymoon.  Can't wait to see her pictures.  She loved it.", "Date": "December 30, 2013"}, {"Title": "great!", "Author": "Elisabeth C. Brewer \"scifinerd\"", "ReviewID": "R2F7XHAUVE97F0", "Overall": "5.0", "Content": "easy to use and compact. I haven't tried the wireless yet, but from others' reviews it seems that it will be very convenient. I like to just plug the thing in.", "Date": "December 26, 2013"}, {"Title": "Wifi weird", "Author": "William Marlowe", "ReviewID": "R1B6X6HTN7REKB", "Overall": "5.0", "Content": "I was hoping for a push here dummy type of wifi but set up uses mac addresses.  Otherwise the camera is nice.", "Date": "October 26, 2013"}, {"Title": "Awesome and Great Price!", "Author": "Gary Houk", "ReviewID": "R2H52QMKM59FJU", "Overall": "5.0", "Content": "Super Pricing!Great Features!Terrific Pictures!I would highly recommend, Brand Name with the price at an unbelievable price and loaded.", "Date": "September 4, 2013"}, {"Title": "Great little camera.", "Author": "Hal", "ReviewID": "R15EA2PQ3WMBSS", "Overall": "5.0", "Content": "High quality photos, good video, and WiFi. What more can you ask of a pocket camera? I am replacing a Canon SD1100 and this is even better!", "Date": "May 6, 2013"}, {"Title": "I Should Have Listened to Other Reviewers", "Author": "barbwire", "ReviewID": "R2FFWQXXVYZCIA", "Overall": "1.0", "Content": "The camera is ok.  I have taken a lot of pix for at least 15 years with point and shoot cameras, 3 different cameras.  The Canon received good ratings but there were comments about the battery and replacement batteries.  I should have listened to several other reviewers.1) I don't like a camera that can only charge the battery by taking it out and using a power outlet.  I have been spoiled by charging my camera on my computer with the USB.2) I needed a tweezer to get the original battery out to charge it.3) I ordered a second battery to always have one at the ready.  I chose a non-Canon vendor with the correct number on it NB-11L.  When received, the battery was slightly longer and thicker.  After trying a few times to insert it, I decided to return the battery so that I wouldn't damage the camera.I have only had the camera for a short time so I may not keep it either because of the above comments", "Date": "April 29, 2014"}, {"Title": "USER FRIENDLY", "Author": "kim", "ReviewID": "R1WK9ETRFQLATX", "Overall": "4.0", "Content": "I NEEDED A BASIC DIGITAL CAMERA THAT WAS IDIOT PROOF AND THIS IS IT. IT IS SMALL AND COMPACT ENOUGH TO CARRY IN MY PURSE. TAKES GREAT PICTURES AND HAS A RECHARGEABLE BATTERY. NO ONE HAVING TO BUY THEM. ONCE YOU FIGURE IT OUT IT IS EASY TO UPLOAD YOUR PICTURES", "Date": "May 7, 2014"}, {"Title": "Quality Itiem", "Author": "Paul Morneau", "ReviewID": "R3KFXZUVATS7P0", "Overall": "5.0", "Content": "I use this camera all the time and it works beautiful. The screen that displays the picture works perfectly and I would highly recommend this camera for the money.", "Date": "December 19, 2013"}, {"Title": "just ok", "Author": "B. Hoffmann \"mom of 3\"", "ReviewID": "RA0P8D0TZRCL6", "Overall": "4.0", "Content": "For the price this camera is fine. We didn't need a fancy camera with all the bells and whistles. This camera is easy to use but the time between pictures is a little long. Action pictures are blurry so that is disappointing because what child wants to be completely still? For now it works for us but I think in the future we will want a better camera.", "Date": "November 9, 2013"}, {"Title": "camera elph 130", "Author": "kima", "ReviewID": "RSIYQNVDR5LEH", "Overall": "4.0", "Content": "The camera feels...really light, but its not a good  light, like its a plastic toy camera. other than that I tried shooting a couple times and the quality is great, just like it said.", "Date": "October 7, 2013"}, {"Title": "Not up to Canon Standards", "Author": "Susan", "ReviewID": "R11EYKZJU01FTS", "Overall": "1.0", "Content": "This little camera, I suppose, would be OK if all you were shooting were stationery objects at near range. But who does that?The shutter is so slow to fire objects about to move are in the next county before the shutter releases.It has a zoom but the quality of the photo using it is horrendous.I regret having purchased this camera.", "Date": "May 28, 2013"}, {"Title": "Great camera", "Author": "Bonnie", "ReviewID": "R2H1A4FXEOZ3TO", "Overall": "5.0", "Content": "Very pleased with this camera and easy to use/understand.  Takes great pics, too!!!Have had many positive comments.  Can't beat a Canon.", "Date": "April 9, 2013"}, {"Title": "very nice Camera for using in home", "Author": "irakli uchadze", "ReviewID": "R15VWTEBEVVCOY", "Overall": "5.0", "Content": "I bouy it form my cusen, he is very sutiffueddon await from camera same magic fotos , it is camera form family foto and nothing more", "Date": "April 10, 2014"}, {"Title": "My granddaughter loves it.", "Author": "careful shopper", "ReviewID": "R2S4DKKWYDTKUU", "Overall": "5.0", "Content": "I gave this to my granddaughter for Christmas.  I have not had any hands on experience with the camera but I gave it 5 stars because she has enjoyed it so much.", "Date": "February 15, 2014"}, {"Title": "Canon Power Shot", "Author": "Mary Ann Murray", "ReviewID": "R1G1PY7SJWBD8Y", "Overall": "4.0", "Content": "Received in a very timely manner.  Christmas gift, so no knowledge of how my granddaughter will like it.  She chose it, so probably will enjoy it.", "Date": "December 29, 2013"}, {"Title": "Happy customer", "Author": "lea", "ReviewID": "R26PLSBG2ZQP6V", "Overall": "5.0", "Content": "Super good ittem and fast delivered thank u i buy for my little daughter (and orderd one more for my older one she is sooooooo happy", "Date": "December 17, 2013"}, {"Title": "Mediocre camera", "Author": "Bianca", "ReviewID": "R2PWAZGL2PE7BF", "Overall": "3.0", "Content": "The camera works great for basic shots. At night and in bright light the shots aren't that great. It's super easy to use on automatic and manual. I wish I had saved my money and bought a better canon camera, but I was very impatient. It does focus really well. It is probably the best digital camera I have owned, but it's really not exactly what I was looking for. Plus, the bottom half of the lens is sticking and won't close, which is really upsetting.", "Date": "July 19, 2013"}, {"Title": "Canon PowerShot", "Author": "Dr. Leigh E. Tenkku \"bookaholic\"", "ReviewID": "R30HFNHNU32W8B", "Overall": "5.0", "Content": "Love the camera. Love the color. Very easy to use and very lightweight so easy to carry around! Buy it!", "Date": "May 27, 2013"}, {"Title": "love camera not software", "Author": "J. Sallee", "ReviewID": "R2USSWPQDRXUS3", "Overall": "4.0", "Content": "This software isn't as user friendly as my last camera, which was a little harder to work with than the one before that. Quit making it a process to download. Also, none of my cards fit , it wasn't SD format. Pictures are very good, clear, crisp. Auto feature is good. Why are all the cameras made with the on/off next to the take pic button. I turn the thing off half the time I'm trying to take a picture. Big foot is safe around me!", "Date": "May 22, 2013"}, {"Title": "Will not connect to iPad mini", "Author": "Ann M Johnson", "ReviewID": "RS8J4CTNWXZ6G", "Overall": "1.0", "Content": "We bought this camera for a trip and its ability to connect to the iPad.  Evidently the new iPad update does not allow the app to work.  So what is the purpose of buying a camera with WiFi capability if the pictures won't transfer?  It is going to be returned.", "Date": "March 16, 2014"}, {"Title": "Not bad for the price", "Author": "Richard Ago", "ReviewID": "R3ANMQ3RTW1NJC", "Overall": "3.0", "Content": "Price is good, pictures are nice.  Not as fast at taking pictures as my DSLR but ..... it is not a DSLR.  I like this for going out to events so that I do not have to lug around a bag or wear my camera around my neck all night and worry about putting it down.", "Date": "December 20, 2013"}, {"Title": "Canon", "Author": "Sherry", "ReviewID": "R2548DNPDW5XGA", "Overall": "5.0", "Content": "I've only had this camera two days but I love it and the size. Easy to set up and to use. Directions are simple enough for even me. This camera is replacing a $350.00 Kodak that was bulking to carry and the batteries were constantly going dead.", "Date": "June 6, 2013"}, {"Title": "Canon PowerShot ELPH 130 IS 16.0", "Author": "mofran", "ReviewID": "R2Z0JHBPJC1FMC", "Overall": "3.0", "Content": "I like the efficient way it came, but there was no memory card so I just had to order one for $16 from a camera shop. So the price was not really true because who can use a nice camera without a card? Maybe I can post a nicer comment when I can use it. :)Any thoughts?", "Date": "May 3, 2014"}, {"Title": "Canon Powershop ELPH", "Author": "Joan L. Lovejoy", "ReviewID": "R1MIOXIFDJ3N2Q", "Overall": "5.0", "Content": "I bought this for travel and am looking forward to using it a lot.  I too my big camera to Europe last year and found it was too cumbersome taking it in and out of backpack.........", "Date": "February 28, 2014"}, {"Title": "A dissapointment", "Author": "P. Lauriello \"pjl\"", "ReviewID": "R94RIJALO0SAZ", "Overall": "2.0", "Content": "I read the reviews and bought the camera. I don't know what these people are doing that I am not but this is the most difficult menu I ever had to figure out. This camera is NOT user friendly and mine will not even take pictures with a flash mode on. This is the worst camera I ever owned. I called the Cannon company customer service and he couldn't figure it out either. This camera is awful and that's the best I can say for it. Don't waste your money.", "Date": "November 2, 2013"}, {"Title": "NOT A VERY GOOD CAMERA IF YOU REALLY CARE ABOUT YOUR PICTURES", "Author": "Mikec", "ReviewID": "R1HWM6UG3NLADI", "Overall": "3.0", "Content": "I RESORT TO USING IT JUST TO TAKE PICS FOR MY EBAY SALES IT DOESN'T DO VERY WELL AND I WOULD NEVER USE IT FOR A BIG FUNCTION SLOW AND NOT A VERY GOOD ZOOM JUST A OK CAMERA I PAID $88 SO NOT TOO BAD ON PRICE AND IT'S WIRELESS UPLOADS NICELY BE SURE TO DISABLE FIREWALL OR YOU'LL NEVER GET IT TO WORK IT DOESN'T WORK ON  5G WIRELESS NOT THAT BIG OF DEAL", "Date": "May 4, 2014"}, {"Title": "Cheaply made camera", "Author": "Anthony C Lombardi", "ReviewID": "R3AUOGJ7MZE5VK", "Overall": "2.0", "Content": "Used it for three months and I received average photos. Opened up case after storing in Amazon purchased case just for camera and found lens covers had become jamb. When on switch is pressed only one side lens opens then with me help, I slide the other open. Neither close when camera is turned off.Would not buy this style - very fragile camera.", "Date": "June 7, 2013"}, {"Title": "Expected better", "Author": "A Schwartz", "ReviewID": "RPBXQBQJRGJ6G", "Overall": "1.0", "Content": "I Expected better quality, I was surprised when I received this, it's so low-quality, I don't recommend to Buy this.", "Date": "March 7, 2014"}, {"Title": "Extremely poor quality photos. Do not buy this camera.  Big disappointment", "Author": "Fashioneer", "ReviewID": "RJGKF9X1XFN18", "Overall": "1.0", "Content": "Poor picture quality.Every picture is blurry and grainy.The color quality was poor under everything but natural lighting.Low light pictures were terrible.The auto focus was slowMy 10 year old Sony 5mp was far better in every way.The only good thing I can say was it was light and fits in your pocket easily", "Date": "December 6, 2013"}, {"Title": "Takes Pictures.", "Author": "Kendall Smith", "ReviewID": "R6ZTEF200MELA", "Overall": "4.0", "Content": "This is a camera, which takes pictures. And it does a decent job of it. It also fits in  your pocket. So if you're looking for a camera that takes pictures and fits in your pocket, you might consider this one. Because it works.", "Date": "July 19, 2013"}, {"Title": "Sent it back", "Author": "Artcindy", "ReviewID": "R2F8WD7ZEDCH6R", "Overall": "1.0", "Content": "This camera did not have a lot of features and was hard to work with. Thankfully Amazon took it back after I had the chance to try it out.", "Date": "May 7, 2014"}, {"Title": "Right out of the box, it's a PITA! UPDATE after one disa=strous weekend", "Author": "Jay Wimer \"Jaybawb\"", "ReviewID": "R68FQNBMKA8B1", "Overall": "1.0", "Content": "Canon PowerShot ELPH 130 IS 16.0 MP Digital Camera with 8x Optical Zoom...OK, I have not shot the first photo yet, and I;m already totally turned off by this miniature monster.First off, a couple of good AA batteries were good enough for the last little canon i bought. THIS baby has to have a proprietary battery and a proprietary charger. It's not about the consumer, folks, it's about the \"after-market\". So, if I'm really serious about back-country traveling, i''l have to shell out more bucks for another battery, AND there is one more thing to remember to take along - the charger.Then there is the flimsy little strap that has to be threaded through an impossibly small hole to be attached.Miniaturization has reached its limits. The thing is just too DANGED SMALL.  So, I'm sitting here,  wait for the $%^#@ battery to charge.When/if I get a chance to actually take a picture, I'll update this review.UPDATE 5-20-2014There is one \"little\" problem. After charging two new batteries, I put one in the camera, turned it on and got the message \"charge the battery\". Put it back in the charger, got the green light, tried again, same problem.Finally noticed that there is just a slight amount of 'play' when the battery is resting against the red battery lock, so i stuck a small piece of paper over the battery to wedge it tight in the case. VOILA! It works. I  had the  same problem with the original battery that came with the camera, so there is no telling if it's a design flaw in the camera, or a design flaw in the batteries, but after missing  a LOT of photo mops over the past weekend, my attitude is \"a pox on BOTH your houses, and I'm putting up this same review for the batteries.OH- And another thing: the batteries don't 'naturally\" slide into the case. You have to work at it and it IS possible to get them in backwards.  This is beyond stupid.First photos were not too bad, and the videos, too. But I missed a lot of shots dues to the bogus 'dead battery\" problem.", "Date": "May 10, 2014"}, {"Title": "Software is full of malware", "Author": "cynthia", "ReviewID": "R1489JD1CI5XAM", "Overall": "2.0", "Content": "I just bought this camera.  Haven't used it yet so don't know the quality, ease of use, etc.  But I did install the software.  It is FULL of malware.  My computer slowed down considerably.  All of this crap started showing up.  Finally traced it back to a day last week when I installed the Canon software.  Took me an hour to remove it all.It REALLY colors my view of Canon. Why, Canon, do you want to taint your reputation and piss off your customers by doing this? Are you so desperate for revenue that you have to sell out to these malware losers?I am FURIOUS with you!!!!!!!!!!!!", "Date": "May 24, 2013"}, {"Title": "Average Camera", "Author": "Jizzy Gillesspyy", "ReviewID": "R3CVV3TZS0J6ZQ", "Overall": "3.0", "Content": "Bought this little bad boy here with nothing but good thoughts in mind, that is until I received it in a smashed up package.  No harm done though, figured it was the damn pothead UPS guys smashing up my packages as usual.  I had great confidence in how this little guy was going to perform, that was until I tried shooting my first porno flick with it.  On the mini LCD located on the camera, the picture looked great, but once I plugged it into my TV everything was fuzzy and dark.  It also made the women in my shoot look like they added on 15 pounds and made them look 3 shades darker than they really were.  I was not very impressed with this camera.  I am just an up start business man in a field that requires HD now days and frankly, this little guy just doesn't cut the gravy.", "Date": "March 10, 2014"}, {"Title": "Hate it!", "Author": "Mom in SD", "ReviewID": "R2GJKQ0KAOKZDE", "Overall": "2.0", "Content": "We had a Canon Elph for two years, and after dropping it a ton of times, it finally broke. I did a lot of research and bought this camera, and I am soooo disappointed. Our old Elph took beautiful crisp pictures. The quality was seriously amazing. I feel like every picture that I take with this camera comes out blurry. I wish I could return it.", "Date": "November 12, 2013"}, {"Title": "Disappointed", "Author": "E. A. Veronda", "ReviewID": "R17464FNJMW8AU", "Overall": "1.0", "Content": "A bought this camera based on the reviews and a recommendation from a photographer who bought one for his wife. I sent it back.The camera being so compact is difficult to keep steady. only one out of three pictures came out clear the rest were distorted. I don't know if I just happen to get a lemon or what... I'm just really disappointed.", "Date": "May 8, 2013"}, {"Title": "Nice", "Author": "RDL926", "ReviewID": "R1MAI6QVZL5LGR", "Overall": "3.0", "Content": "I opened the box, charged the battery and then realized Canon doesn't include a memory card. When I finally was able to use this I found it was very nice. LCD is nice and large.  Pictures are also nice. As a replacement for an old and broken camera, this is a good buy.", "Date": "June 23, 2013"}, {"Title": "No memory card? Really?!?", "Author": "AF \"nyc male\"", "ReviewID": "R2C1VH9XL87WJ", "Overall": "1.0", "Content": "So I received my phone, thinking it will work out of the box... only to discover that it requires a memory card... which is NOT included.  Why sell a camera that requires a memory card and not include it?!?  I'd give this a zero star if I could.", "Date": "April 30, 2014"}, {"Title": "beware! memory card not included.", "Author": "L. Krause", "ReviewID": "R29EXC9485154B", "Overall": "1.0", "Content": "You need a memory card for the camera to work. they did not tell me that, so I can't really rate the camera yet.", "Date": "March 4, 2014"}, {"Title": "I'm Sure This is a Fine Instrument, But it Rubbed Me the Wrong Way.", "Author": "Legal Guardian", "ReviewID": "R2Y0SQU7LATFEH", "Overall": "3.0", "Content": "If, after an exhaustive search, this camera is your choice, then you should buy it.  After all, I have had friends marry individuals who I thought were wrong, in myriad ways, yet the marriage went well.  In like manner, I simply didn't like the looks of this thing, the cut of its jib, so I sent it back without even removing it from the box.  Perhaps I should be reviled for such shallow behavior, but I was caught in an emotional \"blink\" - a tipping point, a behavioral quick of nature, which might be traced back to one of my ancestor's reaction to a dinosaur.  For one thing, I didn't want to hold this queer little thing at a 90-degree angle in order to use it.  It made me feel awkward and off balance.  Since it is called a \"canon,\" wouldn't a canon be placed squarely on the ground in order to be useful?  Who would fire off a canon with it lying on its side?  The lens, too, was positioned to one side, like some monstrous fetus, whose aberrational growth had produced a single, gargantuan eye, the unviable mass forever preserved in a jar of formaldehyde.  I couldn't bear to touch it.  I wanted symmetry, normalcy, and proportionality.  However, if such a curious thing is to your delight, then please do not be influenced by my derogative comments.", "Date": "December 2, 2013"}, {"Title": "Gift", "Author": "Debus", "ReviewID": "RGEXU193WODSS", "Overall": "1.0", "Content": "Purchased as a Birthday gift. Not yet given or used. Undetermined rating at this point the rating request is premature.", "Date": "December 24, 2013"}], "ProductInfo": {"Price": "$149.00", "Features": "3-inch TFT color LCD with wide-viewing angle monitor\n16.0 megapixel 1/2.3-inch CCD sensor\nDIGIC 4 image processor for exceptional performance\n8x optical zoom with 28mm wide-angle lens\n720p HD video with a dedicated movie button", "Name": "Canon PowerShot ELPH 130 IS 16.0 MP Digital Camera with 8x Optical Zoom 28mm Wide-Angle Lens and 720p HD Video Recording (Silver)", "ImgURL": "http://ecx.images-amazon.com/images/I/41UUhbZXEKL._SX300_.jpg", "ProductID": "B00AWYN0ME"}}