{"Reviews": [{"Title": "excellent camera", "Author": "Victor", "ReviewID": "R2XMRW492ZZWG2", "Overall": "5.0", "Content": "the camera was shipped by focus camera seller and was received one day earlier as scheduled. i was reluctant at first to make my purchase in this seller because it is merchant. but it was not a mistake that  i have save a lot because i purchase this camera as bundle with a 32 GB sony sd card class 10, sony camera case, 2 wasabi replacement battery & battery charger and a screen guard which is garbage. the bundle is a huge savings for $9 more than the price which amazon sells for the camera alone. i am a canon user and i was just so curious seeing the excellent review of this camera. i then decided to purchase and try its capability. it took excellent pictures and videos are as excellent as a dedicated video camera. one very minor negative is only the body which is a slightly slippery to hold. if you are in a search for the best point and shoot camera, you can never make mistake with this rx100 if only you can live with the higher price in which for me is worth every penny. i would highly recommend this camera.", "Date": "May 24, 2013"}, {"Title": "Great camera, great package", "Author": "tthayil", "ReviewID": "R3SBXDWKGTPY8I", "Overall": "5.0", "Content": "Was in the market for a new pocket camera and a friend told me about the sony line above this camera with the removable lenses, mirrorless system etc.Well, I needed a POCKET camera and this was the closest thing that fit the bill with the reviewed picture quality I wanted, (researched on dpreview.com)The picture quality is amazing.  Automatic mode gives great photos that rival our larger SLR, and it has enough options for more experienced shutterbugs to tweak.I was impressed by the package included as it made up for the retail pricing.  It is a sony memory card and bag.  VERY useful having an external charger and a few extrabatteries, as Sony does not include a charger with the retail box (a big mistake IMO as the flimsy door covering the USB port is bound to come unhinged).The included batteries don't seem to be as good as the original but they really should play backup duty only.  I have yet to apply the screen protectors.You won't regret the purchase, pictures serve as windows background on my 26\" monitor at 2560x1440 and are crystal clear.", "Date": "May 5, 2013"}, {"Title": "Package/seller Review", "Author": "Twingo", "ReviewID": "R7CQ7N1ZROOTX", "Overall": "5.0", "Content": "I am not here to review the camera, we all know that the RX100 is a dream come true. I actually love her more than my NEX system! I am only keeping my NEX for the fisheye and zoom lens.Anyway, enough about that. I am here to review the seller \"Focus Camera\" and the package. If you look closely this seller has another package with PRIME, but it is not as good as a deal as this package. I was a bit hesitant to purchase with them without PRIME, I have become so dependant on PRIME that anything else is almost non acceptable.I will say that the seller is absolutely fantastic! I purchased the item on a Tuesday night and received them on Friday morning. The package was shipped via UPS, and they had the signature required option for the delivery. Although not PRIME fast, it is still a very fast shipping service.The kit is exactly as described, the only thing that is slightly different is the case. In my package I did not get the case in the picture, instead I got the \"Sony LCS-CSW\". It is the same case that you see in their other package. Ironically I actually wanted this case, instead of the one that is advertised in the picture. The case fits the camera perfectly!The only thing here that is not to my standards are the screen protectors, but they will do until I buy a better one.Overall I am very happy with this seller and the package. And I am absolutely in love with the camera!", "Date": "June 21, 2013"}, {"Title": "Perfect camera for the novice and semi pro.", "Author": "H. Chen", "ReviewID": "R1FUUG3QFY91BU", "Overall": "5.0", "Content": "I just got it last week and still learning all its features.The only thing I dont like about it so far is the pop up flash. most people are used to holding the camera on the top side and that will prevent the flash from popping up and it makes a loud noise if you do that. It will take me some time to get used to that.Other than that, this camera have many features which I dont think I will use them all. It takes great low light pictures so far. It is the best point and shoot camera I have own so far.", "Date": "May 21, 2013"}, {"Title": "Worth it", "Author": "TULIO COSTA", "ReviewID": "R28T1P1Y11N6M8", "Overall": "5.0", "Content": "Excellent camera, low cost, perfect size , light weight, modern design, easy to operate, fair pricing, high quality picture, multiple features", "Date": "January 9, 2014"}, {"Title": "Great Camera!", "Author": "David V. Stutts", "ReviewID": "R4GFEBABK0KMY", "Overall": "5.0", "Content": "The Camera takes stunning pictures and the video capability is outstanding even in low light.  I am completely satisfied with this purchase.", "Date": "December 8, 2013"}, {"Title": "Big Camera results in a little compact body.", "Author": "Nekesha Batty", "ReviewID": "R2HHMQ3BA7EFH2", "Overall": "5.0", "Content": "I bought this camera before going camping with the family, and I am glad I did! I had been pining over every DSLR camera that has come out since 2008.  This year when I finally broke down and came up with the money for one, I decided I wanted something with all of the power but not the bulky size.  Cue the Sony DSC-RX100.The picture quality if so crisp, everyone kept commenting on how you could see their pores (and you really could).  Also, I am by no means a camera buff or snob, but I felt completely comfortable using this camera and did not feel overwhelmed by all of the technology.  It has a really cool feature that lets you change the lightness of the picture, saturation (which may be the same thing, but again, I am no camera buff).  All-in-all, it was well worth the money.", "Date": "October 3, 2013"}, {"Title": "Very happy with this camera", "Author": "Kevin Meyer \"Author, Evolving Excellence\"", "ReviewID": "R261Q2YJQZQSCD", "Overall": "5.0", "Content": "I purchased this camera right before our vacation to Bhutan and Nepal.  I had been in the habit of just taking my iPhone on vacations instead of the DSLR (Nikon D60) as I liked the portability and the quality was so good.  But I knew this vacation was going to have some memorable scenic views, so I wanted something better.  But I didn't want to lug the Nikon D60 all over the place.  Well, we just returned, and I'm more than happy with the Sony RX100!  Fantastic photos, camera easily fit in my pocket, and there were many instances where we zoomed in after taking the photo and found real beauty.  20 megapixels lets you do a lot of zoom and still maintain quality.", "Date": "September 16, 2013"}, {"Title": "Far Exceeded my expectations!", "Author": "James Metcalf", "ReviewID": "R1K69OAB7M5ORL", "Overall": "5.0", "Content": "Wow! This camera does it all in a pocket camera! Far exceeds my expectations and fits in my pocket. Take it any where and it wont load you down with bulk. Image quality is superior to anything out on the market I have seen. Manual setting is easy. Incredible performance overall and especially in low light situations. Takes a bit of getting used to at first because the manual just covers the basic features. Thank goodness for Google search. My only complaint would be the macro mode focus is slow and I then need to back up a bit to get crisp image.I could go on about how wonderful this camera is. Buy one, you won't regret it! I love it!!", "Date": "May 5, 2013"}, {"Title": "Very good camera", "Author": "Azuaga", "ReviewID": "R1TAZ62NXY4DRO", "Overall": "5.0", "Content": "The camera is very good. I intended to buy a point and shoot one, just for those days I don't want to use my DSLR and it fitted just fine. By the way, the delivery was on time.", "Date": "April 4, 2013"}, {"Title": "Great camera", "Author": "JMB \"brown0143\"", "ReviewID": "R125CXOQ05VGON", "Overall": "4.0", "Content": "Takes great pictures but camera's menu system is NOT very intuitive and is difficult to navigate.  I would but it again.", "Date": "July 10, 2013"}, {"Title": "sony rx100 bundle", "Author": "sixpak3919", "ReviewID": "R1R7PMIUKJO0Y8", "Overall": "5.0", "Content": "the sony rx100 is the best point and shoot camera by far with 1 neg. takes great pics and video with all the settings on auto. only complaint about this camera is I wish it had wifi built in. other than that, its the best point and shoot camera.", "Date": "April 28, 2013"}], "ProductInfo": {"Price": "$609.00", "Features": null, "Name": "Sony DSC-RX100 RX100 RX100B DSCRX100 20.2 MP Exmor CMOS Sensor Digital Camera with 3.6x Zoom + 32GB Class 10 Memory Card + Wasabi Replacement NP-BX1 battery + Sony Soft Carry Case + Accessory Kit", "ImgURL": "http://ecx.images-amazon.com/images/I/51l1oKq8NtL._SY300_.jpg", "ProductID": "B00AJNJDDI"}}