{"Reviews": [{"Title": "Excellent Ultra compact", "Author": "pegasus2", "ReviewID": "R1M997UMB0EA2H", "Overall": "5.0", "Content": "The Panasonic Lumix XS-1 is probably the best ultra compact digital camera currently available. It is far and away a better performer than it's rival the Nikon SO1. The intelligent auto mode makes it almost impossible to take a bad photo. Even photos taken in low light conditions are better than average. While the video is 720p HD, it's not much better than standard definition but for short clips it's fine. The battery is charged while in the camera via a usb or ac power source. A fully charged battery is good for at least a couple hundred shots. Build quality is good also. One note. Make sure you slip your hand through the wrist strap because the camera is so thin, it would be easy to lose your grip. I'm glad I bought it. Also, my first order got lost in shipping. Amazon immediately shipped me another one with free overnight delivery. Highly recommend the XS-1 and Amazon...", "Date": "May 15, 2013"}, {"Title": "Lots of potential but too glitchy", "Author": "Todd G", "ReviewID": "R19DB92JSVZCFL", "Overall": "3.0", "Content": "I really wanted to like the XS1 because the small form factor was perfect for dopping in my pocket and taking along wherever. As they say, the best camera is the one you have with you. But if the camera's software locks up after taking multiple photos and doesn't save the photos to the card, it's worse than having no camera because of the disappointment of losing once-in-a-lifetime shots that should have been captured.Aside from the lockup problem, which happened three times before I decided to return it, the camera's processor is very slow. Sometimes button presses don't register immediately or at all, and it takes a long time for the camera to process and save photos. Maybe I just got a bad one - it is early in the production cycle - but this thing is way too glitchy to rely on. It's a shame because I think Panasonic generally makes very good cameras. I have a Lumix LX-5, which is fantastic though not very pocketable.On a positive note: when the camera did function properly, the photos were generally pretty good. The lens is nice and wide and captures a lot of scenery. The color was fine and the auto exposure does a good job. The zoom is impressive for a camera of this size, too. It doesn't shoot in RAW, so it's really just a snapshot camera. And that's fine for what it is. If you get one that doesn't have the problems mentioned above, you'll probably be pretty happy with it.", "Date": "May 26, 2013"}, {"Title": "Very slow shutter", "Author": "Richard Rahme", "ReviewID": "R1FY074S88OXY", "Overall": "2.0", "Content": "Four seconds lag for the photo to be recorded following the shutter release. Extremely enervating. One of the few Panasonic products that did not meet my expectations.", "Date": "September 18, 2013"}, {"Title": "Great Little Camera with Caveats", "Author": "ARNOLD BREIS \"Abreis\"", "ReviewID": "R160AJ0PKOVKRY", "Overall": "4.0", "Content": "I am a photo entusiast and this camera is now my everyday one that I can take anywhere. The pictures I have taken outside are fine and inside without flash (if it is bright) are also OK. If you need to use flash make sure the subject is not more than 10-12 feet away.  Remember, it's a small point and shoot so don't expect stellar results otherwise. Between the 12 filters, different shooting scenarios, sweep panorama and low price you can't go wrong here. The only problem I have with the XS1 is as the battery drains the playback and shooting speed slows down. Also, stay away from the retouching mode as it has a tendency to lock up the camera. Other than my caveats, I would definitely recommend this camera for traveling and everyday shooting.", "Date": "September 11, 2013"}, {"Title": "Perhaps it is too small?", "Author": "Eric Lukens", "ReviewID": "R24BY3UE2UJMV3", "Overall": "3.0", "Content": "First, be sure to buy a Micro SDHC card with this camera. While Amazon shows full-size cards as accessories to buy, it actually uses Micro SDHC, as written in the description.Further, it uses a proprietary USB cable to charge and download pictures. This is absurd in this day and age, though admittedly common in the digital camera market (why do we as consumers put up with this?). If you are providing a USB cable to save money on providing a stand-alone battery charger, at least use a standard Micro USB cable that all of us have easy access to in stores should we leave a cable at home. I'd have even been happy had they used Mini USB, but no such luck. Second, if you're providing a proprietary USB cable as the only means of charging and connecting it to a computer, at least make it a reasonable length. The cable is very short--around 20 inches long. As such, you're going to need an appropriately placed table or something right by an outlet, or you'll have to get out an extension cord or USB extension cable. Alternatively, you could charge via a computer USB port if you have that handy and don't mind it sitting there. It does appear that additional cables can be had from 3rd party sellers for a reasonable price.Pros:* It is small, smaller than my Samsung Galaxy cell phone by quite a bit. Picture quality is quite good given the tiny size.* 5x optical zoom does well, again especially true given the size.* On paper the features sound good.Cons:* It is so small to be a bit cumbersome to use without petite hands. The buttons are small and close together.* The menus provide very few options as this thing tries to be fully automatic. (This may be a pro to some users.)* That USB cable is inexcusable.* The battery and Micro SDHC door cover is flimsy and somewhat difficult to use. I'd be worried about using it often.* MicroSD cards are more expensive and harder to deal with if you want to remove the card to download pictures (if you use the USB cable, probably doesn't matter). However, combining the Micro card *AND* the proprietary USB cable is a double-whammy annoyance--no way to get the pictures off that doesn't involve either handling a Micro SD card behind a flimsy and difficult to use door or finding that special USB cable that you probably left somewhere.* Camera's response to input and movement is sluggish.Overall, these issues with this camera cannot be overcome by its nice small size for us, we'd rather have one that's a bit bigger that solves some of these issues. I'm sending it back. However, I do fully admit that it might be a good camera for some people.", "Date": "July 10, 2013"}, {"Title": "Design doesn't outweigh quality", "Author": "Greta Garbo Jr.", "ReviewID": "R1F7J6J9MS1NML", "Overall": "2.0", "Content": "The design is great. Buttons a little small as mentioned in other reviews, but I wouldn't have returned it for just that. I thought for 16 MP I might be getting a decent point and shoot, and I have other Panasonic cameras that are great. But unfortunately the quality really wasn't there, and I would have to compare the results to a 5 megapixel cheaper camera. I don't know how it compares to other point and shoots.", "Date": "July 25, 2013"}, {"Title": "So far, a great little camera!!", "Author": "Donald Erickson", "ReviewID": "RXOFJXE8K32KQ", "Overall": "5.0", "Content": "Camera was a purchased for a person with zero experience in photography. Set camera to it's auto mode and away she went, taking hundreds of photos. Could not be happier with the results! Every photo, no matter the conditions, has come perfectly exposed and focused. Camera will likely never be used to its full potential with all its modes and features, it's doing exactly what it was purchased for. Great little camera!!", "Date": "July 6, 2013"}, {"Title": "Daughter Loves it", "Author": "Carlton O Phelps", "ReviewID": "RMA36AC7V9UGQ", "Overall": "5.0", "Content": "Given as a gift and our daughter loves it. Not larger than an iPhone so she can carry it all of the time and use it quickly. Lot's of functions for the beginner or the weekend shooter. As always I can trust the Lumix to deliver.", "Date": "January 11, 2014"}, {"Title": "Fantastic truly 'pocketable' camera.", "Author": "treehouse", "ReviewID": "R3SIXW21HIH7IZ", "Overall": "5.0", "Content": "Obviously there is going to be a bit of trade-off when it comes to compact cameras. The great advantage with this camera is that it will truly fit into your pocket comfortably (even with fairly tight pants on), it has a nice alloy build, it looks great, and it takes reasonably good pictures. For what it is (you wouldn't expect DSLR quality images from this camera), it is a steal.", "Date": "December 16, 2013"}, {"Title": "awesome quality for a decent price", "Author": "JC", "ReviewID": "R1PAGUDUGTW0WS", "Overall": "5.0", "Content": "amazing little camera, very easy and simple to use. decently priced as well, if all you need is a good quality picture this is a good pick", "Date": "November 23, 2013"}, {"Title": "Just OK for the price, but is it any better than my iPhone camera?", "Author": "S. Goldstein \"toys for big boys junky\"", "ReviewID": "R2S6JG51PZTMON", "Overall": "3.0", "Content": "I have only had the camera for a few days, and I have taken a few shots of friends at lunch to test it, and no videos yet.  So, my remarks may not be terribly helpful.  I will try to return and write more after I get to use the camera a little bit.  First, the camera package includes a hand strap which is very useful and one Panasonic DMW-BCL7PP Li ion battery.  But, no case and no SD micro card.  And, no external charger, just an external power supply for the included USB charging cable (which is neither standard micro- nor mini-USB size at the camera end, but rather what appears to be a proprietary Panasonic size--happily, cheap additional DMW-USBC1 cables are available from vendors on the 'net).  So, be prepared to spend more to fully trick out your purchase.As to performance, the camera is rather slow, both to start up and to save a photo just taken before being able to move on to the next photo op.  And, one photo of a luncheon companion who was but a few feet away was not in focus...blurry.  The background was in focus, so it was not camera shake.  There was plenty of light, so I should have had plenty of depth of field.  So much ambient light that I could not notice that the person's face was not in focus by looking at the none-too-bright LCD screen.  Disappointing.Bottom line: for a cheap, very compact (smaller than my iPhone 4) point-and-shoot camera, it's OK.  But, I wonder if I would have been just as well off to have used my iPhone to snap pictures instead.", "Date": "July 28, 2013"}, {"Title": "Great gift", "Author": "John Joiner \"Sunshine SuperMan\"", "ReviewID": "R2I7O7XUEC74Z0", "Overall": "4.0", "Content": "You cannot go wrong handing this to someone as a gift.  Small enough to carry anywhere and yet it has so many functions.  Great all purpose camera.", "Date": "July 9, 2013"}, {"Title": "Nice Product!", "Author": "JE of HNL", "ReviewID": "R256UCK3LV9NMJ", "Overall": "5.0", "Content": "Love this new camera from Panasonic. It is so portable, and practical, and the best part is that it takes superb pictures.", "Date": "May 11, 2013"}, {"Title": "it is good looking", "Author": "Zhiyi Guo", "ReviewID": "R3S6Q6WET4YOT8", "Overall": "3.0", "Content": "Looking is good. I bought the white one. It is very small like a mobile phone,just a little  thicker.The image is not good  although it has wide angle function (to 25mm). If you take picture in the night, you can not get good image.So I give the 3-star meaning it is small and beautiful but you can not get the good picture quality.", "Date": "June 10, 2013"}, {"Title": "Small and Elegant", "Author": "Cindy Phillips", "ReviewID": "RMPUFLFY67HET", "Overall": "5.0", "Content": "Perfect! The best camera ever. Good quality pictures and easy to use. Looks good too. I love this camera very much!", "Date": "August 3, 2013"}, {"Title": "You get what you pay for", "Author": "spandex wife", "ReviewID": "R2IC80F85DCFD4", "Overall": "4.0", "Content": "This was an extra camera for us we have a really good one. this was a quick small one we got for day trips not bad not great", "Date": "September 17, 2013"}, {"Title": "Thin dependable and great pictures", "Author": "Star Valley", "ReviewID": "R12XJHE3KGNRQX", "Overall": "5.0", "Content": "Camera fits in a shirt pocket. Great, clear zoom. This review requires me to add these last few words.  :)", "Date": "July 25, 2013"}, {"Title": "Gorgeous Photos", "Author": "pondwitch", "ReviewID": "R1QQ3OT5SAOLL8", "Overall": "4.0", "Content": "The camera takes wonderful pictures.  It will take a while for us to master all of the tricks.  It is complicated and not for the beginner.  The camera is so small that it is a little nerve-wracking to handle.The quality of the photos is incredible as long as you are in the appropriate \"Mode\".My one huge beef about it is that the icons on the screen are so tiny that if you wear reading glasses, you cannot decipher them without the glasses--this can be maddening and defeat the purpose of impulsive picture-taking.For taking set-up or posed pictures, it is perfect.Riding your horse and taking snapshots as you go along---better be all set up for that in advance.", "Date": "July 21, 2013"}, {"Title": "instructions", "Author": "Angelo George", "ReviewID": "R3UBUGQ9GNV66W", "Overall": "3.0", "Content": "Instructions for deleting pix were not easy to understand.  Those are my thoughts and they do not need to be any longer", "Date": "June 1, 2013"}], "ProductInfo": {"Price": "$129.99", "Features": "16.1 Mega Pixel, 5x optical zoom, 8x Intelligent Zoom, Mega O.I.S.\n2.7\" LCD Screen, Intelligent Auto Mode, Venus Engine, 13 Effective Create Control, Sonic Speed Auto Focus\n720p Motion JPEG Video, Sonic Speed Auto Focus, Creative Panorama Shot, Lumix DC Lens", "Name": "Panasonic Lumix XS1 16.1 MP Compact Digital Camera with 8x Intelligent Zoom (Red)", "ImgURL": "http://ecx.images-amazon.com/images/I/413bMHwJy4L._SX300_.jpg", "ProductID": "B00ATE7VRC"}}