{"Reviews": [{"Title": "Decent point and shoot, but you may outgrow it in several months", "Author": "Mark B", "ReviewID": "R34EOXPDSWM3YH", "Overall": "4.0", "Content": "This little Sony camera is very compact and light, and is a good starter point and shoot at this price.  I take lots of pictures, so I was able to put this camera through its paces over about a three-week period.  Here is a run-down:The Good- Very light and fits in any pocket- Relatively low cost and does not \"feel expensive\", so I do not hesitate to just toss it in my pocket or bag- Has proven to be rugged.  Has survived abuse (per the above bullet) very well- Love the \"Easy\" feature.  It detects background light, fast action, faces, and other photo situations automatically.  You can override this feature in the menus option.- Has plenty of photo-taking options such as landscapes, beach, toy, b&w.; As mentioned below in not-so-good, these features are pretty cumbersome to get to.- Picture quality is very good for this price range.  There is no RAW file option, so you are totally dependent on the camera's JPEG processor, which is okay but has a lot of interpolation.  It is a little slow to process, but definitely adequate below $100.- Uses SD cards, not the proprietary memory stick that Sony had used in the past.The Not So Good- Very menu-driven, so it takes time to find a photo feature (such as toy, b&w;, beach, landscape, etc.) and you could miss your shot.  Best to stay in Auto/Easy mode since it does a decent job of choosing for you.- You have to navigate the menu to deactivate Easy mode before other options become available to you.  This will slow you down a lot and may cause you to miss some shots.  Ideally they would have any Easy mode on/off button on the camera itself.- The processor is slow, so there is a noticeable pause between shots.  The continuous shooting mode labors through about one shot per second.- The post-processing and photo enhancing features on the camera are of limited usefulness.  For example, it has a face enhancement feature that I found was only slightly effective.  You will do MUCH better using your inexpensive desktop photo software to add enhancements.  IMHO, this feature on the camera is more of a gimmick with primitive algorithms.- Sony has opted to use a non-standard USB connector.  I like standard connectors that can be shared between devices.  For this one, you will need to carry around the cord if you want to charge the camera's battery or transfer photos using USB.- To charge, you plug in the camera.  The battery is removable, but the camera does not come with a separate battery charger, so you have to use the camera as the charger. In other words, you cannot charge a spare while you are using the camera.  There may be an accessory for this, but then you are spending extra $$ on a low cost camera.RecommendationIf you want a low-cost, decent point and shoot, this is a good choice, particularly if you want to stay in easy mode most of the time.  If you end up loving photography, or if you are already an experienced photographer, this camera will feel light on features and customization options pretty quickly.", "Date": "June 12, 2013"}, {"Title": "Little Cam that Could", "Author": "A. Dent \"Aragorn\"", "ReviewID": "R3BZ7U4X061M0K", "Overall": "4.0", "Content": "I am not going to write a lot about specs but maybe I should note a few features:- Resolution up to 16.1 MP- 5x zoom- Accepts several types of memory cards: Memory Stick (Pro Duo, Pro-HG Duo, Duo, Micro), SD, SDHC, microSD, microSDHC- Rechargeable battery, AC charger, wrist strap and semi-proprietary USB cable included- Small and light- Photo, 360-degree panoramic and 720p video modes- Tripod socket- Relatively easy to navigate menus- Some image processing capabilities- Several levels of 'ease of use' from nearly full automatic to allowing you to set some basic parametersThis is a 'cheap' little camera price-wise but it's a quality build takes surprisingly good pictures when use on full-auto and even better ones if the operator has some basic skills. Yes, it's not a DSLR and it doesn't support Wi-Fi or Bluetooth or 'location' but if you can live without it and you have a kid that wants a camera and don't want to spend a lot getting him one, this is as good a pick as any.Yes, nothing is perfect. I do NOT like Sony's insistence of requiring a non-standard USB cable for charging and data transfer. While you can get around it when it comes to your memory card's file management, you must have a less common UC-E6 USB cable for charging the battery. And based on on my prior experience with a Sony Alpha, their tech support either don't know or won't tell you that you can buy a generic cable but will happily grossly overcharge you for a 'branded' replacement.I also wish the camera came with a case or a little bag, anything to protect it from scratches. Yes, we can supply our own and Sony will be happy to nickel-and-dime you a little and sell you the Sony LCSCSQ Soft Carrying Case for Sony T, W, and N Series Digital Cameras (Black) but I would have preferred to have it as part of the package.Not a negative at all, but it's worth noting that you need to supply your own memory card because the camera 'as is' can only take about 3 pictures. It's not a negative because you should be the one to decide what you want and in what size. After popping in a not so expensive Transcend 32 GB Class 10 SDHC Flash Memory Card the camera tells me that it can take 4710 shots at the highest resolution. Not bad.To conclude, I like Sony's camera a lot and I may end up buying another one for my wife who wants something very small that is 'not a phone'. A case and a more standard USB cable would have made this a 5-star rating but 4 stars (I like it) is not too shabby.", "Date": "May 24, 2013"}, {"Title": "Good camera", "Author": "Liv", "ReviewID": "R3AGDGYGN6LQNE", "Overall": "4.0", "Content": "I got this camera on sale for $65 and think it's definitely worth what I paid for it. At the retail price of $98, I think it's an okay buy, but I probably would not pay that much for it. This is an entry-level camera with a handful of special effects. If you're looking for a fancier camera that takes sharper photos, you should probably look at cameras over $100 retail. Even though it's a 2012 model and not being made anymore, at the time I'm writing this review (4/6/13) I recommend the DSC-W650 model over this one for an extra $21 (or less). Though megapixels and zoom are the same as this camera, the nicer lens on the 650 will give you sharper pictures. That being said, this camera also takes some pretty nice pictures. Images on the LCD screen may appear low quality while taking a picture, but images definitely look sharp once they've been taken. The menu is easy to navigate and it's simple to change between effects like toy camera and partial color mode. Videos look pretty nice as well. The camera is small and thin enough to fit in your pocket. The zoom feature, image quality, and special effects take this a step above many cell phone cameras. If you have a decent cell phone camera and don't care about the special effects of this camera, I recommend looking for something more expensive or just sticking with your cell phone. For a budget camera though, you get a variety of nice features and good image quality. It's good for kids and teens and for people who want something very portable and easy to use.", "Date": "April 6, 2013"}, {"Title": "Great Picture Quality", "Author": "Buffy", "ReviewID": "R3FSLWZ18UGG4O", "Overall": "4.0", "Content": "This is the fourth or fifth Sony camera I have owned and there's a reason I keep buying Sony: good picture quality. Natural lighting pictures look amazing. Flash photos are very good and you are able to adjust the brightness of the flash to suit your needs. While I prefer to use auto settings for most everything the nice thing is that there is always to option to adjust different settings as needed. 16mp is pretty much overkill but for someone looking to make large prints than you have that choice. Video quality is excellent. The camera is very compact and I probably don't want anything smaller. This camera allows both sd memory cards in addition to Sony's memorystick which gives you flexibility. If there's a negative it's that the battery now needs to be charged in-camera versus in a stand alone battery charger. You connect the camera with the batter in it via a cable to either your computer's usb port or a wall charger that has a usb connection. Either way the battery has to charge in camera which I find inconvenient. The other negative which is new to this camera is that after clicking a picture there is a delay of 4 seconds for the picture to show up on the screen. A little annoying because you want to be able to take a photo and quickly see the result. Previous Sonys I've had were almost instantaneous in showing the picture on the screen. Still this is recommended because the picture quality is good even using auto settings making this a solid point and shoot. 4 stars out of 5.", "Date": "May 18, 2013"}, {"Title": "this camera is awesome...", "Author": "Terry", "ReviewID": "RRJY2B4XQSZU8", "Overall": "5.0", "Content": "I was using someone else's expensive camera and it was so difficult to use, I couldn't even figure out how to turn off the flash. This camera, is so easy to use, the menu's do not even need the owners manual. I had it figured out within minutes after turning it on. A very good camera for the price!!!! The only important thing is that the camera will only work with up to 8GB SD card. I bought a 16GB and the camera would not recognize it. But even so, with a 8GB at highest resolution, I have 1120 pictures available. Very nice.", "Date": "December 16, 2013"}, {"Title": "A Good Low Cost Camera", "Author": "Thomas Patrick Owens", "ReviewID": "R2OMD7BBNA8BBH", "Overall": "4.0", "Content": "I wanted to have a decsent, low cost camera that was small enough for a small belt carrying case,was easy to use, took good still pictures and could shoot 720 HD video.This camera did exactly what I was looking for.You could, of course, pay more money for an expensive camera with mega more features, but this camera isperfect for travel, vacations, family gatherings, etc. which you can take anywhere you go withoutthe fear of losing big bucks should you accidently damage it.", "Date": "August 27, 2013"}, {"Title": "Sony 16 MP Digital Camera", "Author": "Rich", "ReviewID": "R2Y7S6JFFY3A6Q", "Overall": "4.0", "Content": "This is a great little pocket camera for a quick point and shoot item. I carry it with me almost everywhere and especially on a m/c ride. The pics are clear as long as you keep the little guy steady. An easy to use camera and holds lots of pics for your downloads.", "Date": "July 27, 2013"}, {"Title": "BASIC ENTRY LEVEL CAMERA AT A DECENT PRICE!", "Author": "Haze Blackmon \"TheInsatiableBookReader\"", "ReviewID": "R3P04CXRA5XVIP", "Overall": "4.0", "Content": "No, this camera doesn't have all the bells and whistles of the more expensive cameras but it's not expected to since it is a basic entry level camera. For my needs, it is perfect. I don't really need super high def pics since mostly what I use a camera for is to take pics of items I plan on selling on ebay or maybe uploading some photos of family(pets included) and friends on one of the various and numerous social sites on the ol' interweb. There probably is better entry level cameras out there for the price, but there's so many it's hard to know which is which. What I can say for sure is that this camera gets the job done if your needs are basic and it's easy to use. It took me about 2-3 hours of \"fiddling\" around with it to get the hang of it.I've had it almost 2 days now and have had no issues with it holding a charge. I also like that this is a really thin and sleek looking camera. Stylish I guess you could say. And it seems pretty durable although I don't  plan on dropping it anytime soon ;) The bottom line is this: If your needs are basic, like mine, and you don't want to spend countless hours researching cameras on the net, then do youself a favor and buy this badboy. For the price you won't find one much better or with many more options on it.", "Date": "May 22, 2013"}, {"Title": "Good Camera But Video Did Not Work On My Blu-ray Player Because of File Format", "Author": "scesq \"scesq\"", "ReviewID": "R2ER9VYEFU5Z5X", "Overall": "4.0", "Content": "I like this camera a lot. For a simple to use camera it has a lot of great features. One problem I have though is it won't play video I took with the camera on both my blu-ray players because of the file format of the video.The Bad:My one big issue with this camera is the inability to play video from the camera on either  my Sony or Panasonic blu-ray players because video on this camera is stored in an avi format which is not supported by either of blu-ray players or my tablet.  Also, if you have an older PC that does not support 720p HD the video may not play well on your computer.I called Sony and was also told that while other Sony cameras will allow the video to be stored in multiple formats this one will not. The suggestion I got from Sony to use a third party application to change the video to another format. I bought an SDHC video card to do this.One other minor issue is that it comes with a cable that connects to the camera and has a USB connection at the other end.  This cable is used not only to connect the camera to a computer to transfer photos, but also to connect to an AC adaptor to charge the camera (while the batters is in the camera.)  The AC adaptor is small and could be lost easily. Plus if something happens to the cable you can't charge your camera. I have another camera that has both a battery charger/cable as well as a separate  cable to connect the camera to a computer to transfer photos.The Good:This is a very easy camera to use. I think Sony had the human thumb in mind when designing this camera.  There is a button on the back of the camera that changes the focus from zoom to wide angle, a menu button, a control button and mode button and all are in places where my thumb easily can access them.The Sony software with this camera makes it easy to transfer photos to a computer and edit them. I have tried software from other manufacturers and Sony's is the best by far.The Panoramic Mode button is fun to use. When you get into the mode you see an arrow and boxes on your camera. You then move the camera in the directions of the arrow  (to the right) while pressing down on the shutter button and are told when to stop.  The camera puts the pictures together and the result is a panoramic view.The zoom and wide angle features are easy to use. You just press on a button with your thumb to move the lense.For the most part technical support seems to be above average. I have been critical of other manufactures technical support but Sony's seems a step above.  I called with issues of not being able to watch video from my camera on both of my blu-ray players and on my tablet a couple of times and the agents figured out with a minimal of looking that the video on the camera can only be saved in avi mode. I also called regarding questions about an HDSC memory card and the agents were pretty knowledgeable.I am pleased with the photos.  The camera has features standard to most cameras that allow you to let the camera decide how best to take the picture so if you just want to point and shoot you can.  I have not tried to edit a picture on the camera so I can't comment on this feature.Conclusion:This is a good simple camera with some nice extra features.  It is easy to use with good technical support. I gave it four stars because of the video issue mentioned above.", "Date": "June 19, 2013"}, {"Title": "Great budget camera!", "Author": "Joseph Jenks \"joe\"", "ReviewID": "R26Z1B7UGI9Q47", "Overall": "4.0", "Content": "First and foremost, Amazon shipped fast, arrived on time and in good shape. I have been a lifelong Canon user when it comes to small personal cameras. My Prior three cameras were the Canon Powershot SD110, S410, and then the S11000. All those camera's were great, but I noticed they never last me more than a couple of years (mostly due to the extracted zoom lense locking up upon power on). I decided to try out a cheaper Sony camera for once, and this one fit the bill (about $40 cheaper than a powershot). After using it for a couple of weeks, here are my thoughts.. If your looking for a under $100 camera to throw into your purse or pocket, this is the one. The picture quality is great outdoors (indoors is ok), the video quality is adequate, and the rechargeability is quick. The negatives are of course you need your own memory card. Definitely pick up at least a 16gb card (about $12). The camera doesn't come with a case, but those are like $5. Overall, I recommend this camera to those looking for a cheap alternative to picture taking, or someone who just wants an extra camera as a just in caser.", "Date": "June 2, 2013"}, {"Title": "Great for still photos....", "Author": "No Name", "ReviewID": "R9FH83Z5LAPHL", "Overall": "5.0", "Content": "I bought this for my home inspection business. The flash is awesome. I'm in dark crawl spaces and attics all the time.  However, the camera takes a little while to take the photo. If I was using the camera to take pics of my kids, it would not be acceptable. But, then again, I only paid $78.  The quality of the photos are great and the choice of resolution is helpful too.  For me, this is a great camera.", "Date": "December 13, 2013"}, {"Title": "Good Quality Digicam", "Author": "Israel Garry Anduari", "ReviewID": "R31FSUO9FAHXI9", "Overall": "5.0", "Content": "Both this item on short notice to capture images for a trip in couple of weeks time to Australia.Delivery timing and condition upon delivery - 5 starsPicture quality - 5 starsVideo quality - 4 starsPrice - 5 stars (good quality for what its worth)Does not come with an SD card but for the price, condition and quality, I will recommend it to anyone looking to grab something affordable for short term usage.", "Date": "November 12, 2013"}, {"Title": "Excellent", "Author": "Reinaldo A.", "ReviewID": "R2B7JZOCHFWD3Y", "Overall": "5.0", "Content": "I expected, it's a great camera, the smile capture function is phenomenal, the panoramic photo is great, I recommend this camera so easy to handle, I have to sit down and review it carefully to learn how to get all features", "Date": "September 6, 2013"}, {"Title": "good cam!", "Author": "monique11", "ReviewID": "R3I7RB1UTH4ZGO", "Overall": "4.0", "Content": "this camera is majical in a way out of three of my cameras i see the beauty of this one clean crisp pictures all the features are adjustible no bad reviews is worth it this will satisfy all the needs in a good camers it sure do not come with a card just get one its no problem the menu has a sound for every button and is easy the picture scene is a A+ great for indoor and out door this has a color shot type of camera where you can adjust the color quality i took a photo of myself to test it out and being brown skinned i would suggest you try many diff....great camera a must have!", "Date": "September 3, 2013"}, {"Title": "Just what I wanted.", "Author": "Yes, That is right!", "ReviewID": "RE8YVXEKPBHJR", "Overall": "5.0", "Content": "This camera is just right for me.  Not to hard to figure out.  It takes great pictures.  I am going to like using it a lot.  I like the white color.  I like the automatic focus. I like the zoom.  It is easy to use.  I like it because I can charge it on my computer and  in the wall socket. It also does videos.  I haven't tried that yet.  Also it does panorama pictures.  I still have to try that also.  I really haven't had the camera long enough to tell about all the features.", "Date": "February 28, 2014"}, {"Title": "So far so good!", "Author": "LFK", "ReviewID": "R204TWWB8RRIWS", "Overall": "5.0", "Content": "Took it on a overseas trip and it worked pretty well. The pics are on my computer and look great.", "Date": "January 19, 2014"}, {"Title": "quality camera for an affordable price.", "Author": "Peter J. Scarinzi", "ReviewID": "R277L4N8S1QHKP", "Overall": "5.0", "Content": "Great camera value for the price, high quality pictures easy to use, a true \"pocket camera with long battery life.", "Date": "January 16, 2014"}, {"Title": "I love it", "Author": "SANGSOO PARK", "ReviewID": "R3PPQU00S3Z9J", "Overall": "5.0", "Content": "It is very light and has good resolution so I am enjoying taking pictures outside. Thanks for this good product", "Date": "January 15, 2014"}, {"Title": "Great Camera", "Author": "Esmeralda", "ReviewID": "R15GM5O6T6R5JO", "Overall": "5.0", "Content": "wonderful small camera with great megapixelwork better than any cell phone cameraon marketI would recommend this product", "Date": "January 14, 2014"}, {"Title": "Sony pocket camera DSC-W710", "Author": "Amazon Customer", "ReviewID": "R8B642THDAGS0", "Overall": "5.0", "Content": "Typical Sony quality and value for the money! This one for my wife [ the 4th Sony I've purchased ] has enabled her alone to catch moments during the 2013 Christmas with her 86 year youing mother that are priceless! She is becoming a photo-grabber due to the simplistic features of this little camera - she loves it!", "Date": "December 31, 2013"}, {"Title": "hated this model", "Author": "B. Hoover \"Barb\"", "ReviewID": "R19BG6WQE7ZV87", "Overall": "2.0", "Content": "This model seems so old. Thick in size and LAGS when taking a picture. Press the button to take a picture and wait 10 seconds for the device to actually capture picture. This is the first sony model I did not like. Low quality camera.", "Date": "December 22, 2013"}, {"Title": "Great for the Price", "Author": "Thomas Wolfe", "ReviewID": "R3ME6JIFPYRXL4", "Overall": "4.0", "Content": "Great camera for the price... so far, so good. takes good pictures. easy to use. light and easy pocket sized", "Date": "December 1, 2013"}, {"Title": "excellent", "Author": "beylher", "ReviewID": "ROEBQOS0W40OG", "Overall": "5.0", "Content": "Buy this Sony DSC- W710 / P 16 MP Digital Camera with 2.7-inch LCD ( Pink) . Brand new item, the shipment was free Delivered in Time set, described by the Seller SPECIFICATIONS ... The House has just arrived and left me fascinated, takes crisp photos, and good quality high-resolution image ... bellisima I love this camera ... It is a excellent article, it BECAUSE Buy this House had previously had a Sony son and articles Very good quality ... For Truth met ALL my expectations ... REALLY Low Cost For The Quality of this article is a fantastic camera . The color of the item itself is exactly as the photo looks . Very light and fits in any pocket . Really is A Basic But Excellent Features Camera .... Until resolution 16.1 MP - 5x - Supports Various Types of Memory Cards: Memory Stick ( Pro Duo , Pro -HG Duo , Duo , Micro ), SD , SDHC , microSD, microSDHC , Capture your videos in HD Movie mode 720 . Image and beauty effect portions Stills From More expressive and Videos , Flash Lights Advanced distant subjects for photos Perfect , Take Stunning Pictures in Sweep Panorama Mode Up to 360 - degrees. Brought Rechargeable battery, AC charger , wrist strap and USB cable. It's good for Children and Young People Who para Ÿ want something very portable and easy to use . It was worth making PURCHASE THIS low cost . sent quickly via Amazon . Recommend this camera to those looking to take PHOTOGRAPHS A cheap alternative. This camera really is not very sophisticated but it is easy to use , and loaded into a pocket inexpensive item . The most important thing is to portray those unforgettable moments with our loved ones ... if you are looking for something more professional this article do not recommend it , but you are looking for something simple and inexpensive I recommend it with eyes closed ...This powerful pocket camera makes it very simple to extremely simple and easy to use features. Your 16.1MP sensor offers charming , high-resolution images , while the 5x optical zoom makes capturing close-ups in an instant. You can even edit the images directly from the camera with effects of Beauty - adjust skin tones , remove blemishes, whiten teeth and more. It becomes utterly eye-pleasing portraits .", "Date": "September 24, 2013"}, {"Title": "Perfect.", "Author": "Esteban Guerra", "ReviewID": "R1ZB7X9W6I8MHL", "Overall": "4.0", "Content": "No problems whatsoever. This was bought as a gift for my father and the job is done. Good value for the price", "Date": "August 31, 2013"}, {"Title": "Its handy to use and compact i like it very much", "Author": "Murugappan", "ReviewID": "RN9C5YEGLTBKM", "Overall": "4.0", "Content": "Its handy to use and compact i like it very much and worth for the price spent in choosing the Sony", "Date": "August 31, 2013"}, {"Title": "Can't Get a Better Camera for the Price!", "Author": "Nick", "ReviewID": "R3LNGDQJKOJ9L7", "Overall": "4.0", "Content": "I love this camera.  Before this I had a Canon 300HS that I wanted to love, but indoor pictures of people were almost always blurry and it was not user friendly at all to change settings.  This camera however, is very simple to operate and takes great pictures.I did have some trouble - I had to exchange it two times - the first because the battery that came with it was defective.  The second - the camera's casing was loose so it make a creaky sound when use put pressure on the front while using the buttons in the back. But now that I have a good one (cross my fingers) I'm very happy.The intelligent auto is much better at selecting the proper conditions to make a good picture than my old Canon.  It has just enough features to make it feel like a substantial camera, but not so much that it is overwhelming.  It is very user friendly.  I especially like it because it does all the above while being very lightweight and small - perfect for my pocket.  I like how the view screen is recessed.  My canon's was flush with the back of the camera and thus more easily prone to scratching.The only cons I see are that it's very easily to accidentally turn on the camera such as when putting it in a case.  For some reason the on button is pretty sensitive.  But the buttons have a solid `clicky' feel to them and while the camera housing is plastic, it does not feel cheaply made.  The other issue is a think the battery is not as long-lasting as I wish it was.But all of this for a very reasonable price - I paid $89.99.  You can't get a better camera for that price.", "Date": "August 17, 2013"}, {"Title": "Great camera", "Author": "Alina Victoria", "ReviewID": "RB45ZVKL7BH6S", "Overall": "4.0", "Content": "I wanted something not expensive and easy to carry to take pics on my trip, this camera worked great, easy to use.", "Date": "July 9, 2013"}, {"Title": "Decent camera", "Author": "Adrian McC", "ReviewID": "R39SHSO51Y2MUT", "Overall": "4.0", "Content": "This is my first new camera in maybe 6 or 7 yrs. I love how fast it powers on, returns to being ready after taking a shot and the power saving feature. The battery charge also lasts a while. The one thing I do not like is how easily the memory card/battery over opens. It is not spring loaded like my other camera, so it comes open quite often. Taking panoramic shots is a no brainier and the results are great. The menu for me can be a bit confusing, but I guess the settings are useful once you take he time to see what each one does. The camera is a bit light for my taste, but I'm getting used to the weight. The physical zoom is not as precise as I would like meaning that the zoom moves too fast, so it's a challenge to zoom to exactly where you need.Overall it is a nice camera, but I would like to try another Nikon with comparable or better features and price.", "Date": "June 4, 2013"}, {"Title": "4.5/5 stars...almost perfect budget camera", "Author": "Maek", "ReviewID": "R3CIK06AIAFYHJ", "Overall": "4.0", "Content": "It's becoming a tiring gimmic...\"oodles of megapixels\" camera as a main selling feature.With a sensor that small on a compact digital camera, a 16.1 MP seems to be stretching it...it was a stretch for the Canon EOS 50D that I own which uses an APS-C sized sensor.  With sensors that small, it's hard to get a sharp picture.However, for a budget-priced camera, the Sony does surprisingly well.  Pictures printed up to 8x10 look great and the resolution is quite nice.  Picture colors are pretty well balanced and pictures taken with a flash look pretty good without the \"bleached\" look that some cameras within this price range might otherwise provide.  That said, I wouldn't expect to do any heavy cropping or print to anything larger, but I'm not expecting that people buying a camera at this price range to do anything of that level.Picture speed is average, but I wasn't expecting miracles.  It took 2-3 seconds to go from picture-to-picture with the flash and about 1-2 seconds without.  I was using a Class 10 SDHC card, so the speed of the memory card is definitely not an issue.  However, don't expect to take any rapid sports action shots with the \"continuous frame\" picture mode - it's not built for that.As for the camera build, it \"feels cheap\" with a mostly plastic body, but the light weight actually is a plus.  It's so light that I can't imagine any extended period of picture-taking is going to cause any fatigue at all.The button layout is where I have an issue with the camera that docks it about 1/2 a star for me.  With the Canon Elph series, the zoom toggle is incorporated as a ring around the shutter which makes it easy for one-finger zoom/picture taking operation.  The Sony, however, curiously has zoom buttons on the BACK of the camera in the top right portion.  This makes it a little awkward for me since I find myself having to use my thumb/index finger...it's not as easy for me since I have small hands to begin with and it's an awkward fit for my thumb.  This might not be an issue for you, but it's something that bothered me during testing.The rest of the camera features have the usual cadre of \"special effects\" and picture modes that fit what you're taking (macro, etc.).  However, I found that full auto took care of every situation that I used it for without any visible problems.  One special note that the camera does feature face/smile detection with adjustable degrees of sensitivity if you're into that sort of thing.Overall a great camera!  If you're looking for a decent camera for your kids without the \"you broke what?!?\" pricing or if you're looking for an every day casual picture taking without frills or need to print anything very large, this is a fantastic budget level camera.", "Date": "May 23, 2013"}, {"Title": "Camera makes HORRIBLE noises while recording!", "Author": "Jason Koenig", "ReviewID": "R2U5FI9UUOTHTL", "Overall": "1.0", "Content": "If you want to use a camera for recording video of any kind, do NOT buy this one.It makes annoying noises while recording- noises which show up on all your recordings.I bought this to record music and make instructional videos. Both are impossible with this kind of constant clicking noise on the recordings.This is the second (brand new) Sony camera that has made these noises. I bought the Sony DSC-W620 off of Ebay months ago- makes the same horrible noises when recording.I owned a Sony DSC-W55 camera from 2007 until it died this year. That camera never made any sounds while recording.So I don't understand why Sony is making cameras worse now than before?Anyway I hope this saves someone the trouble of buying this shoddy piece of crap.", "Date": "December 7, 2013"}, {"Title": "Sony Service the worse!", "Author": "A. Cable \"akble\"", "ReviewID": "R1HGPVU5LQP9U9", "Overall": "1.0", "Content": "Bought Sony camera with Protection Plus Extended warranty for 2 years.  CMOS was bad from start and sent in for repair - first they argued whether Manufacturer Warranty or Protection Plus covered it. Then decided out of original Warranty and since the cost of repair- $161 was high so they offered to \"buy back\" my $26 Extended warranty and return camera!  What a joke!  Get Cancer and your insurance company decides treatment is \"too expensive\" and offers to pay your past premiums back to you instead!  Escalated to Sony Customer Relations - what a joke!  They decided before they heard facts that they would not repair - asked them to replace with a refurb they were selling for $90 - less the $26 they returned to me - $64 cost to Sony- No.  Have purchased tens of thousands of $ of Sony over last 40 years - NEVER BUY SONY again - this is not your dad's Sony", "Date": "November 18, 2013"}, {"Title": "Works well for the most part", "Author": "J. R. Amsbaugh", "ReviewID": "R375G17VDPVDB1", "Overall": "4.0", "Content": "I have yet to get the panoramic function to work for me but I don't really need it. I also don't care for the VERY limited video function. Yes, it's not a video camera but I expected to be able to shoot more than a few seconds of video at a time.The battery life is the biggest concern for me. I went to a function and didn't come close to filling my 16GB SD card but went through 2 fully-charged batteries. Fortunately, I had 3. If the event had gone on much longer, I would have missed a lot of photo opportunities.Otherwise, this camera is well worth the $88 I paid for it. The picture quality is excellent.", "Date": "August 1, 2013"}, {"Title": "Great little camera", "Author": "Sabrina Miles", "ReviewID": "R2CZSOUCKXC9M6", "Overall": "5.0", "Content": "Love this camera but I don't use much since I have an i-phone 5.  Good size for trips and hiking.", "Date": "May 14, 2014"}, {"Title": "Good for the price", "Author": "Mohammed A.", "ReviewID": "R34FWW9GL66DTI", "Overall": "4.0", "Content": "Good product for the price.  Not like the higher end cameras but good for average quality pics.  Would recommend it.", "Date": "May 11, 2014"}, {"Title": "Grate gift", "Author": "Juan Gonzalez", "ReviewID": "R38B7YOQ3M57C2", "Overall": "5.0", "Content": "I gave this to my gf for are 1 year she loved it so do i its simple its easy and it takes grate pictures.", "Date": "May 7, 2014"}, {"Title": "easy to use", "Author": "anne \"anne\"", "ReviewID": "R1MK1S7Z79KJHT", "Overall": "3.0", "Content": "I wanted a travel camera I would not be upset to have stolen to replace a similar Sony. There was a worrisome pink tint as I shot. The resultant pics were sharp with good color. Easy point and shoot for basic pics but very limited zoom and low light.", "Date": "April 27, 2014"}, {"Title": "excellent", "Author": "Simon Conde", "ReviewID": "R15N773URTX9QZ", "Overall": "4.0", "Content": "Versatility is a very product, easy to use for all kinds of people and it gives us excellent resolution as well as has a good zoom.", "Date": "April 25, 2014"}, {"Title": "Poor quality pictures", "Author": "Gregory J. Harms", "ReviewID": "R159EQKNXMVVOY", "Overall": "2.0", "Content": "When I bought this, I just wanted a point-and-shoot camera that took better pics than my iPhone 4S (which I don't think takes very good quality pics), since my Canon PowerShot SD850 IS, which took great pics, all the sudden stopped focusing for no reason.  I guess I shouldn't have expected too much of this Sony because of the price, but enough people were saying it took good pics that I went ahead and bought it.  The pictures are definitely not better than my iPhone.  The pics were often blurry, especially if there was any motion going on when I took the pics.  Since I have three children, that's definitely not going to work for me.I suppose I should make the disclaimer that I didn't read the manual, so maybe I needed to use some different settings other than the auto to get better action shots, but after seeing how the pics turned out even when relatively still (and experiencing the poor re-take speed), I just didn't want to take time to go through the manual when I knew this one wasn't going to cut it for me.  I need a camera that takes good pics in auto mode so I can take pics of my kids when the moment strikes and not worry about changing the settings first.The re-take speed is very slow.  My Canon PowerShot is about 6 years old, with less optical zoom and fewer megapixels than this Sony, yet before the recent focusing problem happened, it took FAR superior pictures with a much faster re-take speed. I will not be keeping this camera, and will do further research to find a better one.", "Date": "April 22, 2014"}, {"Title": "Great little camera", "Author": "Laura L Lampe", "ReviewID": "R2ULXWI6OJVQ9B", "Overall": "4.0", "Content": "Great little camera, took a bit of a learning curve to use as enclosed instructions are not very specific and entirely inclusive. One irritant was the fact that the memory card isn't included and had to be ordered separately which rendered the camera useless for about a week after receiving it.", "Date": "April 22, 2014"}, {"Title": "Sony DSC-W710/710", "Author": "Juan", "ReviewID": "R2LT0ZYHRC5JE1", "Overall": "5.0", "Content": "Perfect camera for every situation just in your pocket in the right time. I have the camera that I was looking.", "Date": "April 10, 2014"}, {"Title": "Good, not great", "Author": "Courtney Birst \"Poet. Runner. Writer. Blogger.\"", "ReviewID": "R2THP1R7EYAAUV", "Overall": "4.0", "Content": "I've had this camera for a little over 6 months now. It takes really good pictures, is tiny and lightweight (seriously, it weighs next to nothing) and I can toss it in my bag or slip it into my back pocket and take it anywhere. My biggest complaint is there is often a slight delay when taking a picture, or you'll have to release the shutter button and then press it down again to take the picture. For a point-and-click it offers essentially what I ask of it - ease of use, ease of portability and good battery life. Overall a good little camera that I can take anywhere with me, but I think I want something a little more advanced to supplement it.", "Date": "April 8, 2014"}, {"Title": "Easy to Use", "Author": "Ron P.", "ReviewID": "R2M4G31H77J5G3", "Overall": "5.0", "Content": "Very flexible and easy to use. Does what I need to do when I needed a camera to take quick photos of family", "Date": "April 6, 2014"}, {"Title": "Nice little camera!", "Author": "Laura Gugle", "ReviewID": "R3SI6XKVMI9FTZ", "Overall": "5.0", "Content": "I needed something that would take clear pictures, easy to carry in my purse and simple to use.  I bought this camera, and I got all this and at a great price!", "Date": "April 3, 2014"}, {"Title": "good product", "Author": "william", "ReviewID": "R24TX1TVT466RB", "Overall": "3.0", "Content": "Only serves to make homemade pictures with very poor quality ... but for the price I think is justification. Recommended price", "Date": "March 31, 2014"}, {"Title": "Great Camera For The Money", "Author": "stephen c. hanley", "ReviewID": "R36IXP130X2LJA", "Overall": "5.0", "Content": "I had this model Sony previously and it went with me to Australia, France and Tuscany. It faithfully recorded some of my best journeys and the photos from those trips are some of my most cherished memories. Sadly, it stop functioning after about 6 years and I replaced it with a more advanced model.But that uprated camera (also a Sony) was far more complex and failed after less than a year. So I went back to the original model and am very happy with my decision.This is a good basic camera. It fits easily in any pocket. It is light weight and easy to use. It takes great photos. It can take panorama shots and make videos. It is not the fanciest camera on the market. It is not designed to take photos of landscapes from miles away. What it does is work consistently well for 98% of all my photo needs. It helps me record my passage through life without getting in the way or requiring college level courses to understand.I think it is the best value of all the point and shoot cameras available on Amazon. I recommend it for anyone who doesn't know what an f-stop is and doesn't care to know!", "Date": "March 31, 2014"}, {"Title": "Great little camera", "Author": "lyle miller", "ReviewID": "R3OO1CC7UVCJAD", "Overall": "4.0", "Content": "I lost my last sony camera during a trip to Israel, so I ordered this one.  So far, I am very happy with it with the one exception that it did not come with an instruction booklet, and it is slightly different than my last one, and I have not yet figured out how to change some of the settings, such as shutting off the many icons on the screen at times.  There are so many icons (good in that you know wether flash is on or off,etc.) that at times, they interfear with the picture.  Also, my last sony used a duo pro sd card, while this one uses a standard sd card, meaning my old sd cards do not work in this camera.", "Date": "March 28, 2014"}, {"Title": "Slow", "Author": "oldhomeowner", "ReviewID": "R21UEYHML6KJ3W", "Overall": "1.0", "Content": "If you are looking for a camera that captures a photo three seconds after you hit the button, than this one is for you.  On a positive note, it fits in ones' purse quite easily and is good for randon \"still photos\" of trees or rocks...But a moving person?????  Rots of Ruck!", "Date": "March 25, 2014"}, {"Title": "I love it!", "Author": "Amazon Customer", "ReviewID": "R23423G1OMDP10", "Overall": "5.0", "Content": "This is one of the best cameras I ever had.Is a small and compact camera that definitely worth its price.", "Date": "March 24, 2014"}, {"Title": "nice", "Author": "Soohyun C.", "ReviewID": "R1OOAL1CRDDQCQ", "Overall": "5.0", "Content": "easy to carry and it works as I expected.If you expect high quality camera and picture, you need to reconsider it.But it's definitely better than iphone camera and more lighter.", "Date": "March 24, 2014"}, {"Title": "sony quality", "Author": "baldemar becerra", "ReviewID": "R2B9ATRD13F0PM", "Overall": "5.0", "Content": "buy the camera because it seemed a good price and although it has carl zeiss lens must say that images have very good quality is small and comfortable to wear I love my camera.", "Date": "March 21, 2014"}, {"Title": "nice looking camera", "Author": "Alfred", "ReviewID": "RTGKJOD3R2DOI", "Overall": "5.0", "Content": "thankkkkk you .. this toy was in a good condition thank you again and again agian again ok thanks you. the My last one got broken just for no reason. just suddenly stopped working", "Date": "March 20, 2014"}, {"Title": "sharp images", "Author": "Howell", "ReviewID": "REJYKMWSGOQ31", "Overall": "5.0", "Content": "I like this camera. I have a small online shop and need to have great photos with out breaking the bank. This does the job. it came just as described. I will say seller did not package my product very wisely. Thank god it didn't seem to come damaged. Nice sized screen. Easy to use and charge. This seems like it will last a while compared to other digital cameras i have owned. I am overall happy with it.", "Date": "March 19, 2014"}, {"Title": "Meets My Needs", "Author": "crease", "ReviewID": "R3VIOTNADK33BR", "Overall": "5.0", "Content": "Meets my needs.  Picture quality is good. I just wanted it for use at preschool and around home.  Light weight.", "Date": "March 17, 2014"}, {"Title": "Sweet Little Camera!", "Author": "J. N. Riddle", "ReviewID": "RE9IU8YX7GGH5", "Overall": "5.0", "Content": "I bought this camera primarily to shoot panoramic pictures.  It does a nice job with them; although there is a learning curve that I'm still working through!  It's extremely lightweight, very simple to operate, and while it doesn't have as many bells and whistles as some cameras, works perfectly for what I need.", "Date": "March 15, 2014"}, {"Title": "Very good camera!", "Author": "Christina Stivers", "ReviewID": "R1PB9Z9RJW56E", "Overall": "5.0", "Content": "Very good camera! I was hesitant at first, I wanted to get the same one i had before it broke but it was no longer available anywhere, so after switching back and forth between a few different cameras, I chose this one. It is fun to play with, and takes excellent photos!", "Date": "March 13, 2014"}, {"Title": "sony camera", "Author": "arturo sotelo", "ReviewID": "R32SW23IS6AVDG", "Overall": "1.0", "Content": "take sub standard pictures hate it, i like the fact take you can create folders which i can't do with my other camera", "Date": "March 11, 2014"}, {"Title": "very lightweight", "Author": "Pablo", "ReviewID": "R2PX2G0OQA132D", "Overall": "4.0", "Content": "I like this camera, because in diference to other brand name products, its got a good resolution, zoom its pretty cool, and it works just fine, very quick and the best thing is its not heavy or very wide, its small and its do its job...", "Date": "March 11, 2014"}, {"Title": "Very Good", "Author": "Sabina Granado", "ReviewID": "RI34YJTPDYR6N", "Overall": "5.0", "Content": "Very good product, I recommend it. Excellent quality, as it says the publication. presentation is very good, the price adjusted.", "Date": "March 10, 2014"}, {"Title": "takes getting used to", "Author": "mamster", "ReviewID": "R1IE5BQCWEZN9T", "Overall": "5.0", "Content": "THIS CAMERA IS LIGHTWEIGHT; IT WAS TOUGH TO UNDERSTAND IN THE BEGINNING; THE MORE I USE IT; THE MORE I LIKE IT.  HOPING IT PRINTS CRISP PICS.  I WANTED SOMETHING LIGHT AND EASY TO CARRY IN MY PURSE.", "Date": "March 9, 2014"}, {"Title": "does not auto focus well..", "Author": "jon3001", "ReviewID": "R2SX1EJTLIU5D4", "Overall": "1.0", "Content": "does not auto focus well. too many blurry shots. disappointed in this product.. i have a few high end sony alpha camera and wanted this for vacations so i wouldn't have to lug my photography equipment around.. sadly this won't fit the bill", "Date": "March 6, 2014"}, {"Title": "Dissatified", "Author": "Ellen Freeman Litton", "ReviewID": "R2O0IEWN8IZMC0", "Overall": "1.0", "Content": "It was used once and one of the buttons does not work. It is worthless and I will be selling it on ebay for parts and clearly tell potential buyers that this camara is worthless.Won't buy another Sony.", "Date": "March 1, 2014"}, {"Title": "Full product expectations.", "Author": "Juan Zamorano", "ReviewID": "R139VWDBRI26H3", "Overall": "5.0", "Content": "Excellent product worked well, really recommend is a good productoa an unbeatable price, I am happy for this purchase reallmente if needed would buy another product equal.", "Date": "February 28, 2014"}, {"Title": "just okay", "Author": "Jose A. Sanchez", "ReviewID": "RLAQOVYECNBK", "Overall": "3.0", "Content": "sony cameras have a really good picture and this camera does the job, yet the body of the camera is made of cheap-looking plastic whereas other cameras are made either made with a much better plastic or sometimes aluminum", "Date": "February 14, 2014"}, {"Title": "Great Camera,", "Author": "Cleanbuy", "ReviewID": "R2T01LRWCJ4P5T", "Overall": "5.0", "Content": "Sony has kept its reputation in making this extremely efficient point and shoot camera.The images are very clear,the zoom has a long enough range,Battery life good .Overall great value for money.", "Date": "February 13, 2014"}, {"Title": "Great for the price", "Author": "Marlon", "ReviewID": "R1LTYNLNZ5RYNU", "Overall": "5.0", "Content": "Sony is living up to its name. This is the second one i bought. My sister was so impressed with mine that i bought one for her for Christmas. She is as happy as i am and she just loves the color.", "Date": "February 12, 2014"}, {"Title": "Snapshots of hunting deer and the beautiful woods in Alabama", "Author": "Rev Sally Moon", "ReviewID": "RLFGNQLDSPC5B", "Overall": "5.0", "Content": "I gave this camera to my son-in-law for a Christmas present, and he said it is exactly what he wanted to take with him to makesnapshots of his hunting trips,,,,he is sending pictures to all his friends on line....If he is happy, I am delighted....the productis exactly as advertised, the price was great, and shopping on line at Amazon was so easy,,,,thank you Amazon for usingsuch trusted servers, and thank you for asking for feed back to your customers. J'net", "Date": "February 7, 2014"}, {"Title": "Great product but confused with offer!", "Author": "DK", "ReviewID": "R24HSPBS2VVFFJ", "Overall": "5.0", "Content": "I love the camera it has awesome image is real fast great price but I got confused with the offer I thought it had a free camera bag but any way I was at a great price.", "Date": "January 14, 2014"}, {"Title": "Great camera", "Author": "Addie C.", "ReviewID": "R3Q92XJG10282M", "Overall": "5.0", "Content": "Gave this to my 7year old granddaughter for Christmas. She loved that it was pink! She was also taking pictures within minutes of receiving the gift! It is easy to operate and has some really great features for a small camera. My only negative comment is that it does not come with batteries or a flash card for that price. Otherwise, I would recommend this to anyone looking for a great little camera that takes quality pictures!", "Date": "January 14, 2014"}, {"Title": "Great camera", "Author": "Rosemarie L. Kury \"billy dog\"", "ReviewID": "R2M5UZWOWBWW7V", "Overall": "5.0", "Content": "I'm not a techy person, but this is a wonderful camera for a beginner.  Took some pics when I thought the sun would ruin them but they turned out well.  I'd highly recommend it to anyone!", "Date": "January 14, 2014"}, {"Title": "disappointed.", "Author": "kellie mele", "ReviewID": "R2HIFW7INFI0KF", "Overall": "2.0", "Content": "I guess you get what you pay for, although I expected more from sony. I have had this for about 6 months and it just stopped working.  It was never that great, it often took pictures leaving horizontal pink lines throughout the bottom of the pic.  It does have some fun features (beautifying, kind of like a little instant airbrush to faces) and panoramic. It also takes a long time to process in between each shot.", "Date": "January 13, 2014"}, {"Title": "Just Excellent.", "Author": "neneo", "ReviewID": "RAGXDXDXE8O51", "Overall": "5.0", "Content": "all excellent, product was as described, very good, I recommend it 100%, I do not regret having made ​​the purchase.", "Date": "January 9, 2014"}, {"Title": "Sony DSC-W710/B 16 MP Digital Camera with 2.7-inch LCD (Black)", "Author": "Kathy", "ReviewID": "R2YXIS4CKMZMI1", "Overall": "5.0", "Content": "Love my new camera that replaced my old 8 year old Sony camera.  This one is lighter, thinner, super easy to use, that my 8 year old grandson was using it with ease.  Lots of usage for the holidays.  Great reasonable priced camera as well.  Highly recommend.", "Date": "January 8, 2014"}, {"Title": "Great, low-light camera", "Author": "Mr. Richard A. McKibben \"mckibbr2008\"", "ReviewID": "R1TB6F9VH6XVVQ", "Overall": "5.0", "Content": "Worked well in the Christmas tree lighting. Very easy to use (still learning). Easy to find the menu and correct your picture settings. Nice camera!", "Date": "January 5, 2014"}, {"Title": "dont like it", "Author": "Amazon Buyer", "ReviewID": "R28GLYLFB60PPC", "Overall": "2.0", "Content": "the video bitrate is too low. the audio quality is below 44.1khz. crap stacked on top of crap. sufficient for low quality videos. its no dslr camera thats for sure. im sure its good enough for some people. i decided to return it.", "Date": "January 5, 2014"}, {"Title": "Very easy point and shoot", "Author": "brittney", "ReviewID": "RLO2QMYESAKAB", "Overall": "5.0", "Content": "Love this camera looks and acts brand newEasy great point and shoot sleek design.Very happy with my purchase got here within a few days.", "Date": "January 4, 2014"}, {"Title": "Sony DSC-W710/P 16 MP Digital Camera", "Author": "Emil Ramirez", "ReviewID": "R2RZ0B7JN3U5PM", "Overall": "5.0", "Content": "Excellent camera, very practical, it is recommended to buy your protective case and 4gb sd memory, stylish, comfortable and stylish.", "Date": "December 19, 2013"}, {"Title": "Very good.", "Author": "Eddy", "ReviewID": "R1G9TSLXV30LQP", "Overall": "5.0", "Content": "good product, I recommend it works very well. The display does not show the reality of the photo and why you think it's no good image quality but make prints on paper or see the images on my computer and it looks good image quality. In general terms and for such a good price is very good camera.", "Date": "December 13, 2013"}, {"Title": "Soiny DSC-W7 16 MP Digital Camera with 2.7 inch LCD", "Author": "Kevin J Clifford", "ReviewID": "R3LIFUVMDC52ET", "Overall": "5.0", "Content": "This is my wife's first digital camera and this version doesn't have all the bells and whistles that some of the rest have. Knowing this I decided that this was a good one for her to start out with. So far she loves it and the transition from her old one to this camera is easy and she has no fear of using it. Now it's fun watching her experiment with it.", "Date": "December 12, 2013"}, {"Title": "Excellent", "Author": "ROBERTO", "ReviewID": "R32VEOQKNCPM7C", "Overall": "5.0", "Content": "Excellent Camera, recommended for beginners takes very good pictures and the operation is easy, it is very light and very easy to transport, delivery was agreed", "Date": "November 28, 2013"}, {"Title": "VERY COMPACT AND LIGHT", "Author": "Iraima Perez", "ReviewID": "R34M8CQO6NWEAB", "Overall": "5.0", "Content": "This little Sony camera is very compact and light, and is a good starter point and shoot at this price", "Date": "November 13, 2013"}, {"Title": "smile for the camera", "Author": "summer", "ReviewID": "R13M6ZP4YVF3EW", "Overall": "5.0", "Content": "I cant seem to stop taking pics with my new camera that i jus brought  (*)̷̸̷̸̐̐Great(*)̷̸̷̸̐̐  quality ,easy to use and professional shots all taken by me .", "Date": "November 12, 2013"}, {"Title": "new product", "Author": "joselnar_n", "ReviewID": "R32NA2RXHMCN1U", "Overall": "5.0", "Content": "I liked the price and model, because I get the qualification according to the detailed in the publication, recommended to buy this excellent product.", "Date": "November 6, 2013"}, {"Title": "Good point and shoot camera", "Author": "Amazon Customer", "ReviewID": "R1B1ZAYEPDP01L", "Overall": "5.0", "Content": "This is a good and affordable point and shoot camera.  The zoom on it will force you to use your feet.  You will have to zoom with your feet.  It is a very light weight camera.  Once I was able to get close enough to my subject, I was extremely satisfied with the quality of the image.  I don't like the camera on my cell phone so I use this camera more than my phone.  Be careful not to drop it while you're shooting.  The lens is very fragile.  It would be wise to buy the warranty!  I dropped it after a week of use.  The warranty allowed me to ship the broken one in for a newer one.", "Date": "November 4, 2013"}, {"Title": "my birthday gift from my honey", "Author": "sandra murrell-slepion", "ReviewID": "R212UTH7PX1PT3", "Overall": "5.0", "Content": "Had an older model and loved it. wanted to upgrade. love the new one. it takes great photos and is easy to use", "Date": "November 3, 2013"}, {"Title": "Excellent", "Author": "VE-297060 Elio Aponte", "ReviewID": "RE4ZIRHWWZOQ8", "Overall": "5.0", "Content": "Excelllent product, i have never saw a camera like that, i like very much and the box it came was a perfect size", "Date": "October 26, 2013"}, {"Title": "Gift for my grand daughter", "Author": "Eric", "ReviewID": "R1Q8PAR88TIZ6B", "Overall": "5.0", "Content": "She loves it. Can't get that thing out of her hands. It's compact, sleek and her favorite color. And so it goes.", "Date": "October 17, 2013"}, {"Title": "sony dsc-w710 16 mp dig camera", "Author": "kid  bella", "ReviewID": "R1NF79G14V3L4W", "Overall": "5.0", "Content": "i just started useing it ,but so far i like it very much.because of another dig camera i had ,i recomendthe 2 year accident plan.", "Date": "October 14, 2013"}, {"Title": "Excellent", "Author": "Kelvin Dorsey", "ReviewID": "R2JKU7Z5FIJVSW", "Overall": "5.0", "Content": "This was a birthday grift for my sister.  It was one of her favorite gift she received and it was delivered on time and in excellent packaging.", "Date": "October 8, 2013"}, {"Title": "Nice camera!", "Author": "Ellie Blasco", "ReviewID": "R3936AWODRQY0Q", "Overall": "5.0", "Content": "Basic enough but creative to use for photo taking, easy to apply menu, includes PC hookup to transfer your pictures. I just wish my cam had included the mem card. Slim shape. Sony is my most bought camera, very durable.", "Date": "October 8, 2013"}, {"Title": "Nice", "Author": "elianasantos", "ReviewID": "R3DJBJKVWO2KD1", "Overall": "5.0", "Content": "Practical, smallGood to every situation.Nice cameraI recommend and  It's satisfactory .Don't worry, buy and enjoy this product.", "Date": "August 29, 2013"}, {"Title": "very nice i enjoy using thank you", "Author": "Christopher pollak", "ReviewID": "RRL93O7MOFPLN", "Overall": "5.0", "Content": "thank you for the great service the compact size of the camera and quality of the picture is outstanding a very fine product", "Date": "August 14, 2013"}, {"Title": "Love it. Love Sony.", "Author": "Heath Stevens", "ReviewID": "RKP9QV3AKGQ8H", "Overall": "5.0", "Content": "Great little digital camera. I know that there are better camera's out there, with more functions and features and higher MP and higher zoom. But I just needed a good quality and great priced digital camera. And you can shoot 720 HD video with it too. And the best thing is that I have a Playstation 3, I can download the pics and video to my PS3 and crop and fix the pics and also edit them into a slideshow, a slideshow that you can add music to. And I can also edit the video I take with it. I'm going to use this Sony digital camera and my PS3 to shoot and edit a video entry for the MoFilm  Playstation Blogger Contest.", "Date": "August 8, 2013"}, {"Title": "Colorful!", "Author": "Carrumba", "ReviewID": "R3HXJZ1P2727Y2", "Overall": "5.0", "Content": "Great amount of features, accurate shooting, easy instructions and awfully small. If you buy this camera for a child, be aware that the camera is DELICATE. One slip and you'll be in the market for another. It's got more features than you need (taking pictures has become some kind of spy training event now). If you want to capture some smiles, a few objects and remembrances, buy this item. If you're Photo Joe, save your shekels and get something that won't fit in your pocket. Good shipping, everything shiny new.", "Date": "August 5, 2013"}, {"Title": "Amazing Point and Shoot", "Author": "Kenso", "ReviewID": "RCL0ZKI8PC65A", "Overall": "5.0", "Content": "For a stock 'point and shoot', this is an amazing camera.  It has outstanding focus and takes wonderful pictures.  My only, albeit VERY mild, concern is that it's a bit dainty.  Feels very light and fragile.", "Date": "July 24, 2013"}, {"Title": "Moms camera", "Author": "picture goat", "ReviewID": "R11V3NQJ9NB97P", "Overall": "5.0", "Content": "This camera was brought as gift for my wife on her birthday. She thinks the camera is great and is very easy to carry around.", "Date": "July 20, 2013"}, {"Title": "ITS SO CUTE!", "Author": "DIVA MO", "ReviewID": "R232TCPKFEAXXJ", "Overall": "5.0", "Content": "I just love it! Takes great pic's, and the app for fixing mistakes is wonderful, not bad for the price at all.", "Date": "July 1, 2013"}, {"Title": "Excellent Camera! Recommended 5 stars", "Author": "Jhonny Sierra", "ReviewID": "R18M51YQPUJHVK", "Overall": "5.0", "Content": "Excellent Camera, practical and easy to carry! Useful and simple, it adapts to the needs of those who want to take quality pictures to remember the good times!", "Date": "July 1, 2013"}, {"Title": "In Re; Digital camera", "Author": "N. Coyle \"codybob42\"", "ReviewID": "R38ORF3H8X6O9Q", "Overall": "5.0", "Content": "I have already written  a review for the transaction. I was well satisfied and I cann not keep writing reviews for my purchases. One should be enough", "Date": "June 30, 2013"}, {"Title": "Handy little camera", "Author": "lil \"lil\"", "ReviewID": "R11EYSIALM14UX", "Overall": "4.0", "Content": "This is a nice little entry-level camera with a handful of effects. The menu is simple and easy to navigate.I have yet to try out every special effect but so far what the kids have tried they have had fun with and they create fun videos on this all the time.Right out of the box it was easy to use just charge the battery and put in your SD cardI wish that Santa would have bought this camera instead of the Kodaks he put under the tree last year.This one takes nice clear photos and they are sharp enough for sharing with family and friends in emails and online.I love how thin and small this camera is easy to toss it in a pocket and head out the door with it never know when we are going to need a photo throughout the days activities.Though i have many cameras both high and low end i still like to have one of these small point and shoots to take with daily just in case.", "Date": "June 25, 2013"}, {"Title": "Good Camera, Great Value - Recommended", "Author": "C. Hill \"CFH\"", "ReviewID": "RR8H0Y78EJAD8", "Overall": "4.0", "Content": "This Sony DSC-W710/B Digital Camera is very compact, takes good quality photos, has a lot of features, and is a very good overall value for what you get. We are a photography hobbyist family and have quite a few digital cameras, ranging from point and shoot to dSLRs, and use them almost daily for fun and in our business taking product pictures. We also teach a photography class for small business owners and this camera is easy to recommend to our students on a budget. Here are my observations:Pros -+ Size; this is a very small camera but controls remain easy to use+ Features; this has a lot of advanced features that are easy to use (SteadyShot, Face Detection, Smile Shutter, Panorama, and Video), and even more buried in the menus (see \"Cons\" below\")+ Picture Quality; quite good in just about every shooting situation+ Memory Card; uses standard SD cards (I tested it with a 16g Class 10)+ Value; a fairly inexpensive but feature rich cameraCons -- Menus; some of the best effects (Color Pop, etc) are buried deep in the menu system of the camera and can take a awhile to bring up- Battery; charging is done in camera (battery is removable) and does not include an external chargerOverall, this is a great starter camera that is fairly easy to use and takes decent quality pictures.Recommended!CFH", "Date": "June 22, 2013"}, {"Title": "Good, low-cost camera", "Author": "Footprints", "ReviewID": "R24YC47YT9VK0", "Overall": "4.0", "Content": "This is a small, lightweight camera, which is important to me for traveling (I'm a one-bag traveler). It starts up fast, ready to take a picture in just a couple of seconds, and automatically changes into the appropriate picture mode for the situation. For example, when I took a picture of my yard, it switched automatically to landscape mode. When I took a picture of a flower, or something close up, it would switch to macro mode, preventing the picture from becoming blurry. It automatically recognizes faces, and the user can even set it to take a picture automatically when it detects a smile. It also takes panoramic photos.It has video capability as well, which I found to be okay, but the audio capture isn't the best (but good for the price). It has a 5x optical zoom, but I avoid using it all the way zoomed in because the picture gets darker. (I think it's due to the limited amount of light that is let into the lens at that point.) It comes with a rechargeable, replaceable battery.Although this camera has a cheap feel to it, I've found it to be a great point and shoot camera, especially for the price.", "Date": "June 20, 2013"}, {"Title": "Great, Affordable Entry Level Camera!", "Author": "P. Colin McGraw \"AV, Computer & EnviroTech Nut\"", "ReviewID": "R3O3M0GI4FXME5", "Overall": "4.0", "Content": "For being less than a Benjamin, this is a pretty fantastic camera!Other point-and-shoot cameras I've used in the past had some of the bells and whistles this camera advertises as far as effects and panorama shots, but this camera makes it truly easy! Panorama mode is via a switch, not some tucked-away option in some menu, and the interface is generally intuitive.The image quality is also strong, but while the camera advertises its advanced flash, I found the low light (without a flash) performance to be fairly poor (my iPhone 5 took better low-light shots).It also feels a little toyish, with lightweight components and plastic casing, but it really is a strong performer, nonetheless, and an easy win at this price point.", "Date": "June 19, 2013"}, {"Title": "wonderful", "Author": "Christina A.", "ReviewID": "ROTKCQLL5XT2Q", "Overall": "5.0", "Content": "Love the auto features pictures are nice and clear. Zoom in and out are great as well. Nice and compact", "Date": "June 17, 2013"}, {"Title": "cute and versitile", "Author": "Tina Hunt \"tiny tina tiki\"", "ReviewID": "R3OUA3HDKWW5R0", "Overall": "5.0", "Content": "I was looking for a small light weight digital camera with features and the right price point. This camera has it all, wide angle, zoom, panorama, and video. I am very happy and highly recommend this Sony.", "Date": "June 17, 2013"}, {"Title": "great product g", "Author": "Melvin E.", "ReviewID": "RP5U7QJ1BDJBF", "Overall": "5.0", "Content": "Great product. Bought mom older model a few years back. Easy to use! She loves it! Quality of photos is great.", "Date": "June 16, 2013"}, {"Title": "Great camera!", "Author": "W. Contreras", "ReviewID": "RCY3V78FA2JDP", "Overall": "5.0", "Content": "I bought this camera as a gift for my aunt and she loves it!  It's a great camera and I truly recommend it!", "Date": "June 14, 2013"}, {"Title": "Quality Matches The Price!", "Author": "Othm@nitO", "ReviewID": "R2SQ4LUD3OGCJU", "Overall": "5.0", "Content": "I like this camera. It is what I have expected and I does what it says! Good timing shipping. It would be nice if SD-Card or Carrying Case were included!", "Date": "June 14, 2013"}, {"Title": "This was a gift for a friend", "Author": "Sarah Thomas", "ReviewID": "R1ZYI0QLRLC8GV", "Overall": "5.0", "Content": "Got this for a friend and she tells me that she loves it! Great for pictures of the kids. Clear images. easy to use.", "Date": "June 12, 2013"}, {"Title": "Nice for the Price", "Author": "Jenna of the Jungle", "ReviewID": "R1ZCZ4Q4IIK59F", "Overall": "4.0", "Content": "Let me be clear up front: despite that I'm giving this a four-star review, this is not a great camera. It is, however, good for its price and very good in certain areas.My point of comparison is the Canon PowerShot SD780 IS Digital Elph... that's my current regular point-and-shoot camera, and it's excellent. However, its three times the price of this camera.So let me tell you what this camera does well, and what it doesn't do well:GOOD-It takes very nice outdoor shots.-Video quality is reasonably good. It's not perfectly sharp, but if you're looking to take video clips for YouTube, Facebook, etc., then you'll do just fine with this.-Intuitive design.-Very lightweight and thin, easy to carry around.-Some indoor shots come out well... if the subject is standing still and the lighting is good.-A nice \"my first real camera\" for kids-- much better photo quality than the kiddie cameras on the market, and not as expensive as comparable regular cameras. Great if you have a kiddo who's interested in taking nature photos.MEDIOCRE-Despite that I see other reviewers complaining about this, I wasn't particularly bothered by the time between shots. Yes, you have to wait a few seconds, but that's how it is with all the point-and-shoots I've owned.-I can't imagine why you'd ever want to \"widen someone's eyes\" or perform other odd editing tasks on the low-res little camera screen.BAD-It doesn't handle motion well. I tried to take several indoor photos of my 6-year-old daughter, who, like many 6-year-olds, doesn't stand still particularly well. My PowerShot can handle that; this camera pretty much threw its arms in the air and ran around in circles screaming, \"I HAVE NO IDEA WHAT TO DO!\" My daughter is a blurry streak in every photo. So I wouldn't choose this on purpose if your main goal is to take indoor pics of young kids.-The flash mostly lights people up like their faces are made of Christmas lights. It was extremely difficult to get a decent indoor portrait at close ranges. When people stood back and stayed very still, I could usually get a good enough shot.-It doesn't come with a memory card, so you'll need to buy one right away. However, you can take just two or three photos using the camera's internal memory, which is pretty cool in case you're ever without a memory card and need to get one \"can't miss\" shot.-There's no separate battery charger-- you have to plug the whole camera in to charge it. That't not a huge deal except that it means you can't have a backup battery. I constantly rotate my batteries in my PowerShot... one's in the camera and one's on the charger at all times. I wish I could do that with this camera.**All in all, I'd consider this a good pick as an entry-level camera for people on a budget, or those who want a camera just for outdoor shots (maybe to take along on vacation or day trips). Just know that there will be limitations at this price range.", "Date": "May 29, 2013"}, {"Title": "Poor indoor pic quality with flash/Great outdoor pics", "Author": "Sl Judge \"gatormomz\"", "ReviewID": "R1LY1N8XW6IW4H", "Overall": "4.0", "Content": "I have owned several cameras in my day and I have owned previous versions of the Sony Cybershot before.  The Sony DSC-W710/B 16MP Digital camera comes with handy strap and rechargeable battery. It does not come with an SD Memory Card, so be sure to get one at the same time you make your purchase.  My first impression was that the camera was very light in its plastic body.  I was instantly disappointed there. A first impression I a lasting impression.  I took a handful of pictures straight of the box with automatic settings.  I have uploaded the pictures for your review. As you can see, it takes a great outdoor picture on a sunny day, but the indoor pictures are lacking in quality.  I don't dislike the camera, but I'm not in love with it either.  It is easy to use and a great camera for a beginner. I am on the fence as to give this a three or four star review.  I am leaning towards a three star, but I also think I am a camera snob, so I have gone with the four.", "Date": "May 23, 2013"}, {"Title": "great camera great price", "Author": "jbdvill", "ReviewID": "RW5LB571BCL72", "Overall": "5.0", "Content": "My wife was needing a new camera so I got her this one and she loves it. Easy to use and it takes great pictures.  You will be happy if you get this camera.", "Date": "May 22, 2013"}, {"Title": "Good camera for the price - pocketsized with many functions", "Author": "Nitty's Mom \"Dog lover\"", "ReviewID": "RCCBCCVIPI6EP", "Overall": "4.0", "Content": "I am not a camera expert, but a competent amateur.  The Sony DSC-W710/B is a very compact, credit card size camera with a respectable 16 megapixel sensor and a 5X zoom.  It's 2.7\" LCD screen is very clear and bright, as I was able to see in bright sunlight with no problem.  The menu is simple with an AUTO setting, which will select the best scene mode for the shot you are taking.  The speed between when you push the button to take a picture and when the camera is ready to take another picture is a bit slow, about 4 seconds.  There is a continuous mode setting which allows you to take multiple exposures by just keeping the shutter button down.  I also tested the video setting and it yielding very smooth, clear HD video with sound recording and zoom capabilities.I loaded an 8gb SD card allowing some 1,100 plus images available using the full 16mp setting, which can be lowered to yield even more exposures.The startup from out of the box took about 3 minutes and it was ready to go.  I have several digital cameras and this little, pocket-sized camera certainly has it's place.  If you need a simple camera for a trip or event, and want a camera for under $100, this may be a good bet. I am giving it 4 stars for what it is, an inexpensive, versatile video and still camera which will take better pictures than your I-Phone or Android phone, and it's actually smaller and lighter than a phone. I didn't give it 5 stars because I felt the image quality wasn't 5 star.", "Date": "May 22, 2013"}, {"Title": "A Point-and-Shoot That Excels in its Price Range", "Author": "Debbie Lee Wesselmann", "ReviewID": "R2TDA7NYQ98DBL", "Overall": "5.0", "Content": "The Sony Cybershot W710 is a perfect example of how the entry-level camera market has evolved to include some advanced features in an inexpensive housing. You can tell just by holding it that this is not one of Sony's better cameras; it has a lightweight plastic housing, and it lacks the sleekness of models that cost even a little bit more. I would even say that it looks and feels clunky. But it creates 16 megapixel images, has an easy-to-see 2.7 inch LCD screen, panorama capabilities, and enough settings to satisfy a casual snapshot user. Best of all, the Intelligent Auto is remarkably good and accurate. It quickly senses changing circumstances to calibrate the correct settings. For instance, if I take a photo of a room, then point it at a close object, the camera quickly switches to macro to be able to focus. My other entry level cameras (Olympus and Nikon, both a couple of years old) cannot handle macro focusing at all, and their auto modes are not nearly as agile and complete. The Sony detects a backlit subject and adjusts with a flash or an exposure change (depending on the amount of backlighting); the other two leave the foreground subject in darkness. I was amazed by the changes -- from portrait to landscape to night shot -- this camera senses and adjusts to in a matter of seconds.The photo quality is good. The write-time to the memory card is decent for the price point, a few seconds between shots. Using the flash, you have about 5-6 seconds in between shots while the flash recharges The continuous mode (good for catching moving subjects, although focusing can be an issue) will shorten the time period between shots (it's still not rapid fire, though), but it takes much longer to write to the memory card.The 5x optical zoom is adequate, although not surprisingly the lens doesn't let in enough light to make its use practical in dim conditions; the results are too grainy. For my own purposes, I prefer a minimum of 8x zoom for versatility when framing scenic landscapes, although if you take mostly snapshots of people, 5x zoom is probably enough. The camera also a video mode activated by a switch and a self-timer.The one huge drawback I've found is the flash: it seems to go off a split second before the image is captured, and that results in a lot of half-closed and closed eyes. I could not find a red-eye setting, so this split second may be Sony's attempt to build it into a single flash. If so, the result is disappointing.The camera comes with a rechargeable LiOn battery (good for about 200 or so shots), a USB cable, a wrist strap, and a wall charger. A memory card is not included. In addition to buying an SDHC card, you might want to purchase a spare battery.For a relatively inexpensive camera, this Sony performs well, especially for its price point. Will you get better photos and features if you bump up to a higher price? Absolutely. Among compact point-and-shoots, I prefer the even smaller but better constructed Sony Cyber-shot DSC-WX70 16.2 MP Digital Camera with 5x Optical Zoom and 3.0-inch LCD (Silver) (2012 Model) for just a little bit more; it has the same zoom and megapixels but in a sleek, metal case. This Sony is best for people who don't want to fuss with settings and who are looking for a relatively inexpensive but capable camera.-- Debbie Lee Wesselmann", "Date": "May 21, 2013"}, {"Title": "Bad, Bad Camera", "Author": "VPD \"Sketcher\"", "ReviewID": "RD50TOEXCQ89Q", "Overall": "1.0", "Content": "Bad, Bad Camera! lousy battery life, crummy focus and limited settings….. save your money..Previous Sony was great this camera a throw away", "Date": "November 18, 2013"}, {"Title": "Junk", "Author": "scott burnett", "ReviewID": "R3QGVNJIJAV0BC", "Overall": "1.0", "Content": "Unfortunately I can't give it 0 stars....I have now gone through 2 of these cameras in just under 2 months. both worked fine at first, but after about 2 weeks of use ( less than 100 pic ) both just flat out quit working. The first wouldn't power on one day, nothing I tried helped. The second started acting up yesterday while out of town at a car show. It would power up but wouldn't take a pic, no functions worked. A few minutes later ( after pulling and replacing the battery, it powered up and worked fine. A while later it turned on and wouldn't take a pic, this time it wouldn't turn off. I ended up taking pic with my cell phone the rest of the day.Charged it last night just to make certain the battery was full. this morning it sits here, with the lens extended, and won't power on. I have removed and reinstalled the battery twice this a.m. to no avail. Today I will take my big Cannon like I should have yesterday. Stay away form these P.O.S. cameras. This saddens me because my last cybershot lasted 12 years, then I went through a Nikon pocket cam in a year, and a cheapo Cannon pocket in a about a year. FWIW this camera FEELS like a pile of crap compared to my old Cybershot as well.Cheap plastic crap. I have to have a pocket camera for my work, so I'm not sure what to do at this point. The 3 major brands makes have let me down, but at least the Nikon and Cannon lasted a year, as opposed to the Sony that made it less than 2 weeks each time", "Date": "March 8, 2014"}, {"Title": "Not what expected from Sony", "Author": "SOLO", "ReviewID": "R1NPPQNUJC846", "Overall": "1.0", "Content": "I have been buying Sony camera's for years in fact this is my third Sony camera in the last five years all with that I had no problem with. I wanted a cheap camera for a trip to Thailand so I figured this was sufficient. The picture quality was average nothing amazing but the biggest shock was that this camera lasted only one month. I get a error message on the screen every time I turn it on now. Don't buy this camera.", "Date": "December 31, 2013"}, {"Title": "Camera Freezes", "Author": "Julie D. Velarde \"JDawn\"", "ReviewID": "R2ELNP84FOHUBG", "Overall": "2.0", "Content": "Camera keeps freezing and won't power on or off, lense does not retract. Have to remove the battery to fix. When taking pictures sometimes a portion of the display screen goes black.", "Date": "October 24, 2013"}, {"Title": "camera that does many things", "Author": "Pol", "ReviewID": "RPUTGYFGMDQ4H", "Overall": "4.0", "Content": "I am not real savvy on lot of things this camera will do but know it takes a great pic when I am out there wanting to capture the moment...I trust the name of Sony is why I bought.", "Date": "June 30, 2013"}, {"Title": "A nice option to carry around if your phone is full...", "Author": "Thomas Duff \"Duffbert\"", "ReviewID": "R3NR8607IGMCFG", "Overall": "4.0", "Content": "It's been awhile since I've played with a \"new\" camera. Amazon Vine provided the Sony DSC-W710/B 16 MP Digital Camera to try out. Overall, it's a good basic point-and-shoot at a reasonable price point.To be honest, I made my first mistake when it came to the battery. I put it in, but I couldn't get the camera to start up. I was convinced it was defective until I realized I had put it in upside down (contacts were to the left instead of the right). Once I figured that out (d'oh!), I was off and running.The Sony offers a large array of shooting options and special effect modes. The menu function is relatively easy to traverse, but you really need to take some time to check out each one so you know what can and can't be done. I question how useful some of them would be, as they wouldn't be options you could quickly set in order to capture a dynamically changing subject. For instance, the color saturation effect was fun (set one of four colors to appear, and the rest turn to black and white), but you'd have to think about the shot beforehand to make it work. It's most likely that you'll keep it in fully automatic mode and just click away.Probably the one thing that you *have* to be aware of when you get this is that there is virtually no memory built into the camera. Depending on the setting, you can get around four pictures with no SD/micro SD card. Basically, you have to plan that into your purchase at the same time you buy the camera (unless you already have a few lying around). It was somewhat like getting a new toy at Christmas but your parents forgot to buy batteries...Overall, I'm pretty happy with it. It's light enough to pack around on trips, and it does provide a few more options than I would have if I were only using my iPhone. And at this price, I'm not crushed if something happens to it.Disclosure:Obtained From: Amazon Vine Review ProgramPayment: Free", "Date": "June 8, 2013"}, {"Title": "You get what you pay for", "Author": "J. Evans", "ReviewID": "R3VOU82V05R2L3", "Overall": "4.0", "Content": "I would recommend this camera to someone who does not have a great camera phone. A parent, grand parents, or younger kid(maybe 13 or under?) The zoom is not great. 5x is the lowest anyone would want to go. it will let you make a group of people 10 yards away, fit the pic better. but do not expect to be zooming in on someone 20 yards away and expecting them to come out fitting the screen size. it would be great to take on vacation, when you don't have your camera phone with you. as nearly every other review has stated, this is an entry level digital camera at a fair price. it can do panoramic shots which is fun and it is simple to use. the setup process was very easy. it goes through a short tutorial to get you started. i have included two sets of photos, which show you a regular shot, then one at the highest zoom, so you can really see how well(unwell?) the zoom works. the included strap is mediocre. it does not have a cinch that allows the strap to hold onto your wrist tightly. instead if hangs loosely. all cameras should come with those, but unfortunately most don't. i also find it annoying that it uses a micro usb adapter, rather than your typical usb adapter, which i have also included a picture of. most of my devices use the regular sized one, while this one is smaller. only annoying to those who want the least amount of cords possible hanging off their computers. make sure to check out the pics ive included.", "Date": "June 4, 2013"}, {"Title": "Exelent product", "Author": "Gregory", "ReviewID": "R2ZQUAQU47QOOF", "Overall": "5.0", "Content": "Sony is Sony, good resolution, good product very thin, very good pictures, good videos with good sound in recording, very satisfied with purchase", "Date": "April 21, 2013"}, {"Title": "Small Light Economical", "Author": "R From Escalon", "ReviewID": "R2WLE7TJ9NBXOJ", "Overall": "5.0", "Content": "This is my new go to camera. Easy to pack away, and remarkably high quality of pictures! Great lens and features.", "Date": "April 5, 2013"}, {"Title": "Sony DSC-W710 16 MP Digital Camera with 2.7-Inch LCD (Silver)", "Author": "William R.", "ReviewID": "RTOANDKX9MXDN", "Overall": "5.0", "Content": "Sony DSC-W710 16 MP Digital Camera with 2.7-Inch LCD (Silver)camera is a great valve, replaced the previous camera of same model number,  takes great photos and videos", "Date": "February 5, 2014"}, {"Title": "good little camera", "Author": "fredrick b zierlein", "ReviewID": "R15KFX292HTZXC", "Overall": "3.0", "Content": "camera performs well and downloads to my pc just fine and is only device required since computer recharges it when on usb", "Date": "February 1, 2014"}, {"Title": "Just Excellent", "Author": "VictorSP", "ReviewID": "R3NCM7U6WVGQ9Q", "Overall": "5.0", "Content": "This Camera it's excellent, it's inexpensive, have a nice design and take beautiful pics, and have one of the best brands of camera which is Sony, I really recommended.", "Date": "January 30, 2014"}, {"Title": "its nice", "Author": "Amrita Singh", "ReviewID": "R167LJ01TBDTTP", "Overall": "4.0", "Content": "it is a  good choice, just  if you want a simple one and easy to use... i recomend it.... :-)", "Date": "January 29, 2014"}, {"Title": "Yeah :)", "Author": "Cynthia", "ReviewID": "RSQRY6D6JE3RL", "Overall": "5.0", "Content": "Excellent product , and pink : ) the quality is cool for the size of the camera , 16 MP of hapinnes xD", "Date": "January 29, 2014"}, {"Title": "Excellent.", "Author": "Nelcy Padilla", "ReviewID": "RBHCIIFKS4SJG", "Overall": "5.0", "Content": "It captures beautiful photos, his resolution is excellent and equal for the videos. I did a good choice. Thank you!", "Date": "January 27, 2014"}, {"Title": "Simple to operate.  Love it", "Author": "Bruce E. Chenoweth", "ReviewID": "R1AH2QPK00MDMS", "Overall": "5.0", "Content": "Simple to operate.  High quality photos.  Panarama feature is great.  I don't like rules given to me for something requiring my voluntary time.", "Date": "January 19, 2014"}, {"Title": "This camera is sleek, slim and well-priced for the great quality", "Author": "Blaze \"Blaze Of Solitude\"", "ReviewID": "R3PGSY5LPR86ER", "Overall": "5.0", "Content": "Takes very clear, crisp photos. Has an option to be set-up with lots of settings (similar to most digitals out there), or to be set-up as an Easy-use- for the people in your life who do better with less options.I bought this as a Christmas gift for my partner. But after helping her set it up, and seeing the result of the images that came from it, I fully intend on buying one of these for myself (since I happen to be in the market for a new digital camera)!Oh- and she only took a very small clip of a video- but the clarity and crispness of that was quite impressive as well!This camera is sleek, slim and well-priced for the great quality. I very much recommend it.It was also delivered well before its estimated arrival date- which is always a bonus!", "Date": "December 29, 2013"}, {"Title": "So disappointed.", "Author": "Judith A. Williams", "ReviewID": "ROFXBVE3UL0V2", "Overall": "2.0", "Content": "I let the fancy packaging draw me to this camera, and I'm so disappointed with my purchase.  The time it takes to see your photo in the screen is ridiculous, and all the photos are fuzzy.  Can't blame it on user error as many others have used the camera.  Everything is fuzzy.  My priceless photos are down the drain.  Next time I'll be more careful, and for now, I'm going back to my old camera.", "Date": "December 24, 2013"}, {"Title": "Loved it but still need to be tested more features", "Author": "Akash Patel", "ReviewID": "RG8WHBXXJA2LL", "Overall": "5.0", "Content": "Actually I don't know how it will be.one of my friend ask me to order for him so I ordered the product and he is satisfied with the product and didn't want to comment anything right now as he didn't used much and only clicked couple of pics.", "Date": "August 15, 2013"}, {"Title": "Decent value", "Author": "Shawn P. Rose, Sr.", "ReviewID": "R2UJBG3LYQHBJH", "Overall": "4.0", "Content": "This is not a \"high end\" camera. but it's a GREAT camera for the price. It's also an upgrade from the Nikon Coolpix we had before this.", "Date": "July 28, 2013"}, {"Title": "so happy", "Author": "violeta", "ReviewID": "R1LAA76DX5BPYM", "Overall": "5.0", "Content": "I love, I'm very happy because it met my expectationsrecommend, super practical, lightweight, easy to carry in your wallet", "Date": "July 19, 2013"}, {"Title": "WILL NOT CHARGE!!", "Author": "Cindy L. Budine", "ReviewID": "R3ST17617898LG", "Overall": "2.0", "Content": "I bought this camera to replace another one that broke, it will NOT charge!! It charged the first time I used it, but has not since that time. I think it's a piece of junk and would NOT recommend it to anybody looking to purchase it. I love Sony brand cameras, but stay AWAY from this one!", "Date": "July 8, 2013"}, {"Title": "3.5 stars (giving 4 because Amazon makes me) for a decent camera", "Author": "R. McAdams", "ReviewID": "R33L0W9PYJZ8QT", "Overall": "4.0", "Content": "<!--\n\nfunction fp_resizePlayerSpace(nsPrefix,w,h)\n{\t\n  try {\t\n    var ifrm = parent.document.getElementById(nsPrefix + \"movieFrameID\");\n    if (ifrm) {\t\n        var h2 = h + 35;\n        ifrm.style.height = h2;\n      }\n    } catch(err) {\n \n    } \n\n\n  if (h > 0) {\n      document.getElementById(nsPrefix + \"clipDiv\").style.height=h+\"px\";\n      document.getElementById(nsPrefix + \"videoPlaceholder\").style.height=h+\"px\";\n  }\n  else {\n      document.getElementById(nsPrefix + \"clipDiv\").style.height=\"\";\n      document.getElementById(nsPrefix + \"videoPlaceholder\").style.height=\"\";\n  }\n  document.getElementById(nsPrefix + \"flashcontent\").style.height=\"100%\";\n}\n\nfunction fp_rewriteDiv(nsPrefix,divName,html)\n{\t\n    document.getElementById(nsPrefix + divName).innerHTML=html;\n}\n\nfunction embeddingPopup(nsPrefix)\n{\n  alert(\"placeholder function for embedding code\");\n}\n-->\n\n\n<!--\n\nfunction cv_moX5S4N7KQ6ZVVembeddingPopup(){\t\nalert(\"Embedding code will be displayed here.\");\n}\n\n-->\n\n\n\n\n\n\n\n\n\n<!--\nfunction cv_moX5S4N7KQ6ZVVrefresh_preplay() {\n\ndocument.getElementById(\"cv_moX5S4N7KQ6ZVVchiDiv\").innerHTML = document.getElementById(\"cv_moX5S4N7KQ6ZVVhiddenPre\").innerHTML;\n};\ncv_moX5S4N7KQ6ZVVrefresh_preplay();\n\n-->\n\n\n\n\n\n\n        // <![CDATA[\n\nvar cv_moX5S4N7KQ6ZVVso;\t   \n\n\nfunction cv_moX5S4N7KQ6ZVVloadSwf_Core(swfLocation, swfWidth, swfHeight, flashVersion, bgColor, swfParams, flashParams, embedAttributes) {\n\n  try {\n      cv_moX5S4N7KQ6ZVVso = new SWFObject(swfLocation, \"cv_moX5S4N7KQ6ZVVAMPlayerProd\", swfWidth, swfHeight, flashVersion, bgColor);\t   \n\n      for (var v in swfParams) {\n        cv_moX5S4N7KQ6ZVVso.addVariable(v, encodeURIComponent(swfParams[v]));\n      }\n      for (var v in flashParams) {\n        cv_moX5S4N7KQ6ZVVso.addParam(v, flashParams[v]);\n      }\n      for (var v in embedAttributes) {\n        cv_moX5S4N7KQ6ZVVso.setAttribute(v, embedAttributes[v]);\n      }\n\n      cv_moX5S4N7KQ6ZVVso.addVariable(\"swfEmbedTime\", new Date().getTime());\n\n      var agt = navigator.userAgent;\n       \n      var reFirefox = new RegExp(\"firefox/\", \"i\");\n      var regx = agt.split(reFirefox);\n      var ffVersion = 8;\n      if (regx[1]) {\n          var pts = regx[1].split(/[.]/);\n          ffVersion = parseFloat(pts[0] + \".\" + pts[1]);\n      }\n      var minorVersion = parseFloat(navigator.ap);\n      if ((navigator.appVersion.indexOf(\"Mac\")!=-1) || (ffVersion < 1.5)) {\n          cv_moX5S4N7KQ6ZVVso.setAttribute(\"height\", swfHeight);\n          cv_moX5S4N7KQ6ZVVso.setAttribute(\"width\", swfWidth);\n          cv_moX5S4N7KQ6ZVVso.addVariable(\"oldFirefox\", \"1\");\t     \n      }\n\n      if (cv_moX5S4N7KQ6ZVVso.write(\"cv_moX5S4N7KQ6ZVVflashcontent\")) {\n          fp_resizePlayerSpace('cv_moX5S4N7KQ6ZVV', \n                               320, \n                               283);\n      }\n      else {\n          var nsPrefix = 'cv_moX5S4N7KQ6ZVV';\n\n          fp_resizePlayerSpace(nsPrefix, 0, 0);\n          fp_rewriteDiv(nsPrefix, \"flashcontent\", '<br/>To view this video download <a target=\"_blank\" href=\"http://www.macromedia.com/go/getflashplayer\" target=\"_top\">Flash Player</a> (version 9.0.115 or higher)');\n      }\n  } catch(err) {\n      fp_resizePlayerSpace('cv_moX5S4N7KQ6ZVV', 0, 0);\n  }\n  return false;\n}\n\n\n\nfunction _cv_moX5S4N7KQ6ZVVloadSwf(movieID, playerVersion) {\n    var swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/20120510035744301/AMPlayer._V148501545_.swf\";\n    var swfWidth = \"320\";\n    var swfHeight = \"100%\";\n    var flashVersion = \"9.0.115\";\n    var bgColor = \"#FFFFFF\";\n\n    var swfParams = {};\n    var flashParams = {};\n    var embedAttributes = {};\n    swfParams.amazonPort = \"80\";\n    swfParams.allowFullScreen = \"true\";\n    swfParams.telemetrySubPageType = \"VideoReview\";\n    swfParams.nsPrefix = \"cv_moX5S4N7KQ6ZVV\";\n    swfParams.locale = \"en_US\";\n    swfParams.logUrl = \"gp/mpd/l\";\n    swfParams.canResize = \"1\";\n    swfParams.autoPlay = \"1\";\n    swfParams.sessionId = \"000-0000000-0000000\";\n    swfParams.marketplaceID = \"ATVPDKIKX0DER\";\n    swfParams.salign = \"LT\";\n    swfParams.preset = \"detail\";\n    swfParams.mediaObjectId = \"m2RFJLNR2HBQ1\";\n    swfParams.autoPlayTimer = \"\";\n    swfParams.mediaObjectIDList = \"m2RFJLNR2HBQ1\";\n    swfParams.playIsUserGenerated = \"1\";\n    swfParams.enableShare = \"0\";\n    swfParams.permUrl = \"gp/mpd/permalink\";\n    swfParams.telemetryPageTypeID = \"R33L0W9PYJZ8QT\";\n    swfParams.xmlUrl = \"http://www.amazon.com/gp/mpd/getplaylist-v2/m2RFJLNR2HBQ1/000-0000000-0000000\";\n    swfParams.amazonServer = \"www.amazon.com\";\n    swfParams.scale = \"noscale\";\n    flashParams.allowFullScreen = \"true\";\n    flashParams.salign = \"LT\";\n    flashParams.bgcolor = \"#FFFFFF\";\n    flashParams.allowScriptAccess = \"always\";\n    flashParams.quality = \"high\";\n    flashParams.wmode = \"transparent\";\n    embedAttributes.title = \"Flash Player\";\n\n    if (movieID){\n      if (playerVersion == '3'){\n        swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/20120510035744301/AMPlayer._V148501545_.swf\";\n        swfParams.mediaObjectIDList = movieID;\n      } else {\n        swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/legacy/20101014901/AMPlayerProd._V197491872_.swf\";\n      }\n      swfParams.xmlUrl = \"http://www.amazon.com/gp/mpd/getplaylist-v2/\" + movieID + \"/000-0000000-0000000\";\n      flashParams.wmode = \"transparent\";\n      swfParams.autoPlay = \"1\";\n    }\n\n    if (document.getElementById('cv_moX5S4N7KQ6ZVVduration')) {\n      document.getElementById('cv_moX5S4N7KQ6ZVVduration').style.display='none';\n    }\n    cv_moX5S4N7KQ6ZVVloadSwf_Core(swfLocation, swfWidth, swfHeight, flashVersion, bgColor, swfParams, flashParams, embedAttributes);\n\n  return false;\n}\n\nfunction cv_moX5S4N7KQ6ZVVloadSwf(movieID, playerVersion) {\n   return _cv_moX5S4N7KQ6ZVVloadSwf(movieID, playerVersion);\n}\n\n\n\t\n\t\t// ]]>\n\t\n\n<!--\n\nfunction cv_moX5S4N7KQ6ZVVnewHeight(h)\n{\t\n    fp_resizePlayerSpace('cv_moX5S4N7KQ6ZVV', 0, h);\n}\n\nfunction cv_moX5S4N7KQ6ZVVresetPlayer(w,h,bw,cc) {\n  cv_moX5S4N7KQ6ZVVnewHeight(h);\n\n  cv_moX5S4N7KQ6ZVVso.addVariable(\"resetBandwidth\", bw);\n  cv_moX5S4N7KQ6ZVVso.addVariable(\"cacheCode\", cc);\n  cv_moX5S4N7KQ6ZVVso.setAttribute(\"height\", h);\n  cv_moX5S4N7KQ6ZVVso.setAttribute(\"width\", w);\n  cv_moX5S4N7KQ6ZVVso.write(\"cv_moX5S4N7KQ6ZVVflashcontent\");\n}\n\n-->\n\n\n\n\n\n\n\n\nvar cv_moX5S4N7KQ6ZVVRollOverImg = new Image();\ncv_moX5S4N7KQ6ZVVRollOverImg.src = \"http://ecx.images-amazon.com/images/I/91mRFgVKcjS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play-active,BottomLeft,130,-12_CR0,0,0,0_.png\";\n\nvar cv_moX5S4N7KQ6ZVVpreplay = document.getElementById('cv_moX5S4N7KQ6ZVVpreplayImageId');\nif (cv_moX5S4N7KQ6ZVVpreplay) {\n  cv_moX5S4N7KQ6ZVVpreplay.onmouseover = function() {\n    cv_moX5S4N7KQ6ZVVpreplay.src = \"http://ecx.images-amazon.com/images/I/91mRFgVKcjS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play-active,BottomLeft,130,-12_CR0,0,0,0_.png\";\n  }\n  cv_moX5S4N7KQ6ZVVpreplay.onmouseout = function() {\n    cv_moX5S4N7KQ6ZVVpreplay.src = \"http://ecx.images-amazon.com/images/I/91mRFgVKcjS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play,BottomLeft,130,-12_CR0,0,0,0_.png\";\n  }\n  \n  \n  var node = cv_moX5S4N7KQ6ZVVpreplay.parentNode;\n\n  var cv_moX5S4N7KQ6ZVVcurrentClick = node.onclick;\n  node.onclick = function () {\n    var head = document.getElementsByTagName(\"head\");\n    if (head[0]) { \n      var logTag = document.createElement('script');\n      logTag.type = \"text/javascript\";\n      logTag.src = \"/gp/customer-media/du/log.html?ie=UTF8&p=CustomerImage&s=CustomerVideoPlay\";\n      head[0].appendChild(logTag);\n    }\n\n    if (cv_moX5S4N7KQ6ZVVcurrentClick) {\n      return cv_moX5S4N7KQ6ZVVcurrentClick();\n    }\n  }\n}\n\n\n\n\n Length:: 6:38 MinsThe video shows me holding the camera and walking you through its various functions, etc. Let's start with the positive:-It is easy to use-It comes with a battery (that is rechargeable and removable) and charger (I am NOT a fan of using AAA/AA batteries in cameras-It has a neat little \"panoramic scene\" mode that will let you use a tripod to get a very wide-angle view of something-It lets you take pictures even without a memory card (VERY nice, that is one of the things that bugs me about my Canon)My main complaint about the camera is that it feels cheap/\"plastic-y.\"  It is very light, and that bothers me, I don't like my electronics to be made chiefly out of plastic, especially handheld ones. I like them to have a bit of heft to them, and to feel solid.  I docked the camera 1.5 stars for that (although I rounded it back up to 4, because Amazon only does whole numbers). If that sort of thing doesn't bother you like it does me, then the only other negative for the camera is it only takes 720P video, not 1080P, which I consider to be standard now, and a bummer that it isn't included.So, overall, good camera.4 stars.", "Date": "June 25, 2013"}, {"Title": "Pretty", "Author": "Ingeborg Coffman", "ReviewID": "R25OC76HRO01T3", "Overall": "5.0", "Content": "Love this camera, no disc needed to install into computer, no more unstable pictures, small, beautiful pictures, the camera thinks for you. especially at close ups, faces look great.", "Date": "May 21, 2013"}, {"Title": "Great camera", "Author": "mgreber", "ReviewID": "R2H2C786JK5XAD", "Overall": "5.0", "Content": "The photos are so clear, and color is perfect.  Camera is lightweight, and easy to hold, and fits into shirt pocket..", "Date": "May 9, 2013"}, {"Title": "you wont be mad", "Author": "Michael Souffrant", "ReviewID": "R2I118TO1315NY", "Overall": "4.0", "Content": "honestly you wont be mad I liked it and I loved it I am using it now and it is worth it", "Date": "April 4, 2013"}, {"Title": "Fragile and Complicated", "Author": "minax", "ReviewID": "RPAQ9WVRW4X7P", "Overall": "1.0", "Content": "I am SO bummed. I really had hoped to love this camera, or at least like it enough to have it a few years as I usually do. First, it's not super user friendly. Even my techie friends were making fun of it for being complicated. Then, after a few uses, I dropped it lightly, but obviously enough to make the lens stop ejecting. I do not drop things often, but really, I have dropped my iphone a few times over the years with NO problems. Not a sturdy camera:( And I can't replace it because it's after the 30 day return time. 100 bucks down the drain. Boo!", "Date": "December 5, 2013"}, {"Title": "GREAT DEAL", "Author": "Gustavo Renato Canali", "ReviewID": "RP5Q7FCZ1SCZW", "Overall": "4.0", "Content": "IT IS AN AWESOME PRODUCT FOR THE RIGHT PRICE. GREAT VALUE FOR MY MONEY.I DEFINITELY RECOMMEND THIS PRODUCT. VERY SATISFIED.", "Date": "March 18, 2013"}, {"Title": "The panarama is difficult to use", "Author": "susie", "ReviewID": "R2POH3CVGIRBDS", "Overall": "3.0", "Content": "I did get panarama shots with it but needed someone else to help me get started with it.  The directions as LESS than helpful and you have to get everything just right for the wide angle shots to work.  The regular pictures are easy.", "Date": "August 21, 2013"}, {"Title": "An acceptable entry-level camera, although it will probably be dated within a couple years", "Author": "Scott", "ReviewID": "R4HZ2ONPT4TTW", "Overall": "4.0", "Content": "Before the widespread use of cell phone cameras, I had a 5 megapixel Sony Cybershot and loved it. It's been about five years since I've last used it, but the qualities from that camera have made their way to the DSC-W710, along with an upgrade in battery life, ease of use, and image quality.  It's a bit smaller than the older Cybershots, and the zoom, despite being higher, doesn't protrude as much from the camera. Other than the slimmer profile and increased resolution, there doesn't seem to be much that's new with the DSC-W710, except for the built in editing features. Software seems to be where Sony is trying to differentiate the Cybershot camera from a cell phone. The camera has something called \"Beauty Effects\" which allows you to do some limited editing directly from the camera, such as changing skin tones, smoothing out skin, eye widening, teeth whitening, and shine removal. The skin toning effect never looked good despite what I tried it on and the teeth whitening looked fake, but the skin smoothing effect works pretty well. Other than having a much ore powerful flash and the zoom lens, I can't think of too many instances where I would use the Cybershot over my Samsung Galaxy S4 camera.  When viewing the photos I took side by side, the differences were fairly hard to distinguish.  The Cybershot ultimately took the better pictures, but the convenience of having a camera that is almost as good built into my cell phone outweighed that.  Ultimately, I think the Cybershot might be a good choice for kids who don't have a cell phone yet and want to start taking pictures, or someone who doesn't have a cell phone with a higher quality camera built in, and doesn't need something as powerful as a more expensive camera with a larger lens.", "Date": "June 23, 2013"}, {"Title": "Good camera/ Boa Camera", "Author": "daniele antunes", "ReviewID": "RSUGBQHK5CM4P", "Overall": "4.0", "Content": "Basic, but good. Day by day camera.Camera basica, aparenta ser um pouco frágil, mas para uso dia a dia, acho que esta de bom tamanho.", "Date": "September 16, 2013"}, {"Title": "Excellent for the price", "Author": "Timothy McGoey", "ReviewID": "R2DZOO0DJLKRYI", "Overall": "5.0", "Content": "Have a 5 year old photographer son who finally has the perfect camera.Pros: Very few confusing options, super fast like all sony cameras, and excellent quality even in the low light pictures my boy mainly takes in the house. Buy your kids this camera, F the toys r us kids cameras.", "Date": "March 6, 2013"}, {"Title": "Cheap feel, black and pink colors", "Author": "Rosemary", "ReviewID": "R1AHZN78DNVDAB", "Overall": "2.0", "Content": "Was  not pleased to receive this phone because it has pink on the facing side and black on the other. Just who does that? But if they do, then they should let the consumer know that. It also has a very cheap feel. Can't believe it's a Sony product. I have bought several Sony cams, but it's time t start branching out to other models.", "Date": "December 10, 2013"}, {"Title": "it wont turn on some times", "Author": "Jeff Nelson", "ReviewID": "R2SIZGPHBMWPGO", "Overall": "3.0", "Content": "this camra is very cute it usally works most of the time but i was at a meating and it just shut down on me so hope it works in the futuer", "Date": "October 13, 2013"}, {"Title": "Really small!", "Author": "Vynny \"Vynrod\"", "ReviewID": "R1RIKW3D6JUETY", "Overall": "5.0", "Content": "Opening the tiny package I was shocked. Inside was an even tinier camera! It's barely bigger than a credit card and about the thickness of half a deck of playing cards. You also receive a usb cable, tiny battery and charger. The battery slots in easily and then you're run through the usual set up questions; date, format and camera settings. Then you're ready to take photos and videos.After set up, the camera boots almost instantly which is a refreshing change when compared to older point-and-shoot cameras, and naturally the pictures it takes are excellent as is the video. Now do keep in mind you should add a memory card or two when buying the camera as onboard memory is uselessly tiny. Just enough to get used to the camera's features but zero use for normal shoots.The panorama is a nice touch - click and pan slowly and you automatically have a panorama. Older cams I've had make you take multiple pictures then stitch them together - but not here.There's also several shoot modes as is expected in today's pas cameras.The optical zoom from macro to telephoto is excellent with the front lens moving appropriately as you zoom, no digital faux zoom here!So, a great little camera in a tiny package that takes great photos and video and is priced right. You may think you don't need a camera like this in today's world of amazing cellphone cameras, but this is an inexpensive dedicated cam that does one thing and does it quickly and does it well - and ultimately offers perfect results.", "Date": "June 2, 2013"}, {"Title": "camera", "Author": "Peter Koch", "ReviewID": "R3FUH8B7HI550D", "Overall": "5.0", "Content": "great value, used it on trip to Florida and took great pictues of my holiday, will need more time to see if it as good as my old one", "Date": "April 9, 2013"}, {"Title": "Won't turn on", "Author": "R. Johnson \"Rhod\"", "ReviewID": "R5A6HZOC8G44T", "Overall": "1.0", "Content": "Camera battery fully charged and camera won't turn in. It is a brand new camera and nothing is happening! Need to return as soon  as possible to get a refund or another camare!", "Date": "December 26, 2013"}, {"Title": "Nice camera", "Author": "Francesca Duso", "ReviewID": "R3I9QB5AVMDYXQ", "Overall": "4.0", "Content": "A good camera for a good price.  Unfortunately I have not been able to record videos on it since I need to purchase a different piece of technology in order to do so.", "Date": "April 5, 2013"}, {"Title": "Sony camera", "Author": "Elizabeth Ritter", "ReviewID": "R3ID58KY92TFZT", "Overall": "1.0", "Content": "I could not get it off the movie and record.  It says what I should push to take a still picture, but I was not able to move the button to take a still picture.  I returned it and I should get a refund on my credit card.", "Date": "May 30, 2013"}, {"Title": "nice camera", "Author": "Margery H. Parks", "ReviewID": "R5NYM2W9NQNXF", "Overall": "3.0", "Content": "It;s cute and does it's job, just wish it took photos faster. As I can't afford that it works great.", "Date": "May 19, 2013"}, {"Title": "Worked ONLY half of the first trip", "Author": "Socks", "ReviewID": "RK4XGYGAE2MRZ", "Overall": "1.0", "Content": "I bought this camera for my daughter to use in our weekly long trip to the national parks at UT.  Only lasted half of the trip.  Very POOR quality,", "Date": "August 4, 2013"}, {"Title": "NOT  LIKE  THE  OLDER MODEL  IT'S  OKAY", "Author": "MS. ANITA  MARIE HUMPHREY", "ReviewID": "R1IOQKS7GTSRTU", "Overall": "3.0", "Content": "WISH IT WAS LIKE  THE  OLD  MODEL  NOT  AS  NICE  WITH THE  FEATURES  OK  OK  OK  OK  OK  OKK  ITS  OK", "Date": "September 8, 2013"}, {"Title": "Excelente", "Author": "Gloricar Urbina Narvaez", "ReviewID": "R1VNF0OQAYMV0Z", "Overall": "5.0", "Content": "Entrega super a tiempo , el color y las caracteristicas identicas al señalado en la pagina, super liviana y facil de manejar y transportar", "Date": "February 26, 2013"}, {"Title": "broken out of the box", "Author": "Terri", "ReviewID": "R3J47UJ5KFA8TO", "Overall": "1.0", "Content": "Broken fresh out of the box. Lens would not open. Tried troubleshooting with no good results. Seems to be a flaw of this camera.", "Date": "September 18, 2013"}, {"Title": "pretty", "Author": "em", "ReviewID": "R1FDVT9TP9460A", "Overall": "5.0", "Content": "i like the prizes is cheap to another camera, a hope work fine, thanks for all, the color look pretty and model, just right for me.", "Date": "March 5, 2013"}, {"Title": "different color", "Author": "wang mengbei", "ReviewID": "R2AVSHIWALP1K9", "Overall": "1.0", "Content": "its not the same color, it is totally a red one```i hate this color and its not real pink as the picture online.", "Date": "November 11, 2013"}, {"Title": "dont buy this", "Author": "dakota brown", "ReviewID": "RF2T65Q3ZI4NH", "Overall": "1.0", "Content": "This is the worst camera ever. It is slow to respond and is difficult to program or set the flash.", "Date": "May 6, 2013"}, {"Title": "Great buy", "Author": "ELIZABETH FANTAUZZI", "ReviewID": "R2AE1J8XQHT5U5", "Overall": "1.0", "Content": "It is perfect and easy to handle. I would recommend it to anyone. Would buy another as a gift. Thanks", "Date": "September 7, 2013"}, {"Title": "battery", "Author": "Des", "ReviewID": "RCZ1Q1L0TJ2XQ", "Overall": "1.0", "Content": "what i want to know if this camera uses battery. i have a camera already and it uses battery i really would like a chargeable phone instead of battery operated.", "Date": "May 8, 2013"}], "ProductInfo": {"Price": "$92.99", "Features": "16.1 megapixel plus 5x optical zoom captures detailed subjects\nCapture your videos in 720p HD Movie mode\nPicture and Beauty Effect for more expressive stills and videos\nAdvanced Flash illuminates distant subjects for perfect photos\nTake stunning images in Sweep Panorama mode-up to 360Degree", "Name": "Sony DSC-W710/P 16 MP Digital Camera with 2.7-Inch LCD (Pink)", "ImgURL": "http://ecx.images-amazon.com/images/I/41qRqi%2Bl8QL._SX300_.jpg", "ProductID": "B00AQDGAKK"}}