{"Reviews": [{"Title": "love the Canon Powershot A2600", "Author": "Rick", "ReviewID": "R12ZYY2JTUCZ7Q", "Overall": "5.0", "Content": "I found the Canon Powershot A2600 so easy to use with on screen menu. I was able to use it right out of the box, then I just played with it for a little bit and I was able to figure it all out. So if your looking for a good camera that takes good pictures this is the one.  Oh and the battery life is great, the kids always view the pictures right off the camera and I know on my Olympus camera that would just drain the ife right out battery.", "Date": "April 25, 2013"}, {"Title": "Great Little Camera for the Price", "Author": "chicoapple", "ReviewID": "RQ848O9X2C3RQ", "Overall": "4.0", "Content": "I was looking for a basic point and shoot digital camera. For $100 this camera does exactly what I need it to do. It takes great pics both inside and outside and the video quality was surprisingly good. I did my homework before purchasing so I was fully aware this cam did not include a memory card or a cord for transferring images to my pc. Since I already have multiple memory cards and since my laptop has an SD slot this was not an issue. I purchased the caselogic case for this for an additional $6.00 and it fits like a glove. If you are looking for a basic point and shoot cam without a bunch of effects options that you will never use anyways than look no further.", "Date": "August 5, 2013"}, {"Title": "Great camera.", "Author": "Ann Thornburgh", "ReviewID": "R1TNCPX506K9RP", "Overall": "4.0", "Content": "Needed a small camera to take on vacations.  Had a cannon years ago and was pleased with it so decided to get another cannon.  So far pleased with the pics and ease of use.", "Date": "August 24, 2013"}, {"Title": "Good shots and easy to work", "Author": "JudyAnn Lorenz \"cherokee1234\"", "ReviewID": "R1Z51NUN71ESSH", "Overall": "5.0", "Content": "My old point and shoot cameras were about 'shot'.  I choose a smaller camera because I didn't want to drag an slr around. This camera does what I wanted and more.The videos are easy to work.  The viewer is large which helps me line up. I used it for over 100 images during the first outing!", "Date": "October 12, 2013"}, {"Title": "Nice Camera", "Author": "Doug Musser/ Penn State Univ.", "ReviewID": "R178UUJ0EH0760", "Overall": "5.0", "Content": "I purchased this camera to replace my Coolpix camera that the screen got water logged?? This is a really nice simple camera to operate and the pictures turned out so good I hardly even used my Nikon D40. I was able to shoot videos that were really great even though I was shaking while taking them, the clarity and colors were great.  The only thing I would recommend is using a Eye-fi Card if you have an I-Pad, the viewing screen is small if you want to see the pics at the end of the day.", "Date": "October 23, 2013"}, {"Title": "No support or documentation", "Author": "David Thompson", "ReviewID": "R1WA3745CQPNSG", "Overall": "3.0", "Content": "This camera seemed to fit my needs.  On receiving the product, the first thing I saw was that no manual was provided.  The setup sheet and the box both stated that I could download the manual.  Not an issue, this is common practice.  I went online and found that there is no manual.  It was not a problem with finding it, I got to the correct webpage which told me specifically that there is no manual for this product.  Support tells me that their is a help feature on the camera that will suffice, and no manual would be provided.  That is untrue, the help feature on the camera is simplistic and does not explain features and their use.  Not to be deterred, I went to Canons European site where I find a perfectly good manual.  I downloaded it, and now have the information I need.  The camera works as expected, the menus on the camera are not intuitive.  I have many Canon cameras, so far I have been happy with service, but after the attitude of support this time, this will be my last.  If there is no manual, they should say so on the package.  The insult is providing manuals for customers outside the US and saying none will be provided.", "Date": "March 23, 2013"}, {"Title": "Canon Camera", "Author": "Chris L King", "ReviewID": "R1FWNMVZOLJ70Y", "Overall": "5.0", "Content": "Nice small pocket friendly camera.  I use mainly canon so the buttons were easy to navigate and the pictures quite nice for a small point and shooter..Love the size so I can take it anywhere and nobody is the wiser.. I good buy.", "Date": "December 19, 2013"}, {"Title": "Very nice camera", "Author": "Fabiana Mazza Arrospide", "ReviewID": "R1TX6S1K592BMY", "Overall": "4.0", "Content": "Very good !! I love the pictures it takes and it is very comfortable to carry it around as it is small and light weighted.", "Date": "December 13, 2013"}, {"Title": "Great Camera - no card", "Author": "Nancy Stellmaker", "ReviewID": "R3UX4ASOQF71X", "Overall": "4.0", "Content": "Great camera and just what I wanted, but didn't come with card.  Had to buy one at Best Buy for $15+", "Date": "November 19, 2013"}, {"Title": "Easy to use!", "Author": "Court", "ReviewID": "R1KFLLBY28BSFO", "Overall": "4.0", "Content": "Very easy to use...comparable to an older Canon Powershot my kids decided to give a 'bath'. Do note that you do need to buy a memory card separately...luckily my old one was not destroyed so it didn't cost me anything additional but just keep that in mind when price shopping.", "Date": "November 12, 2013"}, {"Title": "Great outdoor pictures indoor RUN", "Author": "Michelle Affek \"Flare\"", "ReviewID": "R27OD5MUV9QK0Q", "Overall": "2.0", "Content": "I loved the color of the camera and after looking at a few the price was a good thought so I figured lets do it... now after a week of having it I am running away... The first night I took a picture in door (well the first 30) all but 6 were blurry... which is a LARGE disappointment... I tried the different functions and still nothing amazing... then I worked for a few days and forgot about it, but when I was off again I tried again to see if it was just me being tired after a long work day... apparently no... everything does not look crisp and seems to be lacking, However, outside the pictures looked amazing... but since I normally take indoor pictures I need something better to fit my needs so of to look again...", "Date": "May 2, 2013"}, {"Title": "I'm happy", "Author": "Jennifer Barkley", "ReviewID": "R29W4VLJSQ3GDK", "Overall": "5.0", "Content": "Great camera! Good price and takes good pictures! Only thing is it takes a few seconds to take a second picture if you've just taken one.", "Date": "January 11, 2014"}, {"Title": "Easy to get along with", "Author": "mike opfermann", "ReviewID": "R343CTZA6SB0JC", "Overall": "4.0", "Content": "Works well, I have not figured out how to make it take rapid pictures yet, maybe it does not!Very easy to use!", "Date": "January 3, 2014"}, {"Title": "Perfect inexpensive point and shoot", "Author": "P. Read", "ReviewID": "R3BDQ6K3G9RLD2", "Overall": "5.0", "Content": "Chose this camera for my daughter as it has a decent optical zoom and some of the video features she was looking for.", "Date": "December 30, 2013"}, {"Title": "A gift for my grand daughter", "Author": "Kalei Kema", "ReviewID": "R2YM9EHA8TL7QE", "Overall": "5.0", "Content": "She loves it, takes it everywhere with her, takes great pictures, and she loves her Gumpa, Thank you, Mr. Kema", "Date": "October 11, 2013"}, {"Title": "Missing items in the box", "Author": "Catherine Vo", "ReviewID": "R1WBL93PLF1KR2", "Overall": "2.0", "Content": "Missing battery.  I can not find in the local stores to sell individual battery without buying a camera  on this black Friday", "Date": "November 30, 2013"}], "ProductInfo": {"Price": "$129.00", "Features": "3-inch TFT color LCD with wide-viewing angle monitor\n16.0 megapixel 1/2.3-inch CCD sensor\nDIGIC 4 image processor for exceptional performance\n5x optical zoom with 28mm wide-angle lens delivers stunning images\nShoot brilliant 720p HD video with a dedicated movie button", "Name": "Canon PowerShot A2600 IS 16.0 MP Digital Camera with 5x Optical Zoom and 720p Full HD Video Recording (Blue)", "ImgURL": "http://ecx.images-amazon.com/images/I/51VQ518yNSL._SY300_.jpg", "ProductID": "B00AWZCLBY"}}