{"Reviews": [{"Title": "Exactly what I wanted.", "Author": "B. J. Rockwell", "ReviewID": "R3ULCUC83RP1F9", "Overall": "5.0", "Content": "This is neither too complex nor oversimplified. It has all  the feature I wanted. I get great pictures, easy to get  from the camera to my computer. It is small, yet not tiny, very light weight. I really do love it. Great value for the money.", "Date": "July 28, 2013"}, {"Title": "Canon is the way to go", "Author": "Thomas Juvik \"tommyboy\"", "ReviewID": "R2U8YHM8ROGEBQ", "Overall": "5.0", "Content": "This is my 3rd Canon camera over the course of the last 20 years and I've enjoyed everyone of them.  This is easy to operate, turns out quality photos, has a nice zoom, and the Canon software for downloading to your computer works wonderfully.  A lot of the new cameras are just too small for my big, shaky hands, and often the settings defy comprehension.  Not so with this baby.  A beauty of a small camera for a very nice price.", "Date": "October 31, 2013"}, {"Title": "Works fine for the price", "Author": "Sindee \"dee8381\"", "ReviewID": "RGMY2342KIR0R", "Overall": "3.0", "Content": "Takes pretty good pictures for the price.  Really slow recording speed tho so it takes a while before you can snap your next pic.  It is faster if you don't have the auto red eye reduction feature on.", "Date": "September 4, 2013"}, {"Title": "great camera ... great price", "Author": "Lawrence Walter", "ReviewID": "R2VCCTS9GPY3N4", "Overall": "5.0", "Content": "The camera arrived on schedule and certainly did not disappoint.  Easy to use, great photo quality, the various options are easily set.  would highly recommend this camera to anyone seeking a quality point and shoot camera.", "Date": "September 22, 2013"}, {"Title": "Fancy Dancy", "Author": "J. C. Nicholas", "ReviewID": "R3N8FO2B6KGDZ", "Overall": "3.0", "Content": "I got this camera a couple of weeks ago, so this may be a bit premature.The good;Primarily I got this camera as a carry-around - something small and something simple.  It's small and it's fast with good quality pics.The not-so-good;As noted above, I wanted something simple.  This is not simple as evidenced by its 124-page manual.  What happened to a simple point-n-shoot?  For example, I dislike finding which functions allow a forced flash and which don't.  I prefer modifying photos on a computer, not on the camera.  When I want fancy or complex shooting modes, I prefer my \"big\" camera.  I guess I'm old-fashioned.It doesn't come with a USB cable.  My iMac won't recognize the camera without installing the software - software you have to download after registering the camera.  My PC recognizes the camera w/o software.I shot a couple of short videos.  They appeared shaky, most likely from me.  No image stabilization, but it is an inexpensive camera.In short, it does fill my needs with a few inconveniences.  The price wasn't bad.", "Date": "October 23, 2013"}, {"Title": "love this camera", "Author": "M J Buck", "ReviewID": "RDPDHFEXRQ9QY", "Overall": "5.0", "Content": "I take a significant amount of photos for my online stores.  I am also a photography enthusiast but without a lot of money.  I was very pleased that a camera these reasonably priced took such great pictures.  The clarity and quality is really good.  I'm a happy customer and love the pink!  A+++", "Date": "August 20, 2013"}, {"Title": "quick little point and shoot camera..basic and simple", "Author": "M. Stagner", "ReviewID": "R21EEVHA0TQPNU", "Overall": "4.0", "Content": "so far this camera does what i want, take pictures.  I wanted a simple camera that I could carry around and travel with that if it broke or something it wouldn't be a big deal.  I don't travel with my photography equipment all the time because it can be a big hassle with my canon rebel and all my lenses.  I have always enjoyed canon and the simple easy to use camera's. all you have to do it turn the camera on and hit the button to take a picture.  NO need to figure out what dial to turn for a picture because the camera does it for you. Also the video is simple, press the red button and it starts recording to end the recording hit the red button again.I would say that anyone can use this camera with it's easy use.", "Date": "December 3, 2013"}, {"Title": "Seems a good deal", "Author": "calthorpe", "ReviewID": "R1F2FQ1PVN36R7", "Overall": "5.0", "Content": "This little camera is easy to operate, and I have had no problems so far, though I am not a sophisticated camera buff. It arrived, well packed and promptly.", "Date": "November 14, 2013"}, {"Title": "NICE!", "Author": "keeponpal", "ReviewID": "R2UADTUNSEL8GU", "Overall": "5.0", "Content": "Luck of the draw!  This camera/movie maker is great!!  The zoom works wonderfully along with the auto mode, it just make me feel like I'm pretty good at taking pictures.They turn out well.", "Date": "November 5, 2013"}, {"Title": "Nice camera", "Author": "lowee", "ReviewID": "RHX79824L13T", "Overall": "5.0", "Content": "Takes great pics. This is one that you can change the colors of items in the pic or you can srlect one color and that is the only color that will show, rest will be black and white, love that feature!  Great purchase at great price", "Date": "March 16, 2014"}, {"Title": "Great camera", "Author": "azbleek", "ReviewID": "R21UKK6158TAP", "Overall": "5.0", "Content": "This camera takes great photos and is small enough to go in my purse or pocket. Took it on vacation, took tons of pictures and didn't have to charge the battery the whole 2 weeks I was gone.", "Date": "February 18, 2014"}, {"Title": "Gift to myself.", "Author": "Janice S.", "ReviewID": "R3QERORFVHRZAZ", "Overall": "5.0", "Content": "I wanted a camera small enough to go in my purse. This is perfect and was very affordable and easy to use.", "Date": "February 11, 2014"}, {"Title": "Great", "Author": "Kimberli", "ReviewID": "R1JA7XBTQONOP5", "Overall": "5.0", "Content": "This camera works great! I love how the screen on the back is big so you can see your pictures after you take them really good!", "Date": "December 18, 2013"}, {"Title": "Overpriced kids toy", "Author": "Edith K. Williams", "ReviewID": "R2V5DW6135BYOO", "Overall": "2.0", "Content": "It does great on indoor video, but feels cheaply built. Moreover, I do not like the camera's light sensors forcing setting. circumventing the camera chosen settings is not a simple and easy step. If automatic settings are left, then the picture color is distorted. I take close up pictures of feathers, and the lens quality is too poor for that use. It does not take clear and crisp macro pictures. Overall, this camera was to replace my older Nikon Coolpix, instead, I will continue to use the old camera and keep this one in the glove box.", "Date": "November 10, 2013"}, {"Title": "expected more", "Author": "Linda Adams", "ReviewID": "R2XJWPABYGNB2Z", "Overall": "3.0", "Content": "Camera did not come with simcard or usb cord.  I spent just as much money buying those items and the camera as if it wasn't even on sale...thought I was getting a good deal...right?", "Date": "March 18, 2014"}, {"Title": "lemon product", "Author": "Apetown", "ReviewID": "R10N10B400B6XD", "Overall": "1.0", "Content": "bought it because was on sale... turn out after a month it had an electrical problem that would cost more to fix than to buy a new camera... i usually love cannons but i guess theres a reason for the cheap sale?", "Date": "March 10, 2014"}, {"Title": "Good and Simple", "Author": "Phillip A. Erickson", "ReviewID": "R2DTEVCEBU5YVT", "Overall": "5.0", "Content": "Other reviews expressed that this camera did not have many features.  I'm here to say that there were enough to get great pictures during a recent trip.  The important thing was that anyone could quickly understand the use of this camera and even shots by others came out good.  I'd recommend this as a pocket camera to anyone.", "Date": "March 2, 2014"}, {"Title": "Never worked!", "Author": "Pokupatel", "ReviewID": "R2Z709U79PYP0A", "Overall": "1.0", "Content": "Got this camera presumably brand new as a gift for my mother. She wasn't able to take a single picture! I should had checked the camera myself before giving to her as a gift. But I thought she would enjoy opening the present in a box. What a rip-off! Very disappointing and waste of money!", "Date": "February 25, 2014"}, {"Title": "Value for Money", "Author": "Lynn Clarke", "ReviewID": "R2ML49CKFZKSG2", "Overall": "5.0", "Content": "Got this camera and a  16 gb flashcard for $60 on cyber MondayExcellent value and no issues with the camera.", "Date": "February 25, 2014"}, {"Title": "Great little camera for the $", "Author": "Cmore \"just cruzin'\"", "ReviewID": "R2SCUH5NCM35ZX", "Overall": "5.0", "Content": "Bought this for a gift for my daughter but she already had 2 other cameras (not hardly as good) and really wanted money so I decided to keep it. When we started using it I let my daughter take some pictures and she really liked it. It is simple to use and setup and takes great pictures for a point & shoot camera. It has a large LCD screen and is visible in most lighting. Still wish it had a view finder for the bright sunshine but it will suffice for now. I think that it is definitely worth the money for a 16 MPx camera.", "Date": "February 21, 2014"}, {"Title": "Lens quit working. Unable to get camera to work.", "Author": "Judy Willis \"jcwindancer\"", "ReviewID": "R1CKANNGY91JT", "Overall": "1.0", "Content": "Lens Did not work after a few hours. Would open and then camera shut down. It was returned and unable to purchase a replacement.", "Date": "January 30, 2014"}, {"Title": "Kind of mixed results", "Author": "kerry middlebrooks", "ReviewID": "RQA31A2GC5ZS5", "Overall": "3.0", "Content": "For a camera with 16 MPs I expect the images to look better than my 5 MPs Kodak easy share CX7530 images do. Any any amount of zoom over 100% on my computer and the pixelation starts to kick in, hence, the lower cost! I also was not fond of the pink color and no choice to select another color!", "Date": "December 15, 2013"}, {"Title": "5***", "Author": "Cubanking22", "ReviewID": "R1GK8DW7HZ3LFL", "Overall": "5.0", "Content": "5 *****A ++++GREAT QUALITYGREAT PICTURESGREAT GIFT FOR CHRISTMASGREAT GIFT FOR MY MOM , SISTER , DAD , BROTH , COUSIN .PERFECT GIFT TO ANYBODY", "Date": "December 13, 2013"}, {"Title": "Should have waited!", "Author": "Deborah C. Delvecchio \"debadoll\"", "ReviewID": "R2L7CPX3OIY2SH", "Overall": "4.0", "Content": "Great little camera, but I should have waited for it to go on sale.  Didn't really need it as quick as I thought because I used my iphone for just as good quality.", "Date": "December 2, 2013"}, {"Title": "Awesome camera at a great price", "Author": "Wendy Pierson", "ReviewID": "R2N2U3J2KU3XXH", "Overall": "5.0", "Content": "This is a great camera at a great price point!  You won't be disappointed.  Good pocket camera.  Make sure to get a case.", "Date": "November 1, 2013"}, {"Title": "A Perfect Point & Shoot Camera", "Author": "Rick L. Wendel", "ReviewID": "R2SCJCMY6U1POZ", "Overall": "5.0", "Content": "If you use video mode from a full charge to completely drained, you can record about 10GB.  If you put the camera in front of your computer screen and use it to record a decent quality video and you write down what you’re going to say, you can go through about 16 pages of dialog in Microsoft Word, Times New Roman 14 font, with narrow margins.  The battery on the A2600 looks like a big memory card.  Its cannon battery pack NB-11L 3.6 V, 680 mAH, 2.5 Wh (Lithium Ion).  V = Volts, mAH = milli (x.001) Ampere Hours, Wh = Watt Hours.  You can buy a newly manufactured one from [...] that still needs to be charged for $25.64 (including shipping and handling), or you can get a new, refurbished battery from, [...] for $9.50 (including shipping and handling).  That’s delivered to your mailbox.  If you use the camera for trips or shoot a lot of video, you will want another battery.  Otherwise, you won’t need one for around the house.  You’ll need a USB cord that goes into the small USB connector for the camera.  ($2)  You’ll see a little cylinder on the cord itself.  That’s a noise filter or voltage spike filter, common on all such cords i.e. it doesn't do anything else.  (Still $2).  When you get all your stuff, you’ll probably have a couple batteries, the charger, the camera, the USB cord and one or more memory cards.  A little bag for it - is something I would get after you see what you have to put in it.  ($10 at WalMart).  The controls all make sense.  There is no cryptic non-sense to figure out.  The camera body is thinner than I thought it would be and it fits in the front pocket of my work shirts.  I’m very happy with that.  I haven’t tried out the camera at all yet.  That’s because I own Video Studio Ultimate.  It allows me to pick out shots from the video.  The video files are in MOV format.  If you want MPEG4, you need to convert it.  You can’t select MOV files to bring into Video Studio without having a free copy of QuickTime installed on your computer. (Not QuickTime Pro, which costs $).", "Date": "November 23, 2013"}, {"Title": "GREAT price, only small drawbacks.", "Author": "Katherine E. Marucha", "ReviewID": "R3NHPDHROCAXOB", "Overall": "4.0", "Content": "Very good cheap vlogging camera for a first time user.  AMAZING price with only a couple of draw backs.  1) Any type of bright light from a lamp or the sun will result a thin vertical line on the screen.  2) You have to hold down the 'picture' button for a full solid second until you hear a sound, or it won't take the picture.  Whenever I ask people to use my camera, they often fail and take no pictures at all.", "Date": "November 19, 2013"}, {"Title": "For me, this is not easy to use", "Author": "Redhead5639 \"SusieQ\"", "ReviewID": "R1EXBCY00C01Y0", "Overall": "2.0", "Content": "Manual is online, which I find annoying. Selected pic mode continually changes. Does not stay in place like a dial selector. I wanted a very small camera to tuck in purse/pocket and this one is small enough, but I will probably give away as I find it annoying to use and the indoor pics have a funny orangish tint which requires photoshopping each one to get correct colors etc.  I usually use a Nikon D70s so maybe I'm expecting too much from this camera. I had a couple of the old film Canon SureShots and loved them. Dropped one of those in icy stream, air dried it and it kept on working until I dropped it down a ravine and couldn't get to it. Smashed 2nd one up skiing. Guess I'll keep lugging the Nikon when I want pics.", "Date": "May 31, 2014"}, {"Title": "Wish I Could have Seen \"whats in the box\"", "Author": "Scott Dunlevie", "ReviewID": "R1OYJ9NEKW7RCE", "Overall": "4.0", "Content": "The camera works great. I only wish there was more information when we purchased it. I did not realize that the battery had to be removed from the camera and placed in an external unit to charge. Also did not know there was no cable in the box to transfer the photos from the camera to my computer. (had to buy that separate) Other than that we are having fun and enjoying the camera.", "Date": "May 23, 2014"}, {"Title": "Say Cheese !!", "Author": "William Sears", "ReviewID": "RF7WUTNLLSUWC", "Overall": "5.0", "Content": "This item replaced a broken camera and one outdated camera that shot poor video , I am dated and keep having to read the owners manual to learn new tricks ! Keeps me on top of technology !!", "Date": "May 22, 2014"}, {"Title": "Basic", "Author": "Angela S.", "ReviewID": "R2C4RG00PUPA3I", "Overall": "4.0", "Content": "This camera did not come with the memory card or a plug in for the computer but I guess that is why it was on the cheaper side.  Overall I am happy with the cameras size and ease of use.", "Date": "May 12, 2014"}, {"Title": "Worthless", "Author": "Prairee-Dawn", "ReviewID": "R3AS7Q9DHXJXKE", "Overall": "1.0", "Content": "This item makes an awful buzzing noise when operating. We sent it back right away. Don't waste you money on this camera.", "Date": "April 30, 2014"}, {"Title": "Good budget camera for vlogging", "Author": "Frank Bale", "ReviewID": "R1WD19MJCHN5DP", "Overall": "4.0", "Content": "Takes awhile to focus when using record mode but it's a good and cheap camera to start vlogging with. With the right lighting, it looks almost as good as the top cameras", "Date": "April 30, 2014"}, {"Title": "Canon PowerShot A2600", "Author": "Kathryn K Brodrecht", "ReviewID": "R19EP0IPKTHWWH", "Overall": "4.0", "Content": "I was looking for a point and shoot.  It makes beautiful pictures.  It is very light and easy to carry.", "Date": "April 25, 2014"}, {"Title": "OK Pocket Camera", "Author": "Susan J. Hanks", "ReviewID": "R1ASXM0E0NJ7VE", "Overall": "3.0", "Content": "Replaced my old cannon which I could not buy memory cards for any more.  This camera is ok, recovery time between photos is pretty slow.  Got a good deal on Cyber Monday.  Good pocket camera.", "Date": "February 22, 2014"}, {"Title": "still use my camera in this cellphone era", "Author": "skiarc", "ReviewID": "RYRUTJCURSOGF", "Overall": "4.0", "Content": "I don't use my camera as much since I have an iphone, but I still use my camera for video when I am analyzing my archery form and technique as well as taking planned pictures.  This unit is compact and gives the basic features known for a Canon.  I like the size as it fits in any pack I have on hand.", "Date": "February 22, 2014"}, {"Title": "Not what I expected", "Author": "Kate", "ReviewID": "R3RSJBNI1JUKZ4", "Overall": "2.0", "Content": "The rechargeable battery has to be removed to be charged.  Every time you remove the battery the camera's settings have to be reset.  Gets a little annoying after a while. Just not what I expected from a Canon. Pros:  Nice quality photos.  Would have returned it for a better model, but it was too late (Christmas gift)", "Date": "February 18, 2014"}, {"Title": "good for price", "Author": "Gab", "ReviewID": "R2EN0OHRYUX6PP", "Overall": "5.0", "Content": "we got it for niece birthday she is 12 and is her first camara...decent pics for the price.It is light.", "Date": "February 16, 2014"}, {"Title": "Good Camera for the Price", "Author": "JJLouis", "ReviewID": "R39LPNUE2U2IWU", "Overall": "4.0", "Content": "Got this for my daughter for Christmas.  She loves it.  As an avid photographer I'm a little disappointed in the lack of manual functions, but it works great for her.", "Date": "February 14, 2014"}, {"Title": "wire missing from box", "Author": "patti cancino", "ReviewID": "RJ48VI0NWWM9H", "Overall": "4.0", "Content": "a little confusing to use, camera too small.  Used it only a few times and found it was hard to hold it steady while aiming.  Wanted to put the pictures in my computer but you forgot to put that wire that attached from the camera to PCP.", "Date": "February 12, 2014"}, {"Title": "Canon Powershot A2600", "Author": "Maria R.", "ReviewID": "R21L6VZSMV9SOJ", "Overall": "3.0", "Content": "I was so in a hurry in ordering this one, I did not realize it did not include any sd card, so i have to buy it.  For the price, it's ok. It's a little bit heavier compared to my sony cybershot.", "Date": "February 9, 2014"}, {"Title": "Great little camera", "Author": "Nancyleer", "ReviewID": "RK597U4H8W4I7", "Overall": "5.0", "Content": "We have 32 grandchildren so I needed a dependable, easy to use camera. That is exactly what I got with the Canon PowerShot A2600. Thanks Amazon. The price was right too.", "Date": "February 8, 2014"}, {"Title": "Easy to use!", "Author": "joann percel", "ReviewID": "R314VLOAX4SA4X", "Overall": "3.0", "Content": "This camera is easy to use..pictures and video. Inexpensive and good zoom too. One of the problems with the camera is the lapse time from when you click and when the picture is actually captured.  We used the camera to take a picture of our 2 year old grandson.  He would pose for a few seconds and then begin to move.  As a result, you have to take many pictures before you get a good one!  The camera also shuts down quickly which makes getting the picture quite difficult.  Finally DO NOT GET THIS CAMERA WET!  Even minor wetness will cause the camera to fail.  My first camera was replaced by Amazon because it was set on a wet surface.  Amazon stood behind their return policy!", "Date": "February 4, 2014"}, {"Title": "Decent for the price", "Author": "Jim T", "ReviewID": "RI7M1078XS4UQ", "Overall": "4.0", "Content": "This little camera replaces previous cannon camera. It is lighter than the previous model we had but takes very decent pictures. The only real issue keeping it from 5 stars is the battery/memory compartment which is thin plastic and it does seem to have some small issues taking close up macro shots. Other than that this is good for the money spent.", "Date": "February 4, 2014"}, {"Title": "love it", "Author": "patricia settles", "ReviewID": "R3HNPC8LK82SK5", "Overall": "5.0", "Content": "Perfect for my daughter. She wanted a camera and I wanted to get her a nice one I whopped around and decided to check amazon. I'm glad I did.", "Date": "February 1, 2014"}, {"Title": "Great point & shoot", "Author": "Texas Kat \"kat\"", "ReviewID": "R1UAXDC74HP5SK", "Overall": "5.0", "Content": "I saw this Canon camera and had to have for my upcoming trip.  I really have enjoyed using it.  It is a great point and shoot camera.  I like the size as I hate to carry a big bag on vacation.", "Date": "January 31, 2014"}, {"Title": "Bought 2 of them", "Author": "Tammy Curcio", "ReviewID": "R1FVWH690UU9SH", "Overall": "5.0", "Content": "Nice, compact, light and takes nice pictures. Great as a spare to carry around in your purse, bag, or car.", "Date": "January 31, 2014"}, {"Title": "Great Camera at a Great Value", "Author": "O. Rawcliffe", "ReviewID": "R3LFB8U7WO8RB4", "Overall": "5.0", "Content": "I purchased this for my teenage grand daughter for Christmas and she loves it. Very compact with a hook to attach to your belt or jeans, this tiny camera is now her favorite new gadget. Takes very good pictures and is user friendly.", "Date": "January 23, 2014"}, {"Title": "It works Great", "Author": "LK \"LK\"", "ReviewID": "R37685DLZCED1T", "Overall": "4.0", "Content": "I got this camera during the deals days around Christmas for a great price. It takes great pictures andvideos and is easy to use. However I did have to purchase a cable to connect it to my PC.You can also download the user manual to your PC.", "Date": "January 19, 2014"}, {"Title": "A2600 Tested: Image Quality and Usage Notes", "Author": "Stephen D. Kirkish \"stephenkirkish\"", "ReviewID": "R3RIFW9LCKICTQ", "Overall": "5.0", "Content": "We got the A2600 to add a low-cost camera to go along with our Canon PowerShot S100 compact digital camera. The A2600 is a fine point and shoot that performs well and produces quality images. A step up from the A2500, it grows the back display LCD from 2.7\" to 3\" (diagonal) and adds face recognition capabilities. It appears to be solidly built, and is lightweight, weighing about 5oz. (S100 weighs 7oz). The A2600 has two shooting modes: Auto and Program; it lacks advanced modes like Manual and Aperture and Shutter Preferred modes found on more expensive compacts, which is OK for this level of camera. Overall, I'm pleased with the performance and photo quality, given the lower price point and knowing that it's not my primary, full-function camera.General Comments:The 3\" diag. LCD screen (2-3/8\" x 1-3/4\") is bright and sharp, easy to view in daylight conditions. Also, darker scenes are shown with enough detail (although very grainy) to compose a shot. The lens shows slight barrel distortion at wide, middle and 5x zoom levels, comparable to S100 lens. The zoom range is (35mm equiv.): 28mm - 140mm optical, up to 560mm equiv. with added digital zooming. The \"Auto\" mode decides what kind of picture you're taking (people? bright/dark scene? moving?) and adjusts exposure and focus quickly and appropriately. \"Program\" mode allows you to adjust exposure (through exposure compensation) and image quality (ASA, image contrast) a bit.The camera has a number of features found on more expensive cameras, as well as a few special effects modes. Check them out in the camera manual, found online at Canon's website on the A2600 product page, under \"Brochures and Manuals.\"Pros:After reading the quick start instructions, basic operations were easy. The manual provides more details, particularly on Auto and Program modes. Color saturation looks good, comparable to the better S100. Image color looked realistic and accurate. I saw negligible to no chromatic aberrations, like R, G or B color bleeds at high-contrast edges. I like the flash and the fact that it’s not a popup. It is sufficiently bright to provide good fill lighting in bright conditions, and gives nice, even lighting to low-light scenes without blowing them out.For Movies, the lens can be zoomed during recording. Zoom is smooth, but zoom motor is picked up by the microphone. Record button on back panel makes starting movie simple and quick. Record “stop” can be done using the Shutter button, easier than using record button to stop.Cons:The maximum equivalent ASA is 1600 (6400 in “low-light” mode – grainy). Image gets \"noisy\" (looking grainy and non-crisp) in typical room-light conditions, where camera operates at ASA 800 or 1600. This is due to 16MP sensor - a 10-12MP sensor will typically produce better results. Thus, image quality is adequate but not fantastic in low-light. Slight grainy noise also seen at ASA 250, resulting in a slight loss of definition, fine details and edge crispness.Image processing after taking the picture is much slower than the S100. It takes 2 seconds after pressing the button for the camera to be ready for another shot (tested for 8MB (M1) and 16MB (L) settings.) The S100 takes less than 1 sec.Many of the niftier functions are buried in menus, making it less likely one will take the time to use these modes. You will probably not navigate to \"low-light\" mode to capture someone blowing out a candle in a dark room, but take your chances with Program or Auto modes. Fortunately, those easy-to-access modes produce fine results in most cases.For Movies, the lens zoom noise can be heard in recording (soft scratch-hiss during zoom.) Microphone is centered on the top of the camera, right above the lens. Zoom switch \"clicking\" may also be recorded.Summary:This camera is a fine point-and-shoot and has enough \"auto\" features to allow you to concentrate on your composition. This is not the best camera to use for huge poster-size prints, but it’s great for uses from e-mails to small photos, calendars, photo books, and even 8\" x 10\" pictures. Have fun with the camera - make your own test shots in various modes that you're likely to use, and find the quickest way to achieve the shot you want.", "Date": "January 18, 2014"}, {"Title": "Good little camera", "Author": "Dot", "ReviewID": "RXGLEUMETIWL", "Overall": "5.0", "Content": "Bought it for a gift for my brother, who loves pictures and taking them, but not good with complicated electronics.  Very simple to use and small enough to carry in his pocket.  Makes good pictures.  He loves it.", "Date": "January 18, 2014"}, {"Title": "Size and features", "Author": "Michael David", "ReviewID": "R1V5NZ0ZJ4TH6O", "Overall": "5.0", "Content": "Love the size and features of the camera.  Battery charging and downloading exactly what I was looking for in a compact very good picture taking carry along.", "Date": "January 15, 2014"}, {"Title": "Mom's new phone", "Author": "Marea", "ReviewID": "R2KQYCNAEGPPXZ", "Overall": "4.0", "Content": "Camera was promptly delivered. It takes great pictures and is easy to operate. Only issue is that it doesn't come with a cable to transfer pictures from the camera to computer. You can download software that is supposed to allow you to digitally do it, but it didn't work. We had to pay extra to get the cable to transfer the pictures.", "Date": "January 14, 2014"}, {"Title": "okay", "Author": "J. Kunkel", "ReviewID": "R1LELE7EJT3R5A", "Overall": "3.0", "Content": "It was a good price to replace our digital camera.  Two things I don't like - 1. You can't force it to flash so indoor pictures can come out grainy.  You have the option for no flash or auto flash.  2.  It seems like there is a lag in when you press the button to take the picture and when it acutally takes (I would say about a second).  With young kids this is a big deal as you miss the picture with eyes open and smiles.", "Date": "January 14, 2014"}, {"Title": "An Awesome Little Camera!", "Author": "Turningleaf", "ReviewID": "R1Q3GJRMGHTW8B", "Overall": "5.0", "Content": "I'm a fairly serious Canon DSLR shooter and wanted a simple point and shoot for my 6 year old.  After looking for more than a year, this camera hit the lighting deals and I snagged it.  We LOVE it!  I'm amazed by the photo quality.  Of course, it doesn't replace my DSLR, but it's compact, convenient and very easy to use.  My son can take pictures along side of me and I can grab it for those quick snapshot occasions. I definitely would buy it again and recommend it to anyone looking for a pocket size, easy to use camera.", "Date": "January 13, 2014"}, {"Title": "point and shoot pictures", "Author": "Kimberly A. Simpson", "ReviewID": "R77JMNU2M9OKD", "Overall": "5.0", "Content": "I love being able to fit it neatly in a pocket. It takes nice clear pictures without a lot of fuss. Focus is nice and the zoom works great.", "Date": "January 11, 2014"}, {"Title": "great camera", "Author": "Violeta Flemenbaum", "ReviewID": "R34XOJKWRC3RKB", "Overall": "5.0", "Content": "Great entry level camera. No frills, just great pix. Hard to not snap a good picture. Wish it had Wi-Fi though.", "Date": "January 11, 2014"}, {"Title": "Just amazing for the price!", "Author": "Y. Kingsley", "ReviewID": "RXIPZRK0D7J5M", "Overall": "5.0", "Content": "Fed up with useless kids cameras I bought this for my 5 year old. Unlike similar priced 'kids' cameras this has a great screen on the back and takes amazing pictures! It is not 'shatter proof' so we have to look after it a little but the pictures are amazing - as good as a camera 4 x the price.We all love it. We loved it even more after we put some Hello Kitty Stickers on it!", "Date": "January 10, 2014"}, {"Title": "Does what you ask it to.", "Author": "Ryan Jacob", "ReviewID": "R12EI7211HW1UG", "Overall": "4.0", "Content": "Simple as that, point and shoot. Certain lights, takes great pictures, other light, not so much. Obviously it isn't an SLR and you can't control a lot of the functions, which I think really hurts the camera because the flash usually washes out the picture indoors. I bought it for my wife for Christmas she really likes it so I guess happy wife, happy life. So if you want a camera to point and shoot, buy it. If you are used to SLR's like me, leave it.", "Date": "January 10, 2014"}, {"Title": "My first Canon", "Author": "Amazon Customer", "ReviewID": "RGK7PH1JHB7DY", "Overall": "4.0", "Content": "The price was definitely right however I did not realize the USB cable was not included in the package.  Small inconvenience.  Once I figure out all that I can do with this camera I am sure it will be used and appreciated often.", "Date": "January 7, 2014"}, {"Title": "Great Camera", "Author": "Robert E Speicher", "ReviewID": "R1G7OIC43OMH9C", "Overall": "5.0", "Content": "I bought this camera for my grand daughter's birthday. There was a \"hic-up\" on the delivery but things like that happen. The vendor delivered a great camera and my grand daughter loves it. Her father is now jealous because the camera is better than his camera. The pictures are beautiful and sharp. I will use this vendor in the future.", "Date": "January 7, 2014"}, {"Title": "Nice camera", "Author": "Lori G.", "ReviewID": "R14SE3Q8XBCVDH", "Overall": "3.0", "Content": "The camera takes nice pictures except it is sometimes fuzzy even when I am holding still. The zoom works really good.", "Date": "January 6, 2014"}, {"Title": "Great camera", "Author": "Lori m reeves", "ReviewID": "R301OFG2JHWN6", "Overall": "5.0", "Content": "Very easy to use and takes up so little room. I would suggest this camera for anyone wanting an easy digital camera.", "Date": "January 5, 2014"}, {"Title": "Oh Yah!", "Author": "Mssuzy \"Carolyn\"", "ReviewID": "R31P0X1G8N0QI", "Overall": "5.0", "Content": "Small as a button and very easy to use; display screen larger than thought; Has a lot of options I didn't expect and the rechargeable batteries are awesome, but was a little disappointed that it didn't come with a sd card.", "Date": "January 5, 2014"}, {"Title": "love it", "Author": "A. Treinen \"angie fox\"", "ReviewID": "RH4284WYXLQ4J", "Overall": "5.0", "Content": "great camera!  videos are especially easy to initiate.  easy to operate and overall a great camera.  i like the set up of the battery charger and memory card.", "Date": "January 4, 2014"}, {"Title": "good quality", "Author": "aissata kane", "ReviewID": "R2ZAEQUIRX4H23", "Overall": "4.0", "Content": "very good camera and it offers many options. The price is also a good reason to buy it. very light", "Date": "January 4, 2014"}, {"Title": "An ok, cheap point and click", "Author": "Charles Shepard \"citizen\"", "ReviewID": "R25X4UZBIRF1QH", "Overall": "3.0", "Content": "Not very well made, battery compartment cover was difficult to line up. I just fabricated a new cover. No instructions but I have had other digital cameras and was able to figure this out OK. Cannon is no longer a brand name,  just a label for subcontracted junk from China. Would I recommend this camera? Sure, with the caveat of don't expect much for under $100.", "Date": "January 4, 2014"}, {"Title": "Works great!!!", "Author": "Roosevelt Allen \"rough rider\"", "ReviewID": "RISDHJMFVQ8PN", "Overall": "4.0", "Content": "My wife was using an earlier version digital with a small screen and low resolution. She is a point-and shoot person and wanted nothing too complex, but wanted better photos.  This camera fits the bill: large screen, a rechargeable battery and minimal options. It works great and take quality photos.", "Date": "January 4, 2014"}, {"Title": "Great pictures/video", "Author": "Kyle \"Kyle\"", "ReviewID": "R27AJO5H185QGZ", "Overall": "5.0", "Content": "I purchased this for my son at Christmas and he loves it.  The quality of the pictures and video is great.", "Date": "January 4, 2014"}, {"Title": "Great camera for the price!", "Author": "Anthony J Catalfamo Jr", "ReviewID": "R28WSUM2N1HTB9", "Overall": "4.0", "Content": "Solid point and shoot camera. Especially for the price.  What I like most is its simplicity and the fact it's not bloated with features I don't need. There is nothing negative I can say about this camera.", "Date": "January 4, 2014"}, {"Title": "Great camera for the focus challenged", "Author": "Maurice G.Dion", "ReviewID": "R2XK8WRT5HWBN7", "Overall": "5.0", "Content": "I'm a simple point and shoot guy.  My last  digital was the newest thing in 2004, but this one is half the size and weight and far exceeds the capability of the old model.  You got to keep up with the latest focus.", "Date": "January 4, 2014"}, {"Title": "Good Camera for the price.", "Author": "KJ", "ReviewID": "RRYFFXOVWM6UX", "Overall": "4.0", "Content": "This is a good camera for the price.  Happy with the purchase.  It did not come with a download cable.", "Date": "January 3, 2014"}, {"Title": "great price for a nice compact camera", "Author": "wolf", "ReviewID": "R146A509Z0Z1JE", "Overall": "5.0", "Content": "For a canon camera and the memory bondle price is fabulos and the brand said everything compacted, small but with exellent shooting and nice capture fotos and video, love this  cam", "Date": "January 3, 2014"}, {"Title": "Takes great pictures.", "Author": "Chris MacMIchael", "ReviewID": "R3CZUH3G8NYONU", "Overall": "4.0", "Content": "I love this camera for the price, $160 on Black Friday.  Compact, zoom, good-sized screen.  I would have rated it 5 stars if not for the long delay between pushing the button and snapping a picture.  Taking pictures of the kids was hard if they would not hold still!", "Date": "January 3, 2014"}, {"Title": "love it", "Author": "dayna e reed", "ReviewID": "R1HFZHJVLUAYMU", "Overall": "5.0", "Content": "the perks of this camera are the size and its ease of use. i have an olympus 35mm and the pictures that this little camera yield look just as good", "Date": "January 3, 2014"}, {"Title": "Good value", "Author": "Spencer Schram", "ReviewID": "R28CE0Y1JD9S9D", "Overall": "4.0", "Content": "simple camera at excellent price.  shipped without memory card and all instructions on line.  so far it has done what was expected.", "Date": "January 3, 2014"}, {"Title": "Nice little pocket camera", "Author": "Sharon Leary", "ReviewID": "RD0LU3CXL57N2", "Overall": "4.0", "Content": "Really like this camera, especially the rechargeable option. also it takes excellent videos as well as pics. I keep it with me all of the time.", "Date": "January 3, 2014"}, {"Title": "Disappointing:", "Author": "Dorthy Sebourn", "ReviewID": "R20MDVXKR415B3", "Overall": "2.0", "Content": "Camera came all by itself, didn't realize. No instructions for all the little buttons. Also can't order A2600 cord to download pics as they are sold out. You click camera to take pic and seconds later pic appears, not same position tried for. disappointing, even if it was the golden Deal of the day. More like brass.", "Date": "January 3, 2014"}, {"Title": "Long Battery Life", "Author": "Joseph J Felice", "ReviewID": "R13CUYRII9XR3T", "Overall": "5.0", "Content": "The camera has a long Battery life and is completely rechargeable. It compact, with great lends protection and user friendly.", "Date": "January 3, 2014"}, {"Title": "Awesome little point & shoot camera", "Author": "C. Monaghan", "ReviewID": "R3H2MCO3MVW584", "Overall": "5.0", "Content": "Camera was deal of the day so decided to try it. I would rate it well above my expectations. Easy to use for anyone.", "Date": "January 3, 2014"}, {"Title": "Not good", "Author": "arn007", "ReviewID": "RVL0V3VX265GQ", "Overall": "2.0", "Content": "Poor picture quality. I had 3 other low end point and shoot camera before. This is the worst among those.", "Date": "January 3, 2014"}, {"Title": "Very good", "Author": "Walter Pambabay", "ReviewID": "R3ONOCSLUGT0QA", "Overall": "5.0", "Content": "Good product, fast shipping and packaging pretty sure it works correctly for transport, similar to the one shown in the ad, highly recommended,", "Date": "January 3, 2014"}, {"Title": "very glad I bought this camera", "Author": "text book buyer", "ReviewID": "R1XMTJE6PA1WHO", "Overall": "5.0", "Content": "The camera is exactly what I expected. I bought it for my teenager as a first camera and she loves it. It takes good quality pictures and is super easy to use. Great point and shoot camera.", "Date": "January 3, 2014"}, {"Title": "Small nice camera", "Author": "CW Pend", "ReviewID": "R2BHUZ7WPJ0W5P", "Overall": "5.0", "Content": "I like it and it is small and easy to do the basic functions. We still need to figure out the more complex functions. I haven't figured out how to take the photos off, yet.", "Date": "January 3, 2014"}, {"Title": "Nice clear pictures", "Author": "mcguire", "ReviewID": "R37P9ARK8AVM9H", "Overall": "5.0", "Content": "This camera takes very clear pictures.  It is very simple, without a lot of extras that I don;t need or want.", "Date": "January 3, 2014"}, {"Title": "Great little camera!!", "Author": "SDM2010", "ReviewID": "R2L3ZLFQZANNOZ", "Overall": "5.0", "Content": "11yr old daughter got it for Christmas at a fantastic Amazon price.  Battery charged and she's off taking pictures!!  No problems and a great first Canon camera for her.", "Date": "January 2, 2014"}, {"Title": "got this for a friend", "Author": "Nichole R.", "ReviewID": "R2GKUHZ29ALEZH", "Overall": "5.0", "Content": "One of my good friends did not have a camera when I found out she was going to have her first baby. So as being a first time mom myself I could not let her go on without one. So that is what I got for the baby shower", "Date": "January 2, 2014"}, {"Title": "nice camera", "Author": "B. Roberts", "ReviewID": "R39V32W4D705RS", "Overall": "5.0", "Content": "bought on black friday for $57.  Didn't really need one but couldn't pass up the price. Ended up giving it to the girlfriend who loves it.She used it at her Christmas party and liked the fact she could take pictures quicker without having to hassle with the phone. Takes nice pictures also.", "Date": "January 2, 2014"}, {"Title": "Good camara but poor battery performance", "Author": "Esteban FB.", "ReviewID": "R3I4EQTN2E1KAK", "Overall": "4.0", "Content": "Its a cheap but good camera (it's Canon...) and its very easy to use. You can see how the smart thing is working selecting the best settings for the shot. Good video quality. For the family purposes is ok. The thing that really is disappointment is the battery life or performance. I need to buy a spare part If I want to to pic the whole day....", "Date": "January 2, 2014"}, {"Title": "Bad Picture Quality", "Author": "e1e", "ReviewID": "R1DXPU4P3PCFAE", "Overall": "2.0", "Content": "I bought this camera because of Canaon reputation and its spec indicates it's 16 MP and 5x optical zoom.  When I received it, I was a little disappointed with the coarse LCD resolution, but due to the price, I can still live with it.  But the picture quality is real bad.  I first took some pictues indoors, and the picture seems to be too dim.  Then the next day when I took pictures outdoors with beautiful sunshine and view the pictures on my computer (because I cannot judge that based on the camera's LCD), I was so disappointed at the quality of the pictures.  The don't look like 16 MP pictures but look like 3 MP pictures.  Now I will be very cautious about buying Canon point and shoots ...", "Date": "December 31, 2013"}, {"Title": "good camera for the money", "Author": "Jaelene Boyce", "ReviewID": "R34GJ9TFFC9N8V", "Overall": "3.0", "Content": "I bought this on a black Friday deal. So I got it for $50.00,  For that reason I am fine with it. It meets my expectations. If I had paid the full price (over $100 ) I would have been disappointed.", "Date": "December 31, 2013"}, {"Title": "Nice little camera / excellent quality photos", "Author": "Amazon Customer \"rumbledolly\"", "ReviewID": "R1SLI5L8QD1WH7", "Overall": "5.0", "Content": "Bought this camera after reading reviews here. Good choice if you're looking for a good camera w/excellent photo quality. Many settings and features makes this feel more expensive. 16 megapixels gives it rich colors and decent action shots. Easy to use right out of the box. Lightweight makes it handy to carry around.Purchased for a 14 year old taking photography in school. Has all features necessary for class but isn't \"dumbed\" down for a kid. Would recommend to anyone who loves to take photos on a regular basis.", "Date": "December 29, 2013"}, {"Title": "Love my new camera", "Author": "TERI DENAURO", "ReviewID": "R1IHCJ5NBPYB54", "Overall": "5.0", "Content": "This I my first purchase of a camera in quite sometime.  I love the fact it is small and I can tuck away in my pocket.  It takes great pictures and is easy to use.", "Date": "December 29, 2013"}, {"Title": "Perfect Little Canon Powershot Camera", "Author": "Elizabeth Zarate", "ReviewID": "R1E0S3SKKS0CB1", "Overall": "5.0", "Content": "I’m rating the Canon Powershot A2600 (5 stars) because based on the other reviews and ratings it truly is a fantastic camera without breaking the bank. I found the Canon Powershot A2600 to be extremely user friendly and easy to use.Before purchasing any digital camera I decided to conduct my own research regarding price range, LED screens, and sharpness. I was totally torn between the Nikon and the Canon Power Shot however based on the review and ratings; I decided to go with the Canon. I made an excellent choice of selection. It’s a great little camera that gets the job done. The camera takes amazing photos to capture unforgettable moments and memories. It takes pictures that are very crisp and clear. I was totally shocked and in disbelief that this little camera has the power to take really good shots.Also this camera takes awesome video recordings and overall I’m very satisfied with my purchase :) and would recommend anyone that is looking for a great camera for an inexpensive price tag to definitely consider purchasing the Canon Powershot A2600. This camera has a sharp lens, its inexpensive compared to other “name brands”, has a on-screen help mode, a wide 3-inch LCD screen, and includes a battery charger. Thanks Amazon!", "Date": "December 26, 2013"}, {"Title": "Great little Camera", "Author": "Steven Oliveri \"Steven\"", "ReviewID": "R2TO35Q9SCUHPH", "Overall": "5.0", "Content": "Well I am still learning how to use this but for the money you can't get a better camera at 16mp. It fits nicely in your pocket and is very easy to use. I got it just in time to take pictures for the holidays, even sooner than was promised. You may say \"why a camera when phones take pictures\". Well, there's no substitute for a good camera and there are many phones out there that do not have flashes and do not have 16mp. Thank you again Amazon!!", "Date": "December 26, 2013"}, {"Title": "Perfect in PINK", "Author": "Staci R. Sachs \"Queeni\"", "ReviewID": "RYMEF2P94WXH", "Overall": "5.0", "Content": "This was a Hanukkah gift I bought for my daughter.  It was EXACTLY what she needed...and it came in pink.  BONUS!", "Date": "December 6, 2013"}, {"Title": "Good quality for the price.", "Author": "Teresa DeWald", "ReviewID": "R288SHFJHNOB7U", "Overall": "5.0", "Content": "This camera takes nice pictures and for the price it could not be beat! The menu is easy to use and setting are easy to change. Picture quality is great for the price!", "Date": "February 12, 2014"}, {"Title": "What a Great Cyber Monday Deal!!", "Author": "Skipper McFearson \"quickcuda6\"", "ReviewID": "RLUAY433D6YDZ", "Overall": "5.0", "Content": "Was looking for a simple but good quality digital camera for our son when I came across this amazing deal.  You just cannot beat the price with a free SD card to boot!!!  The only complaint I have (very minor) is that it was not offered in more colors than Red.  Well done, Amazon!!", "Date": "December 2, 2013"}, {"Title": "You get what you pay for...", "Author": "Ballpoint", "ReviewID": "R226X2FW1S3PY7", "Overall": "2.0", "Content": "... and that would be a very simple, no-frills digital camera. Maybe good to keep as a spare in the glove box.", "Date": "January 3, 2014"}, {"Title": "sort of disappointed", "Author": "bbstenor", "ReviewID": "RN3AEK7CCIQEK", "Overall": "2.0", "Content": "Not as easy to use as it should be. Recorded some video, but no way to play it back. sigh", "Date": "January 3, 2014"}, {"Title": "Not happy", "Author": "Dee", "ReviewID": "R2JNBMM8SPHTNU", "Overall": "1.0", "Content": "Slow in capturing picture and bad quality picture. I don't recommend this camera to anyone. I regret buying this camera.", "Date": "December 28, 2013"}, {"Title": "Nice sleek camera", "Author": "xxxx", "ReviewID": "R3436FDWR3XPMM", "Overall": "5.0", "Content": "Very nice sleek camera.  The price for this camera was terrific - purchased the Monday after Thanksgiving.  Not a major issue but there isn't a cable included in the package.  However, you can purchase one for a few dollars.  All in all - great deal and great camera.", "Date": "December 20, 2013"}, {"Title": "great for price", "Author": "Ch", "ReviewID": "RFU11MGZXOEVA", "Overall": "4.0", "Content": "The camera was small and took great pglhotos for my trip to ireland. Would definitely recommend to anyone  in need of camera", "Date": "December 18, 2013"}, {"Title": "okay camera - great for the price", "Author": "Pam J Glavin", "ReviewID": "R1OZY2DCGSS5W1", "Overall": "4.0", "Content": "I paid under $75 for this.  Its a great bargain at that price... but I wouldn't pay more than 100 bux for it.", "Date": "December 16, 2013"}, {"Title": "wouldnt even come one", "Author": "JANICE SCRIBNER", "ReviewID": "R2034PNWELDOL5", "Overall": "1.0", "Content": "Very disappointing . wouldn't work at all .very unhappy with this product .. didn't event get offered a replacement .", "Date": "January 3, 2014"}, {"Title": "Something missing", "Author": "L. J. Woods", "ReviewID": "R4AEXQE726LKT", "Overall": "4.0", "Content": "I bought this camera for my daughter.  It's a very good camera but I have to give it only 4 stars, as it did not come with a memory card and could not be used until one was purchased.  It also did not come with a cord to download pictures on the computer. This also had to be purchased.  I think some kind of mention should have been made regarding the memory card in the product details. You know how items that need batteries will state \"batteries not included\"?  Something like that to make the consumer aware would have been beneficial. Now that she has the accessories she needs, my daughter is loving this camera.", "Date": "May 18, 2013"}, {"Title": "Not a good point and shoot", "Author": "mac", "ReviewID": "R4FM0UOYV6HR", "Overall": "1.0", "Content": "I usually try to not write negative reviews.  In this case, however, I must say that after trying to use the camera for a few days, I ended up returning it.  The settings user interface is not very friendly, so it takes a bit of time to adjust it. Thus, my main problem was that the Auto settings and auto-focus adjusted very slow, and more often than not the pictures have the wrong white balance, they are blurry and out of focus. The 3x optical zoom is as described, but since the pictures do not come through very clear, the 3x optical zoom feels very much like a limitation.I owned a previous PowerShot version and it was one of the best point-and-shoot cameras I've had.  Unfortunately, this was worse.  It's possible I got a defective camera, which would explain all the issues.  Hopefully this review will help you keep an eye on those potential issues.", "Date": "January 3, 2014"}, {"Title": "Canon PowerShot A2600 IS 16.0 MP Digital Camera with 5x Optical Zoom", "Author": "Enrique", "ReviewID": "R30TCP7BWX0OS6", "Overall": "4.0", "Content": "So far so good, Came in the original box. This will be given as a gift for my mother. She will love the color.", "Date": "December 9, 2013"}, {"Title": "Great camera for the price", "Author": "Margaret C. Kostka", "ReviewID": "R122N1T6GVRVUJ", "Overall": "5.0", "Content": "Have had a Canon before. It broke and cost more to fix than this new one.What can I say; my mind was made up.", "Date": "April 25, 2013"}], "ProductInfo": {"Price": "$129.00", "Features": "3-inch TFT color LCD with wide-viewing angle monitor\n16.0 megapixel 1/2.3-inch CCD sensor\nDIGIC 4 image processor for exceptional performance\n5x optical zoom with 28mm wide-angle lens delivers stunning images\nShoot brilliant 720p HD video with a dedicated movie button", "Name": "Canon PowerShot A2600 IS 16.0 MP Digital Camera with 5x Optical Zoom and 720p Full HD Video Recording (Pink)", "ImgURL": "http://ecx.images-amazon.com/images/I/51vWrYT1aAL._SY300_.jpg", "ProductID": "B00AWZ66DS"}}