{"Reviews": [{"Title": "Inexpensive Sony SuperZoom", "Author": "RSD", "ReviewID": "R295O7SOC5707A", "Overall": "4.0", "Content": "This camera was pre-ordered from Sony and it arrived yesterday (2/20/13). I have been very impressed with the Sony Cyber-Shot DSC-TX10 that I bought here at Amazon a little over a year ago in their \"Today's Deals\" that it might be worth the shot to give this a try. The software and hardware components must be very similar since the interface and pictures that both cameras produce tend to be very similar too which can be both good and not quite so good.The good:1. Tough to beat 20.1MP and 26X optical zoom in this price range plus Sony quality.1. Not that I intend to use it but \"Face detection\" works really well in timer mode; there is even a \"Blink\" alert.2. Very good pictures if you back down the EV -0.7 in both \"Program Auto\" and \"iSCN+\".3. Panorama mode has \"Standard\", \"Wide\" and \"360\" which is very easy to use.4. AA batteries !!! They are available everywhere no matter how remote a destination you go.5. Very easy to use for non-camera people.6. Beautiful rear display.7. DRO, Dynamic Range Optimization which is supposed to optimize the difference between light and dark parts of the subject seems to work really well.The not so good:1, The colors are slightly brighter than life so I use the Program Auto mode to correct this and bring the EV down to -0.7 which is not perfect but quite satisfactory. The setting does not keep in \"iSCN+\" mode.2. No hot shoe.3. No High Resolution Panorama mode like the DSC-TX10. The high resolution panorama mode gives you a 43MP panoramic image; this H200 is not even close at 5+MP.4. No Superior Auto Mode like the DSC-TX10. I have not done a side by side comparison with this camera and the DSC-TX10 but I like this feature.In Superior Auto mode, the camera shoots burst images based on the recognized scene, then creates a composite of the burst images (Overlay shooting). The camera automatically corrects the backlight and reduces noise by overlaying images, so a higher quality image results.I look forward to leaving the heavy expensive lenses associated with the SLR with realistic expectations and will update this review as more experience is gained with this camera.Update 3/21/2013:I added some pics on the \"customer images\" showing exposure differences and a few pics taken with this camera.", "Date": "February 21, 2013"}, {"Title": "Good, easy to use, but there are better ones - UPDATED 12/7/13", "Author": "Andrea Polk", "ReviewID": "R2P2ECV86FGDFL", "Overall": "3.0", "Content": "I received this camera from the Amazon Vine reviewer program. Unlike many of the reviewers, I'll not be going into lots of technical information with my review.  While I have used many digital cameras, I don't consider myself a photographer, but rather someone who delights in great photographs.  I am typical of a digital age intermediate user who snaps photos of scenery, pets, family and life events.Supplied in the box was the Sony DSC-H200 Digital Camera with 3\" LCD, a Sony shoulder strap, lens cap, lens cap strap, USB cable connector and 4 AA batteries (non-rechargeable).I inserted a SanDisk 16 GB Class 4 SDHC Flash Memory Card SDSDB-016G-AFFP card I had on hand to check out the camera, but would recommend a SanDisk Extreme 32 GB SDHC Class 10 UHS-1 Flash Memory Card 45MB/s SDSDX-032G-AFFP card for optimizing the camera's performance.First Impressions:The camera is substantial in size - not one you'll toss in a bag or be able to fit into a pocket - and it doesn't come with a case so that will be a recommended purchase along with your SDHC memory card, and perhaps some Energizer CHP4WB4 Recharge Smart AA/AAA Charger with 4 AA NiMH Batteries which are supported.  Ni-Cd batteries will not work with this camera and are not supported, nor are lithium and manganese batteries. (Approximately 350 shots are estimated on one set of fresh AA batteries.)Made in China, the build quality of the camera is on par with others at this price point, but actually seems less well made than another older  camera I own, Olympus SP-800UZ 14MP Digital Camera with 30x Wide Angle Dual Image Stabilized Zoom and 3.0 inch LCD which is similar in size and features.There is more plastic than metal on this camera; housing and controls, and the weight of it is in the lens and LCD 3\" display.  There is no separate viewfinder on this camera, which while quite common these days, means that if your LCD goes out - you have no way of seeing what you're taking a picture of with the camera (assuming it's still operable).Basic Operations:Easy to set-up the directions are small, but clear and easy to follow.Entry level users will like the ability to get started quickly with this camera and that you can shoot both still images and movies in 720p (up to 29 minutes with large capacity SDHC memory card). The ability to shoot panorama shooting scenes with this camera is a nice addition too, and it works well.Scene selection is easy from the pre-sets, or you can leave it on 'auto' easy mode.  Picture effects allow you to shoot photos with special looks that otherwise would take some tweaking with software.Extracted color is fun.  You can select one area of a photo to bring out the color with the rest of the photo in grayscale or muted colors.Automatic smile detection sensitivity can be adjusted, which is helpful if you're dealing with subject that tend to grin more than openly smile!  There is also automatic blink detection, which may be somewhat inaccurate if your subjects have a big grin or eyes that tend to get 'squinty' when they smile.Scene recognition automatically detects your shooting environment and adjusts accordingly.  This works fairly well, but you may find color adjustments are brighter than what you're used to seeing.  This is something that's easily fixed with software on your PC though.For more advanced users, you can adjust the ISO, white balance, brightness, contrast, etc..., too.LCD Viewing:The 3\" LCD is one of the best features of this camera.  Images and videos are easy to view, retouch or delete using this viewer.  Subjects are clear and easy for most to see, versus a traditional viewfinder.OS Compatibility Mentioned in Directions:There is 'Play Memories Home' software that can be downloaded (see directions) to allow you to import still images and movies from your camera to be viewed and shared on your Windows PC.Mac operating systems are not supported, however that just means you can't use thee Play Memories Home software, not that you can't use the camera and do the same thing via your memory card and other software with both PCs and Macs.Likes and Dislikes After Use:I like that this camera is affordable, easy to use and has such a HUGE 26X optical zoom combined with 20.1 megapixels! I also like that it's comfortable to hold and that it produces stills that richly reproduce colors.  I like its super-zoom, rapid fire shooting and panoramic mode capabilities.What I disliked was how poorly this camera did with macro (close-up) and low light (flash is available, but didn't deploy accurately) still photos on auto setting, and its poor video quality.NOTE:  Per another reviewer (see comments), this camera does have image stabilization and worked well without a tripod.  My own tests of zooming and snapping from a distance yielded mixed results, however as is always the case - could be user error more than the camera.For those looking for a digital camera with excellent zoom capabilities, this is a good buy.  Others who want a camera that's an excellent overall performer and are less concerned with the zoom feature, may want to keep looking at the broad range of digital cameras at this price point.Personal recommendation for another similar digital camera option: Panasonic Lumix LZ30 16.1MP Digital Camera with 35x Optical Image Stabilized Zoom and 3-Inch LCD (Black) which while having fewer megapixels, has a great zoom and performs well overall.UPDATE: 12/7/13Right now I'd recommend the Fujifilm FinePix SL300 14 MP Digital Camera with 30x Optical Zoom (Black) - the one I own for a sub two hundred dollar camera. I have enjoyed the quality of the photos I get from it and my other current favorite: Fujifilm FinePix HS50EXR 16MP Digital Camera with 3-Inch LCD (Black), which is about twice as expensive.", "Date": "April 2, 2013"}, {"Title": "Great Starter Camera", "Author": "Kent J. Smythe", "ReviewID": "R2H46KR9IOJMFL", "Overall": "5.0", "Content": "I've played around with the Sony Cyber-shot DSC-H200 for the past three days, to get a feel of it and I'm truly impressed.I have several cameras that I use quite often and they all cost several times the amount of this camera, but it's been a pleasure discovering all the things I can do with this great economical camera.This is NOT a camera where you look at the list of creative effects in the menu and get scared off, once you click on the effects for the first time, it all seems so simple and fun.The DSC-H200 is a wonderful first camera that won't scare the new photographers off, and it has many impressive features to grow on.I was really impressed with the 720p HD movie mode and was doing great movie stuff right out of the box. I played my creation on my 60\" Sony HDTV after burning a Blu-Ray disc on my computer and it looks amazing. Some of my other cameras do 1080 HD, but the 720p looks mighty good.I LOVE the 4 AA batteries that power it up, they last a long time and replacements are EVERYWHERE.The pictures I've been taking look great, the 20.1 Mega pixels make the pictures look like you spent much more on your camera and I LOVE the 26x Optical zoom for really getting in there.I take the batteries out every night and when I put them in the next day, the time & day is still set correctly. This is something my other cameras don't retain and I like it.The bottom line is this camera doesn't cost much and it works great, a fine starting point that will get you excited about camera's & photography and you can buy another Sony with more features down the line as you grow.I Love Sony Cameras!", "Date": "March 28, 2013"}, {"Title": "Good budget Superzoom", "Author": "D. Hentze", "ReviewID": "RATNRVTBFLPIV", "Overall": "4.0", "Content": "The Sony DSC-H200 Digital Camera is the latest superzoom to hit the market, and among the cheapest. It comes with a lot of good features, but leaves out a few found on higher priced cameras. At 20.1MP, it is the highest pixel count superzoom I've seen. Unfortunately, this is a marketing ploy, and the DSC-H200 would have benefited from having much less megapixels due to it's small sensor. All camera manufactures like to increase the megapixel count because the average consumer thinks more is better. Unfortunately, when it some to the small sensors in these low cost point and shoot cameras, the opposite is true.On to the review. Unboxing the camera and setting it up is simple. 4 AA alkaline batteries are included, but I tossed them aside and put in my own Sanyo Eneloop NiMH batteries. The first thing I noticed when opening the battery door is that the build quality isn't great, but it's totally acceptable at this price point. I installed a fast class 10 SD card too. No memory card is included so you'll need to have one. The internal 55MB memory only holds 5 pictures at full resolution. Once powered up, the controls are simple and easy to use. The 3\" 460K is bright and clear. The 26X zoom lens is average quality, but again acceptable at this price point. There are no threads for adding a filter. There is one thing I love about the lens though. It starts at a super-wide 22.3mm. This is by far my favorite feature of the camera. I own a couple other more expensive superzooms, and they start at 25-27mm. This super-wide lens does shorten the zoom distance somewhat, but it's a well worth it sacrifice.After getting familiar with the simple controls, I headed out to take some test pictures and video. I shot about 100 pictures outdoors, under various conditions. I used the iAuto and Program Modes. Program Mode is what I normally use on my point and shoot cameras. I immediately noticed that the camera is very slow to refresh in between shots, even with my fast Class 10 SD Card. This is somewhat disappointing. I took a few minutes of video too, just to test it out. When I returned home, I shout a couple dozen indoor pictures to test the flash and high ISO performance. Battery life appears to be excellent because even with all the shooting I did, my battery still shows as \"full\". Once I finished shooting, I loaded everything onto my computer to see what the pictures look like on my HD monitor. Another positive to add, the Sony DSC-H200 used a standard mini-USB cable instead of a proprietary USB cable. Upon seeing my results, I was truly surprised in both a good and bad way. My outdoor results were much better than expected. The images were excellent. All the fine details were there. Exposure was very good. Colors were very good, if not a little soft. All around, my outdoor pictures just came out great. Even when I did a little \"pixel peeping\", I was surprised at the results considering they're cramming 20.1 MP into a tiny sensor. My one attempt at using the panorama mode didn't come out well, but the results were mainly my fault, and I won't blame the camera. My video came out \"good\". There was nothing about that that stood out. Personally I have no intention of ever using it, but the Sony DSC-H200 is capable of shooting decent 720p video. Finally, onto my indoor results. This is where I was disappointed. The pictures were just plain fair at best. At ISO 400 and above, the pictures were grainy and \"noisy\". The colors looked washed out too. I was probably more disappointed than I would have been if the low ISO outdoor pictures weren't so good. On the plus side, the small flash does work fairly well. I went back and shot some more indoor pictures with the ISO locked at 200, and the flash on. These results are much better if you're taking pictures at fairly close range.All in all, the Sony DSC-H200 is a great low cost camera for taking outdoor pictures, but not so good for taking indoor pictures. With it's lack of some basic features, it is definitely aimed at the budget minded photographer who is going to mainly just \"point and shoot\". There is a manual mode too for those that choose to use it though. I recommend the Sony DSC-H200 as long as you're aware of it's limitations and faults listed below.PROS:Great price and value.Simple controls.Super-wide 22.3mm, 26X Zoom Lens.Excellent results outdoors at low ISO.Good 720p video.Great battery life and uses AA batteries.Good quality 3\" screen.Manual controls.Good iAuto mode.Good built-in flash.Good image stabilization.CONS:Mediocre build quality.Too many megapixels crammed into a small sensor.Fair results above ISO 400.Slow refresh between shots.No RAW mode.No B/W shooting mode.No built-in red eye removal.No optical viewfinder.No hot shoe.", "Date": "March 30, 2013"}, {"Title": "Professional photographer who used Sony Alpha/ Sony Nex loves this camera.", "Author": "Ricky C Pelishek", "ReviewID": "R3K8UPXGJZJXMM", "Overall": "5.0", "Content": "I have retired from my professional photography, and due to my health have sold my gear and downsized to the Sony Cybershot H200.  I do not know what others are talking about when they talk about poor quality, bad focus, and uses too many batteries!That is absolutely not true.  The moment I picked up the camera, it felt like pro cameras I have used, only lighter.  The controls were set up like my other Sony Pro Cameras, and I didn't even have to look in the manual to start using it.  I have been using the batteries that came with it for several hundred pictures and short videos.  They still are at almost full charge!  And I have taken a number of flash pictures with it!The quality of the pictures is great.  I have a 16x 24 print from it enlarged and mounted in my living room.I have had no problem with focusing, or poor exposure.  Of course, you need to know a little about proper picture taking to avoid the problems I have seen listed in other reviews.  The intelligent mode does a great job, so what you need to know is minimal, but you should be aware of using a flash in very low light, using a tripod if using in very low light outside if you are not very steady.  I found you can shoot clear very low light pictures with the anti-shake mode on.  That is incredible compared to any other camera in this price range and 20MP quality. I have a good tripod stance and use a nearby object to lean against, if available, to achieve good very low light results.  I suggest a tripod or mono-pod for very low light shots for someone who is not experienced in holding a camera steady.  In regular indoor lighting, I have found no problem shooting very nice clear handheld pictures without a flash using the anti-shake mode.The lens quality is excellent.  I did not find any issues even when I enlarged the picture on my computer and looked at edge sharpness.  Of course, it does not have a $500 or more pro lens quality, but if I wanted that I would have kept my pro equipment!This camera is designed for the person who wants a little more than a point and shoot camera.  It has the features you can use if you want to learn more about photography or are interested in seeing if you have the skills and knowledge to jump up to a DSLR or  start a career or serious side business in photography.I don't want to make this too lengthy, but from the negative reviews on picture quality/ focus I have read, I can just about point out what the user was doing wrong to get such results.  If you do not want to learn the basics of photography, do not get this camera, get a cheap point and shoot camera.  It will give you the same good results in perfect conditions, and the same lousy ones in conditions that require a little more understanding of photography.  The camera does make you a good photographer, learning the basics and more of photography makes you a good photographer.  A good photographer can take an excellent picture with a basic point and shoot camera.  The more you know about photography, makes you want more features and better quality.The Sony Cybershot H200 is a nice step up from the basic point and shoot camera.  You can still use the intelligent functions, and take great pictures, but you can use the many advanced features to get those tough shots with professional looking results.I just want to comment on a few other things that I read in reviews and interject my opinion.I love that you have to manually pop up the flash.  If I want to take a picture in low light with the natural light, I do not want the flash going off.  I find the option to use the flash when I want to with the push of a button much easier than shutting one off that automatically goes on in low light situations.Just because the unit is light does not mean it is cheaply made.  This is a high quality camera, with a very nice lens. The nice lens adds to the weight, but the camera is nicely balance if held properly.The battery compartment is almost the same as many higher quality cameras.  As a matter of fact, it has a nice firm catch that locks it shut.  I had a non Sony pro camera that had an easy to close battery door, which also opened easily sometimes by accident.  Not what I want in a camera.Having the SD card in the battery compartment is one of those clever ideas that makes it impossible to remove the card while the camera is still turned on and damage the card or the camera.  It is a smart technology design.  There is a reason for it.  I have a huge SD card in it, so do not have to change cards while out on a picture taking spree.The Movie function on the camera is great.  It is intended for that occasional video you take while shooting pictures of someone close to the camera talking, or or like a band playing where you do not have someone in front of you making noise (sneezing,rustling things, etc).  It is not intended for shooting an event.  There is no place to put a external microphone, so you would not use it to tape a wedding or school program unless you were 3 feet from the people.  The microphone is made to pick up sound close to the camera, not across a crowded room.  It would also work best mounted on a tripod if you are using it for more than a minute because most people tend to move their hands on the camera or rub it against themselves which is picked up by the microphone.  This is not a fault of the camera.  It was made to capture short segments or when you want to record yourself or another person in a quiet room, or close to the camera.I give the camera a 5 star rating because it does exactly what it is advertised to do.  That is exactly what I wanted, and it works great.  I do take it out of intelligent mode and use the advanced features for some very professional looking photos.  Of course, I know how to avoid poor quality pictures!  If you buy this camera, make sure and read an article, watch a video, or read a book on taking good pictures in different lighting conditions before you use the camera or write a review of the Sony Cybershot H200,This was long, but hopefully helpful to those looking at getting a great deal on this camera.", "Date": "December 28, 2013"}, {"Title": "Okay camera on the whole, good for the price.", "Author": "Peter Haight", "ReviewID": "R1U2LR34XDL1MZ", "Overall": "3.0", "Content": "Let me just first say: to any people considering purchasing this camera, please read several reviews first! You may find it better to save your money and get a better quality camera. If you're looking for a camera with nice macro and focus, this isn't the camera for you. After taking up photography lessons professionally for a year while I was in high school, I asked my teacher what he recommended. He swears by Sony, and I learned on an older model (the Sony DSC-HX1) of the same style camera. At a first glance, this camera really seems pretty good for the price, which I will admit it is, but don't expect it to be amazing. I bought it in late May as a graduation present for myself, and i've used it almost daily since then, so I've tested almost all the features of the camera. There are quite a few cons, but if you can get over them and see the value and potential in the camera itself, it's quite a bargain.Pros:-20.1 megapixels. Can't beat the megapixels for the price, but they're wasted on such a small image sensor. (Please remember that MP ≠ quality! I learned this the hard way.)-Takes very nice outdoor pictures, provided there's adequate sunlight. Anything else, you'd better start hoping the camera works with you!-26x zoom. Haven't really had the chance to utilize it, but it's nice to have!-Panorama. It's pretty nice, haven't used it a whole bunch, but it's nice. I believe it is up to 360 degrees.-Modes. It has quite a few modes, I like to use the Program Auto Mode or the Intelligent Auto mode for quick shots, such as when I'm at a family gathering, with friends, or at a car show. Also includes a Scenery Mode, with multiple templates to choose from, such as Night Scene, Food, Portrait, etc. Haven't tried all of them, but I was somewhat impressed with the results of the ones that I did.-Optical SteadyShot (when it decides to work)-Comes with strap and lens cover. I've owned cameras in the past that haven't, it's just a small thing that matters to me I guess.-HD video. Although it's only 720p, it's still better than nothing, especially at the price.-Monopod/Bipod/Tripod thread mount on the bottom of the camera.-AA battery usage. Plenty of battery time on regular AA store-bought batteries which rocks. I use rechargable ones, however. They work just fine. Just make sure your battery type is supported!-Multishot function. Supports continuous shooting of up to 100 pictures simultaneously. Haven't figured out long exposure fully yet on the camera, though.-Display. Very nice, crystal clear display. Kind of big compared to my previous camera.-Self-timer. Comes in handy with friends and family around.-Manual exposure and aperture adjustments.Cons:-Very poor image quality most of the time, which is disappointing. Most common when indoors or with inadequate lighting (such as dusk, late afternoon, dawn, etc.) This is a result of a very small image sensor. If you're picky with your pictures, like me, I really wouldn't recommend this. Sometimes i'll have to take ten of the same shot before it comes out the way I want. Next time i'm going to get a DSLR.-Macro function is kind of a joke unless you have super-steady hands to keep the camera from shaking. (Which I don't. I'm sure this isn't just a user error though, as others have reported the same thing.)-SteadyShot feature only marginally works. It's definitely temperamental, which you don't really want from a camera.-Focus is hit or miss. Even in broad daylight, or sunlight, the focus kind of does its own thing (which ties in to what I said about the SteadyShot feature.) It has three ways of focusing and each of them only just barely works. I've had more luck out of autofocus, than I did with the focus modes. It just takes a few seconds, which can be annoying if you're in a hurry to take pictures. Also, holding the button down halfway is \"supposed\" to focus the camera to your mode specifications, however, it's basically a joke. Holding the button halfway activates the pilot light, and shows the shot in focus for about a second before fading away to what it was before. Come on, Sony!-Battery box. Holy crap let me express how annoying this bugger can be! I have a pack of four rechargable 1800 mAH Duracell AA batteries from years ago that still work just fine. But installing them in the battery box the first time you use the camera can be a pain! Until you figure out which way the batteries are supposed to go it can go from confusion to panic (yes, panic. I was worried I got a defective camera.) Then you have to press down super hard on the tab until it closes securely. It's super annoying at first (well, all the time really) but you get used to it.-No manual focus. This was one of my favorite features of my previous learner's camera. I could dial in the focus of exactly what I wanted to see, and it'd work. This one has a barely-working focus.-HD video quality. Although the camera technically shoots in 720p \"HD\" i'd expect more from a 20 megapixel camera, my previous one was 9 megapixels and shot in full 1080p.-Flash. Though the flash works fine, it was confusing to find at first, as there's a button that releases the flash tab open from the camera's housing. Also, sometimes the flash negates the current focus locked in on the camera.-Shutter speed. Sometimes it takes a long while for the camera to actually take a picture, this gets annoying.Final verdict: Excellent point and shoot camera for the beginner, or a master of the craft looking for a fun camera to play around with.Who i'd recommend this camera to: Beginner photographer, somebody who's not a photographer, somebody who isn't picky with image quality. A person looking for a point-and-shoot.Who I wouldn't recommend this camera to: Any sort of professional photographer, somebody who is looking for DSLR quality in a bridge-style camera. Perfectionists.", "Date": "August 11, 2013"}, {"Title": "Somewhat disappointing", "Author": "Yarii", "ReviewID": "R134FP22A33SWM", "Overall": "3.0", "Content": "A month ago I purchased a Sony HX10V camera, so I was excited to be able to try the H200, but now that I have, this camera isn't so great. I know comparing a travel zoom (HX10V) to a heavy bridge camera (H200) is like comparing apples to oranges, but the HX10V offers so much more for about the same price.  However, the H200 looks \"more professional\" compared to my red HX10V.What some consider an asset - I don't. I hate the weight that 4 AA batteries adds to this camera. Sure, you can find AA batteries anywhere if you run out, but I still prefer the lithium-ion batteries.PROS FOR THE H200:> Battery life is good, and AA batteries are readily available.> Sony has finally added the option for SDHC cards, you are no longer limited to using their Memory Sticks.> EASY setting: Limited choices, large print - this setting would be perfect for an older person or anyone with vision problems. Other than the Easy Setting, your best bet for most users is iAUTO, the limited manual controls, or one of the Scene Settings.> Manual pop-up flash.> Comfortable neck strap, you will need one due to the heaviness of this camera.> In-camera guide, doesn't take the place of a full-blown instruction manual, but it helps.> Sony cameras have one of the best Pet Scene settings, which automatically disables the red focus assist light and the flash so your pet is not startled. (You can choose the flash if you want, though).> PlayMemories software. User-friendly. No CD is included; the first time you connect the camera to your computer, it downloads the latest version from the internet.CONS FOR THE H200:> I had a hard time getting it to recognize a macro shot, as it's supposed to in iAUTO. Also macro focus distance with this camera is a higher distance away than other cameras. Usually there is a dedicated macro button on the control wheel but on THIS camera that is missing and the Smile Shutter setting is in its place.> Photos need a little tweaking. I find the colors not as vibrant as I'd like, and they also need sharpened slightly.  (With my HX10V, no post processing needs to be done, maybe cropping, but that's it. I uploaded a photo here of the H200 inside a Case Logic case, that photo was taken with the HX10V.)> Battery/SD card door is hard to close.> Not good in low light as compared to my Sony HX10V, which has a CMOS sensor.> Not full PASM manual; only P and M. You do have some manual choices such as metering, etc., but there is no Aperture or Shutter Priority.> Lens cover must be manually removed, something I forget to do--you get a message on the LCD to turn the camera on again.> 20 MP! Bigger is not better, especially with the small sensor this one has.> 26X optical zoom will not do you any good unless you have a tripod or something to stabilize the camera.> No full printed manual unless you go online for it. There is a small quick-start manual, but it's very basic.> HD video is only 720p and no HDMI port.WHAT MY OTHER SONY DOES BETTER: I think the HX10V is a better choice of the two cameras.> The Sony G lens - same lens used on Sony's more expensive cameras> 1080p video, choice of AVCHD or MP4> Black & red cameras are made in Japan (white camera in China, not sure where the silver one is made)> BSI-CMOS sensor compared to the CCD sensor in the H200. CMOS sensors are better in low light situations.> Dedicated movie button> Dedicated Background Defocus button on the dial - I am happy with not having full manual control as long as I have this on a camera.> GPS> 3D sweep panorama as well as 3D photos> The HX10V has more Picture Effects, such as Watercolor or Illustration, which are done in-camera so you still have the original photo.Bottom line: You will probably like the H200 if you're a person who likes Sony cameras and you don't want a small point & shoot. If I wouldn't have already known how great the HX10V is, I would have rated this 4 stars, but frankly, I'm a little disappointed with the H200.If you are looking for a case for this, I highly recommend the Case Logic--I have a Panasonic FZ150 and this fits perfectly with room to spare for extra batteries:Case Logic DCB-304 High/Fixed Zoom Camera Case (Black)And you will need a Class 10 SD card for the best response on video, etc.Transcend 8 GB Class 10 SDHC Flash Memory Card (TS8GSDHC10E)Link to the Sony HX10V Camera:Sony Cyber-shot DSC-HX10V 18.2 MP Exmor R CMOS Digital Camera with 16x Optical Zoom and 3.0-inch LCD (Red) (2012 Model)NOTE: See comment section for a link to the full-size instruction manual.", "Date": "March 24, 2013"}, {"Title": "A great camera", "Author": "Tim Allen", "ReviewID": "R1HX2SXKMLO1TC", "Overall": "4.0", "Content": "I like it very much as it is an upgrade from the 12MP 20x Canon PowerShot SX 120 IS that was slowly falling apart after several years of use. I do miss the Canon's vari-angle screen but, as a digital artist, the fact the 20MP allows me to print much larger images is a real plus and makes up for that. I also like the ease of transferring images onto my computer without having to remove the memory card, something I had no choice but  to do with my Canon.Overall, it is a great camera and is a lot of fun.", "Date": "October 21, 2013"}, {"Title": "Sony DSC-H200  More BLUR than not!", "Author": "km boise \"km boise\"", "ReviewID": "R2S2QNIZP6Y014", "Overall": "2.0", "Content": "I am writing this review to warn shoppers that this model is not, as the Amazon site notes, \"a newer model\" for the Sony Cyber-shot DSC-HX10V.  Based on that statement I bought this to replace the DSC-HX10V (which sadly, I lost) and am grossly disappointed.  Even the Sony website, which I checked before purchasing states that this camera has Optical SteadyShot image stabilization - but at least 3 out of 5 images I shoot are blurry.  The DSC-HX10V gave me a perfect zoom or close up without problem.  I wish Sony had continued producing that camera rather than representing this camera as a product which will \"Say goodbye to blur\".  I am returning this camera today.", "Date": "October 4, 2013"}, {"Title": "3-4 Star Budget but Nice ZOOM camera", "Author": "LG \"*\"", "ReviewID": "R1X0FS63187QRD", "Overall": "3.0", "Content": "I would give this camera 3.5 stars if it were a choice.I have to say right off the bat that the Zoom (26x) on this camera is awesome for this price range and the 20mp as well.  I love taking photographs and have 5 different cameras to \"play\" with but am not a pro by any means.It has no memory card so if you buys this, pick up a class 10 SDHC card(I had a 16GB already).  It will only take 5 high quality picts without a memory card!The camera does come with four basic batteries but not much else.  I would buy AA rechargeable batteries along with that memory card!  It has a thin shoulder strap, camera lens cover & strap, and a USB cable included.Pros:1. 26x Zoom2. AA batteries are readily available-no specialty batteries needed3. light weight4. Decent price5. good outdoor pictures6. Face Recognition7. Easy to Use & Basic, nothing fancy8. 3\" display screen is nice9. image stabilization10. Panorama setting11. fun editing optionsCons:1. Difficult to open battery case...use 2 hands, slide unlock button & slide cover outward as well~then it will pop up. I expect this will break.2. Slow to take repetitive pictures...lag time between picts is too long & this really bugs me!3. Flash response is slow4. Only the display screen to eye-view-finder5. Very basic-a few settings but nothing very fancy6. Plastic Camera mostly(bad and good)7. Indoor pictures not great, grainy & poor quality8. When I got this it was listed as two hundred fifty..I think there are better options for other brands in this price range.This is a decent camera but I cannot honestly say I love it.  It is a great beginner camera or \"basic\" camera.  My son, who has never had a camera before does love it, but he would love any similar camera.I have taken some great outdoor pictures with this camera but not indoor!", "Date": "May 14, 2013"}, {"Title": "Not a fan of this camera", "Author": "FlamingoNut \"Tracey\"", "ReviewID": "R3R5ACQO2ZB7SY", "Overall": "2.0", "Content": "This camera reminds me of another that I own, a Kodak Easyshare Z5010, in both style and functionality, and that isn't a good thing.I'll start off with the basics.  The zoom is impressive.  The bulkiness of the camera is exactly what I want in a camera.  I'm not a pocket cam person and like the feel of a nice sturdy well built machine that feels good in my hands.  It uses regular AA batteries, rechargable or alkaline, BUT, the compartment is a pain in the neck to open and close, EXACTLY like my Kodak.  Plus, the SD card compartment is only accessible by opening the battery compartment.  I hate plugging the camera in to offload my pics and love that I can just slide the SD card into the reader provided on my pc.  I dread the thought of opening & closing the battery compartment.  I don't even want to deal with that when I need to change the batteries!  Another major annoyance for me is the lack of a view finder.  I admit to being old school when taking pics; I prefer to look through the view finder and not deal with not being able to see the darn LCD screen, especially in bright light.I'm also in the habit of comparing this camera to another Sony, a Cyber-shot, which IMO, is the best camera I have ever owned, the DSC-HX30V (comparable to the HX20V as well).  I tried hard not to do a comparison, but each and every time, I ended up doing just that.  That camera takes phenomenal pictures, even in low light.  Compared to that camera, this takes lousy shots.  Some shots don't focus properly.  Low light shots are blurry.I've been playing with the Sweep 360º function and have yet to get one that is a perfect 360, but it's still a cool feature.All in all, I would not recommend this camera.  Other than it being easy to use, it just doesn't take good enough pictures.  Even as a starter camera, I just don't think I'd be happy, and there are plenty of other options to choose from for the money.  My 12yo also loves taking pictures and does a great job.  She has also played with and tested a few of my cameras, and this one is also on her least favorite list.  I expected more from a Sony product, especially since I own another Sony camera.", "Date": "May 15, 2013"}, {"Title": "Love our Cybershot!", "Author": "Linda Nearing", "ReviewID": "R3AQXRNZ0ONWSO", "Overall": "5.0", "Content": "Did everything expected of it and more; great quality for little money.  We are Sony lovers, that's for sure.  Have had many digital Sony cameras in past.", "Date": "November 20, 2013"}, {"Title": "Buy It", "Author": "thatguydowntheroad", "ReviewID": "R19J37E2IFBLHB", "Overall": "5.0", "Content": "Great camera that is easy to use, and 26x zoom is phenomenal! Chrystal clear photos at full zoom!! Do yourself a favor and buy it!", "Date": "August 24, 2013"}, {"Title": "Love it !", "Author": "Brad Baughman", "ReviewID": "RPOQ2WQP3E6P5", "Overall": "5.0", "Content": "Was looking for a nice camera at a reasonable price and this fit the bill.My wife and I went to a fireworks show the other day and I tested the video mode and the auto focus is amazing !Worth every penny.", "Date": "August 1, 2013"}, {"Title": "This is a fun camera", "Author": "James A Golan", "ReviewID": "R1RKB5PGKYWKTG", "Overall": "4.0", "Content": "Is it a little slow in low light yes and are there limits to steady shot with thezoom lens at max but in  normal light without the subject not playing sportsor running  then this is fun camera with a lot to recommend it. It has a greatpanoramic mode and point and shoot mode will cover a lot of situations.A generation ago cameras would seem to take forever to take for ever to focusin low light if you don't use the maximum of the zoom lenses it is really quick bycomparison. I did a panoramic view at sunset and was very pleasantly surprisedby the cameras ability to use the available light.", "Date": "July 27, 2013"}, {"Title": "Good for the amateur photographer", "Author": "Jeggicah", "ReviewID": "R3FBIOK8S1I1UP", "Overall": "5.0", "Content": "Good camera with lots of options for the unprofessional. Was pretty happy with the zoom effect and clarity of the pictures", "Date": "November 13, 2013"}, {"Title": "Exceptional Performance & Value", "Author": "SevereWX", "ReviewID": "R1GHD5NRDSQZU0", "Overall": "5.0", "Content": "The Sony CyberShot DSC-H200 camera is an interesting camera. For starters, the DSC-H200 offers 20.1 Megapixels, which is the highest pixel count I've ever seen in a point and shoot camera, and especially surprising considering its position in Sony's current camera lineup. While such a high megapixel value worried me that the noise levels would be increased, I found the noise exceptionally well controlled, proving usable images all the way across its provided ISO range. I find it actually offers lower noise than the cameras of two generations ago that had only half the resolution.The camera offers extremely high zoom, which is usable handheld even at its longest focal length, thanks to the included vibration reduction technology. Optically however, the lens at its longer zoom ranges begins to get a little soft, even when mounted on a sturdy tripod, but not so soft that images would be unusable. I actually find the optical performance impressive, especially considering the affordable price point of this camera.All of the features of the DSC-H200 work quite well, from the intelligent scene recognition, blink detection, smile detection, and so on and so forth.  No need to go into detail over each of them; suffice it to say they all work as advertised.Even the 720p video capability of the camera is quite good, though the microphone doesn't seem to pick up softer voices very well from more than 5 or 6 feet away. This may actually be a benefit to some situations though, as you'll wind up with videos with less background noise present.  It should be noted that the microphone is limited to monaural only.Some of my favorite features of the Sony CyberShot DSC-H200 are the night scene modes, which when used with a tripod offer excellent exposures without all the guess-work or need for bracketing exposures. This is a fantastic camera to use for fireworks, Christmas lights, city nightscapes, and so-forth.The Sony DSC-H200 offers exceptional performance and value that will undoubtedly put it at the top when compared to competing models.", "Date": "March 28, 2013"}, {"Title": "not for a pro, but occasional user to newbie", "Author": "southndixie \"knowitall\"", "ReviewID": "R3FEK1F7NOWGDV", "Overall": "4.0", "Content": "no viewfinder but nice large display, I like a camera that snaps a picture when i press the button, this will not, it takes almost 2 seconds and then I miss my shot. Has nice bracket shooting [100] so if you must just try and get it that way, then expect to delete 50% of your take, outdoors on a nice bright day very good and fast, but inside with moving people and it has to take about 2 seconds so fast it is not, large MP quality is very good but lacking most quality from older cameras. I've used Sony for about 18 years so I like their cameras, but this one falls short IMO. pros look elsewhere as it is too slow to be considered", "Date": "December 28, 2013"}, {"Title": "Very pleased", "Author": "E. Ziman", "ReviewID": "RD3P91GDU74DY", "Overall": "5.0", "Content": "I picked this out after playing with a model in a store.  It turned out to far exceed my hopes and expectations!I am not a photographer. Mention the word 'aperture' and my eyes glaze over. Cameras are one of the few electronic devices that I want to be smarter than me, and this camera is a rocket scientist.My first few photos were of flowers blooming around the yard.  I got some awesome, vivid closeups.  Then we went on vacation.  I got some great scenic photos in the Colorado Rocky Mountains, and a chance to play with the panorama setting.  I have also developed the habit of taking photos from the closed window of a speeding car, and this camera delivered.  (Seriously, the speed limit where I was was 75 mph.  I still got some decent shots!)  You can see samples here: [...]  (What happened?  I thought users could add photos to products?)This is the first camera I have owned that can take photos in a cave.  So very pleased.", "Date": "July 24, 2013"}, {"Title": "Great Camera", "Author": "Cuiya Tan", "ReviewID": "R3BKC7AFWYV997", "Overall": "5.0", "Content": "I just got this camera at the Target yesterday. This camera is good for short range and long ranger. Especially I have to take a bunch of pictures for my fine jewelry engraving tiny letters and post on my website and advertisements. And ONLY this camera can do that. I tried Cannon and Nikon, even they have more optical zoom and the price is similar to this one or more expensive than this one. Unfortunately, they don't work for me The closer I get, the less I see these tiny letters on the picture. These types of cameras are good for long range. One thing I love Sony Cyber shot, because they could focus on the objects so well.The most important thing is depends on what you need the most.", "Date": "July 24, 2013"}, {"Title": "Good camera", "Author": "Bill Garvin", "ReviewID": "R2KXY98IEFFYDE", "Overall": "5.0", "Content": "This Camera takes wonderful pictures once you get the hang of selecting proper picture and flash settings for environment and lighting.", "Date": "July 2, 2013"}, {"Title": "Great Camera", "Author": "Melissa Jewels", "ReviewID": "R1JEXK6364KG5T", "Overall": "4.0", "Content": "Not a fan of the program that comes with it, so I just didn't use it. But this camera is perfect and takes amazing pictures..nice and BIG and clear..wonderful!", "Date": "October 13, 2013"}, {"Title": "A good starter camera, but nothing fancy.", "Author": "Dave Holdcraft", "ReviewID": "R3S2W3VKX7VAA2", "Overall": "4.0", "Content": "I bought this camera for just what it is: A starter camera. I'm just getting into taking photos strictly as a hobby, and wanted something better than what my smartphone has.I'll start with what I like about this camera-First off, I like the simple and straightforward user interface. Not being an absolute camera expert myself, I find the functions and menus easily navigable. It's a plus that tis camera runs on readily available AA batteries. I also like the 20.1MP resolution for the fact that it produces pretty sharp pictures. For example, a close up shot I took of a flower pot details even the finest color variations throughout the whole frame. In addition, I'm pretty happy with the flash. I've read a few reviews that say there is a flash delay, but I haven't noticed much of one myself. I did notice that the shutter speed seems to get faster when using the flash. I tested this by taking pictures of a ceiling fan running at medium speed both with, and then without the flash. Using the flash, the fan blades appeared to be stationary in the photo. But, without the flash, the fan blades appeared blurry. This holds true in all modes of photo operation that can be selected on the mode dial. the computer software is easy to install and use as well. Finally, I like zoom capabilities, (26x optical/52x digital) and the variety of mode and picture options available to the novice user.Now for what I don't like so much about it-First off, the camera doesn't give the option to shoot grayscale (black&white;) pictures. Some of the neatest photos are shot in grayscale and that left me a little disappointed. Also, the camera lacks a viewfinder/EVF. Having used my smartphone as my camera for a few years, it's nothing new to be limited to just the screen display, but it's something to consider when choosing a camera. As I mentioned before, it's nice that this camera runs on AA batteries, but there is a caution-Reading the user guide, it recommends only alkaline LR6 batteries or NiMH rechargeables. For whatever reason, Sony recommends against using lithium batteries with this camera.Overall, this is a great starter camera, but it does have it's limits. Certainly not a bad point-&-shoot with good zoom for the money. If you are a more demanding/experienced photographer, make this your back-up camera, or put the money toward a good DSLR.", "Date": "June 24, 2013"}, {"Title": "Nice budget camera with a few issues", "Author": "OlyNomad", "ReviewID": "R31J055AJD8T9R", "Overall": "4.0", "Content": "I have a nature blog and have used Sony Cameras for almost a decade to capture shots for it and been pleased with the image results.  Lately though I'm not that impressed with what they are putting out. I bought the HX200V and it was a beautiful camera, but couldn't even focus in on a duck to save it's life.  I picked this H200 up and have tried it out over the last month and found it took better shots than the more expensive HX200V, but if I had to describe the camera in one word it would be average.  The image quality is average (best results are outdoors on a clear weather day, you get some nice shots there.  Any other weather or indoors the results are less impressive), looks are average. If you just need a basic camera this will do fine. And really at this price it's unrealistic to expect much more out of the camera. If you are into birding, nature, etc...I'd keep looking. It takes too long between pictures to refresh or if you need to change settings there is a serious lag between functions and that is frustrating when out shooting nature shots that aren't going to pause and wait for your camera to catch up. The battery dept. is awkward to use.Overall, nice budget or beginner camera.", "Date": "April 15, 2013"}, {"Title": "DSLR Look but subpar performance!", "Author": "rbhatta \"A Dinosaur you can trust!\"", "ReviewID": "RKE17I2TEKZFC", "Overall": "3.0", "Content": "There is no doubt that this camera is for budget conscious people who would like to venture out into world of digital photography. This will surely make you feel that you are carrying a DSLR around your neck and look cool. This camera however is not going to win any award nor can rival any Sony's Alpha lines of DSLRs or Canon DSLRs like the Canon 60D. The lens is of fixed type. It has wide angle and extreme zoom (26x) features. It cannot be removed or interchanged like what I have seen in the past with the Sony NEX-F3 models but boasts super high zoom with Optical SteadyShot image stabilization reduces blurs to some extent.Having said, there are some \"good points\" in the camera that most other brands in this price range cannot offer those are but limited to Sony's Intelligent Auto mode which does a fairly good job with the scene types and automatically configures the camera to take a photo. Most consumers who are new to digital camera photography will find this feature very useful and it does take good photos with minimal knowledge of photography. The menu system on the LCD guides you and prompts you to pick the scenes if you do not like Auto which works very well and takes decent quality photos.Another good thing which amateur photographers would definitely love is the ability to use standard AA batteries, no need to worry about a charger. Just purchase AA batteries when they die (which are available almost in any store) when you are out on vacation. Sony also included the capability to use standard SD/SDHC memory cards and these are inexpensive and easy to get in any electronics store.Here are some of the still resolutions that this camera can capture:1. 5184 x 3888 (20.2 MP, 4:3)2. 5184 x 2920 (15.1 MP, 16:9)Most of us do not print the photos unless they are nice and needed to be shared with family members without a PC or Tablet. I personally prefer the 16:9 ratio images as these tend to fill my TV in the living room accurately even though it is not the highest resolution. The 16:9 wide also fits nicely on 10.1 tablets. The camera also is capable of capturing Hi-def 720P video 1280x720, which is not the 'greatest' quality but still very good. It does add some amount of lens motor noise when you zoom in and out onto the microphone which I found annoying.PROS[+] Decent quality photos with 20.1 MP resolution for the price[+] AA batteries are easy to find and replace[+] Large easy to use LCD display with intitutive menu system[+] Feels like DSLR and while it is heavy it's got a good grip and shoulder strap included[+] Optical image stabilization works relatively well for short close-ups[+] Flash works great! and takes good photo indoors when used appropriately[+] Uses Standard SD/SDHC memory cardsCONS[-] No optical viewfinder (Too much to ask for this price range)[-] Macro photography is not that great[-] No HDMI port and the USB cable is properitery[-] You need to have a very steady hand for taking extreme zooms Tripod needed[-] Flash has a manual button it does not auto pop out when taking photos[-] Lens cover must be manually removed otherwise it will damage the lens - watchout for this[-] AA batteries while convenient it adds a lot of weight to the already bulky body[-] LCD preview is grainy at extreme zoomsMy personal feedback on this camera is that while the camera *does* have all the basic needs for amateur photography and will suffice for casual users but this definitely is not for serious photography enthusiasts. I would rather buy a DSLR by spending little more and get super high quality photos sacrificing the extreme zoom that this camera boasts. IMHO, if you compare the photos taken with this camera and some high end DSLRs like Canon 60D you will find that extreme zooms which are well past 10x tends to be blurry anyways as it needs super steady hands or on tripod. Some of the high quality images from DSLRs can be digitally zoomed (Post processed in a PC) and cropped later on giving the same zoom effect offered by extreme zoom lens cameras.I would rather go for a smaller camera that has about 5x to 10x manageable true 'optical zoom' which takes steady photos which is easy to carry rather than lugging this quite large DSLR type body which happens to be not a DSLR! not to mention sub-par subcompact pocket camera performance in most areas!My suggestion is to keep shopping as there are better ones that SONY makes for this price range which are less bulky.", "Date": "March 29, 2013"}, {"Title": "Great Zoom for Price but Image Quality Suffers a Bit", "Author": "jt", "ReviewID": "R346GAVTQOILR2", "Overall": "4.0", "Content": "If you are a casual picture taker looking for a camera with a big zoom lens but don't want to invest too much money this is good choice.  Very affordable, good zoom, easy to use.  I pretty much just take pictures of my kids and I wanted a bit more zoom for their sporting events and this works great for me.  The Sony Cyber Shot H200 is a very affordable super-zoom digicam sporting a 26x optical zoom lens and Sony's Optical SteadyShot image stabilization. It also includes a 3.0-inch LCD and Intelligent Auto shooting mode that make it simple enough for anyone to use. The 20.1-Megapixel image sensor could be better in terms of image quality, there is way too much noise, even at the lowest ISO settings.  I also find the camera a bit slow in terms of changing settings and making adjustments.  I often find myself waiting for the camera to get ready when I make a setting change.", "Date": "May 16, 2013"}, {"Title": "Super Zoom, Super Features . . .", "Author": "A Gamer at Heart", "ReviewID": "R16T42GPQ0YGDE", "Overall": "5.0", "Content": "I am a layperson when it comes to photography. I take pictures of my family around the house and on vacation. I tend to stick with the modes that automatically adjust color settings, exposure, white balance, etc. because I am usually satisfied with the picture quality. I tell you this so you can gauge the utility of my review accordingly.This camera is not a pocket camera. It houses a substantial 26x optical zoom. The \"H\" in H200 indicates it is a high zoom model from Sony. The trade-off for the size is the zoom capability and it features Optical \"steady shot\" to correct for unintentional movement so you can shoot a decent photo while moving a bit. The size also accords better handling - I love the way the camera feels in my hands. I am right -handed so the protrusion with the shutter button on the right side of the camera, and its subtle, finger grooves in front, offer a nice feel and grip. With two hands it is easy to steady the camera, and it is also easy to zoom and shoot with one hand, especially if you are right handed.You can only frame your shots via the 3-inch, high resolution LCD view screen on the back of the camera. There is no small viewfinder for you to look through with your eye. The screen is huge and bright and easy to see even in daylight.  There is no case so you'll need to pick one up if you don't already have an extra.I would carefully consider how you expect to use your camera before you buy this or any camera. My usual preference is a small camera with a built-in rechargeable battery because I like to keep it in my shirt pocket or on my belt in a small case for easy access and carrying convenience. (I use the Sony DSC-WX150 for this purpose). If you likewise want a small point and shoot then this is not the camera for you unless you don't mind carrying it in a carry case or from around your neck. If you don't mind the larger size, and expect you will be photographing distant subjects (kids in sports, animals on vacation, etc.) that will really benefit from the super zoom, then this camera is a good choice.Keep in mind this camera uses AA batteries rather than a built-in battery. To me, this has pros and cons. The pros include easy access to additional batteries on vacation wherever you are. The cons include the increased size of the camera to accommodate the batteries, and the need to carry extra batteries in your bag in case your charge dies while you are out shooting pictures. You also have the extra expense of purchasing batteries for the life of the camera unless you purchase rechargeable AA batteries.  But, when travelling, you won't need to bring a charger or voltage adapter, nor worry about keeping the battery charged as long as you have access to AA batteries.Intelligent auto shooting mode chooses a scene mode based on what the camera detects in your scene. I love this mode - you just point and shoot and the camera determines the optimal settings. Within this mode you can add a secondary level that, when it senses a certain type of scene (low light, etc.) it will take two pictures with slightly different settings. You can then decide which one you like the best. Nice.Program mode is also automatic, but offers some setting controls that you can research with the built in help guide.  There is also a full manual mode if you really want to do your own settings. There is also a Scene Mode where you can select the best preset mode based on your settings: Soft Skin (which enhances skin), Soft Snap, Landscape, Night Portrait, Night Scene, High Sensitivity, Gourmet, Pet, Beach, Snow and Fireworks. There is also a Panorama Mode which allows you to pan the camera while you move in a 360 degree circle and it stitches the images together for you. I used this quite a bit on vacation and the stitching is flawless. You can choose the direction of movement (left or right), whether to use standard mode or wide mode, and the degree of the panoramic sweep. Again, very nice.The camera can shoot video at 720p HD.  The video quality you can get from the camera is pretty amazing. Keep in mind video takes up a ton of space, so you will need a class 10 SD card or higher speed Memory Stick Pro Duo card. I like the class 10 SD cards sold here on Amazon. I would get at least a 16GB card (preferably a few of them) to make sure you don't run out of space on vacation while shooting movies and pictures.  There is a small, not terribly powerful flash. If I was shooting indoors and didn't need the zoom of this camera, I would just use my smaller Sony.This is a nice, affordable camera that produces high quality images and movies. It has the look and feel of a DSLR but without the attendant price tag. I took a ton of pictures with this camera on vacation and was very impressed with the image quality. I'll upload some samples for viewing up above. The noise level, even on super zoom pics, was not noticeable to my untrained eye. I also really like the built in help guide. You simply press the question mark button on the back of the camera and a very intuitive guide shows you the answer to whatever you need to know about operating the camera. With a ton of features and options (including an easy mode that makes picture taking idiot-proof), you can be as involved or uninvolved in the camera settings as you like. I used the automatic modes while learning about all the other features as I went along and was quite pleased with the results.While the size is still a bit large to me, all around me on vacation were people with much larger cameras (DSLR cameras) or sadly, just their smart phones. I intend on bringing both this and my smaller Sony with me on vacation, and will take whichever one best meets the needs of that day.You can't really go wrong with this high-zoom camera at this price.", "Date": "May 14, 2013"}, {"Title": "It's an ok camera", "Author": "Cathy Nelson", "ReviewID": "R1D26NO92RN79M", "Overall": "3.0", "Content": "Pictures from this camera are very good.  It took a while to become accustomed to taking pictures with it - it was quite a bit different from my original Sony camera (unfortunately, no longer available, of course).  The one thing I did not like at all was that this camera took regular AA batteries - we were having to change batteries twice a day on a trip West last summer.  I was not expecting this inconvenience and additional cost to owning this camera.", "Date": "April 5, 2014"}, {"Title": "Slow reacting, but great pics", "Author": "DryCreek", "ReviewID": "R2PAPE9I08GBVH", "Overall": "3.0", "Content": "The Sony Cybershot H200 is a nice little camera that takes very nice photos, but its slow response and processing times are maddening! If you need to get a quick pic of a once-in-a-lifetime moment, don't use this camera--you'll still be waiting for it to come on!", "Date": "February 24, 2014"}, {"Title": "Nice camera for the money takes great pictures", "Author": "Angela", "ReviewID": "RX0I13GYA5DZ9", "Overall": "4.0", "Content": "This camera is really nice for the amount of money I spent for it. It was a gift for my boyfriend an he loves it, the HD is awesome the pictures come out so nice there was someone who wrote a review that it didn't take great indoor pictures but I think it takes great indoor pictures and the zoom is awesome my boyfriend couldn't believe all the things this camera does. We have horses so we are excited to take nice pictures of our horses outside an have fun with the camera if your a photographer obviously you would get a more expensive fancy camera but for anyone who just wants to take nice pictures an some video for your family an memories this camera is awesome.", "Date": "January 3, 2014"}, {"Title": "Panoramic is really cool", "Author": "F. Lassname", "ReviewID": "RTZ4H1Q0VWQ4Z", "Overall": "4.0", "Content": "TECHNOLOGY ADVANCES : family catches up. Ghastly lots of features and easy flash choice. Takes Aa batteries so its still likely to have power unless you forget spares.", "Date": "December 29, 2013"}, {"Title": "Sony Cybershot H200 20.1 MP 26x Review!", "Author": "S. M. Miller", "ReviewID": "R3JVB1FI1L492A", "Overall": "5.0", "Content": "Sony Cybershot H200 20.1 MP 26xI got this camera for Christmas. I considered the Nikon L320, as there was a great deal on target for that model, however i ended up receiving this. I am an amateur photographer and I must say this suits my needs greatly. If you are looking for a camera with great picture quality and mediocre video quality this is for you.Picture Quality:At 20.1 MP you have a lot of detail. As an amateur who knows little about photography, I use the automatic \"intelligent auto\" settings on the spin wheel. I never messed with custom ISO settings and such so I cannot give you a great review for a more experienced photographers. What I can tell you is that I needed a camera with sharp image quality for taking car photography. I have a link to 2 photos I took with this camera. Of course they were edited, but it shows what this camera can bring.Here: [...](the first two in the link are shot with this model. The rest were shot with a cheaper Fujifilm.)Video Quality:I am currently in the works of editing a car video with this camera and i am more than pleased. This camera produced great quality for videos. If you are just someone who needs a sharp camera for youtube videos and such, this is for you. I will say that shooting in low light with this camera, i found the videos (and pics) to be have noise. But in good lighting (day time) this camera shoots great video. The semi wide lens gives a more professional look as well. I will supply a link when the video is complete.Hardware:Camera is solid. Nice grip. Slightly large and heavy but this is a camera i needed not for traveling. The feel is nice as well. Internally, I do not know very much about camera, however i do notice that the autofocus on the camera can somewhat be annoying at times. it likes to grab hold of almost anything. But overall the autofocus isn't bad. Zooming on this camera is great with the 26x. I can pic up nice quality at far range.Conclusion:If you are someone who isnt a professional photographer and simply wants a camera to produce amazing sharp pictures of your car, hobbies, or even for some traveling, on a budget, this camera is without a doubt for you.I can say if you are an amateur and are looking for a place to start, this may be it.Hope my review helped a bit. Again, this review was targetted for the amateurs in the crowd, versus semi-pros.", "Date": "December 29, 2013"}, {"Title": "Very nice camera", "Author": "A n A Gma \"KLL\"", "ReviewID": "R8HJADKSP6SGL", "Overall": "5.0", "Content": "Great price and works great.  Only thing missing is a \"sports\" setting, but everything else about it is perfect.  Love it and recommend it.", "Date": "December 28, 2013"}, {"Title": "Perfect purchase", "Author": "Paul Makungu", "ReviewID": "R7E10L6VPLM8A", "Overall": "5.0", "Content": "Its as perfect as described, it is a perfect buy for me and i am enjoying it and the pictures.", "Date": "December 21, 2013"}, {"Title": "Average- Good for outside pics not best video", "Author": "D. Everett \"Musiq11\"", "ReviewID": "R39OQ886HUIZZ6", "Overall": "3.0", "Content": "It struggles to focus and while focusing it is pretty loud. If you finally get it in focus the pictures are MUCH better than the Nikon l820. The time between pics and shutter lag is prehistoric. I think it will be good for my daughter though for outside pictures.As far as video it has to be the worst so far. It constantly wants to keep re focusing and the LOUD focus noise will pretty much ruin any video. Bought this for pictures so I think we will be ok.Update. I raised the review 1 star. The pictures outside and zoom are impressive. Not a dslr but definitely pretty good. Time between pics waiting for camera to reset is still annoying. Not sure how sony let this one go.", "Date": "December 17, 2013"}, {"Title": "Great camera!", "Author": "Jessica", "ReviewID": "RNF2SAC7NB7WU", "Overall": "5.0", "Content": "I just got this camera about a week ago and it's a great camera. As with everything there are pros and cons to it. The picture quality is fantastic! And the zoom is flawless. I can take pictures from an acre away! Videos are good, however when I was taking videos at my sons first strings concert, the video kept auto focusing and it kept going in and out of focus. Thankfully, during the strings portion, the video was perfect. Possibly because they were on the floor and closer (???). When the chorus went up, they were on stage and that's when the video wasn't very good. It was kind of aggravating because I was designated videographer. Is there a way to make the video clearer in future videos? Or at least make it quit going in and out of focus?", "Date": "December 6, 2013"}, {"Title": "Excellent Product", "Author": "Carol A. Taylor", "ReviewID": "RHQ8CLP86JPY7", "Overall": "5.0", "Content": "I have really enjoyed using the Sony Digital Camera. I chose it for the quality and price. It takes the best pictures I have ever made. Thank you.", "Date": "October 29, 2013"}, {"Title": "Sony Camera", "Author": "Larry Miltenberger", "ReviewID": "R35Y8Z81B95NI8", "Overall": "4.0", "Content": "We like the camera as it is easy to use and takes different types of pictures.  The quality of pics are good.", "Date": "October 10, 2013"}, {"Title": "A really great product", "Author": "C. Hume \"Mathguy\"", "ReviewID": "R21U7178KMEMB3", "Overall": "4.0", "Content": "We bought this camera recently before the birth of our first child when we found all of our other digital cameras had decided to brick themselves from disuse.This camera was great, the picture quality was very good and overall it was very easy to figure out.  There are maybe a few settings that I would like to change that I wasn't able to find (not necessarily a lack of the camera), but overall I think this camera is probably the best one I've owned to date.", "Date": "May 30, 2013"}, {"Title": "Really just your basic zoom camera", "Author": "Kiyo M.", "ReviewID": "R3I7JDYKNSBOZ8", "Overall": "3.0", "Content": "For a beginner or someone new to digital cameras, this is a nice start. For power users, this camera will feel a bit too basic and there are much better alternatives for the price.Pros:- Nice sexy design; it looks more expensive than it is/performs (it is plastic, but nice grip and feel)- 26x Zoom (however, there are cons)Cons:- Uses proprietary USB cable. It should have used micro USB or mini USB - it's neither. This can be pretty annoying if you want to transfer the built-in memory photos.- Keep in mind, higher mega pixels do NOT determine better image quality. Do not go by that rule. For the picky eyes, the noise amount/quality loss is very noticeable. I mean, at this price, it's understandable. But it kind of defeats the purpose of having a super zoom, when you're max zoomed, yet the quality ends up looking more and more like a mosaic painting; if you view the picture at 100%, it should be pretty obvious to anyone. This camera is suitable more for blog posting or printing/saving to smaller resolution - then it can pass as acceptable and sharp looking. You get what you pay for with digital cameras. Don't expect flawless DSLR crisp picture quality with this camera. Again, this is your BASIC camera with zoom.- 720 HD - OK for YouTube. It does not have full HD. Of course you can't expect superior video quality with this. You want super sharp high quality video, then you really need to pay the price for a video camera.Good or bad:- No automatic lens cap (this can be good or bad depending on how you look at it; some people may not be careful or may end up jamming the automatic lens caps... then again, you may end up losing manual caps. Professional DSLR/lenses require manual caps anyway)- Uses four AA batteries. They're available pretty much anywhere instead of trying to find proprietary batteries. However, unless you use rechargeable lithium batteries, they die out quickly.- Manual pop-up flash (you can pop it up only when you need it; it's ergonomically placed in a nice spot)Personally, I would rather invest my money and step up to at least the Sony DSC-HX300. If you're looking for a really basic camera for your young children or elderly, this may be an option for them to start with and see where it goes for them. (that is if they're looking for more zoom and don't mind the bigger size)", "Date": "May 15, 2013"}, {"Title": "A note on the build quality...", "Author": "Sprout", "ReviewID": "R3V07PGNGE1ZR1", "Overall": "3.0", "Content": "Several other reviewers have gone into remarkable detail about this camera's capabilities.  It's a good all around camera but definitely not great, and the size compared to its abilities leaves a lot to be desired.  I have an old Canon S3 IS that is many years older than this camera and, aside from the lower resolution of its sensor and the tiny LCD display, it was packed with far more capability than this camera.Mostly I wanted to talk about the build quality on this camera. I've handled a lot of cameras recently, from cheap sub-$100 P&S; cameras to the $3K+ Canon 5DMkIII. None have felt as cheap in my hands as this camera.  The first thing I noticed was the battery door was a hassle to open, but trying to close it was entirely frustrating.  The hinge flexed, it didn't want to engage the latch, I opened and closed it several times before it engaged and even now there's a slight misalignment.  It's probably less than half a millimeter but is quite noticeable.That's about when I noticed the rest of the camera as a whole felt cheap except around the back side.  There's quite a bit of flex to the body and when the lens is fully extended there's a tiny bit of left to right play that really ought not be there.  I haven't been able to tell if or how this effects image quality but it concerns me as an overall statement to the camera's build quality.Maybe I got a bum unit, but overall I get the feeling that the enclosure for this camera is more of a, in automotive terms, \"body kit\" than it is an actual enclosure.  They took the guts of a simple point and shoot, put on a big zoom lens, and added a mostly-hollow, cheap plastic body that -looks- far more serious and professional than this camera is.On the up side, I was happy to see Sony finally stepping away from its failed Memory Stick storage and putting in a proper SD card slot.  About time.Keep shopping.", "Date": "March 27, 2013"}, {"Title": "It takes some getting use to", "Author": "Dennis Burlingham", "ReviewID": "RE1JZF94W90FU", "Overall": "4.0", "Content": "It has some negatives but all in all a descent camera.  The 20MP, 350dpi, 24bit pictures do have advantages.  Not real thrilled with the sweep panarama.  A large learning curve there to come out right.  I can adjust the contrast and saturation way up without blurring.  Pop Color seems to be the best setting for color shots.  No macro specific setting. Fits hand good. Others have said they thought it bulky. I have no problem with the size.  Shutter a little slow.", "Date": "May 28, 2013"}, {"Title": "Limited Niche Camera", "Author": "Jesse Baynard", "ReviewID": "R27TWVF6AJ0H7Y", "Overall": "3.0", "Content": "If you need a strong zoom and are interested in documenting more than creating beautiful photos then this camera could serve you fine... It sports a very effective zoom and has easy to find a replace AA batteries which can really come in handy if you forget to charge your batteries. The image quality isn't nearly as high as I've come to expect from Sony. For economy you'll get much better images out of their WX line like the Sony Cyber-shot DSC-WX50 16.2 MP Digital Camera with 5x Optical Zoom and 2.7-inch LCD  (Black) (2012 Model) with it's faster lens and more compact design. If size isn't an issue, but image quality is your top priority then consider the NEX line, such as the Sony NEX-F3K/B 16.1 MP Compact System Camera with 18-55mm Lens (Black), it's actually easier to hold and the image quality is so beyond this quality it's not fair to compare. The only thing this camera does have going for it is its strong zoom and convenient batteries. It's manual mode isn't useful since the ISO doesn't show up in the display and it's auto isn't very useful since it picks super slow, guaranteed to blur, shutter speeds over a higher, albeit noisy, ISO.PROS:+ Great zoom range+ Price+ AA BatteriesCONS:- Image quality- Limited controls- Auto ISO is really limited causing blurry hand held shots is dimmer lighting", "Date": "April 5, 2013"}, {"Title": "Beware, movies record a clicking sound", "Author": "LD", "ReviewID": "R1PTXE9OVMJ4DR", "Overall": "4.0", "Content": "This is my first experience with the Cyber-shot line and I definitely like it better than the Bloggie line. I like that it runs on AA batteries rather than on proprietary, Sony-only batteries (I have lots of rechargeables on hand, so no extra out-of-pocket expenses). Also, if anything goes wrong with your batteries while on a vacation overseas, you have a better chance of finding AA battery replacements than a specialty battery replacement. Although other reviewers had trouble opening the compartment I didn't. It is just like other cameras I have. Just push the catch and then slide the lid away and it will pop up.The position of your fingers on the grip leaves the shutter button finger in perfect position (best I've ever had). The zoom toggle is right there also and the zoom is really impressive. The pop up flash is out of the way and provides plenty of light. The auto mode will take care of almost all your photos but its nice to have some manual choices.Mac compatible. I was able to download the photos and movies using Image Capture that comes with every Mac. No need to download Sony's PlayMemories software (which is only PC compatible anyway).Cons:I am used to the smaller light-weight cameras that are rectangular slim boxes with retracting lenses. They are small enough you can put in a case and attach to your belt while on vacation. This camera is much bigger. It will NOT go on my belt. I can probably fit two of my Fuji cameras in the same space as this one. So the weight and size is something I had to get used to. Fortunately it comes with a nice neck strap so I will be wearing it around my neck rather than on my belt. At first look, the \"L\" shape (looking straight down on it) seems strange - it holds the 4 AA batteries and the SD Card. But it makes for a nice hand gripe and probably will protect the protruding lens if it falls on its right side.The one thing I really don't like is the clicking sound that gets recorded when shooting a movie. Yes, the manual says that this will happen when the camera is zooming/focusing, but really, who wants clicking sounds in their movies? (IF you have video editing software, you can delete these but if you are recording music or speech, you are in trouble.) So if you just want to shoot photos, this will be a fine camera.A small printed instruction manual is provided with the camera, but you have to get online and download the full manual.I was surprised that it only has a mini USB port - no HDMI port that is so common on other cameras.No automatic lens cap like my Fuji which has just as large of a lens. The lens cap that comes with it must be attached (with an included small strap) to the camera so you won't loose it.My Fuji has an ISO option up to 6400 (12800 digital) which is really great in dark rooms. This trumps the Sony but the Sony is better at zooming.I have gotten spoiled with touch screen adjustments. This camera is back to the joy stick system. If Sony can put it on a Bloggie, they should have done it on this one.", "Date": "March 28, 2013"}, {"Title": "excellant camera", "Author": "Martin D. Chrusch Davis", "ReviewID": "R2YE2M3WWTWBGR", "Overall": "5.0", "Content": "you will never have to use flash when taking pictures indoors unless room is in total darkness.zomm is excellant.overall picture taking is excellant. i have used quite a few cameras from panasonic,fufi,kodak,and olympus and this camera i rate as just as good and even better. only complaint i have is no viewfinder.but after all considered this is an excellant camera and rate it highly. for all around photo use get it you can't go wrong.", "Date": "March 13, 2013"}, {"Title": "Now I have my Camera", "Author": "Alejandro R. Rangel Vargas \"Monjerasputin\"", "ReviewID": "R36J59E062GYT5", "Overall": "5.0", "Content": "After reviewing the camera and use it, I conclude that it is an excellent buy. The resolution is fantastic and their management requires little learning. Personally, I recommend the Cybershot Camera H200 and of course your dealer.", "Date": "June 3, 2014"}, {"Title": "AA battery.. and style.", "Author": "Muhammad A.", "ReviewID": "R1OM6O1B8ZWMA6", "Overall": "3.0", "Content": "The camera is acceptable quality in look and picture. Bad part if its take AA batteries, there is no rechargeable battery in Camera.", "Date": "May 18, 2014"}, {"Title": "Not DLC but very neat", "Author": "Mario Ulate", "ReviewID": "R1J9T2AHVBDECL", "Overall": "4.0", "Content": "I wanted an alternate camera since DLCs are so expensive. I have found this camera to become great at taking pics and shooting vids. The only thing I don't like is the fact that it uses 4 AA batteries. C'mon Sony, you could add rechangeable battery", "Date": "May 14, 2014"}, {"Title": "Love this camera!", "Author": "Kim Holbrook", "ReviewID": "R1JGDA6D4GG49P", "Overall": "5.0", "Content": "I have had great luck with this camera and the price can't be beat ! It takes good quality photos and the weight is great  when out and about.  I ordered a separate case and extra memory. I would highly recommend this camera.", "Date": "May 6, 2014"}, {"Title": "Sony Cybershot H200 Black 20.1MP 26X Amazingness!", "Author": "Alex", "ReviewID": "R13K48YOYXG1O9", "Overall": "5.0", "Content": "I got this camera because of the price. I am a starter photographer so if I say something incorrectly please correct me. Overall I love this camera. I am not very good with low light pictures, not sure if its me or the camera (I am sure its just me). Macro pictures same senario, I cannot focus on objects when super zoom up close even with tripod. (I am sure its just me again)Overall though for normal pictures I love this camera. See some of my pictures (http://www.amazon.com/gp/customer-media/product-gallery/B00AQDG96K/ref=cm_cr_dp_cust_img_see_all_txt) I took the one of the orange cat, mountain dew, and pink flowers. Getting the background to blur (which I like) was pretty easy to capture. For $120 refurb you cannot beat it!Pros:It is very light weight with the correct AA batteries put inside20MP is freaking awesome. Note that most images are about 7MB+ each! So a 32GB card will hold roughly 3,000 says the camera.Pretty quick at taking pictures. Using this card and it works great with it at 90mbs (http://www.amazon.com/PNY-32GB-Elite-Performance-UHS-1/dp/B00DX5D9I4/ref=sr_1_fkmr1_1?ie=UTF8&qid;=1399295424&sr;=8-1-fkmr1&keywords;=32gb+90mbs+pny)Cons:No viewfinder (not really a con but would be nice to have I think? lol)Weight isn't balanced, feels like its all in the grip the weight. I do not know if its just this camera or not because I haven't tried others. Tripod I got would not sit flat because of this so make sure you get a good tripod. This one posted works great!(http://www.amazon.com/gp/product/B005KP473Q/ref=oh_details_o00_s00_i00?ie=UTF8&psc;=1)Will update my review once I figure out Macro and low light :)", "Date": "May 5, 2014"}, {"Title": "I consider mine a fantastic deal. A pretty good point and shoot", "Author": "Bookratt \"bookratt\"", "ReviewID": "R2FI86LY07KD10", "Overall": "4.0", "Content": "Just received the camera last night (to replace my 5 year old Canon Powershot which has a dead lens motor). Purchased as an open box deal locally, for less than half the reduced sales price listed here, I consider mine a fantastic deal. No, it isn't a DSLR with changeable lenses, but I didn't want one of those and didn't expect to get one in this price range.I wanted a camera that a) I can wear and use openly when traveling abroad, that isn't a huge target for theft, 2) isn't too heavy to wear around my neck for 8+ walking/biking/traveling hours at a time, and 3) which takes rechargeable AA batteries.This was perfect. Still getting used to all the modes/menu options and things I can do with it, as it is a big step up from my older Powershot---more megapixels, better zoom, better macro, special and photo editing effects, etc, but so far it has been fairly user friendly---and I am no professional photographer. More of a Luddite than a techie.Two cons:No viewfinder: you must use the large built-in screen in back to view/sight your shots8 frames per second shooting speed in sports/action mode might be too slow for some purposesTakes maximum 32 GB SDHC memory card, no higher and I cannot swap all my old memory cards from the old camera with this oneMany pros:Takes AA rechargeable photo batteries; means I'm always able to get fresh ones when traveling if need beCan use a standard battery charger and adaptor for use in my hotel room for those AA batteries (this is the same charger I use for other battery operated items we pack, like toothbrushes, a flashlight & kid toys)Lightweight, even with all 4 batteries inPriceGreat image quality/resolutionAll the pics I've taken so far today in normal, indoor lighting and partly cloudy outdoor lighting, have turned out great. No blur, no extra work setting anything up. I took pics of my kid (and kids basically never sit still) with no issues. Got up close and personal with some recent tulip and daffodil blooms in the garden, shot some selfies in a hallway mirror, in various natural and artificial light setups without changing a thing-- all were fine.Will put it through its paces noting the ups and downs, then will repost here if I come across any real dealbreakers or exciting new things to detail.", "Date": "May 2, 2014"}, {"Title": "Don't buy. Have sent to be repaired twice after little use. Battery issues.Extremely poor customer service.", "Author": "antiques4me", "ReviewID": "R3AMA4XLA73AXD", "Overall": "1.0", "Content": "I bought this camera new in the box, sealed from someone who won it in a contest. Nothing but trouble from the git go. After two trips to the repair center after only taking 100 photos, I have concluded that the only batteries which work are made by Sony. WHY? Because they are slightly longer according to the guy at Batteries Plus who said they must be making better contact. Unfortunately neither rayovac, duracel nor energizer or any other AA batteries available at Batteries Plus are the same length. I tried it with rechargables, energizer and Ace batteries, none of which would consistently power the camera. How do you say LEMON in japanese? To make matters worse, when I complain to the repair center, they claim the camera is working perfectly. (It just doesn't work with any batteries available for sale at stores!) PS I have had two other sony cameras in the past, both with interior rechargeable batteries and they worked great. I never had a complaint before this one.", "Date": "May 2, 2014"}, {"Title": "Pretty good", "Author": "nighasingh73", "ReviewID": "R3K9KTP2WGSVG5", "Overall": "4.0", "Content": "For it's price it is a pretty decent camera, but one problem that I faced was you can't take picture if you are in a moving position! It will come out blurry!", "Date": "April 16, 2014"}, {"Title": "Im happy whit it", "Author": "Antonio", "ReviewID": "R1J2F60OXGB02U", "Overall": "4.0", "Content": "I need to learn more about photography so I believe this camera is good for the purpose and can help a lot", "Date": "April 9, 2014"}, {"Title": "Nice Camera- poor delivery", "Author": "Heidi Donahue", "ReviewID": "RLU67E3R5HT24", "Overall": "4.0", "Content": "Great camera but the delivery was very sketchy. Fedex was supposed to deliver the package and I was tracking it. I went to check the tracking and it said \"delivered\" and I had no package. Fedex gave it to usps and usps decided to leave my camera in the entry hall to my apartment building....not even the lobby. Anyone could have stolen my camera. Amazon was supposed to help me with the problem and never contacted me back about my ordeal. I was fortunate enough to have a great super who had noticed it on the floor and decided to hand deliver it to me the next day.  Like I said before, great camera but I don't think I'll be buying from this company any more....or at least have the package sent to a different address so that I don't have to deal with usps.", "Date": "February 20, 2014"}, {"Title": "Poor low light performance", "Author": "BARRY C  RIES", "ReviewID": "RNHSII267AY94", "Overall": "3.0", "Content": "I returned this camera as I was not happy with the pictures, I bought it to replace an older Sony Cybershot,  The older camera took much better pictures in low light situations.  So we will continue to use the old one.", "Date": "January 30, 2014"}, {"Title": "Was an ok camera.", "Author": "Quentin J Buffington", "ReviewID": "R2PST7Z9RNR05N", "Overall": "3.0", "Content": "Ended up returning this camera, as the image quality was not the quite what I was hoping. Ended up purchasing a Canon EOS SL1 in its place. It powered up and was ready fast, good for up to about an 8x10 size print maybe an 11x14 if you used a low iso. Loved that it used AA batteries and would have kept it had I not needed something small and with better resolution.", "Date": "January 21, 2014"}, {"Title": "Nice camera", "Author": "Dennis Mareiro", "ReviewID": "R1I3YISPBHRR36", "Overall": "5.0", "Content": "This camera is easy to use and takes great pictures. Camera was delivered when promised and made a great present. thanks", "Date": "January 15, 2014"}, {"Title": "Great Point and Shoot", "Author": "B. George", "ReviewID": "R2T2VSTIVNULEI", "Overall": "5.0", "Content": "This camera has everything I need in it, I love the effects setting where you can select a certain color to show in the picture while everything else is black and white. It also take smooth high quality pictures, and great optical zoom for far away shots. I recommend this camera if you love taking pictures.", "Date": "January 15, 2014"}, {"Title": "Excellent choice for early photographer", "Author": "Roy", "ReviewID": "R25OZ1Q1L5PDU3", "Overall": "5.0", "Content": "Ease of use and quality of pictures have been the highlights of this purchase for granddaughter.  She is delighted with the camera.", "Date": "January 15, 2014"}, {"Title": "What is not to like!", "Author": "Lynn K. Luptak", "ReviewID": "R1C6EB1DZ3AELV", "Overall": "5.0", "Content": "This is a great camera for those who don't want to deal with switching lenses.  It takes excellent pictures and is much faster than my old Sony.  I take a lot of pictures of all our five shih tzus and birds so getting a fast shot is really important.  I also like the selections of shooting in different techniques.", "Date": "January 14, 2014"}, {"Title": "orange tinge problem, but excellent outdoor camera", "Author": "cabernhardt", "ReviewID": "R32VFTGTLKGDFA", "Overall": "3.0", "Content": "Bought this camera for my wife. She's not to fond of it, and ended up buying a Nikon p520 (but she compares a $500 camera to $250 camera). The Sony has an orange tinge to indoor pictures, but it also depends on how crappy indoor lighting you have. I noticed that high intensity daylight bulbs help. Very bright outdoor pictures, and very sharp detail. It has lots of extra features in the settings like \"toy mode\", and its zoom is second to none. Overall if you have good indoor lighting and don't want to take a second mortgage than this may be the way to go.", "Date": "January 11, 2014"}, {"Title": "Good Value", "Author": "C. Trombly \"C.T.\"", "ReviewID": "R3AM0TM0Q4WETR", "Overall": "4.0", "Content": "Good camera better than my cellphone. I'm not sure about the 20 megapixels. The pictures look good enough. One thing I did notice was indoors using the flash some pictures look washed out almost like the flash is too bright. All in all a good value zoom is okay. Its a little big for me im not a professional photographer so I didn't need a dslr but I still look like a tourist carrying this around", "Date": "January 9, 2014"}, {"Title": "Glad I got this device", "Author": "Lisa Inman", "ReviewID": "R42D9UG8YWB8P", "Overall": "4.0", "Content": "I am happy with this device and I am very pleased with the quality of the photo and the ease of use.", "Date": "January 8, 2014"}, {"Title": "excellent product", "Author": "Stephanie", "ReviewID": "R3VECSTU481JUO", "Overall": "5.0", "Content": "very good dealI wanted a camera and I found this on sale at very good deal, it's just a semi professional camera for what I need, if you want something more out of this is the need prodcuto", "Date": "January 6, 2014"}, {"Title": "excellent choice", "Author": "scarlett", "ReviewID": "RNHNPG2WANZ7Y", "Overall": "5.0", "Content": "This camera is excellent, has various effect functions as a professional camera, it is easy to use, has 20mp, the camera design is very modern, I recommend it 100%, the photos are beautiful.", "Date": "January 4, 2014"}, {"Title": "really loving this camera", "Author": "Amazon Customer", "ReviewID": "R237R8MZQ2L6UN", "Overall": "5.0", "Content": "This camera is what I was wanting the only thing I wish it showed you was how to get the shot stabilizer working because its not in the book or on the website.", "Date": "January 4, 2014"}, {"Title": "Present for my son", "Author": "ABEL CANTU", "ReviewID": "R2PC06GN2VD0Y0", "Overall": "5.0", "Content": "He is very happy with the camera he enjoyed taking pictures in the out door wild animals and school events.", "Date": "January 3, 2014"}, {"Title": "Awesome!", "Author": "Alyssa Padilla", "ReviewID": "R2JJ7U1XEK0113", "Overall": "5.0", "Content": "The Camera is A Perfect Size, It's Also Very Lightweight, Has Many Great Features, And Takes Incredible Pictures. It Is Also Very Easy To Use.", "Date": "January 3, 2014"}, {"Title": "My Cybershot is great!", "Author": "DJ Tricky D", "ReviewID": "R1OF733MZRMOZJ", "Overall": "5.0", "Content": "I have used this camera only a few times since I bought it but it has been the perfect complement to my Sony Video Camera.While am Recording with my video cam I can take some great still with my cyber Shot H200.And even though there are camera phones that deliver great pics nowadays... You still need to have a real camera to get the shots that you really want. This H200 is the camera to to just that.", "Date": "January 3, 2014"}, {"Title": "Hello, Comparing with Sony Cyber-shot DCS-HX1 camera, it is lighter,with higher quality and long life battery.Thank you.", "Author": "ahmadshah", "ReviewID": "R1DHHMQBQAYE69", "Overall": "5.0", "Content": "Hello,Comparing with Sony Cyber-shot DCS-HX1 camera, it is lighter,with higher quality and long life battery.comparing the photos of both camera,it is more clearer.", "Date": "January 1, 2014"}, {"Title": "Great upgrade", "Author": "Doe", "ReviewID": "R3UXHYI9GQH7I", "Overall": "5.0", "Content": "I'm very pleased with my purchase. It was exactly the kind of camera that I wanted, I needed an upgrade to my present digital camera and the Sony Cyber Shot fit the bill.", "Date": "December 31, 2013"}, {"Title": "So far, so good!", "Author": "Amazon Customer", "ReviewID": "R1YPU65KUQAWNC", "Overall": "5.0", "Content": "Bought this camera for my wife. It works well and my wife can actually use it OK. There are a lot of capabilities that are not being used by her but it seems simple to learn and understand. She likes the picture quality and options to do more sophisticated imaging.", "Date": "December 30, 2013"}, {"Title": "very easy ti use", "Author": "Luis", "ReviewID": "R1HG12HBERZC2R", "Overall": "5.0", "Content": "the unique problem was the battery are not rechargeable but it can solve it just buying them, the qualiy of the images are great!!", "Date": "December 30, 2013"}, {"Title": "Great Product", "Author": "Bryan", "ReviewID": "R32IF18IELOVXE", "Overall": "5.0", "Content": "I gave this to my wife hoping she would like it. Its a little intimidating at first but when you go through the settings and see what it has to offer, its a great product. My wife is all over the place taking nice pictures. the quality could get her first place in the county fair. I would say that with the 20 megapixels and nice zoom, that anyone would love this camera", "Date": "December 29, 2013"}, {"Title": "Sony Cyber H 200", "Author": "JOHN", "ReviewID": "R1NPEMVGIBV0H1", "Overall": "4.0", "Content": "works good,you need time to get to know all of it's good or bad futures.Would not buy it again .", "Date": "December 27, 2013"}, {"Title": "Fabulous and easy", "Author": "Gypsy", "ReviewID": "R1X3FAJ9P7EOVC", "Overall": "5.0", "Content": "Great camera for someone who is not the best at taking pictures. All my shots have come out clear and in focus. Can't wait to play around with this more.", "Date": "December 24, 2013"}, {"Title": "Terrific camera", "Author": "Ridge01", "ReviewID": "R14WYJ9XXAVO3U", "Overall": "5.0", "Content": "This camera is hard to beat.  It's a terrific value, very high quality, simple to use and takes great pictures.", "Date": "December 24, 2013"}, {"Title": "Sony H200", "Author": "dekattsmeow", "ReviewID": "R236C7NKCSGYED", "Overall": "5.0", "Content": "Nice camera! Quick and easy to use but do wish it had a rechargeable lithium battery. Very clear photos, even with extreme close ups.", "Date": "December 12, 2013"}, {"Title": "Nice Upgrade", "Author": "David B.", "ReviewID": "R157YO9BVVCQ93", "Overall": "5.0", "Content": "This is a very nice 20 mega pixel camera, a nice upgrade from my old 12.1 mega pixel Sony CyberShot.", "Date": "December 6, 2013"}, {"Title": "So far, so good", "Author": "WPFLreviewer", "ReviewID": "R3HM605IQ1M6I6", "Overall": "4.0", "Content": "I mainly got this camera for its ability to focus close-up. It does that with its \"tracking focus\" feature but I am not convinced this camera is getting any better pictures or close-ups than my iPhone 5. I'm pretty sure, however, that I'm going to sell my XSI and Tamron zoom lens because they are definitely redundant to this camera and the iPhone. I very much like the weight and size and ease of operation. I'm over the big digital cameras (and the XSI isn't even big), but for female hands I like this better. It's got tons of no-brainer shooting modes and you certainly can't complain about its zoom capabilities or the price considering all the features.Does anyone know if there's a lens cover that will fit this? One didn't come with it.", "Date": "October 23, 2013"}, {"Title": "Feedback for my Sony DSC-H200", "Author": "zbigniew las", "ReviewID": "R2N1ZX8F2ZLBGA", "Overall": "5.0", "Content": "Good product. Looks like the prfessional camera!  Easy to operate. Magnific fotos. Raly SONY product, not decive me! Good prise. Easy and correct transaction. Shipping at time. Thank you. I recomand everyone to bye it.", "Date": "October 2, 2013"}, {"Title": "Great Camera To Work With.", "Author": "Paul - Biloxi,MS", "ReviewID": "R37RYNY8JS372X", "Overall": "5.0", "Content": "This is a really nice camera for the price. It has extra features like 21.6 megapixels and a longer zoom lens.", "Date": "July 18, 2013"}, {"Title": "Good for the price", "Author": "J. Plummer", "ReviewID": "R2L9190MIIEE47", "Overall": "4.0", "Content": "This is the first Sony camera I have tried and I am still forming my opinion on it. My most recent camera before trying this was a Canon T3i. Comparing the two is a bit unfair as the T3i is much more expensive and has interchangable lenses. It is also much more customizable. I like the options of Program mode or manual for more experienced users. Using this camera straight out of the box was very unimpressive. After altering the settings it is possible to get some good quality photos from this camera. It is difficult to tell until you load them on your computer because the LCD is not great quality. The fact that this camera uses AA batteries is a very big plus too. Camera batteries can be very expensive and having a battery die can ruin your day as a photographer. Personally, I would recommend this camera if you are looking to spend under $200. For bit more you can get a Canon Powershot SX40 or SX50 which are much, much better in my opinion. For this price, this camera should be more than satisfactory if you are willing to adjust some of the settings.", "Date": "May 13, 2013"}, {"Title": "Decent camera", "Author": "Becky in NOLA \"Becky\"", "ReviewID": "R25JFLFOXVBYF2", "Overall": "4.0", "Content": "The Sony DSC is a nice option between a phone camera and a DSLR. I got the camera on a Monday night and took it on vacation Tues morning, so my learning curve was out of the box, literally. I like the four batteries because I pretty much always forget to charge my battery pack and am out in the middle of nowhere with no ability to take pictures. With the four batteries I can run by a walmart or Bobby-Joe's fish, bait, and porn store and there will be batteries.The Sony took really good pictures for me on the default setting. I did find there was a distance to which facial features became lost. As you can see in the picture I uploaded of the alligator it does great in zoom, picking out the features of the reptile. The bird picture I took was of a bird in flight, still in default mode. Behind glass, shiny cars and planes in a museum, it took them all with ease.Taking a movie was as simple as moving the button to the movie option. Here, I overall liked the quality but it took awhile after zooming to refocus, maybe a good 5-6 seconds. So if I was shooting a movie and wanted to zoom quickly it wouldn't work.I love the scan feature, turn the knob/button to scan and the camera gives a menu to sort from. Faces with soft backgrounds, to pets, food, white scenes, blue scenes, fireworks, low light with tripod, it gives a great bunch of options for different scenes.I didn't find it bulky but I am using it after using my older Olympus and the size is about the same. It's a lot lighter than my six lb DSLR, which was nice when hiking around Avery island.There are a few negatives. If I turn it off with the lens cap on it sometimes makes me turn it off and on again, rather than letting me know the cap is on. The battery compartment is not easy to close, and for some unknown reason sony chose to put the memory card in the same compartment as the batteries. Yesterday I opened it to get the card to upload pictures to my computer and spilled the batteries everywhere. It's not a huge negative but just a weird inconvenient design feature.Overall I'm very happy with this camera and the pictures I took with it.", "Date": "April 5, 2013"}, {"Title": "A camera of many compromises", "Author": "Colin Brown \"Colin Brown Microsoft MVP\"", "ReviewID": "R1N87P4L5KNYC4", "Overall": "3.0", "Content": "The Sony DSC-H200 is really a camera of many compromises.The first two things you will notice taking the Sony DSC-H200 out of the box are its size and its weight.  The camera is much larger than normal compact super zooms, roughly 2/3 the size of a full DSLR and its definately solidly built weighing quite a bit more than a standard compact.  The weight of the camera (560g including batteries compared to around 250g for a compact zoom) makes it harder to steady it when using high zoom and you will likely want to put the camera on a tripod (which really you should anyway when using high zooms).  There is built in image stabilisation however to offset camera shake to a degree.Included in the box you will get a removable lens cover, a small strap for the lens cover, a strap for the camera itself, four AA batteries and a small instruction manual as well as the actual camera itself.Personally I don't like the removable lens cap on these types of cameras. You can attach the small supplied strap to it and attach that to the camera body so that you don't lose the cover, however when taking photographs it just dangles there and gets annoying fairly quickly.  If you don't use the strap then you are in danger of potentially losing the lens cap.Strangely Sony have decided to use 4 AA batteries to power this camera rather than the normal rechargable Lithium-Ion type batteries found in most compacts. This in my opinion is a bit of a compromise. You never need to recharge the battery, simply insert more AA's and continue shooting however it's bulkier and costlier than the rechargeable type.  I would find it easier just to have a couple of extra small lithium-ion rechargeable batteries with me and swap out when required than being required to lug around a large pack of AAs.  Why a large pack of AAs?  Because this camera seems to go through batteries at a fairly rapid rate.  You only get roughly 320-360 pictures (depending on how much you use the zoom etc) on the four batteries before you need to swap them out.  If using the movie feature you get just over an hour before having change batteries.  In talking about batteries, the battery cover itself is a bit fiddly.  It's easy enough to open but closing the battery cover when you have batteries in it takes a little getting used to as the batteries are pushing up against the cover as you are trying to push it down and slide it closed whilst holding back the small cover lock lever.The camera will accept a variety of storage media including SD-Cards and Sony's own Memory sticks (I would recommend a class 10 or above SD-Card as these are cheap and fairly much standard nowadays). It also accepts Eye-Fi memory cards if you want to wirelessly upload your images to your computer or the internet.The camera itself sports one of the largest zooms I've seen going from 24mm (wide angle) to 633mm (full optical zoom).  This gives it a 26.4 times optical zoom which is really quite huge.  Most super zoom compacts nowadays are coming in at around the 20x optical zoom mark then enhancing that with digital zoom. Like all other cameras the Sony DSC-H200 also has a digital zoom extending it effectively to a whopping 1248mm (52x).  This isn't the largest combined zoom I've seen as I have a compact that does 64x (effectively 1600mm equivalent from its 25mm wide angle) but it should be more than enough to capture any distant object that you come across. The optical zoom is very impressive though and as you may know optical zooms are far better than digital (combined) zooms with regards to image quality.Given the size of the camera and the diameter of the lens (quite a bit larger standard compacts) I was quite disappointed to find that the size of the sensor was only 1/2.3\" (6.17 x 4.55mm).  This is actually smaller than sensors found on most modern compacts (usually they are 1/2\" 6.4 x 4.8mm).  Although its not the full story (as many other factors are involved such as sensor type etc), as a general rule of thumb you can say the larger the sensor the better the quality of images you will get (as an example, the sensor on one of my DSLR's is 22.3 x 14.9mm).Even with the slightly smaller sensor Sony has given this camera a whopping 20.1 megapixels (5184 x 2920 pixel).  Again this is larger than a lot of other cameras, especially in this price range (typically 16-18 megapixel) and should lead to more detailed/less grainy images (see below) and allow you to see more detail when you zoom in on a picture.  This again however appears to be a bit of a compromise by Sony, sensor size versus megapixel count.The LCD monitor on the back of the camera is the standard 3\" 460,000 pixel found on most cameras. However in use it appears more grainy compared with other LCD monitors on other cameras.The shot mode wheel on the top of the camera appears to be fairly barren compared with other cameras as well, only offering you a choice of 6 modes compared to an average of 10 modes on others, however this is a bit deceiving as sony have given you multiple sub-modes within a each of these. Overall however the range of modes is still less than other compact super zooms in this price range.  These modes are basically pre-sets making taking quick shots easier.You can use the DSC-H200 anywhere from fully automatic, just point and shoot mode down to manual mode which allows you adjust a number of settings including ISO, shutter speed etc. Manual mode however is another of those compromises in that it doesn't offer you fully manual control of the camera, there is no manual focus for example.  There are however a few nice settings like the bracket shot mode which shoots 3 images at different exposures (you get a pre-determined choice for example 0.3EV, 0.7EV apart etc.), the ability to automatically shoot when a smile is detected on a person and continuous shot mode (keeps taking pictures as long as you hold down the shutter button).Other comprises are that the DSC-H200 only has an ISO setting up to 3200.  Whilst perfectly acceptable for most shots, most cameras now are giving you 6400 and 12800 ISO settings as well which the DSC-H200 doesn't.  Maximum shutter speed is also lacking compared with other cameras in this price range. The DSC-H200 gives you a maximum shutter speed of 1/1500 whilst most others are in the range of 1/2000 to 1/4000.  However the DSC-H200 makes up for this with quite a nice 30 second minimum shutter speed for long exposure pictures.One place the DSC-H200 does pick up some points is with it's flash. There is a small button on the front of the camera body to pop up the flash and the flash itself is very good, well above similar flashes on other compacts giving you a better lighting and range of shots without overexposing the images. When you are finished with the flash, just simply push it closed.On the back of the camera you have the fairly standard quick picks for self timer, flash on/off buttons on the wheel selector and the menu button to bring up more options for shots (e.g. adjust ISO etc.).One major annoyance with the DSC-H200 is the shot speed.  It takes a long time for the auto-focus to lock on (can be 2-3 seconds and sometimes more) and then it takes over a second to take the picture and store it onto your media card, ready to take another shot. Even in continuous shot mode, the DSC-H200 still only manages to take roughly 1 shot per second (after it has focused). I have managed to miss a few shots that I would have liked to get due to the length of time the DSC-H200 takes to get a picture.Another compromise Sony has taken is with the Video function of the camera.  The DSC-H200 will not shoot full hi-def 1080p movies, only 720p movies which seems quite odd given the specs of the camera.  Also there is no ability to adjust the frame rate. A lot of cameras now give you the ability to take slow motion movies (higher frame rates at the cost of size) which can be quite fun to use sometimes.Sound quality is a different story.  The DSC-H200 has multiple microphones built into the body which helps to greatly reduce ambient noise (you can however quite clearly hear the zoom motor if you use it) and it has quite a large microphone built into the top of the camera. Sound quality on video's is excellent.  It's just a shame Sony compromised the other aspects of shooting video.Picture quality is a bit on the grainy side which is slightly surprising given the 20.1 megapixel images it takes but for general holiday snaps you won't notice this and its perfectly acceptable for everyday use.Overall the Sony DSC-H200 is really well built and fits nicely in your hand when taking shots, if a bit on the heavy side. It has some nice features and specs (excellent optical zoom and high megapixel count) however these are offset by some of its other features (slightly grainy pictures, small sensor, only 720p video etc).  Although this is a fairly cheap camera it just lacks some of the features found in other cameras within a similar price bracket and it just feels Sony has made too many compromises with it.  Don't get me wrong, it's a perfectly fine camera but you can find better cameras out there for your money.Edit:  I have uploaded a couple of pictures to show the quality of images from the Sony DSC-H200.  The first image is a picture of the moon, taken in the evening with full digital zoom and the second is a quick snapshot (taken in easy mode) of a groundhog I noticed outside the back of my house.", "Date": "March 26, 2013"}, {"Title": "Piece of Crap", "Author": "Stephen Andres", "ReviewID": "R1OU8A3SWRJGY0", "Overall": "1.0", "Content": "I am bitterly disappointed.  An image taken at max telephoto is nothing more than dots.  The images are over exposed and when you correct the exposure the camera goes back to factory settings when turned off.  The lens cover does not stay on.  Save your money.", "Date": "January 13, 2014"}, {"Title": "Dissatisfied", "Author": "martin self", "ReviewID": "R1JRKV5ED7S9F8", "Overall": "1.0", "Content": "When taking multiple photos  of the same picture not moving the camera at all. All of the photos differed immensely in quality. Even when using the auto focus mode. From all the Sony camera's I have owned this is by far the worst quality photos I have seen. Very dissatisfied.", "Date": "January 3, 2014"}, {"Title": "Nice camera, Nice price", "Author": "Carlos", "ReviewID": "R35LSLTCMCBTG7", "Overall": "5.0", "Content": "Great camera at a great price. The zoom is awesome. We have fun with the color options for the photos as well. The auto-focus works great as well.", "Date": "November 16, 2013"}, {"Title": "Awesome shots!", "Author": "Jennifer Merkel", "ReviewID": "R2SHFLY3MFY341", "Overall": "5.0", "Content": "Love it!  I get so many compliments on my advanced photography skills and feel guilty that I don't admit it's just a camera setting;)", "Date": "November 8, 2013"}, {"Title": "Great pictures, a few glitches", "Author": "Mrs. Phun", "ReviewID": "R9VFHREBAQ9GL", "Overall": "4.0", "Content": "I upgraded from the previous version Cybershot and am slightly disappointed.  First, the lenscap does not stay on very well.  Thus, you must keep this in it's camera bag and NEVER quickly toss it in your purse or diaper bag else the lenscap fall off and the lens scrape keys, toys, gum, etc.  Second, sometimes the focus doesn't seem to work and I have to power it on and off to \"reset\".Having said that, the camera takes excellent pictures and I love the upgrade to AA batteries!  That makes it so much easier to travel with, etc!", "Date": "October 22, 2013"}, {"Title": "Anyone not happy must not know how to use it + instructions are embedded w/i", "Author": "vee", "ReviewID": "R3MBEK3MAGJEN1", "Overall": "4.0", "Content": "Unfortunately in this day in age, features are obsolete before it's delivered to your front door: however that is the best part.  Being obsolete, you get GREAT features that six months ago would have cost us way more than the budget would allow.  Now very inexpensive.  This camera would have netted five stars but some materials are substandard.  I give it 4.8 stars.  :-)", "Date": "October 16, 2013"}, {"Title": "sony dsc h200", "Author": "jamesb", "ReviewID": "R2N8CATD655LIN", "Overall": "3.0", "Content": "This camera is great for still shots but when it comes to recording video in HD its auto focus is really slow but overall good camera", "Date": "September 15, 2013"}, {"Title": "Very good bridge camera", "Author": "Iron Man \"JON\"", "ReviewID": "RRVMFLV5LFTR8", "Overall": "5.0", "Content": "For those shutterbugs that are caught in the middle (upgrades from a compact but falls short of acquiring a DSLR), the Sony DSC-H200 Digital Camera with 3-Inch LCD fits the bill nicely. This camera's functionality is not at all hard to to familiarize. Although the Sony DSC-H200 would certainly not be a first choice for me as far as bridge camera's are concerned, having the chance to own one and compare it to my personal bridge camera in the same category which is Panasonic Lumix DMC-FZ28k is where I will be basing this review. I am not a pro but my photographic skills are beyond the novice level. I have 2 bridge cameras (both Panasonic Lumix models FZ50k and FZ28k), a Nikon D3100 DSLR and one compact(Samsung ST100) that serves as a back up.At first glance, the Sony DSC-H200 Digital Camera looks modern and stylish. The curvature of the camera fits my hand in a secure fashion. The grips are made in such a way that unless you totally let go, it will not slip while you are grasping the camera. And since this camera does not have a viewfinder, it is where this curvature plays a major role. For the DSC-H200, Sony deviates from its usual norm of having Carl Zeiss lenses. It is now equipped with a Sony-branded aspherical 12-element lens with an amazing 26x optical zoom and a 2-way active mode image stabilization. With a zoom and image stabilization like this, you can take breath-taking close up shots with minimal shake that compensates for vertical and horizontal motion that is usually present in high zoom shots. The image stabilization worked great when I tried to focus on a boat by the lake and took a shot at the full 26x optical zoom. Just when I tought that the Lumix FZ28k has an outstanding 18x optical zoom, the DSC-H200 surpassed this with an amazing 26x optical zoom. The boat was a few miles away but the image seems to be just a few feet away. The lens also pulls back to a nifty 22.3mm (in 35mmm equivalent) where you can truly have wide angle shots. This is wider than my FZ28k which is set at 28mm. Where other bridge camera's image stabilization is electronic, the DSC-H200 stands out with its Optical IS. The resolution on the DSC-H200 is pushed up to an astounding 20.1MP. This is one of the highest is this class. Creating blow-ups with a 20.1MP resolution brings out stunning details on your pictures.Functionality is very user friendly. The controls, especially the mode dial are pretty much standard for bridge cameras. So if you currently own one, you will have minimal difficulty trying to set the dial or manipulate the controls to your desired mode. The video feature is great enabling you to take HD 720p resolution videos at 30 fps in MP4 format. My Lumix takes videos in the same 720p HD resolution in the same frame speed. Unlike the Lumix which is powered by a proprietary Li-Ion battery, the DSC-H200 is powered by 4 regular or rechargeable AA batteries. Note however that with rechargeables, your ability to avoid lag time increases and video times are short since unlike regular batteries, rechargeables looses the power hold even while not in use.The DSC-H200 expands its interface versatility by using both Memory Stick and the SD/SDHC format of memory cards. Again this is a deviation for Sony since previous camera models are strictly compatible only with their proprietary Memory Stick. This is a nice attraction for photographers since the SD/SDHC format is more widely used than the Memory Stick.Another great feature worth noting is the In-Camera Editing. The DCS-H200 has the ability to perform basic photo editing like Retouch, Trimming, Unsharping. You can now post or transfer edited photos to your PC.ISO sensitivity ratings goes up to 3200 but taking low light pictures past the 400 mark, I noticed a lot of noise. And no amount of adjustment seems to reduce the noise. It does take superb, sharp pictures with proper lighting. Using this on a clear day, produces outstanding results. Control configurations are adequate. Once it is in your grip, it's not hard to reach and manipulate buttons and dials.After all that's said and done, this camera is geared for the consumer with less aptitude towards creative photography. The absence of a viewfinder can attest to that fact. For more endearing photographic objectives, the DSC-H200 can hold its own but I still would not part with my full function DSLR. The Sony DSC-H200 would however, be a great back for those less demanding photographic objectives. I still give it a 5-star for its huge 26x Optical Zoom and its 20.1MP resolution. Very hard to overlook these great features at such a small configuration.", "Date": "March 29, 2013"}, {"Title": "Not litium battery", "Author": "helen da costa pimenta guimarães", "ReviewID": "RDQFLML1138GA", "Overall": "2.0", "Content": "A specially choose this model because on the details( amazon page) the description listed a lithium battery. The camera is already in Brazil( a friend brings) and aperentily you send me the wrong model since it came with regular batteries.", "Date": "October 10, 2013"}, {"Title": "Camera Of The Year", "Author": "JR", "ReviewID": "R1W3NTAOYA1QRW", "Overall": "5.0", "Content": "GREAT CAMERAPICTURE IS GREATFLASH IS BRIGHTDOWNLOADS ARE AWESOMEJUST BUY THIS CAMERASONY IS THE ONE TO GET", "Date": "August 4, 2013"}, {"Title": "Great camera", "Author": "SharonSnowbird", "ReviewID": "R23LJRD496L383", "Overall": "3.0", "Content": "If you want a printed manual for your camera, do NOT order from Manualsink.com!  Their manuals are inferior, very low quality, extremely difficult to read and the holes that the spine goes in, cut out many of the words of the manual making it impossible to read.  I told them I wanted a refund, and they said I have to send it back and PAY FOR THE RETURN POSTAGE!  They sent me a manual that was unreadable, and they will not pay for the return postage.  Shame on them for a terrible product and the worst customer service ever!", "Date": "April 28, 2014"}, {"Title": "This camera is very good for its cost.", "Author": "Jose Vicente Ruiz", "ReviewID": "R1LV2PZE0BR737", "Overall": "4.0", "Content": "I selected this rating, because this camera has a great zoom of 26x, its resolution of 20.1 megapixels and blur correction.  So I would recommend to everyone.", "Date": "March 20, 2014"}, {"Title": "Great pics ok vids", "Author": "Kevin Ralph", "ReviewID": "R1GSJ5OHDADZ8F", "Overall": "4.0", "Content": "The rating would have been higher but I was not thrilled with the audio quality in video mode. Camera takes great pics.", "Date": "March 20, 2014"}, {"Title": "Great little starter camera", "Author": "Adam", "ReviewID": "RVRM1XW5MM25Q", "Overall": "4.0", "Content": "Let me start off by saying - trying to be succinct with a digital camera review is difficult. There are so many features and functions available that one could easily type a novel without trying. That said, I will do my best.The Sony Cybershot H200 does a good job of giving the user enough control to get creative, without burdening them with too many technical details. This will either make the user happy that most of the guesswork is taken out of the equation, or leave them wanting more control than the camera can give them.At a tad over 20 megapixels, the images the camera capture are clean when the ISO is set low. The dynamic range in the images is pretty good. There are plenty of settings to enable the user to capture some of the most popular types of images - in-focus foreground subjects with background that are blown out, landscape images, low-light scenes, images which focus on skin tone, and a number of other settings that can be set with a simple twist of the dial and a couple of clicks with the selector switch on the back.Speaking of the back, the LCD is a nice touch. It's big and bright, and people should have no trouble seeing their way around the camera's menus thanks to it. The menus are intuitive, and there's even on-screen help that can assist you with everything from the basics to more advanced techniques.The on-board flash is powerful enough to rescue scenes which are too dark, but unfortunately there is no hot shoe, so adding on to the camera with external flashes and accessories is a no-go. The grip on the unit is a little aggressive for my taste, but it's not to the point of being uncomfortable.One of the things I found puzzling is that the camera has a manual mode. Traditionally this setting gives the user full control over aperture, shutter speed, ISO, white balance and focus. Most of those are there, but curiously manually focusing the lens seems to not be one of these options. Being one of the key components for taking a picture, it's sorely missing.Video capture seems to work adequately, and records at 720p. There is a connector for a mini-USB plug that supplies audio and video signal. Another drawback is there's no way to externally power the unit, nor is there a microphone input. You're stuck with what's on the camera when it comes to all of this.I think for its price it's a great bargain, and should be especially attractive to new shooters.", "Date": "March 18, 2014"}, {"Title": "Perfect for a non professional person!", "Author": "Todd", "ReviewID": "R22UP26Z9Z3QEA", "Overall": "5.0", "Content": "This camera was perfect! I have taken it to a concert and got amazing pictures.. I wasn't in nose bleed but I'm sure they still would have been great!! Perfect camera for beginner!!", "Date": "February 19, 2014"}, {"Title": "Honest, Fast, love it.", "Author": "BG", "ReviewID": "RP0AS8Z338GRC", "Overall": "5.0", "Content": "The item is exactly as was described and the delivery was amazing fast. Was skeptical about electronics semi new. Now I am their fan.", "Date": "February 19, 2014"}, {"Title": "Very good", "Author": "Peanut", "ReviewID": "RQY7H2IWRPFEG", "Overall": "5.0", "Content": "The camera arrived on time and works perfectly. The zoom is good and the size is perfect to carry everywhere I go. I loved it.", "Date": "February 11, 2014"}, {"Title": "Amazing value", "Author": "mk-Ultra", "ReviewID": "RDT4TS4MBFVQZ", "Overall": "5.0", "Content": "I got this camera priced around $130 and I cant be happier with the purchase. I gave this as a gift and the person is so happy with the performance. It uses 4 AA batteries instead of a rechargeable which seems like it may have high cost to keep it running but still would say its a great value overall.", "Date": "January 25, 2014"}, {"Title": "good camera", "Author": "oscar", "ReviewID": "RIH59Q4MBXVIW", "Overall": "4.0", "Content": "it is a good camera, you can just do anything with it, good for take trip pictures in the road.", "Date": "January 23, 2014"}, {"Title": "Outstanding for the money", "Author": "Amazon Customer", "ReviewID": "R2B7GBTPJSZUOP", "Overall": "4.0", "Content": "Best low cost camera on the market.  Easy to use and the menu is easy to understand.Love the results after downloading to my computer.The zoom feature is great too.Love the use of batteries and not having to worry about a place to charge an internal battery  Just pop in a new one.", "Date": "January 21, 2014"}, {"Title": "camera", "Author": "Deborah Schmidt", "ReviewID": "R2OVG336ORWYGF", "Overall": "5.0", "Content": "Love this camera, I have 2 one for me and one for a son. great way to get started taking amazing photos without the expense and needed lessons of a DSLR. Great picture quality ease of use with on screen menus. Does take some experimentation. You may want to get rechargeable batteries it does go through 4 AA quickly .", "Date": "January 18, 2014"}, {"Title": "good value, some dissapointments", "Author": "Ivan S. Wilson \"iwilson295\"", "ReviewID": "R3GB3Z07G9XRXB", "Overall": "4.0", "Content": "Great camera for the money.  Some dissapointments:  flash doesn't pop up on its own.  Doesn't use a rechargable battery (AA alkaline).", "Date": "January 13, 2014"}, {"Title": "Great Camera - Horrible Battery Life!", "Author": "JMW1977", "ReviewID": "R2Q9EQ81F6529H", "Overall": "2.0", "Content": "Buyer beware - this model is the one that uses AA batteries - which might sound like a cheaper, common sense approach.  Unfortunately, what it ends up being is a camera that blows through AA batteries faster than you would ever imagine.  The camera itself seems awesome - picture quality great, zoom is spectacular in this price point -- BUT, you'll need a constant supply of AA batteries on hand if you plan to use it much at all.  If I did it over, I'd buy the model with the rechargeable batteries...", "Date": "January 10, 2014"}, {"Title": "Wrong Battery", "Author": "Brad Thompson", "ReviewID": "R28Z0WUNTHSH6Y", "Overall": "2.0", "Content": "Description said clearly \"Lithium Ion\" battery.  Once received, this was not the case.  4 AAs instead.  This was not the camera sellers fault, since I went through them for a replacement, but was told Amazon had listed it incorrectly.", "Date": "January 7, 2014"}, {"Title": "Takes great pics!!!", "Author": "Steph", "ReviewID": "RRCJ4SL19ZH4C", "Overall": "5.0", "Content": "Still monkeyin with camera but great LENS/ZOOM for the price, love the different camera options...it takes regular AA batteries...You definately need to purchase top notch SD card in order for the pictures to save quickly, Scan disk Ultra is what I purchased, at relatively low cost.  Im satisfied, an plan to take my sons Senior pictures with it, we'll see how it turns out", "Date": "December 31, 2013"}, {"Title": "Sony camera", "Author": "Deirdre", "ReviewID": "R1BU2WB70ZC8EJ", "Overall": "4.0", "Content": "I bought it used, but I had no problems until now.Condition was good, not excellent.The package had the batteries and guarantee, but no case nor brochure attached.I would really need the information about the camera, hope the seller had mentioned it had no instructions nor camera case to protect it.", "Date": "December 30, 2013"}, {"Title": "Great camera", "Author": "Tiffanie Turner", "ReviewID": "R261S0K5K8VGCA", "Overall": "4.0", "Content": "Very nice pics! Great zoom. But it doesn't come with memory card. So make sure you get one or you'll have to wait like I did to use it.", "Date": "December 30, 2013"}, {"Title": "No manual!!", "Author": "Thomas Kerns", "ReviewID": "R3PY3D4LCID9CV", "Overall": "3.0", "Content": "It does what I want but had to purchase a manual to figure out how to really use it. Great range of zoom, alot like a film Nikon.", "Date": "September 19, 2013"}, {"Title": "Awesome!!", "Author": "Safiyah Walcott", "ReviewID": "R3N0YW6G1M5EF3", "Overall": "5.0", "Content": "Great pics and easy storage! Only thing I must buy is a carrying case. My trip to Dubai will be a great with this camera!", "Date": "September 8, 2013"}, {"Title": "Excelent item. Excelent photos. Really happy with my new camera. I recomend it 100 %", "Author": "Omar Ramirez Ramos", "ReviewID": "R1LCOQSDM1D3BZ", "Overall": "5.0", "Content": "I love to have photos with the best quality. This camera give me what I want it. It is great", "Date": "July 16, 2013"}, {"Title": "Battery and memory card Access difficult to close and open", "Author": "Robert G.", "ReviewID": "R2AU454J5WXNUC", "Overall": "3.0", "Content": "Seems as SONY could of made a more user friendly access to the battery and memory card. Spring loaded release slips out from under fingers while trying to force the door to move out and away from body to swing to open position. Door when closing will not always catch all its hooks needed for a completely closed door.  Camera gives error message with the Sony 64GB SDXC Class 10 UHS-1 R40 Memory Card (SF64UY/TQMN) installed. Big issue..", "Date": "August 30, 2013"}, {"Title": "Another camera.....", "Author": "Gerri \"Gerri\"", "ReviewID": "R1611UCQIOYV7O", "Overall": "3.0", "Content": "I didn't expect it to be so \"bulky\" but the options are great!  If you plan on buying this model don't forget to get a memory card.  Another disadvantage is that it uses AA batteries.", "Date": "August 23, 2013"}, {"Title": "Very Nice Camera!", "Author": "Doris Day \"photographer\"", "ReviewID": "R1TN2EPCTBOMS5", "Overall": "5.0", "Content": "My seventeen year old grandson wanted a nice camera, so I purchased this one for him.  I have a camera that has more resolution, but he needed a good camera to do some experimenting with things that interested him.  He loved the camera.  I have watched him carry it around taking photographs of a lot of different things.  It's not hard to see that he loves it.  I have used Sony cameras about 15 years.  Since the digital age and I also love the Sony brand.", "Date": "March 19, 2014"}, {"Title": "Price shopper beware!!", "Author": "wendy", "ReviewID": "R334PMCJ23WXQD", "Overall": "5.0", "Content": "Through our own fault, thinking Amazon is always best, we bought this camera for over $230 with shipping. We since have seen it at...WalMart for $149 And at SAMs club in a bundle with the case and an 8gig card for $179. Let our mistake be a learning experience. Shop local too!", "Date": "February 21, 2014"}, {"Title": "Great beginning DSLR", "Author": "Susan Grafton", "ReviewID": "R1AC98Z5BX2G7B", "Overall": "5.0", "Content": "This is a great beginning camera.  Pictures are great!  I definitely recommend practicing with the different settings if you have a certain topic you plan to use the camera for.", "Date": "January 22, 2014"}, {"Title": "Sony cybershot is a very nice camera", "Author": "Joseph Ponce", "ReviewID": "R257HPGQ4Z2802", "Overall": "5.0", "Content": "This camera is the perfect starter for my daughter's new interest in photography. Great pictures and video. Best we tested in the price range.", "Date": "January 18, 2014"}, {"Title": "No bag", "Author": "Cherry Beckworth", "ReviewID": "R27M8FPNRPSXZO", "Overall": "3.0", "Content": "Was supposed  to have a camera bag and SDCard but it didn't. Camera is nice but when it was a Christmas present, it was disappointing not to be complete", "Date": "January 5, 2014"}, {"Title": "Repackaged point and shoot camera.", "Author": "Mikey", "ReviewID": "R8ANW06FVEJMW", "Overall": "2.0", "Content": "Purchased the kit which included the bag, camera, and SD card for $150. Didn't expect much because of the price and I wasn't disappointed. Cheap materials, took poorly exposed, blurry, and distorted images. Was able to salvage 10% of the pictures I took.Wanted it to work but it just didn't meet my standards for IQ, features, an perceived overall quality, IMHO.", "Date": "January 4, 2014"}, {"Title": "excellent", "Author": "monica uzueta", "ReviewID": "R2SC44K2F15D00", "Overall": "5.0", "Content": "The camera was delivered on time and well packaged. It fit sellers description.  I am extremely happy with this camera and I can't wait to use it for my wedding day in a few weeks.", "Date": "December 7, 2013"}, {"Title": "Sony DSC-H200 with  a 26X zoom lens", "Author": "caldwin \"retech\"", "ReviewID": "R3V08D03XQ2O4C", "Overall": "5.0", "Content": "I previously owned a Sony DSC-H9 with a 15X zoom lens and the DSC-H200 has a 26X zoom. I gave my DSC-H9 to my daughter.", "Date": "November 30, 2013"}, {"Title": "Ok", "Author": "ckitner", "ReviewID": "R1OLPYUBGW6PYM", "Overall": "3.0", "Content": "Camera has been hard to use to get good action photos.  Still trying to get used to using the camera", "Date": "November 19, 2013"}, {"Title": "Excelent Purchase", "Author": "yanny b.", "ReviewID": "R2DB3WKV112H73", "Overall": "5.0", "Content": "the purchase for this item was expected, size, color, material and also i can recomend 100% and i can tell  that is safe, security.", "Date": "July 19, 2013"}, {"Title": "sony cyberS***", "Author": "Zardshark", "ReviewID": "R2PDU7UFEU42UY", "Overall": "1.0", "Content": "Has way too many flaws:-the memory card plugs into the bottom so you have to unscrew the tripod slider every single time you want to access the sd card.-it has auto-focus is terrible and you can't disable it and it ruins your video.-it has no manual focus-the lens are not interchangeable even though it looks like a camera that should be changeable.-there is no microphone input-it does not have a rechargeable battery-it does not have ac wall power input-lens cover falls off way too easily.  Sometimes it falls off just by handling the camera or by putting it in a bag.  The cover is useless.THE WORST THING ABOUT IT IS IT HAS AUTO-STABILIZATION THAT YOU CAN'T TURN OFF AND WHEN YOU ARE FILMING SOMEONE TALKING IT SHAKES AROUND EVERYWHERE TRYING TO FOLLOW THEIR FACE AND IT LOOKS LIKE AN EARTHQUAKE IS GOING ON.  I CAN'T EVEN MAKE A SIMPLE INTERVIEW VIDEO.I'm very disappointed in Sony and probably will never buy something from them again.  It's like playstations are the only good things they make.  I heard that back in the 90's they were good and they they just went downhill.", "Date": "April 25, 2014"}, {"Title": "VERY GOOD PRODUCT", "Author": "Lol", "ReviewID": "R1X2KUHUFCD1KH", "Overall": "5.0", "Content": "YOU ARE A VERY GOOD QUALITY PRODUCT AND VERY HAPPY WITH EXCELLENT SERVICE YOU BUY FROM THIS STORE recommend CONGRATULATE FOR SHOPPING WITH FRIENDS", "Date": "January 22, 2014"}, {"Title": "never work right !!", "Author": "brian somers", "ReviewID": "RZVPYONN311RF", "Overall": "1.0", "Content": "got it for x-mas tried to use it right out of the box the flash never worked will never buy a sony again !!", "Date": "February 22, 2014"}, {"Title": "No litium battery!", "Author": "Maria Legon", "ReviewID": "R3LKT70Q7QEK95", "Overall": "4.0", "Content": "Tha camera is awesome but....no battery or charger included!It works with 4 common AA batteries...The Amazon product details MUST be changed!", "Date": "March 13, 2013"}, {"Title": "Piece of Dung", "Author": "swh60", "ReviewID": "RPYPAJ6Q798R5", "Overall": "1.0", "Content": "Extremely hard to keep pictures from being blurred due to lag in recording of images. aLSO Almost impossible to focus on single close up images. Bought to take pics of animal/insect/plants. Didn't realize problem was so extremely bad until after return policy. An EXPENSIVE PAPERWEIGHT NOW.", "Date": "October 8, 2013"}, {"Title": "Uses AA batteries, not a single proprietary Li-Ion", "Author": "Mike", "ReviewID": "R3U2653W188ICM", "Overall": "3.0", "Content": "Not a review, since I don't own the camera. Simply a helpful observation for potential buyers from the product page. The Amazon Product Details says this camera uses one (proprietary) Li-Ion battery. That is incorrect. This camera uses four AA batteries as stated in the Sony brochure in the Product Description.(I reported this to Amazon in January, but no change yet to the Product details.)", "Date": "February 14, 2013"}, {"Title": "Sony Cybershot H200 Black 20.1MP 26X", "Author": "Rodolfo Carrillo", "ReviewID": "R118KOSTAE6QKS", "Overall": "1.0", "Content": "Sony Cybershot H200 Black 20.1MP 26X Is a poor box with lense. better to buy a pocket camera. skip this camera", "Date": "December 31, 2013"}, {"Title": "not happy", "Author": "Candee", "ReviewID": "RID1LSHL0MCM", "Overall": "3.0", "Content": "I bought this camera for events and travels. I go to a lot of events with my kids, concerts, parks,etc. and We also go to Disney a lot as well. I needed a camera that was low on the blur and good with video. As much as I research I can never find a camera that I am completely happy with. Not only does this camera takes blurry pictures (I guess my hand shakes) It takes really horrible video. While in Disney I was recording a parade, it kept going out of focus. I had to zoom in and out in order for it to focus back, plus it was grainy. I feel like I need to take a camera course, just to find a camera that can do all the things I need it to do correctly. I was really rooting for the Sony...oh well there $200 down the drain.", "Date": "November 23, 2013"}], "ProductInfo": {"Price": "$249.99", "Features": "20.1 megapixel plus 26x zoom brings detailed subjects close\nOptical SteadyShot image stabilization reduces blur\nCapture your videos in 720p HD Movie mode¹\n3.0\" LCD screen for easy viewing and photo editing\nCreative shooting with Picture and Beauty effects/Item comes with and runs on AA Batteries (4).", "Name": "Sony Cybershot H200 Black 20.1MP 26X", "ImgURL": "http://ecx.images-amazon.com/images/I/41obykVkgSL._SY300_.jpg", "ProductID": "B00AQDG96K"}}