{"Reviews": [{"Title": "Handy for the price", "Author": "meathead1986", "ReviewID": "R204QMNIRM1CE2", "Overall": "4.0", "Content": "Got this camera in Guam during a TDY there. Overall the camera is really good for what it does and puts up with which is why I gave it 4 stars. Here are the pros and cons:Pros:1.  Camera is VERY easy to use and as previous reviews have stated it can automatically detect which settings to use.2.  It IS waterproof. I tested this and will have pics posted here soon for everyone. Pictures are of adequate quality for a point and shoot. It's no SLR but I didn't expect that when I purchased it. I wanted something mildly rugged and waterproof to take on outings with me but didn't wanna fork out big bucks for a Go Pro... never knew when I'd use it after this trip.. The Video I will give a 3.5/5. This may be due to improper video setup and I'll update this review after I've had more time to use the camera under different settings.3. Very compact and ultra-portable. This camera has an extremely small footprint and will fit nearly anywhere without taking up too much room. The build quality is very good for the price and I expect it to last a looong time.Cons:1.  The battery life... It does really kinda suck. That being said it is only 150$ and waterproof. Taking primarily videos i managed to squeeze out an hours with of footage and a dozen pictures underwater. If there were a way to swap batteries without fear of damaging the camera I'd gladly do that. I do intend to purchase at least 1 extra battery in the future and possibly a quick charger if one is available anywhere.2.  underwater when you take video you can hear every adjustment the camera is making with the auto-focus and every time you zoom in and out on things. And its not just a little bit but quite loud. This is something I can deal with for the price and what I need it for though but may be a deal-breaker for others.3.  In order to charge the battery the waterproof door has to remain open with the charger plugging into the inside of the camera itself. I don't understand what brought this idea to Sony (I would have the battery installed in a charger like nearly every other camera out there) so every time you charge it you have to ensure the camera will not fall. To make matters even worse the cord for the charge is quite short (about 2.5 feet). a longer 4-5 ft. cord would be much better.The things above were not a deal breaker for me as the camera is extremely tough and will be used only during small outings. As a whole the camera is pretty amazing for the price and I do recommend it. If the battery life were longer on it I would have given this 5 stars for sure.", "Date": "July 4, 2013"}, {"Title": "A small camera that's easy to use but functionally limited", "Author": "Michael Birman", "ReviewID": "R1S67ZMJI6XB7N", "Overall": "4.0", "Content": "Having been forewarned by previous reviewers that the Sony DSC-TF1 only accepts Micro-SD cards and that none are supplied in the box, I made sure that I had two on hand and I was ready when the camera arrived. The lack of a Micro-SD card in the box is not explicitly indicated so be prepared: you will need to provide your own. In fact, the Micro-SD card requirement for the camera is only indicated once on the box, in the guise of a logo that is nestled amongst other logos. This means that a critical requirement for the DSC-TF1 is easily missed unless the purchaser has been previously alerted. This apparent camouflage is extremely puzzling. There is a small residual charge in the new camera so fully charging it is necessary before initial use. The initial charging can take between 2-3 hours so be prepared to wait. Once charged, it takes about 5-15 minutes to familiarize yourself with the (relatively few) controls and settings before taking your first shots.Because the camera is limited to approximately 200 images per charge and the charging time is rather lengthy, the DSC-TF1 is functionally limited to those 200 images per day (or until you return home and recharge it before venturing out again). This is a significant limitation which you must take into account before purchasing. If you are a photographer who enjoys taking many images without worrying about time or other constraints, the DSC-TF1 will not satisfy your needs! If you are an occasional photographer who takes just a few desultory images, this limitation will not affect you. The picture quality is good for a camera of this size and with these specifications. There is no significant quality roll-off at the edges of the image, which can be a problem for some cameras in this price range. Once you have familiarized yourself with the camera, taking pictures will be second nature and quite fast. There will be few missed shots. The camera is very light but its structural strength seems a bit attenuated (it's not quite a toy but you won't be inclined to handle it roughly). I didn't take any underwater shots because it seemed prudent not to do so until I felt a bit more secure about its feasibility. The accessories packaged with the DSC-TF1 include an AC adapter, a rechargeable Lithium Ion type N battery pack, a USB cable and a wrist strap. The DSC-TF1 is a good camera for the price as long as you are sure that its functional limitations (i.e. the length of time required for charging and the approximately 200 images per charge) will not hamper you.", "Date": "April 6, 2013"}, {"Title": "Good photos, so-so video, caused Mac problems", "Author": "Jonathan K. Perkins", "ReviewID": "RWM370OW0H22A", "Overall": "3.0", "Content": "Overall I like this camera. I read other reviews which implied that the construction is flimsly, but I disagree. The camera is compact but solid, and is a good value.Photograph quality was quite good; I have a few Canon point & shoot cameras (and my wife has a Nikon), and this one matches those for image quality. It also is a bit more automatic than most that I've used before; it chooses modes like landscape, portrait, macro, and night shot automatically based on focal distance and lighting. That was a pleasant surprise.There were two problems, however. The first (which is minor) is that the camera uses micro-SD cards, and does not ship with one. It may be a worthwhile trade-off to use the smaller cards (smaller camera), but the cards are difficult to install and remove due to both their size, and their propensity to go in \"crooked\". On a related plus, the camera does seem to have a small amount of on-board memory, but that seemed enough for just a few snapshots.The more significant problem I had was related to the camera's videos and the Mac OS X environment. I'm using a brand new iMac with the latest OS, and every time I connected the camera (or inserted the card into the Mac) with any video on it, my two media-related Mac OS apps (iMovie and Aperture) would hang. This only happened when the camera/card contained video. Additionally, the video quality was not quite up to par (somewhat jumpy).I used the camera under water without any problems. It's a nice feature that also allows you to not worry so much when carrying your camera around on vacation and around water. Overall--a good point & shoot, and if I were able to resolve the Mac integration issues I'd have rated this four stars.", "Date": "April 13, 2013"}, {"Title": "Don't buy this camera - It gets leaked", "Author": "Ofelia", "ReviewID": "R3646RZ2MJ4R6E", "Overall": "1.0", "Content": "I bought this camera for snorkeling and in the second use, it got leaked and the camera doesn't work anymore. Although I followed all the instructions to seal it when I went underwater, the sealing mechanism didn't work.", "Date": "February 16, 2014"}, {"Title": "Great camera for the money", "Author": "faeriemyst", "ReviewID": "R33KN2K735KPMH", "Overall": "5.0", "Content": "Since I've been using cameras that are ten plus years of age that not only are battery hogs, but only hold x amount of pictures and are huge to boot, I just about jumped all over the camera when offered it through Amazon's Vine program. Admittedly, I was both trepidatious and ecstatic since the only two reviews at the time said the camera wasn't substantial feeling, so I was pleasantly surprised when I discovered it actually does feel substantial and has a nice weight to it too. The couple months I've been playing with the camera have made me more comfortable and knowledgeable with its functions, but right out of the box it was easy to figure out and use (after it had been charged, of course, which is typically about two hours).Pros:- I just love the gorgeous blue color. Yeah, this is a pretty shallow start to the list, but I just had to get that out first.- The size is just right. I've come across others which just seem too small to comfortably use without fear of dropping it while reaching for a button. Not too small or dainty, but not too large either.- The display is large enough to get a good gander at what's being shot.- I've been very happy at the quality of pictures/videos I've gotten out of it.- There's a thumb indentation on the back and rubber strip on the front for a better grip/hold while using.- It not only takes photos, but also panoramic shots and video as well.- Continuous shot. Having cats, I've been needing something like this so I can maybe get one good picture of my cats out of a hundred. Just choose that selection in the menu, hold down the button and voila!- Accepts the usual MicroSD cards and also some other one called memory stick micro.- Features an easy mode. The pictures are a different size than on normal mode.- Easy to use even in normal mode since it has a helpful guide already in the camera. Almost everything in the paper manual is explained in the menu.- Normal mode has automatic detection settings, such as night and day, focusing, smile detection, and more.- Never have to worry about using in the rain since it's waterproof. I doubt I'll ever take it underwater so can't comment on that.- There are numerous settings for one thing or another. Plus editing, beauty and picture effects. I haven't even been able to test them all out yet!- Not only waterproof, but also shockproof and dustproof as well. I'm not trying out the former if I can help it though.Cons:- The camera definitely needs a memory card. One is not included and there's hardly any on-board memory. The camera only took four to six pictures before it was full.- Awkward charging/computer connection station. The port is located where the battery and memory card slots are, which means the door has to remain open during this time. I'm afraid that eventually disaster will befall it and the door will snap right off. I understand that this design is most likely due to the camera's waterproofing, but it's still not ideal.Includes:- AC adapter- Rechargeable battery- USB cable (on the short side)- Wrist strap (it's actually nice, unlike some others I've come across)Overall, I have been thrilled with Sony's DSC-TF1/L 16 MP Waterproof Digital Camera with 2.7-Inch LCD (Blue) and hope it'll last for a reasonable amount of time. With the amount of features, along with the quality of pictures and videos, not to mention the camera itself, the price makes it a real steal. Highly recommended.", "Date": "May 12, 2013"}, {"Title": "Leaked during first usagge.", "Author": "John C. Masland", "ReviewID": "R1U7WTOXW712LX", "Overall": "1.0", "Content": "Despite meticulaous attention to the directions for sealing the case after loading batteries the camera leaked during first usage at depth of less than 15 feet.  We will be returning the camera and seeking refund.", "Date": "November 6, 2013"}, {"Title": "Great Sony Camera !", "Author": "Jasmine", "ReviewID": "R2UK88RRC37JEL", "Overall": "5.0", "Content": "First one I ordered had a mic problem so no sound for video, sent it back got a brand new one and it works amazing! The picture quality is so good you could even take black and white with only one specific color standing out...definitely worth my money !", "Date": "August 9, 2013"}, {"Title": "Great underwater camera!", "Author": "M. Pate", "ReviewID": "R1XMBU321KP9HU", "Overall": "5.0", "Content": "Works great underwater and takes great pictures!  Very pleased with it and have had no problems! Have used it in a swimming pool and then snorkeling at the beach.  No leaks and beautiful pics!  Even used just for sight- seeing!", "Date": "September 2, 2013"}, {"Title": "Amazing", "Author": "Ju", "ReviewID": "R3F9WIUNFMDYB9", "Overall": "4.0", "Content": "It's a great camera, really easy to use. Love it!!! I already took her to a water park and the beach, and really work under water!", "Date": "June 29, 2013"}, {"Title": "buy this product", "Author": "Sara V.", "ReviewID": "R178RBRYOL1RHW", "Overall": "5.0", "Content": "I totally recommend it.has lots of features, the model is beautiful, has everything you need a digital camera.es una excelente camara", "Date": "June 29, 2013"}, {"Title": "Worked for one day", "Author": "Ed Coppinger", "ReviewID": "R2HMYA86J4RL06", "Overall": "1.0", "Content": "We bought this camera specifically for our family's once-in-a-lifetime trip to Hawaii.  On the second day of use it went dead while snorkeling, the screen got condensation inside, and ever since it won't take a charge or turn on whatsoever.  I examined it when I came out of the water and the little warning strip on the battery door was not showing, so I don't believe it had anything to do with the door being ajar.Complete disappointment - and wasted opportunities to take great snorkeling pictures for the rest of our trip.", "Date": "July 23, 2013"}, {"Title": "Sony Waterproof Digital Camera - Blue", "Author": "M. Reynard \"kairosdreaming\"", "ReviewID": "R3JSFGLR7FD6YK", "Overall": "5.0", "Content": "So I may be a little in love with this camera.  I'm not a professional by any means, just a person who likes to take a camera with her on hikes and to family get togethers to do a little point and shoot of any cool photographic opportunity that may arise.  But I think this camera is perfect for that kind of use.The camera itself is on the small side (and a brilliant shade of blue).  There is an exposed lens in the upper right-hand corner, a flash in the middle, battery door (which also contains the spot for the memory card) on the bottom and screen and user buttons on the back.  There is also a spot on the side to place a strap for around your wrist (included).  It also comes with a cord for connecting to your computer and adapter for charging at wall outlets. It should be noted that the memory card has to be a micro, which I'm not thrilled about as I tend to lose the adapters, but can understand considering the size of the camera.  And you have to buy a memory card, this camera will only hold 5 or so pictures on its own and absolutely no room for video.  One of the buttons on the back is to switch between camera modes (shoot, panorama, and video) and what I love about it is that there are little indicator lights by each one so you know what mode you are in.Shoot is a standard camera setting, and it can be applied both above and underwater.  Panorama allows up to 360* shots and that too is for both underwater and above the surface.  And video of course is video, again underwater and above surface.  It should be noted that all of these modes have different features and effects that can be used with them.What makes this camera stand out from the regular point and shoot cameras is that it is waterproof.  That's right, waterproof.  And while it goes against my nature to plunge a digital camera I did just that.  As a test run I filled my sink with water, made sure the seal on the battery door was whole, and dunked it in.  And it did fine.  Clarity was just as good underwater for the screen as it was above water (although I'm sure the clarity of the water itself had a lot to do with that). You could also work all the buttons as normal (just don't open that battery door!).  I was able to switch between modes and try different types of settings for the underwater shooting, and the flash worked underwater as well, although it caused a few weird reflections (which is mentioned in the instruction manual).  Also in the instruction manual are the types of water situations you should not use this camera in (i.e. hot springs) and other rules.  I highly suggest reading that section before using this camera. And just as an extra precaution, when you set it in underwater mode, it will remind you to make sure the battery door is securely closed.The picture clarity above water was rather good as well.  It isn't professional standard, but I didn't have any of the haziness or unclear pictures that can sometimes happen with point and shoot cameras.  And there are so many different optional settings that can be found on this camera that different effects might be able to improve on picture quality problems.  Really the only issue I saw with clarity was for the video aspect, but I don't shoot a lot of video so this isn't a big deal to me.  Some of the cool settings for picture mode I experimented with are:Picture Effect:  This is an area for standard shot that has four different types of effects.  Toy, Pop, Part and Soft High Key.  I found the Part especially neat because you could take shots that just emphasized certain colors and left the rest dull.Scene Selection:  Besides the underwater feature lurking here, they actually have a pet selection so you can better photograph your pets.  There's features for shooting food, beach scenes with an emphasis on blue color, night shots, and other such situational scenes.Continual Shooting:  This allows you to take multiple pictures at a time while holding down the button instead of just one per press of the button.Smile Detection Sensitivity:  I had a lot of fun playing with this one.  You can have the camera automatically take a picture when it detects a certain width of smile (big, normal and slight) so you don't have to worry about pressing the button at the right time.Steady Shot:  I have a hard time standing still so my pictures tend to come out a little blurry.  This feature helps to adjust for that so my pictures are a little better.And these aren't the only features of course.  There were a lot I just haven't had the chance to use yet.  And there are a lot of features you can apply after the picture has already been taken.  For finding these features it is very easy to navigate the menu (and setup was guided at the very beginning of setting the camera up) but if you need extra help there is a button (and feature in the menu) for an in camera guide, so you don't have to lug around your booklet.I'm very pleased with this camera and can almost say with certainty that I won't be going to my Nikon for taking pictures as much.  This is much more compact, has really great features, and takes just as nice pictures in my opinion.  I can't wait to use it at my next mud run since I won't have to worry about destroying it!Review by M. Reynard 2013", "Date": "May 13, 2013"}, {"Title": "Leaked As Soon As It Hit The Water", "Author": "H. Curran \"English Bay\"", "ReviewID": "R2PBB7Z9CVL2Z1", "Overall": "3.0", "Content": "****UPDATE 05/06/2013********************Put battery in and camera operated with no problems. It had me reenter date/time info etc but everything looks good. Took some pics - all turned out well, I just won't immerse it again. On the plus side, it's obviously durable.****Original Review 04/13/2013***********I honestly think that I received a defective camera because it leaked the first time it came in contact with the water--battery compartment, behind the LCD screen. The battery compartment was never opened -per the instructions- obviously, because this would have broken the water proof seal. However when I realized that the seal wasn't working, I opened the battery compartment to see if it was wet inside and it was, dripping.Camera worked great till it came in contact with water, I posted a couple of the pics from the pool. The camera is very function friendly, the instructions are straightforward, easy to operate, takes great pictures as well as being small and compact - fits even in child's small shorts' pocket.After reading other reviews and seeing my issue is not the norm, I can only conclude that my camera was defective.", "Date": "April 13, 2013"}, {"Title": "Dont waste your money", "Author": "OK boy", "ReviewID": "R3K692SA3V76SB", "Overall": "1.0", "Content": "Just bought the camera in Summer and seldom use. Battery completed discharged within 3 days and need to reset all and Sony Repair cannot find and fix the problem. Poor Sony Support.", "Date": "October 23, 2013"}, {"Title": "Love it!!", "Author": "Mark Boswell", "ReviewID": "R2ZG5S2LJGW7FN", "Overall": "5.0", "Content": "This camera is awesome, got this camera to go on a cruise. It took awesome pictures underwater and awesome pictures above water too. I used this camera the whole time on our cruise, it was great. I would def recommend. The battery is pretty good, after using all day it would be low on battery, and then I would charge it, and it charges up really fast. Love this camera.", "Date": "June 6, 2014"}, {"Title": "Gift for my daughter", "Author": "Kathlyn Harris", "ReviewID": "R24QYNSRWOZXJ1", "Overall": "3.0", "Content": "The camera works well she is afraid to take it in the water, but she likes it.  I do not like how long it takes the camera to focus, but the pictures are great!", "Date": "May 12, 2014"}, {"Title": "The baterry has a short life but its brand new", "Author": "Louiedarkangel", "ReviewID": "R3FCSONQQXH9J5", "Overall": "2.0", "Content": "I've noticed that the baterry of my camera is very easy to disharge why is like that when i finish to take some picture and then review it less than 8min. The baterry is lo bat again! What's happening to my camera", "Date": "May 6, 2014"}, {"Title": "A very good camera that can be use underwater", "Author": "Argenis rodriguez", "ReviewID": "R215GPU21JSLHV", "Overall": "5.0", "Content": "Good quality camera, can take very good photos in good light situations for a compact camera, but has some problems of noise in low light environment still in high ISO modeThe panoramic mode works greatThe camera can be use underwater but you need to stay very close to the target and need a good amount of light (max 2 meters in a sunny day)Has a very good battery that can take full charge in a very short time", "Date": "April 25, 2014"}, {"Title": "works great", "Author": "paul w banks", "ReviewID": "RGKTBFGQYP2Y7", "Overall": "5.0", "Content": "i took this on our mexican wedding trip and it took a lot of great pictures. i never had a problem with water. i took pictures and video underwater during our snorkelling expedition and got a lot of good pics.", "Date": "April 25, 2014"}, {"Title": "Pretty decent camera. Worth the price", "Author": "S. Stenger", "ReviewID": "R286MLWVTRU407", "Overall": "4.0", "Content": "We bought this camera to take on our honeymoon for pictures underwater while scuba diving. Naturally, when you're under water you do need to get relatively close to your target for really good photos, but under water it was pretty good. It also took good pictures above ground. It is pretty comparable to our regular sony camera. Only negative was the lens fogged up a couple times after being in the hot sun, when it was used a long period of time. A few of our photos are a bit blurry. However, overall it was worth the money I paid for it.", "Date": "April 22, 2014"}, {"Title": "worked better than expected", "Author": "Jon Popelars", "ReviewID": "RTJQUH2H6IBXA", "Overall": "5.0", "Content": "Worked very well underwater.  Pictures in and out of water turned out well.  Was nice to have for a vacation with a lot of different activities.", "Date": "April 22, 2014"}, {"Title": "Ok", "Author": "MARK CRICHTON", "ReviewID": "R3MDQ2T07C1413", "Overall": "4.0", "Content": "The camera in general is pretty good the battery  life seems to be okay I recommended to someone who wants to have regular pictures but the person who wants telephoto things like that it does not have a great photo", "Date": "March 19, 2014"}, {"Title": "Gift for not so tech savvy senior", "Author": "Capt", "ReviewID": "R1P3IGC75DZXC7", "Overall": "5.0", "Content": "I bought this as a gift for my mother.  She's over 70, active and wants to share photos she takes.  32MB card is tiny, the frame you have to insert it in to make it a standard Scandisk card is a bit daunting, but the cable connection to the computer is helpful.  It charges the battery and connects her to the photos.She loves the waterproof nature - doesn't need to worry about rain - or setting it down on a wet bench or dropping it onto wet grass.  Turn the camera on and its ready to go - no need to wait for lens to deploy.  She likes it better than her old digital camera.I'd recommend this for anyone who likes taking photos but doesn't want to worry about keeping the camera dry.", "Date": "March 15, 2014"}, {"Title": "Very Good!!", "Author": "Dario Cortez Paré", "ReviewID": "R21U1JTNWS7C11", "Overall": "4.0", "Content": "I'm like, it's a good camera with a good price, and very compact e good quality in videos e pictures.", "Date": "March 11, 2014"}, {"Title": "Sony DSC-TF1/B Worth the price", "Author": "Daniel Adragna", "ReviewID": "R2I785J9EME3LQ", "Overall": "4.0", "Content": "I have only used the camera once, but the pictures came out clear. I took it down to 30 feet and did not have a problem. Just beware, you have to purchase a SD card separately.", "Date": "February 8, 2014"}, {"Title": "Made the perfect gift", "Author": "Megan Gerrard", "ReviewID": "RIFDHYZGRSVRA", "Overall": "5.0", "Content": "We gave this as a gift at the holidays and it was exactly what he needed.  Loved it and especially the waterproofing  when traveling the world in all kinds of weather conditions.", "Date": "January 24, 2014"}, {"Title": "light and easy!", "Author": "Geesebig", "ReviewID": "R39EWRQHWRLW66", "Overall": "5.0", "Content": "water and cold proof with a pocket size, the best camera you can get at this price. Best option for the skiing trip if you are not asking too much for the resolution.", "Date": "January 20, 2014"}, {"Title": "Good enough", "Author": "Danilo Rizzo", "ReviewID": "R1GYX4KKMXG78N", "Overall": "5.0", "Content": "Good quality, full of resources, easy to use and to go with to everywhere. My wife is loving it. Good enough.", "Date": "January 13, 2014"}, {"Title": "Sony DSC TF 1/L 16MP Digital camera fails minimum test", "Author": "Nevada_Mary", "ReviewID": "R14M23BC4Q7TZX", "Overall": "2.0", "Content": "Sony should really be ashamed of themselves.  After plugging the battery in overnight, it took 8 photographs and battery died.  Not acceptable.  Also, Memory chip is too small.  Yes, I can purchase an extra memory chip but why not include it with your product in the first place.  Two obvious defects:1) Battery included with product insufficient2) Memory chip inadequate for minimal usuage.Good quality, actually takes a very sharp photo.  Item is being returned.  Sorry Sony.", "Date": "December 26, 2013"}, {"Title": "Waterproof camera", "Author": "Miguel", "ReviewID": "R2DOCY4BB5OMTE", "Overall": "4.0", "Content": "The waterproof feature is amazing. It works just fine. The photos taken underwater have very good quality. but, care is needed regarding the cleaning of the camera.", "Date": "November 5, 2013"}, {"Title": "Great little waterproof camera", "Author": "C. Wright", "ReviewID": "R1ZOYWI7ITLZYR", "Overall": "4.0", "Content": "I haven't had any problems with my waterproof camera.  The only thing I wish was different was the zoom capability.  However, I bought it because I wanted a waterproof camera for when I'm swimming/diving/snorkeling in the shallows.The pictures come out beautifully too.", "Date": "October 6, 2013"}, {"Title": "Great camera it takes great pictures. My grandkids love using it when they go swimming", "Author": "Mary Shatto", "ReviewID": "R1BPQ3A6057DM0", "Overall": "5.0", "Content": "it takes great picturesI would recommend this camera to everyone it take good pictures. My grandkids love it when they go swimming", "Date": "August 6, 2013"}, {"Title": "not distinguish colors well into the evening and night", "Author": "Jose Romero", "ReviewID": "R2HI7GLHJJPZI6", "Overall": "3.0", "Content": "when you take pictures in the water is good, about 5 meters, beyond are confusing, the outdoor shots are good in normal light, but when you want a tropical sunset, with those bright colors distinguish not, your screen does not have a good contrast to see you take. your flash reaches about 4 meters and at night its colors are wrong.", "Date": "July 27, 2013"}, {"Title": "This camera is decent for shots not needing zoom", "Author": "C. Hamilton \"Latsyrc728\"", "ReviewID": "R2G8QJMGF8R4NQ", "Overall": "4.0", "Content": "This Sony Waterproof Digital Camera looks cheap, but it is really sturdy. The outside of the case is thick and it protects all of the internal components well to allow for the waterproofing. It does take a microSD card for memory which wasn't a problem for us since we had a few laying around for our phones. Since everything is inside, it is a little awkward to charge. You have to leave the cable door open to plug it in and charge it.This Sony camera has 16.1 megapixels and a 4x optical zoom which is pretty good for a waterproof camera (16.1 mp is good for any digital camera). Unfortunately, the 4x optical zoom falls short for us. We take a lot of our pictures at concerts, games and outdoor events. This camera has the sturdiness for an outdoor concert, it just does not have the zoom that we would like. So, it will not be our main camera.We will be using this camera primarily for the beach and cruises. We have not yet made it to the beach this year to test the camera, but I have played around with taking pictures of my hand underwater and it has worked great. No leaks or issues. I am excited to take the camera on a scuba trip in the (hopefully near) future.Overall, this camera takes good close shots and works well underwater. Just be prepared for the memory card, the weird charging situation and lack of a good zoom.", "Date": "May 16, 2013"}, {"Title": "Nice underwater camera", "Author": "Howard W.", "ReviewID": "R3KH3SGRN8QUE3", "Overall": "4.0", "Content": "I recently heard a report that a major complaint with the iPhone 5 was that is was too small, too light and too thin.That is my major complaint about this Sony underwater camera. It is hard to hold.  It is hard to push the correct buttons.  But you do get used to it.The other problem is the picture to picture time.  Once you take a picture it seems like several seconds before you can take another picture, though it is only just over a second (most times).Other than that it is a very nice camera.It takes beautiful pictures in and out of the water.  One note after coming out of the water, the lens does tend to spot.  So make sure you rinse it off well or wipe it.The panoramic function is easy to use and pretty cool.It also takes very nice videos.  Even underwater, though the sound is strange underwater (as expected).I've added some pictures to this pages as examples.I recommend this underwater camera.I've included some pictures as an example.I recommend this underwater camera.", "Date": "May 15, 2013"}, {"Title": "Replacing my old Canon", "Author": "Jerry Helsing \"jlhelsing\"", "ReviewID": "R5Y3334Y9V69R", "Overall": "5.0", "Content": "I am a SCUBA diver and am always on the lookout for a small camera that I can use for both above water and below.  Since I usually dive no deeper than 35 feet, this camera seemed to fit the bill.  What's better is the features available on this camera are better than my old Canon, it is faster than any other point and shoot I have ever used, and is small enough to fit into pretty much any pocket I want.  I would say the only drawback is the charger it comes with forces you to charge the battery in the camera making a spot that I can see will cause problems with water in the future.  Other than that, all my photos have been in focus and sharp. What else can a person looking for a point and shoot ask for really?", "Date": "April 3, 2013"}, {"Title": "Great camera - Great photos", "Author": "CJ-MO", "ReviewID": "R35PQYYK5JNHKQ", "Overall": "5.0", "Content": "This is a wonderful little camera that is easy to use and takes great pictures. That's the two main things I'm looking for in a camera of this type, so everything else is a bonus. I like the bright blue color which is good for adults as well as teens.The camera does need to be charged before using, but that seems to be pretty common for digital cameras of this style. The camera has some built-in memory, but I purchased a micro SD (Class 4) for more photo storage.I've not used the camera underwater yet, but I'm glad to have a camera that I can take to the pool or lake or take photos in the rain without worrying about splashes or mishaps ruining the camera. I couldn't be happier with how easy it is to use the camera and how well the pictures look.", "Date": "April 27, 2013"}, {"Title": "it's pretty good", "Author": "Values Privacy", "ReviewID": "R12KXBV56PTKFH", "Overall": "3.0", "Content": "The important thing is that it takes great pictures.I could get pictures in focus in pitch darkness (it has a red light that helps it focus).The colors look natural and it has a helpful help button.It's nice not to worry about water splashes and dirt etc.If I had to complain.The memory card: It doesn't come with a starter one. I carefully wrote down the requirements and got the right card right away. Also the memory card can go in, in any orientation. Trial and error will solve that but I don't know why it was designed that way.(disclaimer, I'm not a big fan of Sony and I tried to be fair. It pleasantly surprised me that they didn't require something proprietary like their old memory sticks.)EDIT Dec 2013:I lost the USB cable. I tried to find it on Sony's website but I had to call them since the part wasn't listed. It's a proprietary cable (there's the Sony I know and hate!) and it was about $25 to replace.", "Date": "April 15, 2013"}, {"Title": "Nice little camera that does a good job", "Author": "drebbles", "ReviewID": "R30I9U4YL25AJZ", "Overall": "4.0", "Content": "The Sony DSC-TF 1/L Digital Camera is waterproof (up to 33 feet), dustproof, freezeproof, and shockproof.  It has a 2.7 inch LCD screen, 16.1 megapixels, and has a 4X optical zoom.  You can take still photos, panoramic photos, and movies.  You can edit photos right on the camera (for example changing skin tones, removing shine, whitening teeth).  The camera also has \"Smile Shutter Technology\" that captures a smile the moment it happens.For the most part I really like the Sony DSC-TF 1/L Digital Camera.  The major thing I didn't like when I first got the camera was the memory card - I knew I would need one if I wanted to take more than five or six pictures but the camera only accepts Micro SD memory cards and I bought two memory cards before I bought the right one.  Once I got past the memory card problem (including the fact that the memory card is so small I first loaded it alongside the battery!)  I had a lot of fun using the camera.  I've used it in a variety of ways - still pictures, panoramic pictures, and movies - and it has done a good job with all of them (I haven't had a chance to use it under water yet).  I've taken pictures both inside and outside with varying degrees of light and have been pleased with the quality of all the pictures I've taken.  The camera is slim and lightweight - easy to carry in a pocket.  The only problem I've had with the camera (besides the memory card) is uploading pictures onto social media sites such as Facebook - I'm still trying to figure that one out.The Sony DSC-TF 1/L Digital Camera is a nice little camera that does a good job.", "Date": "April 11, 2013"}, {"Title": "camera doesn't work at all in panoramic, screen streaks purple", "Author": "Patti Gallagher-Jones", "ReviewID": "RMNQHDJ9MEHVB", "Overall": "1.0", "Content": "This is my second Sony DSC-TF1/L, returned the first and this one is just as bad. I have had cameras for the last 20 years and this is a bad product. Panoramic setting does not work , it gives error message that the camera has to be moved in one straight direction, of course...it's so sensitive it wont' finish the panoramic, especially if the lighting changes ...also the screen is constantly turning purple and streaking ...tired of trying to make it work...haven't even taken it in the water yet.", "Date": "August 30, 2013"}, {"Title": "A little big", "Author": "Grant Fritchey", "ReviewID": "R3N9TH5EP7EQPJ", "Overall": "4.0", "Content": "This is a nice camera for what it's meant for. Yeah, sure, in this day & age you can take decent pictures with most phones, but they quality is frequently junky and walking around with your phone on all the time can drain the battery pretty quickly. That's why I still like having a camera. This model is replacing and old Sony Cybershot (7.1mp). The 16.1mp pictures are a much higher quality. I've played with the water proof option, but haven't done any full dives into a pool, pond or ocean with it yet, but it works great. The controls are really easy to use and understand. I never even referred to the manual since it was so much like the old Cybershot. My only complaint is that this camera is bigger than the old one. It's at least 1/2 inch longer and an 1/8 of an inch wider. It's about the same width though. I was surprised. I compared it to my wife's higher end waterproof Sony (don't have it handy to get the model) and this one is a little bigger than that one too. It's no so big that it's problematic, but I'm kind of used to everything getting a little smaller these days.Other than that, the camera takes good pictures. It's quick to respond. It's very easy to use. I'm happy to have a newer camera to tote around and I'll get better quality pictures.", "Date": "April 7, 2013"}, {"Title": "Poor picture quality, only accepts M2, microSD/HC", "Author": "Jamie", "ReviewID": "R1GQP4VDVJZ9JE", "Overall": "1.0", "Content": "I have nothing positive to say about this camera.  I bought it for our honeymoon (three days away) and now have to find another solution quickly, because I am definitely not going to bring this piece of crap with me.Build: Cheap.  The door that is supposedly protecting the battery and memory card from water has considerable flex in it which leads me to believe it isn't sealing properly.  I didn't dare test it.  The menu button responds when it feels like it.  The display looks awful even in high resolution mode.Picture quality: Poor.  Purple haze/noise in the lower left hand corner of all pictures, but not in the right.  All pictures came out slightly blurry.  I played with the autofocus, facial recognition, and other settings I could find that I thought might help, I cannot get it to take an acceptable picture.Notes: Only accepts M2, microSD, microSDHC.  Not listed anywhere on the Amazon product page at the time of writing.Maybe I'm naive, but I can't believe Sony would release such an awful product.", "Date": "February 19, 2013"}, {"Title": "Fun little camera, easy to use", "Author": "KindlePad", "ReviewID": "R2KLHY699K2MFE", "Overall": "5.0", "Content": "We took this on spring break and used it in new mexico and also in the hotel pool. It performed great and the pictures were well saturated and sharp. I was nervous to use in the pool but no problems! Watertight! Also the menu and controls are big and easy to use which helps in the water. I let my kids hold it and use it during our trip sight seeing and they took some great shots with it. No complaints!", "Date": "March 28, 2013"}, {"Title": "Nice camera..", "Author": "Stephen \"radman2020\"", "ReviewID": "R1IC3HTBKC2W5E", "Overall": "4.0", "Content": "This is an easy to use camera.  It seems to take sharp images.  The flash works well.  People have complained that you must charge it through the camera.  I always get an extra battery and charger... not expensive on amazon... that solves the problem and gives you an extra battery.  It isn't the most solid camera I've ever used but certainly adequate.  I haven't dropped it to see how shock sensitive it is.  I am partial to these waterproof cameras now that quality is as good as non.  Why get a camera that can be ruined by water.  It is also nice not to have the lens extender that always seems to get sand in it.  This lens stays behind the glass and doesn't extend outside the camera.", "Date": "April 15, 2013"}, {"Title": "Sturdy compact which takes great photos", "Author": "Just ask me! \"bronxgal\"", "ReviewID": "R1AGN8QPPM0VZY", "Overall": "5.0", "Content": "Now that everyone's phone takes pictures, almost everyone walks around with a camera, but I like having a \"real\" camera with me at all times.When I first wanted a digital camera, in 2004, it was the Sony DSC T1, a flat model which could fit in my pocket, with a big screen, which appealed to me over its competitors.  It cost $450. from Amazon.  Three years later, I wanted a \"compact\" with a viewfinder, and the Sony DSC-H7 was the only one I could find.  It was $320.  Both have served their own purposes over the years, but the T1 finally gave in to the moisture and general banging around which any camera always in a user's bag or pants pocket will suffer.  I was therefore thrilled to see this waterproof/shockproof model, even smaller than the T1, in a feature in the April Popular Photography, especially since its list price is less than half what I'd paid for the camera I was replacing.(Since I have the Sony memory cards for these other cameras, and also have MicroSD cards for other devices, the \"odd\" memory card cited by another reviewer was not an issue, or so I thought.  It turns out that the MicroSD cards must be  Class 4 or higher. But they are readily available at Amazon and brick-and-mortar retailers, including Best Buy,)In an emergency, there is a very small amount of memory on the camera.Before using the camera, as with any electronic, it must be charged.  The battery has to be pushed in, in a way which does feel like \"forcing\", in order to get the battery eject lever to lock, as instructed.  The battery/memory card door must remain open during charging, which doesn't present as a desirable feature, since it is open to ambient dirt during that time, and a slip could cause the door to get out of alignment, if not break off.  I much prefer the way the H7 charges: the battery fits into a charger while the camera can be safeguarded elsewhere :)  Proof that this is not just paranoid speculation: my camera battery would not charge, even after cleaning the contacts, until I blew into the empty battery cavity a few times--I obviously dislodged some dust.The tiny cards which this camera uses are easily bent, and, unlike the battery, shouldn't be forced in.  Unlike much of the set-up, it is not intuitive, and the booklet should be reviewed, as it is possible to put the memory card in upside=down.Although there's a 16MB capacity for photos, it is easy to adjust to 8MB, 4MB and even farther down.  The menu indicates the benefits of each, including the lowest setting, for attaching to e-mails.  I wish I had this a few weeks back, when my photos from a family party had to span multiple e-mails because, with a 25MB mazimum for my e-mail provider, only two or three photos could be accommodated in each message.The camera has a number of fancy settings, including face-finding and smile detection, which may be useful for some.  But what I really like is that there is an \"EASY\" mode.  Considering that the kids in the family frequently  borrow my digital cameras to take photos during a family event--a win-win because they have fun and there are usually a few good ones--this is helpful.  I have been very happy with the photos I've taken with this camera so far.Downloading to the computer can be done via accessory card reader, which is usually my favorite method but, with the fragile tiny memory card, makes me a little nervous. So I've been using the USB cord.  The camera must be \"on\" and in memory mode, and then the computer (at least MY netbook) detects three different memories.  \"F\", on my computer, is the memory card.If you were hoping to learn from me how this camera performed underwater or used as a hockey puck, sorry to disappoint.  I will await the natural abuse which will, no doubt, be inflicted on it, and am happy not to worry about the possibility of rain, since I do expect to carry this camera with me everywhere.My pet peeve as to most electronics, this camera included: necessities, in this case, a memory card, are not included.  It seems petty not to include at least a starter card for an item which is otherwise useable right out of the box.  The few shots which one can take with the resident memory are just a \"tease\".", "Date": "March 23, 2013"}, {"Title": "Sorry Sony, I wish I could say that I liked this camera, but I really don't...", "Author": "W. B. Halper", "ReviewID": "R37AE2U5QHS4OC", "Overall": "1.0", "Content": "Even for a point-and-shoot camera, this camera takes lousy pictures.  It has a poor dynamic range, which basically means that a picture combining shade and sunlight has the bright areas washed out.  Strong colors oversaturate.  A simple picture I took of orange flowers in a hanging basket has orange fringes around each flower, bleeding into the background.  The shades of brown in the basket have been almost completely lost in the conversion to a .jpeg file.  A picture of some magenta impatiens have the petals merging into one big magenta blob.  My iPhone 4 has a lot less pixels, but produces much better looking prints.There are other things I could add, but since the primary purpose of a camera is to take pictures, and those are pretty abysmal, I won't mention the exposed unprotected window for the lens, the fact that the camera doesn't come with a memory card and you have to pop open the battery cover to access the micro-USB computer/charging port...which exposes the gasket to inevitable damage.My conclusion...you can do better.  If the light is flat and even, this camera produces decent pictures.  In the real world, with bright spots and shadows, it doesn't.", "Date": "May 2, 2013"}, {"Title": "I've been looking for a rugged camera...", "Author": "Laura I", "ReviewID": "R3U5W0WSZVUGGH", "Overall": "5.0", "Content": "Over the past 10 years, I've had a real struggle with digital camera's. Basically, I keep buying ones that cost under $200 and as soon a year is up and the warranty runs out, they break on me. I'm not a photo journalist, and I have no great need for a $900 camera. I want something with at least 10MP and some optical zoom, other features are a bonus. The problems I've had with my previous cameras seem to be that moisture and dust get into the lens and then it's all over from there. More often than not it's dust, only once has it been water damage.I thought this camera might be a solution, given Sony is touting it as waterproof, freeze proof, heat proof, dust proof, etc. I don't intend on taking it underwater (can't imagine the scenario given my hobbies), but keeping it free of moisture damage sounds like a good benefit. As far as the camera itself, it takes good pictures, given the specs of 16MP and 4x optical zoom. I also like that it automatically detects the type of shot your taken (night or day, etc) without having to manually select. It is a little bit large for what it is, but not overly so, note the dimensions on the description. That might be because it needs a protective casing, I'm not sure. Overall it takes great pictures and I'm hoping it'll outlast my previous cameras. I plan on updating this review when it dies.", "Date": "April 18, 2013"}, {"Title": "What You Need to Know BEFORE Buying this camera", "Author": "javajunki", "ReviewID": "R3HFA4GRLNCS00", "Overall": "3.0", "Content": "Right out of the box, this was a bit of a disappointment. Like many others, I expected to be able to use this right away and had planned to take it to the beach during a weekend get-away. It arrived in time but sadly, don't plan to use this without a bit of advance planning. You will need to purchase a Micro-SD card etc before using.Micro-SD cards. I own 3 digital cameras plus an assortment of other electronics so have SD cards everywhere...none of which work with this because it only accepts MICRO-SD cards and does NOT Include a complementary one in the box. That is annoying at a couple of levels but easy enough to live with if needed. Just be sure to ORDER a MICRO SD card when buying this camera if you hope to use it.Next, charging time takes about 2 hours. It does come with a slight charge (enough to see that it is working) but you will need to plan on charging before using. Why? Because to charge the battery you MUST plug in the entire camera with the slot open. There is no way to purchase a seperate battery charger that plugs into the wall or computer in order to charge another battery and then swap out. So, even if you buy a 2nd battery, you always have to install it into the camera in order to charge...and charging takes 2 hours each time. VERY poor planning!The next issue is that even on a full charge, the battery life will allow someone to take approximately 200 photographs before needing to charge again. Since you can't really swap batteries without plugging in the entire camera, even with a large memory card, you are limited by the battery to about 200 photo's per day...FAR fewer if you use any video/other higher resolution etc. Now, I don't know about you but I can snap away 200 photo's with ease and use up the entire battery life on video in no time flat.In short, the limitation of the battery life combined with inability to externally charge a battery are major design flaws that severely limit the usefulness of this camera.Combined with the annoyance of having to order a MICRO-SD card just to get it up and running (plus a Micro-SD adapter) is something to consider before buying.Now, having said all that, I did take a few photo's with the built in memory (very small) and this takes nice shots. It has a lot of easy to use features, a very intuitive menu, one or two of the buttons are not necessarily the most ergonomic but still highly functional. The panoramic is larger than that of a similar GE and doesn't require stiching together but is a bit more difficult to hold steady while panning. The ability to take a few underwater shots (don't expect to go all that deep) is a fun addition. Be sure to rinse and take other precautions as noted!Lightweight, I agree with others that the sealed area feels a bit weak and wonder how long it will last but for the time being, does seem to seal tight. Good take-along camera with a lot of nice little features. Easy to install wrist strap (a huge pet peeve of mine). Frankly, if not for the design flaws, this could be a stellar little camera. Unfortunately, it's not as compatible with toss and go as I'd personally prefer especially due to the battery limitation, charging issues and use of Micro-SD card/adapter.", "Date": "March 27, 2013"}, {"Title": "Disappointed.", "Author": "ALEXANDRE JUNG", "ReviewID": "R2V6OX0WV1PGIE", "Overall": "1.0", "Content": "The camera has few features.No one came or charger cable and when I opened the box I was very disappointed.", "Date": "February 5, 2014"}, {"Title": "get the split screen", "Author": "LERICY TORRES", "ReviewID": "R2YITXB9I9SJKR", "Overall": "1.0", "Content": "Screen Camera Game came and observed perfect shell apparently was at the time of assembly of the computer, but have lost the box where this came could not make the return if I can give some solution I thank you. Total disappointment with electronic equipment Amazon, sorry I lost the box", "Date": "January 20, 2014"}, {"Title": "Great camera", "Author": "Kona", "ReviewID": "RI4QS90AV367S", "Overall": "5.0", "Content": "I love this camera.  I'm usually helpless when it comes to setting-up a camera, but the instructions on the LCD were very easy to follow.  The display is bright indoors and out and the pictures are sharp and colorful.  The Sony photo-sharing site is easy to use, too.I like the bright teal color.  The waterproofing sides make it just a little larger than my small Canon, but it's still quite compact.The only design flaw is that you must open the battery door to charge the camera or connect it to your computer.Overall, I'm very happy with this Sony Cyber-Shot.  It looks well-made and it's easy to use.", "Date": "March 26, 2013"}, {"Title": "Good Toy", "Author": "Esperanza Ortiz De Orell \"John J. P.\"", "ReviewID": "R21NJ5AS38V1U", "Overall": "4.0", "Content": "Looks great, very light, it is very small and that is really good!!, not the best but takes good pictures, only bad thing ..... feels like a toy", "Date": "February 21, 2013"}], "ProductInfo": {"Price": "$199.99", "Features": "Certified waterproof (up to 33ft.) dustproof, freeze proof, and shockproof\n16.1 megapixel plus 4x optical zoom captures detailed subjects\nCapture your videos in 720p HD Movie mode¹\nOptical SteadyShot image stabilization reduces blur\nTake stunning images in Sweep Panorama mode-up to 360Degree", "Name": "Sony DSC-TF1/L 16 MP Waterproof Digital Camera with 2.7-Inch LCD (Blue)", "ImgURL": "http://ecx.images-amazon.com/images/I/41uoz6CRciL._SX300_.jpg", "ProductID": "B00AQDGAO6"}}