{"Reviews": [{"Title": "Loaded with great features, but average photo quality.", "Author": "Anthony Pantliano \"The Photo Guy\"", "ReviewID": "RV5BL9BDSPK1A", "Overall": "4.0", "Content": "<!--\n\nfunction fp_resizePlayerSpace(nsPrefix,w,h)\n{\t\n  try {\t\n    var ifrm = parent.document.getElementById(nsPrefix + \"movieFrameID\");\n    if (ifrm) {\t\n        var h2 = h + 35;\n        ifrm.style.height = h2;\n      }\n    } catch(err) {\n \n    } \n\n\n  if (h > 0) {\n      document.getElementById(nsPrefix + \"clipDiv\").style.height=h+\"px\";\n      document.getElementById(nsPrefix + \"videoPlaceholder\").style.height=h+\"px\";\n  }\n  else {\n      document.getElementById(nsPrefix + \"clipDiv\").style.height=\"\";\n      document.getElementById(nsPrefix + \"videoPlaceholder\").style.height=\"\";\n  }\n  document.getElementById(nsPrefix + \"flashcontent\").style.height=\"100%\";\n}\n\nfunction fp_rewriteDiv(nsPrefix,divName,html)\n{\t\n    document.getElementById(nsPrefix + divName).innerHTML=html;\n}\n\nfunction embeddingPopup(nsPrefix)\n{\n  alert(\"placeholder function for embedding code\");\n}\n-->\n\n\n<!--\n\nfunction cv_mo37UUXCCVSTFA6embeddingPopup(){\t\nalert(\"Embedding code will be displayed here.\");\n}\n\n-->\n\n\n\n\n\n\n\n\n\n<!--\nfunction cv_mo37UUXCCVSTFA6refresh_preplay() {\n\ndocument.getElementById(\"cv_mo37UUXCCVSTFA6chiDiv\").innerHTML = document.getElementById(\"cv_mo37UUXCCVSTFA6hiddenPre\").innerHTML;\n};\ncv_mo37UUXCCVSTFA6refresh_preplay();\n\n-->\n\n\n\n\n\n\n        // <![CDATA[\n\nvar cv_mo37UUXCCVSTFA6so;\t   \n\n\nfunction cv_mo37UUXCCVSTFA6loadSwf_Core(swfLocation, swfWidth, swfHeight, flashVersion, bgColor, swfParams, flashParams, embedAttributes) {\n\n  try {\n      cv_mo37UUXCCVSTFA6so = new SWFObject(swfLocation, \"cv_mo37UUXCCVSTFA6AMPlayerProd\", swfWidth, swfHeight, flashVersion, bgColor);\t   \n\n      for (var v in swfParams) {\n        cv_mo37UUXCCVSTFA6so.addVariable(v, encodeURIComponent(swfParams[v]));\n      }\n      for (var v in flashParams) {\n        cv_mo37UUXCCVSTFA6so.addParam(v, flashParams[v]);\n      }\n      for (var v in embedAttributes) {\n        cv_mo37UUXCCVSTFA6so.setAttribute(v, embedAttributes[v]);\n      }\n\n      cv_mo37UUXCCVSTFA6so.addVariable(\"swfEmbedTime\", new Date().getTime());\n\n      var agt = navigator.userAgent;\n       \n      var reFirefox = new RegExp(\"firefox/\", \"i\");\n      var regx = agt.split(reFirefox);\n      var ffVersion = 8;\n      if (regx[1]) {\n          var pts = regx[1].split(/[.]/);\n          ffVersion = parseFloat(pts[0] + \".\" + pts[1]);\n      }\n      var minorVersion = parseFloat(navigator.ap);\n      if ((navigator.appVersion.indexOf(\"Mac\")!=-1) || (ffVersion < 1.5)) {\n          cv_mo37UUXCCVSTFA6so.setAttribute(\"height\", swfHeight);\n          cv_mo37UUXCCVSTFA6so.setAttribute(\"width\", swfWidth);\n          cv_mo37UUXCCVSTFA6so.addVariable(\"oldFirefox\", \"1\");\t     \n      }\n\n      if (cv_mo37UUXCCVSTFA6so.write(\"cv_mo37UUXCCVSTFA6flashcontent\")) {\n          fp_resizePlayerSpace('cv_mo37UUXCCVSTFA6', \n                               320, \n                               283);\n      }\n      else {\n          var nsPrefix = 'cv_mo37UUXCCVSTFA6';\n\n          fp_resizePlayerSpace(nsPrefix, 0, 0);\n          fp_rewriteDiv(nsPrefix, \"flashcontent\", '<br/>To view this video download <a target=\"_blank\" href=\"http://www.macromedia.com/go/getflashplayer\" target=\"_top\">Flash Player</a> (version 9.0.115 or higher)');\n      }\n  } catch(err) {\n      fp_resizePlayerSpace('cv_mo37UUXCCVSTFA6', 0, 0);\n  }\n  return false;\n}\n\n\n\nfunction _cv_mo37UUXCCVSTFA6loadSwf(movieID, playerVersion) {\n    var swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/20120510035744301/AMPlayer._V148501545_.swf\";\n    var swfWidth = \"320\";\n    var swfHeight = \"100%\";\n    var flashVersion = \"9.0.115\";\n    var bgColor = \"#FFFFFF\";\n\n    var swfParams = {};\n    var flashParams = {};\n    var embedAttributes = {};\n    swfParams.amazonPort = \"80\";\n    swfParams.allowFullScreen = \"true\";\n    swfParams.telemetrySubPageType = \"VideoReview\";\n    swfParams.nsPrefix = \"cv_mo37UUXCCVSTFA6\";\n    swfParams.locale = \"en_US\";\n    swfParams.logUrl = \"gp/mpd/l\";\n    swfParams.canResize = \"1\";\n    swfParams.autoPlay = \"1\";\n    swfParams.sessionId = \"000-0000000-0000000\";\n    swfParams.marketplaceID = \"ATVPDKIKX0DER\";\n    swfParams.salign = \"LT\";\n    swfParams.preset = \"detail\";\n    swfParams.mediaObjectId = \"m2IS4NQ0X2C671\";\n    swfParams.autoPlayTimer = \"\";\n    swfParams.mediaObjectIDList = \"m2IS4NQ0X2C671\";\n    swfParams.playIsUserGenerated = \"1\";\n    swfParams.enableShare = \"0\";\n    swfParams.permUrl = \"gp/mpd/permalink\";\n    swfParams.telemetryPageTypeID = \"RV5BL9BDSPK1A\";\n    swfParams.xmlUrl = \"http://www.amazon.com/gp/mpd/getplaylist-v2/m2IS4NQ0X2C671/000-0000000-0000000\";\n    swfParams.amazonServer = \"www.amazon.com\";\n    swfParams.scale = \"noscale\";\n    flashParams.allowFullScreen = \"true\";\n    flashParams.salign = \"LT\";\n    flashParams.bgcolor = \"#FFFFFF\";\n    flashParams.allowScriptAccess = \"always\";\n    flashParams.quality = \"high\";\n    flashParams.wmode = \"transparent\";\n    embedAttributes.title = \"Flash Player\";\n\n    if (movieID){\n      if (playerVersion == '3'){\n        swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/20120510035744301/AMPlayer._V148501545_.swf\";\n        swfParams.mediaObjectIDList = movieID;\n      } else {\n        swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/legacy/20101014901/AMPlayerProd._V197491872_.swf\";\n      }\n      swfParams.xmlUrl = \"http://www.amazon.com/gp/mpd/getplaylist-v2/\" + movieID + \"/000-0000000-0000000\";\n      flashParams.wmode = \"transparent\";\n      swfParams.autoPlay = \"1\";\n    }\n\n    if (document.getElementById('cv_mo37UUXCCVSTFA6duration')) {\n      document.getElementById('cv_mo37UUXCCVSTFA6duration').style.display='none';\n    }\n    cv_mo37UUXCCVSTFA6loadSwf_Core(swfLocation, swfWidth, swfHeight, flashVersion, bgColor, swfParams, flashParams, embedAttributes);\n\n  return false;\n}\n\nfunction cv_mo37UUXCCVSTFA6loadSwf(movieID, playerVersion) {\n   return _cv_mo37UUXCCVSTFA6loadSwf(movieID, playerVersion);\n}\n\n\n\t\n\t\t// ]]>\n\t\n\n<!--\n\nfunction cv_mo37UUXCCVSTFA6newHeight(h)\n{\t\n    fp_resizePlayerSpace('cv_mo37UUXCCVSTFA6', 0, h);\n}\n\nfunction cv_mo37UUXCCVSTFA6resetPlayer(w,h,bw,cc) {\n  cv_mo37UUXCCVSTFA6newHeight(h);\n\n  cv_mo37UUXCCVSTFA6so.addVariable(\"resetBandwidth\", bw);\n  cv_mo37UUXCCVSTFA6so.addVariable(\"cacheCode\", cc);\n  cv_mo37UUXCCVSTFA6so.setAttribute(\"height\", h);\n  cv_mo37UUXCCVSTFA6so.setAttribute(\"width\", w);\n  cv_mo37UUXCCVSTFA6so.write(\"cv_mo37UUXCCVSTFA6flashcontent\");\n}\n\n-->\n\n\n\n\n\n\n\n\nvar cv_mo37UUXCCVSTFA6RollOverImg = new Image();\ncv_mo37UUXCCVSTFA6RollOverImg.src = \"http://ecx.images-amazon.com/images/I/916wUbObSIS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play-active,BottomLeft,130,-12_CR0,0,0,0_.png\";\n\nvar cv_mo37UUXCCVSTFA6preplay = document.getElementById('cv_mo37UUXCCVSTFA6preplayImageId');\nif (cv_mo37UUXCCVSTFA6preplay) {\n  cv_mo37UUXCCVSTFA6preplay.onmouseover = function() {\n    cv_mo37UUXCCVSTFA6preplay.src = \"http://ecx.images-amazon.com/images/I/916wUbObSIS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play-active,BottomLeft,130,-12_CR0,0,0,0_.png\";\n  }\n  cv_mo37UUXCCVSTFA6preplay.onmouseout = function() {\n    cv_mo37UUXCCVSTFA6preplay.src = \"http://ecx.images-amazon.com/images/I/916wUbObSIS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play,BottomLeft,130,-12_CR0,0,0,0_.png\";\n  }\n  \n  \n  var node = cv_mo37UUXCCVSTFA6preplay.parentNode;\n\n  var cv_mo37UUXCCVSTFA6currentClick = node.onclick;\n  node.onclick = function () {\n    var head = document.getElementsByTagName(\"head\");\n    if (head[0]) { \n      var logTag = document.createElement('script');\n      logTag.type = \"text/javascript\";\n      logTag.src = \"/gp/customer-media/du/log.html?ie=UTF8&p=CustomerImage&s=CustomerVideoPlay\";\n      head[0].appendChild(logTag);\n    }\n\n    if (cv_mo37UUXCCVSTFA6currentClick) {\n      return cv_mo37UUXCCVSTFA6currentClick();\n    }\n  }\n}\n\n\n\n\n Length:: 4:27 MinsThe Sony TX30 is a small, feature rich, and fun waterproof digital camera, so it's a shame the photo quality isn't better.(I'd like to preface this review by saying that I've owned the predecessor to this camera, the TX20, and it has stayed waterproof through the many water adventures I took it on.  I will also be bringing it up from time to time in this review to compare it to the TX30.)The TX30 is a very stylish and modern looking camera.  It's made of three different finishes - there's a matte plastic, a matte metal, and a textured glossy metal.  Together they make even the black TX30 look rich and different.  The materials and assembly quality are both high, and the TX30 feels solid and well assembled in the hand.  On the back of the camera is a 3.3\" OLED touch screen display that has a plastic cover.  The plastic screen is similar to the TX20's and scratches fairly easily, so be sure to use a case with the camera if you want it to stay flawless.  OLED screens tend to wash out in direct sunlight, and the TX30's is no exception, but you can raise the screen's brightness to fix that issue, as the default brightness is a bit dim.  The camera is very small (a little shorter and slimmer than a deck of playing cards), but there is not much space to grip the camera so you end up holding it gingerly by the edges.  Also, be sure to watch your fingers, as it's very easy to get them in the shot. One thing I'd like to point out is that the TX30 takes the slightly less popular Micro SD memory cards.The TX30 is positively full of great and useful features.  For those who want to let the camera do all the thinking for them there are two automatic modes.  One is the normal automatic, and the other takes multiple photos in quick succession and combines them for the best shot.  There is also a program mode than gives you control over ISO, metering, and white balance, amongst other things.  There is a custom white balance setting, which is a nice touch, but the TX30 lacks any sort of control over shutter speed or aperture.  Rounding out the shooting modes are a variety of scene modes, and art filters (pinhole, illustration, etc).  My favorite scene mode is the HDR mode, which takes photos in quick succession and combines them so you get one photo where both the shadows and highlights are properly exposed.  Another great feature is the sweep panorama.  It lets you stand in one spot and rotate as the camera shoots photos and stitches them together into one long photo.  It works perfectly about 90% of the time.  One very unique feature is the LED lights around the lens used for taking extreme macro shots.  They work well and light up your subject evenly.  Lastly, in playback mode there is a beatification feature that lets you tan yourself, remove wrinkles, and whiten teeth.  It's actually pretty effective when used subtly, but it won't tan your body, just your face.The Sony is rated to be waterproof up to 33 feet, an improvement over the TX20, and indeed I had no problems when using the camera underwater.  Just make sure that you clean the seal on the battery door of any debris, and rinse the camera in a dish of tap water for a few minutes after having it underwater.  Additionally, if you get any sunscreen on the camera make sure to wipe it off immediately as it can stain the camera's finish.Using the Sony is very simple.  It has just a shutter button, power button, zoom rocker, and a movie record button.  All of the other controls will be handled using the very responsive touch screen.  The touch screen has been improved over the TX20, and now responds instantly to commands.  You can also customize the functions that appear on the touchscreen and put those that you use most on the main screen.  One thing to bear in mind is that the touch screen does not function while underwater, so choose your camera settings before you dive! Built into the camera is an interactive owner's manual if you need help.Speed wise the Sony is blazing fast.  When you slide down the lens cover, it's ready to take the first photo in about 3 seconds.  It takes about 1 second to focus in good light, while in low light it may take just about a second longer.  It's ready to take the next photo almost instantly.  When continuous shooting you can shoot up to 10 full resolution photos at 10 frames per second, which is great for fast action.  When recording movies the camera takes about 4 seconds to start recording.  The only time the Sony makes you wait a bit is when zooming in to review photos in playback mode.The one place where the Sony TX30 is an average performer is for its photo quality.  While the photos are usually well exposed, have natural color, and proper focus, they lack fine details when viewed at 100% on screen, and look a bit \"mushy\" overall.  The situation only gets worse as the ISO speeds rise.  The good thing is that the TX30 goes down to ISO 80, while the TX20 only went down to ISO 125.  Additionally, the TX30 does a better job with detail and color than the TX20.  Despite the lack of detail, color saturation stays high all the way up through ISO 12,800!  I'd consider up to ISO 400 as where I'd prefer to shoot, while up to ISO 1600 is acceptable, and anything over that is for emergency use only as photos look less like photos and more like water color paintings.  If you don't look at your photos very closely, and usually print at 8' x 10' or smaller, you'll be very happy with the TX30's photos, but if you're critical you may be disappointed.  The optically stabilized lens stays fairly sharp in the corners wide open at wide angle, but the extreme right hand side of the photos are softer than the rest, and there is a bit of purple fringing to be found.Video quality is great on the TX30.  It takes full high definition video in stereo sound.  It also lets you use the optical zoom, and take a high-resolution photo without any interruption of the video.Battery life is good.  I was able to take a couple hundred photos, and handful of videos, and spend a lot of time reviewing photos and playing with the camera before the battery died.  The battery is charged in camera via USB.Two last things I'd like to mention is that this case fits the camera perfectly Case Logic UNZB-202 Compact Camera Case (Blue), and it's a good idea to buy this floater wristband so if you drop the camera while in the water it won't sink to the bottom Kodak Essential Floating Wrist Strap for Cameras - Orange.All in all... a great waterproof digital camera.P.S. If you have any questions leave me a comment and I'll reply as soon as I can.", "Date": "May 22, 2013"}, {"Title": "As Simple as You Want", "Author": "Mandy Payne \"Is it just me?\"", "ReviewID": "R2MFF8AHNCMLMZ", "Overall": "4.0", "Content": "I've been using this camera for about a week and have yet to take it underwater. However, I did take it to a Pirates game yesterday and it rained so hard that it felt as if we were underwater. I continued to snap amazing pictures of the storm, not worried at all about the camera getting drenched. We will be taking this camera snorkeling in the middle of next month.You can read all of the specs in the description, so I wont go into all of that. What I would like to share is my personal impressions of the camera thus far.I have been playing with all of the features...for a more advanced photographer, this camera does everything. Panoramic photos turn out incredibly clear, in spite of my lack of experience with the camera. The zoom is beyond incredible. And the photos come out so clear that I can blow them up and crop out individual faces for close up shots without losing any clarity. Gorgeous pictures. There are some really fun photo-shop effects you can do right on the camera.I love the size. However, I am in my early forties and have been going through that sight-issue, where I need bifocal glasses but go into denial that I am really old enough to need glasses. When i wear cheaters, this camera and its multi-functionality is awesome. When i am out and refuse to wear glasses, I can't see the camera (or a menu, or a map, or anything i need to read actually) very well. Fortunately, this camera has an Easy Mode that increases the font size and pretty much takes over for you.While I was out yesterday, I could really only see basically what I was trying to take a picture of on the small screen (large screen for the size of this camera, small screen for my old-lady eyes). I simply snapped the pictures and hoped for the best.When I came in last night and popped the memory card in the computer, I was shocked at how amazingly clear and really gorgeous the pictures turned out. Literally, I pointed and snapped the pictures. The zoom made us look like we had seats IN the dugout, when in reality we were way up in the stands. The pictures clearly showed the faces of the players on the field and the names on their jersey turned out crystal clear. Really incredibly impressed with the camera. I took a couple of shots of the city skyline from our seats and they look like professional shots...keep in mind that I personally could barely see the screen on the camera, so I played no part in their perfection aside from holding the camera. For testing purposes, I took a couple of pictures in my dark bedroom of my closet. The colors and brightness were perfect and without any shadows. The closet looked as if it were out in broad daylight.At one point during the game, the camera got knocked off the armrest and clattered under our feet on the cement. Not a scratch...not that I recommend knocking your camera around, but it was worth mentioning that it feels very durable.So far, I am very impressed with this camera. With my glasses, I can do so many fun things with the very intuitive and simple, responsive touch screen. Without my glasses, I can still Magoo my way to some pretty incredible photos. The battery life has been really good so far. We used it off and on all day yesterday and the indicator still reads full battery. The internal memory only holds about eight pictures, but I prefer memory cards anyway. The video camera feature is easy to use and, although I only tried a couple boring videos of the dog so far, I can definitely envision becoming a YouTube star in no time. The video played back very clearly on my iPad (which I can see because of the jumbo screen).Love it! I have nothing negative to say about this camera.", "Date": "May 24, 2013"}, {"Title": "GREAT UNDERWATER CAMERA BETTER THEN MOST WATERPROOF CAMERAS", "Author": "mom of 4", "ReviewID": "R1XWKRRM5IZID1", "Overall": "4.0", "Content": "I bought this for Vacation as an exclusive underwater camera hoping it would give good quality underwater pictures. For everyday I use a DSLR Canon 7D with many L lenses. I am impressed with this little camera.The underwater pictures are very good considering how small this camera is. You can't change settings underwater although you can use the zoom underwater. The pictures are good quality considering the size and keeping in mind it is a tiny point and shoot. I \"sometimes\" got lens HAZE/Glare like most underwater cameras do out of water (not all the time but sometimes depending on the lighting and what I was shooting).  Indoors the picture quality decreases unless you have good lighting, when you are desperate for lighting the flash works fine. You can also adjust ISO and EV  to further help with lighting situations. There is an AF Illuminator which helps to focus in pitch dark. You do have the option to turn this great feature off or on. This camera is very good for snap shots, digital family photo books, documenting, website sales/auction photos, traveling around water and underwater. I haven't compared it to iphone 5 photos but the quality is definitely much better then iphone 4 photos.I have one major complaint with this camera... the screen is ALL scratched up, thank goodness it still responses when touching it. This happened while snorkeling underwater, the camera was attached to my wrist. Maybe it floated across some coral or something. The front screen should be better protected then it is. Maybe a piece of magnetic plastic sheet over the screen would work underwater? I don't know.As stated in the directions the cover can get jammed with sand if not careful. Yes that is true... using it underwater did get some sand in it but I was able to clear it out. Don't force it close it if it gets sand in the cover, just rinse it and try to loosen the sand first to get it out.The rechargeable battery doesn't last as long as I would like, especially if you are constantly shooting so if you are taking it on a trip, boat or at the beach i highly suggest you get a  \"Portable\" Travel USB External Battery Charger for it (these work well for charging anything USB with rechargeable batteries on the go) so when you are on a boat or at the beach and there is no where to charge it.... you can charge it again before the next Dive or Snorkel right on the spot. You don't want your camera to die right in the middle of those important shoots.So you don't lose it in the water don't forget to buy the floating strap that Sony makes. The matching orange floating strap looks very nice with the orange camera and you could slip the camera in the strap sideways when not in use, which helps protect the camera in your bag or purse.here it is Sony STPFSA High Grade Handycam CamcorderAll in all the camera suit my needs but I still debate rather the money I paid for it justifies. I guess it does since I got some AWESOME underwater pictures of my family with ocean and freshwater life.  We swam with friendly Dolphins, Manatees, Stingrays and Tropical Fish at different locations. It was a vacation we will never forget so the pictures were very important to us to come out good underwater. The camera works well in Sea water and freshwater down to 33ft deep. I will upload some pictures and video of the picture quality so you can compare. Hope this helps", "Date": "June 28, 2013"}, {"Title": "Rugged and Waterproof? ***spoiler alert***", "Author": "Amazon Customer", "ReviewID": "R2BYWJEG1LA9CB", "Overall": "1.0", "Content": "This camera is advertised as being rugged and waterproof and those were my top 2 reasons for buying it. The camera housing cracked because a 5'4\" beauty dropped it from her pocket (approximately 2.5'). This was the 1st drop of any height in the 1.5 months of ownership. I sent it in for repair/replacement and the crack Sony Service Center promptly (5 weeks later) sent back the same camera with a new housing. I questioned them about the \"waterproofness\" of a new housing and was assured it was tested. Fast forward to a month later swimming with Whale Sharks in the Sea of Cortez and the waterproof camera lasted about 5 minutes before failing. Those would have been some nice pictures and video.I paid $330 for it when it was first on the market because I was tired of cheap ($100 range) waterproof cameras acting glitchy with poor image quality. I would support a purchase of this camera if you seriously baby it. Tons of great features. Since telling this story to friends, I kept getting the same response, \"why didn't you buy a gopro?\".", "Date": "September 22, 2013"}, {"Title": "Absolute Worst Experience Ever", "Author": "Melissa", "ReviewID": "R1T4PBYCDZDWC5", "Overall": "1.0", "Content": "If I could give this product a ZERO I would. I originally purchased this camera to replace my outdated Olympus camera. I received the camera and took it with me on vacation in May, within a day, the camera casing was coming apart....I did not drop it or hit it against anything, it was mostly in its case. The entire case of the camera was basically just falling apart. Since I purchased this through Amazon, they happily replaced it and sent another. I used it twice and otherwise stored it in a camera case. I went on vacation again in October, used it the first day. I had it on a cabinet in our hotel room and it fell to the floor. It worked fine, then all of a sudden the screen blacked out and it didn't work for our Half Marathon race. I didn't have any other means of taking photos, so I have no recorded memories of my race. Once I arrived home, I called Sony Support which has been an absolute nightmare. A note to anyone calling Sony...if the rep cannot solve your issue, they will simply hang up on you. They have absolutely no authority to try to solve your issue, not even the managers within the call center. It is still two weeks later, I still have a broken camera I cannot send back. I have a $360 piece of trash, I think I'll continue to use the $150 Olympus camera I purchased years ago that has been through drops in the mountains, swimming in the Caribbean and my 2 year old grandson playing with it! I will NEVER purchase a Sony product again. It is obvious that customer support and the products themselves are of very low quality.", "Date": "November 2, 2013"}, {"Title": "terrible purchase.", "Author": "M. Graham", "ReviewID": "R3549FD42F2SDY", "Overall": "1.0", "Content": "The in camera charging feature failed but SONY refused warranty service after three months accusing me of dropping the camera.  I  was able to charge the battery using a external charger (not provided when I purchased this device) and when I put the battery in the camera, the camera would drain the battery within 24 hours. SONY said the camera was dropped. This is 100% false. The camera had scratches on it from being rubbed against coral during a snorkeling trip. Customer service wanted $300+ to repair.SONY repair facility refused to reevaluate the camera.  It has only superficial scratches.I have owned more than a six SONY cameras and I own many other products from them, but never again since they can't honor a simple warranty claim. Even if it was dropped, this camera is supposed to be shock proof.What a waste of money!  I like SONY but after this experience they'll never get one more red cent from me.  Their asinine repair/warranty facility is the cause of another lost customer.", "Date": "November 13, 2013"}, {"Title": "Terrible product, terrible customer service", "Author": "Javier", "ReviewID": "R10TOCME9DRG0L", "Overall": "1.0", "Content": "After two or three uses under water, the camera stopped functioning.  It was within the one year warranty so we sent it for replacement.  SONY informed us that there would be no replacement because the camera was found with signs of corrosion.  So essentially, the camera does not work properly under water, and the warranty becomes void once you use the camera for its intended purpose.  If it had not happened to me I would think this was a Kafka novel.", "Date": "August 30, 2013"}, {"Title": "Many features, average picture quality", "Author": "A. Tegtmeier", "ReviewID": "RVIRZXTF3PRD9", "Overall": "3.0", "Content": "This camera is small, ruggedized, stylish and very good looking. And that is basically why you pay a premium price for it. The picture quality is okay, and the features are useful and plenty, but that alone would not warrant the premium price - other cameras that cost less offer the same.Pros:- Small and slim. Easy to carry in a shirt pocket, much smaller than the average smartphone.- Nice set of features. I especially like the de-focus function that blurs the background and thus separates the object from it. It is a bit tricky to make it work though - you have to get really close to your object (appr. 1 foot) to get this effect. Also, I like the sweep Panorama function a lot - that works perfectly after a few tries and is a lot of fun.- Quick start-up. You slide the cover down, and a second later the camera is ready to shoot.- The lens cover. Finally, an outdoor camera that has a lens cover. But, there are two slightly annoying things here: First, it happens that the cover slides open inadvertently when put in a tight pocket. No big deal, since the camera will turn itself off after a couple of minutes of idle time. Second, there is no handle, groove, or knob on the cover - you have to grab the upper edge with your finger (or finger nail) and press the cover down. Also, no big deal - for a guy with strong fingers, but maybe a problem for a gal with press-on fingernails.- Zooming. Quick and very precise.- Movie button. At the right place - easy to reach (directly under the shutter button), but not located where it would be activated inadvertently all the time.- Movie quality. Stunning. And the sound through the stereo microphone at the top of the camera is also very good.- Separate On/Off button. Very helpful when you just want to check the last picture or need to adjust a setting - the button turns the camera on, but since the cover is not open you can't take pictures.- Touch screen. Very responsive, customizable, bright and clear.- Menu. Easy to find the settings you want to change, logical structure.- Tough. Sealed against water intrusion for normal beach use, also shock proof against the normal bumps and bangs of daily life.Cons:- Picture quality is okay - for use with social media sites, small prints, and the like. At 100% magnification, there are visible blocks even at ISO 100.- The Zoom button. That is some flimsy round knob at the right outer edge on the top of the camera. Not real big-finger-friendly. It hurts me. Hate it.- Battery life. Well, half an hour of movies or about 150 pictures. Not quite a marathon runner ...- No different compression ratios for JPGs (e.g. small, normal, high). There is nothing to chose here, only one JPG setting - the default one, which the camera does not tell you what it is.- Micro-SD slot. You open the card slot cover, which also gives access to the battery, push the Micro-SD card and, whew, it comes flying out of the slot and lands ... well, where did it land? I can't see it on the dark carpet. Or maybe it jumped on the table, or under one of the chairs, or over the freakin' moon .... AAARGH! I absolutely hate it that they used this miniature format as the memory card. And then, they had the glorious idea to put a spring in the slot, that catapults it out of the slot like a bullet out of a gun.- Position of the left channel of the stereo microphone. It is there where a normal person would probably park their left index finger. Either you hold the camera with your fingernail on the left side, or you try to grip it at the bottom - which will lead to a rather awkward shooting position. Also, be careful with your left fingers anyway - because the lens is at the upper left corner of the camera, fingers can get in the way rather easily.In summary: This camera has some very nice features, an average picture quality, it is very small and looks very stylish, and it is water- and shock proof. It also has some annoying features and a short battery life. If they would fix the picture quality, it would be a great little camera. The way it is now, you should not expect too much from it.", "Date": "June 18, 2013"}, {"Title": "poor low light", "Author": "len", "ReviewID": "RA0SOYUFPLVGY", "Overall": "1.0", "Content": "Bought because previous sony low light pix were great.but this one is just horrible especially the video in low lights eg in concerts or clubs.very disappointed. should hv returned it but opened to try so probably cannot return to amazon.", "Date": "November 11, 2013"}, {"Title": "I had to get rid of it--INFERIOR PRODUCT...", "Author": "Daniel", "ReviewID": "RKR4FW753RB4O", "Overall": "1.0", "Content": "I owned a TX-5 (first offered in 2010)...then Sony's Laredo Repair Center messed it up.After several back-and-forth exchanges, they sent me a TX-30.  And I just had to get rid of it!--Touch Screen does not work underwater (unlike the TX-5--THIS IS A HUGE DEAL BREAKER FOR ME!)--Night photography often blurry and takes long to expose (unlike the TX-5)--Annoying Recording Button (unlike the...well, you get it)--Not a very bright flash--LED ring around the lens: A great feature that is BY NO MEANS EASY TO ACCESS ON THE MENU!--Menu options not very usefulI'm pretty sure those of you satisfied with your TX-30 WON'T BE, if/when you have to send it in for repairs at Sony's Laredo Repair Center!  Very disappointed in the product.", "Date": "October 8, 2013"}, {"Title": "Terrible Customer Relations: Sony does not honor their warrenty", "Author": "Beth Michaels", "ReviewID": "R3T0XSLT8T133R", "Overall": "1.0", "Content": "I purchased this camera after being sold on the durability aspect--\"tough yet stylish,\" \"Certified shockproof, dustproof, waterproof\" etc knowing that it carried a year warrenty and cost $260 convinced me it was a high quality point and shoot product. It worked just fine (thought the .modd files were annoying), nothing spectacular.A few months after I had the camera, I attempted to take the battery out to charge it and the small blue piece popped off. I contacted Sony regarding the repair and they directed me to send it in (had to pay for shipping) which I did as instructed. A few days later I received an email stating that the camera sustained physical damage not covered by the warrenty and that it would not be economical to replace it. I spoke with them explaining that it was simply during routine use of removal of the battery (I never challenged any of the durability claims) and they said they would not cover it. I asked what sort of thing the warrenty covered and they said, \"if something is wrong with the camera we will fix it.\" .... ????....I asked to speak with someone in customer relations who was no further help and became agitated and eventually appeald to the National Relations center and spoke with Frank (apparently the head of national relations) who stated that even though he admitted he would be upset if the same thing happened to him, they were still refusing to repair my camera or send me one that worked (they did offer to send me a comparable one for $200...???) stating that the physical damage voided the warrenty. I was accused of abusing or forcefully trying to remove it (I'm not even sure how one \"forcefully\" removes a battery, you pretty much just slide the blue piece open and it pops out...unless the blue piece snaps off when you try...)So I'm out $260 for trying to remove the battery.The camera itself works just fine, but Sony's Customer Relations is extremely poor and unprofessional. They obviously care very little about their reputation (and warrenty is completely meaningless) and I will not purchase products from them in the future.", "Date": "February 27, 2014"}, {"Title": "Like I would EVER buy another sony product.", "Author": "G Sass", "ReviewID": "R2NXWCRDP5WTRJ", "Overall": "1.0", "Content": "Had a problem with a latch that broke so we sent it back for repair 75$.. I used it once under water, the camera stopped functioning. It was within the 90 day warranty so we sent it back to SONY they informed us that there would be no replacement because the camera was found with signs of corrosion. So essentially, they can repair a waterproof door and that same door leaks, and the warranty becomes void. customer service? what customer service, they run you around until you give up. the C/S trainers should be proud. then they offer you a new camera for a price you can beat by 30-40 $ on Amazon a little more complaining and they you discounts on your future sony purchases. Like I would EVER buy another sony product.", "Date": "January 8, 2014"}, {"Title": "No good", "Author": "Vaz Man", "ReviewID": "R261YENXFGBLG8", "Overall": "1.0", "Content": "I only give it one star because you can't give it 0 stars. Not only is it not waterproof, it's not even water resistant.  First vacation, first day in the pool, less then in one foot of water and it leaked.  Sony couldn't fix it after 3 attempts, the warranty expired and they stopped responding to my requests.  Sony is definitely not what they used to be.  In my opinion they're just out for that quick buck now days.  The Sony quality has gone down the drain.My recommendation is to buy a camera from a known camera manufacturer.", "Date": "August 22, 2013"}, {"Title": "A major disappointment of a sony product", "Author": "Aron Brill", "ReviewID": "R1XYVA833GJDT7", "Overall": "1.0", "Content": "A major disappointment of a sony product, on day 4 it stopped working.  Water got in thru the battery compartment seal. The first thing to happen was while swimming in the ocean, sand filled the slide down lens cover from the surf as I was getting out.  I did not open the cover, however sand forced its way in.  The camera also does not respond to any monitor activated changes when wet.  You cannot be spontaneous and change any modes when it is wet!  The monitor is also impossible to see in strong direct sunlight, you have to find a shady spot to see anything.  The quality of the pictures is not great unless you are very close to the subject.  I love sony, but this camera is a major disappointment.", "Date": "March 30, 2014"}, {"Title": "Good enough to be your primary, but better as a secondary camera", "Author": "Ed", "ReviewID": "R11Y04IAFZQOYS", "Overall": "4.0", "Content": "Since buying a DSLR a couple of years ago and because of improved smartphone cameras, I haven't been a big user of point and shoot cameras. The Canon S90 was the last one I used on a regular basis. The Sony DSC-TX30 caught my eye because of its compact size and rugged features. Most waterproof/dustproof/shockproof cameras are much larger and don't look nearly as stylish as the TX30. After spending a few weeks with it -- mostly taking pictures of my kids -- I've come to really enjoy having it around. It's not without its flaws, but it's a fun camera to take with you where you wouldn't dare take another.PROS- Great waterproof photos/videos- Very small and portable- Large (3.3-inch) OLED touchscreen- Tons of features- In-camera effectsCONS- High maintenance when used in water- So-so battery life- No Wi-FiPhysically, I think the TX30 is considered a subcompact camera. It is very small and as a result, can be a challenge to grip when you first start shooting with it. It only has a few real buttons, while most of the features are accessed via the TX30's 3.3-inch OLED touchscreen, which is bright and responsive. I had no problems navigating the modes or the menu, and viewing the screen in direct sunlight was possible as long as I maxed out the brightness setting.The TX30 is a full-featured point and shoot camera, complete with 5x optical zoom, image stabilization, in-camera effects, 18.2MP sensor, HD video, and good low-light performance. However, the real appeal of the TX30 is in its stylish design and rugged features. It's waterproof up to 33 feet, shockproof for falls of around 5 feet, operates in temperatures as low as 14 degrees Fahrenheit and is dustproof. I loved being able to take photos of my kids at the pool and was very happy with the underwater shots. The only bummer about using it underwater is the maintenance involved in keeping it clean. I thought the TX30's photo quality in other conditions, including indoors and in low light, was about average for a subcompact.Overall, I think the Sony DSC-TX30 is a great little camera for those who can benefit from its rugged features. Its photo quality should be good enough for most people to use as their primary camera, though I'd lean more towards recommending it as a secondary camera. If you've got the budget and the need for a waterproof camera, you probably won't find one as stylish as the TX30.", "Date": "June 23, 2013"}, {"Title": "I like it but...", "Author": "Original Country Girl", "ReviewID": "R10S49JVJBO73A", "Overall": "4.0", "Content": "We have a TX 10, and a TX20 (2011 and 2012 models respectively). We LOVE this camera, and for almost 3 years we've had zero issues with it. With the TX 10 we were so impressed with the quality of photos and videos (I mean, the depth was amazing! Looking at it, it's like you're there!) that the next year we bought the TX 20 model when it came on sale for black Friday/cyber Monday of 2012. Originally, the purpose of buying the TX 10 was to be able to use it underwater during our trip to Hawaii. Frankly though, this is what happened...We loved the camera and the quality of the photos so much, and we read SO MANY negative reviews about Sony's customer service and so many reviews that said using it underwater fried it and Sony refused to replace or repair it, that we never took it near the water out of fear of ruining it for good.So, we paid extra money for a camera to use underwater, and now we're too afraid to use this feature for fear of losing our money when the camera breaks.There are so many reviews out there that say the people took the camera underwater in Hawaii, or the Caribbean etc and it worked so good, but then it fried. Upon contacting Sony they were told it was their fault because they didn't close the hatch on it the right way and water got inside and fried it. What angers me about this is that, if you OWN one of these cameras, you can clearly see that even a monkey could figure out how to close the hatch properly. And it's not like you're going to jump in the water with it hanging open, it would be majorly in the way. There is no \"procedure\" for closing the hatch. It doesn't close \"part way\" or any such thing. It's either open, or closed. So, once you push it closed, if it leaks it is a faulty product, NOT USER ERROR Sony.The only way I can see user error causing water to get into the camera is if you exceeded the depth allowance. I believe it says you can take down to 33ft. (Previous models TX 10 and 20 were only rated to 15ft I think. I'd have to check my paperwork to be sure...not that it matters since we won't take ours in the water though.) Who would use this at that depth? Perhaps the rare scuba diver, but most likely 99% of the folks using this underwater are families who are snorkeling at the surface and this camera would be lucky to see 5-8ft depths in most cases. Yet so many turn up with water damage.So, in short, we LOVE the cameras. Both are great. But neither will ever see water with us, because we know that if something does happen to the camera, Sony will try to tell us we are too dumb to know how to push a little hatch closed before getting in the water, and we'll be out of our money and our camera.Sony, this is a great product but clearly the waterproofing needs work and so does your customer service. So many customers have spoken up about how rude your service is and how you always blame the customer for any issues they have. That is not good business. So, we will NOT be buying any future TX cameras. We will move on to another brand that stands behind their products and doesn't blame the consumer for manufacturing issues.", "Date": "December 1, 2013"}, {"Title": "NOT water resistant", "Author": "Tom", "ReviewID": "RMFW33JOB5ERD", "Overall": "1.0", "Content": "The design looks cool but I guess we were unlucky.It was faulty and did not resist water. Ruined all irreplaceable pictures for our trip.", "Date": "October 25, 2013"}, {"Title": "Excellent compact digital camera, in or out of water, with 5x optical zoom", "Author": "For Real \"HAND\"", "ReviewID": "R1HTPVPVR8RGAU", "Overall": "5.0", "Content": "First off, I should mention that members of my family have owned the TX line since TX1 back in 2009 or so. My husband loved his TX5 and carried everywhere he went. We're a family into water sports, so we buy and use a bunch of different waterproof cameras, including Sony, Fujifilm, Olympus, and those drugstore disposables. Our last TX camera, which we still use, is a TX20 which was a great improvement over the TX10 in terms of speed.The TX30 brings further refinement to the series. The sliding mechanism that reveals the lens is smoother than ever, and it's flush with the front face of the camera when shut, unlike before. This is a very svelte design improvement. The TX30 now bumps the optical zoom range to 5x, equivalent to 35-175 in 35mm terms. Compared to 4x zoom, this is a welcome enhancement. Pixel count is also higher than ever, at 18.2 MP. As with the TX20, it has something called \"clear image zoom\" (up to 10x), which I believe was first introduced by Fuji but soon made popular by Panasonic. This is a technique that always takes a over-resolved image, and then crops it down to your desired resolution, resulting in a zoom that does not degrade the image quality as with digital zoom. All these top-brand cameras pack more pixels than the marketed pixel count, and apparently they have figured out a way to utilize these extra pixels more effectively! You get the 10x total zoom when you choose a lesser resolution; I don't have the manual in front of me right now so i don't remember which resolution, but it's still very high. Yes, you can zoom optically when you shoot videos; the manual warns of recording lens movement noise, but I haven't heard that in my videos yet.Sony also reduced the number of buttons compared to previous models. Gone is the physical playback button, which I will miss. BTW, the TX20 is super-cheap now, making it a great value for a high-quality waterproof camera. The TX30's OLED screen is bigger than before, at 3.3\" diagonal, and sports 1.3 million pixels vs. the 900k or so before. Images do appear very sharp on the screen, but I've always found OLED to have less brightness than the latest LCDs, so I'm not a fan of this type of screen. The touch screen is still not very sensitive and, gosh here in 2013, does not support multi-gesture. Good thing Sony makes the arrows and other on-screen icons big so they're easy to tap.Sony cameras always take ***GREAT*** videos, and the TX30 offers AVHCD (with .mts extension, great for HDTV) and MP4 (1280p, 720p and VGA) modes. Gone is the MPEG option, which only affects people who use older video editing software. Video quality is second to none, especially underwater.  Still pictures also come out very well balanced on the TX30. Over the years the TX series got better and better at outdoor image quality, while it's always been a top performer indoors. In the latter case, the TX30 continued to improve the auto white balance feature.  In summary, both photos and videos come out sharp and pleasant on the TX30. Coupled with improved operation speeds, it's a joy to shoot with this camera.  As with other pure consumer cameras, you do not get manual exposure or focus.We've never had any problem with all our TX cameras when it comes to using it in the water, whether it's the ocean or local public pool or bathtub. They've always been waterproof 100%. People who had trouble usually left the camera exposed in the sun for too long, which eventually degraded the rubber that offers the waterproofing seal, or did not clean the camera properly per instructions. Just flush it for a few seconds under tap water and let it dry, and the camera will reward you with years of loyal, reliable service.You can't go wrong with a Sony TX camera, especially this TX30!", "Date": "May 29, 2013"}, {"Title": "Great for rafting!", "Author": "TAC", "ReviewID": "R2XUARYE3OFQX2", "Overall": "4.0", "Content": "I just took this camera on a 1-week camping & rafting trip down the Grand Canyon...and I have tons of amazing photos because of it!Design:The camera is very attractive; I got it in pink, which is very eyecatching...and that's exactly what I wanted, so I wouldn't lose it!  It's very petite, looks to be about the size of a credit card, and is very light.  That means it was very easy for me to carry around EVERYWHERE - while hanging on to a raft, while body-surfing down a river, while hiking up a canyon cliff.  It comes with a no-frills wrist band - just a loop.  I have small wrists and was able to double-loop it around my wrist, which kept it taught and safe.  But I imagine someone with a bigger wrist would rather have a clip on it to tighten the loop around their wrist, which this doesn't have.  The slide cover, which switches the camera on, was also something I loved.  While there is a separate on/off button, sliding the cover was a super-fast way to snap some pictures really quickly, then turn it off.  I liked not having to mess with a lens cover that I'd need two hands to fasten. I could do EVERYTHING with this camera with just 1 hand - especially great if you need your other hand to hang on to a raft or a rock!The touch screen was one thing I was iffy about.  The default AUTO mode is really great, and basically all you need.....that and the panorama mode.  Just beware that panorama really drains the battery, so if you aren't able to charge your camera during your trip, be wary about panorama.  The extra \"filters\" you can process your photos with on the camera are nothing special, and personally I find them gaudy.  Auto mode is great (this is coming from a pro DSLR user).  I'm going through my Canyon photos in Lightroom right now and they're pretty well exposed.  So...while you can't use the touchscreen while underwater, like other reviewers have said, I don't think it really matters.  Just stick with Auto mode and you'll be fine.  I got some underwater videos and photos as well, while swimming in a creek and walking through a waterfall, and this camera is amazing.  I have so many shots that I otherwise couldn't have, and the price wasn't bad at all.Battery life:Like their site says, it dies after about 250 shots. I found this to be perfectly fine - do you really want to sort through 500pics/day of your vacation??  Remember when film cameras only let you have 20-something shots per roll?  Anyway, I found myself shooting around 100 a day, and that was more than enough.  Beware, however, that panorama mode and the other filter modes will drain the battery FAST, so I recommend just sticking to auto.  Even with capturing a few vidoes, you'll be fine this way.  If you're going to travel where you can't charge overnight, I highly recommend getting an external battery charger (like an Anker battery), since this camera can charge via mini-USB.  Another option is, get a spare camera battery to change on the fly, and also get the Anker battery to charge those batteries over night.Durability:It's shockproof claim is pretty good.  Like I said, I was rafting & hiking with this thing.  I was hitting rocks while swinging my arms to climb, banging it against the raft whenever we hit a rapid....it was great.  There are some superficial scratches on the touchscreen, but none of it interferes with functionality or ability to view anything.  The one thing that DID put a deep little scratch on my screen is when it got knocked in to a metal carbiner.  So...do NOT rub your camera screen against the edge of a carbiner, metal is stronger than this glass. At least it's just a small scratch and still doesn't mess with functionality or viewability at all - it's cosmetic.  But your true enemy is SAND!!!!  Understand, first, that sand is a huge problem for everyone, even pro users, and it's not entirely rational to believe your camera can defeat sand without you giving it some help.  Which I didn't REALLY give to this camera.  There was a lot of sand, and for the most part, the Cybershot DID do pretty well with it. But sand really does get everywhere, and the worst is the REALLY fine, tiny sand granules.  None of it got past the O-ring that seals the microSD/battery, thank God, but some sand did get in to the zoom button up top.  It wouldn't zoom out for 1-2 days, but by the 3rd day, the sand had worked its way out of my camera, and my zoom abilities returned.  On the front of the camera, right by the lens, there is some text - \"Carl Zeiss\" and other lens info.  This scratched off completely when some sand got under my camera lid as well.  I also have some vertical scratching on the pain under the lens lid, where the sand scraped everything, but again this is all cosmetic.  The lens is perfectly fine and still takes great pictures.  The lens cover still slides perfectly well.Conclusion:All in all, this was a great purchase, especially for the price (less than two-hundred dollars).  I got shots with it that I never would have gotten with my DSLR, thanks to its ruggedness, its tiny size and portability, and how easy it is to use with 1 hand.  This thing is definitely coming with me on future water-related trips.", "Date": "May 27, 2014"}, {"Title": "Very Pleased", "Author": "S. Wilensky", "ReviewID": "RN0YJMSVZ59HA", "Overall": "5.0", "Content": "I have owned several variations of the Sony DSC cameras and each one has met or exceeded my expectations. They are super easy to use, very slim, and produce excellent photos. Highly recommended.", "Date": "April 12, 2014"}, {"Title": "Great camera, until it broke.", "Author": "Penelope Pepperpants", "ReviewID": "RNI8CH8WW6NT3", "Overall": "3.0", "Content": "We have had this camera for a little over a year, and overall have been very happy with it.  The underwater photos and videos are particularly great- we were surprised at the underwater quality.  Unfortunately this past weekend we took it underwater and it stopped working.  Upon close inspection it appears that the battery door was cracked, which is where the water got in and ruined the camera.  Neither my husband or I have any recollection of dropping or damaging the camera, but now after taking it in the water it is completely ruined (won't even turn on).  Of course since we have had it for over a year, Sony will do nothing to help out.  Super disappointed as it was supposed to be \"shockproof\" in addition to being waterproof, and it cracked without either one of us even realizing it.  If you decide to buy this camera, be super careful with it and check it over VERY carefully for any damage before taking it underwater.", "Date": "February 10, 2014"}, {"Title": "Excelent, as usual", "Author": "Enrique Lavado \"Enrique\"", "ReviewID": "R224RPRMH4Y5QG", "Overall": "5.0", "Content": "I have severals sony cameras, included the DSC-TX20, I bought this one because comes with 18 MP, intead 16; the pictures are beautifull with a great definition and plenty of colors, and, being honest, I really enjoy the faces of persons around me when I get into the water with the camera in my hand and I start to take pictures, recently, an italian tourist aproached to me in a beach and asked me: Hey dude, don't you think you're gonna demage the camera introducing it into the water? After proper explanations, he promised me to buy one for himself", "Date": "January 9, 2014"}, {"Title": "awesome camera", "Author": "Bradley Frane", "ReviewID": "RZ15ZB81S6J60", "Overall": "5.0", "Content": "works very well. it takes awesome pictures above and below the surface of the water. would recommend if you are looki.g for an underwater camera.", "Date": "December 3, 2013"}, {"Title": "Fun camera to use. Waterproof. Great macro capability", "Author": "M. Erb", "ReviewID": "R154V71BJZ6BYM", "Overall": "4.0", "Content": "My impressions are mostly positive. This is a very compact sized yet competent camera. In fact, it is so compact that people with large hands will be challenged a bit in holding the camera without having fingers resting on the touchscreen or getting in the way of the camera lens.The size of this camera is about 3/4\" shorter than an iPhone4 but similar width and thickness.The camera has a CMOS sensor with 18.9 Megapixels. That's a lot of pixels to pack into such a small sensor but the initial round of photos I've taken have been quite impressive both in color, sharpness and overall quality. The Carl Zeiss 5X zoom lens is no doubt one of the reasons the images are so nice with this camera.Macro mode in this camera is outstanding. No, make that OUTSTANDING! What is so excellent about the macro mode is the fact that you can get so close to your subject and that the camera has a dedicated LED macro flash ring that provides just the right amount of illumination without blasting the subject as a regular flash would do. It's by far the best macro capability that I have ever seen in a point & shoot camera and rivals the quality of cameras far more expensive.The 3.3\" OLED display is a beauty to behold. It is bright, sharp and gorgeous.... well inside anyway. In bright light outside, it is extremely difficult to see and since the touchscreen is essential to making changes to all the settings, it's unfortunate that some sort of anti-glare coating was not applied to the glass. Perhaps there will be a third-party anti-glare screen guard to solve that problem.I found the touchscreen to be more or less responsive. \"Button\" presses seemed a little sluggish during the initial setup, but everything else I've done seems snappy. For instance in photo review mode, finger swipes are nearly instantly recognized and photos flip by quickly as you swipe.The battery is a NP-BN, 630mAh Lithium Ion and is rated to shoot approximately 250 images or up to 125 minutes. For movies, it is rated to operate 30 minutes for typical movie shooting or up to 60 minutes for continuous movie shooting (file will close after 29 minutes and a new file will resume recording). For simply viewing images, the battery is rated for up to 3600 images or roughly 180 minutes of viewing. The battery is charged \"in-camera\" using the AC charger and a USB to microUSB cable (provided). The microUSB port is inside the battery compartment and is awkward to reach as it is right next to the hinge side of the compartment door. Although you can operate the camera when a battery is inserted via USB connection to AC, it is very awkward to do so since you have to leave the battery compartment door open.When using the provided AC charger (Input: 100V-240V, 50Hz/60Hz, 70mA Output: 5V, 0.5A) the battery will fully charge in about 2 hours.The menu system is accessed completely by touches to \"buttons\" on the touchscreen. I feel it is laid out well and fairly intuitive. There are many shooting modes and many of then are actually useful if not at least fun to play with. You've also got a lot of \"Picture Effects\" such as Miniature (a tilt-shift effect), Toy Camera, Watercolor, etc. There are also a variety of \"Scene Selection\" modes to quickly optimize the settings for specific situations, like Night Scene, Landscape, Night Portrait, Beach, Snow, Underwater, etc.There is a Panorama Shooting Scene mode that assists you in creating panoramas. You can choose Standard, Wide, 360 degree or High Resolution panoramas. The sweep mode is easy, you simply click the shutter to start, then slowly move your camera in the direction of the onscreen arrow and the camera automatically captures the panorama and stitches it. There is also an underwater sweep panorama mode. Very cool.There are some weaknesses of the camera that I will briefly mention. When I update my review, I'll expand my review. The OLED display is beautiful but is not easily seen in bright light. It is a huge fingerprint magnet and glare/washed out image is a big issue in bright light.The built-in memory is virtually worthless and not 8GB as the Amazon description indicates.The camera body is small so large hands will have a difficult time keeping fingers off the touchscreen when shooting and keeping fingers out of the way of the lens.I dislike the position of the microUSB port. It is somewhat difficult to access and a bit of a hassle.Battery life is somewhat disappointing. Since the battery is charged in-camera and no external battery charger is provided, you'll probably need to have 1 or 2 charged spare batteries to keep shooting through out a long day. You are able to use the camera while it is charging, but because of the previously mentioned microUSB port position, it's not easy to do this. Plus the risk of breaking the compartment door is real.UPDATE: 5/27/2013 - I've been using the camera daily since getting it and still have mixed feelings. I'm quite disappointed in the performance of the OLED display in bright light. It is extremely difficult, if not impossible, to see well enough to easily make changes using the touchscreen. I am also very concerned about the long-term durability of the display panel since I've been very careful handling the camera and have already accumulated several significant scratches on the display. Very disappointing to discover it is plastic, not glass. Plastic is not durable.Battery life is not as good as I was hoping. I have had to charge the battery three times since I got the camera and I\"ve not taken more than 200 photos and only about 20 short videos while I have viewed the photos quite a few times and messed around with the menu system numerous times. I have left the display on for periods of time while messing with the camera. I hope that battery life will improve as I spend less time looking at the display for reasons other than framing shots and just shooting photos instead.I\"m not thrilled with the microUSB port being inside the battery compartment although I guess that the waterproof feature requires it be inside rather than outside the camera body. But it is entirely inconvenient to access and difficult to plug in to due to its close proximity to the hinge of the compartment door. With so much negative that I've mentioned, it may seem like I am entirely unhappy with the camera but that is certainly not the case. I am getting some great photos and videos from the camera. I am really enjoying the scene modes, particularly the Illustration mode which creates very interesting interpretations of photos that you take, sometimes spectacularly so.", "Date": "May 20, 2013"}, {"Title": "If you have the Sony tx20 do not up grade to this model,very dull lackluster", "Author": "Icewater", "ReviewID": "R1UW48PJ6O9Y6C", "Overall": "2.0", "Content": "Below average photos the images look soft dull and to a degree under developed.I have both models (tx20 and tx30) and this one is not good. In terms of speed and performance it is excellent but in the the end a camera is only as good as it photo quality .PASS ON THIS MODEL", "Date": "November 16, 2013"}, {"Title": "Good product", "Author": "Hardcore miner", "ReviewID": "R1EJ2ZYK1EKN81", "Overall": "4.0", "Content": "I saw this product with a friend of mine and I decided to buy it. So far I haven't had any problems with this camera and I'm completely satisfied with this one.", "Date": "October 23, 2013"}, {"Title": "Reasonable chance of failure", "Author": "Glaba", "ReviewID": "RZ7SPGNUL77LY", "Overall": "1.0", "Content": "Purchased this camera back in May. Used it for a couple of weeks, then switched it off.  One week ago (late October) I switched it on and got the dreaded error code C0:13:01 with \"reinsert memory card\" being displayed. Nothing was wrong with the memory card, but aparently Sony digital cameras have this common problem which (I later found out) happens quite frequently.Cameras fail.  That's normal. The problem is that my Camera is no longer in th U.S. as I am working out of another country now.  The local service center says my warranty does not apply and will charge me $55 to fix the problem which is a regular occurance, and is a flaw on the camera.I contacted Sony USA.  They want me to send it to Laredo, Texas for repairs. I explained to them that shipping it back would cost me as much as having it repaired locally. Shipping it back to me will also cost me another large (relative to the price of the camera) sum of money.  At today's price, this means i would pay 50% of the camera price to have it repaired.Unfortunately Sony is not willing to take responsibility for their flawed camera.  Obviously I will never again buy a Sony product. But for all of you out there, beware.  This might be a nice product, but Sony cameras have a definite history of this error.  I believe the service center in the U.S. will repair your product under warranty, but why would you buy a Sony when you know you are faced with a likely posibility of a failure?I have two Canon cameras, a Nikon and an Olympus.  They all work like a charm.  Not my Sony! oh, and beware of the Sony LIMITED warranty. It's only for the U.S. If you go on holiday outside of the U.S. (or even in the U.S.) take a backup camera.", "Date": "November 8, 2013"}, {"Title": "Good for what it is", "Author": "Pshen", "ReviewID": "R21O5Y2S98M733", "Overall": "4.0", "Content": "Combine this price point with the right expectations and you'll be very happy with this camera. Does it take the greatest, noise-free, color balanced photos? No. Is focus quick and always reliable? No. Is it slim, truly pocketable, waterproof, nice to look at, quick to shoot, and a provider of acceptable to good photos that are better than a cell phone? Absolutely. For me this is a backup or go anywhere camera. I'd of course much rather shoot with my RX-100 but if weather or size prevents me from taking that, then this is a great substitute.", "Date": "May 22, 2014"}, {"Title": "Two cameras, same error code and terrible Sony customer service.", "Author": "Lisandro", "ReviewID": "R2CQZTOX882K72", "Overall": "1.0", "Content": "I purchased the first camera and when I turned on there was an error message C:13:01. I contacted Sony customer service and as stated on other reviews they had no clue of what to say or to do, basically the person that answered the phone told me that the problem was related with the SD card (note: I tried three different ones) and they wanted me to purchase a Sony brand and told me to bring the camera to a local repair facility, repair a camera that I just purchased, it didn't sound good to me. The second camera came with the same problem, same error message. I used an 32 Gb SDHC Class 10 Micro SD card.", "Date": "April 23, 2014"}, {"Title": "Terrible Sony support", "Author": "montanamilt", "ReviewID": "R339JHGV3J58UX", "Overall": "2.0", "Content": "I loved this camera out of the box as both the picture and video quality were awesome. The display however is terrible as you can't see anything in daylight so changing settings is next to impossible. The display also scratched VERY easily and that soon became a problem. A corner of the display came loose, so I sent the camera to Sony's Laredo repair facility. The repair was going to be $207 so they offered me a replacement for $200 - even though a new camera is $249. At first I accepted the deal and they charged my VISA card. Then they reported they were out of cameras for replacement and asked that I call. I spent 45 minutes on hold only to have someone tell me I'd get a call the following week - which I did. I was given the same choice once again as if they didn't have a record of previous call. Frustration got the best of me so I asked to have the camera returned still broken. I have been a SONY-ONLY fan for years but no more after this incident. I will be replacing my junked Sony with the Canon PowerShot D30 Waterproof Digital Camera.", "Date": "April 22, 2014"}, {"Title": "Not Waterproof as billed", "Author": "Chris Bart", "ReviewID": "R3KC2ZE3IGY67X", "Overall": "1.0", "Content": "Puchased this camera to use snorkeling. Was pleased with photos, but after 7 uses, there was leakage in the battery area and it stopped working.  I had purchased the warranty, but the warranty does not include corrosion.  If you plan to use in water - forget it.", "Date": "April 10, 2014"}, {"Title": "Great!!!", "Author": "Jose Eduardo Perez", "ReviewID": "R2Z0PDVTNVZ7KA", "Overall": "4.0", "Content": "Very good product. I arrive just in time. The use underwater and all good, but some details level software. Better than I imagined. I feel very good about the purchase of this product. I give it 4 stars because nothing is perfect, I went to the beach and crisp, it's good to buy a bracelet to float, because you can lose. thanks amazon for make it a comfortable and cheap. do that more often.", "Date": "February 4, 2014"}, {"Title": "Great rugged camera/camcorder", "Author": "Yu-jin Chia \"Yu-Jin Chia\"", "ReviewID": "R3HOMT5DAM857H", "Overall": "5.0", "Content": "I gave away my Samsung HMX-W300 rugged camcorder to a friend's family and decided that the best replacement for it was a rugged point and shoot camera. Simply put, there's just not many rugged camcorders out there if you discount the GoPro and other \"action cam\" models- most of which have no viewfinder or image stabilization and are (in my opinion) ridiculously overpriced. My main purpose for having one of these is not to wear it around but to use it in places where it might get wet, dropped, or otherwise messed up- i.e. places I would not want to use my smartphone or DSLR to record. Good examples are the beach, around the baby's bath, or setting it on a mini tripod to record in public where someone passing by may knock it over. As such, I don't particularly care about fancy mount accessories and such- a simple tripod screw will suffice.A note on the HMX-W300: it was actually a darn good camcorder: full HD, compact, light, good battery life, almost instant-on, inexpensive. I was seriously considering buying another. However, there's a lot of rugged cameras these days that purport to do both good video and stills, and with optical zoom to boot. Taking still images and zoom were the two big downsides of the W300, which while not overly important for its intended purpose, were nice enough to have that I'd be willing to pay a bit extra for.There are a lot of rugged point and shoots out there now. Every major manufacturer has one, and they range in price from $100 to over $500. My budget for this was at most $250- I balk at spending more than that on a point and shoot of any kind and this was always meant to be an 'occasional use' camera behind my smartphone and DSLR.Straight up, the TX30 is a very good camera with many modes, a lot of features (e.g. subject detection, motion focus tracking, optical zoom), and is both compact and intuitive to use. It's touchscreen operated, and you can slide the protective cover to turn it on and off. It's also quite tough- I've already tested it a bit after that fashion.Pros:The slide lens protector/power on is simple and smart. It keeps the lens window protected when not in use- many other rugged cameras, though tough, can still get scratched or otherwise obscured very easily. No fumbling around for a tiny power button (it also does have one, if you want to just put it into USB mode or view pics).A lot of shooting modes including intelligent and superior auto, which takes several images and compiles them to produce a better shot. The auto modes work very well in general. It can shoot panoramic, background blur, and many other interesting effects.Face, subject type, motion detection and good focus. You can manually focus, but I've found it's usually unnecessary.Good viewfinder that's quite sharp and has touch controls. The touchscreen doesn't work underwater but there are physical shutter, zoom, and video record buttons. So unless you have to change shooting modes this isn't really a problem.Very compact and light. It's definitely the smallest rugged camera I've seen and smaller than a lot of non-rugged ones.Does not look like a ruggedized camera. Most of the other ones look like they were made for the military, complete with oversize bumpers and rivets. This one looks like a normal point and shoot, and is actually a bit stylish. You don't have to be embarrassed to carry it around in public.Shoots very good quality video (with stereo audio) and good quality stills. Video recording in bright light is particularly good. As for stills, it does fine if the target is staying still and is surprisingly good in low light for a point and shoot.UI is intuitive and responsive. Sony really has the interface down for these EVF cameras, and it can be customized.It is indeed waterproof. I dropped it in a pitcher of water, it came out working just fine. Also, the single compartment is unlikely to pop open if you rub it the wrong way, unlike the HMX-W300.PlayMemories is a decent sync package and quite intuitive. Works on both Mac and PC.Cons:No wifi built-in, and uses micro SD so no Eye Fi. So you're stuck doing the old fashioned cable sync. This isn't a huge minus, but it would have been nice to have.Does not to do video well in dim light- it gets pretty grainy. This is a problem with even a lot of dedicated camcorders, though, so is also not a big minus.Doesn't seem to handle moving subjects well for stills no matter what you do. Also, I know for a fact that quite a few non-rugged point and shoots simply perform better all around when it comes to stills. However, I've found that this is generally the case for any rugged hardware- it's just one of the tradeoffs for it being tough.Overall, I'm pleased with this purchase. I'll readily admit one of the main reasons I chose this over competitors is it simply looks less dorky. I don't want to be carrying around a camera that is practically screaming 'THIS IS A RUGGED CAMERA' by way of ridiculously bulky housing and styling that looks like something from Star Wars. This one is rugged and elegant at the same time- a rarity in electronics.", "Date": "January 18, 2014"}, {"Title": "Excellent Camera", "Author": "SeeSnow", "ReviewID": "RL8XFXQJEFJD3", "Overall": "5.0", "Content": "I bought this camera as a gift for my husband, specifically to take on a snowboarding trip we'd planned for the holidays. Neither of us are professional photographers by any means, but overall we have been extremely pleased with this camera. The pictures are great quality; especially the panoramas! We were particularly pleased at how well the night photos turn out. It does a spectacular job of picking up low light for a pocket camera. It also balanced the bright white of the snow on sunny days.I have had a Sony Cyber Shot since 2007 and it has gone all over the world with me. I only upgraded due to wanting the higher quality technological advancements have brought, my old Sony still works like a gem and my first impression of this one is that it will last just as long.My only complaint is that I don't love the touch screen feature. It works great, just a bit different to get used to. However, I understand the benefit of the touch screen in terms of water and dust proofing, so I will learn to live with it :) I'm very glad I chose this camera!", "Date": "January 8, 2014"}, {"Title": "Great Camera - very impressed with the quality", "Author": "Lbaz", "ReviewID": "RTLQ4BBM4MWRP", "Overall": "4.0", "Content": "A great camera that functions very well with great build quality.  Sony have turned their game around from recent years and this camera is great.  The touch screen is a little difficult - but the picture quality is great and the ability to take photos underwater is just awesome.", "Date": "October 27, 2013"}, {"Title": "Battery ran out too fast !", "Author": "Ayman K. Allam", "ReviewID": "R1MUJ8Y7G7ADAU", "Overall": "1.0", "Content": "The Camera itself is good .. but after fully charged, the batter runs out in a couple of hours, without using !!!!!", "Date": "February 23, 2014"}, {"Title": "Be aware screen is terrible", "Author": "M P Lokuta", "ReviewID": "R1AZ0DHE4S10OY", "Overall": "2.0", "Content": "Be aware, if using the camera outside in sunlight the screen is almost impossible to see!!!! How could Sony make a camera with a screen that is useless if used outside. Other than that it's okay camera. Just being honest.", "Date": "August 20, 2013"}, {"Title": "Fantastic! Could be faster! Better glass for scratches!", "Author": "Eric A. Hofstetter", "ReviewID": "R15YUGNMNBZCDO", "Overall": "4.0", "Content": "I've had my SONY camera for almost a month now, and here is what I've concluded.  The bad first:  Glass display.  Not sure of what kind of glass used, but it sucks.  Smallest thing that CAN scratch glass, WILL scratch the glass.  Should be a lot more durable.  Speed is a bit slow when snapping pics.  The processing should be snappier.  Charging could be more convenient, BUT due to the unit being SHOCK, WATER, ELEMENT proof, I can oversee it.  Other than those three big things... this is an OUTSTANDING point and shoot COMPACT camera!  Size is awesome!  Easy to hold, cary, and shoot anything on the fly!  Telephonto/ Wide lenses work fantastic.  I'm quite amazed at the digital zoom aspect of this little guy.  Pictures come out quite well at extreme digital zoom.  On the opposite end, the MACRO feature blows me away!  I've got an iPhone 5 with an Olloclip that CAN NOT do near as well or get as close as this camera.  The underwater feature, which simply put I was a little reluctant to even try, works great.  Including the microphone under the water.  I followed my son into the water once he jumped in, and heard all the bubbles and him trying to speak under water.  Super cool.  The quote of the day, at the pool, on the first time giving it a try... \"I'm going to laugh so hard if it doesn't work dad!\"  Yes, I thought I would too!  Highly recommend this Sony camera... FOUR SOLID STARS.", "Date": "June 16, 2013"}, {"Title": "Underwater Fun", "Author": "P. Bergbauer \"Reading Raven\"", "ReviewID": "R19TNZDBQ9ED55", "Overall": "4.0", "Content": "<!--\n\nfunction fp_resizePlayerSpace(nsPrefix,w,h)\n{\t\n  try {\t\n    var ifrm = parent.document.getElementById(nsPrefix + \"movieFrameID\");\n    if (ifrm) {\t\n        var h2 = h + 35;\n        ifrm.style.height = h2;\n      }\n    } catch(err) {\n \n    } \n\n\n  if (h > 0) {\n      document.getElementById(nsPrefix + \"clipDiv\").style.height=h+\"px\";\n      document.getElementById(nsPrefix + \"videoPlaceholder\").style.height=h+\"px\";\n  }\n  else {\n      document.getElementById(nsPrefix + \"clipDiv\").style.height=\"\";\n      document.getElementById(nsPrefix + \"videoPlaceholder\").style.height=\"\";\n  }\n  document.getElementById(nsPrefix + \"flashcontent\").style.height=\"100%\";\n}\n\nfunction fp_rewriteDiv(nsPrefix,divName,html)\n{\t\n    document.getElementById(nsPrefix + divName).innerHTML=html;\n}\n\nfunction embeddingPopup(nsPrefix)\n{\n  alert(\"placeholder function for embedding code\");\n}\n-->\n\n\n<!--\n\nfunction cv_mo2ZJ90D6POD74LembeddingPopup(){\t\nalert(\"Embedding code will be displayed here.\");\n}\n\n-->\n\n\n\n\n\n\n\n\n\n<!--\nfunction cv_mo2ZJ90D6POD74Lrefresh_preplay() {\n\ndocument.getElementById(\"cv_mo2ZJ90D6POD74LchiDiv\").innerHTML = document.getElementById(\"cv_mo2ZJ90D6POD74LhiddenPre\").innerHTML;\n};\ncv_mo2ZJ90D6POD74Lrefresh_preplay();\n\n-->\n\n\n\n\n\n\n        // <![CDATA[\n\nvar cv_mo2ZJ90D6POD74Lso;\t   \n\n\nfunction cv_mo2ZJ90D6POD74LloadSwf_Core(swfLocation, swfWidth, swfHeight, flashVersion, bgColor, swfParams, flashParams, embedAttributes) {\n\n  try {\n      cv_mo2ZJ90D6POD74Lso = new SWFObject(swfLocation, \"cv_mo2ZJ90D6POD74LAMPlayerProd\", swfWidth, swfHeight, flashVersion, bgColor);\t   \n\n      for (var v in swfParams) {\n        cv_mo2ZJ90D6POD74Lso.addVariable(v, encodeURIComponent(swfParams[v]));\n      }\n      for (var v in flashParams) {\n        cv_mo2ZJ90D6POD74Lso.addParam(v, flashParams[v]);\n      }\n      for (var v in embedAttributes) {\n        cv_mo2ZJ90D6POD74Lso.setAttribute(v, embedAttributes[v]);\n      }\n\n      cv_mo2ZJ90D6POD74Lso.addVariable(\"swfEmbedTime\", new Date().getTime());\n\n      var agt = navigator.userAgent;\n       \n      var reFirefox = new RegExp(\"firefox/\", \"i\");\n      var regx = agt.split(reFirefox);\n      var ffVersion = 8;\n      if (regx[1]) {\n          var pts = regx[1].split(/[.]/);\n          ffVersion = parseFloat(pts[0] + \".\" + pts[1]);\n      }\n      var minorVersion = parseFloat(navigator.ap);\n      if ((navigator.appVersion.indexOf(\"Mac\")!=-1) || (ffVersion < 1.5)) {\n          cv_mo2ZJ90D6POD74Lso.setAttribute(\"height\", swfHeight);\n          cv_mo2ZJ90D6POD74Lso.setAttribute(\"width\", swfWidth);\n          cv_mo2ZJ90D6POD74Lso.addVariable(\"oldFirefox\", \"1\");\t     \n      }\n\n      if (cv_mo2ZJ90D6POD74Lso.write(\"cv_mo2ZJ90D6POD74Lflashcontent\")) {\n          fp_resizePlayerSpace('cv_mo2ZJ90D6POD74L', \n                               320, \n                               283);\n      }\n      else {\n          var nsPrefix = 'cv_mo2ZJ90D6POD74L';\n\n          fp_resizePlayerSpace(nsPrefix, 0, 0);\n          fp_rewriteDiv(nsPrefix, \"flashcontent\", '<br/>To view this video download <a target=\"_blank\" href=\"http://www.macromedia.com/go/getflashplayer\" target=\"_top\">Flash Player</a> (version 9.0.115 or higher)');\n      }\n  } catch(err) {\n      fp_resizePlayerSpace('cv_mo2ZJ90D6POD74L', 0, 0);\n  }\n  return false;\n}\n\n\n\nfunction _cv_mo2ZJ90D6POD74LloadSwf(movieID, playerVersion) {\n    var swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/20120510035744301/AMPlayer._V148501545_.swf\";\n    var swfWidth = \"320\";\n    var swfHeight = \"100%\";\n    var flashVersion = \"9.0.115\";\n    var bgColor = \"#FFFFFF\";\n\n    var swfParams = {};\n    var flashParams = {};\n    var embedAttributes = {};\n    swfParams.amazonPort = \"80\";\n    swfParams.allowFullScreen = \"true\";\n    swfParams.telemetrySubPageType = \"VideoReview\";\n    swfParams.nsPrefix = \"cv_mo2ZJ90D6POD74L\";\n    swfParams.locale = \"en_US\";\n    swfParams.logUrl = \"gp/mpd/l\";\n    swfParams.canResize = \"1\";\n    swfParams.autoPlay = \"1\";\n    swfParams.sessionId = \"000-0000000-0000000\";\n    swfParams.marketplaceID = \"ATVPDKIKX0DER\";\n    swfParams.salign = \"LT\";\n    swfParams.preset = \"detail\";\n    swfParams.mediaObjectId = \"m8RQGPSL0LBVE\";\n    swfParams.autoPlayTimer = \"\";\n    swfParams.mediaObjectIDList = \"m8RQGPSL0LBVE\";\n    swfParams.playIsUserGenerated = \"1\";\n    swfParams.enableShare = \"0\";\n    swfParams.permUrl = \"gp/mpd/permalink\";\n    swfParams.telemetryPageTypeID = \"R19TNZDBQ9ED55\";\n    swfParams.xmlUrl = \"http://www.amazon.com/gp/mpd/getplaylist-v2/m8RQGPSL0LBVE/000-0000000-0000000\";\n    swfParams.amazonServer = \"www.amazon.com\";\n    swfParams.scale = \"noscale\";\n    flashParams.allowFullScreen = \"true\";\n    flashParams.salign = \"LT\";\n    flashParams.bgcolor = \"#FFFFFF\";\n    flashParams.allowScriptAccess = \"always\";\n    flashParams.quality = \"high\";\n    flashParams.wmode = \"transparent\";\n    embedAttributes.title = \"Flash Player\";\n\n    if (movieID){\n      if (playerVersion == '3'){\n        swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/20120510035744301/AMPlayer._V148501545_.swf\";\n        swfParams.mediaObjectIDList = movieID;\n      } else {\n        swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/legacy/20101014901/AMPlayerProd._V197491872_.swf\";\n      }\n      swfParams.xmlUrl = \"http://www.amazon.com/gp/mpd/getplaylist-v2/\" + movieID + \"/000-0000000-0000000\";\n      flashParams.wmode = \"transparent\";\n      swfParams.autoPlay = \"1\";\n    }\n\n    if (document.getElementById('cv_mo2ZJ90D6POD74Lduration')) {\n      document.getElementById('cv_mo2ZJ90D6POD74Lduration').style.display='none';\n    }\n    cv_mo2ZJ90D6POD74LloadSwf_Core(swfLocation, swfWidth, swfHeight, flashVersion, bgColor, swfParams, flashParams, embedAttributes);\n\n  return false;\n}\n\nfunction cv_mo2ZJ90D6POD74LloadSwf(movieID, playerVersion) {\n   return _cv_mo2ZJ90D6POD74LloadSwf(movieID, playerVersion);\n}\n\n\n\t\n\t\t// ]]>\n\t\n\n<!--\n\nfunction cv_mo2ZJ90D6POD74LnewHeight(h)\n{\t\n    fp_resizePlayerSpace('cv_mo2ZJ90D6POD74L', 0, h);\n}\n\nfunction cv_mo2ZJ90D6POD74LresetPlayer(w,h,bw,cc) {\n  cv_mo2ZJ90D6POD74LnewHeight(h);\n\n  cv_mo2ZJ90D6POD74Lso.addVariable(\"resetBandwidth\", bw);\n  cv_mo2ZJ90D6POD74Lso.addVariable(\"cacheCode\", cc);\n  cv_mo2ZJ90D6POD74Lso.setAttribute(\"height\", h);\n  cv_mo2ZJ90D6POD74Lso.setAttribute(\"width\", w);\n  cv_mo2ZJ90D6POD74Lso.write(\"cv_mo2ZJ90D6POD74Lflashcontent\");\n}\n\n-->\n\n\n\n\n\n\n\n\nvar cv_mo2ZJ90D6POD74LRollOverImg = new Image();\ncv_mo2ZJ90D6POD74LRollOverImg.src = \"http://ecx.images-amazon.com/images/I/81-KVVXoBzS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play-active,BottomLeft,130,-12_CR0,0,0,0_.png\";\n\nvar cv_mo2ZJ90D6POD74Lpreplay = document.getElementById('cv_mo2ZJ90D6POD74LpreplayImageId');\nif (cv_mo2ZJ90D6POD74Lpreplay) {\n  cv_mo2ZJ90D6POD74Lpreplay.onmouseover = function() {\n    cv_mo2ZJ90D6POD74Lpreplay.src = \"http://ecx.images-amazon.com/images/I/81-KVVXoBzS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play-active,BottomLeft,130,-12_CR0,0,0,0_.png\";\n  }\n  cv_mo2ZJ90D6POD74Lpreplay.onmouseout = function() {\n    cv_mo2ZJ90D6POD74Lpreplay.src = \"http://ecx.images-amazon.com/images/I/81-KVVXoBzS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play,BottomLeft,130,-12_CR0,0,0,0_.png\";\n  }\n  \n  \n  var node = cv_mo2ZJ90D6POD74Lpreplay.parentNode;\n\n  var cv_mo2ZJ90D6POD74LcurrentClick = node.onclick;\n  node.onclick = function () {\n    var head = document.getElementsByTagName(\"head\");\n    if (head[0]) { \n      var logTag = document.createElement('script');\n      logTag.type = \"text/javascript\";\n      logTag.src = \"/gp/customer-media/du/log.html?ie=UTF8&p=CustomerImage&s=CustomerVideoPlay\";\n      head[0].appendChild(logTag);\n    }\n\n    if (cv_mo2ZJ90D6POD74LcurrentClick) {\n      return cv_mo2ZJ90D6POD74LcurrentClick();\n    }\n  }\n}\n\n\n\n\n Length:: 1:31 Mins Sony DSC-TX30/B 18 MP Digital Camera with 5x Optical Image Stabilized Zoom and 3.3-Inch OLED (Black)I have used several brands of digital cameras. Samsung, Panasonic, Nikon, Kodak, GE, Fujifilm and now Sony, Some of these cameras were intimidating to learn how to use but the thrill of a new camera meeting my needs overrode that. The Sony DSC-TX30/B, however, was simple to learn and a lot of fun.I like certain features and how the camera works in certain situations, i.e., zoom, low light etc.The interface that this camera has is very easy to utilize and this also has a user guide to refer to as you are using the camera functions. It is extremely convenient. You don't have to carry a manual with you.The OLED screen is fantastic. Better than any camera I have used up to this point. A drawback of no view finder is that is it hard to see the screen in bright sunlight. I did have trouble seeing what I was shooting and recording but the screen is large enough that when you aim, it's hard to miss. I was pretty happy with the coverage I shot.With this Sony DSC-X30, this camera has features that I have never had before. This camera is waterproof up to 33 feet for 60 minutes (make sure to follow proper before and after care directions) which is quite exciting. I have always wanted to take pictures in the pool and in the ocean. This is also dust and sand proof allowing for even more flexibility. The best part and a feature I need is that this is shockproof from falls of up to 5 feet. I hope to not have to try out this feature but I am very happy that I have it with this camera.One other thing I found while using this camera is that I found my fingers in the way of the lens while capturing video, even when my kids used it they inadvertently did too, so be aware of the placement of your hands.A plus for me is that when I wanted to view my pictures on my TV or computer I could use the micro cable that came with my Kindle Fire HD. Check the length of your cable though to make sure it is long enough to reach your TV or computer from the power source.This camera uses a MS Micro, Memory Stick Micro (Mark 2) and is Micro SD/Micro SDHC Compatible. This camera does have some internal memory but not for a video. I think 28 pictures at the best quality is about all the internal memory can hold. So make sure to have an external card so you can shoot as many pictures and videos as you need.Some of the advanced features for this camera areAnti-Motion BlurSweep Panorama: Underwater Sweep Panorama / Intelligent Sweep Panorama (360)Face Detection: 8 facesSmile Shutter(tm) technologyImage Stabilization: Optical Steady Shot(tm) Image Stabilization with Active modeIn-Camera Editing: Beauty Effect / Trimming / Unsharp Masking / Date view / Picture Effect-Picture Effects: HDR Painting / Rich tone Monochrome / Miniature / Toy camera / Pop Color / Partial color / Soft High-key / Watercolor / IllustrationAfter you take a picture you can go into \"Menu\" and select \"paint\", then you can draw, add little stamps to picture's you've taken. Its loads of fun!Intelligent AutoBackground DefocusWaterproofDustproofFreeze proofShockproofSuperior AutoTracking Focus: Off / AutoAndBlink Detection This camera fits in the palm of my hand and is very light weight, easy to learn and the most important; fun to use!This camera also comes with access to Play Memories Home. \"Play Memories Home\" is a software suite that enables you to import videos and photos to a computer, and then browse and manage them.\"I included a short video (This will capture video in 29 minute segments) and if you have any questions about this camera, post a comment and I will respond as soon as possible. Also Sony support at support dot sony dot com has how to videos to help you. [...]", "Date": "May 27, 2013"}, {"Title": "Another Mixed Bag", "Author": "Bradford Schmidt", "ReviewID": "RU4JY14O7ZIRX", "Overall": "4.0", "Content": "I really wanted to like this camera. It's small, sexy, waterproof and shockproof, shoots hi-def movies, has a 5X optical zoom and has a great set of features. Sadly, this one misses on delivering where it's really important.From a feature standpoint, as I mentioned, it's great. The software and shooting modes are close to those on the Sony DSC-HX300, which I reviewed and loved. The Enhanced Super Auto mode is really, really good, handling almost any shooting situation with few problems. The program modes are also excellent, with some really fun features like partial color and panorama mode (which works GREAT).Macro is incredibly good for a point-and-shoot. You can turn off the flash and use two small LED illumination rings around the lens to avoid flash-nastiness, and I've shot photos from an inch away that are sharp and clear - really quite stunning on that level.Underwater shots are great as well - I've taken it in my pool as well as in the ocean, and the photos came out quite nice. I wouldn't try to shoot wearing diving gloves though - they're way too clunky and the controls on the camera are way too cramped.Photo quality is pretty good, but Sony has set the software up to over-sharpen a bit too much, resulting in high noise levels. The flash is good but not amazing, and again the extra noise is there making its presence known when you blow things up. However, if you're looking for snapshots that aren't going to be used in National Geographic, or you aren't planning on printing and framing 11x16-inch photos, you're in pretty good hands here. Of course, in order to see photos you need to be able to TAKE photos... and that's that's where things start to fall apart: ergonomics and functionality.First of all, the lens is placed SO close to the corner of the camera that it's quite tough to get a comfortable grip on the thing without either a) getting a finger in the shot or b) hitting one of the controls on the back panel. It's bizarre, really - I don't know how no one noticed how easy it is to put a finger in the shot just trying to hold the thing comfortably.And holding it is made even tougher because there's no room on the back for one's thumb, due to the large OLED touch-sensitive screen. By the way, I have pretty average-sized hands: they aren't Tyrannosaurus rex-small, but they aren't palm-a-basketball-large, either. Regardless, it's just too awkward to hold and control this thing without running into problems. Again, the features are dandy, but using them (or finding a comfortable way to hold the camera) can be a bear.Another problem with the OLED screen: it's particularly problematic in bright sunlight. At anything less than full, battery-draining brightness, the display is almost useless on a sunny day. Sure, the photo can be framed (basically) but adjusting menus is almost impossible due to low legibility.Even with all of those issues, I was still prepared to like this little guy for what it was: a tough, compact camera to be tossed in a bag or pocket and taken on adventures or to dinner or a club. Sadly, the LCD panel is plastic and scratches WAY too easily to take full advantage of its supposed shock and dust proofness (yeah, that's not even a word, I know). Mine's already marked up and I've never had it in a pocket or bag (without a case). I don't even have a clue how it happened. Not good.Then things go from \"bummer\" to \"oh, c'mon, no way\" when it's time to shoot movies. At first I was pleased with it. Movies are easily recorded using a dedicated movie button, and stills can be taken while you're shooting. After transferring to my computer, I was happy with how they looked, too.Until I turned up the volume. There's a disturbingly loud, high-pitched noise in the background constantly. It sounds like a cross between crickets chirping and bacon frying (so I get bummed out and hungry at the same time). You can still hear the sounds you've recorded, but that background sound is so distracting and loud in the quiet passages that I can't stand to watch anything I've shot. I've tested this in both AVCHD and MP4 mode and the issue is the same.To be fair, this could be an issue with my particular camera. I'll contact Sony and see what's what. But it's off-putting enough for me that had I purchased it (I received a review unit) I wouldn't bother with a replacement, I'd just flat return it.So, in the end, we're left with a camera that looks quite beautiful, works well underwater, can be dropped without breaking (untested, sorry!), has a fantastic macro mode and takes pretty good photos. Unfortunately the OLED screen isn't up to the toughness level of the rest of the thing and it's a pain to actually USE. Plus, in mine at least, it's got an unusable movie recording mode. I'm rating this 4 stars based on rounding up from 3.5 (which is where I'd place it were I able), thanks to its ability to shoot underwater. Were it not for that, I'd be rounding down to 3.Sorry, Sony but as sexy as this thing looks, it's not the one I'd marry.", "Date": "June 26, 2013"}, {"Title": "Great camera for clinical photos", "Author": "J Davis", "ReviewID": "RN4CMVARRZJ1H", "Overall": "5.0", "Content": "While the ruggedized features of this camera are very nice, they are simply icing on the cake to the real standout feature for me -- the magnifying glass plus mode. The bright LEDs surrounding the lens aperture and the short macro distance allows me to take amazingly detailed, close up images during clinic. The zoom even allows magnification up to 15x. The only other cameras I found with these features were much larger and did not fit in my white coat as easily. The ruggedness makes me feel a bit better about having it in close proximity to blood and other bodily fluids, but this is really just a bonus to the small size and macro mode. I've only used it for a few days but it starts up quickly, has taken sharp photos, and has satisfied my every need for this purpose. If you are looking for a compact camera to use for clinical photos, I highly recommend it.", "Date": "May 22, 2013"}, {"Title": "Sony DSC-TX30 A wonderful small camera to take everywhere", "Author": "Paul K", "ReviewID": "R3CLZR2DQZFG8X", "Overall": "4.0", "Content": "I purchased this camera to replace an earlier version that I lost on vacation in November, since I liked the one I lost so much. While there are some changes in the interface for choosing shooting options, it remains an easy to use camera that takes very good photos. I've also used it to record videos that have been helpful in reviewing music/dance for a cabaret I'm in. I particularly like its option for taking photos with a \"high speed shutter\". When a passenger in a car, it makes surprisingly good pictures taken while the car is moving--great when I'm on vacation overseas. It is advertised as shock-proof, which I inadvertently tested the 2nd day I had the camera by dropping it onto a wooden floor from a height of 3 feet--the camera still works fine. The macro feature also makes close-up photos easy to take. My one complaint is the parallax apparent in some photos, particularly if there are distinct vertical features in the scene being photographed. Many friends have been impressed by the camera and the photos I've taken with it.", "Date": "January 12, 2014"}, {"Title": "Low light picture quality is NOT satisfied.", "Author": "EUNGSUK YI", "ReviewID": "R2NM0GX2CV856W", "Overall": "2.0", "Content": "Low light picture quality is NOT satisfied.This may be good for out-door camera where bright light is required for better quality of picture.", "Date": "September 7, 2013"}, {"Title": "The most versatile TX ever!", "Author": "no_name", "ReviewID": "R2ZW2FI9EWXRJU", "Overall": "5.0", "Content": "In total I've bought 4 TX models: TX1, TX30, TX70, TX300, TX20 and TX30.From the first to the last I like the slim and elegant design and the improved GUI of every generation.What I like on my TX30:- large, bright and sharp touch display- fast switch on, response and trigger times (for a compact camera)- configurable menus- easy to operate graphical user interface (GUI)- robust design (water, dust and shock proof)- micro USB interface for charging and data exchange.- manual white balance functionWhat I don't like on my TX30:- Questionable BIONZ image improvements. For instance: I cannot make sharp images of the moon anymore as I could make with older generations without BIONZ.- Useless 18MPixel sensor: The effective image resolution is much lower!What I miss on my TX30:- live histogram function like the first generations have had.- more manual controls as professionals cameras have.- Better image quality for higher resolutions.What are the unique selling points for me?- real, slim (lady-like) pocket size format- magnifying function with with build-in LED light illumination! Because I am using the camera every day for quality control. Because it is so much better than my own eyes...I really hope that SONY is continuing the TX series in future ...", "Date": "June 6, 2014"}, {"Title": "Great camera for my purpose", "Author": "A. Maddox", "ReviewID": "R3DW5QAH994BJV", "Overall": "5.0", "Content": "I need a rugged camera that can slip into my pocket and open up with one hand. This does the job real well. Low level light is good as well. It sucks in as much light as it can. This does cause a slight delay when it's processing the pic, but the pics come out great. the video works equally as well in low light and can take stills at the same time. Awesome..", "Date": "June 6, 2014"}, {"Title": "Terrible Camera", "Author": "B. Leung", "ReviewID": "RWCUBASUSIYEQ", "Overall": "1.0", "Content": "Got the camera and returned immediately.  First immediate problem is the memory card error.  It seems like I am not the only getting this error.  Through Google search, a lot of people experienced the same type of error.  The error code is C13:01 for memory reading error. This uses the SD Micro card.  I know for sure there is nothing wrong with the card because it works on my other cameras.I will never buy another Sony camera ever again.  Sony makes terrible cameras.  I think Sony's reputation is going down the hill.  The built quality of the camera is not even that good, seems too delicate.  I would highly recommend Panasonic Lumix, Nikon Coolpix, Olympus Tough, and even Samsung.", "Date": "June 5, 2014"}, {"Title": "Great Slim Camera that i sshock and water proof.", "Author": "Hotel Bravo", "ReviewID": "RXP0Q7DAZM22", "Overall": "4.0", "Content": "Picture quality is great.It takes great pictures in and out of the pool as well as okay pictures under the water. Great video quality too, even though it seems that video will suck the battery down quickly. Camera is very quick, except when you are zoomed in on a subject, it takes a few seconds for the picture to process.Only complaints:Wow it's slick/slippery to hold. Sony could also have done a better job with an adjustable wristband that you could tighten around your wrist. The wristband doesn not tighten. Camea has no viewfinder, but aren't all these compact point-and-shoots going that way?  The shutter button is vey small, but again this is a very compact camera. People won't believe that it's water proof.", "Date": "June 3, 2014"}, {"Title": "Amazing camera", "Author": "Roxie", "ReviewID": "RXN45VZZYPK42", "Overall": "5.0", "Content": "Amazing camera, worked every where, even fell int he pool and worked with out any issues. Love this camera, would definitely recommend to anyone", "Date": "May 29, 2014"}, {"Title": "Error C 13:01", "Author": "Christian Ramírez", "ReviewID": "R1XANZ77R3YWH5", "Overall": "1.0", "Content": "Terrible purchase... First try to insert the memory I get an error c 13:01... Tried all troubleshooting steps and didn't do any good.", "Date": "May 29, 2014"}, {"Title": "is this real Sony product?", "Author": "Pen P.", "ReviewID": "R1HOR3AASNGNL5", "Overall": "1.0", "Content": "I bought this camera over a month ago.  Using it a few times on trips to take pictures and the pictures are looking OK.  However, when it ran out of battery today and I tried to charge it, charger came with the device would not fit into the camera.  This make me wonder if this is really a Sony product.  Charger would not fit a camera is just too obvious of a mistake to me for a company like Sony.  Other problem that I have every now and then is that the camera kept saying that there are no more memory and I know that there should still be a lot of memory left since I have 32 Gb in it.  I have to take the memory out and put it back in again to resolve that problem.", "Date": "May 28, 2014"}, {"Title": "Great camera", "Author": "Frank Phelan", "ReviewID": "R9HCSF6QBM6T6", "Overall": "5.0", "Content": "Awesome camera, had for a little over a month and the latch to the battery that holds it in place broke off. Even though this wasnt an Amazon return / issue Sony was very easy to work with getting it repaired.", "Date": "May 9, 2014"}, {"Title": "Camera OK - But don't count on Sony Service", "Author": "Patrick Barnett", "ReviewID": "R5C07U59XPH8A", "Overall": "1.0", "Content": "Bought this camera and took it on a vacation to Hawaii for some shallow underwater snorkeling pictures.  Never exceeded the limit and camera seeped water.  Tried to get Sony to honor their warranty and the people at the service center were so rude, I will never by another Sony product as long as I live.", "Date": "May 8, 2014"}, {"Title": "Great camera! Suitably rugged for a trip.", "Author": "Marquez Herrod", "ReviewID": "R54D47SSE45LK", "Overall": "5.0", "Content": "Before i bought this camera i was a little concerned about a lot of the reviews that said it had issues with leaking when used underwater, and that Sony's support was terrible. Well i took this camera on a trip to Puerto Rico for a week right after i received it. I didn't buy any special accessories, i just used it as-is. I can say that this guy functioned wonderfully both in and out of the water. I used it every single day on the beach, in the rainforest, and out at night.I would say on average i was taking somewhere in the neighborhood of about 100 or so pictures and 3 or 4 videos per day. At that rate i ran out of juice only one time and that was at about 11PM after being out all day since about 9AM. So I would have to say the battery life was pretty good. Also i used this in the water ALOT! I took both pics and videos and it was great to use some of the more artistic settings such as sketch mode underwater; it really allowed me to document my trip in a much more detailed way since i could take it literally everywhere i went without having to worry about ruining it.I never once had any water get into the case, after a couple of particularly long sessions in the water it did prompt me with a warning on startup about making sure the battery cover was closed properly, but that was the extent of it. The picture quality was also damn good for the size of the camera and definitely much better than my iPhone 5 i was carrying.Overall, an excellent camera for the price. And if you are looking for something you can literally throw in your pocket and take with you everywhere, this is it. Just don't expect DSLR quality pics.", "Date": "May 8, 2014"}, {"Title": "Died after submersion in water", "Author": "gentai", "ReviewID": "R19NDA7J9FND7T", "Overall": "2.0", "Content": "Takes great pics.  Generations better than the previous TX20.  BUT, it died after its first dip in the pool.  I checked the battery compartment and found no trace of any leak.  Water must have seeped in elsewhere.", "Date": "May 5, 2014"}, {"Title": "laura", "Author": "laura miller", "ReviewID": "R2ELG1OWEFUJ2X", "Overall": "5.0", "Content": "I won this camera in a Sweepstakes and loved it so I bought one for my son. Easy to use and excellent photo quality", "Date": "April 26, 2014"}, {"Title": "Perfect for the beach and any vacation!", "Author": "Jessica", "ReviewID": "RYLFCT2OKOZYK", "Overall": "5.0", "Content": "This camera was perfect for my trip to Costa Rica. I took it to the beach with me and used it in the water. The pictures turned out great! The outside has a few scratches on it from being rubbed up against rocks, but it still functions perfectly. I would DEFINITELY recommend this camera to friends, family, and strangers.", "Date": "April 21, 2014"}, {"Title": "Best Waterproof Cam", "Author": "Brienne", "ReviewID": "R2J050TDGNVKNC", "Overall": "5.0", "Content": "I absolutely love this cam! This is the best vacay camera that money can buy! I never have to miss a beach shoot again!", "Date": "April 9, 2014"}, {"Title": "Great Little Camera", "Author": "Ralph G. Bullis \"diverdude2\"", "ReviewID": "RNDNZIISPPWEY", "Overall": "5.0", "Content": "Bought the camera to take some under water Salmon Video.  Found out the camera is a great little point and shoot camera.  You have to set the touch screen to maximum brightness for outdoors in the sun.  The menu system is pretty easy.  I leave it set to Intelligent Auto and the camera does the rest..", "Date": "April 5, 2014"}, {"Title": "Love it", "Author": "Luisa M.", "ReviewID": "R2QW5HU94VLXG", "Overall": "5.0", "Content": "Amazing! I loved!The color I bought is really beatiful! I recommend for everybody... And the pictures under water are very very great", "Date": "April 5, 2014"}, {"Title": "Great Little Camera!!", "Author": "Richard Weibel", "ReviewID": "R1UIBX6H7IQ4HQ", "Overall": "5.0", "Content": "I've only owned this camera for a week, but it was use extensively for a trip to Vegas! I was very impressed with how it reacted in all lighting situations. It was very fast to turn on, the touchscreen has great sensivtivity and most importantly the pictures turned out great! I have yet to test the camera under water and it hasn't been dropped yet so i can't speak to its ruggedness but so far i'm loving the camera!!I'll update the review once it's been used in more situations.", "Date": "April 3, 2014"}, {"Title": "not really waterproof", "Author": "globalgamble \"KR\"", "ReviewID": "R1Y3B4AVKWR2ZW", "Overall": "2.0", "Content": "After using it for less than a year, it has died on me.  I took it under water a few times, and it was fine.  Just recently I forgot was in my pocket when I jumped in a pool, and now it is ruined.  It is not holding up to the test of time.", "Date": "April 2, 2014"}, {"Title": "Great little camera!", "Author": "Efrain", "ReviewID": "R23X7PJ529GFGE", "Overall": "5.0", "Content": "You won't need any other.  Still loving it.  Very intuitive to use, big screen, all you need to take great pictures.  But you'll have to tweak it a little bit.", "Date": "April 2, 2014"}, {"Title": "Nice camera!", "Author": "Amazon Customer", "ReviewID": "RCD8KPEWQYPWA", "Overall": "5.0", "Content": "Takes some stellar photos in low or high light. No complaints yet. Haven't had an opportunity to really test the waterproof feature. If it dies camping this summer I'll be sure to let you all know.", "Date": "March 27, 2014"}, {"Title": "Awesome camera, great for underwater, panoramics, low light", "Author": "David Woshinsky", "ReviewID": "R3NG6PK2ZTXT60", "Overall": "5.0", "Content": "I had a Sony before, and loved it, so had to go for another one!  It has great quality for an automatic camera, and photo quality is very good.  Plus the camera is very durable, shock proof, freeze proof, water proof, etc.  Good for the adventurous traveler like me!", "Date": "March 24, 2014"}, {"Title": "Maybe I am out of touch...", "Author": "Eric C. Sepci \"ecseps\"", "ReviewID": "R2WK1GHZUIUB22", "Overall": "5.0", "Content": "But I am not sure what some people are complaining about when you get a good point and shoot camera that also take great pics under water.  This is not a \"diving\" camera, but one that works (and quite well mind you) when snorkeling or something similar.Waiting to actually use it before reviewing and I think the picture qualities in water are very good and out of water, are simply amazing, again, for a point and shoot.  For the money paid (under $200), the camera is a steal.  Used it for a week in Orlando - salt water reef pool, fresh water, night time shots, family pics - all done very well.  If you use in salt water - like anything else, make sure you rinse it well when done.Again, if you are realistic about what this camera is intended for, it is hard to beat at this price.  I feel bad for my larger SLR...this one is simply too easy to carry around and use....", "Date": "March 24, 2014"}, {"Title": "great camera", "Author": "calob snow", "ReviewID": "R3JZ2C70Q72Q26", "Overall": "5.0", "Content": "it has a lot of great features, the batteries last dam near forever and it takes all sorts of great photos", "Date": "March 23, 2014"}, {"Title": "Best compact camera!", "Author": "Merlene Daguerre Rezk", "ReviewID": "R2K9G42LF4WG2I", "Overall": "5.0", "Content": "I 've had Sony T since i bought my first digital camera, and I can tell than the shots are fabulous!This new model is full, and you dont even need to carry a heavy machine just to take great photos.I love it!", "Date": "March 15, 2014"}, {"Title": "So far so good.", "Author": "Bellhead", "ReviewID": "R29BXIMB41UC8L", "Overall": "5.0", "Content": "I wanted a tiny camera, and this one works fine. I like the movie button a lot--no menu fussing to start recording.It focuses and takes the photo much faster than my 6-year-old Casio and is nicely more compact.The photos are fine for me, nicely natural. It's more than I expected for the price.No buyer's remorse at all for me on this one.", "Date": "March 14, 2014"}, {"Title": "Held up to skiing below zero and Mexico beaches", "Author": "skudbucket", "ReviewID": "R1PQCOOSMX015J", "Overall": "5.0", "Content": "I bought this camera to take to my wedding in Mexico.  It was PERFECT for the job.  Hauled it around everywhere that I went.  Get sand on it.... just rinse it off!  Held up well under below freezing temperatures as well.  Awesome response on the touch screen.  The only time I had an issue was on the mountain when my hands were so cold they were numb.  Pictures are perfectly clear and the MANY picture settings are great fun to experiment with!  I highly highly highly recommend for somebody looking for a less expensive camera to take on a vacation.", "Date": "March 12, 2014"}, {"Title": "Excellent product", "Author": "Emmanuel Taban", "ReviewID": "R1D860UPHPYGP7", "Overall": "5.0", "Content": "As described even and really an excellent camera. I have been an admirer of Sony cameras and this is my third Sony DSC I have bought and the second in the T series category. Very stylish!", "Date": "March 8, 2014"}, {"Title": "This Camera Rocks", "Author": "George MacCrone", "ReviewID": "RCBGQPB4L4Z9V", "Overall": "5.0", "Content": "Right out of the box this camera was easy to use and fun.The Menu is easy to use once you get acclimatized to it, many fun features.Blur free pictures even though I know my hands were not still while I was running to get a better angle on a few shots.I also like the fact that I can take pictures with it in a storm and not ruin it by getting it wet.This camera is always with me.Its fast, trouble free and with the 32 Gb Micro SD card it holds all the video  and pictures I can take on an outing.", "Date": "February 27, 2014"}, {"Title": "Best compact camera yet!", "Author": "Peter \"P&G;\"", "ReviewID": "R2G2NMZK79BYNT", "Overall": "5.0", "Content": "I purchased this for my wife, however, it's so good at taking video (and of course pictures) I ended up using it more than her!", "Date": "February 23, 2014"}, {"Title": "Handy pocket camera", "Author": "Michael Cahn", "ReviewID": "R3VD6IU4Q5AHTU", "Overall": "5.0", "Content": "I carried this camera earlier this month to Costa Rica and Panama.  I got it two days before my trip, and I read the instructions on the plane.  The camera worked flawlessly I took about 350 images from macro to scenery.  It was immerged several times and was hit once by a heavy rain.  I dropped it more than twice.  I am giving it to my grand daughter to use on a service trip to Gambia.  I couldn't find another one. How sad", "Date": "February 18, 2014"}, {"Title": "Excellent underwater pictures", "Author": "Greg C. \"Greg\"", "ReviewID": "R354M8V4QWWZPV", "Overall": "5.0", "Content": "Pros: Small size, waterproof, speedy start up, good quality under water pics, great video quality, both above and below the water.  Touch screen worked well, but above water only.Cons: in some outdoor sunny conditions it was difficult to see the display.  No touch screen functions underwater.Overall, this is an excellent camera.  We took it on a beach vacation and it is very durable and works well above and below the water.  Very compact, with a ton of features, including an awesome panorama function.  Video quality was very impressive.", "Date": "February 15, 2014"}, {"Title": "Love it", "Author": "solifatkid", "ReviewID": "R39OVGWNRTUOQX", "Overall": "5.0", "Content": "great pictures for such a small camera. options to clean up/clear up pictures are a nice plus. Motion detection and stills are easy to use. I especially love the fact that you can program to focus on children rather than adult and smile detection.", "Date": "February 1, 2014"}, {"Title": "Excellent Camera", "Author": "Raylee", "ReviewID": "R3OKURP8LFUPRR", "Overall": "5.0", "Content": "I bought this camera as a gift for someone who is going to Alaska for a cruise. It is waterproof, touch screen, and has a panoramic feature which clinched it for me. The software is intuitive and easy to use.", "Date": "January 28, 2014"}, {"Title": "Best point and shoot I've owned!", "Author": "Sean Davis", "ReviewID": "RS9A9K4RUKWC9", "Overall": "5.0", "Content": "I have owned a lot of different cameras and currently own 2 DSLR's and this point and shoot.  I love that it is waterproof and it takes great pictures even in low light.  Best pocket camera I know of and perfect for traveling.  I purchased 2 already...one as a gift and one for me!  Love it!!!", "Date": "January 15, 2014"}, {"Title": "Incredible this camera is definitely worth purchasing", "Author": "Gary M.", "ReviewID": "R1KPAF5S4223JJ", "Overall": "5.0", "Content": "I will recommend this camera to anyone who enjoy taking  different shots. Quality is fantastic. Must say in this small compact camera photos come out looking totally professional.", "Date": "January 15, 2014"}, {"Title": "Better than my expectations. It's very good for travel and you don't worry about shocks, snows or rain", "Author": "Julio César Martini", "ReviewID": "R28S9JQX0KLN14", "Overall": "5.0", "Content": "Great camera, nice photos , easy menu. Better than my expectations. It's very good for travel and you don't worry about shocks, snows or rain", "Date": "January 7, 2014"}, {"Title": "Wow!", "Author": "Asylums Dawn", "ReviewID": "R26K7AKL24ADGW", "Overall": "5.0", "Content": "It's even better then the last one i had. The macro is UNBELIEVABLE! It's has a lot of fancy options I'm not use to seeing in a Sony so that is a bonus. The touch screen has been flawless & the battery life is intense. I ordered this camera used and when I opened the box the battery had already been charged. I haven't had to charge it once since I got over a week ago. Even my old point and shoot would only last a day or two on stand by or a few hours when I was actively out taking pictures.I always test my waterproof cameras in the shower & this one had no leaks or fog up. :o)", "Date": "January 2, 2014"}, {"Title": "The perfect purchase for mom", "Author": "RogerM", "ReviewID": "RZAQQMLSVK3VB", "Overall": "5.0", "Content": "Her last camera \"drowned\" in her purse when a water bottle opened accidentally. This small form camera is perfect for her and likely to survive another trip on the Camino de Santiago.", "Date": "January 1, 2014"}, {"Title": "Love it.", "Author": "Cynthia P. Moore \"FitterKnitter\"", "ReviewID": "R26M6XJSGVYN27", "Overall": "5.0", "Content": "I think this is the best digital camera I have ever bought. Very small and good value for the money.", "Date": "December 29, 2013"}, {"Title": "Much improved from the TX-20", "Author": "Osanan L. Barros \"Sam Barros\"", "ReviewID": "R15Y84SMTQJIPK", "Overall": "5.0", "Content": "I owned a Sony DSC-TX10, which flooded during snorkeling 3 months later and was replaced for free, by Sony by a TX-20. The TX 20 lasted a year and then also flooded while snorkeling. Sony fixed that under warranty but it broke again close to a year later. By then the flimsy battery door had cracked in two different places. For the TX-30 Sony has done away with two doors and 3 gaskets separating the power connector, the A/V connector and the battery and put everything behind one single door, with one gasket underneath the camera. The door also appears to be much sturdier. The camera is overall smaller and \"feels\" higher quality than the previous models. The new screen is much sharper with brighter colors and it responds well to touch, even with a protective film. Quality remains what I would consider very good for a camera of this size. All in all, for $199 I don't think you can find a better waterproof point and shoot.", "Date": "December 19, 2013"}, {"Title": "Nice Upgrade", "Author": "ST", "ReviewID": "R1OA8ZYUEDKW3P", "Overall": "5.0", "Content": "Nice upgrade from the DSC-TX10 with more in camera features. I really like being able to make some editing changes to the pix directly from the camera. the touchscreen is more responsive and camera is overall easy to use.", "Date": "November 22, 2013"}, {"Title": "I like it!", "Author": "Jeanette Smith", "ReviewID": "R3JBW9O5VN745B", "Overall": "4.0", "Content": "I found this camera easy to use and it took really nice colorful underwater pictures, as well as pretty decent pictures on dry land. I like it!", "Date": "November 7, 2013"}, {"Title": "great camera", "Author": "Blane Fpx", "ReviewID": "R2A8W1TODW3VQG", "Overall": "4.0", "Content": "This is my 4th sony over the yrs. they get smaller and better each yr. I had a previous tx and dropped it. this one is small, better optics, but is very slow processing each photo after it is taken. good in low light as well", "Date": "October 15, 2013"}, {"Title": "Great camera, if you know how to use it!", "Author": "Elisa and Teddy", "ReviewID": "R3GCSK7JBNFAID", "Overall": "4.0", "Content": "Lots of great features, great display and image quality.  Battery lasts long, easy to transfer pics to PC and upload to fb.  This camera fits into every compartment wher eI normally keep my iPhone, almost same size.  Hubby bought it as a birthday gift for me and I am very happy!", "Date": "August 14, 2013"}, {"Title": "Compact and made to withstand extreme conditions", "Author": "Born to Shop!", "ReviewID": "RRH5X7IOBM0MA", "Overall": "4.0", "Content": "The Sony DSC-TX30 is a terrific little camera for the sports enthusiasts to just casual photographer. So far we have tried it from the extreme like taking jump shots of our son doing BMX tricks on his bike, to cute pictures of our dogs sleeping in unusual positions. This camera offers easy touch setting for you to pick the right setting to get the right exposure and focus for environment you are in. How about correcting close-up images - Sony has you covered that as well. There is an option to correct blemishes and imperfections. There are so many options and modes to pick from.The camera is extremely lightweight and tiny, so it is a good thing that it is made to take a beating. I do believe that the touch screen will get scratched easily. I ended up cutting up one of my iPhone 5's screen protectors and applying it on the touch screen to protect it from the outdoor elements. Since this camera is made to be in extreme weather conditions from rain to snow and even underwater, there are going to be times it will be near abrasive substances such as rocks and sand. With the screen protector applied, the touch screen was still very responsive to my touch just like before.The camera fits perfectly in my hands. With patience and practice, you will learn which settings to use once you get the hang of them. I am still learning. The camera loses a star because the instruction booklet is worthless, and it does not come with a manual DVD so I am learning hands on as I use the camera. Battery life is okay, so I would recommend having an extra battery on hand Sony NPBN1 Sony NP-BN1 Replacement Batteries.Videos are saved using the AVCHD format.  You can download a basic very user friendly program called PlayMemories Home (link in owners manual) that will convert videos to WMV format.  There are so menus for editing photos and videos.  You can also post videos to social websites directly from this program.", "Date": "May 23, 2013"}, {"Title": "Pocket Full of Fun", "Author": "Never pay retail", "ReviewID": "R26RJTTNU0X6EW", "Overall": "5.0", "Content": "If you're looking for a feature packed, pocket sized go anywhere camera, this might just be the one for you.  Especially if, like me, \"go anywhere\" often involves kayaking,  hiking to waterfalls or other activities that can involve sudden exposure to water---like everyday living in Seattle.At first I was dismayed by the lack of a user manual.  Turns out it is all built into the camera.  Great if you want to learn about the features on the fly-not so good if you'd like to sit down and study up on it in advance without having to burn battery time.  Also, there is no photo editing software included.  They have a download link to \"Play Memories\" but that is more of a photo sharing site than editing.The camera itself is quite small.  The lens cover slides up and down on the front and also turns the camera on and off.  The LCD screen is big & clear and all of the menu settings are accessed through the touch screen interface.  Once you learn your favorite options, it's pretty quick to switch settings as needed.  There are many \"artsy fartsy\" picture effects to choose from.  Illustration and HDR Painting are my two favorites so far.  Handheld twilight does a nice job of capturing low light scenes.  The coolest thing is the panorama sweep.  Similar to what I've seen on an I phone, you just hold down the shutter and pan from left to right and automatically stitches it into a single panoramic shot.  On my computer, the panorama just shows like one long picture, but the camera can also play it like a mini movie clip and pans across the shot.I took this camera to Niagara Falls and it withstood both the Cave of the Winds and the Maid of the Mist.  The camera was soaked but preformed great and was even smart enough to focus on my subject not the drops of water on the lens.I have to say the picture quality is not as good as my Panasonic Lumix, nor does the zoom come anywhere close.  On the Panasonic's touch screen, I can tap the screen, set a focus point and take a picture all with one touch but if there is a way to do that on this Sony, I haven't found it yet.  But considering the small size and the fact that it's waterproof, these are acceptable tradeoffs depending on your end use for the photo.  If you print your pictures and need super high resolution, you might not be happy.  If you want something so tough and small that you will be sure to have it with you to capture the moment for You Tube or e-mail, you can't go wrong with this little Sony.", "Date": "June 10, 2013"}, {"Title": "wow", "Author": "lejo206", "ReviewID": "RUNXUC0ITZF8H", "Overall": "5.0", "Content": "Wow, incredible. We loved it. We take si much pictures even underwater and the quality is excellent. Thankyou very much.", "Date": "February 7, 2014"}, {"Title": "Okay", "Author": "Lisa Sharenbrock", "ReviewID": "R3N0OYCGC07YH7", "Overall": "3.0", "Content": "I was hoping this camera would take better quality photos.  I am a professional photographer who was looking for a simple camera just to take everyday photos (ones that I will not publish/print on a large scale).  I was attracted to it because it was water proof.  It is an okay camera.  Way overpriced for what you get.  Focus is the good.", "Date": "December 6, 2013"}, {"Title": "My fave!", "Author": "Jennifer Claure", "ReviewID": "R1CBKNCRP7DQWX", "Overall": "5.0", "Content": "Me and the bf bought this before we went on a cruise! It works so well underwater! We took a bunch of pics of coral and fish at St. Thomas island. Just a tip- just make sure you are always rinsing it off with water esp if you use it at the beach so sand doesn't get wedged in.", "Date": "October 21, 2013"}, {"Title": "Much better than the previous camera (DSC-TX10)", "Author": "Dee", "ReviewID": "R3R84ZFZPIWIZ1", "Overall": "5.0", "Content": "It's the first time I make a review about a product that I purchased online. My first camera was the DSC-TX10 and to be honest, is excellent.  But definitely this Sony DSC-TX30 has surpassed all my expectations. Images are sharp, excellent quality and many features. Beautiful pictures, amazing features, colors are exceptional and every photo I take it justice that specific moment. The landscapes are wonderful, but underwater pictures are fantastic, with incredible precision and clarity. This camera is definitely an option you should take into consideration, espeacially for those who are looking for quality, price and comfort. Highly recommended, no regrets, I promise. I have uploaded pictures that prove all of the above", "Date": "October 21, 2013"}, {"Title": "Awesome waterproof camera.", "Author": "Amazon Customer", "ReviewID": "R4YKGRMLZ31CK", "Overall": "5.0", "Content": "Great small waterproof camera. Takes the work out of making pictures beautiful. 18MP is plenty for most all users. Works well in the water, even with the touch screen. All pros with only a couple cons: The on/off button is close to the shutter button and the slide down cover can be in the way at times....neither of these should keep you from buying this camera. We used it in the Caribbean and it took amazing pictures! The colors and clarity were some of the best I've seen. It works great in the water and has so many features you'll find everything you're looking for in this camera. Buy it!!!", "Date": "October 20, 2013"}, {"Title": "Very Robust Camera", "Author": "Anthony Montoya", "ReviewID": "R3BAJOL8AU518F", "Overall": "5.0", "Content": "My company uses these cameras for field work in the mining and metallurgical processing industry. These cameras hold up well in both wet and dusty environments all the while taking excellent quality photos and video. The new image stabilization feature works well, great for taking pictures of moving objects and pictures while the camera is moving.I would recommend this camera to anyone.", "Date": "October 14, 2013"}, {"Title": "Great little camera to take absolutely anywhere!", "Author": "Adara14", "ReviewID": "R3GBF9I57P4I8Q", "Overall": "5.0", "Content": "I just love this camera. I think it is the best little hardcore camera out.I bought this camera in June for a trip to Madagascar so that we could take snorkelling photos. Decided that my SLR was just too risky to lug around on a boat etc (and heavy for backpacking!). I did a LOT of research trying to find a camera that was definitely going to stay waterproof and not fail after one dunking leaving me with no pictures. Decided on this one (which had then just been released) as the few reviews indicated no function problems underwater. Took just this little camera on holiday and got some incredible shots, especially underwater! The features are really great (watercolour options, pop colour, panoramas, movies etc) and all worked really well for me. It is really really easy to use (I have never used an easier camera), as there are almost no buttons everything is touch screen and very user friendly. The screen can be a bit tricky to see in high light, but I have managed fine despite this.I'm no pro photographer, I just enjoy taking pics, so not sure how other people would find this, but I got some really great photos (in my opinion). You do have to watch the back screen for scratching and keep your fingers out the way of the lens, but it's beautifully made otherwise and a perfect size to take everywhere (fits in pockets easily). Battery life is fairly good, takes about 250 photos with special options used on some of them, haven't had problems with that though as I charged it each day. Obviously all reviews are subject to personal opinion, but I really love this little thing, I take it everywhere. Just took it to Greece as well and again used the underwater photos etc and again, photos look good. Maybe not always slr quality, but pretty good all the same, and often takes high colour really well (ie sunsets, water colours, etc). So a great practical all round camera if you just want some nice pics with no fuss.Also a note, in Madagascar somebody had a brand new Nikon AW110, and it didn't make it past 1 underwater photo!!! And never charged again either...so glad I listened to other reviews with same problems and didnot go for the Nikon. Seem highly unreliable underwater. I can with full confidence say the Sony has been underwater with me at least 30 times now with never a single issue! I do rinse it off and dry it after every use though just to be safe.", "Date": "October 4, 2013"}, {"Title": "Awesome little camera!!!", "Author": "N. Scherenberg \"xajide\"", "ReviewID": "R2LP5RSGW8LQ7L", "Overall": "4.0", "Content": "I purchased this camera for a camping trip and it's performed beautifully.The area I stayed in had only freshwater so I cannot comment on the performance in salwater or sand but for my purposes, it did exactly what I needed it to do.I was taking pictures in the water, under water, would point the camera to shore, take pictures there... and they all came out great.The touch-screen functions started working right away once I picked the camera out of the water and it dried off pretty quickly after being submerged.Film quality was good and the different settings worked well. I've owned many small Sony cameras and also own a Sony Alpha.Their cameras usually perform extremely well and this one's no exception.Of course the picture quality cannot hold up to the same standards of an SLR camera but I definitely think this is one of the best quality images you can find in a point and shoot.My only gripe: The touch screen already has a big fat scratch on it. It seems extremely sensitive and I definitely think they could use some sort of tempered glass for an application that will see this much action.However, the touch function doesn't seem to suffer from the scrape so I'm not too bummed about it.The good news is: It's so tiny that even if I buy a cover for it, it'll still easily slide into my purse.Would definitely recommend this camera to any of my friends.", "Date": "September 4, 2013"}, {"Title": "Movie downloading issues", "Author": "Katiebird", "ReviewID": "RV9TAD751OY19", "Overall": "3.0", "Content": "Be sure your computer is compatible with the camera to download the videos. It is a challenge to say the least to get it onto my PC, and I am told next to impossible to get them downloaded to my Mac.", "Date": "August 6, 2013"}, {"Title": "3.5 Stars- Very Portable But Picture Quality is Subpar For the Price", "Author": "FirePepper Red \"firepepper red\"", "ReviewID": "R2320KY51L3RJA", "Overall": "3.0", "Content": "The Sony TX30 is a very portable and rugged camera that is plagued with compromises.  The first thing you notice is the very small size.  While this is great for portability it makes it difficult to hold the camera in a way that feels natural. To make matters worse, the lens is on the upper left side right where your finger wants to be.  There is no grip on the camera which makes it easy to drop (thank goodness for the included wrist strap).  The few buttons that are on the camera are tiny and hard to differentiate from each other.  Most of the controls for the camera are buried in menus on the touchscreen.  While this is not always bad, in the case of the TX 30 it is frustrating since you cannot read the screen in bright sunlight.  To make matters worse the picture quality is not up to par with the price of the camera.  The photos tend to have noise even in bright light and low ISO.  What this means is that your photos will have a graininess to them which is very noticeable if you magnify the images on your computer.  Most people who print 4x6 photos will probably not notice but if you ever need to enlarge a photo it will become apparent.*** Positive Points: ***- Very Portable and easy to carry- Slide down lens is easy to operate and hides the lens when not in use- Touchscreen is easy to use and has good resolution- Can be charged by included wall adapter or the USB cable- Uses a micro usb charging tip which makes it easy to find a replacement charging adapter in case you lose the original charger- 5x zoom is really incredible considering the size of the camera- Can use Sony Memory Stick Micro or Micro SD*** Negative Points: ***- Photos have a lot of noise (graininess) even in bright light- The buttons/menus are hidden and hard to decipher if you have never used the camera- Zoom lever is tiny and frustrating to use (especially for accurate zooming)- Touchscreen is very hard to read in bright sunlight and you can forget about adjusting the options when it is bright outside- The waterproof seal is around the bottom of the case which holds the battery, memory card, and  all the ports.  You must open the bottom case every time you want to charge the battery which can eventually wear down the seal.- Menus are not easy to decipher and simple functions such as forced on for flash are not available in all modes*** Overall:*** The Sony is a very portable camera that has made many compromises for its small size and ruggedness. If you can live with the ergonomic compromises and sub-par picture quality then this may be the right fit for you, for most people there are better cameras available for a lot less.", "Date": "June 16, 2013"}, {"Title": "Nice camera for the amateur!", "Author": "Denise Crawford \"DC\"", "ReviewID": "RRMKXONY1LFGB", "Overall": "4.0", "Content": "When I got this camera, I was excited about its potential -- especially because of its advertised resistance to water. My initial disappointment was that the camera had NO internal memory and I had no micro SD memory card. I was able to take only 7 pictures before the display told me I had to delete shots as memory was full. I honestly wish that the SD card had been included with the camera and that it just cost a little more than to have to go and buy one to be able to use the camera. After I got the required memory, I played with it a little to make sure I could use some of the main features I loved the panoramic capability and the point and shoot was intuitive and easy to figure out. The touchscreen is easy to see except in bright sunlight, and responsive to touch. The picture quality was fairly good but definitely need a flash on for the lower light situations. The zoom works great and its simple to get the shot you want. I did find that taking photos of more distant lighted objects at night (a giant scoreboard for example) was not possible. The camera does well with close up still shots in good light but not so well with motion. The photos I took of family on amusement rides were blurry. I figure some of this is due to operator error and I really need more time and more conditions to play around with the settings. I'm also eager to print out some of the better photos and see how well they adapt to enlargement.Overall, I really like the camera. I've been using it in and around a swimming pool with no ill effects but have not tried any underwater shots yet. I did get a case for the camera to protect the glass touchscreen. My previous camera was also a Sony and I think the company makes a solid product. I do like how small it is. I have not yet tested battery life or transferred pictures to my computer. I think I'll get a great deal of use out of it when traveling and at special occasions.", "Date": "June 19, 2013"}, {"Title": "Very portable with good picture quality", "Author": "Randal E. Bryant", "ReviewID": "REPZVH54OH0LW", "Overall": "5.0", "Content": "I bought this camera as an alternative to lugging along a DSLR.  I wanted good picture quality (both high resolution and good low-light performance), a reasonable zoom, and portability (both small size and rugged.)  Overall, it's met all of these objectives.  Haven't tried submerging it in water yet, but I like the idea that it won't get damaged if it falls in the water.I like the way the cover slides back to expose the lens.  I have had other point-and-shoot cameras with exposed lenses, and they tended to get dirty--pocket fuzz & fingerprints.There are many options and controls. It's mostly based on the touch screen, which means lots of fishing through menus.  Giving up an optical viewfinder makes it pretty much impossible to see what you're shooting when in the bright sun.  These limitations are the price you pay for the small size, and so I really can't complain.", "Date": "June 14, 2013"}, {"Title": "Delivered as promised", "Author": "Jim", "ReviewID": "R2BWDWJRP7V0OE", "Overall": "3.0", "Content": "I won't know how it performs until I've used it for a while, but it was delivered as promised. I can say that the zoom button was placed too closely to the corner of the camera -- as a camera for active use, that makes the camera harder to hold on to.", "Date": "May 13, 2014"}, {"Title": "just convinient for take photo", "Author": "QJ \"Una\"", "ReviewID": "R3T5LXX05SQ07P", "Overall": "3.0", "Content": "it is ok for people that needs convinient............ it is cheap when i buy it. i bought it for 190 dollars", "Date": "January 27, 2014"}, {"Title": "keep coming back to this camera", "Author": "A. Kim", "ReviewID": "R29ZENKYJ9D1Y9", "Overall": "5.0", "Content": "i had the original DSC tx10, and really liked it.  afterwards had a waterproof oly, nikon, and pany.  i ended up returning the oly and pany due to faults.  the oly did take wonderful photos.  but i think this sony does almost the same, and the video is much superior.  i also like that its in mp4 format vs avchd (lite).in the end, its a point and shoot.  i havent had issues with it in the water at the beach, waves, or at swimming lessons with the little one (though with the tx10 it get water in when i dove too deep, and ended up with a slow death).it can be fiddly with the all touchscreen sometimes, and the microphone placement is not ideal.  but i will use it for the next years, and then prob buy the next model in the line.  stick with what works.", "Date": "December 20, 2013"}, {"Title": "great performance", "Author": "Ben Nizar", "ReviewID": "RM6UDU2WBAJVV", "Overall": "5.0", "Content": "Simply the best camera that is waterproof, i tested it and it takes excellent photos, i bought it to sell it but i ended up keeping it for myself", "Date": "October 7, 2013"}, {"Title": "Great camera!", "Author": "Maria Martinez", "ReviewID": "R2ILOZ34JVMNN4", "Overall": "5.0", "Content": "I love this camera. It's compact, it takes beautiful crisp pictures and has wonderful features! Totally recommend it to all my family and friends!", "Date": "October 2, 2013"}, {"Title": "Waterproof", "Author": "loc tran", "ReviewID": "R1U9055PGODBST", "Overall": "5.0", "Content": "Nice slim camera that we used for the ocean in Hawaii.  It was very sharp and clear and I would recommend it to anybody who wants to use it for underwater.", "Date": "September 25, 2013"}, {"Title": "Clear, crisp pictures", "Author": "BeckiTravels", "ReviewID": "R2K93QJ75OA64X", "Overall": "5.0", "Content": "This camera was replacing an OLD Olympus underwater camera.  This takes great pictures under water, though I miss the 20x zoom capability of ly \"land\" Sony.", "Date": "September 16, 2013"}, {"Title": "Amazing pocket camera!", "Author": "Rich H. \"Old Pro\"", "ReviewID": "R392WZ7TKFGLDK", "Overall": "5.0", "Content": "I am an expert photographer, with Leica Digital M cameras and lenses for my \"fine\" work.  But when I dropped my G9 into a tiny creek and ruined it I needed to replace it with a waterproof camera; also better for my fly fishing vest.  I am absolutely stunned by the picture quality of this tiny device. I don't prefer the lack of a viewfinder, or dial controls, but leaving the settings on auto/auto, and the format on 4X3, it becomes simple to use.  The zoom range is perfect, and Zeiss is commended for creating such quality and precision in a lense that would easily fit in a smart phone!  That it lacks a 24X36 format option is my only serious complaint...however, the resolution is so good that I can crop in I Photo with no noticeable loss of image quality.  It is a bargain at Amazon's price, and a better camera than my G9 ever was. APPLE needs to take note of the pure technology in this device.  Mine has the prestige of resting in my Leica's Billingham accessory pouch.", "Date": "September 12, 2013"}, {"Title": "Good waterproof camera for outdoors", "Author": "Big D", "ReviewID": "R1B7LVC9TKXHHW", "Overall": "5.0", "Content": "We got this camera for outdoor hiking trips.  It is nice and compact.  Always spring for the Carl Zeiss lens on a Sony camera as it is a great improvement over the standard lens.  It has a small internal memory space so get a micro SDHC memory card to go with it.", "Date": "August 11, 2013"}, {"Title": "This is a great service camera for someone in my profession..", "Author": "AZ Ahmed", "ReviewID": "R1JJS2H28QYAJM", "Overall": "4.0", "Content": "Seafood Sales.It works great for those close up product shots, which can be used with a sales pitch. If the camera get soiled, smells fishy, just wash it.", "Date": "July 6, 2013"}, {"Title": "Great camera - Tiny - Solid - Great VIDEO", "Author": "GenericName", "ReviewID": "R34KCELWX6TS97", "Overall": "5.0", "Content": "I love this camera. I can't say enough good things about it. It's size and durability are incredible and I'm so happy it charges off of a standard mirco USB charger. I wish all mobile devices used this standard charging.The sliding cover is an intuitive way to wake up the camera. I wish more cameras utilized this system.It's hard to believe how good the video is considering the size.I would get an extra battery or two, but other than that, enjoy!I also own the tx20. This one is better but if price is an issue then the tx20 is also good.", "Date": "June 24, 2013"}, {"Title": "The TX30 beats the WX10.", "Author": "MLouise", "ReviewID": "R3Q49LZW9FHBU", "Overall": "5.0", "Content": "About two years ago I purchased the Sony Cybershot DSC-WX10. I loved it (still do) and gave it glowing reviews. So when I had the opportunity to try the DSC-TX30 I jumped on it.I only found one negative, but I'll discuss the positives first. Basically, I look for three things in a camera; photo quality, ease of use, and battery life. This camera excels in all three areas. As far as quality goes, it is very similar to my old Cybershot with one difference. The depth of field is much better with this WX10. I took identical close up photos of flowers in my yard with both cameras for comparisons. The close up sharpness was similar in both photos, but the background with this camera was substantially sharper. The background with the old camera was quite blurry and I may not have realized it if I didn't have the new one for comparison. I used a variety of settings on each camera for comparison, and no matter what setting I used, the background was always more clear in the new camera. (I did not try the setting for background 'defocus' because it just wasn't that kind of photo.)As far as ease of use goes, I was surprised at how user friendly this camera is. I am used to dials and knobs, but the touch screen is so intuitive that I did not have to look at the manual at all. I was able to scroll through a ton of features even more easily than with my old camera. The simplicity of use will encourage me to actually USE many more features than I've ever used before with photos. I especially like the one called 'pop color'. It makes it so you don't have to adjust saturation in photoshop. I have had every picture turn out perfect so far when using that feature.I also love indoor photos with this camera. The lighting is somehow automatically fixed, even with sun coming in windows. And of course, the panoramic feature is wonderful. As a Montana gal, I have lots of sweeping views that I like to capture!I don't know how long the battery will last, but it has not run out yet. I can't say how many photos I have taken because I deleted all the 'just for practice & comparison' pics. But it has been a lot and I still have over 1/2 my battery left.Ok, now for my negative...I really, really dislike the way the battery/card compartment door closes. Like most cameras, there is a spring type button you push back to open it. When you close it, you need to hold the spring loaded button back while you push the door closed and then release the button. There are two issues with this. First, when you push the door closed, you need to push down right on the very end of the door or it won't close. If you push down in the same area as the button, it won't close. (The button and the end of the door are about 1/4\" apart.) Second, you need to make sure the button is slid back all the way, and hold it there while you push on the end of the door to close it. If you don't have the button slid back all the way, then the little catch-tab that sticks out will be revealed and it is SOOoooo thin and delicate looking that it looks like it could break if you're not really careful. I personally, am very careful.Although this is a negative for me, I love the other features so much that it didn't warrant taking away a whole star.So there you have it. I will continue to explore this great little camera and will add more info if I find reason to.", "Date": "June 8, 2013"}, {"Title": "Long time Sony fan is disappointed with this one", "Author": "Gina B. \"It's a dry heat!\"", "ReviewID": "R1AHAK6X37DE8G", "Overall": "3.0", "Content": "I'm a long time Sony fan and almost all my many cameras are Sony brand - including my Sony NEX-6L/B 16.1 MP Compact Interchangeable Lens Digital Camera with 16-50mm Power Zoom Lens and 3-Inch LED (Black), which I adore.I had high hopes for this little camera - but there are some serious flaws as to why I can't continue using it.CONS:First, the touch screen is so soft that it became majorly scratched the first week I used it.  This is not Gorilla Glass like on your cell phone!  You need to get a screen protector on it before you even start using it if you want the screen to stay nice.  I was really surprised how easily the screen scratched.I was disappointed to find that they have only built in a micro SD slot instead of a full size slot (that will also fit micros) - and that is disappointing since the camera does not have wifi.  I'm a fan of Eye-Fi Connect X2 4 GB Class 6 SDHC Wireless Flash Memory Card EYE-FI-4CN and use them in all my cameras and devices at home, but alas, they are only full sized SDs.Lastly, the slide up and down front lens cover is very flimsy and really not needed.  They should have just designed a small sliding cover for the lens, not had the entire front half of the camera open and close.PROS:The waterproof features work well and the pictures from the camera are as sharp as you'd expect from a folded optic device, but that in itself isn't enough to sell me on the camera.  As with most Sony's, the camera loves the color green and seems to weight this more heavily in shots with lots of grass, trees, etc - but this adds a vibrancy that I actually kind of like.  The camera also has several fun in-camera photo editing features (like whitening teeth, giving yourself a tan, making your eyes larger, and airbrushing).  It's also compact enough to bring along in your cargo shorts pocket or in a purse - it's lightweight with ample battery life for a day out.In my opinion this is a great secondary camera if you travel frequently - taking it on typical vacations where you'd leave your DSLR at home is fantastic.  However, if you're looking for an all-around compact that you can take everywhere ... look elsewhere.", "Date": "June 19, 2013"}, {"Title": "FANTASTIC", "Author": "A. Reader", "ReviewID": "R7WZWTSOQ5IQZ", "Overall": "5.0", "Content": "To be clear this camera is waterproof to 30 ft and shockproof. It takes all the best features of last years waterproof Sony Camera and there non waterproof one and combines them into a smaller more robust bigger sensor-ed package.Some things to note: there are tougher waterproof cameras out there. I'm partial to the Panasonic TS' for all around toughness, but you will be hard pressed to find a smaller or sleeker one. As part of that sleekness though, you have to rely on a touch screen for all settings. Lastly there are a ton of artsy settings for your photos. I never use any of them. I think all changes are better made on a computer where you can really manipulate images.Pros: Great pictures for a point and shoot, tough, bright screen, fits in just about any pocket. I love the slide to turn on and off and that it protects the lens. Also it charges via a usb cord so you dont have to bring a battery charger with you.Cons: No GPS (not a feature I love but standard on most rugged cameras), screen cant be used with gloves making setting changes tough in the cold, uses expensive micro SD cards. Zoom and shutter can be tough to manipulate with ski type gloves (doable, but hard.)All in all I love this camera and it is my go to P&S; camera. Butttt people see the 18.1mega pixels and assume that gives it DSLR like abilities. IT DOES NOT SHOOT LIKE A DSLR OR 4/3. The sensor is considerably smaller meaning your dark shots will never be fantastic. You can never manually focus (though it does have a feature that blurs the background.) The ISO gets noisier much faster. The pictures take longer to shoot. However if the best camera is the one you have with you, than this might very well be the best camera there is. You can use it in most any environment you find yourself in, and it fits easily into any pocket or purse to the point you'll forget its there. And its still taking much better pictures than my iphone 5 and in environs that I might not want to take out my non waterproofed phone.", "Date": "June 6, 2013"}, {"Title": "Amazing little camera", "Author": "Curtis Warnasch", "ReviewID": "R3EC7E89BCPQSO", "Overall": "5.0", "Content": "Image quality equal to my SONY DCS HX30v. Improved zoom for a compact camera. Fits well in pockets. Quick video record and save compared to TX10", "Date": "May 31, 2013"}, {"Title": "Wonderful purchase", "Author": "Tam_I_am", "ReviewID": "R1QD52YDJ7OPPE", "Overall": "5.0", "Content": "Bought this for my daughter who is going on a cruise over Christmas.  I got it for her birthday.  It was exactly what she wanted and she is really looking forward to using it on the cruise.", "Date": "September 5, 2013"}, {"Title": "Great worry free camera", "Author": "T. Randall", "ReviewID": "R1P5QE71BWEAGX", "Overall": "5.0", "Content": "Pictures taken with this camera are clear and full of depth. Add to that the ability to shoot underwater and you have the ideal camera.", "Date": "August 23, 2013"}, {"Title": "Great camera", "Author": "Susant", "ReviewID": "R2PLOKOG7JN13T", "Overall": "5.0", "Content": "I bought this camera for a vacation trip to the Bahamas.  We took stills, video, underwater, and panoramas.  Picture quality is fantastic, even from a moving boat.  The LED display is a little challenging to read in the sun and scratches easily, and I couldn't ever find an underwater mode choice in the menu (instructions don't match available screens), but all-in-all it is a great little camera.", "Date": "June 19, 2013"}, {"Title": "Super compact - waterproof beautiful photos", "Author": "Zeb \"zebra01\"", "ReviewID": "R2SBMR306ZSHXU", "Overall": "5.0", "Content": "The camera does a fantastic job in regular lighting as well as low light conditions and has a very nice color balance at its default settings. Its basic shooting mode covers most general needs and the ability to just touch the object on screen you want it to focus on and have it hold onto that object as you zoom and pan works very nicely.The build quality is very nice and the slide open shutter works easily and automatically turns the camera on allowing you to work the camera one handed with ease. The movie mode with image stabilization smoothes out slight movements very nicely, and the dedicated movie button allows easy access to the movie mode without needing to use the menu which is helpful.I only tested briefly underwater but it seemed to work fine. I did unintentionally test the shockproof feature when I dropped it onto concrete from about 5 feet high and it suffered no ill effects, you can't even see a scrape on it.There is more of a delay than I was expecting between pictures, there is around a second lag between shots, and a little more so if its a low light exposure. In practice I very rarely found this to be noticeable, but compared to other non-waterproof cameras I have used it was noticeably longer.Overall its a very nice camera, has a beautiful screen for viewing pictures, and takes a very nice picture, the menus take a little getting used to and the shutter lag is something to be aware of, but its a great camera for taking high quality pictures without having to lug around a DLSR when you still want a high quality photo.", "Date": "June 19, 2013"}, {"Title": "Just a thought about Sony cameras.", "Author": "J. Tsai", "ReviewID": "R2IJUGCCU92JKQ", "Overall": "1.0", "Content": "I want to clarify before I post this review. This is based off of my experiences with the DSC-TX20, not the DSC-TX30, but may reflect upon Sony's customer service and product design. Hopefully it is something to consider when purchasing this camera.I bought the Sony DSC-TX20 in December of 2012. Used it in Hawaii in January and used it again in the pool in June of 2013. I only used it twice, and always made sure the camera seals were completely clean before immersion. I've used Canon products underwater before and am familiar with proper care and use of underwater cameras.When I used it in the pool, the seal somehow failed and allowed a little water into the camera. Even though I was not near the maximum depth for the camera, some water got into the camera and it stopped working. Again, prior to immersion, I had checked the seals and ensured that the openings had positively latched.After I sent it into Sony, their customer service center informed that it was not covered by warranty due to corrosion in the camera. Their explanation was that it was \"uneconomical to fix the camera, so the warranty was void.\" To me, this is completely illogical and unfair. Not only could they not tell me how the cameras were tested to see if there was a seal or product failure, two of the four people I was transferred to were somewhat rude. The third, who supposedly worked for the national customer service center, ended up telling me that she was going to transfer me to the tech center that had the unit in hand and were the ones that tested it. She ended up transferring me to the first unit. The final individual was rude and told me he couldn't transfer me to anyone, or back to the original unit. I was told, again, that because there was corrosion in the camera, they would not honor the warranty. They could not seem to understand that the water and corrosion in the camera was because of a product defect.So, I'm out the price of the camera after two uses, including warranty shipping back to the Sony customer service center. I've been a long fan and customer of Sony products, but this has definitely turned me off. I would highly recommend against this camera, and, after the customer service experience, against Sony cameras at the very least.", "Date": "July 9, 2013"}, {"Title": "Flimsy - inner screen cracked within a week", "Author": "Phillip North \"Phil\"", "ReviewID": "R19MRV9WS08S6J", "Overall": "1.0", "Content": "This camera has a multi-layered display screen and the inner screen cracked. It had not been dropped, just got a big crack along the bottom corner which can be seen clearly under the outer layer of glass.It doesn't seem to impact waterproofing but doesn't look great.  Other features seem fine but for a camera that is meant to be ruggedised this is a fail.I have previously had Panasonic rugged cameras which have been used mountain biking, run over by vehicles and dropped onto rocks without problem.  This camera was for a tourist trip to NYC and Hawaii. Didn't stand up to the rough and tumble of a padded case in a padded backpack.Get an Olympus or Panasonic if you are doing anything outdoors.", "Date": "July 9, 2013"}, {"Title": "Solid camera for the beach, rain, and storms", "Author": "Sukru Tikves", "ReviewID": "R11R4OA4HXL9QM", "Overall": "5.0", "Content": "This camera is an incremental update of Sony's TX20, with higher resolution, deeper zoom, and larger screen. It's a solid device that handles near (or in) water situations very well.Although Sony has manged to place a 5x zoom optical assembly in a small space, of course it's no match regular point and shoots (never mind the DSLRs). It's a tradeoff of the waterproof design, and the camera tries to compensate for it by extra image processing. I could say it works, at least for me. It shoots triple images in succession to make up for the optics, and generally it produced very good results, even in really low light conditions.The touchscreen UI takes some time to get used to, however it feels at home after a day or so. The overall feature set is similar to recent Sony cameras including face and child face detection, 3D shots, panoramas, photo effects, and burst shots.As people have pointed out THERE IS NO 8GB INTERNAL MEMORY. Unfortunately the Amazon description is incorrect (Sony's website does not have this error).My actual complaint is the lack of a GPS receiver. Since the camera cannot take full size SD cards, even a third party solution like Eye-Fi would not work. Many other competitors - and even some of Sony's own products have this feature, and it's very helpful in organizing trip photos.If you're looking for a solid camera to shoot at the beach, during the rain, or stormy conditions, this is a very good choice. If you're looking for a general purpose one, of course there are more cost effective options.", "Date": "May 20, 2013"}, {"Title": "camara case  sony dsc tx30/b ?", "Author": "Ernesto", "ReviewID": "R35GPHN36D38BB", "Overall": "5.0", "Content": "Dear amazon ; On August first 2013 I purchased the camara  Sony DSC-TX30/B 18 MP Digital Camera with 5x Optical Image Stabilized  I received all the products I ordered (thanks) but the camara case that its been promised. Per add says; Buy a Select Point-and-Shoot Camera, Get a Free AmazonBasics Case Receive a free Amazon  Basics compact camera case with the purchase of this camera. Offer valid through August 31st, 2013, or while supplies last. Applies only to purchases of products sold by Amazon.com. so when will I receive my camera case ? thanks ... E.S.", "Date": "August 14, 2013"}, {"Title": "Excellent pictures taken with this camera.", "Author": "Luis Omar", "ReviewID": "R3NRGL217V2DVC", "Overall": "5.0", "Content": "Ideal for traveling and everyday use. Highly recommended to everyone looking to take perfect pictures without the need to carry heavy DSLR cameras.", "Date": "June 19, 2013"}, {"Title": "Sleek form factor that's waterproof and shoots 1080p video!", "Author": "R. Hammer \"rhammer\"", "ReviewID": "RW5D5L1AGTA4P", "Overall": "5.0", "Content": "<!--\n\nfunction fp_resizePlayerSpace(nsPrefix,w,h)\n{\t\n  try {\t\n    var ifrm = parent.document.getElementById(nsPrefix + \"movieFrameID\");\n    if (ifrm) {\t\n        var h2 = h + 35;\n        ifrm.style.height = h2;\n      }\n    } catch(err) {\n \n    } \n\n\n  if (h > 0) {\n      document.getElementById(nsPrefix + \"clipDiv\").style.height=h+\"px\";\n      document.getElementById(nsPrefix + \"videoPlaceholder\").style.height=h+\"px\";\n  }\n  else {\n      document.getElementById(nsPrefix + \"clipDiv\").style.height=\"\";\n      document.getElementById(nsPrefix + \"videoPlaceholder\").style.height=\"\";\n  }\n  document.getElementById(nsPrefix + \"flashcontent\").style.height=\"100%\";\n}\n\nfunction fp_rewriteDiv(nsPrefix,divName,html)\n{\t\n    document.getElementById(nsPrefix + divName).innerHTML=html;\n}\n\nfunction embeddingPopup(nsPrefix)\n{\n  alert(\"placeholder function for embedding code\");\n}\n-->\n\n\n<!--\n\nfunction cv_mo28ML0EV10QOPMembeddingPopup(){\t\nalert(\"Embedding code will be displayed here.\");\n}\n\n-->\n\n\n\n\n\n\n\n\n\n<!--\nfunction cv_mo28ML0EV10QOPMrefresh_preplay() {\n\ndocument.getElementById(\"cv_mo28ML0EV10QOPMchiDiv\").innerHTML = document.getElementById(\"cv_mo28ML0EV10QOPMhiddenPre\").innerHTML;\n};\ncv_mo28ML0EV10QOPMrefresh_preplay();\n\n-->\n\n\n\n\n\n\n        // <![CDATA[\n\nvar cv_mo28ML0EV10QOPMso;\t   \n\n\nfunction cv_mo28ML0EV10QOPMloadSwf_Core(swfLocation, swfWidth, swfHeight, flashVersion, bgColor, swfParams, flashParams, embedAttributes) {\n\n  try {\n      cv_mo28ML0EV10QOPMso = new SWFObject(swfLocation, \"cv_mo28ML0EV10QOPMAMPlayerProd\", swfWidth, swfHeight, flashVersion, bgColor);\t   \n\n      for (var v in swfParams) {\n        cv_mo28ML0EV10QOPMso.addVariable(v, encodeURIComponent(swfParams[v]));\n      }\n      for (var v in flashParams) {\n        cv_mo28ML0EV10QOPMso.addParam(v, flashParams[v]);\n      }\n      for (var v in embedAttributes) {\n        cv_mo28ML0EV10QOPMso.setAttribute(v, embedAttributes[v]);\n      }\n\n      cv_mo28ML0EV10QOPMso.addVariable(\"swfEmbedTime\", new Date().getTime());\n\n      var agt = navigator.userAgent;\n       \n      var reFirefox = new RegExp(\"firefox/\", \"i\");\n      var regx = agt.split(reFirefox);\n      var ffVersion = 8;\n      if (regx[1]) {\n          var pts = regx[1].split(/[.]/);\n          ffVersion = parseFloat(pts[0] + \".\" + pts[1]);\n      }\n      var minorVersion = parseFloat(navigator.ap);\n      if ((navigator.appVersion.indexOf(\"Mac\")!=-1) || (ffVersion < 1.5)) {\n          cv_mo28ML0EV10QOPMso.setAttribute(\"height\", swfHeight);\n          cv_mo28ML0EV10QOPMso.setAttribute(\"width\", swfWidth);\n          cv_mo28ML0EV10QOPMso.addVariable(\"oldFirefox\", \"1\");\t     \n      }\n\n      if (cv_mo28ML0EV10QOPMso.write(\"cv_mo28ML0EV10QOPMflashcontent\")) {\n          fp_resizePlayerSpace('cv_mo28ML0EV10QOPM', \n                               320, \n                               283);\n      }\n      else {\n          var nsPrefix = 'cv_mo28ML0EV10QOPM';\n\n          fp_resizePlayerSpace(nsPrefix, 0, 0);\n          fp_rewriteDiv(nsPrefix, \"flashcontent\", '<br/>To view this video download <a target=\"_blank\" href=\"http://www.macromedia.com/go/getflashplayer\" target=\"_top\">Flash Player</a> (version 9.0.115 or higher)');\n      }\n  } catch(err) {\n      fp_resizePlayerSpace('cv_mo28ML0EV10QOPM', 0, 0);\n  }\n  return false;\n}\n\n\n\nfunction _cv_mo28ML0EV10QOPMloadSwf(movieID, playerVersion) {\n    var swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/20120510035744301/AMPlayer._V148501545_.swf\";\n    var swfWidth = \"320\";\n    var swfHeight = \"100%\";\n    var flashVersion = \"9.0.115\";\n    var bgColor = \"#FFFFFF\";\n\n    var swfParams = {};\n    var flashParams = {};\n    var embedAttributes = {};\n    swfParams.amazonPort = \"80\";\n    swfParams.allowFullScreen = \"true\";\n    swfParams.telemetrySubPageType = \"VideoReview\";\n    swfParams.nsPrefix = \"cv_mo28ML0EV10QOPM\";\n    swfParams.locale = \"en_US\";\n    swfParams.logUrl = \"gp/mpd/l\";\n    swfParams.canResize = \"1\";\n    swfParams.autoPlay = \"1\";\n    swfParams.sessionId = \"000-0000000-0000000\";\n    swfParams.marketplaceID = \"ATVPDKIKX0DER\";\n    swfParams.salign = \"LT\";\n    swfParams.preset = \"detail\";\n    swfParams.mediaObjectId = \"m23556TGY3Y8F9\";\n    swfParams.autoPlayTimer = \"\";\n    swfParams.mediaObjectIDList = \"m23556TGY3Y8F9\";\n    swfParams.playIsUserGenerated = \"1\";\n    swfParams.enableShare = \"0\";\n    swfParams.permUrl = \"gp/mpd/permalink\";\n    swfParams.telemetryPageTypeID = \"RW5D5L1AGTA4P\";\n    swfParams.xmlUrl = \"http://www.amazon.com/gp/mpd/getplaylist-v2/m23556TGY3Y8F9/000-0000000-0000000\";\n    swfParams.amazonServer = \"www.amazon.com\";\n    swfParams.scale = \"noscale\";\n    flashParams.allowFullScreen = \"true\";\n    flashParams.salign = \"LT\";\n    flashParams.bgcolor = \"#FFFFFF\";\n    flashParams.allowScriptAccess = \"always\";\n    flashParams.quality = \"high\";\n    flashParams.wmode = \"transparent\";\n    embedAttributes.title = \"Flash Player\";\n\n    if (movieID){\n      if (playerVersion == '3'){\n        swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/20120510035744301/AMPlayer._V148501545_.swf\";\n        swfParams.mediaObjectIDList = movieID;\n      } else {\n        swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/legacy/20101014901/AMPlayerProd._V197491872_.swf\";\n      }\n      swfParams.xmlUrl = \"http://www.amazon.com/gp/mpd/getplaylist-v2/\" + movieID + \"/000-0000000-0000000\";\n      flashParams.wmode = \"transparent\";\n      swfParams.autoPlay = \"1\";\n    }\n\n    if (document.getElementById('cv_mo28ML0EV10QOPMduration')) {\n      document.getElementById('cv_mo28ML0EV10QOPMduration').style.display='none';\n    }\n    cv_mo28ML0EV10QOPMloadSwf_Core(swfLocation, swfWidth, swfHeight, flashVersion, bgColor, swfParams, flashParams, embedAttributes);\n\n  return false;\n}\n\nfunction cv_mo28ML0EV10QOPMloadSwf(movieID, playerVersion) {\n   return _cv_mo28ML0EV10QOPMloadSwf(movieID, playerVersion);\n}\n\n\n\t\n\t\t// ]]>\n\t\n\n<!--\n\nfunction cv_mo28ML0EV10QOPMnewHeight(h)\n{\t\n    fp_resizePlayerSpace('cv_mo28ML0EV10QOPM', 0, h);\n}\n\nfunction cv_mo28ML0EV10QOPMresetPlayer(w,h,bw,cc) {\n  cv_mo28ML0EV10QOPMnewHeight(h);\n\n  cv_mo28ML0EV10QOPMso.addVariable(\"resetBandwidth\", bw);\n  cv_mo28ML0EV10QOPMso.addVariable(\"cacheCode\", cc);\n  cv_mo28ML0EV10QOPMso.setAttribute(\"height\", h);\n  cv_mo28ML0EV10QOPMso.setAttribute(\"width\", w);\n  cv_mo28ML0EV10QOPMso.write(\"cv_mo28ML0EV10QOPMflashcontent\");\n}\n\n-->\n\n\n\n\n\n\n\n\nvar cv_mo28ML0EV10QOPMRollOverImg = new Image();\ncv_mo28ML0EV10QOPMRollOverImg.src = \"http://ecx.images-amazon.com/images/I/81OujvuDVoS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play-active,BottomLeft,130,-12_CR0,0,0,0_.png\";\n\nvar cv_mo28ML0EV10QOPMpreplay = document.getElementById('cv_mo28ML0EV10QOPMpreplayImageId');\nif (cv_mo28ML0EV10QOPMpreplay) {\n  cv_mo28ML0EV10QOPMpreplay.onmouseover = function() {\n    cv_mo28ML0EV10QOPMpreplay.src = \"http://ecx.images-amazon.com/images/I/81OujvuDVoS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play-active,BottomLeft,130,-12_CR0,0,0,0_.png\";\n  }\n  cv_mo28ML0EV10QOPMpreplay.onmouseout = function() {\n    cv_mo28ML0EV10QOPMpreplay.src = \"http://ecx.images-amazon.com/images/I/81OujvuDVoS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play,BottomLeft,130,-12_CR0,0,0,0_.png\";\n  }\n  \n  \n  var node = cv_mo28ML0EV10QOPMpreplay.parentNode;\n\n  var cv_mo28ML0EV10QOPMcurrentClick = node.onclick;\n  node.onclick = function () {\n    var head = document.getElementsByTagName(\"head\");\n    if (head[0]) { \n      var logTag = document.createElement('script');\n      logTag.type = \"text/javascript\";\n      logTag.src = \"/gp/customer-media/du/log.html?ie=UTF8&p=CustomerImage&s=CustomerVideoPlay\";\n      head[0].appendChild(logTag);\n    }\n\n    if (cv_mo28ML0EV10QOPMcurrentClick) {\n      return cv_mo28ML0EV10QOPMcurrentClick();\n    }\n  }\n}\n\n\n\n\n Length:: 4:21 MinsPROS:-Waterproof to 33' with no special housing required-Small form factor-Not bulky or rubberish like many other waterproof housings-Does 1080P video on the fly-Smooth touchscreen interface via large 3.3\" OLED displayCONS:-Small battery-Will not record videos on internal memory (must buy a memory card - not included)-Touchscreen is fully exposed to potential scratching. Recommend a protector", "Date": "May 19, 2013"}, {"Title": "The Sony TX7 is a far better alternative and more affordable", "Author": "M. Gehret \"G-Man  Colorado\"", "ReviewID": "R10LQI7FK999YZ", "Overall": "3.0", "Content": "Compared to the Sony TX7,  this is pretty much that same camera, only smaller, lighter, eats batteries, and is far more expensive. The only good is that its moisture and dust proof. I wouldnt trust this camera under water. They just don't make these cameras to be submerged and actually last without later issues and anger by the user. the Sony TX7 has far superior sound, is larger with bigger screen and better made.", "Date": "July 2, 2013"}, {"Title": "Cheated by Amazon", "Author": "Niraj", "ReviewID": "R1PV29OTR13TP9", "Overall": "2.0", "Content": "I bought this camera because Amazon said it comes with 8 GB internal memory but actually it do not have any internal memory. I took 2 pics and it says memory full.Camera is good but only disadvantage it does not have any internal memory.", "Date": "May 21, 2013"}, {"Title": "falsely advertised", "Author": "Khaldia", "ReviewID": "R2IIR82CWA99MV", "Overall": "3.0", "Content": "Amazon states camera comes with 8gb of memory when in actuality it only holds 42mb of memory.I loved the camera, that is why it is receiving 3 stars and not 5.", "Date": "May 17, 2013"}, {"Title": "Waterproof is the Key...Amazing camera!", "Author": "Technology X", "ReviewID": "R14UWE3ACAKET1", "Overall": "5.0", "Content": "Bought this camera for the wife and we loved it so much we did a complete review found here..Enjoy![...]", "Date": "April 19, 2013"}], "ProductInfo": {"Price": null, "Features": "Capture breathtaking images\nImage stabilization reduces blur\nPink", "Name": "Sony DSC-TX30/P 18 MP Digital Camera with 5x Optical Image Stabilized Zoom and 3.3-Inch OLED (Pink)", "ImgURL": "http://ecx.images-amazon.com/images/I/41B5WDA5TXL._SX300_.jpg", "ProductID": "B00BEHQLPG"}}