{"Reviews": [{"Title": "Excellent choice!", "Author": "Chuck", "ReviewID": "RBDYKDF352647", "Overall": "5.0", "Content": "I am not a professional - but I have a real passion for photography.  I take on average 500 pictures a week, mostly landscapes, birds and anything else that gets in my way.  This camera exceeds my expectations.  The thing I noticed first as I upgraded from a \"Bridge Camera\" is the speed.  You can get 5-6 pictures a second, the auto-focus speed is incredible, from off to shutter release - when that deer runs across the path - is very quick.  The camera does exceptional in low light, shooting in a dimly lit restaurant at 800 ISO produces very good results.  There are many In-camera features, for example HDR and \"miniature effect\" that I have used already, and I am just getting started.  I purchased the Weather Resistant lens to go with the WR camera body and have no reservations standing in the rain trying to get that lightning shot or out in the boat taking pictures of the kids skiing, etc.  The 18-135MM Lens gives me so many options without having to change lens' all the time - I also have a 70-210MM lens from my Father that is 40 years old and it  snaps right on and produces fantastic results at F5.6 - The camera is a little heavy and the battery life could be just a little bit better - about 400 pics so far to each battery - I purchased a spare re-chargeable and the battery adapter as back-ups.  I didn't have a professional's budget and I really feel I got A LOT of camera for my money.  So many things to learn it's hard to put this thing down.  Really happy with this purchase - would highly recommend this camera and lens combo.", "Date": "May 28, 2013"}, {"Title": "Unrivaled camera for the price", "Author": "Kharan", "ReviewID": "RKQQVWV9IQC4J", "Overall": "5.0", "Content": "I've had my white K-30 for over four months now. It's an older, discontinued model, but very current in capabilities nonetheless. The truth is, you can get it for 50$ less than the K-50, and they're the same camera internally. And, more importantly, it's a prettier, more stylish camera, although that is very subjective.It's a relatively heavy device, compacted however into a very small form factor. The steel chassis does NOT help in this wise, but the materials employed for the rest of the body are way above the usual Canon fare (pretty bad, to be honest) and also better than Nikon, although not by such a great margin. You could say it's comparable to a good Sony SLT, except smaller and more friendly. In my experience, every one thinks it's some kind of super-pro camera simply because of its color and edgy appearance, and I have to admit it's simply beautiful in white. This despite being only the enthusiast Pentax model, but it goes to show the impression that it causes. Hell, I've gotten awed comments from a 7D shooter!Anyway, on to the practical matters. Having dual control wheels is BASIC, and I hope more manufacturers pay attention to this. Once you've had them, it's impossible to go back. Besides, the wheels are the more rational Nikon design (I just plain dislike Canon's in this regard). Most of the menus are extremely simple to set up. The buttons available are only the necessary ones, there's not a single one I find superfluous.The pentaprism finder is good, but in all frankness, I cannot see such a massive difference, just like I don't find my GF's Nikkormat that much better (but the focusing screen is a very, very different story). Maybe I'm just weird like that, but pentamirrors aren't that terrible in my opinion.Most of the missing functions I don't care much about. I rarely bracket, or need HDR raws, or shoot video. I must say that live view on the camera is actually remarkable, it's as good as my Panasonic GX1 (that ONLY features LV shooting). The focus works well in good light, the LCD is readable, and the resolution and colors on it are off the charts. The PDAF isn't that hot in low light, but it CAN track, you just need to know the module's limits. I find it satisfactory enough.So, what's really good about it to deserve five stars? Actually, it's the combination of price, sensor, in-body stabilization and enthusiast-oriented features. The sensor is a marvel, absolutely, rendering good files all the way to ISO 3200 if you're not obsessing about it. It's got almost no chroma noise, which is ugly and hard to remove, while the luminance noise appears enough like film not to be obtrusive. The colors... My god, the colors! I know I'm overreacting, since I come from the old Panasonic sensor and rendering (that is hideous), but I'm consistently impressed with the camera's white balance, exposure, and actual shooting decisions: it relies on its great low-light ISO performance to keep solid shutter speed and aperture values in  most situations, without overdoing it. It's the only camera I've had that can actually correctly meter and balance sunsets and sundowns, which is an area where many fail (I admit that the K-30 is also my first really remarkable camera, after Sony, Panasonic and Olympus).I can't say much about the lens. It's incredibly compact but again, heavy. The materials are above average, and I like that green ring and included hood. It renders okay, I guess, and its color rendition in particular is good, but it won't tax the sensor, that's for sure. The WR is a very welcome feature, and one actually notices it. I'd say it's very much ahead of your typical kit lens, and worth the price, but not a steal or great bargain.In short: If you're considering a Nikon D5xxx or comparable Canon (their model line-up is SO difficult to make out! Not to mention the name differences between Japan, Europe and the Americas) then I'd buy the Pentax. It'll give you many features reserved for the flagship crop cameras of the other brands for a fraction of the price. The K-30 is a great product with a ton of potential, and also a boatload of older glass that works on it without adapters or anything. If you're looking at Sony, however, I wouldn't be so sure, because Sony is really targeting another part of the market, maybe not that well aligned with Ricoh's (Pentax's parent company). All in all, I can wholeheartedly recommend this camera.", "Date": "March 13, 2014"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B00B13EMZY"}}