{"Reviews": [{"Title": "K30 works great", "Author": "Scott_G", "ReviewID": "R3SD830JN7Z6Q0", "Overall": "5.0", "Content": "This K30 was an upgrade for my K10d which I've had for several years.  Produces great photos in lower light on Auto.  Pix taken with the 18-135 lens are very sharp.  Easy to handle, nice big text on the screen easily read in all but direct sun light.  Only shot a few seconds of video, but it seems pretty nice.  Glad I bought it!", "Date": "August 13, 2013"}, {"Title": "Great deal on a great camera", "Author": "Chad Kuny", "ReviewID": "R25WP0T1ACX8AM", "Overall": "5.0", "Content": "My fiancee and I were looking to do some more adventurous vacations in the future, particularly to rainy or dusty places to see wildlife. She also wanted to have some good pictures of the animals to enlarge, which meant that I was looking for a DSLR, and weather sealing was somewhere between a very large plus to a necessity. I had settled on the Pentax K30 for the combination of price and weather sealing with quality images, and the 18-135 lens was recommended to me for the wide zoom range at a reasonable cost. I figured that in the jungle I A) didn't want to be changing lenses too much for fear of water getting in and B) I could need anything from a pretty wide angle lens for dense jungle to as much zoom as possible for further away animals.So I found this camera on Amazon in blue for a much cheaper price and decided to jump on it. The blue is different than standard, and I can tell that I get a few looks for it, but it could also be that I'm carrying around a DSLR at a dog park. I like blue so it's not too distracting, even if I might have preferred a more matte option. But deal hunters can't be too much of choosers. The camera arrived in the manufacturers packaging, but with the lens in the \"white box\". Everything that was supposed to be included was, including the lens hood, which I had read was something that didn't always make it in.I have had good experiences with the camera thus far, taking some very nice pictures of friends water skiing, our dog at the dog park, and even at a few zoos, and trying to get a hang of having more control over pictures than my point and shoot. The weather sealing got it's first real test last weekend, as I was out in some mild to moderate rain and then ducked from the cold outside into a humid greenhouse. No hiccups in operation, and just a bit of fogging on the lens from the jump (~40F to 75F and humid would fog most anything, so I thought that the lens did pretty well, if not a flawless performance). Overall, I'm very pleased with the purchase and I'm looking forward to both learning more about photography and getting it some more difficult tests.", "Date": "October 25, 2013"}], "ProductInfo": {"Price": "$799.19", "Features": "DA 18-135mm ED AL (IF) DC WR Zoom Lens\n16.3Mp APS-C CMOS Image Sensor\nFull 1080p30 HD Video h.264 Compression\nPRIME M Processing Optimized for Video\nAdvanced SAFOX IXi+ Autofocus", "Name": "Pentax K30 Digital Camera with 18-135mm Lens Kit (Crystal Blue)", "ImgURL": "http://ecx.images-amazon.com/images/I/51ejvo2ol%2BL._SX300_.jpg", "ProductID": "B00B13HGJS"}}