{"Reviews": [{"Title": "Samsung does it again", "Author": "ioBuddha", "ReviewID": "R3CX2EAYZM6ZCA", "Overall": "5.0", "Content": "I read all the early CES hands-on reviews and even though know one has reviewed this camera on Amazon I ordered the it. I needed a simple 'idiot-proof' camera when I am out on the town with my family and do not want to lug a full frame DSLR around. This is a review based on having played with the camera and all of it's settings for the last 4 hours. I shot about 100 pictures in various settings and even though I did not think the WiFi was something I cared about... it has been a real pleasure to use. I've owned a few Samsung 'Point and Shoots' (PNS) in the past and the image quality is excellent... this one is no exception. What I really wanted was a nice low-light camera and this model does it better than any I have tried in the last 2 years. I am an avid photographer and I shoot products images for a few companies and this camera could handle the task; which surprised me. First off it has many simple buttons that make it so easy to use that by image 50 I just turned on the AUTO button and it worked just as good as me manually setting the camera for the situation; that is what I wanted in a PNS. The WiFi was simple to use, just connect the cable to a PC and install the iLink software (built into the camera) and set it up for Auto-backup and it will download the software and connect to your router; meaning once you shoot it will Auto-Backup on the fly when you tell it to. No more pulling the SD card out and importing images. It also has a great on-board editing program along with a bunch of Instagram type filters if you want to look retro. I am very, very impressed by the low-light shooting and will update this review after a good week of use. But for now, this inexpensive Samsung is the one you want. I just put my Nikon Coolpix up for sale on Amazon and will fine tune this camera for my needs. In conclusion it is almost to idiot proof. The settings are so simple that anyone can take really nice photos. I have not tried the video yet, but when I do I will update the review.", "Date": "February 28, 2013"}, {"Title": "It's an alright camera", "Author": "James Mccarty \"expose\"", "ReviewID": "R13XUTX3OOJQX7", "Overall": "3.0", "Content": "I purchased this camera (the white one) locally at a Sams Club because it came with a kit for the same price as Amazon. Not really a great deal, but did it anyway. It came with a small case (useless as its too small to really fit the camera) and an 8gb Samsung sd card. (Woopy do, I saved $6 there) The build quality seems good. With one exception, the popup flash. I can bet anything this will eventually break. If it doesn't break due to users accidentally snapping it off, it will wear out from popping up and pushing it down. It is a little tricky pushing it back in too. I base this opinion on other cameras I have used.I found the cameras photo settings to be straight forward and easy to understand for most people. Full auto works ok, but P is the way to go for your best exposure. The flash worked reasonably well to about 12 feet or so. Any further in a less then normal to dimly lit room, and you will find your subject under exposed. On the other side, any closer then 4 feet and you will find your subject over exposed. The camera has a flash fill setting, but I found no difference between fill and auto.The image quality is best at 16mp (the highest setting) I would have rather used 10 or 12mp but the drop off in clarity was too great. The color was accurate and images were sharp. As long as you held really, really still. I found the camera to use a much slower shutter speed then the average person can hand hold. I don't think the anti-shake works well at all. I have used better. Especially with any amount of zoom.I was very disappointed with the response of the camera. It would often not take the picture when I pressed the shutter button. Example: I turn the camera on, point it at a person or object, press the button and get nothing. I had to resort to the slightly depressing the button to allow the camera to focus first, wait for the center green box or the face detecting boxes(depending on which setting I used) turn green, then press the button the rest of the way to take the picture. For a camera in 2013 I feel this is unexceptionable. Especially in this price range. It doesn't always do this, but it did most of the time.The other thing that really disappointed me was the WiFi feature. First the good. It connected to my Samsung S3 phone perfect. My S3 could control the camera to take photos, off load images, and use the remote view finder. It was easy to connect to Picasa and SkyDrive to offload images to the cloud. I assume Facebook and emailing would be the same. You can connect to your phone while outside of a local area connection. In other words, driving down the road or in the middle of nowhere with no wifi router in sight, you can connect to your phone. Nice feature for offloading images and using your phones internet connection to upload. The Direct Link button on the back of the camera can be programmed to do any of the WiFi functions with just one press.Now the bad. I was excited to program the Direct Link button to connect to Picasa and upload images. Well, when you press the button, it brings up 4 options. Facebook, Picasa, Email, and SkyDrive. I then have to press Picasa. It then opens up a gallery of images. I start selecting the ones I want to upload (there is no select all. That's stupid) and I get stopped at 12 selections with a message saying I have reached the limit. That makes this feature useless to me. To make matters worse, it doesn't even tell me where I left off so I don't select ones I already uploaded. The wifi is fast enough to upload the 12 images in about a minute or two (depending on your ISP's speeds) so I don't get the limit here.Some other thoughts: Image quality at higher iso's is pretty good. I took several shots at 400 to 3200 iso and was ok with the noise in the 1600 and 3200 iso range. 400 iso is the sweet spot I think. The camera's auto iso wants to hang aroung 100 iso which is why several of my shots without flash were blurry. If I were to keep this camera, 400 or 800 iso is where I would leave it.The menu system in general is very good. Its easy to find your setting and the option to use the touch screen or d-pad is nice. In fact, I think the UI is probably the best part of this camera. I found the settings I needed to change were quick to find and the flow of using the touch and the d-pad were perfect.Here is a quick example of why I am not keeping this camera besides the (in my opinion) botched WiFi uploading. I wanted to photograph my daughter holding her 1 month old cousin. I pull out the WB800f, point and.....nothing. Press the button again and great. It took the shot. Its blurry because the camera was set to auto iso and it used too low of an iso. I try a few more setting the iso to 800. Well, its almost there, still a little blurry with the camera set on P. The shutter was just a but to slow. I pop the flash up. I press the button, nothing. Press again and it takes. Overexposed because I am about 4 feet away. I back up and try and pop off several shots. Its not real fast at this. I manage to get off 3 shots. Now, just for fun, I pull out my Samsung S3 phone. Hit the camera icon and pop off about 8 shots (no flash) in the time it took me to take 3 with the WB800f. \"Ok\" you say, \"thats great\". \"But I bet the quality is better on the WB800f\". And you would be correct. But is it enough for me to justify the purchase of this camera? Not for me. I could easily get a decent 8x10 print out of either the S3 or the WB800f of my daughter and her cousin. The WB800F needed a flash to get the decent shot though. Unless I spent a bit more time bumping up the iso and messing with shutter speed.I was just a little taken back that my phone was able to pop off 8 decent shots better then this dedicated point and shoot camera. I think that says something.I didn't expect this to be a Canon G12. But I did expect it to do better then my Canon A720IS. It is not faster, it is not better image quality, its marginally better in low light as long as YOU adjust the iso up to 1600 or 3200, and the added features just don't warrant the price.If you can get this for $200 and you are ok with the limited WiFi uploading, then go for it.One thing to note is that this camera is firmware upgradable. In fact, I received a firmware/software upgrade during my brief time with the camera. I don't know what it fixed. I found nothing that it added. But I bet things like added Cloud sync options could be easily added. Perhaps they will remove the limited uploading.", "Date": "April 23, 2013"}, {"Title": "Love this camera", "Author": "Sherry123", "ReviewID": "RYP2C12KWI7CX", "Overall": "5.0", "Content": "We initially purchased a Nikon but returned it because of poor picture quality and difficulty in figuring out how to use it.  We purchased this camera hoping for the best but expecting a similar experience.  Boy were we wrong - this camera is extremely easy to use and the pictures are clear and exactly what we wanted.  The price was a little more but well worth it.", "Date": "April 18, 2013"}, {"Title": "Great camera if you know how to use it!", "Author": "Mike", "ReviewID": "R1PGP7K606HRO5", "Overall": "5.0", "Content": "I bought this camera to take to sporting events and to use when at the bar drinking with buddies.  I own a photography business, and lugging around a 5DmkII/Lenses got to be tiresome when just going for a night out.  I love this camera.  The zoom and image stabilization are great, and I love the full manual controls.  A lot of the complaints from other reviewers could be corrected with just a little bit of basic photography knowledge, and I don't feel like going into depth about that right now.  I'll just say that people blaming the camera for user error is frustrating to read.That being said, I have 2 major suggestions for improvement: 1.raw files 2.function to disable digital zoomI'll see if I can post some sample photos.", "Date": "December 13, 2013"}, {"Title": "Full featured convenience", "Author": "Cookie", "ReviewID": "R3LEA7HB7XP30L", "Overall": "5.0", "Content": "Been using it for a couple of months.  I am a serious photographer who hates not having a pretty capable camera with me, but doesn't want to lug around the SLR and extra lenses everywhere I go.  This is an extremely versatile camera which takes high quality pictures and fits quite literally in my pocket.  Problem solved.  In addition to all the modern \"pre-programmed\" functions like HDR, panorama, Best Face, night shot, etc., it has complete control over shutter and aperture, which I use a lot.  And it's easy to set because of the well designed touch screen interface.  The pictures are sharp and vivid, given the size of the sensor and the overall cost.  A ton of capability at this price point.", "Date": "November 27, 2013"}, {"Title": "Love but there is a problem", "Author": "Molly", "ReviewID": "R36GDEZQDGSBDY", "Overall": "3.0", "Content": "I really love this camera. Very easy to use and I love all the features it has. My only problem with this camera is that it wont charge whenever I want it too. It has to be completely dead for it to charge. I sent it back and got my 2nd one and this one does the same thing. For example I cant charge it if it only has like 1/4 battery left...it has to completely die and I do not like that at all. I may get a totally different camera :(", "Date": "May 10, 2013"}, {"Title": "I am surprisingly impressed!", "Author": "jennstx", "ReviewID": "R3B7T7HVH2E9VC", "Overall": "5.0", "Content": "Was a little concerned about the timing and tried to get it earlier but this seller did not offer overnight delivery for this item.  However it arrived on time, according to the order, in perfect condition and I couldn't be happier.  The picture quality is soo much better than I anticipated and it has a zoom image stabilization that really made all my shots over the water with a big wind turn out great.  Oh..best best best feature..the wifi.  I was on the ferry and got Google Android app downloaded and then it sent ALL my pictures so quickly to my phone and I posted them to facebook.  I have an HTC Rezound so my picture quality is already better than most- but there is nothing like a real zoom and a real camera.  I'm totally impressed and happy and it's a great price for a great phone loaded with features and WIFI!!!", "Date": "March 18, 2013"}, {"Title": "An outstanding camera that far exceeds expectations", "Author": "Kevin Willison", "ReviewID": "RDIOEXLZYQUL6", "Overall": "5.0", "Content": "This is an outstanding camera. I recently took this camera on a trip through South America and it worked great in all situations. The zoom, stabilization, and low light capabilities all exceeded expectations. The sunset and waterfall settings were an added bonus. There were no condensation problems going from an air conditioned room to a humid rain forest, or shooting in a misty waterfall environment. My friends with their SLR cameras were all envious of the point-and-shoot that worked as well or better than their large cameras.", "Date": "December 2, 2013"}, {"Title": "great pictures from this compact camera", "Author": "David", "ReviewID": "R2TJLK0V18ENIS", "Overall": "4.0", "Content": "I wanted a pocket camera because I know anything larger will get left at home.  Important considerations in my camera search were image quality, macro shots, low light shots, and decent zoom capabilities.  The WB800F exceeded my expectations on those points.  I'm not much interested in the video, wifi connectivity, and various special effects.  There is a 168 page instruction manual that is only available as a PDF download that does a very good job of explaining how things work.There is a red AF lamp for low light shots.  It can be turned off if desired.  This camera's low light capabilities should be great for museums and galleries that prohibit flash.The pop-up flash appears fragile and likely to likely to get broken.  The buttons for camera power and pop-up flash have nothing to protect them against accidental activation.  For that reason, I recommend against carrying this camera in a pocket or even in a soft shell case.I downloaded the firmware update.  After that update, I could no longer turn daylight saving time on or off using the touch screen but still could using the control buttons.  The update and that very minor loss of functionality may be unrelated, but I suspect they are.  Unless I discover some impairment of photographic functionality, I plan on keeping this nice little camera because it takes great pictures.  Were it not for the design missteps noted above and the botched update, I would have rated it 5 stars.Update: After a few days, the daylight saving time setting spontaneously regained functionality on the touchscreen.  When \"off\" shows on the flip card icon under DST, DST is on.  Touching the DST icon then, which makes \"off\" disappear, turns DST off.  That's my conclusion based on finding the time not adjusted after the fall back date for DST with \"off\" not displayed.  The instructions don't explain that.", "Date": "October 31, 2013"}, {"Title": "This camera rocks", "Author": "Rayman", "ReviewID": "RST6EU2PFQQ66", "Overall": "5.0", "Content": "Samsung has their stuff together. It amazes me each time I use it.My wife went to England and Ireland, and I got her and my daughter each one. One month later when they came back, I saw the pics, and they were so astounding, I ordered one for myself. get one, you'll thank me when you use it.!", "Date": "March 2, 2014"}, {"Title": "IF you want iPhone compatibility skip the Galaxy camera and get this one!", "Author": "Sharon L. Nawalanic \"Sharon\"", "ReviewID": "R3B3GH2T88E88T", "Overall": "5.0", "Content": "I had both cameras here physically, but only opened the Galaxy Camera, thinking I would prefer that one.  Don't misunderstand, it is a great camera- but not iPhone compatible through Bluetooth or apps.  THIS ONE IS iPHONE COMPATIBLE....through apps and Wi-Fi.  The cameras are the same mega pixels, same optical zoom, the difference?  - this one does not have Bluetooth or Android Jelly Bean...but I wanted a camera that would send pics wirelessly between my iPhone, my PC and the camera.  This one does...The Galaxy would 'discover' the iPhone but not connect.  It would not discover my home network, nor would any app let it work between the items listed.  After a few days of trying everything and anything...I sat on the phone with Samsung tech.  This camera has support for iPhones...the Galaxy camera does not and although it's not a new camera to the market, they are aware of 'issues' but have no date for any corrections.  (I was advised by an IT person that it usually means a newer model is in the works) ...so IF you have an iPhone or iPad...THIS is the camera for you- unless you don't mind e-mailing photos between various devices.  This camera will upload directly to FB, You Tube, etc... The picture quality is identical...but it is not a small tablet.", "Date": "December 28, 2013"}, {"Title": "Samsung has done it again", "Author": "Sie", "ReviewID": "RYML7G8SLHC57", "Overall": "5.0", "Content": "I absolutely love this camera. It's easy to use, and does everything a professional camera would do, only its for amateurs like myself. Doesn't require a lot of instruction and is pretty self explanatory. I can do anything w/ this camera and I love the smart features is comes w/ as well. Works well w/ my phone and other electronics to easily share photos or download them. The zoom features are excellent and its a convenient size that is easy to carry around. Definitley a good buy and I would recommend it to anyone looking for a good quality camera. I have taken this thing to professional sporting events, concerts, and family functions, and have never been disappointed w/ the quality of the photos.", "Date": "November 8, 2013"}, {"Title": "returned it for Canon", "Author": "Jeffrey Bwolf \"jb wolf\"", "ReviewID": "R21F4F4F8LH84Z", "Overall": "2.0", "Content": "way to slow to get flash activated.  You will easily miss shots.  Sent it back and got a canon which has quicker response", "Date": "January 11, 2014"}, {"Title": "good camera, good price", "Author": "Lana Dao", "ReviewID": "R3PWTRTN30PJOE", "Overall": "5.0", "Content": "i like the big screen, easy to use, and ggod quality fotos, however the carrying case  included was a biig joke...way way too tight, not at all functional.  i now use it as a coin purse.", "Date": "November 26, 2013"}, {"Title": "Perfect for my photo needs", "Author": "rchkr", "ReviewID": "RJA8T5HT54854", "Overall": "5.0", "Content": "This camera is great for a casual photographer like me.  I am not a professional photographer, and do not expect this camera to compete with the highest-end models.  But, for the price and with the great zoom, it is exactly the camera I need.", "Date": "September 12, 2013"}, {"Title": "Excellent!", "Author": "Jeff", "ReviewID": "R28Y6Z3EYIFITE", "Overall": "5.0", "Content": "Came within 4-5 days. Ordered it right when this came out. Had it for about a month now. Runs GREAT! Very good and its picture are very clear! Video are so good! I use this camera to do videography all the time. Great camera!Pro: Very fast, built in wifi, auto share, touch screen, 1080p@30fps FULL HD video recording, amazing picture, great AF, almost everything! Haha, the size it pretty big. I thought it was small but I was wrong. Its pretty big and sturdy, I love it!Cons: The wifi connection sharing to facebook, youtube etc. sometime laggs, but its ok. Remote play only works on samsang smart phone and not other smart phone, hope they fix this on the app.Overall, AMAZING CAMERA! Pricey, but worth it!!!", "Date": "April 25, 2013"}, {"Title": "Samsung WB800F 16.3MP Smart WiFi Digital Camera", "Author": "D. Campbell \"ncpdoug\"", "ReviewID": "R2QOPZ773V6BPT", "Overall": "5.0", "Content": "My Daughter has a Samsung Galaxy camera and I like the small camera size, quality of the photos, ability to send photos via Wi-Fi and ease of use of her camera. I am currently using a Canon Power Shot SX20IS, and while it takes pretty good photos, it is clunky and very poor in low light. I did a side by side comparison of the Samsung Galaxy and the WB800F, and found few differences -  the screen size of the WB800F is 3\" VS. the Galaxy at 4.8\" (big difference in size) - the Galaxy has the \"Jelly Bean\" function and the ability to use the screen like a mini computer, and if you have a Smart Phone you can link them together somehow - They both can send photos to email, Facebook, and backup photos to your computer via Wi-Fi. One of the biggest differences of course is the price, more technology - more money. Because I am still in the semi-dark ages digitally and don't have a Smart Phone, and like the smaller size of the  WB800F I ordered the \"Red\" one through Amazon. Best price I found through a major retailer. After two days of playing with the camera the only complaint I have is that the view screen becomes hard to see in outdoor shooting. But you get that with any digital camera. I was able to configure the WI-Fi and I am sending photos to Facebook and backing up wirelessly to my computer. The biggest plus is that my Wife really likes this camera (and the color, which is on the pink side of red). The full manual (150+ pages) can be downloaded from Samsung, and it is VERY detailed if you are a novice at technology.", "Date": "March 9, 2014"}, {"Title": "blurry shots", "Author": "Giselle Garcia", "ReviewID": "R21BFO0S9O6WPS", "Overall": "2.0", "Content": "Pretty camera but not good for action shots--come out too dark when on correct setting. If you try auto setting then they are blurry. Shots of senset were nice.Pictures of people---some came out nice and some had not so bright", "Date": "February 3, 2014"}, {"Title": "very good specs for the price", "Author": "ALICIA MENDEZ DE MENDEZ", "ReviewID": "RK45EQN8H97QH", "Overall": "4.0", "Content": "over all happy with the purchase, i miss gmail sinc, the wifi is weak and losses connection all the time, haven't tested recording on poor light conditions, the zoom works great, my camera came with a chinese wall adapter(used and black..)..the screen plastic protector missing, as well as the stickers on the camera..cant ask for a return because i live in venezuela and cant and have limited dollar access..no hdmi cable included.. over all a good experience so far with the camera... hopping for a worldwide shipment method to be included...", "Date": "December 15, 2013"}, {"Title": "Good for daytime picture taking only.", "Author": "Melissa Fugere", "ReviewID": "R23L83IFPB5OFF", "Overall": "1.0", "Content": "Takes good pics outside during the day. Horrible low light/night pics. Nice wifi features. Small and compact, overall you can buy a Sony that is far less expensive with better qualities.", "Date": "February 15, 2014"}, {"Title": "Love the WIFI", "Author": "Guy LeBlanc", "ReviewID": "RZFYYOA41WNX5", "Overall": "4.0", "Content": "Pros:Easy to transfers your pictures to you I-Phone and if you use I-cloud they will also be transferred to your I-Pad.Love the 21x zoom and image stabilization.Love the small size. I have a small cross shoulder pack that I use to carry a water bottle and other items and it has a cell phone pouch on the strap that crosses over my chest and the camera fits nicely in there. I carry it with me every time I go for a walk. Very easy to access.Takes beautiful clear pictures.Love the timer for self or group pictures. Easy to use.Cons:Does not come with a SD card.Does not have usable internal memory( very disappointed ).Hard to take pictures outside because of the glareCould not find a way to take a good picture with backlight. Maybe be experimenting I will succeed.", "Date": "April 23, 2013"}, {"Title": "Awesome camera", "Author": "Kevin A.", "ReviewID": "R1569XCHLNPUS7", "Overall": "5.0", "Content": "I am just a normal guy that wanted a good point and shoot camera.  This thing is awesome.  It has an awesome zoom and wifi upload is super easy.  I bought another one for my mom because the ease of use and great picture taking.  I just leave it on auto and it takes great pics every time.  I highly recommend.", "Date": "March 21, 2014"}, {"Title": "GREAT CAMERA", "Author": "A. Culley \"Curious George\"", "ReviewID": "R3R37NWFPGD07", "Overall": "5.0", "Content": "I LOVE this camera. Very user friendly. Love the fact that you have the option of touch screen functions such as touch to take the picture or touch to AF. Also love that you can use it manually as well and adjust image quality, ect. Definitely not a DSLR, but hey, if you're buying this camera and comparing it to a DSLR and are disappointed, then you should have bought a DSLR. Don't expect them to be in the same category. I really like that this camera picks up a lot of light no matter where you are, the flash is bright (often not even needed), video sound playback is of great quality, great picture quality for the average user, wifi photo upload to your Facebook account, email, ect is awesome easy is so much more that I love about this camera! I got mine for $175 flat, free shipping. To me, that is an AMAZING deal & WELL WORTH the $. I can honestly say that if I would have known then what I know now about this camera, I would have bought it at full retail price. (I'm glad I didn't have to though).", "Date": "March 18, 2014"}, {"Title": "Good for the price", "Author": "Amazon Customer", "ReviewID": "RM1TJ2XK8L53U", "Overall": "3.0", "Content": "Its a good camera for the price.  Good zoom and takes sharp pictures.  My only complaint with it is it's slow from startup to when you can zoom.  Almost painfully.  For the price though have to expect some shortcomings.  Love the small size overall.  The different modes are kind of cheezy and worthless.", "Date": "March 14, 2014"}, {"Title": "Easy to use.", "Author": "J. Bellman", "ReviewID": "RAE5ILTQ295MD", "Overall": "5.0", "Content": "I have found this camera very easy to use and it takes very good picture. The zoom feature is very good. My wife likes to put pictures on her facebook page and this camera makes it possible to put them on he page with Wi-Fi.", "Date": "March 10, 2014"}, {"Title": "Super Camera!", "Author": "JR", "ReviewID": "R1BBDOXMWF3D8Q", "Overall": "5.0", "Content": "The camera takes great pictures, is just the right size and has a very good zoom range.  The wifi picture transfer on this camera makes moving pictures to my laptop a snap.  The wifi capability is a key reason why I picked this camera along with the touch screen ease of use.  Highly recommend this camera.JR", "Date": "March 8, 2014"}, {"Title": "love, Love, LOVE!", "Author": "Jillybean", "ReviewID": "R2SQQXTEKMBNJG", "Overall": "5.0", "Content": "This camera is so awesome. I'm still in the beginning stages of learning it, but my #1 favorite thing about it is the wifi access.  I was unsure about this in the beginning, but it's saves so much time to be able to upload to Facebook or to my phone instead of having to download them onto the computer and so on.  I'm still learning all the picture tabs, but this camera takes great pictures, you have to keep it really still though.", "Date": "March 7, 2014"}, {"Title": "Love zoom and pairing with phone", "Author": "Carl Leedy", "ReviewID": "R1XXDI7JW8UM3J", "Overall": "4.0", "Content": "I appreciate the possibility to zoom a long distance and pair it with my phone to place pics on face book.  It is difficult to see the picture and the zoom bar in bright light.  I have trouble at times finding the pics on my phone.  I see one has to put them all on at once and not one at a time.  The worst problem is a spot on the lense a little above the center which shows up in all pics where that area is light.  I took it on a cruise anyway and saw the spot a lot.  I used the soft cloth provided to try and clear it off but it appears to be on the inside.  Perhaps I should send it back since this is not satisfactory.", "Date": "February 22, 2014"}, {"Title": "super camera", "Author": "lite guy", "ReviewID": "R1NJGW0XO9HAQ9", "Overall": "5.0", "Content": "I have owned and used many the big Nikon and Canon cameras in the.  Those big old cameras just became too much to lug around on excursions and foreign travel.  Thought this is no micro wallet sized camera, it is quite convenient and easy to use.  The photos are great inside and out with not much need to ever override the internal auto setting.", "Date": "February 22, 2014"}, {"Title": "New technology get me hooked", "Author": "David Pandozzi", "ReviewID": "R3R7JGBGTKV27O", "Overall": "4.0", "Content": "Wow! what a camera and how do I learn all the new 'stuff' it has to offer.  I wish they had a video with instructions for the wifi capabilities.  I'm confused and there is no real manual just a small leaflet to get you started.  Oh, well back to the store for some help.", "Date": "February 3, 2014"}, {"Title": "More like 4.75 stars", "Author": "Alison", "ReviewID": "R3JCD7XBZ2EJOK", "Overall": "5.0", "Content": "This camera is a bit heftier than I thought it would be, so that's a little disappointing. I think the quality of the pictures is really nice and I like that I can directly post to Facebook or transfer to my phone. Although that part will take a little practice remembering how to do.", "Date": "January 18, 2014"}, {"Title": "Great Camera!", "Author": "Olivia", "ReviewID": "R21MG3DOHTLM4D", "Overall": "4.0", "Content": "I LOVE everything about this camera! Especially the fact that I can upload to my phone or email right away and post online! The only thing that bugs me a bit is that when zooming, it's not as smooth as I would like it and the start/stop when trying to zoom is a bit abrupt. Hence the 4 star rather than 5. If Samsung can smooth out the transition of the zoom, I would rate it 5.", "Date": "January 17, 2014"}, {"Title": "Very Happy", "Author": "Jack", "ReviewID": "R689VCM95F6YF", "Overall": "5.0", "Content": "Have only had it for a week but it has been great so far and the Wi-Fi from camera to phone is simple and works great.  Received in timely manner.  No complaints at all!!", "Date": "December 13, 2013"}, {"Title": "Very difficult to use outdoors.", "Author": "R.M.", "ReviewID": "R2SXK51RB88IEI", "Overall": "3.0", "Content": "There is no viewfinder, only the viewpanel on the back.  In sunlight it is very hard to see.  I had a lot of trouble and the day was partly overcast.  Also another problem that I'll try to explain briefly.I took this to my 8 yr old nephews soccer game.  So the subjects are in constant motion.  I had the zoom all the way maxed to try and get some good close ups.  Each time you take a picture it is displayed on the viewfinder for a second and then the display returns to showing what you are looking at.  In that moment the subjects are constantly moving out of frame.  So the process for the day was1. try to find subjects on screen in sunlight2. follow subjects until taking a picture3. take a picture which is displayed on screen4. lose subjects while picture is displayed5. return to step one.In short, do not plan on using this camera at sporting events.  This is my first camera without a viewfinder.  If it had a viewfinder then a lot of this could have been ignored.  Live and learn.One of the primary reasons I got this camera was to use the Samsung Smart Camera app on my phone to remotely control it.  This does work and works well.  There is a significant delay so don't think you can use the phone display for overcoming the poor screen on the camera.  Also, this app does not work with taking video.  That was very disappointing.", "Date": "March 4, 2014"}, {"Title": "Picture quality less than expected", "Author": "Jill Nicholas", "ReviewID": "R2M8Z9I1VC44OE", "Overall": "2.0", "Content": "I was very disappointed with the picture quality from this camera.  Half of the pictures were blurry and it took forever to focus.  I honestly think the pictures taken with my cell phone were better.  I have bought several items from Amazon and this is the first one I've ever returned.", "Date": "December 29, 2013"}, {"Title": "great camera and great price", "Author": "Blair W. Williams", "ReviewID": "R1L46VKK35LL9A", "Overall": "4.0", "Content": "My only compaint is that this camera does not have an eyepiece for viewing.  You have to use the screen when pointing and shooting.  The screen is highly reflective, making it difficult to see what you are taking pictures of.  In whole, it is a great camera with more than enough features.  The zoom with image stabilization is another great feature.I bought 2 Samsungs from Amazon shortly before the Black Friday sales.  It would have been nice to get them at the cheaper price.", "Date": "December 6, 2013"}, {"Title": "Excellent camera", "Author": "Donna", "ReviewID": "R2UWGF4AVVFUZ7", "Overall": "5.0", "Content": "LOVE this cameraI was so excited to get it and it takes great pictureslove how it works and the results of the pictures that you takeeasy to use and love the white color", "Date": "November 14, 2013"}, {"Title": "Camera with all that You need", "Author": "Macarena", "ReviewID": "RNHL0R81QLJ2H", "Overall": "5.0", "Content": "Is an excellent product. Good price and takes beautiful Photos. Great wifi.A camera with all that You need! Take it!", "Date": "August 25, 2013"}, {"Title": "Great point and shoot camera very good value. Well done Samsung!", "Author": "Braddles \"Braddles\"", "ReviewID": "R3N1BAVS0O2WWW", "Overall": "5.0", "Content": "I read many of the reviews and have been extremely pleased with my camera purchase.  I have recommended this camera to my family and friends and some have purchased it.  I was very happy with what was included with the camera, not sure why someone did not get a battery, as one was included in the box, with the cables, etc.. I have used it many times and have never been disappointed, transferring photos to iphone, ipad, laptop and pc are very easy. All in all great quality shots, very user friendly, with may different photos options.  Well done, Samsung!", "Date": "January 2, 2014"}, {"Title": "Good, solid, point and shoot, with a few extras.", "Author": "R. Iverson \"Ron I\"", "ReviewID": "RM74JA0YYRQS1", "Overall": "4.0", "Content": "Quality pics and fairly good in medium low light. The combination of a 21X zoom and 16.3 MP sensor allow you to get pretty good resolution even on an enlargement. Nice, attractive design that fits comfortably in your hands. Downside is that even tho the wi-fi works, it is a little cumbersome. And video takes an extremely long time to transfer. Also, it's hard to remember that the flash has to be manually raised....doesn't extend upward automatically like most modern point and shoot cameras and even some DSLRs. But the flash is pretty sturdy once raised.....unlike many reviews complain of on the WB250.", "Date": "December 17, 2013"}, {"Title": "The instruction manual assumes a great deal of knowledge on the part of the buyer!", "Author": "Walter Hewitson", "ReviewID": "R2ZVC4BWRSVVX2", "Overall": "4.0", "Content": "I am certain that it is an excellent camera, but the \"getting started\" directions leave a lot to be desired.  I downloaded the full instruction manual and even that is difficult for me to comprehend.  I am not exactly stupid (I have a Phd in biology), but I am 80 years old.  While the camera is a smart WiFi digital camera, I guess I am not smart amout modern electronics and apparently I am not going to learn from the manual.  I shall use it and I expect to get good results.  Unfortunately, I'll be using only about 10% of the camera's capabilities.", "Date": "December 13, 2013"}, {"Title": "It's really good if you like to share your pics fast", "Author": "Manuela", "ReviewID": "R1PC0H4TBM0SJ0", "Overall": "5.0", "Content": "It met my expectation of a good camera not as big as professionals, but still good quality, perfect for travelling.", "Date": "October 25, 2013"}, {"Title": "Great camera!!", "Author": "Travis Birt", "ReviewID": "R3JE7U9W8DET6U", "Overall": "5.0", "Content": "Love this camera. Picture quality is good, though you have to be careful to stay still. People who are complaining about the picture quality are probably shaking the camera as they take pictures. This camera has a really wide field of view which allows you to capture more stuff in the frame. It take a bit of getting used to.The WiFi features of this camera rock!! The remote viewfinder is great for making it possible for everyone to be in the picture, and the ability to share pics instantly is wonderful. Also, the special settings for things like \"magic frame\" and \"waterfall\" are neat and give more opportunity for creativity.The zoom is good as long as you're zooming in on something far away. I've not had much success with zooming in on things that are relatively close (say within 3-20 feet). At that range it seems to have trouble focusing.Video quality is excellent, though be aware that the default for sound is muted (weird) so make sure to change that before taking any video.Using the flash is very strange as it doesn't pop up automatically. This is the only failure in the design of the camera.Overall, we are very pleased and would recommend it as an excellent point and shoot camera with lots of nice features.", "Date": "June 3, 2014"}, {"Title": "I love it..!", "Author": "Jaqueline Rico", "ReviewID": "R2ZHZEU43R8JFF", "Overall": "5.0", "Content": "I really love this camera is professional quality plus the comfort of a digital camera, and it's touch, that makes it easier", "Date": "May 14, 2014"}, {"Title": "Great camera except for battery consumption", "Author": "DP", "ReviewID": "R26QKSSQCIE26J", "Overall": "4.0", "Content": "This is a feature packed camera that takes great pix and provides wonderful quality in all modes.  It will make you look like a pro!  The only downside is the power consumption.  Be sure to turn off wifi when you don't need it and make sure you've got extra batteries if you're on a full day of shooting.", "Date": "May 3, 2014"}, {"Title": "So far .. so good ...", "Author": "Winolapn", "ReviewID": "R1F25309YXM1QD", "Overall": "4.0", "Content": "I haven't had time to use it much yet but the pictures I have taken have turned out well.  I would prefer the lens to close up.  Looks like it will be very easy to stick my finger through the soft closure and damage it.  Will be going to Alaska soon and should be able to give it a thorough testing.", "Date": "April 27, 2014"}, {"Title": "great product and value!", "Author": "Lee Van C. Cervantes", "ReviewID": "R35YXOL6Q9DBSK", "Overall": "5.0", "Content": "I'm loving this so far.  excellent features--smart mode, best face, wi-fi, and whole bunch more.  experimenting with it and will be taking it traveling!", "Date": "April 26, 2014"}, {"Title": "Samsung WB800F 16.3MP CMOS Smart WiFi Digital Camera with 21x Optical Zoom,...", "Author": "Mark Nguyen", "ReviewID": "RAED93S2HP423", "Overall": "5.0", "Content": "I love this Samsung camera with WiFi it easy to transfer image to the computer.I love this camera because it newer and more option to use.I will recommend to my friends and my family and I will buy 1 more but I will wait for on sale.", "Date": "April 24, 2014"}, {"Title": "first samsung camera i had- but for my wife", "Author": "eaa", "ReviewID": "R1S75UVVYQ7VKT", "Overall": "5.0", "Content": "bought this one because of its wifi capability to direct send pictures to Facebook and connect with samsung camera app on our galaxy tab as well. my wife was going to a deployment so she needed a camera for capturing her tour. so far when i was testing it it was working the way it was advertised.", "Date": "April 21, 2014"}, {"Title": "Instructions are incorrect", "Author": "M. rubin \"mrinaz\"", "ReviewID": "R37G1L1KWE5R8E", "Overall": "5.0", "Content": "A great camera but don't bother trying to connect to wifi with the published proceedure.  Call Tech support for instructions. The user guide on web is also wrong.The feature works well but getting it started is a mystery", "Date": "April 19, 2014"}, {"Title": "Good purchase, fair value.", "Author": "pmanning", "ReviewID": "R3W4BRQDKKAEMV", "Overall": "5.0", "Content": "Great camera, easy to use. We were especially impressed with the WiFi capability. If you remember what a dictionary looks like, picture that when you print off the owner/instruction manual at over 100 pages and a lot of pictures. Maybe a little better design of the manual would save a tree or two.", "Date": "April 19, 2014"}, {"Title": "GREAT CAMERA!", "Author": "Hanzel Sanchez \"CRCh\"", "ReviewID": "R1YV16QVTBYTFK", "Overall": "5.0", "Content": "I had seen the same camera somewhere else for a much higher price and decided to wait until I got this one, which is just perfect.", "Date": "April 16, 2014"}, {"Title": "powerfull & loaded", "Author": "catonine", "ReviewID": "R2IHG7BD04CHQ", "Overall": "5.0", "Content": "This camera although pricey, does it all.  It has so many features it has a large learning curve.  But once mastered this will do everything the big boys do and then some.  The battery life is good and the zoom is incredible.", "Date": "April 13, 2014"}, {"Title": "Just what I wanted", "Author": "Marie Miller \"Marie Miller\"", "ReviewID": "RSMXB25E9HP", "Overall": "5.0", "Content": "takes really nice pictures, and fast and the zoom is wonderful...And the color which is what I wanted (Red).  I highly recommend it...", "Date": "April 4, 2014"}, {"Title": "Great camera!", "Author": "Sarah Wagner", "ReviewID": "R1L2XIW5U24J44", "Overall": "5.0", "Content": "Lots of fun things to with this camera. Love the connection it WiFi Wish  it had a manual with it though.", "Date": "April 3, 2014"}, {"Title": "Good general use camera but with cautions", "Author": "C147", "ReviewID": "R2ELKH1IJH2HOE", "Overall": "3.0", "Content": "I have been a very loyal Panasonic Super ZOOM point-and–shot camera for the last 6-7 years. When I found this Samsung unit, I figured that I should give others a chance. After tried this camera few times since got it last October (2013), here is my review.The plus sides are,1. It took reasonably good pictures indoor and outdoor with sufficient light.2. Under the low light situation, it did not take that good a picture. Kind of little grainy.  This could be normal for all point-end-shoot units but this one seems more obvious than others.3. The camera is very feature rich and has very long zoom. The pictures are not super shape but acceptable. However, do not try to zoom all the way in when reviewing on the camera, most of times it is somewhat blurry when you do so.4. In addition, the touch screen control on this camera is unique and convenient. There are many features, which I have not had, chance to test it yet, the Wi-Fi sharing is one of the other reason I got this for. I will update the review when I do so.The cautions are,1. When uses this camera to shoot some sport and outdoor activities such as video family during hiking or skiing. The camera did not focus consistently while in the zoom shooting. It could start out with out of focus images or lost focus during the zoom shooting. I have not had any way to confirm what will make it out of focus on zoom. It seems random to me. My guess is the camera may not have fast enough processor to handle the zoom focusing while doing the video. Alternatively, this may be fixable by upgrading the firmware on the unit. Not sure how could it happen at all. Our three Panasonic cameras very rarely did that. May be Samsung can answer this one.2. The other annoying problem is the camera has very slow cycle time for taking pictures back to back. This slowness also exists while powering the camera up. Not sure this is due to the memory module I used (32 GB Class 10 SDHC) or just the processor is too slow (here we are again). I wish it could be fixed by some software upgrade. I am sure Samsung processor is not that bad.Overall, I rate this camera as a 3-star OK unit unless I can get the concerns above addressed. More later…", "Date": "March 24, 2014"}, {"Title": "great camera", "Author": "R Hall", "ReviewID": "R1XD4S3JW2B8ES", "Overall": "4.0", "Content": "I love this camera - except that the flash has to be up to work on automatic flash. The pictures are great.", "Date": "March 24, 2014"}, {"Title": "I absolutely love it", "Author": "nisuelli", "ReviewID": "R2XI8UZSCARJP8", "Overall": "5.0", "Content": "This is a great camera.  I love the quality of the pictures and its wireless capabilities.  I can't wait to take it to the islands.  I am looking forward to capturing beautiful memories trapped in time!  It is great quality for the price.", "Date": "March 20, 2014"}, {"Title": "great", "Author": "Tony L. Hann Jr.", "ReviewID": "R1UY5CQIF7S98I", "Overall": "5.0", "Content": "I had a much cheaper Samsung camera and loved it but switched it for a Nikon and the Nikon was not so great so I upgraded to This camera and love it", "Date": "March 13, 2014"}, {"Title": "If you want a RED camera this is NOT for you", "Author": "Amanda Ruiz", "ReviewID": "R2YVRCYSFDHHXF", "Overall": "4.0", "Content": "If you are looking for a red camera, I would look elsewhere.  The color is more pink.  Very disappointed in the color.  Other than that I really like the camera.  Setup was easy,  takes very clear pictures, and I had no issues linking it with my phone (S3).", "Date": "February 27, 2014"}, {"Title": "Great technology", "Author": "Marco Zavala", "ReviewID": "R14HB5064IDJOZ", "Overall": "5.0", "Content": "The camera is beautiful, it's quiet easy to use it, the technology that Samsung has is amazing, very low prices.", "Date": "February 21, 2014"}, {"Title": "Tiny camera, fast recycle, network connection", "Author": "Don Pedro II \"book lover\"", "ReviewID": "R119PY23NCPQGM", "Overall": "5.0", "Content": "This was an excellent camera for the price.  Small enough to fit in a pocket, good zoom, quick recycle, and automatic uploads to your home network (or wherever you choose).  I bought it as a gift. The recipient is thrilled!", "Date": "February 15, 2014"}, {"Title": "Gift", "Author": "LG Martin", "ReviewID": "R3AUJD5SOEI4VI", "Overall": "5.0", "Content": "a Gift for my daughter to replace the one stolen from her bag at the airport. Great product, very Satisfied customer", "Date": "February 12, 2014"}, {"Title": "Good camera for kids!", "Author": "Prad..The Gadget Man", "ReviewID": "RJ07BWO10XYSY", "Overall": "4.0", "Content": "Defenitely a camera you would buy for your kids, clarity is meh, but features are so awesome it will drive you insane to know there are so many features!", "Date": "February 2, 2014"}, {"Title": "Awesome camera!!", "Author": "bowd", "ReviewID": "R1MHGF3QTDUNEC", "Overall": "5.0", "Content": "I absulutely love this camera. The pictures are clear and I can immediately upload them. It's everything I expected and more.", "Date": "February 1, 2014"}, {"Title": "awesome", "Author": "Douglas Cook", "ReviewID": "RXQDXX2WPW7TO", "Overall": "5.0", "Content": "Love the zoom ability and all the settings for pictures and videos. Great photos and easy to use. The touchscreen option is awesome.", "Date": "January 5, 2014"}, {"Title": "Great close-ups", "Author": "Susan M", "ReviewID": "R26G5VJ24D6FQI", "Overall": "5.0", "Content": "Love the camera. Easy to use, clear close-ups. Birthday gift for my guy, who takes pics of everything, and he really enjoys it.", "Date": "December 31, 2013"}, {"Title": "Great camera!", "Author": "Jan K Thompson", "ReviewID": "R1I4L7C4KAU2L3", "Overall": "5.0", "Content": "I've only used it a few times, but so far I love it.  It is small enough to carry around and it takes great shots.  My favorite feature is that you can take pictures while shooting a movie!  You will want to purchase an extra battery.", "Date": "December 25, 2013"}, {"Title": "Great camera with an unusual flash", "Author": "Dan Shinn", "ReviewID": "RUC587NNHUG1O", "Overall": "4.0", "Content": "Almost the perfect point and shoot.  Other than having to engage the flash manually it works amazingly! Makes great memories!", "Date": "December 23, 2013"}, {"Title": "OK", "Author": "dean p. phypers", "ReviewID": "R2E4K1Y5LNL0M6", "Overall": "4.0", "Content": "OP MANUAL IN GERMAN AND SPANISH, NOT HELPFUL! CAMERA WORKS FINE IF I CAN FIGURE IT OUT, GETTING BABY HELP", "Date": "December 22, 2013"}, {"Title": "SLOW ZOOM IN RESPONSE. THE ROTATOR DIAL TOO EASILY CHANGES SHOOTING MODE", "Author": "winter 2014", "ReviewID": "R1ME5O4NQGYPOQ", "Overall": "3.0", "Content": "It is very easy to accidentally switch the rotator dial to some mode that will not allow you to take a picture.Zooming in takes forever and it's way too easy to miss the shot. From the time the camera is turned on, zoomed in, focused and the picture taken might pass 4 to 5 seconds and by then there might be nothing to take a picture of.", "Date": "January 4, 2014"}, {"Title": "NOT FOR ME", "Author": "Fred Brent", "ReviewID": "R1S25S7GH14CMB", "Overall": "1.0", "Content": "PICTURE QUALITY SO POOR THAT I RETURNED IT! I WOULD NOT RECOMMEND THIS CAMERA. ALL PICTURES TAKEN WERE FUZZY. I EVEN HAD OTHERS TRY IT.", "Date": "April 1, 2014"}, {"Title": "Still learning how to use all the features.", "Author": "mailman", "ReviewID": "R3OLMW4GA8BM3R", "Overall": "5.0", "Content": "I love this little camera. Especially the ability to sync it with my Samsung smart phone via the app. I take a picture, and it automatically transfers to my phone. I know they say smartphones are killing the market for point and shoot cameras, but this camera keeps things interesting. It's still more capable than a smartphone camera, and the price is right. No regrets buying this camera.", "Date": "January 1, 2014"}, {"Title": "Camera Is OK", "Author": "K. Schultz \"Baglady\"", "ReviewID": "R370GDHX8W71Z3", "Overall": "3.0", "Content": "I read all the reviews, I like it that I can sinc the camera,It takes OK pictures out side, but inside they are dark and there is a pause, before it will take the pictures, then most of the time the shot is lost. It fits in my purse. Thanks good close flash pictures. Not great but good. I like that I can control with my S3 sp the times is a nice feature.Con: It has a delay that causes you to lose the shot, kids and animals. The sinc is nice, But don't like that I have to do it manually each time. It says to link to wi-fi and set in settings I don't see the settings to do it. I don't like that you can only send 12 pictures at a time. If your hooked up why can't you send them all. Maybe this can be fixed in a software up date. I don't like that you have to pop up the flash. it should be auto. It freeze up a lot and I have to take out the battery. I dont like that I can't put my phone on it and have my phone get the pictures, like the instructions say.  I wish I would have bought the more expensive model from Verizon. That has the 4G. This camera is so-so.  I'm stuck with it so I will deal with it.", "Date": "December 30, 2013"}, {"Title": "Great Camera", "Author": "William Boyer", "ReviewID": "R24LOQT4Y69DU8", "Overall": "4.0", "Content": "This camera take great photos!  The WiFi is a feature that I was really looking for but, as it turns out, isn't as useful as I had imagined.  Google has is getting rid of picasa -- or moving it to \"photos\" (which is a Google+ app) and I assume this change has broken the camera's ability to upload to the defunct picasa.  I'd love a software update for the camera to correct this issue.  As it stands, I have to plug the camera into my computer, download the pics from it and then upload them to Flickr (could also upload to \"photos\") from the computer.I was able to transfer photos from the camera to my phone and then upload them from the phone, but that's a very awkward procedure.  I haven't tried uploading to skydrive or emailing them, so I cannot comment on those features.Again, the camera takes excellent photos and the zoom is great -- it's just that the WiFi features that could use some attention.", "Date": "December 17, 2013"}, {"Title": "Nice Camera!!", "Author": "Diana Heredia", "ReviewID": "R2QD3Z94109747", "Overall": "5.0", "Content": "So far I love this camera. Takes beautiful pictures. Years ago I had a Sony cybershot and I like THIS Samsung camera 100X more. The picture quality is great compared to the old camera I had. I would recommend this camera to anyone thinking of getting it.", "Date": "December 5, 2013"}, {"Title": "loved it and took it to europe", "Author": "harry \"confederate yankee\"", "ReviewID": "R2ZZI2L0AHFUKH", "Overall": "5.0", "Content": "wanted the wireless connectivity for our trip to Europe so we could send pics directly to facebook and email and it worked great in the hotels and hotspots we went to.  Amazed at the quality of the pics and also of the features, zoom, and adjustments allowed us to get great pics in a variety of lighting conditions, more expensive than a pocket camera but much more versatile. Alert does not come with an SD card installed you have to provide your own", "Date": "February 5, 2014"}, {"Title": "katty", "Author": "katty navarro", "ReviewID": "RW649RYXKOFKQ", "Overall": "1.0", "Content": "I get bad product, not recommended at all, did not arrive in good condition wi fi does not work. They want me to send it, but this digital camera is in Peru and do not give me solucion.No recommended at all .. do not give me solution to my problem", "Date": "March 14, 2014"}, {"Title": "Report on the WB800F", "Author": "claudia nava", "ReviewID": "RG6TC5H63UZ3C", "Overall": "1.0", "Content": "When you turn on the camera, the camera appears to turn on as a normal.  However, once the screen is displayed, you notice that the camera display screen is divided into four squares. The right, upper hand corner appears to have an internal crack. The upper left hand corner screen is blank. The bottom right hand corner screen is also blank. Only the bottom left hand corner works. For example, if you are trying to take a picture, you can only see the bottom left hand corner of the picture you are trying to take- the rest of the squares are blank.  Please see the picture attached of the camera screen display as evidence..  No physical damage was ever done to the camera on our behalf. It has not been dropped or wet. The camera is in the same condition as we received it. Since we received the camera, the camera screen display has not worked properly. Instead, it only looks as we described above.", "Date": "March 12, 2014"}, {"Title": "not new", "Author": "Ahmed Al jalaly", "ReviewID": "R2BY2Y056YY89K", "Overall": "1.0", "Content": "the box was open and the charger is not orginal one its repaleced with bad kind of charger . i take it like a gift to my mom . its the second time happen with me in amzon", "Date": "February 6, 2014"}, {"Title": "Beware does not come with a battery!!!!!!", "Author": "M. Dispoto \"SoccerRox1707\"", "ReviewID": "R14E0G9F7XLKMD", "Overall": "1.0", "Content": "Ordered this for my daughter for Christmas.  Opened it Christmas morning and guess what no battery!!!  Even though it shows that it does.  shame on amazon for not stating in large print when ordering that \"THIS ITEM DOES NOT COME WITH A BATTERY\".  Should have gone to Best Buy!", "Date": "December 25, 2013"}], "ProductInfo": {"Price": "$299.99", "Features": "21x Optical Zoom\nSMART features - Social Media Upload, E-mail, Direct Link, Mobile Link, PC Auto-backup, Remote Viewfinder, All share, Cloud Service\n1080p HD Video", "Name": "Samsung WB800F 16.3MP CMOS Smart WiFi Digital Camera with 21x Optical Zoom, 3.0\" Touch Screen LCD and 1080p HD Video (Black)", "ImgURL": "http://ecx.images-amazon.com/images/I/51f9i14ootL._SY300_.jpg", "ProductID": "B00BBFLZ4S"}}