{"Reviews": [{"Title": "This is the best pocket camera in the world right now and no one knows it.", "Author": "Gustav Chyba", "ReviewID": "R3RSJEPLMPNEF3", "Overall": "5.0", "Content": "I'm a pro photographer. And no, it doesn't take the same quality images as a full size DSLR.But it has an HDR function that is adjustable and takes the most amazing nature pictures at the mildest setting. Totally natural looking and filled in.No other camera has an adjustable HDR setting, they all produce HDR with artsy effects.It has a super high speed mode, that lets you take 30 pictures in one second, allowing you to capture that exact moment the kids hit the pool or the motorcycle.No other camera has this, they take at most 5 pictures per second. There's a Sony DSLR that takes 12 per second, but it's really expensive and big.And here may be the biggest feature of all: It has a feature called \"makeup\" which makes the faces of subjects look better than they would otherwise, like they've been touched up in Photoshop, and this effect is available in 12 steps. When women see how amazing they look after I've taken their picture they can't believe it.No other camera has this in camera.It's easy to use, and really well built. The only downside is that to use the flash (and you should almost always use the flash) you have to manually open the flash with a little button. It should pop up on it's own.", "Date": "April 20, 2013"}, {"Title": "Great pictures, easy to use, and easy to carry around!", "Author": "Teresa", "ReviewID": "R25O8AL8ZP3XW7", "Overall": "5.0", "Content": "This makes my 3rd Casio camera in the past 10 years. I recently purchased this Casio Ex-ZR700 because we were going on vacation & I thought it would be good to have a higher megapixel and quicker auto focus... I love this camera! It takes great pictures, has various easy to use settings, & it easily fits into my purse. The zoom is awesome, too!  It has GREAT zoom without having to change the lens.  I do have to push the button to pop up the flash, & sometimes I have to turn on the flash in some areas that I think might need more light. That was no big deal, because it takes amazing pictures in very little light, even indoors! Yes, I continue to stay a fan of Casio cameras!!!", "Date": "August 16, 2013"}, {"Title": "Wonderful camera!", "Author": "G. Roy", "ReviewID": "R3QGJM8H0GWUC3", "Overall": "5.0", "Content": "The EX ZR700 takes better than expected photos, movies, is easy to use, large zoom, pocketable and good looking. I'm a happy owner. This is my third Casio, V8, FH100, which couldn't swim and now its replacement the ZR700. Received the camera in only 3 days time from Japan. I am of the opinion that Casio makes better and more versatile pocket cameras than all other manufactures.", "Date": "November 13, 2013"}, {"Title": "Another \"secret\" Casio camera that is stellar in performance", "Author": "Unknown", "ReviewID": "RWOO2UFOLH076", "Overall": "5.0", "Content": "For some reason Casio does not get a great deal of renown for its superior digital cameras -- it is as if they are kept secret here in the U.S.This camera is one of the best point-and-shoot cameras you will find.  Pictures are clear and sharp.  Battery life is exceptional.  It charges and connects to a computer with a standard micro USB cable.  It is lightweight.  And the controls are straightforward.I've been using Casio digital cameras for nearly 10 years.  The cameras have always been good but they keep getting better.  The Casio EX-ZR700 camera continues the trend.", "Date": "December 15, 2013"}, {"Title": "No other camera does high speed video for slowing motion when watching, after lots of research CASIO Rocks !!!", "Author": "Douglas A. Doty", "ReviewID": "RRWVX3QHRLYMS", "Overall": "5.0", "Content": "Best Camera going, I use the high speed video and watch in slomo for sports, not many do this at the 240 FPS needed.  Super Duper Camera, I done many hours of research and this was the only logical answer, The Casio Exilim line of cameras.", "Date": "December 11, 2013"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B00B7D8FGK"}}