{"Reviews": [{"Title": "Right out of the box", "Author": "Kindle Customer", "ReviewID": "R3ITZH9H86C7N0", "Overall": "4.0", "Content": "Just used this camera straight out of the box on a 3 day trip to Disneyland.  Love how easy it was to use and the quality of the images was good.  Due to a lot of walking and going on rides, I only used the 18-55mm lens.  For most of the shots I did it was all I needed.  The battery lasted all 3.5 days of taking photos.  Can't wait to learn more about the rest of the features.  Liked how it felt in my hands.  Wish I would have given up my point and shoot a couple of years ago.  I was disappointed, however, that the filters that came with it didn't fit.", "Date": "February 21, 2013"}, {"Title": "Great Package Deal", "Author": "Anthony Tracey", "ReviewID": "R3SQE5TL4TPM76", "Overall": "5.0", "Content": "I purchased this camera for my wife about a month ago and couldn't be happier! She previously owned a Canon Rebel XS and was happy with it. This is a very nice upgrade! The camera features and quality is amazing for the price point. The telephoto lens is great too! Everything in this package is high quality from the SD card to the lenses and highly recommended.", "Date": "May 30, 2013"}, {"Title": "Nikon does it again!!!", "Author": "Lauren", "ReviewID": "R1RW91WPZT77GQ", "Overall": "5.0", "Content": "The Nikon D5200 is proving to be everything I hoped it would be.After reading a few online reviews on the D5200, it did sound like exactly what I wanted. It is.Everything I want to be in focus, IS.The metering is great; what I visually SEE is what I am getting. The photos have excellent depth; are not flat.The camera is quick; quick to focus; quick to shoot. I am capturing things I did not expect like birds resting, flying... my dog playing... all with exacting detail.And then there is the video capabilities; my dog playing, running, chasing stays in focus for the duration.Love the info and menu system; when in doubt, I hit the '?' icon and it explains. I'm trying new effects, settings, formats and becoming much more creative in the process!LOVE this camera - and it has been years since I have been able to say that.Kudos, Nikon. This one ROCKS and at a relatively affordable price!i am so happy I found this bundle deal because the 55-300vr is a must have , the other items in this kit are great too like the ML3 remote . The seller was top notch and had his in my hands 48 hours from the order .", "Date": "February 22, 2013"}, {"Title": "Nikon 5200", "Author": "Frank Wilshusen", "ReviewID": "R4S3N4KIEQ0LZ", "Overall": "5.0", "Content": "Turn around on order was fast, camera was better than I expected, camera bag and tripod were just gimmes, but nicely there were a few filters that were a surprise", "Date": "June 29, 2013"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B00B1V5T4E"}}