{"Reviews": [{"Title": "My review of the Pentax MX-1", "Author": "TheGonz", "ReviewID": "R1E70WFMMZ47BW", "Overall": "4.0", "Content": "The more time I spend with my MX-1, the more I love it.I like the image quality, its ISO range (100-12,800), the fast 1.8-2.5 lens, and the DUAL sensor Shake Reduction that allows me to take shots in low light or slow speeds, without blurring. Also remember it has the best ISO performance \"for under $500\" according to Dxomark ([...]I've found the tiltable screen to be a great feature for street photography, as I can tilt it and make like I'm reviewing or fiddling with the buttons, and make the shot surreptitiously without disturbing people ;)The filters included (B&W;, Sepia, Toy Camera, Retro, Extract Color, Fish Eye, Miniature, etc.) are fun to use (up to 20 filters can be combined and applied to the same image according to the user manual).It also has a RAW development feature but I prefer to do it in my laptop.HDR has worked very good at night and in landscapes and three modes are available: Standard, Strong 1, and Strong 2.The 1cm macro is wonderful and I've enjoyed it shooting flowers and insects with very good results.I take one star off for a few reasons:1) the MX-1 can't take filters and I would like to use a polarizing, and permanently put an UV to protect the lens.2) I find it annoying when I turn on the camera when the cap is on and I get a \"Please confirm the lens cap is removed\" message, and the camera then turns off. Maybe it can be corrected with a new firmware release. UPDATE: I NOTICED THAT THIS FEATURE CAN PREVENT THE LENS FROM ACCIDENTALLY EXTENDING WHEN INSIDE A CASE OR BAG! so it can be a good thing after all...3) A hot shoe for a flash or external mic would've been a good addition.I really hope Pentax releases a filter adapter (if possible), a good protector case, and more optional accessories for this camera.P.S. By the way, I don't know why up to date (March 14th 2013), the MX-1 is not mentioned in Pentax's japanese website! maybe Japan is not the target of this camera??? (Update: On April 9th, MX-1 appeared on the mentioned website)--Update March 24th: Saving files when shooting in RAW is slow and a \"Data being recorded\" message appears in the screen and the camera freezes until the process finishes. I've made some tests with class 6 and class 10 cards and I've found that the fastest the card the better the writing speed -as one can expect- but even with a very fast card (Sandisk Pro 95mb/s), the message still appears. So that makes me think that the camera's algorithm is the culprit.Also there is a \"Deleting\" message that appears every time I delete a photo and it takes like a second to disappear from the screen.I'm sure a firmware update can change this and make the camera faster.--Update April 20th: 1) The MX-1 is really good for street photography! (I've done some more shots in public parks and the camera reacted fast focusing and taking the shot)2) In bright sunny days photos have a blue cast that I think is because of the UV rays.3) Some third-party lens adapters have appeared for the MX-1. Also, a few leather half camera cases are available now.--Update May 6th: I video recorded a full rock concert (stopping after each song) and the battery (previously full charged) drained in a approximately 1 1/2 hours. It wasn't an issue as I took a couple of spare batteries with me. The recording was made in full HD, and the image & sound quality turned out very good.", "Date": "March 14, 2013"}, {"Title": "Would really rate this 4.5. Good camera, with cavaets", "Author": "Adrian", "ReviewID": "R8CFL77IUPTQR", "Overall": "4.0", "Content": "I must admit upfront that I'm a bit of a Pentax fanboy these days, although I am quite aware of the shortcomings in each of their cameras. Nevertheless, I wasn't going to buy the MX-1 originally, as I had a dslr and a megazoom camera (K-5 and X-5). When I saw a guy advertise one for cheap however, (he wanted funds to buy a waterproof camera for his trip in 2 weeks) I couldn't resist and now have an as new MX-1 for only 2/3 the price of a new one.When I look at the MX-1, I see it being compared to it's direct competitors in the enthusiast compact cameras - eg Canon s110, Olympus ZX2, Sony RX100 etc., and compared within Pentax itself to the Q, Q10, and newly announced Q7- which has the same sensor size as the MX-1. I'll touch on each.Pros:------ in good light, or in poorer light where you can place it on a stable base and adjust shutter speeds, or aperture, the MX-1 gives images in jpeg which are much closer to the aps-c sensor in my dslr than I expected. I haven't tested the iso limits, but up to 800 it was not bad at all.- the f1.8-2.5 across it's zoom range really makes a difference. For some cameras like the Canon s110 and Sony RX100, the f stop starts big, but quickly gives an aperture that's no different than any other compact camera. I took the MX-1 to a wedding banquet and the lighting was well down, except on stage and along the central path where the bride and groom walk in. The faster shutter speed from a wider aperture was noticeable, and I'm glad to have a much less fuzzy handheld photo, and even did it twice in hi burst mode too.- ergonomics. Despite being the largest and heaviest of it's direct competitors, it's easy to grip, and tilting LCD screen gives it a distinct edge in flexibility. It's one reason I never looked at the s110 (fixed screen- although much smaller, easier to carry). Ergonomics are good, buttons easy to push, nothing loose. This compares to the rear \"ring\" control of the Olympus ZX2 which I felt was much too loose and sensitive, easy to make accidental presses. I have had enough of that type of poor ergonomics with the Canon SX50 superzoom- when you want to take a pic, then your finger brushes the ring and you've missed your shot.- Bokeh- aka soft and gentle out of focus background. You can see the result of having a quality wide open lens. Good stuff.- Battery life. Took 200 photos and the battery gauge showed still 75% full.- Attractive retro look. Not as fanciful as Fujifilm's style, so a bit of a personal preference here.- Pentax has one of those lens caps which blocks the lens extending out when you turn it on. I was given one of those third party automatic lens covers- the front splits into thirds, like 3 pieces of pie, when the lens is turned on and pushes forward. This thrid party lens cover adds about 4mm to the thickness of the camera, but I use it.Cons:------ Won't save photos as quickly as a dslr., the burst rate is nowhere near the k-5 dslr or some other enthusiast cameras. I'm using a Class 10 SD card, and it's not saving as fast as I think it could- While the brass makes for good marketing, I'd rather keep the paint from wearing off and have some lighter metal and shave off 100grams from the weight.- Despite being enthusiast, it lacks some manual controls, or ease of reaching some functions, than you'd expect, such as white balance. The Pentax X-5, a compact sensor super zoom at half the price of the MX-1 has more features.- With the release of the Q7, which is a mirrorless system unique to Pentax, but with a sensor size the same as the MX-1, it has given itself a direct competitor. However, I believe the Q system lacks enough lenses to challenge the MX-1 yet. The MX-1 has a zoom range with wide open aperture in a complete camera. The Q system only has a single prime (45mmf1.9 in 35mm equiv) which is remotely similar. The Q is much lighter, and has the handy shortcut dial on the front, but to me doesnt offer much advantage, besides being able to attach dslr lenses to it via an adaptor.- Only as wide as 28mm- would have been nice to have a wider lens, say 24 or 22mm.So compared to it's competitors, it depends on whether you want- style, ergonomics, size, pocketablility, weight, aperture wideness, cost, tilting LCD. For me, MX-1 has wheat I want- familiar system, wide open lens, good bokeh, tilting LCD, attractive looks, ergonomics.I can't say if the MX-1 is the one for you, but for me, it's one I can carry around and I can use for low light areas and evening/night time outings.Hope this review is helpful to you.Update Sept 16th 2013=====================I recently travelled and brought this along as my night camera. It didn't let me down. The wide open lens allowed me to take photos of almost anything in the city, as long as there was some light. I also changed the white balance to tungsten to avoid the yellow from dominating the photos. With such an awesome lens, it brings home the fact that the sensor is only 1/1'7. When I pixel peeped (please forgive me for being anal), I could see noise, and artefacts in outlines after zooming in. This is partly due to sensor size, and the fact that it's at night/lack of light. Still, it is far far better to get a photo at a good shutter speed by using a wide open fast sharp lens, than having a crappy photo. The bokeh remains smooth, creamy and you can see starbursts at lights- headlights, streetlights, etc. I should also say that I only view pics on computer screen at home, or upload on internet, so size doesn't really matter.If I were to make a final whinge, it is about the Pentax lens cap. The camera is very stylish and retro. The lens cap is just a flat slice of plastic. If you look hard, you can see the word Pentax imprinted on it. Let's compare that to the Olympus lens cap for the OM-D EM-5- it's got a shiny chrome circular outline and the wording is also like shiny brushed aluminium. That's the sort of quality Pentax should show off and convey. I'm proud of my MX-1 dammit! Don't leave the last 5% off and cover this beauty of a lens with a black piece of ubiquitous plastic!The MX-1 remains a keeper. :)", "Date": "June 18, 2013"}, {"Title": "Gorgeous looking camera with superb macro abilities", "Author": "MyKeyReviews", "ReviewID": "RAJEZWHSVZ4PF", "Overall": "4.0", "Content": "<!--\n\nfunction fp_resizePlayerSpace(nsPrefix,w,h)\n{\t\n  try {\t\n    var ifrm = parent.document.getElementById(nsPrefix + \"movieFrameID\");\n    if (ifrm) {\t\n        var h2 = h + 35;\n        ifrm.style.height = h2;\n      }\n    } catch(err) {\n \n    } \n\n\n  if (h > 0) {\n      document.getElementById(nsPrefix + \"clipDiv\").style.height=h+\"px\";\n      document.getElementById(nsPrefix + \"videoPlaceholder\").style.height=h+\"px\";\n  }\n  else {\n      document.getElementById(nsPrefix + \"clipDiv\").style.height=\"\";\n      document.getElementById(nsPrefix + \"videoPlaceholder\").style.height=\"\";\n  }\n  document.getElementById(nsPrefix + \"flashcontent\").style.height=\"100%\";\n}\n\nfunction fp_rewriteDiv(nsPrefix,divName,html)\n{\t\n    document.getElementById(nsPrefix + divName).innerHTML=html;\n}\n\nfunction embeddingPopup(nsPrefix)\n{\n  alert(\"placeholder function for embedding code\");\n}\n-->\n\n\n<!--\n\nfunction cv_mo33E1BOAN514MDembeddingPopup(){\t\nalert(\"Embedding code will be displayed here.\");\n}\n\n-->\n\n\n\n\n\n\n\n\n\n<!--\nfunction cv_mo33E1BOAN514MDrefresh_preplay() {\n\ndocument.getElementById(\"cv_mo33E1BOAN514MDchiDiv\").innerHTML = document.getElementById(\"cv_mo33E1BOAN514MDhiddenPre\").innerHTML;\n};\ncv_mo33E1BOAN514MDrefresh_preplay();\n\n-->\n\n\n\n\n\n\n        // <![CDATA[\n\nvar cv_mo33E1BOAN514MDso;\t   \n\n\nfunction cv_mo33E1BOAN514MDloadSwf_Core(swfLocation, swfWidth, swfHeight, flashVersion, bgColor, swfParams, flashParams, embedAttributes) {\n\n  try {\n      cv_mo33E1BOAN514MDso = new SWFObject(swfLocation, \"cv_mo33E1BOAN514MDAMPlayerProd\", swfWidth, swfHeight, flashVersion, bgColor);\t   \n\n      for (var v in swfParams) {\n        cv_mo33E1BOAN514MDso.addVariable(v, encodeURIComponent(swfParams[v]));\n      }\n      for (var v in flashParams) {\n        cv_mo33E1BOAN514MDso.addParam(v, flashParams[v]);\n      }\n      for (var v in embedAttributes) {\n        cv_mo33E1BOAN514MDso.setAttribute(v, embedAttributes[v]);\n      }\n\n      cv_mo33E1BOAN514MDso.addVariable(\"swfEmbedTime\", new Date().getTime());\n\n      var agt = navigator.userAgent;\n       \n      var reFirefox = new RegExp(\"firefox/\", \"i\");\n      var regx = agt.split(reFirefox);\n      var ffVersion = 8;\n      if (regx[1]) {\n          var pts = regx[1].split(/[.]/);\n          ffVersion = parseFloat(pts[0] + \".\" + pts[1]);\n      }\n      var minorVersion = parseFloat(navigator.ap);\n      if ((navigator.appVersion.indexOf(\"Mac\")!=-1) || (ffVersion < 1.5)) {\n          cv_mo33E1BOAN514MDso.setAttribute(\"height\", swfHeight);\n          cv_mo33E1BOAN514MDso.setAttribute(\"width\", swfWidth);\n          cv_mo33E1BOAN514MDso.addVariable(\"oldFirefox\", \"1\");\t     \n      }\n\n      if (cv_mo33E1BOAN514MDso.write(\"cv_mo33E1BOAN514MDflashcontent\")) {\n          fp_resizePlayerSpace('cv_mo33E1BOAN514MD', \n                               320, \n                               283);\n      }\n      else {\n          var nsPrefix = 'cv_mo33E1BOAN514MD';\n\n          fp_resizePlayerSpace(nsPrefix, 0, 0);\n          fp_rewriteDiv(nsPrefix, \"flashcontent\", '<br/>To view this video download <a target=\"_blank\" href=\"http://www.macromedia.com/go/getflashplayer\" target=\"_top\">Flash Player</a> (version 9.0.115 or higher)');\n      }\n  } catch(err) {\n      fp_resizePlayerSpace('cv_mo33E1BOAN514MD', 0, 0);\n  }\n  return false;\n}\n\n\n\nfunction _cv_mo33E1BOAN514MDloadSwf(movieID, playerVersion) {\n    var swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/20120510035744301/AMPlayer._V148501545_.swf\";\n    var swfWidth = \"320\";\n    var swfHeight = \"100%\";\n    var flashVersion = \"9.0.115\";\n    var bgColor = \"#FFFFFF\";\n\n    var swfParams = {};\n    var flashParams = {};\n    var embedAttributes = {};\n    swfParams.amazonPort = \"80\";\n    swfParams.allowFullScreen = \"true\";\n    swfParams.telemetrySubPageType = \"VideoReview\";\n    swfParams.nsPrefix = \"cv_mo33E1BOAN514MD\";\n    swfParams.locale = \"en_US\";\n    swfParams.logUrl = \"gp/mpd/l\";\n    swfParams.canResize = \"1\";\n    swfParams.autoPlay = \"1\";\n    swfParams.sessionId = \"000-0000000-0000000\";\n    swfParams.marketplaceID = \"ATVPDKIKX0DER\";\n    swfParams.salign = \"LT\";\n    swfParams.preset = \"detail\";\n    swfParams.mediaObjectId = \"m6NIBBWY9NY1I\";\n    swfParams.autoPlayTimer = \"\";\n    swfParams.mediaObjectIDList = \"m6NIBBWY9NY1I\";\n    swfParams.playIsUserGenerated = \"1\";\n    swfParams.enableShare = \"0\";\n    swfParams.permUrl = \"gp/mpd/permalink\";\n    swfParams.telemetryPageTypeID = \"RAJEZWHSVZ4PF\";\n    swfParams.xmlUrl = \"http://www.amazon.com/gp/mpd/getplaylist-v2/m6NIBBWY9NY1I/000-0000000-0000000\";\n    swfParams.amazonServer = \"www.amazon.com\";\n    swfParams.scale = \"noscale\";\n    flashParams.allowFullScreen = \"true\";\n    flashParams.salign = \"LT\";\n    flashParams.bgcolor = \"#FFFFFF\";\n    flashParams.allowScriptAccess = \"always\";\n    flashParams.quality = \"high\";\n    flashParams.wmode = \"transparent\";\n    embedAttributes.title = \"Flash Player\";\n\n    if (movieID){\n      if (playerVersion == '3'){\n        swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/20120510035744301/AMPlayer._V148501545_.swf\";\n        swfParams.mediaObjectIDList = movieID;\n      } else {\n        swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/legacy/20101014901/AMPlayerProd._V197491872_.swf\";\n      }\n      swfParams.xmlUrl = \"http://www.amazon.com/gp/mpd/getplaylist-v2/\" + movieID + \"/000-0000000-0000000\";\n      flashParams.wmode = \"transparent\";\n      swfParams.autoPlay = \"1\";\n    }\n\n    if (document.getElementById('cv_mo33E1BOAN514MDduration')) {\n      document.getElementById('cv_mo33E1BOAN514MDduration').style.display='none';\n    }\n    cv_mo33E1BOAN514MDloadSwf_Core(swfLocation, swfWidth, swfHeight, flashVersion, bgColor, swfParams, flashParams, embedAttributes);\n\n  return false;\n}\n\nfunction cv_mo33E1BOAN514MDloadSwf(movieID, playerVersion) {\n   return _cv_mo33E1BOAN514MDloadSwf(movieID, playerVersion);\n}\n\n\n\t\n\t\t// ]]>\n\t\n\n<!--\n\nfunction cv_mo33E1BOAN514MDnewHeight(h)\n{\t\n    fp_resizePlayerSpace('cv_mo33E1BOAN514MD', 0, h);\n}\n\nfunction cv_mo33E1BOAN514MDresetPlayer(w,h,bw,cc) {\n  cv_mo33E1BOAN514MDnewHeight(h);\n\n  cv_mo33E1BOAN514MDso.addVariable(\"resetBandwidth\", bw);\n  cv_mo33E1BOAN514MDso.addVariable(\"cacheCode\", cc);\n  cv_mo33E1BOAN514MDso.setAttribute(\"height\", h);\n  cv_mo33E1BOAN514MDso.setAttribute(\"width\", w);\n  cv_mo33E1BOAN514MDso.write(\"cv_mo33E1BOAN514MDflashcontent\");\n}\n\n-->\n\n\n\n\n\n\n\n\nvar cv_mo33E1BOAN514MDRollOverImg = new Image();\ncv_mo33E1BOAN514MDRollOverImg.src = \"http://ecx.images-amazon.com/images/I/71BkgTFUjjS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play-active,BottomLeft,130,-12_CR0,0,0,0_.png\";\n\nvar cv_mo33E1BOAN514MDpreplay = document.getElementById('cv_mo33E1BOAN514MDpreplayImageId');\nif (cv_mo33E1BOAN514MDpreplay) {\n  cv_mo33E1BOAN514MDpreplay.onmouseover = function() {\n    cv_mo33E1BOAN514MDpreplay.src = \"http://ecx.images-amazon.com/images/I/71BkgTFUjjS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play-active,BottomLeft,130,-12_CR0,0,0,0_.png\";\n  }\n  cv_mo33E1BOAN514MDpreplay.onmouseout = function() {\n    cv_mo33E1BOAN514MDpreplay.src = \"http://ecx.images-amazon.com/images/I/71BkgTFUjjS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play,BottomLeft,130,-12_CR0,0,0,0_.png\";\n  }\n  \n  \n  var node = cv_mo33E1BOAN514MDpreplay.parentNode;\n\n  var cv_mo33E1BOAN514MDcurrentClick = node.onclick;\n  node.onclick = function () {\n    var head = document.getElementsByTagName(\"head\");\n    if (head[0]) { \n      var logTag = document.createElement('script');\n      logTag.type = \"text/javascript\";\n      logTag.src = \"/gp/customer-media/du/log.html?ie=UTF8&p=CustomerImage&s=CustomerVideoPlay\";\n      head[0].appendChild(logTag);\n    }\n\n    if (cv_mo33E1BOAN514MDcurrentClick) {\n      return cv_mo33E1BOAN514MDcurrentClick();\n    }\n  }\n}\n\n\n\n\n Length:: 5:48 Mins♦ Brief ♦I have to say I was in complete awe when I first unwrapped the camera, it has a wonderful sleek retro look and is very comfortable to hold.The camera does feel a little heavy in weight, but has a great amount of grip along the body to compensate.One of my favourite external features is the screen, you can extend it outwards and then tilt it if needed, I found this extremely useful when taking macro shots at ground level.♦ Navigation ♦The camera has a mode dial located up the top, this allows you to quickly change from the modes most suitable for point & shoot situations such as 'AUTO PICTURE' & 'SCENE' modes, to the more advanced settings like the 'Manual' mode.The button layout on the camera I found to be very well placed and everything has a clear label/icon so you know what your clicking on.As for the menu, it may not look like someone has designed it in Microsoft paint, however it's clear and due to the tab system, makes it easy to find the settings you want.♦ Picture Quality ♦Honestly, the overall image quality I think is superb, although there are some situations it doesn't cope so well in, it generally does well:☑ Outdoors/Daytime; Results have been great in such conditions, however be careful when pointing near the direction of the sun as it's highly likely you will get lens flare.☑ Beach/Sea; Would recommend using the 'SCENE' mode and select 'Surf & Snow', this will really bring out the colours, alternatively use the 'Blue Sky' for a vivid blue sky.☑ Macro shots; To guarantee a crisp macro shot, press the flower icon located on the back of the camera and choose \"Macro\" for close-up shoots, or \"1cm Macro\" to succeed in focus insanely close to the subject, I was honestly blown away at how well this camera can focus at such close range, with stunning results.☑ Flash; There are a lot of flash modes to choose from such as 'auto', 'off', 'on', 'auto + red-eye', 'on + red-eye', 'slow-speed sync' and more. I normally use auto, which when used has been the perfect amount and doesn't drown out the subject. #NOTE: Flash isn't really suitable for close-up shots.☑ Indoors; Although I've had a few dud shots, most have been good results. For even better results indoors, I would recommend putting the flash on auto.☒ Night scenic shots; Considering this camera boasts a low-light performance, I wanted to see what it could do.  I tried the camera on a lovely moon-lit night that had a good amount of light lighting up the sky whilst using a tripod.  The initial results on the cameras screen seemed promising, but when I had viewed the photo on my computer, there was a lot of noise on the photo.  At the same time I attempted the same shot on my Sony RX100 (a rival competitor in these range of cameras) whilst using the same settings, the RX100 had little to no visible noise in the photos.♦ Final Opinion ♦The MX-1 by Pentax is probably the nicest looking camera I've seen in a long time, it's comfortable to hold and is easy to navigate.Whilst it may struggle in some lower-lighting conditions, the overall performance is extremely good, especially when it comes to macro shots, the results really are out of this world.", "Date": "April 25, 2013"}, {"Title": "nearly perfect pro-sumer point-and-shoot", "Author": "tomahagne \"...\"", "ReviewID": "RESWQAG1EMKZ8", "Overall": "5.0", "Content": "I've been an amateur photographer for decades. Printed a few times here and there. I think I fit squarely in the pro-sumer category: neither a professional, nor simply a consumer.I've never had a camera I love THIS much. I've used my share of SLRs and I still use them for specialized tasks, but for everything else, I take this.I'll start with the most obvious and shallow: it's gorgeous! I love the look of old cameras. I don't care for modern cameras or the neo-retro look. I like OLD. I like rangefinders. I miss using my old Konica C35. Etc. This fits the bill almost perfectly. Aside from the zoom lens up front, it's pretty convincing. Even more so with the lens cap on. It looks thoroughly modern from the rear, but it's a trade-off I will accept for the functionality. The LCD screen is big and clear. I wish the screen tilted both ways or not at all. I can take very low shots because the screen tilts up, but I'd also like to to able to take overhead shots by tilting the screen down. I don't do very much of either, and I've learned to take those kinds of shots blind anyway, so I would have forgone all tilt, to shave a quarter inch off the back.I love the optics. The lenses are fast, clear, bright, and colorful. Coupled with the quick processing and autofocus, I rarely have to think twice about what I'm shooting. I leave the cap on and the camera off between uses. It turns on in a flash and the cap comes off with a sweep of my thumb. The lens starts at its widest zoom. I can catch my subjects in less than a second. I can crop and adjust afterwards on the computer. I hardly ever miss a shot.Oh and the macro! No switches or menus to fiddle with. Get close and let it focus.The weight and bulk are just about perfect. You don't want a camera that's too light or small. Sure, it can be a pain when you're hiking through a rainforest or walking around a city. It doesn't fit in most pants pockets, so you'll need to wear it around your neck or under an arm. But a light and/or small camera is difficult to hold steady. This fits securely in my hands (I wear XL gloves) and I wouldn't trade an ounce of weight on this camera for anything! Though, as I said, I would have knocked a quarter inch off the depth by ditching the tilting screen.I rarely need to mess with the settings. The camera does all the work I used to have to do in my head. I just trust it will capture the shot. This leaves me free to think more about subject, composition, and lighting. But for the control freaks, and I don't mean that negatively, you can manually control everything on the camera.I'm going to ignore all the special effects because I do that on my computer. I don't need it on my camera. For those who like that sort of thing, and I can see the appeal, other reviewers have covered it well.The one and only flaw on this is the flash. The flash itself is an afterthought. You won't need it often, thanks to the brilliant lens, but when you do, it'll be barely adequate. It has been successful an hour before sundown without the flash. Once the sun is gone, though, the flash just doesn't cut it unless you like photos of your friends standing in front of complete darkness. Actually, that could work pretty well for a scary Halloween shot. I would have preferred to sacrifice the flash altogether for a hot shoe, but then again, that'd add undesirable bulk.BOTTOM LINE: This is THE camera to bring along for just about EVERYTHING. It's honestly easier to mention the things it's not good for: very distant and/or very dark subjects. The zoom only goes to 4x, but the images are so sharp, you'll be able to blow it up on your computer. But I wouldn't count on anything past the equivalent of 8x. For dark subjects, where you would need a flash, you can make do with the on-board flash. It's better than nothing. But in the end, though I may WANT to change a few things, there's nothing I NEED to. It's just about perfect. I'll save the SLR for birding, sports, and nighttime festivities. Oh that sounds risqué.", "Date": "November 3, 2013"}, {"Title": "Pentax MX-1", "Author": "azog", "ReviewID": "R1DWHJYAHRY4G8", "Overall": "5.0", "Content": "I'm what I like to consider somewhere between a \"consumer\" and an \"enthusiast\" (not a \"prosumer\", as much as I detest that word). I want a bit more than a generic point-n-shoot camera, but a full blown DSLR is unnecessary. Something that has a few tweaks for various environments is nice. I had a Fuji X-Pro1, and while I loved it, it was just too much camera for my personal needs and returned it. The only other real contender at the moment was the Sony RX-100, but at a steeper price in a less aesthetic package. I find that the Pentax MX-1 fits nicely with what I would like in a camera.For starters is the visual appearance. It is a handsome camera. It looks like what a camera should look like, without all that hideous bulk of a SLR. One of the apparent hype points is the brass upper and lower caps. I'm not sure weighed that into my consideration, because the hype revolved more around the \"brassing\" which occurs over time, the wearing of the paint, revealing the natural metal underneath. Besides the \"brassing\", the brass gives a nice weight to the camera. It fits very well in my hands. Not too heavy, not too light, it just feels right. It is wrapped with a textured faux leather grip that also makes it easier to hold. No worry that it is going to slip out of my hands.The buttons are placed fairly conveniently in a logical layout. The power button is actually a push on/push off switch, which may be something to be aware of, that I will accidentally turn it on without realizing it and drain the battery. The menus are minimalist, almost starkly so. Being rather bare-bones, but do you really need pretty pictures to find where to change various settings like file format, or camera time?The rear screen is big and bright, and hinged in a way that you can rotate it 90 degrees upwards or downwards and make it easier to take pictures without need to hold the camera directly in front of you. This is the first time I've owned a camera with a rotating screen, so it'll take some time to get used to it. There is also no viewfinder, nor is there even accommodation for one, as there is no hot-shoe. This means there is no means for external flash, viewfinder, or other accessories.I do have some concern is with retractable lens, but that concern is not unique to this particular camera, just the mechanism in general. I have another camera with a retractable lens, but I was able to attach a lens tube, which adds some protection to the lens at the cost of adding some additional bulk. It's a trade-off I chose, and currently I am unaware if any lens tube/hood attachments for this particular camera. Another benefit to the lens hood is that it allowed filters to be attached. I have a ExpoDisc white balance filter which I like to use, because I find manually setting WB with the ExpoDisc usually out-performs the automatic (or pre-programmed) white balance settings. Without an adapter, I am unable to use this WB filter.There is what seems to be knurled ring flush against the body on the lens, which might imply that you could add a filter adapter. But there are also very visible screws that go thru this ring. You can see these screws on the product pictures, from the side views. Perhaps you could remove the screws and remove the knurled ring to see if there is a threaded mount, but I'm not personally willing to try it. With my luck, the whole lens will fall out and invalidate any warranty.Considering the needs which I have for a camera, I set the camera to save to 9mb JPEG rather than RAW. I did play with RAW saving, and it is very (VERY) slow to save RAW. Why is this? It's not RAW+JPEG. Since there's no processing, one would imagine it would be faster to save as RAW. When I say slow, I mean like counting \"one two three\" slow, with a visible progress bar on the screen. I am saving to a SDHC SanDisk Extreme Pro 32GB, so I seriously doubt that the excessive time is related to a slow SD card. Perhaps they'll address it with a firmware fix, but I also notice there are no new firmwares on the Pentax site at all... Hopefully they'll not let this camera languish into oblivion.Because I prefer to save in JPEG and my post-processing is nil-to-none, I don't really need to use the included SilkyPix software. I did load it and played around with it, but I am ambivalent to the whole thing. I suspect anyone who does professional post-processing will use a more robust product anyway.Since I am nowhere near expert, I won't cover things like ISO speeds, and whatnot, so consider these things which mainly stand out to me. You'll find more technical on the web, and I'm surprised there aren't many reviews here on Amazon yet. But in short, I am very happy with the camera, and have no regrets buying it. If I could rate half-stars, I probably knock off a half-star and post my review as 4.5, but that is only due to the apparent non-capacity to add external filters. But that feature is so minimal, and everything else considered, I do consider it as 5-stars.Added on April 26 2013: I found what may be a possible lens tube/filter adapter for the MX-1. Since it's not relevant to the actual product at hand, I'll add a comment to my review.", "Date": "March 18, 2013"}, {"Title": "At current prices, this camera is a real bargain.", "Author": "bisjack", "ReviewID": "R1EBCNMKVSEHV9", "Overall": "4.0", "Content": "I am a real Pentax camera fan.  I own a number  of Pentax DSLR's (among other brands) and have just placed an order with Amazon for the new K-3.  The recent price drop on the MX-1 caught my attention and I ordered one to use as a carry-often street camera.  A few days ago my new MX-1 was delivered.  Since then I've been evaluating it and have concluded that this is a great camera.  I've compared the photos from this camera to photos from the Canon G15 which is quite similar in technical characteristics.  With similar subject matter and similar camera settings I've concluded that the MX-1 photos are slightly better than those from the G15.  This was particularly noticeable in the background bokeh.Of course this camera has its limitations such as the 12 megapixel sensor which is not going to allow large blowups without obvious pixelation.  But for everyday use this camera is very capable.  The tilt screen is very useful for street photography and the mass of the camera which some reviewers consider a detriment I find to be reassuring.  This camera is solid.  Its size and mass give me confidence.  It doesn't feel plasticy like other cameras of this genre and the styling is attractive.I won't add more since the other reviews have said most of what has to be said about this camera.  In closing I'll just say that for the money this is a real bargain.", "Date": "February 15, 2014"}, {"Title": "Solid Enthusiast Compact with Unique Features", "Author": "D. Warnecke", "ReviewID": "R2IW0XMGPBP4EK", "Overall": "4.0", "Content": "Anyone from the budding amateur photographer to a seasoned professional has a need for a capable, discreet compact camera.  There are times and places where it just isn't appropriate to take along thousands of dollars worth of gear and lenses and for these situations, a compact excels.Enter the Pentax MX-1.  I was interested in seeing how this camera performs compared to the Pentax Q I bought a year ago.  I picked up both of these cameras at fire sale prices and have spent some time comparing them.  Despite being compact cameras from the same manufacturer, there are some striking differences.BUILD QUALITYThe MX-1 has top and bottom plates made from solid brass, painted either silver or black (my model is black).  If you tend to bang your camera around a lot, the paint will wear off to reveal the nice shiny brass underneath.  You have to wonder though - this amount of wear would likely crack the LCD, jam the lens mechanism or inflict other untold horrors on the camera long before you achieve the intended \"weathered\" look.That said, the camera is solid for the most part.  Apart from the brass top and bottom plates, the body is made from solid-feeling plastic.  The body has nice tight seams and the USB/HDMI cover flap is a model of solidity.  The grip is very grippy and the moving bits like the flash mechanism and handy tilting LCD operate with precision.  The top dials, on the other hand, are a let down.  They are plastic and have a bit of play in them.  A far cry from the machined Fujifilm X10/X20 dials, for example.For comparison's sake, the Q has overall better build quality, with a full magnesium body and tighter-feeling controls.SHOOTING EXPERIENCEThis is my first camera with a tilting LCD and I've found myself using it a great deal.  The proverbial cherry-on-top is the pair of electronic levels that allow you to true the horizon even when your camera is held up high or down low in awkward positions while comfortably viewing the tilting LCD.  The 920k resolution is a welcome step up from the Q's 460k panel, and the brightness and contrast of the panel is better as well.Operational speeds are quick.  Start up is faster than the Q, commendable considering that the MX-1 has to extend the wonderfully bright 28-112mm equiv. f/1.8-2.5 lens.  Yes, RAW write times aren't especially fast but they aren't so slow that they ruin the experience.  I'm using a SanDisk Extreme 32GB 45 MB/s card.The menu layout will be familiar to those who have used Pentax in the past.  Menus are very legible and well laid out but have a very retro look to them.  The Q menu layout has a good deal more customization available... more color profiles, assignable green button, option to save last JPEG as RAW, quick zoom in playback, focus peaking and other features that are just flat-out MIA on the MX-1.  Disappointing.The MX-1 still has some unique features, however.  Interval movies and interval still shooting are available and well-implemented - helped by the MX-1's noticeable battery life advantage vs. the Q.  The selectable ND filter can even be set to Auto.  Very handy on outdoor hikes where lighting conditions can change rapidly.IMAGE QUALITYHere is where the benefits of the MX-1 larger sensor vs. the Q become apparent.  Both cameras shoot 12 megapixels at 4:3 but the MX-1 files have a good deal more clarity and detail.  Color transitions are smoother and shooting RAW reveals a good deal of highlight headroom.  A sky can look completely white and blown-out at the default exposure and after a quick teak of the highlight slider in Lightroom, blue sky and clouds appear.  The Q did not have this much latitude.  The MX-1's RAW files are so pliable that I very rarely feel the need to use the HDR mode.I am disappointed by the JPEG processing that this camera does.  Noise reduction and sharpening are aggressive and leave some crunchy chromatic artifacts behind.  The Q handles this processing more gracefully, albeit with less detail.  These artifacts are only especially apparent at 100% view and won't likely be an issue for non-poster-sized prints, but I still make a point to shoot RAW when I can.The lens is fast and sharp - a great all-rounder that allows you to keep the ISO level way down.  The image stabilization is very effective as well.  With steady hands I've been able to get a sharp shot at 6/10ths of a second.  The zoom motor is smooth and quiet and autofocus is quick in good light and quick enough in low light.  An \"Infinity\" focus preset is very handy for long exposure astrophotography and selecting manual focus calls up a very handy distance scale.WRAP-UPThis camera has a bit of everything wrapped in a nice-looking package.  The fast lens, capable sensor and tilting high-res LCD combine to form a generally pleasant shooting experience.  It is a shame that Pentax-Ricoh isn't treating this camera with the same love that they have shown the Q, with its various firmware updates and refinements.  Still, especially if you are a RAW shooter, the MX-1 is hard to pass up at these prices.", "Date": "February 10, 2014"}, {"Title": "Despite some awkward design flaws...a very competent and capable camera", "Author": "S. Vogt", "ReviewID": "R3HX0K6FG1H4WT", "Overall": "4.0", "Content": "The Pentax MX-1 is a perfect example of a camera that was dismissed before anyone really had a chance to shoot with it. It's not perfect and there are some flaws in the design but overall it's an excellent camera which is responsive, with a fairly intuitive menu system, and provides excellent image quality considering its sensor size and price.As mentioned, this camera's image quality is excellent. Colors are accurate and punchy, with good lens sharpness and detail capture. ISO performance is not class-leading but is about on par with its peers. In other words, things start getting pretty sloppy at ISO1600 and further deteriorate from there. It shares the same Sony sensor with the Olympus XZ-2 and Nikon P7700/7800...so its not surprising that the ISO performance is similar between the three cameras. The good news about the ISO is that the camera employs that excellent F1.8-2.5 4x lens found on the Olympus XZ series cameras & since it's such a fast lens you may never have to pick a high ISO to shoot with when in manual mode. RAW files use the Adobe DNG format which is universally compatible. I found the RAW files excellent to work with, especially when it comes to recovering blown out highlights. The camera overexposes a little, but that sort of exposure behavior is pretty typical for enthusiast comacts. Luckily, like other enthusiast compacts, you have a manual exposure compensation dial on the top of the camera.I was generally very pleased with the Autofocus performance on this camera, even in low light. There has been some complaints about the RAW write times, but using a 45MB/sec SanDisk SD card, I found only a very brief delay at times writing to card. Which is something that I experienced on the P7700 as well. Fast SD cards are relatively cheap these days, so it's worthwhile to spend the extra $20 or so to get one for this camera.Another complaint is that the menu system looks dated. I guess that's true but the menu is otherwise very well laid out and easy to use. I think most folks would be willing to forgive a dated looking menu system if it's easy to navigate around.Overall build quality is good but I am not fond of the cheap-feeling plastic dials on top. They work alright, but for as much boasting as Pentax has done about about the brass top and bottom, you would think they would use something higher-quality for the dials. The camera feels a little awkward to shoot with at first but you get used to it after shooting with it for a little while. I think it could benefit from some sort of grip of front, but the textured surface ultimately makes it feel secure in your hand. The control layout on the camera is very straight-forward, and changing settings is very easy despite not including a second control dial. One critical area that Pentax got right on this camera is the LCD, excellent to use even in bright sunlight (when the settings are adjusted accordingly). The camera has a lot of neat features for still shooting, such as vertical and horizontal horizon correction. Battery life is also excellent.Pentax has created a respectable first entry in the enthusiast compact field and it high reccommended for folks who want still want decent image quality and an excellent still shooting feature set, but don't want to plunk down $750 for the Sony RX100 II.", "Date": "February 10, 2013"}, {"Title": "A great all-arounder", "Author": "Wii Wack", "ReviewID": "R27GIOCFU7IJBH", "Overall": "5.0", "Content": "I'm very impressed with where sensor tech has gone in general and very impressed with the sensor in the Mx-1 in particular. And it could be the Pentax processor doing a great job as well in how it handles the info from the sensor. From the quality pics I've taken, it seems that they've matched the lens to sensor quite nicely. I don't usually go above 1600 ISO and the photos are clean and crisp at this mark.The tilting LCD is great and while there is no touchscreen, it's no deal breaker for me. I've got fat fingers anyway so it would probably be an exercise in frustration trying to work a touchscreen in cramped space. It looks like the ring around the lens is moveable but it is not. I actually like controlling aperture from a command dial on the back so it doesn't bother me. Can't go wrong with f1.8-f2.5 at full tele...very useable. The shot to shot times are decent for JPEG and RAW. A little slower in RAW but i'm used to slower RAW write times in my Sigma DP2s.This tool is efficient in its useability, and allows for quick street photography. Dials are in the right place and have a good feel to them. If i'm going from place to place and one subject happens to be in macro range, this tool will actually automatically switch to macro mode. This is great when you're in process (artistically) and forget to change modes. Also, the built in ND filter, when on auto mode, will kick in when needed...this is great and allows you to focus on getting that shot, especially when the timing is urgent. The hyper program mode is just genius. When in Program mode, you just move the command dial to quickly change aperture or shutter speed, and when you want to reset to Program mode settings just press green button. I like efficiency, i like it very much.Lastly, the build quality is just really solid and a comfortable camera to hold...and behold. Thank you, Pentax.", "Date": "May 6, 2013"}, {"Title": "Good general purpose camera", "Author": "A. Kim", "ReviewID": "RPHIHG5AUQLII", "Overall": "4.0", "Content": "This is very good camera for the price.  It is not DSLR camera nor is it cheap compact camera.  The style remind you of the retro camera of yesteryear which is more of range finder film camera.I suppose Pentax's target audience is older people who might have nostalgic feeling and who would appreciate the above quality build (brass) of this camera and picture quality.  It does not have the latest zoom (paltry 4x optical plus 2x digital) but it does have sensor that is bigger than compact digital but smaller than DSLR.External control and viewing menu via LCD is fairly straightforward.  Play around in consultation with provided manual and you will get a feel for it in short order.I'm not a serious photographer so I mostly use the auto feature of the camera to take photos.  In an area with good light and even indoor shots, I was very pleased at the way camera's internal program picking the right setting for pleasing pictures.Definitely happy with this purchase.", "Date": "November 20, 2013"}, {"Title": "You gotta love Pentax: brass on a modern camera?!?", "Author": "Nathan D Jedinak", "ReviewID": "R351BQ926NXJJ0", "Overall": "3.0", "Content": "I'm a recent fan of Pentax cameras, having within the last year purchased my first two from the brand (a Q and the much maligned but excellent K-01).  I like the fact that Pentax is a bit quirky, with their own style and way of building cameras.  You need look no further than the fact Pentax included brass top and bottom plates for this modern digital camera, harkening back to the late, great film cameras of old.  Being a not-so-youngster myself, I have some of those film cameras, and a little brass showing beneath paint reminds me of all the nice memories I have made while using the camera.  I believe that's exactly what Pentax was after here, and I really like the sentiment, especially in today's throw-away newer-is-better society.The question is, though: would you keep this camera long enough to wear through the paint, exposing that lovely brass?  Or was this just a chic move by the marketing team of Pentax?The answer isn't simple, unfortunately.  Certainly, the image quality of the camera is \"good enough\" for the vast majority of common photographic pursuits.  We are living in good times, and \"digital\" has (IMO) finally caught up with where the average point-and-shoot film camera left us after many decades of innovation.  I'd be willing to say that if you are a typical photographer who never prints larger than 11x14 or so, wants to grow your photographic skills but doesn't have a specific pursuit that this camera won't handle well (you will know this already), and doesn't have any specific notion that a camera should operate in a particular manner, this could very well be your \"everything\" camera for enough years that you will wear the paint off the brass.However, as a photography enthusiast with many years of film (and digital) under my belt, I was left a bit confused by the MX-1 as the body made promises I didn't feel the camera kept.  The retro styling suggests that this camera will handle and flow like an old film camera; in my admittedly short exposure to the MX-1 I didn't find this to be the case.  Although the interface and user experience was good, it felt decidedly \"modern\" to me, which was jarring in the face of the very retro styling.  Looking at the camera, I was expecting something like a Fuji X10, X100, or XPro 1, but in operation this was more like an Olympus XZ-1 or XZ-2 than a Fuji X10.  For me, unlike the aforementioned Fuji's, it didn't \"flow\" as well.  Additionally, the effort put into the styling and brass plates made me think this was an enthusiast's special, but I was a little perplexed as there are fewer options for customization than the Q and K01.  This left the camera feeling a bit less like the enthusiast camera it seems to be positioned as.  Why \"dumb it down\" comapred to the other Pentax cameras?  It was a but puzzling, and like the juxtaposition of old and modern, during the time I had the camera I was perpexed as to who exactly this camera was marketed to.That said, when I finally viewed the images on screen I found the photo quality VERY good.  Using Lightroom 4.4 to convert the RAW files, I was very impressed with the resolution at base ISO, displaying a crisp, colorful image with excellent contrast, even in harsh lighting.  Dynamic range was also quite good, particularly when pulled and pushed a bit from RAW.  With respect to image quality, it is a notable step above older high-end compacts I have had experience with such as the Canon G9, Ricoh GRD-IV, as well as Pentax's own Q.  At high ISO (>=1600), it was notably better than the Q, the GRD-IV, and also the brand-new and otherwise excellent Fuji X20.  It matches or bests the Olympus XZ-1 in good light, and while that camera falls apart above ISO400, the MX-1 holds up quite well.  I don't have my Sony RX100 any more to compare, but I was fine using the MX-1 around ISO1600 as the grain had a nice fine, tight pattern to it, and detail was retained quite well. With the fast lens, a good image stabilization system, and ISO1600, I'd suggest you can successfully use this camera in any light you care to photograph in.The MX-1 also has some nice features: the tilting screen is handy at times, and the display itself is very smooth with excellent color, brightness, and tonal gradations (several orders of magnitude better than the Q!).  The exposure compensation wheel, popular on throwback cameras right now, is quite helpful and easy to access.  The battery life also seemed quite good, although I didn't have it long enough to fully judge battery capacity, I think it's enough for a nice day of shooting as you travel, etc.  I also liked the lens; I believe it is shared with the Olympus XZ-1 and XZ-2, and although we all would like bespoke lenses on our cameras (makes you feel \"special\" somehow!), as far as compact camera lenses go, this one is worth sharing between manufacturers.  You can somewhat play with Depth of Field, and bokeh is smoother than expected, even besting the X20 in certain circumstances.  It's a bit soft in the corners at wide angle and wide open, but stop down a little for landscapes and you won't notice.  Although it doesn't necessarily have the \"character\" of some vintage and modern lenses, that will actually be a plus in the minds of many.So that's where we're left, then: a compact that by \"looks\" promises retro charm, character, and charisma, yet manages to be fully modern in implementation and feel.  Will you wear that paint off to expose the pretty brass underneath?  That depends upon whether you view this mashup of \"old\" and \"new\" as positive, or negative.  If you want \"new\" with a little retro charm, then by all means, this is as good of a camera as many highly-touted models on the market.  The price is also quite aggressive, competing with models costing quite a bit more.  However, if you desire a retro approach in form AND function, with a more old-school photographer-centric (vs technology-centric) flow, and perhaps a bit more \"charm and character\" in your images, then I would suggest taking a pass on the MX-1.", "Date": "May 2, 2013"}, {"Title": "Solid camera", "Author": "Richard J. \"Richard J.\"", "ReviewID": "R966YWTWDNU9M", "Overall": "5.0", "Content": "I am a Pentax fan, currently own a K-5 IIs but have also owned a K-5, K-7 and a K-X with several prime LTD lenses, so it was relatively easy for me to decide what P&S; camera to buy. The original price tag of $499 was way to high for me to justify a purchase but when I saw it for $252 (prime) I grabbed it. The reason for the MX-1 is their have far to many times I wished I had a camera with me but lugging a DSLR plus lenses was a bit too much especially since I'm in my 60's. Besides who actually carries this kind of gear when you're just going to the store? Also I wanted this when scouting. A small camera is far to convenient and the MX-1 produces some very fine images. Keep in mind it is a small sensor and if you print you may be able to get a decent 8X10 but don't push it. If you upload to a site such as FLICKR this will be more than adequate.  The menus are very similar to other Pentax cameras though very limited but very useful. As for the build, very solid. Not your atypical plastic fantastic. Heavier than most but at about 13 oz but it won't wear you down. Not a truly pocket-able camera so a case is required unless you have very large poctets. Fits well inside my parka but would probably be a problem in cargo pants or shorts. Viewing in the sun even with the LCD brightness set to max is better than most but carry a loupe or shade it. In low light, turn it down a bit. At normal setting it's very bright. Battery life seems to be fairly decent considering the LCD is used for focusing and setting exposure. I suppose it could be better if you choose to use Auto Pict or scene modes which is ok since it is a P&S; but if you a new to this use the Av, Tv or M settings to learn what they do. Perhaps you may want to upgrade eventually. Plenty of stuff online to help with this. I've only taken about 100 pics with this after having it for three days and I am very pleased with the results. Regardless buy a spare battery or two. The Wasabi batteries from Blue Nook (seller) are excellent a far less expensive than the Pentax version.  At this price I highly recommend it as long as you don't mind not having a view finder and hot shoe, the latter over rated, in my opinion, for small camera besides you can always trigger an off camera flash. The flash does have red eye reduction, slow speed sync, slow speed sync with red eye as well as trailing  curtain sync. All very useful. There is also an auto mode plus flash on and off. Be prepared to use to use the exposure compensation dial, the flash is rated at GN 13? I read somewhere, it's not in the manual, but with a small sensor it has a tendency to over expose when using it manually, on auto it seems to worked fairly well.  As with all cameras this one has it's own short comings, as I have mentioned, but at the current price point it's a great buy. The quality of the RAW images are really excellent for a small sensor plus a fast telephoto lens that is very sharp corner to corner with no vignetting, at least none that I have noticed, CA's are also well controlled.", "Date": "January 30, 2014"}, {"Title": "Hits the sweet spot", "Author": "Tom Jackson", "ReviewID": "R2SMCSAI6TDY3B", "Overall": "5.0", "Content": "I have big pockets, so no problem! I love the feel of this camera.  But above all after checking dpreview and some youtube videos, on amazing price and image quality alone I had to prefer this unsung welterweight champ over the tiny SONY and the versatile Canon G15.  The image quality in RAW especially is superb, and surprisingly, the Silkypix software included gives you extensive control over color, sharpness, dynamic range (more than Lightroom for example).  Some complain that it is slow to read images, and I wouldn't recommend it for dynamic sports shooting etc.  Some miss a viewfinder, and on the very bright snowy day last week I had a bit of problem with the screen.  But in 99% of my shooting, its fine, and the flexible tilt gives me compositional versatility I really appreciate. I may have an update after trying it out at parties in lower  light -- one reason I got this on the promise of its f 1.8 lens.  It has aggressive anti-noise in-camera settings, especially compared to the Canon, but you can always sharpen in Raw.  I think it has the same SONY sensor as the more expensive Olympus I was also considering.  And if you like the retro styling, go for it!", "Date": "January 30, 2014"}, {"Title": "Sturdy, quality camera", "Author": "JB \"Music Critic\"", "ReviewID": "R2K7MU3PHYMDVM", "Overall": "4.0", "Content": "Takes fantastic photos.  Just wish it were a little smaller.  Also, sometimes I end up having to up the saturation just a little after importing RAW or JPEG.  Still, you could fix this by changing the internal saturation settings manually.  Good camera, very well constructed.  I've dropped it once or twice so far on my trip to Thailand and it has been A-OK.", "Date": "November 10, 2013"}, {"Title": "Fantastic Compact Performance Camera!", "Author": "ABW", "ReviewID": "R1KTAE1V1X6URK", "Overall": "5.0", "Content": "I love this camera! Everything about it is brilliant and it blends perfectly into the rest of my pretentious retro and pseudo-retro camera collection. This camera is quite heavy and much more bulky than other compact performance camera's but that is to be expected with the brass body components and only feels more retro-thentic. There is a discernible lag when shooting in .RAW but the average prosumer will be shooting in .JPG anyways, so no big deal.My order was fulfilled by Beach Camera and arrived 3 days ahead of schedule, which was great. BUT there was no bubble wrap of any protective measure between the factory box and the shipping box - so the camera got tossed around a lot more during shipping than I would normally find acceptable.", "Date": "April 15, 2014"}, {"Title": "I love I love I love this camera", "Author": "PDNY", "ReviewID": "R4R3OOFYM5FKP", "Overall": "5.0", "Content": "Do not be fooled by it's awkward appearance, this thing means business. I can't believe I am writing another review (hate typing), but it's worth writing about this one. I own an exhaustingly long list of cameras, from m43 (ep2,gx7) x10 and other Pentaxes (Q, k01, k5iis). Much like the K01, it's an odd bird. But make no mistake, Pentax always means business. If you have doubts between this camera and the \"Q\", the mx1 is better. Not as much fun, but I find it of much higher clarity and latitude on the raw files. I have no desire to use my x10 anymore, a camera which I thought was unsurpassable a couple years ago (read my review). The photos produced by the mx are organic, forgiving and the jpegs are formidable. The recent discounts are stupid great. It's weird, it's a brick and I always want to leave home withe Q. But whenever I take the mx1 with me, I always thank myself. I remember going to Paris on my honeymoon and telling my wife that I can spot the tourists easily: the wife holds the map and the \"dude\" the canikons with giant telephotos. As if? This is the camera that I will take on that next trip. Ok, maybe the GX7 too. But this is the very closest thing IMO.5/1/14:  Going on a trip to Italy and considering taking the MX1 as the ONLY camera. I know this is far fetched, considering I own a few M43 cameras and lenses, plus K5 and limiteds. But I really can't be dealing with space issues. scary, but this might be it!", "Date": "April 1, 2014"}, {"Title": "Probably the best P&S; camera I've ever handled", "Author": "I. Clements", "ReviewID": "R30N2QOW22821P", "Overall": "5.0", "Content": "There is a lot of P&S; cameras out there so a lot of this is personal opinion on my use of this particular model.  I'd heard a lot about the Macro capability of this camera and as I shoot a good deal of Macro work I thought I'd give it a try.  I've had Canon G series cameras and Panasonic LX5/7 models as well as Olympus XZs.  For what I shoot the Pentax MX beats them all.The Macro capability is nothing short of amazing on a camera of this type.  You literally can get down to 1cm from the object and focusing stays razor sharp. For regular shooting the fast f1.8 lens really helps, especially indoors where I've found I rarely have to use the flash.The camera has an incredibly solid feel and is somewhat larger than other P&S; in this class.  I personally love it.  I found most of the other cameras I tried to be just too small.  They seem really intended for one handed use, which is fine but they are just too small and fiddly. The Pentax MX fits my hand nicely and I can use it comfortably with one or both hands.Perhaps my one wish would be for a hot shoe so I could trigger a remote flash.I know some mentioned that the write speed is somewhat slower. I have noted this on a couple of occasions but its nothing crippling.Overall I think this one is a keeper for me. Just getting started using it so may update more later.", "Date": "March 22, 2014"}, {"Title": "Pentax lovers - get one before they are gone.", "Author": "S. J. Simmer", "ReviewID": "R27UGU80DXIZPF", "Overall": "5.0", "Content": "This was delivered just yesterday and after just a few test shots I know I am going to enjoy this camera.  Pentax users will find the menus and controls have a comfortable familiarity.  The retro-classic look is really something to love. Lens optics appear to be tack sharp.  When I want to leave the DSLR at home, I have confidence that the MX-1 can fill in as a competent back-up.  It shoots in RAW+ mode, which is a big plus for me.For an advanced point-and-shoot with a 1/1.7\" backlit CMOS, it is also a bargain at this time.", "Date": "February 12, 2014"}, {"Title": "underrated", "Author": "Amazon Customer", "ReviewID": "R3PUHV3ZC0QSO", "Overall": "5.0", "Content": "I have had a lot of camera's and this one has become my favorite. Easy to navigate, great effects, fun fast and slow-mo video. The heft is comforting and feels substantial, I have a WX300 for my pocket and A57 for the more professional shots but this one fits the bill as a great walking around camera.", "Date": "January 2, 2014"}, {"Title": "A Pentax Fan of Old", "Author": "Edward", "ReviewID": "RKETC3SC7UUZ6", "Overall": "4.0", "Content": "I have been an avid Pentax user since the 1980's and have grown thru a K1000, ME Super and SF1N. I enjoy using this camera, it's looks and feel and real lens cap! The weight is not an issue for me, it is pat of the retro-esque nature of the experience of using this camera. Battery life seems stellar and Macro and Super Macro modes open up new ways to see the details in the world around.What I can't come to terms with is the write speed of images to the memory card. I will have to experiment with memory cards and camera settings but I fear there will be no fix for the slow write speed... Very interested in others experience with write speeds.If it is a retro camera you are after, this one should top your list for sure!", "Date": "May 30, 2014"}, {"Title": "WOW", "Author": "C Townsend", "ReviewID": "RFYXZC5EGKJMQ", "Overall": "5.0", "Content": "I bought this camera earlier this month as a graduation present for my fiance, and she absolutely loves it. She used to have a Ricoh GX100 that she was very fond of and she feels that this camera is better. We also have a couple other point and shoot cameras around the house that were in the $150-$200 price range, and this camera blows them away. All the pictures we've taken have turned out very good, macro pictures in particular look great. We haven't found anything about this camera that we dislike. It's difficult to imagine any other camera delivering this much quality for such a reasonable price.", "Date": "May 28, 2014"}, {"Title": "What a steal!", "Author": "Sophia T", "ReviewID": "R2LLD93AFPEQB", "Overall": "5.0", "Content": "At this price, it is simply the best P&S; you can get. Others have mentioned about the AWB issue. And I agree that if you change the setting from bright to natural, it solved 80% of the problem. The other 20% is just personal preference nothing that can't be fixed with a quick PS adjustment.Other than the above limitation, this sturdy camera delivers crisp images, quick focus, great indoor low light shots.  I am very happy with this purchase.", "Date": "May 19, 2014"}, {"Title": "Very Sharp Pictures!", "Author": "Greg", "ReviewID": "R1VRV182HAUTP", "Overall": "5.0", "Content": "Woot had it on sale for 200.00 dollars needed Sharper photos I have a Sony DSC-HX9V Don't laugh, Plus I don't have alot of money, so This is coming from someone who looks for outstanding Value. MX-1 is Great!!!", "Date": "May 18, 2014"}, {"Title": "Love it for all the right reasons", "Author": "Michael W. Wegener", "ReviewID": "R3CLL5ETNF2VPQ", "Overall": "5.0", "Content": "All the reviews on this camera are about the wonderful pictures it takes - and it does. In its Auto mode it is already a lot more photography savvy as I ever will be.But what made me so happy about this purchase is the fit and finish of this instrument. In a world where everything you buy feels more chincy than the item you are replacing there is seldom real happiness anymore for me.Not with this Pentax. It is like stepping back in time when your dollar actually bought you something to be proud of and cherish.It feels like buying a camera back in 1965. Positive clicks and stops and a housing made from brass. It's just marvelous.Best purchase I made in a long time.", "Date": "May 16, 2014"}, {"Title": "Great throw-back", "Author": "Jen", "ReviewID": "R3VDCTTADMT00M", "Overall": "5.0", "Content": "This is a great steal! Higher ISO tends to be grainy with the smaller sensor (no more than any other small sensor camera), but this camera’s stability allows me to use 100 ISO handheld in low light almost all the time. The lens is really sharp (I’m not a pixel peeper by nature). The RAW to JPEG engine is really good! And the negatives about the write times to memory card (I use Eye-fi) are normal, in my opinion; I don’t rely on burst-mode in any of my cameras, as I ‘d rather take the time to compose in-between each shot. There is no viewfinder, but the tilt-screen adds a nice dimension. The weight and quirks of this camera fill the need when I miss holding my old Minolta XG-M film camera. The hardest issue I have is being patient for the brass to wear through on the top and bottom plates.", "Date": "May 15, 2014"}, {"Title": "Great nostalgic design, great quality photos for the low price.", "Author": "Ronin67", "ReviewID": "R3W1GUAXEXEXB6", "Overall": "5.0", "Content": "Pentax has a real winner with the MX-1.  A very solid built with a great retro design.  Very pleased with everything overall!", "Date": "May 5, 2014"}, {"Title": "A great camera for the price", "Author": "Heru Rishardana", "ReviewID": "R15JZUMWPYX4X9", "Overall": "4.0", "Content": "Totally a bargain for this one. Functions well. Looks rigid and strong and I like the retro styling. The raw files are surprisingly easy to be corrected in Lightroom without sacrificing image quality. I like the dynamic range considering it is a small sensor but there's plenty of data can be recovered in the shadow area. The macro mode is just so easy and fun to use. All in all a good purchase.", "Date": "April 14, 2014"}, {"Title": "Works for me", "Author": "S S", "ReviewID": "R104GVJ2WMPOH5", "Overall": "4.0", "Content": "I was looking for something that was nicer than my old point and shoot, but don't need a professional dSLR and didn't want to spend the money for one. I found a good deal on the Pentax MX-1, so I got it. And overall, I like it a lot.Pros:Great image quality, especially considering the  relatively small sensor sizeThe macro mode is OUTSTANDINGAuto focus works great, but camera also has a manual modeSturdy buildLots of different \"Scene\" modes that work wellSmall enough that you don't feel terribly burdened by it like you would a larger cameraDoes well in low light situationsYou can use it to shoot in RAW!Cons:Good luck taking photos inside under tungsten lighting in auto mode - never seen anything come out so inexplicably yellow (and you can't change the white balance in auto mode). Something is screwed up with this.Pretty slow write times, even when shooting in JPEGYou're stuck with this flash, there's no way to attach a hot shoe. This shouldn't be a problem for me as I don't know if I would get any flash accessories anyway, but it is sad knowing that I can't get one if I change my mind.Overall, if you're like me want to take nice pictures but don't need something more professional or more expensive that tires your arms out because it's so heavy,  go for this!", "Date": "March 15, 2014"}, {"Title": "Simply outstanding", "Author": "siafu", "ReviewID": "R1HZWK4B001Y6K", "Overall": "5.0", "Content": "The MX-1's technical details and measurable performance have been documented and discussed at great length by others more competent to do so than I. I'm an enthusiast moving away from a Canon G15 because even though it took great photos I found it unintuitive and unfriendly, I never felt comfortable with it. After looking around and remembering my terrific experience with an Asahi Pentax Spotmatic in a past life, I decided to give the MX-1 a try.We bonded immediately, it felt right. I got the all black model and it's beautiful. I like the design, aesthetics, proportions, weight (there's a lot of it) and smooth functionality. The camera feels solid, well-built and with good ergonomics, I find it more comfortable to handle and easier to use than the G15. The MX-1 is a heavy brick of a camera but its weight makes it easier to hold steadily. It's too large and heavy for a shirt pocket, but can easily be carried in a jacket or pants cargo pocket if you don't mind it banging against your thigh. This isn't terribly important, but I'm not too crazy about the original box because it unfolds origami-like along one side so it's not as sturdy as it could be and not easy to repack.I don't think the MX-1 is for everyone, you'll love or hate it. As far as I know it's been discontinued so you might be able to pick it up at a good price, as I did. Before you decide if it's the camera for you, research it, read about it, look at the user reviews, go online and read the professional reviews, watch the videos. Me? I love it.FIRST IMPRESSIONS: The battery charged fully in 2.5 hours. That's not bad, but the AC charger's power cord is thick and bulky. The camera turns on quickly but don't forget to take off the lens cap. It turns off a bit slower after taking a photo. Initial setup was fast and easy. The foldout LCD screen is terrific and seems sharper than the G15's. I find the MX-1's on-screen menus more user-friendly and intuitive, they give better feedback. Focusing is accurate, fast and smooth, macro mode works much better and is easier than the G15's. I shot some photos using the Green and Auto Pict modes and really liked the results, but I haven't tried the other shooting modes yet. When compared to the G15 the MX-1 seems an altogether friendlier camera that's better suited to me in spite of its shortcomings. Many reviewers have said nasty things about the lens cap which must be manually removed before turning on the camera. An excellent alternative is Rainbowimaging's Self Retaining Auto Open Close lens cap which I've reviewed separately.UPDATE: After extensive use in extremely strong desert glare and bright sun with dark shadows, dazzling ocean reflections, strong wind and blowing sand, high tropical humidity and downpours. I usually carried the MX-1 in my daypack's front pocket but also stashed it in my baggy canvas shorts pocket where it sometimes got banged around and once oops, got slightly wet. Fortunately, because of it's simple no-frills body it was easy to dry and keep clean. The MX-1 is as sturdy and tough as it looks. It has great battery life and takes fantastic photos with accurate focusing and light metering, and excellent, passionate color rendering. Incredible fantastic superlative macro mode. I've already said it's not the fastest camera around but that's ok (I drive an '84 Vanagon). The interface is simpler and more intuitive than the G15's. Remember the Rainbowimaging lens cap I mentioned earlier? Get one - it works great and is much sturdier than I originally thought.", "Date": "March 3, 2014"}, {"Title": "great camera", "Author": "Adam Selene \"Adam\"", "ReviewID": "R1D8RY9TAEM6QW", "Overall": "5.0", "Content": "does almost everything, has super computer software.  cool looking retro 70s style look.  produces great images.  very satisfied wold buy it again.", "Date": "February 26, 2014"}, {"Title": "Pentax MX-1", "Author": "M. Wong \"Halloween Costumer\"", "ReviewID": "R3FKRZL2TUFU3F", "Overall": "5.0", "Content": "A lot of camera for the buck! Flip down screen, lots of manual controls, and a large aperature all the way around! Not very pocketable, but a nice classic look, that you don't want to hide!", "Date": "February 13, 2014"}, {"Title": "I'm not a camera pro but -->", "Author": "Jimmy \"/jimmy/\"", "ReviewID": "R3F0NVO5JCZBUM", "Overall": "4.0", "Content": "I purchased and am very satisfied with the MX-1 -- primarily because of the fast lens.  Seems like most point and shoot cameras come with f/3.5+ lenses -- the Pentax is at f/1.8+.That means better shots in low light -- the flash is not always popping up.I've just started to get to know the camera -- but my results so far have been excellent.It's not the smallest and lightest -- but it is fully useable and has worked well for me.", "Date": "January 26, 2014"}, {"Title": "Great camera--great picture quality", "Author": "Mike Olson", "ReviewID": "R1KE95NKCQRI4F", "Overall": "4.0", "Content": "I've had Pentax equipment for years so I am a little biased, but that being said, this is a great camera.  Fairly intuitive controls, nice size, Pentax lense.  I'm happy.", "Date": "January 21, 2014"}, {"Title": "Better than I could have imagined", "Author": "Jaime Moreno", "ReviewID": "R2ANVGS7V48JQA", "Overall": "5.0", "Content": "It is rare that a product not only meets but exceeds my expectation.As soon as I took this camera out you could feel and see the quality.The first pictures I took were just amazing and that was just using the auto settings!The bokeh was quite noticeable right away too. See the pictures I uploaded. Thing is this camera has exactly the features I was looking for whereas the other cameras were missing one or more of the areas I was looking for which were.#1 f/1.8 wide aperture lens#2 macro capability 3cm or less#3 Raw support#4 Very good maximum light sensitivity for low light conditions#5 Long exposures of 30 sec at least for basic nighttime star photography and silky water scenes#6 small enough to carry in coat pocketCan't wait to read the thick manual and actually learn how to use this thing properly and see how much more stunning my pictures can be!", "Date": "October 27, 2013"}, {"Title": "I like it", "Author": "Michael W", "ReviewID": "R1KXJSHEBOQUGR", "Overall": "5.0", "Content": "I haven't bought a new digital camera in several years to know how this camera compares against others in a similiar class.However, I purchased it especially for the macro focus capability, and just about every other bell & whistle simply came along as freebies.  It has lived up to my expectations and then some.  I use it frequently indoors, and find that the tungsten white balance feature really brought the color shading fairly close to true, so color correction is one less step I don't have to do in software.I'm impressed.", "Date": "January 1, 2014"}, {"Title": "Best Point Shot Camera Ever!!!", "Author": "YEOM CHUN HO", "ReviewID": "RCADW26TCKJHC", "Overall": "5.0", "Content": "This is the best point shot camera on the market in terms of functionality and reliability for the pictures that it takes.  Very responsive and intuitive menu with the variety of options close to pro shots.", "Date": "December 30, 2013"}, {"Title": "Best Camera I Ever Returned", "Author": "RS", "ReviewID": "R1BEWGXO8W2QZJ", "Overall": "3.0", "Content": "The color profile from out of camera jpegs was great, and in general the image quality and menu system of this camera are fantastic.  It saddened me a great deal to return this camera.  The problem is that except for shooting in Candid Capture mode, the focus assist lamp flashes whenever you activate the shutter.  Even if you manually turn it off in the settings menu, it will still flash or blink, the exception being in Candid Capture mode, which places everything in auto.  What this means is that you can't use this for candid or street photography in Manual, Aperture Priority, Shutter Priority, or Program modes without calling attention to yourself.  It's a great camera at a great price, though, so if you don't mind the flashing light or slapping a piece of black electrical tape over said light, then it might be the camera for you.  This means it would probably work fine for most users.  For my purposes, even at the current reduced pricing, I can't see paying a few hundred for a camera that I'd have to jury rig with tape in order to use it as I like.  If its price keeps dropping, however, I could well change my mind.  Like I said, I really liked this camera, and I was truly sad to have to send it back.  Given that Pentax has discontinued it, I doubt something so simple as a firmware fix will be forthcoming.Oh yeah, on a side note, if you're looking for something really cute, you can set the self-timer to count down by cat meows--yes, you read that right, it'll count down the self-timer using cat meows.", "Date": "May 2, 2014"}, {"Title": "great image quality but way too heavy", "Author": "Jaden P", "ReviewID": "R1Y0DP4NMWN50H", "Overall": "4.0", "Content": "somebody doesn't care about its weight. I can recommend strongly but wants to find real point and shoot style. it won't be ideal one. The weight is biggest issue. almost it is way heavier than mirrorless cameras.However, image quality is way great. can't believe that tiny sensor can make great photos.", "Date": "April 27, 2014"}, {"Title": "Keyboard & Case for Samsung Galaxy Tab 10.1", "Author": "gary stanford", "ReviewID": "R2ISKS4WOV0MWP", "Overall": "5.0", "Content": "This is a great product for the Samsung Galaxy 10.1 Tab.  Configures in a breeze, easy Bluetooth recognition, nice, well designed and tactile keyboard,  What more could you ask for the price?", "Date": "January 21, 2014"}, {"Title": "My iPhone Is Higher Quality - Sending Back", "Author": "blackmamba \"coffee addict\"", "ReviewID": "RQX12VDI6F29", "Overall": "2.0", "Content": "I wanted a pocket camera that would be better than my iPhone 5 for taking a pictures, and I loved the retro look of this camera. I was looking for something handy that fell between the iPhone and my DSLRs. This thing has a crappy light metering system and the definition of the images is average. Kinda frustrating to use and extremely disappointing. This is an okay camera if you don't have a camera and don't know how to use a camera. But your iPhone will do better.", "Date": "December 25, 2013"}, {"Title": "Pentax MX-1", "Author": "Man Asura", "ReviewID": "RO3RT5NZ46JPV", "Overall": "1.0", "Content": "Pentax MX-1 this camera though heavy, but the button like a toy and is not waterproof.The camera's body with a non-slip rubber, non-slip rubber but very easy to glue dust.This camera uses a higher than 400ISO significantly decreased in the low light quality.Its recording and tracking AF is too slow.Focal length and shutter at the same location can not be controlled.Travelers can not use a car or external rechargeable battery in the camera body.No wiring and no flash hot shoe: You can not use an external flash.Incandescent light in the room using the AWB would yellowish, only use the manual white balance.Slower write times, each time a picture have to wait for about two seconds to shoot the second.", "Date": "December 15, 2013"}], "ProductInfo": {"Price": "$399.95", "Features": "1/1.7-Inch 12 mega pixel back -illuminated CMOS sensor for exceptional performance\nA 4X optical zoom (28-112mm in 35mm format) at f1.8-2.5 for outstanding depth of field control and beautiful bokeh.\nLarge, hi resolution 3 inch 920k pixel LCD screen can be tilted up or down for easy viewing and shooting from difficult angles\nDual PENTAX body based sensor shift & pixel track shake reduction stabilization system ensures sharp, blur free images and video, even in dim lighting.\nFull 1920 x 1080 HD video with h.264 compression with HDMI out port", "Name": "Pentax MX-1 Silver 12MP Digital Camera with 4x Optical Image Stabilized Zoom and 3-Inch LCD Display", "ImgURL": "http://ecx.images-amazon.com/images/I/51hoAJfiDGL._SX300_.jpg", "ProductID": "B00B46A1AS"}}