{"Reviews": [{"Title": "Best Point and Shoot yet!", "Author": "Elizabeth A", "ReviewID": "R1HXGC6QRIFQKZ", "Overall": "5.0", "Content": "I have never gone wrong with a Casio.  This camera is amazing. It came from Germany quickly with no hidden customs fees. In fact, it beat the orders from the US I ordered at the same time. I do have to charge it through my computer hookup as the charger has European prongs.  I could just use an adapter, but I have an extra battery and so far it's not been a problem to keep them charged.  The battery life on Casio cameras is unbeatable.  I can take about 500 pics before needing to put a new one in.  I still haven't taken the time to learn all it's features, but one option I live is the click of a button to shoot a series of multi shots.  I can program it to shoot up to 30 at a time.  It gives you stop action movie type pictures which is very helpful when trying to get a jumping picture or the first kiss at a wedding.  Shoots great in low light.  Wide angle. Has manual overrides like a DSL on the top. The settings button works a little different. It shows up on the left side of the screen. Another big change from my other Casio's is that when you take a picture now, the screen does not go blank for a moment.  The picture you took shows up in the right hand corner of the screen as a thumbnail.  So if you're used to the other, you might miss seeing it and think you missed taking your picture. But so nice now not to have the screen go blank.  Good video.  Pop up flash. I'm surprised you can't get it in the states.  I guess Casio is just concentrating on their European market.", "Date": "December 11, 2013"}, {"Title": "This Casio Cadillac of cameras", "Author": "Bob", "ReviewID": "R32T2RKVCMN298", "Overall": "5.0", "Content": "The camera came from Japan and the directions in the camera were in Japanese and it took a little bit of doing including contacting the supplier to get it changed, but after understanding the system a little it was accomplished without problem. This camera has more features than the average person needs but it's there. After checking other cameras the manufacture of this camera seems to be high quality and should be very durable. I haven't transferred any pictures to my computer yet but looking at them on the camera screen they look very sharp  and detailed. I think the camera is well worth the money. I think they should ware house them in the states as they do in Europe.", "Date": "January 21, 2014"}, {"Title": "expectations exceeded", "Author": "mario", "ReviewID": "R15G8CMG7VGHTD", "Overall": "5.0", "Content": "I received the camera in five days. It processes color better than anything of its type. There are a few in-camera processing features but not enough to overwhelm. Menus are fantastic. Outstanding price.", "Date": "August 20, 2013"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B00B7D8I44"}}