{"Reviews": [{"Title": "Nikon D5200 24.1 MP CMOS Digital SLR Camera (Red)", "Author": "Russell Morton", "ReviewID": "R5JM5M1LBFZVL", "Overall": "5.0", "Content": "The package was extensive for the price (I have seen the camera for the same price, at other venues without all the add-ons).  I have another Nikon camera and the red body easily distinguishes between the two.  I am quite pleased with the camera and it's functionality.  The inclusion of filters, tripod and other items make this a very good deal.  The 55-300 lens is awesome.", "Date": "March 31, 2013"}, {"Title": "A fun, powerful, easy-to-use DSLR", "Author": "pmccomas \"pmccomas\"", "ReviewID": "RQN44XE7CA5IP", "Overall": "4.0", "Content": "I come from a Nikon background, so the D5200 features all of the quality I'm accustomed to, plus a little extra oomph when it comes to ISO settings and other selections.  The red body of the camera is sleek, and the 18-55 and 55-300 lenses offer powerful range of capturing possibilities.  It takes great photographs and smooth, hi-def videos.The package set from Focus Camera was a particularly great deal.  Even at 24 megapixels, the 32 GB card it came with still takes around 2,000 images.  The tripod is sturdy, and the camera bag really comes in handy.Great deal!", "Date": "October 28, 2013"}, {"Title": "New features", "Author": "walker", "ReviewID": "R30YIS42OS63UN", "Overall": "5.0", "Content": "I bought this camera outfit for my daughter for Christmas, she takes good pictures and wanted to expand her picture taking.  This one has so many nice features, using an adaptor she can take pictures and transfer to her phone and take group pictures with the press of a button as well.  She is very pleased with it, says she will never have a Cannon.", "Date": "December 30, 2013"}], "ProductInfo": {"Price": "$1,419.95", "Features": "This Kit includes 14 items all with USA Warranty and manufacturer's supplied accessories\nNikon D5200 24.1 MP CMOS Digital SLR Camera Body (Red) - Nikon 18-55mm f/3.5-5.6 AF-S DX VR NIKKOR Zoom Lens - Nikon 55-300mm f/4.5-5.6G ED VR AF-S DX NIKKOR Zoom Lens - 52mm UV Protection Filter - 58mm UV Protection Filter\n32 Gigabyte SDHC Secure Digital Memory Card - Secure Digital USB Card Reader - Universal Memory Card Wallet - Pack of LCD Screen Protectors\nAdditional EN-EL14 Rechargeable Lithium-ion Replacement Battery Pack - Well Protective SLR Camera Gadget Bag with Pockets & Strap\nFull Size 59\" Tripod W/Case - Focus DVD Guide to Digital SLR Cameras - Focus 5pc Deluxe Lens Care & Cleaning Kit - HDMI cable for HDTV connection - BONUS!! Free 25 Quality Prints", "Name": "Nikon D5200 24.1 MP CMOS Digital SLR Camera (Red) with 18-55mm f/3.5-5.6G AF-S DX VR and 55-300mm f/4.5-5.6G ED VR AF-S DX NIKKOR Zoom Lenses + EN-EL14 Battery + 10pc Bundle 32GB Deluxe Accessory Kit", "ImgURL": "http://ecx.images-amazon.com/images/I/61pkRk2WOtL._SY300_.jpg", "ProductID": "B00BBLCA0U"}}