{"Reviews": [{"Title": "Compact and versatile camera with a 3 inch touch-enabled screen", "Author": "Amazonian Consumer", "ReviewID": "R30PP194DUYW8P", "Overall": "4.0", "Content": "The Nikon Coolpix S6400 is very small, measuring 3.8 x 2.4 x 1.1 inches and weighs about 5 ounces. The 12X lens extends from a 35 mm equivalent focal length of 25 mm to 300 mm. The 1/2.3 inch image sensor is typical of digital cameras of this class. Because the sensor's low light performance is proportional to its size (generally, the large the sensor, the better its low light sensitivity), this class of camera performs best where there is ample light.On the other hand, also because of the small sensor size, it becomes possible to design a zoom lens with greater zoom range without prohibitive physical dimensions/weight or cost. It is amazing that Nikon can squeeze a 12X lens into a case that is just 1.1 inches thick.The Coolpix S6400 features a touch-sensitive screen that does away with many traditional buttons; only the shutter, movie, play mode, and camera mode buttons are actual physical buttons. A 3-inch screen can be fitted here mainly because of the minimization of real buttons. This also leaves very little space to place your thumb when holding the camera; luckily the camera is very light  so it doesn't strain my fingers when taking pictures. I always tie a hand strap between the camera and its case (not included), so that I can hold the case with my left hand while I take picture with my right hand. This is a safety arrangement to make sure that I am less likely to drop my camera to the ground when someone inadvertently bumps into me.Original manufacturer's battery is often very expensive (>$20), so I usually buy new third party battery on eBay. For the Coolpix S6400, you can typically get two EN-EL19 compatible batteries with free shipping for less than $10.The EH-69P AC Adapter/Charger included in the camera package is in fact a AC to USB converter, not a standalone battery charger. This means the battery needs to be charged inside the camera, like so many others. This problem can be solved with just a little cost. While Nikon's MH-66 battery charger costs $42.95 retail, you can buy a third party external charger for the S6400 on eBay for $3.99, with free shipping.There is another model (S6500) that is identical to the S6400 except that it has an additional Wi-Fi file transfer capability. I bought the S6400 because I don't need this feature and the S6400 has a better bang-for-the-buck.Update (1/7/2014):After a few weeks of use, I found two somewhat annoying things about the S6400, which prompted me to take off one star from my original 5-star rating of this camera.1. Upon pressing the on/off button to turn on the camera, I need to wait about 8 seconds before I can press the shutter release to take a picture, so if I see something happening fast and whip out the S6400 to attempt to take a picture, chances are I would miss it. Moreover, if the camera goes into energy-saving mode after the default 1-minute time (user changeable), it will also take 8 seconds to return the camera to operation capable status.2. Touch control may not be as accurate and reliable as physical button. I cannot browse pictures quickly, as the touch interface simply won't allow it, furthermore, navigating a picture after zooming in is slow and unreliable.Knowing now that the S6400 is not well suited for quick shots, I still like the pictures that the S6400 can produce. The auto focus lens is fast and sharp, and the colors are very nice. Pictures taken with flash always look evenly lit and well-exposed.", "Date": "November 24, 2013"}, {"Title": "This new 6400 is like a Cadilac compared to the 3700 being a horse ...", "Author": "steve ypsi mi \"steve\"", "ReviewID": "RKU3DS4EZ65ZL", "Overall": "5.0", "Content": "Nikon 6400.Bought this to replace a old Nikon 3700. what a difference, the old one did a job over the years, thousands of pic and movies lot of wild life .. This new 6400 is like a Cadilac compared to the 3700 being a horse and buggy, there is no comparison. the old said 3x Zoom. it would not zoom at 25 feet, looked the same as no zoom, I was leary of this one which is 12Xzoom, Oh the old one while in movie would not Zoom, the New one zooms in any mode and It is truly a 12 zoom, will try to attach 2 photos taken at 300 or more feet no zoom and 12 zoom, it does what it says. clear touch screen, that is a time saver, only had it a few hours and all ready learned a lot, touch screen makes it easy to navigate and change the settings, the old one never did learn how to use all the features and was terribly slow navigation.Smaller slimmer can't say how much I like this 6400, at $129.00 it is a steal.By the way some one said charging is crappy, I ordered this from amazon and now have 3 batteries , one with it and the two with a charger, always have one charged, think I paid around $17.00 charger and two batteries at Amazonhere's the link B008UZHDOI5 day's laterBoy practiced on some squirrels at 80 feet, one was setting and one was in full run, both came out perfect, the running shot no blur, both filled the pic like they were 5 feet away,update two months of use, still love it more, But the batteries that I have the link to at amazon, why, because the stock sony battery failed to charge with very little use, the others are great, last forever. can't seem I can insert a product link so heres the link copy pasteB008UZHDOI", "Date": "December 12, 2013"}, {"Title": "Great little camera.", "Author": "JaimeRC", "ReviewID": "R3QALFBRO21PZ4", "Overall": "4.0", "Content": "I received this camera as a gift (purchased at Costco in a bundle pack).  It works wonderfully as a simple point and shoot camera and has great battery life.  I've had it for a year and probably have to charge the battery once every 2 months or so.  Also, I had an issue with the lens retracting after my son dropped it about 10 mo into ownership and Nikon fixed my camera good as new for the cost of shipping it to them.  So great customer service from Nikon!  I would definitely purchase this item again.", "Date": "December 13, 2013"}, {"Title": "Great point and shoot camera", "Author": "C MacDonald", "ReviewID": "RN9BKOXFGPVS2", "Overall": "5.0", "Content": "Excellent camera, great photos, present for my wife and she loves it, got the red color and its really beautiful...certainly will be easy to find....great service, and quick delivery.", "Date": "December 3, 2013"}, {"Title": "5 * Appearance and 3 * Performance", "Author": "K. Kumar", "ReviewID": "R1FYN7BJQA4T0P", "Overall": "3.0", "Content": "I purchased the red S6400 when it was offered during the Black Friday Deals week. I was primarily looking for a sleek camera that takes sharp pictures. The touch screen is a very handy addition. My husband is a serious enthusiast and owns a Canon 5D Mark II. To be realistic, this camera doesn't even come close to his Canon DSLR. That being said, it takes decent pictures. There is a fair amount of noise in low light shots. The video quality is good though keeping moving subjects in focus is not easy. The camera itself is definitely easy to use, lightweight and looks good.Since the battery can only be charged through the camera, I purchased a third party charger and battery on eBay.", "Date": "December 14, 2013"}, {"Title": "No External Battery Charger", "Author": "Windy City Guy", "ReviewID": "RJB4PTQIUG5QV", "Overall": "3.0", "Content": "The information and specifications shown on Amazon for this camera are lacking.  I assumed the camera would come with an external charger for the camera battery (standard with many other Nikon cameras but not mentioned in the description)  however that was not the case.  The camera does come with a charger however you have to charge the battery while it is in the camera and the charging cord plugs directly into the camera.  It's not always safe, convenient, or secure to leave the camera laying out while charging. The camera is very slow taking multiple back to back pictures, with about a 5 second delay between shots, regardless of setting. The on/off switch is very sensitive. I find the camera occasionally trying to turn on while in the case as the result of the slightest vibration.", "Date": "November 25, 2013"}, {"Title": "Id buy another", "Author": "Kim", "ReviewID": "R28DL3YM7FMOMU", "Overall": "5.0", "Content": "For a simple camera it has a lot of features. Loved the touch screen for  taking pictures. Its not that cheap plastic like some of the are made of.", "Date": "January 11, 2014"}, {"Title": "Well worth the $99 that I paid for it.", "Author": "strollinbfarm", "ReviewID": "R1G314Q6JOZFBB", "Overall": "4.0", "Content": "Very simple and easy to use. A little slow to snap multiple pictures in succession, but that's what I have my big camera for. All in all, a great little point and shoot. The really fantastic feature is the video recorder, great quality!", "Date": "January 9, 2014"}, {"Title": "Fantastic Features in a Small Point and Shoot Camera.", "Author": "Donald Avore", "ReviewID": "R3P9WCJQNXBTJE", "Overall": "5.0", "Content": "This camera has fantastic features, such as 16MP, 1080HD Video, great wide angle and zoom, and touch screen controls. It does more than I will ever probably need. The on-disc manual included is 280 pages. I am very happy with this product.", "Date": "December 30, 2013"}, {"Title": "Nice compact camera", "Author": "Loves Amazon", "ReviewID": "R3NK0Z0P0WR65A", "Overall": "5.0", "Content": "Bought this for my 10 years old as one of the birthday present! She loved it. Highly recommend. it is compact so she can carry easily.", "Date": "December 15, 2013"}, {"Title": "Great point and shoot camera!", "Author": "V. Blankenship", "ReviewID": "R3915A2PNFO8HG", "Overall": "4.0", "Content": "Perfect gift for my husband.  Simple to use, easy to set up and takes wonderful photos.  Absolutely recommend this item. It's our second Nikon CoolPix and not likely to be the last.  Love it!", "Date": "December 3, 2013"}, {"Title": "Having a problem", "Author": "S. Silver \"One reader\"", "ReviewID": "R3OWXI0BTKJIB8", "Overall": "4.0", "Content": "While the pictures come out well a line is down the middle of the viewer and now I have to take it in to a camera shop to fix as my  warranty period has expired.  Quite upsetting", "Date": "May 28, 2014"}, {"Title": "Great Little camera", "Author": "Joe Swafford", "ReviewID": "RS8VN114QW9CU", "Overall": "4.0", "Content": "Not perfect but takes really good pictures most of the time.  When it doesn't it's usually operator error and not camera.", "Date": "April 28, 2014"}, {"Title": "Very good small camera!!!", "Author": "ClaUS", "ReviewID": "R1LKJOAS1SPJTT", "Overall": "5.0", "Content": "Until I found this camera, I tried and had in the last 3 years more than 5 different brands (Sony, Samsung, Nikon, Panasonic and Olympus... sorry for not giving you the exact models, but were same small pocket sizes)... So far this was the best! Very, very nice pictures! My wife is happy too... 100% recommended", "Date": "April 24, 2014"}, {"Title": "Awesome camera portable high quality", "Author": "Rolando", "ReviewID": "RJL62APZPZABJ", "Overall": "5.0", "Content": "Got it for Black Friday 2013 and its the best you can get as for cheap cameras.It has decent Megapixels, good zoom and also hdmi output.Would recommend indeed.", "Date": "April 21, 2014"}, {"Title": "Nikon camera", "Author": "melissa mcassey", "ReviewID": "R1KMYH1KDSDBTM", "Overall": "5.0", "Content": "Got this on the deals of the day bargain and it is a great camera - takes fabulous pictures and movies. So glad I got this for myself for Christmas - only downside is the touch screen reacts fairly easily which means extra pictures taken w/o meaning to. Buttons push easily and can cause the camera to take a movie instead of picture. Otherwise great camera.", "Date": "March 15, 2014"}, {"Title": "Does what a poiunt and shoot should", "Author": "K. MIller", "ReviewID": "R1AKQD13SJVXNF", "Overall": "5.0", "Content": "The last point and shoot that I used seriously was an Olympus 35 MM point and shoot for traffic investigation .  This better than that in every way.  And it is a Nikon on top of that I still bring out my trusty FM on occasion to re live the glory days of 35 MM.", "Date": "March 14, 2014"}, {"Title": "Great camera", "Author": "G. Gowins \"Crafty Lady\"", "ReviewID": "R2HNG6ANCHI8XW", "Overall": "5.0", "Content": "Easy to use, takes great pictures, zooms in well and I love the size of the viewing screen.  I also like having a touch screen and the price was AWESOME.", "Date": "March 14, 2014"}, {"Title": "Awesome camera for the price.", "Author": "ocd4dresses", "ReviewID": "R2SNEDPMIPXGXG", "Overall": "5.0", "Content": "I got this one as a deal and it's a really good deal! I love the zoom, it's really powerful. I am very happy with the purchase.", "Date": "March 1, 2014"}, {"Title": "Cool", "Author": "LSR", "ReviewID": "R36X483BSJ48VV", "Overall": "5.0", "Content": "Bought as a gift for my daughter.  She loves it.  Great size to fit anywhere.  So far the pictures are beautiful with many choices.", "Date": "February 20, 2014"}, {"Title": "Fun camera!", "Author": "Josh H.", "ReviewID": "R1XSCUSOFEYOMY", "Overall": "5.0", "Content": "Purchased for my girlfriend and she loves it! Her favorite color is purple and she can now take pictures of her daughters childhood.", "Date": "February 18, 2014"}, {"Title": "Great carmera", "Author": "LouB", "ReviewID": "R84SS0ML1MLLU", "Overall": "5.0", "Content": "This is a great compact camera.  it has a nice zoom and great images.  smaller than a pack of cigarettes.", "Date": "February 16, 2014"}, {"Title": "Nikon COOLPIX S6400", "Author": "Tom K.", "ReviewID": "R1SL5O27R8A5KT", "Overall": "4.0", "Content": "Had really good luck with Nikon digital camera before.  Wanted one with more optical zoom on it, and this works really well.  Takes really good pictures, and movies clips to.", "Date": "February 15, 2014"}, {"Title": "Small", "Author": "Cheryl Lamm", "ReviewID": "R2A1EHJYU4C0XZ", "Overall": "5.0", "Content": "There is a lot of power in this little camera.  The zoom is great.  It does not have an external charger.  It does not come with a memory chip.", "Date": "February 13, 2014"}, {"Title": "great camera", "Author": "Saijin Huang", "ReviewID": "R1T3VLP950CD7D", "Overall": "5.0", "Content": "it takes great high definition video and picture. the compact size is very convenient to carry. i love it very much.", "Date": "February 11, 2014"}, {"Title": "I returned this camera", "Author": "susananne", "ReviewID": "RC1RAZOSLW3P1", "Overall": "2.0", "Content": "I have had Nikon cameras for years so I thought I would purchase this Coolpix to replace my old Canon SureShot that I was using for my everyday camera.  The Canon was old and was taking longer and longer for the shutter to click.I was looking for an all purpose camera with a macro feature so I could take photos for ebay.I purchased the Coolpix as a Black Friday Amazon special.Ultimately, I wound up returning it.  It had a nice feel but the photos were mediocre.  I honestly could take better photos with my phone.I did like the options on the Coolpix.  I liked the shutter speed and the wide angle of an average photo, but I felt the images had the distortion of a very cheap disposable camera.  Cheap cameras have a tendency to distort facial features - making a nose appear larger or making eyes appear more deep-set than they actually are. Most people hate photos of themselves taken with cheap cameras.  You can occasionally get lucky and grab a nice shot, but overall cheap cameras make lousy portraits.  I suppose this camera would be nice for someone who likes to take scenery or action photos.I wound up buying a larger Coolpix L320 and am thrilled. The L320 has a beautiful way of capturing an image and is amazingly easy to use.", "Date": "February 8, 2014"}, {"Title": "very nice camera. small but with great zoom", "Author": "Amir Poran", "ReviewID": "R1R8AUKQJ3KX8L", "Overall": "4.0", "Content": "you can edit photos on the camera.12X zoom at tiny camera body!and most important - shoot very nice pictures,personally don't like the touch screen because sometimes you can touch it by accident.stopping movie clip is inconvenient.but all together excellent camera at an excellent price", "Date": "January 31, 2014"}, {"Title": "Great little camera", "Author": "Theresa Mascari", "ReviewID": "R325DL3GGUI5XQ", "Overall": "5.0", "Content": "Camera for my husband who is not electronic savoy the very first day he was snapping pictures and using all kind of special features very good quality", "Date": "January 29, 2014"}, {"Title": "A view", "Author": "Anthony DiMinno", "ReviewID": "R4N6HUNXB7UFA", "Overall": "3.0", "Content": "Perhaps after I have learned to use every feature the rating will go up. The manual is not very good at instructing you how to use most of the features. Was disappointed in the wifi feature. Useful only if you have one of the new phones which has access to internet, otherwise carry your ipad with you.", "Date": "January 28, 2014"}, {"Title": "Great little camera for the price ...", "Author": "Violetpurr \"Carole Rousis\"", "ReviewID": "R3D031RUUPVZEQ", "Overall": "5.0", "Content": "I take a lot of pictures of people and scenery but I am not a professional or an authority on cameras. I have had several makes of point-and-shoot cameras over the years and this is one of my 2 favorites. It takes sharp pix both close and far away. It takes the best zoom pix of any camera I have had. I love the size and color, too.  I would buy this Nikon camera again.", "Date": "January 27, 2014"}, {"Title": "Best deal out there.", "Author": "Brandy Ploe", "ReviewID": "R4DTLOE5QPHZ7", "Overall": "5.0", "Content": "After several tries with other brands, this one is a keeper.  Easy to use, and photos are super clear.  Nice and fast.", "Date": "January 25, 2014"}, {"Title": "Great camera!!", "Author": "Mary Jo Burger", "ReviewID": "RPVHFCRLWJPZ1", "Overall": "4.0", "Content": "Love the color!! The screen size is great! The only down side so far is that the battery doesn't stay up very long", "Date": "January 22, 2014"}, {"Title": "What a feature-packed HD compact camera for a modest price!", "Author": "J. A. Henderson", "ReviewID": "R11IDKHLPAT4AA", "Overall": "5.0", "Content": "I bought the attractive light purple model of this phone for my wife for Xmas 2013, and was she ever surprised and delighted!  A large LCD screen on the back gives you an excellent view of your photo/video, and both HD pics and videos turn out stunningly clear!  Nikon has always been known for outstanding optics, and they don't appear to have skimped on this modest-priced unit.  My wife is touch on electronics, so we'll see how long this lasts, but after one month with a lot of use it is still like-new and functioning perfectly.  Highly recommended!", "Date": "January 20, 2014"}, {"Title": "Nikon Coolpix", "Author": "Babette Skinner", "ReviewID": "R1P6WBVKL1NNNP", "Overall": "5.0", "Content": "I had just returned from a cruise to the Western Carribean where my camera got ruined by rain in Belize.  I went to Amazon to check out the cameras and found this one.  The price was great and I liked the zoom capabilities on it.  Works great.", "Date": "January 20, 2014"}, {"Title": "Compact camera", "Author": "George", "ReviewID": "R3SGQPT293UUMT", "Overall": "4.0", "Content": "I find the ease of use, with this camera, exceptional.  The compact size with the 12x optical zoom makes it handy to carry while riding my motorcycle or just turing.", "Date": "January 15, 2014"}, {"Title": "Great camera", "Author": "eaczok", "ReviewID": "R38EY6T3DJKXKX", "Overall": "5.0", "Content": "Love all the extra things I will be able to do with this camera. I also was a great price and fast delivery", "Date": "January 6, 2014"}, {"Title": "good", "Author": "sash", "ReviewID": "R2Y8ET0NCG6B8V", "Overall": "3.0", "Content": "The camera is very pretty.  good size.  Fairly easy to learn to use.  The biggest problem I have with it is that it is very very slow to process in between shots.  That has caused some problems cause you can't take multiple shots.", "Date": "January 3, 2014"}, {"Title": "Amazing", "Author": "aragon", "ReviewID": "R14G9JHAPS4V8U", "Overall": "5.0", "Content": "Amazing camera, this is a lightweight and easy to use, the pictures you take are very good and the speed is excellent", "Date": "January 2, 2014"}, {"Title": "nikon colpix s 6400", "Author": "IOAN P.", "ReviewID": "R344561GQTN0X7", "Overall": "4.0", "Content": "nikon colpix s6400 very goodaf and vr work very goot at 12x zoomi like 3 inch screengood control", "Date": "January 1, 2014"}, {"Title": "picture almost perfect", "Author": "NM Norma", "ReviewID": "R1RQB83CLGUYBC", "Overall": "4.0", "Content": "The details of the picture are quite good. The size of the viewing screen is terrific.  The ease of turning it on and adjusting wide angle or telephoto and snapping a picture is appreciated.  It is lightweight and easy to carry.  The down side is the recovery time from taking one picture to being ready for the next picture is more than I would want or expect.  Oh well.", "Date": "December 31, 2013"}, {"Title": "Great!", "Author": "juli froehlig", "ReviewID": "R1J4FO8782GYME", "Overall": "5.0", "Content": "Better then expected!  I got it on black friday for 100 dollars and it is worth every penny! Zoom is great. Pictures are clear!  Very happy!", "Date": "December 31, 2013"}, {"Title": "Love my Nikon!", "Author": "Amazon Customer", "ReviewID": "R6OQBWJ92I67G", "Overall": "5.0", "Content": "My husband lost my old 35mm Nikon at Lollapalooza 1996.  I loved that camera - have many beautiful clear rich color photos as evidence to how well it performed with auto focus.  For many years had other manufacturers, digital or not, none were the same easy use or clarity.  Now to have my Nikon back, I can't tell you how happy and satified I am.It is easy and the results are superb!  Thank you Santa!", "Date": "December 26, 2013"}, {"Title": "Nice one for the cost", "Author": "vijaiendran", "ReviewID": "R3NN3QM0IXKAD", "Overall": "5.0", "Content": "I got this on a thanksgiving deal for $99.  It is nice cam with features packed in.  Battery indication is a minus i would say, but still its worth the cost.", "Date": "December 26, 2013"}, {"Title": "GREAT CAMERA", "Author": "A Ball Coach", "ReviewID": "R3ANG5FISXMTNL", "Overall": "5.0", "Content": "THE CAMERA CAME VERY QUICKLY AND IS WORKING GREAT. IT IS VERY SMALL ABLE TO FIT INTO A POCKET OR PURSE VERY EASILY.", "Date": "December 26, 2013"}, {"Title": "It is good but battery !!!", "Author": "meshal", "ReviewID": "R1S0WDG80KKW74", "Overall": "4.0", "Content": "Camera nice size and good toutch screen but battrey live is short and only charge battrey in camera :(All good just batteryThanx", "Date": "December 26, 2013"}, {"Title": "Nice Camera", "Author": "Ryan", "ReviewID": "R3FK44J0ZR74KP", "Overall": "4.0", "Content": "Its a good solid camera, the price is right and it take good pictures. The only drawbacks I can see so far is the shutter speed is slow and it takes a while to process a pic after taking it, so you cant take multiple pictures fast.", "Date": "December 26, 2013"}, {"Title": "I like the product", "Author": "Vikas Vashist", "ReviewID": "R2QA29QLAEHXJA", "Overall": "4.0", "Content": "this is a good product.lens make slight noise while moving.light compact cameracamera is working perfectlynice product", "Date": "December 26, 2013"}, {"Title": "ok", "Author": "jencat", "ReviewID": "R1TUVA874B4P0J", "Overall": "2.0", "Content": "It takes forever to flash and is confusing at times. I still prefer my canon and the reliability of it but will keep this camera anyways cause it was a deal!", "Date": "December 23, 2013"}, {"Title": "Seemed okay to begin with", "Author": "King's Kid", "ReviewID": "R3M1LR7DLJFXDM", "Overall": "2.0", "Content": "Then after about 3 weeks, I couldn't turn it off.  It took a picture and froze.  I got the picture but I had to remove the battery and then turn the camera on again to be able to use it.  Then it just stopped working.  Unfortunately it was the second of two cameras I brought that died.  Amazon took it back without murmur and refunded my money.", "Date": "March 3, 2014"}, {"Title": "Poor picture quality,", "Author": "Frank A. Odlum", "ReviewID": "R2C3FQRWMPWH40", "Overall": "2.0", "Content": "The instruction included fall far short of the explanation and instructions needed for me to operate this camera to my satisfaction. I didn't feel the picture quality was that good.", "Date": "December 31, 2013"}, {"Title": "Not working at all", "Author": "Erika Lara", "ReviewID": "R2LDMV52Y3H8I3", "Overall": "1.0", "Content": "I just gave camera as a christmas gift to my dad but it is not possible to turn on it. I tried to leave it charging the complete night but nothing.I have to double check if it is a camera or battery issue. I checked the warranty and it does not cover batteries. Anyway it will be cheaper to buy a new battery than a camera.", "Date": "January 11, 2014"}, {"Title": "Bad touch interface and UX", "Author": "Sergio", "ReviewID": "R1SUQZKVI82M2G", "Overall": "1.0", "Content": "It is one of the worst cameras I've used, the touch controls are not accurate and the user experience is horrible, I was unable to focus the lens on macro mode, all the pictures came out blurry or moved.Returned and bought a different model, Nikon should be ashamed of this model.", "Date": "December 30, 2013"}, {"Title": "disappointed", "Author": "VE215630 MARIANELLA ZERPA", "ReviewID": "R250EPF6NCIE9P", "Overall": "2.0", "Content": "I have this camera since one year and I'm really dissapointed.It has not an external chager.The camera is extreme slow to take pictures, even if using the divers options.The good thing is the option of color selection taking pictures, is nice and fun!", "Date": "November 27, 2013"}, {"Title": "Crappy camera and not a deal.", "Author": "Sarah E. Kolodziejczak", "ReviewID": "R2TCBELKQFJ5JV", "Overall": "1.0", "Content": "I own this, however I purchased at another Mart with a \"wall\" for the same price being advertised her as a lightning deal... and it stinks. Gave it to my seven year old and purchased another Kodak.", "Date": "December 19, 2013"}], "ProductInfo": {"Price": "$249.99", "Features": "12x wide-angle to telephoto zoom with Optical Vibration Reduction\nNew Smart AF System for optimum focus in every shot\n16.0-megapixel CMOS sensor for superior low-light performance, fast framing rates, high-definition videos and more\nFull HD (1080p) videos with stereo sound", "Name": "Nikon COOLPIX S6400 16 MP Digital Camera with 12x Optical Zoom and 3-inch LCD (Red)", "ImgURL": "http://ecx.images-amazon.com/images/I/41tKUbJAD%2BL._SX300_.jpg", "ProductID": "B00B19JYHO"}}