{"Reviews": [{"Title": "Great little camera with cool features for a good price.", "Author": "Tristero \"~Tristero\"", "ReviewID": "RG8P2Z55784ZM", "Overall": "5.0", "Content": "My wife and I bought this camera for a cheap and compact little camera for our trip to Las Vegas. We wanted the convenient Wifi picture transfer, and got so much more.  She has a Canon Rebel t3 so we wanted something small. It fits easily in your pocket and is very light weight.I LOVE the Samsung Smart Camera app.  It takes this camera from a cheap point in shoot to an amazing device.I cannot say enough good things about the remote view finder.  You can setup your camera and wirelessly view what you look like and hit the picture button on your android phone!Wifi photo transfer is easy and convenient. No more cables, or taking out the memory stick to put into the computer and then forgetting it.Wireless upload!  This camera can link to your phone, and when you take a picture it appears on your phone ready to upload.  You can send good quality photos instead of using the cruddy camera built into your phone.This is a great little camera for a great price. It has some amazing features that are very convenient.  Do not expect an amazing quality lens or picture for 100 dollars.  Expect some state of the art functions and a great sized camera.", "Date": "April 18, 2013"}, {"Title": "I really love this camera!", "Author": "Stephanie", "ReviewID": "R2SLBAWPVXNZ2G", "Overall": "5.0", "Content": "So I may go on a little rant here so i do like my cameras.Okay first....this is not a professional camera and everyone who is leaving reviews like it should be one...please stop! The camera is very small so small it can fit in your back pocket or front. This is not a bad thing actually this is what i wanted it for i needed something small, light weight, and easy to use so when i go to my nerd conventions ill have an easier time taking pictures of everything/one i see.The pictures look really great! they are clear and take way better pictures them my camera phone which again is what i needed. When going on conventions you don't want to use your phones for pictures because your battery will die fast and you need that life so if you get lost from your group you can contact them etc....The WIFI feature is stupid easy to use! I saw some people complain it was so hard and cant figure out....its 3 steps WHICH THE CAMERA EXPLAINS TO YOU!!! yeah you don't even need to open up the instructions....it explains it for you on the camera in 3 very simple easy steps. You download an app on your phone (which BTW was free on my android), you press a button in the app after opening it, and you click for a pick and POP! downloads right onto your phone....my 55 year old mother could figure this out.BTW ladies this phone looked pink to me in all the pictures, but it clearly says red and it is red. Its a very very pretty red, but still red.This thing has amazing zoom for a little guy i was able to take a clear pictures from about 2-3 feet away which isn't half bad. yeah there is better but the thing is crazy small! lolI love the size of the back screen, i show off my pics to my fiance all the time and he likes the fact he can see the screen without coming super close (he is lazy).The buttons are very super clear on what they are and do so again you really don't need to open the instructions unless you have never touched a camera/electronic in your life.It comes with a rechargeable battery and of course a plug to charge it. Its nice because its a USB plug so you can use the USB part for your computer.it has some cool filters that would be fun to use defiantly if you want some fun shots.Yes, the camera has a video feature which is really cool and kinda needed when i see panels so i can record funny things they say.So to wrap it up its small, useful, take great pics, has good features, and mainly would be good for someone who goes to events, outside, parties, even if you have kids, etc....to use. If your looking to be a professional photographer no i wouldn't get it if your like me and just go to a lot of events or parties or like to take funny pictures of your cats then its pretty useful and fun.:) hope this helps!", "Date": "January 9, 2014"}, {"Title": "Great if all you want is an extremely basic camera.", "Author": "S. Williams", "ReviewID": "R3B8AIIACF7PH", "Overall": "4.0", "Content": "I give this camera 4 stars  because if all you're looking for is a basic, literally point and shoot camera. Look no further, this may be it.What I was looking for:- something very slim that I could put in my pocket as I do my smartphone- great picture quality- decent optical zoom- HD video recordingIt met and/or exceeded those areas.Pros:- This thing is tiny. Just a tad bit thicker than an iPhone- Great pictures when you have adequate light- Decent flash for low light photos- WIFI + BONUSES. You can read the specs but this one thing is cool so I have to mention. You can install an app on your iPhone or Android device that allows you to use your phones screen as the display for the camera to take pictures. Some may say this is useless, but it basically allows for remote control of the camera. I found it very handy.- Battery lasted an entire day of picture taking at Disney- Can snap pictures of the kids and get a clear shot even when they are not perfectly still.Cons:- Other than the (Smart) auto mode, this camera is seriously lacking in advanced manual controls. You can't change the aperture and such. You can change the shutter speed in a \"Night\" mode, but the lowest you can do it is 1 second. I understand in night you may want a longer shutter delay, but what if I wanted the shutter to operate faster? No dice.- Menu navigation isn't ideal. For a basic camera there shouldn't be a need to access certain features under then home > settings button and option, then have to access similar options under the menu button and sub menus. Options are too scattered.- Low light pictures are not great without flash. I compared this to my iPhone 4 and iPhone 5 and in every situation the iPhone 5 out performed it.- Continuing on with the feedback about shutter speed. Pictures can easily get blurred if say you were on a slow moving ride or tour and trying to snap a picture. Anti shake didn't help with that.I returned it mainly for the limited manual controls. I'm not a basic user. If you are happy not changing the settings and don't take picture while in any kind of motion you'll be happy and it does give you good pictures.I mainly want a DSLR and something small and expensive to compliment it when I travel light on a day to day. I returned it as it doesn't work for me, but I still think it's a great camera for many. It was $99 when I got it at best buy, it was also $99 on Amazon at the time. At the moment it's $84 on Amazon. As the price decreases this camera becomes more and more attractive.", "Date": "July 15, 2013"}, {"Title": "For $90, This is a BEST BUY for a tiny WiFi camera...", "Author": "Bears Fan Jim \"qm2-703\"", "ReviewID": "RUNVZ5GI3F0Y2", "Overall": "5.0", "Content": "First, I would advise you to read the reviews of Tristero, S.Williams, D.Shannon, and B. Valdez....I would sign my own name to those comments.But as with ANY camera, you just can't stop blur if your camera is shooting at 1/30th of a second or slower, and even with a fast f2.5 lens rating, in low light you will be at 1/30th or slower a lot of the time.My wife thinks 5X zoom is plenty for her Interior Design and Real Estate practice, and for family events. She really likes the ablility to share immediately with other relatives who have smartphones with less capable photo quality. Our son got WiFi and smart remote apps to work quite well, in about 20 mins, connecting to a Samsung cellphone and an HTC cellphone.A note about zoom in any tiny camera: Since the lens is so small, there is a real challenge to get high resolution, no matter how many megapixels or what the specs say. It is much better to zoom in for a shot, rather than take the wider shot and try to magnify on the PC later. Actually, this is true of any camera, even my Canon SX40 !!!The ST150F is capable of capturing restaurant shots, family get-togethers, infant photos,etc. It is much smaller, and I believe better built, than the Elph 115 I also looked at before buying the Samsung.If 5X zoom is all you need, you only use a camera in its Auto mode, and you want the tiniest, absolutely \"any-shirt-pocket\" camera, and you want WiFi plus remote control, this is right there near the top of the class under $150.", "Date": "September 2, 2013"}, {"Title": "Love this camera!", "Author": "MICHELLE \"Booksprite\"", "ReviewID": "R100LNA2XTNEWH", "Overall": "5.0", "Content": "Lightweight, compact, and attractive, this camera even has a 'smile' detector!  And did I forget economical?  My son bought one first, and was so pleased with it that I had to have one as well.  It's great for traveling, as the battery can recharge through the USB cable on the computer.  While I am still learning to use all the features, I enjoy this 'point & shoot' digital camera immensely.", "Date": "October 3, 2013"}, {"Title": "Best Snap and Go Camera", "Author": "Keri Hill \"hugakeribear\"", "ReviewID": "R3RTJC0RAYWJ6O", "Overall": "5.0", "Content": "I have a big bulky camera but wanted a small pocket one for the go, I end up taking it on a cruise vacation so I wouldn't have to carry around my big one..It took great pictures capture wonderful memories with quality pictures.", "Date": "October 15, 2013"}, {"Title": "Everything I wanted in a cute little package!", "Author": "C. Leonard", "ReviewID": "R2HJBKGS164FV5", "Overall": "5.0", "Content": "This camera is so easy to carry around. It's amazingly easy to use and takes wonderful pictures. Comes with one simple cord for charging and transferring pics right to my laptop. And, NO BATTERIES!!", "Date": "September 13, 2013"}, {"Title": "Found out what memory cards this camera takes and more info. on it", "Author": "wolfinator \"Mom to 4, Grandmom to 1\"", "ReviewID": "RSDBS1VKID3GG", "Overall": "5.0", "Content": "I haven't bought this camera yet, but after reading the reviews on it, I want it.  The price is jumping around too much right now so I'm waiting for it to settle down some.  I had prior asked about a memory card for this camera and was given good answers, but I decided to research myself further.I found that it will accept the following memory card types and sizes: External Memory(Optional) : micro SD™ (up to 2GB guaranteed) micro SDHC (up to 32GB guaranteed), micro SDXC (up to 64GB guaranteed).System requirements for  Windows  PC with processor better than PentiumⅣ 3.2 GHz / AMD Athlon FX 2.6 GHz or higher Minimum 512MB RAM (Over 1GB recommended) Windows XP SP2/ Vista/ 7 250MB of available hard-disk space (Over 1GB recommend), USB Port, CD-ROM drive,nVIDIA Geforce 7600GT or later / Ati X1600 series or later, 1024×768 pixels, 16-bit color display compatible monitor ,(1280x1024, 32-bit color display recommended). RecordingMode : Smart MovieMovie Size:1280x720HQ (30fps, 15fps) - Per one file : Max. 4GB640x480(30fps, 15fps)320x240 (30fpss 15fps)* Due to the noise while optical zooming, user can select to record sound or not. (Voice recording selectable : Sound Alive On/ Sound Alive Off/ Mute)Movie Clip  Max Recording time : 20minI hope this will help others as well.", "Date": "December 23, 2013"}, {"Title": "Problematic; poor focus", "Author": "Kirk P O'Brien", "ReviewID": "R1VWSFIO0VW20O", "Overall": "1.0", "Content": "I've spent a week with this camera, adjusting it to different settings. The picture quality isn't poor; it's somewhere under that. My prior camera, a five megapixel, seven plus year old Olympus, takes drastically better photos. Most of the pictures and all of the videos I've taken with the Samsung are blurred and out of focus; doesn't make a difference as to various settings. I've had the camera on a copy stand (the camera is absolutely stable, as is the image to be photographed, with plentiful light) and it refuses to take in focus pictures, in either macro or regular settings. Something's likely wrong in the autofocus; there's no option to turn it off. I've attempted all the fixes Samsung describes on their website for this problem (cleaning the lens, software adjustments); none of them worked, short of sending the camera in for service. This last is mentioned; it would seem this is a common problem.Avoid.", "Date": "September 20, 2013"}, {"Title": "a perfect gift", "Author": "Radosaca", "ReviewID": "R3B7LTJ6KDN3B3", "Overall": "5.0", "Content": "the camera is excellent and the resolution on the screen is incredible, that was a gift from my mon and she love it,", "Date": "November 25, 2013"}, {"Title": "Great, easy to use point and shoot", "Author": "Harless Marcom", "ReviewID": "R3MLEDYCQ23HQQ", "Overall": "5.0", "Content": "This little camera is exactly what I needed. It is really easy to use and the pictures come out excellent. I am not a camera person that can use fancy camera with infinite setting choices. The choices that you can make with this camera are few and easy. It is exactly what I was looking for and it was a great price. Shipping was quick and the packing was sufficient that the camera arrived in excellent condition. I feel like I got a great deal. Thank You.  :)Harless Marcom", "Date": "February 15, 2014"}, {"Title": "Great Camera", "Author": "Mark Twain", "ReviewID": "R38JP2H3BGHSYN", "Overall": "5.0", "Content": "I was looking for a simple out of the box camera, easy to use, that takes great pictures and Samsung delivered.  The camera has its own internal battery, so charge and ready to go.  The pictures are great.  It also has a video record option which I have not tried.", "Date": "January 12, 2014"}, {"Title": "took ok photos, but...", "Author": "freddy", "ReviewID": "R355NR4TH4CVT7", "Overall": "3.0", "Content": "stop working fairly quicklyI had an older model that took a beating from my inspector job and worked for about a year of abuse. This stopped working on a trip to tampa. nothing happened  that should have damaged this unit", "Date": "November 25, 2013"}, {"Title": "good value for the money, some important points (read on)", "Author": "fishouttawater", "ReviewID": "RAMJX4JAROJPS", "Overall": "4.0", "Content": "Wifi issue on initial start up & support:I purchased this camera specifically for the Wifi feature in order for photos to be automatically uploaded at my business. User documentation is sparse and lacking. However, I consider myself fairly technical savvy. I own a number of electronics far more complex than a digital point and shoot camera. I struggled with connected the camera to our Wifi network in that you would enter the Wifi password and select \"done\" however nothing would happen.. After several attempts, I contacted Samsung support via chat. The guy via chat was very inept. I then phoned in. It was difficult to reach the right department since there is no option for digital cameras. I choose \"computers\", however even under this option, there was no digital camera selection. I proceeded with laptops, and the person that (quickly) connected transferred to me. After trying several options with this tech, he had me completely remove the battery. This solved the issue, and the camera now accepted the Wifi password. If you run in to the same issue, remove the battery & memory card and wait 10 seconds.Now that this is resolved, backing up photos to our server is easy - click the \"Wifi\" button, then click ok to confirm. Photos back up in a few seconds.battery charger plug:The one I received is for a European or Asian market. The prongs are tilted 30 degrees. Not that big of a deal for me since the cord is a standard USB connector. Considering the cheap price, I was wiling to deal with it.", "Date": "January 13, 2014"}, {"Title": "Great pictures!", "Author": "ken simpson", "ReviewID": "R2TOC3SN5RAA25", "Overall": "4.0", "Content": "I do like this camera and love all the different effects etc you can do with this. Not being a camera buff it has taken awhile to learn how to get round it! The camera is fine, only gave it four stars because I wish the makers would include a full manual, takes forever tio look it up and find the bit you want on line, much quicker to just flick through the book!!", "Date": "November 2, 2013"}, {"Title": "Great Camera for the $$", "Author": "Karen Michelle", "ReviewID": "R269UG4NTARTPA", "Overall": "5.0", "Content": "This is a great little camera for a great price. It has some amazing features that are very convenient. I bought this camera for a cheap and compact alternative to using my iPhone all the time for pics. It fits easily in your pocket and is very light weight.I LOVE the Samsung Smart Camera app. It takes this camera from a cheap point in shoot to an amazing device.I cannot say enough good things about the remote view finder. You can setup your camera and wirelessly view what you look like and hit the picture button on your  phone!Wifi photo transfer is easy and convenient. No more cables, or taking out the memory stick to put into the computer and then forgetting it.Wireless upload! This camera can link to your phone, and when you take a picture it appears on your phone ready to upload.This camera was exactly what I needed and then some!", "Date": "May 27, 2014"}, {"Title": "Did everything I wanted - and more", "Author": "K. Corn \"reviewer\"", "ReviewID": "R3J3FNEN9266SU", "Overall": "5.0", "Content": "First of all, you need to have realistic expectations for a camera at this price point. I have a more expensive camera, one with plenty of bells and whistles as well as those extras lens for special types of situations. If I'm looking for professional level photos, that's my first choice. I can get a finer degree of control and more options when it comes to close-ups and distance shots. The colors are more balanced. There are also more settings.But that camera not only has a hefty price tag but it is  also heavy and bulky. So it isn't always the best choice when I'm running out the door and just want some decent shots of wherever I'm going and whatever I'm doing. I might not want to keep those photos forever.The web friendly sharing features are also a plus. Not only can I share photos - and quickly -from home but if I'm near a Wifi connection while away from home (and there are plenty of those around, more and more all the time) I can share pictures as well.The connection to Wifi Is about as seamless as it gets and then you're off and running. Want to quickly put  a photo on Facebook? There's a built-in app for that. Want to let friends and family see a picture quickly? There's an app for that too.  I can even save photos to  Picasa and edit them at my convenience (yes, built-in app for that). All these features are a huge plus.I use this camera for business too. It like the ability to show potential clients some clear and sharp photos of items they might want or to take a quick snapshot of something I might want to purchase. The photos are appealing and the colors are accurate.Bottom line: if you want a nice camera that takes decent shots and also like the ability to easily share photos over Wifi, this is a good choice. I love this little camera....for what it does...and I don't expect it to compete with fancier cameras.", "Date": "May 15, 2014"}, {"Title": "Nice camera", "Author": "Katherine Myers-Grew", "ReviewID": "R903K7W4UWV8S", "Overall": "4.0", "Content": "Takes very good pictures in the daylight, but when it's a little dark they really start to get blurry and it takes a very long time to actually snap a picture.  I bought this camera based mostly on the size as I needed one that I could easily fit into my jeans pocket while I was at Disney World and Universal Studios.  The compact size was a perfect fit and I could even keep my iPhone in the same pocket.  Uploading the pictures to my computer was very easy, basically just plug it in and transfer away.  The app option is nice except that you have to have your phone unlocked and the app loaded the whole time you are shooting pics, and when the screen turns off, the app does as well.", "Date": "February 26, 2014"}, {"Title": "Well worth the money", "Author": "Jan Girardot", "ReviewID": "RRDZZQ575086F", "Overall": "4.0", "Content": "This camera replaces a more expensive Nikon and while it delivers good photos, it is not nearly as intuitive as the Nikon. (I will not buy another Nikon, because of their high repair cost). I miss the touch screen, but appreciate the WiFi and other features.", "Date": "February 26, 2014"}, {"Title": "Great Cammera", "Author": "Tony D. Chavez Jr. \"Tony\"", "ReviewID": "R1XG69VGKWC7XP", "Overall": "5.0", "Content": "I like to record myself playing my keyboard then post the recordings on fb. Totally does the job. I'm very pleased with this camera.", "Date": "February 15, 2014"}, {"Title": "Another Great Samsung Product!", "Author": "Johanne Corker", "ReviewID": "RIGHHV1X43S5B", "Overall": "5.0", "Content": "This camera is easy to use, beautiful and takes great photos. It's superior to the Sony digital camera that I purchased for 500.00. That didn't even last 8 years.", "Date": "January 13, 2014"}, {"Title": "Good Quality Camera", "Author": "Joyce Costa", "ReviewID": "R8YLZFMRB0E6S", "Overall": "4.0", "Content": "Once I got the hang of it, I really like this camera...takes great pictures and the wifi feature is a plus....good value for the price", "Date": "December 14, 2013"}, {"Title": "9/10 very very good camera!! I would recommend  this camera for Christmas gift!", "Author": "Abraham Santoyo", "ReviewID": "R3G6Y7A68FG4C0", "Overall": "5.0", "Content": "overall I would give this 9/10 Very good buy Great camera for great price nice!!!! this is my second Samsung camera of Amazon", "Date": "November 28, 2013"}, {"Title": "buyers beware", "Author": "Dollycat \"bookworm124\"", "ReviewID": "R1SYSQAT2BHFMM", "Overall": "1.0", "Content": "The biggest fault with this camera was that would not work after the firmware upgrade was successfully completed. Called the samsung company and they could not offer much tech support to resolve this problem.  The only solution that was given to me was to either send it back to them for repair or to return it back to Amazon ...which is what I did immediately.  Lucky for me that this problem happened within a few days of having the camera and I was able to get a full refund.", "Date": "July 6, 2013"}, {"Title": "wow", "Author": "Norman Worley", "ReviewID": "RKGF4F1FAI8RF", "Overall": "1.0", "Content": "Camera did not work. It did not charge nor does it recognize the mini usb connector.  After the battery runs down it is done. It was a refurbished they did not check it.....overall it is a bad experience.", "Date": "December 30, 2013"}, {"Title": "nice", "Author": "Ant", "ReviewID": "R3K2GFLJFC6RH5", "Overall": "5.0", "Content": "if you want a simple quality camera. this is it. Samsung always makes their products user friendly. very compatible with laptop computer for pic transfer. I am very satisfied with product and price through amazon is a steal. I would recommend", "Date": "August 10, 2013"}, {"Title": "Easy to Use", "Author": "L. A. Macyda \"LM\"", "ReviewID": "R124110OSU9OID", "Overall": "5.0", "Content": "Very happy w/ this product; quick and easy to understand directions how to use; held 2,000 pictures and hook up to transfer was easy as well", "Date": "July 22, 2013"}, {"Title": "Great camera (smart)", "Author": "Edward Ranke", "ReviewID": "R2V29YYDUIM2JF", "Overall": "5.0", "Content": "Great camera small but great it's  The only thing is you need a small sd cardI love this camera", "Date": "June 29, 2013"}, {"Title": "Awful pictures", "Author": "Francois M.", "ReviewID": "R2V5V0M61KFC72", "Overall": "1.0", "Content": "I absolutely love the design and the large LCD screen; but the pictures are just not up to par. No matter how you play with the various settings, the pictures are worse than those with my 10-year-old Casio Exilim 3.2 mega pixels EX-Z3. If you don't have a clear blue sky with bright green grass, then the pictures are simply too painful to watch (especially for a 16 megapixel camera - even when set to 3 mega pixels).", "Date": "October 6, 2013"}, {"Title": "Great for Quick Wireless Uploads", "Author": "A. Northrup", "ReviewID": "R21M93MRBO0IE8", "Overall": "5.0", "Content": "I use this camera to quickly upload daily pics from my classroom. It syncs with OneDrive, so every day I upload 1 photo to OneDrive, and then post that photo on my classroom website. The uploading process takes less than 5 minutes. The camera walks you through everything really easily. I love that it's small and fits in my pocket so I have it ready to take a picture any time. It's also easy enough for my 5th grade students to use themselves.", "Date": "May 18, 2014"}, {"Title": "Awesome little camera", "Author": "William Bergan", "ReviewID": "R210ODMHKTAKTZ", "Overall": "5.0", "Content": "Wife is a professional photographer and has all of the high end EQ.But even she loves to take this camera around to little family gatherings, and othersmall events...convenient to carry and always ready with fantastic quality pictures every time", "Date": "April 14, 2014"}, {"Title": "I really like the size that it is so compact that I carry it my purse.", "Author": "Karen Yeager", "ReviewID": "RIWMJPTFUVX1", "Overall": "5.0", "Content": "The only thing that I did not realize when I ordered, is that it did not come with a memory card.", "Date": "April 6, 2014"}, {"Title": "Rats :/", "Author": "Mi Hart", "ReviewID": "RW31QMWBLB6U5", "Overall": "2.0", "Content": "So far this camera is a bummer. I get that I paid less than $80 for a point & shoot , but the photo quality has been so unreliable. I went with the Samsung camera because other Samsung products we have (phone & tablet) take amazing photos I figured the camera was a sure bet. Wrong. I haven't even attempted the \"smart share\" option because the photos were so fuzzy and demon eyed its not worth sharing.It is also really really small - I suppose a good or bad feature depending on the size of your hands. Make sure you always wear the wrist strap as its hard to get a good grip on the camera because its so thin - also affects the shakiness of the auto focus if you try to use one handed.I'm not sure I'll get my $$ worth from this camera- unless I hand it down to the kids to use as they are less fussy of their photo quality. I'm going back to my Canon.", "Date": "March 28, 2014"}, {"Title": "Nice little camera", "Author": "Jessica Pastine", "ReviewID": "R1JWS25TMHSLPP", "Overall": "4.0", "Content": "Nice snapshot camera. Just wanted something small and portable. Nice battery life. Produces good pictures, lots of nice features and easy to use.", "Date": "March 18, 2014"}, {"Title": "Samsung SYNC!", "Author": "NICOLE E RUGGIERO", "ReviewID": "R1ZUZNNMPAL0WO", "Overall": "5.0", "Content": "I have an S4 phone- this camera sync's with the phone to take twice the amount of awesome photo's. I am a DSLR person- but was looking for a slim-fit-in-your-pocket camera for vacation. This is a great camera... I almost have to make sure I dont drop it cause its so slim and lightweight...Recommended for those looking for an easy small camera..", "Date": "March 16, 2014"}, {"Title": "It's OK", "Author": "Scott", "ReviewID": "R2B8DJRDYVZ3FH", "Overall": "3.0", "Content": "I have a Canon S100 and older Pentax DSLR for myself.  I  wanted to purchase a camera for my mother, who has minimal experience with newer tech.I was hoping to get a point and shoot which took better pictures than the throw away cameras she bought at the store.  I wanted one cable to both charge the camera and transfer pictures and video.  No changing batteries or taking out SD cards to complicate the learning process.I did not care about user controls since this was for my mother with limited experience.  Unfortunately, I am spoiled by my Canon's auto picture capability.  This Samsung ST150F relies heavily on flash when set on auto, and it is easy to get blur in pictures (especially when light is unevenly distributed in the area you are shooting).  The pictures are a little low in contrast.  Additionally, video requires navigating through the menu instead of a dedicated hardware button.  For advanced users not a problem but less than optimal for my purpose.  Last, I could not setup the WiFi (would not accept password) even after updating the firmware and removing the battery.  However, this might be due to the older router at my parents' house.I did not test the advanced settings.  All in all, it serves my purpose for a beginner camera point and shoot with one cable to charge and transfer pics.  Hopefully the WiFi will work when I upgrade their service and equipment this summer.If you are a hobbyist or above, I would recommend another camera.  However, as a gift to someone who is new to taking pictures with digital cameras, there are a lot of features that ease use and connectivity (although that adds to the price).  Plus, it is a small, light, pretty camera, so my mother doesn't have to look like she bought something from Goodwill when she takes it out in front of her friends and does not at weight or bulk to her purse.  The camera monstrosities that prioritize function over form are reserved for me.  ;)", "Date": "March 15, 2014"}, {"Title": "Good Camera but WiFi is very limited", "Author": "st303", "ReviewID": "RGTEJJY9E5K0V", "Overall": "3.0", "Content": "I was hoping I could use the WiFi connection to connect to the camera from any internet connected device and control the camera and download images.  When connected to a normal wifi network the camera can upload pictures to various internet sites but it is a manual process. You must take the pictures then put the camera in proper mode to upload the pictures.  You can't be capturing and uploading pictures at the same time.  You can control the camera in view finder mode but that only works with the camera acting as a hotspot with an android or iOS device connecting to it.  Not sure why anyone would want to control a camera with their smart phone unless they like selfies of themselves using their phone to take pictures.  It would be much more useful if it connected to a normal wifi network and then could be controlled from anywhere on the network and when a picture is taken it would automatically upload it like the eye-fi cards do.  If you don't have a computer and want to be able to move the pictures off the camera to your smart phone it works fine for that.  If you have a computer it is easier to just hook it up to  a USB port.  I can't comment on how the pictures look because I never got past setting it up.", "Date": "March 13, 2014"}, {"Title": "love it", "Author": "Amazon Customer", "ReviewID": "R1OZK5E2C41N4H", "Overall": "5.0", "Content": "my videos and pictures look great now. very easy to use and charge fast. love using the mobile link app", "Date": "March 10, 2014"}, {"Title": "good camera", "Author": "Mario", "ReviewID": "RWSPCSUTVJPVJ", "Overall": "4.0", "Content": "This camera is good for the cost benefit, handles good wifi connectivity, and good graphical interface and customization options of the same, the only drawback is in making little light pictures are not of good quality and have a lot of noise . Overall it is a good camera.", "Date": "March 10, 2014"}, {"Title": "Love", "Author": "Paula", "ReviewID": "R3BRA96GWXD40L", "Overall": "5.0", "Content": "I truly love it. Very easy to use. Takes great pics. I just wanted something other then my phone to take pics. It easly shares my pics with my phone and email over WiFi.", "Date": "March 9, 2014"}, {"Title": "Not the best", "Author": "lambergini", "ReviewID": "R2BI8M0Q0XCMO0", "Overall": "2.0", "Content": "While small and sleek design, the shutter release was very hard and required a lot of force causing the camera to be shaken and result in blurry pictures.  Also no burst mod and changing between self timer and scenes required multiple steps causing those precious moments to be missed.  NOT IMPRESSED.  Returned.", "Date": "March 6, 2014"}, {"Title": "good", "Author": "anthony", "ReviewID": "R2QXVXFSEW64BN", "Overall": "4.0", "Content": "I like the picture quality, shutter speed is very good. Cool picture. Memory space low. Wish it had much more. Processor and. Wii fi very good", "Date": "March 4, 2014"}, {"Title": "Outstanding", "Author": "Tracy Fitterer \"cup_crazy\"", "ReviewID": "R2DF5LZR2Q3LWG", "Overall": "5.0", "Content": "You can't beat this camera. It's current with its ability to send pictures right from the camera, plus it takes great pictures and videos. This is one fantastic camera for a great price.", "Date": "March 3, 2014"}, {"Title": "Its ok, but not perfect.", "Author": "M. Roberta Mearls", "ReviewID": "RM1BV0V4V8BC7", "Overall": "4.0", "Content": "I love the camera itself but the memory disc is so tiny I have trouble getting it in and out of the camera. Also the instruction booklet is terrible. I still have not found the zoom option.  . I bought this because it is a Samsung and the price was right.", "Date": "February 27, 2014"}, {"Title": "Excellent Modern Compact Camera", "Author": "RAGHAVENDRA", "ReviewID": "RIYHQSHVOU2SB", "Overall": "4.0", "Content": "Excellent Modern Compact Camera, I able to get high quality pictures, easy to handle, good design, user friendly. I appreciate the Wifi and other features. Overall a good camera. I highly recommend to anybody.", "Date": "February 27, 2014"}, {"Title": "Excellent compact camera", "Author": "Jose Quintana", "ReviewID": "R3LU1HP5KBH9CI", "Overall": "5.0", "Content": "Excellent Samsung Compact Camera. High quality, good design, unbeatable price, has wifi, well it is a very modern camera. If I had a \"but\" is that it is not touch, but otherwise excellent", "Date": "February 22, 2014"}, {"Title": "Small and Nice", "Author": "K. Schroeder", "ReviewID": "R1IV9O4BSVK868", "Overall": "5.0", "Content": "It's perfect for when you are on the go or just to have it on you. Takes great pictures too.", "Date": "February 18, 2014"}, {"Title": "Great for the cost", "Author": "L. Rains", "ReviewID": "RKT7XM9AV6CC0", "Overall": "5.0", "Content": "Very nice little camera ! My husband is in real estate and finds it very easy to put in his pocket and go.", "Date": "February 18, 2014"}, {"Title": "Christmas gift to two of my grandchildren.", "Author": "Lexilou", "ReviewID": "RK8DITKQ0VFQY", "Overall": "5.0", "Content": "They are very happy with the cameras. A beginning of a great hobby. Daddy is a professional photgrapher and he is able to help his 8 year old and 10 year old children learn the joys of photography.", "Date": "February 17, 2014"}, {"Title": "Excellent", "Author": "joylin", "ReviewID": "R1XC1GKBDXL85C", "Overall": "5.0", "Content": "I got this for my mom who is going on a mission trip to Israel in Nov. of this year. She loves how easy it is to use and how small and convenient it is!", "Date": "February 17, 2014"}, {"Title": "Great Camera!", "Author": "Julie Stinson", "ReviewID": "R3S8Q2ZJBCAZ2Z", "Overall": "5.0", "Content": "This is a great camera! It was easy setup and very user friendly! Works perfect. I would recommend this little camera to anyone who wants a nice alternative to the camera on your phone. This takes better pictures and you can easily transfer the pics to your phone or tablet using your wifi.", "Date": "February 13, 2014"}, {"Title": "Great camera!", "Author": "don1251", "ReviewID": "R18XHERJVJA0FX", "Overall": "5.0", "Content": "This camera takes great pictures and movie clips. Thank you. The instruction manual is very limited on info. Recommend downloading the entire instruction manual from the website.", "Date": "January 30, 2014"}, {"Title": "A gift for Mom", "Author": "La Chula", "ReviewID": "R3NAU6IXGASHLC", "Overall": "5.0", "Content": "It was a gift for my Mom and she loved it!! It's easy and convenient. So glad she loved it.", "Date": "January 11, 2014"}, {"Title": "Excellent quality", "Author": "Macario Hernandez", "ReviewID": "R18OPKRZGDIQGS", "Overall": "5.0", "Content": "I choose this rating because the item works just fine. And for an excellent price. If you see this product don't think twice. just buy it :)", "Date": "January 3, 2014"}, {"Title": "A bday gift", "Author": "Amy w", "ReviewID": "R3S8J20L4HCL78", "Overall": "5.0", "Content": "This was  a birthday gift for my mom and and she loved it! It was exactly what she wanted. The pictures are hight quality. She posts online and very reasonable price.", "Date": "October 20, 2013"}, {"Title": "an awesome tiny little thing", "Author": "dale on the bayou", "ReviewID": "R1Y2W1TO0771N5", "Overall": "5.0", "Content": "It takes great pictures.  The battery is charged in camera--a very good thing.Autobackup to PC, mobilelink to smartphone, and email over wifi works very well.  No need for cables to do those!  However, I cannot get Facebook or Picasa upload to work.  Both websites won't log the camera in.  It may have something to do with security, because Google sent me an email about a suspicious login attempt that they blocked.  I don't know if there is any way at all to get the camera to talk to Facebook or Picasa (Google search doesn't help.), but, at the end of the day, it maybe for the best, out of privacy/security concerns.", "Date": "October 18, 2013"}, {"Title": "very good camera", "Author": "Sugarcake", "ReviewID": "R1P9D93VGLDINS", "Overall": "4.0", "Content": "Works great and looks great....excellent size and very handy to carry around. Easy to use and pictures taken looks great.", "Date": "October 12, 2013"}, {"Title": "Great little camera", "Author": "Dhbruce", "ReviewID": "RT9HPDCIZVH7", "Overall": "4.0", "Content": "I bought this camera for my husband who is an appraiser. It's a great size for him to stick in his pocket & works great. The time between pictures is a little slow but overall a great camera especially for the price!", "Date": "September 7, 2013"}, {"Title": "Not happy customer", "Author": "Amazon Customer \"bookworm\"", "ReviewID": "R1D4YCSFQJS6W7", "Overall": "1.0", "Content": "It keeps freezing every time she takes a picture! We have to take the battery out to reset it. Takes great pictures, but we have lost out on a lot due to it freezing up.", "Date": "February 7, 2014"}, {"Title": "Just what I was looking for; fast to use, compact to carry, excellent quality photos!", "Author": "scifiguy72", "ReviewID": "R3DWSHB0GUOYM1", "Overall": "4.0", "Content": "This was purchased as a used camera, in close to excellent shape. It is working well, as described by the seller. It fits my needs for a quick grab & shoot camera, producing quality photos. Instructions for how to use the camera, for it's multitude of functions, did not come with the camera, but was easily obtained on-line through the Samsung web site. I bought a carrying case & a flash/SIM card (from Amazom store) which gave me protection for the camera & greater photo taking capacity. The camera fits my needs, is easy to use, & produces quality photos. The WiFi function & video capability are extra bonuses in this handy little camera. Internet connection is quick & easy to use.", "Date": "January 3, 2014"}, {"Title": "Awesome Camera!", "Author": "itscalang", "ReviewID": "R1JZM68PKX12MV", "Overall": "5.0", "Content": "this is an awesome camera!  The Wifi and social media features are very convenient especially when you are in a foreign country without your personal cell phone.  I was still able to post my pictures on facebook and send pictures by email through this camera!", "Date": "November 26, 2013"}, {"Title": "Exactly what I was looking for. It's comfortable, nice color, conects to Internet.", "Author": "RUDDY SANCHEZ", "ReviewID": "R3O14341IU0XPQ", "Overall": "5.0", "Content": "Exactly what I was looking for. It's comfortable, nice color, conects to Internet. I didn't have a camera, so I needed.", "Date": "November 21, 2013"}, {"Title": "Takes Horrible Pictures", "Author": "Cub Fan \"Go Cubbies!\"", "ReviewID": "R2XYZ9P5K9EDOT", "Overall": "2.0", "Content": "I was greatly disappointed in this camera. There are two main settings for auto picture taking \"Smart\" and essentially auto with some ability to alter settings. Regardless of which setting one is on, all the pictures come out either over-exposed or blurry. I did not try the Wi-Fi feature (couldn't get past the lousy picture quality), so I cannot comment on that. The one plus is how fast the camera resets in between each picture, i.e., there is little lag time so you can take fairly rapid pictures.I would suggest purchasing a different model camera until Samsung spends more time on the picture quality - I have to wonder if the manufacturing costs went solely into the Wi-Fi feature.", "Date": "September 8, 2013"}, {"Title": "My second go round", "Author": "Linda G. Williams \"Linda G.\"", "ReviewID": "R334UM90ZFSSTG", "Overall": "5.0", "Content": "I love this camera. It is light weight a beautiful color takes beautiful pictures. I like to uplaload pictures to my smart phone. It is also easy to operate.  This is the second one I have purchased. Saved $40 buying it on Amazon.  Arrived quickly too.", "Date": "October 9, 2013"}, {"Title": "Great Camera", "Author": "Paul V.", "ReviewID": "R1RZVDTN9LKEZP", "Overall": "4.0", "Content": "This camera is very compact yet takes great pictures even in low light.  The features are useful and easy to access. The USB connectivity is convenient, there's no special software needed to transfer pictures to a PC.  Wi-Fi can be used to transfer to a phone or directly to social sites.", "Date": "August 14, 2013"}, {"Title": "I kinda don't love this camera", "Author": "Robin Hood \"We're All Mad Here\"", "ReviewID": "R217FESE9TN6JS", "Overall": "3.0", "Content": "I bought this for Dragon Con, so I could take a camera without having to take a CAMERA that would not go well with my costume. I also wanted to be able to upload what I thought would be many many pictures over wi-fi so I could clear them out at night if necessary.Frankly, I think the camera could use some better documentation, or a user support group or something.I will freely admit that most of my problems are more than likely user-error problems that could be fixed with some patience or instruction or something, but this camera takes lousy pictures.It's not even that the picture quality is bad, it's that when you push the shutter button, NOTHING HAPPENS.  Great moments would slip away before I could make the camera understand that I REALLY wanted to take a picture of whatever was in front of me.  No amount of jiggering with the settings helped:  outside, inside, bright lights, low lights, the camera missed them all because the shutter lag is awful.  I even tried taking pictures of my parents (lazy, motionless, unmotivateable) dog when I got home, and it couldn't adequately capture a sleeping blue heeler.  He was always out of focus.  I must reiterate:  He never moved from his spot on the floor.  If I can't capture a dog that's not moving, there is no hope at all of being able to catch people in costume as they stroll past.  I am willing to take any advice anyone can offer me, and I will be glad to change the rating of this camera if I can get it to take good pictures.  I elected not to take it on vacation this year, as I wanted to actually take pictures, and not get the tail end of something as it goes past.On an unrelated note, the camera is indeed small enough for a small purse or a back pocket.  The size and weight are both very convenient. I didn't try the wi-fi function because I never got any good shots. Now, if it just made usable pictures.", "Date": "October 23, 2013"}, {"Title": "I need the 'text' function to take picture from archival materials. The result of this camera was terrible.", "Author": "shawn foster", "ReviewID": "R1M75OO6X3CARA", "Overall": "1.0", "Content": "I need the 'text' function to take picture from archival materials. The result of this camera was terrible. A friend of mine has a camera of the same model, but without wifi. Her camera works fine. So I don't know the one that came to me was a single case or not.", "Date": "September 23, 2013"}, {"Title": "Great pocket camera!  Wifi is cool", "Author": "Daniel Shannon", "ReviewID": "RTUBG88AMUHJR", "Overall": "5.0", "Content": "Nice little camera.Hi-res allows some pretty decent digital zooming beyond the 5x optical.  Start-up and shutter release time are quick except when using the flash repeatedly.Loaded the app on my iPad a can preview, zoom and fire the shutter from the iPad. Good selection of scenes and filters/effects.  Smart Scene really is pretty smart.  Macro close-ups works better than any small camera I've owned.  Low light shots are noisy; use the flash, turn on some lights or get out your big DSLR. Digital image stabilization isn't as good as optical IS but it works well within limits.Considering features that actually work, size and price it's worth 5 stars.", "Date": "August 26, 2013"}, {"Title": "Ok image", "Author": "B. Rudder \"Bong\"", "ReviewID": "R22POEMNJ72N1T", "Overall": "3.0", "Content": "I had to charge right out of the box - so took a while to see image quality which turned out to be fair...colors are a bit washed out on auto settings.  Need a memory card - only 3 photos without it. I bought it for wifi and in an effort to start a Samsung ecosystem (cell phone, tv, tablet etc.) . for the price I guess I cannot complain.", "Date": "July 23, 2013"}, {"Title": "Worse Than My Smartphone Camera", "Author": "Paul", "ReviewID": "R22X17PLX220SH", "Overall": "1.0", "Content": "My god this is a terrible camera. Yes, it has a lot of megapixels, but the software on the camera is terrible. It DOES NOT FOCUS well, it DOES NOT AUTOMATICALLY SYNC TO SKYDRIVE AS ADVERTISED, it has TERRIBLE FLASH.The ZOOM IS SLOW. The COLORS ARE WASHED OUT.Really, I was so excited for this camera. The biggest feature for me was the Skydrive/Onedrive integration, which it barely has. YOU CAN'T WIRELESSY SYNC VIDEOS TO ONEDRIVE. You get an error saying video files cannot be transferred. I needed to shoot some video, and I had to delete a great take because it NEEDS TONS OF LIGHT. Seriously, my phone camera, even when not using its flash, does a better job on all fronts. And it's not an amazing camera on my phone. My phone's camera is 8.7 MP, on a Lumia 925. This thing claimed to do a better job, and it sucks.Like many of Samsung's products, this relies on the famous brand name to sell itself, despite being a terrible product.", "Date": "March 11, 2014"}, {"Title": "Great Point and Shoot", "Author": "April", "ReviewID": "R3R9BMN2W4PASY", "Overall": "5.0", "Content": "Love the small compact size.  Takes great pictures, easy to use.  Navigating the menu is kind of a pain.  Overall good camera for the money.", "Date": "February 21, 2014"}, {"Title": "Camewra probably good, instructions lousy", "Author": "FRANK M SHEPARD", "ReviewID": "R1UUCH1IVV76IG", "Overall": "2.0", "Content": "Instructions were impossible, even when printing out from their website. By trial asnd error, I have barely been able to make reasonable pictures.", "Date": "December 6, 2013"}, {"Title": "Cool Little Camera", "Author": "Clifford H.", "ReviewID": "R2HF5BOXE7Q1RV", "Overall": "4.0", "Content": "I like the camera it was a good price. I got a bundle with extra after market battery,8gb memory card, case and a bunch of other little goodies.  I was surprised it was so small. I have taken a few pic's but haven't really put it through the entire menu.  One thing about it is that the menu or home is a little to much work. When I get used to it I will probably be just fine with it. I was used to my old Kodak CX700 3.2 MP It was so simple but the aa batteries wore out fast. also my flash quit. I read that someone said that they pressed the button to take a pic but nothing happened.  They should Download the user manual and read it. I think it's got a lot of options and well worth the price. I am not a camera pro but I Like to take good clear pic's and this little camera does the job.", "Date": "October 27, 2013"}, {"Title": "Great little camera!", "Author": "A E D III", "ReviewID": "REB7TBSU5TGGP", "Overall": "4.0", "Content": "For the price, this camera takes good pictures and is fairly easy to use. Many people have stated it that the WiFi setup is a little testy but once you get it working it works well. You will need to get a microSD memory card to go with it as the built is memory is almost nothing. I got a 16gb card and that seems sufficient. PC sync is very easy, as is installing software to the PC directly from the camera. I am happy with this purchase.", "Date": "October 11, 2013"}, {"Title": "terrible picture quality", "Author": "Tyler Sondag", "ReviewID": "R2RO7QUEFSEHIP", "Overall": "2.0", "Content": "My cell phone and 2MP camera both take better pictures.  The wifi feature is nice though, and the size of the camera is great -- but these features don't make up for the terrible picture quality.", "Date": "August 11, 2013"}, {"Title": "Great pictures, easy to use", "Author": "Baltazar Valdez \"Kerns00\"", "ReviewID": "RBYWEA60XKU5B", "Overall": "5.0", "Content": "This camera is great! I have a Galaxy S4 and it pairs up with this under WiFi pretty easily :) You have to download an app (forgot the name) and once opened and paired up, it only takes 5 seconds for each photo to transfer from the camera to the phone to be viewed instantly on the phone.  Very good quality pics and the camera feels great as well.  Has not bugged up and it started working right out of the box.  The battery is very good as well (fast charge, too).  I was taking pictures and video off and on and it still lasted about 2 days.  I didn't let the charge completely drop though, but it did go down to one bar.  The \"Smart camera\" features work really well and adjust depending on the what the lighting and scenery is.  I am very satisfied with my purchase, thank you!  If you're looking for a basic point and shoot camera, then this is the one for you.  It takes greats pics, very easy to use, CHEAP, and easy to transfer pics from the cam to you cell phone in seconds. :) Great job, Samsung.", "Date": "July 13, 2013"}, {"Title": "Great for the price.", "Author": "Rene B.", "ReviewID": "R10Y4KVWO4NNWH", "Overall": "5.0", "Content": "Great little camara. Easy to use and easy to send pictures to my I-pad. Pictures come out great. Also I like all the extra features to make my photos unique. For the price, more than I expected.", "Date": "June 6, 2014"}, {"Title": "Good but....", "Author": "Nancy Andrew \"seeker of the Grand Tome\"", "ReviewID": "R2EO7JWJTEFFWM", "Overall": "3.0", "Content": "Had trouble with it out of the box... Kept getting error message and the lens would come out then immediately  go back in.  A filmmaker friend  suggest a Hard Start.... Ie : banging it down sharply on it's bottom edge, on the table , as it was starting up... And it worked !  Fixed the problem. It does take very nice images and works well otherwise", "Date": "June 5, 2014"}, {"Title": "small size, nice operation, lacks stabilization feature and as a result, more blurry pictures than expected", "Author": "P. Steinkamp \"peat\"", "ReviewID": "R2ZWG2MX6XPTBM", "Overall": "3.0", "Content": "Looks nice, appreciate the small size.  Did not realize how significant not having the stabilization feature would be.  My fiance wants a different camera.  This will be backup.", "Date": "June 3, 2014"}, {"Title": "great camera!", "Author": "rosita", "ReviewID": "R51GPF9AWLPYG", "Overall": "5.0", "Content": "I am not a professional photographer, just a proud mommy and this camera helps me take great pictures of my kids. Very small, fits in my jean pocket, super slim. I have the option of using Wi-Fi to have the pics sent to my phone; however I have not used this feature.", "Date": "June 3, 2014"}, {"Title": "Small But Mighty", "Author": "JD", "ReviewID": "RKRA9JV592258", "Overall": "5.0", "Content": "I love how compact it is! I like to take it with me hiking and it gives me great picture quality for the price!", "Date": "May 30, 2014"}, {"Title": "Samsung Camera", "Author": "kbrown", "ReviewID": "R2OLPPEDZ91ILG", "Overall": "4.0", "Content": "I chose this camera because I have a Samsung phone and like how I am able to transfer my pics from there to my phone, the camera is something you have to get use to in order to make sure you know all the functions and how to use each one. I am still learning.", "Date": "May 29, 2014"}, {"Title": "My opinion about this device", "Author": "ADHEMAR VASQUEZ", "ReviewID": "R21Y1NUEV0SN5L", "Overall": "4.0", "Content": "is a good camera, have basic funtions, is a good opcion easy to carry in vacations or to do differents works", "Date": "May 20, 2014"}, {"Title": "Good camera", "Author": "Yudeika L.", "ReviewID": "R3J94TMKJ7JMT4", "Overall": "5.0", "Content": "The product came to me in good conditions continue to hope so. This device is of good quality I recommend it.", "Date": "May 13, 2014"}, {"Title": "excellent", "Author": "Stefanny Arevalo", "ReviewID": "R11NW59QGXQ3YJ", "Overall": "5.0", "Content": "excellent product between many types of capture, as retouch photo, moving pictures and more, very thin excellent size.  totally recommended", "Date": "May 9, 2014"}, {"Title": "No better choice!", "Author": "Lucas", "ReviewID": "R1X9EXN0SXQQG5", "Overall": "5.0", "Content": "To start off, I must acknowledge how small this device is.  It is incredibly thin and a lot smaller than most cameras.  I ordered this from Amazon Warehouse Deals and came early, so I quickly started it up.  It was very easy to set up, and with a few tweaks I had the camera set to just how I wanted it in no time flat.  Then (of course) I gave it a test run.  I set it to \"Smart Camera Mode\" which lets the device decide if it is a close up, far away pic, etc.  I took a picture of my bedroom with it with no tripod or anything, and, I must say, it came out crystal clear.  I used to have an old Kodak Easyshare 5.0mp given to me, and it took pretty grainy pictures even at its top quality setting.  This blows it away.  I also tried taking pictures of things far away and even with the subject far away, it STILL had the sharpest of details.  I haven't fully tested the video recording yet, but it still seems promising.  And sharing is easy.  It did take a minute to figure it all out, (I refuse to read directions for this stuff.  I like figuring it out myself.) but once I did, it was incredibly easy to attach pictures on Facebook, email, and all kinds of stuff.  Plus, the Moble Link and Remote Viewfinder are a very nice touch.  I really like the fact that you can see yourself when you want to take a picture AND tell the camera when you want to take it.  Plus I like being able to download it to my phone and show it to my friends on a bigger screen.  If you want or need a camera that takes great pictures and lets you share them with others, there is no better, more portable choice than the Samsung ST150F.", "Date": "May 7, 2014"}, {"Title": "Seems OK so far", "Author": "Michael E Slaughter", "ReviewID": "RKF5S3ZG2W8T9", "Overall": "4.0", "Content": "I purchased this camera to have something to take vacation pictures with other than my cell phone, expecting that it would be easier to use and take better pictures.So far, I seem to struggle to get pictures as good as get on my Nexus 5, which isn't the best camera phone.I would also like to see more cloud options such as sync to Dropbox or Google PhotosI do love the size and style, quick start up, and the options available for both still photos and video.  I will get a better chance to really use the camera on upcoming summer vacations.", "Date": "May 5, 2014"}, {"Title": "love it", "Author": "Kadee Carpenter", "ReviewID": "R29PY27XFD4KJS", "Overall": "5.0", "Content": "GREAT CAMERA, works perfect, would recommend to anyone and everyone. it is very lightweight and takes flawless pictures every time", "Date": "May 4, 2014"}, {"Title": "Great Camera", "Author": "Author SkLogsdon", "ReviewID": "R1562ZQJRK4R2I", "Overall": "4.0", "Content": "I am very happy with this camera it has tons of features and the fact that it uploads directly to Skydrive and facebook is a life saver. The only thing I haven't gotten a hang up quite yet is the way to take the best pictures at all times, because it has so many choices and no real understanding on which setting is best for each type of photo, you are left fiddling around with it. Also I take pic on the self adjust but I have to keep flash off of the auto setting because the flash ruins most of the photos. --- But overall I am happy with my purchase. Considering the wi-fi feature, is awesome and a great value for your money.", "Date": "April 28, 2014"}, {"Title": "I have to use the telephoto to get the shots I'm used too", "Author": "J. Evans \"Value Shopper\"", "ReviewID": "RK118XRY4913D", "Overall": "3.0", "Content": "It is a great little camera and cheap, but my first experience with it was to take a picture of me and my new girlfriend at dinner and the field of view at 5 foot was more background than us.  That is my big negative and one that I think people should know about.Outside of that it is a great camera.  The menus are well thought out and easy to use without reading the manual.  It uses a standard micro usb cable (a big plus) to charge.  It doesn't take any special software to load pictures to you computer.  I have not yet tried to use the Bluetooth transfers but few cameras at this price range offer it.The camera offers a 5x optical zoom but I for normal shots I would have liked to have the lens at 2x just to start.", "Date": "April 24, 2014"}, {"Title": "I bought several as gifts", "Author": "Suwanee Mom", "ReviewID": "R1D582UETBP4EZ", "Overall": "3.0", "Content": "I bought several of these as gifts (here and other places) and they're \"ok\", not great. I bought one for myself and it's just ok, wish I had done more research.", "Date": "April 21, 2014"}, {"Title": "Pretty small for my big hands.", "Author": "Virginia Duke", "ReviewID": "R3NVNGR98U8T5H", "Overall": "4.0", "Content": "This camera is pretty small and I have pretty big hands.  So it is a little awkward to use sometimes.  The focus keeps reverting back to some weird setting and every time I use the camera I have to reset it.  Otherwise, I like it because it fits into a small pocket in my purse, so I have it with me all the time.", "Date": "April 18, 2014"}, {"Title": "Excelent camera.", "Author": "Victor F.", "ReviewID": "RK39FT34LQRDC", "Overall": "5.0", "Content": "It is very small and you can obtain very goods pictures and video. It has a wonderfil WiFi system and a very good battery. I recommended strongly.", "Date": "April 17, 2014"}, {"Title": "Terrible Quality", "Author": "Isabella J.", "ReviewID": "R17UW7DVRS3DR3", "Overall": "2.0", "Content": "Any cellphone can take better pictures than this. Blurry and low quality. The only good thing is the wifi and long battery life", "Date": "April 16, 2014"}, {"Title": "slick pocket camera", "Author": "truckerjoe", "ReviewID": "RLET7K305LE9Y", "Overall": "5.0", "Content": "Incredible lil camera that fits in my pocket some times even forgetting its there which was great for our vegas trip! I love that its able to connect to email and send out to friends and family and still alot of extra stuff that I still have yet to figure out since Im a real caveman when it comes to computers. Course to a proffessional photographer it may not be enough but for your average joe....the pictures are awsome quality and would definetly recomend. Samsung makes super cool products like my phone, tv etc. and I  just keep buying!", "Date": "April 12, 2014"}, {"Title": "great little camera", "Author": "Ralph Bowman \"fan and friend\"", "ReviewID": "RD4KCAAKAPDFV", "Overall": "5.0", "Content": "A wonderful compact light weight camera that even a Sr citizen can use.  Terrific price. A very pleasant surprise.  Highly recommend it.", "Date": "April 10, 2014"}, {"Title": "samsung camera", "Author": "kim", "ReviewID": "R2OXQAW11APHM", "Overall": "4.0", "Content": "Takes great pics, zooms very well from distances, easy uploads to internet , compact for easy storage, easy to follow instructions.", "Date": "April 7, 2014"}, {"Title": "Perfect", "Author": "Daniel", "ReviewID": "R119TYDH6GMOAZ", "Overall": "5.0", "Content": "great product! perfect to take some shots with the family! i recommend this product! for a low price great performance!", "Date": "April 3, 2014"}, {"Title": "Excellent, Excellent Camera", "Author": "S. Ferrer \"coolnana96\"", "ReviewID": "R33NE0TZ2MZIL8", "Overall": "5.0", "Content": "This is the easiest, smartest camera I have ever had. It fits perfectly in your hand and responds very quickly when taking pictures, no lagging at all. I am very, very happy with my purchase. The pictures are so crisp and sharp. Its really unbelievable especially when your taking pics of animals that are always moving. I have not taken a bad picture yet. Love, Love , Love this camera.", "Date": "April 3, 2014"}, {"Title": "Sharp Pictures, Sharp Video, User Friendly", "Author": "Thomas E. Anderl", "ReviewID": "R1KMJI0D5Q1IKD", "Overall": "5.0", "Content": "great camera ...sharp pictures and video's...i'd buy it again and for the price....well worth it!  I looked for this for two years.", "Date": "April 3, 2014"}, {"Title": "I like it", "Author": "Jewel Justice", "ReviewID": "R366308NC8UGUF", "Overall": "4.0", "Content": "it works good and I like it. I would order it again if needed I am happy with it and I like the pictures it takes.", "Date": "April 2, 2014"}, {"Title": "I Love this Camera", "Author": "Fujishima Akiko \"Japanese stuck in the West.....", "ReviewID": "REMJR3MICT8U6", "Overall": "5.0", "Content": "For the price, this is a great camera.  I almost didn't buy it, because some people complained of \"bury\" photos.  I'm not a novice, but I'm not an advanced or even intermediate photographer, and even I have to say, you'd have to be a complete moron not to know how to use this camera.. Blurred photos have not been a problem for me.. I love the macro function.. the frame functions add a bit of fun to photos.. The zoom, isn't the best, but, one should not expect that to be excellent in a point and shoot camera.. If you know what you're getting, 5 stars is a normal review.. Don't buy this and expect DSLR quality.. but as far as point and shoot goes, this is a great camera, with great definition, and the audio sound for the video function is great.. It blows my previous Samsung out of the water.", "Date": "April 2, 2014"}, {"Title": "nice camera", "Author": null, "ReviewID": "R20VG6CD5D94N2", "Overall": "4.0", "Content": null, "Date": "April 1, 2014"}, {"Title": "amazing picture", "Author": "CHRISTIAN", "ReviewID": "R3JXQNOFUJKOVN", "Overall": "5.0", "Content": "I bought this because I wanted a nice camera that could share pictures with my cellphone so that I wouldn't have to copy every thing on the computer to be able to upload it to my social media. Although I couldn't send the pictures to my phone because my phone wasn't compatible, I absolutely love this camera. The pictures are beautiful and very clean I can email myself and friends and families from the camera. I really love this camera and hope to keep it a long time.", "Date": "March 17, 2014"}, {"Title": "blurry photos.", "Author": "L. Orendorf", "ReviewID": "R3M8UUAZ49H8ZY", "Overall": "2.0", "Content": "I was disappointed with the picture quality. When in auto mode the photos come out a.bit blurry. I was very disapointed.", "Date": "March 17, 2014"}, {"Title": "Excellent article.", "Author": "Heindery Perea", "ReviewID": "RFQ0BU0GXKUD8", "Overall": "5.0", "Content": "Love the article, I'm very happy with the product. Recommended entirely. The design is very cute and the product is of excellent quality.", "Date": "March 16, 2014"}, {"Title": "More than I expected", "Author": "Cathy Thompson", "ReviewID": "R20798CVG9UIXH", "Overall": "5.0", "Content": "I just took this camera to Europe.  Love the ability to email photos right from the camera, loved the easy panorama mode.  There are so many things it can do! I am still learning them all.", "Date": "March 15, 2014"}, {"Title": "Great for simple people", "Author": "luis gonzalez", "ReviewID": "R3HYIP4K9GSPTH", "Overall": "5.0", "Content": "It's a great camera to take life moment pictures but that's About it. It small which is very good to fit in pockets", "Date": "March 12, 2014"}, {"Title": "nice camera", "Author": "anderson", "ReviewID": "R33SESXF4OFZB1", "Overall": "5.0", "Content": "Small compact....love it ...wi-fi great high quality pictures great for the money....great zoom clear viewing....would recommend this to someone looking to purchase one....No complaints so far", "Date": "February 12, 2014"}, {"Title": "Great Camera, Beautiful Pictures, Samsung Delivers!!", "Author": "K. W. Allen", "ReviewID": "R1JF8TDBQTGYA1", "Overall": "4.0", "Content": "This camera went way past my expectations. The pictures come out beautiful, even in bad lighting conditions or moving objects. Excellent value for this camera.", "Date": "February 11, 2014"}, {"Title": "Cool Camera", "Author": "Cori", "ReviewID": "R18WQ48BIL8I1U", "Overall": "5.0", "Content": "I am happy with this camera. The wifi feature is very cool. The color is very modern. Some of the pictures did not come out very good but I believe that is because I used the SMART feature instead of setting my own.", "Date": "February 11, 2014"}, {"Title": "very nice camera", "Author": "A. FUSON \"lemans1969\"", "ReviewID": "R37TF7Y7Z0EDUH", "Overall": "5.0", "Content": "This is a very nice camera. Quick shipping. The Wi-Fi option is great. It's a little hard to get used to at first, as is any new electronic device, but once you learn it, it's great. Not too many instructions, which obviously, is not the sellers fault.", "Date": "February 11, 2014"}, {"Title": "worth for the money!!!", "Author": "srividya", "ReviewID": "R2KLN8CK3KQTMJ", "Overall": "5.0", "Content": "great one.. very handy..can be used single handed.. huge display..wifi enabled. multiple modes to select from. night shoot mode is also awesome", "Date": "February 4, 2014"}, {"Title": "Great Little Camera", "Author": "Jason Majeski \"eticamorali\"", "ReviewID": "R23685W407Q2TM", "Overall": "5.0", "Content": "This is a great little camera and for the price you can't beat it.  My favorite feature is the fact that you can sync with a tablet or smartphone while you are taking pictures!  Way cool.!", "Date": "February 3, 2014"}, {"Title": "sleek", "Author": "effie711", "ReviewID": "RI1IMX6O8WU3P", "Overall": "5.0", "Content": "this is a nice camera, it is easy to use, it takes nice pictures, and it is sleek and pretty", "Date": "January 27, 2014"}, {"Title": "Child friendly - great pics", "Author": "Angela J. Davis \"AJD\"", "ReviewID": "R1A6SBMW8MYC9O", "Overall": "5.0", "Content": "We bought this for my 11 year old daughter for Christmas.  It is point and shoot ready for her to use but when we borrow it we can 'tweak' things to our specifications.  The pictures are sharp and clear.  A great buy for the money.", "Date": "January 26, 2014"}, {"Title": "great camera for my 11 year olds birthday, and I am jealous of the features she has that my samsung doesn't", "Author": "ndcColorado", "ReviewID": "R2VILSIG3PR1QJ", "Overall": "5.0", "Content": "I have two other samsung cameras, that don't have wifi. That is such a convenient feature!  My daughter takes a LOT of pictures while they play, and we have used it for legitimate reasons, like taking pictures while she conducted her experiments for the science fair.  When we uploaded the pictures, they were HUGE files (1.5 to 2 mb each) when she used the full 14 megapixels.  So we decided to cut back the resolution so she can upload more of her silly little pictures and videos and still enjoy them. If we need really high quality photos, we can easily switch it back to higher resolution.There are so many options that she is able to do a lot with it.  The \"smart\" features seem to work quite well. She is able to just point and shoot without making a bunch of adjustments. With my older samsung, I have to make a lot of adjustments and try different ones before I find the right one for the best results.This camera has a lot of options for uploading the pictures over wifi, including email, youtube, facebook, and the samsung app that comes with the phone. We had no problems connecting it to her accounts.It is easy enough to use for a child, but fancy and high quality enough that I would love to have one of my own as an adult.", "Date": "January 25, 2014"}, {"Title": "fantastic", "Author": "tracy", "ReviewID": "RN7Q5WHHMIGJ8", "Overall": "5.0", "Content": "I really love this!! the pictures are so clear, and the camera itself is very easy to use, anyone can use it. love the colour, just like the picture. great price. so all in all, I'm really happy with this camera! ♥", "Date": "January 23, 2014"}, {"Title": "Samsung ST 150F Smart WiFi Digital Camera with Optical Zoom", "Author": "Muriel Kay Swaby \"Kay Cee\"", "ReviewID": "R3IPAD3RJTYFJQ", "Overall": "5.0", "Content": "I bought this for my son, who really loves it. He was thrilled to get this camera, as he didn't have one", "Date": "January 23, 2014"}, {"Title": "Great camera", "Author": "La Jones", "ReviewID": "R83B54HA3RXGI", "Overall": "5.0", "Content": "I purchased this camera for my daughter because she really loves taking photos.  She is very happy with her camera.  She loves the color and the size.  She says that it was the best present and she was very surprised.", "Date": "January 19, 2014"}, {"Title": "We were thrilled with this purchase.", "Author": "bksfd45", "ReviewID": "R2Q3DEHI96HC9S", "Overall": "5.0", "Content": "As described in every way.  Slick styling to delight this teenager.  The size, color and zooming feature caused me to select this camera.  The price was right, also.  Thank you,  bksfd45", "Date": "January 18, 2014"}, {"Title": ":)", "Author": "Xochil Avalos", "ReviewID": "RCFHC1AUH4LZP", "Overall": "5.0", "Content": "It was a gift for my 13 year old daughter and she loved it because she can send her pics to her friends.", "Date": "January 16, 2014"}, {"Title": "Great purchase", "Author": "Alexis Kolb", "ReviewID": "R13334OSYXF0T2", "Overall": "5.0", "Content": "I bought this as a gift to myself for Christmas and it's perfect. It's small and compact it also takes great pictures. Perfect for my family gatherings and parties. I love it and it was a great purchase.", "Date": "January 16, 2014"}, {"Title": "Good for the money, could work on some things", "Author": "JC in the DubC", "ReviewID": "RF26LZET07WQ5", "Overall": "3.0", "Content": "Bought this elsewhere,  but a good deal for the price.  Pros: has wifi, 16 megapixl quality,  compact, easy to use. Cons: wifi is slow, you seem to need to enter info every time you want to log to something...which isn't easy without a touch screen, the app for your smartphone isn't compatible with all phones but there are some work arounds,  low light shots are poor but you can discard the \"smart\" setting and set up a pretty good custom setting for any type of shot.  Bottom line is if you're looking for something better than your cell cam, this does the job and then some. As far as transferring images, id stick to the traditional methods...but if you're out and about,  you can send it over to you cell or tablet with some ease.", "Date": "January 9, 2014"}, {"Title": "Good little camera", "Author": "Jason Boyd", "ReviewID": "R8T9EH0WZKO74", "Overall": "5.0", "Content": "This is a great little camera that fits right into your pocket. Its small size makes it easy to take on those on-the-go trips. Good for the everyday person.", "Date": "January 8, 2014"}, {"Title": "Even my Computer Guru Son was amazed", "Author": "married to Barry", "ReviewID": "R1W38J5FXE8ZDV", "Overall": "5.0", "Content": "Just about all cameras will take a decent family pic. But how many cameras can send the pic via e-mail just at the flick of a switch without any cables anywhere there is Wi-Fi to hook on to. Can even send to any smartphone.  Best part was it was a SAMSUNG & the price was amazing. I'm in my 70's & after a bit of trial & error, I quickly got the hang of sending the photos. Now, if money is no object; then you're barking up the wrong tree here; but this is a great gift for your child or Grandchild so they can keep you supplied with all the family photos.  I paid less than $75. Saw  others like this with a larger zoom (mine is only 5), but they wanted over $120.So I emphasize you can get good photos & send them immediately to your loved ones & the cost was minimal.", "Date": "January 8, 2014"}, {"Title": "good item", "Author": "Miguel A. De Jesus", "ReviewID": "R4BL1221J9PSL", "Overall": "5.0", "Content": "Very good product my wife love it the camera, the wifi is work very nice the picture are very good quality. Thank you for the product.", "Date": "January 7, 2014"}, {"Title": "A gift", "Author": "Perry", "ReviewID": "R3242EA84HA1BF", "Overall": "4.0", "Content": "Bought it as a gift for my boss who wanted something simple, but with Wi-Fi. She loves it! Very clear shots and easy to use.", "Date": "January 4, 2014"}, {"Title": "I love this camera.", "Author": "Susan", "ReviewID": "R2VOTDO42QHDNG", "Overall": "5.0", "Content": "This camera is the best little camera that does what I need it to do when I am out and about. Love it.", "Date": "January 3, 2014"}, {"Title": "Camera", "Author": "Magen Grappendorf", "ReviewID": "R1S35170GINA", "Overall": "4.0", "Content": "So far this is a great camera. Bought it for my 10yr old daughter for her trip to Paris so she can send us pictures she is taking on her trip. It only came with a quick start guide which was really annoying so we went online and looked up a more detailed guide.", "Date": "January 1, 2014"}, {"Title": "Perfect Camera", "Author": "Brittany Smith", "ReviewID": "R17OU568IHB9L", "Overall": "5.0", "Content": "This camera totally is exactly what I was looking for It sincs right to my phone with the samsung app that is free. You can take a pic and send it immediately to your cell or edit it right on the camera, pretty good editor on it.", "Date": "December 31, 2013"}, {"Title": "Love this convenient little camera", "Author": "Lori Ann Buckman \"LB\"", "ReviewID": "RQKHWPJ00NF88", "Overall": "5.0", "Content": "I got this camera for a vacation.  It worked perfect.  It works well with my samsung phone and uploads easily to both the phone or internet.", "Date": "December 31, 2013"}, {"Title": "Nice little camera", "Author": "Jennifer Handerhan", "ReviewID": "R17R96W7EDNK7W", "Overall": "4.0", "Content": "Like this camera, I have not had much time to play with it. From what I have used so far it is a great put in your pocket and run camera. Have not printed any pictures from it yet so not sure how good they will be. The WiFi is great and pictures load to my phone or laptop quickly.", "Date": "December 31, 2013"}, {"Title": "Love it", "Author": "Alex L.", "ReviewID": "R305268SFG0LPE", "Overall": "5.0", "Content": "You won't find a better camera for under $80. Great capture time, easy to use-on the tech scale I rank about average, and best of all no batteries needed. It's definitely not graded as a commercial photography camera, but as an everyday camera it far surpasses my expectations on pictures.The 720 HD works fine. I don't film much, but the quality is fair. Note: If you are filming in a dark room you will need a separate light sources.", "Date": "December 30, 2013"}, {"Title": "Excelent...", "Author": "Julian Amaya", "ReviewID": "RHNJCA3SE5BKL", "Overall": "4.0", "Content": "I gave it as a gift to my mother..She is very happy  that camera does what she needs..She really liked the functions to share on facebook and youtube", "Date": "December 29, 2013"}, {"Title": "Christmas gift for husband", "Author": "Miko \"MGCMako\"", "ReviewID": "R221Q43KUGLDC", "Overall": "5.0", "Content": "I bought this for my husband for Christmas, but gave it to him early, so we have been using it for a few weeks now. He really enjoys using the fun features such as the panoramic shots and the add-ons. He took a picture of himself with the magazine background and it is hilarious. We used this camera to capture images at our church's Christmas party and they were very clear and vivid. I don't know any fancy language to describe the pixels or resolution, so I'll just say that the pictures came out very clear and colorful. We just enjoy capturing photos, and this camera has been doing a nice job.There's no battery to remove, so you just charge the camera, which is nice.", "Date": "December 27, 2013"}, {"Title": "THE BEST CAMERA I'VE EVER OWNED!", "Author": "Jennifer Pruessen", "ReviewID": "R3H2G467KEQSHX", "Overall": "5.0", "Content": "I have purchased $400 Panasonic digital camera before that was as amazing as the quality and features of this little gem. It's small, sleek, has built in wi-fi so you can share your photos to email, facebook, etc. without ever uploading to a computer. To say the photos it takes are of great quality, is the biggest understatement I can ever imagine.", "Date": "December 27, 2013"}, {"Title": "wifi no bueno", "Author": "philly029", "ReviewID": "R2FN2FFMTLH77I", "Overall": "3.0", "Content": "Took pretty good pictures but quit syncing with my tablet and would only sometimes work with my phone.  The reason I bought it was to take pictures of products and send them to my tablet so I was pretty bummed and returned it after 3 weeks.  I will probably buy a more expensive camera and I just hope the WiFi features work on it.", "Date": "December 26, 2013"}, {"Title": "Its fun.", "Author": "Vinny", "ReviewID": "R39N4JL8ZKS6PX", "Overall": "5.0", "Content": "lot of good features included in this packageIts easy to operate by an amature. Even it has Wi Fi. I like it", "Date": "December 24, 2013"}, {"Title": "Takes great photos!", "Author": "Jacqueline Hale \"Retired to the Sierra mountains\"", "ReviewID": "R1MIYAVD7K7BO4", "Overall": "5.0", "Content": "It's the perfect size for a point and shoot. I like that it's WiFi enabled. The WiFi setup was a little tedious, but once setup, it's great!", "Date": "December 21, 2013"}, {"Title": "excellent but sound recording is so so", "Author": "Sarah Lipsius \"gary\"", "ReviewID": "R3IBZ7PD7NXUFL", "Overall": "4.0", "Content": "Very good photos and video the only complaint is that the audio recording is not very good...however it is very light and the auto focus feaure works very well and a great deal on amazon @ $85.", "Date": "December 20, 2013"}, {"Title": "Cute camera", "Author": "Crystal M.", "ReviewID": "R3C67HSX4QZJ33", "Overall": "4.0", "Content": "Overall I am pleased with the purchase.  The camera was a bit smaller than I anticipated but fits nicely in a small purse or back pocket.  Main disappolintment is the delay from the time I push the button to the time the picture is actually taken.  It isnt instantaneous as I typically like since taking photos of my 2 year old daughter is difficult unless I can get the pic taken the second I push the button.  I have found that is one benefit from using my iPhone vs a camera.", "Date": "February 26, 2014"}, {"Title": "Not Ubuntu Friendly", "Author": "E. Burke", "ReviewID": "R2N7DRMAKF4WD8", "Overall": "3.0", "Content": "The camera itself takes great pics, at least compared to what I had before, however the wi-fi features leave much to be desired and if you are an Ubuntu user you are somewhat out of luck.Firstly the camera arrived asking for a firmware update. To update the firmware you need to install a Windows or Mac only program on your computer which is stored in the memory of the camera. I attempted to install the app using Wine but it errored out stating that i-launcher could not be found. After much searching it appears the only way to get the app is to have Samsung send it to you, it can not be downloaded from their site. So I called tech support asking for a copy of the file and spoke to someone who never heard of linux who told me he would have to escalate the issue and have a senior tech call me back. That was 5 days ago, no one ever called back.Next are the Wi-Fi apps that come on the phone, you have FaceBook, Picasa, YouTube, and Microsoft SkyDrive.Submitting pictures to FaceBook was simple, however I had to occasionally log into facebook to confirm that I really wanted to 'allow' the pictures from my PC.Picasa is a Google product and is unsupported by my operating system.For YouTube videos (and Facebook videos) your video must be in 300x200 format and less than 30 seconds in length for the camera to upload it, which makes it fairly useless.Skydrive ironically was the most Ubuntu friendly of the apps, however it only lets you upload 6 pics at a time at max resolution and was painfully slow.Backing up to PC over WiFi is apparently impossible on Ubuntu due to the needed software not being able to be installed. Using the cable works fine, however the included USB cable is about 8 inches long so be prepared to dangle your camera from your PC while transferring files unless you have a longer cord handy.On to the menu system... it can be extremely confusing. You alternate between the Trashcan and Menu to go back a level. Hitting Menu takes you to the menu for what you are currently doing (movie, camera), the Home button takes you to a set of different menus (Wi-Fi, scene selection, etc), and the Wi-Fi button takes you to a 3rd set of menus. Its about as clear as mud.This camera also has DLNA so it can talk to my DVD player over my home wireless network, which I thought was very cool, however when accessing the camera thru my bluray player if I try to load the images folder it says 'no supported files found' and when I go to the video folder it will play, but streaming is very choppy (play for 3 seconds, stop for 2, repeat). Maybe at 300x200 it would play fine, but who wants to shoot video at that level?Overall its a 3 star camera based on price and image quality, but the WiFi features are extremely lacking and not worth the extra cost.UPDATE: I found a workaround for the Facebook issue where I had to approve all pics manually from a PC when submitting them thru the camera. If you email the pictures to your Facebook posting email address then the pics will show on your timeline without requiring approval. Using the FaceBook tool will require manual approval after the 5th picture in each new album. So you can either make a new album for every 5th picture or email them.", "Date": "February 10, 2014"}, {"Title": "5 star day shots, 1 star night shots.", "Author": "G. Harrington", "ReviewID": "R20OT2T9JLAM4C", "Overall": "3.0", "Content": "I bought this camera because I wanted something small for a trip to Disney World and although I got tons of great daylight shots it was terrible for fast movement shots and night shots.  I didn't spend much time familiarizing myself before the trip and regretted it the first day I was there.  I used the auto setting during the day and it worked great but despite trying every setting with a combination of flash and no flash I never did get a decent quick moving or night shot, they all came out blurry.  By day 2 I was switching back and forth between the camera and my cell phone because my cell took better fast moving and night pictures.", "Date": "December 14, 2013"}, {"Title": "It's Okay", "Author": "nadhia", "ReviewID": "R1X5GDICWJ4N6U", "Overall": "3.0", "Content": "Just got it yesterday..was going to return it because, but I'm going to give a try. It's smaller than I thought it would be, Picture quality is decent.", "Date": "December 12, 2013"}, {"Title": "Bad, Bad, Bad", "Author": "Amber Montee \"Book Crook\"", "ReviewID": "R2S1PA4FQQR3US", "Overall": "2.0", "Content": "no image stabilization...don't buy....get a cannon power shot....best point and shoot I've ever owned...got this because of the wifi feature, which has never once worked!!!", "Date": "December 1, 2013"}, {"Title": "Good features, decent performance, cheap feeling plastic", "Author": "Dave", "ReviewID": "R2JU6EKLK0R1E2", "Overall": "4.0", "Content": "I priced this camera out here on Amazon but tripped across it on one of those \"daily bargain\" type sites for a bit less money.I received my white ST72 only a few days ago and haven't completely put it through it's paces, but I have made some observations that may prove useful to anyone considering a purchase.My initial impression upon opening the box was \"Wow. Not much in there.\" The contents were: 1 camera, 1 micro USB cable and 1 A/C USB plug. Frankly, I don't even recall seeing a warranty statement card or quick start guide. There definitely wasn't any kind of manual or software disk. No strap. No memory card. No A/C battery charger (to charge the battery you must have the battery inside the camera and connect the camera to the USB cable; a A/C USB adapter is included).Initial battery charging took about four or five hours. I surely hope this is not going to be the case every time I must recharge. Like with most electronic devices, upon first power-up you are walked through the initialization process. I didn't find the setup commands and menu to be terribly intuitive. This was complicated by the lack of documentation. I consider myself to be very tech savvy. I have been a professional software engineer and spent 20 years running a technology consulting company, and I would say the initialization process was just a bit more cumbersome than I would have preferred. In fact, my dad would likely have just given up on the setup.After initial setup, of course the first thing I had to do was actually take a picture. I have to say, I found it pretty amusing that Samsung equipped this model with enough built-in memory to take exactly ONE picture before the \"Memory Full\" message appears. Yup, I forgot to insert my MicroSD card. I guess I don't really realize just how tiny a MicroSD card is until I have to actually handle one. Sure, I jammed one into my phone when I first got it, but that's one of those things you do once and forget. With a camera, there is a high probability that I'll be swapping out memory cards on a frequent basis and will find my heavily callused sausages for fingers to be a challenge when dealing with such a small card. Of course storage of spare memory cards is a mixed blessing as well. Small and compact, easy to store and transport, but just as easy to misplace, drop and lose while handling.After playing with the camera for the last few days I think I have enough pros and cons to post a useful review, but will edit as my experience with features grows.Pros:Very compact size fits perfectly in a shirt pocket.Giant 3\" LCD display is a nice feature on such a compact cameraVery feature-rich with tons of \"fun\" extras in both pic and video modeSo far, battery life seems quite adequateIn-camera battery charging with micro-USB cable means it's compatible with most modern cell phone chargers (including car chargers) - Major convenience when travelingCons:Cumbersome menu system with NO touch screen input will take some time to become comfortable with interfaceNo dedicated video/pic mode button; requires using the cumbersome interface mentioned above to switch modesPlastic camera housing has a very inexpensive feel and likely won't wear well with extended handlingTripod mount (threaded socket) on bottom of camera is plastic; I'm worried about it's durability over time\"Smart Mode\" in both pic and video modes resulted in low quality images when shooting indoors at night; outdoors in daylight worked very  wellMP4 video format is not compatible with Windows Movie Maker without third-party CODECNo \"pause\" feature when recording video; useful when recording instructables, etc.Summary:After my limited use, I'm not ready to send it back just yet. As mentioned above, I purchased from a different source for a somewhat lower price, so I'm feeling like I got a pretty good value. Had I paid the $85 Amazon price I'd be on the fence and have to spend time scrutinizing pic and video quality and features before deciding to keep this one. MicroSD card and no external battery charger included would have me considering some other options in this price range (perhaps the Canon A2300?)", "Date": "October 8, 2013"}, {"Title": "Amazing Camera", "Author": "Lanceshield", "ReviewID": "RUBI80UGEDSW6", "Overall": "5.0", "Content": "Can't say enough about how pleased I am with every aspect of this camera.  Replaced a Casio that I owned for 6 years that I loved, but I unfortunately broke the screen on. But this Samsung is better.  Use these cameras almost every day for work.  Had over 50,000 photos on the Casio when I broke it.  The Samsung is doing just fine on the volume.  Bought dirt cheap on Amazon.", "Date": "October 3, 2013"}, {"Title": "Great Camera", "Author": "ebme", "ReviewID": "R22YI1MRZXDGDU", "Overall": "4.0", "Content": "Perfect point and shoot camera. I purchased this for my younger brother as a starter camera and it is great. There are a few things that could be improved upon but overall a great camera.", "Date": "August 20, 2013"}, {"Title": "Wonderful", "Author": "Katherine Kristan", "ReviewID": "R19ELVXV0SH7S7", "Overall": "5.0", "Content": "I have only had this about 2 months, but I have been very happy with it. I wanted a camera with wifi for work and an upcoming vacation, and it has been wonderful. I was able to send my pictures straight to facebook while on vacation. I am so glad I bought this camera.", "Date": "May 19, 2014"}, {"Title": "I love it", "Author": "lorenzo. Flores", "ReviewID": "R2O9TYKW0I9S4H", "Overall": "5.0", "Content": "nice camera", "Date": "April 28, 2014"}, {"Title": "This Camera talks to my Phone", "Author": "nightwatch", "ReviewID": "R19S7Z38F2QEDE", "Overall": "5.0", "Content": "Preface:  not a tech guy and maybe easily impressed!  But............  Even I was able to link this camera to my Samsung S3 phone so than when I take a picture with the camera, it's sends a copy to the phone.  My phones whistles at or to me so I know it's received.  How cool is that?  The photos are excellent and the price was probably a mistake.  I had placed it in my cart or \"saved for later\" list and I checked and saw the price had gone down $20.  Not hesitating, I bought it.  With prime, I got it super fast.  Here's the funny part:  After buying it, I went back to Amazon; to the same camera page that by then noted I had bought one of these previously and saw where the price was back to the regular +20 number.  Needless to say, it made my day.  SideNOTE: have had PRIME for a few years and I like the current price.  Changed my account from automatic REbilling / invoicing so I can think about this price increase before August gets here.  Maybe if they had more British cop series or more current movies not just for children..... it would make the decision much easier and I would be that Automatic rebill customer again. PRIME is great if they don't price themselves out of customers.", "Date": "April 7, 2014"}, {"Title": "Looks and feels too cheap, you get what you paid for", "Author": "Yadamjav", "ReviewID": "R20AOKQXBPIYZ", "Overall": "2.0", "Content": "It looks too cheap, but for the price i guess okay. I didn't like its too slippery, too simple navigation buttons, i returned and bought olympus SZ-12 14MP Digital camera with 24x which was 15 dollars more", "Date": "March 17, 2014"}, {"Title": "Wrong color", "Author": "Anthony Babajko", "ReviewID": "RDP0K696QRNYP", "Overall": "3.0", "Content": "I ordered this camera and expected to be same color as shown on the order  form (dark blue) and also on shipping email form that I received from Amazon. But when I opened the package, it was black. I like the camera, but I'm very disappointed about the color. Also was told that I can not return it.Tony B", "Date": "February 8, 2014"}, {"Title": "excellent!", "Author": "Daniel Sánchez", "ReviewID": "R3OYYNI9DG3I42", "Overall": "5.0", "Content": "excellentthe camera is very good, the quality of the photos is perfectmet all my expectations, I highly recommend it!", "Date": "February 7, 2014"}, {"Title": "not bad little man.", "Author": "twf2nd", "ReviewID": "R8TUSYO1MXP63", "Overall": "4.0", "Content": "Not a bad camera for the bills, one drawback is that it does not have a micro midi setting like its bigger brother. The setting will allow you to take pics no closer than 12 inches while the larger Samsung will ollow at 3 inches. If this doesn't matter to you, then I would give it 5 stars.", "Date": "February 1, 2014"}, {"Title": "So many problems - where to start?", "Author": "RJ 760", "ReviewID": "R1N14BRAEPE960", "Overall": "2.0", "Content": "This camera had great reviews, so I was very optimistic. Reality was a different story altogether.First of all, the pictures were marginal - nowhere near as good as the old Nikon this camera was supposed to replace.The wi-fi features were a train wreck from beginning to end. First they were difficult to set up. Complete instructions were not in the box, nor was the required software. Once those hurdles were overcome, I tried to set up the Backup feature. However the camera kept forgetting the network settings and losing the wi-fi connection. Mostly it just said it couldn't see the computer it was supposed to be backing up to. Tried on two different PCs, both with firewalls turned off. I am not a neophyte when it comes to wi-fi devices. There are 10-12 other wi-fi devices on my network (it varies), all of which work flawlessly.The social networking features were no better. Camera would not remember Facebook login OR network settings, so that info had to be re-entered every time. Once entered correctly, it said the server didn't respond.I called Samsung support and got some idiot who kept putting me on hold for no reason, and knew less about the camera than I did.Finally I hung up on him and returned the camera for a refund.", "Date": "December 28, 2013"}, {"Title": "so far its awesome!", "Author": "Amazon Customer", "ReviewID": "RDVWX8CI3HLZ6", "Overall": "5.0", "Content": "im loving this camera so far. very small but packed with extras!! i love that it sends pics right to my phone or to my facebook.", "Date": "May 17, 2013"}, {"Title": "Nice but no memeory card.", "Author": "Rhonda Cooper", "ReviewID": "RFXWCYIJE8VUC", "Overall": "3.0", "Content": "We received this product, and we do like it except the memory card has no memory. My son was able to take 10 pictures of his Christmas and his memory was full. Would have liked it to come with a regular memory card.", "Date": "January 13, 2014"}, {"Title": "good", "Author": "wiston", "ReviewID": "R30J8CSA7L0DLZ", "Overall": "5.0", "Content": "excellent product what I expected I recommend, arrived on time, no problem existed not, well without any complication widely recommended.excellent product what I expected I recommend, arrived on time, no problem existed not, well without any complication widely recommended.excellent product what I expected I recommend, arrived on time, no problem existed not, well without any complication widely recommended.excellent product what I expected I recommend, arrived on time, no problem existed not, well without any complication widely recommended", "Date": "February 7, 2014"}, {"Title": "A gift of a different color.", "Author": "AlyFields", "ReviewID": "RBC7VITJANWL6", "Overall": "3.0", "Content": "I bought this camera for my daughter for Christmas and ordered the Red one. Every email and confirmation confirms this. But we got a black one.  She lives the camera and was excited but I'm very disappointed with the color error. She was here in CA but lives in TX so return IS a problem.", "Date": "January 1, 2014"}, {"Title": "amazing", "Author": "Dreah", "ReviewID": "R20WJ5M6EC4RKP", "Overall": "5.0", "Content": "i really love this camera i wanted something silver and nice looking but i didnt want to spend a bunch of money on it..im glad i got it", "Date": "August 7, 2013"}, {"Title": "Samsung", "Author": "eb456a", "ReviewID": "R32DVWO7K2XIBO", "Overall": "4.0", "Content": "through they would give the 16 GB with the camera otherwise I would have buy one at the time,I know now,", "Date": "January 4, 2014"}, {"Title": "Worst camera in the history of cameras!", "Author": "OnlineShopper13", "ReviewID": "R6621736YEZNU", "Overall": "1.0", "Content": "If I could give this camera 0 stars I would.  Camera had problems powering On and Off.  When I finally got it too power off, it did so, but the lens never completely closed and shut down in the normal flat manner.  The camera would not consistently take a picture when auto flash was on.  Worked fine when flash was turned off.  Do yourself a favor and spend a little more on a different product.  This camera is a waste of money.  I will be returning it tomorrow.", "Date": "April 7, 2013"}], "ProductInfo": {"Price": "$139.95", "Features": "16.1MP CCD Sensor\nSMART features - Social Media Upload, E-mail, Direct Link, Mobile Link, PC Auto-backup, Remote Viewfinder, All share, Cloud Service\n720p HD Video", "Name": "Samsung ST150F 16.2MP Smart WiFi Digital Camera with 5x Optical Zoom and 3.0\" LCD Screen (White)", "ImgURL": "http://ecx.images-amazon.com/images/I/41h0xHeyHwL._SY300_.jpg", "ProductID": "B00BJ60VW6"}}