{"Reviews": [{"Title": "Not \"real\" leather, and does not fit well", "Author": "Stuart \"stuwalters\"", "ReviewID": "R10X6WM5GG0NEH", "Overall": "2.0", "Content": "I purchased this case at the same time I purchased a new Nikon D5200 camera.  This case had only one review, and it was positive, so I thought I'd take a chance.  I did not like the case, and am returning it for a refund.  Here are the main reasons:* Not \"real\" leather.  After re-reading the description of the case, it clearly states that it is \"PU leather,\" which is also known as bicast leather.  Basically, this means that this case will never show age and develop a patina, due to the polyurethane which is covering the product.  (In the UK & New Zealand, the term \"leather\" is not allowed to be used with this material.)  If this case was made with leather as a base, you cannot tell, as it feels like plastic.  I did not read the description closely enough, or I might have seen this previously.* Fit.  It was advertised as being designed to fit the D5200, but I found that the fit was not that close.  Primarily around the sides, it had about a 1/8\" to 1/4\" gap that did not fit flush with the camera.  The design of the case utilizes the tripod socket on the camera to attach this case with, which seems like a pretty good idea.  Challenges with this are that the screw from the case is hard to turn, making the case hard to take on and off.  This further complicates the fact that the case must be completely removed in order to replace a memory card or take out the battery to recharge it or replace it with another charged battery.All in all, this has a design that needs some improvement, and the description should be more clearly written, so that the buyer understands what they are purchasing.", "Date": "April 10, 2013"}, {"Title": "nicely protects the camera", "Author": "GAILEMI", "ReviewID": "R1M3JWRNPUF8JX", "Overall": "4.0", "Content": "I really like this case but & it's not the cases fault but to download the images I have to take the whole case off to open the door to plug in the cable.", "Date": "December 30, 2013"}, {"Title": "Great Quality Case, Fits like a glove!", "Author": "Tim Swearingen", "ReviewID": "R1ZRFJ6A7OLYC5", "Overall": "5.0", "Content": "I chose this case to fit in my travel back with my other equipment, and also to shield my camera when I have it ready around my neck.  The leather is very nice, and the fit is perfect.  The metal camera mount screw is very high quality and fits w ease.  Shipping was very fast, and packed very nicely.  The case is also very modular, one downside is that the clips on the side of the case if you would rather attach your strap to the case instead of the camera do not have full closed clips, which is really not a big issue,  I just need to get mini chain clips instead that are larger than the clip ends, which are probably about 50 cents at the local hardware store.  It also came with a super soft micro film camera rag and a very nice bag for the camera case, which is a great bonus and good for redundancy during travel.  Great value and better than I've seen at anything in a store, made for the Nikon D5200.", "Date": "March 26, 2013"}, {"Title": "Marginal at best.", "Author": "Matthew B Lambert", "ReviewID": "R2A0GOUCF0EX53", "Overall": "2.0", "Content": "Of course it's not leather which isn't a deal breaker for me, but could fit a little tigher.  I chucked it and bought a regular camera bag.", "Date": "May 30, 2013"}], "ProductInfo": {"Price": "$59.99", "Features": "Made by excellent leather! Durable! Soft and Smooth-feeling!\nHigh quality, compact, lightweight, extremely durable material and easy to carry\nTo protect your camera against damages, dust and scratches Generic case bag\nIT DOES NOT COMES WITH NECK STRAP", "Name": "MegaGear \"Ever Ready\" Black Leather Camera Case for New Nikon D5200 Cameras with 18-55mm VR Lens", "ImgURL": "http://ecx.images-amazon.com/images/I/41EubM2jCqL._SY300_.jpg", "ProductID": "B00B2B3HOC"}}