{"Reviews": [{"Title": "Good value", "Author": "Kindle Customer", "ReviewID": "RWY3N7MWOWCNQ", "Overall": "5.0", "Content": "Everything came in good shape, and as described.  We are novices, but in the first few days we're already having fun with the camera, and it's taking nice looking pictures.  The tripod was all black (not chrome and black as pictured... but it actually looked nicer in all-black in my opinion).Note:  I bought the add-on 4 year warranty.  Initially I was displeased as when I went to register it, it would only allow for the camera itself to be covered (and not the entire package, which was upsetting because warranty pricing was based upon the bundle price).  I left negative feedback with the seller, and within 2 days they called, and offered to cover the entire bundle.  If you buy the protection, I recommend calling the seller, and not registering on-line initially (as the on-line set-up currently only allows you to register one item, and one item only).", "Date": "December 14, 2013"}, {"Title": "Defective Product with Poor follow up service", "Author": "Vinod N Patel", "ReviewID": "R22XNPGVIY0VX1", "Overall": "1.0", "Content": "I was given this camera kit as gift for my birthday and father's day. I had plans to take a lot of photos during July when I got my package early July. However, the body of the Nikon d5200 was DEFECTIVE! I was surprised that a defective product should have been mailed to a customer without making sure the product was working!!!!After having mailed back the defective Nikon body I was told by 47th Street Photo that I had to mail back the empty box the Nikon camera came in before they may process my order! So, I had to mail them the EMPTY BOX at my own cost ($7.50).To date (8/4/2013) I STILL HAVE NOT GOT MY CAMERA BODY BACK THAT I FULLY PAID WITH MY AMERICAN EXPRESS  CREDIT CARD AT THE END OF JUNE 2013.I am very upset that I have not been able to use my camera for all the important events of my family that I had planned.It remains to be seen when I shall finally get my camera and if I am not satisfied this time and comes defective then I shall be asking for a full refund.47th Street has given me very poor service and I would not recommend to buy anything from them.I would like to know how Amazon can intervene and make sure that I am compensated fully for my postage and loss of time. You have not heard the last of it from me since I am still waiting for my camera which should be in good working condition as I fully expect it to be.", "Date": "August 4, 2013"}, {"Title": "GREAT CAMERA BUNDLE", "Author": "RGW \"RGW\"", "ReviewID": "RKWMFEWC49NXF", "Overall": "5.0", "Content": "VERY HAPPY WITH EVERY THING,GOOD PRICE,FAST DELIVERY,BOXED WELL.THE BUNDLE IS BETTER THAN I THOUGHT.THE TRIPOD IS ALL BLACK NOT SILVER AND BLACK,WHICH I LIKE BETTER,IT ALL SO HAS A BUBBLE LEVEL", "Date": "September 8, 2013"}, {"Title": "Great camera, great value", "Author": "Mr Chad Peterson", "ReviewID": "R1LF5ILPKP0W2", "Overall": "5.0", "Content": "Bought this camera to upgrade from the basic digital pocket size cameras and don't regret it for a second. I am not a photographer, definitely an amateur and so far the shots have been great. We have two youngsters and you will not believe the vivid color and realistic lighting that this camera grabs. If you are on the fence, definitely pick this Nikon.", "Date": "September 9, 2013"}, {"Title": "Nikon D5200", "Author": "Pris \"PZ\"", "ReviewID": "R1IIBB8C0RPUVE", "Overall": "4.0", "Content": "I upgraded from a Nikon D3200. I gave my daughter my D3200 with all the attachments. I really like the camera except for the telephoto lens. The lens is quite stiff when installing it onto the body of the camera. I presume this will loosen up as I use the camera. So far, it has taken great pictures, has better resolution than my previous camera, and I hope to have many years of enjoyment taking pictures.", "Date": "December 27, 2013"}, {"Title": "Great Purchase", "Author": "Amazon Customer \"JFW\"", "ReviewID": "R1X6E5UA2KK24R", "Overall": "5.0", "Content": "The camera and accessories are great. You receive an extra battery and the batteries even come partially charged. This is a great camera at a reasonable price. I only wish the camera bag was a bit bigger. It barely holds the items that come in the kit.", "Date": "February 12, 2014"}, {"Title": "Perfect combination set", "Author": "Falcon94 \"James McLean, Jr.\"", "ReviewID": "R3RXHKHV0M4JDN", "Overall": "4.0", "Content": "Great camera with expansion capability. Lens selection was a good choice for me. Everything worked as indicated in the ad.", "Date": "February 12, 2014"}, {"Title": "Loving it", "Author": "curt", "ReviewID": "RKTPT0Q2Z4G5K", "Overall": "5.0", "Content": "I love this camera!  From some of the reviews I thought it may be harder to use than the canon I was looking at.  However I was able to start using it right out of the box.  The only I had to read was how to view what I was taking on the screen and not just the view finder.  It's on click of a lever next to the shutter button.  Love the sports setting for snapping tons of pictures quickly.  Works great for getting that good shot of my grandson", "Date": "January 9, 2014"}, {"Title": "Happy Customer", "Author": "C.Nicolas", "ReviewID": "R1I03O98XOJ32N", "Overall": "4.0", "Content": "Camera and equipment arrived promptly and included everything listed in the listing description.  I was hesitant to make such a big purchase online but was relieved when I received my order and everything worked correctly.  I would recommend this seller to anyone looking for a great deal on cameras online.  Thank you!", "Date": "November 4, 2013"}, {"Title": "Just about impossible to take a bad picture", "Author": "Chris", "ReviewID": "R1Q7IRY4CRCLFN", "Overall": "5.0", "Content": "Great value for the money!  I have used this camera on quite a few camping trips and I think I've managed to take maybe one bad picture out of hundreds, and that was my fault for using the wrong lens.  Pictures are rich and detailed and the camera feels very substantial and high-quality.  Highly recommended!", "Date": "October 31, 2013"}, {"Title": "very nice but busy", "Author": "Barbara Palmieri", "ReviewID": "R1HEZD0E2N5XV9", "Overall": "4.0", "Content": "I have to say it takes the greatest pictures of any camera I have owned.  Takes a lot of practice to get it do take the kind of pictures you want.  The instructional video is not good at all.  Too fast.  By the time you found the button they were talking about it was on to the next.  Thank goodness for instruction book", "Date": "August 23, 2013"}, {"Title": "Unreal, only one complaint", "Author": "Tom Morrow", "ReviewID": "R260BTL406PBFY", "Overall": "5.0", "Content": "You have to adjust focus while filming video.  Other then that, I love this camera.  Family was up North in Michigan at Oswald's Bear Ranch and a stranger walked up and said \"Is that the 5200?\".  We talked about it for a bit and he's going to get one now as well.  I cannot be happier.", "Date": "September 20, 2013"}, {"Title": "Go for it!", "Author": "Ron Skoog", "ReviewID": "R4D8ZOWL14N1Y", "Overall": "5.0", "Content": "Recieved my camera bundle a day early and in perfect condition. What a great deal what a great camera. If you can' t decide to buy or not. Go for it it's worth every penny you won' t be disappointed!Thanks Amazon and Focus Camera!", "Date": "June 5, 2014"}, {"Title": "Great Value Bundle ....... may need faster SD Card", "Author": "lizzy", "ReviewID": "R3F01WJYFE53S6", "Overall": "5.0", "Content": "Purchased this 2 weeks age, still learning what every button does on the camera, it will take time to learn to use this camera effectively if you are a novice with DSLR cameras. Well worth the effort and time. I am, really, really pleased with camera. Using RAW picture quality, an 80 MB per second SD Card (32 GB memory) and the macro telephoto lens, I photographed a hummingbird in flight and on the nectar feeder in my yard. Photos were so good I could clearly see the bird's tongue flick in and out, on the photos taken in sports mode, and individual feathers when I zoomed in on the computer. Ecstatic about that, and other photos I have taken of birds in flight. (OK, so birds are my thing!). The SD Card that comes with the kit is 40 MB per second, so it processes the images taken at half the speed, which is too slow for the rapid shot sports mode, but just fine for one frame at a time photography. The camera is designed to work with the fastest SD Cards (90 MB per second, I believe), but they are expensive, I purchased the 80 MB at half price in a sale and am very very pleased with it.", "Date": "June 4, 2014"}, {"Title": "AWESOME!!!", "Author": "nick hunt", "ReviewID": "R2EF0R7ZZ1VSDR", "Overall": "5.0", "Content": "Awesome setup. Everything i wanted and does more than what i need. I would recommend this for anyone just starting or a seasoned photograoher...", "Date": "June 3, 2014"}, {"Title": "Nikon", "Author": "CHRIS THOMPSON", "ReviewID": "R2FPZ1I2W3U2W9", "Overall": "5.0", "Content": "It's a good dealThe 18-55mm lens was not cheep madeThe 5200 has the wireless transmitter  (the coolest  thing I have seen in a long time )The camera. Is  good this is one that you just drop it and it goes off the pic will be like a pro tuck it", "Date": "May 3, 2014"}, {"Title": "love my Nikon", "Author": "skatoonies \"loves to create\"", "ReviewID": "R314E2MFCRLR8X", "Overall": "5.0", "Content": "I love this camera.  Easy to use on auto and great value for the money.  I would recommend this camera to a beginner.  I think it's important to take a couple of beginner classes to get the full use of this camera.  Lightweight, not too bulky.", "Date": "March 27, 2014"}, {"Title": "Great camera", "Author": "Paul L Boudreau", "ReviewID": "R34LFYLGIC7D6F", "Overall": "5.0", "Content": "Great camera with all the features of a much more exspensive  camera, the price was great with two lens and value and style.", "Date": "March 26, 2014"}, {"Title": "amazing deal", "Author": "S. Adkins", "ReviewID": "R12GJ435CG0YA7", "Overall": "5.0", "Content": "To get all this stuff individually costs a lot. This is amazing deal the camera is great! I got this as a gift and my husband loves it", "Date": "February 21, 2014"}, {"Title": "New nikon", "Author": "capnbill \"capnbill\"", "ReviewID": "R34SP365KQNFHI", "Overall": "5.0", "Content": "This is the. Second Nikon I have owned.  I love the feel of the camera and the quality of pictures it takes.  Still learning the ins and outs of the camera, but overall, it is great.", "Date": "January 29, 2014"}, {"Title": "Love my new camera", "Author": "Stephanie C.", "ReviewID": "R1NBHG5HERXXLM", "Overall": "5.0", "Content": "Love my new camera, Capture all my kids in their best moment. Especially my son when he plays football...Thank You", "Date": "December 30, 2013"}, {"Title": "great buy!", "Author": "Alan Steele", "ReviewID": "R20578DAXH3SV9", "Overall": "5.0", "Content": "I have been Searching for a good buy on this camera for quite some time , great price , Lots of extra's . HOPE TO CAPTURE LOTS OF MEMORIES WITH THIS Nikon", "Date": "December 22, 2013"}, {"Title": "Terrific!!!", "Author": "Dianelle", "ReviewID": "R2WQSPOVWBSKNJ", "Overall": "5.0", "Content": "I must say the packages small items such as the tripod, bag, memory card, memory card scanner etc, are all better looking than it actually appears on the image shown for the package. Of course, the camera looks the same as portrayed on the image. The tripod is actually completely black- which I love- I was not quite fond of have an mix  color package. The bag is fully black, and does what its design purpose is to do. MOST of all, the camera and lens are quite protected by the covers they come with. I honestly believe I ordered an terrific package! I'm enjoying mine to the fullest.", "Date": "July 18, 2013"}, {"Title": "It's a great deal but,...", "Author": "Jake Coursen", "ReviewID": "R24WD7YWVJBLIH", "Overall": "4.0", "Content": "Everything about the package/ bundle was as is marketed. That being said, the tripod is kind of s***ty and you might want to focus more on a lens bundle. Don't get me wrong, I am a beginning hobbyist and these lens have offered me what I need so far. But! I feel as if I should have just  bought the frame, lens of choice, and a nice tripod instead.", "Date": "March 1, 2014"}, {"Title": "Good Price but...", "Author": "Kory", "ReviewID": "R3DGUOK8P33V2C", "Overall": "4.0", "Content": "Camera is exactly what was advertised, and everything came with it. only gripe I would have is that the \"extras\"are gimmicky things you dont really need, and very \"cheap\". All in all I still think its a great price for people ordering within the States. Shipping to Canada was more than I thought it should be with duty and actually shipping cost the deal wasnt as great as it first seemed so.", "Date": "January 31, 2014"}, {"Title": "Customer service", "Author": "umairrehman", "ReviewID": "R21M6SAYUK4WC6", "Overall": "5.0", "Content": "As I mention in my previous comment that I had the bad taste with one of representative, but I am glad to see the action taken by the company today. They heard and resolved the issue so nicely. I must say that it's professionalism and company seems to be committed. Overall product is excellent and the CD helps a lot to make sharp and crisp pictures.", "Date": "January 13, 2014"}, {"Title": "Great Package", "Author": "Fadi", "ReviewID": "R1RLLIV8U4CP9V", "Overall": "5.0", "Content": "Great camera, very well built package. Love the 70-300 lense. It's worth paying extra for a 5200 instead if getting the 5100.", "Date": "September 21, 2013"}, {"Title": "Love the camera!", "Author": "oops", "ReviewID": "R1JOL4CNK3VS5K", "Overall": "5.0", "Content": "Love the camera and looking forward to learning more about it.  With 15 grandkids plus more family it should come in very handy.", "Date": "September 19, 2013"}, {"Title": "I really like the D5200, and this bundle includes all the basic stuff for photographer beginner.", "Author": "Guy Rombaut", "ReviewID": "ROIBOVMLX5ZZW", "Overall": "5.0", "Content": "I really like the D5200, and this bundle includes all the basic stuff for photographer beginner.I extremely recommend it.", "Date": "August 30, 2013"}, {"Title": "Nikon D5200", "Author": "thee woman \"Kathy\"", "ReviewID": "R1VT3XX8QW62Y8", "Overall": "5.0", "Content": "I went from a very nice point and shoot camera to this wonderfully sophisticated device. I'm still breaking it in and trying to learn it's ins and outs, but I feel that I made a great decision when I purchased the camera!", "Date": "January 1, 2014"}, {"Title": "nikon 5200", "Author": "tom heflin", "ReviewID": "RMM7KH96ES4YC", "Overall": "5.0", "Content": "still learning to use camera and am pleased with results so far. i use this camera to photograph my paintings.", "Date": "April 27, 2013"}, {"Title": "Asking too much of a review.", "Author": "steve catania", "ReviewID": "R2001K0JDT11W6", "Overall": "5.0", "Content": "If what I write isn't enough I won't bother giving a review. I don't have time for this. Take what we give you.", "Date": "March 3, 2014"}], "ProductInfo": {"Price": "$1,219.99", "Features": "This Kit includes 13 items all with USA Warranty and manufacturer's supplied accessories\nNikon D5200 24.1 MP CMOS Digital SLR Camera Body (Black) - Nikon 18-55mm f/3.5-5.6 AF-S DX VR NIKKOR Zoom Lens - Sigma 70-300mm f/4-5.6 SLD DG Macro Lens with built in motor\n32 Gigabyte SDHC Secure Digital Memory Card - Secure Digital USB Card Reader - Universal Memory Card Wallet - Pack of LCD Screen Protectors\nAdditional EN-EL14 Rechargeable Lithium-ion Replacement Battery Pack - Well Protective SLR Camera Gadget Bag with Pockets & Strap\nFull Size 59\" Tripod W/Case - Focus DVD Guide to Digital SLR Cameras - Focus 5pc Deluxe Lens Care & Cleaning Kit - HDMI cable for HDTV connection - BONUS!! Free 25 Quality Prints", "Name": "Nikon D5200 24.1 MP CMOS Digital SLR Camera (Black) with 18-55mm f/3.5-5.6G AF-S DX VR Lens and Sigma 70-300mm f/4-5.6 SLD DG Macro Lens with built in motor + 10pc Bundle 32GB Deluxe Accessory Kit", "ImgURL": "http://ecx.images-amazon.com/images/I/51YI1N0epJL._SY300_.jpg", "ProductID": "B00B5K5C66"}}