{"Reviews": [{"Title": "CAN'T READ JAPANESE?  I AM HERE TO HELP YOU QUICKLY TURN THE CAMERA FROM JAPANESE TO ENGLISH!", "Author": "Karen Sabol", "ReviewID": "R1B4FV1SVTLDP4", "Overall": "4.0", "Content": "If you do not speak/read Japanese and bought this camera---I AM HERE TO HELP YOU QUICKLY TURN THE CAMERA FROM JAPANESE TO ENGLISH!!! I LOVE Casio cameras-- I feel they are the best in the dark and take high quality pictures and is reliable!  Wanted to upgrade my version, read all about this and felt this was it-- I almost returned it because I was going NUTS trying to change it from Japanese to English (spent over an hour).  I  downloaded the manual online, becaue manual you get is Japanese, manual did not help for language, but post change need it so still download.  The camera being in Japanese you can not read it from what the manual tells you to do, so I went to Google translater-- HELPED, still was at a loss and then started to scroll to see if anything resembled what I saw off of the translator---- low and behold-- FOUND IT AND IT IS EASY....... Here you go.. after you have charged battery fully-- put it in camera... 1. Turn Camera ON, 2. I had camera mode dial set on green camera mode (not sure if that mattered) 3.  Push menu button on back of camera lower right, (it will  put you at top of the choices but you need to get to the settings picture on the left---push the silver dial to the left once to light up the side pictures of either a camera or setting picture(looks like a sun/star).  4. using large silver dial on back of camera around the set button, push down (garbage can area) till the blue settings or sun / star picture is highlighted instead of the camera picture. 5. Push silver dial to right to get back into the choices- it should have put you to the top line.  6.  Using the silver dial again around the set button, push down (garbage can area again) 17 times....7.  You should now see language- hit the set button in the middle of the large silver scroll dial, 8. choose English, hit set button in middle again-- it should put you back into the camera screen and should now be all in English.  Now you can go back into menu button again, and  BE ABLE TO READ ALL THE CHOICES to adjust time/date and what not.  I would have given it a 5 star if I did not putz around so much or if I knew how to read Japanse...... Best of Luck to you, hope this helps others, I needed this!!!!!!  :-)", "Date": "November 17, 2013"}, {"Title": "Excellent Camera", "Author": "WS", "ReviewID": "R1BLFX09H4S4N4", "Overall": "5.0", "Content": "I love this camera!1. Long battery life.  It has never died on me yet, even on vacation when I snapped hundreds of pictures a day (I do charge it each night.)2. Instant reaction time.  Takes another picture immediately and has practically no shutter delay.3. Size.  Compact and fits in your pocket, but has a 30x zoom!4. A much better buy than the Cannon PowerShot SX 500 I also own.  Practically the same price, but the Casio is way better in all the aspects I listed above.", "Date": "September 16, 2013"}, {"Title": "For quick shots and really good HDR, this is the best camera out there...", "Author": "Melissa Chyba", "ReviewID": "R36IJOBB8K5YR", "Overall": "5.0", "Content": "Casio makes a newer model, but it has a pop-up flash, and I HATE pop up flashes.HDR is amazing on this camera, and the ability to take 30 shots in one second gets you action pics NO other camera can take (and I'm a pro photog with 8 cameras)...", "Date": "July 29, 2013"}, {"Title": "Fast Functions and Excellent Macro Facilities", "Author": "Mr. David H. Church", "ReviewID": "R86TMLD24TWGA", "Overall": "4.0", "Content": "The startup and shot to shot speeds seem to be the best of any compact camera so far and shots in poor lighting are much less noisy than cameras with a CCD sensor.Macro and super macro are good, depth of focus in good light adequate for many things.Battery life seems longer than the manufacturers 515 shots, it's almost adequate for a whole weekends shooting. If buying spare batteries it is worth paying for decent ones as many cheap versions will be disappointing.It would have been nice to access the flash facility instantly with little menu access. User progamming for one facility is available on the rear, I set it to Macros and it's easy again to accidently press this in error.The rotary function switch on top is easy to set wrongly by accident when searching for the shutter and zoom button on the front of the top. Many cameras seem to have the shutter here compared to having the button towards the rear.The choice of MOV files for movies is not really convenient, so far replays from HDD are somewhat jerky and the speed is incorrect. I would have preferred AVI files. I hope this is a PC software problem.Plugging in the USB lead from a PC switches the camera on, I think this is rather unnecessary.", "Date": "September 1, 2013"}, {"Title": "Awesome", "Author": "Somebody", "ReviewID": "R2PQLEPVHE96IP", "Overall": "5.0", "Content": "This is my 3rd Casio camera. In my opinion Casio cameras are as good as any digital cameras on the market.This one requires a few minutes and a little patience to change the on-screen displays from Japanese to English.You'll need to download the users manual in English from casio.com to see how to do that (page 163).The only info I can add to help set up the camera is that you must choose a home city(time zone) before you can set the camera date and time. That's not in the manual.And if you want to permanently turn off digital zoom or other defaults, don't forget to also turn on the camera memory for that setting (page 108).", "Date": "October 4, 2013"}, {"Title": "perfect for teaching", "Author": "Brian E. Thompson \"handydoc\"", "ReviewID": "R1WRMD25WOQGP", "Overall": "5.0", "Content": "I met a guy at the golf course who was taping his swing with this camera. It provided extreme slow motion images and allowed analysis of all portions of his swing. It was like something you would see on TV. You are going to need a memory card to make it work. My neighbor used it to tape his sons baseball swing and found it extraordinary. I've used it on myself and my father and it has revolutionized my practice sessions", "Date": "November 1, 2013"}, {"Title": "FFFast!", "Author": "John Wilson", "ReviewID": "R1TDN819WV2X84", "Overall": "5.0", "Content": "I bought this camera to make high-speed movies.  Image quality does not compare with professional equipment of course, but neither does the price tag.  For the cost, it's performance is amazing.", "Date": "October 31, 2013"}], "ProductInfo": {"Price": "$169.23", "Features": "Long battery life available to shoot approx. 515 shots\nEXILIM Engine HS, Ver 3 installed for remarkable high-speed operation", "Name": "Casio High Speed Exilim Ex-ZR400 Digital Camera White EX-ZR400WE", "ImgURL": "http://ecx.images-amazon.com/images/I/416%2BVBudTXL._SX300_.jpg", "ProductID": "B00B7D85JC"}}