{"Reviews": [{"Title": "Awesome Job on Customer Service", "Author": "Joycelyn", "ReviewID": "R21J4WT2GCSI26", "Overall": "5.0", "Content": "Awesome seller. I received my package with more than ample amount of cushion for my electronics in a big box. My social purchase was then placed in a smaller box! Not only does the purchase come with everything in the picture but the camera also comes in its original box. Inside the Camera's box was a list of set up instructions, warranty service contract, lense ring, setup Cd-rom, usb cable, usb adapter, Lithium Ion battery, and wrist strap! This is the best purchase I've made on Amazon to date.", "Date": "November 21, 2013"}, {"Title": "Bought for an island vacation", "Author": "Katherine Brett Gardner", "ReviewID": "R1AZPHOK2ZZ82F", "Overall": "5.0", "Content": "the underwater aspect is awesome and it takes great photos at night.  I know it is not the cheapest underwater but worth it!", "Date": "January 14, 2014"}, {"Title": "Great Waterproof camera for all uses!", "Author": "J. Gilfillan", "ReviewID": "R346OVQNM5MFO7", "Overall": "5.0", "Content": "This camera was purchased to replace an older waterproof camera for a trip to Tahiti. I took some fantastic, high quality pictures both outside and under water. I love this camera. It has been on other trips since and performs well in low light conditions as well.", "Date": "November 18, 2013"}, {"Title": "Near perfect gift", "Author": "Ruth Fitzsimmons", "ReviewID": "R9V8DD865WGGX", "Overall": "4.0", "Content": "Wanted the camera as a gift but it was nice to have the additional accessories for what it would have cost me for the camera.  The camera is GREAT!  Pictures are clear and bright.  There is many camera settings that help improve the quality of the photo taken or provide artsy enhancements of the shot you want.  It is true, the camera doesn't break when dropped.  First day we accidently dropped the camera from chest height and all was well when we picked the camera up from the floor.  Only thing that I wish had been different would be that a battery charger was included with the accessories.  I had to purchase that separately.", "Date": "October 31, 2013"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B00BJ8PPC0"}}