{"Reviews": [{"Title": "Unreal", "Author": "Brad R \"Brad R\"", "ReviewID": "REXNFKN93NBTS", "Overall": "5.0", "Content": "This camera outputs one of the best pictures I've ever seen and I had them all (well, almost) from the original DP2, Leica X1,X2, M8 with a bunch of Leica lenses, Sony, Olympus, Panasonic. I even had the best 28mm ever built, the Leica 28mm 2.8R E55. None of them comes close to this Sigma camera. The pictures are super sharp but as you may know sharpness is not everything. The colors are deep without looking fake or digital, the detail is simply amazing, the pictures have that Leica crispness without the Leica tag.Of course there are a bunch of annoying things like the slow focus, unusable above ISO 400 in color mode (though perfectly usable for B&W;), short battery life, slow writing on card but the output makes up for all of these problems. I'd rather have a buggy camera and enjoy the results than a camera that can go 1000 shots between charges with poor picture quality.You really have to see the raw files to believe it. Got mine from Adorama.", "Date": "March 13, 2013"}, {"Title": "Just Amazing IQ", "Author": "V \"Beach Bum\"", "ReviewID": "RUH3UEOSCVFSW", "Overall": "5.0", "Content": "I have to admit to be being a fan boy for the Sigma Merrill DP cameras.  Awhile back I did a review on the Sigma DP2, and have from time to time posted images taken with that camera.  Despite my infatuation with the Sigma DP cameras I will be one of the first to admit that they are not cameras for everyone.  I like to take my time in shooting landscapes and environmental images.  I also love street photography, and most bloggers have dismissed the Sigma DP’s as too slow for street.  I disagreed in my DP2 review, and found that I could use that camera for street shooting.  Sigma has taken a different tact with their APS-C Foveon sensor pocket rockets, though they really are not that pocketable, each Sigma DP has been given a prime fixed lens to maximize the sensor.  The DP1 was given a 19mm f/2.8, the DP2 a 30mm f/2.8, and the latest DP sibling the DP3 a 50mm f/2.8.  Since these lenses are tied to an APS-C sensor the lens equivalents in the 35mm full frame world translate into 28mm, 45mm, and 75mm.  All for us prime shooters are terrific lenses to have in our bags.  Seeing the DP3 enter the fray, I decided to buy one and add it o my Sigma DP arsenal.  I figured the DP3 would provide me with a great fixed lens for portraits and for some longer landscape shooting.  My reviews are not based on MFT scales or DOX comparisons.  They’re just my personal opinion on how I like the camera for my own type of shooting.  The DP3 delivers the goods IMO at a slightly improved performance over the DP2 in the following manners:  the auto focusing seems a tad faster, the camera seems to power on a little more quickly than the DP2, and the DP3 has a leaf shutter that is totally silent.  I haven’t checked it out, but I think I heard somewhere that the flash speed is a tad higher over the DP 1 and 2.  The lens quality is top notch.  Matching the DP2’s 30mm in sharpness and IQ.  I experienced no vignetting or any lateral CA from the images I shot.  The camera comes bundled with access to Sigma Photo Pro 5.5, which now includes a monochrome feature to it.  Sigma Photo Pro works, albeit slowly, when compared to Lightroom, but it still does an admirable job of post processing and you can save your files to TIFF and transfer them over to Lightroom, Aperture, or Photoshop.  There is another third party option, one that I’ve been using, Iridient Developer, that works with Sigma files.  It’s a great program that can be yours for $75.  It also works with every camera out there, and makes for a great alternative to Photoshop.  If you like working in the moment and want an IQ that will blow your socks off, then pick up one of these beasty cameras Sigma has been producing of late.  The Sigma Merrill’s will change your opinion on everything Bayer sensor oriented.", "Date": "May 28, 2013"}, {"Title": "Tried Really Hard to Like it but ended up returning it", "Author": "Jerry13", "ReviewID": "RSN5XSZD7CE0A", "Overall": "2.0", "Content": "I got both the D3 Merrill and the D2 Merrill.Background: I had Canon 5D II and ton of lens, which I sold off once I got the Fuji X100s, it is that good.Heard about the sigma Foveon and wanted to see what the magic is about. Got both and was thinking of keeping at least one of them for landscape.Good things:Small (relatively)Insane resolutionExcellent BW photos (if you get the exposure right)Fast AFLooks sexy (but finish is slippery)Bad things:No OVFNot pocketalbe (had to carry my small backpack camera bag along with tripod (camera needs it))Finish too easy to scratchVery slippery in handsBattery life is miserableSlow to write (not too bad)Insane resolution (wife refused to be photographed again!!! )Raw files only opens with horrible slow sigma pro software (I got away from the processing of raw files and love the JPEGS from X100s)If you print up to 20 x 30 you may not find much of any difference between x100s (you always get it right) and Sigma (if you get it right) (may be in crop it might stand better)Not good above 400 iso (except you can make decent BW prints with higher iso in NIK)PriceyBottom line:I am in  love with my X100s all over again, what a brillant camera. I am actually selling the prints off the X100s native JPEG files.I would wait for this to evolve and will look into this again in a couple of years when they address issuesWish list:OVFGrippy finish and make it less scratch proneFaster processorBetter ISOBetter / Bigger batteryMore pocketableDefinitely needs a better RAW processor OR better Lightroom support for RAW files", "Date": "July 10, 2013"}, {"Title": "For those seeking medium format image quality from a P&S; camera.", "Author": "A. Alper", "ReviewID": "R28MP2C9QPHMLE", "Overall": "5.0", "Content": "Sigma makes the very best low price medium format digital point and shoot camera that money can buy.  I say this with the utmost confidence, since you cannot buy a medium format digital point and shoot camera from anybody else.  If you could, it would probably cost closer to Pentax's $10k D645 than Sigma's $900 DP1, DP2, or DP3 Merrill cameras.With the advent of Iridient Raw developer, images don't even need be processed via Sigma's god-awful Prophoto software.", "Date": "December 7, 2013"}, {"Title": "Sharpest Possible Shots in Good Light", "Author": "GenesisOne29", "ReviewID": "R60TCDN8E4ET6", "Overall": "5.0", "Content": "The Sigma DP3 Merrill is something else entirely: an enthusiast-only camera. This is a machine that cannot conceivably be used as an all-around imaging device, a product that lacks many of the basic features we've come to expect from modern digital cameras. Need usable high-ISO images? Too bad.. How about quick autofocus and decent write speeds? Nah, you don't need that. What we have here is a camera that can only be useful to someone who already owns another, more well-rounded camera.With its 50mm f/2.8 fixed-focal lens, unusual Foveon image sensor, and stripped down feature set, the DP3 Merrill has just one purpose: to capture the sharpest possible shots in good light. And in that, at least, it succeeds beautifully.Sharpness results in the lab were totally off the charts. The only other fixed-lens camera that's in the same league as the DP3 is the full-frame Sony RX1, though that camera smokes the Sigma in all other performance metrics. The DP3 shows a slight weakness near the edges at f/2.8 (relative to the phenomenal center resolution), but it's razor sharp everywhere by f/4 and stays that way until well past the diffraction limit.The DP3 can pump out absolutely gorgeous images, but its window of opportunity is prohibitively small.Because of the way color distorts, saturation drops off, and noise jumps at even moderate ISOs, you can really only get acceptable results from the camera between ISO 100 and 400.That means good light outdoors or bright studio illumination. And it's not like there are a lot of extras to make up for the DP3's absurdly limited range. No HD video, no creative shooting modes, no nothing. The camera isn't even comfortable to hold.The DP3 is TFA. Totally. Freaking. Awesome. I thought my Nikon D800E files were sharp, they are but pale versions of the files from the DP3 Merrill.The DP Merrill sensor offers sharpness on a per pixel basis that cannot be matched by any conventional Bayer-matrix sensor. Also, the lower pixel density is subject less to diffraction. All of the DP Merrill cameras share the same sensor and all have high quality /2.8 lens,An alternative RAW converter is Iridient Developer.The Nikon D800E delivers substantially more total detail, something easily seen by resampling to a common resolution.The D600 and Canon 5D Mark II offer marginally more detail, but generally do not have the same visual impact for that detail, and the Sigma sensor has none of the digital artifacts produced by a Bayer-matrix sensor.While the D800E has evidently more resolution, you can see how the SD1 Merrill holds its own very well; its files show actually more micro-contrast and fine detail than the D800E's files. Indeed the rendering of homogenous coloured areas looks more detailed, more tridimensional in the SD1 Merrill.Now this is an interesting comparison, since Sigma claims that the 45 MP Foveon sensor used in the SD1 Merrill has a luminance resolution equivalent to that of a 30MP Bayer sensor. However, the upsized file from the SD1 Merrill holds details very well against the downsized D800E's file, more so if you consider that downsizing a file improves noise and detail, while upsizing it exacerbates noise and reduces detail. Again, you still can see more micro-contrast and fine details in the Sigma files compared to the Nikon's.The SD1 Merrill's files shows much more detail in the area of the image than the D800E's. It is clear to me, both from this and from hundreds more pictures I have shot so far with the Foveon sensor vs those thousands I have shot with Bayer sensor cameras, that when demosaicing Bayer images of such homogenous areas the algorithms struggle to render the fine details that the Foveon sees with ease.Sigma imags are the best images, in terms of sharpness, definition and clarity I've ever taken, with any kind of camera, film or digital in any format. The images on my screen are things of beauty, absolutely stunning. Almost too sharp, and with a colour separation that is almost unbelievable. I will put up with almost anything to make images that look this good.The DP1m is a great walk-about camera if you're prepared to compromise in order to get amazing image quality.The DP3m offers medium-format beating photos for stationary subjects if you fuss about stitching images together.The bottom line is that while not full-frame, the Foveon sensor competes with everything up to medium format digital at ISO 100, especially if you fuss about and stitch multiple images together to increase the overall resolution. I've not seen any moire.The 100% per-pixel acutance of the X3 Foveon sensor, in my opinion, beats pretty much all of the competition outside of medium-format digital. I also prefer the colour.But if you fuss about creating multiple exposure-bracketed HDR images to stitch together later, you can effectively create a medium format digital camera for a fraction of the price. Can you do this with other cameras? Sure, but the sharpness of the lens and excellence of the sensor gives the Sigma DP3m a huge advantage.But realize what you're getting. The Sigma DP3 Merrill pushes image quality forward by a couple of years. Doubtless in a decade the towering prints possible from multiple-stitched DP3m files will be achievable by your phone. If you want this image quality now without paying tens of thousands or carrying a huge, heavy body, then the Sigma DP3m, with all of its compromises, is your best option.Most photographers won't have the skill to get the most out of them but when you get them in the right zone, they are tremendous. I use them like a more convenient Hasselblad 500cm for meditative photography or like a quieter, cheaper Leica M for covert photography. However, you choose to use yours, enjoy the image quality and invest in plenty of batteries!Now, at this point, you may be asking, why continue with the review given all the negatives? We thought the same thing too, and then we opened the files on our PC using the Sigma Photo Pro software. We were ready to quickly give the DP3 Merrill a failing grade since it's so frustrating to use but then we started pixel peeping on a 27-inch monitor. The photos were absolutely outstanding, with a richness we had only seen on full-frame cameras; they are easily comparable to those from many high-megapixel APS-C DSLRs and CSCs. In fact, the shots were better in some ways than the X100S and Coolpix A. They even give the RX1 a run for the money - and that one costs three times as much.One of the great things about the DP3 is the Sigma glass. The 10-element, 8-group lens really delivers the bokeh, those nicely blurred backgrounds with wide-open apertures. When you everything to work, the camera really delivers, but the user experience is bad and the unit itself is several generations behind current technology.We hate to pile on but where the DP3 fails again is ISO capability. It has a range of 100-6,400, which is far behind the 25,600 of most high-end 2013 cameras. In our recent reviews, such as the Canon EOS 70D, we could even use 25,600 for a small image. With the DP3, ISO results are solid to 800, then falling off as you increase it. Of course, you can eliminate a lot of the noise using the Sigma Photo Pro software during post-processing if you are saving RAW files.The Sigma DP1 and DP2 Merrill is in a group of a limited number of compact cameras with an APS-C sized sensor and a fixed lens, along with the Leica X2 and the Ricoh GXR APS-C cameras. This niche is rarer still due to the use of a Foveon sensor which promises the ultimate in image quality, although this is when shooting RAW. The Foveon sensor is capable of resolving excellent - to stunning - levels of detail far beyond what you would usually expect from 15 megapixel images.I am simply astonished at the overall image quality of these sample images from the DP3. There is a three dimensionality to the files that just makes them seem to come alive. This not just about resolution.The Sony image of the same flowers at 109mb doesn't look nearly as \"alive\" as the DP3 image. I have seen JPEGs from medium format cameras with 40+ MP that do not look as good.Indeed. Sigma DP Merrill shooters know firsthand that the visual impact is strong. As with almost any tool, one wishes for operational improvements, but the image quality is rewarding.I just looked at a fantastic tulip shots done with the new Sigma DP-3 Merrill. The Tulip #6 photo is absolutely incredible. That image is begging to be printed out as a 40x60 canvas and hung on your wall. Very well done! Wonderful light, composition, and detail...the detail! WOW! I've been watching the reports on the Merrill with great interest.It's proven that the Sigma DP3 Merrill is an amazing camera capable of outstanding results in the right hands.Yes, spectacular image quality from a point and shoot. I regularly get skeptic emails from those who have not tried... I strongly recommend renting one to see for oneself, and B&H; Photo has the DP Merrill cameras in stock.It's of interest to me to hear the reactions to specific images. The lack of an EVF is a bummer, but not a show-stopper for me given the compact camera size of the camera and outstanding results.The poor state of the software is a huge time sink for me--I've been griping to Sigma on the software for some time now, but progress is glacially slow on improving it. Finished images from it are excellent; the issue is mind-blowing interface design failures, some so basic that the thought \"you can't make this stuff up\" applies, and frustrating bugs and crashes. Sigma Corporation doesn't seem to realize that the SPP software degrades the entire product. Note that Iridient Developer 2.0 ow has X3F support, and I'll be looking into that soon.Of course what I'd really like is for a full-frame Foveon sensor of 33 megapixels: scaled up at the same pixel density, the existing APS-C sensor would produce 33 megapixel images which would blow away any existing DSLR resolution.My only problem now I don't like the Bayer sensor of my D800e anymore.This 3D look and per pixel sharpness of the Foveon sensor reminds me the good old time with my 4x5inch large format camera. The color correction of the D3PM is better than everything including all Zeiss and Leica lenses I've had and tested during the last years. If you look at the full resolution files in my flickr account the camera makes me speechless. The best thing I almost have to do nothing with the files to make them look best.The Nikon D800E still has considerably more resolving power than the DP Merrill sensor, but it is true that no Bayer-matrix sensor can deliver the same per-pixel sharpness especially for color-on-color detail. Downsampling a D800E image to DP Merrill resolution makes it clear that the D800E quality is superlative with a lot more detail. But who should expect that 36-megapixels would not win out; even a Bayer sensor with its RGGB layout wins from a huge pixel count: oversampling.The Foveon sensor does very well in sunlight for color rendition, but in my experience it does not have as wide a color gamut, and it has color rendition issues under some types of lighting (tungsten). This is basically becuase of the stacked design has trouble with strongly biased colors of light as the stacked photosite layers filter out a big chunk of wavelength. Also, the D800E dynamic range is wider.haslat writes:The DP2M and DP3M are just incredible cameras. Picked up my DP3 Merrill at B&H; yesterday and took it to Grand Central Station for a tryout. The resulting images are unbelievably sharp.My decision to purchase Sigma cameras was based on the analysis of the results that could be achieved with this sensor and glass - spot on.", "Date": "January 26, 2014"}, {"Title": "Great Camera with a different kind of sensor.", "Author": "Sol \"Trureviewer\"", "ReviewID": "R18TZCDPH1M5N1", "Overall": "5.0", "Content": "I bought this camera for: Foveon Sensor, small size, quality lens, and as a cheap substitute to a Leica Rangefinder. It has excellent build quality and is made in Sigma's single factory in Japan. It has a real resolution of 15MP (45/3[RGB]). I use it exclusively as a monochrome camera and shoot in RAW. With a tripod, the images this camera produces are astounding as is their clarity. Please see a detailed review, ISO tests with images at wwwsigmarm2.com  I have jigged it up with RRS grip and plate.Cons: 1. The ISO is unusable above 200.2. No electric viewfinder. Had got a Voigt 75mm for it, but it is meaningless.I recommend it highly and will over time get the other 2 of the series, this is the tele. The images it produces are something else and the detail is phenomenal. I am sold on the sensor enough to check out their Foveon based DSLR.", "Date": "January 24, 2014"}, {"Title": "masterpiece of camera engineering ''foveon sensor''", "Author": "can", "ReviewID": "R2BQR7OMKK542J", "Overall": "5.0", "Content": "first of all, i have to say, this is not a camera for  everyday use or low light photography. This must be the second camera for proffessional photographers or enthusiasts. let me start from the things will shock you.autofocus is below average, takes 1 secons in good condition, 3 seconds in low light, and cant focus in dark places)battery is awful, sigma provides 2 pieces including with cam but i prefer 2 more ( for studio shooting sac-5 power cable is a must)iso is not usable from 800, (i prefer maximum 320)writing to card takes at least 5 seconds even with extreme pro cards.no stabilizationno electronical view finder ( voigtlander 75mm is your only choice, applicable for portrait)poor video (i don't mind, this is an ultimate photo camera if you wanna shot  video, go for pana GH3)no built-in flash - ( for indoor photography i prefer EF-610 - DG- SUPER TTL flash, very useful )the things given above are %100 percent true, but now i will write the things will shock you more..sharpest lens ever in the world - only nikon D800E can challenge this guy ( which is 4 times more expensive )true color - yes, now we are talking. No more false colors. you will get exactly what you see with your naked eyes.leaf shutter - flash sync up to 1/2000 ( f.5.6) 1/1250 (f2.8) set the time time lapse 15 seconds in studion and enjoy the capabilities of foveon sensor.75mm focal length (eqv. FF camera) is perfect for studio shooting.this lens can give you  much more details than  zuiko 75 mm f1.8 (eqv. 150mm FF with pana GX7) shooting in same distance.---------------------this is a pro camera and need some time to get adopted.. but when you do, you will get impressed with the astonishing image quality.", "Date": "January 21, 2014"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B00B5P5XUG"}}