{"Reviews": [{"Title": "Sony camera", "Author": "someonetofind", "ReviewID": "R2LSS9M7SH8UYF", "Overall": "4.0", "Content": "I wish that people had written a full review before I bought this camera, so I could have been a bit more prepared.  Let me just say first that I love this camera, but there are some good and bad sides to everything, I suppose, so I am going to list them since the only other five reviews have not touched on anything but how great the camera is for them.Pros:  Comes with everything you need, there is no guess work!!!!Has a wonderful zoom on it.  I got this camera just in time to capture my son in football practice, and it felt like I was really standing next to him.  I could even use the LCD to zoom in and watch, even if I wasn't taking pictures of him.The instructions for the camera are actually in the box, you don't have to read them online.Very easy installation of the software, that is all online, and even compatible with Windows 8.Tons of wonderful features for an amateur photographer to feel like they know what they are doing (namely ME!!!)  It is easy to find all of these features and start playing around with them so that you are familiar with them fairly quickly.Cons:  The weight of the camera is all lens, so it is very front heavy.  The rest of the camera is plastic.The flash has to manually be popped up with a small button before even the auto flash will work.  If you are anything like me, you might forget that when you really need it.The lens cap does not fit very securely.  It fell off while I was carrying the camera in it's case and I didn't know it.The screen protectors don't stick very well.  I put mine on there, fairly easy after you cut it, fit it to the screen, especially if you have other devices that you protect.  Mine fell off once I set the camera back down on the counter.  I didn't even get a chance to carry it around with the protector on (this is not a no sell for me, I have never protected the screens on any of my cameras, and have never scratched any of them).I hope this review really helps someone that was doing research like I was.", "Date": "September 19, 2013"}, {"Title": "Amazing", "Author": "N. Reynolds", "ReviewID": "R1FZBDQ677B1ZB", "Overall": "5.0", "Content": "I love this camera!!!! I have used it at church for Mothers Day, and with my sons school field trip to the zoo.  Every picture came out amazing.", "Date": "May 20, 2013"}, {"Title": "Good camera.", "Author": "Elaine M", "ReviewID": "R391N2V3JOTMEV", "Overall": "5.0", "Content": "I got the product I expected to receive. It is a very good starter camera. Bought it for an aspiring photographer.", "Date": "August 17, 2013"}, {"Title": "Great Camera for the Price!!!", "Author": "Connie R. Dohmen", "ReviewID": "R2A9XI1ZI9MAE8", "Overall": "5.0", "Content": "I bought this camera right before going on a cruise.  It took amazing pictures, and I didn't have a bit of trouble with it.  It even survived the zip lines in St. Kitts!!!", "Date": "October 18, 2013"}, {"Title": "Great gift", "Author": "kenny03", "ReviewID": "R2G25UIO5SPNNW", "Overall": "5.0", "Content": "This camera exceeded all expectations, I bought it for my father and he absolutely loves it !!! I will recommend it to my friends.", "Date": "August 9, 2013"}, {"Title": "Not a bad camera for beginers but that is it.", "Author": "Mr Slim", "ReviewID": "R3ETW8OAQWAR2I", "Overall": "1.0", "Content": "Update: I just returned this camera because I hate it so much, by the time I zoom in and try to focus I lost the opportunity for a good photo. The zoom really sucks and is very rough and not a smooth auto focus. I just spent a few minutes trying to shoot some photos for ebay and this camera would just not focus properly. May I say again, I hate this camera, for a beginner it might be ok but for me it is a hunk of lens heavy plastic junk not worth $20. Because it is not balanced properly taking a great shot consistently just wont happen unless you tripod it.I went back to using my old 10 year old sony because this camera is so bad.If you have an older sony cyber shot and are looking to replace it with another sony then forget about it, sony does not care judging by this model. Go with a camera made from an actual camera maker and not jack of all junk Sony.", "Date": "September 23, 2013"}, {"Title": "good deal", "Author": "Larry sterzing", "ReviewID": "R37SRAKRDOB2NT", "Overall": "5.0", "Content": "This camera takes amazing pictures and is super easy to use! The package deal made it an even better deal...", "Date": "August 16, 2013"}, {"Title": "LOVE THIS CAMERA!", "Author": "Jesse", "ReviewID": "R2163O0MXTGRRK", "Overall": "5.0", "Content": "I am a photographer at heart and I love taking landscape, wildlife, and action shots. This camera works great for all of them. I've had this camera for almost a year and I am still experimenting with it's settings. So far it has been very reliable and I have had plenty of compliments on my photographs.", "Date": "June 4, 2014"}, {"Title": "disapointing quality", "Author": "Chris", "ReviewID": "R27WWLFP0MNTYD", "Overall": "1.0", "Content": "We hoped this would be a good camera for our son who has enjoyed using my Nikon. But this Sony has poor quality. If you want great pictures, save up another $200 and get a Nikon D3100", "Date": "May 13, 2014"}, {"Title": "Sony Camera", "Author": "Joseph E. Lorman", "ReviewID": "R1O9UT3I10GFV9", "Overall": "5.0", "Content": "Price Excellent For The Value, Camera And Functions Work Great Easy To Use. Love It would recommend to anyone! Great Buy!", "Date": "April 30, 2014"}, {"Title": "Wonderful camera!", "Author": "Sharon Huddleston", "ReviewID": "R1ODY6D7EERZK3", "Overall": "5.0", "Content": "I have never taken such great pictures! This was the first non-pocket camera that I have ever bought. It took a while to get used to the fantastic zoom (sometimes I would lose my subject zooming in too close) but, after practicing I got excellent photos. I'm going to Israel next month and will be using the panoramic feature and the movie feature. This was one of the best purchases that I have made in a long time.", "Date": "April 16, 2014"}, {"Title": "nice", "Author": "william smith", "ReviewID": "R1B4RGINQGR8P3", "Overall": "5.0", "Content": "I think this camera was the best deal for the money great starter camera like it a lot very awesome", "Date": "March 16, 2014"}, {"Title": "Christmas Gifts to my Children", "Author": "Sherardc", "ReviewID": "RP2OO8FNT2GFF", "Overall": "4.0", "Content": "Gave this camera to my Children as a gift and it seems to take very good pictures.  Much use inside and out did perfect.", "Date": "March 4, 2014"}, {"Title": "Good Price for what you get!", "Author": "j", "ReviewID": "R1VWLN2N0ANNM3", "Overall": "4.0", "Content": "This is a nice starter kit to buy as a gift for someone like i did for my wife for x-mas.", "Date": "February 2, 2014"}, {"Title": "Sony Cyber Shot", "Author": "Savannah L Cross", "ReviewID": "R3VCVGZN4CWWZ2", "Overall": "4.0", "Content": "I was really pleased with my camera. It was more than I expected. Looking forward to taking lots of pictures of my grand kids, and family.", "Date": "January 21, 2014"}, {"Title": "Great for the price", "Author": "Joseph S. Huszar", "ReviewID": "R3VVU1XQZUA5BA", "Overall": "4.0", "Content": "I needed a new camera, and this one for the price is great 20+ megapixel, and is very ez to operate", "Date": "January 13, 2014"}, {"Title": "Nice Camera at great price", "Author": "Shiv Kumar", "ReviewID": "RVUYR77OQ9JM0", "Overall": "5.0", "Content": "I liked this camera. I ordered one more after I received and used my first one. Compact, great picture quality... Loving it.", "Date": "January 7, 2014"}, {"Title": "Good camera", "Author": "Hilary", "ReviewID": "RRSM9LHSNV6QK", "Overall": "4.0", "Content": "Es easy to use for a beginner. It takes great pictures and has great zoom. VERY GOOD PRICE. I totally recommend it.", "Date": "January 7, 2014"}, {"Title": "Perfect, almost", "Author": "John Kraft", "ReviewID": "R2RKV6MPMAJHZG", "Overall": "4.0", "Content": "Purchased as a gift for our daughter. It's been perfect except for a nagging \"turn-off then turn-back on again\" error message. After googling the error message, it suggested banging on table twice. Camera has worked fine since.", "Date": "January 7, 2014"}, {"Title": "Quality", "Author": "Mariah Pendergast", "ReviewID": "R1L0SSL0CUBQKT", "Overall": "5.0", "Content": "Great quality especially for the price. Camera takes excellent pictures and the zoom makes you feel like you are right there", "Date": "January 7, 2014"}, {"Title": "Not What I Expected", "Author": "Carmen", "ReviewID": "R22EJ5BIFV9L3X", "Overall": "2.0", "Content": "For a Sony this camera is not what I expected. Most of the pictures come out slurry. I would not recommend it to anyone. Waste of money.", "Date": "December 30, 2013"}, {"Title": "Good begining camera", "Author": "Jason", "ReviewID": "R5A6JEYR4BNM4", "Overall": "5.0", "Content": "I purchased this camera for my daughters birthday. She is a 12 year old aspiring photographer! I forgot about the fact that a camera would now be in our face morning, noon, and night! Lol But I'm just playing. Picture quality is good. A lot of different setting for numerous environments. So far very pleased with this camera.", "Date": "December 30, 2013"}, {"Title": "Not as advertised", "Author": "thomas stewart", "ReviewID": "RRHR5OUW33NZM", "Overall": "4.0", "Content": "It is a great camara but advertised as32gb and it is only 16gb so if you order it be careful to look at before you give it someone as gift", "Date": "December 21, 2013"}, {"Title": "great camera, great price.", "Author": "luke scott", "ReviewID": "R1LTQH9C8K6GC8", "Overall": "5.0", "Content": "It was a gift for my mom and I got the camera with all the add ons for a great price", "Date": "December 13, 2013"}, {"Title": "Great pictures. Easy to use.", "Author": "Kyle Borger", "ReviewID": "RHSCGIRHCOAAX", "Overall": "5.0", "Content": "I just tested the camera at a band concert my son was in. Bright lights on stage. Dark auditorium. Back of the building. I was able to zoom in and take a good clear picture with good lighting. It took some playing with the camera but there were plenty of settings that I was able to find one that worked in that environment. It did require a steady hand and a tripod would have been an asset as taking a long zoomed in shot through the dark is one of the hardest shots to get.", "Date": "December 12, 2013"}, {"Title": "very good service and great product.", "Author": "blancageorges", "ReviewID": "R1FM9IKSMV9I5K", "Overall": "5.0", "Content": "it is an amazing product. I didn't know that I was going to get the case and I even got a deluxe kit with the tripod . thanks!", "Date": "December 10, 2013"}, {"Title": "great camera", "Author": "shoper", "ReviewID": "R3P48KAQJXFPTR", "Overall": "5.0", "Content": "camera is great.happy with it.it was very nice to get all the extra items with it.all my friends like it.", "Date": "December 8, 2013"}, {"Title": "Great camera for the $$", "Author": "cjay", "ReviewID": "R2NOLSWSTDV3NH", "Overall": "5.0", "Content": "Took photos of Halloween spook house across the street and it looks like I was right in from of it!  Easy to use and takes good phots.", "Date": "December 1, 2013"}, {"Title": "not a great camera", "Author": "chelle", "ReviewID": "R3SU7OHZVMQJKQ", "Overall": "3.0", "Content": "The focus doesn't work when taking a photo in zoom. it goes blurry & Sony nor the manual are of any help.", "Date": "November 30, 2013"}, {"Title": "Excellant Camera", "Author": "Amazon Customer", "ReviewID": "R3S9ITYT9OCH7L", "Overall": "5.0", "Content": "Excellent camera, pictures are high quality, movie feature is easy to use. Still learning about all the things I can do with it but I am more than satisfied with the product.", "Date": "November 29, 2013"}, {"Title": "Very nice", "Author": "busymom100", "ReviewID": "R5PLWOUTT3FE3", "Overall": "5.0", "Content": "I got the for my daughter's birthday (16) and she loves it.  It takes amazing pictures, she took a picture of a bee on a flower that looked professional.  Great in low light too which, in my opinion, is one of the most important points.  Great price too.", "Date": "July 4, 2013"}, {"Title": "worst camera I've ever bought", "Author": "Marybeth Teran", "ReviewID": "R2OORJ4TZYP2KO", "Overall": "1.0", "Content": "It was meant to be used strictly with a tripod. Any amount of movement results in extremely blurry pictures in every setting.  I've been a professional photographer for years and couldn't get anything decent out of it. Unless you are looking for something to provide you with endless frustration,  keep looking.", "Date": "April 12, 2014"}, {"Title": "Need more practice on this camera.", "Author": "Paula L.", "ReviewID": "R2870OZZVX65P2", "Overall": "5.0", "Content": "I haven't had the camera very long.  It works a lot like my Sony Cyber-Shot DSC-H20 only on a grander scale. It doesn't seem to take as sharp pictures as my Sony Cyber-shot DSC-H20. It may just be I need practice.  The scenery shots seemed to look flat...not high definition. It may just take time. I didn't like the charger that came with it. It charges great, but the lights never go out to let you know when you are charged.  It is going to take some practice to get on to the settings, but what fun.", "Date": "October 25, 2013"}, {"Title": "Pretty good.", "Author": "Bmtprescott", "ReviewID": "RDDWZXK0FX5ZH", "Overall": "4.0", "Content": "I haven't had any problems with the camera. At first my pictures were a bit blurry but once I figured out the settings that went away. Does the job and has pretty good resolution. Overall pleased with it.", "Date": "October 19, 2013"}, {"Title": "Not like they use to be", "Author": "Sean McKearney", "ReviewID": "R20Q3TTBE9897U", "Overall": "1.0", "Content": "This camera is fine for outdoor indoor get togethers. This camera performs poorly for sporting and the process time from focus to shot is very slow. Also very poorly constructed.  I had one of these cameras about ten years ago. It was by far superior. Time to put quality construction back into this camera.", "Date": "October 21, 2013"}, {"Title": "doesn't work", "Author": "elle-voit", "ReviewID": "R2XE9AEW0ZJN6N", "Overall": "1.0", "Content": "Every time I turn it on it says turn it off. I have tried everything. I finally got it to take some pictures and the quality was less than my little point and shoot.", "Date": "March 17, 2014"}, {"Title": "Made for camera \"dummies\"", "Author": "Suzi Stemper", "ReviewID": "R4E28IYCLVKSU", "Overall": "5.0", "Content": "Awesome easy to use camera...came with a lot of items...didn't know was coming. Rechargeable batteries are great. Nice carrying case also", "Date": "November 23, 2013"}, {"Title": "Greater expectations", "Author": "mommylern5", "ReviewID": "R17TWDWBRJAT2M", "Overall": "1.0", "Content": "I am very dissatisfied with this camera. Every picture I take is blurry. No matter what setting I put it on. I have to be super still to have it turn out even half decent. I will be sending this camera back to the manufacturer.", "Date": "November 1, 2013"}, {"Title": "excelent", "Author": "JUAN FERNANDO DURAN", "ReviewID": "RINJ85BPIN13L", "Overall": "5.0", "Content": "camera very easy to use,  is perfect for start photography, many escene options, great zoom! ! is all tha im expected. excelen choice", "Date": "November 5, 2013"}, {"Title": "love my new camera", "Author": "Amazon Customer", "ReviewID": "R2NXXSURB7YUH6", "Overall": "5.0", "Content": "Been waiting for a camera like this. Great quality photos of my kid running around playing. Not saying every single pic comes out perfect because when kids are running around playing sometimes they are bound to come out a little blurry but that happened a lot with my olympus too and paid over 500 dollars for that one so to find this one at such a reasonable price was very happy plus this one has more zoom than my other one did. And shipment was very fast! Thankyou amazon!:)", "Date": "September 27, 2013"}], "ProductInfo": {"Price": "$299.99", "Features": "20.1 megapixel plus 35x zoom brings detailed subjects close\nOptical SteadyShot image stabilization reduces blur\nCapture your videos in 720p HD Movie mode¹\n3.0\" LCD screen for easy viewing and photo editing\nCreative shooting with Picture and Beauty effects", "Name": "Sony Cyber-shot DSC-H300/B Compact Zoom Digital Camera in Black + Sony 32GB Class 10 Secure Digital Memory Card + Carrying Case + 4 AA Rechargeable Batteries w/ Charger + Accessory Kit", "ImgURL": "http://ecx.images-amazon.com/images/I/51aasuJK7KL._SY300_.jpg", "ProductID": "B00BIRP8HO"}}