{"Reviews": [{"Title": "Another great camera from Nikon", "Author": "Person", "ReviewID": "R3HCUERX3QDZY", "Overall": "5.0", "Content": "I have had a Nikon Coolpix S600 for 5-6 years now and it has been my go to camera to have around because of it's handy size and it has never let me down, except that recently the zoom function is intermittently working.  So, I decided to replace it with the S9500 and just got it this past week and really wanted to put it through the paces a bit to see how functional it would be around town and in the field.The wi-if transfer is really handy when your out and about and want to transfer photos to a cell phone or tablet that has data capability so they can be uploaded to a website or to just back them up on another device.  I used my iPad and the free app from Nikon called Wireless Mobile Utility (WMU) which can be found in the App Store, it's really quick and easy to use. It also allows you to setup your camera and remotely take pictures with the app, I found that I could only be about 30 feet away from the camera with my iPad before the wi-if signal was lost so it has range limitations.The 22x zoom is fantastic for this size of a camera, it takes really nice clear photos even zoomed all the way out.  The anti vibration works well also if you al moving about and taking action shots.One big complaint I have so far is the placement of the record button for starting video recording.  I have hit this button numerous times on accident and there is no way to disable the video record function, it's always at the ready when you are in photo mode.", "Date": "March 2, 2013"}, {"Title": "Firmware update could make this camera great", "Author": "Dave L", "ReviewID": "R3KWXFQIS2Q4FS", "Overall": "1.0", "Content": "In the couple of weeks I've had the camera, I've really enjoyed it. In good light, it takes great pictures with vibrant colors and the flash works very well. The menu system is well designed which provides easy access to all of the camera's functions. I especially like the GPS features and panorama and 3D modes. Of course, the 22x zoom is great.One big problem however is the cameras operation in even moderately low light situations. There are times when it refuses to focus even in normal indoor lighting especially when the zoom is being used. This prevents even taking a flash photo. It's especially frustrating since it seems to start out with a good focus and then veers away from it when it locks in. I'm hoping this is just a bug that could be fixed in firmware. My son's camera from a competitor works perfectly every time in identical situations.The omission of an AC adaptor that allows operation of the camera (in addition to charging) is baffling. The cumbersome battery substitute adaptor is a poor alternative to this obvious feature. Not a deal breaker though.Most importantly, certain basic functions are missing from the firmware. It's as if a marketing guy told the engineers to get rid of every extra item that could confuse a user rather than sensibly tucking them away into a separate area for when the user gains more experience. Here is a list of seemingly simple changes that I hope find their way into a firmware update before I have to decide whether to return the camera:1. Get rid of the GPS log warning when powering down or at least let the user dismiss it. Waiting 10 seconds before you can put it back in your pocket gets annoying very quickly.2. Provide basic shutter and aperture priority modes. The camera often makes wrong decisions, especially in dim light, and this would provide a fallback.3. Provide additional focus modes for infinity (without having to be limited to a landscape scene) and maybe a distance focus control for situations where the automatic modes don't work. This may not be necessary if the engineers can get the low light focusing to work properly.4. Allow control over how long the preview shows after taking a picture.5. Allow edited images (zoomed, softened, etc) to be transferred via wifi. The instructions don't say they can't be transferred but they are disabled with an X through them on my iPhone with the Nikon app.6. Allow full res images to be transferred to a smart phone via wifi.There are probably more missing basic features but these are the ones I noticed right away. The first three especially are reason enough to return the camera if they are not fixed. It would be a shame for such a great camera to be hobbled by substandard firmware. Since I generally enjoy using the camera, I really hope Nikon is listening and has the technical skills to fix the problems.", "Date": "May 18, 2013"}, {"Title": "Great Camera For My Use", "Author": "Elliott", "ReviewID": "R2SL7O128SRHYQ", "Overall": "4.0", "Content": "I will probably update after more use (especially in low light situations), but so far this camera is great for what I will use it for.  I love concerts so that is my main point of having a camera and then for family/friend get togethers.  I love the zoom on this camera and the many functions it comes with.  I can easily and quickly touch up photos right on the camera, which is a great function.  The GPS is there too, if needed, but I haven't really had the need to test that out.  It powers on quick, there are several settings to choose from, the look and feel of the camera is great!  I'm not too fond of where the flash is because I always end up putting my finger there to take a picture and have to remove it for the flash to come up, but that's just a habit I'll have to start putting my finger elsewhere!I originally went in to buy the Nikon P510 because I heard that was great in low light and has amazing zoom, but it was just too big for me at this time.  Maybe down the road I'll go toward that size, but it's not for me right now and was informed the S9500 had really good zoom and low light qualities as well.Two reasons for the 4 stars are:You have to charge the battery IN the camera.  The camera doesn't come with an external battery charger.  I had to buy an external charger (another $20) that plugs directly into the wall without the cord to charge the battery outside of the camera.  Nikon does sell an external batter charger for this but it's a charger that has a 4 ft cord that plugs into the wall case that came with the camera, again, not very functional unless you don't mind a long cord to charge your battery.  The cord for me would have sufficed if I couldn't find a different charger, but I did.  This comes in a few days so if it works, great!  If not, then I will go back and get the corded charger.The second reason is the WiFi.  Not a deal breaker for me, but it seems to be a bit finicky and doesn't stay connected very long.  The app needed for the WiFi isn't the greatest and the functions are very limited and you will need to set the settings on your camera to where they need to be before connecting WiFi because once WiFi is on, you cannot change settings on your camera (unless I'm missing something), only through your phone and those functions are limited to zooming in and out and is not quick at all.  It also took me some time to get the WiFi to connect, but I think this was because the instructions on it weren't the clearest.Overall, great camera for what I will use it for and the WiFi and battery aren't deal breakers for me.  I will update later once I put it to test in a concert setting.Update 4/28/13:  I took this camera to a concert last night and was rather impressed.  It took great pictures in the low light and the zoom is awesome!  I didn't zoom to the fullest as it wasn't needed, but am impressed.  And my battery was hardly used at all and I took about 100 pictures within a matter of a few hours.", "Date": "March 24, 2013"}, {"Title": "Awesome camera", "Author": "Suzanne S", "ReviewID": "R1E4GNOXHK9IQH", "Overall": "5.0", "Content": "Love this camera right out of the box. It is replacing a Coolpix S8000 (the lens got scratched) which takes amazing pictures. The S9500 does everything the 8000 did and has a few new features that just make it so much fun! If you are used to a Nikon you will find it very easy to navigate. As a point and shoot camera it is a wonderful compliment to a DSLR (I shoot with a D300s). Sometimes you just want to travel light with a small camera that still allows you some control and flexibility. This camera also has a terrific wide angle to zoom lens which allows you to get the shot where ever you go. I haven't used the wifi feature yet but did want to share my enthusiasm for this camera!", "Date": "July 14, 2013"}, {"Title": "Love the camera, but...", "Author": "Elliot", "ReviewID": "R3M03OIOS8ETA4", "Overall": "3.0", "Content": "I have had the camera for about 5 days, using it every day with great results.  I would second all the positive things the posters above have said.  But today, the WiFi stopped working.  If I take out the battery and put it back in, it works again, but only for a few seconds.  I took 2 stars away for the hassle of having to send it back and wait for a new one.  I hope this is not a recurring problem.", "Date": "March 3, 2013"}, {"Title": "Unreliable.", "Author": "Elizabeth/Michael", "ReviewID": "R2RBPEOF8QJXXT", "Overall": "1.0", "Content": "First S9500 went back before we could even use it.  The battery wouldn't hold a charge longer than a day.  We thought, and still think it was a problem with the charging cord.Got a second one and took that S9500 on a two week trip.  We used it constantly so had a good opportunity to see results under repeated use.  Although this second one did much better on the battery charge, occasionally, it would register low or no battery and then turn off when it should have been charged.  Maybe this was a charging cord issue again (?)Sometimes too, we would have the opposite problem where it wouldn't turn off and we would have to turn it over and remove the battery to get it to turn off.The round dial on the top next to the shutter button that allows you to change the settings ie.  portrait, landscape etc. was a constant source of problems as well.  Ultra sensitive, putting it in and pulling it out of the case or handing it to another person could easily change the setting and we have lots of blurry pictures from the settings dial moving without our notice.With the exception of dial setting errors, pictures from the trip are crystal clear, the slim, lightweight design of the camera made it easy to tote around and pull out when needed.  The display monitor was great and the camera had more functions than I could ever begin to use but in the end, we weren't willing to put up with the little annoyances so it went back.", "Date": "June 25, 2013"}, {"Title": "Even better than the S9100!!!", "Author": "TAF", "ReviewID": "R85GZXXQCMT7T", "Overall": "5.0", "Content": "I had the S9100 camera, and this one is even better.  Easy enough to use for a complete noob, but with enough features that a somewhat advanced hobbiest can play with a lot of functionality.My level is wanting a great shot (often from a great distance) without having to carry around a giant bag of lenses and such.We took our S9100 on vacation to Alaska, and all the people with their $1000+ cameras were getting no better shots than we were, and we didn't have to change lenses, so didn't miss shots up-close or far-distant. In addition, we got HD video of the trip as good as fancy video cams!  (Just remember to change the video focus mode to continuous so that you can zoom in and out while taking video and the focus will adjust as you zoom.)  The dedicated video record button is a huge bonus, because it means you don't have to switch modes or dials or menu options to go straight from snapping a photo to recording a video.  We caught wildlife views that no one else could by one quick button press to record video.The S9500 is all this and more, with GPS tagging and increased Zoom to 22x.Bonus for me is that it takes the same EN-EL12 batteries as my S9100 took, so the extra batteries that I have fit it perfectly.My recommendation... get this camera...  Get the Square Trade Accident Protection Plan  purchase about 6 extra EN-EL12 batteries  get a Universal Digital Camera Charger for Li-Ion Batteries (charges many types of camera batteries with a wall plug and car plug included)  get 5 to 10 SDHC 8gb (or 16gb) \"Class 10\" (this allows high speed video to record longer) cards  a good quick access camera case  and \"GGS Optical Glass LCD Screen Protector 3 inches for Digital Cameras\" to protect the LCDSo what happened to my S9100?  It slipped out of my hand and hit the pavement on the only unprotected corner that my camera case didn't cover.  After getting a refund because they couldn't fix it from a big-box electronics store (after almost a year of them having my camera), I chose Amazon to buy the S9500 because the Square Trade Accident plan would have had my camera back or money to me in a very short time, and the Accident plan is much better than I could find anywhere else.", "Date": "July 29, 2013"}, {"Title": "Camera Freezes After a Few Shots", "Author": "Michael L. Dixon \"Mike\"", "ReviewID": "R3G0IUDOOHYBK", "Overall": "1.0", "Content": "I was excited to get this camera as I'd had earlier versions of this Coolpix series and overall they are great cameras.  It takes a good photo and is easy to use.  But after using it for about 2 weeks, it started freezing after taking a few shots.  I'd have to take the battery out to reboot and after that it would work for a few shots.  The problem is getting progressively worse and I'm sending it back today for repair.  For it's class this is a relatively expensive camera and it's disappointing to find this problem with the Nikon.  Now in surfing the net I see that this is a more systemic problem than a one off outlier as I see others are reporting this too.", "Date": "May 21, 2013"}, {"Title": "Focus problems in low light", "Author": "S. Pollock", "ReviewID": "RP798ES2L8MIX", "Overall": "2.0", "Content": "When I first got the camera, I really liked it.* The zoom lens is excellent, I got some nice shots of birds and buildings* The macro works well; got nice shots of wildflowers; great color, etc.* The panorama feature worked well about 50% of the time.However, when I tried to use it indoors after a while I went from happy to frustrated quickly.  In a museum (with low but sufficient light), the camera just wouldn't focus within 5 feet (for example to take shots of placards instead of taking notes, or of various carvings).  I tried with no zoom, tried all the autofocus modes, then ultimately reset to factory defaults.  This helped a little bit, but still ended up with a lot of out of focus pictures.  There seemed to be a manual focus mode, but I couldn't figure it out.So the camera went back...It's great for outdoors.", "Date": "April 24, 2013"}, {"Title": "Great Camera", "Author": "Sammy", "ReviewID": "R26NJUQAIHWK0G", "Overall": "5.0", "Content": "Even better camera than expected.  Zoom is phenomenal and picture clarity is awesome.  Have yet to find a situation that it will not take a great picture.", "Date": "April 28, 2013"}, {"Title": "Batter problem", "Author": "KathleeG", "ReviewID": "R1G379A1XXD03D", "Overall": "1.0", "Content": "The camera battery will not stay charged. Put it into the camera and it looks as if it is fully charged and within 10 photos it dies. I ordered 2 additional batteries and they do the same things. Very disappointed.", "Date": "September 11, 2013"}, {"Title": "Achilles' Heel", "Author": "AaronAbasolo", "ReviewID": "RL6GBCLDC4H9V", "Overall": "2.0", "Content": "This camera has a BIG weak spot, you cannot charge one battery while using the camera with a second battery, since the battery has to be IN THE CAMERA to charge it using the included charger, which is just a USB power supply which connects to the camera via a non-standard USB connector. To add inslt to injury, the supplied USB cable has a heavy ferrite noise-suppressor \"lump\" in it, making it bulky to carry.I'm returning it, and I'll buy a Fuji or Panasonic, which come with simple one-piece plug-in chargers with fold-out prongs, which allows you to leave one battery charging while you are using the camera with a second battery. Nikon apparently thinks you'll shell out another $25 for this type of charger, which should come with the camera in the first place!In addition, others have complained about poor focusing in low light, and that the wi-fi will only transfer low-res versions of your photos, not your full-res originals.", "Date": "August 5, 2013"}, {"Title": "Not Good!", "Author": "K. Lee", "ReviewID": "R1BRKF23YQ8ZP1", "Overall": "1.0", "Content": "I bought this camera to upgrade from the Coolpix camera I have now and when I got it, it was very cheaply made and made a clicking sound when not in use. Sent back immediately.", "Date": "October 6, 2013"}, {"Title": "The battery was defective, and Nikon doesn't seem to care", "Author": "captain america", "ReviewID": "R35CPTXIOBSXIR", "Overall": "2.0", "Content": "I bought this as a replacement camera for my wife's. She rarely uses a camera, but her previous one would keep a charge for multiple weeks. With this one, the battery ran out in a matter of hours. By the time I realized there was a problem (it took multiple weeks, and then further weeks for me to act on it), it was too late to return it to Amazon, and I had to deal with Nikon support... Here is the transcript below. For those who don't want to bother read it all, it basically says: \"tough luck you received a bad battery, just buy a new one\".=====Customer via Web 09/29/2013I have hardly been able to take any pictures due to the fact the battery runs out in a matter of hours after full charge. I use the camera very seldom (I have it with me in my bag to snap pictures of the kids every now and then) and every time I have wanted to use it, the battery has run out. This is not hapenning with any other camera I have (including my Nikon D80).=====Response Christine C. via Email 10/01/2013Hello Mr. xx,Thank you for contacting Nikon Customer Support. It sounds to me that the battery is exhausted and needs to be replaced. I would recommend purchasing a new approved battery for your S9500 and the issue should be resolved.Answer Title: Battery, Charger and AC Adapter CompatibilityAnswer Link: [...]Please click on the link above with Nikons contact information, if you have any further question.=====Customer  via Web 10/02/2013Don't you think you should send me a new battery? This problem has occurred since day one, and I hope I am not expected to purchase a new battery with a brand new camera?=====Response Christine C. via Email 10/02/2013Hello Mr. xx,Thank you for contacting Nikon Customer Support. Batteries are not covered under the one year manufacture warranty but if you feel the battery is defective you can send it in for service to be evaluated.All Nikon cameras(Chargers) come with a one year manufacturers warranty and Nikkor lenses have a 5 year warranty that covers manufacturing issues only. Any issue caused by physical, sand, or liquid damage is not covered as these occurrences void the warranty. All Nikon digital products sold by Nikon Inc. have a standard one year warranty from the date of original purchase. Please keep your original proof of purchase or an alternate form of documentation that validates your purchase for warranty consideration.Once we receive your equipment it goes though a preliminary inspection process that is done by one of our technicians. Once this process is completed, we register your equipment in our system and we send you a notification to the email address provided and a physical letter to the mailing address provided. This email and letter will include the list of accessories we received along with the product, it also includes information stating if your repair will be covered under your one year warranty or whether an estimate will have to approved in order to complete the repair. Repairs generally take 7-10 business days to complete as long as all parts necessary for the repair are available. Next the product will undergo a quality check that can take a couple of days then it will be shipped back to you via UPS.If your warranty has expired or the warranty was voided and you’d like to inquire about repair pricing, the online service page provides initial estimates based upon your description of the problem with your equipment. This price is an estimate and is subject to change. The price does not reflect the shipping cost and taxes as required by local, state and federal governments or applicable discounts.We apologize for the inconvenience and will do everything we can to repair your Nikon camera as quickly as possible. After sending your product into service, we will mail your service order number after your product has been logged into our system.Repair information:[...]Please click on the link above with Nikons contact information, if you have any further question.Sincerely,ChristineNikon Technical Support======Sending it back to Nikon for \"evaluation\" sounds like a hassle. At this point I am giving up (too easilly?) and just purchased a replacement battery. But clearly I am disappointed that a 250$ camera doesn't come with some kind of guarantee for the battery.", "Date": "October 5, 2013"}, {"Title": "Awesome camera", "Author": "FACTS MAY AT TIMES BE FRUSTRATING", "ReviewID": "R16LO3Q2MVS8A3", "Overall": "5.0", "Content": "I already Nikon Coolpix  s 6500 12 x wide fullHD. With wi fi.But s9500 is a miracle. If you like travelling, taking a lot of photos then forget where you had taken them, then this is the camera you need. Thanks to the GPS feature, you keep track of your own trip with date and time.If you are planning to purchase a camera, go for it. You wont regret!", "Date": "September 1, 2013"}, {"Title": "The Legend Continues", "Author": "Joseph Albanese \"The Joe Show\"", "ReviewID": "R1JW8HK6O6WYMZ", "Overall": "5.0", "Content": "With 18 megapixels and a 22 x zoom lens, the Coolpix S9500 is another winner in Nikon's line of digital cameras.As with earlier models, the S9500 is sleek and thin, it can easily slip into your pocket or the smallest of bags without causing clutter, but only the size is small - the rest of the camera is legendary.Easy to use (Point and Shoot mode or a phlanx of shooting options), you don't know where to start when looking at Nikon's latest Coolpix.  The 18.1 mp's are quite impressive and the shooting results are nothing less than extraordinary.  The CMOS allows shooting in very dim light without any loss in end product results.  And, of course, the camera still maintains the hallmark excellence of the Nikkor lens - probably one of the finest lens that is on the market today.But Nikon has not rested on just those remarkable laurels - they've moved with the times (as always) so the S9500 has a relatively easy WiFi function.  Coupled with a free app (I am using an iPad where the app is called NIKON WMU (wireless mobile utility)), you can immediately transfer your photos from the S9500 to a tablet, your phone or computer.  No wires or patching required before you are posting your beautiful photos onto Facebook or any other social network!There is also a built-in GSP that I am still toying with - living in New York City it is active but has not found (or can't find because of the buildings) a satellite signal.  But that doesn't take anything away from the ease of use, fantastic photos and sturdy construction of the S9500.", "Date": "February 28, 2013"}, {"Title": "Pocket camera takes great pictures with many built-in features", "Author": "Ivan Pedruzzi", "ReviewID": "R2IB8MOCMY4IFR", "Overall": "5.0", "Content": "The Nikon S9500 takes excellent high resolution pictures and movies in a considerable small package. With a battery charge you can go on a full day. I was positively impressed by the low light video capturing: we recorded the fireworks at DisneyWorld at midnight which resulted in clear clip with natural colors.The GPS tagging is very convenient. While the wireless transfer sound cool in theory is not practical, unless you are using google cloud, in which case makes it easy to sync your pictures with your IPad or IPhone.The plastic door which closes over the lenses when the camera shuts down fails to close occasionally, the behavior appears to be random. When it happens, clicking on and off again makes the door close properly.", "Date": "September 2, 2013"}, {"Title": "Battery Will Not Charge, Camera Will Not Turn On", "Author": "S. Busby", "ReviewID": "R2VLMW4T5V0M3G", "Overall": "1.0", "Content": "I bought this camera a week ago, but not through Amazon.  I followed all the instructions for preparing the camera and it indicated that the battery was fully charged.  I took a few pictures the day I got it and stored it for the remainder of the week.  When I got it out yesterday, the battery was low (even though I had not been using the camera).  I took 2-3 pictures and the battery was exhausted and the camera shut off.  I tried to charge the battery for a few hours.  The manual says there should be a green light flashing while charging.  I saw it blink a few times, then quit.  When the time came that it should have been fully charged, I tried to turn on the camera, it came on only for a split second and has never turned on since then.  According to my voltmeter, the 3.7v battery has 2.6 volts on it, which should be enough to at least get the camera to turn on with a low battery indication.With what few pictures I got, I was not impressed with the results of indoor pictures using the flash.  This may be due in part to me not having enough time to get familiar with the different settings, though.At this point, I'm not sure if the problem is with the battery, the charger, the charger cord, or the camera itself.  All I know is I've had it one week and it won't work.", "Date": "August 17, 2013"}, {"Title": "Tiny package with grand features", "Author": "Darbys Mom", "ReviewID": "R94W6OCIUWWSY", "Overall": "5.0", "Content": "bought this for travel.  So small it is easy to tote.  Love the GPS - can see where we were on vacation!  and I replaced another brand camera -  The batteries last on this camera I was prepared to change frequently and I did not have to.  Beautiful photos and great zoom  I am over the top happy.", "Date": "October 17, 2013"}, {"Title": "Odd focusing in low light", "Author": "Donna Visocan", "ReviewID": "R2Y4GLH5JWW6OL", "Overall": "2.0", "Content": "I've owned several Nikon Coolpix cameras and wanted this one for its high zoom capability.  Unfortunately, the camera's inability to focus on things in low light caused me to return this one.  I also did not like the pop-up flash which was located exactly where you hold the camera.  This camera might be suitable for someone who wants to adjust settings, but if you are looking for a true point and shoot that auto focuses quickly, this is not the camera for you.", "Date": "August 16, 2013"}, {"Title": "Nice Camera - Not Working", "Author": "Tim Rathbun", "ReviewID": "RUPK3I6DVZMID", "Overall": "1.0", "Content": "After charging the battery I found the outer shutter would not open or not fully open. This is potentialy a very nice camera however the one I recieved was defective. Thanks to Amazon I was able to return the camera for a complete refund.", "Date": "May 21, 2013"}, {"Title": "Battery wouldn't charge out of box", "Author": "Susan Denny", "ReviewID": "R1LVAQYU5D916L", "Overall": "1.0", "Content": "The Nikon S9500's wide angle and premium zoom were excellent features that worked well. I had the camera for one day when the battery, after a couple dozen shots needed to be recharged.  It charged for several hours but the error message was only ever \"battery exhausted.\"  I was exhausted trying to get it to charge.  This camera seemed to have a lot of potential but didn't want the headache of dealing with something that didn't work well right out of the box so I took it back.", "Date": "May 19, 2013"}, {"Title": "Awesome!!", "Author": "Ronald W. Dvorsky Jr.", "ReviewID": "R8TH28JCL9PZ9", "Overall": "5.0", "Content": "Easier to use than my full size digital SLR camera.  Small enough to put in pocket.  WiFi enabled to see photos/edit on iPad or iPhone without having to go home to upload and post on social media using Nikon App. Sync's with GPS without wait before taking photos.  Great photo quality.Cons:  None at this timeWould recommend to friends and family", "Date": "October 3, 2013"}, {"Title": "best compact camera", "Author": "kk", "ReviewID": "R37OAT8382UQEL", "Overall": "4.0", "Content": "S9500 is easy to use with multiple image and video shooting modes. We were looking for a camera which has minimal manual settings and still clicks best shots. Coolpix s9500 is surely among them.It provides best shots in outdoor,  even in bright sunlight. Different modes like panorama, sports, night, food , macro r good. 22x zoom is is stunning. I can get well focused images even at full zoom. Face focus and manual focus works well. I am yet to test it indoor low light/party mode.I liked smart mode feature the most. Alaid I tested Wi-Fi in this s9500 and it works superb. U can view and take pictures wireless. Some people had problems with Wi-Fi bit I m able to do it.Cons: sometimes camera throws weird sound in few modes which one may not b able to hear since it it's v low. Also pop-up flash is at incorrect position, u always keep ur finger on it while clicking the snap.Update 09/06/2013I took Coolpix S9500 camera to my summer holidays and very happy with that. I was able to take more than 300 shots in 1 day with the battery still showing more than 50%. (GPS and WIFI off, No videos). Never ran out of battery issue.It takes 2-3 seconds to focus when u r using full zoom but that was fine with me. But the quality of zoom photos was fantastic, no complaints.Also low light shots are clear especially images captured in museums r good.Initially I have to try different modes/flash on-off to get correct image quality. But imagas r good at the end. Biggest con of this camera i noticed is the placement of pop-up flash, which is disturbing while taking images as I mentioned earlier.Overall , I found this camera best in its category for outdoor and low light shots. Great work by Nikon!", "Date": "August 16, 2013"}, {"Title": "Better than expected", "Author": "Faithful husband", "ReviewID": "R8750NVVG0VSQ", "Overall": "5.0", "Content": "My wife comments \"boy does this take great pictures!!\".  The options work great, like close up, zoom, panorama etc.  The only draw back is the location of the flash, It is where you put a finger to hold it.", "Date": "June 2, 2013"}, {"Title": "Will not charge any kind of battery. Even a Nikon battery.", "Author": "Patrick", "ReviewID": "R3M415VD5DOYRG", "Overall": "1.0", "Content": "I have always been very happy with Nikon products. I was very disappointed as soon as I try to use the camera. I have purchased a lot of accessories and extra batteries to go with the camera however the original battery would not charge. I tried other batteries in the camera and they also would not charge. The manual says you should have a slow green blinking light while it's charging mine would not even do that. I'm not looking forward to shipping this back and going through all that hassle.", "Date": "March 22, 2013"}, {"Title": "Works for me.", "Author": "James Skinner", "ReviewID": "R3TOA32KD2H5I9", "Overall": "5.0", "Content": "The camera I had previous to this one used film, so I'm obviously no great judge of cameras. Having said that, the Nikon s9500 has exceeded my expectations. I've owned it for several months, more than enough time to expose any manufacturing defects. I've had no problems. The zoom, one of the main reasons I bought it, allows me get the shots I need. I take mainly outdoor photos, and in my opinion it works great in low light. I never use the flash, have it disabled.As for the setup, I had it up and running in a matter of minutes. Not much information in the quick start guide, but even for a beginner its easy. My only complaint is about the wifi. You would think they would include a few setup instructions for it and the mobile app you need. Nothing that I could find. I had to go to YouTube to figure it out, but once I saw the video it was easy. As for how the wifi works I've had zero problems transferring pictures to my phone. A minor complaint, and one I don't understand, is why edited images will not transfer over wifi.As for video it looks beautiful on the camera and my computer, however it doesn't look as good when uploading it to Facebook, again I don't know why. Maybe someone else can answer that.My final conclusion is this is a great little camera. A few minor complaints aside, I'm very happy with it.Update: I mentioned in my review that videos uploaded directly to Facebook did not look as good as they did on the camera or my computer. I found out If you upload the videos to YouTube and then from YouTube to Facebook they look great. Problem solved.", "Date": "June 25, 2013"}, {"Title": "Very misleading product description- can not transfer pics directly to FB", "Author": "Robert Bacsik", "ReviewID": "RBUMYWWOQ4258", "Overall": "2.0", "Content": "\"Shoot a stunning panorama landscape, then instantly share it - along with the exact location it was shot\" False advertising- extremely misleading!We just received this camera in the mail and are returning it on Monday. We purchased this camera after reading great reviews, and going over the manufacturers product description and specs many times. We were under the impression that like they state above, that we would instantly be able to share our pictures. Nowhere (not even in the manufacturers guide that comes with the camera) does it say that you need to download an app onto your smart phone and then sinc the camera to your device, then upload your pictures, and then you are finally able to \"instantly share\" your pictures. At first we thought that we were doing something wrong, but after several hours of searching, I finally found an honest review on a photography website that described the camera as \"a great smartphone accessory\". We did not pay several hundred dollars for a Smartphone accessory. Not as convenient as we thought, and we are very disappointed in the blatant false advertising by Nikon.Besides this function (which was the sole reason we bought this camera), the camera works fine and is very light weight and well designed. We will return it and wait until their competitor finishes their unfinished design and actually comes out with a finished product that can actually \"instantly share\" photos online.", "Date": "August 4, 2013"}, {"Title": "Took it to spain and got lovely pictures", "Author": "Bhroam Mann", "ReviewID": "RYTZE2CSG9J0N", "Overall": "5.0", "Content": "I bought this camera for my trip to spain.  I came home with amazing pictures.  I was able to zoom to frame my pictures perfectly.  Several of the cathedrals had a no-flash policy.  The camera was up to the task.  I took plenty of inside pictures.  I even turned the flash off in some buildings when I could have used it since it did such a good job.The only real con is that the GPS can't get a signal inside.  Outside it locks on really quickly.", "Date": "May 29, 2013"}, {"Title": "Nikon S9500 works for me!", "Author": "1080p fan", "ReviewID": "R1R7Q6SL66RYZY", "Overall": "5.0", "Content": "Hello,We just returned from a 2 week European trip using the Nikon S9500.The Nikon S9500 (primary camera) was awesome with GPS, other nice features, and the 4.5mm-99mm zoom got me right in there when the shot required it. The GPS data were awesome to remind us where we were when reviewing photos. No more taking photos of street signs.For about $100 more than the Nikon S6500 (my smaller backup camera, no GPS, that I returned after the trip), I recommend the slightly larger and a bit heavier Nikon S9500 instead. Buy a separate charger and at least 1 extra battery if you plan shoot more than 200 photos per day. Use the wrist strap (saved me twice), and don't drop it!  Costco has a nice kit that includes a belt case and 16GB SD card.Couldn't get the Wi-Fi to move photos to my PC or phone, but I simply removed the SD card and uploaded the photos and video to my notebook PC daily.  Now that I have more time, I can figure it out for the next trip.Hope this helps.John", "Date": "October 13, 2013"}, {"Title": "camera defective", "Author": "bill caldwell", "ReviewID": "R1XNLKLUO3JYGP", "Overall": "1.0", "Content": "original camera did not operate......replacement camera did not operate both returned to vendor. Contacted Nikon who could not correct the problem", "Date": "March 16, 2014"}, {"Title": "Camera ran hot.", "Author": "Penny Schritz", "ReviewID": "RI4LFHJXJ8OCF", "Overall": "1.0", "Content": "Not good.kept running hot, and would turn off after taking 4or 5 pictures or looking at pictures. Sorry I had to send back. I will wait awhile before I buy another.", "Date": "February 17, 2014"}, {"Title": "Nice little camera", "Author": "Marie", "ReviewID": "RY0S18D0ZLINV", "Overall": "5.0", "Content": "This was purchased for our 13 year old grandson. We selected this particular model from the many available primarily because of the size of the zoom and also that it has a rechargeable battery. Although some reviews seem to favor regular AA's, we know the amount of disposables would be hefty. I purchased an additional battery and separate charger so that he always has enough for extended use. This camera has all the bells and whistles you could need but the best thing is the quality of the pictures, which are excellent for a camera this size and price range.", "Date": "January 28, 2014"}, {"Title": "broke after a month - never really worked that well", "Author": "Jordan", "ReviewID": "R99G9ZMBFBJK6", "Overall": "1.0", "Content": "I have an older version and thought it was time for an upgrade.  I should have followed the rule of if aint broke don't fix it.  Anyway after two weeks the battery would not charge so had to return it.", "Date": "January 25, 2014"}, {"Title": "Horrible battery life. Took great pictures for 4 months", "Author": "Ted G.", "ReviewID": "R2E74RBYLCJ8L1", "Overall": "1.0", "Content": "Bought camera in July, 2013. Only charged the battery 3 or 4 times and when I tried to use the camera this week it said battery depleted and won't charge at all now.  Nikon said I ave to send everything in for technicians to troubleshoot.  Won't send a replacement battery otherwise.", "Date": "January 13, 2014"}, {"Title": "Keeps shutting itself off", "Author": "Edward D. Webster", "ReviewID": "RKYYIVE4K12AS", "Overall": "1.0", "Content": "Bought this camera in June 2013Began having problems shortly after. It kept shutting itself down with lens open. Had to pull out battery and put back in to get it to work. Over and over and over.My store replaced it with another one (S9500) and now it has the same problem. Plus the zoom has a way of taking off and zooming all the way in after I stop pushing the button.Pictures are good, but you miss a lot of pictures taking the battery out and waiting for it to re-boot.", "Date": "January 10, 2014"}, {"Title": "Not as good as expected", "Author": "John S", "ReviewID": "R28VXF3F4V2VNR", "Overall": "2.0", "Content": "Lot's of technology in this.  Case seems cheaply made, to cut on costs.  Do not like the pop up flash (preferred the built in of my old Lumix), particularly as it pops up right where I usually put my left index finger.  Standard pictures are generally good.  But the flash, at shorter ranges, frequently leaves the picture over exposed.  Have had some issues with focus and sharpness, beyond what would be normally expected, on higher zoom shots.  Got a good price on this camera, but would not buy it again.", "Date": "December 27, 2013"}, {"Title": "Disappointed in nikon.", "Author": "Bill Nelson", "ReviewID": "R182L6K37VPUXV", "Overall": "2.0", "Content": "Focus issues made this camera a real disappointment and after years of using nikons finally pushed me over to canon. Amazon deserves five stars for making the return easy even under some unusual circumstances. But the camera shoots soft under all conditions. Avoid.", "Date": "December 9, 2013"}, {"Title": "Very cool camera!", "Author": "Barry", "ReviewID": "R3V24WIOP2BUL7", "Overall": "5.0", "Content": "I have a Nikon 3100, but I hate lugging it around.  This is exactly what I was looking for.  I wanted high definition as well as a strong zoom.  22X...... Boo-yah!  I had read that some folks could hear the motor focusing while they were taking videos.  I haven't noticed that concern so far.  Very happy with this dandy little camera.  My son asked for my opinion on a camera.  He also bought this camera, and is also very happy with it's diversity.  He lives in the Rockies and has kids, so has multiple opportunities to use the various capabilities of this camera.", "Date": "October 30, 2013"}, {"Title": "Great camera", "Author": "Sheri H Friedrich", "ReviewID": "R1T7MDR3PM98OV", "Overall": "5.0", "Content": "It's perfect! It's everything I wanted in a compact camera. It takes great pictures, including action shots. I brought it to a Red Sox game and the people behind me couldn't believe how clear the shots were. Looking forward to taking lots of pictures of my new grandbaby with this camera.", "Date": "October 11, 2013"}, {"Title": "Terrific Compact Camera", "Author": "Thomas Jefferson \"Willieboy\"", "ReviewID": "R1VWRN8VWLJ69P", "Overall": "4.0", "Content": "This is without a doubt the best compact camera I've ever owned.  Superior features and quality as well as great zoom length.  Especially easy to learn all the most important features and use of all it's capabilities.  The only improvement I could see for this camera would be to somehow have the flash built into the front of the camera instead of popping up from the top left side.  It's a small new habit one has to form to make certain your hands are not holding the camera at the top left side so that the flash can pop up properly when needed but by no means is this a major issue as the camera has so many easy to understand and use features enabling the owner to take superb pictures.", "Date": "October 7, 2013"}, {"Title": "Great Camera", "Author": "MattyBoy717", "ReviewID": "R1TVEEE2X9VB3U", "Overall": "5.0", "Content": "Well, for me, this camera is as close to having a full size SDLR as I could get on my budget. It takes great photos and the 1080p video looks beautiful. Lots of different options for individually creative shots. I highly recommend this camera.", "Date": "September 22, 2013"}, {"Title": "WI-Fi does not work", "Author": "Reynaldo", "ReviewID": "R7HLZBHZGDYEZ", "Overall": "3.0", "Content": "great pictures, but case is cheap plastic and Wi-Fi does not work, I would look for a different brand, not worth the money", "Date": "August 30, 2013"}, {"Title": "Must have got a lemon :-(", "Author": "D. Gehlsen \"Nikon Shooter\"", "ReviewID": "R2YW0Q3OW6T7KG", "Overall": "2.0", "Content": "Pretty disappointed with Nikon, first Nikon that I have had problems with. Love the design, much better then the Sony HX30. The P9500 has large buttons, snappy operation and quick GPS position acquisition which are important to me as as a real estate appraiser. First outing got a \"lens error\" where the lens got stuck extending and a lockup. Had to manually push the lens in to get it unstuck and I was getting camera lockups. The camera would freeze, the live view would still be working , but it would not focus, zoom, or take a picture and would require the battery be removed to reset it. After a while it would freeze after 10 or 15 images. Pretty disappointed that it was going on but not sure if its a lemon or something wrong with the camera in general. Sending it back and trying out the Nikon P330, hopefully will have better luck with that one.", "Date": "March 14, 2013"}, {"Title": "Great camera - better WiFi Service Needed", "Author": "David J. Martin \"Opera Lover\"", "ReviewID": "R993GKW4EE2LU", "Overall": "3.0", "Content": "This is our second Nikon Coolpix. We loved the first and used it well all over the world. We wanted a new camera that was just as good, but with WiFi and GPS.  We were happy to see Nikon had added these features.  To start with, the camera takes great pix as did its predecessor. Good in low light and great for zoom.  Small enough to fit in a suit or jacket pocket so we could take it to dinners and theater when we didn't want our big camera around.  The GPS works quite nicely although they indicate you have to turn it off manually as it continues to run even when the camera is off, using up battery.  You would think they could do this automatically.  With the WiFi service it does shut off when the camera is turned off.  You download free software for your phone/iPad and it connects to the camera.  This works just fine, but it's not what I thought we were getting.  We were hoping it connected via WiFi directly to the internet and could upload our pix either to the cloud or select photos directly to Facebook, etc.  The new Samsung Galaxy cameras do this.  This really is just a transfer utility moving pix from the camera to your phone or iPad via WiFi.  From there you can upload them the usual way. And it uses WiFi for this near-field type communication instead of Bluetooth. I'm not sure why as an application of this type could easily be done by Bluetooth.  When the iPad/Phone connects to the camera via WiFi your internet connection via WiFi is terminated. Once you disconnect the camera you then need to reconnect your Internet WiFi. While this is a step in the right direction for Nikon, it's not far enough to compete with Samsung in this regard. They need a better software solution for this camera.", "Date": "October 13, 2013"}, {"Title": "Coolpix S9500 works great", "Author": "Daniel Hier", "ReviewID": "R3MMYCJ4CUPN9M", "Overall": "5.0", "Content": "I love the wireless feature that allows me to download pictures to my iPhone without a wireless network--Camera creates its own hotspot.  Pictures are of high quality.  Camera is easy to use. Compact and easy to carry in a pocket.", "Date": "June 14, 2013"}, {"Title": "Disappointing", "Author": "Tom M.", "ReviewID": "R3RMFDOLK1O5UI", "Overall": "3.0", "Content": "Let's get the good out of the way: The pictures look great for a point and shoot, different modes available for shooting, and it's awesome in low light. I don't think I ever used the flash.Now, the bad. It freezes. The power button doesn't always turn the camera on. If there's too much motion, it will refuse to take the picture. Or, it just won't take a picture anyway. I missed a lot of candid shots because of these issues. When you're taking videos and zoom, the motor is slightly audible. If you have the full-time motion control on during a video, it's constantly clicking which you can hear in the videos.I went through three of these in a row. The first, after a day or two, already had dust in the lens enclosure (why I sold my previous camera, a Panasonic ZS7). The second had hardware problems; the flash didn't feel solid as it sort of 'squished' back into the case and didn't always lock. The third I had for a while on a vacation, and the aforementioned problems happened (freezing, crashing, etc). I'm taking this back and maybe trying out the SX280. GPS is a feature I really like and that narrows my options down severely.It seems like all of these problems could be resolved with a firmware flash, but it doesn't seem that Nikon wants to address it so I'll be returning camera number three (the first already had a speck of dust in the enclosure, and with the second, the flash mechanism didn't lock back in place).", "Date": "July 16, 2013"}, {"Title": "Image quality great, audio needs a redesign", "Author": "Mandy", "ReviewID": "R182YNLGY06XKQ", "Overall": "3.0", "Content": "I recently got this camera for a concert I was attending (Mumford and Sons). I wanted to have a camera with a good zoom so I could get close-ups. Wow, you can't even imagine how close this camera gets.  I ended up being front row, and didn't really need the zoom, but when it was used, clarity is amazing. It did take me a while to figure out what setting worked best, and I do think I could he gotten a lot more shots if it fired faster.  Also, when the band ws moving, forget it - all shots were blurry.  When the flash pops up, it is awkward, and kind of cheap feeling.  I don't really like to use flash, but when it popped up, I always felt like it would break off the camera.  I used the 3D photo option, but honestly think this is a stupid feature, unless when i put on 3D glasses the photos are amazing. Currently they just look like a double image. The video clarity when you playback on the camera, or computer is incredible as well, but when transferred to a site like YouTube, even when in HD, the quality diminishes.The most MAJOR COMPLAINT I have is the microphone.  Completely awful design and poor ability to pick up sound.  The microphone is on the left side of the camera, and it is just two small openings.  The quality didn't turn out awful, you can hear the band, but it is so close to me, that my voice is just too loud.  I want to go to a show to sing my heart out, but not actually have to listen to it.  I feel like a large portion of my videos are ruined because of this. I never had this problem with my old nikon, the mic was on the bottom.  It should really be in the front, we when you film you're tying to pick up external sounds, not your own speaking.  This has such great video capabilities, I just found the poor audio outweighs them.  Here is a link to a video recorded with it, you can hear what I'm talking about.  Please excuse my terrible voice, I did not know it was being recorded :)http://m.youtube.com/watch?feature=plcp&v;=Vl9BVFOb3kg", "Date": "June 6, 2013"}, {"Title": "Worked great for 3 months and then died", "Author": "Leonard Inkster", "ReviewID": "R7YJCDQZ68NSP", "Overall": "1.0", "Content": "This is a handy camera.  Size, functions, operation and speed at which the pictures are saved are all great, but all of a sudden the camera died.  Won't charge, won't turn on, won't close.  Tried a new batter, nothing.  Warranty sucks so I guess it's off to buy a new camera.  Won't be replacing it with a Nikon.", "Date": "April 5, 2014"}, {"Title": "No Complaints", "Author": "Red Wings \"G\"", "ReviewID": "RSE2LHDVUA0X3", "Overall": "5.0", "Content": "I liked the product that I purchased.  No complaints with it.  It met my expectations.  I would endorse it to others", "Date": "March 12, 2014"}, {"Title": "Nikon S9500", "Author": "Michael Lovatt \"Michael Lovatt\"", "ReviewID": "RXQF9INIRHXJE", "Overall": "4.0", "Content": "Nice little camera. Doesn't look like it but the color is rough and easy to grip, we were expecting a slick anodized body that slipped out of our hands but it grips nicely.  The Wi-Fi is kind of hokey, it downloads slowly with my iphone 5 but it is a nice little feature if you don't mind a few minutes to set it up each time to take selfies or to wait for that perfect shot.  Lots of built in features including exposure adjustment to help lighten up darker shots.", "Date": "February 27, 2014"}, {"Title": "What Happened?", "Author": "KK", "ReviewID": "R271PQU1G92KAD", "Overall": "1.0", "Content": "The camera started out great but stopped working after 3 months. In fact I should check on getting a refund.....", "Date": "February 14, 2014"}, {"Title": "S9500 is REally Nice!", "Author": "Arrow Flight", "ReviewID": "R2ZMXQ6LGZSL9J", "Overall": "5.0", "Content": "I love this camera. I am a semi-professional photographer, and this camera is my go to when I dont want to carry my large SLR Nikon.  This takes really nice low light pictures without flash even with an F3.4 lens. ISO up to 3200, macro mode, 16 scene modes, adjustable white balance, GPS, WI fi compatable ( to send to other device) and selectable 99 focus points>  If you are pretty familiar with camera operations, you should enjoy this camera.  If new to photography, this camera is still suitable, if you take the time to read the manual, or just put it on auto mode and shoot.Enjoy!", "Date": "February 12, 2014"}, {"Title": "Great camera", "Author": "BO", "ReviewID": "RESSY07VUA1B6", "Overall": "5.0", "Content": "I have several Nikon cameras including a small S630 & a large SLR I wanted something as small as the 630 with more functions & better zoom. The 9500 fills my need perfectly. The one I purchased is refurbished but looks & functions like new. I couldn't be more pleased", "Date": "January 31, 2014"}, {"Title": "nikon coolpix s9500 wi-fi digital camera", "Author": "Sue Markowski", "ReviewID": "R19PNZIGSIDZX", "Overall": "5.0", "Content": "I love my new camera:) It has met and surpassed all my expectations I wanted in a digital camera.  I still have to learn more about its features and look forward to doing so. I am so happy my friend suggested this camera to me.  She bought one and used it on a vacation cruise in New Zealand and was very pleased with it. I love the zoom feature the most so far.", "Date": "January 24, 2014"}, {"Title": "Great Point and Shoot and Light Weight", "Author": "Shopper4life", "ReviewID": "R2JW1SK83AQK4H", "Overall": "5.0", "Content": "I am so happy with this purchase, I also own a Nikon D7000 and it is way too much at times to lug around when I just need to take quick pictures.  I am in real estate and need to include date and time stamps on my photos and this model does exactly what I need it to do.  It makes my life so much simpler.  My huge deluxe Nikon doesn't allow the functionality of date and time stamps and what a bummer because that camera cost over $1000.  The camera takes great pictures, excellent and the flash is super.  There is a slightly longer delay between shots which is frustrating for me right now since I have been taking pictures in the freezing cold.", "Date": "January 22, 2014"}, {"Title": "Great camera", "Author": "Colorado Cruiser", "ReviewID": "R1QO7PMQN0WD5V", "Overall": "5.0", "Content": "My workhorse camera is a Canon dslr with a couple of nice lenses but there are times that I don't want to haul around the big camera bag.Canon doesn't have a handheld comparable to this Nikon, and I'm very happy with the pic quality.  The optical zoom is amazing, I was able to get a close up of a face on stage from the opposite corner of a high school theater.You can't go wrong with this camera.  The only drawback is that the charger is fairly large considering it's just a USB plug.", "Date": "January 22, 2014"}, {"Title": "Cool Camera", "Author": "Kokopelli \"Kokopelli\"", "ReviewID": "R359DM4EY89XXC", "Overall": "5.0", "Content": "Great photos from an easy to use camera at a reasonable price. My lady loves her Christmas present. Buy it", "Date": "January 19, 2014"}, {"Title": "Great iPad/iPhone app as well!", "Author": "Matt Perky", "ReviewID": "R8WL2LML6TQ5K", "Overall": "5.0", "Content": "I'm very pleased with this camera in all areas mentioned in other reviews. One thing I haven't seen mentioned is that there is a Nikon app for iPad and iPhone that syncs up with the camera (its called \"Nikon Wireless Mobile Utility\"). It's really easy to use once you have it set up. Basically you can view and save all your photos on your iPad via wireless network. This app makes it unnecessary to remove your SD card from your camera, The days of dragging and dropping files are over!", "Date": "January 7, 2014"}, {"Title": "Excellent!", "Author": "David Lee", "ReviewID": "RJQ4RFI7DL49U", "Overall": "4.0", "Content": "Excellent all around camera, except flash pops up where my left hand finger placement is used to hold the camera.", "Date": "January 1, 2014"}, {"Title": "Nikon COOLPIX S9500 Wi-Fi Digital Camera with 22x Zoom and GPS", "Author": "Amr Arafat", "ReviewID": "R1MYFZ4G3E78E3", "Overall": "4.0", "Content": "- Super zoom- size is suitable- must have memory card for storage- quality of videos are great- easily adjusted settings- I recommend for non professionals photographers", "Date": "December 29, 2013"}, {"Title": "Why did I choose this rating?", "Author": "DIana Gutta", "ReviewID": "R20BLG0ADX9D7W", "Overall": "5.0", "Content": "Recently purchased the Nikon CoolPix S9500 for a gift. First the service was excellent and on time tracking was great.Secondly, this the third Nikon camera that I have purchased and the quality is really unbelievable. Took pictures the other night of the Empire State Building and the colors were just spectacular.  Love this camera.", "Date": "December 28, 2013"}, {"Title": "Who tested the pop up flash?", "Author": "Robert Gustin", "ReviewID": "R3PD05RDZF0E8J", "Overall": "3.0", "Content": "I did read the reviews on how the flash was right where you hold the camera, but being a lefty, I figured it wouldn't effect me all that much given the other great features of this camera. NOT!Almost every time the flash pops up ( probably the last 15 or 20 times) my left finger is right over the flash. Fact is the normal way you hold a point and shoot will interfere with this flash pop up.I love the available settings.One final comment, when deleting photos you must take great care not to click one too many times or you can select a delete of all your photos. Nikon should have not allowed scrolling that loops.If it wasn't for the flash location, I'd rate this camera a 4.3", "Date": "December 27, 2013"}, {"Title": "Will have to return", "Author": "zeusqueen62", "ReviewID": "R3FXL5KF88U2RT", "Overall": "1.0", "Content": "Immediately the lens cover didn't open and I had issues with camera on my entire trip to France.  It is so disappointing because I bought it just so I could have great pictures on my trip.", "Date": "December 14, 2013"}, {"Title": "Good value.", "Author": "BornInVA", "ReviewID": "R3PDRQEKRCVEXM", "Overall": "4.0", "Content": "It is difficult to always get sharp pictures. If you want very high-level quality photos you will need to post process the photos in an editing app, like Photoshop. But, for mediocre shots, this is a great camera. Just do not expect this camera to take the same quality photos of a much higher end camera.", "Date": "December 6, 2013"}, {"Title": "Beautiful pictures with outstanding zoom in a tiny thing", "Author": "Flori", "ReviewID": "R2D2L9ZH9BJN7L", "Overall": "4.0", "Content": "I received my camera (in Red) yesterday and I like the convenience of its size. This only reason I rated 4 stars instead of 5 is because the WiFi feature totally sucks. The camera is either \"negociating\" forever with my iPad mini, either looses connection after a very short period of time (about 2 minutes) and to connect again, it is quite frustrating. So, I will completely forget this feature and use traditional backup to view and save pictures/videos on computers. Other than that, no problem. I use this \"tiny\" camera as a spare one along with my other professional Nikon and to carry everywhere I go. Pictures are great and of course, zoom is outstanding for a little thing! It is what I love the most in this camera.", "Date": "December 4, 2013"}, {"Title": "Fantastic Point and Shoot!", "Author": "Brian M", "ReviewID": "RH2ENI5UXFPYP", "Overall": "5.0", "Content": "This camera takes amazing pictures.  This easily beats my two previous Sony cameras of similar size.  The pictures are more focused and the color is amazing. Great point and shoot.", "Date": "November 27, 2013"}, {"Title": "Nice camera cheaply made", "Author": "Louis H Otos", "ReviewID": "R1KMYYN8PU6GL0", "Overall": "1.0", "Content": "I have had the camera for 6 months and have had to send the camera in 3 times for repairs.  The camera is extremely fragile.  I expected more from Nikon.  Nikon service center was reluctant to repair the camera under warranty and most recently, sent the camera back after repairing the flash that broke and the camera would not turn on requiring me to again return the camera for repair.  The camera is loaded with features but those are useless if the camera doesn't work.  The reader may notice that the camera originally sold for $350 but is now being sold for $275.  Nikon is recognizing their engineering mistake.", "Date": "November 26, 2013"}, {"Title": "Great Camera", "Author": "Ruisdael L. Vallejo \"RLV\"", "ReviewID": "RKD3I5EYEMYQB", "Overall": "5.0", "Content": "I bought this camera to upgrade my old cyber shot. The camera is amazing, has great colors, resolution, size, and zoom. I am very please with my purchase.", "Date": "October 14, 2013"}, {"Title": "Decent, but lacking", "Author": "Steven H. Douglas", "ReviewID": "R10EVV3C91XZG2", "Overall": "3.0", "Content": "Right off the bat you can tell this is a pretty nice camera. But then again I only had 4 year old cameras to compare it to.So when we finally got to test it outside of a store we found its limitations. Compared to our 4 year old Panasonic Lumix, which has its own problems, it didn't match up.This camera's macro isn't really macro, its auto focus on zoomed in objects is terrible, the colors are under-saturated, and there are absolute zero manual options.If you're not going to include manual options, then a camera coming out now should be good enough to take colorful sharp pictures. Compared to the competition, this camera is lacking.", "Date": "October 6, 2013"}, {"Title": "Excellant , easy to use.....", "Author": "Ronald Talmage", "ReviewID": "R398EN0FY2XWL3", "Overall": "5.0", "Content": "This is my fifth Coolpix and I wasn't disappointed. I like a small quality camera to carry in my pocket when I'm using my old trusted d-5000 Nikon...........", "Date": "October 2, 2013"}, {"Title": "nikon coolpix s9500", "Author": "papi", "ReviewID": "R3M9PEMEHSYB05", "Overall": "5.0", "Content": "always been a Nikon man needed some thing small to travel with and this was the best love it should have thougth about this before", "Date": "September 19, 2013"}, {"Title": "a good buy", "Author": "Ronnie K", "ReviewID": "R26WF4DRZ0BTYB", "Overall": "4.0", "Content": "I'm very happy with this camera. What a zoom! For my casual use I got the best camera for me. the pictures are hi def and so clear.", "Date": "September 8, 2013"}, {"Title": "Cool, new gadgets", "Author": "Lisa A. Wohl", "ReviewID": "R23CVKSTNKBL3K", "Overall": "5.0", "Content": "I upgraded from a Nikon Coolpix 8000; what a difference! I am so happy that I purchased this product! It has many of the \"bells and whistles\" of much larger cameras!", "Date": "September 6, 2013"}, {"Title": "Takes very nice photos!", "Author": "Amazon Customer", "ReviewID": "R2V3CCPMYD4SZE", "Overall": "5.0", "Content": "I bought this camera so that I would have a small digital camera for traveling (I normally use a Nikon D7100 DSLR). I have been particularly pleased with how fast it focuses. The thing I like the least about the camera is how the flash pops up...it seems like it could easily break. I am careful with it though, so hopefully that won't happen. I have only had this camera about a month, so far I really like it!", "Date": "August 29, 2013"}, {"Title": "great camera for the price.", "Author": "jim streuber", "ReviewID": "R1V847DJFAK6UK", "Overall": "5.0", "Content": "Love this camera has the bell & whistles anybody should ever need. Smaller size but takes excellent pictures. Great for people who do not want to carry around a large camera.", "Date": "August 22, 2013"}, {"Title": "new camera", "Author": "ANNE BLACKWELL COLLINS", "ReviewID": "R1HX0FI0502ETC", "Overall": "5.0", "Content": "i had the previous model which i just wasnt happy with so reverted to the model before that, then met a fellow traveler who had been given this by friends and loved it - i saw her pictures and decided i needed to get this.......and i am very happy with it - gave my other one to my sister. Would highly recommend it for good quality point-and-shoot with great zoomABC, Boonton, NJ", "Date": "July 9, 2013"}, {"Title": "Does not have some of the features of earlier models.", "Author": "LAWRENCE B. MOSS", "ReviewID": "R1WIKD2W0Y13NK", "Overall": "2.0", "Content": "It does not have the continuous picture feature that is on the S9300.  I am going to try it again a few times and may then return it to you for reimbursement.", "Date": "June 28, 2013"}, {"Title": "Quality in a compact point and shoot!", "Author": "Bob F", "ReviewID": "R1CY11G68GQ70G", "Overall": "5.0", "Content": "Great pics and easy to use.  Compact size, 22x zoom and quality digital images make this camera a must.  Often use this camera over my D300 with 18-300 lens for travel/ vacation photos.", "Date": "November 3, 2013"}, {"Title": "Awesome camera !", "Author": "Sudeep Chavare", "ReviewID": "R2V417NGV2QN9O", "Overall": "5.0", "Content": "Its an awesome camera for the price . It captures crisp colors and snap quality is very nice for beginners like me .. I am yet to explore the GPS and WiFi fearures but I am already loving this ! Absolutely resommended !!!", "Date": "October 22, 2013"}, {"Title": "Failed after 3 weeks", "Author": "Tom Nielsen", "ReviewID": "R3KUYHC3PWQBNL", "Overall": "2.0", "Content": "After 3 weeks the camera started to frees-up and the only way to get it to restart was to remove and reinsert the battery. This is my 5th Nikon  and 3 have failed. the first an S630 still works but the card will not lock in place. the 2nd an S8200 failed to focus after a years use. I would not recommend Nikon point and shoot cameras. This said my D7000 DSLR is excellent and has not disappointed me.I am looking for recommendations for a new point and shoot camera with good features for travel.", "Date": "September 17, 2013"}, {"Title": "Great New Camera With A Lot Of Options And Fairly Reasonable Price!", "Author": "Alloveramp", "ReviewID": "RRGV0DZOI5FVK", "Overall": "5.0", "Content": "I bought this one for the Zoom feature, the small size all self contained wi Fi and GPS and the 18.1 MPS count. It filled in a gap that I wanted to fill. To compare it with my 2011 Canon Power Shot IS 3300 A, I would say that it gives a richer picture. It has much more zoom capability. It also shoots in 1080 P. So all and all it is a big step up from my 100$ Canon which is what I was looking for. I also have a Nikon Coolpix AW-100 and that is good for certain environments but this one has the wi Fi which I like and much more zoom of course. So all and all it is a very sophisticated point and shoot camera and a good buy for what it is and what it does.", "Date": "June 23, 2013"}, {"Title": "Perfect", "Author": "Amazon Customer \"SargD\"", "ReviewID": "R3SNRE499TBPLR", "Overall": "5.0", "Content": "<!--\n\nfunction fp_resizePlayerSpace(nsPrefix,w,h)\n{\t\n  try {\t\n    var ifrm = parent.document.getElementById(nsPrefix + \"movieFrameID\");\n    if (ifrm) {\t\n        var h2 = h + 35;\n        ifrm.style.height = h2;\n      }\n    } catch(err) {\n \n    } \n\n\n  if (h > 0) {\n      document.getElementById(nsPrefix + \"clipDiv\").style.height=h+\"px\";\n      document.getElementById(nsPrefix + \"videoPlaceholder\").style.height=h+\"px\";\n  }\n  else {\n      document.getElementById(nsPrefix + \"clipDiv\").style.height=\"\";\n      document.getElementById(nsPrefix + \"videoPlaceholder\").style.height=\"\";\n  }\n  document.getElementById(nsPrefix + \"flashcontent\").style.height=\"100%\";\n}\n\nfunction fp_rewriteDiv(nsPrefix,divName,html)\n{\t\n    document.getElementById(nsPrefix + divName).innerHTML=html;\n}\n\nfunction embeddingPopup(nsPrefix)\n{\n  alert(\"placeholder function for embedding code\");\n}\n-->\n\n\n<!--\n\nfunction cv_moLE2QOJK3FUQNembeddingPopup(){\t\nalert(\"Embedding code will be displayed here.\");\n}\n\n-->\n\n\n\n\n\n\n\n\n\n<!--\nfunction cv_moLE2QOJK3FUQNrefresh_preplay() {\n\ndocument.getElementById(\"cv_moLE2QOJK3FUQNchiDiv\").innerHTML = document.getElementById(\"cv_moLE2QOJK3FUQNhiddenPre\").innerHTML;\n};\ncv_moLE2QOJK3FUQNrefresh_preplay();\n\n-->\n\n\n\n\n\n\n        // <![CDATA[\n\nvar cv_moLE2QOJK3FUQNso;\t   \n\n\nfunction cv_moLE2QOJK3FUQNloadSwf_Core(swfLocation, swfWidth, swfHeight, flashVersion, bgColor, swfParams, flashParams, embedAttributes) {\n\n  try {\n      cv_moLE2QOJK3FUQNso = new SWFObject(swfLocation, \"cv_moLE2QOJK3FUQNAMPlayerProd\", swfWidth, swfHeight, flashVersion, bgColor);\t   \n\n      for (var v in swfParams) {\n        cv_moLE2QOJK3FUQNso.addVariable(v, encodeURIComponent(swfParams[v]));\n      }\n      for (var v in flashParams) {\n        cv_moLE2QOJK3FUQNso.addParam(v, flashParams[v]);\n      }\n      for (var v in embedAttributes) {\n        cv_moLE2QOJK3FUQNso.setAttribute(v, embedAttributes[v]);\n      }\n\n      cv_moLE2QOJK3FUQNso.addVariable(\"swfEmbedTime\", new Date().getTime());\n\n      var agt = navigator.userAgent;\n       \n      var reFirefox = new RegExp(\"firefox/\", \"i\");\n      var regx = agt.split(reFirefox);\n      var ffVersion = 8;\n      if (regx[1]) {\n          var pts = regx[1].split(/[.]/);\n          ffVersion = parseFloat(pts[0] + \".\" + pts[1]);\n      }\n      var minorVersion = parseFloat(navigator.ap);\n      if ((navigator.appVersion.indexOf(\"Mac\")!=-1) || (ffVersion < 1.5)) {\n          cv_moLE2QOJK3FUQNso.setAttribute(\"height\", swfHeight);\n          cv_moLE2QOJK3FUQNso.setAttribute(\"width\", swfWidth);\n          cv_moLE2QOJK3FUQNso.addVariable(\"oldFirefox\", \"1\");\t     \n      }\n\n      if (cv_moLE2QOJK3FUQNso.write(\"cv_moLE2QOJK3FUQNflashcontent\")) {\n          fp_resizePlayerSpace('cv_moLE2QOJK3FUQN', \n                               320, \n                               283);\n      }\n      else {\n          var nsPrefix = 'cv_moLE2QOJK3FUQN';\n\n          fp_resizePlayerSpace(nsPrefix, 0, 0);\n          fp_rewriteDiv(nsPrefix, \"flashcontent\", '<br/>To view this video download <a target=\"_blank\" href=\"http://www.macromedia.com/go/getflashplayer\" target=\"_top\">Flash Player</a> (version 9.0.115 or higher)');\n      }\n  } catch(err) {\n      fp_resizePlayerSpace('cv_moLE2QOJK3FUQN', 0, 0);\n  }\n  return false;\n}\n\n\n\nfunction _cv_moLE2QOJK3FUQNloadSwf(movieID, playerVersion) {\n    var swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/20120510035744301/AMPlayer._V148501545_.swf\";\n    var swfWidth = \"320\";\n    var swfHeight = \"100%\";\n    var flashVersion = \"9.0.115\";\n    var bgColor = \"#FFFFFF\";\n\n    var swfParams = {};\n    var flashParams = {};\n    var embedAttributes = {};\n    swfParams.amazonPort = \"80\";\n    swfParams.allowFullScreen = \"true\";\n    swfParams.telemetrySubPageType = \"VideoReview\";\n    swfParams.nsPrefix = \"cv_moLE2QOJK3FUQN\";\n    swfParams.locale = \"en_US\";\n    swfParams.logUrl = \"gp/mpd/l\";\n    swfParams.canResize = \"1\";\n    swfParams.autoPlay = \"1\";\n    swfParams.sessionId = \"000-0000000-0000000\";\n    swfParams.marketplaceID = \"ATVPDKIKX0DER\";\n    swfParams.salign = \"LT\";\n    swfParams.preset = \"detail\";\n    swfParams.mediaObjectId = \"m2MAT2DU6K2QW3\";\n    swfParams.autoPlayTimer = \"\";\n    swfParams.mediaObjectIDList = \"m2MAT2DU6K2QW3\";\n    swfParams.playIsUserGenerated = \"1\";\n    swfParams.enableShare = \"0\";\n    swfParams.permUrl = \"gp/mpd/permalink\";\n    swfParams.telemetryPageTypeID = \"R3SNRE499TBPLR\";\n    swfParams.xmlUrl = \"http://www.amazon.com/gp/mpd/getplaylist-v2/m2MAT2DU6K2QW3/000-0000000-0000000\";\n    swfParams.amazonServer = \"www.amazon.com\";\n    swfParams.scale = \"noscale\";\n    flashParams.allowFullScreen = \"true\";\n    flashParams.salign = \"LT\";\n    flashParams.bgcolor = \"#FFFFFF\";\n    flashParams.allowScriptAccess = \"always\";\n    flashParams.quality = \"high\";\n    flashParams.wmode = \"transparent\";\n    embedAttributes.title = \"Flash Player\";\n\n    if (movieID){\n      if (playerVersion == '3'){\n        swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/20120510035744301/AMPlayer._V148501545_.swf\";\n        swfParams.mediaObjectIDList = movieID;\n      } else {\n        swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/legacy/20101014901/AMPlayerProd._V197491872_.swf\";\n      }\n      swfParams.xmlUrl = \"http://www.amazon.com/gp/mpd/getplaylist-v2/\" + movieID + \"/000-0000000-0000000\";\n      flashParams.wmode = \"transparent\";\n      swfParams.autoPlay = \"1\";\n    }\n\n    if (document.getElementById('cv_moLE2QOJK3FUQNduration')) {\n      document.getElementById('cv_moLE2QOJK3FUQNduration').style.display='none';\n    }\n    cv_moLE2QOJK3FUQNloadSwf_Core(swfLocation, swfWidth, swfHeight, flashVersion, bgColor, swfParams, flashParams, embedAttributes);\n\n  return false;\n}\n\nfunction cv_moLE2QOJK3FUQNloadSwf(movieID, playerVersion) {\n   return _cv_moLE2QOJK3FUQNloadSwf(movieID, playerVersion);\n}\n\n\n\t\n\t\t// ]]>\n\t\n\n<!--\n\nfunction cv_moLE2QOJK3FUQNnewHeight(h)\n{\t\n    fp_resizePlayerSpace('cv_moLE2QOJK3FUQN', 0, h);\n}\n\nfunction cv_moLE2QOJK3FUQNresetPlayer(w,h,bw,cc) {\n  cv_moLE2QOJK3FUQNnewHeight(h);\n\n  cv_moLE2QOJK3FUQNso.addVariable(\"resetBandwidth\", bw);\n  cv_moLE2QOJK3FUQNso.addVariable(\"cacheCode\", cc);\n  cv_moLE2QOJK3FUQNso.setAttribute(\"height\", h);\n  cv_moLE2QOJK3FUQNso.setAttribute(\"width\", w);\n  cv_moLE2QOJK3FUQNso.write(\"cv_moLE2QOJK3FUQNflashcontent\");\n}\n\n-->\n\n\n\n\n\n\n\n\nvar cv_moLE2QOJK3FUQNRollOverImg = new Image();\ncv_moLE2QOJK3FUQNRollOverImg.src = \"http://ecx.images-amazon.com/images/I/81eHYJYY9NS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play-active,BottomLeft,130,-12_CR0,0,0,0_.png\";\n\nvar cv_moLE2QOJK3FUQNpreplay = document.getElementById('cv_moLE2QOJK3FUQNpreplayImageId');\nif (cv_moLE2QOJK3FUQNpreplay) {\n  cv_moLE2QOJK3FUQNpreplay.onmouseover = function() {\n    cv_moLE2QOJK3FUQNpreplay.src = \"http://ecx.images-amazon.com/images/I/81eHYJYY9NS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play-active,BottomLeft,130,-12_CR0,0,0,0_.png\";\n  }\n  cv_moLE2QOJK3FUQNpreplay.onmouseout = function() {\n    cv_moLE2QOJK3FUQNpreplay.src = \"http://ecx.images-amazon.com/images/I/81eHYJYY9NS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play,BottomLeft,130,-12_CR0,0,0,0_.png\";\n  }\n  \n  \n  var node = cv_moLE2QOJK3FUQNpreplay.parentNode;\n\n  var cv_moLE2QOJK3FUQNcurrentClick = node.onclick;\n  node.onclick = function () {\n    var head = document.getElementsByTagName(\"head\");\n    if (head[0]) { \n      var logTag = document.createElement('script');\n      logTag.type = \"text/javascript\";\n      logTag.src = \"/gp/customer-media/du/log.html?ie=UTF8&p=CustomerImage&s=CustomerVideoPlay\";\n      head[0].appendChild(logTag);\n    }\n\n    if (cv_moLE2QOJK3FUQNcurrentClick) {\n      return cv_moLE2QOJK3FUQNcurrentClick();\n    }\n  }\n}\n\n\n\n\n Length:: 0:34 MinsThe pictures are crisp and clear, zoom is wonderful, videos are outstanding. Very easy to use. No problems with the operation, until you get to the playback. Every time I try to play back, or review pictures or video it will freeze up at some point and you have to remove the battery and put it back in. You lose nothing, but it is a pain in the a--! I have not contacted Amazon or Nikon yet as I am still on vacation, and my pic's and videos of Alaska are breathtaking. Even with this glitch, this is a wonderful camera. 5 stars + without the freezing problem.UPDATE:The freezing issue is now only on one video, why I don't know, but it is no longer an issue. I love this camera!", "Date": "May 31, 2013"}, {"Title": "Love it", "Author": "Brigitte Wiss", "ReviewID": "RCZQA8NXCG825", "Overall": "5.0", "Content": "I love the zoom. Powerful and give detailed pictures.The camera is great and compact. I haven't tried yet the GPS function.", "Date": "May 25, 2013"}, {"Title": "Terrible battery life!", "Author": "helpful but picky consumer", "ReviewID": "R1ER0GKV4M89I", "Overall": "1.0", "Content": "I have been searching for a digital camera to replace my old broken Canon... Thought Nikon made quality cameras- they are a little famous for it! I was incredibly disappointed when I saw that the battery gets charged inside the camera...initially not a big deal, except that my charger was most likely faulty, so camera went from \"full battery icon\" to \"low battery\", &powered; off halfway through my cousins wedding after letting it charge all day...this was after I had disabled the GBS & other battery draining features in preparation for the event...also, the camera is awkward to hold ( kind of heavy) and pricey for not being a higher model/ more features...after checking out the indoor evening wedding pictures in print, I determined to return this camera: nifty wifi upload does not outweigh poor low light picture quality!", "Date": "July 7, 2013"}, {"Title": "Love this Camera", "Author": "Carla Rye Faherty", "ReviewID": "R1LW8WNK8T67UG", "Overall": "5.0", "Content": "Takes great pix and can send wirelessly to phone, computer or iPad.  Pictures are beautiful.  Love the bright red color.", "Date": "September 15, 2013"}, {"Title": "Excellent camera", "Author": "Jake-oy", "ReviewID": "R126DTHUBCROK2", "Overall": "4.0", "Content": "The camera is excellent but just a tad bigger than I really wanted.I need to add 7 more words in order to post this so this should cover it.", "Date": "August 22, 2013"}, {"Title": "Not impressed.", "Author": "Paul", "ReviewID": "R2C21DC040DIBB", "Overall": "2.0", "Content": "I was hoping for a simple to use point and shoot camera with WiFi. What I got for my $300 was a cool WiFi camera that takes marginal photos at best. I have an old clunker from Olympus that takes comparable quality photographs. The Auto setting seems useless. The flash is a very poor design that I expect will give me issues down the road. Halfway through my vacation to the great state of Washington, I put this little thing away and broke out my Samsung Galaxy S3. I took about 500 photographs, of which less than 10 were even worthy of keeping. Sadly, I also purchased spare batteries and an external charger for this. I guess I will have to salvage it somehow. I just don't think you can take quality photographs with this camera without tweaking the settings. I wanted something that was much easier to operate.", "Date": "August 12, 2013"}, {"Title": "disappointed unfortunately", "Author": "Jean Futoran", "ReviewID": "R1H6CQONZS5E55", "Overall": "2.0", "Content": "used this product for 3 weeks, liked it for quick picture taking after pressing the button, occasionally very good focusdislike it for long recovery time between the pictures and for inconsistent focus - lots of pictures get too dark and/or blurryalso the flash that comes out of a camera is a bit inconvenience, especially if stranger takes your picture and covers it with his handbattery life was shorter than I was used too. Was not enough for 1 day of travel.", "Date": "August 5, 2013"}, {"Title": "Europe trip", "Author": "The Critic", "ReviewID": "R12Q1XN9KT9RDY", "Overall": "4.0", "Content": "Took this camera to Europe for 18 days. Took 5000 pictures and 18 GB of data. Some issues with lens errors when putting the camera in a pocket and it opening spontaneous. Picture quality was spectacular. Panorama view were easy to use and good. Used 3 batteries a day with heavy use but otherwise power was stable. Bought it for wifi transfer to post from IPhone to Facebook because I didn't want to take a laptop - worked perfectly. Only knock was the lens issue and will see if it persists at home.", "Date": "July 9, 2013"}, {"Title": "Loved this camera to start with....sigh", "Author": "Heather", "ReviewID": "R2TQSI5Z7OJZ97", "Overall": "1.0", "Content": "Got this camera as a christmas gift. I am a casual camera user, a few shots every couple days of the dogs....not a hundred pics of everything under the sun...so just your average user.Quality of pictures and film, very good for the price.However, item breaks way to easily. I didn't even drop it or shake it or anything.Had some kind of error happen and caused the battery to insist it was full, then suddenly die. Then once it did that and I recharged the battery, the lens zoomed in and out repeatedly and refused to take pictures.Website informs me I need to ship it to them (wherever they are)and it will cost 125 dollars to repair. As it was a gift, of course I don't have the warranty information. I'm not spending over a hundred dollars to repair a camera that is only 5 months old.Very unhappy that you can not take it anyplace local, it must be shipped back to the manufacturer. Expensive paperweight.", "Date": "May 21, 2014"}, {"Title": "great size", "Author": "russel g watson", "ReviewID": "R13VOL6QAEK3NE", "Overall": "5.0", "Content": "excellent small sized camera , Great zoom (22), Great pixels (18). Lots of optional features and settings. Will be my travel camera for sure", "Date": "May 17, 2014"}, {"Title": "The dealer tried their best", "Author": "Mary-Jo Y.", "ReviewID": "R2QSF0710MNXCS", "Overall": "4.0", "Content": "The item is 5 stars and I purchased it because I had a similar camera previously.  What was the issue was that no tracking information was issued (as I generally expect from other Amazon purchases) and when the expected delivery date passed, I contacted the seller.  They said the contacted the shipper and was told it was lost and would resend another one. They did, but not until about a week after that and a couple more e-mails.  Tracking information should be readily available and the customer should not have to go investigating through layers of information.  I work for an Amazon seller and process the orders so I know what should be expected and am disappointed that tracking was such an issue.  I know things \"get lost\" and it is usually the shippers fault; although the shipper will automatically say it is the sellers fault.  How that is possible is beyond common sense.  I don't blame the seller for sending it out with expectations that it would be delivered to the address provided.  If they has processed the replacement when they said they would, they would have received a 5 as they wanted.", "Date": "May 6, 2014"}, {"Title": "Awesome Camera", "Author": "Bonnie Ramshaw", "ReviewID": "RVB4XMT01W7PY", "Overall": "5.0", "Content": "I have an older Nikon Coolpix so I am sold on Nikon. This newest model far surpasses my old one, but I won't let it go of it, as it still gives me good photos. The features of this S9500 make it so easy to take any photo any time of day or night and you can clean up the pic easier. It is amazing.", "Date": "April 27, 2014"}, {"Title": "HATE THIS CAMERA", "Author": "Renee Cook", "ReviewID": "R2MI5XGNYO71CS", "Overall": "1.0", "Content": "I can never get this camera to focus.  I take 20 pictures to get one that is in focus!!  Hate it!!", "Date": "April 26, 2014"}, {"Title": "Shutter sticks", "Author": "James A. Mulvany", "ReviewID": "R384F4JGMALCGT", "Overall": "2.0", "Content": "I bought this Nikon because I liked my last one.  However, the shutter would not open on my old one, so I replaced it with this one.  Now, I have used the new Coolpix for one vacation, and the shutter is sticking on this one.  I have had it less than 2 months and I am going to Peru in a couple weeks.  I'm not happy to say the least.", "Date": "April 25, 2014"}, {"Title": "Really great camera.", "Author": "Richard Muniz", "ReviewID": "R2JWQ2QWXOJM9", "Overall": "5.0", "Content": "For a quick shot camera, it takes really good pictures.  It isn't very big so it is easy to carry.  The 22x zoom comes in really handy to get close shots.  The macro mode isn't bad either.", "Date": "April 24, 2014"}, {"Title": "Think about another brand", "Author": "Michael", "ReviewID": "R3D86O7AQS1P8D", "Overall": "1.0", "Content": "Bought this camera to replace my 3rd of 4th in a row Sony pocket camera. Boy am I sorry. The camera *might* be OK but it's a little big and clunky compared to competitors. Just don't need to get it fixed by Nikon. Lens cover failed out of the box and I've been trying to get it fixed for a couple of months. Sent it back to them, on my dime, and after a 2-3 week interval got it back in the same condition. Need it for an upcoming vacation, reconnected with them and am still awaiting a response. A small thing perhaps but with service like this I'd never recommend Nikon. Will update this review if they really impress me... but I'm not optimistic.", "Date": "April 22, 2014"}, {"Title": "Great camera very bad wifi/connectivity", "Author": "Adolfo G. Lemoine", "ReviewID": "R2IMHF2R27YP8B", "Overall": "3.0", "Content": "Overall this is as expected from a nikon product. I have been using nikon cameras for over 20 years.  Pictures are very good clear and resolution is top notch.  Where this camera falls short is in the implementation of wifi. Nikon chose to go with a proprietary wifi which does not connect to regular home wifi or to a laptop. On top of this the software for connecting to an android device is practically useless.  You can't select individual pictures to transfer and if you have a memory card full of pics it insists on downloading all of them every time.  I must give the camera a good review,  but very bad review for the non camera tech.  Not a connected camera at all!", "Date": "April 6, 2014"}, {"Title": "Great Camera", "Author": "Lorraine S. Nolan", "ReviewID": "RPQIIRM36QCJL", "Overall": "5.0", "Content": "This little camera takes great pictures, tucks in my purse so I always have it with me and is a ton of fun to use.  It's perfect for an amateur picture taker like me.", "Date": "March 31, 2014"}, {"Title": "Is not compatible with Samsung Galaxy S3", "Author": "Barbara Holmes", "ReviewID": "R3UTVEQHQ6QLEK", "Overall": "3.0", "Content": "I bought this camera mainly for the WiFi feature.  I wanted to be able to upload my pictures to social media sites when I take them.  I love the camera size, zoom and the pictures.  However, it states you can sync with your smartphone, but it does not tell you it will not work with all of them.  So make sure your phone is compatible before you buy it.  If I would have known this issue with the Samsung phone, I would not have purchased it in the first place.", "Date": "March 28, 2014"}, {"Title": "Incredible", "Author": "Bruno Marcello Rodrigues", "ReviewID": "R1AHXQ2K51EB5J", "Overall": "5.0", "Content": "The camera is awesome. It has a great and powerful zoom, the battery duration is enough!It is light and easy to carry", "Date": "March 25, 2014"}, {"Title": "Good camera, but some quality control issues", "Author": "John Smith", "ReviewID": "R3Q8LM5PI23JQX", "Overall": "3.0", "Content": "I purchased a Nikon Coolpix S9500 in Dec 2013 and used it for three months.  The camera is great in terms of having a long zoom capability, ability to take pictures under a wide ranging of lighting conditions (e.g., night portrait and night landscape settings are very useful), and being able to take good video.  However, a spot developed in each picture and I realized it was not dirt on the lens.  It was internal the the lens, and would vary in diameter depending on the zoom.  These cameras are made in China, and there have been some reports of quality control problems with some of their cameras.  I have returned the defective one and will try another one - perhaps the lens spotting problem I had was a low frequency quality control problem.  Has anyone else had problems with a permanent spot showing up in their pics with this camera?", "Date": "March 23, 2014"}, {"Title": "Great Camera", "Author": "CP", "ReviewID": "R3ZUDZQZJLBQG", "Overall": "5.0", "Content": "I love the Zoom Lens on this camera.Worth the money.  Easy to carry and store.Pictures are clear and the video works great.", "Date": "March 22, 2014"}, {"Title": "Nikon Camera", "Author": "Jennie Schultz", "ReviewID": "R1E4WI7Q0R465O", "Overall": "5.0", "Content": "I cannot say this enough...I LOVE MY NEW CAMERA !!! I previously owned a Nikon digital camera for 4 years with absolutely no problems until recently when it would not hold a charge & would shut itself off in the process of using it...I love taking pics of family & friends, scenery, & just plain life...when I had the option of getting a new camera, I searched all the Nikon options...then narrowed the list down by doing research on the best fit for me & my needs ! LOVE LOVE LOVE this camera !!!", "Date": "March 20, 2014"}, {"Title": "fantastic", "Author": "daniella", "ReviewID": "R2GBDO11PVAWZ", "Overall": "5.0", "Content": "the last camara i had people kept saying me the pics were not good, with this one, everytime i hear commpliments about the pics!! the zoom is great!!", "Date": "March 19, 2014"}, {"Title": "good item thanks", "Author": "elizabeth luengo", "ReviewID": "RPTSFYNPMUTJH", "Overall": "4.0", "Content": "i search many posibilities before and this is the camera i choose  happy with it. thank you. no more to say", "Date": "March 11, 2014"}, {"Title": "This is a great little camera", "Author": "Lois B.", "ReviewID": "RE35IEWI28P1V", "Overall": "5.0", "Content": "I love this for my point and shoot camera when I do not want to carry all my gear. I love the GPS feature and all the effects. It's light and compact.", "Date": "February 28, 2014"}, {"Title": "best point and shoot on the market.", "Author": "Dave-az", "ReviewID": "R1KB2PXDJZ9B2C", "Overall": "5.0", "Content": "We originally had ordered this camera to have on our wedding trip.  unfortunately do to shipping restraints it was never received.  We did finally get one though and it is simply amazing.  It takes fantastic pictures and has a tremendous amount of options for such a small camera.", "Date": "February 24, 2014"}, {"Title": "Great pictures, great versatility", "Author": "David W. Weiss", "ReviewID": "RGNSRHSB5PT9E", "Overall": "5.0", "Content": "In its size category this is a fine camera with plenty of extra features. I especially like the 22x zoom along with its compact size.", "Date": "February 23, 2014"}, {"Title": "Sweet Camera", "Author": "M.A.FLICK \"M.A.FLICK\"", "ReviewID": "RPJ4SF36LPN6R", "Overall": "5.0", "Content": "Very Nice Camera and what nice pictures it takes this a very nice system its kind of a small camera but what quality in such a small package we are very pleased with this purchase Thanks to Amazon Prime.", "Date": "February 22, 2014"}, {"Title": "excellent camera for both snapshots and video", "Author": "Robert Travis", "ReviewID": "R3E96431BLFHD0", "Overall": "5.0", "Content": "This camera exceeded my expectations.  The pics are sharp and clear and the video surpasses my camcorder videos by far.", "Date": "February 20, 2014"}, {"Title": "Ease of Use", "Author": "Diana Hallett", "ReviewID": "R2IGEMUQAENHY4", "Overall": "5.0", "Content": "Love the ease of operating the camera and the compact sizeto carry in my pocket, purse, around my wrist, etc.The rich red color is easy to spot when laid down.We've taken several beautiful pictures on an easterncarribean cruise and other activities in Florida", "Date": "February 19, 2014"}, {"Title": "Wonderful buy, great price.", "Author": "DC 423 \"DC\"", "ReviewID": "RU7DMUC2IGQAQ", "Overall": "5.0", "Content": "This camera is better than your standard snap and shoot.  And I got it refurbished for about $100 less than what they have listed price at Best Buy.  I love its recording capabilities and the microphone on it for You Tube videos.", "Date": "February 19, 2014"}, {"Title": "Good pictures, good video, bad audio", "Author": "L. Shuler", "ReviewID": "R2088MD7HGYKON", "Overall": "4.0", "Content": "I don't know how they got the audio wrong.  It's horrible compared to my 3-year-old Sony WX10 camera.  On the plus side, the picture quality was outstanding.  Wish I'd bought it just for the pictures.", "Date": "February 18, 2014"}, {"Title": "looked for a while", "Author": "barbara thomas", "ReviewID": "RD9YK803B2SX4", "Overall": "4.0", "Content": "couldn't find a camera for someone technologically challenged. this one seems to have less adjustments (many can be done automatically) and it produced super pictures! the flash seems to be popping up a lot.  battery did not hold the charge very long. be careful you are not pushing the video button.  i will have to read up more on this for long trips. just bought the camera..so far, so good. i need to do my homework too.", "Date": "February 17, 2014"}, {"Title": "Super", "Author": "Rajiv Chopra \"Rajiv Chopra\"", "ReviewID": "R1N3A4V5W15LUK", "Overall": "5.0", "Content": "I love this camera. It is a wonderful addition to the SLRs that I have. It is quick, responsive, and takes wonderful pictures", "Date": "February 14, 2014"}, {"Title": "Nikon with GPS", "Author": "Arlene \"DAP\"", "ReviewID": "R22PPKUIYT801J", "Overall": "4.0", "Content": "I love this camera.  I bought it just before we went to Disneyworld in Orlando.  It took the most amazing pictures and videos at night.  The details were so vivid and clear.  It's easy to use.  I would recommend it to everyone.", "Date": "January 25, 2014"}, {"Title": "zoom on in to this great deal", "Author": "Cindy", "ReviewID": "RD36QNP28V05O", "Overall": "5.0", "Content": "Wow, what a great camera! Awesome wifi and picture quality. The 22x zoom is really precise, truly amazing and something to see!", "Date": "January 8, 2014"}, {"Title": "Great size", "Author": "Hill girl", "ReviewID": "R2M41PNBGPIL4Q", "Overall": "4.0", "Content": "The pixels . Email and the size convenient of this camera were the deciding factor in choosing this camera over other models and makes", "Date": "January 8, 2014"}, {"Title": "Nikon Coolpix S9500 digital camera", "Author": "LGTT", "ReviewID": "R28VQW1L687RTT", "Overall": "5.0", "Content": "I love this nikon camera.  I had the Nikon S8200 and loved it. I have used it for years and it takes great pictures.. I dropped it one to many times though and the lens was out and broke when it fell last time.  I bought the drop, spill protection for this camera also.  The great thing about this camera is that it uses the same batteries as the S8200 so I didn't have to buy any spare batteries or a spare charger.  Only downer on the camera is the flash is on the left side and whenever someone uses my camera - the have their finger on the flash so it won't come up - but once you tell them to move their finger - no issues - works great!  It uses the EN-EL12 3.7v battery.", "Date": "January 6, 2014"}, {"Title": "Excellent.", "Author": "Ecologist", "ReviewID": "R17M89K5ECZI4W", "Overall": "5.0", "Content": "It's small, compact, yet has amazing zoom and, best of all, it syncs with the iPhone and you can send pictures right away.  Some users have had trouble with the app, but it's worked for me.  It is a minimal app - does little more than put pictures into folders on your phone.  I ordinarily carry around 30 lbs of camera equipment to get closeups, telephotos, etc.  But if I'm just walking to work or going on a short conference trip, i can take this along and have a lot more capacity to take good photos.  The iPhone camera is great, but it has a fixed focal length and a lousy flash.  One shortcoming is the flash pops out where one tends to hold the camera.  Other than that, I'm very pleased with it.", "Date": "January 3, 2014"}, {"Title": "Great camera for the price", "Author": "Peggy Graham", "ReviewID": "R2MYHI1OX6WG0S", "Overall": "5.0", "Content": "I love this camera!  This is the second Nikon I have owned and love the quality of picture that it takes.  The zoom allows you to get in very close without losing clarity of the picture.", "Date": "January 3, 2014"}, {"Title": "This is what I expected.", "Author": "SIVA KRISHNA KOGILI", "ReviewID": "R3PTFKQYE131K", "Overall": "4.0", "Content": "I liked it...It meets my expectations and works great.I have not yet tried GPS. But rest of all working fine.Thanks,Siva Krishna", "Date": "January 2, 2014"}, {"Title": "THE RIGHT GRIP !!", "Author": "John Petz", "ReviewID": "R1434MJMH21AU2", "Overall": "5.0", "Content": "It is quite simple... I can turn it on...Take the picture... Then turn it off ... While using only one hand !!! It is the only camera that has a grip for my right thumb to hold, and not a bunch of useless knobs in the way.", "Date": "January 2, 2014"}, {"Title": "flash problem", "Author": "abe fuchs", "ReviewID": "R43O2JS1GS0YQ", "Overall": "3.0", "Content": "the flash is in a very inconvient spot .It pops up where you usually put your left hand to hold the camera.", "Date": "January 2, 2014"}, {"Title": "it is cool and perfect potable with you", "Author": "huangfeihong", "ReviewID": "R3NEH7RYL9UU4B", "Overall": "5.0", "Content": "I like it so much, since it is very convent to take anywhere. The photos is very good, and the lens is very useful to use in any circumstance. It also have many functions to make photo taking very convient.", "Date": "December 31, 2013"}, {"Title": "Nikon", "Author": "Renato Rodrigues", "ReviewID": "R2ZJBJ343QLNN", "Overall": "5.0", "Content": "Very good point and shot camera. Didn't like the Rec button position, otherwise it takes very good pictures and high quality video", "Date": "December 31, 2013"}, {"Title": "Great Camera", "Author": "W. Thornton \"Dr. Billy Bob\"", "ReviewID": "R29VF9Z65HQZKY", "Overall": "5.0", "Content": "I bought this for my wife for her trip to New York City with her two daughters and two granddaughters.  We have a full size Nikon but she wanted a small compact one.  She was extremely pleased with it along with the features that the girls figured out.  There were not shortage of pictures on the trip and many of them came back to me in near realtime.She still favors this over the full size camera.  I would strongly recommend it or the newer replacement if one already exists.", "Date": "December 30, 2013"}, {"Title": "Great camera!  Well worth the money!", "Author": "Deborah M. Lefelhoc", "ReviewID": "R3E1RU3DM95227", "Overall": "5.0", "Content": "It's small, compact, easy to use.  Does everything we hoped it would do and more!  Would definitely recommend the purchase of this camera.", "Date": "December 30, 2013"}, {"Title": "Point and shoot gift camera", "Author": "Rick", "ReviewID": "RY6IRX1RJUSQG", "Overall": "4.0", "Content": "My wife loved the red to match her red cell phone and the strong zoom lens.  I like the easy controls and the lens cover.  It makes good photos that allow my wife to be creative.", "Date": "December 28, 2013"}, {"Title": "hate flash location", "Author": "Debby", "ReviewID": "RTWUYWYDWM8OJ", "Overall": "3.0", "Content": "Hate where the flash is located. Cannot hold camera and take photo when flash pops up. What happens is a very out of focus photo!", "Date": "December 27, 2013"}, {"Title": "Overpriced piece of crap.", "Author": "Amazon sucks", "ReviewID": "RZ347OY1MB8NO", "Overall": "1.0", "Content": "First of all, a big thanks to Amazon for selling this for $50 more than Best buy and then not allowing returns for this junk Nikon calls a camera.  Flimsy construction and terrible controls.  The flash pops up whenever it feels like it, and it is positioned terribly.  More often than not your hand or finger will be over it when you actually intend to use it.  I only had it for about two months before the OLED screen completely failed rendering the camera totally useless.  I should have stuck with Canon and I will never buy a Nikon again.", "Date": "December 26, 2013"}, {"Title": "Nothing surprising", "Author": "JuanDavid", "ReviewID": "R1Z43GRBOR22CX", "Overall": "3.0", "Content": "Pros:+Image Quality+Zoom+You can pause the video recordingCons:-Battery life-Wired Charger-No focus when you zoom in videos", "Date": "December 26, 2013"}, {"Title": "Great Camera", "Author": "Amazon Customer", "ReviewID": "R7LUQWGRP1MFG", "Overall": "5.0", "Content": "I purchased this camera after my wife dropped my Nikon s9300 with the lens extended. I loved the s9300 and am very happy with the s9500.", "Date": "December 24, 2013"}, {"Title": "THE CAMERA CASE INCLUDED IN THE PURCHASE WILL NOT CLOSE", "Author": "EVAN EVANS", "ReviewID": "R1VU24NZ71FL3O", "Overall": "3.0", "Content": "The camera came with a bundle of accessories, including a Nikon case for Coolpix cameras. . The  camera will fit inside the case, but the case will not close, resulting in the camera being able to fall out of the case. It was a manufacturing defect of poor design. Consequently one must purchase a seperate carrying case, or hold the camera in their hand at all times to protect it. Shame on Nikon. The camera itself is fairly good.", "Date": "December 18, 2013"}, {"Title": "Great Camera for the Price", "Author": "PJ Rodgers", "ReviewID": "R2Z9WWCYPA1CQ5", "Overall": "5.0", "Content": "An excellent camera!  It has so many features one would like such as:  when shutting the camera down the eye automatically closes and protects the lens, so easy to use, lightweight, durable, great wide-angle zoom.  I put a clip on the case and carry on my side or on a hook suspended from either fishing or motorcycle riding gear.  It also has a long-lasting battery, but I purchased an extra one which easily stores in a pocket on the camera case.  The size is ideal for travel and pictures quickly download.", "Date": "December 17, 2013"}, {"Title": "Not a good camera", "Author": "T. Sen \"Ted\"", "ReviewID": "R2K8TN4O1EY9MG", "Overall": "2.0", "Content": "This was my first and last time trying a Nikon Camera. Nikon was a great SLR camera producer in good old days. I had a Nikon professional SLR more than ten years ago, I remember loving that camera.This camera has major mechanical issues. On/off button is kind of numb, you may need to press multiple times to start the camera.The way, the camera works and sounds mechanically feels like it will break in a few months. So I didn't take my chance.Also, pop up flash is an another annoying thing in this camera, when you try to press half way it doesn't pop up and if you press all the way, it opens up and takes the picture without focusing.Flash is a total failure, it takes the pictures in a extremely bright light, you cannot recognize the people. If you take out the flash, then it is very dark.It works well in the day light. But a camera in this level should do a better job.I didn't have any problem connecting it through wifi or using GPS. These works fine.Price dropped sharphly for this camera, even it is now cheaper than some older models. It feels like Nikon knows there is a major issue in this camera and trying to get rid of their inventory and end of manufacturing this camera.", "Date": "December 15, 2013"}, {"Title": "So far so good", "Author": "Jazz L", "ReviewID": "R29KALQBQI5QCD", "Overall": "4.0", "Content": "I've only had the camera for 2 days now.  I am an amateur picture taker. Mainly pictures of my kid, holidays and family events.  My last camera was a Sony W55 bought 7 years agoPROS:Good menu, not too confusingGreat zoom on viewfinderLove that I can control and take wireless pictures with my smartphone and Nikon app.So far so good in dark lightingCONS:Flash doesn't go back down when you turn camera offFlash in a bad place with finger, so is the shutter buttonFor self portraits with timer: the camera doesn't balance on its side for portrait shots (guess I need a Tripod now)*Maybe there is a firmware update that fixes the first con.", "Date": "December 9, 2013"}, {"Title": "camera", "Author": "Lynn Liskiewicz \"lynn\"", "ReviewID": "R1ZKEFH78IUXGN", "Overall": "5.0", "Content": "camera is great. need to learn a lot more about it but the zoom is amazing and the shots are great.", "Date": "November 19, 2013"}, {"Title": "Not a very good camera, the focus :(", "Author": "Paul G Bolen", "ReviewID": "R2JUOSN7OHCA7F", "Overall": "3.0", "Content": "I am sorry to say that this is the lowest quality Nikon I have ever purchased. I wish I had read the other reviews first. I agree, the focus on this is very bad.", "Date": "October 11, 2013"}, {"Title": "so-so", "Author": "Danno", "ReviewID": "R1X91IHGQ0TK6S", "Overall": "2.0", "Content": "Wasn't horribly impressed with the picture quality. Tried some dusk shots in Las Vegas using the night and auto modes. My Samsung Galaxy phone takes better photos. Also, the wifi is rather tricky and they don't tell you that in the manual. You HAVE to make sure the battery is all the way in, your phone (if transferring to it) is fully charged, and the camera is fully charged. Then and only then can you a transfer. Will return to Costco.", "Date": "September 6, 2013"}, {"Title": "Excellent but pop up flash problematic.", "Author": "Nick Mantarakis", "ReviewID": "R2EVAOOWI2SSII", "Overall": "4.0", "Content": "Excellent camera but its pop up flash is placed where you hold the camera and is obstructed from being released when needed.", "Date": "September 6, 2013"}, {"Title": "Lense cover", "Author": "james white", "ReviewID": "R1THGN36RD1ULZ", "Overall": "2.0", "Content": "lense  cover now will not close and open properly, seems to stick in about quarter,  now the battery with not hold a charge for long. love the camera, but will have to look at another at this point", "Date": "August 26, 2013"}, {"Title": "Nikon S9500 Superzoom Compact Camera review by Dale (updated 01.11.2013)", "Author": "Dale Thorn", "ReviewID": "R3HAVE0TPQ4OX7", "Overall": "2.0", "Content": "NOTE: My Nikon S9500 fell off of my chair onto the floor at home and immediately broke - the lens would no longer retract. I've dropped Canons and Panasonics a hundred times, observing big dents in the lens barrels and bodies, yet they still worked OK. The Nikon S9500 didn't have a scratch on it, yet malfunctioned anyway. I've heard about this problem with other users, but was surprise at how fragile this camera is. I sent it back to Nikon and they want $150 USD to fix it, so I will have to absorb the $350 loss and let them keep it (no point in paying to fix something that fragile that will just break again).Startup time for the S9500 is about one second, and going from minimum zoom to maximum zoom takes about two seconds. Image quality is OK for a camera with a 1/2.33-type sensor, but certain details like hair, or a bird's feathers in a low-contrast part of the bird's body may be smeared somewhat. This is apparently caused by the noise reduction software in the camera, which can't be turned down or off. Pocket cameras that have much larger sensors (and consequently much less zoom) can often produce a better image with less noise, but you have to give up the long zoom, or put up with a much larger camera.Using the S9500 is easy enough, since the menus and controls are pretty well common to most pocket cameras these days. I especially like the separate video button, which has saved me from a lot of missed opportunities. There are a few nitpicks I have with the S9500: I would like to have Spot Focus as an option on the menu, and I would like to have the option to adjust the amount of noise reduction, in case I wanted to do noise reduction on the computer with extra software.Shooting still photos are not much of a problem in good light, because the shutter speed will be high enough and the image stabilizer will help out. If you use a tripod, or place the camera on a solid object so that there is no camera movement at all, you have to remember to turn the image stabilizer off or the images taken will not be sharp and clear. Many of the comments I've seen about blurry images on this type of camera could be due to using the camera on a tripod or placing it on a firm surface, and forgetting to turn the image stabilizer off. Then of course, you have to remember to turn it back on.The S9500's long 550mm effective zoom (focal length) is the key feature here, and even very expensive cameras cannot match the S9500's image quality with subjects such as small birds at a distance, unless those expensive cameras also have a long focal length lens - nearly as long as the S9500 in any case. Where the S9500 differs most from expensive cameras with large sensors (DSLRs mostly) is in wide angle photos, where the lens is zoomed all the way out (i.e. 25mm effective focal length, with the zoom lever pushed toward the 'W' position). Wide angle photos of landscapes, especially with foliage, will show a great deal of smearing. Wide angle photos of large groups of people will show smearing and digital 'Artifacts' on people's faces when the image is viewed at full size on a computer or printed. A camera such as the Nikon Coolpix 'A' will do a much better job with wide angle photos because its sensor is about 15 times larger.Battery life with the S9500 is rated about average for a pocket camera, which I find is good enough for about three hours of use in the local parks, shooting 100 to 300 photos. How many photos you get on a battery charge depends on how many you shoot close together. If you have the camera on most of the time and keep it activated, and take very few shots, the battery will still run down in a few hours due to the LCD screen, to the image stabilizer, and other electronic features that are active when the camera is active. If you don't want to run out of power when you're out shooting photos, you should get a second battery (never, ever get anything except a genuine Nikon battery) and make sure both are charged up before heading out.", "Date": "March 18, 2013"}, {"Title": "LOVE this camera!!", "Author": "Hilary", "ReviewID": "RTF07AO4SAVWI", "Overall": "5.0", "Content": "I was looking for a nice point and shoot camera that has the high quality of a larger camera, but is small enough to fit in my clutch or pocket. I attend a lot of concerts, and was also looking for a camera with a really good zoom functionality. This camera is AMAZING! I went to a concert last weekend and took the best pictures I've ever taken. The scene options are great, and the camera is really easy to use. My only complaint (even though I love this camera) is that the flash pops up when needed, and you have to push it down manually when done with the flash. The wifi feature is really cool too!! I couldn't find how to use the wifi in the instruction manual (you would think that would be in there!) so I had to watch a video on youtube to teach me how to use it, but once I watched that, I found that it was pretty simple to use. I just purchased this last week so I'm still learning it's capabilities but so far it is by far the best camera I've ever owned!", "Date": "May 22, 2013"}, {"Title": "nice camera", "Author": "Karin Klingman", "ReviewID": "R39HK1CRWLF6A1", "Overall": "4.0", "Content": "good zoom, clear photos, many options.  The battery that came with the camera was dead, fortunately I had ordered a spare battery separately.  I haven't figured out all the options, the directions are very basic, both in the written material that comes with the camera and on-line, but so far the camera is intuitive enough to use I have gotten what I wanted to do accomplished.", "Date": "September 4, 2013"}, {"Title": "I like it after I got it fixed", "Author": "Eugene Schott", "ReviewID": "R3G79VTDGWF63Z", "Overall": "5.0", "Content": "The memory stick was not for this camera so I had to send it in and get related which took 2 weeks.", "Date": "August 30, 2013"}, {"Title": "Very Annoying buzzing sound", "Author": "china2rider", "ReviewID": "R486Z2JVA0PNE", "Overall": "3.0", "Content": "I thought this was going to be a great camera, and it is for still shots. But I started to take short video clips about 6 months ago and sending them via google drive to friends and family..thus no added music, editing, etc. When the lens moves in and out, there is a loud buzzing sound. REALLY loud. It is not noticeable when you actually take the video, but when you upload it onto a computer and play it, you can hear it. Very obnoxious. I bought this at a local camera shop, and when I went to return it and complain about that, they told me you are not supposed to move the lens in and out when taking the video, but rather shut it off, move the zoom, then restart. That sounded crazy to me. I tried to find some info via various google searches, but all I found were complaints about this same issue. Don't buy this if you are planning to use the video option.", "Date": "August 19, 2013"}, {"Title": "Don't order the package deal", "Author": "Dave", "ReviewID": "RDS7ZBS6LYO6K", "Overall": "5.0", "Content": "I bought two of these cameras after being a long-time user of the S600.  I love it, hence the 5 stars.  However, I also bought the recommended Case Logic TBC-302 FFP Compact Camera Case (Black) that was part of a deal.  Beware, the camera doesn't fit this case.  How this was recommended is beyond me.  The S9500 kicks the S600's butt.", "Date": "July 21, 2013"}, {"Title": "Still evaluating", "Author": "Terryp", "ReviewID": "R4MHOSGFJV96K", "Overall": "3.0", "Content": "I've only had this camera for two days, and have already taken some great pictures with it. But I've found a few things that concern me as well. (1) The auto-focus doesn't work very well when taking close-ups. Even when my subject is well-lit and has good detail in the auto-focus area, I watch as the camera runs right through the proper focus and gives up. It's frustrating, and there's no option to focus manually. (2) When the sepia effect is selected, the camera will not focus on anything, at any range. It seems to pause at the proper focus point when pressing the shutter button half-way, but then jumps out of focus. I suspect that the 'soft' effect is being applied, but when it shouldn't be. But there is a work-around: just shoot in color or black and white, and then apply the sepia effect. (3) The battery icon only has two levels: full and nearly depleted. I was initially impressed by how long the battery seemed to be lasting until I saw the icon change after less than 100 shots. It takes several hours to recharge in the camera. The S9500 has some great features, but they could have picked some more useful ones than 'shrink face' and 'enlarge eyes' (why would anyone want to use those?!), like blur background and manual focus. All-in-all, I'm impressed with the camera so far. It's a giant leap from my CoolPix 3700, if that's saying anything.Update:After using the camera for several weeks, I'm still happy with the picture quality, but auto-focus requires a LOT of light. It's really frustrating trying to use the camera indoors, even with good room lighting, and constantly getting the red brackets, meaning that it's not able to focus. If you plan on taking many indoor pictures, I'd strongly recommend against this camera.Another gripe is that the self-timer has only two settings: 2 and 10 seconds. What good is the shorter interval? Who can sprint fast enough to make that useful? It should be at least 5 seconds.", "Date": "May 27, 2013"}, {"Title": "OK camera but with problems", "Author": "Robert Chance", "ReviewID": "R4499KLBW3H94", "Overall": "3.0", "Content": "This camera has a few problems. First it doesn't have a view finder. That might not seem like a problem till you go to somewhere like the beach were you are submersed in light. You can not see the screen in these conditions so you can't frame the picture. Second,when using the zoom the camera has a hard time getting focused. This is a real problem.", "Date": "March 20, 2014"}, {"Title": "Camera was hard to operate.", "Author": "Chester Sulborski", "ReviewID": "RJFDQI8MAU2C0", "Overall": "2.0", "Content": "Didn't offer as many photo options as my $100 Olympus camera. The photo's were good but the over-all ease of operation was not there for me!!", "Date": "March 4, 2014"}, {"Title": "Not good for low light (concerts)", "Author": "MeL0NheaD 3", "ReviewID": "R53PKG4SIP0YA", "Overall": "2.0", "Content": "I moved from a Sony HD55 which was great (dropped it in water), to a Sony HD70 which was also great but i broke the zoom lens. (also my fault)...  In reading review upon review... i went with this camera.  outside and natural light photos turn out great.  However, I predominately use my camera for concerts.  The Sony was spot on amazing for such, especialy on just the default AUTO settings.  This camera, not at all.  90% of the pics are blurry.  especially if using ANY zoom.  I can stand perfectly still, allow it to focus, get the green box showing focused, and it will take a blurry picture almost gauranteed.  Never have i had that on a camera.  shooting video in soft or lower light (say the living room with one lamp on) turns out pretty dim also.  Other than those, the camera would be great... unfortunately for me and how i use the camera, its a deal breaker and i'm getting rid of it and going to go back to my Sony.  I'm not a Sony \"fanboy\", but they've just proven tried and true for my camera habits.", "Date": "February 24, 2014"}, {"Title": "Nikon vs Lumix...", "Author": "Gazzy 1", "ReviewID": "R1O95FKLRMTAVT", "Overall": "3.0", "Content": "Well presented camera with good build quality and features... if they would just work properly. I have already experienced problems with it, like having to switch in on and off when it won't continue to take photos.I mean on the very first day!!! I have had Lumix cameras for the last 8 years and NEVER had this problem before. Picture quality is ok under about 12 x Zoom. At full zoom it has a \"comic\" picture effect. Once again not as good as a Lumix FZ40. Flash effectiveness, at close up range is fine, but at 5 metres or more, poor quality. So overall I am disappointed, and in reality I will use my  bulkier Lumix 90% of the time, so this was pretty much a waste of money.", "Date": "August 27, 2013"}, {"Title": "Great camera...", "Author": "André", "ReviewID": "R3NRPMI8VM8FRD", "Overall": "4.0", "Content": "Its a great point and shoot camera. The 22x zoom helps a lot to take good pictures in open areas.", "Date": "June 22, 2013"}, {"Title": "i need an english manual!", "Author": "w2", "ReviewID": "R1PTVND9AY1Z93", "Overall": "1.0", "Content": "i have features i need to read, but the manual is japanese. i paid for it, didn't I! please forward me one, thanks!", "Date": "January 30, 2014"}, {"Title": "nice camera", "Author": "rebecca", "ReviewID": "R1LPVRBCRQGCFA", "Overall": "3.0", "Content": "very nice camera, but i didnt understand how to use it. to technical for me. it arrived on time and in good condition , but had to send it back.", "Date": "November 2, 2013"}, {"Title": "Cheep made", "Author": "JF McClendon", "ReviewID": "RI3CLVJVJMVHH", "Overall": "3.0", "Content": "Battery door design is poor focus is not clear not well made I like me poor Coolpix much better. Old is better!", "Date": "August 10, 2013"}, {"Title": "Only one flaw so far.", "Author": "Susan", "ReviewID": "RHM1A89KD28AG", "Overall": "4.0", "Content": "I have had the camera for about a month now and I really like the pictures. The only problem is that the cord doesn't work to charge the battery or to connect to the computer. I don't know if I just have a bad cord or there is something wrong with the camera. It doesn't really matter since my computer reads SD cards and I purchased a separate battery charger.", "Date": "June 20, 2013"}, {"Title": "Camera", "Author": "Brian Anderson", "ReviewID": "R2JPKFGQF8PKIE", "Overall": "5.0", "Content": "I have had an initial look at this camera and already think I am going to really enjoy using it once I have got used to all the features. A great product.", "Date": "May 29, 2013"}, {"Title": "Great so far", "Author": "Seth Schroeder \"Tech Industry Professional\"", "ReviewID": "R33K7QJPAT4JSI", "Overall": "5.0", "Content": "Great camera so far with the little I have used it. Most of the reviews I read before purchasing were about \"lemons\" and not about the actual camera so I thought I would take the plunge. I didn't get it on Amazon, went with BB and their 3 year protection so I can take it into the store to get it fixed. I love amazon though and purchased my batteries on here with my prime membership.So in the end no issues yet with my limited time and after all my research if you want a small camera with over 12x zoom this is the one to opt for. There are samsung cameras out there but for the very slight (60-100) bump in price you get 30% more MP and 20% more zoom. Not to mention Nikon lenses that are the usually the best out there.", "Date": "April 20, 2013"}, {"Title": "I like it!", "Author": "Milton Santos", "ReviewID": "RECFJDQAFXKT7", "Overall": "4.0", "Content": "it does what it promises. I just missed the possibility to take panoramic pictures in this model. It would be perfect!", "Date": "April 18, 2013"}, {"Title": "VERY fragile", "Author": "Love to read", "ReviewID": "RVZ7V6VCUL79R", "Overall": "2.0", "Content": "I purchased this as a replacement for the 9100, which has been working very well, but after years the software wasn't quite up to speed. We love to hike, and took the 9500 to Yosemite National Park after owning it for 1 month. As I carried it, it bumped into a railing, and refused to work. Nikon called it \"dropped\", and refused to honor the warantee - so I can either pay $150 for a \"repaired camera\" or $250 for a new one. . .I'm NOT happy with Nikon that seems to look for any reason not to cover what should have been a 1 year warantee.The camera worked great - loved the features, but if one can't take this camera out of a cloistered environment, what's the point?", "Date": "October 16, 2013"}, {"Title": "Overall criticism", "Author": "Van L. Cox", "ReviewID": "RHX42CUMJNK6Z", "Overall": "4.0", "Content": "Awkward placement of on-off button; slow recovery for follow-up pics, searching for stored images.I do not have six more words.", "Date": "June 21, 2013"}, {"Title": "Sony wi-fi camara", "Author": "Sonia I. Cubero", "ReviewID": "R1N5DA3YCL4A4B", "Overall": "4.0", "Content": "Great camara however instruction for setting a little bit ambiguous for me. Will love to have Sony spend some money on better, easier to follow instructions. More detail.", "Date": "February 20, 2014"}, {"Title": "What good is it if it doesn't work", "Author": "jim smucker", "ReviewID": "R14XJNE0N1FKT", "Overall": "1.0", "Content": "I gave it one star because I couldn't give it no stars. It was a Christmas gift and when my girlfriend opened it, it said \"lens error\" and wouldn't turn on. What good is that?", "Date": "January 1, 2014"}, {"Title": "Seems to be a good camera", "Author": "kheimy", "ReviewID": "R2WB9GEG1CPVM6", "Overall": "4.0", "Content": "We have only had this camera for about a month. We took it on vacation and got some really good photos. We are still working out a few of the settings and trying to figure out how to do better pictures in action but all in all a pretty nice camera.", "Date": "July 7, 2013"}, {"Title": "Image quality sucks, regret every peny spent on it", "Author": "H&S; \"Tallica's\"", "ReviewID": "R3KMESJECV23T4", "Overall": "3.0", "Content": "The camera is great until you reach the time to see the photo quality, compression! the photo quality is compressed, didn't like it at all, why didn't I get me a canon or other brand, the S8400 was better but it had some dirt in the ccd compartment as well, why did I bought this?! crazy!", "Date": "July 26, 2013"}, {"Title": "Flash was broke", "Author": "cathie brown", "ReviewID": "R39J4BSFF62EPZ", "Overall": "1.0", "Content": "When I went to use this the flash was brokeGot it. For a gift and have to. Work with it till the flash works", "Date": "October 26, 2013"}, {"Title": "lens casts shadow or improperly closes when doing closeups", "Author": "Fairbanksan", "ReviewID": "R2TSVYTFXDOO08", "Overall": "3.0", "Content": "I had the Nikon Coolpix S 9300 and liked it alot better.The S 9500 casts a shadow when using closeup and zoom features in a low-light situation and also this situation with flash.  Has anyone else had this problem?Also, the flash does not retract automatically each time when I close the camera.I need to keep this one in a case because it opens when inside purse or bag and then likely to scratch lens (problem with my S 9300Lens shadow with closeups is a big problem and may cause me to return the camera.", "Date": "July 31, 2013"}, {"Title": "A great and feature-rich camera!", "Author": "L. Jodell McLemore", "ReviewID": "R3LH3JHR7S9P0I", "Overall": "5.0", "Content": "I love this camera! It is small enough to carry around and it takes great pictures. I have not used the Wi-FI option yet, so I cannot comment on this feature.", "Date": "April 19, 2013"}, {"Title": "I sent this product back..", "Author": "Arachne \"Born to be wild.\"", "ReviewID": "R3RJEQGBPRAV15", "Overall": "1.0", "Content": "...and therefore cannot rate it.  Upon delivery it was refused as I had chosen something else.  I am sorry that I could no it be of more help.", "Date": "March 6, 2014"}, {"Title": "This camera broke within a month of purchase!", "Author": "Leslie Szabo", "ReviewID": "RJ2CM4WETL6O6", "Overall": "1.0", "Content": "I found this camera to be a bit confusing to learn all the features. Then I dropped it onto a carpet from coffee table height and the lens will not shut. It is unusable!", "Date": "October 17, 2013"}], "ProductInfo": {"Price": "$232.89", "Features": "22x optical Zoom-NIKKOR glass lens\nLens Focal Length: 4.5-99.0mm\nMechanical and CMOS electronic shutter\n3-Inch OLED (614,000) Display\n1080p Full HD Video with Stereo Sound", "Name": "Nikon COOLPIX S9500 Wi-Fi Digital Camera with 22x Zoom and GPS (Red)", "ImgURL": "http://ecx.images-amazon.com/images/I/412S7M8FwxL._SX300_.jpg", "ProductID": "B00B7N9C4Y"}}