{"Reviews": [{"Title": "love it", "Author": "Ricardo Pérez", "ReviewID": "R3RDRFS40ZHPV9", "Overall": "5.0", "Content": "I just upgraded from the canon 550D and differences are remarkable.  The 6d body feels amazing and the 24 - 105 delivers great image quality.  I think what im most impressed about the 6d is its low light performance: both noise at high iso and focussing are great.Really happy with this purchase.", "Date": "September 1, 2013"}, {"Title": "AWESOME camera at a ridiculous price", "Author": "Arawnsd", "ReviewID": "R2396VQ2GM7ZVE", "Overall": "5.0", "Content": "The camera and lens are legit, and at this price, you basically got everything else for free.  The battery grip, extra battery and chargers are all of good quality and do exactly what they should.", "Date": "September 24, 2013"}, {"Title": "6D Package Pros & Cons", "Author": "Peter W. Coe \"Mr COE\"", "ReviewID": "R2T9ZMLUIGH0LB", "Overall": "5.0", "Content": "To begin, the package deal for the 6D is a pretty good one.  The battery grip is actually pretty good quality. The UV filter does what most of buy them, to protect the actual lens glass from dirt and scratches.  The generic battery works in the Canon charger and seems to last as long as the Canon battery does.  The SD card is a class 10 and seems to do well for raw, jpeg or video.  The other stuff, gets the \"whatever\".The 6D with all the mixed reviews is simply this in my humble opinion.  Its a full-frame quality camera that I can afford and still stay married to my wife rather than my hobby. The focusing seems to work fine for my needs, in all conditions so far. Low light is not an issue and tracking my mini dachshund run across the yard delivers sharp pics as well, so the concept of it not being a potential sports camera seems a little inaccurate.  The stills on this camera are very sharp and colors are rich and accurate.  In auto mode it tends to select higher ISO's than seems needed, so recommend P mode.  RAW photos again are surprisingly rich and not too flat, but leaves you plenty to work with in Photoshop or Lightroom.  Please note, you will need Lightroom 5 in order to open and work with the file RAW file format from the 6D and the 70D as well.  The issue of not having a earphone jack for video use, is insignificant to me.  Are you really going to use the camera mic and its audio for a true production product ?  Dunno, just me.  About the only thing I miss is not having two memory card slots.  Then again, I've had 6 DSLR's prior to my first one that did have two slots and never had a card failure, so again, Dunno.  My closing thoughts, is that its a great camera and gets you into the full-frame without selling your first born or not going out to eat for a year or so.  Yes you give up some functions that the 5D-II, but they both take exactly the same quality picture, which I've seen side by side.  The EF-24-105 kit lens is fantastic as well.  Sharp images in all focal lengths and works well even low light even though its an f/4.  The WIFI, yea it works and is neat to have, and works pretty reliably, once set up, but still gives me the gimmicky feel. Does not work in video mode which would seem to make sense that it should.All in all, for the price, its a great camera and this was a pretty good package.  Thumbs Up, from me.", "Date": "December 8, 2013"}], "ProductInfo": {"Price": "$2,499.95", "Features": "KIT INCLUDES 11 PRODUCTS -- All BRAND NEW Items with all Manufacturer-supplied Accessories + Full USA Warranties:\n<1> Canon EOS 6D Digital SLR Camera Body with EF 24-105mm L IS USM Lens + <2> Transcend 64GB SDXC 10 Card +\n<3> Battery Grip for Canon 6D + <4> 77mm 3pc (UV/FLD/CPL) Filter + <5> Spare LP-E6 Battery +\n<6> Battery Charger for LP-E6 + <7> RC-6 Shutter Remote Control + <8> PD 6pc Complete Cleaning Kit +\n<9> PD Memory Card Storage Wallet + <10> LCD Monitor Screen Protectors + <11> PD SDHC Memory Card Reader", "Name": "Canon EOS 6D Digital SLR Camera Body with EF 24-105mm L IS USM Lens with 64GB Card + Battery & Charger + Battery Grip + 3 UV/FLD/CPL Filters + Remote Kit", "ImgURL": "http://ecx.images-amazon.com/images/I/51%2BVDpHS-RL._SY300_.jpg", "ProductID": "B00BD2QOEK"}}