{"Reviews": [{"Title": "Incredible Deal!!!", "Author": "Ginnie Norrgard", "ReviewID": "RPRY8XLDKWWB1", "Overall": "4.0", "Content": "This was an incredible deal. I had gone into Best Buy to look at this camera. The camera in store (with no memory storage or extra battery) was as expensive as this complete package. I was a little hesitant about the deal as it seemed too good to be true, but I'm so glad that I went through with buying this camera on Amazon. The only thing that I am struggling with is the WIFI setting. It claims I have found an access point, but always that the signal is too low. I still find it easiest to just plug in the camera to the computer, so I'm not too concerned about this. I have owned sony cyber shot cameras before, and they have really made some great improvements with the many settings this camera has to offer. I am also a fan of the setting wheel rather than the menu keys as well as the zoom knob around the capture button. This camera has both of these qualities I like.", "Date": "July 21, 2013"}, {"Title": "I'm digging it.", "Author": "Michael Collier", "ReviewID": "RF7UYGWA4CTMO", "Overall": "5.0", "Content": "I was looking for a compact camera with great resolution and this does just that.  I was comparing this with some of the cannon compacts and decided for higher resolution and less zoom and instead of lower resolution and more zoon from the cannon.I've owned prior models of sony cybershot camera's and this one does the job.  Easy to point and shoot, easy to setup and has a lot of options 'maybe too many for a compact' but lots of options.  Flash works much better than i thought i would for such a small flash.  The 25mm lens captures the room well.  The pictures so far are vibrant.  I'm looking forward to using it more.There were some poor reviews about battery life.  It looks like it was last a few hours if just shooting pictures and I'm totally ok with that.  I bought the kit form focus and it came with a spare anyways that will fit in your change pocket so if you're going to be shoot a ton, take a spare.  Overall I'm very happy and the kit was a steal vs buying the camera alone.  I would recommend to a friend.", "Date": "May 5, 2013"}, {"Title": "I love this camera!", "Author": "VickyW", "ReviewID": "R2FJV0U4759SV5", "Overall": "5.0", "Content": "I was recently in the market for a new camera after destroying yet another one (yeah, I'm a klutz), and especially wanting to get something that would take excellent video. I'd been using Canon Powershots for several years, and originally I had been satisfied with them, but more and more I was becoming frustrated with the video limitations. I like to shoot live musicians in dark clubs and with the Powershot it was tough to get it to focus quickly in dark conditions; plus, once you started shooting video you could still zoom but there was no way to refocus. Seeing better videos produced by others that had been shot with different cameras, I knew there were better options out there. Plus, the older Powershot I had was pretty heavy and hard to hold steady for long periods if recording several songs. Which was probably one reason why I kept dropping the damn thing. My criteria for a new camera were: 1) Excellent video capability; 2)Lightweight; 3)Reasonably priced, ideally under $200.After researching various consumer sources and looking at Amazon reviews, I was finding it hard to make a selection. Then I came upon the listing for this camera. At the time it had all good reviews and seemed to meet all of my criteria. I decided to go for it. And boy, am I glad I did! In addition to taking excellent photos in all lighting conditions, I tried it out last weekend at a dark club and was thrilled with the videos I ended up with. I like how it has a one-touch button for video and self-correcting focus, so if you are trying to follow an active performer's movements across the stage it continually refocuses for you. My videos were crystal clear and the sound quality was phenomenal, considering I was in a small club with overamplified sound. I could not have been more delighted. I brought two fully-charged batteries and was able to get about 10 songs on the first battery; after 9 songs the second battery was still good. It felt like nothing in my hands and was very easy to hold, easy to turn on and off. The one issue I have with it is that it is a bit challenging to remove the battery and so if one wanted to change batteries quickly I found that to be difficult. But otherwise it surpassed my expectations. I was able to take a great picture of a spiderweb that was invisible when I took a pic of it with my phone; as an experiment I took a photo of a dark museum exhibit with no flash and it came out as if there had been light. I am very pleased with this camera and highly recommend it.", "Date": "October 2, 2013"}, {"Title": "Compact and practical", "Author": "c_busta", "ReviewID": "R307QYTAXYVG9V", "Overall": "5.0", "Content": "I bought this camera for my girlfriend and it has been amazing. She always takes pictures of friends and everything when we go out, and later posts them on facebook. The camera is very small so she has no problem carrying it around and the wifi function allows her to connect the camera to her smartphone and save pictures there or upload them to the internet from the phone. The wifi function also enables using the smartphone as a remote control/second screen, so you can set it on a table and see on the phones screen where the lens is pointing, zoom in or out and take the picture.Pictures look great night or day and there are a lot of manual funtions, ISO settings and other things to play around with for more advanced users. It also tells you if someone blinked whie taking the picture, takes multiple pics and choses the best one, fixes skin imperfections and other things which we really have not messed around with much. All in all it was a great purchase, especially with the extra battery, case and memory card.", "Date": "August 3, 2013"}, {"Title": "Cute, Fun, Photos on the run", "Author": "~Shawn~", "ReviewID": "R23CZD5V6R8PJK", "Overall": "4.0", "Content": "I wanted a little point and shoot to take with me when I knew I wouldn't want to carry around my big camera.  I had only looked at a couple, and saw this one in the store, and liked the look, and the clarity it gives.In owning it, I am not 100% sure it does what I expected, but for the price, and for what I want to use it for, it does GREAT!!! I can't expect more from something that I didn't pay alot for.. but... with that said.. this little guy does a WHOLE lot of things, that every time I sit and play with it, I find something new.Some complain about no charger, but I have one in my camera box that CAME with it. So I am not sure.  You can do it 2 ways, with your computer via USB or with plugging it in and charging it that way. The charging of the battery is done with the battery IN the camera.  I also purchased This...\"EZOPower Battery Charger with EU / Car Adapter + Accessory Pouch Case for Sony DSC-TF1, TX30, WX80, W730, W710, W670, WX150 Digital Cameras *Compatible with NP-BN1* (from Amazon)\" as a just in case because people had said there wasn't a charger.  With this, I can now use in the car too, but so far, once I charge the battery, it lasts me all day.I love the size of this camera, I love the shots that I have gotten.  With any camera, you have to get to know it, and figure out the settings that you want, to get the result you want, this one isn't any different.I am NOT disappointed in my purchase of this camera/set.", "Date": "July 16, 2013"}, {"Title": "Excellent camera!", "Author": "SOS \"ssrn\"", "ReviewID": "R1XT9A6IING877", "Overall": "5.0", "Content": "The Sony Cyber Shot WX80  is by far one of the best cameras being sold today!  The picture are crystal clear, beautiful colors.  Small and thin camera that even fits in my pocket. It very easy to use.  Amazing product!", "Date": "May 20, 2013"}, {"Title": "nice bundle", "Author": "Amazon Customer", "ReviewID": "R2MJP0I0RVOGWO", "Overall": "5.0", "Content": "I received everything that was promised. Very nice camera. Was also nice to get everything all at once that was needed to get started. Very good value. Camera alone retails for $180.", "Date": "May 13, 2013"}, {"Title": "Disappointed", "Author": "Vicky", "ReviewID": "R30TVPN48ZL4M3", "Overall": "3.0", "Content": "I like the size of this little camera but I was looking for something that would take pictures without too much hesitation between shots and this is not it.  The quality of the picture is good but by the time I get the shot of my grandchild they have already moved and alot of their shots are from the back of their heads!  I guess I need to spend alot more money if I want a camera that will click away when I need it to.", "Date": "November 16, 2013"}, {"Title": "Great purchase", "Author": "Ricky", "ReviewID": "RVE0XS0IY1HW7", "Overall": "5.0", "Content": "I have done a lot of research on cameras before I made this purchase. I went to multiple stores to test the cameras I was comparing. I am very happy with this camera. I am replacing a Nikon Camera I bought two years ago. This camera is compact easy to use and takes awesome pics.", "Date": "July 2, 2013"}, {"Title": "Great point and shoot", "Author": "deirdrebardowl", "ReviewID": "R15XAK60HZ8KH4", "Overall": "4.0", "Content": "I lost the charger for my little w560 and after looking around a bit I was surprised to find out that Sony makes point and shoots with CMOS sensors for around 150 bucks. That intrigued me and even though my trusty w560 is still in perfect working order besides for the charger, I decided to upgrade. What I have discovered is that I need a point and shoot with the low light capabilities of this camera.It's really amazing to be able to take decent pics indoors without the windows open or using the flash. This camera can do it. This camera also has a host of neat little shooting modes and color options as well as being capable of HD video with stereo sound. I have played with this camera for a week now and I'm still discovering new things buried in the menus. I'm very happy with my 150 dollar purchase and it's worth every penny.Now for the cons. The build of this camera is smaller than my w560 and feels more flimsy. The smallness isn't a problem but coupled with the plastic feel it's a little bothersome as far as worrying about damaging the camera. The shutter button is also another issue, at least on my camera. The zoom function is tied into the shutter button and it will actually rattle if I shake the camera gently. I thought I had broken my camera when I used the zoom function the first time, it moves around and isn't seated firmly at all. It doesn't seem very stout and able to put up with much use. The screen is smaller than I imagined which is just a nit-pick.The anti-shake technology also isn't everything the company preaches it is. In low light it does much better than a normal camera however hand shake is an issue. I mean if you can hold as still as is humanly possible you can get some great shots but if your subject is moving or you are moving for any reason, the image isn't usable which I expected. Even my Sony CMOS DSLR has issues with low light without using flash but the company shouldn't use the anti-shake in low light as a selling point making people believe something that isn't even possible with more professional products from this brand.Having said all that, this camera is still deserving of 4 stars. Only the build and the bit of flamboyant marketing is questionable about this camera. I am a firm believer in Sony as being more bang for the buck and this camera is not an exception.The included case is a bit tight-fitting and there aren't any pockets for storing anything, just the camera and a lens cloth.  However for the price it's very acceptable and I use it constantly to protect the camera.  The memory card is great and as of now, after taking almost 500 pics I still have room for 1500 more.  The extra battery is perfect and fits my old camera as well.  I didn't get the screen protectors but I have the lens cloth in the bottom of the case and I use it frequently.  I must also mention this camera charges the battery while in the camera so I went ahead and bought a wall charger since that's what I set out to do in the first place.  So now I have three batteries that fit both my cameras and a charger.", "Date": "September 4, 2013"}, {"Title": "Good point and shoot", "Author": "Reviewer", "ReviewID": "R8DT6S26ISD5M", "Overall": "5.0", "Content": "I'm happy with this camera. I bought this camera for its burst mode. Keeps up pretty well wih my 3 year old. I took great picks at the circus even though it was dark and I was sitting far away from the action.", "Date": "July 5, 2013"}, {"Title": "This click was recomended by a professional as his favorite point and shoot", "Author": "Gaston W. Garrett", "ReviewID": "RCVCVCXW8PDFB", "Overall": "5.0", "Content": "I am very glad I took his lead.  It performs very well, for a person like me, that needs a good point and shoot.  I don't know squat about photography, but like to take pictures when the need arises.Gaston", "Date": "January 17, 2014"}, {"Title": "Best camera ever!!!", "Author": "Toni Marino Ferry", "ReviewID": "ROBFKLN49ZYNC", "Overall": "5.0", "Content": "First off I do love Sony cameras but I never expected this much quality for such a great price in a tiny… yes.. tiny camera!  I'm blown away by the quality of the pictures, ease of use, lightweight and how compact it is.  I can carry it anywhere!  I'm not a  tech person so I haven't even tried the wi-fi capabilities but it's easy to plug into my macbook Air and download the pics.  Not only easy but super fast!  Love that it came with the SD card and carrying case.  The case is very sturdy and I don't' worry about my camera getting damaged.  The extra battery it comes with is also a nice perk.  And speaking of the battery… I get a long life out of mine.  I can take tons of shots and it's still good.  I would highly recommend this little gem to all my friends.  If you ask me it blows other small camera away.", "Date": "January 13, 2014"}, {"Title": "Great little camera, very good pictures, slightly complex operation.", "Author": "Mike from Florida", "ReviewID": "RU8SMLA4JA1XC", "Overall": "4.0", "Content": "The camera is overall very good.  I would have given it a 5 except for the complexity of the controls and user interface.  I have an SLR as my primary camera, and this is my third cybershot used as a back-up/snapshot unit.  My hands are pretty large and it is very difficult to manipulate the controls, not unexpected in a unit this compact.  Controls and settings are not intuitive, and once you accidentally get into a menu there is no graceful way out (no equivalent \"escape\" key) and I find my self using the power switch to get back.  Like the panorama feature,and the photos are crisp and well balanced right out of the box.  Would suggest covering the display with a protector sheet, it does not seem to be as hard as most other current technology.  Flash is very weak,disappointing beyond about 10 feet.  My other Cybershots were good well beyond that range, but were larger and thus had more battery capacity.  Bottom line, package deal was a good value since it included a spare battery and a 16G flash card.  The flash card is an SD format, much better than the old memory sticks.", "Date": "October 9, 2013"}, {"Title": "nice little camera", "Author": "Mudsow", "ReviewID": "RWSXSB873CCZ3", "Overall": "4.0", "Content": "This is the second sony cyber shot I've gotten, my last one was bought in 2004, and it still works after 10 years so I wanted the same kind. This one is much smaller, it can fit in my pocket and I love the fact that it stabilizes the picture so I don't have to hold my breath when I shoot ;-) and it takes great animal shots. It is tough to photograph a moving target and this little camera does a great job. I only gave it 4 stars because I can't seem to get it to connect to my computer and you have to connect it to set up the wi-fi feature. So I end up just removing the sd card and inserting that into my computer. Not a big deal for me, just a little disappointing. Plus at times it is almost too small, hard to hold onto to get a picture if you are shooting at a weird angle. But all in all I like it, it takes very nice pictures.", "Date": "March 21, 2014"}, {"Title": "Love this camera!", "Author": "Rachel Ulloa", "ReviewID": "R3OK6F1V3R9DBZ", "Overall": "5.0", "Content": "The Sony Cyber-shot seems to be the perfect camera for traveling.  It takes better pictures than my phone, but is so small and light that it isn't a hassle to carry.  It takes quick/clear shots.  It isn't like the Nikon that I had before and didn't enjoy.", "Date": "March 20, 2014"}, {"Title": "A nifty little camera!", "Author": "Test", "ReviewID": "R38HHPL9ZTWPMM", "Overall": "5.0", "Content": "This is a very handy compact camera.  We just keep it in a pocket whenever we venture out - its light weight and small size make it almost not noticeable.  It has provide some real good shots.  Its video capability is exceptional for such a small camera.The small version of the built in USB port is not that easy to hook into.  A good deal of care is needed to make sure any connecting USB cable seats in properly.", "Date": "March 10, 2014"}, {"Title": "Nice camera so far", "Author": "Tom", "ReviewID": "R18X50B3T8U8BQ", "Overall": "5.0", "Content": "Let's face it.  I just bought this, and Amazon is on my back like a cracked out monkey to rate it right away, so I am.  So far, I have taken 4 pictures as trials, and they all came out nice.  I did find out that the battery does not come with enough charge to access the memory card, so it may give an error message.  Mine went away, and I calmed down, once I charged the camera.So far, it seems to be a nice camera at a reasonable price.", "Date": "March 9, 2014"}, {"Title": "Extremely Pleased, Excellent Camera, Excellent Images, Easy to Use", "Author": "HeartlandLiberal", "ReviewID": "R17ZEGCGETPQ2I", "Overall": "5.0", "Content": "Purchased this for my wife, to replace her ancient early Nikon digital Coolpix first generation dinosaur of a camera. At first we were taken aback by how small this camera is, but we quickly adjusted to that, and are extremely pleased with the quality of the pictures, and the ease of operation. The fact that it takes 16 megapixel images, same as my $1,200 when new Pentax K-5 from two years ago, is just another example of how rapidly digital photography continues to advance, and make incredible quality of imaging available at consumer prices. Note that the lens is from Zeiss, another big plus. I have to give this camera five stars. In fact, I am so pleased with it, I am considering just buying another one for myself, to keep in my pocket all the time, much easier than lugging my bulky DSLR Pentaxes around.", "Date": "January 2, 2014"}, {"Title": "So sad to leave a negative review for a Sony.", "Author": "Vanessa Nichols", "ReviewID": "R299TY3Q9Y948P", "Overall": "2.0", "Content": "I'm so confused by all of these positive reviews for this camera. I'm REALLY hoping mine was defective because it was pretty awful and I have owned 4 Sony digital cameras in the past.The battery life is the WORST on any camera I have ever owned. It lasted maybe 20 minutes or so. We took this to a theme park and in order to preserve battery life, I had to shut it off IMMEDIATELY after I took a picture and even at that it died less than half way through the day. No wonder why it comes with an extra battery...but that one also died very, very quickly.The picture quality was really great in the right setting/lighting but I found the intelligent setting to be extremely temperamental. I came out with a lot of blurry pictures and the camera seems very fussy about lighting.The video quality was great but what good is it if the battery life is so bad?After being an avid Sony lover for a long time, I think I'm going to switch after this purchase. This is the second Sony in a row that has disappointed me.", "Date": "October 1, 2013"}, {"Title": "Great Package", "Author": "JCJ", "ReviewID": "R1991I56MKVMK1", "Overall": "5.0", "Content": "The camera takes good pictures, is light weight and small.  I took the advise of folks to turn the camera to airplane mode and had no battery issues.", "Date": "September 17, 2013"}, {"Title": "Great Package Value", "Author": "Thomas J. Mcdonald", "ReviewID": "R18KSA7PK39X3B", "Overall": "5.0", "Content": "looked for a small easy to use camera and Sony won.  Love the WiFi feature and the compactness of the camera.  Don't be fooled by the size the pictures were clear and crisp.  The only issue was getting used to the different settings for that perfect shot.", "Date": "August 16, 2013"}, {"Title": "Don't buy this to send the pictures to your phone or computer by Wi-Fi", "Author": "Sambista Girl", "ReviewID": "RVNMCJ9PO3M0M", "Overall": "2.0", "Content": "I bought this camera because I wanted a better camera than the one I had on the iPhone4, especially for night shots.  And, I thought I could send the photos to the iPhone for uploading to Facebook or emailing. Don't get this camera if that is what you want to do.  First of all there is no information on how to do this in the manual.  The step-by step on the camera just doesn't provide what you need to get it working.  The customer service at Sony was useless.  I eventually found a FAQ on the Sony site that said I had to have a certain software on my phone, which I have now installed.  After 10 minutes, the phone and the camera are still trying to complete a transfer of one photo.  Next time, I am just going to upgrade my iPhone to one that has a better camera!", "Date": "April 14, 2014"}, {"Title": "Unhappy with the battery \"door\"", "Author": "Rina Bass", "ReviewID": "R2LFLXSFHDTUQZ", "Overall": "2.0", "Content": "I bought this camera 17 months ago.  I use it occassionally.  I have liked the ease of use and the sharpness of the pictures.  But not the \"door\" that opens to get the battery out is broken and won't close.  I am shopping for a new camera.  I expected this product to last longer than it has.", "Date": "April 13, 2014"}, {"Title": "Not impressed", "Author": "James Jordan", "ReviewID": "RDBHZX5C0G05H", "Overall": "2.0", "Content": "Very difficult to compose a photo in sunlit, outdoor conditions - can't see the LCD screen. Also some pictures were in focus and others not so great. Small size makes it easy to accidentally press a button that you didn't want to. I suppose if I work with it some more this might improve, but so far not totally impressed.", "Date": "March 26, 2014"}, {"Title": "Great Camera", "Author": "Munshi Khaledur Rahman", "ReviewID": "R1N2HRJ3G9F6KA", "Overall": "5.0", "Content": "Very happy to have this camera. The camera arrived on time and it is as it was described. No issues that I can complain.", "Date": "March 22, 2014"}, {"Title": "Sony Cyber-Shot DSC-WX80/B Review", "Author": "Dirk A. Hurd", "ReviewID": "R3DSZSDOIB1EEY", "Overall": "5.0", "Content": "I love my new Sony Cyber-shot camera.  The camera is very versitile and convenient for its size.  It has Many different modes of pictures that can be taken.  It is able to take 1080p video which is very nice.  Also, you are able to send pictures or videovia wifi to a computer or smartphone.  Comes with a charger, even though it is not listed with the components.I give it a 5 out of 5 because it is a great buy. If you are a amature photographer, this would be a great camera for you!", "Date": "March 8, 2014"}, {"Title": "Great camera", "Author": "Mary", "ReviewID": "R3UPS7ERFW5BA2", "Overall": "4.0", "Content": "Very compact and light weight.  Great price for camera and accessories.  I would buy the silicone protective case because it's so lightweight.", "Date": "March 3, 2014"}, {"Title": "Ok but the newer model has less desirable features", "Author": "A. A. Miller \"simply weird and loving it\"", "ReviewID": "R3P13Z88IZ1BHP", "Overall": "4.0", "Content": "My old camera is basically the same just less MP. This one you have a round flat knob that the slightest touch changes the settings and I HATE it. It is too sensitive and I can be ready to take a pix and I will accidentally change the settings. It's very frustrating. Other than that it's a decent camera for the price. Pic are good and it's fairly easy to use.", "Date": "February 27, 2014"}, {"Title": "SONY Cyber -shot DSC has met my expectations so far.", "Author": "Claudia G.", "ReviewID": "RB4PAIYYOD4X4", "Overall": "5.0", "Content": "Before buying the camera i read some reviews and decided it was what I needed. So far, i have been very happy with it. it's small, fits in my bag and has all the gadgets I need.", "Date": "February 2, 2014"}, {"Title": "Great point and shoot camera!", "Author": "Walter J. Krystoforski", "ReviewID": "ROYNDK2MJA4IZ", "Overall": "5.0", "Content": "Let me start by saying that I an AMATEUR photog. I just point and shoot. That being said, this seems to be a great camera for me. Works great. I saw reviews that say the camera is too small, and I agree. If you have big fingers, it is tough to manipulate the buttons on the camera. I liked my old Sony with the selector knob on top, as opposed being to all menu driven. However, I think this camera is a great deal for the money and features.", "Date": "February 1, 2014"}, {"Title": "Sony DSC-WX80B", "Author": "Richard C. Palson", "ReviewID": "RFFA15SWJMEYL", "Overall": "5.0", "Content": "Wanted a \"tiny\" camera for portability. Sony has always given me reliable products. Still true. Fine little camera and, surprisingly, quite good in low light. It fulfills my expectations. Take your SLR if you expect to do really serious work. Otherwise this one can be always with you.", "Date": "January 31, 2014"}, {"Title": "Love my Sony Camera", "Author": "Amanda Bruce", "ReviewID": "R1WZ858JXHAJRZ", "Overall": "5.0", "Content": "Love this camera, it's easy and fun to use. I usually only buy Canon or Nikon and needless to say I am so impressed with Sony!!!", "Date": "January 25, 2014"}, {"Title": "JUST GREAT!", "Author": "Rene", "ReviewID": "R2LBYU7K8VQTN8", "Overall": "5.0", "Content": "My daughter loves her camera. She will be using it to take pics for her online store so the clarity, zoom in on a larger photo and small size for use over a long photo session are all important.  She is also having fun with some of the special abilities-- highlighting one color at a time  in a black and white photo just great.", "Date": "January 1, 2014"}, {"Title": "useful and agile", "Author": "Julio Pinto", "ReviewID": "R2RJJO7YB30EC3", "Overall": "4.0", "Content": "Great little camera. Does its job well and quickly. Good resolution. Its battery lasts long and it is easy to handle.", "Date": "January 1, 2014"}, {"Title": "Sony cyber-shot DSC-WX80/B compact Zoom Camera", "Author": "Katie Collard", "ReviewID": "RRBOC794X5HW1", "Overall": "4.0", "Content": "I bought this camera for my Husband, He likes to ride his 4-wheeler around, This Sony cyber-shot DSC-WX80/B compact Zoom Camera,Is perfect for him.A great gift.", "Date": "December 29, 2013"}, {"Title": "Cute and handy!", "Author": "Franklin dela Cruz", "ReviewID": "R34SUBNQ8KV79L", "Overall": "4.0", "Content": "I like this camera. It's cute and handy. I could simply put it in my pocket and you won't notice it. I'm glad that it arrived on time and had all the items stated on the package! I'm still figuring some functions that it has. My concern only is the connection of the camera with my iPhone to take pictures. I was not able to connect it so that I could use my phone as its remote control even if I have a good wi-fi. In general, this is small but good camera especially if you want to travel light.", "Date": "December 24, 2013"}, {"Title": "Worth for price", "Author": "venkatakrishna", "ReviewID": "R1CG7FWQYNYJP1", "Overall": "4.0", "Content": "This sony cybershot met all my expectations and worth for the price. Shutter times is less and images are good.", "Date": "December 23, 2013"}, {"Title": "Wonderful camera", "Author": "Ronnie Negley", "ReviewID": "R3DFMM8O14ZMLM", "Overall": "5.0", "Content": "Easy to use.  Buttons are VERY small.  Still learning what it's capable of doing.  I am happy I bought it.", "Date": "December 17, 2013"}, {"Title": "Truly a sweet little camera", "Author": "Terry Sz.", "ReviewID": "R1WTIDV62S9GFZ", "Overall": "5.0", "Content": "I am in love with this little amazing camera.Of course, I am still learning things about my new camera, but it is loaded with features and easy to use.I was very interested in using wifi to send pixs to my smart phone and once I learned the simple task, I love it!This phone is very small, fits in anything.The pictures are very nice as well as the videos.I am very pleased with my purchased.I first purchased the Samsung and hated most things about it so thats a return.", "Date": "December 17, 2013"}, {"Title": "Nice Product.", "Author": "Anubhav Dey", "ReviewID": "R1FUZ5DBQMIBR", "Overall": "4.0", "Content": "Value for money... very competitive prices... clear picture... very good resolution... would definitely recommend to a friend. The only thing I didn't like about it was battery charging slot...", "Date": "December 17, 2013"}, {"Title": "Smooth transaction", "Author": "Sabahudin", "ReviewID": "R2K4VUAJB4W1HM", "Overall": "4.0", "Content": "Very good camera for a very good price. Working as expected. The size of the camera is good. I like the camera case.", "Date": "December 16, 2013"}, {"Title": "Full-featured camera", "Author": "David A. Read 122251", "ReviewID": "RGZCMTLVNZ99X", "Overall": "5.0", "Content": "I suffered through two digital  cameras from a competitor that broke under normal use.  I have other quality Sony products so I took a chance on this camera.  I haven't been disappointed so far.  The best feature for my use is the navigation wheel that allows me to change options quickly without  too many menus and keystrokes.  It takes creditable pictures and video for my use, but someone more discriminating might find the camera lacking.  The best suggestion I can give is this:  if you are clumsy (like me) or you need a substantial frame to hold on to while operating the camera, be sure to install and use the string safety loop that comes with the camera.  This sucker is slippery.  As for the rest of the kit, I have only used the case so far.  Be sure to use a Class 10  or above memory card or you may not be able to capture continuous action shots or video.  I would buy this product again.", "Date": "December 14, 2013"}, {"Title": "great camera", "Author": "fbk", "ReviewID": "R3JDQ3UKG3X5FW", "Overall": "4.0", "Content": "great optics, takes great pictures, almost miniature in size.  long battery life.  lightweight. another great sony camera product.  would be a bit difficult for someone with big hands, I think.", "Date": "October 11, 2013"}, {"Title": "New Camera - takes nice pictures as expected", "Author": "Debra L Sheffer", "ReviewID": "R170P33VUGA1JN", "Overall": "5.0", "Content": "so far - it seems to take really nice pictures - i haven't explored it totally butam very happy as of now.", "Date": "October 8, 2013"}, {"Title": "Love this camera", "Author": "E. E. S.", "ReviewID": "RX3BZ49DGTUK6", "Overall": "5.0", "Content": "This camera is great and takes wonderful photos.  One of my favorite features is that you can be recording a movie, and capture still pictures at the same time!  It's a little slow (you can't take many pictures quickly - but I think there might be a mode for that) but other than that I really like it.", "Date": "September 24, 2013"}, {"Title": "Fantastic Bundle", "Author": "MusicCritic", "ReviewID": "R6I9AHTSS5FF5", "Overall": "5.0", "Content": "Great product, absolutely love it. Takes amazing pictures and HD movies. Recommend it to everyone. It is a great product and I am glad I bought it!", "Date": "September 16, 2013"}, {"Title": "Great bundle, Awesome Camera", "Author": "Shels", "ReviewID": "RK88WI1OVHKPF", "Overall": "5.0", "Content": "I'm quite pleased with this purchase. I received everything that was promised and the picture quality of the camera is great.", "Date": "September 8, 2013"}, {"Title": "Cute, nice camera", "Author": "Douglas Greene", "ReviewID": "R3LDR3QSAXMCX8", "Overall": "5.0", "Content": "This little camera exceeded our expectations.We were looking for a small camera, since our son lost our last one. This had a high pixel count, and looked like a good option.We were impressed on how well it did in low light and fast motion - one of the things at which we take lots of pictures, is our annual New Year's Eve party. Typically, pictures have some streaking from the movement in low light, and sometime the color is off. This camera, on the other hand, took great, unblurred pictures.It's ability to take pictures during video is also nice, since there have been times that you start videoing, and want to grab a picture in the midst of it - no problem! just click the shutter, and you've got a still.The only thing that takes a little getting used to is that the video record button isn't the shutter button.", "Date": "February 6, 2014"}, {"Title": "There is no external charger", "Author": "Pramod Bindal", "ReviewID": "RF53DYRM6AUKW", "Overall": "3.0", "Content": "This product is ok, but the charger provided with proudct is not good. I can not charge a battery while i am using the camera which is vary usual scenario for me that's why I keep spare batterys", "Date": "May 9, 2013"}, {"Title": "Amazing combo", "Author": "Federico Gaule", "ReviewID": "RV92UK7R44DEC", "Overall": "5.0", "Content": "Fast delivery, great stuff plus a really good pocket camera. I'm not photographer but i like to have nice pics, and with this camera, i'm satisfied", "Date": "August 20, 2013"}, {"Title": "Good one !", "Author": "Bhushan", "ReviewID": "R3TNB42BMPT358", "Overall": "4.0", "Content": "It is really good. Lightweight & easy to use. Worth its price. Only one thing can be of worry is, it is too small to grab firmly & may slip through one's hand easily.", "Date": "June 2, 2014"}, {"Title": "Excellent camera", "Author": "HDC", "ReviewID": "R1UQ1YKE0DNM13", "Overall": "5.0", "Content": "Small camera.....easy to use. Bought a Sony \"skin\" protector for this camera. Took it recently to D.C. and kept in my front pocket, without it's case. Very easy to take out of pocket and put in the security screening containers at the Museums, Capitol and Pentagon.", "Date": "May 21, 2014"}, {"Title": "Good camera w/many features", "Author": "ckbbuckeye", "ReviewID": "R1JT59HEYC0H2X", "Overall": "4.0", "Content": "I like all the features of the camera and the price is great.  It is smaller than I really like. (personal preference)  A great small camera to carry at all times so you never miss a photo opp.", "Date": "May 19, 2014"}, {"Title": "Great camera", "Author": "Amazon Customer", "ReviewID": "R3RNYV78SFB186", "Overall": "5.0", "Content": "We used the camera for a European trip, easy to use. There ware two batteries that came with the camera, not in the detailed description about what was included. We ordered another battery from another source so now we have 3 of them, didn't need to spend the additional money.", "Date": "May 17, 2014"}, {"Title": "Very nice camera for a reseasonable price", "Author": "Lindsey H.", "ReviewID": "RHBMLPF42KQKC", "Overall": "5.0", "Content": "Very happy with this purchase! Great camera and many accessories for a great price.  I would highly recommend to a friend.", "Date": "May 15, 2014"}, {"Title": "Very good Camera", "Author": "Manasi B", "ReviewID": "R3S74FS9UQG9YE", "Overall": "5.0", "Content": "I bought this camera for a friend as a bday gift and it turned out to be one of the neatest camera bundles for its price! The camera has a good deal of features for the price including background defocus and partial colour. The camera also does full HD videos and lets you take stills and zoom in and out while recording videos. A very good low light sensor. Takes great photos and videos!", "Date": "May 12, 2014"}, {"Title": "ok, small", "Author": "katja", "ReviewID": "RCT76HS91477D", "Overall": "4.0", "Content": "it is small, we were missing 16GBmemory card, the description does not say if you get the battery and charger", "Date": "May 11, 2014"}, {"Title": "Great Camera", "Author": "Butler", "ReviewID": "R3MJU4J8PQLCKH", "Overall": "4.0", "Content": "Love the camera, very small and easy to carry. Takes great pictures and is easy to use. Highly recommend this camera and the assortment of accessories that comes with this particular order.", "Date": "April 30, 2014"}, {"Title": "Very Happy", "Author": "George Maris", "ReviewID": "REF6ELQQ1E5IR", "Overall": "4.0", "Content": "This camera does everything that a novice like me wants. I am pleased with this camera.A connection for picture to computer tranfer should have been encluded.", "Date": "April 28, 2014"}, {"Title": "ITS OK BUT HAS TWO PROBLEMS", "Author": "Ann Luecke", "ReviewID": "R394X11VMB39LU", "Overall": "3.0", "Content": "We have owned these before.  There are two problems with these cameras.  (1) They take a long time to focus.  The newer versions are getting better but it is still not to the point of (point and shoot) which is how they are advertised.  (2) The pictures taken with this camera are not editable.  They are read only.  If you take a picture with the camera vertical and want to flip the image, you have to go into properties for each and every image to turn off read only.  I take tons of pictures with the camera and it is a VERY time consuming to manually edit the properties on each image. It frustrates me completely!", "Date": "April 25, 2014"}, {"Title": "love my new camera!", "Author": "Tom Gaige", "ReviewID": "R2EY2M92FJUGA3", "Overall": "5.0", "Content": "I was looking for a small camera to replace my last one with similar features. And this one meets all I wanted, there are some new things to learn but overall I love it!", "Date": "April 21, 2014"}, {"Title": "Pretty Good Camera", "Author": "Raven", "ReviewID": "R2KOX6E5S5G90D", "Overall": "5.0", "Content": "I enjoyed this camera. I had the older version of it, and this was a nice upgrade. Works just as well as my old one. Has a lot of new gadgets on it, too. For example, you can do some editing such as beauty effects, retouch, and more. It even has rapid shot where it takes ten pictures per second. It came with everything that it was supposed to, which included the battery charger. My only complaint  is with the screen protectors. I tried, twice, to put one on, but it didn't seem to be sticky. When I felt it, I noticed that there was a bit of stick to it, but not enough to stay on the camera screen at all.", "Date": "April 17, 2014"}, {"Title": "Excellent", "Author": "Jeff85", "ReviewID": "R1ZNKPFOYG0R2Q", "Overall": "5.0", "Content": "Excellent product, all the supply work well, the perfomance of the camera its perfect, i personally recommend to buy to anyone", "Date": "April 17, 2014"}, {"Title": "A good buy!", "Author": "Lisa H. Laplante \"pinkf\"", "ReviewID": "R19YU945ZY7V60", "Overall": "4.0", "Content": "Nice camera.  Nice extras.  Still learning the operation. I did not like the fact that the program attached to the camera, \"Play Memories\", is out of commission.  Had to find another program to put my pictures into and in order to share my pics.  Sony needs to make a change and stop using \"Play Memories\" as it's picture download program.", "Date": "April 15, 2014"}, {"Title": "Great Product and Bundle Deal", "Author": "CJ S.", "ReviewID": "R37R1V3OBRQD3A", "Overall": "5.0", "Content": "I received all products as described and in great condition which included the charger/sync cable. However, the cable is pretty short so I would purchase a longer cable. Great camera quality for the price when you get it with the bundle. I like that the camera has Wi-Fi which you need to download the app PlayMemories on your smartphone or tablet to be able to use it. You can use your device to control the camera which is especially good with a tripod. The camera itself has lots of picture effects in which I am still exploring and the video quality is nice also with full HD 1080 quality. I know there were some complaints about the battery life but I found that I can also use my cell phone car charger which is great. Otherwise, I would just bring a charger with you if you plan on taking lots of pictures. The camera size is small and lightweight but it does have some weight to it. I did not feel like it was a toy or anything. Therefore, the size of the camera is not a problem for me. Overall, I like the products in the bundle which are all useful especially the camera case and the extra batteries. The camera has great picture and video quality as well as many different options for a budget camera that is under $200.", "Date": "April 13, 2014"}, {"Title": "five star", "Author": "Susi's", "ReviewID": "R1XN0HQE5NK183", "Overall": "5.0", "Content": "excellent camera for my purpose which is photographing jewelry. I would definitelyrecommend this product.So glad I made this purchase", "Date": "April 5, 2014"}, {"Title": "Great Camera", "Author": "Annie46", "ReviewID": "R1PC36QOPWZ3M4", "Overall": "5.0", "Content": "So far it is very easy to use and takes great pictures. I love the size and how easy it is to carry in a pocket. Have not used the video mode so I can not comment on it. I suspect it will be as great as the pictures are.", "Date": "March 31, 2014"}, {"Title": "Sony cyber-shot camera", "Author": "Mary", "ReviewID": "R1HYTS12UPGUG6", "Overall": "5.0", "Content": "I love the camera.  All was received as stated.  Am learning how to use the camera.  The extra battery was a plus.  Thank you for your courteous service.", "Date": "March 4, 2014"}, {"Title": "Great Buy", "Author": "Jesus Silva", "ReviewID": "R21FBRHL581ESP", "Overall": "5.0", "Content": "I was looking a easy to use camera. This bundle package was a great buy. I received everything advertised. My family loves the ease of using this camera.", "Date": "March 1, 2014"}, {"Title": "Love it", "Author": "Ajay", "ReviewID": "ROSEYB8VY8HKR", "Overall": "5.0", "Content": "its really a nice Camera. its work great as the price is very less as other cameras in the market...", "Date": "February 20, 2014"}, {"Title": "Sony Cybershot WX80 Kit...", "Author": "Ms. Hoh", "ReviewID": "R3OXJ5ZETKSP2Q", "Overall": "5.0", "Content": "My mom received this as a Christmas gift this year.  Great kit...camera, couple cases, memory card (16 gb), screen protectors, extra battery, etc.  Who could ask for more???", "Date": "February 15, 2014"}, {"Title": "Hi quality & beautiful pictures.", "Author": "Joe Foss", "ReviewID": "RB4ILVMQD9VW5", "Overall": "5.0", "Content": "Easy to use, long battery life, well made & beautiful pictures. Menu is easy to use, so you do not have to refer to the manual.", "Date": "February 15, 2014"}, {"Title": "Great deal!", "Author": "Sandra K. Watson", "ReviewID": "R1GPVLY9K27WED", "Overall": "5.0", "Content": "This is a great deal.  What more could you ask for - camera, extra battery, case, SD card. Everything you need in one package.", "Date": "February 11, 2014"}, {"Title": "love this model", "Author": "Megan Gerritsen", "ReviewID": "R2AVNIG50BWLPP", "Overall": "5.0", "Content": "We keep ordering this model for our business because we like this little lightweight model with a nice lens and good movie capacity.", "Date": "January 20, 2014"}, {"Title": "Awesome deal and camera", "Author": "UMASANKAR MALLADI", "ReviewID": "R12A7GQPDCNGME", "Overall": "5.0", "Content": "Loved it. its the best. and shoots very nice pics in all light conditions. I am recommending to buy. thanks", "Date": "January 9, 2014"}, {"Title": "Great camera for the money!", "Author": "Joe M", "ReviewID": "RNL8898B57H12", "Overall": "4.0", "Content": "No real complaints on this camera.  Works fantastic and is easy to understand.  The only negative I can come up with is the feel of the zoom button.  It seems a bit flimsy, but has not given me any issues in 6 months of use.", "Date": "January 4, 2014"}, {"Title": "Awesome Camera!", "Author": "D. Wertz", "ReviewID": "RBJHE544GQGTL", "Overall": "5.0", "Content": "I bought this camera for my husband for Christmas.  I had read the reviews online and it seemed to be a good camera.  It has met and exceeded our expectations so far.  Our favorite feature is the 8X zoom.  We haven't processed our photos yet, but I trust they will be great.  I would recommend this camera.", "Date": "January 3, 2014"}, {"Title": "Excellent buy!", "Author": "mary roll", "ReviewID": "R3BKNK3QZIIPUY", "Overall": "5.0", "Content": "Received on the date predicted and in substantial packaging.  All items listed were in the package. The camera works great!  It's a great little camera and takes pictures as good as my more expensive Sony.  I've two other Sony cameras that I love and chose this one for my grandson.  We were not disappointed!", "Date": "January 3, 2014"}, {"Title": "wide screen", "Author": "easthut", "ReviewID": "R2FTJ53KEIE6AD", "Overall": "5.0", "Content": "panorama screen selections are something surprisingly lovable. although 360 degrees are not working, 180 degree panorama angle is just great. grid line selection is also one of my favorites. silicone case i bought separately is recommended because this small camera is very slippery.", "Date": "December 16, 2013"}, {"Title": "Sony Cyber-shot", "Author": "Daniel Linn", "ReviewID": "RKEPIQCH74Z1H", "Overall": "5.0", "Content": "My new camera got here. Its a really nice. Take great pictures. Got the package really quick and ok. Thanks", "Date": "December 12, 2013"}, {"Title": "Great little camera!", "Author": "blah2012", "ReviewID": "R3ACI6P8V9PDAE", "Overall": "5.0", "Content": "I love this camera! It takes excellent indoor shots and it has so many extra features that I'm still figuring them all out. I cook a lot and have a food blog and there is a \"food\" option in the scene section, one of the many reasons I chose this camera. It has smart focus which works wonderfully.There are a couple things I\"m not thrilled with on this camera.1. The plug in port for the cord on the camera is crap and is asking to break. It barely goes in and you have to shove it in which is going to make the port inside the camera loose. I've seen this with crappy cell phone ports.2. I also find the wifi loading feature for pictures to be VERY slow. We have excellent internet and everything else we have wirelessly works great but the camera takes far too long to send pics wirelessly, it's easier to plug it in and send them. I also think the cord is far too short, no case (we got the one without a case).3. Not charging while plugged in to the computer USB port. I loved this with our old camera, now it states that this camera does charge while plugged in but I have not seen that happen. It is always dead when I plug it in over night and even when it's not in sleep mode it doesn't seem to be charging. Maybe i\"m not doing something right but anything I have ever used that plugged in for charging was simple. Plug it in and the light came on and it charged. This is not doing that.Overall it's a pretty good camera. It takes great pics and the color is amazing! I am very happy with it. I will deal with the few things I didn't like since they aren't really part of what I want the camera for.", "Date": "December 11, 2013"}, {"Title": "great little camera", "Author": "rachel", "ReviewID": "RHGRTJS7AZ711", "Overall": "5.0", "Content": "great little camera package has a ton of features and is easy to use you just have to play around with it a little.Well worth the price because its 139.99 just for the camera elsewhere and this package comes with a hard camera case and SD card.", "Date": "December 9, 2013"}, {"Title": "Birthday Gift", "Author": "harleygirl", "ReviewID": "R1UCD58AK2X54I", "Overall": "5.0", "Content": "Purchased this as a Birthday Gift for my granddaughter. This is a great camera and to be able to buy this as a bundle with all the extras was a great deal", "Date": "December 6, 2013"}, {"Title": "Great camera for vacations!", "Author": "G. Martin", "ReviewID": "R26TCPBAU0TH4B", "Overall": "5.0", "Content": "This is the most convenient, easy-to-use camera of this type that we've ever had. The wireless connectivity is the best.", "Date": "December 1, 2013"}, {"Title": "Great point and shoot for concerts!", "Author": "a2Sa", "ReviewID": "R1AEGNA9X04BOX", "Overall": "5.0", "Content": "Oh yes! This thing rocks! I bought it for the sole purpose of taking to big concerts and not having to lug some big equipment in (cos I wanna dance dance dance!). Works wonders. Check out some of my live Depeche Mode videos (2013) using this camera at youtube.com/attosaGreat for when you don't have really fabulous seats at a big show. Picks up sound perfectly without muffling the F out of it. Yummy!", "Date": "November 19, 2013"}, {"Title": "Love my camera", "Author": "Edwin Dimate", "ReviewID": "R2W6F8IVRA5LM4", "Overall": "5.0", "Content": "i have been very very pleased with  my camera. its been a couple of months and the camera is amazing. it takes great pictures and love the ease of wifi to get my pictures easier", "Date": "November 18, 2013"}, {"Title": "BIRTHDAY PRESENT", "Author": "Linda Grink", "ReviewID": "R2HKHDN8AZA51S", "Overall": "5.0", "Content": "I GAVE THIS CAMERA TO MY HUSBAND FOR HIS BIRTHDAY.  HE LOVES IT. THE PICTURES ARE VERY CLEAR AND THE CAMERA IS EASY TO USE.", "Date": "October 24, 2013"}, {"Title": "A Great Camera at a Great Price!", "Author": "Mary Martin", "ReviewID": "R3P1YIBXTNNGHO", "Overall": "5.0", "Content": "The clarity on the pictures is amazing!  Beautiful color - and I like that I can take several shots in a row without waiting! I have also had fun with the movie feature. I have tried a few wide angle shots as well, but will be working on those to perfect them!", "Date": "October 21, 2013"}, {"Title": "Exactly as promised", "Author": "T. Peppel", "ReviewID": "R193GH04YUCS6U", "Overall": "5.0", "Content": "We left the charger for our camera in a hotel while on vacation, and needed a new one (obviously). This bundle was delivered promptly and worked perfectly. The only thing was that the car charger didn't seem to fit anything. It could be us - we're not on the cutting edge of technology!", "Date": "September 28, 2013"}, {"Title": "Pleasantly Surprised!", "Author": "N. Bradway \"Trifektor Labs\"", "ReviewID": "R26T5VG59AZ3SX", "Overall": "5.0", "Content": "I researched the top point and shoot cameras for 2013 since I travel and needed something portable, decent quality, and wouldn't be upset if it broke somewhere along the way.  I've had a few point and shoot over the years - Pentax, Canon, Kodak, etc... - and this one is definitely my favorite so far for this application.  The lens clarity, physical size and minimal weight make this camera a great investment.The camera menu was pretty straight forward and like that it uses a standard microUSB cable to charge and not a proprietary cable and/or power adapter for the battery (which I loose easily).  One issue is that it totes only a digital display and not a range finder but that is something that's on my \"nice to have but not a huge deal\" list.As for performance, my only issue is that if you zoom the photo to it's full amplification, it pixelates slightly.  Other than that, it can capture fair images in dim or low light situations.  The rapid picture function is also a bonus.  I'm still getting the hang of the WX80/B in the field, but this particular package is a great deal and the camera is awesome.", "Date": "September 23, 2013"}, {"Title": "Nice compact camera", "Author": "Lee Michael Gervais", "ReviewID": "RMN3DU0788LAE", "Overall": "4.0", "Content": "I bought this camera to replace an earlier model Sony that was ruined when I slipped and fell into a lake. This camera takes great pictures, has a wide variety of shooting modes, and is more compact allowing for easy transport in one's pocket. The only drawback I've noted is that the battery doesn't last as long as the one in my previous camera. Luckily, the extra battery that came with this camera comes in handy. All in all, a this camera is a good value.", "Date": "September 18, 2013"}, {"Title": "amazing camera", "Author": "Paul", "ReviewID": "R3Q8D4XMCFEY2K", "Overall": "5.0", "Content": "I had a Sony DSC W 110 before , and I wanted something portable and with clear images and with latest technologies, WiFi, 3D,...I m so excited to share my first pictures.", "Date": "September 4, 2013"}, {"Title": "excellent", "Author": "Amazon Customer", "ReviewID": "R3GR05XA0OIVFN", "Overall": "5.0", "Content": "Great camera, takes beautiful pics, and i love it. The wifi feature is cool when your in wifi, but if your not then you can't use it obviously.  But everything else is nice!", "Date": "August 9, 2013"}, {"Title": "camera for a gift", "Author": "lusterlogs \"bailey\"", "ReviewID": "RPX9TLZWCMEME", "Overall": "5.0", "Content": "This camera was bought as a gift for someone else, not me. I was told they loved it. Thank you.", "Date": "January 2, 2014"}, {"Title": "Very satisfied.", "Author": "prodigaltwo", "ReviewID": "R2RMC0V0NPIZOR", "Overall": "4.0", "Content": "Seems to be a great camera - will know more after learning to operate everything.  Definitely a \"best bang for the buck\".", "Date": "December 29, 2013"}, {"Title": "Good camera", "Author": "Robert M. Wood", "ReviewID": "R34A4NITATX11Z", "Overall": "5.0", "Content": "The camera is easy to use.  The image stabilization system is exceptionally good.  It is a bit difficult to make fine adjustments in the zoom setting. I like this camera.", "Date": "October 4, 2013"}, {"Title": "Sony WX80 Camera", "Author": "James Kerry", "ReviewID": "RABWF8GFXJOJD", "Overall": "5.0", "Content": "Great camera package, case, extra battery, 16MB SD memory card, lens cleaning kit. Small light weight and easy to keep in pocketWorks with both Sony and SD memory cards.Superb HD video capability.Zoom lens is super for high resolution photos.Takes photos in very low light situations (don't need flash except for rear light objects)Takes excellent point and shoot photos in high resolution....", "Date": "September 15, 2013"}, {"Title": "I am very sad as i had really high hopes...", "Author": "Gwendolyn Bernardo", "ReviewID": "R2I8UBKN69ILU0", "Overall": "2.0", "Content": "Everything about this camera seemed like it should work. And it did...until I tried to attach it to the computer via the USB cable. Now before anyone thinks I tried to put it into the HDMI, I did not. The tail piece would go about half way into the camera's 'multi' slot and then stop. It was weird...I could charge the camera but I could not get it to download the pictures. :(I am sad. Also, I am a little shocked at how small and light it is. It feels like a toy.", "Date": "April 7, 2014"}, {"Title": "Faulty camera", "Author": "John Lorenzo", "ReviewID": "R2GIAGY26JIVZ6", "Overall": "2.0", "Content": "The camera was ok until I tried to transfer photos from camera to computer.  The connecting cable stayed stuck in the camera and could not be removed?", "Date": "February 13, 2014"}, {"Title": "Inexpensive - And the Poor Quality to Match", "Author": "Mid-Century Todd", "ReviewID": "R1PJZFAAZ5VF2S", "Overall": "2.0", "Content": "While this camera may be a good deal, I was highly disappointed in the quality of pictures. I wanted it for the 2013 LA Auto Show. There are lots of bright lights at the show that make taking pictures difficult. Unfortunately, many of my pictures were blurred, when they looked okay on the small screen. My 3 year old Canon PowerShot takes better pictures and I found the Canon's software easier to use (and it's not exactly intuitive). I'm going to give the camera to my niece and keep searching for a slim, easy-to-use, fast point-and-shoot with clear, unblurred pictures. Don't get sucked in by the low price and decent reviews like I did.", "Date": "November 26, 2013"}, {"Title": "Disappointed purchase", "Author": "Gwidt", "ReviewID": "R1LEWSAEFIY93M", "Overall": "3.0", "Content": "It is the same camera w currently have just with a difference of higher megapixels and a higher wide angle zoom lens.  It was supposed to have WIFI and touch screen which both were deciding factors in me picking this camera instead of a Nicon or Canon.", "Date": "November 16, 2013"}, {"Title": "OK", "Author": "Richard Workman", "ReviewID": "RLPJ31FCXDCKU", "Overall": "3.0", "Content": "I bought this camera to replace stolen w560.  W560 performed much better and the smaller size of the WX80 is no asset.", "Date": "October 3, 2013"}, {"Title": "my thoughts.", "Author": "terry pokuta", "ReviewID": "R1P1WAAEM8SCYO", "Overall": "3.0", "Content": "I need my grandson to operate the camera,it is more computerized than my old kodaks, its not for seniors not computer literate.", "Date": "August 27, 2013"}, {"Title": "Smaller than the average bear", "Author": "Gizmo's Wife", "ReviewID": "R3OVRYD9KGINSL", "Overall": "3.0", "Content": "I bought this as a gift for my husband for his birthday.  Unfortunately, it didn't last long (due to guest clumsiness, not camera quality) so I can't say anything about it's longevity.  I CAN tell you that this a small camera--really small.  My husband couldn't even use it without his hand blocking the flash, so keep the end user in mind when you buy this--many people may find it too small.", "Date": "October 21, 2013"}, {"Title": "Sony web site and instructions", "Author": "karen ruppert", "ReviewID": "R27X0RION71HL0", "Overall": "2.0", "Content": "Camera works great for whatever I can figure out on my own.  Required website setup is poor, poor, poor.  Registering dumped me back to the beginning and lost all my input several times. Can't get the website to complete installation, therefore no wireless download.  I ended up using my old Fuji download system to get my pictures out.Instruction book just lists features, no instructions on how to use.  In camera help screens are no better for help.", "Date": "January 4, 2014"}, {"Title": "poor wifi", "Author": "L. D. Auerbach", "ReviewID": "R3MBMI23O6T1KU", "Overall": "2.0", "Content": "Camera is not user friendly for wifi, too complicated and too many steps to upload pictures to Facebook. All the wifi does is connect to another computer which can easily be done corded.", "Date": "September 14, 2013"}], "ProductInfo": {"Price": "$223.00", "Features": "Case Design May Vary\n16.2MP images with stunning low-light performance\nWi-Fi sharing to upload photos and videos\nFull HD 1080/60i with dual record of stills and movies\nOptical Image stabilization with 2-way active mode for smoother videos", "Name": "Sony Cyber-shot DSC-WX80/B 16MP Compact Zoom Digital Camera in Black + Sony 16GB SDHC + Sony Case + Replacement NP-BN1 Battery + Accessory Kit", "ImgURL": "http://ecx.images-amazon.com/images/I/51fF9B772-L._SY300_.jpg", "ProductID": "B00BIR2GO2"}}