{"Reviews": [{"Title": "Awesome", "Author": "Phillip  Hartling", "ReviewID": "R1DU1KELQJBZQ4", "Overall": "5.0", "Content": "We used it hard in the Philippines. Worked well and no problems at all.  A great camera for the price.", "Date": "May 5, 2013"}, {"Title": "Performs Well Underwater", "Author": "SGS", "ReviewID": "RRG65861RW7BH", "Overall": "4.0", "Content": "We took the camera snorkeling in Hawaii.  It took great photos.  It is easy to use and no water entered the camera.  It is really sealed up well.  The only shortcoming I see, is that the screen was hard to see underwater - so you were really pointing in a general area and shooting.", "Date": "March 27, 2013"}, {"Title": "Great camera!", "Author": "Maureen", "ReviewID": "R115SPH3475NY3", "Overall": "4.0", "Content": "After researching MANY waterproof digital cameras, I finally went with this one and was not disappointed.  I bought this camera to use not only for snorkeling and underwater adventures, but also just to take pictures at the beach and in the pool.  It works really well - a huge improvement from the disposable underwater cameras that I used to buy for vacations. I used it for a week straight in the Cayman Islands and did not experience any issues at all. The underwater pictures were very bright and clear for the most part. I even used it to capture some pictures of a sunset and the colors in the sky came out beautifully. I read some reviews where people complained that it did not take good pictures at night.  I did not use this camera at night so I cannot comment on this, however I would not let that deter you since the purpose of this camera is mainly for underwater daytime use. To keep this camera working properly, I took the advice of other reviewers and made sure I rinsed the camera off in fresh water after being in the ocean or pool every day.  It's also important to keep sand away from the camera to avoid any jams in the trigger.", "Date": "December 12, 2013"}, {"Title": "A great camera!!!!", "Author": "Tammy H.", "ReviewID": "RE5ZCEHYAQFLJ", "Overall": "5.0", "Content": "I purchased this for my six year old grand daughter for her birthday...... She loves it and so do I.... Well worth the money..... Easy to use and great pictures....", "Date": "August 9, 2013"}, {"Title": "Great for the little photographer!", "Author": "Kathleen Mc", "ReviewID": "R1KZANFZI9ICZ4", "Overall": "4.0", "Content": "This camera was a reward for my six year old's great behavior. It is amazing. Easy to use, works well under water. The picture quality is great. It is the perfect transition camera from a toy camera to an adult camera. My daughter enjoyed putting cartoon frames around her pictures. I recommend it to any parent who is looking for a camera for their photographer in training.", "Date": "October 25, 2013"}, {"Title": "perfect camera for the money!", "Author": "Jessica", "ReviewID": "RUZJ5A3VWL971", "Overall": "5.0", "Content": "After reading and reviewing a million cameras, I decided on this one for an upcoming trip to Europe. I was very skeptical, as I knew once I purchased one and took it on the trip there was no turning back. We had some sea-side escapes planned and I wanted to be able to bring a waterproof camera into the water while we were swimming and snorkeling. This was exactly what I was looking for. I'm sure the calm, crystal blue Aegean Sea may have been a factor in how well the underwater pictures turned out, but these came out better than some other camera reviewer's photos taken in a pool! We didn't take many night-time shots, so I can't comment on that, but day time, underwater, and pics while the camera was wet came out crystal clear. Would definitely recommend this camera to anyone. Side note: in 3 weeks' time I only had to charge the camera once.", "Date": "September 6, 2013"}, {"Title": "best camera", "Author": "AmberWillier", "ReviewID": "R1N56JSLLC3S1M", "Overall": "5.0", "Content": "this under water camera was so great.. I bought it to go snorkeling first time ever and take under water pictures... it worked soooo awesome.. Great pictures on land and in the ocean.....", "Date": "January 18, 2014"}, {"Title": "Awesome for me", "Author": "Neetu", "ReviewID": "RNNRY7VLUXG6Q", "Overall": "5.0", "Content": "Bought it for our underwater excursions, and it is very good for the price. good pics under water for a layman, not photographer.", "Date": "November 15, 2013"}, {"Title": "Good camera for the price", "Author": "Lee", "ReviewID": "R27K0YNS77YAUX", "Overall": "5.0", "Content": "Exactly what I wanted and am very well satisfied with the camera and price paid is with in my price range", "Date": "November 14, 2013"}, {"Title": "If you live near water or have a pool, buy it!", "Author": "Russ", "ReviewID": "R1KA9EEBO9VXM2", "Overall": "5.0", "Content": "We bought this camera for the summer because we happen to have a season pass to a water park in Orlando. This thing takes great pictures and perfect for any water activity.This product is highly recommended!", "Date": "September 5, 2013"}, {"Title": "Nikon Coolpix", "Author": "David M Munn", "ReviewID": "R1NBZ5OKRESU7V", "Overall": "5.0", "Content": "I like the waterproof housing and it's ease of use. The display is a bit hard to see in bright sunlight.", "Date": "May 24, 2013"}, {"Title": "Good Kids Camera", "Author": "D. KNUDSON \"dk\"", "ReviewID": "R8OKSEALQRSPX", "Overall": "4.0", "Content": "I wanted to get my daughter something along the lines of a real camera, and this did the trick.  It's easy for her to turn on and and use.Biggest plus is that it doesn't have any exposed lens parts that can be damaged when dropped.  This is a big deal, as I let my daughter use an old Cannon 700is and it became unusable after 1 drop.  She has dropped this one 8 to 10 times with no ill effects.I did give minus 1 star for image quality and slow shutter speed. This really could be better, but really younger kids are not going to care.", "Date": "October 18, 2013"}, {"Title": "not so waterproof", "Author": "Debra L. Heitz", "ReviewID": "REIXLLB0H7U55", "Overall": "1.0", "Content": "I bought it for my daughter and her family for Christmas, we just go to use it at a pool party and it got water in it and screen is haywire when its comes on.  Of course I ordered it to long ago to return here so hoping Nikon will do something about it.", "Date": "March 9, 2014"}, {"Title": "great under water and above water camera", "Author": "flygrl", "ReviewID": "R2E96S39S65V1Y", "Overall": "5.0", "Content": "Great under water camera, just make sure after taking pictures under water that you wipe the water off the front lens so that your above water pictures do not get a blur spot in the middle of the picture. I learned this the hard way!", "Date": "December 16, 2013"}, {"Title": "Great for my daughter", "Author": "JodiWilliam", "ReviewID": "R3E2PC0QKD0WO2", "Overall": "5.0", "Content": "I bought this for my 8 year old.  She loves it.  It is easy to use and takes very nice photos.  No complaints.", "Date": "November 13, 2013"}, {"Title": "Good Point-and-shoot", "Author": "CasualReader", "ReviewID": "R37PPPMSRMY5GT", "Overall": "5.0", "Content": "Simple to use, durable - just what a rough-use point-and-shoot should be! Controls easily pushed for people with big hands or gloves on.", "Date": "November 9, 2013"}, {"Title": "its a camara for children", "Author": "Sandra Lojek", "ReviewID": "R1UEF1C93ROPPO", "Overall": "2.0", "Content": "doesn't have ant settings for real pictures or settings, I was very disappointed, I would not recommend this product to anyone.", "Date": "April 3, 2014"}, {"Title": "unhappy gamma", "Author": "Patsy Susan Monahan", "ReviewID": "R2B67TAB60BCFM", "Overall": "1.0", "Content": "the camera came with everything but a power cord to the battery charger. this was a birthday gift for my 4 year old grandson and he was very disappointed that he could not use it. Called amazon this week before leaving colorado and they sent e-mail to adorama who shipped camera. they sent me an e-mail saying i should contact the manufacturer and gave me telephone number.  called Nikon and they would do nothing since they did not ship the order.  Then called adorama and the lady said she could not guarantee that they could ship a power cord.  I then called Amazon who was most helpful in getting adorama on a 3 way call.  Amazon was not at fault, adorama its going to take care of problem and Nikon was the most unhelpful in customer service. Hopefully this will be resolved soon and make a 4 yr. old boy very happy.  Gamma is not happy with Nikon.  Can't actually rate camera since we can't charge the battery.", "Date": "March 20, 2014"}, {"Title": "Great Camera", "Author": "Johnna Serydynski", "ReviewID": "R1GSYOQMSX8E2A", "Overall": "5.0", "Content": "I bought this camera last minute before I left for my cruise, so I would be able to take underwater pictures when snorkeling. I currently have a Nikon D5200 for higher quality pictures, but was not willing to risk it getting wet and destroyed, so quickly looked for a relatively inexpensive camera with underwater capabilities. I could not be happier with this camera! For one, I am in love with the color, and secondly the quality of the pictures was more than I expected. By the end of the trip I had my family wanting to buy one for themselves, and a few strangers stopped me to ask about it as well. I highly recommend this product to anyone looking for a fairly inexpensive, but great quality camera.", "Date": "February 26, 2014"}, {"Title": "Nice Pics for the price", "Author": "ACLopez", "ReviewID": "R26RSQZXVZMO0K", "Overall": "5.0", "Content": "Very Happy with camera takes good pictures in and out of Water. NOTE: when in and out of water wipe lens off so dont get water spots on picture.", "Date": "February 24, 2014"}, {"Title": "Great for Camera Newbies", "Author": "1izzy", "ReviewID": "R2FISH6TUG2WW1", "Overall": "5.0", "Content": "I bought this camera as a gift for my photography curious 6-year old grandson. He was able to quickly figure out the basic functions and is having a blast taking loads of fun and creative pictures and making short videos. In the month or so he's had it, the camera has suffered from a few drops and general kid-handling, but it is performing beautiful nonetheless. I compared several cameras before selecting this one and would make the same choice again.", "Date": "January 23, 2014"}, {"Title": "Great for my 8-year-old daughter", "Author": "Neurasthenic \"neurasthenic\"", "ReviewID": "R2ASHCUAETV44Q", "Overall": "5.0", "Content": "My daughter wanted a camera. \"A real one,\" she specified. I wasn't about to get her a film camera, and I wanted something small and tough that took decent pictures. After months of research, this was the winner.It took her only a couple of days before she had gotten the hang of taking good pictures (even using a tripod when warranted), and she has since moved on to the camera's fancier features — animated slideshows, special effects like \"mirrored\" images, and the like. I would never have selected the camera for these abilities, but she loves them all.The camera isn't perfect; it's impossible to create a slideshow except by showing all the pictures taken on a particular date. Some functions are oddly greyed-out and can't be selected. Others can be selected but don't do anything (the faux-tilt-shift in particular). But the camera is in all other respects so excellent that I'm giving it five stars.", "Date": "January 22, 2014"}, {"Title": "Great for a kid too!", "Author": "llnc", "ReviewID": "R346KOMLUHDFA7", "Overall": "5.0", "Content": "I gave this camera to my 8 year-old nephew.  He LOVES it.  It took him about a nanno second to figure out how to use it and within the first day he knew all the features.  We were on vacation together and it was ALWAYS in his hands. He showed me his pictures and they are remarkably good quality.  Waterproof was handy because we were in the snow frequently.  The gold rim around the lens looks pretty cool with the yellow he told me and I have to agree.PS Don't forget to purchase a sim card (as I did).  Fortunately we had a spare among our party.", "Date": "January 21, 2014"}, {"Title": "Great camera", "Author": "Bill", "ReviewID": "RKA0LGBIWQOPW", "Overall": "5.0", "Content": "Great camera, especially considering the price. We bought it for our vacation which included snorkeling. The camera performed as expected for stills and video.", "Date": "November 13, 2013"}, {"Title": "pretty nice device", "Author": "screamingloach", "ReviewID": "R2AEWDEG3EZN2O", "Overall": "4.0", "Content": "Definitley  Nikon quality.. pictures and  video are great  quality .. super  easy to use ! definitely a  camera for all ages  but meets  my expectations  as  an adult .", "Date": "November 1, 2013"}, {"Title": "great camera, great price", "Author": "Steve O \"STEVE\"", "ReviewID": "R31DB2AVU0K241", "Overall": "4.0", "Content": "Great under water camera. Great underwater video and pictures. We did notice the more light the better the underwater photos/videos looked, the less light the pics were of course darker and a  little grainy. Took to Hawaii on snorkel and snub a and it did just fine. Overall great camera, great price, would buy again.", "Date": "October 26, 2013"}, {"Title": "Awesome with daylight", "Author": "Ramona Lopez", "ReviewID": "RMYPWTKV3CDMZ", "Overall": "3.0", "Content": "Waterproofing survived the ocean, ziplining, and a rainy run through the jungle. Camera had problems focusing at night resulting in lots of bad blurry, out of focus night pics.", "Date": "September 10, 2013"}, {"Title": "Surprisingly good.", "Author": "Shoppin' Dad", "ReviewID": "R2BMF13SCFXYA5", "Overall": "4.0", "Content": "Bought this on sale really for my 4 year-old to dunk and drop -- and she did both -- but it also pulled double duty when I was snorkeling. I'd brought a better camera with an underwater housing, but after seeing the passably good photos this Nikon could produce, it became the go-to \"camera you take\" to the beach. I wouldn't blow these pics up for posters, but they're great for sharing via email and the web -- good, bright images, for the money a great camera.", "Date": "February 2, 2014"}, {"Title": "Solid Camera for it's Intended purpose", "Author": "T. Smalls", "ReviewID": "RV90OEQ3IOZA9", "Overall": "4.0", "Content": "This is a pretty good camera, if you're using it primarily for underwater photography.  I wouldn't use this camera as my primary walkabout, but underwater it gets the job done.  Because it is watertight, there are no exposed ports, meaning that you have to take the battery out to change the memory card.  This doesn't seem like a big deal, but it can get annoying.For the most part the camera takes solid pictures and it's work the money.", "Date": "January 30, 2014"}, {"Title": "warning re case shown as \"frequently bought with\"", "Author": "EWH", "ReviewID": "R1RDK783X2OIEE", "Overall": "4.0", "Content": "Nikon COOLPIX S31 10.1 MP Waterproof Digital Camera with 720p HD Video (Yellow)  Be aware that on the page with this camera it shows the \"HDE  Case for Nikon Coolpix Digital Camera\" as \"frequently bought with\".  This case DOES NOT fit the camera.  Amazon should remove the case as frequently bought with and suggest some cases that do fit.  The Camera itself works as advertised.", "Date": "October 23, 2013"}, {"Title": "Great under water camera!", "Author": "Linz17", "ReviewID": "R10ASTCOD3JO1O", "Overall": "4.0", "Content": "Used this camera on a vacation. Worked great in salt water (be sure to rinse after using though) and it worked awesome in the pool! The zoom in general on this camera is just ok, I wish it were more clear. But really glad I bought this camera!", "Date": "July 19, 2013"}, {"Title": "OK camera for the price", "Author": "Richard Brasington", "ReviewID": "R8X510UBEXWL1", "Overall": "4.0", "Content": "Not a great small digital camera, but adequate and VERY AFFORDABLE for a waterproof unit. It is my \"fishing camera\"", "Date": "July 18, 2013"}, {"Title": "Fabulous", "Author": "JSL", "ReviewID": "R3U3XR9RHNTCFY", "Overall": "5.0", "Content": "Fabulous It was exactly what i thought it would be and I am very pleased with the choice I made.", "Date": "June 30, 2013"}, {"Title": "Image quailty is only so-so", "Author": "Arion", "ReviewID": "R3I6L9YWCQD3UM", "Overall": "3.0", "Content": "For a Nikon, the picture quality is disappointing. It certainly looks like much earlier generation CCD sensor, with smeared colors, and produces blurry images in anything other than outdoors daytime light.", "Date": "June 30, 2013"}, {"Title": "Disappointing Quality of Pictures", "Author": "M. Lamp", "ReviewID": "RV9AQYYPTEBEK", "Overall": "2.0", "Content": "I dropped a previous camera in the lake and the rice trick didn't save it, so I thought, I really need a camera that I can drop in a lake. Or on a sidewalk. I had picked out a Panasonic, but Amazon sent me a message that this one was on sale. I read the reviews that the pictures aren't superb underwater, but since I was hoping NOT to take it underwater, no problem there.Well, all of my indoor pictures are blurry or fuzzy or just not good. Some of the outdoor pictures come out pretty well. It is not a camera I want to use to capture everyday memories. It's kind of...a dud. I'm sorry I bought it. I have no plans to go snorkeling any time soon, and I like to like my picture, if you know what I mean, which I don't when I use this camera.Another down side of this camera is that there is nothing to protect the lens. I mean, it has an outer part (probably what makes all my pictures blurry is this outer glass layer), but there is no way to close it, so it gets dirty very easily.I guess I just need an easier to use point-and-click and to NOT go into lakes with it. That is my new game plan, and I'm back to my other camera (coincidentally also a Nikon Coolpix, but not waterproof -- takes great pictures but has a funky problem where it randomly turns off while I'm trying to use it).I'll save this camera for the kids to use. They take blurry pictures anyway, so it will make no difference to them.", "Date": "August 5, 2013"}, {"Title": "I usually love Nikon", "Author": "Lynn", "ReviewID": "R1P26XGH4ADWJO", "Overall": "1.0", "Content": "We are going to Mexico and wanted to \"upgrade\" from our Kodak Playsport Z3. This is not an upgrade! Shutter speed is super slow, both pictures & video are grainy, it's also awkward to hold underwater. It's not user friendly as far as choosing settings, reviewing pics, and it takes time to get where you want to be. I love Nikon, but this is not the usual Nikon quality.", "Date": "June 12, 2013"}, {"Title": "Great camera!", "Author": "Kattie1095", "ReviewID": "R2SXPO7SF09LCH", "Overall": "5.0", "Content": "At first I was worried that this camera wouldn't meet my expectations. I tried it out recently on my trip to NYC. I love it! It's a great camera! I was sooo happy with it. Having underwater capabilities is great too.", "Date": "April 1, 2013"}, {"Title": "Did what I wanted it to and needed it for", "Author": "Madoc Pope \"Avid reader and alternate history...", "ReviewID": "R1Q7QONC4Y51N4", "Overall": "4.0", "Content": "I just did a Grand Canyon rafting trip and bought this camera for its being waterproof and less expensive than my regular DSLR.  The images it produced were quite crisp and captured what I was looking for while down on the water.  The camer's being water proof gave me the peace of mind for using it down amongst the spray and possible dunking.  I also bought a wrist floatation strap just in case.  The low price of the camera also eased my mind as it wouldn't have been that much of a loss had the thing gone over the side for good.While not a \"disposable\" camera, it's inexpensive nature and rugged construction make it perfect for venues where you don't want to risk your more expensive and full functional camera.  Yet, the pictures it produced were quite crisp and had good depth of color and clarity.I'm glad I have this as an option for when I want to take pictures out in the \"wild.\"", "Date": "August 12, 2013"}, {"Title": "Nlkon coolpix waterproff camera", "Author": "Alberto Trinidad-Solis", "ReviewID": "R2D8HXS61PG7GL", "Overall": "2.0", "Content": "I ask for a couple of things and everything its ok, but this camera was the one i really wanted but i was surprised that the camera come with a scratch. Its the first time this hapend to me, but i totally dislike!!!!!", "Date": "June 3, 2014"}, {"Title": "Nikon", "Author": "M Fohr", "ReviewID": "RC0RW9GWG0EVQ", "Overall": "1.0", "Content": "It began working okay and then, as the vacation began, it started acting up and not working correctly.  It has been returned to the company.", "Date": "May 27, 2014"}, {"Title": "Great underwater", "Author": "Laci Biehle \"dvd queen\"", "ReviewID": "RJ1WNT1FM5CP4", "Overall": "5.0", "Content": "My wife and I purchased this camera to go on our honeymoon to St. Lucia. We wanted a camera for the underwater aspect. Only snorkeling. Easy to operate. Set it to underwater mode and start clicking. A few blurry pictures because I couldn't stay still for a split second but great pics if you take a second to take the pic.", "Date": "May 27, 2014"}, {"Title": "Good camera, even better seller", "Author": "user6550", "ReviewID": "R38EFMEVJXMFY1", "Overall": "4.0", "Content": "Works well and is truly waterproof. The videos and pics are decent quality.  This seller was amazing.  The camera was exactly as promised and they rushed delivery so that we would receive the camera before we left on vacation,  without an extra charge.  I would highly recommend this seller! I would also recommend buying a floating strap so that if you drop the camera while in the water,  you can easily retrieve it.", "Date": "May 24, 2014"}, {"Title": "Stopped working after first use in water", "Author": "JMLinFL", "ReviewID": "R92LYZU6FMWYZ", "Overall": "2.0", "Content": "The company replaced it- no questions asked- but it was still a major hassle. I haven't had an opportunity to use the replacement, but hopefully I won't have any more problems.", "Date": "May 22, 2014"}, {"Title": "Fabulous", "Author": "Cindy", "ReviewID": "R23Q44DRSRYH9G", "Overall": "5.0", "Content": "Takes great pictures and video.  The fact that it's waterproof and shock proof came in very handy when hiking and snorkeling.  Best vacation camera I've ever had.", "Date": "May 22, 2014"}, {"Title": "I love my waterproof camera!", "Author": "Charles Pooter", "ReviewID": "RPH3SN9QKG6R1", "Overall": "4.0", "Content": "I was really annoyed when I was shopping for a digital camera - it seemed no store actually had a model in stock, even if it was in their catalogue. Frustrated, I finally just went to trusty Amazon.com to order one.The instruction booklet could be better - I was confused when first testing all the features of altering colours, angles, etc, that you couldn't alter mirrored images (I worried that my new camera was already faulty!) Continued trial and error showed the solution - a more detailed instruction pack could have headed off twenty minutes of frustration. The camera did exactly what I needed it to - provided me with pictures when I went to notoriously misty waterfalls, captured shots and videos of gorgeous tropical fish underwater.I had no experience of a faulty battery pack door, and the camera itself is very rugged, resisting blows when underwater currents knock you about in the sea. My one complaint is the picture quality when using the zoom: the camera takes its best shots close to the subject. Pictures of Toucans in the dewy mist are hazy, but not from the moisture!The camera delivers what it sets out to, with silly features like the mirror shots, fish-eye lens and soft focus editing options. The price cannot be beaten. Yes, I'm sure there are much better cameras out there, but they are more than five times the price. If you're not a certified diver or frequent snorkeller, have fun with the S31!", "Date": "May 17, 2014"}, {"Title": "Good camera", "Author": "T. Colacicco \"Tami C.\"", "ReviewID": "R31TTXJPFYKG1J", "Overall": "4.0", "Content": "AS a professional photographer, I bought this for my daughter to introduce her to photography.  So, far she seems to like it.  She has taken in the tub under water and the photos were just as sharp as without water.  It's good for s kid but no real \"zoom\" as it gets distorted (as expected) and lower video qualities kept the lower star rating.  For pro use or very great images ya may want to step it up a notch.", "Date": "May 15, 2014"}, {"Title": "Daughter loves it", "Author": "Alli", "ReviewID": "R11KBAQCGVVEEQ", "Overall": "5.0", "Content": "My daughter loves it, its easy to use, and hasn't had any water leak in yet. It was a Christmas present for my daughter so we haven't really put it to the water test yet, she's just played with it in the sink and tub we'll see what happens this summer and if there is an issue I'll update review.", "Date": "May 15, 2014"}, {"Title": "not good customer service, lens jammed the first time we tried to use it", "Author": "Bonnie Carlson-phillips \"B\"", "ReviewID": "R1R0J7KURXD9GZ", "Overall": "1.0", "Content": "I got it in the US and gave it as a gift to my daughter in India. She can't just go to a shop and mailing the thing back is too difficult and pricey. So when it jammed on the first try (lens reading message just said Lens Jammed or something like that), we contacted Nikon for assistance. Their suggestion didn't work. Now it's a nice lump of plsatic, glass and a little bit of metal and it never took a picture. Piece of junk with no customer service to speak of.", "Date": "May 11, 2014"}, {"Title": "Poor camera especially for the price.", "Author": "Lauren Hunter Bratt", "ReviewID": "R2G02KVCPR5X82", "Overall": "1.0", "Content": "This camera takes blurry pictures, I am not happy with it all!  I have owned many cameras and bought this one for my 8 year old son mostly because of the waterproof feature.  I am very disappointed and would have returned it but he ripped the box apart when he was opening it for his birthday.", "Date": "May 11, 2014"}, {"Title": "Quite a delay", "Author": "TheMommy", "ReviewID": "R3911SD3D2J03F", "Overall": "3.0", "Content": "There is quite a delay between pushing the \"shutter button\" and the camera taking the picture.  This results in the need to take 4 or 5 pics and asking your subjects to \"hold still, three more seconds...etc.\" Kind of irritating.  On the other hand, the video is good, very clear.", "Date": "May 6, 2014"}, {"Title": "We have problems with this item and your company response was awfull. I still don't have received a solution!!!!!!", "Author": "Olga Martinez", "ReviewID": "R3SDFPHYJHYKT1", "Overall": "1.0", "Content": "I disliked because it didn't work as expected as a matter of fact it does not work at all and your response to this have been the worse I ever experience", "Date": "May 4, 2014"}, {"Title": "Good camera for the price", "Author": "Nannette Dorr", "ReviewID": "R1F7CPUV951UNW", "Overall": "3.0", "Content": "Works great during the day and in the water but not so great at night battery life is decent too well worth the money", "Date": "April 29, 2014"}, {"Title": "First time under water and it died.", "Author": "vishnu r", "ReviewID": "RB45UN1VYDQET", "Overall": "1.0", "Content": "Took it on vacation and used it underwater in the swimming pool, water got into the lens and battery compartment while being used.Then it stopped working. display window started getting dull and then stopped working altogether. apparently the water seal is not properly made. I bought the Coleman hd water proof video camera and this works perfectly in the pool and on the beaches.", "Date": "April 19, 2014"}, {"Title": "Easy use", "Author": "HRM \"Traveller\"", "ReviewID": "RXC1FWQSX0N7Y", "Overall": "4.0", "Content": "I have not taken many pictures with it, yet. Particularly not under water. So I can't say anything about the quality of that. Nor whether it is really waterproof.Otherwise I like the easy big buttons. There are lots of fancy things to go into, if you want. But for being on the river or lake in a boat and not wanting to fiddle around too much, for that it seems very good.", "Date": "April 17, 2014"}, {"Title": "got for my 8 year old", "Author": "Stacie Campbell", "ReviewID": "R2L4VNTFT5LPFE", "Overall": "4.0", "Content": "I read this was a great camera for a younger photographer.  My older daughter has a more expensive Coolpix and she learned things from her younger sister after she started using this new camera, and she was a little jealous of this camera.  My only wish would be that it would not have a rechargeable battery.  I do think some of its fun functions....such as making photo albums seem to take a lot of memory.  We haven't tried it underwater yet.", "Date": "April 15, 2014"}, {"Title": "Waterproof point and shoot", "Author": "Matt", "ReviewID": "R3F97KGD1J4XCJ", "Overall": "5.0", "Content": "This camera works great, I used it in the ocean on a small dive up to 20' deep without any problems. The video clarity is good if you have good lighting. Pictures are very clear in bright light, pictures and video gets grainy in low light conditions. Overall it did what I needed it to do which is take video under water.", "Date": "April 10, 2014"}, {"Title": "great for the money", "Author": "Chiefs Fan", "ReviewID": "R24EU4N3ASQHVE", "Overall": "4.0", "Content": "Bought this camera for a trip to Mexico. Worked well under water while snorkeling. It does take a little longer to adjust itself while zooming in and out. Also the flash is kinda slow while taking pics at night. For less than a $100 I'm not complaining.", "Date": "April 7, 2014"}, {"Title": "Worth every dollar", "Author": "K. Montoya", "ReviewID": "R15LV79Y98SBB2", "Overall": "4.0", "Content": "Got is as a gift for my GF who wanted a waterproof camera, and it's a very decent camera takes nice underwater pics and videos,Only thing I wish is that it had more effects to add o more customizable options, but for the price it's an excellent camera, +++", "Date": "March 27, 2014"}, {"Title": "I liked it. Underwater video is amazing.", "Author": "Khai", "ReviewID": "R3CP9Y3GB3BFS9", "Overall": "5.0", "Content": "Camera worked fine. I sort of broke the latch button that opens to the SD and battery, but it remained closed when I went into the ocean. The quality isn't too good for above water (so i would just take photos above water with my iphone) but the underwater camera is amazing, especially the videos. Worth what I paid.", "Date": "March 5, 2014"}, {"Title": "Great little camera", "Author": "Sandra", "ReviewID": "R1110KRK0L9FOK", "Overall": "5.0", "Content": "I purchased to use on an upcoming cruise. Was looking for something that was water proof and this fit the bill! It's easy to use & kid friendly. Haven't tried it under water yet. I plan to pass it off to my six year old after our cruise. It has cuteFeatures that a kid would love.", "Date": "February 26, 2014"}, {"Title": "Great camera.", "Author": "Meli_B", "ReviewID": "R2D7HLNMQEGB04", "Overall": "5.0", "Content": "Bought this camera for our eight year old.  It has brought her hours of fun, and creativity. Haven't played with the waterproof features yet, but she looks forward to taking this to the pool this summer.  She really loves the graphics for making videos.", "Date": "February 16, 2014"}, {"Title": "Works great underwater! Easy to use", "Author": "ekk1288", "ReviewID": "R2ER3E6Z14BVLV", "Overall": "5.0", "Content": "My girlfriend and I bought this for when we went on a cruise. Pretty decent quality pictures for a \"cheapish\" camera. It worked great under water!", "Date": "February 13, 2014"}, {"Title": "coolpix", "Author": "quiltergirl", "ReviewID": "R3AOHCG33WMT9P", "Overall": "5.0", "Content": "this took great pictures underwater.  Glad we purchased this for our snorkeling and cave tubing adventures.  Great deal for the price", "Date": "February 2, 2014"}, {"Title": "It's okay", "Author": "Paulie", "ReviewID": "R3SB6OBHQ6PW43", "Overall": "3.0", "Content": "It's not like any of the Nikons that I have had before. But then again, I;ve never had a waterproof Nikon before. Got it to have on the boat because I didn't want to ruin my better cameras. Picture quality is ok once you figure it all out, but not what you would expect from a Nikon.", "Date": "January 27, 2014"}, {"Title": "wonderful", "Author": "Margaret Kocher", "ReviewID": "R2JUCQCBBT5VI1", "Overall": "5.0", "Content": "The kids and adults are loving it.  It is very easy to use. We  have not tried to drop it but are looking forward to underwater pictures/", "Date": "January 20, 2014"}, {"Title": "WOW!", "Author": "steven nonnemacher", "ReviewID": "R1DPBF13GKWJFU", "Overall": "5.0", "Content": "This camera is the best! Its pictures are great quality, the videos can go in slow mo, and its waterproof! Here are the few problems, it is pretty large not a pocket camera, its not worth the price only because the white COOLPIX camera has the same qualities and is only $70.00 but if you like the color pink BYE THIS CAMERA! BEST CAMERA EVER!!!!!! Definitely recommended.", "Date": "January 20, 2014"}, {"Title": "Love it!", "Author": "Rebecca Jensen", "ReviewID": "R29F470BBQBHIP", "Overall": "5.0", "Content": "It's everything I was looking for in a Camera for my husband...he really likes it!We both like it for the fact when he takes it hunting, fishing or any out side activity, it will hold up to water & or accidently dropping it.We highly recommend it to all those who like & enjoy the outdoors and love to take pictures! and we love the color!!!", "Date": "January 20, 2014"}, {"Title": "Terrific for 7 year old", "Author": "vapeanut", "ReviewID": "R1T2TR04IPMSYJ", "Overall": "5.0", "Content": "My daughter wanted a 'real' camera (she was tired of the poor picture quality of the little kid cameras), so I got her this. It took some really terrific images on a hiking trip (much better than my Canon or Sony at image stability). She even stuck it underwater and it still works fine. Great gift for someone who might damage a 'good' camera. Picture quality is good, waterproofing is good, and it is still inexpensive enough to give to a child who *might* lose it. I will be buying one for each of my kids.", "Date": "January 16, 2014"}, {"Title": "Nikon Coolpix S31", "Author": "Judith M.", "ReviewID": "R385XQPF1R0IHN", "Overall": "5.0", "Content": "Gift for my son.  He travels a lot and does some diving.  This camera is easy to use for pictures and recording under water.", "Date": "January 16, 2014"}, {"Title": "Great for kids!", "Author": "FabianIB", "ReviewID": "RRE2R22DJ08X0", "Overall": "4.0", "Content": "I gave this camera to my 4 years old baby girl, she use it just fine! and takes pictures and videos easily, I would say she love it, but there are things that I really don't like, being a kids camera:- The focus isn't really good, the kid needs to have an steady hand to doesn't get blur pics.- The shutter speed is somewhat slow, I'm not sure if this is because some setting that I can change, but I feel this too slow.", "Date": "January 13, 2014"}, {"Title": "Great for Kids!", "Author": "FirefightersWife", "ReviewID": "RI20WSZQIEZRX", "Overall": "5.0", "Content": "We bought this for our son who turned three a couple days after Christmas.  I hesitated buying a real camera for him being so young, but he loves taking pictures.  I was pleased to find a camera that won't go down if it takes a swim or gets dropped.  He's only dropped it once and it just scraped a little of the paint off.  It doesn't take the best pictures in low light, a little disappointing considering it's a Nikon.  I wasn't expecting it to be amazing but, I'm a huge fan of their DSLR cameras and I expected a bit more quality from them.", "Date": "January 2, 2014"}, {"Title": "Great little camera", "Author": "kathy goodson", "ReviewID": "RJ9X979MC8AYY", "Overall": "5.0", "Content": "Just what I wanted for my grand daighter's first real camera. Great item and easy to use even for a 5 year old.", "Date": "December 30, 2013"}, {"Title": "bought for 6 yo boy and it was a hit!", "Author": "Taryn", "ReviewID": "R2R1FRTBO7319A", "Overall": "5.0", "Content": "My son got this for Christmas and he is having a blast.  very easy to operate and fun features to use.  We haven't taken it underwater or printed any pictures but the price is perfect for a young child who loves to take pictures.", "Date": "December 29, 2013"}, {"Title": "BLURRY!", "Author": "Cassandra S. Kiel", "ReviewID": "R2JVP8Y6PLN1HT", "Overall": "2.0", "Content": "All the pictures were blurry.  I thought this had image stabilization, but maybe not.  I'm returning.  Got this for my 7 yr old.  Thought maybe she was moving.  My husband and I tried it, both staying very still.  Pictures were not good. Only plus was it was easy for her to figure out, and that it was a fun color.", "Date": "December 28, 2013"}, {"Title": "Perfect for young kid", "Author": "Amazon Addict", "ReviewID": "RB6EWFW5CU3MC", "Overall": "5.0", "Content": "I bought this for my daughter on her 5th birthday.  She had a toy camera that she liked but took really poor quality photos,  and she enjoyed using our cameras or phones to take photos.  So she seemed ready for a better camera of her own, but it needed to be something she could really be allowed to use independently without worry of damage.  I chose this camera because it is durable and waterproof, which are essential for little kid use.  The controls and displays are simple, intuitive, and easy for her to learn and remember.  The photos are good, and she is so very proud to show everyone that she has a *real* camera.", "Date": "December 26, 2013"}, {"Title": "CoolPix Camara", "Author": "ChihuahuaMadre", "ReviewID": "R2589NMNHM02ZR", "Overall": "5.0", "Content": "Made a wonderful Christmas gift. Worked great and was easy to use. Would definitely purchase another one.Amazon never disappoints me! Great service.", "Date": "December 26, 2013"}, {"Title": "Excellent Waterproof Digital Camera.", "Author": "L.B.", "ReviewID": "R3S85NMEJF5PNU", "Overall": "5.0", "Content": "This waterproof Coolpix S31 Camera is super!Has a SD slot for extra memory.Take very nice pictures and HD Video easy to operate.It's a Nikon, so it is built solid.Great price, you will not go wrong buying this camera!", "Date": "December 19, 2013"}, {"Title": "Solid Camera", "Author": "Chris Pawlicki", "ReviewID": "R29JWGLCOL98UY", "Overall": "5.0", "Content": "I had this camera about 5 months now and it is great for simple pictures in the water or other places you would worry about having a regular camera. The cam is kind of slow, but for the price, its a pretty good buy. Not the best for regular use, just more of the outdoors stuff.", "Date": "December 18, 2013"}, {"Title": "amazing camera", "Author": "Rfael Velez", "ReviewID": "R1277TM1B46SRG", "Overall": "5.0", "Content": "The best buy ever... great pictures and video underwaterFun in the surface and underwater, easy to operate and clean, fantastic....", "Date": "December 4, 2013"}, {"Title": "Excellent camera for the money", "Author": "John", "ReviewID": "R2HTFP2ZJ9I7QR", "Overall": "5.0", "Content": "Took this camera on a trip to bermuda. It was in the water every day and took some excellent underwater shots. Also used it in town and did a fine job out of the water as well. Highly recommended.Do yourself a favor and buy a floating strap for it if you plan to use it in any kind of depth (like the ocean!), wish i had one, during my trip, had to be overly careful during a couple snorkeling dives. Extra peace of mind is well worth the minimal added cost.Cheers", "Date": "November 24, 2013"}, {"Title": "PURE AWESOMENESS!!!", "Author": "rosemary caldwell", "ReviewID": "R19GMPDUGGRJ7", "Overall": "5.0", "Content": "It takes great picsIt is really easy to useit is really cheapIt is great for kids ( im a kid also)It is light and fits in small hands wellECT, ECT,ECT,ECT,ECT", "Date": "November 22, 2013"}, {"Title": "coolppix s31, great underwater camera", "Author": "Paul Benko", "ReviewID": "RFBJOE71Q3RSA", "Overall": "5.0", "Content": "buying it for our trip to French Polynesia was a very smart decision. It made it so much enjoyable. We used it mostly for our snorkeling activity but land photos are as good as with our Cannon.Photos are of a great quality, clear and sharp.The only challenge is to aim it at the target, can't use the the screen( takes practice)It also floats, very helpful.We didn't have one single problem with the camera.Great product.", "Date": "October 26, 2013"}, {"Title": "gift", "Author": "danielle", "ReviewID": "R24KMDDIIBIGWV", "Overall": "5.0", "Content": "This was a perfect gift for my boyfriend, he loved it! the pics turn out great I would like to buy more of these for gifts and myself.", "Date": "October 25, 2013"}, {"Title": "Very good camera", "Author": "Armando Ortega \"Gralo\"", "ReviewID": "RO26EN7GLSUWL", "Overall": "5.0", "Content": "Its a really good camera, I bought one for me and other for a present. These are running very well.", "Date": "October 21, 2013"}, {"Title": "love this product!", "Author": "Mary Lester", "ReviewID": "R29Q3DP33W08B", "Overall": "5.0", "Content": "awesome camera, the camera works great. The lens is fully protected from everything. I really do not like the color brown I will pick a different color next time", "Date": "October 21, 2013"}, {"Title": "Very good product", "Author": "andrea", "ReviewID": "R2Z7QIGN0KUTOS", "Overall": "4.0", "Content": "Very good product to go to the beach.I use it for gping to the beacjand pool and it works fantastic", "Date": "October 20, 2013"}, {"Title": "Awesome", "Author": "yesenia ruiz", "ReviewID": "R23NF57C1D6Q09", "Overall": "4.0", "Content": "This camera was GREAT! Wonderful price and got everything I wanted out of it. I give it 4 put of 5 stars. The only complain I have is that if you are shooting a video or pic underwater you can't see the screen. Other than that it was exactly what I was looking for.", "Date": "September 20, 2013"}, {"Title": "Great bargain-rugged, waterproof camera.", "Author": "TGP", "ReviewID": "R18JJDWKE0LS5Z", "Overall": "5.0", "Content": "I took a chance on this bargain, based on past positive experience with Nikon products, and this DID NOT disappoint. Great results on a very rainy day in the Amazon RAIN forest[dropped in the mud-AOK], and good results underwater as we snorkeled in the Galapagos! Rugged test with good results on all counts; our last underwater adventure was with an expensive Nikon in an expensive case, with moderate results. I must say that this little inexpensive marvel produce just about as good video, and not bad photo's[for those that have taken underwater photo/video, you know what I mean!] You cannot go wrong for $100 or so! And I can use it again!", "Date": "September 16, 2013"}, {"Title": "Not bad ,Not good", "Author": "Ahmet", "ReviewID": "R6JHUCTYQBAVE", "Overall": "3.0", "Content": "I was expecting from Nikon better picture quality .Still if you compare price and quality its normal..I saw once GoPro picture quality I wish I ordered that one.its very slow on shutter speed and focusing.Sometimes it takes good picture sometimes not.", "Date": "September 11, 2013"}, {"Title": "Its an OK camera. Mildly impressive.", "Author": "Bella", "ReviewID": "RQBQXELWR4QI4", "Overall": "3.0", "Content": "So the picture quality isnt bad, but it isnt that great, even with flash theres still a good amount of noise and blur to the photos. The flash setting is unstable, if you have it on autoflash, then it only really flashes like 40% of the time when you want it to, and even in semi-dim situations it sometimes doesnt trigger and go off and its frustrating. I end up having to put it on flash all the time because the auto-flash is unreliable and more than half the time doesnt detect when its really needed. The recording is alright but not great either, the sound is good though. Its a very very simple and boring camera, since its meant to be waterproof and sealed, i guess they decided to forgo any detailed buttons, or options on camera operation. It takes some getting used to, because theres not a whole lot you can do with the camera. For the purpose of taking pictures in wet or water area, its good, and doesnt give me problems, but its not my go to camera AT ALL for anything that doesnt have to do with water. This camera will most likely sit in a drawer until I need it for water purposes. As for the body of the camera, its sealed pretty well, but the area where the battery and sd card go, the cover seems flimsy and not really sealed, i worry that if its submerged in water, the sd card and battery could be damaged, i havent submerged it yet, but this is just my observation. I have a warranty for water damage, since i bought the 2 year one, so its covered, but it would be inconvenient if this did happen, thats all. So yea, thats my opinion. For regular pictures i use my 5D mark 2, or my pos Sony camera.", "Date": "September 7, 2013"}, {"Title": "purchased for my grandson", "Author": "Emily", "ReviewID": "R2XL9HQH82I6HS", "Overall": "4.0", "Content": "I bought this as a gift for my 6 year old grandson and it has been very successful and thoroughly enjoyed. It is easy to operate and and the strong case makes it a easy to handle for young hands.", "Date": "September 3, 2013"}, {"Title": "You get what you pay for", "Author": "Moses Alcala", "ReviewID": "R11M04DOSLCUHW", "Overall": "2.0", "Content": "I bought this based on good reviews by others. I was disappointed. For $109  I could have bought a better camera.Pros: the promise of waterproof and shockproof (although I never tested it), long-lasting battery, ability to take a series of pics, simple to use.Cons: no night-photography capability, distorted left and right edges,  cannot focus, cannot focus, cannot focus, cannot focus (you get the point). What good are blurred photos?", "Date": "September 2, 2013"}, {"Title": "everything i wanted", "Author": "Camino Troya", "ReviewID": "R2BRX8DWRGBYE7", "Overall": "5.0", "Content": "got for a trip to mexico and worked great. non water and under water shots were great! easy to use and great battery life.", "Date": "September 1, 2013"}, {"Title": "The best", "Author": "Frank", "ReviewID": "R2YBXUK03MRIIA", "Overall": "5.0", "Content": "Ive dropped it, Surfed 10 ft waves with it in my pocket etc. Takes great pics and vids. what a deal!", "Date": "June 19, 2013"}, {"Title": "Very basic camera, very poor quality images.", "Author": "Steve Z \"Steve\"", "ReviewID": "R32E8LW969NLDS", "Overall": "1.0", "Content": "Bought this camera to use at the beach and for underwater shots.First, this is a VERY basic camera, No way to set ANYTHING. Can't set ISO, speed, aperture, or white balance... everything is automatic. The only setting seems to be \"Photo Size\" (Large, Medium, Small). Other than that, you have \"Styles\" (close-up, underwater, etc.)... that's about it.I took some test shots around the house. There was enough light so flash was not necessary. All of the images shot without flash were grainy, most were out of focus.Moved outdoors into the bright sun and things were just as bad. Viewed at 1:1 in Adobe Lightroom showed just how bad this camera was. Even at ISO 80 there was noise. While the center of the image was in focus, all of my images were very blurry toward the edges of each shot. Chromatic aberration was very visible. And, the JPEG algorithm this thing uses is just downright bad. JPEG artifacts were very noticeable at 1:1.I don't know whether I got a defective camera or what, but this camera is worse than my cell phone camera.I'm sending it back.", "Date": "June 1, 2013"}, {"Title": "Amature at best", "Author": "ZotScott", "ReviewID": "R3ROPRD8E27UO", "Overall": "1.0", "Content": "I purchased this camera as a cheap waterproof camera that I wouldn't be too sad if I lost, dropped off a cliff, or it was stolen while on vacation. I had relatively low hopes about the feature set of the camera and figured at 10MP it would take decent, albeit not perfect pictures.I'm returning it after day one.The interface is horribly cheap, with very very little options. Could be good for kids, or for grandma. It appears to be designed by the makers of Windows 3.1. The \"scene\" options had little in the way of useful choices, I would have expected a low light or indoor setting, but none was to be found. There is, however, a fireworks setting for some reason.I was hoping that the pictures would be reasonably clear despite the simply interface, I wasn't even hoping for perfect. They were terrible for 10MP. They were fuzzy and grainy at the same time, even under decent lighting conditions and a clean lens. I don't really understand how they could be that bad. At first I thought maybe just the display on the camera was making the pictures appear to be of poor quality, but after loading them on my computer they were just as terrible.This camera is not deserving of the Nikon name.", "Date": "August 14, 2013"}, {"Title": "Neat for kids or maybe water use, pic quality poor", "Author": "John Carpenter", "ReviewID": "R41BVN6774FG0", "Overall": "3.0", "Content": "I just bought this camera for my son's birthday and decided to take some pics with it before I gave it to him.  I took a couple of dimly lit indoor photos and wasn't too impressed, but thought outdoor photos might be better.  With a recent hailstorm, I decided to take 50-60 pictures of damage in bright outside light to see if the photo quality was better.  As I view the pics on the PC, I notice they are grainy and slightly out of focus.  Even thought this is a newer 10 megapixel camera, I know my 10+ year old Kodak 4 megapixel camera would take much high quality photos.The good?  The menus are easy to navigate, it runs on a rechargeable Li-Ion battery, and it's waterproof (not tested).  It's fairly attractive with a good size screen, too.Overall, I'd say this might be a good (not great) beach & vacation camera or for a kid to use (it has easy menus and appears durable with a shockproof rating).  My 13 year old son might just love it, but he has an iPhone 5 that takes decent photo & video, so I'm not sure the pic quality will be what he wants.", "Date": "May 18, 2013"}, {"Title": "A nice camera, take good photos", "Author": "GeoSports", "ReviewID": "R1XHWJKI3YY82W", "Overall": "4.0", "Content": "We bought this as a gift for our 12 year-old daughter. She took to it quickly and has taken some nice photos in the short time she's owned it.  We'll really find out how tough it is when we vacation at the beach in June and July!  But so far, so good.", "Date": "May 13, 2013"}, {"Title": "disappointed", "Author": "Belinda Eichelberg", "ReviewID": "R2G5HKIRD7KFFA", "Overall": "3.0", "Content": "I was only able to use this for a two seperate occasions then the capture button stopped working.  Luckily, it was near the end of the trip when it went out. I didn't expect it to be a top of line camera with pristine photo quality (which it doesn't have) but I am very disappointed the button went out at all and so fast. I haven't even owned it 3 weeks. So back to the store it goes!It is quick to turn on and easy to record, start and stop videos. Viewing photos is not very user friendly. I often would hit the back arrow instead of going through the menu and have to start all over. That was frustrating. When you're underwater, plan on pointing and shooting and hoping for the best. There's no seeing the screen underwater.Pictures at night are grainy and not worth keeping.If you can avoid any mechanical issues, it's a decent camera for the price. Less than $100. Definitely get the insurance ($16) just in case.", "Date": "July 13, 2013"}, {"Title": "Not fancy, but got the job done....", "Author": "Katie Roscher Wilson", "ReviewID": "R2V89CKKWXVOGE", "Overall": "4.0", "Content": "I bought this for a trip to Cancun.  It worked wonderfully for the snorkeling pictures, but was also a solid camera out of the water.  Its not fancy, but the picture quality was good and it was easy to use.", "Date": "June 28, 2013"}, {"Title": "Bad pictures", "Author": "gannon", "ReviewID": "R2PUE6DG4QORBU", "Overall": "1.0", "Content": "Very blurry photos, auto sucks, very disappointed. I like Nikon but this is a flopper. Do not buy this camera.", "Date": "January 2, 2014"}, {"Title": "Big Mistake?!!!", "Author": "Julie", "ReviewID": "R1GF7XT599FEDJ", "Overall": "1.0", "Content": "Ordered this camera for a vacation and it came with Euro 240 volt charger cord?! Now what am I going to do?!", "Date": "March 11, 2014"}, {"Title": "Good Value", "Author": "Gregory S-S", "ReviewID": "R3UXUKPSK3VTW0", "Overall": "4.0", "Content": "It is what it is. An inexpensive point and shoot that can take some level of abuse. Haven't done any outdoors activity with it as yet but pictures are great in daylight and average with low light. That said it will work for what I intend to use it for i.e. hiking, ocean kayaking and other outdoor activity. Will update accordingly.", "Date": "January 28, 2014"}, {"Title": "Good camera good price", "Author": "Melanie", "ReviewID": "R484I4QPLVASX", "Overall": "4.0", "Content": "Took this camera on a cruise.  Took it in the water a lot.  Hard to view what you trying to capture so you had to point and click.  Pictures came out nice though.  Pictures clear, and not grainy.  I would recommend this camera.  For the price you can capture good underwater pictures, and capture great memories.", "Date": "December 1, 2013"}, {"Title": "Shutter button issues", "Author": "krsmith", "ReviewID": "R3H5EP1ABTX3HQ", "Overall": "3.0", "Content": "I purchased this camera to take to the beach, and it held up well in the water, but after about 10 pictures, the shutter button stopped working. I could push it, but not all the way down. When I got home, I planned on returning the item, but asked my boyfriend to take a look and see if he could do anything. I guess some sand had gotten into the button area, and he was able to clean that and get it working. It works fine now and I decided not to return it, but I will definitely be more careful with it in the future. He also found a little bit of sand inside the battery/SIM card compartment, but it did not hurt anything. I would recommend this for casual vacation photos, and I had no issues with the water, but keep it out of the sand.", "Date": "September 23, 2013"}, {"Title": "Good Buy", "Author": "mariabahamas", "ReviewID": "R1FIR5V5C5KICP", "Overall": "3.0", "Content": "I'd rate this camera a 3.5. I got this camera for a vacation to Cabo San Lucas, Mexico knowing I'd be snorkeling and hanging out at the beach and poolside the majority of the time. I wanted something light weight, compact, but rugged enough to handle extreme temps and rough handling. I didnt want to spend a lot and knew I was taking a chance with a cheap camera and poor pictures...this little camera surprisingly met my needs. I was surprised of the quality of pictures I was able to take. Most pix taken during the day, underwater shots and pictures of food day or evening were pretty good. I'm still figuring out the quality of photos at night. If you're up close with good focus, the pix seem to be fine; otherwise, if there is some distance the pictures turn out a bit grainy when taken with minimal light. The camera functions/options are easy enough, but still trying to figure out the best function for night photos. Overall, this was a descent purchase and a very simple camera to use. Glad I made the purchase.", "Date": "September 10, 2013"}, {"Title": "So pleased with this camera!", "Author": "Debbie Huben", "ReviewID": "R3IUDU94PW2LH5", "Overall": "5.0", "Content": "Love this camera, so easy to use. Takes great pictures, highly recommended for someone who doesn't want to deal with complicated instructions.", "Date": "August 21, 2013"}, {"Title": "over all not bad, but sub standard for a NICON", "Author": "Amazon Customer", "ReviewID": "R1OKQ3SBQMV4IL", "Overall": "3.0", "Content": "I purchased this for a younger child, its pretty tuff and waterproof, however the thing is SLOW.I find the child gets frustrated at the shutter time.Pro:SolidFairly easy to uselots of featuresCon:SLOW shutter speedPIC quality is only OK, not greatFor a NICON I expected more.", "Date": "August 21, 2013"}, {"Title": "Nice addition to the beach bag", "Author": "Art Powell", "ReviewID": "R1WVHZD615D061", "Overall": "5.0", "Content": "It has been in the rain and splashed by the waves. Works as supposed to. No diruptions or need to stop photo taking.", "Date": "June 21, 2013"}, {"Title": "Perfect camera for children and adults who don't read instruction manuals", "Author": "Lawrence R. Risso \"sailor\"", "ReviewID": "R1EMB1ELM4Y2RW", "Overall": "5.0", "Content": "Just the right size to hold with easy to learn and use operating buttons.  Lens protected and zooms behind glass cover. Very friendly slide show feature that children like with music and small cartoon characters that move.  I bought this for my eight year old grand daughter and now the five year old wants one too.  Looking forward to try it underwater.", "Date": "May 19, 2013"}, {"Title": "Worked as it should", "Author": "PZilla", "ReviewID": "R26WUBHK1DYSY0", "Overall": "5.0", "Content": "I took this camera with me on vacation. It takes decent underwater photos (the photos lack some contrast but I'm able to correct this with Photoshop). It didn't leak. One tip would be to make sure you wipe the lens cover before taking photos. I accidentally kept touching the cover with sunscreen oily hands and this caused cloudy pictures.", "Date": "June 6, 2013"}, {"Title": "Takes great pictures and great for in the water", "Author": "rob kramer", "ReviewID": "R34MXNZA30TNIR", "Overall": "5.0", "Content": "This is not a telephoto lens camera, but I have been able to take it to the beach and in the pool and it has taken beautiful pics.  Also it seems very sturdy, uploading has been easy and since I got a 16gig card for it I can snap away.  Don't expect every pic to come out perfect, take many and you'll get some great ones.  Also, get yellow or red and you won't lose it!", "Date": "October 10, 2013"}, {"Title": "better than expected", "Author": "Jan gummelt", "ReviewID": "RCPX6SJB09IAE", "Overall": "5.0", "Content": "coolpix s31 was a gift for my husband to take fishing  (a trip he hasn't taken yet), but when my camera had to go into the shop, we took his to visit grandkids in the mountains - we used every setting just to get ourselves familiar  w/ the  capabilities - quite pleased w/ results - most shortcommings were pilot error - worked great underwater - just wish it had a little more zoom", "Date": "July 9, 2013"}, {"Title": "Great little camera for the price", "Author": "Nancy K. Roberts", "ReviewID": "R11QWRCHQ3Q8OW", "Overall": "4.0", "Content": "Purchased for my nine-year old granddaughter.  Ease of use and understanding was excellent.  Her father who is a professional photographer was very happy with the camera as well.  It has not gone underwater, nor have I seen any photos from this camera but overall hoping for the best.", "Date": "July 3, 2013"}, {"Title": "I'm not too pleased", "Author": "P. Lehman", "ReviewID": "R2U563ZULW9YV9", "Overall": "2.0", "Content": "I bought this camera for an extra carrying camera in my purse. I wanted a waterproof, shockproof camera because I live near the water and take a lot of photos on the beach. I think I ruined my last camera because some sand probably got in it.  Nikon has a good reputation so I purchased it on that and the price. Though I like taking good photos I hold back on putting a lot of money in a camera because the camera is so delicate.  This camera has been a disappointment in clearity of photos and ease of use. I find it inconsistant on quality.  Some closeups come out ok - but for the most part it's a poor point and shoot camera.  I haven't used it that much.  I tried to get photos of my grandson performing at his school, but was unable to get good clarity.  I have had several small point and shoot cameras.  This one is the worst.", "Date": "June 15, 2013"}, {"Title": "Great camera for the price", "Author": "Mrs. Null", "ReviewID": "RHBYQCA5OTF32", "Overall": "5.0", "Content": "Bought this to take on vacation on the beach. I usually use my cell phone for pictures but needed something that would be water proof. The pictures come out great and very happy with this product. I bought the yellow so I could find it when I set it down or in my purse.", "Date": "June 6, 2013"}, {"Title": "Great Camera for the Price", "Author": "Ian Spangler", "ReviewID": "R1GPTAYUM9H159", "Overall": "4.0", "Content": "I would definatly buy this again. Great camera for the price especially if you are going on a vacation that you will be in the water.", "Date": "February 3, 2014"}, {"Title": "Great camera, great price!!", "Author": "Terri Bradbury", "ReviewID": "R168VBWGKTG1J5", "Overall": "5.0", "Content": "My granddaughter loves her new camera!! Excellent camera for the money! Perfect camera for a child or an adult! Great value!", "Date": "January 5, 2014"}, {"Title": "Camera", "Author": "kristine gamache", "ReviewID": "RCLIFDKHDQKM7", "Overall": "5.0", "Content": "So fare I like this camera, I bought it for my daughter for Christmas.  I am taking it on vacation to see if it is a good camera before I give it to her, test it out.", "Date": "October 6, 2013"}, {"Title": "you get what you pay for", "Author": "Cary A. Turner", "ReviewID": "RZT0IISMLRMO0", "Overall": "3.0", "Content": "it doesnt take very good pics but its made for under water and for more closer pics. great for kids to play with.", "Date": "October 4, 2013"}, {"Title": "Waterproof???", "Author": "Ryan Lansing", "ReviewID": "R1I1RJZ7RB8L5O", "Overall": "3.0", "Content": "Not sure what happened, but water seeped in and ruined the camera.My son really loves this camera. Maybe a fluke. Who knows.  Will try again,hopefully it was just a fluke.", "Date": "September 14, 2013"}, {"Title": "A camera for all ages . . .", "Author": "Meredith E. Spear", "ReviewID": "ROHKCZ5XMUXT7", "Overall": "5.0", "Content": "We gave this as a 7th birthday present to my niece.  We decided we should read the very brief and clear instruction guide so we could show her how it worked.  She was thrilled and began taking pictures.  By the next day she had figured out how to make cartoon movies and took some underwater shots in the pool at her party.  Didn't need our help figuring it out . . .  I love that I didn't have to tell her to keep her fingers off the lens -- the design of the front prevents it!!! (Wonderful ergonomics!)Only disappointment is that the camera didn't come with a memory chip.  Fortunately we discovered this before we gave it to her and got an SD chip at Walgreens.Highly recommend it.  Her parents plan to use it too (if she lets them . . .)", "Date": "September 13, 2013"}, {"Title": "Great little camera!", "Author": "sherri noyes", "ReviewID": "R3M20AQ2QUYZFF", "Overall": "5.0", "Content": "I purchased this camera for my four year old daughter who was frustrated with the crappy pictures taken with her kiddie camera.  I wanted a camera that was shockproof in case she dropped it.  The camera is also waterproof although we haven't used it in wet conditions yet.  This camera is EXTREMELY easy to work!  It takes pretty good pictures and she is easily able to take video and use the zoom.  It has some cool in-camera editing features, as well.  (Fish-eye, starburst, color enhancement, borders etc).  The only issue that I have with this camera is that when you do use the zoom, the photos come out quite grainy.  She just uses her feet to get closer!  She loves the camera and I do too!", "Date": "September 4, 2013"}, {"Title": "Every bit as waterproof as they say", "Author": "Amazon Customer \"jvpk\"", "ReviewID": "R1N689GAF6NQMY", "Overall": "4.0", "Content": "My positives:Withstands seawater!Takes good photos.My negatives:Fogs up the lens at various timesEats batteries even when you are not using it!USB doesn't seem to charge it, no 12v charger for travelling", "Date": "August 27, 2013"}, {"Title": "Great Camera!", "Author": "Ryan G", "ReviewID": "R12RIUWASP4V9S", "Overall": "5.0", "Content": "I first started with the S30 and liked it but the camera ate the batteries.  This camera with the rechargable battery, I highly recommend.", "Date": "July 8, 2013"}, {"Title": "Junk", "Author": "Sandra A Sabel", "ReviewID": "R34QR8OQ2IGWKL", "Overall": "1.0", "Content": "I bought thus camera specifically for my carribean vacation of snorkeling. I took 20 pics and it died! No shutter! I'm a diehard canon professional but gave nikon the benefit of the doubt. Never again!!", "Date": "October 26, 2013"}, {"Title": "Outer lens is unprotected.", "Author": "Frank Jay", "ReviewID": "R1OZIDFFI3X3LC", "Overall": "1.0", "Content": "The product description sounded good but when I received the camera the outer \"lens\" is unprotected. Although it is not a true lens, I was concerned it would get scratched at the beach, in my fishing bag, or pocket for that matter. The 'taking' lens is protected but even if the out lens does not actually take photos, scratched on that lens will ultimately affect the photo. The camera was not as well built as I would like and when compared to other brands feels inferior. I cannot comment on photo quality as I did not use it.  I cannot see why a small cap could not have been engineered into this camera.", "Date": "June 6, 2013"}, {"Title": "Great camera for the money.", "Author": "Curt", "ReviewID": "RAA83BWOHQ9J4", "Overall": "5.0", "Content": "For the price this is a great deal. Pictures and video from the camera. Gave to the kids and they love using it at the pool and the beach. Only drawback is I found another similar camera waterproof to 32 feet which would have worked well for shallow diving. For the price and nondiver this works.", "Date": "June 19, 2013"}, {"Title": "Battery", "Author": "Larry Passarini", "ReviewID": "R1SHNJWHBULNZN", "Overall": "3.0", "Content": "It doesn't tell me when the battery is low. The battery level is not displayed on the monitor. Itdoesn't tell me when it needs to be charged.", "Date": "January 24, 2014"}, {"Title": "Okay, not great.", "Author": "Jen J", "ReviewID": "R2TUK3286VBIVO", "Overall": "3.0", "Content": "I bought the camera a few weeks ago so I'd have a camera to use on a vacation where we'd be spending time at the beach and the pool.  It held up fine in the water -- no issues with water leaking -- and the pictures and videos all turned out fine.  You don't get a lot of zoom with the camera, so I used a different camera when we were away from the pool.  Overall, I thought the picture quality was average, but not great.", "Date": "October 26, 2013"}, {"Title": "Waste of money!!!!", "Author": "BJW", "ReviewID": "RNE7V4CTS5UO6", "Overall": "1.0", "Content": "Took it to our 1st family trip to Disney and the picture quality was horrible and I ended up having to use my iPhone. I bought 1 for one of the children and she hated hers too. Total waste of money and I didn't get all the pics we had hoped.", "Date": "November 16, 2013"}, {"Title": "Average at best", "Author": "Dr. Suresh A. Patel", "ReviewID": "R17HR7PU6ADB3U", "Overall": "3.0", "Content": "Poor picture qualityBut not bad for the price and it is adequate for a child's first phone and it's waterproof", "Date": "January 24, 2014"}], "ProductInfo": {"Price": "Unavailable", "Features": "Waterproof and shockproof\nOversized buttons\nsimple operation and a bright 2.7-inch LCD makes taking pictures easy\n720p HD video recording with built-in microphone captures the sights and sounds of the moment in high fidelity", "Name": "Nikon COOLPIX S31 10.1 MP Waterproof Digital Camera with 720p HD Video (Yellow)", "ImgURL": "http://ecx.images-amazon.com/images/I/41W3IdJuQYL._SX300_.jpg", "ProductID": "B00B7N9AY6"}}