{"Reviews": [{"Title": "Everything I wanted in a reasonably priced point and shoot camera!", "Author": "Jaime DeFore", "ReviewID": "R13BBNC0KWF8T7", "Overall": "5.0", "Content": "This camera works great! The picture clarity is awesome! I can crop a picture and it still looks clear! They camera offers MANY different shooting modes and also offers picture effects, which is something I never had with any other camera.It is very slim, lightweight, and well made.It comes with a rechargeable battery and a charger that doubles as a USB cord. It also comes with a digital manual on CD,  a print user guide/manual, and a software CD that allows you to install a picture viewing software called ViewNX 2.The camera came new in the box and arrived promptly with Amazon Prime shipping.All in all I am very pleased!", "Date": "January 2, 2014"}, {"Title": "Small but mighty!", "Author": "Stephen Tucker", "ReviewID": "RD274VZH04IFZ", "Overall": "5.0", "Content": "Nikon has always been the standard for cameras. This little camera does not detract from Nikon's excellent reputation. It has the rechargeable lithium battery, and a slot for a memory card. The memory card i use is 1 GB, so it can store a lot of pictures before needing to upload to my PC.I love the fact I don't need to buy batteries anymore. The last Nikon digital camera took 2 AA batteries, and while I did use Lithium rechargeables, they did not last very long.Great job Nikon, love your products!", "Date": "December 27, 2013"}, {"Title": "Very nice camera", "Author": "Paul H", "ReviewID": "RR0IE0DSZ1CN9", "Overall": "5.0", "Content": "For the cost this camera is excellent.  I could not ask for more for a sub-$100 camera.  Bought it as a gift for my daughter and she loves that it is pink!  I doubt she will ever take it off auto but that is fine with me.", "Date": "December 30, 2013"}, {"Title": "Just right....", "Author": "Roy G.dunn", "ReviewID": "R2LVQTR9FNOIL7", "Overall": "5.0", "Content": "A small, easy to use camera for almost any job you have for it.  Works great and takes great photos and videos...", "Date": "January 10, 2014"}, {"Title": "0 for 2.", "Author": "Robert C. Hines Jr. \"Morobi\"", "ReviewID": "RZ8415HH65P8E", "Overall": "3.0", "Content": "Purchased two of these in recent years.  Knew Nikon to be a top choice among my photographer friends, so replaced an older Nikon digital with a newer model.  Lens pooped out on the second one on the second day of an Italian cruise, and never worked correctly again.  Lady at the camera store told me this was common.  Replaced them both with a Sony, on the recommendation of my wife, who still uses hers from 6 years ago.  My Sony works great.  Gave my old Nikon to Amvets in the box with all of the attachments not even opened.  Hope Nikon can fix whatever needs fixing.", "Date": "January 28, 2014"}, {"Title": "easy to use and pretty", "Author": "maryann cummings", "ReviewID": "R3FFKDUS0RTJ2M", "Overall": "5.0", "Content": "easy little camera for a good price. i bought this for a first time user because of the simplicity of its controls. it is exactly as described.its a great entry level camera for a young teen or older parent.", "Date": "January 19, 2014"}, {"Title": "Super slow.  And blurry pictures", "Author": "Caroline Cyr", "ReviewID": "R35JYXSHPP9TU9", "Overall": "2.0", "Content": "Im not sure if I have some sort of setting wrong, or what, but it seems SUPER slow on processing. I had another Nikon P&S; and it was good, sure slow, but nothing like this one. I push the button sometimes and NOTHING happens. I am thinking of returning it, but I really dont want to since I have bought extras for it.I am hoping maybe someone can help me out ... that its MY fault that the camera is so slow... however, I didnt change anything on the maunfacturers setttings, so I dont think its really my fault.Also, some buttons are in the way when you are holding the camera to take pictures, so I end up hitting buttons while trying to take a picture.", "Date": "April 4, 2014"}, {"Title": "Best camera in this price range!", "Author": "Debbie Sweet", "ReviewID": "R2X1KRZELQX7IT", "Overall": "5.0", "Content": "I did a lot of research and found that I got the most for my money with this camera, especially getting the black one!  I gave it as a gift for my elderly parents, and it was not too complicated for them.  I like it better than my own camera which is a cannon, so I might have to get one for myself soon! Overall I am very happy with this purchase.", "Date": "February 18, 2014"}, {"Title": "Great But", "Author": "Jeff Kendall", "ReviewID": "RGX56JBHTXQQJ", "Overall": "4.0", "Content": "I am a Nikon camera guy only. And I just needed a pocket camera because our last one got dropped at snowflake lane. This is a great little camera for the money. But include at least an 8GB Micro SD card otherwise you'll only be able to snap a 5-10 pics depending on the size you choose in the camera menu.", "Date": "February 15, 2014"}, {"Title": "cool pik", "Author": "roger strege", "ReviewID": "R2FS2YMFMF4B7G", "Overall": "5.0", "Content": "love the camera had one for a number of years but while i was at work my wife said the batteries fell out and the lock to hold them in no longer worked so i got another one", "Date": "January 23, 2014"}, {"Title": "Great point and shoot for the cost", "Author": "Amarpreet Ahluwalia", "ReviewID": "R8KIURWPKO38N", "Overall": "5.0", "Content": "Great camera! Light, compact, and pretty high powered al for a very cheap price! A great buy altogether if you need a good point and shoot but don't want to spend a lot.", "Date": "May 17, 2014"}, {"Title": "My iPhone takes better pictures:(", "Author": "Elizabeth", "ReviewID": "RUNOJWQ12W97H", "Overall": "2.0", "Content": "I read the reviews before buying and thought I was purchasing a good little camera for the money.  It takes terrible pictures.  I am very disappointed.", "Date": "May 16, 2014"}, {"Title": "Awesome camera", "Author": "R. Carroll \"mp3 transmitter\"", "ReviewID": "R2KK2FISX8XXNT", "Overall": "5.0", "Content": "16 mb come on you cant go wrong a nikon takes great pics and video at hd 720.  So small I can walk around with it in the pocket of my jeans. Love it but then again I am a nikon fan.", "Date": "May 9, 2014"}, {"Title": "Great pictures but....", "Author": "Steven McCue", "ReviewID": "R29UBSVKNWDB3L", "Overall": "3.0", "Content": "This camera takes beautiful pictures when enough light is available.  Does not take very good night pictures unless subject is close to the picture taker.  I found it takes nice night time pictures if subject is 10 ft or closer to the camera.  Another thing that I don't like about this camera is that it's slow.  You have to wait a second or two between shots (longer in low light situations).  I thought it might be because of my memory card so I purchased a class 10 memory card and found no difference.", "Date": "April 27, 2014"}, {"Title": "NOT HAPPY", "Author": "J-Rae", "ReviewID": "RYX3HLNQR94GM", "Overall": "1.0", "Content": "The picture is not clear on the screen or when printed.Slow reaction time from the moment I push the button to the camera actually taking the picture at any speed set.Video up close & at a distance not clear in light or dark situations.", "Date": "April 23, 2014"}, {"Title": "Good but not Amazing", "Author": "Amazon Customer", "ReviewID": "R23FMOBHRT2EB0", "Overall": "3.0", "Content": "I like the camera. I am a little disappointed in how long it takes to actually take a picture though. I can push the button and there's a good 2-3 second delay before the photo is actually taken. I probably need to do some more reading of the manual so that I can fix this, but I am not super tech-y so I am hoping I can just fiddle around with it until I get it to snap an instant photo. It's a bummer when I go to take a picture of something my cute stepdaughter is doing and by the time the picture takes, she's already done it.", "Date": "April 11, 2014"}, {"Title": "Fairly Pleased", "Author": "Caitlin", "ReviewID": "R3IH5W2FNVI8GT", "Overall": "4.0", "Content": "I've had a Kodak Easyshare for a long time, but when a family member dropped and broke it, I needed a replacement.I did a lot of looking around, and finally decided to give this Nikon a go. All I wanted was a simple point-and-click, with a little extra zoom than normal cameras have. This has been a pretty good buy for me, overall.There is a lot to like about the camera- it's easy to use, there are a ton of settings, most pictures come out really well, the zoom is fantastic, timing between pictures is fairly quick, battery charges quickly.Now the cons: Without flash, pictures come out extremely blurry. It's disappointing- I can't get those soft, natural pictures I could with my Kodak unless I'm under full, bright sunlight (outside). Even with windows wide open, pictures blur.Another things about this camera is that the button is super sensitive. I'll click it once, gently. But the shutter will sound twice and the pictures never come out properly. Sometimes I'll simply be moving, and the button will somehow get pressed and I get a weird, blurred picture of whatever I happened to be walking past at the moment.The last thing is that the auto-settings aren't always the best. For example, the auto-focus doesn't always focus, and you'll have to sit there and adjust yourself until you get the right focus angle. Sometimes you have to switch the scene selection or the focus won't work at all. The auto-scene somehow manages to go into one mode, and get stuck there (usually close-up). You have to re-select auto in order to have that setting.For the most part, though, I like this camera and I'm happy I bought it. It was worth the money, and it's a good point-and-click that most anyone can use.", "Date": "April 7, 2014"}, {"Title": "Awesome camera at an unbeatable price. I got mine for $89", "Author": "Chris M", "ReviewID": "R3FSR3MN4C44XK", "Overall": "5.0", "Content": "This camera is awesome. Fast and great pictures! I ended up getting mine for $89 and I put the accidental protection on it for an extra $7.. but so far 3 months of great pictures.", "Date": "March 27, 2014"}, {"Title": "USER FRIENDLY GREAT CAMERA FOR THE $$$$ !", "Author": "Lake Erie Princess", "ReviewID": "R2NIQFCRHB7HJO", "Overall": "5.0", "Content": "I really like this camera a lot. I had another, more costly Nikon and always got blurred pics.This camera is quite user friendly, well made, and easy to take along with you. I recommend it if u need a camera.", "Date": "March 24, 2014"}, {"Title": "Very Nice Small Camera", "Author": "Lawrence C. Pierce", "ReviewID": "R30Z1EUC3AUM18", "Overall": "5.0", "Content": "I have been using this for several months and am extremely pleased. I bought it as a snapshot camera I could carry with me in the truck and in a pocket on walks, cross-country skiing & snowshoeing, bicycling, etc. I bought a padded soft case to help protect it in the outdoor activities. I recently took it snowshoeing and got some great pictures. The setup was extremely easy and the manual I downloaded covers its features well. I have not had a chance to check out most of its more advanced features but will over time. The pictures in the basic pick up and shoot mode have been very good, comparable to my digital SLR (also from Nikon). I recommend this.", "Date": "March 7, 2014"}, {"Title": "Great buy for the money.", "Author": "Matthew O'Bryan", "ReviewID": "R3MUO13V6UZIE2", "Overall": "4.0", "Content": "Easy to operate point and shoot camera. Very good quality considering the inexpensive cost. Recommend to anyone that wants an easy to use camera.", "Date": "March 2, 2014"}, {"Title": "Pictures look Blurred", "Author": "Bobbles", "ReviewID": "RVHMSZ5ECQUNY", "Overall": "3.0", "Content": "I love the size of the camera, but when I take the pictures they looked blurred.  At first I thought maybe I was shaking when I took the picture, but it happens with every one.  I even had my daughter try it and the same thing happened.", "Date": "February 28, 2014"}, {"Title": "Good Pocket Camera", "Author": "BigDan", "ReviewID": "RDKPB4ZORBRC6", "Overall": "5.0", "Content": "I am in law enforcement and always have an extra camera with me for taking pictures of evidence, car accidents etc.. This pocket camera is great. All extreme weather is not a problem and the battery life is super long. Pictures are clear and crisp and the focal depth is huge.", "Date": "February 24, 2014"}, {"Title": "Very pleased.", "Author": "Bettye Cheatam \"Indianagirl\"", "ReviewID": "RBUW56YO4HUYD", "Overall": "5.0", "Content": "This camera is very easy to use. The pictures are clear with good detail. Wish I'b bought it sooner to enjoy it sooner.", "Date": "February 23, 2014"}, {"Title": "I love it!", "Author": "fergie", "ReviewID": "R2NPZPED7DXWX4", "Overall": "5.0", "Content": "Its small light and hassle free to carry around. The pictures are clear and the camera is quite easy to use. For persons who are not professionals this is the camera to get.", "Date": "February 23, 2014"}, {"Title": "Perfect for \"snowbirds\"", "Author": "dona f.", "ReviewID": "R292P428M819IG", "Overall": "5.0", "Content": "My husband and I wanted a relatively simple, small camera for our personal use.  As Grandparents we want \"real\" pictures of the little ones and all the kids use are web based, etc. and we don't have the kinds of electronic devices to captue those images as they sail around the Internet.  But now, we can make our own pictures!", "Date": "February 23, 2014"}, {"Title": "Nicon CoolPix", "Author": "D. Jones \"dkjinhou\"", "ReviewID": "RHLH1LMFZPK5O", "Overall": "5.0", "Content": "This has proved to be an outstanding small camera.  Pictures are bright and clear.  I love it.  Recommend it to anyone.", "Date": "February 23, 2014"}, {"Title": "Perfect camera for a beginner", "Author": "Tanya Bowles", "ReviewID": "R2OEQ87VS9ZNQU", "Overall": "5.0", "Content": "I bought this camera for my 9 year old daughter to use. She has already taken and oriented pictures to start scrap booking. Very nice, easy starter camera.", "Date": "February 23, 2014"}, {"Title": "Great Purchase", "Author": "Ken", "ReviewID": "R2UIQSAYVQLMI8", "Overall": "4.0", "Content": "I just wanted a fairly cheap point and shoot for quick pics.  This camera fills my expectations to a tee.  I love the ease of use and the fantastic zoom qualities.  For the money, this Nikon can't be beat!", "Date": "February 21, 2014"}, {"Title": "Lost my camera on New Years Eve...", "Author": "Crusty", "ReviewID": "R1JV4FBSPD5LC0", "Overall": "5.0", "Content": "...and make a point of having one with me nearly every place, so I was almost in a panic to find a good replacement. After some quick research I went with the Nikon S2700 and couldn't be happier. It's feature rich, very compact and takes excellent photos. I don't expect to need the 6X optical zoom often, but it's nice having the capability. I love this camera!", "Date": "February 18, 2014"}, {"Title": "Cool pix camera", "Author": "danbiz", "ReviewID": "R286AQDO7D41ZT", "Overall": "4.0", "Content": "I like the camera.  I like being able to shoot videos with the camera.  I take a lot of pictures.", "Date": "February 18, 2014"}, {"Title": "Super Little Camera.", "Author": "Amazon Customer", "ReviewID": "R3TM2B4YWEKAE", "Overall": "5.0", "Content": "I chose this product because of it's features and the price. It takes fantastic pictures! I take nature photos with it.", "Date": "February 15, 2014"}, {"Title": "Easy to Use", "Author": "Peter McKay", "ReviewID": "R3IUI3BT6ZVCYC", "Overall": "5.0", "Content": "Great little camera.  Really fun and easy to carry,  Very happy with my purchase.  Will always stick with Nikon. Pete", "Date": "February 10, 2014"}, {"Title": "Great pocket camera", "Author": "sharon cryder", "ReviewID": "R2RRIDJG5STQUS", "Overall": "4.0", "Content": "I like the idea that I can just keep it in a pocket and I'm ready for the photo opportunity when it happens.  Only wish I had purchased one with more zoom capacity.  The memory card is a little hard to get out being that the camera is so small. Great extra camera though.", "Date": "February 9, 2014"}, {"Title": "Product Comment", "Author": "MOE001", "ReviewID": "RAVSIKHLBY7HJ", "Overall": "5.0", "Content": "I like the camera. Very courteous and helpful. Good price. Wonderful service.  The product is good, I assume. I did not test it, yet. I wish him the best.", "Date": "February 6, 2014"}, {"Title": "Nice Camera", "Author": "Horsey", "ReviewID": "R3D6O7QSJJA703", "Overall": "5.0", "Content": "this camera is easy to set up and takes nice Pictures , I did not try the Video mode as yet but it should work as everything else on this Camera", "Date": "February 6, 2014"}, {"Title": "Compact, Light weight, Easy to handle", "Author": "Ruth Cook", "ReviewID": "R2M1DI7QDJVDSR", "Overall": "4.0", "Content": "I like my camera very much. It's lightweight allows me to handle the camera more easily. Along with the ease of handling, the video feature is a plus!  It has a longer video feature than my previous camera and the green bar on the screen shows how much video time is available.  Being compact affords me the convenience of putting it in my purse to take with me anywhere and without putting excessive weight for me to carry.  I like the variety of \"scenes\" I can choose from and the \"flash ready\" light.  Although I am an amateur photographer I would like my close ups to focus on my main object and slightly blur the peripheral areas.  Since I have been unable to get this camera to do that, I did not give my rating a 5 star and I couldn't figure out how to give a 4 1/2 star rating.  So - for all the amateurs out there I'd highly recommend this camera as one to enjoy!", "Date": "February 5, 2014"}, {"Title": "very happy", "Author": "danno", "ReviewID": "RXQ7PA6O4VVHQ", "Overall": "4.0", "Content": "Nice camera! Very light and compact.  I have a large expensive digital camera that never seem to be handy when needed  This camera will fit in a shirt pocket.  Takes excellent pitures", "Date": "February 3, 2014"}, {"Title": "Cute and just the right size.", "Author": "Tanya", "ReviewID": "R3ES8OJGW2IVKG", "Overall": "4.0", "Content": "Just what I wanted. Easy to carry takes great pictures. Would recommend if want small camera for every day  use.", "Date": "February 2, 2014"}, {"Title": "Great value for the price", "Author": "Teaching.Rocks", "ReviewID": "R3JQCLHX67CV84", "Overall": "4.0", "Content": "This camera is s great value.  The quality of the photos is good and it had a fantastic battery life.  The small size allows it to be taken anywhere.", "Date": "February 2, 2014"}, {"Title": "Great camera", "Author": "Paula", "ReviewID": "ROJBG1UHDMZE", "Overall": "5.0", "Content": "AWESOME!  I love the size and quality of the camera.  One of my favorite purchases this year.  Will recommended to all!", "Date": "January 31, 2014"}, {"Title": "Luv it!", "Author": "Sophia Lightfoot", "ReviewID": "R2NWKXIUBD0RVI", "Overall": "5.0", "Content": "Bought it with a gift card given to me by my boss for Christmas.  It's great, lightweight.  Takes great pics and video!", "Date": "January 28, 2014"}, {"Title": "Great Camera!!", "Author": "maewest64", "ReviewID": "R2TOJHDAV8PBZD", "Overall": "5.0", "Content": "I love this camera so far, still learning all it's available functions that I have to choose from.  And the color with etching is awesome!", "Date": "January 26, 2014"}, {"Title": "Your phone has a better Camera. Save the money", "Author": "Kevin Cornell", "ReviewID": "R2GJ64W7E96TKD", "Overall": "1.0", "Content": "I was very disappointed. Took it on a trip to DC and didn't want to take a big Camera with me because of all the security checks. I wish I had. I used my I-phone instead because the picture quality was so bad. It couldn't take a good picture after dark or inside. I took it off Auto focus and tried everything. Nothing worked. This Camera is only good outside with no action. Save the money and just use your Phone.", "Date": "February 24, 2014"}, {"Title": "Couldn't Load software", "Author": "callb1", "ReviewID": "R2X0VLLVKU4Z93", "Overall": "2.0", "Content": "I guess it might be a good camera, but the software I got will not work with my new computer.  I checked for updates for the new 8.1 system, but since the camera is an old model, it did not seem to be available.  I am not great with a computer, but I called for help with this, but nothing was found.  It was not an expensive camera, but if it is sold, it should have a system update.", "Date": "February 5, 2014"}, {"Title": "Nikon coolpix  S2700 16MP Digital Camera with 6x Opticl zoom and 720p HD", "Author": "Anne Mel \"Donna\"", "ReviewID": "R2S8UZWNHOCU51", "Overall": "5.0", "Content": "We bought this camera for our grandson, but he already has one. So, I decided to keep this camera. It takes good clear pictures. I have a another camera, but this small NIKON camera can be put in pockets or purses. It's convenient to have a camera on you, because you never know when something catches your eye.", "Date": "January 27, 2014"}], "ProductInfo": {"Price": "$119.95", "Features": "Slim, family-friendly 6x zoom compact with wide-angle 26 mm coverage\n16.0 effective megapixels of pure imaging power\nScene auto selector simply activates the optimal mode\nEXPEED C2 image-processing engine\nHD 720p movie recording", "Name": "Nikon COOLPIX S2700 16 MP Digital Camera with 6x Optical Zoom and 720p HD Video (Decorative Pink)", "ImgURL": "http://ecx.images-amazon.com/images/I/51ot0jC-pPL._SX300_.jpg", "ProductID": "B00BLO80CY"}}