{"Reviews": [{"Title": "Great Little Camera - Know What You're Buying!", "Author": "Coraline Canti", "ReviewID": "R33ILT6AH6IZ52", "Overall": "5.0", "Content": "The Samsung DV50 dual LCD is a great little camera, and saying you can only get the manual by purchasing (as mentioned in another review) it is disingenuous. I purchased this camera KNOWING it only came with the basics: USB cable, 4GB mini memory card + adapter, charger plug, and a quckstart guide. At the time I purchased the camera, the full manual was available FOR FREE directly from the Samsung website in PDF form (it's also available in Spanish).Personally, I don't mind having the full manual only on my computer for reference; I wouldn't have carried it around with me anyway. The camera itself is largely intuitive and very user friendly, so the manual is good to have as a resource for details. I needed a smaller camera than my DSLR for casual use and this one fits the bill nicely. Probably the nicest feature is the video screen available on the front of the camera, making it finally possible to include myself in casual photos without the guesswork. There is also a feature, video and sounds, to catch the attention of children to take their picture; it's very cute!The software to download and access photos from the camera can be installed directly from the camera the first time you attach the USB cable between camera and PC ... it's relatively small and takes only a few minutes to download. It's nice that it was included, but I doubt I will be using it, though it does include a feature to edit movies taken with the camera.All in all, I think this was a good purchase for me and would recommend it to others looking for something easy to use and small enough to slip into a purse or pocket. It doesn't come with a case, but they are available for a reasonable price right here on Amazon (and none of my other cameras have ever come with cases anyway).The quality is good, the functions are easy to use and the screen on the back of the unit is very large for a camera this size; the camera measures 3.5\" wide X 2\" high, and the back screen is 2.5\" X 1.75\" (the one on the front, which you turn only when you want to use it, measures 1.5\" X 1\").All in all, I'm happy with this little camera ... to sum it up, it's got 5X zoom, 16.1MP, and records video in HD; not too shabby! I'd certainly purchase it again!", "Date": "April 15, 2013"}, {"Title": "Samsung DV50 Dualview 16 MP is a cool little camera", "Author": "Magnus808 \"Magnus808\"", "ReviewID": "RCYJUA4AEQQPX", "Overall": "5.0", "Content": "5 stars - I considered price and features, got it on sale for under $100.  I bought this camera to replace my old Sony cybershot 4.1mp camera.  The DV50 is smaller, lighter, higher resolution, and has a front screen for self photos.  the only drawback if you could call it a drawback is that the DV50 is more complex in camera settings, there are many choices on setting your camera and is a little daunting at first.  I had to download the manual from the Samsung website as a manual was not included in the box.  There is a lot to learn, but after you play with it a while and take test shots you will be ready for action.Some tips I can give you when using front screen self photo mode - Use the fill flash, but know that when you power the camera off the flash settings will go back to default when using the front screen to take self photos, the default is No Flash - I like to use the fill flash, the color is more accurate then on the default no flash - you'll see what I mean when you try it - So, in order to not have to keep setting the fill flash, let the camera go into power save mode or sleep, when you are ready to take another picture just tap the shutter button to wake the camera and your ready to shoot with your fill flash setting intact.Also, when taking self photos be sure to change the focus setting to Macro, the camera will adjust the flash down so it will not wash you out.  When going back to shoot in regular mode be sure to change your focus setting back to normal.Great camera for the money, buy it.  Takes really good HD video as well.  Get a big card.  I got 16gb card plenty of room.Hope this helps.", "Date": "May 28, 2013"}, {"Title": "Great picture quality, many features, outstanding Price", "Author": "Joe Mascola", "ReviewID": "R1YFQ6Z769M9Q7", "Overall": "5.0", "Content": "This camera has it all!  The picture quality (16 megapixels) is excellent.  It has many features and capabilities that you would only expect to find in a much more expensive camera, and all at an exceptionally good price.  The only drawback is that it should have come with a printed manual booklet.  I was able to download a manual from the Samsung website but a printed booklet would have been more convenient.  It only takes a few minutes to learn what you need to know to begin taking basic pictures.  The downloaded manual covers all the features and options, so when you are ready for any of them you only need to look it up.  I would highly recommend this camera to others.", "Date": "June 5, 2013"}, {"Title": "Great Camera Easy to use!!", "Author": "John Avallone", "ReviewID": "R4G1180JO2D4D", "Overall": "5.0", "Content": "Very easy to use; fits right in my shirt pocket. Easy to download pictures to my computer. Very user friendly.Great camera!!", "Date": "November 22, 2013"}, {"Title": "Excellent", "Author": "Jesus Ramos", "ReviewID": "R24CZU4DCFYWA0", "Overall": "5.0", "Content": "This camera has it all is complete the recommend is excellent, it was a good buy for me and would recommend to others looking for something easy to use and small enough to fit in a purse or pocket.", "Date": "September 11, 2013"}, {"Title": "Not worth trying", "Author": "jgg", "ReviewID": "R19II3ALGFARQ2", "Overall": "1.0", "Content": "This camera does not come with full instructions. Samsung will SELL you the instruction book. You can't find anyone to help how to work camera. Ugh", "Date": "April 13, 2013"}], "ProductInfo": {"Price": "$125.15", "Features": "Includes DV50 digital camera, lithium ion battery, 4GB micro SD card, and quick-start guide\n16 megapixels, 1/2.3\" CCD sensor, TTL auto focus\n4.7 to 23.5mm zoom lens, 1.5\" diagonal front screen, 2.7\" diagonal TFT LCD rear screen\nDigital image stabilization, microSD memory card slot, USB port\nPicture modes: self shot, couple shot, children mode, panorama, funny face, and magic frame, Records up to 720p HQ video at 30fps", "Name": "Samsung DV50 Dualview 16 MP 5X Opt Zoom Digital Camera Black 2.7\" LCD Screen", "ImgURL": "http://ecx.images-amazon.com/images/I/41Su8pLad7L._SX300_.jpg", "ProductID": "B00B3Y4F3U"}}