{"Reviews": [{"Title": "Very satisfied so far.", "Author": "Y. Lee \"cylp\"", "ReviewID": "R2D5RVDHEUQHJD", "Overall": "5.0", "Content": "I am very happy on using it.  I mostly use it as a point-and-shoot camera with the Auto mode. The auto focus is fast enough. I had used it to take picture from the window of a running train.  It performed well on the focus and also the shutter speed.  I chose it also because it uses the BSI CMOS sensor, not the FSI CMOS sensor nor the CCR sensor.  It does come out very nice and clear pictures. One more thing that I have to say is the feature of using dry cell batteries.  You do not need to worry about the power source and time to recharge the battery during your trip.  It consumes power very efficiently.  I took more than 300 pictures in 3 trips and still using the first 4 batteries.", "Date": "September 9, 2013"}, {"Title": "Pleasantly surprised!", "Author": "Ron", "ReviewID": "R3R7SGRJLEEX56", "Overall": "5.0", "Content": "Though I never owned a Fuji before, I purchased a Fujifilm FinePix AX560 at Wal-Mart  for $69.00 about a year ago, on the advice of the salesgirl. Wasn't disappointed. So I decided to see what Fuji could do in a higher price range. And because this model is so new, I could not find any reviews, anywhere.Well, here's my review: For the price range, this camera is TERRIFIC !Shot to shot time, is almost instantaneous.Color rendition is almost spot-on.I've taken hundreds of photos, and the re-chargeable batteries I originally inserted, are still going strong.Fine details are captured beautifully.There just seems to be \"life\" to the photos.I tried the 30X  zoom, and the pics. were good, but I can't fault the camera, as I didn't use a tripod and my hands tend to be a little shaky.In fact, I took some photo's at a local farm stand today, and e-mailed a few to my sister. Her reply was,\" I don't know what kind of camera you used, but, WOW.\"I guess that says it all.I only wish I could post some of the photo's here.In my opinion, at this price range, worth every penny!", "Date": "October 14, 2013"}, {"Title": "Great Camera", "Author": "KEEROCK LEE", "ReviewID": "R11E8ETHH0A6OZ", "Overall": "5.0", "Content": "I purchased this camera for my kid's birthday present which I have intended for all the family to use together.This is great camera, of course, zoom 30 x enables you to take any objects in distance without having to carry the heavy telescope lens for dlsi camera. Also this have various functionality like shutter when smiling, taking picture both with and without flash at the same timem, absolutely automatic mode change functionality, and provide all manual functionality if you want.Since this camera is using 4 AA battery, you don't need to worry about the battery going out of charge if you carry spare aa batteries.I love this camera.", "Date": "July 7, 2013"}, {"Title": "Impressive for size and price", "Author": "Donna Long", "ReviewID": "R2MP09QW1EFBA6", "Overall": "5.0", "Content": "I bought this camera to take along with me to NYC so I didn't have my larger professional camera to lug around.  Larger than pocket size, but fit well in my purse.  Loved the panorama feature for the cityscapes.  It took good pictures, had a pretty quick shutter speed, and lots of features to play with.  Well worth the money.", "Date": "August 20, 2013"}, {"Title": "I like Fuji's S series cameras", "Author": "Dragoslav T. Marcovich", "ReviewID": "R1KFXUOBS4TPNV", "Overall": "5.0", "Content": "A very well thought layout; I have the S1000, the S1800, and now this one. One note of caution; it does NOT have a view-finder (the S8200 does) only the 3\" screen. I am very well satisfied with the performance.", "Date": "April 7, 2013"}, {"Title": "a great crossover between point-and-shoot and full dslr", "Author": "ucimnemc", "ReviewID": "R1ZDQPJ2FGXDXU", "Overall": "5.0", "Content": "an excellent camera with great functions. not quite a dslr but not far from it. it doesn't have a view port or finder, but the lcd screen is crisp and clear and discernible in all but the brightest of sun (and even then it's not really bad). i have used both smaller point-and-shoot cameras as well as dslr and this a great crossover camera between the two. imho, well worth the price.", "Date": "December 9, 2013"}, {"Title": "I have only had this camera a month or so, but so far I really like it", "Author": "Kindle Customer", "ReviewID": "R2QM0LP5PUA76H", "Overall": "5.0", "Content": "I really like my camera, the only thing I wish it had was an easy way to see what the battery life was...", "Date": "July 31, 2013"}, {"Title": "Great Camera", "Author": "username_unavaliable", "ReviewID": "RL35FL4ATIYUU", "Overall": "5.0", "Content": "Quite simply it has performed excellently in every situation I've threw at it, from bright outdoors scenes, to taking pictures of constellations, to moving objects, to portraits.  It's a great value for the price and won't disappoint.", "Date": "October 2, 2013"}, {"Title": "Brilliant Value", "Author": "Paul Aindow", "ReviewID": "RQK7RZ5J3MFM0", "Overall": "5.0", "Content": "I purchased one not too long ago, it's incredibly simple to use. Robust, the picture quality is absolutely spectacular, the 30x Optical Zoom is a treat, and it doesn't munch through batteries like some previous models have done for me.Would highly recommend this to novices and people with a budget. Brilliant value.", "Date": "April 19, 2014"}, {"Title": "Fantastic zoom and great pictures overall.", "Author": "Bob Purdy", "ReviewID": "R34SQZ5TX3KF8K", "Overall": "5.0", "Content": "An overall great camera.  Good low light performance.  Fast operation.  Amazing zoom.even does panorama shots.  For the price it cannot be beaten.  If it had a viewfinder or articulating screen it would be perfect.", "Date": "August 12, 2013"}, {"Title": "Better than I anticipated", "Author": "BJ \"BJ\"", "ReviewID": "R1I0GWFOKJKDEY", "Overall": "5.0", "Content": "I was looking for a reasonably priced quality zoom point and shoot.  I was searching the well known brands and a co-worker referred me to Fuji.  She said she had purchased a similar style a couple of years ago and said that the picture quality was excellent.  She also stated that the camera was very user friendly.Before she recommended Fuji it never crossed my mind to purchase that brand.  All my previous cameras have been Canon or Sony.  My most recent was a Sony Cybershot which I liked a lot until it started giving me problems which is the reason I was in the market to purchase a new camera.  I'm so very glad I was opened minded and decided to research the Fujifilm S6800.  It's newly released (March 2013) and the functions were exactly what I was looking for and then some.  I've only had the camera for a little over a week and only taken test shots.  The picture quality is spot on.  The real test comes next week when I go on vacation.  I will do an updated review then.  But for now I'm loving it.", "Date": "July 17, 2013"}, {"Title": "A gift for my mom.", "Author": "Roxana Gayoso", "ReviewID": "R1X7FHQ5ONSVU3", "Overall": "5.0", "Content": "I am a 22 year old photographer, my mom is in her 50s and doesn't really care too much about photography. She recently went to Rome on a tour with her friends, and she wanted to take some quality pictures so i decided to get her this camera. It has a huge zoom, build in flash, 16MP, decent iso. Some pictures come out as over exposed. One thing I would say its, the camera only saves the images with a 75 dpi which sucks if you are planning to print the images, it does not mean the quality is bad you just gotta change it to 300pdi in a program like photoshop, but is a tedious work.", "Date": "May 2, 2014"}, {"Title": "perfect!", "Author": "robin l wood \"robin l wood\"", "ReviewID": "R3QNZKNHXQXTEU", "Overall": "5.0", "Content": "The camera arrived on time and in perfect condition.  I took it to the park to learn to use some of the features and it was just as easy to use as described. I am disabled and it is difficult for me to get in and out of a vehicle. I was able to take beautiful photos from the car with the zoom and I even took some thru the windshield and there was no glare. Awesome!!", "Date": "April 16, 2014"}, {"Title": "I think I got my monies worth", "Author": "KEITH LINDEKE", "ReviewID": "R24FH9UDG8DGED", "Overall": "4.0", "Content": "There are a lot of cameras out there and a lot cost $1,500 -$3,000-4,000.00. So paying about $150.oo or so It take great pictures and easy to use. What I can't believe is all the functions on it. All the things that it does. It comes with a DVD manual. I'm going to have to spend a lot of time reading it. Or just use a couple basic settings. But I'd rather spend the time and use all of what it can  do. So for the amount of money I paid for it and all that it does, I'd say I more than got my monies worth out of it. I can't believe that it does all of that and I'd say I got the better end of the deal. I shouldn't say that or they might raise the price  before those that are reading this buy theirs.", "Date": "April 11, 2014"}, {"Title": "AMAZING!!!!!!!!!!!!!!!!!!!!!!!!!!!!", "Author": "shanti", "ReviewID": "R1OV31H5MF5EPQ", "Overall": "5.0", "Content": "This is THE best camera i have ever gotten, ever seen, and for the price probably the best camera there is available!!!!!! I would totally recommend this to anyone and everyone!!", "Date": "April 3, 2014"}, {"Title": "great camera!", "Author": "Sarah", "ReviewID": "R3UTSSQAZHYN9F", "Overall": "5.0", "Content": "I bought this for a photography class and am extremely pleased with it!  It takes excellent photos and videos, and has a great zoom. also very easy to use!", "Date": "April 2, 2014"}, {"Title": "Fujifilm FinePix S6800 16MP Digital Camera with 30x Optical Zoom and 3-Inch", "Author": "Robert", "ReviewID": "RR49KDZEITTX1", "Overall": "5.0", "Content": "I'm very satisfied with my new Fujifilm FinePix S6800 16MP Digital Camera, the pictures are clear, and also like the panorama view. Before, I own FinePix S700 and satisfied with Fuji products.", "Date": "February 7, 2014"}, {"Title": "Great for the Price", "Author": "Gunit", "ReviewID": "R2IPWRB2USW7B5", "Overall": "5.0", "Content": "Let us all be honest this is not an SLR or a super expensive camera. That is why we are looking at it. The quality is great for the price point. Yes the zoom gets shakey what do you expect out of a camera that can zoom out that far in this small of a package? I bought this for my wife and she loves it. It takes great pictures of our dogs at the park while they are in full sprint (granted they are basset hounds so they are not that quick) and great pictures when they are motionless. I also love the fact that it can use store bought batteries I can pick up some AA batteries pretty much any where. Overall, I knew what I was buying and it performs better than I thought it would!", "Date": "January 4, 2014"}, {"Title": "Nice little camera; takes the best pictures!", "Author": "Lisa in CT", "ReviewID": "R3ICT9VIFRR8U9", "Overall": "5.0", "Content": "This is the best camera I've ever had. I bought it to take product photos & needed a nice camera with a macro mode. This camera takes fabulous pictures! It's lightweight, and after (printing out and) reading the manual, pretty easy to use. I've also used the macro setting for flowers, butterflies, etc., and it's great.The controls are easy to use, and battery life is good.", "Date": "November 23, 2013"}, {"Title": "Great Camera", "Author": "Lawless", "ReviewID": "REJEIQWBKBO38", "Overall": "5.0", "Content": "Purchased to take my daughter's HS Prom pictures. Love this camera. Takes great photos and videos.  Came with generic alkaline batteries (so I purchased a set of energizer ultimate lithium) but interestingly, I used it all weekend (300 pictures and an hour of 1080p video) and the generic alkaline batteries are still on full charge.  Also, recommend purchasing a Complete AC Power Adapter Kit (AC-5VX plus CP-04 DC Coupler) - less than $20 and saves batteries for when your taking indoor pics or long videos.  Anyway - definitely recommend this camera.", "Date": "April 14, 2014"}, {"Title": "Great", "Author": "Apollo legend \"Apollo legend\"", "ReviewID": "R3HQTI77E91KGQ", "Overall": "5.0", "Content": "Fujifilm FinePix S6800 16MP Digital Camera with 3-Inch LCD is a great camera, or at least i think it is.It is big, this is not a pocket camera, but it takes clear pictures and it has a great zoom. also the HD video is excellent.", "Date": "April 30, 2014"}, {"Title": "Great shots", "Author": "married with kids", "ReviewID": "R2YATNJ8QY9FN9", "Overall": "4.0", "Content": "As with most point and shoot cameras I was not surprised at how my outdoor shots turned out in good light, but what did impress me was the quality of the shots using the full 30x zoom.  So far I've felt like the panoramic funtion works very well at splicing the images together compared to my prior Sony.  Indoor and low light shots are about what I would expect for the price.  It is much better than what I've suffered through in the past with cameras in the same price range so I do have to give it a thumbs up, but I would expect someone that wanted perfect low light pictures will simply need to come out of pocket for a $400 or $500 camera.  Only thing keeping me from giving this 5 stars is the size is a touch bigger than I expected it to be for a point and shoot and the fact that it runs on AA batteries instead of having a rechargable lithium battery pack.", "Date": "April 16, 2014"}, {"Title": "Takes great pics!", "Author": "Joan G.", "ReviewID": "RQUHZANXZ8VD2", "Overall": "5.0", "Content": "This is a great item. I would  definitely recommend it. The zoom is awesome . This is exactly what i was looking for! Thanks!", "Date": "April 9, 2014"}, {"Title": "Great little camera!", "Author": "Debra parsons", "ReviewID": "R3FCC0THUF1D99", "Overall": "5.0", "Content": "I haven't been disappointed at all with the S6800.  I wanted a starter camera since I'm just starting myself in taking serious pictures.  Up close and mid range definition is incredible!  The zoom works well for distance shots, but I have found that the definition isn't quite as good if the shot is far away .  Over all, for the price it's an excellent camera!", "Date": "March 16, 2014"}, {"Title": "Great camera!", "Author": "Jami Hicks", "ReviewID": "R2UHOG76JHS1IM", "Overall": "5.0", "Content": "This is an awesome camera. It takes great pictures. I got it for Christmas and have been using it a lot, though it doesn't seem to do good with batteries. I'm going to get rechargeable ones for it soon. Overall, I'd recommend it.", "Date": "February 7, 2014"}, {"Title": "great buy", "Author": "albert morin", "ReviewID": "R2CEZTELHI0ANO", "Overall": "5.0", "Content": "our old camera had alot less features.We like the fact that we can take video's. We live in the country and lots of wildlife we now can capture on film or video.", "Date": "January 24, 2014"}, {"Title": "It's for my children and it's great", "Author": "Gary F. \"Garfy2008\"", "ReviewID": "R2NR35MNYAO2LI", "Overall": "5.0", "Content": "While we haven't had this very long, the two children who are sharing it seem to love it.  In fact, my older kids wish they had it as well as the CMOS sensor does have more sensitivity in low light than their cameras which use a CCD sensor.  The other big thing is that once you have the camera focused, when you trip the shutter, there's almost no shutter lag at all.  Most cheaper \"point & shoot\" cameras in this price range have about a 1/2 second or more of shutter lag; not this camera.  It's our first Fuji and we're not disappointed.", "Date": "January 9, 2014"}, {"Title": "Great camera for the price", "Author": "C. Clarkin \"CC Designs\"", "ReviewID": "R2G7YMSSB7HV4R", "Overall": "5.0", "Content": "Great Camera for the price. Bought this for my daughters 13th birthday, and she has really enjoyed using this camera. Takes a little getting used to, but has great potential once the manual is fully read I believe. One thing to remember, the camera will \"click\" even if you do not have the memory card in, but doesn't hold any internal memory.", "Date": "November 27, 2013"}, {"Title": "gift", "Author": "Bobbi Lornson", "ReviewID": "RPN6QBIDX3L9M", "Overall": "5.0", "Content": "daughter in law loves it so far.  Loved the white color and all the options.  much more than she had before.", "Date": "October 9, 2013"}, {"Title": "Great Camera", "Author": "Tony", "ReviewID": "R2Z4MAP0ATFBL5", "Overall": "4.0", "Content": "It is more complex than a simple point and shoot camera but with a little time in the manual this camera will give you some great pictures. For a camera that does not have interchanging lenses, it gives you great flexibility and creativity. It will grow on you. Don't get frustrated if you can't figure everything out right away. Go out and practice with every setting in every condition and you will soon be a great photographer.", "Date": "January 2, 2014"}, {"Title": "Fujifilm FinePix S6800 Digital Camera", "Author": "S. Terry", "ReviewID": "R1IYIS4XGMW8J0", "Overall": "4.0", "Content": "The camera really could use a view finder, but other than that, I really like the camera and ease of use.", "Date": "November 5, 2013"}, {"Title": "Pretty good", "Author": "KatieR", "ReviewID": "R3APSOCE32P2U6", "Overall": "3.0", "Content": "Okay, I admit I thought this camera was going to be a lot better than it is.  Don't get me wrong, it's a nice camera, however the image quality is not quite what I was expecting or hoping for.  I purchased this b/c I do a lot of genealogy and I wanted a camera that would be able to take good quality document photos b/c quite honestly it's faster than printouts, less wasteful, more easily transferable, and cheaper (yes, I really despise paying $1-$2/printout depending on location).What I have found however is that it just isn't up to that ability.  I have tried and it has unfortunately failed at that task.  Most of the photos come out blurry.  And I've noticed there's a gradient.  Writing is clear at the center of the photo, but as you go further out things get blurrier until the edges are completely unreadable.  So I end up with half I can read and half I can't.The photos/vids it takes are decent.  Not overly high quality, but good enough.  Combined with the long battery life (my old one would last about 10 photos, this lasts for hours of constant photo taking) and it's a decent digital camera.", "Date": "April 7, 2014"}, {"Title": "Nice Camera", "Author": "I. Becerra", "ReviewID": "R26UK6D4AK1JUJ", "Overall": "5.0", "Content": "This is a very nice and easy to use camera! The zoom is amazing and the quality if the pictures are great. I got this as a gift from my wish list and could not be happier!", "Date": "November 9, 2013"}, {"Title": "AMAZING!!!!!", "Author": "David", "ReviewID": "R1CIV4JSMJ0XXJ", "Overall": "5.0", "Content": "omg amazing camera awesome zoom is amazing, God I love this camera, video quality is amazing photos are incredible.I love it", "Date": "November 7, 2013"}, {"Title": "Super Camera ,,, Easy to Use !!!", "Author": "Duane Fenton", "ReviewID": "RVOS93NEEN9WP", "Overall": "5.0", "Content": "I replaced a previous model of the Fujifilm FinePix Camera with this camera and I'm loving it. Easy to use and so far I've snapped about 2000 photos without a problem. I use this camera for work and sometimes the conditions outside are less then desirable. It works well in subzero temps and the photo quality is super. The LCD screen clarity is much better then the last model I had making to much easier to catch a photo that is just a touch out of focus. I'd buy another one of these but I have to wear this one out first.", "Date": "December 6, 2013"}, {"Title": "Fujifilm Fine Pix S6800", "Author": "C. Conklin", "ReviewID": "R2O58VYX3TDOND", "Overall": "5.0", "Content": "I gave this camera as a gift, so personally I cannot say much, but what I do know is the person I gave it to takes it everywhere with them and she says she loves it and loves the pictures that are taken with it.", "Date": "June 7, 2014"}, {"Title": "I love this camera!", "Author": "Cynthia", "ReviewID": "R2O8R59SDIGWIF", "Overall": "5.0", "Content": "I use this camera for photographing artwork for the net, primarily. Great quality. Fun and easy to use. STILL looking for a good case for it, however.", "Date": "June 2, 2014"}, {"Title": "Great camera", "Author": "TODD PENDLETON", "ReviewID": "R6ZQE527INDRC", "Overall": "5.0", "Content": "Bought for my teenage duaghter for a photography school projects; etc.  She understood operations without my intervention(actually doesnt allow me near it).  Assume working great.  She takes memory card to laptop to upload videos, which are in HD quality.", "Date": "May 29, 2014"}, {"Title": "Not happy with quality", "Author": "Mary Ellen", "ReviewID": "RKB693657EZ11", "Overall": "2.0", "Content": "I got the camera in January, went to use it a month ago and the on/off switch was broke.It glides to turn on and off, now it just slides and doesn't do anything.", "Date": "May 28, 2014"}, {"Title": "LENS JAMMED when stock Fuji lens cover on camera. A tragedy.", "Author": "Ian Todd", "ReviewID": "R3LLIZBNS7R2S1", "Overall": "3.0", "Content": "This was going to be our primary camera for our trip to Peru. A day onto the trip I turned on the camera with the lenses cover still on and the lenses became jammed. It is now with a local technician in Cusco, Peru. We are leaving on a 4 day hike in 48 hours up to Machu Picchu and we are now faced with a dilemma.I want to love this camera but the stress of this not working once we're in the mountains is almost too much to bear. Buyer beware.", "Date": "May 24, 2014"}, {"Title": "Great camera", "Author": "Kevin machen", "ReviewID": "RQPPT8WWMPUAM", "Overall": "5.0", "Content": "This camera takes excellent pics. The zoom lets me get great close up shots on the two and three story structures I'm inspecting when at ground level.", "Date": "May 23, 2014"}, {"Title": "lot of features", "Author": "joan keppol", "ReviewID": "R3BA2MU85198JJ", "Overall": "5.0", "Content": "this is a great camera, takes really good pictures, the zoom is really good, i can't believe how close i can get to things and still get a clear picture, it has features i have never used before, i am still learning to use them all. I love it", "Date": "May 22, 2014"}, {"Title": "speakers in camera!!! bonus!!!", "Author": "Amy", "ReviewID": "R3995JXBTQMXGE", "Overall": "5.0", "Content": "awesome camera!  takes excellent photo's , lots of great options, great deal! Auto features make this easy to use, good tutorials.", "Date": "May 15, 2014"}, {"Title": "Great Valued Camera", "Author": "Bread", "ReviewID": "R3CYI6LUVRKTJ3", "Overall": "5.0", "Content": "Great Camera! It has an nice long zoom on it with 360 option to capture an whole room or arena.", "Date": "May 14, 2014"}, {"Title": "New Camera", "Author": "Eric C. Davis", "ReviewID": "R1T0YAU4BI1HO3", "Overall": "5.0", "Content": "I haven't taken too many pictures yet. But I like how the screen show details of what I can expect the pictures to hold.", "Date": "May 11, 2014"}, {"Title": "Too figity!", "Author": "Doug Turner", "ReviewID": "RJAZ2Q1WCJ2VQ", "Overall": "3.0", "Content": "Other than the point and shoot mode, I find this camera to be very  difficult to operate. The pictures do not show that the lens sticks out 2 3/4\" from the camera body. I am sure someone that is mor familiar with camera's would like it.", "Date": "May 10, 2014"}, {"Title": "Love this camera", "Author": "Gardengirl \"Shar\"", "ReviewID": "R1BERP9FNQPHAU", "Overall": "5.0", "Content": "I have had this camera a couple of months and have not learned or used all the features. However, what little I have used it for I must say it takes beautiful pictures. It is very user friendly and a good camera for those of us who are \"technology handicapped\". It is fast at clicking picture after picture so you do not miss a shot. It does all the work at setting every shot up. Recommend this camera for anyone wanting a good camera in this price range. Besides the red is beautiful, not boring black.", "Date": "May 6, 2014"}, {"Title": "Great!", "Author": "SiskiyouSue", "ReviewID": "RNUOVCTHNIVMR", "Overall": "5.0", "Content": "This is easy to use, not so heavy that it is difficult to carry and takes great pictures.  I'm very happy with it.", "Date": "May 3, 2014"}, {"Title": "Awesome", "Author": "Jackie Williams", "ReviewID": "R3NJ9X49GPV3I3", "Overall": "5.0", "Content": "This was an awesome gift that was given to my son.  he cant wait to use it on his band trip.", "Date": "April 4, 2014"}, {"Title": "Absolutely LOVE this camera!", "Author": "Candia C. Benton \"CandiCane\"", "ReviewID": "R2P9WS2QFDN5ML", "Overall": "5.0", "Content": "I bought this camera because I had the model before it and loved it(til it got broken). I am so happy with this camera, I would recommend it to anyone!", "Date": "March 27, 2014"}, {"Title": "Good definition and great zoom in a small package", "Author": "Dj", "ReviewID": "R336IKG5E7TLRE", "Overall": "5.0", "Content": "camera takes great pictures for the money. Everything operates as advertised. no problems  Good definition and great zoom in a small package", "Date": "March 25, 2014"}, {"Title": "LOVE IT", "Author": "Andi", "ReviewID": "R9KK4ANLZ13JZ", "Overall": "5.0", "Content": "This is my second Fuji camera. I had the first one for almost 10 years! I love my new one!", "Date": "March 19, 2014"}, {"Title": "fantastic camera", "Author": "P. S. Lewis \"Searching Willow\"", "ReviewID": "R2ZXG7C9Y4FL58", "Overall": "5.0", "Content": "This is my second shot at owning this camera - great for my formal photos of my son and for my genealogy work. . .", "Date": "March 13, 2014"}, {"Title": "Takes excellent photos", "Author": "Sharon", "ReviewID": "R3M91QDTQ7TL4D", "Overall": "5.0", "Content": "Bought this to take on vacation this summer.  Wanted to get camera ahead of time to get used to the settings etc.  camera takes nice quality pictures and is user friendly.  I'm just an amateur, but love taking photos.  Was able to make a canvas wall art with one of my photos and it turned out beautiful.  The camera does get a bit heavy after a while, but this isn't a compact digital model either.  Love this camera, price was lower than some of the others I considered.  would highly recommend!!!", "Date": "March 9, 2014"}, {"Title": "LOVE THIS.", "Author": "Melvin Bell", "ReviewID": "R2WZDBEQIYOZKK", "Overall": "5.0", "Content": "Got a chance to actually start using it after a couple of days, and it is an excellent camera for the price.  I am able to vey easily download the pictures to my computer.", "Date": "March 2, 2014"}, {"Title": "A great camera", "Author": "Mark Miller", "ReviewID": "R10BRNFGRESS0H", "Overall": "5.0", "Content": "After taking hundreds of photos, I can speak with some authority that this camera takes beautiful quality images without draining batteries too quickly.", "Date": "March 1, 2014"}, {"Title": "Great Camera", "Author": "brittanyh1804", "ReviewID": "RFQ68O07KJZB3", "Overall": "4.0", "Content": "I am really pleased with this camera. So worth the money!  This was very easy to learn and the features are pretty cool. I just needed an update from my old GE camera and this one is great!", "Date": "February 20, 2014"}, {"Title": "I like my new camera.", "Author": "Billy Bubba Bob \"ADP RET\"", "ReviewID": "R17KIWO51K25C2", "Overall": "4.0", "Content": "This camera was very easy to set up. I was able to take pictures and download the pictures to my laptop with ease. I have had the camera for only a month but so far I am very happy with my purchase.", "Date": "January 31, 2014"}, {"Title": "Great product", "Author": "Therese", "ReviewID": "R3HWDL4CFO04SV", "Overall": "5.0", "Content": "Awesome product...shipped quickly, great price.  Wolf Camera is the best!  I miss them in Illinois.  Fuji Cameras are also really terrific!...Love this camera.", "Date": "January 11, 2014"}, {"Title": "funny story", "Author": "HDman", "ReviewID": "R306KN4W6PI1O1", "Overall": "5.0", "Content": "I have an animated Halloween clown. I have it permanently shut off. This camera has a blink detection. When I focused on the clown- Klouse is his name by the way; the camera flashed me \"blink detection\" when I directed the frame right at his eyes. How odd. Thanks to my camera Klouse came out looking down right good and scary. Shipping was great. thank you", "Date": "January 8, 2014"}, {"Title": "Camera", "Author": "Amazon Customer \"jsr4gvn\"", "ReviewID": "R3UA4KIDR84MJS", "Overall": "5.0", "Content": "I love my camera I take more pictures than ever I am very happy with it. I used it on walks and at Christmas.", "Date": "January 3, 2014"}, {"Title": "Bought as a gift.", "Author": "Frank Butts", "ReviewID": "R2V0ESA4HX64Q6", "Overall": "5.0", "Content": "I bought this as a gift for my daughter.  She loves it.  I got to play with it for a while and now I’m going to have to get one for me.  It takes great photos in very low light great it great for point and shoot.", "Date": "December 18, 2013"}, {"Title": "great home camera", "Author": "Joe Pahl", "ReviewID": "R2YHGO4B2JT52A", "Overall": "5.0", "Content": "I've had fujifilm cameras I the past and have always been happy with my purchases. This camera held up to the standard of the previous purchases.", "Date": "December 12, 2013"}, {"Title": "great", "Author": "spary", "ReviewID": "R1AQZ49RPCZQE3", "Overall": "5.0", "Content": "this camera is amazing it has all the features i need ... i can use it in auto or manual mode", "Date": "October 19, 2013"}, {"Title": "Not the Best", "Author": "Geoworker", "ReviewID": "R1BFA04QI24HPU", "Overall": "3.0", "Content": "The camera arrived on time and was easy to get operational. However, photos taken with this camera have a problem of the right third of the image being slightly out of focus.", "Date": "November 18, 2013"}, {"Title": "Cheap Plastic-Like Material!", "Author": "Rafaelina Siri", "ReviewID": "R39VQOV4ZQZ5FX", "Overall": "2.0", "Content": "Excited was an understatement when I first ordered this camera. I was happy about the reviews and the price of this camera, which seemed to have met my wants and needs in a camera. The camera does not have an actual eyepiece when taking a photo and the focus was the worse focus I have ever experienced with a camera, extremely out of focus with a low quality being the result. I found myself trying different modes and searching for a way to make it work, even resorting to online forums that spoke furthermore about this product. To my dismay, I ended up returning it and getting a refund for my purchase. The material of the camera felt cheap and plastic, it looks cheap, I wouldn't recommend this camera to anyone. STAY AWAY!", "Date": "February 24, 2014"}, {"Title": "S6800 NOW YOUR TALKING", "Author": "D. E. Wilds", "ReviewID": "R2MFIX2RYP4LS3", "Overall": "5.0", "Content": "QUALITY IS HERE TO BE SURE AND PRICE WAS RIGHT, EASY TO USE AND FEELS GREAT IN THE HAND. ONLY HAVE SHOT A FEW PICTURES INDOORS AND VIDEO IS GREAT. FUJIFILM HAS THE CAMERA HERE AND YOU REALLY NEED NO MORE. WHT SPEND MORE MONEY WHEN THIS ONE CAN DO THE JOB FOR YOU.", "Date": "February 23, 2014"}, {"Title": "Great camera", "Author": "KT", "ReviewID": "RNPCPNXF4T4M4", "Overall": "5.0", "Content": "Bought to replace an older model Fuji film camera. I had no problems with the old one so I figured this would be just as good.", "Date": "January 3, 2014"}, {"Title": "so excited", "Author": "A. Bibby", "ReviewID": "R3BUUSLR8O2566", "Overall": "3.0", "Content": "I was so excited to get this camera. However, I have tried taking pictures in different settings and the pictures are almost always blurry. I have tried the SR auto mode and the auto mode. I even tried leaning against objects thinking maybe I just wasn't holding the camera still enough. The pictures still turned out very grainy. Sorry Fuji. I really wanted to like this camera.", "Date": "March 13, 2014"}, {"Title": "it'll do I guess", "Author": "misterconway10", "ReviewID": "R1J85KCKHCYN6K", "Overall": "3.0", "Content": "Prolly the neatest function of this camera is the one second power on. Its really fast. Auto focus seems OK. But the camera just feels cheap in my hands. Especially compared to my Nikon p510. But it was also half the price so you get what you pay for.edit. ...after using a few days it does take descent pictures. I'm not crazy about it not having rechargeable battery tho. As it doesn't have eye-fi SD card control, I can't disable the wifi like in my Nikon so that is always eating at the AA batteries. Overall a descent bargain", "Date": "October 29, 2013"}, {"Title": "Football State Championships!!", "Author": "April McAbee \"AprilMcAbee .com...Future autho...", "ReviewID": "R2QNWH5SRVVB7R", "Overall": "5.0", "Content": "You heard that right, I live in Texas and once it became clear that my children were going to the state the state playoff game, I told my husband we had to get a better camera and fast. My son was on the team, my daughter is a Varsity Cheerleader and my other two march in the band. We live in a little-bitty one flashing light town and we are a six man football school. This was the first year that the six-man football State Championship games was to be played at what us Texan's call Jerry's world, Cowboy stadium or more recently referred to as the AT&T; stadium. I am on disability and that is alll the income we have to get by and four children so my husband took a chance and bought this camera which was what we wanted and the price was great. Great pictures, the zoom is amazing...need I say more?", "Date": "February 14, 2014"}, {"Title": "It's OK but Samsung Galaxy Note II pictures better", "Author": "Amazon Customer", "ReviewID": "R1NN7D92R8UVVA", "Overall": "3.0", "Content": "I really wanted this camera to work out, but after taking several test shots in different lighting situations indoors & outdoors, I returned it. I want a camera with long zoom, but I still want to use the auto settings. My main complaint is this camera always chose higher iso resulting in noisy/grainy pictures. Indoors (with window shades open & sunlight coming in) the pictures were very noisy, not even acceptable. Outdoors the pictures were much better with little noise but still choosing a higher iso resulting in slightly more noise than my Samsung Galaxy Note II. I'll have to do without the long zoom, but for now I'll continue using my phone.", "Date": "October 4, 2013"}, {"Title": "Finepix s6800 forget it", "Author": "steve", "ReviewID": "R1RXGN3RDJSZ96", "Overall": "1.0", "Content": "Only 6 months old and the on/off button failed returned on guarantee having paid postage only to have it returned being told battery leakage. Rubbish, only used duracel. the flash button release is dodgy and it will cost you a fortune in batteries. You pay a lot and get very little in return. Buy another brand and get value for your money.", "Date": "November 22, 2013"}], "ProductInfo": {"Price": "$229.95", "Features": "16MP BSI-CMOS\nFujinon 30x Optical Zoom (24-720mm)\n3.0\" LCD\nFull HD Movie\n4-AA Batteries", "Name": "Fujifilm FinePix S6800 16MP Digital Camera with 3-Inch LCD (White)", "ImgURL": "http://ecx.images-amazon.com/images/I/41hckjjWUNL._SX300_.jpg", "ProductID": "B00B46XRK4"}}