{"Reviews": [{"Title": "Yes! Yes! and Yes!", "Author": "Xion Lester", "ReviewID": "R38YW0UYSW2U0P", "Overall": "5.0", "Content": "I overlove the Canon 6D.  It has a full frame sensor like the 5D but is less expensive.  I originally wanted the 24-70mm lens, but am much happier with the 24-105.  It's slightly more versatile.  I'm still getting to know the rest of the items in the package, but the camera is a win for sure!", "Date": "June 5, 2013"}, {"Title": "No longer a skeptic.", "Author": "Desdinova", "ReviewID": "RGJ9RSYGHLGYG", "Overall": "5.0", "Content": "I'll leave out the camera review and mention the seller.  A warehouse store had a 6D kit for $3150.00.  They began a $350 instant rebate for a kit bringing the price down to $2800.00.  The tax was on the $3150.00 price, so the total would have been around $3100.00 anyway.  I began shopping online to find a price lower than $3150.  I saw Davismax ad on Amazon for the $2799 with no tax.  They offered a bunch of other gear in the kit too.  It took me a few days of research to make sure it wasn't a 'too good to be true' deal.  I finally pushed the button to buy.I ordered 2nd day shipping and the box arrived the next day, to my surprise.  I checked the body out and registered it immediately to check for USA new build.  The 3 main lenses were Canon as advertised.  Everything DavisMax advertised was in the box, plus a few more items.  I was impressed with seeing the Canon EW-83H lens hood included.  That’s a $50.00 hood!  I priced everything out individually and used the lower online prices for this review.  The total came to over $3600.00.The tripod was the only lightly constructed item in the kit.  I won’t use it to hold up this body but it works well on a small point and shoot camera.  It’s compact, light, and has it’s own carrying bag.As for the camera review:  Awesome!", "Date": "March 21, 2014"}, {"Title": "Best Canon 6d deal around", "Author": "Jim S", "ReviewID": "R1T0WZQHAGZX2B", "Overall": "5.0", "Content": "Dollar for dollar, I paid $2,790 in July, 2013, this was the best price for the Canon 6d and three Canon lenses I found on line.  The extra batteries, filters, flash etc add value too.", "Date": "August 19, 2013"}, {"Title": "Great camera, great value", "Author": "Ove Sando Myrstad", "ReviewID": "R2OT6W8K9IJDIP", "Overall": "4.0", "Content": "Arrived on time and pretty much as expected.A high quality camera and a very good amount of good quality kit for the price.Third party supplier flash a bit of a let down comparing to the quality of the camera and lenses.Back pack looks different from the advertised picture, but is of decent quality and usefulness. The shoulder bag less so. It is not sufficiently rigid when laden and when closed still leaves open 'holes' on both sides on top.All in all a solid recommendation though.", "Date": "April 12, 2014"}, {"Title": "snap happy", "Author": "mchelle woodward", "ReviewID": "R21K4T25J1DWXP", "Overall": "5.0", "Content": "Best deal online, for a full frame camera this camera takes sharp clear beautiful photos, I am a photographer and bought this camera for its great low light ability's at weddings in a dark church or reception area turn up the iso and get every shot.", "Date": "March 19, 2014"}, {"Title": "Super Quality Camera", "Author": "Prajwal Gupte", "ReviewID": "RM86HPKMK27NZ", "Overall": "5.0", "Content": "This is a super quality camera and the bundled package is great.Its very difficult to purchase these items separately and beat the price which the seller is offering. I am very happy with the camera. I would recommend buyers to grab this offer ASAP before seller runs out of this.", "Date": "January 29, 2014"}, {"Title": "Canon EOS 6D", "Author": "Lucie & Orlando Delgado", "ReviewID": "R2SJFXOI89UXLA", "Overall": "5.0", "Content": "The bundled package exceeded my expectations. I priced this item at several diffrent retailers. The additional items were very convenient and less pricey than if I would have purchased them separately. I'm very happy with my new camera", "Date": "January 20, 2014"}, {"Title": "Very good item", "Author": "Carolina Duarte", "ReviewID": "R3OEGICCZVLEVN", "Overall": "5.0", "Content": "I choose 5 stars because of the quality of each item at the combo. It has all you need to start profesional audiovisual projects.", "Date": "January 13, 2014"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B00BFJ7OQI"}}