{"Reviews": [{"Title": "A rugged point and shoot that delivers on promises.", "Author": "Donald G McGahan", "ReviewID": "R1XEVEEYBI7A0E", "Overall": "5.0", "Content": "I purchased this camera to accompany me to South Africa where I was instructor of a Study Abroad College Course. We camped out and toured 4 National Parks over 4 weeks and for three of the parks we self drove. As the driver of a van full of students all trying to take pictures or identify wildlife with binoculars, I knew I would not have time to fuss with my own Nikon 35mm SLR. Additionally, due to the nature of my profession the point-and-shoot cameras with exposed lens mechanisms last about 1 day before fowling the retractable lens mechanize unless excessive time and care is taken prior to each shutdown to keep them clean and free of dust. --Not this camera, it is sealed up tight.--This camera has a substantial feel. It is not some flimsy feeling product. I took only reasonably light care of it and I did not have much concern about the quality standing up to abuse. The two times it was accidentally dropped no harm came to the camera and it just kept on taking pictures.It is not good at reaching out to take close up pictures of far off animals on safari. Although it has zooming function this is not what I purchased it for and one would be better served with a 35mm SLR for such work. I did snap away with the highest quality settings the camera allows, attempted to stay in the optical zoom range for most shots, and have found that I can crop some later to focus on the animal(s). That is a compromise, but one I have made for this trip.It has manual focus, but it is not an SLR so using the viewing screen in bright light is not the best mix with manual focus (IMO). A really useful function that this camera has is the video modes. While these task the battery they are excellent and I found I could zoom in and out while recording the video; very nice.I cannot comment fully on the onboard memory as prior to the trip I inserted a 128GB (yea that's right 128GB) SD card and after retaining some 900 pictures and movies I've only used 9GB. Now if I were taking pictures rather than working the vehicle so others could take pictures, I might have used double or triple that amount that space with this camera the way I tasked it for this trip. Also, the camera does not have an option to save in RAW mode so it is fairly miserly with storage space requirements.I thought I would use the GPS more. Turns out that the GPS, in the car anyway, is pretty taxing on the battery (always trying to find satellights I supposed) as well so that got shut off and rarely turned on again. Power became an issue for me because I did not want to reach sunset and have no camera battery left.If your in the bush for days-on-end or need to take pictures all day long, buy extra batteries. That is true of most cameras though. Though it seems as though the USB charging cable can charge from a computer USB port, it did not always charge correctly when connected to a computer. This is likely because of the computer not always delivering adequate juice; your milage may vary with your computer. I found that using the USB adapter packaged with the camera worked best (in the auto I sometimes used a Kensington 12v to 110v inverter and plugged into that).I only concerned myself with moisture when charging or opening the camera. I did not submerge the camera so I cannot comment on that. Maybe sometime in the future :-)I did not get a screen protector and I probably should have given the low cost of screen protectors. I mostly just tossed it in my bag or had it hanging from a belt loop. Sometimes it made it into my pocket, but mostly not, and therefore lots of opportunity to get beat up and it still looks reasonably good.This is way better that your smartphone camera and it is rugged. Not 'abuse it' rugged I suppose, but rugged in the 'I don't wanna fuss over caring for my camera' rugged. I am pleased with the product. I would purchase it again for these purposes. I will also keep it with me when I do take the 35mm SLR as it has some handy features and is real easy to use.", "Date": "July 8, 2013"}, {"Title": "tough camera", "Author": "FYI", "ReviewID": "R2U31SJYTIS5Q2", "Overall": "4.0", "Content": "This camera is a little bit bulky, but tough and works well  Picture quality is good great for family photos in the pool or exciting vacation destinations", "Date": "October 8, 2013"}, {"Title": "good", "Author": "Jun Ai", "ReviewID": "RDFWBW54XWV9Q", "Overall": "5.0", "Content": "It is very good, I like it.the battery, Li-50B, can be used by it. So my old camera's battery can be still used.", "Date": "July 9, 2013"}], "ProductInfo": {"Price": "$419.00", "Features": "16 Megapixel Backlit CMOS w primary color filter / Size - 1/2.3\nOptical zoom - 4X - Focal length (equiv.) - 4.5-18mm (25-100mm) / Digital Zoom 7.2x\nTTL contrast detection autofocus, AF assist lamp, Macro Illuminating LEDs - Focus modes - 9 point AF, Spot AF, Auto Tracking AF, Macro, 1CM Macro, Infinity Landscape, Pan Focus, Manual Focus\n3 widescreen TFT color LCD w anti-reflective coating on cover\nBuilt-in series control auto flash", "Name": "Pentax WG-3GPS ~ 16MP Waterproof Digital Kit, Green", "ImgURL": "http://ecx.images-amazon.com/images/I/51358jRNW3L._SY300_.jpg", "ProductID": "B00BJ0ON44"}}