{"Reviews": [{"Title": "The detail is there", "Author": "Ali Roustai", "ReviewID": "RTYJSMMTJBLO3", "Overall": "5.0", "Content": "Please don't take the how many stars too seriously as this is my initial review.I use two DSLR cameras with super high grade lenses from Canon and Olympus so I am picky, I will attempt to be fair and only compares  apples to apples and not oranges :)Pros:- Great build feels solid yet light.- Fast shooting rate (though you might wanna slow down as sometimes focus will be off. This is common with all point and shoots... If you shot pictures like machine gun, a few of the pictures will come out blurry)- As someone who has had point and shoot from Sony,Fuji Olympus and Samsung. I can say with confidence that this camera  produces the best amount of detail that I have seen from a recent  small sensor point and shoot. The only two cameras that produce cleaner detail in portrait pictures are probably the Nokia Pureview and my very old Samsung i85 (in Macro mode) neither  of which are Tough or waterproof. For those of you who shot with DSLRs and use RAW format. JPEG images coming out of this camera can be quiet nicely enhanced and sharpened with Photoshop using inverse Gausian blur and a High pass filter as Nikon has been very smart not to over process their images. The same could not be said about the Olympus TG820 and Fuji xp50 that I tried and returned.- Tons of generic battery available for real cheap.- Easy to navigate and intuitive commands and buttons.Cons-The video quality is about equal to the rest of the competition but not as good as the latest Sony point and shoots.- Having a RAW format option would have been nice- Like all newer point and shoots this camera has too many Mega pixels for its sensor size. If Nikon would have keep it at around 8 or 9 MP, picture quality would have been even better.In conclusionIf you are in the market for a rugged design, this camera is a solid contender.Update 03-26-2013I am really pleased with this camera's overall performance. Its a keeper and I am upgrading my rating to a 5 star", "Date": "February 28, 2013"}, {"Title": "Overall a GREAT camera with just a couple minor misses.", "Author": "B. Boyd \"Idaho Photographer\"", "ReviewID": "R2Z3U0BUFJXBWW", "Overall": "4.0", "Content": "A little background, I am a professional photographer and have been taking photos for the past 30+ years. I typically shoot only with Nikon camera's and lenses, but for this purchase I did look at other brands.Let's start with what makes this a GREAT camera:* Excellent build quality - the look, feel, weight and attention to build details (seams, fit/finish, quality of components) is Excellent* The wide availability of shooting modes (underwater, close-up, portrait, night +16 other modes) will satisfy even the picky pro user, but the \"Easy Auto Mode\" is awesome for the average user that just wants to pick up the camera and take a picture.*  The built in Wi-Fi and GPS features were easy to use and setup.* IMHO, one of the first truly rugged point & shoots on the market. Freezeproof, Waterproof & Shockproof. Of course with limitations, but still a VERY rugged camera that can take some abuse.* I've taken about 100 pictures so far and am seriously impressed with the quality of the pix and how well the camera does in low-light situations.* Nikon has a Wireless Mobile Adapter Utility app that is pretty cool. I've used it to automatically upload pix right to my iPad. Clean, easy and flawless.With the GREAT also comes some shortfalls. Not a whole lot IMHO, but enough to ding it ONE star* You have to print out your own manual. Sure, a quick start guide is included, but this is a serious feature rich camera and as such, there should be a printed manual to help you gain familiarity and skills. My concern is that the average user is not going to print out the huge PDF manual to learn about the awesome feature set. Which means the camera doesn't get used to nearly it's broad capabilities.* While the 3\" OLED display is beautiful, it is a scratch magnet. Nikon should include a screen protector at this $350 price point.* No included memory card, another shortfall at this price point IMHO. The camera does have 21MB of internal memory so you can shoot right out of the box, but even an 8GB card would have been a big plus.Overall, I really love this camera. A great set of features and usability. The price point is a bit steep, but if you are the type of user that is very hard on your camera or you like to dig into the different features and modes and actually use them, then this is a perfect camera for you. I have a dedicated video camera, so I have not used that feature more than twice. But the times I did, it was easy to use and the HD quality was impressive.A close to 5 STAR camera, but for the price point I felt that Nikon could have included a few extras. But you cannot go wrong with the build quality or the picture quality - those features are truly 5 STAR.", "Date": "March 15, 2013"}, {"Title": "Great Product, just don't push it to the limits...", "Author": "Patrick T", "ReviewID": "RE6NKKAQ1ZE5B", "Overall": "3.0", "Content": "I bought the AW110 as i needed a cam that can take a beating and it particularly waterproof for shallow diving.Since the AW110 in terms of specs can supposedly be submersed to the greatest depth without a underwater housing among all current and upcoming products that I know of, it seemed like a good starting point.I think the other reviews give already a good overview, so I try not to repeat those and only focus on my experience.Good:- Magnetic compass worked really well under water- I found the depth gauge also to be a quite useful feature even readings were always 1-1.5m higher than dive computer.- Underwater pictures look decent- I did not experience any fogging issues as described in the other reviews despite a lot of diving. Maybe because I was very careful with respect to opening it in a dry environment.Bad:- There is an airspace between the plastic screen cover and the actual screen. When you swim deeper than 10m the screen bends in and touches the LCD in the middle and it looks worse when getting anywhere close to 18m. I thought that didn't look healthy for the screen, which brings me to...Ugly:- Screen died on me after three days of diving (and I am 100% sure I stayed within the limits and did not let any water leak into the cam). The camera still took pictures after that but without seeing any controls/viewfinder the cam was a lot less useful.Summary:Looks like a great cam. just don't plan on taking it for diving (I'd say anything close to 10m). I returned it, and will be checking out some of the other upcoming offerings hopefully those keep up better.", "Date": "April 27, 2013"}, {"Title": "Not Waterproof and Nikon wont repair or replace", "Author": "Jo Webber \"Galileo\"", "ReviewID": "RFZUIGS3A7TYO", "Overall": "1.0", "Content": "Here is the straight scoop. I read a ton of reviews of this camera, the Canon, Pentax, Olympus waterproof cameras. The problem is the reviews dont really use the camera underwater. We went to Bora Bora (trip of a lifetime) with our 4 and 7 year old and the camera worked great on the beach - but as soon as we went in the water it leaked water. My kids are young - we were snorkeling - so about 6-12 inches from the surface. I also bought Nikons floaty leash (worked great) so the camera was never more that 12 - 18 inches deep and it leaked. When it dried out it came back to life and does work - but anytime it is- immersed it leaks. Ive had a few Nikon cameras over the years and not had any problems. So I returned it to Nikon when we got back. I have just logged on to the Nikon service center to see the status - and heres what I see :Problem: LIQUID DAMAGE CLEAN & CHECKTotal cost of repair: $137.50*So - as much as I like the form factor of the camera and the photos are decent (when not waterlogged), Im not going to be taking Nikon's repair center up on their offer. Im in the market for a really waterproof waterproof camera. With two kids under ten - I dont need much - just a few feet of water - swimming pools and ocean.So Im afraid the other reviews you see on Amazon about this camera not being waterproof are true and while DP camera and others do great reviews - the reviews here are from people who actually have used the camera underwater.I run a company. Im not sure how Nikon feels about selling a product that claims to be waterproof and then attempts to charge you for 'fixing it' when it leaked in 1 foot of water.", "Date": "October 5, 2013"}, {"Title": "Black Screen of Death is Imminent", "Author": "Matthew T DiMasi", "ReviewID": "R1A0PDHUK9O8K", "Overall": "1.0", "Content": "I am currently on my second AW110.  I purchased the AW110 2 days prior to going on vacation to Bermuda.  I was expecting to take great photos while snorkeling with this camera.  The camera is rated for underwater use at a depth of 59', and not to exceed 1 hour.  I snorkeled for 30 minutes, and did not reach a depth greater than 10' (which is a generous over-estimate).  Upon coming out of the water, the camera would turn on, but the screen would not illuminate.  The screen remained black and is no longer functional.  While the camera has many nice features like integrated Wi-Fi, GPS, and the ability to take 3D pictures, the camera just didn't hold up to even 1/6th of the promised depth.  I contacted Nikon Customer Support/Service which was a complete and utter joke.  The representative that I spoke with claimed to be both customer service and technical support; she was neither technically proficient nor friendly.  I was told to send my camera into Nikon at my own expense for it to be evaluated and Nikon would repair it if possible.  If the camera was not repairable, they would \"possibly\" replace it.  I am extremely thankful that I purchased the AW110 from Amazon.com as they just replaced the entire Camera with minimal questions asked, prepaid return shipping, and the postal carrier picked up the package at my front door.  Lastly, I read many reviews before purchasing this camera and this has happened to MANY MANY individuals.  A basic search on the Internet as well as Amazon.com will show an overwhelming community of consumers that have been viciously bitten by this product.  When I mentioned this to the Technical Support Representative, she exclaimed that she had never heard of this issue before... I'll leave the readers of this review to generate their own opinion on that note.  If I didn't already have a Nikon DSLR prior to purchasing this AW110, I'd be sure to shop with the 5 - Letter competitor that starts with C and ends with anon.  Furthermore, I urge any representative of Nikon with any level of pride in their organization that may be reading this review to contact me.Update #1: Nikon rejected this very same review on their website for \"One or more reasons\" which are unnamed.  Only positive reviews are allowed. ;)", "Date": "July 4, 2013"}, {"Title": "same problem, water damage", "Author": "hbongers", "ReviewID": "R15B90K2AMKK0S", "Overall": "1.0", "Content": "Have owned nikon cameras since 1984 and have been impressed with their quality and feel as well as picture quality. My oldest nikon still works perfectly. I have a nikon dslr and nikkor lens and again no problems.  Then I bought the \"waterproof\" nikon.  It did well until we went to the Bahamas. Second day of an eight day vacation we went snorkling. Max depth was maybe 10 feet.  Came out of the water and it would not turn on.  Opened battery compartment , wheel was in lock position, inside was water, ruined.  Previous year was used in pool, beach, etc with no problems.  I think that it was just not made well enough for serious water use.  Will not buy again. Still like the nikon brand and if they come out with a new one I will probably buy it, but not this model.", "Date": "August 12, 2013"}, {"Title": "Does not play well with water", "Author": "C. Lorenz", "ReviewID": "R10BW6FSCWTSJR", "Overall": "1.0", "Content": "Short of it: Failed in shallow water like so many other peoples AW110.We purchased this camera a few weeks before a trip to St John Virgin Islands that involved a lot of snorkeling. The camera controls and features are great. The pictures were good quality for a little point and shoot. The pictures before the trip in a pool came out wonderful. The only issue that we had with it was that 3 days into our trip it died. The screen went black which made the camera little more than useless. Many other people complain of the same issue with it so it seems to be a fairly common fault with this model. The deepest we went with it was probably 5 or 6 feet, most of the time was surface snorkeling. If you want a camera that can get splashed while you are boating this is probably a good idea. If you want something that can go into a couple feet of water stay away from this camera. It seems unimaginable that it could actually go to the 18 meters and still function when so many of them break a couple feet from the surface. In short we want to love this camera, we tried to love this camera, the features are great, except the one feature that we bought it for, to use in water. Nikon if you actually had this camera waterproofed it would be a killer, instead it scares me away from your brand. Feel free to keep my camera that I used for 3 days and just sent in for warranty until you solve this problem since it's pretty useless to me as it is now.Update: We received an estimate from Nikon of $148.84 to repair this camera. The paperwork said that it was not covered by warranty. When I call to get more information as to why they denied the warranty I just get a message that says all their staff is assisting other calls then their phone system hangs up. Not only would I rate this camera low but Nikon's support is non-existent for all intents and purposes.", "Date": "August 26, 2013"}, {"Title": "Not waterproof", "Author": "NSlick", "ReviewID": "R26WG745E088VK", "Overall": "1.0", "Content": "After looking at the many waterproof / rugged camera options, I decided to go with Nikon.  I have multiple Nikon dSLRs and lenses and have been very happy with them.  I now wish that I had paid closer attention to the other negative reviews.In good sunlight, this camera takes decent pictures.  I have only used dSLRs for a few years, and the pictures are not as good, but I didn't expect them to be.  I was primarily interested in the rugged and waterproof features.I ordered the camera over a month in advance of a vacation that was to include snorkeling.  With some light use, the back screen of the camera was scratched and scuffed, but I didn't worry about that because it did not affect the use or picture quality.The major problem was that within 10 minutes of taking the camera into the ocean, and with the camera not getting more than a foot or two under water (this was before we even started snorkeling), the screen died and went completely black.  Even after letting the camera dry out, the screen will not turn on.For the money, this camera is at best a mediocre point-and-shoot.  The only real advantage (in theory) would be the ruggedness and waterproofing features, but they do not hold up in real world use.  I do not have any other experience with waterproof cameras, but none of the others available could do any worse than this Nikon did for me.", "Date": "July 30, 2013"}, {"Title": "Do not buy this camera", "Author": "Kenya Cranford", "ReviewID": "R2AKVFLIO446X0", "Overall": "1.0", "Content": "I bought this camera because I was going to be doing a lot of swimming and active sports in Croatia and I wanted to capture the unique experiences.  The camera took really good photos the first couple of days, but as soon as I got in the water...and I mean only for a swim, no diving... the screen went black. This was day three of a 12 day trip.  I was unable to use the camera for the remainder of my trip.  Once I got home, I turned on the camera just to see what would happen...and sure enough, the screen was working again.  Perfect timing.  For a camera that advertises as a deep water use camera, it is definitely a lie!!!!!!!!!  If you are looking for a camera to use in the water, I would pass this one up. You will regret it.  Lucky enough, Amazon is so great that they let me return the camera without an issue.", "Date": "August 25, 2013"}, {"Title": "Seriously... a piece of crap.", "Author": "Jacquelene Ambrose", "ReviewID": "R34A3SDJQETOM8", "Overall": "1.0", "Content": "I have joined the ranks of the very disappointed Nikon consumer.This camera died after only 3 days on a Hawaiian vacation. Barely in the water.Bummer.What a disappointment.Seriously, save yourself the aggravation and don't buy this piece of crap.Amazon on the other hand is stellar in customer service.Gave me full refund. Thanks Amazon!", "Date": "September 29, 2013"}, {"Title": "Do not use in water...", "Author": "Nevermore", "ReviewID": "R1W29DP15OK44W", "Overall": "1.0", "Content": "Wish I had read the warnings others had about this product failing in water. Having used several underwater cameras for years (but never a Nikon) with excellent luck, I figured the technology was pretty well refined at this point. I could not have been more wrong. This camera failed after only a few hours of snorkeling on our recent trip to Hawaii, forcing us to purchase a new camera (a FinePix XP65 which was much cheaper, not rated anywhere near this camera's depth, and which after many more days of snorkeling still works!) The failure also prevented us from taking photos during the most beautiful of our snorkeling events (Kapoho Tide Pools). Like many, my screen failed first, and the entire camera failed shortly thereafter. So believe the reviews, there is something wrong with this model; either a design flaw in the model line or severe quality control issues are causing the waterproofing to fail even when the camera is taken no where near the rated depth. Since this product completely fails to function in one of the key areas it is designed to function, it gets a 1 star rating.", "Date": "October 31, 2013"}, {"Title": "second broken camera", "Author": "ggman0", "ReviewID": "R2BADTWP69HBPX", "Overall": "1.0", "Content": "this is my second one, first broke after one day of snorkeling.  B&H; replaced with no issues, and the replacement also broke on my next trip.  I am loyal Nikon DSLR customer, do not buy this camera!", "Date": "August 25, 2013"}, {"Title": "Great features but fatally flawed", "Author": "J. Price \"Science reader\"", "ReviewID": "R2OTC8AD9ORAFT", "Overall": "2.0", "Content": "Took this camera on a once-in-a lifetime trip to the Galapagos Islands, anticipating a little snorkeling and hoping for some underwater photos.  It worked very, very well for about four days, and then it failed;  first the lens fogged and then the LCD screen went black. Game Over. The photos and videos up to then were excellent.We followed carefully the instructions for soaking and drying the camera before opening the battery compartment, and were very careful to keep the seal clean. On our trip, the same kind of failure happened to another AW 110 and a brief search of the web reveals that many other users have reported exactly this failure mode.  There is evidently a fatal flaw in this otherwise nifty camera. If you have an AW 110, I recommend against using it underwater, ever.We contacted Nikon customer support, and tried to talk with the least helpful, least informed customer representative I have ever run into. She said she would send instruction for return, but never did.  Fortunately, Amazon customer support was exactly the opposite, and so I am anticipating that we will get a refund thanks to Amazon.", "Date": "August 4, 2013"}, {"Title": "NOT WATER POOF - I HATE IT", "Author": "carlos", "ReviewID": "R2F7ZVL1850LZJ", "Overall": "1.0", "Content": "THE SECOND TIME I TOOK IT TO THE BEACH (DID NOT EVEN TAKE A PICTURE INSIDE THE WATER) IT STOPPED WORKING, IT DOES NOT TURN ON. THIS IS NOT WATERPROOF CAMERA, THIS IS A VERY EXPENSIVE CAMERA FOR THE POOR QUALITY.", "Date": "October 16, 2013"}, {"Title": "Poor photo quality, broke in under 30 days", "Author": "alysania \"alysania\"", "ReviewID": "R2DY29I72EHE04", "Overall": "1.0", "Content": "I would NOT recommend this camera to anyone.  The photo quality, even above water, is not that great (my 5 year old Canon P&S; still does a better job) and beyond that the camera stopped working in under 30 days.  We purchased this to go snorkeling on vacation.  Before we even got to the snorkeling location, the battery had died (maybe 20 photos in), and with a fresh battery, the camera wouldn't turn on.  I noticed the next day there was condensation behind the screen, and water in the lens area.  The camera had been dunked in water here and there, splashed and whatnot, but not immersed for a long period of time, or anything deeper than 3 feet.I contacted Nikon customer care who told me that the camera wasn't powering on because I used an \"unapproved\" SD card (Samsung).  There was NO NOTICE ANYWHERE in the box about using only approved SD cards - nothing in the quick start guide.  It's allegedly in the manual (included on CD), but I have NO idea why they wouldn't put a warning in the box or on the camera if it's that important.  Beyond that, there's water in the camera!  Might that be the reason why the camera failed?  I'm INCREDIBLY disappointed with support.If, for any reason you're thinking about buying this camera, don't.  Get a regular P&S; and a good waterproof bag like an aquapac.", "Date": "September 17, 2013"}, {"Title": "The camera is not waterproof.", "Author": "Diego", "ReviewID": "R3F9YU16NVVSM5", "Overall": "1.0", "Content": "I put the camera in the water and the display does not work more. I had to send the camera to Nikon Brazil and now I am without the camera.", "Date": "July 28, 2013"}, {"Title": "Love the picture quality; extremely disappointed in the waterproof capability!", "Author": "Marianne", "ReviewID": "R1DR1BXE3JM66Y", "Overall": "3.0", "Content": "I cautiously chose this model a little over a month ago because it was a Nikon camera and my previous point and shoot unit (which was placed in a waterproof case for underwater photography) had just died after 9 years. My main concern was the lack of a secondary barrier to water entry.It worked perfectly the first 3 times I used it. I was very impressed by the picture quality and no water droplets were observed inside the seal after carefully following the instructions for care of the unit after seawater use.The fourth time I used it in the surf and after about 20 minutes, I noticed water vapour on the screen. Immediately, I switched the camera off, left the seawater, washed it in freshwater, towel dried it and then sat in the sun until the vapour disappeared. I did not use the camera again that day, nor did I crack the seal. The next day the camera worked fine.When I did open the seal, I found sand particles in the compartment where the battery, card and ports are stored.I enjoy taking underwater shots but now I'm much more anxious of damaging the unit because of this experience.And while I continue to be impressed with Nikon's technology overall, I can't help in this case to be disappointed with the waterproof capability of this camera.I would advise purchase with caution...", "Date": "November 6, 2013"}, {"Title": "Screen failed within 4 days.", "Author": "Donald E. Schumm", "ReviewID": "R2WEFV7FYJ912N", "Overall": "2.0", "Content": "I'm extremely disappointed in this product.  The screen quit working 4 days into my 2 week white water rafting trip.  I would rate this as 3 stars, to give Nikon the benefit of the doubt that this was a random failure, except another couple on the trip experienced the same failure with their AW110 the next day.  Two of two Nikon AW110s on the trip failed within 5 days with the same issue.  I didn't notice any water in camera or notice any other anomalies until the screen suddenly went blank wihile I was reviewing a photo.Note that my year old back-up Pentax WG-II performed flawlessly when the AW110 failed me.", "Date": "July 3, 2013"}, {"Title": "lots to consider--beware\"wifi\"", "Author": "E. Tucker \"Looking for the Best\"", "ReviewID": "RBZNGSZ1U0WV6", "Overall": "3.0", "Content": "I bought this at Best Buy because I returned two Canon D20s to Amazon. Both specimens of the D20 had miserable audio on video playback. Yes, right out of the box. Because of this I decided to go to Best Buy where I could actually listen to some playback. Also so I could try the image stabilization effectiveness.Here is some background. I have been using a waterproof Pentax Optio W20 for the last several years. I visit Hawaii and snorkel extensively and make lots of family movies/dvds. (See link below for my 3 minute turtle video.) The Optio has a couple of issues: it makes a loud noise if you zoom while videoing, and the image stabilization is not highly effective. (I have an old man's Benign Familial Tremor.) On the plus side the Pentax has served for 5 or so years and...most importantly....it does NOT leak.In general I am not inclined to be needing special effects and am not fussy about image quality. I am willing to accept on faith that Nikon will meet muster on the image quality count. Besides, I have another almost-DSLR I use on land most of the time.I went with this Nikon after trying it at Best Buy. (Yes, I know I \"ate\" the sales tax.) I will probably keep it but there are some noticeable caveats I will mention. The camera meets my needs for IS; it zooms during video capture--which not all do--and the zoom is noiseless in my first trial.First, you need to understand the wifi is, in my terms, \"crippled\". I had hoped (presumed) the camera would be as smart as my Smartphone and be able to \"share\" pictures directly from the camera via my email or other account. Not so. Instead, all the camera does is set up an ad hoc (computer to computer) network. You connect your \"device\"  to the camera via the ad hoc network, upload the picture to the device, reconnect your device to your wifi network, and proceed to \"share\" as you choose...from your device. (The upload is accomlished via a free Nikon app you load on your device.)In my case, I do most of my emailing from my computer--a Mac Air. I may as well remove the sd card from the camera and put in into the card slot on my computer. (I hate cables, and Nikon is not my friend in this regard. Their camera cable appears to be proprietary; or at least it is NOT a micro or a mini USB.)You can also control the camera using the on-device app. Why would you want to do this? Sorry to display my lack of inventiveness.Note: In Nikon's wifi design a computer such as my Mac Air is not a device...it has to be an ipad, a smart phone, or an android tablet. The wifi would make sense if your home base is such a device. Many devices--esp. iPads-- do not accept SD cards so the wifi would be a way to get an image transferred from the camera to the device.Note also: Movie files cannot be transferred using the wifi app. The Nikon website advertises that they can be so transferred but the Nikon app says they cannot. You probably would not want to transfer movies via wifi anyway due to the file sizes involved.Another annoyance with this camera is the menu/submenu displays. Under some of the menus there are more sub-items than can fit on the screen, so scrolling is necessary. Fair enough. But there are no up/down indicator arrows to tell you if there are more submenu items, and whether they are available by scrolling up or scrolling down.In time I may come to find utility in the GPS capability but for now I am thinking I will leave it off. I always know where I am when I take a picture and I am not into geo-caching.Given that GPS will take more battery power, you may be interested in the batteries I just got from Amazon. link: Pack Of 2 EN-EL12 Batteries for Nikon Coolpix AW100 AW110 S31 S800C S6100 S6200 S6300 S8100 S8200 S9050 S9100 S9200 S9300 S9400 S9500 P300 P310 P330 S$12.99 for the two.They are rated at 1700 mah. The Nikon battery is rated at 1050 mah.Minor item: the charger comes with a 6' cord. Travelling pain. The Canon charger plugged directly into the wall with folding prongs. Much more compact. I am thinking about cutting some length out of my cord.I have not tried the Nikon underwater. I do like the door closure mechanism. It seems very positive and because to lock it you are turning a wheel--essentially a gear....I am believing there is more mechanical advantage to make the seal.Turtle video[...]", "Date": "April 25, 2013"}, {"Title": "Stopped working after one use", "Author": "A. Le", "ReviewID": "R1UKHTX21675U4", "Overall": "1.0", "Content": "I am horribly upset I did not listen to other reviews.  I missed so many chances for photos on my recent trip because the display screen stopped working after the first use.  The pictures that it did take turned out great but this is quite expensive for a one time use camera.I was able to contact amazon and they were able to provide a full refund.  Amazon customer service is never a disappointment, unlike this product!", "Date": "October 15, 2013"}, {"Title": "Black Screen after 3 days", "Author": "Neophyte", "ReviewID": "RFNT7SCRMMYGI", "Overall": "1.0", "Content": "my advise....dont buy this last minute before a trip...this is why...Payed the extra fee for fast delivery as I was traveling to europe and wnated to make sure I had this super camera (on paper) before leaving.  While in spain took a less than 10 pictures and my dysplay became black and would show every menu the camera has available but no picture.no way to return the camera I stucked with it and google a possible cause or solution for it...come to find out hitting it on the side of the lense worked...this became frustrating and family came up with the game of passing the camera around and see who made it work by hitting it...long story short after many days of frustration I decided to do a \"drop test\" now camera has a scratched and most likely cannot be returned....I'm now the proud owner of an expensive paper weight", "Date": "August 28, 2013"}, {"Title": "Mixed Bag - May Update after More Time with This Camera", "Author": "NCBean", "ReviewID": "RANM61B33S4D", "Overall": "4.0", "Content": "I like to keep a point-and-shoot on my person, and I'm tough on cameras. My third compact Canon (and second Elph) in the last decade finally bit the dust last month after I dumped it in a saltwater creek. Nikon's new, tough AW110 seemed like a good next choice for the clutzy, outdoorsy type.Canons are durable enough; that was by no means the first time I dropped that Elph--just the last time :-/  But the waterproofness, shockproofness and WiFi in the AW110 roped me in. Still, I'm a Canon fan, so that's where I'm coming from as I review this Nikon. I've also only had the Nikon for 2 weeks, so I might update this review later.In summary, the Nikon AW110 isn't as slick as comparable Canons; it's slower, with fewer options. But its ruggedness gives me confidence in packing it to head out on the water or into the wilderness. And despite its drawbacks, the photos that the AW110 are producing are what earn it 4 stars. More details:CONS- Too easy to pick up lens flare on sunny days.- Manual is EXTREMELY incomplete, and I'm having trouble finding camera forums or tutorials online to fill in the blanks.- Lens is at the top left on the camera, and for some reason, my finger wants to go there, so photos occasionally have fingertips in them.- Contrast is too strong in high-sun situations. Switching shooting mode can help, but it seems silly and time consuming to continually adjust shooting modes. I've defaulted at leaving it in \"easy auto mode,\" letting the camera choose, with mixed results.- Very few self-timer options (no custom option).- Slow turnover time after a photo is taken (a full few seconds more than Canon) and \"continuous\" photo option (find this in shooting mode --> scene mode --> sports) is slower and much more limited as well. I'll be experimenting with smaller photo-file sizes to see if that speeds it up.- Too many steps to shift over to macro mode.- The little lens gets dust and dirt on it that makes a big difference in photos if  not caught. I haven't found the best cleaning methods in the manual. The glass over the lens seems tough, which is good because, again, I'm hard on cameras and have already been resorting to using a dry edge of a towel to wipe water and dirt off the glass.- Charger is huge. Really, Nikon?EHHH - MIDDLEGROUND- Altimeter is a cool idea, but I can't figure out how to calibrate it using GPS, and you're supposed to set it \"every time\" you use it (that's about all the manual tells you regarding this feature), or its accuracy isn't to be trusted. That's clunky.- Photos almost always need lots of editing (the Canons could rock out photos that didn't need as much help), but edited versions turn out generally more amazing and dramatic than what the Canons produced. - WiFi only links to mobile devices with a (free) Nikon app downloaded. Even on my old Android, this worked well, but I'm still disappointed it doesn't connect to a laptop.PROS- Edited photos are stunning: sharp with good color.- Underwater seems to work nicely.- Macro takes too to switch to, but the camera takes great pictures in this mode.- Feels durable; I have confidence in its toughness.- Nice size and weight; good pocket fit.- I know it's cheesy, but I like how the strap works (Canon Elph just came with a wristlet that attaches to a hole in one side of the camera. The AW110 has a long neck strap that attaches to both sides and is easy to tether to things like bikini straps).- Compass works well.- Fast setup: controls look like Canon and are easy to learn. Charge the battery, load it up with an SD card (not included), and shoot!", "Date": "May 13, 2013"}, {"Title": "Worked Well for One Snorkeling Trip, then died", "Author": "D. Higbee", "ReviewID": "R1XX4O9WTDWKP6", "Overall": "2.0", "Content": "I must revise my original review.  This camera worked very well for my first snorkeling trip.  I have just returned from my second trip, and I took very special care of the camera, as previously.  It died on my second day or snorkeling - actually the LCD screen stays black, making the camera unusable.  We were in  Maui, and it was very disappointing to not have pictures to bring back.I took this camera to Grand Cayman for a snorkeling trip.  It was in the ocean for 6 days, often twice per day.  As a newbie at underwater photography, I had a lot to learn (still do!).  I was pleased with this camera's performance.  With adequate lighting, and clear conditions, I got some nice images.  The underwater mode kept colors from becoming too blue, and images were generally pretty sharp.  If you set the camera to \"Easy Auto\", it switches to underwater mode as soon as it hits the water.  Many of my images needed some sort of color correction, depending on the conditions, which can change frequently  and dramatically underwater.  Videos were great, except for lens noise during zooming.  The screen is tough to see underwater, especially in bright mid-day sun.  (From what I've read, all similar cameras have this issue to some extent).  Sometimes I felt like I was almost guessing, which was made more difficult because the lens is on the upper left of the camera, rather than centered.I had no problems with leaking or fogging, but I was very careful to rinse and soak the camera in fresh water, and thoroughly air-dry for at least an hour before opening the camera.  I never opened up the camera outside either, to avoid fogging from humidity.  The camera is quite small, and comfortable in my hand.  It feels \"tough\", and well-made.  It was a good choice for my needs.", "Date": "May 12, 2013"}, {"Title": "Piece of garbage - both camera and service.", "Author": "Matt M.", "ReviewID": "R3ME3DWATBEVJD", "Overall": "1.0", "Content": "I purchased this in May and used it 5-6 times - mostly in the pool. I took it to the beach and it failed after second swim in the sea. Completely failed - see pictures on the camera page. I had Pentax Optio W80 underwater camera for about 3.5 years; took it diving quite a few times and used a lot before it failed this spring. I decided to go with Nikon because you supposed to be able to take it to 59 ft - but it failed at 5 ft!Amazon refused to do anything about it because it's more than 30 days from the date of purchase. So you can return the product on a whim the first 30 days and not a completely broken product afterwards.Nikon charges for shipping the camera back and then decides if it's their fault or mine that the camera fails. Somehow I think that whatever the results - it's my last Nikon purchased.", "Date": "September 5, 2013"}, {"Title": "just buy it!!!", "Author": "Jesse Benway \"jbenz\"", "ReviewID": "R2PG2D4RGHQ251", "Overall": "5.0", "Content": "After seeing the negative reviews on my beloved Nikon Coolpix I have to write a review.  I have had this camera since it first was released, that must be  2 or 3 years ago now, I forget because its been that long...  It has never leaked, it has never broken when dropped and I have dropped it dozens of times, I have stuffed into luggage that has been handled by baggage handlers dozens of times. It has been in the water for HOURS at a time snorkeling in the Caribbean, it has been dropped a bazillion times.  This camera and I been all over the planet, hiking, camping, swimming and it is awesome.  It has taken hours of video and thousand of photo's.  I have never had a problem, btw: the quality of the photos, for a point and shoot, is freaking awesome.", "Date": "December 5, 2013"}, {"Title": "Could the Leaks & Black Screen problem be due to \"negative\" air preasure from flying?", "Author": "Barkyhill", "ReviewID": "R34XSN25UZHMRU", "Overall": "3.0", "Content": "I'm also looking for a waterproof snorkeling camera to take to the Caribbean on a cruise and am a big fan of Nikon.After reading these reviews, I wonder if the AW 110 (and the AW 100) is subject to \"negative atmospheric pressure\" issues - When you depart on your flight to these tropical vacation locations the camera is at your local pressure (+/- local whether changes).  During the flight, the camera is at 8,000 - 10,000 foot equivalent pressure in the cabin or baggage compartment.Could this be blowing out the seals?  Damaging the LCD cover?I saw a comment from someone after at trip to the Alps or Himalaya mountains, saying that the camera screen went black & could not take pictures ~100 ft. below the summit, so they could not take their summit pix, but returned to normal once they stared down and crossed this 'magical' threshold...This problem MAY be solved by simply unsealing the camera (open/unseal the battery compartment)  when traveling to your vacation spot by air.Thoughts????Now (2/7/14) Nikon has introduced the AW120 with an f2.8 lens.  Decisions, decisions, for ~$100 more than an AW110, this begins to look like the price of a mid-compact camera or a plastic dive case for my DSLR.", "Date": "March 3, 2014"}, {"Title": "Jungle tested", "Author": "Themaniam1", "ReviewID": "R13EW0QASCG3J8", "Overall": "4.0", "Content": "Excellent for the wet out doors, very wet out doors.  Four stars for the Cons.  I bought this camera for my daughter who is a college student that was going to do research in the Amazon jungle at the Tiputini remote research station in Equator.  She was there for two months, used the camera daily and the photos it produced were research quality.  It rained almost every day and the official high end SLR was quickly left behind because Coolpix's high quality of pictures and the fact the it needed no protection from the elements.  She took a little over 3500 photos, yes 3500 and most were great.Pros:  The macro worked very well, the video was good with good sound. Does very well in the limited light of floor of the Jungle once the flash was adjusted. It was easy to use, carry and had good battery life.  Waterproof! It worked great in the pouring rain of the Amazon day in and day out. Takes rough use such as bouncing in a pack, being dropped and bonked into trees. Small enough to use one handed with small hands.Cons: The battery door seal let just enough water vapor in to fog the lens sometimes (a little light oil rubbed on the O ring fixed it mostly.  The battery is proprietary so it is best to bring another so one can be charging will using the other.  It is hard to switch modes quickly and hard to manipulate the lighting.Cannot comment much on the GPS.  It did tell how high up in the tree canopy she was but down on the jungle floor it had a rougher time acquiring her location.  Maybe the dense foliage dampens the signal.Her co-researchers openly stated they were jealous of the fact the she could use hers anytime anyplace. If you wish to see some of her pictures, you can go to her jungle blog at http://www.amazonandbeyond.blogspot.com/.  The first month was sent in low quality so start in August to get the high quality, be sure to click on the photos.", "Date": "December 7, 2013"}, {"Title": "Takes Decent Pics, but Crashes Regularly, Wi-Fi is a Joke and it DOES NOT GO 59 FEET DEEP", "Author": "BVaria", "ReviewID": "R1V50BLRJLBZG", "Overall": "2.0", "Content": "I bought this camera as I wanted a more durable point and shoot that could handle cold temps for Skiing and underwater for Scuba diving.  I specifically bought this camera over other ones due to the 59' depth rating, which is about 20' better than all of the competition.  Overall, I was impressed by the specs, and I bought it.Initially, I was also excited to use Wi-Fi, figuring that I could just make it an Access Point, connect to it via SMB/CIFs and then pull images off.  Alternatively, uploading from the camera to a SMB/CIFs/FTP/Dropbox anything would've been nice.  It turns out the Wi-Fi features of this camera are basically unusable.  I can control the shutter from an app and see pictures remotely, but there's no way to get images off the camera via Wi-Fi which seems like the low-hanging fruit feature that makes Wi-Fi in a camera worthwhile.  Anyways, not a deal breaker, but just a disappointment.The camera seemed to take good pictures.  Not great, but considering the size, lens, etc. the pictures aren't bad and met expectations.  However, I found that while on vacation, the camera would regularly freeze.  The LCD screen would show live video of what you were looking at, but none of the buttons would work including Power On/Off.  The only way to rectify the freeze was to remove the battery (NOTE: this is not something you can do underwater).  The freezing seemed to happen more often when taking multiple photos in short time.  The camera would start to get a bit warm and then freeze after nearly every photo.  If you let it cool down, it would work well for a bit then start freezing again.  Fortunately, when I went diving, it never froze despite heavy use.  I hypothesize that underwater keeps the camera cooler and prevents the overheating/freezing condition.  It's worth noting that while it was warm outside when I used it, it wasn't that hot.  Max temps of 85F/30C.While diving, the camera worked well until about 30' deep (less than 10M).  At that point, you could start to see the LCD screen convex and would see bubbles form in between the glass as the pressure was making contact from the outer glass to that actual LCD panel.  At around 35', I started to get random errors from the camera such as, \"Cannot support this SD Card\" and other unusual behavior that made taking pictures impossible.  Once coming back to 30' or less, it would immediately start working again.  I did dive to about 50' with the camera, and it didn't break, but I left it off at those points since it wouldn't work anyways.All that said, I believe the 59' water depth is basically probably how deep you could dive with it \"OFF\".  Perhaps going lower than 59' could cause actual permanent structural damage.  In my experience, this camera did go down to 50' and survive the dive, but it does not actually function properly much past 30' deep.  I took it on three dives and this condition was repeatable all the time.  The screen bending at 30-35' really makes you hesitant to dive any deeper.I bought this camera at a local warehouse store with a pretty liberal return policy.  I will likely return it this weekend as it clearly doesn't live up to the expectations and with the freezing feature, it is hands-down the least reliable camera I've ever owned.Other final gripe:  There is no way to charge the battery via a cable. You must remove the battery and use the external charger.  This is inconvenient when traveling as you have to bring the charger which is fairly sizable and has a long cord, etc.  I preferred my past cameras that used Micro-USB to charge; with those I can just charge it right off of my computer's USB port and not have to bring more chargers and international adapters.  I understand it's waterproof, but there are already two other ports (HDMI, etc) under the battery cover.  It would've been thoughtful to allow cable charging from under the waterproof port.I gave it 2 stars rather than 1 because it did take good pictures and video and the battery life exceeded my expectations.  However, Nikon's overzealous marketing departments should be ashamed.  Any device intended for diving should function to the designed depth and even more.  That's diving-101.", "Date": "October 30, 2013"}, {"Title": "Not impressed", "Author": "Charl Scheepers", "ReviewID": "R1EB2NPG0XQRPX", "Overall": "1.0", "Content": "Got this camera this morning, obviously super excited to open it up and start using it. As I took it out of the box, I've noticed brown rust marks on the inside of the lens cover; the marks were mostly in the corners and then two spots towards the middle. Once switched on you can actually see two blurred spots as you move the camera around and of course they are visible in every single photo taken. It looks like the camera was water tested, got some water in (went unnoticed) and eventually the leaked rusty water gathered on the inside of the lens cover. How does leakage/water damage like this make it past quality control?!If this camera already shows signs of water damage the moment you take it out of the packaging then I can only smell disaster.This camera is going straight back to Amazon for a refund.", "Date": "October 8, 2013"}, {"Title": "Great Pics but LCD Screen Died!", "Author": "Renee Redys", "ReviewID": "R37TTOL6SRO2UX", "Overall": "2.0", "Content": "The camera indeed takes great pictures, that is just one of the reasons I bought it.  On our trip to Hawaii, the LCD screen died so we have to send it in for repair.  The camera is only 2 months old and was never used before this trip.  Very disappointed since I did a ton of research on many underwater cameras and with the Nikon name, I thought that this would have been a better quality product. Buyer beware!!!!!!", "Date": "September 30, 2013"}, {"Title": "New model that Leaks water!", "Author": "Marcos", "ReviewID": "R1TA7D9KNYXX17", "Overall": "1.0", "Content": "Hi!I recently bought this camera, theoretically submersible up to 18 m... after a few days of use, doing snorkle, the screen started to blink, and finally, switched off... for ever! The review of Larry found a similar problem, with fog coming from inside lens, with more use, say good bye to the camera!The model AW100 had the same leaks, and there are around 70 opinions that report it! I should have read that before, to avoid this camera, even worse than 100?Now, I have to send this camera to NY, USA, from Spain... but I have a Nikon Technical Service that I could go walking! No help from Nikon Technical Support, even they tried to prohibit me to post regarding this issue! Incredible, they try to hide problems with the model!I have to Pay shipment, pay taxes, pay everything... and when it comes back, I will never use it again with confidence... leaked at 1 m depth!!! The battery compartment perfectly closed!1 year warranty... a lot of troubles to get it repaired, and later... after 1 year, can you trust in it?Very poor Nikon service, very poor answer, frustrating... really dissappointed!Take care if you decide to choose this model. If you answer, is Nikon Coolpix AW110 really waterproof? The answer is: No!", "Date": "April 12, 2013"}, {"Title": "Good for Hybrid Land/Sea, but poor on features", "Author": "MrRedskin", "ReviewID": "R26RKDGFL8S63R", "Overall": "3.0", "Content": "I bought this specifically for our honeymoon and only wanting to haul around one convenient camera for pictures both on land and underwater while snorkeling.  I was very impressed with the underwater images and video I captured.That being said, here is why I'm returning it:  GPS and wifi.I got some depths that were anywhere from 4-50ft off.  On Kauai and Maui, I could be standing at sea level and one would read 6ft and the other time 40+ and vice versa.The biggest complaint is the wifi function.  I wanted to transfer images to my phone and tablet most every evening to make sure I had them stored in a secondary location.  I believe I maxed out at 5 images transfering at one time before the connection would be lost.  When this happens, the camera becomes completely unresponsive and requires a battery pull.  I am NOT ok with this.  Also, when the battery is at half charge, the wifi option becomes completely unavailable (not even able to choose to upload).", "Date": "July 3, 2013"}, {"Title": "3 months", "Author": "A. MUEHLENBRUCH", "ReviewID": "RT12J5XKV6U1V", "Overall": "1.0", "Content": "Purchased this camera Christmas 2013.  By the end of February this camera would no longer accept a charge.I have the warranty but to get it fixed I have to prepay all postage/shipping/insurance and delivery costs to the repair facility.If you want a camera that is actually waterproof / shockproof, I recommend that you purchase the Nikon S31 instead.", "Date": "March 12, 2014"}, {"Title": "Great P&S;", "Author": "Jane of the Jungle", "ReviewID": "R3L49IAVQNB83Y", "Overall": "4.0", "Content": "I am a DSLR shooter who wanted an alternative to bring on vacation. Originally I looked for a case for my DSLR but for around a couple hundred bucks, a dedicated beach camera seemed like a better idea. I read hundreds of reviews and comparisons and it came down to this, the Panasonic WG-3 and the Olympus TG-2. The Olympus felt much better in my hands as it's a bit larger and has the centered lens, but At a hundred bucks more and no better image quality, I decided on the Nikon.One of my favorite cameras was a Coolpix, so I had good expectations. The macro mode is sweet. (I couldn't get the Oly to focus macro in a store. This Nikon focuses fast and accurate in macro.) I've had this thing in the pool two consecutive days with no fogging coming into an 80 degree pool room from 15 degrees outside.With the negative reviews, I am being extra careful to follow the directions and rinsing it after chlorine exposure and not opening that battery door unless totally necessary.The movie mode is easy with good results. Underwater is great. Low light shots are sad, but it is a point and shoot. The wifi is very slick. Photos in bright light look great.This is my new family fun camera. No more worrying about the DSLR and sweet lenses on vacation. They're staying home. Most photos from the AW110 are soft but will look great in the album or on Facebook. I'm glad I bought it.", "Date": "February 16, 2014"}, {"Title": "Black screen - again.", "Author": "April A. White", "ReviewID": "R3JLQULLD422S2", "Overall": "1.0", "Content": "Purchased this camera for a trip to Curacao for snorkeling.  Tried it out in the house - was happy with it.  Turned it on again 2 days before leaving for trip - black screen.  Had never left the house.  Had never been in water.  Returned to Amazon.  Was able to purchase another at Best Buy the night before my trip.  It lasted 10 days before, again, black screen.  First time - fine, I got a lemon.  Second time - inferior product, missed out on photos on my trip, never again!", "Date": "February 16, 2014"}, {"Title": "Excellent point & shoot", "Author": "Lamar Crites", "ReviewID": "R190EB5Z9PYMD3", "Overall": "5.0", "Content": "I have had the camera for about two weeks and after reading the owner's manual this Nikon camera has performed extremely well.  I pick this camera after speaking a person on a cruise, they had one and said it was great, they then dropped in the Jacuzzi and said it was water proof and shock proof.  I have taken about 200 pictures and it does well in all settings.  If looking for a point and shoot I recommend this over a cybershot.", "Date": "January 29, 2014"}, {"Title": "First time at the sea and just stop working the display", "Author": "Filipunk", "ReviewID": "R3C0Q8ZQZY70NB", "Overall": "1.0", "Content": "At the fist time I was using the camera underwater and stopped to show the display..is all black !!", "Date": "January 26, 2014"}, {"Title": "Very very good camera", "Author": "knifebuyer", "ReviewID": "R8BFBJ6H4JSM1", "Overall": "5.0", "Content": "I have a full Nikon DSLR kit with all kinds of lenses. I love it but there are times when I don't want to carry all that around with me. Inevitably, if I don't have a camera I see a picture I really want to take but can't because...well I didn't have the camera!So I got this little gem so to carry around...always. It's basically the size of a pack of cards. It's a tough little bugger too. Waterproof and shock proof it will stand the test of being carried around. I love the gps, compass, and wifi features. I'm in the outdoors a lot so those are incredibly useful. I got polarizing and skylight filters too. Plus a lens cap. One  drawback is that the camera lens is exposed and could potentially get dirty or scratched.  But with the filter and lens cap in place this is much less of a problem.My carry kit consists of the camera, the filters, a cleaning cloth, and three charged batteries. It all fits in a small pouch that hangs from my belt. I leave the charger at home unless I'm going to be away for a long time.I've also taken this camera underwater.  Snorkeling mostly, and for that I haven't had any problems with leakage.  However, I also take great care to clean the seals of the battery hatch before taking it underwater.  Just a tiny fiber or bit of lint could be enough to cause a leak.  And there is always something like that collected by the battery hatch.  Also, I always open the battery compartment in dry, low humidity, environment to prevent internal condensation.The wifi connection is awesome but not really faster than plugging in the USB cable because It's a little cumbersome to set up.  Also, there seem to be some issues with my nikon software.  Initially I used the wifi for downloads but suddenly it started downloading unacceptably slowly.Now, here are some of the downsides:  Lens flare - Taking pictures into the sun is problematic.  They tend to get overexposed and have horrible reflections in the photo.  Battery life when logging gps - if logging every few seconds you can expect the battery to die after only a couple of hours.  I carry lots of extra batteries to cover this event.Still, all in all it's a really great little camera.  I've always got at least my AW110 with me and never miss out on those \"I wish I had my camera\" shots.", "Date": "January 25, 2014"}, {"Title": "this camara is amazing", "Author": "Jorgego", "ReviewID": "R7ZZ7VPXK2U4A", "Overall": "5.0", "Content": "I will say this is my second camera, I do love the first one that much that i went for the second one, as my wife do not let me use the other one, lol... so i get mine!", "Date": "January 7, 2014"}, {"Title": "Not Working!", "Author": "Keitha C.", "ReviewID": "RGX92BN6I1X01", "Overall": "1.0", "Content": "its probably been 3 months i gave this camera as a gift... it doesn't work the individual used it all of three times... It seems as though water got on the inside and there is corrosion! I don't want to guess the problem but since we followed the instructions something is definitely wrong.. Considering the amount I paid for the camera i didn't expect lifetime usage but definitely more than 3 months!", "Date": "December 25, 2013"}, {"Title": "Leaks in a bath tub test", "Author": "Z Moe \"Z Moe\"", "ReviewID": "R2SOU05FUKXM0C", "Overall": "2.0", "Content": "Leaked just testing this in the bath tub.  Took great close up pictures - really awesome compared to most of the cameras I have tried.  But, if the camera is going to leak in 9 inches of water I don't think I would trust it even in a pool.  Returned.", "Date": "December 2, 2013"}, {"Title": "Beware of This Camera .. It is JUNK!", "Author": "D. Lection \"Myundai1203\"", "ReviewID": "R3MLC23JPSCABN", "Overall": "1.0", "Content": "Steer clear of this camera. If you are wise you will stay away from this brand of camera also ... their repair service is INCOMPETENT. I purchased this camera on April 19th, 2013. It received light usage for the next couple of months. I always noticed how flaky the screen, focus and white balance were acting from the first turn on of the device ... but it took reasonable pictures, so I ok with it. I then took the camera on vacation, and it started to freeze up on every other picture taken. I would have to remove the battery and reinsert to reboot the camera.I sent the camera in Nikon service. It comes back, \"adjusted and cleaned\" which is code for (I have worked in the electronics business) we did nothing, cause we could find nothing wrong. The device, based on shipping time, was in the service center ONE DAY .. so no one bothered to stress test it.So two weeks ago, same issue. I am taking a couple pictures, and the camera freezes up .. I have to remove the battery to reboot. I send it in again. This time I explained in detail, that I thought based on the problems occurring that the zoom motor may be shorting, which can cause EMF noise and logic circuits to go haywire. After one day the camera comes back again .. We cannot duplicate your problem. its costs me $10 to ship this camera to their service center each time ... Why would I want to do it multiple times? You would think on the second visit, they might expose the camera to more rigorous tests, or replace the camera ... But no ... back it comes with no work whatsoever ...This is my last Nikon product. I hope this review alerts perspective customers. I have a Panasonic camera that is very similar, and it is ROCK SOLID ... Do yourself a favor ... look to another brand of camera!!!", "Date": "December 2, 2013"}, {"Title": "NOT Waterproof!", "Author": "Sunny \"Avid reader\"", "ReviewID": "R3DRMFEZQQHQVN", "Overall": "1.0", "Content": "I cannot tell you how disappointed I am with the Nikon Coolpix AW110 camera!It was purchased to use exclusively while enjoying water sports.  I recently returned from a trip to the Virgin Islands, where the snorkeling is excellent, crystal clear visibility, glorious variety of undersea life....Imagine my disappointment when this crummy camera stopped working the minute it went in the ocean!  The screen went black and the on/off button stopped functioning.(Ironically, the camera slowly came back to life after I left 2 mini silica packs into the battery slot for over a week after I had returned home.)I won't ever immerse this camera in water again, as it is obviously defective and NOT waterproof.I didn't need another 'dry' camera as I already have several. :(Nikon customer service wants me to ship & insure it ( at my cost) for an evaluation/ estimate for repair costs. I have decided not to mess around with that.Warning: Do Not Buy!!!", "Date": "November 12, 2013"}, {"Title": "Don't believe the 59' waterproof rating.", "Author": "Doug anderson", "ReviewID": "R23JSEW5HHFTHI", "Overall": "1.0", "Content": "Bought this camera last July for some shallow diving. Plans fell through until October. Finally got in the water and was no where near the 59' and could not get the camera to turn on. When I got back topside noticed water in the view finder. Took it back to the house and pulled the battery and flashes card only to have water come pouring out. Just tried to return it and Amazon said I can no longer return it.", "Date": "October 20, 2013"}, {"Title": "Best Little Camera Ever", "Author": "DrCatcher \"Dr Catcher\"", "ReviewID": "RRRNMT3C11Q6N", "Overall": "5.0", "Content": "I am a professional photographer. I usually shoot Nikon D series cameras and my studio cam is a DX.This little guy is the best point and shoot I have ever used.Easy to use and awesome for all round every day industrial use.I am also an avid Free Diver, lobster fisherman and charter boat company owner in Key West, Florida I own Dream Catcher Charters. I have had this camera to 30 feet many times just clicking away..This little guy takes some incredible underwater shots., Granted it has to be shallow for the color as the flash just is not strong enough to cut but what do you expect from this affordable package.I also have Go Pros and Use this way more..", "Date": "July 30, 2013"}, {"Title": "great travel camera", "Author": "BW", "ReviewID": "RIDJG7MYVLS5J", "Overall": "5.0", "Content": "love the waterproof and the size of the camera.  easy to learn and easy to use.  great for traveling and excursions with water", "Date": "May 20, 2013"}, {"Title": "Horrible!", "Author": "R. Chhay", "ReviewID": "R2Y6175TB5A6LW", "Overall": "1.0", "Content": "This camera is not waterproof.  Camera died on the first day at the pool in about 3 feet of water.I was able to save the camera by putting it on a dehumidifier, so now it just an expensive point and shoot camera.Really disappointed.  Would have returned it if the return policy hadn't elapsed.", "Date": "September 3, 2013"}, {"Title": "Underwater camera, overperformed :-)", "Author": "LOLITA", "ReviewID": "R1S2VYCI8CFTD8", "Overall": "5.0", "Content": "We bought this camera for our recent Ecuador trip (Galapagos + Quito) and we are extremely satisfied with our purchase. We did two months of research for a good underwater camera and all the reviews on all the different brands left us confused. We took our chances on this one because of the excellent features. And we were rewarded! It worked like a charm underwater. In clear water of course. Took amazing videos, crystal clear. It worked so well on land too! Fantastic shots and the photo quality is excellent. We loved the 'macro' feature. It is par excellence. Really enjoyed taking macro shots of all the wildlife in Galapagos. The wifi proved to be super useful. Every night my husband would transfer the day's pictures to his iphone for back up. He took real good care of the camera and followed instructions for cleaning it every time we used it underwater, cleaning any sand or dirt, etc. And it never leaked. We were very impressed with it options for shooting modes, gps, wifi, and the rest. We found only two drawbacks: The zoom isn't that great but good enough. In the HDR mode, you have to wait for a while till you can take the next shot, longer than in the auto mode. But we are not complaining! We simply love this camera :-)", "Date": "April 25, 2014"}, {"Title": "Avoid if the primary goal is underwater photography", "Author": "Ace", "ReviewID": "R291X6EW5KVE4R", "Overall": "2.0", "Content": "This is a decent camera for everyday use with a lot of bells and whistles. Avoid if you want to use it primarily as an underwater camera.1. The LCD screen is not very bright and when you're snorkeling on a sunny day, it's almost impossible to see what you're taking a photo of2. As mentioned by others, there is a gap between the LCD plastic cover and the actual screen. When scuba diving, the pressure bends this outer screen inwards until it starts touching the inner screen. The bend happens in the middle and looks like it could cause some serious damage.3. Nikon claims that the camera is waterproof to 59ft/18m. There's even a helpful depth gauge that shows up. Unfortunately, at somewhere around 16-17 meters, mine wasn't able to withstand the pressure, let water in and died instantly", "Date": "April 16, 2014"}, {"Title": "Perfect!!", "Author": "E.E.", "ReviewID": "R3GC1G8914JL9I", "Overall": "5.0", "Content": "We've been very happy with this camera. Use it all the time. Pool, beach, outside, anywhere. Haven't had any problems. And it takes really great photos. (I'm a photographer and I've been very pleased)", "Date": "March 27, 2014"}, {"Title": "NOT GOOD AT ALL", "Author": "Robert R. Traylor \"hombrerojo23\"", "ReviewID": "R3BEVHQN91BJDJ", "Overall": "1.0", "Content": "Got one camera, the waterproof seal broke for the lens and the battery and SD Card compartment.  Got a 2nd camera (same model) and the seal on the battery compartment began to leak.  Both were ordered for amazon.  The reviews were good but the product was not!!!", "Date": "March 25, 2014"}, {"Title": "Great camera, GPS is handy", "Author": "Lyn Gettys", "ReviewID": "R12RXN57CJOJAB", "Overall": "5.0", "Content": "This is a great little camera - takes fantastic, high-res pix in or out of water. Great macro - it sometimes has a little trouble focusing when you get less than 2cm or so from the subject, but the resolution is high enough that you can back out a little and then crop the shot later. I do field research and am directionally impaired so I often have a hard time finding my way back to a site where I've seen something I want to revisit. I just take a picture of what I want to find again and when I'm really to go back to that site, I get the GPS coordinates from the image details, pop them into Mapquest, and bingo! Piece of cake. Haven't tested the \"shockproof\" claim yet, but it's been underwater a bunch of times (on purpose) and does great. I like it so much I just bought two more for my helpers at work - I get to keep the orange one (although it's really closer to red) and they get to fight over the black and camo ones :-)", "Date": "February 28, 2014"}, {"Title": "Good camera so far", "Author": "ATL", "ReviewID": "R2XYSXDWGFYEDR", "Overall": "5.0", "Content": "Went snorkeling a couple of times, about 2 hours each time. Took kayaking once. Worked well underwater, no leakage. Soaked the product in fresh water to remove the salt and waited until it was completely dry. No problems so far. Land pictures were good, indoor pics OK. I recommend buying a floating wrist strap or some other wrist strap to ensure the product is secure while swimming.", "Date": "February 18, 2014"}, {"Title": "Great so far.", "Author": "rj_cain", "ReviewID": "RUT6HD3FY2YR3", "Overall": "5.0", "Content": "I wanted a good camera to bring with me on a trip to Dubai.It had to be small, durable, and have good reviews.I must have watched a dozen or more videos of this camera being abused along side other like cameras.I almost went with another close competitor because of price, but then I saw this one listed as used by a woman who won it on the Price is Right, for two hundred bucks, so I snagged it. Glad I did, this thing is great.I used to drag my D200 out on four wheeler trips, just praying I did not flip over in a mud pit or go neck deep in a water hole. Luckily I never did.Now I  just take this one, and do not worry anymore... plus it has great video, something my dinosaur D200 does not do.", "Date": "February 12, 2014"}, {"Title": "High quality camera.", "Author": "none", "ReviewID": "R2IXETLIJT3NXW", "Overall": "5.0", "Content": "This camera is very high quality. The build is tight and solid. I do not plan to take this camera scuba diving or sky diving but for a great camera to resist the weather and the occasional drop to a hard surface, this will do the job well. Easy to operate with intuitive controls, this little camera will feel great in your hands. Picture quality is excellent and equal to more expensive cameras.", "Date": "January 31, 2014"}, {"Title": "So far does everything as advertised", "Author": "Raspberry730", "ReviewID": "R2QQYDN449YQW6", "Overall": "5.0", "Content": "Used it on our trip to Costa Rica.... Took videos while zip lining white-water rafting and an underwater pictures in the hot baths ..... wi-Fi all my pictures to my iPad no problem so far everything works great ....five stars", "Date": "January 29, 2014"}, {"Title": "AMAZING", "Author": "Brittany", "ReviewID": "R15W1Q0UF4W23Y", "Overall": "5.0", "Content": "I bought this for our cruise and it was perfect!! We used this for snorkeling in the Caribbean, swimming in the pools, to riding roller coasters!! Lasted thorough all of it!", "Date": "January 26, 2014"}, {"Title": "Love it", "Author": "DLV", "ReviewID": "R365P8ZWMT40I1", "Overall": "5.0", "Content": "This is the 2nd one of these I've put into service at work (first one is still working fine) and I love them. Have used under water, in snow, rain, dropped them, these are good tools for me.", "Date": "January 11, 2014"}, {"Title": "Surprise me", "Author": "BRS \"B\"", "ReviewID": "R3C0ULOGPFG5FE", "Overall": "5.0", "Content": "The pictures from this are great.  As a point-and-shoot camera, it's perfect for any touring or quick party snaps.  I don't know who would be disappointed with the quality of the pictures.  It also takes great pictures without flash, which for me included graveyards at dusk, churches with only natural light coming in from the copulas, evening meals at candle lit restaurants, etc.).  Then you can play around with the settings and work your own magic if you want a little more control.The nice surprise, though, was the quality of the video.  I was amazed at how well lit the video is and how beautifully the anti shake feature works.  The video taken while walking down a crowded pedestrian zone turned out really nice with very little shaking coming through.  It's very smooth with great looking color.", "Date": "January 9, 2014"}, {"Title": "Outstanding camera", "Author": "Scott Wehrly", "ReviewID": "R3T6HP53811I6A", "Overall": "4.0", "Content": "The camera itself is excellent.  Beautiful pictures.  Love the features.However, Nikon could do their customers a great service by making the WiFi behave like other WiFi devices, or at a minimum offer more support features.  It probably behaves wonderfully on a free WiFi hot spot, but getting it to connect to an encrypted connection is like pulling teeth.Oh well, there's always the USB tether...", "Date": "January 7, 2014"}, {"Title": "Another Black screen", "Author": "Eric Thorne", "ReviewID": "R2STFVCR2KRC6", "Overall": "1.0", "Content": "Another voice warning you about this product.After about an hour of snorkeling I saw a little bit of fog forming between the glass and the screen of the camera.  Another 30 minutes later, the screen wasn't able to turn on.  The power button showed it was on, but the screen was black forever more.Nikon really needs to get its act together and recall these given this has been happening to so many people.", "Date": "January 4, 2014"}, {"Title": "Great camera....love the wifi", "Author": "TC", "ReviewID": "R23RCMLPFNOY4B", "Overall": "5.0", "Content": "Have seen some negative reviews with water proof but not sure I understand why.  Nikon gives you instructions to ensure that it stays waterproofed and works well if you clean it up after underwater use per the instructions.  Like all good cameras, you do have to tend to them a bit.  Great pic's.", "Date": "January 4, 2014"}, {"Title": "Waterproof  NOT!", "Author": "stephen Dennison", "ReviewID": "R29QBCW5OU9WF3", "Overall": "1.0", "Content": "The camera is not waterproof as stated! Made a big mistake buying this because I bought this for claims it was!'will not buy  Nikon again!", "Date": "January 1, 2014"}, {"Title": "Don't buy !!!", "Author": "Priscilla Whitlock-Coates", "ReviewID": "R3UUVAK8VZQB3Y", "Overall": "1.0", "Content": "I did lots of research when selecting a camera for our Carrivean Cruise. I saw the issues with the screen going black and the camera not working. The overall rating of people was 3.5 so I have it a try.Day one in the water ten minutes ( and not even going under the water) the screen turned black and I could not see the screen.I could retrieve my pictures with the USB cord. The camera still works, but I can't see the screen.", "Date": "December 26, 2013"}, {"Title": "Great Camera !!!", "Author": "ken", "ReviewID": "R235CJ81RHVPU1", "Overall": "5.0", "Content": "works great! underwater video was fantastic!! pictures are beautiful ! very good battery life and overall one of the best compact cameras I have ever owned.  I have used this camera for eight months now and have had ZERO problems. Highly recommend!", "Date": "December 6, 2013"}, {"Title": "Torn on review", "Author": "etapi65", "ReviewID": "R20LGZFGHMK7KZ", "Overall": "3.0", "Content": "This pictures and videos were incredible.  It took equally high quality land and underwater shots.  The auto-feature did great at accurately assessing the conditions and automatically switching to landscape, underwater, macro.  The GPS feature was extremely accurate.  All of that doesn't matter if it's not actually waterproof though.  It made it through my 47 foot (max depth) 47 minute bottom time dive and two snorkel trips.  Each day it was rinsed with freshwater, opened and the seal was cleaned with a q-tip to ensure no debris was around the seal.  Didn't matter, water leaked around the poor yellow rubber seal (actually it's more like the water collected around the seal and slowly snuck in via capillary action.  We waited 2-3 hours after rinsing to open; it didn't matter.  The camera still \"works\" but the screen does not, so you can't turn on the gps, can't change the function, can't see what you're shooting, can't do anything except point and click and hope you get what you need.  I bought on October 13th to make sure I had it before my November 5th trip to Fiji.  The return policy ended 1 day before I got back so I guess I'm stuck trying to use the warranty through Nikon.  We also had a Nikon AW 100 that had never been taken in the water before...the exact same thing happened, but a day earlier.  Screen is dead.  We also had an Olympus tough 8010 that's been through hell (grand cayman diving snorkeling for a week, Guam diving/snorkeling for two weeks, black water kayaking, spelunking, drops, bangs etc...) and it's still working like a champ.  Picture quality on the Olympus in noticeably lower and it has no GPS function, but at least it works.  Nikon has a serious issue with the design of these cameras.  We will be trying to get this replaced or find a way to get our money back.", "Date": "November 18, 2013"}, {"Title": "OK camera, just don't get it wet.", "Author": "Bran", "ReviewID": "R2PC199S7X7AEK", "Overall": "3.0", "Content": "The Camera died after I used it to take pictures in swimming pool.  The only time I actually put the camera underwater was to show that it was waterproof.  The screen on the back then stopped working (I could see water trapped in the screen).  Soon after the camera would no longer turn on.I had seen reviews warning of this, but I figured that they must have done something wrong.  Nope.I'm in contact with Nikon to ship to in for repairs.  They are NOT willing to pay for shipping even though their product failed, that is a really bad start to the customer service experience.***Update***After having to pay for shipping myself, the customer support from Nikon has been almost ok.  They sent an email notifying me that they have received the camera, etc.  It is listed as in for repairs, but I can only imagine that they're just going to send me a new one (though maybe there is some way they can fix water damage).  I've been having trouble with their support web site.  At both my home and work computers I am unable to actually open the links to the support page.  I can access the main page, but using any of the links on the page 404.If the camera didn't fail when it got wet it would be a pretty cool camera.  I was impressed with many of its features.  The photos it took were up to my (easy) standards.***2nd Update***A month after receiving confirmation from Nikon that they had received the camera and were repairing it for free, I still hadn't received the camera or heard any updates.  I had thought they would simply send a new one to replace the broken one. I couldn't imagine that the cost of new parts and paying someone to work on the camera would be worth it for a $300 camera.  So after a month I contacted customer support again to see what was up.  They got back to me a day later and said they were prioritizing my order.  A week or so later I received the camera in the mail.  It included a list of parts they replaced (the oled screen, and some other electronic parts the water no doubt ruined).  They camera appear to be working fine now.So the overall cost to me to get the camera fixed was less than $10 (for shipping).  But the real cost was the lost potential use of the camera.  I had brought the camera on vacation specifically because it was supposed to be so much more durable than a normal point and shoot camera.  I only have 4 pictures from that entire vacation because the camera failed.I'm upping the rating from 2 starts to 3 stars mainly because Nikon did step up and fix the issue.  I'm hesitant to ever put it in water again, but I feel safe that i'll handle being splashed or rained on better than a normal digital camera.", "Date": "November 15, 2013"}, {"Title": "Waste of money, nearly unusable in anything but perfect lighting conditions.", "Author": "Aaron Erickson", "ReviewID": "R2E4X6N8B8JRK2", "Overall": "1.0", "Content": "I purchased this camera because I heard it had the best image quality of the \"tough\" point and shoots. When you're standing completely still, shooting a stationary target in ideal lighting conditions, it produces decent photos.However, when it comes to real world use, most of your shots come out completely unusable. Blurred subjects, and horrible under/over exposure. I'm being completely serious when I say that iPhone cameras outperform the aw110 in real world use. My 8 year old midrange Canon powershot A540 outperforms the brand new aw110 in every way.  Very disappointing.I'm sending it back for a refund asap. I'd suggest looking elsewhere for a tough camera.", "Date": "November 9, 2013"}, {"Title": "More of the same: Black Screen of Death", "Author": "Peter Tennis", "ReviewID": "R1K8568D8RKLUE", "Overall": "1.0", "Content": "I have owned this camera for two months, and now I also have a broken camera. Unlike some of the other reviews, my camera has taken fine underwater pictures on several dive trips (going 30 feet or more deep), while playing in the pool, snorkeling in the ocean, etc.  As far as a general point and shoot camera, I have not been impressed (both my Canon and Panasonic were far better, more intuitive and more customizable when it came to manual modes).  But, we held onto it because we were getting some great \"in the water\" shots. Unfortunately, on our last trip, the display screen went black and has never returned. The camera seems to turn on - even seems to take pictures, but since there is no view finder and the display does not work...All in all, I wish I had read the reviews on Amazon before purchasing. Too bad. Sorry Nikon - you have lost a customer.", "Date": "November 9, 2013"}, {"Title": "Epic Fail", "Author": "Melissa", "ReviewID": "R1YJUU0YR54RKU", "Overall": "1.0", "Content": "I bought this camera to use on my wedding/honeymoon in Turks and Caicos. As previously stated by other reviews it does work great-when it wants to work. After about 5 days of using this in and out of the water the screen wouldn't turn on! We went for two weeks as it was our once in a lifetime wedding and honeymoon trip with all of our family and friends and missed out on several great pictures. Extremely disappointing to spend $300 on a camera that fails to work properly.Needless to say I will never be purchasing another Nikon camera again.", "Date": "November 5, 2013"}, {"Title": "Nikon Coolpix AW110", "Author": "Andy", "ReviewID": "R2ZV7MAUPB61O", "Overall": "2.0", "Content": "I bought the AW110 two weeks ago in the Netherlands before leaving on vacations to the Maldives. I own another pro DSLR and a number of lenses from Nikon, and I purchased this one for snorkeling shots after a quick web search, trusting the Nikon quality.The camera is a complete disappointment to say the least. After one week the whole OLED display was covered by condensation. Just one day later the lenses were also fully covered. All care was taken to access the card/battery compartment only once the camera was totally dry/clean, and the compartment was always carefully closed. I do not do any diving; only snorkeling. So the camera was never any deeper than 1 meter in the water.After noticing the malfunction I searched the web for similar problems, and the number of comments stating the exact same issue was simply awkward. I was hopping this to be a just a bad unit, but it seems to have happened to many other not so satisfied customers.Today I switched the camera on to see if the battery was still charged, and switched the camera off. Before leaving for snorkeling I switched the AW110 once again, and realized that the welcome screen did not show up. I tried to switch the camera on several times again, but nothing at all. All controls were simply DEAD.What I find quite disturbing is that besides all comments I found before on the condensation issue, I realize now that there are a number of comments and blogs stating that the camera `simply did not work anymore'.Are we really talking about Nikon here?? I mean the Nikon quality? I mean, look at all the comments on the web. This is a joke. This is an 18m waterproof / 2m shockproof camera that goes totally dead after a few days snorkeling for a few hours a day.If Nikon is still the Nikon we all used to know they should be seriously looking into a factory recall.DO NOT BUY IT. This is not an isolated case.", "Date": "October 20, 2013"}, {"Title": "Disappointing", "Author": "Will Leavitt", "ReviewID": "RSL7NN0ABA6LE", "Overall": "1.0", "Content": "Q. How do you destroy this waterproof camera?A. Put it in the water.This camera has several shortcomings, but the most glaring is that the water seals are ineffective.  The lip of the inner seal is literally 1 grain of sand wide -- even with very careful use and cleaning, it is not reliable.  After owning it a year, I took it snorkeling in 2 feet of water, and noticed a stream of bubbles coming out of the battery hatch.  Camera destroyed.But there are other problems.  The overall images lack contrast, probably because of the folded optical path.  The auto white balance is confused by many situations.  It is not uncommon to see a great image in the liveview screen while composing a shot -- say kids against backlit foliage.  When you snap the picture, the picture that is displayed (and stored on the card) is totally washed out.  It then goes back to the beautiful live view.  Sometimes changing the composition slightly would cause the camera to get it right, sometimes or not.  Very frustrating.", "Date": "October 14, 2013"}, {"Title": "What happened to you Nikon?.", "Author": "ellison allcock", "ReviewID": "R12U7Z3MSJ3NEQ", "Overall": "1.0", "Content": "Like many others I bought this camera for a holiday including snorkelling.  Like many others, the screen of my camera stopped working after a couple of days.  I would prefer to award no stars (at least one is required), this camera takes beautiful pictures when it works, but this hardly vindicates the appalling reliability that is obvious from the reviews on this and other sites.  No one wants to spend over £200 for a couple of days photography.You really need to sort yourselves out Nikon, read the reviews and weep for the prestige that your company once had.", "Date": "October 14, 2013"}, {"Title": "USB! not CD/ freezing camera", "Author": "gilk", "ReviewID": "RGHFKFVFK4L77", "Overall": "3.0", "Content": "Well, it's about time Nikon should know that there costumers don have a CD drive any more...Need the programs on a USB or of the Internet...That is one issue.I just took the camera for a trip, and the screen just froze with out any way to restart, or bring it to function, not even shot it down...The only way to reset it, was to take out the battery, and put it back in....I'll check it with Nikon's support later on, but it worries me....Got a quick response - the problem was in the SD card. Changed & fixed.By now, with more experience with the camera, and pushing it to the edge, I fined some more issues to point out:1. WiFi feature is great (tide the camera to a balloon, and took pictures with/via the tablet! great, but, there is no way to do the basic picture download from the cam to a PC...!?2. No USB charge! normally, when I'm on a hike, I have a power pack to recharge my phone and camera.Can't do that with the Nikon 110w... cant use the car charger as well....So simple, and still...", "Date": "October 5, 2013"}, {"Title": "Good camera so far", "Author": "Amazon Customer", "ReviewID": "R1976TNT6VRCC0", "Overall": "5.0", "Content": "No complaints so far.  It has survived one outing to the lake where it spent more time underwater than it did above.  Picture quality is on par with my other Nikon PS camera (S9100).  Certain colors seem a bit over saturated at times but I expected that, since my other Nikon camera does the same.", "Date": "September 4, 2013"}, {"Title": "Sand locked it up", "Author": "Traveller", "ReviewID": "RNYSTQJQE02W9", "Overall": "3.0", "Content": "Camera worked nice u/w, on a mountain hike and day to day use. However I'm at the beach in the surf, some sandy wave rolls in the camera seizes with sand in the buttons and lens.  Absolute frozen.  I rinse, Q-tip and tweeter and get no where.  I'm a semi pro photographer and love Nikon but just be aware of this one at the beach", "Date": "August 24, 2013"}, {"Title": "LCD SCREEN DISAPPEARED", "Author": "dolphnswr", "ReviewID": "R2OBKTRK5ODNKB", "Overall": "2.0", "Content": "This is pretty disappointing. Used once under water and it failed the test. Like others have reported the LCD screen just quit right smack dab in the middle of the snorkel of a lifetime. So although it is a great little camera that produces great underwater shots for its size. This camera did not ultimately perform. Thank goodness for Amazon's Return Policy. I really wanted this camera to work.", "Date": "July 9, 2013"}, {"Title": "For the cost, the best camera I've ever owned", "Author": "Yukon Jack", "ReviewID": "R1YY081B3IYUN6", "Overall": "4.0", "Content": "As a Pro photographer, I have bought 21 top quality cameras over the years, including Hasselblads. I have been looking for years for a well built, feature rich, waterproof compact camera that I can leave in my car, and not panic some thief is going to walk off with an $8,000 camera and lens and motor driver.It has a solid internal memory, and easily accepts the 64 GB external memory card I put in it.It's waterproof to -59 feet, GPS, WiFi, shockproof (6.6 feet), Freeze proof, 5X internal Zoom lens, takes 1080 HD Stereo Video, etc., etc.The mystery is how all this can be manufactured in a package under $250.Screen protector? My top-of-the-line Canon and Nikon cameras didn't come with one either. I bought a top screen protector for $6, two minutes and you're protected. I don't consider this a negative.My iPads and iPhones also needed after-market screen protectors.When I anchor this camera 59' under water, I'll give it the 5th \"star.\"", "Date": "December 3, 2013"}, {"Title": "never again!", "Author": "Connie G. Smith", "ReviewID": "R3BMBPPUKUOBNC", "Overall": "1.0", "Content": "If your main reason for purchasing is the underwater feature, SKIP IT!! Excellent pictures until one trip to the beach a 30-40 minutes of on and off underwater scuba pictures and it began to fog up on the back screen and the lens. A few hours later and it was done! Will no longer even turn on.", "Date": "November 24, 2013"}, {"Title": "Wonderful Investment", "Author": "Stephen", "ReviewID": "R2AMHDQIMTEI95", "Overall": "5.0", "Content": "I purchased this product for when I travel.... Its small and durable (but haven't dared to drop it yet.)  This is my first Nikon camera because normally I am a Canon guy.  The features of this camera are amazing for such a small camera...  Being able to download the pictures with the built in WiFi connection is a great feature for when you only have your camera and your phone or tablet.  Also having the built in GPS receiver is great to have for when you travel...The picture quality is also amazing.I tested the waterproof feature while at the beach this weekend and it works just as well afterwards... (after being on the beach and in the salt water make sure you wash it with tap water to remove any of the film that the saltwater can cause.)  I took a few underwater pictures in the pool that came out as clear as it was above water.Also as a reminder *** use the built in WiFi if you want to copy the pictures off the camera after being in the water because you need to make sure the camera is dried completely before opening the water tight battery and card reader compartment... for those people that said after they used it underwater for the first time I can see how water can drip inside of this compartment if you aren't careful.  The outside shell of the camera is what makes this camera waterproof... the components inside the camera arent.***", "Date": "October 1, 2013"}, {"Title": "Not exactly waterproof!", "Author": "W. Walsh \"Whit\"", "ReviewID": "R2UZFWBM8ZLOS5", "Overall": "2.0", "Content": "Great price for an underwater camera if it had actually been waterproof.  I bought this to take photos in the pool and ocean with didn't take it under deep and it got water in the screen and in the view area!", "Date": "September 30, 2013"}, {"Title": "It keeps freezing over and over", "Author": "Rolando Perez", "ReviewID": "R1Y9NRM5RLDQBA", "Overall": "2.0", "Content": "First I would start saying that my father and I are fans of Nikon products. Even in our natal Cuba Nikon is a brand that most people recognize and think as a quality camera. We have had several Nikon cameras over the years. I do a lot of kayaking, snorkeling, hiking etc so my last Nikon camera a Nikon cool pix that I loved fell into the water and die. I decided to buy another Nikon cool-pix but this time the waterproof version. I got the camera from Best buy. At the beginning everything was fine. It took exelent pictures, the underwater pictures were ok but I expected a better quality from Nikon. The underwater video was crappy but I have a Kodak play-sport that I mainly use for my underwater video shoots so no problem on that. After 2 trips to the reef the camera started to freeze on me. I was able to take 10-15 pictures and then it freezes I was able to do nothing not even turning the camera off. So I find myself swimming in the middle of the reef trying to wade the waves and keep the camera over the water so I was able to take the battery out and then put it in again that way I was able to shoot another 10-15 pictures and bang it freezes again and again. The problem got so bad that at the end I was only able to take 1-3 pictures before it freezes. I went to best buy and bought the last model of the Olympus Tough series the TG2. Nikon is a good company no doubt on that but this is just their second waterproof camera so some glitches and problems are expected, Olympus has a long long history of building waterproof cameras I hope Nikon will fix this and improve on the next model they launch.Another problem I found is that in the Nikon camera the lenses are in one side of the camera and that makes very easy for your finger to appear in the picture. Some times you are diving and a shark appears in front of you and you got the perfect moment to take a picture. you are not going to have time to think where to put your hand correctly on the camera. That is another feature I like from the latest Olympus tough TG2 the objective is in the center of the camera just like in any regular camera. I don't know what is the point on having the objective to one side of the camera.One feature that Nikon should add is the possibility to add different lenses to the camera, fish eye lens etc. Being a rough camera you are going to use it in many different extreme environments an for taking many different extreme pictures so the ability to have difference lenses will be nice. Olympus TG-2 have this option. Hope this review helps", "Date": "May 12, 2013"}, {"Title": "Good Purchase", "Author": "M. Widner \"Huckleberry\"", "ReviewID": "RBPA5MX58QJRJ", "Overall": "4.0", "Content": "I wanted to replace my Olympus Stylus Tough 8000 with this camera because of the significant number of technological advances and features now being offered in this Nikon vs. the my older Olympus.  I chose this Nikon because of both customer reviews and feature preferences.  I use this kind of camera for boating, hiking, work, mountain bike, hunting, shooting and other related hobbies.  I used the Olympus during my military deployments and I believe this camera would have been even better to have back then.  The following review points are for general users and not digital camera experts:  Will use this product a little bit longer and follow up on my general user review.  PRO1. Camouflage skin is cool and overall camera is smaller in length than my Samsung galaxy s22. GPS works great and acquires fast with a solid lock on location3. Image quality is very sharp and clear with lots of quick image effect options4. Very light weight compared my older Olympus5. Movie setting is one button push and you are recording.... this is a great feature eliminating all the dial setting first6. WiFi took all of 45 seconds to set up and works great7. Battery life is pretty much all day long of use at an amusement park with kids so you know lots of pictures8. Nice big screen on back9. Has a filter adapter which is good - haven't used it but it's made of plastic and seems kind of cheesy.10. Battery and Memory card compartment door is secured by a large locking/rotating knob.  CON1. Lens does not have an automatic shut off cover - this is a good feature on my older Olympus (you do get a little brush)2. Easy Auto Setting is terrible - no user controls and doesn't adapt well to changing environments3. Little bit expensive and does NOT include the SD card in the box4. Buttons are plastic and small.  My thumb easily covers the whole control area.5. Zoom toggle switch is in an awkward position but works ok6. Action button and use is annoying and not as good as Olympus tap function.  Don't plan on using this much.", "Date": "April 24, 2013"}, {"Title": "Screen failure", "Author": "CloudStorage", "ReviewID": "R1LG9X61NTFIXD", "Overall": "1.0", "Content": "The negative reviews about the Coolpix AW110 screen going blank happened to mine, but fortunately within the warranty-return period.  The positive reviews are also true, particulary the good picture quality.  So I just wanted to warn others that if you take this underwater, there's a high chance its screen will fail.  Even if you follow the rinsing procedures.  I don't think camera manufacturers issue recalls, and only firmware updates.", "Date": "June 3, 2013"}, {"Title": "Poor design choices, locked up constantly.", "Author": "Jesse J Thompson", "ReviewID": "R3FD2ZLWARRDTY", "Overall": "1.0", "Content": "I bought this camera to take on my honeymoon in a few weeks. Having received it and started fooling around with it I will absolutely not keep it after the vacation.At first glance this is a well built camera and I'm excited to do underwater photography. It has a good depth rating for the money. I'll simply break down what I find to be the pluses and minuses.PROS:Well builtGood button layoutImage quality is good. Don't have much to compare it to but I like what I've shot so far.It is more than just waterproof. It is also drop proof to 6.6ft. This would be a good camera to take hiking too.CONS:You must remove the battery and charge it externally. Not that big of a deal but when you do this you lose all of your settings. You must set up the camera all over again every time you charge it. Ridiculous.Wireless access is off and greyed-out in the menu. I have no way to activate it apparently. The menu does not mention it whatsoever.This is my second Nikon camera, the other being a mid-range DSLR I bought 4 years ago. It will be my last. Both cameras had strong points but ultimately had such irritating drawbacks that they weren't worth owning. It certainly isn't a piece of garbage, but unless you need to shoot underwater I would avoid this camera.UPDATE: I ended up returning this camera immediately after returning from the honeymoon that I bought it for. The camera locked up CONSTANTLY which necessitated pulling the battery out. To do so you must break the seal so while it was somewhat possible when we were walking waist deep in the water off the beach (still not a good idea though), it was completely impossible while snorkeling obviously. It nearly ruined my ability to record my honeymoon, and I lost a lot of good images and videos because it would be locked up while snorkeling and I wouldn't know it (it is nearly impossible to make out the screen while underwater so you basically just point and click and pray it is recording).", "Date": "May 8, 2013"}, {"Title": "Nikon COOLPIX AW110 16 MP Waterproof Digital Camera with Built-In Wi-Fi", "Author": "dslee", "ReviewID": "R1W3WHVC27SYDF", "Overall": "1.0", "Content": "Camera fogs up pretty fast - then you have to dry it and then it fogs right back upHad the camera on the countertop inside, and when I looked at the camera, not only did the lens fogged up, the back display fogged up too.Also, I have lost the back display, blank/black.When I turn the camera on it will take pictures, but nothing to display.When I hit the record button, the camera shuts down most of the time.  Sometimes it will record the video.What a waste of a camera!For what pictures and videos I did take, they were good, but what good is the camera if it keeps fogging up on you.", "Date": "May 24, 2013"}, {"Title": "This refurbished camera did not perform up to expectation when under water", "Author": "Michael See-Guan Yeo", "ReviewID": "R5YYCSQ51ZD55", "Overall": "2.0", "Content": "I just took the camera to Maldives few days ago and used it at the beach front seawater. The camera was ok initially but later it was not functioning. After drying it and sitting for a few hours, all electronic functions & LCD were back to live by itself as water inside the camera dried out. However the lens remain full of vapour hence I still could not take sharp pictures and I have to wait for three days till it gets better. The camera looks 90% recovered today. I need to bring it to the Nikon camera center for detailed check. Please could you raise a case for me to bring it to the Nikon service center in Singapore?", "Date": "May 30, 2014"}, {"Title": "camera scuba", "Author": "kenneth young", "ReviewID": "RJUK0CWP33C4L", "Overall": "5.0", "Content": "I bought this camera so I can go a little further underwater, because my last nikon only went 33ft and crack when I dove deeper then the camera aloud.", "Date": "May 21, 2014"}, {"Title": "Waterproof camera??", "Author": "Luis Berger", "ReviewID": "R3E1L0XYXCKWCU", "Overall": "2.0", "Content": "I bought this camera on November, but after two days using it for snorkeling started failing. First screen went black all time and now camera doesn't turn on.Very disappointed about this camera, Nikon always make incredible products but now I'll choose another brand.", "Date": "May 20, 2014"}, {"Title": "I am impressed with this camera", "Author": "P. Lancho \"patlancho\"", "ReviewID": "R15I9NS4HW83G2", "Overall": "5.0", "Content": "I had severals cameras for underwater photography, all of them, Nikon and CANON, but this is the powerful one. Its little, compact, and easy to manage underwater, you can carry in the pocked of the BC, and take it when you need. They make great pictures, underwater an in the air. Quality of image and videos are very good, and it has several characteristics that are plus, gps, altitude indicator, e.g.", "Date": "May 10, 2014"}, {"Title": "Love it", "Author": "Fonrin", "ReviewID": "R14BWQW40D0H8E", "Overall": "5.0", "Content": "I bought this camera because I was going to Australia and I was going to be going to the great barrier reef. I wanted to be able to take my camera in the water and get some pictures of the reef. I was a little nervous about putting it in the water (it just feels like a camera isn't something you should drop in salt water) but it was fine. The picture quality is fine. I would recommend this camera.", "Date": "May 4, 2014"}, {"Title": "AWESOME!!!!!!", "Author": "Charley Wratten", "ReviewID": "R1HR4XQO1LY4LV", "Overall": "5.0", "Content": "This camera far exceeds my expectations!  I use this camera for documenting catastrophic events. It is very useful when submitting documentation to FEMA", "Date": "May 2, 2014"}, {"Title": "A Nice Camera - but not User Friendly", "Author": "Stephen J. Bressi", "ReviewID": "R2LU4LKIUMB8IK", "Overall": "3.0", "Content": "After using the camera a bit - I can now comment.  On the positive side the camera takes nice pictures and uses a standard USB charger, it is nice not to have to carry a separate charging device.  However, the camera and its features are not very user friendly.  The flash options are either Auto or Off.  There were a couple of situations where we had a bright background and needed to use a flash and could not - because there is no \"flash on\" option.  The WIFI is a big disappointment because it requires the use of a proprietary app to work.  I loaded the app on my phone and on my tablet and the ICON disappeared from the menu on both devices.  When I tried to re-install the app - it would not because it was already installed.  The ICON eventually reappeared on my phone - but not on my tablet.  Both are android.  Also, the PC app will not let you download pictures to the computer.  Bottom line - I am shifting the chip just like with my old camera.  With regard to the GPS - It works - but it  needs much improvement.  The GPS coordinates will transfer to windows, but the location data does not.  Also, the coordinates do not transfer to Google Maps.  The map coordinates were read by only one of my map apps.  I had to manually insert the places into the pictures.  Regarding the location data.  For one, it can not be updated - says that right in the manual.  This is crazy because locations change all the time.  Also, we just took a Caribbean cruise and had no location data outside of the United States.  Nikkon needs to work more interoperability into its features.  I would not recommend this camera if your purpose for buying is to obtain the WIFI or GPS Features.", "Date": "April 16, 2014"}, {"Title": "Great!", "Author": "President", "ReviewID": "R1YAL7AYOEH7GA", "Overall": "5.0", "Content": "SO far amazing! The shutter speed is amazing!!! The wifi feature is really cool, however slightly confusing at first. I have not used it underwater. However I have recorded video outside on a very windy day, with a toddler speaking. I was able to hear the toddler very clearly with little to no excess wind noise. Very satisfied with this camera's video quality and picture quality. The built in filters make it photos quicker to edit. Perfect camera for travel as well as professional photos.", "Date": "April 12, 2014"}, {"Title": "FAIL", "Author": "Theresa M. Hurford", "ReviewID": "RMUVIT2NW3IXN", "Overall": "1.0", "Content": "The camera failed in less than ten feet of water. It will still operate but the screen went black and has a fog in it.", "Date": "April 10, 2014"}, {"Title": "Great Underwater Camera", "Author": "Jill R.", "ReviewID": "R2GVIDXQTV8AFK", "Overall": "5.0", "Content": "Takes crisp underwater Pics and Video.  Used in both in the ocean and an indoor pool.  Highly recommend this camera.", "Date": "April 10, 2014"}, {"Title": "Yup, screen went black on me, too", "Author": "John D. Hunt", "ReviewID": "R1MLYCCKEE8BMJ", "Overall": "1.0", "Content": "Wow, what a camera. The screen has an uncanny knack of going black as soon as you start enjoying a vacation. After a little swimming in the bay today, we're set to go snorkeling and swimming with dolphins tomorrow here in Hawaii with this product. But with no screen, this is now a point-and-hope camera - and judging by all the reviews I should have read before buying, we're not alone in the dark. Nikon, your reputation built on years of excellent cameras is taking a big hit with this popular but very faulty one.", "Date": "April 7, 2014"}, {"Title": "Leaked the second time I used it.", "Author": "Natalie", "ReviewID": "R2G3BOVZWADY5Z", "Overall": "2.0", "Content": "Recently went on a trip to Hawaii and was super excited to use this while snorkeling there. It worked great during my first use in the ocean. The pictures were incredible and it had good battery life. I let it dry completely for at least 24hrs before opening the case to charge the battery. When I put the battery back in it turned on with out any problems and I made sure it was sealed before taking it back into the water but the second it hit the water it malfunctioned. This was really upsetting because I was scheduled to swim with manta rays that night and no longer had a camera. I literally barely submerged the camera and it leaked. Wish it was really waterproof because the picture quality was amazing for underwater camera standards.", "Date": "April 1, 2014"}, {"Title": "Cool Coolpix", "Author": "Steven Russell", "ReviewID": "R286OUPQ97LBKO", "Overall": "5.0", "Content": "Overall a great investment.  Lots of whistles and bells.  Love it.  I will definatly take this on vacation to Mackinac Island this summer.", "Date": "March 28, 2014"}, {"Title": "Excellent for outdoors", "Author": "moonski \"moonski\"", "ReviewID": "R1VVHXLUIC35LP", "Overall": "5.0", "Content": "I had too many point-and-shoot cameras become useless because the retractable lens broke or got sand in it or something. This one doesn't have that problem. I also had a camera stop working because the door on the battery compartment wouldn't stay closed due to the fact that two of the little plastic feet holding it on had broken off. This one has a much more secure and durable battery door. The weak point on this camera is the LCD, which can be protected by a cheap screen protector. This camera is perfect for outdoor adventures - I've taken it skiing, hiking and on the water and it's been great. It takes lovely video and photos for being so small.", "Date": "March 22, 2014"}, {"Title": "Works Great", "Author": "Andysfc", "ReviewID": "R1A5ZJZIUMM8MQ", "Overall": "5.0", "Content": "Took it on vacation in the Carreabean and it worked great.  Did some snorkeling and it took great photos and cleaned up great for photos we took during the rest of our vacation.  Pictures and video capability were great.  Definitely recommend it.", "Date": "March 22, 2014"}, {"Title": "Good Camera", "Author": "S. Maldony", "ReviewID": "R3RWTBN6RP5GK7", "Overall": "4.0", "Content": "So far we have had this camera for a month and mostly used it on our cruise to the Bahamas.  The camera takes great pictures on land and underwater.  So far no leaks.  The underwater pics need some post processing to clear the blue tint.  I used basic color correction in Photoshop Elements and the pictures look great.", "Date": "March 20, 2014"}, {"Title": "Seal wasn't good- test before traveling!", "Author": "DrTorq", "ReviewID": "R2XRDCUSAOX8OJ", "Overall": "3.0", "Content": "So excited to get this new camera but didn't have the foresight to test it out before we went on vacation... threw it in the pool, took a few fun shots, then off to the beach and noticed the lens fogging up... before long the screen was foggy too! Let everything dry out checked to make sure it wasn't something obvious and easy to fix, got another few dry photos out of it before it stopped working completely. Have to exchange but more bummed I couldn't take photos the last two days of our trip!", "Date": "March 19, 2014"}, {"Title": "Great camera", "Author": "matthew517", "ReviewID": "R1J0161UEPLHGC", "Overall": "5.0", "Content": "This camera took great shots out at stingray city in grand cayman and then great shots at the ruins in Costa Maya.", "Date": "March 4, 2014"}, {"Title": "Great camera", "Author": "Cindy V.", "ReviewID": "R2HS63N7BZND6P", "Overall": "4.0", "Content": "Excellent camera. I love that it maps our journey with gps. We went on a cruise and It mapped all of the pictures. We snorkeled several places including the  Barrier Reef. I got great underwater pictures. I only had a few days before we left so I needed to learn the features better. That is my only negative the manual is on a DVD. It appears a lot of companies are switching to this. I had planned on reading it on my flight.", "Date": "February 27, 2014"}, {"Title": "A great camera", "Author": "david wilkins", "ReviewID": "R1TLNRMN5BQQBP", "Overall": "5.0", "Content": "This camera has a lot of features more than my canon rebel.Easy to use takes wonderful pictures. Battery life is short will need extra battery.I highly recommend this camera", "Date": "February 23, 2014"}, {"Title": "Takes amazing pictures!", "Author": "Shanna Uhl", "ReviewID": "R2YBFUXMHY5YZY", "Overall": "5.0", "Content": "Takes great underwater pictures.  We used this in Belize where the underwater life is incredible.  The camera took great clear pictures.  The video works great too.  Goes from video to picture mode very easy.  Great little camera for the price.  Great quality pictures.", "Date": "February 14, 2014"}, {"Title": "Got this for my Mom", "Author": "Melanie W", "ReviewID": "R2HISN24OZ2ASK", "Overall": "5.0", "Content": "Got this for my mom as a gift. she really likes it. it doesn't take the best pictures- but its a point and shoot and more or less used for the waterproof aspect of it! she was able to take a ton of pictures while she was on her cruise without fear of getting it wet.", "Date": "February 13, 2014"}, {"Title": "Fun and Easy to Use - Great Photos - Great features", "Author": "cc101", "ReviewID": "ROYYRZC8D8KRQ", "Overall": "5.0", "Content": "Really Like the Camera. Easy to use and a lot of fun - Great Speed and Zoom. I Plan on Buying another", "Date": "February 10, 2014"}, {"Title": "Cumbersome and counterintuitive, but otherwise \"okay\"", "Author": "Brian L Croak", "ReviewID": "RN39O807YF8XA", "Overall": "2.0", "Content": "I was pretty excited to get this camera, but as it turned out… I'm not very impressed. I expected much more out of the Nikon camera. I cannot speak to the waterproof aspect of it, but it is very counterintuitive and difficult to function. The buttons are too small and too close together, and if you took the camera just right (and there seems to be no way of knowing what just right is) You end up with a myriad of different functions happening without you realizing it…Unfortunately there's no way to control the flash, you can turn it off, or you can set it for \"auto\". Sadly auto does not really function very well, it picks and chooses, and even in the middle of the night I ended up with massive shadows from the streetlights in the middle of my photo because the flash chose not to flash.For the price I paid… Yes, definitely NOT impressed.", "Date": "February 10, 2014"}, {"Title": "Great camera.. Wifi is a bit of a joke...", "Author": "Bore Viking", "ReviewID": "R1SPODFNIZNA7T", "Overall": "4.0", "Content": "This camera is great - being that it's almost indistructible...  But the WiFi is a real joke... Don't buy it for that reason - buy it for everything else.", "Date": "February 5, 2014"}, {"Title": "Outstanding camera for snorkeling and outdoors", "Author": "J. A May \"Andy\"", "ReviewID": "R2T2IT7QM13VQ3", "Overall": "5.0", "Content": "I've just returned from my second snorkeling trip with this camera and I love the quality pictures it takes underwater.  Buy the special floating underwater wrist strap, the camera will float with that strap attached.  The camera, in auto mode, will focus very well, even under water.  Last trip I snap shot a spotted eagle ray going at least 10 mph and it came out perfect.  Love this camera, I have it with me when I golf all the time and it takes great pictures above water as well.  Good all around outdoor camera.  The wifi connection to my android phone works well and is nice for getting pictures to facebook right away.", "Date": "February 3, 2014"}, {"Title": "Camera did not work", "Author": "david sellers", "ReviewID": "R2VQUW2U6Q3UNK", "Overall": "2.0", "Content": "Camera was not working. Screen flash then shut down. Returned with no problems and ordered the Nikon s9500 from another seller. s9500 is a great camera with many features.", "Date": "January 27, 2014"}, {"Title": "Nikon AW110 wifi waterproof camera", "Author": "Q. Yeung \"H. Yeung\"", "ReviewID": "R2E2OUCTSE2Y99", "Overall": "5.0", "Content": "I love this little camera.  Macro is excellent.  Start up for first picture is very fast.  I took some underwater pictures in tide pools in California with great results.  The only problem is once a while the focusing hunts and cannot lock into focus and you need to refocus again.", "Date": "January 18, 2014"}, {"Title": "Used 3 times, pictures OK, video OK....but it leaked!", "Author": "Jim S \"z23z23z23\"", "ReviewID": "RNB98EEHVGDJ8", "Overall": "1.0", "Content": "I bought this camera and used it 3 times over a 2 week period.  I bought this to use while kayaking in the ocean.  I'm an avid DSLR user and a Nikon fan for many years.  The camera was only used in the surf zone and was never submerged further than a foot and for less than a minute.  The lens immediately fogged up.  I think it was condensation as the water was very cold and the air was very warm (January in So Cal has been very warm).  Never-less, the camera was not usable until it warmed up and the fog cleared.  I returned and am trying a different brand of camera.", "Date": "January 17, 2014"}, {"Title": "Very poor quality product - Avoid at all costs", "Author": "Olivier Adam", "ReviewID": "R3IT827R69ZCZC", "Overall": "1.0", "Content": "This is my second underwater camera (previous being a Lumix one), and this one barely works. It is plagued by software issues and poor manufacturing. The screen starting showing random white lines after only a few days of use (not even having been underwater yet!) and it just went downhill from there, breaking down completely after a few weeks. We initially thought this would be a good product as we have a DSLR from Nikon, but we ended up very disappointed. Nikon seems to have focused more on adding dozens of useless gadgets as opposed to make a solid, sturdy products that takes good pictures. All this to say, we will stay away from Nikon products from now on.", "Date": "January 15, 2014"}, {"Title": "Adequate", "Author": "Hermann Guenther", "ReviewID": "RTBZF45P65C", "Overall": "3.0", "Content": "Just got this a couple of days ago, so I haven't had much time to use it yet. It's loaded with great features, most of which I don't need. The pdf manual is 252 pages, which tells you how complex this thing really is. When I see that a camera is rated at 16mp I would have thought that the file size at maximum resolution would be much larger than 3-4 mb. I don't understand that. Pictures are adequate, since I have several high-end cameras for when I really need high quality. I bought this just to have a small pocket camera that I can carry around all the time. I don't dive, so I'm not worried about the waterproof feature although it will be handy when I go fishing or kayaking. I like the GPS feature, although the elevation does not show up in the images' metadata - only the coordinates. The Wi-Fi is a different story. I was of the impression that I would be able to download pics directly to my PC via my home network. Not so! Big disappointment, but not a major problem. The location of the lens in the upper corner is not good - you would think they could have put it somewhere else. Have to be careful not to photograph your fingerprints.Just a note about price. While Amazon's prices are usually way better than what I can get in a local store, that was not the case here. $246 seems a bit high for what you get. I bought this at a major membership warehouse. Got it for $199 and that included a package of other goodies: a nice case that Amazon sells separately for around $33; an 8GB SD card, a filter adaptor that mounts on the front of the lens; AV cable for connecting the camera directly to a TV; plus a coupon for 100 free 4x6 prints. Amazon's description of what's in the box does not seem to include these things. But I'll still keep on shopping Amazon since I have saved mucho bucks buying from them. And they have great customer service - so far.", "Date": "January 9, 2014"}, {"Title": "Review of Nikon COOLPLEX AW1o", "Author": "Bud Brannon", "ReviewID": "RLIR6TC8S6JRF", "Overall": "4.0", "Content": "Very nice little \"point and shoot\" camera. Have not had a chance to use it under water yet, but plan to soon. Highly recommend,", "Date": "January 5, 2014"}, {"Title": "Not up to the quality I was expecting", "Author": "Stacey F.", "ReviewID": "R2U3GO3ZRHBGP1", "Overall": "3.0", "Content": "I have been an avid compact digital camera user for about 11 years... I started with Nikon Coolpix in May 2002 and then had 4 Canons before I bought this Nikon in December 2013. I wanted a waterproof camera that had extra features, because, let's face it, Canons tend to lack on the cool features category. This camera let me down a LOT. In many of my comparisons, I am comparing to my Canon Powershot 310 HS ELPH. I took side-by-side comparison pictures in many of the scenarios that I compare to in my review.Camera body- It is a bit bulkier than my canons, which I expected because of the waterproof capabilities. It was comfortable in my hand.The blue color was gorgeous, and the buttons were squishy like everyone said, but I didn't mind it at all. The one thing that is annoying is the location of the lens. It makes it VERY easy to block with your finger, but I'd prefer the lens there as opposed to the flash because at least you can see when you've blocked the lens (My Canon has the flash in that spot and when it gets blocked you don't know until after you've snapped a bad picture). The locking system to keep it waterproof was mostly effective, but after 3 beach days, it somehow got sand in there, and this is THICK white sand from Grand Cayman... I have no idea how it got in there, and I'm lucky it didn't ruin the waterproof capabilities. Shutter button is easy to press (and press halfway to focus first)Menus- The menu screens were very basic, and they looked EXACTLY the same as my first Nikon 11 years ago... It's time for an update. Though the menu screens were easy to navigate, they were very slow. Also, it was confusing to get to the different GPS options, and some options I probably never used because I just couldn't find them.General camera use- This was pretty easy....  I found myself using the scene buttons frequently to get the best shot as compared to my Canon which I just use the P setting for, but Nikon lacks some of the options that canon has which made me upset. They have no color options like \"Vivid\" that I use with sunsets with my Canon. The underwater scene was perfect for underwater shots while snorkeling. I took shots without that scene and then with, and it was clear that the scene mode made a huge difference. One thing that was a HUGE let-down was how long it took for the flash to load between shots. I know that typically, Canon cameras have slower shot-to-shot times, and this Nikon was WORSE. I was very surprised because I didn't read any other reviews that mentioned this.Picture quality- nothing to brag about, nothing to complain about. The pictures were fine, but many were very grainy compared to my Canon. This was especially true when you zoomed in, though the Nikon is supposed to have higher pixel count than the Canon. It beat my Canon out in exposure compensation for close up portraits, (something canons tend to not do well with) but everything else, the Canon (that is 2 years old) was FAR superior with. Landscape shots, group pictures, etc... The canon was much better than this Nikon. Darn.Video Quality- HORRIBLE!!! I could not believe this, but it was horrendous. The video was choppy, got grainy at points, and then, to top it all off, the SOUND DID NOT MATCH UP!!! That reason alone was enough for me to return it. Really, really, bad.The one thing I liked about this Nikon over my Canon is the ability to do panorama by just sweeping the camera across.... I have NO idea why Canon has not adapted this technology yet. However, even on this Nikon, the technology was NOT perfect. You had to hold it PERFECTLY straight across or it would fail...Overall, I will be returning this camera. Definitely NOT worth the two-hundred I paid for it. I think it would be worth it to pay 300 and splurge on a DSLR. I'm disappointed, Nikon, and because of this camera, I will probably go back to Canon (or try out another new brand).", "Date": "January 5, 2014"}, {"Title": "When it works its great, but it might let you down", "Author": "Chucktastic", "ReviewID": "RTFGIGEOVO8E2", "Overall": "2.0", "Content": "Ordered this as a gift for my wife for our Christmas honeymoon cruise to the Caribbean so I wouldn't have to bring my DLSR.  While the camera did well both at home and on the first day of the cruise, it quickly started freezing up.  The camera would freeze up every 3-4 shots and require the battery to be pulled to reset the device.  Due to the constant freezing we missed out on a bunch of pictures that we \"assumed\" we're being taken only to find out they were not.  Slightly embarrassing when we would hand the camera to someone to take our picture only to have them tell us that its not letting them take the picture.  Sadly we probably took more pictures with our phones then with the camera during our honeymoon.Pros:Image quality was pretty good for a point and shoot and video sound/quality was also rather impressive for the price.Cons:Freezes up - requires battery to be removed to reset cameraOverall:Good image quality and tons of features, however if you are relying on this camera for a special occasion then you may want to consider bringing a backup camera.", "Date": "December 31, 2013"}, {"Title": "Expected more.", "Author": "Amanda J. Sempek", "ReviewID": "R2M6BHML51ZAXK", "Overall": "2.0", "Content": "I got this camera as we travel yearly to beach destinations, so I knew I wanted waterproof to take on our activities. It works great for outside, but I find that indoor pictures can either be extremely bright or dark, there is never an inbetween. I have take it underwater (not deep or long) and I thought it was great. Until my last vacation. I went snorkeling in Jamaica and after our brief 15 minutes in the water we got out and my screen was black. it would turn on but i couldnt see what the screen was doing. This was very disappointing as the rest of the trip I didnt get any pictures (after opening the door, water was in the battery, not much, but must have been enough). When i returned home, i attempted to get the pictures I did get taken by hooking the cord to the camera, which also wouldnt work. I was able to get them off the card, but still disappointing. Looking into a new brand/make for my next underwater camera.Another girl at our resort had the same camera and exact same issue as well.", "Date": "December 19, 2013"}, {"Title": "Takes a beating and keeps on clicking!", "Author": "Barbara", "ReviewID": "R329XJ9RWO6W6S", "Overall": "5.0", "Content": "Great color!  Easy controls (compared to Cannon).  Only wish is that it had more than 5X zoom.  Sometimes a left hand finger will cover lens.", "Date": "November 29, 2013"}, {"Title": "Poor Quality Control and Bad Aftermarket Service", "Author": "Hunt Greene", "ReviewID": "R2IN6PWQLWZMLC", "Overall": "1.0", "Content": "This camera stopped working after a few months of light use. It was sent back to Nikon under warranty overnight ($40 shipping by me). They couldn't be bothered to let me know the status of the repair. They did finally send it back by the slowest (cheapest) possible UPS. It just showed up , no notice. Not what I'd expect from Nikon! Update-camera came back and failed again, immediately, when it got wet. Now back at Nikon again! Nikon COOLPIX AW110 Wi-Fi and Waterproof Digital Camera with GPS (Blue)Mark it down to one star and avoid!", "Date": "November 19, 2013"}, {"Title": "Good camera, nice features, but unreliable when used underwater", "Author": "KJNaj", "ReviewID": "RPN6ZFHJP56GW", "Overall": "3.0", "Content": "I bought this camera for scuba diving prior to a trip to the Philippines, and I picked this one because it has the best depth rating within its product category.  It's rated for up 18m in depth, the maximum depth for PADI Open Water certification.This camera is loaded interesting features.  GPS, compass (which was useful while underwater), and wifi, which allowed me to transfer pictures to my android phone.  This with an adapter for 40.5mm filters that allowed me to use an underwater red filter with this camera.  The battery life is good, although the bulky charger could be smaller.  The manual white balance feature has been very useful.  This camera doesn't save images in RAW format, which would've been very useful for adjusting color balance after taking pictures.During the 1st dive on my trip, I noticed the outer window of the screen concaving inward as I went deeper.  Then at around 10m, the window was touching the OLED screen.  There's a sealed air gap between the window and the screen which cannot be pressure-equalized, causing the window to bend inward as you go deeper underwater... not a good design.  However, I went down to 15m with no functional.  I have read other reviews where this camera failed while snorkeling/diving during vacation.  Fortunately, this wasn't the case for me.A few weeks later, I took further PADI certification and had this camera with me.  While in the middle of an underwater photography session at no more than 8m depth, the screen suddenly failed with no warning signs.  The rest of the camera was still functional, but it was useless without a working screen.  After soaking the camera in cool fresh water and letting it dry, I opened the battery cover and did not notice any moisture, dirt, or anything unusual.  I called Nikon and sent my camera in for warranty repair.  Nikon repaired the camera under warranty and sent it back within a week, although they denied this being a common issue with this particular model, despite this issue not being an isolated one.  This fact leads me to believe that the underwater design flaw is still in existence of this model.This is a good camera if was more reliable at being waterproof up to 18m.  If you're a scuba diver and plan to buy this camera (or already have it), do yourself a favor and get an underwater housing for it.  They are pricey, but they are more reliable and generally allow for far greater depths.", "Date": "November 4, 2013"}, {"Title": "Overall OK performance", "Author": "Juraj Berkovic", "ReviewID": "RYOCFYQGAJO1O", "Overall": "3.0", "Content": "I'm a Canon biased user. This is my first non-Canon camera.Mostly I use DSLR - but I have 3 few years old (abt 5 years) Canon compacts as well - so i'm comparing to them.Good:Picture quality and video quality is great - dead on target what you would expect from a microscopic lens that this camera uses. Or any other brand with this lens / chip specs.Battery life: acceptable.size/ weight - greatWIfi, GPS : nice add on - this was the reason buing this as opposed to Canon that's similar in another spec.Bad:Handling - menus, buttons are quite difficult and illogical. It get's time to get used to it. Maybe it's me - being used to Canon menus and button functions.The one thing that's really my biggest complain is speed - shutter lag - for still photos and shooting movies.Even deleting pictures / movies takes forever. By operating you get this 1-2 secs of camera doing nothing, with blank or frozen screen and then it performs watever command you were starting. So moral of the story: pres (e.g.) Record button - and camera will start recording ion one second or so - just don't do anything else in the time being!", "Date": "September 29, 2013"}, {"Title": "Great pics & video but broke after 1yr", "Author": "MrMike", "ReviewID": "R3AYHDKDBSJB4Q", "Overall": "3.0", "Content": "We used this camera on many occaisions and have started preferring to take this instead of our Nikon D40 SLR because that one is so heavy and bulky.  I have tons of great picture from snorkeling in Hawaii (multiple trips) and video of my son diving after fish - replay the video on my HD TV and it's incredibly clear & awesome.  On our last trip about a month ago the camera died about 5 days into our vacation and at a bad time when we found an awesome snorkeling spot with turtles & eels.  I tried openning it up, drying it out, could not get it to turn back on.  I sent the camera to Nikon and the estimate came back for $140 which, after much debate & research, i declined and they are sending it back to me.  Now, i'm torn, because i love this camera... it's form factor, quality of images (ok, actually low light pictures suck but it excels in other ways). So, i just bought this camera again but i bought the 3 year warranty (actually, i bought it at Best Buy a little cheaper than Amazon)  I believe if this camera lasts me 3 yrs and craps out then at least i can get another.  I don't typically buy warranties but I really do like the form factor of this camera and another bonus is i can give it to my 4 or 7yr old and let them take pics, if they drop it... nothing happens.  I hope this review helps someone - it's a good camera but i guess something's gotta give when you use it in saltwater & pools a lot.", "Date": "September 19, 2013"}, {"Title": "Good point and shoot - poor wireless", "Author": "S. Clark", "ReviewID": "R22KIWLSS5BL6G", "Overall": "3.0", "Content": "I took the Coolpix AW110 down the Colorado River through the Grand Canyon on an 8 day trip with family and friends.  We had a great time hiking, going through rapids, dangling on tight trails, huffing up and down slopes, getting drenched in the rain and in the rapids, and baking in the heat of the day.  The camera did a great job of surviving the elements, taking lots of great point-and-shoot pictures.  The GPS feature is nice and with 3 batteries I made it through 8 days without electricity pretty well.  The zoom feature is limited (but that's well understood going in) and there is no wide angle for scenic shots in that environment.  But it's a point and shoot and that's okay.  Some of the features need the instructions - and those are not all that easy to decipher in my humble opinion.  Finally, while I was able to manually download my photos to my iMac, I am very disappointed by trying to wirelessly transfer photos from the camera to my iPad 3.  Frustrated is an understatement.  It seems incredible to me that Nikon has created such a weak app for their wireless feature and incredible that no one has filled in the void.  For a camera that features it's Wi-Fi capability, it is a very big disappointment.  Nikon should be ashamed of the quality that is missing in that area.Aside from terrible Wi-Fi features, I found the camera to be fairly easy to use, fairly rugged, happily waterproof (though you do need to dry off the lens as so water drops or spots don't interfere with your images - true on any camera), and generally a good point and shoot camera.  It just has terrible wi-fi as nearly as I can tell.", "Date": "August 21, 2013"}, {"Title": "Jury still out", "Author": "Dr99", "ReviewID": "R1YMRL6QGCWZI4", "Overall": "3.0", "Content": "I like the camera but I don't love it.  It is indeed a tough little camera, and has even taken pictures under water.  Picture quality could be better and its a little slow to fire up and shoot.  But, the batteries last considerably longer than the small Sony I previously used.  But given taking pictures is what a camera is all about, it has left me wanting more.", "Date": "August 13, 2013"}, {"Title": "Nice point and shoot", "Author": "Chris Jensen", "ReviewID": "R2RGT0S3R4X22Z", "Overall": "4.0", "Content": "So far I have been very happy with this camera. I bought it to use on my ATV trips. I wanted a camera that kept track of GPS coordinates when taking pics and this does the job. When you turn it on you need to give it time to connect to the satellites or you won't get very accurate readings. The map system that comes with it is almost useless, especially since the battery life on this is not that great. The only reason I am not giving this 5 stars is the battery life. The battery life is not the worst I have seen but nowhere close to my old Canon Powershot.", "Date": "July 13, 2013"}, {"Title": "Great \"adventure\" camera.", "Author": "Patrick Perdu", "ReviewID": "R3GRL7YKOGCY5I", "Overall": "4.0", "Content": "My wife had been asking for a camera to go underwater.I procured this one although I am a canon shooter (several DSLR and a G15) and do not consider changing that.It was part of the four cameras my wife and I took for a month-long trip to Vietnam and Cambodia over the new year, then back home in Costa Rica, so it has seen plenty of action, from the jungles (mud and humidity) of Angkor and Monteverde to the beaches (see water and sand) of Phu Quoc and Punta Leona.I will not tell you that this took the best pictures we brought back home, although they are very decent for the size of the lens, zoom and sensor. Its value is more in being always in her pocket, always ready and no worry about risking dust, water or sand. Taking pictures while surfing is cool; not having to wonder about rain and mist is cool too.The GPS proved helpful too, even in Cambodia where it allowed us to find our hotel at night.All in all a very nice camera for what it is; not a replacement for a well-known DSLR but it has its advantages.", "Date": "March 10, 2014"}, {"Title": "AW110 not even close to being waterproof!", "Author": "Dee Franklin", "ReviewID": "RESXPSJYBAYLB", "Overall": "1.0", "Content": "Bought this camera for a snorkel trip to Akumal Mexico.  Takes great photos above water and I like the fact that you can take panoramic too.  Just don't get the camera wet.  The first time under water when I pushed the on button air bubbles came out from the button and the screen was black.  Called Nikon service and they tell me water damage is not covered by the warranty!  Nikon is the ones that say it's waterproof but they don't back up their claim!  I will be getting my money back and buying another brand.  I hear the Panasonic T4 is a good camera.  So long Nikon, I won't be purchasing any of your products EVER again!", "Date": "February 18, 2014"}, {"Title": "Nikon AW110 useablility", "Author": "Roy T. Caputo", "ReviewID": "R10R58HZX3XKO6", "Overall": "4.0", "Content": "I recently used my new Nikon AW110 while on vacation in the Turks & Caicos islands which has the third largest reef in the world. I was snorkeling in 10 to 30 feet of water, there was a little learning curve taking still pictures without spooking the fish. I learned that diving down to the bottom and moving in slowly horizontally was the best approach and I took dozens of great pics. Using the movie feature underwater is extremely difficult. Trying to hold the camera still while swimming through coral arches and caves did not work. I had have someone else hold still at a distance and film me swimming through the caves. I must have deleted 10 attempts before I asked someone to film me. I only had 3 good movies to bring home.", "Date": "September 14, 2013"}, {"Title": "ok but doesn't hold up underwater", "Author": "eVA r. jONES", "ReviewID": "R3U8ULYGTBDAOF", "Overall": "3.0", "Content": "My daughter used this recently in Cayman islands.  For the pool it worked great and the photos are excellent however for snorkeling or diving it failed.  The camera was about 15 feet underwater and started to leak into screen.  We immediately took it topside and of course water was pouring out of camera.  The sd card would not work.  a hot tip though, we put sd card on a paper towel in freezer (yes freezer)  for 15 hours took it out and it worked.  yeah  we got pictures.  I also own the Olympus t-2 which I also went diving with.  No leakage and beautiful pictures.  I own many cameras mostly Nikon but on this particular one it is not worth the price.  I can't trust it to fail again.  It is a little heavy but not made for underwater.  I would not take it anywhere except to a poolside.  I did not use Wifi or GPS portion of camera so I can't attest to those qualities.  I would not buy again.", "Date": "August 20, 2013"}, {"Title": "Nice camera with limitation", "Author": "Milton", "ReviewID": "R36HPY8UDMWAC0", "Overall": "4.0", "Content": "With the lens setup on this camera it will never take as good a pictures as a DSLR or a Point and Shoot with a better lens.  But for its use for an active lifestyle and underwater it is great.  However I encountered a problem that should be noted.  Nikon has tested and recommends four brands of SD cards.  I didn't have any of those handy so I used a Kingston.  After a few days the camera began to \"freeze up\" whereby none of the functions of the camera would work.  The lens was still active and you could see the images in the screen but it wouldn't take a picture, make any adjustments, or even turn off.  I contacted Nikon and they said these type cameras were very sensitive to the SD card that was used.  I looked around and found a Sandisk and inserted it and have not had another problem.  I have taken about 50 test shots and duplicated the scenario when it first stopped and it has worked fine.  I hope it continues to do so.  Also, the altitude based on the GPS signal is way off, 200 feet or so at an elevation of only 980 feet.", "Date": "August 15, 2013"}, {"Title": "I like this", "Author": "Robert Reynolds", "ReviewID": "R3OJQCXVPRWD0K", "Overall": "4.0", "Content": "I regularly buy cameras about every year or so and have a variety of them ranging from Action POV cameras, to high end DSLRs.  I bought this camera to be a \"be with me always\" type of camera.  For that purpose I love it for these reasons:- It's relatively small- The battery lasts a long time.- I find the video to be excellent for a camera at this price range. Image stabilization is very impressive.- It's shockproof (and I'm hard on cameras).- It's waterproof so I don't sweat it in the rain.In short, I tend to either jam it in my pocket, or at times wear it around my neck on a lanyard in tough spots. Overall I'm impressed.Like most non-DSLRs, shutter speed is slow, so you may find yourself missing shots if you have to turn it on and pull the trigger quickly.", "Date": "August 11, 2013"}, {"Title": "bad luck?", "Author": "xuyangcn", "ReviewID": "RL25NKZ9PMMQ7", "Overall": "2.0", "Content": "got first one and wanted to use in Hawaii for snorkeling, unfortunately the camera had some leaking issue, the length got mist and couldn't take a clear picture under water.  then replaced another one but this time it got hung ( stuck ) for multiple times, pressing shutter doesn't work, only way to recover is taking out battery and reset.very disappointed on this product, maybe just bad luck for me?", "Date": "June 13, 2013"}, {"Title": "Best all terrain camera I have tried", "Author": "Peter Collins \"PCH\"", "ReviewID": "R9SGOSPWANT8X", "Overall": "4.0", "Content": "After trying three different waterproof cameras, and being a Nikon fan, I found this camera very easy to use. Good thing is the filter adapter.", "Date": "May 16, 2013"}, {"Title": "Not good underwater", "Author": "Alain Pothier", "ReviewID": "R1I7D05T1N9Q0G", "Overall": "1.0", "Content": "The Nikon AW110 takes great outdoor pictures, however, when we tried to take  underwater pics while snorkeling during our trip to the Bahamas in September 2013, we were able to take only 3 pictures before the camera stopped working.  There was no water inside the case and  I even replaced the battery with a spare one but the camera still did not work.  I just sent the AW110 to Nikon in Toronto for repairs which did cost me money to return them the camera.  What is frustrating is that we purchased this camera solely for our trip and unfortunately, we could not use it.  I do not recommend this camera to anyone who would like to use it underwater or near water.", "Date": "September 10, 2013"}, {"Title": "Hardcore", "Author": "J. Bratton", "ReviewID": "R347HDX4F00XO5", "Overall": "5.0", "Content": "This thing is tough. I have taken it through 3 obstacle course races. I have had it completely caked with mud each time. I washed it off and it is good to go. I have had it submerged in water several times as well. I am hard on equipment.The only thing I can see wrong with it is that the LCD on the back is not protected. It should be indented or something to keep it from getting scratched. Mine is all scratched up but it still takes great pictures.", "Date": "June 11, 2013"}, {"Title": "Nikon AW110", "Author": "doberdogs", "ReviewID": "R2LBTMAI7S9FUK", "Overall": "2.0", "Content": "We bought this camera specifically for a trip to the Galapagos where we would be doing some snorkeling.  I paid extra for the 110, just to be on the safe side for depth.  None of the snorkling we did was deeped than 20 feet.  Othera had the AW100, and in total, I think there were 5 AWs there.  The camera we bought fogged up underwater, so the pictures were bad AND then fogged up out of water too!  It was the only one on the trip that had issues.  I sent it back to Nikon and just got it back with basically \"there is nothing wrong\".  Customer Service was useless as they just parroted the same verbiage.  I would not have an issue with this IF other cameras had problems...  They DIDN'T!!!!!  I would not purchase this one again.", "Date": "June 3, 2013"}, {"Title": "Worked well.....until it didn't!", "Author": "paul shemwell", "ReviewID": "R3D9A35YWT5E1J", "Overall": "1.0", "Content": "I bought this camera specifically for an upcoming vacation with my children to the Cayman Islands. Read the reviews and went with the Nikon because of its features and reported performance. It worked well in the pool, but after about 30 minutes of snorkeling the LCD screen went black and the camera died! I spent the evening emailing back and forth with Nikon support and the BEST answer they had is that perhaps it was the memory card???? It's now day three of seven in the Islands....no camera....Based on my experience I would not recommend you buy this product!", "Date": "June 11, 2013"}, {"Title": "Not a waterproof camera!", "Author": "Omar Nazif", "ReviewID": "R3TH39EFS03L2M", "Overall": "1.0", "Content": "I'm writing this on a trip to Hawaii, where i'm going to miss out on a week of water photos before i leave due to this camera failing on me.I have had issues of the lens and screen misting up and have taken care to store it in a pouch with silica packets.  I have been meticulous with SD card and battery insertion, and checking the seal and debris.Yesterday, while casually paddleboarding, it finally succumbed to whatever design flaw that causes it to leak.Now it is dead and will never turn back on. Very disappointing for a camera with a rated 59 foot depth!  I never took it more than 4 feet underwater.I wanted a camera i could keep in my boardshorts to avoid theft on the beach, this one couldn't handle that basic task.", "Date": "May 22, 2013"}, {"Title": "Just do not expect too much", "Author": "Larry", "ReviewID": "R1AC1SEP8SQLRK", "Overall": "3.0", "Content": "Good things:It is waterproof and durable. I took this camera for snorkeling several times, it did good job. Usually I will hang on in water for 2-3 hours a day, I took plenty of nice underwater shots. Sometimes I will dived to 4-5 meters for awhile, and the camera did what he says. It's a really waterproof camera.Good IQ in good light condition. I says only in \"good light condition\", I will tap this problem on the negative things. Over all, it take great pics. The crucial is switching between different modes. For instance, if u want to use it underwater, make sure u r in underwater mode, otherwise the white balance or focus could be a problem.Nice close up shot. If u choose micro mode, u will get a nice close up shot, the texture of the subject is really clearly.Manual Focus mode. The manual focus mode (under auto mode) is really sweet. If u hate center focus, it will solve the problem. But it will be great and more usable if it has a manual focus on all modes.Negatives:The first and biggest thing that I am not satisfied is the white balance. In some conditions, the white balance measurement is far from accurate. That is way you have to keep switching between modes in order to have a fair white balance. Other wise, u have to do some photoshop with ur pics.Focus. Sometime slow and in accurate focus.Lens fogged up. The outside temperature was about 28-32 celsius degree,  sunshine. I took my camera into the water, dived to 4-5 meters, out of the water, took a rest on boat. After I repeated this several times, I noticed that the lens fogged up from inside. Quite reasonable, but since it's a underwater camera, I think it should be an anti-fog lens. Im not sure where was the moisture from, but the camera was still working after that. You just do not open the battery cover before u back to a \"save\" place, after I returned to hotel, I opened the cover and it dried itself out.Over all, good tough camera, it really tough enough for any type of adventures. However, I will take 1 star for the poor white balance, and 1 star for the fog inside lens.", "Date": "April 6, 2013"}, {"Title": "Horrible piece of crap!", "Author": "Ms SxyOne", "ReviewID": "RHXS53C1RK0OY", "Overall": "1.0", "Content": "Bought this for my 25th Wedding Anniversary cruise to the Bahamas and was so excited. Just got back from my trip and got 5 shots underwater before it completely died! Screen went black and camera would NOT power on. After several hours of drying it powers up but after 3 days the screen STILL does not come on! This camera is too expensive to be worthless after 1 use in 3 feet of water! VERY DISAPPOINTED IN WASTING MONEY & MISSING OUT ON ONCE IN A LIFETIME OCCASION PHOTO OPPORTUNITIES!!! Total waste...save your money and buy something better! P.S. Inside was flooded with water and it was properly locked, and after drying it is still useless. I expected a lot better from a Nikon product.", "Date": "September 22, 2013"}, {"Title": "Stopped Working - Not Shockproof", "Author": "Dave", "ReviewID": "R1GCLK3J3UHT6D", "Overall": "1.0", "Content": "Do not buy. This camera is not shock proof. Stopped working after one fall of about 4 feet. At three times the price for waterproofing and shock proofing, the camera should at least survive the first fall. Ownership = 3 months.", "Date": "August 2, 2013"}, {"Title": "Phenom camera!", "Author": "Eric Zander", "ReviewID": "R1ZQ1OQ3RO2W3I", "Overall": "5.0", "Content": "After sending this camera to the bottom of the Colorado river in Arizona because it didnt have a float strap, I bought him a new one and tried it out.This camera works awesome and so easily I bought two!", "Date": "January 24, 2014"}, {"Title": "As others have stated...Not waterproof.", "Author": "J. L. Hite", "ReviewID": "R3A58E3D07A7YG", "Overall": "1.0", "Content": "Less than 2 feet underwater and it leaked.  No matter how you make sure the door is clean, dry and closed properly this camera will fail on you eventually. Just don't buy it.", "Date": "January 17, 2014"}, {"Title": "Not designed to be waterproof", "Author": "Sandy Young", "ReviewID": "R14UTPOIX4I0KU", "Overall": "1.0", "Content": "I purchased this camera in November to take underwater pictures while snorkeling.  The memory card and battery were installed prior to leaving our condo, so it was definitely a dry, clean environment.  Took a few pictures from the sailboat and everything was fine.  Took pictures while snorkeling and everything seemed fine until we arrived back at the condo.  Tried to turn the camera on so I could show the others the pictures that were taken and the it would not turn on.  I installed my second battery, and still the cameral would not turn on.  On closer inspection, there appeared to be water behind the viewing screen (in each of the corners).  I opened all of the doors and put the entire camera, minus the memory card and battery in a bowl of rice to absorb and moisture, then tried the new battery again.  Still, the camera didn't work.  It never worked again.I am very disappointed that my camera didn't last even one day.  Fortunately I do have the pictures that were on the memory card, but we missed out on getting more pictures later in the week.", "Date": "January 12, 2014"}, {"Title": "Diaspoointed", "Author": "Tara Anderson", "ReviewID": "R2T7GSB8P1RNGB", "Overall": "2.0", "Content": "Disappointed. It works well under water but does not focus well when taking normal pictures. There is also no \"on\" for the flash so there was no controlling when it would go off. The auto didn't even work in a dark cave most of the time. I would say 60% or more of my pictures turned out blurry. Not worth the money unless you only want it for a water camera.", "Date": "December 8, 2013"}, {"Title": "Recommend this camera", "Author": "Jami L. Smith", "ReviewID": "R2RWMVDEWANCYB", "Overall": "5.0", "Content": "Bought this for my husband's birthday. He absolutely loves it. He read reviews about the camera leaking from the seals. No issues yet but he said he always cleans the seals when changing the batteries to ensure there is no debris compromising the seal integrity. Takes great pictures both above and under water.", "Date": "December 3, 2013"}, {"Title": "Nikon Stole a March", "Author": "Robert K. Allgeier", "ReviewID": "R151T5JL7Z5C6W", "Overall": "5.0", "Content": "Read the manual!  Do what it says.  It won't leak, AND it will take terrific pictures, worthy of a much higher end camera.", "Date": "November 28, 2013"}, {"Title": "IS NOT WATERPROOF!!!!!!", "Author": "JOSE", "ReviewID": "R226C0X6LFHO0P", "Overall": "1.0", "Content": "Get water inside the camera at 3 feet deep in the water!!!a solo 1 metro de profundidad en el agua la camara presento agua en su interior.NO ES RESISTENTE AL AGUA!!", "Date": "November 11, 2013"}, {"Title": "The camera is amazing but... No Wi-Fi to PC", "Author": "Michael G. Lustig", "ReviewID": "R3DOEAKJZNNRD7", "Overall": "3.0", "Content": "I'm not going to write a long review about all of the great stuff this camera does - and it is great -- rather I'm going to write about the one thing that bothers me most: The lack of the ability to connect a PC by Wi-Fi.I don't have a tablet because I'm a computer programmer and I always have a laptop.  That's not good for me and my Nikon AW110 because the Wi-Fi only works with smart devices.  The reason is because the Nikon AW110 is a base station that your smart device connects to the same way you would connect to a Wi-Fi network.Unfortunately, when you try to connect to the camera by Wi-Fi from a laptop PC, the connection never completes.  Even if it did, you wouldn't have an App to control the camera from a PC.Nikon could have made this work the same way on the PC as it does on smart devices but for whatever reason they chose not to.  Minus 2 stars because this is the main reason I bought this brand and camera model.I guess I'll have to buy a cheap tablet and see if I can get it to auto upload from the camera to SkyDrive or similar.  I'll update the review if I get that working.", "Date": "September 14, 2013"}, {"Title": "It takes a beating and keeps going", "Author": "K. Peeples", "ReviewID": "R1UD7GGTA57HL", "Overall": "5.0", "Content": "I have three kids and they all love to play with the cameras we own. Thus, we've had a lot of cameras and a most have ended up going the way of the Dodo. This one has been great so far though.Upon its arrival, and removal from the box, my 2 year old grabbed it and it promptly fell to the tile floor. Not a scratch! Then it was carried off to the fountain in our yard. It survived that too.We've taken it everywhere and so far it's working like a champ. Pictures are clear, quality is great, and it's a solid camera. It has a bit of a delay after the shutter is released but its nothing we can't deal with. Great camera!", "Date": "September 1, 2013"}, {"Title": "Great Camera", "Author": "Jamal R.", "ReviewID": "R1ACWFJ8EEPC5M", "Overall": "5.0", "Content": "Took this camera on a trip to haiti and jamaica worked great.  Was able to capture pictures under water of my daughter swimming with the dolphins very clearly", "Date": "August 27, 2013"}, {"Title": "good but is not schockproof", "Author": "Erika", "ReviewID": "R2CDYPVXKL5PYJ", "Overall": "2.0", "Content": "the camera is good, but it is not schockproof, i have it hangingg of my neck and suddenly the cord that the camera has broken and the camera fell to the patio floor and stops working, i turn the camera on again and it appears a message that says \"objective failure\" and doesn't work anymore.", "Date": "August 24, 2013"}, {"Title": "My one size fits all camera", "Author": "Cookie Monster \"Growing older, but not up\"", "ReviewID": "R8KJW2HDFS903", "Overall": "5.0", "Content": "I have owned several SLR cameras and still do. Yes, that is the best for action shots and multiple fast takes and more \"control\". But, this is my one size fits all camera, Whenever I am boating, fishing, stand up paddle boarding, etc. I drop this in my pocket and am ready. It's waterproof and shock resistant and compact. It has a zoom and takes great pics, but I actually think the video is its strongest feature. It's just a good all around camera when you don't want to lug around all those accessories and are worried about dunking them underwater, etc. I've actually bought two, one for me and one for my daughter. You won't be disappointed.", "Date": "August 9, 2013"}, {"Title": "great for underwater", "Author": "Daniel Trimarco", "ReviewID": "R3KWUFU8B1IW2M", "Overall": "5.0", "Content": "I took this to the Galapagos Islands for a two week trip and the underwater pictures were amazing. I contemplated getting this or the Go Pro and I'm glad I made the call on this as two other people on my trip had the Go Pro and my pictures were a lot better quality. I also liked that it gives you your elevation at all times when you are taking pictures so I was able to see how far underwater I was or what elevation the mountains were when we were hiking. Overall a great camera for the a point and click.", "Date": "August 9, 2013"}, {"Title": "Nice size and features but terrible pictures", "Author": "G", "ReviewID": "R1TFF6Y9JTYUX8", "Overall": "2.0", "Content": "We wanted to love this camera.The camera just didn't take good pictures. The colors were always off.We could take 10 pictures of a landscape / lake, from the same viewpoint and get 5 different colors of water. After a few days of dealing with bad pictures, we sent it back and got an Olympus TG-2. The TG-2 is better than expected and we should have started with that purchase..", "Date": "July 30, 2013"}, {"Title": "A Durable All purpose Camera", "Author": "Reuben T. Neese", "ReviewID": "R1EJVTRP36K4VV", "Overall": "5.0", "Content": "What it lacks in zoom, it more than makes up in durability and features.  I mainly shoot with a DSLR and use this for fun adventure things where a DSLR wouldn't be appropriate. Like underwater...  The GPS works well, and the auto settings work great 9 times out of 10 in most lighting situations.  Being an ultra compact, the flash is decent, compared to other ultra compacts, and great compared to modern smartphones, although no where close to a speed light.  Same with low light sensitivity, it's a bit grainy to me, but easily comparable to other ultra compacts in it's category and beats the hell out of even the best smartphones.It is solid as a rock, has good battery life and easily one of the best in it's category.  Just don't expect it to preform as well as a DSLR or a APC-S compact.  If you are a smart phone shooter, upgrading an older Ultra compact, and/or looking for a durable camera for traditionally not safe for camera activities all while maintaining a decent picture quality, this camera is for you.Oh, and the orange stands out nicely when you drop it to the bottom of the pool...", "Date": "July 12, 2013"}, {"Title": "Awesome camera.", "Author": "Matt A. Buchanan", "ReviewID": "R2LK8DIQCXG7YW", "Overall": "5.0", "Content": "Does very well, just used it on a trip and it takes great pics and movies. would highly recommend it.", "Date": "June 29, 2013"}, {"Title": "Underwater", "Author": "Michael E. Maffett", "ReviewID": "R22561UM5XQ8BR", "Overall": "5.0", "Content": "Overall I am very satisfied with this camera although I have not used the video extensively.  Let me add the underwater format menu is unbelievable!  We went snorkeling in the Carribean and the photos were beyond superb.  I am still amazed.", "Date": "June 26, 2013"}, {"Title": "it does work underwater but the pictures are not that great", "Author": "James M. Cook Jr.", "ReviewID": "RBYNEM45AJ1DA", "Overall": "2.0", "Content": "So, I got this for my honeymoon in Bahamas, I have a Cannon Rebel Ti series, but I didn't want to bring that with us on the honeymoon for fear of it getting wet, so I done all my research on under water cams, and this Nikon CoolPIX seemed to be the way to go.Now I will say it does work, under water, on the beach, in a dinning hall, in the ocean, every feature on it worked as well. but the photos are bad,  either blurry, too dark,  just plain crappy.  My Iphone takes better photos then this camera does.So once we got back from the Honeymoon I sent this back, I think for the next trip I'm going to try out a GoPro.", "Date": "June 3, 2014"}, {"Title": "Mostly good, but high speed function is very flawed", "Author": "Patrick Traynor", "ReviewID": "R37DB30KTGZAZC", "Overall": "4.0", "Content": "This is going to be a very short review.  I'm not going into all of the features.  They're plentiful and nice.  I've taken some great photos and videos with it.  So far, it's definitely been waterproof.My issue with the camera is with the high speed video mode, which gives you slow-motion output.  In the bright sunlight, it looks very good, but only lasts for a very short time.  In the case of the 4x speed, you get 15 seconds before it switches back to normal mode.  I'm curious why they put this sort of limit on the camera.My other problem is that the light setting appears to be set to bright daylight when in HS.  This means that you can't shoot HS indoors, or in heavily shaded areas.If I'd known about these issues, I'd have looked at other camera options more closely.", "Date": "May 30, 2014"}, {"Title": "Defective Product", "Author": "Richard", "ReviewID": "R2R7LEYTQ620FO", "Overall": "1.0", "Content": "I bought from a third party seller, Zantafio Enterprises LLC and paid $5.99 delivery. They used USPS for delivery. I had to go to a post office to pick it up because when it was delivered I was not home ... kind of annoying. Anyways, was excited to get it anyway. I charged the battery for the whole night and input the battery and memory card in the morning. After I turned it on, Uh-oh, black screen. I tried to set up different functions and used the most simple auto function. Still black. Tried to shoot a couple of pictures and videos, when I played back, they were all dark. I owned more than 10 digit cameras and this was so unusual. I contacted the seller and described the problem. They only replied and asked did you charge the battery?.... That was frustrating. Do you think I am stupid? I don't want to talk to them anymore. This will go back for sure. Another thing I noticed is Nikon still uses a power cord for the charger which is not convenient for travelling.", "Date": "May 27, 2014"}, {"Title": "Awesome!", "Author": "Niki", "ReviewID": "R2KZ6N1NUKOZWN", "Overall": "4.0", "Content": "Just got this camera but so far really impressed. I was worried that it wouldnt work well being refurbished and all but works great an picture quality better than what other reviews said.", "Date": "May 22, 2014"}, {"Title": "Great camera", "Author": "Clay", "ReviewID": "R17GNA2QOZ97EO", "Overall": "5.0", "Content": "This is a great point-n-shoot camera. Great for underwater shots of the kids, and the Wifi transfer to my phone makes it quick to upload to facebook when I'm not near my computer. And it's durable. The only complaint is the lack of a lens cover.", "Date": "May 22, 2014"}, {"Title": "The go anywhere camera.", "Author": "Anna Bowen", "ReviewID": "RO0RV572JK4HY", "Overall": "5.0", "Content": "Very compact user friendly camera. Takes great underwater pictures. Its a great vacation camera to take anywhere. Video taking needs an extra battery.", "Date": "May 21, 2014"}, {"Title": "Excellent travel camera!", "Author": "J. C. Alvarez \"01001010\"", "ReviewID": "R3MX60Y6MVS36C", "Overall": "4.0", "Content": "The only thing keeping this camera from being 5 star is a manual shutter control.  Other than that, I love it!!!", "Date": "May 20, 2014"}, {"Title": "Water proof .... Or so I thought", "Author": "John Cooper", "ReviewID": "R4CLI2YUBQ7YU", "Overall": "1.0", "Content": "Product package wasent new which seemed okA couple buttons didn't work right and it was obviously a floor model because it had photos of a store in the internal memoryThis is a water proof camera... or so I thought..so I charged the battery checked and cleaned the seals and submerged it in a cup of water for 10 min camera did not turn on again afterJust reboxed it to return it", "Date": "May 19, 2014"}, {"Title": "Great camera for the ocean and the pool!", "Author": "Patrick", "ReviewID": "R1KLRJ5LEDCIIS", "Overall": "5.0", "Content": "We purchased this camera about 3 years ago.  The camera takes great pics both in the pool and in the ocean.  Very easy to use. Today we were at the beach and my daughter got the camera and brought it into the water not realizing the battery compartment was open. Needless to say,  I am looking for the exact camera it works so well.  Replaced the battery after about 2 years because it lost its ability to hold a charge.", "Date": "May 18, 2014"}, {"Title": "Is not waterproof camera !", "Author": "Gabriela", "ReviewID": "R3V4QSK405G9HH", "Overall": "1.0", "Content": "Have sold this camera and in the first use in the water can not see nothing , screen was black. I have sent it back but they said that the battery was wet so they can not replace o give money back. So it is not waterproof", "Date": "May 15, 2014"}, {"Title": "Toggle for zoom a little awkward to use", "Author": "Carol M. Suveda", "ReviewID": "R2JVKTQYXIWHD1", "Overall": "4.0", "Content": "Seems to work well but in this model the zoom is up and down on toggle and right and left on previous model was easier to use.", "Date": "May 12, 2014"}, {"Title": "Not Bad", "Author": "Richard S. Santos", "ReviewID": "R33KUKLDOKOQNX", "Overall": "4.0", "Content": "Took it swimming in Cancun and Cozumel.  Worked fine underwater and produced clear, crisp shots.  On land, night shots can be a bit on the grainy side.", "Date": "May 6, 2014"}, {"Title": "Highly Recommended Nikon Camera", "Author": "CJ", "ReviewID": "R3EC18X771AYIG", "Overall": "5.0", "Content": "A wonderful easy to use camera. Many, many features and settings to experiment with and use. Photos are clear and bright.  Took a little time getting use to operating video underwater, difficulty seeing if in recording mode or not.", "Date": "April 29, 2014"}, {"Title": "Love this camera!!!", "Author": "June VanDuinen", "ReviewID": "R29XF35SO161PZ", "Overall": "5.0", "Content": "Great, great, great pictures!!! Went snorkeling and the pics are awesome! We used it down to 15 yds under water and we also used it as a regular camera.  The battery life is extremely long.  I wish I had this camera years ago.", "Date": "April 28, 2014"}, {"Title": "Excellent camera", "Author": "Jerry", "ReviewID": "R2BTU26CI0JL8B", "Overall": "4.0", "Content": "Menu buttons are very small and difficult to operate under water. Depth gauge is not accurate. operated very good at depth about 60 ft.", "Date": "April 27, 2014"}, {"Title": "Great purchase, great deal!", "Author": "Robert Hutt \"AT-Blaze\"", "ReviewID": "R30RZGUZTYOOMQ", "Overall": "5.0", "Content": "This was exactly what I was looking for and at a super price.  Vacation will be recoreded as planned.  Wonderful!", "Date": "April 26, 2014"}, {"Title": "Great quality", "Author": "Julio", "ReviewID": "R1073K42RN0XZO", "Overall": "5.0", "Content": "I love this camera, I just wish it had 3D pictures as the competitor have but over all. Great camera.", "Date": "April 25, 2014"}, {"Title": "zooming freezes", "Author": "H. PHAM \"JD\"", "ReviewID": "R1M4UIL99QE6A0", "Overall": "3.0", "Content": "Every time I zoom in and out, the camera freezes.  I have to take out the battery, and turn it back on.I can't turn on or off, when it freezes.", "Date": "April 24, 2014"}, {"Title": "Camera Performs Well", "Author": "Joseph Cucchiara", "ReviewID": "R76UVCXKZ9H9M", "Overall": "5.0", "Content": "This is the second Nikon AW110 I have purchased, great camera, very durable while taking great pictures, inexpensive for the features", "Date": "April 21, 2014"}, {"Title": "I really like the camera, but the packaging appears to have been opened. - 3 stars because I'm not sure if this was new", "Author": "Canyon Country Mike \"Mike\"", "ReviewID": "R3I2906U5WJP2J", "Overall": "3.0", "Content": "I like this camera so much that this was my second purchase of an AW110. This second one was for my daughter who wanted a small, simple to use camera for traveling. This is a rugged camera that I like to take on hiking trips. It takes terrific outdoor pictures and is easy to use. I will never submerge this camera in spite of it's claims to waterproofness since it is clear the seal on the side door that covers the battery and SIM card doesn't look like it would hold up to water over time. It's nice to know, however, that exposure to water splash / water spray won't damage it.When this camera arrived, it appeared the packaging had been previously opened. The camera was not in a bag, had no protective plastic, and even had fingerprints on the LCD. I'm not really sure if I received a new product. For this reason I rate the seller 3 stars", "Date": "April 19, 2014"}, {"Title": "Fun Camera", "Author": "M. G. MCKAY", "ReviewID": "R1EGZB3NTW7Y2", "Overall": "5.0", "Content": "Just starting to play with this, but it is nice. Really like the GPS component. Nice supplement to carrying around a DSLR for everyday photography. Good quality photos.", "Date": "April 17, 2014"}, {"Title": "coolpix", "Author": "shane archer", "ReviewID": "R3UJ6ZQEK9QHID", "Overall": "4.0", "Content": "I got this in the like-new used category.  I got the orange one because it was so much cheaper than the other colors.  I figured it was because most would not want orange.  It is actually a metallic-copper that is really cool.  It takes great pics and is small.  Its got an uber amount of features.  The hd video is splendid.  Loses something when you pan around quickly, but still vivid.  The only thing I wish was different is the shutter button seems to want a little more pressure than I want to instinctively give and it makes me think that I moved the camera too much while taking pic.  Regardless of my fears, it takes great photos.  :0)", "Date": "April 17, 2014"}, {"Title": "Thanks", "Author": "JOSE LUIS SANCHEZ", "ReviewID": "R36UWDARP8LE9F", "Overall": "5.0", "Content": "Excelent product, very fun, very nice pictureWe are travelling to Cancun Mexico  tomorrow, and we are carry the camera withs us, so it's gonna be fun", "Date": "April 16, 2014"}, {"Title": "Awesome Camera", "Author": "Aubrey", "ReviewID": "RNSQICDM85DI4", "Overall": "5.0", "Content": "Loads of features, tough, and takes great pictures. My wife and I bought it for our Caribbean cruise at the end of this month, and we can't wait to use it. We've already used it for a few hikes and some pictures around the house, and we love it.", "Date": "April 15, 2014"}, {"Title": "Just excellent!", "Author": "Monica Martiarena", "ReviewID": "R3SKSGZ7I76FQG", "Overall": "4.0", "Content": "I requested a fast delivery and I got it even earlier than expected! The camera is just great, friendly for begginers, intuitive use. I could connect it with my smarphone to download the pictures via wifi. Long lasting battery. I would buy it again for sure!", "Date": "April 12, 2014"}, {"Title": "Amazing", "Author": "stcastil", "ReviewID": "RG907GTBDBST7", "Overall": "5.0", "Content": "Love this camera!  I was worried that since it was a waterproof camera it wouldn't do well taking photos outside of the water.  But it takes great photos!  Love the GPS feature too!  The only bad thing is the battery life is not that great.  Maybe due to the GPS?", "Date": "April 11, 2014"}, {"Title": "Amazing!!", "Author": "Cassandra", "ReviewID": "R19HXUOZN94MCL", "Overall": "5.0", "Content": "Great pics and easy to use. I just love everything about this camera. My mom and best friend also bought and they are very happy as well.", "Date": "April 9, 2014"}, {"Title": "to complicated", "Author": "stuart blackwell", "ReviewID": "R1J3UKES89EQJI", "Overall": "4.0", "Content": "but very difficult to learn to use I have not enjoyed using it it will just take time  the camera is very well made ---tough", "Date": "April 7, 2014"}, {"Title": "Perfect Camera!", "Author": "A. Carlton \"Boula Doula\"", "ReviewID": "R1157IFZ2J8KWD", "Overall": "5.0", "Content": "This camera takes beautiful pictures in and out of the water.  I am very happy with this camera and would definitely recommend it.  FYI it does NOT come with a case or a wrist strap.", "Date": "April 1, 2014"}, {"Title": "Nice Pocket Camera", "Author": "James D. Thomas \"Gryowl\"", "ReviewID": "R22RYRI4K5HUUZ", "Overall": "4.0", "Content": "Features are \"as wanted\" and I would buy it again.Instructions to use GPS a bit vague but will manage.", "Date": "March 30, 2014"}, {"Title": "Super nice camera you won't be disappointed.", "Author": "Edward Urioste", "ReviewID": "RO6RLPY0T3DN7", "Overall": "5.0", "Content": "Love this camera. Great photos. Easy to upload images to iPhone using WIFI connection. The GPS will display points of interest for the area.", "Date": "March 29, 2014"}, {"Title": "Meah....", "Author": "Fyste1", "ReviewID": "RY4G6ZFRVNG7D", "Overall": "3.0", "Content": "The camera can take the 'rugged' abuse for about a year - and that is not constant either, maybe 1 or 2 weekends a month. Mine just decided to not power on one day. Bought a new battery and charger for it... still no power. I'm a very sad person right now. Trying to decide if I want to purchase another one or not - I loved it when it worked but this is a lot of money to spend on a camera every year.", "Date": "March 25, 2014"}, {"Title": "Really good!!", "Author": "Cristian Gonzalez", "ReviewID": "R2EVTBTAJJPS1", "Overall": "5.0", "Content": "Camera meet the expectations and works great under water promptly let the specifications, was what I needed.  I recommend it 100%", "Date": "March 25, 2014"}, {"Title": "I've had better Nikon products.", "Author": "TJ", "ReviewID": "R17GGDTICI1SMG", "Overall": "2.0", "Content": "I'm going to return this product.  I think it could take better pictures (as my other Nikon camera does), give me more control of the scene selection, controls could be easier to navigate, the macro shortcut doesn't work, and the zoom lever is tiny and inconveniently located.  I also think that the camera is a little slow in processing the photos.", "Date": "March 23, 2014"}, {"Title": "second time in the water and it broke", "Author": "BCG \"brunocg\"", "ReviewID": "R2J3G6AZ4EGP9W", "Overall": "1.0", "Content": "bad product. second time in the water and it broke. don't buy it. Returning mine as I write this review.", "Date": "March 6, 2014"}, {"Title": "coolpix Camera", "Author": "cotton", "ReviewID": "R169D8SH83KDTN", "Overall": "4.0", "Content": "love it think it will be great for trips and  having the GPS so you know where pic was taken make it top of the line", "Date": "March 4, 2014"}, {"Title": "Waterproof", "Author": "M. Bisha \"Maureen\"", "ReviewID": "R28ESI2FV0S0AR", "Overall": "2.0", "Content": "Had to return because the camera became damaged after using underwater.  I found that to be very disappointing since I was on a cruise and was unable to get the pictures I wanted.", "Date": "February 19, 2014"}, {"Title": "AWESOME", "Author": "chasinokie", "ReviewID": "R46KTE1YW0E4U", "Overall": "5.0", "Content": "Used it from taking pictures of the Volcano in Hawaii to the Ocean worked awesome all teh way around. Great", "Date": "February 14, 2014"}, {"Title": "this is the real deal", "Author": "Amazon Customer \"livelife\"", "ReviewID": "R3EMQFMPKWAHDE", "Overall": "5.0", "Content": "I like the camera a lot I would like the iOS software to be able to do a bit more a bit faster but it all works and rather nicely. Camera takes great pictures far far better then a phone can and even more important you can take pictures without breaking your phone to do so. It is small and light. And it is a Nikon so the quality implied is found there.", "Date": "February 12, 2014"}, {"Title": "Horrible battery life", "Author": "Sara Weber", "ReviewID": "R27WTWMTUFU3F2", "Overall": "2.0", "Content": "We brought this camera for a beach vacation. The pictures weren't bad for a point and shoot. I didn't use it underwater much, but wanted something more durable than my DSLR for the beach.We returned it the day we got home because the battery wouldn't even last a day, with moderate camera use.", "Date": "January 22, 2014"}, {"Title": "Nikon COOLPIX AW110 Wi-Fi and Waterproof Digital Camera with GPS (Orange)", "Author": "K West", "ReviewID": "R2UYQVN9GGPKPM", "Overall": "5.0", "Content": "My phone is not smart enough to take photos, so I ordered this camera to do the job. I'm sure it will take me a while to learn how to use all the features, but so far, I love it.", "Date": "January 17, 2014"}, {"Title": "Deceivingly awesome. Perfect honeymoon gift!", "Author": "robstak", "ReviewID": "R1PZNHPDBM7ZJ4", "Overall": "5.0", "Content": "My wife bought this and I was REALLY skeptical... who buys a point and shoot these days?! And since when do waterproof cameras look like regular cameras!? Guess I am out of touch. This camera is great! It's hard to value the piece of mind that comes with having a significant piece of technology be waterproof until you have one and use it regularly. Invaluable really.The camera itself is probably about what you'd expect image quality-wise. The modes etc are typical of point and shoots - no surprise there. The GPS ability was a neat thing to have while we were on our honeymoon in Hawaii.We liked it so much that we bought another for my mother for Christmas. No more ugly bulky crappy underwater pictures!", "Date": "January 17, 2014"}, {"Title": "What a Great Camera!", "Author": "dina hammond", "ReviewID": "R3O09NUKSRAO06", "Overall": "5.0", "Content": "The perfect choice for my son. He can take this camera camping, hiking, hunting, canoeing...you name it - this camera can go along for the fun and capture all the memories!", "Date": "January 17, 2014"}, {"Title": "High quality, works perfectly, and so simple", "Author": "herethereandeverywhere", "ReviewID": "RX15HVW9R1WP7", "Overall": "5.0", "Content": "Used this snorkeling in the Bahamas. So simple to switch to underwater use. Still can't figure out how the camera outside of the battery/memory card chamber don't get ruined, but they don't. It's fantastic! The picture quality is amazing! Looks like something out of National Geographic. Other settings work great too. Love this camera.", "Date": "January 16, 2014"}, {"Title": "THE WIFI IS POOR QUALITY", "Author": "PAUL", "ReviewID": "R3ATG5IJ2NJKUG", "Overall": "3.0", "Content": "Comes with caseGreat underwater shots, (about 10-12 ft saltwater)Wifi difficult to set up, and mine locked up (sending for a replacement)GPS is neat, but an easier wifi process would have been more beneficialSeems very ruggedThe NIkon floater strap is a must, and it DOES support the camera (salt water, not tested in fresh)", "Date": "January 16, 2014"}, {"Title": "Great camera!!", "Author": "Mike Mulcahy", "ReviewID": "R3SPFD5LC6TEK3", "Overall": "5.0", "Content": "I got this camera for my wife because the last Nikon point-and-shoot we had she broke. So I thought one that is shock,water and freeze proof was just what we needed! + the wifi on it is a cool thing to have she can upload the photos she takes to her phone and then post them on FB.Great camera does everything it says it will do!!", "Date": "January 16, 2014"}, {"Title": "Recomend Great buy", "Author": "Sandi Haynes", "ReviewID": "R1PB7S6X6H8EIQ", "Overall": "5.0", "Content": "My new coolpix AW110 is just what I wanted. Easy, Fun, perfect pictures and an all around great camera. It works with ease underwater and is not bulky in any way.", "Date": "January 15, 2014"}, {"Title": "Recommended", "Author": "DANIEL COSTA PICCHI", "ReviewID": "R2J5MFO4AEMDG7", "Overall": "5.0", "Content": "Wonderful camera. Beautiful photos and nice features. The build quality is very high and it feels great in hand. Approved.", "Date": "January 13, 2014"}, {"Title": "Great Camera", "Author": "Scott Bollinger", "ReviewID": "R3T429JMVNLKS6", "Overall": "5.0", "Content": "This is a great deal! We bought this as a gift for our daughter. She loves it! It was the best deal around and we price shopped every where! Prime gave us the 2 day free shipping advantage which we love! This is a quality camera with many features!", "Date": "January 13, 2014"}, {"Title": "Cool camera", "Author": "Buffalo river rat", "ReviewID": "R3ETHU7BWRRB4F", "Overall": "4.0", "Content": "I'm a duck hunter and a river paddler so I wanted something that I didn't have to worry about getting wet.  Love that feature.  I also love being able to download the pictures to my phone.  Its a little clumsy process, but maybe that's me and its a lot better than having to sync to your computer every time.  You can share your pictures immediately.", "Date": "January 9, 2014"}, {"Title": "Science teacher aproved", "Author": "James Henderson", "ReviewID": "RU1LP8IYIZQBK", "Overall": "5.0", "Content": "My wife, who is a science teacher, loves the camera. The low light option and the light weight to a fully packed camera is a great personal camera.", "Date": "January 8, 2014"}, {"Title": "not as good as aw100", "Author": "Rakesh", "ReviewID": "RAN8GR5PUQFUY", "Overall": "2.0", "Content": "I had AW100 but I lost it in Oahu so I had to buy this as AW100 is no longer available now. It looks similar but not the same quality it seems. It shows vapor forming in the LCD panel after couple of underwater uses. Also it pops up a message whenever it detects water \"Under water user, do you wish to record GPS location\" which is very annoying. The pic mode is also very prone to be changed accidentally and  that screwed up my lot of pictures, it got changed to VGA  which I never did purposely and lot of my pictures look ugly. I finally returned it.", "Date": "January 7, 2014"}, {"Title": "Get a Canon, and dont think twice", "Author": "andrea kozak", "ReviewID": "RCA4E95M5F19O", "Overall": "2.0", "Content": "Purchased for its durability, compactness, and waterproofness. Its great fun in the pool & completely safe after being dropped. But, if you want this camera to take reasonable pictures of anything that moves, don't bother, you're wasting your time. Camera sucks at action shots, taking pictures of pets, or indoor/dim lighting. Once again, nikon wastes their R&D; on gimmicks and forgets about simple basics like good lenses & functional camera settings. I'll never buy another nikon point & shoot, sticking with canon all the way", "Date": "January 3, 2014"}, {"Title": "Love this camera", "Author": "bay maximo", "ReviewID": "R2LKX3ES2M515Z", "Overall": "5.0", "Content": "I used to own the Nikon AW100 which I used for snorkeling for over a year.  I probably used it around 20 times and never had a problem until I accidentally sat down on it and cracked the screen.  Fortunately, it still under warranty so I sent it to Nikon and they either replaced the screen or gave me a new one.  Not really a photography expert but I love the photo quality and also the video quality.  Came upon the Nikon AW110, so my nephew now have my Nikon AW100, which I'm sure he's excited to use.  Only used the Nikon AW110 twice while snorkeling in Guam and so far, so good.  I just wished I bought an extra battery.  Love the GPS feature also and have used it a few times as a GPS just fooling around.  Not really detailed GPS map but you'll get a general idea where you are definitely.  Hope this helps.", "Date": "January 2, 2014"}, {"Title": "Coolpix", "Author": "Jill C. Patterson", "ReviewID": "R11YJWI1155HI3", "Overall": "5.0", "Content": "This camera is great. I am not real tech savvy but I can use it and it takes great pictures. I still have more to learn about it", "Date": "January 1, 2014"}, {"Title": "Great shots, easy to use.", "Author": "Eddy Cano", "ReviewID": "R2L4ZBNK5W2UF1", "Overall": "5.0", "Content": "This is a very nice camera. You do need an additional battery for a two dive trip. The battery runs out fast.", "Date": "December 30, 2013"}, {"Title": "Amazing!", "Author": "shana bolliger", "ReviewID": "R3OVMRGTHUAL5L", "Overall": "5.0", "Content": "This was a gift for my daughter who is an avide photographer. She was amazed! The GPS lets you know not only the direction you are shooting but the altitude as well. This will be the perfect camera for our upcoming trip to Costa Rica as well as our numerous hikes in the mountains of Colorado.", "Date": "December 30, 2013"}, {"Title": "Coolpix AW110 - Best Camera I have", "Author": "Mark C. Eiseman \"EiSEMax04\"", "ReviewID": "R1OXFIG640QTUC", "Overall": "5.0", "Content": "I love this camera.  We took it to Disney World and it was awesome.  Video is great quality and easy to use, the GPS is very accurate (+/- 5-6 feet) and the photos are great.  I would recommend a fast 40mb/s or faster Class 10 SD card.  Definitely helps with write speeds.", "Date": "December 27, 2013"}, {"Title": "excellent and resistant", "Author": "Ricardo Mendoza Pamplona", "ReviewID": "R16GH28S23EIPA", "Overall": "5.0", "Content": "I took it the first day to the crag so I could film a student's climb, my dog decided to hit the tripod and send it tumbling as a big tree.  The camera hit the hard ground right in display and the camera suffered just a small scratch but kept filming and working without a glitch. Excellent speed (class 10 SD card) and beautiful definition in the videos and photos.If I had a complaint is that the battery charger is somewhat bulky for it uses a long cable cord; do not get me wrong, in many situations this type of battery charger es extraordinary, just wish it has a way to transform it into a wall mount charger (easier for some kind of trips).  Nevertheless, the camera is far more important than the charger and this camera is worth carrying the cable cord.", "Date": "December 27, 2013"}, {"Title": "Perfect gift", "Author": "S. Neill \"Sharon N\"", "ReviewID": "R2GRQ061U751B9", "Overall": "5.0", "Content": "This is just what my husband wanted to replace his old camera.  He's having fun learning all the new features and rxtras.", "Date": "December 18, 2013"}, {"Title": "The Best in class", "Author": "Gerald L. Sweet", "ReviewID": "R17NW7GXV3SRPS", "Overall": "5.0", "Content": "I bought it to take pictures, but it does so much more. WiFi Remote control through your phone. WiFi upload and down load. GPS on all photos posted to maps. GPS log of trip. I even used to world map to navigate while in Ecuador. It even has city streets and hotels.", "Date": "December 17, 2013"}, {"Title": "Great, easy to use camera.", "Author": "rhitch201", "ReviewID": "R3QWCODTOYBKKK", "Overall": "5.0", "Content": "This camera is easy to use and produces great photos.  So far it hasn't even been in the rain so no review on its waterproof abilities.  Would recommend and buy again.", "Date": "November 27, 2013"}, {"Title": "Can't fault this very useful and tough little camera", "Author": "raftflyski", "ReviewID": "R1ZPL48V4XPRP8", "Overall": "5.0", "Content": "Great for hiking no matter the weather.  I put it in my pocket on a 2 week adventure trip hiking through Patagonia and Easter Island.  Never worried about the camera and I took a few hundred photos.  The camera took real good quality photos.  In comparing them to the photos taken by other members of my group who were carrying and dealing with full size SLR cameras, I did real well with my little COOLPIX in the quality of photos we all shared.  I have a Canon EOS and usually haul it in my pack, but due to some tough weather I used the COOLPIX exclusively and am very happy with it.  It did take a pretty hard bump one day and it was out in plenty of wet conditions and held up fine in every way.  It has many fun to try features. like night landscape settings, etc.  The night landscape setting worked great on the sunset pictures I took of the Easter Island Moai statues and more.  Great little tough camera for outdoor fun.", "Date": "November 26, 2013"}, {"Title": "Finally a camera that can hold up to our toddlers :)", "Author": "james arsenault", "ReviewID": "R2AHHUIBFYPH4D", "Overall": "5.0", "Content": "We love out new camera the pictures are beautiful, I would like to purchase an extra battery for when one is charging because we are constantly on the go and those adorable moments are continuous.  Would def. buy again.", "Date": "November 24, 2013"}, {"Title": "very happy", "Author": "Okie", "ReviewID": "R2SIKSGME2PZP4", "Overall": "5.0", "Content": "Birthday gift that has treated me well.  Trip to Florida and to a lake close to home, used as a general camera. Nothing bad to say and has worked like a charm. I did buy a cheap floating wrist thing to connect to the camera in case it got dropped in the water.", "Date": "November 17, 2013"}, {"Title": "Great vacation camera!", "Author": "Gil", "ReviewID": "R392J27TK385ED", "Overall": "5.0", "Content": "Great multipurpose camera! Underwater shots are sharp and clear, and battery life is generous. Optics are very good for a point and shoot camera. Waterproof housing is durable.", "Date": "October 28, 2013"}, {"Title": "One star should be self explanatory.", "Author": "Kay", "ReviewID": "R1DDIMN65Q5KOE", "Overall": "1.0", "Content": "I had this camera out of the box for a day and now it's right back in it and getting sent back. I started out wondering what I had gotten when the buttons on the camera were \"sloppy.\" I ignored that and continued to take pictures and videos to get a feel for the camera and it's different features. Zooming was impossible. The lens simply would not focus. I kept getting a screen message saying, \"initializing lens. Cannot focus.\" Well...no kidding! On the video's anything I zoomed into turned out blurry. With stills the lens either did not focus at all and the pictures were blurred or if it did manage to have a clear moment, the pictures turned out very grainy. Overall I was not impressed with the quality of pictures this took at all.I bought this because it was waterproof and could be used to take underwater pictures. Little is said in the manual about how to do that, however.  There are some \"don'ts,\" but no tips or hints or instructions that might help someone doing underwater shots for the first time. This camera was a huge disappointment. I had read reviews and researched other cameras with similar features and decided on this one. My mistake.", "Date": "August 23, 2013"}, {"Title": "a couple issues...", "Author": "A. Lowell \"lowella\"", "ReviewID": "RTVDUTQDBJ4VC", "Overall": "3.0", "Content": "I love the camera, but the zoom isn't what I'm used to with panasonic's similar model (which I returned due to audio problems), and it's SLOW slow slow on battery power in comparison.  It is brand new and I also tried off-brand batteries in an attempt to get quicker pics.", "Date": "August 7, 2013"}, {"Title": "IT'S NOT WATERPROOF!", "Author": "Diogo Gomes Reginato", "ReviewID": "R3NY42BRXGBE3I", "Overall": "1.0", "Content": "I am a client of Nikon few years ago and have always been very pleased with the brand and have only cameras of the brand.Currently have a Nikon D7000 with three sets of lenses and I want to buy the D800.Last year I bought a Nikon AW110.After 3 months of use, when I never exceed the depth limits specified, I noticed that it started to show condensation on the lens and LCD screen, which progressively increased to a few drops of water.This has become to obscure and take bad photos .The specification of the camera is for up to 18 meters. I do not dive, I only use the machine in pool and sea to ordinary photos, never surpassed that is 3 meters.I thought it was defective on my unit, which has made ​​me extremely unhappy .However, when talking to a friend, I discovered that he has the same problem as me.I wish Nikon would take more care with the quality of their products.Although still find their unbeatable DSLR, now I'm looking for a better camera waterproof for purchase.", "Date": "February 3, 2014"}, {"Title": "Black screen of death after first day of snorkeling", "Author": "Marlo Youde", "ReviewID": "RJP5YMXS33NDH", "Overall": "1.0", "Content": "We purchased this camera for our trip to St. John.  What a mistake!  Display died after our first day of snorkeling and water may have gotten under screen.  Camera should be waterproof to dive up to 59 feet!  Amazon should pull this camera from their web site.  It is a piece of junk and huge disappointment when you pay good money to purchase something to capture your vacation memories and end up having to buy expensive, crappy, disposable cameras.  I would rate it no stars, if possible.", "Date": "July 11, 2013"}, {"Title": "Nikon AW110", "Author": "Louis", "ReviewID": "R591BN3QUIF4S", "Overall": "5.0", "Content": "Love this camera! Photos are great and it is wonderful to be able to take this anywhere and not have to worry about damaging it! Love this camera! Highly recommend it! Performs best in full sun, but on a cloudy day the photos aren't as great easy enough to fix with a computer program though. Love this powerful P&S; camera! GREAT product Nikon!!!", "Date": "May 30, 2013"}, {"Title": "Careful with EXIF Data - Battery Life is very poor - otherwise good build and features", "Author": "David", "ReviewID": "R1UBKPZVAGPRU1", "Overall": "3.0", "Content": "First and foremost- caution when uploading a picture when the EXIF data on the file will contain GPS tracking information. That information stays with the image and can place stalkers to the exact location where the image was taken.Second, battery life will require that if you want to depend on it, it will last only a day. Either have an extra battery if you on the trail, or have the charger handy at night. Dont use flash unless you really want it.Nice features and the video is pretty good for a little portable. Image qual is only fair - color seems to look like 256k not very discreet color. so while it is 18MP- it's a bit of a waste as the images are soft anyway past 8x10.I like it as an outdoor action camera that can take some abuse and be in and near the water without worries. It's a snapshot camera. Any expectation for super delicate images where you get rich detail in the shadows and un-blownout highlights are not going to come from this camera.", "Date": "May 21, 2013"}, {"Title": "Nikon - what else do you need to know", "Author": "Alex McCarthy", "ReviewID": "R2PTAP0640AAO5", "Overall": "5.0", "Content": "This little camera is awesome! Done.We are planning a trip out of the country, and we plan on going scuba diving or at least snorkeling around some shallow coral reefs in a few months. I only plan on taking this down maybe 20 feet at most, so it should do just fine for that application.I've been playing around with normal pictures. This camera is totally awesome. It's one of those cameras that the display ON the camera, is just that.. a display. Meaning, when you put the picture on a HD tv, or computer monitor, the picture is a ton better! The camera has all kinds of preset modes. Pet, low light, party indoor, macro, fireworks, etc. You can easily / quickly navigate to the presets and manual settings. The zoom is all digital - so .. it's.. okay. But, at 16 megapixels, you can zoom all you want to, later at home.The battery life is average. If you are using the GPS, and tracking yourself, and doing all of this optional stuff, yeah - the battery dies out decently fast. Otherwise, it's average. So I purchased a 3rd party battery and charger kit for super cheap here on Amazon.com.The build quality on this camera is super solid. It is somewhat beefy and has a heft to it. Nothing that will tear your pants off of you or anything. But, it's not dinky feeling by far.The memory card and battery pack are inside of a closed water-tight hatch. Thats where the connectors are too. So, you don't have some junky little plastic flap covering a USB connetion - hoping its closed when you get under the water. heheheh. It's a sure closure, with a lock mechanism. I don't think you could accidentally open it under water by bumping it.Awesome camera. Highly recommended. Geeky. GPS and workable map installed. Very cool.", "Date": "May 16, 2013"}, {"Title": "Do Not Buy This Camera", "Author": "jeanne storm", "ReviewID": "RJ6S29TGGNI03", "Overall": "1.0", "Content": "Purchased this camera based on its advertised capabilities, “waterproof to 59ft”.  After two days of owning it and normal use while on vacation in and out of a pool, never going below 2ft, the display on the back stopped working.  The camera still functioned without the display but there’s not much you can do with it.OK, stuff like this happens … it must be a defective camera.  Returned the camera to Nikon’s warranty department in New York, who then sub-contracts and ships it to Precision Camera in CT, who then sent the camera back to me stating “Returning unit unrepaired, unit is beyond economical repair due to liquid damage”.Upon talking with Nikon Service about this, their reply “sorry nothing we can do”, Precision Camera makes the call; you will need to talk to them.  After pointing out that the camera was used in a normal manor and failed, your sub-contractor (Precision Camera) says it cannot be repaired and that the warranty is with you Nikon for replacement, their reply “too bad, thanks for being a Nikon customer”.So, buyer beware!  If you are counting on this camera to perform while on vacation you might want to look at something else.  If you are looking for a camera that you can use in a pool, you should definitely look at something else.  And, if you are looking for a company that will stand behind their products, you should definitely look at someone else.", "Date": "May 14, 2014"}, {"Title": "Great camera but NOT waterproof", "Author": "Stephen", "ReviewID": "R3SKHPFRJT0O9O", "Overall": "3.0", "Content": "This is a great camera for the price and is fine if you're using it in quiet, shallow water.  But DON'T take it in flowing water (in a river).  It cannot withstand the force of the flow and will leak.  Once that happens your camera is pretty well ruined.", "Date": "May 2, 2014"}, {"Title": "waste of money", "Author": "E Thomen", "ReviewID": "R29V9MV9C8E2DG", "Overall": "1.0", "Content": "I bought this camera for my honeymoon to Curacao.  It died the first time i took it in the water.  I called Nikon and they said their warranty doesn't cover water damage.  This camera is not waterproof at all!  I can have it repaired for about 140.00. it's  Not worth it to me.  I will count my losses and not not deal with Nikon anymore.", "Date": "April 25, 2014"}, {"Title": "Nikon Coolpix", "Author": "Michael Jacobs", "ReviewID": "R3830QUM6L43ZP", "Overall": "5.0", "Content": "Great camera for the active and adventurous family or individual.  It's easy to use, shoots fine pictures and is durable.", "Date": "April 24, 2014"}, {"Title": "DO NOT BUY", "Author": "Zofia", "ReviewID": "RHQV9OPV21ULC", "Overall": "1.0", "Content": "I bought this camera specifically for a cruise and scuba diving.  It worked for two days. I DID NOT even go underwater and the screen went completely blank. SO DISAPPOINTED. I got insurance and was told that if anything happens to the camera, I would get a new free one. HOWEVER, the fact that  liquid damage  is not covered, yet this camera is waterproof, is quite obsurd in my opinion. I had to buy a one time use camera for scuba diving. Please do not make the same mistake I made", "Date": "April 17, 2014"}, {"Title": "did not work", "Author": "jim young", "ReviewID": "RQ7FU2FZJ319N", "Overall": "1.0", "Content": "Out of the box the camera did not work. Very disappointing.  I have sent it back to Amazon for a replacement.", "Date": "March 27, 2014"}, {"Title": "Complete Crap", "Author": "Alexander", "ReviewID": "R2KBNIF513Y7Z6", "Overall": "1.0", "Content": "Do not buy. The pictures seemed ok quality but mine stopped working after sitting in a desk for 2 months. Never got wet, never dropped, never even used except for a few test pictures of my dog. I believe there are a lot of other reviews stating the same thing. I will write an update after I contact Nikon. Don't waste the money!", "Date": "March 9, 2014"}, {"Title": "Good camera but issues", "Author": "Jason", "ReviewID": "R797C8G00VODB", "Overall": "3.0", "Content": "I've owned this camera now for just under 30 days and have used to it on camping.hiking/backpacking trips making videos and taking pictures. I've hooked up a tripod and monopod into this camera for \"selfie\" type shoots. I'm currently awaiting a replacement because, even though I was careful, somehow my tripod mount screw at the bottom has become stripped already and the camera falls right off the tripod....The camera shoots amazing videos and takes amazing photos for a point and shoot and the built-in wifi has been fantastic, especially for taking pictures of you and buddies from a distance at points of interest along hikes.My gripes about the camera are:battery is horrible in cold temperatures. Like really I couldn't even shoot a 15 minute video without have to use a spare battery. (i now have 6 batteries for the camera)the zoom isn't all the goodThe screw in port for the tripod is plastic, who does that.If you are going to be hooking this up to a tripod a lot consider a different camera or go ahead and purchase a repair kit and a few extra batteries with your first order..EDIT: Actually this will fix the tripod screw issue [...]", "Date": "January 28, 2014"}, {"Title": "Great", "Author": "Charles W. Cohoon", "ReviewID": "R3IIVZJG9KB5FK", "Overall": "5.0", "Content": "Replaced on that was stolen.  Many, many options, easy to carry, waterproof.  Optional filters available makes it easier to get yet better pictures if you're into that.", "Date": "January 28, 2014"}, {"Title": "Nikon Coolpix camera excellent", "Author": "Hilde Gilroy", "ReviewID": "R2OGNUBPWBP2LE", "Overall": "4.0", "Content": "Took camera to Anartica.  It took clear concise videos and photos. Unable to connect to computer to figure out how to connect to other devices. So far would absolutely recommend this camera", "Date": "December 27, 2013"}, {"Title": "I did not like it.", "Author": "Lucia Villanea Morales", "ReviewID": "RB03IFBXL6D00", "Overall": "1.0", "Content": "I did not like it, because was not in good condition. This item was new; however,it did not last.  It stopped working, I was asking for an explanation regarding the warranty, and no answer was received.", "Date": "December 25, 2013"}, {"Title": "Worst camera I have ever owned", "Author": "JMcDuff", "ReviewID": "R2RQE00GGXLQVV", "Overall": "1.0", "Content": "Quite simply the worst camera I have ever owned.  I should qualify that to say the worst digital camera.  I moved to the coolpix after having \"leakage\" problems with the Olympus stylus tough.  I have been disappointed since day 1.  It is slow to respond.  The flash is way too strong and the pictures are poor.I cannot wait until I can afford to buy another camera.", "Date": "December 15, 2013"}, {"Title": "NOT A WATERPROOF CAMERA!!!", "Author": "Jon", "ReviewID": "R1B2CH6ERGT9WC", "Overall": "1.0", "Content": "Seriously, if you're considering this for any underwater photography... STEER CLEAR!!!  As others have posted, this camera isn't waterproof.  Used snorkeling and it died on the third time used.  Followed all instructions to the letter, yet the lens fogged up and camera wouldn't turn on again.  Would give a Battery overheated message and shut down.  So, 3 days into a 16 day vacation, our camera was rendered useless.  Thankfully we had our phones for land shots, but missed a ton of great opportunities underwater.SAVE YOUR MONEY and look for something else.", "Date": "December 9, 2013"}, {"Title": "Black screen", "Author": "Kevin", "ReviewID": "RE4P9OBPCXMHH", "Overall": "2.0", "Content": "Had camera for about 5 months. Everything worked fine. Took it on a Jamaica vacation wanting not get Some underwater pics. Well it worked on the beach day one, day two worked well until the screen went black..... Did not  appear to have any leaks, all dry. Sent to Nikon and it was replaced under warranty with a brand new boxed camera.  So 5 stars for Nikon support.  Have another trip scheduled in January..... Hopefully they have the screen issue resolved.", "Date": "November 27, 2013"}, {"Title": "Not up to Nikon standards", "Author": "T. J. Reichert", "ReviewID": "R1DHP9PZYH8YIG", "Overall": "1.0", "Content": "Purchased this camera for a trip to the Tahiti Islands.  The camera lasted only two snorkeling dives and died.The screen went black and has not worked since I am sure this is a problem with this Nikon camera and would strongly recommend you look elsewhere for an underwater camera.  I have several Nikon cameras and love them all but this camera is a lemon for sure.", "Date": "November 23, 2013"}, {"Title": "very bad cam compairing with sony , bad perfomance , seling and front face bad quality , i never recomend to by this cam", "Author": "Alaa Al-Mosallam", "ReviewID": "R2UHM3SIY90HQD", "Overall": "2.0", "Content": "i got w100 its the same like w110 , over a year ago, i used it in ,y safary trips and under water last summer i lost the camera face (the blue face) it is still working but you cam imagen how it looks like , i fond a fog in the lince too before this but it is still working too , i had to wait two days till that fog disappear , the camers is slow capturing compairing with sony and the pixs is not good at all , i bought a nikon and thought that i got the best to get some great picx for my trips but for sure i'll never ever recomend nikon specialy w xxx for any one , if you want speedy shots with clear res. never think about w100 or 110", "Date": "November 9, 2013"}, {"Title": "Awesome camera that worked very well both in the water and out", "Author": "Donna Fraizer", "ReviewID": "R3DLJ0B4UQ21E7", "Overall": "5.0", "Content": "Awesome camera that worked very well both in the water and out of the water. Loved how easy it was to use and change settings", "Date": "November 5, 2013"}, {"Title": "Excellent Little Camera", "Author": "S. A. Cover", "ReviewID": "RWTU36K5U66PR", "Overall": "4.0", "Content": "This was purchased to replace my wife's aging pocket camera.It has turned out to be very good as used.Before buying, we reviewed most of the poor reviews for this little gem.All complaints were for failures when used under water.The picture download port is located inside of the water tight access door to the battery and memory chip.Close attention to detail for keeping the seal clean and proper fit of the door should alleviate water problems.However, we have no intention to ever use it under water.When used for casual snapshots it is excellent.I can highly recommend this cute little camera.", "Date": "November 3, 2013"}, {"Title": "Can't say enough good things about the Nikon COOLPIX AW110", "Author": "calphin", "ReviewID": "RCU0DIESKP39F", "Overall": "5.0", "Content": "I bought this camera for a kayaking trip.  We would be going through rapids, so I didn't want to risk taking pics with my iPhone or other Nikon (non-waterproof) camera.  This camera took AMAZING pictures!  The features are well worth the money.  The key is picking the right setting for the right kind of lighting.  The pics are crisp, clear and true.  It's also very tough!  We took turns with the camera as we each got pics of each other making it over the waterfalls.  A friend who had the camera at the time, capsized and got pinned against a boulder.  She was fine, but the camera really took a beating.  It was fully submerged and hit the rock before she did.  Not a scratch on it, though!  Nothing slowed this camera down.  I absolutely love it and based on it's rugged durability and picture quality, it's now my go-to camera whether I'm on the water or not.  I spent weeks researching cameras and I'm very happy that I went with the Nikon COOPIX AW110  The GPS comes in handy when you're hiking or kayaking pretty far.  We kayaked 8 miles the first day and there were several times the river split and we weren't sure which direction to go.  My friends couldn't get a signal on their phone to use their map, but we could use the GPS on the camera.  If you have any trouble picking the right settings for the right set-up, just go to youtube and search for this camera.  There are MANY helpful demos.  If you're still trying to make up your mind, youtube also has some great reviews that compare this camera with several other top brands.  Can't wait to hit the next river with this thing!  Oh and it takes pics in a flash, too.  There were many times we caught wildlife along the river that we had no warning of and only seconds to get a good shot.  I kept the camera hooked to my life jacket (when it was my turn to carry it) so it was always within reach.  I also purchases the Nikon float for the camera....you don't want this thing getting away if you do capsize!  Many people lost cameras going over the waterfalls b/c they didn't have a float.  The cameras just sank to the bottom.", "Date": "October 24, 2013"}, {"Title": "Best underwater / Tough camera!", "Author": "Jay", "ReviewID": "R18IMYCLHCMSED", "Overall": "5.0", "Content": "I did a lot of research online before purchasing this. It was close between the Panasonic Lumix DMC-TS3 and this, but the price on this is so much better! The performance is great. The colors are captured very accurately. I was expecting something bulkier but we now use this as our primary camera. We got this for our cruise vacation. We took it hiking up Dunns River falls, and I even took a video going down a waterslide with it. Great camera!", "Date": "October 23, 2013"}, {"Title": "Great field camera.", "Author": "B. Smith", "ReviewID": "R2H25K36BPDI66", "Overall": "4.0", "Content": "We use this for our field camera and it gets a lot of outdoor use. The GPS is real handy for documenting location. Photos are of good quality.", "Date": "October 20, 2013"}, {"Title": "Worked well snorkelling !", "Author": "Stephen Mutch", "ReviewID": "R3CZRJDAAWVQUA", "Overall": "4.0", "Content": "Took a recent to the holiday to the Maldives.- Worked well under water. Appears robust.- More than adequate point and shoot camera out of it.- No leakages etc. Worked flawlessly.- Photo modes very easy to use.- Video mode worked well. Underwater- Battery life so-so. Similar to my Canon S95.- Have not worked out the Wi-Fi function yet. Need instructions.Overall very happy. Fits all my need and for the price. Great value. More diving planned. Definite best buddy in water,", "Date": "October 12, 2013"}, {"Title": "Great Budget Camera", "Author": "Marcia", "ReviewID": "R2T4O12CFCU03V", "Overall": "5.0", "Content": "What can I say I love love this camera it is quite functionally and it take great pics !!! It lasted an entire week in and out of the sea!!", "Date": "October 10, 2013"}, {"Title": "Very good price and quality !", "Author": "Roberto H Yoneda", "ReviewID": "R52RT9YI5HCAG", "Overall": "5.0", "Content": "Nice camera, good quality pictures and nice Full HD movies. Battery life is good too ! Nikon is equal quality !", "Date": "October 2, 2013"}, {"Title": "Great", "Author": "Chris G. Georgoulis", "ReviewID": "R1SKEDDF5EWGLM", "Overall": "5.0", "Content": "Camera takes great pictures and video.  Underwater is great verey clear and crisp. Video is smooth with no pauses.  Has lots of options.", "Date": "September 9, 2013"}, {"Title": "Great Camera!", "Author": "Chris Wolff", "ReviewID": "R2HOTJFAOK5MNP", "Overall": "5.0", "Content": "I haven't learned all the ins and outs of the camera, but have shot still pictures and video.  Love it!", "Date": "August 31, 2013"}, {"Title": "great camera for the $$", "Author": "Daniel F. Pilgrim", "ReviewID": "R20ODOMS0UF1O7", "Overall": "5.0", "Content": "I bought this for my honeymoon and it really did a great job even is salt water.. just a trick.. rinse with fresh water to get the salt and sand out.", "Date": "August 31, 2013"}, {"Title": "Great a little camera", "Author": "William", "ReviewID": "R2OH9AMPQ9FEAI", "Overall": "5.0", "Content": "I am happy with the performance of this device. The GPS and Wi-Fi capability  make it more easy to transfers and back pictures/videos  up into  others devices.", "Date": "August 25, 2013"}, {"Title": "No issues", "Author": "Derrick Wasicki", "ReviewID": "R2OVMV7F9EKHXK", "Overall": "4.0", "Content": "I used the camera a week straight and had no issues with it in salt water underwater environents. Pics of coral and marine life (sharks, sea turtles, rays, etc) came out very clear. A solid choice and happy with this camera thus far.", "Date": "August 19, 2013"}, {"Title": "Waterproof Digital Camera", "Author": "L. Lake \"Bob\"", "ReviewID": "R2O5APHZXA2021", "Overall": "4.0", "Content": "I cant give it a 5 star rating yet, it is still new to be.. I do not go skin diving but wanted a camera that can take the abuses of home inspections in the rain, dropped in the water and used in crawlspaces.. So far it has worked great", "Date": "August 13, 2013"}, {"Title": "Coolpix Hands Down", "Author": "Brian", "ReviewID": "R1CX3ZL7O6CTGY", "Overall": "5.0", "Content": "Best Camera I have ever owned.  Can't go wrong with the price or the quality of the pictures.  A great value.", "Date": "August 13, 2013"}, {"Title": "Daughter loves it, great on hikes, swimming, some items complicated", "Author": "Jason Fay", "ReviewID": "R3AK9GPOFF907L", "Overall": "4.0", "Content": "The camera works great and takes nice pictures.  My daughter loved taking it into the pool and rafting and getting some underwater shots.Getting the GPS part to work was a bit complicated and it doesn't work well inside at all.", "Date": "August 11, 2013"}, {"Title": "Just breaking in", "Author": "Dwayne Dickerson \"Wildflower photographer\"", "ReviewID": "R2B27REK4T57B0", "Overall": "4.0", "Content": "Took to Balkans and was a delight to have it stuck in shirt pocket to back up Sony NEX 7.  For pure macro work when it is lying on the car seat, still like the Nikon D300 but may come a time when it doesn't make the trip.", "Date": "August 10, 2013"}, {"Title": "Nikon Coolpix AW110", "Author": "acousticmany", "ReviewID": "R1SJJVX80P7ZQI", "Overall": "5.0", "Content": "Great camera.  I have taken tons of photos with it.  Although I do prefer DSLR over point and shoots, this cameria is holding its own, especially with the adaptable filters you can use with it.  I had a 7 mp Sony point and shoot but that camera finally kicked the bucket after many fishing and hiking trips.  For not being waterproof or dropproof it held its own.I have yet to use the GPS or wireless feature on the AW110.  The main reason I purchased this camera was for fishing and particularly for hiking trips since packing light is essential on hiking trips.  No need to add the weight of a DSLR if a point and shoot can do just as a good a job especially if you are an experienced photographer.  I am going on a 6 day hiking trip on the Foothills Trail in South Carolina in November and I plan to put this camera to the test on its first hiking trip.  I will utilize the GPS feature and see how accurate it will be in the mountains.  I will still do a test run before taking it on the trip.  This trail is 77 miles long and packed with waterfalls and mountain views.Menus and features on the camera are easy to use and self explanatory really.  If you can manuever a DSLR's menus, then this is a piece of cake.I would definitely recommend this camera to any avid adventurer.  It is not a Go Pro but it gets the job done.", "Date": "August 2, 2013"}, {"Title": "Wi-Fi upload needs improvement", "Author": "Heather", "ReviewID": "R39S3H74D09ATX", "Overall": "4.0", "Content": "I like the camera. It takes great pictures. Under water worked great. Haven't dropped it yet. The Wi-Fi upload would lose connection when trying to move pics to my phone.", "Date": "August 1, 2013"}, {"Title": "Awesome", "Author": "Melanie", "ReviewID": "R6QOKIKAL3WJV", "Overall": "5.0", "Content": "I read the reviews before buying it. I didn't have a ton of money so I thought this one would be fine for going on float trips. Yeah it works great. Takes great videos and great pictures. I'm not a pro or anything, but I know when a camera is cruddy and this one made me very happy.", "Date": "August 1, 2013"}, {"Title": "This thing is a brick!", "Author": "winnypoo", "ReviewID": "R2ZTZ8X2TQAY9Q", "Overall": "5.0", "Content": "I bought this camera because I needed a camera I could take underwater for vacation, use in the snow for snowboarding, and throw around in the cockpit when I'm flying. Needless to say, this camera met and exceeded my expectations in performance. When I bought it, I expected some sort of picture-quality tradeoff for all the features this camera has. It didn't. The camera still delivers high-definition photos and videos. 1080p. Sound quality on the videos can suck if the source is farther away (such as at a live concert). If you're recording someone talking, you won't have a problem with it.I took this camera snorkeling, into the pool, and scuba diving down to 25 feet, and it's still kicking strong. I was worried at one point when there appeared to be a hazy film of moisture in the screen after leaving it in the pool for about an hour, but placing it in a sunny spot on some towels remedied that problem.Its auto mode is great for new camera users, but if you're a more advanced user, you can select different modes for different situations (there is a mode for every situation thinkable...from low-light outdoor landscape shots, to food shots, to pet shots).It also features a GPS system, which logs the exact coordinates (and compass direction you were facing!) of *almost* every photo you shoot (depends on GPS uplink connection). I thought that was pretty cool, because I travel a lot and think it's pretty interesting to be able to pull up a map of every location I've snapped a photo.I bought the 110 model, which features a wifi app that allows you to wirelessly link this thing to devices that do not have a SD card slot (e.g. Apple products). You'll have to install an app, but it's worth it. This app allows me to wirelessly transfer photos from my camera, take photos using my iPhone as a remote, and view albums from my phone.A feature I have yet to use is the I-have-fat-fingers/I-am-wearing-snowgloves button on the side of the camera. By depressing this button, you can flip through different commands such as \"take photos,\" \"view photos,\" \"change mode,\" etc. by simply shaking the camera. I expect to use this button a lot when I take my camera snowboarding this year. It has the qualities a Go-Pro, but with more options.Bottom line: If you're a world traveler, and are expecting to do a lot of diverse things on your trips, from the skies to the oceans, or from the slopes to the backpacking trails, this camera is for you.", "Date": "July 17, 2013"}, {"Title": "A great little camera, but the shake feature is useless", "Author": "Clara", "ReviewID": "R29UQ6MRORGVL9", "Overall": "5.0", "Content": "We live near the ocean and have boats and kayaks which we use regularly.  I've always been afraid to use my \"big\" camera - a Nikon D-90 - when on the water - thus the purchase of the AW110.So far it has performed perfectly.  Our grandkids have already given it a brutal test jumping into the salt water and snorkeling with it.I don't find the shake feature to be of any benefit and have turned it off - permanently.  It's a real waste of technology.I'm looking forward to further exploring with the camera as we travel to diverse and harsh environments.", "Date": "July 15, 2013"}, {"Title": "Great Backup Cam", "Author": "@_Bravo Photography", "ReviewID": "RV9JS4BA9HP4G", "Overall": "5.0", "Content": "I'm a professional photographer and I bought this camera after many review readings and comparisons to other models.  I used to have a Pentax WG-1 and I was needing to swap it for something newer as I was unhappy with the image quality.  I think I've made a good decision, this little buddy is awesome, colors are vivid, low light conditions barely affect the image quality and I love the camera look and feel.  The GPS and WIFI capabilities make this the perfect travel companion when hooking it up to an iPad or an iPhone.", "Date": "May 2, 2013"}, {"Title": "Brand new and only displayed an error screen. Absolute piece of junk, a $284 useless brick", "Author": "Francis Isidoro", "ReviewID": "RDFEH1W2TLNIV", "Overall": "1.0", "Content": "What is the minimum basic requirement that you should expect from a consumer electronic product in this day and age? That it should turn on and work.Like many of you, I bought this Nikon for a watersports-filled vacation, opened the box, charged the battery overnight, put the camera and the manual in my carry-on bag so I had something to do on the long flight. While in-flight I pulled out the camera expecting to learn all its features.I then pressed the ON button. Here's what happened: after several seconds of a blank screen,  a flash of white screen appeared together with a single exclamation point, then immediately blank screen again. Huh? I tried it again and again with the same result. I tried it with and without different memory cards. I tried it after pulling the battery out and back in, and making sure the battery orientation was correct. I studied the manual but found no special startup instructions or description of the exclamation point screen in the troubleshooting section.At the hotel I recharged the battery to make sure that wasn't the problem, but the next day the camera behaved similarly.To explain my prior camera history and experience, previously I've owned waterproof cameras by Olympus and Fuji but since gave them away to relatives. I also shoot with the Fuji X-100s, a Canon DSLR, and several Lumix micro four thirds cameras and lenses. For this waterproof camera, I should have chosen the Lumix or Olympus or even GoPro waterproof cameras, but I thought that this would be a good opportunity to try a Nikon interface.In this day and age a consumer electronic product from a major brand that flashes an error screen right out of the box? Disappointing poor quality. I'm never buying Nikon again.", "Date": "July 14, 2013"}, {"Title": "Great Camera", "Author": "Man of the World \"Traveler\"", "ReviewID": "R2QLC8ZS534ZYM", "Overall": "5.0", "Content": "Wow, this has to be a first. Wi-fi and GPS built in. Freezer proof, drop proof and waterproof. Pictures are super clear. Its great taking a picture from your smartphone. The camera also sends the pictures to the computer once you install the Nikon app to the Smartphone and computer. Must be peared. Purchase the Square Trade service agreement for 3 years for $50, Just incase, covers everything. Great way to protect your investment.", "Date": "June 3, 2013"}, {"Title": "Coolpix is not so cool after all", "Author": "Amazonian", "ReviewID": "RH6F12JCAGKP4", "Overall": "1.0", "Content": "After reading the reviews for both the AW100 and AW110 and reading up reviews and comparison articles on the Internet, I thought this would be the best bet and most reliable.  So I bought this camera and 2 days later took it to Hawaii thinking that I'll be set to take all the underwater photos I want.  I read the user manual and made sure there were no obstructions on the side compartment where the battery and memory card is located before heading out to go snorkeling.  Probably no more than 5-10mins in the water and the screen goes blank.  I can't seem to turn it back on.  I've let it dried out since then and sure enough the camera won't turn back on.  Dead in the water...quite literally.  I've put in a return request, so let's see if Amazon will reimburse me for this junk.  I will be shipping this back in the next few days.  Amazon's already informed me they're going to charge me a return fee.  I recommend not buy this to begin with, and if you're going to take the risk, buy it from Fry's instead. It's exactly the same price at Fry's, and if you return it, you'll at least be fully reimbursed and not have to pay a return fee.", "Date": "May 21, 2013"}, {"Title": "Worst \"Waterproof\" camera I've owned", "Author": "A. Duane Dickinson", "ReviewID": "R1JJBXIEXIXM56", "Overall": "1.0", "Content": "I have owned mainy waterproof Point and Shoots over the years.  This was the absolute worse.(please note, the camera was only opened & then closed immediately to charge the battery or remove memory card.  As well, the seal was always checked for debris before closing)Dry- Travel to Nepal & between the lense elements it would fog up if used often or in video mode.  So many photos wasted as blurred due to moisture.After trip, the camera was then sent in for warranty, and a new camera delivered.Wet -  used it on surface of water fine, when splashed.  Snorkling on the surface, and no more than 10ft deep, the camera died within in 5 mins and never recovered.Never again a Nikon…..", "Date": "January 30, 2014"}, {"Title": "Coolpix", "Author": "David21758", "ReviewID": "R17R5RUV8HIPLE", "Overall": "5.0", "Content": "I have used this on hikes in cold weather and rain and it has performed well.  I would recommend this product to my friends.", "Date": "December 4, 2013"}, {"Title": "Great Camera!!!", "Author": "James", "ReviewID": "RDWUSAM3Y55T4", "Overall": "5.0", "Content": "First off, it was shipped extremely fast.  The camera is amazing.  Takes great underwater photos and videos.  The out of water photos are great as well.  If you need a camera, this is the route to go friends!!!", "Date": "September 24, 2013"}, {"Title": "It leaked in water at 10' of water.", "Author": "Bradley E. Larsen \"B Larsen\"", "ReviewID": "RM8OJ2X1MY273", "Overall": "1.0", "Content": "Day 7 on 12 day vacation and it is water damaged in 10' of water. I have used this camera 3x in the water, on the 4th snorkeling trip it quit working. On shore I was trying to figure out what happened, I unlocked the seal and noticed the battery compartment was wet. I haven't contacted Nikon yet, it's Sunday and I have 4 days left in Maui. What a waste of money. Even if I do get this replaced I won't be in Maui for at least 3 more years.If I had it all to do over again I would have bought a Go Pro for the same money.", "Date": "June 23, 2013"}, {"Title": "Use your iPhone instead", "Author": "Stephen E. Kacir", "ReviewID": "R13DKLU165S3IU", "Overall": "1.0", "Content": "I have a Nikon D200 dSLR and take thousands of photos.  I wanted to have something more compact for less technical photos and videos and purchased the AW110 with an eye towards using it at zoos, aquariums, parks and on outings where a dSLR is too bulky or intrusive.  While the AW110 is smaller than I'd expected, it's not at all user friendly.  Even attempting to simply use the pre-programmed settings for macro close-ups, \"sports\" action, pets and similar functions failed to achieve the desired results.  More distressing, I would play with settings to get the image to look right on the screen then take a photo and find that the photo looked nothing like what the screen showed.  I would try to compensate to get the look I had seen on the screen and spent 15-20 minutes on a photo that I took & got the right look with one exposure from my iPhone.  Now granted it's an iPhone 5, but I really had expected the AW110 to be more effective and useful than an iPhone.  Apparently, this is not the case.  I got so frustrated with this little camera, I was tempted to throw it in the trash.  I went back to the car and got my dSLR and took photos that looked right after a single shot when the AW110 took 5-6 shots to achieve correct exposure.  In addition, the lens constantly fails to focus, then the camera software resets itself wasting time that could be spent shooting.  This was the biggest mistake I have ever made in purchasing photography equipment.", "Date": "June 20, 2013"}, {"Title": "Wish I had never bought it...", "Author": "MaxT", "ReviewID": "R2U2DVXF13DIRC", "Overall": "1.0", "Content": "Agonised over buying this for days after reading the mixed reviews - am travelling in Thailand and was in Bangkok heading south so wanted an underwater/rugged camera - was sucked in by the 18m waterproof and thought 'surely it can't be that bad and if I really take care of it I won't have the problems others mention'...2 weeks of owning it and treating it like a new born the following have been observed1) Someone described the screen as a scratch magnet - could not put it better myself - lady in the shop put a 'free' screen protector on - horrified when made it back to hotel and took it out and immediately noticed TWO scratches that look to have gone through the protector! I bought a case especially after purchasing and put it straight in there - How the **** did that happen?!! Right now the screen is scuffed pretty much all over and I don't know how it is happening so easily! I treat my iPhone (using now to write this) far worse and the screen still looks good as new - I've also just noticed the writing on the front is all rubbing off! Sure I don't really care about the looks but surely this should not be happening on a 'rugged' camera?2) I like to mess around with white balance - not impressed with the AWB and equally not impressed with the manual set white balance (which is kinda laborious to go and set each time too) much prefer my old canon IXUS3) I also like to mess about with long shutter times and kicked myself for forgetting to check if this camera can do it - it can't as far as I can work out... :( the longest is 4 seconds using the 'fireworks' scene mode... (Which means you also cannot use manual white balance in a scene mode...)4) Pictures - they're OK and I am most definitely no pro photographer but my old Canon IXUS that this has replaced seems to take far superior looking photo's5) The action button (the button you use to take the photo!) is hard to press and try to keep the camera still at the same time in my opinion6) The BIGGEST one and the reason that has prompted me to add this review is that the lens has just misted up!!! It's hardly been in the water! I tested it on day one in a sink full of water (break it in gently...) and no apparent problems - meticulously dried it and noticed there are holes around the lens area that were holding water in there so really let it dry out properly - since then it's been in the shallows in the sea twice (literally just took it in with me when paddling about in the surf at the shore) - taken back to hotel room and dried meticulously each time before opening battery cover... I am on the beach now and was just taking some shots then about to head in for a swim/snorkel and noticed the lens misted up...I am majorly ****** at myself and feel like kicking my own butt from here back to Bangkok to return it but I bought it knowing full well 'no returns' and that the warranty (Thailand only...) only covers 'faults' not water related damage...!How Nikon can sell this I don't know... Perhaps they will admit a design/build fault and some kind of recall?I will have a stab at trying to get my money back one way or another and attempt to contact Nikon directly (this is NOT a cheap camera!) but I think I have about as little chance of that happening as this camera surviving any more water related activities...Why people are giving it 5 stars and saying they have not even tried it in the water is beyond me - surely there are a billion and one cameras on the market that take just as good photos for a quarter of the price that work 'out of the water' - the uniqueness of the AW 110 is that it is supposed to be ruggedised no...? I mean that is what you're paying the money for right...?Really really really wish I had never bought it and that is so disappointing :(", "Date": "May 11, 2013"}, {"Title": "AW110 and AW100 really are junk...", "Author": "Dennis A Smith", "ReviewID": "R343HE5BL6RNCM", "Overall": "1.0", "Content": "I purchased an AW100 for cruising in the Bahamas, and the first time I took it underwater, the lens area filled with water.  It WAS replaced by Nikon.I received an AW110 as a replacement, and after four months it failed to operate.  Just dead.  Nikon wouldn't do anything, because the total time on BOTH cameras was 13 months.Never again, Nikon, never again.", "Date": "May 31, 2014"}, {"Title": "Big Mistake", "Author": "F. Mele \"PM\"", "ReviewID": "R2DOOAZ0Q1BLF", "Overall": "1.0", "Content": "I should have believed the reviews about this waterproof camera not being waterproof ...water resistant ,would also be false !! Ours failed in three feet of water while snorkeling", "Date": "May 29, 2014"}, {"Title": "this camera suck", "Author": "lenny ginn", "ReviewID": "R1V99VRPJ34NWE", "Overall": "1.0", "Content": "i bought this camera 3 month ago use it only twice!!!! TWICE!!!! the okay button that enter everything does not work! wont even let me change any setting. I can't believe i spent 300 buck on this. DON\"T bye this camera!!!! O did i tell you? this is my second one. First time shame on you second time shame on me Third well there won't be a third!!! period", "Date": "May 28, 2014"}, {"Title": "I wish I had read these reviews!", "Author": "Susan Dunsby", "ReviewID": "R24CED1AQ1OFL1", "Overall": "1.0", "Content": "Three times used my camera when snorkelling like many others the screen went blank and it appears water has go in. I am in Coral Bay Western Aust and will never likely to be here again; no pictures of whale sharks to share! Now have try and get it fixed. Not much joy all round.", "Date": "May 26, 2014"}, {"Title": "Bought it as a present for my husband and we both love it!", "Author": "Bea", "ReviewID": "R1O9BDS5YFFKU9", "Overall": "5.0", "Content": "Easy to use! Works great in day and night! Great underwater pictures, even better if you remember to put the underwater scene!", "Date": "May 26, 2014"}, {"Title": "Buyer Beware!!", "Author": "Downundermick \"CABAMBAMD\"", "ReviewID": "R3J4U04EZ77YPL", "Overall": "1.0", "Content": "Stay away from this camera!!  I had the exact same problem as many others who have written reviews  Used it one day snorkeling-- perfectly fine.  Actually shot some nice pics.  The next day the LED went completely blank.  Camera was always at the surface.  Buy at your own risk.  Nikon wont even acknowledge this is a design flaw despite I see now multiple postings with this issue!", "Date": "May 21, 2014"}, {"Title": "Timely and in perfect conditions!", "Author": "Serena", "ReviewID": "RXDIV9RSS0IX7", "Overall": "5.0", "Content": "Camera arrived on time and in perfect conditions. I can't rate the performances of the camera since i haven't used it yet as a waterproof.", "Date": "April 29, 2014"}, {"Title": "Dead screen may as well use a disposable camera", "Author": "Copine", "ReviewID": "RZ1G8DH37RT1X", "Overall": "1.0", "Content": "Bought this for my son and daughter in law for xmas.  they brought on our vacation a few weeks ago for their wedding and never really put it underwater though it may have received a few splashes and water drops (suppose to be waterproof) and on the 3rd day the screen gave out.  still took pictures, but really old school when you can't see what you are shooting.", "Date": "April 17, 2014"}, {"Title": "Leaked on day #4", "Author": "Footguy", "ReviewID": "R2SXL8TBAJKMIW", "Overall": "1.0", "Content": "Bought this at a local camera shop and was very careful, still leaked on day 4!! Would get a gopro next time!!", "Date": "April 14, 2014"}, {"Title": "COOL", "Author": "Doug", "ReviewID": "R3JHJTWDGJKG7T", "Overall": "5.0", "Content": "Awesome camera, getting ready to take it cuba divin'.  haven't used it much other than that.  The WI-FI to my iPhone ROCKS that thing has some range with very little to no lag time.... AWESOME CONCEPT and it works to boot......just hope it survives the water....", "Date": "April 1, 2014"}, {"Title": "It's great", "Author": "Miguel Angel Cortes Carmona", "ReviewID": "R1CF1124QXMQA", "Overall": "5.0", "Content": "Now i can take picture and film on the beach, in the water, the pictures are ok but not excellentTake the pictures under the water is great", "Date": "March 26, 2014"}, {"Title": "Difficult to Operate", "Author": "I. Johnson \"ICJ\"", "ReviewID": "R2IELOMHMB83F4", "Overall": "3.0", "Content": "Compressing the shutter on this camera requires so much pressure that you shake, and thus, lose the clarity of the subject.Also, when using zoom, photo quality becomes quite grainy. While I would expect this of a company which I did not have as high expectations, I was a bit surprised to find these deficiencies in a Nikon. The price, I thought was fair (over $200.00 - less than $300.00), with technology being so well established in this area, I just expected more.", "Date": "March 23, 2014"}, {"Title": "amazing compact camera", "Author": "Mary", "ReviewID": "RWXWOE8L326XF", "Overall": "5.0", "Content": "I took this camera on my hiking trip to Sedona and the Grand Canyon. The camera took spectacular shots with amazing quality. I would recommend this camera to anyone traveling and those who do not want to drag around a big camera to get great shots. I love that it is waterproof and cannot wait to test it out when I am in Thailand this summer.", "Date": "March 15, 2014"}, {"Title": "My camera  doesnt work now", "Author": "Nicolle Michelle Quiñones", "ReviewID": "R11AFFMBYWT8UF", "Overall": "2.0", "Content": "Hello My camera was perfect, takes very good pictures but now I do not work the display shows no picture, but if you take video recording. Please I would like to know that I can do in this case, if I have to I will pay the settlement but please help this very good camera", "Date": "February 18, 2014"}, {"Title": "Cool pix camera", "Author": "Larry Smotrys", "ReviewID": "R24W3XHEH103UX", "Overall": "5.0", "Content": "This camera looks good and is easy to handle. This camera  is digital so you can have more picture depending on the size of the memory card. Plus the color is no bad at all.", "Date": "February 5, 2014"}, {"Title": "It worked for 1,5 year.", "Author": "Matt", "ReviewID": "R3NS9KOIMAIVQ", "Overall": "2.0", "Content": "It takes excellent video.It doesn't take great pictures.The buttons are not super responsive and its annoying to switch between modes and shutting off the flash.It died after 1,5 year...", "Date": "January 15, 2014"}, {"Title": "It's a hit!", "Author": "Odessa Johnson", "ReviewID": "R2INI9GPMGPXAT", "Overall": "5.0", "Content": "My daughter loves it!  I bought it as a Christmas gift for my daughter.  This summer she gets to go to Spain with her Spanish class.  Now she has a camera to record all those great moments", "Date": "January 2, 2014"}, {"Title": "Hot Waterproof Camera", "Author": "Finster \"Radical\"", "ReviewID": "R1DERPDBZMHRXO", "Overall": "5.0", "Content": "Does many things.  Great for snorkeling and underwater video.  Nikon makes the best cameras.  I have been using them 35 years.", "Date": "January 2, 2014"}, {"Title": "Good camera", "Author": "Teddison Chevignard", "ReviewID": "R1DJO6EK13FNYW", "Overall": "4.0", "Content": "The camera is great so far. Hopefully it will work better than my previous warter proof, shock proof camera indeed!", "Date": "December 29, 2013"}, {"Title": "Purchased a Lumix Panasonic ZS30 instead to get good night shots without flash.", "Author": "Gary A. Creighton \"Gary A. Creighton\"", "ReviewID": "R2824XQ7OB2TTP", "Overall": "5.0", "Content": "Liked the camera because of its waterproof and shock-resistant qualities... but returned it to purchase a Lumix Panasonic ZS30 which has incredible capabilities to shoot in the dark. It is a much better camera than this one if you want to take night shots without a flash.", "Date": "December 8, 2013"}, {"Title": "Nikon CoolPIX AW110 Wi-Fi and Waterproof Digital Camera With GPS", "Author": "Tommy Anderson", "ReviewID": "RJEZ4ECT8QL6U", "Overall": "5.0", "Content": "This Camera takes Great pictures, My Daughter used it on her vacation and came back with the best pictures , Clear and bright !!", "Date": "November 17, 2013"}, {"Title": "Top marks from and old photog", "Author": "Florida Media \"Florida Media\"", "ReviewID": "R3JYRXG1MF5IEC", "Overall": "5.0", "Content": "Wow what a great camera. I did a lot and I mean ALOT of research before buying this for my daughter to take to Africa.  It took better pictures than full size cameras. When it was stolen I bought the exact same one to replace it.", "Date": "November 16, 2013"}, {"Title": "great all around camera for the price, would recommend", "Author": "j", "ReviewID": "RTYU1VSEASVZ", "Overall": "5.0", "Content": "I bought this camera due to wanting something smaller than my full size camera which can be a pain to take with you on trips, it works really good, is small enough to fit in your pocket and the waterproofing on it has been tested several times at the lake, in my pool and at the beach.  it has never failed us yet.  very good camera for the money, takes a surprisingly good video and picture for the price.The only thing I can figure is do not open the waterproof door on it when it wet like it says not to do and I cant see why anyone would have issues with it.", "Date": "November 9, 2013"}, {"Title": "Great!", "Author": "rebecca clayton", "ReviewID": "R22J5VRWWRVGZX", "Overall": "5.0", "Content": "Was great to use!! No worries and wonderful pictures! This was used at the ACL Festival when a flood hit Austin - pictures were all safe!", "Date": "November 2, 2013"}, {"Title": "Just buy your eyes close..", "Author": "xavier Dauge-D.", "ReviewID": "R3TQO97Q3E60QB", "Overall": "5.0", "Content": "Super super happy of this product do everything I need and lot more I did aspect.... For me this is the best waterproof camera.. Make super quality pictures and I'm really picky on that for a good reason, I'm o professional photographer.", "Date": "November 2, 2013"}, {"Title": "Nice camera", "Author": "Jeremy Tan", "ReviewID": "R2UBLZJ8BCQKRA", "Overall": "4.0", "Content": "the night shot of the camera is a bit disappointing. but overall it's a decent camera for water sports and underwater.", "Date": "October 29, 2013"}, {"Title": "Great compact Camera!", "Author": "Juan F.", "ReviewID": "R34FDQLFNFGCPE", "Overall": "4.0", "Content": "Reading the manual from the nikon web I can say that is a great compact camera for sports, and free time!I found no cons but I can say that I've expected more about the wifi feature.", "Date": "October 27, 2013"}, {"Title": "Wow very nice camera is amazing", "Author": "bernardo haniel alcala santana", "ReviewID": "R1P08Q99LGCYP3", "Overall": "5.0", "Content": "I have it and I don't believe it yet lol very clear pictures under the water and outside too simply awesome!!", "Date": "October 25, 2013"}, {"Title": "Does the Job", "Author": "Nancy C. Nazario", "ReviewID": "R2YJEPVKKAEXEA", "Overall": "4.0", "Content": "I got this for taking photographs while kayaking.  It does the job.  The GPS and altimeter are added features that are fun!  Good picture quality.  I christened it in Elkhorn Slough!", "Date": "October 24, 2013"}, {"Title": "Awesome", "Author": "Don Condon", "ReviewID": "R2P8XD6GHQ62A8", "Overall": "5.0", "Content": "I had a Pantax that I had lost. Replaced with this Nikkon and love it. I can use as a everyday camera and have used in water parks, mud runs, and a lake. Great pictures. I would highly recommend this camera. Only draw back is wish it had a better zoom capability.", "Date": "October 21, 2013"}, {"Title": "The camera I needed caused I've already dropped and broke two!", "Author": "Kharee Shorter", "ReviewID": "RYJH5W8JPWNTC", "Overall": "4.0", "Content": "Like the camera a lot  but just can't figure out how to store files on SD card by date to make it easier to retrieve my photos later. Other than that no complaints. I haven't tested it underwater yet.", "Date": "October 16, 2013"}, {"Title": "Good camera", "Author": "John Abbamondi", "ReviewID": "R8BUWWWA6DUNN", "Overall": "4.0", "Content": "Haven't had it long enough to fully learn all its capabilities.  However, so far I am well pleased with the camera.", "Date": "October 16, 2013"}, {"Title": "love my new camera", "Author": "Amazonshopper", "ReviewID": "R387EHYZ9T6BIQ", "Overall": "5.0", "Content": "takes great pictures and the underwater ones are so clear. the video takes a little time to get used to and the battery doesn't last as long as i thought but totally worth it!", "Date": "October 8, 2013"}, {"Title": "Great choice for kayaking and snorkeling", "Author": "oceanairre", "ReviewID": "R6TRU383XTHX7", "Overall": "5.0", "Content": "Takes very good pictures. Easy to use. Movies are crisp and non-blurry. Zoom works well. Took it snorkeling in salt water to 20 feet of depth with no issues.", "Date": "October 2, 2013"}, {"Title": "Exactly what I wanted - well, almost", "Author": "Nikolai Sklobovsky", "ReviewID": "R391RWCELJQLUS", "Overall": "4.0", "Content": "I wanted a simple P&S; with a decent color range I can use for my photo recon trips, taking random pics, etc. Basically something better and more dedicated than a smart phone, yet compact and simple, so I don't have to lug my full-frame DSLR bodies.It performed well in a decent light. Naturally, after dusk it was fairly useless.GPS logging was another feature I wanted. I worked really well. Just a caveat - it eats a battery in about 8 to 10 hours, so you better have a spare.Underwater feature - love it. Just works.A minor disappointment - the wifi hot spot was not performing as well as I hoped. I was only able to get small size copies of pictures from it. It's OK for preview on the tablet, but for actual usage you gotta use the card reader.The provided software works, but as most of its kind, if you have anything else (PS, LR, Picasa, Aperture, etc), you won't be needing it at all.", "Date": "September 29, 2013"}, {"Title": "Love our new camera", "Author": "Valerie Friesen", "ReviewID": "R1O2OD5FUZLGFB", "Overall": "5.0", "Content": "Survived zip lines, amphibious vehichles, and splash downs in the cenotes in Mexico!  Great pictures while in the rain during our vacation.", "Date": "September 15, 2013"}, {"Title": "Recommended", "Author": "Bernadette veneracion", "ReviewID": "R165ZLPPXTQ23T", "Overall": "5.0", "Content": "Very pleased w/ this item. My family enjoyed using this during our vacation. Durable & reliable in underwater photography. Good battery life.", "Date": "September 9, 2013"}, {"Title": "a great little camera", "Author": "RuthAnn S. North", "ReviewID": "R1UVOEKYYB30FD", "Overall": "5.0", "Content": "I have used the Nikon Coolpix AW110 for a couple months now and I just love it.  the pictures are great.  I haven't used it underwater yet, so can't comment on that, but I plan to in the very near future. The zoom feature is very good.  Much better than on any other small camera I have owned.", "Date": "September 8, 2013"}, {"Title": "Solid camera - pleased", "Author": "TN_Runner1", "ReviewID": "R2K5SHHM4L3BAD", "Overall": "4.0", "Content": "I got this camera in preparation for a vacation including a lot of watersports.  It didn't disappoint!  I usually use a DSLR, but this camera was great to use on the water (typically kayaking), in the rain, or any other time I wanted to bring a compact camera rather than the bulky DSLR.  Functionality is similar to most point-and-shoots.  Wireless functionality is handy.  Took decent landscape and macro shots as well.  Overall pleased with the camera for the price paid.", "Date": "August 23, 2013"}, {"Title": "Great Camera", "Author": "Original Name", "ReviewID": "R3MN7Y0KXWVLKE", "Overall": "5.0", "Content": "Everything I wanted in a waterproof camera and more. Still learning how to use it but it takes great photos in and out of the water.", "Date": "August 22, 2013"}, {"Title": "Great Camera", "Author": "Jeff Prestmo", "ReviewID": "RGJ5QT343ZTRJ", "Overall": "5.0", "Content": "Have only had it for a few weeks, but it does everything and easy to use. Has more options than most people will ever need. Best part about it is it takes multiple shots with the push of the button w/o loosing focus even in dim light.", "Date": "August 5, 2013"}, {"Title": "Outstanding performance!!!", "Author": "Jose Del Rio", "ReviewID": "R16PGAU1VC5HLK", "Overall": "5.0", "Content": "Wow this camera is the bomb,outstanding features,modes and very rugged,impact proof,water proof, snow proof,heat proof definitely taking this camera anywhere you go, it won't disappoint you also records video on hd 1080p and is pocket size,outstanding job for Nikon", "Date": "August 3, 2013"}, {"Title": "Best underwater camera with everything you needed!", "Author": "K. Eck \"Transformers collector\"", "ReviewID": "REEYEH1ZXSAM", "Overall": "5.0", "Content": "I love this camera! Fast and clear pictures when not using zoom.  I would buy this camera over other waterproof cameras in the market! Easy and quick to use.  My kids love this and used it at beach and pool.  No problem when underwater.", "Date": "August 3, 2013"}, {"Title": "exactly what we wanted", "Author": "luvnjohn", "ReviewID": "R126IU1FGLR8SX", "Overall": "5.0", "Content": "This product is exactly what we wanted and it is easy to use and compact.  Now we do not need to worry about using it in water.", "Date": "August 2, 2013"}, {"Title": "Better then expected", "Author": "Mathew T Lang", "ReviewID": "R2JARFU7LEV8WM", "Overall": "5.0", "Content": "This camera is heads and tails above the previous 3 Olympus cameras I have owned.  Natural colors, great zoom and actual software that can pick a shooting mode when I don't have time to pick one has been a life saver.", "Date": "July 29, 2013"}, {"Title": "Great", "Author": "Diocycleman", "ReviewID": "R36IFH4LKFT85T", "Overall": "5.0", "Content": "I have taken this camera to Costa Rica, California, Maui and local lakes in Texas snorkeling. It has worked flawlessly for me, I will try to get a longer lasting battery possibly but other than that literally thousands of pics mostly clear, takes a little practice under water but what a blast practicing.", "Date": "July 21, 2013"}, {"Title": "Super!!", "Author": "gumbaugh", "ReviewID": "R5U8HXXMG16RJ", "Overall": "5.0", "Content": "This camera works great underwater and takes super action photos too!! I'm so glad i found a nice mulch-functional camera!", "Date": "July 6, 2013"}, {"Title": "Great camera", "Author": "brian", "ReviewID": "R3DUKBUIP3G2WW", "Overall": "5.0", "Content": "I bought this camera for my honeymoon and wanted a waterproof one for scuba diving. It worked better than expected the underwater pictures were great.  It was so convenient to be able to take the camera with me and not have to worry about getting it wet I was able to take so many pictures the WiFi feature was great to take pictures of me and my wife without having to ask someone to do it.I would Highly recommend this camera. it is a simple camera to use and is rugged and waterproof what more could you want", "Date": "July 3, 2013"}, {"Title": "Good but slooooow ......", "Author": "Bomfim", "ReviewID": "R2M6PSUEH3CSSB", "Overall": "3.0", "Content": "It is a beauty camera, with nice pictures, but very slow to take photos and not practical to change the camera optins. My canon D10 is much more efficienty for the same price ...", "Date": "May 25, 2013"}, {"Title": "Why do you cancel my order without giving me an notification?", "Author": "jing wang", "ReviewID": "R3F7T7PRWF4846", "Overall": "1.0", "Content": "I've been waiting for this camera for my coming vacation. However, you canceled my order without noticing me and giving me a reason. I'm very disappointed of your service!", "Date": "April 14, 2014"}, {"Title": "good", "Author": "farqad", "ReviewID": "RSQUN53JQ9LPU", "Overall": "5.0", "Content": "this camera nikon coolpix aw 110 wi- fi and water proof digital camera with gps nikon coolpix aw 110 wi- fi and water proof digital camera with gps is very good", "Date": "January 23, 2014"}, {"Title": "a great camera at a good price!", "Author": "larry stanton", "ReviewID": "R2RP2131LUD8GH", "Overall": "5.0", "Content": "I used the camera on a sailing cruise in La Paz. It was water proof and it took fantastic night photos.  I made a DVD of the 321 photos and received many compliments on the quality of the images.  A great camera.", "Date": "December 21, 2013"}, {"Title": "Great Camera For A Great Price! BUT", "Author": "Rob", "ReviewID": "R1RLY9G8IYTUFI", "Overall": "4.0", "Content": "Good little point n shoot! I read lots of reviews on this camera some real good, some real bad then some where just stupid people talking ish! Bottom line for me... I bought it for 245 bucks new! It performs exactly how a camera priced at $245 should! I didnt expect amazing performance and top quality imaging. If you want that please spend around $1,000!!! This AW110 is awesome for the price though. The auto ISO is a tad slow which is expected. The auto focus isant as fast as a DSLR which I also expected and I dont know why Nikon says this camera is good in low light : / when the specs Nikon gives, clearly says to a person who knows better that (this camera is not good in low light)... but I already new that before I bought it! I still love the camera! All the features it has are great and I am going to keep it for fishing and camping and what ever else. Dont drop the camera or you will need to send it back to Nikon for them to check it out and make sure the water seal isant broken. If you dont ship it back to them after dropping it and you submerge the camera in water and it fails to work, it will be your fault and Nikon will not honor the warranty... TRICK OF THE CENTURY LOL F'N NIKON LOL!!! JUST DONT DROP IT... I dont care about what professionals say about this camera! I am a professional my self because I get paid to shoot with my SLR and I say AW110 camera is dope for the price. I recommend it to every one! Being straight up dummy proof is the only thing I don't like about it. I wish I had more freedom with all the standard camera settings!! But its ok! NIKON!", "Date": "November 21, 2013"}, {"Title": "camera", "Author": "michael breton", "ReviewID": "R34O5W49WGS23M", "Overall": "1.0", "Content": "instructions not clear enough. camera wont do what instructions say. cant understand the instructions.  trying to figure out what each thing is on camera", "Date": "November 5, 2013"}, {"Title": "Nikon COOLPIX ...", "Author": "Russell Breisch \"rab\"", "ReviewID": "R3HVJII1BCCG78", "Overall": "5.0", "Content": "Nikon COOLPIX AW110 Wi-Fi and Waterproof Digital Camera with GPS work great, easy to point and shoot. Recommend this product.", "Date": "August 22, 2013"}, {"Title": "Cool Camera", "Author": "Sarah M. Eresian", "ReviewID": "R2EWKX2DIKCEN7", "Overall": "5.0", "Content": "Compact little camera with ALL the features of larger ones. So far, pictures have turned out very well, especially those taken when I was moving or the subject was moving or both--totally in focus.", "Date": "August 21, 2013"}, {"Title": "Stopped Working after 3 Months - Don't Waste Your Money and Time", "Author": "J in NC", "ReviewID": "R1V1GXU700CZ7V", "Overall": "1.0", "Content": "I've only had the camera for 3 months and it stopped working.  It is completely dead.  The viewfinder appears to have water damage.  This is supposed to be a waterproof camera.  We took it in the water and diving but did not go anywhere near the 59 feet with it.  My children are too young to dive deeper than 35 feet.  I have contacted Amazon for a return and have also contacted Nikon.  Having to go through the repair/return process is a huge time waster.  But, most importantly, this camera stopped working half-way through our two week vacation so we were not able to take pictures for an entire week except on our iPhones!  Completely unacceptable.  This is the first waterproof camera that I have owned that got water damage.  All other brands I bought have held up beautifully (we have a Go-Pro as well).  I would NOT recommend this camera, especially since it was so expensive and will not last.  Don't risk your memories!", "Date": "July 15, 2013"}, {"Title": "Excellent camera", "Author": "Ric", "ReviewID": "RXUZ9VADF148S", "Overall": "5.0", "Content": "We've been using this camera for a month or two now and it has held up wonderfully and taken gorgeous pictures.  We primarily use it in the pool and for paddleboarding so we haven't done any real diving (maybe just a few feet for some pics and video but nothing deeper.  Video is good, and comparable to other models.", "Date": "July 7, 2013"}, {"Title": "Excellent Picture Quality, Terrible WiFi", "Author": "J. Revock", "ReviewID": "R2AK3SHHV633P2", "Overall": "3.0", "Content": "I purchased this camera for a trip we were taking to China.  All in all, the picture and video quality was outstanding, and I am extremely happy that I bought it.The only negative aspect to this camera is the wifi.  I bought this camera thinking that I would be able to directly upload photos and videos to facebook, google+, etc.  This was wrong.  Although this is not mentioned anywhere on the website or in the manual that I could find, the wifi is only used to create an adhoc network that smart devices (phones and tablets) can connect to for file transfer.  Furthermore, in order to access the network you have to install a program on the smart device.  While this works, it is extremely cumbersome, and is not was I wanted.  In the end, I had to wait until we returned home to upload the pictures using a memory card reader.If I could change things, I would have simply bought the AW100 instead, and saved some money and frustration.", "Date": "April 26, 2013"}, {"Title": "EXCELLENT LITTLE WATERPROOF CAMERA FROM NIKON", "Author": "OILMAN \"OWEN\"", "ReviewID": "R33JKVRLDW83YL", "Overall": "5.0", "Content": "I\"ve owned the previous version of this little waterproof camera, and I\"m very glad that I  decided to get this newer version, the improvements are very nice, the zoom switch, is much better, then the older model, the choice of special effects, are alot of fun as well, you can do all sorts of fun things with your photo\"s such as convert  your photo\"s to a fisheye effect , with too many other features to menchion, Nikon truly has a wonderful little camera here, which is teriffic for cruises, vacations, or just all around enjoying your photographic experience, please check out, some of my test photo\"s I have posted on this page, Happy Shooting!!", "Date": "May 24, 2013"}, {"Title": "Excellent Underwater Option", "Author": "HeavyTech", "ReviewID": "RCEBP9Z340N72", "Overall": "5.0", "Content": "I purchased this camera a week ago and have had the opportunity to use it several times underwater and on land.  As for the latter, the performance is solid with many scene choices but easy auto is ideal for most conditions.The underwater performance has exceeded my expectations in bright conditions and evening environments.  The detail in the video is outstanding and the still images do not disappoint.  After each use, I rinse it with fresh water and then soak it in fresh water for 10 minutes.  No issues at all and very satisfied.", "Date": "April 13, 2013"}, {"Title": "Big Mistake", "Author": "I_love_WA", "ReviewID": "RM31J5MLV0KN6", "Overall": "1.0", "Content": "I'm the kind of person who really takes a look at all the reviews for something before buying. I'm planning a trip to AK, and I wanted to upgrade to something small that has the ability to take 1080p video. The fact that this is supposedly pretty tough and able to go underwater is cool as well, as I do quite a bit of snorkeling.So, taking all that into consideration, I bought this little piece of crap and was super upset. I can't give you any insight into it's features because the stupid thing wouldn't turn on. I kept getting a white screen with a little exclamation point in a red circle. Since there is no mention of this anywhere on the internet, I figured that maybe the battery was exhausted. So, I charged both of the batteries overnight. Apparently, sometime after I plugged in the Nikon battery, the charger stopped working. This happened when I took it out of the box as well. It blinks for about 5 minutes, and then stops blinking, which is supposed to signify that it's fully charged. Nope. So I let it sit overnight, and nothing happened.However, while I was looking up info on my red exclamation point issue, I found many many many complaints about the fact that this doesn't usually work underwater like it says it's supposed to. The reviews on Nikon's website were awful, and reviews on other camera-related sites were similar. I don't think this camera is worth the hassle, so I returned it for a Nikon Coolpix L820. Sure, it doesn't go underwater, but at least the reviews were consistently high across the web.", "Date": "May 30, 2014"}, {"Title": "LOVE IT", "Author": "datra marcelle", "ReviewID": "R2QYTQN926WEXP", "Overall": "4.0", "Content": "love my new camera it works perfectly finecouldn't ask for a better camera to go under water with me", "Date": "April 7, 2014"}, {"Title": "Great product", "Author": "dan", "ReviewID": "R1KISYJ4RZURJ4", "Overall": "5.0", "Content": "Great camera arrived a day early. Can't wait to bring it on vacation and get some great pictures. Highly recommend", "Date": "March 15, 2014"}, {"Title": "I have problems with de memory card. The camera crashes from time to time. I want my warranty.", "Author": "Juan David Betancur Sánchez", "ReviewID": "R3FL9BSJRF7QZ3", "Overall": "2.0", "Content": "I have problems with de memory card. The camera crashes from time to time. I want my warranty. Thanks .", "Date": "February 9, 2014"}, {"Title": "No speed control", "Author": "D. Jones", "ReviewID": "R3QGHUVIHF2GTP", "Overall": "3.0", "Content": "All the cameras I have owned previously had a way to adjust the speed this doesn't and because we mainly take pictures of our family it's always a moving target. Therefore, many pictures are blurred.  Worked fine under water though.", "Date": "January 28, 2014"}, {"Title": "Great function.", "Author": "Clayton Skinner", "ReviewID": "R2D9280U8XLZKX", "Overall": "4.0", "Content": "Good depth for shallow dives and snorkeling. Great optical zoom. Secure locking mechanism on battery door. Takes great pictures. Simple to use menu.", "Date": "November 21, 2013"}, {"Title": "It's better than I thinked.", "Author": "leonardo naves", "ReviewID": "R3K6Y0RUTPS005", "Overall": "5.0", "Content": "It's okay, good camera, I walk with the camera all the time. It's small and nice for every kind of photogrsphy.", "Date": "September 13, 2013"}, {"Title": "Nikon Coolpix AW110", "Author": "Ken", "ReviewID": "RVJN9P8Y10E1", "Overall": "5.0", "Content": "I purchased this camera to use on vacations while on dive boats. It is great because it is waterproof, it has built in GPS and it has WiFi, so I can upload the shots right to Facebook using my iPhone. The camera has many features which I haven't even tried yet.", "Date": "June 24, 2013"}, {"Title": "Camera is fantastic", "Author": "J. Taylor \"Gadget monster\"", "ReviewID": "RP5UDS9YR2IXP", "Overall": "5.0", "Content": "Bought this camera for the sole purpose of taking underwater pictures while on vacation.  We spent the better part of each day on vacation in a pool with this camera hanging around my neck underwater.  Camera worked as described and took amazing underwater pictures.  It is simple to use and LOADED with features.  I would highly recommend that a solid review of the user manual take place prior to use.", "Date": "April 12, 2013"}, {"Title": "They sent me the wrong color", "Author": "Rapousa", "ReviewID": "R22V9C195BN2TK", "Overall": "5.0", "Content": "The camera is great, takes marvelous pictures, but I asked for the orange one (my favorite color) and they sent me the red one. Unfortunately it was delivered in a friends hotel and I only realised the mistake when received it in Brazil.I didn't liked the red color at all.", "Date": "October 22, 2013"}, {"Title": "18mm too deep for this,bomb", "Author": "Brenden", "ReviewID": "R34QAPPX74XTCW", "Overall": "1.0", "Content": "18m depth claim is completely bogus!  2nd surface swim, it quit without ever seeing 12in of depth. Don't waste a dime on this. It put a serious damper on a vacation I thought it would help me remember. Heading into town to buy a UW disposable.", "Date": "July 8, 2013"}, {"Title": "Broke on the trip that I bought it for!!!!!", "Author": "Island Marine Electric", "ReviewID": "RKQM741OA48RH", "Overall": "1.0", "Content": "locked up so i could not use it on the very trip that I purchased it for.Good thing that I always carry a few cameras just in case", "Date": "June 25, 2013"}, {"Title": "Great waterproof camera", "Author": "Ken from CA.", "ReviewID": "R1K7UJ4B3YOP3A", "Overall": "5.0", "Content": "GPS works fast, the wi-fi is a nice to have, and it is definitely waterproof.Oh, and the photo-taking part of it is excellent, also.", "Date": "April 26, 2013"}, {"Title": "Solid", "Author": "Dino R.", "ReviewID": "R25OL13B7QMP3V", "Overall": "3.0", "Content": "Needed so additional set up knowledge, but overall feels good and I can't wait to get it in the water!", "Date": "June 15, 2013"}, {"Title": "Terrible Camera", "Author": "NowTraveller", "ReviewID": "R174H6YTPR6GS2", "Overall": "1.0", "Content": "I received this camera as a Bday gift and was very excited and thankful. The camera had been already set up for me with an extra high speed memory stick and so I was ready to start taking some pics. They turned out terrible. Image stabilization was terrible,half of the pics were blurred. The flash did NOT kick in with a low light setting,and when it did finally kick in it over saturated the image. Ive read the other negative reviews on this camera relating to the underwater features being equally as terrible. Im not impressed at all. I am disappointed and discouraged,seems like these point and shoot cameras have all these great features for wifi and HD video and such yet they dont seem to be able to take very good pics,not user friendly,a myriad of menu settings that you have to tediously go through to get the quality you want for a given situation. Im reminded of that Video that \"The Onion\" news network put out a few years ago titled \"Sony's new stupid F%^*ing Piece of S&$T that doesnt do what its g8d D&*ned supposed to\".", "Date": "June 16, 2013"}, {"Title": "wooooooooooooooooooooooooooooooooooow", "Author": "Mahmoud Merhi", "ReviewID": "R29PC43KLBCM8B", "Overall": "5.0", "Content": "i want every body buy this cam under water very cooooooooooooooolllllll and nice material thank you Nikon for this camera", "Date": "July 17, 2013"}, {"Title": "I realy love it!", "Author": "debora baldessar menezes", "ReviewID": "R2VZLNVIQ8RK3D", "Overall": "5.0", "Content": "Despite of being small, it's a very powerfull camera! You don't believe until you see..I didn't test underwater yet, nor under low temperatures, but both outside and inside pictures were awesome!", "Date": "May 7, 2013"}, {"Title": "camera", "Author": "karen eller", "ReviewID": "R7AJKM3COW81X", "Overall": "5.0", "Content": "i think i will love this camera when me and my family go to the beache for our vacation. havent used yet thank you karen eller", "Date": "February 13, 2014"}, {"Title": "Nice and very light one", "Author": "Amoudis", "ReviewID": "RPJ56ZAEOH3W8", "Overall": "5.0", "Content": "It’s very light in weight.I loved the HD photos.But I didn't know how to use the Wi-Fi and GPS features till now LOL", "Date": "June 15, 2013"}, {"Title": "get this now", "Author": "Adam Rutledge", "ReviewID": "RPL4CJBAA6WLG", "Overall": "5.0", "Content": "Me and my wife just came back from Dominican republic. I dunked her camera and its gone. I researched every point and shoot camera out there. This bay 1st had the furthest diving range. Yes, you can go diving its water proof. Takes amazing photos . there isn't a better waterproof camera out there that is point aand shoot", "Date": "May 1, 2013"}], "ProductInfo": {"Price": "$249.95", "Features": "Waterproof, shockproof, and freezeproof to capture extreme moments\nShare amazing photos in an instant with built-in Wi-Fi\nBuilt-in GPS records the location of each shot you take\nRecord videos in Full 1080p HD with stereo sound", "Name": "Nikon COOLPIX AW110 Wi-Fi and Waterproof Digital Camera with GPS (Blue)", "ImgURL": "http://ecx.images-amazon.com/images/I/41liL6qoGZL._SX300_.jpg", "ProductID": "B00B7N99QU"}}