{"Reviews": [{"Title": "Love this camera!!", "Author": "Sonia", "ReviewID": "R150TETHW5NL2J", "Overall": "5.0", "Content": "We bought this camera to replace our old one, and man are we glad we found this one! It is soooo fast and the pictures are soooo clear! It is a really nice little camera! My only thing is that online the white looks silver but believe me it is very white! Not a huge deal, this camera makes up for the fact that its not silver!", "Date": "June 13, 2013"}, {"Title": "Great Price, Fun easy to use camera", "Author": "Paul Gimelberg", "ReviewID": "R2CETVJOH6X4SO", "Overall": "4.0", "Content": "Great Price, Fun easy to use camera.  Small, pocket size. Takes good pictures in the dark. Awesome HD video quality.", "Date": "August 11, 2013"}, {"Title": "Missing stuff", "Author": "Paulo A.", "ReviewID": "R1PNOIFY5PQ251", "Overall": "1.0", "Content": "Although I got the main items (Camera, SD Card, Spare Battery and the case), some of the items advertised were missing (USB Card Reader, Memory Wallet, LCD Screen Protectors).If I knew that from the start, I`d have chosen another bundle with the same camera...Camera itself is everything you can expect from a point and shoot, which is exactly what I wanted.", "Date": "July 4, 2013"}, {"Title": "Great Camera", "Author": "Debbie", "ReviewID": "R1NBML4L8R08NI", "Overall": "5.0", "Content": "I love this camera! It is small, but the screen is big. This bundle was wonderful, as you got a battery AND a backup battery too! I went on the Sony site and got a hot pink silicone cover for it! Very pleased with my purchase!", "Date": "October 7, 2013"}, {"Title": "Excellent Experience!", "Author": "Midori A.", "ReviewID": "R1TIM2CJRHX8S", "Overall": "5.0", "Content": "My hubby bought this set of camera with accessories as my birthday present & they arrived promptly in perfect condition. I'm enjoying the use of this camera with wifi function. I highly recommend this website purchase, which is significantly cheaper than walking into any shops in Singapore.", "Date": "July 19, 2013"}, {"Title": "Sony & Amazon: great team!", "Author": "Geegee Five", "ReviewID": "R1JI6J1YDTA3AY", "Overall": "5.0", "Content": "I killed our 1st Sony Cyber-shot by not holding it tightly... plop... into a small puddle. Bought this one as a replacement; however, it quickly became an upgrade. So-o-o-o many additional features, better pixels, stronger zoom, plus all the \"extras\" which when added up separately would cost twice as much as we paid for the package. Great close-ups and distance fotos. We're certain to find additional features as we use this camera more often. We are truly amazed at the intricate details and return of fun when using this Sony!", "Date": "July 6, 2013"}, {"Title": "Package missing items - Product defective", "Author": "PD", "ReviewID": "R1V4CXURANT05W", "Overall": "1.0", "Content": "Ordered this camera package, as it was a good price and included everything we needed.  Order was received quickly, but (same as others reported) seller does NOT include memory card reader or memory card case AS DESCRIBED.Camera worked great for a week, then the screen went bad.  White lines fill about 1/3 of the screen and a big black splotch covered the center.  As this appears to be an LCD screen, the lifespan should be around 10 years ... NOT 7 DAYS!The product was supposed to be new, not refurbished.  It DID have the original seal, so I presume that part of the order was correct.  Thus, I do question whether the product is poorly made or it was luck of the draw getting a bad one.All in all, a bad buying experience.  Luckily, I have had better luck int he past with Amazon. Still, I will likely steer clear of Focus Camera.", "Date": "July 7, 2013"}, {"Title": "Great little camera for bloggers and moms on the go!", "Author": "Pedro Garcia III", "ReviewID": "R56275LX1DGXA", "Overall": "5.0", "Content": "Written by Stephanie (wife of the account holder!) After almost a decade of bulkier cameras, I wanted something small enough to tuck in my purse without sacrificing the quality of my images. I've been a Sony user for seven years and after many hours of comparing other options, decided to stay with what was familiar. I'm happy to say I am fully satisfied with my purchase. I love that with the camera cord around my wrist, I can easily manage the camera with one hand while holding a baby on my hip or hanging onto little hands. Meanwhile, I still get great shots to share with long-distance relatives and on our family blog. Five stars to Sony!", "Date": "May 30, 2014"}, {"Title": "Amazing buy", "Author": "Maria Figueroa \"Mari FigRod\"", "ReviewID": "R3UH8J52VSTVSV", "Overall": "5.0", "Content": "I love this little camera and all its features, especially the ability to shoot pictures when shooting video. The accesories \"thrown in\" with the purchase from this vendor was an added bonus. I received all the items advertised as included. Very happy. Thanks.", "Date": "April 27, 2014"}, {"Title": "A Small Camera is an import part of my life and \"LOVE THIS ONE\"", "Author": "Jeannine", "ReviewID": "RH4BG7VJ46UTS", "Overall": "5.0", "Content": "I adore this tiny camera, it had many more options than my last Sony and plenty of accessories to enjoy and I really have. Extra battery a real plus as they are so expensive to replace. Have had this since before Christmas of 2013 and still haven't really gotten into the options for pictures too much but think there are a several there I really want to try more times. Was surprised to find one option that gives a black and white picture with spots of color in the shot. That's the one I would like to try more. Haven't used the option to download via my wireless connection to the computer though. Had some problems with the download from Sony that allows you to work with your pictures and such and removed it from my computer. Despite that, love this little sweetie of a camera.", "Date": "March 30, 2014"}, {"Title": "wifi not user friendly", "Author": "anrousse", "ReviewID": "RQVEO6D36AFHJ", "Overall": "1.0", "Content": "I would not recommend this camera if you are looking for easy upload to social media or to email, etc... The camera does take very crisp clear pictures tho. I have had other sony cybershot cameras that were so much sier to use. But since they had been stolen, I just went for something inexpensive that had wifi capabilities. Now I am wishing I had spent a little extra and gotten a different camera. Very unsatisfied customer.", "Date": "February 25, 2014"}, {"Title": "A great overall camera!!!", "Author": "Ziggy", "ReviewID": "R2ERHQ7BHSJNO3", "Overall": "5.0", "Content": "I own several Sony cameras and this is my favorite due to it's ease of use, size and features.  It takes excellent pics and has a fast response time.  The bundle was very complete and worth the extra cost.", "Date": "February 16, 2014"}, {"Title": "I loved this camera", "Author": "Guilherme S.", "ReviewID": "R2DRDIX86KZIZ6", "Overall": "5.0", "Content": "it came with all the stuff described and the quality is awesome. I have it for 4 months and I like. We can use a lot of interesting functions.", "Date": "January 31, 2014"}, {"Title": "great deal", "Author": "Ashley W", "ReviewID": "R990LKOMO0RHB", "Overall": "4.0", "Content": "The camera and all the accessories was a great deal...not a fantastic camera but all I need for point and shoot purposes!", "Date": "January 26, 2014"}, {"Title": "EXCELLENT PICTURES,EASY TO USE RIGHT OUT OF THE BOX,GREAT PRICE", "Author": "DAVID DZIUBA", "ReviewID": "RM66OJCWD6E1T", "Overall": "5.0", "Content": "THE PICTURES ARE ASTOUNDING AND YOU CAN APPLY THE \" BEAUTY EFFECT\" WHICH ADJUSTS SKIN TONE,TEETH,EYES,SKIN COLOR. EASY TO USE, AND THE WIFI CAPABILITY SENDS PIC TO YOU SMARTPHONE,COMPUTER OR CLOUD FOR SHARING. ALSO ,YOU CAN CONTROL THE CAMERA WITH YOUR SMARTPHONE.MY LAST SONY CYBER SHOT BOUGHT IN 2008 STILL WORKS AFTER BEING DROPPED,EXPOSED TO MOISTURE AND LEFT ON THE BEACH IN THE SUN. DURABLE IS AN UNDERSTATEMENT FOR SONY.GOT THE PACKAGE WITH ACCESSORIES WHICH WAS THE BEST DEAL.THANKS AMAZON  FOR YOUR HELP.", "Date": "January 3, 2014"}, {"Title": "GREAT POCKET CAMERA", "Author": "Rosa M. Jatib \"Lady Jatib\"", "ReviewID": "R1336890BMAZE8", "Overall": "5.0", "Content": "Great compact camera.  Sharp pictures and HD video.  Considering that is not a DSLR is a good deal with a decent zoom.  This is my 3rd SONY and I am pleased.", "Date": "January 3, 2014"}, {"Title": "The camera for me", "Author": "Karl L. Behning", "ReviewID": "R3RR2WEGP8PJYI", "Overall": "5.0", "Content": "This is my third Sony DSC. I am sure it will be nice to shoot 1080 movies, have an extra battery on hand at all times and plenty of storage. 8X zoom is not 10X but it is an improvement.", "Date": "December 31, 2013"}, {"Title": "Camera is great...wrong charger sent with camera.", "Author": "Karen Casturo", "ReviewID": "R3KFXM4F8OHLXH", "Overall": "3.0", "Content": "Camera and everything else is great.....except wrong camera charger was sent to me.  Can not find how to contact focus camera", "Date": "December 16, 2013"}, {"Title": "amazing camera", "Author": "CARLOS G MEDINA A", "ReviewID": "R307380WFM3VT8", "Overall": "5.0", "Content": "it's light and powerful. the pictures are grea. It comes with wi fi and I can handle it using my cell phone as a remote. I love it", "Date": "December 13, 2013"}, {"Title": "A good buy.", "Author": "JTinFLA", "ReviewID": "R38D6AN3YFUNUP", "Overall": "4.0", "Content": "Very functional camera, purchased as gift for my daughter, she loves it. Simple operation, loaded with features and Wifi ability to post on line right from camera.", "Date": "November 18, 2013"}, {"Title": "Great value", "Author": "Vidpkr", "ReviewID": "RII1QG66IXIJO", "Overall": "5.0", "Content": "We were going to use only for business photos but we love it so much we use it for personal too", "Date": "September 17, 2013"}, {"Title": "Sony camera Lens cloud up", "Author": "John T. Infantino", "ReviewID": "RTL4BR8LOQT6O", "Overall": "1.0", "Content": "Two (2) years ago I brought a sony -Exmor 10.2 mega pixels  Dsc-TX1  -FROM AMAZON-  PRESENTLY THE COMPLETE VIEWER LENS THAT YOU LOOK AT THE PICTURES, IS COMPLETELY FROSTED OVER AND  IT SOMETIMES DESTORTS PICTURE TAKING.  I BROUGHT THE SONY cyber-SHOT DSC-WX80/16.2 MP THINKING THAT SONY FIXED THAT PROBLEM.  THE NEW CAMERA LENS IS STARTING TO CLOUD UP ON THE TOP OF THE SCEEN.", "Date": "September 18, 2013"}, {"Title": "Very happy!", "Author": "Candace Siebenmorgen", "ReviewID": "R90Y1T6ZZWJOT", "Overall": "5.0", "Content": "I have 2 huge professional cameras but don't care to lug them around all the time.  I ordered this to replace an older Cybershot.  So far, I'm happy with it.  My wireless (complained of in other reviews) works fine.  This was a great kit!  Bargain!", "Date": "December 18, 2013"}, {"Title": "買いです！", "Author": "do-mo", "ReviewID": "R1R4LTAN4GA0PS", "Overall": "4.0", "Content": "This product models that are not released in Japan, between the DSC-WX200 and DSC-WX60.Wireless LAN sticks, it is the product is convenient without unnecessary features.It is a bargain and a spare battery case and memory card just to stick in addition to the $ 10 price target.Is if someone is allowed to wish so much liquid crystal protection filmCyberShot DSC WX80 Protector satisfaction guaranteedIt is a 5 star without complaint something like if included.", "Date": "January 3, 2014"}, {"Title": "Great camera", "Author": "Anita R Huckla", "ReviewID": "RQPN8WQ6Y03Y", "Overall": "5.0", "Content": "I like the Sony Cyber-shot DSC-WX80/W 16.2MP Wi-Fi Digital Camera with 8x Optical Zoom.  it has many upgraded features and is easy to use.  I use it to take pictures of my family and friends.  I plan to take it with my when I travel to Europe this summer.  It is compact, but able to deliver pictures equal to those of a much larger camera.", "Date": "December 25, 2013"}, {"Title": "not good", "Author": "D. Welch \"\"rrrocko\"\"", "ReviewID": "R2XTPRKH2FMQ3X", "Overall": "2.0", "Content": "Landscape pictures have VERY POOR color.Buttons too close together (settings easily changed while taking pictures).Auto focus poor, (non selective, can not be shut off.)Instructions very vague.Too many gadgets.", "Date": "October 3, 2013"}, {"Title": "Not so great", "Author": "Sue Barker", "ReviewID": "RDQ0KKQZZLYDB", "Overall": "3.0", "Content": "This is my second Sony - replacing a good model that is no longer available.  It is a much simpler camera and not very well crafted.  The on/off button is to small to be useful and the cord used to down load photos to the computer does not fit easily into the slot in the camera, and must be jammed together risking damage to the camera.In short, I wish I had not purchased this model.", "Date": "July 28, 2013"}], "ProductInfo": {"Price": "$219.99", "Features": "8x optical zoom plus 16x Clear Image Digital Zoom\n16.2MP images with stunning low-light performance\nWi-Fi sharing to upload photos and videos\nOptical Image stabilization with 2-way active mode for smoother videos\nCase design may vary", "Name": "Sony Cyber-shot DSC-WX80/W 16.2MP Wi-Fi Digital Camera with 8x Optical Zoom in White + Sony 16GB SDHC Class 10 + Sony Camera Case + Replacement NP-BN1 Battery + Accessory Kit", "ImgURL": "http://ecx.images-amazon.com/images/I/512g6tHZS7L._SY300_.jpg", "ProductID": "B00BIR5K5E"}}