{"Reviews": [{"Title": "I Like This Camera", "Author": "bisjack", "ReviewID": "R1Y8RQMMBVXIQH", "Overall": "5.0", "Content": "I bought this camera last week at a good price.  It seems for some reason the colored cameras go on sale for a lot less than the black cameras of the same model. Historically I've owned a number of Pentax DSLR's.....K100D, K10D, etc through the K5D. As a result, I've accumulated a number of K mount lenses making it very difficult to change brands although I have made a limited foray into the micro 4/3 family.In my opinion, this camera takes the best pictures of any of the Pentax DSLR's or M4/3's that I've owned. Since I've had it I've taken about 400 photos and displayed them on my 32 inch monitor using Adobe Bridge.  The photos are gorgeous.  I generally take landscape photos.  And using a not-very-perfect Pentax 18-250 mm lens I still get better photos than with any of the other Pentax cameras using the same lens.Now this camera has a few drawbacks.  I miss the top mounted LCD screen of the higher level cameras such as the K5D.  It also seems to take a little longer to come alive at turn-on or after it's gone to \"sleep\".  The shiny red finish seems a little \"plasticy\" compared to the standard black.But when taking multiple large file, Raw + JPEG photos (my normal setup) the buffering seems quite adequate and the camera keeps up.  Colors are rich, and even with the less-than-pro lens, the images are sharp.  Much sharper than what I used to get with the K7D with the same lens. Another feature that I like is the way the menu is set up with color highlights.The points that attracted me to buy this camera were, of course, the great Amazon price, the weather sealing feature, the ability to use AA batteries with the adapter and the fact that it has a real penta-prism viewfinder.  Interestingly, I asked for standard delivery and the camera came much quicker than predicted by the seller.All in all this is a great camera and seems to be a well kept secret.  I highly recommend this camera.", "Date": "July 13, 2013"}, {"Title": "LOVE IT!", "Author": "Kim S. Hite", "ReviewID": "R2YLLMTVNHK7BK", "Overall": "5.0", "Content": "I bought the Pentax K-5 in January and wanted to get a 2nd camera body so I ordered the K-30 and received it 2 days ago.  I put my Sigma 18-250 lens on it and the images are crystal clear.  I LOVE this camera and I think this camera takes better quality images than my K-5.  I wish I'd have saved myself a few hundred dollars back in January and bought the K-30 then.  Great value for the money!  I highly recommend this camera!", "Date": "July 26, 2013"}, {"Title": "Great camera for a great price", "Author": "formercanuck", "ReviewID": "R9MUQ8VTDKG88", "Overall": "5.0", "Content": "This is a great upgrade for my Pentax K-x.  The only reason that I upgraded... my old K-x took a fall, and the screen, and many of the controls (dial) does not function.For about the same price that I bought my red K-x a few years back, I get a whole bunch of extras:1. Weather proofing (still need to purchase a WR lens - but I do recall my old K-x fogging up badly on a trip to Alaska)2. Live view at 60 FPS - very nice for video and helping with my manual 85mm Rokinon lens to focus - gives 6x display zoom.3. Dual battery style option - AA (lithiums last +2x longer than any battery pack - and easy to find cheaply almost anywhere)4. Similar to my old Kx - comes in Red (although I could have waited paid an extra $150 for a bright red K-50, I'll put the cash to good use elsewhere).5. VERY good pictures.Came in a factory sealed package with warranty cards, etc.  It was a very reasonable deal.Beats Canikony (Canon/Nikon/Sony) for a rugged prosumer camera IMO.", "Date": "October 6, 2013"}, {"Title": "a winner", "Author": "jed frankel", "ReviewID": "R3FVCI3ALFO3B6", "Overall": "5.0", "Content": "Great camera.  Upgraded from k 10d and very satisfied.  Cutting edge body and get use all my Pentax film and digital lenses.", "Date": "August 31, 2013"}, {"Title": "Great step up from what I had", "Author": "gar-man", "ReviewID": "RYIHVMLJU1Y5O", "Overall": "5.0", "Content": "I had a pentax k-100 and upgraded to this camera.  I am very pleased with it as it has much more functionality", "Date": "January 30, 2014"}, {"Title": "PENTAX did it again!", "Author": "Mary Anne Ritter \"Art Design Fabricator\"", "ReviewID": "R18NJLQVELR01I", "Overall": "5.0", "Content": "I am a Pentaxian since 1978.  After several disappointed attempts with other Digital Camera Brands, I moved fully into the Digital SLR age with my White Pentax K-x, a little more than an entry level SLR camera.  The biggest drawing card was that I could use all my older Manual and Automatic lenses. (Many of the newer Pentax lenses are already made to resist dust, moisture, etc.) The K-30 drew me in with the ability to capture even more of what I love to do with my K-x.  Low-Lighting pictures are amazing!  The Scene Settings are expanded to cover so much more. There are so many built-in filters.And the compliments! The handsome, some-what hefty Red Metalic K-30 (with a WR kit lens)is weather resistant, dust resistant and cold-tolerant. (Read your manual to understand how this works.) That means I can capture a Wedding, a Baby's first smile, a Hummingbird on the wing, a snowy winter scene at night or a dusty \"Mudder\" in a unbelievable race to the finish - without worrying - that my camera will get ruined during the unique conditions that often occur in any of the above.  Take it ice fishing or to a fireworks display.The K-30 is a Professional Level Camera.  (It is not a glorified - Point and Shoot!)  If you get stuck join Pentax's forum and get your questions answered.  The Lithium battery life is excellent.  Though this body comes with one battery and charger, purchase one or two extra batteries for back-up.  If you are a serious Photo Bug, for an emergency, purchase the AA Battery Holder.  AA are available everywhere.  If you use Rechargeables, they must be a high-end type.  (I just got the newest Eneloop 2500 Ni-MH batteries.)  The Price is great for what this camera can do and I highly recommend it. I too, believe Pentax  is a \"best kept\" secret!", "Date": "July 14, 2013"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B00B8ZKN2Q"}}