{"Reviews": [{"Title": "Awesome little camera", "Author": "Jorge Valdes", "ReviewID": "R184XHIW4U0C7A", "Overall": "5.0", "Content": "I got this mainly because of the brand. I had just gotten a Samsng phone, and was impressed with the camera feature, and after having a canon camera since 2000, I made the switch. I am very pleased. The camara takes great shots. Purchased it at the start of the summer vacation and took several hundred pics. One of the great things is night shots. My previous camera did not do such a good job with these, but now I can take great shots and still have not gotten into the manual tunning stuff...", "Date": "June 28, 2013"}, {"Title": "Very Crisp Pictures", "Author": "Ktruong", "ReviewID": "R2T5E6KWS2GR1L", "Overall": "4.0", "Content": "Took this camera on a trip to Texas last week. With the storms and sunshine being so random it was an awesome time to check out different settings of the camera. The pictures came out well, video picks up loud audio great. Panorama pictures also look great and the camera will enlarge the panorama and self scroll to see the whole picture. Definitely worth 150. :)", "Date": "May 30, 2013"}, {"Title": "i'm happy it's mine", "Author": "nikki", "ReviewID": "R3R8VCU9W5I8XY", "Overall": "5.0", "Content": "I love it the picture quality is so beautiful it's the perfect size, it's a good price my husband bought mine for me and it's easy to use too, I recommend it if you want a simpler camera but also takes beautiful pictures with wi-fi,HD without going broke for it", "Date": "November 9, 2013"}, {"Title": "Barely a delay, stylish, and worth the price", "Author": "NS6677 \"NS6677\"", "ReviewID": "R3H3MAY9FPU76E", "Overall": "5.0", "Content": "Smart frames and ability to edit photos from the camera.  Quality is very good, even on 5 Megapixels. Fast response time. Perfect choice.", "Date": "October 13, 2013"}, {"Title": "Could be 2*, could be 5*", "Author": "No Ax To Grind", "ReviewID": "R3HPNPN6LHRJAC", "Overall": "3.0", "Content": "June 2013 Update: ** (2*) was correct (I can't seem to change my original rating on the Amazon review).  As I wrote in my initial review, I am coming back with more after using the camera.  Since it took me so long to set up, I hadn't any experience when I wrote about the set up difficulties.  I've used the camera in a variety of situations and am disappointed in its picture quality.  While the photos look sharp on the camera's screen, they were not sharp on my computer screens (I didn't print any). The image stabilization did not work very well and pictures taken in low (not terribly low) light were just not acceptable.  Also, there appeared to be quite a bit of \"flare\" when there was a light source in or near the frame.Now, I understand how subjective an assessment of photo quality can be so I was very hesitant to write about it.  But, when I went to shop for another camera, I was helped by an extremely knowledgeable salesperson.  This person agreed with me that the user interface was good (after getting past the difficult set up) and the WiFi features were good as well.  But we both knew that the picture quality was not as good as that of other brands.  I was glad to see that I wasn't punishing this camera because it was frustrating to set up.I have several Samsung products (HDTV, Android phone, BluRay DVD player) and I am usually a fan.  However, they don't seem to be among the best when it comes to this WB30F.  Even on the products that I do like, the user interfaces have not been worked out to a level that I would call excellent.Below, is my initial review:---It's hard to rate this camera because it is so hard to set up.  I'm giving it 3* in this review because that seems like a compromise.I bought this camera because it has WiFi and I want to have my pictures sent to my computer without connecting a cable.The camera comes with a rudimentary setup guide in the box but no manual.  After an hour or so (yes!) of searching, I finally found and downloaded a manual.  Samsung doesn't have a consistent naming policy (sometimes it is WB30F, other times it is WB 30F).  The manual appears to be complete, but it doesn't give much help with getting the WiFi auto backup to work.To use the wireless backup to a computer, you need to install two programs:  Samsung iLaunch and Samsung PC AutoBackup.  Installation of these programs begins when you plug the camera into a USB port on your computer.  But, who knew that's the way to install these programs.  If you turn on WiFi on the camera the onscreen display tells you to run these programs.  BUT DO NOT DO WHAT I DID.  I searched the Internet for these programs, found sites that purport to download the software, but instead load a bunch of hard-to-remove garbage on your computer.Samsung really needs to make it clear how to install these necessary programs.I removed the garbage from my browsers, deleted them using add/remove programs and was ready for the installation again.After I plugged the WB30F into the USB, I did get a chance to install the software.  But the onscreen display says to install \"iLauncher\" and the computer popup asks you if you want to install \"iLinker\".  Who knew?Well, when iLinker pops up, that's the one to install.  After that is installed, it gives you the option to install \"PC AutoBackup\".  The rest of the setup was okay.I haven't had a chance to look at photo quality and other features yet because I wasted so much time on installing the WiFi stuff.  I'll come back with more.", "Date": "May 31, 2013"}, {"Title": "Great Camera!", "Author": "Amazon Customer", "ReviewID": "R33NHF50A0OMAX", "Overall": "5.0", "Content": "Love this camera!  It does everything and is very easy to use. Another terrific feature is that it's so compact.", "Date": "November 13, 2013"}, {"Title": "Best WiFi camera", "Author": "DENISE FENTRESS", "ReviewID": "R15YFF6F2JZJGB", "Overall": "5.0", "Content": "The camera takes very good pictures and  is easy to use. I have no problems connecting to WiFi and downloading my pictures. Its quick and easy to do. I have downloaded using an android, an iPad and my gateway lap top. I read previous reviews stating they couldn't connect to wi fi. Well I'm no techno whiz and I did it with no problems. It comes with a nice little cheat sheet that you can carry right in your camera case in case you can't remember how to do it. I love this camera.", "Date": "February 7, 2014"}, {"Title": "Phenomenal deal, outstanding quality", "Author": "lidia jimenez", "ReviewID": "RR0KUMHA9YXQO", "Overall": "5.0", "Content": "Ordered Wednesday received the following day, Initially observed latin america sticker, once turned on the unit was in spanish, quick easy fix. solid picture quality sleek design, and great function with wifi", "Date": "October 3, 2013"}, {"Title": "NOT BAD FOR THIS NOVICE- Considering Price and Competitors", "Author": "Blake in Cali", "ReviewID": "R18DJADXGVC6LY", "Overall": "4.0", "Content": "It's really 3 1/2 stars but I rounded up based on ease of use, additional \"neato\" features (Using wi-fi/email pictures, Using cellphone App to remote control camera, etc.), overall picture quality (decent) and price vs. similar products/ competitors . I took a photography class back in college when everything was film and manual. Toggling between Menus to get the right ISO and lighting conditions, picture settings, etc. can be a pain but that's the price for digital technology.I'm still getting used to the camera as I haven't had a lot of time to go through the 150 page Manual (which did NOT come with the camera but was easy to download as a PDF off of samsung's website- Highly Recommended to do).Test #1 Hiking in Dense Forest of Big Basin. - A lot of adjustments had to be made in dimly lit places, especially to the flash and ISO. The AUTO settings did not do well but once I increased the ISO and remove the auto flash, pictures came out nice and crisp. The ZOOM is VERY nice. I took pictures of local birds and hawks from far away and they came out very nice.Test #2 The meadow of wild flowers in my backyard. They came out blurry and I'm still wondering why. I focus (or wait for the auto-focus), the viewscreen looks sharp and clear, so then *snap*- \"Hey?!?! Why is there blurriness?\". It could have been too many targets for the auto-focus to track, I was shaking the camera (but even on a tripod?) and the ISO/Flash features needed to be better adjusted. Pictures were OK.Test#3 - People (Fire Dept. Event)! The pictures came out fine and very little to no adjustment was needed.So- If what you want a camera to take pictures to jog your memory of the people and the places you have seen, you cannot beat the price. It is sad that my cellphone seems to take better pictures up close, but the phone is not a camera and can only do so much. This camera's zoom is perfect for my travel needs, has a longer battery life, more features, and of course, depending on the memory you purchase, more storage for a big trip. If I want to get into Photography as and art form, I will upgrade to a DSLR (and maybe take a class).", "Date": "December 2, 2013"}, {"Title": "Up loading the video to computer for editing", "Author": "Tarlock", "ReviewID": "R2BES5LLBHNC99", "Overall": "2.0", "Content": "The technical specifications for Samsung WB30F list the video connectivity in NTSC and AV but this model camera will not do that, the video is loaded to the computer only in MP4,  that will require newest video editing program to copy it to edit it.I did not like this in this camera.", "Date": "November 15, 2013"}, {"Title": "Troubles with Wifi connectivity", "Author": "R. Langham", "ReviewID": "R8K12LGT4LVWT", "Overall": "2.0", "Content": "Very nice camera, but I purchased it because of the Wifi options, which rarely worked.  My career is with computers, networks, software, etc., but I just couldn't get this to connect reliably to my wifi network.  I have 10 other devices that connect fine.  I was able to get it to connect twice out of about 20 attempts.  When it did, I was able to easily sync all the pictures to my Windows 7 computer, which is one of my primary goals.  5 minutes later, it would not connect again, would keep on getting \"Connection Failed\" error.I did find out that I do have to turn off my firewall completely, which prefer do not have to do everytime that I want to upload pictures.  I contacted their support, searched the manual and web for the ports.  Support was unable to help me.  Through some network programs I believe I tracked it down to a couple of UDP ports, but then was never able to test again since I could not get it to connect to my network, very frustrating.It did connect pretty easily to my Samsung Android phone and my Samsung Galaxy Tab 2.  This was not using the wifi, bluetooth I suppose.  I was able to transfer over a picture or two, but only one at a time.  It does have a nice feature with an Android app where I can actually view what my camera sees on my phone, adjust some options, and then signal it to take the picture.  Nice for group shots where everyone wants to be in the picture.I was also hoping that the SkyDrive option would behave like my DropBox on my phone.  When I get home, all my pictures on my phone are automatically synced to DropBox and then automatically synced to my computer.  Very nice.  Well, the SkyDrive transfer option was with you selecting a picture at a time.  You could not easily have it just upload all pictures (or latest pictures).UPDATE 1/5/2014: I ended up returning this camera because I could not get the wifi to work and connect to my computer.  I ended up buying a Canon wifi camera.  I basically had similar problems and then found the (modified) instructions below in a review.  Maybe this will help another person who has this camera.  Not sure if this would have resolved my issues or not.1) Click the Start button in Windows 7 then type \"stream\" in the search box, then select the \"media streaming options\" selection,2) Select the \"Turn on Media Streaming\" button then either Block or Allow the client you choose and close the window,3) VERY IMPORTANT - Click the Start button in Windows 7 and search for \"Device\" then select the \"Devices and Printers\" option - LEAVE THE WINDOW OPEN,4) (Do the camera wifi connection steps for your computer, don't recall what they are when I had it)5) On the Device and Printers window click the Add Device otpion at the top-left6) Wait for the camera to appear as a selection then click and add it", "Date": "December 28, 2013"}, {"Title": "A Very Good Camera", "Author": "Richard E Warren Sr", "ReviewID": "REECNWGWXPL4H", "Overall": "5.0", "Content": "Takes great pictures.  Easy to use!  My wife is not a techie but loves this camera.  A good value for the money.", "Date": "November 4, 2013"}, {"Title": "GREAT WI-FI CAMERA", "Author": "robert mullinax", "ReviewID": "RTQX4ACYQFPUU", "Overall": "5.0", "Content": "The wi-fi is great. It is fast and simple. You can not beat the camera for the price.The battery power is great.", "Date": "November 4, 2013"}, {"Title": "My friends Camera work the best my Camera died.", "Author": "V.Q.M", "ReviewID": "R3QXVBNY2PDNYI", "Overall": "2.0", "Content": "I bought this camera from the experience of my friends camera Samsung WB30F. We traveled all throughout Europe for over 3 weeks and she took some great photos. Sent our friend photos every night via Wi-Fi. Just love the camera she was using I bought one too from my return trip home. My camera died shortly with NO USE at all even after I charged the camera for approx. 3-4 hours. Then I thought I should charge it again. I did. The flash wouldn't work. Then the camera died again. I tried to hook it up to the computer but the camera wouldn't turn on again at first then again it turn on. Unplugged it from the computer and it died again. My guess is the battery isn't charging from inside the camera. The only way to charge the battery is to hook up a USB cable to camera using a plug at the end. in other words there is NOT a separate charger. You use the camera to charge the battery. I cant say that is the problem with the camera. It just kept dying. I didn't want to fuss with it anymore nor do I think I should for a Brand New camera less than 12 hours old. Sending it back. Maybe a bad batch but I wanted to keep it but now I am Leary about the camera performance completely now. I own more cameras then I would like to disclose and NEVER had this problem. Take your chance I guess but this is my review. Maybe I got a Lemon but I am not a gambling person. I even ordered directly from Amazon if that helps at all.", "Date": "May 16, 2014"}, {"Title": "Amazing low-cost camera", "Author": "Rollocado", "ReviewID": "R3G2J50GOI22H5", "Overall": "5.0", "Content": "Qualities of this one are:-Size and design (When I carry it, I usually just slip it in my pocket, take it out, point and click in a matter of moments)-Wifi feature-Price! For this price there are several Olympus and Sony counterparts, however this is a better option.-Optical zoom of 10x is worthwhileOverall, I picked it for it's practical design, good specifications, and easy portability!", "Date": "February 26, 2014"}, {"Title": "So far so good", "Author": "Tom Becht", "ReviewID": "RC6ND9K0WUE8", "Overall": "4.0", "Content": "Good price and nice features.  My first Samsung camera after using Panasonics for 6 years.  I like the features so far.", "Date": "January 25, 2014"}, {"Title": "Nice camera", "Author": "Mark S Bogannan", "ReviewID": "RUMRTXMX4P425", "Overall": "5.0", "Content": "Camera takes good pictures happy with results, easy to use with a 16GB card holds 70,000 pictures, my wife is pleased with it.", "Date": "January 11, 2014"}, {"Title": "Outstanding Value Buy", "Author": "Dennis N. Akers", "ReviewID": "R20XRPW717GGRD", "Overall": "5.0", "Content": "I love this little phone...it does everything I need it to do with minimal discomfort.  The wifi capability is good to have but a bit of a task to get working.  That said the picture quality is great.  For an under $100 camera, this is hard to beat.", "Date": "December 16, 2013"}, {"Title": "Was not able to connect the wi-fi to my computer and Facebook directly", "Author": "Heather Kinney", "ReviewID": "RW0UTH74YKKLZ", "Overall": "1.0", "Content": "Was not able to connect the wi-fi to my computer and Facebook directly although it is suppose to be able to download directly to Facebook, which was my primary plan.", "Date": "November 14, 2013"}, {"Title": "Great pictures from small camera", "Author": "James Reid", "ReviewID": "R3M646DB310VHJ", "Overall": "5.0", "Content": "I like the large screen for taking and reviewing your shots and the zoom is really good for a camera this price. Be aware it does use a micro-SD card so that is a little bit of a hassle to keep up with the adaptor to upload your memory card onto your computer-not really a big hassle, just one more step.", "Date": "October 26, 2013"}, {"Title": "I returned it", "Author": "R. Clayton \"Mochareno\"", "ReviewID": "R1N5B13EPFDGKL", "Overall": "1.0", "Content": "This camera is not suitable for indoor shooting.  It only had two shooting settings.  I was not even able to get a decent shot outside in optimal light.  For some reason I thought it had video capabilities. It does not.  It's my fault for the video mistake, but I thought I would mention it in case you need video.", "Date": "February 19, 2014"}, {"Title": "poor picture quality", "Author": "Keith Nelson", "ReviewID": "R3GPIQKSQI9B1R", "Overall": "2.0", "Content": "For 16 MP camera the picture quality is not what I expected, the battery seems to lose power too fast and the 8 gb memory card holds a limited amount of pictures!", "Date": "January 8, 2014"}, {"Title": "Very good camera", "Author": "Raul Davidov", "ReviewID": "R1ODJAO3RPWEQG", "Overall": "5.0", "Content": "For that money this is a very good camera. It's small, lightweight and comfortable to hold. Good quality pictures. You can change the ISO to shoot in the dark without a flash. No negative comments, only positive.", "Date": "May 30, 2014"}, {"Title": "Great camera with good quality photos", "Author": "Sandra B. Brown", "ReviewID": "R1NTQS2ZPJH1SX", "Overall": "5.0", "Content": "Easy to set up, easy to use and upload to the web.  Great choice for my use.  Battery holds a charge and reduces the need to recharge as often.", "Date": "May 25, 2014"}, {"Title": "I relly love this camera", "Author": "W. J. Henderson \"world traveler\"", "ReviewID": "RLH8J8807F9XE", "Overall": "5.0", "Content": "This has more bells and whistles than a hook and ladder fire truck.  It'll take me a long time to figure out everything it can do, but, for now, I was quickly able to charge it up, take some pictures, load them to my computer and send them off to my no account geezer friends.  If on has experience with little cameras like this one will be in business right out of th box - after battery charging, of course.I bought this on sale for half the listed price so, keep your eye open.", "Date": "May 24, 2014"}, {"Title": "Perfect fun camera", "Author": "Lori", "ReviewID": "RGJLCBERJ4D1F", "Overall": "4.0", "Content": "I have had this camera for about a month and yes, I had to use my own mini disk to save photos. I have used in in the conventional way of taking pictures then loading them on my PC and eventually a disk. I have not figured out how to use wifi or any other feature. The display is large - use a case. It is a good basic camera on the go.", "Date": "May 23, 2014"}, {"Title": "Great camera!", "Author": "Sharon Spigelmyer", "ReviewID": "R103IK47VDIWM3", "Overall": "5.0", "Content": "Very user friendly, great pictures, lots of options and extras! I love the camera!!I would definitely recommend this camera!", "Date": "May 22, 2014"}, {"Title": "Best little camera for the price", "Author": "Michael Nagel", "ReviewID": "R1UOKKDQ2V2OFP", "Overall": "5.0", "Content": "Easy to use and it takes amazing pictures with no effort at all on my part, I live by samsung products and this one goes well beyond my expectations", "Date": "May 15, 2014"}, {"Title": "Great Camera for Beginners", "Author": "Crystal Begley", "ReviewID": "RVKJHZRS2M809", "Overall": "5.0", "Content": "I LOVE this camera!! So easy to use and takes great pictures!! Perfect for posting to FB! Would recommend it to any one!", "Date": "May 12, 2014"}, {"Title": "Samsung Camera", "Author": "Diana Anderson", "ReviewID": "RIHWZFB9DGIE1", "Overall": "5.0", "Content": "Fabulous camera! Easy to use! Terrific close-ups! Battery lasts a long time.  Just remember to get the correct card to go with it.", "Date": "May 9, 2014"}, {"Title": "love", "Author": "Amazon Customer", "ReviewID": "RL6RLSCSIIA0G", "Overall": "5.0", "Content": "i am in love with this camera! great style and easy to hold. lightweight and fits almost anywhere. smart buy.", "Date": "April 4, 2014"}, {"Title": "awesome", "Author": "Angie Ross", "ReviewID": "R1YYBOYSG82TU5", "Overall": "5.0", "Content": "It was here in time, and works wonderfully.  It is sleek and fits in my pocket with no problems.  Thanks", "Date": "March 19, 2014"}, {"Title": "Grandma", "Author": "Renee F. Richter \"grandma\"", "ReviewID": "R21L0YDMYS1T8A", "Overall": "5.0", "Content": "I have used the camera once and it is great at obtaining the view I had hoped to obtain. It is working well with my computer as well as being small enough to be easy to handle with a room full of family at eventsthat need to be kept for future memories.", "Date": "March 17, 2014"}, {"Title": "takes good pictures", "Author": "Denise", "ReviewID": "R23IEUQNMOF2Y2", "Overall": "4.0", "Content": "the camera takes good quality pictures,  I have still having trouble getting the camera to syn with my smart phone.", "Date": "February 23, 2014"}, {"Title": "pretty but not so clear pictures", "Author": "Magdalena Lira", "ReviewID": "R3LICD3HVCP5ZC", "Overall": "3.0", "Content": "Some pictures are not coming out clear. And it is hard to move through the menu to take a picture if you are on other features.", "Date": "February 23, 2014"}, {"Title": "so many features yet to discover...", "Author": "Baking Soda Shop", "ReviewID": "R1N1FKVNWKGGC4", "Overall": "5.0", "Content": "It's a wonderful camera...and the features are an adventure every time I use it.  It's easier to use than any I've had in the past and the icons are simpler to identify.", "Date": "February 22, 2014"}, {"Title": "no instructions come with the camera to explain all the features", "Author": "layla spurgeon", "ReviewID": "R3VDQ9SJS0CV19", "Overall": "3.0", "Content": "i had to contact the Samsung website to download 157 pages of 8x10 paper to printout the instructions/ a waste of money and time", "Date": "February 20, 2014"}, {"Title": "Good Buy", "Author": "Sandra", "ReviewID": "R31XNEDTUU522N", "Overall": "5.0", "Content": "I chose this product for the price is cheap, and is very good buy, exelentes clear and very easy to handle photos, you can download photos to your computer to email or pass cell.the camera is small and easy to carry in your pocket. 16 megapixel photos are exelentes. Recommended.", "Date": "February 15, 2014"}, {"Title": "Excellent product and a good price!", "Author": "alfonso bello consuegra", "ReviewID": "R192XX0WYWV129", "Overall": "5.0", "Content": "The product came to me well and on time, without any problem, I'm already using and it works perfectly, totally recommend.", "Date": "February 8, 2014"}, {"Title": "Not really pleased.", "Author": "Carol Robertson", "ReviewID": "R30WFEF5SXJXTE", "Overall": "3.0", "Content": "Have not used the camera very much yet but it is not easy to use the wifi and that is the only reason I bought it.", "Date": "January 28, 2014"}, {"Title": "Great camera with the manuals downloaded", "Author": "Thomas Ferraiolo", "ReviewID": "R364STLPZXDGSR", "Overall": "4.0", "Content": "Great camera for the price with WIFI. WB30F was easy for me to use and setup the WIFI, as I read all the comments from others in the setup and use of the WIFI Feature. I downloaded the manuals prior to purchase and was ready to set the camera up for my wifeto use the WIFI feature. Our only complaint about the camera is generic to this type of camera, Samsung, Nikon, Cannon  etc, is the size of the camera, awkward to not hit a button or cover a sensor, to small.", "Date": "January 21, 2014"}, {"Title": "Great daytime, closeup pix, love the wireless use", "Author": "Amazon Customer", "ReviewID": "R31SWWXKR54PQU", "Overall": "4.0", "Content": "I use this camera for taking pictures of birds and for travel photos.  The zoom through a window pane at 30 feet still gives me great bird pictures.  Shooting a landscape picture is ok, it seems a lot smaller on the camera than what my eyes see and is hard to tell what I got.  Forget this camera for evening indoor/outdoor photos.  I have tried everything and low light photos are awful.  The night-vision works, but not what I had in mind for indoor/outdoor low-light family and travel shots.  Went to Vegas and any shots I took after 5 pm where unusably blurry.  Daytime shots were great. There doesn't seem to be an option to program the camera for landscape or low light photos like my old Sony had.  It is more suited for \"beauty\" shots it calls it with red eye erasure, cropping, frames, and lots of weird lighting effects.  Videos were good in daylight.I liked the wireless option so I could post pictures on FB without having to download to a computer first.  It is tedious typing in words to go with the pictures, but then it is a camera and not a PC  I found it easier to just type a few words, download the photo(s) to FB and then go to the website on my computer and add more descriptions from there.", "Date": "January 18, 2014"}, {"Title": "Good", "Author": "Ezekiel Boen", "ReviewID": "R2181YFEAONFD5", "Overall": "4.0", "Content": "One problem, at time it crashes and i have to take off the battery to restart it.All other properties are good", "Date": "January 15, 2014"}, {"Title": "spectacular", "Author": "Franklin José Vásquez Crespo", "ReviewID": "R3FVWZAUFXE3C1", "Overall": "5.0", "Content": "This equipment is the best market I recommend it. They are very good quality.Se despide de usted:Franklin Vasquez.", "Date": "January 9, 2014"}, {"Title": "very good camera", "Author": "Mike", "ReviewID": "R29MR2DUCUFT26", "Overall": "5.0", "Content": "Camera takes great looking pictures and wireless backup over network is a great function! I like this product a lot.", "Date": "January 7, 2014"}, {"Title": "wb30f", "Author": "hector miramontes", "ReviewID": "ROE0KYUHG6VIK", "Overall": "3.0", "Content": "Keep the camera really straight or else pictures come out blurry. Other than that no other problems with the camera", "Date": "January 3, 2014"}, {"Title": "Canera", "Author": "Andrew Jones", "ReviewID": "R1MZXB6CBXLV4S", "Overall": "4.0", "Content": "Selected this camera for my mothers Christmas gift. She needed something simple to use that takes good quality pics. This camera meets both needs!", "Date": "January 2, 2014"}, {"Title": "Samsung WB30F Smart Wi-Fi Digital Camera", "Author": "Peter J. Schulte", "ReviewID": "R3Q9J8R14L8BDC", "Overall": "3.0", "Content": "It's okay, but never could log on to my Picasa. We returned it in order to get one with a touch screen.", "Date": "January 1, 2014"}, {"Title": "Great camera", "Author": "Laurie Zeleny", "ReviewID": "R1M8R3FVJ6L9NU", "Overall": "4.0", "Content": "This camera is very easy to use takes gorgeous photos & wifi makes it quick to share photos with others", "Date": "December 29, 2013"}, {"Title": "Digital Camera", "Author": "Evelyn Steck", "ReviewID": "R2SNET1PEGLJJY", "Overall": "4.0", "Content": "I like this camera.  However, I'm still trying to learn how to use it.  Just found out yesterday where the zoom was.  Next thing to do is learn how to download the pictures I've taken on a recent trip and see how they came out.", "Date": "December 22, 2013"}, {"Title": "Purchased for hubby!", "Author": "Patricia WAgner", "ReviewID": "RR7596KH4SJVL", "Overall": "5.0", "Content": "Perfect product for my hubby! We love to take pix of the family and it is compact; easy to put in your pocket and the pix are great! Thanks Samsung for another great product and thanks Amazon for getting it here quick and safe!", "Date": "December 17, 2013"}, {"Title": "Good Camera if you can figure out the menus", "Author": "vuniv", "ReviewID": "R18LYZQPGXUO5T", "Overall": "4.0", "Content": "My 8 year old Granddaughter is a quick study and learned to navigate through a quirky series of menus.  When the correct settings are used, this camera takes very nice pictures.  The only feature I was unhappy with is the macro setting.  It did not seem to focus correctly.", "Date": "December 11, 2013"}, {"Title": "Good but is mSD", "Author": "Otto Herdia \"Otto\"", "ReviewID": "R2B4S76A19ORC3", "Overall": "4.0", "Content": "Is a good product but in any description said that is for mSD memory, i have a normal 16G SD of my previous camera, so had to buy a new micro SD.", "Date": "September 6, 2013"}, {"Title": "good camera", "Author": "MIKE", "ReviewID": "R1EAZ9D6R6S2J6", "Overall": "3.0", "Content": "My problem with this order is that a memory card was recommended as an add-on to the order. The problem is the memory card recommended does not fit this camera. It needed a Micro Memory card and this one was a full sized card that does not fit in the camera. I had to order the correct memory card in order to use the camera at a extra expense of time and money. It has to have the memory card in it as two pictures will fill the memory in the camera. I am happy with the camera but very disappointed with Amazon for the misleading recommendations. I guess it is \"buyer beware.\"", "Date": "January 11, 2014"}, {"Title": "Best camera for a great price", "Author": "i just bought it but itwont even work", "ReviewID": "R1U171AHE5DF5G", "Overall": "5.0", "Content": "I just love this camera! I have had many and this one is by far the best one for a low price.", "Date": "January 24, 2014"}, {"Title": "Excellent Bargain", "Author": "Huzefa", "ReviewID": "R1V0XM54M97AXZ", "Overall": "5.0", "Content": "I got this from Amazon with a great discount! It is a great product and the quality of the pics (I am not a professional photographer though) is excellent for my purposes. It has loads of amazing features, especially the WiFi.I would recommend this to anyone interested in buying a digital camera for personal use.", "Date": "January 12, 2014"}, {"Title": "My son just can't put it down!", "Author": "Juan Santamaria", "ReviewID": "R1OZ59GIJ74W0A", "Overall": "5.0", "Content": "I got this for my nine-year-old son. He is very happy with it. The camera is not complicated to understand and the images are neat, I'm sure my son will become a photography fa thanks to this camera!", "Date": "December 24, 2013"}, {"Title": "not good for so many reasons", "Author": "gina rymer", "ReviewID": "R2H4BENJOYV2FO", "Overall": "1.0", "Content": "Had to return because lense cover wouldn't close after one week worth of use.Didn't take good sports pictures, low light pictures.Major disappointment", "Date": "October 27, 2013"}, {"Title": "poor quality", "Author": "Stephen C.", "ReviewID": "R13KG518DYU9CD", "Overall": "1.0", "Content": "Bought this for my wife for Christmas. Used it twice and it broke on the second use. I would not recommend this to anyone.", "Date": "January 3, 2014"}, {"Title": "Works great for my needs....", "Author": "William Givens", "ReviewID": "RQ90HGYFU4PVJ", "Overall": "5.0", "Content": "I purchased the camera for taking real estate photographs. The small, lightweight size makes it easy to carry and store in my office desk. The 24 mm lense was the widest angle that I could get for what I wanted to spend. So far the camera is taking great pictures and the wide angle capability really helps when taking pictures inside houses in bedrooms and baths. Bought an extra memory card so I have lots of storage space.", "Date": "September 18, 2013"}, {"Title": "looked used", "Author": "rebecca", "ReviewID": "RBYMOTNBH93E0", "Overall": "1.0", "Content": "I found it difficult to use. The camera looked like it had been used. All of the paperwork was not included. No warranty card. So, I am sending it back.", "Date": "October 19, 2013"}, {"Title": "easy to use", "Author": "Kathy Scamperino", "ReviewID": "R22CF97J7EB067", "Overall": "4.0", "Content": "I like the camera, seems easy to use, but came without a memory card.  I did not expect that !!  It should be included.", "Date": "October 4, 2013"}, {"Title": "Cool and Easy as long as you have a micro SD", "Author": "D. Campbell \"donnabellee\"", "ReviewID": "R1FZ401CE0ZC62", "Overall": "5.0", "Content": "This camera does so much! I have yet to even play with half the settings. he picures are great, I like that I can e-mail the pictures straight from the camera and even post to facebook.Very small fits in my pocket.When I ordered it, the site suggested I buy an SD card which I did, but I didn't see that it actually requires a micro SD! Lots of wasted money and time having to wait for that. And you need the micro SD to do most anything besides take a picture.", "Date": "February 16, 2014"}, {"Title": "Dont know yet", "Author": "kristen", "ReviewID": "RL4F1HFOFI4CL", "Overall": "3.0", "Content": "Bought the camera through amazon as a bundle with memory card they showed and the memory card does not fitthe camera, so now I have to find a memory card, hope I can find one.", "Date": "December 25, 2013"}, {"Title": "Patently false product description re: Wi-Fi", "Author": "R.E. Carta", "ReviewID": "RSE2BTB5OL06", "Overall": "1.0", "Content": "I'd rate this a zero if I could.The product description says: \"Thanks to built-in Wi-Fi, transferring your images and sharing them no longer requires memory cards or cables.\"Patently false. You can't do anything with Wi-Fi unless you BUY a microSD MEMORY CARD, which has to be ordered separately. There's nothing in the product description that informs you of this requirement. I didn't think I needed to do this because the last camera I bought - not a Samsung - INCLUDED a memory card.Page 104 of the manual states: \"You must insert a memory card to use the Wi-Fi features.\" Does that sound like \"no longer requires memory cards\"?", "Date": "March 25, 2014"}, {"Title": "Not the camera I really wanted", "Author": "Ruth", "ReviewID": "R21815C86QWH1Q", "Overall": "3.0", "Content": "Put your money in a better camera. It's ok for day to day stuff but not as good as my Canon or Nikon", "Date": "September 7, 2013"}, {"Title": "Camara hard to use.", "Author": "Jeanette Bujold", "ReviewID": "R13GZ7GS0RQGOK", "Overall": "3.0", "Content": "no video, very difficult. I wanted video. I will try to work it out. Oh well. That's the way the cookie crumbles.", "Date": "December 15, 2013"}, {"Title": "Samsung WB30F 16.2MP smart Wi-Fi Digital Camera", "Author": "sapphire77 \"331flowers\"", "ReviewID": "R2V0IIBKEH9ZF6", "Overall": "1.0", "Content": "I received this camera 3 days ago 1/18/2014.  It did not com with with a smart card. but what it did come with are two strips about 1 1/2 long aluminum in color. If I try to use the camera, the back of it says full.  What is up???", "Date": "January 20, 2014"}], "ProductInfo": {"Price": "$179.99", "Features": "10x Optical Zoom\nSMART features - Social Media Upload, E-mail, Direct Link, Mobile Link, PC Auto-backup, Remote Viewfinder, All share, Cloud Service\n720p HD Video", "Name": "Samsung WB30F Smart Wi-Fi Digital Camera, 16.2 Megapixel, 10X zoom, 3.0\" LCD Display (Black)", "ImgURL": "http://ecx.images-amazon.com/images/I/41Rh6tlGPiL._SY300_.jpg", "ProductID": "B00BHQ5NVM"}}