{"Reviews": [{"Title": "Takes great pictures", "Author": "tcappr", "ReviewID": "RTR66ITL160ET", "Overall": "4.0", "Content": "I use the camera almost daily for work and am very pleased with it. Easy to focus, wide angle lens and is just what I needed for real estate photos.", "Date": "June 10, 2013"}, {"Title": "Excellent value for a digital video/picture camera", "Author": "Laurence G. D'alberti", "ReviewID": "R2GSXBRMZOKV9H", "Overall": "5.0", "Content": "The settings for this camera include Magic, Panorama, Beauty, Scene Mode.  Then the special effects are: Pop Art, Pin Hole, Fish Eye, Drawing, Soft Focus, Punk, Sparkle, Watercolor, Reflection, Miniature.  You can turn the flash off and control the exposure with numerous light mode settings.  Has Macro and Zoom lens as well.  Great videos as well.  Best camera I ever bought.", "Date": "October 24, 2013"}, {"Title": "Olympus VR370", "Author": "Michael L House", "ReviewID": "R2582NZBW8TS9J", "Overall": "5.0", "Content": "Wife loves this camera and all of the available options that this camera comes with.  Already has taken many photos with it.", "Date": "June 14, 2013"}, {"Title": "Excellent camera", "Author": "moneysaver", "ReviewID": "R1LG674GZ1MB2Z", "Overall": "5.0", "Content": "This camera is of excellent quality and price. Photography is my hobby and I love the way my photos turn out.", "Date": "September 5, 2013"}, {"Title": "Very good entry level camera", "Author": "Steve D. Kelley", "ReviewID": "R3BLHBFEAU2K7G", "Overall": "5.0", "Content": "I looked at the many true \"entry level\" cameras and compared the reviews. I was put off by the regularity of reported problems right out of the box, especially since this item was intended as a gift. I raised my sights slightly to the Olympus VR-370 and after receiving the camera I am glad that I did. I wish the information on cameras included the fact that none come with a memory card. I figured this out from other posted reviews. Overall, I am pleased with the quality and performance of the camera. I also found some accessories for it on Amazon at a much better value than ordering from the manufacturer.", "Date": "January 7, 2014"}, {"Title": "olympus vr-370", "Author": "duane layfield", "ReviewID": "RFJSM89LKVTEV", "Overall": "5.0", "Content": "FIrst or all, I purchased this camera for $79. during the cyber monday sells.  The pictures look good, quality of the picutures are about a 7.5 out of a ten. The vr-370 is light, medium compact. You can put it your pocket,if your not wearing tight jeans. video is good (720p)  if the subject is not moving at a high rate of speed. Has A rechargeable battery. Easy to use.  For a $79 point and shoot camera, its great.  down side- video isnt great at night and the flash takes a few seconds to recharge.", "Date": "January 7, 2014"}, {"Title": "Great Little Camera for those \"at Dinner\" shots", "Author": "Jim Starwood \"Knows a little about everything\"", "ReviewID": "R1XHRSNATS7T0Y", "Overall": "5.0", "Content": "I have an Olympus Pen - but the flash is crazy expensive; I also have a Canon Digital Rebel XT - too big for the pictures we take while having a birthday dinner, for example. This camera is just right; it gives me a lot of control (I might uses 4 of the scene settings, max) and had a flash, and gave me the general quality images to which I was used to with my other cameras. It's a little slow recharging the flash between shots, but if you're not shooting in machine-gun style it's not a problem. For the price, I think that I could not have done any better.", "Date": "January 19, 2014"}, {"Title": "Great little camera", "Author": "Ron C", "ReviewID": "RQ2HEIRMCR106", "Overall": "4.0", "Content": "I was looking for a camera I could use for birthdays and kids programs and things like that since a cell phone camera is convenient but not always the best quality.  After looking at many compact cameras I decided on this one because it had all of the features I wanted and was at a very reasonable price point.This camera has all of the features you would expect including lots of different automatic pre-defined settings and a ton of manual settings you can configure.  It takes great pictures and is exactly what I was looking for.The reason I am only giving it 4 stars is that it does have a fairly slow shutter response time for the first picture it takes and if you are tying to capture a fast moving subject like a baby that is constantly on the move then you may miss shots that other cameras with faster response times would catch.  Once it is focused on a subject and you have taken one shot there is a shorter delay and it becomes less of an issue on second or third shots of the same subject.  This initial delay is only a minimal issue for me but for some may be a deal breaker.The bottom line is this is a great camera with awesome features and the only drawback I have found so far is the slow initial shot shutter response.", "Date": "December 25, 2013"}, {"Title": "Great Camera", "Author": "Larry St. Germain", "ReviewID": "R1OV5ZPQHSW3X7", "Overall": "5.0", "Content": "One of the best point and shoot cameras on the market. Ease of operation and takes beautiful pictures with the high megapixels on the market.", "Date": "December 8, 2013"}, {"Title": "handy camera, easy to use, good value for the money", "Author": "Bernice W.", "ReviewID": "R3HGK88QKC9LS2", "Overall": "4.0", "Content": "Bought for my husband. He is quite pleased that it is more camera than it seems, easy to carry and operate under any conditions.", "Date": "August 17, 2013"}, {"Title": "Great Camera", "Author": "Carol Kelley \"Coralcarol\"", "ReviewID": "ROG0SOSIR7GS8", "Overall": "5.0", "Content": "I had purchased the much more expensive Olympus Pen on the advice of an Olympus Rep, but It was just too complex.  All I need it good shark close-ups to take pictures of jewelry items for E-Bay.  I do not take picture of people or anything else, and this camera is perfect for what I need.", "Date": "June 5, 2013"}, {"Title": "Premium Art Effect Camera for Point-and-Shoot Types for over $100", "Author": "Nicholas J. Cihlar", "ReviewID": "R2JR93F6RCF1QH", "Overall": "5.0", "Content": "This camera is very easy to use with instructions when needed.  It has ten art effects.  The VR-370 has an excellent lens with a great zoom with many other features.", "Date": "December 8, 2013"}, {"Title": "Great Little Camera", "Author": "Thomas", "ReviewID": "R19DBVRXQ47VAB", "Overall": "5.0", "Content": "I'm a pro photographer and I use this little pocket camera for carrying around when I,m not out shooting pictures on assignment.I have not had any problems with it.", "Date": "February 22, 2014"}, {"Title": "Very good camera", "Author": "The handsome cook", "ReviewID": "R2211MYD3X7UAH", "Overall": "4.0", "Content": "I had to return the camera to Olympus for repair when the zoom didn't work on the 1st day I tried it.  They fixed it and returned it in 3 weeks.  It works great now.  I love the 12 power zoom and the picture quality is great.  The menu works very well and is intuitive.  Has lots of features that I haven't tried yet.  So far I love it and the price is right.", "Date": "February 2, 2014"}, {"Title": "Easy to use camera that takes very nice pictures", "Author": "DJB", "ReviewID": "R1CWIYP75B4ZG9", "Overall": "4.0", "Content": "I bought this for my parents as a gift.I set it up for them and we took several indoor pictures.Menu is fairly simple,display screen large and bright,and many features.For the price it is one of the best cameraes i found.Zoom is enough for getting good pictures of people, animals and objects that are within 70 or 80 feet.Beyond that you would probably want more zoom.I was very happy with this camera and so are my parents.", "Date": "January 11, 2014"}, {"Title": "love it", "Author": "rich", "ReviewID": "R2GH28MVNUOMEU", "Overall": "5.0", "Content": "this camera is awesome !!!!!!!!!!!!!!!!!!! i got it for my wife for Christmas and now i want one for myself.", "Date": "November 24, 2013"}, {"Title": "wonderful little camera", "Author": "Michael Gabriel \"MG\"", "ReviewID": "R1SS0SPTS4HSXY", "Overall": "5.0", "Content": "I needed a light,  smaller camera to take with me when I'm not taking my Fujifilm X-S1.  This is a great camera, it is compact, has a lot of features and has a nice tele lens on it.  Highly recommend this camera.", "Date": "February 20, 2014"}, {"Title": "Great Camera for the Price", "Author": "Outdrdude", "ReviewID": "R3GZY1EOQ0IM66", "Overall": "5.0", "Content": "I bought this camera to take on a trip to Chicago and various hiking/backpacking excursions based on the positive reviews.  It is well built, feature loaded, and I had no problem figuring out the various menus.  The instructions that came with the camera however are very poor.  If you haven't had any experience with point and shoot cameras, with the many options they can have, I would not recommend leaving this in the package until the day before your trip.  If you spend a couple days getting to know it before you need it, it won't let you down.The battery life is great in my opinion.  One charge lasted me 6 days and hundreds of pictures. With still half battery life showing.  In low light settings I think any sub $100 dollar camera will work poorly unless you use the low light options.  After that it works amazing for what it is.  I was most concerned with processer speed and how long in-between I could take a picture.  Again I wasn't let down.  It is quick at storing a picture I took and I was ready to go again.  I played with the action menu and could take shot after shot with no turn around time.My only gripe is that the charge cord is proprietary.  NOT a normal micro-usb like most are today. However with a quick trip to a well knows auction site you can find an extra battery with wall charger and an extra charge/tranfer cord for next to nothing.Very pleased!", "Date": "April 14, 2014"}, {"Title": "Awesome little camera - easy to use", "Author": "Kelsey Swiger", "ReviewID": "R2304BDRY0URST", "Overall": "5.0", "Content": "I bought this camera as a Christmas present for my mom. She's gotten into flipping houses lately, and needed something to document her progress and just to have around for family events and all of her other activities. My mom isn't the MOST technologically savvy person in the world (authors note: I don't want to say she's terrible with technology but she is pretty terrible with technology), and even she can use this camera, easily! That includes dumping the photos onto her computer so that she can keep them organized as well (this is something that we've spent hours on the phone going over in the past, so this is pretty much a blessing for me).The picture quality is nice - I mean, don't be expecting DSLR quality from something that isn't a DSLR - but it gets the job done. It has a lot of different settings to optimize your photos for certain light conditions, but it's not as overwhelming as other pocket cameras are (my mom also can't see things up-close very well and refuses to get glasses, so the less buttons/knobs, the better!).Overally, I would recommend this camera for someone who isn't DEAD-SERIOUS about photography. It's a pretty standard point and shoot, and you can't get much better for the money. My mom really likes it, and I'm sure yours will, too! Or you know, you. Or whoever you're buying this for. I'm sure they won't be disappointed.", "Date": "April 10, 2014"}, {"Title": "great companion to my DSLR", "Author": "Dennis Brock Peace", "ReviewID": "R1VWA9KI6430BU", "Overall": "4.0", "Content": "I wanted a good point and shoot camera with a decent amount of optical zoom to drop in my pocket, instead of lugging around my DSLR all the time.  With 3 kids under the age of 9, keeping up with them carrying a big camera can be a hassle.  So far this camera has done exactly what I want.  Pictures way better than my camera, and  much lighter to carry than my other camera.", "Date": "March 26, 2014"}, {"Title": "Very good Specs", "Author": "Ray Ernest", "ReviewID": "RHRADL0MTGF9G", "Overall": "5.0", "Content": "This camera has very good quality zoom ( because is 12.5 optical zoom). They camera is slightly difficult to hold because of it's size. The only thing that I would change is to design it in a way so that has something better to grip. For larger hands a little difficult to hold. But other than that it is a very good value for the price. I am still learning about the many options that comes with this camera.", "Date": "March 1, 2014"}, {"Title": "Focus on Quality", "Author": "Antigone Walsh", "ReviewID": "R16FD5P29UY3ZH", "Overall": "5.0", "Content": "This is a terrific little camera. It is easy to set up and use and takes surprisingly good photos. The colors are vivid, even in low light settings. It has an admirable array of features for a point and shoot at this price point. Thus far I have been impressed with both the pictures and videos I've captured with this camera. Attractive in appearance, it is easy to slip in a pocket or purse.I appreciate the portability and versatility this camera offers. I have a Nikon DSLR which is great but unwieldy for spur of the moment use and travel. My previous point and shoot was a Kodak Easy Share that was unimpressive in all respects. If you are interested in an attractive, affordable point and shoot with excellent performance, this one will fit the bill. Recommended.", "Date": "February 18, 2014"}, {"Title": "Olympus VR-370 ... great", "Author": "Marilyn Griffin", "ReviewID": "R1NIZ11898APOK", "Overall": "5.0", "Content": "just as expected...great for the price...and for what I use it for!... Small and easy to take anywhere...in a pocket...purse... etc.... easy to download photos...", "Date": "February 16, 2014"}, {"Title": "Bought for my 9 year old daughter", "Author": "Kara K Steed", "ReviewID": "RIN9K0TU7ZD43", "Overall": "5.0", "Content": "My daughter loves this, and I am jealous. Its a little higher quality than my own camera thats a few years old, easy to use and a great quality product.", "Date": "January 10, 2014"}, {"Title": "easy to use", "Author": "coloradolarry \"larry\"", "ReviewID": "R2KYTOYBZ04DFY", "Overall": "5.0", "Content": "we chose this for our 8 year old granddaughter and she immediately loved it, and has no trouble navigating through the many features.  she carries it everywhere", "Date": "January 2, 2014"}, {"Title": "Olympus VR-370", "Author": "OCBOB", "ReviewID": "R3Q2QEP1FIWWVB", "Overall": "5.0", "Content": "As the camera was a gift to my wife, she found it easy to use with superb results. Very satisfied.", "Date": "December 28, 2013"}, {"Title": "camera works beautifully", "Author": "Mike", "ReviewID": "R1NU2XFHXO77S2", "Overall": "5.0", "Content": "This was a replacement for our other Olympus camera that we had for over 15 years, it works great and came in a couple of days", "Date": "October 23, 2013"}, {"Title": "Nice camera", "Author": "Chris", "ReviewID": "R3I5Z5F3759V6L", "Overall": "5.0", "Content": "I bought for a Christmas present for my son.  It was a big hit. Has a big screen all kinds of features.  works well", "Date": "December 30, 2013"}, {"Title": "Very Nice Camera", "Author": "J. Smith \"scientist\"", "ReviewID": "REQ3BO4UO8KEC", "Overall": "5.0", "Content": "I purchased this camera refurbished and have not been disappointed in its ability to take great pictures.  I would, however, recommend that you buy new as the refurbished camera did not come with a battery or ANY other item that typically comes with a new camera AND a new camera is only a few dollars more.", "Date": "June 2, 2014"}, {"Title": "3 Months Till Failure", "Author": "Timothy J. Ryan \"Drair\"", "ReviewID": "R27L31I0P3V6N8", "Overall": "3.0", "Content": "I really liked the wide angle lens on this camera and it has come in handy several times in museums, at work, and in general. Some of the special effects (sepia, line art, and panorama) are pretty cool, too. But after only 3 months, I turned it on, the lens extended and it shut off. End of story.  It's been sent back to the factory for a warranty repair or replacement.  If I think of it, I'll update this review once I hear back from Olympus.  This is my first Olympus digital camera (others were Nikons, a Sony, and Canons) so I have to say I'm not super impressed and worry that this same sort of defect will manifest itself again once it is out of warranty, in which case I'll have a shiny red paperweight.", "Date": "May 29, 2014"}, {"Title": "problem with usb port", "Author": "Sharon Spigelmyer", "ReviewID": "R2P3YD3HSWM2LF", "Overall": "2.0", "Content": "the camera seemed fine and took nice pictures but there was a faulty usb port right out of the box, had trouble get it to connect to the computer, I had to keep pushing the plug into the camera and moving it around to get it to connect.Returned the product and bought something else.", "Date": "May 22, 2014"}, {"Title": "Very good Camera", "Author": "Stanley Tesch", "ReviewID": "RW93WFVIB47D5", "Overall": "5.0", "Content": "took a lot of pictures on the outer banks.  Good inside and outside, and lots of features.  great for  the price", "Date": "May 15, 2014"}, {"Title": "Very happy with my reconditioned camera for the price ($50).", "Author": "E. Thompson", "ReviewID": "RMDLE1B77GXIA", "Overall": "5.0", "Content": "Camera arrived as advertised, which is to say like new with all the accessories and manual and disk. Plus a pretty nice leather case that I wasn't expecting. I wanted a small camera for travel and not a lot of money; happy with my purchase.", "Date": "May 14, 2014"}, {"Title": "Nice camera!", "Author": "warmhands", "ReviewID": "R3VOR8D560HTU2", "Overall": "4.0", "Content": "I choose  this camera for several reasons. I really liked my wife's VR, compact size, 12x zoom and Eye-fi capable. Also like the variety of scene selection modes. I am still learning to use these features.I would recommend this camera for those looking for compact camera with a high zoom.", "Date": "April 27, 2014"}, {"Title": "Son's camera for trip to England", "Author": "JSR", "ReviewID": "R1CHPAEO6O2CRF", "Overall": "5.0", "Content": "With this and a 16GB card, my son was well equipped for his trip to England.  I gave him a hard time about not taking enough pictures as he only filled up about 10% of the card.", "Date": "April 22, 2014"}, {"Title": "Seems good so far", "Author": "AbarSbieT", "ReviewID": "R11T5G0B13MNW9", "Overall": "4.0", "Content": "I am a basic camera user and purchased this camera for an upcoming vacation. So far, it seems to be all I need. I will have to play around with the menus and settings a bit and see how the macro works for wildflower close-ups.", "Date": "April 22, 2014"}, {"Title": "VR-370", "Author": "Hunter Fisher \"Pathfinder\"", "ReviewID": "RDBMS4WT9EH2X", "Overall": "5.0", "Content": "Nice little camera.  I am just getting used to it but am pleased so far.  It seems to do most everything I would expect from it.", "Date": "April 22, 2014"}, {"Title": "Excellent for the price!", "Author": "Jan Fran", "ReviewID": "R5X356LVSDHWO", "Overall": "5.0", "Content": "This is my first digital camera. I was worried that it may be to complicated. Not to worry. All the ratings I read prior to purchase says NO slideshow. My camera HAS slideshow. I called the tech people and he helped me with the movie setting. We set it it 30 minutes record time. I like this camera very much wish I would had gotten one sooner. Shipping was very fast also. Five stars!", "Date": "April 7, 2014"}, {"Title": "Olympus VR-370 16MP Digital Camera", "Author": "George G. Nolasco", "ReviewID": "R21A39ALAGKWN9", "Overall": "5.0", "Content": "I have other Olympus cameras at present and in the past.  This is a very handy camera, small but great at taking pictures, as far cry from my SLR very old camera but still serviceable.", "Date": "April 2, 2014"}, {"Title": "Decent Camera for the price....", "Author": "S. College \"Genny\"", "ReviewID": "R2RV1N6YGRT6B1", "Overall": "4.0", "Content": "Great looking camera, slightly large than the older model - and heavier. The red is beautiful. It is quite complex and you must read the instruction booklet thoroughly. It takes good quality photos. 'Love the zoom.", "Date": "April 2, 2014"}, {"Title": "great camera for the price", "Author": "DFar09 \"D\"", "ReviewID": "R201IY5VUEKBLK", "Overall": "5.0", "Content": "This is a good camera for the price.  It's your standard point and shoot camera.  there are alot of different settings and menu options which I have yet to explore, but I like it!", "Date": "March 27, 2014"}, {"Title": "Great little camera", "Author": "Shirley G. \"Geek\"", "ReviewID": "R1U84QIX8BTUIF", "Overall": "5.0", "Content": "This is a great little camera! It takes great pictures without changing the colors! My last camera always imparted an orange cast and that was regardless of the settings. This one is color true and for the price, you can't beat it!", "Date": "February 26, 2014"}, {"Title": "Olympus VR-370", "Author": "Boss", "ReviewID": "RALAR3I2HPCUZ", "Overall": "5.0", "Content": "This is a great camera.  Its better than what I expected.  The camera has many features that I'm still learning, but the pictures are turning out great.  Its easy to operate and will become better once I spend more time learning all the features it has to offer.  The supplier sent it out right away and I was pleasantly surprised when it was delivered earlier than expected.", "Date": "January 2, 2014"}, {"Title": "Really dark video and photo's", "Author": "Laura Coons", "ReviewID": "R1STBD8FAQGLBG", "Overall": "2.0", "Content": "I was so excited when buying this camera but felt frustrated instead. When using this camera on Christmas day all the photo's in any setting would turn out with a brown tint. We tested the camera in different situations and lighting and all the pictures turned out bad. We filmed a movie in the brightest room with white walls and the walls looked brown in the picture. I bought the camera based on specifications and reviews and am greatly dissapointed after using the camera.", "Date": "December 29, 2013"}, {"Title": "Gift to my grandaughter", "Author": "c niezgoda", "ReviewID": "R167QTLOK7VMSZ", "Overall": "5.0", "Content": "Christmas gift for my grandaughter hopefully I will find some pics in my e-mail. Mom is so busy she just does not have time. So I figured if I got this for a 12 year old she would love to send some to grandma, and help keep me in contact with her along the way.", "Date": "January 11, 2014"}, {"Title": "very poor . no idea how to unload pictures from camera to photo album computer .software is not simpil", "Author": "cliff garris", "ReviewID": "R36HGWM1QY90IP", "Overall": "1.0", "Content": "very poor. no idea how to unload from camera to put on computer ...software is not like old vr-350 unit.....not a happy personthank you hearing cgarris9@tampabay.rr.com  cliff garris", "Date": "May 14, 2014"}, {"Title": "Acceptable, easier to use than others", "Author": "jcpdx \"jcpdx\"", "ReviewID": "R2SJTG4VFGZXBI", "Overall": "3.0", "Content": "For 15 years I had a Casio Exslim (sp?) that I adored.  I wore it out and started searching.  This camera is easy to use, and has a long optical zoom for it's size, but I find it lacking in quality in auto-selecting the best exposure and macro mode.  It also has a long recovery period between shots, and especially when using the movie mode.  There is a Canon that is far superior (280) but it has a defect with the battery that is widely known and not yet fixed. It broke my heart to return it.  If they fix it, THAT is the compact camera to own.", "Date": "April 19, 2014"}, {"Title": "rather complicated for someone who doesnt under stand all the terms in the menu", "Author": "patricia  horan", "ReviewID": "R1DOXQHWALU2M1", "Overall": "3.0", "Content": "it is easier to see to take pictures than my older Olympus digital camera. Would like to have a printout to refer to . Price and features were good.", "Date": "January 28, 2014"}, {"Title": "Olympus Camera", "Author": "Camille Parra", "ReviewID": "R1SGT9KK2O9N5I", "Overall": "4.0", "Content": "Given as a gift.  Person is happy with features and just started using in the last few days, will give comments in time.", "Date": "January 17, 2014"}, {"Title": "Wife likes it", "Author": "Raymond B.", "ReviewID": "R3TF97TO7HHMW4", "Overall": "4.0", "Content": "I got this for my wife as a Christmas present.  She really likes it.  She really likes the color red so this was a plus.  So far it looks to be just what she wanted and needed.  It takes very good pictures and is relatively easy to use.  No problems with it at all.", "Date": "January 15, 2014"}, {"Title": "great", "Author": "Jan Garner", "ReviewID": "R2X1ZQX8CB7YXM", "Overall": "5.0", "Content": "I love my new camera.  It takes great pictures.  Now all I have to do is figure out all the neat things it can do.", "Date": "January 31, 2014"}, {"Title": "Returning this... Buying a Canon", "Author": "Gabby's Mom", "ReviewID": "R1ZASVY2VQODXW", "Overall": "1.0", "Content": "The zoom function does not work.  I am a true Canon lover and tried to buy a camera on the cheap for a trip to Disney, one that was compact but took high quality pictures. I use a DSLR so I certainly know how to work a camera and this zoom function does nothing.  Took a few pictures of different things, changed the functions and tried again, and it didnt focus on a single item.", "Date": "May 3, 2014"}, {"Title": "Below expectio", "Author": "Jennifer Zhang", "ReviewID": "R31N630QK6W65P", "Overall": "2.0", "Content": "One thing I would to mention is that on all pictures taken with this camera, this is a visible line. The line comes across from top to bottom of a pictures, about 1/3 from the right edge. This really makes the camera undesirable and I had to return it.", "Date": "April 20, 2014"}], "ProductInfo": {"Price": "$129.99", "Features": "Pocket Sized 12.5X Optical Zoom with 24mm Ultra Wide-Angle Zoom Lens (24-300mm)\n16 Megapixels, HD video\n3.0\" High-Resolution LCD", "Name": "Olympus VR-370 16MP Digital Camera with 3-Inch LCD (Silver)", "ImgURL": "http://ecx.images-amazon.com/images/I/41fWL-1cgfL._SX300_.jpg", "ProductID": "B00B46XLTG"}}