{"Reviews": [{"Title": "Canon does it again...amazing", "Author": "isableandaking", "ReviewID": "R3GOM9AZ86A60U", "Overall": "5.0", "Content": "What a nice kit - $350 for it all, just $20 more than the black version. I do like this white version better - it's slick. I would almost think that apple designed this camera.I read a bunch of reviews before taking the plunge and most of them just bashed on it's auto focus speed. Then everybody agreed that the new firmware made it so much better. Well I was skeptical about the AF issues, couldn't be that bad, must be DSLR owners bashing a camera that's more for the point and shoot crowd. I was mostly right - it's not a big deal, with this update it's perfectly acceptable. You shouldn't be using the most complex algorithm for focusing in night scenes either way - it's just not the smart way to go. And yes the competitors probably fair better, but this is/WAS it's only issue. The price is amazing for such a feature rich camera that is so small too - it is heavy though, one wouldn't think that when looking at the small slick metally white body. For me that's a plus, won't make me forget I am holding it and throw it/bump it by mistake.It shoots some great photos in low light conditions - NO FLASH necessary. I was surprised it was able to capture such magnificent pictures at night, in near dark conditions. It's got a fancy night scenery mode that helps a lot in such cases too. The size of the sensor is probably the real reason though.The battery is not the greatest though, you might need to order some extra ones. With a 16gb sd card it can shoot 480 Raw + Large JPEG pics, but the battery probably won't last that long, more like 160 shots - but I am still playing around with it.Very happy with my first mirror-less camera, I never liked the bulkiness of DSLRs, just too much to carry around. I bet the next version will be even better - I just hope it's price is as good too.", "Date": "November 11, 2013"}], "ProductInfo": {"Price": "Unavailable", "Features": "18.0 MP CMOS (APS-C) Sensor\nDIGIC 5 Image Processor\nFull HD 1080p Movie with Focus Tracking\n3.0\" Touch Screen LCD with 1040K-dots\nTouch AF and Multi-touch Operation\nHybrid CMOS Auto-focus for Photo & Video\nISO 100-12800, Expandable to 25600 (H)\nScene Intelligent Auto\nIncludes EF-M 18-55mm f/3.5-5.6 Lens", "Name": "Canon EOS-M Mirrorless Digital Camera with EF-M 18-55mm f/3.5-5.6 IS STM Lens (White)", "ImgURL": "http://ecx.images-amazon.com/images/I/51uYTb4ebyL._SY300_.jpg", "ProductID": "B00B5FO0BE"}}