{"Reviews": [{"Title": "Good Camera, But Not Great", "Author": "NatNapoletano", "ReviewID": "R25PO85OWZX8RH", "Overall": "4.0", "Content": "Review of Nikon Coolpix P520 by Nat NapoletanoEverything is relative so I will be comparing Nikon's Coolpix P250 to its main competitor the Canon SX50 (they sell for the same price).WHAT NIKON DID RIGHT:Under ideal conditions, the 18.1 megapixel Nikon creates images with higher resolution than the Canon. My images shot at a resolution chart showed that the Nikon had a real resolution of about 12 megapixels (18.1 advertized) and the cannon resolved about 9 megapixels (12 advertized). But under actual conditions, in daylight, they both perform about the same because the Canon has a much better lens. When zoomed or at in high contrast situations, the Nikon makes larger files that are not as clear and sharp as the Canon and have some purple fringing around the edges when blown up.The image sensor in the Nikon is a newer technology and really does perform much better in low light.Nikon has a timer feature that I have found on no other camera. You can set it up to start snapping pictures every 30 seconds, or 1 minute or 5 minutes. This is very cool, you can set it on a tripod and take nature shots all night waiting for a deer to come eat your corn, or you can put together a time laps movie from the frames, or set it up to catch violators in the act. The possibilities are huge! Other cameras, including the Canon, won't do this. (and it would have been so easy in their software)The viewing screen is big and bright. The best I've seen and much better than the Canon.Nikon has a built in GPS. I didn't test it; I'll never use it. Canon doesn't have this feature.WHAT NIKON DID WRONG:The Nikon has focus problems when using the self timer and in movie mode. If you start the movie recording, and then step in front of the camera, it mostly focuses on the back wall and your face is fuzzy. The camera never seems to recover. This is very bad (come on Nikon). I have tried every combination of focus modes. Face detect doesn't seem to work after the movie is recording. I never had a camera this bad. You are forced to use manual focus. This problem does not affect traditional movie recording, focus works fine when you are behind the camera shooting a subject in front of you.In order to use Nikon's electronic viewfinder, you need to fold and tuck the flip out screen. This is a big nuisance on a sunny day going back and forth. Every other camera in the world changes displays using the display button; the Canon does. (and it would have been so easy to implement in Nikon's software, the button is already there)The Nikon camera feels cheap. The lens rattles (but doesn't exhibit any problems) and the flip screen doesn't lock in place. The Canon feels solid as a rock.The charging system that ships with the Nikon uses a cable that charges the battery in the camera. This is a nuisance and I don't need another charging unit with a cord to get tangled in the drawer. So you have to fork out another $30 or$ 40 for a charger and spare battery. The Canon ships with a nice charger that plugs into the wall and holds the battery.All outdoor images are slightly overexposed. This can be corrected by bumping down the aperture 2 stops when shooting, but what was Nikon thinking. The Canon is right on the mark.WHAT CANON DID RIGHT:The Canon super zoom is much more powerful, 50X vs 42X. The Canon lens is truly remarkable. You can photograph the moons of Jupiter on a clear night. I tested it next to the Nikon on distant road signs and you could read text from a mile away using the Canon. There was no comparison. The Nikon doesn't have the range and the image was a little fuzzy at the longest extent compared Canon's superior optics.", "Date": "April 19, 2013"}, {"Title": "Pretty good but not 'great'. 24mm-1,000mm lens, Wi-Fi & GPS but no RAW.", "Author": "D. Graves \"Fine Books and More\"", "ReviewID": "RV2240X5XC0G4", "Overall": "3.0", "Content": "For the price, this is a good camera. Not a \"great\" camera, but a fairly good one. I would consider it high end for the average consumer, with features superior to other point-and-shoots in its price range: Wi-fi capable (ability to connect to iOS and Android devices for viewing/sharing your photos and videos via the optional WU-1a adapter), built-in GPS (to geotag your photos), 18MP CMOS sensor, a zoom lens with incredible focal range (24mm-1,000mm), and 1080 HD video. For the price, that's a nice set-up, a camera with advanced features with a decent ease-of-use, requiring little knowledge of photographic techniques.Many of us, however, want to go beyond 'picture-taking' and seek an advanced camera that is not in an advanced price range. And this is where the P520 is attractive but, ultimately, falls a bit short of our desires. For example, there's no RAW: your images are captured in JPEG only. There's a decent pop-up flash but no hot shoe. Also, the impressive zoom is not so impressive with regard to its speed, either its lens speed (f/3.0-5.9) or autofocus speed (fairly slow but not quite horrible). However, it is a nice, glass, Nikkor lens; and, to be fair, it would be quite a feat to bring such a long zoom well under f/3, given the price range. Personally, I would have traded focal length for speed: yes, it's impressive to go out to 1000mm, but I would have taken 800mm with an f/2.8-5.0 lens; though Nikon has built-in stabilization features for both photos and video (called 'Active VR mode' for video), you're not going to do hand-held shots at that 1000mm focal length, especially video.Other aspects of the camera will please everyone: full manual exposure control along with multiple auto/semi-auto exposure modes, a nice and large tilting Vari-Angle LCD monitor, an excellent CMOS sensor (1/2.3 in.), and a nice weight and feel to the body. This last point is what drew me to the 520 in the first place: I just bought a P310 and although I love it, especially for its small size and portability (shirt pocket), I cannot get used to shooting outdoors with such a small camera. The 520 is just perfect; that solid DSLR feel but with a modest weight (20 ounces).Yes, I wish the P520 had a few more pro-like features and wasn't so extreme in its focal length, but this is a very good camera overall. I'm giving it 3 stars for the reasons stated above. However, if you're someone not interested in advanced photography and just want a very nice camera with higher-end consumer features, this is a borderline 4-star camera and not bad for the price.", "Date": "February 25, 2013"}, {"Title": "Nikon P520 Coolpix Camera Dark Gray body (or silver to some)", "Author": "E. Simonson", "ReviewID": "R2O3QX9JESNMG", "Overall": "5.0", "Content": "Did a lot of research and read reviews as well as YouTube about this camera. Mostly very good comments.Now that I have used this camera for a couple weeks I can say that I made a good decision in purchasing it.I get all the manual control that I had on my old SLR camera,but with this camera it is a lot easier to use and do the the manual settings that I like.One feature I wished it had is Stop Down Metering, I have found no camera of this type that offers this feature either so I didn't mark it down for this.My pictures are very good and the video (which was not the reason I bought this camera) works great even at max zoom of 1000mm which allowed me to get fantastic videos at a recent outdoor concert, as long as I had good lighting the focusing worked great and was pretty fast.The zoom works good and very smooth, the VR (Vibration Reduction) works way better than I imagined at the long Zoom range.I have read some folks wished there was a button to switch between the EVF and the main viewing screen but I like the fact that when I fold the large view screen flat in it's storage area the EVF comes on automatically and when I unfold the large viewing screen it comes on automatically so I have no extra buttons to push.I was concerned about the focusing of this camera as some have mentioned in that it sometimes will not focus sharply.Now that I have this camera and am using it I have found that if I press down the shutter quickly I will sometimes get out of focus photos, but when I press the shutter button part way down (or maybe slowly) the camera has more time to get the correct focus?I have found this seems to be the best method for sharp photos and I have not had any problems since.The Nikon P520 menu system only took me about an hour to make all the settings that I prefer to use which I felt was very easy.Most of all I really like the looks of this camera, it feels great in my hands, very comfortable and not too heavy.The battery last longer than what I was expecting even with using fill flash for many of my sunny outdoor photos, so I can't complain about the battery life.Comes with everything needed to copy photos from the camera to the PC and charging the battery.Same cord that I use to charge the camera battery also copies the photos to the PC as you can remove the AC connector and use the USB end to connect to the PC.The only gripe I have is that there are no threads in the lens barrel to attach a filter to protect the lens glass, for a camera of this type that should be a no brainer.I have ordered a slip on adapter kit for this camera that is threaded at one end for adding filters (the kit also comes with 3 filters), I will see how this works and report on this later.All in all I am enjoying taking photos with this camera, I find myself looking for any reason to go out picture taking, this camera is really fun and I highly recommend it. The price was very fair on Amazon.UPDATE ON THE LENS ADAPTER.I received the lens adapter with 3 filters and one of them being a polarizing filter.The adapter is a hard plastic and slips over the outside of the camera lens barrel, fits nice and tight.There is a small recess in the adapter so that it will only let you push the adapter on to the camera lens just a 1/4 inch so this is really nice and very easy to put on the camera lens, feels very snug and firm.The adapter is threaded on one end where you would screw on the filters, this feels really secure and works well.So I can say that I'm very happy with the lens adapter and the filters it comes with. So far so good.", "Date": "August 20, 2013"}, {"Title": "Review for the Average Camera buyer without all the Bells & Whistles", "Author": "Brad", "ReviewID": "RJFP0EJ5QTOFK", "Overall": "5.0", "Content": "Ill start by saying I really dont know much about Cameras. Im just the average Husband whos Wife has been saying for the last couple years that she would love a new Camera. So this Christmas Ive decided to take the jump and buy her this Nikon P520. Now I sat here like most of you are doing reading reviews and after about an hour I realized I still didnt know anything. It seems like a good Camera but then there are the bad reviews also. So I decided to contact an Old Friend that I hadnt spoken to in years who actually is a pretty well knowledged person at one of the Top Camera Companies that you see all the time. After sending him the link to this camera we went back and forth and he explained  all the bells and whistles that this Camera had and also explained the pros and cons. What I came to realize after a couple days and alot of emails was I still really didnt know much about this Camera. So I left him with 2 last questions. 1) Is this Camera worth the money and 2) Is this Camera a Camera that you yourself with all your Camera Knowledge would actually purchase and enjoy. His answer to both of those questions was a very strong YES. Now thats what I needed. I just wanted to hear from someone who knew all the bells and whistles that it would be a Camera he would trust to take the pictures of his life. So I bought this Camera and without going on and on anymore then I already have I can tell you it was the best decision Ive made in a long time. Of course I gave it to her early so by Christmas we would know what we were doing. The pictures are Vivid and Vibrant. 2 words Ive never used in my life. Its easy enough to use for a guy like me but at the same time is capable of keeping the avid photographer happy with all the things its capable of doing. So after all this I would say yes, buy this Camera. We havent had one issue with it at all and it really seems like we made a good choice. Hope this helps the average Camera Buyer a little more then all the other head spinning reviews I sat and read for Hours.", "Date": "December 9, 2013"}, {"Title": "Great Trade Off", "Author": "P. Petrasek \"The Rev Photos\"", "ReviewID": "R1NYQIVPLY912V", "Overall": "5.0", "Content": "I use both a Nikon D80 and a D3, as well as a Nikon FE (film). But, when I go on trips and I am concerned about getting a picture quick I only take my Coolpix P520. The controls and capabilities on this camera have produced some marvelous pictures. And, rather than trying to figure which lens to use and changing out lens, I am able to take the fleeting picture. Sure the Coolpix P520 isn't my Nikon D3. But, it certainly does take some very pleasing pictures. In fact,one of my pictures taken by the Coolpix P520 that was posted on line was even chosen as a \"favorite\" by a professional photographer. To say the least he was quite surprised when he noticed what camera I used. Sure the Coolpix P520 has its limits when you compare it to a DSLR like my D3. But, as is said: \"There is a time and place for everything\" - even in photography.", "Date": "June 9, 2013"}, {"Title": "Great Camera", "Author": "JB", "ReviewID": "R3SM5564K0O230", "Overall": "5.0", "Content": "Took this camera to Europe and it did an awesome job.  Took pictures in low light in cathedrals and at night and all turned out well.  Daytime pictures could be controlled with manual exposures, etc.  The close ups were sharp and clear despite some shakiness on my part.  The battery lasted a day and I was impressed that the camera would go into standby mode or turn itself off if not being used.  Love everything about this camera!", "Date": "July 8, 2013"}, {"Title": "Not so good...", "Author": "Forest7", "ReviewID": "R23CRDZK2INROA", "Overall": "3.0", "Content": "The Nikon COOLPIX P520 looks like a great camera, and based on the reviews I decided to buy it. It did not take perfectly clear pictures but the camera was complex enough that I thought that it was my problem.  I bought the Photographer's Guide to the Nikon Coolpix P520 by Alexander S. White and I would recommend it as useful to anyone who buys this camera.However, even after working with the manual, trying different settings, autofocus, program, different focus patterns, manual focus, etc. the camera still did not take crisp, clear pictures. It was a disappointment. I did note though that the video camera function seemed to work quite well and actually focus better than the still picture mode.I was able to use a software program and sharpen the pictures and improve them, but they still were not crystal clear.  I compared them to an older Fuji Finepix that I have that is 6MP and has a total 19X zoom. Most of the time whatever it can physically include in its field it can take pictures of clearly.  And the macro is very good, better than this Nikon 520.  Speaking of the 18.1 MP rating of the Nikon, I have found that 6MP make very clear prints on an 8 1/2 x 11 sheet of photography paper and don't see the need for such high MP values.I'm not saying I'm the final word on this camera. There are many that like this camera, and have had success with it.  I returned mine and wanted to share this experience since others' reviews have been useful to me.", "Date": "August 12, 2013"}, {"Title": "Software V1.0 -- Not ready for prime time: Fuzzy focus, short battery life, frequent lockups!", "Author": "J. Ware \"Green Man\"", "ReviewID": "R1QW5G9LR01JTY", "Overall": "1.0", "Content": "My Nikon P520, Firmware Version 1.0, will be returned for credit first thing in the morning --After shooting over 1,500 images, I have had it with this camera!I have owned several other Nikon and Kodak digital cameras that worked much better than this one...What Nikon did well on the P520:Low-light performance.What Nikon needs to work on IMMEDIATELY:Autofocus: Often fuzzy, almost always slow, somewhat unpredictable, sometimes balky.Frequent Software Lockups: The P520 will lock up frequently when in use, often when \"just sitting\" there between shots.  In these situations, no combination of controls including Power On/Off will unlock -- you must open the battery door, and physically remove and replace the battery.Short Battery Life: The P520 will unpredictably, and very quickly, run out of power; and IT CANNOT BE RECHARGED WHILE POWERED ON.  This means that any sort of time-lapse photography is out of the question. Nikon must come up with better power-management software, and/or higher-capacity batteries -- and provide for live charging.Ergonomics: The method of switching display between the LED and the eyepiece is clumsy at best.The menus are also seriously in need of work!Outdoor overexposure: The P520 does not handle daylight well, and even with flash does not handle backlit scenes as well as my other Nikons, or Kodaks.The GPS: Software is flaky and hard to manage -- this feature set must be reworked.Will I try another Nikon soon?I suppose so -- but this one really leaves me wondering if the Nikon people care about the quality of their software!Come on Nikon, step up to making a quality product before you release it to the consumers!", "Date": "August 17, 2013"}, {"Title": "Very nice camera, takes great pictures", "Author": "L. Hinrichsen", "ReviewID": "R2CXVFDBMOEPGW", "Overall": "5.0", "Content": "This camera has been perfect for me. I'm just an everyday user and the camera is easy to figure out, and takes good quality zoom pictures.The camera is lightweight. The zoom lens is integrated, unlike the DSLRs that have removable, heavy, lenses. This also means there's less chance of dirt or moisture getting in there. The lens is versatile and I'm loving the 42x zoom.I like that you can flip and tilt the LCD viewing screen. You can flip the screen out and turn it all the way around so the person being videotaped can see themselves.  You can also hold the camera high above your head, or way off to the side, and tilt the screen so you can still see the subject of your photo/video. I like that you can fully close the LCD facing the camera to protect it, or close and keep the LCD facing outwards - whatever your preference. I put a clear protective film on my LCD screen.I didn't realize the camera doesn't come with a battery charger! Duh! You have to plug the camera into an outlet to charge the battery inside. Make sure you buy a charger with at least a couple of extra batteries.I was very confused that this and other comparable cameras didn't have Image Stabilization, especially with such a powerful zoom lens. I finally figured out that this camera has something called \"VR\" Vibration Reduction) which seems to be the same thing.I love the red color. It's beautiful.", "Date": "July 20, 2013"}, {"Title": "Nikon wasn't even on the Radar until.....", "Author": "M. Sims \"m.sims\"", "ReviewID": "R1VVDEL2NV0XTF", "Overall": "4.0", "Content": "I was in the market for a new digital camera and started out looking at entry level SLR's but after reading great reviews about the Canon Rebel T3i, I got to thinking about searching for camera that have some of the benefits but that are present in a mega zoom camera.  My last three camera's are all Panasonic Lumix's and I was looking there but did not see the sense in going from a 20 optical zoom to a 24.  So I narrowed it down to the Canon Sx50 based on reviews and youtube videos.Well after doing my diligent research on the web, starting here of course, I always go into local stores and test drive these babies to see how I feel about it, and although the Canon is a great camera, it's not like I really needed a new camera, I just wanted one.  I stumbled into HHGregg and while looking, I noticed the Nikon and thought.... thats a real low price for that type of camera.It looks a lot like the Canon with the pivoting swing out LCD screen but it was priced like $160 less than it sells for. Someone had mis-priced it on the floor.  I had not heard of the camera before and knew nothing about it.  So once the manager agreed to sell it to me for the incorrect price, I got comfortable, whipped out my cell phone and came here and started reading reviews.  YES, I still needed to do my research.  I purchased the camera!  Here is my take after having it for a couple of days:Pros:- Great pics- Has wi-fi enabled feature (that's next for me to try out once I get the adapter) It only works on Apple and Android phones I have read.- Has GPS (although I opted not to turn that on to save battery life, but I guess I should test it)- Great feel with the rubber handle grip.  I found it very sturdy.- I love the LCD flip out monitor.  You can do so many things with it, and it's only available in a few models in this price range.- Similar to the Canon Sx50 but cheaperCons:- It is not a out the box point n shoot camera.  I had to tweak it in the \"P\" mode and selected AF-F (Full-time AF) to get clearer pics on zoom (Thx for great customer service Nikon)- It makes more noise when engaging the zoom than I like.  I was told by CS to return it for an exchange and I plan to do that tomorrow.  However, I'm not sure if this is just the way they are. Will see....- It is not a clear shot camera, you will need to wait a sec for it to autofocus which can cost you quick shots in a pinch or pics maybe being fuzzy.That being said, it is still a great camera, especially since I got it new at such a reduced amount due to in-store pricing error.  I didn't want to pay the $450 in the store for the Canon and with the mispriced Nikon since I did not have to.  It does not have the same extended zoom as the Canon camera but long is never enough, if you can get longer I guess.  (Amazon.com sells the Canon for $369 right now. )I've taken some really awesome pics both indoors and outside, but price being equal, I would suggest the Canon Sx50 at $369 here on Amazon because I think it takes better pics without the tinkering and has more versatility with a better zoom,( has a horse shoe and it takes pics in Raw. Not that I would actually use those features).Finally, shop around if paying more is going bug you when you find out later.  Right now here on Amazon the Nikon sells for $376.P.S. I don't know if anyone has tried the Eye-Fi wireless sd cards, this might work in the Canon, which would bridge that whole wireless feature gap.SD Card Tip: if you have a SD card laying around the house, do yourself a favor and Format it before you use it. When I put my old SanDiskHC 4 GB size card into the Nikon it showed that I only could take 91 pics before formatting, then after formatting it, it went up to like 3,000 or something. LolThese are the SD cards Nikon recommends  SD memory card---  SDHC memory card 2---  SDXC memory card 3 SanDisk  2 GB 1  /4 GB, 8 GB, 16 GB, 32 GB  /64 GB, 128 GB TOSHIBA  2 GB 1  /4 GB, 8 GB, 16 GB, 32 GB  /64 GB Panasonic  /2 GB 1  4 GB, 8 GB,16  /GB, 32 GB  64 GB Lexar  --  /4 GB, 8 GB, 16 GB, 32 GB  /64GB, 128GB", "Date": "September 25, 2013"}, {"Title": "it's awesome", "Author": "David", "ReviewID": "RGUNGD784DHZG", "Overall": "5.0", "Content": "This is really the first good camera I have owned.  I usually just use my iphone to take picture but I decided to invest in a better camera and I am very happy with my purchase.  I also bought 4 extra batteries and a 32gb sdhc card which allows me to take about 3400 pictures on highest quality (the file size for each image is about 7 MB).  Each battery only lasts about 200 pictures so make sure you get extras if you plan on taking extended photography trips.", "Date": "February 25, 2013"}, {"Title": "Great camera, right size, amazing zoom, very high quality photos", "Author": "Network Pro \"cubanomx\"", "ReviewID": "R1IY4AKNBZG410", "Overall": "5.0", "Content": "In my recent trip to New York I purchase this camera at BestBuy. I was unable to get this model in Amazon due to business trip timelines, but I want to share some info about this camera.Initially, the camera looks pretty solid, the hand grip is very good. The lcd display is definitely super high quality. One of the best features of this camera is the amazing 42x optical zoom and the full hd video quality! I have some real cool videos of Time Square at night and really really looks amazing!I take some photos using the zoom and the auto mode in central park, so I invite you to look in the sample photos section.with 18.1 megapixels and cmos sensor, you cannot go wrong. Please don't go for the coolpix l820 model, this is just better! The lcd screen have vari-angle so you can move it and rotate to take even better angle pictures!I don't use the GPS feature but is a cool one for the travelers to create point of views and save gps information on the photos. I purchased an extra battery and extra memory card (8 and 16GB) because the camera only have 16MB internal. I love this camera, is not a professional unit but is a really good device. Recommend it!", "Date": "October 30, 2013"}, {"Title": "The best compact camera I have ever used ...or seen!", "Author": "C. F. Poza", "ReviewID": "R7JASTQFYSN99", "Overall": "5.0", "Content": "The first trip out was to Mount Rushmore. I was able to take close-ups of Washington's lapels, Jefferson's nose, Teddy's spectacles and Lincoln's beard from the amphitheater with 18 MP. This is an outstanding small camera with more quality and versatility than most. You can pack it anywhere, use it anywhere and get outstanding results on pretty much any task.I am very happy with this purchase and I plan to take the Nikon P 520 on every trip on my schedule. I am not the one to talk technical details, but for all amateurs like me, who like good shots of beautiful and/or interesting subjects by having the right  equipment to honor what we see in the way we wish to frame it, this is a top rated choice. No excuses or exceptions.", "Date": "July 6, 2013"}, {"Title": "takes great shots INDOORS.....and out!", "Author": "Bonnie Quinn", "ReviewID": "RGVE739WDSOYR", "Overall": "5.0", "Content": "many months i have searched for a camera that takes quality photos in my somewhat dark home.  saw this bridge camera at target for only one dollar more than amazon and (after returning 3) tried it, realizing the reviews weren't that great.I LOVE THIS THING!!!my canon rebel t3i was \"busy\" most of the time, so not many shots.  my pentax k-30 was color blind!  neither would shoot in total darkness.most of my pics are taken inside or backyard at night around a fire with family/friends.  don't care much about video, but my short test video seems to work well.zoom fully extended, stills are very clear with no tripod. i don't wait to focus, just point and shoot.  this camera isn't slow, although i am no expert in that area.  had an old kodak slr, and it finally died.  there is much to learn on my new one.  right now i use auto mode changing scenes and using flash as needed.  i am getting good shots!there is no button to transfer from lcd monitor to viewfinder.  that's ok as i usually use the small viewfinder anyway.  and i don't fully open the monitor when needed, just flip it out to the side so it's faster to close.that's it.  for me, it's a very good camera.", "Date": "June 21, 2013"}, {"Title": "This is a very impressive camera", "Author": "Old Marine \"old_marine\"", "ReviewID": "R2YVTFZ3050YU6", "Overall": "5.0", "Content": "Let me start off by saying that I own a Nikon D-800, an 800E, and an F6 for taking B&W; film photos.  For the money, the P520 may be the best bargain in the history of photography.  The software flexibility relative to exposure and modes is amazing.  How many cameras under $500 allow you to shoot in B&W; or sepia, (cyanotone as well), offer a 24-1000mm zoom capability, and offer RYG or O filtering in monochrome mode?  When you consider A, S, P, M or full automatic exposure modes and 18.2 Meg resolution, this camera is incredible for the price.  Only negative is a GPS receiver in place of a hot shoe, but for some reason Nikon thinks that everyone in the world wants to record Lat/Lon on every photo they take,  Please produce a 530 with every feature of the 520, but do away with the GPS and include a hot shoe.", "Date": "June 15, 2013"}, {"Title": "still getting used to it - but has potential", "Author": "Sherry K. Kuhl \"Loves to Read\"", "ReviewID": "R3OAEP8MTF0B1P", "Overall": "4.0", "Content": "This camera is way cool to look at.  Ok, looks aside, I'm still trying to get used to some of the features of this camera.  In comparison to my comparable canon, there are some pros and some cons.  The pros: reaction.  This camera has a great reaction.  When you press the button to take your picture, it has a smooth and quick depression and you can really quickly take several pictures in a short amount of time with little effort.  I also like the transition between the viewfinder and the LCD display, it's quick and easy and converts from one to the other fast.  This camera also has a slightly better (more powerful) zoom than my other auto zoom camera and it seems so far that the stabilization is a little better, too.  Cons:  some of the features are a little confusing to go between, focusing is not quite as easy with this camera as with my Canon and while I think I have something in focus when I look at the picture, it's not.  That may simply be an adjustment that I still have to make to the camera, but out of the box it seems a littler harder to get the focus right with this one than with the other one.  This camera also goes to sleep or blanks out after a very short time of no activity; so if you have zoomed out and are waiting for, say, a fawn to get in range for a shot, be wary - the camera will blank out on you after about 20 seconds and you will have to \"wake\" it back up again.  Hopefully you didn't miss your shot in that process.  My other camera does this as well, but I don't believe the time is as short as with this one.", "Date": "July 23, 2013"}, {"Title": "P520 -Focus not great", "Author": "Carriec", "ReviewID": "R23T0GUPWPFQGU", "Overall": "3.0", "Content": "After using my Nikon P520 for two months now, with light usage, I must say I am disppointed in the lack of good, crisp images. The autofocus is just not very accurate, and 80% of the time the images come out just a tiny bit off. Things improve a little when I select the shutter speed priority button -\"S\". Am seriously considering returning it, to get a true single lens reflex, a camera with a sharp sensor. Bottom line: Very mediocre camera.", "Date": "June 27, 2013"}, {"Title": "Very Pleased!", "Author": "ashley hall", "ReviewID": "R1UDR9GWIV4LBA", "Overall": "5.0", "Content": "The camera takes GREAT pictures, and the zoom is amazing! I am not a professional by any means, but I enjoy taking photos, and with this camera its so easy to do! I would defiantly recommend it to anyone!!", "Date": "October 30, 2013"}, {"Title": "I feel like a pro. Takes all the guess work out for a novice!", "Author": "Brett Allan Stroud", "ReviewID": "R3EQGVP37G7WAG", "Overall": "5.0", "Content": "GREAT CAMERA - good pictures and video - everything I was looking for. The Zoom is also outstanding.CONS - The camera does not fit in the case that came with it. It has accessorie pockets that look like it could hold all your stuff until you place it or accually cram it in the case. But it is just a camera case and the camera is awesome. Just get another case. Completely satisfied.", "Date": "November 18, 2013"}, {"Title": "Hoping for more....", "Author": "Allison J Row", "ReviewID": "R1ECBC3B8QA48Q", "Overall": "4.0", "Content": "It could very well be me not having a chance to really understand the camera yet.  I am coming from a Cannon that shoots super fast....this just did not do that for me.  HOWEVER, I really liked having it and using for our vacation shots in NYC. I just will not be using it for my kids sporting events.", "Date": "July 30, 2013"}, {"Title": "Love this camera. It's easy to use even for a beginner!", "Author": "Amazon Customer", "ReviewID": "R1V0BV8NC4ZPT9", "Overall": "5.0", "Content": "This is a great camera. I love the features and it's very easy to use. The zoom is incredible and the picture quality is great! Also it has allot of pre set picture settings to. You can't go wrong with this camera. Great job!", "Date": "July 11, 2013"}, {"Title": "awesome", "Author": "Andy A.", "ReviewID": "RTMNZPL9UAAW0", "Overall": "5.0", "Content": "I love this camera, this is my first high end camera and I have learned so much on photography and taking pictures. the adjustable lcd is a very good feature to use for good angles.", "Date": "August 10, 2013"}, {"Title": "Comparison: Panasonic FZ70 vs Canon SX50", "Author": "Kimberly R. Norton", "ReviewID": "R3KYXZCOY4U8YL", "Overall": "5.0", "Content": "<!--\n\nfunction fp_resizePlayerSpace(nsPrefix,w,h)\n{\t\n  try {\t\n    var ifrm = parent.document.getElementById(nsPrefix + \"movieFrameID\");\n    if (ifrm) {\t\n        var h2 = h + 35;\n        ifrm.style.height = h2;\n      }\n    } catch(err) {\n \n    } \n\n\n  if (h > 0) {\n      document.getElementById(nsPrefix + \"clipDiv\").style.height=h+\"px\";\n      document.getElementById(nsPrefix + \"videoPlaceholder\").style.height=h+\"px\";\n  }\n  else {\n      document.getElementById(nsPrefix + \"clipDiv\").style.height=\"\";\n      document.getElementById(nsPrefix + \"videoPlaceholder\").style.height=\"\";\n  }\n  document.getElementById(nsPrefix + \"flashcontent\").style.height=\"100%\";\n}\n\nfunction fp_rewriteDiv(nsPrefix,divName,html)\n{\t\n    document.getElementById(nsPrefix + divName).innerHTML=html;\n}\n\nfunction embeddingPopup(nsPrefix)\n{\n  alert(\"placeholder function for embedding code\");\n}\n-->\n\n\n<!--\n\nfunction cv_mo1Y0NE415QAI58embeddingPopup(){\t\nalert(\"Embedding code will be displayed here.\");\n}\n\n-->\n\n\n\n\n\n\n\n\n\n<!--\nfunction cv_mo1Y0NE415QAI58refresh_preplay() {\n\ndocument.getElementById(\"cv_mo1Y0NE415QAI58chiDiv\").innerHTML = document.getElementById(\"cv_mo1Y0NE415QAI58hiddenPre\").innerHTML;\n};\ncv_mo1Y0NE415QAI58refresh_preplay();\n\n-->\n\n\n\n\n\n\n        // <![CDATA[\n\nvar cv_mo1Y0NE415QAI58so;\t   \n\n\nfunction cv_mo1Y0NE415QAI58loadSwf_Core(swfLocation, swfWidth, swfHeight, flashVersion, bgColor, swfParams, flashParams, embedAttributes) {\n\n  try {\n      cv_mo1Y0NE415QAI58so = new SWFObject(swfLocation, \"cv_mo1Y0NE415QAI58AMPlayerProd\", swfWidth, swfHeight, flashVersion, bgColor);\t   \n\n      for (var v in swfParams) {\n        cv_mo1Y0NE415QAI58so.addVariable(v, encodeURIComponent(swfParams[v]));\n      }\n      for (var v in flashParams) {\n        cv_mo1Y0NE415QAI58so.addParam(v, flashParams[v]);\n      }\n      for (var v in embedAttributes) {\n        cv_mo1Y0NE415QAI58so.setAttribute(v, embedAttributes[v]);\n      }\n\n      cv_mo1Y0NE415QAI58so.addVariable(\"swfEmbedTime\", new Date().getTime());\n\n      var agt = navigator.userAgent;\n       \n      var reFirefox = new RegExp(\"firefox/\", \"i\");\n      var regx = agt.split(reFirefox);\n      var ffVersion = 8;\n      if (regx[1]) {\n          var pts = regx[1].split(/[.]/);\n          ffVersion = parseFloat(pts[0] + \".\" + pts[1]);\n      }\n      var minorVersion = parseFloat(navigator.ap);\n      if ((navigator.appVersion.indexOf(\"Mac\")!=-1) || (ffVersion < 1.5)) {\n          cv_mo1Y0NE415QAI58so.setAttribute(\"height\", swfHeight);\n          cv_mo1Y0NE415QAI58so.setAttribute(\"width\", swfWidth);\n          cv_mo1Y0NE415QAI58so.addVariable(\"oldFirefox\", \"1\");\t     \n      }\n\n      if (cv_mo1Y0NE415QAI58so.write(\"cv_mo1Y0NE415QAI58flashcontent\")) {\n          fp_resizePlayerSpace('cv_mo1Y0NE415QAI58', \n                               320, \n                               283);\n      }\n      else {\n          var nsPrefix = 'cv_mo1Y0NE415QAI58';\n\n          fp_resizePlayerSpace(nsPrefix, 0, 0);\n          fp_rewriteDiv(nsPrefix, \"flashcontent\", '<br/>To view this video download <a target=\"_blank\" href=\"http://www.macromedia.com/go/getflashplayer\" target=\"_top\">Flash Player</a> (version 9.0.115 or higher)');\n      }\n  } catch(err) {\n      fp_resizePlayerSpace('cv_mo1Y0NE415QAI58', 0, 0);\n  }\n  return false;\n}\n\n\n\nfunction _cv_mo1Y0NE415QAI58loadSwf(movieID, playerVersion) {\n    var swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/20120510035744301/AMPlayer._V148501545_.swf\";\n    var swfWidth = \"320\";\n    var swfHeight = \"100%\";\n    var flashVersion = \"9.0.115\";\n    var bgColor = \"#FFFFFF\";\n\n    var swfParams = {};\n    var flashParams = {};\n    var embedAttributes = {};\n    swfParams.amazonPort = \"80\";\n    swfParams.allowFullScreen = \"true\";\n    swfParams.telemetrySubPageType = \"VideoReview\";\n    swfParams.nsPrefix = \"cv_mo1Y0NE415QAI58\";\n    swfParams.locale = \"en_US\";\n    swfParams.logUrl = \"gp/mpd/l\";\n    swfParams.canResize = \"1\";\n    swfParams.autoPlay = \"1\";\n    swfParams.sessionId = \"000-0000000-0000000\";\n    swfParams.marketplaceID = \"ATVPDKIKX0DER\";\n    swfParams.salign = \"LT\";\n    swfParams.preset = \"detail\";\n    swfParams.mediaObjectId = \"m3PZUBT1LP9ZWQ\";\n    swfParams.autoPlayTimer = \"\";\n    swfParams.mediaObjectIDList = \"m3PZUBT1LP9ZWQ\";\n    swfParams.playIsUserGenerated = \"1\";\n    swfParams.enableShare = \"0\";\n    swfParams.permUrl = \"gp/mpd/permalink\";\n    swfParams.telemetryPageTypeID = \"R3KYXZCOY4U8YL\";\n    swfParams.xmlUrl = \"http://www.amazon.com/gp/mpd/getplaylist-v2/m3PZUBT1LP9ZWQ/000-0000000-0000000\";\n    swfParams.amazonServer = \"www.amazon.com\";\n    swfParams.scale = \"noscale\";\n    flashParams.allowFullScreen = \"true\";\n    flashParams.salign = \"LT\";\n    flashParams.bgcolor = \"#FFFFFF\";\n    flashParams.allowScriptAccess = \"always\";\n    flashParams.quality = \"high\";\n    flashParams.wmode = \"transparent\";\n    embedAttributes.title = \"Flash Player\";\n\n    if (movieID){\n      if (playerVersion == '3'){\n        swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/20120510035744301/AMPlayer._V148501545_.swf\";\n        swfParams.mediaObjectIDList = movieID;\n      } else {\n        swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/legacy/20101014901/AMPlayerProd._V197491872_.swf\";\n      }\n      swfParams.xmlUrl = \"http://www.amazon.com/gp/mpd/getplaylist-v2/\" + movieID + \"/000-0000000-0000000\";\n      flashParams.wmode = \"transparent\";\n      swfParams.autoPlay = \"1\";\n    }\n\n    if (document.getElementById('cv_mo1Y0NE415QAI58duration')) {\n      document.getElementById('cv_mo1Y0NE415QAI58duration').style.display='none';\n    }\n    cv_mo1Y0NE415QAI58loadSwf_Core(swfLocation, swfWidth, swfHeight, flashVersion, bgColor, swfParams, flashParams, embedAttributes);\n\n  return false;\n}\n\nfunction cv_mo1Y0NE415QAI58loadSwf(movieID, playerVersion) {\n   return _cv_mo1Y0NE415QAI58loadSwf(movieID, playerVersion);\n}\n\n\n\t\n\t\t// ]]>\n\t\n\n<!--\n\nfunction cv_mo1Y0NE415QAI58newHeight(h)\n{\t\n    fp_resizePlayerSpace('cv_mo1Y0NE415QAI58', 0, h);\n}\n\nfunction cv_mo1Y0NE415QAI58resetPlayer(w,h,bw,cc) {\n  cv_mo1Y0NE415QAI58newHeight(h);\n\n  cv_mo1Y0NE415QAI58so.addVariable(\"resetBandwidth\", bw);\n  cv_mo1Y0NE415QAI58so.addVariable(\"cacheCode\", cc);\n  cv_mo1Y0NE415QAI58so.setAttribute(\"height\", h);\n  cv_mo1Y0NE415QAI58so.setAttribute(\"width\", w);\n  cv_mo1Y0NE415QAI58so.write(\"cv_mo1Y0NE415QAI58flashcontent\");\n}\n\n-->\n\n\n\n\n\n\n\n\nvar cv_mo1Y0NE415QAI58RollOverImg = new Image();\ncv_mo1Y0NE415QAI58RollOverImg.src = \"http://ecx.images-amazon.com/images/I/91-IN4RDppS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play-active,BottomLeft,130,-12_CR0,0,0,0_.png\";\n\nvar cv_mo1Y0NE415QAI58preplay = document.getElementById('cv_mo1Y0NE415QAI58preplayImageId');\nif (cv_mo1Y0NE415QAI58preplay) {\n  cv_mo1Y0NE415QAI58preplay.onmouseover = function() {\n    cv_mo1Y0NE415QAI58preplay.src = \"http://ecx.images-amazon.com/images/I/91-IN4RDppS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play-active,BottomLeft,130,-12_CR0,0,0,0_.png\";\n  }\n  cv_mo1Y0NE415QAI58preplay.onmouseout = function() {\n    cv_mo1Y0NE415QAI58preplay.src = \"http://ecx.images-amazon.com/images/I/91-IN4RDppS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play,BottomLeft,130,-12_CR0,0,0,0_.png\";\n  }\n  \n  \n  var node = cv_mo1Y0NE415QAI58preplay.parentNode;\n\n  var cv_mo1Y0NE415QAI58currentClick = node.onclick;\n  node.onclick = function () {\n    var head = document.getElementsByTagName(\"head\");\n    if (head[0]) { \n      var logTag = document.createElement('script');\n      logTag.type = \"text/javascript\";\n      logTag.src = \"/gp/customer-media/du/log.html?ie=UTF8&p=CustomerImage&s=CustomerVideoPlay\";\n      head[0].appendChild(logTag);\n    }\n\n    if (cv_mo1Y0NE415QAI58currentClick) {\n      return cv_mo1Y0NE415QAI58currentClick();\n    }\n  }\n}\n\n\n\n\n Length:: 0:53 MinsHere is the low down on the:---Panasonic LUMIX DMC-FZ70 16.1 MP Digital Camera with 60x Optical Image Stabilized Zoom and 3-Inch LCD (Black),---Canon PowerShot SX50 HS 12MP Digital Camera with 2.8-Inch LCD (Black),---Nikon COOLPIX P520 18.1 MP CMOS Digital Camera with 42x Zoom Lens and Full HD 1080p Video (Black) (this camera).The video shown is with the respective camera to show the zoom quality of that camera. (The videos were compressed).  On the Pany and Nikon, when you move the zoom lever all the way to the right then you are at maximum optical zoom.  The canon is a little tricky because if not careful you will end up using the digital zoom because moving the lever all the way to the right puts you in digital zoom mode.IMAGE QUALITYNone of these cameras will look as good as a dslr.---The Pany was true to color and appeared to have built in HDR ( when taking an image where half is in the shade and the other half sunny, the Pany took two images then automatically combined them).---The Canon looked a little washed out but images still looked nice.---The Nikon takes the best images IF the subject is static, but if you have a moving object expect to get blurry images from the Nikon.ZOOM CAPABILITIESBased on 35mm equivalents, you have the following for wide angle through telephoto.....Panas (FZ70)...60X... 20mm - 1200mm....Canon (SX50)..50X... 24mm - 1200mm....Nikon (P520)....42X... 24mm - 1000mmThe viewfinder and LCD on the Pany appear not to capture the entire area, once the image is on the computer it appeared to have a wider angle of view.  The extra wide angle is really nice.SOUND QUALITYThe Panasonic appear to have the best microphone of the bunch and hence the best sound quality.", "Date": "October 14, 2013"}, {"Title": "Works great, when it works", "Author": "S. Shadday", "ReviewID": "R2SIRKAAQTHCBT", "Overall": "4.0", "Content": "This camera takes great photos, esp. macro shots.  The only complaint I have with it is that on the camera I received, the focus doesn't always work.  Doesn't matter what setting I use or which AF area mode I select, there are times when the camera just refused to focus, even when it has a clear view of what I want to shoot.  It will briefly focus, then go back out of focus and stay there.", "Date": "July 21, 2013"}, {"Title": "Great camera!", "Author": "Ann Rast", "ReviewID": "R2LJJWMOZ22DTG", "Overall": "5.0", "Content": "Great camera; easy to use, and takes great pictures.  Love the powerful zoom lens.  Only con is that the lens cap comes off too easily.", "Date": "May 13, 2013"}, {"Title": "excellent", "Author": "Stv S", "ReviewID": "R3S64UUDOW5DRO", "Overall": "5.0", "Content": "For the money, this is by far the very best camera i ever owned.  Had it 2 days and went to Asia with it. Flawless, simple to use, super zoom.well worth the bucks.  go for ito yeah, killer good video", "Date": "October 20, 2013"}, {"Title": "Great Camera", "Author": "G. Gehlken", "ReviewID": "RPZ8F7IQK2CY9", "Overall": "5.0", "Content": "Easy to use and takes fabulous photographs.  Am pleased with my selection.  Very light weight compared to upper end digital cameras and well balanced.", "Date": "October 1, 2013"}, {"Title": "A quality camera by Nikon!", "Author": "carverman", "ReviewID": "R2AQC2Z0XWI3DV", "Overall": "5.0", "Content": "The 18 MP makes this camera stand out in the \"point and shoot\" category. The variable screen protector is excellent, and really protectors screen from scratching and damage. So far my experience has been very positive.", "Date": "November 21, 2013"}, {"Title": "I L.O.V.E. It!", "Author": "Bel Dezas", "ReviewID": "R2YE44C2TRNV84", "Overall": "5.0", "Content": "I had been looking at upgrading from my Sony point and shoot to a digital SLR but I wasn't sure if I wanted to invest a minimum of $600 for a camera and an additional $400 for another lens.  This camera was the answer! I know it isn't a DSLR but it's very close.  It arrived a day before expected and I stayed up past 1am trying to learn as much as I could.  I still have a lot to discover but I figured if I can master ISO, aperture, shutter speed and so on with this camera then maybe in a couple of years I can make the investment for a DSLR.I am extremely happy with the quality of this camera and cannot wait until my SD card gets here so I can begin saving photos!", "Date": "February 28, 2013"}, {"Title": "Power Button Issue", "Author": "Jenny", "ReviewID": "R1YB5ZAT5QBVN2", "Overall": "3.0", "Content": "The zoom function is great, that's why I purchase it. But the power button gets a little problem. Sometimes it's hard to power on the camera, the power button just doesn't give any responses. You have to push hard or try many times, sometimes you even need to take out the battery and put it back to start the camera. This issue really brought me some problems when I was travelling, put me in an embarrassing situation.", "Date": "July 2, 2013"}, {"Title": "Dissapointed", "Author": "Janet Bozynski", "ReviewID": "R1G3QQB6VVUTB7", "Overall": "2.0", "Content": "The camera is slow to recover from a shot. The zoom is blurry at times. I've had the camera 8 months and just sent it to the company for trouble shooting as to why the camera will not charge a battery anymore. (at my cost of shipping by the way) I wish I would have returned it.", "Date": "April 1, 2014"}, {"Title": "Quite a nice camera", "Author": "William Cook", "ReviewID": "R3LS1TDVK9MDWR", "Overall": "4.0", "Content": "I am not photo-guru and this is my first camera which cost more than $100.  It takes excellent pictures and for someone with hands that are a bit shaky, it prevents pictures from coming out blurry.  It also takes very nice pictures at night even without using the flash.", "Date": "December 26, 2013"}, {"Title": "Wooow!", "Author": "Berny", "ReviewID": "R2IM2GLO2OS86B", "Overall": "5.0", "Content": "As a photographer, I have recommend and bought this Coolpix to many friends and family and have not received any bad comments. The quality of the pictures is stunning for its size!", "Date": "November 27, 2013"}, {"Title": "I have found out that Nikon is one of top Digital Camera's on the market now.", "Author": "Donald C. Szymanski", "ReviewID": "R39TMLHPP3ZXOI", "Overall": "4.0", "Content": "I have just goy myself this Nikon Coolpix P520 18.1 MP CMOS Digital Camera with 42x Zoom Lens. I have already made a test run taking pictures around my home town as they came out real good Tops. I  got this here Camera so one can have it ready for my tripback to Disney World for next year May 5-8-2014.", "Date": "November 21, 2013"}, {"Title": "I love it", "Author": "Egon Keltai", "ReviewID": "RDN4B72GTDQE8", "Overall": "5.0", "Content": "Excelent camara.I am enyoing it. I have the FTN and F3 film camaras, but this is an easy to use equipment.", "Date": "October 25, 2013"}, {"Title": "Awesome Camera", "Author": "Dan the Man", "ReviewID": "R3UFVOANU4WIHN", "Overall": "5.0", "Content": "I highly recommend this camera for the average point and shoot person who wants to have the ability to zoom up close to distant items of interest.  There are better cameras out there but for the price point you will not be disapointed.  I use this camera when I am on vacation and love the professional looking photos it produces.  I recommend it to anyone - it just works.", "Date": "October 24, 2013"}, {"Title": "Camera", "Author": "Sebastian Paquette", "ReviewID": "RH74MHXB02CFV", "Overall": "5.0", "Content": "I very much like this new Nikon camera.  The price was fair, the delivery on time.  This is the fourth Nikon camera I have owned, and I have been more than satisfied with all.", "Date": "October 2, 2013"}, {"Title": "I love this camera!", "Author": "Christina Jennings", "ReviewID": "R35ZF6GCNZU10D", "Overall": "5.0", "Content": "I recently developed an interest in photography.  This camera is perfect for a beginner. I am having such a great time learning with it.  I love the zoom. It is incredible!.", "Date": "September 20, 2013"}, {"Title": "Excellent Super Zoom", "Author": "David Huchital", "ReviewID": "R1NKJMCMB3I7UH", "Overall": "4.0", "Content": "I tried both this and the Sony and chose the Nikon for superior color fidelity. The zoom capability is excellent and the dense focal plane ensures a high resolution photo. The negatives, as others have pointed out, are that the focus is a tad slow and it feels a little cheap and plasticky. But having said that, it's light enough to throw in your camera bag without a second thought.", "Date": "September 1, 2013"}, {"Title": "A trade off", "Author": "Ralph E. Decker", "ReviewID": "R2BNGNTSL14RA", "Overall": "3.0", "Content": "I got this for an upcoming vacation I am taking.  I did not want to carry by DSLR and a Video Camera.  I was hoping this would meet both needs.  It works Okay in video mode if the light is good.  For indoors you need a good deal of light or the video is too dark.  I contacted Nokia who said 'it is working within specs.'Also - battery life is bad.  Get extra batteries.  GPS really eats them up and, by the way, the GPS receiver is not that good.  Indoors, when even my HTC One X gets a solid signal, the camera will not lock to GPS.The lens is very good and the sill picture quality is excellent.  JPG compression is pretty high (4 and 8 times).  Would be nice if Nikon offered a less lossy mode.Anyway - It's okay.  If I had to do it again, i would have spend a few extra bucks and gotten a higher end camera that is outside the Coolpix line.", "Date": "March 31, 2013"}, {"Title": "Poor auto focus - blurry pictures", "Author": "Brian", "ReviewID": "R2G6S3F62D3ARS", "Overall": "1.0", "Content": "The camera has a wonderful zoom range, macro mode and other features such as panorama, GPS, HDR that I like.  My brother has one and had recommended this one.  However its pictures are not as sharp as those of my 12mp Canon SX-20IS that this camera was supposed to replace.  I took a number of comparison shots and, particularly at full telephoto, the Nikon pictures were out of focus.  I got more detail out of my Canon which has half of the zoom capability.  I returned the camera.", "Date": "December 30, 2013"}, {"Title": "Fantastic Camera", "Author": "dmally", "ReviewID": "R3PYW2WQEGRJTI", "Overall": "5.0", "Content": "This is an excellent camera.  I am new to photography and was looking for something more than a typical point and shoot camera.  I did a ton of research and was torn between a true DSLR which would probably require me to take a photography class to learn how to use or a fancier point and shoot.  I wanted a higher MP so I could enlarge photos beyond 5x7 and I wanted to be able to zoom in close on wildlife.  This camera had both without the need to take a collage class to learn how to use it.  I am still learning what all this camera will do, but  I can say that the photos I have taken have been fantastic.  I asked my friend if I could use her daughter as my guinea pig and take some senior photos of her (for practice).  WOW!  They were so great that she choose to use them :)  Crisp and clear and on the automatic setting with use of a tripod.  I also got some great landscape and wildlife photos that are fantastic.  I am thrilled with this camera.  It is the perfect camera for someone who is new to photography but wants professional quality photos.  Thanks Nikon.", "Date": "November 13, 2013"}, {"Title": "Great camera for picture lovers.", "Author": "Fran", "ReviewID": "RWZUCHIEEYTH4", "Overall": "4.0", "Content": "This camera is perfect for the picture lovers and also for begginers. Amazing picture quality, light and very easy to use.The 42x zoom is nice, but user has to be steady while shooting at max zoom.", "Date": "May 6, 2013"}, {"Title": "Advanced features not working yet", "Author": "Casper Chauncey", "ReviewID": "R2N8PR7YFND0WF", "Overall": "1.0", "Content": "You don't have to take my word for it. Go check Nikon's web site. Amazon won't let reviewers post links but go to Nikon's site and search for firmware update for this P520 camera. Their page listing firmware updates DOESN'T EVEN KNOW THIS CAMERA EXISTS as of the date of this review, much less have an update available.My camera came with firmware 1.0. Well, simply, it isn't finished. Many of the advanced features described and illustrated in the user manual just AREN'T THERE. The ones that are don't work reliably. I got this especially for the GPS feature. It is slow to lock and keeps losing lock, even though it is allegedly \"always on\" once you enable it. After recording GPS coordinates for awhile you have to choose an option to \"Save\" them. Well where were they up to now if not saved? Anyway, I choose save and the camera just locks up totally. None of the buttons work. It has been an hour now and it is still locked up. Not even the automatic screen dim after a few minutes (which you can't adjust -- another feature they didn't get around to programming yet) is kicking in.I'm a software programmer and I recognize this as the symptom of half-baked software rushed to market before it is done. The camera itself seems great physically. Maybe in a year or two they'll finish the software and this will be a good camera. But not now. Many of the settings described in the owners manual are simply unusable in its current state.Finally, by looking at their other products, I can see that even if there WERE a firmware update available, they wouldn't let ME have it. You see, you have to run a Windows program that creates a firmware.bin that you put on your camera's memory card. Well that is just stupid. Just give us the firmware.bin file directly! Then we can all use it -- not just Windows people!A company this ignorant and careless about software does not deserve one dollar of my money.", "Date": "June 2, 2013"}, {"Title": "After 4 months of use . . .", "Author": "Lin", "ReviewID": "R3CB6CPQE0UTNL", "Overall": "5.0", "Content": "My desire was for the maximum bang in the most compact camera package.  This is perfect for me.  My photographs are remarkable.  Clarity is amazing.  Zoom is spectacular.  Low light capabilities are unbelievable.  Speed of warm-up and operation is incredibly fast.  I'm impressed!!!  If I could give it more stars, I would.", "Date": "March 15, 2014"}, {"Title": "Beautiful Pictures, Great Low Light but Slow and Freezes Sometimes", "Author": "PenName", "ReviewID": "R15LKL9Z90V75Y", "Overall": "3.0", "Content": "I like taking pictures but am no expert.  I am still debating whether to keep this camera.  I have had it for about 3 months.The camera just seems slow - whether it is powering up or focusing.  I know I should not expecting miracle with a bridge camera but I have missed some nice shots.  My old Canon S3 (which is quite a few years old) does not seem to be much slower.  Worse - sometimes nothing happens when I push the shutter button on the P520 - it seems to be hung up on focusing or something.The bright side is the pictures are beautiful.  I am especially impressed by the low-light performance.  Battery life is OK - I have the GPS turned off and use the viewfinder.I did have 2 or 3 freezes in the last 2 weeks.  Basically, the camera became unresponsive to anything.  I had to pull the battery out to reset it.  I don't feel it is a hardware problem - it seems like a software timing thing.  Once it was in the middle of shooting a video (and the memory card was still pretty empty).  It seems others have reported this too.  (I bought this camera in November 2013 so it probably has newer versions of any software.)  Obviously not good for a camera to do this.  Luckily, the memory card remained intact (i.e. not corrupted by the problem and my solution(.One thing that really bugs me is I can't figure out how to disable the automatic displaying on the viewfinder of the picture I just took.  There is got to be a way to disable that, right?", "Date": "February 8, 2014"}, {"Title": "Impressive zoom capabilities, Compact package", "Author": "Zane A. Undercoffer", "ReviewID": "R3K96A5R5N89ES", "Overall": "5.0", "Content": "So my wife told me a few weeks back she wanted to get a more real camera. Neither of us is a photographer, we have no real interest in photography. She wanted it so she can take pictures of the kid, and the pets, and our activities in higher quality and resolution than her cell phone or our cheap point and shoot cameras could offer. More to the point, when she has them printed out professionally, she wants them to look nice -not pixely or distorted.THE SEARCH BEGINSSo costco has the nikon DSLR's. I have a photographer friend who bought one and has had good results using it and says it's a real good value. It's also $1000. That's a bit excessive for us, as we wouldn't know where to even begin with such a camera. There's also higher-end point and shoot cameras, which are probably pretty good as the MP's of them have really risen in the past few years. However, the problem is they don't zoom, or don't zoom very far. And once you use the digital zoom feature, your resolution goes downhill in a hurry and you generally lose image stabilization, so taking a non-blurry picture becomes nigh-impossible.Actually didn't know about this line of cameras at all. I typed in \"digital camera\" into amazon's search engine and started browsing. Didn't get very far, so I decided I'd look at nikon's offerings as I owned a higher end film nikon back in the day and my friend uses nikon exclusively. This camera's lower end version was on the first page of \"nikon digital camera\", and after looking at the different options I settled for this one.THE CAMERA:The device itself is impressive. It's not as big as a DSLR, most notably it doesn't have a giant honking disconnectable lens hanging off the front of it. What is present is the HUGE built in auto-zoom lens, the flip around screen, and the selector wheel. I love that the wheel is made of actual steel (or I presume steel) and the edges are coarse so it's easy to use in your fingers. Each selection has a very positive detente, so there's no question about what setting it's on and it definitely does NOT feel cheap. The flip around screen is large and has good resolution. I'm not really sure why it flips around, and if I ever find a use for that feature I'll update this review. The body is weighty, but not super heavy and feels good in your hands and overall has a real good look to it.THE ZOOM:It has a little selector on the lens body which puts it into manual mode which is a real nice feature. I've yet to use it, but if I was more of a pro photographer I could see needing it for faster action shots at a distance. The zoom on this camera is impressive. I'm so glad I purchased the higher end version with the big zoom as you can really take distance pictures easily.THE VIDEO:It really amazes me that I can own a device for a reasonable sum of money which takes this good of video and pictures at the same time. The video is great, there's no other way to put it. I don't feel like I've settled for a combo device which does nothing well. This camera seems to do it all well. The audio isn't the best-best, but it's infinitely better than a cell phone video which is all we require from it.THE FEATURES:Read the manual, it has them in spades. Honestly, I've yet to use even half of them. But for taking quality pictures and videos, and a great zoom feature this camera seems to do no wrong. Also, it's worth mentioning that you can't use filters with this camera as it's presently configured. However the lens is somewhat threaded and they sell adapters that allow you to use filters. Honestly, I don't have any expertise in that department so I don't know if I'll ever do that.SUMMARY:This camera is more than enough for your average picture taker. My friend toyed around with it for a bit, and his thoughts were that if I ever get bored with this camera a proper DSLR will be the next step, but for my uses it's so far beyond adequate it's unlikely. I'm very pleased with this purchase and so far have not had any issues with it's usage.", "Date": "January 27, 2014"}, {"Title": "Great Camera", "Author": "Ray Parks", "ReviewID": "RM8AHOPNQCX74", "Overall": "5.0", "Content": "very light and takes above average pix with a great optical zoomI own several more expensive Nikons and this one is a great surprise as to the picture quality and simple to use.", "Date": "January 20, 2014"}, {"Title": "Great camera", "Author": "Carl R. Cook", "ReviewID": "R1YJC80XJCTE5M", "Overall": "5.0", "Content": "LOVE this camera. Pictures so clear. I live in WY with so many animals and the mountains. YES people buy this camera", "Date": "December 30, 2013"}, {"Title": "What a great camera!", "Author": "Ken01 \"Ken01\"", "ReviewID": "R1CU5MR5DWYL7V", "Overall": "5.0", "Content": "It has 42x Zoom = incredible!  FAVORITE FEATURE for me: Allows one to have the date print out on the pictures, if you want it, even if you have pictures printed out at a CVS or Walgreens type place (my old Pentax would NOT do that) - this camera will save me a ton of time, from having to manually enter the date on the pictures at the developing store machines.  Also, the back view screen is amazing quality!  And the low-light pictures are almost better than real life (they REALLY approximate the exact lighting/colors in really low light!).  Simple set-up, and great features.  I myself don't use the GPS function, but it is there if you need it.This camera is a must-have!!", "Date": "December 25, 2013"}, {"Title": ":D", "Author": "Amy", "ReviewID": "R1PKM2T6HLTSQD", "Overall": "5.0", "Content": "I am NOT a professional photographer nor inclined to be one. But I wanted something with good quality photos and easy to operate. I absolutely LOVE IT!!!  Even has the manual focus my husband wanted for some weird reason.  Great pics, great features, great video.  Couldn't be happier!", "Date": "December 14, 2013"}, {"Title": "Great Camera", "Author": "Suzie in Denver", "ReviewID": "RC6CK9TIUQE5H", "Overall": "5.0", "Content": "This is a great camera.  My granddaughter saved her birthday and allowance money to buy this.  She loves it.  Her grandfather is so impressed, he wan'ts one for himself.  It took great pictures.", "Date": "August 24, 2013"}, {"Title": "very nice camera", "Author": "dr. foto", "ReviewID": "R50RIAEOZ8W5V", "Overall": "5.0", "Content": "This is my second camera and the best one. It's really good. The zoom is incredible and it's very ease to use this camera; you can have very good photos.", "Date": "July 11, 2013"}, {"Title": "TOO MANY PROBLEMS", "Author": "WILLIAM ABERNATHY", "ReviewID": "R3IRILZY4BOKP2", "Overall": "2.0", "Content": "We have owned several Nikon cameras, and this is the 1st one we did not like.  I returned it.  The image quality was poor, the zoom was difficult to control, the image was blurry at high magnification, and there was an excessive time delay between consecutive shots.  The menu for advanced functions was not intuitive and was not easily accessed.  The paper manual that came with the camera was brief and did not direct you to the complete 240 page manual online.", "Date": "November 7, 2013"}, {"Title": "A mistake in design.", "Author": "Julio Ortega Bobadilla \"JOB\"", "ReviewID": "R2H57CX3XSB3XK", "Overall": "3.0", "Content": "I have always trusted on Nikon, but the P510 and the P520 cameras have a problem. You can not put a conventional filter on your lens, neither 52, 48 mm are suitable. You have to buy an adaptor to 67 mm (that isn't Nikon brand), and then look for the filters (uv, polarizer, etc) at your own risk. I'm happy with the camera but I expected more support from Nikon. Nikon COOLPIX P520 18.1 MP CMOS Digital Camera with 42x Zoom Lens and Full HD 1080p Video (Black)", "Date": "October 1, 2013"}, {"Title": "This camera is just plain awesome", "Author": "Tarek Halaby \"tarekzh\"", "ReviewID": "RJDGIRK4XNBEQ", "Overall": "5.0", "Content": "Awesome piece of equipment took a few pictures with it yesterday and I love love love it!!!!!!!!!! the clarity of the pics detailness so sharp I was going back and forth between the Canon sx50hs and finally decide on the ones", "Date": "June 3, 2013"}, {"Title": "Coolpix P520 Camera Review", "Author": "Hammercl", "ReviewID": "R1YSVOZODZ4NNV", "Overall": "4.0", "Content": "The camera was well packaged, Easy to operate, instructions were very good, shipping time was acceptable, was as described on the Web Page. The only issue is if you run the GPS on the camera, you can only take about (30) pictures before it completely drains a battery. I did not find this information anywhere in the instruction manual and found out the hard way when the battery died and the camera would not turn on. This is the only downside I have found so far with this camera.....", "Date": "July 7, 2013"}, {"Title": "Great if you want an upgrade but not ready for DSLR", "Author": "Jbean5026", "ReviewID": "R1UJRLOR7AIIJQ", "Overall": "5.0", "Content": "I have been wanting to upgrade to a \"big girl\" camera for a while now and after doing some research decided to start with this.  I looked into DSLR cameras but by the time I would have gotten a lens that I wanted it was going to cost upwards of $1000 and after trying one in a camera store I left feeling a little overwhelmed.I just got this in the mail yesterday and was able to quickly figure out pretty much all of the auto settings.  I am really satisfied with the results as this is going to be mainly used for family photos and travel.  I like the idea that I can adjust things manually if I want, so I think this will be a nice camera to sort of learn on and then eventually upgrade again to a DSLR if I end up wanting to.So far, I am impressed with this camera as a beginner and look forward to learning all the ins and outs and producing great photos!", "Date": "April 16, 2013"}, {"Title": "I think I would rather have the P510", "Author": "Robert G. \"Robert\"", "ReviewID": "R2R3DQ7ILL8SE6", "Overall": "3.0", "Content": "I have owned a p-100 and a p510 both of which I was pleased with. My problem so far with this camera is the poor quality of the image through the viewfinder and the method they have chosen to use it . The LCD display has to be totally closed (folded in so that it is not visible) to use the viewfinder. This means that the user cannot use the DISP button to switch quickly back and forth between the two. A person who has never used an SLR and enjoyed looking at the crisp through the lens image probably will not care about this.I will comment further when I've had the opportunity to use the camera more--I just bought it to replace my p510 which was stolen. I hope the extreme telephoto is as good as the 510 and the autofocus problems have been remedied.", "Date": "April 9, 2013"}, {"Title": "Best point n shoot wildlife camera ever", "Author": "Kenneth Lipshy \"wuzupdoc\"", "ReviewID": "R2GAZ0JDJ2VWPP", "Overall": "5.0", "Content": "I read a lot if reviews before purchasing this. I have had a Nikon coolpix for the past 3 years. Prior to that I owned a similar Olympus but Olympus quit putting in a eye view finder and I photograph birds and other fast moving objects so that is a must. I need a camera that I can just grab and go so it cannot weigh much, plus I tend to drop it bang cameras a lot so can't really validate purchasing an slr. Essentially I needed a camera that had a very wide range of focal lengths, decent resolution and did not take several paychecks to purchase. So to all those who whine and complain about the camera..... Sure it's not as good as a 15000 slr w a 800mm lense, that you can then switch to a 29mm lense when you want a scenic view, but common this costs 350.If you don't believe me, the pics on the link below were take about 15-20 yards away- you can see the dried salt on the terns nostrils- that's good enough for me. Oh and the pier I was standing on was moving and there were frequent wind gusts meaning I was never still for long and the motion adjustment was just fine.[...]", "Date": "May 11, 2014"}, {"Title": "Exceeded expectations", "Author": "Nikki Hardesty", "ReviewID": "R3UG8TT51G74U2", "Overall": "5.0", "Content": "I am a beginning photographer, I was looking for something easy to use that provided awesome quality pictures. I had messed around with a P510 in a store, but then realized the P520 was the \"upgrade\". I went with my gut instinct and bought this camera. I am SO happy that I did! I have pulled off some shots that I never thought possible, I am overly pleased with this camera!The ONLY gripe that I have so far is that I wish it came with a more in-depth instruction manual. 11 out of 13 pages tell you how to \"set the camera up\" and then you're pretty much left to your own devices. Finding videos online have helped tremendously.", "Date": "March 20, 2014"}, {"Title": "Review for Nikon Coolpix P520 18.1 MP CMOS Digital Camera", "Author": "Lori S. Chadbourne", "ReviewID": "RDEAWM6ZUN737", "Overall": "5.0", "Content": "This is the perfect camera for me.  I've been looking for one that has a higher zoom than the one I have now.  My other challenge was to find one with a separate viewfinder...so many of the newer digital cameras only come with the LCD on the back of the camera and it's impossible to see anything in bright daylight.", "Date": "March 18, 2014"}, {"Title": "Great Digital Camera (No gadget bag required)", "Author": "Old Aviator", "ReviewID": "R28QXGL6HOJIG0", "Overall": "5.0", "Content": "I have had many cameras over the years but this is one of the best. No fussing with lens changing. Extremely compact for a SLR style camera. Eighteen megapixels and image-stabilization produces sharp, well-lit photos in all lighting conditions. I added a 32 GB Class 10 SDHC Flash Memory Card, so I am ready to shoot all day. Oh yes, it also does 1080p HD videos with stereo sound. Very highly recommended.", "Date": "March 12, 2014"}, {"Title": "Love it", "Author": "John", "ReviewID": "R11AGSESTURPX7", "Overall": "5.0", "Content": "First big-boy(-ish) camera I've had. I don't have the money to drop on a dslr and wanted more than a silly phone camera. I'm not a very \"in your face\" person so staying in the back of an event is usually my cup of tea and the zoom helps. A short tutorial on modes, focus, shutter-speed, iso, etc. and people's interest perked up a little when I posted photos.If you feel ignorant about photography but have taken enough cellphone pictures that are blurry, blown out, dark, or just not right this will give you enough room to learn and pass on to a friend or family member. I don't believe I'll stay with this forever but I'll stay with it for now.", "Date": "February 26, 2014"}, {"Title": "Wonderful travel camera.", "Author": "Fred Zahnow \"Fred the sailor.\"", "ReviewID": "R1CXC3YG25WR11", "Overall": "5.0", "Content": "My days of travel with a bag full of two high end digital Nikon cameras and 8 lenses are over!  This light and small camera has incredible options for still and video!", "Date": "February 23, 2014"}, {"Title": "Love Camera", "Author": "Elizabeth Cross", "ReviewID": "RF2PRM0MSGTTQ", "Overall": "5.0", "Content": "I'm highly impressed with this camera. I highly recommend this camera for anyone that's a beginner in cameras similar to these. Unfortunately, this model does not have interchangeable lenses. Although, there are multiple different filters for this module. The detail of the photos from this camera are amazing. Also, I highly recommend the user guide for this camera by the title of \" Photographer's Guide To The Nikon Coolpix P520\" by Alexander S. White. It a very helpful 420 page guide. I ordered mine when I ordered my camera.", "Date": "February 19, 2014"}, {"Title": "P520", "Author": "Electronic Tech Geek \"Self Employed\"", "ReviewID": "RFSCN17C8DP3R", "Overall": "5.0", "Content": "After reading all the reviews I decided to go for it. I am very happy with this camera. Not true DSLR and not a pocket camera. Feels god in the hands and it take GREAT photos and videos. One of my main reason to purchase, other than being a Nikon, was because I could wifi my pics to my iPad with the done and it shoots 3D pics. Very cool. The zoom is fantastic. Although it sometimes has a time trying to auto focus, but all in all....Great camera", "Date": "February 10, 2014"}, {"Title": "Very good Nikon camera", "Author": "AWF620", "ReviewID": "R34JOXEEBFC2MD", "Overall": "4.0", "Content": "Nikon cameras have never let me down. I wanted to move up from a basic digital camera with minimal zoom to one where I could capture my grandchildren from a distance while participating in sports.  this one does the trick and the quality is very good. I like the rotating screen as well as the easy access record button for video.", "Date": "February 2, 2014"}, {"Title": "A good upgrade to the Nikon Coolpix S9100!", "Author": "Joe M.", "ReviewID": "R1H4FUE9SSE96R", "Overall": "4.0", "Content": "I got this camera shortly after Thanksgiving 2013 after deciding that I wanted to further increase my skill set in photography. After I pretty much drove my Kodak EasyShare M893 into the ground over three years of use (June 2008-July 2011) and 10,000+ pictures, I got the Nikon Coolpix S9100 in September 2011. Although I still use the S9100 as my general-use camera having taken more than 4,500 pictures since purchasing it, the P520 has now become the third camera I've owned since 2008. It's a well-built, high quality camera with a lot of good features that will produce some stunning pictures under the correct conditions. I have yet to test it to its full extent since at the time of writing this review it's really cold here in southern Minnesota, and I don't dare expose this thing to temperatures of -15!Some positives about the P520:* Indoor pictures turn out great, but you need to know when to use the flash, and when you can compensate using exposure compensation. As an example, I took a really good shot of my family over the Christmas holiday, and although it was slightly overexposed, the lighting conditions inside the residence where the picture was shot was actually relatively dark. Flash and the AF assist light on the front of the camera were important for allowing the shot to come out correctly. During the day, if you're planning to shoot indoors, use the Best Shot Selector (BSS) continuous shooting capability to get the most crisp shots you can.* The number of different image resolutions is excellent for being able to take shots with many different aspect ratios (4:3, 16:9, 3:2, 1:1, etc). Overall, the camera's image resolutions tend to favor 4:3 ratios (for standard-resolution monitors), but I still have two options for taking pictures that will fit my 16:9 widescreen monitor at home perfectly (1920x1080 @ 2MP or 4864x2736 @ 13MP).* Really like to have the power to experiment with aperture priority, shutter priority, and program modes. For an amateur photographer like myself who likes to snap a lot of pictures on campouts with the Boy Scout troop I'm in, this is really a good way to see what settings work best when conditions change frequently.* The way that you can hold the camera just like a regular DSLR is awesome! It's just one way to add to the experience of owning this piece of machinery.* Having the LCD screen tilt and rotate is nice when you need to get the camera into an awkward position or other location where taking a picture would otherwise be inconvenient. You can definitely take some good selfies with this camera! I haven't used the viewfinder enough to know if it's of any practical use since the regular LCD screen is of such high quality (921K dots), but I can say that it's hard to look through it since it really forces me to squint out of one eye pretty tightly. It's uncomfortable at times.Some negatives about the P520:* Would like to see some improvements to the menu system. I think that the reactivity to selecting menu options is nice with the command dial, but using the multi selector dial to select options seems to be a little slower compared to how my S9100 would be able to just breeze through them all.* Yes, the auto focus issue is certainly something worth mentioning here, but that's just something I've learned to deal with even on my S9100. I'm used to it being slow sometimes.* The Nikon-branded case that comes with this camera (if you purchase this as a \"kit\" instead of just the boxed package) is indeed too small. You won't be able to fit the camera in there unless you cram it. The strap just ends up making an already tight fit worse. As mentioned in the \"Photographer's Guide to the Nikon Coolpix P520\" book (which I also highly recommend purchasing), you can get the Lowepro Rezo 100 AW camera bag, and this will come with a rain shield which can be draped over the inside of the bag to provide better protection from the elements when necessary.Other thoughts:* Some reviews state that you absolutely have to take the lens cap off before powering on the camera to prevent the lens zoom motors from grinding and generating an error. This is not true -- if you turn on the camera accidentally without remembering to take off the lens cap, it does nothing to hurt the camera in any way since the lens cap would be attached to the lens and not the body. But you will see a very black-colored display if you do end up forgetting to take it off!* Be sure to buy an external EN-EL5 battery charger and spare batteries for this camera. As you normally have to leave the battery in the camera to charge it, I don't know if I would trust leaving a camera as expensive as this unattended (for me at summer camp, this is a high possibility, so the purchase of an external charger was an absolute must).Considering all of these points, my final verdict has to be that this camera has very good potential for becoming the best camera I've owned yet, but I have to test it further to try out all of its built-in features. I'll be updating this post as I find out new things about it.", "Date": "February 1, 2014"}, {"Title": "great overall camera", "Author": "Stephen Smith", "ReviewID": "R1KEQ0RG4AEOQ", "Overall": "4.0", "Content": "We got the Nikon Coolpix p520 over Christmas.  Over all it is a great camera.  The 42x optical zoom is nothing short of incredible.  It allows me to capture the craters on the moon and with the macro setting turned on, to get detailed rain drops hanging off leaves.  The shutter speed is also great – ranging from 1 to one four-thousandths of a second.  There are no stock lens filters available for this camera which was disappointing because I wanted to fit it with a UV filter to protect the lens.  Also the aperture limited to F:3 TO F:8.4 which doesn’t give the same control of depth of focus as I had wanted.  For the price I would definitely recommend this as an all-around capable and reliable camera  that is capable of taking stunning images.", "Date": "February 1, 2014"}, {"Title": "Everyone's Camera", "Author": "Harry Tutton \"Trumpet Dad\"", "ReviewID": "R19ZL0TLG3DGEA", "Overall": "5.0", "Content": "From the days of my Argus C-3 years ago I have enjoyed taking photos of my travels and now my family.  I welcomed the  change from Kodak film to digital photography - what an incredible change.  For a few years I enjoyed using a basic Canon point and shoot and it served me well.  Now with the Nikon CoolPIX P520 I have a better zoom lens and more pixels.  It took me only a few minutes to learn how to use the camera and I would certainly buy the camera again.  I am happy to recommend this as a camera for everyone.", "Date": "January 30, 2014"}, {"Title": "Amazing Long Zoom Camera", "Author": "Luke", "ReviewID": "R314X98FCIS9GZ", "Overall": "5.0", "Content": "This camera is great for someone looking for DLSR quality without the complication of the DSLR. I really love this camera!", "Date": "January 26, 2014"}, {"Title": "Nikon COOLPIX P520 - Good Buy", "Author": "Gail-Ann Baptiste", "ReviewID": "R3S4N04Z0YY87Z", "Overall": "5.0", "Content": "A fine piece of equipment, it works well and i recieved it in good time and good condition, it works just as good as advertised.", "Date": "January 20, 2014"}, {"Title": "Great so far.", "Author": "JANE BENROTH", "ReviewID": "R1DX9PSWXAYPUX", "Overall": "5.0", "Content": "Got this for Christmas gift. This is taking very nice pics for point and shoot. Very easy. I am not ready for DSLR.  Just want something that isn't a phone and takes nice shots of my grandkids, wildlife.  Does better than a phone.", "Date": "January 16, 2014"}, {"Title": "Great Semi Pro Camera", "Author": "Ilse Cornejo", "ReviewID": "R1PFTQ1GQ9GBH5", "Overall": "5.0", "Content": "Wonderful camera, exceed my expectations!!! It is easy to manage it, great quality of picture, even at night without using the flash-.", "Date": "January 15, 2014"}, {"Title": "luv it", "Author": "debbie", "ReviewID": "R22MUB4HMFFERF", "Overall": "5.0", "Content": "awesome purchase bought it for my daughter and first day out with camera she did not pick up her cell phone all day that is amazing she very much enjoyed her new nikon", "Date": "January 11, 2014"}, {"Title": "Excellent camera", "Author": "Andrew  P. DiMartino", "ReviewID": "RYT8IBI76NI82", "Overall": "5.0", "Content": "Excellent high end camera for a beginner or intermediate user. It would be a 4 star camera for an experienced person who had other cameras. The camera has numerous features and will take a while to perfect a good command of the features and provides excellent results. In addition to my use I have introduced this camera to my family and it will most certainly exceed their needs for a good while and provide a lot of enjoyment", "Date": "January 9, 2014"}, {"Title": "Super camera, great price", "Author": "Claudia McCaffery", "ReviewID": "R2LFXD24RIPZZ0", "Overall": "5.0", "Content": "So many easy to use features and a great zoom lens. Can't believe how close we can get.Very satisfied.", "Date": "January 8, 2014"}, {"Title": "Came Early: What is not to love", "Author": "Hayden", "ReviewID": "R2L495VFZTII13", "Overall": "5.0", "Content": "I am thrilled with my camera and my neighbor has the same camera except black....My RED camera is a show stopper! I enjoy the ease of use and am even putting together videos of our grand baby.", "Date": "January 4, 2014"}, {"Title": "Great Camera", "Author": "Antonio", "ReviewID": "R2RFC4K3OQCUM7", "Overall": "5.0", "Content": "I gave this camera to my girlfriend and she loves it, it's a very good product, we are not photography pros but I think this is an excellent product.", "Date": "January 3, 2014"}, {"Title": "Nikon Coolpix p5209", "Author": "nml", "ReviewID": "R2TWPZBO31W0GA", "Overall": "5.0", "Content": "Best camera I have ever had. It is user friendly. The features are easy to navigate and the pictures are beautiful. It is lightweight, easy to charge.  The computer program for editing pictures is also user friendly.  I absolutely love it.", "Date": "January 3, 2014"}, {"Title": "Great Camera", "Author": "Cloud", "ReviewID": "R2UW5T7VERJ6EA", "Overall": "5.0", "Content": "I normally use a larger 35mm but this one is great for the family to use plus the video is good quality.", "Date": "January 3, 2014"}, {"Title": "Great point and shoot camera!!!", "Author": "Kristy", "ReviewID": "R32AE5VTG6EQA4", "Overall": "5.0", "Content": "Great camera!  Great price!  Pictures are amazing!  If you don't want to deal with changing lenses, this is the camera for you.", "Date": "January 3, 2014"}, {"Title": "User Friendly with Great Quality!", "Author": "Cinthya Gomez", "ReviewID": "R1RIX1BN1K7ODV", "Overall": "5.0", "Content": "Totally user friendly camera, totally met my expectations and it has so many functionalities that you can take advantage and learn from as a non-professional user! Loved it!", "Date": "January 2, 2014"}, {"Title": "Getting back into a great hobby", "Author": "ARTHUR KEATING", "ReviewID": "R2CI4PQ5B2RAS", "Overall": "5.0", "Content": "Easy to handle and pictures and video are great. Good camera for somene like myself who has decide to get back into photography at a different level", "Date": "January 2, 2014"}, {"Title": "Great Camera", "Author": "Louis D Williams", "ReviewID": "R2F9FH151F5B2J", "Overall": "5.0", "Content": "We visited the grand canyon a few months ago with only a 12mp pocket camera to record our memories. We were very disappointed with the results. We needed a much better camera that was not too pricey. The holiday sale of this excellent camera made it affordable. Excellent pictures with easy options. Wow we love this nikon. The zoom is just unbelievable. Great buy.", "Date": "December 31, 2013"}, {"Title": "excellent product", "Author": "Rosa Isela Ramos Galvis", "ReviewID": "RMHJQ6DT0TT8W", "Overall": "5.0", "Content": "the camera is easy to use and the pictures are very clear. The camera is excellent. I love it. I recommend", "Date": "December 31, 2013"}, {"Title": "Best Camera!", "Author": "Jenny", "ReviewID": "R3HGJCGQBMM6GL", "Overall": "5.0", "Content": "What an amazing camera, it is very easy to use and it takes very clear pictures and videos. I would recommend this camera to everyone.", "Date": "December 30, 2013"}, {"Title": "excellent product", "Author": "Paulo Ricardo Zaniboni Gomes", "ReviewID": "R2PS0935T38HSZ", "Overall": "5.0", "Content": "best cost benefit in the market. The camera fits perfect to regular use and is a good starting point for a professional project.", "Date": "December 19, 2013"}, {"Title": "great camera", "Author": "Npolefox", "ReviewID": "R2AGY3CWSAJRM0", "Overall": "5.0", "Content": "love the Nikon Wi-Fi... took over 700 pictures on my vacation and they are great  really a good camera recommend highly", "Date": "December 18, 2013"}, {"Title": "Great camera", "Author": "AlejandroGonzalez", "ReviewID": "R19YANKTPVBDX8", "Overall": "4.0", "Content": "The camera is great, the zoom is really something, however you've got yo get to know it to take advantage of al the funtions, love the flip screen, battery is not too bad, although I bought a cople more just in case, happy with this one..", "Date": "December 18, 2013"}, {"Title": "Love it", "Author": "catawnya", "ReviewID": "R3TGYT07Q1IT1D", "Overall": "4.0", "Content": "This camera is great and easy to use. The only reason I didn't give it a five star is because it doesn't have a RAW setting :(.", "Date": "December 6, 2013"}, {"Title": "Dealbreaker EVF", "Author": "MysticJaguar", "ReviewID": "R26VLCCFZ3Q3C3", "Overall": "3.0", "Content": "You can tell that Nikon is really trying these days.  Back in the mid-2000's when the Digital Rebel was kicking up it's heels it seems Nikon had no clue on how to compete in the lower end of the digital market.  Today things are different.  I had a few Panansonic FZ cameras but abandoned them when the UI was getting long in the tooth and Panasonic was distracted.  I've since moved onto M 4/3 cameras and am generally happy.  Except when I need some lens reach.So I'm shopping around again.  I think Nikon is really trying in this compact segment of the market.  The P510 had alot going for it.  (The P510 was the breakthrough camera.  The P520 is more treading water and has some issues that make the P520 a misstep (battery life, focus hunting for most of the long range, etc.)  So my experience is one of shopping for a travel zoom and I've been doing a lot of research and putting hands on these cameras before purchase.  The IQ of the P510/P520 is really good for the compact segment.  The body design overall is nice.  The menu system is adequate.  However, personally, I really like the experience of a viewfinder.  A viewfinder really can put you into the scene and really concentrate on composition.  It is quite important.The problem is that the viewfinder on the P510/P520 is tiny.  I could not believe how small it was.  I felt like I was looking through the window of a very small fairy house.  It is not a usable viewfinder.  In fact it's almost like not having a viewfinder at all.  Note to camera makers:  *** 201,000 dot EVF is a joke *** .I don't know if Canon and Nikon and the rest realized this.  But the market is ripe for a small camera with a good sized viewfinder for $300 price point.  The Canon SX500/510 is a terrific sized small camera.  If you put a solid EVF on that kind of platform sales would go through the roof.  Stop playing the megapixel wars (this is happening now with settling back to 12-16 MP), stop the hyper zoom wars (50x is just silly), settle on quality, not just specs, and put a blessed viewfinder that is really good (1,440,000-dot) on a small body of decent zoom (max 24x to 30x) and watch a stellar hit in the making.I've decided to get a Fujifilm FinePix HS50EXR 16MP Digital Camera with 3-Inch LCD (Black) to quench my long lens urges.", "Date": "February 24, 2014"}, {"Title": "TOP POINT AND SHOOT CAMERA", "Author": "George M. Gill", "ReviewID": "R22FW8VOJYT52U", "Overall": "5.0", "Content": "I purchased this camera as a good traveling camera for a European vacation that did not materialize. I find it even works well shooting my grandchildren's soccer games as the shutter can be set at a high speed priority. Quite different from the older film Cannon camera I had years ago.A fantastic zoom.", "Date": "October 7, 2013"}, {"Title": "Great camera", "Author": "cjbook", "ReviewID": "R2GGIMZJPTWNK9", "Overall": "5.0", "Content": "This camera takes wonderful photos with very little effort.  In fact it is hard to mess up a picture. One needs to know very little about the technical aspects of photography to get very good photos. The only thing I was disappointed with is the video function of the camera.  When taking videos, the camera does not focus well when panning to different subjects at varying distances from the camera. But other than that, it produces high end photos with the ease of a point and shoot.  Also, the 42x zoom is spectacular.", "Date": "June 16, 2013"}, {"Title": "NOT the camera for you.", "Author": "Fox2010", "ReviewID": "RZ9HDW2LMCJBE", "Overall": "2.0", "Content": "A friend let me demo his Nikon P510 (I think it was) for some airshow pics about a year ago. The camera had a very tough time locking focus on ANYTHING moving or still. Bizarre. Nevertheless, I decided on buying the upgraded Nikon P520 in hopes that my friend's camera was somehow defective. Sadly, this camera is exactly the same. Very disappointing. Even if you get lucky and the auto focus locks in where you want, many of the images are soft. Color is decent. Video however looks great. But I returned the P520 immediately. If you're looking for crisp images, you might be surprised at these recommendations which I feel found that elusive sweet spot in the mega-pixel/image processor dance: The Sony H50 (the Carl Zeiss lens unfettered by excessive noise is something to behold) and the Canon SX40 (which is what I just bought and am loving it). Good luck.", "Date": "October 28, 2013"}, {"Title": "Cheaply made", "Author": "Gordonaw", "ReviewID": "R2FA6NJQJQS51D", "Overall": "2.0", "Content": "This camera has lots of good things, but is cheaply made, focuses very slow and is hard hold the focus.", "Date": "August 31, 2013"}, {"Title": "Great Camera", "Author": "Pogo", "ReviewID": "RELKJRC38LC2N", "Overall": "5.0", "Content": "Great camera for retired RV'ers. Easy to use, great pictures, will hold hundreds of photos provided you have a memory card installed.", "Date": "January 9, 2014"}, {"Title": "2 Mos & Will Not Turn On", "Author": "N. Brewer", "ReviewID": "R3KAIKME0M3M37", "Overall": "1.0", "Content": "I received my Nikon Coolpix P520 on 10/18/13 and was quite happy with the camera - also invested in the Nikon WU-1a, which worked flawlessly, and two expensive, fast photo cards.  Total cost of about $650 - no small thing.  I used the camera exactly 10 times over a 5 week period, the last use was on 11/11.  I picked the camera up on 12/11, prior to an important trip where I planned to use it, and it would not turn on.  I assumed that the battery had drained while not in use (?) and charged overnight.  Morning of 12/12 I put the camera in my purse and off we went.  Upon arrival at our destination, I tried to use the camera again and it would not turn on.  I've attempted charging, connecting to my laptop, removing and replacing battery, nothing will make this camera turn on.Net-net, I've invested $650 in a camera with accessories that allowed me to use it TEN TIMES over a FIVE WEEK period. Since I did not attempt to use the camera between 11/11 and 12/11, I missed the Amazon return deadline and am now stuck with a very expensive piece of garbage.  Shame on you, NIKON!  I thought I was making an investment in a trusted brand, but I cannot recommend this equipment.", "Date": "December 20, 2013"}, {"Title": "Owned many Nikons, this one disappoints.", "Author": "Jeffrey Spring", "ReviewID": "R1V2DN6ZUCQX9O", "Overall": "1.0", "Content": "Aperture setting didn't work when it arrived. Also lacked basic features like threads for a UV filter. Slow auto-focus, no infrared assist in low light. But it does have built-in GPS (why I don't know) there are other things for that besides cameras.", "Date": "November 17, 2013"}, {"Title": "Excellent price-product purchase", "Author": "Andres Torresan", "ReviewID": "RYCB9IAPUNL08", "Overall": "5.0", "Content": "Excellent camera, lot of programs to configure and really easy to use for a begginer like me. Really powerful zoom", "Date": "July 12, 2013"}, {"Title": "Nikon p520", "Author": "MOHD AL FADHALA", "ReviewID": "RIVZSVIRBJP2A", "Overall": "4.0", "Content": "As a compact camera it is good, i took more than 300 photo in Paris,evel tower,desny land,versi palace and the museum and got very good pictures even in low light.the Wi-Fi WU-1a accessory  i bought from Japan ($50) is good i am using it  for my Nikon D7000 as well  and transfare photo to my computer and my iphone.so i recommend this camera", "Date": "June 5, 2013"}, {"Title": "Love this camera!", "Author": "Anonymous \"N. Haight\"", "ReviewID": "R2HHCDB2NC1Q62", "Overall": "5.0", "Content": "The zoom is amazing!! The photos have amazing clarity. Buy a large capacity memory card. I use this at all my daughter's sports games!", "Date": "June 5, 2014"}, {"Title": "coolpix camera", "Author": "Amazon Customer", "ReviewID": "R3FVASIQTS74A9", "Overall": "5.0", "Content": "I have just started using the camera...I SOOO LOVE IT!!! I am still learning...cant wait till i know everything about it!!! :-)", "Date": "June 1, 2014"}, {"Title": "Incredible photographs", "Author": "Brian James", "ReviewID": "R2V7BDJPZA36L9", "Overall": "5.0", "Content": "Nice zoom features and awesome resolution. Bought this for my mother-in-law for Christmas and my wife loved it so much that I bought her one for her birthday. We took it on a cruise and were taking pictures of Jamaica from the cruiseship using the zoom, you would have thought we were across the street from some of the buildings and people we were taking pictures of. Ordered the AmazonBasics fixed zoom camera case and it fits like a glove with the strap attached. Can't beat the zoom feature and picture quality in this price range.", "Date": "May 31, 2014"}, {"Title": "It's Perfect...", "Author": "Shajib Haq Rahman", "ReviewID": "R3N6LQ7GN984NY", "Overall": "5.0", "Content": "Well I bought lots of products from Amazon and almost all of them I Loved.. This Camera is Good.. Quality is very good.. Clean.. High Quality.. All the Pictures taken by the camera is superb.. I recommended it to any body who is not a professional camera man but like or love to take pictures...", "Date": "May 31, 2014"}, {"Title": "Great Camera!", "Author": "Carlos Saborio Badilla \"C. Ivan\"", "ReviewID": "R2ZJ21MXTRMLJM", "Overall": "5.0", "Content": "This little baby is awesome! Im really impressed with the Zoom, usually when you take pictures the images are blurry and low quality, this camera makes it look like I was right next to what ever I shoot.It could be better in low light conditions but overall Im really satisfied with it.Great point and shoot camera but also comes with some pro features.", "Date": "May 30, 2014"}, {"Title": "hate luging gear", "Author": "Thomas Seasholtz", "ReviewID": "R2FMAS4VDCY4OC", "Overall": "5.0", "Content": "the nikon p520 is what i like. no extra gear to lug around. great vido with pause great feacher.and a long reach 1000 mm. must i say more tom", "Date": "May 28, 2014"}, {"Title": "LOVE this camera !!!", "Author": "C Lee", "ReviewID": "R1XKCC990PWJZ8", "Overall": "5.0", "Content": "I finally took the big step up from a pocket camera to this one and I am so very glad I did. The small camera was great for being able to take pictures whenever and where ever I went. With this camera I have to think ahead and be sure it's with me. No big deal... my phone can take photos when I don't have this camera with me. For those moments I can anticipate, this camera is fantastic!!! The photos are beautiful. It's easy to get started quickly with the auto setting. It can be as simple or as complicated as you want. I think it is a great camera for learning about photography and all the settings and options available on high-end cameras. I look forward to learning more and taking more creatively spectacular photos.", "Date": "May 18, 2014"}, {"Title": "not impressed", "Author": "GK \"genkup\"", "ReviewID": "R3JQ3XTW0BS7BJ", "Overall": "2.0", "Content": "I bought the camera for my trip to Europe. I didn't want to spend too much money, so I purchased a refurbished one. It turned out the charging device inside the camera didn't work. It came with a fully charged battery, which lasted for the 1st 2 days. Then I had to switch to my cell phone camera. I returned the camera after the trip.I wasn't impressed with picture quality either. They are OK, but not great. I expected more from an 18 MP camera.I gave it 2 stars because it worked for the full 2 days.", "Date": "May 8, 2014"}, {"Title": "A Lot More Camera Than I Expected", "Author": "P. Williams", "ReviewID": "R1VPR0QXXQCXOG", "Overall": "4.0", "Content": "The P-250 is a lot more camera than expected. As soon as I master a capability the camera has I discover even more functions that are even more useful. I purchased the P250 for an upcoming trip to Alaska knowing the big zoom capability would be a big plus but now expect this camera to be an all around great camera. While it's not magic in the point and shoot mode, it can produce outstanding images with the proper settings.", "Date": "May 7, 2014"}, {"Title": "Nikon CoolPix P520 18.1 Digital Camera", "Author": "Pete", "ReviewID": "R334GXN48Z7ANG", "Overall": "4.0", "Content": "This camera takes very crisp pictures and the zoom works great. This camera has image stabilization too. The movie functionworked well too.The only thing is that it is a little slow to start up and has no manual focus ring - but you can assign the side zoom control to do manual focus.The camera is slow to store the image just taken.I like to take pictures of aircraft that fly over my house, due to the longer picture storage time, I only get to take one.This camera does great if you can put it next to stationary pole or something while taking a high flying aircraft witha contrail.This is a great snap shot camera too.", "Date": "May 6, 2014"}, {"Title": "My first nice camera", "Author": "Ford guy", "ReviewID": "R1Q6HTYN5XOTPP", "Overall": "5.0", "Content": "Have always played with photography but nothing serious.  Decided to step it up a few notches with this Nikon P-520.  Am very happy with the initial results.  Took pictures of the the lunar eclipse in April with fantastic results.  Have even signed up for a photography course at a local college", "Date": "May 5, 2014"}, {"Title": "Electromax is a GREAT Amazon Dealer", "Author": "Keith E. Nelson \"Keith & Diane\"", "ReviewID": "R2NYSWEWV7QQBL", "Overall": "5.0", "Content": "I recently purchased this camera and after I got it and tried it, did some research, decided I wanted to \"upgrade\" to a Coolpix P600.  Electromax was very professional in handling my return.  I will definitely do business with them again.  Thank you, Electromax :)Diane Nelson", "Date": "May 1, 2014"}, {"Title": "Great", "Author": "michael mccall", "ReviewID": "R3QGVGHMR2S6AJ", "Overall": "5.0", "Content": "This camera is like a brand new one. I haven't gotten to used it totally yet,but just a few pic's I've taken were absolutely beautiful.", "Date": "May 1, 2014"}, {"Title": "slow", "Author": "David O'Neil", "ReviewID": "RF492RY1RTHPE", "Overall": "3.0", "Content": "The zoom is nice.  But the autofocus is really slow.  I use the zoom to creep up on wildlife.  But it is often too slow to get the moment I'm trying to capture.", "Date": "April 29, 2014"}, {"Title": "Good camera", "Author": "Jacob Bramm", "ReviewID": "R15UKTEYQHSL4B", "Overall": "4.0", "Content": "The image stabilization isn't all that it's cracked out to be; when you're zoomed in most or all of the way, things get a little blurry.  Otherwise, it's the most applicable camera for our needs.  Recreational photographers just looking to take photos randomly, at events like baseball games or on trips of the scenery.", "Date": "April 26, 2014"}, {"Title": "Super zoom", "Author": "J. Gochenouer \"loves the outdoors\"", "ReviewID": "R22BQNZR5NYMGE", "Overall": "5.0", "Content": "This is a great little camera that in some ways outperforms my D600. Near professional quality and a very bargain price. Too bad that it won't output Raw files but the zoom is amazing for such a little camera.", "Date": "April 25, 2014"}, {"Title": "Great Starter camera for amateurs seeking professional results", "Author": "Christina Dvorak", "ReviewID": "R2JQ2SUYI7MJ3G", "Overall": "5.0", "Content": "I purchased this camera in September 2013, after recieving my financial aide return while in college. I was looking for a moderately priced, decent quality camera to use in the early stages of my development from a hobbyist to a professional. I work in performance photography, though I also work the occasional wedding or personal shoot.From distances of up to 40 ft away, through smoke and fog machines, you really can't argue with the performance of this camera. I shoot from the sky most of the time, and despite interference from the environment, I get my shot every time.", "Date": "April 21, 2014"}, {"Title": "Great fit", "Author": "Thomas G. Malone", "ReviewID": "R3M3NCSVLXBQV9", "Overall": "5.0", "Content": "Very satisfied with this purchase.  It was as advertised and I like the feature of 2 separate zip pockets on either side of the bag.", "Date": "April 19, 2014"}, {"Title": "Great everyday camera!", "Author": "Christie Park", "ReviewID": "RS2K1QEWGXF5M", "Overall": "5.0", "Content": "I have been looking for a camera for a long time and I have fallen in love with this camera.  I am still working out all of the little bugs but this is a great point ad shoot camera!  I use it to take photos of my kids playing lacrosse and football.  The picture quality is really impressive and the battery life is much better than I expected!  I highly recommend this camera and the price point is fantastic as well!", "Date": "April 18, 2014"}, {"Title": "Absolutely awesome!", "Author": "Kimberly Augustine", "ReviewID": "R2DRZBOCSLZR9S", "Overall": "5.0", "Content": "Arrived on time. Exactly as described. Brand new and perfectly the best. I just loooooooooooooooooooooove Nikon. First time buying this camera and I don't regret it. If there are any bad updates, I'll let you know. But this camera is amazing and I would definitely recommend it to anyone.", "Date": "April 15, 2014"}, {"Title": "Nice camera!", "Author": "Allen R. Myers Jr. \"armsam\"", "ReviewID": "R3FQ3UZGX5M3SF", "Overall": "5.0", "Content": "Nice camera takes great photo's with the zoom. Battery life is very good.Love the flip, tilt and view screen for the best shots.", "Date": "April 13, 2014"}, {"Title": "Awsome camera", "Author": "pure.made", "ReviewID": "RQ7CM19WO0RNO", "Overall": "5.0", "Content": "I bought this camera and I'm totally in love with it. It's by far on of the best cameras I have bought. The quality of the pictures are amazing and the video quality are stunning. I'm 100% satisfied with this product and I highly recommend it...", "Date": "April 3, 2014"}, {"Title": "I love this camera", "Author": "victor zuber/susan zuber", "ReviewID": "R208YE4ZK414XC", "Overall": "5.0", "Content": "This is a great camera that is both easy to use and yet can offer the flexibility to use it manually.", "Date": "April 2, 2014"}, {"Title": "Nikon Coolpix", "Author": "Patrick L Cote", "ReviewID": "RWVRKBHQ06JF2", "Overall": "5.0", "Content": "This is a great camera. I was looking for a good camera with a 42x zoom lens for my private investigation business.", "Date": "March 21, 2014"}, {"Title": "OK in general but not so good for wildlife", "Author": "Jack Gentle, Jr.", "ReviewID": "RMN5AVUAC5FP6", "Overall": "3.0", "Content": "Camera has very good glass and can take very nice photos.But lens zoom is too slow. Focus is too slow and won't focus on something mostly grey, like a small grey bird. Shutter lag is too slow so if subject is active, you won't get what you intended when you pressed the shutter release button. Manual focus is basically unusable for wildlife photography.Very nice camera for general walk-around photography but disappointing for wildlife, unless subject is stationary.", "Date": "March 15, 2014"}, {"Title": "Wife loves it", "Author": "joey boy", "ReviewID": "R2TIJXRE5UKS2M", "Overall": "5.0", "Content": "Takes great pictures and works fine...took a little for her to get used to it...but she loves it...Thank goodness, never hear the end if she _____________!!!", "Date": "March 7, 2014"}, {"Title": "One of the BEST!", "Author": "Ole organic farmer \"Micheal W. Adkins SR.\"", "ReviewID": "R15IQQ3IO1RH94", "Overall": "5.0", "Content": "Since I have the love for taking pics of wild life, I made the choice to spend a little extra money to improve the quality of my photos! Not only has it made a huge difference in the photos but with the GPS turnned on, you don't have to keep stopping to write down where you where when you took the pics....In 1 word, Fantastic", "Date": "February 22, 2014"}, {"Title": "Great purchase", "Author": "A. Brown", "ReviewID": "R3VEY0J7QWQEMZ", "Overall": "5.0", "Content": "it takes amazing photos of my artwork, can't wait to take it on my vacation! I absolutely recommend this camera!", "Date": "February 21, 2014"}, {"Title": "Not good for high speed", "Author": "SAKunz", "ReviewID": "R2UZDPJGRC9VLE", "Overall": "3.0", "Content": "One of reasons I bought this camera is because I wanted good action shots. I am not getting the results I was looking for.", "Date": "February 18, 2014"}, {"Title": "Great 1st time DSLR camera.", "Author": "James Jeter", "ReviewID": "RNQC907MU43ZT", "Overall": "5.0", "Content": "After reading the many reviews from several sites about the camera I decided to buy it.  I purchased this from Amazon because of the price and  freebies included and off course free shipping because of Amazon Prime.Since this is my 1st DSLR camera I suspect some of the problems I am having are user error.  I do agree with most reviewers that the camera takes a bit of time to focus when using the zoom feature.  The battery life has been very good.  I am enjoying using the many features of the camera and have captured several fantastic photos.  I love this camera.", "Date": "February 15, 2014"}, {"Title": "My Third Nikon Coolpix", "Author": "Shara", "ReviewID": "R3T959I94BVOQ6", "Overall": "5.0", "Content": "Love the 42X Zoom Lens, compact good battery life with rechargeable lithium batteries, red case instead of black, etc.Also like the ease of operation and the new adjustable viewing screen that can be folded back on itself protecting the screen.", "Date": "February 13, 2014"}, {"Title": "Good, but spends too much battery", "Author": "Amazon Customer", "ReviewID": "R3P3ZUZ7F4NJ6N", "Overall": "3.0", "Content": "The quality of the image is good, there's a lot of controls to help you make that goodlooking photo.But, for me, it spends to much battery, especially if you turn the GPS function ON. It drains you battery very quick (half a day of shooting). The zoom is not manual, so every move uses the battery juice. If you turn the camera off, the zoom is drawn back, with the battery's juice.There's not real manual Focus. For me, it is important. I like to be abble of focusing on my own.So, I returned it and purchased a Fujifilm Finepix HS50exr. Much better in my opinion.", "Date": "February 11, 2014"}, {"Title": "GREAT CAMERA!!!!!", "Author": "Tony Fasani", "ReviewID": "R2HTO0MV6S088U", "Overall": "5.0", "Content": "Great for beginners and advanced photographers. Easy to use. Delivery was on time and as advertised. Takes great action shots and movies as well.", "Date": "February 11, 2014"}, {"Title": "very surprised", "Author": "TOMMY G.", "ReviewID": "RXLVIQCHP0Y2F", "Overall": "4.0", "Content": "Very nice camera for the novice. I would recommend this product to all my family and friends.  Very nic nikon", "Date": "February 8, 2014"}, {"Title": "Great camera", "Author": "Wayne Morris", "ReviewID": "RE6GBF64UQVBP", "Overall": "5.0", "Content": "Took the word of a friend and wee are not disappointed  here. Quality pictures. A great zoom. The battery life seems to last to.", "Date": "February 8, 2014"}, {"Title": "Great zoom!!!", "Author": "Hidalgo", "ReviewID": "R1XLDNISVFPQMT", "Overall": "4.0", "Content": "Great camera, excelent options, perfect quality image. The only problem is the filter adapter kind of hard to install, I'm affraid to damage the objectif.", "Date": "February 5, 2014"}, {"Title": "Love this camera", "Author": "just me", "ReviewID": "R1UYN32NEUVJ4V", "Overall": "5.0", "Content": "We have loved this camera. The wide variety of settings combined with the awesome optical zoom are amazing.We have been happy with its performance for both interior and exterior shots. I have been able to take great shots at tremendous distances while visiting national parks. Although the zoom may take a second to autofocus, I have still managed to get great shots. It has also made some great pics when we were at a hockey game and I was shooting from near the other net. (We looked at the photos just last night and you could see the goalies facial expression behind the mask.)I have recommended this camera and the P510 to both my brother and my girlfriend. They have been extremely happy with the camera from it's ease of use to its great picture quality. (Yeah I know its not an SLR but I didn't pay for an SLR so I am fine with that)I bought two extra batteries and a wall charger for under $20 dollars so I do not do the plug in and charge the camera routine. That did seem like a pain.Hope this helps.", "Date": "February 5, 2014"}, {"Title": "what a nice camera???", "Author": "kimathi", "ReviewID": "R202ER4PYZEB8H", "Overall": "5.0", "Content": "This an awesome camera. Have used this camera for the last one week and really works very well, very nice photos and videos.", "Date": "January 26, 2014"}, {"Title": "Love this camera!", "Author": "Max Fox", "ReviewID": "R21WLIVFTGR3K9", "Overall": "5.0", "Content": "I love this camera. It feels solid, its easy to use and the pictures come out amazing. I thought for the price, its perfect.", "Date": "January 25, 2014"}, {"Title": "Nikon Coolpix Cameta", "Author": "Sheri Martin", "ReviewID": "R13VQSYB38VKJT", "Overall": "5.0", "Content": "Love this camera!  This camera is easy to use, takes great photos and I adore the fact it came in red!", "Date": "January 23, 2014"}, {"Title": "excelent", "Author": "Víctor Ordaz Rojas", "ReviewID": "R3BRLZQ90JQRIV", "Overall": "5.0", "Content": "it's perfect i love it. on two moths i want to buy the accesories. thank amazon for your responsability .", "Date": "January 23, 2014"}, {"Title": "All was very good", "Author": "Santiago González Hidalgo", "ReviewID": "R2GOT9Q8KTZIAV", "Overall": "5.0", "Content": "All good with the camera is an excelent product. I recomended it for all the buyers of Amazon. Is an excelent camera and a good price", "Date": "January 20, 2014"}, {"Title": "Nikon Coolpix P520", "Author": "Tim G.", "ReviewID": "R2E8BJIMOFTH4M", "Overall": "4.0", "Content": "To keep it simple this camera is most all of what it is advertised to be.  A couple of things that improve on it.....  A lens threaded for filters - no such provisions.  Also, provisions for an electronic remote shutter release would be of great aid when the lens is all the way out.  I would hope to see these added features on a next upgrade to this model by Nikon.", "Date": "January 14, 2014"}, {"Title": "It is all that is advertised.", "Author": "Eric Robinson", "ReviewID": "RL4EXPK6WEMBM", "Overall": "4.0", "Content": "Amateur here. This was a Christmas gift to a sophomore that wanted a \"professional\" camera. She is very tech savy & loves this camera.Dad on the other hand still has his old Nikon equipment, no older, not digital. It was called film then, pretty cool, lots of process, but still some great photographs.Today Dad did not want her to lose lenses & caps and light meters (really) so this was our choice.She's happy, Dad is happy & it does take very good photographs.We have good printers, but not great printers so we are very happy.", "Date": "January 13, 2014"}, {"Title": "Great for the avid picture taker - not yet a armature photographer", "Author": "pat-93", "ReviewID": "R1EUOBXO9A2NC0", "Overall": "5.0", "Content": "I am a photographer who shoots with a Nikon DSLR. I bought this camera for my sister who likes to take pictures but does not want to use a huge piece of equipment. So after looking around I decided to get her the P520. The swivel screen, large MP and the 42X zoom made my sister happy.. the Nikon Lens, possessor and other special functions make me happy.It is a great camera! I love it and I think you will to.", "Date": "January 10, 2014"}, {"Title": "Getting to like it.", "Author": "jl", "ReviewID": "R1L5GHBXGYZ6JK", "Overall": "4.0", "Content": "When I first got this camera, I was a little disappointed by some of its features, but the more I learn to use it, the more I like it. I carry it as a companion to my Nikon 7000 and use it for great close up pictures, insects and the like and far away zoom pictures.", "Date": "January 7, 2014"}, {"Title": "More than worth the Price.", "Author": "Judy Crawford \"Judy Crawford\"", "ReviewID": "RWLCCA175B008", "Overall": "4.0", "Content": "This item was a gift for another person but since I have one two generations earlier, I was able to play with it to quickly get an opinion on it's features and improvements. Everything about it is much better than my version... good clear, sharp, true to color photos and easy to use.My only complaint would be that it is still sometimes difficult to focus/see what you are trying to get a pic of, either with the view finder or LED screen.All in all, I love it, my friend, who is right next door where I can continue to see how it performs, loves it. It's more than worth the price I paid for it.", "Date": "January 7, 2014"}, {"Title": "Not really very good", "Author": "Grumpybear \"grumpybear\"", "ReviewID": "R7TJQV9AX3SMX", "Overall": "2.0", "Content": "Just took on a European vacation thought it would be ideal for travel pics.  On-off button and shutter button worked intermittently making it unreliable and difficult to grab a quick photo of something.  Focus is not so bad as to be called soft, but it isn't sharp and crisp.  Battery life was usually good, but went dead without any warning.  Most photos needed Photoshop work before printing because they were very flat and dull.  I'm comparing this to my wife's Panasonic which was reliable, took sharp bright photos which didn't need any preprinting work.  To say I'm disappointed is an understatement, I'm going back to my 3-year-old Canon.", "Date": "January 6, 2014"}, {"Title": "Wide zoomer", "Author": "Bonnie Billman", "ReviewID": "R3UV0DBJ81V3W0", "Overall": "5.0", "Content": "I haven't used it much, but it works and looks great. I love the wide zoom. It will come in handy.", "Date": "January 6, 2014"}, {"Title": "Bad Focusing", "Author": "Michael Davis", "ReviewID": "R2VMC5G2LVBNNF", "Overall": "1.0", "Content": "Camera looks nice but does not work as it shouldIf you zoom the camera tries to focus for some time and then indicates that it can not focusOr it shows that it is in focus, but after you transfer images to computer many images are not in focus", "Date": "January 5, 2014"}, {"Title": "just right", "Author": "Misia", "ReviewID": "R3UR91NMZYG5U8", "Overall": "5.0", "Content": "A good entry level camera for anybody with an interest in photography. The included software is very limited, but offers basic functions.", "Date": "January 4, 2014"}, {"Title": "GREAT CAMERA  EXCELLANT  SERVICE", "Author": "RONALD J RUBINO", "ReviewID": "R1QL6YPY08K7LC", "Overall": "5.0", "Content": "GREAT CAMERA  WAS A CHRISTMAS GIFT  FOR MY  SON I OWN THE  500 P  AND IT S A GREAT CAMERA  ALSO", "Date": "January 2, 2014"}, {"Title": "camera bag and memory card", "Author": "Debbie", "ReviewID": "R3PIU67Z4OKGEY", "Overall": "5.0", "Content": "I love my new camera, I was suppose to receive a camera case and a memory card which is why I decided to order from amazon and  not the other one I was looking at. I never received it and was wondering it's status??", "Date": "January 2, 2014"}, {"Title": "Beautiful pictures", "Author": "James Parker", "ReviewID": "R2RC3UCZZ3FBQS", "Overall": "5.0", "Content": "Pictures are bright & crisp.  Burst mode is great but need the right SD card to be fast enough to keep up.", "Date": "January 1, 2014"}, {"Title": "nice camera, good price", "Author": "Daniel Taylor", "ReviewID": "R1FOYEWI4CNZ0O", "Overall": "4.0", "Content": "Camera is fine.  I didn't expect the metallic red color, but I like it.  Different.It would have been helpful if you'd specified that the package included a rechargeable battery and charging unit.  Not being sure about this, I ordered, separately, a charger and two extra batteries, for $20.  I didn't need to spend this extra money, guys!", "Date": "December 31, 2013"}, {"Title": "The camera is amazing!", "Author": "Rafaella Ferrer", "ReviewID": "R39HQWTSUQFI8M", "Overall": "5.0", "Content": "The camera is amazing! I was looking for a professional one, but I chose this one and I'm not disappointed at all. It's the perfect camera for those who wants a super quality but not a complicated professional camera.", "Date": "December 31, 2013"}, {"Title": "It's a great camera", "Author": "Golcar Rojas", "ReviewID": "R2KTL0M3XWKCNX", "Overall": "5.0", "Content": "I was really amazed about my new camera. It worked perfectly. Shamefully thiefs got in to my house and stole it a few days after I got my camera with me. I will soon purchase another one.", "Date": "December 31, 2013"}, {"Title": "Awesome", "Author": "victor alcantara", "ReviewID": "RJGYYC0WO3AV6", "Overall": "4.0", "Content": "This camera takes excellent pictures!! Makes the pictures look professional in my eyes!! Decent price unlike most cameras of this caliper!!!", "Date": "December 31, 2013"}, {"Title": "MY RATINGS ON THE NIKON 18.1 MEGA PIXELS", "Author": "Hallam Alleyne", "ReviewID": "R16NJB7DIP8ZCS", "Overall": "4.0", "Content": "I saw it advertised on CNN internet news. I recommended it to a cousin ,who eventually purchased a Nikon 14megapixel. what other accessories eg Lenses similair to 55-200mm lenses,cleaning instruments for the lenses. The technolgy I am getting familiar with.", "Date": "December 31, 2013"}, {"Title": "good camera", "Author": "dorisah", "ReviewID": "R21Z330PN1F9D8", "Overall": "5.0", "Content": "Love the pictures that it takes.  The zoom is great.  Used it at a museum without the flash and the pictures came out OK.  Manual on operation is limited.  website is no better.  Have to figure out a lot on your own.", "Date": "December 30, 2013"}, {"Title": "Overall it is fine", "Author": "Krishna Kishore", "ReviewID": "R1K9Q7X4EA9ZO6", "Overall": "4.0", "Content": "It is Good. I like it.Of course there will be some points to note :1) There is no gravity feature (Auto-rotate the photo when you rotate the camera).2) Have to switch on the camera, even for viewing the photos that we took already.Other than the above, I didn't find any issues with the camera. I didnt use GPS feature till now.", "Date": "December 12, 2013"}, {"Title": "Camera met all my expectations", "Author": "Steve Lentz", "ReviewID": "R3AB3JW3QV2BNK", "Overall": "4.0", "Content": "I bought this camera for a trip to Alaska and have thus far taken over 2000 pictures. I'm by no means a pro but the pictures have great color, the camera is easy to use and has some nice features. Only concerns are that the response  in continuous mode seems a little slow and the battery strength indicator doesn't seem to work well (or at all). Overall a nice bridge camera that I would recommend to anyone.", "Date": "June 12, 2013"}, {"Title": "Excessive image noise", "Author": "Gordon", "ReviewID": "R22CQYJEWAUYXH", "Overall": "2.0", "Content": "Nikon did just about everything right with this camera except the image sensor.  The myriad functions are a delight....but useless with such poor image quality.  Even using the lowest ISO setting, the noise levels are unacceptable. Some of the noise problem is the inferior jpeg compression used in the camera and to add insult to injury, there is no RAW image option.  If an indistinct, poorly detailed image is acceptable to you, then you will love this camera!!  Nikon just tried to get too much out of a very small image sensor.  The P510, predecessor to the P520, seems to produce a much cleaner image at 16 megapixels, vs. the P520 at 18 megapixels.", "Date": "July 20, 2013"}, {"Title": "Not Ready for Video", "Author": "Stephen Ryan \"aerialshooter\"", "ReviewID": "R6P6NSA1ZHPPW", "Overall": "4.0", "Content": "I am a pro photographer and teach college level photography.  I am very familiar with many cameras and have owned many Nikon.  The Nikon P520 which I just purchased has too many problems. First, when recording video EVERY time the zoom is used it goes out of focus momentarily, a lot. This is not remedied by changing to the AF-S, AF-F, or turning off auto focus. Second, the manual focus feature in video does not work and can not be applied, i. e., the bad auto focus can not be turned off.  Third, while recording video the camera went badly out of focus on 3 different occasions and never could find focus.  I had to turn the camera off and then reboot it before it could again find focus.  I have been a pro for 29 years, I know of what I speak.Follow up to initial post: I have been in discussion with Nikon and the final word from them is that the camera will always go out of focus momentarily when in video record mode and the zoom is adjusted.AMEND:  See my post dated June 6, 2013.  After extensive use of this camera in still mode I am changing my rating.  It is a very good still camera.  See my June 6 review on my frustration with Nikon and why I previously gave this camera 1 star.", "Date": "March 19, 2013"}, {"Title": "Do not buy from EPICDEALS", "Author": "James Callahan", "ReviewID": "R3F2EB9FXQRWK0", "Overall": "1.0", "Content": "I purchased this camera from EPICDEALS.  It was listed as new.  When the camera arrived it was packaged in a generic white box with a poor quality lazer printed label glued to the box that depicted the camera and some Nikon graphics.  The only reason to not include the factory box is because the item is either counterfeit or refurbished.  I sent them EPICDEALS an e-mail and this is the response:\"we sell new camera in bulk pack that's way they are in whit box and how we can sell them ata lower price if you do not like it and want to send it back we can send you out a USPS lable and we will pay to get the camera back but the camera in new in white box thats how we can get it at a lower price and please let us know what you wold like us to do to keep you happy with us\"Obviously, not a reputable dealer.  This reminds me of the spam/scam e-mails from the Nigerian prince who attempts to defraud you from an internet cafe several thousand miles away.  Amazon claims to care and protect the consumers who use their website.  Ceasing to do business with EPICDEALS would be prudent business practice.  I'm not sure I trust Amazon after this transaction and doubt I will utilize their website again.", "Date": "May 13, 2014"}, {"Title": "Nikon coolpix P520", "Author": "B Zimmer", "ReviewID": "R2BGXGC4HZ7S9P", "Overall": "5.0", "Content": "Got this camera on recommendation of a relative.  I needed something better than my little point and shoot camera for my trip to China.  This is very easy to use, has an LCD screen and view finder.  It has a 42x zoom.  I tried it out on my granddaughter's school program.  It's always difficult to get good pictures in the school gym because of the size of the room and the lighting.  Pictured turned out great.  I also videoed from near the back of the room the song she had a part in.  Came through very good.  It's easy to down load the pictures to the computer.", "Date": "April 28, 2014"}, {"Title": "I love it", "Author": "Regiane Blanco", "ReviewID": "R2IJV7SE6M6ZDA", "Overall": "5.0", "Content": "I loved", "Date": "April 28, 2014"}, {"Title": "It Just doesn't work", "Author": "Diego Martin Perez", "ReviewID": "R119N97ZF9VQDB", "Overall": "1.0", "Content": "The camera is absolutely dead. I have followed the instructions step by step. I have charged the battery until the charger indicated green light for full charge and nothing. Even when I plug the cord as the Manual indicates, there are not lights, not movement nothing.On the other hand, the delivery was delayed by 2 extra days.I'm absolutely disappointed since I was waiting for this camera for a gift and it is not working at all.I will return this back and I will back here to provide a feedback of the \"returning experience\".I would not recommend to buy anything to this seller so far.", "Date": "February 27, 2014"}, {"Title": "Do yourself a favor and try a different camera", "Author": "Robert S Jones", "ReviewID": "R2E90OZ2AEOCQL", "Overall": "1.0", "Content": "I picked up this camera as a Christmas gift for my wife.  The first few shots out of the box were great - mostly stills, between 3 and 15 feet away, indoors with ideal lighting.  If that's the kind of photography you're planning on doing, this is your camera.  Outdoor shots, less than ideal lighting, or anything requiring even minimal zoom were basically worthless.  This camera will not focus in dim or dark lighting, and will not focus when zoomed.  We even tried a tripod, but it just couldn't handle it.  Kind of a shame - the zoom lens on this camera is pretty impressive, but the software just isn't up for the job.  My iPhone camera blows away the P520 in most situations.  We gave this thing an honest try for about 3 weeks, then ordered a Panasonic Lumix DMC-FZ200.  The plan was to do a side-by-side comparison of the two and return the lesser camera.  The Lumix blew away the Coolpix in every single area.  Crisp, clear shots day or night, zoomed or close up, handheld or tripod.  Needless to say the Coolpix P520 was returned a week or so after we got the Lumix.  This camera WILL disappoint you - I definitely would not recommend it.", "Date": "January 29, 2014"}, {"Title": "I just received the product , everything is in perfect condition, the truth is an excellent camera , I am very happy with the pr", "Author": "Carlos Andres Beltran Galindo", "ReviewID": "R3NZ6VEMKEWVXL", "Overall": "5.0", "Content": "I just received the product , everything is in perfect condition, the truth is an excellent camera , I am very happy with the product.", "Date": "December 16, 2013"}, {"Title": "Amazing camera", "Author": "Roberto Shaw", "ReviewID": "R2A9FYAZTIWWY5", "Overall": "5.0", "Content": "I got it for my fiance for christmas and gave it to her early. I can not believe the quality difference for the better in this product compared to her last camera. Very good product.", "Date": "December 14, 2013"}, {"Title": "Great camera", "Author": "John Stuart", "ReviewID": "R3M06K9KYQG1PI", "Overall": "5.0", "Content": "The long zoom lens works rally well but you have to hold it steady.Still trying to get the GPS to work.Everything else is great.I will keep it for a long time and use it a lot.", "Date": "May 5, 2013"}, {"Title": "Nikon P520", "Author": "Stan Arnold", "ReviewID": "R1YIU1EASOQ27", "Overall": "3.0", "Content": "The camera appeared to be in good condition and good working order.  However, it had neither a carrying strap or lens cap with it.  I'm not bothered by the lack of strap, but to me the lens cap is an integral part of camera protection, and I was annoyed that one did not come with the camera.", "Date": "April 5, 2014"}, {"Title": "Awesome", "Author": "Asantha C. Dharmaratne \"freefall\"", "ReviewID": "R2DBCTLIJP2M4V", "Overall": "4.0", "Content": "Really amazed by the zooming power and the quality of the pictures. Lens cap is giving me a hard time, but other than that. this is really good.", "Date": "June 4, 2014"}, {"Title": "excellent equipment and definition", "Author": "Sertec", "ReviewID": "R2SWC88VD14G8V", "Overall": "5.0", "Content": "excellent equipment and definition. Display is very comfortable, and the eye graduation adjustment in the visor  is wonderful. Exceptional video quality.", "Date": "May 9, 2014"}, {"Title": "The best bang for the buck", "Author": "Print Doctor", "ReviewID": "R1X229AQOPK7VA", "Overall": "5.0", "Content": "Did a lot of homework first. Remarkable zoom for the money, easy vacation camera as long as you aren't looking for a pocketable style. No interchangeable lenses to haul around or fiddle with. Up to 16 megapixel lets you do some serious cropping and still get nice clear prints even at 8x10. Ability to switch from screen to view finder is a plus in real bright light, but the screen still lets you see enough detail to frame things up in fairly bright light. Get extra batteries if you are a serious amateur shutterbug, especially in cold weather. But that's true for any rechargeable lithium system. I keep 5 charged batteries with me when on vacation. Usually only need 2 or 3 in a day, but I like the elbow room, knowing there's plenty to spare.", "Date": "April 28, 2014"}, {"Title": "Poor zoom issues", "Author": "James Coffey", "ReviewID": "ROXRDPF8H41CS", "Overall": "2.0", "Content": "This camera was supposed to provide great close ups with perfect clarity.  If you want close ups of any product or photo, standing 5-10 feet from the object the photo on the screen turns blurry when using the zoom, and it is near impossible to get a quality close up.  After multiple inquiries to Nikon, I give up.  They never offer any solutions, except to say you're too close to the object .. \"DUH\".", "Date": "March 7, 2014"}, {"Title": "Very happy niece", "Author": "EVazquez \"NYer\"", "ReviewID": "R5AKKRMVDUSBG", "Overall": "5.0", "Content": "I purchased this camera for my 16-year old niece who is a beginner photographer.  She cried when she opened her Christmas gift.  The camera does everything she wanted it to do.  Sorry that I cannot say more - I am not the user of the camera.", "Date": "March 1, 2014"}, {"Title": "After a few weeks, the zoom doesn't work. Nice...", "Author": "S. C. Dixon Photography \"D. J. DiAblo\"", "ReviewID": "R2DBGL6KVQZSF8", "Overall": "2.0", "Content": "I've been using Nikon products as a pro for over 40 years...I've NEVER had a Nikon break down unless it was dropped/damaged. This little camera has had very little use and already the zoom doesn't function. I'll return it and buy Fujifilm products.", "Date": "January 21, 2014"}, {"Title": "great", "Author": "BigBeefy85", "ReviewID": "R3H61CR46H480D", "Overall": "5.0", "Content": "Package was deliveried on time and in amazing condition. Met all expectations. Would definitely recommend for anyone in the future", "Date": "January 12, 2014"}, {"Title": "It is a pity.", "Author": "chengrong wen", "ReviewID": "R1YT8MYGTN73O7", "Overall": "4.0", "Content": "I like it, but it is a pity that I returned it. After I did it, I'm very regretful for that.", "Date": "January 8, 2014"}, {"Title": "dont really like it", "Author": "julio Aguilar", "ReviewID": "R29H6Z7RPWU4TF", "Overall": "2.0", "Content": "it  does not works at i was told, after having it recording for a couple of minutes shot off, and it did it multiple times.", "Date": "January 4, 2014"}, {"Title": "Zoom issues", "Author": "james Fineout", "ReviewID": "R5Y2WOOGISSUO", "Overall": "4.0", "Content": "When zooming in,  the focus is not as good as it could be , I have taken a couple of thousand photos", "Date": "December 30, 2013"}, {"Title": "Love the camera, but not Nikon", "Author": "Karen Owens", "ReviewID": "R1O2DIRVRJF7FG", "Overall": "3.0", "Content": "I love my new camera. My first experience with Nikon. Would have rated it a 5, except I've had very poor experience with Nikon customer service. The photo software that came with the camera has never worked. I contacted Nikon on 3 different occasions to try and resolve issue. They insisted there is a problem with my computer...well why does my Kodak software work perfectly fine with the Nikon camera? There is a definite problem with the Nikon NX2 software, but rather than work with me try to fix the problem, customer service found it easier to blame my computer, and called it a day. I'm quite disappointed with that type of service, and will shop around for my next camera purchase.", "Date": "January 19, 2014"}, {"Title": "Where is promised card and bag?", "Author": "Stephen Zagelow", "ReviewID": "R2FOZBWQAO86OB", "Overall": "4.0", "Content": "Camera is great as ordered. Purchased 12/1/13 and pricing correct.  But, I never received the card and camera case as promised.  The order confirmation reads: \" Free Memory Card and Bag with the Purchase of this Camera.  Purchase the Nikon COOLPIX P520and get and AmazonBasics compact camera case.\"  How do you contact someone to talk to or when can I expect the card and bag?", "Date": "December 14, 2013"}, {"Title": "Love Nikon", "Author": "Sheran K Becker", "ReviewID": "R3PJZ2JKR8XXF8", "Overall": "5.0", "Content": "Nikon's are the best. This is my 5th Nikon camera, I wouldn't buy any other brand. Easy to use and great picture quality.", "Date": "May 2, 2013"}, {"Title": "Great Camera", "Author": "Monte", "ReviewID": "R2OJ7O66C0GA5M", "Overall": "4.0", "Content": "Met my expectations, still trying to learn many of the functions, My main concern is the battery life, but so far all is great.", "Date": "April 9, 2013"}, {"Title": "Nikon Coolpix p520", "Author": "hedgehog0123", "ReviewID": "R3CMZ06NLZAQWG", "Overall": "1.0", "Content": "Bought this back in November from here, just came around to using it since I was a bit too busy before. Horrible camera! It has awesome manufacturers advertisements and all but in reality it is cheapish looking, the color is way lighter than in the picture and has poor quality. Want to return it but since I bought it off of my other account and cannot find log in info for it don't know how to. The plastic attachments at the end of straps broke the third day of barely any usage even which totally upset me! I thought much better of it until started using, if you want a simple digital camera go with the cheap $80 ones because this one is the same exact as that! Also my box came in all damaged up like someone tried beating it up and I was even scared to open it because I though the screen might be cracked, but it was fine inside.", "Date": "March 6, 2014"}, {"Title": "Horrible instrument", "Author": "F. Pryor", "ReviewID": "R1P4UUYOO1MFX5", "Overall": "1.0", "Content": "The autofocus shutter lag is horrendous and the camera locks up after each and every shot to show you what you've captured on the display, even if you tell it NOT to do that in the menu options.Autofocus itself is slow as molasses, hunts and searches from near to infinity except for the contrastiest of subjects.The eyepiece viewfinder is tiny and all but unusable; absolutely so if you wear glasses.The images it captures may be fine, but good luck capturing them.One star is too many.", "Date": "March 15, 2013"}, {"Title": "Nice Replacement for P500.", "Author": "Harry O.", "ReviewID": "RIXIMP9IEDPAX", "Overall": "5.0", "Content": "My wife purchased a P500 several months back.  It developed a problem in that it would take one picture and then turn itself off.  Sent to Nikon via an authorized repair shop in Jacksonville.  Estimate to repair substantial part of purchasing a newer, updated version with many of the same basic features my wife liked, plus some updates like the wireless transfer of pics to smart phones, etc.  Will try the new P520 out during a visit to Disney World soon.", "Date": "August 31, 2013"}, {"Title": "Botched Order and duplicate charges not good", "Author": "William Cottringer. Ph.D.", "ReviewID": "R3TOPHIOMZCP48", "Overall": "1.0", "Content": "Why in the world would I want to buy something else from an order that was dreadfully botched up. on 12/29/30 I ordered this Nikon CoolPix P520 and compact bag. On 12/30/13 my credit card contained charges for 2 cameras (ordered 1), 2 bags (ordered1)and a 16 gig memory card (did not order) for a total of $784.16 when the total was $383.50. Now I have to return the oneextra camera that I got yesterday 12/30/13 at my inconvenience, and then when I get the second package, this evening or January 2, 2014, with the other camera bag and memory card, which I didn't order, I will have to againre-box the items and return them, after trying to find the right label for the right order to print and attach and then deliver to UPS. On top of that I have to monitor my credit card to make sure thr correctrefund is made or protest the wrong posting ifthat is not done. All very time consuming with no real live person to talk to and understand my frustration.I have been a loyal Amazon customer despite your order botching and trickery in getting Washingto State residents to pay sales tas, regardless of where the merchandise is actually shipped from, taking your price right out of competiveness in my just buying these things from the store, without any such frustration or delays that I am experiencing, and then ending up paying more money for and gas money and time trying to straighten out.I guess you are too big to be concerned about one single very unhappy customer, but please do note thatI do have a very large following on my writing sites as well as some inside communication ability with some of the executives there.I would be greatly appreciative if you could do something about this problem. Thank you for trying to save a good customer. Bill Cottringer", "Date": "December 31, 2013"}, {"Title": "Poor ergonomics", "Author": "R. Johnston", "ReviewID": "R3NKHMRK7LP3BW", "Overall": "1.0", "Content": "It requires one to open and close the monitor screen to make settings and then take photos with the viewfinder.  Not available for a camera one buys for its ability to customize the settings for each group of shots.", "Date": "July 12, 2013"}], "ProductInfo": {"Price": "$379.95", "Features": "Powerful 42x zoom that lets you shoot amazing close-ups\nBuilt-in GPS records the location of each shot you take\nWi-Fi WU-1a accessory (not included) allows you to easily share your shots anytime anywhere\n18.1 MP CMOS sensor for exceptional image quality and enhanced low-light performance.Record videos in Full 1080p HD with stereo sound.\nWhat's in the box:UC-E6 USB Cable, EN-EL5 Rechargeable Li-ion Battery, EH-69P AC Adapter/Charger, AN-CP21 Strap, LC-CP24, Lens Cap, NikonView NX 2 CD-ROM.", "Name": "Nikon COOLPIX P520 18.1 MP CMOS Digital Camera with 42x Zoom Lens and Full HD 1080p Video (Black)", "ImgURL": "http://ecx.images-amazon.com/images/I/415JCm8qJvL._SX300_.jpg", "ProductID": "B00B7O1CY6"}}