{"Reviews": [{"Title": "ZR400 is fantastic camera for Nepal Trek", "Author": "cotty lowry", "ReviewID": "RVF32UJXJ5IZM", "Overall": "5.0", "Content": "I took it on a 17 day trek around Annapurna in Nepal.  Very little electricity there so the huge battery life was the initial reason I purchased the ZR400.  However what I came to love about the camera was the low light and best shot features in the software that allowed me to photograph the interiors of Buddhist temples (with permission of course) without using flash.  The Best Shot feature was used for most of my photos because of the contrast between blue sky, snowcapped 26,000 ft peaks and river valleys -- all in the same shot.I purchased a 2nd battery as a backup, but never needed at all, in fact with periodic charging never even came close to running out of battery life.  This is a great little camera!", "Date": "November 15, 2013"}, {"Title": "zr400", "Author": "Phillip Lutwyche", "ReviewID": "R22X99FSSMWB9W", "Overall": "5.0", "Content": "clear screen in sunlight.night shot is amazing.best shot choices gives you scope for a perfect shot.this camera is the best.", "Date": "December 31, 2013"}, {"Title": "Casio EZ-R400.SR", "Author": "James Norris", "ReviewID": "RVKB0EK7IK26D", "Overall": "2.0", "Content": "No manual with camera. I printed from Web.  Manual difficult to understand and has very poor layout, must shift back and forth from pages.  Easy to hit movie button while pressing picture 'shoot' button.  The thumb easily rest on the movie start button.Camera on-off is not easy to press without having long finger nails.I would not recommend this camera to anyone", "Date": "January 4, 2014"}, {"Title": "Excellent affordable high speed camera", "Author": "Julio Herrada", "ReviewID": "R16OMC9U563Y94", "Overall": "5.0", "Content": "Excellent high speed mode, you can select on number of frames per min and 2 options for secuence. Great features for the price", "Date": "December 23, 2013"}, {"Title": "VERY NICE CAMERA, HAS SOPHISTICATION AND SIMPLICITY", "Author": "Darrell Garner", "ReviewID": "R23LF9J2QX37FT", "Overall": "5.0", "Content": "Received the camera in less time than predicted, all in good shape, ready to go.  Has great pictures and video.", "Date": "August 26, 2013"}, {"Title": "Casio HS Exilim Ex-ZR400 Digital Camera", "Author": "Donna Covelli", "ReviewID": "R3U0V4HRIAAMOZ", "Overall": "4.0", "Content": "This camera exceeds all picture quality expectations.  I would have given a 5 star if instructions had come in English and if it had come with a stand alone battery charger vs charging through the camera. Casio makes a great point and shoot. Love the triple shot  and art modes.  Highly recommend this camera.", "Date": "January 4, 2014"}, {"Title": "Casio  Exilim  Ex-ZR400", "Author": "Frank", "ReviewID": "R26KACZRSCHZY1", "Overall": "4.0", "Content": "I haven't tried out the new camera in detail yet. It's more advance and complicated to usethan the  Casio Exilim that I have. However I have all the faith in this camera. As with all thecamera purchase in US or in HongKong, the package should come along with the protectivecasing or carrying pouch. May be Your office should advise the seller/ manuf for future sale.Frank Hung", "Date": "July 1, 2013"}], "ProductInfo": {"Price": "$201.97", "Features": "Long battery life available to shoot approx. 515 shots\nEXILIM Engine HS, Ver 3 installed for remarkable high-speed operation", "Name": "Casio High Speed Exilim Ex-ZR400 Digital Camera Silver EX-ZR400SR", "ImgURL": "http://218.201.42.40:8080/ecx.images-amazon.com/images/I/41z-SrzCCFL._SX300_.jpg", "ProductID": "B00B7D7P2K"}}