{"Reviews": [{"Title": "Don't listen about the poor autofocus, at this price its a bargin", "Author": "Keith Rembisz", "ReviewID": "R1WKLLP32XWR6B", "Overall": "4.0", "Content": "The camera \"media\" gave this bad reviews before the 2.0.2 update which makes it autofoucus much better.  Im a full frame shooter (d600) but always like a backup for my car hip etc.  Ive had many mirrorless cameras Olympus ep1, epl2, omd e5, sony nex 5 and 5r, and nikon 1v1.  This smokes them all by the LENS ALONE!  M4/3 lenses (primes only) are great but you pay for that and could actually buy a full frame set up if you bought a M4/3 prime lens or 2.  This is an aps-c sensor, much bigger than m4/3 and the 2.7 crop nikon.  I was suprised how bad the sony nex system overview was, you couldnt change settings without a big deal - iso etc.  I would actually miss shoots while fumbling through the menu.  The nikon 1v1 was good but the sensor is tiny and had poor contrast and high noise.  I would feel comfortable about dropping the eos m and having no damage, its that strong.  The screen is awsome and again, the prime lens is a 35mm focal lens and a great walk around lens.  It provides great bokeh @ 2 and 2.8 when close and its rated pretty good by dxo (13) for sharpness.  If this lens were a M4/3 it would cost 400-500 alone without a camera body.  The lens is fast and i have used it for macro with great outcomes.  I have left few reviews about products on amazon but feel that this is better than the media darling m4/3 and innovative sony.  Sony camera are loaded with gimmics and \"apps\" that proud photographers wont use. The nex 3 and 5/r can not be tripod mounted due to the shape of the camera.  Again, I am a full frame snob and I do much night photography and the noise is much different, but buy a sharp $20 leather camera holster from china and you have a great deal with the eos m 22.  In comparison to other mirrorless cameras, just think of it as buying the lens and getting the body, an extra battery, sd card, and a holster for free.  When the eos m2 comes out these guys will be even cheaper.", "Date": "November 26, 2013"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B00B5G64D0"}}