{"Reviews": [{"Title": "Camera seems good, but it is international body without US warranty", "Author": "NYCMediaMix", "ReviewID": "R2POWXLVWFIZQB", "Overall": "4.0", "Content": "The EOS M is a great camera.  It is basically a mirrorless Canon T4i in a small metal package.  Since the firmware update 2.02, the AF works great in single point mode.  I am writing to let potential buyers know that the body I received is part of a kit meant for the Canadian market that does not appear to be under warranty.  Basically, I received the kit box with the red body, MINUS the flash, lens, instruction manual and MINUS a warranty card.  In addition to the body, the box included the battery, camera strap, Canon CDs and a USB cable.  I haven't thoroughly tested the camera, but it did turn on and I was able to snap a picture.  If the camera proves not to be defective, I will be a happy camper.", "Date": "August 11, 2013"}, {"Title": "Makes other Canons feel like they were designed by cavemen.", "Author": "James", "ReviewID": "R3RS64XC31KS82", "Overall": "5.0", "Content": "This camera is an unbelievable deal. I have a hard time finding any downsides to buying this camera over the 7d, 60d, txi series Canon cameras. I am a video producer who loves to get great quality video with as little gear to carry as possible.The upsides are fantastic: smaller form factor which opens up a much higher range of gear that you can use. Simple adapters to fit not only EF lenses but the cheaper yet awesome quality FD/FL lenses as well, with only a little increase in crop factor and no vignetting around the edges, unlike the Canon EF mount cameras that are not mirrorless. (I have the adapter and am loving my Canon FD 1.4 50mm.) The lenses (EF-M) that are available for this camera are fantastic quality, I have seen some beautiful photos taken with the 22mm and have heard that the standard kit lens is an improvement over other Canon kit lenses as well. It has the same sensor as those cameras which can be 5x more expensive! It gets the same fantastic HD Video.I pulled out the old 7d yesterday for a video shoot and after using the EOS-Ms for the past couple of weeks I couldn't believe how bulky and cumbersome the 7d is.It has a touch screen, which is very snappy and sometimes more intuitive than the switches. You can install a special Magic Lantern on these cameras for touch screens. (If you don't know about Magic Lantern make sure to search the internet because this is the number one thing you are missing out on)The downsides are slight: since it uses a SD card as opposed to a CF card it does have a little bit of a bottleneck in terms of how much data it can write to the card. If you are using Magic Lantern this means that RAW video and increased data rates will most likely not be possible, whereas the full frame 5ds are very hopeful to achieve this. Less physical buttons may be bothersome to some people, not to me. Lack of flash might be a problem, I personally couldn't care less since my main purpose is video. The battery doesn't last as long as those larger, bulkier, cameras.When I tell people about this camera they are blown away at the amount of features compared to the price. You get the same great image quality as the more than 1,400$ Canons at a fraction of the price PLUS it has features which they don't. Its hard to believe, but its that good.Enjoy!", "Date": "November 10, 2013"}, {"Title": "It's ok good", "Author": "Micah Mitchell", "ReviewID": "R135HJVFH0819E", "Overall": "5.0", "Content": "Amazing for the price! Although the auto focus is terrible even after the firmware update, it's still an amazing camera. One of my lenses won't auto focus with it at all and the other one was dropped so I am forced to manual focus. It just gets difficult under direct sunlight since there is no view finder.", "Date": "October 9, 2013"}, {"Title": "Great Camera!", "Author": "Dan Dee", "ReviewID": "R2PQJO1OAKC5U9", "Overall": "4.0", "Content": "I'd read the early reviews that complained about its focusing speed, but Canon released a firmware update that cured the problem. Canon slashed its price anyway, turning it into a real bargain.I use it with the 22mm lens, which is fast, very sharp and inexpensive as well.One feature that I really like is the touchscreen and how you can fire the shutter with it. With my Canon 50D SLR, I place the focus area (a pair of small brackets marked in the viewfinder) over what I want in sharp focus (eyes, if it's a person) press the shutter button down halfway to acquire the focus and lock it, then holding the button in the half-pressed position to keep the focus locked, I recompose the shot the way I want to and press the shutter the rest of the way to take the picture. The process takes less time to do than to read here, but still, it takes a couple of seconds. With the EOS M, I can just compose the photo and touch my finger lightly on the screen on what I want sharp. The camera instantly focuses and fires the shutter. It's actually fun and the results are excellent.The only flaws in my book, are its lack of a pop-up flash, and the smallness of the grip on the front under the logo. They shouldn't be deal-breakers, though. This is a cool little camera capable of some very big results.", "Date": "November 24, 2013"}, {"Title": "Love this!", "Author": "Daniel Gomezjurado", "ReviewID": "R2C72ALOZB8VNY", "Overall": "5.0", "Content": "Love this camera!!!!!! I had a T4i... I'm completely happy with my new rebel eos m camera.It's as good as my old T4i camera and incredibly lighter and comfortable to carry!Specs are almost the same as T4i, excellent quality pictures!", "Date": "November 14, 2013"}, {"Title": "Canon EOS M New Firmware Auto Focus Test", "Author": "Dalibor Moyzes \"artist-photographer\"", "ReviewID": "R1XN2J4957QE9G", "Overall": "5.0", "Content": "Canon EOS M New Firmware Auto Focus Testno more complaining skeptics and semi experts  :)http://www.youtube.com/watch?v=JW-fcHl39y4Torwong Salwala 2how.comLensEF-M 22mm 1:2 STMEF-M 18-55mm 1:3.5-5.6 IS STMEF-S 18-135mm 1:3.5-3.6 IS STMEF 35mm 1:1.4 L USMEF 50mm 1:1.2 L USMCan a $400 camera take as good a picture as a $4000 pro shooter?yessee this review:http://www.youtube.com/watch?v=wxfaou8uJfg..", "Date": "January 6, 2014"}, {"Title": "Taking the Mirror Assembly out of the Equation with Canon Lenses", "Author": "J. Eason", "ReviewID": "R150FITP8U8P3E", "Overall": "5.0", "Content": "Amazing technological achievement but can be unwieldy with the larger Canon lenses. With the pancake lens it works wonderfully well.", "Date": "November 2, 2013"}, {"Title": "Canon's second best Video DSLR!", "Author": "Michael", "ReviewID": "R1KAJJ1L9SJA01", "Overall": "5.0", "Content": "With the advent of the Digic5 processor, the Canon EOS-M creates better quality video than your 7D! If video is your primary interest, this little box is your answer.  Sure, Live View AF is not as fast as a viewfinder, but with the 2.02 firmware, it's twice as fast as Live View AF in a T2i, T3i, T4i, T5i, 60D, or like I said, a 7D. Plus the Digic5 firmware gives you more dynamics, higher ISO capabilities, and less artifacts than a 7D.", "Date": "October 20, 2013"}, {"Title": "\"Almost\" the same as the Black", "Author": "Brian Lee", "ReviewID": "R3KNYVJ9NTU2W6", "Overall": "4.0", "Content": "For those of you wanting a review of the performance, refer to the black edition of this camera. It's essentially the same.The white edition is slightly different from the Black in its make and materials. I personally preferred the black as it had a matte finish which looks and feels classier than the glossy white. The white edition also has a funky texture on the sidewalls which the black edition didn't seem to have. It makes the white version look a little more 'cheaper.' When you look at the bottom of the camera, you'll also notice the gaps a little more on the white. The white screams, \"Look at me, I'm an newbie shooter whereas the black is more subsided.It's both made of some sort of metal and you won't be disappointed with its build quality. I've already had my black EOS M dropped from knee length and it came out with only a few dents, not a crack like if it were plastic. The build will rival many Pro/Semi Pro DSLR bodies.", "Date": "August 13, 2013"}, {"Title": "Great little camera...but needs a special lens", "Author": "Israel Heck", "ReviewID": "R1UMD7ZQHSOVO9", "Overall": "5.0", "Content": "Overall this camera works great. Its just the right size with just the right amount of features. My wife is an avid photographer and owns a Canon 6D & Canon EOS Ti but wanted something a bit smaller for when we are on the go. This camera fit the bill perfectly. The only issue is that the lens for her other Canon cameras do not fit the EOS-M body. Had to purchase a whole new lens just for this camera. Not a huge issue but in all the research I did on this camera I never found anything stating that it will not work with the other canon lens.Over all I'm very happy with this purchase.", "Date": "January 4, 2014"}, {"Title": "Poor Image Quality", "Author": "Christian Fiore \"BlueBomberTurbo\"", "ReviewID": "R28XMQ4FWY7LZF", "Overall": "2.0", "Content": "For a DSLR sensor, this camera falls far short of my expectations.  If you've only used Canon DSLRs, I'd highly advise finding some Nikon RAW NEF files, or Sony RAW ARW files to test out. You'll be blown away.I come from the Nikon side, and was expecting something on par with at least the Nikon D90 (released the same time as the M's sensor).  What I got were images that were fairly inflexible in post processing.  Very limited shadow recovery (about 1.5 stops), which showed banding fairly quickly. Highlights were even worse, with barely 1 stop of recovery.  The highlights matched the D90, but the shadows were abysmal.  I tried bracketing to create an HDR image, and even that wasn't enough.  Had to live with banding in the shadows.Beyond that, the controls are fine, I can live with the AF speed, and the 2 available lenses are great.  The image quality was the deal breaker for me, so shelled out for a NEX-6 (uses a Nikon D7000 sensor) and Sigma 30mm F/2.8 DN A, and couldn't be happier with the images and much-extended abilities of the camera.", "Date": "December 12, 2013"}], "ProductInfo": {"Price": "$499.95", "Features": "18.0 MP CMOS (APS-C) Sensor\nDIGIC 5 Image Processor\nFull HD 1080p Movie with Focus Tracking\n3.0\" Touch Screen LCD with 1040K-dots\nTouch AF and Multi-touch Operation\nHybrid CMOS Auto-focus for Photo & Video\nISO 100-12800, Expandable to 25600 (H)\nScene Intelligent Auto\nCompatibility with SD/SDHC/SDXC memory cards, including new Ultra High Speed (UHS-I) cards\nCompatible with Canon EF and EF-S lenses (Optional EF Lens Adapter is required)\nEOS Full HD Movie mode with Movie Servo AF for continuous focus tracking of moving subjects", "Name": "Canon EOS M Compact System Camera - Body Only (Red)", "ImgURL": "http://ecx.images-amazon.com/images/I/41%2ByA5mZG0L._SX300_.jpg", "ProductID": "B00BFWN0RC"}}