{"Reviews": [{"Title": "Update of previous negative feedback", "Author": "MostlyHappy", "ReviewID": "R1WEZ8M1DFMJMT", "Overall": "5.0", "Content": "I previously wrote negative feedback for this package based upon ambiguous descriptions of just what was in the package deal.  Since then I was contacted by the seller and was amazed by the kind attention to detail.  I am now fully satisfied with this package.  I just returned from Alaska with great still pics, panoramic views, and video of brown bears chasing salmon in rivers.  Overall this is a great product.", "Date": "July 31, 2013"}, {"Title": "Compact & perfect.", "Author": "Bala", "ReviewID": "RXCFQUMM062NZ", "Overall": "5.0", "Content": "It's a pretty light weight camera and takes awesome pictures. Don't make the mistake of comparing it to bigger cameras or DSLRs. For a point-and-shoot this is a perfect choice.", "Date": "September 15, 2013"}, {"Title": "My package was incompleted", "Author": "kabuto", "ReviewID": "RVNN0765CB57W", "Overall": "3.0", "Content": "The camera is ok, but the promotional pack came incompleted because of it doesn't come liquid cleaner nor protector. Ad was fake", "Date": "August 25, 2013"}, {"Title": "Worst Cybershot I've owned and I've had a few", "Author": "Michael Cammer", "ReviewID": "R5YENID4F0WEZ", "Overall": "3.0", "Content": "I've been buying Sony Cybershots for more than ten years as the pixel count gets higher and higher and I've always been happy with my new purchase.  However, this model is extremely frustrating.  It is slow to focus and sometimes, even when the focus should be at infinity, screws up.  The light metering is inconsistent.  I've tried the different modes and some pictures are overexposed.  The zoom button often doesn't respond. The focus mode has reintroduced the annoying red light shone at the subject that other newer models had eliminated.  The Bayer interpolation sometimes overshoots and puts white edges on dark objects.  Not only that, but in the two months since I purchased it the price has dropped from $159 to $119.  This price begins to accurately reflect the quality of the camera.", "Date": "April 29, 2013"}, {"Title": "Great product!", "Author": "calvin", "ReviewID": "RURDJ0OTAJP1S", "Overall": "5.0", "Content": "I was a bit worried when u bought this camera but I didn't need to be! It's neat and has a ton of features!", "Date": "December 30, 2013"}, {"Title": "Accessories not IinIncluded", "Author": "Clovis Grant", "ReviewID": "R1AFJMV5T0VVUN", "Overall": "3.0", "Content": "Overall good camera, takes really good pictures . I bought this camera for my daughter and she loves it BUT the accessories that were supposed to be included were NOT. I was looking forward to the cleaning supplies but was disappointingly surprised when I only found the camera and case. Otherwise I would recommend this to anyone.", "Date": "December 19, 2013"}, {"Title": "If you want a great little camera this is it!", "Author": "Elizabeth Szpejnowski", "ReviewID": "R7E731XF6JUQV", "Overall": "5.0", "Content": "This takes excellent pictures with ease. The pictures are sharper and takes photos in very low light. It is compact and fits anywhere.", "Date": "November 23, 2013"}, {"Title": "Nice Little Camera", "Author": "stacy", "ReviewID": "R25RXWMT6K27YE", "Overall": "5.0", "Content": "This camera takes nice pictures, is compact enough to take everywhere and is easy to use.  I am very happy I purchased this camera.", "Date": "November 16, 2013"}, {"Title": "Great Camera", "Author": "Picturehere7", "ReviewID": "R1ZCD1T92R17O9", "Overall": "5.0", "Content": "Great camera I love it and can't wait to get a Play Station 4 in January.I look to the future to buy more Sony products. Thanks so much Richard", "Date": "October 22, 2013"}, {"Title": "Excellent camera at a great price", "Author": "South District \"DelDOT S/D\"", "ReviewID": "R1DU0CASLGKM6S", "Overall": "5.0", "Content": "I was able to purchase this great camera with its accessories in one bundle and at an acceptional price.  I've had no complaints from its user.", "Date": "September 10, 2013"}, {"Title": "SONY Cybershot camera", "Author": "Kindle Fire 1", "ReviewID": "R1OPLE4BODJ4MM", "Overall": "5.0", "Content": "This is everything we want in a compact camera.  Easy to use.  Takes GREAT pix.  It was a better deal than buying @ any local store.", "Date": "August 26, 2013"}, {"Title": "Accessory Pack?", "Author": "John Mitrik", "ReviewID": "R3EL42R4RJ907Z", "Overall": "3.0", "Content": "This came with the important things like the camera, case and memory card but none of the other stated items were found.  Would have gotten higher rating otherwise.", "Date": "August 4, 2013"}, {"Title": "A Nice Camera", "Author": "R. Browning", "ReviewID": "R16TC6ZTD7YO53", "Overall": "5.0", "Content": "It took some getting use to, but I love this camera now. I was fortunate that I had a Fujifilm A900. It was similar to that of the Cyber-shot. I did a little reading and that complimented my experience with the A900, so that within an hour I was able to operate the Cyber-shot on indoor/outdoor stills and videos. I am completely happy my new camera.", "Date": "June 30, 2013"}, {"Title": "I love it~!", "Author": "Tae Lee", "ReviewID": "R23D0Q48SILPLC", "Overall": "5.0", "Content": "I was looking for a new camera.I wanted not short battery life and not too long.It might be cute and light. not high zoom.And not expensive.And w730 is perfect what i want.", "Date": "April 22, 2013"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B00BIQVQQC"}}