{"Reviews": [{"Title": "Better than expected", "Author": "Cactus Jim \"Cactus Jim\"", "ReviewID": "R17JT3YAEJ6FKR", "Overall": "4.0", "Content": "After reading previous reviews I was leery about buying the Coolpix L28.  But, I really like my Coolpix L120 so I thought I'd take a chance on the L28 because I needed something really portable.  I made sure that I ordered a memory card that is rated at class 10.  The slower cards (class 4, etc) will take somewhat longer to snap and store a picture.  Wait times with my class 10 card are only about a second or 2 at most.  Pictures I've taken so far are reasonably sharp and colors are true.  My PC recognized the camera immediately without installing Nikon software and it was easy to move pictures onto my HD.  The high resolution of the L28 means pictures can be enlarged considerably.  For closeup I snapped a picture of a printed page at about 5 inches and the type was perfectly clear.  It is true that the L28 doesn't do as well in a dark room as my L120.  Pictures are a bit grainy, but normal room lighting produces good results.  In my opinion, for people who want a snapshot camera that is small and portable and reasonably priced, the Coolpix L28 is a good choice.", "Date": "May 29, 2013"}, {"Title": "Inexpensive and easy to use", "Author": "April Decker", "ReviewID": "RPZPQ5RNK1H4Q", "Overall": "5.0", "Content": "This camera is really user friendly. It doesn't have the advanced features of some cameras, like manually adjusting the aperture, but it has many features and the exposure can be adjusted manually. I really like this camera and am very happy with my purchase. It is compact in size, but seems sturdy, like it could get accidentally dropped and not break in to a million pieces.", "Date": "March 6, 2013"}, {"Title": "Using very Fast memory SDHC Class 10 UHS-1 Flash Memory Card 95MB/s to get 1 second response time between shoots", "Author": "M. Towles", "ReviewID": "RBOXQ16RO5DQQ", "Overall": "5.0", "Content": "Nikon COOLPIX L28 20.1 MP Digital Camera with 5x Zoom Lens and 3\" LCD or any small digital compact camera. I you want fast response time between your next shoot, you have to use very fast SDHC Class 10 UHS-1 Flash memory card 45/MB/s or 95MB/s. Normally this type of memory is used in DSLR cameras, but will work in any camera that can take SDHC memory card. I found this out about 6 years ago when taking pictures at a track event. I was missing getting the winner crossing the finish line, because of slow response using SDHC 10/MB/s memory. Another guy who was also taking pictures heard me complaining about missing the shots & told me about using 30/MB/s which was the fastest during that time. I later bought it & have been changing out my camera (for more megapixel & the faster memory every 3 to 3 years). With the faster memory you get one (1) second response time between your next shoot, instead of 6 to 8 seconds when using SDHC 10/MB/s memory card. I am currently using the SDHC Class 10 UHS-1 Flash memory card 95MB/s.You have to pay more than $10 or $15 for the fastest memory so that you get 1 second response time between shots.As of 08-14-2013 here are some Amazon price on the Fastest SDHC Class 10 UHS-1 flash memory cards for 45/MB/s or 95MB/s.SanDisk Extreme 16 GB SDHC Class 10 UHS-1 Flash Memory Card 45MB/s by Scan DiskPrice $16.82 & free shipping on orders over $25.00, List Price: $48.99SanDisk Extreme 32 GB SDHC Class 10 UHS-1 Flash Memory Card 45MB/s by Scan DiskPrice $27.99 & free shipping, List Price: $78.99SanDisk Extreme 64 GB SDXC Class 10 UHS-1 Flash Memory Card 45MB/s by Scan DiskPrice $57.99 & free shipping, List Price: $199.99SanDisk Extreme 128 GB SDXC Class 10 UHS-1 Flash Memory Card 45MB/s by Scan DiskPrice $123.99 & free shipping, List Price: $174.99SanDisk Extreme Pro 8 GB SDHC Class 10 UHS-1 Flash Memory Card 95MB/s by Scan DiskPrice $23.63 & free shipping on orders over $25.00, original List Price: $62.99SanDisk Extreme Pro 16 GB SDHC Class 10 UHS-1 Flash Memory Card 95MB/s by Scan DiskPrice $38.39 & free shipping, original List Price: $78.99SanDisk Extreme Pro 32 GB SDHC Class 10 UHS-1 Flash Memory Card 95MB/s by Scan DiskPrice $63.22 & frees shipping  Regular $199.00SanDisk Extreme Pro 64 GB SDXC Class 10 UHS-1 Flash Memory Card 95MB/s by Scan DiskPrice $132.52 & frees shipping  Regular $349.99", "Date": "August 14, 2013"}, {"Title": "Ok but picture not as Sharp as the Nikon L22 model", "Author": "Ltracer", "ReviewID": "R36O20D9Z9QXZA", "Overall": "3.0", "Content": "I bought this camera bcoz I loved the Nikon Coolpix L22 model I bought in Thailand & have used for 3 years with no problems except I dropped it & the battery door clip broke off so I had to get a #8 blk rubber washer to hold the battery door closed tight. I thought the L28 would be pretty much the same camera as L22 but was disappointed bcoz the pictures are not quite as sharp as the L22. I did some research & discovered the only real true different in the cameras of any concern is the pixel size being 2.4 µm² for the L22 & 1.4 µm² for the L28 (bare minimum huge difference!!) - u can find out all this infor on snapsort.com about any camera. Also the L22 was made in Japan & L28 is made in China (personally I really don't think that makes any difference bcoz these are cheap $100 cameras, period). All in All I like the L28 bcoz it is a little bit smaller (almost micro) than the L22 & I love little double AA battery pocket cameras. I took 10s of thousands of awesome photos in Thailand for the 3 years I was living there but had to keep the camera in the Auto Mode with the flash always on & everything else off such as motion control, etc., in order to achieve very sharp colorful pictures. When I was in Thailand I meet hundreds of people that had rechargeable lithium Li-ion battery pocket cameras & 9 times out of 10 their batteries were always low or exhausted so missed thousands of unbelievable shots - when my rechargeable NI_MH double AA batteries gave out I just hoped 20 feet over to the nearest 7-11 & bought some cheap double AA batteries & was back in business within 10 minutes for 200 to 300 or 400 hundred more shots - everybody always asked me to email my pics to them bcoz their cameras were useless (true story) - that's why I love double AA pocket cameras bcoz u never miss a good shot - just have to find one that takes sharp photos every shot...", "Date": "May 10, 2013"}, {"Title": "Returned it...", "Author": "JK", "ReviewID": "R2LGPJKAT1T13X", "Overall": "1.0", "Content": "I ordered this one straight away when my L18, which I loved, took a dive off the tripod.  Even though I read the reviews here about blurry pictures, I had really loved the L18 and thought, quite honestly, it had to be the operator of the camera.  Wrong.  I did everything from close up mode, to auto mode to various scene modes, even used the timer and not touching the camera, and using a tripod, to finally contacting Nikon tech service and asking 'what am I doing wrong', pictures are not sharp.  Sent them sample pictures and the final response from Nikon - the pictures are good for that camera and was told I could send in for techs to look at the camera.  Thank goodness for Amazon's 30 day return policy.  Brand new camera without sharp pictures.  Not messing with shipping back and forth to tech support.  Camera went back.", "Date": "September 19, 2013"}, {"Title": "poor mechanics", "Author": "Larry Patterson \"The \"Chair\" Man\"", "ReviewID": "R2H7XASUP1ONFQ", "Overall": "1.0", "Content": "I love the size, etc of this camera BUT i have sent it back to Nikon twice because after taking a few pics the camera \"freezes\".  It won't do anything.  Just sits at what ever position or function it was in when it \"freezes\".  I have to take the batteries out and let the camera \"sit\" for a few minutes and then reinstall the batteries and then a few pics later it \"freezes\" again.  Nikon says they can't reproduce the problem.", "Date": "August 8, 2013"}, {"Title": "Easy to use", "Author": "Donna Kelly", "ReviewID": "R3MOUZNCJWH2UU", "Overall": "5.0", "Content": "This camera was easy to use and took great clear pictures.  If you are looking for a small great camera to just throw in your pocket this is perfect.", "Date": "October 22, 2013"}, {"Title": "Nikon COOLPIX L28 20.1 MP Digital Camera with 5x Zoom (Red)", "Author": "Amazon Customer", "ReviewID": "RRJCWPKHTR3L4", "Overall": "1.0", "Content": "Used it for two days and promptly boxed it up. First it had only one previous review so I didn't have much to go on. I tested the zoom, scenery settings, and flash and found all lacking. Very fuzzy pictures even without the zoom and long lags between photos. I'm sorry for the lack of technical verbiage, but hope this is helpful. I ended up trading to the Canon PowerShot SX160, which while not a DSLR camera, is a better point & shoot for me. It is much heftier (this Nikon was too small for my hands), much shorter lag time, and provides higher quality shots on just the auto settings.", "Date": "April 18, 2013"}, {"Title": "3\" LCD on a new Nikon L28 20.1 MP", "Author": "Juan Rafael Diaz-Estrada", "ReviewID": "R2RVONS6OSZ903", "Overall": "1.0", "Content": "On October 2, 2013, I received the camera that I had ordered as a gift to my wife.  I tested it and everything was perfect.  My wife used it on October 3, 2013 (2 pictures), October 5, 2013 (27 pictures), October 12, 2013 (37 pictures), October 20, 2013 (10 pictures), tried on October 31, 2013 (Halloween) and the 3\"LCD screen does not work any more.  All the times, the camera had been store within a hard case, in a safety place, and handed by my wife or myself.  Nobody had used, touched, or dropped it.  When trying to use it with our friends last night, the camera was worstless.  What can we do?", "Date": "November 1, 2013"}, {"Title": "A huge disappointment", "Author": "Grayhog68", "ReviewID": "RPG5A51GYG8XX", "Overall": "1.0", "Content": "My husband gave me the Nikon Coolpix L28 for my birthday.  He bought it on the advice on a salesperson at Best Buy who said that the camera was very fast for a point and shoot.  I currently have a Casio point and shoot that has an enormously long delay and so was excited to have this new camera.  After using it several times, I have returned it.  The quality of the photos was just abysmal.The photos were blurry no matter which mode I was in.  The continual shooting feature did not work at all, in either the sport or pet mode.  I actually thought that the camera might have had factory defects, but after reading other comments here I have decided that it is just an awful camera.  I am now researching other cameras and have learned the hard way that you really do get what you pay for.  This may be okay for an amateur (as in a small child).  I'm no professional photographer by any means, and I do like a small point and shoot camera for convenience.  But it has to take good photos and this camera just doesn't.", "Date": "October 16, 2013"}, {"Title": "Good camera with marginal video", "Author": "Jim G \"Jim\"", "ReviewID": "R37H7JDQKOY441", "Overall": "4.0", "Content": "For still pictures the camera is as good as one could expect. With the pictures set to only 2 megapixels the pictures seemed fine for everyday use. The camera menus and controls seemed intuitive and easy to use.For video purposes, it's great that the microphone is on the front of the camera for good audio pickup. However video quality seems only marginally acceptable. It uses an AVI format with motion jpeg, but the bitrate is relatively slow. Example: the Nikon using a class 10 memory card and 480p mode (720p capable) produces a 40 MB video that plays in 35 seconds (approx). By comparison an older Canon Powershot SD1100 IS, with a class 4 memory card and which also uses the AVI format, produces a 40 MB video that plays in 21 seconds. The Nikon video is blotchy and fuzzy by comparison to the Canon video. At 720p the Nikon video quality is still low, it simply occupies 1280 x 720 rather than 640 x 480 per frame. Thus the Nikon 720p video files are about 4 times the size of the 480p mode and have the same image quality. At least the Nikon has 720p at 30 frames per second rather than 25 frames per second as on some other cameras.Most video editors should handle the AVI video with no problem. Scaling the Nikon 1280 x 720 video frames to 16:9 DVD should have similar quality to a Canon 640 x 480 frame scaled to a 4:3 DVD.I would have preferred to edit with the 640 x 480 per frame video files (smaller, faster).For the price, the camera seems just fine for causal use. One star off for marginal video quality. For those that might prefer more video room in memory to video quality, you can give it 5 stars.See a 5 star review for the Nikon Coolpix L28 bundle I purchased from Amazon via Beach Camera: COOLPIX L28 20.1 MP 5x Zoom Digital Camera - Black with 16GB Memory Bundle. Bundle Includes 16GB Memory Card, Charger with 4AA 2900mAh Batteries, Mini Table-top Tripod, Deluxe Carrying Case , and 3pc. Lens Cleaning Kit.", "Date": "July 19, 2013"}, {"Title": "Low Quality", "Author": "Joseph Kania", "ReviewID": "R9LVXMGYL97RM", "Overall": "1.0", "Content": "Bought this camera to replace my broken Nikon S220 (lens mechanism broke when I fell). Took it out of the box, loaded batteries, took 3 exterior photos, and took it right back to the store for a refund. Easy to use but poor picture quality (fuzzy). Construction of the camera is definitely not what I expected from Nikon.", "Date": "May 24, 2013"}, {"Title": "Good for the price.", "Author": "Zengliang Cai", "ReviewID": "RW5KOI1683XBE", "Overall": "5.0", "Content": "Good enough for non-professional photographers. Easy to transfer photos to computers. Its scan disk fits all kinds of card readers. Most important, you can buy AA battery everywhere.", "Date": "June 17, 2013"}, {"Title": "Uses \"AA\" Batteries", "Author": "Joe Q Public \"Joe Q Public\"", "ReviewID": "R2OJ4N76VUX8AK", "Overall": "5.0", "Content": "Simple to use. Produces great pics for under $100. I always buy cameras that use common batteries so I'll never be stuck waiting for proprietary batteries to change...", "Date": "November 13, 2013"}, {"Title": "Great value for the $", "Author": "Skip", "ReviewID": "RMTJSSJ7D2XZ2", "Overall": "5.0", "Content": "I replaced a 4-5 year old version of this same basic model with this camera. This one has a larger view screen and is much faster to recover and load for the next picture. I use it in my appraisal business. The only draw back that I have found is I have to hold my finger over the flash on close ups or I get a \"white out\" effect. I could probably change the settings and get a better result. I just leave it on the \"party\" setting. This gives me auto flash, focus, etc.", "Date": "October 22, 2013"}, {"Title": "very easy to use!", "Author": "Toni", "ReviewID": "R2UF7XAOOSFO3B", "Overall": "5.0", "Content": "I was looking for something simple, easy to use ,and that takes good quality pictures and the Nikon Coolpix L28 was all that!", "Date": "October 20, 2013"}, {"Title": "Great little camera!", "Author": "Ed Reda", "ReviewID": "R3FCJEDZ19IMU5", "Overall": "5.0", "Content": "This is our second Nikon coolpix L28. We purchasaed the first one about three years ago and use it everyday in a commercial setting. It was such a good camera that when we needed a second one for our business we specifically looked for another of the same.", "Date": "October 15, 2013"}, {"Title": "Very nice compact camera", "Author": "Rebekah", "ReviewID": "R30KTD4FL7NVDA", "Overall": "5.0", "Content": "When I purchased this camera for my son's birthday gift (he is 14), I was looking for a small, fairly sturdy reasonably priced camera with good image quality that uses AA batteries.  I read a number of reviews and settled on this model.  We have not had it long, but it seems to function well, and the hinge area where the batteries and memory card are stored seems slightly sturdier than that of my Canon Powershot, which I have to keep in place with a piece of tape.  The image quality is quite good under most lighting conditions, and the menus are well designed, making it easy to use.  The body is quite compact as well, swelling only in the area where the batteries are stored.", "Date": "September 9, 2013"}, {"Title": "Magic", "Author": "T. B. Robinson \"Toni Bonita\"", "ReviewID": "R1D72Z1CLECRJH", "Overall": "5.0", "Content": "Very light weight made taking pictures easy for someone who is not camera savvy. Learning to use the different sittings.", "Date": "August 30, 2013"}, {"Title": "excellent camera for beginner", "Author": "Dwayne Baker", "ReviewID": "R2VPVVLZMXE9VT", "Overall": "5.0", "Content": "This camera is for my first grader in photo class. This camera takes AA batteries and is easy to use. I love the fact it does not need to be recharged every night.", "Date": "August 23, 2013"}, {"Title": "Nice camera for the price", "Author": "Ron", "ReviewID": "R1GWSP9CJP209W", "Overall": "5.0", "Content": "Also purchased the 16gb memory and CaseLogic case as a bundle. Haven't used much yet, but will be going on vacation next month. Received in four days.", "Date": "August 20, 2013"}, {"Title": "Great little camera", "Author": "sandpiper", "ReviewID": "RDU4C02PTA2NU", "Overall": "5.0", "Content": "There is a learning curve to operate this camera to its fullest capabilities.  It has out performed way more than I expected it would for the price. The batteries last longer than any camera I have had in the past.CON: Just wish it had a longer zoom capability.I would recommend it.", "Date": "August 10, 2013"}, {"Title": "Good little camera", "Author": "Maureen McLaughlin", "ReviewID": "R30DUIVWCZKU4A", "Overall": "4.0", "Content": "I like the camera as a whole. Very clear pix, small, and easy to use. Things that keep it from being a 5 are slow recovery from one photo to the next, battery lasts fairly well, but indicator didn't seem to let me know much in advance.", "Date": "July 13, 2013"}, {"Title": "Failed on first use.", "Author": "yinzerr8", "ReviewID": "R3GYV9CQOTKQRI", "Overall": "1.0", "Content": "First use on a 70% humid day resulted in water build up on the lens. Was unable to take any pictures.Amazon gave full refund, so they continue to be a great company!", "Date": "November 21, 2013"}, {"Title": "Failed after three weeks of use", "Author": "B.B.", "ReviewID": "R17AAO2J8X274J", "Overall": "1.0", "Content": "Got the infamous \"lens error\" after three weeks of use.Owned Nikon L14 camera for 10 years with no problems.No more Nikon for me.", "Date": "August 11, 2013"}, {"Title": "Cool Coopix", "Author": "J.", "ReviewID": "R2R1077469S7Y7", "Overall": "5.0", "Content": "The images are large files; It is good that there are options to take images at a smaller pixel. The pictures are absolutely beautiful even when my hand got a little shaky.  I am a senior citizen that has just received her Master's degree, and I have this Coolpix camera has helped me commemorate the event all the more. I ordered it early one week and received it before the week was done.", "Date": "June 1, 2013"}, {"Title": "Very Disappointing Performance", "Author": "Vee S.", "ReviewID": "RB9FAYW8BPFVO", "Overall": "2.0", "Content": "Camera won't focus well on close up shots, plus pictures have a reddish tint.  doesn't do well on any flash picture, but works fine wit h daylight o utdoor shots.  The only good picture this camera takes.  Very disa''ointed u this  Nikon.", "Date": "May 19, 2013"}, {"Title": "Great Camera", "Author": "Dale L. Nelson", "ReviewID": "R293DOQ79CD086", "Overall": "5.0", "Content": "This inexpensive camera gives you a lot of features of the expensive ones.  It is easy to setup and use.  The picture quality is fantastic!  I will only buy Nikon from now on.", "Date": "April 7, 2014"}, {"Title": "Love this camera!", "Author": "Irena M.", "ReviewID": "R1WRUR5N8MQO5D", "Overall": "5.0", "Content": "Purchased this camera as a back up camera. Love the replaceable AA batteries option so I don't have to worry about recharging it. Easy to set up & operate, very light. Produces beautiful images for its size.", "Date": "April 1, 2014"}, {"Title": "do not buy refurbished!!!!", "Author": "Jerry E. Wells", "ReviewID": "R3CV7T9AEWB0FZ", "Overall": "1.0", "Content": "gave cmera to wife for Christmas. From day one auto flash did not work all the time on easy auto. By the time I figured out that it was not me making a mistake it was the camera(e-mailed Nikon) the warrenty was up.", "Date": "March 25, 2014"}, {"Title": "Nice pix, but cheaply made", "Author": "J. E. Garrett \"jg3arrow\"", "ReviewID": "R2FZFY8987NOL", "Overall": "3.0", "Content": "This camera takes pretty pictures. That said, it couldn't be much more cheaply made.The good:It takes AA batteries, so you don't have to worry about chargers, dead batteries, spares, etc.It uses a standard size memory card, so that's another savings.In certain situations, this camera has an absolutely startling clarity to its pictures.The bad:Only a 5x zoomThe cover over the lens seems to be plastic that scratches easily.It doesn't take much to jam the zoom.First time you drop it, figure the LCD screen will break.After any amount of use, the battery door will no longer stay shut; use a piece of tape, or a rubber band to keep it closed.Don't expect much in the way of manual control over how this takes pictures, but there is a rather large number of settings that you can choose from that should give you reasonable results in most conditions.", "Date": "March 19, 2014"}, {"Title": "Canon is better.", "Author": "JEFF HIGGINS", "ReviewID": "R1TQ6FV00GYU0P", "Overall": "1.0", "Content": "This camera does not even come close to the Canon. The menus are slow to get in to and navigate. The menus do not have as much control over what you may want to set. The zoom is jerky and slow. Canon is better. Hard to get to focus.", "Date": "March 15, 2014"}, {"Title": "camera", "Author": "meloney landry", "ReviewID": "R13HOVVY4RP2KQ", "Overall": "4.0", "Content": "I really like the camera except for one thing- to remove the memory card, you have to also open the battery case because they are both together.  Sometimes the batteries want to fall out if you are not careful.", "Date": "March 11, 2014"}, {"Title": "Make Sure You Get The Warranty", "Author": "JAVA06 \"Hobo Addiction\"", "ReviewID": "R3RZ3019DTXKCY", "Overall": "3.0", "Content": "I purchased this camera to make videos of the progress of an ongoing project in late June 2013.  I used it for about 20 minutes every 2-3 weeks and it broke in February.  That is why I gave it 3 Stars.  I never was hard on the camera as in dropping it or lugging it around in baggage, but I may have to be more aware of fingertip pressure to operate the buttons on the next one.  I misplaced the warranty so now I have to purchase another and this time I will file the warranty where I will find it if this one breaks again.  It's a great little camera, very easy to use, picks up sounds clearly. I've taken a few stills but mostly 10 minute videos and am very pleased with the clarity.  What I did record in the dark with little lighting was okay, but you pay for what you get.  For a lower end digital video/still shot camera, it's well worth the money. 2AA and a memory card of 16 and you can get so many mini-videos and no telling HOW many stills. Just make certain that you get the 2yr extended warranty and all will be well.  The 2yr warranty is just $7.00 :)", "Date": "March 6, 2014"}, {"Title": "Disappointment again from Nikon", "Author": "Charlene Greene \"cortten\"", "ReviewID": "RIRD771ITC8JM", "Overall": "2.0", "Content": "It is not a great camera or even a good one.  I have had several digital cameras both like this(I currently have a. Kodak I love) and a digital SLR which is a Nikon(which needs repair due to shutter failure). I bought this for my daughter and mother for Christmas, both cameras are equally difficult to get focused well lighted pictures.  Both individuals are experienced with cameras. Would definitely NOT recommend.", "Date": "January 9, 2014"}, {"Title": "Poor picture quality", "Author": "Matt Bailey", "ReviewID": "R36IRJROPUFFMB", "Overall": "1.0", "Content": "90% of our pics came out blurry. Very disappointed. Sent it back after 5 days. Read the reviews from all of the others about the blurry photo problems.", "Date": "January 6, 2014"}, {"Title": "Nice camera", "Author": "Bill Reid", "ReviewID": "R3Q2V3C277X737", "Overall": "5.0", "Content": "I am not a photographer, but I bought this for my wife at her request.  She loves it.  Does not have internal memory, so make sure you order an SD card.", "Date": "January 4, 2014"}, {"Title": "Easy to use", "Author": "B. Thompaon Mccord \"Old School\"", "ReviewID": "R3L7DMQAM51PIT", "Overall": "5.0", "Content": "Takes great pictures, easy to understand instructions. Takes GREAT PICTURES!!!! Would highly recommend to take on family outings or vacations.", "Date": "January 3, 2014"}, {"Title": "Take pictures like a pro", "Author": "William H. Hibbs Jr.", "ReviewID": "REZFIR3BB7M5A", "Overall": "5.0", "Content": "I love the quality images I receive from my new COOLPIX.There are settings for many challenging shooting circumstances.  I am continually surprised by what I am able to capture both in still or video mode.", "Date": "January 1, 2014"}, {"Title": "Nikon Coolpix L28 Review", "Author": "bookworm09", "ReviewID": "R1JH5NYZR2DCNF", "Overall": "5.0", "Content": "flawless photos & awesome features!! my last camera was a Coolpix also & I loved it just as much. I'll always own a Nikon!", "Date": "December 30, 2013"}, {"Title": "Bad bad camera", "Author": "Papa Ace the Shop Teacher", "ReviewID": "R6IZ6YY0QEDOM", "Overall": "1.0", "Content": "I bought this camera for my grand daughter for Christmas.  Out of the box, it gave trouble.  First dozen or so pictures were nothing but colored blurs.  The digital screen was a hideous tint of pink both inside and outdoors.  We changed batteries to new lithium and also changed to different memory cards, including a very fast class 10 but still ridiculously bad pictures resulted.  Finally, it settled down and made pictures of a quality level of a 10 year old cellphone, remember how bad those were?  Grainy, out of focus, color washed out, etc.  Click the picture and wait a second or so, finally the picture would make.  We finally took it back, hey, you can't beat Walmart for returns!  Bought a Samsung which performs flawlessly!  So, my grand daughter and I are both happy now.  Especially happy to be done with the Nikon.  I'm not exactly camera ignorant.  I have a Nikon D40 and a Nikon D70 both of which I've shot over 10k pictures with.  I love Nikons, but the Nikon Coolpix L28 we bought and returned was pure junk!", "Date": "December 30, 2013"}, {"Title": "Gen 2 but still shaky", "Author": "paxhungaria \"paxhungaria\"", "ReviewID": "R1JLIOMRN6QMW8", "Overall": "3.0", "Content": "We bought this as a gift for an elderly person because they already owned this very same camera - just one generation older.  So, in order to make sure buttons and set-up were the same, we bought this.  Still a bit of a disappointment:  photos still do not focus as well as other cameras.  It is not a user error - this person used to use a film camera with great success.", "Date": "December 10, 2013"}, {"Title": "Excellent product", "Author": "DD", "ReviewID": "R2NKL11IHMHE0W", "Overall": "5.0", "Content": "Takes great pictures, easy to use.  Small in size,  love it!  The instructions are easy as well.  I would buy any Nikon Product from Amazon, great job!", "Date": "December 6, 2013"}, {"Title": "Nikon COOLPIX L28 20.1 MP Digital Camera with 5x Zoom Lens and 3\" LCD (Red)...", "Author": "Lee Daly", "ReviewID": "RR0O8MJKZ5OSJ", "Overall": "5.0", "Content": "Very nice camera, especially for the price.  Easy to use.  Small to fit in pocket or purse.  Takes great photos.", "Date": "December 3, 2013"}, {"Title": "Nikon Coolpix is the best", "Author": "Dan G. Luce", "ReviewID": "R123DT8U8EKYMV", "Overall": "5.0", "Content": "Nikon is the best camera manufacturer, and this basic entry does not disappoint; produces pictures with exceptional color and clarity with ease.", "Date": "November 22, 2013"}, {"Title": "Four Stars For What It Is (and it's not bad for building and construction site shots)", "Author": "Cleveland Confidential", "ReviewID": "R2GP1Q9BZBHMGD", "Overall": "4.0", "Content": "I usually read and study many reviews before buying a new digital camera. I always read Amazon reviews, as well as Testfreak and DPReview.However, this afternoon I needed a camera with minutes to spare and I purchased a red Nikon Coolpix L28 whilst en-route to a construction site meeting.Obviously, a digital camera -- especially an inexpensive digital camera -- cannot be all things to all people. So be very careful before making a purchase if you would avoid buying a camera that will not suit your purposes.What are my purposes? I use small digital cameras of this sort for taking construction site photos and for use in appraisals and estimating, especially for walking through a site and documenting what needs to go into an estimate or proposal, and what has or has not been accomplished by subcontractors, punch list items, etc.Crucial camera features and behaviors for my use, with my 1-5 rating are:* Must use easily-obtainable AA Batteries  +++++* Relative low cost  +++++* Capture speed should be fairly fast  +++* Sharp photos with realistic color  ++++* Easy and quick menu and interface  +++++* Accessible buttons  +++++* Large LCD  +++++* Overall sturdy feel in hand  +++++* “Gripability” (so I won't drop it)  ++Also very important is the ability to take legible photos in low light conditions such as attics, basements, under a porch, etc. (if using flash, photos should not be washed out).After a quick pit stop at my local computer store I raced to my destination, arriving on time. It was easy to load in batteries and card and figure out how to set the resolution to a fairly low 2 Megapixels (1600 x 1200).I shot 172 images in various lighting conditions from outside hazy to a dark basement. It's not wise to judge your results by viewing on camera because photos often look much better viewed on the PC. These did.I was able to hook up and download my photos with the USB cable that ships with the camera. I also removed the card and popped it into a card reader – the card-battery door is in a good, safe location and seems sturdy enough not to break if you are careful.Results: The overall quality of the photos was sufficient for my needs, especially most of the images captured in the dark basement with the small flash.The 3” LCD is large enough that photos may be viewed on the camera and comprehended if you need to show someone immediately.However, overall image quality seems not quite as good as that of an earlier inexpensive Nikon Coolpix that I had used for the last five years (I'm unsure of model number, sorry). Images have a slight blurry feel and while the shots captured out of door's were pretty good, they could have been crisper.Capture speed, with a Kingston 8Gb SD4 card (recommended by the store salesman) rather lagged at times, but that only became a nuisance once or twice during the 172 image usage. I'll take the advice of a reviewer above and buy a 10 speed card.I would certainly NEVER shoot this camera without the wrist lanyard attached. The 3-D bump out over the battery compartment is smooth and slippery. Why couldn't a ridge or some friction bumps be included here? The supplied lanyard is not as substantial as I'd like; you'd think that the cord part could be at least as thick as a tennis shoe lace.Summarizing, this camera fits my needs very well, and for $89.00 I am happy  enough that I might buy it again. However, after viewing the resulting photos, I am a bit disappointed. Could Nikon could have given us fewer Megapixels in exchange for better image quality? Still, I only shot in Auto and Easy Auto mode this afternoon, and used the Flash on and off control as I needed it, so maybe experimentation with one of the other many modes will yield more pleasant results.All-in-all, this is a decent camera if it is what you need. Just be sure to read a lot of reviews before you buy it, unless you are in as great a hurry as I was this afternoon.", "Date": "November 17, 2013"}, {"Title": "Great camera", "Author": "Jennifer Richardson", "ReviewID": "R3GQYVIQK247LZ", "Overall": "5.0", "Content": "We bought this for a gift and it is exactly what we were looking for. The price was very reasonable and it arrived in a timely fashion. Thank you", "Date": "November 13, 2013"}, {"Title": "Great camera for under $90", "Author": "J Sclafani", "ReviewID": "R3ICOTOSZ7051T", "Overall": "5.0", "Content": "Does all it was advertised to do.  Great pics for a point and shoot an less than $90!  And it has Nikon quality.", "Date": "November 8, 2013"}, {"Title": "Nikon Camera", "Author": "Suzan Fonda", "ReviewID": "RESNUHMHH5XHM", "Overall": "5.0", "Content": "Gave as gift and haven't heard any complaints.  This was to replace his that had a broken latch on the battery compartment.", "Date": "November 4, 2013"}, {"Title": "Great for casual use", "Author": "Ally", "ReviewID": "R3QXOGCE82AGQ4", "Overall": "5.0", "Content": "I love this camera! I just wanted something that took better pictures of my crochet projects with truer color than my Iphone 4's camera so I wasn't looking for anything special. This more than fits the bill and the price was great.", "Date": "October 30, 2013"}, {"Title": "Good value", "Author": "Thomas P. Rahner", "ReviewID": "R8MFNVQCUFG9Q", "Overall": "4.0", "Content": "This well engineered little camera is handy and does a good job for most applications. It is versatile, easy to use and compact. Creativity makes for good photos more than equipment.", "Date": "October 27, 2013"}, {"Title": "Takes great pictures", "Author": "Mike Alderman", "ReviewID": "R2OSGXOVCBF4YS", "Overall": "5.0", "Content": "Great portable zoom.  Short battery life.  Great value for price.  Real estate appraiser, wide angle lens serves purpose.  I would recommend for real estate.", "Date": "October 18, 2013"}, {"Title": "Love my new camera!", "Author": "TruthForever \"Marie\"", "ReviewID": "RL8U5T4XJVXL2", "Overall": "5.0", "Content": "I love this camera!  Pictures are clear and beautiful.  Camera is easy to use.  I'm still learning what it can do, and am enjoying it very much.  This is my first digital camera, and I couldn't be happier with it!", "Date": "October 2, 2013"}, {"Title": "Loveit", "Author": "miss", "ReviewID": "RVQCC56PPXFRI", "Overall": "5.0", "Content": "I love it! It takes clear photos and the zoom is awesome! I haven't tried any of the other fearures yet  but I'm sure they will be just as nice as the photos.", "Date": "October 2, 2013"}, {"Title": "Not Fancy", "Author": "Suzanne D.", "ReviewID": "R34DML04EG91IQ", "Overall": "5.0", "Content": "This is not a fancy camera, but takes great pictures, is very portable and easy to use.  I'm not a pro so for me it's a great camera.  Very easy to carry.", "Date": "October 2, 2013"}, {"Title": "Nice little camera", "Author": "California", "ReviewID": "R3EKVYK9Z2SH0B", "Overall": "5.0", "Content": "Wife's purchase. So far so good. Came on time and everything works. It looks like a decent purchase for the money.", "Date": "September 24, 2013"}, {"Title": "good for an easy point and shoot", "Author": "Sara Osborne", "ReviewID": "R3S671WJNQFVES", "Overall": "5.0", "Content": "after reading the other reviews, i went ahead an also ordered a 16gb class 10 memory card. delay between shots is nothing.", "Date": "September 23, 2013"}, {"Title": "GREAT camera for the money", "Author": "T. Brooks \"wild things\"", "ReviewID": "R1WBC378N82GWP", "Overall": "5.0", "Content": "My $300 camera just died on me so I was looking for a small, easy-to-use point and shoot camera for all my farmgirl activities and I found it in this camera.", "Date": "August 15, 2013"}, {"Title": "I Love It!", "Author": "sandy mcdonald", "ReviewID": "R18ZOMQWQAFK0V", "Overall": "5.0", "Content": "This camera is great!  The pics are so clear and crisp -I'm now able to keep up with my Grandbaby!", "Date": "August 12, 2013"}, {"Title": "Takes great pictures", "Author": "Brandee Duncan", "ReviewID": "R12XI24LEB4AQW", "Overall": "4.0", "Content": "This is a great point and shoot camera. The camera is easy to use and the pictures are crisp. The features are more than adequate for the average camera user. The only drawback I have found is that it does go through batteries a little faster than I would like.", "Date": "July 2, 2013"}, {"Title": "not bad", "Author": "sandra bettenhausen \"SB\"", "ReviewID": "R2WEC9IAIIQJHJ", "Overall": "4.0", "Content": "i really do like this camera. the pictures do tend to look blurry till i  put them on the computer, but then for the most part they look great and if they don't its cause of my mess up.only downside i have found so far is it takes a while to save/load before you can take the next picture. so with a family of all boys who are constantly moving it doesn't work as good as i would like. but other than that i love it.", "Date": "June 28, 2013"}, {"Title": "Great for price!", "Author": "Christopher H. Blue", "ReviewID": "RUDRT8EI2TJSK", "Overall": "4.0", "Content": "I feel that this camera is great for the price. It does a good job. I haven't used it much though. But I can tell it was all I needed. I wasn't looking for something top of the line.", "Date": "June 26, 2013"}, {"Title": "A very noisy camera, dissapointing for a Nikon", "Author": "Michael McBroom", "ReviewID": "R24C0RVW1E0MV2", "Overall": "3.0", "Content": "I've owned my Coolpix L28 for several months now. Mine looks identical to the one pictured above, an attractive sort of wine-red color. Full disclosure: I bought it from another online retailer. However, I really value Amazon's user reviews, so I thought I'd add mine to the mix. I bought the Coolpix L28 to replace my 10.1mp Canon A1000IS, which is about five years old now, and which has developed a lens error of some sort. Cheaper to replace than to fix, sadly. That was a surprisingly good little digicam.I find lots of uses for a pocketable, compact and lightweight digicam when I don't feel like pulling out my full DSLR rig. The Canon excelled at this, and I was hopeful that the NIkon would as well. In that respect, the results have been a mixed bag.Make no mistake about it -- the L28 is a digicam for the complete novice. In a novice's hands, it will do an acceptable job. Barely. The menu is easily accessible and is also easy for the novice to understand . . . I suspect. Being an experienced photographer for the past 35 years or so who has worked professionally, it is a bit hard for me to put myself in a novice's shoes. Nonetheless, I suspect it will be easy for a novice to understand and use, especially since it was clearly designed for this sort of application.The reason why I bought mine was because of its rather surprising resolution -- 20 megapixels. There are still quite a few pro-level cameras in use that do not have this level of resolution. So I was intrigued by this. What I discovered, however, was that this level of resolution is really only achieved under the most optimum of conditions. This is solely because Nikon chose to take the ability to set the ISO away from the user, and to automate it instead. To me, this was a huge mistake. Most all digicams like this have an \"Auto ISO\" feature, but they also allow the user to set the ISO as well. Not being allowed to set the ISO prevents me from setting it to its lowest number, which is ISO 100. Any setting above ISO 100, and I mean any, results in a noticeably degraded image. LOTS of noise is apparent by ISO 400. This is due entirely, I suspect, to the fact that Nikon has crammed so many megapixels onto its small, 1/2.3\" sensor -- the more mp a sensor contains, the noisier it tends to be. This one becomes so noisy that it is virtually unusable at settings of ISO 400 and higher. But unless the user is using this camera in bright daylight, the ISO set by the camera will be ISO 400 or higher, which means very noisy images.  Even when using a flash, I have found that, unless the subject is very close, the camera will bump up the ISO, resulting in even flash exposures of questionable quality.So pretty much as it sits, and under normal use, don't expect typically to get tack sharp enlargements beyond 4x6s or so. Even at web resolutions, I find the noise that results from just average photos to be unacceptable.  Under bright sun conditions, however, I will admit that the L28 does a very good job, resulting in tack-sharp 20 mp images that can easily be enlarged to 16 x 20 and beyond.  Yes, surprisingly enough, this camera's little zoom lens is good enough to handle 20 mp of resolution -- no mean feat.Another plus about this camera is it takes plain old \"AA\" alkalines and rechargeable AAs as well. I prefer compact digicams that take regular old batteries. Same as my dearly departed Canon A1000IS, the batteries are located under a cover on the bottom of the camera, and inside this cover is also where the SD memory card is located.The 5x optical zoom is adequate for most purposes. It has a digital zoom capability that adds another 4x on top of that. Surprisingly, the digital zoom on this camera is quite good. Most digital zooms are simply awful. Not this one. I found it to be quite useable in fact, with little, if any, image degradation. Which is remarkable.The specs claim that this camera has Electronic VR (Nikon's flavor of image stabilization), but I saw no evidence of it when using the camera without flash. And yes, I did have EVR set to \"Auto\" (accessible from the Menu button). There was no \"on\" selection. Images tended to be blurry even in an averagely lit indoor environment -- to test it, I chose a subject that was no more than three feet away from a 60 watt incandescent lamp. The image was noisy from being set to a higher ISO, but it also showed definite, unmistakable signs of camera shake. And I was intentionally holding the camera as still as I possibly could. My old Canon A1000IS would have easily passed this test.So this camera is really quite schizophrenic. Once you realize its quirks, however, it is possible to get good images with it, but only under a quite narrow range of conditions, all of which include lots and lots of light. And it is because of this that, despite its ease of use, its price, its high mp count, and the rest, I do not recommend it for a first time user because ultimately that person will be disappointed with the quality of the images. Bottom line: I am really very disappointed with Nikon for removing the manually set ISO feature from a camera like this, which produces so much noise above the minimum ISO that it has no business ever being set above ISO 100. I much prefer my old, dearly departed, Canon A1000IS, which had only 10.1 mp, but which allowed manually setting the ISO, and which, because of this, rendered images that were, on average, much sharper and cleaner than this Nikon does, even at twice the mp count.So, don't let the high megapixel count of this camera sway you into purchasing it. Consider its other features -- and liabilities as well -- before you pull the trigger.UPDATE: My L28 is about 8 months old now and the top button for the flash in the feature selection ring has stopped working in Auto mode (the standard operating mode). It still works in \"Easy Auto\" mode, though, which means it isn't a problem with the switch, but with the internals, possibly the operating system.", "Date": "December 13, 2013"}, {"Title": "Lots of options", "Author": "Melissa Carr \"Dog Mom\"", "ReviewID": "RWBBY1JIUJKNG", "Overall": "5.0", "Content": "I love this camera.  It has lots of options for photos that are easy to use.  You can set the camera for beach, backlight, indoor, portrait... it even has a setting for pet portraits!  IT fits easily in your hand and is light weight so you can wear it around your wrist.  It has a large screen so you can see what you have taken pictures of in detail.  I would recommend this camera for the casual photo taker.", "Date": "October 23, 2013"}, {"Title": "easy use & great for action shots", "Author": "amp", "ReviewID": "R1AVSD9DYW5ODZ", "Overall": "5.0", "Content": "Used at a track meet and got great shots of runners and zoomed in to a clear close up.  Like the 2 as Bart lasted longer than I expected.  Take your shot then zoom to the specific you want to capture and save it.", "Date": "May 25, 2013"}, {"Title": "Total piece of crap", "Author": "S. MACLEOD \"voracious reader\"", "ReviewID": "R2RA1DNA43XJHH", "Overall": "1.0", "Content": "After much research, I went ahead and purchased this camera. I was expecting a high quality product from Nikon - what a disappointment! It has to be the slowest camera on earth. As a reporter for a small-town newspaper, I need a \"point and shoot\" that can take pictures in succession quickly - missing key shots is not an option. With this camera, your subject will be on Mars before you can get the darn thing to fire off a second shot. I also concur with what many others have said here - it feels cheap and flimsy right out of the box. I returned it before I'd even had it 24 hours. It was that disappointing!Instead, I got a Fujifilm FinePix AX655. GREAT CAMERA! This is my first day with it, and I'm impressed with it from the start. It has a much more substantial feel to it, it's much faster, and the picture quality is quite good. The settings function much better than on the Nikon.It's too bad I couldn't give this thing ZERO stars. It certainly deserved it! Bottom line - stay away from this Nikon piece of garbage. I'm very disappointed in Nikon (whose products I used to love) and probably won't buy that brand again.", "Date": "September 26, 2013"}, {"Title": "Would not work properly defective unit", "Author": "Allan", "ReviewID": "R243NY4K74C1O6", "Overall": "1.0", "Content": "when it cam I followed the directions for set up,  could not get the camera to work properly.  Had trouble with the flash and also with the SD card, it would not save pictures on the card.  I returned the unit and got a full refund", "Date": "September 15, 2013"}, {"Title": "Clearly Out of Focus", "Author": "Maureen R. Tagliaferro", "ReviewID": "R2UYQO1237F0XI", "Overall": "1.0", "Content": "There are many features on this little camera, but unfortunately none that really help to get my pictures in focus, especially at close range.  I have taken several good shots, but it is mostly pot luck with every picture, and I have yet to be able to get a clear, close-up of anything.  I never get a flower image when I should, and it is like the camera is far-sighted and needs glasses to detect a good close-up.  Also, as easy as it should be, it is difficult to deactivate the flash.For the record, I read the directions and had other more experienced picture takers use my camera, but they cannot get a clear close-up either and do not know why. If I didn't doubt my picture taking abilities so much, I would have sent the camera back in time, as it is not worth the $119 I paid for it.  My previous Nikon was much cheaper and took better quality close-ups.For people who are interested in quick and easy snap shots, Nikon should make a more simple, but better quality camera.  For those wanting a more in-depth, state-of-the-art camera that is easy to carry, Nikon should continue to focus on convenience, without losing sight of quality. As it is, this camera isn't good for either the novice or the experienced photographer.", "Date": "November 4, 2013"}, {"Title": "Cool, compact, great value!", "Author": "Jeffrey I. Goyen \"physiologist1\"", "ReviewID": "R2I0D6VJ9J76KI", "Overall": "5.0", "Content": "Great value for money at the Amazon price- less than $100!Good focus function and I love it's ease of use- as a non-techie, I get lost by anything requiring a difficult or convoluted set of instructions.This camera was so easy to set up and use. Even a klutz ( ie, me ) can follow what to do- basically, point and shoot, more or lessYep, I would happily get another of the Coolpix L28 Camera, if I need to replace itGiddy Up !", "Date": "September 18, 2013"}, {"Title": "Blurry pictures even with slight movement", "Author": "Laverne Reyes", "ReviewID": "R8WB623RPR9I5", "Overall": "2.0", "Content": "The camera feels very lightweight and therefore feels cheap.  I am extremely disappointed in its performance.  The pictures are not sharp and with very slight movement there is loss of sharpness.  The zoom also creates a dark undefined picture.  I had a Sony before but it started to delay in coming on after four years of heavy use.  I wish I could go back to it now. The battery life is decent but not worth the rest of this camera.", "Date": "September 12, 2013"}, {"Title": "Great camera", "Author": "leonardo reyes", "ReviewID": "R3NDWYRAHY6RY6", "Overall": "5.0", "Content": "Bought it used it and loved it.takes excellent pictures in day or night ,battery lasts pretty long,20mp is very impressive.", "Date": "June 5, 2013"}, {"Title": "NIKON COOLPIX", "Author": "H L", "ReviewID": "R3OYJFE1QRAWQI", "Overall": "4.0", "Content": "I RECEIVED THIS CAMERA QUICKER THAN I EXPECTED TOO, VERY PLEASED, I TRIED IT SUNDAY, WILL  HAVE TO READ MY BOOKLET AGAIN,HAD PROBLEMS TRYING TO LOOK AT THE PICTURES THAT I HAVE ALREADY TAKEN.", "Date": "May 30, 2014"}, {"Title": "easy and usable", "Author": "Jimmy", "ReviewID": "R1DGJD5FNOJ9P3", "Overall": "5.0", "Content": "bought this for my mom, easy to use and pretty simple to operate and take pictures. pictures taken can be save on a memory card", "Date": "May 28, 2014"}, {"Title": "Large Pics!", "Author": "Lesley", "ReviewID": "R1R8G05AHZKF4L", "Overall": "5.0", "Content": "I bought this camera to take pictures to sell stuff online. It takes really quality pictures, but I now do realize that the huge size of the pictures (20megapixels) is really overkill for my needs. It is near impossible to email them, and I have only found one hosting site that will take a picture this big(TinyPic). So if you are selling jewelry or something tiny, this is the camera for you. It is easy to use and gives a great picture. I can actually see the cell layers eroding off the end of my thumb when it gets into the photograph! But if you are photographing people or larger object, be aware that the huge size of the pictures is possibly unnecessary and might prove limiting. For the price, it was a fantastic deal!", "Date": "May 24, 2014"}, {"Title": "Downgrade", "Author": "tom e. wolfe", "ReviewID": "R3CGVVSM3MXZKV", "Overall": "2.0", "Content": "I have previously owned a Nikon coolpix 4500.  I wanted a larger viewing screen which the L28 has. This is good. However, the battery cover is very flimsy and hard to close.  I could see this breaking easily.  Nikon makes good cameras but this model is not one of them.", "Date": "May 15, 2014"}, {"Title": "The one I received", "Author": "sharon", "ReviewID": "R3JEGOUSJFX12Q", "Overall": "1.0", "Content": "was defective so returned it.  The batteries that came with it were still within their use date but would not work.  Other batteries would not work either.  Got another one that is wonderful with built in USB/AC charging and a wide angle lense.  This is my second Coolpix and I love this little camera and the software that comes with makes it so easy to save and work with photos in my computer.  I had my first Cool pix for about 10 years...worked great until I dropped it and broke the latch to the battery chamber.", "Date": "May 13, 2014"}, {"Title": "Quit working after 2 months & 10 pictures", "Author": "Gordon H.", "ReviewID": "R12JUNU6CDYPF5", "Overall": "1.0", "Content": "Purchased used without warranty.  My previous Cannon quit after about 5 years.  This was my second Cannon, so I thought I would try a different brand.  When I tried to use the camera today, it would not come on.  I checked the batteries & they were at 85%.  Put them back in & the camera said the batteries were dead.  Put new ones in, says the same thing", "Date": "May 10, 2014"}, {"Title": "Eehh", "Author": "Shane Keylor", "ReviewID": "R9RMBSTS688LE", "Overall": "2.0", "Content": "It's an okay camera.  I needed it to take pictures for ebay listings.  I used a Kodak easyshare camera before this.  When it broke, I purchased this camera.  I like the easyshare better.  Don't get me wrong, I never loved my easyshare, but I sure liked it more than this.The thing that I do like about this camera is that if you zoom all the way out, it will focus on items at a very close range.  My easyshare was terrible at focusing at close range.  If you zoom in a bit tough, it won't focus on squat.  It needs to be all the way out.The thing that drives me nuts is the autoflash.  When I think it should flash, it doesn't and the picture is blurry.  Then, when it shouldn't, it flashes.  The flash really drains the battery too.  Which leads me to my next point:The thing that really drives me nuts (that I didn't even think to check when purchasing) is that it takes AA batteries.  My easyshare was a rechargeable lithium battery that lasted 3 years.  I just assumed all cameras made now were the same.  One week of taking pictures with 2 AA batteries in this one, and the batteries were drained.  I just got rechargeable batteries for it this week, so I'll see how they do.  It doesn't recharge them when plugged into the computer (like the easyshare did), so the batteries need to be taken out to recharge.This may be a nice camera for some things, but not really for what I'm using it for.  I wouldn't buy it again if I had to do it over.", "Date": "May 7, 2014"}, {"Title": "manual", "Author": "Justin Connolly", "ReviewID": "R1R8295S1MG4FY", "Overall": "5.0", "Content": "I wish it would of came with a English manual for the camera but other than that it's pretty good", "Date": "May 6, 2014"}, {"Title": "after 20 pics stoped working", "Author": "Victor Gomez \"victor ml gomez a\"", "ReviewID": "R3RL36DE9IH0Y", "Overall": "2.0", "Content": "I bough this camera on amazon warehouse and after about 20 pics stoped working and now it has an error of the objetiveit will be better to get another camera than repair this one so i will of course avoid nikon", "Date": "May 4, 2014"}, {"Title": "While Taking Video", "Author": "Neelakanta", "ReviewID": "RLM89N5AVXD4W", "Overall": "2.0", "Content": "While Taking Video flash light not swithing on, can any one please tell me how to switch on flash light while taking video", "Date": "May 3, 2014"}, {"Title": "Wonderful little camera", "Author": "Barbara Warny", "ReviewID": "R18CZEC18XR45T", "Overall": "5.0", "Content": "Everything was as perfect as promised.  Thank you so much.  It was exactly as I expected and more.  I'm very happy!", "Date": "April 18, 2014"}, {"Title": "You have to buy individual batteries all the time", "Author": "CJ", "ReviewID": "R6BUYLCMY3KT6", "Overall": "2.0", "Content": "The only problem with this great little camera, you have to buy batteries! And keep buying batteries because it doesn't have a rechargeable battery. It's a nice digital camera for quick easy functionality but with a 1980s  battery system.", "Date": "April 13, 2014"}, {"Title": "Nikon COOLPIX L28", "Author": "Ann Artman", "ReviewID": "R2E4D8ROMGI1BW", "Overall": "5.0", "Content": "I previously had an earlier model COOLPIX which I really enjoyed. Unfortunately right before a scheduled trip to Hawaii it had a lens failure problem that could not be fixed.  I wanted something that was similar in operation so I would be able to use it with ease. It was similar to use with improved and better features than the old one. I took lots of scenic pictures which I can't wait to get developed. I'm sure I will get the same excellent quality picture as before.", "Date": "March 18, 2014"}, {"Title": "Great camera for the price", "Author": "clarissa charbeneau", "ReviewID": "R2LCLJFPR0I9UE", "Overall": "4.0", "Content": "Great camera with good zoom. Just wish there was a setting that captured clear pictures without flash. Does take great quality videos.", "Date": "March 16, 2014"}, {"Title": "Good!", "Author": "demint", "ReviewID": "R1VPW1DWGPT33D", "Overall": "5.0", "Content": "Worked as expected, quite fantastic! I really like it. Enables me too capture the moment and preserve memories; yes yes!!", "Date": "March 16, 2014"}, {"Title": "Great little camera!!", "Author": "gail maker", "ReviewID": "R36KFLDUP2WS5X", "Overall": "4.0", "Content": "New to me recently and I am having fun with it. Does good pet photos,  and pictures are very clear. Small and so portable.", "Date": "March 12, 2014"}, {"Title": "Comparison with other camera!", "Author": "Steven Yeh", "ReviewID": "R1BFZXSJS3EC2I", "Overall": "4.0", "Content": "It's really good simple one with high resolution. I like it. The price is really good too! And I received within 3 days", "Date": "March 12, 2014"}, {"Title": "So frustrating!", "Author": "Barbie \"You're my disco..\"", "ReviewID": "R3DPVFFLE3WG44", "Overall": "1.0", "Content": "If I could give this camera 0 stars I would. I bought this about 6 months ago to use when blogging. I just blog for fun about beauty products and needed a simple camera to take pictures of small objects to review. This camera is garbage. 90% of my pictures are either a black screen or a white screen. I have to delete hundreds of pictures at a time to weed out one usable photo. I really wish I could just get a refund. This camera doesn't focus on anything, sometimes uses a flash and sometimes not, sometimes the pictures have a deep yellow tint, etc. I can't imagine if I were trying to take a photo of a person and I had to keep taking it 20X to get something halfway decent. Don't waste your money on this trash.", "Date": "March 10, 2014"}, {"Title": "Pretty nice camera for basic photo taking!", "Author": "Andrea Valdez", "ReviewID": "RYZ1CHOL3AWGY", "Overall": "4.0", "Content": "I only bought this camera to keep aside me on vacation so my phone battery doesn't get drained by having in camera mode for hours. Looks really nice and professional, I purchased the refurbished edition and it honestly works perfect and looks just like if you were to buy a new one for more. I would recommend it!", "Date": "March 7, 2014"}, {"Title": "Easy to use", "Author": "Ditzydotts", "ReviewID": "R3CSN7EPY979CY", "Overall": "5.0", "Content": "I replaced an earlier version of this camera that I loved, but this one is even better. Very easy to use.", "Date": "March 6, 2014"}, {"Title": "perfect", "Author": "andrea lixey", "ReviewID": "R2CAK54HUJGAAJ", "Overall": "5.0", "Content": "this camera has a great picture and also offers time and date stamp on the picture also does different picture sizes this help because i need a camera with both for my work and not many cameras have that small compact durable all around perfect", "Date": "March 3, 2014"}, {"Title": "Good basic pocket camera", "Author": "Glenn C. Martinet", "ReviewID": "R163CFT51J81NH", "Overall": "3.0", "Content": "Pro: Takes a great picture, has lots of picture formats to select from, AA batteries are easily replaced when dead (unlike proprietary Batt.). Compact size great for shirt pocket.Cons: Menu is a bit confusing, camera is slow to start when first turned on. Need strap on wrist case Very slippery.", "Date": "February 25, 2014"}, {"Title": "Great gift", "Author": "R. Waterman", "ReviewID": "R3QILSN06OS559", "Overall": "5.0", "Content": "My Grandmother loved this as her Christmas gift. She specifically asked to for this camera and was thrilled when she got it.", "Date": "February 25, 2014"}, {"Title": "Good camera for the price.", "Author": "S. Ohl", "ReviewID": "R20X76J91FK67M", "Overall": "5.0", "Content": "I haven't had a chance to use it to its full capacity yet, but so far, I am very satisfied with the quality of pictures and ease of download--no special software required.  It included the download cord and wrist strap as well as instructional DVD.  Amazon advertises this as requiring \"non-standard batteries\" but it takes 2 regular AA batteries, also included in the box.  Simple to use and a small profile is very attractive.  It was within the price I wanted to pay as I don't use a camera often.", "Date": "February 20, 2014"}, {"Title": "I'm now a Nikon Person", "Author": "Kira Marie Nelson-Spanks \"-KMNS\"", "ReviewID": "R35CF77XCV0NQY", "Overall": "4.0", "Content": "I have been a canon person since childhood.  A few weeks ago I purchased a printer from Canon and the service was so terrible, I decided to return it.  I was in the market for a new camera, as well.  Mine is an older Digital SLR, and I have been getting tired of getting sideways looks when going to sporting events or concerts and having to get press passes, even though I am not a member of the press.  So I decided to try this little bugger out, and I like it.  It is definitely different than an SLR.  I like it is small and can go anywhere, but the zoom has some things left to be desired.  It gets a bit pixelated.  But overall, very nice.", "Date": "February 19, 2014"}, {"Title": "Great camera!", "Author": "L F Clay", "ReviewID": "R242FHVS9JUUZY", "Overall": "5.0", "Content": "Cool pix is a great little camera. Takes gorgeous pictures indoors and outdoors. It has so many exciting features and I am still learning them. Absolutely love the metallic red color! What a great gift for any occasion! Arrived promptly and well packaged.", "Date": "February 17, 2014"}, {"Title": "Nikon Coolpix L28", "Author": "B. Biega \"syrenab\"", "ReviewID": "RSQDIPSGOK5A0", "Overall": "4.0", "Content": "For an inexpensive camera, iy is virtually perfect.  I have found that the automatic programs for portrait, food, closeups, snow, etc make very good adjustments. My only real complaint - the shiny screen virtually unreadable in sunshine,  my previous L20 had a matt screen which, although not as bright as the L28, was more readable in a bright light,Why did I change?. After dropping my L20 a couple of times it no longer focussed properly and resultant pictures were not sharp, also the automatic programs in the L28 are much more accurate", "Date": "February 16, 2014"}, {"Title": "Nikon Coolpix L28", "Author": "Gary Stanke", "ReviewID": "R1CVQUZ4HEBNIA", "Overall": "5.0", "Content": "The camera takes very good pictures. It's been very reliable and has a nice screen to view the pictures taken. Sells for a reasonable  price also.", "Date": "February 13, 2014"}, {"Title": "My granddaughter loves it", "Author": "Irene  Moore", "ReviewID": "R1OCO4JSI9W7EC", "Overall": "5.0", "Content": "I gave this to my granddaughter for her 7th birthday.  She loves the camera.  She especially loves that the camera tales videos.", "Date": "February 12, 2014"}, {"Title": "camrea", "Author": "maria", "ReviewID": "R1LOAC6L8TSAW8", "Overall": "4.0", "Content": "works great! however this is my 3rd one of this kind. the first one i dropped and the screen got broken an after 3 years the clip that holds the door shut (where the batteries and memory card are held) broke and there was no fixing it the camera would not function. i shopped around and decided to go ahead and get another one because i love it.", "Date": "February 11, 2014"}, {"Title": "Great camera.", "Author": "Joey Snyder", "ReviewID": "R37ZUWFCBSMBXR", "Overall": "5.0", "Content": "This camera works great and would recommend it.  I love the color and it is a great value for the money.", "Date": "February 8, 2014"}, {"Title": "Nikon COOLPIX L28 20.1 MP Digital Camera with 5x Zoom", "Author": "RDHOOK", "ReviewID": "R56Y2WPE7RD9L", "Overall": "4.0", "Content": "Camera was everything we expected.We had an older model Coolpix that we really liked and expect this to be as good.  It is a little slower allowing us to review the pictures we just took, but no big deal.", "Date": "February 8, 2014"}, {"Title": "Perfect for beginners", "Author": "Elaine Mansfield", "ReviewID": "R2TQ1YSK5XPB3F", "Overall": "5.0", "Content": "I never take pictures, they always came out terrible.  This camera shows you immediately how it is going too loo.  You can also transfer pictures on your computer.  I would recommend this product to anyone that never took pictures before.", "Date": "February 5, 2014"}, {"Title": "Good", "Author": "Arturo Vega Madrid", "ReviewID": "RB6E84T6ZCY0T", "Overall": "5.0", "Content": "The finish of the body make it look like a cheap camera, the quality of the photos is great, easy to use.", "Date": "February 5, 2014"}, {"Title": "My Kool Kamera", "Author": "Ray K. Nielson \"WhiteFeather\"", "ReviewID": "R3D94D0VRE5B8B", "Overall": "5.0", "Content": "Hight quality, great pictures and great ability to control the scenario with easy to use and clear instructions. good quality at a fair price", "Date": "February 1, 2014"}, {"Title": "Nikon L28", "Author": "carla quirk", "ReviewID": "R3ELIXVRBAKYJB", "Overall": "5.0", "Content": "familiar with Nikon products. THis purchase was a upgrade, from another Nikon product.  It is user friendly & easy to point & shoot.  Very clear photos.  small enough to fit in pockets/small bag.", "Date": "January 29, 2014"}, {"Title": "Great little camera", "Author": "Rachael Monaco", "ReviewID": "RKE8CXXIVU3KY", "Overall": "5.0", "Content": "This works perfectly for the beginner who wants to take photos for any reason. Great for taking photos for blogging and online writing. Love the video aspect too!", "Date": "January 28, 2014"}, {"Title": "Great Christmas gift", "Author": "Autumn C Smith", "ReviewID": "R3M0FP4B0GFITZ", "Overall": "5.0", "Content": "I got this for my mother for Christmas because she was long over due for a new camera and she absolutely loves it.", "Date": "January 27, 2014"}, {"Title": "Very satisfactory so far", "Author": "John L.", "ReviewID": "R1OEMO2CJTOTW7", "Overall": "5.0", "Content": "This replaced an L22 on which the battery lid catch broke. As long as this one doesn't do the same, I'm happy with the camera.", "Date": "January 23, 2014"}, {"Title": "Great Camera!", "Author": "SFH89", "ReviewID": "RB5L3SOYFNI87", "Overall": "5.0", "Content": "After my first Nikon fell on my hard kitchen floor I needed a new camera, so I went with this one. I love this camera and I'm not sure why many people are saying it doesn't work or takes fuzzy pictures. My pictures are clear and this camera is great! Slight delay after a picture is taken, but who cares when the result is a crisp photo! :)", "Date": "January 22, 2014"}, {"Title": "My wife really likes her new camera.", "Author": "John E. Cohn", "ReviewID": "R17L8KHL683EW8", "Overall": "5.0", "Content": "Bought this for my wife for Christmas and she has had a very good time with it, she can't stop talking about how easy it is to use.So I guess I did well.", "Date": "January 19, 2014"}, {"Title": "great purchase", "Author": "Starchasre", "ReviewID": "RQ7NFILXVTJLY", "Overall": "5.0", "Content": "I needed a new camera and after much research I settled on this one.  It is awesome.  I highly recommend it.", "Date": "January 19, 2014"}, {"Title": "This thing takes pictures like a PRO! Comperable to a $200 dollar camera.Im impressed.", "Author": "David S.", "ReviewID": "R35887WOLLJRQT", "Overall": "5.0", "Content": "I didnt expect much for the money,i was surprised.This thing is faster than my Samsung Camera i Paid $150 for!Pictures look hd quality.Buy one...Youll fall in love with it,Makes your phone camera look like Garbage!", "Date": "January 18, 2014"}, {"Title": "christmas gift score", "Author": "Tina", "ReviewID": "R1YF380VAK93CE", "Overall": "5.0", "Content": "I think I got a refurbished one but it was like brand new and hubby loves it. It has MORE mp than my larger camera that cost 2-3 times more!!!", "Date": "January 17, 2014"}, {"Title": "Works great but no monitored selfies", "Author": "BIO TREK", "ReviewID": "R2NIKWR39MEJ8", "Overall": "4.0", "Content": "When I'm indoors at night, and the room is lit well for the eye, this camera will have a long shutter opening.  Small movements from holding the camera will give slightly unsharp pictures unless you see that green shaking symbol to stabilize the image.  A lot of my indoors photos from the first month were unsharp because I didn't realize this.  I love that it uses standard AA batteries instead of custom photo battery packs.  I already have a lot of charged up rechargeable AA batteries and it is very convenient.The only drawback in this camera is the back display doesn't swivel foward.  You can't do selfies unless you do them blind or in front of a mirror.", "Date": "January 17, 2014"}, {"Title": "EASY and that's why I like it!", "Author": "Maryann St. Hill", "ReviewID": "R1UC89FNCCI7SZ", "Overall": "5.0", "Content": "This purchase was to replace a COOLPIX that I had for years that my niece dropped and broke.  It takes great pics and is very easy to use.  I really like this camera because it uses regular AA batteries.  Easier to have two AA batteries on hand than a costly extra lithium or a cord to recharge.  Fits in a pocket or purse, is light weight, easy to hold or handoff for picture taking and the settings are easy to use.", "Date": "January 16, 2014"}, {"Title": "Finest price for a 20 mp camera", "Author": "HALIM", "ReviewID": "R1PVYVRBTRKH4E", "Overall": "4.0", "Content": "Price is good for this functional camera. Everbody can easily use. But it is slow a little. I do advise.", "Date": "January 15, 2014"}, {"Title": "Amazing camera!", "Author": "Ms. D", "ReviewID": "R1H2UWFW8T7AYU", "Overall": "5.0", "Content": "Takes beautiful pictures and it's pretty too. The price was great. I just need to get a case for it.", "Date": "January 14, 2014"}, {"Title": "Great Point and Shoot", "Author": "Brent Capener", "ReviewID": "R39JBO3YJWDGJK", "Overall": "5.0", "Content": "Buy it. It is a great value for a point and shoot camera - works great. I love it.  Thanks!", "Date": "January 13, 2014"}, {"Title": "Great", "Author": "Richard", "ReviewID": "R79J04FVB3GMH", "Overall": "5.0", "Content": "It was a gift and the person loves it.  Easy to use takes great pics and will use seller again I am sure", "Date": "January 13, 2014"}, {"Title": "amazing", "Author": "Donnalynn Dennis", "ReviewID": "R1B62N5XY3D5WY", "Overall": "5.0", "Content": "this was a Christmas gift for our daughter and she was taking some amazing pictures.  She was very excited to get this camera", "Date": "January 11, 2014"}, {"Title": "nice.", "Author": "Ashley", "ReviewID": "R3DTJI2G2QAQTN", "Overall": "4.0", "Content": "This camera is pretty basic. If you are looking for a camera that is easy to use and you just want a camera that takes good to average pictures then I would say this is the camera for you! Overall I like this camera and no its nothing fancy but if thats what you are looking for you should buy something more expensive. I also love the color its accurate to the picture.", "Date": "January 10, 2014"}, {"Title": "My Daughter loved it", "Author": "Deborah McElwain", "ReviewID": "R3ANMMLKMMZM8C", "Overall": "4.0", "Content": "I bought this camera for my daughter as a Christmas present. She took a lot of great pics on Christmas Day. I have not heard any complaints about it yet. She had wanted a compact camera she could carry in her purse and this fits the bill.", "Date": "January 9, 2014"}, {"Title": "Great point and shoot for the price!", "Author": "John Kraft", "ReviewID": "R3RTDQ7VBHS4I7", "Overall": "5.0", "Content": "This camera takes excellent pictures, video and has a boat load of features.  My old L20 finally broke and I tried to buy a cheaper camera.  Don't waste your money on knock-offs.  Nikon is the way to go!", "Date": "January 9, 2014"}, {"Title": "Great", "Author": "Bqt", "ReviewID": "RWDISAJ0L5TA4", "Overall": "5.0", "Content": "It arrived promptly and was well packaged. The camera works great and I am very happy with the quality of pictures and video I have gotten when using it.", "Date": "January 8, 2014"}, {"Title": "I LIKE IT", "Author": "norma jean buckley", "ReviewID": "RWKPGT9YJ8BNL", "Overall": "4.0", "Content": "actually my husband uses it and he likes it a lot. It takes beautiful pictures except when we use zoom. then they are blurry.", "Date": "January 8, 2014"}, {"Title": "Great Camera", "Author": "Maria Hathorn", "ReviewID": "R1410MXIH32F1X", "Overall": "5.0", "Content": "Purchased this camera for my 31 year old daughter and she loves it. Does require a SD card to save photos. They will not save without it.", "Date": "January 8, 2014"}, {"Title": "Great Camera!!!", "Author": "Grimley", "ReviewID": "R1UK01CO6N0EUS", "Overall": "5.0", "Content": "It's easy to use and doesn't have too many \"buzzers and whistles\" to mess with. Takes great pictures too!! Yahoo", "Date": "January 7, 2014"}, {"Title": "Nice small camera", "Author": "Michael W Grenn", "ReviewID": "R10VRUNSR75GF9", "Overall": "4.0", "Content": "Very easy to use like the size of it. However it hesitates when taking pictures in different lighting  so you don't always get the shot you want ! Overall I like it", "Date": "January 7, 2014"}, {"Title": "My son's christmas present", "Author": "Brian", "ReviewID": "RQ8TI4HRDZBJZ", "Overall": "5.0", "Content": "Got this camera for my son to use taking pictures of our soon to arrive grandchild.  It's a Nikon and is very compact and low priced for the resolution you get from it.  I could not believe it.  I'm glad I didn't order the red one.  I'm afraid that one would be mistaken for a toy. instead of the semi-serious point and shoot it is.  At this price I was able to also order compatible memory cards and a tripod/case kit with it so I could give him a complete package for photos or videos.", "Date": "January 6, 2014"}, {"Title": "Beautiful camera.", "Author": "SW", "ReviewID": "R2AVMBWNZ4V7OA", "Overall": "5.0", "Content": "A beautiful camera.  Seems to work well.  I like it and expect to get a lot of happy pictures with it.", "Date": "January 6, 2014"}, {"Title": "camera", "Author": "charles harris", "ReviewID": "R3N71CCJ2L8KYN", "Overall": "5.0", "Content": "the camera works very good and when you zoom it takes good pictures for the price it was a very good deal", "Date": "January 5, 2014"}, {"Title": "Great camera for the price!", "Author": "Ann", "ReviewID": "R1REMIPWR9U83H", "Overall": "5.0", "Content": "Bought this camera for my son for Christmas.  It was a recommendation from a friend who recently bought this same camera.  My son and my friend loves this camera.  They like the 3\" viewing screen on the back.  It's small enough to stick in your pocket.  I used it once  and found it very easy to use after my son's verbal instructions.", "Date": "January 4, 2014"}, {"Title": "Not happy with this camera", "Author": "Diane", "ReviewID": "R1YBE3Q8TH8TRS", "Overall": "2.0", "Content": "The pictures are not sharp and I, like a previous reviewer, have the problem of it \"freezing\" and having to take out the batteries for for the lens to close. I find it not user friendly.  Granted it could be me on the user friendly part.", "Date": "January 1, 2014"}, {"Title": "camera", "Author": "Belinda", "ReviewID": "R22A08GA436LCY", "Overall": "5.0", "Content": "it was a good product. product came on time! i would reccomend this camera to everyone. takes good pictures and good quality.", "Date": "January 1, 2014"}, {"Title": "Love it", "Author": "Smart Shopper \"smart shopper\"", "ReviewID": "R2W14RB97Y4K7M", "Overall": "5.0", "Content": "Purchased as a gift for my daughter.  She loves it.  The megapixels are great and the zoom is good too.  She also loves the color.  It makes the camera a little more modern and cool.", "Date": "December 30, 2013"}, {"Title": "Great Camera", "Author": "Vern Johnson", "ReviewID": "R1736W7527Z29B", "Overall": "5.0", "Content": "very easy to use . takes great pictures. Good price! It has a very large capacity for holding our shots.", "Date": "December 30, 2013"}, {"Title": "Miscommunication", "Author": "Jeanette Pritt", "ReviewID": "R3HDMLL1DBGVU", "Overall": "4.0", "Content": "I was disappointed to learn after my purchase that the video card WAS NOT included.  My Nikon L22 had included that card so I'm trying to use it with this camera but not so sure it's working correctly.  For instance, after I snap a shot the screen stays black for a few seconds.  The \"older\" camera did not do that.", "Date": "December 27, 2013"}, {"Title": "my camera", "Author": "Walter H. Kuttner", "ReviewID": "R1XISTBJKPNU2N", "Overall": "4.0", "Content": "excellent for a novice.simsettingsple to use.easy to understand,. just use on automatic settings.j.just do it again. click and shoot.ust click and shoot. wait", "Date": "December 25, 2013"}, {"Title": "Don't get fooled by 20.1", "Author": "wenura", "ReviewID": "R2QKJ8IO9JAHRZ", "Overall": "1.0", "Content": "This is a shame to such a high brand name. Not recommended at all. screen is so poor quality. Images are poor too. But you can improve little bit by setting VR to auto and using the highest image quality and good SD card. Nikon should not make these low quality cameras.", "Date": "December 24, 2013"}, {"Title": "Dissapointed", "Author": "victor Webber", "ReviewID": "R3CK2RW5OWO41W", "Overall": "1.0", "Content": "I had it for two weeks and never got one picture worth saving. Most out of focus and some were delayed. Very disappointed. Video worked ok. Would not recommend.", "Date": "December 20, 2013"}, {"Title": "Great Peice!", "Author": "Ashley De Lay", "ReviewID": "RSVEVBKDC3HVJ", "Overall": "5.0", "Content": "I am so happy that I got this and at an even better Price. To make it better it runs on double AA batteries which is great for going to events and more.", "Date": "December 19, 2013"}, {"Title": "Easy, compact, goofproof", "Author": "K. Brunelle \"nanaof2\"", "ReviewID": "R1M0NYZJ74D35O", "Overall": "5.0", "Content": "It's small and easy to use.  I actually wanted a very easy camera and this does the trick. I have a larger, \"fancier\" Nikon but it's not easy to lug around. For a grandmother that really wants it to take photos of her grandkids, it's perfect.", "Date": "December 10, 2013"}, {"Title": "Decent little camera with big viewing screen.", "Author": "Robert Reyes \"radio head\"", "ReviewID": "R115HWOOE0N7PT", "Overall": "4.0", "Content": "Decent little camera ..a relatively good item ..viewing screen adequate ..just don't drop and break the battery / memory card door !", "Date": "December 10, 2013"}, {"Title": "Nice camera for the price.", "Author": "Sid Wilson", "ReviewID": "R29ZA576XUFXRN", "Overall": "4.0", "Content": "Nice Camera for the price! A good pocket camera or one for the glove box. Easier than a phone camera.", "Date": "November 28, 2013"}, {"Title": "(Refurbished) pictures not crisp", "Author": "A. Jaynes", "ReviewID": "R1PCT0SGRBRJ4I", "Overall": "3.0", "Content": "The pictures aren't very clear unless you turn OFF the motion control feature. It's not even as crisp as the Nikon 16mp S series that we used to have. But it was cheap (refurbished) and lightweight, and uses batteries instead of recharging so, it doesn't run out at important moments. Other than not being as sharp as I'd like, it seems to operate fine. Couldn't notice it wasn't new almost.", "Date": "November 20, 2013"}, {"Title": "Great camera and very easy to use", "Author": "Dot", "ReviewID": "R13FCMM3XSH7LM", "Overall": "4.0", "Content": "I bought this camera, to use on vacations, based on a friends recommendation. Very happy with it, easy to use and takes great pictures.", "Date": "November 2, 2013"}, {"Title": "Nikon Coolpix l28 20.1 Digital Camera", "Author": "louanngc", "ReviewID": "R2QM9P0BD3M9A9", "Overall": "4.0", "Content": "Very nice camera.  I don't have it long enough to write a lengthy review. Easy to use so far and takes nice pictures. Great color red case", "Date": "October 21, 2013"}, {"Title": "Nikon coolpix", "Author": "Kathleen Lutz", "ReviewID": "R3QGECV28Z3WDC", "Overall": "4.0", "Content": "Still trying to get the hang of it.  Doesn't seem to take all the pictures that I thought I was taking.", "Date": "October 15, 2013"}, {"Title": "Great Little Camera for the price", "Author": "Marilyn J. Commins \"bookster\"", "ReviewID": "R1MR6O27VG8MDQ", "Overall": "4.0", "Content": "Easy to use any very compact.Photo quality is very good.I agree with others that there is no reason on earth the cord couldn't have been made a more convenient length ( longer).I have to plug camera in and leave it on top of my computer because it won't reach to my desk top.That would be my only complaint.", "Date": "October 4, 2013"}, {"Title": "Nikon COOLPIX", "Author": "Dottye Roberts", "ReviewID": "R355IA44N8JSTS", "Overall": "3.0", "Content": "I am just not impressed with it.  It is so small that I have a hard time holding it.  I also have a hard time focusing it.  I know you can change the settings, but still not focusing well.  Those are the things I don't necessarily care for.  On the upside, it is very compact and a very pretty color.  If I had it to do all over, I more than likely would not purchase this camera again.", "Date": "October 3, 2013"}, {"Title": "good", "Author": "Quan Zhang", "ReviewID": "RDV00WFHEBV6D", "Overall": "4.0", "Content": "It is good at color. But button is little slow. And there is A A battery. It's better to buy recharge battery.", "Date": "October 2, 2013"}, {"Title": "Delighted with my experience to date", "Author": "Stephen Thomas \"former naval person\"", "ReviewID": "R3UHF88QKHJJ0C", "Overall": "4.0", "Content": "Much superior to the L20 it replaced. Controls more clearly marked. only complaint, no large print manual available so far.", "Date": "October 2, 2013"}, {"Title": "Coolpix L28", "Author": "PDS", "ReviewID": "R1NAL0486RK1E8", "Overall": "4.0", "Content": "I like the camera -I like the fact that it has 5 to 1 zoom and the resolution was 2x as good as my L 18 (which has now developed (OS problems...doesn't recognize SD card, for instance).I just do photography for fun - so this camera works just fine for me!! just discovered the one thing I don't like very much....when you take a picture with the flash, it doesn't seem to fill very well.. (maybe a setting? )I E  took a picture of a thanksgiving spread with the food on the table..(my friend was seated at the edge of the table)all in the shot - food was illuminated perfectly; person on the edge of the table was in (sorta) darkness!", "Date": "September 24, 2013"}, {"Title": "Excellent little camera", "Author": "Notoneedles", "ReviewID": "R136JF256ZHRLP", "Overall": "5.0", "Content": "Purchased this camera to take on vacation last month.  Was very pleased with the photos I took with it.  Very compact and easy to store in my carry on luggage.", "Date": "September 21, 2013"}, {"Title": "Poor Quality for the Value", "Author": "Ernie Peters", "ReviewID": "R1V9ANCH4CU6G2", "Overall": "3.0", "Content": "As always I received my shipment in a timely manner and Amazon was great with their customer service.  The camera did not work properly out of the box.  I contacted Amazon who paid to ship the faulty camera back and shipped a new one out immediately.  Great job Amazon.As for the camera, I am a huge Nikon fan.  I purchased this camera for work and taking head shots of staff.  It didn't need to be fancy and do too many things.  The feel of the camera out of the box is cheap, sorry Nikon, but it feels cheap.  The screen is big enough but is grainy.  The shutter cover does not have a great fit and seems to hang up when opening and closing (turning the camera on or off).After receiving the new camera it appears to take clear photographs and does what Nikon advertised it to be.  I would have definately thought twice about buying this particular camera for home use especially if I was able to go hands on with this camera.  I have used other cameras from other brands in this same price point and think there are better values out there to be had.Over all I am satisfied with the purchase.  The reason for the okay rating is poor quality and feel.", "Date": "September 11, 2013"}, {"Title": "Excellent value", "Author": "Thomas Harrell", "ReviewID": "R3U7GG2UOLW819", "Overall": "4.0", "Content": "I like the 20 mp and 2-AA batteries most. I prefer lithium batteries over rechargable as I can get close to 1000 pix per set. The 5X lens is better than most.  Very little shutter lag, but at 20 mp, processing takes a while.", "Date": "August 10, 2013"}, {"Title": "Great Results for the Price", "Author": "Ian Insley", "ReviewID": "R2SQSAM66GDAJ8", "Overall": "4.0", "Content": "I use this with my Ikelite Housing for underwater photography. Obviously not the top of the line point-and-shoot, but for the money you get great results. Easy to use, multiple adjustment features including white balance, flash options, and color correction.", "Date": "August 8, 2013"}, {"Title": "DO NOT BUY THIS CAMERA", "Author": "VRunk", "ReviewID": "R3NBH2NRZSOYM4", "Overall": "1.0", "Content": "I purchased this camera and within a few weeks of using it, the LCD screen cracked.  The camera was not dropped or anything, so I can't even tell when it might have happened--apparently I must have picked it up wrong at some point carrying it around.  Reading online, I apparently am far from the only owner who has had this happen.  Going online to look at repair options suggests they want me to pay more than I originally paid for the camera to get it repaired despite the fact it is under warranty.Also, if you use Adobe Premiere Elements for video editting, it is very difficult to get the videos and photos into Elements.In general, I found this camera much less easy to use than my trusty Sony Cyber-shot DSC-H55 which has been around the world, including to Antarctica and back, for several years and continues to go strong.  I only bought the Nikon because it used regular batteries vice special rechargeable ones and I was going on a trip where recharging my Sony's batteries would be difficult.", "Date": "April 24, 2014"}, {"Title": "A Very Good Camera for the Money", "Author": "John R", "ReviewID": "R3B502HQ9LR4LO", "Overall": "5.0", "Content": "Over the past four years I have purchased six CoolPix cameras.  One for my wife, then one for myself, then one to replace one left in a taxi, then a couple for a charity, and finally one for my office.  Each CoolPix version has a little better capability than the one before, but they are all simple to use and take amazingly great pictures and videos.  I like not having to carry along a charger and being stuck if the camera unexpectedly needs to be recharged.  The batteries last a long time, even when using the flash.  I keep an extra set of batteries in the small camera case I bought and so if the batteries die in a minute I can be taking pictures again.", "Date": "January 1, 2014"}, {"Title": "Terrible, Worthless, Fuzzy Pictures", "Author": "Rebecca B", "ReviewID": "R379NMMPPMQN26", "Overall": "1.0", "Content": "This camera is really worthless. When I got the camera, I attempted to take a few pictures with just the camera's memory.  The pictures were completely fuzzy.  You couldn't make out anything but colored fuzz.  I put in my memory card that had pictures from my previous camera.  Those too were completely fuzzy.  I had no idea what I was looking at.  My opinion is do not waste your time or money.  Invest in a canon.  Amazing pictures!", "Date": "December 10, 2013"}, {"Title": "WHAT A GIFT", "Author": "Easy E", "ReviewID": "R23H36RINFADS5", "Overall": "5.0", "Content": "I ORDERED THIS CAMERA FOR MY MOTHER IN LAW TO TAKE ON A TRIP.  IT IS SO EASY THAT EVEN SHE COULD USE IT.  IT MADE BEAUTIFUL PICTURES.", "Date": "August 3, 2013"}, {"Title": "Nikon COOLPIX L28 is great", "Author": "Gerald W.Hill", "ReviewID": "R2X3C65BMNEFE0", "Overall": "5.0", "Content": "The Nikon CoolPix L28 was my first digital camera;I was happy with the quailty of pictures,the size ,and style this camera have,then I lost it ;so Im' ready for a new one;Getty", "Date": "July 10, 2013"}, {"Title": "MY CAMERA", "Author": "Tilly Tackema", "ReviewID": "R10O5W2VITONQD", "Overall": "5.0", "Content": "Easy to use. That works for me!!!!!  Will recommend to all my friends.Thank you for the great deal always.", "Date": "July 9, 2013"}, {"Title": "Great Camera!", "Author": "Larry D. Huston", "ReviewID": "R2XK2R382LO19X", "Overall": "4.0", "Content": "It is a more user friendly camera with the AA batteries, then the same touch screen camera I have.  The re-chargable is not convenient to use and operate at the AA battery operated one.  Thanks.", "Date": "June 9, 2013"}, {"Title": "NOT HAPPY AT ALL WITH MY CAMERA!!!", "Author": "Anne Hucks", "ReviewID": "R2OCP6P82CDRDT", "Overall": "1.0", "Content": "I am an appraiser and rely on my camera. I have used this model camera for several years now and go through about 1 a year. I eventually have problems with the lens jamming. This camera was not working correctly from the beginning. The zoom does not work smoothly and the photos will turn black half the time. I am constantly shooting multiple copies of the same photo to be sure it takes.If I had the luxury I would return it and get my money back but use my camera daily. If I didn't know better I would say this camera was not new but a refurbished one and I paid for a new camera. Not Happy at all!", "Date": "April 24, 2014"}, {"Title": "Batteries", "Author": "Richard C. Guliano", "ReviewID": "RSZJ3565FC9SD", "Overall": "2.0", "Content": "had difficulty putting in energizer batteries but they went in finally, was concerned about future problems so I ordered Nikon s3500 instead", "Date": "January 29, 2014"}, {"Title": "Things I like about my new camera", "Author": "Elisabeth Kent", "ReviewID": "R209XVJGB7Q8DO", "Overall": "4.0", "Content": "The sizeI like the convenience of batteriesThe price; no tax; free shippingFast serviceI finally getting used to the slow shutter closing", "Date": "December 17, 2013"}, {"Title": "Great semi-pro camera", "Author": "Stephanie", "ReviewID": "R2X5FZLFN8ELCD", "Overall": "5.0", "Content": "Works great for a semi pro camera. Takes excellent pictures and comes with great program for editing. easy to use.", "Date": "December 13, 2013"}, {"Title": "Pictures in the Shade are too dark", "Author": "R. Riglesberger \"Rhonda R\"", "ReviewID": "R3Q7MMGPS083ON", "Overall": "3.0", "Content": "I just bought this camera to take to Wyoming for a vacation. It takes lovely pictures in the sun but the pictures I took of folks in the shade look dark and terrible. Also it has an auto focus and depending on the setting it turns the picture sideways. This makes it difficult to post them in Facebook. I hate this camera personally.", "Date": "August 1, 2013"}, {"Title": "Battery", "Author": "Ivan Henson", "ReviewID": "R1964HU0WVDT0L", "Overall": "4.0", "Content": "It takes normal batteries not the auto recharge kind that I am used to with cameras but small and easy and great.", "Date": "July 31, 2013"}, {"Title": "Bad Pictures, No rechargeable battery", "Author": "Winter Sutter", "ReviewID": "R3GIOYVDV6Q9QI", "Overall": "1.0", "Content": "The picture quality is very low. Not worth the money at all; I wish I could return it. Don't waste your money.", "Date": "March 19, 2014"}, {"Title": "My brothers and I all have Nikons.", "Author": "Kichwa", "ReviewID": "R3VCIFS87J6FRR", "Overall": "4.0", "Content": "It has a sharp focus.  You can't get much better than 20 mega pixels.  You can do better than 5x zoom lens.", "Date": "September 2, 2013"}, {"Title": "CoolPix L28 20.1 Digital Camera", "Author": "Jeanne Davis", "ReviewID": "R11OFFS7T3NWCY", "Overall": "5.0", "Content": "It is easy to learn to use. Takes good pictures. Nice size to carry around. The picture quality is very good.", "Date": "June 10, 2013"}, {"Title": "DO NOT BUY THIS CAMERA.", "Author": "Amazon Customer", "ReviewID": "R31INOVXYON853", "Overall": "1.0", "Content": "This camera is the worse thing Nikon has done. It is not any better than the first camera of the 90's that were like 9 dollars. Noise's photos, MIss shot because of the button push, You are forced to used their preset \"scene mode\" or auto, which is horrible. Nikon owes it to every customer to take this off the market and refund each of us. Please for the money. Purchase another brand", "Date": "June 23, 2013"}, {"Title": "The camera is damage and no step or one month since the item was purchased, really do not recommend it because it is an article", "Author": "VE157602 Oswaldo Hechenleitner", "ReviewID": "R1W35CZCB2WLDD", "Overall": "1.0", "Content": "The camera is damage and no step or one month since the item was purchased, really do not recommend it because it is an article without having had much use for 1 month has damaged the screen is very bad article", "Date": "March 17, 2014"}, {"Title": "Nikon COOLPIX L28 20.1 MP Digital Camera", "Author": "Joseph Holcombe", "ReviewID": "RKUHQ3U3IOG3M", "Overall": "1.0", "Content": "I've been using Nikon for over 50 years and can't believe they put something out this bad! I'm ready to give up on the Cool Pix line.", "Date": "January 22, 2014"}, {"Title": "christmas gift to a friend", "Author": "GeorgeP", "ReviewID": "RGVEWYPUX1T31", "Overall": "5.0", "Content": "She seemed to love it.  Now i hope she sends me some naked pics.  Gotta love feisty 70 year old grandma's", "Date": "December 23, 2013"}, {"Title": "Good camera!", "Author": "David", "ReviewID": "R3EF07V7667WPT", "Overall": "4.0", "Content": "A good camera. It have all that we need to take very good pictures and to record the best videos. Cheap and with a very high level of quality.", "Date": "July 22, 2013"}, {"Title": "great for the camera illiterate", "Author": "Denise Hall", "ReviewID": "RUR163X92ATSF", "Overall": "5.0", "Content": "it has a pretty good auto focus, unless you have the camera too close to what youre trying to photograph. one or two out of every 5 photos i shoot, i will have to discard, mainly , im sure, because i have the camera too close. i got a fairly decent tripod for it, but it wont sit on it right, because the tripod screwing hole in the camera is so far off center. maybe a big expensive tripod will work better. i havent printed out any of my photos yet, so i cant be helpful there. i mainly play with my photos digitally, with photoshop elements, and scrapbook and movie making software, so if youre into that, this camera will do what you want.", "Date": "April 5, 2013"}], "ProductInfo": {"Price": "$90.00", "Features": "Easy Auto Mode automatically adjusts the camera settings to help you get a better shot\n5x wide-angle NIKKOR glass lens lets you get closer to the action\n720p HD video recording with built-in microphone captures the sights and sounds of the moment in high fidelity\n18 different scene modes help optimize your settings for effortless photos and videos", "Name": "Nikon COOLPIX L28 20.1 MP Digital Camera with 5x Zoom Lens and 3\" LCD (Silver)", "ImgURL": "http://ecx.images-amazon.com/images/I/411HJ6XVWaL._SX300_.jpg", "ProductID": "B00B7N9CIK"}}