{"Reviews": [{"Title": "So far so good", "Author": "Bailey \"rafferty\"", "ReviewID": "R1SAJM6LHPEQSZ", "Overall": "5.0", "Content": "This was a replacement for my Fujifilm F800EXR. So far so good. A few more bells and whistles.  Although the manual is in Japanese, you can always download the English version from the fujiusa website. You can also choose the English option on the camera in the setup mode. Great price. Love the color.", "Date": "January 15, 2014"}, {"Title": "A small and really great digicam", "Author": "Christian Beck \"CHB\"", "ReviewID": "R91XQKZ6LVH30", "Overall": "5.0", "Content": "I own the F550EXR and upgraded now to the F900EXR. It is really fun to use this new digicam. All problems (e.g. overexposure, focus, ...) are solved. This is a camera you can trust. I also own the HS20 and upgraded to the HS50. The same big step in the right direction.So long story short: A very good digicam for the daily usage.", "Date": "January 15, 2014"}, {"Title": "Lou", "Author": "Lou D.", "ReviewID": "R1SR5E8EZESE0I", "Overall": "5.0", "Content": "Great little camera, I printed part of the manual from the CD (manual that came with is in Japanese) to set up the camera.  It took me a few tries to understand the menu.  Its compact, the zoom is OK, Focus is very fast, and the best part it can capture images in RAW.For a point and shoot camera its worth the money.", "Date": "January 2, 2014"}, {"Title": "Manual in Japanese!", "Author": "weesie \"MLE\"", "ReviewID": "RY1YD7YAF5E8U", "Overall": "3.0", "Content": "Camera is not intuitive to use.  AND the instruction manual is in Japanese!  That information was omitted from the product description.  There is no available manual in English.  I would rate this product higher if I had an English-language manual.  NOTE:  the DVD accompanying the camera has English available, but that can't be carried with the camera for quick reference.", "Date": "November 23, 2013"}, {"Title": "Camera came with Japanese handbook", "Author": "Marc", "ReviewID": "R10X39L6OW0AFI", "Overall": "3.0", "Content": "The camera was fine except that the memory from my F100 would not fit into it.  Even worse was the handbook - it's all written in Japanese.  So now I need to find an online English copy and print it out.  They could at least have warned me.", "Date": "October 17, 2013"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B00B7VC4IC"}}