{"Reviews": [{"Title": "WOW", "Author": "Mark", "ReviewID": "R2B9SVFB61LITZ", "Overall": "5.0", "Content": "Why this is not at the top of the list - I can only speculate. Certainly, one of the top reasons has to be availability. As of April 2013 you must purchase from Europe or Japan. This is the ONLY consumer camera (Casio High Speed Exilim Series) that enables you to shoot video in slow motion. Combine that unique feature with a 16.1 megapixels and an 18X optical (lens enabled) zoom (digitally optimized to  a potential of 200x plus zoom) and the \"pro-shot\" image taking and the high speed processor - there is nothing like it on the market. The high speed processor allows shots in rapid succession in a quarter of a second or in three shot bursts.Most of us who purchased this camera have see videos on YouTube from all over the world showing slow motion \"film\" of anything from pets jumping to bullets flying - all in slow motion. Outstanding! The 400 and 700 series are Casio's newest additions to the Exilim limeup with the 1000 rounding out the three with a movable TFT screen. The 700, however has the greater zoom capability and the 400 has a better battery life. I'll take zoom over moving view screen any day.The adjustable anti-shake feature is simply amazing. Shooting a picture at an adjusted 36x zoom without blurring the photo is unprecendented in my limited point and shoot camera experience. You can also use the internal computer to recreate effects previously abailable SLR functions like blurred background etc...The pictures are simply outstanding. It's easy to forget that Casio was first to bring a 10+ megapixel camera to market. This camera moves so fast that you must purchase a Sandisk Extreme class 10 to utilize its power. The manual even states that that Flash Memory Card may not be able to read/write fast enough (45mb/s). I suppose you could purchase the SanDisk Extreme Pro (95Mb/S) if needed.My only complaints are the lack of Casio support in the USA for there cameras and the somewhat lightweight plastic. I know that less weight is more desirable but I almost want to feel metal. It is, after all , the most powerful (speed and functionality) point and shoot camera in existence.I purchased from ALB systems out of Germany and they delivered immediately. The box was banged up a bit from the air freight but the camera was insulated well with styrofoam peanuts, which protected it well. Thanks ALB!Now I have to find something fun to shoot other than the people and places required for my work.", "Date": "April 16, 2013"}, {"Title": "CASIO HAVE a WINNER HERE", "Author": "Garry", "ReviewID": "R17PU6FLTF98AD", "Overall": "5.0", "Content": "Having owned many Casio Cameras the last being the FH100 which I loved for ease of use. This new camera is better technically and I have had to relearn this new camera because the menus are completely different. The screen display is much higher resolution and this means the new menu details are very readable. One new feature is that one can record a movie at normal speed and while recording touch the scroll dial and immediately go into slow motion video mode.  Another touch and one is back in normal video mode.  This camera specialises in high speed photography.  The ability to capture sharp images even with its incredible zoom shooting multiple shots and automatically selecting the sharpest. Great other features to just capture anything that moves.", "Date": "July 9, 2013"}, {"Title": "Great High Speed Camera", "Author": "HECTOR FLORES", "ReviewID": "R2DQ00TT06X1OX", "Overall": "4.0", "Content": "Not a regular point shot camera.I bought this camera for the capabilities of slow motion video (up to 1000 fps), and also can give up to 30 shots per second on continuos shooting, and it is fun", "Date": "September 23, 2013"}, {"Title": "What a great camera", "Author": "canman8754", "ReviewID": "RFDWRJ4RJBC5Y", "Overall": "4.0", "Content": "This camera has worked very well and and is doing every thing I expected it to be. The only issue I have with it is that the instructions were ONLY in Japanese. I had to go on line and download the English version. Would not have been a really big deal except he camera screen was in Japanese also. I could not understand the screen to change it until I downloaded the instruction. Great Camera though.", "Date": "July 13, 2013"}, {"Title": "1000 fps is amazing", "Author": "TGN", "ReviewID": "R2SXFDBDY9WAUO", "Overall": "5.0", "Content": "Actually the image quality is really poor at 1000 fps, but it does do the job. I use it to coach jr. golfers. At 480 or even 240 fps it is an amazing tool! I am very satisfied with my purchase. Plus, as a bonus, I carry it around as a pocket camera. It takes great pictures.", "Date": "June 14, 2013"}, {"Title": "Returned camera", "Author": "lewis ase", "ReviewID": "R2TG90YCE900MK", "Overall": "1.0", "Content": "The verbage on the camera and manual were all in Japanese. There was no language selection option upon ordering this product.", "Date": "December 5, 2013"}, {"Title": "Nice Camera if display was English", "Author": "Ray", "ReviewID": "R34B82QBIXH234", "Overall": "3.0", "Content": "I ordered this camera because I previously owned other Exilim models and I was very happy with them. This camera seems very nice but all the display information and the owner's manual are in Chinese. I have not been able to find a way to change the displays to English, if that is even possible.", "Date": "October 17, 2013"}, {"Title": "Poor Quality", "Author": "Brian Kwong", "ReviewID": "R1538O7OHJJ2BV", "Overall": "2.0", "Content": "Excellent features but poor overall quality.  The USB attachment/charger port loosened up and then stopped charging after just 1 day of use.", "Date": "August 23, 2013"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B00B7D8GQO"}}