{"Reviews": [{"Title": "Fuji Film S4500 Digital Camera", "Author": "Scotty Gumballs \"Stand In Line\"", "ReviewID": "R76L4TO14DDRH", "Overall": "4.0", "Content": "I chose this camera because of the price point. $150 for a bridge camera with 30x optical zoom is fabulous and I like white. It should be noted that purchasing the white one forfeits any warranty on the camera as this color is an import model with no U.S. warranty. No matter. The camera has a nice balance in your hand, is easy to operate and has a built-in pop up flash. The zoom is very responsive and quick. The auto-focus however is average. While shooting an object in bright daylght the system had a hard time with near and far focus. It couldn't decide weather I was shooting the subject or the tree way in the background on a few occasions. The pictures are crisp and clear so you won't be dissapointed there. Purchase a good sized SDHD card and 4 rechargable AA batteries as this unit is power hungry. It comes with a lens cap that I recommend NOT attaching to the wrist strap as it gets to be a tangled mess since the lens cap teather is a bit short. I was surprised to find a sharp eyepiece much like a 35mm camera to aim with. You can use this or the bright sharp and colorful rear display. For the $150 price point it does what it should and then some. 7.9 out of 10 stars. - Scotty Gumballs", "Date": "July 3, 2013"}, {"Title": "Great Camera", "Author": "stephen", "ReviewID": "RH48KPKEYNYJX", "Overall": "5.0", "Content": "This is and excellent camera.  Not a high-end professional camera but takes great pictures.  Best advice I can give is to just take pictures and work with settings.", "Date": "September 27, 2013"}, {"Title": "Fujifilm  FinePix S4500 has some good points in ease of use and a fairly decent picture.  31/2 Stars", "Author": "PRINTERGIRL NC", "ReviewID": "R37FB2W2DEH5LL", "Overall": "3.0", "Content": "I am pretty pleased with this camera for its price range and I am glad I bought it.This camera is very easy to use and will find the right type of scene settings (landscape, night, indoor) if you turn the dial on top to SR Auto.  It does it all by itself.  This can be a great advantage when a quick shot is needed.  You can disable the flash by leaving it down, if needed.It has a small metering area, as far as I can tell, but outside it takes pretty good pictures, and with the flash, it is OK indoors.When it has enough light, the color is very good in the photos, even indoors, but in lower light, the shadows are a little grainy.  I find this to be true in many cameras in this price range.So why only 3 stars?  Well, I would give it 3 1/2 if I could select that in the star ratings, but the main reason is the LCD screen on the back is not very good, and gave me to believe I had taken some ugly color toned pictures.  They were really quite nice when I looked at them on the computer.  The highlights in the pictures seemed to be whited out as in \"too bright\" on the screen, but they were just fine.  When you are on vacation, it helps to know you have a nice picture to take home instead of wondering what you did wrong to make it look garish.When you shoot a video right out of the box, make sure you go through the menu and change the setting from PAL, (for Europe and South America) to NTSC (for the US and Canada).  Shooting in PAL will make your video a little blocky and clumsy looking.Other plus marks for the camera are that it uses AA batteries (which I love), and that its white color does not scare squirrels and birds.  Black cameras remind animals of the shadows of predators.  Silver scares them, as well.  This camera is easy to hold.  And it has a viewfinder as well as  an LCD screen.It does what it does, and it really is good for the money.  It can take some nice pictures and the buttons on the back are easy to use.", "Date": "August 7, 2013"}, {"Title": "camera", "Author": "lora", "ReviewID": "RCGWLO0LT3ALQ", "Overall": "5.0", "Content": "worth the price and takes very good pictures would recommend this to anyone that needs a new camera and comes with strap and lens cap very nice ty", "Date": "July 11, 2013"}], "ProductInfo": {"Price": "Unavailable", "Features": "14.0Mp Resolution, 3.0\" LCD Monitor\n24-720mm Fujinon 30x Optical Zoom Lens, SD/SDHC/SDXC Memory Card Storage\n1280 x 720 HD Video Capture, 64-6400 ISO Sensitivity\nCCD Shift Type Image Stabilization, 42-Step Electronic Powered Zoom\nElectronic Viewfinder", "Name": "Fujifilm FinePix S4500 Digital Camera - White (14MP, 30x Optical Zoom) 3 inch LCD Screen Import Model no US warranty", "ImgURL": "http://ecx.images-amazon.com/images/I/51VR5ldnAjL._SY300_.jpg", "ProductID": "B00BC3M78W"}}