{"Reviews": [{"Title": "not too much, not too little", "Author": "Rick L. Bush \"Lugnutz\"", "ReviewID": "R3SVGH1OK37WGM", "Overall": "5.0", "Content": "My wife and I were really into 35mm cameras about 13 years ago, but it got expensive and was a pain to deal with developing and scanning on to a pc. She had her eye on a digital SLR for a long time but the $$ was never there. So we settled on several different digi cams. Finally things were right for us and I decided to surprise her with this camera. I did a lot of research, I compared Nikon against Canon and even Nikon against Nikon. I actually almost bought the lesser D3200 until I read more and more. I compared till I was almost confused again. www.snapsort.com really helped out with my final decision to buy this camera.The D5200 is soooooo much more than a digi cam. The picture quality is superb, it is fairly easy to use once you spend some time getting to know it. It does some pretty amazing things as well, such as selective color. The viewing screen flips out and rotates so you can hold the camera above your head and still see what your focusing on, that was a key factor for me. And it was a great value when you purchase it in a kit like this. On that note as well, the zoom lens is a Nikon lens where some of the kits offer other name lenses. Not a big deal as the other lenses will work and come from other mfg's that I have heard of and have used back in the day with 35mm, but if I'm getting it all in one package I figured I should go with all Nikon. I have not used the tripod yet, but compared to some I have used, it is a pretty nice one with dual bubble levels built into it and seems to be sturdy. Having two batteries is always nice, the bag is on the small side for all that comes in this kit but it works if your creative. 64 gig of storage should keep you happy for a long time!!If I had to do it again, I would!", "Date": "June 23, 2013"}, {"Title": "Nikon D5200 Digital SLR Camera", "Author": "Sharleen A. Phillips", "ReviewID": "R9A5BDEPPDHKH", "Overall": "5.0", "Content": "I purchased this camera for my husband and he loves it.  The color of the pictures are crisp and bright, the camera is much lighter than his older Canon, and it is very easy to use.  I would recommend this camera to anyone.  I have purchased 4 cameras through Cameta and my family has enjoyed them all.  We get a great camera, with accessories for a very reasonable price.  I have not had any problems with the cameras or Cameta.", "Date": "May 10, 2013"}, {"Title": "Awesome Camera!!", "Author": "LilBit", "ReviewID": "R39VK9W2CNMI9G", "Overall": "5.0", "Content": "Love the camera and takes wonderful pictures. Also the 55-300 lens is so incredible. You wouldnt believe the closeness of the zoom.", "Date": "April 11, 2013"}, {"Title": "GREAT CAMERA & GREAT PACKAGE", "Author": "RAYMOND C LIEBERT", "ReviewID": "R2VR4EE9LZV4E6", "Overall": "5.0", "Content": "NIKON IS ONE OF THE FINEST CAMERAS ON THE MARKET. THIS PACKAGE IS QUITE THE DEAL FOR ALL THAT'S INCLUDED. IF YOU PRICE ALL THE CONTENTS OF THIS PACKAGE THE TOTAL IS FAR ABOVE WHAT THE PACKAGE COSTS. IT IS AN EXCELLENET BUY.", "Date": "July 31, 2013"}, {"Title": "Happy with the D5200", "Author": "Jeffrey T.", "ReviewID": "RAELK7UEN8HG8", "Overall": "5.0", "Content": "Still a novice at using this but everything came as promised and I'm very happy so far with the ease and quality of the pictures.", "Date": "December 25, 2013"}, {"Title": "New to Digital SLR", "Author": "Luvthosegators \"Luvthosegators\"", "ReviewID": "R2QRFT5F5GK6WM", "Overall": "5.0", "Content": "This has been a great camera so far.  Been taking picture of a new grandbaby.  Love the ease of this camera.", "Date": "October 28, 2013"}, {"Title": "all the bells and whistles", "Author": "A Brazilian Classmate", "ReviewID": "RZ2BOH236H4JM", "Overall": "5.0", "Content": "Great combo, everything that you need to get started.I was told the wide angle lenses are not very good and I purchased a gorilla tripod for smaller on the go projects.I am very happy with it so far.", "Date": "July 19, 2013"}], "ProductInfo": {"Price": "$1,099.95", "Features": "KIT INCLUDES 15 PRODUCTS -- All BRAND NEW Items with all Manufacturer-supplied Accessories + Full USA Warranties:\n<1> Nikon D5200 Digital SLR Camera & 18-55mm G VR DX AF-S Zoom Lens (Red) + <2> Nikon 55-300mm VR DX AF-S Lens + <3> Battery Grip for D5100 & D5200 +\n<4> Nikon Digital SLR Camera Case + <5> Transcend 64GB SDXC 10 Card + <6> Spare EN-EL14 Battery + <7> Precision Design 58\" Tripod +\n<8> Vivitar 52mm UV Glass Filter + <9> Vivitar 58mm UV Glass Filter + <10> ML-L3 Shutter Remote Control + <11> PD 2.5x Tele & .45x Wide Lens +\n<12> HB-45 Lens Hood + <13> PD 6pc Complete Cleaning Kit + <14> PD Memory Card Storage Wallet + <15> LCD Monitor Screen Protectors", "Name": "Nikon D5200 Digital SLR Camera & 18-55mm G VR DX AF-S Zoom Lens (Red) with 55-300mm VR Lens + 64GB Card + Case + Grip & Battery + Tripod + Tele/Wide Lenses + Filters Kit", "ImgURL": "http://ecx.images-amazon.com/images/I/513hcxg8USL._SY300_.jpg", "ProductID": "B00BEXKFI4"}}