{"Reviews": [{"Title": "35x optical zoom on a compact, non-SLR", "Author": "Amazon Customer", "ReviewID": "R2TT3HEHBPC80P", "Overall": "4.0", "Content": "Update:I have several disappointments with this camera.1) Even using the Kids setting from the Scene mode does not capture action shots that well.2) The auto-focus does not always focus how you want, where you have to refocus.I have found the video capture to be great, as it picks up sounds well even a noisy room.-----------------I bought the Samsung WB2100 on May 4, 2013 as this digital camera has what I'm looking for: a decent price and good features for a non-SLR camera.  Before finding the Samsung WB2100, I was going to get the Canon PowerShot SX500 IS.The Samsung WB2100 has the following features:1) 35X optical zoom, which can be set from the zoom on the lens or zoom on the camera body.2) Has a 70X digital zoom, which can be set from the zoom on the camera body.  I don't know how good the images look at 70X.3) Defaults to record videos in 1080p.  The movie size set from 320x240 to 1920x1080.4) Defaults to an image size of 16MB.  Can take photo sizes of 3MB to 16MB.  When scrolling through the picture sizes, the info states what paper size the picture size is good for.5) Flash is not motorized, and has to be opened with the release button.6) Has an AEL button to add exposure to your shot.  I have to find out how to reset the exposure after using AEL.7) Menu setting can mute video recording when zooming in-and-out.  By default, muting when zooming in enabled for video recording.8) LCD screen tilts out in several different positions.  The LCD screen does not swing out or turn upside-down like other digital cameras offer.9) The included charger can plug into a traditional socket, or be used as the USB cable.  It seems the USB cable can charge the camera.10) The bottom of camera can be screwed into a tripod.11) When previewing images, you can rotate the image.Aside from the features listed above, I like the following:1) The only digital camera that I've had that does well in low light.  In other words, during the daytime at home, I don't have to turn on my house lights to take a good image.  I don't have to use the camera's flash either.Here are some annoyances that I have:1) The audio during the video recording is extremely sensitive.  If you allow for audio to be recorded when zooming in-and-out, I found that camera picks up the audio of using the zoom on the lens.  I don't know if the video recording picks up the sound of using the camera body's zoom.2) You cannot turn on the camera with the lens cap on.  The LCD will tell you remove the lens cap, power on the camera again, and then automatically powers off.3) The traditional power adapter has no light to tell you if the camera is charging or not.  There is an red indictor light on back of the camera body, just above the LCD screen.4) You have to go into (camera) settings mode to change the menu sounds, the beep sound, shutter sound, and other sounds.  Settings has other settings as well, like for the display, that you cannot get to with the menu button.  I have not tried out all of the settings yet.5) When the camera is on, you cannot put the lens cap on.The following is not included:1) No separate battery charger.  You have to charge the battery through the camera, or buy the battery charger.2) No SD or micro SD with an SD adapter is included.3) There is no instruction manual.4) There is no manual that tells you what the different knobs, dials, buttons, etc. do on the Samsung WB2100.  I don't know if this is the way digital cameras are sold these days, or if Samsung assumes you have some digital camera experience.I have the following unknowns:1) If the industry or Samsung is going to offer a adapter ring or not.  Without an adapter ring, I cannot add a UV filter.2) If Samsung offers a more powerful flash or not for the Samsung WB2100.To summarize, I recommend the Samsung WB2100 for someone--like me--who is sick and tired of the small optical zoom that compact digital cameras offer but do not want to have an SLR or heft around an SLR. It has 35X zoom!  Other competing cameras, like the Canon PowerShot SX500 IS, only have 30X optical zoom.", "Date": "May 5, 2013"}, {"Title": "HORRIBLE CAMERA", "Author": "StraightShooter", "ReviewID": "R3QI4L9YYTEH6J", "Overall": "1.0", "Content": "It's a nice design and great zoom but it takes LOUSY action shots and low light pics. What's even more annoying is the time it takes to snap a photo - very poor lag time.", "Date": "May 13, 2013"}, {"Title": "Great for Bright, Sunny Days!", "Author": "ebanmiller@earthlink.net", "ReviewID": "R3IXW8DU071IB7", "Overall": "3.0", "Content": "I purchased this camera to use for work purposes. The feature I was drawn to the most include the tilt LCD screen and the price compared to other cameras in this class. Upon reviewing the specifications, I saw the camera had a wide open aperture of f3 and a maximum ISO of 6400. I felt this camera would be good for low light shooting with those two specifications combined.I found the camera to be very good in bright sunlight. Automatic mode produced very sharp, bright, and well exposed pictures in that lighting condition. I felt the camera produced very poor quality pictures in low light settings, especially when there was not a great amount of contrast in a scene. Using ISO settings higher than 200 is not recommended. I used ISO 3200 and tried ISO 6400. The details in the shot were all but removed. I tried shooting close up pictures to capture detail of several large anchor bolts. Use of the higher ISO appeared to use in camera methods to remove the image grain, which destroyed any fine detail in the shot. The depth of field while using f3 was extremely shallow and produced a very soft picture with a very limited focal plane.I am happy with the quality of photos taken in bright light, but am extremely disappointed in the low light ability of this camera, given it's specifications.", "Date": "February 7, 2014"}, {"Title": "Great Pics", "Author": "Mark E. Downey \"Zharky Marky\"", "ReviewID": "R3TUWYE2ESYRN7", "Overall": "5.0", "Content": "I have been shopping around for a camera in this price range for a while. This appeared to be a great deal on a feature packed camera by a trusted manufacturer so I purchased it.  It has not disappointed. This thing takes great quality pics. I am very pleased with this purchase.", "Date": "May 26, 2013"}, {"Title": "Very disappointed!", "Author": "Jayrod", "ReviewID": "R25DFH1ETRCAXG", "Overall": "1.0", "Content": "I bought this camera with the expectation that it would do everything that we want! However upon taking it out of the package and beginning to setup, it would freeze up and to power down you had to take out the battery. Once I powered it back up, it would take me through setup again only to freeze up after pushing any other button. When you have to call for troubleshooting a brand new item, it's time to replace it!", "Date": "June 4, 2013"}, {"Title": "Samsung WB2100.", "Author": "Jeano Lauren", "ReviewID": "R2NQSFLLNXYMTZ", "Overall": "4.0", "Content": "So far so good, the camera had met the expectations, it's not perfect , but it does what it supposed to do.", "Date": "May 21, 2014"}, {"Title": "Samsung WB2100 16.3MP CMOS Digital Camera with 35x Optical Zoom, 3.0\" LCD...", "Author": "David Geyer", "ReviewID": "R34W6C4HR4TYAM", "Overall": "5.0", "Content": "I haven't used it much to date. I needed a cheap camera that had a lot of automatic features as I am not a very good photographer. Work fine for what I need it for.", "Date": "March 24, 2014"}, {"Title": "This camera is worth buying.", "Author": "xxzhpu", "ReviewID": "RESE19DX3LEPE", "Overall": "5.0", "Content": "Samsung WB2100 is very good camera in non-Japanese series. The product instruction is too simple to be familiar with its various functions. I must download another detail instruction from  internet. I strongly suggest seller give detail instruction! LED flip displays is easy to use and view the scene. The picture taken is clear but it shake seriously when using long focal. In a word, it is worth buying in a cheap price.", "Date": "February 6, 2014"}, {"Title": "PERFECT", "Author": "ASLIHAN ERTAM", "ReviewID": "R15HHTSNDMP50T", "Overall": "5.0", "Content": "IT IS EASY TO GRIP. IT IS VERY EASY TO USE IT AND IT TAKES SPECTACULAR PHOTOS :) I LOVED SAMSUNG WB2100.", "Date": "January 18, 2014"}, {"Title": "Wasn't as good as I expected.", "Author": "K. Ellibee", "ReviewID": "R33F1F9BJ51BUP", "Overall": "1.0", "Content": "I have to admit, I was drawn in by the beautiful red color.  However, the picture quality on high zoom wasn't quite as good as I expected it to be.  I ended up sending this item back and ordering a Sony Cybershot DSC-HX300 and I love it!", "Date": "May 1, 2014"}, {"Title": "Love this model", "Author": "Becky  Sorensen", "ReviewID": "R21YW5286JSRG1", "Overall": "5.0", "Content": "Taking pictures with the zoom was great, enjoying the camera very much while we enjoy the sunsets and rises in Hi", "Date": "March 2, 2014"}], "ProductInfo": {"Price": "$329.99", "Features": "16.4MP CMOS Lens\n35x Optical Zoom\n3.0\" LCD - 460K pixels", "Name": "Samsung WB2100 16.4MP CMOS Digital Camera with 35x Optical  Zoom, 3.0\" LCD Screen and 1080i HD Video (Black)", "ImgURL": "http://ecx.images-amazon.com/images/I/51Vt%2BVj8pvL._SY300_.jpg", "ProductID": "B00BCPQMCM"}}