{"Reviews": [{"Title": "Packed with features, powerful and appealing for casual users", "Author": "APC Reviews \"APC Reviews\"", "ReviewID": "RAUGKSGOY7Z1Z", "Overall": "4.0", "Content": "The Sony DSC-WX300/B 18 MP Digital Camera with 20x Optical Image Stabilized Zoom and 3-Inch LCD is a strong entry from Sony against other cameras in this market segment and price point. It meets and beats several features of competitors, but also fails to be quite as much as it seems to be at first glance. Nevertheless, anyone considering what to take along for photo making on holiday should seriously consider the Sony DSC-WX300.First let me say that I am a long time fan of Sony digital cameras, and that I have owned many different CyberShot models in the past, and that I am an avid user of the Sony NEX cameras. Superficially, the Sony DSC-WX300 looks like a tiny NEX model. The controls are laid out using very much the same wheel and button system on the back to access the menus, and the styling is very similar. The all metal body conveys a feeling of quality and looks great.Aside from the controls and family resemblance, they Sony DSC-WX300 is at heart a CyberShot, the Sony line aimed squarely at point and shooters, not at serious amateurs (whatever that is; a good photographer who is not paid any money for his pictures, instead of a mediocre photographer who is?). It is packed with features appealing to sophisticated but casual users. But it is a JPEG image only camera. It does not output RAW image files. It also lacks multi exposure bracketing. Although it would be easy to assume that the Sony DSC-WX300 is a possible competitor to the Canon PowerShot S110 or the Panasonic LUMIX LX-7, the Canon and LUMIX cameras are both more \"serious\" point and shoot, \"pocketable\" cameras, with RAW output and more comprehensive PSAM modes.All that said, the Sony DSC-WX300 has some very interesting features that make it a serious camera for holiday, snapshot and webcentric photo making. The main selling point for the Sony DSC-WX300 are its very small size, it really is \"pocketable\", combined with its rather amazing 20X optical zoom range, a mind boggling 40X zoom range using optical + digital. The image quality from the lens appears to be quite good. But in the end the image quality is both driven by and limited by the size and sophistication of the tiny thumbnail sized sensor and the electronics. This is the Achilles heel of all digital cameras, and very much the weak point of all pocket cameras. At the end of the day, especially with micro sized sensors used in pocket cameras, no matter how sophisticated, as ISO speed increases there's just no way to not have image quality start to suffer as heavy noise corrections start to be applied to the image by the camera.Sure enough the Sony DSC-WX300 produces rather amazingly good looking shots up to about ISO 800. But, as with all pocket cameras, the image starts to soften after that. As is the case with almost all digital cameras these days, it's hard to tell just what part the quality of the lens, the limitations of tiny sensors and the alchemy of digital lens and image correction in the camera play in making the final result.The Sony DSC-WX300 features excellent movie capture specs. But, as with most still cameras that also double as video cameras, the length of any one recording is limited not by storage but by the ambient temperature and other factors that impact how quickly the sensor will heat up while recording continuously. If it gets too hot it will shut down. The Sony DSC-WX300 is rated for video recording up to twenty-nine minutes. I made a ten minute test video without any problems. But, on a hot day, or if your hands have warmed the body already, or the camera starts out hot for any reason then the maximum recording time may be reduced quite a bit. It's not a movie/video camera, it's a still camera that you can capture video clips with. Still, in such a tiny size, the quality and video feature are pretty amazing.The menus are traditional Sony CyberShot: concise easy to navigate, and without too many options. The Wi-Fi connection worked well for transferring files to and from both a smartphone and a PC, although it requires installing the Sony PlayMemories app. Of course all the devices have to be networked together, a task that's easy if you have little to no router or device security but which becomes an escalating pain as your standards for device security and interoperability increase. Still, it works.Battery life appeared to be as advertised: rather good. You plug the charger directly into the camera rather than removing the battery and charging it alone. As seems to be the norm for these kinds of cameras, there are a zillion \"scene\" modes. Why it's assumed by camera makers that someone will have the presence of mind to parse, understand and select the correct scene mode but is assumed to not be organized enough to use PSAM modes is a mystery. The only thing lacking is a \"two people being hit on head by coconut while standing in front of blast furnace mode\" or maybe a \"Batman in white cape snow boarding\" mode. But, if you have time to investigate all the modes, and the memory to remember which one does which, it's an asset.The camera has three different auto modes, but no easy direct PSAM control. About the 18MP sensor: mega-pixels alone are not a good guide to picture quality. An image from a 10MP APS-C sensor with a mediocre lens can easily look better than a picture from an 18MP micro sized sensor with an excellent lens. And let's not forget that with digital images that a large part of what you see in the image has passed through numerous digital processing and correction stages in the camera. The skill of the programmers and the processing power of the camera play an important role.All that said, the Sony DSC-WX300 delivers some serious value, with a few compromises, and has a number of outstanding and well implemented features. It will easily beat the image quality from even the best smartphone cameras, it is almost as pocketable as a smartphone, it will produce full HD 1080P movie clips, it will network with social media picture sharing via Wi-Fi to your smartphone or tablet, and it has an extraordinary optical zoom range that should cover just about any picture situation.If you don't need features like RAW file output, exposure bracketing and PSAM type controls that are offered by cameras like the  Canon PowerShot S110 and Panasonic LUMIX LX-7, and are after a super portable high quality point and shoot for holiday and family snapshots, then the Sony DSC-WX300 is a serious contender and well worth buying. RECOMMENDED.", "Date": "May 23, 2013"}, {"Title": "Quirky little camera!", "Author": "rbhatta \"A Dinosaur you can trust!\"", "ReviewID": "R1EVV7UVB16I9Q", "Overall": "3.0", "Content": "The quest to find the perfect compact digital camera which takes excellent Photos and 1080p videos at the same time is no easy matter. I have tried various models from various manufacturers (primarily Canon & Sony) each one seems to contradict each other. While one model impresses you with Photo quality but fails miserably in video. There is always one thing or the other that disappoints me. May be it's me or I am too picky when it comes to quality or my expectations are too much to ask for in this price range & form factor.My search for sub-compact cameras is still on and I am yet to find the perfect sub compact camera. Make no mistake, this camera takes very good pictures for a Point & Shoot form factor camera which is easy to carry & Lasts all day without having to worry about recharging the battery. With an 18.2 megapixel packed into this tiny body and SONY's `Exmor R CMOS' sensor and 20x optical zoom lens (35mm equivalent of 25-500mm) The Zoom is impressive for this small size form factor and can be extended further to 40x with Clear Image Zoom (Digital Zoom). There is also `Optical SteadyShot' feature to reduce blur when shooting handheld and you can also shoot at 10 fps which tells me this camera has speed and potential.In the real world tests using this camera I find some strange design quirkiness which I need to learn to overcome. Firstly you will notice the shutter button which is placed oddly from the side and the select dial there instead. 99% of the time my finger goes to that dial to realize that I was pressing in the wrong region.The extended lens assembly and the placement of flash on the body of the camera do create shadows on the subject especially when you are taking close-ups or macro shots. This problem is prevalent in most cameras with extended zoom lens. There is no cure for this bug. The only workaround is to disable flash and manually illuminate the subject and adjust exposure settings to compensate for the need of flash.Thankfully, this camera does have very good low light performance for compact P&S.; I did find most of my photos come out clear and sharp even when I disable flash. But you will have to tweak the settings and adjust the exposure manually to achieve the desired results. Superior Auto will take multiple shots and superimpose them to achieve the desired exposure but for better control manual is best.`Background de-focus' to make it look like a shot taken from`High end' DSLR is a cool feature indeed and I am pleased to see SONY has included a dedicated option on the dial for this. I love this feature and tend to use it a lot with impressive results.The video results are very good. It has the capability to record in `AVCHD' as well as `MP4' file formats. `MP4' will be useful for sharing on YouTube or other social media sites without any additional need for software conversion. The zoom while you take video is smooth and very steady and results are impressive.Wi-Fi implementation is something I wished was pretty straightforward but it is not. All I wanted was this camera to have the capability to transfer photos to my NAS directly without having to connect this to my PC to download photos. But the process is cumbersome. In the end I gave up on using Wi-Fi on this camera. It is good to know it is there but not very practical to use.There is app to control the camera using Wi-Fi and also view pictures on your Smartphone or tablet but again for me that did not appeal me yet. When I am at home I prefer to watch it on my TV and this camera does output on HDMI with full glory. It also has the capability to push pictures to your HDTV wirelessly but I could not get that to work because my TV is not a SMART TV.There are plethora of features on this camera that will keep one busy for a long time experimenting it one by one but the basic features presently attempted has convinced me that despite the above mentioned quirkiness it does take good photos and videos but my quest to find the perfect subcompact camera is still not over.PROS[+] Very small body with impressive features[+] Takes very good pictures and video[+] Super battery life[+] Large easy to view LCD[+] 20x optical zoom for a sub compact camera[+] Fast auto focus systemCONS[-] Oddly placed shutter button location[-] Large Zoom Lens & Flash placement causes shadows on close-up shots[-] Still images are noisy when taken simultaneously with video[-] Odd location for HDMI output port[-] Flimsy door for Multi function port (For charging battery)[-] Looks rectangular box shaped wished it had some contour for better hold feeling.Bottom-line:------------For the price you pay it does give you good results. It does take good video so you can skip carrying a bulky camcorder. The photo quality is very good with good color balance & exposure. There is some quirkiness that one needs to learn to overcome especially the placement of the shutter button.", "Date": "May 22, 2013"}, {"Title": "Great pictures.  WiFi quirky and buggy", "Author": "EJon", "ReviewID": "RZE4IH7UJ43YC", "Overall": "4.0", "Content": "First the good news:  as a camera, this is fantastic.  It takes beautiful pictures, and the low light performance and image stabilization are incredible.  I've taken pictures in dimly lit rooms at full 20x zoom without a tripod, and they come out crisp and flawless.  The operation is simple and intuitive, and go from fully automatic, to automatic with \"tweaks\", to scene selection and finer control.In addition to the incredible zoom, another extremely nice feature that was once unavailable at this price is a 10 shot burst mode, which can go at 2 or 10 frames per second.  Very handy.  [Update: I recently used the burst burst to photograph some break dancing street performers, and got some truly *amazing* shots].I could go on, but I honestly don't think you'll get better pictures from any point and click on the market in this price range.Now for the thing that cost them a star.  Built-in WiFi is the \"new thing\" in cameras, and it was one of the things that sealed the deal for me on this camera. I'd guess in a couple of years they will have worked out all the bugs. Unfortunately, however, they're not there yet.  WiFi is so new in this camera that it's not discussed in the manual.  They have a special little instructional insert about it with *extremely* limited information.There are two ways to use WiFi.  The first, and most useful, is to send pictures directly to a smart phone, to upload to FaceBook, email, etc.  To do this, you go to playback mode, click \"menu\" and tell it to send pictures to the camera, then select the pictures to send.  The camera then sets up its own hotspot, which you connect to with your phone and then use a special app to copy them.Here's the problem, at least on an iPhone: because the hotspot is not a fully functioning WiFi server, the phone sees it as a limited function connection and will eventually switch over to another server if it's available, which will interrupt the transfer.  That means that if you try to use this feature with a known server nearby, you have to *tell the iPhone to forget that server first*, or the transfer will fail after a picture or two.  If the server has a password, it will be kind of a pain to reconnect.  Once I solved this problem (by trial and error), it worked fine and the pictures copy directly to the camera roll, from which you treat them just like pictures taken with the phone. I think this problem is ultimately due to the stovepiped architecture in iOS, so it might work better with Android.One additional warning: by default pictures are transferred at a lower resolution in this mode.  You have to go into settings (on the phone, not the camera!)  to enable full res. transfer.There's a variation on this mode which allows you to control and view the camera with your phone.  That might have a few niche uses (some of them rather unsavory!).The second way to use Wifi to send your pictures directly to your home computer, much like a wireless scanner does, but it appears to be undocumented.  You go into the settings menu and connect to your local WiFi server.  Then, the first time you connect you camera to the computer with a cable, one of the virtual \"disks\" which appears will lead you to software to download to configure that computer to receive images wirelessly from the camera.  After that, when you're on that wireless network, you can go to the menu and send all pictures to that computer.  This works OK, but sometimes the app hangs at the end after the transfer is complete.  Since I'll be at home already, I'll probably just use the cable. [Addendum:  I've discovered that this mode is *very* unreliable.  When transferring a large number of pictures, it will often fail part way through.  I strictly use the cable connection now].Bottom line: fantastic camera, but if the Wifi functionality is important, consider waiting a year or so until they iron out the bugs.Ironically, if the camera hadn't had WiFi, I probably would have bought it anyway and given it 5 stars.", "Date": "June 14, 2013"}, {"Title": "Sadly disappointed...", "Author": "Shopaholic", "ReviewID": "R3PEG63AK98L9V", "Overall": "2.0", "Content": "I received this Sony DSC-WX300 camera as part of the Amazon Vine review program.  I have been procrastinating on doing my review because I really, really wanted to like this camera and wanted to give it a fair chance.  I have been using it frequently for a month now, but I am still not feeling the love.  I am not a professional photographer, nor do I know a lot about the technical aspects of cameras.  I am simply a \"mom with a camera\" who uses my point & shoot cameras mostly in Auto mode, as most people do.  When I want to get more serious about photography and mess around with changing a lot of settings, that is when I lug around a heavy DSLR camera.First I will say what I actually DO like about the camera:*I really like the small size.  It is easy to slip into a larger pocket, or in my purse.  It took me a couple of days to get used to the small buttons and controls, but they are okay to use with my medium sized hands.*The 3\" LCD screen is very large, and has excellent detail in normal or dim lighting.  There is also an option to change the LCD resolution to standard, in order to conserve the battery.*The auto focus works quickly.*I am amazed that Sony packed a 20x optical zoom into such a tiny camera.  I have been able to capture some wonderful distant outdoor shots with the great zoom lens.*The battery life is phenomenal.  On my heaviest day of use, I took a little over 400 photos (mostly outside), and the battery indicator still showed 2 out of 4 bars left remaining.*Outdoors shots of landscapes with normal lighting have amazing detail and vibrant color rendition.*The In-Camera Guide is very helpful, especially since the printed instruction manual that is included is not very detailed.  There is a more detailed instruction manual available online at:  http://docs.esupport.sony.com/dvimag/DSCWX300_guide/en/index.html*I briefly tested the video, and it seems good.  There is the option to record in either AVCHD or MP4 formats.  MP4 is good for sharing to Facebook or YouTube, since it does not need to be converted.  The zooming function during video recording is smooth, and not overly noisy.Now are the things that I do NOT like about the camera:*The body of the camera is too slippery.  I do not dare use this without the wrist strap.  I am hesitant to hand it to other people to take a photo, since I am afraid they will drop it.  This camera really needs some well-placed rubber grips.*It does not include a dedicated charger.  For a camera of this price point, that is simply unacceptable.  There is a dedicated charger available for purchase from Sony, but it is rather expensive.  The battery charging port (micro USB) is behind a flimsy door that is hard to open.  I have broken 2 fingernails already while struggling with it.  The micro USB connector is very hard to push into the charging port.  In contrast, the infrequently used HDMI micro jack is conveniently placed on the bottom of the camera.  Do not get the micro HDMI port confused with the charging port like I did the first time.*I am very disappointed in the low light performance when using the Auto modes.  I know that this performance could be improved by changing the ISO settings, but there is not always time to do that depending on the situation.  I am used to better Auto mode performance from the Canon and Panasonic point & shoot cameras that I also own.  Worse yet, the flash does not always go off when needed.  The inside photos that I take are nearly always a bit dark.  It is usually an easy fix in Photoshop, but I have never had this bad of a problem with the previous point & shoot cameras I own.  It is a real bother to have to edit so many photos.*I tried for over an hour to set up the Wi-Fi function on my Windows 8 computer, before I finally gave up.  The computer shows that it recognizes the camera, but it will not connect even after restarting both the computer and the camera.  When I have the extra time, I plan on calling Sony customer service to try and get this feature up and running.*The flash placement causes me to put my middle finger over it while pushing the shutter button with my index finger.  I ruined quite a few indoor shots before I realized I was doing that.*The camera shoots still images at an aspect ratio of 4:3, which would translate to a paper print size of 8\"x6\" or 4\"x3\", assuming that you don't crop the image.  Of course, most average users print using 4\"x6\" photographic paper.  Many point & shoot cameras shoot at 4:3, so that is not a true downfall of this Sony camera.  However, the old Canon Elph camera I own has a very nice optional feature that allows me to \"gray out\" the area of the LCD screen that won't print using 4\"x6\" paper.  That is greatly beneficial when framing a shot on the LCD screen.  My 5 year old Panasonic Lumix DMC-TZ5K 9MP Digital Camera with 10x Wide Angle MEGA Optical Image Stabilized Zoom (Black) camera has the option to shoot still photos in 3 different aspect ratios though (including 3:2 which is native for 4\"x6\" photographic paper), so this problem is never encountered.*Speaking of the LCD screen, it is a really large 3\" screen.  However, it has terrible glare in the bright sunlight.  I often find myself trying to shade the screen with my left hand, while holding the camera in my right hand.  That is quite awkward, and it does not always help.  I miss the days when most point & shoot cameras had an optical viewfinder, which is always usable even in bright sunlight.*The tripod receptacle is made of plastic, instead of metal.  Plastic tripod threads are very easy to strip out.  For this price point of camera, it is a very cheap thing to omit.*The camera doesn't have a P/A/S/M full manual control, which is disappointing at this price range.  I do not typically use point & shoot cameras using manual settings, but more serious photographers do.*The shutter lag seems worse for inside shots than the Panasonic and Canon point & shoot cameras that I own, while using the Auto modes.  Those cameras are 5 and 6 years old, so I would have thought technology would have improved a bit.*I saved the worst for last, and I honestly wonder if this is a defect of my particular camera.  I read all of the reviews here on Amazon, and no one else complained about this.  The write speeds are very slow when taking still photos.  Sometimes it takes about 2 seconds, and that is with a fully charged battery.  I initially started using this camera with an older memory card, so I naturally thought that was the problem.  Then I switched to using a SanDisk Extreme 32 GB SDHC Class 10 UHS-1 Flash Memory Card 45MB/s (SDSDX-032G-X46) card.  Sony recommends a minimum Class 4 memory card with this camera, so a Class 10 card should be more than sufficient.  The write speed is just as slow with the better and faster card.To sum it up, I am sadly disappointed in this camera.  I fully expected to really like this camera, but I do not for the variety of reasons that I listed above.  I also own a Sony Alpha DSLRA350K 14.2MP Digital SLR Camera with Super SteadyShot Image Stabilization DT 18-70mm f/3.5-5.6 Zoom Lens and a Sony NEX-F3K/B 16.1 MP Compact System Camera with 18-55mm Lens (Black), so it should be obvious that I am normally a fan of Sony cameras.  With regret, I rate this camera as only 2 of 5 stars.", "Date": "June 23, 2013"}, {"Title": "Unique and Flexible P&S; - Not for \"Pixel Peepers\"", "Author": "FiveForm \"FiveForm\"", "ReviewID": "RJFDLDP0VCZWB", "Overall": "5.0", "Content": "I picked up my copy of the Sony Cybershot DSC-WX300 at a local BB store which very compliantly matched Amazon's price - great deal!  In unboxing I was amazed and impressed by the small size and detailed controls.  I didn't really expect this camera to be an RX100 or an SLR and I didn't buy it for that purpose.  It's strange these days in our \"get what you want when you want it\" consumer culture that we want all equipment to be all things.  I began a professional photography career in 1969 when I enrolled at a prestigious west coast photography and fine arts college.  Our first camera was a 4x5\" sheet film view camera on a 20 pound tripod!  The results you got were entirely dependent upon your ability to know and use the basic controls of this equipment.  No auto-focus, auto-exposure, certainly no pocketability, no immediately viewable results, etc., etc.  That's not so say that we shouldn't advance technologically, but when the complaints I read about this truly tiny viable camera with a 20x optical zoom lens, panorama, 3D, ridiculously close range macro focus, roll in I'm astounded how we must have all features at the highest levels, and all in one package!  Well, that hasn't happened yet.  Engineers (I am one) can't solve for all requirements in one solution.  We still live in a world where it might take more than one camera, or other tool, to do it all.Having gone into this buy with the aforementioned mindset, I've found that the pixels really aren't the most desirable at 100% magnification and the Wi-Fi communication isn't perfect and capturing sports may not be the forte of this little gem.  However, the balance of good features just shouldn't be ignored.  I own two other Sony cameras, of the NEX series persuasion, and they sport APS-C sized CMOS sensors of 16 and 24 megapixels.  The basic formula in engineering digital cameras from the pixel viewpoint is that more pixels on a small (in this case, 1/2.3\") sensor doesn't necessarily create a better image.  All digital camera images originate as \"RAW\" data which is then processed and converted into an output file.  In the case of the Sony WX300 that file is a JPEG file.  Since the physical size of a digital camera can limit the size of the sensor you aren't going to see a 1/1.3\" or a full 1\" sensor in this body (at least not this year...).  So, we have to rely on the magic of the BIONZ image processing engine, which is basically software (firmware) which has been carefully created to do its best processing the raw sensor data into a decent end result which is small enough to store on your SD card.When the user of this camera selects one of the two auto settings the raw image can be processed in a number of different ways.  The high ISO settings on this size sensor are going to generate noise - rule of thumb, the larger the sensor, the less noise, in general.  The BIONZ imaging engine (software) does its best to reduce or mask this noise.  Since you don't have the option to process the RAW files yourself, you have to live with the end product of the process, so for some the pixels are too soft or fuzzy, smooshed looking or blurry, due to the processing engine (BIONZ in this case) trying to make it less noticeable.  However, although the pixels don't look too happy at 100%, when the full frame is viewed at normal width and height, especially on an electronic screen, then you generally don't notice.  You'll also have to limit the size you print, but again, there are variables there since larger prints aren't really meant to be viewed at a distance of inches - rather feet.For my use - and that's really the end determiner since this is a tool, not toy (?) - it's a perfect complement to much larger cameras which don't drop in my shirt pocket or reach out to 500mm.  It's great to have that $1000+ SLR sitting at home with the potential to take far better shots than your P&S;, but let's face it; it's the camera you have with you that will take the shot that doesn't get missed, not that beast that you left behind.  My first digital camera was a Logitech Fotoman which would create black & white images of about 150x250 pixels.  I could still print them at around 4x5 inches, or so and still have them.  The shame is (if there really is any...) that I could have taken many of the images with a film camera at the time and had better printable results today.  The same will be true as we move into the next several generations of cameras where we'll see focus correction after the shot, 3D, holograms, and whatever which aren't available today.  I'm confident that the images I take with the WX300 will live on and have value.  I won't leave home without it and with some practice I'll also understand how to obtain the best images from it.  I love the Wi-Fi connectivity and plan on capturing unassuming candids of the grandkids using this feature, as well as times when I really would rather not be that close to the action.  Certainly, it won't be the last camera I use, nor the only one I possess at any given time - right tool for the job - and if you like true pocketability, panoramas right out of the camera, remote control from your phone, extreme reach at distance, then I feel you'll love this camera.  It has the same imager as its bigger brother, the HX50, with less zoom reach, but $140 less damage to your wallet or purse, and significantly smaller size. But again, it may not be for those \"Pixel Peepers...\"UPDATE - 7/16/2013:  After shooting a good number of event shots this past weekend with the Sony WX300 I have further refined my understanding and use of it.  Long shots at extreme distance and high ISO using a variety of settings, including Programmed mode, Auto and Auto+ yielded a wide range of results.  Sony definitely turns up the noise reduction full blast, beginning at 800 ISO, and particularly at 1600 and 3200.  I was seeing the \"Painted Effect\" which other users commented on here and at other review sites, where the image viewed at 100% begins to look like a watercolor filter was used, yet these same images at full width on a screen actually looked quite good.  Additionally, when using either of the auto modes, but particularly the \"Superior Auto\" (camera with plus icon) mode, the shot-to-shot time was a matter of several seconds while the imaging engine compiled several shots to get the best image.  I also experimented with forcing the ISO down by setting to programmed mode  and then selecting either 80 or 100 ISO.  Of course this didn't fair too well under low light with the subjects moving.  However, I was able to get some pretty good, low grain and low noise reduction images when using the \"Handheld Twilight,\" and \"Anti-motion Blur\" scene settings wherein several images at differing exposures are layered to get sharp and mostly noiseless images.  Again, the post processing occurring in the camera can take some time, so you won't be able to shoot another image until it released the camera to you again to snap another.  I do wish that Sony would allow the user to turn off the auto image review which seems set to about 2 seconds.  Personally, I like to review the images (play them back) when I want and not immediately after each shot.  In every other P&S; and SLR or mirrorless camera I have (including many Sonys) I can turn off auto image review.  Having it on prevents me from taking another shot until the LCD clears.  However, one way around this is to use continuous shooting mode (either low or high) which bypasses the playback until the end of the series you are shooting.  Well, as I said earlier in this review, you can't have everything in one package!Still love this camera, though.  Just a few notes to Sony, however.  1) Allow auto image review to be turned off.  2) Allow auto noise reduction at high ISO to be lowered or turned off.  3) Offer a RAW file image capture option, if possible...  ;-)", "Date": "July 10, 2013"}, {"Title": "Premium Point and Shoot Camera", "Author": "Kiyo M.", "ReviewID": "R2TNQIS3P3BYO", "Overall": "4.0", "Content": "If you're a major photo enthusiast and need more control, then you should be looking at more of the Sony DSC-HX50V model.This camera is literally a point and shoot camera (there is no manual mode to control aperture or shutter speeds) -- but with some premium features. This camera will be more than enough for a beginner because of its ease of use - it's really dumb proof; if you don't know what aperture, white balance, or shutter speeds are, you'll be happy with this. You can just scroll up and down with the wheel dial to adjust the brightness, color (warm or cool), and vividness. There's also different picture effects like isolating colorI own some higher end cameras, but what I am still impressed about this camera:- It's quite light and compact - easy to carry; large LCD screen- Sony has the quietest zoom noise on the market; If you tried the Fuji, it is NOISY.- Sony has the best video capability on digital camera hands down; it can shoot 1080p at 60i. I was impressed with the video it produced considering the size of this thing - it can really fool people to think it was shot on a regular video camera. What's also great is that when you're zooming while shooting video, because of it's low noise zoom mechanics, it won't pick up and ruin the video (I've monitored the playback of the video with headphones and I could not hear the zoom noise compared to other digital cameras shooting video and zoom).- It also has a very nice stabilizer for video; you can see/feel the gliding motion- Dedicated Movie button for quick video shooting- Great Macro- It has built-in WIFI to transfer pictures wirelessly to your smartphone or tablet. (You just need to get Sony's PlayMemories app)- It has Sony's impressive Panorama mode- 20x zoom (silent, which is nice! Don't take it the wrong way, it's not DEAD silent but if you tried other digital cameras, it is SILENT)The dial is very plasticky and cheap feeling; you can tell where they saved costs on the material.The WIFI function to remotely control the camera with your smartphone, while the concept is very cool, it is a major hit or miss; personally, it would disconnect on me or the \"live\" video feed doesn't keep up at all when I move the camera around.I wish in Program Mode, the wheel dial could just automatically adjust exposure compensation; the photo creativity dial is not available in this mode. To me, it feels like wasted buttons.Photos came out nice and sharp (it's more than enough for photo blog/etc); of course there is expected noise, especially when there isn't much light, at this price range and sensor size.I would say this camera is still geared more towards a beginner class; the Sony HX30V and Canon S100 are still above this camera's class. I own both of those cameras and this camera definitely won't replace them. However, because of its compact size and weight, I'll use it as a backup camera.If you're looking for a light/compact easy to use camera with excellent video for its size, this is an option. If you want more power features and control, you'll have to step up to Sony's higher end HX model. For the average consumer and beginner, this camera is more than enough and simple to use.", "Date": "June 26, 2013"}, {"Title": "A great way to get started", "Author": "BK83", "ReviewID": "R3JPRUBT0YN4NH", "Overall": "5.0", "Content": "This was my first upgrade as far as cameras are concerned. I am not a photographer by any means, but I was interested in getting a camera that is a step above a simple point and shoot. While I originally looked at digital SLR cameras, I was put off by the price and since I do not have the knowledge base in this area I decided to stay away from them. A staff member at my local electronics retailer showed me this camera and I was very impressed. I purchased it here as the price was better than in the store.This camera takes incredible pictures, at least in my opinion as a typical user and not a professional. I took it to the arboretum to photograph wildlife and flowers the first weekend after I received it. The zoom allows for great pictures from a distance. In fact, I caught a great shot of a hummingbird on approach to a flower from about 15 feet away. The image came out like something from a National Geographic magazine.The camera's operation is simple and intuitive. I found the features that allow for color enhancement to be not only a fun addition but also very easily accessed. The camera's start up time is fast so you can quickly start taking pictures after turning it on, which is a huge difference from my last camera. There is one criticism, but this may be more due to my lack of experience using a Mac than anything else. For some reason I cannot figure out how to watch the high-definition videos on my computer. The camera records them in a format with which I (and apparently my MacBook) are not familiar. I imagine this is a simple fix, so I plan to check the forums online to get some direction. As I said, this is probably due more to my limited knowledge rather than a true problem with the camera itself. I am still experimenting with the other features, so I imagine I may be updating this review as I get more acquainted with the camera. That said, I only expect more positive attributes at this point.Lastly, battery life is worth mentioning. I was skeptical at first but the battery actually lasted longer than anticipated. I have only charged the camera twice since I bought it and I got about four days of heavy use out of it before I had to charge each time. While I expect this to go down with age as most batteries lose their ability to hold a charge over time, I was favorably impressed with the life of the battery. This is particularly impressive since the camera does not have a viewfinder and you must use the screen.Overall, this is a great camera to get your feet wet if you are moving in the direction of taking more artistic photos or just want a solid camera that captures fantastic images. Though the price was on the higher end for me, I have found it to be worth all of what I paid.", "Date": "June 11, 2013"}, {"Title": "Amazingly versatile super compact, quick shooting, excellent low-light performance point and shoot.", "Author": "austin_Larry", "ReviewID": "R19TE7QMXDUHLG", "Overall": "4.0", "Content": "I don't ordinarily start a review with my summary and conclusions. But I am going to here since there are a number of lengthy reviews and if you want my bottom-line here it is. Sony created a remarkable high performing point and shoot in a very small and relatively light weight body with fantastic battery life. The most outstanding features to me are the very fast shutter and autofocus (rivaling DSLRs), vibrant and accurate color reproduction, good Wifi and smart phone control, and astounding low-light performance. Where the camera falls a little short is with background defocus (explained more below) and very good but not great video performance. Overall though this is a great take everywhere, in the house, everyday companion and is recommended.I have had the pleasure to try this camera and last year the Sony DSC-HX30V. Both are great cameras and highly recommended. The HX30V set the bar very high for me because it provided not only great pictures but GREAT video. The video was better than camcorders costing more money. The WX300 surpasses the 30V in many ways, except video. Even though the lenses are the same and the sensor seems to be the same.But what Sony has accomplished is quite remarkable. And overall this is the point and shoot camera I will be carrying with me from now going forward and here is why. Size. I want my point and shoot (my `high end' camera is a Lumix G3 with a variety of lenses) to be easy to use and just slip in a pocket and have with me everywhere. As I am writing this review I have both cameras with me. The HX30V does feel very good in the hand, but it is a lot heavier and bulkier. The WX300 is just remarkably small and I can put it in a pocket and always have it at my beck and call. And speaking of that, when you do want to take a shot you want power. Fantastic battery Sony included. Perhaps the best battery I have ever had in a portable device. I have taken hundreds of shots the past few days and the battery is still going. You don't need to buy an extra battery here. I did buy one for the 30V.* Autofocus* Shutter* Low-light performance.Wow. The 30V was the closest point and shoot I ever used in coming close to a DSLR or mirrorless in terms of shutter performance. The WX300 is fast. Really, really fast. I am not missing any shots. And the rapid fire works great. As fast as advertised. The autofocus is quick and accurate and a very good performer even in low-light.The low-light performance for pictures is extraordinary. One thing I use a point and shoot for is around the house everyday stuff and to document parties and get togethers. A lot of the action is inside. The WX300 can be used in most indoor lighting without flash. I love this because colors are more accurate even if you are getting some more noise. Overall the indoor results without flash and with flash have been great, better than the 30V which was pretty darn good.The Wifi features work fine. No problem with iPhone 4, and iPhone5, and an iPad. I was used to how to do it though. You have to go into settings and select the Wifi hot spot the camera creates, then open the Playmemories Mobile app. It becomes second nature. I also `paired' the camera with one of my home computers. You then want to select access point (ie your wireless network). You are then good to go. Wireless transfer will transfer videos and pictures. You don't get a choice of what to transfer when sending to a computer but it does only transfer new items. Sending to a phone or tablet you can choose which items to transfer.The WX300 does have a new feature compared to the 30V, smart device control. You choose this and then what the camera is pointing at shows up on your phone. You can zoom in and out, although this is slightly clunky and set a timer. This is a great way to get your vacation photos. It is also kind of cool.Other things I like. Easy to use panorama produces consistently good results. Options easily accessible in almost every shooting mode include brighter and darker (EV control) and warmer and cooler. Warmer will bring out yellows and reds, cooler green and blues. If you never used this it can be fun to play around with. There are fewer options and fewer modes than the 30V. This was obviously deliberate and I am ok with it. In the P mode you can control metering, ISO, and white balance. It is enough that someone with more photographic experience I think will be more than ok with.Where it falls short.Video. Even though as I mentioned the sensor and the lens seem to be the same as the 30V and Sony improved autofocus and shutter speed, the WX300 seems to take a little backward step in video. Now let me say it is the second best video I have ever seen in a point and shoot. Just not...quite...as good as the 30V. It is still very good video indoor and out. And you can in the menu change it to MP4 if you want which also produces good video quality. There is more noise during zoom compared to the 30V. This might be because of the small body. Not bad, but more.Background defocus. I have tried hundreds of shots. In all 3 settings of background defocus, low, medium, and high. I have tried it with people and flowers and pets. It has defocused once. Once. And it wasn't a good picture, the subject was blurry as well. I have to say this feature just does not work. The camera is trying to produce `bokeh', or the defocused background. It just hasn't worked. And I did try hundreds of shots to get it to work.Overall though this is a great everyday camera that can help document your life with great results. I like Sony lenses, sensors, and software. I think they produce vibrant but accurate pictures with a lot of detail. The WX300 certainly does that. It does it in a remarkably small and lightweight body with extraordinary battery life. It has upper notch autofocus and shutter speed for a point and shoot and the best picture low-light performance I have ever seen in a point and shoot. Highly recommended.A great case for this camera is the Lowepro Santiago 20 Camera Case (Black)", "Date": "May 25, 2013"}, {"Title": "Very Impressive!", "Author": "Samuel", "ReviewID": "R2D3WH9POBW8D", "Overall": "5.0", "Content": "THIS HAS IT ALL IN A VERY SMALL PACKAGE!Very impressive results!Long optical zoom in a pocket camera withe a very usable digital image.Digital Zoom is amazing.  Very sharp considering.In camera special effects are addicting.Lens sharpness rivals many DSLRs.I think this is my go-to camera for quick in-field work.Sony is getting very close to having the absolute best creative feature set.", "Date": "May 1, 2013"}, {"Title": "Great for the beginner", "Author": "Gadget Geek", "ReviewID": "R2RJEQZ3DK3N5W", "Overall": "4.0", "Content": "I'm a techy guy, and as my nickname suggests, I'm into gadgets.  However, I am no professional photographer.  I won't be able to tell you about all the different ISO settings, or other manual settings.  I'll leave the reviews of certain aspects of the camera to those that know better.  However, as a basic P&S; user, here are my thoughts:## Many shooting modes!3D Still imageMovie Mode (AVCHD)iSweep Panorama - for panaromic shotsProgram Auto - Auto exposure with adjustable settingsSuperior Auto - Shoot sharp images while reducing blur and noise automaticallyIntelligent Auto - Exposure adjustment with automatic settingsBackground defocus - Shoot with background defocusScene selection - select from 14 different scene modes (soft skin, soft snap, anti motion blur, landscape, night portrait, hand held twilight, high sensitivity, gourmet, pet, beach, snow, fireworks)Whether you're a beginner or a professional, theres a mode for you.If you have it in timer mode, it can even be set to take a photo 2 seconds after 1 or 2 people are detected.## Video:Video can be shot in 3 quality settings:AVC HD 9M (HQ) - standard image quality 1440x1080 (60i)AVC HD 17M (FM) - high image quality 1920x1080 (60i)AVC HD 24M (FX) - highest image quality 1920x1080 (60i)I only shot video in standard image quality.  Videos in low light seem rather grainy but still watchable.  Didn't expect too much.  However, videos in adequate lighting did provide some crisp videos.  You also have the ability to take photos while actively recording the video!  Video files are saved with the .MTS file extension -- I was able to view it with VLC player.## 3D Photos:  Though I've taken some photos, have not had the opportunity to view it on a 3D screen.  As the camera's screen itself is not 3D, there is no way to tell the results until you hook it up to a 3D screen.  3D here is simulated.  It takes two quick shots and attempts to combine it to achieve the 3d effect.  AFAIK, normal 3D cameras will capture images from lens in two locations.  Unless you use a special 3D screen, the photos will look like any other photo.## Wifi:  With wifi, you can either control this camera with a smartphone, or connect to a computer to save images directly to it.  This is achieved by creating an ad-hoc network (direct peer-to-peer connection).I tested the wifi by controlling it with my android smartphone -- Motorola Droid 4.  I downloaded Sony's PlayMemories app from Google's PlayStore.Setup is simple -- On the camera, go to the menu and select \"ctrl with Smartphone\".  From your smartphone, turn on wifi, find the SSID #, connect, then open up the app.  You should then be paired.  Your smartphone will display whatever your Sony camera is displaying.  You'll be able to control it remotely -- zoom in/out, take photos, video, and adjust some basic settings.  While the photos will be stored on your camera's SD card, you have the option to save a small version on your phone and share it (email, social networks, etc.).Though this is a bit of a novelty feature, I find this can be very useful when attempting to take a group or couple photo.  Instead of having to lining everything up perfectly, setting the timer, and getting into place, you simply need to view it from your smartphone whether the shot looks right -- then snap the photo!## In-camera GuideFor a basic user like myself, I do on occasion try to learn more about how to take the perfect shot.  The guide is a easy-to-read step-by-step tutorial on accomplish the shot you want -- night shots, blurred backgrounds, landscape, food, pets, snow, beach, etc.## Room for improvement* Smartphone app -- needs a bit more work.  The app does not give you as much control over the features as you would have if you were holding the camera itself.  They seem to be actively updating this software, so more features may be on the horizon.* Charger -- There is *NO* separate battery charger included.  What was standard before is now an add-on option!  Without it, you're forced to use the supplied USB cable that doubles as a charger (they do provide you a wall outlet to plug the usb into).  You can purchase the standard charger separately or get the accessory kit Sony ACCTRBX  Battery Charger, Battery  and USB Cable (Black).### ConclusionIt takes a while for me to learn how to use cameras.  The above features just scratch the surface of what this camera has to offer.  While the camera does deliver lots of features, Sony takes lots of the guesswork out of it.  If you don't want to or have the time to  wade through the plethora of settings, Sony makes it as simple as possible.I cannot speak for the professionals, but this would make a great camera for beginners.  Its simple, lightweight, and delivers great quality images.", "Date": "July 18, 2013"}, {"Title": "Best long zoom P&S; camera on market", "Author": "bk", "ReviewID": "R137V2D2CDGMCB", "Overall": "5.0", "Content": "Outstanding image stabilization at full zoom, great auto focus. Though in my opinion not as fast as DSC-WX150 and has the same image quality, WX300 has much longer battery life and it looks and feels solid. Wi-Fi is big plus.", "Date": "April 27, 2013"}, {"Title": "Rushed to market but NOT ready.", "Author": "Chandler2112", "ReviewID": "R39KEJZ1D3R3B", "Overall": "3.0", "Content": "I had been waiting for this camera for months and was very excited to be able to get one the first day of its release. Took it home, charged the battery, popped in the SD card and went outside to snap some pix. Very fast to power up and the zoom speed and focus speed - terrific! In my backyard and at a nearby lake, the images captured were very nice. Later that night, at full zoom, I captured a terrific image of the moon. Very detailed and I was again very pleased.Following evening, I captured some images indoors while utilizing the flash... and then I saw what I thought might be a problem - in the left lower corner of the camera's LCD screen, the image looked a little dark. Transferred the images to my Mac and yes, there was a dark area on the image captured in the left lower corner. It was most obvious when using the flash indoors and capturing a light colored image (flash used on my white French door curtains)... very noticeable. Decided to try another test and actually laid down on the floor and flash photographed the 18 foot high ceiling in my family room which had just been painted \"arctic white\". Terrible brown \"smudge\" located in the left lower quadrant of the image captured.Took the camera back to Best Buy and exchanged it for another - which turned out to suffer from an even worse version of the same problem.Returned that one and picked up another version from a different BB store, and that version was similarly affected with the above described flash issue... so I'm done with the DSC WX300... and will get the Canon version... the 280.If your DSC WX300 does not suffer from this issue, congratulations because its a great camera and will likely provide many years of great image capturing.", "Date": "May 8, 2013"}, {"Title": "Not good enough", "Author": "Michael Yip \"Realname\"", "ReviewID": "R27LDYR2QMOPQS", "Overall": "3.0", "Content": "SUMMARYI really love the styling of the camera but, unfortunately, the detail image quality is just so bad that I have to return the camera.Cons:- blurry details (when you zoom in to see the pixels)- heavily distorted image at the corners and edge (at wide angle)- weak WIFI iPhone app implementation (super slow when showing the current live view)- long processing time (e.g. 5 seconds between photos while processing night shots or HDR photos)Pros:- small and good looking- very useable controls- excellent color enhancement to make every picture really vivid- 20x zoom- fast focusBACKGROUNDI was originally trying to decided between the Sony RX100 and the Canon S110, but I started looking at the small super zoom cameras like Sony WX300, Canon ELPH 330 HS, and Panasonic Lumix DMC-ZS25 and DMC-ZS30.  I tried the WX300, 330HS and ZS25.The Sony WX300 has the worst image details but the best color representation.The ZS25 has very good image stabilization and generally works well.The 330HS is middle of the road but only have 10X zoom with the least image distortion.I have returned the Sony WX300 because the details is just very lacking.  Even my wife asked why the faces are distorted.  :(", "Date": "June 24, 2013"}, {"Title": "Adorable but not right for me", "Author": "Indyxena", "ReviewID": "R637LH0P2GZPJ", "Overall": "3.0", "Content": "In my search to replace my beloved broken Sony DSC-HX20V, I ordered this model.  Its adorably small (significantly smaller than the HX20V), in fun colors and very reasonably priced.  I love the built-in flash that doesn't pop-up or get in the way of holding it. It doesn't have as many features as my old Sony did but has all the ones I use and for the most part they work fine.  If you are familiar with Sony cyber cameras its easy to navigate but on this one the buttons and dials are more petite.  Colors in its pictures are true and vivid.Where this model failed me is that it often over compensates on indoor photos without a flash by washing out subjects with over exposure.  I used the menu to modify this default setting with some improvement.  Annoyingly it returns to the default as soon as you take one photo.  I do a lot of indoor picture taking without a flash so this was the most important requirement for me.  Outdoor shooting in good light gave pleasing results.The 20x optical zoom is comparable to what I had on my old camera.  Where this one differs is typical with tiny pocket-size devices, its hard to hold steady enough to avoid some blur when zooming.  You need to brace it on a firm surface to get desired results when shooting.So depending on your needs this model may be just right for you but it wasn't for me.  Really loved its pocket friendly size though.", "Date": "January 30, 2014"}, {"Title": "Lightweight digital camera with great battery life and panorama options!", "Author": "Cheryl B Talbert", "ReviewID": "RKYYO206U3Y7P", "Overall": "5.0", "Content": "I was searching for a lightweight digital camera with reasonable optical zoom capability and automatic panorama mode plus good battery life, to take on extended backpack trips.  This little camera has met and exceeded all of my expectations.  The panorama mode is not only automatic but you can use it with the camera held horizontally (which makes wider but very narrow panoramas) or with the camera held vertically (which makes shots that seem to have normal proportions but with a nifty fish-eye panorama effect).  I have taken hundreds of shots at a time without running out of battery, and you can plug the camera into the wall in between trips and recharge the battery without need for a separate charger.  The camera modes are reasonably easy to figure out with just a little practice, though I only use a few of them.  It turns out that I don't use the optical zoom very much because the higher photo quality pictures can be post-edited and cropped to zoom everything without the worry of my hands shaking - but it does seem to work just fine.  And photo quality has been great, more than good enough for my needs.  I love this camera!", "Date": "December 2, 2013"}, {"Title": "WX300 review..the good and the bad", "Author": "Bruce Koldys", "ReviewID": "R1DMMOICS29UQ7", "Overall": "4.0", "Content": "The WX300 is a ultra compact 20x zoom camera that also shoots 1080 HD video. In a nutshellThe good:1. Size, really small. Also the bad2. Nice crisp photos at 800 ISO or under3. Shoots beautiful HD video in good light4. Extreme battery life. I mean extreme like in all day shooting5. Sony G lens6. WiFi implementation. The camera creates its own WiFi hotspot, allowing you to transfer images to smart device without having to use an existing wifi connection (like the Powershot SX280HS... a great camera with a massive video battery drain flaw)7. Lots of scene modes (make up for lack of manual controls).8. 18 Megapixels creates a large crop opportunity if image noise under control. (also the bad)The bad:1. Size. Almost too small. Also the good, very very pocketable2. Zoom. 20x, crisp about halfway through, about 10x and above pictures start to soften3. Zoom. Same as above for video shooting4. Camera shake. Small body with long lens makes handholding especially video difficult at long zoom length.5. Occasional trouble focusing at long zoom length on landscape scenes6. Small lag when shooting for picture review7. 18 megapixels. Packing more megapixels onto a small sensor creates noise at the higher ISO's. They could have backed off here a bit.Who would like this camera1. Video bloggers2. Those who want a capable zoom point and shoot with them at all times without the bulk of other cameras3. Those who want significantly better photo and video quality than their smartphone, without the bulk of  another camera.Who would not like this camera1. Anyone looking for a cigarette pack size DSLR.2. Pixel Peepers3. Those that want more manual PASM controls on their point and shoot.I believe that the paradim of photo shooting has changed markedly. Most photos are not printed, but used and viewed on social media, ie Facebook, Instagram etc. This does not require the super clean huge JPGS that a DSLR or very high end point and shoot camera provides. The best picture is the one you took, not the one you did not take. With this camera you can take almost anywhere, get a pretty good shot or video, transfer it to your smartphone and upload to your social media. Its a great fit for this use. You are not going to shoot wedding photos with it for a living.", "Date": "August 3, 2013"}, {"Title": "Good camera with some faults.", "Author": "Borocay", "ReviewID": "R9GCM4PPILQ8D", "Overall": "3.0", "Content": "I really liked this camera when I first bought it.  It takes good photos, has a great zoom and takes 1080i video. However, the more I used it the less I liked it.  Every time I took an indoor photo with a flash, the picture would be washed out due to the intensity of the flash.  To make matters worse, the camera does not have flash compensation to adjust the flash.  That was a deal killer for me since I take a lot of indoor photos of my daughter.  I also had problems getting the Wi-Fi to work on my home network.  I'm sure I could have finally got it to work, but I ended up returning it due to the flash issues.", "Date": "February 7, 2014"}, {"Title": "Good camera for casual photographers", "Author": "slvbeard", "ReviewID": "RY9TH1ES07ID9", "Overall": "4.0", "Content": "I purchased this camera to have something I could put in my pocket to snap a picture when needed.  I compared this camera to an \"older\" Sony DSC-H50 15x optical zoom camera which is much larger than this camera.  Comparing both cameras, both take great photos, but the bigger Sony takes much better photos in full zoom than this smaller one.At 20x zoom the pictures look very noisy almost like they are digitally zoomed and not actually taken with a true 20x optical zoom lens.  Another gripe, you really have to practice holding the camera still when it's zoomed all the way in.  Even with image stabilization, it's hard to keep the picture in frame.  This may just be due to the small size of the camera.Still getting used to the camera, it's really not bad.  The size of the camera is awesome, as are the amount of features that it offers.  Have not had much success with the WIFI, was hoping this would show up as a device on a wireless network, but it does not.  You can connect to the camera with the supplied Micro USB cable to download pictures directly from the camera, which is nice.I would recommend this Sony 20x Digital Camera to any casual photographer looking for a compact camera with a big zoom that can take some pretty nice photos.", "Date": "January 23, 2014"}, {"Title": "The little camera that does!", "Author": "saladdin", "ReviewID": "R90Q11EJ88FKO", "Overall": "5.0", "Content": "Battery lasts long, fantastic stills and video with superb image stabilization. Really a fantastic feature set packed into a real pocket sized camera...what's not to love!Took about 500 photos, 5 Full-HD videos (about 2min a piece) over a month and a half in Europe...didn't charge it once. I'm blown away by this little beast!", "Date": "November 9, 2013"}, {"Title": "I love this camera!!", "Author": "Ann Reid", "ReviewID": "R3RJFS00IL28V5", "Overall": "5.0", "Content": "What a great camera -- not only does it take excellent still photos, it takes incredible videos, with stereo sound and true colors.  I liked my old Sony Cybershot but it sometimes made an annoying sound while taking videos -- a mechanical sound that sounded sort of like a jackhammer -- not good.  So I wasn't sure I should get another Sony, but I loved Sony's ability to take excellent panorama photos by just moving the camera, so I took a chance on this, and I'm so glad I did.  It's pretty much perfect -- it has WiFi, so I can send photos to my Samsung Galaxy S3 and my Galaxy Note; it has HDMI out, so I can watch videos on my HD TV; and it has a great zoom, 20X optical, which works really well -- plus it focuses beautifully.  Looking at the videos made by this camera, you'd think they were taken by a high-end camcorder, not a tiny digital camera.  I'm very happy with this little camera!", "Date": "September 12, 2013"}, {"Title": "Camera delivers on all promises", "Author": "Arno Hoerschgens", "ReviewID": "R30FO3TLD6UYJQ", "Overall": "5.0", "Content": "We had to buy a new camera when our Sony DSC-H70 did not work any more due to a small piece of plastic from the memory stick getting stuck inside. Looking at various reviews we finally settled on the WX300  even though it cost a little more than we originally wanted to spend. After our cruise of the Baltic followed by a two week trip through Germany resulting in about 2,500 pictures I can say that this camera takes very good pictures in any condition including low light; it's amazing what you can see when you utilize maximum zoom. I can strongly recommend this camera", "Date": "August 4, 2013"}, {"Title": "VERY Compact Little Camera", "Author": "USMC Combat Vet \"Retired!\"", "ReviewID": "R2ALAPJHDSVT9O", "Overall": "4.0", "Content": "I had no idea at all that new cameras had gotten so tiny, My 10+ year old Canon 2 megapixel still works flawlessly and I suppose I may have never upgraded if I hadn't seen this on Vine. I am reviewing this from the perspective of a 64 year old male with large hands & fingers, disabilities that often result in clumsiness that really gets embarrassing these days. Between being half crippled physically, my attempts to continue normal life anyway are about to cripple me mentally as well :-D  Given that this camera has so MANY features I never even realized existed, I knew it would be a flat out disaster. And for me, in some ways, is. But used as I will use it, not so much as it turns out. I begin with the tiny size. If I was 20 years old again, the size of my large hands & fingers would STILL be at war with the tiny buttons & knobs on this thing! Really bugs me but after some time with it I realize I will rarely be needing to use most of them. But they are a serious issue to be aware of if you are not a small person (or disabled as I am?).  Wi-fi.....well it was dead simple to set up on the camera once I corrected the 20+ typos I made with that microscopic camera button I had to keep redoing...(part of it due to my long password as well to be honest). But I found (as expected) that I will NEVER be using it so who cares. To transfer anything you have this way is just plain insanely slow. I don't have that much time left! And as for using it to let my cell phone or iPad control it? Well I am just way too old school to do that. I mean, I feel like it is the very definition of the Rube Goldberg way to operate any camera. If I want to take a picture I can do it myself but I suppose it's a novelty to some?  On data transfer & the included Sony Software. I HATE this software & had it already from the Sony HDR-PJ790V I got recently. Again, WHY bother? I simply use a cable, get it done and done NOW! On this still camera I don't even bother with that, I simply plop out the memory card & insert it into my computer and drag & drop. I honestly don't need or want all the drama of most the features these modern devices offer I guess.  Zoom is wonderful as long as not used on making any movie. The so called image stabilization is nonexistent if you zoom & make a movie but that's true with any camera EXCEPT the Sony HDR-PJ790V I just got. But then, it is a camcorder and different animal. I LOVE the picture quality on still and more surprisingly, even movies with this model. It has warm, rich & natural color to me anyway. It flat blows my 10 year old Canon away, and it SHOULD.  I began with stating I expected disaster with this camera. I was wrong overall. Again, for the limited way I will use this, I love it. With all it's features I knew I would never be able to do the one simple thing I got it for. Taking a picture.... I was dead wrong. To boot, I find it EASIER to use than my old Canon. The GORGEOUS big 3\" LCD screen that lets me change screen color to best suit my tired old eyes. The menu system that was SO easy I have yet to crack the manual and have been able to figure out all I needed to know anyway. Now THAT is simple. I honestly never saw anything like this before. It is like operating a tiny baby computer. Clear, simply & intuitive IF used the way I intent to use it (like a basic camera WITHOUT using the Wi-fi applications).  Batteries....I HATE this design with it's proprietary cell phone style battery. I LOVE my Canon that allows me to plop in any of my many Amazon Basics AA Rechargeable cells when I need and in just 30 seconds (and CHEAP!) I am back up & running on the fly. I also hate (and will never use) the included charger that heats up this tiny camera while charging. NOT good for the electronics. I will be buying the aftermarket external charger for it here at Amazon like I did for my new Camcorder. In this case: Sony CyberShot DSC-RX100 DSCRX100 DSC-HX300 DSC-WX300 HDR-AS10 HDR-AS15 Digital Camera Battery And Charger Kit Includes Qty 2 NP-BX1 Replacement Batteries + Battery Charger + LCD Screen Protectors + Micro Fiber Cleaning Cloth  I have had a dismal experience so far in life with almost all things Sony. I also found them to NOT stand behind their products and swore I would never again support them. If these 2 new cameras/camcorders hold up, I may be converted back. But Sony has to EARN that for me, given how much they have literally burned me in the past. I also intend to be fair in this \"moment\" to Sony however. Overall you will see I gave it 3 stars. I do so this way:-Performance=5 stars-Features=5 stars-Ergonomics=2 stars (subjective I know)-Ease of use=5+ stars-Usefulness of features=1 star (again, subjective I know)-Multi function port to charge battery-1 star-Reliability of Sony in MY past= MINUS 5 stars  So I give it 3 stars. I follow up on my reviews. I will upgrade or downgrade fairly and honestly as time passes. I LOVE this camera and if it remains reliable unlike my past Sony still/digital cameras that took a class action suit to resolve, I will bump the rating way up. My large hands, my disabilities are not any fault of Sony. I have not forgotten that. My rating is the best I can do for what this camera offers ME. And with what Sony has represented to me in my past. I honestly hope I end up at 5 stars after 5 years because I LOVE this camera.6/3/2013 UPDATE: As I have grown more accustomed to this camera and adjusted to the major differences over all my years with my Canon, become more adept at handling the very tiny size, I am upgrading to 4 stars. I really do have trouble dealing with the small size but am finding the actual performance to just be far more rewarding than I initially thought. As time & experiences happen I will adjust the review accordingly.", "Date": "May 22, 2013"}, {"Title": "You need a small, portable camera that takes breathtaking pictures?", "Author": "Tom", "ReviewID": "R2TC7SL6UC107L", "Overall": "5.0", "Content": "As I write this review I have had this camera with me for about 5-6 months (with this being a daily user for 3). In the summer of 2013 I bought this before my trip studying abroad for my university, and let me tell you... this SURPASSED my expectations.I am by no means a professional when it comes to knowing cameras inside and out but I will tell you what I know.Usability - This camera is a breeze to use. I never opened the directions (I typically never do) and played with it on and off and learned what to do to flick flash on and off rather quickly. Theres a massive screen that takes 80% of the back which pictures do not show, and 2 buttons with a directional pad on the side. Simplicity never made things so easy.Zoom - Incredible. As I went around Italy for my semester (I was just outside Rome) this camera took breathtaking photos that my friends would be astonished at. As an example of this, I went to Mt. Vesuvius and zoomed in as far as I could and saw a group of people traveling, what t-shirts they were wearing, and what gear they had on. Now, by no means was it crystal clear because of how far they were away but when a friend with a massive camera that you change lenses for (that apparently cost a bundle of money) tells you that he wishes he had your camera, I think you hit something. This was one of many examples which became such a normal thing was to compare pictures against his massive camera to see who got the better one.A better example would be the detail I would get off of Pope Francis I during audiences when you are stuck in one solid location and have to zoom and be quick to press the button to get a decent picture. From very far away I could see the wrinkles on his face, the age spots (liver spots), and of course the cross he was wearing around his neck in vivid detail.From the middle of station square I could zoom into the faces of the sculptures atop the Vatican and see the detail in the faces and body.I touched on the pictures this thing can take in the zoom portion so I will pass on it.Battery - it has a very long battery that will more than suffice even if you take a ton of photos. The only times I was disappointed was when I would forget to charge the camera before a trip.Screen - The screen is what makes this a beauty to use. I can remember when my dad would have to flip back his old canon camera screen to view the photo after it was taken... not here. The minute you take a photo you get to see it for a few seconds before it disappears and you have to hit playback. It is a massive screen when compared to the rest of the camera. Because I am anal about stuff like scratches on screens I bought cheap plastic protectors that sufficed for the three months abroad.Lastly, at the price point I currently see it at I couldn't complain at all because of the detail. At the retailer I bought it at it was around $250 (listed at $300+). So this price point makes it even more of a value. For a camera that is extremely small, durable (it has been tossed around quite a bit), and takes photos that will make you and especially those around you breathless it is a fantastic buy.-Tomp.s. Any questions and ill gladly answer them.", "Date": "April 12, 2014"}, {"Title": "Good photos, sloooooowwww processing", "Author": "SLane", "ReviewID": "R3OIBW074K09UY", "Overall": "2.0", "Content": "Photos are good, but unless on rapid shoot it takes seconds to process. And I haven't (to date) found a way to control how to choose the focus options.For extended zoom (as expected) you will need a steady rest. Small enough to fit in a pocket and light enough to not be bulky.If I had known of the processing issue, I would not have purchased. I use it for quick nature shots and nature won't always hold the pose.", "Date": "December 30, 2013"}, {"Title": "The BEST Yet!", "Author": "D. Stevenson", "ReviewID": "R31WSKSK5J2YIK", "Overall": "5.0", "Content": "I have used 1 Kodak, 2 Panasonics 1 previous Sony and now this...I loved my last Sony but it was stolen. This is a newer version and by far the best camera I have owned. I have a 32 Extreme Card which makes this lightning fast with 180+ minutes of highest quality HD video to capture. Here is what I liked:- Clarity, it takes quick sharp photos because the lens is amazingly intelligent- Low Light/Non Flash indoor pictures. I take more pictures indoors with no flash and the colors are richer and more accurate- Video! Video! Video! While not a dedicated video cam, it is mine. Has a dedicated video button and allows you to capture HD camera pics without stopping your video. Now you dont have to decide HOW you want to capture.. DO BOTH!- Video Clairty, True HD video with decent sound quality. Zoom is nice and slow and not as distracting as others Ive owned- Zoom! Zoom! 20x zoom is amazing in such a compact point and shoot. Performed great at the NFL game- Panorama, not that new but you can take a WIDE shot in great quality. Awesome for scenic views or even indoors- Size and ease of menusNegatives...- Even for a more natural flash, I still get typical washed out indoor photos- Charger connects to camera not a battery dock. But for $15 you can buy one here on Amazon.I now put Sony cameras at the top of my list, then Canon.. Wont buy another Panasonic or Kodak anytime soon.", "Date": "December 24, 2013"}, {"Title": "Compact, good zoom and super clear HD video", "Author": "Vinod", "ReviewID": "R377EXYPXY8G20", "Overall": "4.0", "Content": "Camera is really compact, fits to your pocket. Pictures quality is good, especially the stabilty shots which captures multiple shots for a free hand night shot.Video is crisp and clear and good quality for HDTV.Panaromic sweep is really cool and quick.Wi-Fi is a cool feature to transfer or view pictures.Good one among the Canon and the Nikon point and shoots that are available across the same price range.", "Date": "October 18, 2013"}, {"Title": "Nice compact camera", "Author": "Jeffrey Lai", "ReviewID": "R12ZXYMWPHRJM6", "Overall": "4.0", "Content": "I have been using a digital SLR and decided to buy a more compact camera in case I don't want to lug around the it around.I find I use this camera more often because of it's size, picture quality and versatility. The HD video is great the play back is fantastic and even records in stereo. Plus it has a 20x optical zoom.  I may never pickup the big guy again.", "Date": "October 4, 2013"}, {"Title": "A fun compact camera", "Author": "Bullet", "ReviewID": "R1HVNXE5SD7NN3", "Overall": "5.0", "Content": "I have a Sony NEX5 which is a wonderful camera but for my purposes I wanted a camera to be able to carry in my shirt pocket.  The Sony WX300 seemed to fit the bill and although I haven't used it extensively yet, it is proving to be versatile, convenient and takes sharp, high definition photos in any light conditions.  It is fun to use and its wi-fi feature makes for an easy download to a computer.  For a compact camera, its telephoto capability is amazing.  In 4 words, I do love it.", "Date": "September 17, 2013"}, {"Title": "Great Sony Camera!", "Author": "Cormak", "ReviewID": "R1YG0O58WSQS9Y", "Overall": "4.0", "Content": "Sony does it again! I was looking for a small pocket camera that would fit great in my pocketbook for parties, weddings and to have on me at all times, that took great pictures. While this camera may be small don't let it's size fool you into thinking it's not a great camera!It has a 20x optical zoom and a 40x digital zoom. Shutter was pretty quick for a point and shoot. It took great pictures at a family wedding in a dimly lit church where I was at the back of the church. I zoomed in and got some great photos. It takes great pictures in sunlight and fluorescent lighting too. The flash works well too! Even with things at some what of a distance.It takes fantastic video and I love being able to control this camera with the app available for my tablet. A great feature for Vloggers.The camera has some neat features such as partial color shooting, painting, watercolor and so many more. They are a lot of fun.My only disappointment is that there is no sports mode in the SCN section. I'm not sure why they didn't add that, but then again I have a DSLR for sports events!This little camera has been great so far. I'm really happy with my purchase", "Date": "August 27, 2013"}, {"Title": "Sony DSC-WX300/R", "Author": "Linda 59", "ReviewID": "R2BC8V0A18HSVM", "Overall": "5.0", "Content": "Finally I've come home to Sony.  My first digital camera was a Sony and I loved it.  Under pressure from a salesperson I bought a Canon.  While the photos were okay, nothing compared to my Sony.  I researched and bought my new camera right before a family vacation hoping it would take good photos.  This camera fits in your pocket.  It's smaller than my iphone.  It's got a 20X zoom and gives you 18 MP.  Didn't think a camera that small could produce such quality photos.  But it does!!!  Sorry I waited so long to get back to Sony.  I won't ever use another brand again.", "Date": "August 6, 2013"}, {"Title": "Real world test with some surprises", "Author": "LD", "ReviewID": "R2B5E1W35VTJYZ", "Overall": "4.0", "Content": "Over all I really like this camera. I took the same pictures with my Fujifilm 800EXR which has trumped everything except my high end Sony cameras with CMOS II. I compared the Sony's auto white with the auto green settings on the dial. I like to see how well a camera diagnoses the situation and pushes its capabilities. Manual settings are subjective and everyone's preferences and results will differ.Outside sunlit photos were crisp and color correct. Flowers in an area with sun and shade came out fine. Taking a picture of someone with a hat on resulted in too dark shadows on the face while the depth of field for the background was still distinct. This could be fixed in Photoshop.I take thousands of photos inside museums, palaces, etc. This is where other cameras have gone to the graveyard. A museum near me is a good testing location due to light from windows, old style bulbs, dark corners, lit and unlit display cases, and intricate wood carving. Auto white took 3-4 pictures automatically and blended them for the best lighting. They ended up being a several shades darker than Auto Green. Auto green was slightly more precise but added a small yellowish cast (fixable in Photoshop). The low light capability is as good as anything I've used. Etched glasses in an unlit corner cabinet came out as if I had used flash. Most cameras badly pixelate when you zoom in low light situations. Other cameras went to the graveyard because of this. Not this one. I got excellent pictures while zooming both close and far objects in limited light. The stabilization was very good.So photo-wise I rate this camera and the Fuji a draw. For comfort and overall experience, I definitely like the Fuji better but that is a personal choice and for you it may be different based on your hand size and preferences. The first thing I noticed about this camera is its housing. It has the look and feel of a squared off tin box. I can't quite put my finger on why it seems weird to me, but it does. The Fuji has a rough texture and curves that seem to help me grip the camera and keep it steady. My spouse feels comfortable gripping the Sony in different places than I do- that's why its just an opinion.My main gripe with this camera is the placement of the mini USB port - it's behind a flimsy flap that I am sure will break after a modicum amount of usage. It also took some effort to get the plug to fit into the slot. I am buying an external battery charger which will reduce the number of times I have to open this flap. But what baffles me is why the (infrequently used) HDMI port is out in the open on the bottom of the camera (easy to get to) but the mini USB port (used for charging and sending images to the computer) is hidden and hard to access? I think they should have been reversed. Also while I don't have a real use for the wireless feature, I did attempt to test that feature. It worked on my iPod Touch 5 sending pictures and allowing me to remotely control the Sony from the iPod.On the plus side, the camera has a nice large LCS screen and the shutter button is easy to reach. My final comment is that someone with small fingers is really going to enjoy this camera. The menu items are selected using the joystick. The on/off button is really small but ideal for a fingernail. For me, the photo quality is the most important. And this Sony really comes through.", "Date": "June 19, 2013"}, {"Title": "Love this camera", "Author": "Yarii", "ReviewID": "R2UF650KP9IZQM", "Overall": "5.0", "Content": "There is no perfect camera. I wish I could combine the best features of the WX300 with the best features of my 2012 model Sony HX10V, which is larger in size. I much prefer the WX300 over the recently-released WX80 though, which was way too tiny for my fingers (so I returned that camera).Pros:>>  A control knob on top vs. strictly menu-driven features. But it feels like the control knob is in the wrong position. I keep pressing the control knob when trying to press the shutter (they should be reversed).>>  3\" screen>>  Dedicated movie button>>  Great quality video. One thing you need to be aware of if you burn DVDs; you cannot select the AVCHD on the FX setting (in the menu settings) unless you plan on burning to a Blu-Ray disc - they are that good!>> 20X optical zoom, which goes out to 40X in ClearImage and 80X in digital zoom. (Although I don't recommend going out to 80X digital, but 40X ClearImage isn't half bad.)>> Sony G Lens. I know some like the Carl Zeiss lens better, but my HX10V also has the G lens and I think it's superior.>>  EASY setting. Anyone can use this camera on this setting, it gives you very limited choices, easy enough for a Great-Grandma.>>  Special effects: Love the watercolor and illustration effects, which you apply in the playback menu, and it also saves your original photo.>>  Background defocus. This is my favorite setting, it has it's own position on the control knob. You have a choice of low, medium, or high blurred background, and with a little experimenting, you can get the same bokeh effect of a DSLR. I uploaded a photo of a flower showing this feature.Cons:>>  The battery charging door is flimsy and I don't see it lasting long. Better off buying a separate battery charger. I don't like charging the battery inside the camera anyway.>>  Does not have P/A/S/M full manual control. It should have for this price.>>  The tripod socket appears to be plastic; it's black so I'm not 100% sure, but when they are metal, they are almost always silver.One thing to note as it's the same on the WX80:  Don't get the HDMI cable connector on the bottom of the camera confused with the battery charging connector. I did get confused for a few minutes with the WX80 and I thought Sony had included the incorrect USB cable.Wi-Fi:  I had no problems with setting this up with my desktop PC which still uses Vista. Sony includes a separate pamphlet for Wi-Fi set-up. (I already had Play Memories installed from my other Sony cameras, so that may have made it easier for me).If your router has a WPS Push Button it's easy-peasy to set up (my Cisco Valet has the WPS button, but I'm not sure if other routers have this button as my only router experience is with Valets). After you have the PlayMemories software installed, you have to \"one-time\" connect the camera to your PC with the USB cable and set up the SSID/password. If you have the WPS Push Button, you press your router button first, then get into the Toolbox/menu on the camera and press Wi-Fi Push. It takes a few minutes to completely connect, but once you've done that, you're good to go. Once I tried the wi-fi, I haven't bothered again. It's slow. It drains the battery quicker. It's not worth the hassle.Like I said above, no camera is perfect. My HX10V has GPS, which I keep turned off as it drains the battery. The WX300 has Wi-Fi, but it's slow to use. I think my HX10V takes a little sharper photo, but it's larger/clunkier. My HX10V was made in Japan (and a little cheaper than this camera), while the WX300 is fairly expensive for not having full manual control P/A/S/M and it's made in China.  I've owned well over 50 cameras and haven't found the perfect one yet. If I ever do, that would be a 10 star camera!Sony HX10V: Sony Cyber-shot DSC-HX10V 18.2 MP Exmor R CMOS Digital Camera with 16x Optical Zoom and 3.0-inch LCD (Black) (2012 Model)Sony WX80: Sony DSC-WX80/R 16 MP Digital Camera with 2.7-Inch LCD (Red)See comment section below for a link to a more thorough User Manual.", "Date": "May 21, 2013"}, {"Title": "A mixed bag -- containing gold coins, and a feral cat.", "Author": "Kevin Nicholls \"jaded, aging hipster\"", "ReviewID": "R3TWAI0IP350R2", "Overall": "3.0", "Content": "Though typically a Canon devotee, I was on the verge of replacing a Sony Cyber-shot DSC-WX50 16.2 MP Digital Camera with 5x Optical Zoom and 2.7-inch LCD  (Black) (2012 Model) with a similarly-ranged Canon, when I had the opportunity to give Sony another try.The results were... mixed.The positives:+Image quality can be exceedingly good. I'm hesitant to say \"rivaling a DSLR\", but in the right hands, it's entirely possible.+20x optical zoom is pretty much as awesome as you might suspect. Want to see pores on someone's nose from 15 feet away? Here's your camera.+For as capable as this camera is, it's surprisingly light. Not pocketable, but not big enough to need its own gear bag.+With a decent card, write speeds are excellent.+Many, many image options to choose from -- though it's not likely you're going to use them if you're not prepared (see negatives).+Sony service is pretty great, if something goes wrong.The negatives:-While the automatic mode seems like a great feature, it takes FOR-EVER to decide how, if anything in the scene is in motion. It's infuriating, and no amount of hammering the shutter will cause the camera to actually take the picture. I thought this was a shortcoming in the lower-end DSC-WX50 and really expected improvement for a camera that costs this much money.-In spite of the vast array of modes and effects, Sony hasn't developed a very graceful way to get to them and switch between them. If you're composing a shot and know what you want, this probably isn't a big deal. But if you want to add a little tweak to something just for fun during a snapshot, you can pretty much forget about it.-Because Sony isn't as \"common\" as Canon and Nikon, there are limited third-party add-ons available.Under very specific scenarios, the DSC-WX300 can be a five-star camera. But, those scenarios are, more often than not, fairly pristine conditions composed by a photographer with some patience. As a \"I'm carrying this in my bag / purse for spontaneous pictures of my kids / sporting events / tourist attractions\", I'd have to say that the automatic mode makes the camera abysmal.If I was in the market for a similarly-spec'ed camera and didn't have my heart set on a megapixel number, I'd go with the superior Canon PowerShot SX280 HS 12.1 MP CMOS Digital Camera with 20x Image Stabilized Zoom 25mm Wide-Angle Lens and 1080p Full-HD Video (Black). If I absolutely needed higher resolution, then I'd have to say that the Nikon COOLPIX S9500 18.1 MP Digital Camera with 22x Zoom and Built-In Wi-Fi (Black) is the best choice for the same money.", "Date": "June 7, 2013"}, {"Title": "Fantastic little camera - and I can control it from my Driod phone, tablet and iPad! Wireless computer connection a problem.", "Author": "Richard C. Drew \"Anaal Nathra/Uthe vas Bethod...", "ReviewID": "R2EJAWKA6UWQCQ", "Overall": "5.0", "Content": "<!--\n\nfunction fp_resizePlayerSpace(nsPrefix,w,h)\n{\t\n  try {\t\n    var ifrm = parent.document.getElementById(nsPrefix + \"movieFrameID\");\n    if (ifrm) {\t\n        var h2 = h + 35;\n        ifrm.style.height = h2;\n      }\n    } catch(err) {\n \n    } \n\n\n  if (h > 0) {\n      document.getElementById(nsPrefix + \"clipDiv\").style.height=h+\"px\";\n      document.getElementById(nsPrefix + \"videoPlaceholder\").style.height=h+\"px\";\n  }\n  else {\n      document.getElementById(nsPrefix + \"clipDiv\").style.height=\"\";\n      document.getElementById(nsPrefix + \"videoPlaceholder\").style.height=\"\";\n  }\n  document.getElementById(nsPrefix + \"flashcontent\").style.height=\"100%\";\n}\n\nfunction fp_rewriteDiv(nsPrefix,divName,html)\n{\t\n    document.getElementById(nsPrefix + divName).innerHTML=html;\n}\n\nfunction embeddingPopup(nsPrefix)\n{\n  alert(\"placeholder function for embedding code\");\n}\n-->\n\n\n<!--\n\nfunction cv_mo2528CSLTJUVT9embeddingPopup(){\t\nalert(\"Embedding code will be displayed here.\");\n}\n\n-->\n\n\n\n\n\n\n\n\n\n<!--\nfunction cv_mo2528CSLTJUVT9refresh_preplay() {\n\ndocument.getElementById(\"cv_mo2528CSLTJUVT9chiDiv\").innerHTML = document.getElementById(\"cv_mo2528CSLTJUVT9hiddenPre\").innerHTML;\n};\ncv_mo2528CSLTJUVT9refresh_preplay();\n\n-->\n\n\n\n\n\n\n        // <![CDATA[\n\nvar cv_mo2528CSLTJUVT9so;\t   \n\n\nfunction cv_mo2528CSLTJUVT9loadSwf_Core(swfLocation, swfWidth, swfHeight, flashVersion, bgColor, swfParams, flashParams, embedAttributes) {\n\n  try {\n      cv_mo2528CSLTJUVT9so = new SWFObject(swfLocation, \"cv_mo2528CSLTJUVT9AMPlayerProd\", swfWidth, swfHeight, flashVersion, bgColor);\t   \n\n      for (var v in swfParams) {\n        cv_mo2528CSLTJUVT9so.addVariable(v, encodeURIComponent(swfParams[v]));\n      }\n      for (var v in flashParams) {\n        cv_mo2528CSLTJUVT9so.addParam(v, flashParams[v]);\n      }\n      for (var v in embedAttributes) {\n        cv_mo2528CSLTJUVT9so.setAttribute(v, embedAttributes[v]);\n      }\n\n      cv_mo2528CSLTJUVT9so.addVariable(\"swfEmbedTime\", new Date().getTime());\n\n      var agt = navigator.userAgent;\n       \n      var reFirefox = new RegExp(\"firefox/\", \"i\");\n      var regx = agt.split(reFirefox);\n      var ffVersion = 8;\n      if (regx[1]) {\n          var pts = regx[1].split(/[.]/);\n          ffVersion = parseFloat(pts[0] + \".\" + pts[1]);\n      }\n      var minorVersion = parseFloat(navigator.ap);\n      if ((navigator.appVersion.indexOf(\"Mac\")!=-1) || (ffVersion < 1.5)) {\n          cv_mo2528CSLTJUVT9so.setAttribute(\"height\", swfHeight);\n          cv_mo2528CSLTJUVT9so.setAttribute(\"width\", swfWidth);\n          cv_mo2528CSLTJUVT9so.addVariable(\"oldFirefox\", \"1\");\t     \n      }\n\n      if (cv_mo2528CSLTJUVT9so.write(\"cv_mo2528CSLTJUVT9flashcontent\")) {\n          fp_resizePlayerSpace('cv_mo2528CSLTJUVT9', \n                               320, \n                               283);\n      }\n      else {\n          var nsPrefix = 'cv_mo2528CSLTJUVT9';\n\n          fp_resizePlayerSpace(nsPrefix, 0, 0);\n          fp_rewriteDiv(nsPrefix, \"flashcontent\", '<br/>To view this video download <a target=\"_blank\" href=\"http://www.macromedia.com/go/getflashplayer\" target=\"_top\">Flash Player</a> (version 9.0.115 or higher)');\n      }\n  } catch(err) {\n      fp_resizePlayerSpace('cv_mo2528CSLTJUVT9', 0, 0);\n  }\n  return false;\n}\n\n\n\nfunction _cv_mo2528CSLTJUVT9loadSwf(movieID, playerVersion) {\n    var swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/20120510035744301/AMPlayer._V148501545_.swf\";\n    var swfWidth = \"320\";\n    var swfHeight = \"100%\";\n    var flashVersion = \"9.0.115\";\n    var bgColor = \"#FFFFFF\";\n\n    var swfParams = {};\n    var flashParams = {};\n    var embedAttributes = {};\n    swfParams.amazonPort = \"80\";\n    swfParams.allowFullScreen = \"true\";\n    swfParams.telemetrySubPageType = \"VideoReview\";\n    swfParams.nsPrefix = \"cv_mo2528CSLTJUVT9\";\n    swfParams.locale = \"en_US\";\n    swfParams.logUrl = \"gp/mpd/l\";\n    swfParams.canResize = \"1\";\n    swfParams.autoPlay = \"1\";\n    swfParams.sessionId = \"000-0000000-0000000\";\n    swfParams.marketplaceID = \"ATVPDKIKX0DER\";\n    swfParams.salign = \"LT\";\n    swfParams.preset = \"detail\";\n    swfParams.mediaObjectId = \"m33CW2KL33OGRY\";\n    swfParams.autoPlayTimer = \"\";\n    swfParams.mediaObjectIDList = \"m33CW2KL33OGRY\";\n    swfParams.playIsUserGenerated = \"1\";\n    swfParams.enableShare = \"0\";\n    swfParams.permUrl = \"gp/mpd/permalink\";\n    swfParams.telemetryPageTypeID = \"R2EJAWKA6UWQCQ\";\n    swfParams.xmlUrl = \"http://www.amazon.com/gp/mpd/getplaylist-v2/m33CW2KL33OGRY/000-0000000-0000000\";\n    swfParams.amazonServer = \"www.amazon.com\";\n    swfParams.scale = \"noscale\";\n    flashParams.allowFullScreen = \"true\";\n    flashParams.salign = \"LT\";\n    flashParams.bgcolor = \"#FFFFFF\";\n    flashParams.allowScriptAccess = \"always\";\n    flashParams.quality = \"high\";\n    flashParams.wmode = \"transparent\";\n    embedAttributes.title = \"Flash Player\";\n\n    if (movieID){\n      if (playerVersion == '3'){\n        swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/20120510035744301/AMPlayer._V148501545_.swf\";\n        swfParams.mediaObjectIDList = movieID;\n      } else {\n        swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/legacy/20101014901/AMPlayerProd._V197491872_.swf\";\n      }\n      swfParams.xmlUrl = \"http://www.amazon.com/gp/mpd/getplaylist-v2/\" + movieID + \"/000-0000000-0000000\";\n      flashParams.wmode = \"transparent\";\n      swfParams.autoPlay = \"1\";\n    }\n\n    if (document.getElementById('cv_mo2528CSLTJUVT9duration')) {\n      document.getElementById('cv_mo2528CSLTJUVT9duration').style.display='none';\n    }\n    cv_mo2528CSLTJUVT9loadSwf_Core(swfLocation, swfWidth, swfHeight, flashVersion, bgColor, swfParams, flashParams, embedAttributes);\n\n  return false;\n}\n\nfunction cv_mo2528CSLTJUVT9loadSwf(movieID, playerVersion) {\n   return _cv_mo2528CSLTJUVT9loadSwf(movieID, playerVersion);\n}\n\n\n\t\n\t\t// ]]>\n\t\n\n<!--\n\nfunction cv_mo2528CSLTJUVT9newHeight(h)\n{\t\n    fp_resizePlayerSpace('cv_mo2528CSLTJUVT9', 0, h);\n}\n\nfunction cv_mo2528CSLTJUVT9resetPlayer(w,h,bw,cc) {\n  cv_mo2528CSLTJUVT9newHeight(h);\n\n  cv_mo2528CSLTJUVT9so.addVariable(\"resetBandwidth\", bw);\n  cv_mo2528CSLTJUVT9so.addVariable(\"cacheCode\", cc);\n  cv_mo2528CSLTJUVT9so.setAttribute(\"height\", h);\n  cv_mo2528CSLTJUVT9so.setAttribute(\"width\", w);\n  cv_mo2528CSLTJUVT9so.write(\"cv_mo2528CSLTJUVT9flashcontent\");\n}\n\n-->\n\n\n\n\n\n\n\n\nvar cv_mo2528CSLTJUVT9RollOverImg = new Image();\ncv_mo2528CSLTJUVT9RollOverImg.src = \"http://ecx.images-amazon.com/images/I/815H5s72EbS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play-active,BottomLeft,130,-12_CR0,0,0,0_.png\";\n\nvar cv_mo2528CSLTJUVT9preplay = document.getElementById('cv_mo2528CSLTJUVT9preplayImageId');\nif (cv_mo2528CSLTJUVT9preplay) {\n  cv_mo2528CSLTJUVT9preplay.onmouseover = function() {\n    cv_mo2528CSLTJUVT9preplay.src = \"http://ecx.images-amazon.com/images/I/815H5s72EbS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play-active,BottomLeft,130,-12_CR0,0,0,0_.png\";\n  }\n  cv_mo2528CSLTJUVT9preplay.onmouseout = function() {\n    cv_mo2528CSLTJUVT9preplay.src = \"http://ecx.images-amazon.com/images/I/815H5s72EbS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play,BottomLeft,130,-12_CR0,0,0,0_.png\";\n  }\n  \n  \n  var node = cv_mo2528CSLTJUVT9preplay.parentNode;\n\n  var cv_mo2528CSLTJUVT9currentClick = node.onclick;\n  node.onclick = function () {\n    var head = document.getElementsByTagName(\"head\");\n    if (head[0]) { \n      var logTag = document.createElement('script');\n      logTag.type = \"text/javascript\";\n      logTag.src = \"/gp/customer-media/du/log.html?ie=UTF8&p=CustomerImage&s=CustomerVideoPlay\";\n      head[0].appendChild(logTag);\n    }\n\n    if (cv_mo2528CSLTJUVT9currentClick) {\n      return cv_mo2528CSLTJUVT9currentClick();\n    }\n  }\n}\n\n\n\n\n Length:: 0:16 MinsThe video is a simple clip, shot handheld on a sunny day. Just a good demo of the zoom and image quality, plus handling the colors.  All very natural and not too saturated.------Update: I've been walking around with this camera for a month. Taken it on several of my Urbex outings. My observations: The key to great photos is using the scene modes. There are a lot, from HDR to night handheld dark. I accidentally used \"handheld dark\" and \"HDR\" at the *wrong* times and received great results. From off to shooting a photo is about 5 seconds.  The zoom still impresses. When I'm navigating tight spaces or climbing and don't want to (or can't) carry my camera bag or pack, this thing is great. For me, the zoom makes it. The pixel quality is lacking, but that's what you get with these tiny cameras. The battery life is amazing. I've filled up a 32 gig card three times on the same battery charge - and still not empty! Rugged? Not at all. It has to be in a padded bag. It scratches easily (but most things will when they come in contact with flaking bricks, rusting metal and the like.)  I'm amazed at a the results shot in near total blackness!------I think Sony thought of every possible option. Smart phone/iPhone as a remote control? Check. \"Easy mode\" so when you loan the phone to Grandma the icons are simplified and a lot bigger? Check. BIG LCD screen? Yep. Stereo mic? Yes. Single shot 3-D photos? Check. Scenes, special effects, panoramic shots? Yes. Wi-Fi upload to a network or smart phone? Yep. Video quality up to Blu-Ray? Check. Advanced stuff like exposure compensation, 10 fps shooting, and program mode? Heck yes. Even different smile detection - slight, normal and big smiles?!  Automatic trigger on smile detection. Face detection before shot. Detect TWO faces before shooting. Two steady-shot modes, in camera manual/help, 60i movie quality or MP4, 20x zoom plus additional digital zoom, red eye reduction - and lots more - including a huge screen!It's an impressive camera with a wondrous array of features. BUT, there are a couple of very minor issues. The cover on the USB port (connects to computer, charges camera, etc.) has a really flimsy design. I can see this coming off quickly. The little tab that keeps it in place is so short, it's difficult to plug in the cable.  When zoomed in, autofocus tends to \"hunt\" - in tight focus - say 20x, unless the subject has a lot of contrast, focus may fail. This is typical of small cameras. The smart phone app is cool, but has limited features - it can't control any advanced stuff - just trigger the shutter, switch between movie and still photos, and zoom in and out. The zoom is clunky - it zooms in and out a little with each tap - so no smooth zooming. For stills that's fine - for video, it's choppy. Still, it's a great feature. I tested it with my Droid phone, Droid tablet and iPad 2.Apps are available for Droid and i devices. The interface is identical.  Tools: Self-Timer- on/off, Flash- auto/off, review check- Review, save image/review only/off. First you turn on Wi-Fi on the phone, then select \"Ctrl with smartphone\" - it's that simple.iPad: Ran the app. Received an error: \"Search the shooting device from the network setting of the terminal and set it\"  HUH? Turns out you need to join the network from the settings menu (settings->wi-fi) before using the app. Entered password, done.Droid phone (Motorola Bionic): Ran the app, entered password, done.Droid Tabled (Samsung Tab 2 10.1): Installed the same as on the phone. One problem - the QR code on the instructions was folded in half and small. The tablet could not read it, so I had to enter the URL manually, or optionally, just search the Play store.The camera streams to the device, so your tablet or phone displays a live image. Cool.You can't copy the video to the external device via wireless, and the images that auto-copy are reduced in size. You can manually transfer full sized images, but not videos. You need the USB cable for that.Other unusual features: The camera can play slideshows and video via HDMI, with music. You can transfer music to the camera from your PC for this. When you navigate to the camera from \"My Computer\" you'll see a link - clicking this takes you to a special Sony page for downloading various programs. Image conversion, music copy and more.WiFi: You need to install software on your computer to use WiFi?! This also also uses the Sony Play Online service - you get 5 gig of storage free. Download and install was pain free (Windows 7.) However, the software could not find the camera. Power cycled the camera and ran the software again. Still can't find the camera. This entire phone/wireless thing is more confusing than it needs to be.  I want to connect via WiFi. The instructions say I need to connect the camera to the computer I want to connect wirelessly to. Or that's what I think it says. The grammar is so bad it's difficult to say. Maybe I should try Google translate? Nope - no kinda-English to English translation. Can't get the camera to communicate with the software. Tried numerous times and gave up. Tried Google - I typed out \"play memories \" and it autocompleted the \"no camera found.\" So this is obviously a common problem. Reading through the replies, Sony always blames the computer.  The camera DOES show up as an external device in \"My Computer\", so you can manually copy files.  Spent oven an hour on this - never got the USB to work. I even found the option to setup the wireless network and did that. My camera logs into my network - but can't do anything?!?  Figured I'd try again. Removed and reinstalled everything. According to the directions \"Turn on your camera, and connect it to the computer.\" This launches the software. Nope.So let's try the in-camera help.... No good. It's basically \"Have a problem, it's not the camera...\"  So I plug in the USB cable and.... this popped up when I attached the camera to the computer - \"Information of the computer where the data is to be saved is not set to the device. Connect the computer to the device with an USB cable and set it.\" Really? Huh? What? I thought that's what I just did. I'll keep trying. One problem - Sony expects everything to work and provides no help when it doesn't. Anyway, my monster computer has four individual internal hubs. I was connected to a USB 3 port. Disconnected and plugged into a USB 2 port. That solved the problem.  Ran everything, got wireless working. After all that, wireless just lets you transfer files to the computer. That's it. No options, no control. And it's painfully slow. Transferring a dozen images took almost 20 minutes.  I have a FAST dual band wireless network. So the camera is the bottleneck. Convenience? Nice. Speed? Snail's pace. I can't find any information on the network speed, but I'm guessing 802.11b - the camera does power down after transferring the files.Messages: Had to laugh at some of these. The English is terrible, as bad as some stuff you'll find in poorly translated assembly instructions on Chinese lawn furniture.Overall this is a feature rich, compact phone with a huge battery life!If you're looking for a case/bag/pouch for it, the Lowepro Ridge 10 Camera Case (Black) is a perfect fit.Followup: I've used this little gem to shoot around 500 photos. The strong points: scene shooting and the zoom. I just added some more zoom samples. The quality from 1/2 a mile away is amazing!One final thing. People are claiming there's a design flaw or bug - nope. It's not a design flaw. It's physics. My $5,000 DSLR has the same problem. A long lens occults the flash, causing a shadow in the lower left corner (the flash is in the upper right corner). The only way to avoid this is to move the flash totally off the camera. Or use common sense and not use a flash when zooming 20X! With that zoom, you need good light, a stationary subject, steady hand - or tripod. The slightest camera shake (hand motion) is also magnified 20x!  Once you're past 20 feet or so, the flash is next to useless - and drains the battery fast.", "Date": "May 20, 2013"}, {"Title": "Best. Camera I've Owned", "Author": "C28", "ReviewID": "R1OIA66X9BRBSH", "Overall": "5.0", "Content": "I love this camera. I took it to Mexico on vacation and have the BEST pictures, very clear and the wifi function allowed me to load pics from my camera to my iPad daily so I could be sure to have copies on my cloud in case something happened to the camera (theft, damage). The recommended waterproof case doesn't fit the camera so be careful.", "Date": "May 29, 2014"}, {"Title": "Consider another camera", "Author": "Akaiya", "ReviewID": "R2YIPQ0A44UON5", "Overall": "2.0", "Content": "Have had the camera about a month. good video, sharp pictures. Largest problem is the LCD screen. If you are in open sunlight it becomes impossible to see what you are targeting, but works well in shade. The reviews on this were ranting how great it was. You would think those reviewers would step outside occasionally to take pictures.", "Date": "May 27, 2014"}, {"Title": "Great camera - love the wifi feature and zoom", "Author": "David B. Little", "ReviewID": "R14X59NN4IH0CQ", "Overall": "5.0", "Content": "Overall - this is a great camera.  Lightweight, easy to carry in a pocket, simple to use with great features.  We especially like the zoom and wifi capability.  Wifi allows me to connect with my i-Phone which allows me to view and upload pictures as-well-as take photographs via a i-Phone command - much better than using the built-in camera timer option where you have to push the button and then run to get into the picture.  Set up the camera and then send the command to take a picture while holding the phone!  Quality of the pictures are great and the zoom function is unbelievable.  I used the camera to get great pictures at my daughter's graduation - 150+ feet from seats to the stage.  Crisp pictures without blurring even at extreme distances.  Highly recommended.", "Date": "May 11, 2014"}, {"Title": "Fantastic Camera", "Author": "Gossamer \"Paul\"", "ReviewID": "RYAYTIO66LSSO", "Overall": "5.0", "Content": "Before my trip to Peru, I was looking for a nice, compact camera in the $200 range.  I looked around at different manufacturers like Sony, Panasonic, Nikon, Canon, but ended up with this due to the price, size and features.  I like the Wifi sync feature, but to be honest didn't use it much since the image transfers can take some time if they are high quality images.  The 20x optical zoom is fantastic and probably the main reason I purchased the camera, since digital zoom is completely awful.  This camera is great in that I can easily carry it in my pocket if I want or the compact Sony case that I purchased with it.  The other cool thing I found was that it was pretty rainy in the mountains of Peru, but this camera handled the moisture beautifully.  I did keep it in a ziploc bag while not using to protect it, but it was exposed to the conditions when I took some pictures and it still works great.  I also like the fact that the flash is built into the camera and doesn't pop-up like others, which can easily break.It's definitely a good camera that I'd recommend to others.  I'll try to remember to post an update in the future to see if it's still OK after a year or two, since alot of these newer cameras don't last too long, but I have a feeling this one may last.", "Date": "April 6, 2014"}, {"Title": "One of the Best Non-Professional Cameras!", "Author": "Paul \"wds\"", "ReviewID": "RPXIHUAKGGIM2", "Overall": "5.0", "Content": "Sony Cyber-Shot DSC WX300This is one of the best cameras for non-professionals.  The camera takes flawless pictures and the quality of Sony Lens G is uncompromised with that of Carl Zeiss Lens. The camera has different setting modes to suit your needs.However, please note that the zooming is not that powerful, I mean when zoomed to the 100% (all the way to 20x), the picture has grainy texture, not to a great extent, but to some extent.  If you want to take best images in bright area with sunlight or similar conditions, the Program Auto (P) works good.The pictures from the camera can be exported to computers or laptops or smartmobile devices that are directly connected to the same wi-fi router. What I mean by this is that if the computer has been connected to the same router using the ethernet cable, the export is not successful. In order to export the pictures to your computer, you may use the following guidelines:1. Download the PlayMemories software from the link: [...]This link will take you to direct download page bypassing all other pages.2. Installation of this software takes around 25 to 35 minutes depending upon the speed of your system. (Do not connect your camera to the computer using the USB cable before the installation of the PlayMemories software, this causes system crash.)3. Connect your Sony WX300 camera after installation of this software, and confirm the location.  That way the camera understands the destination location to export the pictures over the wi-fi.The battery has good backup capacity, way better than WX50.If you are a professional and would like to capture a butterfly with its original colors in sharp contrast for scientific purpose or aesthetic view, this is not for you. This camera is the best for vacationers for their everlasting memories.Thanks.", "Date": "March 30, 2014"}, {"Title": "Wanted to love it, but just OK", "Author": "Mary", "ReviewID": "R1RK5M2GEGQMKT", "Overall": "4.0", "Content": "I have a really nice Sony and wanted this as a purse backup on my trip to SE Asia. I used it about 3 times, didn't really like the quality of the pix, but now I have it in my car, so I'm happy. Can't keep my good camera in the car!", "Date": "February 26, 2014"}, {"Title": "Very Good Point and Shoot Camera", "Author": "David W", "ReviewID": "R1O0I6DTHMA64S", "Overall": "3.0", "Content": "I would have rated this camera a four or five star if it was not for the quirky Wi-Fi mode.  I have a MAC computer and iPhone 5s and even with the help of Sony Customer Service I could enable this feature.  This was one of the reasons I purchased this camera in the first place.  This would have been a great feature if it actually functioned properly.  I was able to connect my smartphone and my phone registered the sony camera but the photo transfer would not function.Otherwise if you forget about the wi-fi function (pretend it does not exist...) it is a great little camera.Maybe a software fix will eventually address this problem down the road", "Date": "February 24, 2014"}, {"Title": "Great camera... unless you want indoor close-ups of your kids", "Author": "Lexie Pear", "ReviewID": "R3T7GBGIPIZHY0", "Overall": "3.0", "Content": "This camera took truly excellent pictures.  I used it for 3 months & loved all of the outdoor shots or groups of people.  However, I kept noticing that EVERY time I took a picture of my baby (which is why I bought & wanted a really great camear) there was a dark shadow in the bottom left corner of every image whenever I used the flash close-up.  I tried all kinds of settings and tried taking photos of flat inanimate objects to see if that helped... the dark corner was there every time.  Turns out, that teeny tiny flash is pretty powerful, but if you are up close to the object, a little shadow is cast when the light goes past the lens.  :(I returned the camera since the reason I bought it was for those close-up shots of my kid... and for now, that's mostly indoor too.One other quirk... I never discovered a way for the settings I chose to stay selected.  (I had to redo any settings I wanted every time I turned the camera off.)", "Date": "February 18, 2014"}, {"Title": "Everything I wanted as an Upgrade....Almost!", "Author": "papa diesel", "ReviewID": "R6WL6SNZ7QZJO", "Overall": "4.0", "Content": "Almost everything about this Sony is great.  Two items that come to mind are the image stabilization and the 20X zoom which set this apart from every compact point-n-shoot I've ever owned.  The quality of the pictures and videos are also superb.  But I agree with a previous review that criticizes the placement of the shutter button that should actually be where Sony chose to put the function selector dial.  You index finger just naturally gravitates to this position but instead of finding the shutter button, you find the function selector dial.  The shutter/zoom button is awkwardly located just inboard of the function selector dial.  It's a minor annoyance that requires you to train your muscle memory but it is also because of this feature that I could not give this camera 5 Stars.", "Date": "February 10, 2014"}, {"Title": "Nearly perfect", "Author": "Ron Graham \"CJ-7\"", "ReviewID": "R20EDHNVSVFAG0", "Overall": "4.0", "Content": "The lens extends so far that it actually casts a shadow on your subject if it is closer than about 12-15 feet. I thought I was covering the flash with a finger until I tested it. Otherwise, it is the best camera we've owned and we buy a new camera about every 3 years. I also purchased a 64Gb card which was worth every penny. Battery life is excellent, zoom is phenominal.", "Date": "January 31, 2014"}, {"Title": "Not Happy with Image Quality", "Author": "Sunny", "ReviewID": "R1UG578TW0UTFA", "Overall": "2.0", "Content": "I returned this camera because image quality was not satisfying. Images had too much noise and were not at all sharp and clear.", "Date": "January 24, 2014"}, {"Title": "SUPER SIZE for Travel , good WiFi, no shutter speed control", "Author": "Bears Fan Jim \"qm2-703\"", "ReviewID": "R2MO9SP2S4KTWH", "Overall": "4.0", "Content": "XxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxA.  Size is amazing for a 20X zoom.B.  Indoor and outdoor colors are like Canon, which means more saturated, almost like Nikon and Lumix \"Vivid\".C.  Indoor exposures w/o flash, using Auto and Auto Superior are usually quite good. For social pics or PC monitor viewing, this camera is quite impressive for low light, getting good exposure with P mode at ISO 3200 and also with Anti-Blur Scene mode.D.  Video is very good. I have not yet tried to make any video longer than 6 minutes.E.  WiFi control of photos and videos thru my Samsung Tab 2 tablet is easy, after loading Sony Play Memories from the Google Play Store. Play Memories is a very small program and does not consume much internal memory, which is great. I did not get good results attempting to download PM onto my Nokia windows smartphone, however.Some weak points with this cam:A.  Focus is sometimes off in zoom past 15x. But in fairness, this camera is the smallest, therefore hardest-to-hold-steady camera with so much zoom.B.  Flash power is not adjustable. This could be a serious problem at closer ranges. But as I said above, P mode and Anti-Blur mode can give pretty good results at high ISO , so try those before you use flash.C.  It is easy to cover a portion if not all of the flash output window with your finger, because the tiny body leaves you having to be careful how you grip. A wrist strap is almost a requirement, because of the way you have to hold the camera by its edges.D.  Considerable noise above ISO 800. Under almost any degree of magnification, the results often look \"speckled\" or \"blotchy\". Be sure to use the zoom first, instead of trying to crop or magnify later.And now, my pet peeve:This camera is for \"Auto mode\" picture taking first and foremost. The WX300 cannot take \"sideways\" photos from a moving vehicle or amusement ride, etc. That is because there is no shutter speed control. (Yes, I still bought it knowing I would sometimes miss my manual controls). On the other hand, I have actually been able to get pretty decent outdoor stop action shots by using ISO 1600 in daylight.. Would never have to go this high with my cameras that have PASM modes.CONCLUSION:Size is great, 90% of still photos are very good, exposure and WB are very accurate, video is great but sound not so great, and that 20x zoom is very, very handy when it is held steady or there is a fast shutter speed used in good light.Actually I tried and liked the Canon SX280 with its PASM and adjustable flash power, even though it is a bit larger and heavier. But Canon is having a terrible glitch with video on the SX280's - I tried two, and they were both defective in their video. The other major pocket zoom, Panasonic, has by most reviews taken a step backward from the nice ZS15 and 20 models of 2012.So this Sony WX300 gets the edge as \"best new travel zoom introduced during 2013\" almost by default.", "Date": "January 10, 2014"}, {"Title": "Good Camera", "Author": "Abdul Qayum", "ReviewID": "R1MV0028TK3PLV", "Overall": "5.0", "Content": "Sony DAC-WX300/B 18.2 MP has all the characteristics required for personnel camera. The results are very good but the camera is vulnerable to shock.", "Date": "January 10, 2014"}, {"Title": "it 's good camera", "Author": "Chi Du", "ReviewID": "R24P9EZUFRS86C", "Overall": "5.0", "Content": "very nice and sharp pictures. But i try to send pictures to my TV, connecting to my TV via WIFI is not easy.", "Date": "January 8, 2014"}, {"Title": "Good Camera", "Author": "Jessica Young", "ReviewID": "R1ANGBIQK1KFH9", "Overall": "5.0", "Content": "I like this camera a lot. I'm not a professional photographer but I love to take cameras wherever I go and this one is the perfect size for a coat or pant pocket. I don't really like the position of the zoom button - seems too close to the settings button, but takes great pictures and great video. Would highly recommend if you enjoy an easy, good, dependable camera", "Date": "January 5, 2014"}, {"Title": "Awesome!", "Author": "Michael H.", "ReviewID": "R2Y68PZ8U43ZO4", "Overall": "5.0", "Content": "Great camera for when I simply cant lug around my DSLR. Shutter speed is lightning fast. Solid construction so I'm not worried about throwing it in my pocket. The zoom works extremely well. It doesn't have the same amount of options that my DSLR has but lets face it, when I need to tweak things or swap lenses then I just bring my DSLR. This camera is for the shots you would have missed anyway because your camera is sitting at home.", "Date": "January 5, 2014"}, {"Title": "Best Camera for my money!", "Author": "Roger S. Bock \"World traveler, adventure seeker\"", "ReviewID": "R200YUAEI1EBG4", "Overall": "5.0", "Content": "The is a power house of engineering for outstanding pictures with long distance shots.  The lens magnification out performed the other cameras on display that cost hundreds of dollars more and is very compact and easy to carry and have at the ready to capture those action shots as they are happening, not after having to dig out a large camera from it's case with an equally long heavy lens attached.  The controls are well marked and easy to adjust or just leave it on automatic and still get great pictures.", "Date": "January 4, 2014"}, {"Title": "Easy to use but tiny controls", "Author": "shutterbug", "ReviewID": "R3MDS6DU1E1J20", "Overall": "4.0", "Content": "This was a gift for my daughter, so I have not printed any photos, but I did set the camera up to work with my wireless Internet and synced it to my cell phone.  It was a fairly easy process.  It seems that it works well as long as you open up the app on the phone and then choose the pics from the camera to send.  Then you can share to social media from your phone, not directly from the camera.My only other comment is that the controls are very tiny, so if you have large hands, it may be a bit challenging, however the menu system is very straight forward and I feel like its a very user friendly camera even for a beginner to use.", "Date": "January 2, 2014"}, {"Title": "Awesome Camera", "Author": "bwanc", "ReviewID": "R20QVLV5990SLT", "Overall": "5.0", "Content": "I have had a lot of Sony DSC cameras and this is by far the best one yet.  Now, I'm no camera guru.  I still can't explain what an F-Stop is.  So from a typical casual user, this camera is great and easy to use.  It takes excellent pictures.  One of the big problems with prior cameras was picture blur from moving kids and pets.  I've tested this camera's ability, puposefully taking pictures of fast moving objects.  NO BLUR!!  The 20x zoom is phenomenal.  The picture was a little gritty in full zoom in some poorly lit interior shots, but crystal clear at full zoom in outside shots.  Maybe the F-stop thing has something to do with it?!?  I haven't used the Wi-Fi feature yet.  If you have to download 300 pictures, seems Wi-Fi isn't really feasible.  Another improvement is the mini USB charging ability. No longer need the special \"Sony-only\" charging cable!  Lastly, Sony is finally using a standard SDHC Memory Card.  No longer have to hook up that special \"Sony-only\" cable.  I'm not going to comment on all of the other special features, because this camera has already proven itself as a great, great buy.  Yes, I'm sure there are even better ones out there, but for the price this one is hard to beat.", "Date": "January 2, 2014"}, {"Title": "Great Camera!!", "Author": "Brett A.", "ReviewID": "R3LZXB5D989QCK", "Overall": "5.0", "Content": "My brother in law received this same camera for his BDay last summer and ever since, my wife, has wanted this to replace her 5 year old Panasonic.  The portability for all the concerts we go to will be great, the 20x optical zoom is amazing, especially for a camera this size.  I am not a camera geek so I don't know a lot about photography, but the price is worth it!", "Date": "January 2, 2014"}, {"Title": "Great small camera", "Author": "Bruce Fagley", "ReviewID": "R14X3ZFNNHDC5S", "Overall": "5.0", "Content": "Ordered this sony after our old cannon bit the dust. Small size takes some getting used to. Takes great pictures, zoom is especially impressive, we were at a show yesterday, sitting about 200' back from the stage and I was able to zoom in and take good low light pictures without the flash. Image stabilization works very well.  Many different \"scene\" modes, including a panorama mode that actually works pretty well.  A lot of features in a small package.  I was also able to use the WiFi feature to connect to my IPad and download pictures pretty easily.", "Date": "January 1, 2014"}, {"Title": "Picture almost too bright", "Author": "Reflection \"Superwoman\"", "ReviewID": "R1BO1X99ZQ9XCS", "Overall": "4.0", "Content": "I must admit that I need to spend some time figuring out how to use this camera properly.  I've had it for a couple days and the automatic mode pictures seem almost too bright.  One the plus side if this extra brightness, I took a picture in the dark and the photo came out as though there was perfect lighting.", "Date": "December 31, 2013"}, {"Title": "good purchase", "Author": "BFJ", "ReviewID": "R3PAJ1FILW5XKY", "Overall": "4.0", "Content": "I juts bought this camera for my parents after my own purchase 6 months ago. I particularly like the optical 20x zoom which makes a great difference with electronic zooms. I like the light weight and the large screen on the back. Only one negative, i find it a bit slow to take a picture. I don't have any comparison so this is a feedback on an absolute basis. I would recommend this camera.", "Date": "December 30, 2013"}, {"Title": "Fabulous Camera!", "Author": "EnglishPen", "ReviewID": "R10AYTRRJPQTU7", "Overall": "5.0", "Content": "My husband and I love this versatile, easy-to-use pocket camera. It is a powerful little device, and it is sleek and \"pretty\" as well (I got the red). The lens is amazing, and the pictures are stunning. Many of the pictures I took with this camera look as good as the ones my husband took with his Canon Rebel 35 mm. We are both delighted with this Sony camera's performance. I spent a few days getting familiar with it before we went on our vacation. A little time invested in reviewing the functions pays big dividends when you are ready to shoot. Nevertheless, if all you want to do is point and shoot without thinking about functions, this is a great camera for that too.", "Date": "December 18, 2013"}, {"Title": "camera itself is excellent, but wifi and software need work", "Author": "MCRC", "ReviewID": "R2S3ZKMINS1L4", "Overall": "5.0", "Content": "I really like this camera- it's easy to use, takes very nice quality photos, has quick performance, a great zoom, and does reasonably well in low light. It has a built in flash where many of its competitors have a flash you have to manually pop up (which I tend to forget to do and end up missing the shot). But the Wifi setup was anything but easy to set up, and wireless transfer to my PC is disappointingly slow. I had quite a bit of trouble installing PlayMemories as well (it kept crashing until I figured out it wasn't compatible with some of my old cell phone pics- after I deleted them it worked fine), but I finally got it working, not that I'll probably use it much. Also, it doesn't take video at 1080p, only 1080i maximum.For comparison, I also tried the Fujifilm F900EXR. That camera's Wifi setup is easier and its wireless transfer is faster than the Sony's. However, the Fujifilm's picture quality is definitely not as good as the Sony's- it takes a lot of effort to get decent pictures with the Fujifilm, its auto modes just aren't very good (as I note in my review of that camera), whereas the auto modes with the Sony are excellent. The compact size of the Sony is also a real plus.So I think this is great camera for my needs, and the camera itself is what's most important, but the wireless functions and software setup could use some work.", "Date": "December 7, 2013"}, {"Title": "Wow!", "Author": "Caruchi", "ReviewID": "R1QG4JUE8LURCG", "Overall": "5.0", "Content": "Excellent so far! Photos are amazing and wifi option is pretty convenient, I use it with my ipad and share photos almost instantly", "Date": "November 14, 2013"}, {"Title": "Best in Class", "Author": "Julian Scruggs", "ReviewID": "R1V6JXR1UPZ38N", "Overall": "5.0", "Content": "Best camera in its class...and a little outside its class. Wife took it to a Beyoncé concert and you'd swear she was a professional. The video and screenshots looked like something out of a magazine. Slides in your pocket, takes great Hi Def pics, and is easy to use.", "Date": "November 8, 2013"}, {"Title": "like it", "Author": "Sher", "ReviewID": "R3AVIT9PNVXVPB", "Overall": "4.0", "Content": "Good camera. Wifi helps. Nice zoom.  Pic quality is very nice. No blurs. Always handy because of its size. Like it", "Date": "October 30, 2013"}, {"Title": "Great camera good price", "Author": "Jason K.", "ReviewID": "R1QWOL92Q4S3OR", "Overall": "5.0", "Content": "Nice Little camera and easy to use...takes great pictures. would recommend to anyone who is looking for a new camera", "Date": "October 5, 2013"}, {"Title": "COMPACT CAMERA WITH GREAT FEATURES", "Author": "Rama", "ReviewID": "RIUE03AT61C5R", "Overall": "5.0", "Content": "The Sony DSC-WX300/B Digital Camera is EXCELLENT. The 20x Optical Image is really Wonderful in such a Small Camera. The WiFi Feature is superb.", "Date": "September 7, 2013"}, {"Title": "Incredible camera!", "Author": "david penning", "ReviewID": "R24I8C8NFS2DHE", "Overall": "5.0", "Content": "I first bought the Samsung WB150F...but was very quickly disappointed with it.  I was then looking at a few Canon models, especially because Canon always seemed to be at the top for point and shoot cameras.  But after trying this Sony out in the store, there really is no comparison.Pros:It has an extremely quick focusing time.  Even when taking videos, I don't lose my focus.  With other models it takes time to refocus, as you zoom in or out, but not this one!!The clarity of the pictures and videos is really amazing.  The effects that the camera offer are really great too!The camera offers an \"advanced flash\" that reaches farther than the normal flash - and I was very surprised with how well it worked.Incredible battery life.I really could keep going on in this section!Cons:Be careful when shooting really close macro pictures.  If the flash is on, and you try to get really close, you could find a dark spot on the corner of the picture when the flash hits the extended lens.There is no way to manually change - as far as my knowledge - the shutter speed.  But with the Intelligent and Superior functions, they do a really good job at trying to make it right.If you use Mac computers, you can't get the PlayMemories for your desktop.  You can still use iPhoto for your pictures, but if you want to record your videos in high quality, you have to use iMovie to import them.  Not a bad thing, but for people like me, I like to keep all my things in the same place (which means I then export my iMovie recordings to iTunes, then import that file into iPhoto and delete the others).If you're looking for the best point and shoot camera for $300 or less, this is it.  If you want to spend more, then you might as well move out of point and shoot models.", "Date": "August 30, 2013"}, {"Title": "I cannot put it down", "Author": "Dennis R. Smith, Jr.", "ReviewID": "R21M3TV3QYQE8K", "Overall": "5.0", "Content": "I was a little skeptical about a 20 power for such a small camera. I took it to the beach and I could not believe how clear some of the telephoto pictures I took. I have been using it to photograph the hummingbirds in the back yard. I continue to be amazed at the quality of photo. I am not one for big expensive cameras so this is perfect. I have owned Olympus and Canon but this beats them both.", "Date": "August 27, 2013"}, {"Title": "Love it!", "Author": "titus", "ReviewID": "R1ZXR1CLUTSPEC", "Overall": "5.0", "Content": "This is the third camera I have bought this year and the only one I have kept. Very user friendly; menu and features are simple and don't require a lot of time to get used to or figure out how to use. One thing that is a disappointment is the force flash. It doesn't flash every time. There is some type of auto setting that keeps it from going off, but if you switch the dial to a program setting you can force flash every time. My favorite feature is the video.  While you are taking HD, you can also snap still images!  Love that! And when you go back to watch the video, there is no pause or indication that you took a photo at that time.  It does take some extra time once you stop filming for the camera to write the pictures, but that hasn't been an issue for me so far. Clarity is another story. It's strange, I can take all the pictures I want from a moving car or even our boat and I can clearly see every drop of water, but if I take pictures of the kids playing in the house, they are a bit blurry with movement.  Still trying to figure that one out. Overall I am pleased with this camera and plan on keeping it for many years to come. I recommend it to those who want an easy to carry point and shoot. I always keep mine in my purse.  You never know when you're your going to need it.", "Date": "August 20, 2013"}, {"Title": "Great little camera for casual use", "Author": "CAD \"CD\"", "ReviewID": "R3R241XF9IOX0S", "Overall": "4.0", "Content": "This camera surprised me, it's tiny!  Tiny but powerful!  I bought this compact camera in the pretty red, for future international travel.  love the auto upload feature.  The software uploads directly from the camera to my laptop via a connection wire, so NO CD's!  I found the apps for the software in the Apple App Store which is awesome as the camera cannot be directly attached to an iPad or iPhone, so I'm in heaven.  The only thing is that I'm a little concerned about damaging the little thing as in the past I was used to using a full sized SLR. Big difference!  But it will fit into any little pouch in a purse or even a pocket.  I haven't tried the video yet but expect it will be awesome too if the rest of the features are any indication.  Battery has decently long life, but the true test of that will be the video feature as the camera is supposed to take up to 30 minutes of vid.  Bon voyage!", "Date": "July 18, 2013"}, {"Title": "Great in low light", "Author": "deneice zeve", "ReviewID": "ROL7DJGGG0WCP", "Overall": "4.0", "Content": "So far it takes better than expected photos in low light, is stylish, small and easy to work.  Haven't printed out pictures but onscreen they look great.", "Date": "June 1, 2013"}, {"Title": "The camera I've been waiting for", "Author": "fastv8 \"Home theater lover\"", "ReviewID": "REXFX4TDB12YQ", "Overall": "5.0", "Content": "I had several criteria when upgrading my 2009 model Panasonic camera:a) The new camera must be small and light - my Panasonic was just too large and heavy and I was no longer willing to take it anywhere. The WX300 is PERFECT for carrying in your pocket. It's very small and very lightb) The zoom must be greater than 12x - in this case, a huge 20xc) It must be optically stabilized - The WX300 uses a lens mechanism to stabilize the video, not just image sensor shiftd) The battery life must be reasonable - The WX300 has AMAZING battery life. Even though I bought a spare battery, I have never needed ite) Video must be up to 1920x1080 - my old camera was 1280x720 maxf) The audio must be stereo with auto gain control - I go to a lot of concerts and the audio just gets blown out when using my smartphone - the WX300 has this and also a wind noise cut, although I don't have that enabledThere is only one thing that I was disappointed with and that's 3D photos. They just don't have any depth when viewed on my 3D TV. However, I didn't buy the camera for that, plus I had low expectations with a single lens device anyway.On the other hand, the panoramic pictures are VERY good once you get the hang of taking them.I took the WX300 to Mexico on vacation and shot more than an hour of video of a bay cruise. The video is BREATHTAKING when viewed on a large LCD TV. The quality has FAR exceeded my expectations and for this alone, I highly recommend the camera. I needed a decent point and shoot camera and have found it all in the WX300.", "Date": "July 25, 2013"}, {"Title": "Long-time Canon user, very impressed with the WX300", "Author": "Kevin La Ra", "ReviewID": "R29B91YWRL9Z20", "Overall": "5.0", "Content": "I am a long time Canon user, but I was getting tired of Canon not supporting 1080 HD video in their point-and-shoot cameras.  I know that the PowerShot SX280 now supports 1080, but the pre-release reviews I read put the Sony WX300 video ahead of the SX280.  And they are right.  Video is smooth. Exposure and contract are spot on.  Colors are rich but not over-saturated.  And the 20X zoom is wonderful.  The image-stability does as good a job as you can expect.  You can't fault the camera if you have shaky hands at 20X zoom.I bought this to take to Disneyworld instead of my Rebel SLR.  The WX300 is incredibly small.  The size and weight will be an asset when carrying it around all day.  And the 20X zoom will allow me to get the shots and videos I want of the kids on the rides.The user interface is very intuitive, if you have used a camera in the past 10 years.  This is nice, because the paper user manual is brief.  Sony is saving money by making the full user manual electronic.  But, so far, I have not needed it.  The menus and on-screen help is wonderful.  Sony has done a great job with the user interface on the WX300.The only thing I wish is that the micro-USB charging port was not behind the rubber cover on the right.  Since I am not going to buy a separate battery charger, I can see this cover coming off in a couple of years after repeated use.  The odd thing is Sony put the lesser used HDMI connection on the bottom, without a cover.The only negative I can find so far is the built-in flash over-exposes indoor shots.  This might just be on the built-in LCD, because the photos look a little better on my color calibrated PC monitor.  However, the fact the flash is built into the body and not a pop-up is nice.  You just need to make sure your right-middle finger is not in the way when pressing the shutterThe shape is VERY rectangular.  I am not sure if Sony could have added a little contouring without sacrificing functionality.I have only had the camera for a few day, so I have only had a change to try out the automatic modes.  Looking forward to updating this later.I just saw that Sony is coming out with the HX-50V - same sensor but with a 30X zoom lens.  Now I am wondering if I should return the WX300 for the HX-50.", "Date": "April 30, 2013"}, {"Title": "Stay Away, Sony Customer Service is Terrible, camera doesn't last.", "Author": "raesun23", "ReviewID": "RNRCZDDRSF00B", "Overall": "1.0", "Content": "Bought this camera about 6 months ago, worked great, then one day shutter started making a clicking sound and would not focus.  Still had a warranty, sent to Sony for repair, and they would not honor the warranty and tried to charge me $230 for repairs.  I only paid $250 for the camera!  That's a shame on Sony, thought they would be more reputable company and honor their warranties and provide a better product.  I will go back to a canon, at least they with stand normal day to day use and won't break after only 6 months.", "Date": "March 17, 2014"}, {"Title": "Decent Point & Shoot", "Author": "Joseph Spiegel \"Joe\"", "ReviewID": "RDVYSWSRI6NEF", "Overall": "4.0", "Content": "Sony DSC-WX300/B 18 MP Digital Camera with 20x Optical Image Stabilized Zoom and 3-Inch LCD (Black)The first thing I noticed about the Sony WX300 and unfortunately other mid-level point & shoots is that they don't include an AC external charger with the kit. At around $300+ for these cameras, that's a cheap thing to omit. Still it was the first thing I noticed while unpacking and made me do a double take. I'm not deducting a star as it seems to be the way, now. What it did come with was a USB cable an AC adapter, a battery and a wrist tether. It's a very basic kit. There is also a quick reference guide and a link to more software and manuals on line.When you download and install the software you also get to setup the Wi-Fi on the camera to move your photos to your computer wirelessly. This took me a couple of tries to get going but once I got it right it is easy to transfer pictures to my PC. I'm running Windows 7. You bring up the menu and chose the Wi-Fi transfer and away the newest pictures go, super easy.  I've never had a camera that has this feature, they all should!In using the camera I notice it is smaller than my Lumix ZS20 Panasonic Lumix ZS20 14.1 MP High Sensitivity MOS Digital Camera with 20x Optical Zoom (Black). It is also lacking a good grip. There's a slight indentation where a good strip of rubber should be. Make sure you have the tether on your hand; this thing is too smooth for my taste. As for build quality, it's fairly typical of mid-level Made In China, plasticky cameras. It's all black (my color), with black switches and dials. The white and red models also feature this mono-tone look. My Lumix is black but has gray highlights and chrome dials switches and screws. To me it has the feel of a finer product, but that's my personal take. The Sony has 18 mega pixels four more than my Lumix, and delivers a very fine picture that you can really crop with that many MPs. Though, I did run into some issues with flash photography. I sometimes got a yellow halo around people. It might have been the surrounding lighting but I didn't see it on the rear 3\" display, I noticed it on my 27\" monitor at home. Over all I'm getting some good results and when I have a set of good example pictures I'll upload and comment on them. For video recording it can do 720p. Sony says Full HD 1080, but neglects to put the \"P\" on the end so in reality it's 720p or 1080i. My Lumix is 1080p.If video is a major selling point this is a strike. Many Sony cameras use Carl Zeiss lenses, this one does not. It has a Sony \"G\" lens, my Lumix has a Leica lens and system; yeah Leica makes me feel better. Same price point, the Sony should have had the Zeiss.The WX300 has a nice feature set such as plenty of modes for picture taking, panorama, HDR and enough auto modes to keep novices like me taking decent shots. My wish list for the \"301\" would be a better grip and GPS like my Lumix. Location tagging your shots is great especially if you're a traveler. It has the Wi-Fi why not GPS?  It's a nice camera and takes some really nice pics. I'm thinking my yellow ghost is an anomaly as I can't easily reproduce it. As I write this Amazon has it on sale for $280 in all three colors. They don't sell the ZS20 anymore and its price has skyrocketed to $400. At that difference the Sony has some real advantages. I think you'll like this camera but there are some really good choices in this price range.", "Date": "June 14, 2013"}, {"Title": "Defective Camera", "Author": "Penny Murphree", "ReviewID": "R18KNR4UU8542J", "Overall": "1.0", "Content": "After reading many reviews featuring compact zoom cameras, I ordered this model which was being rated as one of the top five.  The photos taken looked as if they were in a paint mode.  After resetting all features to factory default, it still wasn't correct.  I decided too that the menu was not very easy to negotiate so I didn't order another of this model.  My replacement is the Nikon S9700 with 30x zoom which I really, really like.", "Date": "April 24, 2014"}, {"Title": "Not a worthy buy !!", "Author": "Karthik K Venkat", "ReviewID": "R271ZC1ABGKXEV", "Overall": "2.0", "Content": "Had used it for a function at my house for the first time and decided to return it. Though the size is very compact and a good 20X zoom, the most important thing is the picture. This gives you a blur picture if there is a slightest movement by the subject. When you take pictures in the party, you cannot ask the subject to pose for the pictures every time. Take it from me, you cannot take spontaneous shots with this cam.", "Date": "January 1, 2014"}, {"Title": "Worth every penny", "Author": "Gary L Lovette", "ReviewID": "R1Z5HDYDKA3N1X", "Overall": "5.0", "Content": "No where locally or online had as good of a price as Amazon. After extensive research online the DSC-WX300 is in a class all it's own. Best feature by far is the +auto which takes multiple pictures on different settings, combines the best features and creates an awesome photo.", "Date": "December 6, 2013"}, {"Title": "SONY is improving but still has a few things to nail", "Author": "RIK", "ReviewID": "R3LWDTHA6KOBLA", "Overall": "3.0", "Content": "I have tried SONY HX20V (and its predecessor HX9V), and this camera is an improvement over HX20V in that thei) Camera body is compacterii) Flash doesn't pop upiii) Battery life is improvediv) Charging position doesn't require camera to lie on the lens or LCDbut some old problems still persist and new ones have been addedi) Video's (AVCHD) have lines in the last frame when played on Windows Media Player on Windows 7 (there is no clean ending of the movie). This bug was introduced in HX20V (HX9V didn't have this problem) and SONY hasn't fixed it yet.ii) Panorama mode is still not as easy as with Casio's Exilim series. Sony gives you a fixed buffer that you have to fill in, instead of making a full panoramic picture based on when you stop, so if you don't fill in the full buffer you get black bars.iii) If you zoom beyond 4x and try to take a close up of a nearby item (ex. close up of nearby flowers using optical zoom instead of bending down) the camera won't focus. SONY's have had this problem along with Nikon but others like Casio Exilim series handle this scenario well.iv) The door to the charging unit is really flimsy and the connection between the power cord and the charging socket was very tight on my unit requiring a lot of force to unplug.v) Play button was a little too flush with the camera body, found myself pressing it a few times to switch mode. HX9V had poorly designed buttons which were fixed in HX20V and now some have come back.vi) Menu audio controls are not fine grain - so you can't turn off beeps during playback while keeping the beep feedback during focusing.Overall the camera is nice, takes good photos and videos, has fancy features like 20x optical zoom, HD quality video including modes for Blue-Ray discs, WiFi sharing, 3D pics, InCamera guide etc. in a very slim body. Compared to other compact superzooms that I have tried (Canon SX260HS, Sony DSC HX20V, Sony DSC HX9V, Samsung WB750, Nikon Coolpix S9100, Casio Exilim EX ZR100 and Panasonic DMC ZS19) I'd place this one better than all but the Panasonic. It's a different matter that Panasonic has taken a step back in it's \"upgrade\" to ZS19 with ZS25/30 which prompted me to take a look at SONY again.", "Date": "July 11, 2013"}, {"Title": "Does just what I needed it to do", "Author": "J. Ehrlich \"music addict\"", "ReviewID": "RCYKY4VL363WQ", "Overall": "5.0", "Content": "[...]I bought it to take pictures at concerts and shows, where I am usually sitting in the balcony.  I love the results I got.  Link to a few of my pictures is above.", "Date": "July 6, 2013"}, {"Title": "Love this camera!  I bought 3!", "Author": "scottrhayesdb2", "ReviewID": "R1B524HD1PFOIR", "Overall": "5.0", "Content": "I was looking for camera with good zoom capability and high quality photos.  I had no idea it would be so rich in features and capabilities until I got it out of the box and reviewed the User manual.  Wifi.  Movies.  Great pictures.  Awesome zoom.  I went to a conference and took pictures of speakers from the back of the room with the zoom - you'd think I was 5 feet away looking at the pictures!  I bought this white camera for my wife, a red one for my daughter, and a black one for myself - I like that we all have the same great camera but we can tell which camera belongs to who!  Well done Sony!", "Date": "June 6, 2014"}, {"Title": "Excellent Camera", "Author": "Rahul", "ReviewID": "R260M8L77PJSZQ", "Overall": "5.0", "Content": "Its small and handy and works well when you have to carry light. great zoom, nice big screen and very handy.", "Date": "June 5, 2014"}, {"Title": "Small and powerful", "Author": "PK", "ReviewID": "R1M4X1676EC8J9", "Overall": "5.0", "Content": "I was going on my very first cruise and did not want my heavy Nikon D90 or my Canon 50x hanging around my neck all the time. I never considered a  Sony camera because of their proprietary memory card. I already had tons of SD cards. But I did want a quality small pocket size camera with a good zoom. I didn't want to rely on my phone because it seems I have to charge it every 5 min and I wanted something more reliable because I take tons of pictures. I was attracted to this camera in the the store because of the 20x optical zoom and found out that Sony cameras now accept SD cards. To make a long story short I used this camera all over on my cruise. It took great low light pictures around the ship, pretty sunsets, tons of selfies and high quality movies. I carried it in my pocket everywhere I went. The only thing I had problems with was the sweep panoramic zoom. I tried to use that feature when I was in the Smokies several weeks ago and kept getting a error message telling me that I was not moving the camera in the right direction. What!!??.  I just found out I was being too timid and not moving the camera quickly enough in the correct direction and it now works fine.The camera uses the standard mini usb cord to charge, but it is a little tough to insert the plug in the camera. That could be a better design.Conclusion:  I could not be happier with this camera and I am still surprised with its versatility and the quality of the photos. I carry it in my purse and use it all the time.", "Date": "June 5, 2014"}, {"Title": "Nice camera - but not what was ordered.", "Author": "Michael E. Nave", "ReviewID": "R31P9OAMGRI0J1", "Overall": "1.0", "Content": "I ordered a new camera. What I got was was probably someone else's return. It was shipped without the original box, no strap, and has hair/dust inside the lense. I like the camera, but it goes back next week for a replacement. I can't believe it was switched out.", "Date": "June 5, 2014"}, {"Title": "GREAT Camera", "Author": "DGator", "ReviewID": "R2V8E0KANK06NP", "Overall": "5.0", "Content": "This camera is a great buy. You get fantastic image quality both in pictures and video. The audio is pretty clean as well. One thing I would highly suggest is buy a class 10 memory card. Most people buy a nice camera and go cheap with the memory card.", "Date": "June 5, 2014"}, {"Title": "Takes excellent pictures", "Author": "Henry Marzuchowski", "ReviewID": "R2JQL8EPOJZMQQ", "Overall": "5.0", "Content": "Great camera, take exceptional pictures especially in low light. Videos are good, very compact and great battery life. Love all the features. Highly recommend", "Date": "June 4, 2014"}, {"Title": "Great point and shoot camera", "Author": "AllieJ", "ReviewID": "R37IU9NW8YKJRQ", "Overall": "5.0", "Content": "Amazing zoom, and fast shutter. Very easy to use, even the auto setting photos are clear and bright. Really enjoy the wi-fi photo sharing", "Date": "June 4, 2014"}, {"Title": "Thrilled!", "Author": "Amazon Shopper", "ReviewID": "R1PLYS48E6CXFB", "Overall": "5.0", "Content": "This camera exceeds my expectations. It was also a deal buying this through Amazon for $199, as these are $330 directly from Sony! Here's what I love about it:-Amazing clarity of distant objects using the 20X zoom.-Great automatic focus.-The ability for the camera to automatically detect & select the appropriate scene settings.-Well lit and clear flash photos, as opposed to some other cameras where it's nothing but glare.-The ability to photograph & film simultaneously.-Panoramic mode.-10-second timer option.-Rapid shot option. (Will continue to rapidly take photos as long as the shutter button is held down.)I'd have to say that so far, this is the best camera I've ever owned! Compact, yet so many impressive features. As an average user who occasionally uses a camera for eBay items, events, holidays, and general photo taking, this is plenty for me, and I anticipate to get years of enjoyment out of it.", "Date": "June 1, 2014"}, {"Title": "Great camera", "Author": "Steve S", "ReviewID": "R7ULD7CTSKIPT", "Overall": "5.0", "Content": "I had an older Sony model, but it was about 3 years old.  It didn't have all the features (no panorama, WiFi connectivity, only 12 MP, 3x zoom etc.).  This camera is smaller than the older one.  I've only used it a few times, but the photos it takes are outstanding. I can't wait to try it in low-light settings.", "Date": "June 1, 2014"}, {"Title": "great", "Author": "Jessica Lynn Buchanan", "ReviewID": "RQZQY3H1G5T2M", "Overall": "4.0", "Content": "Wonderful camera for a beginner. Very easy to use. Love the big screen! Love the feature that allows for auto - adjustment. Sometimes it takes a little long to process the pics tho, which means I have to wait to take the next pic. This is an inconvenience if you're taking live action shots.", "Date": "May 28, 2014"}, {"Title": "All it claims to be", "Author": "CB", "ReviewID": "R2FQ8RMYGT6PM7", "Overall": "5.0", "Content": "This small camera is loaded with the features I actually use: large format captures, optical zoom, quick focusing, quick shutter, reasonably long battery life.  (I use photo manipulation software on my PC and so do not use those features on the camera.)  It is steady at full zoom and excellent in low light.  I purchased this smaller camera for a recent trip and I am very pleased with the outdoor shots in a wide variety of weather conditions.  Even more impressive is the light gathering capability in indoor areas where flash was prohibited or the space was too large for flash.  The loss of resolution in low light is minimal compared to other, larger, cameras I've used.One caveat:  this camera comes with no memory card and you'll want one.  I bought the 32GB Sony card and did not run out of space in a week's shooting.", "Date": "May 27, 2014"}, {"Title": "Excellent pocket camera", "Author": "C. Frame", "ReviewID": "R2M4KJY0ITTQD2", "Overall": "5.0", "Content": "I absolutely love this camera.  I strayed away from Sony point and shoots a few years ago and went with a Canon, bad move.  While I love my Canon DSLR, their compacts leave something to be desired.  This is a great camera, takes amazing pics and video.  Love it!!!!!!!", "Date": "May 21, 2014"}, {"Title": "Impressive for a point and shoot", "Author": "Kimberly M Klodnicki", "ReviewID": "R24ZGP3D1SE4TD", "Overall": "4.0", "Content": "This camera does a fantastic job when shooting outside with plenty of light. It is easily comparable to a DSLR at that point. However, inside where the only light is from incandescent light bulbs, it isn't great. It isn't sharp at all and it is kind of noisy/grainy. To get around that, use the flash if you don't mind it looking pretty harsh.Overall, if you need a point and shoot for shooting outdoors, I highly recommend it. For indoors, like birthday parties or similar events, I would consider looking for another camera.Lastly, for $200, its a great deal. Sadly, I didn't know about this price on amazon and paid $280 at best buy.", "Date": "May 17, 2014"}, {"Title": "Best compact yet!", "Author": "K. Hormann \"Karl- NY\"", "ReviewID": "R3CJ49SFFRY095", "Overall": "5.0", "Content": "Purchased this to replaced my Canon Cybershot which had grainy and blurry indoor pictures.Let me tell you this camera blew me out of the water. Fabulous indoor pictures with no flash!20X optical zoom is amazing and pictures come out amazing both indoor and outdoor.  Just leave setting on Auto and enjoy snapping away.  100% satisfied.  But just get a rubber case since the camera is thin and a bit slick.So far I'm loving it.", "Date": "May 16, 2014"}, {"Title": "Great camera", "Author": "sweetpinmagnolia", "ReviewID": "R1HFOX2D83T4J0", "Overall": "5.0", "Content": "I liked the camera.  I wanted a point and shoot but this camera offers much more.  Light weight but I did not realize that a photo card did not come with the camera so at the last minute I was out buying a photo card.", "Date": "May 13, 2014"}, {"Title": "love it!", "Author": "jupiter0342", "ReviewID": "RTZYTI3KNZE5M", "Overall": "5.0", "Content": "took some really awesome pics from far away. my friend thought I was much closer than the pics lead them to believe and the quality was amazing!! :D", "Date": "May 8, 2014"}, {"Title": "Very good camera.", "Author": "ma", "ReviewID": "RMQL2T88B9Z3U", "Overall": "4.0", "Content": "Takes great pics. Easy to use. Full of features. I have no complaints. I am very happy with my purchase.", "Date": "May 5, 2014"}, {"Title": "Amazing", "Author": "Doodlehead", "ReviewID": "R2RG4W32W7WFUD", "Overall": "5.0", "Content": "This camera is amazing. The zoom really lets you frame your shot the way that you want to and the high resolution means that when you scale it down for the web there is really no noise to speak of. I can't speak to the effectiveness of the wifi as that's a feature that I haven't used and probably won't use but this camera is probably the last point and shoot I'll ever purchase, it's that good.", "Date": "April 30, 2014"}, {"Title": "great camera at a great value", "Author": "Amanda", "ReviewID": "R3TJ5S9VVAX9HR", "Overall": "5.0", "Content": "This camera takes amazing photos with great quality and the zoom is amazing too. I definitely recommend buying this camera!", "Date": "April 28, 2014"}, {"Title": "Crystal Clear", "Author": "Elsa Roman", "ReviewID": "R13MHHRKMI5ACK", "Overall": "5.0", "Content": "I was looking for a good travel camera that would take crystal clear video and pictures. I previously owned a Sony camera and loved it, that camera grew old so I decided to purchase this brand again. I researched a lot and finally decided for this one. The settings are fairly easy, pictures are very clear and has different scene modes. It's very lightweight and can be carried in a pocket (which I don't recommend). it records full 1080HD and the sound is very clear as well. I am in love with this camera.", "Date": "April 28, 2014"}, {"Title": "Great Camera", "Author": "Goodwilldiscountbooks", "ReviewID": "R34TIEVLZMW9PR", "Overall": "5.0", "Content": "Great camera.  More than sufficient for our needs.  Takes terrific pictures!  We would definitely recommend this camera to any one selling online.", "Date": "April 25, 2014"}, {"Title": "Great camera in a small size", "Author": "AvidReader", "ReviewID": "REXFMORU947B7", "Overall": "5.0", "Content": "This is the 2nd model camera I bought for my wife and now for my wife' niece  a great compact camera with BIG features I Highly recommend. This item a lot  ,you can really grow  withThis camera", "Date": "April 23, 2014"}, {"Title": "Great camera", "Author": "Matthew", "ReviewID": "R13L68ECZ6MX0Y", "Overall": "5.0", "Content": "I'm planning on taking this camera to Europe and just testing it around my house it seems pretty awesome. Great zoom and great quality.", "Date": "April 20, 2014"}, {"Title": "Good things DO come in small packages", "Author": "km311", "ReviewID": "R1S4E4LPELVCVL", "Overall": "5.0", "Content": "My daughter has this camera and loves it.  I travel alot and she told me it would be a great little camera to take on my adventures.  Considering it's a small camera, it does many things a larger camera does......", "Date": "April 12, 2014"}, {"Title": "Great camera at a reasonable price", "Author": "Joel Jackson", "ReviewID": "RD4F7Q03HL1O1", "Overall": "5.0", "Content": "This is a great camera that takes wonderful pictures and video at a very reasonable price. It was fairly easy to understand the functions, and you can look up anything you need to know, about how to use the camera, directly in the menu.", "Date": "April 3, 2014"}, {"Title": "I loooovvvveeee this camera", "Author": "Jay", "ReviewID": "R39RMSVNTNBA24", "Overall": "5.0", "Content": "This camera is everything you could ask for and more. It came with a free compact camera case and the quality of photos is amazing. The wifi feature actually works and itsn't difficult to use at all. It is extremely convenient being able to snap photos and send them to the recipients as you go. I rarely connect the camera to my computer for anything outside of backing up photos. Easy to use. You won't regret it.", "Date": "April 3, 2014"}, {"Title": "Quite Nice camera for the price", "Author": "NawlinsPicker", "ReviewID": "R3KDJOF0Y227CH", "Overall": "4.0", "Content": "Bought this camera for our upcoming vacation to the Grand Canyon. Takes good quality pictures, and the video quality seems good enough, too. It' a solid little camera, heavier than I expected. I bought the battery charger for it and 3 extra batteries. Don't want to miss out on anything when we're rafting down the colorado river.", "Date": "April 2, 2014"}, {"Title": "Took a leap!", "Author": "goofnonyou", "ReviewID": "R3VJXUSLMMHHIQ", "Overall": "5.0", "Content": "I wanted a camera with a higher mega pixels and I hike a lot and also wanted a camera that would take panoramic images. I am a die hard Canon fan and after taking a pic of some friends in Arches N.P. with a Sony, decided to give the point and shoot a try. Read a bunch of reviews and just a few bad and decided to give it a shot. Very cool little camera. I usually take my Powershot everywhere I go, but got dropped and will cost more to fix than it's worth. I've taken multiple shots in all phases and have no bitches. Some of the problems that I read in the bad reviews don't seem t be giving me any problems. I'm happy with it. Good buy for never holding one in my hands.", "Date": "April 2, 2014"}, {"Title": "Great Point and Shoot", "Author": "BC EchoHawk", "ReviewID": "RC3Z7HZRQX4X6", "Overall": "4.0", "Content": "So far, this camera has met my expectations. I bought it for the long optical zoom and the wifi capability, and those have both worked well. I've only had it a couple of weeks, so I haven't had a chance to try it in program mode, which is how I would like to use it more, but the automatic settings have been fine. My only concern is the lens cover. I wish I could carry it without a case in my pocket, but after touching the front accidentally and seeing the hinged lid covering open up, I don't dare do that. For the price, it's been great.", "Date": "March 29, 2014"}, {"Title": "Great Zoom Camera", "Author": "Az Dave", "ReviewID": "R2QUO0O6JU7TJ7", "Overall": "5.0", "Content": "Always buy Sony cameras because of quality pictures.  This camera is great because of its small size.  I hike a lot and like to have a camera that is accessible quickly so when a picture moment comes up it is easy to point and shoot.  You can carry it in a shirt pocket or camera case because it is light weoght.  Only negative comment on this camera is the location where you plug in the USB cord.  You open a small door in the corner of the camera and have to work a little to insert the cord.  This was not well thought out by designers.", "Date": "March 28, 2014"}, {"Title": "love it", "Author": "sandiseeus", "ReviewID": "RQNQ8OP22FET4", "Overall": "5.0", "Content": "this a great camera,  like all the features and the size is great for my purse, i take everwhere I go", "Date": "March 27, 2014"}, {"Title": "Sony DSC-WX300/B Digital Camera", "Author": "SGBaker \"sgb22741\"", "ReviewID": "RK7P8D11Q8PDF", "Overall": "5.0", "Content": "Great buy and great camera.  It took some time to get acquainted with the new item but it is a quality product from the best Digital Camera manufacturer on the market.  Reasonably priced and easy to operate.  Still learning the intricacies of the camera but I have owned Sony Digitals from Amazon.Com for nearly 15 years now.  Great product to be sure.", "Date": "March 16, 2014"}, {"Title": "Great so Far", "Author": "Kelvin S.", "ReviewID": "R1ZZ7R384MOJBJ", "Overall": "5.0", "Content": "Its a Great Camera, just that if you're looking for a point and shoot, this isnt it, this camera is more of a manual camera if you want the perfect shoot", "Date": "March 12, 2014"}, {"Title": "Clear pics and video", "Author": "Iphone accessory user \"Iphone accessory user\"", "ReviewID": "RJBXZAY5Y9FHB", "Overall": "5.0", "Content": "I would recommend this camera to a friend. The pics and video are very clear.  This camera is very convenient to carry around. Reason for purchase- my phone can only hold so many pics. Love quality and details that this camera captures.", "Date": "March 6, 2014"}, {"Title": "Quite the little powerhouse", "Author": "steve kiddy", "ReviewID": "R1FWEDJGID35DL", "Overall": "5.0", "Content": "My wife and I got this for Christmas. She has yet to put it down. In the three months or less that we have had it, she has taken probably more than 1000 pictures. It's that good. The zoom is amazing. The pictures come out crystal clear and so detailed. Worth buying if you are in the market for a small but powerful device.", "Date": "February 28, 2014"}, {"Title": "Great deal", "Author": "Xjerzgirl", "ReviewID": "R3CHOQ5XRBE59E", "Overall": "5.0", "Content": "I love my camera. It's reasonably priced, compact and easy to use. I would recommend this camera to anyone. Great buy", "Date": "February 26, 2014"}, {"Title": "Good camera; cool features", "Author": "P. Cady", "ReviewID": "R24E34EJ0YUDO", "Overall": "4.0", "Content": "I am just loving how even relatively inexpensive cameras can take shots amateurs only dreamed of not 10 years ago.  Compact but not featureless by any stretch.  Downside:  no viewfinder, which I didn't think I'd miss until I starting shooting in bright daylight, where the screen is almost useless.  Other than that, a great little camera.  Haven't used the wifi yet but that looks like a most useful feature as well.", "Date": "February 26, 2014"}, {"Title": "Compact,great detail..", "Author": "Richard", "ReviewID": "R4UUEDAJIYL8O", "Overall": "5.0", "Content": "Lightweight compact camera,great detail,fits sony case nicely and compact enough for wifes purse,takes nice colorful and detailed pictures,downloads easily to my laptop.", "Date": "February 23, 2014"}, {"Title": "Sony DSC-WX300/R 18 MP Digital Camera", "Author": "Kash Sobhe", "ReviewID": "R351HUQFZLRKGE", "Overall": "5.0", "Content": "Just bought his camera 2 weeks ago. I love it. The quality and zooming is great. I always carry it with me with a case attached to my belt.", "Date": "February 19, 2014"}, {"Title": "An Upgrade..", "Author": "Andy Olsen", "ReviewID": "R2J2BUVL4CKD6H", "Overall": "5.0", "Content": "My moms old camera was very similar to this one. She felt that the pictures were blurry and the snap of the picture was delayed. Here's her replacement!  Good product..", "Date": "February 14, 2014"}, {"Title": "Wanted a Camera  without a touch screen.", "Author": "D. Hamlin \"D. Hamlin\"", "ReviewID": "RDO668VDW36WU", "Overall": "4.0", "Content": "Camera seems to take good photos, but the setting have a learning curve that takes time.  I still have not figured out why it comes up with a processing mode after taking some pictures.  I do like the panoramic mode.", "Date": "February 12, 2014"}, {"Title": "Great Product", "Author": "Allen Campbell", "ReviewID": "R108AXV5FUDOSW", "Overall": "5.0", "Content": "This product was just what I expected and good bang for the buck.  I would recommend it for others to buy.", "Date": "February 3, 2014"}, {"Title": "Amazing product", "Author": "noneother", "ReviewID": "R1R6XN9OZV7WOF", "Overall": "5.0", "Content": "I have been loyal to Cannon point and shoots for many years, but the last two I purchased, even though they were top rated, produced inconsistent quality and limited lifespans. This camera is higher quality by leaps and bounds over the recently purchased top of the line Cannon point and shoot camera it is replacing. This camera consistently results in amazing photos that are reminiscent of my high end Nokia DSLR. The setting selections on this camera are vast, and it is very easy to fine tune photos on the fly, resulting in amazing shots time and time again. The camera is compact, yet feels very solid, and time between shots is very brief. Built in settings are very powerful and easy to use, and the  WiFi feature is a nice plus. In my opinion, the best feature is the setting that adjusts the image when the natural light is coming from behind the subject. With any other camera the subject would become dark and your photo would not be usable, but with the setting on this camera activated, you will get a perfect shot regardless! Not to mention, the camera is absolutely beautiful in the white finish.", "Date": "February 2, 2014"}, {"Title": "compact and light", "Author": "D. Ingwerson", "ReviewID": "R2VAACIHU6DD0K", "Overall": "5.0", "Content": "I had a previous cybershot that I loved. This one is smaller and lighter but has a stronger zoom. Very easy to carry in my purse.", "Date": "January 29, 2014"}, {"Title": "So good even a 9 year old can take great photos!", "Author": "V&D Sukumaran", "ReviewID": "R2FOFWUEVC5UAF", "Overall": "5.0", "Content": "I bought this camera for the whole family but it is used mostly by my nine year old, who wants to make movies when she grows up. She was able to figure it out in no time. The video and photo quality is by far the best of all the digital cameras we have owned. It takes great movies, and the panoramic feature is fun, too. I have not had a bad photo with this little camera.", "Date": "January 28, 2014"}, {"Title": "GREAT camera!", "Author": "David Hull", "ReviewID": "R2R16UVX84OYWW", "Overall": "5.0", "Content": "In just got back from the cruise I especially bought this camera for.  It is always a pleasant surprise when the result is better than you expect. I still have more to learn about it but on auto it does a great job.", "Date": "January 26, 2014"}, {"Title": "I shopped til I dropped", "Author": "Mary Lou C", "ReviewID": "R2GLBPSW0ZAF6K", "Overall": "5.0", "Content": "I reviewed several cameras before finally deciding on the Sony DSC-WX300/B. All the functions that I wanted are easy to use and the results are spectacular. This camera practically shoots itself. The long zoom is especially handy. We used it at our son's Navy Recruit Training Graduation in Great Lakes and although we were in the balcony we could see him as clearly as if he was 3 feet away! The battery charge seems to last forever! I LOVE IT.", "Date": "January 21, 2014"}, {"Title": "BEAUTIFUL Great Camera", "Author": "DaddyO", "ReviewID": "R2IT9D88JK81HD", "Overall": "5.0", "Content": "I own an SLR Cannon, but there were times when i didn't want to carry the bag and all the extra lenses, accessories, etc.So i went researching a good Point and Shoot...and came across the reviews on this one, so i decided to give it a try.The camera itself is beautiful, compact and packed with features.  The 20x optical lens is top! and the included image stabilizer has proven to be a great feature for me [as my hands do shake a little] The quality fo the photes are super sharp and high definition!Amazon was nice to give me a Free carrying case at the time i bought it.  LOVE IT>", "Date": "January 19, 2014"}, {"Title": "Sony DSC-WX300 camera", "Author": "Lloyd J. Huff", "ReviewID": "R2SELLNO26G5YI", "Overall": "5.0", "Content": "This camera exceeded my expectations.  The quality is precise, picture quality is terrific.  I wouldrecommend it to anyone who needs portability and ease of use.", "Date": "January 19, 2014"}, {"Title": "Nice camera", "Author": "Tatman55", "ReviewID": "R3EICLKVPPBA3P", "Overall": "5.0", "Content": "It was as much or more than I expected. As usual, I did review after review and in the end went with past experience with Sony products. I love this camera", "Date": "January 18, 2014"}, {"Title": "I love this camera", "Author": "Julie James", "ReviewID": "R1DIN586UD5WYW", "Overall": "5.0", "Content": "I really love this camera, it has lots of fun features and takes great photos. I am pleasantly surprised at how easy it is to work and love that the manuel is right on the camera.", "Date": "January 16, 2014"}, {"Title": "Great gift for my boyfriend!", "Author": "DrSmalls", "ReviewID": "R1YPXRXN37MS6U", "Overall": "5.0", "Content": "I go this camera for my boyfriend for Christmas and he loves it! The  only negative is the processing time for each picture. The camera is slow to load  the picture taken, so may not be great for taking pictures of kids or pets.", "Date": "January 14, 2014"}, {"Title": "Great cam for it price!", "Author": "Andres Carrillo", "ReviewID": "R38AWVVSBG8L8F", "Overall": "5.0", "Content": "Excellent image quality and zoom. Great performance, good for indoor and outdoor. Adjustment of settings could be a little bit complicated.", "Date": "January 13, 2014"}, {"Title": "Nice little camera.", "Author": "Zman \"coffee-nut\"", "ReviewID": "R1I52VT9C8ZRIT", "Overall": "4.0", "Content": "A well built quality camera at a reasonable price. It's small enough to fit in a pocket, but not too small to handle. There are only two problems: Indoors the flash tends to leave a shadow behind your subject; and you have to be careful not to cover the flash with your finger.", "Date": "January 12, 2014"}, {"Title": "Video Test in Review!", "Author": "Paula Arango", "ReviewID": "R3LDXVZRNBV01Q", "Overall": "5.0", "Content": "[...]These are a view videos I have taken with my Sony Cyber-shot DSC-WX300. It's really small but a great camera. Works great in low-light and takes awesome pictures and videos!", "Date": "January 11, 2014"}, {"Title": "Great camera", "Author": "Jayne S", "ReviewID": "RUGSYO9K57D3U", "Overall": "5.0", "Content": "I love this camera. Has a built in flash that I seemed to keep putting my finger over the first dozen or so pictures untill I got used to it. You also have to down load a program called PlayMemories in order to save pics on you computer. Since I have an older desk top, it would not read the memory card and would not accept the USB cable, I'm not sure why. The card did download on to my lap top w/o problems. I'm not fond of the PlayMemories program but the camera it's self is great. I've always had Sonys and this one is by far the best. The zoom is wonderful and the movies look good. Fairly easy to use as I'm used to the Sony controls and nothing much has changed. There are lots of setting for differnt types of pictures and lightings. The in camera user guide is a big help too. Would recomand this camera to others even if it's your first.", "Date": "January 11, 2014"}, {"Title": "sony dsc wx300", "Author": "CEDRIC B. WILLIAMS", "ReviewID": "R3EMWR44602TMW", "Overall": "4.0", "Content": "Because of the quality of the product. And I'm highly pleased with the speed of the camera and the precision of photos it produces.", "Date": "January 7, 2014"}, {"Title": "great camera!", "Author": "Martin Pera Cecchi", "ReviewID": "R1742LIXWZE4CJ", "Overall": "4.0", "Content": "Great camera! Handy but good quality pictures. Also, the wifi function is easy and quick. I was travelling wituout my laptop and could download all the picts on internet through my cell phone. Really practical!", "Date": "January 3, 2014"}, {"Title": "Overall, I love this little camera!", "Author": "Zellie", "ReviewID": "R22WSYKTGCVATQ", "Overall": "4.0", "Content": "I was playing around with the point and shoots on Black Friday in the Sony store and I wanted to get another CyberShot. I've had them in the past and as time went on I shifted to Canon. But I love how well these take pictures in low light situations so the husband and I decided on this one. I got mine for $250, which I would had gotten a better deal on Amazon for them... oh well, it's worth what I spent!I love how clear this camera gets with the 20x zoom. If you're familiar with Disney World; we were on the balcony of The Contemporary Resort watching the fireworks and my husband was able to snap a close up picture of the castle with Tomorrowland in the corner making it look like we were IN the park. It's insane how close and how clear the pictures get with this zoom! Even when you're recording a video, the zoom gets up really close and clear. Obviously stabilization is going to be tricky due to being up so close but you can see the camera stabilization go to work quickly! Speaking of, I have a hard time walking and talking and keeping my hand still while vlogging which caused my Canon to be SUPER shaky. But with this camera, you can barely tell! Also, by far the best point and shoot I've owned that takes amazing clear videos during fireworks, just sayin.Another thing I really like are the photo setting options. I don't remember all of them off the top of my head, but there's so many to choose from! I love how small and compact it is, it slides perfectly into my tiny purse and fits perfectly into my husbands pocket if I'm too lazy to put it away.The thing I DON'T like about this camera is that you can't simply insert your memory card into your laptop and drag and drop your files, you have to go through a program that's pre-loaded into the camera and set it up. It's a nice little program, but sometimes I'm in a hurry and would rather have the ability to just drag and drop my files onto my desktop. Another thing is that the numbers on the videos/pictures sometimes break away/reset. So it'll say 1/4 instead of what number the actual file is which makes it a little complicated when you're transferring files to remember WHERE that file is.Another thing that sort of annoys me is that I can't manually select the macro function while taking pictures. I have to get up really close to the subject and wait for it to switch on its own before snapping the picture. Does anyone know if manually selecting macro is an option? I've looked and haven't found it but maybe I'm just missing it?For the most part, I do really like this camera. It makes vlogging so much easier and much more fun! The pictures come out great and other than the two previous points, I have no other complaints!", "Date": "January 1, 2014"}, {"Title": "Great camera as usual", "Author": "FrazierDave", "ReviewID": "R32ES4DVCAYMZL", "Overall": "4.0", "Content": "My favorite camera, I have bought Cybershots for years. My ONLY complaint is that where I hold it to take a pic, my finger blocks the flash now. Other than that, it's excellent!", "Date": "January 1, 2014"}, {"Title": "Small, Light and Powerful", "Author": "Lee J. Segura II \"coolrunning1809\"", "ReviewID": "R1UXR2UT3XBWL5", "Overall": "5.0", "Content": "Small, Light and Powerful  I take my camera everywhere I go, just tuck it in my pants pocket and if I need to take a picture it's there.  I love to take pictures but I don't want a large camera hanging around my neck. This little camera is equivalent to a 500 mm zoom all you'll ever need.", "Date": "December 28, 2013"}, {"Title": "Great Little Camera", "Author": "Chuck", "ReviewID": "RHNRPGE8DSC62", "Overall": "4.0", "Content": "This replaced two other Sony camera's i had. I got this one for ease of travel and for its wifi ability. Works well. The software and wifi ability works fine on my Win7 Home Edition PC, makes it easy to transfer, and if the destination folder is a stream folder for say icloud or other then sharing your pics is as easy as just wirelessly transferring photos from camera to PC, it's like two clicks on the camera, etc. I am not a big fan of tiny cameras but this one is good for traveling, etc. It has plenty of modes to handle many pic taking situations. A tad more $$ then some of the others, but Sony has always been more $$, you get what you pay for, etc.", "Date": "December 20, 2013"}, {"Title": "Great Value - best autofocus camera I have ever owned", "Author": "Abruzzi", "ReviewID": "R7AIZP2KA5TGI", "Overall": "4.0", "Content": "After 14 years of owning digital cameras, I have finally discovered a suitable autofocus camera in subcompact form that consistently takes quality photos in almost all conditions.", "Date": "December 14, 2013"}, {"Title": "Excellent camera", "Author": "edward", "ReviewID": "R16OOEVETAZVLD", "Overall": "5.0", "Content": "Excellent camera. I'm extremely pleased with my purchase. Excellent picture quality, many cool features and awesome zoom! Very nice looking and very good size. Definitely recommend.", "Date": "December 11, 2013"}, {"Title": "EXCELLENT CAMERA! ++++++", "Author": "Orialis Maldonado Cuchi", "ReviewID": "R7779ZZHRUGOF", "Overall": "5.0", "Content": "I've always been faithful to Sony Cybershots... And this one has been the best by far... Excellent pictures, features to play qith your photos or adjust them... The Wifi capability is a definite plus ! It's flawless... I don't have to wait to get home to be able to share my pictures with my family and friends, on the go I just send them to my phone directly and voila ! Im in love... ! haha !", "Date": "December 11, 2013"}, {"Title": "Great small camera", "Author": "Discerning buyer", "ReviewID": "R3HVS4YHAWP6L0", "Overall": "5.0", "Content": "Ease of use - great pictures.  I worry about the lens cover not closing ( I had that problem with the Coolpix I had and it costs as much as the camera to fix it) but seems to be working fine.  Took 1,000 pics in Italy with little or no issues re: blurring in low light conditions.", "Date": "November 2, 2013"}, {"Title": "great camera - from very first shot!", "Author": "Arline Murray", "ReviewID": "RDME5BI2V6AIT", "Overall": "5.0", "Content": "great little camera for the inexperienced! Not too complicated, but has all the feature wanted!!! so very happy with the purchase!", "Date": "September 9, 2013"}, {"Title": "Buy one you won't be sorry.", "Author": "Valerie R. Stern", "ReviewID": "R2I8DCVAXLFHG6", "Overall": "5.0", "Content": "Love, love, love this camera. Took the most amazing photos on my recent European trip. Awesome zoom feature and freeze focus. Easy download features. Can't beat the bundles and price.", "Date": "August 22, 2013"}, {"Title": "best choice", "Author": "era", "ReviewID": "RNP6JSJY7EIO8", "Overall": "5.0", "Content": "after searching several options in price and features this camera was the best I found compared against several models of Canon", "Date": "July 27, 2013"}, {"Title": "Sony DSC-WX300/B 18 MP Digital Camera", "Author": "edwin cheung", "ReviewID": "R1I2U3GUZOCT7Y", "Overall": "5.0", "Content": "The price was great for the value of the Product.  The special features with the camera including the telephoto, panaromic pictures and qulity of the lens are fantastic.  The compact size is great for day in and day out carring as well as when you go for a tour.  I am very happy with this camera.  I strongly recommand to friends who like to buy a point and shoot camera.", "Date": "July 18, 2013"}, {"Title": "Snappy little camera", "Author": "illy billy", "ReviewID": "R2MDQD8S6KYAUT", "Overall": "4.0", "Content": "The great advantage of this camera is its 20X  zoom.  It is light and good looking although a bit tinny to the touch.  Otherwise it has all the great advantages of the Sony make and reliability.", "Date": "July 9, 2013"}, {"Title": "Great for pictures that will be uploaded to facebook.", "Author": "D. Kinney", "ReviewID": "R3AIXS71ESSQWC", "Overall": "5.0", "Content": "I use this camera as an extension of my iPhone's camera.  The quality is not on par (or even close) to a DSLR, but the pictures are more than sufficient for use on the internet.  WiFi connectivity is nice and really simple to setup.  Video is on par with dedicated video cameras I have owned in the past.  Basically just a really fun camera for those times when you need to zoom in on a situation.", "Date": "June 17, 2013"}, {"Title": "A little complicate", "Author": "Jeremy R. Littman", "ReviewID": "R3UQZSFVGT5JCV", "Overall": "4.0", "Content": "Sony is always a great camera but this one is a little complicated and  you have to be patient learning all the aspects", "Date": "June 9, 2013"}, {"Title": "Sony DSC-WX300 White", "Author": "Rita Wong", "ReviewID": "R14ZDWE2UK8LEE", "Overall": "5.0", "Content": "This is a great camera. The 20x zoom and fast shutter speed are perfect for capturing my two little dogs' playtime. I wouldn't use flash for close objects in indoor. With moderate indoor light, the camera would adjust and produce bright picture. I haven't try all other features and video yet. As for the small buttons and user manual, I don't have any problem with that. The price is excellent for all the features it come with.", "Date": "June 9, 2013"}, {"Title": "Great picture quality and zoom - not to great extra features and menus", "Author": "eyecore", "ReviewID": "R3JITSGNUPO2ZM", "Overall": "4.0", "Content": "This is my second Sony camera, my first one being my current \"go-to\" camera, the Sony Cyber-shot DSC-TX200V 18.2 MP Waterproof Digital Camera with 5x Optical Zoom and 3.3-inch OLED (2012 Model).This camera, having a tremendous zoom, was intended to replace my somewhat aging Panasonic SuperZoom camera that's 12 or 15MP, but whose pictures are still clear and overall great quality.  This Sony camera DOES outdo the Panasonic in a couple areas:  The zoom is better, the pictures are higher megapixel, but both look about the same (great)...but low-light pictures actually look better with this Sony than the Panasonic with a larger lens.  So, overall, it's a better camera and it fits into a pocket, making it much better - I don't want to carry around a camera bag anytime I want to take a good quality picture.Some other features, such as the WiFi functionality is a lot less impressive.  The theory is you can upload your pictures to your computer or online service immediately.  I found that functionality to be confusing to use, and takes some time figuring out how to set things up, and even then it doesn't like to work very well.  (It sits there telling you that your WiFi is connected...but is in a \"busy-wait\" type of screen.)While I usually don't install software from companies selling me hardware (outside of required drivers), I did go ahead and install the picture software included here.  While I did uninstall it (because I manage my pictures differently), the software IS quite high quality, much like all Sony software I've used (like SoundForge and Vegas.)  To bundle software with hardware, Sony does NOT take the HP route of hiring some poorly educated programmers that get paid based on the number of lines of code they write, regardless of quality.  So that's a big plus in my book...Alas, the reason I mentioned that this is my second Sony camera...between the two, my other one is waterproof, touchscreen, and has a 5X zoom.  This one is not waterproof, has dials and multi-purpose buttons, and, quite frankly, requires a bit of learning to figure out how to make it do what you want it to do.  That's the reason for the 4 stars rather than 5:  my other Sony camera is VERY intuitive to do anything I want within the menus -- this one isn't; in fact, it's less intuitive than the Panasonic its replacing.Overall, a great camera with an awesome zoom that takes great pictures and videos...recommended, but don't buy it the day before you need it for great pictures, because you'll need some time to get familiar with it.", "Date": "May 25, 2013"}, {"Title": "NOT THAT GREAT", "Author": "I Heart Retirement", "ReviewID": "R7BON0X5SBSIE", "Overall": "3.0", "Content": "With so many five star ratings on Amazon, I was sure I was getting the best point and shoot camera available with 20x zoom.  I have taken it on vacation twice and have had mixed results.  Outdoor daytime photos and videos are great.  When shooting photos of people, sometimes there is a strange out-of-focus appearance on faces in group settings.  On indoor photos of people, sometimes there is a strange orange cast to the entire photo.  This could be caused by the type of lights used in the setting but who wants to fiddle with going to the camera's menu to take a quick group shot in a restaurant?  I love the size of the camera but, woefully, prefer my older Sony point and shoot with only 10x zoom for better photo quality, especially for taking photos of people.  Also, as mentioned by other reviewers, there is no dedicated macro mode.  This little beauty isn't as great as you might think.  Buy something else unless you're okay with mediocre results.  I would say I've been pleased with about 80 per cent of the photos I've taken with this camera.", "Date": "May 27, 2014"}, {"Title": "Easy to use", "Author": "Harold A. Beauvais Jr. \"Alcando\"", "ReviewID": "R1Z0J1R3M725U6", "Overall": "5.0", "Content": "This camera is truly a point and shoot camera.  I can just aim at object (including moving targets) and press button.  The only thing I wish is that I could get the true colors of a sunset.  This is my third digital camera and easily the best as far as picture quality.  The ability to take a still while videoing is nice.", "Date": "April 6, 2014"}, {"Title": "Nice camera", "Author": "Luis", "ReviewID": "RSEQPX20TJUJB", "Overall": "3.0", "Content": "It is a nice camera, with a good telephoto. It has a nice weight, but I was actually surprised with its size...it is really small.The bad part was that they sold it to me with no memory card...That is very unconfortable at this point...specially because I live in South America and it takes a lot of time, and expensive shipping...", "Date": "March 25, 2014"}, {"Title": "Nice little camera.", "Author": "B. B. Smith", "ReviewID": "R1A02YS9F7T3Y0", "Overall": "5.0", "Content": "I bought this to replace another tired, old Sony warrior that simply gave up the ghost.  I was looking for a replacement of about like-price.  Didn't pay much attention to the zoom feature when ordering.  I am very pleased with that, and the camera in general.  I am a Sony person when it comes to cameras, and once again, Sony didn't disappoint me.", "Date": "February 25, 2014"}, {"Title": "Not too bad for the price.....", "Author": "John R. Maldonado \"ricker2\"", "ReviewID": "R36D6CKN4VM6P6", "Overall": "3.0", "Content": "Not much to complain about. Settings are a bit scattered. Nice small size but as is almost always the case......cramming more features into smaller & smaller devices will sacrifice other characteristics. As is noticed with the latest round of compacts, taking certain macro shots will reveal a shadow of the lens housing too close to crop out. The pop-ups have the same problem. Battery life was surprisingly lengthy with this model. But.....had to return it. Good luck.", "Date": "January 9, 2014"}, {"Title": "Love this camera !", "Author": "Rushik", "ReviewID": "R3FVXK0WDKAKB4", "Overall": "4.0", "Content": "It's nice and quite compact camera in market... I like the quality of pictures.. specially in low light...Buy it !!", "Date": "November 22, 2013"}, {"Title": "Great Compact Camera", "Author": "cyndi@goldrush.com", "ReviewID": "RQW8J4864EE6I", "Overall": "4.0", "Content": "This is a great compact camera.  It is easy to use for a novice like me.  The pictures are rarely blurry unless there is a lot of  movement while clicking the picture.  I love that I can't lose a battery while charging it because it charges from my computer.  The charge lasted for 300+pictures per day, even with flash photography, and there was still plenty of power for more.  I was a little disappointed in the zoom feature.  I will have to play with it some more or maybe use a tripod to get them all crisp and clear.  The best thing is how little it weighs; it is easily available for a quick shot.", "Date": "November 15, 2013"}, {"Title": "Good camera. Not one is perfect.", "Author": "Money saver", "ReviewID": "R2ANZ76MXFAG4I", "Overall": "4.0", "Content": "I bought this camera for the high definition view screen and Sony's reputation for long term reliability. (275.00) Picture of the moon is very good. Zoom is very good. Panoramic function is very good. View screen is clear/very good. There is more motion blur on this Sony than my previous Panasonic camera but image stabilization/overall focus is better/very good. I learned you can zoom, save image, zoom again, save again in order to zoom and view for maximum zooming.  Applies when taking pictures without first using zoom.After a picture is taken, it seems to take too long to save picture and be ready for next picture. My older panasonic 12 mp was much faster AND I was able to set \"off\" the option to view the picture I just took which greatly speeds up the time I can take my next picture. I will try a better/faster memory card on the Sony and compare.I greatly appreciate taking pics while filming video. I like the picture burst function too. Takes up to 10 pictures but takes several second to save them all to memory before you can take pictures again. Deleting one picture takes too long! My Panasonic was super fast. Understandably, deleting multiple pics takes more seconds.In this category of camera choices, I feel this one is the most satisfying choice.Buy it and be happy!  : )", "Date": "September 11, 2013"}, {"Title": "Great camera", "Author": "R. F. W \"veiko\"", "ReviewID": "RRFIIHYQDF74V", "Overall": "5.0", "Content": "For the price this camera is packed with features..It takes great pictures and videos and has Wi-Fi to download them as an option. It's small and easy to carry around, it can slid right into your pocket or purse.. It has a rechargeable battery so no worries about buying batteries over and over again. The lens cover closes completely when shut off to protect the lens.  So far no complaints, you usually can't go wrong with a Sony product.", "Date": "September 9, 2013"}, {"Title": "Battery life, ease of use, and video quality are AMAZING! The WiFi feature rocks too!", "Author": "Circ Sys", "ReviewID": "R1IMFSXRY0E74K", "Overall": "5.0", "Content": "So I used this PHENOMENAL website called snapsort.com to narrow down the contenders and this WX300 emerged as the CLEAR winner!! Priced under US$300 and capable of 500 shots per battery charge was the bottom line and our decision gauge. But a Class10 SD card is a must to be able to make use of the continuous/burst shot capability.Also, if you have an Android mobile phone, sharing pictures by downloading them via WiFi to the PlayMemories app on your phone is a breeze!!The only 'cons' are silly little things like the LCD screen smudging easily from your thumb (so i carry a silk Oakley cleaning bag inside the awesome Lowepro Santiago 20 perfect fitting camera case that I got for it) and also the weird & limited Panoramic shooting mode which was a bit of a letdown (compared to the amazing Panoramics my Galaxy S4 takes!) Also the dual-shot feature takes getting used to so at first that was annoying, but after realizing it's a lifesaver for pictures that do or don't need flash, this 'con' is now a 'pro'!", "Date": "August 6, 2013"}, {"Title": "Best camera for the size", "Author": "Ardeal \"Emi\"", "ReviewID": "R2TC0N5X2DPPQC", "Overall": "5.0", "Content": "I have not seen a camera that takes better pictures and is as small as this one. With dimensions 96x55x25mm, or roughly 1 inch wide, it can easily fit in a pocket, yet it does not sacrifice on the huge size of the viewfinder. I have looked at another few Sony cybershot cameras, and I like the High Quality (Huge file sizes though) Panoramas from this camera the best, even better than that from the pricier HX-300. Video is OK. I have not used the 3D photo settings, or the Wi-Fi.This is a fancy point-and-shoot camera. You want a camera like this one to be reliable - no blur or motion issues. Image stabilization is great. The Intelligent Audio settings are probably the best setting to keep it on. One of my favorite settings is the Landscape with HDR setting for outdoor photography, as it takes multiple shots and combines them, to give out the best exposure in both well-lit areas, and shadows. Only issue with this HDR setting - make sure you or the subject does not move for about 1-2 seconds. And another favorite -  you have to try the 10 fps continuous shooting feature. I like to use it on my son doing flips while jumping in the pool.Potential issues with this camera: placement of the shutter release button (this is a cybershot - so it has to have the cybershot dial for the settings at the far end), fragile (nice metallic touch, yet does not seem to be shock-absorbent).Battery life is great with 500 shots per charge, unlike many compact cameras I've seen at Costco that have around 150-200 shots per charge. For around $20 you can buy additional no-brand batteries from Amazon, yet don't expect the same amount shots per charge.One last thing - I purchased a camerabag from a local store specifically for SONY WX cameras and it turned out too big, especially regarding height. Make sure you check out the dimensions, as the camera does not come with a camera bag.", "Date": "June 26, 2013"}, {"Title": "Strong contender and good alternative to Canon S100/S110 series", "Author": "J. Gitzlaff", "ReviewID": "R2GTSIYPEDIGY3", "Overall": "4.0", "Content": "I really enjoy using this camera.  Well-manufactured with good fit and finish, strong image quality, long zoom, good auto focus speed and responsive shutter.  It includes some more advanced features like WiFi hotspotting (though I think most people will be frustrated the first couple of times they use it, because it takes some getting used to how to setup and configure networking functions).  And as usual, Sony's menu control system is a little more complex than it needs to be when compared to similar cameras by Canon, Panasonic, etc., but I've used so many Sony cameras now that I'm getting used to this issue.Fundamentally, the DSC-WX300 is Sony's answer to Canon's superlative S100/S110 line of compact cameras, and I think it should appeal to the same kinds of users: (1) the casual photographer looking for a compact, jack-of-all-trades point and shoot with good image quality, and (2) the more serious enthusiast who wants a pocketable camera with a big zoom when they don't want to lug a larger SLR or interchangeable lens mirrorless camera kit around.The rear LCD screen takes up most of the camera body.  IMO, it's likely to be a major scratch and crack risk if you aren't accustomed to taking good care of your cameras.  If you  often drop yours in a backpack, purse, drawer, etc., with other things, you might want a screen protector.  I bought the cheap but excellent GGS Optical Glass LCD Screen Protector 3 inches for Digital Cameras, which fits perfectly, and couldn't be more pleased with the result.", "Date": "June 20, 2013"}, {"Title": "Mac Users install Wi-Fi for this camera -trouble", "Author": "Stuart Uram", "ReviewID": "R1129K05P8ZVVY", "Overall": "3.0", "Content": "To intall WiFiBe sure to copy the entire site:[...]otherwise you will get Japanese.I had a lot of trouble to get the WiFi to work - maybe it's meIf you use the web info and not the printed sheet that comes with the camera, you will have better luck with the install.", "Date": "September 2, 2013"}, {"Title": "damaged goods", "Author": "LuvTheRing", "ReviewID": "R3G3237JYDXHNI", "Overall": "1.0", "Content": "Purchased through warehouse deals twice, both times there was damage. Returned and bought new. Damage o second camera (cracked screen) was not listed in description. First camera was like new with package damage. Suspect drop from high place causing internal damage . Price was excellent, but it's a risk.", "Date": "April 16, 2014"}, {"Title": "Love it", "Author": "Randy C. Finch", "ReviewID": "R1GH5L9TYXWXOV", "Overall": "5.0", "Content": "I have been buying the latest Sony WX cameras for some time now. They always have some new features that are useful. On this one, it's the 20x optical zoom.", "Date": "April 13, 2014"}, {"Title": "Great product, even greater vendor", "Author": "James T. Manuszak", "ReviewID": "R3SPA3FK59SL9H", "Overall": "5.0", "Content": "The camera has exactly the features I need, but more important, Cardinal Camera and Video provided the outstanding follow-up service that was needed.", "Date": "March 23, 2014"}, {"Title": "Great quality for the price", "Author": "Jessica Kahklen", "ReviewID": "R27EGTD0595T0B", "Overall": "4.0", "Content": "It does the job.  Takes clear pictures, and stable videos.  I'm terrible at writing reviews, but for the price, this is an awesome camera.", "Date": "March 14, 2014"}, {"Title": "Love my Sony", "Author": "Joseph T.", "ReviewID": "RJ0L8O7L5C4HF", "Overall": "4.0", "Content": "My wife loves her new Sony Camera... She believes it's the greatest and does a show and tell with her friends...", "Date": "January 18, 2014"}, {"Title": "Alot in small package", "Author": "Yooper", "ReviewID": "R2O6XDDCGRRJ0G", "Overall": "5.0", "Content": "Bought this camera so I could keep it in my purse and have it available when needed. The size is perfect for my purpose and the pictures are very clear. The magnification is great and I continue to learn more information as I use it.", "Date": "December 20, 2013"}, {"Title": "Nice picture Quality", "Author": "Nitin Gupta", "ReviewID": "R5A6RZZJ9B4A0", "Overall": "4.0", "Content": "We have not used this camera much yet but it is giving good picture quality as of now..hopefully, it will pass all our expectation..", "Date": "November 7, 2013"}, {"Title": "Sony Camera", "Author": "Jason D. Mull", "ReviewID": "R394AFW0R7ORFH", "Overall": "5.0", "Content": "Takes excellent photos, but is rather sophisticated. Reading the owner's manual is essential to optimize use. Could stand to be more user friendly right out of the box.", "Date": "November 1, 2013"}, {"Title": "Almost met my expectations", "Author": "jtall", "ReviewID": "R83H773LB7UCC", "Overall": "4.0", "Content": "This camera does almost everything it says it will do.  I was unable to successfully load the sony software that allows you to manage your pictures.  It indicates that you can transfer pictures to your phone or your computer without cords, cards etc (wireless).  But, I have been unable to make this feature work.  However, the camera takes good pictures and has all of the features I wanted.  Because it has so many features I sometimes find it hard to find the exact one that I want to use i.e. multi shots when you push the shoot button (burst shooting).  Everything considered, I would buy this camera again.", "Date": "October 15, 2013"}, {"Title": "Really nice camera", "Author": "Jose Antonio", "ReviewID": "R2NAIVW1D1H0DT", "Overall": "4.0", "Content": "All I needed. Small, Affordable, Wifi, Excellent photos, Terrific zoom!It is specially for trips or camping.Good quality.Love it.", "Date": "August 24, 2013"}, {"Title": "Great small camera", "Author": "Ackrax", "ReviewID": "R8FPKDNKXBA7P", "Overall": "5.0", "Content": "Small size is great for throwing in your pocket.  Photos and Videos seem quite good, so far.  I wish it would have come with and external battery charger.", "Date": "August 20, 2013"}, {"Title": "Great quality great pictures", "Author": "A. Gass", "ReviewID": "R36YWKYSA2AU8E", "Overall": "5.0", "Content": "Got this camera on sale. It takes fantastic pictures. Excellent zoom. It has every feature you could possibly think of I am very happy with this purchase.", "Date": "August 16, 2013"}, {"Title": "small camera", "Author": "sandlapper", "ReviewID": "R11ILTP8JQS1D", "Overall": "4.0", "Content": "This is a great little camera. I haven't used it too often but plan to use it to take sports related pictures. I like the fact that it is a still and movie camera. Hopefully I can get some great clips of my grandson playing baseball.", "Date": "June 25, 2013"}, {"Title": "The worst camera I ever had", "Author": "Mommy&Dad", "ReviewID": "R1JANGQX4RHHNV", "Overall": "1.0", "Content": "I'm convinced that a lot of awesome reviews on cameras out there are paid propaganda. I'm not a photographer but I couldn't manage to have one single good photo out of this camera. The ones that could have been great shots were actually all shaken with no focus at all. I want to register the birthday of my baby but unfortunately I lost most of photos because the quality of the images and the same thing happened during our Christmas vacation. Another thing that really annoys me is that some of my photos were really bright, then I modified the setting, turned off the flash, and reduced the exposure levels. However every time I turn off the camera all my settings were gone, and then I had to modify the settings every single time I would take a photo because once you turn it off is doesn't save your settings. If you have a child you probably know how hard it is to capture a good pose, but with this camera was really impossible because I couldn't capture the perfect light, or the perfect focus, and by the time I would finish modifying the camera settings the baby was gone. I am used to Panasonic, and the Leica lenses but I wanted to try the Sony camera after seeing so many good reviews. I don't like this camera at all and I will try to return it if it's possible.", "Date": "January 20, 2014"}, {"Title": "Failed after one month and Amazon will not take it back!", "Author": "Anthony Gordon \"94 Corvette\"", "ReviewID": "R1OOPH8S5GY1FB", "Overall": "1.0", "Content": "Stopped working on May 25 2014 (purchased on April 16, 2014).  Will not open, keeps asking for the power to be turned off and on again.  Makes starting sounds but lens will not move.  Can see the photos already taken.  Battery is fully charged.Although this camera gets good reviews, it has been a little odd from day one ... lengthy \"processing\" messages when taking photos (4-7 seconds), which stops you taking a following photos of an event.Don't buy, and if you do, don't buy from Amazon.", "Date": "May 26, 2014"}, {"Title": "Fully recommended ...!!", "Author": "Pedro Jose Diaz Davila", "ReviewID": "R1VRTWBQBLZ7WB", "Overall": "5.0", "Content": "This camera is wonderful ... The photos are high quality ... has thousands of options and issues ... You can shoot a great distance ... and high-definition video are out of this world ...!! Pity does not have a 3D TV to enjoy the benefits of those photos ... enjoy it to the fullest like my camera ... THE RECOMMEND ...!!! PS: I have not taken the first picture waiting for my wife and daughter are traveling ... when they return the first picture that taketh family will ...!!", "Date": "September 19, 2013"}, {"Title": "Good for basic use, but limited in controls", "Author": "J. Maxon", "ReviewID": "R3B6H1OCDX6GH2", "Overall": "4.0", "Content": "About a year ago, I kicked off my pursuit of being a hobbyist photographer (nature oriented). Because I was new to the field and had a low budget, I started off with the Panasonic Lumix ZS20 14.1 MP High Sensitivity MOS Digital Camera with 20x Optical Zoom (Black). I enjoyed the features and abilities that came with this camera, but as a point-and-shoot, I found it restrictive (such as the lack of RAW support) and wanted a more professional solution.So I returned the ZS20 and bought a Canon EOS Rebel T3i.I've been shooting with the T3i for a year now, and just recently upgraded to a Sony Alpha SLT-A99V. Both these cameras offer a wide range of professional tools, but I found myself missing the ZS20. Not because it was better in quality or features, but because there are times I don't want to lug a big SLR/SLT around.Of course, I can always use my cell phone, but the quality just isn't there. My phone is a Samsung Galaxy S II, which touts an 8+ megapixel picture capture. But there's no zoom beyond the digital pixel stretching, and the tiny image sensor does little to support high quality images.That's what makes this Sony DSC-WX300 a great option. Not only does it have a 20x zoom (a real zoom, not pixel stretching) and 18 MP (4896x3672px) image resolution, but it comes with a quality G lens.Sony's G lenses are similar to Canon's L lenses, which are typically only seen seen in digital SLRs and high-end camcorders. But this compact point-and-shoot gives you top of the class glass.That said, I was disappointed with the amount of ISO noise that appeared even in lighted conditions. On top of that, there are very few control options. No shutter or aperture priority modes, so no ability to do things like smooth flowing water, increase shutter to decrease ISO noise, or tweak depth of field for background blurring. There is a background blurring mode, but I find it to be both quirky (says it won't work half the time, but not why it won't work) and inadequate (not a strong blur). But the biggest annoyance is the lack of a good sports mode. Most of the pictures I took of my daughter displayed motion blur of some sort. There is an option in the camera that takes multiple pictures and ties them together to limit motion issues, but it's slow and not nearly as effective as a fast shutter setting.The nice thing about the Sony DSC-WX300 is that it's small and lightweight. It's simple and good for very basic use, but if you don't mind a somewhat larger point-and-shoot, I'd absolutely recommend the latest Panasonic Lumix ZS model instead.", "Date": "May 31, 2013"}, {"Title": "USB charger is the wrong size", "Author": "Barbara folmer", "ReviewID": "R34O9QIXQ7IMUE", "Overall": "2.0", "Content": "The usb charger that came with my camera is the wrong size and none of my other chargers are compatible.", "Date": "December 19, 2013"}, {"Title": "perfect camera with imperfect attchment end!", "Author": "theodora", "ReviewID": "R1JO48MR5M7SZC", "Overall": "3.0", "Content": "The item arrived with the charger with wrong sized end which made it impossible to charge and hence had to be returned for a replacement. This also came with the the same problem - charger with wrong sized end! Amazon reps were very good about this and this time they gave me 20$ to go and buy a new adapter. However I would have preferred not having to go out and get an attachment which should have come at least the second time around!", "Date": "November 4, 2013"}, {"Title": "WARNING: Do not buy!!!! Waste of Money!! READ HERE", "Author": "Drew", "ReviewID": "R1Y7ALJ950O4RL", "Overall": "1.0", "Content": "I purchased this camera at my local electronics store and was looking forward to a decent camera for the price. This camera feels awkward when you hold it and the resolution is UNBELIEVABLY bad.Almost every time I even attempt to use the zoom feature, there is tons of distortion and the menu itself is hard to navigate!I couldn't figure out how to upload video, which was annoying and it takes an eternity just to try and change a setting for any part of the camera.Overall, my experience with this camera was horrible, which is why I took the time to find a QUALITY camera that will last and be friendly to use. Luckily, after searching for weeks, I finally settled on a camera I love! I have used it for just over a month now and the difference in picture quality and overall function is amazing.If you'd like to take a look at this camera GO HERE -------> http://amzn.to/1okZUPVIt is here on Amazon and you won't be dissappointed, I promise!", "Date": "June 6, 2014"}, {"Title": "we bought it and we happy with it , so WE DO recommend to buy this item", "Author": "5D camera Man", "ReviewID": "RVVL96QKQB5A3", "Overall": "5.0", "Content": "we bought it and we happy with it , so WE DO recommend to buy this item that is very good for lady many criteria consider price and functionality - quality of photo is perfect as always with Sony", "Date": "December 25, 2013"}, {"Title": "great small camera", "Author": "Bobbie Ulmer", "ReviewID": "R11MSOPU3L9RO3", "Overall": "5.0", "Content": "I just received this camera, a first for Sony for me. It is nice and small and has a great zoom.", "Date": "December 24, 2013"}, {"Title": "Great camera", "Author": "Dad Eric", "ReviewID": "R2EWAMZC50PB9L", "Overall": "4.0", "Content": "Hard to hold still for sharp shots though. Otherwise it does what I was looking for. Love that red color!", "Date": "August 20, 2013"}, {"Title": "Very happy", "Author": "Deborah Sherwood \"reluctant accountant\"", "ReviewID": "R3D03LMSHP8SOU", "Overall": "5.0", "Content": "I am very happy with this camera!  I was wanting a stronger zoom and this appears to work great although I haven't printed any of the pictures yet", "Date": "August 9, 2013"}, {"Title": "Very nice camera, small size, great picture", "Author": "Conspicuous Consumer", "ReviewID": "R307NORGQS0S8X", "Overall": "4.0", "Content": "The Sony DSC-WX300 is a very nice camera. It is light and very easy to transport. I have not used all the features enough to comment on everything. I will say that it is easy to change the settings on the camera for various inside and outside lighting. The camera takes VERY clear pictures. The button placement does take a little bit of using to get used to. I kept trying to push buttons that weren't there. The camera has a very clear focus and the delay is very minimal when taking a photograph. I have not taken any movies or tried to capture still shots from movies.", "Date": "June 17, 2013"}, {"Title": "Awesome camera....", "Author": "Confucious", "ReviewID": "RO5XT8DJA347Q", "Overall": "5.0", "Content": "This is an awesome camera that does it all. It is small and very portable with lots of capabilities. It is very easy to use once you get the hang of it. I would recommend the user guide and online guides too. I am able to enjoy certain electronics a lot more now since I actually use the user guides rather than going straight to the camera and trying to figure things on my own. The camera itself is light and easy to use for the most part. The large lcd screen is great to shoot photos and to review them as well. The zoom is great and the quality of prints coming out with this camera are superb. My favorite part is the wifi sharing aspect. No need to purchase any wifi sd cards. No need to plug this camera to your computer. Overall the camera is awesome. Easy to use and lots of great features.", "Date": "June 27, 2013"}, {"Title": "Can a camera be too small?", "Author": "cait", "ReviewID": "RPROY35MHEUE8", "Overall": "3.0", "Content": "Yes, I think it can and this one may well be.Yes, it takes great pics and the image stabilization seems quite good from what I can tell so far. Lots of bells and whistles as is so common these days. Honestly, I think a lot of them are gimmickly and I will never use them, but if that is something you enjoy about a camera, you will find quite a few here. And the screen is a very nice size.But...First, this camera really does not have a very solid feel. I compared it to my Canon 260sx, which in comparison is like a little tank.Will it hold up over time..I have my doubts.And that little plastic door to the cable port...oh, I can see that breaking off very quickly. Which also ties into the fact that I HATE charging the battery in the camera. Yes, I can spend an extra bit of money and buy a freestanding charger, but I hate to have to.Is it just me, or is the shutter button in the wrong place? I find having to glance at the top of the camera to find it. Not a huge issue, but odd.The biggest problem however is that I really find this camera just a bit too small.I am a woman, with medium sized hands, and the buttons on this camera are more than a little trying. The on/off is tiny, the dials hard to really get a feel for. I have to use my finger tips. If I have an issue, I can see someone with bigger hands and fingers, like most men, will really have an issue.Great size to slip in a pocket...but once you take it out to actually use it, not so much.For the money, I think there are better options out there to buy.", "Date": "May 24, 2013"}, {"Title": "A capable little camera (with some flaws)", "Author": "Ravenhurst", "ReviewID": "R2HQ8IX9STY8B1", "Overall": "4.0", "Content": "I received my MX300 recently and immediately set out to take a bunch of photos and see if all the hype about this little camera had real legs. Tentative conclusions follow:PROSSmall size, very light, can be carried without the slightest effortSeemingly robust construction - looks sharp in blackImage quality very good (and often excellent)Crisp video with great color and detail - very professionalUseful pre-set functionsExcellent battery lifeCONSWiFi won't work despite hours of testing and seeking solutions on the InternetCamera won't be recognized by Toshiba PC running Win 8 so that you can move images to PC storagePlayMemories software buggy and often inoperative - I wouldn't recommend using it although without it you cannot transfer Movies to your PCConfusing menu structure - functions referred to in manual do not exist on camera menu (e.g. USB Settings under Main Settings)No obvious way to return to main menu once on sub-menuSony should revise the main manual and make it one for \"dummies\" (most manuals of course are written with co-pilot list readers in mind. Poor civilians are left to their own devices).Also, if you have large hands the camera's mini size may be an issue; I have medium-sized hands and the problem still exists, although after a while placing your fingers becomes instinctive.PS: I discovered how to make the laptop \"see\" the camera: unplug the power cord and THEN plug the camera in via USB. WX300 appears magically in My Computer. WiFi still a mystery.PS1: I upgraded my rating to FOUR stars. I am taking the WX300 along on a long trip as the only camera in the bag.", "Date": "May 5, 2013"}, {"Title": "Good pictures but has drawbacks.", "Author": "Clifford G. Giltinan", "ReviewID": "R1P4M2USFPMM01", "Overall": "2.0", "Content": "WAY WAY to small and slippery to hold onto comfortably.  It is almost exactly the same size as a deck of cards, minus the box.  Use the wrist strap or keep a spare $250 nearby.  Shot selection options are confusing as to what they do.  Pictures look the same to me in several different configurations.  The built-in instruction manual is totally worthless.  For example, the little green camera setting reads \"Intelligent Auto... Exposure adjustment with automatic settings\".  The little yellow camera setting reads \"Superior Auto - Shoot sharp image reducing blur and noise automatically\".  Did you get that?  Does 'Superior Auto' trump 'Intelligent Auto', or do I have that backwards?  Needs a blue camera setting that does both, automatic and sharp.  Optical zoom (best) does not pause as it zooms past x20 into digital (not so clear)zoom.  It is almost impossible to get max optical zoom without crossing the line into digital.  I still have not figured out how to kill the flash when I want.  Video is outstanding!  Get something bigger so you can find it and hang on to it.  I regret buying this camera.", "Date": "May 20, 2014"}, {"Title": "Only charged twice before the micro USB port failed.", "Author": "M. Chadwick \"Just a reader\"", "ReviewID": "R1K4I5F1IZIJ7G", "Overall": "1.0", "Content": "It does NOT come with a battery wall charger.  It comes with a USB charger that connects to the camera via micro-USB cable.  Not the standard micro USB that works with a phone or other Sony cameras, but an extra small, mini micro cable connection that is very touchy.  Now after two chargings, the USB connection no longer works. The computer recognizes it as a device, but it won't charge through the computer or USB wall charger.I had to order a battery wall charger for $10.  What a pain in the butt.The camera takes nice photos, but what does it matter if you can't charge it?", "Date": "November 30, 2013"}, {"Title": "Display broken", "Author": "Tohru Washio", "ReviewID": "R303KJ5PPIVDJY", "Overall": "1.0", "Content": "The display was broken with 1 month passing by purchasing amazon site without water, dropping. Sony shop persons said the repairing take 50 dollars or more.", "Date": "December 6, 2013"}, {"Title": "WX300", "Author": "G", "ReviewID": "R1XPLNSO4F0I0O", "Overall": "1.0", "Content": "Poor video quality. Mediocre photos. Cable port difficult to access. Battery charging cumbersome. Plastic cover broke off after one week. Disappointing overall. Expected a better product from Sony.", "Date": "May 18, 2013"}, {"Title": "Look like a open item.", "Author": "toddyan520", "ReviewID": "R2RY7DQBNPJM46", "Overall": "1.0", "Content": "I bought a new sony digital camera.when I got it. It look like a open item.and the camera charger is not even Mach.", "Date": "February 13, 2014"}, {"Title": "Awesome Camera!!", "Author": "Alwin Mathew \"Alwin Mathew\"", "ReviewID": "R27QT01UANHOLK", "Overall": "5.0", "Content": "Awesome Camera!!Awesome Camera!! Awesome Camera!! Awesome Camera!! Awesome Camera!! Awesome Camera!! Awesome Camera!!Awesome Camera!!Awesome Camera!!Awesome Camera!!Awesome Camera!!Awesome Camera!!Awesome Camera!!Awesome Camera!! Loved it!!! It was perfect GIFT was a couple who were expecting their 1st baby!", "Date": "August 12, 2013"}, {"Title": "DO NOT PURCHASE", "Author": "AC \"AC\"", "ReviewID": "R32Q87XKTR68YI", "Overall": "1.0", "Content": "This camera not only came with the wrong size USB cable, but it's the wrong size to work with any of my other chargers (phone, Kindle, old camera, etc).  WTF am I supposed to do with a camera I can't charge?", "Date": "December 19, 2013"}, {"Title": "$330 for the camera made in China?", "Author": "Dmitry", "ReviewID": "RJ6R6NJWQXB9R", "Overall": "2.0", "Content": "Made in China it's $100 camera not a $300+.Pictures are crappy quality my 8 years old camera makes better pictures.Very disapointed product.", "Date": "May 22, 2013"}], "ProductInfo": {"Price": null, "Features": "Capture breathtaking images\nImage stabilization reduces blur\nRed", "Name": "Sony DSC-WX300/R 18 MP Digital Camera with 20x Optical Image Stabilized Zoom and 3-Inch LCD (Red)", "ImgURL": "http://ecx.images-amazon.com/images/I/41aQBIMwvxL._SX300_.jpg", "ProductID": "B00BEHQKPC"}}