{"Reviews": [{"Title": "All I can say is that I continue to be more impressed each time I use this.", "Author": "R. Cyr", "ReviewID": "R3DMN2Z56ZRGX4", "Overall": "5.0", "Content": "I am in a wheel chair and found that I could no longer handle my Nikon DSLR's due to being to heavy and cumbersome.  I really enjoy photography and did not want to give it up.  So, I started my search for a small and lighter point and shoot with a zoom. Initially I looked at Nikon, Canon, Panasonic and Olympus, you know, the usual suspects.  I thought I would like the Nikon P300 series, the Olympus SH50 or the Panasonic LX7.  I started my research on those, and I discounted the Canon when I went to Costco and actually had some \"hands on\" with the ones they had.  The Canon did not seem to have the same build quality as the others, although, in Canon's defense, they do have great image quality.  While reading reviews on the Olympus SH50 one reviewer mentioned the Fujifilm F900EXR as being a more than capable competitor.  The Fuji cameras never entered my mind as a possible purchase.At the end of my exhaustive research I purchased the Fujifilm F900EXR because it had all control options, including RAW shooting, wifi and GPS tagging if I wanted to use that function.  It is a \"full function\" photographic instrument  in a small package.When I received it I took some photos and they looked out of focus, dark or too light to the point they were crappy.  I really started to rethink my purchase and had some doubts.  Like most guys I thought I knew more than the owners manual, but was I wrong.  I read and reread the owners manual then I started to use the camera in each of it's functions until I thought I, as least, had some rudimentary knowledge of each function.  What I found out was that this camera is amazing. It is fast, sharp and has given me some fantastic images.  I continue to use and learn the nuances of each function and filter.  I am now able to take razor sharp images with great color, contrast and dynamic balance.Build quality is worth noting, as it has the \"feel\".  It is just the right size and weight for me to handle and is safely stored in my wheel chair side pocket.If you are looking at a quick travel replacement for your DSLR, I recommend that you look at the Fuji, but it does have a \"learning curve\" to it, or you could just leave it on full auto and still get good shots.  Love the zoom length too.If you don't want, or need, wifi or GPS look at the F850EXR, but it does not have the CMOSII sensor and leaves some other stuff off to  keep the price lower.To all you Canon enthusiasts, I am not anti Canon in any way, in fact I use to own a full service camera shop where Canon was our leader in sales.  I have used Canon's for many years, along with Olympus, Konica, Minolta, Pentax and even Fuji, to some extent.  I have always thought that Canon has, and gives, a great image quality, but in recent years it seemed that the build quality did not seem like their competitors. Canon continues to get some great reviews.All in all, each camera company offers some great camera's in the small, point and shoot with a zoom, you just have to keep asking yourself \" what are my requirements\" and keep that as your guideline.  I just found that the Fuji met all of my requirements and then some at my price point.  Hope this helps..................", "Date": "September 15, 2013"}, {"Title": "Finepic F900EXR vs Samsung WB-850", "Author": "Do42", "ReviewID": "R3V6AS45Y1RV7K", "Overall": "5.0", "Content": "This is a review of the Fuji Finepix F900EXR vs the Samsung WB-850. I recently purchased the Fuji and was a strong proponent of the Samsung WB-850 which I've owned for over a year. Here is my take on them compared to each other.This is my initial review of the Samsung WB850: http://www.amazon.com/review/R1ARV05CZB3H1/ref=cm_cr_rdp_perm?ie=UTF8&ASIN;=B007261BRG&linkCode;=&nodeID;=&tag;=I bought the Fuji from Amazon after wanting a long zoom pocket camera that also shot in raw. Raw is a digital negative file type that is about 25MB in size which is several times larger than the typical .jpg digital picture. I took a class in Photoshop recently and the instructor explained the advantages of a raw file and said that all pros should shoot in raw.If you want to know about the raw file format and why I wanted this camera, just search on raw vs jpeg.I'm not a pro but I did want to have the flexibility that a raw file offered. I also wanted a pocket long zoom camera. I have several large DSLR cameras and all of them will shoot in raw but I no longer wanted to carry the heavy large cameras with me when I traveled especially since the Samsung had just as much zoom as my big zoom lens and took better pictures. The drawback with the Samsung is that it will not shoot in raw and it has a slow shot to shot time. Thus, my purchase of the Fuji.One of my requirements of a camera is the ability to connect via microUSB. I have standardized all of my electronics to connect via a microUSB cable. My phone, Bluetooth headsets, GPS, external batteries, speakers, etc. all connect and charge with a microUSB cable. The Samsung is not supplied with an external battery charger, you just plug up the USB and the battery charges in the camera. Although some prefer an external battery charger this worked perfectly for me since a battery charger was one less piece of gear that had to go in my already overcrowded and heavy notebook bag.When looking at the online literature for the Fuji I could not tell if it had a microUSB connector or not. I even downloaded the manual and all it said was USB cable. You could not tell from the pictures what type of USB connector the camera used. So I bought it hoping for the best.When the Fuji arrived the first thing that I checked was the USB connector. It is NOT a microUSB connector. It is not even a miniUSB connector. It appears to be some sort of proprietary connector that I've never seen before. I was about to simply box the Fuji back up and send it back to Amazon then and there but I said, \"What the heck, I have the camera, I might as well see how it works and then I can send it back.\"I briefly charged the battery in the external charger and then turned the Fuji on.It takes the Samsung roughly 3 seconds to turn on ready to shoot and the Fuji under 2 seconds. That's not really a big deal but the Fuji turns on ready to shoot in about half the time of the Samsung.Time to turn on ready to shoot: Winner FujiThen I pressed the shutter button. It beeped when I pressed the shutter button. It took me a minute to figure out what was happening. The beep represented focus lock. The Fuji F900 is advertised as the world's fastest focusing camera. I was always used to every autofocus camera having to seek focus and beeping when the focus was locked. The Fuji is the fastest focusing camera that I've ever seen. The Samsung is just as fast focusing once it has zoomed in and focused in on that zoom range but the Fuji focuses much faster when first focusing on a new zoom range. The focusing almost seemed instant and I was used to cameras taking a moment for the first focus.Focus speed: Winner FujiAs I mentioned, the Fuji has no microUSB connector and it will NOT charge the battery even if the proprietary USB is connected to power. You must remove the battery and put it in the external charger to charge the battery. The Samsung gives you both options if you buy an inexpensive external battery charger.Battery charging via USB and external: Winner SamsungThe Fuji has a 6 to 92mm zoom which is the claimed equivalent of a 25 to 500mm regular zoom. The Samsung has a 4 to 86mm or an 18 to 470 regular zoom. When I compared the Samsung to my regular Tamron 18 to 270mm lens on my DSLR the true zoom range is closer to 250mm, not 470. I really could not tell any difference in the zoom ranges of either camera.Zoom range: TieThe Fuji has a maximum aperture of 3.5 and the Samsung 2.8. The Samsung has a half a stop faster lens. What this means in practical use is that the Samsung will shoot a brighter picture in low light situations.Lens speed for low light: Winner SamsungThe real plus of the Fuji is the shot to shot interval. The one drawback with the Samsung is that it takes a second or more for the camera to process between shots. This is not atypical for most pocket digital cameras as a one second shot to shot time is rather average. That's the one plus of my big Canon T4i, you can shoot as fast as you press the shutter button and even holding down the shutter in sports mode will continually rapid fire.The Fuji has a half a second shot to shot time. This means that you can take two shots per second without being in burst mode. It is significantly faster than the Samsung. This is the major difference between the Fuji and basically any other point and shoot camera. The Fuji has an amazingly fast shot to shot time. You won't miss any single shots with the Fuji whereas you might with the Samsung. This is not rapid fire shooting that is required when shooting action sports photography. Both cameras have a burst mode but frankly neither is good enough if you are doing a lot of fast action sports photography. For that I need my big DSLR but that is about the only situation that I can think of where I need it. My son does competitive swimming and I need to take the big camera if I really want to get a lot of action shots but for every other non-studio situation, the point and shot long zoom cameras rule.The Fuji allows you to select the jpg mode of Fine or Normal and Fine+raw or Normal+raw. The jpg file is around 4MB, the raw file 12 to 25MB. When shooting in the jpg+raw mode each photo is nearly 30MB total. I can shoot 7 shots at ½ second per shot before the camera slows down. After 7 shots, it takes about a second between shots as the large files transfer to the camera and the camera tries to keep up. It takes over 30 seconds for all of those shots to process before the orange process light stops blinking.If I switch to Fine jpg only which is the mode the vast majority of people will be shooting in, the camera never slows up. I shot 50 shots as fast as I could press the shutter and the Fuji never slowed down.Shot to Shot time: Winner by a large margin FujiPicture quality: Both cameras produce awesome video and photos. They both are better than the big T4i in my opinion. I like the colors better. I'm not going to rate the picture and video quality of each camera. The Fuji's file sizes are smaller. Avg maximum jpg file of the Fuji is 4MB. The maximum jpg file size of the Samsung is 8MB. Both cameras are 16MP cameras but the Samsung has a much bigger maximum picture file size. There are plenty of other reviews that will give you details on pic and video quality, I'm super satisfied with the quality of both cameras.Picture and video quality: Not JudgedWhen plugging in the camera to your computer via USB the Samsung will show up as a separate drive on your computer. The Fuji will not. With the Fuji you must click My Computer and scroll to the external device. This is more of a hassle since the camera will not show up in a file explorer program.File Management and ease of transferring pictures: Winner SamsungBoth have wi-fi but I don't use wi-fi on the cameras so I can't rate how that works.The Samsung has GPS and will tag your pictures with the location and point of interest that you are near. The Fuji does not but it does have a downloadable phone app that will connect with the camera. This will allow geotagging using your phone's GPS to communicate location data to the camera. The setup was simple and it works. When a photo is taken longitude and latitude data is embedded in the picture.The Samsung is better for two reasons: It's automatic and you don't need your phone's GPS soaking up battery and you don't need to remember to turn on the geotagging feature on your phone. The app turns off in 60 min so that you don't forget it but that also means if you are out hiking you must remember to turn it back on every 60 minutes.The Samsung also embeds POI info. This means that the Samsung will embed New York Zoo, New York City, NY U.S. whereas the Fuji will only embed Lat-Lon coordinates. You can plug in the coordinates on a computer map and show exactly where you are but the Samsung POI is a lot easier to quickly understand. The Samsung GPS database does however take up a GB of space on your SD card.Although the Fuji requires your phone app be active and near the camera to geotag, the phone does have one advantage. My phone will determine location inside of a building, the Samsung must have a clear view of the sky to determine location.GPS functionality: Winner SamsungThe Fuji is prettier. The Samsung is a traditional box shape. The Fuji has rounded corners and feels smoother in your hand and slides in your pocket easier. They are basically the same size, the Fuji just feels better in your hand. The Fuji also comes in various colors whereas the Samsung only comes in black.Style: Winner FujiThe battery door on the Samsung has a slide button that you push to pop open the door. This works extremely well and is easy to do. The Fuji's battery door is a friction slide. You almost have to break a nail to get it open. Since you can't charge via the USB cable you must open the hard to open door to change the battery. I think the Fuji door has a much higher probability of breaking and is not as durable as the Samsung.Battery door Winner: SamsungOne feature that is useful and necessary is the ability to capture hi resolution stills while you are videoing. The Samsung will capture up to six full resolution still pictures by pressing the shutter button  The Fuji has a dual setting in the movie menu for shooting stills during a video, movie priority or still image priority. If you select movie priority it will shoot up to 30 stills at 1920x1080 resolution. This is basically taking a frame from the video since the video is 1920x1080. This is the equivalent of a 2 megapixel camera and is good enough for a high quality 4x6 print. If you select still image priority it will shoot up to 16 stills at a 6MP resolution and is good enough for a high quality 16x20 print.The Samsung shoots a higher quality still during a movie but it will only shoot six whereas the Fuji shoots a lower quality but still excellent quality and you can shoot 16 pictures during a movie. This is a tradeoff.Movie still shooting: TieBoth cameras shoot Full HD movies but there is a difference. The Samsung shoots at 30 frames per second and the Fuji shoots at 60fps. Technically 60fps is better but it has a big drawback. It creates a file size twice as big. One hour of HD video on the Samsung creates a 9GB file. One hour on the Fuji creates a 16GB file. You only need 60fps and can tell the difference on very fast action. Movies are shot at 24fps and TV is 30fps. I would prefer 30fps and its excellent quality and smaller file size than the 60fps. There is no way to select 30fps on the Fuji, if you want HD, its 60fps. The video quality is excellent on both cameras.The focusing during video is not nearly as fast as with photos. The video focusing speed is about the same for both cameras.The Samsung will record a maximum video length of 20 minutes. The Fuji will record a maximum video length of 14:30.Video: Winner SamsungThe battery performance seems to be about equal on both. I did a video test with the Fuji and it recorded about 45 minutes of video before the battery went dead which is similar to the Samsung. My initial test of the Samsung produced a lot more shots per battery than later tests. It may have been the new battery lasts much longer than a battery a few months old. The Fuji is rated at 260 photos per battery. With both cameras you will need to carry extra batteries. The big drawback with the Fuji is that you can't use an external battery through USB or charge the battery in the camera. Fuji does sell an optional DC coupler but that's an AC plugin. If I was near an AC plug and had a big coupler I might as well just keep some batteries charged up and ready.I will give Fuji credit for one simple but effective innovation. There is a big orange stripe on the battery that corresponds to an orange mark in the battery compartment. This easily lets you see how to line up the battery as you insert it. Often with such batteries you have to look at the terminals or remember the orientation to correctly insert the battery. With the Fuji, it's just orange to orange. All cameras should have that. I took a gold Sharpie pen and marked the Samsung battery and the extra batteries that I bought for the Fuji. It makes battery insertion correctly the first time foolproof.Battery: Winner SamsungI bought this kit for extra batteries. http://amzn.com/B004VTF7IGThe charger and the batteries work great. The charger is actually better than the charger that comes with the camera because the prongs fold in and take up less space.Both cameras are excellent and you won't be disappointed with either.By the way, I kept the Fuji.One Week Update:After a week I did have to send the original Fuji back for a replacement. The camera kept saying \"Protected Card\" even when the SD card was not locked. It started doing this intermittently at first then constantly. I tried 3 different cards so I assumed the camera's sensing system for locked and unlocked cards was defective. Got the new camera and it is working perfectly so far.In the EXR auto mode you cannot select Large. The camera will shoot in either Large or Medium depending on the composition of the picture. I prefer to shoot all of my pictures in the largest size but that is not possible in EXR auto but it is in other modes.", "Date": "July 26, 2013"}, {"Title": "Very decent images - including low light", "Author": "L. Nicklas", "ReviewID": "RA0778LUBCH7S", "Overall": "5.0", "Content": "I was looking for a pocketable camera that took decent pictures, had decent low light performance, and had a long reach. This is the newest of the offerings that I found that met the criteria (on paper).I'm familiar with how well the smaller Fuji cameras do with their low light prowess, but that's due to a combination of the sensor and the glass they use. Since I am adding the requirement of a log reach lens, I am decreasing the quality of the optics and making it require more light during a shot (zoom lenses on cameras generally are lesser quality - unless you're talking lenses in the $1000's).I just got back from Cabo with the camera, and it did admirabley on both long shots. It has a great reach, but you need something more stable than your hands and the camera's stabilization to get good shots at 20x zoom..I shot mostly in Aperture mode, but tried the \"low light\", \"high contrast\", and \"portrait\" auto modes, and looking at the shots on a big monitor, they all came out great. Sure there is some noise in the dark scenes, but it was far less than expected, and I could easily print a 8\"x10\" without it looking like a pixelated mess. I never used the flash beyond testing it out. I'm not a fan of the images any/most flashes produce.I tried some video, and it looked good enough. I wish there also were a 1080p 30fps mode, as it only does 60fps when in 1080p mode. It would save some file space. I also wish there were no limitations on the length of video you can shoot, but inexplicably, on some of the slow motion modes, you are limited to 60 seconds maximum recording.Overall, I am a fan of the newer sensor that the F900EXR has over the model it is replacing. I would definitely recommend it to friends.", "Date": "April 16, 2013"}, {"Title": "Great compact point & shoot camera", "Author": "D. Ritchie", "ReviewID": "RV7E159BQ79KD", "Overall": "5.0", "Content": "I was looking for a new point & shoot to replace my very small Olympus FE-280 which is about 6yrs old.This camera is just a little bit larger but still a very small but powerful compact pocket camera.Check out the pics I posted here of the old trucks. One Blue the other Yellow, taken with this camera and not edited at all, straight from the camera.Just one of the many cool features.So I came across an article [...]This had me sold on the F900EXR. I downloaded the manual before the camera arrived, like all new technology, you might need to learn a little something new here.I read about battery life not lasting, havnt had any issues yet but I did buy addition batteries.The wireless transfer to our computers are great..(We use Mac & IPAD)Fast and easy.The start up and auto focus time is so fast its not funny.Lots of adjustments and cool features to customize, plus shoots in RAW!I use a Canon T2i for a lot of our trips and general photography, but I have to say, this summer I'm taking this and leaving the back pack home....UPDATE 8-18-2013:  Just got back from Mt. Dora, FL and used this camera to take hundreds of pics.We went to a car show and used the special effects settings to take some really nice shots. I posted two of a couple of old trucks.The auto focus is so fast that we were able to catch much more then using my Canon T2i, moving cars in the show came out nice and clear.I did buy 4 additional after market batteries, came in handy, if you review a lot like we do, then keeping and extra battery or two around is handy.Plus, the size of this small camera...So easy to just keep in my pocket.", "Date": "July 31, 2013"}, {"Title": "Fantastic camera", "Author": "Clinton W. Price \"GatorCat\"", "ReviewID": "RHF9Q3QQHLA9T", "Overall": "5.0", "Content": "First point & Shoot I have bought in several years.  Bought for a trip on which I don't want to carry anything in my hands.  This one fits the bill.  Shooting options are numerous and this little camera will please the most discriminating snapshot taker. The documentation has some short falls and is slightly confusing in spots and registering the camera online is an experience in itself.  If Fuji would take the time to get their web site and documentation up to par with their camera it would be wonderful.", "Date": "May 8, 2013"}, {"Title": "Additional Parts for an SLR to do what this camera can do will cost a lot more than this camera", "Author": "R. Perea", "ReviewID": "R217LHPO0FFQ6R", "Overall": "5.0", "Content": "My previous Point & Shoot was a Panasonic DMC-TZ3 which preformed reliably in well lit settings and extremely well if care was taken for the shot. The F900EXR takes better pictures in Automatic than my previous camera with preset manual parameters. The EXR-Automatic mode switches between 3 priorities (Resolution, Noise, Dynamic Range) and chooses the one most ideal for the situation. It works, and is great for those spur of the moment shots.Battery-Focusing (especially tracking mode) consumes Battery Life-Flash consumes Battery Life-Leaving the battery in the camera even when its off slowly consumes battery life.-extra batteries 15$(Be aware of the above and battery life is manageable)For a Point and Shoot, it performs amazingly well low light settings.Images are surprisingly crisp at maximum resolution.Very large depth of field (I prefer because removing detail is easier than recreating it)This camera like some other Fujis can synchronize flash with its maximum shutter speed. (Time Stopper)Multiple Exposure Mode- make ghosts anywhere without relying on reflections or a timed double exposureThe lens does occasionally retracts slowly.", "Date": "September 2, 2013"}, {"Title": "Camera broke a few days after use", "Author": "Roger L. White Jr.", "ReviewID": "RGY2ZH580YJS6", "Overall": "3.0", "Content": "I really liked this camera but I had to send it back to Amazon after a few day of use. When using the zoom I got constant \"lens control error\" messages which shut down the camera. Amazon sent the camera in a small box not much larger than the camera box with only two air bags on each side. There was no protection on the top or bottom of the camera so it could have been damaged in route. Electronics should not be sent this way.Pros: amazing start up and focus speed. Beautiful night shots without a flash. Good solid camera in the hand.Cons: Sunny day photo color look cool even after adjusting the white balance. Photo contrast was too sharpe even after adjusting the dynamic range. The battery door is very difficult to open. I bought the camera because of its large sensor size but in a side by side photo comparison with the Panasonic zs30, it had only slightly more detail and far less natural color.", "Date": "August 28, 2013"}, {"Title": "Excellent Point & Shoot Long Zoom", "Author": "Amazon Customer", "ReviewID": "R19J5G3D0BMVRS", "Overall": "4.0", "Content": "I am not a professional ... just a mom shooting everyday pics of my kids. I like to get snapshots at family & special events. I have no interest in post processing photos except to maybe use the auto adjust in Windows Photo Gallery or on the print kiosk at Walmart or Walgreen's or wherever I'm printing. And there are times when I do want to crop a good amount. I have been using the camera on my smartphones for the past 2 years, and yes I recognize they are much better than they used to be. I have printed many photos from my smartphones, but they're still missing Xenon flash & optical zoom. The majority are also missing optical image stabilization.For a point and shoot, I don't think this camera can be beat. I am disappointed in the amount of noise or grain in the images. This seems to be a problem with newer point & shoot cameras. I think it's possibly the high megapixels they are putting in the small sensors (16 mp on 1/2\" on the F900EXR - slightly larger than the typical 1/2.3\"). I have tried out several point & shoots over the past year & all have had this similar issue. If you are not going to crop or enlarge possibly past 8x10, this shouldn't be a problem. I have looked back at my cheap point and shoot cameras from several years ago that were 3 megapixels, and they just did not have this amount of noise. Because of this, I finally decided to go with a dslr, my first (Canon eos Rebel T3 - an entry-level, all I could afford in my budget, and that is really pushing it), and there's just no comparison in image quality. I wish I could have a dslr with all the functions of this camera. I want to be able to fully zoom into my pictures and see detail and no noise. You just can't do that with a point and shoot, at least not the ones I have tried out. A dslr is needed for that.Autofocus on the F900EXR is as fast as it says it is. EXR Auto works perfect. Always chooses the correct scene. Pictures are clear even when fully zoomed at 20x. Lightweight & easy to put in a purse. I don't think it will fit in a pocket. Nights shots are great. I never need to choose Pro Low Light or High ISO/Low Noise, b/c EXR Auto does the best. Action shots are great. I find I get the best shot when using burst/continuous setting. I have captured kids throwing a football & running with zero blur.The camera feels nice and looks good.Video is poor. If you set the zoom before starting the video, it will be ok. But if you need to zoom in & out, it takes a while for it to refocus. I would not shoot even home videos with this camera. This will not work in a setting where you might be filming a child in a play. You will not be able to move the camera to follow them or zoom in.The reason for 4 stars ... I have had 3 of these cameras in my hand ordered from Amazon. All have had a small scratch/scuff on the lens. I have gently cleaned the lens with a dry microfiber lens cloth to see if it was smudge, and it was definitely a scratch/scuff. I have viewed pictures on a laptop screen & printed 4x6's, and it does not seem to show up in images. But I'm wondering how this is happening.Comparing this to a Fuji S8200, b/c my 8 year old son bought & loves that camera. I used it to take snapshots at a family Christmas to test it. F900EXR images have slightly more noise. S8200 has 40x zoom compared to 20X on the F900EXR. Both can take clear shots fully zoomed with a steady hand. F900EXR has just slightly faster autofocus. And only slightly. The S8200 is slightly smaller than a dslr, and it's a little heavy. Video on the S8200 is great. The autofocus works great.As I stated earlier, I eventually went with a dslr b/c image quality is my top priority right now. If I was going to choose a point and shoot, it would be the F900EXR.", "Date": "January 8, 2014"}, {"Title": "This is the best travel super zoom I have used.", "Author": "Brian", "ReviewID": "R1OQOFK6T16TTU", "Overall": "5.0", "Content": "This is the best travel super zoom I have used.  This is a large(for a compact) 1/2\" EXR sensor.  For a camera that fits in a pocket(small pocket at that), the image quality is very impressive.  Once you learn how to get the best out of the EXR modes and the Low Light Pro mode, you can get some excellent images.  Even if you leave it in Auto EXR mode, you should get some great shots in most situations.PROS:Larger than normal sensor for a compactMuch better high iso performance in the EXR low light mode than most compact camerasGreat 20x zoom rangeGreat value for the $$$Wireless built into the cameraBlazing fast auto focusCons:Battery life is average(rated at 260 shots)If you shoot in raw, the supplied silkypix software is probably best to use for this sensor's raw output and it's a bit \"clunky\"I have retired my Micro 4/3rds camera and this is the camera I used most of the time now.  It's a great deal.", "Date": "November 28, 2013"}, {"Title": "good speed, not so good picture quality", "Author": "MCRC", "ReviewID": "R3VQ3V2Z5ASMRX", "Overall": "2.0", "Content": "After seeing several very good reviews online, I decided to try this camera. I really like how fast it shoots- the auto focus and processing do feel pretty quick. The Wifi is a little odd to set up, but not too bad. The wireless PC auto backup is very convenient unless you have a lot of pictures to transfer at once, in which case you should just use the USB cord (wireless transfer is much slower than USB and depletes the battery faster).Now for the bad news- in my experience, the picture quality of this camera just isn't very good using any of the auto modes, particularly in low light. I continue to be amazed at the other reviews saying how great their pictures are with this camera- either they are advanced users, or they don't know what they're talking about. I think another reviewer mentioned this as well, but your pictures tend to look good on the LCD screen, but when you transfer them to your PC, you see the problems- noise, grain, and blurriness. In fact, trying to take pictures of moving objects at all in auto mode usually results in a blurry mess more often than not. Also, be aware that it's up to you to manually pop up the flash, it's not automatic.I know this camera has all kinds of functions to deal with different shooting situations, and I'm sure with some advanced knowledge of photography and some dedication you could get some excellent pictures, but the complexity is more than an average point and shooter like me is willing to deal with. I actually ended up going with the Sony DSC-WX300/B 18.2 MP Digital Camera with 20x Optical Image Stabilized Zoom and 3-Inch LCD (Black) over the Fujifilm, and am much more happy with it.", "Date": "November 22, 2013"}, {"Title": "BEST FOR THE MONEY!", "Author": "E. A. Franklin \"eaf14131\"", "ReviewID": "R3SPL3DI8MFSZQ", "Overall": "5.0", "Content": "I traded my Fuji FinePix F100fd for this camera. The 20x zoon is twice old one and steadier. The individual settings, other than \"auto\" ar laid out better. The movie setting can be zoomed, which the old one didn't. Overall, fot about the same size, it does more better. I am just a point and click type. It will take me a while to master all the features this camera offers. Love it!", "Date": "November 9, 2013"}, {"Title": "A powerful little camera", "Author": "Ann Baldwin", "ReviewID": "R1GRFAEGI2NTUP", "Overall": "4.0", "Content": "I had tried several other small zoom cameras before this one, but none of them produced the high quality imagery that this one does.  I'm a semi-pro who mostly shoots RAW (which this camera does), but occasionally I need quick shots that don't need post-processing. The Fujifilm EXR900 delivers. The noise reduction is well handled with little smearing up to ISO 800. I can shoot highly usable raw shots at much higher ISOs. I find the handling of this camera much better than the really tiny ones. There's a nice front grip. The menu is easy to navigate, too.", "Date": "February 11, 2014"}, {"Title": "great little point and shoot", "Author": "Donna M. Hackley", "ReviewID": "R22F5ABO8XJICD", "Overall": "4.0", "Content": "lots of ways to customize your photos - full array of settingspictures are great in full light, ok in low lightsmall and lightweightwireless download does not work well", "Date": "September 26, 2013"}, {"Title": "Simply not good enough", "Author": "Dave Howard", "ReviewID": "R12JXQ9ZMD3RL2", "Overall": "3.0", "Content": "I use a camera at work and take a lot of pictures of handwriting.  Stuff that can't be scanned.  Even though this camera has a Text setting, it simply isn't as good as my little Nikon Coolpix S5200 or anywhere near as good as my older Fujifilm Finepix F30, which malfunctions intermittently.  That's why I bought this camera.  I am annoyed by the flash settings that require you to go through the menu to turn on the red-eye function.  While you can turn the flash itself on and off manually with the pop-up button, you must pick either red-eye all the time or red-eye none of the time and can use the function buttons only to change between forced flash or auto flash.  I find the automatic settings and the EXR settings to be shifted toward yellow a lot, even under fluorescent light.  I've tried to manually white-balance, but then everything is deep blue.  Stuff shot in sunlight looks good, but . . .I enjoyed the fast boot and the fast memory very much, but not enough to keep this camera.", "Date": "January 30, 2014"}, {"Title": "Somewhat complicated, but great camera", "Author": "John", "ReviewID": "R19U9EEMAFQW3O", "Overall": "5.0", "Content": "I have not had the camera long, so have not really put it through all its paces.  This is more camera than  a person who wants only a no fuss point and shoot needs, though it serves that function very well. It is small and easily carried in a pocket. Picture quality is good.  One strength is the many choices available. One weakness is the learning curve that is needed to learn all the options and then to remember them when  taking a quick shot.  Having RAW available is nice, The Raw/Jpeg option takes time to store and a lof of disk space. All in all a great camera for a person who wants a lot of features not usually found on a small carry around camera. I have not used the video", "Date": "January 21, 2014"}, {"Title": "I can\"t read Japanese", "Author": "Paul McKinley", "ReviewID": "R24BG4X5MCDLW8", "Overall": "1.0", "Content": "Camera was compact, cute, and priced right.  Only one problem: owners manual and camera menu were in Japanese rendering camera virtually useless to me---English speaker.", "Date": "January 12, 2014"}, {"Title": "Fujifilm Finepix F900EXR is Excellent", "Author": "Roco", "ReviewID": "R4OEM2AZPEMZ3", "Overall": "5.0", "Content": "This is a nice small camera that fit in your pocket. With the Auto EXR mode it take Great pictures that are really sharp, this will shot in the RAW that is very good picture qualities. If you go on YouTube  and search for Fuji guys f900EXR these guys are good. They sold me.", "Date": "January 10, 2014"}, {"Title": "Great camera for the price.", "Author": "AOGoedde", "ReviewID": "R2D8362CAQJ6TL", "Overall": "4.0", "Content": "The picture quality is excellent, and the zoom is amazing.  I works well in low lighting, but it could have been perfect if it had a viewfinder and geo labeling capability.  The LCD screen, as is the case with all the other cameras I had, is difficult to see in sunlight.", "Date": "December 3, 2013"}, {"Title": "Excellent camera", "Author": "Zabian", "ReviewID": "R1P4AANIO2MT2R", "Overall": "5.0", "Content": "VERY well built camera that takes crystal clear images.Pros - I have been messing with the over 20+ images styles that this camera has built in and so far all of them have taken wonderful images that rival my $2k Canon DSLR.The camera is up and ready to take a picture from off in under 2 seconds, flash is very fast to charge and easily accessible.Cons - Wireless transfer to your phone works but at times if you are not fast at clicking connect it will time out on one or the other.Flash is located on the top left corner of the camera and is a pop-up. It is where you would \"normally\" hold the camera but with a little adjustment it isn't that awkward to hold.Overall I am very satisfied with the camera, I have had it less than a week but already have taken over 500 images testing the various preset settings and manual image taking. Low light mode does wonders in taking higher quality images than the typical camera in less than ideal situations.", "Date": "November 21, 2013"}, {"Title": "I can't believe how fast this is.", "Author": "newgolfr \"virginian\"", "ReviewID": "R10D808ZASOKZH", "Overall": "5.0", "Content": "This camera was recommended by a local camera shop and I got it on Amazon for $150 less than their price by buying it from the warehouse.  The box was damaged but everything was included and I have not noticed anything wrong with the camera.  The pictures are great without using flash, but the flash does tend to overexpose the faces.  It turns on and off in a blink of the eye and the shutter speed is like lightening.  It is a nice size for my large, arthritic hands and I can see the LED.  I looked around for a long time for the perfect case and ended up with a case logic for video camera that was a little bigger than the camera, but I can put extra battery, download cord and some money in the side pocket.  I did not notice the battery life being short, but I haven't used it alot for videos.", "Date": "September 15, 2013"}, {"Title": "Very Impressive little camera", "Author": "Tad Dreiling", "ReviewID": "R3P5JRICOTYOZQ", "Overall": "5.0", "Content": "I purchased this camera to have something a bit easier to travel for long hikes or cave tours than my Bulky DSLR.  The camera has many of the same features I am used to in my DSLR, and the multiple frames per second shooting is awesome.Picture quality is great and even with shaking hands in high wind the shots come out clear as a bell with no blur.  Since the camera does have a lot of features you will need to take the time to familiarize yourself with the interface so you can configure as needed for certain types of lighting.Camera was delivered promptly and with no signs of damage to the packaging.No buyer remorse here, extremely please with the product and service received.", "Date": "June 5, 2014"}, {"Title": "I like this camera but...", "Author": "John Hansen \"John\"", "ReviewID": "R1P356KGQZARKI", "Overall": "2.0", "Content": "This is a really nice camera: fits in a pocket easily so can take anywhere; starts up really fast; focuses fast too, picture quality is good. Jpeg quality is good, in fact, it seems better than RAW oddly enough. That said, I noticed a large dark blob in one area when shooting light subjects that changes size slightly depending on the zoom setting. I sent it to a Fuji repair facility and they in turn sent it to the Fuji factory (to replace the lens assembly). Now they say it may be a month or two before I get it back. Not acceptable but no other options. Beware: quality control on this camera may be spotty. Will update upon its return.", "Date": "May 28, 2014"}, {"Title": "Disappointed", "Author": "seattlejr", "ReviewID": "R38BGW9EVW3H98", "Overall": "2.0", "Content": "I bought the Fuji Finepix f900exr camera because I currently own a Fuji Finepix f200exr and need to replace it. Like most folks every few years I'm on the hunt for an acceptable balance between price, performance and size. Pocket size being most important (I own a DSLR). The f900exr model, on paper seemed to fit the bill and I liked my f200exr. I used it for two days in a variety of environments and settings (automatic and manual, jpg and raw) and took about 500 images. I was disappointed with the image quality. No matter what settings I used I struggled to get images as sharp and clear as I was expecting or even images that were equivalent to my f200exr. The f900exr images appear just okay unless you view them at 100% (actual pixels) or greater in photo editing applications then they fuzz up pretty badly. Pixel peeping into the images it almost looks like a watercolor filter is being applied. Shouldn't have to work that hard with a P&S.; In fact my iPhone images were better. Perhaps I got a lemon. What I really liked about the F900exr was it's SUPER fast powering on. The wifi transfer to my iPad was pretty clever (note RAW doesn't transfer) and setup wasn't terribly difficult if you are familiar with getting devices onto wifi networks. The 20x optical zoom, is, well 20x zoom on a point and shoot. If I kept the device I probably wouldn't use the extreme end of the zoom. It has a very solid feel in the hand. I liked the new angle of the dial (compared to the f200exr). I appreciate Fuji has kept them menus the same between models. I also liked the pop up flash (which I didn't think I'd like). The battery/SD card door is harder to open than the f200exr but that's a minor thing. If you never crop or zoom your images after taking them you might be pleased with this camera. I'm returning it.Update 6/3/2014: I few weeks ago I ended up going $150 over my \"allowance\" for a p&s; camera and bought the Canon S120. I'm extremely pleased with the Canon.", "Date": "May 9, 2014"}, {"Title": "Exactly what we need!", "Author": "Melissa Morgan-Oakes", "ReviewID": "R3UY8JUHQPAZJD", "Overall": "4.0", "Content": "With grandbabies and grand kids, my DSLR was feeling cumbersome. No one wants to lug a big camera backpack, water bottles, folding chairs, blankets, and a picnic along to those pee wee football games, or around the maternity unit of the local hospital.This camera gives me the flexibility to have some control over my shots combined with the portability appropriate for everyday situations. Only drawback - there is no viewfinder, only a screen. It's a commodious screen to be sure, but in full sun it's pretty useless. Knocks off a star, even.", "Date": "April 25, 2014"}, {"Title": "Great camera", "Author": "A W", "ReviewID": "R2LQH6DHTDNYC6", "Overall": "5.0", "Content": "Was considering other compact size cameras and after having looked at reviews on CNET.com I chose this one based on its features and the great price through Amazon. Have had it for a day and I have been snapping all kinds of pictures. Very fast capture and the screen is super clear! Definitely a must buy and something great for travels.", "Date": "April 11, 2014"}, {"Title": "Simple and Great DSLR Replacement", "Author": "Beth Miller \"ABC, Consultant\"", "ReviewID": "R23TIBLVDHCHJO", "Overall": "5.0", "Content": "We travel and when our DSL broke beyond feasible repair, we selected this Fuji, one of several \"bridge\" digital cameras. With most of the functionality and flexibility of a DSL, this small, easy to operate camera is taking amazing photos of birds in our lakeside backyard, our grandkids, and our travels.", "Date": "April 1, 2014"}, {"Title": "Great picture quality, but focus was sometimes a chore.", "Author": "Kyle \"cylem\"", "ReviewID": "R1CI7K7LW5ZAZW", "Overall": "4.0", "Content": "F900EXR is great, probably one of the quickest cameras out there, as far as operation, shot to shot time is concerned. It starts up in around a second, and focuses really quickly and accurately most of the time. It features a great up to 16 pictures/sec burst mode which can be changed to slower speeds. Video options are plenty, vga, 720p, 1080p, 120/240fps in vga and hvga.The picture quality is I really think a step above other similar cameras i think. The detail in the shots in low light especially just looks better, and more dynamic. However a small part of the time I came off with an out of focus picture. The F900 uses Phase Detection AF which is kind of a confusing method that the camera takes whats in front of it and sensors detect how far away they are, rather than most cameras that use Contrast detection which it just detects the contrast of what's in front of it and figures out with that which thing you are trying to focus on. Phase is more advanced and in theory it seems like it's great, but my experience with it on this and on a DSLR is that I find it just sometimes doesn't work right. Now and then the subject is right in front of me in plain view and the camera just doesn't get it. Same goes for video but worse, whenever you zoom in during a video the camera trys to refocus (which is does really slowly) and sometimes it will just stay out of focus and just stay that way. This causes me to have to change my zoom around until it realizes what focus it should be at. I had a decent amount of issue with this sadly, unless I got one focus beforehand and stayed at it.Built quality I would give like 9/10, It feels really solid, and has good weight, but the lens area shifts around a lot which worries me a little. As for the Design, i really love it, I don't know why no one else makes it so the dial faces the person instead of facing straight up, this is a great thing on their part.  The rest of the controls are great to, you can customize them and it has probably more buttons than the average one in its class.After everything if you can work with the focusing issue (which isn't that huge in photo's, more in videos) this cmera is a great choice for a high quality, high zoom, fast camera. It's a great inbetween enthusiast camera, that is decently advanced but pretty user friendly and has all the auto mode you want if that's all you need.", "Date": "April 1, 2014"}, {"Title": "Super camera for travel", "Author": "K Bryce", "ReviewID": "R3539XL8EO87FI", "Overall": "5.0", "Content": "Love it totally. Almost fits the bill for all pics for me. Fits perfectly in the purse. Fuji knows how to make a great camera.", "Date": "March 31, 2014"}, {"Title": "Pretty Good", "Author": "Marcus Censor", "ReviewID": "R5MVJYGLV7XAM", "Overall": "4.0", "Content": "Make no mistake. This camera takes great pictures, even if in the hand it feels like a cheap point and shoot.I remember reading a review that said the body was made of metal. That is pure blarney. It is plastic, and it is made in China.I own the Fujifilm x20 and x100s, both of which in the hand feel like heirlooms. The irony is that they will be obsolete in two years. Their glass and metal will persevere in the landfill, which of course is sad but true. The great thing about film (and I've never shot film, I'm a young man) is that the cameras could theoretically be used for years. The cameras really were heirlooms.Not so with today's cameras, not so.Much like the Ricoh GR, which I also own, this camera has great technology in a cheap casing. It takes great pictures. In a year or so, you will want something else.", "Date": "March 19, 2014"}, {"Title": "Great Little Camera", "Author": "tchinds", "ReviewID": "R1T8OOB9UD8XI0", "Overall": "4.0", "Content": "So far this camera has been solid. I really like all the features it offers. The reason I didn't give it 5 stars is a couple of times I have had issues with it not focusing and the WiFi upload feature is a pain. I still haven't been able to transfer pictures from the camera to my computer.", "Date": "March 11, 2014"}, {"Title": "Great Camera BUT", "Author": "Samuel Cooper", "ReviewID": "RYNT0M7J8055O", "Overall": "4.0", "Content": "The product is great, but only being able to access instructions online is a bit daunting. Espeacially when you have a question and are no where near a internet. An instruction booklet should be offered!!!", "Date": "March 8, 2014"}, {"Title": "Nice bang for buck, with minor concessions", "Author": "Michael McCafferty", "ReviewID": "R11QYT4PSHZ2UF", "Overall": "4.0", "Content": "Good product, I wish it came with an English manual but the quick solution was to just download the manual online.It could also be a little more user friendly with a touch screen", "Date": "February 25, 2014"}, {"Title": "Lots (and lots, and lots!) of features", "Author": "SJK306", "ReviewID": "R1MU7AFEIW1V0H", "Overall": "4.0", "Content": "Bought this camera to replace an old point and shoot Kodak that died on me.  Have had several Fuji cameras over the years, including my current S5200, so I'm familiar with the brand and their features.  The F900EXR is loaded with features, probably more than anybody would want in a simple point and shoot camera.  It's not something you can just take out of the box and start shooting, you have to get acquainted with some of the shooting modes before you even press the shutter.  I still haven't figured out the flash settings.  Anyway, it takes very good pictures, is compact, and again, loaded with features.  Just didn't plan on studying the manual for an hour or two to figure out the basic functions.", "Date": "February 22, 2014"}, {"Title": "Good camera and easy to use", "Author": "Dale C. Poulnot", "ReviewID": "RCQQPMPBF3W8G", "Overall": "4.0", "Content": "I chose this camera to do real estate property shots, and it does that well. Good exposure and the flash is adequate. Battery sure does run down quickly though. Glad I bought the backup battery package.", "Date": "February 20, 2014"}, {"Title": "Great camera, weak battery", "Author": "Robert L Levine", "ReviewID": "R1B6XXMPN0OZ9T", "Overall": "4.0", "Content": "Excellent camera.  Superb pictures- sharp and brilliant/accurate color rendition, intuitive to use.  Very good low-light pictures without the flash.  Only negatives, weak flash and the battery is not holding a charge.", "Date": "February 17, 2014"}, {"Title": "Not so good", "Author": "George", "ReviewID": "R1MXUWV6XO946D", "Overall": "3.0", "Content": "I am somewhat disappointed in the quality. The images are not always sharp. The video constantly changes focus, no matter if the object is moving or stationary. The only good pictures I got were from really close range, like 3-5 feet. I was trying to make a portrait and it came out as DSLR quality, which was very surprising, considering that it was dark and I used flash.The shots outside in a sunny weather are good, but inside if you're shooting a party - just satisfactory. You need to be really close to the object to make a good picture.", "Date": "February 15, 2014"}, {"Title": "Excellent camera", "Author": "Edward W Gordon", "ReviewID": "R7IQ77Z38FL4H", "Overall": "5.0", "Content": "We find FinePix cameras to have exceptional value and all the advanced features you would expect to be found in more costly cameras. Speed and resolution are fantastic.", "Date": "February 13, 2014"}, {"Title": "Pleasantly surprised", "Author": "Konacoffee", "ReviewID": "R37NB64TGEG7SC", "Overall": "5.0", "Content": "I am quite surprised at the image quality of this camera.  I am so use to either Canon or Nikon I was hesitant to purchase this, but so glad I did.  I have several dslr cameras, all too big to carry around for everyday use.  Although this does not have a long zoom lens, it is good enough.  I have cropped images and found incredible detail.I rarely give an item 5 Stars, but for the money this is an excellent point and shoot camera.  However, if you wish to get more creative, it allows you to do that as well and it's not that complicated!  I also like how easy it is to hold in my hands.  The first time I picked it up I knew it would work for me.Fast start up, detailed images, excellent color, lightweight, easy to hold, creative if wanted, and good software.  The only negative is it is a little difficult to find the Format icon.One more positive, sharing via wi-fi is fairly easy.  Takes a little bit of set up, but once my iPhone and the camera find each other it is super simple with a very fast transfer.", "Date": "February 10, 2014"}, {"Title": "Excellent Camera!", "Author": "algauthor", "ReviewID": "RVEJ0IOWQTI9A", "Overall": "5.0", "Content": "This is a great point-and-shoot camera for taking almost instantaneous pictures.  The colors are great, and the pictures we take are sometimes better than what we can see in real life.", "Date": "January 26, 2014"}, {"Title": "camera review", "Author": "Billy Goss", "ReviewID": "R16YWNNQ15BS5F", "Overall": "5.0", "Content": "Bought the camera for my wife and she loves the zoom and how nice the pictures look. The camera also does well when the subject is moving.", "Date": "January 13, 2014"}, {"Title": "Great Camera", "Author": "Joseph and Linda C", "ReviewID": "R2A8Q84AOLJBBE", "Overall": "5.0", "Content": "We haven't purchased a point and shoot camera in a number of years.  After reading the reviews we selected the Fuji F900EXR.  Must say it meets all out expectations.  Great pictures, zoom is excellent, even the wireless transfer worked.  We were skeptical that the wireless would work after reading all the negative reviews, but we had no problem setting it up on our smart phones and PC. Now we are not camera geeks and don't expect this point and shoot to take as good of pictures as our SLR, but for the price this is a great pocket camera.", "Date": "January 9, 2014"}, {"Title": "Nice camera", "Author": "Wade", "ReviewID": "R11UO8LDIL85X4", "Overall": "4.0", "Content": "Nice camera, takes great pictures and is pretty easy to use with a little time spent exploring the different options. It would have been 5 stars if the bluetooth worked, mine didn't. It's not a huge big deal though. It's not overtasking to plug the thing in to transfer photos.Overall, happy with my purchase.", "Date": "January 7, 2014"}, {"Title": "almost fully auto most important", "Author": "GeorgeJ", "ReviewID": "RQOVR46XMSW28", "Overall": "5.0", "Content": "Christmas gift for the wife who wanted a really good point and shoot, and video.  directions easy to read.  she likes it a lot and that's about all that matters.  although I'm not the primary user of the product, it appears to have about 100 more features than she needed, but purchased based on reviews here and at Consumer Reports for quality of pix and video.", "Date": "January 7, 2014"}, {"Title": "great little point and shoot", "Author": "sfo 2  fco", "ReviewID": "RSG42JDR6F898", "Overall": "5.0", "Content": "No complaints as this camera has exceeded our expectations. Great lens and optical zoom. Great automatic modes. More ability than most point and shoots for manual adjustments. Please remember that no cameras of this type focus fast enough for shooting multiple, rapid action sport shots. But the focus on this camera is faster than most of its type and better than I expected. GPS and WiFi work perfectly.", "Date": "January 4, 2014"}, {"Title": "lots of features, still learning", "Author": "S Jackson", "ReviewID": "R1NN8A3KQ9R0M8", "Overall": "4.0", "Content": "I like it a lot so far.  Still learning several of the features and determining which will be my \"go to ones\" on runs.  It focuses fairly quickly, which is helpful when I'm running.  The panoramic function is very nice also.", "Date": "January 3, 2014"}, {"Title": "AWESOME concert pix!", "Author": "lisa", "ReviewID": "R35NJHYHCG2G8B", "Overall": "5.0", "Content": "Pix taken in a low-light concert turned out FANTASTIC, especially at tight zoom!VERY impressed, for the money I spent!", "Date": "December 19, 2013"}, {"Title": "GREAT CAMERA", "Author": "PJDSR", "ReviewID": "R3SG5ZCTWEITWW", "Overall": "5.0", "Content": "This camera is awesome! So easy to use, fits in your pocket, takes awesome photos! Purchase extra chargers and batteries, especially if you'll use it in cold weather; cold eats batteries for snacks.", "Date": "December 6, 2013"}, {"Title": "Much improved over previous camera...", "Author": "Ronald G. Sherwin", "ReviewID": "RW4ZW74J2JYKT", "Overall": "5.0", "Content": "This replaced an earlier travel-sized Fujifilm FinePix.  With this camera, I probably skipped a couple of iterations of improvements.The new camera has many improvements, which I like ...in particular, special shooting modes, depending on lighting and desired effect.  Plus the images contain more data, and withstand enlarging better than the previous camera's images.", "Date": "August 13, 2013"}, {"Title": "Crystal Clear", "Author": "Slayer Doc Woo", "ReviewID": "RF675994PAYHX", "Overall": "5.0", "Content": "I bought this camera and it has a lot of extra stuff on it.  I dont even have a clue how to properly use it all, so I stick with the auto feature.  The pictures this camera takes are eye watering.  Crisp shots and does well in low light also.  I couldn't be more happy.  The wireless upload works great too.", "Date": "August 15, 2013"}, {"Title": "Fujifilm finepix F900 exr cmos camera indigo blue", "Author": "R. Hopkins", "ReviewID": "R3CW6UIUE7U519", "Overall": "4.0", "Content": "I had many hours into my search for another camera. This is my first fuji camera. I want everyone to know that this camera is small enough to really be a shirt pocket camera. I've only had it for a week and as such still learning about it. I had downloaded the manual from fuji before the camera was even shipped. It is very lightweight. I'm still looking for a camera with more features.  I recomend this camera.  Thanks,  Randy H.", "Date": "July 5, 2013"}, {"Title": "No English manual", "Author": "Paul Murphy", "ReviewID": "R3TXSPXQD1XQCN", "Overall": "3.0", "Content": "Camera is nice, but hard to figure out all options as the only manual supplied is in Japanese.  This would have been helpful to know this before ordering.", "Date": "January 22, 2014"}, {"Title": "Returned...not so great", "Author": "Fire1520", "ReviewID": "R298KEHODC6P97", "Overall": "1.0", "Content": "Auto Focusing not so great and EXR mode even worst.  Took nearly 100 pictures of my 1 year old and over 90% turned out blurry.", "Date": "January 16, 2014"}, {"Title": "So far so good!", "Author": "alexandria", "ReviewID": "R2Z4STAE28T244", "Overall": "4.0", "Content": "I was not going to purchase another fuji...but I did. It has a terrific zoom and the quality is very good. I have only used it about 6 times.", "Date": "June 8, 2013"}, {"Title": "Good if outdoors in Perfect light.  Indoors Terrible.", "Author": "Ralph D. Clements \"RDc\"", "ReviewID": "R1DYLQMW3ZMHYJ", "Overall": "1.0", "Content": "I bought this camera for its large optical zoom and it high (16MP) resolution.  I am very disappointed.  It does well in bright sunlight but any pictures with reduced light it is horrible.  The pictures turn out grainy and blurry, if they turn out at all.  Indoors is generally a disaster.  We took some family pictures indoors in a well lit room.  Pictures were taken with and without flash.  NONE turned out.  They looked ok on the preview screen, but once viewed on a computer the images were blurred and grainy.  I have a seven year old Canon that takes much better pictures.The camera is useless for taking any indoor video, even with good lighting.  Throughout any video clip the camera searches for focus so only glimpses of any video are legible.  Overall, this camera is a poor value.  I plan to give it away and save up my money for another try at a camera.  I will probably go back to Canon or Sony which I have had MUCH better experiences with.", "Date": "November 28, 2013"}, {"Title": "Still Not Apple (Aperture) Compatible", "Author": "Supershopper", "ReviewID": "R2CIUIAO238BSO", "Overall": "4.0", "Content": "Otherwise a very fine camera, but the most important reason I decided to return this camera was based on the inability to view its images in Apple's Aperture. These file requirements have for nearly one year (see similar reviews) still not come available in the always very frequent updates from Apple. Therefore, I believe this testifies to a rather poor cooperation between Fuji and Apple, with many problems from that to be expected in the future. Apple's Aperture is very frequently updated with very many new cameras that are much younger then this one, so I am not hopeful we will see a positive change soon. Therefore, as an Apple user I stay away from this typo of Fuji camera for now, that despite the raving reviews of this camera and many others of theirs - what a lame shame.", "Date": "December 23, 2013"}, {"Title": "False Advertising", "Author": "Mike Eversole", "ReviewID": "R2OX4V940CKEEA", "Overall": "3.0", "Content": "why in the hell cant americans make anything anymore...... got this for my wife and when we received it and opened it she was loving it until she pulled out the owners manual and woopeeeeeeeee  , It is written in chicken s*** china language......and the dam camera is made in china and it was supposed to be made in japan....  I call that false advertising where I come from.....And when she calls to get a return mailing label It cant be downloaded.....So there you have it....  300 American hard earned dollars for a cheap piece of china junk...... And we wonder why our country has gone to hell......  It is Sad", "Date": "December 6, 2013"}], "ProductInfo": {"Price": "$379.95", "Features": "16MP EXR CMOS 1/2\" Sensor with Phase Detection\nFujinon 20x Optical Zoom (25-500mm)\n3.0\" LCD (920k)\nFull HD 60fps\nContinuous Shooting 11fps", "Name": "Fujifilm FinePix F900EXR 16MP Digital Camera with 3-Inch LCD (Black)", "ImgURL": "http://ecx.images-amazon.com/images/I/51xpQukq%2BOL._SY300_.jpg", "ProductID": "B00B46XSDK"}}