{"Reviews": [{"Title": "Fuji Camera", "Author": "Jeffryer", "ReviewID": "R2BX57B44ZQ716", "Overall": "5.0", "Content": "This is a great little camera for taking family pics, wild life, etc.  We are not avid photographers but needed something that could fit in a pocket, purse, etc.  Select the appropriate lens setting, i.e., out door scene, indoor, night, etc and you'll get the best focus and color settings.  For us,  this has all what we need in a camera as well as the price.", "Date": "October 2, 2013"}, {"Title": "Great camera at a great price.", "Author": "akor", "ReviewID": "R3D5ZUZOSFKPXL", "Overall": "5.0", "Content": "Great starting camera with rich and vibrant colors that are typical for Fujis. The LCD screen is huge and controls take just a few minutes to master.", "Date": "February 1, 2014"}, {"Title": "GREAT GIFT", "Author": "JB LeBout \"ding dong lady\"", "ReviewID": "R1CZCPI3NXGKLX", "Overall": "4.0", "Content": "I got this last year for my sister who needed something digital but simple to use.  THIS IS IT!!  It took several months to convince her to use it.  She was used to point and shoot cameras from the drug store.Now she has the Fujji at all our Red Hat Society events -- lots of pix to take then.  The shots are quick and sharp  ...no shakiness detected.  Even the zoom lens works well.", "Date": "April 27, 2014"}, {"Title": "Great Camera", "Author": "Hall \"2528\"", "ReviewID": "R1W3YU729LMUUV", "Overall": "5.0", "Content": "I bought this as a gift for my daughter and she loves it.  Especially the color.  FUJI is a quality product.", "Date": "January 22, 2014"}, {"Title": "Booooo!", "Author": "Marty Parker", "ReviewID": "R13EZ215MR07MS", "Overall": "1.0", "Content": "This thing is a hunk of junk. Here are three reasons why:1) Within the first year the zoom lever broke.2) The lens sometimes sticks in the \"macro\" position.3) Worst of all, when I turn the camera off and then go to use it the next day, the battery is completely drained.This piece of excrement is flawed beyond redemption. When I get a new camera I'm going to chuck the Fuji as far as I can throw it, and watch with glee when it smashes to the ground. Hate, hate, hate this camera.Signed,Hater", "Date": "October 2, 2013"}, {"Title": "its nice", "Author": "Milton", "ReviewID": "R1YXZGK9OMPME0", "Overall": "4.0", "Content": "Its a camera, it does what is supposed. Have not use yet. I will review later on quality of  pictures", "Date": "February 27, 2014"}, {"Title": "digital camera", "Author": "Tracye James", "ReviewID": "RDLXJHLN8NX9Y", "Overall": "3.0", "Content": "I hope it last more than 30 days.  it is a calulated risk to purchase it.  I paid a lot of money for it", "Date": "February 15, 2014"}], "ProductInfo": {"Price": "$99.95", "Features": "3.0-inch TFT color LCD monitor\n16 million effective pixels 1/2.3-inch CCD image sensor with primary color filter\nFujinon 5x optical zoom lens with approx. 7.2x digital zoom\nFocal Length: f/4.6mm-23mm; Full Aperture: f/3.5 (Wide), f/6.3 / f/15 (Telephoto)\nHD movie (1280 x 720p/30fps)", "Name": "Fujifilm FinePix JX680 16 MP Digital Camera with 3-Inch LCD (Black)", "ImgURL": "http://ecx.images-amazon.com/images/I/41fAF1wnSfL._SY300_.jpg", "ProductID": "B00B5MUJ58"}}