{"Reviews": [{"Title": "Why Doesn't Everybody Buy This?", "Author": "Robert J. Paulsen", "ReviewID": "R3K7QJPMM36ZGJ", "Overall": "5.0", "Content": "I've been looking for a camera that can fit in my pocket and will take quick pictures. My Canon 5D Mark II is my 'big' camera and is awesome, but I wanted something a bit more portable. First I tried the Canon G12 and then the Lumix GF3 (with a Micro 4/3 lens). Both of those cameras take good quality photos but suffer severely from slow focusing (they both have their share of other issues, but that is not important in comparison to the F850EXR). Also, both of those cameras are BIG. Sure not as big as a DSLR, but after owning the G12 & GF3 I realized that there are really only two sizes of cameras: those that fit in your pocket, and those that don't; G12, GF3 AND 5DMII don't fit in my pocket and I needed something that would.So what is quality? I'm picky on \"quality\" (I only have L lenses with B+W filters for my for my 5DMII) and I understand the trend to create high end pro-consumer cameras as a sidekick to a DSLR (Micro 4/3 and Co.). But a \"good photo\" doesn't just mean having glass with sharp edges at 28mm with no vignetting with no noise at ISO 1600. All those things are great but if all my photos are of my son running off-frame, what's the point? A 1-second focus plus 3 seconds between photos just doesn't cut it. And if I need to carry a camera around my neck, is that really 'portable' ?Sure, the G12 and Lumix have higher image quality than the F850EXR but they don't let me take the photo I want. The F850EXR takes GOOD photos, just not AS good -- but at least I get the photo I want. And it fits in my pocket.It is kind of sad to not see many reviews on Amazon or, well, the Internet in general. The F850EXR is exactly what I wanted and with some thought, it may be what you want too.Many of the selling points are listed under features (9FPS, Zoom, etc) so here are some things that don't show up on a specs page:The camera itself is of decent build quality and doesn't have an icky touch-screen. There is a dedicated function button you can program to do what you want and another function button that once pushed lets all buttons be a custom function (nice!). The tilted selection wheel on top is a nice touch, so is the dedicated video button. There are dedicated Manual, Aperture and Shutter priority modes. The delete function doesn't require 3 clicks to delete the 2nd, 3rd or 4th photo. You can even push and hold one of the buttons to turn silent mode on and off (I love buttons!).Some of the gimmicky-but-nice features include the multiple frame option. You hold down the shutter and when you release it, the current frame, the previous 3-frames plus the next 3-frames are saved. This does a surprising good job of catching what would have otherwise been a one-off photo. Really good when you feed you kid a pickle for the first time and you want to make sure you just the right \"yuck\" frame. Playback of these multi-frame photos is well done too. During playback you only scroll past the frame you took, the other 6 frames just play in the corner.There is a neat thing where it will take 3 photos (@9FPS) to give a blurred background of [whatever]. So far I only took a picture of stapler on my desk, but the feature worked really well (for what it is). I doubt I'll use it in real life.Like most consumer cameras, there is a fist-full of scene modes (Beach, snow, etc) which I guess can be useful. I'm still trying to decide if the EXR mode (which automatically detects the best mode for your photo) is any better than just selecting a scene mode. I haven't done many 'low light' photos yet, but apparently it will do some tricks like lower your photo resolution to increase the quality of your photo.Things I don't like? The battery life -- OMG. Let's just say that it's terrible. Both the G12 and GF3 had better batter life, but maybe that's because I stopped using them (OUCH!).The last Fujifilm-anything I bought was film (kids, ask your parents). Using the F850EXR I feel that Fujifilm was built by people that actually understand cameras (unlike that crud that had the Polaroid name slapped on it).I did a bunch of research and played with a bunch of cameras at Best Buy, and the F850EXR came out on top. Which surprised me because I was expecting to go with a Canon or Nikon.I'm known as a techy-guy in my small pond and people ask me for suggestions on an assortment of things, including cameras. I really think the F850EXR is a great camera and would suggest it as an only camera or as a not-my-10-pound-dslr camera.I don't normally write long reviews, but I feel bad there are so few reviews on the F850EXR (not just on Amazon, but on the Internet) because I really think it's a great camera.", "Date": "June 16, 2013"}, {"Title": "LIttle camera with big features!", "Author": "Karen Ford", "ReviewID": "R26ERO46HC8PRI", "Overall": "5.0", "Content": "Except for the size, you'd never know this is a pocket style point and shoot camera.  It's got a nice 20x zoom and loads of features packed in a small size.  I've been taking pictures for about 40 years, and I've never liked the pocket style point and shoots until this one.  The picture quality is excellent, and the menu is very user friendly.  I like all the different onboard features, too, especially the \"magic\" filters, like color accent.  While other compact cameras have special filters and such, they don't have the Fuji ease of use or picture quality.  I don't mind having this camera as a backup or \"on the go\" camera, as it does as much as my larger Fujis do (currently I have the HS20 and 8200), and slips into my purse or jacket pocket and I don't even know it's there, it's so lightweight.  Love this little guy!", "Date": "May 10, 2013"}, {"Title": "Review: FujiFilm FinePix F850EXR Compact Camera", "Author": "Randy Wakeman \"Randy Wakeman\"", "ReviewID": "R2KE25LWK5G1Z3", "Overall": "5.0", "Content": "Review: FujiFilm FinePix F850EXR Compact CameraBACKGROUNDMy last in-depth visit to the Fuji compact camera line was the F660EXR, a 15x zoom model with 300 shots CIPA standard battery life. It was and is a quite satisfactory compact still camera. The F660 Fuji has the ***worst*** video capability of any recent compact I've tested. It was and is really horrid and an embarrassment considering how good the rest of the camera operates. If taking video with your digital still camera is important to you, this glaring defect alone will be more than sufficient for you to go elsewhere. I'll leave it to you to grade the importance of the video in your own terms.However, the Fuji F660EXR was and is sold as a digital still camera, not as a camcorder that can take stills. As a digital camera, it handles better than several Panasonic and Canon models, putting them to shame in terms of battery life, many still camera features, and in particular low light (\"M\" or 8M mode). When viewed and used as an \"8MP\" camera, the captured images from the Fuji are 3264 x 2448. That's more than adequate for an outstanding 8 x 10 print even with a moderate amount of cropping. It is also better than needed for very good prints up to 20 x 30, according to many. As tragic as the video attempt is on the F660EXR, it easily rates as a good choice in a long zoom digital still camera, with exemplary low light capabilities for the platform, at the time of its release. The included charger and inexpensive batteries, along with a low street price made it a very compelling compact travel zoom still camera.The F850EXR pumps up the optical zoom to 20x, adds a faster EXR processor II, speedier performance, a better 3.0-inch, approx. 920K-dot LCD, but drops the battery life to 220 - 250 still shots. The F3.5 / F5.3 lens array isn't particularly bright on the wide angle side of things, but is brighter than most at full zoom. The F850 closes to F5.3, while the Canon SX260 / SX280 cameras share a F/3.5-6.8 lens, for example.The F850EXR also adds more auto capabilities, detecting 108 shooting patterns translating into 64 scenes according to Fuji, faster .21 second autofocus, faster start-up, and peppier shot-to-shot performance. It also weighs a tiny bit more, 8.1 ounces:  it is a lot of imaging horsepower in a half pound package.FUJI VS. COMPETITIVE 20X MODELS: MAYBEIt is a crowded field, considering the Canon SX260 / SX280, Panasonic ZS-19 / ZS-20, the Nikon S9500 (22x), the Samsung WB800F (21x), the Olympus SH-50 (24x), and the Sony DSC-HX50V (a whopping 30x). Of these, the Olympus and Sony models are the heaviest and bulkiest, with the Sony at about 10 ounces and a hefty $449 retail price which is about $360 - $400 street price. The Canon SX280, Nikon, and Sony add features (GPS, Wi-Fi) that have nothing to do with a camera taking pictures, but some seem to want them, or at least the manufacturers want to sell them.The Fuji, while certainly a name brand, is sometimes marketed incomprehensibly, offered with strangely high list prices and steep discounts. One common source for the Fuji F850EXR, in black, has a $299 \"list\" price and an actual delivered price of $208.44. In white, the same camera is $186.62.Yet, if you shop a bit, you can find this (and other) Fuji cameras at astounding low discount prices. I did just that, buying my example of the F850EXR in white for $114.49 delivered. Yet, the F850EXR is a current, 2013 model, just announced at the beginning of the year. It does make it a bit more complicated to grade this model, for it is not easy to discern if it is \"really\" a $210 camera, a $180 camera, or a $115 camera. In my own case, it is a $115 dollar investment and there is no camera on the market that remotely competes with it at that price point, not even close.For whatever reason, the color choice of the F850EXR can change the price drastically. It makes little or no sense, but that's the way it is. As a practical matter, I'm going to call this a $180 camera, for you can get it right now (October, 2013) at that level or less. Of the cameras listed above, most cost about 30% or more, up to twice as much more in the case of the Sony.The 20x zoom that is relentlessly called \"remarkable\" is hardly that anymore, considering that more than a dozen pocketable cameras today offer that much range, or more, in the $250 price bracket. The spread in size and weight isn't huge, either, as the Nikon S9500 hits 7.3 ounces, this F850EXR is 8.1 oz., the Canon SX280 is 8.2 ounces. There isn't much point in debating the merits of less than one ounce in a camera, as far as I'm concerned.STILL IMAGE QUALITYMany reviews tend to say the same thing about compact cameras: \"if it only had a larger sensor or a brighter lens.\" It is a fairly wacky comment, for a larger sensor means a larger, heavier camera, and a brighter lens means a more expensive camera. If you intend on selling your images, many stock photography operations do not accept anything from small-sensor cameras at all. It takes a Micro 4/3 or SLR platform acquired image as a requisite. Alamy, for example,  normally wants JPEG files,  minimum 24MB-48MB uncompressed in Photoshop, 8 bit depth, and upsizing is allowed only if done via Genuine Fractals. Other organizations, like iStock by Getty Images, have completely different requirements.The F850EXR is at its best taking \"8 meg\" photos, half of the full sensor resolution. This is plenty of image size for 8 x 10 prints, more than needed for anything smaller. This is the \"M\" images size, or 3264 x 2448 pixels in the 4:3 aspect ratio that matches the three inch LCD. M mode also lets you shoot up to ISO 6400 and gives you 6 frames per second for about 7-9  frames in continuous shooting.Used this way, the F850EXR in \"EXR AUTO\" mode is a very fast shooting, fast cycling camera: a \"super duper point and shoot\" with consistently good results. It also is either a very good value or an all-out screaming deal contingent on what you paid for it. Even at $200, it does well against the tragically flawed SX280, the Nikon, and the Panasonics that all cost 30 - 40% more.While taking very good images for a camera of this class, the slightly larger 1/2 inch (vs. 1/2.33) sensor doesn't seem to make a huge difference, nor do the specialized shooting modes (Pro Low Light, Advanced Anti Blur, Pro Focus)  offer anything that is remarkable.VIDEOThe battery life is short in the F850EXR: not as bad as the Nikon and Canon, but still is a constraint on video use. The upside that the video itself is vastly improved vs. the Fuji F660, remarkably so. Yet, both the Olympus SH-50 and the comparatively expensive Sony  DSC-HX50V are better in the video department, in general, though neither rise to the level of dedicated prosumer camcorders, nor should they be expected to do so. The most usable video mode of the F850EXR is the 720p / 60 fps mode, easily. The 60 fps is a puzzling choice, for 30 fps is full-motion video and that's what you'll end up with if uploading to YouTube or burning a DVD.  1080 x 720p  30 fps is HD video, after all, a broadcast platform, and the 30fps stuff is easier to edit and render, with smaller file sizes.PROSFaster operation and shooting performance than prior models, higher quality LCD, greatly improved video, and a bargain price. The battery life is better than I expected: the supplied, factory battery is a 1000mAh unit, the \"NP-50A.\" However, the KD-KLIC-7004 battery is a common one, very inexpensive, and rated for 1400mAh or slightly better. I did get over 350 stills using this battery, right from the start. eForCity Kodak KLIC-7004 / Fuji Np-50 / Fujifilm x20/Pentax DL-I68 Compatible Li-Ion Battery is what I use, $1.25 ea. + shipping. I bought three of them.CONSDoes not have the optical zoom range or the video ability of the latest crop of pocketable cameras, like the 24x  Olympus SH-50  or the 30x  Sony DSC-HX50V. Both of these models are a bit more bulky and significantly more expensive, though.CONCLUSIONAs an everyday, do pretty much everything type of take anywhere camera, it really is hard not to like the Fuji F850EXR. It does everything in the \"very good plus\" area, and if you aren't going to print larger than 8 x 10s, you can set it into \"EXR AUTO\" mode at the M (eight megapixel) setting and enjoy one of the fastest-shooting compacts around.It is a massive upgrade over the F660, not particularly in still image quality, but in zoom range, LCD quality, the menus, and video ability. It feels great in the hands, it has an LCD as good as any ever put on a compact, it offers a 360 degree Panorama mode (Canon still has none at all), and there are several partial color modes and slow-motion video modes to experiment with.The video is now usable, it comes with a plug-in charger that is faster than the el cheapo USB method and won't tie up your camera. You'll need a tripod for this, but the Fuji Intelligent Digital Zoom reaches to 40x in \"EXR Auto\" and a bewildering 69X in Program Mode at the \"M\" image size setting. It has the full suite of \"PASM\" controls and two user-programable buttons as well. Its pop-up flash does not produce the vignetting you often see in smaller, flush with the body type flashes in super-compact cameras, either. All in all, it is just a terrifically fun, speedy little camera to use. For the money, nothing I know of comes remotely close to comparing with the F850EXR. I am surprised, but in a very, very good way.Copyright October, 2013 by Randy Wakeman and Randy Wakeman Outdoors. All Rights Reserved.", "Date": "October 28, 2013"}, {"Title": "Fujifilm FinePix", "Author": "Kathy Ringgenberg", "ReviewID": "RZHDB0NJ9YR2J", "Overall": "5.0", "Content": "It meets all my requirements as a camera, the zoom is wonderful and it is pretty light, my pictures turned out amazing, I am still figuring some of the setting out but overall I think it is a great camera.", "Date": "September 20, 2013"}, {"Title": "Awesome little package", "Author": "TodWorld", "ReviewID": "R2NIK06MU8JW14", "Overall": "5.0", "Content": "This camera is awesome. I had pretty much given up on point and shoot cameras until I got this camera to replace my old reliable Panasonic Lumix ZS20. I love my DSLR, but sometimes you don't want to carry around that extra weight with you.  This is my first time with the Fuji brand, so it took a little while to get used to the interface.  Startup is really fast and so far I've been impressed with the IQ of the camera. I plan to take some sample shots at my kids soccer games this weekend and hopefully post them.", "Date": "October 31, 2013"}, {"Title": "An excellent value", "Author": "Abraham", "ReviewID": "R3UWQRK2LUQC4M", "Overall": "5.0", "Content": "My wife and I had just bought a Fujifilm HS50EXR, Fuji's best point-and-shoot.  However, it has a very long lens and will certainly not fit in your purse.  We had been using a small Canon HS230 Powershot that worked well but it had suffered a chipped lens and some dents i the lens covers and was becoming unusable.The HS50 was a tremendous camera, but when my wife said that she'd really like something as small as the Canon to travel with.  Having read a review here, I was ready.  I quickly purchased the F850EXR here at Amazon.  I had some difficulties as the first vendor: Knockout Deals, shipped me a cameras and the usual accessories sitting loose at the bottom of a box.  There was some bubblewrap, but it was all on top.  The camera was damaged.  I returned it and they refunded my purchase prices and the cost of shipping it back to them but when I asked them why it wasn't in the manufacturer's packaging, they told me that they buy them in bulk and always have to repackage them.  Well, if you believe that line I have a bridge in Brooklyn you should see.  Anyway, I finally got one from Wolfe Camera, thru Amazon. They're as good a vendor as Knockout Deal is.... dubious.The camera seems very small, but it is actually slightly larger than the Canon we had been using.  They come in colors and we had gotten white which turned out to be very cool.  It looks like the paintjob on a white Lexus.  Here's the nifty part.  The insides of this camera are, electronically, almost identicaly to the more expensive HS50EXR.  It has almost ALL the features and functions as the larger camera.  And, as I said in it's review: they all work and they are almost all useful.  It has a 1/2\", 16 MP CMOS sensor; large for a camera in this class.  And CMOS sensors are way better in low light than the CCD chips of cameras past.  The biggest difference between the two is that this fellow lacks the hybrid autofocus of the HS50.  That gives the HS50 incredibly fast focus, but the focus speed of this guy (the F850EXR) has not given us a single thing to complain about.  Focus speed was actually a bit of a nuisance issue on prior Fuji camera but so far my wife has not a single problem with this one.  The lens is not as long as the bigger camera's but a 25mm-500mm (135 equivalent) zoom is nothing to sneeze at.  The lens extension mechanism is incredibly smooth and quiet.  If you find one at a store, just hold it close while you turn it on.  Watch the lens come out and listen for the usual whines and clicks you'd expect to hear.  None.  A near silent little whoosh.  And the finish is immaculate.  I suspect you may actually be hearing air trying to squeeze by the tight fit between the telescoping segments.  The image stabilization here works extremely well.  We have no problem taking handheld pictures at maximum zoom.  The viewscreen in the back is really nice: 920K pixels across a 3\" display is very close to what you'll find on the back of Canon's $5K X-1D DSLR. The camera has an extra button to which you can assign any function you want.  Quite hand, actually.  As with the other EXR cameras in Fuji's line (that's actually the name of the image processor system they all share) this thing has quite a few features and they are SMART, USEFUL features.  Sit down with the camera and the book and go through them all.  It will be a pleasant experience.  Check out the dynamic range settings and the noise reduction adjustments.  Try out the function that takes seveal quick pictures at insanely high ISO settings and then puts them together to make the noise disappear.  You'll think they've jammed a freaking magician in there.Drawback.  It does not have an eyepiece, but then nothing in this price range does.  The viewscreen has a sunlight mode that gets very bright if need be.  I suspect, however, it would eat batteries alive to leave it on.  Speaking of batteries... they are rather small.  HOWEVER, they lasted longer than I expected.  Amazon sells replacements from third party manufacturers for a about a tenth the price of an actual Fuji battery and they're actually rated at greater capacity.  But I'm supposed to be on drawbacks... hmm...  I'm sorry, but I'm coming up short... uhh...no... but... uhh... not that one either.  Sorry, that's about it.I'd like to give my thanks to Fuji for making this thing and Amazon for selling it at a truly decent price.  Makes for QUITE the value.", "Date": "January 10, 2014"}, {"Title": "None like it at this price.", "Author": "Dawes School 1", "ReviewID": "R3DGI22C4BZ6TX", "Overall": "5.0", "Content": "I'll keep this short & sweet.  There is alot to like with this camera, especially at the price.  The battery does run out fast, so a back-up is necessary.  Not a big deal as it's always a good idea to have a back-up anyway.  The zoom, image stabilization & autofocus are some of the main reasons I purchased this camera.  It's fast unlike most point & shoot cameras.  What has really surprised me is the lower light capabilities.  Even at full zoom at a \"lights off\" concert from 60 ft away I was able to capture a close-up of my daughter holding a candle with NO FLASH! This took a steady hand, but with the image stable and focus I was able to pull it off.  This was in the EXR mode which I'm sure chose a higher iso, but great shot I couldn't even do with my DSLR unless I was to put a $2500 lens on it.  Haven't had it a month yet, but can see all kinds of potential and creative possibilities in my future.  Awesome for a point & shoot camera!", "Date": "December 28, 2013"}, {"Title": "Just what I needed", "Author": "Amazon Customer", "ReviewID": "R1R6GAHIJUO9FC", "Overall": "4.0", "Content": "This camera has been doing great for me so far, although I haven't had a ton of time to check it out.  Outdoor pictures, even with moving subjects, have been turning out really well.  I'm happy with the purchase.", "Date": "November 16, 2013"}, {"Title": "Blurry pictures", "Author": "Amna Farrukh", "ReviewID": "R2OL5B255ID60O", "Overall": "1.0", "Content": "Takes blurry pictures. Tried all the settings but couldn't fix the problem. Returned it and bought Sony. I love Fuji but this didn't work for me", "Date": "November 27, 2013"}, {"Title": "Fujifilm FinePix F850EXR", "Author": "DD", "ReviewID": "ROITERWMB9HM4", "Overall": "3.0", "Content": "I am only able to rate how this camera on felt in my hands, and not on  its performance as I did not keep it.  I found this camera to be too small and light weight for my comfort zone.  It is certainly a pocket size camera, however, I preferred a slightly more substantial pocket camera, and purchased the Olympus SZ-31, which has more heft, a larger sensor and very comfy grip that is easy for me to handle.  Also, the Fuji F850ER pop-up flash is located where my left hand forefinger would rest while using 2 hands to stabilize the camera.  I did not actually use this camera as I instantly realized I would not be comfortable with its small size.", "Date": "November 13, 2013"}], "ProductInfo": {"Price": "$279.95", "Features": "3.0-inch TFT color LCD monitor\n16 million effective pixels 1/2-inch EXR CMOS image sensor with primary color filter\nFujinon 20x optical zoom lens with approx. 7.2x digital zoom (up to approx. 40x with 20x optical zoom)\nFocal Length: f/4.6mm-92m; Full Aperture: f/3.5 / f/8 (Wide), f/5.3 (Telephoto)\nFull HD movie (1920 x 1080p/60fps)", "Name": "Fujifilm FinePix F850EXR 16MP Digital Camera with 3-Inch LCD (Black)", "ImgURL": "http://ecx.images-amazon.com/images/I/51%2BAgWWnmCL._SY300_.jpg", "ProductID": "B00B46XRN6"}}