{"Reviews": [{"Title": "Review of The Sony HX300", "Author": "Thomas N. Wheeler", "ReviewID": "R36KYR6HVN92K1", "Overall": "5.0", "Content": "Over the years as a serious amateur photographer I have owned and used extensively Nikon and Hasselblad film cameras and lenses and when digital cameras arrived I began with the Nikon Coolpix 900 and 950, then DSLR's including the Canon EOS 10D, and today I am using a Canon 5D Mark II equipped with L lenses (Canon's premium glass).  The Sony HX300 is my first super zoom camera, and as such I spent several hours after receiving the camera from Amazon on March 14 thoroughly reading and studying both the Sony pdf manual and the Sony User's Guide in html format.  This was time well spent as there are many useful features on the HX300 that are not found even on my much more expensive Canon 5D Mark II.  During this study with both manuals, I tried each feature in the quiet of my living room making sure I understood exactly how the feature worked and what it did. Only then did I set out to explore the performance of the Sony HX300 under \"real world\" conditions and to compare it to the Canon 5D Mark II under controlled conditions.The two most import things about any camera are its image quality and its performance in actual shooting sessions.  Image quality is, of course, a combination of many things including the camera's ability to resolve detail, to properly expose scenes shot under a variety of lighting conditions, color quality, absence of both chroma and luminance noise, etc.  Performance is how responsive the camera is and includes such items as how quickly the camera is ready to take a picture after being turned on, the time delay between shots in single shot mode, the ability of the camera's autofocus to work quickly and accurately without \"searching\", and certainly in the case of a super zoom camera its ability to smoothly and rapidly zoom through its entire set of focal lengths.  For a camera of its price and likely use, the Sony HX300 does a remarkably good job of providing high quality images and a very responsive camera.My first test of image quality was to simply walk around my yard and the neighborhood taking images of a variety of flowers that were in early bloom as well as taking pictures of birds coming to the bird feeder in our backyard from about 75 feet away using the Sony HX300 at full zoom.  In virtually every single situation the HX300's autofocus was very quick and very accurate, and the powered zoom using the lever on the shutter release was highly responsive and quite fast.  The images produced had exquisite detail with good highlight detail retention, perfect color rendition, very good exposures in auto modes, and under these cloudy but bright daylight circumstances with the camera working at low ISO's very low noise.  These images straight out of the camera with no post-processing looked very good to excellent.  Using very small amounts of post processing mainly to slightly sharpen the images, I was able to obtain excellent large prints (13 X 19 in.) using my Epson 3800 Pro large format printer.  The shots of birds on the feeder at the maximum optical zoom (1200 mm) of the HX300 were all hand held, in focus, and showed good detail, albeit not equal to the ISO 80 shots previously described.  With one exception (vide infra), I had absolutely no problem hand-holding and autofocusing these 1200 mm maximum zoom shots.  The one exception is when I happen to line up a tree in the shot that was about 50 feet behind the bird feeder.  In that case, the HX300 always wanted to focus on the texture of the tree trunk behind the feeder.  The feeder is plastic without high contrast.  I was able to solve the problem completely by switching the focus mode from multi-autofocus to center auto-focus and placing the center focus frame in the EVF on the edge of the bird feeder where there was sufficient contrast for the focusing system to work properly.  This initial collection of maximum zoom shots brought home an important lesson about super zoom lenses including the Carl Zeiss lens on the HX300.  Remember that the HX300's lens has a maximum aperture of 6.3 at 1200 mm and therefore the ISO will be set at higher values (400-800) to provide a sufficiently fast shutter speed to allow the camera to be hand-held at such a zoom setting. Of course, the higher the ISO, the higher the visible chroma and luma noise in the captured image.  I found that these outdoor shots at 1200 mm zoom on a cloudy but not overcast day came in at ISO 800 and a shutter speed of 1/160 - 1/250 sec.  The maximum zoom shots were reasonably sharp, but benefitted from noise removal in post-processing which, of course, is always a compromise between detail and noise reduction.  Nonetheless, these images gave quite good prints and beautiful images up to 11 X 14 in.  I believe with experience I can hand-hold maximum zoom shots at shutter speeds even below 1/160 second and manually set ISO to 200 and achieve even better maximum zoom shots.  I think it will be difficult and perhaps impossible to get good maximum zoom images with excellent detail on very cloudy and overcast days or in other low light level situations.  The HX300 in such conditions will require ISO's higher than 800 in such situations for maximum zoom images and the result will be more image noise than I would find acceptable.My next photo expedition with the Sony HX300 had the objective of comparing image quality under controlled conditions (tripod mounted camera with timed release of the shutter to avoid vibrations that would lower image detail) of the HX300 with my Canon 5D Mark II and the 24-70 Canon L zoom lens as well as with the Canon 100-400 L lens.  I went to a nearby park which has a lake that affords a 1.5 mile unobstructed view to a wooden bridge and homes across the lake.  Lots of trees surrounding the lake provided added detail.  It was a sunny bright day with no clouds in the sky.  I shot a series of shots with the Sony HX300 in IQ mode and in Scene Select Landscape Mode at focal lengths ranging from 24 mm (maximum wide angle) to 1200 mm (maximum optical zoom).  I matched the shooting conditions and scene with my Canon 5D Mark II on a tripod using the two L lenses up to the maximum 400 mm of the Canon L zoom lens. Upon arriving home and comparing the images, I was truly amazed at how well the Sony HX300 had performed. In fact, until I got to 100% image size (pixel peeping!), I was very hard pressed to see any difference in the detail or overall quality of these two cameras.  I found this to be very surprising since the Sony system is $500 and the Canon 5D Mark II with its L lenses is in the $3500-$4500 range!  At 100% image size I was definitely able to see a difference in the quality of the images and it always favored the Canon 5D Mark II which, not surprisingly, showed greater detail and less image noise than the HX300 especially when comparing the 400mm shots made by the two cameras.  With that said, the difference is best described as noticeable but not overwhelming as I might have expected.  I have shown these comparison images to several photographic friends and all have expressed amazement at how well the Sony HX300 image quality holds up in comparison to the much more expensive Canon equipment.While at the lake I also had the opportunity to try out the Sony on some real \"action\" situations.  A blue heron flew past and landed about 150 yards from me.  I was able to get some terrific shots at full 1200 mm optical zoom (ISO 125) that I have printed at 16X20 size.  I had the opportunity to try the burst mode of 10 images on a group of ducks in flight.  I found that it was going to take some additional practice to master the art of zooming, tracking, and setting off the shutter for pictures of this type, but the camera did track and focus fairly well on this difficult scene.  In another instance, a bird was circling high over the water and I was able to zoom to 1200 mm and get a nice detailed shot.While at the lake, I had the opportunity to try out the movie mode of the HX300.  I found that it tracked focus on my subjects beautifully, allowed me to smoothly zoom during movie making, recorded the sound nicely, and performed in every way in movie mode as well as I could have desired to produce excellent 1080i AVCHD movies.Just a few final comments. Build quality on the Sony HX300 is quite good.  Yes, it is made of composite (plastic), but it feels solid, has a nice textured grip that makes the camera easy to hand hold, and is so wonderfully light compared to my Canon 5D Mark II.  I was using a 32 GB ultra high speed San Disk SDHC card, and I had no problem taking single images rapidly in virtually any mode, and even the burst of 10 shots previously described were recorded to the card in about 5-7 seconds which seems quite acceptable to me.The HX300 is not a perfect camera (nor have I yet found one that is!), and here are some things that I would like to see changed.  A button press is required to switch between the EVF and the LCD.  On the older HX200 there was a sensor which automatically went to the EVF upon sensing the eye.  I wish Sony had not removed this feature.  The button turning on the EVF is flush with the camera body and quite small making it difficult to find by touch.  The same is true for the Focus button, although the latter is only required  when changing focus modes.  Of course I would like to see a larger aperture than 6.3 when at full optical zoom, but this would likely require a much much larger lens with all the weight and expense that would entail.My bottom line is that if you are in the market for a super zoom camera and you understand that under low light situations you may not find the 1200 mm zoomed images to be acceptable in their level of detail and sharpness, then I would highly recommend the Sony HX300.  If you are printing huge images (larger than 16X20), this is probably not the camera for you.  If you want a camera that will be great for vacation pictures, pictures of the family, bird photography,  wildlife photography, etc. and you are willing to invest some time to learn to properly utilize the camera, then the HX300 may well be the perfect camera for you.TomNote Added: I I have now posted the images referred to in the above review of the Sony HX300 including the comparison images with the Canon 5D Mark II on the dPreview.com Sony Cybershot Forum.  The images, as per Forum requirements were posted at 1/2 the original image size. You can view the post at [...].", "Date": "March 21, 2013"}, {"Title": "A review for the less technologically inclined---Awesome Camera!", "Author": "Douglas W.  McKeehen", "ReviewID": "R1JPPEAYE5H22W", "Overall": "5.0", "Content": "A couple of things about me, and what I needed in a camera.  First of all, while I have some basic understandings of how these kinds of cameras work, I am not a professional techie guy, and I usually have to look up every spec I read and usually end up not getting it entirely.  I did do a lot of research, but the Camera Spec Snobs in some of the review sites just go to an extreme that will never, ever matter to me.  Second, this camera was a replacement for my old bridge camera, a Sony DSC H-5 (12X optical, 7.2 megapixel).  That camera served me well over the past 6 years, after thousands upon thousands of images.  I bring this up because there have been a mountain of improvements on all technological fronts since then, which has resulted in an entirely and spectacularly different photographic experience I am having with this new camera after only a few days, and may explain my giddy five star love-fest I am having with this thing!  I use my camera for everything from artistic photos to nature photography to family events, so I want a camera that shoots great, better than average pictures in a variety of circumstances over a specialized camera that takes outstanding pictures in limited circumstances.Unlike many other reviewers (but most probably like the majority of shoppers), I do not own several high end cameras and am therefore not going to be comparing this one to my other high end camera that I bought last year.  So, in my comparison, all I can say is if you have an older bridge camera that seems to be losing a bit of steam and you are looking to replace it, look no further.  You don't have to spend hours fretting over this spec and that, when you get this camera and take a few pictures you will feel like you did as a kid when you replaced that brownie camera with your first 35mm!  The improvements made over that past half decade make the experience like night and day!Every problem that I had with my old one is gone (or at least vastly improved) with this new one.  That purply fringe line you sometimes got on the edges of your subject, or that white glare that seemed almost neon in brightness on a sunny day?  Gone.  That problem with focusing on a fast moving object?  Gone.  The blurry images from moving objects in anything but bright sunlight?  Vastly improved.  The issue of losing all definition of dark areas if anything was remotely back-lit? There is a setting called HDR on this camera that makes it possible to take those pictures you just didn't even bother trying before.  That problem with taking indoor shots without flash where the quality was so low you never shared the pictures with anyone?  Oh my God, what a difference.Like my old camera, this one has a fully automatic setting, settings that allow you to over-ride some of the auto settings and others to completely over-ride the auto settings.  It also has a large variety of other specialized settings, like \"pet\" or \"portrait\" that adjusts things for certain scenarios.  In the cases of \"landscape\", \"hdr\",  and \"background de-focus\", the camera's auto setting seems to do this for you.  The macro setting is also automatic, coming on when your lens gets close enough.  Over time, I will learn all these new settings, because I know that sometimes, the auto setting will misread the situation and I will want to be able to adjust.  However, I am really impressed with this cameras ability to auto adjust well.The quality of my pictures are stunning.  If I crop in to a ridiculous, unreal point and compare it to a picture taken by a $2000.00 DSLR, would I notice a difference in crispness?  Probably, but I will leave that debate to the spec snobs.  While they are busy fretting over such things, I will be in the mountains taking awesome pictures of my grandkids in the snow, and enjoying my camera.  Color, composition, saturation, detail, contrast, etc. are all outstanding with this camera.  Details that my older camera could not pick up just stand out like crazy with this one.  The camera is not magic, my black lab running in the white snow on a back-lit landscape still comes out as just a pure black shadow, but in less extreme situations, this camera is doing an awesome job.And that crazy, insane 50X lens!  First off, on the wide end, 24mm is much wider than my old 36mm and the difference is phenomenal. But when you go off the other end, I just cannot describe what happens.  I have pictures of a building on a hill where you can see people on a deck, then you zoom out and that building is just the tiniest spec on your picture.  I love birds, and am really looking forward to taking this out and getting details I never could before.Played a bit with the video, and frankly I have a lot of homework to do on it.  One thing I did notice though, is that the anti-shake technology on this camera made some of my video shots look like a pro took them with a tripod.Bottom line, this camera is awesome.  I have three situations where I took a picture and was stunned by the results.  1.  A pigeon flew quickly over my head in a blue sky.  The camera was on auto.  I whipped around, got the bird in the frame, zoomed in a bit, and held the button half-way down to focus.  The auto focus caught the bird quickly, and then the bird was instantly tracked by the auto focus.  I took the picture, and the bird had no movement or blur in the photo.  This was all done in under a couple seconds.  2. At around 5 pm, with the sun setting behind it, I took a picture of a mountain during a trip in the Cascades.  The mountain had some snow, and some dark patches  where there were trees and/or rocks.  This photo would have been impossible in the past.  Camera was on auto, and it immediately went into the \"HDR\" setting. (Read about this if you do not know what it is, I recommend making it a \"need\" spec to shop for.) The photo showed all the detail of the mountain instead of my usual too dark mountain that I would have got in the past.  3.  I tested the camera in low light indoor settings, against my old camera.  WOW!  Where my old camera could only take an almost black dark shadow picture, this one picked everything up.  I am talking at a light level far below what you would see in a family gathering, and I can hardly WAIT for the next time our family gets together!Did I mention that awesome, sick, crazy zoom?I love this camera!", "Date": "March 24, 2013"}, {"Title": "Comprehensive review of Sony DSC-HX300", "Author": "PhotoGraphics", "ReviewID": "R24AEAWCDZP609", "Overall": "5.0", "Content": "Despite being a professional photographer I have a variety of point-and-shoot pocket cameras for family events, vacations and just having fun and I will let you know right now nothing included in my review will be techie, just real-life things that can help you decide if this is the camera for you.Recently, adding to my collection of little pocket cameras, I acquired an Olympus XZ-1 in an attempt to get better results than I've previously experienced with low-end pocket cameras and it does an admirable job while still remaining portable. The DSC-HX300 is not pocketable, it is what is known as a \"bridge\" camera. I've generally thought of bridge cameras (SLR-like with non-detachable zoom lenses) as a compromise ... almost as large and heavy as a real DSLR, lacking the versatility of swappable lenses, tiny sensor, mediocre lens and much too automated. But I do realize that all consumer-grade cameras just keep getting better and better and if you read on you will hopefully get some insight about the capabilities of the Sony HX300 and how it compares to state-of-the-art.This is the first Sony-brand camera that I've owned, although I did early development work with them regarding the original Mavica digital cameras. I respect their ability to design and manufacturer most of their components in-house, especially after they acquired the photographic experience of Konica/Minolta. The DSC HX300 can safely be called a \"premium\" bridge camera as it reigns with only a couple of other similar cameras in worthwhile features.As I said, I'll avoid getting techie in this review; there are well-established resources for that. Nor will I republish the specs which can be found at the Sony website or compare a consumer-grade camera with a $5000 professional DSLR. Just a real-life user report that I hope will help you decide if this model is what you're looking for.WHO WOULD BUY THIS CAMERA?Likely the #1 reason someone might choose the DSC HX300 is the astonishing zoom range of 24mm - 1200mm (35mm equivalent). Even with a pro DSLR a zoom of that magnitude would not be something you would use handheld and you certainly wouldn't want to take a DSLR fitted with a 1000mm lens on a family outing to Disneyland. For all of its extreme zoom power, the overall camera weighs lighter than an entry-level Canon or Nikon DSLR with a stock 18mm - 55mm lens attached. Because the camera is much larger and heavier than a compact pocket camera and less enabled than a DSLR this is probably not going to be your one and only camera, however the HX300 defines why bridge cameras exist and for most people would certainly be well suited as an all-in-one still/video camera for that Disneyland trip. At its price and relative sophistication of controls the average user will probably use it to take to sporting events and other such applications where an extreme zoom lens is important. That describes how I will use it, I doubt it will ever be a \"take everywhere\" camera to me.A very likely target audience for a camera with a zoom of such range would be those with a love of birding, and well they should, the zoom range is quite mindboggling. The best analogy would be to compare the results to using a fine pair of Monarch model binoculars for birding compared with a decent low price pair. With the lower-priced scope you will certainly see the bird and be able to recognize it but the image will lack crispness and richness of color. The HX300 isn't a bad choice for birding, one should simply be aware that the image may fall short of the glory of detail a quality pair of binoculars can deliver.FEATURES AND CONSTRUCTION:The camera makes good use of the plastic construction, feeling solid in the hand but not fragile. The second best feature, in my opinion, is the large ring around the lens which is the perfect place to place your hand to steady shots being taken at long zoom ranges. That ring can be used to manually zoom the lens (much better than using a tiny rocker switch on the camera body, although the DSC HX300 has one of those too if you prefer). By flicking a large switch, which is placed in exactly the right location for your left thumb, the ring can be turned into a manual focus ring.  That combo on a camera of this type is absolutely brilliant.  Well done, Sony!  But DON'T expect that ring to have the exact feel to it that any DSLR has ... it is a \"fly by wire\" type, which means turning the ring simply activates a motor that controls the zoom or focus function.  There is significant lag before the command is received and executed and not a lot of precision. Once you get used to it, the benefit of having the zoom/focus ring on the lens makes you promise you would never want to give it up.The camera has both a large 3\" high-resolution articulated (up/down)LCD on the back and a decent electronic viewfinder (EVF) that is bright and sharp. I suspect when zooming in tightly on something most users would prefer to use the EVF so they can brace the camera against their face.  The EFV also makes it quite a bit easier to follow action sports. I have seen a few comments bemoaning the fact that Sony dropped the eye-sensor switch that the predecessor model had in favor of a manual button to switch between the two viewfinders.  Personally I prefer to make that choice manually ... there are circumstances when I like to be a bit discreet and not make people nervous when I photograph them, and the eye-sensor switch turns on the huge 3\" screen every time I move the camera slightly from my eye, which is hardly discreet. Note also that the EVF offers something few compact point & shoot cameras have anymore, the ability to shoot in very bright sunlight.  As good as rear LCD's have gotten, even the best have trouble in bright direct sunlight.  The HX300 doesn't leave any option lacking ... you can hold it to your eye in difficult lighting conditions, you can use the 3\" LCD for more casual shooting and you can tilt that screen both up and down, which offers great versatility. As someone who has tried several cameras with auto eye sensors, I conclude that it can be VERY frustrating if you move your eye away for a split second just before a critical shot and the EVF goes dark. I would much rather know EXACTLY which viewfinder that I have chosen to use and that it will remain that viewfinder until I choose a different option.Although much of the hype concerns the 1200mm tele range of the lens the wide end goes to 24mm which is almost as miraculous AND it opens to f:2.8, unbelievable for such a lens. The camera sets high expectations for itself and bottom line does the lens deliver?PERFORMANCE:Here's the part that most readers are looking for ... how well does it perform? Quite well, despite self-imposed limitations. Sony may be trying to do too much with its tiny P&S; sensor, at even low ISO it unfortunately has some processing artifacts that make photos look acceptable to the average eye, but will fall to pieces if enlarged too much. To their credit, Sony tries really hard to keep that ISO on fully automatic modes down near that 80 ISO level. There is no raw capture, and there should be at a $500 price point. Overexposure can be an issue (although there is a pretty cool and simplistic way of \"choosing\" what exposure looks good to you and some modes allow +/- exposure bracketing. And the camera won't always choose to use acceptable shutter speeds with auto ISO as your setting. While I still can't imagine why I would want to shoot handheld at 1200mm and expect a decent photograph, I no longer have to imagine it ... it's just too good to be true.  You get what you should expect ... a bit marginal at best at 1200mm that can suffice in a pinch, sometimes actually quite good. The lens is probably capable of topping out at about 250mm at the most to deliver what most people would agree could be called an excellent \"sharp\" picture.  50x sounds great on paper, but take that paper and write down how many times you think you will actually need it and you may be surprised how unrealistic that spec is.And now we reach the vital question, how good are the pictures?  Well, we have come to expect the best possible performance of digital cameras, no matter the brand or design, as being their best at below 100 ISO, acceptable up to 800 ISO and marginal beyond that. Unfortunately, the HX-300 at 80 ISO the JPEG images do have some processing artifacts in the form of  grainy structures, while edges are somewhat smeared rather than tack crisp under less-than-ideal conditions. What does this mean to anyone shooting pics of the family on a fun weekend?  What I said isn't as bad as it sounds, only that the overall image lacks the clean and clear quality one expects from a camera in its price range, BUT I have to quickly add that when you consider all of the compromises Sony had to made to stuff all of the features they did into the HX300, if you're disappointed in the limitations then this may be the time you migrate to a basic DSLR instead. If your conditions are good and you take a little care, all hope is not lost, this camera can produce some stunning results. I posted a \"snapshot\" of an egret I took in which I had a little time to assure the camera settings were what I wanted and I am very satisfied with it. It is posted under User Photos.BATTERY LIFE:Modern cameras are required to do so much, especially to power huge LCD screens, motorized zooms and sometimes WiFi and/or GPS that sometimes it's hard to get through a full day on a battery charge. To compound the issue, batteries are getting tinier and tinier. After receiving the camera and giving it an initial charge, at the time of writing this over a week has passed with me taking at least 10 - 15 shots a day and some random movie clips (plus I've spent a lot of time navigating through the menus just to learn what's there). After all that, the battery meter shows over 50% life left. I'll update after an extended period of use but the initial results are very impressive.DOWNSIDES?There are not many things in the minus column that should discourage someone from choosing this camera if the specs and features fit their needs, however there are a couple of quirks that, once you use the camera, will seem odd. Sony does a great job for a point & shoot of not forcing you to dig deep into menus to change important shooting functions, the mode dial can handle most of them without even taking your eye from the viewfinder. However, this is a camera that begs to be used at sporting events, considering its zoom range and ease of shooting fast action.  So one would expect the Sports mode to be one of the mode dial functions, right? No, instead to reach it you must choose the Scene mode, then use the rear jog dial to select it. Where you would expect to find the Sports mode you will find instead a 3D Still Mode, something that may be nice to have but certainly not something the typical person would use often, if at all since it only works effectively on certain Sony TV models.  By the way, that rear jog dial is a gem. It is context sensitive and depending on your shooting mode, controls all of the most important secondary functions like ISO, shutter speed, F value and EV and select them by pressing in on the dial. Another \"tiny\" negative might be that at the default setting the viewfinder/rear screen is jam-packed with useful but ever-changing data.  There are 4 user choices how you want the information displayed but none of them are what I would consider perfect.  For example, why Sony, would you not let the user keep the horizon level on no matter what other mode is chosen?  One relatively minor fault is the position of the on/off switch.  It is located at the right base of the viewfinder hump and is flush with the camera body. To activate it the index finger must reach over the function dial which can easily turn the dial.  The button is difficult to press and there is no tactile click. My preference would have been either a button or a slide switch (common on many cameras) in the space on the left between the viewfinder and the body.COMPARISONS:Okay, let's say you want to use this camera as your everyday point & shoot, how does it stack up to a moderately prices DSLR (I know, there isn't a real comparison between it and any DSLR, but let's assume you're comparing value for the price) and a moderately priced compact camera (not a cheapie, but one that is currently selling for under $300 - $500 at the time of this review). Bottom line:  As is clear from the note above my review, this camera was provided to me for evaluation, which is true with many camera review sites. My reviews are always based on personal knowledge and experience and I feel I have reviewed it fairly. I have no relationship nor interest in Sony and as stated earlier, this is the first Sony camera I have owned.  I am not married to any brand, having used virtually every professional brand, and most consumer brands. Remember, a camera is only a tool. It is not capable of making you a great photographer.  Specs don't make photographs, creativity does. Use what you research as a guideline, and then choose the camera that best suits what you want to do.That being said, is this the best camera ever? Should it be your only camera? Probably no on both counts, I classify it as a specialty camera and once you learn its capabilities and also its limitations, you will find it is truly a bridge camera that is worth owning.SUMMARY:So in summary, the zoom range is what makes this camera special. Putting aside pretensions that most people will actually use the more advanced modes (I think not) the automatic Point & Shoot modes define some of the most advanced camera technology currently available. If you only owned one camera and only used it in one of the Scene or Auto modes you would have to work hard to produce a bad photo. If you venture into the more advanced modes and aren't what they call a pixel peeper, you could declare this your \"do everything\" camera.  And if you have the means to afford a $5000 DSLR and also a pocketable camera you may still do well considering the HX300 because, quite frankly, it's really kinda fun to shoot with.[UPDATE 1] I accidentally bumped the lens against the edge of a piece of plastic sporting equipment yesterday, fortunately no damage only a smudge that could be removed with a lens cloth. Five minutes later I ordered a Hoya 55mm HMC UV Digital Slim Frame Multi-Coated Glass Filter from Amazon which was delivered next day, it was on sale for under 9 bucks. It fits perfectly (and the lens cap also fits perfectly on it). Follow the link to my review. It is dirt cheap insurance to protect that large exposed Zeiss lens.[UPDATE 2] When I travel I prefer a small snug case to protect the camera from accidental bumps, although after I arrive I leave the case behind and carry just the camera. I tried the Case Logic DCB-304 for this camera and found it to be just a little snug. After a long search I found the EveCase Black Pouch Case was a perfect fit, almost like it was made specifically for the camera. I have reviewed it separately. It is reasonably well made (not quite Case Logic quality) but just perfect for this camera.", "Date": "April 23, 2013"}, {"Title": "MindBoggling Reach; Glorious Pics", "Author": "P.Broadnax", "ReviewID": "R5UKFXHBKFMU1", "Overall": "5.0", "Content": "Summary:  Only this camera empowers me to quickly tweak focus, freeze framing a duck on the other side of a large lake, or a Robin bathing in a neighbor's birdbath -- complete with the individual water droplets falling from that duck's bill as she drinks, or flying off that robin as she shakes herself dry.- - - -Concurring with the positive reviews, I write to highlight essential points.::::: (1) Image Quality (IQ) :::::Some blame \"20 megapixels\" for the poor IQ of their disappointing photos. Reality check: you can *choose* 20, 15, 10 or 5mp as the default. Some just generally declare \"bad IQ\" at the extreme zoom end; others love the IQ. The reason you're seeing such opposing opinions likely comes down to one fact: 50x zoom is new to us all. Some learn how to tame all that power; some don't. (More on this issue at #5&6 below.) Incidentally, Noise Reduction errs on the side of details (thankfully!), rather than smearing; configure as desired, in the Settings.::::: (2) \"Superior Auto\" Modes :::::There are two, one with a \"Plus\" designation. Plus adds a sort of *realistic* HDR, among other features; you'll hear machine-gun shutter snaps--- Sony uniquely blends them all into one final picture. Thus, you can not burst shoot while in SAP, but it is available in SA. Great surprise: each mode is pretty darn good! (Hanging out in auto mode when testing a new camera = cheat sheet to inherent firmware flaws. I've experienced no deal-breakers here.) It's even smart enough to apply a bokeh effect re zooms! (Still learning EXACTLY when I can expect that to kick in.) Scene modes are also quite helpful, and exploitable for more than the described purpose.::::: (3) Lens, Zoom :::::The lens is threaded for 55mm filters. (See #10) . . . . The headliner 50x optical zoom is complimented by at least 100x \"ClearZoom.\" The latter delights *much* more frequently than disappoints. Toggle it on/off in the settings. There's a separate toggle for straight \"digital zoom,\" which I keep off.::::: (4) NeatOh! :::::There's a customizable (limited) button on the top of the camera (oddly placed), & a *convenient* rotating push-in ribbed wheel that keeps, e.g. exposure compensation immediately accessible -- right hand for both. Optional always-present histogram & grid on screen; one tap to change/remove it on the fly (right hand, thumb).::::: (5) Mechanics :::::Zooming is reliably fast, as is auto tracking focus. Even at max zoom (50x & 100-140x), IF you adequately brace yourself. Think: you know 20x magnifies your slightest shake; whaddaya think 50x will do? Failing to respect that reality, and prepping yourself accordingly, results in eye-assaulting photos. Likewise, the complex nature of some scenes induces auto focus woes. Quickly curable, thanks to Sony's smart Plan B-- the  zoom/focus ring, with a no-eyes-required ridiculously-easy-to-manipulate flip switch (auto/manual focus, left side). . .  On the other hand, while snapping itself is fast, an irritating but tolerable wait-state materializes in burst mode's aftermath, per writing the shots to a Class 10 card.::::: (6) Image Stabilization :::::The system is golden. But expect no miracles when mimicking a modified version of a rapper within a mile of a microphone. Extreme zoom (50x/optical; 100--140x/ClearZoom) power is new to us all! Each additional mm of zoom necessitates additional care in bracing yourself. Approach the HX300 with related humility (\"I don't know diddly 'bout handling a 50x+ camera, so I NEED to be super conscious of my body\"), genuinely respect/ learn/ tame it, & you'll be a happy camper. Approach it in the same manner as a less-than-half(!!!) the zoom camera, and the predictable \"ugh!\" results will spark a bullet-speed return. Bottom-line: This NEW & INTENSE degree of zoom = doom, unless/until you develop bracing techniques (plural!) to harness all that power, AND study the options of *this* camera as well as *its* unique sweet spots. Don't misread me here -- experience via other cameras is helpful. But old-school kinda-braced ain't gonna cut it. Trial & error = my/your BFF. But I assure you, it IS doable! I own a tripod and monopod, which I've yet to use here. Was the learning curve frustrating? You betcha. Worth it? Oooo baby, you better believe it!::::: (7) You Can D/L the PDF Manual, Now :::::The full 240 page PDF user manual is linked at dpreview >> Forums >> Sony Cybershot >> search: hx300 PDF. While I rarely RTFM, the HX300's incredible reach alone inspired grabbing & studying that manual while awaiting delivery. Time well spent, as I have zero complaints about image quality, zooming or focusing. At the very least, play CliffNotes by studying the charts outlining what features are available per mode (starts around p80).::::: (8) A Winning Review :::::(March 30, 2013 - Amateur Photographer)For those who depend on formal reviewers for camera purchasing, FYI: This UK zine (Zinio on iPad, Web) reviews ultrazooms from Sony, Canon, Fuji & Nikon, awarding first place to the HX300. Reasons: ease of handling, image quality, reliable zoom, speedy autoFocus, \"excellent\" viewfinder. Having returned Canon's sx50 and Nikon's p510 long prior to snagging this camera, suffice to say that I agree (sluggish/unreliable zoom/focus, viewfinder from Hades, etc).::::: (9) Suggestion (Images available for your review) :::::Search Flickr (\"hx300\") to view FULL resolution 10/15/20mp photos. (Forums typically slice resolution.) You'll see birds, squirrels, ducks, the moon, cars, cityscapes, landscapes, indoors & other shots --  Superior Auto/Plus modes, 50x max optical zoom, 140x (!!) ClearZoom, handheld, no crop, no edit, low light, high ISO. FYI: where mine (pgBnax) look soft or lack focus, it's my bad, NOT the camera. Exception: max ClearZoom (100x to 140x) -- sometimes a wee bit soft IQ; not exactly earth-shattering news to those familiar with the foibles of any form of digital zoom. Even there, a couple of minutes of post-processing on my iPad (PhotoGene) cures whatever initially irked these retinas. Otherwise, I repeat: \"grrr!\" photos flow exclusively from *my* failure to PAF (pay attention, fool!) while lining up the shot.::::: (10) Recommended Accessories :::::... Wasabi Power Battery (2 Pack) and Charger for Sony NP-BX1 and Sony Cyber-shot DSC-RX1, DSC-RX100, HDR-AS10, HDR-AS15. Under $20. Avoids otherwise required in-camera charging. Plus, having 2 spare batteries juiced & ready lets me focus on my beloved hobby, rather than the precise number of shots left before I'm jacked.... Maximal Power CA LENCAP55 Snap-On Cap for Lens - 55mm Black Lens cap WITH a cord to attach to camera strap. (Really, Sony, couldn't cough up that little but vital cord?!?) $3... Maximal Power 55mm Lens Filter Kit Includes Circular Polarizer, UV and Star Lens Filter Kit for 55mm Camera Lens (Black) Under $10. Nice for getting your feet wet with filters.... AmeriBag X-Small Microfiber Healthy Back Bag Tote Under $30. Stays flat against my back, with minimal punching, as I run multi-mile park trails. I did add a padded sleeve, pulled from one of my dSLR camera bags. Teflon coating conquers rain fears. Bonus: external water-bottle-friendly hugs-it pouch; room for phone, wallet, spare batteries in a change purse, small notebook and more. External & internal pockets are secure, some zipped, some with Velcro. Guys: Color is key re the metrosexual test.::::: Finally, (\"pure opinion\" alert!) a few words about....Pixel Peepers Professional reviewers invariably blow up photos 100-200%, scrutinizing  ad nauseum for shortcomings. Once upon a time, I suffered resulting brain-kidnap syndrome. I was so far gone, that I wouldn't even touch xyz camera until favored reviewers presented their \"in depth\" positive commentary. While awaiting those reviews, I'd move among assorted forums, hungry for morsels about that xyz camera. At some point (Hallelujah!), a few free brain cells sprung back to life, and it finally registered:* I am not paid to pixel peep.* I do not routinely print poster-size photos.* I will not be wallpapering a room with a photo.* I do not carry a computer monitor to share pics with buddies.* I do not work for National Geographic.On the other hand, I am one picky sunnuvawitch as I review the day's shots. But I now approach each look-see as a realist, not a purist. I typically share via iOS-app arranged printed postcards, standard size snapshots, my phone or iPad4, or StreamZoo or Flickr (I left InstaSpam). In other words, to me, common sense = accept/reject photos based on how they will actually/habitually be used, not on the basis of some pie in the sky version of perfection.dSLR  vs Point & Shoot (P&S;). . . . I do not confuse a car with a truck, a bike with a Harley, nor a P&S; with a dSLR. I understand: purpose dictates which is better for whom at what time. I realize: camera manufacturers are capitalists.. . . . A dSLR-size sensor within a P&S;, WITH extreme  zoom, IF mechanically possible, would kill lucrative len$e$ lines, not to mention my bank account. Ain't gonna happen. Meanwhile, dSLRs and P&S; both *offer* great pics, but neither *guarantees* it. No camera, nor camera genre, is perfect; each & every one involves/instigates one or more compromises. Not one functions within a vacuum; results are fully dependent upon the photographer.. . . . I appreciate my dSLRs, but they're heavy, cumbersome & downright inconvenient. I've created (!) more photos in the past 7 weeks than I have since early November, and that includes holiday periods. NOT because this camera is new to me, but because its usually with me, unlike a dSLR. **And** because I am finally well-armed to capture scenes which, until recently, were within my line of sight, but beyond the mechanical prowess of the camera then in hand.  Read: limited reach.BottomLine, for Me. . . . My history includes purchasing an uber-expensive 500mm telephoto lens. I returned it within 48 hours. Felt like I was carrying a football player's thigh. No thank you!. . . . The HX300 will sing in some hands, flop in others, for reasons previously outlined. Fact: it permits capture of scenes even my dSLRs have futzed -- for years -- solely due to reach limitations. This bad boy is now with me when I step out my door, a good 90% of the time. My dSLRs are headed to eBay. I've been through many a P&S; folks. This is the first time I knew, deep within, that I'm sacrificing nadda in reaching for the P&S; instead. Super-sweet purchase, no question!", "Date": "April 30, 2013"}, {"Title": "Impressive and Very Capable SuperZoom Bridge Camera with Low Light Limitations", "Author": "R. Kahn", "ReviewID": "RXQGZB2V1TPUK", "Overall": "4.0", "Content": "First, let me say I fully appreciate all of the comments about the camera in these posts and those in particular by Thomas Wheeler.  They have been very helpful in learning how best to use the camera though I have also spent a lot of time reading the online manual and studying many of the reviews of the camera.  I was attracted to its advertised specs, the favorable reviews, and the way it felt and handled.  I bought the camera about 3+ weeks ago from Amazon and have since taken over 1000 pics and several videos and have come to several conclusions about how I have been able to best achieve the most satisfying pictures for me.I very much like the camera's handling, the quick ready-to-shoot time from turn-on, the quick focus (especially, in high contrast situations), the zoom ring which is very handy for zoom and composition adjustments, the short shot-to-shot times, and the image stabilization system which works very well at long zooms.  I am using a SanDisk Extreme SDHC Class 10 memory chip rated at 45 mb/sec.  Camera responsiveness has been very good.  I have not used a tripod with any of my pics.I generally shoot still shots in the Program (\"P\") mode where I can control ISO and let the camera determine the best shutter and aperture settings, but I also have taken pics in several of the \"Scene\" settings and have used the \"Superior Auto\" setting to let the camera determine the scene and best camera settings with the highest quality.I try to keep the shutter speed short, take pics with bright sun, and well-light settings inside and outside. I also work to keep the ISO at or below 400, around 200, if possible. I have also set the internal sharpening and contrast camera settings to \"+\".Overall, I have found I get the crispest shots with bright sun, low ISO, high shutter speed, and very high contrast between the subject and its surroundings when using the \"P\" mode dial setting, even at high zoom.  With such conditions, the pics turn out almost razor sharp, with little or no post editing needed even with very high zoom (<= 40x).  I have taken some stunningly sharp shots, including macro, near zoom, and distant zoom ones under the aforementioned favorable conditions. The inherent camera focusing system seems to \"love\" (perform best in) the high contrast, bright light scenario because it seems to work its best then regardless of zoom setting to produce very sharply focused pics.  Yes, you must hold the camera very, very steady (as noted in other posts) to allow the Image Stabilization System to do its best as well at long zooms.The low light situation seems to be this camera's Achilles' heel because shooting under this condition is something I am still working on to get a satisfying picture.  The camera tends to use high ISOs (and  thus, introduces more noise) to compensate for low light, but so far, in the case, most of my pictures show that much clarity and detail are being lost probably due to the low aperture setting, and small image sensor, in particular at the high end of the zoom.  Engaging a longer shutter speed (as opposed to higher ISO) in this case may be an alternative.  I am also  still exploring the in-door \"people\" picture situation, too. Though I have taken a number of such pictures, I am still working on achieving the best lighting \"set-up\" indoors with and without flash, but I tend to shoot outdoors in the landscape, wildlife, or macro modes mostly so I have not been very troubled by this yet. It has been suggested that the \"Superior Auto\" Mode on the camera is a good way to take indoor portrait shots w/o the necessary use of flash.In most cases and situations that I have experienced so far, the camera also seems inclined to produce fairly soft, smooth \"edges\" around the outline of the subject and surrounding objects regardless of the mode dial/camera settings used and situation.  This may be result of the built-in noise reduction system and the fact that the camera has a pretty small image sensor considering the use of its 20+ mp design.  These soft edges around objects may appeal to some people because they do appear smoother and somewhat more natural to the naked eye, but I generally prefer sharper edges and have explored using the \"Unsharp mask\" editing feature within the camera after shooting the image.  This definitely helps make the edges much, much crisper which I favor and find more satisfying, but what I don't like is that you have no control over how much the picture is sharpened when using the camera's Unsharp mask, while a photo editing program like \"Picasa\" or \"Photoshop Elements\"  allows you to determine how much sharpening you want to apply.  The camera's adjustment may be just right given the picture taken however as I have also experienced.  In any case, as a result of these available options, I can now sharpen any of my pictures as much as I like.  This has greatly improved the overall crispness of my images in spite of the aforementioned camera design limitations which is not to say you must do this for every picture you take.  It's a matter of preference, picture taken, and what your eye likes.HD Videos have come out quite good in bright light conditions and I have set the video camera settings to allow for auto scene detection to make focusing automatic based on the detected scene in view of zoom changes during the making of the video.  Zooming and focusing were easily accomplished.I have attached a 55mm UV filter to the lens threads with no problem, but make sure to get one with high quality glass, a well-made one that will not interfere with camera focusing and general detection of light.I have also taken high zoom (up about 40x) pics of the early morning and early night crescent or partial phase of the moon as well.  Again, I have found that taking pics of the partial phase (as opposed to full phase) of the moon has produced the best, (most satisfying for me) pics because of the additional shadows produced by the partial light on the edges of the craters which are clearly visible.  These shots are also much better defined after using the sharpening techniques noted above.  You can really see the crater edges in these pictures.In summary, in my opinion, this compact bridge camera is a \"specialty\" camera, intended mainly for the serious amateur and possible professional (as a second or third camera) who knows how to use the camera's inherent strengths to advantage and work around its shortcomings and is willing to explore its many settings and capabilities, including the manual modes.  I also think that those who want a simple point and shoot-type camera with a big zoom have many other choices that may be more satisfying and cost a lot less with a quicker learning curve.  So far, however, I very much like what this camera can do, how it handles, how it performs (under the scene conditions important to me), its zoom capabilities, its easy-to-select menu options, its construction, and what it can do successfully.  Yes, it appears the image sensor is \"too small\" and the max aperture too low at long zooms given what it tries to do under low light conditions, but what it can do successfully is quite amazing.RonNotes:I have now finally taken some very clear, fairly crisp, natural looking indoor close-up pics of my granddaughter using the \"P\" mode dial setting, ISO set to 160 (while letting the camera set aperture and shutter), contrast and sharpness set to \"+\", using the flash set to auto (but bumped up one notch from the middle setting intensity), noise reduction set to \"-\", focus point set to \"center\", and color mode set to \"Standard\". This was indoors during the day in the morning on a cloudy day in a mid-size room with all room lights turned on for assistance.  I was about 6 feet from the subject for most of the shots.  This set up was chosen to enable a lot of light on the subject and surroundings.  It resulted in the best indoor, daytime \"people\" pics I have achieved so far with this camera. So much so that I was also able crop down to just her face and this still resulted in the aforementioned clarity and appeal.  Little or no additional editing was needed.RonAdditional Notes:I have now taken \"people\" pics of my grandson using the \"P\" mode, ISO set to 160, with flash set to one notch above the normal setting, AND, most importantly, with the smile detection option set to \"medium smile\", and face detection enabled.  With these options set, the camera will auto detect the child's face, stay focused on the face, and if he (she) is smiling, then auto shoot the picture!  It really works!  All you have to do is keep the camera directed at the child's face.  The camera does the rest!  This was especially valuable for a child that is hard to capture when smiling as well as being very active.  It worked perfectly, allowing me to get about 9 pics with a great expression and smile while the child was not necessarily looking directly at the camera.  This is a very impressive convenience when taking pics of active children.I have also now taken pics of both the crescent phase of the moon and early evening (sunset) landscape shots using the \"S\" (or Shutter priority) mode (this mode is favored by the Thomas Wheeler, whose review, noted elsewhere, has been rated the \"Most Helpful\" Amazon review of this camera), keeping ISO under 400, and keeping a very steady hand while shooting with a slow shutter speed to balance the lower ISO settings in these situations.  Results were good, given these low light situations with these manual settings, in fact, much better for my taste than the allowing the camera to shoot these situations in the standard auto or scene modes.Additional note:More recently I am shooting predominantly in the \"A\" mode because this mode subtle allows adjustments to the aperture for most of the pictures I take in the Macro mode (with a low \"F\" stop setting for a shallow depth of field/blurred background), \"People\" mode (mid \"F\" stop setting), and Landscape mode (with a high \"F\" stop setting for an increased depth of field). Overall, this ability to change the aperture enables me to compensate not just for type of shot and subject but also with slight Exposure Value changes for varying lighting situations and stay away from high ISO values except under extreme conditions. The camera automatically adjusts shutter speed to compensate for the aperture and Exposure Value settings I choose. So don't be afraid to explore what this camera can do beyond the Scene mode and Auto modes.", "Date": "June 1, 2013"}, {"Title": "Awesome Zoom Range, so-so picture quality", "Author": "Brian Riechman", "ReviewID": "RVYUSXH736QFU", "Overall": "3.0", "Content": "I currently use a Panasonic G3 as my main camera and a Sony HX100v as my glorified point and shoot camera when I don't want to carry my entire kit around.  Figured I'd upgrade the Sony to this new one.  The 50x zoom is epic, I'm surprised how much more impressive the zoom is over the 30x on the HX100 I have.  Unfortunately all that zoom doesn't do you a lot of good if you can't get a decent photo out of it.  Took around 250 shots over the weekend and was fairly pleased with the camera until I popped the SD card into the computer.  What looks great on the tiny camera screen during playback is far less impressive on an IPS monitor.  I've shot in multiple modes, ISOs, and quality settings.  Only shots I've really been pleased with are the indoor shots using the flash, and nobody buys a super zoom camera for that.  Far too much noise in a majority of the shots, and the sharpness just isn't there.  I was also surprised how much bigger it was than the HX100.  Still fits my hand well, but my existing camera case was a bit tight.  Video seems good and the image stabilization works well, even hand held.  However at the end of the day the image quality on the stills just isn't up to par.  I'm sending it back and will stick with the HX100v, maybe I'll try the Canon SX50, it doesn't have quite so many megapixels crammed onto a tiny sensor.", "Date": "March 17, 2013"}, {"Title": "Amazing Zoom, Great Photos, Cool Features. Total Winner.", "Author": "Bradford Schmidt", "ReviewID": "R1XE8D950X1LGY", "Overall": "5.0", "Content": "Let me say this first: I'm an amateur photographer, and an average one at that (my wife is the skilled one in this department - I'm an audio guy). However, I'd expect that I'm who this is aimed at: someone who likes taking photos, enjoys good technology, understands what makes a good photo, and wants to go beyond what a point-and-shoot does without lugging around a dSLR with multiple lenses. So that's the perspective from which this is written.First of all, this is a bridge camera - looks like an dSLR but isn't (nor does it have interchangeable lenses), acts kinda like a point-and-shoot but delivers more. So to compare it to one my wife's Canon dSLR with a $600 macro lens on it is an exercise in futility. But even then... it almost holds its own, and in some ways I MUCH prefer it. I'll get to that in a minute.Sizewise, it's between the two types: it's not pocketable, but more compact and easy to carry than a dSLR. Its comfortable to hold, with the plastic construction striking a nice balance: it's light but doesn't feel cheap. Controls fall easily to hand, and it handles quite well in my hands as well as my 12-year-old's; anyone can pick it up and shoot easily. It's the perfect thing to take on a family outing, frankly.When you shoot, you can simply leave it in auto mode (Sony's calling the full auto Enhanced Superior Auto, which is actually aptly named) and let it do its thing, and even in this mode I find photo quality to be excellent. When you start opening up the toolbox of shooting modes though (and start using that amazing zoom), things get even better.It has a ton of feature, from those you'd expect to those you wouldn't: exposure and aperture priority; tons of preset programs like portrait, landscape, sport, night, etc; exposure bracketing; color saturation selection; optical image stabilization; selectable focus areas; a great panorama mode; very cool picture effects like miniaturize, partial color, and watercolor; 10 frame-per-second shooting at full 20 MP resolution. There are many more as well, so hit Sony's site if you want the full list.But the real star of the show is that lens. With 50x optical zoom you've got a camera with the equivalent of a 24mm to 1200mm zoom, which is ridiculous. At the wide end it jams way more into the photo than any of my other cameras, and at the long end, well, just wow. And that \"wow\" isn't even even considering the digital zoom portion which is WAY better than any I've used before. It's so good, in fact, that I don't disable it right off the bat, the way I always have in the past.For an example of the extreme difference in wide to zoom, take a look at the photos of the kiteboarder I put in the customer photo gallery. It's really staggering. That day I also shot some people standing down the beach - at wide, I could barely see them, at full zoom I could read the logo on the woman's sunglasses. Just so much fun.How's the quality? Unlike some of what I've read, I find the image quality to be wonderful. I keep hearing about artifacts, but honestly they just aren't an issue in most situations; if they are, you probably ought to be shooting with a dSLR instead. I've enlarged and printed quite a few photos with fantastic results and have no complaints there.Video mode is excellent as well, and I've had no issues. That amazing zoom comes into play again, getting closer and closer well past when you expect it to stop. Just wonderful, and loads of fun.Other neat things: macro mode is automatic; the LCD display slides and tilts, allowing shooting from well above or well below the camera (like over a crowd, etc); the flash is manually popped up, which I like (I'm aware this could be debatable, but I don't like it popping up unexpectedly); and there's a focus/zoom ring at the end of the lens (switchable between those modes) for those that grew up twisting the lens rather than pushing switches. I LOVE that.The only negatives I can think of: no RAW mode, which really is a bit of a drag at this price-point, but at least I don't burn up space using it; no auto-switching between monitors - you hit a button to switch between the rear LCD and viewfinder LCD and since I'm used to SLRs I keep putting it up to my eye and am surprised when there's no image; it uses a battery pack that won't allow AA batteries to be used in a pinch. That's IT.Overall, I love this thing. It's my go-to camera now (I even used the amazing zoom to figure out if a bump in the middle of the pond by my house was an alligator - it was) in almost any situation (if I don't want to lug something, I'll just use my phone), can be used fast and easy in standard mode, and provides tons of fun in the programmable and artistic modes.If you want the absolute finest photos possible, I suppose you should look at a multi-thousand dollar dSLR with multiple lenses.But if you want fantastic photos in an easy to use and carry camera that just happens to have a zoom lens that the NSA would find useful, grab the HX300.It's just awesome.", "Date": "June 18, 2013"}, {"Title": "Excellent camera for wildlife, concerts, sporting events and much more", "Author": "Yarii", "ReviewID": "R2K7N6JBDC2C4P", "Overall": "5.0", "Content": "<!--\n\nfunction fp_resizePlayerSpace(nsPrefix,w,h)\n{\t\n  try {\t\n    var ifrm = parent.document.getElementById(nsPrefix + \"movieFrameID\");\n    if (ifrm) {\t\n        var h2 = h + 35;\n        ifrm.style.height = h2;\n      }\n    } catch(err) {\n \n    } \n\n\n  if (h > 0) {\n      document.getElementById(nsPrefix + \"clipDiv\").style.height=h+\"px\";\n      document.getElementById(nsPrefix + \"videoPlaceholder\").style.height=h+\"px\";\n  }\n  else {\n      document.getElementById(nsPrefix + \"clipDiv\").style.height=\"\";\n      document.getElementById(nsPrefix + \"videoPlaceholder\").style.height=\"\";\n  }\n  document.getElementById(nsPrefix + \"flashcontent\").style.height=\"100%\";\n}\n\nfunction fp_rewriteDiv(nsPrefix,divName,html)\n{\t\n    document.getElementById(nsPrefix + divName).innerHTML=html;\n}\n\nfunction embeddingPopup(nsPrefix)\n{\n  alert(\"placeholder function for embedding code\");\n}\n-->\n\n\n<!--\n\nfunction cv_mo3KV9I6Q6UH0H8embeddingPopup(){\t\nalert(\"Embedding code will be displayed here.\");\n}\n\n-->\n\n\n\n\n\n\n\n\n\n<!--\nfunction cv_mo3KV9I6Q6UH0H8refresh_preplay() {\n\ndocument.getElementById(\"cv_mo3KV9I6Q6UH0H8chiDiv\").innerHTML = document.getElementById(\"cv_mo3KV9I6Q6UH0H8hiddenPre\").innerHTML;\n};\ncv_mo3KV9I6Q6UH0H8refresh_preplay();\n\n-->\n\n\n\n\n\n\n        // <![CDATA[\n\nvar cv_mo3KV9I6Q6UH0H8so;\t   \n\n\nfunction cv_mo3KV9I6Q6UH0H8loadSwf_Core(swfLocation, swfWidth, swfHeight, flashVersion, bgColor, swfParams, flashParams, embedAttributes) {\n\n  try {\n      cv_mo3KV9I6Q6UH0H8so = new SWFObject(swfLocation, \"cv_mo3KV9I6Q6UH0H8AMPlayerProd\", swfWidth, swfHeight, flashVersion, bgColor);\t   \n\n      for (var v in swfParams) {\n        cv_mo3KV9I6Q6UH0H8so.addVariable(v, encodeURIComponent(swfParams[v]));\n      }\n      for (var v in flashParams) {\n        cv_mo3KV9I6Q6UH0H8so.addParam(v, flashParams[v]);\n      }\n      for (var v in embedAttributes) {\n        cv_mo3KV9I6Q6UH0H8so.setAttribute(v, embedAttributes[v]);\n      }\n\n      cv_mo3KV9I6Q6UH0H8so.addVariable(\"swfEmbedTime\", new Date().getTime());\n\n      var agt = navigator.userAgent;\n       \n      var reFirefox = new RegExp(\"firefox/\", \"i\");\n      var regx = agt.split(reFirefox);\n      var ffVersion = 8;\n      if (regx[1]) {\n          var pts = regx[1].split(/[.]/);\n          ffVersion = parseFloat(pts[0] + \".\" + pts[1]);\n      }\n      var minorVersion = parseFloat(navigator.ap);\n      if ((navigator.appVersion.indexOf(\"Mac\")!=-1) || (ffVersion < 1.5)) {\n          cv_mo3KV9I6Q6UH0H8so.setAttribute(\"height\", swfHeight);\n          cv_mo3KV9I6Q6UH0H8so.setAttribute(\"width\", swfWidth);\n          cv_mo3KV9I6Q6UH0H8so.addVariable(\"oldFirefox\", \"1\");\t     \n      }\n\n      if (cv_mo3KV9I6Q6UH0H8so.write(\"cv_mo3KV9I6Q6UH0H8flashcontent\")) {\n          fp_resizePlayerSpace('cv_mo3KV9I6Q6UH0H8', \n                               320, \n                               283);\n      }\n      else {\n          var nsPrefix = 'cv_mo3KV9I6Q6UH0H8';\n\n          fp_resizePlayerSpace(nsPrefix, 0, 0);\n          fp_rewriteDiv(nsPrefix, \"flashcontent\", '<br/>To view this video download <a target=\"_blank\" href=\"http://www.macromedia.com/go/getflashplayer\" target=\"_top\">Flash Player</a> (version 9.0.115 or higher)');\n      }\n  } catch(err) {\n      fp_resizePlayerSpace('cv_mo3KV9I6Q6UH0H8', 0, 0);\n  }\n  return false;\n}\n\n\n\nfunction _cv_mo3KV9I6Q6UH0H8loadSwf(movieID, playerVersion) {\n    var swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/20120510035744301/AMPlayer._V148501545_.swf\";\n    var swfWidth = \"320\";\n    var swfHeight = \"100%\";\n    var flashVersion = \"9.0.115\";\n    var bgColor = \"#FFFFFF\";\n\n    var swfParams = {};\n    var flashParams = {};\n    var embedAttributes = {};\n    swfParams.amazonPort = \"80\";\n    swfParams.allowFullScreen = \"true\";\n    swfParams.telemetrySubPageType = \"VideoReview\";\n    swfParams.nsPrefix = \"cv_mo3KV9I6Q6UH0H8\";\n    swfParams.locale = \"en_US\";\n    swfParams.logUrl = \"gp/mpd/l\";\n    swfParams.canResize = \"1\";\n    swfParams.autoPlay = \"1\";\n    swfParams.sessionId = \"000-0000000-0000000\";\n    swfParams.marketplaceID = \"ATVPDKIKX0DER\";\n    swfParams.salign = \"LT\";\n    swfParams.preset = \"detail\";\n    swfParams.mediaObjectId = \"m1OAVZBLYLL7A1\";\n    swfParams.autoPlayTimer = \"\";\n    swfParams.mediaObjectIDList = \"m1OAVZBLYLL7A1\";\n    swfParams.playIsUserGenerated = \"1\";\n    swfParams.enableShare = \"0\";\n    swfParams.permUrl = \"gp/mpd/permalink\";\n    swfParams.telemetryPageTypeID = \"R2K7N6JBDC2C4P\";\n    swfParams.xmlUrl = \"http://www.amazon.com/gp/mpd/getplaylist-v2/m1OAVZBLYLL7A1/000-0000000-0000000\";\n    swfParams.amazonServer = \"www.amazon.com\";\n    swfParams.scale = \"noscale\";\n    flashParams.allowFullScreen = \"true\";\n    flashParams.salign = \"LT\";\n    flashParams.bgcolor = \"#FFFFFF\";\n    flashParams.allowScriptAccess = \"always\";\n    flashParams.quality = \"high\";\n    flashParams.wmode = \"transparent\";\n    embedAttributes.title = \"Flash Player\";\n\n    if (movieID){\n      if (playerVersion == '3'){\n        swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/20120510035744301/AMPlayer._V148501545_.swf\";\n        swfParams.mediaObjectIDList = movieID;\n      } else {\n        swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/legacy/20101014901/AMPlayerProd._V197491872_.swf\";\n      }\n      swfParams.xmlUrl = \"http://www.amazon.com/gp/mpd/getplaylist-v2/\" + movieID + \"/000-0000000-0000000\";\n      flashParams.wmode = \"transparent\";\n      swfParams.autoPlay = \"1\";\n    }\n\n    if (document.getElementById('cv_mo3KV9I6Q6UH0H8duration')) {\n      document.getElementById('cv_mo3KV9I6Q6UH0H8duration').style.display='none';\n    }\n    cv_mo3KV9I6Q6UH0H8loadSwf_Core(swfLocation, swfWidth, swfHeight, flashVersion, bgColor, swfParams, flashParams, embedAttributes);\n\n  return false;\n}\n\nfunction cv_mo3KV9I6Q6UH0H8loadSwf(movieID, playerVersion) {\n   return _cv_mo3KV9I6Q6UH0H8loadSwf(movieID, playerVersion);\n}\n\n\n\t\n\t\t// ]]>\n\t\n\n<!--\n\nfunction cv_mo3KV9I6Q6UH0H8newHeight(h)\n{\t\n    fp_resizePlayerSpace('cv_mo3KV9I6Q6UH0H8', 0, h);\n}\n\nfunction cv_mo3KV9I6Q6UH0H8resetPlayer(w,h,bw,cc) {\n  cv_mo3KV9I6Q6UH0H8newHeight(h);\n\n  cv_mo3KV9I6Q6UH0H8so.addVariable(\"resetBandwidth\", bw);\n  cv_mo3KV9I6Q6UH0H8so.addVariable(\"cacheCode\", cc);\n  cv_mo3KV9I6Q6UH0H8so.setAttribute(\"height\", h);\n  cv_mo3KV9I6Q6UH0H8so.setAttribute(\"width\", w);\n  cv_mo3KV9I6Q6UH0H8so.write(\"cv_mo3KV9I6Q6UH0H8flashcontent\");\n}\n\n-->\n\n\n\n\n\n\n\n\nvar cv_mo3KV9I6Q6UH0H8RollOverImg = new Image();\ncv_mo3KV9I6Q6UH0H8RollOverImg.src = \"http://ecx.images-amazon.com/images/I/81jK82yBqAS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play-active,BottomLeft,130,-12_CR0,0,0,0_.png\";\n\nvar cv_mo3KV9I6Q6UH0H8preplay = document.getElementById('cv_mo3KV9I6Q6UH0H8preplayImageId');\nif (cv_mo3KV9I6Q6UH0H8preplay) {\n  cv_mo3KV9I6Q6UH0H8preplay.onmouseover = function() {\n    cv_mo3KV9I6Q6UH0H8preplay.src = \"http://ecx.images-amazon.com/images/I/81jK82yBqAS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play-active,BottomLeft,130,-12_CR0,0,0,0_.png\";\n  }\n  cv_mo3KV9I6Q6UH0H8preplay.onmouseout = function() {\n    cv_mo3KV9I6Q6UH0H8preplay.src = \"http://ecx.images-amazon.com/images/I/81jK82yBqAS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play,BottomLeft,130,-12_CR0,0,0,0_.png\";\n  }\n  \n  \n  var node = cv_mo3KV9I6Q6UH0H8preplay.parentNode;\n\n  var cv_mo3KV9I6Q6UH0H8currentClick = node.onclick;\n  node.onclick = function () {\n    var head = document.getElementsByTagName(\"head\");\n    if (head[0]) { \n      var logTag = document.createElement('script');\n      logTag.type = \"text/javascript\";\n      logTag.src = \"/gp/customer-media/du/log.html?ie=UTF8&p=CustomerImage&s=CustomerVideoPlay\";\n      head[0].appendChild(logTag);\n    }\n\n    if (cv_mo3KV9I6Q6UH0H8currentClick) {\n      return cv_mo3KV9I6Q6UH0H8currentClick();\n    }\n  }\n}\n\n\n\n\n Length:: 0:42 MinsI've written numerous camera reviews for Amazon since 2008, all in more detail than this one.  What this HX300 excels at is 50X optical zoom, even the 100X Clear Image zoom isn't half bad. There isn't much more technical detail I can say about this as reviewers before me have done a fine job of that.**********NOTE #1:  My video showing 50X zoom was taken at 1080 MP4 as Amazon doesn't support AVCHD uploads - I made another movie right after, same location, in 1080 AVCHD and comparing them on my PC, I think the MP4 appeared to be slightly better quality. Cloudy, dreary, windy day. BTW, you can zoom using the manual ring or the W/T toggle during the movie mode. I toggled. I did not have the wind buffer turned on but I should have since the wind was strong at the video's end. The camera was hand-held, I used the EVF and my forehead to steady the camera, so not too bad considering no tripod. One thing I want to add after seeing this video HERE, and going to full-screen mode it looks HORRIBLE on Amazon's full-screen mode! Nothing at all like it appears full-screen on my own PC, or streaming my YT video to my TV -- so it must have something to do with Amazon, and not the camera's movie quality. (I also uploaded this video to YouTube, I am Yarii41 on YT if you want to do a search for it).NOTE #2: I used this camera to upload another video for this item: Smart Solar Aquatic Range Floating Lily Solar Fountain This video I used the lowest movie setting, MP4 VGA and it turned out better quality  for an Amazon upload than the video above. I remembered to turn on the wind buffer this time!**********This is the first bridge camera I've fallen in love with. It's larger but lighter weight than others, yet the build quality hasn't suffered. It has a lithium-ion battery in place of 4 AA batteries, which helps with the weight and makes the battery door a breeze to close. It has good battery life.  Shutter response/focusing/recovery to take the next shot is FAST.As long as you don't mind toting around a large camera, this will work for beginners who want more than a basic Point & Shoot, to more skilled photographers who don't want to carry a DSLR. With a choice of Intelligent or Superior Auto or P/A/S/M this works for a beginner who eventually wants to learn about Shutter Priority, Aperture Priority, Full Manual, Etc.  What this camera doesn't have is RAW. That's not a big deal to me because I've never used it, but it may be to YOU and a camera in this price range usually has the ability to shoot RAW.My major complaint is Sony (as well as other manufacturers) think we want higher MP's but they don't increase the sensor size. For this having 20 MP, the 1/2.3 sensor is too small, but having the Bionz CMOS processor seems to help.  As a reference I also reviewed the new Sony H200 which has the same size sensor but a Super Had CCD processor and that camera is so much slower with worse images. Of course, that camera is half the price, too.Here is a bag that works:  Case Logic DCB-304 High/Fixed Zoom Camera Case (Black)No camera is perfect, I've owned over 50 and haven't found the perfect one yet. This one comes close for a bridge camera.", "Date": "May 4, 2013"}, {"Title": "Super for zoom, good as basic camera", "Author": "Ardeal \"Emi\"", "ReviewID": "R36V51M4NE1MPF", "Overall": "5.0", "Content": "First, I am a Sony Digital fan. In 2001 I purchased my first Sony Digital Camera, a 3.2MP Mavica with Carl Zeiss Lens and I thought it served me well for 5 years before moving into semi-pro DSLR cameras with Nikon (D200 and later D7000). Once you step into DSLR-s, it's hard to be a fan of Point-and-shoot cameras. However, this year, I purchased 2 Sony point-and-shoot cameras for my family (the HX10V and WX-50) and received this one for review from Amazon. I was not going to go back to point and shoot - until I got this camera. It is not a perfect camera, yet it has some unbeatable features (The Zoom for pictures and video) that would be very expensive in the DSLR option. I wanted to use it frequently during at least a month before settling on a review for Amazon.NOTE ON THE (AMAZON) AVERAGE STARS for this camera.If you are like me, you look for the average number of stars for Amazon products. In April 2013, this camera had an average 3.5 stars while the HX200 (last year's model) had an average of 4.5 stars despite being an inferior camera in my opinion (no GPS or flip-out screen on the HX300, yet more than 2X better zoom). At the end of May 2013, the HX300 moved up to 4 stars. Even on Snapsort (a site for camera comparisons), the HX300 now scores 1 point  higher than the HX200 (a month ago, the HX200 scored higher).MUST HAVE ACCESSORY: A 55-mm UV filter. I recommend Hoya 55mm HMC UV Digital Multi-Coated Slim Frame Glass Filter. I accidentally fell with my camera, and the only thing that cracked was this filter, the lens was fine. Got a replacement right away.3 REVIEWING ITEMS and my (subjective) grades:BASIC PICTURES - 3.5 STARS. I looks at some other reviews that praised the quality of the pictures yet I was surprised at the large amount of bad pictures I took. And I used other point and shoot cameras for comparison. The Intelligent Auto can be very misleading - I can be zooming in on someone 50 feet away and the info reads it as a macro. I would not recommend this camera to a person new to photography - it is also relatively bulky. Once I adjusted the camera settings manually, I was able to take better pictures. I am also not impressed with the panoramic mode and the way pictures are combined - I believe some less expensive cameras are better at that. One last thing on this topic: in my opinion, the 350 pixels per inch for high quality is nowhere close to cameras with a larger sensor that have 300 or less PPI.SUPER-ZOOM - 5 STARSFor a DSLR to have this type of zoom range, you may have to spend thousands. I can finally took nice pictures of the moon (I uploaded a picture under customer images) and of birds from far away - especially if I use a tripod. I was able to take relatively good pictures of my son playing soccer even right after sunset. Some of the reviewers are disappointed with the quality of pics at full zoom. I got my lesson while taking a picture of the moon: even though I used a tripod, I could see the image shaking from even the lightest vibration and wind gust when focused on the moon. I placed my camera on 2 second delay (with tripod of course) to get the best results. The auto-image stabilizer really does a great job - otherwise all pics would be shaken. Every time you add to the zoom, chances for shake are increased exponentially. That is why cameras such as the wx-50 can have 4.5 stars even though the zoom is only 5X.VIDEO - 5 StarsThe most memorable experience was when I took this camera to some choir practices and performances held at a mega church. During practice, I held it in my hands. During performance, I used a tripod. I can say that both videos look great on a 50-in TV. I sat in rows 6-7, in front of me there was some open 12-15ft.of  space, then about 10 stairs, then some more space (20-25ft) for the performance area, and only in the back there were the bleachers for the choir. I could film the entire choir (each row had about 35 kids) at once, then zoom in to focus on just 1 or 2 faces at one time. I really felt like a kid in candy land with this feature. The focus may not work 100% of the time right away, yet it is very quick to adjust. I definitely prefer this camera even over my digital Camcorder. You can even take pictures while recording video.TOTAL: 4.5 STARS - as a basic camera, I would give it 3-3.5 Stars. As a super-zoom camera for those who understand how to make manual adjustments, I would give it 5. I have to admit - I've been struggling for a month whether this is a 4 star or 5 star product. The limited focus in low light pictures made me go for the 4.UPDATE 6/10/13 After playing with the multiple frame feature at the pool, I have to say that I'm impressed with the 8-10 frames per second feature. I asked my son to do some flips while jumping in the pool and they turned out great - even on a 50-in TV. One neat thing about the camera: you can go through the multiple frames by simply tilting your camera after you take the pictures. I am so impressed with the quality of the pictures (true - it is in broad daylight, not in low light settings) that I upgrade the camera (yet again) to 4.5 stars...", "Date": "May 28, 2013"}, {"Title": "Great camera", "Author": "Carl Galloway", "ReviewID": "R1VVS58P8PKZV7", "Overall": "5.0", "Content": "I bought the camera from Amazon and I bought a VCT-VPR1 Remote Control Tripod from Sony to go with it.  I highly recommend that you buy both as it is much easier to focus on distant objects with the remote and take pictures without moving the camera.  I have taken great shots of the moon and Jupiter with its moons.  I use the camera mostly for birds and scenery shots and I am extremely pleased with all my pictures.", "Date": "April 1, 2013"}, {"Title": "Big Expectations---Poor Results", "Author": "Capt. Aero", "ReviewID": "R3DLFQVZ1MT0FX", "Overall": "2.0", "Content": "I've used and enjoyed good performance from the three Sony HX-Series superzoom models that came before the HX300. I tested this new camera for five days and tried all I could, but the photos and videos were only mediocre at best and mostly not worth keeping. Sony found last year what the limit was for Megapixels on a small sensor and also for zoom power, with the HX200V. This year, they've exceeded that limit with the HX300. I sent mine back and bought another HX200V as a backup camera, as I know it will perform very well. I suggest that anyone who is interested in the HX300, do the same. It's hard for me to imagine how others here have given it five stars. I wonder if they were actually testing the same camera?The focusing ability of the HX300 in lower light levels and at high points in the zoom range is slow and unsteady, while my HX200V and the two predecessor models excel at that. I tested the HX300 in good sunlight on subjects I'd shot a short time before with my HX200V. I got some passably-good photos with the HX300, but with many types of subjects, they were very poor. The HX200V photos of many of these subjects had come out nicely and with a minimum of effort. The HX200V shoots outstanding 60p video, but when at the upper end of the zoom range, the HX300 video looks about like standard-definition. Do yourself a favor and pass up this one.Steve McDonald", "Date": "April 8, 2013"}, {"Title": "Focus Ring Better Than Chocolate", "Author": "David Mace", "ReviewID": "R3SBT10DK7KDSO", "Overall": "4.0", "Content": "After a shipping error, I went out to buy the Canon SX50 that I had ordered from a store front... and ended up buying this, instead.What truly sold me on this camera was the big focus ring around the outside of the lens.  It's not mechanically attached to the optics; it's more like a jog/shuttle dial, and has wonderful tactile feedback to it.  Unlike virtually any 'autofocus' capable cameras, where manual focus can be 'touchy', small, deliberate adjustments on the ring make small adjustments to the focus (or zoom, in auto-focus mode).  Do yourself a favor and physically touch one of these, if you're shopping for 'super duper zoom' cameras.  Try it.  You'll understand.  The Canon SX50 manual focus is actually done with tiny thumb ring around the menu buttons, if you can lay hands on that, to compare.The image stabilization is pretty nifty.  Hand-held, zooming way in on a 'Bighorn sheep' on a hillside, I managed to fill the frame with its face.  The focus was a little softer than I wanted, but it was a lot better than I expected on a 50x zoom of something over 100 yards away from me.  On a tripod, with more careful, manual focus, it could only be better.I'm knocking one star off for the buggy firmware and lousy user manual and online documents for the camera.  It got stuck in 'wide aspect' shooting mode, and hid all of the settings to change it back, until I reset the camera from scratch.  I had to wait until I was home, with an internet connection to figure out that it was borked, and needed that reset.  The manual it comes with is thick, only because it comes in lots of languages, all basically pointing at a picture of the camera, with the controls labeled, and telling you how to put the battery in.  That was kind of annoying.  If this was some sort of 'user friendly' mode to hide 'excessive details' from users, it did the opposite, and wasn't covered in the manual.", "Date": "November 4, 2013"}, {"Title": "Best of the SuperZooms", "Author": "J. Fox \"jfox\"", "ReviewID": "R2MRQE6P20ABVL", "Overall": "5.0", "Content": "The main reasons I chose the Sony HX300 over Canon, Panasonic, or Fuji was the resolution detail and the manual focus ability. Plus the Sony button layout is much more user friendly than the others in it's class. Check the resolution charts on TechRadar and you will see the Sony has the highest resolution detail of them all. What really sold me was the detail in bird feathers when comparing photos taken by the SX50 and the HX300. Take a look at some examples of what the HX300 can do in the hands of a good photographer and you'll see what I mean: [...]", "Date": "October 18, 2013"}, {"Title": "great camera", "Author": "Elizabeth Hoerman", "ReviewID": "R3UNBZOZJZUB5N", "Overall": "5.0", "Content": "This is a great camera.  I was worried that the pictures taken with the extreme zoom would not be good quality.  No worries now, all the pictures turn out fantastic.  It is a good camera for those like me who are wanting more than just a point and shoot but not ready to take the plunge buying an SLR camera.", "Date": "July 15, 2013"}, {"Title": "Not a good upgrade from Sony DSC H50", "Author": "Jhonny Alfredo Lugo, JL", "ReviewID": "RRKXH4XU58G3E", "Overall": "2.0", "Content": "Hobbyist photographer I have been using with great satisfaction a Sony DSC H50 for about 4 years (15x, 9.1 MP, Super Steady Shot). Looking for an upgrade decided to buy a DSC-HX300. During testing found a quite powerful and easy to use camera; the manual focus is handy and works very well. It is a far better and advanced product when compared with my old H50...however is unable to take better pictures. Tried different settings, no better results at all. Note am not saying is not a good camera; \"good\" and \"bad\" are relative, it depends a lot from where the buyer is upgrading from. In my case it just did not meet the expectations. Tip: with Nikon D3200 priced $100 more(D3200 also failed to take better pictures than my H50 after 10 days of trial) and Sony A65 priced $200 more, the HX300 seems seriously overpriced.", "Date": "December 10, 2013"}, {"Title": "The only camera you really need", "Author": "ARI J COMET", "ReviewID": "RPBOKPNJIDX2X", "Overall": "5.0", "Content": "Friends/family tell me how much they love their DSLR, but then you look at the cost of money they spent on the body, the lenses and so forth.  We didn't want to make that kind of financial investment, but lets face it sometimes the camera on your phone can't get \"close enough\" to the action.  Our requirements were simply-- a good quality camera that had a good zoom (better than a point and shoot) but also could take action shots, maybe some other special shots here or there, etc.My wife/I use our phones primarily for most day-to-day functions.  However we wanted to take special event photos with something that could do better, higher res, better optics, etc.  But we didn't want to go down the rabbit hole of a DSLR-- plus neither of us really know much about things like F-stops and apertures (I took some classes years ago, but I didn't retain much).  So we wanted a bit of a \"dummy proof\" option, but that could still have fun in \"manual modes\" if we ever wanted to explore.This camera is really nice for all of those ideas above-- it has basic point-to-shoot modes, automatic for just general use.  The next level is to take a photo in a mode (such as firework mode, or similar).  And then from there plenty of manual adjustment modes to play with too!  Sure you are limited to the lens on it, but we have been so thrilled with it thus far.  I'm a huge Sony brand fan, love their interface on the camera and their devices in general.  My only complaint about the camera is the slow render time between photos sometimes.  Otherwise, very pleased and would recommend highly as a really nice bridge camera.EDIT-- Check out more photos taken with this device here in my mini-review:[...]", "Date": "October 13, 2013"}, {"Title": "I have owned the Sony DSC-HX300 twice.", "Author": "David L. Winters", "ReviewID": "RAFH9HSAJY25Q", "Overall": "5.0", "Content": "First of all I want to say that I am a amaturer photographer who prefers power zoom point and shoot cameras. I have owned several film and digital SLR's in the past and wasn't impressed with the cost of the lenses and the cameras. I have owned alot of power zoom cameras mostly Panasonic and Sony. I have had two Sony's so far......The HX100 which I still have and now for the 2nd time the HX300. I sold the first HX300 to my sister in law. I tried playing with some of the new SLR cameras....NIkon D3200 and D5300 and the Canon SL1 and the T5i. I just wasn't impressed with the cost of the cameras and additional lenses. I think the Sony HX300 is capable of so much for such a low price ($418.00 compared with the cost of the SLR's). They run anywhere from $540 to over $1000 by the time you buy a additional zoom lens. The HX300 is great in low light situations because it can go all the way up to ISO 12800. The SLR's can do that for a much higher price for the bigger sensors. The HX300 takes great videos as well. I would recommend this camera because I believe its the best in its class compared to the Canon SX50 and the Panasonic FZ70 which I did own. The Nikon P520 is competition as well. These are all great cameras but I prefer the HX300 over all of them. One thing I would recommend.....Take a look at all the features and specs and do a comparisom with other power zoom cameras and you will see this camera ia a powerhouse of features. The only thing lacking is GPS which I don't want because it will drain the batteries in cameras fast.", "Date": "January 28, 2014"}, {"Title": "Has versatility, function, & performance for the price!", "Author": "Michael P", "ReviewID": "R2YLNYGEPRT1YC", "Overall": "5.0", "Content": "This is a very useful and versatile bridge camera for both the point-and-shoot people as well as the enthusiasts. It has the feel of a full-size DSLR but is a bit smaller. The most outstanding feature is its amazing 50x zoom lens (1200mm equivalency), which is capable of zooming like an expensive telescope - bringing far-off objects that cannot be seen by the naked eye, into full view in the frame.It's light-weight, Zeiss lens, image-stabilization, fast auto-focus, and can be used in full-auto features or manual adjust of all key features aperture, shutter, ISO, etc. The lens is 24-1200mm optical. The digital zoom causes images to be a bit soft or grainy, but the digital zoom is really unnecessary when the optical zooms 50X to 1200mm. It records video up to 1920x1080 and can snap HD photo while video recording.It lacks a few of the features possessed by its 30x predecessor (DSC-HX200), but it makes up for that shortcoming with its 50x zoom. And it performs well even with the smaller 1/2.3 sensor. It has a fixed lens and can't support interchangeable lens -- but you won't need other lens with its 24-1200mm range. I think it's a great camera for the money.If you need convincing, read the online reviewers and watch the Youtube vids. This camera has the qualities of both the point&shoot; and the entry-level DSLRs. In low-light, you may need a tripod or a steady hand; in bright sunny light, it's a push-over: sharp, crisp images along with the option of blurring the backgrounds intentionally.I recommend these companions with this HX300 camera: Sony VF-55MPAM lens protective filter;  Sony NP-BX1/M8 Lithium-Ion X Type Battery and/or Wasabi  Charger# KIT-BTR-NPBX1-LCH-NPBX1-01; and Lowepro Adventura-120 Camera Bag w/soft orange velour lining and perfect fit for HX300, with compartments for extra batteries, SD cards, lens cloth, etc .ALSO: I found the User's GUIDE  for HX300 -- it's a great help, better than the manual I think. Here is the link to download GUIDE:[...]", "Date": "December 17, 2013"}, {"Title": "Image Quality Not As Good as Sony HX100", "Author": "D. Hatcher \"4jenesaispas\"", "ReviewID": "R2K63HU4JFF1MC", "Overall": "2.0", "Content": "Purchased and returned because the image quality is not as good as Sony's HX100 which I own. Images at long zoom ranges are generally of poor quality. Disappointed that image quality is not better.", "Date": "April 17, 2013"}, {"Title": "Amazing", "Author": "Franz", "ReviewID": "RDVQ2WOW47N78", "Overall": "5.0", "Content": "This is an amazing Camera. Nothing like I experienced before. No blurry or unfocused pictures. The zoom is just incredible. The video HD quality is superb. Very smooth playback on my quad core HP. The only complaint which really has no impact on the performance of the camera but I wish that the software installation process was less time consuming for the video portion and DVD burning. All in all I am extremely happy especially since I have started using the camera on 3-15-2013 and people that pre-ordered this camera directly from the Sony site paid more money and are still waiting for the camera. Amazon rules.", "Date": "March 17, 2013"}, {"Title": "Amazing Quality.", "Author": "Barbara Wrede", "ReviewID": "R3IA483H68Z6UU", "Overall": "5.0", "Content": "I was so excited for this camera to become available.  I currently shoot with a sony DSLR, but I wanted something to take with me when I didn't want all my lenses.  It just came last night so I didn't get to use it much.  The tilting ability of the LCD is an awesome feature.  Lots of bells and whistles, but it is crazy to see the zoom lens seem to come out of nowhere in this device.  I know some of the reviews state that it is heavy, but being used to the sony dslr, this seems to be the perfect weight.  I wanted something substantial for control, but not heavy to hold.Absolutely love it!", "Date": "March 15, 2013"}, {"Title": "A Dream Camera For Me!", "Author": "Dr. Johnson C. Philip \"Author of over 100 boo...", "ReviewID": "RW04HMH59V2OH", "Overall": "5.0", "Content": "I am a compulsive photographer, and started shooting people and objects when I was 15. A friend presented me with my first digital camera when I was 45, and life has never been the same again. That was Sony Mavica, and it used 3.5 inch floppy disks to store pictures. The highest resolution was only 1.2 mega pixels, but with its 16x optical magnification it did wonders for me.This is my fourth digital Camera in 15 years. In fact the moment I read the specification and the Sony name, I sold my non Sonly Digital Single Lens Reflex (DSLR) camera, removable lens, and telephoto lens (puchased for a futune) at a loss and bought this model. Once again, life has never been the same again after I bought it.Here are some of the features*** It offer 20+ Mega-pixel resolution, something that can do wonders*** It offer and unbelievable 50x OPTICAL magnification, again something that can do wondersCare to Take:*** The camera offers so much in terms of resolution and optical magnification that most users need to learn afresh that a powerful tool can be used in unbelievable way. Do explore all the possibilities*** Do use a monopod or a tripod for shooting at magnifications greater than 20xUniqueness:*** High resolution*** Super-high magnification*** Ability to keep the flash off in any and every situation (a manual switch is provided)*** All other standard software features are available*** Very light and ergonomic designRecommendation:*** If ease of use, high resolution, and high optical magnification is your need, then this is THE camera for you*** It is very economically pricedI have been using this Camera now for 3 months and for me it is dream come true.", "Date": "September 15, 2013"}, {"Title": "Not perfect but a great all around camera", "Author": "Shane O. Laake \"camera nerd\"", "ReviewID": "R2NQHS5T83ODK1", "Overall": "4.0", "Content": "As much as I'd love to have a perfect superzoom camera that can do everything, I know there are compromises inherent with size, cost, and image quality.  There's only so much Sony's software and hardware wizardry can do to combat that, though they do manage to throw the kitchen sink of features in there.  All in all, I really like this camera.Having lugged around lenses that rival newborns in size and weight (and even in out of pocket costs), I've learned to appreciate compact, lightweight, and affordable solutions (all relative).  With this in mind, I understood there would be some trade offs.  All three meant using a smaller more cost effective sensor, which means smaller pixels, and a greater challenge to take pictures at night or accommodate a faster shutter (via raising ISO).  Likewise all three mean using a lens with a variable aperture, which gets a bit small (higher F#) on the telephoto end, which again hinders pictures in low light or requiring a fast shutter.  Only magic can fix these inherent challenges, and absent of that I expect these issues.As for the rest, well it's all rather well done.  In good light this camera takes great images.  On clear days the 50x zoom is amazing, but do know if there's haze, that's a lot of haze between you and your distant subject being captured in your images (again only magic can fix that).  The panorama mode is amazing, movies solid, and the video is rather nice.  Ergonomics are solid, and battery life, while not ideal, is good enough.Ideally I'd like to see a better 12mp sensor that greatly enhances high ISO performance, but I understand consumer behavior and the push for more MP.  Sony does an OK job of addressing things with software, but I'd rather see a move towards \"ultra pixels\" (to steal a term from HTC).  This and the lack of an articulated screen cause the camera to lose a star.These opportunities aside, I wouldn't hesitate to recommend this camera.", "Date": "May 3, 2013"}, {"Title": "Great Point and Shoot Camera", "Author": "Truth Be Told", "ReviewID": "R1YLSPTZ5QP5RP", "Overall": "5.0", "Content": "<!--\n\nfunction fp_resizePlayerSpace(nsPrefix,w,h)\n{\t\n  try {\t\n    var ifrm = parent.document.getElementById(nsPrefix + \"movieFrameID\");\n    if (ifrm) {\t\n        var h2 = h + 35;\n        ifrm.style.height = h2;\n      }\n    } catch(err) {\n \n    } \n\n\n  if (h > 0) {\n      document.getElementById(nsPrefix + \"clipDiv\").style.height=h+\"px\";\n      document.getElementById(nsPrefix + \"videoPlaceholder\").style.height=h+\"px\";\n  }\n  else {\n      document.getElementById(nsPrefix + \"clipDiv\").style.height=\"\";\n      document.getElementById(nsPrefix + \"videoPlaceholder\").style.height=\"\";\n  }\n  document.getElementById(nsPrefix + \"flashcontent\").style.height=\"100%\";\n}\n\nfunction fp_rewriteDiv(nsPrefix,divName,html)\n{\t\n    document.getElementById(nsPrefix + divName).innerHTML=html;\n}\n\nfunction embeddingPopup(nsPrefix)\n{\n  alert(\"placeholder function for embedding code\");\n}\n-->\n\n\n<!--\n\nfunction cv_mo2VI1M6LDEPFHCembeddingPopup(){\t\nalert(\"Embedding code will be displayed here.\");\n}\n\n-->\n\n\n\n\n\n\n\n\n\n<!--\nfunction cv_mo2VI1M6LDEPFHCrefresh_preplay() {\n\ndocument.getElementById(\"cv_mo2VI1M6LDEPFHCchiDiv\").innerHTML = document.getElementById(\"cv_mo2VI1M6LDEPFHChiddenPre\").innerHTML;\n};\ncv_mo2VI1M6LDEPFHCrefresh_preplay();\n\n-->\n\n\n\n\n\n\n        // <![CDATA[\n\nvar cv_mo2VI1M6LDEPFHCso;\t   \n\n\nfunction cv_mo2VI1M6LDEPFHCloadSwf_Core(swfLocation, swfWidth, swfHeight, flashVersion, bgColor, swfParams, flashParams, embedAttributes) {\n\n  try {\n      cv_mo2VI1M6LDEPFHCso = new SWFObject(swfLocation, \"cv_mo2VI1M6LDEPFHCAMPlayerProd\", swfWidth, swfHeight, flashVersion, bgColor);\t   \n\n      for (var v in swfParams) {\n        cv_mo2VI1M6LDEPFHCso.addVariable(v, encodeURIComponent(swfParams[v]));\n      }\n      for (var v in flashParams) {\n        cv_mo2VI1M6LDEPFHCso.addParam(v, flashParams[v]);\n      }\n      for (var v in embedAttributes) {\n        cv_mo2VI1M6LDEPFHCso.setAttribute(v, embedAttributes[v]);\n      }\n\n      cv_mo2VI1M6LDEPFHCso.addVariable(\"swfEmbedTime\", new Date().getTime());\n\n      var agt = navigator.userAgent;\n       \n      var reFirefox = new RegExp(\"firefox/\", \"i\");\n      var regx = agt.split(reFirefox);\n      var ffVersion = 8;\n      if (regx[1]) {\n          var pts = regx[1].split(/[.]/);\n          ffVersion = parseFloat(pts[0] + \".\" + pts[1]);\n      }\n      var minorVersion = parseFloat(navigator.ap);\n      if ((navigator.appVersion.indexOf(\"Mac\")!=-1) || (ffVersion < 1.5)) {\n          cv_mo2VI1M6LDEPFHCso.setAttribute(\"height\", swfHeight);\n          cv_mo2VI1M6LDEPFHCso.setAttribute(\"width\", swfWidth);\n          cv_mo2VI1M6LDEPFHCso.addVariable(\"oldFirefox\", \"1\");\t     \n      }\n\n      if (cv_mo2VI1M6LDEPFHCso.write(\"cv_mo2VI1M6LDEPFHCflashcontent\")) {\n          fp_resizePlayerSpace('cv_mo2VI1M6LDEPFHC', \n                               320, \n                               283);\n      }\n      else {\n          var nsPrefix = 'cv_mo2VI1M6LDEPFHC';\n\n          fp_resizePlayerSpace(nsPrefix, 0, 0);\n          fp_rewriteDiv(nsPrefix, \"flashcontent\", '<br/>To view this video download <a target=\"_blank\" href=\"http://www.macromedia.com/go/getflashplayer\" target=\"_top\">Flash Player</a> (version 9.0.115 or higher)');\n      }\n  } catch(err) {\n      fp_resizePlayerSpace('cv_mo2VI1M6LDEPFHC', 0, 0);\n  }\n  return false;\n}\n\n\n\nfunction _cv_mo2VI1M6LDEPFHCloadSwf(movieID, playerVersion) {\n    var swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/20120510035744301/AMPlayer._V148501545_.swf\";\n    var swfWidth = \"320\";\n    var swfHeight = \"100%\";\n    var flashVersion = \"9.0.115\";\n    var bgColor = \"#FFFFFF\";\n\n    var swfParams = {};\n    var flashParams = {};\n    var embedAttributes = {};\n    swfParams.amazonPort = \"80\";\n    swfParams.allowFullScreen = \"true\";\n    swfParams.telemetrySubPageType = \"VideoReview\";\n    swfParams.nsPrefix = \"cv_mo2VI1M6LDEPFHC\";\n    swfParams.locale = \"en_US\";\n    swfParams.logUrl = \"gp/mpd/l\";\n    swfParams.canResize = \"1\";\n    swfParams.autoPlay = \"1\";\n    swfParams.sessionId = \"000-0000000-0000000\";\n    swfParams.marketplaceID = \"ATVPDKIKX0DER\";\n    swfParams.salign = \"LT\";\n    swfParams.preset = \"detail\";\n    swfParams.mediaObjectId = \"mMX41IF3140YW\";\n    swfParams.autoPlayTimer = \"\";\n    swfParams.mediaObjectIDList = \"mMX41IF3140YW\";\n    swfParams.playIsUserGenerated = \"1\";\n    swfParams.enableShare = \"0\";\n    swfParams.permUrl = \"gp/mpd/permalink\";\n    swfParams.telemetryPageTypeID = \"R1YLSPTZ5QP5RP\";\n    swfParams.xmlUrl = \"http://www.amazon.com/gp/mpd/getplaylist-v2/mMX41IF3140YW/000-0000000-0000000\";\n    swfParams.amazonServer = \"www.amazon.com\";\n    swfParams.scale = \"noscale\";\n    flashParams.allowFullScreen = \"true\";\n    flashParams.salign = \"LT\";\n    flashParams.bgcolor = \"#FFFFFF\";\n    flashParams.allowScriptAccess = \"always\";\n    flashParams.quality = \"high\";\n    flashParams.wmode = \"transparent\";\n    embedAttributes.title = \"Flash Player\";\n\n    if (movieID){\n      if (playerVersion == '3'){\n        swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/20120510035744301/AMPlayer._V148501545_.swf\";\n        swfParams.mediaObjectIDList = movieID;\n      } else {\n        swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/legacy/20101014901/AMPlayerProd._V197491872_.swf\";\n      }\n      swfParams.xmlUrl = \"http://www.amazon.com/gp/mpd/getplaylist-v2/\" + movieID + \"/000-0000000-0000000\";\n      flashParams.wmode = \"transparent\";\n      swfParams.autoPlay = \"1\";\n    }\n\n    if (document.getElementById('cv_mo2VI1M6LDEPFHCduration')) {\n      document.getElementById('cv_mo2VI1M6LDEPFHCduration').style.display='none';\n    }\n    cv_mo2VI1M6LDEPFHCloadSwf_Core(swfLocation, swfWidth, swfHeight, flashVersion, bgColor, swfParams, flashParams, embedAttributes);\n\n  return false;\n}\n\nfunction cv_mo2VI1M6LDEPFHCloadSwf(movieID, playerVersion) {\n   return _cv_mo2VI1M6LDEPFHCloadSwf(movieID, playerVersion);\n}\n\n\n\t\n\t\t// ]]>\n\t\n\n<!--\n\nfunction cv_mo2VI1M6LDEPFHCnewHeight(h)\n{\t\n    fp_resizePlayerSpace('cv_mo2VI1M6LDEPFHC', 0, h);\n}\n\nfunction cv_mo2VI1M6LDEPFHCresetPlayer(w,h,bw,cc) {\n  cv_mo2VI1M6LDEPFHCnewHeight(h);\n\n  cv_mo2VI1M6LDEPFHCso.addVariable(\"resetBandwidth\", bw);\n  cv_mo2VI1M6LDEPFHCso.addVariable(\"cacheCode\", cc);\n  cv_mo2VI1M6LDEPFHCso.setAttribute(\"height\", h);\n  cv_mo2VI1M6LDEPFHCso.setAttribute(\"width\", w);\n  cv_mo2VI1M6LDEPFHCso.write(\"cv_mo2VI1M6LDEPFHCflashcontent\");\n}\n\n-->\n\n\n\n\n\n\n\n\nvar cv_mo2VI1M6LDEPFHCRollOverImg = new Image();\ncv_mo2VI1M6LDEPFHCRollOverImg.src = \"http://ecx.images-amazon.com/images/I/81baxA2uINS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play-active,BottomLeft,130,-12_CR0,0,0,0_.png\";\n\nvar cv_mo2VI1M6LDEPFHCpreplay = document.getElementById('cv_mo2VI1M6LDEPFHCpreplayImageId');\nif (cv_mo2VI1M6LDEPFHCpreplay) {\n  cv_mo2VI1M6LDEPFHCpreplay.onmouseover = function() {\n    cv_mo2VI1M6LDEPFHCpreplay.src = \"http://ecx.images-amazon.com/images/I/81baxA2uINS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play-active,BottomLeft,130,-12_CR0,0,0,0_.png\";\n  }\n  cv_mo2VI1M6LDEPFHCpreplay.onmouseout = function() {\n    cv_mo2VI1M6LDEPFHCpreplay.src = \"http://ecx.images-amazon.com/images/I/81baxA2uINS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play,BottomLeft,130,-12_CR0,0,0,0_.png\";\n  }\n  \n  \n  var node = cv_mo2VI1M6LDEPFHCpreplay.parentNode;\n\n  var cv_mo2VI1M6LDEPFHCcurrentClick = node.onclick;\n  node.onclick = function () {\n    var head = document.getElementsByTagName(\"head\");\n    if (head[0]) { \n      var logTag = document.createElement('script');\n      logTag.type = \"text/javascript\";\n      logTag.src = \"/gp/customer-media/du/log.html?ie=UTF8&p=CustomerImage&s=CustomerVideoPlay\";\n      head[0].appendChild(logTag);\n    }\n\n    if (cv_mo2VI1M6LDEPFHCcurrentClick) {\n      return cv_mo2VI1M6LDEPFHCcurrentClick();\n    }\n  }\n}\n\n\n\n\n Length:: 1:10 MinsThis is a simple review so I won't go into every single detail about this camera. I bought this camera because of the 50x zoom, which is very impressive. The camera is easy to use. The menus and options a very user friendly and you don't need to be an expert to use it. It has a build-in user guide if you need help with options. This is not a DSLR camera so don't buy this expecting it to perform like a DSLR. The camera does take great pics and in good lighting it takes some impressive picture. video recorded in 1080p looks crisp. The camera is not very heavy. I can hold it one handed and not feel like I have a brick in my hand.I use this camera primarily to photograph my vacations, outings, family events etc. The 50x zoom has really come in handy. I have used it at the zoo, sporting event and even out deep sea fishing. Using the 50x zoom is great but once you go pass 20x you need very steady hands or a tripod. At 50x zoom the smallest movement made will render the image useless. I find the using the barrel on manual zoom works best at getting less shaky images and video.I have uploaded a short video showing the 50x zoom. The camera was mounted on a flimsy tripod so the video is some what steady. I did not use the barrel to zoom, I used the button so every time I zoomed you could see the camera vibrate.Some may not be happy with the image quality of this camera but I am happy with it.SpecsLens: Max Aperture f/2.8 - f/6.3 35mm equivalent 24mm - 1200mm Optical Zoom 50xImage Sensor: CCD pixels 20.4Mp (Megapixels) Pixels (W) 5184 Pixels (H) 3888 Sensor Type Exmor CMOS Sensor Size 1/2.3 inchAspect Ratio: 4:3/ 16:9LCD Monitor: 3in Screen resolution 921,000 dots No Touch ScreenFocusing: Min Focus 1cm, Focusing modes Manual, Spot, Face Detection, Multi, CenterRecording modes:Easy, Intelligent Auto, Superior Auto, Program, Manual, Aperture-priority, Shutter speed-priority, Memory Recall, 3D Still Image, SCN, Intelligent Sweep Panorama, MovieISO sensitivity: ISO 80 to ISO 12800White balance: Auto, Daylight, Cloudy, Fluorescent white, Fluorescent natural white, Fluorescent day white, Incandescent, Flash, CustomShooting Options: Continuous shooting 10fps,Movie modeVideo Resolution 1920x1080, 1280x720 720p, 640x480 VGAVideo FPS 60Stereo Sound YesOptical Zoom with VideoImage Stabilisation YesInterface: HDMI, USB, USB 2No Wi-FiNo GPSStorage: SD/SDHC/SDXC; Memory Stick Pro DuoFile Type: JPEG/AVCHD (MTS); MPEG-4 AVC/H.264 (MP4)Power Source: LITHIUM ION NP-BX1 3.6VBox Contents: Rechargeable Battery Pack NP-BX1, Shoulder Strap, AC AdaptorAC-UB10, Lens Cap, Micro USB cable, Instruction ManualDimensionsWeight 650gWidth 129.6mmHeight 93.2mmDepth 103.2mm", "Date": "October 12, 2013"}, {"Title": "GREAT VALUE", "Author": "john s howard", "ReviewID": "R17166J463SKJT", "Overall": "5.0", "Content": "the  HX300  has to be the best  point and shoot camera on the market.  You talk about easy to use, and a great  ZOOM  wow!!  And the steady shot modes, in photo and movie  are  unreal, smooth, clear shots.  The menus are easy to navigate, and learn.  I have had many cameras, from Cannon, Nikon,  panasonic,  etc.  this is by far and away, the easiest, and  best  point and shoot out there.  I have purchased many, many Sony products in my years, and I mean MANY,  I think they have hit a home run with the  HX300......", "Date": "April 28, 2013"}, {"Title": "Best photos I've ever taken", "Author": "Nancy", "ReviewID": "R1NDLNOUHZMZY6", "Overall": "5.0", "Content": "I purchased this camera after reading tons of reviews, and have been thrilled with it. I took it to my recent trip to Europe and the photos I took with it are amazing. Originally I was hoping to replace my Canon Super zoom with a lighter model--that didn't happen--they are about the same size and weight. What sold me on this camera was its zoom ability, it's stabilizer (more and more important since I'm aging and have a slight tremor now), and the fact that it had a viewfinder. I could never get used to not using a viewfinder. So even though it's a bit chunky and heavier than those cute pocket cameras, I made the right choice for me.", "Date": "February 4, 2014"}, {"Title": ":-)", "Author": "Star L. Davan \"Izzydo\"", "ReviewID": "R3J1GAWLY2FL5H", "Overall": "5.0", "Content": "Just what I wanted!  Zoom is fantastic!  It is a great value. The best of both worlds manual and auto.", "Date": "January 3, 2014"}, {"Title": "Great Camera", "Author": "Walter \"Audible has been important to me sinc...", "ReviewID": "R1BWOU5NNQ3QLS", "Overall": "5.0", "Content": "This is an excellent camera that has all the integral features to make a person challenge himself to be a better photographer while not having to think too much in the process!", "Date": "May 30, 2014"}, {"Title": "Sony moving backward", "Author": "Marilyn Patterson", "ReviewID": "R8XO4H72XU6Y8", "Overall": "2.0", "Content": "I have owned the 50, Hx-1, HX200 and now the 300.  The best camera they made was the HSC50, The HX-1 is ok as a back-up camera. All three of those had one great feature that they eliminated in the HX300.  That is the lens cap falling off when you turn the camera on.  It is caught by the string so you cannot lose it.  It makes it fast to grab your camera a shoot moving birds. I have to fumble with the lens cap to get it off of the 300. I use all of my cameras on Automatic for speed and have always gotten shots to be made into posters and powerpoints.  Also as a bird and wildlife photographer I always carry extra charged batteries.  All of my other Sonys were designed with a charger so that you could charge the battery out of the camera.  The 300 can only be charged through the camera. Having the camera sitting on the floor (the cord is too short to reach other outlets) with a large dog in the house is asking for trouble.  Also everyone knows that you should never plug your camera directly a wall outlet or computer as the chance of damage to the camera is huge.  I have made a couple of good close-ups of frogs but when you use the zoom the photos seem fake.  It does a poor job on photos with artificial light.  They also eliminated the option of using the flash on other than auto.  Because of the type of photography I do, I need speed and good automatic settings.  This camera is so slow recording the images on zoom that I can only get one shot where as on the others I could get 5.  The body is bulky and very light which makes it awkward to hold.  I use the peep site all of the time so it is ok for me but I wouldn't want to have to hold it out from my eye for any length of time. The other models felt more solid in the hand.  I owned the HX200 but it broke a week after buying it, was repaired, then broke again at 14 months (out of warrantee) and they said it would cost $160 to fix.  I should have bought another 200 with an extended warrantee but after my old one dying on vacations twice I was gun shy. The manual that comes with it sucks.It doesn't tell you how to get it off of digital zoom.  I would not recommend this camera to photographers who care about the quality of the images. I have had it a few weks and so far I am not impressed.", "Date": "May 29, 2014"}, {"Title": "Review of Sony DSc-HX300", "Author": "MARYLE BARBE", "ReviewID": "R3448JXEI2C9I3", "Overall": "5.0", "Content": "I do love this camera with the 50x zoom and so lightweight.  I am going to take it traveling and leaving my heavy Canon at home.  I have lots of great wildlife shots already so very happy with this lens.  Thank you!  M. Barbe'", "Date": "May 21, 2014"}, {"Title": "Great Camera", "Author": "Julia Harbeck", "ReviewID": "R3NXW3TUGTH5R5", "Overall": "5.0", "Content": "I was looking for another point and shoot because I don't always want to drag my camera and other lenses with me while hiking, but I wanted great pictures.  I had an old cybershot and loved it but could no longer get the memory cards and the old batteries were a pain.  I am thrilled with the new version, great shot, great movies, great zoom.  I am happy happy happy.", "Date": "May 6, 2014"}, {"Title": "Best point & shoot camera!", "Author": "Guadalupe MataCruz", "ReviewID": "R3D5Y9MA0MRLHA", "Overall": "5.0", "Content": "Best camera I ever had.Great zoom!Great overall features!I'll buy it againNo complainantsEven better than some expensive \"pros\"dslr", "Date": "May 1, 2014"}, {"Title": "Love this Camera!", "Author": "K. Ellibee", "ReviewID": "R2NVE3TKGA20P8", "Overall": "5.0", "Content": "It takes great pictures even in high zoom and low lighting.  I am very pleased with this camera and look forward to learning how to use the other functions available on it.", "Date": "May 1, 2014"}, {"Title": "very slow writing speed", "Author": "osakajoe", "ReviewID": "R1OYR400ILISJ4", "Overall": "2.0", "Content": "I am a parent of two young children. We wanted a camera that was not too heavy for travel, but with a nice zoom to be able to capture moments when the kids are at one end of the pool or field or stage and we're at the other. I also wanted a quick camera for action shots and sports events. I was so, so disappointed with this camera because the 1.5-2.5 second delay between the time you snap the photo and the time it's its ready for the next shot (in other words, the writing speed or how long it takes the image to record onto the memory card) is unacceptable. It really feels like an eternity before you can click again!!!! Certainly, you can set it to burst mode and take multiple shots with one click, but then you still have to wait 3-4 seconds for it to write before you can initiate the next burst.  And this is with use of a ScanDisk HD 32GB/80 MB card, the fastest available! I was surprised not to see more reviews about the slow writing speed on line when I was researching.  If you're looking to take action shots of your kids or pets, this is likely not the camera for you.", "Date": "April 29, 2014"}, {"Title": "Does not live up to the description or marketing", "Author": "nefarr", "ReviewID": "RV1SVP0SKSF74", "Overall": "1.0", "Content": "Admittedly I have previously used a Nikon D90 which is known for its crisp photos. The D90 is a 12 MP camera and the DSC HX300 is a 20 MP camera. When you read that a camera is about the sensor and not the pixels, believe it. The Sony DSC HX300 may have almost twice the pixel count, but the pictures are not even half as good, as sharp or with as much detail.The auto focus does function, but very very slowly. That one word describes almost every feature of the camera - SLOW. The zoom is exceedingly slow and the auto  focus even slower. I used the camera with a Class 10 SDHC 32GB card that functions superbly fast in my Nikon, but takes one to two seconds to write from the Sony DSC HX300. While this may not seem like much of a delay, it is significant if you want to take more than one picture of an object. Children, animals, sports and most other live photo opportunities just don't stand still and wait for you to shoot one picture, wait for the camera to write to the card, then shoot another. If an object is moving, all you will get is a blur no matter the ISO setting used.The camera is supposed to work well for sports, wildlife and other normal types of shots. It doesn't. Again, the delays in shooting, focusing and zooming spoil many photo opportunities. I tried taking pictures of my dogs at play which is easy with the Nikon, but almost impossible with the Sony.While the camera advertises that it will shoot bursts at a high rate of speed this is not the case when using a higher quality image. I knew that the camera did not take pictures in RAW, but the JPG even at the finest resolution the Sony is capable of is simply not up to par.I very much wanted this camera to work for me, as it would significantly replace the amount and weight of gear I would have to take with me on a day outing or for travel. It is so light and plastic-y that it is hard to steady properly anywhere past half zoom. The build quality seems lacking and more toy-like than most cameras I have used.The instructions that come with the camera flat out state that the camera will pick up noise from the shutter and the zoom if you use it with movie mode. It does. I tried the movie mode, and while the picture was fairly good, you could clearly hear the motor of the zoom and some other extraneous noise from the camera on the playback.I dislike reviews that totally pan an item. It always sounds to me like the writer has it in for the manufacturer or there is something else driving the bad review. I wish that were the case here. For the first time, I am writing a review that really downgrades an item.  I did a good bit of on-line research about the ultra-zoom bridge camera sector and thought that based on pre-release reviews and analysis of the camera that it would be a hit. Unfortunately I just couldn't recommend this camera to anyone whether a novice, enthusiast or other user.The summary is that unless you want the camera to take pictures of static objects like scenery, buildings, statues or the like, this isn't the camera for you. It definitely doesn't work for vacations, action, children, pets, wildlife or anything that moves.This has nothing to do with my review of the camera, but be careful about buying this item from Amazon or any dealer on-line for that matter. I am trying to return the camera, but Amazon is telling me that there is no refund on this item. I didn't see that warning when I bought the camera, but you should be aware of that. If you make a mistake buying this camera, you're probably stuck with it. For me, it was an expensive lesson.", "Date": "March 20, 2013"}, {"Title": "Disappointed", "Author": "Sharon M. Lauderman", "ReviewID": "R22BYFTKCIM16F", "Overall": "2.0", "Content": "Have defective camera, apparently.  Even online tech support couldn't help.  Screen stuck on language setting as soon as I turned it on.  Support suggested requesting replacement.  So disappointed that I can't start using it.", "Date": "January 21, 2014"}, {"Title": "20 Megapixel Workhorse", "Author": "JaxJoe", "ReviewID": "R3J66LGCDXRRF3", "Overall": "5.0", "Content": "I need a remote for the shutter using the 1200 mm zoom on a tripod. Can't find one. That's my only gripe about it. An old-fashioned cable release would work if they had simply installed a ferule in the shutter button. Other than that, I like the jog-wheel with manual aperture and shutter speed and the varied focal sensors. The manual finder leaves a lot to be desired but we have left that SLR age and the rotatable LCD is just fine for 21st century outdoor stills. A Sun-hood would look stupid for outdoor portraits but might be something to try and jury-rig if you are serious. I received this camera a week before our annual golf tournament in Myrtle Beach and the caddy-master took our best group shot with it with no prior instruction, thanks to image-stabilization software. It sure beats my first  Kodak \"Brownie\"... After I got back and downloaded what I had, I saw a commercial on TV for a Microsoft cell-phone with a built-in 40 megapixel camera! Is there no end to it? I bought my first digital Canon for $1,000 in 2006 and the sensor was only good for 3.3 megapixels, a Ford Model A compared to an Audi A-7... This camera is well worth the $450 price tag but it's soon to be out-done by carbon nano-circuitry. Ain't it great to live in our time!", "Date": "September 22, 2013"}, {"Title": "Great camera with sometimes inconsistent results", "Author": "J. Harley", "ReviewID": "R3P88AIVIPAXZR", "Overall": "4.0", "Content": "The HX300 is a megazoom bridge camera.  It's fairly large when compared to typical digicams.  However, it is still smaller than most DSLRs, if even by only a little.  Ergonomically, the camera feels good.  The body is constructed of plastic which makes the camera lighter than it appears.  I personally like the controls placement. Everything is neatly and logically arranged.  The top has jog and mode dials which should be familiar to anyone who has previously used a DSLR or bridge camera before.  There were no head scratching moments when looking for controls or features.Size and Weight---------------The size and weight of the HX300 are pretty decent for the type.  It fits somewhere in the middle on the size scale for bridge cameras.  For example, it's larger than the Canon SX50 but smaller than the Fuji HS50.  The plastic body looks deceivingly heavy but is actually lighter than I expected.  I have no problems handholding the camera for steady shots, but personally, this would be strictly a specialty camera and not my first choice to lug around somewhere like Disney World all day.  That's not a knock against the camera because even my smaller (body) NEX 5N isn't my first choice.  That would be my Canon S100, a tiny camera that takes excellent stills, video and is small enough to be unobtrusive while I'm running around the park. The HX300 would be my first choice for sporting events, wildlife photography, vacation photos around the resort (where I could easily stow the camera away when finished), weddings, graduations, shows, or any other event where I would benefit from having as long a zoom as possible. That's not to say the HX300 won't make a suitable every day camera, because it most certainly would.  I just prefer not to haul a large camera around all day, and make no mistake, this is a large camera when compared to standard non-megazoom digicams.Performance-----------Performance so far has pretty decent.  The camera starts up relatively quickly and the auto-focus is very good with no excessive hunting. The controls are conveniently placed and everything is within easy reach.  The menus are logically arranged and super easy to navigate, even easier than my NEX touchscreen.  The speed is great.  I sometimes get a little shutter lag in dim light depending upon the circumstances, even with the flash enabled, but at least so far I've experienced no excessive write delays between shots.  In bright light, like an outdoor sunny day, there is no delay whatsoever and the camera is very snappy and responsive.  That's important for shooting situations like an outdoor sporting event, where a slow camera can really ruin your day.  So far, I've had no problems focusing on moving subjects, even fast moving. There is no RAW mode which is sort of a bummer for enthusiasts but won't bother most shooters. The quality of the jpegs can range from excellent to downright awful.  More on that in the next paragraph. Video mode shoots 1080p video.  Focusing during video is usually good and the internal microphone does a decent job of capturing sounds without excessive background or wind noise.  You can zoom during recording without excessive internal mechanical noises ruining the sound.  It has a dedicated video button, so switching from still to video mode is not only easier but also allows both to be used simultaneously.  It also eliminates the possibility of mixing up the two while shooting.  I've had numerous occasions where I've missed still shots on other cameras due to forgetting to turn the dial back to still after shooting a video clip.  The rear tilting 3\" LCD is very sharp.  The sharpness is a double edge sword because sometimes pics look great on the LCD until transferred to a larger screen.  You can adjust the brightness and resolution on the rear LCD to conserve battery life.  The LCD doesn't swing outward, so no easy self-portraits.  That's not a big deal for me personally, but it may be for some.  It also has an EVF that actually isn't too bad.  Burst mode so far has been okay but I only tested it sparingly and admittedly haven't yet gone beyond 5 or so frames, which all came out great in good light.Image quality--------------Image quality is sometimes a mixed bag.  For example, I took numerous outdoor and indoor shots in a variety of lighting conditions, from partly-cloudy to bright and sunny.  Most of the pictures taken outdoors in perfect lighting came out perfect, not surprisingly.  Focus was spot-on and the images were sharp, clear and colors were vibrant, even when enlarged.  None of the pictures taken in the overcast conditions were keepers.  Some were mediocre while others were downright terrible, with tons of artifacts and pretty shoddy focus especially at the far end of the zoom.  I can forgive the bad photos at the far end of the zoom, especially taken hand-held, but I honestly expected a little better dim light outdoor performance.  However, the most perplexing photos were the ones taken in bright sunlight of complex scenery.  For instance, I tried to take some pictures of the woods behind my home to test how well the autofocus responds to challenging focusing situations.  I was very disappointed.  My cheap sub-$100 digicam handles focusing of complex scenery better.  When the camera failed to take a decent photo of the entire scene, I focused on specific trees and branches, hoping for better results.  I got the same results, blurry photos regardless of focal length (so no more blaming the zoom).  If I focused on a less complex targets, like my patio or other nearby inanimate objects, the camera focused fine.  I could usually correct the issue by manually adjusting ISO and focus but this review is mainly for the set it and forget it crowd, not serious amateurs and pros.  Also, it's not exactly impossible to photograph those woods on full auto because a Canon SX40 that I tried last year had no problem doing so (Although, the SX40 did have its own different focusing issues at times).  I also tested with an older Fuji S1800 using comparable settings and it seems like the Fuji does a better job of automatically setting exposure settings for that particular shot.  Switching from intelligent auto to superior auto, which is basically Sony's fancy term for HDR, helped a little but not as much as just taking matters into my own hands.  Indoors, the HX300 took great natural light pictures in bright to even low light.  There will be occasional blur if zoomed out, even a little, while hand-held shooting in dim light.  The HX300 flash is powerful, too powerful at times and makes it very easy to overexpose or wash out your subject if you're not careful.  Another issue with image quality is internal processing.  Sometimes, it's way off.  When the internal compression and processing is really off, the results range from a cartoonish effect to some portions of the photo appearing as if they were shot through a screen.  This also mainly tends to occur with shots taken in dimmer light where the camera can sometimes make some pretty funky exposure choices.Wrap-up-------I like the HX300, but the sometimes inconsistent focusing and image quality make it very easy to see why opinions of this camera vary widely.  Some love it, some hate it.  Depending on their experience level and what they're shooting, I can understand either opinion.  If I had no photography experience and therefore were unable to easily correct some of the camera's shortcomings, I might be disappointed as well.  A camera should take a majority of decent or at least acceptable photos on full auto.  Manual controls and settings are good to have but not everyone wants to learn the fundamentals of photography.  Those who don't should still be able to take decent photos without constantly worrying whether they'll be acceptable or not.  I also have a few hardware gripes with this camera.  First, is the lack of a dedicated battery charger. The HX300 comes with a wall plug that plugs into the camera to charge the battery.  Charging through the camera is a nice option but Sony should have still included a separate battery charger. It may seem petty until you consider that if I buy a spare battery, a very common practice, I'm now also required to pony up an additional $50 (MSRP) for the battery charger as well.  Sure, I could simply use the camera to charge both, but that means I won't have a camera whenever one battery is charging.  That's fine if I can always charge both batteries before leaving but what happens if it becomes likely that I will exhaust both batteries before I'm finished shooting for the day?  Instead of charging one while I continue to shoot with the other, the camera will have to sit out of commission for a few hours while one or both recharges. That eliminates much of the convenience of having a spare battery.  Adding insult to injury is the fact that the USB cable provided for charging and PC connectivity is insanely short.  It's about 2-feet long (a couple inches are the connectors).  I currently charge with my camera near the floor because the cable is too short to reach a counter top.  Even if it could, the cable would be stretched, increasing the likelihood of an inadvertent tumble.  So, I place a book on the floor and charge the camera atop the book.  Another issue is the threads on the lens.  I placed a UV filter on the lens as many others have also done.  I mainly did so because I know I'll be transporting and using this camera to a lot at public events which increases the possibility of damage.  The problem is, despite the camera having threads, officials at Sony claim the camera is not supported to work with anything attached to the threads.  My filters seem to fit okay but I wouldn't trust using any heavier accessories.  Then again, Sony also states in their website specs that the camera doesn't have a viewfinder, which it clearly does, so make of that what you will.  My last gripe is the lack of a hot shoe.  Like the battery charger, it just seems like unnecessary cost cutting on a camera like this.Regardless of the shortcomings, the HX300 is still a great camera.  It's fast and when the exposure is on the money, produces outstanding results.  When dealing with a camera with the zoom capabilities of this one, some tradeoffs are to be expected.  It really depends on your needs and comfort level sometimes compensating if the autoexposure settings just won't cut it.", "Date": "April 28, 2013"}, {"Title": "WHAT'S NOT TO LIKE!!", "Author": "Aunt Hilda", "ReviewID": "R1ABPSA4CQXXV9", "Overall": "5.0", "Content": "Many years ago, I was a pro shooter, I shot tons of roll film. I still have many of the photos I took back then still lying around. Recently I took photos of those photos and posted them on my Timeline on Facebook. Knowing I took repros of paper photos, I almost tricked myself into believing they were second generation images!! Being afflicted with osteoarthritis, a degenerative joint disease, it is not all that possible for me to get out into the MI winters as I was once capable of doing. Come warmer temps, and the disappearance of this white blanket, I'll be out with this MAGNIFICENT piece of machinery and will be delving deeply into what it can really do!!! I'll once again, BE A FAIRLY DANGEROUS MAN!!! LOL", "Date": "February 15, 2014"}, {"Title": "Great camera", "Author": "Mary Berg", "ReviewID": "R6OKH8OOJLFVX", "Overall": "5.0", "Content": "I love my Sony! Produces great photos. Fits comfortably in my hand. I love the ease of use. I love the depth of photos produced. I recommend this camera for the novice who wants to move from point and click to the world of true artistic photography.", "Date": "January 21, 2014"}, {"Title": "Great camera!", "Author": "Bturner7", "ReviewID": "R18VBM1ITEPZGR", "Overall": "5.0", "Content": "More than I expected.  I am a point-and-shoot person. I take many pics on my job and I've only had a couple of bad shots.  Excellent low light shots. Great zoom too. Took HD video of my granddaughter's Christmas play from the back row - couldn't tell it was a distance shot.I did buy a new lens cap with a tether cord. The one out of the box does not have a tether cord.", "Date": "January 19, 2014"}, {"Title": "My companion", "Author": "kei izawa", "ReviewID": "R1YVIB3G333PJ9", "Overall": "5.0", "Content": "I travel a lot and needed a camera that was light and with a good telescopic lens. This camera allows me to take nature and landscape in great ways. It is a trustworthy partner for photo shoots.", "Date": "January 7, 2014"}, {"Title": "HX 300/B Sony cyber-shot camera", "Author": "Jeff Dubiel", "ReviewID": "R152XQTZ9GB1FS", "Overall": "5.0", "Content": "Outstanding build and picture quality. Be careful the HX 200 is much smaller by comparison and the new \"Hang Down Hand Grip case for both is too large for the 200 and too small for the 300 model. The HX 200 may be sold out. I have a Canon 5D Mark II $3000 camera to compare and pictures are hard to differentiate.", "Date": "January 6, 2014"}, {"Title": "Breakable and not as good a deal as the HX-100", "Author": "E. Smith \"pinnacles\"", "ReviewID": "R34MTE1HVTQE9P", "Overall": "2.0", "Content": "This camera only lasted me 6 months before it got all glitchy and sad.  All in all I was very disappointed in it.  The version with 30x zoom is much better in overall quality.  Whatever you do, don't buy one of these without investing in insurance.", "Date": "January 30, 2014"}, {"Title": "Sony camera from Amazon", "Author": "Keith", "ReviewID": "R1MY8KROVPX8GM", "Overall": "3.0", "Content": "This camera is great if you want to take great snapshots. It will not give you professional results if you are wanting enlarged photos.This camera is great if you simply want to take pictures to enjoy. This camera will disappoint you if you are wanting to take photos that look like magazine covers. A very good camera. Better than any other in its class for sure.", "Date": "January 23, 2014"}, {"Title": "Love the camera, hate the manual", "Author": "Amazon Customer", "ReviewID": "R24D5Y1V58XIER", "Overall": "5.0", "Content": "After a little time with this camera, I'm in love. Its lightweight, full of features and has great picture quality. At the highest zoom level the PQ does get a bit worse but it still decent and the image stabilization is excellent. The video quality is great as well and benefits from the solid image stabilization.What I didn't like at all was the manual. Its barely a schematic telling you where the buttons are. With so many features and picture modes, more documentation is needed.", "Date": "May 6, 2013"}, {"Title": "Camera as described", "Author": "Ricardo R.", "ReviewID": "R29FCJHYBWOPLD", "Overall": "5.0", "Content": "I have been using this camera and I really like the pictures it takes. Although the camera was used it didn't have any scratches on lens or body. I received the camera as described.", "Date": "February 20, 2014"}, {"Title": "Great cam", "Author": "adr44", "ReviewID": "R2WAFY6G857TX5", "Overall": "5.0", "Content": "All about the zoom and getting close to wildlife. Lots of features, good build quality, great viewfinder and video, Great color, only thing I wish it had GPS.(Update) I have been able to take 50x shots hand held that are sharp, but a monopod works great. Hand held twilight mode is very good for low light shots and Sony's HDR implementation is one of the best if you use a tripod.", "Date": "July 21, 2013"}, {"Title": "Great camera but Check to make sure it is new!", "Author": "Trader One \"ogr4evr\"", "ReviewID": "R15FHVBQIG8ZSL", "Overall": "5.0", "Content": "Camera was very good but it was sold by Amazon as new but somehow arrived with 3330 photos already recorded on it.  It was returned for a full refund (thank you Amazon).  Advise any buyer of camera equipment to immediately check their purchase to confirm it arrives new if it sold as being such.Aside from the above issue, this is a great bridge camera with best 50X zoom available.  It takes some practice to get best results at the long end of the zoom.  Don't plan on reviewing photos at 100% resolution on your computer because it won't compare well with photos taken with cameras using larger sensors @ 20MP.  Take a look at the review on Imaging Resource for an accurate assessment of this camera.  I have taken photos of subjects, wildlife in particular, that would otherwise be impossible to take up close to the subject.The print quality is very good for average use and even looks great as a wall photo @ 16X20 and acceptable to me @ 20X30 at low ISO settings (less than 400).Other reviewers here on Amazon provide a broad range of assessments but I believe this camera will be very much appreciated by buyers who understand the strength and weaknesses if this product.", "Date": "November 20, 2013"}, {"Title": "Impressed", "Author": "Donald R. Poteet \"Rockdweller\"", "ReviewID": "R2UXRRGINBSOOO", "Overall": "5.0", "Content": "I have been a Sony freak all along and what impresses me most I think about their products is all the different opinions that they create.  I would think it's either a decent camera or it's not.  All digital cameras will do what they are designed to do and you can pay any price you want to pay but albeit a dslr or compact, it still boils down to whose hands it is in.", "Date": "August 27, 2013"}, {"Title": "Compare with its previous model,  SONY DSC-HX300B performs everything much better except its size and no auto viewer slection.", "Author": "Henry Cheung", "ReviewID": "R3IPFTZE5TIFZC", "Overall": "4.0", "Content": "THis camera is fantastic especially it long zoom lens.  It meet all my expectation and the only comments at two areas.1)  Compared with it previous version DSC-HX100,  it is much bigger at every dimensions.and no longer consider as a compact camera..2)  On  the previous model ,DSC-HX100,  there is an electornic sensor that senses any covering over the eye piece and itautomatically switch the display between the verwfinder and the LCD screen.  It is a nice feature and it is no available on the new DSC-HX300. On the DSC-HX300,  it is required to manually select which viewer to display the image.", "Date": "October 13, 2013"}, {"Title": "wow very nice", "Author": "ai chan1", "ReviewID": "R3EQKLVQVEK7C9", "Overall": "4.0", "Content": "The camera part of this one is very excitting to use on the intelligent Auto function. I havent had so much fun from a camera like this in a while. I have been using Canon POwershot for many reason but my problem was low lighting video recording.However, I still need to figure out the video recording since I am getting linear and pixelating images in a few seconds of recording. It doesnt happpen all the time and so I dont know what is causing it so far.Its a good weight for me since my right hand shakes , I like the floating effect of the video so there is hardly any shakes.", "Date": "July 7, 2013"}, {"Title": "Enigma in a box!", "Author": "lynnie", "ReviewID": "R1Y42GI4HRW7LT", "Overall": "4.0", "Content": "Set up was difficult and not well laid out in materials.  Saving grace was in camera manual which got me through some of the difficult settings.  The ia settings work very well and the quality in bright light is very good.  Wished the lcd screen turned inward as I do not use it for framing.  Fun camera but tricky at times.", "Date": "October 24, 2013"}, {"Title": "It is OK but should be better", "Author": "D \"D\"", "ReviewID": "R3QBJRWO7S8US7", "Overall": "3.0", "Content": "The pictures I took are good and seem to be good quality, the super zoom ones are fuzzy though and not worth printing. I saw mention of a sports mode but I can't find it. I find the menu options a little confusing myself. I don't like the lens cover seems to have no way of attaching it to the camera itself so I can see that getting lost pretty quick, I have a nice fujifilm camera that the lens cover has a small cord so the cover doesn't get lost. The sony HX300 is a bit bulky but it isn't very heavy for the size. It definitely isn't a pocket camera which I would prefer if I were on vacation because of the ease of handling and carrying. I am not an expert on any camera and I am more of a point and shoot person which is what this camera seems to be targeted for. I have a small Sony cybershot that takes pictures that are as good as this camera does and it was cheaper and more compact. The flash is not automatic either, you have to press the button to make the flash open which is something I could live with if the zoom pictures were better. I like to use the zoom function for animals because when you move towards them they move towards you. The time lapse between shots is slow also when in auto mode. I would very much prefer to be able to take shots at any time instead of having to wait so long for the camera to be ready for the next shot since animals and kids just don't sit still.So while this is a good camera it could be better and I am not sure if I would buy it at this price. The zoom just doesn't work as well as it should and that is what they are using as a selling point.", "Date": "May 2, 2013"}, {"Title": "Wonderful Camera", "Author": "Becky", "ReviewID": "R2GN8Z34F7XOHL", "Overall": "5.0", "Content": "This camera is easy to use and produces some of the clearest macro, telephoto, and landscape shots I have ever taken. If you are into macro or telephoto photography I would highly recommend this camera. I own a Pentax DSLR Kr and the Sony DSC-HX300 takes better photos. Takes macro shots better than my Pentax DSLR and I am so glad that I purchased this camera. It is worth every cent. I will upload some my shots.", "Date": "April 14, 2014"}, {"Title": "Great advanced camera", "Author": "Lynda Walls", "ReviewID": "RMQFHCBU9PCOP", "Overall": "5.0", "Content": "This is a great camera for  people who want good quality pictures without the expense and weight of  the SLRs. If I had a complaint at all, it would be the lens cover does have a strap to keep it attached to the camera. I am always afraid I'll loose it.", "Date": "March 18, 2014"}, {"Title": "great camera", "Author": "Nino bras", "ReviewID": "ROM3SXW6N1NPG", "Overall": "5.0", "Content": "Simple to use and excellent for amateur (me) photographer. No complains so far. It ia advised to buy the jacket for the easy to use", "Date": "August 17, 2013"}, {"Title": "Very Good Camera!! No Problems here.", "Author": "japrosse", "ReviewID": "RV2K8KWNYQMLX", "Overall": "5.0", "Content": "Sony DSC-HX300/B 20 MP Digital Camera with 50x Optical ImageVery Good Camera!! No Problems here.  Love the 50X zoom perfect for sporting events/vacation photo's", "Date": "May 22, 2013"}, {"Title": "Excellent Sony camera, great system.", "Author": "Frank Romo Jr.", "ReviewID": "RK7PMK51NCK4J", "Overall": "5.0", "Content": "I purchased this item a year ago and have used it quite frequently. I've also purchased several Wasabi batteries to go with it and placed them against the Sony battery, four stars. This camera works very well for my needs, I also have the Sony HX200V and it's a good back-up system for this camera. I just purchased the Sony H400 & the HX400B; tried them both for a day each and returned them, reason was too complicated for this 67 year old guy. The menus weren't user friendly like the HX200 and HX300, trying to navigate was a lesson in futility. I don't have the patience for fiddling around with several different pages of set-up.The way I feel out my cameras, if I can't work the camera within the first 30 minutes, it's a dead deal. Don't get me wrong, I've got the A-850, the A-77 and the A-580, I know that I have to spend time getting the camera in it's appropriate mode but with a bridge-camera, it shouldn't have to be that difficult.I'll say the Sony system is good but, I just want to keep it simple, I'm sure the 400's will prove themselves but I'll pass them to the ones who have the patience for them. I'll give them a good rating but not for me...", "Date": "April 15, 2014"}, {"Title": "New Sony Camera", "Author": "Amazon Customer", "ReviewID": "R2FAG0TQB93E2A", "Overall": "5.0", "Content": "I bought my first Sony camera, Carl Zeiss lens, in 2007 to take continuous photos of my children's track team.  The pictures were outstanding and the camera lasted until fall 2013.  I replaced it with this Sony and I am even happier.  The manual focus is much easier, the 50x zoom is great, and the photos are beautiful.Do spend $7 and get a lens cap with an attachment string.  Really, Sony?  You couldn't include that?", "Date": "February 28, 2014"}, {"Title": "I would rather have my 200 back.", "Author": "David C. Ross \"dclark\"", "ReviewID": "R3TWH94R1XOTCH", "Overall": "4.0", "Content": "I purchased the HX300 to replace my 200 that I left on an airplane.  I like this camera, but to use the zoom at 50 definitely requires a tripod, whereas I could use the 200 fully zoomed out without a tripod.  Consequently, the quality of my photos were, I felt, superior to those that I get with this camera. Given the choice, I would rather have my 200 back.", "Date": "November 6, 2013"}, {"Title": "Full range of zoom is not useful", "Author": "KNSudha", "ReviewID": "R2ZUD6D609DZC6", "Overall": "3.0", "Content": "The OIS is useless at the long end of the zoom range -- I don't find much improvement in usable pictures taken with this vs last years model the HX200 which I really liked and still own. I bought this to use for wildlife on vacation and every photo taken at more than half way through the zoom range results in an unacceptably soft image.  Its still awesome through half of the zoom range, so won't take off all the stars.  Having a bridge cam at a nice price that can put the equivalent of a 600mm lens at hand for fun if not pro quality photos is good to have.  Being spoilt by L lenses, have passed this on to family members, and am much happier with the RX10 also from sony, albeit at 3x the price, which does deliver exactly the promised IQ all the way through its much smaller zoom range.", "Date": "March 20, 2014"}, {"Title": "good camera with digital image processing issues", "Author": "Frankenfeld, Fred", "ReviewID": "R3OZBN0HR3XN6C", "Overall": "3.0", "Content": "After Amazon cancelled my order for an \"announced\", high-zoom, compact, Lumix camera that had not been released, I re-evaluated available options.  I searched the Amazon site for \"ultra zoom, viewfinder, compact, GPS camera\" and this camera \"matched\".  The camera is ultra zoom and has a viewfinder...  the camera is NOT compact and does not provide GPS encoding...  (User error caused mismatch?)  The camera almost was returned after taking two images because of SIGNIFICANT delay between pressing the shutter button and processing of the image. Nevertheless, I kept the camera - my solution is to take photos in \"sports\" or \"action\" mode (probably, the image processing takes just as long as when other modes are used - processing just seems to occur faster).  Not convinced I got my money's worth - but I am convinced this will NOT be the last camera I buy (I'm 69 years old) because I'm certain that there will be many cameras that meet my criteria without the compromises of this model, a Sony camera will not be my next purchase.  Note: High resolution was not specified in my search criteria, but this camera has 20 mp resolution.", "Date": "July 24, 2013"}, {"Title": "Nice zoom, but not my first choice Sony", "Author": "Jacx \"J.C.\"", "ReviewID": "R13UVY5FRDX6V9", "Overall": "4.0", "Content": "What I likeThe reason I chose this camera was for the zoom, you can pull in some otherwise unattainable shots with this.I really like the jog button.You can change out the battery and SD card with tripod adapter screwed on, just barely.What I don't likeThe screen is exposed on back of camera all the time. It cannot be flipped shut.Although the skin of the camera is similar to my Sony A57 the Lens body looks and feels very plastic.What I wish it had,A remote Shutter release option. I use a tripod often and like the least amount of camera movement I can get.  I do a lot of low light shots, night landscapes, etc.Battery charges in camera, and you can't use while charging. I ended up buying a charger and extra batteries.I feel this camera compliments my Sony A57 which I love more everyday but don't yet have a good zoom lens for and was hoping this camera would fill the gap.  Most times I get the shot, and sometimes I don't.  Even though the zoom can be incredible at times, the delay between shutter release, actual picture taken and processing speed at low light levels just doesn't leave me satisfied.update 9/13I moved my star rating up from three to a four because I really enjoy using this camera piggy back on my telescope, it pulls in some sky shots that would be hard with any other camera I currently have.I also updated on a question someone asked and amazon asked me to answerthis camera will except 55mm filters on front with out issues when camera shuts down, the lens is able to retract no problem.I also use my old Canon filters that are 58mm with a step ring, you can get a whole set here on Amazon for around twelve bucks.", "Date": "May 6, 2013"}, {"Title": "Could have more accessories", "Author": "Rodrigo Pires Leandro", "ReviewID": "R1UMXZMIHQJUAC", "Overall": "3.0", "Content": "In the general, it is good. However, there are not a few accessories as: Tripod, cords (mainly) and SD Card. I recommend.", "Date": "February 28, 2014"}, {"Title": "Received the product, but some accessories were missing", "Author": "Rodrigo Azevedo Dotto", "ReviewID": "R3UZOSZACS4FNF", "Overall": "2.0", "Content": "It is a great product, but I received it missing some accessories as the rechargeable battery, the USB and charge cable and the protection lens strip.", "Date": "February 24, 2014"}, {"Title": "I love Sony Cameras", "Author": "RUSS", "ReviewID": "R2H9B0HCLQ6B8Z", "Overall": "5.0", "Content": "I -and got one for friend-  We just enjoy having fun and taken pics- We also have the HX 200V cameras-Both cameras are great-", "Date": "May 5, 2013"}, {"Title": "Changes Were Frustrating", "Author": "L. Spade", "ReviewID": "R2Z8AC2ONEX9RW", "Overall": "3.0", "Content": "I currently own the HX200 and LOVE it but wanted more zoom. I was disappointed with the changes made to the HX300. There is no securing strap for the lens cap. I also did not like that you could not have the LCD/finder on at the same time. The picture taking ability seemed equal or better than the 200 but the hassle of the other changes made the use of the camera frustrating for me. Unfortunately I returned this item.", "Date": "June 28, 2013"}, {"Title": "HX 300: Like telephoto pics; manual lousy, can't take vertical pictures", "Author": "Donald E. L. Johnson \"Blogger at businessword...", "ReviewID": "R1QL154A1HFEQ2", "Overall": "3.0", "Content": "I just bought this camera locally from a guy who knows cameras inside out and convinced me that this beats the Nikon Coolpix P520 and Canon SX50 as well as my 3-4 year-old Nikon P90.While the reason I like the telephoto bridge/zoom cameras is that I like to shoot wildlife from great distances. We're about to embark on a drive to Alaska, and the HX300 looks like a good solution.But, as usual with camera makers, the manual and users' guide are terse to the point of being almost useless.For example, when I try to take vertical (portrait) pictures of trees, towers, people, etc., the LCD screen and view finder black out. I've searched the web high and low for an answer.Because I may return this camera, I haven't registered it. Thus, I can't post a question on the Sony Cybershot forum, which is what I usually do when I have questions about products and issues.As previous reviewers have noted:1. The camera is very slow in extending the telephoto lens and retracting it. But it does extend and retract very smoothly. Similarly, the time it takes to process a shot and give you a chance to another one is way too long when you're trying to take wildlife and action shots. I'm still mulling that problem.2. The features are so numerous that few users will go beyond iScene. I've used SLR cameras since the 50s and have some experience with setting apertures and speeds, but I'm  the kind of user who learns just enough to get my jobs done.3. Online tutorials are nice, but they're too basic and don't help trouble shoot.4. The camera feels pretty good in my hands. I'm amazed that I can get distant shots that stop action pretty well without a tripod.5. I like having the ability to put a protective filter on the lens.6. Attaching the strap was a pain, thanks to designers who apparently don't use or setup cameras.So I'm here on day two, pretty pleased with my initial shots but not so happy with Sony manual or support or forums.But, then, Sony has never gotten Apple and Macs, which is why it's still only Sony, not Apple and it doesn't make anything like Macs or provide the kind of support Apple does. Part of Mike Camera's deal is that you get a 45-minute training session with the sales person on your schedule. I'm hoping Marc can resolve my frustrations and help me get to the next level with the HX300.", "Date": "May 13, 2013"}, {"Title": "great camera!!!", "Author": "Mauricio A. Portillo \"Newbee\"", "ReviewID": "R2G04F1E7GLY55", "Overall": "4.0", "Content": "I was gonna buy this camera at Amazon but they raised the price a couple of days after I saw it going fod $429 with accessory kit. I wll suggest they lower their price as I found the camera going for $389 at 42photo.com and when tgey do I will buy it from Amazon.The reason for my 4 star rating is cause I have only been able to use the camera at frys n bestbuy n so far I'm in love with the long zoom.", "Date": "August 24, 2013"}, {"Title": "Be Careful Where You Buy Your HX300", "Author": "Amazonian Consumer", "ReviewID": "R1LPNOV2AWK8WQ", "Overall": "5.0", "Content": "I bought my Sony HX300 from a store that offers both officially imported and gray market versions of Sony's products. Although the price difference isn't that great for the HX300, I decided to buy the gray market model to save a few bucks. After arriving home, I tried out the camera, and it was then that I discovered something really peculiar.Depending on the country, the video standard is mostly either NTSC or PAL. The Sony HX300 box differentiates the two versions by marking \"60i\" for NTSC and \"50i\" for PAL, in a very hard to notice place. This is also indicated on the bottom of the camera, again, very hard to notice.The camera that I bought had \"60i\" printed on the box and on the label at the bottom of the camera, BUT when I tried to setup the camera's various configurations, I discovered that the video standard was actually \"50i\", or PAL! Other than that Sony may have erroneously labelled a 50i/PAL version of HX300, I don't understand how this could be. I returned the camera to the store and got the officially imported version after paying the price difference.So the lesson here is either always buy the officially imported model, or fully test the gray market model before you leave the store, as some stores may not let you return an opened merchandise.", "Date": "August 18, 2013"}, {"Title": "dissapointed for the price", "Author": "Edgar J. Puckett", "ReviewID": "R1THIJTASELYW5", "Overall": "2.0", "Content": "I bought a Sony DSC-H1 when they first came out and really liked it, so when I dropped it and smashed the LCD display last week I decided to upgrade.  I figured that with the advanced options and that in the 6 or 8 years since my original purchase it would be a much improved camera.  the 50x optical zoom is good, and the selection of options for photography are nice, however it's pictures are no sharper than my old DSC-H1 were.  I also take a lot of pictures outdoors, frequently while standing in sunlight, so I need the Electronic View Finder.  To my dismay The EVF is such a low resolution that it is barely useable for normal photography, and useless for focusing, framing, etc. if the zoom is turned up much.  In addition, the image software that I downloaded from Sony will not allow me to choose where the image is stored, but only in the default location.I saw a note about not having owner/user manuals that could be downloaded, but I had no trouble downloading one from Sony that I could store on my computer or print as I needed.  That part is good.I believe the camera is a fairly good camera, but not for the price, and not for my use.  I have requested a return on it.", "Date": "August 21, 2013"}, {"Title": "Sony made this? Returned", "Author": "Mary Mouse", "ReviewID": "R1NUVIL2FH4AKF", "Overall": "2.0", "Content": "Well, I couldn't believe after having Sony cameras for over 15 years that this was camera actually made by Sony. Poor quality pictures, mostly blurry if any action. I returned this camera.", "Date": "December 9, 2013"}, {"Title": "No printable user guide", "Author": "Paul N.", "ReviewID": "R890AJ9S2M8DU", "Overall": "1.0", "Content": "After purchasing the camera, I was shocked to learn that instead of placing a PDF version of the User Guide on their web site,, Sony has posted a series  of hyperlinks.  You can no longer read or print  a PDF file because there isn't one.This is a complicated, multi-function camera - I want a manual.  I want to read, underline, use the index - you know Read The Manual .  With a hardcopy manual, I can take it with me on photo shoots and refer to it, not hope I have internet connectivity on my outing.Sony Support is of no help.  There are 2 ultimate solutions for me.  One, I should regularly check back to their site to see if the PDF has been posted.  Or, call for help even if it is just to figure out what options might be available to play with for a particular shot.  Do either of these seem reasonable to you?", "Date": "April 23, 2013"}, {"Title": "Lens diaphragm round or square?", "Author": "Hector C. Hernandez", "ReviewID": "R131CN7C9FS7ZC", "Overall": "4.0", "Content": "I was wondering what type of diaphragm the lens of this camera have. Round or square. If round, how many round blades?. I contacted Sony's Product Technical support with this question, as I was not able to find the information anywhere. They replied with the following answer - \"The product specification you are seeking has not currently been published by Sony\"", "Date": "August 19, 2013"}, {"Title": "Awesome Camera!", "Author": "J. Hansen", "ReviewID": "R2SE8XO3IQK6TH", "Overall": "5.0", "Content": "This is the first DSLR Camera I have owned. I am no expert on a camera like this. I am learning about this camera as I go, and discover something new about it each time I use it. The first thing I noticed about the camera is it's surprisingly lightweight. There are many features and modes to this camera. Not only can you take photographs, but you can shot movies as well .You can select a mode to take pictures in the following situations/places: the beach, snow, fireworks, background defocus, nighttime, food, pets. You can also just select an automatic setting, and it will detect if you have enough light, if your subject is moving, if your subject is a baby, etc. You can manually set the shutter speed and  the aperture value. I love the zoom capabilities on this camera. I recently filmed my daughters dance recital, and I was far from the front of the stage. I was amazed at how much I could zoom in and get a close up of my daughter, as if I were right on the stage with her. Another feature I discovered is that you can set it to detect when your subject smiles. All you do is select that setting, point the camera at your subject, and when he/she smiles, the camera will automatically take a picture. An excellent feature, especially when taking pictures of kids -- no more trying to push the button the moment they smile, the camera does it for you! I'm excited to learn more about this camera, and discover all that it can do.", "Date": "May 7, 2013"}, {"Title": "Disappointing Camera", "Author": "Albert C. Marth \"Albert c. Marth\"", "ReviewID": "R12HESCTY3CB4G", "Overall": "3.0", "Content": "This camera is just ok!  I was disappointed in it!  Although it has good tele lens, it is not a very easy camera to use!  I would not recommend it.  It is over priced for the kind of camera it is!", "Date": "December 2, 2013"}, {"Title": "SONY HLEP", "Author": "Mohan", "ReviewID": "R3CGFOGD38VOLD", "Overall": "1.0", "Content": "I CANT TRANSFER PICS TO SONY PS3 THE 800 NUMBER NO HELP YOU HAVE TO HANG ON FOR 30 MIN", "Date": "April 17, 2014"}, {"Title": "Stylish and Effective", "Author": "Someone54", "ReviewID": "R161P5G6C54H9S", "Overall": "5.0", "Content": "I love the design for this camera. Oh and it is terrific camera too. It has all the features you can ask out of a camera; and if you have something like New 32gb Micro Sd Card Sdhc Tf Flash Memory Card 32gb Class 10, New! Usa!, then you should have all the memory you need for pictures. It's sleek, it has terrific features; what more could you ask for out of a camera?", "Date": "June 18, 2013"}, {"Title": "WORSE CAMERA I EVER BOUGHT!!!!", "Author": "Cheryl M. Wenzel \"http://newmomcentral.blogsp...", "ReviewID": "RFBU4WL6B5NUV", "Overall": "1.0", "Content": "I have had many video/digital cameras in the past few years and I have NEVER had the issues I'm having with this one. First of all, the software doesn't work with MAC! Seriously!!?? I paid $500 for a camera that doesn't have software compatibility with the MAC. You have to download the software. So I did this ridiculously redundant step. Once downloaded, did it work? NO. Camera plugged into the USB, says it's connecting. But doesn't connect. And no explanation why.Not only that, but I can't watch a movie or review pictures on the TV because it requires a separate cord. I have a plethora of camera TV/cable cords. Not one works with it.Secondly, once I downloaded the software, there is no button or indication anywhere of how to upload pictures. So, I went back to the website where I downloaded it and lo and behold there was a button. No explanation whatsoever from the download. But, since the camera isn't working when plugged into the USB, there's no way for me to upload my pics/movies. So, there they are sitting on my camera and no way to access them. I'm going to file a complaint with the BBB!This camera is the cheapest product I have ever purchased for $500. Do not waste your money. And from Sony, too.......", "Date": "June 12, 2013"}], "ProductInfo": {"Price": "$499.99", "Features": "Capture breathtaking images\nImage stabilization reduces blur\nBlack", "Name": "Sony DSC-HX300/B 20 MP Digital Camera with 50x Optical Image Stabilized Zoom and 3-Inch LCD (Black)", "ImgURL": "http://ecx.images-amazon.com/images/I/41A-qEP4cVL._SX300_.jpg", "ProductID": "B00BEHRQB4"}}