{"Reviews": [{"Title": "Not what I was expecting", "Author": "P Butter", "ReviewID": "R3N85JPT5RNW59", "Overall": "2.0", "Content": "Purchased a Silver Canon EOS M w/ 22mm lens. Both the Canon EOS M and the 22mm lens arrived; however, the box was missing several items (that I didn't expect to be there) because the items were really part of a larger kit that had been gutted. I was a bit displeased with the description of what I would be receiving because the seller omits certain information (i.e., that it's not an original Canon EOS M w/ 22mm lens kit and that it's been opened to remove/add key items).Was the listing accurate? Yes; however I didn't feel like it was accurate because it omits certain information (which in reality would be hard to describe in the product listing). Really it came down to the fact that I knew the box had to be opened in order to remove items so I don't know for sure whether the item I received was actually new and unused. I just didn't trust the description anymore and so I returned the item.", "Date": "January 16, 2014"}, {"Title": "EOS M, possibly Open Box?", "Author": "BigDaddyWill", "ReviewID": "R2PRW5GLLHJND6", "Overall": "4.0", "Content": "I am \"upgrading\" from an S90 so there are a lot of things to like about the EOS M with the 22mm f2.0 lens: the sharp picture quality from the large sensor, a crisp touchscreen LCD.  There are also a few \"compromises\", like the slow autofocus that's already been amply reviewed all over the Internet, the non articulating LCD, and the lack of image stabilization on the camera body (the 22mm lens is non-stabilized).  Overall, for a little over $325, you get \"big camera\" results, if you are willing and able to compromise with a few design flaws, like the lack of control knobs to quickly access the typical settings, the lack of a built-in flash, manual focus on the 22mm lens that feels damped and very indirect --not very DSLR-ish, etc.  It's more of an electronic ring rather than a actual focus ring, which renders it pretty much useless for me.  The lack of that direct feel is the biggest let-down for me.  The camera feels solidly-built and is relative small and portable (however, it wouldn't fit in a breast or jean pocket, for sure.)  It leans more towards \"point and shoot with APS-C sensor\" than a full-functional DSLR in a small package.  It was nice that the camera already had the latest firmware (v 2.0.2) so I didn't have to perform that software update myself.It's worth noting that my unit (purchased from Electronic Basket, fulfilled via Amazon, and advertised as \"Canon EOS M 18.0 MP Compact Systems Camera with 3.0-Inch LCD and EF-M 22mm STM Lens\") came in what appears to be a European market box/bundle for 22mm + 18-55mm + external flash unit, with some items removed.  While the box lists the 22m lens as well as the 18-55mm lens, and the add-on flash unit, only the 22mm lens was actually included.  The rest of the goods (manual, charger, battery, USB cable, camera) all appeared to be brand new.  I did not expect to receive more than the 22mm lens with the camera kit, but I expected a kit-accurate box and packaging, not what would otherwise be an incomplete 2-lens and flash kit.  Looks like someone opened the box, then just took out the 18-55mm lens and the flash unit and shipped this as a EOS M + 22mm lens \"kit\".  While questionable, it's not a big deal for personal use, but I was hoping to order an additional unit as a gift, and it would be improper to present something that looks like an \"open box\", gray market item.  I would probably not buy again from the vendor.Verdict: nice \"bridge\" camera to upgrade from point-and-shoot to APS-C mirrorless.  Might be disappointed if looking for a lateral transition from another mirrorless or as an alternative to DSLR , not so much because of image quality, but rather because of the lack of intuitive controls (just about everything is buried under touch screen controls) and that electronic manual focusing ring on the 22mm lens.  Questionable packaging/re-packaging (makes it seem like open box/gray market) from Electronics Basket via Amazon.", "Date": "December 26, 2013"}, {"Title": "Great camera and fast delivery", "Author": "Desertsweeper", "ReviewID": "R3M0YCASD0KBI", "Overall": "5.0", "Content": "At this price the well known issues of this camera are easily overlooked. Get the firmware update that mostly fixes the focus-hunting and get your head around not having a view-finder and having to use the responsive touchscreen to do things and you have a superb tool that has astounding Image Quality for its compact size (with the 22mm prime lens). What a great walkabout camera.", "Date": "October 9, 2013"}, {"Title": "Good things come in small packages..", "Author": "Naor Eini", "ReviewID": "RKWCQR31PIKW1", "Overall": "5.0", "Content": "As a 70D owner, I was looking for a compact camera with great picture and video quality (for times I don't carry the 70D with me..), and still be familiar with the menu system.With this camera on sale and after a much desired firmware upgrade, I decided to buy it. I got the red one with 22mm STM lens.I must say, its heavier than I thought, but its the only draw back I can think of.The picture quality is fantastic, the focus is fast and the lens is sharp as a tac.I'm very pleased with it. For the price, you cant get this quality elsewhere.", "Date": "January 14, 2014"}, {"Title": "Sweet Satisfaction", "Author": "Yves", "ReviewID": "RFQYX2OVXX49P", "Overall": "5.0", "Content": "After decades of storage of my Canon FD lenses, Canon finally got it almost perfect with EOS-M. Why? Because I can now use all of my Canon lenses, FD 24 2.8, FD 28 2.8, FD 50 1.4, FD 50 3.5 Macro, FD 70-210 4.0 Macro Zoom and Macro Auto Bellows. I got a Fotasy FD-EOS adapter and it all works perfectly. Set EOS-M to take pictures without lens (Custom setting 7) with Aperture Priority and manually focus FD lens (just like the old days) and set f-stop on lens. Perfect pictures! the EOS-M has a screen zoom to aid in getting focus just right.With Canon Mount Adapter EF-EOS M (recommended as it is very well built), all of our EF and EF-S lenses work perfectly as well. 18 MP CMOS is same as Canon T4i and makes beautiful photos. Yes, there is a problem with EOS-M's autofocus being slow and constantly seeking, but for experienced photographers who prefer manual focusing, no problem. This camera is perfect for aerial photography from light aircraft because it is very compact and the lens is set to infinity anyway.I am very, very happy to be able to use my entire Canon equipment collection, finally. Now we just need to encourage Canon and Amazon to sell the EOS-M2 in North America and Europe. (Don't worry Canon, we bought and use our T2i and new SL1 cameras as well.)", "Date": "January 2, 2014"}, {"Title": "excellent camera but sensor was dirty", "Author": "D. Soriano", "ReviewID": "R2QGEN26XJB15Q", "Overall": "3.0", "Content": "I love this camera, but I am returning it because there is dirt on the sensor that is very visible on long shutter and small aperture shots. I reorder the same camera again, because I really like the camera", "Date": "December 14, 2013"}, {"Title": "FANTASTIC - FUN - GREAT PRICE FOR 18MP CANON CAMERA.", "Author": "Scott \"MyRealGenius.com\"", "ReviewID": "RAQLUEB5CL6IR", "Overall": "5.0", "Content": "Love this camera, although you will need to update the firmware as soon as you get it. There is a focusing issue that is fixed in the firmware upgrade. It would also be nice if it was offered as a better package with the adapter ring to us so we can use normal Canon EF & EF-S Lens on it... Right now you will need to purchase the Canon Lens Adapter for another 120. Over all I like the manual features it has like my Canon 5D markIII.", "Date": "November 26, 2013"}], "ProductInfo": {"Price": "$849.99", "Features": "18.0 MP CMOS (APS-C) Sensor\nDIGIC 5 Image Processor\nFull HD 1080p Movie with Focus Tracking\n3.0\" Touch Screen LCD with 1040K-dots\nTouch AF and Multi-touch Operation\nHybrid CMOS Auto-focus for Photo & Video\nCompatible with Canon EF and EF-S Lenses\nISO 100-12800, Expandable to 25600 (H)\nCanon's First Mirrorless Camera\nIncludes Canon EF-M 22mm F/2 STM Lens", "Name": "Canon EOS M 18.0 MP Compact Systems Camera with 3.0-Inch LCD and EF-M 22mm STM Lens (Silver)", "ImgURL": "http://ecx.images-amazon.com/images/I/51cmYEkoZhL._SX300_.jpg", "ProductID": "B00B5FX5B0"}}