{"Reviews": [{"Title": "This is a great camera.", "Author": "Kirk Tuck \"Kirk Tuck\"", "ReviewID": "R1T0D6U05LQR1B", "Overall": "5.0", "Content": "I took possession of my a58 from a local merchant last week and I've been delighted with the camera. The sensor is very good. Maybe two thirds to a full stop better than the a57 at ISO 3200. The EVF is now OLED so it's clearer, brighter and more detailed than the LCD finder in the a57 it replaces. In my week of use I've found the finder to be really good and the performance of the sensor to be equally good. I am not a beginner and also own Sony's full frame a99 and their previous full frame camera, the a850. I've owned the a77 camera as well. This camera is smaller, lighter, has longer battery life than any of the other Sony SLT models I own. The video is really good. I wish the camera had the ability to hook up headphones and monitor the sound but it doesn't. Only the a99 does that.So, why did I buy this one if I have better spec'd cameras in the studio? Well, I use the full frame cameras in my advertising photography business and I want a camera that's smaller, lighter but doesn't give up much image performance. The a58 fills that bill.With the right assortment of lenses it comes close to being my idea of the ultimate travel camera. If people bought with their brains rather than being led by advertising I'd consider this camera to be a first rate Canon Rebel killer. It's a much better imaging machine.", "Date": "April 22, 2013"}, {"Title": "Great Camera for a Great Price.", "Author": "TJ Winston", "ReviewID": "R1RH09H0RM8AYK", "Overall": "5.0", "Content": "**Updated after One Year of use:I am a hobbyist (at best) photographer.  I got into the DSLR world when I purchased a used Sony A230 in April of 2012.  I purchased this A58 in April of 2013.The A58 works as expected with all of my Minolta A-mount lenses, a 28-85 f3.5-4.5, a 50mm f1.7, a 70-210 F4, a 75-300 f4.5-5.6, and a 28-135 f4-4.5.Update written after One year of use, about 9,000 shotsMy impressions are:Indoor/High ISO performance is good.  Unfortunately, I have never used another brand, so I have no idea how the High ISO performance would stand up to Cannon/Nikon, etc.Macro performance is amazing.Wide angle performance is excellent.Portraits look excellent (I disabled the automatic object framing, as I prefer to crop my own photos)I have shot three videos, which look great, but I do not take that many videos.Still playing with the Panorama function.  I have only tried it once with mediocre results, possibly due to intense low angle sunlight in my shot.The Pros:- Battery life seems excellent.  I have taken 700 shots in a 1.5 week period, starting with a full charge, and the indicator suggested 33% of my charge was remaining.  This leads me to believe the battery could regularly go longer than the 600 shots specified.- Camera feels sold and well built.- The \"Live View\" capability is awesome, and a huge advantage, especially when handing your camera to someone unfamiliar with DSLR's, and asking them to take a photo.- The EVF is good, and clicks right on as soon as you put your eye to the eyepiece.- In my opinion, image quality is excellent.- Auto Focus is excellent.- Reasonably priced.- Not a Pro or a Con, but the plastic lens ring has held up fine.  I change lenses frequently, and use heavy old Minolta lenses.  I have not noticed any issues.The Cons:- The type USB interface on this camera is very \"sticky\" for lack of better terms.  I feel like I am yanking the plug out.  I much prefer the \"mini USB\" port on my A230.- Even when using the Focus Peaking, I still feel that focusing using the EVF is difficult, especially in bright light.- The camera does not have the capability of using an aftermarket remote for shots, or even a Sony remote for that matter.  Very disappointing.  (Sony does have WIRED shutter release available)I started an A58 group on Flickr for myself and others to post some images.", "Date": "April 28, 2013"}, {"Title": "A58 vs A57 I've tested both for a month and here is my recommendation", "Author": "Andres \"AZC\"", "ReviewID": "R1MKUJBL99W1S2", "Overall": "4.0", "Content": "I will start by apologizing for the long review, but I felt it necessary to put some solid information out there concerning the A58 and how it compares to the A57...from an owners perspective.  Like you, I read everything possible on the A58 prior to purchase.  Unfortunately, this camera has had a lukewarm response from professional reviewers and has flown under the radar.  There's good reason for that. If you are a reviewer who has the camera in your possession for a few days or a week, you will likely see the obvious.  Unfortunately, many people read these reviews and then repeat the same misinformation on forums.  I am an experienced photographer who actually owns both the A58 and the A57, so I can give you a balanced opinion.  More importantly, I am not a fanboy of Sony (or any other camera manufacturer), nor am I a fanboy of the A58 or A57.  With that said, here are my observations.***Dispelling Myths***First, lets dispel some myths.  For starters, the plastic mount is not an issue and should not be a concern for most buyers.  It is a tough plastic that is solidly built and shows no signs of weakness.  After mounting the lens over and over again, I can't see any signs of wear.  If you somehow manage to break the mount, then it is likely that you would have done so with a metal mount.  Just use common sense, if your lens weighs 10 pounds, then it is probably wise to support its weight independently from the camera body (enough said).  Secondly, the build quality is slightly different than the A57, but every bit as good.  If anything, the grip material feels slightly tackier and better.  The plastic used on both cameras is of similar quality, but of slightly different texture.  They both look and feel good.  The buttons feel similar, but I do like the feel of the shutter on the A57 a little bit more.  Not a huge difference; it's more of a personal preference and not a quality issue.  As for the highly touted High ISO capability of this camera, the pro reviewers missed the mark and were fooled by Sony's clever trickery (more on this below).  It performs well, but not substantially better, if at all, than the A57.So which one is better?!!!  Well....it all the depends on the features which you value more and here's why...If you like the newest camera, marketed as having more megapixels, better high ISO, better EVF (viewfinder), with new technological wizardry like lock on object tracking, then stop reading and go buy the A58.  Unfortunately,  things aren't so clear cut when you look under the hood.***Megapixels***For example, 20.1 Mp's sounds like a great increase over the 16 Mp's found in the A57. In practice, however, the 4 extra megapixels do little in terms of cropping ability.  I took the same shots with both cameras and  tried cropping them to see if there was any tangible difference.  In real world cropping, the answer is \"no\".  If you crop 200%, then you might see a difference.  And if you are doing that, then you're engage in some activity, but I would not call it photography.***ISO Performance (the truth and why)***As for ISO, this camera really performs well.  Depending on how demanding you are, you can get acceptable results even as high as 6400 or 12800.  I don't recommend shooting at such high ISO's because a point and shoot camera with a flash will yield better results than this camera at 12800.  But the capability is still there.  So how does it compare to the A57?  They actually perform similarly, with the edge going to the A57.  WHAT? What did I just say?  It's true!Sony has improved the JPEG processing on this camera allowing it to perform well despite having more MP's.  They did this by employing very high levels of Noise Reduction at all ISO's, especially at the upper range.  Because of the slightly higher MP's, this gives a cleaner appearance at first blush, but upon closer inspection, you see that a whole lot of detail has been lost.  If you don't crop at all, this may not be an issue.  If you do, then you will be disappointed because it severely limits your ability to do any cropping at higher ISO's and even moderate ISO's.  When you do, you end up with a picture that lacks detail and pop.  Again, not a huge difference between the A58 and A57, but I like the JPEG output of the A57 better at all ISO's.  This was confirmed when I compared RAW files from both cameras.  Indeed, the A58 has much more visible noise at all ISO's.  I must give Sony credit for increasing MP's while maintaining noise levels in JPEG's.  However, in practice, this is just an illusion and results will be no better with this camera than those coming out of the A57.  Believe me, I shot both cameras under all types of conditions, metering, creative style settings, etc.  and the results were consistent.It should be noted that the A58 fixes an issue I found with both the A57 and Nex-6.  Those two cameras tend to underexpose by as much as two thirds to a full stop under low light conditions when using the standard multi segment metering (that is what most people, including many reviewers, use when shooting).  Many people ignore metering, but it is extremely important in getting the right exposure and for controlling noise.  Initially, it appeared that the A58 did indeed have much better ISO capabilities than the A57 (about half a stop to a full stop).  However, this only held true when using multi segment metering.  With multi segment, the A58 demonstrated substantially better noise performance at high ISO's.  However, when using center weighted or spot metering, the A57 performed as well, if not better than the A58 do to its less aggressive processing.  I believe this is why many have touted the A58 as having much better high ISO performance than the A57.  Underexposing at high ISO's invariably leads to much higher noise levels, especially in the shadows.  So don't buy the camera for it's perceived high ISO capabilities, because they are good, but no different than the current market options.  You will have better results in JPEG if you pay attention to your settings.  If you want better results, make sure your creative style is set to standard, drop down the contrast and sharpness and your images will look substantially less noisy than if shot in Vivid with boosted contrast and sharpness.  Be sure to meter correctly.  Underexposing shots (even  a little), can create much more noise at high ISO's.  (Just my two cents)***Electronic Viewfinder/LCD***Now for the EVF.  The EVF in the A58 is nice.  It has nice contrast and good colors.  In that sense, it is better than the one found in the A57.  The A57 looks washed out with much less contrast by comparison.  On the other hand, the A57 has greater magnification and looks bigger.  The A58's EVF looks like you are looking through a tunnel when comparing it next to the A57.  The A58's viewfinder is also more difficult to use in bright conditions. I found myself constantly cupping my hand over the viewfinder in bright daylight in order to see better.  It also displays a lot more noise/grain in low light situations.  After using both cameras extensively, I wouldn't get the A58 just for the improved EVF.  It is both good and bad and certainly not Sony's best implementation.  What you will find is that it is reasonably good and you will not be disappointed under most conditions.As for the LCD, there are many reviewers panning the smaller screen and its lower resolution.  Again, in practice, when compared to the A57's there is no real disadvantage.  It's good enough!  I never caught myself noticing the difference in size or resolution in actual use and I was using both cameras at the same time.  Yes, the A57's is bigger and has better resolution, but you won't be missing out by not having the size or resolution.  The same thing goes for the articulating aspect of the LCD. The A58's is similar to the implementation on the Nex-6 (which I also own) and I would not classify the A57's as being better.  It's just different and just as good under most circumstances.***Important Differences (FPS, Buffer Depth, Object Tracking and Auto ISO in Manual Mode)***-FPS/Buffer Depth:Now here is where we do get to some important differences.  If you like sports photography and are used to shooting in bursts, you should probably go with the A57 or something else.  There is the obvious 8-10-12 FPS advantage that the A57 has over the 3-5-10 FPS of the A58.  Remember that the A57 can shoot at 8 FPS while changing focus and exposure, the A58 can only do 5 FPS.  The A57 can even go to 10 FPS while locking exposure at full resolution.  The A58 cannot.  The A58 can do 8 FPS, but this it at a reduced resolution and with locked exposure.  The A57 does the same at 12 FPS, with an even still larger file size.Unfortunately, the buffer/processor on the A58 has not been updated to cope with the demands of higher MP's and processing requirements.  As such, with normal-high noise reduction and/or lens distortion correction set to \"auto\", you will get 3-4 shots before the camera slows down.  Sure it will shoot at five FPS, but you'll only get three in practice before it slows down.  You will then need to wait a second or two to let the buffer catch up before shooting another burst.  It's not an issue for most photographic scenarios, but it is a deal breaker for high ISO sports shooting.  And this is a real shame because the new object auto-lock function is really great and superior to that found on the A57.  You can work around this by lowering your noise reduction to \"low\" and setting lens distortion correction to \"off\".  This will allow you to shoot at 5 fps without limitations, but be prepared to do more noise reduction and/or distortion correction in post-production.  Not an issue for some, but it is one for me.  By contrast, the A57 can shoot an acceptable amount of frames with both these settings on and can go on endlessly (or so it seems) if you turn off lens distortion correction. The A57's much larger effective buffer and its ability to shoot at much higher FPS for far longer, is more desirable in my opinion.  In that category, the A57 wins hands down.  All is not lost for the A58. You can still use it for sports in a pinch.  It does manage to shoot at 8 FPS, albeit at a reduced MP level.  Unfortunately,  this mode automatically reduces your resolution and cropping ability.  As mentioned above, the A57 can do the same, but at an even higher resolution and at 12 FPS.  This is where Sony cut corners in order to keep the price low.-Object Tracking:Both cameras have object tracking.  The function sets up a focus rectangle the follows the object being tracked as it passes through the various focus points.  However, the A57 often fails to lock focus on the object despite following it, relying on standard focusing processes to lock focus when releasing the shutter.  It works well enough on the A57, but it's at another level on the A58.  In the A58, the camera actually changes the shape of the box and its size to match the actual object being followed.  In my testing, the A58 managed to lock focus (green borders) on the subject much more so than the A57 did on the same objects.  This allows for much easier tracking when shooting moving subjects.  Having said all of that, I never felt at a disadvantage when using the A57.  Its version works well enough and its face recognition works just as well.  All in all, this is a cool feature, but not a deal maker on it's own and I wouldn't buy an A58 just for this feature.-ISO in Manual Mode:And finally Sony listened to its customers by adding Auto ISO in manual mode to the A58...It's about time!!!  For example, in the A57 and NEX-6 you have to manually select all parameters, including ISO when in manual mode.  Canon and Nikon have been implementing auto ISO in manual mode for years in all their DSLRs.  I'm glad Sony finally came around.  Now if they only allowed you to set upper/lower limits along with shutter speed minimums...I know, that's too much to ask for.***Ergonomics (Size and Weight)***Both cameras feel good in the hand and are more similar than different.  As for size and weight, both cameras feel about the same, but the A58 is slightly smaller (actually shorter) and lighter.  It is difficult to tell the difference, but you can feel the difference more than you can see it.  If you have small hands, you will definitely like the A58 more.***Minor Focus Issue (Back Focusing)***I have read a few reports that the A58 has some focus accuracy issues.  My testing confirms these findings, at least with my copy of the A58.  The camera routinely back focused on shots without rhyme or reason.  I am an experienced photographer and know for certain that it wasn't user error.  I did not experience these same problems with the A57.  Having said that, it wasn't too bad and mostly noticeable because I was looking for such issues.  In real world use with the standard kit lens, you will likely not notice any issues.  If you use large aperture lenses, you may want to test this out before the return period expires.Conclusion and Recommendation:So which one am I going to keep.....I'm leaning toward the A57.  For my needs, it has a good enough EVF.  It has better dynamic range in RAW files.  It gives me better sports capabilities and I find that many of the new features that the A58 has are not absolute must haves for me.  Still, I have not made a final decision and I would recommend the A58 to anyone as an incredible bang for the buck camera.  Canon and Nikon cannot compete with this camera at this price point.  I have owned or still own current generation Canon and Nikon bodies and I am well aware of their capabilities and I think that the A58 has a much better feature set for the money and better high ISO capability straight out of the camera than either Canon or Nikon.  If you prefer shooting RAW, you may want to consider the A57 or a Canon/Nikon.  If you are JPEG shooter, then don't think it twice and get this camera.  You will absolutely enjoy all its features and will forgive its shortcomings when you consider how little you spent.", "Date": "January 22, 2014"}, {"Title": "Easy To Overlook", "Author": "C. Martin", "ReviewID": "R1W0LI8DP4KVQ8", "Overall": "5.0", "Content": "The A58 gets some negative press based on how it compares to the A57.  Sony should have probably named it the A48 or something like that.  However, this is a great camera in its own right.  I owned the A57 and like the A58 better for the following reasons:1.  The OLED viewfinder is MUCH better than the viewfinder on the A57.  I honestly did not think the difference would be a big deal.  But, after using it, my opinion is different.2.  The JPEG image quality is the best I have seen on an Alpha camera to date.  Sony finally tweaked the JPEG engine for better results.3.  The quiet shutter sound of the A58 is great. This is especially useful in a quiet setting.Highly recommended camera...", "Date": "July 10, 2013"}, {"Title": "Superb entry level camera", "Author": "David C", "ReviewID": "R1SHDIYLGTLDO3", "Overall": "5.0", "Content": "I have had this camera for a couple of months now and I will start this by saying I am not even close to a professional and never will be.  However, this camera is simply great.  All of these people on here dogging it because of the lens mount or the viewfinder are really just grabbing at straws in my opinion.  This is not marketed as a professional grade camera and unless you are a professional photographer, who is switching lenses dozens of times daily?  I have done several lens swaps and had no problems and after looking at the overall build quality on this camera, I am not worried about the mount wearing out.  I used to have a Nikon D3100 which was great for my needs but I dropped it and ruined the lens and the body so I needed a new one.  I was going to just get another 3100 but decided I'd look around first.  Personally, I love the electronic viewfinder compared to the traditional type found on the rest of the DSLRs on the market.  It makes it easy for an amateur to see exactly what the shot will look like before you take it.  The video quality is second to none.  It is better than the Rebel T5i (my sister owns) and the D5200 (my neighbor owns).  I am going to get an external mic before long to completely get rid of the noise of the auto focus but it is nowhere near as loud or annoying as some would have you believe.  Coming from a Nikon, the controls are slightly different. I wouldn't say better or worse, just different.  I mention this because some people say the controls are not user friendly but I say BS to that as well.  If you learned on something else, you are used to that format and anything different will take some getting used to.  For me, the image quality is better than anything in its class (sub $800).  Even the high ISO pics I have tried gave me less noise than I was ever able to achieve on my old Nikon.  All in all, if you are in the market for and entry level camera and aren't afraid to stand up to all the Nikon and Canon fan boys out there, this camera will surpass your expectations.", "Date": "December 2, 2013"}, {"Title": "Decent camera but mis-named by Sony", "Author": "Adam Brown", "ReviewID": "R3J2G51K4XUXNI", "Overall": "3.0", "Content": "Those who are familiar with recent Sony dSLTs/dSLRs will be confused by this product.  As a disclaimer, let me state that I do not own this camera.  I do own an earlier model, and I did take a look at and handle this camera.One would expect the Sony A58 to be an update of the A57.  This is NOT the case at all.  Sony had 4 models previously.  The entry level was the A37.  The top tier APS-C camera was the A77.  In between, they had the A57 and the A65.  With the introduction of the A58, they have replaced the A37 and the A57.  In reality, this is the update of the A37.  The A57 was discontinued, but was not replaced.For the most part, this camera would be a significant downgrade from the A57.  (While a clear update from the A37).Before getting into a comparison of the cameras, a little background on Sony dSLTs.  Sony no longer makes dSLRs.  The A37/57/58 retain the form factor of a dSLR, and most of the basic functionality of a dSLR, but it's actually a very different camera.A true dSLR has a move-able mirror between the lens and the sensor.  The mirror reflects the image into the optical viewfinder, where the photographer views a reflected image of their subject.  While being reflected into the optical viewfinder, the image is also reflected into a dedicated auto-focus array, which is typically superior to non-dSLR cameras.  In order to take a picture, the mirror flips up, and the light from the subject travels to the sensor which is behind the mirror.  Sony dSLTs use a translucent fixed mirror -- The mirror doesn't flip.  Instead, most of the light travels directly through the mirror, onto the sensor.  The mirror reflects upwards just enough light, to feed a dedicated autofocus sensor.  But it doesn't reflect enough light for an optical viewfinder.  So therefore, Sony uses an electronic viewfinder.For a typical consumer -- That is the main difference you will notice, an electronic viewdfinder, instead of an optical viewfinder.This whole setup has some very basic advantages.  Since you're never blocking the main sensor, you can always use \"live view\" on the LCD screen.  On other dSLRs, to have live-view on the LCD screen, you first need to flip up the mirror, which means you lose the superior autofocus array.  (Typically such dSLRs have a secondary inferior auto focus array on the sensor).  So with most dSLRs, if you choose to use the LCD screen instead of the optical viewfinder, you are sacrificing auto-focus speed.  On the Sony dSLT, you can instantly switch back and forth between the \"live view\" on LCD, and the viewfinder.  Get full autofocus either way.  Makes it much much easier to use the LCD for composing photos. Means you can shoot video with full auto focus, which isn't possible on most other dSLRs.Another great advantage of the Sony dSLT -- Since you don't have to flip the mirror between shots, the cameras can theoretically shoot at very high burst rates (high frames per second).Now let's look at the Sony A57 compared to the A58.The A57 had a large, fully articulated, high resolution LCD screen.  Considering how great the \"live view\" feature on a dSLT is, it is nice to have a great LCD screen to use it.  The A58 went with a smaller screen, lower resolution, which can tilt, but not fully articulate.  So the \"live view\" is much better on the A57 than on the A58.A benefit I use significantly on my dSLT is the high burst rate -- 10 frames per second.  The A57 can shoot full resolution photos at 10 frames per second.  Fantastic for shooting sports.  Great for trying to snap portraits of the kids when you want just the right facial expression.  Outside of super expensive professional cameras, there really are no other dSLRs than can shoot 10 frames per second.  Most consumer level dSLRs shoot at 4-5 frames per second.So what can the A58 shoot?  At full resolution, a mere 5 frames per second.  Not bad, but no better than the competitors.  There is a \"crop mode\" that can shoot at 8 frames per second -- Capturing a lower resolution crop of just the center of the image.THere are some other downgrades as well (a plastic lens mount instead of metal, for example).Now, the A58 is still a very good camera for the price.  And there are some upgrades -- It has a 20 megapixel sensor compared to 16 on the A57.  (Though there is very limited value to the extra 4 megapixels).  It also have a slightly upgraded electronic viewfinder.  (Same resolution, but a slightly better technology).Finally, the A58 does have some software updates, which are nice for the true entry level photographer.  For example, there is an auto-crop feature, which automatically crops a picture based on some basic rules of composition, giving you a suggested final photograph.  This would be useless to an experienced photographer, but it can be helpful to someone newer.Still, when considering the few advantages of the A58, and the many disadvantages when compared to the A57 -- I'd recommend that interested buyers grab any remaining A57s while they are at clearance pricing.  For the same money, the A57 is a better camera than the A58.The A58 isn't a bad camera, but it should have been named the A38.", "Date": "May 10, 2013"}, {"Title": "Great camera, SteadyShot Inside is the ultimate feature, 1080i60 is the main downside", "Author": "Chris S.", "ReviewID": "R3O9Z0BZE76JFL", "Overall": "5.0", "Content": "We use this as an inexpensive camera for mobile shots and a Canon 5D for studio shots.Excellent image quality and a great selection of lenses.  The lens mount hasn't failed, and I imagine Sony knows how to engineer and test something like that.If there was one thing I could change, it would be that the video quality, while excellent, would be better if it supported 1080p60 at higher bitrates, even if that was outside some arbitrary standard.Otherwise, a great camera.", "Date": "December 20, 2013"}, {"Title": "Excellent camera, especially in consideration of price.", "Author": "Hefeweizen", "ReviewID": "R2VK6F0LGSHF6C", "Overall": "5.0", "Content": "I  bought this camera as a second camera to take along when I do not want to change lenses constantly.  I also have an Alpha 65.  I upgraded from an older Alpha 200.  It is great to pair a 8 to 16mm or 70-300mm with a 17 - 50mm.I could not be more happy with my purchase.  Incredible quality and features for the price.  The EVF is indispensable, probably one on my favorite features (100% coverage, focus check, DOF check, real time histogram before you take the shot, etc.).  In camera HDR is excellent.  Hand Held Twilight/ multi frame noise reduction also are excellent in the correct situations (providing extremely high light sesitivity with low noise for non-moving subjects).  Yes, the sensor starts to get noisy at 1600 ISO, but is easily useable up to 6400 with good raw processing.  I can not notice any difference between the 24 MP sensor in the alpha 65 and the 20 MP sensor in this camera.I would not worry about the slightly smaller LCD or plastic lens mounting plate (durability can be superior depending on the material used).I have read a few negative reviews of this camera, most complaining about a missing feature or the smaller LCD.  I do not believe any other camera can match these features at this price, especially if you subtract the value of the kit lens that comes with it.  If you are looking for a more upscale camera with all the features, there are many cameras from $1000 to $2000 price range that may fit the bill.", "Date": "September 20, 2013"}, {"Title": "Conclusion after 1 week of use...", "Author": "E. Tucker", "ReviewID": "R3R4J0TQ5D7VIT", "Overall": "5.0", "Content": "The \"upgrade\" that you would imagine the A58 is over the A57 is all but that.  Be sure to compare features carefully before you purchase because there are definitely differences between the A57 and the A58 and not all of them are better on the A58.The viewfinder and LCD screen are smaller than they could be (A57 is 3 inches and A58 is only 2.7 inches).  Speed and performance have taken a hit with the increased resolution as well. However, it still compares well feature-wise with its rivals but with a lower price. It can't quite match the quality and performance of the Pentax K-30.http://www.amazon.com/gp/product/B0082OJ2VE/ref=as_li_ss_tl?ie=UTF8&camp;=1789&creative;=390957&creativeASIN;=B0082OJ2VE&linkCode;=as2&tag;=stupisms-20However, if you want an SLR-like camera but also want live view, video autofocus and lots of interesting shooting modes, the A58 is an excellent choice.", "Date": "April 24, 2013"}, {"Title": "Your problems are solved.", "Author": "E", "ReviewID": "R6QD473A5RGBI", "Overall": "5.0", "Content": "This is a great camera. Don't worry about all the bs you are going to read about the plastic lens mount or the translucent mirror technology being worse than the floppy mirror of yesterday.  It's been fairly easy to learn with and has been taking awesome photos right from the start.  If you are just getting started and you are trying to pick between the canon, Nikon and Sony like I was, go with this camera.  Great frame rate, great low light shooting.  If you get a chance to get an extra lens do so. You will find Minolta Lenses online that work fine with the camera. I picked up a 50mm f1.7 for $60 and it is amazing with this camera.  There is a. 70mm - 300 kit lenses that often comes with this in a package. Get that, it will help keep you from getting bored.  The most important thing is to get out and press that button as much as you can, and certainly play with those manual settings.  There is a lot of talk going back and forth about what camera is best to start on, and a lot of people will get caught up on things that don't mean much to beginners. Everything I was looking for in a camera, this one has.  Don't waste time looking for the a57 which some of these whiners will tell you is better.  Just buy the camera and enjoy it. If you turn out to be serious about the hobby, you will have a new higher grade camera as soon as you can afford one anyway.  For the money, you can't go wrong.EVF stands for electronic view finder and there is one on this camera and I find it to be fantastic. I love the ability to make my ISO and shutter speed changes and see the results in the view finder or the rear screen for that matter.  If you are new to DSLR's you will love it, if you are a long time user of old DSLR's you will complain that its not better for a week and then realize you were wrong.update: 2/5/14Still loving this camera. I don't leave manual settings anymore.  I picked up a $79 Yongnuo YN 560 III flash which works fine with this camera. It is a manual flash but I dont mind, the alternative is a $400 $ony flash. the Yongnuo flash doesnt work with the A58's wireless like I was hoping, so I picked up the Yongnuo RF-603 C3 remote triggers for $35, you have to solder a resistor into these to get them to work on a Sony camera but that is very easy to do and there are directions online.  Some of the directions tell you to take a cutting tool to the trigger body, you dont need to do that, just solder in the 120kohm resistor.With the release of the A7 and A7R with the multi-interface shoe  I'ld bet you will see some great stuff coming out in the next year, which makes buying this camera all the better.I haven't had any issues with the plastic lens mount and I don't notice any issues with any photo brightness problems caused by the translucent mirror.  Two things that so many other people had to complain about in other reviews.  I doubt they own this camera, and if they did, they sent it back for ridiculous reasons.  Yes it has a slightly smaller screen on the back.. big deal-- it doesn't make any difference to me and probably wont to you either.  Im not watching amazon prime movies on it, Im not editing photos on it, I use the viewfinder way more than the rear screen and you probably will too.update: 5/27/14camera is still awesome.. Kinda noisy at 3200 ISO, but you will find that with most of the smaller sensor cameras.  NO WEAR at all on the plastic lens mount that every one had problems with .. no scratches on it.. NOTHING,, can't even tell a lens has been removed from it, and trust me I have been removing and putting on lenses a lot.  Battery life is great for me.. Im not a pro, I have yet to get it under 60% on a single day of shooting..  the only problem I have right now is that the price is almost $200 less now than it was when I bought it..  you gotta buy this camera for that price.", "Date": "October 10, 2013"}, {"Title": "A New Entry Level DSLR Contender has arrived!", "Author": "OldPhotoGuy", "ReviewID": "R10V5TQ5DXDP7V", "Overall": "4.0", "Content": "If you're tired of trying to get great pics from a pocket-sized point and shoot cameras under $400 and ready to buy A DSLR with an automatic mode that will give you awesome pics suitable for enlargement, the new Sony SLT-A58K should be on your short list. Technically speaking, this is not a traditional DSLR built in the same way as a Canon T3 or Nikon D3100 because of the mirror set-up and presence of an electronic viewfinder vs a thru-the-lens viewfinder, but I won't bog you down with technical details since the Sony camera competes in that category and has interchangeable lenses like traditional DSLRs.  In fact, this A mount offers owners of the old Minolta Maxxum film SLR cameras a digital body to use all those old lenses you have hanging around. I have some of those, but haven't tested them on the camera yet, so I will update this review when I do. But it is a reason that drew me to look at this camera closely, along with advertisement brochures boasting more great fast and fine autofocused pics and videos, which is what I wanted. Up to now, I have been ecstatic (and still am) with my entry-level Canon T3 that I paid under $400 for and have owned for about 3 years. I have done side by side shoot comparisons of this camera against it's more expensive brothers in the same line (Canon T3i, T4i, T5i) as well as Nikons like the D3100, D3200, D5100, and D5200. In each case, I preferred my T3 and the results over all these cameras. However, this new breed Sony with it's Intelligent Auto and IA+ modes finally gave me a reason to add another camera to my arsenal. The final pics downloaded to my PC were sharper, crisper, more detailed, and more accurately colored than those taken with my Canon T3. I was both amazed and impressed. The Sony A58 performed as advertised, and that's the outcome one should get today when comparing a 12 megapixel camera to a 20 megapixel camera with the latest large sensor. The videos were equally impressive with decent autofocus throughout my tests and good sound, too. I'm a bottom line guy, and the results are better so I'm keeping this camera and adding it to my shooting arsenal. Are there any cons? A few, mostly having to do with the camera's build. The Sony is bigger than both the Canon T3 or Nikon D3100, yet weights less as it is much more \"plasticky\" than either of those two. It doesn't have a real quality feel like it's competitors but does have a comfortable shape for even big hands to hold. Even the on/off thumb switch seems cheap, so I just pray it will hold up like Canons and Nikons do.  The SD card department could use some redesign has big hands can't easily insert and remove the card. It's not awful, it just could be better. The Electronic View Finder (EVF) takes some getting use to, and the LCD screen could have more MPs, but since it's only for pic review it's not a real big deal. The LCD screen does tilt up and down a bit, but they should have made it fold out and swivel like many others as that capability helps a lot with videos and LCD protection during storage. Cost wise, you can now pick this up for around $450, so it's about $60 more than the current deal on a Canon T3 or Nikon D3100 but probably worth it. If it was still selling for its $600 MSRP, I would have skipped it, but I think $450 puts it in the right class now. One other noteworthy feature, like the Canon cameras, the manual zoom on the 18-55mm lens is very easy to manipulate whereas the Nikons take a big more muscle. That's my list of pros and cons after a week of ownership. I'll keep you updated as I use it more and learn more.3-1-14 Update: Finally got a chance to try out the old Minolta Maxxum autofocus lenses stored with that SLR film camera from the late 80s or early 90s. The prime 50mm F1.7 installed and worked perfectly with the new Sony A58 digital body and should make a great portrait lens. I was a little worried about the 28-85mm Maxxum zoom lens because it was made back in the good ol' days and weighs a ton, far more than the camera body or even the camera body with the 18-55mm kit lens on it. A lot of reviewer criticism about this model's plastic lens mount made me wonder if it would hold it or snap off. The zoom lens did install OK and seemed secure, but of course its front-heavy weight demands you hold onto it at all times whether shooting or waiting to shoot. The autofocus function also performed well on this old unit, but frankly, this Maxxum zoom lens will be only be used at when needed as it's much too long and heavy to carry with me all the time. The compact 50mm F1.7, however, will have a home in my carrying case. So, all in all, bringing these lenses out of storage and back to use has given me another reason to be happy with this camera's purchase.", "Date": "February 27, 2014"}, {"Title": "Returned for A57", "Author": "Kevin P", "ReviewID": "R1YJ4TK35CMF7H", "Overall": "3.0", "Content": "I've owned a Sony A33 for over 2 years and felt the camera met my needs fairly well. Since it was a 1st gen product (of the SLT line), I've always planned to upgrade it when Sony released something new. As the A58 is the 3rd generation SLT, I thought it would be great and pre-ordered one. You can read many reviews on the A58 where they will talk about the pros/cons of the new model compared to the previous A57, but for me, all I cared about was: was the camera worth the $500-$600 over the A33 I currently had. I debated back and forth and with both cameras in hand, testing image quality, AWB, usability, etc., I ended up begrudgingly returning the A58. The main issues for me that made it not worth the upgrade was the lower resolution and smaller LCD (I couldn't even tell if a shot was in focus unless I zoomed the playback image!), slower FPS, and the lack of the Infrared Remote (IR) commander support (yes, the camera has a window in the grip, but it is disabled or missing in the software). Even though it had some new features, better battery life, and image quality improved slightly over the A33, the missing features that impacted my personal usability were too much, and the A58 went back.I then looked at the A57, which was now on clearance and picked one up for $459 ($175 less than A58). This seemed like a clear upgrade in almost every way over the A33, and had none of the drawbacks of the A58, and a lower cost. Sony had an opportunity with the A58 and blew it. I had high hopes for it and was sorely disappointed. I would not recommend the A58 to anybody unless they strictly use the EVF for shooting, which in that case I likely wouldn't recommend a SLT camera anyways.", "Date": "May 10, 2013"}, {"Title": "Great Camera!", "Author": "Doting Dad", "ReviewID": "R1V8Z1TZHA770T", "Overall": "5.0", "Content": "I bought this and loved it from the very first shot. I was worried about the lack of touchscreen capabilities for spot focus situations but this camera's auto-tracking eliminates the need. Great images, great color rendition, smooth flawless operation in a package that is relatively light in weight compared to other DSLRs. Thanks to translucent mirror technology it has constant live view which is a big plus and something you usually don't find in cameras with a sensor this large.", "Date": "January 27, 2014"}, {"Title": "Sony SLT-A58K camera", "Author": "VINICIUS", "ReviewID": "R2VDJF1X0FA3BR", "Overall": "5.0", "Content": "I recommend to buy this camera Sony SLT-A58K, very good, has a nice picture, many resources to a good image.", "Date": "July 10, 2013"}, {"Title": "Great camera for the price", "Author": "Bohemus", "ReviewID": "R2KMNXJY3STDZL", "Overall": "5.0", "Content": "This is an excellent camera for a first time DSLR user. Has a very intuitive and interactive interface. Takes great pictures out of the box. For the money, there is no better camera in my opinion.", "Date": "January 15, 2014"}, {"Title": "Best Entry Level DSLR!!", "Author": "Steven Kearney", "ReviewID": "R22OWVKVWHREDS", "Overall": "5.0", "Content": "I recently purchased this camera after a good bit of research knowing this was the camera for me.  The a58 has a solid feel in your hands and not like some of the other entry level DSLR's which feel cheap and empty.  The arrangement of the buttons and features on the body is perfect and after a few hours you're whizzing through settings in seconds!The picture quality is amazing! I came from a Canon Powershot S3 with 6 MP and honestly didn't know a picture could look this good!! This is one of the best entry level camera's on the market that I'd recommend to anyone looking to get into the DSLR game.", "Date": "December 30, 2013"}, {"Title": "Excellent camera at a great price", "Author": "Amazon Customer", "ReviewID": "R3DBKW6U7QIIE", "Overall": "5.0", "Content": "Very responsive with accurate focus, articulating LCD display, great electronic viewfinder.  Picture quality very good even in poor light.  Lens image quality is much better then expected from a kit lens.", "Date": "May 7, 2014"}, {"Title": "Love the low-light mode", "Author": "Theropod-X", "ReviewID": "R69RH6G8RH5XP", "Overall": "5.0", "Content": "Ok plenty of general reviews, but I just want to point out how great the twilight mode is. Camera takes several photos in quick succession and then combines them to create a low-noise image in extremely low light. Amazing.Great all-around camera too. Still just learning it's features/functions, but very impressed so far. Amazing for the price, too.", "Date": "May 1, 2014"}, {"Title": "Blows away my Canon Rebel", "Author": "S. PELLEGRINO \"S. Pellegrino\"", "ReviewID": "R2OFEWB59XTU7R", "Overall": "5.0", "Content": "this has to be one of the best camera's I've ever used. its only been a few days - but the features are so easy to use. the photos are exactly what i want - and I'm so surprised because i have ALWAYS had a Nikon or Canon and i thought going to Sony for a camera was like going to KFC for a burger.  But it does everything i need you can't beat the price!", "Date": "April 2, 2014"}, {"Title": "Sony Alpha SLT-A58", "Author": "Daniel Rich", "ReviewID": "R15HC76V61QYKA", "Overall": "5.0", "Content": "A lot has been written about the various Sony Alpha series cameras, which I will not repeat.However, suffice to say that while the A-57 has a few features that the A-58 does not have,like a LCD screen with more resolution as well faster shooting in the sports mode, there arecompelling reasons to buy this new version, the A-58.First of all, it is the current version offered by Sony, since the A-57 is no longer a currentmodel.  Secondly, while the new LCD screen has less resolution, it seems satisfactory inevery day use and you do get vastly improved battery life as well as an improved electronicviewfinder.Some people were concerned about the use of a partially plastic lens mounting ring, but Iinterchange both the kit lens and a 18mm-200mm telephoto lens and don't see any problems.I presume that this will not be an issue even after extended use.While the kit lens of 18-55mm may vary well suit your needs,  especially since with theclear zoom function you get up to about 166mm ( in a 35mm camera).  This range mightvery well cover most everyday shooting situations.  However, for added flexibility,  I electedto add the 18-200mm Tamron telephoto lens.  This is obviously a question of personalchoice and preference.I am thrilled with the image quality of this camera, as well as the operating convenience.I love being able to conveniently and easily change the ISO settings as well as a bunchof other setters just by using the FN button.The battery life seems improved, the image stabilization works well and all in all, I amtotally thrilled with this camera, and would recommend it, without reservations,  to anyserious photographer.", "Date": "March 26, 2014"}, {"Title": "nice", "Author": "Woody", "ReviewID": "R20MY3ZBCW2MPQ", "Overall": "4.0", "Content": "Very nice camera for pictures and video. We have a Sony A350 camera that has a broken shutter button, so the good thing here is that the battery and the lenses can be used on either camera. My wife has about 2500 dollars in lenses for the A350 but can use them on the SLT A58 camera. I do recommend this camera, it is nice and will produce good photos for you.", "Date": "February 22, 2014"}, {"Title": "Love The Image Quality", "Author": "peezy", "ReviewID": "R1WMWW86HVD4E0", "Overall": "5.0", "Content": "I use to love using my sisters camera back in the days in Thailand for vacation and now I started to want to take photography for my hobby. I'm a amateur so I search around online and found out that peoples been giving this a58 some bad reviews. Honestly this is a real good camera that you just want to take good quality pictures without focusing it yourself. I'll see when I learn more about photography when I have more time but I still love my Sony a58 and it gets everything what i want to take and the photo comes out a crisp quality photo every time.", "Date": "January 4, 2014"}, {"Title": "Good Purchase for me", "Author": "Fred Jr", "ReviewID": "R1W3XEHVEJV9I2", "Overall": "4.0", "Content": "It takes very good pictures and seems to have a solid construction base.  I just wish that the cap for the utility light connection came with the purchase.  It is a $7 accessory.A big note is that I purchased it and 2 days later the price was dropped by $50 and I could not get in touch with Amazon.  I almost sent it back to save the $50 and to do a re-purchase afterwards.Good camera.", "Date": "May 25, 2014"}, {"Title": "best camera you can find under that price", "Author": "CDK \"cdk\"", "ReviewID": "R3Q28DE5YGIRQN", "Overall": "5.0", "Content": "I did all my research, canon, nikon, Sony, you name it. This camera was for my wife who is learning photography now, so we wanted a nice entry camera level. This is perfect. My camera is a canon 6D.This camera is the best thing you can get by far for under 800bucks", "Date": "May 22, 2014"}, {"Title": "perfect", "Author": "annieb", "ReviewID": "R1166VH4HG5G6S", "Overall": "5.0", "Content": "I've wanted a \"good\" camera for years and finally treated myself.  This was recommended to me by a professional photographer friend, and I am so glad.  It's light, it has more choices than I know (yet) what to do with, and I really love the quality of the photos.  I'm still figuring it out, and having a good time at it.", "Date": "May 6, 2014"}, {"Title": "Great Camera!!", "Author": "Flor", "ReviewID": "R1SC0T00A3KB5N", "Overall": "4.0", "Content": "This is a great camera, this is a small size so as to fit the small hand. It takes great pictures and videos.", "Date": "May 1, 2014"}, {"Title": "Great camera. Great photos!", "Author": "Joyful Mourning - A True Love Story \"Doc-comp...", "ReviewID": "R4IE3ZW7I9SBW", "Overall": "5.0", "Content": "A lot to learn but easy to start. I hope this Sony lasts longer than our others. They take such great pictures compared to their competitors as reviewed by photographers on independent sites that we are trying again. I have this one and my wife has the SLT-37.It is nice that these use an SD card unlike the A-200 and A-300 we had before. Both of them still take pics but one of them will not take the pic straight on. In other words, what you see in the viewfinder has moved over one way or the other a slight amount.So I may add some info later after we have had these longer.", "Date": "April 2, 2014"}, {"Title": "a wonderful camera", "Author": "Keun-young Anthony Kim", "ReviewID": "R2H4HHU1H7EYAH", "Overall": "5.0", "Content": "I own a Canon Mach5.  I love that camera.  But, sometimes, I do not want to carry the beast around.  That's when this camera comes in.  Beautiful quality.  I recommend getting a small uv or lens filter to protect the lens though.", "Date": "March 11, 2014"}, {"Title": "Great Camera", "Author": "B123", "ReviewID": "R1CTLRBMR1RVPG", "Overall": "5.0", "Content": "My favorite feature about this camera is the adjustable screen.  I have used it multiple times when trying to shoot difficult shots.  The camera takes excellent pictures.  There is good battery life.  We just got done with a family trip and we were very pleased with all of the settings and picture effects.  It is a great camera!", "Date": "January 2, 2014"}, {"Title": "The camera is a great camera for point and shooters moving up.", "Author": "gregg lamping", "ReviewID": "R1JQG9AQYR7SUG", "Overall": "4.0", "Content": "I wanted to move to a camera with faster lens and sampling, and a better flash.  Although I did not require interchangeable lenses, the camera with lens came at an attractive price.  I am still learning the more complex aspects of the camera, but out of the box on Auto, I am extremely happy with the results.", "Date": "August 13, 2013"}, {"Title": "Great starting SLR", "Author": "JVelarmino", "ReviewID": "RB766DFGO08W9", "Overall": "4.0", "Content": "This is a very user friendly SLR kit, with beautiful results. I'm taking out a star because it doesn't have the screen that opens and tilts all the way like the Canons.", "Date": "May 24, 2013"}, {"Title": "great camera", "Author": "andrew w", "ReviewID": "R31V4XACCE5PX1", "Overall": "5.0", "Content": "love this camera, used it for a short film works great, the only thing is that you cannot change the fps. but its not but to the point where i will change the stars.", "Date": "July 3, 2013"}, {"Title": "NICE", "Author": "wscabuzzo", "ReviewID": "R6QBQ89MX14J7", "Overall": "5.0", "Content": "WORK PERFECTLY FOR ME!!! PRITTY COOL, AND EVERYTHING LIKE THE SALER SAID. I DONT HAVE ANYPROBLEM WITH ANYTHING.... GOOD JOB GUYS", "Date": "September 3, 2013"}, {"Title": "Very poor product", "Author": "Michael F. Louis \"MFL\"", "ReviewID": "RKRXKUF88XJEI", "Overall": "1.0", "Content": "Description shows that it has a 3 inch LCD and it is only 2.7.  I found the information difficult to read because of the screen size not to mention the resolution which was absolutely impossible to make out in the bright day light.  Sony have downgraded their product and the A57 is head and shoulders better than this item.  I don't know what Sony was thinking by making a plastic lens mount.  Sony is known for superior products and this item did not even rate and Sony should withdraw A58 and redesign.  The only feature better than A57 is the higher megapixel.  Rumor has it that Sony plans to make only mirror-less cameras but we have no verification.", "Date": "June 16, 2013"}, {"Title": "I am very disappointed", "Author": "Alex L.", "ReviewID": "R2BXE31YXKMAS6", "Overall": "1.0", "Content": "Lower quality than previous models, does not support the wireless remote control, the display is 2.7 Inches, with low image quality. Hdmi cable not included audio or video cable. Made in Thailand. Very short power cable. I do not recommend it, better buy a Nikon. I am very disappointed.", "Date": "September 23, 2013"}], "ProductInfo": {"Price": "$599.99", "Features": "20.1 MP Exmor HD APS sensor with 5 FPS shooting\nTranslucent Mirror Technology accelerates AF performance\n1080/60i/24p Full HD or 1080/30p MP4 movies w/ Quick AF\nLock-on AF for even easier focusing of moving subjects\nSVGA OLED True-Finder optimizes eye-level framing", "Name": "Sony SLT-A58K Digital SLR Kit with 18-55mm Zoom Lens, 20.1MP SLR Camera with 2.7 -Inch LCD Screen (Black)", "ImgURL": "http://ecx.images-amazon.com/images/I/41z6P0tO01L._SX300_.jpg", "ProductID": "B00BF9MVMK"}}