{"Reviews": [{"Title": "It's actually very nice.", "Author": "Mermaid", "ReviewID": "R26AY1OELO2PKU", "Overall": "4.0", "Content": "I've had several Nikon coolpix and am looking at this one today to buy. They are great camera!To the person who wrote that first review, who complained: \"The first thing I noticed was that I could not just hit the play button to view pictures and video, but I had to actually turn on the camera. When you power the camera the lens extends, where in the Canon, you hit the play button and you can view pictures and videos and your lens retracted with the lens cover closed.\"With the camera off, you hold down the replay pix button for a couple-two-three seconds and the camera and screen turns on, arrow buttons scroll through the pix you have taken. Without opening the lens.That darn user's manual....", "Date": "May 11, 2013"}, {"Title": "Lens Problem", "Author": "Joel A. Goverman", "ReviewID": "R14NZ0VPBZJZ9J", "Overall": "1.0", "Content": "Bought the product as a backup camera for a trip to Alaska.  Tested everything out the night before the trip.  Everything worked fine.  Put the camera immediately into the case.  Camera was never dropped, jostled, etc.  When I was in Alaska, ready to take the first picture, the lens wouldn't come out.  Kept getting error message, \"lens error\".  No other function on the camera would work, except the on/off button.  Called the help line, but no luck. Fortunately, I had another camera, or this could have been an absolute disaster.  Judging from two other reviews, this product has a serious defect.  I don't understand why it is still being sold.", "Date": "June 9, 2013"}, {"Title": "So far so good", "Author": "Cathy Crane", "ReviewID": "R14VB954D0IPS0", "Overall": "4.0", "Content": "I got this camera a couple weeks ago at a local camera shop.  Most places in my area were selling the bundle for a Mother's Day special...I really like the plum color too.  I had a bunch of questions before buying it due to all the bad or so so reviews.  I like this camera.  It fits almost anywhere, it works the way the manual says it should, it charges fast, the pics look good and I even took some of my pets which were not blurry as some have stated.  Maybe my pets are not quick to move.  I got this to take on a 2 week east coast trip and wanted something that was easier to carry than my other camera.  I'm happy with it so far and can't complain.  I did buy an extra battery since I was not sure how long the battery life was.***UPDATE****I bought this camera for a 2 week trip to the east coast.  Four days into my trip, the camera lens would not extend when turned on.  When the lens finally did extend, the camera would not focus and if I tried to zoom, it would only zoom a millimeter, turn itself off and give me a Lens Error.  I called the camera shop I bought it from to see if there was something going on that I just needed to reset the camera, but they were no help.  They told me I would have to bring the camera in and they would check it to see if I had done something to cause the lens to get off track.  Meanwhile, I'm on day 4 of a 14 day trip now without a camera.  I bought another one to use for my trip and once home, I returned the broken one.  I'm hoping the same thing doesn't happen again.  All the pictures I took came out perfect, so if the lens \"stays on track\" this little camera does take nice shots, but I'm really iffy on it now.", "Date": "May 12, 2013"}, {"Title": "BooooO!", "Author": "Erica", "ReviewID": "R2APGXEWU60A70", "Overall": "3.0", "Content": "This camera worked fine (never dropped or abused) and then ALL OF A SUDDEN it stopped working.  I just took a few pictures and minutes later went to plug the usb cord to my laptop to retrieve the pictures and it just STOPPED WORKING.  The on/off button does nothing.  The battery is completely charged.  What the heck?  I hate it when things stop working for absolutely NO REASON.UPDATE 11/27/13:  The camera was still under warranty.  I shipped it to Nikon and it was returned to me in 1 week.  Best of all the repair was free!!!  Make sure you keep all your packaging materials & warranty information just in case.FYI There is a firmware update on the Nikon website which is said to prevent this problem from even occurring...but I didn't know about it and well...you know what happened! :)", "Date": "October 23, 2013"}, {"Title": "Not A Top Performer", "Author": "The Reviewer", "ReviewID": "RK55L109RTN62", "Overall": "1.0", "Content": "I have always had Canon, but decided to give Nikon a try.  After reading all of the reviews on the Nikon 5200 I decided to purchase it. I had the camera for three days and returned it.The first thing I noticed was that I could not just hit the play button to view pictures and video, but I had to actually turn on the camera.  When you power the camera the lens extends, where in the Canon, you hit the play button and you can view pictures and videos and your lens retracted with the lens cover closed.The second issue I had was how the camera charges. You have to put the battery in the camera and plug  the power cord into the camera to charge the battery. I assume that Nikon makes a separate charger, but unlike Canon, Nikon does not provide one with the camera.I probably could have gotten past these two things, if I did not encounter the next two issues. I have a DSL camera and have had other point and shots in the past. I have never had an issue taking a picture of something moving.  My pictures always come out clear and blur free, but not with this Nikon. Majority of the pictures taken over the past three days were blurry and the camera had a VERY hard time focusing. This seemed to be the issue whether I used full auto with auto scene select or when I set the scene to one that fit best. In the past with Canon I have used Kids and Pets and my pictures have come out clear even if the subject moved last minute.My son is 9 months old and like many things in life there are no second chances and I need a camera that will capture the moment the first time! This Nikon did not meet my expectations at all and I do not recommend it to anyone regardless of user level.", "Date": "April 18, 2013"}, {"Title": "Don't buy", "Author": "Mary Light", "ReviewID": "R7RLLTXYU5YJF", "Overall": "1.0", "Content": "Bought my camera at Costco on August 1, 2013.  Took great pictures until today, September  28th and I'm getting a  message on the screen is LENS ERROR.  The lens will not come out.  I was unable to take any pictures of my outing on the lake.  Think twice about buying this camera.  I thought I did enough research.  I quests I didn't do enough.", "Date": "September 28, 2013"}, {"Title": "Extreme Disappointment", "Author": "GJ", "ReviewID": "RA5ASR9E2Y7W3", "Overall": "1.0", "Content": "Before leaving for a European holiday, we purchased the S5200 for a very good sales price (in relation to full retail cost).  But even at the discounted price, it was not worth the money!  The battery life was virtually non-existent (we were amazed at how quickly the battery drained!).  Most pictures with the zoom quality were very poor, especially indoor pictures - most  are blurry using the zoom (we assume some of this was due to our getting used to the camera).However, the coup d'état - when attending an outdoor event, front row seats, and looking forward to using the zoom - the camera stopped working!  It turned on, the lense extended for a few seconds and then closed, and then the 'lens error' message appeared.  After the event, via a computer blog, I trouble shooted the matter, tried what was recommended - take battery out, put back in, charge the battery, etc.  Did not correct the situation.  In total, we had the camera for 10 days before it malfunctioned.This is so disappointing!  We always thought that Nikkon made quality products so we did not think about checking consumer ratings.  And, when considering other Nikkon Coolpix cameras, according to the consumer ratings reviewed, there are problems with this Nikkon camera product range, so it is not worth the risk or the money to try a Nikkon replacement camera.  What is most disappointing - that Nikkon would even consider having these cameras on the market!", "Date": "October 26, 2013"}, {"Title": "Very Disappointing", "Author": "Amazon Customer \"LALA\"", "ReviewID": "R3NC3C56RNAQJX", "Overall": "1.0", "Content": "I got this camera because for the money it seemed like a good value. Decent lens with a few features and the added bonus of WiFi. The compact size meant I could easily carry it a purse or backpack without the added weight of my DSLR. The first one lasted nearly a month. Since it was under warranty the store replaced it no questions ask. The replacement lasted only three days. In both cases the lens as gotten out of alignment & will not focus giving me the dreaded \"lens error\". I am pro & have been carrying a camera with me daily for 40+ years & using digital cameras for the past 13+ years. Never have I had such a disappointment with a Nikon product.", "Date": "July 22, 2013"}, {"Title": "Camera was a big hit", "Author": "frank", "ReviewID": "R2B0JTWT6VKDN", "Overall": "5.0", "Content": "I could not go to a class reunion so I sent the camera in hopes that everyone would pick it up at some point and shoot a few pictures.  I got back 89 photos and 6 movies so I was able to reach out to class mates I hadn't seen in 40 years.  I told my friend to keep the camera and send me the extra memory card.  It worked out great and I never had to leave home thanks to Amazon.No one was offended by the weird color.  My class is still tough.", "Date": "September 5, 2013"}, {"Title": "Very disappointed!", "Author": "Syl \"Big Gramma\"", "ReviewID": "R3FITYFMWPQBZ4", "Overall": "2.0", "Content": "Have had it only a month or so and it takes great pictures, but the cable to recharge the completely dead battery is faulty, so now I have a useless camera.", "Date": "July 18, 2013"}, {"Title": "Fool me twice", "Author": "jules", "ReviewID": "RS1HTRDPUWHI2", "Overall": "1.0", "Content": "I bought this camera and initially loved it. It has lots of fun features. Although the build in Wifi is kind of dumb. It would be nicer if I could connect to my Wifi network and upload the pictures automatically, rather than having the camera create a new hub. After a month the camera stopped charging. I returned it to the store for a new camera. That camera also stopped charging after a couple of weeks. Since it was for my son, I told him to just charge the battery in an external charger, but even with a fully charged battery the camera would no longer turn on. At this point I returned it to Nikon for repair. Luckily I had all the papers and original packaging. To my surprise, Nikon denied the warranty repair and wanted over $100.- which is close to what I paid to begin with. DO NOT BUY THIS CAMERA.", "Date": "October 14, 2013"}, {"Title": "Nice Pictures However The Lens . . !", "Author": "Lynne", "ReviewID": "R1V1P97JF9XU37", "Overall": "3.0", "Content": "I finally found a great camera, I thought.I had the camera 19 DAYS and turned it on and the lens would not extend. Kept getting lens error also. Tried it several times. Took the battery out, sometimes that resets electronics, nothing. Finally the lens did extend again BUT NOW the auto focus would not work at all! Ugh!Called Nikon, they said take the battery out, try resetting all the factory settings, nothing helped. It would cost me $12 to ship it back to them. They would repair it and send it back to me free. But I was upset it only lasted 19 days! I ended up taking it back to where I bought it and they finally agreed to exchange it. I purchased the extended warranty this time.The pictures turned out GREAT though. Indoor and outdoor, like field day at my daughter's school in class and outside. My husband races motocross and when I took it to the track the zoom worked great. I could zoom in across the track. When I enlarged the picture it kept the clarity.  On sports setting it captured the bike going over the jump crystal clear. The food setting does make food look magazine quality, that was fun to play with. The face recognition feature works really well. It's a very intuitive camera when on the auto setting.Overall the camera was very easy to use. Nice options menu.So I love the pictures and the camera. I really do. I am seriously hoping this lens problem was just a fluke.(thank you to the person who told us how to view the pictures without extending the lens. I thought I read the manual well, guess I missed that part too)Update: Thank you for the two comments that said they  have had the same problem with this camera. Good luck with your replacements too. I just wish Nikon would have put the same quality into the camera shell and mechanics as they did the picture taking capabilities.", "Date": "May 18, 2013"}, {"Title": "Great camera!", "Author": "Kendra", "ReviewID": "R2HHZQ3KSYCU7M", "Overall": "5.0", "Content": "I was a little worried after reading some bad reviews, but it has been a great camera so far. Love the color! No delay in snapping pics. I am impressed with all the features & clear pics. Battery life is decent. I like the small compact size & matching case. Would recommend to anyone.", "Date": "February 17, 2014"}, {"Title": "Same frustrating issues as others", "Author": "PelHoo", "ReviewID": "RT0VSM2OIPDLL", "Overall": "1.0", "Content": "I had the same experience as other reviewers - after 3 months of usage, the camera would not turn on nor take a charge.  Had to ship to Nikon for repair.  I cannot recommend this product.", "Date": "October 7, 2013"}, {"Title": "Lens Error!", "Author": "hickory wind", "ReviewID": "R3SMIRPKOJ3GAP", "Overall": "1.0", "Content": "Bought S5200 just before flying to Hawaii for vacation. 19 pictures in and got the Lens Error message. Completely non-functional. No authorized Nikon dealers in Hawaii so only option is to send to Nikon for repair. They would not help with a discount or free replacement from any of the stores in Hawaii selling their cameras. I bought an S6500 (same batteries and memory card as the S5200) at a Walmart and it performed flawlessly for the duration of the trip. Pictures and videos are nice.Skip the S5200 and get a different model.", "Date": "August 1, 2013"}, {"Title": "Very Good Camera", "Author": "Danilo Belotti", "ReviewID": "R1995D0ZRI1KAC", "Overall": "5.0", "Content": "Good price, good looking, light weight, Wifi, Full HD, all in one, excellent brand.I am very happy with the photos.", "Date": "December 26, 2013"}, {"Title": "Great camera for everyday pictures!", "Author": "mainer_girl", "ReviewID": "R1JFB7GRAQCOK1", "Overall": "5.0", "Content": "It is very user-friendly and produces high quality pictures with very little adjusting required.  My mom uses it all the time!", "Date": "November 10, 2013"}, {"Title": "captures every moment", "Author": "Cymone", "ReviewID": "R8JJTA3Q0U3MA", "Overall": "5.0", "Content": "This camera does an exceptional job. I had to buy this one due to a broken lens on a different Nikon series which the repair would have exceeded the original cost of the camera since the warranty was no longer valid. Enough said and done, investing this one was a perfect solution!", "Date": "November 7, 2013"}, {"Title": "lens error", "Author": "Bo Wang", "ReviewID": "R2N25XUBKFS1X0", "Overall": "1.0", "Content": "lens error after 3 month usage. Repair said there is damage to the insertion port, and charge for $109.50! DO NOT buy this product!", "Date": "November 7, 2013"}, {"Title": "Defect after two weeks", "Author": "Elvirais", "ReviewID": "RG1HVM6JF1YWF", "Overall": "1.0", "Content": "Initially the camera worked wonderful, great image quality but there were problems after only two weeks. It won't turn on or off or charge the battery. Since so many others have problems with this product, it should be recalled.", "Date": "October 12, 2013"}, {"Title": "Terrific point and shoot", "Author": "Susan5s", "ReviewID": "R3SNSSZ7D1X474", "Overall": "5.0", "Content": "Easy, dependable, and takes pix with great color and clarity. The auto ISO allowed amazing night shots. Very sharp pix; love the face finder.", "Date": "May 18, 2013"}, {"Title": "Camera", "Author": "Cyndi", "ReviewID": "R2GKW0ZZFIQ575", "Overall": "5.0", "Content": "Dad is really excited about his new camera.. He keep looking at Walmart until I introduced him to the web.  He sure has used it these past few days.. Takes great pictures far away.", "Date": "February 13, 2014"}, {"Title": "Awesome Camera", "Author": "Terrianne Neill", "ReviewID": "R3AGASP7428GKU", "Overall": "5.0", "Content": "This camera is practical, easy to use, and it the absolute cutest thing ever! I love the beautiful plum color!", "Date": "January 6, 2014"}, {"Title": "Too Slow", "Author": "Luke", "ReviewID": "R1LYV1X7364I2C", "Overall": "2.0", "Content": "The camera is very slow both with taking pictures as well as between pictures.I was trying to look for a camera that I could conveniently carry around (compact) and could take action shots of the kids. Being that I want to take action shots, I wanted something that would allow me to take multiple pictures fairly quickly. This camera does not deliver in that aspect.Pressing the button to take the picture is hit or miss. Sometimes it wants to further focus and other times it'll take. The time between pictures is the bigger problem for me. It takes a good 2-3 seconds before you can take another picture after you've already taken one. This is a killer when trying to capture that special moment.The other reason I bought this camera was because of the WIFI function. The term WIFI is a bit deceiving. What it is actually doing is linking to a WIFI enabled mobile device. You download an app on your phone and link the camera to your phone and it adds some neat features like saving pictures taken on the camera to your phone and the ability to use your phone to remotely snap a picture. Very neat idea. But very clunky and slow. And for some reason, you can not enable the WIFI on the camera unless the battery is fully charged which is very frustrating.I gave two stars just to give the camera the benefit of the doubt that my expectations were too high.", "Date": "January 2, 2014"}, {"Title": "Great !!!", "Author": "Enrique Ustinelli \"Quique\"", "ReviewID": "R3JCAH879YEAPY", "Overall": "5.0", "Content": "This is my first pocket camera and I can asure that is great. Very simple to use, easy to handle and the photo quality is superb. I strongly recommend.", "Date": "January 1, 2014"}, {"Title": "Great camera", "Author": "Brandon Mason", "ReviewID": "R2IPDHXOFFQU85", "Overall": "5.0", "Content": "Functionality is very simple and pictures can be quickly snapped without missing the moment.  I still need to figure out the wifi feature - the instructions don't really address that in depth, but the important thing is that we are getting great shots with this camera.", "Date": "December 25, 2013"}, {"Title": "Great camer", "Author": "Rebecca Hoggatt", "ReviewID": "RE3LFVEE11MZ4", "Overall": "5.0", "Content": "Camera is excellent and takes really good pictures and is very easy to use. Happy with purchase of this camer", "Date": "November 30, 2013"}, {"Title": "Very good", "Author": "xiaolei", "ReviewID": "R3UHL6H1A35CZO", "Overall": "5.0", "Content": "The camera is very small and light ,so it's good to take it on traveling. The photo is good enough for me. And the price is good.", "Date": "November 25, 2013"}, {"Title": "so easy", "Author": "Paul G. Johnson \"crppplll\"", "ReviewID": "R12504ZAXUORJH", "Overall": "5.0", "Content": "This camera is so easy to use. I love the fixed 6x zoom, no fiddling around with switches, works great cropping scenes and people. Thanks for the big discount, what a bargain @ $126. delivered. All I had to do was charge the battery (included) and insert the card (included). Thank you Nikon and Amazon.", "Date": "November 13, 2013"}, {"Title": "great camera", "Author": "Amazon Customer", "ReviewID": "R1VMLBLS2C5624", "Overall": "5.0", "Content": "I had a Nikon S5100 but my son lost it so I had to buy another one. I bought S5200 because it's the next to s5100. It's a lot better than the first one so I'm happy.", "Date": "October 15, 2013"}, {"Title": "Battery Would Not Charge", "Author": "P. Van Buskirk \"VB Farms\"", "ReviewID": "R3NBWR5H5WD8JL", "Overall": "1.0", "Content": "Camera battery would not charge over a period of two days. Very small with tiny controls which are difficult to use with large hands. Cannot recommend this product, although I love Nikon!", "Date": "October 2, 2013"}, {"Title": "This Is A very Nice Camera For The Price", "Author": "MattyBoy717", "ReviewID": "R20HIEJDK6RDEC", "Overall": "4.0", "Content": "But I'm spoiled by the S9500. But if you're only an occasional user and don't need a close up macro or a long focal length, then save your money on a more expensive camera and get this one.", "Date": "September 22, 2013"}, {"Title": "Camera has serious malfunction issues", "Author": "Patricia A Combs", "ReviewID": "R18P2JMCCLW01R", "Overall": "1.0", "Content": "I bought this camera for our family vacation. I read the reviews before purchasing and they were very positive. Three days into our trip I got the battery exhausted message while the indicator showed a full charge. Then came the lens error message. Reading the recent reviews this is a problem that needs to be addressed. Do not buy this camera if you want reliability.", "Date": "September 21, 2013"}, {"Title": "Lens Error", "Author": "Dan Kimball", "ReviewID": "R2U1JTJWQMAVA7", "Overall": "1.0", "Content": "I am a professional photographer and bought this simply for a family vacation. It died with a lens error after using it only a couple times! I used to be a Nikon fanatic and all my pro stuff is Nikon... But I am now rethinking that", "Date": "September 14, 2013"}, {"Title": "Three uses and it's out", "Author": "KatieB \"KatieB\"", "ReviewID": "R2ZL5A5LG87H4S", "Overall": "1.0", "Content": "Bought this camera in June.  Used it once in June at a recital, on a trip to Florida in July, and once in August. Went to use it this week and get a \"lens error\" message. Extremely disappointed that I wasted that amount of money and have no recourse.", "Date": "September 9, 2013"}, {"Title": "Great", "Author": "Jennifer C Rich", "ReviewID": "RQQWODQ2Z1WOP", "Overall": "5.0", "Content": "Cool camera really nice awesome recommend to any one looking for a camera high quality not expensive good pictures yes", "Date": "September 4, 2013"}, {"Title": "My wife really enjoys the camera", "Author": "Todd", "ReviewID": "RT3L787DQUDAG", "Overall": "5.0", "Content": "My wife love this camera. It really is a point and shoot camera that seems to handle movement and lighting situations (on either side of the camera) very well.  The package deal including the case and memory card was a real plus - a great deal on  great little camera.", "Date": "August 5, 2013"}, {"Title": "Like the camera --- good pictures", "Author": "Rose A Mescher", "ReviewID": "R2HLYKBLXGFD2W", "Overall": "4.0", "Content": "The pictures are great quality.  The camera is very lightweight and the screen is really a nice size.  Not a difficult camera to operate.  I had an issue with the zoom lens sticking and getting an error message.  This was discouraging as we were on vacation and I really wanted to capture some pictures while we were at a particular location.  I was able to get the lens to loose and it seems to be working fine now.", "Date": "July 30, 2013"}, {"Title": "At last I can take good pictures", "Author": "Barbara", "ReviewID": "R39HBZI5SWKKDN", "Overall": "5.0", "Content": "I have never been able to take good pictures until now. My COOLPIX makes it easy to take good pictures I really like it.", "Date": "July 15, 2013"}, {"Title": "It's a camera!", "Author": "Andrew", "ReviewID": "R16O39J3BRO537", "Overall": "4.0", "Content": "I don't get the bad reviews? This is fairly inexpensive digital camera we bought for our daughter. It works just fine, Both pics and video. Great for her to have fun with and something we will likely take with us on a overseas trip rather than the expensive Nikon. Worth the money,", "Date": "July 8, 2013"}, {"Title": "Great Little Camera", "Author": "M. Hickey", "ReviewID": "R3Q8EXQPQ4DTB1", "Overall": "5.0", "Content": "This camera is so easy to use.  I'm not a very good photographer but I enjoy taking pictures and this camera fits the bill.  It takes great shots.  I'm sure a better photographer would get even better pix if that is possible.", "Date": "July 2, 2013"}, {"Title": "Frustrating!", "Author": "Jessica T.", "ReviewID": "ROWIOMUDT8AIY", "Overall": "3.0", "Content": "I bought this and unfortunately I read the reviews after the fact and I wish that I had read them prior.  We used it once before receiving the lens error, however, I put it on the shelf and filed a complaint to try and get it exchanged or returned and when I went to use it to send a screenshot of the lens error the camera was working fine.  Haven't had an issue since.  Not entirely sure what the problem with the lens other than the lens cover itself seems very flimsy.", "Date": "May 30, 2014"}, {"Title": "Grerat Camera Deal", "Author": "Atul", "ReviewID": "R26OOU8R45PJJJ", "Overall": "5.0", "Content": "It is a good point and shoot camera. I gifted it to my brother. Nice in clicking pics in day light. Battery runs out fast so keep a spare battery ready if you click alot.", "Date": "May 28, 2014"}, {"Title": "nice camera at for the price", "Author": "Prasad D Patil", "ReviewID": "R3F4HAN5AGCGW4", "Overall": "4.0", "Content": "Good camera for the price tag of $80 including shipping.has lot of options and modes and small enough to carry", "Date": "May 20, 2014"}, {"Title": "DO NOT BUY THIS CAMERA", "Author": "Bruce Montgomery", "ReviewID": "R14EGXB47BYFZC", "Overall": "1.0", "Content": "Nikon should stop selling this and refund all current owners. My problem is the same as a lot of others, the \"lens error\". Camera just stops working, pictures won't focus, just a major little disaster two days before vacation! I would NOT recommend this camera to anyone!", "Date": "April 29, 2014"}, {"Title": "Not So Cool Pix", "Author": "Shawn G. Welch", "ReviewID": "R12GRWR7E3AJJ5", "Overall": "1.0", "Content": "I've had this camera for four months and have consistently been disappointed by its performance. I bought it brand new; it never saw any damage. But the general complaint that it is prone to lens error issues is true in my case (luckily, a little troubleshooting fixed it - for now). The wifi option also has serious connection problems which make it essentially useless.One of my biggest complaints is that the button response time is painfully slow. It could take up to three seconds for a command to actually execute (opening a menu, taking a photo, switching camera modes, etc.), which is an eternity if you're trying to capture the moment. The on/off button is positioned ridiculously close to the shutter button, so instead of getting that awesome shot you end up turning the camera off. The zoom itself is often non-responsive or unbelievably slow - again, a photo killer if you're trying to capture something in the moment.The camera has a lot of features, true (180 and 360 options, several photo options), but its benefits are far outweighed by just how annoying it is to operate. I purchased mine for $150, much to my endless remorse. There are far, far better options in this price range.", "Date": "April 23, 2014"}, {"Title": "Good", "Author": "Gabriela Bagot", "ReviewID": "R1OYQV6BJVPJDV", "Overall": "4.0", "Content": "We started taking fotos some days ago, and the results so far are very good.  It's very easy to use.", "Date": "April 20, 2014"}, {"Title": "very professional", "Author": "Amazon Customer", "ReviewID": "RIH75UKT87F9H", "Overall": "5.0", "Content": "Great camera for the price! I recorded a documentary on it and it turned out wonderful! Great video and pictures! I actually use it for my YouTube channel. It can even do some pretty cool effects.", "Date": "April 10, 2014"}, {"Title": "Died quickly", "Author": "Estherfan", "ReviewID": "RT60TNICXZLN9", "Overall": "1.0", "Content": "This camera lasted until just after the warranty expired (3 months) , then refused to turn on :( Quite disappointing.", "Date": "April 8, 2014"}, {"Title": "Ultra small, great zoom, easy to use, great price", "Author": "Joey", "ReviewID": "R1SL1X1J39BSWH", "Overall": "5.0", "Content": "I bought the camera for an 80+ yo grandma who has enjoyed the ease of use and clear sharp photos from the camera.  She was replacing a 5 year old point and shoot and is very pleased.  On receipt of the camera, which was shipped free and fast, I did the firmware update.  I also added a very fast 32GB card.  I also kept the camera for about a week turning it on and off, taking photos and video ( great HD quality IMHO), using the telephoto zooming in and out lots of times.  It goes to full optical zoom quite fast.  If you continue zooming it goes into digital zoom also.  I did all this after reading some reviews to be sure it would work for  her.  Had no problems.  Viewed photos on computer to get a feel of quality.  I was very pleased.  I also viewed photos and video on a 73\" TV and they still looked great IMHO. I shoot with a Sony DSLR A390 must say for a camera that was under $60 total cost delivered you cannot beat the ease of use, easy to carry and versatility of the Nikon Coolpix S5200.  I did not fool with the Wi-Fi feature because I know my Grandma will never use that feature.  camera.  Only had the camera a month and very happy with it so far.  One year warranty on the camera.", "Date": "April 3, 2014"}, {"Title": "Nice camera.", "Author": "Janice Moch", "ReviewID": "R2X6NLTTCFYGCC", "Overall": "3.0", "Content": "Easy to use , but does not focus quickly. Pictures are fairly clear and color is good. Somewhat smaller than I thought it would be.", "Date": "April 1, 2014"}, {"Title": "Awesome camera", "Author": "Jackee579", "ReviewID": "R2WB6BQSWAUY82", "Overall": "5.0", "Content": "Love the way you can connect to your iPhone and take pictures. Excellent quality picture takings would recommend for purchase", "Date": "March 24, 2014"}, {"Title": "do not buy this camera !!", "Author": "Josie M Algeciras", "ReviewID": "R1O9MXU7MLM6L", "Overall": "1.0", "Content": "Ordered the camera for an upcoming trip. it was a good thing I had my phone as backup . battery is hard to charge , when it does it does not hold a charge long, lens opens up on its own so the battery dies quickly and sometimes the lens does not open  totally frustrated with it and now I find out I cant return it because its past the date.  totally unsatisfied ..", "Date": "March 9, 2014"}, {"Title": "Little camera but what big features!", "Author": "Terry L. Huelsman", "ReviewID": "R3W2X5ZCCQG7TT", "Overall": "5.0", "Content": "Great little camera, worth every penny! I really love all the \"little\" features of the camera, it just does so much.", "Date": "March 2, 2014"}, {"Title": "Very disappointed", "Author": "Liz", "ReviewID": "R13ZRHDM2RYPJZ", "Overall": "1.0", "Content": "This camera I've had less than a year and it has completely died, lens will not open, will not power on and its definitely not a battery issue. Have loved the camera while it worked but very disappointed and Nikon phone support was no help.", "Date": "March 1, 2014"}, {"Title": "Great camera for 4 months", "Author": "Thomas J Nesheim", "ReviewID": "R1MNHSB04TYPM7", "Overall": "1.0", "Content": "Camera was great for the first 4 months, then it stopped powering on. Sent it to Nikon for Warranty repair and they said it would cost $120 to fix the camera.Do not buy from Nikon they do not stand behind their cameras.", "Date": "February 27, 2014"}, {"Title": "Awful", "Author": "A McGinty", "ReviewID": "R3BBO97FITRFZK", "Overall": "1.0", "Content": "Bought this camera for a trip to Europe, having previously used Kodak cameras for years.  Day 1 the battery died even although it had been charged.  Bought a new battery but same problem - battery life is extremely poor.  Photos are OK but not as sharp as with my Kodaks.  Video however is horrendous - I assumed all compact cameras would be much the same in terms of video but this one is terrible.  The sound quality is extremely poor.  I have to give up on this camera now and buy a new one.  I had bought this because Nikon is a good name but never again.", "Date": "February 22, 2014"}, {"Title": "Do not buy Nikon Products - At least not a COOLPIX S5200", "Author": "Tim Reynolds", "ReviewID": "R1QP8GFHB1NC6", "Overall": "1.0", "Content": "First of all this review is in no way a reflection on Amazon. In fact I did not buy this product from Amazon, but rather from a local retailer while on vacation. We purchased the camera because our previous Nikon started having lens errors and was no longer reliable and . . . well . . . we were on vacation and wanted a camera. The previous camera was also a Nikon COOLPIX and was less than two years old when it stopped working.This camera stopped working after less than six months. It simply wouldn't turn on. The battery was fully charged, I returned it to Nikon for warranty service and was told that it would cast $109.50 to repair (plus I paid to ship it to them). When I called and asked why it wasn't covered under the warranty I was told that the HDMI port contacts were damaged. Why that would cause the camera to not turn on I do not know, but I explained that the camera had never been connected to anything using the HDMI port. Needless to say I will not pay them more than the camera is worth to repair a problem that should be covered under warranty.I should also note that while I was researching the problem for a possible solution I found NUMEROUS reports of exactly the same problem - the camera simply wouldn't turn on.Personally I will never buy another Nikon product.", "Date": "January 28, 2014"}, {"Title": "Not a bad camera, It will break if you look at it funny", "Author": "anthony", "ReviewID": "R17WQ6QY9WH2KF", "Overall": "3.0", "Content": "I've had three of these coolpix, the camera functions well and you can't beat the price….You can however beat the camera. In fact it takes very little to render this camera unusable. The first one just stopped working, don't know why but the lens wouldn't shut. the second one, my wife dropped from about three feet… there was no visible damage from the drop but it never turned on again.  otherwise I like it.", "Date": "January 22, 2014"}, {"Title": "Lens error - too", "Author": "Mark Kapczynski", "ReviewID": "R3AAD9N6F0ST27", "Overall": "1.0", "Content": "this camera worked great for a few months - then I got the infamous \"lens error\" and basically you end up with a dead camera.  I would try to buy something more reliable as clearly the s5200 has issues.  Maybe their new model the s5300 will be better quality.", "Date": "January 10, 2014"}, {"Title": "Worked somewhat for 6 months", "Author": "G. Bridgestock \"Jr. Birdman\"", "ReviewID": "R1K7WBFMXT5X4U", "Overall": "1.0", "Content": "Liked the quality of pics without flash.  Flash frequently overexposed, or didn't work.  Now the flash has stopped working altogether, and I've had a number of lens failure messages.  Regretfully, I read the reviews on this camera after I purchased it.  Advice?!  Read the reviews (which are poor on the Nikon) and believe them.  The engineering on Nikons may be wonderful and miraculous, but reliability really, really stinks.  I've had quite a few cameras before; Olympus was fair, but I've had the best luck with Canon.  I now know that I will never, ever purchase a Nikon product again.", "Date": "December 27, 2013"}, {"Title": "I experienced really bad quality control...", "Author": "Gerald Berke \"gberke\"", "ReviewID": "R2TQ7RCGXCYP8D", "Overall": "1.0", "Content": "I bought this camera three times... twice from Radio Shack and once from Amazon: all three were defective...1) image mode on camera didn't work2) wi fi would not connect3) battery died immediately...there might have been more failures lurking, but each one was a show stopper... very very strange.  Tempting, lovely camera, but something is seriously wrong with the quality control...", "Date": "December 12, 2013"}, {"Title": "Avoid this camera unless you like well-known issues with lens errors and not holding a charge/charging", "Author": "Allison", "ReviewID": "R16283LIWZ4CJI", "Overall": "1.0", "Content": "If we hadn't received this camera as a gift, we never would have bought it for ourselves.  Our first one stopped working after just a few hours.  The second one worked for a week before it died and the battery won't recharge.  From doing research, this camera seems to have frequent issues with lens errors and holding a charge.  Up until the point that they died, however, they did take great photos and were easy to use.", "Date": "December 3, 2013"}, {"Title": "Better than I expected", "Author": "Cecilia Tzeng", "ReviewID": "R2R3AREHCEQ20", "Overall": "4.0", "Content": "I had low expectations after reading the reviews.  But after today, I love it.  I just came back from the amusment park, and my 2 year old used the camera to take pictures while sitting on a MOVING kidding Train, say 5 miles per hour.  She came up with some pretty good pictures.  Say, at least 50% of the pictures were focused (please note again, this is from a 2 year old on a moving vehicle, who doesn't know how to hold the button half way down to focus), so i say its damn good.  The other pictures I took of them sitting on rides, as its MOVING, turned out just fine, so I'm not sure why all the bad reviews.  I did have to hold it half way down first, wait for the square/rectangle to show up to show that its focus and then take the picture.", "Date": "May 19, 2013"}, {"Title": "Died on my vacation", "Author": "Richard G Wolfish", "ReviewID": "R3POY2EBOXAAD4", "Overall": "1.0", "Content": "It died on day 4 of my vacation, do not buy this. I had bought this just for my vacation.", "Date": "September 1, 2013"}, {"Title": "Don't chance it", "Author": "Ellie", "ReviewID": "R2IHBEBIC6FL1N", "Overall": "1.0", "Content": "i am so disappointed with this purchase. i had the same experience as the other reviewers with the lens. i bought the camera for a trip to South Africa. Charged it and had the same problem with the lens retracting and not getting a clear focus and ended up using my iPhone and iPad! I just returned it to Costco and got a new one thinking it was an anomaly. i decided to read more reviews and will now return it unopened. I wish I'd read all of the reviews before I purchased it.", "Date": "August 6, 2013"}, {"Title": "Big Disappointment", "Author": "Gina M Arias", "ReviewID": "R3V4YVUVTVFSB2", "Overall": "2.0", "Content": "I bought this camera due to the reviews everyone was giving it but it only lasted a month & I had to ship it off to be repaired.  Also the address on the warranty card is incorrect so UPS had to redeliver to the correct address & I had to pay another $15 to have it redelivered.  Needless to say I was not very happy.  Shipping from from the seller was great but that's the only good thing about this purchase.", "Date": "July 31, 2013"}, {"Title": "WHY is the WiFi SO hard to access?", "Author": "Kiara", "ReviewID": "R1KNRFVMW46C3Z", "Overall": "3.0", "Content": "I've had the camera about two weeks and am still not able to use the highly touted wifi function.  You would think there would be a quick button to access that option but it's buried in the menu.  Also it does not show available networks which requires you to know and navigate (type) in the portals and access code. Not very user friendly.  Other than that  its a point and shoot.", "Date": "June 20, 2013"}, {"Title": "Loves it...", "Author": "ReyRey", "ReviewID": "RLXL2M6Z54G4J", "Overall": "5.0", "Content": "Great camera, bught for wife she loves it, it's easy to use and takes great photos comes with case and sd card great deal.", "Date": "June 5, 2013"}, {"Title": "Great camera... before it quit working.", "Author": "Lowery", "ReviewID": "R3TD0DC6133G02", "Overall": "3.0", "Content": "Loved the look of the camera and the clarity of the pictures from the CoolPix S5200.I was so excited when I got this camera on July 1 charged it up and took about 50 or so great pictures, transferred a few to my computer setup the wifi up today and then charged it up.Was flashing green went to turn it on and camera would not come back on.Tried replacing battery connecting and disconnecting the power cord still no luck, really disappointed that I only had this cute little camera for only 11 days and it stopped working.If anyone has any advice on how to get this working, would really appreciate it.It really is a great camera, when it works.", "Date": "July 12, 2013"}, {"Title": "Really like this camera", "Author": "Joe E Dee \"Language, Food and Tech Nut\"", "ReviewID": "R1P5749RU1QGEN", "Overall": "5.0", "Content": "It's my third digital camera and by far the best. The picture clarity is amazing, and the zoom works very well and produces great close-ups. I got a great shot of a male cardinal high up in a tree as a result. I'm not a professional photographer but I did use to develop my own photos (B&W;) and I know what looks good.", "Date": "June 15, 2013"}, {"Title": "Lens error on barely used camera in perfect condition", "Author": "MCNB", "ReviewID": "R1OTJ7XJCSBXKP", "Overall": "1.0", "Content": "Daughter dropped our last Nikon, so fair enough that the retractable lens was damaged. This one is seven months old and I've been incredibly careful with it. It's hardly been used but has always been carried in a camera case etc. Am now getting \"Lens error\" and it won't work any more. Lens has NO dirt, battery is fully charged, etc. Searching for the receipt so I can send in under warranty but will not buy any more Nikon cameras with retractable lenses. (I recently used Nikon's camera repair facility for a DSLR and they charged $300+ and the problem was not fully fixed, plus they took a very long time.)My advice is to avoid. Great photos but breaks too easily.", "Date": "February 9, 2014"}, {"Title": "Failure to Timely Ship a Replacement for a Defective one", "Author": "m cecchini", "ReviewID": "R2PGJGVTTIOA48", "Overall": "2.0", "Content": "This camera is a replacement for one that failed (which has already been returned to you, acknowledgement receipt email came in two days ago) and while I made you aware of this exchange requirement back on 14 August, you still have not shipped this replacement despite promises made to get this done immediately.  You can now assertain from the one returned to you that it was defective and worthy of an immediate replacement, there seems to be no excuse for the delay in getting a replacement into shipping.", "Date": "August 20, 2013"}, {"Title": "Sucked", "Author": "Joanie", "ReviewID": "R1TKVO83DDLG8P", "Overall": "1.0", "Content": "Wrong color, not as I expected, wouldn't go into wifi, just a piece of crap camera. Boo, boo, and more boo!", "Date": "August 17, 2013"}], "ProductInfo": {"Price": "$129.95", "Features": "Share amazing photos in an instant with built-in Wi-Fi\n16 MP CMOS sensor for exceptional image quality and enhanced low-light performance\nRecord videos in Full 1080p HD with stereo sound", "Name": "Nikon COOLPIX S5200 Wi-Fi CMOS Digital Camera with 6x Zoom Lens (Red)", "ImgURL": "http://ecx.images-amazon.com/images/I/41IkQ1Fd-EL._SX300_.jpg", "ProductID": "B00B7N9BB8"}}