{"Reviews": [{"Title": "Best Bang for your Buck", "Author": "Walter D. Nguyen", "ReviewID": "R3JM53E6YJ0V4Y", "Overall": "5.0", "Content": "I am upgrading from a point and shoot digital camera so to me this is light years ahead of what I had.After extensive research, I was waiting for this camera for a long time and was hoping that the included lens would be great. My overall impression from other reviews is that the camera isn't ground-breaking but it does a lot of what people will want and cut out things people wouldn't necessarily use. The included lens from what I can tell is very middle-of-the-road and functional.If you are upgrading from a point-and-shoot like me (Canon ELPH in my case), then you will be amazed by this camera for the reasonable price it costs. To be honest, I don't have time to mess around with settings to get the \"optimum\" look for pictures, but the automatic settings on this camera work great to take care of my new baby. Maybe when I get some more time to sit down with the manual and tweak some stuff I will try to do more manual stuff, but at this point in my life I just want great pictures fast.If you are already a DSLR person or you already have ICL (like the previous NEX 5R), then there is really no reason to get this one unless you want something with a slightly smaller form factor.The accessories that came with the pack are great so far. The little bag it came with fits everything I would bring along with me.OVERALL:I would place this camera in the nice sweet spot of: \"I want better pictures than my iPhone/Smartphone can provide on the fly, but I don't want to lug around a DSLR.\" and in that category, this one is best bang for your buck in my opinion.", "Date": "May 16, 2013"}, {"Title": "Awesomeness", "Author": "Tasha Demkiw \"Tasha\"", "ReviewID": "R2ZZI6E8I2RK8R", "Overall": "4.0", "Content": "Was about to buy the Sony Nex 5N when this bad boy was released.You get the same megapixels AND a built in flash which was the selling point for me over the 5N.Great camera that takes amazing photos. I was annoyed with the bulk of my dslr and decided this compact Sony was the way to go and it hasn't disappointed. Sling it over your shoulder and take it anywhere (hikes, Major League Baseball games, clubs, etc)Also has a built in auto HDR option which saves so much time editing photos. A great camera for the price!", "Date": "April 30, 2013"}, {"Title": "Just what I needed", "Author": "KimBob", "ReviewID": "R228YOFSOI9ZJ2", "Overall": "5.0", "Content": "Its potable and sharp.Excellent!  Just what I expected.  I am carrying this camera everywhere I go.I think this is the best camera in its class.", "Date": "April 18, 2013"}, {"Title": "awesome camara", "Author": "shawn", "ReviewID": "R1Q3350A933DB6", "Overall": "4.0", "Content": "This is the best quality camara ever taking very good quality picture also the delivery was super fast. Recommend to family and friends.", "Date": "January 2, 2014"}, {"Title": "Great Buy!!!", "Author": "Hayley", "ReviewID": "R3C7M62A3SUHWI", "Overall": "5.0", "Content": "Love this camera! Small and has everything I need to take portraits inside or out.  I mainly take portraits of my children who are always on the go and this camera does the trick. Plenty of settings to tweak the outcome just the way I like it. Great Buy!!! Super Fast Shipping!!!", "Date": "December 11, 2013"}, {"Title": "WANTED pseudo SLR FOR JAPAN", "Author": "DrMike", "ReviewID": "R11GKXMJ3I02HN", "Overall": "5.0", "Content": "Having a good point and shoot, I wanted to expand to an interchangeable lens system, big sensor, but not SLR heft.  A 2 week walking tour of Kyoto private homes and gardens necessitated a light, high quality camera.  My digital art endeavors also required a high resolution system.Now that I am back, I can report substantial success.  Pictures were as expected, and I am working some thru Adobe for my website as I write this.  I did not have time to try our all of the bells and whistles, but found the panorama mode astounding.  Camera was light, easy to stash in its little bag, tho the bag is not well balanced and turns upside down.So far thoroughly satisfied.", "Date": "November 1, 2013"}, {"Title": "Great Camera", "Author": "Brenda Gillen", "ReviewID": "R25GKXQ85SXTG2", "Overall": "5.0", "Content": "Takes great pictures and I love the adjustable view screen. It is light and easy to handle. Even uploading the pictures to my computer was a breeze.", "Date": "October 23, 2013"}, {"Title": "Great camera and comes with lots of accessories as described", "Author": "Mrs. Kappa", "ReviewID": "R1PRU61Z2N9YL3", "Overall": "5.0", "Content": "Camera is easy and great to use, small but with lots function!Memory card was from Sony, not random brand.Case was seen cheaply made, but it's ok, I want leather case so it doesn't bother me.Extract battery was not from SonyOther than that, everything else seems good to me.", "Date": "September 20, 2013"}, {"Title": "Comment", "Author": "sianghuang", "ReviewID": "R1T9KCAEJWY00E", "Overall": "3.0", "Content": "I found some tiny scratches on the camera lens once i got it out from the package. Feel bad. :(", "Date": "August 19, 2013"}, {"Title": "Getting Started", "Author": "Helen Estes", "ReviewID": "R23ESTXPJRP3Q", "Overall": "5.0", "Content": "I'm just a couple of weeks into using this camera.  I've taken some beautiful landscapes, seascapes, and family scenes but haven't created any prints yet.  I plan to continue growing in my use/understanding of the camera.", "Date": "June 6, 2013"}], "ProductInfo": {"Price": "$449.00", "Features": null, "Name": "Sony NEX-3NL/W NEX-3N NEX3NL NEX3NLW Compact Interchangeable Lens Digital Camera Kit (White) Ultimate Bundle with 32GB SD Card, Spare Battery, Filter Kit, Padded Case, HDMI Cable, Card Reader + More", "ImgURL": "http://ecx.images-amazon.com/images/I/511EYKCQXRL._SY300_.jpg", "ProductID": "B00BLRHIKG"}}