{"Reviews": [{"Title": "Everything you need", "Author": "marc durham", "ReviewID": "R1E5AELU39U4ZH", "Overall": "5.0", "Content": "This package has everything you will need to become a amateur photographer.  I really enjoy this product and have fun playing with the different lenses to give my pictures the professional effect.  The only thing I had to purchase separately was a rain slicker to protect it from the weather since the camera itself isn't weatherproof.  The picture quality of the camera is more than I expected.  This is a must have if you are in the market for a new DSLR camera.", "Date": "April 22, 2013"}, {"Title": "Great camera bundle", "Author": "eric", "ReviewID": "R6B6DJODYI3VE", "Overall": "5.0", "Content": "Great camera--easy to work with----the pic's are amazing---the \"bundle\" is the WAY to go---make sure the lense's are VR---some kits slightly cheaper however they are sticking non VR lense's in bundle. The VR makes a doable pic into a GREAT pic!!", "Date": "January 1, 2014"}, {"Title": "Nice camera and great bundle", "Author": "Lisa Ely", "ReviewID": "R3SYUADWVXKJGV", "Overall": "5.0", "Content": "I really like this camera so far.  I just started learning how to use it but so far so good.  I really like the bundle.  The only thing I would change is the monopod.  I don't think I'll ever use it.  I would have preferred a tripod.Note - if you get the backpack, check the bottom.  It has a velcro section that opens up and contains a cover that protects the pack from wet weather. This pack is actually much nicer than a bag and well worth the money.", "Date": "July 29, 2013"}, {"Title": "Nikon D5200", "Author": "John R. Dalzell", "ReviewID": "RGEL00PWE7JQX", "Overall": "5.0", "Content": "Was a gift and a great camera outfit for the price. We did a lot of research before we purchased it. It was nice to get my own camera back from my Daughter. Her skills with this equipment are getting better everyday and I am very proud of the work she is doing with Her new camera outfit.J.R.", "Date": "January 31, 2014"}, {"Title": "Great camera", "Author": "Kendra Curran", "ReviewID": "R10DS879OFYAOF", "Overall": "5.0", "Content": "I love this camera.  I upgraded from the d3000.  I have enjoyed the video feature and it is so easy to use.", "Date": "August 1, 2013"}, {"Title": "Just as listed", "Author": "Dean Daebler", "ReviewID": "R14EACKD3J6NM7", "Overall": "5.0", "Content": "Everything came together and in great shape. This is a great combo package.Camera has many nice features and lives up to its advertising!", "Date": "July 29, 2013"}, {"Title": "Awesome Camera!!", "Author": "Hippie", "ReviewID": "R348QV28O8LC1Y", "Overall": "5.0", "Content": "I bought this to upgrade my equipment and with the price of this package it was an obvious choice to go with the D5200 instead of the D5100 plus this bundle is definetly a good value! if you take just the cost of the Lenses only is worth buying this! On top of that This thing takes Amazing Pictures!! I've been sick with Pneumonia for the last week and besides being this sick what's killing me the most is not being able to get out and use my New Toys!! LMAO Seriously this is an amazing camera even if your new to this type of camera the auto settings will make you look like a pro! Don't feel overwhelmed there are great books out there to help you figure it out! Like Nikon D5200 for Dummies is a good start! So for the price,the quality,lenses and all the other goodies this is a good buy. Like I said i've been sick and haven't had a chance to run everything thru its paces once I do if I find anything I'll update this post!", "Date": "July 16, 2013"}], "ProductInfo": {"Price": "$1,029.95", "Features": "KIT INCLUDES 15 PRODUCTS -- All BRAND NEW Items with all Manufacturer-supplied Accessories + Full USA Warranties:\n<1> Nikon D5200 Digital SLR Camera & 18-55mm G VR DX AF-S Zoom Lens (Black) + <2> Nikon 55-200mm VR DX AF-S Lens + <3> Samyang 500mm Telephoto Lens +\n<4> Transcend 32GB Class10 SD Card + <5> Vivitar 52mm UV Glass Filter + <6> Additional Vivitar 52mm UV Glass Filter + <7> ML-L3 Shutter Remote Control +\n<8> Rokinon 67\" Monopod & Case + <9> PD Laptop/Tablet DSLR Backpack + <10> PD 2.5x Tele & .45x Wide Lens + <11> PD 6pc Complete Cleaning Kit +\n<12> PD Memory Card Storage Wallet + <13> LCD Monitor Screen Protectors + <14> T Mount for Nikon + <15> Instruction Sheet for T-Mount", "Name": "Nikon D5200 Digital SLR Camera & 18-55mm G VR DX AF-S Zoom Lens (Black) with 55-200mm VR + 500mm Telephoto Lens + 32GB Card + Backpack + Tele/Wide Lenses + Monopod + Accessory Kit", "ImgURL": "http://ecx.images-amazon.com/images/I/61zvblQ0xwL._SY300_.jpg", "ProductID": "B00B3VHXO6"}}