{"Reviews": [{"Title": "Only for the people who understand Japanese Language", "Author": "satoshi komizo", "ReviewID": "R3QOMF1T6DKB89", "Overall": "5.0", "Content": "Product itself was great!High quality pictures with so many adjustments available.Only the issue is every explanation written in Japanese only.Please be cautious.", "Date": "September 16, 2013"}, {"Title": "NO ENGLISH.", "Author": "MEI-YU LIAO", "ReviewID": "R1V4FK6R435QZW", "Overall": "1.0", "Content": "I really think it's not the honest way to sale this product in Amazon.com. Since this camera only can be operated by \" Japanese Users \", it should be indicated in item description. It's a trap.", "Date": "September 3, 2013"}, {"Title": "Hmmmm - Japanes", "Author": "Too Many Toys", "ReviewID": "RMFP3GHEGEOLJ", "Overall": "2.0", "Content": "I guess I should have asked.  All the menus are in Japanese, some have English words in them in addition to the Japanese, most don't.  All the buttons are labelled in English.  I wonder who this is targeted towards.Awesome pictures, but very difficult to use as I can't read Japanese.  If this wasn't so packed with features I could probably figure it out.I requested a return \"Does not match description\" and within 20 seconds got an authorization to return.  Based on the pictures I took I immediately ordered  Panasonic DMC ZS30K Megapixel Digital Camera and very much look forward to it.The zoom is exceptional and even with my shakey hands at full zoom the pictures are blur free due to the image stabilization.The cable needed to charge it (it does not come with an external battery charger) is a type of micro USB I have never seen before.  If you are in a harsh environment (I live on the ocean) do yourself a favor and get a spare cable, better yet, the two batteries with external charger.  This thing takes 3 1/2 hours to charge on the USB cable.", "Date": "August 17, 2013"}, {"Title": "Confused...do you speak Japanese?", "Author": "Dr. Oceanfront \"Oceanfront\"", "ReviewID": "R3BQT7DNE81IRV", "Overall": "3.0", "Content": "I wanted to buy my son a very light camera for his upcoming trip to Asia.  I have always heard great things about the Lumix, and he got a smoking deal on it, so I told him to buy it and I would pay for it as a birthday present...this is it, the TZ-40.I tried to play with it, but I could not get anywhere as the instructions are not in English, nor is anything else.Luckily my son is very tech savvy and I think he may just figure this guy out.  If not, no problem, as this is an easy return.My son said he could find the instructions on the web, and actually found the Japanese instructions kind of cool.  Go figure.I will change the rating as soon as I know more about the camera.  But I will say, at the price I paid, this sure has some great features and takes some nice pictures!To be continued...Update:  it is the ZS (not TZ) that is the American model.If my review helped you, please click on \"Helpful\" below.  Thank you.  :)", "Date": "February 22, 2014"}, {"Title": "great if you can read Japanese", "Author": "Russ  Camp", "ReviewID": "R3FYTTT7J3WBZD", "Overall": "2.0", "Content": "The camera I received had Version 1.0 software which was unable to be changed to read English language in the menus, so I was unable to use it. has been returned to sender. might be a fine camera, but double check this before you buy from any Japanese seller!!", "Date": "August 26, 2013"}, {"Title": "Japanese only", "Author": "Douglas T Campbell", "ReviewID": "R3BD628VGZOSMZ", "Overall": "1.0", "Content": "I had no idea this camera would be in Japanese only. Instruction manual, DVD, screens on the camera. Unbelievable, especially from Amazon. I subsequently figured out that the exact same camera in English has a different number, ZS30, and is easily available. Needless to say, I didn't get it from Amazon.", "Date": "August 26, 2013"}, {"Title": "Panasonic TZ 20 Camera", "Author": "GINA LOIZIDES", "ReviewID": "R2TACJ4AJ1WM7Q", "Overall": "1.0", "Content": "When I received this camera - it was only in the Japanese languageI tried to use it going with an English Manual that I had to download myself - but the Manual at some stage was not coinciding with the use of the cameraI asked for a refund from the seller - who told me he couldnt do this in the begin - but later said that I could return the camera and he would give me a refund after he has seen thisI have returned the camera to the seller - who informs me he hasnt received it yet", "Date": "April 18, 2014"}, {"Title": "All came in japanese language: Machine, CD and Manual.", "Author": "José Júlio Martins Tôrres", "ReviewID": "R376Y8UXBS2TUF", "Overall": "1.0", "Content": "All came in japanese language: Machine, CD and Manual, with no option to change it.You should take more responsibility when they sell your products.If you don't send me another machine, this is the last time I buy something from you.I will not return the item. I payed tax and it will not be  reimbursed.I don't recomend this product to anybody who is not japanese.", "Date": "December 14, 2013"}, {"Title": "Japanese menu", "Author": "Agneta Carlson Sarinske \"shutter bug book worm\"", "ReviewID": "R2NRPBYOCHWJEH", "Overall": "1.0", "Content": "There was probably nothing wrong with the camera, but the Amazon post did not inform of the fact that the menu is only in Japanese. The camera has two model numbers - both sold on Amazon. The TZ40 is supposedly the model number sold in Europe; the SZ30 in the US, but it is supposed to be the same camera. The one I received, as I said earlier, had a menu only in Japanese. I do not speak Japanese.", "Date": "December 4, 2013"}, {"Title": "BEWARE! BEWARE! BEWARE!  -- Japanese ONLY!!!!!", "Author": "Amazon Customer", "ReviewID": "R2WH5JCNRCELHG", "Overall": "1.0", "Content": "Nowhere in the listing for this product does it state that this camera is not capable of displaying any language other than Japanese! It may well be a great camera, but it is essentially useless to anyone who does not read Japanese - that includes the manual and software. This advertising borders on, if it does not constitute, fraudulent advertising.", "Date": "May 23, 2014"}, {"Title": "product great, service sucks", "Author": "Bill C", "ReviewID": "R27S292WDUAQQG", "Overall": "1.0", "Content": "There is no way that Amazon should be selling this product without having it set to the English version. Amazon should have aranged with Net Life of Japan to have an English version for sale in the U.S. Failing that, there should at least be proper instructions for obtaining and installing the English version. If no response leading to fixing this problem is found, the camera will need to be returned.", "Date": "April 6, 2014"}, {"Title": "Japanese only language - marketed to US consumers by Amazon", "Author": "Patrick Maher", "ReviewID": "RD7XGWJLBT6DB", "Overall": "1.0", "Content": "Japanese only with no option to get an English menu.  Amazon should put this explicitly in the title for the product", "Date": "March 28, 2014"}, {"Title": "Great camera but don't buy it from Japan unless you can read Japanese", "Author": "Raymond Jones", "ReviewID": "R3ID51HNZ49X5L", "Overall": "5.0", "Content": "I bought the camera from Japan and found it could not change the language. I returned the camera and got a full refund because the information on the sellers site did not say Japanese language only. I have since bought the same camera in Australia and it's great. The only thing is to save battery life, do not forget to turn off the GPS when not in use, or purchase additional batteries (2) and charger. Extra batteries are great if travelling, if one fails you often cannot buy them over the counter where your visiting.", "Date": "January 16, 2014"}, {"Title": "Brilliant Camera - Great for almost everything!", "Author": "Phillip North \"Phil\"", "ReviewID": "R2Z9CHDKPAM3O3", "Overall": "5.0", "Content": "The Panasonic Lumix TZ40 is hands-down my best ever camera purchase. I can't for the life of me figure the reviews about Japanese menus, but figure Amazon may have purchased a bunch intended for the Japanese market that weren't defaulted to english language. Ignore all these reviews. I had to change language to Japanese on mine to see what they were talking about, and was able to change it back to English simply enough but had not considered the menuing to be problematic until I tried operating it in Japanese (easily fixed).The zoom on this camera is nothing short of breath-taking. I am regularly having to rest both elbows to get stability but this is clearly a physics thing, not a limitation of the camera.The camera is fast, works ok in low light (keeping in mind it's not an f/1.8) and the smarts are not overly intrusive. Panoramic is good (multi-directional, good guides etc...) and I without flash, I rarely bite into a second battery taking 400-600 shots.For anyone looking to travel, or with kids - I reckon this is the camera.  In fact - I would argue that >80% of the people lugging around a DSLR should shelve it and take a TZ40 with a spare battery or two.And if you have never tried a compact super-zoom camera, then just order one. Don't bother researching or vascilating, just go and grab one. You will find your entire photography style changing when you can get good close-up photos from further away!", "Date": "February 21, 2014"}], "ProductInfo": {"Price": "$313.82", "Features": "Height: 5.89, Width: 10.83, Depth: 2.77cm\nWeight: 198g, effective pixels: 18.1 million pixels\nOptical zoom: 20 times (up to 40 times)\nEX optical zoom (EZ):47.8 times the maximum,  Total number of pixels: 18.9 million pixels\nFocal length: f = 4.3mm ~ 86.0mm (35mm format equivalent: 24mm ~ 480mm), Maximum aperture: F3.3 (wide end) ~ F6.4 (tele end)", "Name": "Panasonic Lumix digital camera 20x optical with GPS DMC-TZ40 Black", "ImgURL": "http://ecx.images-amazon.com/images/I/41mF1%2BHwgHL._SX300_.jpg", "ProductID": "B00B7FNGIK"}}