{"Reviews": [{"Title": "A great starter kit", "Author": "SunshineGirl", "ReviewID": "R2E61JR2CPI2R6", "Overall": "5.0", "Content": "As an amateur looking to up my game, I am very happy with this kit. It includes everything you need to get started, although a more experienced and better-equipped photographer would probably already have most of the extras that are included. I researched lenses and chose the 18-200 for its versatility.The shipping was super fast, and the camera was packed very carefully. Using the manual, it's quite easy to get up and running very quickly.", "Date": "July 30, 2013"}, {"Title": "Dust Magnet - Complicated UI - Great Pictures", "Author": "MattBianco", "ReviewID": "R2NKQW6LWOCIRT", "Overall": "3.0", "Content": "This was an upgrade from my seven year old, still alive and kicking and taking great pictures, Sony A-100 with an 18-200 lens.Pros:- great image and color accuracy- fast zoom- many \"effects\" that can make picture taking more interesting- a great all purpose 18-200 F3.5 lens with this kit- high quality videosCons:- Dust gets in the camera somehow.  I have requested a return.  After three days, I had dust visible and not cleanable, in the viewfinder- Menues and UI are very complicated relative to Canon and Sony DSLRs- AE lock not always successful- Some effects take forever to set up, such as B&W; with some colors excluded, will take 1-3 minutes to set up.- Location of the video record button is close to the shutter button, except you cannot use the viewfinder to video, only the LCD screen, for video.  Therefore, all you videos are bump as you search for the button which is located somewhere totally useless and difficult to feel/find.- not able to record videos in 16:9 aspect ratio when every TV made in the last five years is 16:9- poor battery life (I got less than a 100 clicks and 3 minutes of video after a 24 hour charge)- cheap plastic build, including flimsy battery door- Price -given this is a glorified point and shoot- too many pixels -just a data hog- not enough camera.I wish my old Sony A-100 would take videos, and that it had better pixel count and better color accuracy.  It is a lot easier to use, easier to hold, has longer batter life and better built -this camera is entirely plastic.  I have dropped the Sony on solid rock several times but it has not affected it in anyway.  With the D5200 you just have sense that it has to be held and placed on a table like you handle a 2 week old baby.I decided after the first day that given the high picture quality, I would live and master the poor UI and awkward button location for the video, and treat it like a precious child.  It would be a price for high quality photography.  However, when dust penetrated the camera after three days, I could not accept such a quality issue.I fell for Nikon as several of my photographer friends swore by the brand.  In all fairness, they are all full size DSLR users.  A journalist working for a local paper however told me that he switched to Canon 5 years ago, after 30+ years of being a Nikon fan, and has never looked back.If Amazon accept my return, I think I will go back to Sony, this time to A77.  If they don't, a vendor complaint will follow this review.", "Date": "April 11, 2013"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B00B5UAQHG"}}