{"Reviews": [{"Title": "Camera is good at times", "Author": "jill krueger", "ReviewID": "R1LKB09SB23J3T", "Overall": "3.0", "Content": "Battery readout is not accurate. Shows small amount of battery used and then to approx. 80% used. Then stops camera from working as no power. Supposed to have enough power on one full charge for 300 to 350 pictures but this is not correct. I get 150 pictures and then camera stops.Find focusing on distant shots takes too long. Have to wait for green dot to come on. Subject doesn't wait for me.Battery charger that came with order is supposed to have red light and green light. Mine only shows green no matter how long I leave it plugged in.When taking closer shots, which is most of the time, pictures are clear and color is good.", "Date": "November 2, 2013"}, {"Title": "Excelent purchase.good product", "Author": "Marco Pazmino", "ReviewID": "R1ILB3JB082GC3", "Overall": "4.0", "Content": "Excelent product. Good price. i dont like the battery mode. but now i want to buy model dsc hx 300.", "Date": "April 30, 2014"}, {"Title": "family time", "Author": "Kentawi", "ReviewID": "R1FL0M1F35ELYA", "Overall": "5.0", "Content": "i give it to my cousin as gift.She loves it. She asked me to buy it for her friends so i ll buy 4 more...", "Date": "April 25, 2014"}, {"Title": "perfect", "Author": "laureta", "ReviewID": "RALZLZLITSV45", "Overall": "5.0", "Content": "exactly what i was looking for. an easy to use and good quality of photos and videos camera. the bundle was a great deal. it has everything needed, and the shipping was pretty fast. i really recommend it.", "Date": "April 8, 2014"}, {"Title": "i like the item", "Author": "alex b.", "ReviewID": "R1J586R5D92JTN", "Overall": "5.0", "Content": "Not sure how good is going to work, i ordered it for my nephew but hasnt use it that much yet", "Date": "March 27, 2014"}, {"Title": "Great value", "Author": "ANA", "ReviewID": "R3RDURNZLYX3C2", "Overall": "5.0", "Content": "This camera is a nice step up from a point and shoot if you don't want to go all the way to DSL or if you want a smaller camera for carrying around.  The package is amazingly inclusive and really useful.  The card reader and case are both ones I would have chosen if buying everything individually.  The camera itself doesn't like low light conditions but does well in bright light or when it is dark enough for a flash.", "Date": "February 18, 2014"}, {"Title": "Descent Camera Bundle", "Author": "Tiffany Pierce", "ReviewID": "RB320NY4X6OCN", "Overall": "4.0", "Content": "I purchased this bundle for my husband for Christmas. Its good starter camera and he just needed something other than his phone to take pictures. Thus far he has enjoyed the camera and stated that it is user friendly. the 21MP is great as well and the added accessories that it comes with is a plus.", "Date": "January 9, 2014"}, {"Title": "Excellent Buy", "Author": "Justin Whitford", "ReviewID": "R1UQLT1MGSJK0J", "Overall": "5.0", "Content": "Bought as a gift for my father to give as a present. Went through most of the book and checked out the camera. Was an excellent buy for a great price.", "Date": "January 8, 2014"}, {"Title": "camera seems pretty good overall", "Author": "Judy Ayers", "ReviewID": "RSAOP7R9L0TAE", "Overall": "4.0", "Content": "Just got the camera about a month ago. Haven't got to try it out too much but the times I did it operated much as expected.  Was disappointed in the battery charger that was included in the bundle as it doesn't work.", "Date": "January 4, 2014"}, {"Title": "All as it should have been", "Author": "jeffrey thibault", "ReviewID": "R1O950JWGQGDRU", "Overall": "5.0", "Content": "It looks very nice. This is a gift for a Military person for Christmas, so I have to wait and see hoe it works.", "Date": "November 27, 2013"}, {"Title": "total satisfaction", "Author": "john", "ReviewID": "R1BTN52OXA0QH8", "Overall": "3.0", "Content": "Camera is all i expected but the bundled accesories added are not the big deal.It was a gift to my daughter and she is happy.", "Date": "November 16, 2013"}], "ProductInfo": {"Price": "$209.00", "Features": null, "Name": "Sony DSC-H300 DSCH300 H300 H300/B Digital Camera (Black) Bundle with 16GB SD Card, Rapid Multivoltage AC/DC Charger, 3100 Mah Rechargeable Batteries (Qty 4), Card Reader, Mini Tripod, Case + More", "ImgURL": "http://ecx.images-amazon.com/images/I/51DJXKpl6uL._SY300_.jpg", "ProductID": "B00B785YHS"}}