{"Reviews": [{"Title": "BEST BANG FOR THE BUCK", "Author": "Dumpling", "ReviewID": "R1NYOWN96D6CRH", "Overall": "4.0", "Content": "What can I say about bundles, they're usually not my thing.  This selling tactic often results in additional items you otherwise wouldn't have wanted or needed.  This bundle, however, not only beat out the price of a camera body and one single lens, the bonus items are useful as well.  Maybe for a professional or advanced photographer, they might prefer to select their photographic equipment with discriminating taste.  For a beginner, the Nikon D5200 far exceeds an entry level digital SLR.  It's the middle child in the line up.  As a beginner, may I also suggest the easy-to-understand instruction book \"Nikon D5200 for Dummies\" available on Amazon.  It makes for a great companion to the D5200.IMPORTANT NOTE: The item description does not indicate that a charger or lithium ion battery is included in the kit.  Be aware that the kit does include these necessary items.  I made the mistake of ordering them online and now must pay to have them returned.", "Date": "August 21, 2013"}, {"Title": "I made a Good choice", "Author": "Wayne D. Hosmer", "ReviewID": "R2SSD1B4ZN3H0H", "Overall": "5.0", "Content": "I am very happy haven't had much time. To do a lot with it yet , I love all the stuff that came with with it, and the service was excellent, I do recommend the Nikon D5200 Takes Awsome shots Thank you", "Date": "October 8, 2013"}, {"Title": "Terrific package", "Author": "Shoams", "ReviewID": "RTMQWOFJ3OYZX", "Overall": "5.0", "Content": "D5200 arrived early, had everything and more than I needed.  Am loving learning about this camera.  Would highly recommend it.", "Date": "October 3, 2013"}], "ProductInfo": {"Price": "$1,129.95", "Features": "KIT INCLUDES 15 PRODUCTS -- All BRAND NEW Items with all Manufacturer-supplied Accessories + Full USA Warranties:\n<1> Nikon D5200 Digital SLR Camera & 18-55mm G VR DX AF-S Zoom Lens (Black) + <2> Nikon 55-300mm VR DX AF-S Lens + <3> Samyang 500mm Telephoto Lens +\n<4> Transcend 32GB Class10 SD Card + <5> Vivitar 52mm UV Glass Filter + <6> Vivitar 58mm UV Glass Filter + <7> ML-L3 Shutter Remote Control +\n<8> Rokinon 67\" Monopod & Case + <9> PD Laptop/Tablet DSLR Backpack + <10> PD 2.5x Tele & .45x Wide Lens + <11> PD 6pc Complete Cleaning Kit +\n<12> PD Memory Card Storage Wallet + <13> LCD Monitor Screen Protectors + <14> T Mount for Nikon + <15> Instruction Sheet for T-Mount", "Name": "Nikon D5200 Digital SLR Camera & 18-55mm G VR DX AF-S Zoom Lens (Black) with 55-300mm VR + 500mm Telephoto Lens + 32GB Card + Backpack + Tele/Wide Lenses + Monopod + Accessory Kit", "ImgURL": "http://ecx.images-amazon.com/images/I/61prl2nLN0L._SY300_.jpg", "ProductID": "B00B3VIYD0"}}