{"Reviews": [{"Title": "Great Starter Kit", "Author": "peggy", "ReviewID": "RRQ6P126B3N6", "Overall": "5.0", "Content": "My husband and I purchased this for our hiking trips as well as recreational farm visit photography outtings. This kit truly provided us with everything to start.-It had a  lovely standard burgundy nikon camera strap provided. I will be returning the one I purchased because I didnt know that one was included with the set.-The body is beautiful. The burgundy/red color is very rich and doesn't look corny or odd. It's quite attractive.-The lenses are great starter lenses to help us begin shooting and getting familiar with the mechanics of the camera while providing an excellent focal range.-The memory card records pictures quite fast - I thought it would be slower.-The kit is extremely self explanatory and the body and lenses all come with the manufacturer warranty which can be registered online. Nikons product registry site is very well laid out and helpful (worth registering).-Monopod is great - very compact and can expand to a surprising length. The base is equipped with a rubber foot that also screws upward to expose a metal spike which can be used to steady the monopod on soft ground. (similar mechanism to the IKEA rubber leveler feet)-500mm telephoto lens is indeed not the same quality as a Nikkor lens but we feel that it is an excellent way to try experimenting with a lens of that type and skill level with a minimal investment compared to its Nikkor equivalent.-The remote uses an infared sensor and therefore the wifi adapter is not needed for it to be able to function. We however still bought the wifi adapter so we could easily transfer photos to our smartphones.-The adaptive lenses (telephoto and wide angle) are interesting to play with however the one does not truly help to achieve a true wide angle lens affect. The wide angle adapter when zoomed out to it fullest has a black circle around the picture which cuts off the corners of the picture and therefore somewhat nullifying its effectiveness.-The backpack. We were surprised by how well this suited our needs. We go hiking and the back pack has substantial back padding and support. The bag fits everything in this kit very comfortably and leaves room for additional objects if you plan out your space accordingly. Its very well padded throughout. The padded spacers are adjustable with velcro side flaps. All around a great bag.-Kit also comes with all the adapters you would need for the body and the lenses and for a first time dslr owner - its very well explained.*As beginners to the dslr world we are extremely happy with our purchase. This is a great foundational purchase as well as leaves us room to grow into more skillful lens types once we better understand the type of photography we will be mainly focusing on.*", "Date": "August 6, 2013"}, {"Title": "Great package!", "Author": "Claire K.", "ReviewID": "RTWVK7DA1Z9KF", "Overall": "5.0", "Content": "Fabulous package deal. I researched the individual components and this seems to be a good deal. I love the camera and all the goodies included. Great customer service as well.", "Date": "March 21, 2013"}, {"Title": "Excellent Camera, Bundle, Delivery.", "Author": "Bill", "ReviewID": "R3GNTIDKDQBJGP", "Overall": "5.0", "Content": "All items shipped as advertised and in excellent condition. Kudos to the merchant.We are still learning all that the camera has to offer, but using the auto settings makes it easy to take excellent pictures right out of the box. They candy apple red was a BIG winner with the women in the family!", "Date": "June 12, 2013"}, {"Title": "great", "Author": "Leland Krein", "ReviewID": "R6Z8KDKR3ZY1B", "Overall": "4.0", "Content": "Was just what I ordered works great backpack a little small for all the lenses would order it again thanks", "Date": "December 21, 2013"}, {"Title": "Nikon Kit", "Author": "Matt", "ReviewID": "R3N0POK60EFKN0", "Overall": "5.0", "Content": "I love this kit. I am still learning how to use everything. This camera takes great pictures. The super high resolution allows me to crop photos and blow the picture up large for making posters. I am having a lot of fun with it.", "Date": "October 17, 2013"}, {"Title": "All in one!", "Author": "AG", "ReviewID": "RK1QOWS1KZENN", "Overall": "5.0", "Content": "This was an anniversary gift for my wife and she loves it.  Everything she needs is included in the package. This is great!", "Date": "October 16, 2013"}, {"Title": "Great Camera !", "Author": "Wayne", "ReviewID": "R2I9SFCEFCALS6", "Overall": "5.0", "Content": "Great Camera ! Nice Camera bag ! Lots Of good Stuff For the price.This is my Second Digital Camera First one being a Sony MVC-FD91 ( floppy Disk for A memory Card ).The Nikon D5200 ( body and the 18-55 lens )  Is cheaper than the Sony 14 years ago .There is A lot I have to learn about the Nikon . Great pictures right out of the Box I downloaded the manual And read it while I waited for the Camera , Which I received before  Amazon said it would get to me.I will  send an Update When I use the Camera more ... For Now  I'am very pleased with this Camera/Bundle .Wayne", "Date": "September 27, 2013"}, {"Title": "Perfect", "Author": "MBN", "ReviewID": "R1CIVTEUJQLICB", "Overall": "5.0", "Content": "Perfect in every way.  Great color and amazing accessories.  Takes awesome pictures!  We bought this for an Alaska Cruise and we captured many fabulous pictures with this camera.", "Date": "September 24, 2013"}, {"Title": "Going to enjoy!", "Author": "dgreenox4", "ReviewID": "R1SWA5DDUQ6PBA", "Overall": "5.0", "Content": "I have not used a great deal yet, however, it has the features that I was looking for. Can't wait to use more.", "Date": "July 13, 2013"}, {"Title": "A perfect fit....", "Author": "Sammy Yip", "ReviewID": "R3EQ76ZYKQJLXG", "Overall": "5.0", "Content": "It was a birthday gift for my daughter. She loves the camera. She has a Nikon D40 before and this can do so much more.", "Date": "June 30, 2013"}], "ProductInfo": {"Price": "$1,129.95", "Features": "KIT INCLUDES 15 PRODUCTS -- All BRAND NEW Items with all Manufacturer-supplied Accessories + Full USA Warranties:\n<1> Nikon D5200 Digital SLR Camera & 18-55mm G VR DX AF-S Zoom Lens (Red) + <2> Nikon 55-300mm VR DX AF-S Lens + <3> Samyang 500mm Telephoto Lens +\n<4> Transcend 32GB Class10 SD Card + <5> Vivitar 52mm UV Glass Filter + <6> Vivitar 58mm UV Glass Filter + <7> ML-L3 Shutter Remote Control +\n<8> Rokinon 67\" Monopod & Case + <9> PD Laptop/Tablet DSLR Backpack + <10> PD 2.5x Tele & .45x Wide Lens + <11> PD 6pc Complete Cleaning Kit +\n<12> PD Memory Card Storage Wallet + <13> LCD Monitor Screen Protectors + <14> T Mount for Nikon + <15> Instruction Sheet for T-Mount", "Name": "Nikon D5200 Digital SLR Camera & 18-55mm G VR DX AF-S Zoom Lens (Red) with 55-300mm VR + 500mm Telephoto Lens + 32GB Card + Backpack + Tele/Wide Lenses + Monopod + Accessory Kit", "ImgURL": "http://ecx.images-amazon.com/images/I/61oJgUoAeKL._SY300_.jpg", "ProductID": "B00B4EL1GS"}}