{"Reviews": [{"Title": "Optio Wg-3 - so glad we bought it", "Author": "kda", "ReviewID": "R14HJQT4EX1A2U", "Overall": "5.0", "Content": "<!--\n\nfunction fp_resizePlayerSpace(nsPrefix,w,h)\n{\t\n  try {\t\n    var ifrm = parent.document.getElementById(nsPrefix + \"movieFrameID\");\n    if (ifrm) {\t\n        var h2 = h + 35;\n        ifrm.style.height = h2;\n      }\n    } catch(err) {\n \n    } \n\n\n  if (h > 0) {\n      document.getElementById(nsPrefix + \"clipDiv\").style.height=h+\"px\";\n      document.getElementById(nsPrefix + \"videoPlaceholder\").style.height=h+\"px\";\n  }\n  else {\n      document.getElementById(nsPrefix + \"clipDiv\").style.height=\"\";\n      document.getElementById(nsPrefix + \"videoPlaceholder\").style.height=\"\";\n  }\n  document.getElementById(nsPrefix + \"flashcontent\").style.height=\"100%\";\n}\n\nfunction fp_rewriteDiv(nsPrefix,divName,html)\n{\t\n    document.getElementById(nsPrefix + divName).innerHTML=html;\n}\n\nfunction embeddingPopup(nsPrefix)\n{\n  alert(\"placeholder function for embedding code\");\n}\n-->\n\n\n<!--\n\nfunction cv_moUGQXWWAFADIDembeddingPopup(){\t\nalert(\"Embedding code will be displayed here.\");\n}\n\n-->\n\n\n\n\n\n\n\n\n\n<!--\nfunction cv_moUGQXWWAFADIDrefresh_preplay() {\n\ndocument.getElementById(\"cv_moUGQXWWAFADIDchiDiv\").innerHTML = document.getElementById(\"cv_moUGQXWWAFADIDhiddenPre\").innerHTML;\n};\ncv_moUGQXWWAFADIDrefresh_preplay();\n\n-->\n\n\n\n\n\n\n        // <![CDATA[\n\nvar cv_moUGQXWWAFADIDso;\t   \n\n\nfunction cv_moUGQXWWAFADIDloadSwf_Core(swfLocation, swfWidth, swfHeight, flashVersion, bgColor, swfParams, flashParams, embedAttributes) {\n\n  try {\n      cv_moUGQXWWAFADIDso = new SWFObject(swfLocation, \"cv_moUGQXWWAFADIDAMPlayerProd\", swfWidth, swfHeight, flashVersion, bgColor);\t   \n\n      for (var v in swfParams) {\n        cv_moUGQXWWAFADIDso.addVariable(v, encodeURIComponent(swfParams[v]));\n      }\n      for (var v in flashParams) {\n        cv_moUGQXWWAFADIDso.addParam(v, flashParams[v]);\n      }\n      for (var v in embedAttributes) {\n        cv_moUGQXWWAFADIDso.setAttribute(v, embedAttributes[v]);\n      }\n\n      cv_moUGQXWWAFADIDso.addVariable(\"swfEmbedTime\", new Date().getTime());\n\n      var agt = navigator.userAgent;\n       \n      var reFirefox = new RegExp(\"firefox/\", \"i\");\n      var regx = agt.split(reFirefox);\n      var ffVersion = 8;\n      if (regx[1]) {\n          var pts = regx[1].split(/[.]/);\n          ffVersion = parseFloat(pts[0] + \".\" + pts[1]);\n      }\n      var minorVersion = parseFloat(navigator.ap);\n      if ((navigator.appVersion.indexOf(\"Mac\")!=-1) || (ffVersion < 1.5)) {\n          cv_moUGQXWWAFADIDso.setAttribute(\"height\", swfHeight);\n          cv_moUGQXWWAFADIDso.setAttribute(\"width\", swfWidth);\n          cv_moUGQXWWAFADIDso.addVariable(\"oldFirefox\", \"1\");\t     \n      }\n\n      if (cv_moUGQXWWAFADIDso.write(\"cv_moUGQXWWAFADIDflashcontent\")) {\n          fp_resizePlayerSpace('cv_moUGQXWWAFADID', \n                               320, \n                               283);\n      }\n      else {\n          var nsPrefix = 'cv_moUGQXWWAFADID';\n\n          fp_resizePlayerSpace(nsPrefix, 0, 0);\n          fp_rewriteDiv(nsPrefix, \"flashcontent\", '<br/>To view this video download <a target=\"_blank\" href=\"http://www.macromedia.com/go/getflashplayer\" target=\"_top\">Flash Player</a> (version 9.0.115 or higher)');\n      }\n  } catch(err) {\n      fp_resizePlayerSpace('cv_moUGQXWWAFADID', 0, 0);\n  }\n  return false;\n}\n\n\n\nfunction _cv_moUGQXWWAFADIDloadSwf(movieID, playerVersion) {\n    var swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/20120510035744301/AMPlayer._V148501545_.swf\";\n    var swfWidth = \"320\";\n    var swfHeight = \"100%\";\n    var flashVersion = \"9.0.115\";\n    var bgColor = \"#FFFFFF\";\n\n    var swfParams = {};\n    var flashParams = {};\n    var embedAttributes = {};\n    swfParams.amazonPort = \"80\";\n    swfParams.allowFullScreen = \"true\";\n    swfParams.telemetrySubPageType = \"VideoReview\";\n    swfParams.nsPrefix = \"cv_moUGQXWWAFADID\";\n    swfParams.locale = \"en_US\";\n    swfParams.logUrl = \"gp/mpd/l\";\n    swfParams.canResize = \"1\";\n    swfParams.autoPlay = \"1\";\n    swfParams.sessionId = \"000-0000000-0000000\";\n    swfParams.marketplaceID = \"ATVPDKIKX0DER\";\n    swfParams.salign = \"LT\";\n    swfParams.preset = \"detail\";\n    swfParams.mediaObjectId = \"m1T3HAC6MKT8KY\";\n    swfParams.autoPlayTimer = \"\";\n    swfParams.mediaObjectIDList = \"m1T3HAC6MKT8KY\";\n    swfParams.playIsUserGenerated = \"1\";\n    swfParams.enableShare = \"0\";\n    swfParams.permUrl = \"gp/mpd/permalink\";\n    swfParams.telemetryPageTypeID = \"R14HJQT4EX1A2U\";\n    swfParams.xmlUrl = \"http://www.amazon.com/gp/mpd/getplaylist-v2/m1T3HAC6MKT8KY/000-0000000-0000000\";\n    swfParams.amazonServer = \"www.amazon.com\";\n    swfParams.scale = \"noscale\";\n    flashParams.allowFullScreen = \"true\";\n    flashParams.salign = \"LT\";\n    flashParams.bgcolor = \"#FFFFFF\";\n    flashParams.allowScriptAccess = \"always\";\n    flashParams.quality = \"high\";\n    flashParams.wmode = \"transparent\";\n    embedAttributes.title = \"Flash Player\";\n\n    if (movieID){\n      if (playerVersion == '3'){\n        swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/20120510035744301/AMPlayer._V148501545_.swf\";\n        swfParams.mediaObjectIDList = movieID;\n      } else {\n        swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/legacy/20101014901/AMPlayerProd._V197491872_.swf\";\n      }\n      swfParams.xmlUrl = \"http://www.amazon.com/gp/mpd/getplaylist-v2/\" + movieID + \"/000-0000000-0000000\";\n      flashParams.wmode = \"transparent\";\n      swfParams.autoPlay = \"1\";\n    }\n\n    if (document.getElementById('cv_moUGQXWWAFADIDduration')) {\n      document.getElementById('cv_moUGQXWWAFADIDduration').style.display='none';\n    }\n    cv_moUGQXWWAFADIDloadSwf_Core(swfLocation, swfWidth, swfHeight, flashVersion, bgColor, swfParams, flashParams, embedAttributes);\n\n  return false;\n}\n\nfunction cv_moUGQXWWAFADIDloadSwf(movieID, playerVersion) {\n   return _cv_moUGQXWWAFADIDloadSwf(movieID, playerVersion);\n}\n\n\n\t\n\t\t// ]]>\n\t\n\n<!--\n\nfunction cv_moUGQXWWAFADIDnewHeight(h)\n{\t\n    fp_resizePlayerSpace('cv_moUGQXWWAFADID', 0, h);\n}\n\nfunction cv_moUGQXWWAFADIDresetPlayer(w,h,bw,cc) {\n  cv_moUGQXWWAFADIDnewHeight(h);\n\n  cv_moUGQXWWAFADIDso.addVariable(\"resetBandwidth\", bw);\n  cv_moUGQXWWAFADIDso.addVariable(\"cacheCode\", cc);\n  cv_moUGQXWWAFADIDso.setAttribute(\"height\", h);\n  cv_moUGQXWWAFADIDso.setAttribute(\"width\", w);\n  cv_moUGQXWWAFADIDso.write(\"cv_moUGQXWWAFADIDflashcontent\");\n}\n\n-->\n\n\n\n\n\n\n\n\nvar cv_moUGQXWWAFADIDRollOverImg = new Image();\ncv_moUGQXWWAFADIDRollOverImg.src = \"http://ecx.images-amazon.com/images/I/71pDNwxndNS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play-active,BottomLeft,130,-12_CR0,0,0,0_.png\";\n\nvar cv_moUGQXWWAFADIDpreplay = document.getElementById('cv_moUGQXWWAFADIDpreplayImageId');\nif (cv_moUGQXWWAFADIDpreplay) {\n  cv_moUGQXWWAFADIDpreplay.onmouseover = function() {\n    cv_moUGQXWWAFADIDpreplay.src = \"http://ecx.images-amazon.com/images/I/71pDNwxndNS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play-active,BottomLeft,130,-12_CR0,0,0,0_.png\";\n  }\n  cv_moUGQXWWAFADIDpreplay.onmouseout = function() {\n    cv_moUGQXWWAFADIDpreplay.src = \"http://ecx.images-amazon.com/images/I/71pDNwxndNS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play,BottomLeft,130,-12_CR0,0,0,0_.png\";\n  }\n  \n  \n  var node = cv_moUGQXWWAFADIDpreplay.parentNode;\n\n  var cv_moUGQXWWAFADIDcurrentClick = node.onclick;\n  node.onclick = function () {\n    var head = document.getElementsByTagName(\"head\");\n    if (head[0]) { \n      var logTag = document.createElement('script');\n      logTag.type = \"text/javascript\";\n      logTag.src = \"/gp/customer-media/du/log.html?ie=UTF8&p=CustomerImage&s=CustomerVideoPlay\";\n      head[0].appendChild(logTag);\n    }\n\n    if (cv_moUGQXWWAFADIDcurrentClick) {\n      return cv_moUGQXWWAFADIDcurrentClick();\n    }\n  }\n}\n\n\n\n\n Length:: 0:19 MinsAs a point of reference, i am not a professional or well-educated photographer -- i'm more of a PHD (point-here-dummy) photographer and take most of my pix on vacation or at big family events, but i do see the difference between good and \"ok\" photos/video.  also, i really value quality photos and easy-to-use video -- if it's easy, you'll use it.  if it's high quality, you'll love using it.After investing several hours reviewing all the underwater camera reviews for 2013, i chose this one without the GPS.  what an amazing camera.we took it on a caribb. cruise where we took photos and videos while snorkeling, while in tropical waterfalls, and while doing \"normal\" non-water oriented activities.  the attached video is taken from the surface on an overcast day.  i've also downloaded a few photos.  i think i'm limited to one video, so i've included only underwater.  the dry-land video quality is excellent for viewing on my computer, but i haven't yet tried it on the 55\" HDTV.i spent the 2 hour flight reading the paper handbook and testing and learning the camera.  it was a worthwhile investment of time, as i learned all of the camera's tricks and abilities.  it has a lot of nice little features you wouldn't expect and are not mentioned in other reviews/descriptions.  i recommend this to everyone.the good/great:photo quality, above and below watervideo quality and sound, above and below water - amazing, really.ease of usedurability - no concerns about my teens dropping itsize -- it's a little bigger than non-durable digital cameras, but well worth it.  my 14 yr old son likes cameras that he can fit in his pocket.  at first he was a little disappointed with the size, because it doesn't really fit in his shorts pocket, but after using the camera, it's now his favorite.3\" screen - works great, even in direct sun and under water.  we have another digital cameras with 2\" screens, and the 3\" is much better.buttons -- very easy to use underwater.  your fingers dont slip and you can easily do whatever you need.the editing options -- while the pix are still on the camera, you can crop and do other editing and save the edited pix as a new image.  you can also get 3 stills from any video you take.the bad:nothing, really, but if i was being really picky ........=> the battery didn't last as long as i would like -- will not last a whole day of heavy \"we are on vacation use\".  so, i strongly recommend a back-up battery whereever you go.  per another Amazon review, i bought the Wasabi dual battery package with charger and did not notice any difference between the Wasabi and Pentax batteries.  SEE MORE BELOW - IMPORTANT.=> the biner clip and strap-- i always use a wrist strap, so i dont worry when leaning over a cliff or balcony that i'll drop the  camera by accident.  i had to poach a wrist strap from another camera because the WG-3's carribiner and strap dont give any protection from dropping the camera.  they are cute, but not so functional.  i'll probably convert them to a keychain.  even though the camera is extremely durable, it's too clunky and heavy to hang from my belt-loop and feel safe.=>  size - see above.  a little bigger than ideal, but this is the cost of true, 45-foot underwater abilities.=>  you should have at least one finger-nail.  some of the buttons on the round \"ok\" button area are a bit close together and i find the one at \"9 o'clock\" difficult to hit just right.  i dont have large fingers, but i found no problem when using my fingernail on that one particular button.  if i had no fingernails, i would probably repeatedly hit the wrong button by accident.  this button isn't important for taking pictures or video, but is for reviewing and editing.although the camera is waterproof, it is not sink-proof.  we got the Chums wrist strap.  it works just fine to keep the camera afloat in our test and has a very functional clip so you can easily remove and replace the big floatation device.  here's the link:  http://www.amazon.com/gp/product/B003CK10DG/ref=oh_details_o01_s00_i02?ie=UTF8&psc;=1OVERALL IMPRESSIONS:  an excellent camera.  when i showed the grandparents the snorkeling shots and video from the PC, they couldn't believe we got such amazing shots from such a small and seemingly-normal camera.  And only $300!a word on sellers -- at first, and a week before the trip, i bought an orange WG-3 from a seller on Amazon (we figured orange would be easier to find/recognize than black).  they said they would deliver within 2-3 days, so we would get the camera in time for our trip.  5 days later, they still hadn't even shipped it.  so, i cancelled that camera and bought a black WG-3 direct from Amazon for an add'l $12 and i splurged on the $3.99 for the guaranteed next-day delivery (we are Prime members).  it arrived the following day, giving me time to charge the batteries, make sure it worked, etc.  Moral of this anecdote:  buy from Amazon.a word on the battery and for when you first get the camera -- the battery arrived 100% dead.  i put the battery in and tried using the camera immediately.  it didn't work.  the camera has a charging cable that attaches to the battery box in the camera, so you can charge the battery without a separate charging device.  when you do this, a green light illuminates on the \"on/off\" button.  when i first opened the camera, i tried using the cable to charge the battery via the camera.  it didn't work either and the green light didn't illuminate.  i thought the camera was a dud.  then i used the charging device that came with the Wasabi batteries -- it plugs into a regular wall outlet.  that worked.  ever since, i've been able to use the charging cable and the green light illuminates, but at first it didn't.  dont know what i would have done if i hadn't also bought a wall charger for the batteris.a word on accessories -- i recommend the following:  a wall charger for the battery; an extra battery; a high quality SD card (do some research - following the lead of another reviewer, i like the Patriot 32G - worked great for pix and video); a floatation wrist strap that is strong enough for the weight of this slightly larger camera; screen protectors;  a bag (again, check the size; we used a neoprene case that can get wet, so we wore the camera on our hip/neck while we trecked up waterfalls and had no worries); a regular wrist strap, as the floating ones are big and unnecessary on land.good luck!", "Date": "April 7, 2013"}, {"Title": "First Impressions - Nice!", "Author": "AdobemanAZ", "ReviewID": "R3PJCISH1QJOOS", "Overall": "5.0", "Content": "I purchased the Pentax Optio WG-3 GPS (Purple) here at Amazon and this is a first impression review.1) Decision: Prior to purchase I had to decide between the new Olympus TG-2 (tough camera) and this new Pentax model.  The specs are for the most part are comparable (we'll let the hard-core techies split hairs in their reviews), but i was leaning toward the Olympus because it had nice styling and I have had positive experiences with other Olympus camera models. But I decided on the Pentax because I liked that they added the LED ring of lights to assist the microscope mode.  Also, the camera comes with a snap on MACRO mount for use in the microscope mode.2) Look and Feel: The camera is well-built feels heavy (but in a solid kind of way).  The body is a hard plastic that almost feels like a rubber texture.  The LED display is a 16x9 style that is vibrant when reviewing photos and video.  You have to add your own SD card.  I had a 2GB SanDisk Extreme III available and inserted in the battery compartment, then formatted using the menu system (Note: It formatted blazingly fast..in less than a second!).  I decided not to attach the strap with carabiner that came in the box.  Since I have a travel pouch for the camera, I preferred to attached a wrist strap I had lying around instead.  The unit comes with a thick manual and a USB cable and associated plug-in charger.  What is not included with the camera is a Micro/Mini HDMI cable for A/V-out.3) Start-up and Menu: When you first start-up, the camera has you perform the standard date, time, time-zone type of set-up.  Then you are ready to go (Note: I charged the battery for about an hour prior to using the camera, but I think it was pretty-much factory shipped fully charged.  The menu system seems like all the other digital cameras on the market - a little awkward; but keep in mind this is my first day with the camera and with experience I'll adapt to the particulars of this camera's menu system.4) Photos:  I took a walk with the camera just before sunset where there were a lot of light contrasts; then just after the sun went down, I photographed in twilight. First look at the photos with the fast F2.0 lens were impressive!  Colors really popped in some flowers even in twilight.  Nice contrast between colors in cityscape murals.  Dialed up to 16-megapixels and zoomed 4x to try to see an architectural rendering on a sign I could barely make out in a building from the road.  After taking the picture I was able to zoom in and not only see the architectural rendering but even read words on this sign that I couldn't see from the ground.When I got home I tried the microscope mode which was an important reason why I purchased the camera in the first place.  I attached the marco stand and took a photo of a nickel.  The camera took a second to focus and the picture came out crisp.  The LED lights illuminated the coin and due to the reflection, the edges around the coin were somewhat overexposed.  I will have to experiment more, but the microscope mode worked as advertised seeing all sorts of micro-scratches on the coin face.There are so many features I have not tried yet like the GPS; and I'll update my review as time goes on.  Overall, the pictures were really good.  The reason I'm giving it 5-stars at this point, is because the features that I purchased the camera for worked as advertised. And again the photo quality is to my satisfaction.  I also do a lot of outdoor work where I need a camera to document progress for myself and customers.  I don't want to have to worry about dust, rain and dirty hands.  Note there is a time-elapsed feature that I have yet to try.I don't plan to use this camera for underwater activities, but like I said earlier, there will be testers and evaluation websites that will put this new camera through all sorts of tests in the weeks ahead.  But if you're ready now, I say go for it.  Unless you get one DOA, you probably won't be disappointed.Note: There is another customer review here on Amazon of this camera on 4/1/2013 that gave it 2-stars.  The person said they had the camera boxed for return within 5-minutes due to poor picture quality.  I would not take this review too seriously.  This person obviously took no time to ensure they had proper settings or conditions.  This is Pentax's 15th generation of tough camera evolution and they have a good reputation for hardware quality.  Keep all this in mind when making your decision to buy or not.", "Date": "April 24, 2013"}, {"Title": "I am now a Pentax fan!", "Author": "Phone Bill", "ReviewID": "RV01DRI1MANV3", "Overall": "5.0", "Content": "I have owned several Canon cameras over the years, going back to the days before digital photography. I was always pleased with the quality of their equipment and the photographs they produced. When I needed a camera to use while snorkeling, I first bought a Sony TX-10, which takes a nice picture, but is not as durable as I had hoped it would be. My current choices came down to the newest models by Olympus and Pentax. I am very pleased with this Pentax Optio WG-3. Pentax has managed to take something as delicate and fragile as a digital camera and make it truly tough.The things I most like about this camera so far are:-- it appears to be very durable.-- it has a nicely balanced feel.-- the photos look great!-- there are lots of different shooting modes, including time lapse, and macro.-- it is plenty waterproof for snorkeling and kayaking.The only negative I have seen so far is, like most digital cameras, the battery life isn't great. But a couple of spare batteries solves that issue.I have not yet tested the underwater video mode, which is the main reason I purchased this camera. But based on the initial results from still shots and regular video, this camera is a winner.That's why I am now a Pentax fan.", "Date": "April 28, 2013"}, {"Title": "backpacker's dream", "Author": "tom s", "ReviewID": "R3U0X3GMO8252S", "Overall": "5.0", "Content": "Pentax has defined a new niche -- rugged camera + gps. Camera (and video) is state of art, with fast lens (for low light shooting) and convenient design. The GPS, compass, and altitude info are useful for hiking. You can hold the camera lcd horizontal like a compass. Records picture locations and pathway gps data. The camera is tough but not invincible; manual says \"don't hold in waterfall\" and \"don't dive into water with it\" (because of high pressure changes?). But you can take underwater pix & movies, leave it out in the rain, or drop it a meter. Takes nice 1080 HD movies though focusing creates sound. Camera is bulkier than a cell phone, equals about 3 iPhones; big for pockets but it will fit. Easy to hold onto w/ ergo shape and grip.NOTEs AFTER USING: Takes great pix/movies. Worked well while snorkeling. Camera is well-designed but complex, with a learning curve, although there are simple shooting modes. When tired near end of a hot hike, I (a seasoned Pentax photog) had difficulties with some advanced functions. Largely this is because of the many options, allowing it to do many things (such as time lapse movies, very macro pix, 28 different modes!). Battery life is quite long. Shoots fairly fast and there are consecutive-shot modes (which I haven't explored yet). Keep the manual on hand for advanced functions (curious shoppers can download the manual and 2 quick guides from Pentax). Given what it can do, the design is thoughtful and user friendly.CONCLs after more use. It is a great technical marriage of camera + gps + waterproof, designed for the hand but not the pocket. All works well with the minor exception that the night pix have some noise at large sizes, as labs have noted. The camera is not simple; I still confuse the similar on-off and shutter buttons (similar because of waterproof design?). I'm happy with the camera, but I have a Pentax DSLR that is great for civilization and easy to use. If I were to have only one camera, I would opt for something (Pentax for me) more camera-like and only weatherproof, because modern cameras (at least the well-human-engineered ones) are great for picture taking. The WG-3 GPS is well engineered for its purposes and I look forward to my next hike with it.", "Date": "April 5, 2013"}, {"Title": "30 days ok ... but after that..? 2nd time around", "Author": "xerxes", "ReviewID": "R3F4Y77STML82E", "Overall": "2.0", "Content": "Having had the Pentax Optio line of cameras for several years, I decided to upgrade to the WG3. Product arrived on time, (arrived June 15) set up was a snap as it is basically the same as others in this family.I use the camera primarily for progress shots on my large industrial construction projects and don't have to worry about dust or banging it on a scaffold or whatever.. ideal camera for my intended purpose.... until today.The zoom function stopped working completely, no zoom at all. Changed batteries ( I know that had really no bearing on the problem but made me feel better), fiddled with various menu functions - but the zoom is pretty straightforward and still not working. Very disappointed at this development.. The camera is going back and I will likely order another one in the hope that this experience was just a  one off and not indicative of the entire line***Update***The second camera arrived and I used it with no problems - no underwater stuff, just jobsite progress pictures. At about the same time frame as the previous unit,the SAME problem occurred i.e the zoom stopped working. Searching for a second opinion I contacted \"Just Answer\" and their analysis was that the plastic gears controlling the zoom had stripped and as the item is still under warranty I should return it... I'm not too optimistic about going through this a third time  especially as I bought additional batteries and wall charger, and don't want to get stuck with several batteries and returning cameras every 60 daysThe unit feels good in the hand and does do it's job - most of the time, but for this price point I expect all the functions to work normally for longer than 60 days - return to Amazon imminent", "Date": "July 15, 2013"}, {"Title": "Love this camera", "Author": "Noah", "ReviewID": "R3W2E2JOCOA6ZP", "Overall": "5.0", "Content": "I never leave reviews unless I'm either very upset, or head-over-heels.My dad is a photographer and had the WG-II laying around and I asked if I could borrow it for my backpack trip to Israel. He is a camera snob (and rightfully so), so I assumed it would be good. I was wrong. It was great.Amazing quality, settings and camera modes for days. Does everything from underwater video, time-lapse sunset shots, burst shooting, ect. (I would recommend reading the users manual all the way through)I loved it so much I came back and bought the new one for myself so I wouldn't have to share. It's annoying how much I love this camera.couple of cons: (not really cons, more recommendations.)1) The battery life is decent, but if you are on a trip and away from an outlet for more than a day, buy additional batteries. you will use them.2) buy the 32g SD card. enough room you won't have to worry about taking too many pictures before you transfer to a computer.bottom-line: Buy this camera.", "Date": "August 11, 2013"}, {"Title": "Trip of a lifetime - very happy", "Author": "SJR \"SJR\"", "ReviewID": "R2HBU0EBY1ECRK", "Overall": "4.0", "Content": "I strapped this camera to a waterproof backpack and backpacked 5 days through the Hell's Gate Wilderness in AZ (Tonto creek).  It is a trip I only intended to do once as it is a brutal as it is scenic.  I wanted a rugged waterproof camera, and this did not disappoint.  The camera was either in water, or in a soaked camera case for 5 days straight - only drying out at night when we made camp.  Definitely held up on waterproof.  Day 2 or 3 I fumbled the camera and dropped it from waist high to a wet boulder - yay, impact resistance!  No visible damage!  I left the camera in landscape mode the entire trip - pictures came out beautiful.  Picture quality is excellent with vibrant lifelike color.  Don't know if it is shutter speed or image stabilization, but all pics I took were clear.  I thought I might have a few blurry pics because I was swimming as I was snapping pics, but the only flawed pics I had were where I had a big water drop on the lens (one or two of those out of 300+).  Very, very happy with this camera.", "Date": "June 19, 2013"}, {"Title": "Takes decent pictures but...", "Author": "Littlebuddhaman", "ReviewID": "R2G5NXCHQLLBXL", "Overall": "2.0", "Content": "Originally bought this camera because of it's waterproof feature (up to 45ft).  Went on vacation to Hawaii and was looking for a camera that would be ideal for taking pictures while snorkeling.  Out of the package, took a lot of test pictures before using it and the quality was pretty good.  The exterior has a rugged feel to it and saw that the battery/sd card compartment has a double lock to ensure it does not accidentally open up, especially if it is in a wet environment.  Once on vacation, tried turning on the camera and it would power up and immediately power back down.  To eliminate the possibility that the camera got turned on during the flight, recharged the battery and again it would power up and then power back down.  Actually had to hit the camera real hard with my hand to get it to start working right.  On the first day of snorkeling, while trying to learn how to use it in the water, the camera took pretty good quality shots.  I was actually happy with the test shots in the water,  The second time out was when the issues started happening.  While taking pictures in the water, the camera started turning off again for no reason.  Once out of the water, saw that the double lock was still engaged and after making sure the camera was dry, upon opening the battery/sd cover, noticed that it was wet inside and it appeared the battery \"blew up\" or started leaking.  There was a green substance oozing out the area where the battery pins were.  It appears the housing may have leaked due to the moisture in the housing.  When the camera was operational it did take pretty decent quality shots and its many features are useful.  I have never had any issues with Pentax cameras and they are usually super reliable.  I will be returning this camera and hopefully, it is just a \"lemon\".", "Date": "September 6, 2013"}, {"Title": "Camera failed in 10ft of water", "Author": "Nemo", "ReviewID": "RGOTGVARIT3D0", "Overall": "2.0", "Content": "I bought this camera specifically for its underwater capabilities. The first time I took it under water (~10ft, snorkeling), it stopped working.", "Date": "June 14, 2013"}, {"Title": "Excellent Underwater Camera", "Author": "Dan Chemistruck \"Truck\"", "ReviewID": "R6YC2MG3MCEPL", "Overall": "5.0", "Content": "I've only had this camera for a week, but I love it so far. I purchased this to primarily use it underwater.Pros:- It can focus in almost no light- Fully adjustable ISO/Aperture/Time settings- Nice wide f/2.0 apertureCons:- In almost no light, it takes about 1 second to take the picture after you press the shutter buttonI love this camera and I will post an update in a few more weeks.", "Date": "April 24, 2013"}, {"Title": "A little bit bulky but gorgeous screen and excellent pictures", "Author": "420", "ReviewID": "RBYQ7BLQ9BHR1", "Overall": "4.0", "Content": "<!--\n\nfunction fp_resizePlayerSpace(nsPrefix,w,h)\n{\t\n  try {\t\n    var ifrm = parent.document.getElementById(nsPrefix + \"movieFrameID\");\n    if (ifrm) {\t\n        var h2 = h + 35;\n        ifrm.style.height = h2;\n      }\n    } catch(err) {\n \n    } \n\n\n  if (h > 0) {\n      document.getElementById(nsPrefix + \"clipDiv\").style.height=h+\"px\";\n      document.getElementById(nsPrefix + \"videoPlaceholder\").style.height=h+\"px\";\n  }\n  else {\n      document.getElementById(nsPrefix + \"clipDiv\").style.height=\"\";\n      document.getElementById(nsPrefix + \"videoPlaceholder\").style.height=\"\";\n  }\n  document.getElementById(nsPrefix + \"flashcontent\").style.height=\"100%\";\n}\n\nfunction fp_rewriteDiv(nsPrefix,divName,html)\n{\t\n    document.getElementById(nsPrefix + divName).innerHTML=html;\n}\n\nfunction embeddingPopup(nsPrefix)\n{\n  alert(\"placeholder function for embedding code\");\n}\n-->\n\n\n<!--\n\nfunction cv_mo1JY1AAB493S1SembeddingPopup(){\t\nalert(\"Embedding code will be displayed here.\");\n}\n\n-->\n\n\n\n\n\n\n\n\n\n<!--\nfunction cv_mo1JY1AAB493S1Srefresh_preplay() {\n\ndocument.getElementById(\"cv_mo1JY1AAB493S1SchiDiv\").innerHTML = document.getElementById(\"cv_mo1JY1AAB493S1ShiddenPre\").innerHTML;\n};\ncv_mo1JY1AAB493S1Srefresh_preplay();\n\n-->\n\n\n\n\n\n\n        // <![CDATA[\n\nvar cv_mo1JY1AAB493S1Sso;\t   \n\n\nfunction cv_mo1JY1AAB493S1SloadSwf_Core(swfLocation, swfWidth, swfHeight, flashVersion, bgColor, swfParams, flashParams, embedAttributes) {\n\n  try {\n      cv_mo1JY1AAB493S1Sso = new SWFObject(swfLocation, \"cv_mo1JY1AAB493S1SAMPlayerProd\", swfWidth, swfHeight, flashVersion, bgColor);\t   \n\n      for (var v in swfParams) {\n        cv_mo1JY1AAB493S1Sso.addVariable(v, encodeURIComponent(swfParams[v]));\n      }\n      for (var v in flashParams) {\n        cv_mo1JY1AAB493S1Sso.addParam(v, flashParams[v]);\n      }\n      for (var v in embedAttributes) {\n        cv_mo1JY1AAB493S1Sso.setAttribute(v, embedAttributes[v]);\n      }\n\n      cv_mo1JY1AAB493S1Sso.addVariable(\"swfEmbedTime\", new Date().getTime());\n\n      var agt = navigator.userAgent;\n       \n      var reFirefox = new RegExp(\"firefox/\", \"i\");\n      var regx = agt.split(reFirefox);\n      var ffVersion = 8;\n      if (regx[1]) {\n          var pts = regx[1].split(/[.]/);\n          ffVersion = parseFloat(pts[0] + \".\" + pts[1]);\n      }\n      var minorVersion = parseFloat(navigator.ap);\n      if ((navigator.appVersion.indexOf(\"Mac\")!=-1) || (ffVersion < 1.5)) {\n          cv_mo1JY1AAB493S1Sso.setAttribute(\"height\", swfHeight);\n          cv_mo1JY1AAB493S1Sso.setAttribute(\"width\", swfWidth);\n          cv_mo1JY1AAB493S1Sso.addVariable(\"oldFirefox\", \"1\");\t     \n      }\n\n      if (cv_mo1JY1AAB493S1Sso.write(\"cv_mo1JY1AAB493S1Sflashcontent\")) {\n          fp_resizePlayerSpace('cv_mo1JY1AAB493S1S', \n                               320, \n                               283);\n      }\n      else {\n          var nsPrefix = 'cv_mo1JY1AAB493S1S';\n\n          fp_resizePlayerSpace(nsPrefix, 0, 0);\n          fp_rewriteDiv(nsPrefix, \"flashcontent\", '<br/>To view this video download <a target=\"_blank\" href=\"http://www.macromedia.com/go/getflashplayer\" target=\"_top\">Flash Player</a> (version 9.0.115 or higher)');\n      }\n  } catch(err) {\n      fp_resizePlayerSpace('cv_mo1JY1AAB493S1S', 0, 0);\n  }\n  return false;\n}\n\n\n\nfunction _cv_mo1JY1AAB493S1SloadSwf(movieID, playerVersion) {\n    var swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/20120510035744301/AMPlayer._V148501545_.swf\";\n    var swfWidth = \"320\";\n    var swfHeight = \"100%\";\n    var flashVersion = \"9.0.115\";\n    var bgColor = \"#FFFFFF\";\n\n    var swfParams = {};\n    var flashParams = {};\n    var embedAttributes = {};\n    swfParams.amazonPort = \"80\";\n    swfParams.allowFullScreen = \"true\";\n    swfParams.telemetrySubPageType = \"VideoReview\";\n    swfParams.nsPrefix = \"cv_mo1JY1AAB493S1S\";\n    swfParams.locale = \"en_US\";\n    swfParams.logUrl = \"gp/mpd/l\";\n    swfParams.canResize = \"1\";\n    swfParams.autoPlay = \"1\";\n    swfParams.sessionId = \"000-0000000-0000000\";\n    swfParams.marketplaceID = \"ATVPDKIKX0DER\";\n    swfParams.salign = \"LT\";\n    swfParams.preset = \"detail\";\n    swfParams.mediaObjectId = \"m3DXE8OFWAOB28\";\n    swfParams.autoPlayTimer = \"\";\n    swfParams.mediaObjectIDList = \"m3DXE8OFWAOB28\";\n    swfParams.playIsUserGenerated = \"1\";\n    swfParams.enableShare = \"0\";\n    swfParams.permUrl = \"gp/mpd/permalink\";\n    swfParams.telemetryPageTypeID = \"RBYQ7BLQ9BHR1\";\n    swfParams.xmlUrl = \"http://www.amazon.com/gp/mpd/getplaylist-v2/m3DXE8OFWAOB28/000-0000000-0000000\";\n    swfParams.amazonServer = \"www.amazon.com\";\n    swfParams.scale = \"noscale\";\n    flashParams.allowFullScreen = \"true\";\n    flashParams.salign = \"LT\";\n    flashParams.bgcolor = \"#FFFFFF\";\n    flashParams.allowScriptAccess = \"always\";\n    flashParams.quality = \"high\";\n    flashParams.wmode = \"transparent\";\n    embedAttributes.title = \"Flash Player\";\n\n    if (movieID){\n      if (playerVersion == '3'){\n        swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/20120510035744301/AMPlayer._V148501545_.swf\";\n        swfParams.mediaObjectIDList = movieID;\n      } else {\n        swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/legacy/20101014901/AMPlayerProd._V197491872_.swf\";\n      }\n      swfParams.xmlUrl = \"http://www.amazon.com/gp/mpd/getplaylist-v2/\" + movieID + \"/000-0000000-0000000\";\n      flashParams.wmode = \"transparent\";\n      swfParams.autoPlay = \"1\";\n    }\n\n    if (document.getElementById('cv_mo1JY1AAB493S1Sduration')) {\n      document.getElementById('cv_mo1JY1AAB493S1Sduration').style.display='none';\n    }\n    cv_mo1JY1AAB493S1SloadSwf_Core(swfLocation, swfWidth, swfHeight, flashVersion, bgColor, swfParams, flashParams, embedAttributes);\n\n  return false;\n}\n\nfunction cv_mo1JY1AAB493S1SloadSwf(movieID, playerVersion) {\n   return _cv_mo1JY1AAB493S1SloadSwf(movieID, playerVersion);\n}\n\n\n\t\n\t\t// ]]>\n\t\n\n<!--\n\nfunction cv_mo1JY1AAB493S1SnewHeight(h)\n{\t\n    fp_resizePlayerSpace('cv_mo1JY1AAB493S1S', 0, h);\n}\n\nfunction cv_mo1JY1AAB493S1SresetPlayer(w,h,bw,cc) {\n  cv_mo1JY1AAB493S1SnewHeight(h);\n\n  cv_mo1JY1AAB493S1Sso.addVariable(\"resetBandwidth\", bw);\n  cv_mo1JY1AAB493S1Sso.addVariable(\"cacheCode\", cc);\n  cv_mo1JY1AAB493S1Sso.setAttribute(\"height\", h);\n  cv_mo1JY1AAB493S1Sso.setAttribute(\"width\", w);\n  cv_mo1JY1AAB493S1Sso.write(\"cv_mo1JY1AAB493S1Sflashcontent\");\n}\n\n-->\n\n\n\n\n\n\n\n\nvar cv_mo1JY1AAB493S1SRollOverImg = new Image();\ncv_mo1JY1AAB493S1SRollOverImg.src = \"http://ecx.images-amazon.com/images/I/81kCV%2BSTbtS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play-active,BottomLeft,130,-12_CR0,0,0,0_.png\";\n\nvar cv_mo1JY1AAB493S1Spreplay = document.getElementById('cv_mo1JY1AAB493S1SpreplayImageId');\nif (cv_mo1JY1AAB493S1Spreplay) {\n  cv_mo1JY1AAB493S1Spreplay.onmouseover = function() {\n    cv_mo1JY1AAB493S1Spreplay.src = \"http://ecx.images-amazon.com/images/I/81kCV%2BSTbtS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play-active,BottomLeft,130,-12_CR0,0,0,0_.png\";\n  }\n  cv_mo1JY1AAB493S1Spreplay.onmouseout = function() {\n    cv_mo1JY1AAB493S1Spreplay.src = \"http://ecx.images-amazon.com/images/I/81kCV%2BSTbtS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play,BottomLeft,130,-12_CR0,0,0,0_.png\";\n  }\n  \n  \n  var node = cv_mo1JY1AAB493S1Spreplay.parentNode;\n\n  var cv_mo1JY1AAB493S1ScurrentClick = node.onclick;\n  node.onclick = function () {\n    var head = document.getElementsByTagName(\"head\");\n    if (head[0]) { \n      var logTag = document.createElement('script');\n      logTag.type = \"text/javascript\";\n      logTag.src = \"/gp/customer-media/du/log.html?ie=UTF8&p=CustomerImage&s=CustomerVideoPlay\";\n      head[0].appendChild(logTag);\n    }\n\n    if (cv_mo1JY1AAB493S1ScurrentClick) {\n      return cv_mo1JY1AAB493S1ScurrentClick();\n    }\n  }\n}\n\n\n\n\n Length:: 4:22 MinsDifficult to operate one-handed, especially when filming fast moving objects.Macro photos and videos are STUNNING.It is extremely robust, it didn't leak water or break after repeated abuse.The screen is luxuriously roomy.I prefer the WG-10, even though it's cheaper, because it's so much easier to handle. (The resolution and megapixels aren't as high, but it's good enough)", "Date": "May 10, 2013"}, {"Title": "\"Waterproof\" Lemon", "Author": "MauiD", "ReviewID": "R2QZ6DB0UY1142", "Overall": "1.0", "Content": "I purchased this item based on the positive reviews it received.  I should have paid more attention to the negative ones.  The camera performs well on the beach when dry but after only the 4th time in shallow pacific ocean water I came out and saw that the screen had fogged over.  When I opened the battery compartment salt water poured out and the camera was useless.  Having had this same problem with another brand I knew that customer support at Pentax could not help and I returned it to Amazon for further return to Murphy's camera.  Is there any \"waterproof\" camera out there that doesn't leak?", "Date": "November 2, 2013"}, {"Title": "Best Waterproof Camera in my Opinion", "Author": "SewIn2Disney", "ReviewID": "R21I2MIRWBPK37", "Overall": "5.0", "Content": "My fiance and I are going on our honeymoon in a month (to St Lucia) and wanted a nice waterproof camera to take with us. I purchased four different waterproof cameras (this Pentax, a Nikon and two Olympus) and did a side by side comparison of the four- this one outperformed the Nikon and the cheaper Olympus, but in the end won out because it had the feature of bracketing (where I can take an overexposed, properly exposed and underexposed photo) for further refinement in photoshop.To read my comparison (including pro/cons of each) and to see the test shots, check out my blog post:http://handmadeisbetterblog.com/2013/06/21/choosing-the-best-underwater-camera/", "Date": "June 22, 2013"}, {"Title": "GPS is slow and weak", "Author": "Cory Mac Vie", "ReviewID": "R136G2D342FFLF", "Overall": "2.0", "Content": "This review is solely on the GPS feature of the Pentax WG-3 GPS camera.  Most GPS cameras and smart phones calculate lat/long location every second. The Pentax WG-3 seems to only calculate its location once every 60 seconds, possibly to reserve battery life.  If you are capturing multiple photos a minute and GPS accuracy is important then this camera will NOT work.  If you capture multiple photos a minute then each photo will have the same lat/long. I've included a photo link below showing the results of my personal testing of the GPS. You can clearly view grouping of images to one location instead of its true location.Personal Testing Results: [...]", "Date": "December 11, 2013"}, {"Title": "Awesome qualities..", "Author": "Flo \"flexter\"", "ReviewID": "RK9T5UIKKYEXY", "Overall": "5.0", "Content": "Replaced an older water/shockproof Olympus. This camera is awesome. I regret not getting the Gps version, but still really happy with the purchase. The 30x zoom is out of this world -for the price- alongside the extra led illumination when using flash, the visual balances on the screen to align a perfect shot, and a vast array of caption options.I hope it'll remain useful in good conditions for a few years.", "Date": "May 19, 2013"}, {"Title": "It was good when it worked...", "Author": "Mark \"Mark\"", "ReviewID": "R3H8JIM1E3AAJM", "Overall": "1.0", "Content": "I received the camera in late March.  The camera takes good pictures (when it works) and has nice features.  BUT... 6 months later, it is totally dead - without me ever using it under water, dropping it, or subjecting it to other harsh environments.  After not using it for a couple of months, I took it off the shelf and was going to use it on my vacation.  Unfortunately it would not power on.  At all.  The power LED would come on but nothing else.  I tried 3 different batteries all with the same result.It is not easy to figure out how, but I have contacted the Ricoh/Pentax support line and they said that it looks like there must be a circuit board issue.  They asked me to send the camera in to them - at my expense - to get it looked at and repaired under warranty....  -- more to follow --11/22 - The camera was received at the service center and is being repaired.  I was a bit disappointed that it is going to be repaired instead of replaced AND that it is waiting on parts which the repair place says can take 2-4 weeks.  At least it will be covered under warranty.  More to follow.", "Date": "November 8, 2013"}, {"Title": "stopped working after 29 days", "Author": "tommy", "ReviewID": "R38W6MOX0TN4XD", "Overall": "2.0", "Content": "i love the concept of the camara, but was not happy with its performance.  the pictures are very good, the close-ups are great, and it is compact in size.  however, the camara simply stopped working in 29 days. called for service and they said send it back to amazon. so thats what i did.  here is the thing.  for the 29 days that it worked, i loved it.  So i  am getting another [this time with a GPS and extended warranty.]  If it also gives me problems, i will  do this again but use stronger words.", "Date": "June 7, 2013"}, {"Title": "Everything it claimed to be... and then some.", "Author": "Roark", "ReviewID": "RH3MV34EO450A", "Overall": "5.0", "Content": "I'm an avid amateur photographer with lots of expensive digital photo gear.  I've been wanting a better solution for paddling trips and hikes than my cheap Kodak C123 waterproof point-and-click.  I tried a few dry bags for my Nikon cameras, but none gave me easy access to the controls I desired.  So I looked around for a better waterproof solution and I decided on this Pentax after comparing offerings and reading other product reviews here.  After 6 months of use, I still love this little camera.1) The ergonomics are excellent: All of the typical point-and-shoot buttons are where you expect (shutter, zoom, playback, etc.), the screen is large and fairly bright, the rubber grip surfaces make this thing hard to fumble, and the rugged shock-resistant case make it no problem if you do.  Only the power button is in a bad place, right next to the shutter release.  More than once I turned off the camera by mistake instead of getting that great shot.2) Zoom and focus: The (limited) optical zoom is a great feature, not found in most underwater cameras in this class.  Zoom speed is respectable and I like that I can disable digital zoom and leave optical zoom enabled.  With responsive 9-point AF, Spot AF, Auto tracking AF and pan focusing, it rivals the AF abilities of an entry level Nikon or Canon DLSR.3) Flash:  The main flash is bright and nicely diffused.  The supplemental high intensity LED lights help capture those interior candid shots and reduce a lot of grain.  They also serve to identify where in the frame faces are detected for those all important \"selfies.\"  This seemed like a gimmick when I read it but I've used the feature quite a lot at parties to get myself in the pic.4) Camera modes: This camera has a lot of modes.  I would encourage any new user to take a few hours, read through the manual with camera in hand and try some of them.  They include a 3 panel landscape panorama stitching mode that works almost as well as Photoshop, and a 2 panel portrait stitching mode that results in a nice high res landscape frame.  Other features like white balance adjust, and fun filters like sepia (2 hughes) make this a very practical day-to-day walking around camera.5) GPS: works well and geotags the images' EXIF data just as expected.  The GPS tracking feature is fun for hikes or other trips and creates a file that can be uploaded to your favorite trip tracking site.  (I use everytrail.com)Note: With the GPS receiver turned on, the batteries will drain over time even with the camera off.  This is the only place where a dedicated button (gps on/off) would have been very useful instead of digging 3 levels down the menu tree to do it.6) Battery life: is pretty good considering the 16Mpx sensor, optical zoom and large LCD display.  I also bought the Wasabi Power Battery (2-Pack) and Charger for Pentax D-LI92 and Pentax Optio I-10, RZ10, RZ18, WG-1, WG-1 GPS, WG-2, WG-2 GPS, WG-3, WG-3 GPS, WG-10, X70 here and it's saved my bacon a few times to have spare batteries handy.7) I don't find the front LCD for altitude very helpful, and not very accurate, but no GPS device I own gives accurate altitude readings around here so I can't say that's the camera's fault.  It can also show time with the built-in alarm but I haven't used that feature.8)  Compass: The electronic compass, on the other hand, is very useful and seems to be more accurate than my android phones or other GPS receivers I have.  I've used it a couple of times to position antennae and get a quick bearing on a trail.9)  Wireless charging: I was very excited when first opened the box to see the QI label on the case.  It was an unadvertised feature that I use all the time to keep the camera charged on a QI compatible wireless charging pad.  This is a great convenience, and since you have to open the waterproof door to get to the USB port to internally charge the battery, that saves on the life of the seal somewhat too.10) I find it hard to find anything to complain about with this camera.  So I'll just mention that in full sunlight the LCD is a bit hard to see especially with the sun behind you (where you want it most shots) so I may put on a Delkin Devices DU3.0-M BLK Universal Pop-Up Shade for 3.0-Inch LCDs (Black) to cut glare.  So, besides my nits about the power button placement, the menu navigation to turn the GPS on/off and the less than brilliant (see what I did there!) LCD display, this is a perfect camera for it's intended function and then some.  I highly recommend it!", "Date": "January 6, 2014"}, {"Title": "not water proof", "Author": "bw reader \"book look\"", "ReviewID": "R2Y000J5PZO41P", "Overall": "1.0", "Content": "I purchased this camera for my husband for Christmas.  Two days later we were to go to St. Thomas on vacation.  Camera took great pictures until we took it to the beach.  From then on it was a bust.  Salt water got into the camera just at the edge of the shore,  maybe three feet of water.  I was so disappointed that the camera stopped working, and filled with water.  That was day three of our week vacation.  The rest of the time my husband had to take pictures with his phone.  BUMMER I am in the process of getting my money back.  BEWARE!!!!", "Date": "January 5, 2014"}, {"Title": "2nd day of use, it broke.", "Author": "Tim Gladding", "ReviewID": "R3AW8D5POIFQ0S", "Overall": "1.0", "Content": "I bought this camera on December 2nd.  I had it in and out of water for over a month, at home, testing it's ability to do it's job.  No problems.  I even rated it 5 stars.  Then I took it on the road.January 8th, day 1, I'm on vacation, I took the camera with me in to the ocean.  For about 2 hours it was used to take almost 200 pictures and about 20 minutes of video.  Worked great, no problems.  That evening I washed it under tap water to remove any sand/salt residue and then opened it up.  I found a tiny amount of sand had gotten past the seal but no water.  I blew out the sand and made sure it was sealing correctly.  As the camera had many bad reviews before I was extra careful to make sure I did everything right.January 9th, day 2, I'm back in the ocean.  Not 5 minutes after I turn it on it turns itself off.  It refuses to power back up.  I give up and spend the rest of my time at the beach not using it.  That afternoon I get back to my hotel and open it up, it's flooded with sea water.  The seal completely failed.This camera is junk.  DO NOT BUY.  I wish there was a 0-star option because this product just doesn't do what it's supposed to do.Original review below, published on January 4th 2014, prior to vacation:I was a little hesitant to purchase this camera because some of the other reviews suggested that it's build quality was poor and there were many problems with leaking.  I'm happy to report that I've had no such problems after a month of testing.To the people who had leaking issues, did you actually lock both locks on the battery door?  It's not tight until you do.Did you let your kids play with the camera?  The battery door isn't super strong, if you open it and then keep pushing you're going to bend the hinge, then it won't seal properly next time you close it.", "Date": "January 4, 2014"}, {"Title": "Love this Camera !", "Author": "Virgi", "ReviewID": "R346E5Y4ZE1HOB", "Overall": "5.0", "Content": "I have had great point and shoot cameras,but this one is by far the best choice made.Just the Macro is worth th money,it gives you crisp,sharp images like the SLR Rebel that I have. Outstanding photos at night even in darkest light. Very user friendly not mention the way its designed…wow you can hold it any which way without the fear of it slipping from your hands ( like 2 of mine have)I love the fun colors offered,mine is Orange.Did I mention WATER PROOF ,omg the pros just make this a perfect choice.", "Date": "May 23, 2013"}, {"Title": "Loaded with features", "Author": "Andrew", "ReviewID": "R3HE0EU2R9M0HD", "Overall": "4.0", "Content": "I have owned both the this and the previous WG-2 model and when I describe it to people I say that it does a lot of things very well, but obviously the image quality isn't going to live up to a DSLR or a mirrorless camera. The video it shoots is extremely solid and in good lighting situations the photos are crisp. I love using this camera for macro shots, especially at night because they come out looking really brilliant. The time-lapse function is incredibly flexible and I have made some brilliant time lapse videos with this thing. HDR works well and doesn't blur, the high-speed video function is a nice trick to show off and the GPS/Compass combo provides very useful and precise location and direction data.There were two features that I didn't find listed during my research that are very important:First, VIDEO AUTOFOCUS. This was a huge surprise to me and although I had gotten used to the fixed focus on the WG-2, this feature was a fantastic surprise and it works smoothly in both regular and macro focus modes.Second, LIVE GPS DATA. To activate electronic compass function you hit the OK button and cycle through the different on-screen display set-ups. When you get to the compass function, if you have the GPS function active and you have a signal, it shows you're current readout live. The ability to see this data live rather than having to wait and read the metadata later is really useful for off-camera geocache logging and navigation purposes.", "Date": "January 8, 2014"}, {"Title": "A lot of fun, love it!", "Author": "Syncro", "ReviewID": "R2OLGE2V4KFQZ6", "Overall": "5.0", "Content": "I've used this camera a fair amount camping and mountain bike riding. The one word that best describes it is FUN! Its durable and worry proof in a jacket pocket, but most important it is a camera that is actually there with you to capture the action. It feels good in the hand, enough heft to inspire confidence, and the shape allows a firm grip. There is a radius area on the top which forms a natural secure fit for your fingers.Some reviews nit pick minute details, but bottom line is it takes great pictures with good color and is a great all around camera. It really shines for close ups, and the microscope mode is incredible. Detailed pictures of insects etc. are a snap.Things I really like:By holding the \"OK\" button down a few seconds, a colorful analog clock appears on the screen along with date and digital time. I've used this a lot, not only for night time, as its a handy feature, plus the camera auto shuts off after 10 seconds. It also has a flashlight mode. Both of these features only work with the camera “off”.Low light images are fine, providing the auto ISO settings are kept reasonable. I have mine set to auto range from 125-800 which works pretty well, the f 2 lens no doubt helps. The flash easily fills an average room, yet throttles down for exceptional close ups. Much better than I expected for a point and shoot camera. All together I see no issues with low light situations.Optical zoom is “only” 4x, but combined with the 'intelligent' digital zoom it was adequate. My choice, as with any camera, is to not use the digital zoom beyond the “intelligent zoom” setting. The camera also has a histogram mode that is easily switched on. For those that may not be familiar, a histogram quickly shows parts of a frame that are either under or over exposed. Outdoor photos are also good and the wide 18mm lens really takes in a lot of scenery. The panorama mode, which joins adjoining shots together, while not perfect, is for sure fun to play with.Contrary to some reviews I find the menu and controls quite easy to use. There is a handy mode button which presents all of the camera's capture modes on an easily selectable screen with recognizable icons. I can't see it getting much more simpler than that. The 4 way rocker is a little small, but clearly marked and usable. Don't try it with gloves, but really, what point and shoot camera can. It also has a dedicated video button, so no menu required to take movies.Pentax cameras also feature what they call a “Green Button”. This is pretty neat, as pressing the green button puts the camera in a pre-set picture mode regardless of any custom settings that are being used. The purpose is to allow for a fast photo of an unexpected event.  Press the green button again and you're back to your custom settings.Concerning under water use, personally I do not trust ANY of the point and shoot so-called waterproof cameras for true use under water. Examine how any of these cameras seal themselves, regardless of brand, then look at what the pros use. All real underwater cameras have a separate waterproof case that has heavier O-ring seals with solid even pressure latches. My personal view of this camera, and others in this class, is they are rugged and great for wet areas, dust, snow, and if dropped in a stream they will survive. While I did try it for a brief under water video with no issues, no way would I take it or any other camera that was not in a separate water tight case snorkeling or other continuous under water use.Somethings I didn't like:While there is a neat video function that allows for time lapse recording (lots of possibilities here)  the shortest interval is 1 min per exposure. That may be fine for watching a flower bloom or long sunset, but limits time lapse for many other uses. I'd have liked shorter intervals, perhaps in 10 second increments from zero up to 1 minute.The flashlight mode is handy and readily turned on even if the camera is switched off, however it's not very bright. It's better than nothing in a dark room and handy for having motorists see you on a dark street, but not a true flashlight.Pentax supplies one battery and no external charger. Fortunately extra batteries and an external charger are readily available at reasonable prices on line. Of interest I found that after a decent, but not stellar time, the battery indicator would start to diminish. By chance I found that if I remove the battery and then re-insert it the charge indicator came back up to full charge and stayed there for considerable more use.Video mode allows for slow motion (shoots at twice the normal speed for the appearance of slow motion playback) great feature, but it is limited to just 25 seconds of recording. Speaking of video, the camera takes nice crisp HD movies with good color, however not as good as some higher priced true video cameras. Also, the internal zoom lens mechanism is quite audible when using the optical zoom, only way to avoid a loud gear noise when zooming is to either not use the optical zoom when videoing or to just use the digital zoom range which is completely silent. I don't see any of this as deal breakers, just be aware this cameras video mode is not for making an Oscar award feature movie. Nonetheless, you'll still get good looking video to capture fun events in a rough environment.Bottom line is this is really a great go anywhere rugged camera that is a blast to own and use. Be sure to apply a screen protector before serious use, if this camera is used in its natural rough element the glass screen needs protection. Overall I love this camera and am VERY happy with it!", "Date": "November 18, 2013"}, {"Title": "Loved it! But, then it broke.", "Author": "Meeshellsky", "ReviewID": "R2T9O12VRO8D1D", "Overall": "3.0", "Content": "I loved the underwater pictures and video this camera took. I thought the quality was really high considering the pictures were underwater. The only bad thing I can say about this particular camera is that it stopped working after about a week. The display kept flashing on and off and would not take pictures anymore. We returned it and got a full refund. I would buy this product again though. I think we just got a lemon.", "Date": "June 10, 2013"}, {"Title": "Awesome!", "Author": "Bigrubberchicken", "ReviewID": "R3278BK53GYJ8X", "Overall": "5.0", "Content": "Great low light pictures!  The digital microscope thingy is pretty cool too.  Bought it for the wife because she is really good at destroying point & shoots, getting them wet, dropping them, dust, sand, etc...  It has survived all of that so far with no issues.", "Date": "May 24, 2013"}, {"Title": "Replacement for the same one I lost...", "Author": "rootie", "ReviewID": "R8ZFGWQZS9MVK", "Overall": "4.0", "Content": "I liked the last one of these (same model, different color) so much, that when I lost it (heh, should have used the carabiner - it fell out of my jacket pocket) I bought another one.  *HUGE* tip -- if you buy one of these, learn to turn the GPS off when you aren't using the camera because it will drain your battery.  That GPS drain is a really annoying issue to me.  I love the macro ability, though the super macro can be frustratingly slow to focus.  The macro lights are handy.  The noise reduction can be pretty destructive to high ISO image details, so you will do well to limit the range (see the manual and/or menus).  My 5 year old has no trouble turning the camera on and taking pictures with it.The carabiner is a mixed bag -- it attaches firmly, but I wish the attachment was closer to the camera -- it swings around a bit.  (yes, I have adjusted the strap about as short as it will go).This won't charge from a computer USB, and you have to have the camera battery charged to download pictures from the camera.  That usually isn't a problem since I have an SD slot in my computer so just pop the memory card out.My last one of these leaked one time in a swimming pool -- it never got very deep in the water, and I think the seal was clean.  It did recover after some time in a rice bag.  I haven't gotten the new one wet, but probably will try to avoid leaving it in my swim shorts.", "Date": "February 3, 2014"}, {"Title": "Very \"solid\" camera", "Author": "Joel Mayer", "ReviewID": "R3AFC903I0J0NF", "Overall": "5.0", "Content": "We decided on this camera for my wife and daughter's trip overseas.  They would be spending some time \"in the water\" (Black Sea) and wanted a camera that was compact and would not take much space in luggage and be VERY durable.  After some research we decided on this camera and it is VERY good.Ironically it did not get used for \"underwater\" pictures (though ample other reviewers have posted about this capability) it did extremely well at other duties.Pros:1.  Takes great pictures.  While it is not a DSLR the pictures it takes are very good.  The clarity is outstanding.  They also took some pictures at dusk and at night in Amsterdam and they turned out very clear considering how low the ambient light was.2.  Plenty sturdy.  We needed a camera that we would not be panicing if our 5-year-old daughter picked it up and started snapping pictures.  It performed perfectly.  Not a nick or a scratch, much less damage that would prevent proper functioning.  This does not mean it was not dropped, but that it held up admirably.3.  Lightweight.  What we hadn't considered and turned into a HUGE advantage is that it is lightweight.  Not just for carrying around but our daughter could easily hold it and point where she wanted.  We have a larger DSLR type camera and sometimes the large lens out in front makes it unwieldy for her.  She is easily able to handle this camera.4. Compact design.  It doesn't take much room in luggage AND it can be easily slipped in a pocket in case a great \"photo op\" arrives.  This was a large part of our decision and we were thrilled with the results.Cons:1.  Battery Life.  Though I don't know how many pictures it can take before requiring \"re-charge\" we quickly came to the conclusion to always have a charged spare battery with us.  The camera comes with 1 battery but about $30 bought us 2 additional batteries, a car adapter charger, and a wall charger (Wasabi Power Battery 2 Pack Charger  This is money very well spent.2.  Not much \"zoom.\"  You have to give up something and, all things being equal, I like more zoom.  This works OK for \"snapshots\" but if we were trying to take a picture of something small or a long ways away (such as wildlife) this could be frustrating.3.  Strap is not very sturdy.  I put this last as I don't usually consider this as a significant factor in my decision making process.  However, it would be better if it were more sturdy.In all, I would definitely recommend this camera for the \"pros\" expressed above.  I wish I could give 4.5 stars for the battery life, but it is worked around so easily I don't want to lower its review a full star for something like that. The batteries are small and easy to carry (I could fit 5-10 in my pocket and barely notice.  The \"cons\" are easily accomodated and it did its expressed job very well.  It isn't perfect, but it is sturdy and takes great photos.  Perfect for traveling and capturing \"moments\" when I am \"on the go.\"", "Date": "January 5, 2014"}, {"Title": "Fog, moisture, fog", "Author": "Mary Damer", "ReviewID": "R8TLEZWJXLCCY", "Overall": "2.0", "Content": "Bought the camera for a Caribbean vacation and was pleased with the first pics.  However, once I used it underwater snorkeling, I had the same problem some one else reported of it turning off.  What was worse was that after 30 minutes, the moisture inside the lens prohibited clear pictures. And I was sure that I had it sealed perfectly before going in.  By the next day the moisture was gone and so I started taking pictures out of the water at the Baths, but after about five pictures, the moisture was there again. THe humidity in the air must have triggered it so I put it back in my case, and about fifteen minutes later I could take a few pictures before it happened again.  Then I noticed that there was also moisture on the sighting lens.  SOmehow this camera must have come with an airpocket already in it or something.  I'm good for about ten minutes of pictures either underwater or on land and then fog.", "Date": "December 7, 2013"}, {"Title": "The manufacturer lied on their specs ...", "Author": "Ken C", "ReviewID": "R1R2RUDXRUEYN7", "Overall": "4.0", "Content": "I am disappointed at the zoom range of the camera.  Pentax (Ricoh) falsely claims in the webpages (and belied on their own Owners Manual) that the camera maximum wide focal length is the equivalent of 20mm on a 35mm film camera.  However, in reality it is not that wide, and on pages 109 and 110 of the Owners Manual is clearly states that, in order to achieve that wide focal length you need to also purchase a DW-5 \"Wide Conversion Lens\" and also a 0-LA135 \"mounting adapter\" -- and the catch (gotcha!) is that neither of these are available for sale in the U.S.A.!  They are only available in the Japan marketplace, so you're stuck with a camera that doesn't perform as advertised.  Very disappointing, and frustrating.", "Date": "September 15, 2013"}, {"Title": "A lot of features and a spot of trouble.", "Author": "Stephen Thoemmes \"All sins are just efforts t...", "ReviewID": "RJFP7EUCJ41QM", "Overall": "3.0", "Content": "After having to wait a month for this camera (I'm an early adopter) I was pretty excited. This camera is small and very easy to keep in your hand. The features are numerous, but as an afterthought, I could have skipped the GPS and purchased the cheaper model. The reasons why I purchased it are: weatherproofness, uses a common battery type, picture quality in a small package, a mistaken idea that my pictures would geo-tagged, and very easy macro shots.  It did most of these things. It does come with a nylon strap with an attached carbiner. It is pretty useless. What it does need is a good wrist strap. I can't imagine anyone using the carbiner to attach the camera to a daypack, your belt, or anywhere that exposes it to bumps and scrapes.I do not want to lose this camera in my travels, in bad weather, or rough conditions. You get this strap and a faux and 'outdoorsy' carbiner and no way to hang on to your camera. What were they thinking?Now the sad news. After spending some time in Ireland I discovered that a lot of my shots were blurry. After a lot of observation I found that the camera was having an issue of internal fogging. The lens was fogging, so was the front and rear LCD displays. It would not happen all of the time but just enough to ruin most of the photos. What pictures that did come out were outstanding. No need for color or exposure correction, just cropping. The macro shot detail was very impressive.The camera was never submerged in water, only to a light rain. So my regrets are that, I should have waited for the product to mature and that I had to pay a lot more than the camera goes for now.I have sent this unit back to the designated Pentax repair center, since it is still very early in its warranty period. Good luck with feedback from Pentax. Luckily I sent it by Priority Mail with delivery confrmation. They received the unit on Sept. 19th and did not send any acknowledgement. It's been over a month and still no communication, still no camera. This is unacceptable. Sure, it is a mid-range product, but it did cost me money. Their profit may have not been much, but they made it, they marketed it, and they came up short.UPDATE: Here it is November 18th and I just received the replacement camera. I started to use it right away. I am still impressed by its color balance, picture detail, ease of use and just plain darn great photos. It still came with the silly nylon strap. But so far so good. The real test is when I go to Antarctica in 3 weeks. Will update then.", "Date": "September 1, 2013"}, {"Title": "Great for what it is", "Author": "Annie Mouse \"Annie\"", "ReviewID": "R31B6JJ4O59H6E", "Overall": "5.0", "Content": "I bought this for one reason, and one reason only, and that was to drag around the swimming pool all summer following three active swimming and diving grandchildren. It performs admirably. I had a WG-1 for two years and really just wanted the extra megapixels for cropping purposes. The WG-1, even after two years of hard use, plenty of dunking, and several thumps against the side of the pool, is still waterproof and going strong. The WG-3 seems equally hardy after half a summer of abuse. The burst mode won't overwhelm you, but if you time your shots, you can get some real winners with ease. I like Pentax colors a lot, and this one compares favorably with the colors I get from my Pentax DSLR.If you don't have any need for a \"ruggedized\" camera, you'd probably want to look elsewhere for better picture quality, but as far as the \"tough\" cameras go, the Pentax line gets my vote. Besides, with plenty of sunshine, a fast lens isn't going to do a whole lot more for you anyway. This camera literally spends two hours a day being dragged the water around on a flotation strap, and I'm not very careful whether it gets dunked, either. The WG-3 seems to have a better waterproof coating on the lens than my WG-1 did, so I get less haze and flaring as a result of water on the lens. It just rolls right off.", "Date": "July 14, 2013"}, {"Title": "Dead on arrival", "Author": "Amazon Customer", "ReviewID": "R2UHR5X8Y39LEN", "Overall": "2.0", "Content": "Christmas day, my son's gift.  We try to charge it, and it would stop blinking, try to turn it on, and it would show \"Pentax\" then beep a couple times, and turn off.  I tested the battery - plenty of amps (I am an electrical engineer, so that was easy to determine.)Pretty much, the device is dead, likely due to firmware issue, or a component is broken (like the sensor), causing the device to not complete its power-on sequence.I got the idea to plug it into the computer.  It can mount its internal memory when plugged in.  So, I know the embedded microprocessor is alive.  It just looks to be defective.  Time to return it to Amazon.Wait... what is this?  There are 5 photos in the internal memory???  Son-of-a-gun.  This is a RETURNED ITEM!!!  Amazon, you sold me a defective return!  Do you test your products before you resell them?The 5 photos are of a pond, in the background I can make out signs of Interstate 71 and Interstate 275, a Sunny Delight building, and a Fireside Grill restaurant.  A little googling, and bingo, Blue Ash, OH. a city north east of Cincinnati. 2000 miles away from here. The dates are 11/15/13.[Note: You should always delete pictures off of cameras you sell, return, or recycle.]I will try to return the item now, and make every attempt to make sure Amazon doesn't resell. (I will put a note in the camera box, like \"Dead Device\" or something.)  :-)", "Date": "December 25, 2013"}, {"Title": "no zoom", "Author": "Erika R. Wesnousky", "ReviewID": "R3GP8DHHBGK1V1", "Overall": "1.0", "Content": "The zoom function failed to work after a dozen photos for no apparent reason. Not much more to say than that....", "Date": "May 31, 2014"}, {"Title": "Case opened, camera flooded on second swim", "Author": "Heidi Doyle", "ReviewID": "R2CD7B03Q77PZH", "Overall": "1.0", "Content": "We bought this camera for a snorkeling trip.  On the second swim (still first day), the camera case opened up without us moving any of the switches on the bottom.  The camera flooded and became inoperable.  Very disappointing!", "Date": "April 17, 2014"}, {"Title": "Good Point and Shoot - Not Waterproof", "Author": "Amazon Customer", "ReviewID": "R3FPUUOUHRTVTQ", "Overall": "3.0", "Content": "Used this camera snorkeling, During the first 1 hour trip took fantastic pictures and video with sound.  The second trip snorkeling was the follow day again worked better than expected.  Third trip took several photos above the water prior to snorkeling turned the camera off and that was the last time it worked.Followed the instructions on proper use and care. In fact I am one of those people who read the whole book prior to using.  So I was very confident that I was not the cause for the failure.If you are looking for a camera that takes great photos including macro's and don't plan to take underwater then I would consider this camera.Returned to Amazon for refund, very glad that I purchased from Amazon.", "Date": "March 21, 2014"}, {"Title": "Excellent camera that has no able competitors", "Author": "Brad Hutchinson", "ReviewID": "RX8JS85JIAOZ8", "Overall": "5.0", "Content": "Excellent camera that has no able competitorsMy main reason for purchasing this camera was to mount it via suction cup onto a vehicle moving at up to 70 mph to take pictures of certain areas that were doomed to become housing communities in the near future.  I wanted pictures of what the area used to look like because 10 years from now it will only be a memory otherwise.  This camera offers a built in intervalometer and GPS, which allowed me to mount it to a car taking a picture every 10 seconds and have GPS coordinates recorded to know exactly where that picture was taken.  There is simply no other point and shoot on the market that allows interval timed pictures down to 10 seconds and records GPS, period.  The WG-3 is essentially a GoPro for photographers.  I own a GoPro Hero 3+black but exclusively use that for video since it sucks on image mode.  GoPro images in the highest quality are extremely wide angle fisheye looking and I hate them, and there is no optical zoom so distant objects are not very clear.  I will not be reviewing the video quality on the WG-3 because I do not use it and do not care about it, that's why I own the GoPro.  I had always viewed at Pentax/Ricoh as cheap cameras but my opinion has completely changed now from owning this camera, here is why.Pros:Image quality - Compared to my Panasonic ZS15 image quality from the WG-3 is very good but things like foliage are clearer when cropping images from the ZS15.  With minor adjustments in the saturation, sharpness, etc I have been able to get close to the same coloration the ZS15 provides in Vivid mode and the WG-3 is perfectly capable of taking good landscape photos.  The Panasonic is still going to be the camera I carry for hiking or other activities because of the superzoom lens but you could use the WG-3 as your only camera if you do not need a longer zoom.Built in interval timer - This is critically important to me and something few professional reviewers of this camera fail to even mention.  Ricoh is the only manufacturer that includes this functionality on their point and shoot cameras with the capability to go as short as 10 seconds between shots.  I plan to use this heavily for time lapse photos of landscapes and since the camera is ruggedized it also allows me to place the camera on top of a moving vehicle without worry about rain or impact destroying it.  Instead of having to pull over and stop the car to take a picture on a scenic drive (think of Red Rock Canyon scenic loop in Las Vegas for instance) I can just set it to take a picture every 20 seconds and concentrate on driving.  Pictures of sunsets on a beach are possible without worry of water splashing destroying it, the possibilities are endless.GPS - Important because I wanted to record exactly where the picture was taken, it is very accurate when viewed on Google Maps or compared to my Delorme GPS.Can purchase a remote - This is important to me because I like the ability to take photos with a remote control.  Other cameras on the market like the Panasonic ZS30 force you to use a smart phone as a remote and do not offer separate remote controls for purchase.  I am one of the few people who refuses to own a smart phone so the fact that I can buy a remote for this camera is excellent.Plethora of shooting modes available - Just about any shooting mode you can think of is built into the camera.  One of my favorites is the digital microscope mode where you can literally lay the camera directly onto what you are photographing with the included macro stand and there are LED lights around the lens that allow close up photographs from 1cm away.Mounts - I have been using an off brand suction cup tripod mount with this camera but Ricoh recently announced that they will be selling GoPro type mounts for the WG camera within the next month.  They are going to offer a handlebar mount, suction cup, and adhesive mounts, although due to the high announced cost I will probably just stay with my off brand.Cons:Really I have just one con.  You cannot adjust the shutter speed on this camera for pictures of moving water or at night.  There is a night mode that works fine but it adjust the shutter speed for you instead of giving control.  The newly released WG-4 model does allow shutter speed control but it does not allow it in the interval shooting mode (which could be used for time lapse images of stars at night).  If the WG-4 offered shutter control in the interval shooting mode I would recommend that camera instead and upgrade.  Since the cost of the WG-3 GPS is currently around $200 while the WG-4 GPS is almost $400 I definitely recommend getting the WG-3 GPS and saving a substantial amount of money.Update - I recently dropped this camera down a dry waterfall by accident and it hit multiple boulders on the way down to a stop 20+ feet below.  The fall destroyed my Panasonic ZS15 which also was dropped but the Pentax did not have a scratch on it.  Ruggedness is excellent!", "Date": "February 27, 2014"}, {"Title": "works well", "Author": "George Barton", "ReviewID": "R1DHLJX8B0012", "Overall": "5.0", "Content": "this camera preforms well and even works under water.  The only down fall was when its hot out with a cool wind the lens fogs up on the inside but that can be fixed by rupping the lens to warm is back up.  Once the lens is warm the fog is clear", "Date": "February 3, 2014"}, {"Title": "I love it", "Author": "taz", "ReviewID": "R4HXF19S0DADP", "Overall": "5.0", "Content": "We went to Windward Islands and went more than 4 h snorkeling. The camera did great under water, but of course the quality of the photos varies. if the photo is taken in a shallow water where the sun light is quite strong, pictures came out pretty impressive for this little camera. Otherwise they are not crystal clear at deeper or darker waters. Outside photos are good, so far the best pocket camera that I have own.", "Date": "January 10, 2014"}, {"Title": "I miss my WG2", "Author": "Nelson Powers", "ReviewID": "R3788NL4RR3KAC", "Overall": "3.0", "Content": "I loved the WG 2 so I went for the 3. It is pretty much the exact same camera, but with some negatives. I did have a water breach the first time I submerged it and now am scared to get it wet... The battery doesn't last half as long as it did in the WG2 and the LCD screen makes some bright photos look washed out (they looked good on a computer). Overall I was happier with the WG2.", "Date": "November 19, 2013"}, {"Title": "Good when it is not leaking.", "Author": "Isil Arican", "ReviewID": "R2Q7MJJJ1UJL88", "Overall": "2.0", "Content": "I got this camera to take underwater pictures on our vacation in Hawaii. I was planning to take it to a manta ray dive but it leaked water on the second day of the vacation  while snorkeling and stopped working completely. The picture quality was great until it stopped working but I was very disappointed have a water leakage problem at the snorkeling depth, while the camera indicates that it is waterproof up to 46 feet. I ended up paying for an underwater photographer for the dive and had to use my cellphone camera for the rest of the trip. It was a real vacation ruiner. I will ask for a replacement and will give this camera a second chance because the picture quality is really great, but water leakage in a waterproof camera is unacceptable.", "Date": "November 10, 2013"}, {"Title": "did not let us down", "Author": "Clarks", "ReviewID": "R2RGM31BA8PO13", "Overall": "5.0", "Content": "i could not decide on which camera to purchase for our family trip to costa rica. all the reviews on all the underwater cameras were worrying me.we wanted something for water, sand and sun, a baby and 2 kids etc etc.settled on this one, and LOVE it.  Hasn't let us down yet, 5 months later and we use this thing a lot. things we were careful of was not taking it too deep in the water, and waiting a few hours after water exposure before opening the charging/card storage area.takes great photos.  My baby is never still, and yet all the photos are clear and colors amazing.", "Date": "October 23, 2013"}, {"Title": "YMMV - For me, it's like a Swiss Army Knife (useful!)", "Author": "Michael A. Fenichel", "ReviewID": "R1R8SEUYWYT75E", "Overall": "5.0", "Content": "I got a bit of flack (among pros and Swiss Army Knife devotees) but I stand behind this even more so after some extreme and diverse use. I compare it to a 20-tool Swiss Army Knife because it is just packed with useful tools, plus it's a near go-anywhere camera which *can* capture some amazing things. I played around with it a bit (in the city, where I needed to find a park to set the GPS, and practiced micro/macro on the spring tulips) and then went off to some extreme adventure, where I would destroy either a DSLR or myself (like in the water, in rough seas on a small boat, on a mule, in awesome spots where another camera batteries were kaput, and this went into play as a backup).So many modes. Auto-everything is fine, or Program which lets you set lighting and focus modes (including the uniquely Pentax \"microscope mode\" which lights up a ring of light to capture a leaf or coin, etc.). I'd been relying on it for an easy-use camera for underwater or on-mule, and finally ran into 3 people with this camera (in the South Pacific), all happy with it. Photographers and camera buffs tend to comment on how it's the only one with the lens dead center, so you can hold it in front of you, as in snorkeling or holding it still with both hands). It's durable. The waterproofing is excellent. I'd just been focused (sic) on underwater, or in pouring water at sea or in a rainforest, or getting panorama views, using the stitch mode or in the panorama focus mode using video (\"infinity\"), to limit lens noise - the sound of zooming, I mean.I met a pro photographer who looked at this with curiosity and zoomed in quickly to the HDR mode, which I hadn't even thought about. Next day I went off to a scenic beach at dusk and gave it a try. Some wow results. (And GPS-tagged, too.) Not every capture is a winner of course, and it's hard to tell in the small-ish monitor at times. But it comes up with some surprises in terms of great videos. I video'd an erupting volcano from the ocean on a wet and hard-rocking boat, and the video is pretty amazing; couldn't have been done and survived by an expensive DSLR or Videocam - though maybe a GoPro would.On the down side, I got lots of 'grainy' shots in moderate or low light, though some good ones too. It's optical zoom range is limited, and it is, or can be a bit 'noisy' when in dim light and/or zoomed in using digital zoom. On the other hand, I got some very nice flower shots, using the flower mode or not, and some great scenics. It has prompts for night and sky shots (even saying it might be better to do with a tripod), underwater video, macro video... I'm still finding new modes and combinations. I saw some nice 'bokeh' in the floral shots, but with such a small lens I'm thinking it's 1/2 optical, 1/2 software which does the focus distribution.So for me, it's a great 'toolbox', not (except in  some extreme cases) the only camera I used, but one which could go places few other cameras can, with some nice modes to play with if that's your thing. I think the HDR is something I'll play with more, though the results were variable. (Partly me, I'm sure.)I had no problems at all, at home or on an extreme photo expedition. I do suggest a floatable wrist band (rather than the caribiner attachment which comes with it) if you envision a lot of in-water use. And spare batteries. I returned home with unused cards (the SD you can pop out and put directly into many computers/devices) but I really went through 2-3 batteries in a 1/2 day sometimes (especially doing videos), so I'd stock up, and get an external charger.I'd say give it a look, don't expect DSLR results, but do expect some interesting tools plus some surprising things you can do creatively. And the occasional *amazing* shot, too. YMMV.", "Date": "August 30, 2013"}, {"Title": "Malfunctioned in under 3 months", "Author": "rfm010", "ReviewID": "RKAOKJR1D8GE1", "Overall": "1.0", "Content": "This was a pretty nice camera until, in just less than 3 months, it wasn't. Suddenly the zoom doesn't work (I see others have had this problem). Suddenly the flash mode button doesn't work and the camera is stuck in the no flash mode. While playing with buttons to see if I could get things working again, and to see what else may not be working, the lcd screen began showing some pixelation noise. Although I haven't been able to reproduce the noise problem it is cause for worry.I haven't treated the camera roughly, hasn't been dropped or banged, it has been used moderately at most, has never been underwater. It has gotten lightly wet once while taking pictures under an umbrella, but I've had non-waterproof cameras exposed to worse without any problems.", "Date": "August 22, 2013"}, {"Title": "Very good camera but has one flaw!", "Author": "James G.", "ReviewID": "R3C68K7DCDABKX", "Overall": "4.0", "Content": "The reason I gave it 4 stars is because the camera didn't come with a battery charger and one must charge the battery in the camera.  However, when I tried to plug in the supplied USB cable it wouldn't plug into the camera fully. I checked on Amazon for an extra battery with a charger and they carried several. I ordered it and rather than send the camera back I'll use it with the external battery charger. That's the way my other cameras (Sony A77 and Nikon Coolpix) batteries are charged. I guess I could have rated it as a 3 star but I really like the quality of the pictures and the ruggedness and waterproof aspects of this camera. I'll probably be retiring the Nikon and give it to one of my grand children.  Overall, a very good camera.", "Date": "August 8, 2013"}, {"Title": "Pentax Camera for active Life", "Author": "Bob Ring", "ReviewID": "R1GTSFBHPW0R6S", "Overall": "5.0", "Content": "Have your kids ever demolished a camera?  Have you ever lost one in the river? (recovered it and watched the water drain out?)  Took your camera out of your pack after hiking a trail and realized you had more pieces than you should have?Well if you are looking for a camera to help solve any of these issues this is the camera.Tested with kids, Tested in the water, Tested in dust.  And passed all tests.Even captured some underwater pictures. Do you know how had it was giving my new camera to the kids to test! But happily is still works  and it takes very good pictures.  Low light. and Sports speed.Won't break the bank.I recommend it.", "Date": "July 17, 2013"}, {"Title": "Purchased to capture memories of my son", "Author": "J. Ruvio \"KayakSurfer\"", "ReviewID": "RKR0VBEIE8SDI", "Overall": "5.0", "Content": "I bought this after a little research for a durable camera to capture images of my newborn son.  Living in HI, my GF and I are outdoor types and we need something durable.  Although this camera doesnt' look too fancy or shiny, it has the durability specs I need.  I can take this to the beach, in the water, on hikes or just around the block and I don't have to worry about getting it wet or dropping it.  I bought this after reading a few recommendations of dpreview.com.", "Date": "July 13, 2013"}, {"Title": "FANTASTIC CAMERA!!!!", "Author": "sonomom", "ReviewID": "R11WGEB1RR2FIV", "Overall": "5.0", "Content": "I just got this camera for my trip to Hawaii. It came in two days (prime member) as promised by Amazon. I had no idea how the pictures and video would come out. It far exceeded my wildest dreams. The video is easy to use; has so many settings on it, that it worked great outside, inside and underwater. I am not that technology gifted, and I could use it easily. It is totally waterproof. Believe me, I had my doubts, and sure enough, it took fantastic underwater pictures. My friends couldn't believe that they were real. I took beautiful pictures of scenery and pictures of my friends and this camera is truly amazing. The zoom is wonderful, and the pictures are clear.I upgraded my memory card to a 32GB and had no problem with taking over 200 pictures and many videos. I also bought the Wasabi battery charger with extra batteries. I would recommend that if you are going on a trip.It is a little heavier than your quick aim and shoot cameras, but then again, it takes amazing pictures and is waterproof. I used the underwater setting, which uses the flash and my pics are perfect. In clear water and bright sunshine, you probably don't need the flash, but it was recommended by our captain on our snorkeling cruise.I bought the Chum float so I wouldn't lose my camera if I accidentally dropped it under the water in the ocean. It supported my camera fine. I also bought a strap to attach it to my float, and had no problem swimming anywhere with the current. I did not use the strap that came with it. Wish it would have had a normal camera strap and case.Pentax had them on back order, and didn't know when they could ship one. Amazon had them in stock for a great price.I LOVE THIS CAMERA AND HIGHLY RECOMMEND IT!", "Date": "May 31, 2013"}, {"Title": "great little camera", "Author": "Ruth B. Felt", "ReviewID": "R36DRMZXGHA8E6", "Overall": "5.0", "Content": "Got this this for cruise. I expect to do a lot of snorkeling. Had great reviews in CNET and other places. Price was right on Amazon. So far it has worked better than  I could hope.", "Date": "May 20, 2013"}, {"Title": "Faulty camera", "Author": "Joha1235", "ReviewID": "R1LERVHDIVJYPD", "Overall": "1.0", "Content": "I thought I was purchasing the best camera out there and it broke 3 days into my vacation ruining it :( would not recommend it", "Date": "October 29, 2013"}, {"Title": "Great functions but disappointed with \"waterproof\"", "Author": "SBottomfield", "ReviewID": "R1G5N7TXTA69GL", "Overall": "3.0", "Content": "The camera has great functions. I owned the WG-1 that was also waterproof.  I purchased the WG-3 in April and used it approximately 3 times prior to our cruise vacation in June.  After doing the \"water\" test on it, which worked out great, we took it snorkeling.  Within one hour of coming out of the water, the lens \"steamed\" but we were still able to view our pictures/videos.  However, within 3 hours, the steam had cleared from the lens but the camera would not turn on. This was the 2nd day of our vacation so needless to say we have no more pictures of our trip after this point!! Sent it back to Pentax Service Department where it will take at least 4 weeks for them to decide whether to repair or replace it.  The WG-1 was also a great functioning camera and we did not have any problems with that one at all(unfortunately it was stolen).  I am hoping the WG-3 comes back fully replaced with no further problems.....keeping my fingers crossed.", "Date": "July 8, 2013"}, {"Title": "Takes great photos until the seals fail, or the display cracks", "Author": "K. Swanson", "ReviewID": "R2YV8N4HSJ3NOQ", "Overall": "1.0", "Content": "I took this camera on a few hikes in the first week I owned it. The photos were beautiful.  The f/2.0 lens is great in low light. Then I took it into a hike that involved swimming and jumping into water.  The camera failed catastrophically.  Filled with water, and the LEDs started blinking spasmodically.  That was it.Thank goodness for Amazon's policies - I returned it for a full refund.  I thought it would be fine to order another - what were the chances that two of them would fail??When I got the second one, I had it in a bag on my car seat.  I braked hard, and the bag rolled onto the passenger side floor.  I had an iPad and some other items in the bag as well.  Everything else was fine, but the read display on this camera - this \"shockproof\" camera - cracked right across.Once again, the camera was returned.  What a ridiculous experience.I've decided to purchase another Olympus Tough camera, which is what my last waterproof was.  It fell into a pool in a creek, and spent 45 days there before being found - in perfect working order.  *That* is a tough camera.  This Pentax?  Not so much.", "Date": "October 3, 2013"}, {"Title": "Poor Picture Quality", "Author": "Farah Ysvette Mourad Vera", "ReviewID": "R1VC606XF5K9S8", "Overall": "1.0", "Content": "Picture quality is terrible: grainy (not good grainy) and flat outside the water, murky and flat inside the water (I was at the Dry Tortugas, and my friend's little Nikon took MUCH clearer pictures, so it wasn't the water), which pretty much made me kick myself for not buying a disposable underwater camera instead. For some reason my zoom in/out buttons did not work at all. Battery dies incredibly fast and this sucker will NOT charge using a solar charger, even if it's fully powered up and left plugged in for 5+ hours. Keep in mind, we used that same charger to charge the other camera and the phones. Useless to take this thing camping. Unfortunately past the return date, so now it's just sitting there in a drawer. If anyone wants it, let me know, but I don't recommend buying this camera.", "Date": "May 31, 2014"}, {"Title": "VERY DISAPPOINTING PRODUCT!!!!", "Author": "thanh", "ReviewID": "R1WLQO2I3KGW8O", "Overall": "1.0", "Content": "This camera HAD RUINED my Europe vacation!!! We received it a few days before we depart, and it went perfectly well in our first 3 days in France. All pictures were taken on the first 3 days really nice. On the 4th day, the screen suddenly turned BLACK even we had charged the battery full on the night before. It’s worst more because it happened right on our tour day at the most amazing chateau. We had used our smartphones to take pictures of ourselves & the sights instead. SO PISSED OF AND DISSAPOINTED. We thought that the battery might be the reason, but now, on a professional hand, the MAINBOARD IS DEAD!!!!Pentax was one of my favorite camera brands for quite long, and we were so excited to use this product for our trip. Unfortunately, this is very disappointed. We thought that this camera is enough to take all the beautiful pictures on our 1 month trip to Europe, but just after 3 day of using, it ruined mostly my vacation. This is our 1st Pentax product, and this will be also the last.", "Date": "May 30, 2014"}, {"Title": "Do not buy this gimmick camera/TOY", "Author": "damo", "ReviewID": "R2PTE291H7EGNB", "Overall": "1.0", "Content": "This brand new camera gets stuck in movie mode 50% of the time. The only way you can stop it is by opening up the battery compartment and ejecting the battery. What a hassle and not what you want if you are snorkeling at the time. It shipped after the due date it was supposed to arrive so I didn't have it for a 1 week training ship excursion when I needed it. When I got back I took it on a pacific cruise where I wanted it for snorkeling. It had this horrible glitch where you have to eject the battery to make it work again. When I called the supplier to have it fixed - \"SORRY YOUR 1 MONTH WARRANTY PERIOD IS UP, TRY PENTAX\". I called the Pentax number and it doesn't work - nice trick.", "Date": "May 7, 2014"}, {"Title": "LCD Screen broke within 3 days of using the product", "Author": "V. Kasyanov", "ReviewID": "ROT1ATQZK9YV1", "Overall": "1.0", "Content": "The camera actually worked well when you could see what you were taking a picture of. Underwater shots came out crisp and clear. However, within 3 days of using the camera, the LCD screen started to shut off on its own, one could tell that the camera still worked, and throughout the time was taking pictures. Really enjoyed the camera in the 3 days of the trip that it worked. However, due to the LCD screen shutting off I was unable to take advantage of most of its features aside from capturing underwater pictures.", "Date": "May 4, 2014"}, {"Title": "Decent camera, but poorly made", "Author": "Erin", "ReviewID": "R2EH4MJ42K2KGZ", "Overall": "1.0", "Content": "Very disappointed with this camera. The camera itself is decent. It takes OK pictures, although there is quite a bit of fogging of the lens. The real problem that I had, however, was the build of the accessories. I trusted the strap and carabiner that are attached to this \"rugged camera.\" After less than a year of light use (maybe 20 picture days) the strap broke. It is not sewed or glued on, so it just came undone and the camera went crashing to the bottom of the river. I contacted Pentax and have gotten no reply. Very unhappy with the customer service and the camera itself. If you are going to sell a rugged camera for this price, they could find a better way to secure the camera.", "Date": "April 25, 2014"}, {"Title": "not waterproof!", "Author": "Jen", "ReviewID": "RVB9IQOS12E62", "Overall": "1.0", "Content": "Good thing I took pictures with OTHER cameras in Costa Rica in addition to this one because one little dip in a waterfall and that was it.  The previous model never failed in YEARS of use!", "Date": "April 19, 2014"}, {"Title": "Great Quality Photos/Video, Poorly Made", "Author": "doxiegirl92", "ReviewID": "R1XOPTF81JGEPM", "Overall": "1.0", "Content": "The pictures this camera managed to take before it leaked were great quality. I was excited to share all the cool things I saw during my trip to Hawaii this spring. The camera was BRAND NEW. I read the manual before using it. Even the part that says if you drop the camera, the waterproof capabilities may be rendedered useless. So even though this is supposed to be a life proof, rugged, waterproof camera I was EXTREMELY careful with it the whole trip. I also noted the maximum depth of 14 feet for the waterproof capability. I was snorkeling, so the camera was a maximum arm length down from the surface, so 2 feet, max, but mostly right up near the surface. (Yes the battery hatch was clean and had both safety locks locked.) So I got some nice s*** while snorkeling but all of a sudden the screen turned black. I thought the battery had just died, but the on button was still lit green. I tried taking pictures while the screen was black but decided to get out of the water, dry off and check the battery compartment. Well, it was wet. The camera had leaked, and it apparently shorted out the screen. So I took out the memory card and battery and the the camera to dry in the hotel room and the next day the camera still showed a black screen when on so I just put it away for the rest of the trip. When I got home I was able to get the photos of the memory card, so glad the water didn't ruin it! However the whole experience has left me giving this camera one start because I can no longer use it, big waste for $200. Very dissappointed.", "Date": "April 13, 2014"}, {"Title": "Did not come with battery", "Author": "Laura", "ReviewID": "R1JRAC2MTXZKK7", "Overall": "2.0", "Content": "Gave this camera as a gift on a trip and did not realize it did not come with a battery.  Unfortunately, we don't know how well it works because we did not have time to get a battery before the trip.  Did I miss something in the description?  On the plus side, camera came quickly.", "Date": "April 6, 2014"}, {"Title": "Very handy little camera", "Author": "Ed", "ReviewID": "R129KJ0LO55A0P", "Overall": "5.0", "Content": "I want a camera to take outdoors in all weather conditions and to geotag each picture while hiking, kayaking and geocaching.  After my cute little Casio GPS camera died from inhaling a few drops of water during it's transition to and from zip-lock bags while I was kayaking, I was looking for a replacement.  The Casio had a nice 10x optical zoom, but alas, that too had proved vulnerable to my clumsiness, requiring a couple of repairs over the years.  So:  I wanted a camera that was waterproof, rugged, easy to use, would take decent pictures, fit in my pocket, and tell me where I was at the time of the shot.  This one seemed to fit the bill despite being purple so I decided to give it a try.  I've had the camera for a couple of months and several thousand photos now and it gets the 5 stars because it does those six things as well as I could hope for.  It fits in my front pants pocket with the lanyard sticking out so I can grab it with gloved hands easily.  The battery generally gets me through the days (you do need a spare one:  they charge in a few hours.)  This first shot of the day takes 10 seconds or so to lock on to the satellites, after that it's 2 seconds or less, and the positions are reasonably accurate.  The LCD view screen works well, which is to say it's a far cry from a decent SLR view finder, but you have some idea of what's in the view frame outdoors.  The camera manual is 230 pages long, so it's not that simple, but lets say there's potential I haven't explored yet and the basic functions are pretty simple to understand and use.  You can charge the battery in the camera, but you won't want to.  Much easier to use a separate charger and swap out batteries.  The internal memory has enough capacity to be useful on those days you forget to stick a memory card in (again, easier to have a spare).  My routine after a day's shooting is to pull out the card and the battery, put the spare ones in, close the camera back up and its set to go again in 10 seconds.  This is a great little camera for my uses.", "Date": "April 1, 2014"}, {"Title": "Great Camera", "Author": "Richard Dixon", "ReviewID": "R1YQNI8TY65U38", "Overall": "5.0", "Content": "I had seen several people use this camera for investigative work because of the macro capability of this camera.  I have had great success with this function already.  The camera also works very well with everyday uses.  The only downside I have found is that sometimes it takes a couple of seconds to process an image and causes a pause before the next shot.  I would recommend this camera to anyone who needs a nice macro option.", "Date": "March 3, 2014"}, {"Title": "Great little camera packs a punch!", "Author": "Jimmy the Geek", "ReviewID": "R3PMA6P6LMETL8", "Overall": "5.0", "Content": "Takes great pictures, especially close ups.  Ruggedly built, but I wish it had a lens cover just the same.The only nit I have is the annoyance of dealing with yet another special USB connector, requiring you to carry yet another cable in your bag!  They could have used one of the standard micro-USB connectors for the same size.  Oh well, if that's the worst you can say about an item, that's still pretty good.", "Date": "February 28, 2014"}, {"Title": "Great Knock Around", "Author": "Amazon Customer", "ReviewID": "RVH6IZEXDZK2Y", "Overall": "4.0", "Content": "I have multiple cameras, some I don't want to use on a boat, in the rain or in the cold.  I'm also hard on small objects and when working quickly I can have dropsy.  So I wanted to have something durable.  Although if you use the optional AC connection or the computer interface cable, the cord hanging out is a bit awkward and I'm concerned about damaging the floppy battery door that has to stay open during AC and computer use.  I've use it for classroom use as a video camera for student projects.  I would prefer to have an external mic jack (the only strong selling point for me for the Hero), but the sound quality has been acceptable and the quality of the video is as good as one might expect for a multi-use camera.  I read several reviews that compared this to other waterproof and durable cameras (Sony, Olympus, Hero) and this once compared well at all levels.  Primarily I chose this because of its low f stop, its 16 MPGs, its durability, its picture quality for point and shoot, its competitive price, and its size. There is little optical zoom, but I did not necessarily want much and suspect that it would compromise the weatherproof nature of camera if there was much of an optical zoom.  I use other cameras for more serious picture taking but I like having this one around.", "Date": "February 15, 2014"}, {"Title": "More than what I expected.", "Author": "D. Berry \"bullet6055\"", "ReviewID": "R1PBFD1WHM138X", "Overall": "4.0", "Content": "I bought this camera because I lost my old pocket camera and this one was on sale. It comes with more features than I expected which is nice. It takes a nice crisp photo but you do need to read the book, it's not just a point and shoot camera. This is a good upgrade for someone who wants to move up from the simple camera  but not want to invest in a DSLR. The only drawback is that the internal memory is limited to 30 photos or a short video so if you want to take more you will have to buy a flash card, not included.", "Date": "February 15, 2014"}, {"Title": "Waterproof, but doesn't take good underwater photos.", "Author": "Grace", "ReviewID": "R2WQPDO5HJBD49", "Overall": "2.0", "Content": "Pro: This camera is rugged and can handle a beating.  It has also maintained a good waterproof casing.  This has been fun to have at a waterpark and while swimming just because I don't have to worry about it getting damaged.Con:  I have a friend who bought a waterproof, point-and-shoot camera for $100 less that takes way clearer, more vibrant underwater photos than this one.  I live in a fabulous snorkeling area and most of the pictures I take with this camera come out blurry.  I regret paying so much for this camera and would not choose this model again.", "Date": "February 11, 2014"}, {"Title": "My favorite digital camera.", "Author": "David S.", "ReviewID": "R166J5HH8ITLSK", "Overall": "5.0", "Content": "My wife and I hike and backpack and enjoy kayaking, and so we need a waterproof camera.  In 20 years, we've used and abused three different brands of watetproof camera.  This is our fourth.  We came back to Pentax Optio because we had owned one before and it gave us the most reliable performance.  It never broke down - we lost it.  The others we bought each eventually failed.  We found Pentax Optio to be reliable.  Only downside is the proprietary batteries, but we've learned to live with them.", "Date": "February 11, 2014"}, {"Title": "Great underwater shots, not so good in bright sun light", "Author": "Jagerfoods", "ReviewID": "RZG2GTMMXDLNQ", "Overall": "4.0", "Content": "My wife received this camera for her birthday and she really likes the color and simplicity of it. It has a rugged shell and the buttons are laid out similar to the Cannon camera we already owned.This camera is very easy to use, right out of the box. The set up is very easy with the step by step instructions. The carabiner attachment that's included works well for attaching the camera on your backpack or pant loops. I was hesitant to use it because I was afraid it would scratch the glass view finder or the lens. For underwater photography you should invest in a floating wrist holder.We went on a sailing trip shortly after I purchased the camera and were able to field test the Pentax Optio WG-3 in the Caribbean waters of Belize. In bright sunshine it can be difficult to see what you're looking at on the glass viewer. At one point we noticed a small cloudy spot on the glass and we thought moisture got inside, but the spot went away within a few minutes. We figured the camera must have been set out in the sun too long.My wife and I were able to take fantastic underwater pictures right from the start. We photographed color reef and moving fish with ease. We also took several video, on the boat as well as underwater and they came out looking awesome.The software that comes with the camera is user friendly and allows you to manipulate your photos with different themes. You can also crop, re-size and do a number of other things with it, like add text, etc. The video editor is very simple and could be a bit more involved.This is our first underwater camera and we are very happy with it so far.You can see the photos we took on our blog at [...]", "Date": "February 8, 2014"}, {"Title": "Very unique and agile camera", "Author": "Gregory L.", "ReviewID": "R3TJB45GLBA7QQ", "Overall": "5.0", "Content": "I bought it for its Macro capability, which is excellent.  However, this rugged little camera is good for all ranges.  It's underwater and damage proof case makes it an excellent choice for forensic engineering work.", "Date": "January 12, 2014"}, {"Title": "Meeting expectations so far", "Author": "Terry Jensen", "ReviewID": "R3MPU1AC0JRVD1", "Overall": "5.0", "Content": "We previously had an Optio W90 that worked real well for several years.  We've found the WG-3 to be superior to the W90 and have been pleased with our photos so far.  There are some features that we haven't tested yet, but are anxious to try.", "Date": "January 3, 2014"}, {"Title": "Like but don't love", "Author": "bwanc", "ReviewID": "R2M3MFVBYFIFQ1", "Overall": "4.0", "Content": "This camera is pretty cool, but luckily it's only a backup camera.  I'm a casual user, not a camera guru, so take my opinion as you wish...PROS: EXCELLENT MACRO ability.  I was playing with this feature and was amazed.  Very user friendly.  This camera has a very intuitive function menu.  It has little icons with a brief explanation for each feature, making it easy to pick the right one.  Of course the waterproof feature is a big plus, hoping the previous reviews of leaks doesn't come true for me.  But this leads me into the CONS:  The only way to charge the camera is to open the waterproof compartment that houses the memory card and plug in the PROVIDED USB cable.  So the camera has to sit, open, while the camera charges.  The waterproofing design of the lid does not look substantial so great care must be taken when working in this area of the camera.  You also have to make sure it is spotlessly clean before closing it to prevent water seepage.  I mentioned \"provided\" USB cable.  I tried using some wall plug-ins for USB that I already had laying around the house.  They did not work for this camera.  I finally used the wall charger provided and the camera charged.  Now, not sure if the USB cable will charge the camera if plugged into the car USB port (as an example).  Lastly, the lens crystal/cover is pretty open to the elements.  It's a little concerning that it could be easliy scratched.  But no evidence of such so far.  The last comment is that this camera has a little bit of zoom, but nothing to brag about.  I bought it with a no-zoom thought in mind.  Anyway, it appears to be a fun and usable camera.  I hope it lives up to its advertised standards.", "Date": "January 2, 2014"}, {"Title": "Perfect fun family camera", "Author": "Caitiemama", "ReviewID": "R1KE7EA5JJNCZ1", "Overall": "5.0", "Content": "We were shopping for a point and shoot when my husband discovered this little beast. It is amazing and fun. We've had it under water a few times already and our 5 year old daughter loves that she can take pictures with it too. We chose it for this reason, she seems to be a budding photographer and we wanted her to be able to explore that with a higher quality camera that was basically indestructible. We have a Nikon dslr for grown ups only but we use this one a lot. It's perfect to keep in your purse, diaper bag or you can clip it to your belt loop.", "Date": "December 21, 2013"}, {"Title": "all around great all weather camera", "Author": "brdinclt", "ReviewID": "RGT8F7CTZ1EX", "Overall": "5.0", "Content": "fast lense of high quality, intuitive controls, gps, macro rocks!  sturdy design.  front readout a plus. great view screen.  colors cool but subdued.  first images sharp.  13x19 images made on canon Pixma Pro 9500 are great.", "Date": "December 11, 2013"}, {"Title": "most durable camera I have ever owned,", "Author": "Nick", "ReviewID": "R135Z9UDG5AA09", "Overall": "5.0", "Content": "most durable camera I have ever owned, my three year old son takes this thing everywhere, only downside is the batter charging must be done via a cable, I prefer a battery dock, have had various HP cameras that survived a while but did not hold up to ocean water, so far holds up to combat operations, three year old operations, and the ocean.  protect the screen as I have seen it get cracked on two of my colleagues cameras.", "Date": "December 8, 2013"}, {"Title": "Great camera with lots of features", "Author": "Paul", "ReviewID": "R2ORLKQN6IVE9Q", "Overall": "5.0", "Content": "This was brought as a replacement for a canon d20.  The cannon stop working after 14 months and Canon wanted $200 plus to review it.  For that kind of money I could buy the Pentax which so far appears to be a better camera.  It has more options, as good picture quality, better video, making it a much better buy than canon.  The camera I purchased does not have the GPS option, because i never used it on other cameras, so why spend the money.  The camera is use by grand kids, tested in their play, swimming and caving, dropped and covered with mud and keeps on working.  I did buy the Wasabi battery pack, (grand kids use up batteries). Having taken over 800 picture and several video I am currently very pleased with this camera, but ask me in 14 months.", "Date": "November 22, 2013"}, {"Title": "Great for a rugged camera. Awesome lens", "Author": "Hawaiian Outdoors Lover", "ReviewID": "R2YA7KPOF9L8KV", "Overall": "4.0", "Content": "I got this camera for one main pourpose: snorkelling. I live in Hawaii and I see Turtles and fish every time I go snorkelling. My ols Olympus tough camera was not so good under water. It's metal body was great, but scratched easily, showed dings easily, and started to rust (even though I clean it every time I take it in the ocean).So I looked at this camera. The physical design is amazing. Tough but grippy to hold. The lens lets in so much light and takes great underwater photos. The screen is big and easily used. I have two issues with this camera:1 - The menu system feels clunky and below par for a camera like this. Pixel-y icons and slightly difficult to use. I had to read the manual to use this properly. It does work well, I was just hoping for a better interface.2 - the memory card and battery cover could use a better locking mechanism. It does not leak, it works well, but to open it all you do is pull one tab down and another tab across and it opens. I would like something a little more secure.Overall: this camera inspires confidence that it can take massive amounts of abuse, and still work great. And why bother with the GPS version.", "Date": "October 16, 2013"}, {"Title": "Great waterproof camera option!", "Author": "Dana", "ReviewID": "R1GEJZCD620EV8", "Overall": "5.0", "Content": "Camera is wonderful and takes amazing photos, even in the water. Tons of photography modes to choose from and one of our favorites modes is the time lapse video! So much fun!", "Date": "September 30, 2013"}, {"Title": "Best tough camera I've ever had", "Author": "Jackie", "ReviewID": "R20NCTJY9U7D6S", "Overall": "5.0", "Content": "I'm a fisheries biologist, and a naturalist so I use and abuse my cameras. I've had Fuji, Canon, and Nikon tough cameras and the pentax is by far the best. Most tough cameras trade the picture quality for durability. This camera doesn't, and in my opinion the Pentax Optio WG-3 takes better macro pictures than my Canon Eos because of the ease of use and quality. I haven't used the camera in water yet, but I hope to take underwater pictures and video of fish swimming. I also use the camera when I am working in the water. I haven't dropped it in the water yet, but it feels and looks like it will hold up. The only complaint I have is that the GPS isn't completely accurate. It will work fine for personal use, but if you need accurate GPS coordinates use a GPS unit with WAAS. The GPS also takes up a lot of battery, so if you have a GPS on you maybe just use the GPS instead of you camera.All in all I love this camera, and hope to use it until it falls apart :) Five stars!!!!!", "Date": "September 18, 2013"}, {"Title": "Amazing Photos", "Author": "Mike Castellow", "ReviewID": "R3CFRR024Z85UG", "Overall": "5.0", "Content": "I routinely take photos for my job that require both a macro type view and in dark confined spaces and this is the best camera that I have used for my job. No regrets on my purchase at all.", "Date": "September 1, 2013"}, {"Title": "Rugged and takes great photos", "Author": "Jay Putnam \"Jay P.\"", "ReviewID": "RKL2NAQHJVR1N", "Overall": "5.0", "Content": "We have only used this camera for about a week. It takes excellent photos and is just what we were looking for after using other $200 cameras with extending lenses could not take the abuse we dish out. We use them on construction sites with lots of dirt, mud, wet, dropped and what ever. This camera looks like it will stand up. Only time will tell, but it is very well constructed.", "Date": "August 5, 2013"}, {"Title": "great features but ...", "Author": "Jerry Isdale", "ReviewID": "R3IZUQDKY2W6JB", "Overall": "2.0", "Content": "I really like the features and the pictures from this camera,,, however after a couple months of use, the LCD suddenly went dark gray - not dead black, gray where you could sorta see shadows of what was trying to be shown. I returned it to Pentax service and a few weeks later it (or one like it) returned.  Now some of the buttons on the back seem to have stopped working... first the zoom and now the flash.  Guess I'll have to return it *again*... living in Hawaii means it will cost $40+ just for shipping.Not at all what I expect from an \"adventure proof\" camera", "Date": "July 24, 2013"}, {"Title": "WG-3", "Author": "RLJR", "ReviewID": "R7JHT4ZB1FFKN", "Overall": "4.0", "Content": "Love it! Took some great shots on the lake and under the lake as well. I even captured the sounds under the water! I get a true sense for the actual colors. The camera is a little slow to process the pix after taken. The zoom is great. The only down about the camera? The view screen is easily scratched and no eye site to peer through!", "Date": "July 2, 2013"}, {"Title": "It takes a nice photo, but its fragile...", "Author": "David Grimm", "ReviewID": "RXEZLG3NID3JN", "Overall": "3.0", "Content": "I was impressed with the photos this camera managed to capture the first few months of its life.  However, it was in a camera bag and the bag fell off my parked motorcycle seat (32 inches) and the fall managed to break the screen.  Not very rugged for a camera that claims to be \"Adventure Proof.\"  Looking on the Pentax web site for an email to get a service quote proved to be a waste of time.So while the picture quality was nice (not great, but still good) the claims of shockproof from falls up to 6 1/2 feet are not accurate.  Given this, I wouldn't be in a great hurry to test the limits of its other claims (waterproof to 45 ft, freeze proof to 10ºc, and crushproof).So I'd look and other cameras if you need an \"Adventure Proof\" camera to take with you on your next adventure.", "Date": "November 1, 2013"}, {"Title": "save you money - don't buy it, it's a defective design, not waterproof as stated", "Author": "PP", "ReviewID": "R2L1YHAJ4W9ST5", "Overall": "1.0", "Content": "In fact this ought to be my first review on Amazon but I really couldn't bear with my fury - I bought this for vacation in Bali. With 20 min seawalker and another 20 min diving both only 15ft deep (the product brags 45ft waterproof) yesterday, it's finished - water leaked in very easily, like some of the other reviews mentioned. I'm sure I absolutely didn't operate anything wrong as I'm a IT/tech-oriented guy. Save your money, don't buy this crap, it's designed with natural flaw - just does everything but serious waterproof. Now I'm going to try to file a claim and have to buy another waterproof cam for next tours.", "Date": "August 26, 2013"}, {"Title": "doesn't work", "Author": "JK", "ReviewID": "R3H29RW4ISLW2P", "Overall": "1.0", "Content": "I should have \"listened\" to the \"bad reviews\", we bought this for my son's trip and it worked fine the first day and then refused to turn on, three beeps and nothing, even after fully charging it.  Pentax, you have a problem !", "Date": "January 25, 2014"}, {"Title": "Nice little tool and camera from Pentax!", "Author": "TOPRAKBASTI", "ReviewID": "R1AC7AMSPEHC0U", "Overall": "4.0", "Content": "This is a great water-proof camera that you can let kids (i.e. teens) to use without any worry. We got this unit before our trip to Punta Cana (Dominican Republic) and the camera performed brilliantly, allowing kids to enjoy underwater (both pool and ocean) shots and videos. I like Pentax as a brand (I am a happy owner of a Pentax K-x DSLR), so my affinity with the brand might have played a role preferring this over other similar cameras but so far I am very happy with my purchase and this equipment also passed the durability/performance test in my kids' hands. What is more, it is a nice photography tool that supports features like Microscopy Mode (i.e. super Macro) which you place the camera on top of the subject (there is a special lens holder provided in the box for this mode) and take extreme close-ups of objects of interest, slow-motion video, panoramic stills, etc.. If you or your young kids are into such experimental photography, this is a great equipment to have.I have been happy with image and video quality. I will not go into the details of how nice, crisp, accurate, etc.. picture quality is, simply it provides enough image quality to satisfy most users out there.One issue I observed with this unit was during the re-charge of the battery. Re-charging of the provided re-chargeable battery is done with the provided USB-cable and the power adaptor. When I first plugged in the USB cable, the green light on the ON/OFF switch did NOT start blinking (to indicate successful re-charging process). I was afraid that there was sth wrong with the camera or battery but after shuffling the cable, unplugging and plugging back it in, the green light started to blink as expected and the battery charged as expected. Similar thing happened in subsequent battery chargings but it is always resolved like above, so it looks like loose connection somewhere on the path which is easily fixable.In summary, if you need a relatively cheap and tough camera (i.e. water-proof, shock-proof, etc..) this unit is certainly worth considering and recommended.", "Date": "January 21, 2014"}, {"Title": "Not working camera", "Author": "SERGIO NEUSPILLER", "ReviewID": "R5DCNNCX9L2HA", "Overall": "1.0", "Content": "I bought it for a trip to Galapagos.Once start using it I found the camera was not working fine. Pentax has almost no support at LATAM.I had to return it to Arizona an lost my chance to use it on the trip.", "Date": "January 14, 2014"}, {"Title": "Pentax WG-3", "Author": "David John Sawley", "ReviewID": "R11Z0NZPAHAPAN", "Overall": "5.0", "Content": "Great camera, loaded with features and performance. I took it snorkelling the day I got it - didn't test the max.45ft depth, but no problem at 15ft. Excellent photos and videos under water.Just getting into the editing features.no problems to report..", "Date": "January 12, 2014"}, {"Title": "Made it through one day at the beach.", "Author": "Tralfaz", "ReviewID": "R2NFWK10MUZYYQ", "Overall": "2.0", "Content": "I may have just gotten a lemon, but after one day at the beach and about an hour of snorkeling, and a good 10 hour wait for it to dry off before opening the case to get to the SD card, the LCD screen failed, rendering the camera pretty much useless. I know that asking for a camera that can be submerged is a big task, but it says right there \"WATERPROOF,\" though it clearly is not.", "Date": "June 6, 2014"}, {"Title": "camera great, manual sucks", "Author": "MARK", "ReviewID": "R16KROEB43FO85", "Overall": "4.0", "Content": "Camera great, attachments seem in order.  Manual and other written materials are in the Japanese language, no help any time all. No SD memory card included.", "Date": "June 4, 2014"}, {"Title": "Great product, delivered on time.", "Author": "Michael Merrifield", "ReviewID": "R3L27D5JI84TW5", "Overall": "5.0", "Content": "Great product and delivered when promised, very nice camera. Would recommend it to my friends and family. Can't wait to try the underwater video.", "Date": "May 30, 2014"}, {"Title": "Pentax WaterProof Camera", "Author": "Amazon Customer", "ReviewID": "R2A2ALF16YONNI", "Overall": "5.0", "Content": "Took camera on vacation where I used it 20 ft underwater and it was outstanding. Took fantastic pictures. Only wish I had purchased the strap. I bought the orange colored one and I had no trouble seeing it and keeping track of it. The view finder with the focus bar was way cool - I could align my photo perfectly. I even had strangers use it to take photos of my husband and me - and they were impressed by how easy it was to focus. Great photos, great memories!", "Date": "May 29, 2014"}, {"Title": "Better than expected!", "Author": "Amazon Customer", "ReviewID": "R3ODTCNYIEM6IP", "Overall": "5.0", "Content": "Great pictures at Niagra Falls. Took pictures from the Maid of tho Mist and behind the falls. Water -no problem. Video mode - super results.", "Date": "May 29, 2014"}, {"Title": "Love it", "Author": "VA Buyer", "ReviewID": "R3EBHTZFNMQN1G", "Overall": "5.0", "Content": "Does everything I need with high quality! Pictures and video come out great. Still getting use to all the features, but really happy.", "Date": "May 28, 2014"}, {"Title": "Awesome Camera!", "Author": "M. Jackson", "ReviewID": "R12WNGY8GDQENY", "Overall": "5.0", "Content": "I just love this camera.  My favorite features so far are the single button video recording, waterproof, and easy playback.", "Date": "May 26, 2014"}, {"Title": "thrilled", "Author": "roy", "ReviewID": "R245JO2NVOMUTM", "Overall": "5.0", "Content": "Great camera.  Small, light, just the right amount of texture to maintain a good grip.  That coupled with being 15 metre waterproof", "Date": "May 17, 2014"}, {"Title": "extremely compact and does the job well.", "Author": "marissa klein", "ReviewID": "R1GFACYTJGLQFN", "Overall": "5.0", "Content": "i usually use a nikon dslr but i bought this because i needed a rugged compact camera that i can take underwater pictures with. this camera does well in low light, and has nice high contrast in sufficient light with bright, vivid color. the macro is very useful and the lights give it a little extra boost that you may need if you're super close to the subject.here's a picture i took at 8 pm. it was much darker out than it appears here.[...]and here's a digital microscope picture i took[...]", "Date": "May 13, 2014"}, {"Title": "Great camera", "Author": "Lisl P \"Lisl P\"", "ReviewID": "R2H3FWLQ0LI4TK", "Overall": "5.0", "Content": "I am very pleased with this camera. It takes great underwater photos and seems more durable than my last waterproof camera. I need a camera that I can throw in my beach bag/back pack and not worry about and this certainly fits the bill--while still taking great photos! I have now talked my friend into purchasing the same one.", "Date": "May 12, 2014"}, {"Title": "Got two of them", "Author": "Pablo Montes", "ReviewID": "R3PAO9BKUKB191", "Overall": "4.0", "Content": "I love them, they got four stars because the batery self discharges in two or three days, but all the options make it the perfect camera for the outdoors type.", "Date": "May 12, 2014"}, {"Title": "outstanding", "Author": "Blackburnian \"books, books and more books\"", "ReviewID": "R2HIXJQY817KX0", "Overall": "5.0", "Content": "I've owned many cameras, and my latest have all been Canon dslrs- but this little gem is an impressive alternative when I don't want to carry about my heavy equipment. Nice clear photos and easy to understand settings. Happy with this purchase.", "Date": "May 4, 2014"}, {"Title": "Easy to use, many features, flawless construction", "Author": "R. Burnette", "ReviewID": "R3ED3OGI2VZE6C", "Overall": "5.0", "Content": "I looked at all of the top-rated rugged cameras from Consumer Reports but none seemed right.  I've been a Pentax fan for years (before Ricoh bought it) and bought this on that basis.  I've not tried it underwater but in all other circumstances it has been great. The recharger is a bit fussy and takes a couple of hours to complete the cycle--but no big deal.", "Date": "May 4, 2014"}, {"Title": "Not really waterproof", "Author": "Dorcha Boisen", "ReviewID": "R3J6ZKBPU8YTX8", "Overall": "2.0", "Content": "I bought this camera to take on a 16 day Grand Canyon River trip.  It worked great for the first few days but after it got wet a few times most of the buttons stopped working.  I was able to continue taking pictures but could not zoom, change settings, or view pictures taken.  When I got home I promptly contacted the seller, DavisMAX, but they said I had to contact Pentax directly even though the camera is only 4 months old.  Now I'm in the process of that and I'm wishing I had gone with a different camera/seller.", "Date": "April 28, 2014"}, {"Title": "Best point and shoot camera for whitewater boating!!!", "Author": "Jeremy Bailey", "ReviewID": "RFVX5Y0U46HDP", "Overall": "5.0", "Content": "I bought this camera for a trip down the Grand Canyon. I was guiding an 18' oar boat and kayaking for the 21 day trip. I kept the camera caribinered to my PFD the entire time I was on the trip. It was fully submerged over and over again and even (accidentally) spent a night fully submerged. The picture quality was great and it even did really well on a tripod taking night shots (with a 2 second timer to reduce shake). The battery life is fairly decent with the exception of taking videos as they use it up much faster. I took off the canyon and let a buddy borrow it for his trip the next week. He just got back and he's going to buy one after having used it on the canyon as well. It was great to be able to kayak a rapid, catch an eddy, and pull the camera out to shoot everyone else going through the rapids. I didn't have to get out of my boat or even undue my sprayskirt. I would HIGHLY recommend this camera. Boom!", "Date": "April 22, 2014"}, {"Title": "Suits my purpose", "Author": "Jose Almonte", "ReviewID": "R3N173K9DHO8RI", "Overall": "4.0", "Content": "I was looking for a good water proof camera to take pictures while kayaking on the Hudson River. The WG-3 will be just fine for the job.The negatives are that when using the extreme telephoto, the image is not too sharp. The other negative is the whirring sound it makes when using the telephoto in video mode.I have not used it for under water pictures or video yet, but that is not my main use. The previous camera got wet in salt water and fizzed out.I would recommend this camera for general water use. For the price it is good.  Also, I would use water proof bag for under water use just in case.This camera is fairly well shaped, fits in the hand and fits easily in a shirt pocket or jeans pockets, but would not recommend unless you can protect the lens and screen.", "Date": "April 22, 2014"}, {"Title": "Good Photos but too much glare", "Author": "Amazon Customer", "ReviewID": "R3I0K94XOZ5YAR", "Overall": "3.0", "Content": "I love the camera.  Our last underwater camera didn't make it all the way through one dive trip when it started leaking.  This is a great idea with the charging pad and the wi-fi download, we won't ever have to open the battery chamber again.My only complaint is that I had a hard time with the glare when I was on top of the water or close to the surface.  Good value.", "Date": "April 20, 2014"}, {"Title": "Great Cam!", "Author": "Jonathan Caller", "ReviewID": "R3B9HG9GIHIN03", "Overall": "5.0", "Content": "All with that you can Dream!Best Quality Underwater photo!Easy use.  The body is a hard plastic that almost feels like a rubber texture.", "Date": "April 20, 2014"}, {"Title": "Best bang for the buck!", "Author": "James Robinson", "ReviewID": "RKQYGC6ZXBBZ", "Overall": "5.0", "Content": "This is my second Pentax camera. My other one is a DSLR K10, which I love, but is not so great for everyday spontaneous snapshots.That is why I was looking for a high quality knockabout camera.I am very glad I decided to purchase the WG-3 for the following reasons:First off, the menu is simple, especially if you are familiar with Pentax. Once it's set-you're done.The presets are surprisingly good for a point-and-shoot; and there is one for virtual any situation.The videos are high quality for camera-remember this is not video camera.I have used it hiking and shot hand-held in very low light in the forest, and the results were surprisingly sharp.It also compensates for the strange lighting found in indoor arenas without distorting the skin tones or causing excessive graininess.I'm going to the beach next week, and since some of the reviewers complained of water intrusion, I tested my camera under the sink with no water intrusion (I agree with some of the reviewer that said the problem was operator error, not camera problem). Can't wait to use it at the beach, and will post follow up review of on and under water performance.Overall, this is a great camera, and I give it my wholehearted endorsement.", "Date": "April 18, 2014"}, {"Title": "specs good for the $", "Author": "Michael Keller", "ReviewID": "R3S3F8JJJOV59C", "Overall": "5.0", "Content": "specs good for the $, up to 46 feet for a minor camera.its on its first UW jaunt now.  hope it works well.", "Date": "April 16, 2014"}, {"Title": "Simple and effective", "Author": "tbone4379", "ReviewID": "R1YU4OAA0Z7E05", "Overall": "5.0", "Content": "It takes very good pictures and it stands up to its promises of crush proof, water proof, dust proof. The pictures aren't as good as you'll get from a DSLR, but they were good enough for me. The video is also very good. The shake proof is awesome for pictures when I was moving or for low light scenarios. Also the picture stitching and panorama modes allow you to take wide-angle style pictures - obviously not as good as a real wide-angle lens but it gets the job done.", "Date": "April 14, 2014"}, {"Title": "What a terrific little camera", "Author": "Kitty Lagorio", "ReviewID": "R1LLTUIWJPOOT8", "Overall": "5.0", "Content": "Took this to Maui, and I'm delighted with the results. Used it while snorkeling, the underwater pictures and videos turned out super. Then, when it was raining on and off in the mountains used it to take outside pictures and the quality was fabulous. It's very easy to use. I still haven't figured out all of the features, but I will. It's easy to change from picture taking to video. The big clip it came with kept it attached to my bathing suit. All in all, a fine camera and I believe it's going to get a lot of use.", "Date": "April 7, 2014"}, {"Title": "Works good so far", "Author": "Jeffrey L. Church", "ReviewID": "RATLR0ZDYC0UC", "Overall": "4.0", "Content": "I have not had time to use all of the features and options, but the picture quality is good and it is durable.", "Date": "April 7, 2014"}, {"Title": "great camera", "Author": "steve", "ReviewID": "R2448VS5613IE9", "Overall": "5.0", "Content": "This is an amazing camera! I love the Microscope feature. it is just what I needed for work and very well priced", "Date": "April 3, 2014"}, {"Title": "Great camera for adventures trips.", "Author": "2MZamora", "ReviewID": "R1SRDI4WUWP8YD", "Overall": "4.0", "Content": "Great camera!!! For travelling and water trip is recommended for nice pics..you cab use underwater It so fun and cool", "Date": "March 30, 2014"}, {"Title": "Great camera! Only one little con.", "Author": "Nang L", "ReviewID": "RZEFXCRWHJ1B0", "Overall": "5.0", "Content": "I love this camera! The pictures are great in quality. Night pictures are pretty good. Burst mode is pretty quick, but could be a little faster. You still have to try to predict what going to happen to time it right to capture fast action photos. The camera is pretty tough. I've dropped it a couple times. It keeps water out pretty well. I've gotten it wet many times snowboarding, surfing, swimming, and kayaking. It doesn't fog up.  I've yet to take it snorkeling, but I'm sure it will hold up.The only thing that bothers me is that it doesn't remember your shutter speed settings. Overall, its a great camera that I would recommend to all my friends!", "Date": "March 30, 2014"}, {"Title": "Awesome quality!", "Author": "Richard S. Blake III", "ReviewID": "R2IJSBZM491N2", "Overall": "5.0", "Content": "I am still amazed by the close-ups!  And I've tested it out while running, and even while moving the photos come out great!  Bought it for running/hiking, as you never know what kind of weather you will get.  So far I am overly impressed.  Ergonomically this camera is great... fits in my hand while I run.  A great camera to take places that I don't feel like bringing in my large SLR.", "Date": "March 22, 2014"}, {"Title": "3rd in My series - love these cameras.", "Author": "firewallbill \"firewallbill\"", "ReviewID": "R1C1DM7VTCYK1D", "Overall": "5.0", "Content": "Great camera - the perfect \"throw it in the bag\" or \"stuff it in a pocket\" camera.Pros -Yes, waterproof.  We have used them on vacation taking pictures of manatees, in pools, surf, etc. Truly waterproof.The optical improvements in the WG-3 make low light performance and color much better.Decent flash.Much faster to focus than previous generation.Take very good video as well.Simple, easy to understand menus for selecting shooting options.Decent zoom and wide angle modesGood macro ability - surprisingly good.Nice display on back - easy to see in broad daylight.Cons -Video is \"noisy\" - if you zoom you get a very distracting buzzing as the lens is moved by the cam motor.  Very annoying.Still not the fastest focus.Weird internal cable attachments - of course you have to open the bottom door to get to the battery, memory chip, etc.  There is a micro HDMI and charging socket.  Instead of using standard micro USB it has a weird connector - so don't lose it!  Frankly I found it more convenient to get an external battery charger with an extra battery, and just pull the memory chip and pop it into my computer.  Cable issue(s) avoided.Relatively short battery life.  Carry spares.So if you want a backpack, swimming, beach casual camera - this is it!  Wife and kids love theirs.  It's really kid proof, too.", "Date": "March 22, 2014"}, {"Title": "Worthless for underwater", "Author": "Ledfutt \"Ledfutt\"", "ReviewID": "R3R9ESMWLFHJFZ", "Overall": "3.0", "Content": "I bought this camera mainly for use while snorkeling. I used it quite a bit taking regular photos and it took nice pictures, certainly not good enough to warrant the price in my opinion, but decent pics. When I used it underwater as soon as it was immersed the LCD screen fogged over and stayed that way the whole time I was snorkeling. I attempted to use it a few times that day, trying different things, making sure the camera was not hot when I put it in the water, keeping it at water level, nothing worked. The screen was fogged the whole time rendering the camera useless because you can't see what you are shooting. I returned the camera and got my money back. I have an old Canon with an underwater case, while it doesn't take as clear a photo on land, at least I can see what I'm shooting underwater. If you are using this only for land pics, it's a nice camera, underwater, not so much. Terribly disappointed.", "Date": "March 20, 2014"}, {"Title": "Great underwater camers.", "Author": "Christine Meyers", "ReviewID": "R3NTJ63PX1YXB3", "Overall": "5.0", "Content": "Great Seller and fast shipping.  Love this camera.  Very easy to use.  Designed well for holding under water.  Clear photos and videos.  Underwater video function very cool.  Excellent experience.", "Date": "March 20, 2014"}, {"Title": "Love this camera", "Author": "Aaron markel", "ReviewID": "R3PLKE0J308GA0", "Overall": "4.0", "Content": "Works great.  Dropped it soon after purchase and no issues.  Also I used it under water with great results.  Would highly recommend.", "Date": "March 18, 2014"}, {"Title": "Perfect Travel Camera", "Author": "S. Seubert", "ReviewID": "R3IKQFJ324ZB6F", "Overall": "5.0", "Content": "I'm a pro photographer and I love this camera.  It doesn't have a delay like most, it's rugged (I've dropped it a few times) and waterproof.  It is always in a pocket for emergency shots, great to throw in a beach bag, and wonderful when working on water.", "Date": "March 16, 2014"}, {"Title": "Worked great and took great pictures", "Author": "T. Jones \"Localbuzz\"", "ReviewID": "R2GIYU5DE0M5Q8", "Overall": "4.0", "Content": "I bought 2 of these for our trip to Australia.  We used them for our excursion to the Great Barrier Reef and they performed great for our day of snorkeling.  No issues with water getting into the camera and we were in the water for 4+ hours.  Took lots of photos and video and they all came out great.  The only problem we had was that it was hard to see the screen underwater.  it was hard to see if you had what you wanted to take a picture of in the frame.  Other than that, this camera performed great.  definitely get the Chums Waterproof Camera Float.  Helps keep the camera on you wrist and it will float to the top if you happen to drop the camera while shooting pictures.", "Date": "March 13, 2014"}, {"Title": "Not very competitive", "Author": "Kyle \"cylem\"", "ReviewID": "R3FFX5DXUBH2CE", "Overall": "3.0", "Content": "Well Firstly I also own a Olympus TG-830, another waterproof/everything proof camera. I like it but it's fairly bulky, ugly and picture quality isn't the best. However It does have a lot of features that I just couldn't leave it for the Pentax.First thing I thought when I opened this box was, that this thing was MUCH larger than I thought. From the photos I had assumed it was a decently small camera (my fault for not looking further obviously) but this camera is really thick, and wide, just not really tall. It feels pretty good in the hands though, and I like the original design, and flare on it.Next i went on the the controls, this is one of the disappointments. Most other cameras give you a dial to quickly select modes, this you only have the option of going to a giant menu of all shooting modes and selecting from them, and when you select a special movie mode, you have to switch off it to take pictures again from what I saw. This is just not intuitive and gave me a bad taste.Camera operation was fairly speedy though, sometimes I had to double press the buttons (really have to give them a good push) and it didn't lag much. Taking pictures auto focused really quick, and startup was really quick too.Another thing I didn't like was the zoom, I understand the lack of zoom with the internal lense, I would like to see 5x like competitors but 4x isn't bad. The bad part is it doesn't include really any \"SR\" zoom like other companies. This lets you do a further zoom and the camera takes a larger pictures and crops it down allowing you to lose very little image quality. My olympus does 5x normal and 10x SR zoom.Features are pretty plentiful, i really really like what they did with the LED's, it helps taking certain types of pictures and is just a cool feature to have. Plenty of shooting modes, and it ever has 120fps video in 720p which is a feature I love to have.Overall, if the camera were less bulky, had better zoom function and button configuration I would really love it. however I would not really recommend unless it's features like the LED's or it's design are a must have.", "Date": "March 11, 2014"}, {"Title": "Worked Great!", "Author": "M. Wachholz \"Mike\"", "ReviewID": "R21WCIGZHNZQN2", "Overall": "5.0", "Content": "Just got back from Mexico for a week.  I took the camera snorkling twice (once for 1.5 hours, the other for 4 hours on and off all day).  Also had it in the rain for a bit.  Worked flawlessly.  A little hard to see the screen underwater, but much better than the last $80 waterproof camera I have.  I made sure to wash it off good after getting out of the saltwater, and then dried it.  Once we got back to the hotel, I took the battery out and left the door open to make sure everything dried out good.  No issues so far!", "Date": "March 6, 2014"}, {"Title": "This is the BEST ruggedized camera", "Author": "AMAZON CUSTOMER", "ReviewID": "R36ZIXX5Y7YY69", "Overall": "5.0", "Content": "This is the BEST ruggedized camera, shutter speed, image quality, battery life, GPS tagging, and Eye-Fi usable. Very nice UI.", "Date": "March 5, 2014"}, {"Title": "Does what it says!!", "Author": "caroline mann", "ReviewID": "R3JKSIMKWLEDW0", "Overall": "5.0", "Content": "My family just spent a weekend in a waterpark and it has definitely proven itself!  I chose this camera over Nikon or Cannon because it seemed less gimmick and more legit.  It is.", "Date": "March 3, 2014"}, {"Title": "The fun camera", "Author": "rrlady", "ReviewID": "R1A71DWMEXAH83", "Overall": "5.0", "Content": "We've taken pictures of the kids surfing, from eye level, gotten a few underwater shots, not worried when it fell in the sand. If you want more from your camera, get this one.", "Date": "February 28, 2014"}, {"Title": "This is a great camera with many features.  Would not purchase the GPS feature again as it is just a compass.", "Author": "alan byerley", "ReviewID": "R3S1TK51RAKL15", "Overall": "5.0", "Content": "This is a great underwater camera with many features.  Features were a bit overwhelming to understand at first but practice makes it more user friendly.  Would like to have had a stronger zoom.  Unless you are looking for a simple digital compass, save your money and forgo the GPS feature as it is not a true GPS as thought. The GPS model does however offer a altitude/depth feature as well as a clock which is not offered on the non GPS models. You choose. This camera takes great pictures.", "Date": "February 27, 2014"}, {"Title": "Amazing", "Author": "Mistress Widow", "ReviewID": "R2VSR9R26M4WVX", "Overall": "5.0", "Content": "I bought this camera as a preorder so I spent more on it than what it sells for now. I'm not rich and I work hard for the money I have so buying something \"big\" like this means a lot to me. I love how I don't have to be scared of letting my little brothers or stepdaughter use this camera. They can drop it and I'm not scared it's going to pop apart and break easily. I love how I can literally take it anywhere with me, I don't have to worry about buying a disposable waterproof camera anymore and have my pictures damaged during development. Overall the photo quality is very good, it's hard to use underwater and see the photos but not because of the camera. You need to have good goggles on in order to really see what you’re photographing before doing so. The photos taken underwater were awesome. I've owned the camera for a little over a year now and I'm still very happy with it.Pros:Good picture qualityGood underwater picture qualityDurableLong-lasting battery lifeEasy to useCons:Charging (you have to leave the compartment door open in order to charge it, would have been more convenient if it charged the battery separately from the camera)", "Date": "February 24, 2014"}, {"Title": "Kind of dissappeared", "Author": "Anastasia Fomenko", "ReviewID": "R24ZIERGSJ7KT0", "Overall": "3.0", "Content": "This camera attract my attention because it was very durable and practically I breakable, but unfortunately the main reason why I got was to take pictures underwater and it did not do a good job doing so. The quality if pictures under water is disappointing.", "Date": "February 21, 2014"}, {"Title": "battery died", "Author": "Duzzie", "ReviewID": "R38KOOT5949RXQ", "Overall": "3.0", "Content": "It worked for the 1st 3 times. My battery doesn't work. Camera underwater was lower quality then I thought it would be. Its durable.", "Date": "February 15, 2014"}, {"Title": "Maui trip in January 2014", "Author": "David Pooley", "ReviewID": "R1NXVV3TG3VGLF", "Overall": "4.0", "Content": "The camera worked well above and below the water the video is great it was good even in poor visibility under water.I was Snuba diving down to 10 to15 feet and had no problems at all.Battery was not to bad could be a bit longer life but I am satisfied with the camera.", "Date": "February 15, 2014"}, {"Title": "steady improvement", "Author": "oldcoot", "ReviewID": "R1DBSMWOCHRVPK", "Overall": "5.0", "Content": "I have had Pentax weather proof in earlier models they seem to improve with each passing model I do however recommend that every one who intends to own a weather camera thoroughly research their choice, to satisfy their own likes and dislikes .", "Date": "February 13, 2014"}, {"Title": "Good camera", "Author": "Gerald Thayer", "ReviewID": "R2YG36DMLATLD1", "Overall": "4.0", "Content": "The camera has great features for working in the rugged outdoors and harsh weather conditions. Recommended for work/sports in the great outdoors!", "Date": "February 11, 2014"}, {"Title": "Nice Macro!", "Author": "Keith Osborne", "ReviewID": "R2XUIL2C3SRUFP", "Overall": "5.0", "Content": "I had previously owned a 2008 Pentax W20 and for five years it served me through neglect and abuse around the world standing by for use. Which is why I opted for this upgraded model. I watched some of the abuse videos for it and was impressed.I have used the Macro features and they are very good. So far it has done everything I have asked. Video capability is ok as is the panorama feature.", "Date": "February 9, 2014"}, {"Title": "great camera", "Author": "P McDonald", "ReviewID": "R18J79EV5S8SYY", "Overall": "5.0", "Content": "I have not used the underwater feature yet but it has more options and settings than my main camera.  Will be using it at the Great Barrier Reef.", "Date": "February 3, 2014"}, {"Title": "real iceproof", "Author": "Lin wei yi", "ReviewID": "R4L8QD216QKR4", "Overall": "5.0", "Content": "I went to ski and used this camera to shot something. it is easy to use and suitable for sport.", "Date": "January 30, 2014"}, {"Title": "this is a godsend for the fisherman", "Author": "Baryshev", "ReviewID": "R1KBQ8IYJYXRPQ", "Overall": "5.0", "Content": "Favorite vacation - fly fishing. The camera allows you to take beautiful pictures underwater. Really like shooting macro, seen the smallest details.", "Date": "January 23, 2014"}, {"Title": "Love this camera.", "Author": "ED", "ReviewID": "R3W3GOKJDEIZOH", "Overall": "5.0", "Content": "It is easy to use in the field and easy to download pictures at home.  Takes great pics and videos.", "Date": "January 3, 2014"}, {"Title": "Great rugged camera", "Author": "D. Adkins", "ReviewID": "R26E09SSALU2MQ", "Overall": "5.0", "Content": "Bought this for my son for Christmas and he loves it!  He is studying fisheries biology and it will be great for his research!", "Date": "January 2, 2014"}, {"Title": "Great camera", "Author": "bp", "ReviewID": "RDVD34BKC46KJ", "Overall": "5.0", "Content": "My battery came dead on arrival and did not work. I had to order a replacement battery and once that came the Camera is a must have for any vacation, or adventure. The color is vibrant and the camera is durable!", "Date": "January 2, 2014"}, {"Title": "Good for fishing trips", "Author": "Martha", "ReviewID": "R8K2BAI5HUYWF", "Overall": "5.0", "Content": "The camera was able to be used right out of the box to toy around with since I also purchased a memory card and backup batteries. There is a strong chance that this camera will fall into a lake at some point so I also bought a wrist buoy. This camera is great for a non-expensive but great quality option to throw in the tackle box.", "Date": "December 30, 2013"}, {"Title": "Great for under water shots", "Author": "A C", "ReviewID": "R3SX3LWJXLKEEB", "Overall": "5.0", "Content": "I used this camera to take pictures in the pool and at the beach. The camera takes great photos under water and in the sun. The shape of the camera is different but it fits nice in your hands. It is very responsive and simple to use. I recommend this product.", "Date": "December 29, 2013"}, {"Title": "Nice camera", "Author": "Marlin Jones", "ReviewID": "R3R5HN9MIKU37J", "Overall": "4.0", "Content": "In the last 5 months I have taken around 6000 pictures with this camera. It stopped working when I changed batteries in a wet location but was ok when I air dried it. I have not had it deep but takes nice snorkeling pictures. The compass seems to work well. The altimeter is not right on but show when I change elevation. GPS seems to work on it but have not tried ploting points on a map from it. Camera has lots of options I have not tried.", "Date": "December 21, 2013"}, {"Title": "Great  little camera.", "Author": "jwb1933", "ReviewID": "R2BGKB4E0FXT1X", "Overall": "4.0", "Content": "I have not been in the water with it, but I love its features and zoom. I may write more later.", "Date": "December 15, 2013"}, {"Title": "Not for diving but you could use it in the pool", "Author": "K. Koussa", "ReviewID": "R2UXV0RFHT97LS", "Overall": "5.0", "Content": "Great for travel I tested it in water, wind, and drop it couple times.Recommended as small camera but not recommended for diving.", "Date": "December 10, 2013"}, {"Title": "Great underwater camera", "Author": "Kathy", "ReviewID": "R2R4OIVUUO862X", "Overall": "5.0", "Content": "I used this camera for the first time when I went swimming with the manatees. It took awesome pictures and video underwater. I was surprised at how clear the pictures were because I didn't seem to be focusing too well at times. I'm primarily a DSLR user but I liked this little camera. I'll definitely be taking it on more adventures!", "Date": "December 5, 2013"}, {"Title": "Great equipment", "Author": "slide112", "ReviewID": "R3B9705LSMWA6H", "Overall": "5.0", "Content": "It is a great tool with a variety of settings and options that assist me in my every day work... and easy to carry at a party or function.", "Date": "December 2, 2013"}, {"Title": "Great travel camera", "Author": "Maria (WV)", "ReviewID": "RT058LY1K9I3M", "Overall": "5.0", "Content": "I'm very picky with my cameras.  This is awesome!  The regular mode is great but it has a micro mode that blows me away.  I'm a scrapbooker and this gets great pictures every time.  The underwater option works wonderful.  I would buy this again.  It's been a great travel camera if I'm not in the mood to lug my big camera around.  Way better than my phone camera as well.", "Date": "November 20, 2013"}, {"Title": "Pentax Optio WG-3 GPS", "Author": "J. Sayson \"j1tanamera\"", "ReviewID": "R2LSA6W527OL0W", "Overall": "5.0", "Content": "Excellent camera ~ very rugged, and takes great pics.  Easy to use, lots of features, and best of all, its a PENTAX, so you know you have a great lense on the camera, and that it will be reliable.", "Date": "November 19, 2013"}, {"Title": "i love this camera easy to use", "Author": "marco cisneros", "ReviewID": "R30PD8PK6Y0A47", "Overall": "5.0", "Content": "well, this is a really good choice for travellers or for anyone who wants to take photos everywhere it is easy to use it has an intuitive menu options panel ,take photos underwater??? pretty good at it , shockproof is usefull", "Date": "November 11, 2013"}, {"Title": "Love it!!!!", "Author": "colby herrell", "ReviewID": "R2WPEQLV1FY7IX", "Overall": "5.0", "Content": "I did a lot of research on this camera before I bought it, and the reviews were mixed. I decided to go ahead and take a chance on this camera anyway, and I'm glad I did. I absolutely love this camera!!!! I would recommend this to anybody who likes to take a lot of pictures in all different elements.", "Date": "November 6, 2013"}, {"Title": "Pentax Tuff", "Author": "Robert Glass", "ReviewID": "R43IGRHOVCL3G", "Overall": "5.0", "Content": "Great little camera.  Takes great photos.  Is tuff.  Drop it in the snow? No problem. Wipe it off and keep on going.", "Date": "November 6, 2013"}, {"Title": "Great camera", "Author": "Dave", "ReviewID": "RZ8QE47YTQ9LQ", "Overall": "5.0", "Content": "Great camera, good price.  I bought this to replace a pentax optio WPI before my son's birth.  This camera takes great pictures, even in low light, and starts up fast.  The old WPI was great and still functions fine, so I'm confident this camera will go the distance.If you're used to SLRs and fancy optics, this camera may not stack up, but if you're used to phone cameras, this will blow those out of the water.  Especially in low light.  Camera has a stabilization feature that works great for extended exposures.  Got some good halloween pictures of my niece and nephew without ruining the shot with the flash.", "Date": "November 4, 2013"}, {"Title": "LOVE, LOVE this camera.", "Author": "Florida Photog", "ReviewID": "R1TSY5WX0TRTY1", "Overall": "5.0", "Content": "It's great underwater and on land. We used it snorkeling and also at the beach.  It is lightweight and tough. The only thing I don't like is the caribiner strap, would rather have a real camera strap to put around my wrist. But I bought the floating strap so when in the water I'm OK.", "Date": "October 31, 2013"}, {"Title": "From Kauai to Gerlach - this one is a survivor", "Author": "Michael R. Murphy \"it's not the wind, but the...", "ReviewID": "R3KO8GSUXQ59F", "Overall": "5.0", "Content": "I bought this camera for two different vacations - one on Kauai, where we planned to do some snorkeling - and the other one out to Black Rock City, known for dust storms.  Happy to say this little fellow did a great job in both environments.  Lots of different settings allow you to take great pictures in a variety of places.", "Date": "October 29, 2013"}, {"Title": "replaced our WG-1", "Author": "Duane R-H", "ReviewID": "R393YOV8NGUR5W", "Overall": "5.0", "Content": "We really liked our WG-1, but it had a fault that resulted in the screen going dark while trying to compose a photo. Before heading out for 10 days on the John Muir Trail we decided to replace the broken camera. The new model works better, having more range, more megapixels, and additional modes that we used. The new one is larger and heavier, but still fits in my pants front pocket where it is handy. A major improvement is the double latch on the battery/SD card door. We handed the camera to a number of people on the trail so that they could take our picture, and every one of them marveled and remarked about the camera. I particularly like the macro capability which I used to take photos of ants that fill the frame. I wish it had a bit more zoom, but with the size of the pictures I can crop to get the effect. Back at home I carry the camera to events where I am responsible for social media photos. I prefer using this camera to my Galaxy S4 because this camera is ready to go instantly and is much easier to hold. It is also less trouble to slip out the SD card for loading the photos into the computer than using the phone's cloud or cable-based solutions. We did not get the built-in GPS because of the delay it imposes and the way it sucks battery. Our 10 day hike used three batteries in this camera. I had bought the two extra batteries and a charger, and had the cable necessary to recharge in the camera from our solar panel, but made it on the three very light batteries we brought.", "Date": "October 29, 2013"}, {"Title": "Pentax WG-3 camera", "Author": "Charles Prewitt", "ReviewID": "R3T09KVCN028XJ", "Overall": "5.0", "Content": "Great versatile compact camera.  Only problem so far is difficulty in seeing in viewer for framing/zooming on bright sunlit days.", "Date": "October 25, 2013"}, {"Title": "Nice durable camera", "Author": "Alex", "ReviewID": "R2WT1XBQT8LZ1O", "Overall": "4.0", "Content": "I took the camera to a trip to havasupai. It performed well and took crisp pictures. I wish there was a controllable long exposure mode but one can't be to picky. I tried some under water shots and video of some small fast moving fish. The auto focus during video seemed it was struggling to keep up. The pictures turned out well. Overall a good purchase for what I intend to use it for which is a camera to strap on to my pack during backpacking adventures.", "Date": "October 21, 2013"}, {"Title": "Great camera", "Author": "randy combs", "ReviewID": "R212JQRKTEMKPH", "Overall": "5.0", "Content": "Great product, bought camera for a ten week vacation in Thailand ,  the camera is everything I expected, very durable .It takes great pictures, I would recommend this camera to anyone that is hiking or exploring in the bush, mountains, jungle ect.  Very solid camera.", "Date": "October 20, 2013"}, {"Title": "Perfect for Adventures", "Author": "Carson", "ReviewID": "R33U0J00Z72EJM", "Overall": "5.0", "Content": "We put this camera to the test!  We took it on a week and half long adventure in Utah and Colorado, and it took every abuse we put it through (dusty mountain bike trails, in the Colorado River, and many others!).  Great photos, amazing zoom, and dependable.  Great camera, and definitely worth every dollar!!", "Date": "October 18, 2013"}, {"Title": "Great camera", "Author": "Shana Van B", "ReviewID": "RS3GBI3KPQFVK", "Overall": "5.0", "Content": "Got this for my husband for his birthday after he had seen one a friend of ours took on vacation.  We both love it.  Not a single problem and it takes great pictures.  It has a huge view screen, and is cool looking.  It truly is waterproof as well.", "Date": "October 15, 2013"}, {"Title": "Good camera", "Author": "James W. Ficklin", "ReviewID": "RM3PGUDU8466F", "Overall": "5.0", "Content": "This replaced my last Optio which failed at the very end of a Hawaii trip. I'll sent it in & see what it costs to repair the shutter button. Altho a bit heavier, I like the upgraded features on the WG3. It has a more secure battery/sandisk compartment with a lock. Menu access is basically the same. I was somewhat disappointed that the battery is a bit larger, so the batteries for my original Optio won't work & I had to buy more, but that's a fairly common ploy when it comes to upgrades. Takes great pictures; this is my outdoors/hunting/fishing camera & Optio fills that niche well.", "Date": "October 9, 2013"}, {"Title": "Great Camera!!!", "Author": "NEC Services", "ReviewID": "RUUXS7J3871OL", "Overall": "5.0", "Content": "Wonderful camera.  great pics.  works better than expected.Easy to use, clear pictures, rugged, and sturdy.The one thing I would enhance would be the buttons around the menu.  They are difficult to use if you dont have nails.", "Date": "September 16, 2013"}, {"Title": "pretty good camera", "Author": "L. Wosick \"kindle lover\"", "ReviewID": "R2B0Z9VM275IRL", "Overall": "4.0", "Content": "I purchased this camera for a trip to Alaska. I like it. It's great for basic pictures and has lots of options. My only complaint is that when zooming in the picture get very digitized, Otherwise I worked out great. I used my digital 35mm DSLR for the  distant pictures. I would recommended this camera.", "Date": "September 14, 2013"}, {"Title": "Took on JMT and photos were Grand", "Author": "John Konopasek IV", "ReviewID": "R3W1P7PQWYA8UC", "Overall": "5.0", "Content": "Thus far can't say enough about the camera and the image quality.  I had the WG-1 (it was indestructible -- took it to the top of Mt Rainier with no sleeve on the outside of my pack and worked great -- but image quality was good), however the WG-3 the image quality is a huge upgrade (great shots -- especially with low light and the HDR setting).  I have some shots I turned into canvas posters.  Remember this is in the context of rugged cameras.  From the photos I've taken and the abuse its taken -- I recommend the WG-3 or the WG-1.", "Date": "September 10, 2013"}, {"Title": "Wworks Grest", "Author": "Chris Moon", "ReviewID": "R1WCLGQ8I6JF9C", "Overall": "5.0", "Content": "Took this camera on a white water rafting trip with my son, we got completed soaked, camera still worked great even when wet and after being wet.  Was leary about the water proofness when I bought it but it worked like it was supposed to.  Is bulky compared to my other camera's, but they were not waterproof either so there is a trade-off is size is a consideration.  Also this camera DOES NOT use AA or AAA batteries so that is disappointing, but ordered the spare battery/charger kit  (wall and vehicle charger) and all is good.  Batteries last a long time too, so even though they are not AA/AAA batts, I do not have to buy batteries.", "Date": "August 4, 2013"}, {"Title": "So far I love this camera!", "Author": "C. Bauman \"bauman171\"", "ReviewID": "R1DK13RNP8P2ND", "Overall": "5.0", "Content": "I purchased this camera because I saw it on GMA Deals & Steals, promoted as being \"adventure-prove\" and (of specific interest to me) waterproof to 45 feet with a rechargeable battery.  I had been looking for a waterproof casing for my Canon Rebel T2i for when I go SCUBA diving.  Casings runs around $1,500, so the price tag on this camera (about 1/6 of the price of the casing) appealed to me as well as its versatility and compactness.Although I have not yet had an opportunity to take this camera SCUBA diving (and therefore test it's waterproof-ness), I have spent the last 2 months using it hiking and rafting in Glacier National Park, and so far I am very happy with this camera.First, it is very easy to use.  Anyone with any knowledge of a basic P&S; digital camera can pick this up and use it without reading the instructions, and it has all the standard camera settings for portraits, landscapes, moving subjects, etc.  But beyond that, even when choosing settings, the icon are accompanied by a brief description of what that setting does (ie, flowers with the outline of the flower softened, low light settings, movies, capturing images under water, taking underwater movie, stitches images to create a panoramic photograph, etc).The pictures are also pretty impressive; the camera is much more compact than my DSLR, and although zooming in closely on a moving object can take a bit more time than it does with my DSLR, but the pictures are very close in quality.  And the Pentax WG3 comes with a carabiner and strap so that I can easily attach the camera to my backpack.  Once I tried the image stitch for panoramic pictures, that became one of my favorite settings for out here at the park (you take the first picture and then a small portion of one end of that picture appears in shadow so that you can match that up to the get the next picture to line up with the first).One thing I would recommend would be to get a screen protector.  I meant to find one before I left on my trip but I forgot.  And while I will say that this camera has thus far been tough enough to withstand everything I have put it through, I have- on many occasions- forgotten that it was attached to the chest strap on my pack and when I take off my pack and lean it again a rock or a tree, I forget to protect the camera from slamming into the ground (or rock or tree).  Although the screen is still intact, it is starting to get a few little scratches in it and I intend to get a screen protector as soon as I get home, to protect it from further damage.The only other things I would recommend would be to consider purchasing a float wrist strap (the camera does not float!) and a backup battery.  Although the battery typically lasts me more than a full day of taking pictures, I did get a back up to take backpacking so that I don't have to worry about running out of juice and missing out on some AMAZING pictures!", "Date": "August 1, 2013"}, {"Title": "This camera is awesome!", "Author": "outdoorsman1789", "ReviewID": "R1NX2WHU4BWPAE", "Overall": "5.0", "Content": "I am a semi-pro photographer with DSLR's and P&S;'s.  This camera is amazing.  I take tons of pictures every day and I would rank this as one of the best point and shoot cameras I have ever used.  It is very fast and you can't compare to 5x optical in body for this price.  The photo quality far succeeded my expectation.  This little camera records in extremely good quality.  The slowmo feature is incredible.  The time laps works perfectly.  The Macro mode is stunning.  Underwater mode is incredible.  Every single feature is great.  Many people complain about the noise when you zoom.  It is loud... but its an in body zoom......... how could it not be loud?  This is a negligible flaw to me because I put music over every second of footage that I take.  All of the settings do what they sat they will do.  I only have 1 complaint, and that is that the screen gets scratched extremely easily.  Now, I know this is a rugged camera and it is put into positions that other cameras would not be in and that is mostly at fault.  I HIGHLY RECOMMEND THAT YOU USE A SCREEN PROTECTOR.  I take VERY good care of my equipment and yet somehow this screen still managed to get scratched pretty badly.  I did't remove a star because that is what this camera is made for- getting abused.  It takes it very well. If you are considering a durable/underwater/everyday camera- BUY THIS PENTAX!", "Date": "July 30, 2013"}, {"Title": "Great Camera, Love it.", "Author": "Richard E. Conn", "ReviewID": "R2XQYJ49AQGRB9", "Overall": "5.0", "Content": "This is a great camera, I love it, Easy to use, tough, great manual, but you do need to read it to take full advantage of the camera, It does a lot but it also is easy to figure out how to use it, when you are out in the field taking pictures and no manual with you Rick", "Date": "July 29, 2013"}, {"Title": "LOVE IT", "Author": "Amazon Customer", "ReviewID": "R1YSDKILO446RX", "Overall": "5.0", "Content": "Exactly what I was expecting great camera and excellent in rough weather, durable and all around great camera. LOVE IT!!", "Date": "July 25, 2013"}, {"Title": "very nice camera", "Author": "lj3rs", "ReviewID": "R3QO3R8DM6RX8Z", "Overall": "4.0", "Content": "I originally got this camera for a trip to Alaska.  It supposedly rained a lot and I didn't want to ruin my SLR camera.  However it never rained the entire trip.  I did use the camera a lot however.  The telephoto is really nice and I used that instead of having to put my telephoto lens on the SLR or I would use it when the telephoto lens was on the SLR.  Most of the pictures came out the way I wanted them to.  Some of the shots of snow and/or glaciers came out too bright.  I should have tried the option for snow I guess.  I did try several of the options but usually just stayed with the program  option.  One issue I do have is that the button to zoom in is very close to the movie button.  Sometimes when I was framing a shot and wanted to zoom in some, I pushed the movie button instead and got an unwanted movie.  It does take very nice movies.  I used it instead of lugging my video camera around too.  It is a bit larger and heavier than some cameras but it fits in a lot of my pockets.  It is nice to have around when the grandbabies are around so I don't need to worry about it getting broken.  Before I wrote this review I did take it into the pool and took some underwater movies and still shots.  They came out nicely. The only other issue I have is that though it zooms in a lot, it you go too far the photos lose clarity.  Maybe if used on a tripod that wouldn't happen.", "Date": "July 5, 2013"}, {"Title": "Camera pentax", "Author": "JUAN D.", "ReviewID": "RYVBGRLWT8V8W", "Overall": "5.0", "Content": "I boght this camera because i have one of the previous version and  works  very well!When this package arrives me, i will a complete summary of this product", "Date": "July 2, 2013"}, {"Title": "Great Camera", "Author": "PMills", "ReviewID": "R16PAONRIP4LTS", "Overall": "5.0", "Content": "I bought this camera for my husband for our family trip to Cancun.  It was everything we were hoping it would be.  Took really great quality pictures and the under water pictures were better than I expected.  It was great to have a camera in the pool or at the beach and not have to worry about getting it wet and ruining it.  I would recommend this for anyone looking for a reasonably priced waterproof camera for vacations or any water activities.", "Date": "June 22, 2013"}, {"Title": "Great Camera!", "Author": "Myra Buck", "ReviewID": "R2N1HILU6J7QXT", "Overall": "5.0", "Content": "Great camera, bought it for my husband before our vacation to Mexico and he loved it and used it everyday! He actually swam with it on his side or lounging in the pool so the camera was in the water all the time with no problems and the pictures were great!", "Date": "June 18, 2013"}, {"Title": "Good image quality and functions", "Author": "Vince.Lian", "ReviewID": "R2DZC4ZQJDY2UM", "Overall": "5.0", "Content": "Good image quality and functions, with such a price to enjoy the high end underwater camera is nice.I hate Pentax for its DLSR, but I love this camera", "Date": "June 15, 2013"}, {"Title": "Excellent! Great! Awesome!", "Author": "Justin W. Rice \"Justin\"", "ReviewID": "R1JTMNV742SV9X", "Overall": "5.0", "Content": "Best rugged all weather camera on the market! Excellent delivery time coming from Canada to Florida. Well definitely consider purchasing from is seller again. As for the camera, the only flaw with this model and other models such as Olympus tough series, they do not offer a wall charger for the battery. I had to purchase one separately with 2 extra battery packs. Overall, great seller, excellent product, will definitely only use Pentax for my rugged digital cameras.", "Date": "May 31, 2013"}, {"Title": "Great camera", "Author": "Carol Cassidy", "ReviewID": "RC74B2CWMMCLZ", "Overall": "5.0", "Content": "This camera is both rugged and reliable. It takes great pictures. Have used it in a river but not at any depth. I would definitely recommend this camera.", "Date": "May 30, 2013"}, {"Title": "A camera I don't have to protect with my life...", "Author": "David Schlier", "ReviewID": "R4VRH94BX3NVP", "Overall": "5.0", "Content": "I decided to purchase this camera because I wanted a camera I can take canoeing/kayaking/sailing without worrying about the expensive and delicate electronics if I should inadvertently go for a swim.  I went with this choice without GPS because I generally know where the shot was taken and can add it to the EXIF data if needed.  I went with the orange thinking the color would be easily spotted if dropped.The packaging is compact but protective.  The number of items is somewhat minimal: camera, power adapter, USB cord, battery, software and the manual.  I added a 8 GB class 10 SD card to hold what turns out to be a lot of shots (over 800 at highest resolution).  I also purchased  a charger and battery (Wasabi Power Battery (2-Pack) and Charger http://www.amazon.com/gp/product/B004W82GP8/ref=oh_details_o04_s00_i02?ie=UTF8&psc;=1) because another reviewer mentioned the battery doesn't last long enough for a full day of shooting.I charged the battery using the power adapter/cord, plugged into the camera - worked fine.  After closing the battery/SD Card door and locking it, I started shooting.  The pictures are of good quality although stored only in JPEG (no DNG, no RAW, bummer). I found that I needed to have the manual next to me for the first session because the menu choices are varied (auto, manual, HDR, night, portrait, landscape, etc., etc with or without flast, red eye reduction, facial recognition etc., etc. using single point or broader focus, and exposure).  I am generally a manual or Tv or Av kinda guy with single point focus.  Anyway, I've taken about 200 shots with it so far and I'm impressed.The shots are sharp, the optical zoom works reasonably quickly, autofocus is reasonably fast.  The camera works well in low light conditions using auto ISO (another menu fuction!).  It takes nice macro pictures as well.  The menus, although occasionally obtuse, allow a wealth of shooting options which the photog in me loves.Some things to think about: the camera will sink - use a buoy wrist strap if you're concerned (sailing/kayaking - I'm concerned).  The color is only on the front so if it sinks and falls on it's front in lake muck, good luck finding it (see the buoy above).  Remember to keep the lens (cover? filter? whatever - the clear thing in front of the lens) clean as it is integral to the case - unlike other P/S cameras, there is no automatic lens cover that closes when turned off.  If it gets wet, you will have spots until it's cleaned.Disclaimer:  I shoot Pentax DSLRs.  I generally have to protect the lens/bodies with my body in inclement weather/people.  I am familiar with Pentax software but don't use it - I use Adobe Lightroom for import, organization, initial editing and publishing and Adobe Photoshop Elements and the GIMP for tweaking and detailed editing.  I purchased this camera because I am very familiar with the way Pentax organizes the menus, the WG-2 won at TIPA and outdoor magazines all give it a thumps up/best choice/it survived.", "Date": "May 29, 2013"}, {"Title": "Great in Water", "Author": "Brandon Wacasey", "ReviewID": "R1OHPIYFTBCST5", "Overall": "4.0", "Content": "Maybe not the best picture quality, but everything about it is convenient. It does great in water and good with red eye.", "Date": "May 19, 2013"}, {"Title": "Nice camera, but...", "Author": "Marty", "ReviewID": "R3D7GHZVWEVDZO", "Overall": "2.0", "Content": "Purchased this unique looking camera to take snorkeling. It's very rugged, looks cool etc. Took several pictures and video which look very good. I went snorkeling and made sure both locks were in the proper position. Camera was in the water for about 2 mins before the screen started fooging up. Then it went dead completely. When I got back on shore I checked the SD and battery compartment. It was dry so all my previous pics were saved. So, I don't know where the leak came from, but it needed to be returned.", "Date": "May 13, 2013"}, {"Title": "Ruined my vacation.  Do not buy this camera!!!!!", "Author": "Dave D", "ReviewID": "R3HM1EA4YP36IT", "Overall": "1.0", "Content": "I read many reviews about this particular camera before I purchased it.  All were very good.  I was excited to take this on vacation to the Dominican Republic.  My wife and I were going to go snorkeling and planned a bunch of water activities that i was looking forward to capturing.  I took the camera on the snorkeling excursion and ten minutes in it stopped working.  Has not worked since.  Turns on briefly then flashes and does nothing.  Has basically ruined my vacation.  These are events and memories that cannot be duplicated.  Maybe I should ask Pentax to give me three thousand dollars so i can re-do the vacation.  I would not recommend this product to anyone who does not thoroughly test it out in the water before taking it anywhere.", "Date": "October 23, 2013"}, {"Title": "Burned out on the 2nd day of my honeymoon!", "Author": "Chantelle du Plessis", "ReviewID": "R1DM2LN5KTIQGN", "Overall": "1.0", "Content": "The first time I used this camera underwater I noticed water drops inside the battery compartment. I continued to use it a couple more times and then while taking pictures of turtles on my honeymoon it gave me a message saying that it was turning off to prevent overheating. I waited a while and then tried to shoot again but got the same message. Then it shut off and never came back on again. I removed the battery and noticed that water must have gotten in and burned the sensors. They had already turned green. To be fair the shots I did get from this camera before it died were really great. Very clear, quality images. It might be good for other uses but not so much for underwater. Being a photographer I'm really disappointed that I didn't have the images I wanted to capture from my honeymoon but grateful I had a back-up camera for land use. Amazon refunded me for my purchase as well as the return shipping from Colombia. Great customer service on their behalf.", "Date": "April 4, 2014"}, {"Title": "Just what I needed", "Author": "Tom Alford", "ReviewID": "R3B2089NQZZ5QJ", "Overall": "4.0", "Content": "I am an industrial hygienist and need a reliable camera for reports.  The close up feature of this camera is great.  My only complaint is sometimes it takes too long to focus and it has some night mode it slips into that makes the flash blink a bunch of times.  Although truthfully it could be user error.", "Date": "February 16, 2014"}, {"Title": "Super!", "Author": "dentalchick", "ReviewID": "R2FSEQ46G1UW41", "Overall": "5.0", "Content": "Great camera!  We take this camera everywhere there is water!  It has been to the Bahamas and Mexico already and has taken some fabulous pictures.  Highly recommend!", "Date": "January 26, 2014"}, {"Title": "great camera", "Author": "Melinda Richards", "ReviewID": "R30EH4OMJB0ICW", "Overall": "4.0", "Content": "I bought this camera for a family vacation and it turned out to be a great camera for the money.  I needed a compact digital for the trip and one I could use snorkling.  It took very good pics in lots of different lighting conditions, and the underwater pics were great too.  It is a perfect size and packs a lot of features into a small package.  Can't wait to take it with me rafting the Colorado River", "Date": "January 23, 2014"}, {"Title": "Nice Waterproof Camera", "Author": "D. Stropus \"mamadole\"", "ReviewID": "R3W2QQCLBPAW9R", "Overall": "5.0", "Content": "Shopped for this camera in brick and mortar stores, as well as online. Amazon had the best price. We'll see what kind of pictures it takes. Looks easy enough to use.", "Date": "January 8, 2014"}, {"Title": "BIG disappointment in picture quality.", "Author": "J. H. M. \"coolrabbit\"", "ReviewID": "RN3NR9H4QOPUS", "Overall": "2.0", "Content": "This camera is a huge disappointment! Pictures are grainy and fuzzy, regardless o the camera setting or the situation (indoors, outdoors, low light, bright light). I have tried it all and not a single picture comes out clear enough to use full-sized or edit well. I took several side-by-side shots with the WG-3 and an old (6 year old) Pentax 5m point and shoot camera, and the old one blew this one away with crispness and clarity of pictures. I am very disappointed, as this camera was definitely not cheap. To me, it's pointless to have a camera unless it takes CLEAR pictures.", "Date": "November 24, 2013"}, {"Title": "Excellent tough/waterproof camera!!", "Author": "ryan", "ReviewID": "R3STK7B78K7BRX", "Overall": "5.0", "Content": "Have been searching for the best all around tough/waterproof/etc camera for my various adventures.  Finding one that did everything I wanted was turning into a choice having to sacrifice options.Have recently had Nikon AW100 & AW110, JVC Adixxion, Gopro Hero 3 black, Olympus TG-2, Panasonic TS-4 & TS-5, Pentax WG-10.....  after trying each one, I found this WG-3 to be \"the one\".  It does everything and more, and does everything \"better\" than the others!Underwater diving, moving dog pics, long range pics (28.8x zoom), lowlight pics (very strong flash), high speed pics (perfect slow motion), macro pics (amazing, microscope mode).It excels and takes great shots when and where the others fail or require multiple attempts to get a \"great shot\"!Every aspect seems highly engineered, it has every feature I need (and more!) and it seals up just as good as the AW Nikon does. I highly recommend this waterproof adventure camera!", "Date": "September 10, 2013"}, {"Title": "Pentax Optio WG-3 WATERPROOF Digital Camera", "Author": "Walks Alone", "ReviewID": "R2TX0E8N5M4LMO", "Overall": "5.0", "Content": "This is a great camera.  I flyfish, I hike, I bike, I kayak, I even run in the rain.  This camera is my 4th \"Waterproof\" camera.  All of the others handled the wet, but picture quality was not great.  This one not only takes great pictures, it is easy to hold onto with one hand, which is sometimes necessary in all of the outdoor activities I engage in.  It's also very intuitive and easy to learn.  I would recommend this camera to anyone that spends time in the outdoors.", "Date": "July 15, 2013"}, {"Title": "great pocket camera", "Author": "Dan B", "ReviewID": "RDCEPE8A7L0O8", "Overall": "4.0", "Content": "I was tired of packing my DSLR for hikes and camping - and this camera has filled that void.  I'm using it mostly for taking snapshots while on the trail or ski hill.  Shockproof and waterproof give you piece of mind.  Electronic compass feature and GPS also lighten your load.  Picture quality is excellent.", "Date": "April 8, 2014"}, {"Title": "Can't use GPS because...", "Author": "G. Willard", "ReviewID": "R32NDBRCMQ614K", "Overall": "2.0", "Content": "The software to utilize the camera's GPS date crashes on my HP Pavilion laptop. It can't find the internet connection. It produces an error box full of script errors which I cannot stop or recover from.  The Registration part of the included software has NO problem finding the internet on my HP. Go figure.I did not like the image quality either.I have returned my WG-3  GPS after only one day of use.", "Date": "April 6, 2014"}, {"Title": "No GPS", "Author": "carson1975", "ReviewID": "R2JS8EBXG2AQ5", "Overall": "4.0", "Content": "took a little while to get this I end up ordering the purple one too. cause I wanted to GPS version. I must have missed that this color doesn't come as GPS model. Lame!", "Date": "March 24, 2014"}, {"Title": "very pleased", "Author": "Eduardo Gibba", "ReviewID": "R1LOK6HX2ILQO", "Overall": "4.0", "Content": "Good purchase ! I bougth this camera for my son (8 years), and were to wet n'wild to test.We are very pleased, take a lot of photos in different modes, I prefer use 16Mb pixel for a good quality.I was surprised ! recommend !", "Date": "January 17, 2014"}, {"Title": "GREAT outdoor camera!!!", "Author": "Keri Hamilton", "ReviewID": "R39DBN59TSI7JJ", "Overall": "5.0", "Content": "Wanted a camera for my husband to take backpacking and hiking.  This camera is perfect!!  It is lightweight, waterproof, and can take a serious beating!!!  Takes great movies also, which wasn't something I was specifically looking for however is an option we use all the time now.  We LOVE it; exactly what were are looking for!!", "Date": "January 15, 2014"}, {"Title": "excellent", "Author": "FG", "ReviewID": "RNA4D3CHB9GN0", "Overall": "5.0", "Content": "I really like this product, the brand is excellent, I recommend it. Would you purchase this item. good price and quality", "Date": "January 15, 2014"}, {"Title": "Amazing Camera", "Author": "stary90", "ReviewID": "R1Z4SP2NJLH807", "Overall": "5.0", "Content": "It was what I was looking for, I just receive it, but the color is great, my favorite, just need to use it the see how does it work. The only bad is that this not coming with memory card. I  thought was included but it wasn't.", "Date": "December 15, 2013"}, {"Title": "Great!", "Author": "Tracy Townsend", "ReviewID": "R2GRCKZ1AC5VTH", "Overall": "5.0", "Content": "This camera works just as advertized. Better photo quality than my SLR. Disposable underwater cameras don't begin to compare. Great macros shot too! Worth every penny.", "Date": "September 27, 2013"}, {"Title": "good camera, rugged", "Author": "allen sim", "ReviewID": "RBO0R4GIUY4A4", "Overall": "4.0", "Content": "works great,  hard to focus in macro mode,  recommend using a tripod.The under water pictures look awesome! definately worth the $", "Date": "August 20, 2013"}, {"Title": "Excellent", "Author": "Janna H", "ReviewID": "RPTTDROBX4SHU", "Overall": "5.0", "Content": "This was an excellent purchase!  It is sturdy and has an appealing look.  The only issue I had was that the screen scratched a little so you will need a protector.  It got banged around a lot but kept on taking great pictures!", "Date": "August 15, 2013"}, {"Title": "Perfect for what I do", "Author": "Michael Barido", "ReviewID": "R3OKQUVKFNBZQS", "Overall": "5.0", "Content": "I do bridge inspections and I love the outdoors. This camera is perfect. No worries about dropping it into the water or on something hard. Very durable.", "Date": "July 23, 2013"}, {"Title": "Good Travel Camera", "Author": "Deborah", "ReviewID": "R3AX072QBRTOAM", "Overall": "5.0", "Content": "It's everything I was expecting. Going to Hawaii with the family and going to put this camera through it's paces.", "Date": "June 30, 2013"}, {"Title": "Great piece of gear.", "Author": "jeepjh", "ReviewID": "R2XWDH5MN3J0UK", "Overall": "5.0", "Content": "Has a powerful zoom although difficult to keep steady without tripod.  Still great function.  Takes great pics.  Bought it for my wife who really loves the look and feel.  Very tough and versatile and we are not afraid to take it kayaking, backpacking, or biking.  Still learning all the functions.", "Date": "May 6, 2013"}, {"Title": "Not what I expected!", "Author": "Janet \"J G\"", "ReviewID": "R3BZ0ZME6A1JFG", "Overall": "1.0", "Content": "I purchased this camera last year just before going on a snow skiing trip, I chose it because it was waterproof and shock resistant... and I had not skied in over ten up years, so falling down was inevitable!From day one, the photos have not been clear, no matter what setting I choose! The only time I get decent photos is when the lighting is perfect, like on a sunny Florida day!I have even read some of the manual trying to find the right sweet spot and haven't found it yet!  It's either over exposed, slow and moved, or just completely out of focus! I am not happy with these at all since I have done better with much cheaper cameras!Don't know if anyone out there has figured out how to solve my problem, or if I'm just missing something trivial!Right now, based on my experience, I just don't recommend it!", "Date": "April 9, 2014"}, {"Title": "Don't buy for the LED \"ring flash\" - useless more than 1\" away", "Author": "reluctant techie", "ReviewID": "R1F1Y56FTF3YGB", "Overall": "3.0", "Content": "Silly me thought that the ring of LED lights were as powerful as regular LEDs we all know and love. I was hoping it would provide a nice fill light for closeup shots but it is only for super close-up macro \"microscope\" mode where you place the lens on top of an object to take a close photo.Amazon accepted my return, I should have read the product info more closely. so beware...Those LED light on the front are so dim they don't light an image from more than an inch away.", "Date": "January 13, 2014"}, {"Title": "Only had it for a day, but loved it!", "Author": "Ash", "ReviewID": "R2HBNO7IUUFH77", "Overall": "4.0", "Content": "I really loved this camera. It took excellent underwater shots with great clarity. I took it on the river for a \"river float\" the day after I received it. I dropped it in some rapids, and that thing SANK like a rock. I tried to dive down after it, but couldn't find it with the dark color and I was being carried away by the rapids. If you are going to take in the water, definitely get a float wrist wrap.", "Date": "July 17, 2013"}, {"Title": "A camera, really?", "Author": "Jim Black", "ReviewID": "R3QV5PM4HAMQ4C", "Overall": "1.0", "Content": "After reading the reviews here on Amazon I purchased this camera expecting a good solid camera to take hiking. The camera is built solid and the software seems to be all that one would need to take pictures on the trail. But this thing takes awful pictures. Most pictures were over-exposed and out of focus. I tried for three days to make adjustments to the setting in order to get a decent photo. In actuality my iPhone takes better pictures. It is on it's way back to Amazon...", "Date": "February 1, 2014"}, {"Title": "HORRIBLE!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!", "Author": "Amazon Customer", "ReviewID": "R3FCQ8YHAE33WA", "Overall": "1.0", "Content": "Bought this for a once in a lifetime trip.  Worked for 5 minutes and stopped. Do not buy this at all!!!!!", "Date": "May 23, 2014"}, {"Title": "The earlier version was better", "Author": "Gringo", "ReviewID": "RE2F00QERFD6T", "Overall": "2.0", "Content": "I had the precursor to this camera and loved it.  It was light, slim, tough, inexpensive, and worked well.This one is not light, slim, and doesn't seem to work that well.  The ring of LEDs for macro is a gimmick with this lens.  This is not very competitive as a water proof point and shoot.  Look at the Nikon AW100 instead.", "Date": "April 2, 2014"}, {"Title": "like", "Author": "wang hongwei", "ReviewID": "R49YF9PZF7QLX", "Overall": "5.0", "Content": "I like it, and finally get what they want, it's just what I need, cheap and convenient transportation, like it very much。I like it, and finally get what they want, it's just what I need, cheap and convenient transportation, like it very much", "Date": "January 8, 2014"}, {"Title": "My favorite", "Author": "Frank R. Davisson", "ReviewID": "R1C2753T1YHQJX", "Overall": "5.0", "Content": "I have at least a half of dozen digital cameras, but this WG-3 is my favorite. It takes very good up close pictures and I like the fact that it's not btittle and easy to break.", "Date": "August 16, 2013"}, {"Title": "Seller very good, this camera not so", "Author": "Dennis M. Goodwin \"Mista Bumpy\"", "ReviewID": "R1E82DCFE2GN70", "Overall": "5.0", "Content": "Aloha!  I don't have anything to say about this camera, because I never got a chance to use it all that much - apparently the photo cell was bad from day one (it took defective pictures in low light and displayed those little rainbow lines around objects on the view screen.) and the zoom stopped working after a week or so.  I contacted the seller (PORTABLE GUY) and got return instructions by email.  Everything went well and my purchase money was credited to my account.  Nice service from this vendor.  The five star rating is for service only.  There is one thing, though, that this seller and others appear to require for their returns - ALL original packing, as well as all original components, even advertising fliers inserted in the packing for other products, and everything in good condition and appearance - seems to be the bottom line on all returns.  None others are considered, it looks like.  Now, this is understandable, esp. if a unit is repairable and has to be re-marketed as a refurb.  Here's the deal - if you're like me, you often toss all wrapping, or rip it down the middle in your mad, childish rush to get at your nifty purchase  I almost had to learn the hard way. Don't do it.  I saved my packing stuff because the box was so sturdy and I figured I could use it for something else.  I sure never anticipated a Pentax going west on me, and this is the first time it has happened.  Pentax usually makes good stuff.  Otherwise, I loved this camera, and some of the pics it did take were pretty decent.  Setup and controls are easy to use and this camera looks real strong.  I'm ordering another soon.  I'll do a review at that time.  Aloha!", "Date": "July 15, 2013"}, {"Title": "Everything is fine", "Author": "Alvydas Tamosiunas", "ReviewID": "R1JZMJH57W04PB", "Overall": "5.0", "Content": "Everything is fine. I like it. Thanks for the item, that was send on time. It has met my expectations.", "Date": "June 24, 2013"}, {"Title": "Great camera", "Author": "Bruno Gomes", "ReviewID": "RIBESMSU6GEU9", "Overall": "5.0", "Content": "It comes with lots of options and menus, but for those used DSLR is quite easy the adaptation.Just works.", "Date": "June 11, 2013"}, {"Title": "Waterproof...not so much on the older model! This one much better.", "Author": "Whitney \"Prime Fan\"", "ReviewID": "R27LXAMBLN09BM", "Overall": "5.0", "Content": "I was a huge fan of the first generation pentax underwater and used that for quite a few years with no issues.This cameras version 2 model...ate it the first time underwater.  A shame because the features on this camera were fantastic.  When I say underwater, I mean snorkeling...it was never at any sort of depth and to be honest, it was in the water for maybe one hour.  I returned the camera but likes the features so much I have just ordered the WG3 and I hope it gets a better review than this.Update June 19. ..this version three is AMAZING.  No water leakage issues...it works even better above ground.  I do not like the underwater setting on this or any other camera, but the visibility thanks to the large view finder is great!  The photos are great!  The speed is fantastic under most circumstances....even with it the GPS I found the battery life very good, and the settings very close to the settings since the first generation which made this a snap for me.I am thrilled with the improvements on this 3rd generation ..purple..and yup, it's at attention getter.  My only advice..if you are going to use it in the water, get a floating strap, This thing is heavy , but in a good way because it's so rugged!  What an improvement from the 2nd generation!", "Date": "May 28, 2013"}, {"Title": "Pentax", "Author": "Venyamin Fradlin", "ReviewID": "R1JK2LKRZRFDAH", "Overall": "5.0", "Content": "It wass good as long as it last. Lost it in a midle of Costa Rica.Maybe should get a new one.", "Date": "April 1, 2014"}, {"Title": "Poor image Quality", "Author": "Johnny Hung", "ReviewID": "R2UVQG9END1GCC", "Overall": "2.0", "Content": "This is my first Amazon product review and the first product I'd ever returned after years of purchases from Amazon.  I am compelled to write this because of my great disappointment in the camera's performance.Within 5 minute on opening the Pentax WG-3 GPS, I had reboxed it and looked into the amazon return process at no fault of the seller or Amazon. Cameta Camera shipped it fast.First issue I noticed was that the focus cycled full range at every shot making the click to shot acquisition time excessive (1-2s).  This will not work for action shots or taking shots with children.  Even though the subject was in focus or very close to focus in the viewfinder, however, the camera lens mechanism would go through its full cycle from end to end trying to focus.  That is not acceptable in today's camera technology.  My cheap smart phone focus and shoot faster than this camera, which is not saying a lot.The few images I took in the few auto modes yielded grainy images with dull colors. My 6 year old cheap point and shoot Sony had better image quality and shot faster.I really had high hopes for this camera because of the F2.0 lens, QI charging option, and other great features.  I think I will wait and revisit the Olympus TG-2 or the Nikon AW 110.", "Date": "April 1, 2013"}, {"Title": "Never got to try it", "Author": "Holly Suitor", "ReviewID": "R22GFV5B3YE6T3", "Overall": "1.0", "Content": "not sure where the problem was but the camera didn't charge -- it could have just been a bad battery but didn't have the time to figure it out.", "Date": "June 30, 2013"}, {"Title": "NOT GPS unit", "Author": "TEH \"tehschhi\"", "ReviewID": "R15CN4X3A6LS0C", "Overall": "3.0", "Content": "This camera is easily confused with identical Pentad Optio's because the model number is the same (WG-3), but this one does not have GPS.  In every other way, it is identical to the WG-3 with GPS.  I returned it because I thought I was buying the GPS model...which I then ordered.  It is fantastic", "Date": "June 20, 2013"}], "ProductInfo": {"Price": "$349.95", "Features": "A backlit 16 megapixel sensor coupled with the new-generation imaging engine delivers a top sensitivity of ISO 6403\nFurther enhanced waterproof construction allows for depth of 45 feet\nTriple shake reduction with sensor shift shake reduction, shockproof for drops up to 6.5-Feet, cold resistant to 14 degrees F, dustproof\n3-Inch  LCD, HD 1080P video with h.264 compression @ 30fps\nGPS module for Geo tracking, built in compass, pressure/altitude/water depth gauges and wireless recharging capabilities", "Name": "Pentax Optio WG-3 GPS purple 16 MP Waterproof Digital Camera with 3-Inch LCD Screen (Purple)", "ImgURL": "http://ecx.images-amazon.com/images/I/511G64rk3hL._SX300_.jpg", "ProductID": "B00B728M5K"}}