{"Reviews": [{"Title": "So far so good.", "Author": "Ron", "ReviewID": "R2XRW5AO3GD16W", "Overall": "5.0", "Content": "I like this Song Digital Camera so for no problems at all so everybody for the money this works very well.", "Date": "January 20, 2014"}, {"Title": "Great camera, terrible \"kit\"", "Author": "John W.", "ReviewID": "R2AH4UUEJR24UO", "Overall": "4.0", "Content": "We have used digital cameras since 1999, and have only upgraded our point-and shoot twice.This camera has exceeded expectations, with its simplicity, ease od use, and long-lasting battery. The pictures are crisp, zoom powerful, and video clear and steady.  The \"no shake\" feature was very important and very effective, as we shoot a lot of on-the-go pictures of our pets and parties.The accessory kit was almost completely useless: the cleaning fluid leaked over the contents and ruined much of them.  Luckily, the memory card and tripod were unaffected by the leakage, but they can be purchased separately cheaper than this kit.I highly recommend the camera as a simple day-to-day take-along with lots of flexibility and versatility.I'd get a refund if I'd purchased the kit separately.", "Date": "January 14, 2014"}, {"Title": "Sony 16 MP Camera", "Author": "psl", "ReviewID": "R2VMB2Q4TY5MVN", "Overall": "5.0", "Content": "Great deal, Excellent picture quality, Good Battery Life, first time trying included tripod which works very well, and is very compact .", "Date": "January 6, 2014"}, {"Title": "Sony camera", "Author": "Karen Bog", "ReviewID": "R13QFFKM0VG5VE", "Overall": "5.0", "Content": "it was a gift for my daughter and she loved it. It was just what she wanted. Made her a happy camper", "Date": "January 3, 2014"}, {"Title": "Excelent deal", "Author": "Rolando E. Cruz", "ReviewID": "R1YUJEXMODJ7YT", "Overall": "5.0", "Content": "The best purshase, good deal, easy share by memory card, and great manteinance goals, I recomend this item for everyone", "Date": "December 30, 2013"}], "ProductInfo": {"Price": "$133.00", "Features": "Sony DSC-W710/B 16 MP Digital Camera with 2.7-Inch LCD (Black)\nSony 16GB SDHC Class 10 SD Memory Card\nSony Case Black\nFlexible Tripod, Memory Card Wallet, 3pc Cleaning Kit & 3 Screen Protectors", "Name": "Sony DSC-W710/B 16 MP Digital Camera with 2.7-Inch LCD (Black) + Sony 16GB Memory Card + Sony Case Black + Accessory Kit", "ImgURL": "http://ecx.images-amazon.com/images/I/51xxKKSVcuL._SY300_.jpg", "ProductID": "B00BHZOXFA"}}