{"Reviews": [{"Title": "Great camera for the price.", "Author": "DGator", "ReviewID": "RE0EWQ1Z9RY3X", "Overall": "5.0", "Content": "Samsung makes darn good devices and this camera is one of them. For a point and shoot camera the DV150 produces good crisp, sharp, clean pictures. It is easy to use and easy to navigate the menu. The video this camera takes is also clean and crisp. Even though it shoots 720p resolution you will not be dis appointed. As with any point and shoot camera lighting is important when using the video function. The lower the lighting the \"grainier\" the video will look. Also make sure you get a Class 10 card for your camera. Why you ask well it is simple, you want a card that has a fast \"read/write\" speed so your video and pictures will come out as good as possible. Some people may say you do not need a class 10 but they are wrong!! I use Sandisc cards myself do not buy a \"no name\" card I know that they are cheaper but you get what you pay for. So stick with a brand name class 10 card you will not regret it. Overall this point and shoot camera is a great buy, is it the best? no, but you will be pleased with this camera. Looking for a Vlogging camera? This camera will do the job! As mentioned before it records up to 720p and has a small LCD screen on the front to help you get into frame. Great camera at a great price.", "Date": "July 21, 2013"}, {"Title": "This Tiny Camera Is A Titan In Disguise", "Author": "charger", "ReviewID": "R33T0M8LNZZG0G", "Overall": "5.0", "Content": "I bought this camera because I wanted an easy to use Point and Shoot Digital Camera. I relied on the many reviews to make my purchase. There were many  positive reviews, and the only negative review that appeared many times was this camera does not take take great Flash pictures, and there is a lag with the use of the Flash. Well Out of many flash pics that I took, I had one, but all of my flash pics came out great. I have not learned how to use all of the functions like the WiFi that will send a pic to a nearby Smartphone, but for the price I paid, I am well pleased and satisfied. This camera came with no driver for the PC because it doesn't need one. This is great because many times when you buy a new P.C. you will have lost the Driver Disk. We really liked the front screen that lets you get those personal portrait shots with looking stupid, or using a mirror. The little animated video in the front screen is just an added touch for capturing the excitement of young children. This was a good purchase.", "Date": "July 28, 2013"}, {"Title": "I love it ..", "Author": "dp102", "ReviewID": "R1WZIC1ZP1ZQKD", "Overall": "5.0", "Content": "The camera is marvelous and easy to use, I also have a Galaxy S3 phone and Tab 2 tablet and it all integrates together wonderfully.  It has become my primary kick around camera, keeping it with me all the time in my backpack brief case etc.", "Date": "March 12, 2013"}, {"Title": "Love it", "Author": "Sherrin", "ReviewID": "R1UE4RRC2XBO9G", "Overall": "5.0", "Content": "So far, I love it.  It has LOTS of bells and whistles so I am still learning it.  Love that I can post directly online from the camera and if you like to take \"selfies\" this camera even does that.", "Date": "August 20, 2013"}, {"Title": "I like this little camera", "Author": "RT \"RapidCityMom\"", "ReviewID": "R2LVMGUIJ4UY6F", "Overall": "4.0", "Content": "This is a nice little camera for the price.  It has a lot of fun features such as diferent filters and frames you can put into your pictures, which is fun.  The photos come out clear and it has a fairly fast shutter speed in regular shooting mode.  I had no problem connecting to the internet or sending pictures to my phone and e-mail address.  I really like the live panoramic mode of this camera, it is by far the easiest panoramic picture mode I have used.  While it is true that it doesnt come with a lot of written instruction, I registered mine with Samsung when it arrived and they sent me the links to download the manual as well as to their tip and trouble shooting pages.  Also, the camera itself pretty much walks you through set up and what the different modes are.  It also notified me of a firmware update which I was able to easily download.  So far I am pretty impressed with this camera.  The only reason I didnt give it a 5 star rating is that the zoom is not the best.  Its okay, but I have a Fuji which has a much better zoom feature.", "Date": "November 12, 2013"}, {"Title": "I totally endorse Samsung Cameras", "Author": "Giselle", "ReviewID": "R1FHDQHZ0SJ2UW", "Overall": "5.0", "Content": "This is my 3rd Samsung Camera. My first camera was a Kodak Easy share and that was no competition for Samsung. I changed my first Samsung camera to upgrade to more MP and the second one was stolen. I did not hesitate to buy another Samsung Camera. The one that was stolen was also a dualview and I love that feature. That camera was extremely durable... It fell, it went through water and it WORKED!!! The battery life was awesome as well.... For all these reasons I bought another Samsung camera. And again I was not disappointed! It's pretty in purple, takes amazing pictures, EASY to use and it works on wifi networks for all social media!", "Date": "September 10, 2013"}, {"Title": "So fun I have two more!", "Author": "Kelly Wolfe", "ReviewID": "R22WD78ZVGUKMT", "Overall": "5.0", "Content": "This was the first of the 3 Samsung Dual View cameras I have purchased.  It has great zoom, lots of fun scene features like panorama and frames, and is wifi ready. On a recent trip to NYC, even though I was lugging around my big dslr, it was this camera we reached for time after time.  My daughter and I could easily put ourselves into all of the great landmark shots because of the front screen, which is awesome for selfies.  Not sure if this is the proper venue for this comment, but I will never order from Worldwide Distributors again.  Two terrible experiences on this camera order resulted in having to reorder from a different seller through Amazon.", "Date": "September 9, 2013"}, {"Title": "Works great, takes a little getting used to.", "Author": "eriesisgod", "ReviewID": "R2B8G66M9RGQ9N", "Overall": "4.0", "Content": "Once you figure out the menu and options you will be much happier with it. Does everything it said it would, don't expect a DSLR. Motion picture took me awhile to figure out. Read the manual!!!", "Date": "April 6, 2013"}, {"Title": "Great little camer!!!", "Author": "A. Junco", "ReviewID": "R2I9496ARPO0W", "Overall": "5.0", "Content": "Have had the camera for a month or so, and I love it.  Had a little technical issues with the last software upgrade and the camera is a bit fussy about what ad card brand, speed you use but once you figure it all out, took me about 4 day of trial and error, this is a very feature packed camera.Image quality: very good.  About what you would expect from a simple point and shoot pocket camer 16.2 mp on the small CMOS is good not great.Speed of operation: as expected.  Takes about 2-3 sec to fire up from off to being able to take first picture.Focus:  not bad not fully accurate.  Have taken some fuzzy pics when in full auto mode.  But you can adjust a lot of features in the menu screens.Wifi:  works great!! Upload to Facebook no problem, transfer pictures to iPad iPhone no problem, back up to computer, no problem.Features:  this camera is relatively easy to use and has so many features I can not list them and for under a hundred bucks this camera is totally worth it!!!!I would gladly recommend to anyone with a little tech knowledge and patience.", "Date": "July 15, 2013"}, {"Title": "Great camera", "Author": "Steve", "ReviewID": "R1T03DAP7M46NA", "Overall": "5.0", "Content": "Great lightweight point and shoot camera. Still learning all the bells and whistles. Took some great pictures the other day, and with the Samsung start camera app. was able to transfer pictures to my smart phone and post them to Facebook. There are lots of options, panorama mode is cool. Highly recommended.", "Date": "October 5, 2013"}, {"Title": "Unlimited WiFi & Front LCD HD Screen", "Author": "alex 3D", "ReviewID": "R1RQYAPI86T2VW", "Overall": "5.0", "Content": "Based on my personal experience, pairing this awesome camera with my iPad 3 and my desktop computer, its WiFi feature is amazing.Pros:#1. Its built-in wifi feature is independent, which means no internet connection is needed to have the wifi set up between the camera and a wifi enabled desktop / laptop computer, and wifi enabled ios / android devices, and wifi enable portable hard drives.#2. Follow provided instruction, it is pretty easy to set up wifi connection between the camera and my ipad 3. As every picture is taken, it is automatically upload to my wifi enabled device, which is my ipad 3 without any need for an internet signal.#3. The switchable front and back LCD screens are awesome, both screens can be on at the same time.#4. There are many high end features built-in with this camera, many adjustments can be selected for own preference.#5. It is inexpensive.#6. Micro memory card slot is available for any Micro SDHC cards, up to 64 GB. I am pairing it with a class-10 16 GB extreme micro SDHC card.#7. The design is pretty and comfy for my hands.#8. No need to look at those super expensive eye-fi cards any more.Cons:#1. As the product description indicates, it is not waterproof, nor water resistant.#2. It does not come with a free external memory card. Buy your own. They are inexpensive at all.Enjoy.", "Date": "January 29, 2014"}, {"Title": "great pictures", "Author": "david", "ReviewID": "R2U1HYY2Q99ZLA", "Overall": "4.0", "Content": "just received this camera and so far so good.takes great pictures and zooms in nicely.only draw back to me  is it very small but very portable i guess .", "Date": "June 27, 2013"}, {"Title": "Oh so easy", "Author": "BostonBoy", "ReviewID": "R1UH4Y8TY1MMZR", "Overall": "5.0", "Content": "I have wanted a new camera only to have wifi capability which my old camera did not. I looked at reviews for the new wifi version of my old camera but they did not sound positive - hard to get wifi to connect. The reviews for this camera did and so far, I am finding this true. I have spend just about 15 minutes exploring the basics without a manual and everything is so intuitive. I was able to successfully link to my home wifi network and email myself a test picture. It also presents a list of photo storage services which I plan to explore. Will report back to confirm uploading to one of these services is also easy. Thanks Samsung! (I bought the kit version of this on amazon but the camera is the same)", "Date": "August 25, 2013"}, {"Title": "Just what I wanted!", "Author": "Andreinac13 \"Andreina C.\"", "ReviewID": "R7V7YZW4TR7Y4", "Overall": "5.0", "Content": "This camera is amazing! I like that it has 2 screens. The front one is good for selfies. I like that is compact.  I like that it has a lot of features like frames and backgrounds and stuff that I haven't used yet, but I can't wait to use it. I like that it has wi-fi connection and you can post pics. online or send it on a e-mail right away.I like the fact that it comes with a electrical plug, so you have the choice of charging it on your PC or the wall.", "Date": "August 12, 2013"}, {"Title": "Awesome Christmas gift and very budget friendly!!", "Author": "Just Another Modest Mom", "ReviewID": "R1FPC3FJI0OS4M", "Overall": "5.0", "Content": "I LOVE this camera! My husband bought it as a Christmas gift for me, the pictures are absolutely fantastic and very clear. I was using a cell phone before this point, after my old camera died on me, and did not realize the damage I was doing to precious moments. I recently printed off a bunch of my photos captured by cell phone and was heart broken that they images were beyond unrecognizable. This camera is easy on the budget and great at it's job.Pros:Love that I can rotate and resize photos on the camera.I can send my photo to Facebook or Email by camera.Images are very clear and crisp.Great price.Comes in a variety of colors and purple is a lovely color on this camera.Cons:The only con I had was that it's a micro card and I have trouble keeping up with just the bigger cards. Other than that, I haven't found a con with this product.", "Date": "December 8, 2013"}, {"Title": "just what I wanted", "Author": "bahiamar", "ReviewID": "R1AX99C3SDB7MF", "Overall": "5.0", "Content": "Just got the item and it was so easy to use. It 's user friendly. Gets great photos and videos. I would give this as future gifts to family and friends.", "Date": "September 27, 2013"}, {"Title": "awesome camera", "Author": "Kaitlin McNary", "ReviewID": "R1BI20FXGRPA3F", "Overall": "5.0", "Content": "I love all the cool features it has and the color. Its very fun and easy to use. i love it!", "Date": "September 24, 2013"}, {"Title": "Poor Quality Pictures when using Zoom", "Author": "J McKee", "ReviewID": "R1QWJ5GWJZF62G", "Overall": "1.0", "Content": "Camera takes good pictures when it is used without zoom and does not have the ability to adequately compensate for camera shake. I have never had a camera that was so sensitive when taking long distance pictures. I don't like it at all.", "Date": "January 1, 2014"}, {"Title": "Wouldn't buy again", "Author": "L. Sunday", "ReviewID": "R35XEYKOOZQ0AD", "Overall": "2.0", "Content": "I picked this camera for the wifi & point & shoot capabilities.  I upgraded from an older Kodak that just won't hold a charge.  I find myself using the Kodak, because most of my pictures are of children.  The Samsung does not take good pictures of children who won't sit still, or action shots, or anything with possible movement.  It has a lot of features I never use, but if you like that kind of thing & take pictures of unmoving things this camera is ok.", "Date": "November 17, 2013"}, {"Title": "Excellent product", "Author": "Carlos Lara", "ReviewID": "R1EDK0V7AR01OW", "Overall": "5.0", "Content": "the quality is very good, i love this camera is very easy to use and the best is the dual LCD", "Date": "February 23, 2014"}, {"Title": "great camera", "Author": "Jennifer Beismann", "ReviewID": "R1W7W7369YNS1T", "Overall": "5.0", "Content": "compact and has lots of features. took great pics of my kids sledding. going to be keeping this camera in my purse.", "Date": "January 30, 2014"}, {"Title": "GREAT CAMERA", "Author": "terri l. selvey", "ReviewID": "R33OAWZMI8PSA", "Overall": "4.0", "Content": "I agree 100% with the person who said the instructions that come with this camera are horrible.  I, too, have spent about a week off and on trying to teach myself how to work this camera to send photos out.  I have finally figured it out and it works like a charm and I LOVE it.  The reason I only gave 4 stars is because you have to kind of be a technowizard to figure it out.  I still haven't figured out the front display, it totally eludes me, but I hope I will stumble onto it one day, probably by accident.  Nice sharp pictures though and lightweight.  Slips easily into a pocket or a purse.  Picture quality probably compares to my Sony, which is bigger and heavier so I don't carry it with me much.", "Date": "September 22, 2013"}, {"Title": "NOT WHAT I EXPECTED", "Author": "Ticky85", "ReviewID": "R29724HSR88WMH", "Overall": "1.0", "Content": "I read the reviews before buying this camera and for the most part it seemed like a decent point and shoot camera.I am VERY disappointed.I used to own a little Canon Powershot, bought back in 2006, and only 5mp... I had hoped that this camera would at least be on par with my older Canon (which sadly went through the washing machine...hence needing a new one)Firstly, the wifi function on this camera is pretty much useless... It's not worth the frustration trying to get it to work.It is suppose to auto sync to my laptop to upload photo's whenever it's on and connected to the wifi... it never does that.It's suppose to allow me to post pics directly to FB or email etc... half the time it just won't send them, despite being connected to the wifi in my home.I got over the lack of wifi use and decided that it would still do the job as the 'diaper bag camera' I had bought it for if it works as a good point and shoot camera... BUT, it doesn't...I just about NEVER have clear images... image stabilization clearly is not effective and even if my subject is standing dead still, and right in front of me the pictures still have NOTHING on the quality of my old little Canon camera. Most of the time my images are poor quality and slightly or very blurry!It's almost useless for the purpose for which I need it...I'm completely frustrated and disappointed.. what a waste of money.Next time I'll stick to Canon!", "Date": "April 9, 2014"}, {"Title": "More like 3 1/2 stars", "Author": "Amazon Customer \"Preschool Teacher\"", "ReviewID": "R24NTAOI5NFO8F", "Overall": "3.0", "Content": "I was so excited at the idea of a camera with the ability to connect to WiFi. We are desperately trying to avoid buying a smart phone for our young teen and thought this would be the perfect cure! We were disappointed though, to find it was unable to connect with instagram, which was basically why she wanted a smart phone (and we wanted the WiFi camera) in the first place. It connected to Facebook like a dream, as well as to my Samsung galaxy phone (why this is helpful, I don't know).My favorite feature of the phone (besides the WiFi capability) is the little screen on the front. It's not only great for \"selfies\", but it also has attention grabbers geared for taking little one's photos. A cute little cartoon will come on the screen in front encouraging them to look at the camera.", "Date": "February 9, 2014"}, {"Title": "Great camera for the money.", "Author": "HBHoops \"Former Hard-Charger\"", "ReviewID": "R3JR2XK6N00BYK", "Overall": "4.0", "Content": "There are a lot of things I like about this camera: the size, the ease of use, the battery life, the myriad of settings that let you take some pretty cool pictures (especially the panorama mode and miniature setting), and the front facing LCD for self-portraits.  The picture quality is decent, not great, not bad.  In \"Smart\" mode, the pictures seem to be a little washed out and it does seem fairly easy to take a blurry picture, but still, the pictures are decent.One of the best things about the camera is backing up the pictures.  You can back them up wirelessly to your PC, post them to Facebook or YouTube, back them up to SkyDrive, send them in emails, pretty nice features for a camera at this price-point.", "Date": "October 27, 2013"}, {"Title": "very nice camera", "Author": "tara", "ReviewID": "R3N0CLUMSO1OT1", "Overall": "5.0", "Content": "I love the many features of this camera, including the many options of taking a picture. The price and quality of this camera would be hard to beat.", "Date": "August 12, 2013"}, {"Title": "Just alright...", "Author": "123Lexi", "ReviewID": "R2HKIYOJKC216Z", "Overall": "3.0", "Content": "The pictures are often blurry. I have a 3 year old and I will get a few good pictures out of many that were taken. You have to be very still when taking pictures and whatever you're taking a picture of should be still as well.The wifi function is good though. You download an app to your phone or tablet, go to the app on the camera, connect to the camera on your phone/tablet, and then select your pictures from the camera. If you want your pictures to be sent from your camera to your device you have to set that up each time. It does not automatically happen like some reviewers seem to have expected.If you do not fully charge the battery every time you charge it the lens will get stuck and you cannot do anything on the camera. Not even get your pictures. You need to fully charge it, then remove the battery and put it back in, then turn it in.", "Date": "May 12, 2014"}, {"Title": "Samsung DV150F 16.2MP Smart Digital Camera", "Author": "Tracy Rager", "ReviewID": "R2BOY060FVQ4O", "Overall": "5.0", "Content": "Love this camera!  It's very small, so I can carry it anywhere at any time, w/out it feeling like a burden.  Takes beautiful, crisp photos and the extras on this camera are wonderful.  It's amazing that a camera this small has so many features.  Great camera and great transaction!", "Date": "May 4, 2014"}, {"Title": "Nice Camera", "Author": "Giselle Benitez \"Giselle\"", "ReviewID": "RE1YV0KE4EIX", "Overall": "5.0", "Content": "This camera is perfect for me because I dont really need a camera that takes really good quality photos. The quality is decent and I love that I can take pictures of myself without chopping my head out of the picture. Super handy, I love it.", "Date": "May 1, 2014"}, {"Title": "Was very happy with the product until the zoom lens froze and locked up the camera interface.", "Author": "Ray T", "ReviewID": "RPOJLB8UZJN8D", "Overall": "3.0", "Content": "I was very happy with this camera when it first arrived.  It took amazing pictures and offered a suite of features that couldn't be beat for the price.  My rating for the camera for the first month I owned it would have been 5 stars.But on week 5, after having only been used on two occasions to take about 50 pictures, the zoom lens froze in the extended position which then locked up the interface.  Once that occurred, the camera was a dead stick and couldn't be used at all.  My only option was to pack it up and ship it at my expense back to Samsung for a warranty repair.  At the moment, I'm waiting for them to ship it back.The camera was never dropped, dinged, or put under any adverse conditions at all.  It arrived, I used it for two occasions without it ever leaving the house, and then it was placed back in the hard sided storage case that I purchased separately.I was disappointed that the camera hardware failed so quickly under such light use.  I really hope this was just a rare manufacturing defect and not an indication of the overall quality of the item.", "Date": "April 29, 2014"}, {"Title": "Great Camera", "Author": "Darcy", "ReviewID": "R1V90GFCGYGJLX", "Overall": "5.0", "Content": "This is a great little camera.  Compact so it fits easily into a pocket or purse, easy to use, takes good shots, has good battery life.", "Date": "April 20, 2014"}, {"Title": "Fabulous", "Author": "LETICIA MACHADO", "ReviewID": "R1JZO5EYP22DLR", "Overall": "5.0", "Content": "I'm completely satisfied with this camera! It has a great resolution and the screen in the front is perfect for selfies. Totally worth it!", "Date": "April 14, 2014"}, {"Title": "great camera", "Author": "Jasmine P", "ReviewID": "ROSZ055QRTEZ1", "Overall": "5.0", "Content": "Bought this camera for a European vacation, and it delivered well, took execellent selfies, was easy to switch from pics to video, easy to carry being small. The features are awesome particularly the share wi-fi feature. Only two cons. It doesn't save my email address so I have to enter it every time I send a pic and it doesn't allow me to label my pics when posting them on facebook.", "Date": "April 11, 2014"}, {"Title": "love", "Author": "sharon", "ReviewID": "R2X16GUKIZD2S9", "Overall": "5.0", "Content": "We love this camera, all its functions are great. Still learning everything on it. LOVE that I can send straight to facebook or email.", "Date": "April 2, 2014"}, {"Title": "I LOVE IT", "Author": "paulorojas", "ReviewID": "R37V496815ME13", "Overall": "5.0", "Content": "THE SERVICE OF AMAZON IS EXCELLENT, FAST, SECURE, THE PRODUCT IS ALL RIGTH, MODERN, HIGH TECNOLOGY THE PRICE IS CORRECT. I RECOMENDED FOR ALL . GOOD SERVICE", "Date": "March 8, 2014"}, {"Title": "great little camera", "Author": "Kerri", "ReviewID": "R1X9JWLB73HEJX", "Overall": "5.0", "Content": "great camera, awesome featurs, and the front facing screen is super useful! I cant wait to use this on my vacation over memorial day!", "Date": "February 24, 2014"}, {"Title": "Excellent", "Author": "Ana Techera", "ReviewID": "R26883DD90SXMH", "Overall": "5.0", "Content": "Love the color!! The photos taken are excellent quality!! I trully recommended.The only inconvinient was the weather because the delivery was delayed due a snow storm", "Date": "February 22, 2014"}, {"Title": "Great camera, great value", "Author": "Amazon Customer", "ReviewID": "RTSOZVJTHEY29", "Overall": "5.0", "Content": "I got this camera as a gift to carry on distance runs. Very compact and light weight. It takes great pictures and the front facing camera makes it super simple to take great self pics!", "Date": "February 20, 2014"}, {"Title": "SAMSUNG", "Author": "Kelly & Matt Janssen", "ReviewID": "R3PU5KV7R4V9TM", "Overall": "5.0", "Content": "The brand name says it all, its a samsung ..... love it tne direct link is awesome love tbe quality", "Date": "February 18, 2014"}, {"Title": "nice camera!", "Author": "Corrie", "ReviewID": "R174PUCBWQDSNC", "Overall": "5.0", "Content": "i actually really like this camera. I'm using it mainly for a college photography class, but it is a great camera, easy to use, with LOTS of extra built in features. although i don't use the front facing camera as much as i thought i would, its still a cool feature to say i have! I'm very happy with this purchase!", "Date": "February 16, 2014"}, {"Title": "Nice Camera", "Author": "Luis Molina", "ReviewID": "R2B2MGNA7ML9N2", "Overall": "5.0", "Content": "It is a very nice camera, light, do the job. I like the doble screen, it is very helpful, when I just want to take a picture of myself.", "Date": "February 13, 2014"}, {"Title": "Not Impressed", "Author": "stormi0611 \"stormi0611\"", "ReviewID": "RK2674B8ALK0O", "Overall": "2.0", "Content": "I had been wanting this camera for years, before getting my smart phone, because of the dual camera and wifi features.  I bought it when it was on sale on Amazon and was really excited about getting it.  Opening the package I was very pleased with the small size of the camera, and the light weight.  But the first thing I didn't like about the camera was the zoom feature.  Instead of buttons it was a tiny lever on the shutter button.  My fingers are pretty small and it was hard for me to work it - I can't imagine it would be easier for anyone with \"normal\" sized fingers.  I was willing to let that issue go if the picture quality blew me away, but instead it was horrible.  Pictures were grainy and dark no matter which setting I used.  Were they completely horrible?  No.  But when my 6 year old Sony Cybershot camera and my iPhone take better pictures than a brand new camera I question why I even bought it.  I was going to replace my Sony with this, but instead returned it.  I'm very disappointed about it because I had wanted this little camera so long specifically for the dual camera and wifi.  But I'll just stick with my iPhone whenever I want to take pictures and use those features.", "Date": "February 13, 2014"}, {"Title": "Tons of features", "Author": "Nesha Dickerson", "ReviewID": "R28ED5LZ7L5DMU", "Overall": "5.0", "Content": "Gave this camera as a Christmas gift. It takes wonderful pictures and has tons of features for a \"lower end\" device. I plan on ordering another for myself.", "Date": "February 11, 2014"}, {"Title": "Awesome camera", "Author": "SSmith", "ReviewID": "R2110435T4XJ7M", "Overall": "5.0", "Content": "I love all the features, especially the front facing screen for selfies. It takes great pictures and is very user friendly with all it's features.", "Date": "February 11, 2014"}, {"Title": "Good camera for the price", "Author": "Lynn Gates", "ReviewID": "RHFCC8CCSER2Q", "Overall": "4.0", "Content": "Camera came in the color I selected and was perfect. The camera itself is very, very small. Much smaller than expected, but takes great pictures and offers a lot of bells and whistles. For the price, you get more than you would expect.", "Date": "February 7, 2014"}, {"Title": "Awesome", "Author": "Nikki", "ReviewID": "R1QW623P96TII5", "Overall": "5.0", "Content": "I bought this as a gift for my 13 year old daughter...she loves taking pictures and now takes them more than ever!!!", "Date": "February 6, 2014"}, {"Title": "Good value", "Author": "TJ", "ReviewID": "RHNPBSZVDKWCO", "Overall": "5.0", "Content": "My daughters first camera and she loves it, It is just like mine in many ways but more cost efficient.", "Date": "January 28, 2014"}, {"Title": "WOW!!!", "Author": "Mychael Rodriguez", "ReviewID": "R1YAP53XJ5NSZ2", "Overall": "5.0", "Content": "The best camera for this price. I am truly amazed with the DV150F! The easy share function on the DV150F works really well and really fast.", "Date": "January 27, 2014"}, {"Title": "Brand name for low price", "Author": "PinchiRichi \"fufurufu\"", "ReviewID": "R4Z267ERM0Y6G", "Overall": "5.0", "Content": "A fantastic buy for a gift, next buy it will be for me.I will recommended to everyone looking for quality at bargain price", "Date": "January 25, 2014"}, {"Title": "Great camera", "Author": "Jeremiah Price", "ReviewID": "R2X4PPAGOYZDGF", "Overall": "5.0", "Content": "Great camera. This is my second one. I had the first generation and this one is even better. The price is normally $200-299", "Date": "January 19, 2014"}, {"Title": "Fun features", "Author": "kat", "ReviewID": "RZA08VHLDO184", "Overall": "3.0", "Content": "the photos aren't great but the features make it worth keeping. the selfie-mode, the kids-mode, and the fact that i can upload these to my phone or internet immediately come in handy", "Date": "January 15, 2014"}, {"Title": "small, compact camera", "Author": "Michelle Nyquist", "ReviewID": "R1YARRG5A3GJDP", "Overall": "5.0", "Content": "I love that this is a small camera with a lot of features. I love the wifi ability and it takes great pictures. I love the front facing camera. I got this as a supplement for my DSLR when I dont feel like lugging that around this is my go-to small camera", "Date": "January 14, 2014"}, {"Title": "Awesome little point and shoot!", "Author": "Cassie Keel", "ReviewID": "RZ6P68201D1VC", "Overall": "5.0", "Content": "First, let me say that I have had a ton of point and shoot cameras. I try to keep one in my purse, just in case. I have been disappointed with my last 2 cameras as they have had issues with blurry pictures or lag between shots.This camera is under $100...and has really impressed me! Great shots...indoors and outdoors. Night photos also turn out surprisingly well! There are also many neat features. The front LCD screen is nice...you can make sure everything you want is in the shot! There is not an ungodly lag between pictures (major plus).I love this little camera! Awesome, crisp pictures from a lightweight camera...it is only cheap in price not quality.And unless you buy the bundle, you do need to purchase a memory card. But even with that additional expense...still a great deal!", "Date": "December 23, 2013"}, {"Title": "So excited!", "Author": "Cheers and Whatnot!", "ReviewID": "R1WMA5ZXX7CSZI", "Overall": "5.0", "Content": "I wanted to get my lady a nice camera for Christmas, she's only been asking for one for the last two years, but the one I found wasn't quite as nice as I was hoping for. Then I got lucky and caught this beauty on sale for half it's normal price, putting it squarely in my price range. I can't wait for her to open it!", "Date": "December 8, 2013"}, {"Title": "camera review", "Author": "lovlylizzy", "ReviewID": "R3AQAKZFDR773U", "Overall": "4.0", "Content": "the camera is really nice but the lens doesn't like to open all the way. that is ok tho I know how to get it to work.", "Date": "December 7, 2013"}, {"Title": "It's great!", "Author": "Kevin D. Finneran \"Vernon Writer\"", "ReviewID": "R2NPVYABVQMKRX", "Overall": "5.0", "Content": "It's a nice small size, takes great pics, the dual view is awesome...I'm just an amateur looking to take fun pics, so it's great for me.  I also dig the ability to upload right to facebook.", "Date": "August 24, 2013"}, {"Title": "Good Quality Pictures(Review from Guatemala)", "Author": "Brian Ramirez", "ReviewID": "R430LJ8FT3SAS", "Overall": "5.0", "Content": "So far this camera has taken good quality pictures.  In day but in dark rooms, the pictures are a little dark.  However just with adjusting brightness, this is resolved.  The video recording option is good and video is good as well.  When enabling the Wi-Fi connectivity you can download the app from Play Store/App Store in your smartphone and when just finishing taking the picture, it immediately send it to your smartphone.  The only bad thing of this feature is that you can't take another picture until it finishes sending the picture you have taken to your phone. Overall this is a good product and I have nothing relevant against it.  Also it has panorama mode, and the front LCD Screen is an awesome feature.  There are many other features on this camera that makes it great.Review from Guatemala", "Date": "July 26, 2013"}, {"Title": "DV150F VS DV300F", "Author": "Just Me \"Customer\"", "ReviewID": "R1BPCA42VR8209", "Overall": "5.0", "Content": "Initially I bought the DV300f and it broke within days of receiving it. I sent it back and got this one instead. Now, I've only had this one for a day...so hopefully it doesn't break on me! If so I'll be changing my review!First of all, this camera seems sturdier then the DV300f. The Wifi connectivity is much better in this model, so emailing and uploading pictures to Facebook is much better. In the Dv300f the wifi is hit or miss....which is really strange. This one has all the options, plus some as the Dv300f. The beauty palette is a fun feature to have too! I think the only option it doesn't have that the dv300f does, is the funny face app that warps your face. You really don't need that anyway!It's a fun little camera! I'm glad my dv300f broke now, as I like this one much more!", "Date": "April 6, 2013"}, {"Title": "Small but mighty", "Author": "Gretchen Collins", "ReviewID": "R35MNGADJ4TYPY", "Overall": "4.0", "Content": "I have just started using my new camera.  There is a lot it can do and a lot to learn.  Going to Europe this summer so it will get a lot of use.", "Date": "June 12, 2013"}, {"Title": "This camera is so fun!", "Author": "Kelly Wolfe", "ReviewID": "RD2SE1GL9IHGT", "Overall": "5.0", "Content": "I've bought three of these camera because of how fun they are to use.  The front screen for multi-person selfies is great, and the different scene options like panoramic and fun frames make every shot different.  I originally bought one for my daughter, thinking that the wifi would make posting pics quick and easy, but actually none of us have hooked up the wifi on our cameras, yet.The photos print beautifully.", "Date": "September 4, 2013"}, {"Title": "WORKS", "Author": "o anderson", "ReviewID": "RHJPB4F549HTB", "Overall": "4.0", "Content": "This Cam is pretty cool I went to a wedding and I was able to take pictures and email that to Familiy and friends right away.", "Date": "August 13, 2013"}, {"Title": "Great for the size and price", "Author": "Fry Boy", "ReviewID": "R3S6U2SW9NZ8IH", "Overall": "4.0", "Content": "Takes great pictures outside, particularly when it's sunny.  Indoors, however, there's the customary point-and-shoot flash/exposure lag, which typically results in blurry pictures.  The camera is quite slim and a serviceable alterative to my large Canon digital SLR (EOS 20D).Due to the camera's small size, I found it a little challenging to zoom as quickly as I would have liked, mainly because my fingers were all jammed together, but that's not a deal-killer, just something you have to get used to.The camera is super slim and readily fit in my cargo shorts' pocket without adding significant bulk.  Great for the family's trip to NYC.", "Date": "June 17, 2013"}, {"Title": "Meh", "Author": "Keldon", "ReviewID": "R11SP4KUWI0WNP", "Overall": "1.0", "Content": "Really takes terrible pictures. I've had a lot of cameras. This is one of the worse. It's a fun idea to have the screen in the front, but the pictures are washed out madness if you use the flash or blurry blobs if you don't. You choose. It's hard to get a decent picture.", "Date": "March 29, 2014"}, {"Title": "Super mini-camera!", "Author": "Suzee Sez \"Suzee\"", "ReviewID": "R1X3XYT2FTNPUW", "Overall": "5.0", "Content": "I've had 35mm and digital cameras for many, many years, and I was looking to buy a simple point & click for added versatility.  Since this one gave me the ability to take \"selfies\" too, I took a chance and bought it.  I was blown away by its performance!  Took it on my last vacation and it actually produced better results in low-light situations than my high-priced digital camera.  For example, I took an interior picture of a five story atrium at night and it faithfully captured all the intricate details of the ceiling.  Very happy I bought this camera!", "Date": "February 20, 2014"}, {"Title": "Malfunctioned during set-up. Returned it.", "Author": "Patty M \"Patty\"", "ReviewID": "R3AOHHF9TOIEYN", "Overall": "1.0", "Content": "I had high hopes for this camera and had ordered it to take a back-up for my trip to Nepal where I planned on bringing my larger digital SLR. Opening the box I was impressed with the size, weight and look of the camera. However, when setting it up the lens wouldn't go back in after shut-out. I repeatedly tried to get it to reset and kept getting the same error saying to contact the manufacturer if turning it on and off did not resolve the issue. If it was that finicky out of the box before even a single shot was taken, I decided it was going back. Returned to Amazon for a full refund. I would not recommend.", "Date": "January 21, 2014"}, {"Title": "This is the best camera ever!!!!!!!!!!!!!!!!!", "Author": "Teal Newman", "ReviewID": "R211681D4CQ4OO", "Overall": "5.0", "Content": "Not only is it small, and portable. It also takes great pictures, has wifi, and a bunch of other really awesome features. There is a feature that will put makeup on your face, a motion feature, a feature that erases pimples, a feature that shows a little cartoon on the front screen so your kids will look at the camera and smile. It does split screen, has photos filters, has framing options! And to top it off has a rechargeable battery. I love this camera. Amazing!!!!!!!", "Date": "December 17, 2013"}, {"Title": "most pics are blurry.", "Author": "DC SIR", "ReviewID": "R3F3G2EUX4LC76", "Overall": "1.0", "Content": "We can take 400 pics and maybe 3 or 4 are not complete blur.  We use for pictures of dogs in rescue. So we can understand if they are moving. But even the sleeping photos are blurry. My smartphone takes better pictures.", "Date": "December 1, 2013"}, {"Title": "A VERY cool camera!  Love it!", "Author": "jodeg", "ReviewID": "R3QBHB5CSHBEN6", "Overall": "5.0", "Content": "What a cool camera!  My last digital camera is about 20 years old, so it was time!  My old camera still works great, but I wanted some of the new features this camera provides.  The Wi-Fi feature is wonderful, no more connecting the camera to the computer to download my pictures.  This camera is small, compact and easy to use.  Has a ton of features -- I think it does everything except clean my house for me!!  Highly recommend!", "Date": "November 30, 2013"}, {"Title": "Great deal", "Author": "Jazz", "ReviewID": "RGY0I3Y3Z74JX", "Overall": "5.0", "Content": "Everywhere else wants more money for the same product. Saved about 50 bucks. Camera is perfect, sleek and small. Easy to use and front screen very convenient", "Date": "June 6, 2014"}, {"Title": "GREAT Camera for self photos", "Author": "Brian Sasser", "ReviewID": "RKSU2KT0U055P", "Overall": "5.0", "Content": "We are very happy that we bought this camera, especially for \"happy shots\".  ;-)  We have always liked to turn the camera around and take pictures of ourselves, and it's hard to get the position JUST RIGHT -- not anymore!  Now we can see exactly what the photo will look like.  You push a button on the top to activate the front screen, and the camera seems a little slower processing when the front screen is activated, so we don't have it active unless we are using that feature.It is simple to use, yet has great options and takes great pictures.  There is a \"Smart Auto\" setting, and then there are also more detailed \"scene\" settings for different situations.  We like to play with the settings to see what works best in the situation we are in.  A great zoom for \"faraway closeups\", but not at night.  The flash doesn't go very far, so you're best to take faraway photos without the flash at night because it takes better advantage of what light is REALLY there -- if you use the flash at night, it makes things farther away look darker than they really are.We are really happy with the camera, and would definitely recommend it.  It was just a LITTLE more expensive than others, but the front screen makes that well worth it to us.  :-)  Oh, and you can also set the timer to take a delay picture if you are taking it from farther away, and you could still have the front screen activated so you could see right away, who needs to move in or to the side, or stop putting \"bunny ears\" over someone else's head ;-)", "Date": "June 6, 2014"}, {"Title": "Poor Quality", "Author": "steve scavotto", "ReviewID": "R1LVX3NB3L31FT", "Overall": "1.0", "Content": "This Camera SUX.........That's an overstatement, It is truly a piece of crap. I can not stress enough !!!Three pictures and the zoom locked up. JUNK", "Date": "June 5, 2014"}, {"Title": "Outstanding Camera", "Author": "Oxnard \"Ox\"", "ReviewID": "RLH5UMEJLZ3N8", "Overall": "5.0", "Content": "I purchased this camera for my granddaughter who wants to learn out to take photographs.  She loved it and I recommend this to all of the children.", "Date": "June 4, 2014"}, {"Title": "lenses jammed first time on", "Author": "Tom Banks", "ReviewID": "R36RDE98BHPVWS", "Overall": "1.0", "Content": "Lenses jammed first time on. Removed battery and re-installed as instructed. Worked for 2 days then jammed and would not work.Amazon's return policy gets a 5 star.", "Date": "June 4, 2014"}, {"Title": "good camera", "Author": "Amazon Customer", "ReviewID": "RMNFDI93ZE9UR", "Overall": "5.0", "Content": "Look this camera it work great An it takes good pictures it's the perfect gift So this product is a plus", "Date": "June 4, 2014"}, {"Title": "missing memory card..", "Author": "bellatwins", "ReviewID": "R1Y0G29IN71DLY", "Overall": "4.0", "Content": "I bought the camera for my niece for her bday and she loved it , but she couldn't use it.. I checked the included stuff on box and even though It said a memory card was one of the items, there was no memory card.  I had to go to rite aid during the party and get one.. other than that the camera is great.. front screen is soo cool and the color was perfect for her , she just turned 10 so it's great that it's easy to use too..", "Date": "June 1, 2014"}, {"Title": "Great camera.", "Author": "click50", "ReviewID": "R2DCGGRDSGA0PM", "Overall": "5.0", "Content": "I bought this for my wife to take on vacation.  She says it is very easy to use.  Takes great pictures.  Has dual screens which is great for selfies", "Date": "May 31, 2014"}, {"Title": "Ok but slow", "Author": "Gregory Frost", "ReviewID": "R3NFBLJE45CMJB", "Overall": "3.0", "Content": "It's an ok camera. The pictures are very clear, but it's extremely slow to take a shot and by the time you configure wifi to sync you will want to out it through a wall.", "Date": "May 31, 2014"}, {"Title": "Returned this camera", "Author": "dibevco", "ReviewID": "R2NHA2KE0MTSPB", "Overall": "1.0", "Content": "I hated this camera.  Process, instructions, everything was awful.  I returned it and Amazon credited me immediately.Too many languages, too little English.", "Date": "May 29, 2014"}, {"Title": "Not happy with product.", "Author": "Deonarine Pitamber", "ReviewID": "R2WC09TDKKY3N8", "Overall": "2.0", "Content": "Quality is cheap. The plastic cover for the battery break after 3 months. Otherwise it take great pictures. It is small and easy to use.", "Date": "May 24, 2014"}, {"Title": "It's good for selfies", "Author": "Chris Howard \"Photo-Man\"", "ReviewID": "R2ZY4RBFNRJC3Z", "Overall": "3.0", "Content": "I bought this camera for my girlfriend because she is not very passionate when it comes to phtography but she enjoys shooting random scnes. The frontal display is great for selfies (which she enjoys a lot). But the quality of the lens is not outstanding. The settings are quiet a lot, but none of them will be able to deliver excellent photos.", "Date": "May 24, 2014"}, {"Title": "Sharp digital camera", "Author": "DAT", "ReviewID": "R1JP9KP4JO9PAW", "Overall": "2.0", "Content": "I may have to return it if I can not find a resolution to the battery issue by the seller.  The battery is not holding a charge and charged over night.  The camera is useless without a charge.  It may need a new battery or even charger but I hope this problem gets resolved before I must return it.", "Date": "May 22, 2014"}, {"Title": "Nice Camera", "Author": "Duwane Ross", "ReviewID": "R2GL69G5BKUPE6", "Overall": "5.0", "Content": "Have only taken 12-14 pictures so far,but they are really great. Would have no qualms about recommending camera to friends, good value,great price", "Date": "May 20, 2014"}, {"Title": "Gift for daughter", "Author": "John F Geisler", "ReviewID": "RM2OLFZAQ9HX7", "Overall": "5.0", "Content": "She asked for this for christmas and has taken it with her wherever she goes. It's everything she thought it was and more. Excellent camera.", "Date": "May 19, 2014"}, {"Title": "It's amazing", "Author": "David", "ReviewID": "R1DVOEUUD75KJN", "Overall": "5.0", "Content": "It has more tricks than I could imagine.  For example you can post to Facebook straight from the camera, and I think you can upload to your computer or tablet without a cord.  Takes great pix too.  Love the zoom.", "Date": "May 17, 2014"}, {"Title": "I liked", "Author": "johanna cabrera", "ReviewID": "R3LIQRO1FQPU3Q", "Overall": "4.0", "Content": "very spectacular with amazing features and everything came in perfect condition, the only detail is that is a little bit, but the rest all great.", "Date": "May 15, 2014"}, {"Title": "Perfect Little Camera!", "Author": "Racine Azure", "ReviewID": "RDIXUJ7TRJ9GM", "Overall": "4.0", "Content": "I had a camera just like this! The only con is the image stabilizer - does work quite well but it's a neat little camera to capture all those moments! :D It takes great pictures and the dual sided part is also a great little tool have for those selfies, haha.", "Date": "May 12, 2014"}, {"Title": "WORTH IT!!!", "Author": "Southlaw", "ReviewID": "R2JCZ4EM72YCBP", "Overall": "5.0", "Content": "NO PROBLEMS!!!the price matched the specs and it more than impressed me when I got it and put it to use...an amazing little piece of equipment...well worth every penny...NO COMPLAINTS!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!", "Date": "May 10, 2014"}, {"Title": "SO Awesome", "Author": "quibecca", "ReviewID": "R2B94WQVCPFC9R", "Overall": "5.0", "Content": "I got this camera for my nephew who is leaving the country for a couple of years.  The WiFi sending is AWESOME.  Even if he cannot get to a computer to actually write, he can send us pictures right from his phone.  Light weight, and small, its perfect to fit in his backpack.  LOVE IT", "Date": "May 6, 2014"}, {"Title": "So far so good!", "Author": "Emma", "ReviewID": "R38FK7Y5K5NFXD", "Overall": "5.0", "Content": "The picture quality is lovely and I like that I can take a picture of myself with ease because of the additional screen on the front. So far so good! I have nothing to complain about.", "Date": "May 5, 2014"}, {"Title": "Love the convenient direct WiFi email convenience!", "Author": "AMIGO DE MEXICO \"FRANK\"", "ReviewID": "R1E3S1V8PUXJLN", "Overall": "5.0", "Content": "This cam is wonderful and recommended over a Canon product, I have two Canons. It works flawlessly in conjuction with WiFi to send pics immediately to friends...with no computer connection necessary.", "Date": "May 5, 2014"}, {"Title": "I love it", "Author": "Belkys Escalona", "ReviewID": "R3NKV8J4GXF8YK", "Overall": "5.0", "Content": "me llego muy bueno", "Date": "May 4, 2014"}, {"Title": "instruction book", "Author": "Shannon  Mussen", "ReviewID": "R38649I5XTEUUA", "Overall": "5.0", "Content": "Even though I gave it a 5 star.. the camera quality of photo's is exceptional for a small camera.  The price was right...The instruction book is terrible and of little help,  picture (small to see and follow)  No written directions how to use and learn the features.  My best friend bought one too, he too says same thing.that is all trial to figure it out as there is no guidance in the quick start manual.Recommend purchasing just have patients to learn to use it.", "Date": "May 4, 2014"}, {"Title": "This Camera is awesome", "Author": "James Cooper", "ReviewID": "R3RVXGAEL8R0SU", "Overall": "5.0", "Content": "Very easy to set up and use have had no issues with this Item, highly recommend this for every day use", "Date": "April 28, 2014"}, {"Title": "Amazing Camera!", "Author": "Epic Realist \"Epic Realist\"", "ReviewID": "R309AMZAHPT96U", "Overall": "5.0", "Content": "I love this camera! I got it to replace my 5-6 year old 8 megapixel Sony Cybershot. I got this one because apparently, it was the only affordable camera with a second screen to be able to see what I am taking a picture of or even recording. That feature is very well worth it. This camera has amazing picture quality and amazing video quality as well. Be warned: it does not come with a memory card, which I should have known that it wouldn't, but nothing specified the fact that it didn't, so I had to buy one separately. Best brand to get in my opinion: Sandisk!The features are easy to use and navigate, and my kids love the funny distracting animation that the camera comes with in order to make the most stubborn kids smile. This cam gets an A+ from me! ;)", "Date": "April 28, 2014"}, {"Title": "Good camera for the size", "Author": "Rhonda J. Stevens", "ReviewID": "R2BV073SDEIQWB", "Overall": "4.0", "Content": "The double lcd screen is a nice feature.  It takes a nice picture, although don't expect gallery quality with it.  Moving pictures are a bit difficult.  The wi-fi feature is nice.  I wanted a small camera that I could transmit without cords and this provided it, so I was happy with it.", "Date": "April 27, 2014"}, {"Title": "picture this!", "Author": "Alfonso Gioia", "ReviewID": "RIX7PVSUY216Y", "Overall": "4.0", "Content": "awesome for the $$. extremely small,light, clear image and easy to use. super great for close ups . Probably not the best choice for > 100 yds away.", "Date": "April 25, 2014"}, {"Title": "Poor quality images.", "Author": "Al \"Al\"", "ReviewID": "R1EM1T68FR9AJ2", "Overall": "2.0", "Content": "Picture quality left a lot to be desired.  I was very unhappy with the images, and most came out blurred.  I therefore returned it.", "Date": "April 24, 2014"}, {"Title": "POINT AND SHOOT", "Author": "Pat", "ReviewID": "R2JHAQMFYFH0F4", "Overall": "5.0", "Content": "This is the secound Samsung camera along this line I have owned, and I was well pleased with the first one and this new one thatI bought from Amazon. The Point and Shoot is my type of camera and this one has so far done the job quite well. I like easy andsimple and that is what this camera is unless You want to go technical. It will fit what ever class of photography You are interested in.So if technical is what You want the electronics will let You go there. I have used the Wi Fi just twice and it does work , but that isnot something that will be important at this time. The front display is ok but I have  not used it. I was taking pictures of the fish inmy 55 gallon aquarium and I turned off the flash to stop the reflective glare and that is a good feature.My wife and I took the camera with my kids out to eat and my daughter was shooting with her cell phone and I was shooting withthis new Samsung DV150F and when I got home and down loaded her pictures from the cell phone and the ones fromthe Samsung I was really suprised to see how much better the pictures from This Samsung DV150F were.I had placed them on my computer desk top for display and Samsung DV150F Pictures were so much Sharper and Clear!Point and Shoot is the way I like to take Pictures and This Camera Does an Excellent Job of it!Pat", "Date": "April 23, 2014"}, {"Title": "I love it", "Author": "Yarelis D.", "ReviewID": "R2TTZP8MJBPBVM", "Overall": "5.0", "Content": "excellente", "Date": "April 19, 2014"}, {"Title": "nice.", "Author": "Carlos Nieves", "ReviewID": "R382CM6M4X92SB", "Overall": "3.0", "Content": "over all is good but battery doesn't last. good for selfies, good price. the coolor is cute. will think twice before buying another camara", "Date": "April 11, 2014"}, {"Title": "Exactly what I wanted.", "Author": "Samantha Vandruska", "ReviewID": "RRI494WT5Y80E", "Overall": "5.0", "Content": "This Camera is everything I wanted. I got it for Christmas and used it a few times for youtube videos. The quality is good theres soooo many settings and it hooks up to your smartphone which is super convenient. The battery is kind of poor but besides that it picks up sound really well and adjusts well.", "Date": "April 11, 2014"}, {"Title": "Great point and shoot camera", "Author": "crystal", "ReviewID": "R27SNGOBCC19M8", "Overall": "4.0", "Content": "I bought this because I wanted a small compact camera to fit in my purse. I also love the fact that it plugs in to charge. Doesn't zoom real far but you get what you pay for. I also love that you can take selfies with it and actually see what you're taking a picture of.", "Date": "April 3, 2014"}, {"Title": "great, fast and cheap", "Author": "Dehuel Vasquez Peña", "ReviewID": "R102KHX7LVVLSW", "Overall": "5.0", "Content": "Excellent camera, works great, nice flash. I love the Wi-Fi connection and the menu is easy to use. I just love it", "Date": "April 3, 2014"}, {"Title": "small point and shoot camera", "Author": "Marmar", "ReviewID": "R2B5FIMQ1U3R3H", "Overall": "4.0", "Content": "I haven't yet taken the time to get this camera to do what it is capable of, and that I didn't realize when I bought it..the reviews were good..it didn't come with the memory card which I now have.  I imagine I will like that it will stream photos for an easier download to the lap top and that I can also load pictures with the card.", "Date": "April 2, 2014"}, {"Title": "Great for dual photos", "Author": "Christine C. Bedoret \"cbedoret\"", "ReviewID": "R2TV15JSLRATZA", "Overall": "5.0", "Content": "Nice little camera.  It certainly makes it easy to take a selfie.  I like the feature of being able to take images side by side.  I do not  do that very frequently, but it is a convenient feature to have.", "Date": "April 1, 2014"}, {"Title": "Best digital camera I have ever owned", "Author": "Louise Adsit", "ReviewID": "R24R64UFB4KG1H", "Overall": "5.0", "Content": "This camera is fantastic !  Picture perfect photos, color is bright and clear, easy to use, front lens for \"no guess\" selfies, compact, battery life lasts forever, recharges quickly and the Samsung customer support team is great.  Love, love, love this camera !", "Date": "March 29, 2014"}, {"Title": "Samsung Camera", "Author": "Mandee", "ReviewID": "R3AT5FV1G4EW2I", "Overall": "3.0", "Content": "I'm not thrilled with it but it will do the job. I'll most likely be purchasing a different camera though in the future. This one just doesn't work as well as I thought it would. Sure is pretty though. :P", "Date": "March 27, 2014"}, {"Title": "thank you", "Author": "Brian", "ReviewID": "R3UE1XVH7WHMOS", "Overall": "3.0", "Content": "Its only ok to me, bought it for my wife and she loves it. So my rating and hers would greatly differ...", "Date": "March 27, 2014"}, {"Title": "its good!", "Author": "Amazon Customer", "ReviewID": "R1JZ2HIXXQ47R8", "Overall": "3.0", "Content": "The WiFi is awesome and it takes great pics! But when you zoom in the pics are very blurry and unfocused.", "Date": "March 27, 2014"}, {"Title": "Vegas here we come", "Author": "Cassandra Manor", "ReviewID": "R39ATI0OT1HRW4", "Overall": "5.0", "Content": "Exactly what I was looking for. Will take great selfies of our Vegas Honeymoon. Takes awesome pictures and easy uploading.", "Date": "March 23, 2014"}, {"Title": "camera!!! samsung", "Author": "Sherhonda M.", "ReviewID": "R187L541HBHJH0", "Overall": "5.0", "Content": "love it!!! good picture quality great volume for video easy to share pictures wifi incredible fast and I just love it", "Date": "March 21, 2014"}, {"Title": "Samsung DiCa is so good.", "Author": "heedae kim", "ReviewID": "R2UTDLD84SGXRK", "Overall": "5.0", "Content": "It's a very  good. I used it well where I want to take pictures. I think this camera is the best", "Date": "March 19, 2014"}, {"Title": "Iffy", "Author": "Anna", "ReviewID": "R1M276IBGL9GSE", "Overall": "3.0", "Content": "This camera takes wonderful photos and videos! It has neat little features that edit your face or surroundings, which I like. Perfect for selfies lol. HOWEVER, the lens moved a bit and I fixed it properly. The camera continues to display a message that the zoom isn't working, and to contact customer service. I'm going to return it.", "Date": "March 18, 2014"}, {"Title": "Like the camera", "Author": "Amazon Customer \"Sundial256\"", "ReviewID": "RMUO9SXW1WO4N", "Overall": "4.0", "Content": "My husband really likes the camera, it beat running around for batteries everytime you need to take a picture like his camera.", "Date": "March 17, 2014"}, {"Title": "Great gift!", "Author": "Tiffany", "ReviewID": "R115CX5Y6Y5Z0P", "Overall": "5.0", "Content": "Bought this as a Christmas gift for my brother who takes pics at every gathering and every vacation. He loves all of the features and he is able to finally share the photos that he takes via Facebook or email from the phone!", "Date": "March 17, 2014"}, {"Title": "Great starter/point and shoot camera", "Author": "Xavier", "ReviewID": "R1AX3UNWTHCW4R", "Overall": "4.0", "Content": "Exactly as advertised!  Good shipping and a great starting camera. Memory card does not come with the camera is one con. Bought this for my girlfriend for her first camera and she loves it. Lots of extras. Highly recommend for the price. Samsung is a great brand.", "Date": "March 16, 2014"}, {"Title": "love it!", "Author": "LINDSEY", "ReviewID": "R9NT9I3TTU74Q", "Overall": "5.0", "Content": "The camera is awesome! I haven't actually gotten a chance to check out all the features yet, but from what I have seen its a fun camera and i love the color too.  The front view is a great feature!", "Date": "March 13, 2014"}, {"Title": "kimberly martinez", "Author": "Kimberly", "ReviewID": "R2IINI4YMSL94Y", "Overall": "5.0", "Content": "this camera meets my expectations are really really good more than I expected, would return to buy, five stars for this good product thanks", "Date": "March 12, 2014"}, {"Title": "Pretty Pink camera that takes GREAT pics!!", "Author": "Katie", "ReviewID": "R3JP9Q0JJ4PULT", "Overall": "5.0", "Content": "I LOVE THIS CAMERA!! I had originally seen this at Christmas my sister had one and I loved how you could take self pics with the screen on front! no more missing heads in my pics! LOL!! this camera is light and easy to use and it focuses well! I had a sony and let me tell you this thing is wayyy better than that!! all my pics come out clear every time, no more blurry pictures! I would highly recommend this camera! I LOVE IT!!!!!!!! you cant  go wrong with this PINK one :)", "Date": "March 11, 2014"}, {"Title": "good camera!", "Author": "Daniel M.", "ReviewID": "R1QQ1FC9TMY9XB", "Overall": "5.0", "Content": "works great and its a fun little camera , I can add my photos to fb, or vids to youtube without needing a pc.", "Date": "March 10, 2014"}, {"Title": "Just Amazing :)", "Author": "QueenNathza", "ReviewID": "R2IF50U08IDG7R", "Overall": "5.0", "Content": "I originally paid $65 for a refurbished camera off of Ebay and I was so thrilled to receive it, but it was defective and there were lines through the screen (waste of money, didn't get a refund). So then I get on Amazon (which is where I Should've gone first) and find this lovely little number and it is BY FAR one of the best cameras I've ever encountered in my life. Amazing HD and only $100 brand new in the box, that's definitely a steal! Thanks Samsung and seller, another satisfied customer would DEFINITELY recommend.", "Date": "March 8, 2014"}, {"Title": "It's a small easy portable wifi enabled digital camera", "Author": "its awesome!!!", "ReviewID": "R3O9RG6VIUHJA2", "Overall": "4.0", "Content": "The shipment came really fast. I ordered it on friday afternoon and it arrived on sunday morning. I am purple holic and the color is really nice. I say overall the cost the shipment and quality of this product is nice. It's good for users who like to post pictures online esp. facebook by using wifi to upload on facebook. It can send e-mail with the photos you've taken straight forward with the camera. I would recommend people buying this, unless they want a high quality dslr equivalent camera, then you should just buy dslr.", "Date": "March 3, 2014"}, {"Title": "Good Camera", "Author": "M. Wagner \"uwplatteville\"", "ReviewID": "R1ZLXGJ7DMOLHL", "Overall": "5.0", "Content": "love the window in the front. also all of the extra backgrounds. the only thing it needs is better zoom.", "Date": "March 1, 2014"}, {"Title": "Perfect little digital camera", "Author": "Kimberly McNeil", "ReviewID": "RB0A6DGQC2ZGS", "Overall": "5.0", "Content": "The camera itself is a pretty little accessory.  Love the front viewing screen and it has so many fun features.  Pictures are good quality.", "Date": "February 25, 2014"}, {"Title": "Nice compact Camera", "Author": "Dotty Cooper", "ReviewID": "R2JTMKSY3MUX22", "Overall": "4.0", "Content": "I like the camera.  The learning curve is a little steep and there wasn't a card in it.  Otherwise nice.", "Date": "February 18, 2014"}, {"Title": "A xmas present for my sister", "Author": "eric", "ReviewID": "RLO9DSRZLGMLW", "Overall": "5.0", "Content": "This camera is great for someone who is going to use to capture moments with friends family or even traveling. its great for somebody's first camera my sister loved it its so simple to use that's the best part.", "Date": "January 29, 2014"}, {"Title": "good camera for that price", "Author": "Alejandro Garcia Lastra", "ReviewID": "R17MV9GJ04Q0O7", "Overall": "4.0", "Content": "For this price is a good camera, but obviusly is not the best. Good quality of pictures, but realize that this is a snap and shoot, you dont have many options to configure the camera. Nice wifi connection.", "Date": "January 24, 2014"}, {"Title": "Full-Featured Point & Shoot Camera", "Author": "Richard La Barca", "ReviewID": "R1AOQ20765RPCE", "Overall": "4.0", "Content": "For the features this camera has, it is a pretty good deal for the $75.00 I paid. As for basic \"auto\" picture taking, it is about par to a $50.00 Kodak camera but, the video quality is much better. Having a front facing LCD is a nice touch for those (many) selfies we all like to take. The rear LCD is okay but, in direct sunlight, a bit difficult to see the image. I also wish I had full control of the flash which is not an option.THE REALLY GOOD: There are many preset-able picture formats so you don't have to make manual adjustments. This includes changeable MPs (picture size/quality) and specific scene choices as well as \"magic\" mode to add enhancements to pictures and even correct facial imperfections. There is a panoramic function to capture those vast scenic moments too. Also, with a 5X optical zoom, you can get pretty good close-ups (try not to move the camera!). With these capabilities and more, this camera is a winner!I haven't used the wifi since I find it easier just to take a picture with smart phone and send it immediately from the phone.FYI: If you wait a couple of seconds after selecting an item within the menu, the camera will show a little pop-up describing its function. I mention this because the camera does not come with a manual which is only available/downloadable online.Overall, this appears to be a solid, well-built camera with a good lens and many user changeable features.", "Date": "January 16, 2014"}, {"Title": "Camera for my daughter", "Author": "Bobbi Bradshaw", "ReviewID": "RBBYWX81TIRYP", "Overall": "5.0", "Content": "She loves it & it works great! Samsung is the best quality camera that I've ever used. Great Bargain, no regrets!", "Date": "January 15, 2014"}, {"Title": "Wife loves it, now I get to keep mine.", "Author": "Mark Hanson", "ReviewID": "R1L85JKWHQ3WMV", "Overall": "4.0", "Content": "My wife was always taking mine, an earlier version of this one,she loves the fact that it connects directly to facebook and other web sites, soshe can post immediately at any family activity as long as there is a WiFi connection.She just loves the beauty shot feature also.", "Date": "January 13, 2014"}, {"Title": "Samsung Cameras", "Author": "Jason P Punchard", "ReviewID": "R1KSGJ4YEUM360", "Overall": "3.0", "Content": "In all I am happy with my selection of this camera. I with it did have a few things that would help make it better. First the front camera display is a great idea. but all it takes is blurry pictures while in that mode (this is disappointing being this is one of the main reasons I purchased this camera). It also does not take good pictures in dark areas. And last when uploading pictures to your computer it does not let you pick which ones to upload. It uploads all of them. Which depending on how often you upload could take a long time. Although it does let you choose what pictures you want to upload to your phone. But for $100.00 I really can not complain a whole lot.", "Date": "January 11, 2014"}, {"Title": "Daughter loves it!", "Author": "Phyllis Wheatley", "ReviewID": "R10DPZQAB0WYYE", "Overall": "5.0", "Content": "This was a Xmas gift for my daughter.  She absolutely loves it!  You can take a selfie (and see it while you take it!!)!!  And it also emails the photos too!!", "Date": "January 9, 2014"}, {"Title": "love it", "Author": "Shawna L. Bowen", "ReviewID": "RRVR9CDXZEEAT", "Overall": "5.0", "Content": "I love this camera, although I got it with a non USA std plug the seller has worked with me getting the right plug.  I love the features this camera has.", "Date": "January 8, 2014"}, {"Title": "camera", "Author": "PATRICIA  L  BENNETT", "ReviewID": "RL0KI7OWK1O1T", "Overall": "5.0", "Content": "Love it, just need to learn more about it,need download Manuel,hate that they don't include it anymore, make it easier on LOT ppl but I love .y camera was due for new one,glad I picked this one thanks", "Date": "January 8, 2014"}, {"Title": "Excellent", "Author": "cntryrox \"kygirlzrok\"", "ReviewID": "R2WLBQLW3GOGIW", "Overall": "5.0", "Content": "Love it. Easy to use, small, takes good pics. I love how easy it is to post on Facebook without having to do it through the computer.", "Date": "January 7, 2014"}, {"Title": "The BEST!", "Author": "NanaArizona", "ReviewID": "R2PEPCJF64KK9Y", "Overall": "5.0", "Content": "This camera does EVERYTHING!! Was a gift for a friend for Christmas, they are VERY HAPPY with it!! I'm jealous!!", "Date": "January 5, 2014"}, {"Title": "I like it!", "Author": "Hafeezah", "ReviewID": "RPBR9L92DTQHJ", "Overall": "4.0", "Content": "The video is really clear. I just wish it picked up more light or had a flash while recording. But over all it really great! Lots of features.", "Date": "January 5, 2014"}, {"Title": "Not impressed", "Author": "Pamela  Floyd", "ReviewID": "R21X16G28N842J", "Overall": "2.0", "Content": "Doesn't work well, few instructions and those are mostly pictures, and it arrived too late for my trip. Overall, it was not a great purchase. Still haven't got the front screen to work at all and it won't connect to my network. Do not recomnend it.", "Date": "January 4, 2014"}, {"Title": "Unique Camera", "Author": "Dennis", "ReviewID": "RE2N86KJEH00E", "Overall": "5.0", "Content": "This was a gift for my son. I reviewed the camera and found it to be very nice. It offers functionality beyond a point and click and yet is easy to use.", "Date": "January 3, 2014"}, {"Title": "Totally Awesome Camera", "Author": "Steven Kelly", "ReviewID": "R28CU5W0H9LW0N", "Overall": "5.0", "Content": "This Samsung Camera met all of our expectations and then some! Love the extra front view screen also. Colr is pretty also.", "Date": "January 3, 2014"}, {"Title": "Great camera", "Author": "Claudia R.", "ReviewID": "R2UL3QKANDW2TG", "Overall": "5.0", "Content": "I'm in love with this camera. I just started using it and learning how to use the different features. This is my first digital camera since I have always used my iPhone. I love the wifi feature and the front view screen which is great for selfies. All the pictures come out great!. The front view screen is also great for taking pics of my nieces and nephews since it can play a cartoon to get there attention. A great price for a cool camera. My only dislike was that I could not email the videos I took, even though one was only 30 seconds long?? However, I am able to email multiple photos with no problem.", "Date": "January 1, 2014"}, {"Title": "My son loves it", "Author": "hawaiian", "ReviewID": "R1QHQHQLXDEIG", "Overall": "5.0", "Content": "My son loves this cameraHe likes because it's a samsung like his phoneHe's still figuring out everything about the camera", "Date": "January 1, 2014"}, {"Title": "Clear pictures", "Author": "Hamster", "ReviewID": "R28HGU3EJJ01D4", "Overall": "5.0", "Content": "Haven't had a chance to check out all it's features but it seemed to work great so far.I'll keep at it!", "Date": "December 31, 2013"}, {"Title": "Great camera", "Author": "Anne", "ReviewID": "R4KK6WOXWUI7U", "Overall": "5.0", "Content": "Takes great pictures, easy to use, easy to carry,  I can slip it in a pocket or purse.  No more big camera and bag to carry for me.", "Date": "December 30, 2013"}, {"Title": "Great camera for Beginners", "Author": "Michael D. Bonds", "ReviewID": "R1KI768JAYC83P", "Overall": "5.0", "Content": "This camera is what I really needed. It is easy to figure out and takes a great picture. Shipping time was great and it got here before Christmas and I got to use it on Christmas day.", "Date": "December 29, 2013"}, {"Title": "Great camera", "Author": "Luis Marcano", "ReviewID": "R2C8NKYKYSHRES", "Overall": "4.0", "Content": "Convinient wifi connection to any spot, directly facebook update, email Photos quickly, poor battery life, 700mA , i recomend buy 2 extra battery off 1200 mA, for a Completly day of video an pics,", "Date": "December 28, 2013"}, {"Title": "Wrong AC Charger", "Author": "J. White", "ReviewID": "R2Y99O8T2T4ASL", "Overall": "2.0", "Content": "This product arrived with a European AC charger which will not work here in America.  Otherwise, it looks like it would have been a great camera - will never know.  Returned for refund.", "Date": "December 28, 2013"}, {"Title": "Love the Camera!!!!!", "Author": "GloGlo", "ReviewID": "R363LWGCTIKW99", "Overall": "5.0", "Content": "This was a Christmas gift for my daughter and we love it. Takes great pic and does a lot more then what I expected!!! Great buy!!!!", "Date": "December 28, 2013"}, {"Title": "Too expensive", "Author": "Cassandra", "ReviewID": "R3BAS3A9RKYJFV", "Overall": "3.0", "Content": "It is not worth how much it is but its still a nice camera. The front facing camera is great.", "Date": "December 27, 2013"}, {"Title": "Value For Money", "Author": "ganesh paygude", "ReviewID": "R397NICVYU8SN9", "Overall": "4.0", "Content": "I find this product perfect ,nice picture quality. Value for money for me. Wifi function not tried yet but overall this product fullfill my requirments.", "Date": "December 26, 2013"}, {"Title": "Samsung did it again", "Author": "Kimarie Cuthbert", "ReviewID": "R2HCTEKLCFHTHK", "Overall": "5.0", "Content": "I like the up to date technology that it has. you can snap and post. really nice and high tech", "Date": "December 26, 2013"}, {"Title": "fulled all my expectations", "Author": "cesar antonio velazquez almanza", "ReviewID": "R2AJ1OZZBYSEQJ", "Overall": "5.0", "Content": "It is a great item , I am really glad with it, I recommend you to buy it , you will not repent to do it", "Date": "December 24, 2013"}, {"Title": "2 screens, WiFi, 16MP", "Author": "knewtron", "ReviewID": "RLIVHG0Z8LIB1", "Overall": "5.0", "Content": "No better deal for the features for a point-and-shoot camera. Second screen sure makes self pics easy because there's no more guessing. WiFi gets the pictures where you need them so much easier than before. High resolution makes editing details easier and clearer. Just have to overlook the color of the camera and think of it as an easy way to find it if it gets misplaced. It was so good, I bought another one for my brother's family.", "Date": "December 23, 2013"}, {"Title": "beautiful camera with great features but broke after one month", "Author": "Schwartz", "ReviewID": "R3T977ZV0QX4PU", "Overall": "2.0", "Content": "The features on the camera were easy to learn and they were alot of fun.  I used the camera panorama, the top and bottom face composition, the cartoon features. It was really great. The battery was so-so because my Canon HS100 has a longer battery life and slightly bigger battery. One day I took some pictures and tried to see them and but the camera kept reporting \"file error\". The battery was charged.  I went to print the pictures from the SD card and they printed. I tried to reformat but the camera kept reading \"file error\". Nobody else has reported this problem. I am returning it and will consider getting it again or a Canon. But I really like the features on this camera although the pictures are not as clear as the Canon point and shoot.", "Date": "December 20, 2013"}, {"Title": "Great camera!", "Author": "Amazon Customer", "ReviewID": "R1LEOVFWK6U4SA", "Overall": "5.0", "Content": "Takes great pictures. Easy to upload and transfer pictures.Pretty camera. Easy to use. Uses micro sd card anc sotre loads of pictures and videos.", "Date": "December 19, 2013"}, {"Title": "This was a gift", "Author": "Lori", "ReviewID": "R1IY1UX64DAE86", "Overall": "5.0", "Content": "My daughter, who has this camera, recommended it to me as a birthday gift for my sister, who has a disability, because the camera is easy to use and because of its features.", "Date": "December 19, 2013"}, {"Title": "Fantastic and Useful Camera", "Author": "Brophus", "ReviewID": "R32C0DV0S31RLR", "Overall": "5.0", "Content": "Camera takes quick pictures without sacrificing clarity or detail. Front facing screen is a must for couples that vacation on their own. Incredibly useful camera with a ton of features! This is the perfect point and shoot.", "Date": "December 19, 2013"}, {"Title": "Coll for doing self eee's", "Author": "The Ripper \"Xsheriffsdeputy\"", "ReviewID": "R1E55JKCQLOSPE", "Overall": "5.0", "Content": "Great little camera with many coool features like direct Email from camera.  Like the front viewing port in is definitely different", "Date": "December 19, 2013"}, {"Title": "small but the best", "Author": "palau", "ReviewID": "R168VNJM0EZ8G7", "Overall": "5.0", "Content": "I love this camera..it is small but one of the best. both screen front and back really help.one of the best camera.", "Date": "December 18, 2013"}, {"Title": "nice", "Author": "Tammy Dawe", "ReviewID": "R178M6TFP1TJZX", "Overall": "4.0", "Content": "I havent been able to enjoy this product as of yet because it didnt come with a memory card so the camera is unusable.  but I am looking forward  to it.", "Date": "December 17, 2013"}, {"Title": "Good for selfie", "Author": "R. D. Trajano", "ReviewID": "RVD3YAE2LJOV3", "Overall": "4.0", "Content": "Dual LCD is handy when you want to get in the picture. A lot of fun features, like the billboards, tv shot, holiday card and etc.", "Date": "December 15, 2013"}, {"Title": "OK for the price", "Author": "Amazon Customer", "ReviewID": "R1ZQM7LT1UUWMK", "Overall": "3.0", "Content": "I wish I could force the flash. The photos are blury in low lighting.  Ok for the price. The front screen is nice with count down options and video clip to get young ones attention.Wish I could force the flash and not just let AUTO figure it out.", "Date": "December 6, 2013"}, {"Title": "Easy to carry and use", "Author": "Bean Bean", "ReviewID": "R70V754EP3WXX", "Overall": "5.0", "Content": "I bought this camera when it approx. $70. I already have a pricey DSLR but with an active toddler, my hands are always full and I can't take the DSLR around as I would like to. I wanted a cheaper point & shoot that was (1) easy to carry and use and (2) small/light, while (3) taking better pictures than my iPhone 5.So far, I'm very pleased. It's very easy to use. The menu is very easy to navigate. I usually use the smart mode b/c it's the quickest. It also has some fun filters. I can carry this around in my diaper bag and quickly pull it out when I want to take a better picture than an iPhone pic. The shutter speed is pretty good - most of my pictures are coming out quite sharp and clear, even when my toddler is running around. It's not DSLR quality, of course, but you're not paying DSLR prices and so far, this camera is proving to be an excellent value.", "Date": "December 4, 2013"}, {"Title": "Great idea for a point and shoot camera...make it a smart wifi enabled camera...it's the wave of the future!!", "Author": "Amazon Customer", "ReviewID": "R3LJH0WTAVEWTW", "Overall": "5.0", "Content": "Bought as a gift and wish I purchased one for me.  It was a deal of the day...great idea for a point and shoot camera-  buy one with wifi capabilities!!", "Date": "December 4, 2013"}, {"Title": "Awesome Camera", "Author": "ahmed", "ReviewID": "R2QGFC76FNHY0A", "Overall": "5.0", "Content": "Very light and shooting speed is awesome, makeup option will make you a movie star......really like it...and i will bring another one as a gift for my sister", "Date": "December 1, 2013"}, {"Title": "colorblind?", "Author": "jerilyn maty", "ReviewID": "R3EA2BUJ41C9YF", "Overall": "4.0", "Content": "I love this camera- but was very disappointed when I received the blue/black camera instead of the white one that I ordered. Just a little reminder to check your orders description before you send them out.", "Date": "December 1, 2013"}, {"Title": "Nice camera", "Author": "Nanney \"izzy's mom\"", "ReviewID": "R1MWCPU2F835GH", "Overall": "5.0", "Content": "Got this for my 10 year old for her birthday and she loves it.  Easy for her to use and fun with the front view finder.", "Date": "November 30, 2013"}, {"Title": "Samsung always reliable", "Author": "Victor Buenrostro", "ReviewID": "R3HWSF89IHGTZW", "Overall": "4.0", "Content": "Meets perfectly my expectations. Sure choice price vs performance but with powerfull smartphones cameras available everywhere might be a waste of money.", "Date": "November 29, 2013"}, {"Title": "Perfect pocket camera", "Author": "firewalker_john", "ReviewID": "R3NB8R14XGZV3U", "Overall": "5.0", "Content": "Perfect for the putting in the pocket for those quick pictures and it takes great pictures. even smaller would be better.", "Date": "November 28, 2013"}, {"Title": "Would Like To Use, But Can't Charge--Adapter Not For US Electrical Outlets", "Author": "Jody Williams", "ReviewID": "R2LRXZ761FE9K2", "Overall": "2.0", "Content": "I would love to use my new camera, but the battery charger does not have an adapter that will plug into US electrical sockets.  What's up with that?  No where in the product description does it say that the plug in will require an international adapter.  So, off to purchase something that will allow me to plug in the cord and charge the battery.  Amazon, I expected better than that!", "Date": "November 21, 2013"}, {"Title": "great", "Author": "Juan Valencia", "ReviewID": "R39HBX3HQX1GJN", "Overall": "5.0", "Content": "This is the best point and shoot camera by far you can buy if you are looking something to take to a travel", "Date": "June 20, 2013"}, {"Title": "Samsung Camera w/Wifi", "Author": "atorp", "ReviewID": "R1UEL6Q54KJ4HE", "Overall": "5.0", "Content": "Awesome camera.  Used it a few times now for videos and the zoom is absolutely amazing!  I am enjoying this camera!", "Date": "May 28, 2013"}, {"Title": "It does not come with a memory card", "Author": "Carol Fergueson", "ReviewID": "R1PMKBMVXMOWC2", "Overall": "4.0", "Content": "It is a great camera. I have not had it too long and was a little dispointed that it did not come with a memory card.", "Date": "April 5, 2014"}, {"Title": "GREAT CAMERA", "Author": "carmen", "ReviewID": "R1WF64G8P3ZJ1O", "Overall": "5.0", "Content": "takes great pics and love the size , and so easy to use, great camera for the money, love it", "Date": "December 7, 2013"}, {"Title": "amazing features", "Author": "K. O.", "ReviewID": "R3EVX4XJPYN3KX", "Overall": "5.0", "Content": "very nice size, sleek, takes excellent photos, front lcd panel is a nice touch. it syncs with my phone and i can snap the shot in my phone by using the camera lens. has so may features i havent even begun to use them all yet...its a \"smart\" camera maybe smarter than me but definately worth the price.Love it!", "Date": "December 6, 2013"}, {"Title": "Good camera but no user-friendly features.", "Author": "Gee Gee", "ReviewID": "R2XTLPO12K9AIV", "Overall": "4.0", "Content": "I just received this camera and am still learning the features. This review is for the electronically-challenged like me since I ALWAYS need to call someone for help with everything electronic!What I like:*It is small, light-weight, and fits well in my purse.*Pictures are automatically sent to my smart-phone. (You have to download an app before this feature will work.)*Takes video.*I can take \"selfies\" with ease.*Wi-fi capability.What I did NOT like:*No manual, only a quick-start guide that does not explain any of the features. There is a full manual available on various websites, but it has 100+ pages so I only printed the pages that I needed.)*I had to buy a memory card in addition to the camera.*Not \"user friendly\" if you have limited experience with digital cameras.", "Date": "November 27, 2013"}, {"Title": "Bad product", "Author": "DEISI GONZALEZ ROJAS", "ReviewID": "R3RKNSFUE54KBG", "Overall": "1.0", "Content": "Good morning please review products before sending them, I just got the camera and the lens tries to leave but gets stuck and fails, to bad I lost my money on this product, please re-checked for the products so that the customer does not waste time or money.", "Date": "April 7, 2014"}, {"Title": "Birthday Gift", "Author": "Willard D. Blair", "ReviewID": "R2LOVT6UEV1K74", "Overall": "5.0", "Content": "We bought this camera for a daughter and she loves it. Now, what will she expect next year? We'll see.", "Date": "June 27, 2013"}, {"Title": "Good Camera...outside.", "Author": "William Ketchem", "ReviewID": "R31NEIE117TE8", "Overall": "2.0", "Content": "I've used this camera a few times now so I can now review it. Terrific camera when shooting outside. Indoors, with or without flash, it is terrible. I like the wireless features that work with my cell phone. Iam now on the market for another camera. Indoors is important, I guess I'll have to pay.", "Date": "May 10, 2014"}, {"Title": "Incorrect charger included!", "Author": "FK001", "ReviewID": "R2V5BFEZPNHL8M", "Overall": "1.0", "Content": "Package arrived wet. Fortunately the camera and battery, etc. were is plastic pouches and remained dry. After getting things organized, I discovereed that the charger has a European style plug, will not fit the standard outlet without an adapter. I can of course use the USB port and charge the battery that way but what an inconveninece!The instructions with the camera are minimal and printed in what may be 00 font size on a folded up sheet of flimsy paper. So upset I have not yet tried out the camera since charging up the battery. Such a pain to return it after investing time getting it organized.No inspection or Quality Control at the Distrib Center......", "Date": "April 27, 2014"}, {"Title": "The best camera ever made!!!", "Author": "GODCHILD", "ReviewID": "R1TDRLPW3ZBD34", "Overall": "5.0", "Content": "I love this camera it's the best it has wifi I am having so much fun It's so so so amazing to me I love it be blessed!!!", "Date": "April 9, 2014"}, {"Title": "Haven't used it yet.", "Author": "1st Grambo \"1st Grambo\"", "ReviewID": "RS8GYLLL2JXE5", "Overall": "4.0", "Content": "Can't seem to find my mini-card, and have not even tried to use the camera yet.  It's very small and compact and seems to have a lot of features.", "Date": "March 22, 2014"}, {"Title": "samsung camera", "Author": "Tristyn Johnson", "ReviewID": "RDZR2TS2BSD0", "Overall": "5.0", "Content": "I gave this 5 stars..The color is so vivid and pretty. The camera is simple and very user friendly. I havent taken many pictures yet because I purchased it for a upcoming trip. Although I wish it were touch screen, I am still satisfied with my purchase. I read that it does take great photos so I would recommend this to anyone..", "Date": "March 21, 2014"}, {"Title": "It's ok", "Author": "Maryanne Salera \"Maryanne\"", "ReviewID": "R3LFBQNCW4ZOR9", "Overall": "2.0", "Content": "I ended up finding my other Casio Camera which I love. I sold this camera on Craig's List. Didn't like it and it doesn't work with out a memory card. Very disappointed.", "Date": "January 15, 2014"}, {"Title": "Poor picture quality indoors", "Author": "Roman Kharkovski", "ReviewID": "R10W6SVUB6PMC9", "Overall": "2.0", "Content": "Outside pictures are ok, but when I compared this camera with flash indoors, my 4 years old Canon IS1200 took better pictures. I returned the product and upgraded to Canon S120 and I am loving it :-) Yes, these are in very different price categories, but I prefer quality over price and the $350 was well worth it for it. The only thing is the poor battery life on S120...", "Date": "December 24, 2013"}, {"Title": "Great camera!", "Author": "Christine Benson", "ReviewID": "R422M379OW41C", "Overall": "5.0", "Content": "Great pictures!  Love that it is so small that I can carry it anywhere especially slipped into my pocket.  Has a good zoom.  I really love the duel screen so when I take a picture of myself or husband and me I can really see what it will look like--that is a great feature!  I did not get the bigger memory card but am going to because there have been a few times I could not take pictures until I downloaded.  Definetly get a bigger memory card.I love my little camera!  Well worth the price.", "Date": "December 4, 2013"}, {"Title": "No Memory Card", "Author": "TLT", "ReviewID": "R17GZ5TF5BA5I", "Overall": "3.0", "Content": "I was stunned to find no memory card on the camera.  WHY would they not include this....you take it out of the box expecting to start using it right away and you can't.  Hoping, once I get the memory card, the camera is worth it.", "Date": "November 21, 2013"}, {"Title": "Camera buttons too small for my big hands.", "Author": "Hector", "ReviewID": "RXY43RQAZ1QFA", "Overall": "2.0", "Content": "The top zoom button is too small to use.The camera feels like cheap plastic.The instructions book words too small to read.", "Date": "November 19, 2013"}, {"Title": "very recommended", "Author": "Lucas", "ReviewID": "R142EA8Z9PG21W", "Overall": "5.0", "Content": "It was a clever purchase because it has a lot of applications for pictures and videos. I recommend it very much!!", "Date": "October 7, 2013"}, {"Title": "Highly Disappointed", "Author": "Honi M. Gottlieb", "ReviewID": "RJZP5GUJJUNQF", "Overall": "1.0", "Content": "I ordered this camera with the expectation of using it on my trip to NYC .. I got the camera in February and took the camera out yesterday ..tried  using it .. Today while in NYC camera has something in else that is showing up in photo like either missing pixels or some malfunction .. Wanted to return it but iI was told I can not ... I will never purchase from seller again nor will I  recommend.. There is no reason why a brand new camera right out of the box should not work perfectly .. Very unhappy !!!!", "Date": "April 13, 2014"}, {"Title": "Not Sent The Correct Item", "Author": "S. Omar \"Nosiop Sag\"", "ReviewID": "R3CY8FWWMP4UJS", "Overall": "1.0", "Content": "I am so disappointed. When I opened the box it did not contain the Samsung DV150F that I ordered and paid for. I received a totally different digital camera, which was a Samsung, but not the correct model. So I'm sending it back. What an inconvenience this has caused.", "Date": "February 24, 2014"}, {"Title": "Wrong Charger", "Author": "Richard J. Heath", "ReviewID": "R17GSHX6NKBP6H", "Overall": "1.0", "Content": "Purchased this from Amazon.com.  Charger is Japanese style, not American.  How can I review it if I can't even charge it and use it???  Very disappointed!", "Date": "January 21, 2014"}, {"Title": "PLEASE READ MY UNBIASED REVIEW BEFORE PURCHASING THIS ITEM!", "Author": "Philly Grad Student  On the Go", "ReviewID": "R1Z3PWO5GWPYUS", "Overall": "2.0", "Content": "First of all, I did a lot of research into brands and pricing for a digi cam before finally deciding on this one due to its good reviews. Actually, I stumbled across this one and was immediately impressed with the specs (16 megapixels and it being wi-fi). I knew I wanted a good quality of megapixel and wi-fi to seamlessly upload to social media and email without having to attach the cam to my laptop.What I love:A front AND rear LCD screen.The plum color is stunning and it is wi-fi.What I hate:The pic quality sucks.Rear LCD screen is supposedly 2.7 but looks incredibly small.  Worse, it wouldn't connect to my home wi-fi network. I tried it at least 5 to six times. Called Samsung tech support and the rep told me to try to connect via a different wi-fi network (How could I as I have one network at home and all my neighbor's are security protected?). Then I was told to try to disable my network security key THEN try to connect (This is impossible and makes no sense as how could one connect to a wi-fi without its security key?). Subsequently, in another phone call, a very rude and nasty tech support rep told me to change the channel of my router to \"either 1 or 6 but not 11\" and when asked how to go about doing that, I was told that they couldn't offer assistance in that and I'd have to contact my ISP. I contacted my ISP only to be told that only the manufacturer of the router could assist. Frustrated, I googled how to change my router's channel. HUGE MISTAKE! This erased all my router's settings (my network security key, network name, etc) as well as also rendering my internet offline and unable to have internet access. After a 4 and a half hour and 2 phone call tech session with the manufacturer of my router, I FINALLY was able to restore my internet connectivity. The rep stated that Samsung should have NEVER told me under any circumstances to alter my router's settings. Finally, the router tech support rep disabled a certain feature in the router settings and I was able to connect to my wi-fi network (or so I thought).....WRONG! After hanging up with the rep, I was once again, unable to connect with my wi-fi network. Clearly the cam was either defective or there is some setting on the cam or my network that prohibits or doesn't allow the cam to connect with my network.  The customer service/support I received from Samsung was appallingly sub-par. Unacceptable for a company with the supposed stellar reputation as Samsung. (I own a Samsung Galaxy Note II). Consequently, I returned the camera and will either purchase a Nikon or Canon. The 8 megapixel camera on my phone was of a more superior quality than this cam! The only reason I gave it two instead of one star is because of the color, features and potential. Be warned as 100 bucks is by no means a cheap investment for a point and shoot.", "Date": "January 9, 2014"}, {"Title": "Pure junk", "Author": "Alexander", "ReviewID": "R3N8HFYWL0GZL3", "Overall": "1.0", "Content": "Bought it, returned it. Pictures are blurry with the slightest movement. It doesn't even come close to being a good camera.", "Date": "April 10, 2014"}, {"Title": "Poor picture quality, Poor wifi connections", "Author": "Ryan Law", "ReviewID": "RG73XVT7TTOGR", "Overall": "2.0", "Content": "I purchased this point and shoot for my wife to enable direct uploading to FB and her computer.  Setup was easy, but the actual process of uploading pictures was cumbersome and took way too long.  Must have been 5+ steps and each time you have to connect to a wi-fi network.  Not only that, but the picture quality was terrible.  It is possible we weren't optimizing the pictures we were taking, but this is a point and shoot camera.  That is all I wanted to use it for.  Leave it in auto, point and shoot.  We were coming from a Canon Powershot SD1000 that was several years old.  Well, I am glad we hung on to the Canon, because I ended up selling this Samsung camera on that auction site and going back to the Canon.  Much better image quality.", "Date": "July 20, 2013"}, {"Title": "Cutest Camera Ever", "Author": "G. Haywood \"Reader\"", "ReviewID": "R2GRDDXU11MXF4", "Overall": "5.0", "Content": "This is the cutest thing that I have ever seen.  I got the white one for a great \"daily deal\" price.  I have not used it yet to take pictures because I do not have a memory card, but sakes a live this thing is cute!!!", "Date": "November 18, 2013"}, {"Title": "A Truly Sad Excuse for a Point and Shoot Digital Camera", "Author": "Ahmed \"Ahmed\"", "ReviewID": "R3A9FZ613RQ6LE", "Overall": "1.0", "Content": "This is the most disappointing excuse for a camera I have ever used.  My attraction to it was the front LCD screen, as I was going to a wedding that my young nephews were attending.  I thought the front screen would be fun for them and I thought it was an interesting feature.Being in the camera business for forty years, I knew I wasn't buying a $5,000 camera.  I DID expect to get a basic point and shoot camera that could create an acceptable 5 X 7 inch print.  As it turns out, I am ill that I took this camera to the wedding rather than buying a $5 disposable film camera or simply using my iPhone.Other problems with the camera are that the battery only lasts about 200 images before it has to be recharged again; it requires that you recharge the battery while inside the camera, as there is no separate AC charger provided;  the built in flash only has a range of about 8 feet even as 400 ISO; and it uses a micro SD card, which should have been clearly disclosed in the Amazon write-up. I had to run to Radio Shack to buy a micro SD card, which was ridiculously expensive.Do not waste your money on this camera.  EVERY one of the 200 images I took tonight are not sharp enough for 4 X 6 prints.  If you are ONLY going to view the images you create on an iPhone you are viewing from 5 feet away, then possibly consider it only if you are real fan of useless bells and whistles.", "Date": "November 9, 2013"}, {"Title": "do not buy this item, blotchy focus", "Author": "John Kerr", "ReviewID": "R15VILMXTISSZS", "Overall": "2.0", "Content": "the focus is blotchy, turns out a friend has one also, and their camera is also blotchy in its focus, do not buy this item", "Date": "October 29, 2013"}, {"Title": "Dont buy this, it's cheapo and has bad quality!", "Author": "P. Lau", "ReviewID": "R175M5SA91S7FT", "Overall": "1.0", "Content": "Bad camera.Always out of focus.The face detection can't detect human with hat on or small baby face!!!!The battery drains so fast if you turn on the wifi!!!Uses micro SD instead of normally seen SD card!!!Compatibility problem with Sandisk micro SD card!!For god's sake, get a better brand. This camera for sissy or nub.", "Date": "December 2, 2013"}, {"Title": "NO internal memory and NO memory card included", "Author": "Amazon Customer", "ReviewID": "R1YFT5WZSG9ZJ4", "Overall": "1.0", "Content": "When I received this camera, I began taking pictures only to find the internal memory on this camera only allows for 2- that's right 2 photos to be taken before declaring the memory full.  If the internal memory is so low, a memory card should be automatically included with the product.  How lame.", "Date": "November 20, 2013"}, {"Title": "Very pretty", "Author": "Ruth Householder", "ReviewID": "R3PLICWZVFSL2T", "Overall": "3.0", "Content": "It's my fault.  I am 81 and don't know much about digital cameras.  I had to take it to a store to figure out what I needed to do to get it working.  It's a beautiful little camera and I am sure I will learn to love it.", "Date": "November 6, 2013"}, {"Title": "Mini Fingers", "Author": "gail", "ReviewID": "R1BG8N3FO35OCM", "Overall": "2.0", "Content": "The camera was cute but it's made for those with tiny hands and fingers. Kind of hard for an adult to reach all the little buttons. The front screen is so tiny it would be hard to take more than 2 people in the photo. I bought for a trip with 2 of my grand kids an had to seen it back I will use my I Pad instead.", "Date": "June 4, 2013"}, {"Title": "NEVER had it want to try it", "Author": "Kaci Boling", "ReviewID": "RE3KTJ9ACB6KP", "Overall": "3.0", "Content": "I DON't know if  it is good or bad so I choose in between. I just DON't like cameras I love them so I want the plum colored on", "Date": "December 1, 2013"}, {"Title": "Not satisfied", "Author": "Seraph", "ReviewID": "R3H966K75748NT", "Overall": "2.0", "Content": "I got this camera because I thought it was a good deal.  When I got it, I realized that the quality was not what I expected of a Samsung product.  Still learning how to use it, which says a lot.  When I got it, it was labeled for Central America or something to that extent.  Overall I am dissatisfied with this buy.  It actually took longer to leave the facility than to ship to me.", "Date": "July 9, 2013"}, {"Title": "I am angry at Samsung and their stupid policy", "Author": "Deborah Coleman", "ReviewID": "RNPF0SQOYXHI9", "Overall": "2.0", "Content": "This product has no users manuel....I looked for a long time to find one online and finally called samsung to request a users manauel...This product has o many features and i am clueless how to use it.  They will not...they sent me a link and said i have to print out the 163 page manuel if i want one. ///i am furious...and will never buy another Samsung product again...ever.  If i buy a expensive peice of equiptment ..i expect good diretions on how to use it.....This camera should have been fun ...and i hate it now", "Date": "August 14, 2013"}, {"Title": "Doesn't work as Described", "Author": "Daphne B. Goodyear", "ReviewID": "RP8KKNO49JZLA", "Overall": "1.0", "Content": "The directions that come with this camera are terrible, terrible, terrible. Spent an hour on my own trying to figure out how to use the wifi feature and could not.  This is the main reason this camera was purchased.  Then I spent a good 30 minutes on the Samsung Chat Live feature with a \"customer service\" person trying to understand the directions for sending a picture.  The cs person was incompetent.  She did not know what the home screen was.  By the time I logged off I was more confused than when the communication began.  This Samsung person told me I need a smartphone to use the wifi feature effectively.  Don't know if this is true, but I have no more time to spend figuring out how to use this camera.  I love Samsung products, but they need to have customer service personnel who know how to help their customers.  I am returning the camera to Amazon.Samsung DV150F Dual-View Smart Digital Camera (Black)", "Date": "June 25, 2013"}], "ProductInfo": {"Price": "$149.99", "Features": "1.5\" Dual View Front LCD, 2.7\" Back LCD\nSmart features - Social Media Upload, E-mail, Direct Link, Mobile Link, PC Auto-backup, Remote Viewfinder, All share, Cloud Service\n720p HD Video", "Name": "Samsung DV150F 16.2MP Smart WiFi Digital Camera with 5x Optical Zoom and 2-Inch front and 3-Inch Rear Dual LCD Screens (Black)", "ImgURL": "http://ecx.images-amazon.com/images/I/519rvk4DJeL._SY300_.jpg", "ProductID": "B00BBJIFWE"}}