{"Reviews": [{"Title": "Nikon D5200", "Author": "francisco j. rodriguez", "ReviewID": "RBMQVYAJSV4HO", "Overall": "5.0", "Content": "I am giving it 5 star rating for the amount of items that came along with this package is fair enough. I was looking for an upgrade to my current camera for the one I have is a fuji pocket camera which is ok but failed in so many good moments. The good things about this package are well the two Nikon lenses, Precision lenses that attach to your Nikon lenses gives you a wide view look and a fish eye view, extra battery, memory card and a tripod for your camera. I did not like the Nikon carrying case for its to big but it will carry everything that is included in this package but I just transfer the lenses and camera to a different smaller bag when I go out on a trip; also I recommend you buy a better screen protector for the one they supply you with is terrible to the touch and you have to cut it with scissors to fit your screen. The pictures I took with this camera are excellent crisp and clear and I have no regrets in spending what I did for this camera for it has a quality feel and look to it. I choose this model over the D3200 mainly for the pull out monitor feature which prove to be a wise choice for those tough angles when you have to get down close to the floor or if you choose to take picture of you with the family you can turn the display facing out were you can see yourself prior to clicking on the remote to take a picture. The remote is included but the wireless receiver is not I did select to buy this extra add on separately myself for you can use your smart phone as a controller/viewer just download the app for it or transfer your pictures via wireless.", "Date": "May 9, 2013"}, {"Title": "Amazing!", "Author": "Hills1106", "ReviewID": "R1AJ3UXXBJ7DU8", "Overall": "5.0", "Content": "The camera and nikor lens are amazing!  This is a great deal!  I am very impressed with the entire kit. I already have a tripod and a better camera case, so I am not planning to use those.  However, this was still a great deal even without using those two pieces. Thank you!", "Date": "January 3, 2014"}, {"Title": "Nice package", "Author": "Jeff Holloway", "ReviewID": "R3ANEP67DKOVOS", "Overall": "5.0", "Content": "Everything in the package is great. Tripod on the flimsy side... but for a light portable... not bad. The wide angle and zoom are cheap and really of no value to me. However, the value was there even without those. Purchased a quality wide angle.", "Date": "January 2, 2014"}, {"Title": "Love my Nikon 5200", "Author": "deb t", "ReviewID": "R2X8B8ROXCZZ8N", "Overall": "5.0", "Content": "I love the camera, but still learning.  Don't really care for the Nikon bag, will probably look for a sling bag.  The inexpensive tripod is about 4 feet tall, if that much.  I will only use to take Xmas photos of family members sitting by the fire place.  You will probably want to get a better and sturdier tripod if you care about your camera.", "Date": "August 29, 2013"}, {"Title": "My First Nikon DSLR", "Author": "75914", "ReviewID": "R2MXRU2ZHJ79SP", "Overall": "5.0", "Content": "I'm still learning how to use  my new DSLR. It is easy to set up date time on menu and won't take me more than 30 minutes. My first took a picture with my new DSLR. The picture I took look good but I'm still need more to learn to make it function right.I love my Nikon D5200 and fast delivery on time as advertise", "Date": "July 16, 2013"}, {"Title": "Versatile and well built", "Author": "Robert S. Weidner \"booknerd\"", "ReviewID": "R3SI02OP6YBUW2", "Overall": "5.0", "Content": "I bought this bundle because it includes products that let me photograph a variety of subjects.  The 300mm zoom gets you close to wildlife and sports play, while the kit lens let's you photograph closer objects.  Tripod for longer exposures and the wireless trigger to eliminate vibration when using the tripod.  Nice sturdy case to carry it all in.  I am very happy with this purchase, and unless you're a pro looking for a camera for your studio or field work, you'll probably be happy with it too.  Packaged well and safe.", "Date": "July 7, 2013"}, {"Title": "Amazing Deal!", "Author": "Amber Hohider", "ReviewID": "R3G8GA0LURX6JF", "Overall": "5.0", "Content": "I've been pricing the Nikon D5200 for awhile now... we wanted a nice camera to take with us on our honeymoon to St. Lucia. I came across this bundle and couldn't pass up the deal. The camera itself takes AMAZING pictures. There's a lot to learn based on the size of the manual but without reading the details was still easy straight out of the box.Along with all the additional \"goodies\" this package came with- I think we're all set to take as many pictures as we can manage!", "Date": "June 7, 2013"}, {"Title": "Disappointed", "Author": "Ray", "ReviewID": "R33SH6G2C20Q6T", "Overall": "1.0", "Content": "The camera takes great pictures when it takes a picture but I get a \"shutter release error\" over 50% of the time resulting in no picture. It is very annoying and frustrating. I thought I had done my homework since this is my first DSLR but not a single review I read mentioned the shutter release error common to Nikon cameras.I would not purchase a Nikon product again and I would not recommend Nikon to others.", "Date": "October 27, 2013"}], "ProductInfo": {"Price": "$1,049.95", "Features": "KIT INCLUDES 15 PRODUCTS -- All BRAND NEW Items with all Manufacturer-supplied Accessories + Full USA Warranties:\n<1> Nikon D5200 Digital SLR Camera & 18-55mm G VR DX AF-S Zoom Lens (Black) + <2> Nikon 55-300mm VR DX AF-S Lens + <3> Nikon Digital SLR Camera Case +\n<4> Transcend 32GB SDHC 300x Card + <5> Spare EN-EL14 Battery + <6> Vivitar 52mm UV Glass Filter + <7> Vivitar 58mm UV Glass Filter +\n<8> ML-L3 Shutter Remote Control + <9> Precision Design 58\" Tripod + <10> PD 2.5x Tele & .45x Wide Lens + <11> PD SDHC Memory Card Reader +\n<12> HB-45 Lens Hood + <13> PD 6pc Complete Cleaning Kit + <14> PD Memory Card Storage Wallet + <15> LCD Monitor Screen Protectors", "Name": "Nikon D5200 Digital SLR Camera & 18-55mm G VR DX AF-S Zoom Lens (Black) with 55-300mm VR Lens + 32GB Card + Battery + Case + Filters + Telephoto & Wide-Angle Lenses + Tripod + Accessory Kit", "ImgURL": "http://ecx.images-amazon.com/images/I/518CyKtj6JL._SY300_.jpg", "ProductID": "B00B3VIWYG"}}