{"Reviews": [{"Title": "Camera is great..rest all in the bundle is crap", "Author": "Anindita", "ReviewID": "R3GSX3VNG429QS", "Overall": "5.0", "Content": "---------------------------------------Sept 9th '13---------------------------------------It's been a month I am using this camera. Wanted to let you know few more things about this camera:Pros:(a) Pics in the day time are sharp and smooth. U won't ask for anything better.(b) Controls are pretty easy to understand. Just go to any photography website and look for what experts have to say about the settings.(c) the camera with 18-55 lens feels very light weight.(d) Fits in your hands just perfectly, and each and every button is at perfect place; be it the exposure controller, flash etc.(e) Liked the cleaning kit, though i did not and will not use the liquid to clean lenses. Liked the small tripod (other than the big one that came with the package), which u can keep on a table and shoot.(f) 32Gb memory card is good to have.(g) 55-300mm lens works great as it is supposed to be.Neutral:(a) 55-300 mm lens is pretty heavy, and it is supposed to be.(b) UV protectors are okay to have.(c) Tripod looks okay to me. I won't be taking it to trekking trips, so i don't care.(d) Extra battery is okay to have. Really didn't feel the need yet.Cons:(a) Camera bag looks cheap and is build quality is not at all good.(b) Watch out for the memory card. Mine went bad in a few days, and then i got it replaced by the seller.(c) Card reader can't get worse. I threw it in the dustbin, the second day.(d) Screen guards are cheap. DO NOT TRY them on ur camera screen.(e) \"Focus DVD\"... I don't know what that is.If you can... look for a deal with camera + 18-55mm lens + 55-300mm lens ONLY. Rest all is crap. I gave a 5 star only for the camera, nothing else.----------------------------------------August 25th '13----------------------------------------I am an amateur at digital photography and this is the first time i bought a DSLR. I had been to Best Buy and the salesperson there gave me detailed insights into 3 digital cameras... The Nikon D5200, Canon (forgot the model) and the Sony Nex. He said that he personally feels that the Nikon is the best of the 3 with lot more options and things to learn as an amateur and ease of use. Then I went to Ken Rockwell's website ([...] to see his comments and he says that D5200 is the best entry (+) level DSLR currently in the market, and after few discussions with my colleagues and friends I had come to a conclusion that I am gonna go for it. I ordered a D5200 on Amazon to be fulfilled by 47th Street Photo. I was gravely disappointed not at the camera but at 47th Street Photo, since they delivered me a camera with no US warranty, supposed to be sold in some other country. I got a replacement with 7-8 days though.Ken Rockwell, suggested few camera settings for low light (to increase the ISO sensitivity) and few more here and there, using which i got really awesome sharp shots. I personally feel, that this is an awesome camera for beginners.NB: Do not forget to check the warranty of the electronic item you buy. The sellers sometimes ship items without any warranty and supposedly to be sold in some other country, because they get them dirt cheap and buyers sometimes do not care or out of ignorance do not check the warranty of the items. If you do not have a valid US warranty, the manufacturer WILL NOT SUPPORT in case there is a defect in your item. Companies suffer huge losses because of gray marketing of products, making the product costlier as a step to cover losses.", "Date": "August 25, 2013"}, {"Title": "Great Camera", "Author": "Korny Kollins", "ReviewID": "R3G95IBI6D57KQ", "Overall": "5.0", "Content": "Love this camera ! Great pictures ! There us an excellant tutorial on You Tube that guides you through all the settings and extras !Easy to use even if you are camera challenged like me!", "Date": "April 17, 2013"}, {"Title": "Best Bundle Deal !!", "Author": "Dharma", "ReviewID": "RL1IJ6F8M338T", "Overall": "5.0", "Content": "This is the best bundle deal you can find !!!Pros:-Nikon D5200 is one of the best cameras our there in this price range.-The Nikon 55-300mm f/4.5-5.6G ED VR AF-S DX NIKKOR Zoom Lens is fantastic !!-A great bundle for a beginner.Cons:- Not an original Nikon battery but works great with the camera.- The tripod is not very strong.- The screen guard quality is not good. Would prefer not to use this.An amazing bundle for a beginner for a very good price. You can buy a wireless remote controlAmazonBasics Wireless Remote Control for Nikon D3000, Nikon P7000, D40, D40x, D50, D5000, D5100, D60, D70, D7000, D70s, D80, D90 and select Digital SLR Cameras to go with this.", "Date": "July 15, 2013"}, {"Title": "I friggin' love this camera and zoom", "Author": "Todd S", "ReviewID": "R1A3C4QCIBWJDA", "Overall": "4.0", "Content": "This is a great deal just for the D5200, both lenses, memory and extra battery. Everything else is just extra goodies.The camera is insane. I haven't had anything but a point-n-click since high school. I won't be going back. This camera, even on automatic settings, makes me a pro. Quick settings get you pretty much any great shot at the flip of a dial, even if you're no cameraphile. The auto-focus is flippin' brilliant; fast, easy to figure out, and dead-on.If you're going to keep it in a case and protected, the D5200 is your camera. If you're going to be in the elements, you'll want the D7100 -- same basic camera, just more weather resistant. But it also costs about $1k more.I'm stuck on the 55-300 lens that came with this camera, and it's really why I bought this package. I haven't even put the standard 18-55 on it, yet, and I've had the camera for months, now. The 55-300 gives incredible depth of focus, and being able to get super-top-notch-quality candids (especially of my 2-year-old) makes it ideal. Amazing in low light, too.The 32 Gig card holds a metric crap-ton of pics. And the extra battery is great to have, and lasts forever. The case is OK for what it is, and it'll fit pretty much everything from this kit, minus the tripod. But it was too clunky for me, so I bought an Ape case that'll hold the camera with the 55-300 on it, an extra battery and the charger -- it's all I really need to carry around.Only downside is that the UV filters don't fit on either lens. So that's a waste. I'd really like filters on to protect the lens, so I guess I'll have to find a local store to purchase proper ones. If the filters would've fit, I would've gone 5-stars.", "Date": "September 9, 2013"}, {"Title": "Awesome Nikon D5200 package", "Author": "Christian", "ReviewID": "RKO9ETQ7H2UJT", "Overall": "5.0", "Content": "The D5200 with the 300mm lens is top value (this is where the value of the package is - in my advice, it's worth getting the 300mm zoom lens (instead of the 200mm included in many of the kit options). The UV filters and bag do the job well.You can find many reviews of the D5200, but for a new photographer, this camera takes top notch pictures - very happy with the camera.The tripod is very cheap and I would not buy this package expecting a good tripod. I'm still giving the package 5 stars on the quality of the camera and 300mm lens.", "Date": "August 17, 2013"}, {"Title": "Nice photos, not so good video", "Author": "jguinness", "ReviewID": "RZTR0QP9ORRJ", "Overall": "3.0", "Content": "I know that I shouldn't have had the expectation that this would take good videos, but I did! It seemed to get good reviews in the video department so I was optimistic. Unfortunately, this DSLR has the same problem as most when it comes to focusing during videos. After the first round of shooting video of my kids, some of the clips turned out ok, while others were significantly out of focus. So...don't expect this to be a substitute for a real video camera. The technology is not quite there...yet.Also, in terms of the accessories...the SD card didn't work, but I was eventually sent another (though not very promptly). The HDMI cable doesn't actually fit into the HDMI slot on the camera (due to the width and bulk of the plastic sheathing), but I had my own HDMI cable so not the end of the world.", "Date": "July 23, 2013"}, {"Title": "Nice Camera", "Author": "Bob Snook", "ReviewID": "R33ABBBW2YEO3Z", "Overall": "5.0", "Content": "I like the camera but I admit I am learning how to use it and get through all the buttons. I was thinking there was a CD/Video that came with it to explain how everything works... NOT... I will take a class at the local college on how the \"how-to's and whys\" of shudder speed and the basics of the camera. I am disappointed at the quality of the tripod!!! The quick release broke the first time I used it !!!  Since I'm such a novice I 'm not sure about the lenses. The 18-55 seems to take nice pictures along with close ups. I tried the 55-300 on a night shot of the moon and was disappointed... Again could be that I haven't learned how to use everything yet. I was thinking the kit would be a good deal... But now I think if you are just starting out and learning about shudder speed and everything this camera can do the better way would be to get the basic camera!!! Then get more lens and accessories as you learn what you want/need to do the kinds of photos you are going to take. That way you won't have a bunch of stuff that is either poor quality or something you just don't have use for. IF YOU DO GET THE BUNDLE PLAN ON A BETTER TRIPOD !!!", "Date": "August 25, 2013"}, {"Title": "nikon D5200", "Author": "jpresley", "ReviewID": "R5G6LLVVOJ1TT", "Overall": "5.0", "Content": "I love this camera! The pictures with this camera are top notch for a amateur photographer like myself. The kit made it real easy to have everything you need to get out there and start shooting as soon as the intended package arrives. Service was top notch shipped very well and not a single problem from start to finish.", "Date": "May 18, 2013"}, {"Title": "Excellent value, but camera body better than the lenses...", "Author": "Phil Lowe", "ReviewID": "R3Q6WJVRK66Q1E", "Overall": "4.0", "Content": "Got this camera for my wife's birthday (I own and use the Canon 5D MkIII). Great camera body.  Kit lenses are soft.  I ended up purchasing the Nikon 28-300mm f/3.5-5.6G to replace both the kit lenses, and will be selling those.The tripod is flimsy.  I would not put any camera of value on it.  Everything else came in the bundle as advertised, so no complaints there.  With the Nikon 28-300 on this body, this camera takes some sharp, richly colored photos, but there's a reason the Canon 5D3 is more than 4x the cost: much better images in every kind of light.  Megapixel ratings are not the whole story when evaluating a DSLR.  Yes, the Nikon is 24 megapixels (vs. my Canon's 22.3), and this little Nikon yields good images with a good lens, but it's very noisy at high ISOs owing, in part, to its smaller APS-C sensor.Yet while comparing the Nikon D5200 to a full frame Canon 5D3 isn't really a fair comparison, this Nikon does outperform the 18 megapixel Canon T3i in terms of image quality.  I would not hesitate to use the D5200 as a backup to my Canon on a paid shoot if needed, providing the light was sufficient to keep the ISO at 400 or below.", "Date": "September 19, 2013"}, {"Title": "ALL is terrific except. . . . .", "Author": "Sherri M.", "ReviewID": "R1FNKYUXFAGC4K", "Overall": "4.0", "Content": "The tripod is not sturdy - the legs are very thin - no way would I ever mount my expensive camera on that tripod.Will donate this one and will purchase a better one.The camera - exquisite!!", "Date": "August 3, 2013"}, {"Title": "Gray Market Product, buy from another seller.", "Author": "roger", "ReviewID": "R3ROPP5KJMX98Q", "Overall": "3.0", "Content": "Got this camera bundle from my wife as my Christmas gift.Note that this is a gray market product which is not mentioned at all in the description, just a statement of full USA warranty,which I am scared to ever have to try out.The camera and 18-55mm lens are from Thailand and the 70-300mm is made in China.I would have preferred that this disclosure be made so that I knew for sure what we were getting.So far the camera performs well, the rest of the bundle is just fluff.", "Date": "December 16, 2013"}, {"Title": "All is Good - However . . .", "Author": "Alexander Kraemer", "ReviewID": "RGR07RV7MBRF8", "Overall": "4.0", "Content": "As this is my first investment into a DSLR, I really like the kit idea. However, I have to say that the Tri-Pod is absolute rubbish. This would be my constructive criticism: I would suggest to either exclude the BOWER Tri-Pod from the kit completely or offer a decent Tri-Pod, even if it means that the cost for the kit has to increase slightly. Seriously, how can you spend hundreds of hard earned dollars on a fantastic camera to then have it supported on a crappy Tri-Pod. FYI - It's weak spot is where the camera connects to the Tri-Pod, follwed by the flimsy verticle telescope extention.->AK", "Date": "January 2, 2014"}, {"Title": "A great camera if all goes well!", "Author": "Jeanne Gambino", "ReviewID": "R1U0ZMY7Y58Y3U", "Overall": "4.0", "Content": "I really loved the camera...light...easy to use...beautiful pictures...a great upgrade from my D40X.  Unfortunately I had to send it back because one of the lenses did not work correctly.  The problem with buying a bundled product is that you cannot just swap out the defective lens...you have to pack up the entire bundle and return it.", "Date": "November 15, 2013"}, {"Title": "So far great choice!!", "Author": "Cristian Vasile", "ReviewID": "R27JUHZFLWCBRJ", "Overall": "5.0", "Content": "This is my first DSLR camera. I'm lucky because I have a good friend of mine who is using these type of cameras for last 7 years and he help me a lot with searching for the right camera. So far looks complicated but I'm sure after reading and using camera every day I will learn more than the basics. The camera comes with DVD for the manual which is very handy for me in special because I'm traveling a lot. The bundle came well packed and camera toghether with lenses well protected.", "Date": "November 11, 2013"}, {"Title": "Pleased!", "Author": "olfogy", "ReviewID": "R1021EUL3N5OEF", "Overall": "5.0", "Content": "This is an excellent product and great service. Everything arrived when and as expected.It is great to get a package deal that includes all of the items that you need to get started without the need to go back to the store multiple times to buy the essentials. To be sure, there are items that I will add as I gain experience and develop my own style but I am off to a good start with what was provided.Good job! Thanks", "Date": "August 31, 2013"}, {"Title": "Great first \"good\" camera", "Author": "kenneth guy stupi", "ReviewID": "RUGYEXFPDUC1B", "Overall": "5.0", "Content": "This is my first digital slr camera and it is great compared to anything I have ever owned, of course, I have only owned low end cameras. It is easy to figure out how everything works and the picture quality is fantastic. I found the package to be the ebst deal I could find beating the Costco price by $60 and having a bunch of extra stuff. The extra battery is nice to have but I didn't need it depsite taking 300 pictures over an 8 day period.My only criticism would be that the extra lense wasn't quite as strong as I thought it would be and couldn't focus on images at distances that I thought it would be able to.Most impressive is the action setting - this camera can take pictures as fast as you can press the button - very cool for surf pictures.", "Date": "August 20, 2013"}, {"Title": "Great package!", "Author": "Gary Rathbun", "ReviewID": "R2RN1GEWBXVT6R", "Overall": "4.0", "Content": "The pricing of this package is great.  The cost elsewhere would have gotten you just the camera base and telephoto lenses only.", "Date": "July 29, 2013"}, {"Title": "Non-Nikon Accessories suck...", "Author": "Murthy Rayaprolu", "ReviewID": "R2NHOG7JB1SJDO", "Overall": "2.0", "Content": "The very reason I bought the kit is to use all the accessories. However, most of the Non-Nikon accessories are either inferior in quality or do NOT work. For example, the spare battery for Nikon D5200 turned out to be a generic brand and the camera does NOT allow the battery to be used. The camera bag is very inferior in quality and the camera stand is so slim that it may not hold the camera properly.  I wish I have more than 30-day warranty on some of these items for me to get a refund or be replaced (of the bad products) with better/working products of the kit.", "Date": "September 18, 2013"}, {"Title": "The camera and lens are brand new and in good condition, but details of the package still need to be improved.", "Author": "Reggie Li", "ReviewID": "R3CP3P5DBS24Q6", "Overall": "4.0", "Content": "I booked this kit on Oct 9, 2013, Wednesday night, and I used the 2 days primer shipping.And it didn’t arrive until the next Monday (Oct 14, 2013).Good things are:1. Most the items are included in the package. (7. I don’t have the Free 25 Quality Prints inside…)2. The Nikon D5200 camera body and lens are all brand new and in good shape.Bad things:1. The package was not that well protected, the outside box was already been pressed down, not enough cushions inside to protect the camera box. But thank God the camera and lens are all fine.2. The really bad thing I want to point out here is the SLR Camera Gadget Bag, not good at all. The Bottom of the bag is really thin, easy to break. What really made me sad it that it was covered by mould~ I don’t think it can be used to keep the camera and lens as they require a clean container… SO I COULDN’T use the bag….3. I didn't know that the camera already has the Nikon neck strap inside the camera package. SO I order another multi-color neck strap, which is fine, maybe I can use it as a back up later4. The camera itself already has a protection plan, so I made a mistake to order a “Square trade 2-year camera accident protection plan” at the same time, which is shipped but still haven’t arrived yet…5. The Tripod W/Case seems fine to me, the cleaning kit is ok, the LCD screen protectors works out fine, but not in that good quality.6. The Focus DVD guide to digital SLR Cameras, HDMI cable for HDTV connection they are not really useful, but it’s good to be contained in the kit.7. I don’t have the Free 25 Quality Prints inside…All in all, the camera and lens are good, which are very satisfied to me. But if you want the costumes to give you a 5 stars here, you need to improve the quality of the things in the package.(So an important and good thing about this package is that it a good kit, under the condition that everything they shipped to you is like what they promised… So order this kit first, after it arrived checked it carefully and then decide what else you need, it will save you some money.)", "Date": "October 27, 2013"}, {"Title": "Great camera, good bundle", "Author": "Juan UY", "ReviewID": "R1SDQGME9F1VS4", "Overall": "4.0", "Content": "This review is about the bundle, not specially for the camera.Camera and lens are 5 stars for me, but I already knew that. I chose the bundle as it was cheaper than just buying camera+lens.Basically all this made any extra item a freebie.- Filters seem very good for their price ($0)- Memory card was a very nice surprise as I received a Sony rated for 40 Mb/s instead of the generic one shown in the pictures.- Extra battery seems OK, it works fine in the camera, haven't tested battery life yet.- HDMI cable looks good- Cleaning Kit it looks like a toy, not planning to use it at all.- Card reader is better than the one shown in the picture, although it feels a bit cheap. Would be 3 stars.- The LCD protective films haven't been open yet, so no comments on this.- SD Card Wallet, looks OK, although not great or very useful for me. Probably would rate it 2.5 or 3 stars.- Can't comment about the tripod as I haven't receive it yet (not vendor's issue, the bundle was received by my father and he hasn't give it to me yet :) )- The bag was the only real deception, is much cheaper than it looks in the pictures, I was already planning to buy another one but now I HAVE to buy a replacement. Feels really really cheap. I would rate it 2 stars.To sum up, the bundle is OK (would be 3 stars) as I already had low expectations for all the \"additional\" items. I raised to 4 stars based on filters and SD card being nice surprises, better than expected (mainly SD card).", "Date": "October 23, 2013"}, {"Title": "Camera", "Author": "Sidonia", "ReviewID": "R1FBYVY09WY6K0", "Overall": "5.0", "Content": "I like the camera and all the items. As a beginner photographer I'm content with the product.I recommended to everybody who want to start a photography career.", "Date": "June 6, 2014"}, {"Title": "Grandson excited", "Author": "John R. Johnson", "ReviewID": "R3OH6UNN97UDBO", "Overall": "5.0", "Content": "Hope this camera will expand his horizon and maybe offer a beginning to a new career. Has it with him all the time.", "Date": "May 13, 2014"}, {"Title": "Nikon D5200 24.1 Digital SLR", "Author": "Craig in Florida", "ReviewID": "R1VM1D6Q232QB", "Overall": "5.0", "Content": "I have enjoyed using cameras for many decades, but I am by no means a professional photographer.  Rather, I use cameras mostly as a hobby, but occasionally I've submitted photos to newspapers or local weather forecasters and had them published or shown on one of the local stations.  The purpose of this review is more to help you make a decision on the D5200 and whether it's the camera for you, not to go into technical jargon.  Up until the time I purchased this camera, I relied mainly on a Panasonic DMC FZ28 \"point and shoot\".  Since I was used to getting reasonably decent zoom with the FZ28, I opted to also purchase the Nikon 55-300mm VR lens to complement the 18-55mm VR lens that came with the D5200.  Between those two lenses, I figured I could cover most needs, but there are some minor drawbacks because it takes time to change the lenses and it's bulky to have to carry both of them around with you. That having been said, there is no question that the D5200 is one heck of a camera.  It takes crystal clear photos and has more functions than I will probably ever use in a lifetime.  However, if you are like me and had never used a digital SLR before, the level of sophistication this one possesses will probably leave you a bit lost at first. Therefore, if you do opt to get the D5200, you might want to consider getting a copy of the book \"Nikon D5200 For Dummies\" by Julie Adair King to help guide you through its many functions.  I won't go into the contents of that book here, but you can read my review of it elsewhere on the Amazon website. In short, I found the book to be extremely helpful and to be an excellent reference tool.  While the D5200 does have an automatic function, which makes it perform pretty much like a point and shoot, you would be wasting your money to buy the D5200 if that is the main thing you want to do with it. Since I've only had this camera for a short while, I'm still in the learning stage but I've already produced some really neat photos that would not have been possible with the Panasonic.  If you can think of something you would want a camera to do, this one probably does it.  Since it's clear that many of the reviews for this camera were written by folks who are either professionals or close to it, you will probably get a better picture (no pun intended) of what to expect from the D5200 from them than anything I would be capable of providing from the limited time I've had to mess around with it.  As indicated above, my purpose in writing this review was more to give you a heads up about what you'll be getting yourself into with the D5200.  It's a great camera, but get ready for a long learning curve if you want to use it to its full ability.  It's also not as \"handy\" as a point in shoot.  Not only because of its size, particularly with the 55-300mm zoom lens affixed to it, but also because you don't have the ability to go from taking a photo of something close by or which required a wide angle and to then quickly convert to a sizable zoom or vice versa.  And, if it's an action shot or a shot of a distant bird or animal and you have the 18-55mm lens in place at the time, you could easily lose the opportunity to get the picture you want.  That would not happen with a point and shoot that provides instant zooming with no lens change.  This is something to think about when you consider this camera, especially if it's going to be your only camera. While I do love the D5200, I am also going to be investing in one of the newer point and shoots with the improved zoom capability to replace the Panasonic DMC FZ28.  Then the challenge will be which camera I want to have with me when I head out to take some photos.", "Date": "May 8, 2014"}, {"Title": "Tripod was not present in the bundle.", "Author": "Sandeep B", "ReviewID": "R3TVHIW8S434D4", "Overall": "4.0", "Content": "I received the package yesterday, tripod was missing, bag is of medium quality, SD card is from Sony, Camera and lenses look good. I was not expecting much in the bundle after reading past reviews.They are Made in Thailand but have US warranty. I will review about the camera and quality of photographs after a few weeks.", "Date": "May 8, 2014"}, {"Title": "not much value in the bundle", "Author": "VBEN", "ReviewID": "R39ZLTZLQF4EFE", "Overall": "3.0", "Content": "No question about it, I love the Nikon camera and the lenses. I have taken so many great pictures and I am sure there are more to come.I chose this bundle because you get a lot of the things you need, grouped in one order. Not so happy about that ...- the card reader stopped functioning after 6 months- the tripod is not very strong- the extra battery is not made by Nikon and is not an approved one - every time I have an issue and I call Nikon, this is what I hear- the memory cards are not the approved ones by Nikon. I lost around 500 pics in my first card and the explanation from Nikon was again that I was not using an approved cardPS I am writing this review 6 months after my original order", "Date": "March 25, 2014"}, {"Title": "Very satisfactory", "Author": "Suprio Sen Gupta", "ReviewID": "R10OEW645MEWZ2", "Overall": "5.0", "Content": "The kit has everything that has been promised, generally of good quality and everything in working condition. A good value order pack.", "Date": "March 19, 2014"}, {"Title": "Nikon D5200 24.1 MP CMOS Digital SLR Camera Bundle", "Author": "Gina Miller", "ReviewID": "RLYNGF5MA426", "Overall": "4.0", "Content": "This is a terrific camera bundle pacakge. The quality and number of items is astounding and the condition of the packaging was terrific. Most everything you would need to start taking professional pictures right away is in the box!  The shipment was a week late due to the inventory of the camera but after I contacted the company and they advised me of the new delivery date I was very much pleased when my purchased arrived in the next 2 days.I would highly suggest this camera and the Nikon brand for moderate to serious photographers looking to capture amazing photos.", "Date": "March 6, 2014"}, {"Title": "For the most part, I was satisfied, But...", "Author": "Donald Colquhoun", "ReviewID": "R3655862KE3ZUE", "Overall": "4.0", "Content": "As for the service and the shipping timing, I was completely satisfied. But the adjusting handle on the tripod came broken in the packaging. After researching the cost of the tripod, I didn't feel it would be worth while seeking a replacement tripod from the company, because of taxes, duty and shipping.  So I just purchased one locally.D.", "Date": "February 22, 2014"}, {"Title": "The Camera bundle with the lens are outstanding value", "Author": "Hossam Eldin M.Abbas", "ReviewID": "R1IX61W2OHSR73", "Overall": "4.0", "Content": "- Nikon d5200, as a DSLR one of the high end beginners camera, i use it in my trip the pictures are amazing the features are huge.- The lens are Nikkor original with warranty and everything.- Extra battery is good.- The memory card is good.- The 2 filters are good- The cleaning kit average.- The bag is poor the material is not good, in my second week the zipper is broken, and the bag has a tear from inside, so i bought another bag.- The tripod i didn't use it but from first inspection its quality is lowso overall the value for money for this bundle is very good from my opinion", "Date": "January 28, 2014"}, {"Title": "Excelent!!!", "Author": "Victoria Blazevic", "ReviewID": "R2FGZS4SFZKPDV", "Overall": "5.0", "Content": "I recieved the whole pack in perfect conditions! I was amazed by how complete it was... its a great starter kit at an excelent cost!", "Date": "January 27, 2014"}, {"Title": "Excellent!", "Author": "shepron", "ReviewID": "R20ET6DT1GGTRW", "Overall": "5.0", "Content": "It can be as complex or as simple as you like. It's a lot of fun. You can be really creative with the camera.", "Date": "January 22, 2014"}, {"Title": "Nice but.....", "Author": "Amazon Customer", "ReviewID": "R12EBYEEAPOG3X", "Overall": "4.0", "Content": "Good bundle for the price.  Wish i had got the shown in the image though.  The vivitar o e i got looks and feela like a cheap knock off doesnt even have pockets.", "Date": "January 20, 2014"}, {"Title": "Great Camera, Great Deal!", "Author": "S", "ReviewID": "R38PNSILBN4OCM", "Overall": "5.0", "Content": "I love this camera!! It has so many settings and options.  I am a beginner and the DVD that comes with it helped me out a lot! Great camera!", "Date": "January 16, 2014"}, {"Title": "Good", "Author": "Kalyan M Golla", "ReviewID": "R1WOIP6PBO86N2", "Overall": "4.0", "Content": "The product is good and the accessories are also except for the SD card reader which is a crap. It hardly worked for 3 times before it completely stopped working.", "Date": "January 15, 2014"}, {"Title": "LOVE IT", "Author": "NDB20", "ReviewID": "RDXCV7K7BXSKL", "Overall": "5.0", "Content": "Beautiful Camera, love the entire package, it comes with everything I need plus more. The bag is a bit small, to fit everything I would want too, but it does come in handy for quick fun shoots especially with the family. Besides that its a very high tech camera, the quality is perfect and the lens are great!", "Date": "January 8, 2014"}, {"Title": "EXCELENT", "Author": "Luis Pedro Gramajo", "ReviewID": "R195N0SKOJMT", "Overall": "5.0", "Content": "This kit is really the best... love the camera and the lenses that it comes with, were the ones I needed, the bag is not fancy but I got another one for a descent price!", "Date": "January 7, 2014"}, {"Title": "Great bundle at Good Price !!", "Author": "pavan", "ReviewID": "R2517GK663HC4T", "Overall": "4.0", "Content": "Good Price and timely delivered to us. This is a really good bundle and reached my exceptation.Nikon D5200 is user friendly and really fits for begineers. i recommed it to others.", "Date": "January 2, 2014"}, {"Title": "got more than paid for", "Author": "Russ Biesecker", "ReviewID": "R3FHQ0SJFPY6N2", "Overall": "5.0", "Content": "Bought this bundle for the 2 lens and camera body. Most of the other items are OK, but not highest quality. Kind of frosting on the cake. Cheaper than the 18-55 with body, and 55-300 separate.", "Date": "January 1, 2014"}, {"Title": "Great bundle!", "Author": "valerie", "ReviewID": "R2UQBPZU38EDVF", "Overall": "5.0", "Content": "Love the camera, and the 55-300 extra lens is well worth paying for. The product was shipped and delivered in a timely manner. This series camera is significantly lighter than other companies compatible models. My friend has a cannon and this is weighs almost half what hers does. I would highly recommend this bundle to anyone looking for semi-pro photography.", "Date": "December 26, 2013"}, {"Title": "great bundle", "Author": "nicole bennett", "ReviewID": "R5BHSXLNMZ1TI", "Overall": "4.0", "Content": "Great bundle! Everything you need to get started!! Good quality case, handy to have UV lenses protectors. Wish the LCD screen protectors were pre-fitted to screen size instead of having to cut myself, but that's my only complaint!", "Date": "December 23, 2013"}, {"Title": "Excellent collecton of stuff and an excellent Camara of course!", "Author": "B. Yee", "ReviewID": "R3LQJ4YF9950W3", "Overall": "4.0", "Content": "Thank you for the nice package of peripherals included with this camera the best being the tripod and lense of course..  the carrying case is large but effective while the filters were nice in quality.", "Date": "December 21, 2013"}, {"Title": "Liked it for the most part", "Author": "Anna", "ReviewID": "R3IDCQ9XT6BST0", "Overall": "4.0", "Content": "The extra 55-300mm lens it comes with is really nice, way better than the plastic 18-55mm lens. But that is to be expected when you buy a camera that comes with a lens. It is great for a starter camera but I wish I would have done some more research before I bought it because for your first DSLR camera you should split your budget by spending 1/3 of it on the camera body and the other 2/3 on a really good lens! So my suggestion if you want to buy this camera is to buy just the body and then search for a quality 18-55mm lens. That is the lens you will want to be using for most photos (unless you only do close ups..). So other than that, I really like this camera. :)", "Date": "December 19, 2013"}, {"Title": "Almost a perfect delivery!", "Author": "Vinicio H.", "ReviewID": "R144N5GK8CHJ35", "Overall": "4.0", "Content": "In general the godos arrived in very good condition. It would have been perfect experience, but the BONUS!! Free 25 Quality Prints did not come with the package.", "Date": "December 18, 2013"}, {"Title": "good product", "Author": "Juan Jose Correa Palacios", "ReviewID": "RK510YH2ZE5MZ", "Overall": "4.0", "Content": "good product is as specified in the description very good quality and transportationhighly recommended for people who like photography.", "Date": "December 17, 2013"}, {"Title": "Very Loud Autofocus when shooting video.", "Author": "David R. Cohen", "ReviewID": "R2UUAIL8RNVB1O", "Overall": "2.0", "Content": "The lenses do not feel like quality Nikon lenses.  They are not smooth and do not compare to Nikon higher quality products.  When I tried to shoot video the Autofocus was so loud it completely interfered with the audio in my test videos.  I was hoping this would be a quality product with less bells and whistles than the more expensive Nikons.  Unfortunately, It really didn't feel like a Nikon at all.  I am returning it.", "Date": "December 17, 2013"}, {"Title": "Camera and accessories surpassed the expectations", "Author": "Miami \"Rugby Man\"", "ReviewID": "R2HKT0E2GUZC1F", "Overall": "5.0", "Content": "Camera and accessories surpassed the expectations 100% thumbs up. Versatile and have everything you need to take great pictures. I highly recommend it.", "Date": "December 16, 2013"}, {"Title": "Great Bundle!", "Author": "Donald Smith", "ReviewID": "R2RLXIWZ4PX7E9", "Overall": "5.0", "Content": "Box arrived as advertized.Every thing works except the card reader.Could not fit it in any slots especially with the card in the reader.I use the cord anyway.Every thing else fits and works ok.I think the tripods fine.Good enough to get you going.I have used the 55-300 on it with no problems.At $700-$750 with the 18-55mm kit lens the extra stuff you have to buy make the bundle worth it in my opinion.The 55-300 is worth $230-$395 depending on where you shop.Its not a tac sharp L lens but i enjoy it.The bag is not top of the line but usable if you use some caution not to stress the zippers too much.It should last a year or two depending on the usage.You will appreciate the extra batt.The camera is the camera.You have  seen the reviews on line,that's why I bought this bundle.The 5200 and the 55-300 telo with the 18-55mmlens.I have taken some great night scenes with this camera.In all I recommend this bundle.Enjoy.", "Date": "December 15, 2013"}, {"Title": "Not all items included", "Author": "Carlos Rodriguez", "ReviewID": "RXP2OI2M1OIUQ", "Overall": "1.0", "Content": "Everything was fine except the 10 piece kit. When asked the vendor about it, they said it was not included. After a couple of emails, they offered a basic kit for free, but with no memory and no battery, which was one of the reason the deal was appealing to me. The returned finally took place, I had to pay for the return ($16), and they reimbursed me ($10), so I was out $6 and a lot of waisted time and effort.", "Date": "December 11, 2013"}, {"Title": "Good purchase", "Author": "michis0870", "ReviewID": "R2SUPOPAYITXEP", "Overall": "5.0", "Content": "excellent bundle! It has a lot of accessories! It comes with exactly all the things listed. The camera its excellent.", "Date": "December 10, 2013"}, {"Title": "More than Expected", "Author": "bigaldepr", "ReviewID": "RI6D8U9O4ANIV", "Overall": "5.0", "Content": "First the Nikon 5200 is an awesome camera for point and shoot or hobbyist photography. My daughter plays volleyball and high school gym  lighting is a challenge but I got great results. The 55-300mm lens produces great pictures from the stands. I was really impressed with the package as there is everything you need, even things that were not listed in the description like lens hoods for both lens and a nice protective cloth bag for the telephoto lens. The bag is just right for the bundle and good quality. To sum it up this is a great bundle around a great camera and I would highly recommend it for the amateur photographer.", "Date": "November 10, 2013"}, {"Title": "Pretty good.", "Author": "Jean Roguier", "ReviewID": "RZJ274GKEO7B6", "Overall": "4.0", "Content": "Everything came in time and in good shape.The bag is sufficently big enough to fit everything in it but the tripod.The camera and objectives came with an extended warranty offer from Nikon.It would have been nice to know about it, I would not have bought one of my own...I hope I can still return it.", "Date": "October 22, 2013"}, {"Title": "nikon 5200", "Author": "jay", "ReviewID": "R26YH6ZTQGLTRO", "Overall": "5.0", "Content": "I love the result and fast and free shipping from seller and everthing working good. Nikon has lots improvement on photography and bundle gave you everthing just click and go.", "Date": "October 21, 2013"}, {"Title": "Amazing Camera with all the needed accessories.  Can't beat the price!", "Author": "mattinCA", "ReviewID": "R2AQIHJ2UAUGXG", "Overall": "5.0", "Content": "I knew the Nikon D5200 was one of the best rated DSLR Cameras out there, especially for the reasonably priced cameras.  I watched tons of reviews and read up on it.  I'm 100% happy that I picked not only this camera, but this kit that included all the stuff I needed to really get started.  Awesome!", "Date": "October 20, 2013"}, {"Title": "Love it!", "Author": "Tammy", "ReviewID": "R637IL137LHN1", "Overall": "5.0", "Content": "Great starter kit. Easy to use camera. Takes great photos. Definitely a good bargain for the money. I would recommend this.", "Date": "October 19, 2013"}, {"Title": "The Nikon D5200", "Author": "Jeff Shaffer", "ReviewID": "R3PYDY7KTEUCST", "Overall": "5.0", "Content": "The Nikon D5200 and lenses are everything I had hoped for.The tripod is on the cheap side but for the price I can't complain.There was an issue with the camera bag,how ever when I contacted Focus they corrected the problem with no hassle,and a lot faster than I expected.I am very happy with the purchase and would buy from both Amazon and Focus Camera again.", "Date": "October 5, 2013"}, {"Title": "Chineese battery", "Author": "Richard E. Hovan", "ReviewID": "RSII75D7HPL5Q", "Overall": "4.0", "Content": "Great camera but, after charging the battery one time battery died after about taking 40 pictures at a wedding. After recharging the D5200 would not except the battery. Made in china battery. Had to buy a Nikon Japan battery and it works fine now. An extra $50.00 I didn't expect to pay!", "Date": "October 4, 2013"}, {"Title": "Fantastic Camera", "Author": "phpinky", "ReviewID": "R3P0WCCCZ9RXWB", "Overall": "5.0", "Content": "The delivery was fast. The camera was everything that I would expect from a Nikon. Easy to use and beautiful pictures. Would recommend to anyone serious on taking pictures.", "Date": "October 2, 2013"}, {"Title": "Nikon D5200 24.1 MP CMOS Digital SLR Camera", "Author": "bonnie hollier", "ReviewID": "R38DA3WBGUTH6E", "Overall": "5.0", "Content": "So far I am very happy with the camera. I leave it on auto mode, most of the time, but I am slowly venturing out with it. I know it has many possibilities. So maybe in a few months, I will rate it again.", "Date": "September 3, 2013"}, {"Title": "Great Package", "Author": "Donald E Cannon", "ReviewID": "R36HRCQEPVE6ZU", "Overall": "5.0", "Content": "I have used Nikon cameras for about 10 years. First and D-70, then a D-80 and had great results. Now with the D5200 results have been even better.  It is a smaller and lighter body, but the with \"Big Time\" features and results whether photos or video.  The package provides one every thing one might need for quality shots.", "Date": "August 29, 2013"}, {"Title": "Would have purchased items separately", "Author": "Kris", "ReviewID": "RZ0VKHSNPCUG1", "Overall": "3.0", "Content": "Very pleased with the camera and lenses.  Displeased that the extra battery will not charge.  In order to get it replaced, I would have to return entire package. I also was expecting a nicer camera case, tight fit to place another lens inside.", "Date": "August 16, 2013"}, {"Title": "Delivered as described", "Author": "Amazon Customer", "ReviewID": "R3L9AQX4JAKP7P", "Overall": "5.0", "Content": "All of the items in this \"package purchase\" was as described. Nikon 5200 is a blast, easy to use. All of the additional items had been used. I did purchase a sturdier more professional tripod but all in all I am very happy. As ordered, delivered immediately, very pleased.", "Date": "July 28, 2013"}, {"Title": "Excellent camera!!!", "Author": "Vlamir Aparecido Bueno", "ReviewID": "R1375KA4RY2D47", "Overall": "5.0", "Content": "I choose Nikon D5200 because it's an excellent camera. It has great features and, in adition, it's very beautiful. I recommend for everyone. One more thing: Amazon is the best place to buy.", "Date": "June 14, 2013"}, {"Title": "Nikon D5200", "Author": "William S.", "ReviewID": "R3H534531Q6TPW", "Overall": "5.0", "Content": "Great camera, thoroughly enjoy the step up from what we had. It's not to hard to learn, even for a old guy like myself", "Date": "May 26, 2013"}, {"Title": "Nikon D5200 - AWESOME!", "Author": "Roy Barnes", "ReviewID": "R30YTKFMZLT5C3", "Overall": "5.0", "Content": "Sorry I can't write too much about my new D5200. I'm too busy taking pictures! I recommend everybody to go Nikon!", "Date": "May 19, 2013"}, {"Title": "Poor Quality Lenses", "Author": "T' Bird", "ReviewID": "R12ZDM58IQ8520", "Overall": "3.0", "Content": "The D5200 camera appears to be good, but it is hard to tell as both lenses... 18-55, and 70-300 are very poor image quality. My Canon SX260HS takes sharper images.This is my first DSLR, and I am very disappointed with picture quality. The upgraded Nikon lenses cost way more than I can afford. Unless you can afford these expensive lenses, stay away from this package deal...it's not worth the cost. Get a good Canon Power Shot.", "Date": "November 27, 2013"}, {"Title": "Great value and price", "Author": "anita burleson", "ReviewID": "R156V4TOL4GFDQ", "Overall": "5.0", "Content": "This is an upgrade from our older version camera.  The package deal was a great buy, arrived early and is a great camera.  There is so much more we can do with this newer model.", "Date": "November 10, 2013"}, {"Title": "The camera is excellant for me.  I had a canon A1.", "Author": "Rodney Barrier", "ReviewID": "R3TRUQ0QPGUQE1", "Overall": "5.0", "Content": "The Zoom is more powerful than what others offers and the sd card is twice as big.All the extras is just a plus.", "Date": "October 28, 2013"}, {"Title": "The price was exceptional!", "Author": "Claustrophobia", "ReviewID": "RU1B351CYKPN0", "Overall": "4.0", "Content": "I am loving this camera, and I have barely begun to understand everything.  Also, we didn't receive the extra battery that was supposed to be in the original shipment, but we got it quickly after contacting them.  What sold us was the fact that both lenses are Nikor.  The quality is fantastic, and the pictures are excellent, even zoomed in from very far away.  The only thing I'm not as thrilled with is the quality of the bag and size.  I'm going to have to buy a new bag, because it is way too small and won't fit the camera with the larger zoom lens provided in the kit. That is a minor thing, however, because the lenses and camera are awesome!", "Date": "September 21, 2013"}, {"Title": "Focus Nikon D5200 'Kit'", "Author": "Amazon Customer", "ReviewID": "R1ED1NRIEJA7OM", "Overall": "5.0", "Content": "Ordered and received this camera package about a month ago.  The package arrived exactly as promised and contained everything a novice such as myself needed to get started  I've not taken as many photographs as I would like but I've captured a couple that I didn't think I could do.  I've also learned how much more i have to learn.", "Date": "August 19, 2013"}, {"Title": "Great Package", "Author": "R Michaels", "ReviewID": "R13LH7FHRJTOH", "Overall": "5.0", "Content": "The camera is everything I expected and more.  I really like the move mode, it takes great video.  The package comes with everything you would need for a new camera purchase.", "Date": "August 11, 2013"}, {"Title": "Great camera at a great price", "Author": "Clyde A. Boyd", "ReviewID": "R2LN6BU98UCVRV", "Overall": "5.0", "Content": "I purchased this Nikon D 5200 and have been very pleased with the product and all the accessories that came with this package. This was very competitively priced and it arrived on time and in good condition and therefore I can recommend this product.", "Date": "July 31, 2013"}, {"Title": "My D5200 bundle.", "Author": "Ricardo Mosca Miranda da Cruz", "ReviewID": "RPA521GQ2DK4B", "Overall": "5.0", "Content": "I have not yet used my Nikon D5200, but my first impression was the best possible. I think the tripod is fragile for this photographic computer and, at this moment, i am reading the Owners Manual.", "Date": "August 4, 2013"}], "ProductInfo": {"Price": "$1,419.95", "Features": "This Kit includes 14 items all with USA Warranty and manufacturer's supplied accessories\nNikon D5200 24.1 MP CMOS Digital SLR Camera Body (Black) - Nikon 18-55mm f/3.5-5.6 AF-S DX VR NIKKOR Zoom Lens - Nikon 55-300mm f/4.5-5.6G ED VR AF-S DX NIKKOR Zoom Lens - 52mm UV Protection Filter - 58mm UV Protection Filter\n32 Gigabyte SDHC Secure Digital Memory Card - Secure Digital USB Card Reader - Universal Memory Card Wallet - Pack of LCD Screen Protectors\nAdditional EN-EL14 Rechargeable Lithium-ion Replacement Battery Pack - Well Protective SLR Camera Gadget Bag with Pockets & Strap\nFull Size 59\" Tripod W/Case - Focus DVD Guide to Digital SLR Cameras - Focus 5pc Deluxe Lens Care & Cleaning Kit - HDMI cable for HDTV connection - BONUS!! Free 25 Quality Prints", "Name": "Nikon D5200 24.1 MP CMOS Digital SLR Camera (Black) with 18-55mm f/3.5-5.6G AF-S DX VR and 55-300mm f/4.5-5.6G ED VR AF-S DX NIKKOR Zoom Lenses + EN-EL14 Battery + 10pc Bundle 32GB Deluxe Accessory Kit", "ImgURL": "http://ecx.images-amazon.com/images/I/51EwfZlINWL._SY300_.jpg", "ProductID": "B00B5JUYOM"}}