{"Reviews": [{"Title": "The kit gets 2 stars the camera is 5 stars.", "Author": "dan", "ReviewID": "RT5Z1NSKQLSL8", "Overall": "2.0", "Content": "This 2 star review is for the kit, the camera gets 5 stars. Why 2 stars? This is because Camera does not fully disclose the additional off brand items.  Here's the real rap; The d5200 camera, 35-55 and 55-300 lenses are of great value and quality. The Nikon camera bag works, with the addition of a 35mm fixed lens to this kit, it took some arranging effort and was a hate then love relationship. The \"Power 2000\" battery was recognized by the camera so it works though is not the 50.00 Nikon I expected. The SD card is good though I would have preferred the faster SanDisk. The battery grip is good, not perfect but helps me hold the camera and worth 25.00 if you like it. The tripod, a \"Precision PD-58pvtr\", is flimsy and sells for 19.00. The remote is generic. The sheet screen and UV lens protectors are a must have. The Precision/Vivitar Macro/wide and telephoto converter lenses are junk having no value, they are not usable. The item \"<13> cleaning kit\" was NOT in the package I received. The REAL value of the items: The camera and 2 Zoom lenses 18-55 and 55-300 for 1000.00, compared to other available kits, are a great 5 star bargain. As for the little stuf; Nikon brand camera bag 30.00, generic battery 20.00, SD card 52.00, battery grip 24.00, tripod 19.00, lens and screen protectors 20.00. remote 8.00, 52mm lens hood 3.00, macro/telephoto lenses 0.00, cleaning kit not received 0.00. These little extras cost and additional164.00 and have an actual value of 176.00. Or maybe 200.00 if you like the macro/tele lenses and get a cleaning kit.  Not a bad value though you do not get your choices and if you find more than the macro/telephoto lenses unusable you will lose out as I did. For me the tripod has no value so I lost money, I already have a cheap one like this I would not trust a 1000.00 camera on and am stuck with items I would not buy. I'm guessing, as a kit, returning any these little items may not be possible?After calling Camera they are sending the cleaning kit. However, they will not take back an individual item and if you buy a package the whole thing would have to be returned. This is something to consider. I would highly recommend buying the packages with the camera lens combos and not the ones with all the little trinkets.", "Date": "July 13, 2013"}, {"Title": "excellant buy", "Author": "Richard Bevilacqua", "ReviewID": "R2EZONVMHJZJO3", "Overall": "5.0", "Content": "I have a D80 and the difference in pic quality for enlargements is outstanding. I use the 18-135mm lens that I had with my D80 for most shots so if this is the first camera you are buying I would go with the that lens first rather than the 2 separate lens. The added battery attachment and 64 GB card makes it very convenient for shooting video without running out of battery or space. The videos come out great. I was able to shoot my granddaughters (2) ballet recitals without any other lighting. It picked up the stage lighting perfectly. You do need to use a separate hard drive to store your photos & videos so you don't use up computer space. I also use \"Drop Box\" for sending photos or videos to family & friends due to the size of the attachments you get with this camera. Really glad I made the step up from the D80.", "Date": "June 24, 2013"}, {"Title": "Everything I Expected", "Author": "James C. Hulten", "ReviewID": "R5AFAB72EYNMA", "Overall": "5.0", "Content": "The D5200 outfit is all that I expected it to be.  I have used Nikon camera equipment for over 50 years and have never been disappointed in its performance.  I recently spent 9 days visiting 7 national parks in 5 states.  The photos I took are exceptional.The camera is easy to use and understand. I love it!", "Date": "October 2, 2013"}, {"Title": "Good product", "Author": "Jorge Ruiz", "ReviewID": "R2DBWLF2LMJF0K", "Overall": "5.0", "Content": "The product was delivered on time, in its original box and ready to use. With accessories and working properly. The items are original and come with warranty Nikon's serial number. I really liked the program to download photos. It is an excellent kit for beginners in professional photography at a reasonable price. Was charged a taxes of 8% in the final price. The product was received well packaged and each item separately and well protected.", "Date": "May 17, 2013"}, {"Title": "Excellent Quality - Great Bundle", "Author": "RishiChandraSuresh", "ReviewID": "R3TLN8BIZKC23T", "Overall": "5.0", "Content": "Excellent Quality - Great picture, study stand, great memory card, carry bag was good.yet to use wide angle and precision lens. everything looks great.I would recommend this to friends.", "Date": "November 1, 2013"}, {"Title": "The Package is very good!!!", "Author": "ADRIANO GOMES CESAR", "ReviewID": "R2I12U5GQ7ZPSA", "Overall": "5.0", "Content": "I bought this package to use during my vacation and It was very useful!!!  Even my wife that only liked to be in the photos started to take some!!! I would recommend.", "Date": "July 12, 2013"}, {"Title": "WOW!", "Author": "Dawn K. Andrus", "ReviewID": "R1QLU8EI2VHJXN", "Overall": "5.0", "Content": "Comes with so many things!  Great value and a wonderful camera for an amateur.  We bought this to take with us to Africa on safari but have used it in the meantime to take some incredible photos. VERY pleased!", "Date": "May 26, 2013"}, {"Title": "Excellent product!", "Author": "Valeria Alvarez Puente", "ReviewID": "R1VXKXPXH432BN", "Overall": "5.0", "Content": "The kit is very complete. The variety of products is well chosen and it feels so good not having to buy them separately. I liked this product very much. I've already used the camera and the kit products and the quality of all of them are above my expectations.", "Date": "May 22, 2013"}, {"Title": "Great deal", "Author": "Hugh D Carpenter", "ReviewID": "R832FHL320HVK", "Overall": "5.0", "Content": "From everything I read this was, by far, the best deal for the price.  Great camera.  The accessories were awesome.", "Date": "January 17, 2014"}, {"Title": "Awesome package!", "Author": "Aaron", "ReviewID": "RANH5G61O3IAV", "Overall": "5.0", "Content": "Very happy with this purchase!  All products were Nikon and included warranties, and the quality was great.  I Love it!", "Date": "September 7, 2013"}, {"Title": "Nikon 5200 review", "Author": "Bobbie", "ReviewID": "R28TEL8N0QDXWU", "Overall": "5.0", "Content": "I purchased the Nikon D5200 because it was quieter than my other Digital SLR camera. I wanted something quiet to take pictures at church and school gatherings. I chose Nikon because of their reputation. I have been extremely happy with my new Nikon. It is my favorite camera.", "Date": "July 21, 2013"}, {"Title": "A great value, and a great camera kit", "Author": "Steven M. Katchur", "ReviewID": "R258VNRVNAHHKX", "Overall": "5.0", "Content": "This camera kit is good value for your money if you consider buying all of the components separately. all of he components are great! excpet the tripod, which is still ok, but not amazing.", "Date": "June 11, 2013"}, {"Title": "amazing", "Author": "C. Hill", "ReviewID": "RFUGMCPKN3130", "Overall": "5.0", "Content": "This camera is amazing. It takes wonderful pictures and it came with everything we needed! The bag is hug and you can fit everything you need in it!", "Date": "June 8, 2013"}, {"Title": "nikon d5200 slr", "Author": "O", "ReviewID": "R29VJDWE7J0ZE6", "Overall": "5.0", "Content": "the camera is more that we dreamed it to be. the picture quality and details are outstanding. I purchased it for my husband as a Happy Retirement gift, I have never seen him so enthus", "Date": "June 1, 2013"}, {"Title": "The Best", "Author": "larhug", "ReviewID": "R1YN2LXXU2W78", "Overall": "5.0", "Content": "I was an avid 35mm fan and finally decided to make the move to digital.  Boy did I hit a home run with this package. There are some expected learning difficulties but everything in the kit was top quality and I enjoy it on a daily basis. Wish they offered a 2nd kit to purchase after you buy the camera kit, something to finish off the 'must haves' for digital cameras.", "Date": "April 29, 2013"}, {"Title": "Still learning...", "Author": "Natalie Richardson", "ReviewID": "R10IWAYX6OH8RQ", "Overall": "5.0", "Content": "I love it! Still learning all the bells and whistles, but I love it so far. Now I am just looking for easy to use software to edit the photos I have taken, all 2000 of them.", "Date": "April 29, 2013"}, {"Title": "First Camera", "Author": "Derak Carrington II", "ReviewID": "R2YJP4U3RQTTXP", "Overall": "5.0", "Content": "I love it and my professional photographer buddy was impressed. I watched alot of Nikon vs Canon videos plus advice and I'm satisfied for my first buy", "Date": "August 28, 2013"}, {"Title": "Grate Camera and acessories.", "Author": "Eduardo", "ReviewID": "R1U5FIQCER7RLM", "Overall": "5.0", "Content": "Very good quality of all products. I do recommend it.It was very nice to get the camera with acessories.", "Date": "June 7, 2013"}, {"Title": "After couple months, the flash stops working", "Author": "KevinB", "ReviewID": "RTOY0FOVN7FFH", "Overall": "1.0", "Content": "The camera is still under guaranty.  Nikon service representative said I have to send in this camera to Nikon service center for repair and I am responsible the cost of sending.  Too much trouble to own this camera!  Wish a better experience.", "Date": "February 26, 2014"}, {"Title": "Great camera", "Author": "David T Bishop", "ReviewID": "R2OSFFDP7GMKRL", "Overall": "3.0", "Content": "The camera, lens and tripod were great.  Most of the other accessories were cheap (especially the protective cover for the LCD display.", "Date": "August 20, 2013"}, {"Title": "awesome", "Author": "josh moore", "ReviewID": "R1MZ9SDCIBO1QI", "Overall": "5.0", "Content": "the camera was great we just wrapped up a production shoot and we love it. the video quality is awesome. however still trying to figure out the bugs with the lighting and stuff like  that . better to use manual focus instead of auto focus. in the mic setup for recording audio is really not that bad... I was really impressed d 5200 Nikon really impressed me", "Date": "August 14, 2013"}, {"Title": "Great camera", "Author": "Overton", "ReviewID": "R8Y0ECO9XLCI7", "Overall": "5.0", "Content": "Great camera with good features. Ready to get into DSLR photography as a hobby. Good accessories for the money. Only wish package came with polarized lens instead of UV ones, but again it was a good value for the money. I can always go and get the polarized lens at a later date. Package arrived early which was great too!", "Date": "August 12, 2013"}, {"Title": "Product was exactly as advertised.", "Author": "Tom", "ReviewID": "R29L7TY9008X3S", "Overall": "5.0", "Content": "I received the package within a week. Everything was included and works great. I have had the camera for three weeks now and I love it. It takes great pictures and it is easy to use. You do need to take the time to get to know the features to fully appreciate the camera. If I had to make the purchase again, I wouldn't change a thing. Good product and good company to order from. I recommend them!", "Date": "August 6, 2013"}, {"Title": "Very IMPRESSED", "Author": "Glenda Barnes", "ReviewID": "R2524QY362P5R9", "Overall": "5.0", "Content": "I was really impressed with all the pieces that came with the camera. I was thinking about purchasing from another company, but your bundle came with some of the pieces I was going to buy. I got a lot more items  for the same price.  Thank you for such a great offer.", "Date": "June 9, 2013"}], "ProductInfo": {"Price": "$1,049.95", "Features": "KIT INCLUDES 15 PRODUCTS -- All BRAND NEW Items with all Manufacturer-supplied Accessories + Full USA Warranties:\n<1> Nikon D5200 Digital SLR Camera & 18-55mm G VR DX AF-S Zoom Lens (Black) + <2> Nikon 55-300mm VR DX AF-S Lens + <3> Battery Grip for D5100 & D5200 +\n<4> Nikon Digital SLR Camera Case + <5> Transcend 64GB SDXC 10 Card + <6> Spare EN-EL14 Battery + <7> Precision Design 58\" Tripod +\n<8> Vivitar 52mm UV Glass Filter + <9> Vivitar 58mm UV Glass Filter + <10> ML-L3 Shutter Remote Control + <11> Precision Design 2.5x Tele & .45x Wide Lens +\n<12> Precision Design HB-45 Lens Hood + <13> Precision Design 6pc Complete Cleaning Kit + <14> Precision Design Memory Card Storage Wallet + <15> LCD Monitor Screen Protectors", "Name": "Nikon D5200 Digital SLR Camera & 18-55mm G VR DX AF-S Zoom Lens (Black) with 55-300mm VR Lens + 64GB Card + Case + Grip & Battery + Tripod + Tele/Wide Lenses + Filters Kit", "ImgURL": "http://ecx.images-amazon.com/images/I/51GsfdrVl2L._SY300_.jpg", "ProductID": "B00BEX5V06"}}