{"Reviews": [{"Title": "New into DSLR's", "Author": "Riken Nyodu", "ReviewID": "RYVIBNCIO24DH", "Overall": "5.0", "Content": "I have been using digital cameras for a long time but recently switched over to DSLRs. And Nikon obviously was my first choice. I Chose Nikon D5200 from D3200. And I had searched thoroughly over the internet and dealers but couldn't get a better deal than this one. 15 items in the kit for about 1k, this was a great deal for me since i would have wasted a lot of money buying the items included in this package separately.I'd say go along and get it from here :) Thank you for your service. Looking forward for more.", "Date": "May 3, 2013"}, {"Title": "Great set of equipment", "Author": "Clint", "ReviewID": "R3W0AEKXZMTL1B", "Overall": "5.0", "Content": "This bundle is amazing. Its a great beginner set-up and easy to use i havent gotten into all the features yet but its still a great bundle", "Date": "April 16, 2013"}, {"Title": "Great Quality Package by a Great Vendor", "Author": "Gil From FL", "ReviewID": "R1XOPXF4N9VJC7", "Overall": "5.0", "Content": "I had researched this Nikon Model and included Lenses for quite some time.  I was leaning on purchasing this package from Costco.  However, upon researching I was pleasantly surprised by the Package deal from Cameta Camera.I placed the order a week before my scheduled vacation.  The package arrived ahead of promised date from the vendor in a well protected plain brown box, which did not contain any indication of the items enclosed.I was able to get all the items I needed to get me through my vacation.  For the price, this package was a far better deal than the one provided by Costco.  All the non-Nikon items appear to be quality constructed.  The only item that did not meet my expectations was the LCD Monitor Screen Protectors.  I did not reduce my five stars rating, since most LCD protectors are not user friendly.During my vacation, I took over 1,600 pictures with this camera and some videos.  The quality and sharpness of the results were outstanding.  Also the items provided by the package (e.g., the UV Filters, the 64 GB SDXC card, tri-pod, shutter release remote control and the spare battery) worked flawlessly.  I highly recommend this package from this vendor.", "Date": "October 3, 2013"}, {"Title": "Great Camera", "Author": "Stacie Carangelo", "ReviewID": "R26KCAQTEUILB8", "Overall": "4.0", "Content": "It was a great deal. However, the maco lens & telephoto lens included in the package are not that great. Over all I am happy with the camera and the zoom lens that was included.", "Date": "September 3, 2013"}, {"Title": "Great Deal and Great Service!", "Author": "Chris wilson", "ReviewID": "R2SER5UHIBVNJG", "Overall": "5.0", "Content": "This is my first DSLR camera and I have to say it is everything they say it is. Right out of the box I took my first stop-action shot of a hummingbird (using David Busch's Guide for the 5200), and was very pleased with how easy it was and how sharp the photo turned out.  I am really looking forward to learning how to use all the features on this camera.The remote control works well, but is slows down the process just a couple of seconds.The extra UV lenses protect the camera lenses.  The 300mm lense is great too", "Date": "August 15, 2013"}, {"Title": "I would recommend this seller to anyone", "Author": "Arnaldo Gonzalez", "ReviewID": "RH5M9PVQCNRVF", "Overall": "5.0", "Content": "This package was ideal for me. I just started taking photographs and I am looking forward to do this for a long time.", "Date": "July 8, 2013"}, {"Title": "Mixed bag", "Author": "MLS", "ReviewID": "R2NT1KO562FL4", "Overall": "4.0", "Content": "This was a mixed bag of good stuff and junk. I list the item numbers as listed on the Amazon page:1 & 2. D5200 & lenses - I like the camera and it's features. Good step up from my old D70. I wish the 18-55 was an 18-70 lens.3. Nikon bag - Kind of small but good quality.4. Transcend memory - good quality 10 series card. 64GB is the sweet side in capacity.5. 3rd party battery - Used it once so far and it seems like reasonable quality.6&7. Filters - Absolute crap. Embarrassing addition to this package. throw them away! NOW!8. NL-L3 - Used it only so far to test it works. Seems OK9. Tripod - Cheap plastic junk. I'll use it at places like the beach or on hikes because it's cheap I won't care if it gets wet or damaged. Only redeeming qualities are the carry bag and it is VERY light.10. Tele & Wide adapters - Junk! Junk!Junk!Junk!Junk!Junk!Junk!Junk!11. HDMI cable - Don't need it, haven't used it. No opinion.12. Lens Hood - Doesn't line up correctly on the lens. It's just OK.13. Cleaning Kit - I'll use my own lens cleaning fluid instead of the one supplied in the kit (based on the quality of the other Precision Design products included in this package) but I'll probably use the wipes and blower brush.14. SDXC wallet. Fine I guess. Don't really need it.15. LCD protector. 1st one peeled off after 2 days. I may have not applied it right. I'll use them when in harsh conditions like salt water locations.The Nikon part of this package and the SDXC card & camera bag was good $$$ value. Whatever else I can salvage from this package will only be a bonus. The junk items just took up space in the shipping box. I pity the poor amateur photographer that tries to use them, downright embarrassing for a professional. I would have preferred to pay a little more for the package if the junk products were replaced with quality products.Cameta Camera was good. Quick reply to a pre-purchase question and shipped with good protective packaging and in a timely manner.", "Date": "November 5, 2013"}, {"Title": "great camera", "Author": "EMANON", "ReviewID": "RGMXJBR90L5J7", "Overall": "5.0", "Content": "This camera has more than met my expectations! Not that they were extremely high because I am a noobie when it comes dslr, but it captures extremely life like photos of everything and best of all I can finally get a clear image of my daughter who doesn't stop long enough for a photo anymore! Shipping was fast and item was exactly a described, I would definitely purchase from cameta camera again!", "Date": "May 24, 2013"}, {"Title": "Exceptional Deal!", "Author": "rick hoover", "ReviewID": "R1KQQVVGO9ZRDB", "Overall": "5.0", "Content": "This item came very quickly and was well packaged. I actually first purchased it at Costco but returned it when I saw how many additional items came with this package and for a lower price. I'm still learning how to use all the features (and there are many) but I love this camera!", "Date": "May 20, 2013"}, {"Title": "great camera! great value!", "Author": "millybanilly", "ReviewID": "R1DZQ9OT74OH6H", "Overall": "5.0", "Content": "The camera arrived a few days before expected delivery! This was awesome, bc I got it in time to take pictures of my sisters bridal shower. Wonderful camera and very happy with all the accessories that came with it. This is the best deal by far if you are a new photographer, it comes with all the essentials.", "Date": "April 28, 2013"}, {"Title": "Great camera kit", "Author": "Chip", "ReviewID": "R1XL1O5WNHEWBT", "Overall": "5.0", "Content": "Amazing camera. I live this camera kit. It's a great camera and the accessories are all good fits for the camera", "Date": "July 14, 2013"}, {"Title": "So far so good", "Author": "Brian D.", "ReviewID": "R2068BLA5BBSFZ", "Overall": "5.0", "Content": "I was looking for an entry-level upgrade to my point-and-click and iPhone cameras.  Not sure if I'll use all of the accessories, but I guess it's nice to have them.  Camera itself is working out great.  Have also tried the longer lens and it makes a huge difference.", "Date": "June 11, 2013"}, {"Title": "WONDERFUL PRODUCT!", "Author": "Jacque McCandless", "ReviewID": "R3NWLNWM9FXF58", "Overall": "5.0", "Content": "I love taking photos of my kids and the beautiful scenery here in Hawaii and this camera makes this even more enjoyable!", "Date": "January 8, 2014"}, {"Title": "Perfect bundle!", "Author": "Dave H", "ReviewID": "R1TR6MDHGNO1RE", "Overall": "5.0", "Content": "I have been an iPhotographer for a couple of years now and decided it was time to go DSLR since there were things I wanted to do with my photography that simply can't be managed with a fixed lens point & shoot or camera phone. I researched for a few weeks before deciding on the Nikon D5200 and it became apparent to me that this is the perfect camera to start for someone who understands photography but needs a camera that can help teach the basics of DSLR functionality.The D5200 is the perfect compromise between price and performance. I shoot mostly in manual mode and do not use the auto settings very often. The menu system and controls are easy and allow for fairly quick transitions. There is no need to access the menus for F-stop, shutter speed or focal point adjustments, but you will need to access the menu for adjusting the ISO. This can be done fairly quickly though once you get used to how the settings work.I really like the graphical display of the settings on the screen and I do not miss having a touch screen even though that is the biggest complaint the pro reviewers mention when they talk about the D5200.For the price and features, I would highly recommend selecting this camera over the competitors including the entry level D3200 from Nikon. The performance differences far exceed the price differences in my opinion.Also, the 55-300 lens is a huge improvement over the 55-200 option offered in other bundles and the extra battery, tripod, and 64GB memory card make this bundle complete. You really will not need to buy anything else in order to get started.", "Date": "December 19, 2013"}, {"Title": "Happy Happy Happy", "Author": "K. Brown", "ReviewID": "R251Y7LRARVJZ3", "Overall": "5.0", "Content": "Arrival was speedy, well packed and it will be a learning experience.  A lot to learn about this camera and it's lens!", "Date": "December 16, 2013"}, {"Title": "Nikon D5200 Digital SLR Camera & 18-55mm G VR DX AF-S Zoom Lens Rated a Best Buy, everywhere.", "Author": "C. Schucke", "ReviewID": "R310CENV7X5DA6", "Overall": "5.0", "Content": "Top rated by many reviewers on many sites, as a best buy. I am not disappointed. Learn the menus and functions, and you'll be making amazing photos, in short order. The two lenses included make a perfect beginners package. You can spend more, but, this is the perfect place to start. Only if you have lots of money, and like to collect numerous lenses, would I suggest going with a Canon...", "Date": "November 28, 2013"}, {"Title": "Some things are great, some are not.", "Author": "BSUBenny", "ReviewID": "R2V37U6D9ZPZED", "Overall": "4.0", "Content": "The camera, lenses, SD card, and case are all top notch.  The rest of it can be done without.  On the plus side I can always give them as white elephant gifts at the company Christmas party.", "Date": "October 2, 2013"}, {"Title": "Great camera", "Author": "Janine C Wright", "ReviewID": "R14W7VETD7LBY6", "Overall": "5.0", "Content": "Takes great pictures!  Still learning how to use all the functions, but works just fine in auto.  I find the tripod to be very sturdy.", "Date": "September 1, 2013"}, {"Title": "perfect", "Author": "Malgorzata Marciniak", "ReviewID": "RC9OLSPN5HAJD", "Overall": "5.0", "Content": "for an amateur who likes experimenting with lights and shades, nice night photos and \"against the sun\" photos, good price for the set", "Date": "August 3, 2013"}, {"Title": "Good camera", "Author": "Ozz", "ReviewID": "R2P2F6RHF8JMGW", "Overall": "5.0", "Content": "I like it very much. it has many handy functions which you cam use them different ways. i am happy with my purchase.", "Date": "July 1, 2013"}, {"Title": "perfect for what I need.  Amazing bundle and kit.", "Author": "Daniel  Henigman", "ReviewID": "R36FJJCBP6FUKT", "Overall": "5.0", "Content": "THIS IS THE PERFECT SOLUTION FOR 24.1 MEGAPIXEL  needs.. I purchased it to take photos of my fine art for reproduction and use it now for so so much more ... plenty of extras with this bundle ,, highly suggest it  , great camera for this price pint ....", "Date": "June 4, 2013"}, {"Title": "Very much Satisfied", "Author": "Hunter", "ReviewID": "R17XMNWTLLLBDC", "Overall": "5.0", "Content": "Did not find better online deal consider all the stuff I am getting. It arrived on time and with right protection from possible inappropriate handling risks. Very much satisfied with the quality of photos I am getting with the camera.", "Date": "May 27, 2013"}, {"Title": "Excellent", "Author": "PAMELA LOPEZ", "ReviewID": "R2SQX7MSTR7ANZ", "Overall": "5.0", "Content": "I completely recommend this!!! I am fully satified with this product, it came on time and with all components I expected.", "Date": "May 27, 2013"}, {"Title": "Great Package!", "Author": "marty", "ReviewID": "R1RNILW43RI7JO", "Overall": "5.0", "Content": "This camera and bundle is quality all around. Nikon has out done itself with this creation and I can't wait to tell and show my friends!", "Date": "May 23, 2013"}, {"Title": "Fantastic Bundle", "Author": "RickW", "ReviewID": "R2RPKSOUG898KT", "Overall": "5.0", "Content": "I started out at Costco.com for a reasonably priced combo of Nikon 5200 body/lens.  In looking at this combo and comparing what it offered with the additional lenses and accessories, there was no doubt this bundle was the better value.  In reading some reviews of the seller I was slightly concerned about alleged delivery issues, but mine came earlier than projected and I tracked it the entire way.  The camera itself is much clearer and faster than other Nikons we have had; 24 mp is awesome!  Great camera, great bundle and great seller service ... hard to beat that.", "Date": "July 17, 2013"}, {"Title": "GREAT DEAL", "Author": "ellis", "ReviewID": "R2T03Y0R1M88RF", "Overall": "5.0", "Content": "I looked around at a ton of different places, and was worried about buying it online, thought maybe it would have been better in person, but it came fast safe and without any problems i bought it on the 12 month amazon financing plan which is intrest free for a year, so if you are thinking about it at all, this is the one! Great camera, great lenses, big memory card, great case, tripod and the rest of it is just extra stuff, but sure its good too.", "Date": "April 18, 2013"}, {"Title": "Great Camera", "Author": "Jeffery W. Curtis \"Jeffeeew\"", "ReviewID": "RM7I7JFSYQ7HH", "Overall": "4.0", "Content": "Great camera, but the extra lenses fell apart after I open.  Took me some time to put lenses back together.", "Date": "September 24, 2013"}, {"Title": "A GREAT DEAL", "Author": "JOHN SAMUEL", "ReviewID": "R2L7GTQ2JCUZZN", "Overall": "5.0", "Content": "As a world traveler, a great camera and perfect timing is of great importance. After checking for the best deals on the d5200 i choose this package. The delivery time was perfect,i choose regular shipping but the camera came before the expected date. I was impress with the packaging,as i had it delivered to my office,very nicely and discretely package ,our delivery boy and no one at the office was unable to know what i had in the package.After much consideration,this is by far the best deal ever,bigger and better than the big name department and electronic stores. The pictures are professional grade and the features on this camera is one of the best anyone can find anywhere,if you want it just get it,you will love it.", "Date": "July 25, 2013"}], "ProductInfo": {"Price": "$1,074.95", "Features": "KIT INCLUDES 15 PRODUCTS -- All BRAND NEW Items with all Manufacturer-supplied Accessories + Full USA Warranties:\n<1> Nikon D5200 Digital SLR Camera & 18-55mm G VR DX AF-S Zoom Lens (Black) + <2> Nikon 55-300mm VR DX AF-S Lens + <3> Nikon Digital SLR Camera Case +\n<4> Transcend 64GB SDXC 10 Card + <5> Spare EN-EL14 Battery + <6> Vivitar 52mm UV Glass Filter + <7> Vivitar 58mm UV Glass Filter +\n<8> Vivitar ML-L3 Shutter Remote Control + <9> Precision Design 58\" Tripod + <10> Precision Design 2.5x Tele & .45x Wide Lens + <11> HDMI to Mini-HDMI Cable +\n<12> Precision Design HB-45 Lens Hood + <13> Precision Design 6pc Complete Cleaning Kit + <14> Precision Design Memory Card Storage Wallet + <15> LCD Monitor Screen Protectors", "Name": "Nikon D5200 Digital SLR Camera & 18-55mm G VR DX AF-S Zoom Lens (Black) with 55-300mm VR Lens + 64GB Card + Battery + Case + Tripod + Tele/Wide Lenses + Remote + Accessory Kit", "ImgURL": "http://ecx.images-amazon.com/images/I/51gPCWe8ULL._SY300_.jpg", "ProductID": "B00B3VJ1XW"}}