{"Reviews": [{"Title": "Great features and photo quality", "Author": "David L. Oliver \"Desert Denizen\"", "ReviewID": "RS9B32QKZQ6XH", "Overall": "5.0", "Content": "I bought this camera for its portability, because I so often failed to have a camera with me when a great shot presented itself. I wasn't expecting too much, but was really surprised.The image quality is nothing short of amazing. The lens seems to have few aberrations anywhere in its very wide zoom range. I don't use the longer focal lengths much but really appreciate that it has the equivalent of 24 mm at the wide-angle end.This spring has been good for wildflowers here in the desert. I have taken many shots of plants for identification as well as working with flower macros, trying to achieve some \"artsy\" shots. I'm very happy with the results.I've also done some videos, notably one of ants being very busy. Looks great on the big screen at 1080p, even though the camera only takes 720.Of the multitudes of features, the best is wi-fi connectivity. Whenever the computer is on I can let it update the files on the PC. It makes folders for each day automatically and remembers what has already been saved. Works up to hundreds of feet from the router.It has a \"smart\" mode which makes all the decisions for you, a \"program\" mode with more control, and fully manual. The manual mode shows a histogram on screen, so you don't have to guess.Some nitpicking: The screen looks great in anything but direct sunlight; working outdoors can be difficult sometimes. While most images are nearly free of noise, noticeable noise appears in some, inexplicably. Sometimes autofocus isn't quite accurate. Given the price, feature set, and extreme portability of the camera, I can live with those little details.", "Date": "May 21, 2012"}, {"Title": "IMPRESSED", "Author": "Sully", "ReviewID": "R6F6S1PPY9ZQ6", "Overall": "5.0", "Content": "Update (October 2012):There are a few reviews on this camera from people who did not delve into the complex settings of the device you are looking at. Their reviews unfortunately dragged down the star ratings to an unrealistic rating. This camera is great! Image quality is great! However, I have not used the automatic mode very much. You will get amazing quality pictures when you spend time on your shots. There are simple settings like ISO (light sensitivity), aperture, and shutter speed. Toggling these settings will create awesome pictures worthy of your family album, Facebook profile, and personal website.____________________________________________________________________________________________________________________________I wanted a great camera to capture the beautiful landscapes of my life in the Midwest. However, I did not want a big fat DSLR-style camera or a compact camera with 5x zoom. And why not spring for the attractive white version?Prime shipping is awesome. I received this in less than 24 hours.Like I did, you may be reading critic and user reviews on various models and you'll be dazzled with each different variation on the same technology. This is an ultra-zoom compact camera which combines automated settings with the ability to vary settings manually, just as the pros do! The critics will say this or that about a camera, but they seem to me to always recommend the newest $300 model.This camera has an 18x zoom which can be used for both photos and videos. It has a 3-inch LCD screen and a dedicated video record button.You can actually edit photos during and after taking them, with different effects and scenes that may remind you of Instagram on your smartphone.Speaking of smartphones, THIS CAMERA HAS WIFI! So yeah, you can send photos and videos to Facebook, email, Picasa, Youtube, Photobucket, and Microsoft SkyDrive. Even better, with an Android or iPhone, you can use two apps that will interface with this camera: Mobile Link and Remote Viewfinder.Suppose you're taking a group photo, but you want to be in it! You can zoom, change basic settings, and snap the photo from your PHONE with Remote Viewfinder.Perhaps you want to transfer content from the camera to your phone: Use Mobile Link. In both cases, the Samsung WB150F creates its own wireless access point which pairs with your phone.The above features may work best with Samsung phones, however my HTC Droid Incredible worked perfectly for this! You won't regret your purchase!", "Date": "July 6, 2012"}, {"Title": "Gadgetry Galore!", "Author": "Photog Dude", "ReviewID": "R1XYQAAC3KLI8D", "Overall": "5.0", "Content": "I based my purchase mainly on the WI-FI, 18x ZOOM, and compatibility of my Samsung Galaxy phone.  First of all flash your camera to the latest firmware (May,2012).  Install the CD on your computer and there's pull-down for firmware upgrade, follow instructions, if you get lost, there's a blurb on YouTube on how to flash your camera.  Connect your camera to a wifi access point then begin uploading to SkyDrive, Picasa, FB.  Post directly to FB.  You'll need to create an account on SkyDrive to upload to the Cloud. I use DropBox I can appreciate saving to the cloud.  Enable your phone to \"hotspot\" then use your phone to connect to the Web.  I'm an avoid DSLR user so I wanted something that can be used traveling rather than carrying a gigantic DSLR.  The HD video is 720p and it's fine for my needs. It's a lot more stable than my JVC 3CCD HD 1080p, video is very stable.  Reviews say the color is most accurate and it's true, very vivid images.  You may want to mess with the general settings of contrast, brightness and color density to get it just right.  I TOTALLY recommend the Samsung WB150!  I'll post more as I begin getting into the guts of this camera.UPDATE: 8/17/2012: It's been 2.5 months and a 10 day vacation in the Caribbean.  Took over 2500 pics.  I still think it's a good camera, but it's not without it's faults.  After a few shots, my WB150 froze up and the only way to fix this to pull the battery. I purchased 2 after-market batteries (non-Samsung) and it seemed to be OK, but I'm suspecting the 3rd party battery might be causing the freezing.  The copying from camera to smartphone had gotten real slow.  I assume it might be due to the amount of data on the 32GB drive.  When you sync up to your smartphone, also Samusung Galaxy S, it's gotten a lot longer wait times for the pictures populate on the phone.  I tried a smaller SD card (16GB) with less stuff and it seemed to fix the slowness issue. Kinda makes sense. More pics it's gotta read, the longer the read times.  Oh, if you have a new SD card, be sure to format the card on the camera, otherwise, it's going to be slow times powering up your WB150.  We did get to upload pics from the WB150 to the smartphone and post to Facebook.  That was one of biggest reasons I got the camera to begin with.  The only way to enable the flash (fill-in) is \"P\" mode. Smart mode will determine if you need flash or not.  Smart wasn't a bad way to go if you're outside.  But in you're in the tour bus, disabling the flash is key. Let the camera figure out the rest. I admit I did not use my old DSLR (Olympus E-1) at all and kept using the WB150.  I like the Red video button. It's not to hit the video button while shooting stills.  There's a dedicated video setting  on the dial as well.  I'll keep you guys posted.", "Date": "June 6, 2012"}, {"Title": "Great Features, not so great camera", "Author": "bweets", "ReviewID": "R115YOGNB8W371", "Overall": "3.0", "Content": "Before I start, I should disclose that I am an owner of a Canon D-SLR so this review might be a little biased.I purchased this camera as a \"carry around\" point and shoot for occasions when dragging a D-SLR is not quite suited. Wanted something with reasonable telephoto and high megapixel (for printing) and was very impressed with the list of features including; wi-fi transfer, upload to MicroSoft Skydrive, Android live-view app (very cool) and some of the other shooting modes. The camera is full of fun features and they all work very well as described, the downside unfortunately is the camera. It takes wonderful pictures in wide-angle, broad daylight but anything beyond that it really struggles with. Night photos are very grainy as are telephoto photos in moderate lighting. The telephoto is understandable as many variables play into zoomed images but the night and indoor shots almost make you want to leave this camera at home and just use your smartphone. The indoor images are very comparable.All in all, it's not a bad camera and the price I paid on Amazon was fantastic. But in the end, I will likely not use it as much as I had originally anticipated. If you are looking for a point-and-shoot as an everyday camera, I would look to spend a little bit more and go for image quality over features first and foremost.", "Date": "September 21, 2012"}, {"Title": "Finally , A Camera To Love !!!", "Author": "Lauren", "ReviewID": "R3PTBKCYTNKZ3", "Overall": "5.0", "Content": "Anything I say would be superfluous. It has wifi. The different gadgets built inwill keep you busy for a long time.I can now talk to my Samsung 2012 LED 3D tv, with all thegadgets and Allshare. Take a picture and boom, it showsup on my tv. To bad it doesn't have a built in slot for a simscard? Hmmm, Samsung? All the other cameras I have arenow obsolete. THANK YOU SAMSUNG FOR A GREAT CAMERA....Job well done.I love the 'Remote Viewfinder' gadget! You can use an iPad,touch cellphone with Android gadget 'Remote Viewfinder'to remotely access and control your camera, via a homewifi network. You could monitor your baby from roomsaway and take pictures at the same time! This is reallya cool feature.Picture quality is amazing , 18x stabelized zoom ,wide angle , low light , a ton of shooting modes withspecial effects .I would say this is a end all solution to a compact photo systemthat is not expensive and integrates great wifi features and photocapabilities . BUY ONE!!", "Date": "May 24, 2012"}, {"Title": "Awsome Camera", "Author": "Lucky Boy", "ReviewID": "R1VFN3AR2EZIOO", "Overall": "5.0", "Content": "This camera does everything as advertised,I like the feel and asthetics of this camera and the performance is outstanding.Really like the wireless capabilities. Wish it had an address book for emailing photos and videos but for the price this camera ROCKS!!!!Samsung WB150F Smart Wi-Fi Digital Camera (White)", "Date": "July 9, 2012"}, {"Title": "Awesome bridge camera", "Author": "Y. Coats \"ShopperGirl\"", "ReviewID": "R19RJQ687JILCB", "Overall": "5.0", "Content": "I wanted something between a plain point and shoot with hardly any zooming ability and a full SLR..this is it! the zoom is all i need, and i love the burst photo ability...and wifi? it's awesome!! i email and post my pics constanty....the convenience of taking with a cell phone and sending to friends except way better quality! I wish I'd had this months ago...i love it! and small i can stick right in my purse, no problem...love love love this!!", "Date": "March 11, 2012"}, {"Title": "A great, fun camera", "Author": "JayeP", "ReviewID": "R2ACYBYJ5TYKCB", "Overall": "5.0", "Content": "I wanted a camera that I could keep in my bag and take everywhere in lieu of my more expensive camera.  I wasn't looking for something with DSLR IQ nor even a higher end point and shoot IQ.  I also wanted a camera with wifi capabilities so that I could upload photos to facebook without having to transfer the photos via the traditional route.  My choice came down to the Samsung wb150f and Canon PowerShot ELPH 320 HS.  I read the reviews on Amazon and different websites before deciding on the Samsung.The main reason I decided to choose the Samsung over the Canon is that Samsung offers full manual control.  Yes, using manual mode is a bit clunky, especially the manual focus but for me, having some manual mode is better than having none at all. I also read that Samsung was a direct upload whereas with the Canon, I would have to upload the photos to Canon's cloud service to post any of my photos to Facebook.When I purchased the camera, I wasn't really expecting much in terms of IQ since reviews from photo/tech sites were mediocre.  Imagine my pleasant surprise when I received the camera and started doing some test shots!  Yes, it's true that you're not going to win any photo contests from photo magazines but for every day use to capture memories, it is exactly what I was looking for.The IQ is better than expected for the size.  Looking at the photos on my 24in monitor, my ipad with retina display, my macbook pro with retina display, the camera takes great photos.  The colors are vibrant; the images- crisp enough. Low light images were good enough for the size of the camera.  Higher ISO pictures were noisy but I can't imagine any camera in this price range and this size doing any better.I had no problems connecting my camera wirelessly to my Samsung phone, my ipad 3, and my Nexus 7 tablet.  I did not try to connect it to my macbook pro bc that laptop is normally not used for photo storage.  For people having difficulties with connecting the camera to your iphone/ipad, make sure you go into your settings and choose the camera's network under wifi- not your default wifi network.  The viewfinder app also works seamlessly.  Photos uploaded to facebook without a hitch.So what are the cons?  As someone else mentioned in their review, the lcd screen is difficult to see in bright sunlight but the camera is small enough to hold with one hand so I just use my other hand to shield the screen for better view.  Auto-focus seems a tad slower than other point and shoot cameras in manual mode.  I also had to install Samsung's proprietary software on my computer to update the firmware on the camera.All in all, I'm very happy with my purchase, and I would recommend this camera to anyone who is looking for a fun, inexpensive point and shoot.", "Date": "August 16, 2012"}, {"Title": "I wanted to love this camera.....", "Author": "Angela Streiff", "ReviewID": "R2Z9NHCMA2P7JU", "Overall": "3.0", "Content": "I shopped around for so long, trying to find just the perfect camera to replace my old digital one. I literally wore out my last digital camera. It got to the point where the lens covers came off, and the photos that were taken took several minutes to save to the memory card. So it was time for something new. After months of shopping and reading reviews, I took a chance on this Samsung. I have to admit, I was a sucker for the white case color. It's a modern and clean look and case color, and with the features is has, I had to believe it would take at least adequate photos, and it may very well do that, if you know how to change all the light and and shutter settings.Alas, I am not a professional photographer. I know how to turn the flash on and off, I know how to set my cameras for macro photos, and even how to take photos at night. But for the most part, unless my point and shoot digital camera has a setting that tells me this is \"night mode\", \"museum mode\", \"light behind an object mode\", etc, I am not familiar enough with the manual settings to get the best photos for all these situations. Thankfully, there is a settings mode that offers some of these as options, but what it really needs is an \"indoors light photo\" mode, since the smart-auto mode can't seem to capture photos taken indoors well. Like many people, I buy a point and shoot digital camera with auto focus to do just that, take the photo and focus for me. If I knew what was the appropriate shutter speed to take a photo of my kids opening gifts on Christmas morning, I would purchase and use an SLR.With that said, the point and shoot results from this camera vary constantly. Indoor photos are always too dark, and like I've seen mentioned elsewhere by others, there is an odd black shadow in almost every indoor photo taken. I have to take 10 photos of the same thing from slightly different angles before I can get a shot without it. Outdoor images are beautiful. Unfortunately, I find a lot of life's moments that I want to capture in photos, happens indoors.There are some really fun features to this camera that I have learned to love. You can take photos in split-shot. Which means you take one photo, then take a second one, and it creates the two images into one single photo, with one on the left and one on the right. This is great for front and back photos of objects. There is a picture-in-pictures feature, all kinds of neat photo effects and you can take panoramic photos.  There's a whole host of other high tech features, such as being able to transfer photos from your camera to your PC or other devices through wi-fi. However as fun as these are, I find myself grabbing my iPhone to take photos indoors when I need to, just so I can get the photo the first time. It's disappointing that my cell phone takes better shots inside. As appealing as the features and sleek white case are, it's not worth it if more than half of the photos always come out bad. If you're familiar with changing your settings for light and shutter speed and are okay with doing that every time you use this camera, it may work out great for you. But if you need a point and shoot that you can just turn on and take a photo without a lot of thought as to the lighting and settings, this one will likely give you headaches.Update 3/11/2013: Something I didn't mention in my original review is that yes, the wi-fi does work. I found it pretty simple to use, however I'm the network administrator in my office at work, so connecting things across a network is something I do frequently. Samsung has done what they can to make it as simple as possible, but in the end I find it faster to just pull out the memory card and download everything to my computer that way. The wi-fi is handy if you're on vacation or not at home, have access to a wireless connection, and are looking to send images from your camera to FaceBook or an email address. But it's not by any means faster or easier than downloading them to your computer via the memory card. Also, the dark shadows do still show up in my indoor photos. I don't use a camera case or anything like that could cause it. It's just not a great low light camera. However it takes great outdoor images.", "Date": "November 7, 2012"}, {"Title": "Awful Photo Quality - Read Before Buying!", "Author": "C. Antonelli", "ReviewID": "RIXQ2P1QLYH65", "Overall": "1.0", "Content": "My wife wanted a new camera for Christmas as we were falling into the rut of using our iPhones for pictures and sacraficing quality for convenience.  Hesitant to buy another camera when the market is changing so rapidly, I did a search to see what the latest features were on cameras that could make our purchase more future-proof.  Searching for \"wifi camera\" brought up the Samsung line and looking at the modern features they pack in for the price, they seemed like a no-brainer.  My wife loves posting on Facebook, etc and these cameras can do that directly.  Out of the models available, the WB150F seemed the logical choice as we didn't need it to be tiny and wanted something with a better lens than our iPhones were capable of.  The reviews concerned me though with many excellent reviews with the occasional review mentioning terrible picture quality.  Hmmm, maybe those people with problems don't know what they are doing, or so I thought.  So I decided to take a chance and buy it for her.Fast forward to the day she got it.  At first it was nothing but sheer joy as she set up all the features and even posted a quick picture to Facebook from the couch as we opened our presents.  Wifi worked great.  Remote shutter release via the Samsung iPhone app worked great.  She could copy pictures from the camera directly to her iPhone and iPad on iOS 6 no problem.  \"This is the perfect camera!\" she exclaimed.  Dad finally nailed a gift for the wife it appeared.Deep down I knew I still had to see how the pictures looked on the computer before I'd be out of the woods.  Before doing so, I decided to spend 2 hours, yes 2 hours on Christmas, reading the owners manual and fully understanding the settings.  I also loaded the software and updated the firmware on the camera to latest as of 12/25/2012 which is very easy to do.  Once I did all that I went on a photo taking mission taking shots of everything from closeups, to portraits of my kids, to going outside and shooting anything and everything.  About 100 shots.  Time for the moment of truth - I transferred all the pictures to the computer and went through them all a couple times.  The results??  I would classify 80% of the pictures as straight up unacceptable for any camera.  Absolutely dismal quality.  Seriously, I give my iPhone 4S little credit for taking great pictures but it sadly does a better job with most.  Absolutely pathetic.  Out of all the shots, the ONLY ones that were really fine were closeup shots at 2 feet or less.  The camera lens appears to do a nice job handling those.  Anything beyond that however and get ready for blurry slightly out of focus shots.  The funny thing is I don't think it's the camera doing a poor job of choosing the focus, but rather the lens is just very poor overall.  But that's just a guess.  Shot after shot, there is just a slight blur in any kind of detail.  Enough so that you would get a headache if you had to look at a lot of them.So we ended up returning it as fast as we could and bought a non-wifi model which takes beautiful pictures.  Every great feature in the world is worthless on a camera that takes poor photos.  I can already do all of the features this has with my iPhone, we just wanted something that took actual photo quality photos with a decent flash.  This isn't it.  That said, the Samsung DV300 reviews appear to be more consistent.  It's smaller but maybe it just has a better designed lens.  Samsung is on the right track with the features people would like in a camera, unfortunately this model in particular does not do the most important thing - take good pictures!", "Date": "December 28, 2012"}, {"Title": "Full size SD card vs Micro SD card", "Author": "R. Manning \"rainmanone\"", "ReviewID": "RSXFR1R1D73QM", "Overall": "4.0", "Content": "I love the camera, but I thought I should point out that this camera takes a full size SD card and not the micro card it's being advertised with on Amazon.", "Date": "June 7, 2012"}, {"Title": "Wifi in a camera....since when?", "Author": "FunkeeChild AKA Jose Mateos \"J Dealio\"", "ReviewID": "R3I7AU4TBYBVAQ", "Overall": "4.0", "Content": "OK, so I'll say upfront the camera is well built...mostly metal some plastic, but a solid build...the 18X zoom is great for a point and shoot.  The Wifi feature is what sold me on the camera...now after saying that I will say that it has been failing just as much as it has been working...I constantly try uploading pics to Facebook direct from the camera and and I continually get a upload failed error after only one or two pics, so I have to get online to see which ones were uploaded or I end up uploading several duplicates (kind of defeats the purpose if I have to check as I'm not saving time)...the 1st couple of times I tried it worked fine...recently it hasn't been working as well.  Another awesome feature is the Remote View Finder...It does work with my HTC Sensation and I would think it would work with any newer Android phone.  Some people say they can't get it set up or it's hard but it's really not that hard.  You activate the cameras Wifi function, then connect your phone to the WB150F \"hotspot,\" then select the app and from there you can control the veiwfinder (zoom, timer, and shutter) or transfer pics. Also it does have a completely manual function, which I haven't used yet, but you don't see that much on a camera at this price.  Also I do like the editing feature built into the camera and also the features on the Samsung software....you can do things like create GIFs, which is pretty cool.  Now saying all those good things I will say that the auto focus takes quite a bit of time to work and there is some lag.  The burst shots are cool but are taken @ 3MP...a lot of the cooler functions downgrade the pic quality to anywhere from 3-10 MPs.  I've seen better pics from a sub $200.00 camera but this one is alright...I do think picture quality in low light is below avg and grainy but outside it's fantastic.  All said I gave it 4 stars as I'm glad they are finally putting wifi into digital cameras so I don't have to take so many shots on my cell.", "Date": "June 25, 2012"}, {"Title": "Compact camera", "Author": "J. R. Mahan", "ReviewID": "R3CG4E9EUWT06P", "Overall": "5.0", "Content": "This Samsung WB150F is truly a smart camera. The zoom is incredible, the video is awesome. I have several digital cameras but this is by far the best. The clarity of the pics is unparalleled. It is so compact it will fit in my shirt pocket. I couyldn't be happier.Thanks Samsung.", "Date": "July 10, 2012"}, {"Title": "great features, horrible product", "Author": "aberko", "ReviewID": "RX7061VFGSLET", "Overall": "1.0", "Content": "I bought this camera because it had similar specs to my old camera but a ton of more features. I really liked everything this camera had to offer as far as picture effects but the first day I used it it started to freeze on me. I had known this was an issue with this camera because I saw it  as in issue on other reviews. It only happened a couple times over the next few weeks so I ignored it because I didn't want to deal with the hassle of returning it and waiting for it to be fixed or replaced etc. Well, I took it to Thailand over Christmas and it would not stop freezing. The worst part is when it freezes, you have to take the battery out to get it to react and whatever picture you just took before it froze is never saved. As you can imagine, when you are on a once in a lifetime trip to a country you will never go to again, losing every other minute to wait for your camera to be functioning again can mean you miss the photo opportunity. Photo quality is not as good as my previous camera though it has the same zoom, mega pixels etc. There also seems to be something wrong with the zoom and when i turn it on sometimes it says I need to turn it off and take out the battery and turn it on again/or contact the retailer. I DO NOT RECOMMENCED this camera. The features do not make up for the fact that it does not work half the time.", "Date": "January 17, 2013"}, {"Title": "Great feature set, good value, WiFi, only average image quality", "Author": "Bron \"Bron\"", "ReviewID": "RG4B0Z93QUZBU", "Overall": "4.0", "Content": "2013-02-16 Numerous updates and edits made below.I will come back and update this review with more details as I have more time with the camera, but first impressions are good for the price paid (~130).  It is of plasticky construction, but solid and the build quality seems good.  The white body looks nice enough.  No printed manual, but the manual (PDF) is on the CD and is quite detailed.  You can read on your PC. Tablet, or other device or print it out if you like.The big question for many seems to be the WiFi.  I have a pretty standard wifi setup and I had no problems at all.  I selected my network, chose the shared setting, entered the password (easy) and it connected right away.  No need to even read the manual, just turn the dial to WiFi and you can probably figure it out if you have set up many devices before.  Once this was done, I was able to easily upload images to my SkyDrive after entering my login info, again easy to do.  I was also able to email photos to my email account.  Transfers were quick (normal wifi transfer speeds) for the 4-6 images I tested with.  If you try to transfer 500 images it's going to take awhile, probably better to just remove the SD card and use your SD card reader (or plug the camera up via USB).  But for casual transfers of images it works fine.  So the Wifi was easy to setup and use in my opinion and works well.  USB->PC transfers were also easy and fast.  And, of course, you can pop out the SD card and use your PC card reader or external USB reader as well.Update: Also tested PC Autobackup via wifi which transfers all pictures from your camera to your PC.  This is the most efficient wifi mode and also preserves the image size and quality.  Many of the other modes (like SkyDrive, social media choices, compress the file size).  You have to install the software on your PC from the CD (which also contains the manual and Intelli-Studio software) and pair once via USB.  After that you can use the PC Autobackup option from the WiFi menu on the camera and everything works automatically and efficiently. You can also transfer pictures selectively while browsing via the playback menu.  In general, all of the wifi options I have tried have worked well.  There was one instance where a transfer \"stalled\" but when restarted it completed fine and there were no further issues.Update: In further use AutoBackup has worked fast and without any problems.  It is definitely the best mode for saving your images off the camera via Wifi.  You always have the option of using the USB connection or removing the card, but AutoBackup works well enough that I don't see any need for that unless some circumstances preclude it. This mode tracks what you have transferred and will only transfer new images/videos - nice!  Transfers are placed in a dated folder, also nice.The camera handles well.  The Menus and controls are OK and easy to use.  Full manual settings are available which is nice at this price point. SMART mode seems to work OK. Everything works pretty much like you'd expect.  Zoom toggle is a bit small, but it worked OK.PQ Update: Images look soft and a bit low contrast.  Picture quality seems about average for a P&S; travel zoom camera.  Colors are good, saturation on the lower end compared to many.  The biggest issue seems to be the aggressive noise reduction (due to the small sensor size) which smears details and causes a loss of sharpness. Contrast also seems low.  The end result is the pictures do not have the \"zing\" that most out of camera jpegs have these days, so many will be disappointed in the image quality, I think.  It is possible to add some color saturation, sharpness and contrast, but the loss of detail due to the small, budget sensor cannot be \"fixed.\" That said, apparent image quality when viewing at normal screen and print sizes is OK and this may not be a big issue for some people.  This is not a DSLR.  At this price, the quality is acceptable, and images can be tweaked in any decent editor (though the lost detail cannot be recovered). For casual use, I think it is OK.  I've seen other cameras in this price range with very similar issues.  The noise reduction smearing of small detail is the biggest negative, so if you like crisp details, this will not be a good choice for you.So, picture quality is acceptable, but not stellar.  With a bit of care, good images are possible and the wifi and other features are unique at this price level. Decide if you can live with that in exchange for the other fun features offered.  In casual use, most people are not going to notice a lot of this.  Enthusiasts will.The many various modes, scenes, and effects are all a fun plus.  The \"live panorama\" mode worked very well in my few tests so far.  I was quite impressed, actually.  I found the camera fun to use.  There is built in help that explains most of the choices on screen and the controls are well thought out (for the most part) and easy to figure out and use.So far, it looks like a decent deal at the current price.  Comes with battery, charger, USB cable, CD, and wrist strap, but no SD card.2013-02-16 Update: Video -  Surprise!  The relative quality of the videos are pretty good.  The 30fps 720p HD (1260x720) video tests I took looked pretty good.  Good color, saturation, contrast, and detail (for video) and all in all very acceptable.  The videos also transferred fine via AutoBackup over wifi, thought they take longer due to much larger file sizes.  Having an 18x optical zoom that works in video mode is a nice plus, too, and it works pretty well.  The video is as good or better than a lot of the small portable video cams I have used and they're in the mp4 format so almost all devices should be able to handle them well.  Sound is mono (as usual for low price cam video) but decent. So we have a bit of a \"sleeper\" here if you like to shoot video as well as stills.", "Date": "February 11, 2013"}, {"Title": "Durability dings", "Author": "Gipper", "ReviewID": "R1SFMG9N5IHEP0", "Overall": "2.0", "Content": "I had to send this camera back once already; customer support by Samsung seemed reasonably fast and reassuring, though I was perplexed by the problem (the lens cover shutters stuck halfway open). I had kept the camera in a backpack (not I confess in the provided cushy case) on a fairly tranquil camping trip. But now I am on my second failure: auto-focus doesn't work at certain zoom ratios (right about in the middle of the range).This time I know I didn't cause any damage; the problem didn't immediately appear, but somehow something slipped, and there you go -- head and shoulder shots are out unless you like 'em fuzzy.And this time Samsung ... it's like a different company. Nothing works on their support site! On the first repair I got email alerts as to status, and now they say that email \"does not exist\" when I try to sign in with it. From poor organization to dead ends to a drop-down menu for problem category that disappears before you can select any item, the site is a usability nightmare, and I'm just about to give up. Costco sold the thing to me but their warranty is expired; Samsung covers me for a year, but I can't figure out how to put in a repair ticket.Finally in desperation I replied to the final email from their tech support people telling me the camera was shipped after the lens cover was fixed, putting out a cry for help. We'll see how that fares. I heeded the numerous good reviews of this camera, and have been happy for features and value, but durability ... maybe mine's a lemon, but I'm getting really mad.", "Date": "January 3, 2013"}, {"Title": "I LOVE IT! THE FUTURE OF CAMERAS", "Author": "Nic", "ReviewID": "R2N9VGFIH2RWIZ", "Overall": "5.0", "Content": "I was a bit nervous buying this product from the reviews about it not being compatible with Apple products.  I was guessing by now that the glitches have been fixed and that it would be great in regards to the \"smart features\".  I have only had it for a day or two now but am more than pleased with the product. I immediately got on wifi with zero problems in my house and downloaded the \"Samsung mobile link\" app on my iphone 4.  I was ripping the pictures from my camera directly to my iphone, not seeming to lose any quality although it was through the air.  Next, I set up my facebook on the camera and was uploading much higher quality photos in less time than my phone took.  I'm not sure if the previous people were not savvy enough to set up the wireless features or that samsung has fixed the glitch, but I had no problem with any of it and absolutely love this camera!  I recommend this to everyone!", "Date": "July 2, 2012"}, {"Title": "Disappointed", "Author": "Kathleen Gibson", "ReviewID": "R2Q3PVFM41YLDD", "Overall": "1.0", "Content": "I was given this camera for Christmas, and for the 30 days that it actually worked I liked it.  But a month into owning it, the zoom failed to retract.  I contacted Samsung customer support, and after much ado, they gave me a ticket number with info on sending it in for repairs.  Well the shipping label link didn't work, and Samsung couldn't figure it out, so I ended up shipping it myself, insured, and tracking number---So now I am an additional $25.00 into sending in a brand new camera for repair.  Today I received an e-mail saying the service ticket had been cancelled because the product wasn't received by the repair company.  I called Samsung support again and informed them that the camera couldn't teleport to NJ as it was only shipped two days ago.  They assured me the ticket would be reactivated, but I have very little faith in their processes at this point.  SO best advice at this point...DON'T BUY a SAMSUNG camera!", "Date": "February 14, 2013"}, {"Title": "3.5 stars - great for outdoors, not the best for low-light", "Author": "That Girl is Crafty", "ReviewID": "R20DQC1UUEBRTB", "Overall": "3.0", "Content": "4 stars for the $120-150 range but any higher and its a 3 star in its price rangeI purchased this camera after my 5 year old point and shoot canon finally bit the dust. On a whim I saw a great deal on this Samsung and thought I'd give it a try and I've been pleasantly surprised. I've had this camera for about 3 months and have taken it on one vacation so far. Over all I would say the auto setting is great for outside but if you're shooting inside or in any low-light you really need to mess with the custom settings to get better photos.Pros:great zoom, one of the best I've seen in this price range and sizeLike the body shape - easy to hold with the grip (although I'm often hitting the menu button with my thumb by mistake) Feels solidwi-fi connectivity is cool but could be betterManual settings are pretty nice although the interface is a bit clunky.  Atleast your settings are saved when you shut the camera off so its ready to go when you turn it back onThe \"artistic\" settings are kinda fun to play with including the settings for certain conditions. The panorama setting is nice.Cons:I feel like I get a lot of shots out of focus, way more than I noticed with my canon which has been annoying.The wifi connectivity, while cool isn't really worthwhile. Unless you only have a handful of photos its just too time consuming to use. Typing anything one letter at a time by scrolling through the alphabet is painfulthe camera's ability to auto shoot is just ok, especially indoors. I've had better luck if I mess around with manual a bit more. I was much happier with my cannon in autoNot that Mac-friendly. Doesn't always like to connect to my mac, sometimes I have to disconnect and reconnect before it works. Go figure samsung. I used the remote connect with my husband's android once but it wasn't very responsive, gave up trying to get it to work on my iphone.Shutter is a bit slow.I got a great deal on this camera (the white one for $120) and for that price I've been happy enough with it. Mostly I wanted this camera so I could get shots that are better than my phone but I didn't want to spend so much that if I lost or broke the camera I would be upset (I took the camera to haiti for a service trip 2 weeks after I bought it) That being said on my next point and shoot I'll likely go back to cannon.", "Date": "November 3, 2012"}, {"Title": "Good value for money", "Author": "JAN MARIUS EVANG", "ReviewID": "R3O2ZAYNKQ8QR1", "Overall": "5.0", "Content": "Pro:- Wifi features are cool.- Remote viewfinder works nicely from my Sony Ericsson android phone.- Mobile LInk works great- USB charger, can use the camera while charging.- Good zoom- Self portrait mode (beeping when your face is in the correct position)- Wide angle- Auto backup (sends photos to PC over wifi. Can even turn on PC with wake-on-lan)- Facebook upload- Price- Panorama- Intellizoom gives you more than the advertised 18x zoom by lowering resolution (this is not digital zoom, intellizoom uses the optical zoom beyond the \"best\" range, and cuts the edges to minimize distortion)- multi-shot 5 photos in a second or continuously as fast as the card can take- Optical image stabilisation- 3 photo auto-bracket- 720p video, quite good audio as well- Smile detection/blink detection- Can use face recognition to register your own kids, and the camera will focus on them in a group.- Picture-in-picture, Split-shot- Can do red-eye removal on the camera, after the shot is takenCons.- Remote viewfinder should have more features- Remote viewfinder must be turned on at the same time on camera and phone. Cannot leave the camera running (With power) and connect to it at will.- Would have been nice to have remote viewfinder on PC.- No touchscreen. Would be a big improvement.- Large. Possible to have in pocket, but feel it there.- Plastic (but nice plastic... probably good for wireless reception)- Not possible to download or add other \"sharing\" apps.- Photo quality could have been better- Smart-shot mode is slightly slow and has too few settings.- I've had other cameras with more scenery-modes (missing fast-action mode)", "Date": "November 4, 2012"}, {"Title": "Best camera for the price.", "Author": "Emmett Hoops \"at78rpm\"", "ReviewID": "R3OE9ULDHT3WH4", "Overall": "5.0", "Content": "I'm a former creature of habit.  Oh, you know, the kind who stuck with a brand even if it wasn't all that good: like ThinkPads. They were the best: I knew, because I had three of them inside of 5 years!  Oops.  Well, I used to buy one brand of camera, but knew it only from its reputation back in the '70s.  So, I was looking for another camera, and decided to put my faith in some Amazon reviews.I'm glad I did.  This little camera has everything: photo editing, automatic scene selection, full manual operation, aperture or shutter speed preference; and wifi.  I can upload incredibly high quality photos to Facebook or via email right from the camera: no more having to connect to the computer to offload photos first.The battery lasts for days even under constant use.This is one fantastic camera.", "Date": "November 12, 2012"}, {"Title": "A GREAT LITTLE CAMERA", "Author": "Robert D. Williams", "ReviewID": "R7OZKS23C7NAU", "Overall": "5.0", "Content": "This is a great little camera.  At first I was going to buy the WB850 but the camera was a little pricey.  What I wanted most was the digital filters, specifically the artistic ones like oil paint and sketch.  Then I discovered the WB 150 has the same filters so I bought that one.  I did not regret that.  I have taken some nice fall foliage shots and when converted with the filters, they are amazing; suitable for framing or display.  The other functions on the camera work very well also, although I admit I don't use Wi-Fi or any of the other fancy stuff.  The only thing I really miss on this type of camera is the optical viewfinders because the LCD screen gets washed out in bright sun and you can't see what you're photographing.  Aside from that, It's a great little camera and well worth having.", "Date": "October 6, 2012"}, {"Title": "Wonderfrul Camera", "Author": "nancy", "ReviewID": "R12Q6DWO1BIJPZ", "Overall": "5.0", "Content": "I purchased this today at Best Buy for more than it is listed on Amazon.  However, I need it for a trip and didn't want to worry that it would not arrive in time.  From the moment I used the camera in the store I could tell it was amazing quality.  The zoom is incredible.  I was able to take a photo of a sign all the way across the store and it looked as if I was standing a few feet away.  The fact you can up load pictures online or back them up is a great feature that a lot of the cameras I looked at didn't include in the same price range.  Overall, I'm pretty pleased with my purchase.", "Date": "May 13, 2012"}, {"Title": "Picture quality is terrible", "Author": "ranndino \"ranndino\"", "ReviewID": "R2P0VBV01Y6EY4", "Overall": "2.0", "Content": "Looks very nice and has a sturdy body. Having a mega zoom is great, but extremely disappointed with picture quality. My smartphone takes far better pictures. WiFi connectivity is also great, but for some reason the amount of pictures you can send is very limited which completely defeats the purpose of having it. The picture quality is the main reason I'm sending it back though.", "Date": "September 4, 2012"}, {"Title": "Happy and satisfied", "Author": "Esther", "ReviewID": "R3G5EPU26U105E", "Overall": "5.0", "Content": "With all the brands of the same class, I chose this camera because of its Wifi capabilities.  I have tried sending photos with it and it worked.  I still need to study its other capabilities as I am only an amateur photographer and so far,its Smart Auto function works well with me.", "Date": "September 7, 2012"}, {"Title": "i REALLY wanted this camera to work.", "Author": "mo", "ReviewID": "R3E5ZH1S4E9RCN", "Overall": "3.0", "Content": "The features of this camera are many and varied. But, i had to return it for 2 reasons. #1-the sweep panoramic shots were not very good. Different shades among the frames made for an almost patchwork in the finished panoramic. Didn't come anywhere near my Sony for the sweep. #2-the camera would just suddenly freeze up while taking photos. Couldn't turn it off, couldn't take any photos, couldn't change the scene mode. NOTHING. The only way of backing out if it was to take out the battery and wait a few seconds. Has anyone else had similar problems? Not sure if i want to try it again now. i really liked everything else about this camera.", "Date": "July 15, 2012"}, {"Title": "Samsung camera WB150F", "Author": "Myra", "ReviewID": "R1LTEQ2QKESKBQ", "Overall": "5.0", "Content": "Samsung  WB150F.I bought this camera because you could email your pictures from the camera to any email.  Totally love this camera it has a great zoom and has so many options where you can change your setting from dusk, dawn, sunset,and many more..  Love it.Myra", "Date": "August 31, 2012"}, {"Title": "Picture Quality Sucks", "Author": "Max @PDX", "ReviewID": "R1HGNNJ2JKYL4J", "Overall": "2.0", "Content": "Tried this camera for 3+ days along with my old Kodak M550 & Sammy DV300F. FWIW, I used my Nikon D90 as the benchmark to compare the 3 cameras.All the 150F photos showed noise @ some level; more so indoors.  300F produces better pictures than the 150F imho. And is cheaper too. And more compact. Under the 'Smart' setting there is no way to force the flash. (I was not able to find it.). I had to resort to the program mode; or use the scene mode to backfill. Neither gave me the desired results.I tested the WiFi. That worked very well (& I have a Samsung Epic phone.). The Auto upload is a *very* convenient feature. The setup was easy. The menu guide (UI) was intuitive for me.The battery lasted almost all the 3 days of testing w/out any charge. I did not test the video, since I lost interest in the camera based on the picture quality alone.", "Date": "May 18, 2012"}, {"Title": "Doesn't work with Win 8", "Author": "Gordon S. Ferris", "ReviewID": "R5EPIN63O6YIT", "Overall": "2.0", "Content": "I read all the specs. before ordering this camera. The software doesn't work with win 8.  I just finished a chat with a Samsung rep. The software called Intilli-stuido isn't compatible with win 8. Without the software it's not possible to upgrade the firmware on the camera. However the camera can be used as a plug and play. You don't need a special driver download. I haven't used to camera for any photos yet. I do have it set up. The buttons and the camera body have a poor build quality feel. I'm going to return the camera and find one that is a little more up to date.", "Date": "December 21, 2013"}, {"Title": "For serious photographers on a serious budget this camera packs a neat punch", "Author": "Delphyne", "ReviewID": "R1X48JK4H67R14", "Overall": "5.0", "Content": "Those who complain about low light photography are not using the camera properly.  I am convinced those people did not take them to get to know the camera. This camera has manual and program capabilites which render the complaints about low light invalid.For serious photographers on a serious budget this camera packs a neat punch. I have attained crystal clear images of the moon, while also manipulating the controls to achieve bright, clear pictures in a dim room. The entire reason I bought the camera was because I could not afford a DSLR and it offered the best manual and program options.For instance, I have been able to create \"light art\"; I have captured the detail on the veins of leaves and the hairs on spiders legs; I have altered the settings so that the moon's light appeared to illuminate the entire background. Now, this can take some time working with the camera, so if you are a \"lazy photographer\" this camera is not for you. Thanks to this camera, I have also recently had photographs hung in a Gallery. Yes, it can do that, provided that the user knows his cameras.If you are new to cameras, have never worked with film cameras, or are not familiar with program and manual controls, then it is best to skip over this camera, unless you are wanting to learn those functions, which I highly recommend.Additional features include pan shots, which can get a little sticky. Occasionally, there was a glitch if I allowed the SD card to near maximum storage, but I was really pushing it to the limit. I thought the frame features were cute, but ultimately rarely used them. The internal photo editor is not terribly advanced, but again may be manipulated to achieve some stunning results.Some other cons include: constant use of the zoom will lead to rapid wear -- I know, I am a nut with the zoom. The sound and video quality were not exceptional, however I have seen far worse. I had the opportunity to video a lightning storm with it and the still images from the video were not incredibly sharp, but were definitely decent.The macro is function is my biggest rave. For its size and price, I am thoroughly happy with macro. Other cameras need a distance of at least 3 - 4 inches for clarity. I have had this camera right on top of a very patient cicada with perfect rendering of its carapice.This camera was made for this type of a photographer -- one who knows the value of small pacakges.The battery life was long lived unless you are using the zoom frequently -- which saps the battery quickly.My WB150 F met with an unfortunate accident. This is one of the only cameras I have decided to purchase a second time.", "Date": "November 20, 2013"}, {"Title": "Zoom broke after 4 Months", "Author": "Julie McMaster", "ReviewID": "R2GEDMHW4R51YP", "Overall": "2.0", "Content": "zoom and shutter have broken after only 4 months.  This was a christmas gift and was broked by 4/1/13.  I am dissaptointed with the samsung camera and will not be buying another.", "Date": "April 8, 2013"}, {"Title": "Fun camera", "Author": "Alan LaSalle", "ReviewID": "RQC4OE55QIEHU", "Overall": "3.0", "Content": "I've always loved long zooms, and so far this is great.  As stated in several reviews, image quality is only OK, but in bright light outdoors I think it will be really nice on my next trip.Wi-Fi is of very limited use.  (I didn't read the fine print, so missed that it won't \"pair\" with my iPhone.)  It only uploads to \"Skydrive\" so again not much use to me.  The email is fine...but tedious to send, and so far won't remember my info so need to re-enter too often.Even without useful wi-fi, I decided to keep camera because of the great price, long zoom and style.Hope to try out all the special settings that look interesting, but have not had chance to try yet.", "Date": "March 2, 2013"}, {"Title": "The Image Sensor is a disappointing weakness.", "Author": "Elek A. Fenyes \"Accidental Tourist\"", "ReviewID": "RYZEJURN2YJQX", "Overall": "3.0", "Content": "First, let me say that setting the light sensitivity at ISO 800 will give you the sharpest picture this camera is capable of producing, which is still not very sharp. Under anything but perfect lighting conditions image noise will be noticeable. It is a shame that Samsung had to cheap out on the image sensor of this otherwise great camera.Under low lighting conditions, the pictures are very grainy. To add insult to injury, the flash will not come on in the \"Smart\" setting unless the lighting is really low almost guaranteeing lousy pictures in low light situations. You have to use the \"P\" setting to get flash fill. When you do that, it seems to take an eternity for the flash to charge itself up for the first shot. In other words, this camera really doesn't like the dark.That being said, the camera will produce perfectly acceptable pictures for sharing on social media and it has a versatile lens capable of extreme closeups and powerful telephoto shots.", "Date": "February 22, 2013"}, {"Title": "Definitely a keeper", "Author": "christy miller", "ReviewID": "R2Q55UFTMYT94Q", "Overall": "5.0", "Content": "This is an amazing camera. I had recently purchased a Nikon S9050 even though it was a good camera, I couldn't get the macro to focus and that bothered me, so before taking it back to Best Buy I did research & read reviews on the Samsung I took a chance and exchanged the Nikon for the Samsung and it has been a good purchase so far.It takes brilliant photos and video. The zoom is also great. I love the WIFI feature. After synchronizing the camera to the computer for the first time it will upload the photos and video pretty quick to the computer, email and social media. I also have a Nikon DSLR and I'm sorry to say this but it takes almost as good as pictures as my Nikon and even though it isn't a low light camera, I was able to take some photos in a pitch black room and as long as the camera is pointed at the subject in a dark room, the flash picks it up even though the little green box doesn't illuminate. You still can get a very good picture with the flash. The camera is very easy to use and the cameras user manual is on a CD. Note. You do have to have a router in your home to send pictures through the WIFI. This is a great camera and I would highly recommend this to anyone.", "Date": "January 12, 2013"}, {"Title": "A+++++", "Author": "sean", "ReviewID": "R1PMS1BI7NCHWN", "Overall": "5.0", "Content": "Great camera, my wife loves it and its wifi feature.She can post pics directly from the camera to Facebook.", "Date": "January 10, 2013"}, {"Title": "So much for a great price", "Author": "A. Packer", "ReviewID": "R3MMKUE14OY22J", "Overall": "5.0", "Content": "For the price, this camera has an amazing number of features...18x optical zoom, panorama mode, fun frames, and interesting modes that turn you photo into a cartoon, painting or pencil sketch.  The Wi-fi connection that allows automatic backup on the computer is a nice feature too.", "Date": "May 11, 2012"}, {"Title": "A Great Buy", "Author": "Jazmin", "ReviewID": "R1NZCSWO8Z13YK", "Overall": "5.0", "Content": "I purchased this camera to take with me to an NHL game, I was too afraid of breaking my large Canon at the game, so I thought a more compact camera would be wise. This truly is a 'smart' camera. I turned it snap pictures on the SMART setting on the wheel and it took amazing photos of the game, as fast as the players were moving, not a single photo was blurry or distorted. The zoom is also excellent. I zoomed the entire way take a photo and it came out crystal clear as if I was taking the photo right in front of me. The battery life could be better, but overall, this camera is nearly flawless.", "Date": "March 24, 2013"}, {"Title": "Sets up easy, works well", "Author": "Deanotb", "ReviewID": "RGTTOW16DA5PW", "Overall": "5.0", "Content": "Upon receiving my Samsung WB150f, I went through the startup process with no difficulty.Once set up, took a few pictures, and am very happy with the quality of the photos. Next I connected to my homeWiFi network and emailed 1 photo from the camera without an issue.  Love it and would put up 5 stars", "Date": "May 14, 2012"}, {"Title": "Problem!", "Author": "REX WHETSTONE", "ReviewID": "R2QUGVD2024AN0", "Overall": "1.0", "Content": "Currently in Afghanistan, ordered this camera for my wife for Christmas so she could send me pictures. On her initial use of the product the zoom button would not retract the lens. Not wanting a product with a problem she called Samsung several times constantly placed on hold in excess of an hour only to be rerouted to different places regarding customer service. Once she got through to someone that could/ would help her they told her to send the camera \" back for repair\". The company would not exchange for a new one even though the one they sent her was broken. She sent the camera back for repairs and has still not gotten it back. Very poor service! Will not purchase another Samsung product.", "Date": "January 17, 2013"}, {"Title": "Samsung WB150F review", "Author": "Jeff McMichael", "ReviewID": "R2OFAV7XNBCEMZ", "Overall": "4.0", "Content": "I have used an older Samsung camera (S85) for years; it finally stopped reading the SD card so it was time for a new one.  I selected the Samsung WB150F due to the reliability of Samsung products and the features of this camera.  I am enjoying the 18x optical zoom, and have be playing about with the photo effects, although I don't I will use them very much in the long run.  The Smart photo selection (auto mode) seems to make the correct choices to produce good photographs.  I also like that I can use a USB power source to recharge the battery; I am trying to select electronics that recharge via USB, so when I travel I only have to bring one USB wall charger for everything.The shipping from WorldWide Distributors was fast.  The box seal was broken, but the camera did not appear to have been used--and an additional usb-to-video cable was added to the contents.  Recommended.", "Date": "February 24, 2014"}, {"Title": "Not my review but it helped me in deciding on a different camer that is for sure.  (Read the BAd)", "Author": "robshow \"rhoug\"", "ReviewID": "R1R9VZ503P5M9H", "Overall": "3.0", "Content": "The good: The Samsung WB150F has built-in Wi-Fi that's easily set up for wireless sharing and backup. It has an abundant set of shooting and editing options.The bad: Samsung's smartphone apps are only guaranteed to work with Samsung Galaxy devices and its autobackup software is Windows-only. The camera's photo quality is barely better than a smartphone's and its shooting performance is somewhat slow.The bottom line: If you're happy with the photos from your smartphone, but wish you had an actual camera with a long zoom lens and wireless sharing and backup, check out the Samsung WB150F.", "Date": "December 16, 2013"}, {"Title": "Not a good camera", "Author": "ESK", "ReviewID": "R1QY1PN3S4AB8J", "Overall": "2.0", "Content": "It, takes too long to for camera to take photo. The autofocus is very poor, and the zoom pictures are very grainy. I would not recommend this camera.", "Date": "November 19, 2013"}, {"Title": "It won't zoom", "Author": "Jane Brouse", "ReviewID": "RCAGVWBLYV07P", "Overall": "2.0", "Content": "Hugely disappointed. Used it only a couple of times and the zoom won't open.  It was taking great pictures up until then.  I am really upset by this.  I use my cameras a lot.  Now I have to figure out where to go to get it fixed!!  Not happy at all", "Date": "October 26, 2013"}, {"Title": "Not bad for the price", "Author": "david penning", "ReviewID": "R3W2MHAJFZ1ZT1", "Overall": "3.0", "Content": "This is a good camera if you're sort of starting out and don't know much about how quickly zooms can work or how sturdy anti-shake options can be on a point and shoot camera.The camera has some amazing functions and takes really great pictures!  However, the zoom wasn't always as clear as what I thought it should have been.If you're going to be taking any videos with this camera, and you want to zoom in and out on your subject - don't.  It takes at least 1 second each time to refocus as you zoom, no matter how slowly you try to zoom in or out.  For me, that's too much blur to rewatch with the family back at home.At the end of the day, this is a descent camera for the price.  But before you buy it, I'd go to a camera store and check it out yourself.  I didn't and just based my decision off of others' reviews, and I was disappointed.  I ended up returning it and putting a little more money towards the Sony WX-300 (which has not disappointed me yet!)", "Date": "August 30, 2013"}, {"Title": "INCREDIBLE - AWSOME", "Author": "photonut", "ReviewID": "R1ZFMHZRD3WQZM", "Overall": "5.0", "Content": "I own several super zoom point and shoot cameras.  I sold all my DSLR's - to much junk to carry.  I got this used for a great price.  Had some good conditions for taking moon pictures last night.  Amazing results considering price and size of camera.  I was impressed with the full range of manual settings available.  Many of the new cameras have been \"simplified\" to avoid confusion with inexperienced users.  I don't use \"smart auto\" - program mode allows me to tweak the settings while still automatically adjusting most.  Some of the best features are listed below;1) Good low-light performance, (focus and sensitivity)2) Good video performance (even in low-light conditions).3) Good gyro lens stabilization.4) good control of noise at high ISO.5) chromatic aberration - BEST I've seen in a point and shoot.6) battery life - very good.7) flash range - better than expected.Some of my large super zoom point and shoot cameras have a slight edge over this one - but not by much!  It can be found for $70 to $90 used - great performance for the price.", "Date": "July 22, 2013"}, {"Title": "I liked it but there were some problems :(", "Author": "annancookie", "ReviewID": "R2CYOAP4DI1T9M", "Overall": "3.0", "Content": "I liked the body and how compact it was but I had ALOT of trouble recording a video and focusing the image. I was very disappointed. I did like though the color and how easy it was to take a picture.", "Date": "June 6, 2013"}, {"Title": "Poor quality", "Author": "E", "ReviewID": "R2NOHAVX45WXQM", "Overall": "2.0", "Content": "Great service as always from Amazon's end, but this is the most frustrating camera I have every owned. Camera constantly freezes in the middle of taking photos.Pros: Tons of features for price point.Cons: Poor quality. Unreliable photos.", "Date": "June 3, 2013"}, {"Title": "Fun little camera", "Author": "H. Zhang", "ReviewID": "R1PIESJGP0Y82J", "Overall": "3.0", "Content": "This is my first Wi-Fi enabled camera, naturally I'm very excited to try it out, below are my findings:1. The unit is quite small, even though the body is completely plastic, it feels surprisingly sold.2. The video recording seemed to have a cap of 20 minutes, which is odd but no big deal.3. The image quality, not surprisingly, leave much to be expected. Though I can leave with that. After all it's a budget camera.4. Here comes the fun part, for the Wi-Fi, it has some sharing options:  a)Auto Backup, this is my absolutely favorite feature! With it being properly installed and configured, I can send all the photos and videos from my camera to the PC wirelessly, without the damn old USB cable or flash card reader, how cool is that! The transmitting speed seems to be fine. Beware it only works with Windows.  b)Social sharing, I have no problem uploading photos to the Facebook account, however for the video clips, only those with resolution lower than 320x240 and less that 30 seconds can be uploaded, which practically makes this feature useless.  c)I can only upload photos/videos to Facebook/YouTube/SkyDrive. For some reason I couldn't make Picasa and Photobucket work. The same story happened to Email.5. Remote Viewfinder allows me to use my smart phone as a remote controller, as well as view finder. It's kinda fun, could be handy for self picture taking. However the feature set is very limited, and the picture resolution is rather low.6. Text inputting is miserable! After scrolling through all those alphabetic/symbols/numbers, my fingers are crying. I also notice it doesn't remember inputting history, which is quite a bummer.Overall a fun toy, it leaves a lot of room for improvement for sure.", "Date": "May 1, 2013"}, {"Title": "Perfect!", "Author": "Dancecrazd88", "ReviewID": "R3L64JU1K0KISB", "Overall": "4.0", "Content": "Pros:Wireless settings. Can upload to Facebook. Love that!Looks nice with the white finishBig screenTakes super nice images20x zoom is pretty sweetGood flashCons:Sometimes it takes a couple button clicks to take a picture, that is annoyingDoesn't always seem to focus nicely", "Date": "April 15, 2013"}, {"Title": "Camera", "Author": "lakelandman", "ReviewID": "R33PXAAO8I0IUD", "Overall": "5.0", "Content": "I pick this up as a gift and she loved it does everything she wanted as her old camera was so out dated so over all this camera is a good quick and shoot camera!!!", "Date": "April 5, 2013"}, {"Title": "Samsung WB150F Long zoom Smart Camera Black", "Author": "Adrienne", "ReviewID": "R1XH4VC3F8EQYB", "Overall": "5.0", "Content": "Love this camera.....easy to use for a Senior......pictures come out great......easy to put on computer to show friends and family.......", "Date": "March 21, 2013"}, {"Title": "Excellent Camera! Great Price!", "Author": "Kmh", "ReviewID": "RJPI8YE1DZJ6V", "Overall": "5.0", "Content": "This is camera has exceeded my expectations!  It has so many great features for anyone and for an excellent price.  This camera has helped me to greatly expand my business.  It takes quality pictures in no time at all and being able to email the pictures to upload is the greatest part.  It saves me time for work and allows me to share my family with my loved ones.", "Date": "March 19, 2013"}, {"Title": "Amazing Videos....from the camera..no less", "Author": "Linda", "ReviewID": "R126BWWV70QJZC", "Overall": "5.0", "Content": "I am more amazed at the videos this camera takes..so very clear. I just post a picture to FaceBook or Picasa  or others.Also, I can pair the Camera to my TV and / or computer and even my Samsung Tab 7 and Smart phone and play the video or see the pixs.The intention of buying this camera was for the size for easy carrying vs my larger Canon camera.I am a shopper and the price with Amazon was the best around...even with the sale price at best buy.My friend  purchased Sony Cyber-shot and he wishes he had purchased the Samsung.", "Date": "March 11, 2013"}, {"Title": "great camera", "Author": "David Faulkner", "ReviewID": "R2I0LAO92R4EVQ", "Overall": "4.0", "Content": "This camera has two features that I was looking for.  First it is compact enough to fit in my shirt pocket.  And second it has an 18xoptical zoom to bring long range views in close.  It also has wifi and is an excellent value.", "Date": "February 25, 2013"}, {"Title": "upgrade", "Author": "D. lopaus \"washashore\"", "ReviewID": "R1B1835ICOSXUO", "Overall": "3.0", "Content": "a good price but i was hoping to upgrade my panasonic.  nice to have wi-fi.disapointed in the plastic body.  returned with no problem.  thanks amazon.  latest on camera.  bought for trip to disney but was dissapointed in camera quality.  the most obvious reason for my return was a grinding noise inside the camera which ultimately took unfocused pictures.didn't wany to take any chances so did not replace. iwould not discourage purchasing because there are a lot of good features.", "Date": "February 13, 2013"}, {"Title": "Great camera, amazing pictures (and some tips for you)", "Author": "Dennis N.", "ReviewID": "R3MZ2QRF74YOGK", "Overall": "5.0", "Content": "I've had this camera for close to 6 months and have taken thousands of pictures with it already.  It has functioned almost flawlessly and people consistently comment on how good my photos look (it's not my photo skills, it's the camera).Plusses:>Great \"smart\" mode (i.e., 'auto').  Goes from far-away to macro to flash to no-flash all without any assistance from me - and does it while taking great photos.>Fast start-up.  I'm used to turning on my previous cameras and having to wait.  This camera starts up almost instantly and is ready to shoot.>Fast cycle time.  Some previous cameras have had nearly ridiculous photo-to-photo wait times.  I can snap pretty rapid-fire with this one.>Has a feature for \"text\".  I use this to take photos of documents.  Often I scribble notes to myself on documents with pencil.  I have tried scanning such documents to pdf, but the pencil marks rarely come through.  Using the camera to shoot the document preserves all my scribbles, and I can throw the paper away.>Handles abuse well.  I've treated this and all my other cameras pretty roughly and taken them in really bad environments.  This camera is holding up very well.>Good button placement.  Having used several different cameras, I've found that not all cameras are created equal on this issue.  This camera is comfortable to hold and shoot, and the buttons are placed so you don't tend to push them accidentally.Minuses:>There is one small area within the zoom range where the camera seems to have trouble focusing.  That is kind of annoying.>Turning the date stamp on and off is somewhat more involved than on some of my past cameras.>Self-timer.  In \"smart\" mode, you only have two choices - \"off\" or \"10 seconds\".  You have to go into \"program\" mode in order to get a third option (2 seconds).  Not a huge deal, but other cameras have had a little more flexibility here.Something that I thought would be a minus, but is not:The battery.  Most of my old cameras used AA batteries.  I hated to turn to a camera that has a special battery.  Three things have 'solved' this initial reluctance 1) I bought an extra battery at Batteries Plus, and I keep it in the camera pouch, charged and ready to go.  This added about $25, but is worth it because now I don't fear dead battery.  2) The battery lasts for hundreds of shots - far longer than I expected it to last.  I have rarely needed to switch batteries.  3) I can recharge in the car with my 100-watt cigarette-lighter-AC-power-inverter device [if you don't already have one, get one!].I think I have used only about 10% of the camera's functions so far.  I probably will never use the WiFi or many of the 'program' options, but it's nice to know they're there just in case.My tips:Tip #1: Windows Live Photo GalleryThis is a great free program that can 'rescue' even a lousy raw digital photo.  If you haven't tried it, download it and play with it.  Try the \"Edit>Fine Tune\" feature.Tip #2: IrfanviewI usually take photos at the 10MP setting.  This gives me a jpg file size of about 4 to 5 MB each.  I can knock that down to about 200 to 300 KB using \"quality level 20\" on Irfanview and the pictures still look really good.  Plenty good enough to paste into a Word document or an email.  You can download Irfanview for free.  I have used it for several years.  Great program.I have found that it is far better to take the photos on a high MP setting and reduce them down later if I don't need the high level of detail in the final jpg file, than to take photos on a lower setting and then wish that they had more detail.  The camera came with an 8GB SD card, and I have never even come close to filling it up.", "Date": "February 13, 2013"}, {"Title": "Nice Camera - no problems (yet)", "Author": "Alec Carlson \"Mohawk\"", "ReviewID": "RW0NGCC4JDF8N", "Overall": "5.0", "Content": "I just bought this camera two days ago. I was replacing a Canon Elph which had never worked right since the day I bought it. 90% of the Elph pictures were always out of focus. I looked around at the reviews for a number of non-Canon cameras and the Samsung WB150F was the camera I ended up with. I bought it for 4 reasons: (1) because if had a larger body and controls then most other point and shoot cameras. (2) It had built-in WiFi and I could beam pictures directly to my Samsung 55\" LED TV. (3) It got decent reviews from other owners (4) it was not a Canon.I decided to test it out by taking an inventory of all of my stuff in my house. This was something I had wanted to do for some time. I took 160 pictures in different lighting conditions. I did not use \"Smart Mode\"; Instead I put it into \"Programmed Mode\". All of the pictures except 1 looked great and most importantly, they were all in focus. One of the pictures was on the under-exposed side. I then tried the WiFi link to my TV. It took me a couple of attempts to enter my router WEP password correctly but I eventually got the case and spelling correct... :-) The TV discovered my camera and I was able to select the camera as the TV input device. Once that was done,I could browse the pictures on the camera using the TV remote control and display them on the big screen. That was pretty cool. I then decided to download the pictures from the camera to my MacBook Air. This was pretty simple - just plug the USB cable into the camera and the Mac, power the camera on, wait for the camera's flash disk drive to get mounted and then just drag the folder off of the camera's drive and onto the Mac's HD. I copied 400MB of pictures in a couple of minutes. Some reviewers complained that you couldn't use WiFi to copy the pics to your Mac but \"why would you want to ?\". The USB connection is faster and a lot less hassle then beaming the pictures over.So far, I have no complaints with this camera. It has worked perfectly and the pictures are great - at least for me. If I run into any issues I'll update this review and let you know what I find.", "Date": "February 11, 2013"}, {"Title": "Outstanding Zoom Lens.  So-so Picture Quality.  SkyDrive Upload Works but Not Convenient.", "Author": "Frank Y.", "ReviewID": "R2PESWG4TPLPR1", "Overall": "3.0", "Content": "This compact camera has an outstanding zoom lens.  And it reaches to 18x zoom quickly with little noise.  Though like most compact digital cameras, the 18x zoom is exaggerated.  It's more like 6x to me.  It has a wide angle lens so it's great for taking group photos.  I didn't have to read the manual to figure out how to use this camera.  It's quite intuitive, the way technology should be.The picture/video quality is not as good compared to my other cameras, which is fine in this low price range.  The colors seem washed out a bit compared to my iPhone 5's and Sony Cybershot's.  Its anti-shake feature seems to work well.Samsung puts the flash at a location where my finger can block it partially, so need to be careful when taking flash photos.  It does not come with a separate battery charger.  We can spend all day taking over 200 photos and a few videos, yet it still have a bit of battery life left.Overall this camera is easy to use, easy to hold and priced right.  If you want a long zoom compact camera at a low price, this is a great buy.  Those who want high quality photos should look elsewhere.Update 4/23/2013 - The SkyDrive upload works now, which allows backing up photos while traveling (without lugging along a laptop.)  Apparently SkyDrive has decided to increase the file size limit.  It does not allow bulk upload.  I need to select each photo to be uploaded, not very convenient when we take 200+ photos in one day.", "Date": "February 9, 2013"}, {"Title": "Me encanta", "Author": "L", "ReviewID": "R262MYF6B33GAQ", "Overall": "5.0", "Content": "Este producrto es super bueno, toma excelentes fotografías aun cuando estan los objetos en movimiento, muy buen producto y muy recomendado.", "Date": "January 29, 2013"}, {"Title": "Great Camera", "Author": "carl", "ReviewID": "R17UB6JN6X7ERU", "Overall": "4.0", "Content": "Great little point and shoot for the money.Haven't had any issues with using the built in wi-fi like other have mentioned.Everything works well, menus are easy to navigate and understand.One of my favorite features is the remote viewfinder smartphone app. So many great uses ;)", "Date": "January 24, 2013"}, {"Title": "Samsung WB150F", "Author": "Amazon Customer", "ReviewID": "R2P6NKGOTAJ3LA", "Overall": "5.0", "Content": "This is a nice camera for the price; I wanted a camera with a good zoom I could still fit in my pocket at a moderate price and this fits.  Also worked well with the wi-fi; for the price, a good deal.", "Date": "January 10, 2013"}, {"Title": "Digital Camera", "Author": "Ksenia", "ReviewID": "REEIND0OHXRGE", "Overall": "4.0", "Content": "It looks gorgeous and pictures are really nice. But it`s a little bit slow in processing, so it`s hard to make a lot of pictures in a row. The button is not very sensitive(", "Date": "January 7, 2013"}, {"Title": "excelente", "Author": "edgardo", "ReviewID": "R3LF0KYQMN5TS3", "Overall": "5.0", "Content": "en realidad fue una experiencia muy buena con el producto, la llegada no tardo tanto los felicito sigan asi. excelente.", "Date": "January 7, 2013"}, {"Title": "compra samsung camara WB150F", "Author": "Jesus Cardiel", "ReviewID": "R1WHF4S8RGG9QO", "Overall": "5.0", "Content": "exelente compra, me llego el producto tal cual lo pedi, el tiempo de entrega por parte del vendedor fue rapido, recomendado", "Date": "December 30, 2012"}, {"Title": "I love this camera. It's easy to use.", "Author": "Jeri Brinkerhoff", "ReviewID": "RHYGQVJBKBBHX", "Overall": "5.0", "Content": "I love the easy to understand instructions and the large 3.0\" LCD. I am looking forward to talking terrific pictures.", "Date": "December 26, 2012"}, {"Title": "Love this camera", "Author": "Thomas", "ReviewID": "R2VYYRB6TQW4WF", "Overall": "5.0", "Content": "I've bought 2 of them now.  Love this camera.  Excellent in every feature you would want from a point & shoot.", "Date": "December 24, 2012"}, {"Title": "Terrrific little camera", "Author": "Dean", "ReviewID": "RBYD2MMWZOI3F", "Overall": "5.0", "Content": "Takes great pictures, and I love the 18x zoom on this camera. The last camera it bought was a Kodak with a 4x optical zoom. It took good pictures if you happened to be close to you suject, but ate up AA batteries; about 5 or 6 pictures with a fresh set. Batteries last a long time with this camera.The price is simply amazing!!", "Date": "December 23, 2012"}, {"Title": "WiFi does not work!", "Author": "Time Lord", "ReviewID": "RH10PQBCHVRIT", "Overall": "4.0", "Content": "I got this camera from \"Beach Camera\" fulfilled by Amazon. It is about $20 cheaper than Amazon and it comes with a bundle (memory card, mini tripod, camera case, lens cleaner, etc.). This is a beautiful and very good camera with a lot of options. It has so many option, you may not even need Photoshop to edit your pictures! However, after 24 hours, I'm still not able to share/upload the pictures to Microsoft Skydrive nor Picasa. It keeps giving me error message that server has expired. I haven't used other picture sharing features such as Facebook, Photobucket, or automatic PC backup. However, just like what other reviewer wrote, it is faster to take the memory card out and transfer the pictures that way. This camera takes really beautiful and clear picture. If you happen to be able to share your picture with the cloud, make sure you reduce picture resolution to 2 MB.Pros:- Built-in internal memory card.- Beautiful white camera (if you choose white instead of black).- Multitude of photo filter and \"Magic Frame\" (black/white, cartoon, silhoutte, picture in picture, panoramic, split shot, artistic brush).- Smart mode.- Programming mode lets you adjust aperture, exposure, brightness, color, white balance, and other stuff.- Built-in red eye correction.- Automatic face detection.- HD quality 720p movie recording.Cons:- Wifi does not work.Overall it's a very good camera as long as you don't depend on its wifi incapability.", "Date": "December 14, 2012"}, {"Title": "Amazing camera", "Author": "havoc1991", "ReviewID": "R1P41PXOARSQH1", "Overall": "5.0", "Content": "I got this for my mom, she loves to take pictures of animals. We have an eagle that visits during the winter but is too far away to see but with this camera we can zoom in enough to get a good picture, the eagle is still a bit far away (sits in a really tall tree) but now you can tell it's an eagle. The pictures are clear and the panoramic feature is nice. Very easy to use, I didnt try setting up the wifi feature yet.EDIT-I tried the wifi, and it works great. The signal is a little weak for being 20 feet from the router but it's steady. With the wifi feature, you can back up photos and videos very easily and even add photos and videos to facebook and youtube.", "Date": "December 13, 2012"}, {"Title": "The wifi function is incredible.", "Author": "WJGBalderama", "ReviewID": "RUFTNYZFSXTQ8", "Overall": "5.0", "Content": "I love this camera, especially the wifi function. Those built-in 'apps' also makes picture-taking a lot easier, particularly the panorama app. No need to paste several shots to make a panoramic shot.", "Date": "December 2, 2012"}, {"Title": "User Friendly", "Author": "RaceS60R", "ReviewID": "R2FOZYGPSUWEA2", "Overall": "5.0", "Content": "I've seen a number of reviews where people said they had a hard time figuring out how to sync it with their phone or e-mail, but I don't know why that is.  Every menu has a tutorial that pops up and explains everything as simple as possible.  I'm pretty tech savy, but I didn't need to be with this camera.  It's as simple as they come.  Just follow the on-screen short/simple instructions and it linked right up in seconds.  I didn't even read the instruction manual.  I do have an android phone, so I don't know how it will work with an Iphone, but I can try commenting on that another time.  Pictures look decent too.  The picture cartoons are a blast.Cons:  I'm used to Canon's and it seems to take and extra second to get the focus right.  The zoom feels a little flimsy or cheap, but it still does the job for now.  The camera doesn't feel as rigid as my Canon's so I hope it doesn't break when I drop it.  Also, they put a sticker on the LCD that wouldn't peel right off and I had to use a bunch of cleaner to get all the gum off.  Not as fast as the Canon's when scrolling through the pictures.  Not the greatest in low-light scenes, but the specs mention that.I picked this up for $115 and a comparable Canon was $200.  It does what I need it to do and more.  The menu is simple and has tons of advanced features that I'm not sure that I'll ever be advanced enough to use.  Be sure to do the firmware update after installing the CD software and updates; it gives quite a bit of extra features.", "Date": "December 1, 2012"}, {"Title": "Better price", "Author": "Vivian M Viana", "ReviewID": "R2331ORI1ILNYO", "Overall": "4.0", "Content": "I bought this camera last Sunday at Best Buy for $129.99  Great camera. I love it!So easy to use, better pictures that my old Samsung camera. Awesome for the price and the better the Samsung guarantee", "Date": "November 27, 2012"}, {"Title": "Good camera but Wifi function is not mature enough", "Author": "Bman", "ReviewID": "R2R33W35DPQ8KV", "Overall": "4.0", "Content": "I brought this camera for it's WiFi feature since i have many DSC already.I have no complain about picture or video quality but Wireless function is difficut to use.Well, I think it's not their fault, basically, WiFi direct is a new technology so it have long way to go.Think about it. If we can take pictures or video and easily transfer to cell Phone and send to cloud or hosting site. Life will be much easier this way yet the transmittion is too slow especially video.I think I will wait for other technology come out to do video transfer though wireless.", "Date": "November 8, 2012"}, {"Title": "Great zoom", "Author": "Fernando", "ReviewID": "R1CXJNQ997WJ2T", "Overall": "5.0", "Content": "The zoom in this camera is really impressive. It has many useful shooting modes. The WiFi thing is kind of \"basic\" and is nothing to be impressed by. Although over all, I am happy with it. =)", "Date": "October 30, 2012"}, {"Title": "Samsung Digital Camera", "Author": "Michael", "ReviewID": "R3LP35X8Q2H79P", "Overall": "5.0", "Content": "Camera takes excellent pictures. It has as many features as anybody should ever need or can be as simple as point and shoot! A great buy!", "Date": "October 24, 2012"}, {"Title": "It takes pictures", "Author": "TeeDee", "ReviewID": "R30TAHSPJFVUBC", "Overall": "5.0", "Content": "Well it is a camera. Better than the one I already had. The video is great. The pics are worth a thousand words each. The only improvement I could think of would be a touch screen. I am somewhat of a techie and the connectivity abilities of this camera are awesome. Streaming the video to my Samsung smart 55 inch led is flawless, not to mention how cool it is to see the pics on the big screen without hooking anything up. The remote viewfinder app for your smartphone is a little less than pefect but I can forgive the faults because now I will  get to be in the pics instead of just taking them. If you are in the market for a new camera and this is in your price range I will tell you to go for it.....I got a 32 GB card for 22 bux and  the two year warranty....all in all.... 200.00 dollars and I would do it again.", "Date": "October 1, 2012"}, {"Title": "Very impressed!  Update 6/5/2013", "Author": "Ranger \"Happy Retiree\"", "ReviewID": "RVXEUVZBWDHHG", "Overall": "5.0", "Content": "I did a lot of comparing online, knowing I had to replace a crummy Canon I have.  I discovered this model and compared it to many others in the same price range and above.  I got it yesterday, and I've already taken several movies and pictures and sent one by email from the camera!  This particular model/color was $100 LESS than the same product at Walmart, and far exceeds the features of many more expensive cameras.  I am not tech-savvy at all, yet I was able to figure this one out with the easy to understand features in the menu.  It is VERY friendly to those of us that haven't caught on yet to new technology symbols.  There are editing features that you would only find in an online photo editing website.  Well worth the money, with sharp, clear pictures, and great streaming video!  If you don't mind a white camera, go for it!  Highly recommend.UPDATE 4/8/2013:  Have taken numerous pictures and a few videos with this fine camera.  I have had several past cameras in this price range (not from Amazon) that seemed like toys, in looking back.  It is a \"Smart\" camera that is so easy to use. This camera got knocked off a counter top to a tile floor, and nothing broke.  It still works great, like nothing happened.  Have always been impressed with Samsung products, and this just reinforces my trust in Samsung quality. Great camera at a great price!UPDATE 4/29/2013:  I become more impressed each time I use this camera. I made a movie joining various clips and viewed on HDTV.  The quality of the wide screen, HD video is professional looking.  My friend couldn't believe what he was seeing!  Absolutely amazing!  To say the least, I am thrilled with this camera.UPDATW 5/6/2013  After a 4 hour pontoon trip in beautiful Lake Jocassee, South Carolina, I and others with way more expensive cameras are absolutely flabbergasted.  There's even software in the camera to get rid of the \"jiggles\" during bumps in the water.  You can edit your video with on screen directions without even connecting to your computer.  ALL of the different shades of blue/green/blue-green mountains created a spectacular backdrop to the emerald water, and close ups of flowers and vegetation.  I captured all the falls, including the audio sound of he water.  The only thing I would change is the zoom, which has a small wheel that zooms too fast... other than that, this is a perfect camera... also great still pictures.  You won't regret getting one... it's $100 cheaper on Amazon than Walmart, same model!", "Date": "March 15, 2013"}, {"Title": "Disappointed", "Author": "Pleased Mom \"Sheila\"", "ReviewID": "R1SPTCHJURO7IX", "Overall": "1.0", "Content": "Like several others, I was looking for a camera that could connect to the Internet easily. Love to post pictures as soon as I  can. I wanted to be able to zoom in better than my iPhone could.  This seemed like it was going to be perfect.  Wrong.Picture quality is poor.  Slow shutter speed. WiFi and Facebook connection slow and labor intensive. So in a nutshell, a waste of money. So disappointed.  Now I have to start my search all over again. I should have paid more attention to the 1-2 star reviews.", "Date": "May 22, 2013"}, {"Title": "This is absolutely the WORST camera I have EVER owned!", "Author": "S. Porcher \"seannslo\"", "ReviewID": "R129TRBXVI7W88", "Overall": "1.0", "Content": "I feel bad rating this camera because it was a gift from my wife.  I laughed when I read a similar review though about that hard to shop for husband/wife thinking this is the perfect gift.  I was excited to receive it and even though the same:  this is the perfect gift.  Now I can take better pictures than just the iPhone and have some higher quality photos for the future.  It is easy to setup and use.  No problem there!  The big problem is - like many reviewers have stated - is that the pictures are HORRIBLE.  No matter what I do - and I have tried this camera now for six months - all the pictures come out blurry!  Zoom, no zoom.  Flash, no flash.  Still, action - all of them BLURRY BLURRY BLURRY.I am almost 40 - I have owned many point and shoot cameras and two very nice Cannon Eos cameras.  This is the worst out of the lot.  To be honest - the picture quality on the iPhone 5 is superior to this camera.I am so disappointed.  More so - I feel bad that I hate a gift my wife got me!!!", "Date": "June 17, 2013"}, {"Title": "Failed in Six Weeks", "Author": "Ken", "ReviewID": "R15GT0185AG41M", "Overall": "2.0", "Content": "Purchased this camera on April 5, 2013. Performance degraded soon after purchase. Battery life was poor from the beginning and continued to decrease and by the sixth week, it would only take about 10 pictures after a 24 hour charge. I followed all initial charging instructions correctly.Support was a joke. Tried a chat but all they could do is refer me to a Service Request web page which had broken links and popup windows with no links at all. Threatened to charge me $55 if I didn't follow the troubleshooting pages but the troubleshooting pages did not work.Don't know if this is a battery problem or if the camera is shorted and running the battery down quickly. Should have stayed with a company that specializes in cameras such as Nikon or Olympus. For the short time it was working, it did take good pictures therefore I didn't give it a zero star rating.July 19, 2013 Update. Finally got my camera back from support and it is working OK now. Beware of Samsung support. The first person who told me to send in my camera in for repair sent me an e-mail with instructions which included an address in NJ. I FedEx the camera to them but 10 days later, Samsung sent me an e-mail saying they did  not receive the camera. I checked with FedEx and they said the package was on its way back to me. I got the package back and immediately checked the address on the package with the e-mail. Exactly the same. Called Samsung and the support tech said he would e-mail me a UPS shipping label for free shipping to the repair shop. I received the e-mail, (different address this time) repackaged the camera and sent it to the repair shop. I got the camera back in about two weeks. Not a good experience. I still don't understand how A company of Samsung's footprint could have support operations that send out the wrong repair shop address.", "Date": "May 27, 2013"}, {"Title": "Great feature set, good value, WiFi, only average image quality", "Author": "Bron \"Bron\"", "ReviewID": "R2U5G0DVC21JH1", "Overall": "4.0", "Content": "2013-02-16 Numerous updates and edits made below.I will come back and update this review with more details as I have more time with the camera, but first impressions are good for the price paid (~130).  It is of plasticky construction, but solid and the build quality seems good.  No printed manual, but the manual (PDF) is on the CD and is quite detailed.  You can read on your PC. Tablet, or other device or print it out if you like.The big question for many seems to be the WiFi.  I have a pretty standard wifi setup and I had no problems at all.  I selected my network, chose the shared setting, entered the password (easy) and it connected right away.  No need to even read the manual, just turn the dial to WiFi and you can probably figure it out if you have set up many devices before.  Once this was done, I was able to easily upload images to my SkyDrive after entering my login info, again easy to do.  I was also able to email photos to my email account.  Transfers were quick (normal wifi transfer speeds) for the 4-6 images I tested with.  If you try to transfer 500 images it's going to take awhile, probably better to just remove the SD card and use your SD card reader (or plug the camera up via USB).  But for casual transfers of images it works fine.  So the Wifi was easy to setup and use in my opinion and works well.  USB->PC transfers were also easy and fast.  And, of course, you can pop out the SD card and use your PC card reader or external USB reader as well.Update: Also tested PC Autobackup via wifi which transfers all pictures from your camera to your PC.  This is the most efficient wifi mode and also preserves the image size and quality.  Many of the other modes (like SkyDrive, social media choices, compress the file size).  You have to install the software on your PC from the CD (which also contains the manual and Intelli-Studio software) and pair once via USB.  After that you can use the PC Autobackup option from the WiFi menu on the camera and everything works automatically and efficiently. You can also transfer pictures selectively while browsing via the playback menu.  In general, all of the wifi options I have tried have worked well.  There was one instance where a transfer \"stalled\" but when restarted it completed fine and there were no further issues.Update: In further use AutoBackup has worked fast and without any problems.  It is definitely the best mode for saving your images off the camera via Wifi.  You always have the option of using the USB connection or removing the card, but AutoBackup works well enough that I don't see any need for that unless some circumstances preclude it. This mode tracks what you have transferred and will only transfer new images/videos - nice!  Transfers are placed in a dated folder, also nice.The camera handles well.  The Menus and controls are OK and easy to use.  Full manual settings are available which is nice at this price point. SMART mode seems to work OK. Everything works pretty much like you'd expect.  Zoom toggle is a bit small, but it worked OK.PQ Update: Images look soft and a bit low contrast.  Picture quality seems about average for a P&S; travel zoom camera.  Colors are good, saturation on the lower end compared to many.  The biggest issue seems to be the aggressive noise reduction (due to the small sensor size) which smears details and causes a loss of sharpness. Contrast also seems low.  The end result is the pictures do not have the \"zing\" that most out of camera jpegs have these days, so many will be disappointed in the image quality, I think.  It is possible to add some color saturation, sharpness and contrast, but the loss of detail due to the small, budget sensor cannot be \"fixed.\" That said, apparent image quality when viewing at normal screen and print sizes is OK and this may not be a big issue for some people.  This is not a DSLR.  At this price, the quality is acceptable, and images can be tweaked in any decent editor (though the lost detail cannot be recovered). For casual use, I think it is OK.  I've seen other cameras in this price range with very similar issues.  The noise reduction smearing of small detail is the biggest negative, so if you like crisp details, this will not be a good choice for you.So, picture quality is acceptable, but not stellar.  With a bit of care, good images are possible and the wifi and other features are unique at this price level. Decide if you can live with that in exchange for the other fun features offered.  In casual use, most people are not going to notice a lot of this.  Enthusiasts will.The many various modes, scenes, and effects are all a fun plus.  The \"live panorama\" mode worked very well in my few tests so far.  I was quite impressed, actually.  I found the camera fun to use.  There is built in help that explains most of the choices on screen and the controls are well thought out (for the most part) and easy to figure out and use.So far, it looks like a decent deal at the current price.  Comes with battery, charger, USB cable, CD, and wrist strap, but no SD card.2013-02-16 Update: Video -  Surprise!  The relative quality of the videos are pretty good.  The 30fps 720p HD (1260x720) video tests I took looked pretty good.  Good color, saturation, contrast, and detail (for video) and all in all very acceptable.  The videos also transferred fine via AutoBackup over wifi, thought they take longer due to much larger file sizes.  Having an 18x optical zoom that works in video mode is a nice plus, too, and it works pretty well.  The video is as good or better than a lot of the small portable video cams I have used and they're in the mp4 format so almost all devices should be able to handle them well.  Sound is mono (as usual for low price cam video) but decent. So we have a bit of a \"sleeper\" here if you like to shoot video as well as stills.", "Date": "February 23, 2013"}, {"Title": "images qualitiy is very poor", "Author": "Temur", "ReviewID": "RT81MHRJHBILH", "Overall": "2.0", "Content": "I bought it two month ago, i thought it's, and wi-fi.allshare, and I love samsung products, But picture quality was as in 5mp camera! Is too poor!! Don't spend ur money on it. There is a lot of good cameras for this price!", "Date": "February 13, 2013"}, {"Title": "Amazing", "Author": "Dianne", "ReviewID": "R37XOP75JFA5BA", "Overall": "4.0", "Content": "Love ItI have had this for two weeks now. This camera is very user friendly. If you are not sure of a shooting mode the \"smart\" mode does a great job. I love the zoom for a pocket camera. The transfer wireless does a great job and I don't have the best Internet service, even tho I only do one picture at a time. I do wish it was touch screen when you type,and also have an address book to save email addresses, which is reason for 4 stars. The manual that comes with it isn't the best, but if you google the manual you can download and print it, which is about 160 pages and really goes in detail of the things this camera is capable of doing. Takes vivid and clear pictures. I haven't printed any yet, but on my computer and Facebook ,they look pretty awesome. I don't know how long the battery lasts because when I'm done using it I put it back on charge. I really recommend this camera!", "Date": "December 6, 2012"}, {"Title": "Great camera for the price", "Author": "Jim L", "ReviewID": "R27LPPFRWS6XMI", "Overall": "5.0", "Content": "Great camera for the price.  Simple to use but yet packed with features.  Good quality pictures.  Much easier to use than many cameras that I looked at.  Best feature--my wife is can use it without my help.", "Date": "November 29, 2012"}, {"Title": "There's good and bad.", "Author": "CelticBrewer", "ReviewID": "RUE35EBIQC268", "Overall": "2.0", "Content": "Some qualifications first. I have a DSLR. I shoot mainly with my samsung smartphone. I've photographed a wedding and (officially) at pro sports events for a client. I've been taking pictures all of my life.  This is just meant to say- I have somewhat of a clue what I'm doing.Why I bought this: I didn't want to take my expensive and bulky DSLR setup out of the country of vacation. It's not the best of locations and the activities I was participating in couldn't accommodate the equipment. I needed a small point and shoot with decent zoom. I also considered it a huge bonus that it had wifi so I could share photos while on vacation from my hotel. It was a bonus that this, and my phone, are the same manufacturer and I could use Samsungs various apps to interface back and forth- either as a remote viewfinder and to transfer pictures back and forth.The Verdict: The wifi features are great. I connected, more often, between my phone and camera than directly from the camera to wifi. Many hotels require you to do a web-based logon when accessing their wifi. This is impossible for the camera to do.There's some scene modes that most cameras have. I mainly used the panoramic function which worked amazingly.Picture quality was variable. I believe the autofocus was lacking, especially in low light and in motion.  There is a surprisingly short depth of field if the camera is in anything but landscape mode, it seemed. And with the sketchy autofocus, I lost a more than a few shots where the wrong item was focused on.Let's talk about the zoom. This has a pretty extensive one for a camera of its size, afterall.  Well, that's why this product gets 2 stars instead of 4. After only a few days of shooting, the zoom broke. I was about to take a photo, so I extended the zoom, and then... the camera wouldn't take a picture. It wouldn't focus at all (something that happened a few times before). Like the other times, I pressed the power button to reset the camera. But this time, the lens didn't retract. On powering it up, a message said the zoom function had an error and to remove the battery and try again. I did that multiple times with no better result. The same message and only that message. Bricked.Luckily my photos were safe on the card. I used my phone's camera the rest of the trip. And Amazon refunded my purchase without issue. I wouldn't recommend this camera to anyone unless you specifically needed the specific wifi features that it has.", "Date": "June 3, 2014"}, {"Title": "Great", "Author": "Andrew", "ReviewID": "R2UC1SA6UPAHGF", "Overall": "5.0", "Content": "Samsung WB150F Long Zoom Smart Camera - Black (ECWB150FBPBUS)< this camera is not what I really intended to order. but so far it is working great.", "Date": "June 2, 2014"}, {"Title": "Not happy", "Author": "Lor \"lo-lo\"", "ReviewID": "R20K4F5CS3ZSDA", "Overall": "2.0", "Content": "Doesn't take great pictures inside at all.  I'm definitely not a camera expert but I can't get this thing to take good pictures.  I don't know but the flash just seems weak or something its always flashing at me and won't take the picture and when it does its horrible.  I should have stuck with the Canon brand they always take great pictures. I guess the good looking exterior of this camera is what drew me to it and now I'm unhappy with it.", "Date": "May 13, 2014"}, {"Title": "Great little camera", "Author": "steven r tremaine", "ReviewID": "R3BUSFIH08R19X", "Overall": "5.0", "Content": "I'm a home inspector and take a lot of pictures, The quality of the pictures is great. The 18x zoom really comes in handy...I have had it about a month so far and love it.", "Date": "May 7, 2014"}, {"Title": "Don't Buy If You Have A High End Smartphone", "Author": "Jorge's Amazons", "ReviewID": "R1G65BXALAGQNI", "Overall": "3.0", "Content": "If you have a Samsung Galaxy S3 or above, you really don't need this product.  Your smartphone will take better pictures with more pixel resolution and you will have all the feature that this camera has already built into the phone.  In regards to quality, the camera is so-so...  For the same price or a little more there are better cameras out there.", "Date": "May 6, 2014"}, {"Title": "smart camera", "Author": "Priscila Diaz \"PRI18\"", "ReviewID": "R1I6SPLOLPWGXQ", "Overall": "5.0", "Content": "I just bought this camera for a cousin, she know about cameras , and she really liked it, it's basic but really really good.", "Date": "April 20, 2014"}, {"Title": "I love this camera", "Author": "Sheila Hammond", "ReviewID": "R1083JUSD58HXA", "Overall": "5.0", "Content": "several of my friend already have this camera, so I knew it was awesome, , the price was right so I bought one for our job site.", "Date": "March 17, 2014"}, {"Title": "Lens system failure (retraction?) after a few hours from new", "Author": "John Klosterman", "ReviewID": "RJIFKC6MB0TTZ", "Overall": "1.0", "Content": "Only lasted for the first half of my daughters soccer game after receiving it brand new.  Major headache.  Lens system failed in the open position and it gives you a suggestion to remove battery and replace that doesn't work.", "Date": "March 14, 2014"}, {"Title": "Love this camera", "Author": "Dave in the dirt", "ReviewID": "RA8VGMME14Q5D", "Overall": "5.0", "Content": "I am not an expert, but this camera has way more features than I expected. I just use the \"shoot\" function  and get great photo. Battery stays charged and the wi fi feature is handy. The one I bought was reconditioned but it seemed to be brand new", "Date": "February 28, 2014"}, {"Title": "Sharp!", "Author": "J. Logue", "ReviewID": "R30NUVYXBQL3NK", "Overall": "5.0", "Content": "I'm getting sharp photos from this little camera.  It's especially nice for macro photos of flowers and insects.  It's easy to carry along everywhere. I enjoy using it.", "Date": "February 26, 2014"}, {"Title": "Such a great camera", "Author": "T", "ReviewID": "R3IEIEJ032YG4L", "Overall": "5.0", "Content": "This is definitely one of the best cameras out there. I love how it works with my Samsung phone. Would recommend to a friend.", "Date": "February 10, 2014"}, {"Title": "Minor but significant complaint", "Author": "James kelley", "ReviewID": "R3SE4LMYU09VNL", "Overall": "3.0", "Content": "Picture quality and functions were good but really annoyingly, the camera doesn't recognise when photos are taken in portrait and displays them landscape. You can manually rotate them in the edit suite but this was enough of an issue that I returned the camera.", "Date": "February 7, 2014"}, {"Title": "I very nice", "Author": "Olyery B.", "ReviewID": "RB85IJW7X4ST6", "Overall": "5.0", "Content": "It's a super good camera, it meets my expetativas, excellent image quality and zoom has good range also has the facility of a video shows more photos", "Date": "February 5, 2014"}, {"Title": "its good", "Author": "cute!", "ReviewID": "RW8QU1IP5B7CS", "Overall": "4.0", "Content": "My girlfriend loves it! The flash is really bright, which i don't like... but at least she likes it lol. Image is pretty good. Must have steady hands to take good pics. Zoom works welll but image is bad.", "Date": "January 30, 2014"}, {"Title": "Great Deal", "Author": "Eloisa", "ReviewID": "R1N9AAYPQR0AOG", "Overall": "5.0", "Content": "For the price it's worth it. Great quality  pictures and you can download from your cAmera to Facebook.My daughter loved it!", "Date": "January 23, 2014"}, {"Title": "Does everything very well.", "Author": "Paul Olson", "ReviewID": "R1X4EVUCBPIVJ7", "Overall": "4.0", "Content": "This is my second one of these.  One of the grandkids got their  hands on the first one and broke it.  My wife liked it so well that when I wanted to buy a more expensive camera she wouldn't hear of it. She wanted this exact same one.", "Date": "January 21, 2014"}, {"Title": "Boom Boom", "Author": "Dru", "ReviewID": "R2DK1FHY8RVZFL", "Overall": "4.0", "Content": "Bought this as a gift for my wife for xmas. Camera takes really good pics and we love that you can send them to your phone via the Samsung like app to our Samsung Galaxy S4's. Only downfall is it can run a little slow after taking photos sometimes.  All in all isa very good camera for the price.", "Date": "January 17, 2014"}, {"Title": "Good camera", "Author": "Constance Nadig", "ReviewID": "R15NNFGV827PKA", "Overall": "5.0", "Content": "Takes very nice quality photos.  Like to have a camera handy when the grandkids are around and this fits in my pocket easily.  Downloading photos to the computer is really easy with the cord.", "Date": "January 9, 2014"}, {"Title": "My mom can use it", "Author": "Brandon Wood", "ReviewID": "RH2664KFI13NA", "Overall": "4.0", "Content": "This was a purchase for my mom (~50 yrs). The Wifi features and Facebook uploading work well when connected, but it is a bit of a hassle to get connected to Wifi. The memory of hotspots is hard to navigate and most times you need to re-enter the password whenever changing networks. Make sure to configure the Wifi connection if you ill be transmitting pictures from somewhere new.", "Date": "December 31, 2013"}, {"Title": "Great little camera", "Author": "Sarah Langley", "ReviewID": "RRKD2NX0UGBEZ", "Overall": "5.0", "Content": "I needed a camera that could capture great zoomed shots from the stands to midfield for my daughters lacrosse games. This one totally does the job without having to lug around a huge Camera with massive lenses. Some of the pics will occasionally blur but I've just made a habit off taking many at the same time and then pick and chose through them later. I wish you could email more than 9 at a time though that gets annoying. And while the video quality seems good I have yet to transfer them anywhere because I get the message that the files are too large.", "Date": "December 30, 2013"}, {"Title": "Great camera...but Lens stopped working", "Author": "Tara", "ReviewID": "RU1V4HRHBK8KB", "Overall": "2.0", "Content": "I purchased this camera for a concert I went to, I was able to use it for about 6 mths then the lens just stopped working. The customer service was great and I recieved a full credit, I also had to option of buying another one like it.", "Date": "December 25, 2013"}, {"Title": "Great eBay camera", "Author": "Anne Zarraonandia \"i love barbra catalog\"", "ReviewID": "R3NJG13LV0B1BT", "Overall": "5.0", "Content": "I needed a good quality camera for taking pics in my eBay biz/office.It's a shared camera, so it has to be easy and take great pics.Both of those criteria were met. I may buy another to have multiplecameras available.", "Date": "December 20, 2013"}, {"Title": "so far so good", "Author": "D Yurges", "ReviewID": "R1KL5V20M7VKLT", "Overall": "4.0", "Content": "I'm still learning to use all the features but so far so good.  I would have liked to had an owners manuel instead of going to my computer and running the disk.", "Date": "December 7, 2013"}, {"Title": "Really amazing camera!", "Author": "JLLE21", "ReviewID": "R3BJDR9E39I6YK", "Overall": "5.0", "Content": "compact size, bright display, oustanding pictures, and amazing optical zoom! i'm very pleased by this product! i'm just waiting to give it an software update and discovers what new features come with it!", "Date": "November 22, 2013"}, {"Title": "Great!", "Author": "MI.Girl", "ReviewID": "R2RU1E09VOTZGM", "Overall": "4.0", "Content": "I love this camera and all of it's features. It's been great for me around town and during special events. Small enough to carry everywhere, but a powerful enough camera to get better shots than the standard point and shoot. Only 4 stars because the non touchscreen can get annoying for entering passwords and captions when using the Wi-Fi feature.", "Date": "October 4, 2013"}, {"Title": "Good camera", "Author": "Susan Ingham", "ReviewID": "R18WQBDV0K7FZV", "Overall": "4.0", "Content": "I bought this camera as a gift for my son, who lives out of the country and takes a lot of pictures.  Very good camera for the price!", "Date": "October 3, 2013"}, {"Title": "Samsung WB150F Long Zoom Smart Camera - Black (ECWB150FBPBUS) from amazon.com", "Author": "Trisetio Wahyuaji", "ReviewID": "R2ECKFGD7MBR3W", "Overall": "4.0", "Content": "I Was received these Camera  a weeks Ago ..I Felt Satisfied About The Package and Box .And Also The Camera is Helpful For Me  Because It Has Smart Auto capture which means Its getting Me Easier to take some photos Quickly.  Thanks So Much Amazon.Com", "Date": "September 28, 2013"}, {"Title": "Great Camera", "Author": "S. Laurence \"Rockportshirl\"", "ReviewID": "R34FZVOTXO1R6V", "Overall": "5.0", "Content": "I bought this one to carry in my purse because I don't carry my big camera with me everywhere.  This one takes very sharp pics and it's very easy to use.  Had an older Samsung that was a great camera as well, but this one has such a great optical zoom for a small point and click-great for those \"wish I had my camera with me\" moments.", "Date": "September 16, 2013"}, {"Title": "Nice pocket camera", "Author": "Yuval", "ReviewID": "R22TQ8IUGSJR50", "Overall": "4.0", "Content": "The camera is working very well and the photos are very good for such typeit is easy to hold and handle and hardly get bad photoThe only points why I gave it 4 starts instead of 5 is its WIFI abilityit has WIFI ability but it is rather complicated to use cand also send photos at low qualityall the rest is more than OK", "Date": "August 28, 2013"}, {"Title": "great camera with so many features", "Author": "C. Church \"PRO SKATER\"", "ReviewID": "R3NRVDIDKQ06ZD", "Overall": "4.0", "Content": "This camera is a fantastic bang for the buck. You get so many useful features and a long zoom that works great. My only recommendation is to put it in the p setting and adjust the settings to achieve great pictures. Overall some of the great features and for the low price seem to make this camera a great choice. It even has a German made lens.", "Date": "August 28, 2013"}, {"Title": "Samsung WB150F works like a charm!", "Author": "Frances Tungate", "ReviewID": "R1AJTXXOOWFC6S", "Overall": "5.0", "Content": "This camera is smart, light, and works like a charm.  Easy set up and use.  Connectivity to internet thru wi-fi, makes it a 100% winner for me.  Exactly what I wanted, at a reasonable price.", "Date": "August 17, 2013"}, {"Title": "Nice", "Author": "Caleb Castine", "ReviewID": "R29RFZ9WBQYZRS", "Overall": "5.0", "Content": "Very good photo quality.  Turn on speed is excellent.  Takes my 32gb XDSD card without a problem.  Optical zoom is very nice.", "Date": "August 13, 2013"}, {"Title": "Disappointed", "Author": "J. C. \"scoot\"", "ReviewID": "R1DZ4I5JZDKJMP", "Overall": "2.0", "Content": "I wanted to like this camera, I really did. But I don't. It feels cheaply made, its much to hard to navigate through its various menus and menu options and selections and settings. I find this camera tries way to hard to duplicate free photo editing apps I already have in my phone. If I didn't, I guess id appreciate this camera more (to bad its not as easy to use as smartphone apps.) Someone should remind Samsung this is a point and shoot camera not a turn on wait - turn top dial, wait - scroll - press ok - wait for menu screen to disappear - shoot. Does fit in a pocket nicely, nice (but slow) zoom. Picture quality is ehh. This is now my - ' Would not recommend. Sorry I bought this. Should have returned when I had a chance.' camera. Oh well, shame on me.", "Date": "July 30, 2013"}, {"Title": "Love this camera", "Author": "Mary Bortz", "ReviewID": "R3BMKF1Y30BOMO", "Overall": "5.0", "Content": "One of the easiest to use cameras I have owned. Love the wifi feature. Pictures are crisp and clean even at night and the zoom works great.", "Date": "July 30, 2013"}, {"Title": "Super & affordable Camera", "Author": "nobodyveryspecial", "ReviewID": "R1Y1IGL15RSG8F", "Overall": "5.0", "Content": "While on vacation with my Brother & his wife he showed us his new camera and all it could do.  They have been doing Photography for years, typically using the big lenses and winning contests for their photos.... So I knew if he said it was good, it was good.  A week after we got home I ordered myself one.  Showed  my daughter-in-law and she ordered one! This camera is FUN!  You can take a picture, and is seconds put it on FB, or email it.  It was affordable & had free shipping.  Great quality photos!", "Date": "July 20, 2013"}, {"Title": "Great Camera", "Author": "E. Mainiero \"Library Director/Consultant\"", "ReviewID": "R2GHQDBVHWB2IE", "Overall": "4.0", "Content": "Price was good.  Pictures are good.  Like the zoom and the chance to crop out without degrading of a picture.", "Date": "July 19, 2013"}, {"Title": "I LOVE, LOVE, LOVE THIS LITTLE GUY! Worth every penny!", "Author": "Jo J. Brown \"Nanajo\"", "ReviewID": "RPEJCBKN3YL6F", "Overall": "4.0", "Content": "I use it to catch my pets or outside critters doing crazy things. Absolutely love it! Use it every day!", "Date": "July 14, 2013"}, {"Title": "Muy buena", "Author": "juan jaider reales", "ReviewID": "RZBL8FOK5UOIG", "Overall": "5.0", "Content": "The camera is very good. The pictures that i have taken are simply awesome. Good price. Everything was perfect. J", "Date": "July 13, 2013"}, {"Title": "A Speck", "Author": "Cable Free Since 2003", "ReviewID": "R1VFZMT3NCS01S", "Overall": "2.0", "Content": "Took a while to figure out, but apparently there is a speck between the lenses which shows up as a blurry dot in the same place on every image.  Also I thought I was buying a fancier model, but that's my fault.  It does have a nice wide angle.Update - also doesn't have a setting for low resolution pics like 640 x 480 which I needed, but didn't think to look for.", "Date": "June 19, 2013"}, {"Title": "Excellent", "Author": "James Neglia", "ReviewID": "R1E0F6FLSMM348", "Overall": "5.0", "Content": "This is the best camera I have every purchased. I love the wifi capabilities it offers. On vacation, just click and load directly to your email or facebook! Love it!!", "Date": "June 12, 2013"}, {"Title": "Pictures arnt the best", "Author": "Austin Plummer", "ReviewID": "R3DXM9ONO24ONM", "Overall": "3.0", "Content": "I bought this for my fiance for Christmas and honestly the pictures are not great. My phone takes much better pictures!", "Date": "June 8, 2013"}, {"Title": "Zoom Clarity is missing the mark", "Author": "Skoobdo", "ReviewID": "RS5DNC7VCWEWA", "Overall": "3.0", "Content": "First off, I have nothing negative to say about any of the functions, or special features as they work exceptionally good. However, the photo clarity in ANY zoomed in shot is surely lacking.I purchased this camera to take to Europe, which is where I'm using right now. Every zoomed in shot is blurry. I own a 14x zoom Canon that takes clear zoomed in shots with no issues, but it doesn't have WiFi capabilities, which is the primary reason I purchased this camera.I can also say that I haven't had any issues with regular shots, but unfortunately the zoomed in ones are not as crisp, or more blurry than others.If Samsung could improve the quality of the images taken at the zoom level, I would certainly buy it, as all the features this camera has is very nice!I can't rate this camera above 3 stars.", "Date": "June 6, 2013"}, {"Title": "LOVE LOVE LOVE", "Author": "Stepping Higher", "ReviewID": "R2JB452S1PEBT9", "Overall": "5.0", "Content": "I would agree that this is not your typical point and shoot camera, there are some things you have to take into consideration, but for the most part it is fairly easy to navigate. I love everything about this camera. I am still trying to figure out how to take better pictures in low light, but I'm sure it's just matter of practice and reading the manual. I purchased it for a Hawaiian vacation and it lived up to my expectations. The zoom and battery life are amazing. I purchased the car charger which came with 2 additional batteries, always having a freshly charged battery helped me not miss that perfect shot. Using the wifi to email or upload pics was tedious, but there is an app you can download to your smart phone and upload the pics to your phone, that made it a lot easier to share the pictures. I am in love with the split shot and live panoramic features.", "Date": "April 10, 2013"}, {"Title": "Great value for modest  cost", "Author": "Gary Gores \"Mr golf daily\"", "ReviewID": "RWHLJQ7IOOR0H", "Overall": "5.0", "Content": "I use the P mode to get better pictures adjusting the light--whether sunlight, fluorescent,  incandesant, shade or low light. Camera has a difficult time getting focused on 14x zoom...", "Date": "April 8, 2013"}, {"Title": "Nice features for a cheap camera", "Author": "OBWONdotNET", "ReviewID": "R1WMW00Q7IUI72", "Overall": "4.0", "Content": "Works well, is basic and much more advanced versions are also available now for slightly more money. Still is good", "Date": "April 8, 2013"}, {"Title": "Cool White", "Author": "S. A. Hoy", "ReviewID": "R17B27GSZOEZ1", "Overall": "4.0", "Content": "I gave this camera model in black to my husband a year ago.  When my camera died, I asked him if he was happy with his.  He was thrilled that it has WiFi and can send directly to email or Facebook.I am also thrilled.  I paid a lot less than the original black one purchased a year ago.Looking forward to many fine pictures and videos in the future.", "Date": "April 6, 2013"}, {"Title": "Good performance & Price", "Author": "Engin Bulut", "ReviewID": "R1EDH3G2I84NBR", "Overall": "5.0", "Content": "Nice quality photos for price & weight.High quality zoom and good performance of wireless.Happy to use and buy it so far.", "Date": "April 5, 2013"}, {"Title": "Good camera with easy sharing through WiFi", "Author": "Kerkar \"uma_sam\"", "ReviewID": "R1VQX2JIFZWT0W", "Overall": "4.0", "Content": "Have always bought Nikons; but gave this Samsung camera a chance since the Black Friday price was too good despite being loaded with features such a 18X zoom and, especially, a rare built in WiFi. The WiFi has been a great convenience while traveling. It allows sharing of photos via email or Facebook without having to download to a computer. The photo quality is also quite good considering the compactness and price range.", "Date": "March 15, 2013"}, {"Title": "Good camera", "Author": "Mario", "ReviewID": "R2H36CQ75BF121", "Overall": "5.0", "Content": "A camera is fascinating, takes good pictures day and night, is lightweight and is the perfect gift at a low price", "Date": "March 13, 2013"}, {"Title": "AWESOME!!!", "Author": "Kathy Byrd", "ReviewID": "R3DXDYTLBB0G5Q", "Overall": "5.0", "Content": "I Just love this take a photo upload right where you stand put it on facebook email got to be the best camera i have ever had thanks Samsung", "Date": "March 11, 2013"}, {"Title": "Excellent camera with easy to use functions", "Author": "Mano K Ponna", "ReviewID": "RA5K621IMCKMY", "Overall": "5.0", "Content": "I would reccommend this camera because it has built in WIFI and can be remotely take pictures with other Samsung devices.", "Date": "March 7, 2013"}, {"Title": "Great camera", "Author": "Harley Girl", "ReviewID": "R1RAS39XWLC4XF", "Overall": "5.0", "Content": "What a great little camera for so little money.. Does everything I need it to do..makes great pictures and love the fact I can send them directly to Facebook", "Date": "March 5, 2013"}, {"Title": "Great Camera", "Author": "Matt", "ReviewID": "RDU6NXP0XQN6A", "Overall": "5.0", "Content": "Lots of features for a low price......  Love the smart camera in that after I take photos I can email them directly on the spot from the camera as long as I have an active internet connection or at a nearby hot spot.  The other features I like are the easy pans. Just set the pan feature and  hold down the shutter and pan your photo, release the shutter and you are done.  You can do both horizontal or vertical pans and the long lens gives great telephoto results for bringing distant objects close.", "Date": "February 25, 2013"}, {"Title": "Great pictures!", "Author": "Cindy Fatland", "ReviewID": "RS703TC1ZBO2Y", "Overall": "4.0", "Content": "I wanted a inexpensive camera that fits in my purse and also takes good pictures and thats what this camera offers. Not sure how the wifi works just yet cuz the owners manual is limited in the box and im not that up on all this technology. The disk that came with the camera has not worked in my computor not sure why. But if your looking for grest zoom and pic quality this camera is great for the price.", "Date": "February 18, 2013"}, {"Title": "Love it", "Author": "Amazon Customer", "ReviewID": "R1LMGJ6732T52I", "Overall": "5.0", "Content": "I just got this camera earlier this week and have been playing around with it in the indoor setting.  I really love it.  Very easy to use.  I have the Samsung Galaxy S3 Android phone so there are two apps, one for controlling the view finder with my phone and one for sending files to my phone.  It takes great pictures.  I use a website called Be Funky to edit my pictures and it works great with that, although this camera comes with a built in picture editor if you want to use that.  I don't plan to utilize the feature where you send pictures to email or facebook from the camera because I would rather transfer the files to my phone and then edit them and share them from there or from my chromebook, but it certainly is a nice feature for someone who needs that.", "Date": "February 15, 2013"}, {"Title": "buen producto", "Author": "Jorge Ivan Giron", "ReviewID": "RWTOIMF5E6SY1", "Overall": "5.0", "Content": "excelente vendedor  el producto llego en los tiempos establecidos por el vendedor, las prestaciones de la cámara son mas de lo esperado tiene muchas funciones muy buenas totalmente recomendado.", "Date": "February 14, 2013"}, {"Title": "Nice Camera", "Author": "DS Dave \"Dave\"", "ReviewID": "R34U2NIF852RML", "Overall": "4.0", "Content": "Compact and light in weight with a fast zoom lens. The manual features for aperature and shutter priority are useful. I have not tried the auto smile detect feature. I was  disappointed the the remote feature using a phone or tablet only works via a wifi network so you cannot use it while outside for nature shots of long exposures which is what I had hoped. It would have been better if it acted as a wifi hub and connected that way. The feature worked with my Nexus 7 tablet, allowing limited zoom and picture taking.", "Date": "February 14, 2013"}, {"Title": "Awesome camera!", "Author": "Manjit", "ReviewID": "R2AO92U81D10Q5", "Overall": "5.0", "Content": "Just abt the best at the selling price point! Just the most amazing camera ever that i've bought in my life!", "Date": "February 13, 2013"}, {"Title": "The Best", "Author": "Chris.Inc2 \"Grandmother of 2* Chris'Shani & C...", "ReviewID": "R3EKKLFLMRHM4X", "Overall": "5.0", "Content": "This camera has everything I was looking for in one device, it is so hard to find a great camera that offers Wi-Fi network built in, it connects to my phone, pc and printer. I would definitely recommend this camera from Amazon. because it is in other stores at a greater price. my camera came before date it was promised. I just love it.", "Date": "February 8, 2013"}, {"Title": "Great camera", "Author": "Charles", "ReviewID": "REWXJZ73RRU3V", "Overall": "5.0", "Content": "I can't believe the zoom on this camera. We bought this for my cousin, she used it to take many wonderful photos that rivaled my DSLR.", "Date": "February 6, 2013"}, {"Title": "Great Camera with Great Features", "Author": "Jamie P.", "ReviewID": "R1B8OIYKR9ZTHS", "Overall": "5.0", "Content": "I had my eye on this camera for a little while and decided to buy it with some Amazon gift cards I got for Christmas.  I thought about getting the Galaxy camera but decided to take a chance on this one and I am glad I did.  My favorite feature is being able to connect this wirelessly to my Samsung Galaxy S3 and download the pictures to my phone.  I love this camera and would recommend it to anyone who loves to share and edit pictures.", "Date": "February 5, 2013"}, {"Title": "Great Buy", "Author": "Boriqua Baby", "ReviewID": "R3QV5ZMNAHI0GT", "Overall": "4.0", "Content": "I purchased this camera for my trip.  Not as easy to use as I thought, thats why I gave it four stars.  But the price could not be beat and is compact enough for my travels.  Also received item as indicated by supplier", "Date": "February 3, 2013"}, {"Title": "Zoom doesn't work", "Author": "Anita", "ReviewID": "R3766YP02OKBN2", "Overall": "2.0", "Content": "The zoom on my camera won't adjust, or retract...just zooms out fully and won't focus.  It then freezes and I have to turn off the camera to continue.  I don't have time to return it before a trip to New Zealand, so I guess I'll have to carry my old camera also in case anything else goes wrong with this one.  Not happy!!", "Date": "February 3, 2013"}, {"Title": "Perfect!!", "Author": "Jeanne Cumby \"jeannesbooks\"", "ReviewID": "RMKN2U5QFQL5P", "Overall": "5.0", "Content": "I just bought this camera before I depart to study in Korea (Samsung! wootwoot!) I've always been Samsung biased and this camera exceeds my already high expectations!I mean, it connects to the internet!! I have had so much fun uploading pictures directly from the camera (probably been having too much fun).The camera has really cool editing tools and awesome effects. It's compact and can it in my pocket ( it does bulg a little considering it has a huge lens or zooming)the picture are o perfect quality too.I'm very excited to start putting it to good use in Korea, I'm sure it's going to become a handy little tool!!!Definitely has my highest recommendation.", "Date": "February 1, 2013"}, {"Title": "This camera is getting a lot of use.", "Author": "Claudia Getz", "ReviewID": "R1TLY2M9MXDA7N", "Overall": "5.0", "Content": "I needed a good camera that was small enough to pack around so I don't miss any \"kodak moments\" with my family.  This camera has been so easy to use. It's intuitive. I did study the owners manual. But only once and haven't had to go back to it. I can figure everything out. I have never been disappointed. Love being able to use the iPhone for the cable release. Love being able to e-mail my photos to friends and to my computer. I can even e-mail straight to facebook.  Now my pictures actually get seen instead of just sitting idle in a memory card. Love the girly white color too.", "Date": "January 30, 2013"}, {"Title": "Very, very good buy.", "Author": "bisdak", "ReviewID": "R2Z76SH35XS359", "Overall": "5.0", "Content": "I am very satisfied with this camera.  So easy to use and make very good pictures.  Samsung digital cameras will surely be the camera of the future.", "Date": "January 29, 2013"}, {"Title": "Great camera", "Author": "saga62", "ReviewID": "R2RE74B04M0W1K", "Overall": "5.0", "Content": "This is an expensive camera that is easy to use and takes fabulous pictures.  I highly recommend it for everyday use.", "Date": "January 27, 2013"}, {"Title": "Samsung Camera", "Author": "Vermont Runaway", "ReviewID": "RQMY2JDM18Y83", "Overall": "5.0", "Content": "awesome camera.  does all it says it will and then some.  great for traveling as it is small enough to fit in pocket.  fantastic  telephoto lens-. takes nice sharp images.  would recommend this camera for all to use.", "Date": "January 25, 2013"}, {"Title": "Love it!", "Author": "Karen Fry", "ReviewID": "RSS7S1ME3SJUD", "Overall": "5.0", "Content": "We like the new camera, nice to take a picture and put it right on FaceBook! Thanks John and Karen", "Date": "January 22, 2013"}, {"Title": "Very nice camera!", "Author": "Catherine Croney", "ReviewID": "R2OOQ31E77157S", "Overall": "5.0", "Content": "Very good product! Great zoom and I like the sharing option! Would recommend for anyone wanting a good point and shoot!", "Date": "January 20, 2013"}, {"Title": "Great Compact Camera", "Author": "P. Crawford \"I am from the Central Valley in ...", "ReviewID": "R2WXB33NKNLXHL", "Overall": "5.0", "Content": "I bought this camera as a present for my granddaughter.  She loves it!  The picture quality is great, it is small enough to carry conveniently, and she loves the wi-fi capabilities.", "Date": "January 17, 2013"}, {"Title": "Great Camera!", "Author": "SunDown", "ReviewID": "R30BWL5S08ZMH8", "Overall": "5.0", "Content": "Good quality pictures, easy to use, great to send pictures to friend thru the Wi-Fi.  Excellent for the photo enthusiast!", "Date": "January 16, 2013"}, {"Title": "great value", "Author": "Amazon Customer \"mommarj\"", "ReviewID": "R1R9JMP87G040G", "Overall": "5.0", "Content": "My daughter is loving her new camera.  It takes a great photo and is quite versatile.  I like how it can interact with my Samsung Droid.", "Date": "January 14, 2013"}, {"Title": "so far so good", "Author": "Cavalry \"Mark\"", "ReviewID": "RMP3EQ0P73VS0", "Overall": "4.0", "Content": "I like the was you can use certain Samsung phones as the camera's remote control. you can zoom with them and take a picture. The camera is nice and compact for a pocket. The WiFi feature that is used to transfer the pictures directly to facebook etc is really cool.", "Date": "January 11, 2013"}, {"Title": "Samsung WB150F", "Author": "Mabel Aviles", "ReviewID": "R2CDMOI2C6PA22", "Overall": "5.0", "Content": "Bought this camera to update my old one and on a friend's recommendation. Could not be happier! Awesome camera. Very happy with my pictures and features.", "Date": "January 7, 2013"}, {"Title": "buyer be where!", "Author": "katie", "ReviewID": "RH1Z4IYWPKQ3D", "Overall": "4.0", "Content": "let me first say this is a really good camera.. you can upload pictures to Facebook or e-mailbut you can not link it to your phone unless you have a Samsung galaxy phone i called them cause i could not get itto link to my phone and it will not link to a tablet so thats crap they say you can i have a Samsung galaxy tab 10.1an they told me it wont link to that ether so unless you have the  Samsung galaxy phone your out of luck linking anything too the camera but it did it hooked to my WiFi just fine... i love the camera for the Facebook an the quality of the camera over all is really nice but i only paid 129$ for mine. i would not pay 229$ ( witch Samsung is asking online for it) its not worth that much..", "Date": "January 6, 2013"}, {"Title": "Amazing camera...  Bought for our daughter", "Author": "Gran", "ReviewID": "RXH5UR3AKDNWI", "Overall": "5.0", "Content": "Bought for daughter who does alot on Facebook.  She loved the compatability with it.  Great buy!  Amazing capabilities...  Exactly what she wanted.", "Date": "January 6, 2013"}, {"Title": "Not impressed", "Author": "Ray Schultz", "ReviewID": "RT41KC8MLDZYH", "Overall": "2.0", "Content": "Found the pictures don't seem to be high quality and the camera feels cheap and plasticy.  I wouldn't recommend it.", "Date": "January 3, 2013"}, {"Title": "Love It <3", "Author": "Karina E. Diego", "ReviewID": "RH63MS264ZIN4", "Overall": "5.0", "Content": "im enjoying this product it was a prefect gift to receive......... It takes good pics n has awesome apps..... <3", "Date": "January 2, 2013"}, {"Title": "Cool features... Not so cool photos", "Author": "Anna9882", "ReviewID": "R54HG97HORS4S", "Overall": "3.0", "Content": "My biggest complaint with this camera was the photo quality. I could never seem to get the coloring right. When I took pictures on Auto everyone's faces were completely washed out and every feature I tried I couldn't seem to fix that problem.", "Date": "January 2, 2013"}, {"Title": "Nice and compact.", "Author": "Gary L. Pyles \"GON-UP-RU\"", "ReviewID": "R1UQYZCAZ6BF2B", "Overall": "4.0", "Content": "A good little camera. We take it on all our hikes which are many.. The video is good. In low light it is a little grainy. Price is right.", "Date": "December 31, 2012"}, {"Title": "It's very good", "Author": "Vishal", "ReviewID": "R155WO9WM0Y465", "Overall": "4.0", "Content": "It's a good product with all the features for which a common man can want to use it. I can say it's awesome", "Date": "December 30, 2012"}, {"Title": "great carmera", "Author": "floyd", "ReviewID": "R279A84Y44BZ9Z", "Overall": "5.0", "Content": "gave the camera as a gift and she loved it.  all the special effects.  great camera at a great price", "Date": "December 28, 2012"}, {"Title": "Better tan expected", "Author": "TM", "ReviewID": "R39JT4WWBFNV4Z", "Overall": "5.0", "Content": "I expected something not as sturdily built, and the white looks \"cool\"Pictures are great, and the WiFi found my Samsung SmartTV so everyone in the room can see my shots.I waiting to see how good the battery life is, but it was used all day on Christmas and the day after and it still as plenty of charge.", "Date": "December 28, 2012"}, {"Title": "Love my samsung, smart camera", "Author": "June Lawson", "ReviewID": "R3VPNDZVKAVGHO", "Overall": "5.0", "Content": "I use this a lot. It is amazing cause I can send pics straight from the camera to any email, facebook, twitter, etc. Very nice.", "Date": "December 28, 2012"}, {"Title": "I love it", "Author": "Nodi", "ReviewID": "RE3RN8C6MNQ9R", "Overall": "5.0", "Content": "it is very useful and good to use any where. it has WiFi so you can connect to internet and facebook to upload any images immeidatly.", "Date": "December 11, 2012"}, {"Title": "Photo counter went bad", "Author": "Amazon Customer", "ReviewID": "R3SQTFKGCRZK9E", "Overall": "4.0", "Content": "Good camera, really like it. Had the camera for a week. The photo counter started out as 100-0001. Took five photos and the counter jumped up to 100-2886.The next photo was 100-2887 and so forth. Talked to Samsung and they had no solution to fix the counter. Amazon is giving me a full refund on the camera. Will probably purchase the same model when I get my refund from Amazon. Might have been just a burp in the counter. The WiFi part of the camera is really nice.", "Date": "November 16, 2012"}, {"Title": "samsung_wb150f camera", "Author": "Sam Oht", "ReviewID": "RDY3R3BIGS99T", "Overall": "5.0", "Content": "Excellent camera,love the 18x zoom and all the extras. Great bang for your buck! Highly recommend this camera. Love the Wi-Fi feature. A lot of detail in this camera.", "Date": "September 2, 2012"}, {"Title": "MAC USERS BEWARE!!!  Wifi will not work for you...", "Author": "H. Kirk", "ReviewID": "R1SFXOKD9GVFTP", "Overall": "2.0", "Content": "MAC USERS BEWARE!!!  Although Samsung's website description for this camera gives you system requirements for a Mac, their software does not work on Macs (which they don't tell you anywhere).  So you cannot use the wifi uploading feature to wirelessly upload your photos to your computer.  Trying to even get the camera connected to any wifi is a task in itself.  I did finally get a photo to email off of the camera, but it emails the photos through a Samsung email network, so it went into my Spam folder when I received it on my computer.  This makes sending photos to others difficult since it goes into their Spam folders.Also, Samsung's Remote Viewfinder App that they have for the iPhone does not work at all.  Even after it updated the App 4 or 5 times in only 4 weeks time, it never worked. I called and spent more than an hour on the phone with their techie who swore up and down that Samsung does not mention system requirements for Mac on their website and that they absolutely do not make an app for the iPhone and never would.  When I proved her wrong by having her go to their own website and by having her open iTunes and see the App that says it is made by Samsung and says that it is supposed to work for this camera model, she said that she couldn't help me because although they have apps for other phones, they only guarantee their Samsung-based phone app to work.I admit that I got pretty decent quality pictures from the camera (although not in low light).  The 18x zoom is also great on such a compact camera.  So I gave it a 2 star rating instead of 1.  But if you are a Mac / iPhone user and are purchasing the phone for the wifi capabilities, forget it.I will say that no matter why you are purchasing it, EVEN IF YOU ARE A PC USER, expect that if you have a problem with or question about the camera, you will likely know more than their techies do (no offense, but they were clueless about what Samsung even offered or stated... let alone about being able to give any actual help or answers).  I actually returned the camera just before the 30 day mark since none of the wifi features worked and the low light photos were not good.A wifi camera is a great concept... if only it worked.", "Date": "May 14, 2012"}, {"Title": "Falls Short in One IMPORTANT Area", "Author": "M. Collins", "ReviewID": "R1TDNSGZT5TBDF", "Overall": "2.0", "Content": "I was excited to buy this camera after reading all about its features. However, while reading reviews from others (especially the professional reviewer sites) I kept reading about poor picture quality. After a while I thought, \"Darn it. Just go out and buy one and find out for yourself.\" So I did ... and guess what? ... those reviewers were correct. The photo quality of the images is poor at best. I've already got a Samsung SIII mobile and I think it actually takes better photos than this device.I returned it to Best Buy after 3 days.The features are cool (I liked the wifi to phone thing), but it just falls way too short in the image quality category. There is no way I can give this camera any more than two stars.Keep trying, Samsung. You'll get there someday.", "Date": "November 19, 2012"}, {"Title": "Slow downloading", "Author": "J. Yang", "ReviewID": "R2YLTFWWNG6VDA", "Overall": "2.0", "Content": "I purchased this camera hoping to save some time getting photos downloaded off the camera. Did not work well. If you are planning on using the WiFi link to download all your shots, it will take a long time and sometimes fail during the process. Much easier to take out the SD card and plug it into your computer card reader. The occasional posting to a social website is probably the limit for WiFi functionality. Pic quality are only OK. I would not recommend", "Date": "October 23, 2012"}, {"Title": "Lens Cover Jams AGAIN!", "Author": "Jack", "ReviewID": "R322AOF7MY505B", "Overall": "1.0", "Content": "This is the second time I purchased this camera this year. Used it on one trip to Idaho and teh lens cover is jamming already. It is flimsy and the smallest speck of dust will jam it. Don't buy this camera.", "Date": "June 25, 2013"}, {"Title": "Great Camera", "Author": "Joseph", "ReviewID": "R3KQTDKLZDN8MQ", "Overall": "4.0", "Content": "Great  camera, takes great picture and has and awesome zoom. The wifi feature is really good but the only down fall of this feature is that the camera doesnt have a touch screen to lable the pics and folders. You have to use the arrow keys and ok buttons to enter text which is tedious and almost makes you not want to use the feature (this is why I bought the camera. the only other minor down fall is it doesnt have the panoramic mode like the iphone or some other cameras on the market. These are the only two complaints I have but all in all this is a great camera.", "Date": "May 24, 2013"}, {"Title": "Great pocket shooter, but not if you have a DSLR or top-shelf phone", "Author": "Dr Moreau", "ReviewID": "R1IV6KW6NIRG1W", "Overall": "3.0", "Content": "What can I say? Tons of features and will take lots of nice and easy snaps while on vacation, but for someone like me who already owns lots of nice camera equipment it just wasn't worth it. I was always the one that said \"at least it's better than a camera phone\". I upgraded my phone about a week after buying it and compared the two...and the phone (Galaxy S3) actually had a much sharper picture.Oh well, you learn something every day.", "Date": "May 20, 2013"}, {"Title": "Unimpressed.", "Author": "michael d collier", "ReviewID": "R3VI9K2UGMN716", "Overall": "2.0", "Content": "First of all, the build quality is disappointing. The plastic construction feels cheap. But, that's not what I bought it. Was itching to tinker with the WiFi features. The interface is awkward and not at all intuitive. Finally, as noted in other reviews, low light pictures are of poor quality.I think you'd be much better off to buy a Canon with an Eye-Fi card. Much more flexible and much better pictures.", "Date": "April 25, 2013"}, {"Title": "Could have been better...", "Author": "Justin Vickers", "ReviewID": "R1EK64IVEOUX4Z", "Overall": "3.0", "Content": "The camera had great features but the picture quality is not that great compared to other cameras that I've had.", "Date": "April 24, 2013"}, {"Title": "IN LOVE!", "Author": "evo4", "ReviewID": "R3BVK1IIVJZ1TN", "Overall": "5.0", "Content": "I'm soooo in love with this camera!!! Awesome point and shoot camera with many easy to use feature. The wifi is wonderful. The battery life is also AWESOME!! Shutter speed is very fast.I have brought several point and shot camera in the last year since my other camera died and have returned them all.Very very very very happy customer!!!", "Date": "April 14, 2013"}, {"Title": "do not buy", "Author": "yuval cohen", "ReviewID": "R3HENEL3FU2UBX", "Overall": "1.0", "Content": "it is heavy, thick and inefficient. the telescope was not going out for few times and the are knocking noises from it", "Date": "March 29, 2013"}, {"Title": "Amazing power in a small camera", "Author": "Angel Lee", "ReviewID": "RO6THJ6O9N3D4", "Overall": "5.0", "Content": "This camera is wonderful.  I paid just over $100 for it and am completely impressed with not only the features and options but the fabulous photo quality.  Even at maximum zoom the photos are clear and stunning.  I love the option of wi-fi so I can upload immediately to Facebook or Picasa or Photobucket, etc.  I highly recommend this camera.  I'm going to see if there's a way for me to post photos I've taken!!", "Date": "March 28, 2013"}, {"Title": "Great for the price", "Author": "TjP", "ReviewID": "RKIW1RSPHEOM8", "Overall": "4.0", "Content": "I bought this camera for a picky 13-year-old amateur photographer. He's been using it since Christmas and playing with all the different settings and pronounced it \"awesome.\" In addition, the wi-fi transfer is extremely handy.", "Date": "January 14, 2013"}, {"Title": "okay", "Author": "Jamiev", "ReviewID": "R1MITY2HK7JRFN", "Overall": "3.0", "Content": "Beautiful camera and good for sending pics to your phone. Not sure about the quality of the picture though. I don't know why mine is so blurry. I mean if it was taken when place on a solid ground, the picture will turns out just fine. Yet when I hold the camera and took a picture, it turned out quite blurry. I don't think my hand is shaky too, I had no problem using other camera. Did I get a faulty one? Maybe.", "Date": "January 4, 2013"}, {"Title": "Love the WIFI and the Apps", "Author": "piamomia", "ReviewID": "R28OHUNVD1JOY1", "Overall": "5.0", "Content": "I love Samsung products, so when it was time for me to get and upgrade a camera I'm so glad I bumped into this. The previous comments on here really helped me a lot to purchase this product and I'm totally happy with the purchase. Just the price alone is unbeatable and w/ 14MP and 18x Optical Zoom, this is exactly what I need for my travels next year! The WIFI will help tremendously, my photos will automatically sync to my PC so I can delete files on the SD Card on the go if needed to create more memory :)", "Date": "December 2, 2012"}, {"Title": "Poor, unclear images.", "Author": "Beccabell11", "ReviewID": "R16VC9UB9CG01Q", "Overall": "1.0", "Content": "I honestly thought i would love this camera. It takes terrible low light images, and EVERY shot no matter the setting is not crisp. I returned it within 3 days and after 321 crappy images.", "Date": "September 12, 2012"}, {"Title": "Image quality leaves much to be desired", "Author": "Alex", "ReviewID": "R1DHA3N3XCCXL7", "Overall": "2.0", "Content": "Image quality leaves much to be desired. Features and specs look good on paper, but in reality this is a nice toy to play around, but not to preserve your memories.", "Date": "October 1, 2012"}, {"Title": "Cámara completa", "Author": "Dario Javier Zhingri Muesmoran", "ReviewID": "R12ODOIQIUDT7X", "Overall": "5.0", "Content": "Tiene todo lo que deseas tener en una cámara compacta, es super buena, ligera, moderna y la calidad de fotos y vídeos excelente.", "Date": "March 30, 2013"}, {"Title": "Wireless connectivity issues.", "Author": "Amazon Customer", "ReviewID": "R3QEU7B746PCMZ", "Overall": "2.0", "Content": "Although this camera got decent revues, we had nothing but problems trying to connect to wireless networks. I tried two different networks and it never did connect, kept having error messages. i contacted Samsung support but they were baffled. The ONLY reason to get this camera, IMO, is for the wireless capability. Without that there is nothing special about it at all, and you can probably get a better camera for less money.", "Date": "December 26, 2012"}, {"Title": "Smart Camera with connectivity.", "Author": "Robert Laybourn", "ReviewID": "RP3RAKEG8FR7Y", "Overall": "3.0", "Content": "This small camera says it does a lot. It has quite a bit of zoom and it connects with my smartphone and Wi/Fi to my PC. I have taken it out into the field in Wyoming and came back with  good images from my deer, pronghorn and elk hunts. But I have found that although it has Programmed settings for photos of sunsets and sunrises it will not take an acceptably focused image of them. There may be other weaknesses I will discover as I continue to use it. I find that it's not so easy to share those images. The Mobile Link with my Samsung Galaxy is problematic and without that link it's not possible to add the GPS information to the photo. I'm dissatisfied.", "Date": "October 14, 2012"}, {"Title": "I took a shot at it..", "Author": "Nathan Ziegenfuss \"bluemtgrass\"", "ReviewID": "R39C78JV2HBXRL", "Overall": "3.0", "Content": "Its better than most of the reviewers indicate. Takes nice video to boot as well as decent sound. With the discount I paid less than $ 50 over a year ago. Well worth that price.", "Date": "April 2, 2014"}, {"Title": "COULDN'T GET IT TOWORK", "Author": "SPORKY", "ReviewID": "R1EG1EJYBXC6VH", "Overall": "1.0", "Content": "TOO COMPLICATED AND UNWILLING TO SPEND MORE TIME WITH TECHIES TO FIGURE IT OUT, AND THIS DOESN'T HELP ANY AT ALL.", "Date": "December 26, 2013"}, {"Title": "Would have been 5 stars if . . . . .", "Author": "J. Carullo \"JohnC\"", "ReviewID": "R31QHZE0W8YI2A", "Overall": "4.0", "Content": "The Wi-Fi backup to a PC was a problem. We had two cameras identifying with different PCs in the office. Wi-Fi backup using camera \"B\" activated the software installed on camera \"A\". So, it was back to wires for offloading pictures.Other than that the camera is excellent with outstanding picture quality and ease of use. Had the Wi-Fi worked as described, this would have been 5 stars.", "Date": "December 11, 2013"}, {"Title": "love it", "Author": "Kela", "ReviewID": "R4ABOQ792RMYZ", "Overall": "5.0", "Content": "I love this camera I love the smart button that chooses which scene for you so you don't have to pick low light and bright I also like the airless feature that lets you load to your phone or tablet this is my first camera and years I love that it have a speaker on it for when you play back videos. There also is a neat application that lets you remote in with your phone I set the camera up on my coworkers desk and took a picture of her scarfing down some doritos very funny for me I have been using that a lot to take picutres with my kids with asking someone to hold the camera", "Date": "October 21, 2013"}, {"Title": "If I can take great pics with this, anyone can", "Author": "krys4kismet", "ReviewID": "R9I4PGSHC4U6M", "Overall": "5.0", "Content": "I love this camera,  Its very user friendly.  The colors are bright and crisp.  People have asked me about the camera because the pictures look so good.", "Date": "July 2, 2013"}, {"Title": "Samsung Camera", "Author": "A. Mourier \"Mamzelle\"", "ReviewID": "R3L4IST62BH3L0", "Overall": "5.0", "Content": "This is a great lightweight digital camera. The pictures are crisp and clean and the functions of the camera are great. Quite a value for the money.", "Date": "June 11, 2013"}, {"Title": "Excellent Camera", "Author": "Scott Shippy", "ReviewID": "R19V54RDH5DVTJ", "Overall": "5.0", "Content": "Simple and easy to use. Takes excellent pic. Very happy with it. Just wish it has touch screen for entering info when uploading pics to facebook etc.", "Date": "May 23, 2013"}, {"Title": "comentario", "Author": "elizabeth colina", "ReviewID": "R3GSMSEC5AE5EU", "Overall": "5.0", "Content": "excellent, the whole process sure recommend it. The order was carried out on time is 100% safe and very good article", "Date": "May 23, 2013"}, {"Title": "samsung WB150F", "Author": "María Cecilia siutto", "ReviewID": "R20WWA30HJSW45", "Overall": "4.0", "Content": "Very satisfied with the machine. It has been used quite hasdta now without errors. Time will be the best judge", "Date": "May 11, 2013"}, {"Title": "Samsung WB150F", "Author": "Edward R.", "ReviewID": "R1L68QEGVEENWS", "Overall": "5.0", "Content": "At first I felt like returning the camera, because the sharpness of the pics was very disappointing. But, after an afternoon of taking different style pics, with various modes, found out what works best. (For sharper photos, it does make a diff, if you set the wheel on \"P\" program, and look in the menu for \"image adjust\", you will then be able to adjust the saturation/sharpness/contrast.)Once you figure out all the functions, it's a great camera.Also, It's not always easy to find a camera that works well with low light, this one is the exception. The flash is set on \"off\" because it does so well without the flash.We haven't taken much videos, but so far, we're pleased.  The image. the focus and sound, are good,The size is very practical, it's well built, and the wi-fi option is a nice bonus. We do recommend.", "Date": "April 29, 2013"}, {"Title": "My new Samsung Camera", "Author": "Marjorie Ahrenholtz", "ReviewID": "R3BQJVJCK9UJI3", "Overall": "4.0", "Content": "I am very happy with my camera, however the box that it arrived in was in terrible shape.  It was open, but thankfully the camera was still in it.", "Date": "April 21, 2013"}, {"Title": "A dandy little camera", "Author": "Seek", "ReviewID": "R1M5JVKNIV5HHO", "Overall": "5.0", "Content": "I once had a Cannon Power Shot digtal camera which is a good camera, but too much for my old brain to learn. So I gave it to my daughter.I purchased this Samsung WB150 because it is small, I can hide it in my hand and put it into my pocket. It has a little weight to it, i.e. not feather light. The features are the same as an expensive camera, video and many settings to learn, much the same as in the Canon Power Shot. This will serve my purpose in snapping pictures, close-up and some distance. And it will give satisfactory pictures, just as good as the Cannon I had. The User Manual is on the CD that comes with it. The price is right for all that can be done with this little jewel.", "Date": "April 20, 2013"}, {"Title": "Good Product", "Author": "A. David", "ReviewID": "R1Y7V6YSZCPGMD", "Overall": "4.0", "Content": "Works great and has great features. Had a problem with Wi-Fi at a McDonald's but normally works fine. This a great starter camera.", "Date": "April 17, 2013"}, {"Title": "Great camera", "Author": "A.R.", "ReviewID": "R2HZI0P4PW8GU5", "Overall": "5.0", "Content": "I am very happy with this camera. For it's price range it is nice. I would recommend it to the average buyer.", "Date": "March 31, 2013"}, {"Title": "Good Point & Shoot", "Author": "Bob", "ReviewID": "R2AUP7DYDAHTBL", "Overall": "3.0", "Content": "Good POINT AND SHOOT camera, but did not have the quality that I needed.  Gave it away as a gift to my grandson who it having a great time with it.", "Date": "March 28, 2013"}, {"Title": "excelente producto", "Author": "luis eduardo martinez arias", "ReviewID": "RKLSQZ0G5IJQ7", "Overall": "5.0", "Content": "excelente el wifi funciona maravillosamente tomas tus fotos y sube-las a la red de inmediato se lo recomiendo la entrega no tube ningun incoveniente", "Date": "March 18, 2013"}, {"Title": "Amazing!!!", "Author": "Amy Enid", "ReviewID": "R26WCLN4NBJLTK", "Overall": "5.0", "Content": "I live surrounded by mountains, so I was goofing around when my camera arrived and went outside to test the zoom, and honestly, I've found houses I had never seen before in my life!!! Such a pretty camera, haven't test the wifi yet (I don't have that kind of internet where my house is) and is so tiny. I mean compared with my brothers camera (a big Cannon  camera of \"God knows it's zoom range is, 'cause I don't remember\" but I'm pretty sure is 20x ) is so easy to carry... Would defenitely recomend.", "Date": "March 11, 2013"}, {"Title": "Camera", "Author": "Marta", "ReviewID": "R2SCM9CKDZJWXP", "Overall": "5.0", "Content": "Awesome camera.  Just love it. I love the artistic shots and the zoom quality.  Another great thing is the wifi.", "Date": "March 2, 2013"}, {"Title": "Picture quality.", "Author": "Robert Haley", "ReviewID": "R2FSTP97WF9WCK", "Overall": "2.0", "Content": "I wish I would have done more research on cameras.. I thought the smart camera would be fun but we don't use that feature at all on the camera.. and the picture quality for us and the shutter speed is lacking on this camera. If you are buying this camera for action shots or children that are on the move don't buy this camera.", "Date": "March 1, 2013"}, {"Title": "Samsung Camera", "Author": "Linda R. Allaire", "ReviewID": "R362Y9UFWEWFAM", "Overall": "5.0", "Content": "Bought this camera for my granddaughter who is 9...she just loves it so much I think I will have to get one just like it for me.", "Date": "February 18, 2013"}, {"Title": "GREAT Camera!", "Author": "Lauren Pogorel", "ReviewID": "R3Q22H33OTZ5PU", "Overall": "5.0", "Content": "I love this camera! It takes really nice pictures and you are able to upload them right to your favorite social network site! There are also a lot of options on the camera for changing the colors and the scenes!! Great purchase.", "Date": "January 28, 2013"}, {"Title": "Takes good pictures, poor functionality* Update: After firmware update, much better!", "Author": "Ohio", "ReviewID": "R2TN7CJ7YBOGRY", "Overall": "4.0", "Content": "I bought this camera specifically for the wireless features.  I wanted to cut the cord and be able to wirelessly upload images to my PC/iPad/laptop/iPhone/Facebook/Skydrive.  I ALWAYS get an error and. I am very tech-savy, I know how to troubleshoot.  I am very disappointed with Samsung for releasing such a crap product.The camera takes good pictures, I will give it that.  But I could have bought a camera that takes equivalent pictures for 1/2 the price.  I paid extra for the wireless functionality.I bought the camera and took it to Italy with me.  My wife discarded the box while I was away.  Had she not, I would have returned this.EDIT:  I installed the firmware update and all of the non working features now work.", "Date": "January 25, 2013"}, {"Title": "Good overall camera with some drawbacks", "Author": "Jeffrey J. Story \"bikerider\"", "ReviewID": "R1CZ7IL4QO37Z3", "Overall": "3.0", "Content": "The 18-inch optical zoom is a plus for taking both photos and videos, especially under daylight conditions.  Photo quality is very good in daylight.  But in low-light conditions, the video is grainy and the flash is slow to recharge.  Also, the range of the flash is very limited.A nice feature is the shutter speed/ aperture priority function when you want to turn off the program mode.For a small camera, it takes very good photos and video in daylight conditions and I can recommend the camera for daylight use.", "Date": "December 28, 2012"}, {"Title": "After a few uses, it does not connect to Facebook and Samsung did not respond my inquiry about it", "Author": "Adalberto Rodriguez", "ReviewID": "R3K6GSYWFFI9MF", "Overall": "3.0", "Content": "This camera is really good, I am happy with my purchase, but after a few uses, it does not connect to Facebook to post my pictures wirelessly.  It all started after I installed the camera software in my computer.  I sent the question to Samsung last week and they still have not come back to me with a solution to the problem, it is a pity since the camera is nice, picture resolution is acceptable for the price I paid and the wireless feature saves you time.  So I am not changing the qualification until Samsung gives proper feedback.", "Date": "December 17, 2012"}, {"Title": "An excellent camera features BUT...", "Author": "Amazon Customer \"gatorlandkali\"", "ReviewID": "R2F5D0F17E89GH", "Overall": "4.0", "Content": "I was looking for a point & shoot camera that is inexpensive and I found this. I'm about to put up a 5-star on the product but one thing that catches my attention while using. When the camera is in idle [power on], I hear clicks inside. I tried to listen closely because it might be the motor lens moving but I'm surprised because the unit is actually making sounds while in an idle stage. Sometimes there are few units that got out from the crack with minor problems and I guess this is one of them. I don't have problems with photos, the features, the zooms, the settings, the wifi and other neat features when taking photos because those are an excellent stuff but when a camera starts making sounds, that's an indication the camera will not last long. If you have no issues with the sound clicks, then this is the unit you can muster, carry, use and an extra weapon for your photography hobby.", "Date": "December 5, 2012"}, {"Title": "Decent for certain situations.", "Author": "C. Daniels", "ReviewID": "R238L9DP2PAU9O", "Overall": "3.0", "Content": "Over all this camera has some great features although I think the features took precident over sharp image quality. That is not to say it doesn't take razor sharp images in many cases but unless the light is right your odds of capturing that legendary image are not good. I have played around with the various modes and find I am happier with the results on the less automatic settings where some variables are manual. The \"smart auto\" is really useless in all but perfect conditions. Over all. I would be reluctant to buy a samsung camera again. I would definately not buy this model unless it was below $100. For around $89 it would get another star but for $135 it is a three star camera in ideal conditions.", "Date": "December 1, 2012"}, {"Title": "Great camera but................", "Author": "H. Thomas \"MzPrttyBrwnEyez \"I love to cre...", "ReviewID": "R1GZ5TNA2CO9XH", "Overall": "4.0", "Content": "HORRIBLE battery life. I don't know if I'm doing something wrong or what but no battery should die without the item being on!!!  Not understanding that one bit.  I do love the photos and especially the 18x optical zoom.  Other than the battery, I LOVE this camera!", "Date": "October 11, 2012"}, {"Title": "Broke after only 1 week...", "Author": "JP", "ReviewID": "R2YPTVV5P1JHZR", "Overall": "1.0", "Content": "It was great when I first got it, but I only got to use it for a little over a week.. I took my camera home for winter break and I realized the screen was black, but I thought it was because maybe it was low on battery but the screen was still black. I looked up somewhere to take out the memory card and fully charge it to see if maybe something was wrong with the memory card, but after charging it didn't turn on AT ALL!!! I kept trying to turn it on but it wouldn't and because I'm on winter break for 3 weeks I couldn't send it back so I just completely wasted my money... -____-", "Date": "December 29, 2012"}, {"Title": "Pathetic picture quality", "Author": "Grant101", "ReviewID": "R3VSIM7BL0V0FO", "Overall": "1.0", "Content": "Was excited as it promised good zoom, the zoom is good, but quality of pictures is worse than my old Canon A510 which is 8 years old, and especially when is relatively poor lighting conditions - had it back at Samsung for a check up in the hope of solving the issues, but am totally disappointed.", "Date": "December 10, 2012"}, {"Title": "Great", "Author": "Cheryl Henry", "ReviewID": "RQC1M0XK6QESU", "Overall": "5.0", "Content": "Camera does everything that I wanted (besides basic good camera function (zoom, quality, etc), I was interested in a camera withWiFi, for a very reasonable price.Discovered added benefits after I received the camera - pretty cool editing, filters, etc.I used to be a pretty big camera buff but haven't been much interested in recent years - it's possible that this camera will renew my interest.Love the camera.", "Date": "March 31, 2013"}, {"Title": "Don't think I got what I ordered", "Author": "DGR", "ReviewID": "R2L308LYP9ALHW", "Overall": "3.0", "Content": "I do not believe the product was new, as the seal on the box had been broken, the battery was unwrapped and the viewer appeared to have small scratches.  Thought I was buying new!", "Date": "March 7, 2013"}, {"Title": "Good Photos but Flawed Wifi", "Author": "M. Staley \"Max\"", "ReviewID": "R64DKJA6M625O", "Overall": "2.0", "Content": "Had this camera since the 19th of Nov 2012. Not had a great time with it so far! One of the main reasons for buying this camera was the Wi-Fi functions, especially the SkyDrive upload option. On taking it out of the box I took a range of test photos and set about trying out this feature. I put in my SkyDrive account details and connected to my home Wi-Fi, but when I hit submit on the SkyDrive account details i got the message \"error: document to large\". I tried a few times, no change. So went to Samsung's site and found there was a firmware update for it. I followed the instructions and 10mins later I had a bricked, unusable camera.To Samsung's credit they sent through a return box pretty quickly and got the camera back to me in about 7 working days (sadly I think it was a refurb, so probably older than the new one i had bought). I tried all of the above again, still couldn't log in to SkyDrive, so crossed my fingers and did the firmware update. This time it worked and so tried SkyDrive yet again! Still the same error message.So to conclude, although the camera takes good photos and the zoom, although slow, is very good. The extra features that persuaded me to buy this over other cameras of a similar price just do not work as advertised. (actually the Facebook upload does look to work, but i don't use this for backup of photos)I am current again in contact with Samsung to try and get support with this feature, I would be interested to hear if anyone else has had the same issue.", "Date": "December 5, 2012"}, {"Title": "Wi Fi PC Auto Backup difficult to use", "Author": "Shari Bond", "ReviewID": "RG037CJP6J6NG", "Overall": "4.0", "Content": "Great camera, great features, but more power to you if you can get the PC Auto Backup WiFi feature to work. Also viewing pix via TV Link is painfully slow when advancing the pix. Your better off just using the USB cable. The social sharing option was fairly easy, have not yet tried to email, but I heard that was easy.Also some pix using the Smart setting come out blurry, not sure why.Love the size of this camera, not so tiny like so many are now but not so large that it is too heavy or cumbersome.Love the different scene settings, the video button, the fun frames and such. Pix and vids come out very nice. Definately recommend this camera but don't buy it just because of the WiFi feature. Unless improved this is just a gimmick so far.", "Date": "July 2, 2012"}, {"Title": "DO NOT BUY...Waste of time...", "Author": "Robert M. Macala \"Eclectic\"", "ReviewID": "R25V29HZ0OUKHV", "Overall": "1.0", "Content": "Got the camera as a Christmas present, loved the surprise gift...Great picture taking camera with quick connections at  Starbucks for both email and FB, but the well, other wifi places, not so much luck.... I will keep trying. I just had it for one day...So I'm still working out the kinks...will update later this week...First day grade...3 Stars...Next day update...after trying three times this morning to load image to send...lost connection at Starbucks....3 times...Why Samsung would put this on the market is a mystery...There are just too many bugs and the internet sharing ideas are just too cumbersome....this is the 21st Century...not 1990...when the computer world was relatively young....DO NOT BUY THIS CAMERA...lots of time wasted...", "Date": "December 26, 2012"}, {"Title": "Probably the worst camera I have owned, including super cheap ones", "Author": "Kristopher Petersen", "ReviewID": "R1CN1GDBGB78AI", "Overall": "1.0", "Content": "I bought this camera after having owned a very good Samsung camera a couple years before. That camera took very consistently high-quality pictures and was otherwise very consistent. Unfortunately, it was stolen... The camera after that for me was extremely cheap (I think I paid about $80 for it), and was lost. That one had OK performance at low light, but was completely worthless in nighttime conditions.After that one disappeared, I was in a situation where I was in a developing country that didn't have many options, and the options were all significantly overpriced and not well-reviewed. I'd seen some reviews on this camera that were a little bit troubling, but the vast majority were so incredibly positive that, given a lack of other decent options, I'd give this one a shot.It worked OK at first, but the pictures NEVER were really that clear. Seriously, if I go through a series of these pictures in full screen mode on a laptop screen, not even zoomed in, it will give me a headache if I do so for longer than five minutes. I'm not even talking about full resolution here, just fitting it in the screen. The panorama mode (one thing that was consistently awesome on my previous Samsung) is just flat-out awful - take the fuzziness and multiply it by about 50.I've seen other reviews on here suggesting to use some software to touch up the blurriness of the photos - if you have to do that, it's a terrible camera.Now, I'm a very patient person and don't want to throw away a ton of money (I can't take it back to the store because too much time passed before I realized that it was the camera, and not me, that's the problem), so I have tolerated it for a while. But now is where it crosses the line.... it CONSTANTLY freezes. I looked up on the support website, figuring there'd be some kind of firmware update or something addressing this problem. Nope. Samsung says it's a memory card problem, or that it's defective. The same memory card I've used on this works flawlessly in every single other device I own that has a card slot. And there seem to be a ton of other people out there with the freezing problem, so if mine's defective, it looks like a rather huge proportion of the rest of these are defective. I've found a way to MacGyver its controls to make it work (which takes about two minutes every time I start it up, and therefore is unsustainable for long-term use), but this thing is so awful that the only reason I didn't just smash it on the sidewalk in Quito is because littering is bad.In sum: This thing is garbage; do yourself a favor and get something else.", "Date": "July 3, 2013"}, {"Title": "Good Camera", "Author": "SnC", "ReviewID": "R2V0PQRIKSAVYP", "Overall": "4.0", "Content": "Nice camera. Love the modern look, it's wifi feature, which is a great feature, and when pictures are taken in an optimum setting, they are beautiful. However, at times, the pictures will come out blurry. I will have to take a shot multiple times. I'm not tech savy to change certain settings to get a clear pic, so that becomes annoying.", "Date": "April 20, 2013"}, {"Title": "Lots of features , mobile quality pictures", "Author": "Travis", "ReviewID": "R293BE04OE3U2H", "Overall": "3.0", "Content": "photobucket upload is cool, it takes about 10 secs for the menu to load up thought when switching to that mode.pc backup is cool although it's not automatic, you must trigger it.iphone viewfinder is cool, (not the phone fault but you need to reconnect on you phone to a special camera wifi network)picture quality, this takes cell phone quality pictures. Albiet cellphones take great pictures today.15 minutes of video maxexcellent batterylife and small formfactor.", "Date": "March 3, 2013"}, {"Title": "QUIT WORKING AFTER ONLY A FEW DAYS AND SELLER DIDN'T STAND BEHIND IT!!!", "Author": "Robert Novak", "ReviewID": "R15HRWCYGYTHKQ", "Overall": "1.0", "Content": "I TOOK THIS ON VACATION, TOOK A HANDFUL OF PHOTOS AND THE SHUTTER QUIT OPENING. SELLER SENT ME A RETURN LABEL; I RETURNED IT; BUT NO CREDIT WAS MADE TO MY ACCOUNT. FOLLOWED UP AGAIN WITH SELLER AND THEY SAID THEY DIDN'T TAKE RETURNS AFTER 30 DAYS. THEY DID NOT SEND ME THE CAMERA BACK...SO I COULD AT LEAST GET IT FIXED. THEY JUST TOOK MY MONEY AND KEPT THE CAMERA - WHICH WAS THE WORST CAMERA I HAVE EVER OWNED. I DONT' THINK I EVEN WENT THROUGH THREE BATTERY CYCLES.", "Date": "May 28, 2013"}, {"Title": "I'm still shopping & have a question rather than a review. Please help.", "Author": "Shoppingthemarket", "ReviewID": "R2CE8VUBVFFXLC", "Overall": "4.0", "Content": "I am currently shopping the market for a point & shoot digital camera to replace my Samsung L200 that recently ate dirt. Literally. It was dropped from short distance onto the beach and now the shutter will not open or close. It tries. But can't do it. Anyway, its time for a new one. I really like a lot of the reviews & features of this Samsung camera. One of my greatest concerns is the quality of indoor photos. With a 21 month old, a majority of my pictures are taken inside. My husband has a Kodak and it takes beautiful outside pictures but HORRIBLE inside photos - no matter what he does with the settings. Anyway, can anyone & everyone provide me with some feedback as to the quality of your indoor photos?? Thank you so much!", "Date": "June 3, 2013"}, {"Title": "If I could only upload the photos to my computer", "Author": "Nancy Kamm", "ReviewID": "RNNAFVWTXE7NX", "Overall": "1.0", "Content": "I bought this camera so I could EASILY upload photos to my computer and Facebook.  I used it over the Thanksgiving holidays and it worked great.  Then I came home and the cable that came with the camera didn't fit the camera, so I purchased another cable specifically for this camera, received it today and SURPRISE it doesn't fit the camera either.  So I tried to upload the photos through the WIFI option and haven't been able to get that to work either.  I'm paying a techie to come to see if he can figure this out.  I'm very frustrated with this camera.  I've only had it a month; but am about ready to trade it back to Amazon for something else that works.  My advice - don't bother.", "Date": "December 19, 2012"}, {"Title": "Seemed Good but I'm Returning due to Lousy Customer Service", "Author": "Amazon Customer", "ReviewID": "R3QZ9V79TBBX90", "Overall": "1.0", "Content": "The camera seemed decent, but I've had bad experiences lately with Samsung removing important features from their products during updates leaving the products no longer usable for many purposes.  When I tried to contact Samsung to ask for help to solve the problems caused by the updates, I kept getting the run around by being directed to department after department where people said they \"didn't deal with questions related to product updates\".  Anyway, I'm returning the camera, because I can't afford to have a camera become unusable at some point and not have any customer service that is willing to help.", "Date": "September 20, 2013"}, {"Title": "Had To Return", "Author": "HuntersPad", "ReviewID": "R2REUTQC9A1YT4", "Overall": "1.0", "Content": "Had to return it. Worse Quality Than my Galaxy Note II 8mp camera even the video was not that great pictures turned out worse than a OLD android phone I have laying around", "Date": "October 26, 2012"}, {"Title": "This camera DOES NOT HAVE A TOUCH SCREEN..!!!", "Author": "roaeja \"Hey you!\"", "ReviewID": "R2OU3H9BD23JIL", "Overall": "3.0", "Content": "I read the reviews and saw mention of a touch screen!  Thisperson must have been smoking bad weed or something.IT DOES NOT HAVE A TOUCH SCREEN!!  PERIOD!!I took his word, only to find out later it doesn't have one.  Da on me.Display Type 3.0-inch 460K dots TFT LCDThe Allshare Play on my Samsung UN55ES8000 tv now.  Have no clue why it refused to play before?  Strange.  This camera is loaded with more features, than you will ever use.If you are having trouble getting Allshare Play going on your Samsungtv, try reconfiguring your wireless router.  First hook up a DSL cablefrom your computer to the router.  In your browser, type in 192.168.1.1and passwords for router.  Usually Admin, Admin.  The go to wirelessconfiguration.  Set to 'Mixed' and auto for bottom three. I had mine set for 20mhz narrow band, Auto sets it what thedevice need, like 40mhz broadband.  It gives you a more stablewifi path for things to talk to each other on. If you send a picture to your Samsung tv, it will get there if you goto Allshare Play photos and look for camera, but the cameracontinues to send, it won't stop sending! On the earlier version Sh100, it works flawlessly.  You take a picture,select it, go to Allshare, select tv UN55ES8000 and the picture comesup on the screen, the whole screen.  You don't even have to screwaround, going to Allshae!  It's there, front and center. But, with his camera, you have to hunt and peck, and it won't time out.More feature, but a greater pain in the butt to use. I would recommend sticking or buying the Samsung EC-SH100 Wi-FiDigital Camera with 14 MP, 5x Optical Zoom and Touchscreen. it ishalt the weight, half the price and far easier to use and it WORKS!If Samsung made this like the SH-100 with a touch screen; etc, they wouldhave another hit on their hand's.  But, they went click, click, click...", "Date": "April 19, 2012"}, {"Title": "Too Big", "Author": "Rob \"rob4341\"", "ReviewID": "R3O4TZPQQRS3EJ", "Overall": "2.0", "Content": "The camera is just to big for the type.  I should I opted for less optical zoom which would have resulted in a smaller camera.", "Date": "May 6, 2013"}, {"Title": "just got it, it's so cool and takes super sharp pictures...the camera of the future. I love it !!!!", "Author": "Lawrence Scruggs", "ReviewID": "R1ASYYH015YFJH", "Overall": "5.0", "Content": "this camera is fantastic does so so many wonderful lovely things. Great pictures fun to play around with. I just need a pouch to carry it..", "Date": "February 17, 2012"}, {"Title": "Unreliable Product", "Author": "CS", "ReviewID": "R1B9M0ECZ3CJCQ", "Overall": "1.0", "Content": "I purchased this camera twice.1)When I uploaded the pics from use #1 to Facebook they had lines through the faces, terrible quality. Returned it.2)Camera just stopped working and now I have to go through the manufacturer.Do not purchase, it promises a lot but is a waste of time.", "Date": "May 16, 2012"}, {"Title": "Wi-Fi is a joke", "Author": "Alyssa A Clements", "ReviewID": "R2A99YIIJRIXCB", "Overall": "1.0", "Content": "I bought this camera for the specific purpose of connecting it seamlessly with my iPhone app, that I actually downloaded before the camera even came in. One, the Samsung Viewfinder app does not work from the WB150F to my iPhone, at all, period. The Samsung MobileLink app worked a whopping total of one time. So disappointed. Also, you cannot upload to your Mac without a wire. In essence, unless I want to slowly upload a picture to facebook, the wi-fi feature is absolutely useless. Thanks Samsung! Will be returning if no one can get the apps to work within a week or two.", "Date": "May 16, 2012"}, {"Title": "Do not buy and do not use-Worst camera ever", "Author": "unhappy person", "ReviewID": "R2XULUPN6535M2", "Overall": "1.0", "Content": "I have given one star because ther isn't an option for 0. I don't want people to listen to those reviews about this camera being good and I don't want people to fall for them and waste their money. Ignore them reviews because they're false and incorrect. It is not a good camera and takes the worst pictures ever. I unfortunately fell for buying this camera looking to upgrade from my 6 megapixel, thinking I could take SLR type pictures, well I was wrong. The image quality is so mediocre and not very good at all. Don't think the WIFI is any good either. Just a rubbish camera. DO NOT FALL FOR THE FAKE REVIEWS. DO NOT BUY THIS CAMERA AND I ADVISE YOU THE IMAGE QUALITY IS THAT OF A NOKIA PHONE CAMERA", "Date": "March 23, 2013"}, {"Title": "What a joke", "Author": "Nestor Rocha", "ReviewID": "RHEOJDX8WIEK2", "Overall": "1.0", "Content": "The camera speaks of all kinds of great things it can do but they say nothing of the fact that It does not have wireless compatibility with Iphone, With Iphone - the most popular Smart phone out there!!.  Is only when you bought it and it doesn't work that you realize you've been stiffed.  The techs don't seem to know much so they are no help at all.  Also the software that comes with the camera is also not working with my PC which runs on Windows 7, it crashes even before it has loaded fully.", "Date": "July 9, 2012"}, {"Title": "IT WILL DIE!!", "Author": "I_got_it_at_AMAZON", "ReviewID": "R3VKK3QI4PUVXY", "Overall": "1.0", "Content": "This camera is currently on groupon for 149 bucks with free shipping. (Source: [...]). So, as usual I decided to get a feel of it at nearby stores. I went to about three stores that had the camera on sale for 159 dollars. I asked the sales rep to turn the camera on for me so I could try it out. All three stores had the camera on display and were broken to the point that it just wouldn't start up at all. Is that a coincidence or is that a pattern that shows how unreliable these cameras are. I would not buy it! I would not recommend it to others! If you like the camera Don't let my review stop you from buying it.  didn't like it and couldn't trust it enough to buy it. So, I am a proud non-owner of this camera!Pro: WIFI, Zoom and if you use android the power adapters are similar and fits inCons: IT WILL DIE!!", "Date": "October 1, 2012"}], "ProductInfo": {"Price": "$229.99", "Features": "18x Optical zoom\nWireless enabled\n14 MP CCD sensor", "Name": "Samsung WB150F Long Zoom Smart Camera - Black (ECWB150FBPBUS)", "ImgURL": "http://ecx.images-amazon.com/images/I/419CxWaObFL._SX300_.jpg", "ProductID": "B00B6Q38M4"}}