{"Reviews": [{"Title": "Olympus XZ 10 or XZ 1?", "Author": "Amazon Customer \"IRC162\"", "ReviewID": "R2IJTTJ770XRM6", "Overall": "4.0", "Content": "I have been a fan of Olympus cameras since the days of the OM 10. I take lots of pictures. While I like a camera that is easy to use, I do like the option of using manual settings. My main camera is an E-620. It takes great shots and is a very intuitive camera---but it weighs a ton. I wanted a camera that gave me manual settings but was something I could carry around. At Christmas, I received the XZ 1. It is just about perfect. It takes wonderful shots and has a low light setting that is not be be believed. I shot a Chirstmas boat parade in the dark---without flash---while being jostled by a crowd. The pictures came out great. The XZ-1 has manual controls and is easy for a non-techie to figure out wihtout needing to spend a lot of time reading the manual. But the drawback to the XZ-1 is that it is still a little to big to fit in a pocket or in a samller size handbag. When I saw the XZ-10, I thought that might work for me. It is a lot lighter and takes great shots. It's easy to use and has manual controls. The touchsreen is great for taking shots on the fly. But it lacks the low light setting and a few more adjustments are needed to make it perform like the XZ-1.If you are mostly shooting outside or with a flash, like taking pics on the fly and need something small, the XZ-10 is the camera for you. But if you can take a little more weight and like more options, go with the XZ-1.Either way, you won't be disappointed. Both cameras take clear, beautiful shots, are easy to use, and are reliable. If you have never used an Olympus camera, you are in for a pleasant surprise. In my opinion, these cameras are and have been underrated.One more thing, in one of the reviews I read (here or somewhere else) a reviewer bemoaned the lack of a manual. There is a pdf version of the manual on the disk that comes with the camera. You don't need to download the software to get the manual and it is easily transferable to your computer.", "Date": "July 11, 2013"}, {"Title": "XZ-10 Review with comparison to similar Canon & Nikon cameras", "Author": "Ken", "ReviewID": "R3KN18F3IDZ4FV", "Overall": "5.0", "Content": "The XZ-10 is a small, pocket sized  'premium' digital camera.  The lens features a 5x optical zoom beginning at true wide angle (26mm equiv) with a very fast maximum aperture(f/1.8- 2.7). As part of this review, I will compare the XZ-10 to the somewhat similar Olympus XZ-1 & XZ-2 as well as competing cameras from Canon & Nikon.XZ-10 Highlights:  Exceptional image quality outdoors (base ISO); Excellent image quality indoors up to ISO 800; Very fast lens at wide angle and still relatively fast at the telephoto end enabling indoor shooting without a flash in decent lighting; very sharp & versatile lens (26-130mm equiv); very small and light; excellent LCD screen; built in lens cap.What the XZ-10 is not: No hot shoe for an external flash; 1/2.3\" (small) sized sensor effectively limiting usable ISO to  800; LCD screen does not move; no viewfinder (or option for one since there is no hot shoe); relatively short battery life; weak flash; pricey.Overall, the XZ-10 is a really small camera that takes terrific photographs in most situations.  The image sharpness, color reproduction, automatic white balance, auto-focus and metering, are really, really good especially for such a small camera.Compared to the XZ-1 & XZ-2; the XZ-10 is smaller and lighter especially when compared to the XZ-2.  The lens on the XZ-10 is wider and longer with similar bright maximum apertures.  I personally prefer the color reproduction and exposure of the XZ-10 to the XZ-1 or XZ-2 when not using an external (bounce) flash (The XZ-1 & 2 each have a hot shoe for an external flash or view finder).  The XZ1 has no grip; The XZ2 has a grip; The XZ-10 has a very small grip.  The XZ-1 & XZ-2 have slightly larger sensors than the XZ-10 but I did not see any real ISO advantage of this slightly larger sensor.  The XZ-10 is a little cheaper than the XZ-2 but more expensive than the XZ-1 (which is really priced as an excellent value).  The difference in size between the XZ-2 and the XZ-10 is quite obvious making the XZ-10 considerably more 'pocketable'.  The built in lens cap of the XZ-10 is a convenience over the XZ-1 & 2.Compared to the Nikon P300 & the Canon S100; these three cameras are more similar than they are different.  They are all very small but the Canon is the smallest, the Nikon very slightly bigger & the Olympus slightly bigger than the Nikon.  All three take excellent (and surprisingly similarly rendered) photographs; I prefer the Olympus first, the Canon close second and the Nikon 3rd.  Again, all three are really similar.  All have relatively weak battery life; no hot shoe; no viewfinder; bright/sharp/non-movable LCD screens; weak flashes; very bright maximum apertures at wide angle; True wide angle (although the Canon & Nikon a bit wider at 24mm equiv). One big advantage the Olympus has, is a maximum aperture of F/2.8 at 130mm (equiv).  This is MUCH brighter than the Canon or Nikon. The Nikon (subjectively anyway) appears to be a little slower focusing and performing generally than the other 2. The Nikon also is the least expensive and perhaps the best value.", "Date": "July 30, 2013"}, {"Title": "Somewhere between a Point & Shoot and a full DSLR", "Author": "R. J. Schmidt", "ReviewID": "RH5ARM6P5N5YJ", "Overall": "4.0", "Content": "Unlike the other 2 reviews I actually do own this camera.  I was frustrated by the terrible low light quality of my phone but I cant always be lugging my Canon DSLR and 2 extra lenses to concerts or nights out. I did some research and found this camera.  I took it to a concert this week and WOW, great performance, battery didnt even drain 1 tick, and I was really happy with what came out.  I took some pictures the same night in the same places with my phone and the quality was night and day.The only reason I gave it a 4/5 is that I threw away the camera manual and there isnt a PDF version on the Olympus website. Without it I cant figure out what all of the modes exactly mean and I feel like I am missing some features.I dont really care about the Pop Art modes or anything like that but I do like that the camera mode is just a button on the back, so no matter what mode you are in you can quickly switch to movie mode and take a full HD video.", "Date": "May 11, 2013"}, {"Title": "Clumsy User Interface, but Great Photos", "Author": "Kerton", "ReviewID": "R1XSVIOUI6F3IH", "Overall": "4.0", "Content": "** See the end of this review for updates, after owning the camera for a year.**I think I'm going to return this camera because it simply doesn't offer value at the price I paid, $400. Consumer Reports rated this one tops in 2013, so I decided to get it over other well-rated cameras for less than half the price. Money was no object.Let me start by saying, YES, the pictures are great. Bright, brilliant colors, and focus is sharp and fast enough. The low f-stop captures good light in dark conditions, video is good and is easy to start with a dedicated button.If you want just ONE camera to give you some of the benefits of a D-SLR and some of the benefits of a compact, this camera might be a decent compromise, as long as you are willing to spend a fair amount of time learning to use it.As for me, I have been disappointed in the two weeks I've used the camera by the difficulty in using it. Here's why:- Slow, slow, slow. Consumer Reports said that it was fast, but mine just isn't. Push the power button, and the lens moves out immediately. But the LCD doesn't light up, and no photo can be taken for 5 seconds. Between shots it is fast enough.*update: This slowness seems to be related to my use of an EyeFi memory/WiFi card. Using regular memory, the camera is plenty fast.- Flash is a pop-up. I don't like that in a compact camera. And it became clear every time the flash popped up and hit my hand. Turns out that is where I hold a compact camera. I prefer cameras that have the flash in the fascia. Fewer moving parts, and easier to use.- User Interface is a mess. There are menus upon menus, other menus, dials, buttons. The touch screen seems to be an afterthought - it can control some functions, but not others. There is a dial around the lens, but it's role changes, so I can never remember what it does. The dial around the back \"OK\" button is also rotatable. Often these two dials do the same thing as each other, often they do different things, depending on where you are in the menus or settings. This makes it rather impossible to memorize and learn. I read the manual once, but you'd need to use the camera daily and read the manual as you go to become an expert on this camera. This is more complexity than my Nikon D-SLR.- Battery life is short. I already bought two more batteries to fix this. But this problem is made worse by the slow boot-up time. Because I have to wait so long to boot up, and I don't want to miss a good picture, I tend to leave the camera on in between shots so that I can be ready. This means that the LCD continues to use power, and kills my batteries faster (screens are the biggest power hog on smartphones and cameras).- USB charge: there is no battery charger, but rather you are expected to charge the batteries while in the camera. This involves peeling a rubber dust guard off and plugging the supplied USB cable into the camera. I'd rather have an external charger so I can charge my extra batteries without putting them in the camera. So I bought one.- Non-standard USB plug: so to charge batteries in the camera, they give you the USB cord, but it is not micro-USB that almost all cellphones use, nor mini-USB which used to be popular, but rather something unique. This means you have to have the right cord handy to charge. That's stupid. If they'd have used micro USB, you could borrow anyone's phone charger.This camera, thus, is not good in the ways that I want a compact camera to perform. I have a D-SLR for complexity, detailed settings, and high quality. I want a compact to be easy, fast, and ever-ready.Sadly, it seems that all of these real-word user experience factors are not the ones tested by Consumer Reports. They do lab tests of photo quality, where this camera excels. They do not put one in their pocket and go on holiday with the family, where this camera is poor.At the price I paid ($400), I expected this camera to be superior. However, I would not be happy with this camera at $150. I enjoy it less than my 5 year old Canon SD1100.________________________________________Update Jan 2014: The pictures from this camera are just so damned good that I had to come back and add another star to my review. I still find the User Interface difficult, and haven't gotten fully used to it, so no 5 stars. But this thing makes beautiful pictures out of what most cameras (and all smartphones) simply can't capture. It focuses so well, and usually on the right target. But the biggest quality is the light capture. It seems to be able to do a great job in bright light, in mixed light (using HDR), but most surprisingly in very little light. This camera will shock you at times when it chooses NOT to use a flash in auto mode, even though you know it is very dark -- but the pics actually turn out well.", "Date": "July 15, 2013"}, {"Title": "what you see is what you get", "Author": "catdaddy", "ReviewID": "R1LSN18HZCYCMZ", "Overall": "3.0", "Content": "i've been using large sensor cameras for many months, so my perception of picture quality is a little skewed by that.This camera is small, convenient and flexible. It does both medium telephoto and macro well. An ILC would take at least two large lenses to accomplish that. UI is very pleasant. Nifty ring around the lens controls the most important function (changes depending on what mode you are in.) Nice positive clicks, too. Press 'ok' and you get the control panel on the screen and this allows changing of secondary functions (metering, wb, iso etc). Touch screen is a nice add-on, particularly for focus points. ND filter built in is a nice bonus.The lens is the strength of this camera. Max aperture fully zoomed out (130mm) is 2.7, and this allows for some creative shots while zoomed (blurred background), and some flexibilty to use lower iso with darker conditions.The sensor is what it is. Meaning it's a tiny 1/2.3 and even with sensor tech advancement, that size is limiting. Anything above iso 400 and noise is obvious. By 1600 the photos are of limited use.Operational speeds and focus speed/accuracy are adequate. i've been shooting raw and the write speeds are non distracting.The camera is actually chunkier than i expected. Not xz2 chunky, but not s100 svelte, either. (The canon s series is the benchmark for pocketable serious compacts). I knew this ahead of time via camera comparison site, but it still caught me by surprise.Most serious photographers have large volume equipment and want something pocketable as well. This is a reasonable choice. I imagine it competes well with canon s series, panasonic lf1, nikon p 3xx series etc. The sensor is small but the lens is awesome. i've owned a canon s100 and was disappointed by the limitations of the lens. Time will tell whether the lens/sensor trade-offs with the olympus will be worth it. I think the  bottom line is one could purchase any of the above mentioned cameras and have very little difference in ultimate photography experience and output. i'd base my ultimate decision on price. At $399 this camera is a rip off. At $199 it's fair. Less than $199 it becomes compelling (olympus site refurb hint hint).", "Date": "March 26, 2014"}, {"Title": "Picture quality is spectacular", "Author": "William Penn", "ReviewID": "RKI630EP28O0I", "Overall": "5.0", "Content": "You can believe all the positive reviews of this camera. It is well built and has almost limitless capabilities. The first time I uploaded pictures on to my 23\" HD computer screen, I couldn't believe the quality of the photos. They almost look like 3D. I love the camera and have no complaints. I have a specific need for a wide angle lens camera with auto and manual settings and limited zoom. It more than satisfies my needs and expectations. I don't want to repeat all the features previously described by others but will offer a few tips. The camera is fairly small and slightly hard to hold and operate by anyone with fat fingers like myself, I found it is much easier to use if you come up with a handle that can be screwed into the tripod hole. I purchased a six inch tripod for five dollars that works perfectly. Some reviewers are complaining about the 89 page owner's manual not being hard copy. Yes, it would be nice if it was, but I found that it not entirely necessary. The CD that comes with the camera will automatically load the manual on your computer with a shortcut for quick and easy access. You will find the greatest need for the manual is simply to learn and memorize where the controls are and how to use them as they sometimes change depending on which shooting mode you are using. After going through the manual a few times, the camera operation is readily understood. If there are subjects that are troublesome,print out the relevant pages. Usually, you will not be using all the modes and features contained within the camera. If you concentrate on the subjects pertaining to your shooting habits, you will easily master the camera. One last point, I had been studying comparable cameras for a year before I took the plunge. I decided on Olympus for two reasons: the recommendations of friends and the low number of negative reviews compared to Cannon,Nikon,Panasonic,and others.", "Date": "April 5, 2014"}, {"Title": "Great little compact camera.", "Author": "D. M. Rogers \"david_rogers11\"", "ReviewID": "RQOJ2CRLQ9UVV", "Overall": "5.0", "Content": "Yes, it has a tiny 1/2.3\" sensor. But it takes great pictures! The size makes it a very discreet little device to slip into a pocket, and you'll get much better shots than with any cell phone camera. You've got a bright lens, so keep the ISO above 1600 and use Noise Filter Low or Off.The camera feels solid in the hand. The included wrist strap is too loose, so buy a replacement to make sure you don't drop the camera.At the current price ($199), this camera is a bargain.", "Date": "March 8, 2014"}, {"Title": "Great camera!!", "Author": "Sharnjean \"Prizestuff\"", "ReviewID": "REKWDQHF8RDCY", "Overall": "5.0", "Content": "I have been looking for a camera for a couple of years and nothing seemed to have everything I was looking for until I found this one.", "Date": "February 10, 2014"}, {"Title": "Compact camera with big camera capabilities", "Author": "Jay", "ReviewID": "R36GNLTYVI817B", "Overall": "5.0", "Content": "I love this small camera with big camera capabilities. It fits in a shirt pocket, and thanks to a fast f1.8 lens has a great low-light capability to capture sharp, good resolution images in dark conditions that I'd swear would require a flash, but doesn't need the fill-in light. The shutter snaps immediately after you push the shutter button, or better yet, has an immediate shutter reaction from the touch screen...I like this option because the camera focuses on the location that you touch on the touch screen, a useful function when you want something in focus that is off to the side of the image frame. This is a well-built, easy-to-use camera that is perfect for travelers who want a small device that has high-class capabilities and offers those who want a small camera to fit in a shirt or suit pocket a great camera to take to meetings or dinner parties to catch the action. For $199 this is an excellent deal for a high-tech digital camera.", "Date": "March 17, 2014"}, {"Title": "Great photos, so many features", "Author": "V. Decarvalho", "ReviewID": "R13NU6XAK4ODR0", "Overall": "5.0", "Content": "Consumer reports rated #1 in category, fully agree, lots of different settings I'll probably need to seriously study so I can fully use this to its capability, bigger than a subcompact its the perfect size to travel with", "Date": "August 12, 2013"}, {"Title": "Olympus XZ for the Young", "Author": "Becky", "ReviewID": "R2C26UP2P2MRR7", "Overall": "3.0", "Content": "This camera turned out to be a little complex for us.  We should have gone for a simple \"point and shoot.\"  This is a point and shoot plus, plus, plus.  We did order a written manual and even that confused us!  We had an older digital Olympus and decided to stay with the brand but technology has passed us by!  It is a mini-computer!  Dislike the constant need to recharge the battery, too.", "Date": "May 21, 2014"}, {"Title": "Wonderful camera", "Author": "Agustin Arguelles", "ReviewID": "R33M1X825KWMAR", "Overall": "5.0", "Content": "It's small but well constructed, and has all of manual or automatic modes you can imagine. Every day I use it I find a new mode or feature. Better thing is bright lens.", "Date": "May 19, 2014"}, {"Title": "Pocket Sized Convenience - DSLR Features and Images", "Author": "Edward", "ReviewID": "R1KXF0032RSJ4P", "Overall": "5.0", "Content": "My criteria for a new camera was simple, it had to fit in my pocket and had to have functions for low light pictures. It also had to have the badge of a camera manufacturer and not an electronics manufacturer. This camera at its regular price is worth the money and purchased as a special it becomes a steal! Battery life is great at and I wish I hadn't purchased two extra batteries, one would be plenty. The aperture priority mode is my tool of choice and low light, creative depth of field photos are a natural for this unit. While shopping I compared it to the Pentax MX-1 and it was not an easy decision to make, especially being an ME Super user as a kid. The aperture ring won me over. The physical size and layout took a dozen pictures to get comfortable with and I thought I would dislike how small the camera is (relative to others I used), but now I have a way to hold it and access all the controls and functions. The Photo Story function is wonderful for inspiration but I find the images lacking in quality. I am hopeful it is a setting I have yet to discover.If you like to take no flash photos in low light, a romantic dinner, a museum or theat6er type setting where lighting often sets the mood, this pocket sized powerhouse will not disappoint you. My initial shots were at the local botanical gardens where I experimented with the aperture ring and aperture priority mode with great results. My own astonishment came later in the week when I took some business associates to the Newark Museum and Ballantine House. Photos are tolerated without a flash at this museum and the XZ-10 captured details in the Rockwell originals as well as the moody Victorian lighting and sculptures of the Ballantine House with such detail, a professional photographer in the group was amazed at the end of the day expressing that \"I wondered why you were taking pictures, I thought all your time was being wasted and images would be nothing but blur\". The dust and depth of field on one shot of a angel riding a crane (sculpture) demonstrated the abilities of this pocket camera. The touch screen and multiple of focus areas along with the touch screen shutter release are awesome features.I would recommend this camera in a heartbeat however, the specs note a metal camera body, mine is not. printing out the pdf manual wasn't so much of a hassle but would have preffered one to be included. This matters but not enough to drop it to four stars.", "Date": "May 12, 2014"}, {"Title": "Great camera", "Author": "Karen  Murphy", "ReviewID": "R2KCZZZDXR5UEM", "Overall": "5.0", "Content": "Great basic camera that also has manual settings as you learn more.  I would read the manual soon after you buy the camera to get the most out of it.  Also Olympus has great on line tips.  I am a basic camera user.  The one extra I would read first is how to use the panoramic feature and practice before you need to use it on a vacation.", "Date": "May 11, 2014"}, {"Title": "More than I expected", "Author": "Dee", "ReviewID": "R1XXB741LWJZJM", "Overall": "5.0", "Content": "My Niece researched and found this camera for me. So glad I bought this GEM! Can not say enough good things about it! Recently put together a video I had recorded with it, and the HD clarity is AWESOME! The shutter is sooooo fast!!! GREAT DEAL!!!!! LOVE LOVE LOVE IT!!!!!!", "Date": "April 27, 2014"}, {"Title": "top quality pictures", "Author": "misja", "ReviewID": "R2T0YJZKM28JX7", "Overall": "4.0", "Content": "this is an excellent camera although a little hard to setup for me.took quite a while to get it to work the way i wanted as there is no owners manual except on line so to find the info for a setting requires down loading the pdf document then finding the page for a setting.i was disappointed that you can't set the camera to date stamp as the picture is being taken.a 32 gb memory card allows this camera to take over 3000 pictures at the highest resolution,more then enough for any vacation.", "Date": "January 30, 2014"}, {"Title": "Does not hold a battery charge", "Author": "Norma J Paulin", "ReviewID": "R2LVBH39JJPVL0", "Overall": "3.0", "Content": "I think I will love the camera because of it's ease of use. Being that I am 79 years old, I needed something that is easy for me to use. I have only had the camera a couple of days. The battery is the problem, it does not hold a charge, it should according the the reviews I read about it. So is the battery old, because of shelf life? Or is the camera draining it too much? I guess I'll have to wait and see. I hate to go through the process of returning it for another one, but still do not want to buy a replacement battery.", "Date": "July 15, 2013"}, {"Title": "OK", "Author": "Frances Ledesma", "ReviewID": "R2WXOJ8TTL2QI6", "Overall": "4.0", "Content": "NO TO GREAT BECAUSE IT WAS TOO SMALL.  BUT THE PICTURES ARE GREAT AND SO WAS THE FEATURS THE CAMERA HAS", "Date": "January 21, 2014"}, {"Title": "Quality not quantity", "Author": "tjp", "ReviewID": "R3UIPCLH4GIS3A", "Overall": "5.0", "Content": "Although I don't own the XZ-10 (yet), I don't want people to be put off by the 3 Star rating by the writer of \"good but no match for xz1\", so I will give it 5 stars. Just to put it back in balance :-DAlthough the XZ-10 has a smaller 1/2.3\" CMOS sensor (better suited for high iso pics) than the XZ-1's 1/1.63\" CCD sensor (keeps better detail), it does have Olympus' newer TruePic VI image processor. The same as in the excellent Olympus OM-D E-M5.The photos I've seen online show impressive results for such a small sensor camera.Furthermore, the XZ-10 and the XZ-1 are in a different price range. The XZ-10's initial $400 is about $100-150 cheaper than the XZ-1 when it came out last year. And maybe the price will drop.Lastly, the XZ-10 is a front shirt pocket camera with a retractable lens, while the XZ-1 (and XZ-2) is not.From what I've read and seen on the web so far about the XZ-10, it seems to be quite a capable little camera.For me it is a serious contender.", "Date": "April 27, 2013"}, {"Title": "good but no match for xz1", "Author": "philip cole", "ReviewID": "R1MVUVSSUNXW9V", "Overall": "3.0", "Content": "I already own the xz1 which is excellent bar the video and low light . I was hoping the  cmos sensor would be a step up despite the smaller sensor size .  but - not to be - Ill keep the xz1", "Date": "April 26, 2013"}], "ProductInfo": {"Price": "$399.99", "Features": "Remarkable image quality\nExtremely bright zoom lens (26-130mm, 35mm equivalent)\n3.0-Inch display has 920,000 dots and is touch-sensitive", "Name": "Olympus  XZ-10 iHS 12MP Digital Camera with 5x Optical Image Stabilized Zoom and 3-Inch LCD (Black)", "ImgURL": "http://ecx.images-amazon.com/images/I/41pyR%2Bz8ooL._SX300_.jpg", "ProductID": "B00BFQ33B6"}}