{"Reviews": [{"Title": "good camera for the price and it DOES NOT leak", "Author": "GetOutside", "ReviewID": "R31GX9MY6UFCT6", "Overall": "4.0", "Content": "got it at Target below listed price;contrary to the 2 current reviews, this camera performed terrific, and it did not leak at all.color saturation is true to what you see underwater.resolution is adequate for bragging and sharing with family and friends.shutter is not as fast as you will want for fish in motion, but you can shoot underwater video which is great, and it captures sound in video mode as well underwater.the zoom is good if you can't dive down 10 feet, loses a little in resolution but that might be from bobbing a bit.the macro function is an added bonus - a very handy setting for documenting the detail of shells or anything else you fancy when you get back to camp.the battery life is adequate for me; two hours in the water and it is still > 50%.if I could get a faster shutter setting for underwater, 5 stars would be awarded for a camera this versatile at this price", "Date": "August 20, 2013"}, {"Title": "LEAKED THE FIRST TIME I USED IT- RUINED MY VACATION!", "Author": "Lost Boys", "ReviewID": "R24GGDV33NZCMG", "Overall": "1.0", "Content": "This camera leaked the very first time I used it and the few photos I managed to take before the lense completely fogged over were of very poor quality. This camera ruined all chances for underwater water photos on my vacation to Mexico, including those of the turtle that swam next to me. BUMMER! A cheap over the counter underwater camera would have worked much better in this case. The battery door actually wiggles slightly back and forwards, indicating a poor door design or at the very least a defective one. I tried letting it dry over night and everything else I could think of including adding a little vaseline to the door seal, but NOTHING worked. It leaked every time! If you still purchase this camera after reading this review, don't take it as your only underwater camera on vacation!! And whatever you do, when buying any underwater camera, buy the extended warranty and makes sure it covers leaks. This is a problem with several of these type cameras, but I was expecting much more from a brand name like PENTAX.Very disappointing. Piece of garbage as far as I'm concerned and it's going right back to the store I bought it from with a very bad review.", "Date": "August 6, 2013"}, {"Title": "It's a cheap camera.", "Author": "Mike B", "ReviewID": "R3LDYMDGDU86H5", "Overall": "1.0", "Content": "I bought this to take on vacation, and expected to get some good shots while snorkeling in the ocean. I had it in the water for 15 seconds before it went dead. I beg you to avoid this camera at all costs, spend a few more dollars and get a better camera from a better manufacturer.", "Date": "April 9, 2014"}, {"Title": "A great little underwater camera!", "Author": "instructor", "ReviewID": "R12CO95U49W4GJ", "Overall": "5.0", "Content": "I had my doubts about this camera ... it just doesn't seem like it can do the job, but I was wrong. It was amazing for its size and price. I brought it to Kauai during rainy season and it was great for hikes in monsoon rains, I took it underwater for fish and tidepool shots. But where it really shined was macro shots with its strobe flash. Great results! Good movies too.However it's not that great on powder days up in the mountains. The battery died within a half hour of shooting while my iphone kept on shooting great shots. I don't consider 10 degrees all that cold.But it shined underwater on the reefs - easy to hold, easy to see and change the settings and options, easy to see what you've already shot. I'm impressed.", "Date": "February 18, 2014"}, {"Title": "No underwater honeymoon pictures for me.", "Author": "S. Cruz", "ReviewID": "R2NTQ7THDHKU4J", "Overall": "1.0", "Content": "I bought this camera to take on our honeymoon to the Bahamas. I didn't have it in the water more than 10 minutes before it stopped working. The screen turned black and it wouldn't turn off. I took the battery out dried it etc and it wouldn't work. I'm so increaday disappointed. I now don't have a working camera besides my cell phone. The sales guy at target is going to get an earful when I get home.", "Date": "September 18, 2013"}, {"Title": "amazing camera", "Author": "JOSHUA GONZALES", "ReviewID": "RC6JRDYTLW4OL", "Overall": "5.0", "Content": "I received this camera as a Christmas present. It is amazing. It takes amazing clear pictures. By far the best camera I have ever owned. I recommend this camera to anyone that goes in the water a lot. I love this camera.", "Date": "December 27, 2013"}, {"Title": "A Good Camera", "Author": "chuckbobuck", "ReviewID": "RYZ23RJ4T3WYE", "Overall": "3.0", "Content": "Overall the camera just seems to fall a little short for me. The pictures aren't very high quality. The video is 720P while the video of the WG-2 is 1080P for only a $10 more. I bought this for the microscope (1 cm macro) mode and find that can I achieve slightly better results with my cheaper Sony WX5 at at 10cm with some cropping (a little more hassle). I probably won't use this camera for underwater, so I can't comment on that, but the camera does have a couple of nice features like the interval timer. It can take individual photos at 10 or more seconds and can create time lapse video at 1+ minute intervals. The camera can do almost anything you can imagine, it just doesn't do it perfectly. I'm taking the WG-10 back and getting the WG-2 instead. It's a great series of cameras especially if you intend to beat it up and subject it to extremes.", "Date": "November 14, 2013"}, {"Title": "Leaked immediately", "Author": "Darren Leaver", "ReviewID": "R2NRYDV6G2UBRE", "Overall": "1.0", "Content": "Bought this for a snorkel trip to Bali. All it took to ruin this camera was to place it in water.  I mean the very instant we hit the water the camera screen was shot and water could be seen between the viewfinder and the camera interior.  Very poor design for keeping water out as the door mechanism for the batteries and SD card still moves after locking down. Stay away from this product at all costs until (and if)they fix the leaking issue.", "Date": "August 19, 2013"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B00B7SHBMY"}}