{"Reviews": [{"Title": "Great camera, fantastic bundle value.", "Author": "Flanigan", "ReviewID": "R29O15FDJ0RMLM", "Overall": "5.0", "Content": "~BUNDLE OVERVIEW~Listed below is exactly what you're getting as of 5/10/2013. I've also provided Amazon links for each item, if available.1) Sony NEX-3NL/B Compact Interchangeable Lens Digital Camera Kit (Black)2) Power2000 ACD-772 Battery for Sony NP-FW503) Zeikos ZE-SG26R  3 Pieces Ultra Clear Deluxe screen protectors4) Xtreme Cable 6 Feet Bulk Micro HDMI Cable,5) Vivitar lens cleaning kit (no product page)6) Zeikos USB 2.0 SD/SDHC/MMC Flash Memory Card Reader ZE-SDR57) Zeikos ZE-FLK40.5- 40.5mm Glass Filter Kit (UV-CPL-FLD)8) Sony 32GB SDHC/SDXC Class 10 UHS-1 R40 Memory Card (SF32UY/TQMN)9) \"Beach Camera\" branded camera bag (no product page)You're getting a lot for your money here, but I don't recommend using the included Zeikos memory card reader (Item #6 above). Some reviews indicate data corruption and lost photos while attempting to transfer files to a PC. I haven't tried it myself, but am not willing to risk it. Plugging in the camera directly via USB works fine.On the other hand, the 32GB Sony-branded SD card, HDMI cable, and padded camera bag are all great inclusions. The Zeikos lens filters aren't the best quality, but still usable. The spare battery also works well with the NEX-3N, despite negative reviews for incompatibility with other Sony cameras. As of this writing, I haven't used the screen protectors or lens cleaning kit.~CAMERA~Being the entry-level product in Sony's NEX lineup, there are some features that the 3N lacks in comparison to the more expensive NEX-5R, 6, and 7. WiFi capability, a touchscreen, accessory hot shoe, and electronic viewfinder are not present on the 3N. These bells and whistles aren't important to me, but it should be noted. With that said, there are three very important things that the 3N has going for it... size, image quality, and price.The inclusion of Sony's SEL1650 PZ lens allows the camera's footprint to be noticeably smaller than what you get with the NEX-5R (which is typically sold with the older SEL1855 lens). It's a joy to carry around all day compared to any DSLR setup, although I wish the camera body grip was more pronounced. There isn't much to hold on to if you have larger hands. The screen can be tilted up and is very useful for self portraits. It doesn't tilt down, but the camera can be held upside-down for overhead shots.With it's APS-C image sensor, photo quality in this little camera is excellent. Images are sharp and low-light performance is great, showing little noise going up to 3200 ISO. Autofocusing isn't as fast as a DSLR, especially in low-light situations, but good nonetheless. The built-in flash also works well and can be angled. HD video capture is also exceptional, but the lens motor is audible during quiet situations when zooming. There are plenty of useful shooting modes, including HDR and panorama functionality.I regard the NEX-3N as one of the best cameras available for under $500. It delivers superior image quality that rivals cameras selling for hundreds of dollars more. It's an excellent step up from a basic point & shoot for novice users, but powerful enough for more experienced users on a budget. The bundle also provides amazing value for the price, despite some mediocre add-ons. All in all, I'm very happy with this purchase.", "Date": "May 17, 2013"}, {"Title": "sony nex kit", "Author": "coad", "ReviewID": "R2NBR1AKKRW6CY", "Overall": "5.0", "Content": "I got this camera because I am too lazy to learn how to operate a camera properly, but want better pics than the average point and shoot.  This camera delivers!!  Awesome little camera.  My only knock as others have said is the slow charge time with a micro usb charger.  I got the plug-in external charger and an extra battery, but haven't needed it.  I have taken hundreds of pics and dozens of videos and only had to charge the battery once.", "Date": "August 1, 2013"}, {"Title": "This camera is perfect for amateurs", "Author": "Maksym", "ReviewID": "R2GV15MFD09EO9", "Overall": "5.0", "Content": "I bought this camera because it's small, useful and takes great pictures. I'm really glad that all my expectations were fully met!", "Date": "October 18, 2013"}, {"Title": "Fantastic!!!", "Author": "byung hyun kim", "ReviewID": "R26432846IUDAB", "Overall": "5.0", "Content": "Good bundle camera!!This camera is worth buying and You won’t be disappointed.I am happy with Sony NEX 3NL.", "Date": "September 14, 2013"}, {"Title": "Great Camera", "Author": "Ron", "ReviewID": "R1E63FRKUCOGN4", "Overall": "4.0", "Content": "This Sony Camera seems to be a great value for the money. I have not had time to explore all the features but all the pictures I've taken so far have come out great. Some of the accessories seem a bit cheap but the memory card is Sony brand & case seems good & fits well.", "Date": "December 31, 2013"}, {"Title": "realy small", "Author": "Lazebnyk Svetlana \"Lazebnyk Svetlana\"", "ReviewID": "R3CD7W24M2SJ1V", "Overall": "4.0", "Content": "really small, but not so lite as axpected, rather havy. fotos quality can be better, but for its money are anough", "Date": "October 4, 2013"}, {"Title": "GREAT CAMERA", "Author": "KAREN A. NUNEZ", "ReviewID": "R2DFCVKE2D0II3", "Overall": "5.0", "Content": "This is exactly what I was looking for in my new camera.  This was an excellent deal which included a lot of attachments I could not get anywhere else.  The camera takes fabulous pictures and has many options.  I am extremely satisfied.", "Date": "June 6, 2013"}, {"Title": "Bundle very not good quality but Camera is great quality.", "Author": "Sandeep B. Deo \"Sandeep\"", "ReviewID": "R1BCGFXNJI09P4", "Overall": "3.0", "Content": "The items in bundle very not good quality but Camera is great quality.Sony products are always very great quality.", "Date": "October 5, 2013"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B00BLRNXUA"}}