{"Reviews": [{"Title": "Canon PowerShot A2500 Silver Digital Camera 16GB Bundle", "Author": "Linda B.", "ReviewID": "R31ZZPMHCJXUSP", "Overall": "4.0", "Content": "I would have given this camera 5 stars except for the fact that it doesn't come with an owners' operating manual.  It DOES come with one sheet of paper that \"kind of\" walks you through it, but if you are like me, and would like it all spelled out for you in a booklet, (or manual) and not have to run to the computer to try to find answers every time you have a question, you are out of luck unless, like me, you have a friend that can figure it out by \"playing\" with it for most of the day.  I really feel that an owners' manual should be included in the camera, instead, I will have to try to find out where I can go to \"order and pay extra\"for one.", "Date": "December 15, 2013"}, {"Title": "Nice camera", "Author": "Paul Kucharski", "ReviewID": "R8U06U0FZ126V", "Overall": "5.0", "Content": "This camera is easy to use and has great features for a low end point and shoot. The accessory package is nice and a bargain. I need to print the camera manual to figure out why some pictures are fuzzy.", "Date": "May 27, 2013"}, {"Title": "Great for the price!", "Author": "Taia", "ReviewID": "R2MM9ED554M0QB", "Overall": "5.0", "Content": "Takes attractive photos during the day and nightEasy to use, lightweight.. convenient for parties and vacationsSlightly sluggish shutter but you only notice this if you don't hold the camera steady", "Date": "August 12, 2013"}], "ProductInfo": {"Price": "$99.00", "Features": "Powershot A2500 Silver 16MP Digital Camera with 5x Opt. Zoom and Smart AUTO\n16GB Secure Digital SD Memory Card\nUltra-Compact Digital Camera Deluxe Carrying Case - DP15\nNB-11L Replacement Battery For PowerShot A2300,A2400,A3400,A4000,110HSE,320HSE\nFlexible Mini Table-top Tripod, 3pc. Lens Cleaning Kit", "Name": "Canon Powershot A2500 Silver Digital Camera 16GB Bundle - Includes camera, 16GB SD Memory Card, Ultra-Compact Digital Camera Deluxe Carrying Case, NB-11L Replacement Battery, Flexible Mini Table-top Tripod, and 3pc. Lens Cleaning Kit", "ImgURL": "http://ecx.images-amazon.com/images/I/51BcIG3VFpL._SY300_.jpg", "ProductID": "B00BCQLDZ2"}}