{"Reviews": [{"Title": "Best amateur camera", "Author": "DebJ", "ReviewID": "RUH2F13U9T218", "Overall": "5.0", "Content": "This is my third Canon PowerShot because you just can't go wrong! This first one I used for years until I dropped it at my nephew's birthday party. The other one was munched on by a dog I was keeping :(. So other than that, I have never had anything go wrong with one. The take great pictures and are easy to use, perfect for the nonprofessional photographer. Note: the case in this set doesn't really \"fit\" the camera. It's too big  but I love it because of the neck strap and I can fit other things in there when I go hiking. I haven't  used the lens cleaner or memory card, so I might have been better off just buying the camera by itself but I don't regret this purchase at all.", "Date": "December 28, 2013"}, {"Title": "Cheap package ~", "Author": "Tim", "ReviewID": "R309MYP47LIBVN", "Overall": "5.0", "Content": "There is no doubt that the quality of Canon ELPH 130 IS. This camera is very good with its price and this package worth your money. However, Wishing this package has extra battery. You really need extra battery when go out site in a long time.This pacage included:- Canon PowerShot ELPH 130 IS 16.0 MP- 8GB Secure Digital SD Memory Card- Ultra-Compact Digital Camera Deluxe Carrying Case- CleanThis is best battery:http://www.amazon.com/gp/product/B007KNFEJM/ref=as_li_ss_tl?ie=UTF8&camp;=1789&creative;=390957&creativeASIN;=B007KNFEJM&linkCode;=as2&tag;=dmtungrau-20", "Date": "October 27, 2013"}, {"Title": "Vacation camera", "Author": "TD", "ReviewID": "R1QNWFUB08CRIH", "Overall": "5.0", "Content": "Bought this for my wife to use on our vacation, as a point and shoot.  She already loved Canon so we might be biased, but she loved it and it will probably be our main camera now", "Date": "October 12, 2013"}, {"Title": "We like it", "Author": "bill", "ReviewID": "R2XTBD7F8RIU5Y", "Overall": "5.0", "Content": "My friend love it,it is a gift for his grandkid,reasonable price and in good quality,thank you much all of you.", "Date": "May 18, 2013"}], "ProductInfo": {"Price": "$115.00", "Features": "PowerShot ELPH 130 IS Silver 16MP Digital Camera with WiFi and 8x Opt. Zoom\n8GB Secure Digital SD Memory Card\nUltra-Compact Digital Camera Deluxe Carrying Case - DP15\n3pc. Lens Cleaning Kit", "Name": "Canon PowerShot ELPH 130 IS 16.0 MP Digital Camera with 8x Optical Zoom 28mm Wide-Angle Lens and 720p HD Video Recording (Silver) Deluxe Bundle- Includes camera, 8GB Secure Digital SD Memory Card, Ultra-Compact Digital Camera Deluxe Carrying Case, 3pc. Le", "ImgURL": "http://ecx.images-amazon.com/images/I/51orKXn%2BaKL._SY300_.jpg", "ProductID": "B00BAX58OO"}}