{"Reviews": [{"Title": "Makes it worth having a separate device for better quality pics!", "Author": "C. Bruce", "ReviewID": "R2HXUSMX3BRTHH", "Overall": "5.0", "Content": "I must say instead of purchasing from Amazon I couldn't wait and tested out cameras in Best Buy and was completely sold on this camera and paid $20 more +tax.  It feels a little on the cheap side?  Maybe just because it's light weight which I do like.  It was very easy to connect to security enabled wi-fi and send pictures to facebook and email.  Some things I believe require you to connect to a computer.  The camera is very intuitive and hints automatically pop up on the screen to further explain what a feature can help you with.  I have not picked up the manual yet.  As another reviewer said the flash is odd but works very well.  I think the way the flash is lends me to lean toward that cheap feeling because it seems as though it could be broken easily the way it is attached.  However, the camera detects if you open it and then will allow for auto flash when open or flash off if it's closed.I wondered how point and shoot cameras were going to keep up and this camera is an excellent example.  This camera is by far better than any cell phone just with the wide angle and zoom capabilities.  With the added sharing, touch screen, and intuitiveness that is integrated it makes it an very neat relatively compact device.  It's not as compact as some but way smaller than the larger zoom cameras and is a great compromise.I have seen a couple cameras with gps and I know one was powered by android.  Nice features but I did not see the benefit of having a lot of those features on my camera when I have them on my phone? Also, the price of that camera was significantly more.Also something to note.  This camera actually has a low light sensor that compensates for the light level versus detecting the light level and adjusting the shutter speed.  When your shutter speed is slower to allow more light in this gives you more time to move the camera and means image stabilization has more to process.  In other words it doesn't work very well.  The samsung has a quick shutter speed in low light situations and does a nice job of compensating for the light therefore also making your pictures clearer and brighter.  This is from my experience and the BB rep gave me a demonstration of it when I had narrowed my choices between a canon elph with wifi and the samsung.", "Date": "April 3, 2013"}, {"Title": "So far so good", "Author": "John kaufman", "ReviewID": "R2TGG42Y94CO17", "Overall": "4.0", "Content": "I was planning on purchasing this camera from amazon, but ended up with a good deal on an open box at Best Buy.  I've tested the camera out and have to say for what I bought it for it looks excellent.Photo qualityThis was my main consideration when buying a new camera. I have to say that the camera does not disappoint me at all.  I've taken indoor low light pics, as well as outdoor pictures of my dogs running around at full speed with only the automatic settings, and the pictures have all come out better than expected.  Action shots are frozen and crisp, and close up portraits are significantly better than I expected, not $1200 DLSR quality, but for a sub $200 point and shoot, WAY better than expected - I doubt the average person could tell the difference.  The portraits show clear subject, no distortion, excellent color and shallow depth of field just like a DLSR and all on auto settings.Video QualityVideo quality is good, the 1080p video looks decent - the image stabilization is good but not great.  The main drawback is that there is a very noticeable noise picked up by the microphone when zooming.  - again for a cheap point and click to use for occasional video the quality is good.  To use as a primary video camera and create your next masterpiece, not so good.One nice thing about video is that you can just press the red video button on the back of the camera to begin recording.  You don't have to find a special setting etc... so it's very quick and easy to go into video mode.  The other nice thing is that while videoing you can still take pictures with no effect on the video.FeaturesThe photo features are what you would expect for a camera in this range. It does also have on camera editing, for cropping, \"Instagram Like\" effects can be carried out in the camera etc...One very nice feature is the touch screen.  I have a Galaxy Note 2 and really like the feature of touching the spot on the screen that I want focused on in camera mode.  This camera has the same feature.  So if the camera is focusing on something in the foreground or background, you just touch on the subject on your screen and the camera changes focus to the right spot.Wireless / Remote connection to phoneThis is truly the best part of the camera.  It has built in wireless connectivity, so you can e-mail photos, upload to facebook, picasa, upload videos to youtube, etc... directly from the camera. No more waiting until you get home and connecting to your computer to do something with the pictures.The coolest part of this functionality is the connection to your smartphone.  Download the samsung app, and you can use your smartphone as the viewfinder and take pictures without using a timer, or touching the camera. This is great for taking pictures of yourself with your kids.. seriously, I have hundreds of pictures of my kids and I am not in any of them because I'm always taking the pictures, I think this will change that.It also can be used to download pictures from your camera right to your phone so any pics taken on the camera appear in your phone's gallery in seconds.  That means you can e-mail, text message, facebook etc... from your phone just like you are used to. I LOVE this!!!Build QualityBuild quality could be better, but what do you expect at the price point? The only thing I really wish it had that it doesn't and I'm a little disappointed in is the tripod threading is all plastic, instead of metal.  I'm worried that using on a tripod will damage the threads and not be able to use a tripod again.  I'm also leery of tightening the tripod too firmly because of this.ConclusionI was considering buying the Galaxy Camera - but at double the price, I get the similar image quality, it appears to be running android internally although I can't play angry birds on my camera - which for me was not a huge selling point anyways... So considering the price difference, this seemed to be a much better deal for the same basic photo, video, wireless features. It is a very pocketable size, the photo quality is excellent - way better than I expected, and automatically downloading pictures to my phone - and computer wirelessly are exactly what I wanted.I am happy with the camera so far, but gave it 4 stars because of the following:- Tripod threads plastic not metal- Zoom noise during video recording.- Remote viewfinder app is amazing, but I wish it gave full control over the camera - changing scene modes, burst shots, etc... The feature is great, but could use a little polish.", "Date": "July 1, 2013"}, {"Title": "I'd rate at 3.5 stars. With some improvements, Samsung could have gotten a 4 or 4.5", "Author": "M. Sarkar", "ReviewID": "R2J5QKO34IUD07", "Overall": "3.0", "Content": "I carry a compact camera in my pocket quite often and generally prefer the older models with CCD sensors over the glitzy newer models with their 1/2.5 inch CMOS sensors. For the past 2-3 years, I've looked to upgrade for the wider 24-25 mm lenses and the 12-20x zooms on newer cameras, and had hoped that at least one manufacturer would put in a rotating LCD screen (or even a viewfinder, for those glaring sunny days) in a compact pocketable camera. I am not a pixel-peeper and I try to avoid post-processing on the computer. I do not expect to print any larger than 8x10 inch, so I have reasonable expectations from a compact travel camera. Hopefully, that gives you an idea about my perspective on photography with a point-and-shoot compact.I'll touch on some points below, having already posted some thoughts in replies to other reviews here and on the older WB150F model's pages. Your opinions might obviously vary from mine, but please TEST the camera before you question/comment :-)With the WB250F, image quality is quite good. I've used the P (program) mode, the Auto and the Scene modes. I'm planning to post pics on Google+ using the hashtag #POAB and maybe even a comparison with the Sony HX10V and my older workhorse compact, the Samsung v70 (1/1.8 inch CCD sensor).For indoor use, I set ISO to 200. The flash power was adequate and image quality was good, too.The ability to change settings using the physical buttons, the touchscreen or a combination of both definitely makes this WB250F camera fun to use - and it's often faster than scrolling though menus.The placement of the pop-up flash, closer to the middle of the body is much more ergonomic than many other cameras. Unlike the Sony and Canon travel zoom models in/above this price range, you can grip the camera quite nicely with BOTH hands and not have to worry about having a finger over the flash. You have to press a button to pop the flash up. I'm sure users' feelings are mixed about having to manually pop the flash.I'll agree with C. Bruce that the WB250F does pretty well in low light mode: it takes a short burst of pics in low light, then flattens them into a single image with fairly good detail. In my experiments, the ISO climbed to 1280 but the image remained usable. Some cameras like the Sony HX10V might easily climb to ISO 3200 in low light mode, but the pics become noisy.This WB250F camera has a \"Rich Tones\" mode that uses HDR. In my tests, mostly on dawn and sunset skies, the HDR result seemed a lot more \"real\" as compared to the red-shifted \"watercolor painting\" that I got from a Sony in HDR mode. I like a vivid pic as much as anyone else, but the Sony's HDR went overboard and seemed too fake to me (I prefer \"real\" over overprocessed photos designed to elicit \"oohs\" and \"aahs\").Macros come out fine. Colors are pleasing, and without over-saturation.You can adjust sharpness and contrast via the menu.Video quality at 720p, MP4 settings seemed good to my eyes, but I haven't tested extensively. The dedicated video button is located close to the raised thumbgrip. Zooming during video is possible, but you risk \"focus hunting\" even if you zoom as slowly as possible.In playback mode, the touchscreen allows swiping to move back or forth. Not a huge thing, but an obvious touch (pun intended) coming from Samsung's giant footprint in smartphones. Toggling the \"display\" button (the top of the four-way controller) quickly shows a histogram and the exposure, etc data. One major frustration in playback mode is that the lower ~1/8th of the screen in playback mode gets partly obscured by a panel containing two \"soft\" buttons. So, unless you patiently wait a few seconds, you cannot see the entire photo in playback. Utterly irresponsible of the Samsung designers. Rather, incomprehensible, given how many other things have been nicely thought through and implemented in the touchscreen user interface.The WB250F's 18x optical zoom is snappy but poorly implemented: it doesn't zoom in reasonably smooth increments. I wonder if the zoom is too fast by intention, or is the zoom lever too sensitive? The initial optical zoom between 1x - approx 5x is fine. However, after 7.8x, it jumps to about 12x, then about 15x, finally 18x. With the jerky zoom, I find it hard to frame a pic at just the right zoom for the scene. Also, the camera often hunts for focus, even when set to center focus. I've played with Program, Manual, Auto and the zoom issue persists. The zoom only gets smoother once in *digital* zoom at 19x and above (but pic quality will suffer if using digital zoom).Focus hunting is fairly common with this camera. This happens sometimes even with good light when focusing on objects without sharp lines, e.g. clouds. Knowing that multi-point focus is more work for the camera, I keep it set to center-weighted focus. So, I'll lock in focus on a distant tree, then point the camera at the cloud. In some (but not all) cases, the camera focuses faster when set to \"action shot\" using the S mode on the selector dial. Focusing needs improvement - hope Samsung is listening.If anyone else here can comment on their camera's optical zoom and its smoothness on the WB250F, I'd appreciate it. Not sure if Samsung can make the zoom smoother with a firmware update, but I'd love the camera if it had a decent usable range in optical zoom and faster focusing.", "Date": "April 5, 2013"}, {"Title": "Awesome Camera - Must have for fast travel", "Author": "Outdoor Chef", "ReviewID": "R1JIDSNEWI5ZYR", "Overall": "5.0", "Content": "I have been doing amateur photography for over 20 years. Yes I have that big Nikon Digital SLR with fancy lenses, and yes it takes the best pictures, plus more creative work. BUT, the Samsung WB250 is really shines. I did not want to take my big camera to Disney World, so I took this one instead. WHAT FANTASTIC PICTURES.Pro'sPicture Quality - Excellent for Point and SHootZoom - excellent resolutions and clarityISO - Very Good except at higher speeds but that is expectedSpeed - Excellent - no lag between shutter and recordingVideo - Very GoodCons: Some of the programs such as fireworks, sunset are ok, but not great. Fireworks setting is less than averageFor Size and Funcationality is well worht this very low price especially in this digitial age. (It is several steps ove your cell camera and maybe 1 or 2 down from a Digital SLR).Recommendation: Learn to take good pictures. Then in your hands a camera will be awesome.", "Date": "July 25, 2013"}, {"Title": "UPDATE: OK, But Don't Buy this for its WIFI features. Many do not work as they should", "Author": "S. Baer \"Steve\"", "ReviewID": "R1AXM25H6FWZ1G", "Overall": "3.0", "Content": "The camera is OK and has lots of features. Its also fairly easy to use in a getting started mode, without reading too much of the manual. But be sure to download the full manual. It is really annoying that manufacturers don't want to spend the few bucks to include a decent printed manual for basic use.There is a serious flaw however if you are buying this camera for its WIFI features. The Samsung remote shutter AP does not work with the Samsung Note 3. When the Camera tries to mate with the Note 3 and this Samsung AP, the Note 3 tries to find an internet connection. The Note 3 then says: \"Checking quality of internet connection\" waits a bit, and then says: \" Network disabled because internet is slow.\"I have searched the web and find that others have mentioned the same thing. Apparently there does not seem to be a way to tell the Note 3 that on a WIFI connection to this camera that it should only run peer to peer with the camera, and forget the internet.I have been able to get the camera to mate with my home WIFI network and email a picture. This seems to work, although the picture file size was compressed in the process.I have not been able to use the WIFI auto-backup function, since this has a bug as well that causes timeout. It shows up as a connection quality issue on the camera and PC, even when they are close to each other. I suspect its similar to the one above. i will have to research more.I have spent a couple of hours already on the chatline with Samsung, and find that they do not understand these issues well. I finally gave up with them, and learned more on the web.My virus detector also noted a virus threat in the Samsung PC launcher software, although it seems to work OK. The Samsung launcher did successfully update the firmware in the new camera.Overall, the WB250F appears to be a decent replacement for my dead Cannon Elph. BUT DONT BUY IT FOR ITS WIFI. Researching WIFI fixes and patches is not what I had in mind when I made this camera purchase decision.My background: Electrical EngineerUpdate 11/20/13The problem with the SAMSUNG remote viewfinder using the SAMSUNG NOTE 3 and the SAMSUNG WB250f seems to be widespread. I went to the XDA developers forum and found a good discussion of it using the Search: \"WiFi problems: \"Network disabled because Internet connection is slow\". Some people say to uncheck the \"always allow scanning\" box on the Note 3 WIFI advanced page. In my case,that was already unchecked. BUT when I unchecked the \"Auto network switch\" box on that same page, the WB250f started to mate properly with the Note 3, and the remote viewfinder worked. Be sure to recheck it when through, if you want to have a data connection away from a WIFI network. P.S. My note 3 is Verizon.Many Thanks to XDA Developers Forum!!!SAMSUNG tech support and chat could save many frustrating hours of their and customer time if they learned about this.Steve", "Date": "November 19, 2013"}, {"Title": "Great Camera!", "Author": "Melissa Faires", "ReviewID": "R3HLKS45M98BYJ", "Overall": "5.0", "Content": "I bought this camera for my trip to Hawaii, what a deal! the camera is light and small enough to fit into my purse. The buttons are big enough and very easy to use. The pixel and zoom on this camera is one of the best for the price! Only down side is the flash has to be opened before use manually by a simple button. Its not a big deal but annoying when your taking pictures and forget to open it. ...although once in the habit of doing so you forget and its not really such a pain. I also notice most newer cameras have this feature so all in all I would buy this camera again and definitely recommend it to friends and family. Again great price for a really well rounded camera!Happy Customer!", "Date": "June 6, 2013"}, {"Title": "GREAT PRODUCT", "Author": "killapathy", "ReviewID": "R29HJ7KRVXO8XZ", "Overall": "5.0", "Content": "I'd been researching, and searching out cameras for months. I needed something that was not to heavy, had a fast reaction time, great zoom and MP that was not to cheap, but easy on the wallet as well. This product fit the mold to a T. In addition the battery is rechargeable and lasts a long time. I couldn't be happier. The only complaint I have is with the color it looks more black then blue. The zoom is fantastic. I love the wireless capabilities and the touch screen as well as the photo settings. All around a great product. I highly recommend.", "Date": "May 23, 2013"}, {"Title": "Nice features but buggy", "Author": "jnott", "ReviewID": "R1WBX89Z7SK7H8", "Overall": "3.0", "Content": "I bought this camera in Gun Metal for my parents.  It's a nice looking camera with a lot of features, but I mainly bought it for its ability to email pictures directly from the camera.  In addition to their regular camera, my parents had been using their iPad on vacation to take pictures so that they could email them to show me.  I always felt that it must be awkward holding a huge tablet like a camera while standing at the top of a scenic lookout point.  I had visions of a strong gust of wind blowing their tablet over the edge of a cliff.  So I started looking for something with the form factor of a regular camera that they could use instead.  As long as it took decent pictures (not blurry, good colors) and functioned in a way they could understand, they could use it as their main camera.Pros:- Assuming you're connected to a wifi network, emailing photos is pretty easy because it doesn't require setting up an email account beforehand, and there's no login required.  You only need to enter your return email and the email to send to, and the photos are sent (up to 20 at a time) using Samsung's email servers.  You can set up a default return email, and it remembers a number of recent \"send to\" emails that you can optionally choose from a list.  If the photos are large, they're shrunken down to a manageable size for sending but are still a good quality for viewing.- The hybrid touch screen makes it a little easier to choose options, since my parents always found it hard to use the more cryptic buttons on other cameras.- It's easier for my parents to equate \"flash on\" with \"popped up flash\" and \"flash off\" with \"no popped up flash\".  There are ways for customizing this setting, but I set it up this way for them.  Now they don't need to call me to ask how to turn the flash on/off as they used to with their previous camera.- The 18x optical zoom is powerful and will let you take pictures much closer than the naked eye can see.- Pictures outdoors in bright light are nice and crisp.Cons:- The camera is somewhat buggy.  On two occasions, the camera would not turn on even though the battery was charged.  Fix: Pop the battery in and out, and the camera turns on again.- Sometimes the camera will not connect to a remembered wifi connection for some unknown reason.  Fix: Forget the wifi connection, and set it up again by re-entering the password.- Sometimes the camera will not connect to a remembered backup PC for wifi photo transfer.  I hope this doesn't happen often because I don't know of a reliable, easy fix, and it will be painful talking my parents through it over the phone.- It's harder to connect to a wifi network at a public location where you need to accept a login agreement.  The camera shows you a small browser window, but the check boxes are often too small for fingers to press, and you need to use the physical buttons to navigate and press check boxes.  This is harder because it once again requires the use of the more cryptic buttons.- The 18x zoom only functions in certain large increments, so you don't get the full incremental range of zoom up to 18x.  Also, at high levels of zoom, it takes a while for the camera to auto focus.  The scene will be blurry for a couple seconds before it comes into focus.- Pictures indoors with no flash or in low light are more blurry than other cameras.  You need to hold the camera extremely still for a good chance at a non-blurry picture.- The DIRECT LINK button is located in an area where the camera is commonly held (upper left corner), and thus can be easily pressed by mistake.- The USB cable that comes with the camera is very short.  I replaced it with a longer one to avoid the possibility of the camera being knocked off a table while charging.This camera has some good features, but it has bugs that make it not as ready for primetime as it could be.  Hopefully, future software updates will solve some problems.  Note: My review only covers the more basic features that my parents use.", "Date": "January 10, 2014"}, {"Title": "Great camera for its price but know its limitations", "Author": "JayeP", "ReviewID": "RNQ9J0H4NCMSN", "Overall": "5.0", "Content": "I've had this camera for about 3 months now and have used it on a regular basis.  First off, this is not my one and only camera but an EDC- everyday carry.  I purchased this camera as a compact camera that I can fit in my bag and take everywhere, everyday.  I previously owned the WB150f, and I was very pleased with its performance.  As I stated in that review, if you are looking to purchase a camera with spectacular IQ akin to DSLRs or even IQ on par with high end compact cameras, this camera is not for you.  However, if you're looking for a camera that takes pretty good pictures, has the convenience of WiFi to upload quickly to FB to share your photos with your friends/family, has the capacity to quickly transfer photos between your camera and your smartphone and has a great optical zoom range, you might want to consider this camera.When I was trying to decide what compact camera to buy this year, I brought my choices down to: 1) WB250f 2) Canon Powershot SX280 hs and 3) Samsung Galaxy Camera.  The Canon was tempting because admittedly, it probably has better IQ than either of the Samsung cameras.  However, it lacked the touchscreen that WB250f has, and I know that inputing passwords and email info on a non-touchscreen was too much of a hassle for me.  Truthfully, the Samsung Galaxy Camera was my number one choice.  It has full Android on board with 3G/4G service.  It has everything that the WB250f has plus more.  BUT, it came with a bigger price tag on what is essentially last year's technology.  The Galaxy Camera is basically a WB850f merged with a Galaxy S3 smartphone minus the call feature.  After much thought, I decided to get the WB250f since the price was cheaper, and I couldn't justify paying the early adopter tax for last year's technology.  The CPU and RAM is better on my Galaxy Note 2.  The screen is bigger on my Note 2 than the Galaxy Camera.  Considering how easy it is to connect my Note 2 to my WB250f, I am pleased that I made the right choice for me.Since there are quite a few detailed reviews of the WB250f on tech/photo sites, I'll just touch on things that I noticed while using this camera for the last 3 months.IQGreat IQ comes with a price tag.  The IQ, for the price of this camera is absolutely fine with me.  Sure, if this was a high end compact camera or a DLSR lens, I would've been disappointed.  But for a sub-$200 compact, I have no complaints.  The photos are sharp enough, and if you want it sharper, there is an option to increase the sharpness under image adjust.  There are many options to increase the vividness of the color- you could select the Vivid option in smart mode or even set the contrast and saturation higher in image adjust.  Low light performance is great for its size.  High ISO tends to be grainy but I think it is usable up to ISO800.  Also, the low light option under smart mode does a pretty good job although some images might appear soft depending on how dark the environment is.ZOOMI love the optical zoom!  To have this much optical zoom in a camera this tiny is very useful for me especially when I am hiking and run into wildlife.  As someone else mentioned, the zoom is not smooth so micro adjustments are hard to make.  It's not a deal breaker for me- I can live with it.FOCUSThe WB250f hunts for focus at full zoom in darker environment or at very close macro.  Since I usually use ASM mode most of the time, I just set the focus manually.FEATURESI don't use automatic mode so I can't comment on the effectiveness of that.  I really enjoy using the ASM mode or the Smart mode depending on the situation, and I have been pleased with the results.  I also use the tilt-shift filter here and there for fun.  Also, this camera takes gif so I've had lots of fun making them straight from the camera.CONNECTIVITYI have had no issues connecting my phone to the camera using the Samsung Smart Camera App.  File transfers are quick, and the remote viewfinder works great.  I have also connected the camera with my iPad without any problems.  The camera connects seamlessly to my Netgear router, and I have had no issues uploading my photos directly to FB.CONCLUSIONThe WB250f is a great, fun camera if you purchase it knowing its limitations.  It will never give you DSLR-like nor high end compact camera IQ.  If IQ is the single most important factor for you, then it's probably better to spend a little more money and buy a different camera.  If you're just looking for a compact camera that is fun to use, has connectivity features and produces good photos then you might want to give this camera a go.  Since pictures speak a thousand words, you might want to do a search on Flickr for the camera and see what everyday users have uploaded.", "Date": "July 7, 2013"}, {"Title": "Nice camera for the price", "Author": "Fishnphil", "ReviewID": "R39K7ORJV23A10", "Overall": "4.0", "Content": "The family loves it since the interface is similar to a modern smartphone with the connection to wifi.  The camera itself takes great pictures in almost all of the different modes automatically.  The automatic macro mode doesn't come out good all the time but controlling the setting in manual mode fixes it.  All in all I'm really happy with it and is a good balance of features, quality, and price.", "Date": "August 14, 2013"}, {"Title": "Easy to use - terrific photos", "Author": "TJ", "ReviewID": "R2YDFB434Y3P8H", "Overall": "4.0", "Content": "much more user friendly than my digital camera which stopped working. I read about the WB250 on-line and believe it performs pretty much as promised.  There is a learning curve...  My only comment is I wish a users manual came with. I know I can (and have) download but it would more convenient to have a compact printed manual to throw in my camera bag.", "Date": "July 11, 2013"}, {"Title": "Taking pictures..... ..CLEARLY", "Author": "C. Powers", "ReviewID": "R27YVAKPQBTHVX", "Overall": "5.0", "Content": "The picture quality inside and out, night and day is outstanding. I'm betting that cameras costing hundreds  more are not as good as this. I'm definitely a happy customer.", "Date": "June 27, 2013"}, {"Title": "Very Happy with The Samsung WB250F Smart Camera", "Author": "an honest reviewer", "ReviewID": "R3SZP0TUC4T70F", "Overall": "5.0", "Content": "I've taken gorgeous photos with this camera.It features 18x zoom. Image stabilizer, face detection, auto focus. It has built-in Wi-fi.It has a direct link button allowing you to email a photo directly. There's many effects and filters for photographing.There is a three inch touchscreen. The flash pops up when needed.The photos are better quality than if taken with a smartphone.All in all, I think it's a reasonably priced camera that takes great photos.", "Date": "July 29, 2013"}, {"Title": "Nice camera at a reasonable price", "Author": "Helen", "ReviewID": "R1Y50VPOO38EZI", "Overall": "5.0", "Content": "I am so far very pleased with the camera. I am enclosing a few facts that may not be clear from the specification.() The weight of the camera (including the battery and a memory card) is 7.3 ounces.() The size of still-image files (jpeg) is between 4MB and 5MB.() The camera needs a reasonably modern memory card. If you have an older card (say, Class 2), it may be too slow, especially if you are planning to make movies.() The flash has a manual pop-up button, and then needs to be manually \"folded\" back into the camera, which a minor inconvenience. The camera does not pop it automatically.", "Date": "September 19, 2013"}, {"Title": "Gotta get this one", "Author": "Jocelyn Carpenter", "ReviewID": "RVYAPITZNQBQB", "Overall": "5.0", "Content": "This is one of the best camera's for the price.  EXCELLENT quality both in material and in the pictures it takes.  The zoom is incredible and able to upload directly to facebook, etc is just wonderful.", "Date": "May 1, 2013"}, {"Title": "Excellent camera with many great features", "Author": "AHB \"barbwiretoo\"", "ReviewID": "R3FW1JOITM8JRE", "Overall": "4.0", "Content": "This is an excellent camera with many great features mentioned in the other reviews, with one exception. The flash feature will only pop up about 60% of the time - 100% requires several attempts. The feature involves a mechanical release of a plastic tab below the flash inside the case and a hard to get to release button which must be pushed well below the surface of the case to release the flash. Camera is amazing on the auto-focus. The WiFi capabilities are without equal on other similar cameras. One concern for the future is the design of the flash portion, as the plastic release may wear down leaving no way for the flash to be stowed. The attachment of the erected flash appears to be subject to permanent mechanical damage with a slight mishap. However that has not been a concern. Hard to find a better camera for its intended purpose - perfect for travel. I would recommend it for someone who is not hard on their camera. Only reason it does not have 5 stars is the flash issue.", "Date": "June 12, 2013"}, {"Title": "Great wifi", "Author": "Max", "ReviewID": "R39NJC29004EQ5", "Overall": "5.0", "Content": "I bought the Samsung WB 250 F camera after returning a Canon ELPH 330 HS, when I couldn't get its Wi-Fi to work.To some extent this review will compare the two cameras.I wanted a camera that had a number of features:1. It could fit easily in my pocket.2. It had Wi-Fi so that I could email and upload my pictures from the camera. to web storage.3. I wanted a good zoom.4. It had useful features.5. It took good pictures.Points of comparison:2. Less than one minute after I had put the battery in the Samsung WB 250 F, I took a picture, pushed the Wi-Fi button, found my home network, entered my WEP number, my email address, and saw the email on my computer with the photo.What a simple pleasure.  That alone sells the Samsung over any other compact camera.1. The Samsung is a little larger, and heavier, but it still fits easily in my pocket. One advantage of the slight increase in thickness is the handy hand-grip on the right side of the Samsung. The Canon was so slight and smooth that it could easily slide out of your hand. Of course for any of these small cameras, never use them without the wristband.3. The Samsung has a larger zoom, but seems to go in steps rather than smoothly, as does the Canon.I can live with this feature of the Samsung, because the 18 zoom is impressive. It is hard to hold the camera steady at this zoom, so I will be getting a tripod.4. Now that I have tried both cameras I find the Samsung more user-friendly, although using advanced features on either camera requires careful use of the user's manual. It is important to me that the Samsung has aperture and shutter priority, which the Canon, for some reason, lacked.  Each camera has some features that the other one lacks, but the aperture and shutter priority are the most important for me.5. I had not originally chosen the Samsung WB 250 because several professional reviews had said that it's photographs were not too good, especially compared to the Canon 330. But I am happy enough with what I see, even on a computer screen, with my Samsung. I think the professional reviewers, to their credit, use all kinds of sophisticated software to find technical imperfections in the camera's pictures that I can't see. I do not expect that I will want large professional posters, so I am satisfied with what I have seen.Whatever camera you buy, you have to do a number of things before starting.1. Order an SDHC memory card in the same order as your camera.  I bought a Sony SDHC 15 GB class 10 card for about $15 from Amazon.2. Download the manual from the camera website, and start getting acquainted with the camera.3. Make sure the battery is charged before starting with the camera.4. Format the memory card. It is a little hard to find out to do this in the user's manual.5. Make sure you save all the original wrappings in case you have to return the camera.Good luck with whatever camera you buy. One good point is that it is so easy to work with Amazon.", "Date": "April 7, 2014"}, {"Title": "great!", "Author": "notsatisfied", "ReviewID": "R11GIU07TT3RW6", "Overall": "5.0", "Content": "nice zoom, good quality pictures! love it! the camera is very light and durable, and has wifi! the zoom is good too!", "Date": "March 10, 2013"}, {"Title": "Unbeatable camera for the price", "Author": "caribnow", "ReviewID": "R1VD0D5F7DWK5K", "Overall": "5.0", "Content": "Got this camera for free and I am very impressed. Color reproduction under daylight and low light (indoors) is perfect. It deals with various electric light hues brilliantly, even when they're combined in one shot. 18X optical zoom is crisp and clear. It boots quickly and boasts an impressive array of high-tech features like built-in WiFi, Facebook, Picasa, and direct links to my Samsung phone and SmartTV.It is not as sharp as a canon and has some pixel distortion when you zoom into the picture file on a PC, but for a point and shoot it's more than good enough.I am a Canon guy and currently have 5 canon cameras including 2 dSLRs (5D & XTi), but am sold on how far along Samsung has come with their cameras. I highly recommend over any of P&S; that I've seen from Canon lately, and you can't beat the price.", "Date": "June 15, 2013"}, {"Title": "Awesome camera - especially for the price!!", "Author": "Melissa P-E", "ReviewID": "R3FY4SQDURN1L", "Overall": "5.0", "Content": "I did a solid 2 weeks of research before deciding on a camera. I read tons of reviews and watched youtube video product reviews and compared specs, etc etc etc. I finally narrowed it down between this guy, and a Sony (can't remember the exact model number at the moment). They both had awesome reviews, and both seemed like really good cameras, but the Sony (another superzoom at 20x optical) was a hundred dollars more. If they had been the same price, I would have probably picked the Sony, but only because of the flash on this camera. The sony had the normal flash that's built into the camera (as opposed to the pop-up flash of this Samsung). That was the only real problem I had in making my decision, but I eventually opted for the samsung, and I LOVE it. I'm really happy with my decision. The flash doesn't bother me at all. I originally thought it would be a hassle, and easy to break off, but it actually seems pretty durable. And truthfully, I have yet to actually need the flash at all. Unless you're taking a picture in a dark room, there's no need for it, because this camera takes excellent low light photos. It's full of awesome features, but the \"auto\" takes great pictures on its own.The battery life also has exceeded my expectations. I've had this camera for over a month now, and I've only had to charge it once so far. I've taken 374 pictures, plus a few short videos, and one 20 minute long 1080HD video at a show we went to. The 20 minute video took the battery down from 3 bars to 2 bars, but that's it! I bought a replacement battery and a separate charger just in case, because I was used to AA batteries that I could easily swap. This is my first rechargeable battery camera, so I didn't know what to expect. I will never EVER go back to double A's. I could only get my old camera (kodak easyshare) to take about a minute and a half long video before it would automatically shut off and tell me the battery was dead, so this was a very welcome change.I'm also happy with the speed of this camera. My old camera would take about 10 seconds to turn on and load before it was ready to take a picture. This thing is ready in about 2.The menu's are easy to follow, and the hybrid touch screen is pretty cool. The video has it's own separate record button, which is nice, and you can take pictures at the same time as video, which is WAY better than having to decide whether you want a video of your kid blowing out their candles OR a picture. You can do both with this camera.I love that it uses a standard USB charging cable, because I already have car and wall chargers for USB cables (for my ipod), which is convenient. I also love that it uses a full size SD card instead of micro. Micro's get lost too easily, in my opinion.I haven't used the wi-fi feature yet, so I won't comment on that.The ONLY thing that sucks about this camera (for me) is that it's slightly longer than my last camera, so it doesn't fit into my designated camera pocket in my purse. But seriously, who cares?  I LOVE this camera.", "Date": "January 1, 2014"}, {"Title": "great little camera", "Author": "Susan C.", "ReviewID": "R2K894NHZLAYTG", "Overall": "5.0", "Content": "takes fantastic pictures. crystal clear. Even the zoom..nice clear pictures. does great in low light too. My only issue is the instruction booklet provided is useless. Hardly any instructions at all. It was a guessing game to figure out", "Date": "July 24, 2013"}, {"Title": "Good Camera With One Critical Unobvious Flaw", "Author": "Clayton E. Cramer", "ReviewID": "R14CCZVR8G8G7N", "Overall": "3.0", "Content": "If you are buying this camera primarily for still photography, and you do not intend to use the video capability for anything but very short segments, this is a really decent camera -- worth four stars, maybe even five.  It produces really crystal clear pictures, using a variety of mechanisms for identifying on whom to focus.  The HD video (in both 1080p and 720p modes) is sharp and color-rich in all but the most low light conditions.  However, it has one unforgivable flaw (which is shared with many other DSLRs): it is limited to 20 minutes of video as a session, not because of memory space, but apparently to meet some European Union tariff requirement.  Yes, you can wait for it to finish processing the first 20 minutes, and start recording again -- but that is many seconds later.  If you need anything but very short video segments, you probably need to buy something that is primarily a video camera.Unfortunately, I bought this not on Amazon (where it would have been cheap), but at a local brick-and-mortar retailer, because I needed their expert advice on what to buy.  They apparently did not know about the 20 minute limit, and I discovered it after the 14 day exchange period had elapsed.  Yet another reason to buy from Amazon.  I would still have discovered it too late for an exchange, but at least I would not have paid $100 more for expert retail help.", "Date": "October 13, 2013"}, {"Title": "Great backup Camera", "Author": "HD Rider \"HD Rider\"", "ReviewID": "R1KL84527HZ9ZE", "Overall": "5.0", "Content": "I am an advanced amateur (Which essentially means that photography has been my hobby for about 40 years, but I don't get paid to do it). I normally shoot my Nikon D7000 and my Nikon D7100, which is the best camera I have ever owned. But both of those cameras are bulky, so I was looking for a backup camera to carry around other than my iPhone and I have been through 8 of them so far, all sitting in my desk drawers now. I mainly got the Samsung because of it's WiFi capabilities and was willing to put up with some downgrading in picture quality, but still better than the iPhone and more option in manual mode and zoom abilities. I am very pleasantly surprised. This camera can take really good shots as long as you don't push the light into DSLR zones of extremes. And the wIfi works like a champ to my iPhone and it's exactly what I needed to be able to take quality pictures and email/upload/print them while away from my computers. I wish it were a little thinner and pocketable, but then the zoom wouldn't be as good as it is. So for the price, this is the best point and shoot that I have ever owned", "Date": "July 14, 2013"}, {"Title": "Wow!,  a camera that does GIFs!", "Author": "roaeja \"Hey you!\"", "ReviewID": "R3D4ZFRJVH2XMI", "Overall": "4.0", "Content": "So far I like it.  Touch screen in nice and menu well set out.  It has a nice, solid feel to it.  The flash is kinda dorky, but easy to hide.  The zoom is awesome.Later...I would uploaded a .GIF file, but Amazon doesn't support that either!This is a super camera.  Simple to use and fun.  It has X36 iZoom.  Not bad.The lens is fast, press the shutter button and it takes a picture, instantly.  Wow.I had a Nikon an five seconds later, your got the picture!  It has a multitude of scenes to help you compose the best shot.  Plus it will fit in your shirt pocket.  You will like it.  If you are a Windows user...and have a PC.This is a very exciting camera, with faults.  I own a Samsung SH100 and I take a picture, it comes right up on my Samsung tv screen, not this one.Maybe Samsung will come out with a firmware update, go I can send pictures directly to my Samsung and it will up on the tv screen.  Isn't that what Allshare is all about and what about Allshare cast?  It seem the right hand of Samsung, isn't talking to the left hand and things are falling throughout the cracks.You have to use the 240 for uploading via wifi to socialmedia sites and it only records 30 seconds worth of video.Seem kinda stupid, the only way to view a GIF is to mail it to yourself.  Facebook, won't display or to one of their devices. Can't even display in on a Samsung 8000 tv!  This is all wrong.  BUT, it has some nice features!But, the biggest factor is the price, a good value for taking pictures.  Price wise, it can't be beat.  You will not go wrong buying this camera, Samsung has to come out with a firmware upgrade to make it talk to Samsung tv's with Allshare, like the SH100!There is an upgrade for this camera, BUT, it's hard to get to.  There is an iLinker in the camera, via USB.  You click on it and it opens up an installer for iLauncher for the Mac.  But, when you try to install it, it fails and won't install. There is no download for this on the Samsung site for this camera,They are PC, we are Mac and the two don't seem to talk to each other.SO, how do you get an upgrade for your camera?  I guess pray.Remember, you can only upload 30 sec of video in low resolution!", "Date": "February 27, 2013"}, {"Title": "Slow shutter", "Author": "Pedaholic", "ReviewID": "R16AZPTGTZLAKI", "Overall": "1.0", "Content": "Slow shutter speed, although there is an option to change it, still functions very slow in every setting & causes blurry photos.", "Date": "November 28, 2013"}, {"Title": "Love it!", "Author": "Shopfrvirginia", "ReviewID": "R2W1BD7PFKSRYO", "Overall": "5.0", "Content": "Even better than the Samsung WB150F i loved but had to replace due to accidental damage. Cool features and very sharp video.", "Date": "August 7, 2013"}, {"Title": "Small, Easy to Use, Better than Your Phone", "Author": "A. Jacquot", "ReviewID": "R25YB6FZ7PN1UM", "Overall": "5.0", "Content": "I have so needed this camera!This camera is simple and as easy to use as a smart phone. You can upload your photos directly to your phone, Facebook, or the cloud (I use Dropbox). The menus are easy to follow. The photos are sharp and clear.I admit I am not a gadget geek and all I wanted was a camera to take basic photos for eBay and for personal use. I don't want a big fancy camera with lots of bells and whistles. My Android phone doesn't quite do enough in the photo department for my needs, so I bought this camera. And it ROCKS!This camera totally does everything I need it to do. Takes great pictures from inches away for my little eBay items, and yet also does awesome family photos. And it's fast. There doesn't seem to be that ridiculous lag time between pressing the shutter button and when the photo gets taken, thus your subject doesn't have time to move. It works like old-time (?) film cameras did.Having the ability to upload straight to my phone or computer is great, too, so that I don't even need to find a USB cord (which, in this house, will have disappeared). Of course, I can always take the chip out and put it in my computer to read it as well.I recommend this camera for its ease of use, lightweight travel friendly-ness and sleek design.", "Date": "September 19, 2013"}, {"Title": "Samsung FAIL- I cannot recommend this camera even if it's FREE.", "Author": "Lu Johnson", "ReviewID": "R1Q99J9E4HOW7J", "Overall": "1.0", "Content": "I purchased this camera from Best Buy... it's price was decent, and I like Samsung stuff.Now, after using it in the real world, I've decided this was not the best camera I could have gotten for the money.Disappointments:1. While the camera has lots of cool wifi features, they are clunky to use.2. Overall the intuitive feel for just taking pictures is non-existent. It feels like some engineer in a cubicle who never gets out designed the menu and control systems. This is my most hated aspect of the unit.3. Picture quality for a camera of this resolution is overall lackluster. Colors are bland, even when you tinker in menu.4. The resolution and end product seems that of a far cheaper camera.5. Long zoom is nice, but crappy optics with lots of distortion, coupled with a presumably horrible image sensor turn out picturs of things nice and close up, but horrible color, focus, and quality.6. Did I mention the menu ergonomics? UGH!7. Connectivity: I use EyeFi cards in all of my digital cameras... love the ease and speed and being able to copy videos and stills to my PC for archiving. The WB250F has BUILT IN connectivity, for backing up to your network (KLUDGEY) and to online services, such as Evernote, FB Youtube and SkyDrive (Microsoft) I have tried Samsung's \"AutoBackup\" that's built in, and it works, but it's MANUAL! I have to go into a menu on the camera and 'do it'. This is insane.Lastly, and this is VERY IMPORTANT: One of the connectivity features available to the user in the WiFi menu is Skydrive, as I mentioned.I have a Microsoft account, so I thought 'hey! I can use this, at least! It will backup my pictures to a folder in my Skydrive! Cool!Well, I set it all up, and once again (you have to) went in Manually and selected the pictures and Videos to upload... WHAT???? IT DOES NOT LET YOU UPLOAD VIDEOS!!!! This is RETARDED. Ok, so let's at least backup my stills.So, I manually selected a bunch of pictures and uploaded them. It worked, pretty fast too.. when it was done, I almost deleted those images (irreplaceable ones) from my SD card, but hesitated for some reason. From my PC, I checked in my SkyDrive folder,verified that the images had properly copied, and then chose to view some of them. um... wait, something isn't right here OMG>>  ... YOU HAVE GOT TO BE KIDDING ME.... SAMSUNG DOES NOT BACKUP THE ORIGINAL SIZE AND RESOLUTION OF YOUR PICTURES. THEY SHRINK THEM TO 1600X1200 FROM THE NATIVE 4320X3240  AND GET THIS:  --  THEY  ---  DON'T  ---  TELL  ---  YOU  ---  THIS  ---  ANYWHERE!!!!!This is PREPOSTEROUS.Furthermore, you cannot, to my knowledge CHANGE THIS SETTING in any menu, I've searched.So you're on a trip, take a bazillion pics. Your SD card is full so you upload everything to your SkyDrive. Great! DONE!!!! yay! You erase the card and take more pictures. Get home, look at them, zoom in ONCE and suddenly you see HEAVY pixelation... gasp... so then you double-check all of them, they are all the same... and then SCREAM OUT LOUD multiple bad words directed at the moronic GEEK engineers at Samsung.Holy crap, this is a HUGE deal. And it's not mentioned ANYWHERE in the menu system, docs, etc.This is completely unacceptable.BEWARE of THIS CRAPPY CAMERA.", "Date": "December 10, 2013"}, {"Title": "An inexpensive high zoom camera, but didn't do as good as I hoped.", "Author": "Steven Hurd", "ReviewID": "RU9YZB9Y4JUBT", "Overall": "2.0", "Content": "I really wanted to love this camera.  Samsung is one of my favorite electronics manufacturers, and it was at a great price point considering all the features.But I have to say, I am a bit underwhelmed.  Based strictly on the number of megapixels and power of optical zoom, this should be a great camera, but it consistently underperformed a beat up old high zoom Panasonic that I have had for years, that was roughly half the megapixels and half the zoom.In good light without much zoom, it took okay photos, but if you have to push the zoom much, or shoot in low light, it just didn't take good pictures.  I did some side by side shots at night with all the lights on in my living room, with my other camera, and the photos were noticeably worse on the Samsung.  In bright daylight its not as obvious, but I am only a snapshot shooter, not shooting anything I was planing on blowing up anyway, so it might show up if you blew any of these photos up.The manual flash deployment is kind of cumbersome, and something you would expect to be automatic these days, but at this price point, I don't think you can complain too much about it, but it isn't exactly seamless to use the flash that is for sure.Shooting time.  This has to be the worst camera I have had in over 10 years on trying to get it to take a quick photo.  I am not sure if its an autofocus issue or something else.  But whip out the camera, power it up, get an image in the viewfinder, and push the button.  It may eventually take a picture, or you may just be sitting there holding the button down, with no error beep, but no picture either.  I missed a ton of those cute shots where you see something you want to take a picture of and you have to take it in the next few seconds or its gone... well with this camera it will be gone.  Since the camera doesn't turn on with the flash deployed automatically, its not a flash delay (but there is definitely some charging time when you do deploy the flash).  It also doesn't appear to be related to initial power on either, as I have had the camera out and waiting and the shot comes up and you mash the button, and nothing happens on a regular basis.  When it does autofocus, its not particularly quick, and I find that the focus point is wrong more than in past cameras.Buttons, this camera kept getting turned on while inside my jacket pocket, luckily most of the time, I could hear it turn on, before it ran my battery down.  When shooting photos it was easy to  bump any number of button on the back that were not helpful when shooting picturesCase:  The case feels very light weight and doesn't inspire confidence.Internet features.  I really wanted to try a camera that had this feature, in particular, I wanted to be able to back up my photos online when on an out of town or overseas trip, when I can find some free wifi.  Unfortunately it doesn't work really well.  First off several of the online uploads, will trigger fraud prevention even when connecting from home.  If you are at some random coffee shop or a hotel like I was its even worse as just about all of them will trip fraud prevention from a random place like that.  Also I wasn't able to clear the fraud prevention from my phone (using the hotel wifi).  Even after clicking \"Yup thats me\" on the alert emails, I was still locked out of my Google and MSN accounts afterwards, which was a pain to re-enable, and also burned that password which you can't switch back to.So if by some miracle you get the wifi to work, lets use the auto upload feature mentioned in the description.  Well auto upload means going through and selecting individually every photo you would like to upload, which is a painstakingly slow process.  how about just keeping track of what I have already uploaded and ask to upload the rest?  I thought I read somewhere, that the photos that are uploaded to skydrive and google images will not be full resolution photos either, so not really a true back up either.So I got home after having the internet stuff fall on its face whlie traveling.  So I thought I would use the wireless upload to my local computer (very slow even though its local) and that eventually error-ed out with no way to figuire out what was uploaded and what wasn't without doing it the old fashion way.Was any of the wireless stuff useful, yes, I uploaded some photos to facebook successfully.  But if you want to multi select, you can't see the images clearly to determine if these are the ones you want.  You can look at the images one by one and tell them to individually upload, but that eats up a bunch more time and battery as each photo now goes through the connect to the internet, authorize on facebook process in addition to upload.  All photos upload into a directory labeled WB250F, and if you want to go in and do anything to the images like rearrange them, oriented them, add tags, descriptions etc, you better have brought you ipad for that.  But if you brought you ipad in the first place, you probably would be better off downloading them there first, where you can get a good look at them, and change orientation and then upload to facebook through the ipad.So in the end, I think it takes okay pictures in bright light as long as you haven't used all the zoom that they provide.  The wireless isn't useful for what I wanted, but was nice to do a couple of quick uploads to facebook.  While probably still a bargain at what I paid for it, I sort of wanted a bargain that still shot good pictures and had useable features.", "Date": "February 13, 2014"}, {"Title": "No viewfinder and dark screen make for a bad photograph", "Author": "Jeffrey F. Cushner \"Jeff\"", "ReviewID": "R3CN143YQW12UL", "Overall": "3.0", "Content": "It took decent photos.  But, the lack of a viewfinder is its shortcoming.  In daylight, the display is too dark to see what's being photographed or whether or not it's in focus.  I returned it and opted for a Canon power shot a1400, which works much better.", "Date": "November 8, 2013"}, {"Title": "Perfect camera for my needs", "Author": "Randy Thill", "ReviewID": "R5D2PKG9DWCMW", "Overall": "4.0", "Content": "I do tons of micro close up work that needs good color reproduction...every day. I find the camera works better than my high end cannon and my Fujifilm and am now using it all the time. I was a bit disappointed that the wi fi requires a password every time as my router's password isn't an easy one and I cannot change it and still get service, so I just use the cable to transfer images. For the price, it is definitely well worth it...and I recommend you give it a try if you like taking good photos.", "Date": "October 26, 2013"}, {"Title": "Small, but very user friendly", "Author": "steamer", "ReviewID": "R1TC7FR2PDRR2H", "Overall": "5.0", "Content": "Smaller than we expected, but, it does a real nice job and is very easy to use. Battery seems to last a good amount of time and the view window is easy to see. Only complaint, the charger cord is too short.", "Date": "October 22, 2013"}, {"Title": "Great item, if you don't want to carry around a bulky PRO camera...still takes awesome shots, just not at night", "Author": "Gen", "ReviewID": "R36P4QZMO04DA7", "Overall": "4.0", "Content": "Love the wi-fi option! The images are super crisp...some friends thought the pictures from my trip were taken professionally! great videos too! One downside: not so great for low-light(even with the selection of low-light shots) or night time shots!", "Date": "October 7, 2013"}, {"Title": "like it", "Author": "victor barnes", "ReviewID": "R2F39M63S0CH1U", "Overall": "5.0", "Content": "Awesome.  I have decided to go all Samsung. A Samsung smrt tv linked to my S4 and the camera all work seemlessly. I compared other simikar camera that were 399 in price point. This was 1/2. LITERALLY.  I was not sure how this camera would perform. But so happy with it. Fast shoot transfer pic and share. About as much time as txt this on my S 4. I had a Panasonic before with a leica lens. Liked them. But this camera web options and link.  Ooh i can link it to my phone. Have the camera sit on a shelf and zoom and take pic thru my phone.  How kool is that. I m a nerd and this hit my nerd gene. Hope this helps.", "Date": "September 19, 2013"}, {"Title": "Samsung WB250F Smart Wi-Fi Digital Camera", "Author": "Amazon Customer", "ReviewID": "RX7FW0RUD3K59", "Overall": "5.0", "Content": "This camera is one of the best point and shoot cameras I have owned it takes amazing pictures as well as video and the zoom really reaches out there with clarity pretty durable i have owned the camera now for about 3 months or more and have been all over with the camera buy an extera battery just in case the battery life on the camera is really good you can get about 450- 500 pictures in without shuting the camera off before the battery dies maybe 300 with wifi on SD card go with a class 10 or higher to get the best quality from the camera even with a class 4 the pictures come out really well.", "Date": "August 26, 2013"}, {"Title": "Testing in Europe with WB250F", "Author": "David Carlin", "ReviewID": "R28KO2Q7IRH27N", "Overall": "4.0", "Content": "I obtained the camera new just before departing for Paris.  I familiarized myself with the basic settings and video mode, as well as some of the scene modes.  Forgive me if this review is not as detailed, but I will update as I use it more.I already own a Pentax K-5 and usually at home with Manual photography, so this was a simple point and click solution for me.I was surprised the case was plastic.  It does feel cheap on the outside, but it is sturdy.Auto mode works relatively well.  Camera seems to choke upon startup and taking it's first photo sometimes.  I alreadyhad updated the firmware prior.  Picture quality is good.  Lens is nice and captures good wide angle for most scenes.Zoom is sluggish and takes too long to engage quickly.  Also small micro adjustments seem harder to do with zoom....there is a noticable delay in the motor.  Also, in video mode, you can sometimes hear the motor when zooming.I took full HD 1080 video and was very happy with the results.  Quality and color saturation was good.Regarding the WiFi Mode, I think it would have been a far better solution if the camera could be it's own Transmitter to standard wireless rather than just to a smart phone app.  I didn't understand this initially and assumed it could be configured that way.  Transferring just to a phone is not advantageous so wondering if Samsung can re-program this so that it can become a standard SSID for wireless and have a secure ID manually configured.Overall Picture quality is good.  I haven't used manual mode and to be honest, it is much more cumbersome on a point and click camera.....than an SLR which is relatively easy.The scene filters are okBattery seems to be just fine for a full day of use, but beware video.  Video really drains the battery, and quickly.  My tests of shooting mostly bursts of 2-3 minute videos more then halved the runtime.  When you turn it off, it seems to recover about a bar each time, but invest in another battery.  I would dedicate one for video and another just for photos.Also, why did Samsung provide such a short short USB charging cable?  Because of this, you will wind up charging your device from a wall jack on the floor.  Not a good thing.  USB charging through a PC is extreemly slow.  Invest in a seperate charger when you purchase spare batteries.  I just found a good deal for two batteries plus external charger for 20.00.More tests ongoing.11/25/2013Ok I thought I would update this review and bring a few other key points up.Note that this camera will not take raw images.  Both Still Images and Video are only in compressed formatsThat being said, the JPEG compression quality is fine for a point and shoot.  I am still pretty impressed by the quality of the HD video.- Also, about the motor sound that you can sometime hear in the videos, it appears Samsung has an Electronic Audio damper that engages during video to minimize this.It appears to lessen the particular audio frequency that the motor has when in use.  It sometimes does not engage all the time when used and some bleed throughhappens with the motor sound.  If you are taking straight video with the intention of editing it later, it should be of no issue, but if you are filming a musical performance and using the onboard mic then it will be an issue.- Also, no external mic can be attached..........", "Date": "October 4, 2013"}, {"Title": "Great price for the cobalt blue!", "Author": "N. Basaez", "ReviewID": "R236K6F7DCASLP", "Overall": "4.0", "Content": "I bought this camera days before my trip to Ireland. I need a functional camera I could travel with without having to worry about accessories and different lenses. My pictures turned out beautiful! It has different smart modes that allow you to take the best picture for your setting. I didn't read the manual and just started playing with it and found all these fun features and filters. The optical zoom was pretty good for a point and shoot camera and the macro ability was also good. The wifi was the real selling point for me. I was able to transfer pictures to my phone by downloading an app and share my pictures through the different social medias on my phone. The camera itself has the ability to connect to FB and other social medias but I found it tricky to work. Overall the camera met my expectations and I have beautiful memories I was able to capture with this camera. Obviously it's not going to give you quality pics that a professional camera can but for a point and shoot, and for a novice photographer, I am able to manipulate the camera to achieve the pictures I want.", "Date": "August 4, 2013"}, {"Title": "Great camera for a great price.", "Author": "Momof3 \"Loves to buy toys\"", "ReviewID": "R2ZGLUQIZ4QDHO", "Overall": "5.0", "Content": "I bought one of these and since have bought a second one for another family member. For a point and shoot camera, it is a great camera. The photos turn out beautiful. I love the email feature. There are a lot of fun features with this camera too. Thus far, we have had no problem with the first camera. The second camera is relatively new but it seems to be working just as well as the first one we bought.", "Date": "May 23, 2013"}, {"Title": "BAD PRODUCT", "Author": "khon tran", "ReviewID": "R3613K3ULL4B55", "Overall": "1.0", "Content": "I have this camera for 10 months, now the lens are out of focus and can not take pictures and video at all, sent to repair shop for warranty repair and  back in 2 weeks but now not even a month, the camera lens is out of focus again. But this time Samsung stated that the camera was physical damaged ?? so the warranty is voided, I did not drop or doing any thing that damaged this camera except taken pictures.", "Date": "May 26, 2014"}, {"Title": "The WB250F Camera - This Is Truly the Right and Best Buy", "Author": "Amazon Customer", "ReviewID": "R3PD91BFP9OXQM", "Overall": "5.0", "Content": "Though I first read the details and specs for this Samsung Galaxy WB250F camcorder on several websites, as well as the better YouTube reviews, I still needed to see it before I totally believed it. Buying the WB250F on Amazon.com afterwards made this a far less riskier and less costly effort in case I wanted to return the device. Without any doubts or regrets, I know this is totally the best all-around camcorder I've bought in the last 7 years as an avid photographer and videographer for my fine art and journalism projects -- and it's pocket sized too.For me, (compared to similar Nikon, Canon, Sony and Kodak options -- I own a larger Canon camcorder)  this particular Samsung digital camcorder has both the simplicity and wide sophistication I genuinely need for no-hassle high-quality photos and high-definition videos. However, when I need or want to get deep into the weeds of features for complicated projects, the WB250F offers so many other capabilities that help me step-up my game on the final results -- even if I don't use any of my usual special effects PC software and camera apps, much of which is on this camcorder already. I may not end-up using some of this camera's many tools, yet it's still good to have them if I ever needed to use them directly on the device -- especially since I have some documentary projects that I've been wanting to do without carrying any bulky devices. Even using my current external USB connected microphone is a snap when not using the very clear top-side camera mic. I'm also happy to have both the uncomplicated manual buttons and touchscreen viewfinder controls. Simply perfect for setups and live recordings. Yes -- the WB250F has a threaded hole for secure tripod mounting too, which is especially needed for my documentaries and webcasts.The quiet motorized telephoto lens is just perfection for every up-close and distant indoor/outdoor purposes. The WB250F, unlike 99 percent of all other digital cameras, has a very useful tilt-adjustable pop-up flash for my bounce and direct lighting effect needs. BE SURE to buy a small hard case, a Guarmor screen protector, suitable lens cap (fitting the outermost body turret when the camera is not in use), the $20 Square Trade 3-Year Camera Protection Plan (truly TOTALLY worth it), and especially a 32GB or 64GB (80MB/s or 90MB/s) SD memory card for reliably fast content storing and transferring. These five must-haves are for my TOTAL peace-of-mind during extensive project productions, and years of ordinary casual use!My written recommendation could be much longer. So, I'll just finally add that if you're in the market for a truly affordable all-purpose easy to hold and use (plus QUICK TO LEARN) camcorder that's no bigger (but far-far better) than your smartphone (and thick as 3 pencils) and with more tools than most portable camcorders or still photo cameras -- this is really your overall best buy. If you already own a Samsung Galaxy smartphone and tablet like me, then this is Android productivity heaven (though the WB250F is both a Windows and Mac compatible device) when Wi-Fi syncing-viewing-transmitting videos and photos to your e-mail, cloud storage, external hard drive storage, social media sites, websites, or any Windows and Mac PC with or without the WB250F USB power cord. Let me not forget to say that the battery life during extended video and photo taking, as well as Wi-Fi uploading, is beyond acceptable.Truly, this is not just some personal hype of mine, but this quality of handheld camcorder again makes me wonder why my TV or print news friends and associates still need those heavy-bulky-expensive ENG devices anymore -- especially since their news networks or stations are always requesting and USING so much video and photo content from non-professional everyday viewers or sources these days. For my money, just a group of five to fifteen responsible and informed people each with one of these durable WB250F camcorders -- and there's your online global news network. Even an online neighborhood and small town news service, or a one-person streaming and live video website (vlog or blog) with or without YouTube is doable. Think about it. Nearly everyone, from kids to seniors, has a pocket TV-radio-magazine-newspaper (AKA: smartphone, or phablet)! All you need is a WB250F camcorder.Oh yes, in case you had this thought like I did, the HD 1080p videos and photos look and sound spectacular even on my 21-inch PC monitor and 42-inch HD TV screen via Wi-Fi or a USB/AV cord, Since Samsung and others are producing newer and pricier camcorder models for 2014 -- just on principle for my sweet-spot of high quality, long term features, durability, and the reasonable price that I wanted -- the WB250F is still the right one to buy and use without any reservation or regret. BE SURE to download the very detailed (but easy to understand) PDF user manual (English or French) at Samsung's support website (just search: Samsung WB250F user manual PDF), as well as the Samsung i-Launcher Guide PDF for all the obvious, unknown and flexible features built into this digital gem not revealed in most reviews or descriptions. After scanning the 164-page user manual, I know for sure my money was much more than well spent.Of course, thank you very much Amazon for the best low price, easy comparisons, and very quick shipping too!", "Date": "April 20, 2014"}, {"Title": "Does not upload to Facebook.", "Author": "Paul Wheatley", "ReviewID": "R3DZ5QYN91YCOM", "Overall": "3.0", "Content": "The camera is a great little camera at a reasonable price. The only flaw is it does not upload to Facebook. It worked the first couple of times then stopped. After researching this appears to be a common problem. Samsung were less than useless and just blamed Facebook without rectifying the problem.Other wi  fi features work.", "Date": "April 17, 2014"}, {"Title": "A good point and shoot camera -- good value", "Author": "Joe D. Hawkins", "ReviewID": "RTSF969N4QYSZ", "Overall": "4.0", "Content": "In fairness, this camera may warrant more stars -- I have only used it a few times and haven't used most of the features. But of those I have used, I am very pleased with the camera. It's fairly easy to use and takes good quality photos. The WiFi was a really nice feature for backing up photos and/or posting to Facebook while traveling. It's light-weight, compact and seems to have a pretty good battery life.", "Date": "April 6, 2014"}, {"Title": "Excellent camera for the $$!", "Author": "Elizabeth", "ReviewID": "R6QED3BU3YZKJ", "Overall": "5.0", "Content": "We purchased this camera for a Nascar race...the 18x zoom was excellent, and it takes awesome pictures! We loved that we were able to upload our favorite photos via wifi!", "Date": "March 3, 2014"}, {"Title": "Nice Camera Awesome features", "Author": "twidle", "ReviewID": "R3CVF9ZA8P5RTS", "Overall": "5.0", "Content": "This camera has a lot of features your smartphones has, it also has a nice zoom and a nice brilliant touch screen to get to the other settings. The wifi is easy to set up and use to transfer or share your photos or videos to and from your PC, tablets or phones. Get a extra battery and a fast 32gb Sd card and you've got yourself a nice kit to take on vacation.", "Date": "January 1, 2014"}, {"Title": "Dummy point & shoot", "Author": "Candy S", "ReviewID": "R1KBHC3KXEWSRL", "Overall": "4.0", "Content": "I did not purchase this item from Amazon, but Best Buy online during Cyber Monday sales for $129.99. The cost of the item is more relevant than the location of purchase. It's a nice camera at a nominal price. Please note I am not camera savvy. I have not purchased or owned a camera since the camera market was 35mm film dominated, with the exception of cellular phone cameras. My lack of knowledge of camera technology works in favor of Samsung considering I have little to compare. The camera is somewhat idiot proof, provided you read the instructions. I say somewhat because there will ALWAYS be someone to make a liar of that testament. It doesn't require an advanced degree to turn it on and take a picture. The camera is aesthetically pleasing (I have the white with chrome trim). I love the WiFi capabilities. WiFi capabilities played a tremendous part of my decision making. I enjoy the hybrid touch screen. The size is perfect for a pocket or purse person. The body of the camera feels quite sturdy unlike some of it's plastic competitors.I dread the flash! The flash looks cheap and fragile. Do I regret my purchase? Somewhat. Not because I am not enjoying the camera, because I desire more zoom. This camera is limited to 18X optical zoom. I'd prefer an optical zoom 30+, but it's difficult to find optimal zoom of that degree with WiFi and simplicity of use. Honestly, the average consumer does not need most of the perks many digital cameras offer.I'm still learning the device. I'd recommend this camera for users on a budget, especially those with minimal knowledge of photography, who desire an easily accessible, user friend device. If I do decide to upgrade, I may give this device to my teenage daughter. She's an aspiring amateur photographer and she seems captivated by the device. I can give it to her in good conscious being it wasn't that costly.", "Date": "December 19, 2013"}, {"Title": "Great little camera!", "Author": "Roberta Wilson \"Robbie\"", "ReviewID": "RMMIYPEB5QXBM", "Overall": "5.0", "Content": "I bought this to replace a Canon camera- I literally could not take more than 1-2 pictures before having to replace the batteries. It is so nice to be able to pick up the camera when you want just a few shots and actually have it work! I love the touch screen and the fact it has Wi-Fi capabilities, altho I have not figured out yet how to use that. I am still learning. It seems to be a great camera, and takes very nice, clear pictures.", "Date": "December 18, 2013"}, {"Title": "Maybe I just got a bad one...", "Author": "B. Jones", "ReviewID": "R2UCX2OEHTKRDR", "Overall": "2.0", "Content": "I was very excited about this purchase after the price dropped so much and very disappointed when I received it and ended up returning this camera. I only had it for about a week and used it to take photos at a Beyonce concert. The optical zoom is amazing, I was able to get great shoots and you could not tell that I was far away from the stage. My problem with this camera is that it seemed cheaply made and the flash did not work properly. After holding the button down for several seconds and nothing happening I gave up. I later tried when I got home and it finally came up but then would not go down. It just seemed to be stuck. Maybe I just got a bad one and you will not have that trouble.", "Date": "December 17, 2013"}, {"Title": "A beautiful camera that takes great photos!", "Author": "Printed Page \"Printed Page\"", "ReviewID": "R26MWP5C4LJZON", "Overall": "5.0", "Content": "Wow, oh wow!  I LOVE this camera.  (Love the color too.)  It takes great pictures and unlike the Canon ELPH, this is very user-friendly and easy to operate.  I would definitely order again and highly recommend.", "Date": "November 19, 2013"}, {"Title": "Best Camera I've Ever Owned", "Author": "Desirae", "ReviewID": "R3S7ZH71A3661M", "Overall": "5.0", "Content": "This camera did not meet my expectations,  it exceeded it.  Not only was it phenomenal taking pictures at a birthday party but with the excellent zoom it took even better pictures at the maroon 5 concert I took my best friend to for her birthday.  I would recommend this camera to everyone I know but,  don't want them to have the same camera I do.  :-p", "Date": "October 15, 2013"}, {"Title": "Love this Camera", "Author": "Donna \"DeeLee\"", "ReviewID": "R2P9S53Q4GUWO5", "Overall": "5.0", "Content": "I bought this for an up and coming trip however I have been taking pics around the house just to try the camera out. All the features worked as the post said it would and I am really enjoying posting directly to facebook without having to do any transfering of the pictures first. Oh you will need to purchase your own memory card but if you know that in advance you shouldn't have any worries.", "Date": "October 2, 2013"}, {"Title": "Great for casual photography!", "Author": "A reviewer", "ReviewID": "R16818ROZGIHD3", "Overall": "5.0", "Content": "This camera takes great photos!  I bought it to replace a Canon Powershot that just wasn't working that great anymore.  One of the features that really caught my attention was the wifi capability to connect to my smartphone or a wifi network.  Great for sharing photos!  I took the camera on vacation to the UK and Ireland and was pleased by the quality of the photos I took.  Yes, the flash is a little awkward since you have to pop it up to use it and it does seem like it could have the potential to break if mishandled, but that wasn't that big of a deal for me and I rarely need to actually use the flash anyway.  I know there's a lot more I can probably do with the camera, I will continue to explore its capabilities, but for casual photography, it's a great camera and reasonably priced!", "Date": "September 9, 2013"}, {"Title": "Good value", "Author": "allan b.", "ReviewID": "R2P7HRYMU67H1O", "Overall": "4.0", "Content": "Nice pictures and the wifi feature works well. The instruction booklet is poor and does not adaquately explain how to operate the camera. It took me a while thru trial and wrror", "Date": "September 4, 2013"}, {"Title": "Samsung WB250F Smart Wi-Fi Digital Camera (Red)", "Author": "eclectic", "ReviewID": "R2M2SOC8222FUP", "Overall": "5.0", "Content": "Takes awesome pictures. i like the fact that besides the dial mode (which is hard for me to read especially in low light situations) you can access menus through the touch screen.", "Date": "August 21, 2013"}, {"Title": "The camera flash button it's not working properly.", "Author": "bella", "ReviewID": "R35FDQQXX5O8K1", "Overall": "1.0", "Content": "The camera flash button it's not working properly. I need to press the button too many times in orden to open it and that problem will cause the flash get stuck soon or later. I feel very unsatisfied with the product. I can't believe that is a samsung product.", "Date": "May 27, 2014"}, {"Title": "Broke within one month", "Author": "hope hanks", "ReviewID": "R2NZ98TNOWWTXU", "Overall": "1.0", "Content": "Used it 3-4 times then lens cover quit opening;  had a warranty that I bought with it but the fine print (although coverage starts at purchase) says it has to go thru manufacturer first (so why did I buy extra warranty?)  Cannot find a contact seller button to discuss matter so now I am stuck with 1 month old broken camera.  Good luck if you buy one.", "Date": "May 27, 2014"}, {"Title": "Just as advertised", "Author": "Yolanda", "ReviewID": "R30AGQVDFM4366", "Overall": "5.0", "Content": "I love that the camera Is compact, but still has a great zoom.The pictures are crisp and clear.It is everything I expected.", "Date": "May 27, 2014"}, {"Title": "Unpredictable photos", "Author": "W. Paulsen \"bp\"", "ReviewID": "R1MWJKO2QY50MU", "Overall": "2.0", "Content": "I've had this camera for about 6 months and I've tried many settings but the quality photos are all over the board, with lots of clunkers that cannot be saved.  In the same scene, some photos are excellent but many out of focus or fuzzy because the exposure is off.  I even tried setting it to Program mode (not automatic) and also setting it to iso 1600 but simple photos are often out of focus even in good lighting.  And the pop-up flash is annoying to use.", "Date": "May 26, 2014"}, {"Title": "good but not great,price is good", "Author": "Meng Li", "ReviewID": "R2UAN23LFD4FR4", "Overall": "3.0", "Content": "use 18x to take photo,quality of pictures are soso,for this price how can you ask more,easy to take photos.light,easy to carry around", "Date": "May 25, 2014"}, {"Title": "Easy to use", "Author": "Jeffery D. Skinner", "ReviewID": "R1QA3FIK83PNBY", "Overall": "5.0", "Content": "This camera is better than any that I have bought in the past.  It is easy to use, takes great pictures and is fast at taking photos one after another.  Battery life is decent also and with a full charge it hasn't died on me yet, even going to the zoo taking a lot of pictures.  I would recommend this camera to anyone who wants a good camera, at a decent price that takes great pictures and is easy to use.", "Date": "May 22, 2014"}, {"Title": "GREAT CAMERA - FOOTAGE LINK IN REVIEW", "Author": "Skynet SMiZ", "ReviewID": "R2UQSAEWTYJM4Y", "Overall": "5.0", "Content": "Purchased this used, and I can't even tell it wasn't new.This white camera is a head turner. Responsive touch screen, crazy far optical zoom.Records sound great, and take awesome photos in low-light, and bright situations.Sync this camera to your phone via Wifi, and have the photos sent right to your device.See this camera in action at YouTube.com/thasmizofesv", "Date": "May 21, 2014"}, {"Title": "Like it", "Author": "aurea", "ReviewID": "RBL5M04V8IEZT", "Overall": "4.0", "Content": "The pictures are really clear. I starting to love this camera especially when taking pictures in low light situation. I definitely will recommend to people who likes very handy camera and getting nice pictures", "Date": "May 12, 2014"}, {"Title": "Excellent", "Author": "Visa \"JacPot\"", "ReviewID": "R1LDR04A9Y4HY6", "Overall": "4.0", "Content": "I have had so much fun takeing piectures and sending picture to facebook with this camera.  It was an excellent choise for me.", "Date": "May 11, 2014"}, {"Title": "Loved my Samsung wifi camera", "Author": "Sonia Villa", "ReviewID": "R39U66HGV1RSBJ", "Overall": "4.0", "Content": "I loved it! Was able to email and post photos on FB right from the camera. Also really like the clarity and special fx in the camer", "Date": "May 11, 2014"}, {"Title": "Decent camera and a good price point", "Author": "Woodmeister", "ReviewID": "R2TEAIG948U8HQ", "Overall": "5.0", "Content": "I do like this camera very much. Better than a basic point and shoot. Samsung quality, lots of options, auto PC backup function is sweet, uploading to cloud drive is piece of cake. Only thing that has really been an issue is the Samsung link program has some bugs and issues that still need to be worked out. I just use the cloud drive upload function instead, that works for me. The other thing I noticed that when I first installed an SD card it seemed to have an issue recognizing it and had to remove and reinstall, that happened for about the first week every time I turned it on, but that seems to have subsided now. Not sure if it was a card issue or camera issue so cannot knock it for that. Lots and lots of options, manual settings available, touch screen works better than I was expecting, flash is decent. Take the time and download the manual and actually read it, you will be much happier. Yes I would buy it again or as a gift for someone. Good value, good product. Register it online with Samsung and add 3 months to your warranty. Happy shooting!", "Date": "May 10, 2014"}, {"Title": "Great Camera", "Author": "Kim Levesque", "ReviewID": "RM65C0UKC7MXV", "Overall": "5.0", "Content": "It takes great pictures! We were driving on the highway and I took some pics, and it looks like I was just standing there taking them. The zoom work well also. Good camera for a great price!", "Date": "May 3, 2014"}, {"Title": "Great camera", "Author": "AlanK", "ReviewID": "RYR07GNUD1A8N", "Overall": "4.0", "Content": "Easy to use. Cant believe one can get so many  features for such a low price. Still learning it. I cant sync with samsung apps on ipads or iphone os7.  I took off one star for this reason", "Date": "April 17, 2014"}, {"Title": "Easy to use", "Author": "Jeff Van Domelen", "ReviewID": "R364HLHZXIO2AG", "Overall": "4.0", "Content": "Good value. Lots of special effect settings I will never use. The one that I could really use that it does not have is halftones, for screening a picture, say to reproduce on a copy machine.", "Date": "April 14, 2014"}, {"Title": "very good", "Author": "B. Aronna", "ReviewID": "R23YN782J8GM79", "Overall": "4.0", "Content": "It has exceeded my expectations.The battery is the weakest point in this camera. It DOES NOT hold up to the expected 300 pixs. The charge does not last for more than 170-180 and it drops totally quite suddenly.Colour rendition is outstanding; so is ease of use", "Date": "April 13, 2014"}, {"Title": "Not Bad", "Author": "Joey", "ReviewID": "RRKR43T0QRAJS", "Overall": "4.0", "Content": "It has a great 18X optical zoom and 90X digital zoom.The color is a bit dull, but it's fine if you have a software to adjust it.", "Date": "April 7, 2014"}, {"Title": "Okay camera", "Author": "Monnie", "ReviewID": "R3O4U66WFSYOTM", "Overall": "3.0", "Content": "I bought this for my wife as a Christmas present since her other camera broke.  It has a ton of cool features, which I'm sure you've already read about them all, such as sending pics to Facebook, etc.Perhaps we haven't played around with the settings enough, but the pictures that we've taken with the camera don't seem all that great.  To be quite honest, the picture quality seems almost on par with some of the newer cellphones.  But I will fully admit we haven't had the camera that long, and perhaps we are using the wrong setting or something.  Just seems like the picture quality would be a lot better for a camera like this.", "Date": "April 5, 2014"}, {"Title": "Awesome Camera A Awesome Price", "Author": "DAVID NICHOLS II", "ReviewID": "R81LMZEA7IHHX", "Overall": "5.0", "Content": "Honestly one of the nicest cameras I have owned. It meets and exceeds expectations. Interesting to note that the direct mode does not require a WiFi router to connect to your mobile device for remote viewfinder or transfer.", "Date": "March 29, 2014"}, {"Title": "Great Camera", "Author": "Heather Hollander", "ReviewID": "RQ405GULTE8N", "Overall": "5.0", "Content": "So far nothing has changed my mind on this. LOVE being able to take video and pictures of certain shots of the video.", "Date": "March 28, 2014"}, {"Title": "I found connecting up to wifi easy. If you want to transfer photos directly to ...", "Author": "Gasmike91", "ReviewID": "R3OWPAEUGPG57M", "Overall": "5.0", "Content": "I bought this camera to replace my Panasonic Lumix camera that had  been accidentally dropped onto a hard surface with the lens extended, needless to say the camera was broken and probably would cost about as much to repair it as to replace it. I wanted something with alot of bang for the buck, researched  using Consumer Reports.org and CNet reviews. Settled on this camera for having  a decent zoom 18X  and wifi, 14.2 mps and it has a touch screen which I find comes in handy and my Lumix had this feature as well.  I found connecting up to wifi easy. If you want to transfer photos directly to a tablet or a smart phone even when your  away from wifi  you can still do it. You need to have the Samsung camera app installed on your  device 1st, startup the wifi software on the camera, select the shown ip address on your tablet or  smartphone in the wifi panAl and  then you caan transfer from your camera to your device. I paid about $133 for  this camera and it came in a factory sealed box,  not a refurbished item. Very  happy with my purchase.", "Date": "March 27, 2014"}, {"Title": "love it", "Author": "Dawn B.", "ReviewID": "R382R4KH24HYRZ", "Overall": "5.0", "Content": "I have had this camera a few weeks now, and I love it. the way you can zoom in on a subject is amazing. And since Ive gotten this camera I've had 3 people ask me what kind of camera it is because they love the pictures.", "Date": "March 27, 2014"}, {"Title": "Looooove it!!", "Author": "Toya", "ReviewID": "R2D0E4CTS4U4MB", "Overall": "5.0", "Content": "I am in love with this camera! I couldn't wait so I went to Best Buy and to my surprise I got the last one as an \"open box\" purchase for cheaper than it was originally listed for so win-win for me!! I love the cool new features this thing does and I love that I can use wi-fi to load my pictures on Facebook so quick and easily using my smartphone!  This camera is one of my favorites I've ever owned and I will definitely use it for every occasion! I would recommend this to someone who enjoys taking pictures and capturing memories with kids and family! :)", "Date": "March 25, 2014"}, {"Title": "good things come in small packages", "Author": "tina he", "ReviewID": "R18JYL8GD54ZZH", "Overall": "5.0", "Content": "we purchased this camera for our 3 week vacation to New Zealand for Christmas 2013 and we were amazed by the quality of the pictures and all the different features. The best part is we could upload right to social media without fighting for the laptop!! major score!!!", "Date": "March 16, 2014"}, {"Title": "More than satisfactory", "Author": "Amazon Customer", "ReviewID": "R19BM99GX0P7I0", "Overall": "4.0", "Content": "Photo and video are excellent for this price range camera.  It is compact and well suited for traveling.The controls are not placed to my liking, especially the on/off and the mic and speaker.  Getting to some of the more common functions takes some studying. Sending email is somewhat clunky and takes some getting used to and the keyboard could use some improvement.  The compartment door for the battery and SD card is pretty flimsy and would seem to be at risk.All-in-all, I would recommend this camera.", "Date": "March 16, 2014"}, {"Title": "14 MG Pixels wow", "Author": "marylea ostle", "ReviewID": "RWCZ061BEDBLC", "Overall": "5.0", "Content": "This little camera packs a punch it is way better than my Nikon SLR D100 with just 5 MG pixels the only think you have to remember is to speak up for the volume and have plenty of light for the subject you want to film in a video. Videos have to be connected to the computer to be uploaded", "Date": "March 11, 2014"}, {"Title": "I'm picky about photos -- photo quality is worse than some cell phones", "Author": "Yarii", "ReviewID": "R4DP97E19F2Y4", "Overall": "3.0", "Content": "After my first Sony WX300 was accidentally dropped by a friend, I opted for this Samsung since it also had wi-fi and was cheaper than a replacement Sony. I'll be honest; I read many professional reviews online for the WB250F and most said this produced photos no better than a cell phone.....and I blew those reviews off as more than likely being too picky and/or not knowing what they were talking about.Those professional reviewers were right. The photos produced by this camera are NOT that great. They aren't sharp enough and the colors are dull even on the auto setting. This camera produces better videos than photos. I'd rather spend more money and get better photo quality since that's what I've been used to getting.Besides the crummy photo quality, I also thought the power on/off button was a little too sensitive or maybe in the wrong location as I turned it on twice by accident while trying to put it in my camera case.It's an easy camera to figure out - the touch screen is responsive and the wi-fi is easy to set up. It is quick to focus and fast to write to the card to take the next photo as long as you use a Class 10 SDHC card. I liked the manual pop-up flash too.This was returned and I purchased another Sony WX300. Sony DSC-WX300/B 18.2 MP Digital Camera with 20x Optical Image Stabilized Zoom and 3-Inch LCD (Black) Yes, the Sony is about $100 more than the Samsung but photo quality is very important to me.", "Date": "March 3, 2014"}, {"Title": "GREAT camera!", "Author": "CMac -Amazon Addict!", "ReviewID": "R10EGCOTRMADII", "Overall": "4.0", "Content": "What a neat little gadget! I was looking for a Pocket camera, with a great zoom, and I found it in this little wonder! With a phenomenal zoom, and its touch screen menu - there are no limits to creativity and art inspired moments with this camera! My ONLY thought is that the camera takes a bit of time to get the zoom into focus. I have not taken any burst mode shots yet, but the auto intelligent mode, seems to be a little sluggish in focus time. If that is my only problem for such a tiny package, I think I'm doing okay, as the price and features are full on with this little guy! I'd buy it again, and certainly suggest it to friends!", "Date": "February 25, 2014"}, {"Title": "Picture perfect", "Author": "Ann O'Lone", "ReviewID": "R2F6ZD75GR6LZA", "Overall": "5.0", "Content": "Camera takes good pictures and is very easy to use.  The connectivity is seamless.  The anti-shake feature is quite helpful when trying to make sure of your pictures focus.", "Date": "February 21, 2014"}, {"Title": "Nice camera", "Author": "R. McGuire \"mrbert\"", "ReviewID": "R2FDAE5ID58M7O", "Overall": "5.0", "Content": "Very good camera and connectivity to my phone and home Wi-Fi.  Enjoying and still exploring all the features as I learn to use them.", "Date": "February 20, 2014"}, {"Title": "remain very satisfied", "Author": "Omar", "ReviewID": "RK9W78MXC8JRX", "Overall": "5.0", "Content": "A great camera for users who do not want complicated, attractive photographs and get access them or share them through your phone or tablet computer. very good sharpness, beautiful photographs. remain very satisfied ..", "Date": "February 18, 2014"}, {"Title": "love it", "Author": "windi kingbewe", "ReviewID": "R27F27T9HPI6J3", "Overall": "4.0", "Content": "the zoom is really good! the flash also.I like the quality and the shape of this camera, neither too big, nor too small, it has a perfect size.the quality of the pictures also are good, you can edit pictures.", "Date": "February 11, 2014"}, {"Title": "Excelente", "Author": "Diego", "ReviewID": "RA1TAABVBVTZB", "Overall": "5.0", "Content": "I seemed a wonderful camera. Very good easy to use design pictures are very good quality and best of all a low price.", "Date": "February 4, 2014"}, {"Title": "great price fast shipping", "Author": "michael hriciso", "ReviewID": "R2WF5JM906WNGA", "Overall": "5.0", "Content": "great price and fast shipping, the camera is easy to use and looks great, I already ordered a memory card for it and the picture quality is amazing.", "Date": "February 3, 2014"}, {"Title": "great camera", "Author": "Cathleen M.", "ReviewID": "R26EPJAER9A5K3", "Overall": "5.0", "Content": "love this little camera, takes great photos and very easy to use and post pictures on line. i would buy again.", "Date": "February 2, 2014"}, {"Title": "Awesome Camera", "Author": "James Burnett", "ReviewID": "R341S8Q8G52TVK", "Overall": "5.0", "Content": "Love our new camera so far. The zoom is great, love the wifi and touchscreen capabilities. Samsung did not disappoint.", "Date": "February 2, 2014"}, {"Title": "Wow just can stop use! :)", "Author": "Jade", "ReviewID": "R1Q4YPK4128FNP", "Overall": "5.0", "Content": "Work great,the price is on believable. Recommend to anyone!!!!!!!!!!!!!!!!!!!!!!!!!!The picture quality is great even in low light place,very easy to connect and share once there is a wifi spot", "Date": "January 10, 2014"}, {"Title": "Great Camera", "Author": "ken1042", "ReviewID": "RHXPPNMSTF4J4", "Overall": "5.0", "Content": "Takes terrific pictures and videos.  Many extras included in the camera.  Well worth the price.I would recommend this item to anyone.", "Date": "January 10, 2014"}, {"Title": "Love it", "Author": "Barbara Irvine", "ReviewID": "R2P6Q1RIHR8WFK", "Overall": "5.0", "Content": "I got this camera for my son's Xmas and asked him to rate it.  It appears to have exceeded his expectations and he is delighted with it.", "Date": "January 9, 2014"}, {"Title": "I love this camera!", "Author": "Randi S. Klein \"Esquire1\"", "ReviewID": "RN250N4F2KZ6O", "Overall": "5.0", "Content": "A friend of mine, who is in the business of selling cameras and camera equipment, suggested that I buy this camera. He told me I would fall in love with it, and he was right!First, I love the way the camera looks! I love the red color. Next, I love that I can instantly enlarge photos I have taken, and adjust the width and length of the pictures, right on the spot. That feature is not present with all digital cameras.There is so much more to learn about how to use this camera. I look forward to that learning process. This camera makes it fun!", "Date": "January 7, 2014"}, {"Title": "Excellent point and shoot for the price", "Author": "D. A. Paulon", "ReviewID": "R2M41PV3L6HBHK", "Overall": "5.0", "Content": "I would have given the WB250F 3.5 or 4 stars based on its original retail price of $249 which would have been in line with the expert reviews.  However, at its current price around $129, the camera rightly deserves a 5 stars.  There is not a point and shoot camera on the market that can match the WB250F with all of its features for the price.Is price important?  Well, I would say absolutely if the quality is there.  For example, you can spend $698 on a Sony M100 II with a better sensor and lense, but that is a whopping $569 more than the WB250F.  Would most amateur photography tell the difference?  I doubt it, since for the most part, the Samsung WB250F takes excellent pictures.  This was the main criticism stated by the experts; the picture quality was a bit soft.  I have found no such problem.  The pictures are accurate and in focus.  There is a tendency for indoor shots to be a bit dull (faded) in color but  outdoor shots are fully saturated and crisp.What makes this camera a stand out are the features found in no other camera at this price point and they work.  I don't have a smart phone, but I did send pictures via WiFi to various email accounts with 100% success  Also, you can back up your photos on a laptop or other WiFi devices.The touch screen is outstanding with easy to understand instructions.Samsung has been in the electronics business for a long time, but I was a bit skeptical about its camera quality over my ZS5 Panasonic and Nixon D70 both of which I own.  I would honestly say, the Samsung WB250F holds its own in quality and exceeds both in features.", "Date": "January 6, 2014"}, {"Title": "love it", "Author": "Melissa Booth", "ReviewID": "R12OAZ5MLDEZ3G", "Overall": "5.0", "Content": "This camera is definitely a good bargain.  It has all of the features of a modern camera and also has built in wifi and has some cool features like the best face feature!!!!", "Date": "January 3, 2014"}, {"Title": "Great for my use :)", "Author": "sbadam", "ReviewID": "R1IQKLRR3SCCZ1", "Overall": "5.0", "Content": "Very easy to use and the picture quality is very neat. Happy with the product. Meets my expectations of a simple and easy on the go to take pictures", "Date": "December 31, 2013"}, {"Title": "Nicest Camera I've ever owned", "Author": "Gordon S. Ferris", "ReviewID": "R1DI14L4AO42C1", "Overall": "5.0", "Content": "This is a very well made camera the build quality is great. It's very easy to set up and takes great photos. I haven't used the Wi-fi feature yet but I plan to try it out very soon. I like the touch screen and the 18X zoom will be perfect for the landscape shots I like to take. For the price it's hard to go wrong with this camera.", "Date": "December 25, 2013"}, {"Title": "Love it", "Author": "Nichole", "ReviewID": "R23O5KWR662R3U", "Overall": "5.0", "Content": "My husband just bought me this camera as I did not want to haul my DSLR and all its lenses to the hospital when I deliver my second child. I have been playing with this camera for a while since getting it. NO flaws so far!", "Date": "December 22, 2013"}, {"Title": "99% of pictures are blurry", "Author": "Mandy Canterbury", "ReviewID": "R3BU7WNQEZRNEN", "Overall": "2.0", "Content": "this is my first \"advanced\" digital camera, as i'm used to the $70 point and shoot canons. i'm still trying to get used to it, and it has many fun settings. however, i got it to take mostly inside pictures of my daughter playing. the action shot setting in inside lighting doesn't allow me to use the flash and is extremely dark photo. i had a professional photographer friend help me out with it, and she didn't understand why it won't allow a flash on most settings. the only setting i've found that does great pictures is the beauty setting, and that's only if i get lucky when everyone is sitting still. i've played around with shutter speeds, and everything else i could think of, not being able to get a good clear action shot inside. this camera may be too much blur for my liking. i'll try it a couple more days, but it seems to be looking more like returning this and going back to the cheaper canon. of course this is just my opinion, and might be more of \"it's not the camera, it's the user\" issue, but for anyone else like me that doesn't know too much about cameras and want to use for the same purpose, i'd reccomend to keep looking,", "Date": "December 10, 2013"}, {"Title": "Flimsy flash", "Author": "Catherine", "ReviewID": "R2CCEO0J2CZRJK", "Overall": "4.0", "Content": "I purchased this for my daughters birthday, seller shipped quickly, the quality of the pictures is great. She is thrilled with the Wi-Fi feature, I am concerned with the flash it comes up quite easily but you have to manually push it back in, flimsy.", "Date": "November 15, 2013"}, {"Title": "Love it", "Author": "Regina Sabia", "ReviewID": "RBXD5ZD404T4F", "Overall": "4.0", "Content": "The best camera is the one u have with u and this is small enuf to take anywhere.  Great pictures but gave it a four because the opening and closing of the lens absolutely eats the battery time.  Make sure u have an extra battery with u.", "Date": "November 15, 2013"}, {"Title": "Fragile Flash?", "Author": "Red", "ReviewID": "R1U16YMYW0F2EM", "Overall": "4.0", "Content": "Great camera, takes amazing pictures... My only complaint is I feel like I'm going to break the flash portion off by not remembering to close it.. Should have done my research as this probably isn't the best camera for me", "Date": "November 13, 2013"}, {"Title": "Easy to use with great zoom", "Author": "Nicki Troia", "ReviewID": "R3T2K4PBPU91UO", "Overall": "5.0", "Content": "easy to use; choose control using buttons or touch screen; amazing zoom - took some great shots at Hoover Dam.", "Date": "November 6, 2013"}, {"Title": "great wifi enabled device.", "Author": "Angela S.", "ReviewID": "RKWC93WFHXWT6", "Overall": "5.0", "Content": "Great point and click camera with quick wifi upload. We used this on our trip to France and captured wonderful memories.", "Date": "November 5, 2013"}, {"Title": "Great Price SAMSUNG Digital Camera", "Author": "Mike2so  Silicon Valley Native", "ReviewID": "R1XIWEDHEGFW8D", "Overall": "4.0", "Content": "I love this camera. It's a great in your pocket camera and better then any Phone camera. You can do what you need with it as long as you have Battery life. So make sure you invest in a extra one. these come with special small batteries that are not cheap but it's worth it anyway. Video is real HD good. lot's of settings.", "Date": "November 3, 2013"}, {"Title": "very good product", "Author": "ALEXIS JESUS IZQUIEL MASABE", "ReviewID": "RNW86S2YZRFSQ", "Overall": "5.0", "Content": "I loved the product they recommend the videos the photos are spectacular and the zoon not disappoint, guaranteed.Keep in mind that is as easy to use", "Date": "October 31, 2013"}, {"Title": "great camera for price", "Author": "Lindsay M. Beyer", "ReviewID": "R8SPE8RC7JPV8", "Overall": "5.0", "Content": "Awesome camera for under $200.00. Good value for a novice photographer. Camera has really good zoom for the price of it.", "Date": "October 29, 2013"}, {"Title": "Great camera!", "Author": "Greg R Rice", "ReviewID": "RF1YGIY62663A", "Overall": "4.0", "Content": "Great camera for the money. Took it to Arizona on a trip to Monument Valley and the Grand Canyon. Got some amazing shots.Camera came with a very limited instruction booklet. I am still trying to figure out how to download pics to my PC.", "Date": "October 23, 2013"}, {"Title": "Best one yet", "Author": "Carol McClure", "ReviewID": "RN7RZ29TMOFD4", "Overall": "5.0", "Content": "This has been the best camera I have owned for shooting video. Takes great stills as well. It definitely does not disappoint.", "Date": "October 22, 2013"}, {"Title": "Great Camera!", "Author": "tammy telleen", "ReviewID": "R3NMSJOZH5JGR5", "Overall": "5.0", "Content": "I love Samsung.  This is my 2nd camera I bought thru Amazon. Best prices!  Easy to use.  Best picture and video.", "Date": "October 21, 2013"}, {"Title": "Best Point&Shoot; I've every owned!", "Author": "JonandDiane", "ReviewID": "R26CY7CJ1AWS4", "Overall": "5.0", "Content": "I bought this camera for 2 reasons: megazoom & improved low-light performance specifically for shots on our honeymoon at Burning Man.  It vastly exceeded my expectations on both fronts!  Daylight images seem to take a little tweaking for color once home, but are still very impressive.  This is one very satisfied customer!", "Date": "October 7, 2013"}, {"Title": "Speechless", "Author": "Danteandroid4life", "ReviewID": "R1DAD9HWG26DTH", "Overall": "4.0", "Content": "I love this damn camera. I didnt take any pictures yet but the video side i use for a 4 hour recording. OMG.. This camera do everything  I need it to do but one thing. The wifi upload to youtube is limited. small files only. Overall I love this camera. Samsung did it again... Forget DSLR. Im going with a WIFI wireless viewfinder... Amazing!!!", "Date": "August 25, 2013"}, {"Title": "Impressed", "Author": "Amazon Customer", "ReviewID": "R2Q24D1IXTCS70", "Overall": "5.0", "Content": "I bought this for a recent trip to NYC.  I usually shoot with a DSLR and so am not typically impressed with point and shoot photos.  This camera, however, does an excellent job.  The pictures were clear, sharp, and had rich color quality.  It also did an impressive job of taking night shots using 3200 ISO.  Both noise levels and graininess were comparable to a lot DSLRs.  The wireless feature also made it easy to back up photos to my tablet during the trip.  I must admit I'm not really into the touch screen feature but was glad to see that features can be accessed through regular menus so your LCD doesn't have to be covered in smudges.  My only concern in the pop-up flash.  It feels very flimsy, and I don't think it would take much to break off.", "Date": "August 24, 2013"}, {"Title": "Great camera", "Author": "Perry Carmichael \"pc\"", "ReviewID": "R19YOC1WML3GY", "Overall": "5.0", "Content": "I got this for my wife because the old Panasonic that we have had for years is slow to focus. This camera is much faster to focus and allows her to take puppy pictures easily in the house where the light is low. Pano stitching work great and is fun to use, size is nice and form works well in our hands. Just a nice all round camera that I would get again if needed.", "Date": "July 25, 2013"}, {"Title": "Best Camera", "Author": "Susan M.", "ReviewID": "R3HCGZQS2NB51H", "Overall": "5.0", "Content": "I love my new Samsung camera!! It takes the most amazing pictures and the 18X zoom is fantastic. When taking pictures at a concert, the zoom capability makes it seem like we were in the first 10 rows!!!!", "Date": "July 23, 2013"}, {"Title": "Easy to use", "Author": "Rose I", "ReviewID": "R13EJXO0A45EFV", "Overall": "5.0", "Content": "I took this camera on a trip to Europe and it took wonderful pictures.  I didn't get to try many of the settings but look forward to experimenting with them now.  Certainly easy to use with touch screen and easy to follow directions on the camera.", "Date": "July 23, 2013"}, {"Title": "Great camera", "Author": "Paula Aguirre", "ReviewID": "R16Y5HM7HUIN7Z", "Overall": "5.0", "Content": "Exactly as described, works perfectly! Just love it! Took it for a trip ti disney with the family and it just surpassed. My expectations. Thanks a lot!", "Date": "July 15, 2013"}, {"Title": "Inexpensive but not a keeper (for me anyway)", "Author": "T. Nelson", "ReviewID": "RSPJYWGWI47J5", "Overall": "3.0", "Content": "I had this camera a few days and it was OK but not great.  I did some side-by-side tests with an old Sony DSC HX5V and printed the results.  In some cases the Samsung pictures were a little better, in some cases a little worse.  I didn't have a single picture that made me say \"Wow, that's a great picture!\"I was hoping that even though it's a cheaper camera, the fact that it was 3-4 years newer than the Sony would have resulted in better image quality.  In general it did not.Some pros:The WiFi features are cool and are the real reason I bought the camera.  They generally worked although YouTube blocked connections from this camera as \"suspicious.\"  I had the same issue with a Blu Ray player that had YouTube connectivity.  Google is apparently pretty aggressive in blocking connections that don't come through a browser.Some cons:The flash button is fiddly.  Sometimes it took several hard presses to get it to pop up.  The auto-focus can be really slow, sometimes even in good lighting.  On numerous occasions it wouldn't lock focus at all, even outside during the day.  That prompted me to return the camera.On returning the camera, I ran into an issue.  All your personal logins -- email, Facebook, YouTube, WiFi, etc. -- are permanently stored in the camera.  Doing a reset from the settings menu erases the WiFi login but nothing else.  I contacted Samsung customer service and the rep told me there was no way to erase them.  I asked if there was a way to do a factory reset and he said \"no.\"A few days later I contacted Samsung again and got directions from a different person.  In case you ever need them, here they are:1. Power up the camera. Set the dial to Auto as if you were going to take a picture.2. Zoom to the widest setting, then press the shutter button simultaneously for a couple of seconds.3. Power off.4. Power back up to confirm your settings are deleted.This will erase all your login info (facebook, email, etc.).  You will still need to erase your WiFi password.  To do this, set the dial to \"settings\" (the gear icon) and there is a \"reset\" option in the menus.  This will delete your Wifi password.Inconvenient, but ultimately it all worked out OK.So...the camera is cheap but the performance isn't very impressive.  Maybe good for some but it didn't meet my particular needs.", "Date": "January 10, 2014"}, {"Title": "Good Camera on a Budget", "Author": "Jore", "ReviewID": "R2GHSOZAA39H3I", "Overall": "4.0", "Content": "I wanted a camera that I could take with me when I don't feel like taking my DSLR. I had a Sony DSC-WX50 and loved it but misplaced it when I moved and was heading on a trip so wanted to get something to take with me. I own Samsung TV's and our cell phones/tablets are Samsung and even our fridge is Samsung and love them so decided to take a chance on the the WB250F. The fact that it had wifi capabilities was a selling point for me. Being able to instantly transfer pics to our phones and tablets was great. I can even instantly view pics on my TV. Technology nowadays is just overwhelming sometimes. Anyhow, the camera takes great pics except in low light. Maybe 5 out of 10 pics in low light are good. When there's ample light the pictures are great however. The outer shell is made of plastic which was expected with Samsung products but it does feel solid. It is a little bigger than most compact cameras. Battery life is not great but decent. My Sony DSC-WX50 and my DSLR can go alot longer before needed charging. I think the battery drains alot faster when your using the wifi.Overall the this camera is good for the price. I was just looking for something small to bring occasionally instead of my DSLR and this fit my bill. Its not the most advance point-and-shoot but for the wifi capabilities and great pics (not low light), I recommend. The low light picture quality and the battery life was the reason for only 4 stars, otherwise I would have given 5.EDIT 12/30/13: The low light picture quality bothers me a bit. I guess I'm just so used to DSLR low light quality. Overall its a great budget camera with wifi capabilities. I've decided to return this however and spend a little more for to get a camera with excellent low light images. I do still recommend this.", "Date": "November 24, 2013"}, {"Title": "Nice camera; no owner's manual", "Author": "lyfeizgude \"Scotty\"", "ReviewID": "R1INOLUZC8N3W", "Overall": "4.0", "Content": "I like the camera, with one \"but\".  It takes clear pictures, the zoom is good, the cropping feature is handy, and it's nice and compact.  The \"but\"?  But, it does not come with an owner's manual, only a quick start guide which does not come close to explaining the finer details of the camera.  You can see the manual online (rather impractical when you're out and about), you can print your own (over 160 pages), you can buy one ($42 dollars), or you can sit on the beach and fiddle with the thing until you figure out what you need to figure out (maybe).  So, I think you'll like the camera, but I don't like the fact that it does not come with a manual.", "Date": "November 22, 2013"}, {"Title": "Samsung WB250F Camera", "Author": "Gillian Eastwood", "ReviewID": "R14D16SNVCX22B", "Overall": "2.0", "Content": "I've had numerous problems with this camera.It can take some nice photos however overall it seems shoddily put together and the housing is weak, sometimes to point that the flash is obstructed and doesn't always pop up when needed.Slow to view photos.The lever holding the battery in place broke within the first 2 months.Great zoom but only if you can keep it perfectly still or have a tripod, otherwise very easy blurred and you can rarely zoom out beyond x5", "Date": "October 7, 2013"}, {"Title": "Camera has glitches", "Author": "MICHELLE D.", "ReviewID": "R2F7DWYVMIJU3G", "Overall": "2.0", "Content": "The first WB250F I ordered started off working fine.  I took it on a weekend vacation to test its functionality ahead of a big trip to Hawaii.  I'm glad I did because after a day I had problems with the camera.  It froze up when trying to switch between modes and if I turned it off then back on, it would automatically take a picture.  I returned it without hassle and ordered a second version.  I had decided to return it as well because the on/off button on the top of the camera is so sensitive, it turns on in my purse and the battery runs down.  Disappointing because the picture quality, pricing, and size of camera were just perfect.", "Date": "October 3, 2013"}, {"Title": "Samsung WB250F - great camera", "Author": "Cathy S \"Cathy\"", "ReviewID": "R1R32WV486HCXZ", "Overall": "4.0", "Content": "This camera replaced a Sony HX9V that became unusable and unrepairable during normal use. Shame on Sony.  The Samsung WB250F is very easy to use and has good button placement and easy menus. The manually popped up flash is not an issue as the Sony auto pop up flash was very unreliable. I have taken great pictures of the moon in manual mode without a tripod. I especially like the grip for one handed photographs. The Auto Backup is nice to save photos into my PC over WiFi. The long optical zoom brings things right up \"close and personal\". The colors in all my photos and videos have come out very natural and appears exactly what I see with my eyes.", "Date": "September 22, 2013"}, {"Title": "Excellent choice!", "Author": "Maine IT", "ReviewID": "R233MU9LZ5X5SL", "Overall": "5.0", "Content": "An excellent choice for someone who wants a basic camera with great quality pictures.  I use it for telephoto shots of birds and animals and it does not let me down.  People who have seen the pictures frequently remark on the clarity.  Samsung does not emphasize enough that the optical 18X  and the digital 5X yields a 90X telephoto.  Although at a lesser magnification, I can get a clear video of a squirrel at 100 feet that is Impressive.  My only \"con\" is that their is no compatible app for the iPad available.", "Date": "July 19, 2013"}, {"Title": "Seems easy to use and picture quality is good.", "Author": "Jac", "ReviewID": "R1JBCZG4WXZ7J4", "Overall": "4.0", "Content": "I bought it for my mother, who wants to take photos to post to Facebook.This camera is pretty intuitive and easy to use.The only difficulty is figuring out how to save photos via wifi to iPhoto, dropbox or any other photo album.I could not get the camera to recognize the Samsung app installed on an iPad.Otherwise, a good camera.", "Date": "July 17, 2013"}, {"Title": "Good camera for the price", "Author": "Bootquest", "ReviewID": "R3R5JEZMG3GX28", "Overall": "4.0", "Content": "I upgraded to this camera from an older Cannon Elph that had come to the end of it's days.  I purchased the Samsung for a few different reasons and it has mostly met my expectations.  It is wi-fi capable and had a better price point than other wi-fi cameras.  Having used the wi-fi several times now I would say it's functional but not great.  You can download an app for iphone or smartphone and the camera can send a picture to said phone but it takes a few steps to do it and it's not seamless, especially after a few drinks;)  Still it works.  One thing that irritates me is the Slow power up.  It takes the camera a good 5 or 6 seconds to go from off to being ready to take a photo because of the touchscreen.  Not a deal breaker but it's annoying.  Also the flash is manual on this camera.  You have to push a release button on top of the camera to allow the flash to pop up and the first hundred photos I took I had to retake because I forgot the flash wasn't automatic.  The only other small complaint would be that the function control knob on top of the camera is loose and spins around at the slightest touch.  If you put it in your pocket, it will wind up on another setting.  Other than those few slight complaints, I like this camera.  It takes great photos and the screen is bright and crisp.  Good Luck and I hope you enjoy.", "Date": "June 17, 2013"}, {"Title": "Don't recommend getting this camera", "Author": "halynam", "ReviewID": "R1AM3H7988HS30", "Overall": "1.0", "Content": "I got this camera 3 weeks ago and ended up returning it. It's the biggest piece of junk I've ever owned. I have used a dslr canon rebel for the last 5 years and just wanted a good point and shoot on the side. The quality of the pictures (although decent looking on the camera screen) is absolutely terrible when viewed on a computer. And though the camera does have lots of different options it really doesn't matter when most pictures taken are blurry, out of focus and just plain bad..I went back to Best Buy and got a Nikon COOLPIX S9500 and I am much happier with the quality. Quite honestly other than owning a dslr it is the best quality I've had experience with so far.", "Date": "December 14, 2013"}, {"Title": "Poor picture quality", "Author": "Gary Talbott", "ReviewID": "R2DAJSD0JE708B", "Overall": "1.0", "Content": "This camera has a lot of bells and whistles which is why I bought it, but honestly my wife's iPhone 5 takes better pictures. Picasa web albums cloud upload didn't work because Google saw the camera as an unsecure device trying to hack into my account which forced me to change my password...grrrrr.  Maybe a firmware upgrade will fix this. I'm returning the camera.", "Date": "September 23, 2013"}, {"Title": "very impressive camera", "Author": "Leonard", "ReviewID": "RCNLEIS14P12M", "Overall": "5.0", "Content": "Let's say I'm not very camera friendly, I can run rings around people on a puter but hand me a camera and don't leave me alone.  lol  I wanted to upgrade from my lumix, it's a decent camera for what I paid, today it's out dated.I looked and went to stores and tried many, most were hard to operate meaning to vague features, since my lumix had auto settings I wanted something similar for us brain dead camera buffs. I found the Samsung WB250F, what a gem. it's super easy to use, darn near everything is automatic, I bought it and had it sent to my daughters home which is on the east coast (because I was going on vacation to visit her), I live in Wi.  I wish I could upload pics to here, they were simply beautiful, I took some from inside the car which was moving, some at night with no flash, these are beautiful pics. many might say well this is good, that is good, maybe but can someone like me operate it without a degree in photography? if your looking for an easy to use camera and suck at taking photo's like I do, this is the one for you.I bought it here on Amazon, had super fast service, no hassels etc. wish I had bought it earlier.even the wifi is for brain dead folks, easy to use. this is a steal of a camera for the brain dead and the 20X zoomis a super big plus, my last one had a 8X, give this a shot, you'll be glad you did, honestly!  It will also easily fit in your pants pocket.", "Date": "August 30, 2013"}, {"Title": "NICE PICS WITH SOME SHORTCOMINGS", "Author": "Bernadette Hilway \"BH\"", "ReviewID": "R340RP1LTW6N2F", "Overall": "3.0", "Content": "It takes nice pictures, however, the placement of the buttons sometimes interferes with picture taking. WIFI capability is great and works well. However, for some unknown reason, it will not connect to my guest account. It will only connect to my admin account.  Also, the camera is only a few months old and the markings on the buttons are wearing off!", "Date": "April 1, 2014"}, {"Title": "Stopped working in the middle of our trip", "Author": "MIRA BEN-TZUR", "ReviewID": "R2J12KJ5CS53SH", "Overall": "1.0", "Content": "We took it to a long trip abroad. For few times the zoom lens got stuck, but we managed to release it by following the suggestion on the screen (shut it down, take out the battery and reinsert). But then came the time, in the middle of our trip, that it got stuck and refused to get back to normal operation for several days. Then all of a sudden it is ok again. In short, completely unreliable camera! I wish I could return it but too much time passed, due to the length of our trip. I contacted Samsung and they were unwilling to replace it with a new camera. This is much for a service...", "Date": "March 8, 2014"}, {"Title": "Great", "Author": "megan Tudryn", "ReviewID": "RVO72D0Q7MHA4", "Overall": "4.0", "Content": "I love that I can upload to facebook or email right from the camera. I wish it could record videos as well", "Date": "November 22, 2013"}, {"Title": "Quite nice device", "Author": "Carlos Garcia", "ReviewID": "R2U0D0SLOBC43X", "Overall": "4.0", "Content": "This camera meets all the expectations for a point-and-shot device. Compact and easily transportable. Even, it seems a lintel fragile, specially the flash", "Date": "November 19, 2013"}, {"Title": "ok, but i'm returning", "Author": "M. Szczepanski \"meglet71\"", "ReviewID": "R2J7SA258MIOP7", "Overall": "3.0", "Content": "I have a Samsung Galaxy 2 phone and it takes really good pictures, for a phone,  in natural light and w/ no movement.  The colors, such as fall foliage, wasn't always accurate. I was looking for a camera that worked in low light, took movement pictures, and took pictures with vibrant colors.  I was disappointed that the pictures were only as good as my phone and sometime not even as good.  It did definitely take better movement pictures...but that was about it.  I will say, that I am a novice w/ cameras so maybe there were some settings that would have made it work better.  But sometimes even on the auto setting, I had to push the button several times before it took a picture.  Disappointed, especially since I love all of our other Samsung devices.", "Date": "October 1, 2013"}, {"Title": "Very pleased! Expectations met.", "Author": "Tara Creighton", "ReviewID": "R196NGDAT7FN9T", "Overall": "5.0", "Content": "I chose Samsung because I was very pleased with the picture quality on my phone & tablet. The camera has proven to work just as well. I have already used it several times for waterfalls, fireworks, indoors, close ups, action, super moon gazing, etc. Excellent picture quality & enough zoom for the things I do (hiking, kids' sporting events). Moblie Link / wifi is very easy to use & none of the features have required excessive research of the manual. Was also very pleased with the price for all it's capabilities.", "Date": "July 9, 2013"}, {"Title": "Great point and shoot", "Author": "Bekktek", "ReviewID": "R3DGR6ZMXOV35F", "Overall": "4.0", "Content": "I'm very happy with this little camera! It's not a dslr,  but I love having wifi and the ability to send the photos right to my phone. Some of the menus aren't the most intuitive, but once you use it you'll figure it out.This is a great camera for vacation, and I used it with some pc software to take some great family portraits.  I like the action shot, I use it to get baseball shots... Overall, this is a great point and shoot camera.", "Date": "June 6, 2014"}, {"Title": "WARNING: Do not buy!!!! Waste of Money READ HERE", "Author": "Drew", "ReviewID": "R37YU708T57WFB", "Overall": "1.0", "Content": "I purchased this camera at my local electronics store and was looking forward to a decent camera for the price. This camera feels awkward when you hold it and the resolution is UNBELIEVABLY bad.Almost every time I even attempt to use the zoom feature, there is tons of distortion and the menu itself is hard to navigate!I couldn't figure out how to upload video, which was annoying and it takes an eternity just to try and change a setting for any part of the camera.Overall, my experience with this camera was horrible, which is why I took the time to find a QUALITY camera that will last and be friendly to use. Luckily, after searching for weeks, I finally settled on a camera I love! I have used it for just over a month now and the difference in picture quality and overall function is amazing.If you'd like to take a look at this camera GO HERE -------> http://amzn.to/1okZUPVIt is here on Amazon and you won't be dissappointed, I promise!", "Date": "June 6, 2014"}, {"Title": "SIMPLE TO OPERATE", "Author": "Bob S.", "ReviewID": "R3VS2Y45WAYPKL", "Overall": "5.0", "Content": "Nice little camera big viewing screen nice sized zoom very easy to download pics to computer. Most importantly my wife LOVES it!", "Date": "June 6, 2014"}, {"Title": "Great camera for the money.", "Author": "Shelby summey", "ReviewID": "R2IQGZ3XCGS7KD", "Overall": "5.0", "Content": "Great camera for the price. Easy to use, the pictures are clear and beautiful, the wifi is easy to set up. Can send pictures to your Facebook page. The same camera is $ 237.00 at Wal-Mart so this is really a wonderful price. You will not be disappointed if you buy this camera!", "Date": "June 5, 2014"}, {"Title": "Totally love the WB250F Samsung camera", "Author": "Nancy E. Jester", "ReviewID": "R23RYJJWUU9SB7", "Overall": "5.0", "Content": "This camera does everything and does it well. The HD videos are amazing; the photos are outstanding. Highly recommend this camera. Plus the price is very reasonable.", "Date": "June 5, 2014"}, {"Title": "Great camera in small package.", "Author": "C5 owner", "ReviewID": "RSVVLL29FPYL5", "Overall": "5.0", "Content": "Takes excellent pictures that be sent by e-mail using wifi.  The main reason I purchased this camera.  Very satisfied with this product.", "Date": "June 5, 2014"}, {"Title": "A Smart & Sharp Little Camera", "Author": "M. Miles \"buy1sell1\"", "ReviewID": "R3C3Q67YWVCFWM", "Overall": "4.0", "Content": "I needed a digital camera that had better zoom capabilities than the one I had so I bought this. Good quality pictures. It operates like the Fujifilm camera it replaced.It does not come with a memory card and I did not see anywhere in the product description that it wasn't included. So as soon as I received it I had to go to BestBuy and pay $15 for memory.And, no owner's manual was included. You have to get online and download it or logon every time you have a question about the camera's operation.They are cutting corners to save money so that they can sell the products cheaper but they're cutting off their nose to spite their face by making people immediately have to go out and buy something in order to use the product and to have to create their own user's manual to carry with them. So they lose a star for those deficiencies. Pretty soon they won't include a lens or a button to operate it.", "Date": "June 5, 2014"}, {"Title": "Can't beat it for the money", "Author": "Jay C.", "ReviewID": "R3F086DAK3HZQJ", "Overall": "5.0", "Content": "This is a great little camera. It doesn't need as much light as my older cameras so I can usually take pictures in the house without a flash, which look more natural. My only complaint is that the zoom is a little slow responding, but after using it for a brief time I got used to it and its really not a problem anymore. The 18x zoom is very useful at times when you can't get close enough to take a picture up close. Great product!", "Date": "June 4, 2014"}, {"Title": "love the camera", "Author": "Ida Blanck", "ReviewID": "R1NI6NDE4SSSY7", "Overall": "4.0", "Content": "But I would have liked a booklet with it. Paper received not very clear. Needed to know more about the camera. Do you have a booklet you can send me?", "Date": "June 3, 2014"}, {"Title": "Excellent product", "Author": "diego oviedo", "ReviewID": "R39GUP126RHX9Q", "Overall": "5.0", "Content": "Excellent product, it met my expectations. does the job and is very economical. It is a 100% recommended. is a good option.", "Date": "June 3, 2014"}, {"Title": "Awesome Little Camera", "Author": "Venge", "ReviewID": "R8JFR1G0C52TF", "Overall": "4.0", "Content": "Overall this little beast is well worth the money.Let me first say, I am far from being a professional photographer, although with a good camera I do fairly well.While there are a few points that could be improved upon, the pros out weigh the cons by far, in my opinion.First the bad stuff:Like some of the other reviewers I found the wifi clumsy - far easier to hook in hard wire to upload than deal with the built in wifi - at least for me.The auto focus is ridiculous at high zoom - almost funny.  At lower zoom it works fine.Picture quality is so-so.Now for the good:The menus screens are simple and easy to navigate.The video is awesomeThe sound on the video spectacular.Let me go into detail.  While I am no photographer, I do dabble at making safety videos for work.  This camera's video capability (1080)  far exceeds the 720p of my smaller HD video camera I usually use for these videos.  I was working on sound bits at home, realizing I forgot to take my mic from work, I was about to give up for the night when it dawned on me I had the camera handy.  The sound was clear as a bell.So, even though it wasn't purchased for the video exclusively, the quality in that area - for me anyway - makes up for the deficiencies in the other.Let me stress... it doesn't take bad pictures, they just aren't great.", "Date": "June 2, 2014"}, {"Title": "do like this camera", "Author": "Marjorie G.", "ReviewID": "R1FIDXQG8H69HY", "Overall": "5.0", "Content": "love the 3\" screen (as you get older the screen's gotta be bigger)very good value for the features-relatively easy to figure out how to use the features as explained on  the screen", "Date": "June 1, 2014"}, {"Title": "Good camera for the money", "Author": "Tabasco24 \"The Cheese\"", "ReviewID": "R14J2ZQECA00X4", "Overall": "4.0", "Content": "Ok, the only thing that really bothers me about this camera, is its inability to compensate for movement. If the person holding the camera moves even the slightest bit, the picture will be blurry, so it's got to rest on something, which necessitates a tripod.Wifi feature works great with my iPad mini. Video is pretty good, though that's not what I bought it for.Zoom is surprisingly good.If you've got a steady hand or a tripod, you should definitely get this camera. This much camera will usually cost double the price.", "Date": "May 31, 2014"}, {"Title": "Well worth the price.", "Author": "Joe", "ReviewID": "R1N8Y1O5Z9Z001", "Overall": "5.0", "Content": "I don't care what any of the others say. I'm here to tell u that this camera is well worth the little they ask for it. Just stared playing with it and I love it.", "Date": "May 30, 2014"}, {"Title": "great camera", "Author": "martin", "ReviewID": "R1NAKWIQSSUUTG", "Overall": "4.0", "Content": "This camera is so easy to function and very easy to pair with my tablet to sync pics wirelessly. Great quality pictures :-) I would recommend this camera for anyone it's that simple to use", "Date": "May 29, 2014"}, {"Title": "If you want this for Autoshare geotagging (gps), the US version of the iPhone app can't do it.", "Author": "Bill Barrick", "ReviewID": "R2KVORL3G759KJ", "Overall": "2.0", "Content": "It's a really nice point-and-shoot and i'd love it for that but the sales lit that says you can Autoshare pics to your iPhone and the Samsung SmartCameraApp will use the iPhone's GPS to tag appears to be untrue. I spent about 40 minutes online with Samsung on this and they finally admitted the app doesn't work. So--if you don't care about the geotagging (or maybe it works with Samsung's own Android devices) it's a really nice point-and-shoot.", "Date": "May 28, 2014"}, {"Title": "not top of the line but nevertheless it is a great camera for the price", "Author": "Bruce W Hueseman", "ReviewID": "R29E1WM4G7PBP8", "Overall": "4.0", "Content": "I like the WIFI capability and it works quite well  still I feel my samsung S4 phone takes better pics but this is a good camera.", "Date": "May 28, 2014"}, {"Title": "Seems to take ok pictures but....", "Author": "Joanne Hinson", "ReviewID": "R3HJHD8UJPG7MT", "Overall": "3.0", "Content": "It could use better directions, I had to figure out which memory card to use (its not mentioned anywhere), and I dont like where they have the zoom, it impedes ease of use.", "Date": "May 28, 2014"}, {"Title": "Nice camera, wrong power cord", "Author": "J. Nelson", "ReviewID": "R34RYCEMAO4Y1I", "Overall": "2.0", "Content": "The camera did not come with a US AC charger cable, which is disappointing. The AC cord was for another countries electrical outlet, which means the camera was actually not a US model. That is NOT in the description and I purchased this as a gift.", "Date": "May 27, 2014"}, {"Title": "Great camera", "Author": "burgoyne28", "ReviewID": "R2MNR1A37LAXLQ", "Overall": "5.0", "Content": "Love this camera.  It synced perfectly with my Samsung 3.  Great quality pictures and love that it is small enough to fit in a pocket or purse when I don't want to bring my DSLR.", "Date": "May 27, 2014"}, {"Title": "Awesome product!", "Author": "Jonathan", "ReviewID": "R1BRH6IEOAQW3S", "Overall": "5.0", "Content": "This is an awesome point and shoot camera. It can also record in 1080p HD and it's really good. I bought this product mainly because of its18x zoom and it's rechargeable battery and I was not disappointed. Highly recommend it!", "Date": "May 20, 2014"}, {"Title": "Great camera", "Author": "Amy E. Wolchanski \"NATIONAL PRODUCT FAN!!!\"", "ReviewID": "RG4J4IBOXK6GV", "Overall": "4.0", "Content": "For the amateur photographer who is basically just taking vacation and family photos, this is a great camera. It is very user friendly. We loved the touch screen in the back. It will also perform all of the features without the touchscreen, just incase you break it sometime in the future. Zoom is great, and was the motivation for buying this camera.It produces clear, crisp shots even when zoomed in all the way.Wonderful item and the price is more than reasonable.I would buy again.", "Date": "May 20, 2014"}, {"Title": "Nice", "Author": "Keith Burriss", "ReviewID": "R18QXD11KUHPU7", "Overall": "5.0", "Content": "Great Choice Great choice. Better that I expected. They are well made and I think they will last. Just what I was looking for. Takes great pictures", "Date": "May 20, 2014"}, {"Title": "Great camera for a decent price", "Author": "Rayandkim", "ReviewID": "RYSPRU1FXNSEZ", "Overall": "4.0", "Content": "Very happy with this...fun trying out all of the features!  Love the wifi options.  Great price for all that you get", "Date": "May 20, 2014"}, {"Title": "Love this camera!", "Author": "Kelly Wicklund", "ReviewID": "R396C4JLOVN9MS", "Overall": "5.0", "Content": "This camera is definitely a great bargain for the price.  It takes good pictures as well as video.  I have previously had a small HD video camera which did a nice job, but wanted a camera that took good pictures and good video.  This camera fits the bill.  It does take a little practicing  to find all the neat things it will do.  I have used the e-mail feature to send a picture to a computer and it works well.  I haven't tried sending to smart phone, yet, as I don't have one, but expect that it would work as well.  The Best Face and Continuous Shots are great for taking shots of grandkids.  Another feature is that while taking pictures you can just push a button and get video--no turning the dial to change.  I love it!", "Date": "May 19, 2014"}, {"Title": "Great camera! Great price!", "Author": "Jessica Stutmann", "ReviewID": "R26LY64PGQFGJC", "Overall": "5.0", "Content": "Great camera! Great price!  Love this camera picture quality is great... Easy to use in auto mode haven't done anything fancy with it yet but it seems to have tons of options", "Date": "May 19, 2014"}, {"Title": "I am not a professional but camera is easy to use and takes great pictures!", "Author": "Dorothy J. Burk", "ReviewID": "R23KZLQYRD46NK", "Overall": "4.0", "Content": "Camera is easy to use right our of the box. I had no problem setting up the wifi. I just followed enclosed instructions. Camera foes not come with rapid charger I suggest you buy one but not the big John deal suggested after 3 charges it did not work in the camera .", "Date": "May 19, 2014"}, {"Title": "Had to return it", "Author": "Elena Castaneda Ezcurra", "ReviewID": "RXTITVBB1OKGM", "Overall": "2.0", "Content": "I bought this camera mainly because it had the Wi-Fi features but I tried several times to upload some pictures to picasa but it did not work, could not send the pic to my email. In summarry: much more complicated to use the Wi-Fi features than I thought (and that was the only reason I selected this camera) After I return it I read other reviews of people who state also they could not upload/send pictures to internet or at least it did not work as easily as one expects.", "Date": "May 18, 2014"}, {"Title": "So far So Good", "Author": "Sherry Noppe \"Shopper\"", "ReviewID": "R2U1I9E60ZCSZX", "Overall": "5.0", "Content": "Bought this for work to take pictures of what we ship out.So far the pictures are great.  Comes with a mb flash carddoesn't hold many pictures.", "Date": "May 18, 2014"}, {"Title": "good camera", "Author": "serg", "ReviewID": "RWY4DRROHXB56", "Overall": "4.0", "Content": "pretty good camera, it's nice and works well, and it has a decent price with several ways to take cool pics", "Date": "May 18, 2014"}, {"Title": "LOVE it!", "Author": "GaryTucson", "ReviewID": "RREQKCQHP31Y3", "Overall": "5.0", "Content": "I usually write more comprehensive reviews, but since this camera has all the specs and details you need on the Amazon site, I'm keeping it simple. I LOVE it! It takes perfect photos, is ultra easy to use, does everything it's supposed to do, is compact enough to slip in my pocket yet takes photos like one with a huge lens mount, and I LOVE the touch-screen and the fact that I can simply turn the function wheel to Wi-Fi, put it on my desk, press the icon on the screen and download the newest photos directly to my computer without swapping the SD card or plugging it in. BIG perks in a small package - convenient, super easy to use and attractive. What more could you ask for (except maybe not having paid $30 more for it than it now costs from the same source, but that's the way Amazon works - no biggie)", "Date": "May 17, 2014"}, {"Title": "Works for me", "Author": "GaryInCSCO", "ReviewID": "R27M9ULR9HUOL4", "Overall": "4.0", "Content": "The Samsung WB250F is working well for me.Menu selections on digital cameras confuse me and I am still learning how to use the menu interface on this camera.The on-screen menu selections seem to help.I have had good success taking indoor pictures without the flash.The video feature works well also. I need to get used to the lag in the zoom feature while I am shooting videos.The view screen is not bright in outdoor sunlight. I have missed a few action shots because I have had to just aim and click without being able to see the object on screen. I haven't found how to adjust brightness in the menu setup yet.I like the continuous shots feature for action shots, but I would like the processing and recovery time to be quicker.For a pocket camera for casual use, I would buy it again.", "Date": "May 17, 2014"}, {"Title": "Excellent carema for the price", "Author": "Darrell P.", "ReviewID": "R1154KZ9AO6VX5", "Overall": "5.0", "Content": "You can't beat this camera for the price. It takes great pictures and has built-in WIFI, what else can I say ?", "Date": "May 16, 2014"}, {"Title": "Samsung easy to use Camera", "Author": "george arthur", "ReviewID": "R28QMQO8CNAGAC", "Overall": "4.0", "Content": "Easy to use and simple features makes this a winner for me. Don't like complicated gadgets. Picture and video quality good for this price range. Very satisfied with this camera..", "Date": "May 15, 2014"}, {"Title": "Great Little Camera", "Author": "Gene Goodell", "ReviewID": "R3Q9YGW3QCZTAA", "Overall": "5.0", "Content": "I bought one of these to take to Hawaii this year.  GREAT little camera!  See pic:  http://goo.gl/xXW41jVery cool that it syncs with my Samsung Galaxy 4 phone as well.  I can take pics and have it automatically sync to phone and then the cloud, or take pics and then \"bulk\" upload them to my phone / cloud later on.  Either way, super handy and pretty darned good pics for under $150!", "Date": "May 13, 2014"}, {"Title": "Great Digital camera", "Author": "jimmy garza", "ReviewID": "R1V1OO60QQE3UU", "Overall": "5.0", "Content": "Great camera mothersday gift for my wife,but I\"m using it more! Also arrived on time!!Will buy from you again.My wife also liked it.!!!", "Date": "May 13, 2014"}, {"Title": "Great pics, flash terrible design!!!", "Author": "Fabian Agudelo", "ReviewID": "R2Z1JZTQH9CD7X", "Overall": "3.0", "Content": "What was this flash designed in the 80's? It pops up like a really corny electronic from the 80's movies \"Short Circuit\" or \"Batteries Not Included\". The quality of pictures is ok. Lots of features, but a pain to setup and navigate. I miss my Sony which had easy menus, quick flash, and equal or better picture quality and zoom.", "Date": "May 13, 2014"}, {"Title": "Very good camera for the price!!!", "Author": "Bino_10", "ReviewID": "R1CBATU15X5ZHC", "Overall": "4.0", "Content": "We were very happy with the camera but had a few minor issues that were very annoying during our trip. There was a long delay while zooming in on pics and every so often the camera would take blurry photos for no reason. We'd turn the camera off and then back on and that seemed to correct the issue. We haven't had the camera long so maybe there's something in the manual that will explain these issues better. Overall, happy with the pics and camera.", "Date": "May 11, 2014"}, {"Title": "Easy to use!", "Author": "saving consumer \"save\"", "ReviewID": "R1AXSPAHIC57MH", "Overall": "5.0", "Content": "So far I love this camera as it is extremely easy to use especially the wifi with sending pictures to my email and smart phone. This is exactly why I bought it and so far it is effortless to use the wifi. I have only had the camera a month but so far my pictures are very nice and I highly rate the ease of use.", "Date": "May 11, 2014"}, {"Title": "A MOST HAVE FOR DIGITAL PHOTOS.", "Author": "johnny serrano", "ReviewID": "RA8GTHSIGV6FC", "Overall": "4.0", "Content": "Wonderful feature for the digital camera, it works as it's design. I love it. Able to transfer .com picture to my album on the computer.", "Date": "May 9, 2014"}, {"Title": "I love it", "Author": "MOONCHOUNG CHOI", "ReviewID": "R3ONEOWCACUI5Y", "Overall": "5.0", "Content": "good", "Date": "May 9, 2014"}, {"Title": "Great Camera", "Author": "Tammy Ray", "ReviewID": "R5SH3BP2GHHQ6", "Overall": "4.0", "Content": "I am getting familiar with my new toy and it is always a little frustrating when the manuel is very VAGUE. I would like more info and will be seeking it online soon.  Tell ya again in the fall how I like my new \"toy\"", "Date": "May 8, 2014"}, {"Title": "Amazing!", "Author": "andrew", "ReviewID": "R1F4LB0P0DVY2J", "Overall": "5.0", "Content": "Out of all the cameras I have had, this is the best one! I love how you can instantly share your photos and videos to social networks straight from the camera. I would recommend this camera for whoever wants a camera that can take high quality pictures and videos in a small size and instantly sharing them!", "Date": "May 4, 2014"}, {"Title": "Samsung WB250F digital camera", "Author": "tam60", "ReviewID": "R2AV5ZI93XX8OH", "Overall": "5.0", "Content": "Excellent camera over all takes great pictures easy to use but one flaw with this camera don't buy it thinking it is easy to transmit your pictures to your email with the Wi-Fi it does not work. There is no way to send it to your email for some reason it will be blocked by yahoo mail you can send it to facebook but not everyone wants all there pictures on facebook!", "Date": "May 4, 2014"}, {"Title": "Great Camera excellent feature", "Author": "Willie Mitchell", "ReviewID": "R3E9SJCMCYSNA0", "Overall": "4.0", "Content": "I love this camera, it is light weight large viewing, and wireless make it convenient to share at no expense.", "Date": "May 2, 2014"}, {"Title": "Excellent camera", "Author": "Maithe", "ReviewID": "R2WLGTZTJB0IO1", "Overall": "5.0", "Content": "The camera is excellent. It takes photos like a semi pro camera. Zoom works perfectly and the options of smart and automatic are as beyond as expected. It's not a super fast camera (specially zoom it's a little bit slow). In average I love it!", "Date": "May 2, 2014"}, {"Title": "Great Quaility photos..clear zoom..just as advertised!!!", "Author": "ruth", "ReviewID": "R2JWWLAUICQ2B1", "Overall": "5.0", "Content": "I really do love this camera...the photos are perfect and the zoom is as clear as stated. A proper manual for this can be found at this link..[...]..Shipping was also ok ...i am satisfied at the moment no complaints for me thus far.....", "Date": "May 1, 2014"}, {"Title": "Love it!", "Author": "Farns418", "ReviewID": "R2M1MPP1H1FID0", "Overall": "5.0", "Content": "My wife got this for my birthday and I love how easy it is to use, the wifi posting to facebook saves me so much time! Great quality pictures in a nice compact frame, excellent camera and an easy item to recommend!I got so use to using my iPhone, I had forgotten how nice pictures could look.", "Date": "May 1, 2014"}, {"Title": "Easy Peasy", "Author": "C. Curtiss", "ReviewID": "RAG1K9JCNMO44", "Overall": "5.0", "Content": "This is sweet!  Dummy user yet it was easy to share the photos without hassle.  Works great, nice pictures.  Would recommend", "Date": "May 1, 2014"}, {"Title": "Absolutely great camera", "Author": "paula", "ReviewID": "R1CV3U54YDXHW4", "Overall": "5.0", "Content": "I was looking for digital compact camera at a reasonable price, light weight and have WiFi.  This one is perfect.  There are newer model that cost about $150-$200 more for 21x Zoom and little higher MP but it will be way too much which I don't need.  The extra money can be used to buy other items.  There are so many (-) and (+) reviews, but for me it's 5 stars for what I need.  I don't plan to be professional photographer anytime soon.", "Date": "April 30, 2014"}, {"Title": "Love it", "Author": "Rick Brewer", "ReviewID": "RXMVMX9NZY036", "Overall": "5.0", "Content": "Had been using a Nikon for business. This camera works so much faster, focus is immediate. Pics are great. Only thing I can not quite figure out is the link to PC. Takes a little working.", "Date": "April 30, 2014"}, {"Title": "love it...", "Author": "Miriam Michaud", "ReviewID": "R326AZ3T2BV4B2", "Overall": "5.0", "Content": "love this camera it has more than what i read on it...takes great pictures and videos, would recommend it to anyone", "Date": "April 30, 2014"}, {"Title": "Awesome", "Author": "Kimberly Brugler", "ReviewID": "R295TLWB0YN4TR", "Overall": "5.0", "Content": "Love this camera.  Great zoom. Easy to use and easy to upload pictures to web.  Stays charged for a long time as well. Highly recommend!", "Date": "April 29, 2014"}, {"Title": "Excellent Product", "Author": "DAVID H. COTE", "ReviewID": "R2SCQN61P40CQB", "Overall": "5.0", "Content": "This Samsung product takes great pictures and interfaces with my computer very nicely. Read directions carefully and you will not have problems with taken pictures and using the computer.", "Date": "April 29, 2014"}, {"Title": "Samsung Camera", "Author": "Amazon Customer", "ReviewID": "R13NF3AQBLCKRL", "Overall": "4.0", "Content": "I been into photography for a few years now though not a pro I do know my way around a cameras. I am a postal carrier so I'm out in my llv for about 6 hrs a day so theres some nice shots out there some days. I wanted a small camera I could put in my bag and then hang around the truck so when a picture came up I would have it handy. This is pretty much your basic point & shoot camera it does everything pretty well, but you can match this up with your Samsung phone ( I have the S4) so you can sit this up on a tripod and use your phone to snap the picture. I've paired mine up already, and it was a breeze to do, I haven't taken a picture this way yet I wanting for it to get a little warmer and all the birds and butterflies are out but I can already imagine some nice shots with it set up this way.So all in all it's a nice little p&s; and it does take nice pictures.", "Date": "April 28, 2014"}, {"Title": "Like this camera", "Author": "K. Vicari", "ReviewID": "R3JH0GL7YHAPLD", "Overall": "5.0", "Content": "Easy to use, has lots of great features for the money, and takes great photos. I love how you can use the wifi to download your pictures and how they have an app for your phone.", "Date": "April 28, 2014"}, {"Title": "Seems to be a nice little camera", "Author": "Shirley", "ReviewID": "R1Y3DWI8XEGQI4", "Overall": "4.0", "Content": "I just got this and have taken probably 50 pictures as I practice with it. It's a nice point and shoot camera and I believe it is going to work very well for my needs. It is a little heavier than I thought it would be (hence the 4 stars) but it's not something I can't deal with. I own another Samsung point and shoot that I have had for 5 years and love it except I was looking for a better zoom. This camera to me, was reasonably priced for an 18X zoom so I thought I would try it and see.Great zoom pictures! Very clear and easy to use. I read other reviews that mentioned the zoom as being slow. I did not see this. What I like best about it is that it works identical to my other point and shoot so no learning curve for me. I also read reviews about the pop up flash and I understand what they are saying. I very seldom use a flash so I don't have a problem, but if you do use one you would have to be careful. I can see how it could break. I actually like the flash on this better than my other point and shoot because the flash on it is always on and you had to physically turn it off each time you turned the camera on. A real pain.All in all I feel this is a good camera and I would recommend it.", "Date": "April 27, 2014"}, {"Title": "Love the camera", "Author": "Rita Blue", "ReviewID": "R144Y4JIVQWY46", "Overall": "5.0", "Content": "So far so good, no problems but I have only taken a couple hundred pictures with it thus far.... Thanks", "Date": "April 25, 2014"}, {"Title": "Great camera!", "Author": "L.Lewis", "ReviewID": "R16EFN9XAKOI9H", "Overall": "5.0", "Content": "I bought this camera because I don't have a smart phone and wanted to upload pictures to e-mail, facebook, etc via WIFI. It takes great pictures and is so easy to operate. I can now share pictures so quickly and easily. It's the perfect size to carry with me all the time. I love that it doesn't take the standard AA camera batteries that lose power so quickly. I'm always ready to catch those special moments. It also shoots great video and has a a button just for that function. You just push the button and it starts filming immediately. The price was great too! I would highly recommend this camera.", "Date": "April 24, 2014"}, {"Title": "Excellent choice!", "Author": "Pragmatist", "ReviewID": "RVVY6VY2XYYD6", "Overall": "5.0", "Content": "It is all I expected and more.  I am still exploring the wonders of this little dynamo.  The convenience of sending photo shots on spot via wifi is just awesome. Its lightweight.  Handy. More features than you can imagine or even care to use. Convenient usb charging. Lens protection. Zooms like a pair of binoculars. Pictures are clear and crisp like that of a professional camera.  My choice is is simply brilliant... Another winner!The only thing thats missing is a carrying case. Who said life is perfect?", "Date": "April 24, 2014"}, {"Title": "very good", "Author": "Héctor Gómez de Salazar", "ReviewID": "R3PQDM0VG90IS6", "Overall": "4.0", "Content": "the digital camera it is very goodI haven't any problemI like because it' compactI recomend this product", "Date": "April 23, 2014"}, {"Title": "i will recommend", "Author": "Gideon", "ReviewID": "R31F0D2NM9P9KH", "Overall": "5.0", "Content": "was on tine and pack just right the camera works great i use it as a back up to my dslr", "Date": "April 23, 2014"}, {"Title": "Wonderful camera", "Author": "Ronald Parrales", "ReviewID": "R15C3UXEZZ22KC", "Overall": "5.0", "Content": "The photos are of excellent quality, has many functions and is the best I can enable wifi and immediately upload them to facebook", "Date": "April 23, 2014"}, {"Title": "Great until zoom broke", "Author": "james grayson", "ReviewID": "R1EQIS7R7I068D", "Overall": "4.0", "Content": "The image quality is excellent. Quick turnaround for the next shot. The zoom is very good, but after a couple weeks of use it locked up on me. Since Amazon.com is so great, I have a new one on the way to replace the broken one. I think that I wanted a replacement and not a refund says a lot here too. I've owned and used quite a few cameras, and this one is packed with cool features. The touch screen is brilliant, the wi-fi option is awesome for quick sharing of pictures, you can link it to you phone for sharing that way, and it takes standard SD cards, so memory is cheap to obtain. Battery life was very good in the time I used it. I think the only drawback is the potential for zoom durability, but I could have just had a bad one. Let's hope so. Overall, this is a winner.", "Date": "April 23, 2014"}, {"Title": "Needs viewfinder", "Author": "Kindle Customer \"maine--iac\"", "ReviewID": "R1YM4RZXRTJTKP", "Overall": "4.0", "Content": "I really like this camera but find it hard to see the screen to take outdoor shots, all I see is my own reflection !! Wish it had  a view finder that you could look through , other than that it is fine .", "Date": "April 22, 2014"}, {"Title": "great", "Author": "Shellie", "ReviewID": "R37JLCEBAOBVOG", "Overall": "5.0", "Content": "Its great! I love it! Like the color, features, zoom, touch screen, its a good camera. I would recommend it.", "Date": "April 21, 2014"}, {"Title": "Great camera!", "Author": "Robin Aylesworth", "ReviewID": "RLH8ZG62Y4RG9", "Overall": "5.0", "Content": "I bought this to have a more portable camera than my bulky Nikon. I love the quality and features of this little guy!", "Date": "April 20, 2014"}, {"Title": "I love the camera", "Author": "Sandra L. Nuelken", "ReviewID": "R3EOGUGZBP9TKP", "Overall": "5.0", "Content": "This is my third..my first two broke when I dropped them. I love the special effects and ease I can work the camera. Bought the warranty as it was much cheaper than a big box store charges and it seems as I get older I drop the camera more often than the grandkids...", "Date": "April 19, 2014"}, {"Title": "Our favorite camera.", "Author": "Dan C", "ReviewID": "R3NHONYWVPWDU5", "Overall": "5.0", "Content": "We like to just point and shoot, we are not photographers but the results we get with this camera say we are.  Outstanding pictures, videos and the transfer to our phone or tablet makes this a perfect set up.  The battery has always lasted longer than we needed, even with taking videos.  A key to digital cams is the speed of the SD card.  Get one that reads at at-least 40 megs and you will get great results.", "Date": "April 18, 2014"}, {"Title": "bella", "Author": "ydac \"ydac\"", "ReviewID": "RXFQ5N5DB6A8L", "Overall": "5.0", "Content": "Excellent I loved and liked a lot the camera has lots of features, I lleó one week ago and still I have discovered the camera functions. To all my family and friends liked it, so practical, easy to handle and very low price. I recommend them for sur", "Date": "April 17, 2014"}, {"Title": "Wow", "Author": "Michael DeLeon", "ReviewID": "R3UN5H30UYZEN6", "Overall": "5.0", "Content": "What a great camera for the price. Comes with tons of great features and functions very well. No complaints. 5 stars", "Date": "April 16, 2014"}, {"Title": "great camera", "Author": "C. Anneken \"kool troll\"", "ReviewID": "R2S7EHYKLCZUXN", "Overall": "5.0", "Content": "very ergonomic, sharp pictures, samsung quality,  Samsung WB250F Smart Wi-Fi Digital Camera (Cobalt Black) easy to charge by just plugging in micro USB cable.", "Date": "April 16, 2014"}, {"Title": "Good for the price", "Author": "ArBoLar", "ReviewID": "R3AX1KPYCONLFT", "Overall": "5.0", "Content": "Excelent camera for the price, I highly recommend it. This camera really meet my expectations considering what I pay for!", "Date": "April 15, 2014"}, {"Title": "Samsung WB250F 14.2MP CMOS Smart WiFi Digital Camera with 18x Optical Zoom,...", "Author": "sir4", "ReviewID": "R3TTNEZD72B9DH", "Overall": "5.0", "Content": "This is a great little camera. The manual reads like a manual. It can do anything I want it to do. And it is easy to download since it has WiFi.", "Date": "April 9, 2014"}, {"Title": "Good quality, good price", "Author": "James B. Osbon \"Jim\"", "ReviewID": "R7P1NCDCRPFO1", "Overall": "4.0", "Content": "I am a new owner but cannot fathom how to transmit a video longer than 30 seconds.  Most of what I want to send is about three minutes.  No solution yet.  If you know, send answer to ozbn@aol.com.I got the white camera because it is easier to discern the gray writing on white compared to the usual black camera with dark letters. The main two reasons for me wanting this camera are the zoom (18x) and the ability to email a picture directly from the camera, the way a smart phone does.  No more having to download a batch of pictures to the computer, then emailing them as another step.I also bought separately a small white hand-held tripod from Amazon (Manfrotto brand) which I use with this camera.  It allows for a sure handhold while punching buttons on the camera, giving me real stability when I shoot a video, with the advantage of being sure that I won't drop the camera accidentally.", "Date": "March 25, 2014"}, {"Title": "Wonderful", "Author": "Lady T", "ReviewID": "R1VLBC5PXEYZCZ", "Overall": "5.0", "Content": "I love my camera i am a beginner photographer and this camera has helped me enhance my skills, it is light weight I love the rechargable batteries. The zoom is wonderful the flash is fantastic, the price was also very reasonable. I looked at other websites and they wanted to much for this. I also love love love the touch screen", "Date": "March 25, 2014"}, {"Title": "I love the camera!", "Author": "Linda", "ReviewID": "R1WHSLDCRPIIL", "Overall": "5.0", "Content": "It meets all of my expectations.  I would recommend.  Still learning everything about it.  It has alot of features.Very nice.", "Date": "March 24, 2014"}, {"Title": "Great compact camera", "Author": "Rita Bassler", "ReviewID": "R2UCYE2YQHNP7V", "Overall": "4.0", "Content": "I'm still learning about all of the features but the pictures I've taken so far have been fantastic, they are sharp and clear. I did go online and print out the information on the camera and how to use it, I found that easier than the little booklet you get with the camera. I have no complaints with the camera. Easy to use, the battery last a long time, great pictures, love the touch screen.", "Date": "March 24, 2014"}, {"Title": "Great Camera", "Author": "Richard L. Moore", "ReviewID": "RZH3EBJURTFOY", "Overall": "5.0", "Content": "This ia a fantastic camera, especially if you travel and need something to fit in your pocket or put in your purse.It will do anything you want, photography.Very, very good !", "Date": "March 23, 2014"}, {"Title": "Great Camera", "Author": "Edgar Salas", "ReviewID": "R1SAKTFG7WINQF", "Overall": "5.0", "Content": "18x Zoom For This price and amazing video quality! Can Be used with smartphones to take pics. Smart mode is really cool!", "Date": "March 23, 2014"}, {"Title": "Awesome!", "Author": "J. Green", "ReviewID": "R21TXCAB7F32J5", "Overall": "5.0", "Content": "What an awesome camera!  The options on this thing is amazing.  Takes great pics, great videos...can't go wrong.  Definitely buy!!!!", "Date": "March 20, 2014"}, {"Title": "Awesome Camera", "Author": "J. Hollinger \"Beachgirl\"", "ReviewID": "R226X2VQRN3YRS", "Overall": "5.0", "Content": "I wanted a point and shoot camera that was good quality and had some ability to adjust to your own settings and this absolutely fit the bill. It connected easily to my WiFi network, (which was the main reason I wanted it) and I enjoy sending pictures via Email or posting to my Facebook account. I also love the 18x Optical zoom....great close ups. Also love that you can zoom while shooting video.Great camera at a great price. Love it!", "Date": "March 15, 2014"}, {"Title": "Best camera I have ever owned", "Author": "Janice RP", "ReviewID": "RHJPC9K3Z347H", "Overall": "5.0", "Content": "Clear, sharp pictures.  Unbelievable quality and awesome functions.  I bought this as a gift for my husband's 60th birthday.  But it was more of a gift to myself. Wonderful product.", "Date": "March 14, 2014"}, {"Title": "Samsung WB250F Smart Wi-Fi Digital Camera (Cobalt Black)", "Author": "sebabs32", "ReviewID": "R38GJVWMF0UKI9", "Overall": "4.0", "Content": "I totally love this camera. touch screen. the videos are totally amazing. Small and can be easily carried about, and this doesn't prove a disadvantage as i have big hands however, as per flash, its quite uneasy as you have to press the button for it to pop up, besides I still haven discovered the option for forced flash (I hope it has). this is the only reason am giving it a 4 star.", "Date": "March 12, 2014"}, {"Title": "Camera work great", "Author": "Desert Romer", "ReviewID": "R3E0CFB6FDDGHX", "Overall": "5.0", "Content": "Am still learning to use some of the features of this camera. It can do a lot of things that I may never need but have the option of doing if I want to take the time to learn. I really just needed a point and shoot. Do like the zoom feature it works really well, the camera takes very clear sharp pictures. Would recommend it to family and friends. Bought a Samsung because I think they put out a good product.", "Date": "March 9, 2014"}, {"Title": "easy", "Author": "Emma Jonsson", "ReviewID": "R3VVZ2R4JFQF8K", "Overall": "5.0", "Content": "the camera is very easy to use and it's perfect to just have in your handbag, so you can take good pictures whenever you want and the wifi connection is great, so you can very easily upload you pictures or email them to your friends and family from your camera!", "Date": "March 8, 2014"}, {"Title": "Easy To Use", "Author": "sandawana56 \"sandawana56\"", "ReviewID": "RHWHPEZ20Z3UE", "Overall": "5.0", "Content": "I got this camera for Christmas and am really enjoying it. It came from BestBuy with a $129 deal that automatically included a camera case and an 8gb SD card. For the price this is a great camera. The pictures are bright and crisp, battery life is excellent, response time is good and low light pictures are very nice as long as you allow adequate time for the camera to capture sufficient light. I have not had any issues with the flash as other reported. The touch screen makes it very easy to adjust settings.My husband is not very technical but has been able to take great pictures with this camera and finds it easy to use. I like the remote shutter feature and the feature that allows pictures taken on the camera to automatically be uploaded to my cell phone. I have all camera pictures automatically uploaded to Dropbox so they are backed up right away.A big bonus with this camera is that I can still take clean pictures even though my hands occasionally shake. With my last camera I'd often have to take several shots before I got a clean shot when my hands were shaking. This has eliminated a lot of frustration and has made picture taking an enjoyable experience again.", "Date": "March 6, 2014"}, {"Title": "Samsung WB250f fantastic camera for all levels is usrs", "Author": "Joseph J. Boisvert", "ReviewID": "R34P1BAWW23EKQ", "Overall": "5.0", "Content": "The camera came on time.  For the price it is loaded with both photo and WiFi options.  Very simple intuitive to use.  Unpacked it took a picture connected the camera to the network and emailed a picture in less than five minutes.  Will take much more use to exploit all the features.  I bought the white camera and absolutely love how it looks.  Great value for the money.", "Date": "March 5, 2014"}, {"Title": "If you want a  great camera for a great price", "Author": "Lov2read", "ReviewID": "R2OFCH6WAKD626", "Overall": "5.0", "Content": "Received my camera.and was very happy. Great quality and easy to set up. Manual is not user friendly. Battery charges quickly.", "Date": "March 5, 2014"}, {"Title": "Could be better built", "Author": "Jorune", "ReviewID": "RQL0ZZMXRY33U", "Overall": "3.0", "Content": "I do not like that the flash is not built into the unit.  You have to remember to release it.  When it's popped up, you need to be careful. One wrong smack and that flash is going to be broken.", "Date": "March 3, 2014"}, {"Title": "Super Camera for the Price!", "Author": "Jeremy", "ReviewID": "R244T4OJM4XHYQ", "Overall": "5.0", "Content": "Purchased this to replace old Sony camera for my mom! She is not the biggest tech person and she already has this figured out! Picture are amazing and she is happy! I will probably buy another for myself!", "Date": "March 2, 2014"}, {"Title": "Good and not so good", "Author": "Kathyv \"KathyV-NJ\"", "ReviewID": "R3VN3OH9A9OVXC", "Overall": "4.0", "Content": "The picture quality is excellent. There are so many features not sure anyone can use them all. Love the wifi to send picture and video right from camera. What i don't like is microphone is right on top which i keep covering as i hold the camera which then make audible on video worthless. The on and off button is so sensitive every time  i put the camera away it turns on just by a slight touch.. Some great features allow stop frame, zoom is fantastic, just to name a few. Hate that there is no manual. Online its about 140 pages and thats the english version. Time consuming to scroll to information online. At 140 pages printing not an option.", "Date": "March 2, 2014"}, {"Title": "Good Camera", "Author": "Cyndy Portman", "ReviewID": "R1HVE60M5KPLPN", "Overall": "5.0", "Content": "I love the quality of the pictures it takes and the wifi feature that shares pictures from the camera to my Samsung phone.", "Date": "February 21, 2014"}, {"Title": "Loaded with Features", "Author": "Arthur Cooney", "ReviewID": "R20V4DCEZH2268", "Overall": "5.0", "Content": "Take your shot, which is easy. Then you can send it where you want to by email. The camera is compact, fits easily into a pocket, and is ready to work (stills or movies) quickly. I like it.", "Date": "February 19, 2014"}, {"Title": "It's s a great camera", "Author": "Raul Vieitez", "ReviewID": "R2PANTJFRJQGNI", "Overall": "4.0", "Content": "It's a great camera but it's a bit slowly when you change the configuration or change the mode you are using.", "Date": "February 18, 2014"}, {"Title": "Fun Camera", "Author": "FlashMan81", "ReviewID": "R3FYYOEBL1WLAA", "Overall": "4.0", "Content": "This is a fun camera to use with a lot of neat features, but the picture quality is not the greatest. The zoom is good and the video is fair. The picture quality is not really bad, and for the price you really can't argue. It's plenty sufficient for posting pictures on the web or sending emails for social purposes. I've used it quite a bit and had a lot of fun with it, and I would recommend it for the price you can get it for. Just don't expect more than you should with the picture quality.", "Date": "February 12, 2014"}, {"Title": "Beautiful camera!", "Author": "Michael Peters", "ReviewID": "R2UBEIEYP25NQK", "Overall": "5.0", "Content": "Great zoom- very clear and bright pictures. This camera is easy to use and everything I hoped for in a camera!", "Date": "January 31, 2014"}, {"Title": "Very versatile easy to use pocket sized camera.", "Author": "Carmen Cuevas", "ReviewID": "R18AOH978XVYIS", "Overall": "5.0", "Content": "Takes great pictures even if the auto focus seems a little slow.  Fits nicely in my hand with the grip on the right side.", "Date": "January 29, 2014"}, {"Title": "Great small investment", "Author": "April Jackson", "ReviewID": "R1HGCXEJJ7D7FN", "Overall": "4.0", "Content": "I love this camera. I destroyed the first one and got another one identical to my first camera. I love the editing part of this camera. The focusing of the lens could be better...but I'll deal with it. FYI zoom in slowly to get the lens to focus better especially when you use the video camera.", "Date": "January 29, 2014"}, {"Title": "Excellent camera!", "Author": "Donald A. Kalina \"k-line49\"", "ReviewID": "R1KZ3I66ULDZQA", "Overall": "5.0", "Content": "Camera works with my Android phone transfers the pictures I take to the phone, you can also email the pictures to your family and friends, I love it!. It also has several shooting modes to enhance your pictures. You can also shoot video, stop and then continue on from where you left off, without starting another video. Great camera.", "Date": "January 28, 2014"}, {"Title": "Camera", "Author": "Linda M. Laplac \"Linda Marie\"", "ReviewID": "R1Y8DNO390CFZJ", "Overall": "5.0", "Content": "I am very happy with his camera I am still learning how it works it has a lot of ability the online works terrific", "Date": "January 27, 2014"}, {"Title": "Excelente. La recomiendo 100 %", "Author": "HECTOR", "ReviewID": "R20Z0HSXHE5S3G", "Overall": "5.0", "Content": "Excellent camera, is simply spectacular. I can upload photos directly to Facebook without wires and computers. The only detail that I did not like was the flash, for its position in the chamber is very delicate though I have not had a problem yet.", "Date": "January 27, 2014"}, {"Title": "Samsung camera", "Author": "hamgirl", "ReviewID": "R1W7MGSRIOVTM3", "Overall": "5.0", "Content": "Love the camera and the quality of the photos and the ease of use but I would have liked to have had better instructions that were a little easier to navigate", "Date": "January 26, 2014"}, {"Title": "Excellent camera", "Author": "George J. Partington \"scribbler\"", "ReviewID": "RBVFEKLHV8OFQ", "Overall": "5.0", "Content": "I primarily selected this Samsung camera because of it's ability to upload photos directly to email and internet.However , it is a very good camera in terms of taking great pictures. What more could one want?", "Date": "January 25, 2014"}, {"Title": "The charger came with this is not for US so useless.", "Author": "Ki Hyung Song \"ki song\"", "ReviewID": "R24WETVC87VDXV", "Overall": "3.0", "Content": "The quality is good. I like the features. But I don't know if this product is for US. It seems like it's for China or somewhere else. Anyway it uses standard micro usb so I can use it with my phone charger.", "Date": "January 24, 2014"}, {"Title": "Good choice", "Author": "Russell Dayton", "ReviewID": "R3AU7KATPYJRW0", "Overall": "5.0", "Content": "I researched many similar cameras, spent several hours before choosing this camera. I think I made the right choice. This model is easy and simple enough to use even for a novice like me to use. Yet has many really good features. R.D.", "Date": "January 24, 2014"}, {"Title": "Good technology but bad function", "Author": "Bethan Williams \"annattasiaaa\"", "ReviewID": "R2FEFBI5LSROYP", "Overall": "3.0", "Content": "I give it three star because the camera has a nice size, is light and you can e-mail pictures or share them online directly from your camera.  Also, it takes crystal clear picture ( day or night) as long as your object does NOT move.  So the slightest move and you get a blurry picture.  I bought this camera to take pictures from my 3 year old son....the only pictures that turn good are the ones I take when he is in asleep!", "Date": "January 24, 2014"}, {"Title": "Great camera", "Author": "Jon D. Skorich", "ReviewID": "R2HVTCKTNLQGRC", "Overall": "5.0", "Content": "This is a great camera with loads of smart features. The built in wifi and compatibility with apps for quick transfer to phones & tablets is a brilliant feature. The image is great. Takes good video as well. Definitely a lot of bang for your buck.", "Date": "January 23, 2014"}, {"Title": "Great camera with easy share options.", "Author": "Hugo H. Carrejo \"Nando\"", "ReviewID": "R2WO1X0A8XBLWX", "Overall": "5.0", "Content": "I've had other compact Cannon Powershot cameras and this Samsung easily is the overall better compact camera. Takes great pictures with different option settings that are easily comprehend able and accessible. Very good zoom and WiFi sharing directly to your email or transferring to or from your smartphone with the Samsung Camera app. Editing options are very cool as well with cartoon mode and such. Battery life is good and low light pictures look great with flash. Very decent shutter speed as well considering it is a compact camera, not a DLSR.. For the price, hard to beat a camera like this.", "Date": "January 21, 2014"}, {"Title": "Excellent", "Author": "Vijay Dandur Rajanna \"vijayrajanna\"", "ReviewID": "R1UHPMAZESSMH2", "Overall": "5.0", "Content": "I have not used this much, but initial impression is great.I was mostly impressed by the zoom 18x factor.", "Date": "January 19, 2014"}, {"Title": "Samsung Camera", "Author": "Amazon Customer \"Computer DOC\"", "ReviewID": "R395EGR4LYMNKV", "Overall": "5.0", "Content": "Good price on a Quality Samsung product, but returned it for exchange for the Android Samsung Camera, which gave me additional features.", "Date": "January 18, 2014"}, {"Title": "pretty good camera", "Author": "multanii", "ReviewID": "R3UW44N6KSCTZA", "Overall": "5.0", "Content": "So dar everything has worked and its a great little camera. The only thing odd is the cartoon mode sometimes its great other times its kinda ehhh.The WiFi ability is very useful especially since my gf who this was a gift for does not have internet or a working computer to upload otherwise. So she just uploads over WiFi at my house.", "Date": "January 16, 2014"}, {"Title": "Amazing little camera", "Author": "dachshund1", "ReviewID": "RC3U027PL3QAW", "Overall": "5.0", "Content": "This little camera has all the bells and whistles you could ever need. The pictures quality is great and auto focus is so easy to use. Makes Grandma's pics look like a pro.", "Date": "January 15, 2014"}, {"Title": "Great camera for the money", "Author": "Rich B", "ReviewID": "R274RUISC8Q5YH", "Overall": "4.0", "Content": "Easy camera to work, the best feature is , it's quick focus and quick exposure.The bright color allows you to find the camera quickly", "Date": "January 14, 2014"}, {"Title": "New Camera", "Author": "Ronald W.", "ReviewID": "RFRPXB18R6GW4", "Overall": "5.0", "Content": "This camera meets our needs and seems to be very user friendly. Taking it on vacation in a couple of days and looking forward to taking lots of excellent pictures.", "Date": "January 14, 2014"}, {"Title": "Wife Loves it", "Author": "Randy Bordelon", "ReviewID": "R2LOXPSHODUDFE", "Overall": "4.0", "Content": "Good little camera for the price.  Gave it to my wife as a present because she wanted something small instead of always lugging around her SLR camera.  She loves this little thing.  Has a lot of features especially for editing pictures.  The best feature of all is the WIFI capabilities allowing for sending pictures directly to your phone.  You can also email them or use social media which is a cool feature as well.", "Date": "January 14, 2014"}, {"Title": "Nice features and simple use", "Author": "Henry", "ReviewID": "R7JSUM2W4QR0Z", "Overall": "4.0", "Content": "I bought this for two reason.1. Samsung's smart features2. bounceable flash - Like tilting it back...I love that I can manually adjust the flash by tilting it, but because it's on the same side as the shutter button its hard to have it bent and press it at the same timeIt might be annoying that you really have to press on the flash button to get it out but given I use this in bright environments It isn't too big of a problem.The smart features Samsung put in is very useful for when I was filming a video for my channel(check that out on [...]) remote viewfinder and others are all rolled into one app on Google called Samsung SMART CAMERA App ([...]) other apps don't work.... the way you use remote viewfinder and others is by launching the feature you want on the camera and the phone just does what camera asked it to do. The Direct Link button is programmable so change it to you liking.Overall it makes great camera comes with features you expect from a point and shoot.I am using this pormerily as video camera you want to check the quality of the mic and stuff you can check them out on my channel on youtube ([...])", "Date": "January 12, 2014"}, {"Title": "Great low cost camera", "Author": "Daryl W Johnson", "ReviewID": "R3KCOQUDCUUUA6", "Overall": "4.0", "Content": "The 18X Optical zoom works great. The battery life is good and the photo quality is good.I haven't spent any time on the detailed settings yet and the flash armature is a little funky but for the money, this is a very good out door use camera.", "Date": "January 11, 2014"}, {"Title": "Really Great Camera", "Author": "Miranda Jackson", "ReviewID": "R14RO0XKZ1LBRE", "Overall": "5.0", "Content": "Bought this Camera at Best Buy and it is great, it is just so beautiful. It takes really good pictures as well. Just like any device their are buttons that you just have to press to know what they do. I'm so happy i got this and I'm just going picture crazy and taking pictures of anything.", "Date": "January 10, 2014"}, {"Title": "Samsung WB250F 14.2MP CMOS Smart WiFi Digital Camera with 18x Optical Zoom,...", "Author": "Donald", "ReviewID": "RPXXDYY8WGU2L", "Overall": "4.0", "Content": "I purchased the camera locally when the retailer price matched Amazon and I needed/wanted it quickly. I did some research and the camera seemed to have all the features, including WiFi. Especially important to me was the long zoom ration of 18x. All seems to be going well with the camera and I purchased a 16 gig. memory card with it . I was a bit apprehensive about a plastic camera body, but it is not really a negative. The camera is a plus over most smart phone cameras because of the higher quality lens and certainly the zoom ratio. I would say that, for the money, this is a good buy and I am, thus far, happy with it.", "Date": "January 7, 2014"}, {"Title": "Worth the price", "Author": "Andre Luiz Saidy Clemente", "ReviewID": "R1GW3H9JZMSQH3", "Overall": "4.0", "Content": "The camera is great, but it looks very fragile. Especially the flash. It's worth the price, though. Also does no include memory card or case.", "Date": "January 7, 2014"}, {"Title": "Very fun Tech", "Author": "Amazon Customer", "ReviewID": "R3DCKUWB4EJD71", "Overall": "5.0", "Content": "I really like this camera. It is fast, takes clear and fast pictures, and the zoom is really good for a point and shoot sized camera. I love that it links up with my Samsung Note 2 phone and I can share pictures between the devices and even use my phone and a remote control to make the camera do basic commands like take pictures.Although it does have all these options and bells and whistles, it is still easy to use as a basic point and shoot camera as well. Just turn it on, set it to Auto and go!", "Date": "January 7, 2014"}, {"Title": "Cathy from Michigan", "Author": "WBrink", "ReviewID": "RNC6ZZ4DCF6BM", "Overall": "5.0", "Content": "I gave these camera's as a Christmas gift to my daughter and son, and they love them....easy set up ,easy to use ,A great camera!", "Date": "January 7, 2014"}, {"Title": "Awesome Camera very easy to use and shoot pictures", "Author": "Frankie Wilkins", "ReviewID": "R3S6UCIGYHV7US", "Overall": "5.0", "Content": "Love the professional looking pictures this camera takes. Battery is good and strong. I took well over 200 pictures before I needed to charge. Love the fact that you can upload your pictures via wifi is also awesome straight from the camera.", "Date": "January 7, 2014"}, {"Title": "Good Lens and connect it inmediately to Iphone Hot Spot", "Author": "Rafael Perez", "ReviewID": "R3TYU5RPJJE4WP", "Overall": "5.0", "Content": "Good Lenses and connect it inmediately to Iphone Hot Spot for inmediate posting to FaceBook. Smartphones and Iphones are good but cannot compare with the optical lens and flash of the WB250F.", "Date": "January 3, 2014"}, {"Title": "Great!", "Author": "James Herbadon", "ReviewID": "R39I8Y4PGFWHA7", "Overall": "5.0", "Content": "The Samsung WB250F Smart Wi-Fi Digital Camera, 14.23 Mega Pixal with 18x zoom is a really good product to buy.", "Date": "January 3, 2014"}, {"Title": "Nice camera for the price", "Author": "Robert Westphal", "ReviewID": "RVC3LHKB04GJD", "Overall": "4.0", "Content": "The 18x zoom is one reason we purchased this camera.  The zoom feature is difficult to use.  The control to zoom in/zoom out does not operate as expected.  It continues to move even after removing your finger from the control lever.", "Date": "January 3, 2014"}, {"Title": "GREAT CAMERA", "Author": "mitch", "ReviewID": "R1V286TQJZ7T7R", "Overall": "5.0", "Content": "I feel for my purposes this was a great value and more camera than I will ever get to know.  The only thing missing on this camera is verbal guide so you can really utilize all the features packed into this camera.  Highly recommend.", "Date": "January 2, 2014"}, {"Title": "Nice camera", "Author": "Daniel Driscoll", "ReviewID": "R3SJZN67MS31YO", "Overall": "5.0", "Content": "Very nice unit feels like it was made with quality in mind. Could have used more of a users manual or a Quick start guide covering more camera functions. They covered the wifi part but assumed we know what the buttons and icons mean.", "Date": "January 2, 2014"}, {"Title": "Instruction camera videos setting", "Author": "Victoria's Fashion Online Store", "ReviewID": "R3AKQPISAPOQPV", "Overall": "4.0", "Content": "This camera is good for picture taking  but not taking videos. This camera do not have instruction of how to adjust the videos setting why videos only take for 30 seconds. Can anyone tell me how to adjust because the camera package did not include full instruction.", "Date": "December 31, 2013"}, {"Title": "Great!!", "Author": "Jose C.", "ReviewID": "RW92Z1S3FMAP6", "Overall": "5.0", "Content": "Love it! All the features are very useful and the pictures and video come out great. It is a very good value for the price.", "Date": "December 31, 2013"}, {"Title": "good camera for the price", "Author": "Amazon Customer", "ReviewID": "R3NV1HU1QP8NB6", "Overall": "5.0", "Content": "This camera has not too big nor too small. The optical zoom and pictures taken have good resolution. I like the wireless feature which allows transfer of images wirelessly to any blue tooth compatible devices.", "Date": "December 29, 2013"}, {"Title": "Great Camera", "Author": "Jeff", "ReviewID": "R3M7TCOXEJNHCC", "Overall": "4.0", "Content": "As a photographer, I have a D7000 but my wife doesn't like to use it because of it's size and intimidating buttons.  We saw this camera and thought that this has just about everything you really need in a point and shoot.  The wifi is a great bonus as well as the touch screen.  I did have a bit of trouble with emailing photos to others from the camera but it seemed to sort itself out.  I love that I can import photos to my computer with a push of a button.", "Date": "December 26, 2013"}, {"Title": "Quality, Features, and Style", "Author": "Duke Leto", "ReviewID": "R33QZC48FZCHL3", "Overall": "4.0", "Content": "This camera has it all. Though lacking the megapixels that would take a picture the resolution of your living room wall, this camera is everything you need. The zoom is a bit slow compared to a physical method, but it's almost a rifle scope. The apps you get for this phone are quite superb, and uploading photos to your favorite cloud storage site is a breeze. If you're looking for a point-and-shoot that's packed with better quality and a plethora of features, look no further!", "Date": "December 26, 2013"}, {"Title": "nice compact digital camera taking great pictures", "Author": "Caroline Mast \"Caroline\"", "ReviewID": "R2QPJ628ZPAG5Q", "Overall": "4.0", "Content": "I picked it because it looks like the easiest digital camera to operate.  I hate all the technical gadgets on cameras. I just want to take pictures of my dogs as they grow and play and send them out t my friends. It is very easy to transfer the pictures from the camera to the computer which I really enjoy...One thing, there are so many different dials and things you can do, I just leave it on auto and go from there. I probably will start experimenting on different things that the camera can do as I get more comfortable using it.", "Date": "December 19, 2013"}, {"Title": "I LOVE IT!", "Author": "Alex Schroeder", "ReviewID": "R2SVUIOGMDLVSB", "Overall": "5.0", "Content": "I have to admit that when my mother bought this camera, I was a bit jealous.  I had been keeping an eye out for a decent camera because my Nikon Coolpix camera had failed on me.  I did tons of research on cameras before deciding I'd just get the same model as my mother.  It is just the perfect camera for a beginning family.  I use it to take tons of pictures of my son, as this is his first year of everything!  I love the touch screen-it rarely glitches.  The biggest seller for me was the 18x zoom in a compact camera.  Wow!  The second biggest seller was the WiFi connection.  I am constantly sending pictures to family through email from my camera.  The different settings and editing options are so fun to play with.  The panorama setting makes taking a panoramic picture SO easy and quick.  Bottom line:  this is the perfect camera for someone who enjoys decent quality pictures, but isn't too concerned with all of the details that professionals are.  It's great for capturing the life of a family.", "Date": "December 19, 2013"}, {"Title": "Doesn't focus/take pictures fast enough", "Author": "Savanna D. Wright", "ReviewID": "R1FATW67ZB57NG", "Overall": "3.0", "Content": "This was my first Samsung digital camera purchase and I haven't been impressed.  I'm normally a Cannon customer, but when my screen went black and I couldn't see the pictures I was taking I decided to try something new.  The Samsung camera as a whole seems okay...zooms good, nice big screen, etc.  My biggest problem with it is it has a slow reaction to focus and I can't take quick pictures one after another.  I don't know if I'm not using it right or what but I'm definitely disappointed about that.  I have five children and it's frustrating when I miss a good shot because for whatever reason the camera just won't take a picture.  It's almost like you have to have a little waiting time before it will allow you to shoot again.", "Date": "December 18, 2013"}, {"Title": "battery life", "Author": "Kayla Foster", "ReviewID": "R22FZFAQXMOZNJ", "Overall": "3.0", "Content": "I've only had mine a few days and I bought it from walmart. And the battery life is terrible does anyone else have that problem??? Like I'll turn it one once and use it for a few minutes put it down pick it up a few hours later and it'll be dead. Does anyone have any suggestions??? Love everything else but the battery life.", "Date": "December 14, 2013"}, {"Title": "Awesome Camera!", "Author": "Harman Dhuck", "ReviewID": "R1ZGQGKVUOM7YR", "Overall": "5.0", "Content": "I must say it's worth the money! The wifi feature of this camera is so cool, i don't need to open my laptop just to transfer photos to my iPad. I can do it directly now. It captures near excellent quality photos for a point and shoot camera category. You will always going to love the zoom of this camera, it doesn't ruin the quality of the photos.", "Date": "December 11, 2013"}, {"Title": "its my best buy ever!", "Author": "Gaston Losardo", "ReviewID": "R367Q2X3NXZER", "Overall": "5.0", "Content": "its an amazing camera, realy! perfect pictures, with a lot of modes, the 1080p record mode its almost perfect, i recomend use it with a tripod, the sound its perfect.", "Date": "December 7, 2013"}, {"Title": "Great camera for the money", "Author": "Doris", "ReviewID": "R9FRQBSKTQQ08", "Overall": "5.0", "Content": "Love this camera. Does just what I wanted it to do.I wanted a camera that I could take a picture and e mail it or directly upload it to face book without needing to plug it into the computer. Having a lot of fun with it.I hated that there was no instruction book but playing in the menu was very easy to figure out", "Date": "December 5, 2013"}, {"Title": "Good value, easy to use, many advanced functions.", "Author": "Interested Golfer \"Bill\"", "ReviewID": "RDFED2YERY786", "Overall": "5.0", "Content": "Very easy to set up and use. After charging the battery, I was able to set up the wi fi connection and send a test picture to my email account and access my Facebook account in the first 15 minutes.The documentation is sparse, but if you play with the controls and aren't afraid to try this and that with them, you should be able to get the basic functions going quickly. Keep in mind that the icons at the bottom of the viewing screen are touch sensitive and using them will save you time.I downloaded the user guide from the Samsung website and it goes into a lot more detail for the more advanced functions.Originally I was going to replace my old Panasonic Lumix with a new one, but when I saw this Samsung camera for a much smaller cost and with the wi-fi function, I decided to try it and I am glad I did.", "Date": "December 5, 2013"}, {"Title": "Great value as the price drops (WiFi, Touchscreen, 1080p video, 18x optical zoom)", "Author": "amazonshopper00", "ReviewID": "R1FBDO7EGL0TNF", "Overall": "5.0", "Content": "I bought this mew on a Black Friday 2013 doorbuster in-store for under $100.I've played with this camera for a few hours, and I have to point out that the  WiFi function is better than expected.I've read many reviews with people talking about the problems they've had uploading to anything but Facebook or e-mail. I've had no such problems. I uploaded my videos and pictures to a selected folder on my hard drive using the autobackup function. I'm able to just press a few buttons and walk away while all media that hasn't been uploaded before is uploaded right where I want it to go. This feels a lot more convenient than taking out my SD card and sticking it into a SD card reader every time.There's a lot of variety with the picture taking modes. They seem easy enough. I tried the low-light mode; it worked pretty well. Will need more time to try things out.The touchscreen \"hybrid\" is pretty cool. I like being able to touch when I want to or use the touch pad when I want to.This is a pretty camera, too. It doesn't look or feel cheap at all. The interface screens are cool. I also bought this camera because I wanted the 1080p video capability. This is an upgrade over 720p videos.", "Date": "November 30, 2013"}, {"Title": "Good pictures but somewhat complicated.", "Author": "Mutt", "ReviewID": "R26UKY68FOK97R", "Overall": "4.0", "Content": "Very pleased with pictures but the interface with computer could be better . The wi-fi  is easy to use for emailing a picture but to get several  I always connect with the cable.  These problems could be my fault.", "Date": "November 17, 2013"}, {"Title": "love it", "Author": "Lisa", "ReviewID": "R1VPHL7SFDG0H3", "Overall": "4.0", "Content": "This is a great camera, but I had to send it back because it wouldn't charge. I got another one and so far it works great !the zoom is really good, still trying to figure it all out :)", "Date": "November 13, 2013"}, {"Title": "Works great", "Author": "Gavin Boone", "ReviewID": "R2MTRKBSK28C6G", "Overall": "5.0", "Content": "Everything works as well as advertised. We have taken all kinds of pictures from family portraits tolandscape to wildlife photos. We have zero complaints. Great bang for the buck.", "Date": "October 17, 2013"}, {"Title": "Good Quality pictures with lots of extras", "Author": "Dexternights", "ReviewID": "R1RHWVDK0ANBAK", "Overall": "5.0", "Content": "Got this camera for my wife over similar priced Nikon/Canon for the extra features and Zoom. Was little doubtful on the quality, but very happy after a weekend getaway, low pictures came great and touch screen Wifi options are very helpful.The ability to take picture with touchscreen reduces the shaking effect while using button and ability to control the camera through smartphone will also reduce any motion. Wifi functionalists like email and Google + are a plus.", "Date": "October 8, 2013"}, {"Title": "Very nice, compact camera", "Author": "dhaynie", "ReviewID": "R2SMCG0MWSA01B", "Overall": "4.0", "Content": "I love this camera, as much as my husband will let go of it... does not zoom quite as much as we would like, but it is very nice.", "Date": "September 19, 2013"}, {"Title": "Excellent", "Author": "Frank311", "ReviewID": "R30MYW8APE0E1A", "Overall": "5.0", "Content": "Good device, excellent performance, really light! internet works perfect and fast! i can easily send my pictures by mail through a wifi... i recommend it!", "Date": "September 15, 2013"}, {"Title": "Very good pictures, balky zoom", "Author": "gary", "ReviewID": "R1464YIR5XDGO8", "Overall": "4.0", "Content": "Works very well for me. Sometimes the zoom is balky. Starts up quickly. I enjoy the artsy templates. Good quality sound.", "Date": "September 12, 2013"}, {"Title": "Ok", "Author": "enrique padilla", "ReviewID": "R3A0QV2Z0E8BF3", "Overall": "4.0", "Content": "I've previously owned another Samsung camera, was expecting for this model to be better. Unfortunately I'm disappointed, motion pictures have not been 100%, blurry, & unfocused. I'm hoping features have not been fully explored yet. If not,  I'll be using older model I have used before buying this model.", "Date": "September 6, 2013"}, {"Title": "Nice", "Author": "JB", "ReviewID": "R1OL6F8QW15Z24", "Overall": "4.0", "Content": "This is a pretty nice camera. It takes nice pictures and zoom function is nice for a camera this size. Set up wasn't too bad but also isn't the most straight forward. Automatic backup over wifi worked but it took a while with me playing around with the software. Very Nice buy for the price I paid.", "Date": "September 4, 2013"}, {"Title": "Great camera", "Author": "C. Calderon", "ReviewID": "R396GJBGXE1C1T", "Overall": "4.0", "Content": "Takes good pictures for what is worth, you need to do a little retouching after uploading to computer. Not all but a few. This is my second Samsung camera (other one is TL500) and I do recommend it.", "Date": "September 3, 2013"}, {"Title": "Samsung WB250F", "Author": "Kevin Sullivan", "ReviewID": "R2R2FDM1JYCM0G", "Overall": "4.0", "Content": "Picture quality is solid for a camera in this price range.  Telephoto lens tends to continue to adjust momentarily after release of the control.  Some concern with the latch lock for the battery and memory card compartment.  It's not recessed and could open without much contact while in a pocket.", "Date": "August 31, 2013"}, {"Title": "samsung smart digital camera", "Author": "jason mccleaver", "ReviewID": "R3SOMY3FH1J3YB", "Overall": "5.0", "Content": "camera is what i hope it would be, camera came threw mail and is working fine thank you jason nice pic's", "Date": "August 26, 2013"}, {"Title": "Really like my new camers.  May never learn to use so many featues.  Had to go to internet to get the instuction manyal", "Author": "edward j penn", "ReviewID": "R2ZSMH03HQQQY", "Overall": "5.0", "Content": "May never learn to use so many featues.  Had to go to internet to get the instuction manual but that worked.", "Date": "August 24, 2013"}, {"Title": "Great camera at a good price", "Author": "Dale \"DaleDJ\"", "ReviewID": "R8H9MM0APAWAT", "Overall": "4.0", "Content": "For a compact camera with an 18x zoom this seems to be a great camera. (Bought one for a relative and liked it so much I got one for myself.)The image quality is very good, but obviously not as good as an SLR with a large sensor.The camera works well in it's automatic modes and has a number of little gimmicky modes that I doubt I will ever use.The WiFi capability is very nice. It allows you to backup your photos to your computer with only a few button presses on the camera after first installing the listening software on the PC. The photo sharing to Facebook works, though, it puts all photos you share in the same Facebook folder. Email works well. You can control the shutter from your WiFi connected phone with the appropriate Samsung app installed on the phone.One feature that I'd like to see is a time lapse option, either on the camera itself, or via the phone app.The manual shutter speed goes up to 16 seconds.", "Date": "August 24, 2013"}, {"Title": "Excelente", "Author": "Crispina Deudedys Laya De Martinez", "ReviewID": "ROQKMC008PRWZ", "Overall": "5.0", "Content": "I like this camera, it's the best smart camera that I could to have, all fine, I dislike haven't money to give one to my parents", "Date": "August 21, 2013"}, {"Title": "Camera", "Author": "D. H. Talley", "ReviewID": "R1REJ0WB9GTLR9", "Overall": "4.0", "Content": "This is a small, easy to take along digital camera with very good close-up ability.  Only issue that makes me say bad words on occasion is that sometimes the close up keeps moving after I take my finger off the point where I want it and miss a shot.  Nothing terrible and I am glad I bought it", "Date": "August 20, 2013"}, {"Title": "Wonderfull Camera", "Author": "gaston4kd", "ReviewID": "R1YNXFSWNWIA2L", "Overall": "4.0", "Content": "Great features, including a wonderful zoom. Zoom mechanism is slow, but wifi functionality is incredible. Samsung needs to have a more comprehensive set of companion apps on iphone and Windows Phone Platforms.", "Date": "August 5, 2013"}, {"Title": "Piece of crap", "Author": "Thomas Czarnecki", "ReviewID": "R3M97Q5STISWBT", "Overall": "1.0", "Content": "Zoom function broke after one use. Quality was not what was expected. Will submit for warranty fix as we have had this for under two months.", "Date": "October 2, 2013"}, {"Title": "Battery Drains Too Quickly...Flash Seems Like It's Just Waiting To Break Off...", "Author": "RyanArch", "ReviewID": "R3VEAM90EX7FEO", "Overall": "2.0", "Content": "I'm giving this camera a 2-star rating for several reasons.  The first being a crazy fast battery drain while shooting video...I shot 20 minutes of 1080p video and took maybe 25 flash photos and the battery was in the red...and since there is no stand alone wall charger for the removable battery you're stuck carrying the charging cord and wall wart everywhere you go.  I needed this camera to last through a full day if possible...and was easily able to drain the battery in just a couple of hours.  The second reason is that while it is a \"smart camera\"...I found that it is constantly shifting modes while in 'auto'...resulting in some fairly odd looking photos where plenty of light was available and the flash should not have been thrown...or images that were too dark when you would think the flash should operate.  Which leads me to the third reason...the pop-up flash...this (while perhaps a neat feature)...seems like it could easily snap off due to such a small mechanism...and I found myself having to take pictures several times in order to use the flash...the first shot I would forget to engage the small button to release the flash (I'll admit operator error here)...the second to retake the picture...and a third try to get it right....this is nonsense...I've got small kids and they don't sit still forever.I had high hopes based on some of the reviews...but in all seriousness...some of the settings and gimmicks make this camera seem more like a toy fit for a kid.Should've went with my gut and bought the Canon 330HS.", "Date": "November 4, 2013"}, {"Title": "Great Value", "Author": "Frank G.", "ReviewID": "R2ID60G14PNTXL", "Overall": "4.0", "Content": "This point and shoot camera has fair to good picture quality.  The connectivity with other devices, optical zoom, and large lens in my view make this camera worthy of purchase and unbeatable for the price.", "Date": "June 22, 2013"}, {"Title": "But not for me", "Author": "Gail C. Lyon \"library lady\"", "ReviewID": "R296BUPM1V9U1W", "Overall": "2.0", "Content": "It is a great camera but not for me.  I guess I will always need an eye piece lens thingy.", "Date": "April 14, 2014"}, {"Title": "I love this camera", "Author": "Jan", "ReviewID": "R26R801TAY6OAJ", "Overall": "5.0", "Content": "It takes amazing photos even at a distance.  I love that when I am home, it automatically picks up the wifi and I don't have to connect to the computer to send photos to facebook,email, etc.  I have had it for 3 months and I keep learning new things I can do with it.  It is a wonderful product, glad I got it at a discount, and just love, love, love it.  I have three vacations this year and I am happy that I will be taking amazing photos!", "Date": "April 4, 2014"}, {"Title": "Mixed review", "Author": "Susan M. Mahoney", "ReviewID": "RNO8V0SW0JFI4", "Overall": "3.0", "Content": "I love the ease of use with this camera and the picture quality is awesome. One of the main reasons I purchased it was for the wifi capability and the feature allowing me to automatically download pictures to my PC without hard wire connection. I have attempted this many times with no luck and have contacted Samsung support several times and had less than stellar help from them. I love the camera, but am frustrated in the sought out feature that I can't get to work.", "Date": "March 29, 2014"}, {"Title": "Easy to use", "Author": "Browntown girl", "ReviewID": "RVC1G35H5223Q", "Overall": "5.0", "Content": "Takes great photos; My eleven year old child was using it hours after she opened it without assistance.  Takes great photos and nurtures her creative side with all the edit options.", "Date": "February 19, 2014"}, {"Title": "So far, so good", "Author": "Insectophile", "ReviewID": "R3LYVVA318F18K", "Overall": "4.0", "Content": "Hasn't seen extensive use yet so this review will be updated later.Purchased straight from Amazon (not third-pary) and was received in a factory-sealed box.So far...PRO* Touch screen response is great.* Wireless Auto Backup works well (although it's not truly \"auto\" because you still have to choose \"auto backup\" from a menu on the camera, and the camera cannot be used for any other purpose while the backup is ongoing).* Motion Photo feature is great fun* In-camera email and Facebook functions are easy to set up and use* iOS app for using iPhone as remote shutter performed nicelyCON* Difficult to get a non-blurry shot handheld when zoom is above 9X in AUTO mode (no matter how steady I try to hold it).  This is less of a problem using my Panasonic Lumix with similar zoom range. Both tout image stabilization.* The white wrist strap was missing from the box. To get a replacement strap I spent nearly an hour on chat with a Samsung rep who kept telling me the serial number on my camera was invalid. Finally, after emailing him photos of the number on the box and the number on the camera he agreed to ship a replacement.  The strap arrived promptly but it was gray and not white.**Not yet sure how the photos taken so far fare until I download them for analysis.  More later...", "Date": "December 25, 2013"}, {"Title": "Good point and shoot", "Author": "Yu-jin Chia \"Yu-Jin Chia\"", "ReviewID": "R15VYFM681JB5D", "Overall": "4.0", "Content": "This is the second Samsung point and shoot camera I've owned, the previous one being a DV300F dual-view. That one was rather unique in having a front-facing LCD that makes it a lot easier to take selfies. It served us well for some time, but one day we found out the hard way that the zoom mechanism is very fragile. It was dropped from a pretty short distance and the whole thing jammed up. I disassembled the camera and repaired it myself, but from then on the autofocus was a wee bit wonky.The WB250F is similar in some respects, different in others. It has the same wi-fi options, no dual view, but touchscreen controls and 18x optical zoom (the DV300F and most other point and shoots are 5x). The zoom is probably the most notable feature of this camera, as it's exceptional for a point and shoot. Some others can reach that level with combination optical/digital zoom, but digital zoom in general is pretty awful- I'd say it borders on useless due to degradation in quality.The camera is surprisingly responsive for the cost. It has decent shutter speed and zooms quickly, and the touch controls respond fine. You can touch to focus just like a smartphone, which can be useful if the AF is misbehaving. That said, autofocus seems relatively fast and smart for a point and shoot. The zoom works very well- you can take close-ups of objects at long range with very good quality. It's not quite as good as a DSLR with a telephoto lens, but hey- that's not what you're after if you're even looking at this.The flash is pop-up, and it works okay. I have noticed it tends to be a bit too powerful at close range, but that's a problem with many point and shoots. The body itself is a tad on the bulky/large side for a point and shoot, but by no means unmanageable and still a lot smaller and lighter than most mirrorless cameras. It has button controls that can perform all functions alongside the touchscreen. The camera charges via micro-USB input and comes with an AC adapter. It uses full size SD, not micro-SD like the DV300F. It has built-in wi-fi for sharing pictures, and also shoots excellent full HD (1080) video.I got this on sale for $100 and at that price I'd heartily recommend this camera for anyone looking for a point and shoot. Even at MSRP, it's easy to recommend due to the big pluses: excellent zoom, wi-fi enabled, and convenient touch control that it doesn't force you to use. The zoom in particular makes this camera 'useful,' in the sense that it's a lot better than any cellphone camera. On the downside, it is a bit bulky (though not heavy) for a point and shoot- many of the other options out there are a lot more pocketable. I also know from previous experience that the zoom mechanism is fragile- be very careful when handling it and don't put any pressure on it. Lastly, battery life is so-so (no small wonder, you'll probably be amazed by how tiny the battery is). To some degree this is an issue with all EVF cameras, but this one (and it seems, most Samsung cameras in general) seem a bit worse than average. It's not terrible, but you may need to charge on the go if you're planning to use it all day. The good news in that regard is there's an abundance of external battery packs out there that you can easily use to charge the unit without an outlet.", "Date": "December 22, 2013"}, {"Title": "A very satisfied customer!", "Author": "Rose Gonzalez", "ReviewID": "RAII47LI52FZ9", "Overall": "5.0", "Content": "I chose this rating because it's what I have been looking for.  It offers more than just a camera.  It also offers the luxury of a video for those \"cute\" pet adventures to share with others.  Plus it's simple enough for the inexperienced photographer to enjoy and share with family and friends and make it look as if you aren't such a novice (even if you are).", "Date": "October 23, 2013"}, {"Title": "not good quality action shots", "Author": "Amazon Customer", "ReviewID": "R1UEGG6OUNKY0", "Overall": "3.0", "Content": "I enjoyed the wifi abilities with this camera, very easy to do and convenient.  I did not like the picture quality.  Even with changing the settings to decrease shutter lag, the action shots did not turn out the way one would hope.  I returned this camera.", "Date": "October 7, 2013"}, {"Title": "Samsung Camera", "Author": "Spiritforce", "ReviewID": "R2DT32KY75AW4V", "Overall": "4.0", "Content": "My friend had a Samsung WB250F and I was impressed with the digital screen and close up of a flower that she had taken. However, I take photos of my art work and the clarity wasn't that great but it seems to perform OK on most pictures.", "Date": "September 7, 2013"}, {"Title": "Great Camera", "Author": "James Neglia", "ReviewID": "R26JR5Z3N5S2VF", "Overall": "5.0", "Content": "I adore this camera. Perfect size, wi-fi capabilities are excellent, filters, options, lens - it has the entire package at a price that is friendly to the consumer. I can recommend this camera without reservation.", "Date": "September 5, 2013"}, {"Title": "are first samsung camera", "Author": "edwin feyrer", "ReviewID": "R14KW9NYYSZ4AG", "Overall": "5.0", "Content": "we don't use a camera all the time , but fore the ease of taking pictures this is far better then are old one which was Kodak the photos are clear and bright and the color is perfect I would recommend this to anyone looking to buy an inexpensive camera I have other Samsung products an think its a great company with great products  ed feyrer", "Date": "August 11, 2013"}, {"Title": "Great Camera", "Author": "Nita", "ReviewID": "R1JOSHY16W5V4N", "Overall": "4.0", "Content": "Love this camera, didn't think I would like the touch screen but it is really nice. Close up pictures are fantastic. My complaints, turn on and off switch is flat with camera so hard to find. The knob that control what kind of picture you take is easily moved. So every time I take it out of its case, it has turned to a different setting. Wish it had a little more zoom but for the price it is a great little camera.", "Date": "August 5, 2013"}, {"Title": "Excellent Camera", "Author": "Galia G.", "ReviewID": "R3PCJEGBU31NB0", "Overall": "5.0", "Content": "It is everything I was expecting for. Great pictures and camera features. The equipment is light and easy to use at any moment. I am glad I choose this model.", "Date": "June 25, 2013"}, {"Title": "i love it", "Author": "REYNALDO DEL ROSARIO", "ReviewID": "R3Q1LUQKXD7TB3", "Overall": "5.0", "Content": "thanks, the price is right and my wife like it very much. The item is so nice and good to use.", "Date": "June 22, 2013"}, {"Title": "Excellent choice at great price", "Author": "Gregory Krauth", "ReviewID": "R2PCFRU0ROF9N6", "Overall": "5.0", "Content": "Compact, smooth operation. Fairly simple operation. Haven't taken it to the rugged backwoods yet, but expect it to hold up well.", "Date": "June 17, 2013"}, {"Title": "Samsung doesn't guarantee satisfaction.....Rip-off", "Author": "Shirley Ramos", "ReviewID": "RQ16NQ7B4H9WS", "Overall": "1.0", "Content": "Bought this for my vacation to Europe.  On day 3, the zoom lens was stacked and can't use the camera at all.  Called Samsung tech support when I got back from vacation but tech support cannot help, saying that the serial number doesn't exist.  Weeks later, I got an email from Samsung tech support, asking for serial number again.  I responded to the email but I did not hear back from Samsung ever again.  It's been 6 months. What a rip-off.  I ordered this camera through Amazon.com and was shipped from Beach Camera.  Will not buy any camera from amazon.com, never again.", "Date": "December 1, 2013"}, {"Title": "Does NOT come with memory card!", "Author": "Bookman", "ReviewID": "ROVHNH3YJED2B", "Overall": "2.0", "Content": "No memory card makes this unusable to take photos when you receive it!  That should be clear upon purchase!!! You have to spend extra money to make it work!!!", "Date": "June 3, 2014"}, {"Title": "good enough as a travel camera", "Author": "Grace11", "ReviewID": "RAE7WE2KGYMZ6", "Overall": "3.0", "Content": "nothing particularly special, some photos come out blurry but I do have shaky hands, can't always focus at the zoom i want to, is a bit jerky. Works for a pocket camera.", "Date": "May 30, 2014"}, {"Title": "Great Camera for a Mom Like Me!", "Author": "BFlo", "ReviewID": "R2SZ4BZGJA44RX", "Overall": "5.0", "Content": "I'm beyond thrilled with this purchase. I'm in no way a professional photographer, nor do I understand most of the technical lingo of all of the camera features/abilities.I wanted a camera that succeeded the quality of my smartphone, and could capture photos of my little boys while they're running around. I hate that my phone camera doesn't like fast moving toddlers, so thank you Samsung WB250F!Compared to my husband's old point and shoot camera, I'm amazed at how far these cameras have come. I love scrolling through all of the fun features. I especially appreciate the fact that I can upload my photos directly through wifi to social media and to my phone!My camera came safely packed with a wall plug, USB cord, wrist lanyard, and a manual (although, I haven't used the manual yet because this camera shows tool tips with everything if you hover long enough).", "Date": "May 8, 2014"}, {"Title": "It Passed My Rigidity Test", "Author": "Green Iguana", "ReviewID": "R1701XQMIK4KYR", "Overall": "5.0", "Content": "I bought this camera out of necessity; my Fuji HS30EXR was in its third month of service and I was looking for a quick CMOS replacement. I am happy to say that this camera performed very well during a recent trip that included beaches, sand, rain, mist, waterfalls, low light and occasional bumps.The Samsung WB250F's body is metallic. This is a definite plus because the camera feels much more sturdier and is much more durable than its plastic body cousins. I find its grip to be more than sufficient as well. In fact, there is a small thumb rest positioned on the rear of the camera. Besides having a CMOS sensor, one of the main selling points of this camera is definitely its zoom capability. I have to point out that it zooms slower than a snail crossing a road when recording video. I believe there is a setting to make this camera zoom faster, although you will sacrifice zoom speed with motor noise. I did not find zooming during video to be too much of an issue because I mainly used this camera to take photos with.This camera's zoom capability is a good selling point (as I mentioned in the last paragraph). To me, the zoom seems crisp and is exceptional in many situations. I have bumped this camera's body and I have even bumped its extended barrel. After such treatment, the camera still did its duty and worked for me. There were also other elemental conditions in which this camera was exposed to. I have taken photos in many situations (including situations with high humidity) and this camera has performed flawlessly. I didn't notice any difference in shutter speeds or processing times in adverse environments. The battery life is pretty good as well. Although there is no information on battery life, the battery that this camera uses seems to last a long time before needing to be recharged.There are more great things about this camera (such as touch screen and WiFi), but I chose to write this review based on the camera's capabilities as a camera. This camera did not disappoint me on my trip and I do not think it will disappoint you.", "Date": "May 5, 2014"}, {"Title": "160 page operator's manual for a \"Point and Shoot\" camera?", "Author": "Harold R.", "ReviewID": "RDRZQGBQTXZA3", "Overall": "4.0", "Content": "The camera works well in \"auto\" mode and the wireless upload to my PC is terrific. This 79 year old will probably never learn to use all the other features. The on line manual is daunting.", "Date": "May 4, 2014"}, {"Title": "Sports mom", "Author": "a old fashion parent", "ReviewID": "R3JDDM231U4D2H", "Overall": "5.0", "Content": "Was very happy with the variety of ways to share the pictures and quality of them along with photo options.  This is by far a great gift for a sideline mom at sporting events that does not want something bulky.", "Date": "April 3, 2014"}, {"Title": "Very nice", "Author": "WILLIAM", "ReviewID": "R3QQCKZGOYDO07", "Overall": "5.0", "Content": "Very nice camera. I can take clearlly  pictures including objects at 200 m. Also I can load pictures to my cloud or email via WIFI", "Date": "March 31, 2014"}, {"Title": "Looks great, but takes blurry pictures", "Author": "Jill Somers", "ReviewID": "R2Y5ZAY8NZV9QX", "Overall": "2.0", "Content": "Not happy with this camera.  I ended up returning it for a Canon.  I had trouble uploading and using the wifi function.  More of a headache than anything.  Sorry Samsung...I usually love your products.", "Date": "February 24, 2014"}, {"Title": "Sooooo SATISFIED!", "Author": "Shana", "ReviewID": "R2NUNO5BU6AO4G", "Overall": "5.0", "Content": "This camera is amazing! I was expecting it to actually look different Because,  i only got it at about a third of the price. Thank you so much!  What i was looking for.  The features of WiFi and connect to smart phone and take pictures and save to phone gallery. ... Are amazing!  Never seen anything like it.  I able to edit send the pictures via email, facebook, youtube, and skydrive which means i can retrieve them in the cloud with my lap top and tablet with my Microsoft account. I'm am s satisfied with the condition and everything was brand new.  Thanks again Amazon!", "Date": "January 31, 2014"}, {"Title": "Terrific little camera but pop up flash died", "Author": "Amazon Customer \"Mtngirl\"", "ReviewID": "R6XY9G4JK1XG2", "Overall": "4.0", "Content": "Warning: pop up flash refused to pop up after 2 weeks, so I am returning the camera. Too bad because it's a terrific little camera.Pros: lots of great software in camera, good image quality,  touchscreen interface is excellent,  fun to use, wireless is perfect,  small sizeCons: must focus, then refocus on some shots, hesitates just like the computer that it is when it is going from one input to another, pop up flash won't pop up after 2 weeks of use.", "Date": "January 19, 2014"}, {"Title": "Not for me", "Author": "Terry Sz.", "ReviewID": "R1BWKF6DHFIQ6S", "Overall": "2.0", "Content": "I really do not care for this camera at all.Seems balky to use and looks and feels cheaply made!It is going back!", "Date": "January 17, 2014"}, {"Title": "samsung digital camera", "Author": "Ellen M. Hyatt", "ReviewID": "R62KO5MP5VUSS", "Overall": "3.0", "Content": "The photos are not as clear as my digital Panasonic. I would have stayed with the Panasonic but it got dust particles on the lens that could not be removed and showed up as black dots on the printed photos.. Several friends had the same problem so decided to try another camera. I even took the camera to 2 repair shops that told me it was a common problem with Panasonic and had just got one in the day before. I would not recommend the Samsung to friends. Most operating buttons are difficult to see also.", "Date": "January 12, 2014"}, {"Title": "Nice camera", "Author": "Al", "ReviewID": "R2OZ95XIBVQ40F", "Overall": "4.0", "Content": "The only knock I would give it is that it has capacity for 1 picture in the internal memory and does not come with an SD Card to increase the memory.  I gave this to my daughter for Christmas and she was unable to really use it until we went to the store and bought a memory card. I don't really remember if that was offered in the product information but would have been an important tidbit to add if not.", "Date": "January 8, 2014"}, {"Title": "Good camera", "Author": "Ricardo Otarola", "ReviewID": "R3TRSUF9S76881", "Overall": "4.0", "Content": "I made a mistake and ordered it on White when I wanted it black. But any way it is a really good camera that can interact with the rest of the Samsung product line.", "Date": "December 28, 2013"}, {"Title": "VERY NICE", "Author": "Kelvin Walker", "ReviewID": "R1ZWLTABWV6423", "Overall": "4.0", "Content": "I AM VERY PLEASED WITH MY PURCHASE. THE ONLY PROBLEM I HAD WAS THE CASE I ORDERED DID NOT FIT THE CAMERA. THE CASE WAS TO SMALL", "Date": "December 19, 2013"}, {"Title": "Good camera, not so good user interface", "Author": "Amazon Customer", "ReviewID": "R31PKDYHDSB13S", "Overall": "3.0", "Content": "Great optics and great pictures.  Only problem is it is not very obvious to use.  You need to dig through the menus.It needs to be like my phone, when I walk into a Wi-Fi area that I've used before, it should automatically link up.", "Date": "November 3, 2013"}, {"Title": "Camera", "Author": "Jim", "ReviewID": "R1UH9ES6553AQD", "Overall": "5.0", "Content": "The camera I purchased was a great camera.  It worked great for taking all types of pictures.  I give it five stars on the ratings chart on this review.", "Date": "October 19, 2013"}, {"Title": "Good Product.", "Author": "Richard Mendoza \"BPS\"", "ReviewID": "RH57HPTE7U690", "Overall": "5.0", "Content": "is a very good product, would recommend. The zoom is excellent, the image is impeccable, my need for the product is perfect.", "Date": "October 14, 2013"}, {"Title": "Wonderful!", "Author": "C. Hylton", "ReviewID": "RLW1QNMAJX2IP", "Overall": "4.0", "Content": "The best camera ive ever used.... Its simple and does everything it  says.... battery life is great.... last forever... pictures are sharp!", "Date": "October 2, 2013"}, {"Title": "Wi FI love it.", "Author": "Gerry H. Santerre \"gerr\"", "ReviewID": "R39IBAQREFCNB4", "Overall": "5.0", "Content": "Great pics.Loades to facebook easily.Wi fi is awsome.I only wish i could have more than one account on it at once.", "Date": "September 11, 2013"}, {"Title": "Good buy", "Author": "Rosanne Bonaventura", "ReviewID": "RWY0IUYFMLUC0", "Overall": "5.0", "Content": "I'm still learning the ins and outs of this camera.  Yo can get an app which makes it easy to transfer pictures from the camera to your computer.  This is a big plus.", "Date": "September 4, 2013"}, {"Title": "Sometimes dead when connecting with the WIFI", "Author": "Not interesting", "ReviewID": "R2HXTENCBQYNL1", "Overall": "3.0", "Content": "Sometimes dead when connecting with the WIFI, and I have to take out the battery to stop it working. But it's a very pretty camera anyway in white!", "Date": "July 29, 2013"}, {"Title": "M'eh", "Author": "brechmos", "ReviewID": "R1KGWDYULTUY1O", "Overall": "3.0", "Content": "The zoom is great and the pictures are all right.  I do have some issues with this:- The flash does not automatically popup in low light conditions. You have to manually pop it up. (Stupid)- I can't update the firmware using the software Samsung provided for Macs. I contacted their help people and he told me I had to use a Windows machine.  Really?- The WIFI auto backup is the same issue. You have to have a Windows machine.- The pictures aren't great, tend to be a little blurry unless you have the flash on.  But for a small camera I guess they are fine (my prev camera was Canon G10).I honestly hoped for more given it was a Samsung.", "Date": "June 24, 2013"}, {"Title": "Confusing", "Author": "James C. Brolin", "ReviewID": "R1X480HD95OOAX", "Overall": "2.0", "Content": "I returned the camera because because the minimal direction were very confusing.  I was especially interested in the WiFi addition to the camera but there were no instructions on how to use it.  It may very well be a good camera, but I am not a good enough technician to use it.  Too bad.  I want my money back and have returned the camera.", "Date": "July 12, 2013"}, {"Title": "SNAP IT", "Author": "Jammsac", "ReviewID": "R1VUH353IXCQQB", "Overall": "5.0", "Content": "Super good deal. Pictures are clear and defined. there are some neat and cool features. i will recommend this product.", "Date": "March 30, 2014"}, {"Title": "Coul have been good", "Author": "Geo", "ReviewID": "R2I8X4K1458FPZ", "Overall": "2.0", "Content": "I replaced my old cameras with this one.  I like it in white as it looks sporty.  However;  they seemed to have forgotten one basic but big feature, image stabilization.  Ive been taking pictures since I was a child and always have to pics thst everyone wants. Now, too many pictures come out blurry. Looking into it further,  I noticed the camera doesnt have image stabilization.  After practice and being very aware of being extremely still I can take ok pictures.  However, every time I ask someone to take a group picture with me in it, they are always blurry.  Sadly I got crappy christmas pictures that I will never get the chance at again.", "Date": "December 26, 2013"}, {"Title": "CAMERA WITH INTERNET", "Author": "customer H", "ReviewID": "R1LRQSL0X7GT9P", "Overall": "5.0", "Content": "Best Camera Ever--I got it to do all of things mentioned that it does, though most I don't use daily but it is dependable and takes great pictures!", "Date": "November 8, 2013"}, {"Title": "Quality", "Author": "gabalot", "ReviewID": "R3C0FEN28M2FRR", "Overall": "5.0", "Content": "I gave this camera five stars because the company was top notch to work with and I returned the camera without a hitch and refund was fast.  I just didn't research it well enough to know that it didn't have some of the features I was looking for.  I wanted a view finder as an option and a removable lens and didn't like the flash.  For the excellent price of the camera it is a great camera.  It did show error twice regarding \"not enough memory\" for the photo but that could have been the old memory card I used or user error.", "Date": "October 7, 2013"}, {"Title": "The wifi Connection Experience Could Be Better", "Author": "G. Bennett", "ReviewID": "RK69V4ET9DTJC", "Overall": "3.0", "Content": "You have to let the camera and the iphone each time you use the camera. Then tell the phone it's okay to transfer each time. I was hoping to be able to shoot away and have all the pictures on the phone. It does have a flash which makes it a bit better than my iPhone for photos, but not the experience I was looking for.", "Date": "July 14, 2013"}, {"Title": "BROKE WITHIN 3 MONTHS!!!", "Author": "Cara", "ReviewID": "R2UGYJYIYMXXUA", "Overall": "1.0", "Content": "I bought this camera to take on a once in a lifetime trip around the world and it broke within 3 months!Now I can't click to return it via Amazon because it's past the return, there doesn't seem to be anyone I can email regarding this faulty product. Its TERRIBLE customer service and the LAST time I will buy from Amazon.I was so sad, I was in India with the most incredible opportunities to take photos, a chance I will never have again and this NEW camera broke.Please can someone contact me to help me and try and fix the huge inconvenience this caused.", "Date": "February 16, 2014"}, {"Title": "meh", "Author": "david marcinkowski", "ReviewID": "R3GAINBYIWR4QU", "Overall": "4.0", "Content": "Tbh. My phone is faster and takes clearer picture. The camera is plastic but rigid. Works exactly like advertised. No problems 3 months into purchase.  Next time will buy higher end model.", "Date": "March 27, 2014"}, {"Title": "INSTRUCTIONS ARE NOT GOOD ENOUGH !", "Author": "Ken Hunter", "ReviewID": "R8ME7YAMNM8CG", "Overall": "2.0", "Content": "camera is just fine; however, the instructions are terrible!!! For example, I made a mistake entering the date/time data and there are not instructions about how to RESET...downloaded 160+ page users manual and there are none there either. ...Whar a pain in the rear!", "Date": "February 14, 2014"}, {"Title": "Did not come with charger that works in the United states", "Author": "kman65", "ReviewID": "R3TKFL980OZOW9", "Overall": "2.0", "Content": "Camera seems to be fine, however the charger is not for us in the United States. Suggest you verify before purchase.", "Date": "April 18, 2014"}, {"Title": "NO MEMORY AT ALL!", "Author": "valerie carter", "ReviewID": "R1D05562ECP56Z", "Overall": "2.0", "Content": "How can a camera have absolutely no memory? I read all the reviews on this camera and was very excited when it arrived.  I love the features that it has and most especially the capacity to share pictures with my iPhone.  After taking one single picture, the memory was full! I realized that there was no memory card included and no built in memory either.  I went online and ordered some additional accessories including a battery charger, memory chip and case.  In the meantime, I can not really use the camera efficiently despite installing the Samsung camera app on my phone and being able to share the pictures with my device because so far- I can only share one picture.  Very frustrating!", "Date": "January 9, 2014"}, {"Title": "Each Shot is a Gamble", "Author": "Dean 1900 \"Dean 1900\"", "ReviewID": "R5YK1HXCSJ143", "Overall": "2.0", "Content": "It takes a good photo.However. It comes with no documentation.And the larger viewer is basically unusable in most kinds of light. You aim the lens in the general direction of the object, and hope for the best.I never would have ordered it, if I knew there was no documentation and so often no way to see what you are photographing.Picture quality is good. But just about every name brand offers good picture quality.", "Date": "March 29, 2014"}, {"Title": "Camera is always dead/down", "Author": "Lee Ann", "ReviewID": "RKBHP5MMGLD2V", "Overall": "1.0", "Content": "Quality of the camera is very bad. We've been using Canon camera w/ 7.8Magapixel and 3.8X optical zoom since 2007, this camera is supposed to be an upgrade and come out to be much worse. The camera is always dead/down (like a computer doesn't have enough ram and become dead) while we switch in modes or between modes, or even try to zoom in and out. The Direct Link botton is located right at the holding spot, so when holding the camera to take a picture, most of the time this botton is pressed without you knowing it. The touch screen is not sensitive at all, I keep touching it and no response come out, really hate it!  The Picture qualilty is so so, even with a much larger resolution, the quality is no better than my 2007 Canon camera. I have samsung phone and headphone and like them, and that's why I want to trust the same brand, but it is a really disappointed product.", "Date": "September 16, 2013"}, {"Title": "Buyer beware - good pix but TERRIBLE uploading options. Not recommended.", "Author": "E. Goldman", "ReviewID": "RXRZC83R74GQH", "Overall": "2.0", "Content": "Do not buy this lousy POS. The only reason it gets 2 stars is that it takes really goof pictures BUT uploading your pix afterwards is nothing but misery. The WiFi connection DOES NOT work as advertised. If you want to upload to your computer you have to go thru a very messy and convoluted process. NOTHING about this camera is simple.", "Date": "November 16, 2013"}, {"Title": "Not happy at all", "Author": "Brendastarshine \"BookBabe48\"", "ReviewID": "R33UERDTC3PYXN", "Overall": "2.0", "Content": "Wow- what a disappointment.  Will probably go back to my $99  6 year old little pocket Sony.  Almost impossible to not get blurred photos if any motion at all is involved!  The zoom mechanism is jerky and time-consuming to focus and oddly placed; NO manual comes with it and I shouldnt have to download a 40 page document to find out how to work the dang thing.  Thought I was moving UP but this is almost more trouble  than its worth.", "Date": "April 23, 2014"}, {"Title": "just absolutely horrible", "Author": "htp", "ReviewID": "R2NIV9AKS7GETG", "Overall": "1.0", "Content": "Every camera takes good photos.  My 10 year old Olympus was great.  I bought this camera to make it easier to transfer photos and videos to cloud storage.  It is completely inept at this.  WiFi direct is incredibly erratic, you have to reestablish the link almost every time.  The smartphone app is horrible and also erratic.  I am using a Galaxy S3, you would think this would be a natural communication.  Also, Samsung tech support has been absolutely awful.  My GS3 experience was great, this camera is a disaster.", "Date": "April 22, 2014"}, {"Title": "It arrives damaged.", "Author": "Bercelino J. Ramirez", "ReviewID": "RSL891Q0009WL", "Overall": "1.0", "Content": "The flash is not working. Appears to be previously opened, looks like a camera used in an exhibit.Very dissapointed.", "Date": "January 1, 2014"}, {"Title": "I think I would have liked it if it worked.", "Author": "Susan", "ReviewID": "R2G8SHWEQ7HIKY", "Overall": "3.0", "Content": "I received the camera and charged it and turned it on and the screen was so bright you had to turn it straight down to be able to see the screen.  I called Samsung they walked me through the routine and decided it was defective. I got a refund because I needed the camera faster than the could get me a new one. If it had a good screen I think I would have liked it.", "Date": "May 18, 2013"}, {"Title": "camera", "Author": "so sweet", "ReviewID": "R175NZQFTXYDGT", "Overall": "1.0", "Content": "Idid not have any luck with this camera and I depended on it when I went to Europe. It did not fuction properly for a new camera.", "Date": "August 21, 2013"}, {"Title": "did not recieve this item", "Author": "jeevan", "ReviewID": "R3I1OP3FM3OV4X", "Overall": "1.0", "Content": "i never got this item when i purchased for expedited delivery for a gift the delivery guy made a very poor choice in delivering this item by leaving it at my front door bc when i arrive at my door the item was not there. this item never got to me.", "Date": "January 7, 2014"}, {"Title": "choose it in white", "Author": "G.Erbamm", "ReviewID": "RJURVF8DCO71P", "Overall": "1.0", "Content": "Where to start? Truly if there were minus stars this would be a good time to use them. Clumsy lay out ugly piece of plastic looks like it came freshly printed out of a cheap 3-D printer. Underlined by a plastic bullet screw mount that surely won't survive more than a couple of weeks.  Horrible image quality barely living up to the camera of a high class smart phone, flat washed out colours, mostly overexposed and almost never sharp. The highly praised WiFi capability is very slow often not working at all and to make matters worse every time you want to use it, lose the connection (happens about every five minutes) or simply have closed the app and want to go into it again you have to go through the entire cumbersome connection process. I promise you will be so happy that the camera came with a USB cable to use instead. You are much better of, infect it works twice as good, to buy yourself a WiFi SD card.If you still can't help yourself and really have to buy this camera at least choose it in white you may be lucky leaving it on your fridge one day to never see it again and if you belong to the unlucky ones like me that bought that piece of *#$$ already just use it as a sinker on your next fishing trip.", "Date": "July 5, 2013"}], "ProductInfo": {"Price": "$249.99", "Features": "Capture Detailed Images in Low Light situations with a 14PM BSI CMOS Sensor\nShare your Best Photos Instantly with Family and Friends with Built-in Wi-Fi\n18x Optical Zoom\n3.0 TFT LCD Screen\nSamsung color designation is \"Cobalt Black\". Black refers to the color of the lens. Camera color is a dark blue.", "Name": "Samsung WB250F Smart Wi-Fi Digital Camera (Cobalt Black)", "ImgURL": "http://ecx.images-amazon.com/images/I/41JHUi2cWcL._SY300_.jpg", "ProductID": "B00BINFLK2"}}