{"Reviews": [{"Title": "I love it", "Author": "Debbie West", "ReviewID": "R3863NXMIRQBFO", "Overall": "5.0", "Content": "I went back and forth for more than a year Canon/Nikon... Canon/Nikon.... I finally settled for Nikon because most everyone else loved the Canon better... what can I say... I am a Rebel.... ha ha... I love this camera... I am still learning to use it as I don't have tons of time to devote to it... I bought it for the lenses the extra battery, and the memory card... that alone was worth the bundle.  I have put on the uv filters just to save my lenses... It keeps them clean...", "Date": "December 31, 2013"}, {"Title": "Crappy tripod, great camera!", "Author": "B. Gillund \"sugarplum\"", "ReviewID": "R3FLPEL1ZFL24F", "Overall": "4.0", "Content": "Tripod was broken when we got this. Camera takes fantastic pictures, disappointed we have to buy another tripod without even getting to try this one out, but this one was very flimsy/cheap anyway.", "Date": "September 10, 2013"}, {"Title": "The Camera was OK, but the camera Bag was covered in Mold!", "Author": "David & Stephanie Veillon", "ReviewID": "RD7SRSZ4XJSDU", "Overall": "2.0", "Content": "Everything in the kit was there, but the camera bag is covered in mold. It's disgusting. The bundle was an OK deal, but for $1000 you would think it would be in better shape and not moldy.", "Date": "September 9, 2013"}, {"Title": "JUST, WOW!!!!!!!!!!!!!!!!!!", "Author": "Gary Feduccia", "ReviewID": "RLY9GMHKXOKA", "Overall": "5.0", "Content": "Heck guys, the last SLR I used was some 20 years ago with the Nikon film N8008S, that I still have beside me. It is in fine condition with the several lenses and the Nikon Speedlight SB-25 that I used, and just needs some several \"AA\" batteries and 35mm film to come alive.  I am very sad that film has hit the technology threshold toward digital; but anyway . . . .Just took my new D5200 out on a working assignment for my BassPro Shops job and it did a wonderful series of pics on auto.  I have also found the auto/manual focus slide switch on the lenses to be useful to go from auto to manual focus, when I had some contrasting items in the viewfinder.  Yeah, I'd rather use the viewfinder than the \"Live View\" provided with the articulated screen on the back.  I only use the back-viewer on my beloved P510, which is a GREAT Nikon bridge camera!!!I could do without another cheap tripod and some of the other accessories that were included.  I DO NOT NEED ANOTHER MINI TRIPOD!!!  I would rather have a polarizing filter and a three-pack of ND filters included with the kit.Great DEAL and great PRICE, ALWAYS at AMAZON!!!  Wonderful place to order from!G.Feduccia@Cox.Net", "Date": "September 8, 2013"}, {"Title": "Best decision made...", "Author": "Sharl", "ReviewID": "R2VSC0TNIH66BG", "Overall": "5.0", "Content": "This camera is the first DSLR type I have ever purchased.  As a novice, I did some extensive research and determined that it would likely ease me into the photography that I'm interested in exploring.  The first and most appreciated quality of this camera was the fact that I took it out of the box and immediately could take photos - I was not intimidated by the many functions, dials and buttons.  There was no \"learning curve\" involved to take that first picture. The auto-focus had my photos coming out fail-safe!That having been said, the features on this camera are remarkable and have me learning more and more about the ease in which this camera operates under many different conditions to achieve the effects my imagination is wishing to realize.  The camera is allowing me to grow into many facets of photography.  The longer lens provided many new and incredible options for my photos.  While there is still an amazing amount to learn with this camera, it has become fun and has lent itself to a great new hobby.  Recently on vacation, I took approximately 1000 photos and, save for a few photos that were not well-thought out, they all presented me with an incredible recount of my time away.The bundle package was a nice deal and, as I continue to shop and evaluate pricing, it allows me to feel good about getting a great deal.", "Date": "September 6, 2013"}, {"Title": "Great Camera", "Author": "Big Geek Daddy", "ReviewID": "R18H3XICYFXBT3", "Overall": "5.0", "Content": "Finally decided to upgrade from pocket digital cameras to something much more powerful and nicer. I have never used a Digital SLR before and found this one to be about as simple as it gets. Bought an Extended Battery as the main battery and use the one that came with this package as the backup. Battery life is great and have taken over 1000 sports photos without it running out. Nikon MH-24 Charger on the other hand sucks. Broke within a month and wouldn't charge battery. I was saved by the backup battery I had that was fully charged and allowed me to get through a travel weekend without missing any shots.Love the Lenses that came with this camera as well. Again, very easy to use and the 300mm one takes great sports shots. I have no idea how to use all the settings on this camera and really don't know if I'll ever get that far into it. Auto and Sports mode have met 99% of my needs so far. I know the serious photographers will laugh at that but it's true. I'm an amateur and love this camera!", "Date": "July 8, 2013"}, {"Title": "WOW  what a camera", "Author": "David Moyer", "ReviewID": "R1V8G1IHLKUBT7", "Overall": "5.0", "Content": "A really great package deal! 300mm zoom lens is a Must. Should have had a larger bag though for all the goodies that it comes with. Tri-pod could be sturdier to support this much camera", "Date": "August 17, 2013"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B00B787JRQ"}}