{"Reviews": [{"Title": "Great photos. Charging quirks. Display quirks outdoors. Excellent auto mode", "Author": "Jeffrey Stanley", "ReviewID": "R1PY2P27KLP8Q3", "Overall": "4.0", "Content": "I bought this last week at Best Buy after reading tons of reviews of various NEX and Micro 4/3 cams. I have previously owned a Canon D20 full-size DSLR, a Canon S100 semi-pro compact, and another Canon \"Elph\" compact. The S100 is the Camera which I have previously used the most. It has a bigger sensor than most compacts of that 2009-era, and a fast lens. I have rarely used my DSLR because it is too large and you look like a wanna-be camera geek dragging it around.The photos from this Sony are impressive. Color is great. Exposure is spot-on. It takes decent shots even at high ISOs (up to 1600 look very sharp). Movies look incredible. It records truly DSLR-grade photos. My DSLR is dated. It won't sound like much saying that it takes better photos than my Canon D20, but, wow. It has twice the pixels as the D20 but takes in just as much light. What an amazing upgrade.Honestly, I expected quality photos. I have read enough pro reviews of other NEX cameras with the same sensor to know that this camera is great at recording beautiful images. What I did not expect is how great the \"auto\" modes on this camera are. This camera's skill at automatically choosing the right settings for you is why you should buy it.I never studied photography in school, but I have read enough, and have enough consumer experience to know how to balance aperture, speed, and ISO to get great shots. Because I'm not an experienced or pro photographer, setting everything on the camera has always been a bit trial-and-error. I've forced myself to do this chore because I always end up with better shots than most camera's \"auto\" modes. Well, if you're an amateur like me you may find yourself proudly turning the mode dial to the \"superior auto\" mode on this Sony. Unless you're a pro, this camera is great at quickly analyzing a scene and choosing the ideal settings. I still love to tinker when I have time, but it is invaluable to be able to turn the mode to \"auto\" and know your images will be brilliant.I have only taken this camera out twice. Both times I needed to have the camera ready in a hurry for a few shots and just switched it to \"superior auto.\" The shots have been nothing short of amazing in some very difficult lighting. The camera's \"superior auto\" mode doesn't just jack up the ISO to take in enough light, like most dumb cameras I've owned. It does all sorts of crazy tricks (like merging multiple exposures) and delivers breathtaking results. Today I photographed a couple who were forced to stand in the shade so we could get a landmark framed just-right in the background. The landmark was in bright sunlight. Looking at the final photo, there is no hint of anything but perfect lighting in both the foreground and background. All I did was point the camera. It even recorded a full-res' copy of the photo cropped much better than I had framed it. It is completely nuts how smart this camera is. It gives you all of this brilliant help without doing anything. On the images where the camera provided its own crop, it recorded both my framing and its own version of the image. It must have upscaled the images it automatically cropped, because they are not missing any flippin' pixels. The quality looks just as good as the wider-framed version I composed. Wow.Shooting indoors sans-flash is just as great as you would expect when using a camera with a big sensor. It gathers tons of light, even in dim rooms. The slow kit lens will force the camera into ISO 3200 if shooting via lamplight and you will see noise in some indoor shots, but it is far superior to any point and shoot. True SLR quality in a compact-ish body. Shooting in \"intelligent auto\" mode delivers pro results. The camera doesn't intimidate subjects like SLRs tend to do. It's feather-light and easy to keep at your side. I'm completely in love with this camera!The largest compliant that I saw when reading professional reviews of this camera, were about difficulty accessing settings vs a real DSLR. It's true that every setting is accessed using camera menus, but I have found the layout and ease of access to controls very impressive. It is more intuitive than the menu system on my Canon cameras. The main reason that I bought the camera at a store was so I could mess around with the menus and settings to see if the all-digital controls would be a deal-breaker for me. The fact that I could easily access and control everything quickly without having even read the manual was the thing that pushed me over the edge to make the purchase. I find the control menus to be really good and I would not want to trade this camera's small body for a bunch of dials which only occasionally save me a half-second button press. Having used the camera, the \"superior auto\" mode is much better than lots of easily accessible dials when you need to take a quick shot anyhow.The included strap is too short to wear across your body if you're a bigger guy like me. It's fine if you wear it only around your neck but I hate carrying a camera like that. I find it easier to carry the camera at my side with the strap across my body. I had to buy a better strap. I highly recommend the BlackRapid RS10SC-1AO Metro Camera Strap (Black), even though it is overpriced. It is slim enough that it is a great match for the little sony NEX, and it has solid reliable-looking metal hardware.Another minor complaint is the lack of a viewfinder or accessory port, which the other Sony NEX cameras have. I would really like to have a viewfinder, and because this camera lacks the accessory port, adding one is not an option. I haven't had great difficulty framing my shots using the screen on the rear of the cam, but I'm just old fashioned and miss having a viewfinder.Update:Lowered review to four stars for a few reasons:I have run into a few situations where the display was too dim to frame shots properly in bright sunlight. There is a setting to put the display in \"sunlight\" mode which helps, but it is buried in the setup menu. The fact that this is not an automatic setting is absurd. Perhaps I'm spoiled by my phone and tablet, which do an admirable job of adjusting the display to light conditions, but the tech isn't groundbreaking and would be a huge asset to a camera where the display is the only option when framing shots. The lack of viewfinder, even as an add-on option, is the biggest shortcoming of this camera. After my last use, I have started to keep the camera in \"sunlight\" mode just to guarantee that I can use it easily outdoors when needed.Several of the pro reviews and a few amateur reviews complain that the battery charges in the camera rather than in an external charger. I like in-camera charging and it is better than trying to remember to carry an external charger like my Canon cameras. I have a few micro USB chargers around for charging other devices (like my headphones and my Kindle). The problem is that the camera charges very very slowly. I was charging in my car on a three hour drive a few days ago and it was not able to fill the battery in this time. Also, it is very sensitive to charge faults. If you just plug it in and forget about it, you may find that the battery failed to charge at all. You should check the camera to insure the charge light is not flashing after it has been plugged in for a while (flashing indicates a charging problem). If you have a charge problem, you must unplug it and try again. Most of the time you must remove and re-insert the battery. It often requires several tries to get it to begin charging. This is a major inconvenience.In the IAuto+ mode that I love so much, white balance is sometimes off. It can be severe when shooting indoors with incandescent light (very yellow cast). It can be corrected if shooting raw, but it's a pain. Shooting in raw mode also reduces the effectiveness of the exposure tricks it plays in intelligent auto mode. It's too bad that Sony doesn't allow adjusting white balance in the auto modes. The best solution for accurate white balance shooting indoors, without flash and without using raw, is to use aperture priority mode, shoot wide open, and set the proper white balance yourself.I use a Mac. As of this writing (4/30/13), Apple's Aperture and iPhoto software do not support raw images from this camera. Sony provides a decent simple image editor called \"Image Data Converter\" for the Mac which works well. It is very straightforward and basic, but it gives lots of options for adjusting RAW images and doesn't have unnecessary BS trying to sell you prints and calendars. It's just a plain-Jane image tweaker for fine tuning and exporting RAW images as JPG. Apple is pretty regular about updating their software and I expect support soon, but the 3N is brand new and not supported in Aperture/iPhoto.Update 6/3/13: Apple updated OSX with raw support for the NEX 3N. Raw images work in Preview, iPhoto, and Aperture.Note about lens upgrade experiences:I purchased the Sigma 30mm F2.8 EX DN- Sony E 330965 lens to supplement the kit lens. It does give a slight advantage shooting indoors. At 30mm (45mm equiv), the kit lens is f5 and the Sigma is 2.8. This gives about 1-1/2 stops of light gathering ability. In real-life, it only gives about a half-stop (handleld) because the kit lens is stabilized, allowing you to shoot a slower shutter speeds. I wish I had spent a bit more and bought the Sony SEL35F18 35mm f/1.8 Prime Fixed Lens instead. It's two full stops faster and includes image stabilization. it is more than twice as expensive as the Sigma, but offers a much greater advantage in real world use compared to the kit lens on this camera.Conclusion after using it 5-6 times and a month of ownership:The cam is compact and takes great shots. The kit lens is slow but acceptable in good light. If you have any doubts about not having a viewfinder and money is no object, spend a bit more and get an NEX 6 or 7. All NEX cams are compact. This one is more compact but you aren't going to get this thing in your pocket anyhow. Considering how much I have complained about not having a viewfinder, I would still buy the 3N again simply because of the low price compared the the rest of the NEX line. $450-$500 is a lot of money to me. The NEX six and seven are double the price. Remember, there are SLR options with optical viewfinders for similar pricing, but they are too large for everyday carry in my opinion. You really should go to a camera store to compare several cameras side by side. Personally, if money were no issue my ideal setup would be the NEX 6 body and the Sony 35mm f1.8 lens for a total of about $1200. The 3N is HALF the price of the 6 with the exact same kit lens, and 1/3 of the price of my \"ideal\" camera example.This camera isn't perfect but it is hard to beat for the money.", "Date": "April 13, 2013"}, {"Title": "Great value with very high image quality, a sleeper hit for 2013!", "Author": "Tech Enthusiast \"Z\"", "ReviewID": "R27R9K1IAXUQ91", "Overall": "5.0", "Content": "I am a long-time, diehard Canon enthusiast who was in search of a large sensor compact system camera (CSC). To give some background, I've owned the following: S400, SD700, S90, XTi, XSi, T2i, 60D, and S95, with the latter three being in my current arsenal. The S95 is compact, but I've grown weary of its noise levels in low light and the fact that pictures from it still possess a point-and-shoot feeling. The T2i has excellent IQ and I love it, but it's on the edge of what I find convenient for travel. To that end, what I desired most was DSLR quality in a more compact form.To fill this gap, there are Micro Four Thirds, 1\" sensors, and a host of small body mirrorless APS-C variants. I also had a budget of $700 or less, because as technologies improve and become less expensive each year, I really didn't feel like spending a grand or so on today's camera tech. Having read, researched, and tested some models in my local B&M;, I whittled down my candidates to the RX100, EOS M, and NEX-6 (though the 6 was getting out of budget). The RX100 was very attractive and highly acclaimed in the media, but at $650, it was pricey for essentially a P&S.; Bearing a styling birthed from Canon's S90+ series, I had lingering doubts about getting yet another high end P&S; which costs over twice as much as the S90+ series!. If I lowered the weighting of cost, then this was definitely on the top of my list. The EOS M was attractive as well since I was very familiar with Canon's crop sensor DSLR line, but the new EOS M mount has such a limited supply of lenses and I wasn't planning on spending an extra $150 for the M mount adapter. Rated battery life of 230 CIPA for the EOS M was very disappointing too. Last, I investigated and liked what I saw from the NEX line as an alternative to the RX100.With APS-C sized sensors, the NEX mirrorless CSCs were starting to check off all my requirements, one by one. Though I liked the NEX-6, it was out of my budget, but it was at this point that I stumbled upon the NEX-3N, the current entry-level NEX from Sony. The 3N was released just months ago and was so new that professional reviews were sparse compared to the amount of literature on the RX100, for instance. As another reviewer summarized, the 3N gives you all the core features of the 6 at nearly half the price! Bonus features are stripped: wifi, EVF, high res LCD, and dedicated mode dial, all not present on the 3N. But look - same APS-C sensor, same IQ, same kit lens (16-50), same core features as the 6, but nearly half the price! This was compelling.So, it became a duel between the NEX-3N and RX100. In favor of the NEX-3N were:  * cost ($500 vs $650)  * APS-C sensor vs 1\"  * tilting lcd screen for self-portraits and tough shooting angles  * battery life (480 vs 330 CIPA)  * wider starting focal length of 24mm vs 28mmWhile the RX100 has a faster lens, it's only faster at the wide angle start of the zoom range. Furthermore, the larger APS-C sensor of the NEX-3N can match the faster lens of the RX100 as it relates to depth of field.Finally, here's a list of miscellaneous tips and things of note:  * because of the low res LCD screen, don't use it to pixel peep to check for sharpness (countless times, I've had doubts whether I had accurately focused, but upon import of the pics to my iMac, I was pleasantly surprised with the results, with a very high hit rate of sharp keepers)  * use focus peaking and coloration to focus along with DMF; use the LCD screen for framing  * if you come from a Canon background, the Sony menu system takes some time to get accustomed to  * looking for the perfect case? check out Lowepro's Dashpoint 20... fits the NEX-3N like a glove  * use the bounce flash to beautifully light up your subject  * get a 40.5mm UV filter and forget the lens cap  * the camera software has a tendency to quickly bump up the ISO in low light situations and favors high ISO vs slower shutter speeds... because you cannot limit or cap the ISO when it is in Auto ISO mode (unlike Canons), your only alternative is to hard set it to a lower ISO to force a slower shutter speed and reduce the noise... also, ISO configurability is only available in PASM  * some bemoan the lack of an external charger, but I found it convenient to use the same charging systems as those for my phone and tablets, plus, the battery does indeed last a very long time  * it's compatible with Eye-Fi cards  * videos are beautiful, zoomable, and auto-focus  * three ways to zoom provide great flexibility  * I don't use the camera strap; instead, I use a BlackRapid Metro sling which works beautifullySony made the right design choices in their quest to distill the bare essentials of the NEX line down to the core and achieve their MSRP of $500. So new and underrated, but so good. It's the sleeper hit of 2013.The NEX-3N is not perfect, but for me, it exceeds my needs.", "Date": "June 21, 2013"}, {"Title": "Nice Small Camera, Small-Minded Manufacturer", "Author": "Rodwally", "ReviewID": "RALILFDN76TR8", "Overall": "3.0", "Content": "THE GOOD:  The NEX 3N is said to be the world's smallest camera based on the APS-C sensor, which is the second-largest sensor (about 16mm by 24mm) commonly found in mass-market cameras.  The result is fine photo quality in a small package, with good high-ISO performance.  Moreover, the 16-50mm e-mount kit lens is optically decent, and retracts to semi-pancake dimensions when the camera is off.  So you get true DSLR-like performance in a box that approaches pocket size -- and is indeed pocket-ish size when paired with one of Sony's true pancake lenses, such as the new and nice and very expensive 20mm e-mount.THE BAD:  The 3N handles slowly thanks to so many functions and settings being based in menus rather than in manual controls; a settings-control wheel that's small, jumpy and hard to handle; slowish focusing, and the 16-50mm kit lens, which telescopes at a leisurely rate.  Worse, the 3N lacks some of the settings that we take for granted today in any capable camera, such as the ability to customize the parameters of the auto-ISO function or even to control the volume of the focusing beep.THE UGLY:  In a fit of the Cheaps and/or the Dumbs, Sony decided not to include a battery charger with this camera.  Apparently, they've made the same annoying move with the NEX 6, which is the $1,000 big brother of the 3N.  But that's OK, says Sony, because owners can charge the battery inside the camera -- using a tiny cable that the company did include in the kit.  (I haven't encountered this very bad in-camera-charging idea since I bought a Canon G1 in 2001.)  Sure, Sony, this is just what I want to do on my vacation: sit in a hotel room watching my camera charge my spare battery.  Of course, a Sony website will happily sell you the company's very own (and very good) NEX-class charger for $55 plus tax (at other websites it costs more like $40, if you can find it).  I would much have preferred a higher 3N kit price -- with the furshlugginer charger included.", "Date": "April 23, 2013"}, {"Title": "Great upgrade from my point and shoot", "Author": "MTB Dude \"MTB Dude\"", "ReviewID": "R38YPSCXLWCZQ", "Overall": "5.0", "Content": "I'm new to photography and was tired of the often times poor picture quality from my point and shoot. I was looking to get better quality pictures without breaking the bank. Additionally, I wanted a small camera that was portable and not as bulky as a DSLR. Thus, the interest in the micro 4/3. After a lot of research, I settled on the NEX line of cameras. While the added features in the NEX 5, 6 and 7 were enticing, the cost was what prompted me to choose the NEX 3N. It uses the same sensor as the NEX 5, and although it lacks some of the features of that camera (including PDAF, higher video recording quality etc), I felt the NEX 3N offered everything that I was looking for at a fraction of the price. This little camera has far exceeded my expectations.Set up: I use the 16-50mm kit lens, have also acquired the sony 55-210mm telescopic lens as well (fabulous lens, review to follow). Plan on getting a few prime lenses in the near future.Initial impressions: The camera is small and well built. I can shoot with one hand even with the telescopic lens. The LCD has adequate resolution. The tilting feature is useful. Upgrading from a point and shoot, I'm used to shooting by using the LCD only but would see the disadvantage of not having an EVF to a more experienced photographer used to a DSLR. Image quality even with the kit lens is excellent, even at moderate to high ISO. The AF is a bit slow, particularly under low light and at max zoom but adequate for my needs. The auto features are excellent and I have taken some great pictures in this setting, but the camera really shines when under manual or aperture priority mode. There are plenty of excellent features to keep me interested and shooting everyday.My major gripe, as has been mentioned in other reviews, is the menu. It is not intuitive at all and often slow to maneuver. It's a bit cumbersome and thus I find myself sometimes pressing button after button trying to find the feature I am looking for and not snapping away. While annoying, I suspect that as I get used to it, this may become less of an issue.Conclusion: for the price, I can't imagine having made a better upgrade from my point and shoot than the NEX 3N. Considering all of the features, quality build, portability and picture quality, I have been more than satisfied with my purchase. While I wish the menu was a bit easier to use, I think with time this won't be as much of an issue. If you are looking for an upgrade for a point and shoot or perhaps a second camera for the more experience photographer, definitely keep this little gem in mind. I look forward to seeing how it performs with some quality prime lenses in the near future.", "Date": "January 1, 2014"}, {"Title": "If you're considering a DSLR, this is worth a look first", "Author": "Yu-jin Chia \"Yu-Jin Chia\"", "ReviewID": "R1NRASDREULJAN", "Overall": "5.0", "Content": "First to make one thing clear: I'm not a professional photographer, don't really have and probably never will have the inclination to learn enough (or spend enough) to be one. What I do want to be able to do is to occasionally get better image quality than a typical point-n-shoot or cell camera offers.This isn't to say point-n-shoots and smartphone cameras are all lousy; they aren't- especially these days. They're also a sight more compact, lighter, and handier than any semi-pro, prosumer, or pro camera on the market. For impromptu or casual pics, they're pretty hard to beat. However there are times when I do want something better, and that's where something like this comes in.The reason I say you should consider this if you're in the market for a DSLR is that I wish I had. I actually bought a DSLR first (a Canon EOS Rebel T3) and honestly, this thing shoots better pictures most of the time from my experience. It's also a whole lot lighter and smaller; in fact it's not a whole lot worse in that regard than a point-n-shoot. This isn't to say these mirrorless cameras are perfect or a match for a DSLR in every way, but I'd say the advantages outweigh the disadvantages. These are how they weigh up according to my experience with these two cameras- both of which are aimed at people like me (an amateur looking for a step-up from a point-n-shoot):NEX-3N:Compact and light: this is far and away the biggest advantage of these mirrorless designs over DSLRs. The Rebel T3 is actually on the lighter side for a DSLR, but even that I find to be a bit too heavy and bulky for a lot of situations. While it isn't quite as compact or light as a typical point-n-shoot, the NEX-3N comes pretty darn close. It's still not pocketable (primarily because of the lens) but it doesn't feel like it's strangling you either. It is very maneuverable as a result of the handy size.Better screen: the NEX-3N's screen is larger, sharper, and has a better menu layout. The UI in general is a lot more intuitive and easier to use than the Canon's, though I should point out that it had better be: there's no optical viewfinder on this camera and it lacks comprehensive mechanical controls. Furthermore, this screen can pivot 180 degrees, making it very useful for angle shots or selfies.Very good shots with auto: Using superior auto, this camera tends to just work. It doesn't produce blurred out images nearly as often as the T3 even when the latter is set to action/sport mode. It produces excellent quality pictures in all light conditions and doesn't automatically fire the flash all the time (something a lot of cameras do in auto modes, which I find very irritating). For someone like me that finds manual modes too cumbersome and complex, this is great.Better video: I'm not big on using these for recording video, but generally speaking the NEX is better at this. It shoots full-HD (the T3 is 720p) and the small size makes it a lot easier to hold and manipulate. You can use it with mini tripods easily, whereas the T3 is too big and heavy for anything less than a full-up tripod stand.Self-cleaning: The NEX has a sensor cleaning mode. The Rebel T3 doesn't. This isn't a big deal for me, but if you're the type that changes lenses often this can be a big plus.Rebel T3:Better battery life. On a single charge, especially if you use only the optical viewfinder, this guy can last at least 800 shots. In fact the battery lasts so long that you really don't have to think about it- it'll probably last a whole weeklong trip of use. This isn't to say the NEX is bad; on the contrary it's very good for a camera that uses an electronic viewfinder. It has a hefty battery that gives it more run time than any point-n-shoot I've seen, but that's still quite a way's behind a DSLR.Better for manual shooting. If you do want to use manual modes, this one is a lot easier to use. The difference is all the extra buttons and dials which allow you to easily adjust ISO, focus, shutter speed, etc. If you want to do this on the NEX, it's possible but you have to navigate menus which simply takes longer.More and cheaper lenses available: I'm not really planning on buying any more of these things at the present. However, if I do it'll almost certainly be a Canon EF-S telescopic lens or one of the numerous 3rd party clones. These are generally a lot cheaper with more options than the Sony SEL/SELP lenses. Practically all of the Sony lenses are actually more expensive than the camera itself, which I find a bit ridiculous.Somewhat faster autofocus/zoom: this is a bit of a trifling distinction, but the T3's focus and zoom are a bit faster. This makes it a bit better for capturing things that are moving quickly at range.These two cameras are practically identical in cost now, so they're a particularly valid comparison. I should note that neither of them is particularly quiet- if you really care about that, Nikon seems to do a lot better in that regard. However, I'm really not bothered by the clicking noise and don't consider it a serious issue. For my purposes and the way I use them, the NEX is a lot more useful than the T3. However, I'll readily acknowledge that this might not be the case for everyone out there. If you're planning on really getting into photography- learning how to shoot in manual mode and getting a bunch of lenses- the T3 is almost certainly a better gateway camera.Regardless, if you're looking for a step up from a point-n-shoot, the NEX-3N is a superb choice. It combines ease of use with novel hardware (especially the rotating screen) and excellent optics and sensor. The auto modes work well and along with the DSLR-size APS-C sensor produce really amazing shots. Best of all, it's small and light enough to take along anywhere you go.", "Date": "January 1, 2014"}, {"Title": "Great Alternative to DSLR for Most People", "Author": "Shawn C.", "ReviewID": "R2SN9B9OE1QWZN", "Overall": "4.0", "Content": "This is the latest budget Nex Camera (Nex 3 line).  I strongly recommend this camera to anyone who is in the market for DSLR coming from the point and shoot camera.  Most consumers who get DSLR don't get other lenses.  Most people who bought them wanting better picture quality than there point and shoot only own the kit lens and the telephoto (If it was included in the kit) that they bought with the camera.  They are not interested getting into photography.  They just want better \"DSLR Quality\" pictures with pretty bokeh.  This camera will be 10x better for those consumers than a traditional DSLR that is huge.  It has great auto feature with lots of toys to play with.  It also renders JPEGs well in my opinion which is important to those who will never bother with the post processing they images.  You will get plenty of bokeh for close portraits as it has same sized sensor as the larger DSLR which is one of the factor in determining Depth of View.  You are not going to invest in more lenses.  Just get this camera.  It most closely resembles a point and shoot camera and it delivers best image quality with most depth of field when comparing with other mirrorless cameras like Nikon 1 or M43 cameras by Panasonic or Olympus.  It's also very compact with the new 16-50mm pz lens.  It also has neat features like 180 degree tilting display for self shots, 3D panoramas, art filters to play with, good tutorial menus, and HD videos.  Most importantly, it takes as good a picture as any consumer DSLR out there currently.  Just get this camera and be done.If you are a more advance photographer who is interested in photography, this is still a great camera to get.  I personally prefer the F3 for better grip and few more features.  I even prefer the 18-55mm lens over the 16-50 pz lens as I feel more in control with the 18-55 than the power zoom of the 16-50mm.  F3 also seems to be built slightly better than this model with hot shoes for bigger flash or EVF.  3 series of nex cameras have been purposefully crippled somewhat.  There is no reason for iso to start at 200.  Also, there is no reason to top the iso lower than 5 series since they are using same sensors.  Also, videos are crippled as well to differentiate 5 series and the 3 series other than the build quality.  I would skip the 5 series just because if you value evf, nex 6 and 7 are better value.  Additional evf for 5 series and even f3 is just too expensive.  Get F3 if you already have a DSLR and just want something more portable.  I personally use Sony Nex for casual shooting but want good image quality.", "Date": "November 6, 2013"}, {"Title": "Excellent Portable High Quality Camera", "Author": "Trader One \"ogr4evr\"", "ReviewID": "R1HMUC7O8P90NP", "Overall": "5.0", "Content": "Bought this camera as an early adopter from B..... Camera. Got the white model with silver lens. Very nice form factor for light and portable travel camera. Main reason purchased was for video and APS size sensor. Sony really hit the sweet spot with this package as the 16-50 power zoom lens is great for mass market appeal especially the zoom switch on the camera body like on most P&S; cameras. Build quality is excellent for this price point. Video quality is exceptional and ability to smoothly zoom while filming is really the icing on the cake for the average video shooter. This camera has all the features of the best P&S; camera plus added benefit of the APS sensor that allows RAW photos with much broader dynamic range. This is a great backup to a more serious DSLR camera mainly for the hobbyist.I have mostly Panasonic 4/3 cameras and lenses but this is the perfect travel camera with a little better high ISO range that adds to flexibility in tough lighting situations. This is my first interchangeable lens Sony camera. The NEX form factor was always appealing but the oversize lenses prevented my purchase as the lens/camera combination provided no advantage over other brands. The 16-50 power zoom lens changed my mind on the NEX but the power zoom lever on the body sealed the deal for me.I highly recommend this camera as it is the absolute best package available from any brand as I write this review. If you can be satisfied with only one zoom lens in a nice size this should be high on your review list.", "Date": "April 8, 2013"}, {"Title": "Great pictures from a small camera", "Author": "Yuri", "ReviewID": "R1SO49VB10XKZ7", "Overall": "4.0", "Content": "I've had this camera for half a year now, and I'm very happy with it.Pros:- size- built-in flash- pretty good performance in low light- smart enough for beginners, tweakable enough for more advanced photographersCons:- menu is not entirely intuitive- some functions are way too many clicks away (e.g. display brightness)- flash is too bright (and settings are too hidden)- on auto, there's some overexposure- no viewfinder", "Date": "December 5, 2013"}, {"Title": "It's all about the sensor", "Author": "Oleg Mikheev", "ReviewID": "RS2GTZMT994IB", "Overall": "4.0", "Content": "I don't like big things. Being a techie I have this \"the smaller the better\" attitude.I had lots of point-and-shoots in my life. Each time I had to get one I spent so much time trying to find the dream camera - the smallest one with the best picture quality.Unfortunately, it appears that the size of the sensor still matters. The bigger sensor will get you better picture. So, I came to this camera, as it is the smallest camera with the biggest sensor.What's more unfortunate is that this camera is the cheapest of the \"big sensor\" interchangeable lens world. Thus, the sensor is pretty much all that you get for your money. (...well, not quiet, the lens that comes with it costs $300 if purchased separately)There is a huge list of what you won't get, compared to a P&S; twice as cheap as this one:- Zoom. It doesn't advertise it anywhere but SELP1650 lens that comes with it is just 3x zoom, so if you got used to 46x zoom in your cheap FinePix - there is no luck for you here. 46x zoom means focal lengths 24 - 1104mm (35mm eq) and the best you can find in SLR world would be something like 109-465mm (35mm eq) and that would cost you additional $500 minimum.- Time lapse. It's impossible to do time lapse with Nex-3n. You would need its more advanced sibling like Nex-5N. But it doesn't have built-in flash, so you need Nex-6. But it's almost 2 times as expensive than Nex-3N. Uh-oh.- Display. As some other reviewer mentioned Nex-3N display is a step down compared to Nex-3. And it's not because of the resolution, it because it doesn't tilt down any more, so you can't take pictures while raising your camera above the crowd.- Controls. P&S; are super user friendly, so you'll be shocked by the number of clicks you would need to make just to change the focus mode. And most times you need to change focus mode you need it really fast, but that's just not the case here.- Internal memory. There is none, plain zero.- Charger. You won't get it, since camera is your charger. Needless to say that Nex-3n is not functional while charging, and it can't be accessed from a computer while being charged.The list can be continued.But in the end, if picture quality is more important to you than all these features, you need a small camera and you're not ready to spend $xxxx - this camera is you.", "Date": "July 18, 2013"}, {"Title": "It is the best Compact Mirrorless Camera in the range of $ 300", "Author": "Eduardo", "ReviewID": "R3C2FWHXY3HRYF", "Overall": "5.0", "Content": "The competitors in this price range are:- Panasonic Lumix GF3 is a rather outdated model and also has a smaller sensor than the APS- C ( has a worse performance in low light conditions , and have more distortion by adapting SLR lenses ) .- Samsung NX2000 that has touchscreen and several features to make editing and sharing photos over wi - fi , but the overall picture quality is worse . Furthermore , the camera with the kit lens is much more massive than the NEX -3N . And the kit lens lacks optical stabilization ( if your hands are shaking too much, the picture will be blurry ) .- Olympus E series that have the same problems the Lumix GF3 .- Nikon 1J2 which has an even smaller that the Lumix GF3 sensor.- Pentax Q which has an even smaller sensor than the Nikon 1J2 .Of course the NEX - 3N is not perfect . The two main problems are: auto focus sensor does not have phase detect , and this causes the focus to be more slow and inaccurate. And the screen is too dark and low resolution , which makes it very difficult when setting attributes under the sun .Some say that the NEX - 3N has few buttons , but the operation is very convenient . To swap the functions ( automatic, manual, scene ) , just press the center button and turn the dial . To adjust the aperture and shutter speed , just push down and turn the dial . To adjust the manual focus , just press the shutter button halfway and rotate the zoom ring . And all these operations are always visible on the screen .Another strong point of the NEX - 3N is the image quality , the photos in daylight has a very professional look. And the performance in low light conditions , outperforms any of the competitors mentioned above .Finally , NEX -3N is very compact , it has almost the same size as a compact super-zoom HX9V. With the lens attached, NEX -3N is twice the thickness of the HX9V.The most compact bag for NEX - 3N is the Lowepro Dashpoint 20 , which fits the camera with 16 -50mm lens and a memory card . The dashpoint can be hung on the strap of the backpack or belt .Another interesting bag is the Lowepro Apex 60 AW which fits the camera with 16 - 50mm lens , memory card , lens hood and two extra batteries . The apex can be hung on the belt , but not in the strap of the backpack.", "Date": "March 20, 2014"}, {"Title": "sony camera", "Author": "Donna  E Alexander", "ReviewID": "R1ZWNUO52ANJO6", "Overall": "5.0", "Content": "This camera was purchased for me by my husband, I wanted to be able to take quality picture of my beautiful granddaughter.It was exactly as described, It takes great pictures and is easy for me to use.", "Date": "January 4, 2014"}, {"Title": "Great Camera!", "Author": "Chris", "ReviewID": "ROJ819VERIY43", "Overall": "5.0", "Content": "This camera takes fantastic photos with very little work.  I needed a camera for my upcoming honeymoon and wedding so I purchased after doing a little research.  Mission Accomplished!  I leave it on auto and point and click... Great photos!  Very happy with my purchase!", "Date": "December 30, 2013"}, {"Title": "Really sharp pictures, way better than a point-and-shoot!", "Author": "chelszilla", "ReviewID": "R1IF4X8NNXCAJL", "Overall": "5.0", "Content": "I mean, of COURSE it's better than a point-and-shoot.  And it better be for the money!  Anyway, I do really like the camera.  I've only had it for about two weeks, so I don't know what all the features do, and I'm by no means a camera expert, but I have been having a lot of fun with it!  We have a trampoline and it's been really great to capture all the mid-air shots from the kids.  I personally really wanted a nice camera that was fast to get those kid-shots.  It re-loads quickly and takes the shot pretty immediately, both of which things were the most important to me.  It also takes extremely sharp pictures in good light, doing the blurry background thing that is really cool, too.  I will say I'm a little bummed the night pictures aren't better.  It has a decent built-in flash, but there isn't really anything to write home about with the night pictures.  Again, though, I haven't read through the whole manual and tried out all the buttons yet, so hopefully I will find a better option.  (I will try to remember to update this when I do!) The menu is SUPER easy to use and there are even tips built right in, like an explanation of what the heck aperture is and how to get it to do what you want it to do.  That is helpful for someone like me who isn't technically challenged, but I'm also not really interested in being a professional photographer, either.  I just want nice pictures of my family and friends!  So anyway, bottom line, I recommend this camera.  It is very compact, it takes beautiful pictures, and is very easy to use!", "Date": "April 9, 2013"}, {"Title": "Fun, small, light camera, great for selfies and bokeh (blurred backgrounds)", "Author": "Alberto Vargas", "ReviewID": "R3G37TKJ3T0UKQ", "Overall": "4.0", "Content": "My current quest (around Christmas 2013) to find a camera which takes DSLR-quality photos but is small and convenient to carry has ended with finding the Sony NEX 3N. This review is specifically about the black NEX 3N model (I know that Amazon sometimes lumps several models together).This camera is great for casual photographers who want great image quality combined with convenience.By comparison, I have three old Canons which have served me for many years and I still use occasionally: a small PowerShot, a G-series, and a DSLR. A lot of the time these days I take photos with my Moto X due to its convenience and great image quality. I recently purchased, used, and ultimately got rid of the Nikon 1 J3, Samsung NX 2000, and Samsung Galaxy Camera superzoom, and I have played with a few more mirrorless cameras plus Sony RX100 etc. The Sony NEX 3N is the best camera of the bunch for my needs. Here is why:PROS:- Large APS-C sensor, same size as my DSLR. Helps with low light performance and allows you to easily blur the background for portraits. The latter is very hard with smaller sensor cameras, even with the 1-inch Nikon 1 series.- Very small and lightweight body with the kit 16-50mm lens. The lens is a folding design so it is smaller then not in use. Overall the NEX 3N is of comparable size to the Nikon 1 J and S-series, but the kit lens on the Nikon J protrudes more and makes it bulkier. The Sony is also lighter than the Nikon 1 and much lighter than the Samsung NX series.- Great ergonomics and one-handed use. You can easily hold the camera with your right hand (there is a nice grip for your finger tips), turn on the camera with your thumb, and operate the power zoom near the shutter / on-switch. Neither the Nikon 1 nor the Samsung NX allow you to do this - they are two-handed cameras. The ergonomics of the Nikon 1 are particularly bad in comparison.- Flip LCD screen for selfies (snapshots of yourself). This is amazing! In the first hour of owning this camera, we took our best family portrait while having fun with this feature. Very kid friendly too.- In camera HDR works very well. The images that come out have a balanced look and do not look like posterized caricatures (or the typical \"HDR-y\" look online)- 4 frames per second is great for capturing motion, especially kids- Taking video is easy and zoom and focus works well. Supports 1080i60 and 1080p24 as well as some lesser modes.- In-camera charging using micro USB, which is what most phones and tablets these days use. I can thus charge the camera in my car, for example.- Decent battery life. I have yet to run low on a family daytrip. That said, energy usage is high like on a point-and-shoot due to the extensive use of the LCD. DSLRs last a lot longer. When I can, I recharge at the end of the day.- \"Superior Auto\" is a great mode which I use most of the time. Besides automatic scene detection, it also gives you quick control over background blur, filter effects, saturation, etc.- As of this writing, this was the most affordable APS-C sensor camera. I bought mine used, and it was a screaming deal for a DSLR-sensor camera. Even priced as new, I think it is a bang for the buck. The other Sony NEX cameras are much pricier BTW.CONS:- HD video is in AVCHD format, which is not super PC-friendly and looks like Flickr does not support it directly. I have a way to transcode it to MP4, but it would be nice if the camera supported more mainstream formats.- No 720 HD video modes. Those are usually good for smaller video files or smoother motion tracking, but not available here.- No touch screen. This is not a big minus since the menu system is OK. The main plus of touch screens is control over focus.- No wifi. Although from what I have seen, only Samsung does a really good job with wifi and connectivity to Dropbox etc.- Phase detection autofocus would be nice to have. I am happy with AF as it is, but the Nikon 1 (and of course my DSLR) are snappier to focus. With moving subjects, this makes a difference.OVERALL:I think Sony has done a great job with the NEX series. The NEX 3N is the lower end of that series and it is already an awesome camera. The NEX 6 and 7 are even better, but also larger, heavier, and more suited for people who take their photography way more seriously than I do :) The battle in the mirrorless camera arena is between Sony NEX and Samsung NX at this point. Sony makes the better cameras overall and has more lenses, and Samsung has more in-camera features like touch screens, wifi sharing, etc. Both use APS-C sensors. Smaller sensors don't make much sense to me. I have not tried micro 4/3 due to the fact that they are not available in offline stores where I live; which indicates to me that those manufacturers are lagging behind in marketing. Nikon 1 looks like a toy compared to the NEX and the Nikon's sensor is too small for good portraits.Highly recommended.Regardless if you are coming down from an SLR or up from a point-and-shoot, you will like this take-anywhere camera.", "Date": "January 6, 2014"}, {"Title": "Sweet, fun little baby camera.. Nex6; Nikon D5200 and Nikon lenses.", "Author": "Amazon Customer", "ReviewID": "RQC0LUO5JAASZ", "Overall": "4.0", "Content": "I've been playing around with this for a few days now; having trouble keeping my hands off of it. It is so tiny and so much fun to fool around with. I have to say it...it's soooo cute!! Especially if you put a professional looking dslr strap on it.I've been shooting with Nikon dslrs for years. Used regular SLRs before that, since 1987.  I'm a serious amateur with a pretty good working knowledge of photography.I purchased the Nex6 first. Started with that one because I thought I might replace my Nikon D5200 with it. I chickened out. Fear struck my heart when I thought about being without a dslr and the lenses I've collected.Then I decided that the Nex6 was a little too expensive to keep as a second camera and a little too large to be a replacement for my cellphone. I really was attached to the viewfinder, wifi etc but just couldn't justify the cost.The Nex image quality is great. The price for 3n with the nice, compact zoom and a full APS sensor is outrageous. Auto focus leaves a little, just a little, to be desired. Missed a few shots of cats moving around too quickly in low light.I gave it only 4 stars because the menu-based operation is a bit of a pain. The toggle on the top is for both zooming the lens in shooting mode and zooming in on pictures in viewing mode. If the last image is still displayed trying to zoom the lens to take the next shot zooms out or in on the last photo instead of zooming the lens. Half depress the shutter so your intentions are known and it zooms the lens, but you've lost a few seconds. Same thing happens with other features if the camera lingers on the last shot. Of course, you can set the camera not to display images and avoid this. In general, if you are accustomed to using a dslr with mode dials it takes a bit to get used to going to the menu to change things. At least the toggle allows for quick adjustment of ISO,shooting modes and displayed information.Today I really had fun with the little bugger because I got the Fotodiox adapter (B003Y2YE3A  to use the Nex 3n with my Nikon lenses. So now I can use my fast 35mm f1.8 and my 55-300mm zoom with it. Granted you have to use the manual mode with manual focus. But for the most part it was easy to get it right. It won't be good for shooting birds in flight or fast action but it was easy enough to use a prime lens for landscapes and portraits. It handles well in low-light already so it was great with a faster lens.Also, for $24 you can totally stop whining about the in-camera charging. I ordered a charger and 2 batteries so I have power to spare. (B008X9L2TI I got the camera for $270 used; so what if I had to buy batteries.I ordered an ever ready fake leather case, like the one I use for my Nikon, so I can carry it around without fear of damage.In conclusion, I really love this little camera. It's a great value and it's easy to keep with you all the time. The best camera is the one you have with you.", "Date": "December 24, 2013"}, {"Title": "A good camera with some issues", "Author": "Jo Smith \"Fred\"", "ReviewID": "R2A2VKZKSJLWEM", "Overall": "3.0", "Content": "TLDR: a good camere for the price with some issues:I own this camera, and it's a real mixed bag. My primary use is pictures of my kids and typical tourist happy snaps:- Sony gimped the sensor by limiting the camera to 200 ISO. Other NEX models have a base ISO of 100. What does this mean in english? You loose some dynamic range in bright light. Ok that's not english. How about: In daylight your shadows will have less detail than other cameras using the same sony sensor?- Screen flips up not down or out sideways, difficult to hold for \"selfies\" without blocking the screen.- AF is pretty bad, I have a lot of missed shots, the \"Face detection\" and multi whatever is not working very well for me (maybe - I need to re-register the faces). I use \"flexible spot\" with the spot on the center but in bright light it's hard to tell where the spot is. Other NEX models as phase detect AF.- Screen is horrible. Low res and hard to see in bright light.- Screen is small! They claim 3 inch but it's a movie aspect ratio (16:9) so the screen area available for displaying an image is more like 2.5 inches.- Controls are bleh. They put the review button in an ackward place on top of the camera and waste a button on a help function you almost never use once you figure the camera out. Given the AF and shutter speed issues I use the review button a lot; the location is a major pain.- Superior and Intelligent auto are braindead for capturing kids running around. If the camera nails the focus then often motion blur will be an issue as (for kids) the shutter speed will be too slow. With the kids I'm most often on \"S\" (Tv for canon users) which can be a PITA to use in variable lighting.- the camera can be sluggisn/slow to opperate. For example when you use the zoom lever to zoom in on an image you are reviewing I can count slowly \"one one thousand\" before the camera starts zooming in. Startup times are not great, in this respect it feels more like a point and shoot than a DSLR.- At 16mm (widest setting),  with the kit power zoom lens,  the images are heavily distorted; the camera relies on software trickery (at the cost of some IQ) to make an acceptable image.On the plus side:- High ISO is pretty good (especially for a $300 camera). This camera will leave almost any P&S; in the dust in low light. It's much better than my canon S100, 300HS, or iPhone 5s (I've used them all side by side and at higher ISOs there is no comparison).- AF assist lamp helps a lot with low light AF. That is if your finger is not covering it (they put the lamp right next to the grip).- Very small. Especially compared to DSLRs with similar sensors (T5i, D3200 etc)- Image quality on the kit lens is \"meh\" but it's a very useful zoom range in a very small package.- I love having the zoom controls on the camera (not available on other NEX models).- On/off switch instead of a button. It's easy to find when you are not looking at the camera and you can tell if the camera is off or on by looking at the switch. (important to distinguish standby from off when putting away).- Built in flash! Not every NEX has this and it's great to be able to use a flash without adding an attachement.- Titltable flash! I have managed some very pleasing results bouncing the flash off the ceiling. Some of the best inside on-board flash pictures I've ever managed (compared to my S100, Rebel T2i, 300HS, iPhone 5s).***** A good case for the 3n with the power zoom is the Loewpro Dashpoint 20. It is snug, but it's like that case was made for the 3n.", "Date": "January 13, 2014"}, {"Title": "I am the target consumer", "Author": "Robert C. Vincent", "ReviewID": "R3K6VKT8PJC6JL", "Overall": "4.0", "Content": "Four stars is still pretty awesome!A few years ago I purchased a Canon PowerShot SD1000 7.1MP Digital Elph Camera with 3x Optical Zoom (Silver), an excellent camera.  Nearly ten years after coming out people are still giving it 5 star reviews!  However it's just a point and shoot and although it takes good pictures in good light when you bring it inside the iso tops out at 800 and the photos are grainy.  Usable for sharing online but not the sort of thing you want to print out and put in your photo album.Last year I decided to step up and purchased a Panasonic Lumix DMC-LX5 10.1 MP Digital Camera with 3.8x Optical Image Stabilized Zoom and 3.0-Inch LCD - Black after much researching during which I found out about things like sensor size and f-stops and how they affect the ability to take low light photos since that was where my current camera was deficient.  That camera however, despite the larger sensor, despite the faster lens, despite the higher price tag, struggled to find focus in low light and seemed to take lower quality photos in low light than my then eight year old point and shoot.  I returned it and began to bide my time.Initially I set my sights on the Sony NEX-F3K/B 16.1 MP Compact System Camera with 18-55mm Lens (Black) but reluctant due to the lens size I was ecstatic when I heard about the Sony SELP1650 16-50mm Power Zoom Lens coming out to make the camera a reasonable size and I began to earnestly look at the NEX series.  And that brings me to where I am today, the proud owner for a Sony Alpha NEX-3N.- What I like about the camera:I like the size and shape of it and the build quality feels very stable.  It feels good in my hands though a little unsteady with just one hand.  They got things right by putting the zoom right there by the shutter button.  I know they did it for the point and shoot crowd and it does the trick for me.  The large sensor means I can really kick up the ISO without totally ruining a picture so I can shoot my dogs in the living room at 1/60 without a flash at night with just a few lights on.  Some of the built in effects too are really neat, I love the color accents you can do.  In camera HDR has been hit or miss but it's still nice to have and the scene modes have been more useful than I thought they would be. In camera panorama is pretty sweet and it stitches things together much better than I expected.Focus peaking is more useful than I thought it would be and it makes a great addition to things when I'm trying to get creative with shots.  Also I have been looking into some of the vintage lenses that can be adapted to go with the NEX and am happy to know the focus peaking is so easy to do that they are a viable option to use on this camera.The built in flash is also a nice addition and I especially like that it will not come out unless I hit the button for it.  I hardly ever use a flash because of the washed out look so it's nice not to have that surprise.  But the fact that it can be used as a bounce flash is an unexpected bonus.  I had never used such a thing and I can get really good results where you cannot tell a flash was used at all, the pictures look like they were taken in daylight.The menu layout was confusing at first.  Ever since I started looking at NEX cameras I have seen people knocking the menu layout so I was a little afraid of what I might find once I stuck myself with this camera.  After 30 minutes though the menu was a breeze to navigate.  Which is good because there are no hard dials on the camera, everything is done by drilling down through menus.  I think given what they have they have done well designing the menu system.  The minor issue is that when doing things like turning the ring to lower the iso or adjust shutter speed it can be clicked in any direction by pressing down on it so when you're trying to adjust it quickly you might press too hard when spinning it and then suddenly you're in a different menu or adjusting something else.The camera is coming out $100 cheaper than it's predecessor and I've heard some comments on review sites regarding the lower resolution screen, my input, it looks plenty sharp to me and I would rather have my $100. The screen does get washed out when you are outside, brightness can be adjusted but I usually just deal with it.  In light good enough to wash out the screen the auto mode works fine. Also as an FYI for those avoiding Chinese goods, the camera and lens are currently made in Thailand.- And the less desirable aspects:The neck strap is awkward, it is large compared to the camera and gets in the way to plug in the charger sometimes.  Also although the lens is smaller than others, the camera is still front heavy so when walking around with it around your neck it twists down and up and really gets moving, it's hardly static.Focus is somewhat slow, I expected a step up from my older camera but it's about the same speed.  Occasionally the camera misses focus and without a touch screen it's a pain to get it to go where it needs to go and the shoot can be lost.Auto mode is not all it's cracked up to be.  In my house the auto mode uses the auto white balance and everything comes out yellow due to the lighting.  It also randomly decides it wants to a thee-shot composite night shot.  To do this you need to keep the camera steady so it can make the composite image, if you don't know it's coming well... failure since you're trying to make a composite of different images because you're moving.  Same if you have your camera in auto HDR.  Auto modes are great though if you are using the flash or you're outside in good light.  Also if you are trying to take photos of anything moving in sub-par light auto mode will often try to split the difference between high iso and long shutter times toward the longer shutter times so you end up with a streaky mess.  In those instances it's better to go to shutter priority and set it where you want it.Slow lens, the lens is f3.5 on the fast end.  So even though it's nice you can crank the iso up on this, you kind of need to in order to take shots inside a house.  I am now looking at a prime lens and therein lies the rub.  The fact that I might need to buy a second lens, in this case an additional $350 is hard to swallow.  Professional photographers don't see this, it's a fact of life and they might even scoff at this comment but it's something to consider if you are a point and shooter moving up because it's something you've never had to deal with before.-Misc StuffThe Sony website doesn't say anything about 3D panoramas for this camera but some of the reviews mention this.  Previous models did have 3D panorama options.  When I went into the menu as described for the NEX-3 the option simply was not there.  An e-mail to Sony customer support did not garner a response.  Since I actually have a 3D TV I thought it would be cool but it seems to be absent.Nice to have a paper manual, so many manuals come on CD these days, but it's a little thin.  There is a nicer manual on the website if you pull up the product page called the alpha-handbook.Sony seems to be all over this PlayMemories thing for uploading straight to Facebook and the like.  Unfortunately I have a Linux operating system and there is no version for Linux.  Not a problem for most since hardly anyone uses Linux.I have not done anything with RAW yet, all images have been straight out of the camera.  I plan to get into that in the future but have been more focused on what the camera can do on it's own at the moment and then supplement the use of RAW to try and compensate for any shortcomings that I find. (Again, a point and shoot mentality)-Final Comments:I have had this camera a week now.  The first week I feel is the most critical because that is when flaws are most readily apparent.  Much longer and they become easier to accept.  It's also the amount of time I give myself before I decide if I am going to return a product.  A week of commitment.  This camera is a good camera and it is now my main camera.  Why four stars then?  The camera delivers what it promises, but there are issues.  Some of them I knew going in, some came up along the way.  It's not perfect but it's good enough for me.I plan on uploading some photos as well and doing a video review in the future but for now this should be plenty.- Update September 14th (4 months of ownership):  Turns out the memory card that I was using was a bit too slow, upgraded to Sony 16GB SDHC Class 10 UHS-1 Memory Card (SF16UX/TQ) and my shooting speed went up to a more reasonable rate.  At $16 for those memory cards I decided to keep them as my backup so when they fill up I put in a new memory card instead of erasing the old.  Some of the flaws in this camera have become more apparent over time.  The kit lens is not all that sharp and it makes taking pictures of the night sky difficult focusing to infinity.  Also the pressure required to depress the photo button is somewhat high so when on a tripod and you're not actually holding the camera it can cause some shake.  Solved in the old-fashioned way by putting your hand over the lens and moving it after pressing the button for longer exposures.Auto-focus is my biggest gripe now.  It can be slow, or impossible to auto-focus if the light is not good.  But even with good light the auto-focus is a bit soft so I need to leave the camera in manual focus assist mode to tweak the auto-focus at the end.  I am learning to adjust to this over time, when I bought the camera I got the 3 year warranty so I am sort of locked in for awhile.  I am hopeful with a new brighter lens like the Sony  SEL-20F28 E-Mount 20mm F2.8 Prime Lens the auto-focus might get a little better.  As it stands spontaneous pictures where you are attempting to quickly pull out the camera and fire off a few shots are more miss than hit.  Of course I knew some of that coming in when I decided on the 3N (contrast detection) vs the 5n (phase detection).My investments so far have been in vintage lenses and adapters since you can get a f1.7 fairly cheap (<$40) and these lenses give a sharper picture than the kit lens.  Of course auto-focus is out the window but for landscape shots or anything where I have a moment to compose the image they work great.I've also noticed that the auto modes can be very flaky.  One picture I take will default to \"Backlit subject\" and will take an appropriate picture, the next picture from the same spot might default to HDR and the next might just go with a portrait picture.  It can be very much all over the place, again as a result of bad lighting.  This can be compensated for in the manual controls which I have since become very quick at using.  Of interest (and I only found this out in the last few weeks) if you are in manual mode and shoot a video, the shutter speed dictates the FPS in your video.  I only thought that the aperture and ISO settings were carried over to the video but I was wrong.  I shot some video recently and viewed it and thought \"What the heck, why's it so jittery?\"  But it was because I was in manual (to compensate for the fact auto was shooting the video too dark) and my shutter was set at 1/13.  Actually this makes for some very interesting effects, I was enjoying making the fan disappear the other night or seem to hold still by adjusting the shutter speed just right.Side note, the little toggle for the zoom slides against the power switch.  General grease/funk/grit got between them from use and when I toggled the camera on it would move the slide lock-step with the zoom and the camera would immediately zoom completely in.  Not the best design in the world since the clearance between the two is essentially nill.  I was able to easily move the switch back and fourth several times to clear the area but it was still unexpected.Overall, still enjoying the camera.  This is my first prosumer model and I have learned a lot about what I would look for in the future and how to accomplish the things I want to do now. If I had the chance to do it again I might go with a higher model Alpha Nex for the phase detection auto-focus but I feel no regret for my purchase of the 3N.", "Date": "April 14, 2013"}, {"Title": "Sony NEX-3NL/B Compact Interchangeable Lens Digital Camera Kit (Black)", "Author": "D. Pennie", "ReviewID": "R3DLU29GT56LK8", "Overall": "4.0", "Content": "(Update, please see comments on this review)I want to give this camera 5 stars, because it does take *amazing* pictures with excellent quality and full satisfaction in that area. The reason I gave it 4 stars, however, is due to a severe lack in accessories for the camera and a few 'use' issues.I'll start with the not so great things about this camera:The LCD takes up almost the entire back side of the camera, and what it doesn't take up is covered with buttons. The manual for the camera insists you should not touch the LCD and if you do, you should clean it off immediately with a microfiber cloth. So I spend epic amounts of time trying to not touch this screen that takes up most of the back side of the camera. This issue is mitigated to an extent by opening the LCD away from the camera and using the back of the camera to rest your hands, and that is a totally viable solution, but it takes a lot of getting used to, and it doesn't really help when putting the camera away or pulling it out of your bag/case/pack. It's INEVITABLE that you're going to touch this screen, yet, \"you shouldn't do that.\" It's nerve wracking.I have looked and looked for screen protectors that aren't just sticky plastic sheets. I want something sturdy and thick that will go over the LCD to keep any pressure or taps against it from causing any kind of issue, because I'm guessing replacing this screen would be a costly endeavor. I have yet to find anything that fits. Many items are advertised for \"Sony NEX 3\" cameras, but that is not the same as the NEX 3NL. Different LCDs, I found, after I ordered a LCD cover and was so excited to use it, and found it did not fit at all. I have finally ordered some of the sticky plastic sheets that I was hoping to avoid.The LCD also has glare issues. I did expect that, so I'm not taking any rating points off for that, but I am irritated that there aren't any accessories for shielding the LCD. Especially considering there isn't an Electronic View Finder on this camera, some kind of anti-glare accessory is necessary.The LCD making the camera difficult to get a good hold of makes me want a grip on it. I don't need a battery pack grip, but something to extend the bottom of the camera to give more area for holding would be an incredible blessing. As it is right now, I carry my camera around almost exclusively by the lenses.The lens that comes with the camera in this kit (16-50mm) is on the slow side at 3.5-5.6.This kit did not come with a body cap and rear lens cap. These are very important items for interchangeable lens cameras, so I think it was shortsighted to not include these items.What I love about this camera:This thing is feature packed. There are a million options for setting up your pictures for the specific situation you're in. If you are looking for a camera that you can use for setting up art photography, portraits, or a few light action shots, this is a great camera. It has several \"scene\" options, such as \"twilight, night, landscape, portrait, anti-blur, etc.\" It gives you aperture and shutter priorities. It has basic color adjustment settings like high contrast black and white, color popping, and a couple of filter settings like 'retro' which gives a slight sepia tint to your image. I do a lot of after editing of my digital prints, but I've found with several of my photos with this camera I didn't have to do *anything* after the fact. They are high quality from start to finish if you take the time to use the features of the camera as you're taking your shots.Despite it's size and location causing issues, the LCD is gorgeous. All the detail in your frame is available at first glance, which really gives you control over your shots. The ability to tilt the LCD all the way forward for self portraits or setting up a timed portrait is very handy and I've used it a few times at family events to much benefit.The user interface for navigating the camera's features is very intuitive and I didn't feel lost the entire time while I learned. If you've used a digital camera at all, even just your phone camera, then you'll have a pretty easy time learning your way around the menus.The camera's built in auto focusing and stabilization are great. Often the pictures come out cleaner than I expected and that's always a nice surprise.I bought the camera when it was on sale and paid ~$350. I would buy the camera again, even with the knowledge I have, because I do love the camera. I am going to hold out hope for more accessories to come on the market.", "Date": "January 21, 2014"}, {"Title": "Sweetness", "Author": "W. Helton \"Twinkerbell\"", "ReviewID": "RLUTZRGZUXUHW", "Overall": "4.0", "Content": "I have had this camera for several months now.  It takes great images.  My two major faults with it are;1.  No shutter release.  You can't release the shutter by remote.  The self timer given within the camera maxes at 10 sec which is just not enough time for me.2.  Viewing screen can be very hard to see when in the sun.... I have tried several anti glare covers but with no positive result.  I just accept this fault and have mastered the \"I THINK I got it\".  If I must see right away I just find a shady area.On the bright side, camera is very light compared to my old Canon Rebel.  It has a load of option I didn't expect but enjoy playing with.  It has the ability to do all the work for you or you can go manual and do the settings yourself.I like this camera so much that I am currently awaiting my birthday so I can level up to a Nex 7.", "Date": "January 14, 2014"}, {"Title": "Impressions after a summer in Europe with the family and the NEX-3n", "Author": "M. Herbst", "ReviewID": "R3NYHB5UXFJOXB", "Overall": "5.0", "Content": "First things first, this a a remarkably small, genuinely pocketable camera that has the outstanding APS-C 16.1 sensor that is in first rate DSLR's like the Nikon 5100 and Sony 580. The Dxo scores for the sensor nearly match that of the Canon mark II. In order to get this sensor in a small, inexpensive package, you get very minimal additional features and controls. The 16-50 lens is mediocre, but very compact and the distortion can be corrected in lightroom. The lens is not very robust and does break easily if bumped hard in the front. There is an adaptor, which I used and later sold, but the bulk of the adaptor,the loss of optical stabilization, make using this camera with the adaptor a poor choice. An alpha55 dslr with a 16-105mm is just as compact and much easier to use.  The native e mount lenses are much better but limited in selection. The 50mm 1.8 is a first rate portrait lens. The 55-200 is reasonably good. I don't see the point in lugging around an 18-200mm with this camera, where the whole point is to be small.  My suggestion is just travel light and get the 16-50 only or get a small case and add either the 50mm 1.8 or the 55-200. The moveable flash is a very useful feature for indoor portraits. I strongly suggest getting the 50 mm 1.8 and a small case to clip on your belt, if you want to make this a bit more serious. You can get some of the \"magic\"of the narrow DOF and clarity of the prime lens without breaking the bank.Mostly, the point is that the image quality is excellent from the sensor and cant be matched by small sensor cameras. Even though the lens is not as fast as I would like, the DOF control is still superior to the small sensor cameras.  Charging is really not a problem, just get the charger and extra battery if you take more than 200 shots a day. This is a casual camera, not for doing weddings. The LCD is lousy, but that is part of keeping the price down. Menus take a bit of getting used to but can be mastered in a week or so.If you want a small camera you can take with you everywhere, this is a serious winner. If you want to make  the NEX system your main thing, you should probably get a more expandable model like the NEX6, If you want a travel camera, that you slip in your pocket, but shoots raw, has a great sensor and you can add one lens to make a kit that you can fit on a belt clip, this is the way to go. I have gotten some seriously good shots with raw and lightroom that would be absolutely impossible with the typical point and shoot, but the minimal expandability and lack of controls, makes this no substitute for a serious DSLR.", "Date": "February 1, 2014"}, {"Title": "Best Camera When Upgrading From Point & Shoot", "Author": "Renee A", "ReviewID": "RU7TDAH2637RL", "Overall": "5.0", "Content": "Purchased this camera from Sony directly and have loved the form factor, features, and picture quality very much. This is my first ILC camera and though it is bigger then a typical P&S;, it is a very compact size especially with the new lens. Pictures are sharp and video is clear; easy to use and full of options to explore. No regrets.", "Date": "April 2, 2013"}, {"Title": "Great DSLR replacement now at a very attractive price", "Author": "Rowan Wing", "ReviewID": "R3J15N23G606V2", "Overall": "4.0", "Content": "There are many reviews out there, so I will try to highlight what the other reviews do not cover. I have been using this camera for 2 months now, and it has a lot of cool features...This is probably one of the best choices for people looking for dslr image quality in a super compact size with the 16-50 kit lens and super affordable, with great auto modes and advanced manual features as well.Pros- Before the latest batch of NEX/Alpha cameras just making their way into stores now (a6000, a5000), this NEX-3N was one of the newer models in the NEX line, released mid 2013. In short, it has newer features that even the previous year top line products don't have, (such as Nex-6).- Unique to NEX3N-- KEY UNIQUE FEATURE - Zoom lever around shutter button (takes advantage of the 16-50mm power zoom feature and also great for one-hand shooting). This is the ONLY Sony camera in this line that has it (WHY SONY?). This is a VERY useful feature, not only does it allow you to zoom in and out optically using the power zooms like the 16-50 kit lens and a couple of others PZ lenses, it also acts as a zoom lever in digital mode (clear image) and digital zoom on any SONY lens such as the 55-210.- This is the slimmest NEX camera. I can pocket it into a jacket with the 16-50 kit lens retracted!!!, so DSLR quality in the pocket (VERY IMPORTANT to me)- Flip-up screen, tilts up180 degrees for self-portrait shots and videos- SD slot is not at the side of the camera instead of the bottom- Dedicated ISO button right side of 4-way wheel, can be changed- Super low cost now- Don't be fooled, You are getting great image quality similar to the other NEX except those using the brand new BIONZ X processing (such as a6000 which is double the price) which might have an advantage due to better processor but at double the priceOther PROs- Live histogram display - if you toggle the display modes (up on 4way wheel, you will see live histogram)- Good low light high iso performance (up to 1600, really good results)- Fun picture efects - I love the hi-contrast monochrome- HDR and DRO especially works quite well to increases light in darker areas without overexposing the rest- Flash is orientable up toward ceiling for bounce effect (this is achieved by pulling back the flash with your finger and holding it there)- Pretty high burst mode- Good videos- Outdoor mode for LCD works well outdoors, very bright high contrast- Great display options on the lcd screen - several modes- Great manual focusing, DMF (use lens ring when shutter half pressed zooms in for fine tuning, focus peaking makes itr even easier)- ZOOMING With the 16-50 power zoom, you have 3 ways of zooming on this camera (shutter lever, lens lever, lens ring)The lever can do slow or fast depend how far you press it, the lens lever is slow, the lens ring is cool, can be very fast (it electronically activates the zoom) if you turn the ring fast, you can go from full wide to full zoom in in a quarter turn.CONS- No viewfinder - I have always used one, which is why I have ordered an a6000 body. I need my reading glasses to read the text on the 3N LCD screen (which is very detailed) so for me, viewfinder is pretty important, however the difference in cost to get a viewfinder is huge.- Setup Menu is one big list, i don't use it much any more though, if you set up the FN custom button, you can assign 6 settings there, so most common ones.", "Date": "May 22, 2014"}, {"Title": "Great in between camera (SLR vs. point and shoot) for kids, pets, sports, travel and every day life.", "Author": "daeeyam", "ReviewID": "R3D477P0JFTHSS", "Overall": "5.0", "Content": "I have been a loyal Canon customer since the early 2000's. In no way am I a professional, but I do read up on tutorials and appreciate taking beautiful photos using what I've learned. I've owned a few Canon point and shoots, video cameras, the Canon Rebel XTI with several lenses, and most recently the Canon PowerShot S100 which I absolutely loved. The Rebel SLR was fun but became too much of a burden to carry around once the diaper bag and baby gear became priority. And we had way too many near misses with dropping the heavy camera on baby (thank goodness for the neck strap and quick hands)! That's where the S100 came in for beautiful shots, ability to take shots in low light of sleeping babies, pocketability, video function and ease of use. I completely recommend it over a typical point and shoot. All was well until it dropped and the cost of repair couldn't be justified. Plus, who refuses an excuse to buy a new camera? My sister has the Sony Nex5R with stock lens and I found myself borrowing it several times. The photos were so bright and clear, with a nice soft airbrushed effect on skin. I took photos with my SLR and Sony Nex at the same party and I could immediately notice the difference once I uploaded the photos to the computer. I researched the various NEX cameras and wavered between the 5T and 3N. The 5R, though discontinued, wasn't much cheaper than the 5T. I finally decided on the 3N because of price (all 3 models have the same internal sensors and are mirrorless), the kit came with a pancake lens, built in flash, video capability, small size and great overall value for the price. I am usually one to go with the newer models and latest trends, but the 3N just made more sense. I kept reminding myself that I was looking to replace my S100, not my SLR. Some of the newer features of the 5/6/7, such as touch screen and wifi capability, aren't a selling point for my needs. I did buy an external charger and battery for convenience (I do not like having to charge the battery inside the camera), a B&W; lens filter/protector (don't buy a cheap filter, it will negate having a quality lens) and anti-glare screen protector. I do miss having a viewfinder because the screen is a bit difficult to see in bright sunlight, but the screen protector helped a bit.. But after a month of casual use, I am very happy with the camera. The images are beautiful, it didn't take long to learn the menu and functions, the size is great for carrying around on my neck or in a bag, and the price is pocket friendly! The kids love when we take 'selfies' with the swivel lens, the video quality is nice, and when they become more involved in sports, I will definitely look into a lens with larger zoom. Thank you!", "Date": "April 3, 2014"}, {"Title": "Fantastic for a beginner", "Author": "A. Shrestha", "ReviewID": "R2NUUHRDOMOYXV", "Overall": "4.0", "Content": "First, I highly recommend this camera for someone who likes Auto, I-Auto, or Superior Auto, or any of those automatic modes. Sony does a good job in those modes. Sony's stitch panorama is the best of any maker. Fuji is a close second.I wouldn't recommend this (or any NEX) to someone who likes to shoot in Aperture Priority or likes to customize their camera. Here's why:1. Sony's NEX menus are terrible - Seriously. You have to get to root level to get into any sub menu, and it's easy to forget which items are in which root menus. Nobody should make menus like Sony.2. Customization isn't consistent - If you change the functions of the control dial buttons, your custom settings revert in other modes. In real life experience, this means it's very easy for the NEX to provide an inconsistent and confusing experience. keep in mind this only happens in Aperture, Shutter, or Program mode. So if you shoot in Auto, or I-Auto, or S-Auto, then it's not a problem.Sony's AF used to be notorious for missing the correct subject. For example, the NEX-6 would often pick trees in the background than people in the foreground even when people covered 60% of the frame. But Sony seems to be getting people. Most people shooting in Auto would just take another picture in the hopes that NEX-3N would get it right.Being so affordable, I recommend the NEX-3N to anyone who shoots in Auto. For people who like to customize their camera, the NEX-3N would most likely find it frustrating.", "Date": "March 16, 2014"}, {"Title": "Loving my new camera purchase!", "Author": "linds", "ReviewID": "R3VTJ3ZW1TYCCO", "Overall": "5.0", "Content": "I've been wanting to get a new camera for awhile since my p&s; camera is about to die.  Started looking at dslr cameras before Christmas and was deciding between the Canon 3t and the t3i.  I saw the Sony NEX-3N on the lightning deal so decided to research it.  Spent the day looking at reviews, videos, etc...decided to give it a try.  I liked that it was the perfect middle ground between the light weight point & shoot and the heavy dslr.  I'm not a professional photographer and only wanted a camera I can take to my kids sporting events, vacations, etc...I have to say I'm extremely happy with my decision so far!  I love that it isn't so heavy and I can switch out the lenses.  I have friends with dslr cameras and they hardly ever take them anywhere due to not wanting to lug it around, they end up just using their cell phone cameras while their expensive camera sits at home.  This past weekend I popped this camera into my purse and took about 50 pictures at my son's basketball game.  Got some wonderful action shots!  I ordered a 32gb memory card when I ordered the camera since it doesn't come with a memory card.My only complaint which are super small is that the lens cap isn't attached to the camera so I'm sure it's only a matter of time before I lose it & the neck strap isn't very comfy to wear for an extended period of time so I ordered a neoprene one.Down the road I will probably look at the N5, 6 or 7 since I like some of the additional features they have but for now the NEX-3N fits my needs.  I've already ordered the Sony E 55-210mm F4.5-6.3 OSS Lens and can't wait to try it out.  Happy with my purchase and very glad I dragged my feet on the dslr purchase.", "Date": "January 20, 2014"}, {"Title": "The best camera I've ever owned.", "Author": "Jack Martin", "ReviewID": "R16HM6HI6MF3OE", "Overall": "5.0", "Content": "This is an amazing camera in a small package. I am trying to get used to the small body as it can be tricky abit when you switch from a full-body camera. The quality is top-notch. The stock lens is awesome. Worth the price 100% recommend it.", "Date": "December 27, 2013"}, {"Title": "Best performance in the smallest possible package", "Author": "Mr. Unfug", "ReviewID": "R2K02MESKQLUBV", "Overall": "5.0", "Content": "I was looking for a camera I can always have with me. I have the a850 and the a57 with a whole bunch of lenses but I was missing a lot of opportunities because I'm not able to have these fine cameras with me all the time. This little camera fits that bill perfectly, a APS-C sensor camera barely bigger than a point and shoot. I am perfectly happy with the performance so far, the images are crisp as you would expect from a DSLR. The camera does a great job at compensating the limitations of the lens (due to its size) and the high-iso results are pleasing.", "Date": "September 21, 2013"}, {"Title": "Excellent still and video image quality; some user interface shortcomings...", "Author": "35-year Technology Consumer \"8-tracks to 802.11\"", "ReviewID": "R9SZGK52NAHJG", "Overall": "4.0", "Content": "Overall, the Sony NEX-3NL/B is a great tool for a wide cross section of photographers. Those moving up on the photographic food chain from a complete point-and-shoot environment should quickly learn to enjoy the benefits of the increased control that comes from a DSLR-like interchangeable lens. While experienced DSLR shooters may feel handcuffed by some of features that are absent in this camera, they will not be disappointed by the resolution, clarity and tonal qualities of the images this camera's sensor delivers (and they will like the reduced mass of its compact body and lens).PROs:-Many still image shooting modes (multiple fully automatic or scene-sensing modes, aperture priority, shutter priority, panorama), including manual.-up to 16 megapixel still image resolution-up to 1920x1080 high definition video resolution (up to 29 minutes continuous HD or 2 GB of .mp4 video)-easy manual flash activation-easy video recording activation-\"Wasabi\" battery is compatible with many other Sony cameras (including it's big brother, the NEX-7-Accepts both Sony Memory Sticks and SD memory cardsCONs (note: not one of these is major flaw, and even collectively, they are not a deal-breaker in any way. They are, however, separate a product of this price from a five-star review):-No hardware mode controls on the camera body; all settings (including shooting modes) are through a a menu button and must be viewed and changed through the camera's LCD-No camera-body control for no flash shooting; this too must be accessed through the menu and LED screen.-No included software; you have to download from Sony-If you do: Sony-published software is of marginal utility. If you want to shoot RAW images, you'll have to consider Sony's \"Image Data Converter\" software. But unless you are brand new to photo/video importing, organizing and editing: take a pass on the other download, Sony's \"PlayMemories\" studio. It's overly complicated, with a cluttered non-intuitive. Note for Windows 7 users: Window Media Player will playback this camera's .mts\" format HD video format and Windows Live Movie Maker will accept MTS files for editing and conversion to .wmv files.-Monochrome user guide with small print (hint: download the .pdf version and send it to your Kindle!)-No external battery charger (but Sony will be gladly sell you one separately). If you go with only what arrives in the box, you'll charge your NEX-3 via a USB cable and an computer or AC adapter. Non-Sony branded \"compatible\" Wasabi batteries and chargers are available at significantly lower prices: choose an off-brand at your own risk!This camera is lightweight, compact and has the flexibility for additional performance by accepting interchangeable lenses. Good camera overall.Note for Windows users: If you want to manage the contents of your SD card via a USB connection, make sure to change the USB settings on the camera to the \"mass storage\"; otherwise you won't be able to delete content on the memory card.", "Date": "April 24, 2013"}, {"Title": "Professional Cameras for those who don't know or have experience with them", "Author": "WipisComp", "ReviewID": "R3ELRBABFM9CN0", "Overall": "5.0", "Content": "I bought this camera about a year ago. It is a great camera for people who don't exactly have experience with Nikons or Canons. It is easy to use and has several features that are not so hard to learn. Family members have bought $700 Nikons and have seen my camera and wish they had given a Sony a chance. They are definitely not one the same level but for those people who want a professional photo but don't want to take a special class on how to take a photo this camera is for you. I recommend getting a high capacity SD card because you can easily take 100 photos with this camera. The battery life is great it will last long events. The quality of the photos AND videos is great. I love having the ability to have a camera that takes GREAT photos AND videos the quality is definitely not lost. Oh and the white is not easily scratched off or easily dirtied.", "Date": "January 1, 2014"}, {"Title": "Most affordable camera with a large sensor I've come across", "Author": "Yarii", "ReviewID": "R17BEB6ARGY9SG", "Overall": "5.0", "Content": "I've used higher-end small P&S; cameras such as the Canon S100, as well as bridge cameras such as the Sony HX300. The Sony NEX is the next step when you're not ready for a large DSLR or just plain don't want one.But is it really worth the extra money? If you're looking for a camera with large sensor, yes, by all means. The sensor on this is huge compared to 99.9% of the point & shoot cameras on the market. But I compare photos taken with the NEX and photos from my other Sony cameras, all cheaper and smaller than the NEX. On a lot of the photos I've shot, unless I greatly enlarge them, I don't see much difference. I'm not a pixel-peeper though. Maybe you are.I know how to use full manual cameras (PASM) so that wasn't something new with the NEX; though there is a learning curve if you're new to changing out lenses and knowing the correct lens for the situation. At the same time, you can use this as a fully automatic P&S; camera....just keep the kit lens attached and leave it in either of the 2 auto modes and you will still get good photos (the APS-C sensor is the 2nd largest available in any digital camera).The menu is intuitive and much like other Sony cameras, but more choices. My other Sony cameras have 921,000 pixel screens, this has only a 460,000 pixel screen; I can't tell much difference when using the menu, but sometimes see a difference between photo quality on the LCD looking much better when uploaded to the computer.LIKES:>> Sony hasn't gone crazy with megapixels...16 MP is enough.>> I have the white camera and it's beautiful, with a slight metallic finish.>> Battery life is excellent. Buy a separate battery charger because I don't think it's good for the camera's electronics to charge a battery inside the camera.>> I love the way they made the flash so you can aim it at a different point such as the ceiling instead of the subject to \"bounce\" the light off the subject.>> Focuses fast. Even on the single photo setting, you can hold the shutter down and it will take one photo after another just like a DSLR.DISLIKES:>> The kit lens is not so great for close-up macro shots; you have to back off the subject to get proper focus.>> When zooming while shooting a video, the lens motor is VERY noisy and can be heard when playing the video.", "Date": "July 30, 2013"}, {"Title": "Image quality... wow", "Author": "Daniel Rivero \".:DRH:.\"", "ReviewID": "R3A4WQWUIQRT0Q", "Overall": "5.0", "Content": "The camera is not perfect, one needs to get used to the menu but overall navigation is pretty quick and easy once one gets used to it... Image quality in one word, wow! The camera itself is very light and small, the included len adds a lot of weight and volumen but not bad, even though the contrast on the weight and size between the camera and the len is ridiculous. Portrait mode works perfectly fine, even with the camera at short distance, it's able to take a broad view of the target-UPDATE-Device stopped powering on and it's not the battery, I'll rate it 5 starts again depending on the Sony support.-UPDATE 2-After sending my device for service to Sony in Laredo, Texas; I was contacted by one of the supervisors to check all my info like pone number, address... The told me that they were going to call me every 3 days to keep me up updated about the progress of the service and they did. At the end they didn't find any problem with the camera, they made a general service like lubrication and some other things. So far, the camera hasn't failed anymore, so I hope it was just something loose inside or something, A month with the camera after service and no problem.", "Date": "May 26, 2013"}, {"Title": "The best camera to leave on \"auto\" and get amazing photos.", "Author": "Krogue", "ReviewID": "R3FX1MH1RIZMHF", "Overall": "5.0", "Content": "I'm upgrading from an \"expensive\" point-and-shoot camera that I previously liked because I could put it in my pocket and still get \"acceptable\" photos of my family. But with the NEX-3N I get amazing photos that I'm proud of and that others complement me on, and it still fits in my coat pocket (but not my jeans pocket). With my old point-and-shoot, I would get a \"really good\" photo about 10% of the time. With the NEX-3N I get a \"great\" (pro-quality) photo about 50% of the time. I also love that the camera is \"simple\" with a minimal amount of buttons & dials but dedicated buttons for the most common actions like Movie and Review. It also has a built-in flash (a requirement for me), but I haven't really used it much since the NEX-3N takes such great low-light photos. I was initially concerned with the lower-quality screen (compared to the NEX-F3), but in actual use, it hasn't been a problem.  The amount of zoom on the lens is also good. The camera feels ergonomic in my hands, and I don't feel like I will drop it.I was hesitate to upgrade to a DSLR-like camera, but I find the Mirrorless Interchangeable Lens Cameras (MILC) a good compromise especially the NEX-3N which is very small and very much like a point-and-shoot camera. Plus the low cost (compared to other MILC cameras) is budget friendly. It also has the biggest sensor size [APS-C] (other than a $2000+ full-frame sensor) that I've read equals better image quality.The SAF (Spouse Acceptance Factor) is also very high:  it is almost the same size as the old point-and-shoot, there are no complaints about bad low-light photos, it has similar controls (like the auto-zoom), it doesn't have tons of buttons, and it can just stay on \"auto-mode\".  Plus it has a pop-up screen for selfies. With this simplicity (which I love 90% of the time), I can still occasionally \"play\" with all of the other advanced settings on the camera (and maybe buy another lens for it).My biggest complaint is something (I think) Sony does for many of its cameras, which is to put movies in a separate folder from pictures. (Tip: change the settings to record movies in MP4 instead of AVCHD, which results in \"better\" movies when viewed on the computer.) This affects both reviewing pictures & movies on the camera (until I remember that they are in separate folders) and in Picasa (my preferred image organizer) which won't automatically import them (I have to remember to manually copy the movies to my computer, but I'm looking into writing an Automator script to do this, or maybe seeing if a wireless SD card would solve the problem). Also I feel like I may lose the lens cap at some point.I did buy this as a bundle from B**** Camera.  The stuff in the bundle is OK, but I haven't really used them, except for the SD-card and the camera bag. The HDMI cable included in the bundle is not the correct one for the camera, but I don't plan to hook the camera up to a TV.Overall I'm very happy with this camera and I highly recommend it to my other point-and-shoot friends who want amazing pictures, in a coat-pocket sized camera without the complexity and a great price.", "Date": "April 11, 2013"}, {"Title": "GOOD! How good? Made me switch off Micro Four/Thirds good!", "Author": "ScOObydoo", "ReviewID": "R1GN8JK9CJ5IB5", "Overall": "5.0", "Content": "So - I'm a photo novice - but one with some income to invest in camera gear. I am the guy who keeps his camera in auto, but I'm smart enough to stay clear from most kit lenses and the in-box camera strap. My last camera kit was a Panasonic Lumix GX1 with a 14mm prime, 20mm prime, power zoom 14-40 and an Olympus 150mm zoom lens.I've always been intrigued by the NEX line of cameras, but always found that there were too many models to pick from, and too many new models on the way. The NEX-3N is a deceiving name - as it has the same model number (NEX-3) as one of the first ever NEX models - yet is one of the newest in the Sony lineup. Bottom line - don't let the model numbers fool you.Now on to the camera itself - it has an APS-C sensor - which is essentially the size of your average DSLR camera (I'm sure someone will correct me here). It shoots in 16 megapixels, has a built in pop-up flash (manual) and a tilting LCD screen (tilts UP only). It has no Viewfinder and no audio/mic input, though it does sport the newest Sony Multi-Connector which is essentially a MicroUSB plug that supports some additional products like a remote control (not available as of this review).Startup is fast - a little over a second, which is impressive as it needs to extend the power zoom lens. Speaking of the lens - this is actually a pretty damn good lens - 16-50 optical stabilized power zoom. It has zoom controls on the lens and on the camera, making it quite flexible. It is also very compact - just a little longer than the NEX 16mm prime lens.Photos turn out great, but let me remind you that I keep my camera in auto and auto+ mode, so I'm sure they could be even better. I don't do Raw and I don't do post-processing, so I clearly miss out.What I do find, is that the display doesn't do the photos justice - the screen will often show a preview of something dark and grainy, but even without the flash, the actual photo (and the preview after you take the photo) looks fantastic and bright. Apparently the display just can't process how the photo will look.The menus are a breeze to go through - albeit with no touchscreen controls. Obviously you have the usual M, S, A and P manuals, Scene selection, Sweep Panorama (awesome feature on Sony) and two automatic modes. Scenes include portraits, landscape, macro, sports, sunset, night portrait, night scene, handheld twilight and anti-motion blur; In other words - not as many as some other cameras (Samsung is famous for filling their cameras with 20-30 useless scene modes). The camera also has a variety of creative effects available in MSAP modes.Battery life is good - and it can be charged off MicroUSB. Input/outputs include MicroUSB and MicroHDMI.All in all - I love this camera. It surpasses what I need in my auto-mode life, and it is so good that I have sold my M4/3 setup and purchased some nice new NEX lenses. Highly recommend the 50mm lens if it fits what you shoot, and at around $250, it is an absolute bargain.Good job Sony - this is a fantastic little camera with everything I need.", "Date": "April 27, 2013"}, {"Title": "Excellent quality in a small package", "Author": "Amazonian Consumer", "ReviewID": "R2838DHWX83QI4", "Overall": "5.0", "Content": "Excellent quality in a small packageI like the Sony NEX-3N Compact System Camera (CSC) for the following reasons:1. It is the smallest and lightest of Sony's NEX line.2. It has a very useful flip-up screen to take the guesswork out of framing self portraits. When in this mode (the screen is turned up all the way), the shutter will not release after pressing it until after two beeps (about 2 seconds), so that you and whoever else is in the picture can get ready and smile.3. The SD memory card slot is located on the side, rather than the bottom of the camera, so that cards can be changed even when the camera is mounted on a tripod.4. There is a zoom lever on the camera body to make smooth motion zooming easier while shooting video.5. Although significantly smaller than its predecessor (NEX F3), the 3N retains the built-in flash feature.6. The included 16-50mm powered zoom lens has a much smaller form factor as well as a wider zoom range, compared to its older NEX models. The wide end is equivalent to 24mm focal length in conventional film photography, which makes group shots and landscape photography easier. This zoom lens can be bought alone at a price of $349, which means you are getting the NEX 3N body for a mere $150!7. There is a micro HDMI port on the left side (when you face the screen) of the camera, so that you can view videos that you've made on a large-screen flat TV that has a HDMI IN connector. Sony does not provide this cable in the box. It is available on Amazon at various prices (about $3.50 to $10). The cable carries both audio and video signals.Mediabridge Micro-HDMI to HDMI Cable with Ethernet - (6 Feet) - FLEX Series High SpeedHDMI (Type A) to HDMI Micro (Type D) , High Speed Cable with Ethernet for HTC ,Motorola 6 feetThere are a couple things about the 3N that I do not like, although they are not deal-breakers.1. There is no external battery charger; you must charge the battery while it is in the camera. To solve this problem, for about $30, I got two extra batteries and a charger on Amazon. Wasabi Power Battery (2 Pack) and Charger for Sony NP-FW50 and Sony Alpha NEX-3, NEX-5, NEX-5R, NEX-5N, NEX-6, NEX-7, NEX-C3, SLT-A33, SLT-A35, SLT-A37, SLT-A55V. These third party batteries are quite good.2. The play button is not located on the right side of the LCD panel but on the camera top. This makes switching between picture-taking and play modes less convenient.The NEX 3N produced sharp and perfectly exposed photos in bright light and dim light.IMO, Sony made the correct set of compromises/trade-offs to keep the price (SRP) below $500 (The flash isn't powerful, but it's built-in; the lack of a hot shoe for the intended consumer (entry-level and budget conscious) is likely not that important; there is no external charger, but you can buy one plus extra batteries for a good price; the LCD panel can only be adjusted to 90 degrees for low position shots and 180 degrees for self portraits, but these two are the most often used. If you want to shoot above a crowd, turn the camera upside down and press the shutter release with your thumb while having the screen turned at 45 degrees.The APS-C sensor in the NEX line of cameras is 64% larger than the micro four-thirds camera sensor in Panasonic and Olympus cameras. An APS-C sensor has an area of 23.6 X 15.6 mm = 368.16 sq-mm, whereas a micro four-thirds sensor has an area of 17.3 X 13 mm = 224.9 sq-mm. Theoretically, a larger sensor means better picture quality, as more light can fall on the sensor which increases the signal-to-noise ratio of an image.", "Date": "May 3, 2013"}, {"Title": "I sold my T3i and bought a Sony NEX -- no regrets!", "Author": "Lala_BOOM", "ReviewID": "R2R7J92MI1NEDQ", "Overall": "5.0", "Content": "I sold my T3i in search of a compact camera that takes crisp pictures in RAW while also capable of shooting HD video-- without the weight, bulk, and \"Hey, I'm a tourist!\" look of the dSLR.I thought I was going to go Olympus PM-2, but wanted a tilted screen. The PL-5 felt awkward and cheap. I also realized how much I prefer buttons and wheels for menus rather than poking around on a touchscreen.I then looked at Fuji cameras, the X series -- beautiful and unique images, and the cameras felt great and solid in my hands -- but the lens selection is limited and VERY pricey. No thanks.Enter Sony NEX. I haven't held any models aside from the NEX-3N, but it feels great and well-made. No obnoxious touchscreen, and a menu that's easy to understand.I bought a NEX-3N body new from a dealer on Amazon for $190 and skipped the kit lens.  I picked up a $30 RainbowImaging 35MM lens for portrait shots and coughed up $200 for a 19mm Sigma lens for landscapes.I've only had the camera for three days, but I've been blown away by the quality of video when paired with the fun little 35mm lens. It truly looks like it was filmed with a dSLR -- and all for less than $250! I cannot wait to take this little guy on my travels.The only thing I wish this camera really had was a mount for an external microphone, but I knew that before I made my purchase -- so I can't be too upset.**EDIT: Bizarre flaw in this particular camera -- whenever you take a picture, it emits a fake shutter sound from the bottom speaker in addition to the actual shutter noise. It's quite loud, tacky, and cannot be disabled. Several NEX-3N owners have been campaigning for a firmware update, but Sony continues to claim it's the \"real\" shutter.", "Date": "May 26, 2014"}, {"Title": "dead after six months", "Author": "Charles C.", "ReviewID": "R1Q4Y0P0WVN59S", "Overall": "1.0", "Content": "bought \"refurbished\" for $350 six months ago.  Now it quit and I have no recourse (merchant covers only 3 months).  I recently discovered the issue is common with this unit:  \"cannot recognize lens.\" 4 lessons:  1.  buying \"refurbished\" is risky.  2.  On-line customer service is poor.  Return policies are weak.  Warranty may be invalid.  3.  seriously consider buying electronics at a local store -- tradeoff of higher price better customer service.  4.  Do your research!  Identify systemic problems -- like this unit's engineering flaws.  FYI -- even those with warranties are being denied coverage under pretense of mishandling.  Buyer beware!", "Date": "May 6, 2014"}, {"Title": "True Bargain for serius pictures", "Author": "EcoActive", "ReviewID": "RL4IALGMMJ4FT", "Overall": "4.0", "Content": "The price for this camera with the 16-50 was just too good to pass up. 300.00 was such a deal. I use this for concerts as usually can take it in as a point and shoot. The large sensor is perfect for no flash pictures. The build is great but no magnesium or metal body but still super solid.What are the negatives? There are very little to no customization for the camera. You have to pick menu options as they are and that'a about it. But there are some really great ones in there. The superior auto is one that takes a lot of guess work and either takes multiple high speed shots(3) and makes one great shot with them. Panorama is another. Just no adjustment for sharpness or things like saturation etc. But again for the price you receive extreme capable camera photo quality wise at an unheard of price and for many they do not want to tweek the camera anyway.", "Date": "April 19, 2014"}, {"Title": "Absolutely, fantastic camera!", "Author": "Thomas N. Gilmore", "ReviewID": "R1FRWRDLG0QS9", "Overall": "5.0", "Content": "I bought this as a backup to my Canon 60D so that I could just shoot a quick photo without worrying about messing with settings, etc. on my 60D. It just arrived yesterday and all I can say is the Canon might stay in the bag for many of my planned trips. Only a couple of features I wish this camera had are an optical viewfinder and faster charge time on the battery. When the camera arrived the battery was completely dead. I put it on charge and it took most of the night to get it fully up to speed. The menus are quite easy to navigate through and the photos are unbelievable with the C sensor. I think they match my 60D in quality. I love the intelligent auto setting and can't see any reason not to use it for most situations, even though the camera offers many of the traditional settings that a full DSLR camera does. I also ordered the 32GG Sony card that is suggested in the final checkout. I ordered the Westlinke Protective Black PU Leather Camera Case Bag for Sony NEX-3N with Short Prime Lens 16-50MM and will give it a review after it arrives.", "Date": "March 13, 2014"}, {"Title": "Great,for the price, but not perfect", "Author": "jlloyd50", "ReviewID": "RFB8FX8L1U3I0", "Overall": "5.0", "Content": "This camera is amazing for the cost, but it is not as good as a full DSLR, my sister has a Canon EOS (no clue what model) and those pictures seem to come out better. This camera is pretty small (for a mirror-less camera) and fits well in a coat pocket. It is difficult to find bags for this camera because of it's medium, not-quite-pocket-size dimensions. The \"Superior Auto\" mode is the best I have ever seen on a camera, it takes vastly superior pictures compared to a Canon ELPH 330. If you are looking for a cheaper, almost pocket sized DSLR, then I highly recommend this camera.", "Date": "February 26, 2014"}, {"Title": "Great photos but no viewing lens.", "Author": "Kyle Tipp", "ReviewID": "R1HEXOODEJQZUZ", "Overall": "4.0", "Content": "Let's face it, point and shoot cameras are a dime a dozen. What I like about my Sony NEX is it is easy to use and takes fantastic pictures. It has many features for advanced photographers to take advantage of. However, the lack of a viewing lens makes taking photos hard to accomplish when you're trying to view your shot through the screen in a bright setting. This is a bit of a bummer because i love the quality photos ive been able to take. Overall I'm very happy with my purchase especially considering I bought it on sale.", "Date": "February 23, 2014"}, {"Title": "Home run Sony", "Author": "Terry N Haag", "ReviewID": "R2TB7UR38B5A2U", "Overall": "5.0", "Content": "I have really enjoyed using the little camera.  It has provided some really nice photos, probably the best I've ever taken.  I have even started experimenting with the interchangeable lenses for the E mount design.  I think sony has really produced a nice affordable camera.  I'll probably never use my Nikons again.", "Date": "February 22, 2014"}, {"Title": "Great camera for any skill level", "Author": "Pigsflew", "ReviewID": "R1OPQV6W4CM238", "Overall": "5.0", "Content": "I'm a bit new to photography as more than point and shoot, so I did a lot of research before buying a camera--I wanted one that would scale to me as I learned new things, and this I think is the ticket.I borrowed my older brother's NEX-5 (previous generation) before buying, and absolutely loved it, and once I had one, I started noticing professional photographers with NEX cameras as their \"light duty\" cameras. At a wedding, I talked to one of the photographers about it and he was saying that when he wasn't \"fully geared out\" (i.e. on a job that he had prep time for), a NEX-3 was his choice because it was light, portable, takes good quality photos, doesn't suffer much for options, and if something should happen to it, compared to his other equipment, it is very much replaceable.In short: This is a really solid camera that won't break the bank.In practice, the NEX-3 has lived up to that. Without thinking, if I snap a photo, it'll take a very good picture. If I have a moment, I can check the Camera's built in tips (!) and modify some of the defaults for the type of photo I'm taking, and get a *great* picture. If I know what I want to do (change the warmth, brightness, ISO setting, etc) I can do that too.I will agree with other reviewers that the Click wheel can be clunky, but it really hasn't bothered me that much in normal use. You might be able to do better if you're willing to drop another $300, but I think in this price range, this is a great choice.", "Date": "February 3, 2014"}, {"Title": "Great little camera for the price.", "Author": "c busi", "ReviewID": "R3Q930G9D1I2J4", "Overall": "4.0", "Content": "I am not a professional photographer, but like good quality photos.  I had agonized over the last couple of years about upgrading my Canon 20D, which is really old, (I bought it new), but is still considered a good camera by many.  I took it to a camera store and the owner told me I'm better off just getting a good lens and I don't need anything fancier unless I'm going to make huge enlargements, like posters, which I don't plan on doing.  So I put that idea aside, based on the store owner's expertise.Then I saw this Sony NEX 3n camera when it was the \"Deal of the Day.\"  I started researching it and by the time I was done with my research, I missed out on the deal (could just kick myself!), but I went ahead and bought it locally anyway.  The idea of a small, compact, camera that could give me similar or maybe better quality than my huge, heavy 20D seemed like an excellent alternative to upgrading!  AND best of all, it was cheap and I wouldn't have to spend a fortune.  I have found myself leaving my 20D home quite a bit, except for extra special occasions, it's such a pain to lug around.  Been using my iphone camera a lot, because of it's smallness and convenience, but, of course, it takes so-so photos.  This Sony NEX 3N is just as convenient as my iphone, I have been taking it everywhere with me and I have found it is no extra burden at all, because it is so small and light.The only things I don't like about the Sony: the screen is hard to see when you are outside, there is no view finder.  The flash is a little harsh at times, but it pivots, so you can move it and make it less harsh, and there are menu settings for the flash in the camera as well, along with many other camera settings.  The menu does take some getting used to and digging around, and taking many practice photos to get just the right settings for each situation.  And it has slow response.I am VERY happy with my purchase.  It takes beautiful photos, the color is stunning, it's cheap, and it suits my needs because of it's compact nature.  I haven't played around with the video camera portion of it that much yet, but that's another added bonus.  What video I did take is better than the iphone.  The Sony will be getting much use this summer.  Hope there is some good, upcoming sales, I will be buying one or two as gifts.  Sure, there are better cameras, but for the prices this is going for right now, it's hard to go wrong.  If you are tired of lugging your huge DSLR around and you are tired of your weak iphone or point and shoot photos, then this priced-right little Sony may be the answer.UPDATE:  I found I just could not live without a viewfinder because this camera is VERY difficult to use outside on a bight sunny day.  I tried using a matte screen protector, but it did not help.  I ended up purchasing an NEX 6, which I'm very happy with.  I knocked a star off my review.  The NEX 3n still takes gorgeous photos, so I don't feel right giving it 3 stars.  I will give the NEX  3n to my mom, as she is way over due for an updated camera and I think this will suit her needs better than mine.", "Date": "February 2, 2014"}, {"Title": "Superb mirrorless camera", "Author": "Glen", "ReviewID": "R25LZWUSDTHR5X", "Overall": "5.0", "Content": "I did a ton of research on the new mirror-less cameras - my daughter wanted one for Christmas. She had actually been interested in the Nikon-1 in white and had added it to her wish list, but Santa did his own research.I first looked at the Nikon 1 specs and was surprised to see it uses a much smaller CX sensor (116 sq-mm) - smaller than just about any other interchangeable lens mirror-less camera on the market. The Sony NEX-3N on the other hand uses an APS-C size sensor which is about 3 times (300%) larger - it's the size used in most digital SLR's.  This translates to much better low-light performance, such as indoor and evening shots.I was tempted by the higher priced Sony NEX 5 series, but I didn't think she'd use the extra pro features, whereas she would definitely use the built-in-flash and flip-up \"selfie\" mode view-finder display of the NEX-3N.  Anyway - she loves her new white Sony NEX-3N.  She says it focuses really really fast and is very light and \"cute\" :).", "Date": "January 19, 2014"}, {"Title": "camera is perfect", "Author": "racks", "ReviewID": "R24GJY0EZJTI1S", "Overall": "5.0", "Content": "the function and use of this camera works very well in our Department who always have event mostly every week and this camera have a  nice picture for each shot..", "Date": "October 21, 2013"}, {"Title": "Excellent camera", "Author": "Julia \"JB\"", "ReviewID": "R3KD7E0V3171BA", "Overall": "5.0", "Content": "I'm not sure how much I can really say about this camera that hasn't already been said so I'll keep this short but I will say that this camera takes beautiful pictures! This is my first camera that isn't a point and shoot and I love it. Even though you can use completely manual settings if you want I have a feeling I'll be using superior auto a lot, as well as aperture priority or shutter priority in certain situations. Superior auto is amazing. I've taken a good bit of pictures with the ISO set as high as 3200 and haven't seen any noticeable noise. I haven't tried any ISO's higher than that so can't comment. One thing I've noticed in other reviews is that a lot of people have complained about the menu system. I find the menus pretty intuitive. Much more so than my last camera, which was a Nikon. Also, I have no problems seeing the LCD display in sunlight. I love the way the flash can be bounced off the ceiling instead of having to point it directly at the subject. That's very nice. So far I've found nothing to complain about.", "Date": "July 30, 2013"}, {"Title": "Affordability With Great Image Quality", "Author": "K. Stancil", "ReviewID": "RKTJXO1ACM5G", "Overall": "5.0", "Content": "I was in the market for a great point and shoot for an upcoming vacation to Acapulco. However, since learning about Sony's line of mirrorless cameras, I invested more time comparing similar cameras. I have never invested more than $400 for a camera, but I have had plenty of experience with DSLR's. I've compared this camera to high-end point and shoots like the Canon G15 and other mirrorless cameras like the Nikon J1. I find this one to have all the my camera needs. This particular camera won me over for its capabilities and the camera's portability.The camera contains a large sensor capable of taking beautiful shots even in low lights. The kit lens for the NEX 3N shoots at 16mm - 50mm which I think is the best suited for everyday use. The camera does have its downfall like the screen inability to tilt face down. The screen is also not the best quality, often showing a grainy version of your shots. This could be seen a plus, if you consider how much power the low resolution screen saves the camera.Overall this camera is great for every day use. It is sleek, powerful, and affordable. If you are a beginner in photography and want a camera that is capable of taking amazing pictures, this is definitely the camera to purchase. Shortly, after you have developed your ability to use the camera you can purchase more capable lenses that are available for the NEX series.If you want to compare different cameras based on specs you can use the website, Snapsort to compare cameras. I used this website to compare various cameras before purchasing this one. Be cautious though, not to be swayed by the camera's ranking, the website may list a particular camera the winner simply because of popularity.", "Date": "April 20, 2013"}, {"Title": "Good pictures with typical Sony annoyances", "Author": "Wesley Penner", "ReviewID": "RGYHUXDBL2GFG", "Overall": "4.0", "Content": "The camera takes good pictures. My other camera is a phone, and it doesn't take great pictures. This camera takes good low light photos and has decent software with convenient automatic features. What is most annoying is that I need to use the USB cable and charge adapter that Sony provides to charge the camera (via USB). I was hoping that I could use any of my USB plug adapters and USB cables to charge the camera, but when I tried different combinations, only using the Sony USB cable and plug adapter worked. The cable is really short too. Very annoying.", "Date": "January 25, 2014"}, {"Title": "Great quality and much better low light performance than the point and shoots", "Author": "John S. Dean \"John\"", "ReviewID": "R354YLNU3EK8D1", "Overall": "4.0", "Content": "This is about my 8th or 9th digital camera I've had over the course of my digital camera life.  I still had two, but only one that I really use.  This is, however, my first digital camera with an interchangeable lens.  I haven't had a camera with multiple lenses since my old Canon AE-1.  So it's been a while since I've done anything other than simple point and shoot.I unboxed it, and then it took just short of 5 hours using AC to fully charge the battery since it comes totally depleted, no charge at all.  A little frustrating for someone anxiously waiting to play with their new toy.My first thought on holding it though - heavy.  This thing has some heft to it.  Very sold feeling, not at all like the point and clicks I've gotten so used to in the decades since I had my Canon AE1.  The entire surface feels slightly roughened, even the painted black parts.  That gives the entire upper surface a cheap plastic feel rather than JUST a plastic feel unfortunately.  But I like the big physical slider to power on the camera.  SO much nicer than a standard little press button.Initial setup for time and date such is easy - the spinning wheel on the back increments numbers quickly.I jumped right in, without pulling out the manual.  Yes, I'm a techie, so we feel there will be bad juju if we use a manual.You can set image size to STD, FINE, RAW + Fine JPG, or just RAW.  Can also select 4:3 or 16:9 aspect ratios.  Image size is a separate setting - 3.4, 7.1, or 14MBYou select AVCHD or MP4 for movies, as well as quality (60i 24M, 60i 17M, 24P 24M, or 24P 17M)The menu is a very nice, with a crisp high quality display.  Icons are more detailed than most I've seen just for the main menu sections like Camera and such.  Very well rendered, and spaced so it's easy to press what you want.I like the tracking focus option to follow the object and adjust focus on that specifically.  Very handy since I do a lot of my photography around my 9 year old son.My flash did not come up, it was completely unresponsive to the button.  I got into a chat session online with Sony support to find out if there's anything I can do, and got a representative online instantly.  I asked if it was just a physical release or if it was electronic, since maybe I was just being overly sensitive about how hard to press.  Once he confirmed it's a physical release switch I knew I didn't have to worry about breaking any electronic button under it, so I really, really pressed.  And it finally popped up.  Subsequent flash releases are not as difficult as the initial one was so maybe it was just a \"first time have to release it\" bit of physical pressure inside it not letting it release easily.  The down side of the flash is that you can't angle it to bounce.  You'd think that a pop up in this configuration would have a way to pivot it up so you could work off of reflected light in certain circumstances, but no such luck.  It does a great job though with many options to select other than the normal \"on/off/auto\" options.It can charge from some computers depending on your USB port, and it comes with a wall outlet adapter to use with the USB charging cable.  My biggest complaint is that the cable is very short.  I prefer systems that have longer cables so I can have the power plugged in and run the cable to a \"cleaner\" area, rather than having to have the camera right by where the outlet is.  I have a charging \"station\" I've created on a table in my dining room where everything runs to a power strip on the floor under the table out of sight, so all I have are the small cables coming up  where the devices sit.  I can't do that with this one.  I'm bought two additional batteries for it and a regular charger so I can charge the battery directly without having to plug into the camera, and just have the cable in my bag for when I'll want to charge from my Macbook Pro.It's been twenty odd years since I've shot photos with a 35mm camera, so the strangest thing for me is the sound and vibration you feel in this as you take a photo, just like the old 35mm flipping the mirror up. Very noticeable both to your hands and your ears.  The other \"strange\" thing is being limited to a 50mm or so lens again.  I've been so used to zooming my P&S; digital cameras that it just feels WEIRD not being able to zoom to a higher magnification.  But that's the whole point of this unit, that it's not an \"all in one\" solution that has all the give and take needed to try to do everything with a single lens.  It doesn't have to compromise some areas in order to be able to do something in other areas...  Which brings us to the photo quality...I started taking indoor photos at dusk, with the blinds closed.  They're light colored Silhouette blinds that are horizontal fabric, and can be more or less sheer but still let light in while blocking anyone from seeing in.  So there was ambient light from the windows that made it easy to see clearly with the naked eye, but often prove problematic for the standard point and shoot digital cameras.  I'm using my Nikon Coolpix S8200 as my comparison camera, since it's been the most reliable one as far as photo quality goes and up to now has been my go to camera.  This one consistently does better.  With the Nikon, in auto mode, it has to do a longer exposure with this light level, and when just holding in your hand, you can see the blur on the photos.  The exact same photo taken with this one from the exact same spot two seconds later, faster shutter in auto, actually a brighter exposure and much better color representation, and no blur.  Again, this is in auto mode, without even trying to do anything to make low light photos turn out better.  The difference is night and day.Movies - this was a bit of a problem with my testing, since I was doing a movie against the blind covered window that was brighter than the interior of the room since there were no lights on inside.  If I kept the window out of frame, things looked really good even at the lower light, but the moment that window came into view, everything else basically disappeared, faded to black as if you were experiencing over G's and started to get tunnel vision before you blacked out.  That's exactly what this looked like.  Once you moved the window out of frame, things improved again.  So in that respect, it's pretty much typical of any other digital camera I've used.  But again, comparing it to my Nikon, the results are very satisfying.There is no hole on the lens cover to connect it to a strap or anything to secure it to the lens or camera body, and since it is a common pinch style that holds itself to the inside of the lens housing, it protrudes from the front of the lens.  This means that I keep finding it getting knocked off by the sides of my camera bag as I put it in and take it out.The raised bump on the rubberized spot on back for the thumb is as non existent as you can be and still say there's something there.  Really loved the one they did for the Fuji camera I tested (although I really disliked that camera for a variety of reasons, the ergonomics were awesome), but this one is just really poor, especially for a camera with this heft.  I can't even imagine how much worse it would feel once you throw a telephoto lens on this thing.  It's rubberized at least so your thumb gets traction, but there's hardly any physical shape to it to help out when holding it one handed.The flip screen is a nice feature, since I often end up trying to get a good shot of my son and I at various locations, and this is my first time with a camera that can do this.  However, as another reviewer had mentioned, it would have been nice if it could have pivoted the other way as well to take photos easily while holding it up higher over your head.  I also wish they had done a touch screen - that's getting near the point of being almost an expected thing on cameras now, and the other ones I have with touch screens have me quite used to the feature.  I felt its lack here since it would've made navigating some of the menus a quicker prospect.The menus work alright, I didn't find anything major to complain about.  One touch I really liked is that if you pause the highlight on an option, it pops up a description of that setting.  Which is awesome for people who aren't encyclopedias of photography.I wanted to buy a lens for it, but the Sony website is really lacking in that department.  They do have a \"compatible\" page on the camera's site, but all the links are dead.  So for now it's tough to use them to get more information.  I did find a website to help track down things that are compatible though, lenshero dot com so I'll likely end up with the 55-210 since the $300 range is more in line with my amateur use of a camera than the 800 and above range.For this lens that comes with it, you can either use the lever by the power/shutter buttons for adjusting the zoom, or you can use the slider on the lens, but you can also use the front ring.  The ring on the front of the lens though moves it MUCH faster than the other options, and you can hear the motor in there start to grind some.But for me, it all came down to the photo quality.  I've spent so many years jumping from one point and shoot digital camera to another, trying to find a really GOOD camera.  But as I mentioned above, they all have compromises they have to make in order to fit all the functionality into a single package.  My current Nikon has worked quite well, and I was impressed with its low light abilities, up until I got this.  And now I realize just how much of a difference it makes to get away from the all in one to something more like a real camera.  This thing gathers light so much better than any digital camera I've owned, it's simply amazing.  I take a photo and it turns out that it's a better lit representation of what I shot than what I saw with my naked eye.  Whether it's brightly lit from the sun outside (only had ONE of those days recently as we've been in a horrible wet and cold and cloudy Wisconsin spring so far), overcast, brightly lit indoors, or dim indoors, the photo quality so far has been just outSTANDing.  So for me, it'll be worth it to pick up another lens for this and have to deal with the \"hassle\" of picking the lens for the need, rather than just having the more limited point and shoot that's always \"at the ready\".  I bought a new camera bag and now have my two digital camcorders in it as well as all three digital cameras, so I'll be able to pick whatever I need for the circumstance, but I can see that the one I'll probably almost always reach for will be this one.  About the only reason not to would be if I needed something ultra portable.I also wish they had included to more covers - one for the camera body when the lens is off, and one for the lens when it's removed from the camera.All in all a great camera, and it may even be worthy of five stars depending on where you're coming at it from, but I think it rates a 4 or 4.5 no question.", "Date": "April 24, 2013"}, {"Title": "✔ APS-C sensor, Good Price/Value", "Author": "Kimberly R. Norton", "ReviewID": "RLPG6DXFTHEXA", "Overall": "4.0", "Content": "<!--\n\nfunction fp_resizePlayerSpace(nsPrefix,w,h)\n{\t\n  try {\t\n    var ifrm = parent.document.getElementById(nsPrefix + \"movieFrameID\");\n    if (ifrm) {\t\n        var h2 = h + 35;\n        ifrm.style.height = h2;\n      }\n    } catch(err) {\n \n    } \n\n\n  if (h > 0) {\n      document.getElementById(nsPrefix + \"clipDiv\").style.height=h+\"px\";\n      document.getElementById(nsPrefix + \"videoPlaceholder\").style.height=h+\"px\";\n  }\n  else {\n      document.getElementById(nsPrefix + \"clipDiv\").style.height=\"\";\n      document.getElementById(nsPrefix + \"videoPlaceholder\").style.height=\"\";\n  }\n  document.getElementById(nsPrefix + \"flashcontent\").style.height=\"100%\";\n}\n\nfunction fp_rewriteDiv(nsPrefix,divName,html)\n{\t\n    document.getElementById(nsPrefix + divName).innerHTML=html;\n}\n\nfunction embeddingPopup(nsPrefix)\n{\n  alert(\"placeholder function for embedding code\");\n}\n-->\n\n\n<!--\n\nfunction cv_mo379QANX6EACBEembeddingPopup(){\t\nalert(\"Embedding code will be displayed here.\");\n}\n\n-->\n\n\n\n\n\n\n\n\n\n<!--\nfunction cv_mo379QANX6EACBErefresh_preplay() {\n\ndocument.getElementById(\"cv_mo379QANX6EACBEchiDiv\").innerHTML = document.getElementById(\"cv_mo379QANX6EACBEhiddenPre\").innerHTML;\n};\ncv_mo379QANX6EACBErefresh_preplay();\n\n-->\n\n\n\n\n\n\n        // <![CDATA[\n\nvar cv_mo379QANX6EACBEso;\t   \n\n\nfunction cv_mo379QANX6EACBEloadSwf_Core(swfLocation, swfWidth, swfHeight, flashVersion, bgColor, swfParams, flashParams, embedAttributes) {\n\n  try {\n      cv_mo379QANX6EACBEso = new SWFObject(swfLocation, \"cv_mo379QANX6EACBEAMPlayerProd\", swfWidth, swfHeight, flashVersion, bgColor);\t   \n\n      for (var v in swfParams) {\n        cv_mo379QANX6EACBEso.addVariable(v, encodeURIComponent(swfParams[v]));\n      }\n      for (var v in flashParams) {\n        cv_mo379QANX6EACBEso.addParam(v, flashParams[v]);\n      }\n      for (var v in embedAttributes) {\n        cv_mo379QANX6EACBEso.setAttribute(v, embedAttributes[v]);\n      }\n\n      cv_mo379QANX6EACBEso.addVariable(\"swfEmbedTime\", new Date().getTime());\n\n      var agt = navigator.userAgent;\n       \n      var reFirefox = new RegExp(\"firefox/\", \"i\");\n      var regx = agt.split(reFirefox);\n      var ffVersion = 8;\n      if (regx[1]) {\n          var pts = regx[1].split(/[.]/);\n          ffVersion = parseFloat(pts[0] + \".\" + pts[1]);\n      }\n      var minorVersion = parseFloat(navigator.ap);\n      if ((navigator.appVersion.indexOf(\"Mac\")!=-1) || (ffVersion < 1.5)) {\n          cv_mo379QANX6EACBEso.setAttribute(\"height\", swfHeight);\n          cv_mo379QANX6EACBEso.setAttribute(\"width\", swfWidth);\n          cv_mo379QANX6EACBEso.addVariable(\"oldFirefox\", \"1\");\t     \n      }\n\n      if (cv_mo379QANX6EACBEso.write(\"cv_mo379QANX6EACBEflashcontent\")) {\n          fp_resizePlayerSpace('cv_mo379QANX6EACBE', \n                               320, \n                               283);\n      }\n      else {\n          var nsPrefix = 'cv_mo379QANX6EACBE';\n\n          fp_resizePlayerSpace(nsPrefix, 0, 0);\n          fp_rewriteDiv(nsPrefix, \"flashcontent\", '<br/>To view this video download <a target=\"_blank\" href=\"http://www.macromedia.com/go/getflashplayer\" target=\"_top\">Flash Player</a> (version 9.0.115 or higher)');\n      }\n  } catch(err) {\n      fp_resizePlayerSpace('cv_mo379QANX6EACBE', 0, 0);\n  }\n  return false;\n}\n\n\n\nfunction _cv_mo379QANX6EACBEloadSwf(movieID, playerVersion) {\n    var swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/20120510035744301/AMPlayer._V148501545_.swf\";\n    var swfWidth = \"320\";\n    var swfHeight = \"100%\";\n    var flashVersion = \"9.0.115\";\n    var bgColor = \"#FFFFFF\";\n\n    var swfParams = {};\n    var flashParams = {};\n    var embedAttributes = {};\n    swfParams.amazonPort = \"80\";\n    swfParams.allowFullScreen = \"true\";\n    swfParams.telemetrySubPageType = \"VideoReview\";\n    swfParams.nsPrefix = \"cv_mo379QANX6EACBE\";\n    swfParams.locale = \"en_US\";\n    swfParams.logUrl = \"gp/mpd/l\";\n    swfParams.canResize = \"1\";\n    swfParams.autoPlay = \"1\";\n    swfParams.sessionId = \"000-0000000-0000000\";\n    swfParams.marketplaceID = \"ATVPDKIKX0DER\";\n    swfParams.salign = \"LT\";\n    swfParams.preset = \"detail\";\n    swfParams.mediaObjectId = \"m38IVY74PNYIY6\";\n    swfParams.autoPlayTimer = \"\";\n    swfParams.mediaObjectIDList = \"m38IVY74PNYIY6\";\n    swfParams.playIsUserGenerated = \"1\";\n    swfParams.enableShare = \"0\";\n    swfParams.permUrl = \"gp/mpd/permalink\";\n    swfParams.telemetryPageTypeID = \"RLPG6DXFTHEXA\";\n    swfParams.xmlUrl = \"http://www.amazon.com/gp/mpd/getplaylist-v2/m38IVY74PNYIY6/000-0000000-0000000\";\n    swfParams.amazonServer = \"www.amazon.com\";\n    swfParams.scale = \"noscale\";\n    flashParams.allowFullScreen = \"true\";\n    flashParams.salign = \"LT\";\n    flashParams.bgcolor = \"#FFFFFF\";\n    flashParams.allowScriptAccess = \"always\";\n    flashParams.quality = \"high\";\n    flashParams.wmode = \"transparent\";\n    embedAttributes.title = \"Flash Player\";\n\n    if (movieID){\n      if (playerVersion == '3'){\n        swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/20120510035744301/AMPlayer._V148501545_.swf\";\n        swfParams.mediaObjectIDList = movieID;\n      } else {\n        swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/legacy/20101014901/AMPlayerProd._V197491872_.swf\";\n      }\n      swfParams.xmlUrl = \"http://www.amazon.com/gp/mpd/getplaylist-v2/\" + movieID + \"/000-0000000-0000000\";\n      flashParams.wmode = \"transparent\";\n      swfParams.autoPlay = \"1\";\n    }\n\n    if (document.getElementById('cv_mo379QANX6EACBEduration')) {\n      document.getElementById('cv_mo379QANX6EACBEduration').style.display='none';\n    }\n    cv_mo379QANX6EACBEloadSwf_Core(swfLocation, swfWidth, swfHeight, flashVersion, bgColor, swfParams, flashParams, embedAttributes);\n\n  return false;\n}\n\nfunction cv_mo379QANX6EACBEloadSwf(movieID, playerVersion) {\n   return _cv_mo379QANX6EACBEloadSwf(movieID, playerVersion);\n}\n\n\n\t\n\t\t// ]]>\n\t\n\n<!--\n\nfunction cv_mo379QANX6EACBEnewHeight(h)\n{\t\n    fp_resizePlayerSpace('cv_mo379QANX6EACBE', 0, h);\n}\n\nfunction cv_mo379QANX6EACBEresetPlayer(w,h,bw,cc) {\n  cv_mo379QANX6EACBEnewHeight(h);\n\n  cv_mo379QANX6EACBEso.addVariable(\"resetBandwidth\", bw);\n  cv_mo379QANX6EACBEso.addVariable(\"cacheCode\", cc);\n  cv_mo379QANX6EACBEso.setAttribute(\"height\", h);\n  cv_mo379QANX6EACBEso.setAttribute(\"width\", w);\n  cv_mo379QANX6EACBEso.write(\"cv_mo379QANX6EACBEflashcontent\");\n}\n\n-->\n\n\n\n\n\n\n\n\nvar cv_mo379QANX6EACBERollOverImg = new Image();\ncv_mo379QANX6EACBERollOverImg.src = \"http://ecx.images-amazon.com/images/I/71PXWhq2SRS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play-active,BottomLeft,130,-12_CR0,0,0,0_.png\";\n\nvar cv_mo379QANX6EACBEpreplay = document.getElementById('cv_mo379QANX6EACBEpreplayImageId');\nif (cv_mo379QANX6EACBEpreplay) {\n  cv_mo379QANX6EACBEpreplay.onmouseover = function() {\n    cv_mo379QANX6EACBEpreplay.src = \"http://ecx.images-amazon.com/images/I/71PXWhq2SRS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play-active,BottomLeft,130,-12_CR0,0,0,0_.png\";\n  }\n  cv_mo379QANX6EACBEpreplay.onmouseout = function() {\n    cv_mo379QANX6EACBEpreplay.src = \"http://ecx.images-amazon.com/images/I/71PXWhq2SRS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play,BottomLeft,130,-12_CR0,0,0,0_.png\";\n  }\n  \n  \n  var node = cv_mo379QANX6EACBEpreplay.parentNode;\n\n  var cv_mo379QANX6EACBEcurrentClick = node.onclick;\n  node.onclick = function () {\n    var head = document.getElementsByTagName(\"head\");\n    if (head[0]) { \n      var logTag = document.createElement('script');\n      logTag.type = \"text/javascript\";\n      logTag.src = \"/gp/customer-media/du/log.html?ie=UTF8&p=CustomerImage&s=CustomerVideoPlay\";\n      head[0].appendChild(logTag);\n    }\n\n    if (cv_mo379QANX6EACBEcurrentClick) {\n      return cv_mo379QANX6EACBEcurrentClick();\n    }\n  }\n}\n\n\n\n\n Length:: 0:57 MinsWHAT IS IN THE BOX♦Camera♦Power zoom retractable 16-50mm lens (SELP1650)♦Lens Cover♦Battery (NP-FW50)♦AC Charger (AC-UB10 USB)♦Micro USB calbe♦Body cap (mine is missing!)♦Shoulder Strap (You will definitely need the included shoulder strap or to purchase an arm strap for this camera.)IMAGE QUALITYThis camera takes nice images with it's APS-C sized sensor.  I have tested the image quality on iAuto in a room with low light. So far the results are impressive.FLASHThe flash will not pop up unless you press the flash button (manually engaging the flash).  Even if the flash is set to automatic, you must still manually engage the flash first, then when the flash is needed the camera's onboard electronics will fire the flash.ANNOYING ASPECTS♦The menu system on this camera is awful.♦The shutter is LOUD!♦When scrolling through the menu system you will get help tips on different functions (this is extremely annoying as the help information pops up way too soon and on every item).♦You hear the beep sound every time you move the wheel on the back of the camera.The last two features can be turned off by doing the following:.......Press Black round upper button.......Setup.......Help Guide Display = off, scroll.......Beep = offNote: the shutter sound cannot be turned off.VIDEOS♦To access MP4 video files from the SD card go to:......MP_ROOT......100ANV01......YourFile.MP4♦To access AVCHD files from the SD card go to:......private......AVCHDWISH LIST....Add a String on the lens cap.  There is no string on the lens cap so you will need to keep up with the cap.....Date/Time stamp option.  No Date/Time stamp is imprinted on the images. This can be done via the PlayMemories software after the fact but you cannot batch add the date/time with the software.  That is, you must add the date/time on each image one at a time.SOFTWAREYou will be provided a link to download *PlayMemories* which is the Sony software to import, manage, and edit photos and videos. This software is for the PC and the MAC. All you can do with the software is to rotate photos (or movies) clockwise, counter clockwise, and upload them to the web. That is, PlayMemories=useless.✔ FINAL THOUGHTSOverall this is a decent camera for the money.  Anyone wanting a small camera with excellent image quality that will not break the bank should look no farther.", "Date": "November 20, 2013"}, {"Title": "Great upgrade from a point and shoot", "Author": "Michael McKee \"mystic cowboy\"", "ReviewID": "R1P8EGAHRM6NHF", "Overall": "5.0", "Content": "I have a NEX 6, which is a great camera, and which my wife likes to borrow. She doesn't use any of the external controls and usually uses the viewscreen to compose her shots. Enter this camera. Like all Sony NEX cameras it takes great photos. What sets this apart from the more expensive models are features that I, as an avid photographer, use, but which most people probably don't. Do you need to shoot the camera manually, setting your own shutter speed and aperture? Do you need a viewfinder, or are you just find using the viewscreen on the back of the camera, as most people do?If you don't need the extra features of more expensive NEX cameras, why pay for them? The image quality is the same (except for the NEX 7). The small size of this camera makes it convenient to carry with you. It takes at least as good a quality image as less expensive DSLRs like the Canon Rebels. It's easy to use and Sony adds great extras like the sweep panorama and anti-motion blur modes. Great photos, small and easy to carry, easy to use what's not to like?Well, the one down side is that Sony's menus aren't totally clear. Is HDR under Image Size or Brightness/Color? Where are the picture effects modes? It may take some practice to remember where things are, but that's true of most cameras with lots of options. Oh well.", "Date": "April 18, 2013"}, {"Title": "The Perfect Camera for Soccer Moms :D", "Author": "Shanti", "ReviewID": "RXW5CW502AEER", "Overall": "5.0", "Content": "as a mom of 2 kids, i need a camera that:- small enough so it can fit into my handbag- amazing image quality- has fast focus ability (taking pics of kids running around indoor doesn't work with my older Oly E-P1)- screen can rotate 180° so that you can take self-portraits & social photography with friends- built in flash for indoor and night shots- large sensor (I want some nice bokeh and ability to take pictures in lower light)- user friendly, intuitive menus- ability to shoot in RAWAnd i can happily say that Nex 3N fill all these criteria. I don't need hotshoe with extra accessories, i guess i'll never use it. 16-50 kit lens is more than decent for me. And that zoom lever on shutter button? It's brilliant!If you are use to Canon compacts (i have S95), instinctively you'll reach for the zoom lever instead of the lens body LOL! And when taking self portrait, since you're using only one hand, zooming in and out is only possible by using the zoom lever.Form factor wise, the camera is nice to hold, thanks to the grip. Not the prettiest mirrorless camera (hello Fuji X series!), but still nice enough. Seeing the camera IRL, IMO the white is prettier, with silver lens. While the black has black lens.If there's anything i want to add to this camera:- converting AVCHD video is kinda complicated (MTS file). I have to buy third party app like pavtube. Sony should've provide some kind of converter software.- shutter sound a little too loud- some connectivity would be nice. wifi. android os with sim card slot maybe :)Anyways, I have a feeling this camera is going to be with me for a looong time :)", "Date": "April 12, 2013"}, {"Title": "Step Backward from the F3", "Author": "AG \"Sooners\"", "ReviewID": "R3UX6KGYBIKA39", "Overall": "3.0", "Content": "I read about how the Nex-3N is much better than the Nex-F3, but I used both and that's not true. Both have about the same build quality. While the 16-50mm kit lens is smaller on the 3N, it yields very poor results in terms of resolution and colors. The 18-55mm kit lens on the F3 gives better detail. There is no point of having a big APS-C sensor with such a poor lens that washes out the pictures.If your goal is convenience, it would be better to stick with an advanced point and shoot such as the LX7, G15 or P7700.  If cost is not an issue, the Sony RX-100 is a superior camera to all these. If you want a Nex, the F3 is the better option.", "Date": "May 3, 2013"}, {"Title": "Despite some operational shortcomings, this is a good deal for the money", "Author": "S. Vogt", "ReviewID": "R2ETBG9CZ5LA8C", "Overall": "4.0", "Content": "While the NEX-3N is not perfect and has a few annoying attributes, I think most people will be willing to forgive those shortcomings when they see that this camera produces DSLR-quality photos in a small body for not a lot of money.The camera uses Sony's excellent 16MP sensor which is a proven performer not only in other Sony cameras, but also in cameras like the Nikon D7000 and Pentax K-5. Image quality is excellent, every bit as good in all respects when compared to Canon Rebels and Nikon DX DSLRs. Color, detail capture, and dynamic range are excellent. The camera does a good job at handling noise through ISO 3200. And the exposure is usually right on the mark if a little prone to underexposing. Which I prefer because this helps retain detail. The 16-50mm power zoom kit lens is sharp through its focal range and makes for a nice compact package when to compared to the big metal 18-55mm kit lens that used to come with older NEX models.Operationally the camera has a few really good things going for it. One unique feature on this camera that the other NEX models do not have (this of course might change in the future) is the zoom toggle which you can use with the power zoom E mount lenses. This is an especially nice feature for folks coming from a point and shoot. Being Sony's entry-level NEX, there aren't a lot of direct access controls. Even the mode dial is located inside the camera. Although this has been the case with all the low end NEX cameras up until now. If you're enthusiast who is interested in the NEX line but likes the typical physical controls that a DSLR would normally have, my suggestion is to look at the NEX 6. But accessing the shooting mode dial is just one extra button press, so it isn't overly annoying. Other shooting functions, such as changing the autofocus area, are located under the camera submenu in the main menu of the camera (you can't change the AF area in Auto mode, BTW).Autofocus performance is a little sluggish in low light but still acceptable for most purposes and fine in all other shooting conditions. One annoying attribute, which has been an issue on prior Sony NEX's and the RX100/RX100 II is that the camera doesn't do a very good job of pinpointing the autofocus area in low light, instead it just throws up a big box on the screen. So, if shooting in manual mode, your best option is to manually select the AF area on your own.The camera is constructed of high-grade plastic which gives it fairly solid feel overall. The grip on the front of the camera is a little less substantial than the one on the NEX-F3 but it's better than nothing at all and ultimately the camera still feels secure in your hand. Sony decreased the screen resolution on this camera to 460K which I think is a real punk thing to do but luckily the screen is still fairly usable in most shooting conditions. To be fair though, this camera started at a lower price point than the NEX F3 did. The screen flips up for self portraits like it did on its predecessor. The pop up flash isn't powerful but sufficient enough for most folks' needs. I do like how you can tilt it back to bounce the light.Overall, the excellent image quality makes this camera one of the best you can buy in the sub-$500 category, and like I mentioned, it has some operational issues, but nothing that I think that would severely detract from the overall shooting experience. It makes a great step up camera for folks coming from a point and shoot.", "Date": "December 30, 2013"}, {"Title": "Awesome camera!", "Author": "T.Chance \"Travis Chance Photography\"", "ReviewID": "R1DVLS4WOTKQMS", "Overall": "5.0", "Content": "I'm a professional photographer & wanted a small mirrorless system that would produce great images without the extra gear I normally carry.  I wanted a focal range of 15-50mm & this kit fit the bill perfectly!  It's pocketable, inconspicuous & with 16mp, allows you to crop images & still retain significant detail for good sized prints (up to 8x10).  Truthfully, I was really impressed.LOVEDcompact & lightweightthe ability to shoot in RAW format4 fps & continuous AF tracking (worked well at MonsterJam!)flip screen for self portraits + self video16mp sensorhigh ISO capabilitycrisp & clean imagessimple videoability to shoot in full manualautomatically stitches panoramic images into single filegood battery lifeHATEDcomplex menu systemlack of hotshoelack of viewfinderlack of dedicated chargerinability to manually move AF pointsOverall, this is a great camera for the money & produced wonderful images & videos at higher ISO's.  For what it is, it's definitely a 5-star camera.  Ultimately, I returned it for the NEX-6 which gives me a hotshoe & viewfinder!", "Date": "June 22, 2013"}, {"Title": "Excellent", "Author": "Blueduck3285", "ReviewID": "R1SPFTYZGDTQ11", "Overall": "5.0", "Content": "This camera is capable of soo much but yet in a tiny package. The camera has so many features and modes its hard to contain your artistic side. I love the performance of the camera. It takes some of the most beautiful pictures and really stands up well against large DSLR cameras. Purchased this camera for an international trip because of its size and capabilities and am extremely pleased!Buy this camera!", "Date": "November 1, 2013"}, {"Title": "Great camera, hard to see what you are shooting in sunlight", "Author": "Tariq F. Malik \"tfm\"", "ReviewID": "R5CER9XBJI4ID", "Overall": "4.0", "Content": "Good quality pictures, but lack of viewfinder makes it hard to see what you are shooting in sunlight due to the reflection on the LCD display, almost unusable.", "Date": "June 20, 2013"}, {"Title": "Perfect Beginner's Serious Camera", "Author": "falstaff", "ReviewID": "R2DH97VI5JKYJV", "Overall": "5.0", "Content": "I previously have been a big fan of premium compact cameras, and carried a Canon S95 around on all of my trips. However, in preparation for an upcoming vacation, I decided to take the step up to an interchangeable lens system. I looked into similar Micro Four Thirds offerings from competitors, but decided to give the Sony a try because it has a larger image sensor than similar models from other makers.I've been absolutely thrilled with this camera. Setup was simple and I felt comfortable with it almost immediately. While the menu system certainly has depth to it, it still feels intuitive, and no part of the camera has been intimidating. In fact, I feel like it is a camera I can grow into and a great one to learn more about photography with.However, the real test is the quality of the photos, and the camera excels here. I continue to be blown away by how good everything looks, even when I mostly keep it on \"Intelligent\" mode. Low-light performance has been fantastic, even without the flash. My pictures all come out crisp and vivid, and my friends are amazed by just how fantastic everything looks when I've shared them to Facebook. Also, the camera is incredibly light-weight, and I got a simple sling bag to carry it around, and it definitely doesn't weigh me down.I'm thrilled with this purchase, and now am exploring some cheaper lenses to start playing with. I would certainly recommend this camera to any enthusiast looking to step up into the world of interchangeable lens cameras who wants something light and simple that never fails to take a great photo.", "Date": "May 26, 2013"}, {"Title": "So far so good!", "Author": "R. Ferdin", "ReviewID": "R2CTZ5YLHJCDOB", "Overall": "5.0", "Content": "This is my first \"real\" camera after having owned countless smart phones and point and shoots. It is a huge step up from what they have to offer of course. I really have nothing else to compare it to as it's my first but I do know that this mirrorless is perfect for its price. It's a definite step up from any point and shoot.So far the only minor gripe is that it doesn't have a viewfinder. This makes it difficult to take pictures in bright sunlight as you have trouble viewing what's on screen.I love this camera and its compact size and I recommend this to anyone looking into stepping up from the point and shoots/smartphone cameras. This is one place a beginner should start.", "Date": "April 11, 2013"}, {"Title": "Great camera", "Author": "Debra", "ReviewID": "R1FU1Z18F82SWR", "Overall": "5.0", "Content": "Great camera! I just upgraded from a Canon digital Elph camera because I wanted to have the option of changing lenses. I'm still learning to use it, but at this price, it makes a great camera and takes wonderful pictures.", "Date": "June 4, 2014"}, {"Title": "Great little camera", "Author": "Alex", "ReviewID": "R1O5PZPQBN69YK", "Overall": "5.0", "Content": "Managed to get an open box through Amazon Warehouse for $204 including the lens. Has held up over a couple different trips over the last month. Takes great pictures for the $204 I paid for it. Brother just got an NEX-6 and that does take better pictures, but he paid over twice what I paid to get a better camera.", "Date": "May 28, 2014"}, {"Title": "Great Camera, Impossible Focus", "Author": "Red Books \"Red 'em\"", "ReviewID": "R1890IX4O0F5LZ", "Overall": "2.0", "Content": "I am no camera expert, which is why I was drawn to the ease and portability of a small DSLR.  Overall this is a great looking camera that takes great shots.  The only trouble is that 95% of those shots are out of focus because the autofocus has somehow honed in on something in the background, something in the foreground, or something that -- whatever the case may be -- was not what I was aiming for.  Such focus troubles have rendered this high-quality, long battery-life lasting, portable camera to the junk heap.I've dabbled in the manual focus as well, and despite my best efforts, can't divine a way in which the manual focus won't auto-zoom to 10x magnification so that I can uber focus on a subject -- enough that I can't tell what it is I'm looking at in the display.In short, if you can figure out the focus, please let me know.  If you can't or don't think you can, then buy something else.Incidentally, we have been incredibly happy with the Sony Cybershot.  Great pictures (in focus!), durable, and fits in your pocket.", "Date": "May 27, 2014"}, {"Title": "Great all-purpose mirrorless....", "Author": "DJ MinWah", "ReviewID": "R3S9CX3J8VC14L", "Overall": "5.0", "Content": "Am loving this upgrade to my Canon S90 for pictures in general but also for professional use in capturing my the events I DJ at for my website.  The autofocusing lens that comes with it is a good starter lens and I'll probably upgrade it down the line for different applications.  Recommended.", "Date": "May 25, 2014"}, {"Title": "Great Camera", "Author": "A. Brack", "ReviewID": "RQGCYE3FHHKT5", "Overall": "5.0", "Content": "We spent time researching cameras and found this to be the best camera and the best price!  We absolutely love it.", "Date": "May 25, 2014"}, {"Title": "Excellent camera for beginners who want to learn photography", "Author": "Raks", "ReviewID": "R48RVPJFN9ZXS", "Overall": "5.0", "Content": "This is an excellent camera equivalent to entry level SLR. It is equipped with so many features that can challenge any entry level SLR. Picture quality is awesome and it's 5/5 star is also considering it's light weight. For me this camera is better than any other camera in this price range like Canon T3i.", "Date": "May 24, 2014"}, {"Title": "Great Shots and Great Camera...broke in 5 months", "Author": "Jonathan Livingston", "ReviewID": "R1V977NURZYFPX", "Overall": "3.0", "Content": "This camera was a great price and a great shooting camera. Love it a lot. However, I was on vacation and the camera broke. No I did not drop it. I was taking a shot and the camera would not recognize the lenze. So I contact Sony and now it is in the shop. Not a good first experience with a Sony product. Hopefully yours does not break. Mine did. Overall, camera quality of pictures and features are awesome.", "Date": "May 21, 2014"}, {"Title": "Best camera I have owned!!", "Author": "Christian Steinhardt", "ReviewID": "R16EW1V9O718W1", "Overall": "5.0", "Content": "I bought this, mainly for my parents to use but, I have fallen in love with this camera!!  It takes great pictures in low light, the pictures are always of great quality and that is with the lens that came with it!!  I cannot recommend this camera enough, to anyone that is looking for one.  My only complaint would be the lack of lenses for it but, give it time and I know they will come!", "Date": "May 18, 2014"}, {"Title": "Get this!", "Author": "Alis Marachelian", "ReviewID": "R8ALCYWLF7Z9B", "Overall": "5.0", "Content": "It's a fantastic camera! Small yet with all the features of a SLR! Great for trips.. Might need to replace cover if not attached.. (Easily lost)", "Date": "May 18, 2014"}, {"Title": "I LOVE IT!", "Author": "Antonieta Fuentes", "ReviewID": "R7TNU8V03Y7FM", "Overall": "5.0", "Content": "Hello, I buy this camera to begin studying photography, I think is a good option for start, has very good reviews, I have the lucky to buy it in an offer from amazon and don't have regrets, the menu is very comfortable and easy to handle, the quality of the photograph is very good in spite of being only 16MP. I recommend with eyes closed, the screen is excellent and helps in certain situations, the lens that comes with the camera is good to start. Has an acceptable weight is not as heavy or light.", "Date": "May 17, 2014"}, {"Title": "Meh.", "Author": "CKT \"CKT\"", "ReviewID": "RR3L9S15YWUGW", "Overall": "3.0", "Content": "I think cameras are like lingerie--what is fits great for some doesn't for others, so others might completely disagree with me.  There is a little bit of a learning curve on this camera as far as settings go, but it's alright once you get the hang of it.  While the Sony takes nice pictures, I am incredibly disappointed at the lack of a true Macro capability.  With some tweeking, one can get pictures in Macro that are acceptable, but I find the Sony, in spite of many other quite nice features for this type of camera, very lacking in the Macro arena.  Frankly, I've a point and shoot that does a far superior job in Macro.  I wanted a smaller camera than my big Nikon D60 for added convenience, but I find because of the Sony's lackluster macro abilities, I'm back to lugging my big Nikon around more often than I would like just so I can obtain better Macro performance.", "Date": "May 15, 2014"}, {"Title": "Good camera", "Author": "Jorge", "ReviewID": "R2DE15NC2O6TE4", "Overall": "4.0", "Content": "I think it's a good camera for beginners like me, y found it very easy to use and I'm happy with the results I got with the photographs", "Date": "May 13, 2014"}, {"Title": "bang for the buck", "Author": "aaron miller", "ReviewID": "R3LSB7LX1990AY", "Overall": "4.0", "Content": "This camera has a lot of decent features. It is not the best in any one category but it is unbeatable at the price.", "Date": "May 9, 2014"}, {"Title": "okay camera", "Author": "kymmy", "ReviewID": "R33ROUKR0WMHWP", "Overall": "3.0", "Content": "i give it 4 stars for the quality of the pictures which are really great. even the creative effects are awesome/3 starts only however because i could hardly see the image when taking pictures in bright lights/sunlight. that is very inconvenient. also difficult when you ask someone to take a picture of you cause they can't see a thing.sadly, i have to return this and is currently looking for a better camera.", "Date": "May 7, 2014"}, {"Title": "good camera", "Author": "Brent Herber", "ReviewID": "RDXOR75M4V1VW", "Overall": "5.0", "Content": "bought a Cannon and wasn't impressed, sucked AA batteries and that flash was super slow.  this camera is fast and the battery life is great", "Date": "May 6, 2014"}, {"Title": "love it", "Author": "Jorge", "ReviewID": "R3CGIY78WF92KT", "Overall": "5.0", "Content": "This a great camera and am sure every body lave it, together with the lenses is a great buy, like it", "Date": "May 5, 2014"}, {"Title": "Best camera ever!!", "Author": "Niels", "ReviewID": "R3U6TZ3I27EMIB", "Overall": "5.0", "Content": "Perfect for traveling and take selfies; I buy it specially for a long travel I will make with my GF and the camera really worked perfect, we took such awesome pictures, and the battery is great, the charge last for days; I use different lens and they fit well, even with adapter non from the same brand.", "Date": "April 30, 2014"}, {"Title": "Complete!", "Author": "Ricardo Oliveira \"RSO\"", "ReviewID": "R1WPMXZ90SPEWK", "Overall": "5.0", "Content": "I've been using Canon equipment so far as an amateur photographer. This is my 1st Sony and we are in a good relationship so far. Quality and compatibility are just great, being able to save RAW and interchangeable lens are killer features.Small details: camera grip is good for one hand usage, and is not too heavy.- it also has a grid with diagonal lines besides standards grids on screen.- it has no real dial/selector, but after a while you get used to it , and save space on camera.I do recommend buying a camera case, since it has a big LCD you might want avoid scratches on it.I've used it with a generic lens adapter for Alpha lens, but it loses automatic features as auto-focus. Besides that quality is really great.", "Date": "April 25, 2014"}, {"Title": "Sony Nex Series Is A Winner", "Author": "V. OPINCAR \"vopincar\"", "ReviewID": "RPHWZWXCBKC32", "Overall": "5.0", "Content": "I enjoy photography as a hobby, and have the usual big Nikon Film camera in a drawer with all my expensive lenses.  Digital has been a boon, and I have had quite a parade of hobby level camera (Nikon, Panasonic, Canon, etc) over the years.  The problem with all is the lack of a good sensor for low level lighting, like in a gym.  I had been reading all the Sony reviews for quite a while and finally pounced with the price dropped for the Nex-3.That was a good decision, best that I have had so far and a great sensor considering the price.  The only irritation was Amazon not including a smart card with the camera.  So far, so good (at least for a hobbyist).", "Date": "April 23, 2014"}, {"Title": "Excellent product and on time", "Author": "giordain", "ReviewID": "R2W4SZJXKT4DWM", "Overall": "5.0", "Content": "Great camera. Unfortunately, the camera stopped recognizing the lens two weeks after a got the camera and three days before returning from my trip. I am glad Amazon replaced it. The user experience to attach and detach the lens cover is not friendly. It arrived on time!", "Date": "April 21, 2014"}, {"Title": "Perfect Starter Camera", "Author": "BECKY", "ReviewID": "R1D3U9GQI893KF", "Overall": "4.0", "Content": "This is a great camera for new photographers looking to get more serious about their hobby. I love the size and look of the camera; It's light and slim enough to take hiking (I have even carried biking and skiing) but takes amazing pictures. Biggest complaint is the view screen- hard to see on sunny days because of glare. Also, can be a little slow between shots. So far, I'm very glad I bought this camera.", "Date": "April 19, 2014"}, {"Title": "Great Camera", "Author": "Chris Warne", "ReviewID": "R2RLNLW3OOC4CA", "Overall": "5.0", "Content": "Real Easy to Use and Great video and pictures. Very small and portable for the type or camera. Low light photos are awesome.", "Date": "April 14, 2014"}, {"Title": "Good and cheap, but grip can be better", "Author": "Chiu-Hong Chow", "ReviewID": "R27ADTI8EVATAK", "Overall": "4.0", "Content": "I was debating between this and the 5R.  At the end I picked the 3N because it is much cheaper (3N + 55-2100mm lens cost the same as a 5R). The 5R has various advantages such as WIFI and better built, but I think there are 2 major things that are often overlooked:- The grip is much smaller on the 3N than the 5.  It is still sufficient for the kit lens, but it is not deep enough for anything heavier or longer.  The 5 is much more comfortable to hold for an extended period of time.- The custom button assignment is much more limited.If you can, you should try out both cameras to make sure the smaller grip doesn't bother you.  I would personally pay $100 more if it has the 5 style grip.", "Date": "April 4, 2014"}, {"Title": "Great camera", "Author": "Kit L. Shaw", "ReviewID": "R24AUXNRDJYLDA", "Overall": "5.0", "Content": "Great little camera.  I bought it for my wife but I think I am having more fun with it.  It takes crystal clear pictures.  I usually shoot in aperture control but have not taken it off auto and every picture has come out great.  It actually does a better job than my Sony a550 in a lot of situations.  Did I mention it's small; so easy to carry with you.  Fun camera to own and at a great price.", "Date": "April 2, 2014"}, {"Title": "Great product!", "Author": "R. Denholm", "ReviewID": "R217MD7QZ4J8C4", "Overall": "5.0", "Content": "This is the perfect travel camera for my needs. The lens is sharp, and the large sensor makes for good quality pictures. I shoot in RAW format, and use Lightroom 5 for processing. I am very happy with my choice.", "Date": "April 2, 2014"}, {"Title": "love it", "Author": "Candy", "ReviewID": "R2XVRGYTA114D2", "Overall": "5.0", "Content": "Takes very good pictures~I liked it very much~It is very suit for girls. small and light. easy to carry LOL", "Date": "March 30, 2014"}, {"Title": "Good for the money.", "Author": "JP", "ReviewID": "R2X60TYUCY1P8J", "Overall": "4.0", "Content": "This camera has a ton of features, it does take some time to learn all the functions. One thing I really liked is that the description is on view screen for each function that you scroll to so you don't have to get the manual out to look everything up.", "Date": "March 25, 2014"}, {"Title": "Pro camera at a great price.", "Author": "Andres Cambronero", "ReviewID": "R1IM1UKMA73S4T", "Overall": "5.0", "Content": "The battery is really good, I use it a lot in battery save mode, and haven't charged for up to 3 days. The image quality is excellent, and the intelligent+ mode is like hiring a personal photographer. The flexible display it's great for selfies or group images, you put it anywhere and the camera do the rest, no need to setup or set timer. I got a monopod at the same time and helps to make the most of the camera.The only thing this version is missing is the built in Wi-fi which is included on the NEX-7, but obviously it's included in the price as well.", "Date": "March 25, 2014"}, {"Title": "Good hydbrid Camera", "Author": "nookuser2012", "ReviewID": "R1WR9AGH62LYCX", "Overall": "5.0", "Content": "I wanted to buy a DSLR camera but ended up buying this hybrid camera and it is working fine as per my needs", "Date": "March 24, 2014"}, {"Title": "Great camera", "Author": "billy jean", "ReviewID": "R2WCVNGLEKO5Y0", "Overall": "4.0", "Content": "It is a great camera and the settings are good but the lense it comes with does t have verry good zoom but that can always be fixed by buying a better lense. The pictures are so vivid!", "Date": "March 22, 2014"}, {"Title": "AMAZING", "Author": "sundrop", "ReviewID": "RRRSWZ6FVWP9Q", "Overall": "5.0", "Content": "Great Camera! I put it on i-intelligent auto and it takes photos like a professional would! I am an amateur when it comes to photo taking and this camera is amazing. Worth the money. Disclaimer: This camera does not come with an SD card so make sure you buy that- because I didn't.", "Date": "March 17, 2014"}, {"Title": "It is OK", "Author": "D. nguyen", "ReviewID": "R2LHHAH6WVWJH", "Overall": "4.0", "Content": "It was the lighting-deal, and a first mirror-less camera.  The output is above average (better than my Panasonic Lumix 6 series)FWIW, the Nokia 928 on Verizon actually as good as in low-light.  The Nokia does not have the removable memory (and it is heavy as a phone)  I will keep this and learn more about it.  I hope for new firmware release to fix the red color issue in iA mode.", "Date": "March 14, 2014"}, {"Title": "Excellent Cameara", "Author": "Anh A. Nguyen-huu \"FifiEwok\"", "ReviewID": "R168MPVWOO9WLP", "Overall": "5.0", "Content": "We had other small point-and-shoot Sony cameras and also a few from Canon, Nikon and Olympus but this NEX is by far the best with vivid colors, excellent sharpness and works even better than the big Nikon camera (with exchangeable lens) we have.It's worth every penny and more...", "Date": "March 13, 2014"}, {"Title": "great image quality", "Author": "G. Ling \"G\"", "ReviewID": "RZ08J27S98TCA", "Overall": "4.0", "Content": "Great picture quality. Finally a point and shoot that can get accurate focus even in not so bright setting. Finally!!!", "Date": "March 7, 2014"}, {"Title": "Cool camera", "Author": "pks09", "ReviewID": "R11CI6Q024CZX4", "Overall": "5.0", "Content": "This camera met all my photo requirements and the picture quality is excellent.Panoramic picture is pretty easy to take and comes great with this camera.", "Date": "March 6, 2014"}, {"Title": "Great little camera, especially low light", "Author": "K. J. Jones", "ReviewID": "R248EPEHLI28VB", "Overall": "5.0", "Content": "This is a great camera, smaller than a DSLR and will fit into a bluejeans pocket, barely. Nice wide-angle on the included 16-50 lens. I sprung for the SELP55210/B for a great telephoto. Indoors w/o flash is excellent, far better than any compact I have owned. Flash is good too, great for fill/backlit pics. It isn't a DSLR and lacks the stellar qualities of those cameras, but it's simply excellent and at the under $300 price I got on a Daily Deal it was a bargain too. Note: I am in the process of replacing this as I was foolish and had it at the beach and a few drips of salt water go a long way to kill a non-waterproof camera - Sony doesn't cover water damage but thankfully my Discover card does!", "Date": "March 3, 2014"}, {"Title": "smart camera", "Author": "Xiaopeng Ren", "ReviewID": "R3O7CB6Q2LO8IM", "Overall": "5.0", "Content": "I love this camera very much. It is very small in size but has a high resolution. Also, not expensive.", "Date": "February 26, 2014"}, {"Title": "compact camera", "Author": "hartmann delphine", "ReviewID": "R2VOPI2UIG1DWC", "Overall": "4.0", "Content": "quite easy to use and very compact. I love it. The only thing that is a little bad is to cover the lens, a simple button that is so easy to forgive it in any place", "Date": "February 19, 2014"}, {"Title": "the best camera", "Author": "mohamed", "ReviewID": "R20QO6L2VZXLY", "Overall": "5.0", "Content": "Its really a great camera and has a lot of options and zooming facilities with the screen that turns up and down", "Date": "February 16, 2014"}, {"Title": "looks like it'll be fun", "Author": "marta greenhoe kaufman", "ReviewID": "RBCIMUZUJS2SF", "Overall": "4.0", "Content": "haven't used it much more than to play w it around house.  looks like just the ticket.  i bought it when i couldn't find my trusty old(er) cannon and i needed a camera for an upcoming trip.  nice size, easy/simple to use, pic's are great.  it was on sale, so a great price, too.", "Date": "February 14, 2014"}, {"Title": "Nice pocket camera", "Author": "Duane C. Stanton \"DuaneO\"", "ReviewID": "R29KMDYZGLDG15", "Overall": "5.0", "Content": "Very nice camera for traveling in places where a large camera would attract un-wanted attention.  And sice the camera takes such great pictures, the larger camera wasn't missed.Also, I can adapt other lenses to this camera making it super fun to use and I can use it manually!!Would highly recommend this camera for the day to day user.", "Date": "February 14, 2014"}, {"Title": "Huge Step Up", "Author": "Wayne Kutch", "ReviewID": "RBSDNN23O9BVE", "Overall": "5.0", "Content": "This camera has turned out to be a huge step up from my previous point-and-shoot cameras.  On several occasions now I have been shooting in conditions that would have produced marginal pictures with what I had been using before, and wound up with 'keepers'.  What I have particularly enjoyed using is the terrific low light shooting capability made possible through the cameras 'Twilight' mode, a feature that is automatically engaged when conditions warrant under the 'Superior Auto' setting.  Bottom line is that I am getting better pictures now and deleting less when reviewing the shots I have taken.", "Date": "February 14, 2014"}, {"Title": "Good buy!", "Author": "Charlie", "ReviewID": "R344AZD9T4AAGF", "Overall": "5.0", "Content": "Fantastic product with the low pricing. Pictures taken with the camera is very beautiful! Sony still has the best semi pro camera in the market!", "Date": "February 14, 2014"}, {"Title": "Good photos...Easy to use!", "Author": "AngieT2", "ReviewID": "R2QFLM581YNFQT", "Overall": "5.0", "Content": "Love this camera!  I just leave mine on superior auto mode and it works great.  I will be looking into a wide angel lens for more flexibility on this camera", "Date": "February 14, 2014"}, {"Title": "I love it very much !", "Author": "zhanghill", "ReviewID": "RI52U9ONY6BLF", "Overall": "5.0", "Content": "This camera cost performance ratio is very high. It contains all the features I need. The only drawback is not a metal shell. Express soon, but packing a little easier.", "Date": "February 13, 2014"}, {"Title": "Good compact camera", "Author": "FyreSG", "ReviewID": "R1X4C0F8TBZPZ0", "Overall": "4.0", "Content": "Got it at a special promo price so I'm happy. I had to use Vivid mode and increase color saturation by +1 to suit my liking. Auto HDR doesn't work well for me. I had to manually change HDR levels depending on the scene. Not a big deal though.", "Date": "February 9, 2014"}, {"Title": "Great shots", "Author": "S. Butler \"bird lover\"", "ReviewID": "R23ETZSBDNJU92", "Overall": "5.0", "Content": "This camera takes amazing pictures. In daylight, outdoor shots are difficult due to glare, it is hard to see the display on the LCD screen. We purchased a lcd viewfinder to remidy this. This is a sunshade.While on a hike we took a picture of 2 people rockclimbing.  We were quite far away. Wanted to test zoom. When we got home we downloaded picture and saw there were 4 climbers, not 2! we were amazed at quality of pictures.HDE ® LCD Viewfinder Extender V4 f SONY NEX-3 NEX-5 NEX3 NEX5", "Date": "February 8, 2014"}, {"Title": "Great camera to serve as back up of my Nikon D7000", "Author": "Amazon Customer \"Kenny\"", "ReviewID": "RNSJ51QCGRYRL", "Overall": "4.0", "Content": "Small and easy to carry around in my jacket. The pictures are beautiful especially in low light environment. I rarely use the built-in flash.", "Date": "February 4, 2014"}, {"Title": "Capable Camera", "Author": "Orloldman", "ReviewID": "R98EV67RTHESS", "Overall": "4.0", "Content": "This camera is capable of producing really nice photos.Pros:  easy to use, good value, nice results using the camera's auto modes, see other reviews on the rest of the pros.Cons:1)  not made to be easily used in manual mode (but, then again, if you are looking at this to use in manual mode, you are looking at the wrong model.  Try one of Sony's more expensive NEX models.  Same deal if its missing other features, such as an accessory shoe, a pc sync outlet, etc. that you might want.  This is designed as an entry level, low priced camera.).  Once you get used to the camera, you can exert a fair amount of control over the auto setting by metering off of selected things in the scene and locking the exposure before fully pressing the shutter.2)  the battery does not hold a charge well when not used (it will run really low within 4-6 weeks of not being used).  I haven't had issues with battery life when actually shooting with it.  I mention it running low because it's let me down on a couple occasions when I needed to grab it and go, only to find 8% or less battery life left in it.3)  It's probably just me but I have not found an easy way to get the photos completely off the camera using the software provided.  I have to download the photos, then format the memory card in the camera to remove the photos from the camera.  Annoying.4)  I wish to camera was a little smaller.  Anyone that says this camera is \"pocketable\" is either not using the zoom lens or has really big cargo pockets.  I'd like it smaller to better fit in my palm, be less noticeable for street photography, and to make it easier to handle.  That said, I have large hands and the controls, etc. on the camera are easy to use.Overall, nice camera for the money.  I own a couple DSLRs and bought this, on a tight budget, as a carry around camera.  No regrets.", "Date": "February 1, 2014"}, {"Title": "Great camera!!", "Author": "Kimberly A. Shin", "ReviewID": "R1FDKS4MTB5EIP", "Overall": "5.0", "Content": "Great lens and perfect compact size! I love it! Took it on a trip to the Galapagos and it took some amazing shots!", "Date": "January 27, 2014"}, {"Title": "Very handy", "Author": "Philip W. Knopp \"gadgetman\"", "ReviewID": "R3PY6K5F9WWKP4", "Overall": "5.0", "Content": "I own the NEX 5N and some lenses, but the 16-50 mm zoom on the 3N is quick and easy to use. Very handy. Pocketable.", "Date": "January 27, 2014"}, {"Title": "Just what I love", "Author": "dagralab", "ReviewID": "RJ0ASMU5PX0FI", "Overall": "5.0", "Content": "I'm not really an expert when it comes to camera but this one just exceeds my expectation! I was just actually looking for a compact camera that i could carry anywhere when I travel. And this one, it produced good quality pictures that I can't stop making books from shutterfly. :)) just what I love in a camera. :)", "Date": "January 24, 2014"}, {"Title": "Best for the price....!", "Author": "hei", "ReviewID": "R1TLKIDAWYFFFF", "Overall": "5.0", "Content": "Very good camera for the price, quality is same or better than entry level DSLR, my d3200 is too heavy to carry around but this is prefect for travel .......", "Date": "January 22, 2014"}, {"Title": "User friendly", "Author": "Chad Potter", "ReviewID": "RGE8F40K4LGL0", "Overall": "5.0", "Content": "This is an awesome camera!  It is super easy to use, and takes amazing pictures.  With two clicks you can go from beautiful single shots to high speed action shooting.", "Date": "January 22, 2014"}, {"Title": "Seriously best camera ever!!", "Author": "Amazon Customer", "ReviewID": "R1MP85A7ADVSYS", "Overall": "5.0", "Content": "I love love love this camera! I was originally was after the Nokia 1 J3 but it was out of stock. Best buy priced matched amazon for me and I am so happy the other was out of stock I love this camera! The pictures are so clear and bright the camera is easy to use I am not one for reading directions and I was able to figure out the different settings which there are lots of fun settings to use with this camera. I was worried about not having a big enough zoom but I am pretty impressed with what this little camera can do although one day I would like the bigger lense. So much better than carrying around a big bulky DSLR and so much better than any point and shoot!", "Date": "January 21, 2014"}, {"Title": "I love my new camera", "Author": "anonymous", "ReviewID": "R9BH8CPXH7O2A", "Overall": "5.0", "Content": "I have been craving for this camera for a while. Got it when it was on sale and totally loved it when I tried it first time. There are many functions that will need to be studied.", "Date": "January 20, 2014"}, {"Title": "Thank you Amazon for the Lightening Deal!", "Author": "Stephen Ingraham \"lightshedder\"", "ReviewID": "RFVDVH4N0V9OA", "Overall": "5.0", "Content": "Honestly, without the one-day deal on this camera, I would not have bought it...but I am way glad that I did...and now that I have used it I will be recommending it even at its regular price. It might have been designed with me in mind. I like the Auto modes and the Creative options...so easy! I like the Scene modes. The lens is excellent! Image quality is way better than my P&Ss.; I just love it. The only thing that disappointed me was that the lens cap has no tether. It is easy to find one that does, but still, Sony, come on!", "Date": "January 18, 2014"}, {"Title": "superior image quality", "Author": "Tybee", "ReviewID": "R2PBD17C3IQMXR", "Overall": "4.0", "Content": "With this camera you get amazing images as it has the aps-c sensor which is larger than the micro 4/3 of it's competitors. It has some nice features and settings to help make those images even better too! what you don't get is a view finder, touch screen, image stabilization in camera (it's in the lens), hot shoe, and a few other little things. So it's a great entry level CSC that will give you dynamite pictures without a lot of pizazz......but do you really need that? OH and great price :)", "Date": "January 18, 2014"}, {"Title": "Very Good little camera the fit in your pocket", "Author": "Yue Yu", "ReviewID": "R1S72MQOBQH5VQ", "Overall": "5.0", "Content": "I have a Canon EOS 60D with 4 lenses and there is no way that i can take itwhile i'm biking, runing or traveling. And this is the prefect for all of them.It only take small space in my bag and take good picture as EOS 500D. plusyou can change the lens like DSLRs.", "Date": "January 15, 2014"}, {"Title": "Good but not great.", "Author": "Stephen Hong", "ReviewID": "R37SSEAB9ZYLX0", "Overall": "5.0", "Content": "I'm still playing around with the settings. Night shots are a problem for me somewhat. But it's fast, light,and portable. Bought this for my trip so I can't wait to fully utilize the camera and document my trip. DSLR will stay home for this lighter option. And I think I miss the viewfinder. I just couldn't justify double the cost.", "Date": "October 19, 2013"}, {"Title": "Great camera", "Author": "Israel", "ReviewID": "R3F4AC2KHOBCBY", "Overall": "5.0", "Content": "Got it last week, great picture quality and very light comparing to SLR. Best non SLR camera in its price range.", "Date": "September 19, 2013"}, {"Title": "WOW! Whatta Deal!", "Author": "J. F. Fields \"Go Griz\"", "ReviewID": "R1M8T7UOI6FTN9", "Overall": "5.0", "Content": "This camera arrived promptly in the original packaging, in perfect shape, appearing to be brand new.  This vendor did a nice job with this purchase.  The camera ia ALL that I wanted, and much, much more.  The 16-50 standard lens is very sharp, with a great range.  Shot several shots at a Dodger night game, with excellent results.  I LOVE THIS CAMERA!!Using the RainbowImaging lens adapter, i can add many of my Sony Alpha lenses, a wonderful cost saver and convenience.", "Date": "September 15, 2013"}, {"Title": "Compact, lightweight and solid performance", "Author": "I.Peters", "ReviewID": "RAOMM22FL494K", "Overall": "4.0", "Content": "I bought my first compact system camera - an Olympus PEN E-P3 - last year and was in love with the technology right away. Understandably I jumped at the chance to evaluate the Sony NEX-3N as well, particularly because NEX models have had very good reviews in the past. Here are my comments, listed in no particular order:PROs:- Size and Weight: Very small and light-weight, even with the lens attached and the battery installed. The size is much closer to a point-and-shoot model than, let's say my E-P3. Easily one of my favorite things about the 3N.- Ergonomics: Surprisingly nice ergonomics for such a small and compact camera body. The grip is comfortably raised and textured, and there is even a small thumb rest on the backside. The rear wheel has just the right responsiveness. The NEX-3N feels very good to hold and operate. Good job, Sony!- Tiltable Screen: Very useful for all kinds of situations, not only the one that Sony advertises (being able to easily take self-portraits) but shots close to the ground, for example. I am glad they included this, even though it only flips upward and cannot be tilted sideways. Still a very valuable thing to have. Anyone who has tried to shoot flowers growing on the ground or even pets and children will appreciate this feature. I definitely do because I do not enjoy lying on the floor to take a great picture :-)- The Sensor: The APS-C is larger than the micro-four-thirds sensor and generally should result in better image quality, especially when enlarging pictures. However, I did not see a significant difference in image quality when comparing my E-P3 images to the NEX images, especially when noise reduction comes into play which cannot be turned off on the NEX, and in my opinion results in some detail suppression at high ISO settings. So to me personally, the sensor size at this point is a toss-up.- Power Zoom: Convenient, especially for users upgrading from a point-and-shoot camera because it is one less thing to remember. It is not the fastest zoom but just to have it is useful.- Full HD 1080 video. I use a dedicated camcorder when shooting video and not my camera, so I am not using this feature and won't comment on it. I only included this for completeness.- Kit Lens: Rather compact power zoom lens with a quality feel. It is not super fast and it is also a bit noisy (wildlife photographers take note :-)) but it is a nice versatile kit lens for the majority of (general) shooting situations. The lens offers two zoom methods - one is the more traditional ring at the front of the lens, and another is to use a sort of W/T rocker, located behind the ring on the left side of the lens (when mounted). Both methods seem to be power-operated, with the rocker being slower but quieter, and the ring faster but noisier. As to image quality, my pictures all came out OK with no major issues, no noticeable vignetting except at the very wide angle setting. Overall this is a good lens.SO-SO:- The flash: I am OK with the flash performance given that this is just a built-in little flash and by no means great, but at least there is a flash. It is probably best to shoot without it as much as possible but great to have when a shot would really be lost otherwise.- Shutter speed: This point could go in both categories. I found that when taking pictures in sufficient light it works fast but performance drops off quite significantly when shooting in darker conditions.-The LCD Screen: Just mediocre. This is not a significant point by a long shot but I was surprised to see the lack of quality in an otherwise cool little camera. I'm guessing that it was a price issue for Sony. In addition to the graininess of the display, it is also pretty much unusable in bright outdoor conditions.- No Viewfinder: While I take almost every picture looking at the LCD screen, there are some situations such as very bright sunshine, where I am more comfortable with an actual viewfinder. This is not an essential feature for me, it just ranges in the category of 'Nice To Have'. But depending on the individual and what he/she is using the camera for, this might be a point worth considering. Again, I am mentioning this for the sake of completeness.- Lens Compatibility: I would like to stress that this is a point that is significant to me personally but might not be for someone else at all. The Sony E-Mount lenses for the NEX cameras are not compatible with compact system cameras from Olympus and/or Panasonic. Given that I already have lenses for my E-P3, I might be able to use them with the Sony but it would require an adapter and most likely result in lack of functionality, so not ideal for my particular circumstance.CONs:- The Camera Strap: The one Sony includes with the camera is very flimsy and cheap looking. They might as well have not included any strap, it is that bad-looking and does not go at all with the otherwise gool feel of the camera and lens.- No Touch Screen: I have come to love the E-P3's touch screen and it is one of the features I use the most. It allows me to focus the camera pretty much anywhere with my finger tip and - if I want - shoot the picture at the same time. There have been many situations where this feature helped me get the shot that otherwise would have not been taken. That the NEX-3N does not have a touch screen is an important drawback for me. This was probably another cost decision on Sony's part but...- The User Interface: I did not find this very intuitive. There is no mode selection wheel on the top as with other cameras. Instead, in order to select a mode (available are: Intelligent Auto, Superior Auto which adds more noise reduction and stabilization, Program Auto, Aperture Priority, Shutter Priority, Manual, Panorama mode, and finally Scene Selection) one must press the center button on the rear wheel, and then either press the wheel up/down or turn it. To me this is tedious and I would have much preferred the straight-forward solution of a physically available mode selection wheel. Most other functions are also accessible via that button/wheel so this takes some practice and getting-used-to to memorize how to access what quickly.- No battery charger included. This is along the lines of that camera strap - I'm just sayin'...SUMMARY:I like the NEX-3N for its light weight and compact size. It makes it ideal for travel or situations where I don't want to be shlepping heavy equipment with me. While it has certain shortcomings, this is a well made camera offering a lot for its price point. And the camera that has every feature in just the right place and at the ideal price is not out there anyway. For people looking to upgrade from a point-and-shoot or others who do not see themselves lugging an SLR around and do not want to pay SLR prices, this is definitely a camera to consider. I still love my E-P3 a bit more but the NEX-3N is a solid performer that I will be very happy with as well.", "Date": "April 23, 2013"}, {"Title": "Amazing camera.", "Author": "S. Yu", "ReviewID": "R32O5SO285HLM7", "Overall": "5.0", "Content": "This is an amazing camera that takes great pictures in low-light conditions without flash.  I'm thinking of possibly pairing it with a fast prime lens in the future to fully take advantage of this new camera.", "Date": "January 10, 2014"}, {"Title": "Compact body, solid build, odd missing features", "Author": "Naomi (Storm)", "ReviewID": "R3E9LJ6I5B1H9A", "Overall": "4.0", "Content": "My main DSLR camera is with the Canon EOS line, but I'm not locked into the brand other than to say that I've liked the performance of my DSLR thus far. When comparing other non-point-and-shoot cameras, this is generally the standard by which I judge.The Sony NEX wins the size battle right off the bat. This unit is tiny, without the lens it could easily be in the same class as a pocket-sized point-and-shoot camera. The lens itself is reminiscent of a \"pancake\" style, very small footprint (for lenses anyway), very solid feel. Right off the bat, the small form factor came with some downsides for me - I don't really think of myself has having either large or small hands, but the NEX felt \"unstable\". The camera is very front-heavy, but unlike with full sized DSLRs, there's not much \"grab\" room. I also found myself accidentally hitting the zoom controls on the lens without meaning to. I'm sure this will probably go away with extended use, but off the bat, it was a bit annoying.The screen controls were also less than intuitive in my opinion. While all of the settings (I went straight to Manual mode) were displayed boldly on the well-lit LED display, the act of changing those settings was a bit more complicated. I did actually have to break out the manual a few times. ISO, \"shot type,\" and exposure timings are easily modified, but the rest are buried in sub-menu's.Most of these issues will probably go away with extended use and growing familiarity with the product. Having taken shots in bright day light, indoor light, night situations, I can find no real flaw with the picture quality. Video is also decent quality but the lack of an accessory port and the fact that the microphone ports are right in the way of your fingers, well lets just say that audio probably isn't going to be stellar. The inclusion of a flash is touted in their product description, but the lack of a hotshoe mount seems silly. Also why is there no battery charger? Why do the manufacturers these days feel the need for us to plug in the camera directly into the wall? Not only that, but the USB cable included is short as heck (2ft or so).All-in-all, the NEX 3NL/B seems like a camera in limbo. It's higher grade than what you'd find in a point-and-shoot, but missing several key features to be considered even an entry-level DSLR. It's like a strange consumer-pro hybrid with a mishmash of features that really don't fit anyone's criteria. What it does, it does well. But what it's missing can't be improved later on. This locks the camera into a very static configuration. Quite simply, it has no room to grow.", "Date": "May 1, 2013"}, {"Title": "It's a good starter level compact camera", "Author": "Yingrui Zhan", "ReviewID": "R5ST2LB43ARAU", "Overall": "4.0", "Content": "I bought it for my Christmas break and it was working fine. Although I'm not very interested in photographing, this is a good compact camera for starters.", "Date": "February 20, 2014"}, {"Title": "Great in portability", "Author": "Rajesh Joshi", "ReviewID": "R2SLQSOHQB9UHJ", "Overall": "3.0", "Content": "Nicely built and good results. Price to performance ratio is the best in its class. Very nice replacement to Point & Shoot cameras.", "Date": "January 31, 2014"}, {"Title": "Good Camera", "Author": "Renato Castilho", "ReviewID": "R2OE677Y0HEO6P", "Overall": "4.0", "Content": "Good camera, easy to use. Nice pictures since in dark enviroment. Good relation cost x benefit. xx xx xx xx", "Date": "January 1, 2014"}, {"Title": "Great product for the price", "Author": "Matt_UKTX", "ReviewID": "R1R01EAT5O0HUM", "Overall": "5.0", "Content": "For the money, this is an excellent product.  I took this camera on a round the world trip with my wife and got some great shots.  The larger sensor makes low-light photography a breeze, and I was also able to get some lovely depth of field shots.  The lens for this camera sells separately for $299, which means you are basically getting a top notch APS-C camera for only $150.I did not find focusing speed or the screen resolution to be an issue.  I also prefer the way the screen opens on this model vs. the NEX-6 and others.  With really difficult shots, I sometimes found the metering a little off (probably more to do with me than the camera) but this is easily corrected in Lightroom after the fact, provided you shoot in RAW, which I recommend.Stitch Panorama mode is fantastic...  A great feature...", "Date": "June 3, 2013"}, {"Title": "It serves the purpose", "Author": "Natalie_Holl", "ReviewID": "RNYV1F46F9V3S", "Overall": "4.0", "Content": "The quality of the lens is good. The best thing about it so far is that the pictures are so vibrant. Very beautiful. I also like that I can fit this camera in my purse. And I have to admit that the quality of the picture is wayyyy better than the point and shoot. One thing that I don't like is the body. It's plastic and it looks kind of cheap. But I guess they use that material because of its light weight. Other than that, this camera is a keep. I'm lovin' it!", "Date": "May 30, 2013"}, {"Title": "Perfect!", "Author": "soyeon kim", "ReviewID": "R1L99IC4MUSS61", "Overall": "5.0", "Content": "easy to use. easy to carry. really lighter than other DSLR cameras.But can get  great quality pictures.I strongly recommand this camera.", "Date": "April 25, 2013"}, {"Title": "Best of the 3 line to date, but...", "Author": "E. J Tastad \"ejt\"", "ReviewID": "R35WXET46IJ6WK", "Overall": "4.0", "Content": "Pros:Value with lens kit (16-50)Great image qualityLots of support from 3rd party for old manual lenses, etcLens is compactCons:Rear monitor (LCD) is lower res than previous modelLens could have better image quality at extremesNo accessory portShutter Noise (loud)LCD mottling (\"noise\") if daylight mode is enabledNeutral:Included wall charger only charges battery in camera through USB port (this is fine for some, but if you have a second battery is more difficult).Who is this camera for:Someone who wants a very compact camera with the largest possible sensor (better image quality).  The included lens is best for JPEG shooters.  This would be an ideal camera for someone looking for a huge step up in quality from a point and shoot.I started with an original NEX 3.  It was a great camera, nice large grip for a small little camera, huge APS-C sensor, ability to use any manual focus lenses from any camera mount, and SLR image quality in a tiny little package.  The issue they had was that the NEX 3 and NEX 5 were almost identical in function, they needed to separate the lines.  This meant keeping the 3 series the same or even cheapening the 3.The first upgrade was the C3, and this was a fine camera, a nice new image sensor that improved image quality some, but they made the grip so small I couldn't hold it and the battery compartment was locked out while on a tripod.  Then came the F3, they did a 180 on the size making it as large as the NEX 7 which fixed the grip, but it no longer appealed to people looking for a small camera, so then came the 3n.  Finally, Sony has it mostly right for a compact NEX.  It is sleek, stylish, and has a great sensor.  However, they also decided to make it the cheap model.The 3n has a low res screen on it 460k dots (worse than older NEX models) and is very small, and for the only display this is not great.  The display still servers its purpose, but it is among the worst in the class.  It also shows severe mottling in low light, blue and purple grainy colors, this is done to keep refresh rate high, but other model cameras do this without looking so terrible. This isn't a show stopper, but if you compose a lot of image in low light it can be very distracting.The lens performs well enough in JPEG, but is largely corrected in software.  Nothing wrong with this, but if you shoot RAW you will notice severe distortions that need to be corrected.  With the click of a button Lightroom will do this for you, but not all RAW editors are created equal.  They also left off the newer features like touch screen and Wi-Fi on the 3N.Despite the screen and lens design considerations, why do I love this camera?  The image quality for such a small package is amazing.  If you take a lens from an SLR and put it on this camera with appropriate adapter, you wouldn't be able to distinguish between the SLR image and the image from this camera.  It has that good of image quality.So why the 4 star review you ask?  I think it is great but not perfect.  The primary difference between this camera and my 3 generation old NEX 3, is the sensor, and the C3, F3 both share it.  I do like that they fixed some quirks so it is centered on the tripod, you can change the battery and memory card on the tripod, and put the excellent little finger grip on the front.  The C3 was too hard to hang onto, but this is great.  If some of the cons of this little 3n don't appeal to you, be sure to check out other cameras in the NEX line.  My favorite is the 6.  A little beauty to hold and is a great step up from other NEX models.", "Date": "April 26, 2013"}, {"Title": "Disappointed", "Author": "Howard W.", "ReviewID": "R3KZJ5P4QZZR6I", "Overall": "3.0", "Content": "I really wanted to love this camera.  As a part time profession photographer, I think that the mirror-less interchangeable lens cameras are the wave of the future.  Just as digital cameras replaced film cameras, I believe the \"live\" viewfinder (not display) is the way to go.But the NEX-3 isn't ready for prime time.Here are some of the problems:The fake (loud, very loud) shutter noise you cannot turn off.  This is a deal breaker for me.  I can't believe you can't turn it off and I've scanned the internet to find a way, but it can't be done on the NEX-3.  I wanted to stop the review here, this is so stupid.  I hope Sony does a firmware update to fix this.It has way too many menus (and menu items) to do simple stuff and they are not very intuitive.The flash doesn't have a quick change, you have to go into the menu structure.  You can quick change ISO, something you normally don't do very often, but not the flash.  The pop-up flash button is hard to press.No view finder and the display that cannot be seen easily in sunlight.  You can see it a little if you turn the brightness all the way.  Also deep in the menus.You can hear the zoom clearly when you zoom while recording videos.As for the pictures, the most important part.  If you hold the camera perfectly still you can get pretty nice pictures.  I took several hundred pictures.  Most were very good.  A lot were very soft.  The zoom is not impressive.  Though I can't blame that for that, the focal length is given.In general, I would say that there are a lot of really good super-zoom point and shoot cameras that are better than this.Update:  I really didn't mean super-zoom and got a comment about that.  What I meant was the class of camera like the Canon SX260.  The super-zoom is a different class of camera and not comparable.", "Date": "May 15, 2013"}, {"Title": "Hard to use outside", "Author": "WDB", "ReviewID": "RCU06DQ064AQ7", "Overall": "3.0", "Content": "This camera is capable of taking outstanding photos but has a major failing, it is very hard to see the screen outdoors and you have to be able see the screen for settings and framing your shots, all camera should have some sort of viewfinder either optical or electronic or at the very least an option you can buy. My other complaint is bad video quality compared to even cheap cameras I have used, it looked like it was dropping frames. If this camera had a viewfinder It would be a 5 star camera for photos.", "Date": "February 26, 2014"}, {"Title": "Very high image quality for a great value", "Author": "Amazon Customer", "ReviewID": "R27IU4H1SQ46DY", "Overall": "5.0", "Content": "This camera is capable of soo much but yet in a tiny package. The camera has so many features and modes its hard to contain your artistic side. I love the performance of the camera. It takes some of the most beautiful pictures and really stands up well against large DSLR cameras.", "Date": "December 31, 2013"}, {"Title": "fake shutter noise", "Author": "free_ride", "ReviewID": "R119VO149Q4ASC", "Overall": "1.0", "Content": "I am a NEX-6 owner and I love that body!  Bought this as a backup/beater body and for the smaller size.Was okay with the cheaper build quality.Was furious about the fake shutter noise, which cannot be turned off!  Thanks Sony for making an already loud shutter even more annoying.", "Date": "February 17, 2014"}, {"Title": "Great camera", "Author": "JNME", "ReviewID": "R13CV2Y0FAW158", "Overall": "5.0", "Content": "Camera was exactly as advertised.  Wanted something smaller than DSLR but with room to add lens.  Nice feel in hand.  Removed the neck strap after one session and added a single wrist strap.  Has all the controls you might want, while retaining several auto modes that make it as easy as a point & shoot.  My wife and daughter took great shots after only being shown where the on-off button and zoom was located.  I have used the flash quite a bit as fill-in when faces were shaded or dimly lit.  Have not yet learned all the features so will post an update.", "Date": "April 26, 2014"}, {"Title": "Great product", "Author": "Mariana", "ReviewID": "R24UVXVZF38ES9", "Overall": "5.0", "Content": "Received my camera perfectly, it is everything I expected, sony does not disappoint with this line of cameras, perfect for what I need it, beautiful product.", "Date": "April 11, 2014"}, {"Title": "Everything I need in a camera!", "Author": "Jeremy Q", "ReviewID": "R1G33P3UJK199A", "Overall": "5.0", "Content": "This camera works great for the type of business I am in!  I am a Real Estate agent whom was in need of a camera that took quality pics, and this was definitely a great choice for the price!  I'd recommend this to anyone who asked.", "Date": "March 16, 2014"}, {"Title": "My wife wanted to keep this for herself", "Author": "Guannan Pu", "ReviewID": "R33YN1YJCI8VBK", "Overall": "5.0", "Content": "I guess my title line explained everything already. Since she was never a person who loves to shoot pictures. This small camera is perfect in every aspect! I absolutely love it! You should consider to the original Sony cover case, since the camera is not only a camera but actually is a piece of clothing accessory.", "Date": "February 5, 2014"}, {"Title": "Great Camera", "Author": "taryn wells", "ReviewID": "RTPEBD9BO1RK8", "Overall": "5.0", "Content": "The camera is very light and takes fast, clear photos, which is exactly what I needed! It even came with a shoulder strap.", "Date": "January 24, 2014"}, {"Title": "Excelent", "Author": "Alejandro", "ReviewID": "R2M4HNUTS9URWD", "Overall": "5.0", "Content": "All of it is great!! ...simply the best camera tha I had buy in my life... So, if you are looking for a camera, this is it!", "Date": "January 16, 2014"}, {"Title": "Nice camera but don't expect it to replace your dslr.", "Author": "yakapo", "ReviewID": "R1I3RFX8FCLLBP", "Overall": "4.0", "Content": "3.5 stars.  I'm not a pro.  I currently have a canon t4i.  My most used lens on the canon is the sigma 30mm 1.4.Perhaps my expectations were too high for this little camera.  I bought it because it was the smallest interchangeable lens, crop sensor camera for the money.ConsThe zoom lens is much to slow when you aren't shooting at 16mm.  I'm going to sell the zoom and buy the sigma 30mm 2.8.  If that doesn't work out I'll sell it and get the Sony 50mm 1.8.  The flash doesn't really light up the subject evenly.  Once again, I'm comparing this to an external speedlite flash on my dslr.  Maybe I can make a DIY flash diffuser or something.I'm probably going to keep this camera for a while and eventuslly replace it with either the nex6 or perhaps a different camera with a fast fixed lens.  The nex6 has much better controls and an amazing viewfinder.ProsIt's tiny.  If you used a pancake lens, this would easily be a pocketable camera.  Too bad they don't make a 40mm pancake for it.  Expect phenomenal results when shooting in well lit areas or outdoors.  Flip out screen is very useful for shooting my 1 year old daughter.", "Date": "July 21, 2013"}, {"Title": "Great improvement from previous model", "Author": "C. Prasojo", "ReviewID": "R3IIEC4SIB9Q7G", "Overall": "5.0", "Content": "I owned the first generation of NEX-3 and this model is a great improvement from the previous one. Some features I like in this model:+ enhanced photo quality+ compact power zoom lens allow single-hand operation ranging from wide angle to zoom (16-50mm)+ auto crop (or object framing they call it) and many other auto function works instantly while keeping a copy of the original shot.+ enhanced auto mode makes intelligent auto-shots even better+ faster processor and cache memory allow faster processing of HDR, pano, and anti-blur shots where the camera processes a few high-res pic into a single picture.+ built-in flash for those moment when you need fill flash+ softer, less intrusive shutter sound+ built-in charging, you no longer need separate battery charger. typical USB connector as your smartphone is all that's needed+ full HD movie recording+ 180-degree display panel flip for self-shot with auto 3sec timer- display no longer tilt down, hence i can no longer do high-angle shots for concert, crowds, or anything above my sight levelOverall this camera has so much more to offer at a fraction of the cost of previous camera. Beautiful DSLR photo taking is now affordable and as easy as phone-camera. Fantastic!", "Date": "June 20, 2013"}, {"Title": "Truly amazing camera for the price.", "Author": "Colin Brown \"Colin Brown Microsoft MVP\"", "ReviewID": "R1NZCPZSCULPXV", "Overall": "5.0", "Content": "I'm going to try a new style of reviewing here.  Some people just want bullet points of the good and the bad, some people want a more indepth review and some might start with bullet points then if interested want more details. So lets see how this goes.This is my first mirrorless camera and to say that I'm impressed doesn't come close, although the camera is not perfect.Pros :Very large sensor (23.4mm)Superb picture quality (lower end DSLR quality)Sturdy well made cameraCan take Alpha type lenses as well as E types (so lots to choose from)Full range of settingsVery fast AutofocusTiltable LCD for self portraitsExcellent lens kit (16-50mm)Choice of AVCDH or MP4 for video recordingCan shoot 3D Panoramas (although not very useful at the moment until 3D becomes more mainstream)Tiltable flash (needed if you buy a secondary 210mm lens and good for soft lighting)PriceCons :LCD Screen is very glossy is hard to see in bright daylightAlpha type lens mount is quite expensiveWith only one thumbwheel you have to use the menus for your settings. Could really do with another thumbwheel selector.Microphones are on top of the camera which picks up a lot of ambient noise when recording video.This camera takes first rate DSLR quality pictures (thanks mainly to the full size sensor). Shooting can be as simple or as manual as you want it to be with an excellent built in intelligent auto mode (why isn't this the default setting?) for those that just want a point and shoot type experience. Although there are only a limited number of E mount lenses available, with an adapter you can also have Alpha mount lenses which gives you a far greater choice.Summary conclusion : Although not perfect this is a superb camera and when you consider the price, its really a no-brainer. Go get it.For those of you that are intrigued and want some more in-depth information please read on.I was most surprised by the size of the body on this camera. It's just a tad larger than a normal point and shoot compact camera. The camera feels sturdy and well made overall although you do have to watch the bottom battery cover hinge as this seems like it could easily break off if you leave it open and put the camera down.  When you attach a tripod mount to the bottom of the camera, this partly covers the battery door making it a pain to change batteries, luckilly however the second door which holds your connectors and the memory card is located on the side of the camera so you can easily plug the camera into the charger or any USB device that can supply power and run it off the mains, negating the need to change batteries.  This is also very handy for changing memory cards once they get full whilst your camera is on a tripod.The NEX-3NL is a 16.1 Megapixel camera which comes in at the lower end of todays cameras (the NEX 7 for example does 24 megapixel images), however it more than makes up for this with its full size Exmor sensor.  This is basically the same sensor size you will find on DSLR cameras. For those of you used to compact cameras, a compact sensor usually comes in at around 7mm.  The sensor on the NEX-3NL comes in at 23.4mm.  This makes all the difference in picture quality, giving you excellent detailed pictures.  As an example, I have uploaded a side by side image showing the difference in quality between a modern 20 megapixel compact and the NEX-3NL. Even though modern compacts may have higher megapixel count, the size of the sensor is really what matters.With regards to images, you have a choice of how you want to store them, RAW, RAW + JPG, JPG fine or JPG standard.  The RAW images weigh in at around 17Mb each so if you are shooting RAW or RAW + JPG then make sure you have a fairly sizeable memory card and also speedy. I wouldn't recommend anything less than a class 10 SD card.  The NEX-3NL can take both SD cards or Sonys own Memory Stick cards.Video wise the NEX-3NL allows you the choice of AVCHD or MP4 format. AVCHD giving you higher quality full HD at 1920x1080 at 60 frames per second compared with MP4 at 1440x1080 at 30 frames per second.  This is a nice feature allowing you choose MP4 which is available on most systems for playback and is compatible with most video websites nowadays without needing to reformat.  The microphones on the NEX-3NL however leave something to be desired.  These are mounted on the top of the camera and pick up quite a bit of ambient noise (also your own breathing if you are close enough to the camera whilst recording).  It can be great for making documentary type videos but in most cases having a microphone on the front of the camera would be much preferred.  Videoquality is excellent but sound quality leaves quite a bit to be desired. A mic input port would be a very welcome addition to this camera.The back of the NEX-3NL is fairly barren with only one thumbwheel selector, two buttons and the LCD screen.  The thumbwheel selector has defaults of ISO settings, Multi-shot/self timer, Display change and EV settings. All other functions you need to go through the onscreen menu system.  This camera really shouts out for a second thumbwheel selector however in order to get one you need to upgrade to the NEX 5 model.  The LCD screen is a 3 inch 461,000 pixel affair which is sharp however is only about half the resolution of most 3 inch LCDs nowadays.  The LCD screen tilts up to 180 degrees allowing you to take self portraits and is also useful for tilting 90 degrees so that you can take low shots easily.  The LCD however is one of my major complaints about this camera. It's very glossy and extremely hard to see when in bright sunlight leaving you sometimes to just point and shoot and hope that you've got your shot. There is a menu item that you can choose to give you a brighter screen which does alleviate the problem a little, but not by much. Giving that most of the settings that you want to adjust are only available through the menu system on, the LCD is also screaming out to be a touch screen which it is not. I'm not sure why it isn't as Sony has touch screen LCDs on a lot of its other products (probably a cost decision).The menu system fairly intuitive and easy to use. Once you get used to it you can fairly quickly change the camera settings that you wish although having a secondary programmable thumbwheel selector would greatly reduce the need to have to resort to the cameras menu system and make things much easier.  Something that does get a little annoying after a while is when you select a menu item, if you wait perhaps a second (its not very long) then a description bubble will appear giving you help on what that function actually does.  This can get annoying and in the way as it obscures the menu item making you click the thumbwheel to close the popup help before being able to see the menus again. If there is a way to hide these annoying popups then I haven't found it yet, but that's not to say it's not there somewhere.Sony's NEX cameras take E mount lenses natively.  Currently there are only a few lenses to choose from (the 55-210mm being the best and most cost effective presently) but you can get an alpha mount adapter which will allow you to use Alpha mount lenses from Sony, Minolta and Konica, giving you a far greater choice (there are some restrictions like you can't use power zoom alpha lenses).  Unfortunately the alpha mount adapter is fairly expensive and when combined with a lens is going to hurt your wallet a fair bit.  Note that this new NL version of the NEX 3 comes with a 16-50mm lens as opposed to the older NEX-3F which came with a The NEX-3NL allows you anywhere from fully automatic (two modes with intelligent/superior auto being the best although for some strange reason not the default) to fully manual allowing you to change any of the settings you wish.  ISO range on auto goes from 200-3200 although on manual you can set it from 100-16000.  The higher the ISO setting, the lower the quality of images with the images getting quite noisy at the full 16000 setting, although you are fairly hard pressed to notice the difference in quality at 3200 or below.The 15 point auto focus system is extremely fast allowing you to take pictures almost intantly when you press the shutter release, and if desired you can choose burst mode which will take 4 pictures in a second.  The Autofocus tracking mechanism works very well allowing the camera to maintain a focused lock on your target even when the subject moves.The battery is fairly beefy and takes quite a while to charge (roughly 3 hours from empty) and according to the specs allows for 480 pictures but in practice I've been getting far higher numbers, averaging around 700 pictures per battery charge which should last you for most of a day, although it is worth getting a spare (which are fairly cheap, around $20 for the STK).Image quality is a wonder to behold and I really can't fault it. Images do get noisy at high ISO settings but this is only to be expected. The built in pop-up flash works well and is adjustable so that you can have soft lighting if required.  This is also fairly necessary if you have the 55-210mm zoom.  I found that flash wasn't extended high enough for the length of the zoom and the bottom of the pictures would shadow somewhat (not badly however). The lack of a mount however denies you the ability to add a better external flash if you so wanted.Overall this is an outstanding little camera from Sony and one that I would very highly recommend to anyone except perhaps the true professional photographer.  For the price (the 16-50mm lens itself is worth $300) I can't think of anything that would beat it.Go buy it now.Addendum:  I have been using this camera now for a couple of months and I still think this is an excellent camera for the money. Picture quality is superb.  There are however a few additional things I thought I should mention.  Macro mode works well (I have uploaded a sample to the consumer gallery) however sometimes the camera does have a bit of a problem with autofocus in this mode and you do need to switch over to full manual focus or DMF mode in order to get the best sharp images. Also, why is the Macro mode buried in the Scene list? This should really be part of the main thumb control on the back of the camera for easy and quick selection.You can just use the superior Auto mode for most shots, this works extremely well however if you want to take charge of things or play about with the settings, having to constantly go through a bunch of menus gets tiring after a while.  The NEX 5 or NEX 7 solves this problem and perhaps that is Sony's intent, if you want things a bit easier/quicker then upgrade but this camera is screaming for at least a mode wheel/selector on the main body rather than having to go through menus.  I mentioned this in my initial review but thought it was worth repeating after using the camera for a longer period.The last point is that there are very few native (E mount) lenses that take advantage of the all the features of the NEX. You can buy a mount and use Canon, A mount, Nikon etc. lenses but in doing so you lose some of the features, particularly auto focus on most.", "Date": "April 23, 2013"}, {"Title": "Nex-3n can't recognize the 16-50 kit lens just after 3 weeks!", "Author": "Ming-Cheng Liu", "ReviewID": "R14IFTA0VMOBAV", "Overall": "1.0", "Content": "My NEX-3n worked for 3 weeks then stop working with a \"Can't recognize lens. Attach lens\" error.  Twisted the lens off and on 3 times and no joy, still refuse to work.  Search Internet and found others having the same issue with their NEX-3, 5, or even 6!.  Some sent their lenses back to SONY and got a \"you bumped the lens No Warranty\" response.  This is clearly a quality or design issue on SONY's part because I baby it just like my DSLRs!  NO,  I will NOT recommend any NEX camera based on this issue that I and others have.", "Date": "September 14, 2013"}, {"Title": "Impressive", "Author": "alex", "ReviewID": "RPSX5KVSC8WHC", "Overall": "5.0", "Content": "For me everything I currently wanted in a camera was in the Sony NEX3.-great picture quality-many custom options for pictures-good weight not too light but heavy enough carrying for long periods of time wont matter-built in flash other Compact Cameras dont have flash built in-", "Date": "June 12, 2013"}, {"Title": "Great", "Author": "SJU", "ReviewID": "R1XE3OBHEEFOR2", "Overall": "5.0", "Content": "I received it as a Mother's day gift in May,2013, love it, the pictures I have taken so far have received rave comments. I intend to take photography classes, hence will know a bit more than my basic photography.", "Date": "June 7, 2013"}, {"Title": "Exceptional everyday camera for the pro-sumer", "Author": "KindlePad", "ReviewID": "RICK4S7COICDE", "Overall": "5.0", "Content": "I let my friend who is a 20+ year pro photog run this camera thru it's paces on a recent day trip. He comments were that it was one of the best point & shoot camera's he had ever used. The combination of auto and manual settings provide the perfect balance of tools for those times you need to just point and shoot versus experiment with different settings. The quality of the camera is very solid and the size is small enough it could fit in a jacket pocket (a big pocket...). I like this about the camera. The lens is very interesting, it zooms from a 16mm to a 50mm - so I wouldn't call this a real zoom lens like many people are thinking. Basically it zooms between a wide angle and a fairly straight forward angle (50mm). For example your average iphone camera is about 50mm - so that gives you an idea of its range. Photo quality is excellent, even in low light and video quality is just outstanding. The steady shot feature work to stabilize both the stills & the video.I can't say enough great things about this camera...", "Date": "April 25, 2013"}, {"Title": "Charging cord will not come out of the camera", "Author": "Merlin \"Inspired\"", "ReviewID": "R3FVIL8I1C5ZU0", "Overall": "2.0", "Content": "I purchased this camera in January 2014.  I just now opened the box, April 2014 in order to charge the camera, and use it.  The charging cord was a little difficult to push into the camera, but it charged correctly.  After charging, however, I cannot remove the cord from the camera.  It is too late to return the camera to Amazon for a refund or exchange.  (exchange policy expired in February).  Do not know what to do about it.  Even if I try to force the cord out, I cannot continue to do it without damaging the cord or camera.", "Date": "April 9, 2014"}, {"Title": "Perfect", "Author": "Zhichao  Lou", "ReviewID": "R2ZY8MBHK5Z7AC", "Overall": "5.0", "Content": "it's pretty good. I like it very much. Buy it and you may also like it. Good friend of me!", "Date": "March 18, 2014"}, {"Title": "Charger doesnt work", "Author": "FalishaB5", "ReviewID": "R2GW7I5UUFQBTO", "Overall": "3.0", "Content": "In order to use my new camera I had to use my android tablet charger! I'm glad most technology is becoming universal in that area  now so I had that to compare to make sure it was the charger and not the camera. Seriously, that is the cheapest thing I have seen. If you're shelling out $300+ for a camera one would expect better quality.", "Date": "March 8, 2014"}, {"Title": "really cheap , good qualiti", "Author": "Quan L. Tran \"tranquan\"", "ReviewID": "R3K4HJ6EEW2DAJ", "Overall": "5.0", "Content": "its so cheap for pro camera, and very light , it can feet my pocket , i dont need to bring heavy staff like other pro camer a. i happy with it", "Date": "February 16, 2014"}, {"Title": "great camera", "Author": "Shane E.", "ReviewID": "R2SZ9LVM36W1NZ", "Overall": "5.0", "Content": "Meets all of my expectations and more. I would recommend this camera to anyone who wants an economical DSLR camera.", "Date": "October 7, 2013"}, {"Title": "A very good camera", "Author": "Y ILIIN", "ReviewID": "R2JQHL4PRFK1A0", "Overall": "4.0", "Content": "I did not rate this camera 5 stars because it does not have a touch screen and there is no plug for an external microphone. Otherwise it is a very good camera indeed. I enjoy it very much. It has an in-built flash light (the more expensive models do not have btw).", "Date": "August 17, 2013"}, {"Title": "Great companion to my full frame Sony NEX-VG900", "Author": "Joseph Ogiba \"jogiba21\"", "ReviewID": "R2ULRHRPNB2ZBK", "Overall": "5.0", "Content": "I wanted the smallest NEX camera to use as a companion to my Sony NEX-VG900 since I already have a myriad of lenses to work with the E mount. I ordered the new PK-NEX Lens Turbo adapter that is a focal reducer that converts my fast F1.4 full frame lenses that I use with my VG900 like my 24mm,50mm and 85mm into F1.0 eqiv APS-C lenses to use with the NEX-3N and VG900 in APS-C mode.  The NEX-3N is also the first NEX interchangeable lens camera from Sony that offers support for new \"TRILUMINOS Color\" that is on their new 4K UHDTVs and the only one with zoom control for the new power zoom OSS lenses like the 16-50. The 55-210mm is also a great companion to the 16-50 and is a little sharper and faster than the much larger 18-200 in the 55-200 range since the 18-200mm is F5.6 @ 50mm vs F4.5 @55mm for the 55-210mm.", "Date": "May 23, 2013"}, {"Title": "Hard to find better photo quality at this price, but some frustrating exclusions", "Author": "Mary Jo Sminkey \"15 years of Amazon Reviews!\"", "ReviewID": "R1304FDV7V85UV", "Overall": "4.0", "Content": "This is Sony's entry-level NEX camera, clearly designed for users looking to move up from compact cameras. I've had a Sony DSC-HX5V and been pretty satisfied with the quality of the shots it gives me when I don't want to lug around my DSLR, and not long ago I tried one of the Panasonic Lumix micro four-thirds cameras but was disappointed with its performance especially indoors so ended up selling it. So I was very interested to try this camera out after being provided with one from the Amazon Vine review program.After using it for several days, I have to say I am really pretty impressed with the results! The indoor shots are quite good, with pretty decent noise reduction, certainly far better than I have ever gotten with the point-and-shoot Sony. I did find some considerable loss of detail as it started to get up to ISO 3200 and above, but the pictures were still very usable for online sharing at least. There's a wide range of options for getting good shots, from the scene mode for handheld low light that shoots several photos in succession, to a popup flash that you can tilt back to get a bounce effect. Since you can't attach an external flash, this was a feature I was particular happy to find on it. Outdoors of course the image quality is quite good. It's not quite on par with my Canon DSLR, particularly with a good lens attached, but there's no doubt this is going to be replacing my P&S; camera permanently for the improved shots it gives.The camera has a decent array of modes and scene settings, while I haven't tried them all, I was very happy to find the panorama sweep mode that my P&S; Sony has is on this camera as well. A setting for sunsets is also appreciated, I've had very good results using that option. When needed, you can still take control of all the typical settings you would expect: white balance, ISO, shutter speed, aperture, etc.The power zoom lens is the big feature of this camera, and makes it far more compact than earlier models. It's particularly nice for video taping, giving you a nice smooth zoom action when needed. The power zoom is both on the lens itself as well as a toggle on the power button that is obviously intended to make the jump from a point-and-shoot much easier. Just keep in mind that you won't be able to use it with most other NEX lenses at this point.So now for the negatives. The first one I noticed when I opened the box and went to charge it was the lack of a dedicated charger for the battery. For some reason Sony touts this as a plus but it's just a way to save money, and sell you a battery charger because you simply should not have a camera like this without an extra battery or two charged and ready to go. And who wants to have to plug in their camera to charge extra batteries?? This might make sense if the camera used rechargeable AA batteries, but for a custom battery it's really annoying that it's not included. Even my P&S; Sony came with a battery charger!Next issue has to be the lack of touch screen and the frustrating menu system. First, the issue here is the scarcity of buttons that forces you to do so much through the menu system. Again, I've never seen a camera without a dial for the mode, here you have to go into the menus even for that. And the menus themselves are often confusing and long, and takes a lot of time sometimes to find what you are looking for. The setup section of the menu in particular scrolls on and on and on. For a camera clearly meant mainly for novices, Sony really needs to work on this UI. I really found myself frustrated with this in particular when I was outside in sun and couldn't read the LCD enough to find the setting to increase the brightness. I had to find some shade to be able to change the setting. The LCD is not the sharpest out there, and it only flips up vertically, useful for self portraits but not giving you tilt options for other shooting positions.When it comes to sports or other activities that require fast focus and shutter speed, I had a bit better results than I did with the Panasonic Lumix that I had previously, but still falls short of the results I can get with my Canon Rebel, it's really hard to beat a DSLR when it comes to speed, but this does do better than a normal compact camera does, particularly if the action is something you can pan with. Fast action sports however were a bit more of a hit or miss, it's definitely still not fast enough to get accurate results a lot of the time. Startup time is about 2 seconds for the power zoom to extend and the camera to be ready to take a shot which is decent for this type of camera.It's important to note that not only does this camera not include a hot shoe for external flash, but it does not have the accessory port other NEX models do, which allows for the use of the viewfinder as well as the stereo microphone add-on. You'll definitely want to keep that in mind if using this camera for video is something you are particularly interested in. It shoots excellent video but the built in mic holes are on top of the camera, so they work well for picking up narration, not so well for external sound. On the plus side, the zoom lens is quiet and does not cause too much noise on recordings.Those are the high and low points for me with this camera. There's little improvements from earlier versions, like the card slots being on the side of the camera, rather than on the bottom and blocked when using a tripod. There's no GPS on the camera for geo-tagging, and no Wifi for uploading to social media sites (something that I would really like to see in a camera meant for the average consumer).Overall, if you can afford it, I'd have to recommend looking at some of the other more advanced NEX models with a few more features. But for its price, it's hard to fault this camera too much for the value that you get. Sure, it could use a mode dial and less reliance on menus to handle everything, but it's still a really nice camera for the price. Ultimately it's about the quality of the photos that I can get and when compared to its competition in this price range, I have to still give this a solid 4 out of 5.", "Date": "April 25, 2013"}, {"Title": "Exceeds expectations, has become my go-to camera", "Author": "OlyNomad", "ReviewID": "R2VC55LL6FBZI4", "Overall": "5.0", "Content": "This Sony NEX-3NL has become my go-to camera over the last month.  It is the one I find myself reaching for when I need a reliable shot.  It is rare to find a camera that I'm this pleased with and that has so many features that I rely on all in one camera.+ Excellent results in all lighting-impressive even in low lighting+ Image quality is impressive+ Compact Size and good weight+ Fantastic Auto modes - Option of Intelligent Auto, Program Auto or Superior Auto. The Superior Auto mode is a large part of what bumps this camera up to 5-star performance.+ Easy zoom+ Quality choices - Standard, Fine, Raw or Raw & JPEG+ Image Size - L 16M, M 8.4M, S 4.0M+ On-screen tips/user guide, just press the question mark and it will explain a feature for you or give you tips and lessons on how to get better results.+ Very simple to enter and exit movie mode with the thumb button feature on the back right+ Sweep Panorama mode+ Scene Selection mode - Macro, Landscape, Portrait, Anti-motion Blur, Hand-held Twilight, Night scene, Night Portrait, Sunset, Sports Action+ High-quality, full-color display+ Simple to use flash+ Comes with a full manual- Lack of viewfinder. Personally isn't a problem for me, but I can see where this would matter to some users.- Short charging cord and in-camera charging.Overall, this camera has exceeded my expectations and I would highly recommend it for both advanced users and those just transitioning beyond point and shoot cameras.", "Date": "May 14, 2013"}, {"Title": "Don't Waste Your Money", "Author": "Tasha Francellno", "ReviewID": "R3GPT23D4E13O4", "Overall": "1.0", "Content": "I purchased this camera a month ago. It suddenly stopped working stating a \"lens compatibility error\". I contacted Sony and receive the generic response - to send it in and it will be replaced or repaired under the 1 year warranty. GOOGLE THIS ISSUE.  Almost every E-Mount camera made by Sony is experiencing this issue. Many people say they sent it to Sony and were told it was bumped and they they need to pay the cost of repair or replacement of a new lens.I had an Olympus Pen and never had any issues. I dropped it, bumped it, etc.  I would suggest you purchase one of those instead.  I'm pissed because I wasted $400 + and could have gotten any other camera! This camera model and others is defective and Sony won't take responsibility.", "Date": "April 8, 2014"}, {"Title": "Not for quick and perfect point and shoot shots everytime.", "Author": "OldPhotoGuy", "ReviewID": "R2N920T4DDKSZN", "Overall": "3.0", "Content": "This Sony was one of the high end point and shoot cameras I wanted to replace my DSLR. Although this is a beautifully made camera, it's too much camera for that purpose and still doesn't deliver equivalent pics to a DSLR in my opnion. The camera I ended up with to do this job in a pocket size format was the Canon S110. Beautiful pics almost every time in all situations set on automatic, even when viewed on my 50 inch LED flat screen TV. If camera size is not an issue, for the best pics on automatic, buy yourself a Canon T3 or Nikon D3100, Both are outstanding cameras and can current be purchased for under $400.", "Date": "February 14, 2014"}, {"Title": "Great if you can deal with the awkward lens topology", "Author": "T. F", "ReviewID": "R3OLZCT58P8H9K", "Overall": "3.0", "Content": "Sony surely went through painstaking effort to make the camera case as thin as possible, but then they have this massive lens housing protrusion (more than an inch) coming off the front of the camera. You really can't fit this in your pants/shorts pocket. Sure a jacket pocket will do, but what do you do in the spring/summer?Also, the lens is clearly oversized for this thing - if you look at the foreoptic of the kit lens, it is only about half of the lens housing width. They had to make the lens width so high in case they need to accomodate some f1.4 50mm or something like that, but the target audience doesn't particularly want this feature. Just seems like they could have made this a little smarter.The flash is super dinky and feels as if it would break if you accidentally lightly brushed it against something.Still giving it 4 stars as the camera performs very well. It's a bit overpriced. The kit lens really is the limiting factor in image quality for it - if you were to get this, definitely want to budget for a prime. but then, if you knew enough about digicams to know what a prime lens means, you probably wouldn't get this camera anyway. puzzling market segment. i eventually returned it...", "Date": "March 10, 2014"}, {"Title": "Get this toy for video only, otherwise get Olympus E-PM2", "Author": "uzevla", "ReviewID": "R2H05A34CTI9GL", "Overall": "2.0", "Content": "Certainly, this is not a two star camera but I am considering the competition too.This is simply a toy comparing to e.g. E-PM2 which is a way more serious camera with more capabilities and usability including much better kit lens.Heck, the flash on this thing is at least 3x weaker and cannot even light up a small room at shutter speed ~1/50 and ISO100 at its maximum output. Kids running arround at some party? This flash won't get them without ISO800.Funny things is that the image doesn't fill the LCD even in 16:9 mode. It's actually smaller than in 3:2 mode. That pretty much tells you how \"serious\" the developers of this camera were.As as 2nd camera, it will do because of the excellent video. Olympus fails there. But having this as your first camera and skipping buying a way better product for the same money is just wrong. You'll get a good sensor (not much better than the latest from olympus) but just nothing is there to support that sensor.", "Date": "March 1, 2014"}, {"Title": "no memory card", "Author": "Julian David Rojas", "ReviewID": "R2XXT5BVOALDVZ", "Overall": "1.0", "Content": "I am really upset, Because the memory of the cámara did not arrive, in the specifications appeared very clear that came with the cámara, i had to spend more money to buy it. really really upset.", "Date": "January 13, 2014"}], "ProductInfo": {"Price": "Unavailable", "Features": "16.1 MP Exmor APS-C sensor for great images\nWorld's smallest and lightest interchangeable lens camera10\nNew SELP1650 lens with motor zoom lever and body control\nCreate easy self-portraits with 180° tilting LCD screen\nFull HD movie shooting 60i/24p", "Name": "Sony NEX-3NL/W Compact Interchangeable Lens Digital Camera Kit (White)", "ImgURL": "http://ecx.images-amazon.com/images/I/41%2BBLnGcg2L._SX300_.jpg", "ProductID": "B00BF9MUAS"}}