{"Reviews": [{"Title": "Did not meet my needs", "Author": "Donald L Burggraf", "ReviewID": "RYEJ3OEAYQ2AU", "Overall": "2.0", "Content": "The camera advertises a \"burst\" feature that takes continuous pictures at 2, 5, or 10 frames per second. They do not tell you that it only takes three pictures before the rate slows or stops altogether. I keep my present camera on a continuous shooting mode most of the time, so this camera was not for me.", "Date": "July 7, 2013"}, {"Title": "Great Camera for the Average Person...Family Photos & Traveling", "Author": "Pam A", "ReviewID": "R2CLRRZSSBFWY5", "Overall": "5.0", "Content": "I could look up all the technical items on this camera that are great, but I'll stick to the average person's use of it.  There is now an updated version.  I have taken this camera on two cruises (Panama Canal and the Baltic Sea) which combined is five weeks of travel.  I have also used it for family and personal photos.  Attributes:1. The zoom is perfect for me- 24X.  I have had other cameras with a zoom, but they weren't as good (10X) and the ones I saw on other cameras for the same approximate price may give you more distance, but the reviews said they gave blurred photos.2. The viewfinder works well.  I wouldn't have a camera without one.  Just try and take a photo on a sunny day without a viewfinder.3. Takes great photos in dim light and it does have the flash.4. Light weight.  My friends who traveled with us had one of those really expensive cameras that they dragged around all the time.  It was very heavy and they also carried around the extra lenses which were kept in a backpack.  We walked a lot on many days. Their photos were nice, but it wasn't my idea of enjoyable traveling.  Also, you can have a smaller camera, but it wouldn't have all the attributes.  This camera is the right size for traveling.  You can't throw it in your purse, but I also put it in my backpack when I wasn't using it.  When I thought I may use it, I had it in a hanging camera case around my neck. One more thing...I kept seeing people with the expensive, large cameras needing a small camera also.5. Easy to charge.  Piece of cake.  I read about other cameras that had many great attributes, but the people had to buy an additional battery so in case they took many photos so please check out about battery life.  The additional battery was expensive.  This camera was perfect for me.  I can't remember the amount of photos you can get, but it is far more than I would ever need.6. Video recording.  I haven't used it yet, but it looks like fun and supposed to be really pretty good.7.  Automatic settings which were great.  I will eventually learn some of the other manual settings.8. High speed burst shooting was fantastic.  I love it when you are in those situations where you want to capture something perfectly that is changing quickly and you need the perfect picture at the precise moment.  It was great with young grandchildren photos also.Make sure that you get a good size flash memory card.  I don't want to have to change them out on a trip.  I know what I'll need and I haven't come close to needing another one.  Why have something else to worry about when they aren't that expensive?  The only thing you need to buy is the larger flash drive and camera case. It comes with a lens cap. I got the  Case Logic DCB-304 Compact System/Hybrid Camera Case which holds everything for your camera. If you choose this camera, the upgraded version or another camera, take the time to read up on them on this site and on Consumer Reports on line which was very helpful in comparing cameras.", "Date": "November 5, 2013"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B00BH5UY3A"}}