{"Reviews": [{"Title": "A response to the previous review.....", "Author": "Mark Curtis \"ccd\"", "ReviewID": "R1AT03POREQEJR", "Overall": "5.0", "Content": "I would have posted this in the comments section of the first review, but wanted to counteract the poor rating. I feel the original review is misleading to a potential buyer and skews the attributes of this camera.First of all, this is a superior DSLR regardless of the bundled lens. The K-30 is a K-r on steroids, and fits nicely between it (the K-r) and the K-5 (or K-511). It maintains the once exclusive dual power option of the K-r and adds weather sealing (like the K-5), more megapixels (for improved resolution forgiveness when cropping), full 1080 HD video, a brighter and bigger pentaprism viewfinder (vs. pentamirror for the K-r), and a much better sensor in low light. Just the weather sealed body alone makes this a great value (Pentax is one of the few camera companies that offers this rugged feature).The 18-55mm kit lens is just that. It's a low price lens that goes with the camera body.....and you pay in accordance as a bundle. You can purchase a two lens kit that features the 18-55 along with either the 50-200 (an underrated lens) or the far reaching 55-300....or you can opt for the 18-135 weather sealed kit (so they DO have that option for combined weather sealing). I believe there's even an option for the f1.8 50mm prime. Each is proportionately more expensive, as would be expected for better quality. It's completely ironic the 18-55 is one of the best \"cheap\" kit lenses out there. Comparing similar kits on DSLR's, you will not find a better built lens made by Canon or Nikon. It's a quite decent lens optically as well.....stopped down it is very sharp, esp. in the center.The point is the camera is great and functions well WITH the non weather sealed lens. If you want the WR version of the 18-55m, you can purchase it separately and is very reasonably priced (or get the 18-135). Then you can either sell your \"old\" 18-55 for more than what you ostensibly paid with the kit price OR save it as a backup lens (perhaps with another DSLR). The fact that Pentax did not offer the 18-55 WR as a kit option does not relegate the K-30 body to a ONE star rating. I don't even own the K-30, but I know from exhaustive research (both professional and anecdotal)....as well as my several years as a Pentax *istDL and K-r owner.....that it's an outstanding camera which deserves an easy 5 star rating. It is arguably the best value for any DSLR on the market. But don't take my word for it. Check other reviews (on a multitude of sites) for yourself.", "Date": "April 16, 2013"}, {"Title": "Price point king", "Author": "Michael Lee", "ReviewID": "R3F899NYAPE4X2", "Overall": "5.0", "Content": "I wanted a good SLR with real camera functions and saw a large void in the Canon line, which I had owned in 35mm.  This Pentax really wowed me in the areas I value: actually taking pictures without shutter lag, start-up time, and the option for manual control of focus and shutter. The body is solid and weather resistant which is key to me as I use this type of camera camping...a feature that isn't available from the competition until well north of $1000.  If you're looking for something better than your phone, but not looking to drop some serious cash, this is a great SLR.  Menus are logical and thorough, paper instructions are included (no downloading PDFs).  Lenses are readily available and offings are comparable to the competition (the included lens is, well, everything you'd expect from an included lens).  The red is pretty snappy if you're into that (it cost less than black when I purchased mine).Cons would be:  this is maybe not the best to hand off to a stranger.  I use the view finder, not the screen, and to someone unfamiliar with photography, it appears the LCD displaying an intimidating amount of information in Greek. The on off toggle feels backwards, and the flash release button is ironically hard to find in the dark.None of the cons would stop me from buying this exact same camera if it was released in a better resolution down the road.", "Date": "August 14, 2013"}, {"Title": "shocked and awed!!", "Author": "CC", "ReviewID": "R1TMQ6V1IFVJD2", "Overall": "5.0", "Content": "HNever Did I Expect This Quality Of Photos It's Simply flawess. Please BeCareful Reading Reviews. I Almost Didn't Buy This Camera Because Of A One Star Review, Knocking The Lack Of Water Proofing InThe lens. They Obviously Didn't Have Any experience Shooting With IT. I Could Write About Specifics All DAy,But The Bottom Line, It'sAGreatCameraThatHaS A Prefect Picture.", "Date": "July 12, 2013"}, {"Title": "Great camera with a terrible product description", "Author": "ET", "ReviewID": "R1JWXNC4RC53R0", "Overall": "4.0", "Content": "I haven't had many chances to use the camera but what I have been able to do with it so far I am very happy with.The only reason I'm giving it 4 stars it that the description states that the camera is weather sealed. Its great and all but it doesn't matter if the lens sold with it isn't weather sealed.. If this would have been stated I would have been more than happy to spend the extra $50 for the sealed lens.", "Date": "April 7, 2014"}, {"Title": "An excellent replacement for my beloved K1000", "Author": "leo hake", "ReviewID": "R906Y1CGWSRN7", "Overall": "5.0", "Content": "It is a fine replacement for my far from worn out K1000. I enjoy the options I have as well as cut loose and shoot.", "Date": "August 29, 2013"}, {"Title": "Super Easy to Use and Fast!", "Author": "Guardsix", "ReviewID": "RGGI35JQSS3W4", "Overall": "5.0", "Content": "I was looking for a SLR camera that was fairly easy to use and fast when taking pictures.  I got this one recommended by a cousin that does professional photography and another friend that does magazine photos (fishing and wildlife stuff).  They told me that the price with the lens was an incredible price and that I should snap it up before they run out!  I did.I have taken hundreds of photos of our new house being build since Mar of 2013.  Everyone has come out crystal sharp and definitely in focus.  That was the problem with the little snap shot cameras.  I couldn't hold them steady and the didn't seem to focus properly.  This one does all that automatically.  It is very, very easy to use when just using the standard or normal settings.  I'm not a professional photog or anything near but I really like that fact that I can learn how to use all the features of this camera as I go.It's not the lightest camera in the world but certainly not the heaviest.  I bought a wrist/hand strap that keeps the camera glued to my hand with my fingers in place to snap a shot.  I can quickly bring the came up to eye-level get the shot framed and snap in no time.  Oh, I also bought the AA battery adapter.  That's a great backup to the regular battery.  Not all cameras have that kind of option.This is a great camera for anyone wanting to take sharp, in-focus pictures.  It does video too but I haven't tried that yet.", "Date": "August 19, 2013"}, {"Title": "Good Field Camera", "Author": "Jim Thornton", "ReviewID": "R3HN5K4DTKAHNL", "Overall": "4.0", "Content": "I have only had a few weeks and used it on one business field trip to North Dakota, but more field work coming up. Still learning all it's features; on auto some of the photos are coming out under exposed so I will have to find out how to make the appropriate adjustments. Downloading pictures is easy. Wish I had the GPS unit, but that is a couple $100 more.", "Date": "August 6, 2013"}, {"Title": "A very good camera at a very good price. Photographers of any level will most likely like this camera.", "Author": "Nature Man", "ReviewID": "RIE5DM3VVN47M", "Overall": "5.0", "Content": "The K-30 is a worthy upgrade from the K-r, not major but worthy. The K-r is a very good camera with a stronger camera body, but the K-30 makes several improvements. The 16 MP sensor does a very good job with resolution and overall photo quality. The K-30 is lighter than the K-r and the K-5 because of the plastic body which may be a concern, but the construction appears to be solid. Time will tell. Having two dials, one for shutter speed and the other for aperture, instead of one dial, having to switch back and forth on the K-r gives a more k-5 touch. The viewing screen is much sharper and easier to view what is on the screen in sunlight than both the K-r and the K-5 (I also own these cameras).  Weather sealing is a real plus for wet or dusty conditions. I really like the ergonomic shape of the camera with a deeper grip. With the new K-50 on the market, there are some very good deals going on right now.", "Date": "July 28, 2013"}, {"Title": "Pentax K-30", "Author": "Igor", "ReviewID": "R3K0R67O9QL4FY", "Overall": "5.0", "Content": "Good camera, fit well to my hands, works just perfect, all my K-M and K-A lenses and even Tamron 500mm and screw mount lenses are usable and working good.", "Date": "July 1, 2013"}, {"Title": "Everything as expected.", "Author": "John Cotton", "ReviewID": "RN7XG46U15ZAJ", "Overall": "5.0", "Content": "I paid just under $500 for this kit, which was almost $50 less than the competitors. I'm not too concerned about having the non weather resistant lens. Its \"weather resistant\", not proof so I plan on taking care of it as it were a regular camera and lens.I'm new to the world of digital photography so spec wise I can't say much about the camera but look at reviews on other sites or visit the pentax forums to decide if this is what you want. I am very happy with my purchase and am looking forward to learning how to get the best out of it.", "Date": "June 5, 2013"}, {"Title": "Camera is good, but the box was damage", "Author": "Yangbinzhou \"yangbin zhou\"", "ReviewID": "R3L61QPAW0WVTJ", "Overall": "4.0", "Content": "The camera is very good, and camera production date is December,2012. I contact Pentax's customer services and sure I get one year limited warranty.", "Date": "July 10, 2013"}, {"Title": "Lens is not Weather Sealed.", "Author": "Marc", "ReviewID": "R1NDKVB1KUXHE7", "Overall": "1.0", "Content": "The lens they are using is a DA L lens that is not weather sealed.  It even of cheaper build that the standard DA (no L) lens.  Thus if you use this kit as a weather resistant or weather sealed kit water will enter the camera and ruin it.  Why purchase a kit that defeats one of the main purposes of the camera, or buy a kit and then try to sell the lens and buy another?", "Date": "February 22, 2013"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B00BCNWEPS"}}