{"Reviews": [{"Title": "Great Little Camera", "Author": "John McQuitty", "ReviewID": "R2X002RI2ZF2H7", "Overall": "5.0", "Content": "I have had the Panasonic ZS30 about a week now.  It is my 5th TZ/ZS Panasonic camera I've owned, including the excellent ZS20.  However, the ZS30 is the best yet.  I'm not a beginner.  I've been making pictures since the 1960s or before with all kind of cameras, and I've sold a few pictures over the years too.  Currently I have the ZS30, the ZS20, a couple of \"enthusiast\" compact cameras, and a fairly nice and complete DSLR set up - one of several I've owned.  The DSLR gathers dust for the most part - too heavy with  a bunch of lenses and other photographic \"stuff.\"Getting right to the heart of things:  The ZS30 is a great little camera - takes great pictures in  good light and also in low light.  It also has a plethora of fun and useful features, and a great Leica lens.  You can shoot on full automatic or take control with  aperture, shutter, or full manual priority.  There are 14 or so \"art filters, plus about 16 \"scene\" modes.  For the younger generation there is WiFi, and NFC, and, of course there is GPS.  The camera is easy to carry, excellent build quality - and, did I mention, takes excellent pictures.  I highly recommend it.Some people may worry about the high pixel count (18 MP).  Don't!  The improvements in the sensor and the processor pretty much take care of that, and pictures are certainly as good as the ZS20, which I also have, and better than the other, older Panasonic super zooms that I have had.  It is not a DSLR, but the pictures - good light and low light are certainly very good for this type of camera up to about ISO 3200 (Yes, there is some noise, but pictures are certainly \"usable\" for what most people who buy this kind of camera will use them for.)  Generally speaking though, I'd use a top end ISO 1600 and below for normal, everyday use.  I usually have it set to ISO 200 - works fine.Everyone is worried about blurry pictures.  Left to its own devices the ZS30 does not give blurry pictures.  It is quite a capable little camera.  That's not to say you can't take blurry pictures with the ZS30.  You certainly can.  Here are some ideas to minimize blurry pictures with the ZS 30 or any other camera for that matter: Most important of all - Be sure the image stabilization is ALWAYS turned ON - unless you are on a tripod - then turn it off.  Then: 1.  Neither the ZS30 nor the subject should be moving when you take the shot - i.e. hold the camera still, and shoot when the subject is not moving - (some exceptions when using very high shutter speeds, the tracking focus mode, fireworks, moving water, and other \"creative\" stuff).  2. To hold the camera still, hold on to it like you own it and are proud of it, with BOTH hands, and not with just the thumb and forefinger only.  3. Keep your elbows tucked in to your sides.  4. Lean against a wall, a table, a chair, and/or look for something to rest the camera on.  5. Shoot with the reciprocal of the lens extension for a shutter speed, i.e. At full extension of 480 mm (in 35 mm terms) - (You can estimate it if not at full extension.), keep the shutter speed no lower than 1/500 second OR 1/125 second (2 stops) if the image stabilization feature is turned on.  If you have a REAL steady hand, maybe you can cheat down to 1/60 second.  (You can adjust the aperture, the ISO, and/or the lens extension to achieve these shutter speeds, but anything less will almost undoubtedly result in a blurry picture.)  6.  Wait for the camera to focus - when you hear the beep (if turned on) or when the focus area boundary turns green on the LCD.  It doesn't take long with the fast Panasonic focus speed, but I've seen some folks beat even a DSLR to focus.  7. Press the shutter button gently, don't \"stab\" at it.  8. Don't let the camera pick the focus point.  Do it yourself.  I mostly use the center point only - smallest one - unless using tracking focus mode. 9. Shoot on aperture priority and set the widest aperture available (ZS 30 will adjust it as you zoom.) or shoot in \"sports\" mode to assure the fastest shutter speed for the ISO set and the light available.  10.  Don't shoot ANYTHING with a shutter speed of less than 1/30 sec unless the camera is \"braced.\"  11. Walk closer to the subject if you can, and retract the lens to fill the frame at the new, shorter distance.  Long lenses, fully extended are much harder to hold still than \"shorter \" ones.  Note:  The 30X Sony HX50 may not be such a bargain at full extension unless braced or on a tripod - a 700 mm something lens, handheld - REALLY?! - and about that atmospheric haze...  Note:  You can easily have a 30X lens equivalent with th ZS30 - either by slightly lowering the number of pixels used (best way - all optical lens magnification) - or by using the \"extended\" optical lens mode at full resolution.  I like the first way - pictures seem sharper, and there is still plenty of resolution for high quality prints.  12. If all else fails, use a tripod (Heaven forbid!).Added November 22, 2013 - 13. Panasonic's \"light speed\" focusing is very fast and pretty much eliminates shutter lag.  It is a FAST camera.  Secondly - To eliminate blur from pictures of moving subjects - as in sports, if iA mode is not doing it for you, - shoot in \"Sports\" mode, and the camera will set the fastest shutter speed for the settings you already have on your camera (i.e. ISO, aperture for the zoom extension you are at, etc.)  If you still get blur, or if the exposure icons on the LCD are showing red, increase the ISO or shoot in \"Shutter priority\" mode and set a fast shutter speed - up to 1/2000 sec.  (Try 1/500 sec first.)  Again, you may have to increase the ISO to get a properly exposed picture (green exposure icons) when you increase the shutter speed.  Finally, in either case, set the focus mode to continuous/tracking, and shoot in burst mode. (Set these up before you go to sports or shutter priority)  (I mostly use 5 fps burst speed - allows for focus on each shot in the burst.)Added July 6, 2013 - One more little thing - (OK,OK. I forgot it!) 14. Shoot within the focusing distances of the AF setting you have set or you WILL have blurry pictures.  \"Standard\" AF mode at full lens extension is about 6 1/2 feet to infinity.  Closer than 6 1/2 feet and the picture WILL be blurry.  With AF mode set to \"Macro Tele\" you can focus from a little over 3 feet to infinity at full lens extension.  At \"Super Macro\" AF mode your focus distance is limited from about 2 inches to about 3 feet, ans it will NOT focus to infinity.  The macro modes are found at the \"down\" press of the rotary dial.  Hey!  it's easy, but if you are having trouble focusing, check that you are in the \"correct\" AF mode.Flash is another \"scary\" thing for many people.  First remember the flash is only \"good\" to about 10 feet, so \"be within range.\"  You cannot adjust the flash output on the ZS30, but the camera will do that for you if using \"fill\" flash mode (always on) or full auto, within certain parameters (Read the manual.)  The \"sync speed\" - about 1/200 sec - will \"freeze\" most \"portraits,\" but if the subject is moving, you may still get a blurry picture.  For best results, use \"slow sync\" or night portrait mode, just watch that the shutter speed doesn't get below what you can comfortably handhold, AND tell your subject not to move for one full second after the flash goes off.  You can use the flash in bright sunlight also - to reduce the dark shadows that are characteristic of photos taken in bright sunlight.  To get even better flash shots, use a diffuser - two or three layers of facial tissue held over the flash will do wonders - just make sure your fingers are not covering the flash.  Another hint:  Set the camera to \"manual\" mode, and set the correct exposure for the background.  Turn the flash on normal or \"always on\" i.e. \"fill\" flash mode.  In this case, NOT slow sync or you will overexpose the background).  Then take your picture.  The background will be nicely exposed, and most likely, so will your subject - if in range of the flash.  Use the diffuser trick, and things should be really good.Back to the ZS30.  The ZS20 and the ZS30 are fairly comparable, but the ZS30 has some significant improvements IMHO.  Better LCD - 920k dot resolution compared to 460k for the ZS20, and better touch screen capability.  18 MP compared to 14 MP for the ZS20 - Yes, there is more detail in the ZS30 picts.  Cancel playback mode and return to shooting mode with a touch of the shutter button - something Panasonics' have needed for years.  More movie choices.  Added number of \"art filters\" - These are kind of fun.  High Speed video shooting.  Easier access to panorama mode.  Better image stabilization - 3 way in stills, 5 way in video.  \"Starry Sky\" scene mode back. - good for shooting fireworks and other creative stuff.  The ZS30 can take a 13.5 MP still picture during video, compared to a 3.5 MP one with the ZS20.  Longer lasting battery.  In short, the ZS30 is just a more \"complete\" camera, although the ZS20 takes wonderful pictures also.Both the ZS20 and the ZS30 have Panasonic's \"light speed\" AF.  Solves a MAJOR problem with earlier compact cameras.  Both cameras have no purceptable shutter lag, and being able to adjust the size of the focus area, not just the focus points is a big plus.  Of course there is face detection/face recognition, and tracking focus mode, now with up to 5 frames per second WITH focus for each frame or up to 60 fps with initial focus and lower megapixels.  Both cameras have vastly improved white balance compared to earlier Panasonic cameras.  Both have in-camera editing - kind of hit and miss though, but fun.  There are other neat things - too many to mention.  Handheld night shot works wonders on both cameras as does HDR scene mode.  Build quality of both cameras is excellent.Yes, you CAN blur the background with a compact - set \"macro telephoto\" mode, largest aperature (smallest f/ number), extend the lens to maximun extension, move in as close as you can so that the camera still focuses, make sure the background is \"some distance\" behind the subject, etc. - or - shoot wide angle, lens fully retracted, f/3.3 (smallest numbered f/ stop - largest lens opening), set super macro mode, and move in to where the camera will just focus, background again \"some distance\" behind the subject, etc.For travel, easy carry, long lens, and good pictures, the ZS30 really can't be beat.  ZS30 has LOTS of travel features.Finally, the best camera, as always, is the one you have with you.  The Panasonic ZS30 is idealy suited for that, and it takes very good pictures on its own settings, and even better ones if the photographer is knowledgeable enough to adjust some of the settings to suit the situation and light. (Hint:  Read the manual.)  Beware of putting much stock in the review of anyone who simply blasts away in full auto mode (the camera picks the focus points in full auto, and it can't read your mind - YET - as to what you really want in focus.), and then condemns the camera.  What shutter speed was used?  If it was 1/60 second or less at full extension (480 mm equivalent) and no bracing, pictures probably will be blurry - with ANY camera, even a DSLR.The Panasonic ZS30 is compact enough to carry easily, has an incredably long, compact Leica lens, more than enough low light capability for most people - unless you are a pixel peeping nerd or a pro who has to make a living off of his/her talent as a photographer, and it has more neat features that most people will ever use.  Is it a DSLR?  NO.  Is it a darned good compact camera?  Yes.  Is it an excellent, full-featured, long lens travel camera?  Absolutely, yes!  Remember, taking \"good\" pictures is a duel effort between the camera and the photographer.  Don't always blame the camera.  Figure it out!  Read the manual.  Get the most out of your camera.  It has lots to \"give.\"  Relax, quit worrying, and enjoy your ZS 30.  Thus ends the \"War and Peace\" review.", "Date": "May 23, 2013"}, {"Title": "ZS30 review and comparison to ZS7", "Author": "Dave Sampieri \"DaveSam\"", "ReviewID": "RYBUVT12Z9323", "Overall": "5.0", "Content": "I received my ZS30 about three weeks ago and, with one exception, like it much more than my ZS7.I actually rate this at 4.5 stars, but gave it 5 because the camera deserves more than 4.Contrary to one of the other reviews, the ZS30 is smaller and lighter than the ZS7.  It is a tad taller, but thinner and not as wide (4.26 x 2.32 x 1.09 inch VS. 4.06 x 2.36 x 1.3″).  The thinness makes it easier to fit in your pocket.  It is also slightly lighter than the ZS7.  The rubberized grip is a great improvement too.The extra zoom is a real plus.  I have what's called an essential tremor so stabilization is key for me.  The ZS30 has 5 axis correction, which beats the ZS7.Full HD video is fabulous.  I go to concerts and soccer events (for my godson) and the full HD is much clearer than the ZS7.The LCD is much clearer with twice the dots (920 vs. 460).  The lens has been upgraded.  Higher burst mode.In Portrait mode and auto-flash the ZS30 more accurately reflects the correct colors.  I have hardwood floors that I use for color comparisons.  The ZS7 makes the color much too warm and deep while the ZS30 is almost dead on.Probably the best new features?  Wi-Fi and NFC.The Wi-Fi capability in the Panasonic app is great.  I have used Canon DSLR's for quite some time and loved being able to use my iPhone to take family-type pics without having to run to pose before the shot was taken!Both cameras are equally bad in low-light pictures.There are two categories in which the ZS7 wins.Stereo microphones (which I don't care about).Video aperture is better at adjusting when filming in varying light conditions.  When recording a soccer match where one end of the field is brightly lit and the other end is in shadows, the ZS30 has a hard time adjusting, where as the ZS7 is quick to change.Be wary of the instructions on the Panasonic web site for upgrading the ZS30 firmware.  If they include having to take 2 photos, the instructions and the file are the wrong ones.  Go to this link for the correct file and instructions: [...]Overall, the ZS30 is worth the cost of investing in a new point and shoot.  I've had the ZS7 for a while, so it's been dropped a few times, the LCD is a little scratched up and the focus ring can get sticky.  I'll give it to one of my nieces or nephews to play around with as their first camera.", "Date": "May 9, 2013"}, {"Title": "Impressive specs but a let down in performance", "Author": "D. L. Howe \"dave\"", "ReviewID": "R3U85EPL9NSHIE", "Overall": "2.0", "Content": "I bought the ZS30 in hopes it would replace/upgrade my aging and much loved ZS15.  Unfortunately it didn't meet my needs so after just two days I returned it to Amazon.  Short story – long; here is what I learned.  I am a very experienced photographer and for the past seven or eight years I have used Panasonic cameras exclusively.  For vacation and “serious” photography I love my GX1 (a micro four thirds replacement for my previous Panasonic DSLR).  For sporting events and video the Panasonic FZ200 just can't be beat.  For everything else there has always been a Panasonic Travel Zoom (ZS series here in the US).I carry my SZ15 during my daily horseback rides, on bicycle rides, aboard the boat and generally everywhere.  Since it is the camera I almost always have with me, I take most of my pictures using it.  Here is why I won't be able to replace it with the new model.  As the number of pixels increases so does the workload of the Image Stabilization system.  Additionally, as the zoom goes up need for stabilization increases.  In the ZS30 I found the combination of increased resolution and increased zoom has outpaced the technology for image stabilization – which means hand held shots will produce lots of blurry pictures.  For me, that would severely limit my ability to shoot from horseback.In addition, the large zoom range in such a small camera has necessitated a rapid reduction in the light gathering ability of the camera.  As the zoom is increased the f/number goes up rapidly(reduced light gathering ability) – making for longer shutter speeds.  Again, that means as you zoom the tendency will be for the pictures to get blurry.  I found the camera straining if I shot into a shadow – even on a bright day.What sealed the deal for me was the touch screen.  While that might be a useful feature on a studio camera it is insane on such a small camera.  Every time I lifted the camera for a shot the camera would beep beep in alarm because my thumb had wandered onto the screen.  Search as I might I was unable to turn off the touch screen.While I am taking the time to write this review I want to cover pixel count.  If you intend to print a photograph for an album or a magazine you need about 300 pixels per inch from the camera.  So a 12 megapixel camera (4000x3000 pixels) can print a photograph 12 inches by 10 inches at 300 dots per inch easily.  If you are going to enlarge the picture and hang it on the wall, as I frequently do; you will be looking at the picture from five or ten feet away.  In that case you only need 125 to 150 pixels per inch from the camera and you can still enlarge to 15 x 20 easily.My recommendation is to stick to no more than 12 megapixels and no more than 200mm equivalent zoom for your small camera.  As it happens – Panasonic (and their competition)  make a few small cameras that don't compromise their pictures with overlong zooms and too many pixels.  Usually these small and capable cameras are called enthusiast cameras.  I intend to give the Panasonic Lumix LF1 a try.", "Date": "August 8, 2013"}, {"Title": "Best in the series since ZS7", "Author": "ubat", "ReviewID": "R2ZESS6WKQVPZF", "Overall": "4.0", "Content": "I've owned several models in this family, and regretted updating the ZS7 to the ZS10 -- irreversible, because I gave the ZS7 to my mom! The ZS20's specs and reviews didn't make it worth the expense, so I waited (and meanwhile tried another compact, which I didn't like) for the next one. When the ZS30 came out, I jumped at it, especially because I was about to go on a big trip and wanted a versatile, small and light camera with wide angle when the situation didn't warrant pulling out the big guns (dSLR with a long lens for birds).I'm quite happy with the ZS30's results after the trip, with very nice landscape and general interest shots. Autofocus is reliable, exposure is always spot-on and quality is fine if you don't pixel-peep (I decided to use it at 16 MP instead of 18) or want to cover your living room wall with a print. The flash is on par with compact cameras, and low-light photos were a mixed bag: some very good, others very grainy. Movie mode was simple and fun to work with, although I prefer stills.Ergonomics are fine, and I like the hand grip, which prevents the camera from slipping. What I don't like is the position of the WiFi button: it is easy to press it inadvertently, and that will stop the camera on its tracks. Especially upsetting when you are setting up a shot and suddenly nothing happens. Also, as with previous ZS models, the mode dial is too sensitive (it could use a lock) and changes position easily. \"Mode dial in the wrong position\" is a message I got tired of very quickly.The GPS, which I insist upon, is a great feature and works right out of the box -- differently from another compact I owned, which required me to read manuals, load files into the SD card and was finicky on a good day. I did nothing and in the middle of nowhere the coordinates were correct and the ZS30 was asking me whether I wanted to write the place name onto the image. The option of exporting the GPS log into a .kml file is very useful as well.Of course, leaving the GPS on takes a toll on battery life, which is nothing to write home about even when it is off. Having spare batteries is mandatory, but Panasonic's (and other manufacturers') in-camera battery charging method is downright annoying: insert empty battery in camera, charge, remove full battery, insert another empty battery, charge... So I found an external charger (in Japan!) that works with the model's battery until Panasonic releases its own. Yes, unfortunately the ZS30 does not use the same battery as previous ZS's...Which reminds me of another annoyance regarding Panasonic: whenever they release a camera with a new battery, it takes MONTHS until spare Panny batteries are available for it. Being on a deadline and unable to find original Panasonic batteries, I shopped around Amazon and nearly hit a wall. At the time (late April) there was only one brand, Big Mike's. I bought two batteries, blind, and hoped for the best. To my surprise, they lasted longer than the original battery!So, with two spare batteries and an external charger, the ZS30 really delivered and I am happy with it. It is now my carry-around multipurpose camera, and will last me a long time.", "Date": "June 22, 2013"}, {"Title": "Best travel super zoom yet", "Author": "C. McCollough", "ReviewID": "RRZ87FOQPJ735", "Overall": "5.0", "Content": "For me, a great camera is one that is with me always and one that lets me capture those spontaneous shots that bring smiles to my face when I get home, or comments from the audience (along with questions about \"how did you do that!)  This super zoom travel camera does that and more.  For those who remember the old Lee Majors TV show \"The Six Million Dollar Man\", this is your bionic eye that lets you see more detail and record real time images and movies than your physical eye is capable of recording.....  let alone remembering!As others have explained in great detail, this is the camera you want IN YOUR POCKET when ever you travel, visit grandchildren, or head out the door for fun day.  Though thicker than a cell phone, it fits easily and comfortably in one's pocket, and with the improved rubberized grip, I can pull from my pocket, hit the power button and snap a candid picture in full auto in one smooth motion.  Rarely do I miss that perfect candid shot because of the mechanics of setting up the camera.  It takes another 2 seconds for the movie mode to be \"ready to shoot\" from a pocket quick draw... so the camera still has room for improvement.The feature list is significant, with many enhancements.  Here are the ones I found most significant during a two week mission trip in the barrios of Lima, Peru:1) The five axis optical image stabilization works very well, especially in wide angle.  When combined with iMovie movie stabilization, viewers will think you were using a steady cam.2) This version of GPS and GPS logging seems to be more power efficient.  I had no battery life issues leaving this on, and found the ability to overlay current location on a map quite handy.  I had downloaded the maps for South America to the memory card, and with no cell phone coverage, my iPhone was worthless as a GPS tracker.  But this camera worked flawlessly.3) Picture and video quality are improved and more than adequate for home and semi-pro use.  Audio is limited by range of the built in microphone, but short of using a video camera with remote microphone input capability, quite adequate.  No zoom audio noise when shooting videos (unlike earlier versions).Not perfect, but best yet.  Highly recommended.", "Date": "August 9, 2013"}, {"Title": "Nice Pocket Camera, but it has its limitations", "Author": "M. Hale", "ReviewID": "R2LCM5U1EADIKY", "Overall": "4.0", "Content": "I have had this camera for several weeks, purchased with the hope that I could use it as a substitute for a Canon T4i with an L - 70-300 on travels.  You can't and don't.  It's a modern, well finished, pocket camera loaded with many extras, some of which you may not want.  A major problem with it in the field, ie., outside, is that the bright and sharp LCD isn't viewable.  I mostly fixed this thanks to a commentator on a review I have since removed, with a Clearviewer device.  You can find this on Google, not on Amazon.  It's a fold-able lens one section of which screws into the tripod socket.  The lens then sits about an inch from the LCD and yes you can see the LCD in bright light.  But a warning, the telephoto lens isn't a Canon and from my first few forays, I won't be printing birds or butterfly pictures with it.  I am aware of a previous reviewer who counsels shooting telephoto pictures very rapidly.  When I do this with the Canon, I turn off the image stabilizer at 1/500 or less, so to speak.  Perhaps that will work.  Travel, yes.  Convenience, yes.  Good pictures indoors, yes and often without flash.  Also, the manual which comes on a disc can be easily downloaded from Panasonic and I stored it on my IPad.  But, 314 pages is a bit long and awkward...N.B. if you want to change the shutter speed or exposure in S mode, I suggest you skip the manual and press the little button on the camera back called Exposure/Map.  Found it, good.Several other points.  The GPS does work and like all portable GPS devices it depletes the battery very quickly.  Come to think of it the battery life even with the GPS is fair to poor on the curve.  I've not tried the Wi-Fi and except for a quick download to a smartphone, I not sure why one would use it rather than taking the SD card out and using a reader and a USB plug.  But each to his own.  Lastly, I bought this camera $high and was annoyed to the the price drop off in a day or so.  I expressed this as a concern to Amazon that they need to monitor these kind of unamusing rapid changers.  I thought about sending it back and then decided not to.  It's clearly an improvement over several older pocket cameras I have owned.  But again, a warning, you likely will need help with seeing your subjects unless its a cloudy day or you are inside.  It's worth between $300-350 now, no more.", "Date": "July 30, 2013"}, {"Title": "Great camera for stills and HD video.  I replaced my camcorder with this!", "Author": "John", "ReviewID": "R1LLYP678UCYR5", "Overall": "4.0", "Content": "This is the best camera I've ever owned.  Admittedly I am not a professional photographer, but I do like to take a good photograph and know something about how to do it.  The DMC-ZS30 has enough features to handle the point and shoot situation automatically, as well as manual settings for when you want or need to be creative.  The WiFi connectivity is nice for transferring photos to other connected devices like tablets and smartphones without having to go through a desktop computer first.  The zoom is amazing and more than most people will need.  Autofocus tracking is great for dynamic situations because it holds focus on the moving target that you choose.  Material and build quality are excellent, with most parts, including the small spring loaded USB connector door made of metal rather than plastic.The feature I like the most is the HD Video capability of this camera.  Although we wanted a new still camera too, our old one worked just fine.  This purchase was really to replace a Mini DV camcorder that recently died.  When I made the purchase I wasn't sure that a still camera could produce a good enough video to replace my old analog camera, but it is outstanding.  The videos are clear and sharp, focus and audio work well, although you have to be careful to not let the zoom lever slip off of your finger when shooting or you'll hear the click on the video.  Also, be careful of how tightly you zoom in while shooting video; with the lens zoomed in it's difficult to keep the picture steady and you risk losing your subject, or at best the video will be jerky and/or blurry.Tip:  As with all digital cameras you will need a SD card to store the images.  If you intend to shoot video, especially HD video, you will want the largest card that you can reasonably afford.  HOWEVER, you do NOT need the /fastest/ card available, just one that is faster than the camera.  SD cards have read/write speeds.  The DMC-ZS30 records at less than 40 mb/sec, so you don't need to pay for a faster card.  I bought a 64GB Class 10 40mb/sec card and it works great.Overall I love the camera, but there are a few things that keep it from receiving 5 stars.  For the most part though they are things that I would have liked to have included for either convenience, or to not have to pay extra for, or both:1. The camera goes through its battery faster than most point & shoot cameras for several reasons, but with only one battery provided you end up buying and carrying extra batteries just to be safe.  Also, the supplied battery is not the largest available; there are aftermarket batteries with up to 50% more amp-hour capacity that don't cost very much.  I bought two.  This is not to say that you'll constantly have to change batteries, you probably won't, but on an all-day outing shooting stills and videos, and the camera kept on most of the time (to hold the GPS lock), we exhausted the OEM battery right at the end of the day.  Our old still camera would have gone for two or three days on a charge, but it wouldn't have been zooming as much or talking to satellites either.  Bottom line on the battery:  Buy spares and an external charger, which brings me to...2. The camera doesn't come with an external charger.  Battery charging is done through the USB cable attached to the camera and plugged into a wall outlet.  That's fine if you get everything you want on the card and then come home and charge up, but if you find yourself low on battery in the field, you may be out of battery before you're done.  A standard wall charger allows you to charge one battery while you use another, and there are aftermarket models that work with a car power (cigarette lighter) adapter for on-the-road charging.  They're not expensive and I strongly recommend getting one.3. GPS often takes a long time to lock in, and if you turn the camera off it has to reacquire the satellites again.  This uses battery power and I'm often faced with either taking the shot without a location stamp or waiting, which of course means that I need to add location information later (because I'm not going to miss a shot).  Not a huge deal, since our old camera couldn't do this at all, but I was expecting something more like my wife's smartphone which stamps all photos and always knows where it is.  I haven't decided yet whether to just save battery power and turn off the GPS entirely, but I'm thinking about it.4. Auto focus can be slow at times.  Most of the time it's excellent, but at low light levels and other demanding situations it can be slow to respond.5. Raw AVCHD video is saved in MTS format and cannot be exported into MP4 or other more useful formats directly.  You can record directly to MP4 format but are limited to 24 fps.  To get 1080p and 30 fps you will need to record to AVCHD and then convert the image to another format for editing.  There are several good MTS converters on the market for a reasonable price, but its an extra cost.These are minor issues in my mind.  I am very happy with the camera and plan to use it for a very long time.", "Date": "November 24, 2013"}, {"Title": "Fantastic camera", "Author": "Robert K. Harvey \"BobH\"", "ReviewID": "R18CPCIMJ1BTN4", "Overall": "5.0", "Content": "I've used a ZS7 for a few years and like it. I bought a ZS30 to gain additional zoom because we were going on a safari in Botswana as well as visiting many other locations. I did manage to get some great pictures using only auto mode. Zooming all the way out can be trying because its difficult to keep track of the subject, especially if its moving . I did manage though to get some great shots at maximum zoom.Some of my pictures compare favorably to those taken by National Geographic photographers with their huge cameras and ancillary equipment who were some of our accompanying \"experts\" for this trip.I have one negative comment. The camera is all black, including the controls. Printing on the controls is tiny and gray. I have a very difficult time discerning the controls, particularly in low light. My ZS7 is much easier to see. Its blue with silver controls and black markings. The exterior design of both cameras is very similar.Both cameras have GPS, which is a nice feature.I took over 1200 pictures and videos on this trip and am very impressed with the results.Battery life does tend to be somewhat shorter than with the ZS7. This didn't present a problem because I had bought a charger and 2 spare batteries. On any one day I never needed more than 2 batteries, but had that third just in case.", "Date": "November 30, 2013"}, {"Title": "Great feature-rich go-anywhere camera -- As long as you have a spare battery", "Author": "LF Homeowner", "ReviewID": "R14WOYFBRN6PKC", "Overall": "4.0", "Content": "Took ZS30 on a European vacation and used it almost exclusively for 1200+ photos.  The last pocketable camera I had was a few years old, so decided to update, particularly for the 20x zoom.  ZS30 works great both for point-and-shoot snapshots and manually composed photos (Trevi fountain, Parthenon, Santorini, etc.).  Absolutely love the 20x zoom.  Makes in-camera composition a snap.  Sure, with its comparatively tiny, complex zoom lens, its 18MP images aren't in the same league as an SLR with a 500mm f4.5 lens, but watching other folks lug around their SLRs on a hot day in Athens had me seriously wondering how much better their images *really* are.  I'm thinking not much.  For handheld static images, low-light can be remarkable.  To reduce sensor noise the ZS30 fires the shutter several times in quick succession to integrate multiple exposures into a single image.  Late night images in Rome illuminated only by street lamps came out surprisingly well saturated and noise free.  For a pocketable point-and-shoot it does the job.  (#1 credo of photography: The best camera is the one you have with you.)  As others have observed, battery life is poor.  After an overnight charge, battery clunked-out by midday a couple times -- with GPS off.  With GPS enabled its worse.  Lesson learned: Always carry a charged spare battery.  Another complaint: Wifi setup is horrible (way too many options) and please, Panasonic, eliminate the dedicated Wifi button on the back (or at least allow me to repurpose it!).  Its a gimmick and just gets in the way.  I can't say how many times I accidentally pressed it with my thumb while setting up a shot.  I can think of many better uses for that button (spot metering comes to mind).  Auto-focus, auto-metering, face detection and image stabilization all worked fine.  HD video quality is great.  Flash coverage is sufficient for snapshots (edge falloff is quite noticeable).  But what'd you expect?  Its a pocketable 20x zoom!  Overall, this is a great little go-anywhere camera -- as long as you carry a spare battery.", "Date": "November 10, 2013"}, {"Title": "Dissapointing video function", "Author": "J. Peterson", "ReviewID": "RW8DD1C4DA6MT", "Overall": "3.0", "Content": "I purchased this camera as an upgrade from the Lumix zs5  I previously owned because I was mostly happy with the ZS5. The first ZS30 I purchased had 2 problems, it left vertical white lines on the panoramic photos, and while taking a video if you used the zoom feature the camera would loose focus briefly while zooming. After contacting the manufacturer I returned the camera for a replacement. I have used it for the past 2 weeks for mostly outdoor photos. The still photos it takes are very nice quality. The panoramic photos on this 2nd camera are also good. But, the video still blurs out briefly if the zoom feature is used. I contacted the manufacturer and their response was that the zoom is only for taking still pictures and not for use while taking movies. I have owned several digital cameras and this is the first I have ran into this problem. I still have not made up my mind about returning the camera yet as it does have some other features that are nice to have. It is a bit of an expensive camera for what you get.", "Date": "August 3, 2013"}, {"Title": "Hoping I just had a bad apple", "Author": "Dizzer7 \"dizzer7\"", "ReviewID": "R3AOCTE6AY08DA", "Overall": "4.0", "Content": "I had to send back the one I got as I got a write error, especially when using the super macro, which is one of the reasons I wanted this camera. I checked the SD card in another camera and it seemed to work just fine so I had to conclude it was something in the new camera. It's unfortunate too, because the photos this did take were very good. Especially those that I was able to take outside, or where I needed a little extra distance over a traditional point and shoot camera. I may look at getting another one and hoping that it was just the particular camera I got that had this problem and not a problem with the model itself (since I haven't read anything on any review sites like this I'm assuming it is a one of). Overall I'd recommend this camera if you are looking for a pocketable p&s; that has telephoto reach. Intuitive controls. Smooth. Sharp images.", "Date": "May 26, 2013"}, {"Title": "Excellent Digital Camera.", "Author": "S. Silva", "ReviewID": "R24X27VJUR7VT6", "Overall": "5.0", "Content": "I dropped my wife's camera in the Gulf of Alaska while on a fishing trip and we needed a replacement. Did my research on compact digital camera's and this camera was always rated very high. We wanted something easy to use, excellent picture quality, good zoom and fast start up so we could catch a picture quickly. This camera does it all and on top of that if you are a very experienced photographer the camera has great manual setups as well.", "Date": "July 9, 2013"}, {"Title": "Excellent Camera!!", "Author": "Jose Velasquez Mejia", "ReviewID": "R31A033R6KZA5S", "Overall": "5.0", "Content": "Buy zs30 three weeks ago for my trip to Peru. and really say it's fantastic, I'm no professional but I enjoy a good picture and well done. From what most outstanding camera has is the powerful 20x optical zoom. this for a compact camera is fantastic! buy it as a replacement for the ZS3 and have improved a lot. to make videos from any position of the dial is very good. Manual function to handle the opening and light and speed. has many positions that can be pre-configured. Although not easy to remember all at the time to take a picture (and that's no problem on the camera). automatic function always available to achieve the goal. the gps is fantastic and Wireless communication achieves its objective although I recognize that cost me a bit of work to achieve transfer photos to my iPad, I assumed it was connected to a network and ready. But you have to work more to achieve to know what the camera is connected. I have yet to explore more functions but I'm having fun with it and I think it is worth the price you pay for it. to the extent that I learn Ampliare this concept. but for me I'm no expert, this is a great photographic camera and deserves my 5 stars.", "Date": "June 13, 2013"}, {"Title": "Like this Camera very much", "Author": "D. Arthur", "ReviewID": "R1JO7ER7YIN44", "Overall": "4.0", "Content": "There are more settings on this little camera than I will ever use.  I am an amateur photographer that pretty much wanted a camera that can travel well and take decent photos.  I can't compare this with other cameras because this is the first high end point and shoot that I have owned.  I really like the display.  It is large and easy to see and I like the touch screen options.  The camera is very well equipped with many auto functions but for those times that I want to be more selective I can move to more manual choices than I can ever learn.  The lens is very good and I just learned how to do take a panorama.  Awesome!  I also like all the video features on the phone.  I can take stills while the camera is also taking video.  The battery life is better than average.  Make sure you get a good class 10 memory card if you are planning to do HD video.  The camera body has a good substantial feel - a step up from the lightweight plastic of other cameras.  Nice GPS options.  Not too bad with low light.  Less noise than other cameras.  I like the quick menu options that allow for quick change of settings.  I think this is a great all around camera.  I only gave it four stars because I'm still on a massive learning curve and don't know the camera well yet.", "Date": "April 15, 2013"}, {"Title": "Very nice, slightly soft images", "Author": "rrr", "ReviewID": "R1XPMWOO1QX5EK", "Overall": "4.0", "Content": "I took this on a recent trip to Europe and was very pleased. It is small and light. It is fast to turn on and fast to focus, so I rarely found myself waiting for it (I do wish it turned off a bit more quickly, but it's a long lens). The zoom range is very useful. The image stabilization works really well. The photos are very well exposed (it does a great job with backlight). I found a few photos were out of focus, but the vast majority were fine. The touch screen is sometimes useful (e.g. for setting focus point). I wish the photos were a bit sharper, but I'd probably have to carry a much heavier camera to do significantly better.A few minor gripes:* The wi-fi button is badly placed. I kept pushing it by accident, at which point it puts up a dialog box that must be dismissed before one can take a photo. Very frustrating when trying to catch something fleeting. I wish the camera would respond to the shutter even when that dialog box was up.* Charging is in-camera, and is slow. (Also, charging stops if you turn on the camera, e.g. to review photos).I've only had it a month so cannot speak to how robust it is.", "Date": "July 13, 2013"}, {"Title": "This is a Reliable Camera", "Author": "Dplev", "ReviewID": "RZBNJK1U9EPCJ", "Overall": "5.0", "Content": "I purchased this after I lost my first one hunting in the Oregon Coast Range.  Pictures are very easy to take, are of good quality and the camera allows you a myriad of options from completely automatic to manual.  It has a zoom and flash and has good battery life.  All in all it is a nice compact all around camera.  I have a Nikon SLR with a Leica lens, but this is what I take to the woods, light and reliable.Now here is the exceptional thing.  I found my original camera four months later in a meadow.  My fault it came out of my pack.  It had a Lowepro case on it, but the camera had been exposed from September through mid December, through innumerable rain and windstorms, frost from late October and snow in late November (and I am talking about inches worth of moisture), multiple days of frost and snow.  Not only was there a little battery charge still left, it worked, took a picture and everything.  Now, I only took one picture and was careful to dry it out, but after only a few days the camera was absolutely perfect.  So this camera and a Lowepro case are much tougher and more reliable than I ever would have expected.", "Date": "February 5, 2014"}, {"Title": "Great SLR alternative", "Author": "Loren Moss \"Don Lorenzo\"", "ReviewID": "R29IJTVJOTFSST", "Overall": "5.0", "Content": "I travel, as a journalist, and sometimes I am in some dicey places where a full SLR can make you a target. 7 years ago I purchased a Panasonic Lumix and it served me very well. After it finally died, I decided to replace it instead of repair it. After doing some more research, I still returned to the Panasonic Lumix platform and this camera is a great improvement over the earlier model. It is much faster and has some impressive features. The photo quality is very good, and one of the things I like is its low light capability. I can keep the flash off and shoot discretely in places that before would need a flash.  That said, the flash is not very powerful, so when you do need it, you will miss the ability to add a full size dedicated flash like an SLR.The Leica lens is great. The video quality is good. I do wish they didn't take away the ability to record raw format photos, but the full resolution JPEG photos are plenty huge - often over 10 MB.  The video records in your choice of two different formats, an HDTV native, and MP4 format. A rudimentary stereo microphone is now built in, but the location of the mic is too close to where my finger likes to wander. One big drawback of my old model was the inability to zoom when recording video, but this is fixed now. There appears to be a limit of 30 minutes when shooting video, but video is a secondary feature for me. If you are video oriented, you probably are better off with a camcorder. This records nice video, but feature-wise, it's a camera, not a camcorder.2 really cool features now are the built in GPS / GLONASS, and the WIFI for transferring photos. THe WIFI is kind of maddening to learn how to use, but once you learn the quirks its a good way to transfer photos. I use it when I am in the field to transfer photos to my iphone, where I can then email them directly. That way I dont have to wait to get back to my computer, and an internet connection.The camera is much much faster than the old model, but still not as fast as an SLR. Flash recovery time is much better, but this camera is also much thirstier than previous models when it comes to battery life.  One thing impressive is how fast the camera is ready to shoot upon turning it on. From pressing the power button, it is ready for action in less than 2 seconds.The camera is actually more compact than the old model, the lens retracts ito the body and it fits into my jeans pockets comfortably. There is a micro USB output and an HDMI TV output.Some work is better suited to an SLR, but for the type of work I do: photojournalism in developing countries mostly, this camera does not leave me wanting for features  that I left behind  when downsizing platforms. I am 100% happy with this camera. It also is the camera I use for family snapshots, etc.", "Date": "January 7, 2014"}, {"Title": "Great For The Average Joe", "Author": "Amazonian \"Mike\"", "ReviewID": "R3MCSJPL6H1W3T", "Overall": "5.0", "Content": "I'm not a photographer. I don't know an F-stop from a bus stop. When I buy a camera, I just want to put it in auto and take pictures that look great. This camera goes above and beyond for that type of person. If you're not trying to become the next Ansel Adams, but instead just want a reliable camera to take candid shots of your kids, pets and family, this is the camera for you. I get a lot of compliments of the pictures I take with this camera. My brother told me he liked the photos taken with this camera more than the photos taken from a pro at his daughter's wedding. To me, that says it all. If you want to step up the quality of photos you're taking with your cell phone, I would highly recommend this camera.", "Date": "May 19, 2014"}, {"Title": "Get the ZS20 instead of the ZS30 if you wear polarized sunglasses or have an iphone", "Author": "SB \"photo fun\"", "ReviewID": "R7CAKPOQCV0W4", "Overall": "2.0", "Content": "I love my Panasonic Lumix -- this is my fourth one. But get the ZS20 instead of the ZS30 if you wear polarized sunglasses. The screen for the ZS30 cannot be seen with polarized sunglasses in portrait mode.Don't buy this model for the Wi-Fi feature if you have an iphone, since IOS doesn't support NFC (Near Field Communication). Wi-Fi transfer of photos is very complicated -- have to manually program in the Wi-Fi settings each time, too many steps. Easier just to get an Eye-Fi chip for the camera and send them to the computer instead.I also like the on-off slider switch on the ZS20, instead of the push-in on-off button on the ZS30. The ZS30 has significant fish-eye distortion in photos of groups of people, none in the ZS20.Both cameras have gps, which is excellent.If you can, buy a warranty that covers dust. Two of my Lumix cameras got a spot of dust in them, including my beloved ZS20, not covered by normal warranty, and we turned both cameras into bricks by following the \"easy\" DYI videos online.I have a ZS30 that is only a few months old, but since I can't see the screen outside with my prescription polarized sunglasses, I've bought a new ZS20 that is making me very happy, again!", "Date": "April 4, 2014"}, {"Title": "It's a great all-around camera", "Author": "R. S. Winsor", "ReviewID": "R25R0CAOX777XV", "Overall": "5.0", "Content": "I am using this as my fast-grab camera that is compact enough to take everywhere.  It's very small and lightweight, and yet has a lot of features.  I get excellent photos with this, considering the size of the optics.  What I love most about it is how versatile it is.  I get excellent video, and I really love that it will capture video with full HD and 60p mode!  That means I can slow down the video by a factor of 2 and it still looks excellent and smooth.I bought the Panasonic underwater housing for this and took it diving in Cozumel (max depth so far has been 76 feet).  I am thrilled with the performance, and have taken it underwater at least 10 times since I bought it.  So if you like to take good underwater shots, I highly recommend the underwater case with this, it's well made.There are lots of photo modes available and the image app for smart phones is useful at times especially when you want to post a photo online and share with little delay.  The remote operation capability that the app offers is also handy to do some fun things.  I am still waiting for the app to have capability to capture time-series exposures, though (maybe some day).Note this is not a camera for stellar photos.  For that, get a full-sized camera.  This is a camera for those who want real portability with far better quality and capabilities than a smartphone.It's worth noting that I bought a class-10 SD card to use with this.  Although it's rated for a lower class card, I like to use class 10 because they really don't cost much more, but they never hang, either.  There is never any stutter in the video.I have tried a few 3D photos and displayed them on my big 3D television screen, and they look pretty cool.  That mode requires a bit of trial and error, but not too much.  Getting a decent looking 3D photo doesn't take too long, but is also not trivial.I did have one service issue with my camera (a screen problem), but I followed the repair instructions and had it repaired in about 5 weeks, no complaints.", "Date": "February 4, 2014"}, {"Title": "I like it!", "Author": "Barb Ross \"loves to read\"", "ReviewID": "RM4TXSH9SOOUP", "Overall": "5.0", "Content": "I love the camera and all its features. For its size, it is very powerful, and I can tuck it in a pocket and still be able to take great pictures, videos, and panoramas. Its anti-shake mode is wonderful. On a recent vacation, I was on a tour bus, shooting one-handed and I still got some good shots. It also has a very fast start up and recovery time. At the same time, it is good for more artistic work. My only wish is that it had an external battery charger, so that I don't have to plug in the camera to charge the battery. (I did get three extra batteries for my trip and that worked well.)", "Date": "December 9, 2013"}, {"Title": "Great pictures", "Author": "merfey", "ReviewID": "R3U8XFWNTKKNM5", "Overall": "5.0", "Content": "Compact but with advanced features.  Excellent image quality.  Ease of handling and good positioning of controls.  As good a camera as I have owned.", "Date": "April 15, 2014"}, {"Title": "Versatile, do-everything camera.", "Author": "John Arreola", "ReviewID": "R2AYL4SE2YXCFG", "Overall": "5.0", "Content": "The sharp, long zoom lens is handy for wild life photography. This is the best camera that I have ever owned - and I have owned many of them from the Leicas, Rolleis, Nikons, Cannons, Fujis, etc. I like the GPS and WiFi features, too.", "Date": "April 12, 2014"}, {"Title": "Best camera ever!", "Author": "Laura L. Lutz \"LL\"", "ReviewID": "R1AY7G3GL1F0DX", "Overall": "5.0", "Content": "I absolutely love this camera! I did a ton of research before buying this. I have had 4 Panasonics now from the big ones where you can change the lenses (which I sold after buying this one), to the small compact ones. I just love them. They are easy to use, love the settings for photos and you can take a picture while taking a video with this one. I thought the quality of videos was awesome with my last Panasonic and this one far outshines that one with the HD quality. Big difference. The sound in all of the Panasonics, recording bands, have been outstanding! We bought a Xoom, which is made for recording bands, and returned it. The sound was horrible.", "Date": "April 4, 2014"}, {"Title": "Lumix Camera", "Author": "phyllis Solomon", "ReviewID": "R2FDH3M8MB0BS3", "Overall": "5.0", "Content": "Have been using Canon for years and decided to switch. This camera is everything I could hope for in a point and shoot. There are so many shooting options. Pictures are so clear. I am very pleased and would highly recommend this camera.", "Date": "February 20, 2014"}, {"Title": "Worth the Money", "Author": "Donald F.", "ReviewID": "R3NRLUSJBAGQDN", "Overall": "4.0", "Content": "I bought this to upgrade my DMC-ZS19. Primarily I wanted the GPS, WiFi and NFC features. The camera is mostly the same with a few extra features (still can't see the display in sunlight). I tried out the GPS and it seems to work well. I used the Image App with the remote feature and it also seemed to work as advertised. I did have a lot of trouble with the NFC feature (transfer photos to your Smart Phone by tapping them together). In my first 15 attempts I got about 2 photos to transfer. Then I received an update to the app and was not able to get any photos to transfer. So I called Panasonic to talk to a customer service rep. Told her my problem and she put me on hold so she could try and find an answer. While waiting I tried once more. This time I noted that when my Galaxy S3 phone made the NFC connection, it switched from WiFi mode to 4G. I didn't understand why since I did not think 4G would be used in NFC mode. So I turned off my data (forcing it to stay in WiFi mode) and the photo transferred in seconds. I can't blame this on the camera. It may be the app or it may be my phone. However, the instructions for using these features  could be improved, that's why I only gave it four stars.", "Date": "February 18, 2014"}, {"Title": "Great camera", "Author": "Dan K.", "ReviewID": "RKAA8FY1O5A3U", "Overall": "5.0", "Content": "I am a happy customer.I have taken photos and video and the quality is amazing.I have taken night photos and they came out perfect.....low light quality is the best I have seen.Battery life is OK,I would suggest getting a heavy duty one for longer battery life.Setting up the WiFi was a slow process but I think that was do to my lack of knowledge of the internet and other factors.", "Date": "February 6, 2014"}, {"Title": "As a vacation and special occassion photographer---GREAT!", "Author": "Salty Waters \"Boat Booker\"", "ReviewID": "R22JSLNWR65JI6", "Overall": "5.0", "Content": "This camera is so easy to operate.  The various functions on the dial, once selected, are spelled out on the screen making it so easy for the occasional photographer to make choices to improve the picture.  Dark, multiple layers of lighting, outside sunny, distant mountain scenes, you name it.  The real plus is that once you point to an icon on the rear screen, the camera describes the purpose.  Takes the memory and guess work away from the occasional user.  Its light, small and fits in a regular pants pocket without being bulky.  Better results than with my Canon or Sony.  The built in charger means you can top off the battery no matter where you are without having to carry an extra charger.  We usually charge up at night, but carry an extra battery just in case....Absolutely no buyers remorse, here.", "Date": "February 4, 2014"}, {"Title": "Lumix DMC-ZS30 camera", "Author": "Sheila", "ReviewID": "RRTFEZ92S6F1I", "Overall": "4.0", "Content": "I have not used all the features nor have I downloaded pictures to my computer from the camera, but it is a good camera. I purchased this to replace my earlier model lumix when a trip to the beach did it in!  The small size of this camera makes it convenient to carry in your pocket or purse. It does come with a battery so I did not need to purchase the batteries and charger as I did.", "Date": "January 29, 2014"}, {"Title": "Best P&S; Camera Available", "Author": "TMG AZ", "ReviewID": "R3EYUBSX2UUMMV", "Overall": "5.0", "Content": "I rarely write product reviews, but this P&S; camera has thoroughly exceeded my expectation. The specs are impressive, but the integration is far more than just the sum of the parts. Panasonic did an outstanding job with this camera. Performance is excellent, the zoom is fantastic - clear, smooth, incredible reach. Image stabilization  at full zoom is just phenomenal. It's simply incredible how many features are packed into this small device. I got this camera for my wife. It now replaces a Sony HDCam and a Cybershot. I'm planning on getting one for myself, and I have 2 Nikon Pro-DLSR's.This is one of those few purchases that you really feel is worth the price and you won't have buyers remorse in 30 days. The only minor drawback is networking to a Windows PC is essentially not supported. You need to transfer files to a W7/8 PC using USB or copy the SD card. However, you can transfer pictures to a cloud service wirelessly, then move them to your PC. Wireless transfer works well with IPAD or IPhone, It even comes with remote control abilities available on the IPAD/IPhone. These are features you don't find a some pro-DSLR's costing 5 to 10 times the price. Just amazing.And of course Amazon shipping and attention to details was flawless as usual. Amazon tracks an monitors camera orders through their camera concierge team. We are very pleased with this new camera and the overall order experience.Update 02/23/2014: Have used this camera in several genre since purchasing it several weeks ago. The zoom and stabilization are truly remarkable. Used several of the special preset camera setups, all worked great. Picture clarity is exceptional for such a small camera. Reaffirmed my original conclusion: best point and shot camera I've ever used, highly recommended.", "Date": "January 19, 2014"}, {"Title": "A SIMPLE GENERAL REVIEW", "Author": "jenguin \"82\"", "ReviewID": "R1SF6F1M6A6WXG", "Overall": "4.0", "Content": "So if you want an camera that's better than average point and shoot quality this is it. I originally started off w/ a olderlumix model in 2007. I loved it, shoulda stuck w/ the brand, I tried other companies over the years, other price ranges. All I wanted was a camera I could QUICKLY take out and snap amazing photos at concerts, parties, & squirmy pets; which are the hardest things to shoot well in my opinion. Is every shot perfect? No but, your chances are way better, simple to use options for a beginner or myself a 'in the middle amateur' I would say. Oh it does come w/ some extras GPS things & photo program. I used there photo program which is utter poop. You can ONLY put lumix pictures into the program. Say on your SD card you have pictures from another camera, ugh uh, cant put it into that program. So I bought a separate photo program.", "Date": "January 1, 2014"}, {"Title": "Early days, but this one is a keeper", "Author": "Garycal", "ReviewID": "R30OBPGEU2O7MV", "Overall": "4.0", "Content": "I use mostly my Nikon DSLR, but when it is too bulky for the day I wanted a good point and shoot and this is far better than my older Canons which were good in the day.  Has some nice features and the pictures are good.  Wish they would put raw capture in these very costly point and shoot models, though.", "Date": "September 24, 2013"}, {"Title": "Great Camera", "Author": "BoydsBoys", "ReviewID": "RHDZC43XBJUWM", "Overall": "5.0", "Content": "This is my second Panasonic Lumix and I really will not buy any other camera. The pictures are fantastic and it has so many options that even a novice can use.  This is THE camera to buy if you are a casual photographer who likes to take pictures of the family, holidays, sports events, and especially traveling.My only complaint is that they put the Wifi button in a very inconvenient place and I keep pressing it as I hold the camera or take a picture. However, this is minor compared to the quality of the pictures and all the options this camera has.", "Date": "September 14, 2013"}, {"Title": "unfit foor outdoors", "Author": "AS", "ReviewID": "R2G1E9EJV097QO", "Overall": "2.0", "Content": "whatever the merits, the quality of the camera is not up to careful outdoors use beyond your garden. i will have to get it repaired for the 3rd time in 1 year. 1st time particles in the lense, 2nd battery not recognised, 3rd shutter problem.", "Date": "January 16, 2014"}, {"Title": "Great for Pictures but Not So Great for Sharing", "Author": "Michael J. Scott", "ReviewID": "RMTPX3COZIVD7", "Overall": "3.0", "Content": "I've been taking pictures for years and have thousands of dollars tied up in Nikon DSLRs.  The problem with those cameras is obvious: you just can't put them in your pocket and easily carry them around.  So, I needed a little camera that would give me decent pictures and I found it in the ZS30.  Now a lot of people have talked about the quality of the pictures, the settings to use, and etc.  It's all good advice and I recommend you follow it if you're not used to taking pictures.  My personal experience over the last few days has been positive with the quality of the pictures, ease of use, control settings, ergonomics, and etc. has been positive and if this is the main reason for buying this camera then I recommend it.  If, however, the main reason is so you can easily add pictures to sharing sites such as Facebook you might want to reconsider this camera especially if you own a Mac.  Most of the wireless functions will not work if you are using a iOS, and the PhotofunStudio feature, highly touted on the inserts and advertising, WILL NOT WORK with Macs, only PC's.Now, on to the wireless features.  I'm pretty good at setting up stuff like this, and thought it would be a breeze, and it was, except once you get set up nothing seems to stay set up and you're always entering your encryption code and setting up your wireless again.  You can't share anything to your computer if you're using a MAC, only if you're using a PC.  You can share to your smartphone, including Apples, but the wireless connection is unstable and for reasons unknown is forever dropping off, requiring you to reset it, which is huge pain.In conclusion it's a great camera for its camera features but NOT so great when it comes to its wireless features, which, for me, is unfortunate because I was hoping to avoid having to pull the card and using my computer to send pics to FB, YouTube and etc. but unless I'm missing something I'm afraid that's the only way I'm going to get it done because I can't seem to get it to work using the WiFi function.", "Date": "December 27, 2013"}, {"Title": "My second Panasonic", "Author": "J. Farris \"JFarris\"", "ReviewID": "R3MUY3O2FA8LWS", "Overall": "5.0", "Content": "This is my second Panasonic digital. The previous was great - just several generations older. This has terrific resolution, an amazing zoom, terrific video, and all of this in a toss-it-in-your-pocket camera. Sweet.Based upon how scratched my previous viewfinder got, I put a screen protector on this one. I highly recommend you do the same.", "Date": "December 22, 2013"}, {"Title": "Nice Little Camera", "Author": "Kimball Corson", "ReviewID": "R3DWVEQX3LQDLJ", "Overall": "4.0", "Content": "I have many small cameras, but this is the one I seem to grab most. I am no longer willing to drag professional equipment around as the small stuff has gotten so much better. Wish it shot RAW but don't want the expense of upgrading to the ZS40. I'll wait for prices to drop after the next model after that arrives.", "Date": "May 4, 2014"}, {"Title": "I'm a fan of the Panasonic Lumix DMC series", "Author": "Ron", "ReviewID": "R3GCJVIKXWD2QI", "Overall": "5.0", "Content": "I have a tendency to be too physical with my cameras.When I need a replacement I turn to a newer version of the Lumix. The zoom is excellent and the quality very good. The retouch feature is a plus. I will buy another when I've damaged this one beyond repair.", "Date": "May 4, 2014"}, {"Title": "More than meets the eye!", "Author": "mgrynder", "ReviewID": "R1B43GU8BTHHBE", "Overall": "5.0", "Content": "I bought this as a surprise for my wife before she goes on a trip.  The description of the Lumix doesn't begin to explain all the features that the camera actually has.  It gives the ability to take some fantastic photos, and then manipulate them in a variety of manures if you should choose.  I'm very happy with this purchase, and will recommend it to anyone who loves to take pictures.", "Date": "April 27, 2014"}, {"Title": "Remote View Finding is Excellent", "Author": "Martin Sahn", "ReviewID": "R323ENIWE1GBJ7", "Overall": "5.0", "Content": "Remote View Finding is Excellent.  I use my Galaxy SII Smartphone as a viewfinder to take photos in recessed building areas that are otherwise inaccessible.", "Date": "April 18, 2014"}, {"Title": "Probably an even higher rating after I understand it more.", "Author": "Lynn Dillman", "ReviewID": "RUCN8GT8XCCJK", "Overall": "4.0", "Content": "Got it to replace a similar panasonic I lost. Have had 4 of them now and have always been very pleased by their quality-particularly the lenses. And all seem to be excellent for whatever level of picture taker you might be. Great size too.", "Date": "April 9, 2014"}, {"Title": "easy to use clear pictures", "Author": "CheryllC", "ReviewID": "R1F0DEG6RLCTF", "Overall": "4.0", "Content": "The flash is out of the way and the pictures are clear and not out of focus like our coolpix was.", "Date": "April 7, 2014"}, {"Title": "Simple, Versatile", "Author": "Camilla Lamer", "ReviewID": "R20IKG7NJ2Q2L5", "Overall": "5.0", "Content": "Simple to use if you wish, and extremely versitile if you study up on the 300+ page manual.  Wifi, tap to transfer, smartphone remote control are helpful and pretty easy to use.  Small size and light weight are also a plus.", "Date": "April 3, 2014"}, {"Title": "Perfect", "Author": "Jose Braz", "ReviewID": "R3QKSHW1SR360L", "Overall": "5.0", "Content": "Perfect little camera. Power hungry if  all features active. Before store disable GPS and wifi otherwise you will be for a unpleasant surprise.", "Date": "March 29, 2014"}, {"Title": "Great camera,  with a few exceptions.", "Author": "Lee", "ReviewID": "R1XLQ3XM0JLGOI", "Overall": "4.0", "Content": "I love almost everything about this camera. It takes great pictures, the menu/interface is easy to use,  and it's a good size with a nice appearance.Now to the bad part.WiFi and NFC leave much to be desired. I'm a pretty tech savvy guy and this was a pain. My only advice it to install the program it comes with and let it make the shared folder for you. Once setup,  it's easy to use.Does not work with my 2013 Samsung tv.NFC is just ok, nowhere near as easy as touching two  phones together. However, it works and this was one of the first cameras on the market with this technology.  So I didn't expect it to be phenomenal,  same with the WiFi.", "Date": "March 27, 2014"}, {"Title": "Great camera", "Author": "mnwriter", "ReviewID": "R3N26SOGM9FUKR", "Overall": "5.0", "Content": "Happy with the pictures I am taking with this camera.  Really enjoy the longer zoom.  Tend to use the intelligent automatic setting but have also successfully used macro and some of the other settings.  Still working on panoramic shot technique - some great, some poor.  Haven't explored GPS or WiFi in depth.", "Date": "March 24, 2014"}, {"Title": "Love this Camera!!", "Author": "Amazon Customer", "ReviewID": "RRCMTX2NPFSZZ", "Overall": "5.0", "Content": "I have had a Panasonic Lumix DMC-FH2 for years, and it has travelled the globe with me and taken some amazing photos.  I needed a better zoom, and envied the wifi control for taking better \"self-shots\" (when it's just me and my tripod) and so I can escape from the sun during brutal band competitions in the texas heat, but setting out the camera and then controlling it from the shade.It takes amazingly good pictures and videos.  The only thing (that I was unaware of) is that AVCHD looks really poor on a computer, and MP4 is the way to go if you're distributing electronically.  The oddity is that MP4 is 30fps and AVCHD is 60fps so this was really counterintuitive that the higher fps would look grainy and out of focus.  That solved, I'm thrilled!", "Date": "March 12, 2014"}, {"Title": "I like it!", "Author": "Donna T. Morss \"mater\"", "ReviewID": "R2L00ER1FK4I1V", "Overall": "4.0", "Content": "I really like this camera .  The zoom is great!  I love that you can video  watch it back pause it and take a picture!  The Wi-Fi I haven't got to work yet.  But it sounds like a cool feature.  I do wish it came with a dummies book!", "Date": "March 12, 2014"}, {"Title": "Fast shutter", "Author": "Kenneth Post", "ReviewID": "R34B6X7AG0XXMK", "Overall": "5.0", "Content": "Perfect for photoing kids on the move. I cant get advanced features to work but oh well. Fiddled around with the wifi and panasonic apps, they were not plug and play and I am a computer guy.", "Date": "February 18, 2014"}, {"Title": "Great little Camera!!!", "Author": "JD", "ReviewID": "R2PD73ZFQUV3VH", "Overall": "5.0", "Content": "I bought this Camera for my wife for Christmas.  It does an amazing job and i have been blown away with how good the video is.  The 20X Zoom is incredible and takes such clear pictures.  We Love it!!", "Date": "January 16, 2014"}, {"Title": "AWESOME Camera!!!", "Author": "Rhonda P.", "ReviewID": "RV1B98EKDEOD4", "Overall": "5.0", "Content": "I have had 3 Panasonics so far and love them. So I wanted to stay with the same brand. I carry the camera in my purse so I always have it on me. I get a lot of wildlife photos and nature/landscape pictures. So I put a lot of mileage on each camera. The price on this camera was so good and when reading the ratings, I chose this vendor, Cameta Camera, because they were so willing to help every customer get the best experience out of their new cameras. That kind of customer service is very important to me. So you put it all together in one package: a great camera, a terrific price and a wonderful vendor and it's a 'no brainer'!", "Date": "January 5, 2014"}, {"Title": "Great, love it!", "Author": "WEJ", "ReviewID": "R3OG49TUECHA1B", "Overall": "5.0", "Content": "I am still learning about the camera but the pictures are great, good color, realistic, clear and I like the remote capability using my Android phone - seeing the picture is really neat. Love it and highly recommend it to anyone who is looking for a small light good point and shoot camera!", "Date": "November 24, 2013"}, {"Title": "don't leave home without it", "Author": "Lee", "ReviewID": "RC7GJ392Z3SWQ", "Overall": "5.0", "Content": "ease of use/small but with good zoom/perfect to keep with me all the time so no shots are missed ...more features than previous models makes it even more fun to use.", "Date": "November 24, 2013"}, {"Title": "Wow, what a camera.", "Author": "James Florwick", "ReviewID": "R17O86LISMT3DV", "Overall": "5.0", "Content": "I updated technology finally having owned the ZS-3.  Unbelievable technology and everything you could want in a Point and Shoot camera.  plenty of ways available to manipulate the image if you want - however the auto mode is scary smart.  I do a lot of detailed surveys for work that require indoor architectural details to be captured.  High places, and low light generally characterize the shots needed - hand held night shot (combined image stabilization - and multi exposure mixing) does such a fine job I rarely need additional light.  I also just used this in Spain while touring cathedrals in Barcelona - amazing images without flash.  In some instances like all cameras intelligent Auto can prioritize the unintended elements - but in all cases - a minor shift in the focus or  zoom brings the desired results - and frankly if I paid attention to the on screen feedback - a second shot likely wouldn't have been necessary any ways.  I love it - a very worthy upgrade.", "Date": "September 14, 2013"}, {"Title": "Review of Lumix DMC ZS30", "Author": "Diane duffy", "ReviewID": "R3B8WWI6GTH4UO", "Overall": "4.0", "Content": "This is definitely a camera that you grow into.  The paper instruction manual is fine  to get you going but you definitely need the manual on the CD that comes with the camera to figure out the more involved features such as GPS capabilities. Short instructions and helpful hints appear on the screen to easily assist you with multiple features and controls, minimizing your need to memorize use of the buttons. This camera does exceptionally well in the IA mode when there is not a lot of light, without the use of flash. Your best bet is to download and save the manual from the Internet, since the CD can't be used on an iPad.The one feature, wi-fi capability, was the main reason I chose this camera and it has been a disappointment. After many unsuccessful attempts to figure out how to access wi-fi and send photos (on my iPad) by following the manual, I requested help at the Apple store. After 40 minutes and two instructors, the only solution was to buy a $30 cable adaptor and physically connect my camera and iPad to transfer photos. The other problem with using the wifi feature internationally is that wifi isn't always available. In that case you may have to access your data plan. I don't know this for sure, as I am using the cable adapter successfully.Even with the challenges, I'm glad I bought this camera, and will be happier with it, once I've overcome the inevitable growing", "Date": "December 31, 2013"}, {"Title": "Takes fairly good photos but WiFi  is confusing at best..", "Author": "jwp", "ReviewID": "R34NRRYJ5WDNYD", "Overall": "3.0", "Content": "I bought this camera for its built in WiFi but I am greatly disappointed.  I have been an Eye-Fi user for some time and thought this camera would make automatic uploads easier.I couldn't have been more wrong.  There are confusing set up menus and instead of storing a WiFi setting once for each SSID you have to enter it each time for any of the types of upload functions it allows. Also there is no seamless automatic upload of photos to a phone that is similar to the Eye-Fi functionality.Moreover, any extensive use of WiFi quickly drains the battery in a short time. (even with GPS turned off).You can put a Eye-Fi card in it but there is no way to manage the card's off/on status as in some other camerasThe remote camera operation over WiFi may have some interesting application but the WiFi operation for uploading needs a major rewrite along with a fix for battery consumption.Only the plus side, the pictures are good quality and there are lots of features. The Intelligent Auto seems to work well and camera fits the bill for a pocket camera with a good zoom.My conclusion is the camera is a good camera but it should not be bought for its WiFi abilities which I am sure drove up the price..", "Date": "December 28, 2013"}, {"Title": "Excellent high-zoom digicam", "Author": "Gadgester \"No Time, No Money\"", "ReviewID": "R3VUUS3DLMIWIB", "Overall": "5.0", "Content": "I bought this on Amazon.com from a third-party seller, unfortunately they send me a gray-market ZS30.  The instructions are in English and Chinese (no Spanish so you know this is not for the American market as half, or more, of the U.S. population now speak Spanish as a mother tongue!), but more importantly, the video formats are all 25p, which is not the 30p formats we use here stateside.But the camera is absolutely excellent.  It has GPS which finds location faster than my older ZS7 (but still nowhere as fast as the instantaneous locationing on my Nokia Lumia phone).  Panasonic's Quick Menu is always a pleasure to use, as it lets you access the most commonly used functions for each shooting mode.  The location of the video button is a bit weird as it's located right next to the power button, on the top to the right of the shutter, so sometimes, in the dark, I forget which is which.Yes, you can zoom optically, up to 20 times, while shooting video, and the motor noise is zero in the video captured.  Panasonic's tried-and-true intelligent zoom feature can increase the effective zoom by up to another 30% without degrading image quality whatsoever. (This can happen because the ZS20's sensor has more pixels than even the highest resolution output by the camera.)  I do wish there were a raw output option.  The manual mode lets you adjust exposure and speed manually (but not focus distance), and is relatively intuitive to use.Picture quality is nothing short of excellent, even in dimly lit situations.  in the old days Panasonic's camera tended to output noisy images.  I don't know if they still use Sony's image sensors, but this one gives better, smoother images.  You can tell by opening a picture in Windows Photo Viewer and going to 100% and looking at the pixels.Video image is excellent, too, and to my surprise, the non-US 25p formats play back well on my Toshiba laptop in Windows Media Player and VLC Player.  No stuttering whatsoever.  One minor gripe is when you zoom optically, and when the scene lacks contrast, the focus tends to hunt around more often than on my previous ZS7 or on any of my Sony digital cameras (primarily the TX series).  This is not an uncommon problem with auto-focus digital cameras when it comes to video recording, but I'm surprised it's an issue here but not with the older ZS7.I got the white ZS30 and, boy, is it stylish!  It's also ergonomic (save for the location of the video recording button).  The high-res LCD screen is also touch screen like on any smartphone nowadays. The icons do tend to be a little smallish, but still tappable.  You also get mechanical buttons and D-pad as usual, so it's really easy to use whether you prefer touch or old-style button push.The ZS30 is a great, top-notch all-around compact camera for all sorts of purposes, from travel to portrait to parties.  When it comes to taking pictures worth saving (as opposed to sharing with the 3,000 strangers on your Facebook friends list), a good camera like this beats any smartphone (unless you have the Lumia 1020 phone with its 41MP sensor).", "Date": "December 14, 2013"}, {"Title": "Replaced my Sony Cyber-Shot DSC-HX100V and haven't missed it!", "Author": "Sally Carr \"Spyglass Sally\"", "ReviewID": "RB8JUQCNQBPOF", "Overall": "5.0", "Content": "I got tired of carrying around a DSLR just because I wanted a really great zoom and a camera capable of handling complex lighting.  So I sold it and bought the Sony Cyber-Shot DSC-HX100V.  It was better, but still too bulky.  I just couldn't find anything that would give me the zoom and quality shot I wanted in a more portable camera - until I got the ZS30.  This camera is amazing!  The zoom is fantastic (20x optical), great wide angle (24mm) and a Leica DC lens with Optical Image Stabilizer (O.I.S.) that captures detail and color as well as my DSLR.  The 20X zoom works even during HD video, there are plenty of Scene presets to choose from, in addition to iAuto and a manual mode that allows for 4 custom preset settings.  But honestly, I haven't even needed those.  Of course there's all the things you'd expect like Motion Blur, Face Detection, HDR, etc.  It boots up quickly, and I love the touch screen interface, in addition to buttons, to do things like swipe through viewing pictures and select which item you want to focus on.  The NFC connected easily to my Samsung Galaxy S4 and, with the free Panasonic Image App, I can even remotely control the camera from my phone - from seeing the view from the lens to taking the shot.  I  also set it up so, when connected to home wifi, it automatically backs up any pictures taken to my home pc.  It's everything I was looking for.  I sold my Sony on eBay and have never missed it.", "Date": "December 5, 2013"}, {"Title": "It doesn't get better than this", "Author": "MMeyer \"Shoe Lover\"", "ReviewID": "RBQ45XU4O9JSK", "Overall": "5.0", "Content": "I won't go into the technical aspects of the camera - I think that's already been well addressed. I can tell you that this camera is amazing. It was so easy to sync it to my tablet and it takes really, really good photos. Great options in a very small footprint. It's definitely worth the extra money; I checked out several reviews (CNET, PCWorld, etc.) before honing in on the ZS30 and am very happy with it.", "Date": "August 18, 2013"}, {"Title": "Amazing Camera", "Author": "Michael", "ReviewID": "RUILFQXZ16E99", "Overall": "5.0", "Content": "I haven't experimented too much with this camera so far, but from what I have seen it has taken excellent pictures. The mobile app to control the camera is so convenient. I can't imagine having a camera without such a feature anymore! The video is super crisp and clear also. All around a great camera!", "Date": "July 7, 2013"}, {"Title": "Great camera until using the wifi.", "Author": "Philip Pontillo", "ReviewID": "RP3UUNGOYWDZB", "Overall": "4.0", "Content": "When you take an 18MP sensor, 20X optical zoom, super fast focusing, focus tracking, 1080P video at 60fps, and a full set of auto as well as manual controls in a package that fits inside a shirt pocket, you have just created one of the best, most feature packed compact cameras money can buy.  Then when you add WIFI to it, you have just made a tiny little metal and plastic frustration machine that can make the most patient and tech experienced person become a ticking time bomb, ready to snap at any moment and smash a brand new camera into pieces.Let me start by saying that I use eye-fi cards, Transcend wifi cards, and briefly had a Canon SX280-HS with wifi.  I am very tech savvy and will go to the ends of the earth to figure out how to do something.  Well my friends, I have seen the end of the earth and am currently stuck there writing this review.First the NFC (near field communication) where you magically touch your device to another and they live happily ever after.  Mac products don't have this capability so that is out.  This is an Apple problem, not Panasonic, but it would be nice if in the 314 page manual it simply stated \"as of early 2014, apple products do not have NFC capabilities\".Back to the frustration machine's power of madness.  Connecting to a phone or tablet using Panasonic's app uses way too many steps and choices, is overly complicated, but works just fine once you get it set up.  I had to reset the wifi back to factory twice and go over the process three times before it worked, but finally it did and does and all is well with that.The following is connecting to a Macbook.  Windows computers may work fine, I don't know.  Connecting to a computer is really simple if you follow these steps:Forget that this camera even has wifi, buy an eye-fi card, set it up to transfer to the computer using the software where you can type with a keyboard, be happy, turn the camera on and watch your photos fly to your computer.If you still want to use Panasonic's built in wifi to connect to a computer, follow these steps:Turn on the camera, hit the wifi button, choose new connection, choose the function (remote shooting, transfer while shooting, or transfer images on camera), choose PC to connect to, choose direct or network, enter or find SSID and password, let the camera connect.  Entering text is the same as texting on a flip phone in 1999 where each button has 3 or 4 letters and you have to hit it a certain number of times to choose the letter.  If two letters in a row are in the same space, you must navigate to an arrow in the top right corner to move to the next character space and back to the letter keys again.  It is so archaic that I swear I heard Prince singing Party Like It's 1999 while I was entering my password.  This camera does have a touch screen but they chose to not make it function for the on screen keyboard.  Once connected, the next step is to watch the hourglass icon spin and spin and spin and spin.  When it is done spinning and has not found your computer, you can then enter it manually with the keyboard of pain.  You have to enter your computer name so if your still with me, change your computer's name to \"A\" or something with no more than one letter as you will most likely repeat this process many times depending on your patience level and whether your camera is smashed yet.  When this is done, you then enter you computer's username and password.  Well my user name has a space in it as I would assume most do, it is simply my name, but the camera does not allow entering spaces in this screen.  So what now???  Well, on mac, there is your \"short\" username which can be found by going into users and right clicking on your account then picking advanced options.  My short name is \"Phil\"  Ahhhhhh...............relief, I now have all the information that I need to get connected. I enter my username and my password and.......................watch the spinning hourglass again.  Whoa, it found my computer!!!  Now I must choose the folder, oh forgot that part.  You must choose the folder to send the files to, then go through a series of steps to make it so the camera will find it, changing sharing preferences for all users for that folder.  Anyways, I pick the ZS30 folder I created, hit enter and.....................spin, spin, spin.  After the spinning is over, it wants my username and password again.  Back to the non-touch screen keyboard.....enter.......................spin...spin....spin....almost there.....BAM - username and password are incorrect.The next steps are entirely up to you and you can choose whatever path you wish to travel down.  You can Google \"ZS30 wifi computer\" and find other people that have entered the wifi chamber of doom, read some pretty good articles on this issue, learn about changing some sharing options, get some new hope, feel like this time it will work, then repeat the entire process again, and again, and again thinking that it you do something enough times it will HAVE to work at some point.  When you realize you are wrong, you then write a review.  If you choose this path, I recommend the following preparations before proceeding.  If there is anyone else in the house, have then leave for a couple hours, put all pets outside, enter a state of relaxation using your method of choice whether it be metaphysical, chemical, or herbal, remove any and all sharp objects from within 10 feet of your current location, loosen up whatever finger you will be using to enter characters on a non-touchscreen keyboard on a camera with a touchscreen, call the neighbors and tell them they are about the hear yelling soon but nobody is getting hurt, and finally, put on a Prince CD for background ambiance.The second and safer option is to send the photos to your phone or tablet, get them to your computer using Photostream, Dropbox or some other cloud based system, relax, enjoy life, don't hurt anyone, don't break anything, and just accept the fact that you will never send a photo from your ZS30 directly to your computer in this lifetime.I still haven't ruled out the fact that one of our foreign enemies has secretly created this camera as part of a bigger plot to slowly weaken people into a state of utter frustration and confusion.  Breaking down the masses until everyone is walking around with drool running out of the corner of their mouths, babbling about why can't I send a photo to my computer, what is my SSID, what is my computer name, what is my password, and last but certainly not least, what is Prince doing now?  When we are all in a vegetative state induced by a Panasonic/wifi coma, they will strike down, take over our country and party like it's 1999.UPDATE:  When my list of shared folders came up, I chose the one that I specifically set up to receive photos.  I went back and selected my Dropbox folder just to see what would happen and everything connected fine.  Comparing the settings on both these folders, permissions were set to read and write for all users in the Dropbox folder and write only in the other folder.  Cameralabs excellent and detailed instructions on how to set this up did say to change this setting to write only.  For whatever reason, this did not work for me but read and write did.  I upgraded my rating to 4 stars now that I am connected and it worked fine.  Having said that, it is still a very overcomplicated and specific process that will not allow me to give it 5 stars, regardless of how awesome everything else about this camera is.  Without internet searches and the instructions by cameralabs, there is no way I could have set this up just using Panasonic's manuals and help.", "Date": "February 21, 2014"}, {"Title": "disapointing", "Author": "Mita", "ReviewID": "R2P995CNA2T9NR", "Overall": "2.0", "Content": "this was meant to be an upgrade for my much beloved ZS7, more zoom better in low light. It was better in low light, but the colors and pictures lacked in crispness. I was hoping to love it, but having my old camera still around to compare the exact same shots, I came to the conclusion that I'll never be really happy with it and returned it", "Date": "September 6, 2013"}, {"Title": "Mixed feelings about this iteration", "Author": "Daniel Neiman", "ReviewID": "R7DAX5HLS8PSO", "Overall": "3.0", "Content": "I've had four versions of the Travel Zoom (ZS) camera and this is my least favorite, even though it has the most features and is arguably the most capable.First, the good news.  It takes decent pictures and the shutter response is very good -- you can actually take action shots with this camera which is pretty unusual for a point and shoot.  But...they made some very odd design decisions with this iteration of the Travel Zoom/ZS model that really irritate me:  1.  The on/off switch is now a push button that can easily be activated by accident, even when it's in its belt pouch case.  2.  Possibly related to (1), on two or three occasions I've reached for the camera to find that the battery was dead, even though I'd charged it recently.  This is unacceptable in a pocket camera -- it's purpose is to be ready when I spot something interesting.  (Also, no charger included with the camera.  Pretty darned cheap of Panasonic, given the price tag.)  3.  I love the panorama feature, but they've crippled it.  You can't zoom, which means there's no ability to compose the panorama.  And the individual shots that comprise the panorama are of very low resolution -- a full panorama might be a fraction of the size of a single normal photo (as measured in MB).  So forget ever printing a panorama.  4.  The camera has WiFi, but it's buggy and short range.  I've tried using it to photograph wildlife, but with my iPod Touch, you have to be within about 15-20 feet of the camera and the application doesn't work very well -- once you take a picture, it hangs.  5.  They've removed a number of the scene choices that were present in previous versions.  There's no fireworks mode, for example.  It'd be nice to have a mode that knew enough to stop trying to focus at anything but infinity when shooting fireworks.  6.  And while we're on the subject of WiFi -- the WiFi control button is *stupidly* positioned.  You *will* accidentally hit that button at some point while trying to take a picture.  At which point the camera will go into a menu mode and you will miss the photo.  7.  Macro autofocus: It works in some modes but not others.  There doesn't seem to be any logic to it.  Why can't I take a closeup picture of a flower in landscape mode?  Dunno.I'm not even very crazy about the size of the camera -- they've made it smaller and it feels less solid and robust.  (Also, Panasonic will insist on changing the button layouts in every iteration of this camera, so if you buy the rather pricey underwater case, don't imagine that you'll be able to use it for the next version of this camera.)Added 4/7/14:  I bought the underwater case for a diving/snorkeling expedition.  The good news is that the case does keep the camera dry and sand-free.  The desiccant packet keeps the camera from fogging.  And the fast shutter response is very helpful for getting shots of fish.  A few observations:  1.  The movie/shutter buttons are very easy to confuse.  On the camera, the movie button is slightly recessed to help avoid this, but with the underwater case, no such design elegance.  There really aren't enough tactile clues to guide you when picture taking. You will end up taking a lot of very, very short movies by accident.  And occasionally turn the camera off rather than take the picture.  2.  If you leave the GPS on while snorkeling, it apparently will go bug house and drain the battery dry within twenty minutes flat.  If this happens, a giant eagle ray will swim by five minutes later.  You won't get a picture of the eagle ray.  You will mutter very, very bad words into your snorkel.  3.  The camera occasionally had trouble focusing from within the case when used on dry land.  Haven't figure why this happened yet.  Turning the camera off and then back on would fix this.  4.  The display isn't quite bright enough for accurate photography when viewed in bright tropical sun through the plastic of the underwater case.  Some kind of shade would be useful.", "Date": "October 17, 2013"}, {"Title": "LUMIX LCD MONITORS ARE VERY EASY TO DAMAGE AND IF YOU DO PANASNIC WILL NOT HONOR THE WARRANTY", "Author": "Mark Wright", "ReviewID": "RZPHEV3FMTZOJ", "Overall": "1.0", "Content": "Lumix cameras have great lens quality and are otherwise excellent cameras BUT in my experience (twice now) they ALL have one MAJOR problem - the LCD Monitor is very very easy to damage with even careful day to day use. The one I have now has the tiniest mark on it and this was judged to be \"my fault\" and therefore NOT to be covered by the warranty. So $300 down the drain. No problem! Now you can say I should have been more careful etc etc etc it is my fault etc etc etc and I am just whining and belly aching. Fine. BE WARNED THOUGH I have been very careful with both cameras and they both had the same issue. My point is they are VERY easy to damage with day to day careful use. Panasonic want you to wrap them in cotton wool before they will honor the warranty. I have had two Nikons for 4 years and still going strong  - daily careful use - no issues at all. SO BE WARNED - IF YOU BUY A LUMIX / PANASONIC get ready for the LCD screen to let you down.You have been WARNED.", "Date": "December 2, 2013"}, {"Title": "Camera", "Author": "Dr. Sandra La Peter", "ReviewID": "R15AJ90GA8BJN7", "Overall": "4.0", "Content": "I bought this Panasonic lumix to replace a three year old lumix which was taken out of my checked luggage on a Delta flight. I loved the this camera,, and this new one is not as good. The on/off buttons and the other ones are too small and hard to operate.", "Date": "January 3, 2014"}, {"Title": "small but good", "Author": "Carrieinwi", "ReviewID": "R6NTPZB2RIYDJ", "Overall": "4.0", "Content": "I wanted a small digital camera that I could take on short plane trips.  This fits the bill.  While it is small, fits in my bag or pocket, it takes sharp, clear photos.  It has the option for wide angle and zoom photos in addition to the standard angle.I wish that it had a view finder and the second shot speed was a little faster.  But, over all this is a good camera and I would recommend it to a friend.", "Date": "June 19, 2013"}, {"Title": "great camera", "Author": "globalove \"karim djkreemy\"", "ReviewID": "RSH4V0AIWRRKX", "Overall": "5.0", "Content": "best on the market for the under $500 range. basically a Lieca branded by panasonic. love the quality and ease.", "Date": "June 4, 2014"}, {"Title": "Beautiful camera", "Author": "Maria I. Villasenor", "ReviewID": "R31P2NBPALLEH", "Overall": "5.0", "Content": "Love this Lumix camera. Have always been very fond of the Lumix Panasonic cameras because of their Leica lenses. Great shots and wireless mode. I carry this in my purse and us always with me. This is the 4 th one I buy.", "Date": "May 30, 2014"}, {"Title": "Awesome Camera", "Author": "dahank \"dahank\"", "ReviewID": "RW2X545HSU1HV", "Overall": "5.0", "Content": "Bought this camera to replace my old ones (Canon & Sony) which both had dust spots on the lenses/mirror which I could not get rid of.  This camera was the easiest to learn by far and takes great zoom photos!  Hopefully it will remain dust free.  Definitely recommend.", "Date": "May 28, 2014"}, {"Title": "Really great quality", "Author": "Roberto Rodrigues", "ReviewID": "R3U46ZH2EEK6ND", "Overall": "5.0", "Content": "This was a kind of surprise for me ... made a lot of research but still I was not so confident on the GPS ... but it really works fine, does not consume that much batterie ....Another aspect that is amazing is the flash quality which is subtle enough to not blank a close subject.The only thing that would be improved is the power button .... it would be a little higher and easy to find ....", "Date": "May 28, 2014"}, {"Title": "Big beautiful pics with a little camera", "Author": "RoadWarrior", "ReviewID": "R1NYJEXSZOS0Q2", "Overall": "5.0", "Content": "I had a smaller Lumix in the past and loved it.  When this one arrived, I wasn't sure if I would like the size.  It is a little bigger but still fits in my little running pack.  I really like it though.  The expanding lens is really helpful to zoom in.  I have been taking amazing pics with this little camera.", "Date": "April 24, 2014"}, {"Title": "Good camera", "Author": "anwor", "ReviewID": "R3PWFLDENDOG17", "Overall": "3.0", "Content": "It is good ,but photo not too sharp ,I expect more qulity ,still not what I want,price it good worth it", "Date": "April 12, 2014"}, {"Title": "Works great no disappointments", "Author": "frank loverso", "ReviewID": "R23K4A4I1MJLX", "Overall": "5.0", "Content": "Great camera to buy. Chose to buy this model because it was rated number 1 by customer reviews. Great features.", "Date": "April 7, 2014"}, {"Title": "Best camera I have ever owned.", "Author": "Ray", "ReviewID": "R2UY9I3IFUO55P", "Overall": "5.0", "Content": "Headline says it all! Panasonic make the best cameras around. I currently have three different models. The ZS30 has by far the best video I have seen on any camera including a NEX5 and 5D that my friend uses.", "Date": "March 15, 2014"}, {"Title": "Great camera!!!", "Author": "Anthony  T", "ReviewID": "R2QY649ABLLGCS", "Overall": "5.0", "Content": "Finally got a camera that is true point and shoot! BUT it also has great zoom and video features too.", "Date": "January 11, 2014"}, {"Title": "Excellent Choice", "Author": "Enrico", "ReviewID": "R1CE39ZUVXACBL", "Overall": "4.0", "Content": "The only thing i would consider is that the WEB services that the Lumix web page manages doesn't consider DropBox.Its my second LUMIX camera and wouldn't go any other way !", "Date": "January 6, 2014"}, {"Title": "Lumix Pocket Camera", "Author": "Carl E. Kohn", "ReviewID": "R3DBL4WY9H3GFP", "Overall": "4.0", "Content": "The camera was delivered in a few days in great condition.I was surprised that it needed a memory card out of the box, but I love the functionality in such a compact package, though it is definitely bigger in all directions than my trusty Lumix ZR3.  High zoom and stable, clear pictures.I was disappointed that the extra batteries from my broken Lumix ZR3 are so similar but do not fit.  The main fault with this camera is that it does not have an optical viewfinder.  Using it in the sun on the beach is nearly impossible.", "Date": "December 14, 2013"}, {"Title": "Small size Great zoom, clear LCD", "Author": "Loretta Ramseyer", "ReviewID": "R1TESRSM4FNZ2Q", "Overall": "5.0", "Content": "I like that it fits in my purse and is easy to use with one hand only.  The LCD has crisp clear images almost as good what is seen with  an optical viewfinder.  I'm still loearning to use  all the features.", "Date": "July 29, 2013"}, {"Title": "Panasonic Lumix DMC-ZS30 Digital Camera (Black)", "Author": "David Kay \"videodave\"", "ReviewID": "R34KDSAL7BXH8S", "Overall": "5.0", "Content": "This camera has been amazing! I am on my 6th Panasonic Lumix and keep moving up to the next and newest model. This camera does everything and more then what I expect. I have recommended this camera to many friends and they are pleased.", "Date": "April 29, 2013"}, {"Title": "Lack of viewfinder made it impossible to use in bright light.", "Author": "SamanthaG \"SamanthaG\"", "ReviewID": "R33YP3DBV8IW21", "Overall": "2.0", "Content": "This went back!  I used it on a trip to the beach and the viewing screen was impossible to see outside.  So I had to aim in the general direction of whatever my subject was, but could see nothing.  I will say that the photo quality was very good, thus 2 stars, not one.  I don't understand how anyone with a more than casual interest in photography could tolerate this problem.  It's very difficult to find a small digital camera with a viewfinder, though there are several.  I realize that there's not much space on a \"pocket\" camera, but maybe a pop-up shade for the viewing screen could be added.  The viewing screen on my iPhone, though still a problem in the bright light, was better than this.", "Date": "January 18, 2014"}, {"Title": "Terrible pictures!", "Author": "Michael C. Rush \"rushmc\"", "ReviewID": "R3IQXSZC8IYM39", "Overall": "2.0", "Content": "This camera has great features, but the most important thing that ANY camera has to do is to take good pictures, and this one just doesn't.  This was my most disappointing purchase in a very long time.", "Date": "January 14, 2014"}, {"Title": "Good camera, No viewfinder???", "Author": "B. Taylor", "ReviewID": "R3UEDR44JFAV8Z", "Overall": "4.0", "Content": "Great camera, but no viewfinder available. The days of cheap looking snap shots is over due to inexpensive digital cameras, but I just don't understand why camera manufacturers expect that good pictures can be taken in BRIGHT SUNLIGHT without a proper VIEWFINDER. This is the one backward step I believe these companies take, or just ignore. To me, it just spoils the whole photo experience by leaving viewfinders out. I have one other \"point and shoot\" camera that has a viewfinder and one that, at least, offers a viewfinder as an extra accessory. This is not even possible with the ZS30, which is why I give it 4 stars instead of 5.", "Date": "March 10, 2014"}, {"Title": "buy this camera is an excellent investment and high quality and highly recommended. It is an excellent product,the best decition", "Author": "MARTIN TORRES", "ReviewID": "R2CFTLFSBQGZDZ", "Overall": "5.0", "Content": "buy this camera is an excellent investment and high quality and highly recommended. It is an excellent product,the best decition", "Date": "January 16, 2014"}, {"Title": "Poor Manual", "Author": "Gerard SWART", "ReviewID": "R2NL7YSEN4H9JV", "Overall": "3.0", "Content": "Very complicated and manual is not complete or too clearon explaining several functions,Especially the Wifi part is hardly described how it works.", "Date": "January 3, 2014"}, {"Title": "Point and Shoot", "Author": "John", "ReviewID": "R8HVLWNVG15D4", "Overall": "5.0", "Content": "I was looking for a easy to use point and shoot camera with GREAT optics. This Camera was exactly what I was looking for....just point and shoot with great results. The 20x zoom is awesome!", "Date": "November 13, 2013"}, {"Title": "A lot of camera packed into a small package.", "Author": "gerald", "ReviewID": "R2VJAFU7S1ZL7T", "Overall": "5.0", "Content": "I received the camera very soon after it was ordered. It was packed well and I really like the camera.  It takes good pictures and video and has a lot of features that I trying to learn. The telephoto isn't as good as on my big camera, but it didn't cost what the larger camera does.I think that this a good camera for anyone looking for a \"bridge\" camera.", "Date": "October 28, 2013"}, {"Title": "perfect case for ZS30 is the Case Logic TBC-412", "Author": "Fred Von Lohmann \"fvl\"", "ReviewID": "R3O9ZX9A2FBS1G", "Overall": "4.0", "Content": "Just got the camera, wanted to let people know that the Case Logic TBC-412 is a perfect fit (even tho it claims to be a \"video recorder\" case). Case Logic Pocket Video Case TBC-412", "Date": "August 21, 2013"}, {"Title": "Panasonic Lumic DMC-z30s", "Author": "kira", "ReviewID": "R32TYPUS4GYKG2", "Overall": "4.0", "Content": "still learning how to use all the features.  Images a little soft otherwise good. Recommend it. Leica lens. Easy to use.", "Date": "August 18, 2013"}, {"Title": "first Panasonic probably last buy Sony", "Author": "Jared P.", "ReviewID": "R23B21SPJFOP9L", "Overall": "1.0", "Content": "Touch screen never quite worked right then cracked with no damage to camera no drops or any thing to cause this. Picked it up on the third day I owned it and it had horizonal lines and then screen cracked as if before my eyes. I beleive this was either shipping damage or manufactuer defect. No response from seller and had to send off for repair still not back yet.", "Date": "January 3, 2014"}, {"Title": "Wow.....! Talk about a all rounder", "Author": "Stephen France", "ReviewID": "R3FJN04YPJIHOZ", "Overall": "5.0", "Content": "I love everything about this camera, there is nothing I dont like, the stills in any mode are crystal clear, the HD vid is great, night and low light shots are excellent, the vibration reduction actually works even when zoomed in tight, the slow speed recording is great when the subject is close, you can get creative and manually set, or just use the SCN function which covers just about any senario, this is my first Panasonic and I am sure will not be my last if they stick with this winning formulaAll this for such a low price, seriously go out and buy one!!!!!!!", "Date": "October 2, 2013"}, {"Title": "BIG LEARNING CURVE WITH THIS CAMERA", "Author": "Mark Childerhose", "ReviewID": "R2I86O077BIBBJ", "Overall": "3.0", "Content": "DIFFICULT TO LEARN HOW TO USE. SPENT 3 NIGHTS TRYING TO LEARN THE FEATURES. VERY ADVANCED. NOT A SIMPLE CAMERA TO USE.", "Date": "March 27, 2014"}, {"Title": "Panasonic Lumix DMC-ZS30 Digital Camera", "Author": "Lamar Phillips", "ReviewID": "R1US7WCJSO7RHM", "Overall": "3.0", "Content": "The reason I returned the camera is because even though it performed excellently, it developed a defect in the external lens shutter, which wouldn't open or close completely. Personally, I don't think such a shutter is necessary, unless there's something I don't understand about its purpose. At any rate, the shutter should be improved so as not to malfunction. Having said this, I can unreservedly recommend the camera per se.", "Date": "February 24, 2014"}, {"Title": "Panasonic quality again", "Author": "Jeffrey M White", "ReviewID": "R2SVT47EJPWY7X", "Overall": "5.0", "Content": "Great pictures and still compact. A lot of features that you can either turn on or off. Leica lens makes the difference.", "Date": "January 3, 2014"}, {"Title": "This camera is really fantastic", "Author": "R. Cruz \"RC\"", "ReviewID": "R1L9AKX3OFPHL1", "Overall": "4.0", "Content": "I have had the Panasonic LUMIX DMC-ZS30K for about 2 weeks now and I'm extremely pleased with it.Pros:* The closeup and long zoom shots are incredible.  I have pictures of tiny insects almost invisible to the eye where you can see their tiny claws very clearly and see their transparent guts. These closes-ups are better than I can get with a semi-pro Nikon SLR.* It also has a great multi-frame capability which works well for capturing sport action.* The multi-frame capability can be set in intelligent mode and it will take additional pictures when it detects motion.  This has to be one of the best features I have ever found in a camera.  I got really great shots of people moving by the camera doing extra work.* It detects backlight conditions and take a few pictures to auto-correct it.* It is surprisingly light in weight.Here are the cons that I have found so far:* This camera advertises itself as 18Mpixels but that is only at 4:3 ratio which looks awful in today's 16:9 displays.  If you want 16:9, then the megapixel count drops to 13.  I didn't see this reported anywhere so one less star given because of what I consider deceiving advertising.* Battery life is so so.  You can probably take about 300 pictures with the GPS on (I haven't tried it with it off yet). This goes quickly in one day with my method of shooting.* The touch screen feature is not very useful for me and I take more unintended shots by touching it.  I haven't found a way to disable it.* I wish the video record button would have been placed on the back of the camera instead of top.  Just slightly annoying to have to look for it but you get used to it.* Finding the camera was hard.  Appears to be in short supply.  I paid more than MSRP and Amazon doesn't appear to carry it.I would consider buying this camera again as a gift for parents and kids since it is so good.", "Date": "October 1, 2013"}, {"Title": "My favorite compact camera", "Author": "Ronald E. Reaves \"Ron Reaves\"", "ReviewID": "R3P71E50BV8C12", "Overall": "5.0", "Content": "THe Panasonic Lumix Z series outdoes itself with each advancement with its precision pictures and broad use. For a compact, it compares favorably with largser DSLR's.", "Date": "October 8, 2013"}, {"Title": "Lumix Masterpiece", "Author": "John M McCombs", "ReviewID": "R1DZP1TL08AKGZ", "Overall": "5.0", "Content": "It's everything we wanted in a new camera.  it operates fast and efficiently and the GPS is amazing.  Very happy..", "Date": "October 4, 2013"}, {"Title": "WI-FI", "Author": "STEVEN H SPARKS", "ReviewID": "R2VRRYSGAQMA1Q", "Overall": "4.0", "Content": "I like my ZS30. My previous Panasonic was a ZS10. I can't get the WI-FI to connect to my home network.", "Date": "October 2, 2013"}, {"Title": "Customer Service Lacking--Probably will not buy another Panasonic product", "Author": "Mali", "ReviewID": "RADTJP0NYC9YO", "Overall": "2.0", "Content": "My camera was getting an orange tint, so wrote an email asking for recommendations as to recommended setting changes, or to advise me as to what could be occurring.  I actually asked 3 questions, which none of them were answered, and instead received a response to do a reset, and if that wouldn't work, to mail it back and they would send a \"reconditioned\" camera replacement.  This camera is less than two months old, and they are going to send a \"reconditioned\" camera, and not a new one?!!  I had registered the camera, so they knew that I had not had it very long.  Thankfully, I read through the Owner's Manual and was able to find something that assisted me with the settings, so I am glad I did not \"reset\" the camera to the default settings.The response I received from Panasonic is below:\"We regret hearing that your product is not operating properly. Please reset the camera through the setup menu. If this does not resolve your issue then based on the information you have provided, we recommend the product be sent to our Customer Service Center in McAllen Texas. In accordance with the warranty, the product will be replaced with a reconditioned model. If out of warranty then a fee will apply. Please send a copy of the original sales receipt (if under 1 year warranty) along with a letter to explain the problem.\"", "Date": "May 19, 2014"}, {"Title": "If it is half as unreliable as my ZS20, keep looking", "Author": "Basenjis Rule", "ReviewID": "RLWDDDUGASDQ5", "Overall": "2.0", "Content": "I bought the ZS20 after reading the great reviews.  At first, I was impressed but then 9 months later I had the first problem.  The lens cover was not fully opening.  Ruined most photos from a vacation grip.  I returned it for warranty service.  The service was terrible.  I had to wait more than a month to have the camera back.  (This after I called and wrote to complain.)  Now six months later, on another great vacation of a lifetime, the camera did the same thing and got even worse.  Same problem.  When I contacted Panasonic I was told I am SOL because it is out of warranty.  Almost $300 I paid and wasted on this camera.  I did not use this camera everyday and it failed twice and gave me terrible pictures.  So guess what... goodbye Panasonic and hello to a real camera maker such as Canon.", "Date": "April 24, 2014"}, {"Title": "Great Camera. You can spend 6 times more and by a big camera the resaults are not going to be much different.", "Author": "M. M. Bayegan", "ReviewID": "R3D0R806K8X0OF", "Overall": "3.0", "Content": "I had a Leica VLUX40 which was basiclly the same camera except ZS30 has more features.The Leica cost twice as much and lasted only a few months some particals apeared inside the lense and could not be repaired and being discontinued Leica did right thing and refunded the purchase priece.I am more pleased with ZS30 it has more features. I just hope the lense will hold up. Lense is Leica!!!!!", "Date": "February 18, 2014"}, {"Title": "Great gadget; bad camera experience", "Author": "Sathya P. Vasudeva \"washman007\"", "ReviewID": "R3SL0E2XOO1CTA", "Overall": "3.0", "Content": "I really like how advanced the camera is with its features but I really didn't like how slow the display respond in low light. Returned....", "Date": "October 2, 2013"}, {"Title": "Great lens but rest of the camera isn't worth the money.", "Author": "dan broadfield", "ReviewID": "R1M6U19DPMU57M", "Overall": "3.0", "Content": "Camera breaks easily. I slipped on a step while holding camera and it hit a corner from about 18 inches. Camera was broken beyond repair. Bought another one and after correctly putting on a screen protector, the LED touch screen fragmented over the entire screen. Had a Canon ELPH and an Olympus Stylus that both took more abuse over a 5 year period. The Leica lens on the Lumix is great, but I don't see much difference between 12 megapixels on the Canon and the 18 megapixels the Lumix is supposed to have. All of the wifi connectivity and other bells and whistles are more trouble than they're worth. without the Leica lens I'd only give it 1 star.", "Date": "December 4, 2013"}, {"Title": "Great camera but WIFI doesn't work, poor tech support, poor App", "Author": "D. May", "ReviewID": "RDURXKCGU0092", "Overall": "1.0", "Content": "This camera has some great innovations, but couldn't get wifi to work, and the Panasonic Image App is crap.  I spent a long time on the phone with Panasonic Tech Support, and finally had to ask the support agent if he had ever used this camera.  He said no.I was able to use the Panasonic Image App to send one picture at a time to my Nexus 7 for 3 pictures, but now I've tried an hour to transfer the 4th pic and can't.  It took a lot of trial and error for each of the 3 stills I've managed to up load.  The App has a poor, confusing user interface, and the support rep did not understand the problems I was having with it -- he had probably never tried to use the app.If Panasonic could just channel a little Steve Jobs, I could give the camera 5 stars; but everything about Panasonic seems to have sloppy software.  Like the locator for the nearest service center.  Enter the Zip Code and Model, and it forgets your information and gives you back the same screen with no error message.  Also, it is time consuming to input the password to your wifi, and Panasonic does not remember what you entered, so you have to go through the slow pain of the poor entry system repeatedly.  Show password does not work.Also, the PDF manual is unclear on connecting with wifi or NFC.I get the impression the company has been taken over by propeller heads who don't respect the users' time, and a CEO who obviously doesn't use the stuff he makes.", "Date": "August 19, 2013"}, {"Title": "Poor Image Quality", "Author": "Ed Straker", "ReviewID": "R255P6RF0ZLLCW", "Overall": "1.0", "Content": "Had my ZS30 for one day before returning it. Has excellent features and boots quickly but the image quality was \"soft\" (i.e bad). Even my Lumix SZ7 produces better images and it's much slimmer. I only shot full auto mode with the ZS30 and didn't experiment with other settings. Subsequently purchased the Nikon P330 and am much happier with the results. Not sure about the ZS30 but the Nikon also has RAW capabilities.", "Date": "April 14, 2013"}, {"Title": "Be careful with \"Electronics Basket\" seller..", "Author": "Marcos", "ReviewID": "R1Y9A73O3ZTZVZ", "Overall": "1.0", "Content": "After searching a lot for the camera that I bought in silver, \"Electronic Basket Seller\" appeared as potential sellers and bought camera which sent to a mailbox that has a friend in Miami which is airline pilot and when he traveling, collects and brings to Chile orders them removed from boxes to avoid problems with customs.Unfortunately, they sent the camera in black which does not correspond to the request in order.Now what can i do? I have the impression that with the goal of selling, disregarded the order and sent what they had in stock.Is an image issue negative for Amazon too..", "Date": "August 27, 2013"}], "ProductInfo": {"Price": "$435.19", "Features": "18.1MP High Sensitivity MOS Sensor 20x Leica DC Optical Zoom Lens; 24-480mm\n3.0\" 920k-dot Touch-Screen LCD Display Full HD 1080p/i Video with Stereo Mic\nBuilt-in Wi-Fi Connectivity with NFC Hybrid Optical Image Stabilization\n10fps Burst Shooting at Full Resolution Manual Exposure Control\n14 Built-in Creative Effects", "Name": "Panasonic Lumix DMC-ZS30 Digital Camera (Black)", "ImgURL": "http://ecx.images-amazon.com/images/I/51Jp1xYCQdL._SY300_.jpg", "ProductID": "B00B3YSW5W"}}