{"Reviews": [{"Title": "Great camera!!", "Author": "josie whales", "ReviewID": "R2JUOXGTGSJXPQ", "Overall": "5.0", "Content": "i have a 1 yr old daughter and i dont think i could find a better camera to help capture those precious memories. Its very user friendly (as i am no professional) and comes with everything you need.. Also this is the cheapest place i found it and had great fast shipping! Thanks Amazon!!", "Date": "April 30, 2013"}, {"Title": "Great price!!!", "Author": "Genoveva DeAnda", "ReviewID": "R13YT3VGYTUSE3", "Overall": "5.0", "Content": "I checked around for this camera locally and average price was about $290. When I saw this camera with everything it came with...didn't have to think twice!! Very happy with this purchase.", "Date": "April 28, 2013"}, {"Title": "Great camera for the price", "Author": "Valerie J. Obrien", "ReviewID": "R18QGMGDCH2DW8", "Overall": "5.0", "Content": "I wanted a new camera as an upgrade from my 8 megapixel camera.  I needed a camera that I could pack on my motorcycle trips that didn't need other lenses, or other parts.  The camera is simple to use, and takes great pictures", "Date": "June 13, 2013"}, {"Title": "Sometimes you win, sometimes you lose...This is a WIN", "Author": "jeff barton", "ReviewID": "R1YBIEA64L30SL", "Overall": "5.0", "Content": "After getting burned by a crappy olympus point and shoot, we really wanted a good camera. We have a 3 year old and a 1 year old and were missing their childhood. I had three requirements for a camera. Beautiful picture quality, easy menu/auto mode, and HD video recording. This camera nails all three. As far as the camera is concerned, put your fears to bed, because it just take darn good pictures for noobs like me.Second, all of the bundle that comes with it is pure frosting. It isn't pictured but our battery charger comes with a car adapter so you can charge on your way somewhere. So glad this ended up being a good purchase so I could maintain my confidence in on-line shopping.Woo hoo!", "Date": "June 6, 2013"}, {"Title": "Nice Camera and Bundle Package!", "Author": "Lena", "ReviewID": "R1LTBTO18SJZGG", "Overall": "5.0", "Content": "The camera bundle was the same price as ordering just the camera in the store so this is a super value (memory card and charger/batteries are the main values).  The tripod is small and I haven't used it yet.  Camera quality is exactly what I expected, clear and concise pictures.  Nice zoom and close ups.  Stable images.  Comes with a sturdy strap and lens cover.  Overall I'm very pleased and already took 400 pictures on a vacation and they turned out great.  The Nikon computer software to transfer pictures to is great also, nice image editing features.  For example, I had some crooked pictures I took while driving, and the software lets me straighten them up.  Dark pictures can be lightened nicely. Love it!", "Date": "July 4, 2013"}, {"Title": "Nice camera for the $", "Author": "J. L. Maddock \"Tool Coveter\"", "ReviewID": "R1RFNHV72IATRC", "Overall": "5.0", "Content": "I'm bumping up from your typical $100 digital pocket camera, and the L820 works great! I've tried macro shots as well as landscapes, awards ceremony, and living room close-ups. I really like the continuous mode. It snaps right along, much faster than my daughter's L120. In pet mode I'll take 20 continuous pics of one of our cats and at least 3 or 4 shots are keepers. Being digital, I toss the rest. I love digital.The zoom is neat. Our horses used to see me in the field trying to get close enough to take pictures....in the past they'd get curious and keep walking up to me instead of staying still. Now with the zoom, they don't have a clue & I get great pictures.Cons? Well, I guess I'd like it lighter/smaller & I might like full manual controls to play with. The other camera I considered was the Canon SX500. While it was smaller/lighter & came with a full manual mode, the L820 shoots significantly faster (8 fps versus 0.8 fps). That was important to me.Any other cameras I would have considered were $400ish. This deal from Beach Camera came with 16 gig SD memory, a small tabletop tripod, lens cleaning supplies, batteries and chargers, and a camera bag for less than $250! The bag was so-so, and I bought a Case Logic DCB-304 for $10 to use instead. Still a good deal.The resolution is great for the $. I like the idea of a DSLR, but most times I really just want a point & shoot. I get a little bit of control to play which seems to be enough. Occasionally  I would like to be able to manually focus, but that's not a show stopper.", "Date": "June 7, 2013"}, {"Title": "So easy to use", "Author": "Gayle Bedwell", "ReviewID": "R33TUKN7MMN80X", "Overall": "5.0", "Content": "This camera is amazing. Ready to go straight from the box by having the Super Bundle Kit with all you need.I have used other Nikon Point and Shoot cameras but the features on this one makes the convenience level of having \"All you need\" in one camera worth it. Instead of having to carry my SLR with extra lenses, my smaller point and shoot AND my camcorder all I need is this one small camera.The colors are flawless, the action is stopped for capture, and the low light CMOS sensors make it seem like you're using the best flash available.The only feature I don't like is you have to use your screen to see what you're capturing and it doesn't move. If it moved or if you could look thru a viewfinder this would be the total ultimate camera.But for the price, I am extremely happy.", "Date": "June 7, 2013"}, {"Title": "Great Buy", "Author": "Kathleen J. Graffius", "ReviewID": "R30L045KRRH3K5", "Overall": "5.0", "Content": "I have been using this camera now for about 1 month. I love it, the pictures are really great, clear crisp and many options to choose from.I haven't found anything that I don't like yet.I am still learning about this camera, the different kinds of pictures you can take and the different light. Great on low light pictures too.I am very pleased that I got this one. I read a lot of the reviews and there are a lot of complaints about the lens cap, I haven't had any problems and it doesn't get in the way when taking pictures.I would recommend this camera, great price, great quality and pictures that I can enjoy forever!!", "Date": "January 2, 2014"}, {"Title": "I loved!", "Author": "Nathalia", "ReviewID": "R79HBNVKQMBGQ", "Overall": "5.0", "Content": "This camera is definetely the best christmas gift I could give! My sister loves me even more! haha... The color temperature is perfect, the image is clear and clean, focus and zoom impeccable. Great acquisition!", "Date": "December 30, 2013"}, {"Title": "Nikon COOLPIX L820", "Author": "M. Rentfrow \"Child of Christ\"", "ReviewID": "RUK1JVN10YFBK", "Overall": "5.0", "Content": "Very nice camera for the price! It arrived in a couple days. My husband loves this camera. The 30x zoom will work well on.our next trip to Alaska viewing the Polar bears!", "Date": "December 25, 2013"}, {"Title": "Best camera I've ever had", "Author": "William Day", "ReviewID": "R3649WJKXBV4TD", "Overall": "5.0", "Content": "The best review I can give is my wife has a Nikon point and shoot and thought it took great pictures and was easy to use.  She thinksthis one is as good if not better.", "Date": "October 10, 2013"}, {"Title": "Nikon", "Author": "Gayle Goolsby", "ReviewID": "R7Q9XW40ZTV0Z", "Overall": "5.0", "Content": "I have been using Kodak products for years & the last 2  Kodak cameras I bought didn't last long  because the button you push to take pictures tore up, so I decided to try  the Nikon...Wish I had of changed sooner...Very good product....", "Date": "September 24, 2013"}, {"Title": "Nikon Rocks!", "Author": "P. Porter \"Pam Porter\"", "ReviewID": "R3RKIBEIFB2AY7", "Overall": "5.0", "Content": "This camera is awsome!  I received it 3 days after ordering (in a week with a holiday).  Took it out of the box and literally started shooting pictures. Both the wide angle and long distance shots are unbelievable.  I have pictures of birds in my trees from 70 feet away and they look like they are right next to me.  Very easy to use and download pictures.  Mine came from Beach Camera in New Jersey, They bundle with several accessories including rechargeable batteries and a charger for the car. Highly recommend this Amazon Marketplace vendor and the products they sell.", "Date": "September 8, 2013"}, {"Title": "Cheap", "Author": "Mokesh", "ReviewID": "R60B18G2O3FQ5", "Overall": "5.0", "Content": "i liked itit was cheapall products in packsatisfiedeasy to usegood lookingIt is a good", "Date": "September 4, 2013"}, {"Title": "Works well", "Author": "Tammera Giese \"tamme\"", "ReviewID": "R3VIX9DZOLRXVH", "Overall": "4.0", "Content": "My 13 year old likes it better than I do, she has found the choose a feature easier to use than attempting to set it on your own.", "Date": "September 3, 2013"}, {"Title": "very nice camera so far.", "Author": "Tim \"clutch\"", "ReviewID": "R357F0UXOYL5ZQ", "Overall": "4.0", "Content": "Love the zoom but don't care for haveing to set digital screen via button controls for programing ,like the manual mode with wheel on camera just click wheel to setting and it stays there and there is no view finder just display on screen ,have to read more to get accustomed to it but over all its great camera.", "Date": "September 1, 2013"}, {"Title": "Amazing!!!!", "Author": "Cathy", "ReviewID": "R29H64Q160Q66I", "Overall": "5.0", "Content": "I received this item within 2 days of purchasing it. The camera is AWESOME!!!! I'm so used to the little point and shoot cameras, so it did take me a little while to get used to it, but overall, it does everything that I love in a camera. I'm able to get the most amazing pictures from far away. Definitely recommend!!!!!", "Date": "August 31, 2013"}, {"Title": "Quality of Camera and supplies", "Author": "David Powell", "ReviewID": "R16LYP86GAC723", "Overall": "4.0", "Content": "The camera takes really good pictures. I need some more time to learn the focusing of video at sports events. I have not used that much yet but what I took and kept were good.  The charger back up is good except  camera showed Battery Exhausted and I put batteries in charger and charger shows batteries green, but were not as camera showed batteries exhausted. I put batteries back into charger for and hour, light showing green (no red light came on). I then put batteries back into camera and shows fully charged. Now I need weekend to do more filming and see how batteries hold up.  Overall the camera is worth the buy and I would recommend  to anyone.Also Alkaline batters with camera held up good but not rechargeable", "Date": "August 30, 2013"}, {"Title": "Great product for the money!", "Author": "John Menold", "ReviewID": "R3IHOU52TGFZ1O", "Overall": "5.0", "Content": "I bought this for my wife for a birthday present...I was worried she would think it was too big and bulky because she had always carried a small one.  She LOVES it and didn't think it was bulky at all for how well it works.  She has taken more pictures/movies with this thing in the 4 months she's had it than the last 10 years and just can't get over how good the quality is without even trying!  She/we love the movie feature and that you can zoom while taking the movie.", "Date": "August 26, 2013"}, {"Title": "Fabulous purchase!", "Author": "Candace Gartside", "ReviewID": "R3VZVVXG61816Z", "Overall": "5.0", "Content": "I bought this camera for my daughter as an engagement gift. She LOVES it! Great pictures, easy to use, and compact enough to travel comfortably with!! I highly reccommend it!", "Date": "August 20, 2013"}, {"Title": "Excelent deal", "Author": "Miguel Alvarado", "ReviewID": "R1ETX8KZ2OK6BO", "Overall": "4.0", "Content": "Every thing was great with this deal with the exception of the camera gadget bag that did not last to long.", "Date": "August 15, 2013"}, {"Title": "Excellent camera!!", "Author": "Beth Molesworth", "ReviewID": "R1TSK78J6K392Q", "Overall": "5.0", "Content": "I Love this camera!! I'm in West Yellowstone with beauty all around me and this camera is capturing all of it!! Thank you so much!", "Date": "August 6, 2013"}, {"Title": "nice camera made a good choice", "Author": "cr1sp3r", "ReviewID": "RHMKNT10C2P6C", "Overall": "5.0", "Content": "i switched from a sony tx7 to this one because of the zoom and im happy i did, it came with a starter set of batteries( alkaline), i used it for 2 days taking pictures and videos and it still shows the battery icon full thats a wow compared to my sony tx7 that hardly lasted one day, i watched alot of review videos and read blogs before buying this camera and i chose this one over the olympus and canon on the same price range, about the zoom i didnt like was that it zooms like 25x optical and the rest digital but it not a huge deal for me, and if you turn on the camera with the lens cap on it gives you a eror msg so you have to turn off remove the cap and then turn on, but overall so far i like this camera it makes me feel like a pro because of the look...oh and in image quality i think its about the as my sony tx7 and the tx7 is a 10.1mp but its cool i dont regret buying it....", "Date": "August 4, 2013"}, {"Title": "Impressive", "Author": "Anna Zheng", "ReviewID": "RFYX8AJPS0JPZ", "Overall": "4.0", "Content": "The package is amazing. The camera came in perfect condition, and the bag and batteries and everything that came with it was perfect. The only thing I was slightly disappointed was the tripod is really small.", "Date": "July 31, 2013"}, {"Title": "Love the camera but...", "Author": "7gables", "ReviewID": "R35DTQL7ODYRQV", "Overall": "4.0", "Content": "The package arrived safely and on time.  I love the camera and all the other extra items in the package EXCEPT for the camera case, which was described as a \"compact deluxe gadget bag\".  It is made out of a cheap synthetic that has a very bad smell.  Because the package was a good value I will probably keep it, but I am disappointed that I will have to purchase another camera case.", "Date": "July 11, 2013"}, {"Title": "Wise purchase!", "Author": "Gary", "ReviewID": "R3THBEMCJ71UFF", "Overall": "5.0", "Content": "Camera takes beautiful, sharp pictures.  Also, very easy to operate.  The bundle that came with the camera was the icing on the cake.  Shipping was fast.", "Date": "June 26, 2013"}], "ProductInfo": {"Price": "$229.00", "Features": "coolpix l820\n16gb high speed card\ncase\nauthorized dealer", "Name": "Nikon COOLPIX L820 16 MP Digital Camera with 30x Zoom (Black) Super Bundle Includes 16GB Memory Card, AA Rapid Multivoltage AC/DC Charger w/ 4 3100mah AA Batteries, Flexible Mini Table-top Tripod, Compact Deluxe Gadget Bag, and Lens Cleaning Kit.", "ImgURL": "http://ecx.images-amazon.com/images/I/51vZ-aaRBxL._SY300_.jpg", "ProductID": "B00BJ8XKVS"}}